[{"url": "https://en.wikipedia.org/wiki/Proteus_(bacterium)", "passage_text": "Proteus includes pathogens responsible for many human urinary tract infections. P. mirabilis causes wound and urinary tract infections. Most strains of P. mirabilis are sensitive to ampicillin and cephalosporins. P. vulgaris is not sensitive to these antibiotics. "}, {"url": "http://www.umich.edu/~hltmlab/research/mirabillis/infection.htm", "passage_text": "Complicated Urinary Tract Infection. P. mirabilis is not a common cause of UTI in the normal host [12]. Surveys of uncomplicated cystitis or acute pyelonephritis show that P. mirabilis comprises only a few percent of cases. Even in patients with recurrent UTI, the incidence of infections by this organism is only a few percentage points higher."}, {"url": "http://web.uconn.edu/mcbstaff/graf/Student%20presentations/Proteus/Proteus.html", "passage_text": "Picture from http://www.denniskunkel.com. Life History: Proteus mirabilis is part of the normal flora of the human gastrointestinal tract. It can also be found free living in water and soil. When this organism, however, enters the urinary tract, wounds, or the lungs it can become pathogenic."}, {"url": "http://web.uconn.edu/mcbstaff/graf/Student%20presentations/Proteus/Proteus.html", "passage_text": "Proteus mirabilis is part of the normal flora of the gastrointestinal tract, and as a result the bacteria enters the urinary tract or infects medical equipment by the fecal route. Proteus mirabilis is part of the normal flora of the human gastrointestinal tract. It can also be found free living in water and soil. When this organism, however, enters the urinary tract, wounds, or the lungs it can become pathogenic."}, {"url": "http://rci.rutgers.edu/%7Emicrolab/applied%20micro/schedulelinks/tsi.htm", "passage_text": "Salmonella & Proteus (A & D) ferment the glucose (present in low concentration) but do not ferment the lactose or sucrose. These organisms use the protein at the aerobic surface of the slant as a carbon source, the pH increases and the top of the slant becomes red. The black is due to hydrogen sulfide production. Substantial hydrogen sulfide production by Proteus mirabilis makes it difficult to determine color in the butt of the slant."}, {"url": "http://ghr.nlm.nih.gov/condition/proteus-syndrome", "passage_text": "Proteus syndrome is a rare condition characterized by overgrowth of the bones, skin, and other tissues. Organs and tissues affected by the disease grow out of proportion to the rest of the body. The overgrowth is usually asymmetric, which means it affects the right and left sides of the body differently. "}, {"url": "https://en.wikipedia.org/wiki/Proteus_mirabilis", "passage_text": "Proteus mirabilis appears as Gram-negative rods after Gram staining under bright-field microscopy with 1000 times magnification. Proteus mirabilis is a Gram-negative, facultatively anaerobic, rod-shaped bacterium. It shows swarming motility and urease activity. P. mirabilis causes 90% of all Proteus infections in humans. It is widely distributed in soil and water. "}, {"url": "http://www.webmd.com/drugs/condition-9387-Proteus+Mirabilis+Urinary+Tract+Infection.aspx", "passage_text": "Considering taking medication to treat Proteus Mirabilis Urinary Tract Infection? Below is a list of common medications used to treat or reduce the symptoms of Proteus Mirabilis Urinary Tract Infection. Follow the links to read common uses, side effects, dosage details and read user reviews for the drugs listed below. "}, {"url": "http://microbewiki.kenyon.edu/index.php/Proteus_mirabilis", "passage_text": "P. mirabilis is a gram-negative, rod-shaped bacterium that can be found as part of the micro flora in the human intestine. This organism is not usually a pathogen, but does become a problem when it comes into contact with urea in the urinary tract. From there, infection can spread to other parts of the body. P. mirabilis has a bacillus morphology and is a gram-negative bacterium. It is motile, alternating between vegetative swimmers and hyper-flagellated swarmer cells (Belas, 1996). It also makes a variety of fimbriae."}, {"url": "http://faculty.ccbcmd.edu/courses/bio141/labmanua/lab3/embproteus.html", "passage_text": "Proteus vulgaris Growing on EMB Agar. Only gram-negative bacteria grow on EMB agar. Gram-positive bacteria are inhibited by the dyes eosin and methylene blue added to the agar. Because Proteus vulgaris does not ferment lactose or produce acid, their colonies appear grey on EMB agar. Photograph from MicrobeLibrary.org Courtesy of Naowarat Cheeptham and Carolynne Fardy, Thompson Rivers University."}]