[{"url": "http://www.chicagotribune.com/sports/basketball/bulls/ct-kirk-hinrich-less-money-bulls-spt-1003-20141003-story.html", "passage_text": "I thought about it hard. I really did, said Hinrich, who signed a two-year, $5.5 million deal. When you're offered more money, no matter what you say, it's hard to turn down. But when you go through the thought process, you just come back to what's most important. I feel like I've been smart with my money. Hinrich will have made north of $70 million for his career when this current two-year deal that contains a player option expires, so he's in a position to make judicious choices."}, {"url": "http://www.celebritynetworth.com/richest-athletes/nba/kirk-hinrich-net-worth/", "passage_text": "He earned NBA All-Rookie First Team honors in 2004 and the NBA All-Defensive Second Team honors three years later in 2007. Hinrich played on the U.S. men's national team, appearing at the FIBA World Championships in Japan in 2006 and earning a bronze medal. Hinrich has appeared in more than 50 postseason games, with his deepest run coming when the Bulls appeared in ten games in 2007. Hinrich has been married to his wife, Jill Fisher, since 2007. They have two children, daughters named Kenzie and Kyla, born in 2008 and 2011. He attended the University of Kansas from 1999 until 2003, where he earned third-team All-American honors during his final season with the Jayhawks. The Chicago Bulls drafted Hinrich with the seventh overall pick during the first round of the 2003 NBA Draft."}, {"url": "http://www.therichest.com/celebnetworth/athletes/nba/kirk-hinrich-nba-net-worth/", "passage_text": "About Kirk Hinrich (NBA). Kirk Hinrich is a professional American basketball player whose net worth is estimated to be around $27 million as of March 2014. Kirk Hinrich’s career began when he was seven years old, and attended a summer camp. During his participation in the camp, he excelled by playing against the older ones there. After a year with the Wizards, Hinrich was traded to the Atlanta Hawks in 2011. Then, he returned to the Bulls in 2012. Kirk James Hinrich was born on January 2, 1981 in Sioxi City, Iowa. He is married to Jill Fisher and has two daughters."}, {"url": "http://www.spotrac.com/nba/chicago-bulls/kirk-hinrich/", "passage_text": "Current Contract. Kirk Hinrich signed a 2 year / $5,586,940 contract with the Chicago Bulls, including $5,586,940 guaranteed, and an annual average salary of $2,793,470. In 2015-16, Hinrich will earn a base salary of $2,854,940. Hinrich has a cap hit of $2,854,940 while his dead money value is $2,854,940"}, {"url": "https://en.wikipedia.org/wiki/Kirk_Hinrich", "passage_text": "While playing college basketball for Kansas, Hinrich helped his team reach the Final Four in the NCAA basketball tournament in 2002 and the championship game against the Carmelo Anthony-led Syracuse University in 2003. Hinrich played all four years at Kansas before being drafted into the NBA. He is often referred to as  Captain Kirk  because he was voted as team captain for the Bulls for four consecutive years. Hinrich is the Bulls' all-time leader in three-point field goals."}, {"url": "https://en.wikipedia.org/wiki/Kirk_Hinrich", "passage_text": "When Hinrich was about seven years old, Jim Hinrich visited Ray Nacke, his old college coach, and asked if Kirk could enroll in Nacke's summer camp for fourth, fifth, and sixth graders. Despite Nacke's hesitations, Hinrich was allowed to attend the camp, and played well against the older children. He is often referred to as  Captain Kirk  because he was voted as team captain for the Bulls for four consecutive years. Hinrich is the Bulls' all-time leader in three-point field goals."}, {"url": "http://www.chicagotribune.com/sports/basketball/bulls/ct-kirk-hinrich-less-money-bulls-spt-1003-20141003-story.html", "passage_text": "Kirk Hinrich is the rare athlete who put his money where his mouth is to stay with the Bulls. It's not about the money. That's a comment that has been uttered countless times by athletes, often seemingly without much thought or conviction, followed by a signature on a contract with the most commas. Hinrich will have made north of $70 million for his career when this current two-year deal that contains a player option expires, so he's in a position to make judicious choices."}]