[{"url": "http://www.ehow.com/about_5049560_mchc-blood-test_.html", "passage_text": "MCHC and MCV, or mean corpuscular volume, levels are both used to test a person for anemia. MCHC tests for the levels of hemoglobin in the blood. This test is also referred to as an MCH test. "}, {"url": "http://answers.webmd.com/answers/1198045/what-is-mchc", "passage_text": "A. MCHC stands for mean corpuscular hemoglobin concentration. It’s the concentration of hemoglobin in the body’s red blood cells. MCHC is calculated by automated cell counters and may be reported as part of a complete blood count (CBC) test. The MCHC may be low in certain forms of anemia (such as iron-deficiency), normal in others ([vitamin] B12 deficiency), and high in other blood disorders (hereditary spherocytosis). Falsely high and falsely low results on an MCHC test are common."}, {"url": "http://www.mchcbloodtest.com/mchc-blood-test-what-is-it/", "passage_text": "A MCHC blood test is performed to test a person for anemia. MCHC (Mean Corpuscular Hemoglobin Concentration) is the calculation of the average hemoglobin inside a red blood cell. A MCHC test can be performed along with a MCV test (Mean Corpuscular Volume). Both levels are used to test people for anemia. The MCHC blood test is also known as the MCH blood test which tests the levels of hemoglobin in the blood. "}, {"url": "https://labtestsonline.org/understanding/analytes/rdw/", "passage_text": "MCV, MCH, MCHC, and RDW. These are measurements or calculations related to red blood cells (RBCs) and are components of the Complete Blood Count (CBC), a commonly requested test used for a variety of purposes. "}, {"url": "http://www.eclinpath.com/hematology/tests/mchc/", "passage_text": "The MCHC (mean corpuscular hemoglobin concentration) is the mean hemoglobin concentration in all the red blood cells (or is the percentage of the red blood cell that contains hemoglobin) and is usually a calculated value by dividing the hemoglobin by the red blood cell mass (HCT or PCV). "}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=9994", "passage_text": "MCHC: Abbreviation for mean cell hemoglobin concentration, which is the average concentration of hemoglobin in a given volume of blood. The MCHC is a calculated value derived from the measurement of hemoglobin and the hematocrit. "}, {"url": "http://www.mchcbloodtest.com/", "passage_text": "A MCHC blood test could be ordered for someone who has signs of fatigue or weakness, when there is an infection, is bleeding or bruising easily or when there is noticeable inflammation. The MCHC test is most commonly used to evaluate for macrocytic anemia. MCHC tests for the levels of hemoglobin in the blood. This test is also referred to as an MCH test. The symptoms of macrocytic anemia include: 1  Headache. 2  Fatigue. 3  Diarrhea. 4  Ataxia. 5  Tongue Soreness. 6  Reflex problems with deep tendons. "}, {"url": "https://en.wikipedia.org/wiki/Mean_corpuscular_hemoglobin_concentration", "passage_text": "The mean corpuscular hemoglobin concentration, a measure of the concentration of hemoglobin in a given volume of packed red blood cells. It is reported as part of a standard complete blood count. "}, {"url": "http://www.medicalhealthtests.com/articles/507/blood-tests/mchc-test.html", "passage_text": "A MCHC test is a test that is carried out to test a person for anemia. The MCHC in a MCHC test stands for Mean Corpuscular Hemoglobin Concentration. MCHC is the calculation of the average hemoglobin inside a red blood cell. A MCHC test can be performed along with a MCV test (Mean Corpuscular Volume). Both levels are used to test people for anemia. The MCHC test is also known as the MCH blood test which tests the levels of hemoglobin in the blood. The MCHC test can be ordered as part of a complete blood count (CBC) test."}]