[{"url": "https://en.wikipedia.org/wiki/Subduction", "passage_text": "Stable subduction zones involve the oceanic lithosphere of one plate sliding beneath the continental lithosphere or oceanic lithosphere of another plate due to the higher density of the oceanic lithosphere. Subduction zones dive down into the mantle beneath 55,000 kilometres of convergent plate margins (Lallemand, 1999), almost equal to the cumulative 60,000 kilometres of mid-ocean ridges."}, {"url": "https://en.wikipedia.org/wiki/Subduction", "passage_text": "Subduction zones are sites of high rates of volcanism, earthquakes, and mountain building. Orogenesis, or mountain-building, occurs when large pieces of material on the subducting plate (such as island arcs) are pressed into the over-riding plate or when subhorizontal contraction occurs in the over-riding plate. Subduction zones dive down into the mantle beneath 55,000 kilometres of convergent plate margins (Lallemand, 1999), almost equal to the cumulative 60,000 kilometres of mid-ocean ridges."}, {"url": "https://en.wikipedia.org/wiki/Subduction", "passage_text": "In geology, subduction is the process that takes place at convergent boundaries by which one tectonic plate moves under another tectonic plate and sinks into the mantle as the plates converge. Regions where this process occurs are known as subduction zones. Subduction zones dive down into the mantle beneath 55,000 kilometres of convergent plate margins (Lallemand, 1999), almost equal to the cumulative 60,000 kilometres of mid-ocean ridges."}, {"url": "http://hkss.cedd.gov.hk/hkss/eng/education/GS/eng/hkg/chapter6.htm", "passage_text": "The geological history of Hong Kong has been strongly controlled by changes in the plate tectonic setting over the past 400 million years. Significantly, there are major gaps in the geological record in Hong Kong, which probably reflect major changes in the tectonic regime of the region. Between 250 and 200 million years ago, there was a major tectonic event in China, possibly resulting from major plate reorganisation. This was accompanied by the intrusion of granite magmas. The older rocks in Hong Kong were strongly deformed."}, {"url": "https://en.wikipedia.org/wiki/Earthquake", "passage_text": "Intensity of shaking is measured on the modified Mercalli scale. The shallower an earthquake, the more damage to structures it causes, all else being equal. At the Earth's surface, earthquakes manifest themselves by shaking and sometimes displacement of the ground. When the epicenter of a large earthquake is located offshore, the seabed may be displaced sufficiently to cause a tsunami. Earthquakes can also trigger landslides, and occasionally volcanic activity. For instance, an earthquake of magnitude 6.0 releases approximately 30 times more energy than a 5.0 magnitude earthquake and a 7.0 magnitude earthquake releases 900 times (30 × 30) more energy than a 5.0 magnitude of earthquake."}, {"url": "https://en.wikipedia.org/wiki/Mid-ocean_ridge", "passage_text": "The buoyant melt rises as magma at a linear weakness in the oceanic crust, and emerges as lava, creating new crust upon cooling. A mid-ocean ridge demarcates the boundary between two tectonic plates, and consequently is termed a divergent plate boundary. The rocks making up the crust below the seafloor are youngest at the axis of the ridge and age with increasing distance from that axis. New magma of basalt composition emerges at and near the axis because of decompression melting in the underlying Earth's mantle."}, {"url": "https://en.wikipedia.org/wiki/Mid-ocean_ridge", "passage_text": "Mid-ocean ridges are geologically active, with new magma constantly emerging onto the ocean floor and into the crust at and near rifts along the ridge axes. The crystallized magma forms new crust of basalt (known as MORB for mid-ocean ridge basalt) and gabbro. The rocks making up the crust below the seafloor are youngest at the axis of the ridge and age with increasing distance from that axis. New magma of basalt composition emerges at and near the axis because of decompression melting in the underlying Earth's mantle."}]