[{"url": "http://allrecipes.com/recipe/21766/roasted-pork-loin/", "passage_text": "1 Place pork loin into oven, turning and basting with pan liquids. 2  Cook until the pork is no longer pink in the center, about 1 hour. 3  An instant-read thermometer inserted into the center should read 145 degrees F (63 degrees C). 4  Remove roast to a platter."}, {"url": "http://kitchenconfidante.com/roast-pork-loin-with-balsamic-dijon-thyme-recipe", "passage_text": "Sear on all sides, about 3-4 minutes per side. Place in oven and roast for 45 minutes, or until the internal temperature of the pork loin roast is about 145 degrees F. Allow 3 minutes of rest time before slicing. Grill preparation: Preheat the grill to medium high heat. If desired, use a cast iron pan, but you can also prepare this directly on the grill grates."}, {"url": "http://www.cooks.com/rec/search/0,1-0,pork_loin_cooking_time,FF.html", "passage_text": "Did you mean: pork loin. Results 1 - 10 of 21 for pork loin cooking time. Result Page: 1 &nbsp 2 &nbsp 3 &nbsp Next. 1. PORK LOIN ROAST WITH BROWN SUGAR GLAZE. Season a 5 to 6 pound boneless pork loin roast with salt ... will clear the cooking unit and drip ..."}, {"url": "http://www.recipetips.com/kitchen-tips/t--907/pork-cooking-times.asp", "passage_text": "Whether you are looking for a pork loin cooking time or a pork chop cooking time, use the following chart as a cooking time and temperature guide for pork cuts (including ham) that are cooked in the oven, grilled, or are inserted into an oven bag prior to cooking."}, {"url": "http://www.thekitchn.com/how-to-make-roasted-pork-tenderloin-cooking-lessons-from-the-kitchn-211998", "passage_text": "Roast the pork for 10 minutes: Set the pork in the pan. (It's fine if your pork tenderloin is a little long for the pan; just bend it to fit as we did here.) Return the pan to the oven. Roast for 10 minutes. Flip the pork, reduce the heat, and roast another 10 to 15 minutes: Flip the pork to the other side."}, {"url": "http://startcooking.com/recipes/pork-roast", "passage_text": "Place the roast on a rack in a roasting pan, fat side up, and put the roast in the 450 degree preheated oven. Roast for 10 minutes, then RE-SET THE OVEN TEMPERATURE TO 250 DEGREES. Continue cooking for about 50-80 minutes or until the meat registers 150 degrees on a meat thermometer."}]