[{"url": "http://www.dmv.org/articles/how-long-points-stay-on-your-driving-record/", "passage_text": "How long the points remain on your driving record depends on your state. 1  Alabama: Two years. 2  Alaska: Two points are reduced for every year of violation-free driving. 3  Arizona: Three years. 4  Arkansas: Three years. 5  California: Three years. 6  Colorado: Two years. 7  Connecticut: Two years. 8  Delaware"}, {"url": "http://www.dds.ga.gov/drivers/DLdata.aspx?con=1749471757&ty=dl", "passage_text": "The Georgia Point System ranges from 2 to 6 points. A driver with 15 points in a 24 month period will be suspended. Points are assessed for each conviction pursuant to O.C.G.A. §40-5-57(c)(1)(A)."}, {"url": "https://answers.yahoo.com/question/index?qid=20090108183726AADSuL0", "passage_text": "Report Abuse. I'm not certain how long points remain on your license in a certain state which might be important to you (dunno which state that might be...). However, the longest span of time during which the same set of points counts against you is 2 years."}, {"url": "http://www.dmv.org/ga-georgia/point-system.php", "passage_text": "Your license will be suspended if you have a point accumulation of 15 points within a period of 24 months, or if you commit one or more of several different serious violations."}, {"url": "http://www.dmv.org/articles/how-long-points-stay-on-your-driving-record/", "passage_text": "Keep in mind that this list only pertains to how long points remain on your record. Violations, such as those from traffic and speeding tickets can remain longer. In Arizona, for example, points last two years on a driving record, while violations last five. In Wisconsin, a DUI charge stays on a record for 55 years."}, {"url": "http://www.dmv.org/ga-georgia/point-system.php", "passage_text": "How it Works. Georgia tracks incompetent drivers―or those with bad habits― through the use of a point system, as do many other states. Driving is a privilege, not a right, and if you prove to be a bad, dangerous, or reckless driver, your license can be suspended, canceled, or revoked."}]