[{"url": "http://www.apta.org/ProspectiveStudents/Admissions/PTProcess/", "passage_text": "References-Many physical therapist programs require 1-4 letters of reference (also known as letters of evaluation or recommendations) as part of the admissions process. You may need to submit references from a particular individual, such as a physical therapist, science professor, or academic advisor. The PTA curriculum differs from that of the physical therapist and does NOT provide the needed prerequisites required for physical therapist education. Less than two percent of enrolled students were PTAs prior to enrolling in a PT education program."}, {"url": "http://www.apta.org/ProspectiveStudents/Admissions/PTProcess/", "passage_text": "The physical therapist assistant (PTA) programs are NOT considered to be a stepping-stone to a professional physical therapist (PT) program. The PTA curriculum differs from that of the physical therapist and does NOT provide the needed prerequisites required for physical therapist education. Less than two percent of enrolled students were PTAs prior to enrolling in a PT education program."}, {"url": "http://prehealth.ucmerced.edu/professions/physical-therapy", "passage_text": "Each physical therapist needs a degree from an accredited physical therapy program and a state license, requiring passing scores on national and state examinations. Only master’s degree and doctoral degree programs are accredited, in accordance with the Commission on Accreditation in Physical Therapy Education. Physical Therapy. Physical therapists provide services that help restore function, improve mobility, relieve pain and prevent or limit permanent physical disabilities of patients suffering from injuries or disease. They restore, maintain and promote overall fitness and health."}, {"url": "http://www.answers.com/Q/Why_does_physical_therapy_require_physics", "passage_text": "To be a physical therapy tech, you could find a community college or technical school that would provide certification. The university degree is better. I know of 3 types of PT jobs: A physical therapist (PT), a physical therapist assistant (PTA), and a physical therapy technician. To be a PT, you would need to graduate with a bachelor's from a university and then attend physical therapy school which ranges from 2-3 years. A PTA is an associates degree (I believe). Both require you to obtain a license to practice by passing a licensure exam."}, {"url": "http://physicaltherapyschoolsinfo.org/physical-therapy-school-requirements/", "passage_text": "The physical therapy school requirements to become a PT is different than that needed to become a PTA. Both positions require a college degree, but PTs are required to have an advanced degree and the course requirements are much greater, both in quantity and quality. Physical Therapist Education Requirements. To practice as a Physical Therapist, you must obtain either a Master’s degree or Doctorate degree in physical therapy. There is no longer an option for a Bachelor’s"}, {"url": "http://www.answers.com/Q/Why_does_physical_therapy_require_physics", "passage_text": "To become a physical therapist, you first need to complete a bachelor's degree covering all courses needed to enter graduate school. Then you can apply to accredited universit … y programs to receive your doctorate of physical therapy, now required to practice. To be a PT, you would need to graduate with a bachelor's from a university and then attend physical therapy school which ranges from 2-3 years. A PTA is an associates degree (I believe). Both require you to obtain a license to practice by passing a licensure exam."}, {"url": "http://www.wikihow.com/Get-Accepted-Into-Physical-Therapy-Schools", "passage_text": "1 Typically, you will need at least three references when you apply to a physical therapy school. 2  One of your references should be a physical therapist. 3  You may be able to use the same references for all of the schools to which you choose to apply. Then, you can ask them for letters of recommendation that will be filled with praise for you. 1 "}, {"url": "http://prehealth.ucmerced.edu/professions/physical-therapy", "passage_text": "Among the undergraduate courses that are useful when a student applies to a physical therapy education program are anatomy, biology, chemistry, social science, mathematics and physics. Before granting admission, many programs require volunteer experience in physical therapy departments of hospitals or clinics. Physical Therapy. Physical therapists provide services that help restore function, improve mobility, relieve pain and prevent or limit permanent physical disabilities of patients suffering from injuries or disease. They restore, maintain and promote overall fitness and health."}, {"url": "http://www.sciencebuddies.org/science-engineering-careers/health/physical-therapist", "passage_text": "Among the undergraduate courses that are useful when one applies to a physical therapist education program are anatomy, biology, chemistry, social science, mathematics, and physics. Before granting admission, many programs require volunteer experience in the physical therapy department of a hospital or clinic. "}, {"url": "http://www.answers.com/Q/Why_does_physical_therapy_require_physics", "passage_text": "In order to practice physical therapy you must understand the biomechanical forces on the body. In order to understand the biomechanical forces, you must have a basic knowledge of physics. To be a PT, you would need to graduate with a bachelor's from a university and then attend physical therapy school which ranges from 2-3 years. A PTA is an associates degree (I believe). Both require you to obtain a license to practice by passing a licensure exam."}]