[{"url": "http://www.zmescience.com/other/science-abc/types-of-volcano/", "passage_text": "Shield Volcanoes. A shield volcano is a type of volcano usually built almost entirely of fluid lava flows. They have very gentle slopes and are very developed horizontally. These are the classical Hawaii examples – steady flow and accummulation of lava leading to the shield-type formation. "}, {"url": "http://www.answers.com/Q/Three_major_types_of_volcanoes", "passage_text": "Shield volcanoes are the largest of the three types of volcanoes,  built from basaltic lava flows and shaped like a gentle dome.  Cinder cone volcanoes have very steep slope … s and reach heights of  300 meters or less, and are made from ejected lava. They are produced by hotspots and mid-ocean ridge. Cinder-cone volcanoes are the second of the three types of volcanoes. Cinder-cone volcanoes. Cinder-cone volcanoes have explosive eruptions that release lava high in the air."}, {"url": "http://sciencemindworld.blogspot.com/2011/11/three-major-types-of-volcanoes.html", "passage_text": "6:42 AM By Christy Ocariza, In cinder cone, composite, mayon volcano, mt. fuji, paracutin, shield, Volcano. Try to look at this mnemonics: There are three major types of volcanoes: the composite volcano, the cinder cone volcano, and the shield volcano. Among these three types of volcanoes, the composite volcano is the famous one because it is what we usually see in the movies. The cinder cone is the simplest one and the shield volcano is the largest among the three. The composite volcano is cone shaped volcano with a branched vent and a primary vent in the center"}, {"url": "http://www.universetoday.com/27333/types-of-volcanoes/", "passage_text": "There are 4 major types of volcanoes: Cinder Cone Volcanoes. These are the simplest type of volcano. They occur when particles and blobs of lava are ejected from a volcanic vent. The lava is blown violently into the air, and the pieces rain down around the vent. "}, {"url": "http://www.answers.com/Q/List_three_types_of_volcanoes_and_how_they_are_formed", "passage_text": "A shield volcano, cinder cone volcano, and the composite volcano. Shield volcanoes are on of the three types of volcanoes. Shield volcanoes have quiet eruptions and the lava … is basaltic. Its slope is shallow compared to a composite volcano and a cinder-cone volcano. They are produced by hotspots and mid-ocean ridge. Cinder-cone volcanoes are the second of the three types of volcanoes. Cinder-cone volcanoes. Cinder-cone volcanoes have explosive eruptions that release lava high in the air."}, {"url": "http://pubs.usgs.gov/gip/volc/types.html", "passage_text": "S ome of the Earth's grandest mountains are composite volcanoes--sometimes called stratovolcanoes. They are typically steep-sided, symmetrical cones of large dimension built of alternating layers of lava flows, volcanic ash, cinders, blocks, and bombs and may rise as much as 8,000 feet above their bases. C inder cones are the simplest type of volcano. They are built from particles and blobs of congealed lava ejected from a single vent. As the gas-charged lava is blown violently into the air, it breaks into small fragments that solidify and fall as cinders around the vent to form a circular or oval cone."}, {"url": "http://www.geography.learnontheinternet.co.uk/topics/typesvolcanoes.html", "passage_text": "There are three main types of volcano-composite or strato, shield and dome. Composite Volcanoes. Composite volcanoes, sometimes known as strato volcanoes, are steep sided cones formed from layers of ash and [lava] flows. The eruptions from these volcanoes may be a pyroclastic flow rather than a flow of lava. A pyroclastic flow is a superheated mixture of hot steam, ash, rock and dust"}, {"url": "http://www.answers.com/Q/Three_major_types_of_volcanoes", "passage_text": "A shield volcano, cinder cone volcano, and the composite volcano. Shield volcanoes are on of the three types of volcanoes. Shield volcanoes have quiet eruptions and the lava … is basaltic. Its slope is shallow compared to a composite volcano and a cinder-cone volcano. They are produced by hotspots and mid-ocean ridge. Cinder-cone volcanoes are the second of the three types of volcanoes. Cinder-cone volcanoes. Cinder-cone volcanoes have explosive eruptions that release lava high in the air. They are created by tephra, volcanic ash. Its slope ranges between 30 degrees and 40 degrees"}, {"url": "http://www.answers.com/Q/List_three_types_of_volcanoes_and_how_they_are_formed", "passage_text": "The three types of volcanoes are cinder cone, composite, and shield. Cinder Cones look like a cone-shaped mountain. A material called tephra (cinder) erupts and forms a cone-shaped mountain. Cinder cones are 100 to 400 meters tall. An example is Krakatoa Island. They are produced by hotspots and mid-ocean ridge. Cinder-cone volcanoes are the second of the three types of volcanoes. Cinder-cone volcanoes. Cinder-cone volcanoes have explosive eruptions that release lava high in the air."}, {"url": "http://www.answers.com/Q/List_three_types_of_volcanoes_and_how_they_are_formed", "passage_text": "Shield volcanoes are the largest of the three types of volcanoes,  built from basaltic lava flows and shaped like a gentle dome.  Cinder cone volcanoes have very steep slope … s and reach heights of  300 meters or less, and are made from ejected lava. They are produced by hotspots and mid-ocean ridge. Cinder-cone volcanoes are the second of the three types of volcanoes. Cinder-cone volcanoes. Cinder-cone volcanoes have explosive eruptions that release lava high in the air."}]