[{"url": "http://serc.si.edu/education/resources/watershed/stories/roanoke.aspx", "passage_text": "Jamestown, Va., is located at the James River, a Chesapeake Bay tributary. This colony on Roanoke Island was the first English settlement in the New World. In 1587, shortly after the arrival of the colonists, John White's daughter gave birth to the first child of European parents to be born on American soil. "}, {"url": "http://www.answers.com/Q/Where_is_Jamestown_Colony_located", "passage_text": "It was settled on 14 May 1607 at Jamestown Island. off of current day Virginia. Jamestown, Virginia, is located on the Peninsula (a prominent historical area in Virginia). To find the city on a map of the United States, find the southeast corner of Virginia (near the North Carolina border on the Atlantic Ocean) and go slightly north. "}, {"url": "http://virginiaplaces.org/vacities/7jamestown.html", "passage_text": "International rivalries with Spain and France shaped the location of Jamestown and the settlement of Virginia. The shape of the channel in the James River was also a factor. The English were not the first people to arrive in Virginia, just as Columbus was not the first person to realize the earth was round. "}, {"url": "http://www.livescience.com/38595-jamestown-history.html", "passage_text": "Credit: National Park Service. View full size image. Jamestown, founded in 1607, was the first successful permanent English settlement in what would become the United States. It was located on Jamestown Island, in Virginia, about 30 miles (47 kilometers) up the James River from the Atlantic coast. The original fort site was surrounded by a triangular palisade with three bulwarks. "}, {"url": "http://www.solpass.org/4ss/standards/StudyVS.3Jamestown.htm", "passage_text": "When the settlers arrived in 1607, Jamestown was located on a narrow peninsula bordered on three sides by the James River. Today, Jamestown is located on an island in the James River. "}, {"url": "https://en.wikipedia.org/wiki/Jamestown,_Rhode_Island", "passage_text": "Jamestown is a town located in Newport County, Rhode Island, in the United States. The population was 5,405 at the 2010 census. The Newport Bridge connects Jamestown with Newport, a city on Aquidneck Island. According to the United States Census Bureau, the town has a total area of 35.3 square miles (91 km 2), of which, 9.7 square miles (25 km 2) of it is land and 25.6 square miles (66 km 2) of it is water. The total area is 72.55% water."}, {"url": "http://www.answers.com/Q/Where_was_Jamestown_located", "passage_text": "There are also towns and cities named Jamestown located in the following states: South Carolina R … hode Island Louisiana North Carolina Missouri North Dakota Wisconsin Indiana Kentucky Pennsylvania Ohio New York Kansas Tennessee Colorado Townships named Jamestown are located in: Iowa Indiana Minnesota. What is the Geographic location of Jamestown? Jamestown is in the southeastern portion of the state approximately 50-60 ESE of Richmond, 40-50 miles NW of Norfolk, and about 5 miles from Williamsburg."}, {"url": "http://www.answers.com/Q/Where_was_Jamestown_located", "passage_text": "It was settled on 14 May 1607 at Jamestown Island   off of current day Virginia. Jamestown, Virginia, is located on the Penins … ula (a prominent historical area in Virginia). What is the Geographic location of Jamestown? Jamestown is in the southeastern portion of the state approximately 50-60 ESE of Richmond, 40-50 miles NW of Norfolk, and about 5 miles from Williamsburg."}, {"url": "http://www.historyisfun.org/about-us/americas-400th-anniversary/historic-jamestowne/", "passage_text": "Historic Jamestowne. Historic Jamestowne is the original site of the Jamestown colony. Located on Jamestown Island at the western end of the Colonial Parkway, this unique site is administered by the National Park Service and Preservation Virginia. Jamestown Settlement is a state-operated living-history museum adjacent to the original site."}]