[{"url": "http://www.blueovalforums.com/forums/index.php?/topic/53886-daytime-running-lights-activated/", "passage_text": "I just had my DRL's activated on my 2013 Ford Fusion Titanium at my local Lincoln dealer. It took less then 5 minutes from start to finish. All that was done was a laptop was hooked up to the data port then from there they were turned on. The DRL's are about one third the normal brightness of the headlights."}, {"url": "http://ijdmtoy.com/BLOG/wordpress/2014/07/01/how-to-install-ford-fusion-led-daytime-running-lights/", "passage_text": "4. After you put in the new LED daytime running light bezel, you will need to connect the wires of the LED DRLs to the module box. 5. Take the blue wire and tap it to the fuse box ACC location."}, {"url": "http://lightsout.org/disable.html", "passage_text": "Below are the instruction to disable the DRL's. With these instructions it disables the DRL's, allows you to use your fog lights as drl's, puts the drl's on a switch as in my province (Canada) a car needs drl's to pass MVI. Also when you turn on your hi-beams the fog lights will stay on."}, {"url": "http://www.youtube.com/watch?v=tfwwKmWOly0", "passage_text": "2013 Ford Fusion Hybrid. Low Beams 5000K HIDS. Fogs 5000K HIDS. LED Daytime Running Lights. Wired to the Park"}, {"url": "http://www.youtube.com/watch?v=ZRMGHruQWPk", "passage_text": "Published on Sep 17, 2014. This video will explain how to turn the automatic daytime running lamps on your vehicle on or off depending on your preference. Watch videos, view owner's manuals, get tips, information & more at the official site for Owners -- http://owner.Ford.com."}, {"url": "http://ijdmtoy.com/BLOG/wordpress/2014/07/01/how-to-install-ford-fusion-led-daytime-running-lights/", "passage_text": "The LED DRLs are great for both models of the Ford Fusion with or without the OEM fog lamps with no modification required. Here is how you install these LED daytime running lights. 1. Remove the stock bumper. 2. Use a flat head screwdriver to remove the stock fog lamp bezel cover. The insert shows you what it should look like after you’ve removed"}, {"url": "http://fordfusionhybridforum.com/topic/5650-daytime-running-lights/page-2", "passage_text": "Welcome to the Ford Fusion Hybrid Forum. Like most online communities, you must register to create topics or post in our community-but don't worry, this is a simple, free process that requires minimal information for you to signup. Be a part of Ford Fusion Hybrid Forum by signing in or creating an account."}, {"url": "http://ijdmtoy.com/BLOG/wordpress/2014/07/01/how-to-install-ford-fusion-led-daytime-running-lights/", "passage_text": "If you follow the step-by-step instructions accurately, you shouldn’t have any trouble installing these new LED daytime running lights on your Ford Fusion. This add-on is a great way to combine style and safety on a popular American sedan."}]