[{"url": "http://www.answers.com/Q/What_is_Malta_famous_for", "passage_text": "Malta is an Island, Malta Islands is the largest of the three major islands that constitute the Maltese archipelago and Republic of Malta. Malta is in the middle of the Medite … rranean Sea directly south of Italy and north of Libya. 20 people found this useful. Malta is a Member State of the European Union (EU) ; which is strategically located within the Mediterranean Sea. This strategic position has consistently allowed Malta to ec … lectically develop as an important International Trading Post."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20070301034614AA9N4Fc", "passage_text": "While Malta has a population of 345,000 the corresponding figure for Gozo is only about 25,000. The Maltese Islands are just 60 miles from Sicily, and 180 miles from the African continent. Malta is caretaker to the oldest known temples in the world. They are still standing and in an excellent state of preservation. They tell the the tale of a time when the Mediterranean honored the Fertility Goddess and tribes from distant shores gathered on Malta to worship communally. Malta was the official home of the Knights of the Order of St.John (better known as the Knights of Malta), during which period a concerted attempt was made to invade the country by the Turks. Malta is noted for its fine crafts, particularly its handmade lace, hand woven fabrics, blown glass and silver filigree."}, {"url": "http://www.islands.com/malta-what-known", "passage_text": "Posted Dec 5th, 2006 at 6:38am. 0. CULTURE. Malta celebrates Carnival (Mediterranean-style) at the start of Lent, with floats, carts, and fancy dress costumes with masks (for both children and adults), but for many visitors, the soul of the island can be best seen during the summer festas."}, {"url": "https://en.wikipedia.org/wiki/Malta", "passage_text": "Malta has a long Christian legacy and its Roman Catholic Archdiocese of Malta is claimed to be an Apostolic See because, according to the Acts of the Apostles, Paul the Apostle was shipwrecked on Malta. Catholicism is the official religion in Malta. Malta was awarded the George Cross by King George VI in 1942, for the country's bravery in the Second World War. The George Cross continues to appear on Malta's national flag."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20070301034614AA9N4Fc", "passage_text": "Malta is also well known for one of the Mediterranean's largest concentrations of English language schools, some of the world's best diving centers, world class yachting and cruise line facilities, a highly developed visitor and convention infrastructure and above all a friendly, worldly population of natives. Malta was the official home of the Knights of the Order of St.John (better known as the Knights of Malta), during which period a concerted attempt was made to invade the country by the Turks. Malta is noted for its fine crafts, particularly its handmade lace, hand woven fabrics, blown glass and silver filigree."}, {"url": "http://wikitravel.org/en/Malta", "passage_text": "Malta is a small, island country in the Mediterranean Sea that lies south of the island of Sicily, Italy. Malta is an archipelago, but only the three largest islands of Malta, Gozo (Għawdex) and Kemmuna (Comino) are inhabited. "}, {"url": "https://en.wikipedia.org/wiki/Malta", "passage_text": "Malta (/ˈmɒltə/ ; [ˈmɐltɐ]), officially the Republic of Malta (Maltese: Repubblika ta' Malta), is a Southern European island country comprising an archipelago in the Mediterranean Sea. It lies 80 km (50 mi) south of Italy, 284 km (176 mi) east of Tunisia, and 333 km (207 mi) north of Libya. Malta was awarded the George Cross by King George VI in 1942, for the country's bravery in the Second World War. The George Cross continues to appear on Malta's national flag."}, {"url": "https://en.wikipedia.org/wiki/Malta_(island)", "passage_text": "Malta is the largest of the three major islands that constitute the Maltese archipelago. It is sometimes referred to as Valletta for statistical purposes to distinguish the main island from the entire country. Malta is in the middle of the Mediterranean Sea directly south of Italy and north of Libya. The island is 27 kilometres (17 mi) long and 14.5 kilometres (9 mi) wide, with a total area of 246 square kilometres (95 sq mi). The capital is Valletta, largest city is Qormi and the largest locality is Birkirkara"}]