[{"url": "http://www.kiplinger.com/article/taxes/T054-C001-S001-tax-break-for-summer-camp.html", "passage_text": "SEE ALSO: The Most-Overlooked Tax Deductions. You can take the child-care credit for the cost of day camp (not overnight camp) for children under age 13, as long as both spouses work (or are looking for work). You also qualify if one of the spouses is a full-time student and the other is working. When you pay your camp bills this summer, keep copies of the bills and get the camp’s or other care provider’s employer ID number so you’ll have the information on file for your taxes next spring."}, {"url": "http://blog.turbotax.intuit.com/tax-deductions-and-credits-2/family/is-this-deductible-my-childs-summer-camp-19801/", "passage_text": "1 If you send the kids away to the mountains for a week, you won’t garner a tax deduction. 2  But send the kids away for the day, and now you are talking tax savings in the form of the Child and Dependent Care Credit, as long as your child is under the age of 13. Here’s the scoop: 1 "}, {"url": "http://blog.turbotax.intuit.com/tax-deductions-and-credits-2/family/is-this-deductible-my-childs-summer-camp-19801/", "passage_text": "True, camp can be expensive, but some of those expenses may be tax deductible. Here’s the scoop: 1  If you send the kids away to the mountains for a week, you won’t garner a tax deduction. 2  But send the kids away for the day, and now you are talking tax savings in the form of the Child and Dependent Care Credit, as long as your child is under the age of 13."}, {"url": "https://www.irs.gov/uac/summer-day-camp-expenses-may-qualify-for-a-tax-credit", "passage_text": "Here are five facts the IRS wants you to know about a tax credit available for child care expenses. The Child and Dependent Care Credit is available for expenses incurred during the summer and throughout the rest of the year. 1  The cost of day camp may count as an expense towards the child and dependent care credit. 2  Expenses for overnight camps do not qualify. Summer Day Camp Expenses May Qualify for a Tax Credit. IRS Summertime Tax Tip 2011-01, July 6, 2011. Along with the lazy, hazy days of summer come some extra expenses, including summer day camp. But, the IRS has some good news for parents: those added expenses may help you qualify for a tax credit."}, {"url": "http://blog.turbotax.intuit.com/tax-deductions-and-credits-2/family/is-this-deductible-my-childs-summer-camp-19801/", "passage_text": "1 Child and Dependent Care Credit is to enable you to work or go to school, so if you have a spouse at home to care for the children, then no deduction for camp. 2  But if you are single, or you and your spouse both work, cha-ching, you’ll qualify for the tax credit. Here’s the scoop: 1  If you send the kids away to the mountains for a week, you won’t garner a tax deduction. 2  But send the kids away for the day, and now you are talking tax savings in the form of the Child and Dependent Care Credit, as long as your child is under the age of 13."}, {"url": "http://www.kfmr.com/are-summer-camp-costs-deductible/", "passage_text": "The possibilities include sending a child to day camp or overnight camp. Parents may wonder whether these costs are deductible. At least two possible tax breaks come to mind: the dependent care credit, and the deduction for medical expenses. The most likely tax benefit is the child (or dependent) care credit. Medical Expenses. The cost of camp generally is not deductible as a medical expense. The cost of providing general care to a healthy child is a nondeductible personal expense. Example: The child's mother works; the child's father is ill and cannot take care of the child."}, {"url": "https://www.irs.gov/uac/summer-day-camp-expenses-may-qualify-for-a-tax-credit", "passage_text": "1 The cost of day camp may count as an expense towards the child and dependent care credit. 2  Expenses for overnight camps do not qualify. 3  Whether your childcare provider is a sitter at your home or a daycare facility outside the home, you'll get some tax benefit if you qualify for the credit. Summer Day Camp Expenses May Qualify for a Tax Credit. IRS Summertime Tax Tip 2011-01, July 6, 2011. Along with the lazy, hazy days of summer come some extra expenses, including summer day camp. But, the IRS has some good news for parents: those added expenses may help you qualify for a tax credit."}, {"url": "http://blog.turbotax.intuit.com/deductions-and-credits/its-summer-can-i-deduct-my-childs-camp-costs-175/", "passage_text": "The day camp expenses are eligible. If the camp costs include a fee for transporting your kid to and from the camp, that’s an eligible cost too. Before the camp days are over, get the camp’s information (official name, address, and identification number) for your next year’s tax return."}, {"url": "http://budgeting.thenest.com/kids-sports-fees-taxdeductible-27917.html", "passage_text": "Child Care. One way to get a write-off is when you use sports activities -- a tennis program or a summer swimming camp, for instance -- as a day-care service. The IRS lets you claim a tax credit of up to $3,000 for the cost of child-care programs, and sports programs can qualify."}]