[{"url": "http://www.nanomotion.com/piezo-ceramic-motor-technology/piezoelectric-effect/", "passage_text": "Piezoelectric Effect is the ability of certain materials to generate an electric charge in response to applied mechanical stress. The word Piezoelectric is derived from the Greek piezein, which means to squeeze or press, and piezo, which is Greek for “push”."}, {"url": "http://necksecret.com/Piezoelectric_Therapy.html", "passage_text": "We are completing a circuit with the patient, doctor, and the piezoelectric stimulator. I serve as an electrical ground to the patient. Treatment with the piezoelectric stimulator alone is often effective for treated various pain and other problems. I typically use it in conjunction with other treatment modalities. I’ve had considerable success with it for people with shoulder and knee pain."}, {"url": "http://earsecret.com/Piezo-electric_Therapy.html", "passage_text": "By Dr. Donald Liebell A versatile treatment device I use to help my patients is the piezoelectric stimulator. Piezo (pronounced Pi-EE-ZO) means pressure in Greek."}, {"url": "http://www.buyacupuncture.com/Piezo_Electric_Stim_p/29103.htm", "passage_text": "Piezo electric Stimulator is designed for simple and easy home therapy. It produces mild, safe and harmless electrical stimulus, which resemble Chinese acupuncture, eliminating high degree of antiseptic application. It transmits electricity via the acupuncture point on the skin surface."}, {"url": "http://necksecret.com/Piezoelectric_Therapy.html", "passage_text": "Click HERE to link to Google Maps Click HERE to go to the NeckSecret.com Home Page Return to the Top of This Page: Click HERE. Piezoelectric Therapy: A Modern Twist on an Ancient Principle. By Dr. Donald Liebell A versatile treatment device I use to help my patients is the piezoelectric stimulator. Piezo (pronounced Pi-EE-ZO) means pressure in Greek."}, {"url": "http://earsecret.com/Piezo-electric_Therapy.html", "passage_text": "We are completing a circuit with the patient, doctor, and the piezoelectric stimulator. I serve as an electrical ground to the patient. Treatment with the piezoelectric stimulator alone is often effective for treated various pain and other problems. I typically use it in conjunction with other treatment modalities. I’ve had considerable success with it for people with shoulder and knee pain."}]