[{"url": "http://fas.org/sgp/crs/misc/R42063.pdf", "passage_text": "This resulted from slow annual growth in real GDP of 0.1% in the first quarter, 2.5% in the second quarter, and 1.3% in the third quarter of 2011. 13 Output growth accelerated at an annual rate of 4.1% in the fourth quarter of 2011, and the unemployment rate resumed its downward trend—dropping to 8.5% in December 2011. In that case, it took only eight months for the unemployment rate to fall more than one percentage point (to a still high 9.4%). A debate recently broke out over the applicability of Okun’s law to changes in economic growth and the unemployment rate."}, {"url": "https://en.wikipedia.org/wiki/Economy_of_Singapore", "passage_text": "Singapore's economic strategy produced real growth averaging 8.0% from 1960 to 1999. The economy picked up in 1999 after the regional financial crisis, with a growth rate of 5.4%, followed by 9.9% for 2000. Singapore also has a strategic port which makes it more competitive than many of its neighbours in carrying out such entrepot activities. Singapore has the highest trade to GDP ratio in the world, averaging around 400% during 2008–11."}, {"url": "http://www.tradingeconomics.com/singapore/gdp-growth", "passage_text": "GDP Growth Rate in Singapore averaged 4.77 percent from 2007 until 2015, reaching an all time high of 36.40 percent in the first quarter of 2010 and a record low of -13 percent in the third quarter of 2010. 1Y 5Y 10Y MAX. Forecast Export Data API Access. Singaporean economy grew only by 0.1 percent on a quarter-on-quarter seasonally-adjusted annualized basis in the three months to September of 2015, compared to an upwardly revised 2.5 percent contraction in the preceding quarter. 1Y 5Y 10Y MAX."}, {"url": "http://countryeconomy.com/gdp/singapore", "passage_text": "Gross Domestic Product of Singapore grew 2.9% in 2014 compared to last year. This rate is 15-tenths of one percent less than the figure of 4.4% published in 2013. The GDP figure in 2014 was €231,632 $307,872 million, Singapore is number 37 in the ranking of GDP of the 196 countries that we publish. "}, {"url": "http://financialnerd.com/three-pillars-economy-inflation-gdp-unemployment/", "passage_text": "In order to answer that question, we need to better understand the relationship between inflation, GDP and unemployment rate. Historical data suggests that annual GDP growth in excess of 2.5% will caused a 0.5% drop in unemployment rate for every percentage point of GDP over 2.5%. GDP Trend"}, {"url": "http://fas.org/sgp/crs/misc/R42063.pdf", "passage_text": "The unemployment rate was 9.5% when the economy emerged from the 11 th postwar recession in June 2009. It climbed further to peak at 10.0% in October 2009. The rate has slowly declined since then. Although it dropped below 8% in the fourth quarter of 2012, the unemployment rate remains high by historical standards. In that case, it took only eight months for the unemployment rate to fall more than one percentage point (to a still high 9.4%). A debate recently broke out over the applicability of Okun’s law to changes in economic growth and the unemployment rate."}, {"url": "http://fas.org/sgp/crs/misc/R42063.pdf", "passage_text": "Economic Growth and the Unemployment Rate Congressional Research Service 3 aging of the baby-boom generation. Between 2000 and 2010, the annual rate of labor force growth fell to 0.8%. It is projected to fall further, to 0.7% per year on average, between 2010 and 2020. In that case, it took only eight months for the unemployment rate to fall more than one percentage point (to a still high 9.4%). A debate recently broke out over the applicability of Okun’s law to changes in economic growth and the unemployment rate."}, {"url": "https://en.wikipedia.org/wiki/Economy_of_Singapore", "passage_text": "In 2005, economic growth was 6.4%; and in 2006, 7.9%. As of 8 June 2013, Singapore's unemployment rate is around 1.9% and the country's economy has a lowered growth rate, with a rate of 1.8% on a quarter-by-quarter basis—compared to 14.8% in 2010. Singapore also has a strategic port which makes it more competitive than many of its neighbours in carrying out such entrepot activities. Singapore has the highest trade to GDP ratio in the world, averaging around 400% during 2008–11."}, {"url": "http://fas.org/sgp/crs/misc/R42063.pdf", "passage_text": "Economic Growth and the Unemployment Rate Congressional Research Service 2 states that real GDP growth about equal to the rate of potential output growth usually is required to maintain a stable unemployment rate. In that case, it took only eight months for the unemployment rate to fall more than one percentage point (to a still high 9.4%). A debate recently broke out over the applicability of Okun’s law to changes in economic growth and th"}]