[{"url": "http://www.greenteanutritionfacts.com/green-tea-nutritional-information/green-tea-nutrition/", "passage_text": "The nutritional value of green tea is very high – the most vital of all ingredients is the antioxidant known as polyphenol. Green tea is rich in catechin polyphenols. Catechins are the major group of polyphenols in green tea and the most active catechins are called epigallocatechin-3-gallate (EGCG). Five cups of green tea a day will provide 5-10% of the daily requirement of riboflavin, niacin, folic acid, and pantothenic acid. Also five cups of green tea provide approximately 5% of the daily requirement of magnesium, 45% of the requirement for manganese and 25% of potassium."}, {"url": "https://en.wikipedia.org/wiki/Green_tea", "passage_text": "Green tea leaves steeping in a gaiwan. Steeping is the process of making a cup of tea; it is also referred to as brewing. In general, two grams of tea per 100 ml of water, or about one teaspoon of green tea per five-ounce (150 ml) cup, should be used. Green tea is the most popular form of tea in China. Chinese green teas are made from over 600 different cultivars of the Camellia sinensis plant, giving plenty of variety and regional teas. Chinese green teas are traditionally pan-fired, unlike the Japanese steaming process."}, {"url": "http://www.amazing-green-tea.com/green-tea-ingredients.html", "passage_text": "Green Tea Caffeine. Vitamins and Minerals. Green tea contains several B vitamins and C vitamin. Being less processed than black tea, these vitamins are left intact in the tea-making process. Other green tea ingredients include 6% to 8% of minerals such as aluminium, fluoride and manganese. Green tea also contains organic acids such as gallic and quinic acids, and 10% to 15% of carbohydrate and small amount of volatiles. Chemical Composition and Constituents. The most important green tea ingredients are catechins, theanine and caffeine. A guide to green tea chemical composition and constituents. Green tea ingredients are extremely complex. It contains as many as 200 bioactive compound"}, {"url": "http://www.benefitsofgreentea.info/2007/what-are-the-ingredients-in-green-tea.php", "passage_text": "Then, other ingredients in green tea include theanine, which is a type of amino acid, catechin, chlorophyll, butyric acid, vitamins A, B1, B2, B3, C, E, F, P, and U, and certain minerals such as, saponin, saccharides, and pectin. When discussing the ingredients of green tea, keep in mind that this is more a reference to the nutritional value. Of course, you can purchase green tea in various flavors, which would change the actual ingredients in green tea."}, {"url": "http://www.viconyteas.com/directory/tea-encyclopedia/green-tea-ingredients.html", "passage_text": "The most vital of all ingredients in green tea is the antioxidant known as polyphenol, specifically Epigallocatechin-3-gallate, more commonly called EGCG. Then, one bag of green tea contain between 80 and 100 mgs of the polyphenols with EGCG accounting for about 25 to 30 mgs of that. Other ingredients in green tea include theanine, which is a type of amino acid, catechin, chlorophyll, butyric acid, vitamins A, B1, B2, B3, C, E, F, P, and U, and certain minerals such as, saponin, saccharides, and pectin."}, {"url": "http://www.viconyteas.com/directory/tea-encyclopedia/green-tea-ingredients.html", "passage_text": "When discussing the ingredients of green tea, keep in mind that this is more a reference to the nutritional value. Of course, you can purchase green tea in various flavors, which would change the actual ingredients in green tea. Other ingredients in green tea include theanine, which is a type of amino acid, catechin, chlorophyll, butyric acid, vitamins A, B1, B2, B3, C, E, F, P, and U, and certain minerals such as, saponin, saccharides, and pectin."}, {"url": "http://www.benefitsofgreentea.info/2007/what-are-the-ingredients-in-green-tea.php", "passage_text": "The most vital of all ingredients in green tea is the antioxidant known as polyphenol, specifically Epigallocatechin-3-gallate, more commonly called EGCG. When discussing the ingredients of green tea, keep in mind that this is more a reference to the nutritional value. Of course, you can purchase green tea in various flavors, which would change the actual ingredients in green tea."}, {"url": "http://www.viconyteas.com/directory/tea-encyclopedia/green-tea-ingredients.html", "passage_text": "Another ingredient in green tea is 0.06mg of caffeine. Other ingredients in green tea include theanine, which is a type of amino acid, catechin, chlorophyll, butyric acid, vitamins A, B1, B2, B3, C, E, F, P, and U, and certain minerals such as, saponin, saccharides, and pectin."}, {"url": "https://en.wikipedia.org/wiki/Green_tea_extract", "passage_text": "(August 2009). A green tea extract is a herbal derivative from green tea leaves (Camellia sinensis). Containing antioxidant ingredients – mainly green tea catechins (GTC) – green tea and its derivatives are sometimes used as dietary supplements and in alternative medicine."}]