[{"url": "http://www.mosquitoreviews.com/mosquito-lifespan.html", "passage_text": "By Elizabeth Miller Adult mosquitoes' lifespans vary from a few days to several months, depending on the species. Some mosquitoes live only in the summer and die when cold weather comes, but their eggs survive the winter and hatch in spring. Others hibernate during the winter as adults, so their lifespan as full-grown mosquitoes lasts for months, continuing into the following year."}, {"url": "http://www.answers.com/Q/How_long_does_a_mosquito_live", "passage_text": "Confidence votes 27.8K. Mosquito is a name for over 3 species of the family Culicidae. The average life span for these insects varies greatly between exact species and weather, but typically the females live for 3 to 100 days and the males live for 10 to 20 days. In a typically warm weather, the life cycle takes 14 days or less, but it can vary from 4 to 30 days.  The average life span of a female mosquito is 3 to 100 days. The male lives"}, {"url": "http://www.nature.com/scitable/topicpage/dengue-transmission-22399758", "passage_text": "Typically, four days after being bit by an infected Aedes aegypti mosquito, a person will develop viremia, a condition in which there is a high level of the dengue virus in the blood. Viremia lasts for approximately five days, but can last as long as twelve days. "}, {"url": "http://malheurvector.com/mosquito-faqs", "passage_text": "On average a mosquito’s life span is typically 2-3 weeks however for the lucky mosquitoes who can find a hideout for the winter such as a garage, culvert, or attic, have a chance of living for up to 6 months. Top of page. All mosquitoes require water to complete the 3 of 4 stages of their life cycle. A mosquito can go through all four stages in a matter of 4-14 days depending on water temperature. The ideal water temperature for mosquito larva to thrive in is 75*F to 80*F."}, {"url": "https://en.wikipedia.org/wiki/Mosquito", "passage_text": "Mosquitoes are small, midge-like flies which comprise the family Culicidae. Females of most species are ectoparasites, whose tube-like mouthparts (called a proboscis) pierce the hosts' skin to consume blood. The word mosquito (formed by mosca and diminutive ito) is Spanish for little fly . "}, {"url": "http://www.answers.com/Q/How_long_does_a_mosquito_live", "passage_text": "The total time it takes for a mosquito to go through all four stages depends greatly on both … temperature and species. In a typically warm weather, the life cycle takes 14 days or less, but it can vary from 4 to 30 days.  The average life span of a female mosquito is 3 to 100 days. The male lives 10 to 20 days."}, {"url": "http://www.ehow.com/video_4949934_long-do-mosquitoes-live_.html", "passage_text": "5. Cancel. Mosquito eggs take about a week to hatch, after which the adult mosquito lives anywhere from three to 100 days. Discover more about the mosquito's life cycle with help from a teacher in this free video on mosquitoes and insects. Part of the Video Series: Mosquito Information. After that the adult mosquito hatches. Female adults can live from three days to 100 days and men tend to live closer to about two weeks but the female sure are around long enough to make our lives aggravating."}, {"url": "http://www.answers.com/Q/How_long_do_mosquitoes_live", "passage_text": "Which are egg, larval, pupa and adult. The total time it takes for a mosquito to go through all four stages depends greatly on both temperature and species. In a typically warm weather, the life cycle takes 14 days or less, but it can vary from 4 to 30 days. The average life span of a female mosquito is 3 to 100 days. The male lives 10 to 20 days. Mosquito is a name for over 3 species of the family Culicidae. The average life span for these insects varies greatly between exact species and weather, but typically the f … emales live for 3 to 100 days and the males live for 10 to 20 days. + 119 others found this useful. Brent Hill."}, {"url": "http://www.orkin.com/other/mosquitoes/mosquito-life-cycle/", "passage_text": "Mosquito Life Cycle. Mosquito, After Feedings. The length of the mosquito life cycle varies between species and is dependent upon environmental conditions such as temperature and moisture. However, the life cycle of all mosquitoes is comprised of the egg, larval, pupal and adult stages. Male mosquitoes feed on plant nectar alone, while females extract the blood of hosts in order to develop and nourish eggs. Most mosquitoes lay their eggs directly into water. Others lay their eggs near bodies of water but not within them. Eggs will hatch into larvae within 24 to 48 hours. Larvae soon grow to become approximately 5 mm in length"}]