[{"url": "http://measles.emedtv.com/measles/measles-treatment.html", "passage_text": "Vitamin A as Part of Measles Treatment. In developing countries, malnutrition, vitamin A deficiency, and severe measles are common. For these situations, the treatment of measles should include vitamin A medication for two days, starting as soon as a measles diagnosis is made. This treatment has been shown to decrease the risk of blindness and death. There is currently no proven treatment that can kill the measles virus; therefore, measles treatment focuses on providing relief of measles symptoms as the body fights the virus."}, {"url": "http://www.howmuchisit.org/measles-vaccine-cost/", "passage_text": "The price of measles vaccine depends on the medical facility where it will be administered as well as other factors. 1  On average, the measles vaccination can cost anywhere from $18 to as much as $118. 1 Many policies may cover the vaccine as it is considered preventative. 2  According to the site CDC.gov, the price for a measles vaccine can range from $18 to $50. 3  Measlesinitiative.org states that the price for a measles vaccine can be anywhere from $18 to $60."}, {"url": "http://www.howmuchisit.org/measles-vaccine-cost/", "passage_text": "1 On average, the measles vaccination can cost anywhere from $18 to as much as $118. 2  For those that have health insurance policies, check with the policy to learn more about your coverage. 3  Many policies may cover the vaccine as it is considered preventative. 1 Many policies may cover the vaccine as it is considered preventative. 2  According to the site CDC.gov, the price for a measles vaccine can range from $18 to $50. 3  Measlesinitiative.org states that the price for a measles vaccine can be anywhere from $18 to $60."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/12241559", "passage_text": "The objective of this study is to develop a model to estimate the average cost per measles case and per adverse event following measles immunisation using the Netherlands (NL), the United Kingdom (UK) and Canada as examples. The average cost of measles cases and adverse events following vaccination in industrialised countries. Carabin H(1), Edmunds WJ, Kou U, van den Hof S, Nguyen VH. Author information: (1)Department of Infectious Disease Epidemiology, Imperial College Faculty of Medicine, London, UK. helene-carabin@ouhsc.edu"}, {"url": "http://www.thefiscaltimes.com/2015/02/08/Just-One-Case-Measles-Cost-More-10000", "passage_text": "A CDC study published in the journal Vaccine noted that there were 16 measles outbreaks in 2011 that resulted in 107 cases and cost public health departments between $2.7 million and $5.3 million to combat. Those figures don’t include costs incurred by the patients, which are considerable as well. Measles sufferers often require hospitalization. They can get complications like pneumonia and encephalitis (swelling of the brain) that can be deadly."}, {"url": "http://www.sciencedirect.com/science/article/pii/S0264410X02002967", "passage_text": "The itemized unit costs in the routine program for a sample of countries are reported in Table 2. The administrative cost and the cost of treatment of measles in this table are not reported as unit cost. The cost of delivering a vaccine to a child with the probably cost of treatment for adverse effect is US$ 1.77. For the countries for which data was available, the total discounted cost of the routine program for 2000–2020, or the cost that must be undertaken yearly, is US$ 376.4 million, of which US$ 29 million is required for measles treatment. This cost is US$ 392 million when extrapolated to the entire LAC region. Fig."}, {"url": "http://www.sciencedirect.com/science/article/pii/S0264410X02002967", "passage_text": "The expected treatment cost required due to a single incidence of measles ranged from US$ 43 in Nicaragua to US$ 210 in Argentina and averaged at US$ 190 per measles in the entire LAC region. The total cost of measles treatment during this period is US$ 29 million for the countries in our data set. Once the administrative cost and cost of treatment was taken into account, the unit cost was the highest in Jamaica at US$ 12.71 and the lowest in Venezuela at US$ 1.27. For the countries for which data was available, the total discounted cost of the routine program for 2000–2020, or the cost that must be undertaken yearly, is US$ 376.4 million, of which US$ 29 million is required for measles treatment. This cost is US$ 392 million when extrapolated to the entire LAC region. Fig."}, {"url": "http://www.howmuchisit.org/measles-vaccine-cost/", "passage_text": "1 Measlesinitiative.org states that the price for a measles vaccine can be anywhere from $18 to $60. 2  The site also shows detailed information regarding measles and its effects as well as the cost of the treatment for someone who has measles. 1 Many policies may cover the vaccine as it is considered preventative. 2  According to the site CDC.gov, the price for a measles vaccine can range from $18 to $50. 3 "}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/12241559", "passage_text": "RESULTS: From the perspective of society, we estimated the average cost per measles case to be US$276, US$307 and US$254 for the NL, the UK and Canada, respectively, and the average cost of adverse events following immunisation per vaccinee to be US$1.43, US$1.93 and US$1.51 for the NL, UK and Canada, respectively. The average cost of measles cases and adverse events following vaccination in industrialised countries. Carabin H(1), Edmunds WJ, Kou U, van den Hof S, Nguyen VH. Author information: (1)Department of Infectious Disease Epidemiology, Imperial College Faculty of Medicine, London, UK. helene-carabin@ouhsc.edu"}]