[{"url": "http://bio.rutgers.edu/~gb102/lab_6/601cm-simplecu.html", "passage_text": "Simple cuboidal epithelium. The cells of this type of tissue can withstand more trauma than simple squamous epithelia and are adapted for diffusion and secretion. This is one of the specializations found in epithelial tissues. Simple cuboidal epithelium is found in organs that are specialized for secretion, such as salivary glands and thyroid follicles, and those that are specialized for diffusion, such as the kidney tubules. As its name implies, this tissue consists of a single layer of cuboidal cells on the basement membrane. Examine simple cuboidal epithelium in a section of the kidney. Simple cuboidal epithelial tissue lines the tubules, which will be seen in both longitudinal and cross sections. Find longitudinal and cross sections of the tubules using the mid-magnification view. "}, {"url": "http://www.histology.leeds.ac.uk/tissue_types/epithelia/epi_simple.php", "passage_text": "Squamous means scale-like. simple squamous epithelium is a single layer of flat scale-shaped cells. Both the endothelial lining of blood vessels and the mesothelial lining of the body cavities are simple squamous epithelium. Try to identify the simple squamous epithelia in these pictures. Columnar. This picture shows columnar cells from the stomach. A few of the cells are outlined, to help you identify them. This is a single layer of cells, and the cells are all tall columnar. Tall columnar epithelium lines the ducts of many exocrine glands."}, {"url": "http://www.histology-world.com/testbank/epithelium4a.htm", "passage_text": "The kidney tubules are simple cuboidal epithelium. Epithelium lines body cavities and surfaces. Simple cuboidal epithelium is simple because it is one cell thick. Cuboidal refers to the shape of the cells. Answer: d. The lining of the esophagus is stratified squamous epithelium. Epithelium lines body cavities and surfaces. Stratified squamous epithelium is stratified because it is more than one cell layer thick. Squamous refers to the fact that the surface cells of the layer are flat. 3."}, {"url": "http://www.answers.com/Q/What_kind_of_epithelial_tissue_forms_kidney_tubules", "passage_text": "Simple cuboidal epithelial tissue lines the surface of the kidney's  tubules. These simple cuboidal cells absorb and transport the  various substances that are filtered by t … he kidney. 1 person found this useful. "}, {"url": "http://www.histology-world.com/testbank/epithelium4a.htm", "passage_text": "Endothelium is simple squamous epithelium that lines the vascular system. Transitional epithelium is seen in the urinary tract. Transitional epithelium has dome shaped cells on the apical surface. Pseudostratified epithelium is a type of epithelium that has cells which all touch the basement membrane. Answer: d. The lining of the esophagus is stratified squamous epithelium. Epithelium lines body cavities and surfaces. Stratified squamous epithelium is stratified because it is more than one cell layer thick. Squamous refers to the fact that the surface cells of the layer are flat. 3."}, {"url": "https://en.wikipedia.org/wiki/Epithelium", "passage_text": "Epithelium (epi- + thele + -ium) is one of the four basic types of animal tissue. The other three types are connective tissue, muscle tissue and nervous tissue. Epithelial tissues line the cavities and surfaces of blood vessels and organs throughout the body. There are three principal shapes of epithelial cells: squamous, columnar, and cuboidal. These can be arranged in a single layer of cells as simple epithelium, either squamous, columnar or cuboidal, or in layers of two or more cells deep as stratified (layered), either squamous, columnar or cuboidal"}, {"url": "http://www.answers.com/Q/What_type_of_epithelial_tissue_lines_kidney_tubules", "passage_text": "Simple cuboidal epithelial tissue lines the surface of the kidney's  tubules. These simple cuboidal cells absorb and transport the  various substances that are filtered by t … he kidney. 1 person found this useful. "}, {"url": "http://www.hccfl.edu/media/428213/ex_6a_epithelial_tissues.ppt", "passage_text": "(b) Simple cuboidal epithelium Description: Single layer of cubelike cells with large, spherical central nuclei. Function: Secretion and absorption. Location: Kidney tubules; ducts and secretory portions of small glands; ovary surface. Photomicrograph: Simple cuboidal epithelium in kidney tubules (430x). Basement membrane Connective tissue Simple cuboidal epithelial cells Figure 4.3c Epithelial tissues. "}, {"url": "http://www.siumed.edu/~dking2/intro/4basic.htm", "passage_text": "Stroma is everything else -- connective tissue, blood vessels, nerves, ducts. The parenchyma / stroma distinction provides a convenient way to circumvent the listing of tissue types when discussing an organ. Examples: 1  The parenchyma of the kidney is epithelial tissue (renal tubules and corpuscles). 2  The blood vessels, nerves, and supporting connective tissue of the kidney comprise the stroma. 3  The parenchyma of the spleen is connective tissue (mostly lymphocytes and other blood cells). "}]