[{"url": "http://www.angelfire.com/mi/penny101/info.html", "passage_text": "Mt. Vesuvius. ERUPTIONS Mt. Vesuvius's most famous eruption was in 79 A.D. when it destroyed the citites of Herculaneum and Pompeii. When Vesuvius erupted it covered the cities of Herculaneum and Pompeii it covered the cities with 20 feet of volcanic debris."}, {"url": "http://primaryfacts.com/1560/mount-vesuvius-facts-about-the-famous-volcano/", "passage_text": "Here are some facts about Mount Vesuvius: 1  Mount Vesuvius is one of the most well known volcanoes in the world. 2  It is located in Italy, on the Gulf of Naples, about 9 miles from the city of Naples. 3  Mount Vesuvius is about 4,190 feet high and measures about 30 miles around its base."}, {"url": "https://simple.wikipedia.org/wiki/Mount_Vesuvius", "passage_text": "Mount Vesuvius (Italian: Monte Vesuvio, Latin: Mons Vesuvius) is a stratovolcano on the Gulf of Naples, Italy. It is about 9 kilometres (5.6 mi) east of Naples. It is the only volcano on the mainland of Europe that erupted in the last 100 years, though it does not erupt now."}, {"url": "http://www.livescience.com/27871-mount-vesuvius-pompeii.html", "passage_text": "Mount Vesuvius, on the west coast of Italy, is the only active volcano on mainland Europe. It is best known because of the eruption in A.D. 79 that destroyed the city of Pompeii."}, {"url": "https://en.wikipedia.org/wiki/Mount_Vesuvius", "passage_text": "Mount Vesuvius is best known for its eruption in AD 79 that led to the burying and destruction of the Roman cities of Pompeii, Herculaneum and several other settlements."}, {"url": "http://www.history.com/topics/ancient-history/pompeii", "passage_text": "Mount Vesuvius, a volcano near the Bay of Naples in Italy, is hundreds of thousands of years old and has erupted more than 50 times. Its most famous eruption took place in the year 79 A.D., when the volcano buried the ancient Roman city of Pompeii under a thick carpet of volcanic ash."}, {"url": "http://primaryfacts.com/1560/mount-vesuvius-facts-about-the-famous-volcano/", "passage_text": "1 Mount Vesuvius is one of the most well known volcanoes in the world. 2  It is located in Italy, on the Gulf of Naples, about 9 miles from the city of Naples. 3  Mount Vesuvius is about 4,190 feet high and measures about 30 miles around its base. 4  Geologists estimate it to be about 17,000 years old."}, {"url": "http://geology.com/volcanoes/vesuvius/", "passage_text": "Vesuvius is the only active volcano in mainland Europe, and has produced some of the continent's largest volcanic eruptions. Located on Italy's west coast, it overlooks the Bay and City of Naples and sits in the crater of the ancient Somma volcano."}]