[{"url": "http://www.answers.com/Q/What_is_vetebral_body_hemangioma", "passage_text": "A hemangioma is a benign tumor that can involve the body of the vertebra. This tumor is often found in the lower thoracic or upper lumbar spine, usually involving only a singl … e vertebra. Interestingly, not all hemangiomas produce symptoms such as pain. "}, {"url": "http://www.merriam-webster.com/dictionary/hemangioma", "passage_text": "Medical Definition of HEMANGIOMA. : a usually benign tumor made up of blood vessels that typically occurs as a purplish or reddish slightly elevated area of skin. ADVERTISEMENT. New Latin, from hem- + angioma. First Known Use: circa 1890."}, {"url": "https://en.wikipedia.org/wiki/Hemangioma", "passage_text": "From Wikipedia, the free encyclopedia. A hemangioma is a benign and usually self-involuting tumor (swelling or growth) of the endothelial cells that line blood vessels that is characterised by increased number of normal or abnormal vessels filled with blood. It usually appears in the first weeks of life and grows most rapidly over the first six months. The terminology used to define, describe and categorize vascular anomalies, abnormal lumps made up of blood vessels, has changed. The term hemangioma originally described any vascular tumor-like structure, whether it was present at or around birth or appeared later in life. Mulliken et al."}, {"url": "http://www.medscape.com/viewarticle/446183_8", "passage_text": "Spinal Hemangiomas. Spinal hemangiomas are the most common benign spinal neoplasms, often located in the thoracic and lumbar spine, with a peak incidence of occurrence in the fourth to sixth decades. They are relatively common, found in 11% of autopsy series. Sixty percent are asymptomatic without gender preference. "}, {"url": "http://www.abta.org/brain-tumor-information/types-of-tumors/hemangioma.html", "passage_text": "A hemangioma is an abnormal buildup of blood vessels in the skin or internal organs. Two types of hemangiomas are discussed here: 1  Hemangioblastoma: These tumors are benign, slow-growing, and well defined. 2  They arise from cells in the linings of blood vessels. 3  Hemangiopericytoma: These are rare, grade II or III tumors. "}, {"url": "http://www.healthguideinfo.com/neurological-disorders/p84162/", "passage_text": "A spinal hemangioma is a tumor that mostly occurs in the thoracic and the lumbar spine. Also referred to as vertebral hemangioma, it is non-cancerous and has few symptoms. This is why most people do not realize that they have this condition unless an imaging test for another condition reveals its presence. "}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/2483579", "passage_text": "Vertebral hemangiomas are benign, malformative vascular tumours composed of newly formed blood vessels with normal (capillary, venous, or veno-capillary) structure and without arterio-venous shunt; they involve firstly the vertebra and may secondary extend to the epidural space. Cavernous angiomas are composed of large dilated blood vessels closely clustered together, so that they are not separated by normal bone tissue. Capillary angiomas are formed of thin-walled capillary vessels of various sizes"}, {"url": "http://medical-dictionary.thefreedictionary.com/hemangioma", "passage_text": "hemangioma. 1. a benign tumor, usually in infants or children, made up of newly formed blood vessels and resulting from malformation of angioblastic tissue of fetal life. 2. a benign or malignant vascular tumor resembling the classic type but occurring at any age. In the majority of cases it appears as a network of small blood-filled capillaries near the surface of the skin, forming a reddish or purplish birthmark. cavernous hemangioma a congenital vascular malformation that has a soft, spongy consistency and may contain a large amount of blood."}, {"url": "http://orthoinfo.aaos.org/topic.cfm?topic=A00630", "passage_text": "A hemangioma is a benign (noncancerous) tumor made up of blood vessels. There are many types of hemangiomas, and they can occur throughout the body, including in skin, muscle, bone, and internal organs. Most hemangiomas occur on the surface of the skin or just beneath it. Bone hemangioma. The hemangiomas that occur in bones typically occur in the skull or spine and are most common in people who are 50 to 70 years of age. Capillary and cavernous types are the most common hemangiomas found in bone. They can grow on the surface or deeper into the center canal of a bone."}]