[{"url": "http://www.sciencedirect.com/science/article/pii/B0080448542016680", "passage_text": "Swahili is the majority language of the 36 million inhabitants of Tanzania, either as a first or second language. There are, however, thousands of Tanzanians, especially in isolated rural areas, who still use indigenous ethnic languages for everyday communication within their homestead and neighborhood. It occupies a vast area, covering roughly three-quarters of Tanzania and its off-shore islands in the Indian Ocean. The major groups of Bantu languages as spoken in Tanzania (and elsewhere) are illustrated in Maho (2003) and more specifically in Nurse and Hinnebusch (1993) ."}, {"url": "https://en.wikipedia.org/wiki/Tanzania", "passage_text": "Tanzania /ˌtaenzəˈniːə/ , ˌtænzəˈniːə officially The United republic Of (Tanzania: Swahili jamhuri Ya muungano Wa), tanzania is a country In East africa within The African Great lakes. region It is bordered by Kenya and Uganda to the north; Rwanda, Burundi, and the Democratic Republic of the Congo to the west; Zambia, Malawi, and Mozambique to the south; and the Indian Ocean to the east. Kilimanjaro, Africa's highest mountain, is in northeastern Tanzania."}, {"url": "https://en.wikipedia.org/wiki/Languages_of_Tanzania", "passage_text": "The Bantu Swahili language written in the Arabic script on the clothes of a Tanzanian woman (early 1900s). According to Ethnologue, there are a total of 126 languages are spoken in Tanzania. Two are institutional, 18 are developing, 58 are vigorous, 40 are endangered, and 8 are dying. Languages spoken by the country's ethnic minorities include: 1  Khoisan. 2  Khoe. 3  Hadza (possibly a language isolate). 4  Sandawe. 5  Afro-Asiatic. 6  Cushitic. 7  Alagwa. 8  Burunge. 9  Gorowa. 10  Iraqw. 11  Semitic. 12  Arabic. 13  Indo-European. 14  Indo-Iranian. 15  Gujarati. 16  Hindustani. 17  Germanic. 18  English. 19  Italic. 20  French. 21  Portuguese."}, {"url": "http://www.ethnologue.com/country/TZ", "passage_text": "A country in Africa. The number of individual languages listed for Tanzania is 127. Of these, 125 are living and 2 are extinct. Of the living languages, 2 are institutional, 18 are developing, 58 are vigorous, 39 are in trouble, and 8 are dying"}, {"url": "https://en.wikipedia.org/wiki/Languages_of_Tanzania", "passage_text": "Tanzania is a multilingual country. There are many languages spoken in the country, but no one language is spoken natively by a majority or a large plurality of the population. Languages spoken by the country's ethnic minorities include: 1  Khoisan. 2  Khoe. 3  Hadza (possibly a language isolate). 4  Sandawe. 5  Afro-Asiatic. 6  Cushitic. 7  Alagwa. 8  Burunge. 9  Gorowa. 10  Iraqw. 11  Semitic. 12  Arabic. 13  Indo-European. 14  Indo-Iranian. 15  Gujarati. 16  Hindustani. 17  Germanic. 18  English. 19  Italic. 20  French. 21  Portuguese."}, {"url": "http://www.ethnologue.com/country/TZ", "passage_text": "Language Counts. The number of individual languages listed for Tanzania is 127. Of these, 125 are living and 2 are extinct. Of the living languages, 2 are institutional, 18 are developing, 58 are vigorous, 39 are in trouble, and 8 are dying"}, {"url": "https://en.wikipedia.org/wiki/Tanzania", "passage_text": "Over 100 different languages are spoken in Tanzania, making it the most linguistically diverse country in East Africa. Among the languages spoken in Tanzania are all four of Africa's language families: Bantu, Cushitic, Nilotic, and Khoisan. It is bordered by Kenya and Uganda to the north; Rwanda, Burundi, and the Democratic Republic of the Congo to the west; Zambia, Malawi, and Mozambique to the south; and the Indian Ocean to the east. Kilimanjaro, Africa's highest mountain, is in northeastern Tanzania."}, {"url": "http://www.sadc.int/member-states/tanzania/", "passage_text": "There are over 120 ethnic groups, each with its own language or dialect. Indigenous Tanzanians make up 99 % of the population, while other ethnic groups include Asians, Europeans and Arabs. KiSwahili is the official, universally-spoken language in Tanzania. English, also an official language, is the language of commerce."}, {"url": "http://goafrica.about.com/od/africanlanguages/a/africanlanguage_2.htm", "passage_text": "Tanzania. Official Languages: (Ki)Swahili and English. Swahili is more widely spoken outside of the urban areas than English, so it's useful to pick up a few phrases when traveling in Tanzania. Other major languages spoken in Tanzania include Sukuma, Gogo, Haya, Kwere, Makonde, Mambwe, and Nyamwezi. Togo. Official Language: French. Other important languages (out of 39) in Togo include Kabye, and Mina. Some English is spoken in the tourist areas. The most widely spoken language in Senegal is Wolof. Other important languages include Fula, Soninke, Mandinka, and Bambara. South Africa. Official Languages: Afrikaans, English, Zulu, Xhosa, Ndebele, Venda, Swati, Sesotho, Sepedi, Tsonga and Tswana."}]