[{"url": "http://www.labormarketinfo.edd.ca.gov/LMID/NAICS.html", "passage_text": "NAICS is the product of a cooperative effort on the part of the statistical agencies of the United States, Canada, and Mexico. Employers with similar production processes are classified in the same industry. NAICS focuses on how products and services are created, as opposed to SIC which focuses on what is produced. "}, {"url": "http://naics-codes.findthedata.com/", "passage_text": "The North American Industry Classification System (NAICS) is the standard used by Federal statistical agencies in classifying business establishments for the purpose of collecting, analyzing, and publishing statistical data related to the U.S. business economy. And although the NAICS code system is used more often today, the SIC system is still being used by some government bodies, including the Securities and Exchange Commission. NAICS industries are identified by a 6-digit code, in contrast to the 4-digit SIC code."}, {"url": "http://www.bls.gov/sae/saewhatis.htm", "passage_text": "NAICS is a New Industry Classification System. After 60 years of use, the outdated Standard Industrial Classification (SIC) system was retired and replaced by the new North American Industry Classification System (NAICS). NAICS is the product of a collaborative effort between the United States, Canada, and Mexico. NAICS doubles the number of top-level groupings of industrial classification. The highest level of NAICS classification is called the sector, and corresponds roughly to the division in SIC. There are 20 broad sectors in NAICS, compared to only 10 divisions in SIC."}, {"url": "http://www.census.gov/eos/www/naics/", "passage_text": "The North American Industry Classification System (NAICS) is the standard used by Federal statistical agencies in classifying business establishments for the purpose of collecting, analyzing, and publishing statistical data related to the U.S. business economy. August 08, 2014 [PDF, 292KB] 2017 North American Industry Classification System (NAICS) Revision-Notice Regarding Implementation of the Factoryless Goods Producer Classification in NAICS 2017; Notices."}, {"url": "http://naics-codes.findthedata.com/", "passage_text": "Today, the NAICS code system is the standard system for industry classification. NAICS Codes and SIC Codes. Both SIC and NAICS codes are used to classify establishments by industry. The NAICS code system was adopted in 1997 to replace the Standard Industrial Classification (SIC) system. And although the NAICS code system is used more often today, the SIC system is still being used by some government bodies, including the Securities and Exchange Commission. NAICS industries are identified by a 6-digit code, in contrast to the 4-digit SIC code."}, {"url": "http://www.mdot.maryland.gov/Office%20of%20Minority%20Business%20Enterprise/Documents/NAICS%20Codes%20Overview.pdf", "passage_text": "US mail at 7201 Corporate Center Dr., Hanover, MD 21076. NAICS Codes. The North American Industry Classification System (NAICS) is a six-digit code used by business and government to classify and measure economic activity in Canada, Mexico and the United States. "}, {"url": "http://naics-codes.findthedata.com/", "passage_text": "The North American Industry Classification System (NAICS) is a numerical system that classifies business establishments by industry. This system is used by Federal statistical agencies for the purpose of collecting, analyzing, and publishing statistical data related to the U.S. business economy. And although the NAICS code system is used more often today, the SIC system is still being used by some government bodies, including the Securities and Exchange Commission. NAICS industries are identified by a 6-digit code, in contrast to the 4-digit SIC code."}, {"url": "http://www.bls.gov/IAG/TGS/iag_index_naics.htm", "passage_text": "Industries by Supersector and NAICS Code. This list of industries included in Industries at a Glance is arranged in North American Industry Classification System (NAICS) code order. Each industry sector and subsector is placed into the appropriate group: Goods-Producing Industries or Service-Providing Industries"}, {"url": "http://siccode.com/en/", "passage_text": "The North American Industry Classification System (NAICS) is used by businesses and governments to classify and measure economic activity in Canada, Mexico, and the United States. NAICS is currently the standard used by federal statistical agencies in classifying ... more info. "}]