[{"url": "http://www.glnc.org.au/grains/types-of-grains/", "passage_text": "Types of Grains. Grains, commonly referred to as ‘cereals’ or ‘cereal grains’, are the edible seeds of specific grasses belonging to the Poaceae (also known as Gramineae) family. Many of these, such as amaranth, buckwheat and quinoa (pronounced ‘keen-wah’), are not actually grains but are in fact seeds from a number of different plant species external to the Poaceae family."}, {"url": "http://www.glnc.org.au/grains/types-of-grains/", "passage_text": "Some types of wheat such as spelt, freekeh, emmer and eikorn are also becoming more popular. True Cereal Grains There are a number of different types of grains found within the true cereal grains which are from the botanical family ‘Poaceae’ including wheat, oats, rice, corn (maize) , barley, sorghum, rye, and millet. Many of these, such as amaranth, buckwheat and quinoa (pronounced ‘keen-wah’), are not actually grains but are in fact seeds from a number of different plant species external to the Poaceae family."}, {"url": "http://www.glnc.org.au/grains/types-of-grains/", "passage_text": "Wheat, oats and rice are the grains most commonly eaten in Australia, with others such as rye, barley, corn, triticale, millet and sorghum making a smaller contribution. Many of these, such as amaranth, buckwheat and quinoa (pronounced ‘keen-wah’), are not actually grains but are in fact seeds from a number of different plant species external to the Poaceae family."}, {"url": "http://www.recipetips.com/kitchen-tips/t--1007/types-of-grain.asp", "passage_text": "Farro is an ancient Italian grain that is similar in taste to barley. In the United States, farro is known as a type of spelt or wheat. It is a hulled grain, meaning that the hull adheres to the grain when harvested, similar to barley and oats. The hull is then removed during processing. Whole Grains. Whole grains undergo the least amount of processing of any form of grain because only the outer hull is removed. This means that whole grains require the longest cooking time of any form of grain, but they are the most nutritious form of grain because the nutrient-rich bran and germ are left intact."}, {"url": "http://www.answers.com/Q/The_seven_types_of_cereal_grain_are", "passage_text": "The  hull protects the endosperm, germ and bran portion of the grain  seed. Cereal grains which have such beards or awns are wheat,  barley, rye and triticale. Rice, corn, and oats do not have such  awns due to the different characteristics of their inflorescences  or flowering portion of the grass plant. 1 person found this useful."}, {"url": "http://www.glnc.org.au/grains/types-of-grains/wheat/", "passage_text": "Wheat has come to be a firm favourite grain because of the diversity it provides in culinary applications. Wheat Types. Many different types of wheat grain exist, with two main types being eaten in Australia, namely bread wheat (Triticum aestivum vulgare) and durum wheat (Triticum turgidum durum). The durum variety is used in the manufacture of pasta while the other type is used to produce most other wheat-based food"}, {"url": "https://en.wikipedia.org/wiki/Food_grain", "passage_text": "Grains are small, hard, dry seeds, with or without attached hulls or fruit layers, harvested for human or animal consumption. Agronomists also call the plants producing such seeds grain crops. The two main types of commercial grain crops are cereals such as wheat and rye, and legumes such as beans and soybeans. Ubiquity of grain as a food source encouraged use of the term to describe other particles with volume or mass similar to an individual seed. After being harvested, dry grains are more durable than other staple foods such as starchy fruits (plantains, breadfruit, etc.) and tubers (sweet potatoes, cassava, and more.)."}, {"url": "http://us.naturespath.com/healthy-foods/ingredients/ancient-grains", "passage_text": "Buckwheat. Don't be fooled! Buckwheat is not actually a type of wheat, it is a fruit seed that is related to rhubarb and sorrel. The triangular seeds it produces are known as buckwheat groats, are the hulled grains of buckwheat; they are three-sided in shape and resemble grains of wheat, oats, or rye. "}, {"url": "https://en.wikipedia.org/wiki/Cereal", "passage_text": "For breakfast cereal, see Breakfast cereal. For food grains in general, see Food grain. For other uses, see Cereal (disambiguation) . A cereal is any true grass cultivated for the edible components of its grain (botanically, a type of fruit called a caryopsis), composed of the endosperm, germ, and bran. Cereal grains are grown in greater quantities and provide more food energy worldwide than any other type of crop; they are therefore staple crops. In their natural form (as in whole grain), they are a rich source of vitamins, minerals, carbohydrates, fats, oils, and protein. When refined by the removal of the bran and germ, the remaining endosperm is mostly carbohydrate."}]