[{"url": "http://www.halalchoices.com.au/what_is_halal.html", "passage_text": "The opposite of halal is haram (forbidden). Food can be forbidden in Islam if it includes: 1  blood. 2  alcohol. 3  meat or any products from a forbidden animal, including pigs and any carnivorous animals or birds of prey. 4  meat or any products of an animal which has not been slaughtered in the correct manner in the name of Allah. So when we are talking about halal foods it means any foods that are allowed to be eaten according to Islamic Sharia law. This means that for any food to be considered halal it must comply with the religious ritual and observance of"}, {"url": "http://mideastfood.about.com/od/middleeasternfood101/a/halalfoods.htm", "passage_text": "In Arabic, the word halal means permitted or lawful. Halal foods are foods that are allowed under Islamic dietary guidelines. According to these guidelines gathered from the Qu'ran, Muslim followers cannot consume the following: 1  pork or pork by products. 2  animals that were dead prior to slaughtering. "}, {"url": "http://www.fao.org/docrep/005/Y2770E/y2770e08.htm", "passage_text": "The term halal may be used for foods which are considered lawful. Under the Islamic Law, all sources of food are lawful except the following sources, including their products and derivatives which are considered unlawful: 3.1.1 Food of Animal Origin. (a) Pigs and boars. (b) Dogs, snakes and monkeys. "}, {"url": "http://www.thekitchn.com/good-question-what-is-halal-me-60979", "passage_text": "Halal is an Arabic word that means permissible.. In terms of food, it means food that is permissible according to Islamic law. For a meat to be certified halal, it cannot be a forbidden cut (such as meat from hindquarters) or animal (such as pork.). The slaughter of a halal animal is called zabihah and there are certain guidelines to follow:"}, {"url": "http://www.eat-halal.com/what-is-definition-of-halal/", "passage_text": "Allah is Forgiving, Merciful. Al-Baqara 2:173. The word ‘Halal’ (حلال) is an Arabic word which literally means permissible. And in translation it is usually used as lawful/allowed/acceptable and it’s a term which is applied to all aspects of life and covers not only food and drink, but also all matters of daily life. "}, {"url": "http://halalfoodauthority.com/definition-of-halal/", "passage_text": "DEFINITION OF HALAL. The word ‘halal’ literally means permissible-and in translation it is usually used as lawful. The Halal food Authority rules for halal are based on Islamic Shari’ah. The antonym to halal is haram, which means unlawful or forbidden. It is well known in the meat trade that Muslims consume halal meat. Now to make meat halal or permissible, an animal or poultry has to be slaughtered in a ritual way known as Zibah or Zabihah. To make it readily comprehended halal is somewhat like Jewish kosher and, Zibah is with some exception similar to Shechita."}, {"url": "http://www.halalchoices.com.au/what_is_halal.html", "passage_text": "Halal simply means permitted or lawful. So when we are talking about halal foods it means any foods that are allowed to be eaten according to Islamic Sharia law. This means that for any food to be considered halal it must comply with the religious ritual and observance of Sharia law."}, {"url": "https://en.wikipedia.org/wiki/Halal", "passage_text": "A halal sign in Chinese (清真) at a restaurant in Taipei, Taiwan. Halal is often used in reference to foods and drinks, i.e. foods that are permissible for Muslims to eat or drink under Islamic Shariʻah (law). The criteria specifies both what foods are allowed, and how the food must be prepared. The foods addressed are mostly types of meat and animal tissue. The most common example of non-halal (or haraam) food is pork (pig meat). While pork is the only meat that cannot be eaten by all Muslims at all (the Quran forbids it), foods other than pork can also be haraam."}, {"url": "https://en.wikipedia.org/wiki/Halal", "passage_text": "It is one of five الأحكام الخم سة (al-ahkam al-khamsah) — fard (compulsory), mustahabb (recommended), halal (allowed), makruh (disliked), haram (forbidden)—that define the morality of human action in Islam. Mubah is also used to mean permissible or allowed in Islam The foods addressed are mostly types of meat and animal tissue. The most common example of non-halal (or haraam) food is pork (pig meat). While pork is the only meat that cannot be eaten by all Muslims at all (the Quran forbids it), foods other than pork can also be haraam."}]