[{"url": "http://www.answers.com/Q/Mixture_of_hydrocarbons_that_are_used_for_fuels", "passage_text": "Like many other organic compunds, hydrocarbons mix poorly with water. Also, all hydrocarbons are flammable. Being flammable means that they burn easily. When hydrocarbons burn … , they realease a great deal of energy. For this reason, they are used as fuel for stoves, heaters, cars, buses, and airplanes."}, {"url": "http://www.bbc.co.uk/schools/gcsebitesize/science/aqa_pre_2011/rocks/fuelsrev1.shtml", "passage_text": "Hydrocarbons. Most of the compounds in crude oil are hydrocarbons. This means that they only contain hydrogen and carbon atoms, joined together by chemical bonds. There are different types of hydrocarbon, but most of the ones in crude oil are alkanes. Hydrocarbons and alkanes. Most of the compounds in crude oil are hydrocarbons. This means that they only contain hydrogen and carbon atoms, joined together by chemical bonds. There are different types of hydrocarbon, but most of the ones in crude oil are alkanes."}, {"url": "http://www.chegg.com/homework-help/questions-and-answers/hydrocarbon-mixtures-used-fuels-many-grams-co2-g-produced-combustion-200-g-mixture-250-ch4-q1011913", "passage_text": "Hydrocarbon mixtures are used as fuels. a) how many grams of CO2(g) are produced by the combustion of 200. g of a mixture that is 25.0% CH4 and 75.0% C3H8 by mass? b) A 252 g gaseous mixture of CH4 and C3H8 burns in excess O2, and 748 g of CO2 gas is collected. What is the mass % of CH4 in the mixture? "}, {"url": "http://hyperphysics.phy-astr.gsu.edu/hbase/Organic/alkane.html", "passage_text": "Methane, ethane, propane and butane are gases and used directly as fuels. Alkanes from pentane up to around C 17 H 36 are liquids. Gasoline is a mixture of alkanes from pentane up to about decane. Kerosene contains alkanes from about n=10 to n=16. Above n=17 they are solids at room temperature. Alkanes with higher values of n are found in diesel fuel, fuel oil, petroleum jelly, paraffin wax, motor oils, and for the highest values of n, asphalt."}, {"url": "http://home.freeuk.net/braybrook/6-1/Chains_and_rings/hydrocarbon_fuels.htm", "passage_text": "Petroleum or crude oil is a mixture of hydrocarbons, mainly alkanes, formed by the decay of the remains of sea creatures and plants over millions of years. Fractional distillation. The complex mixture of hydrocarbons is separated into smaller mixtures or fractions by fractional distillation (primary distillation). The crude oil is heated and the vapour/ liquid mixture passed into a tower. Combustion of alkanes. In common with all hydrocarbons, alkanes bum in air or oxygen in very exothermic reactions. In the presence of a plentiful supply of oxygen, complete combustion of alkanes occurs to form carbon dioxide and water."}, {"url": "http://journeytoforever.org/biofuel_library/ethanol_motherearth/me1.html", "passage_text": "Alcohol as an Engine Fuel. Before you begin to convert your automobile or truck engine to use alcohol, it's important that you understand the properties of-and the differences between-the two fuels. Gasoline is a complex mixture of hydrocarbons ... substances comprising just hydrogen and carbon atoms. These hydrocarbons can appear in all forms (as a gas, liquid, or solid), but for our purposes, we're concerned with the fuel in its liquid state. "}, {"url": "http://www.petroleum.co.uk/alkane-chemistry", "passage_text": "Here is how to understand it. Any saturated hydrocarbon (will have the formula C n H 2n+2) is a paraffin and a mixture of these molecules can be used to make a wax called paraffin wax. In general, the alkanes used in this wax have carbons chains that contain 20 to 40 carbons. Thus, paraffin wax is a type of wax made from paraffins or alkanes. "}, {"url": "http://dieselnet.com/tech/fuel_diesel.php", "passage_text": "Diesel fuel is a mixture of hydrocarbons—with boiling points in the range of 150 to 380°C—which are obtained from petroleum. Petroleum crude oils are composed of hydrocarbons of three major classes: (1) paraffinic, (2) naphthenic (or cycloparaffinic), and (3) aromatic hydrocarbons. Most of the compounds in diesel fuel are hydrocarbons of the paraffinic, naphthenic, or aromatic class. Diesel fuel also contains small quantities of organic compounds of sulfur (e.g., dibenzothiophene), nitrogen (e.g., carbazole), and oxygen."}, {"url": "http://dieselnet.com/tech/fuel_diesel.php", "passage_text": "Abstract: Diesel fuel is a mixture of hydrocarbons obtained by distillation of crude oil. The important properties which are used to characterize diesel fuel include cetane number (or cetane index), fuel volatility, density, viscosity, cold behavior, and sulfur content. Most of the compounds in diesel fuel are hydrocarbons of the paraffinic, naphthenic, or aromatic class. Diesel fuel also contains small quantities of organic compounds of sulfur (e.g., dibenzothiophene), nitrogen (e.g., carbazole), and oxygen."}]