[{"url": "http://www.graduatenursingedu.org/family-nurse-practitioner/", "passage_text": "The American Academy of Nurse Practitioners (AANP) also offers a national certification in family practice. To qualify for this certification, applicants must hold a current and active RN license and a master’s, post-master’s, or doctoral degree from an adult, gerontologic or family nurse practitioner program. Often, registered nurses complete a general graduate degree in nursing and then go on to complete a post-graduate certificate program for family nurse practitioners."}, {"url": "http://www.nursecredentialing.org/", "passage_text": "The mission of the American Nurses Credentialing Center (ANCC), a subsidiary of the American Nurses Association (ANA), is to promote excellence in nursing and health care globally through credentialing programs. "}, {"url": "http://www.aacn.org/WD/Certifications/Content/consumer-whatiscert.pcms?menu=Certification", "passage_text": "Certification is a process by which a nongovernmental agency validates, based upon predetermined standards, an individual nurse’s qualifications for practice in a defined functional or clinical area of nursing. CCRN-K TM certification is for the nursing professional who in their practice applies knowledge in a way that influences patients, nurses and/or organizations to have a positive impact on acutely and/or critically ill patients but does not work at the bedside."}, {"url": "http://www.aacn.org/WD/Certifications/Content/consumer-whatiscert.pcms?menu=Certification", "passage_text": "CCNS ® certification is an entry-level advanced practice certification for nurses educated at the graduate level as clinical nurse specialists working with acutely and/or critically ill patients. CCNS may be used by nurses in some states to help them qualify for advanced practice nursing licensure. CCRN-K TM certification is for the nursing professional who in their practice applies knowledge in a way that influences patients, nurses and/or organizations to have a positive impact on acutely and/or critically ill patients but does not work at the bedside."}, {"url": "https://en.wikipedia.org/wiki/Nursing_credentials_and_certifications", "passage_text": "Registered nurses (RNs) are not required to be certified in a certain specialty by law. For example, it is not necessary to be a certified medical-surgical registered nurse (CMSRN) (a medical surgical nursing certification) to work on a medical-surgical (med-surg) floor, and most med-surg nurses are not CMSRNs. Some hospitals and other health care facilities are willing to pay a certified nurse extra when he or she works within their specialty. Also, some hospitals may require certain nurses, such as nursing supervisors or lead nurses, be certified. Certification instills confidence in the nurse"}, {"url": "https://en.wikipedia.org/wiki/Family_Nurse_Practitioner", "passage_text": "(Redirected from Family Nurse Practitioner). A family nurse practitioner (FNP) is a nurse practitioner who provides continuing and comprehensive healthcare for the individual and family across all ages, genders, diseases, and body systems. "}, {"url": "http://www.graduatenursingedu.org/family-nurse-practitioner/", "passage_text": "Family Nurse Practitioner (FNP). Family nurse practitioners (FNP) are advanced practice registered nurses who work autonomously or in collaboration with other healthcare professionals to deliver family-focused care. Often, registered nurses complete a general graduate degree in nursing and then go on to complete a post-graduate certificate program for family nurse practitioners."}, {"url": "http://www.nursecredentialing.org/certification/", "passage_text": "ANCC Certification Center. Trusted for its commitment to quality, the ANCC Certification Program is nationally renowned as a true gauge of a nurse's ability to provide excellent care. Colleagues and employers respect ANCC-certified nurses as experts in their specialties. Advance your career by earning certification through ANCC"}]