[{"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-932-CHROMIUM.aspx?activeIngredientId=932&activeIngredientName=CHROMIUM", "passage_text": "Chromium is a metal. It is called an “essential trace element” because very small amounts of chromium are necessary for human health. Chromium is used for improving blood sugar control in people with prediabetes, type 1 and type 2 diabetes, and high blood sugar due to taking steroids."}, {"url": "http://www.drpelletier.com/TBAM/excerpts/037-Chromium_Supplem.html", "passage_text": "Trivalent chromium, the form found in the diet, has very low toxicity and a great margin of safety, but hexavalent chromium is toxic, and long-term occupational exposure can lead to skin problems, perforated nasal septum, and lung cancer. "}, {"url": "http://lpi.oregonstate.edu/mic/minerals/chromium", "passage_text": "In contrast, there is little evidence that trivalent chromium (chromium III; Cr 3+) is toxic to humans. The toxicity from oral intakes is considered to be low because ingested chromium is poorly absorbed, and most absorbed chromium is rapidly excreted in the urine (55) . Most of the concerns regarding the long-term safety of trivalent chromium supplementation arise from several studies in cell culture, suggesting trivalent chromium, especially in the form of chromium picolinate, may increase DNA damage (56-58) ."}, {"url": "http://ods.od.nih.gov/factsheets/Chromium-HealthProfessional/", "passage_text": "Chromium is a mineral that humans require in trace amounts, although its mechanisms of action in the body and the amounts needed for optimal health are not well defined. Chromium supplements are sometimes claimed to reduce body fat and increase lean (muscle) mass. Yet a recent review of 24 studies that examined the effects of 200 to 1,000 mcg/day of chromium (in the form of chromium picolinate) on body mass or composition found no significant benefits [ 11 ]."}, {"url": "https://en.wikipedia.org/wiki/Chromium", "passage_text": "Trivalent chromium (Cr(III)) ion is possibly required in trace amounts for sugar and lipid metabolism, although the issue remains in debate. In larger amounts and in different forms, chromium can be toxic and carcinogenic. The most prominent example of toxic chromium is hexavalent chromium (Cr(VI)). Chromium is a chemical element with symbol Cr and atomic number 24. It is the first element in Group 6. It is a steely-gray, lustrous, hard and brittle metal which takes a high polish, resists tarnishing, and has a high melting point."}, {"url": "http://www.livestrong.com/article/209468-what-is-the-difference-between-chromium-chromium-picolinate/", "passage_text": "In nutrition, “chromium” refers to trivalent chromium, the form present in food and used by the body. Chromium picolinate is a supplemental form of trivalent chromium. Like many minerals, chromium is difficult to absorb. Binding it to an organic compound like picolinate may make chromium easier to absorb. Researchers are focused on understanding the potential role of chromium in insulin resistance and Type 2 diabetes. Chromium picolinate, chromium chloride, chromium nicotinate and chromium citrate are types of chromium supplements. These can be purchased as individual supplements or as part of a multivitamin and mineral complex. Supplements generally provide anywhere between 50 micrograms and 200 micrograms of chromium per serving."}, {"url": "https://en.wikipedia.org/wiki/Chromium(III)_picolinate", "passage_text": "Chromium (III) picolinate (CrPic 3) is a chemical compound sold as a nutritional supplement to treat type 2 diabetes and promote weight loss. This bright-red coordination compound is derived from chromium (III) and picolinic acid. Chromium has been identified to regulate insulin by increasing the sensitivity of the insulin receptor. As such, chromium (III) picolinate has been used as a treatment for type 2 diabetes, although its effectiveness remains controversial due to conflicting and/or poorly carried out clinical studies."}, {"url": "https://en.wikipedia.org/wiki/Chromium(III)_picolinate", "passage_text": "A study in 1989 suggested that chromium (III) picolinate may assist in weight loss and increase muscle mass which led to an increase in the usage of chromium (III) picolinate supplements, making it the second most widely used supplement behind Ca 2+ supplements. Chromium has been identified to regulate insulin by increasing the sensitivity of the insulin receptor. As such, chromium (III) picolinate has been used as a treatment for type 2 diabetes, although its effectiveness remains controversial due to conflicting and/or poorly carried out clinical studies."}, {"url": "http://umm.edu/health/medical/altmed/supplement/chromium", "passage_text": "Overview. Chromium is an essential mineral that plays a role in how insulin helps the body regulate blood sugar levels. Insulin is a hormone that your body uses to change sugar, starches, and other food into the energy you need for daily activities. "}, {"url": "http://lpi.oregonstate.edu/mic/minerals/chromium", "passage_text": "1 Chromium (Cr 0) is an ubiquitous trace metal. 2  The predominant chromium form in the body is trivalent chromium (Cr 3+), which may play a role in normal insulin function. ( 3 More information). 4  Trivalent chromium has been proposed to be the cofactor for an oligopeptide called chromodulin. Most of the concerns regarding the long-term safety of trivalent chromium supplementation arise from several studies in cell culture, suggesting trivalent chromium, especially in the form of chromium picolinate, may increase DNA damage (56-58) ."}]