[{"url": "http://www.diercke.com/kartenansicht.xtp?artId=978-3-14-100790-9&seite=144&id=17630&kartennr=2", "passage_text": "Super volcano. Today's caldera of Yellowstone National Park was created in the last major eruption of the volcano about 640,000 years ago. Under the caldera is a huge magma chamber located approximately eight kilometres deep, which is now almost filled with lava. Caldera, which lies at the heart of Yellowstone National Park, is the tip of a huge volcano, which is in turn, bound to a hot spot. This is a fixed point within the earth's crust, where hot magma rises to the top."}, {"url": "http://www.extremescience.com/calderas.htm", "passage_text": "Caldera Volcanoes. View a satellite map of the Yellowstone Caldera. Caldera volcanoes are the Extreme Volcanoes. These are the most powerful and catastrophic types of volcanoes in a category by themselves because of the unique way in which they form. This type of volcano is shaped more like an inverse volcano."}, {"url": "http://geology.com/articles/caldera/", "passage_text": "Calderas are some of the most spectacular features on Earth. They are large volcanic craters that form by two different methods: 1) an explosive volcanic eruption; or, 2) collapse of surface rock into an empty magma chamber. The image at right is a satellite view of one of the most famous calderas-Crater Lake in Oregon."}, {"url": "http://volcano.oregonstate.edu/rhyolite-caldera-complexes", "passage_text": "Rhyolite caldera complexes are the most explosive of Earth's volcanoes but often don't even look like volcanoes. They are usually so explosive when they erupt that they end up collapsing in on themselves rather than building any tall structure (George Walker has termed such structures inverse volcanoes). "}, {"url": "http://volcanoes.usgs.gov/volcanoes/yellowstone/yellowstone_geo_hist_52.html", "passage_text": "Yellowstone's world-famous natural history is marked by such colossal volcanic events that their reflections in today's landscape are difficult to grasp and impossible to take in at just a glance, even for those familiar with the signs of past volcanism. Yellowstone's volcanism is only the most recent in a 17 million-year history of volcanic activity that has occurred progressively from southwestern Idaho to Yellowstone National Park."}, {"url": "http://www.diercke.com/kartenansicht.xtp?artId=978-3-14-100790-9&seite=144&id=17630&kartennr=2", "passage_text": "Origin of the Yellowstone Caldera. Caldera, which lies at the heart of Yellowstone National Park, is the tip of a huge volcano, which is in turn, bound to a hot spot. This is a fixed point within the earth's crust, where hot magma rises to the top. This accumulates below the earth's surface, thereby forming an underground magma chamber"}, {"url": "http://geology.com/articles/caldera/", "passage_text": "Centuries of rain and snow filled the caldera creating Crater Lake. With a depth of 1932 feet (589 meters), Crater Lake is the deepest lake in the United States and the seventh deepest lake in the world. Collapse calderas form when a large magma chamber is emptied by a volcanic eruption or by subsurface magma movement. The unsupported rock that forms the roof of the magma chamber then collapses to form a large crater. Crater Lake and many other calderas are thought to have formed by this process. They are large volcanic craters that form by two different methods: 1) an explosive volcanic eruption; or, 2) collapse of surface rock into an empty magma chamber. The image at right is a satellite view of one of the most famous calderas-Crater Lake in Oregon."}, {"url": "https://en.wikipedia.org/wiki/Caldera", "passage_text": "Example of the formation of a caldera, the pictures show Mount Mazama 's eruption timeline. A caldera is a cauldron-like volcanic feature on large central volcanoes, a special sort of volcanic crater (from one to several kilometers in diameter), formed when a magma chamber was emptied. The depression then originated either in very big explosive eruptions or in erosion and collapse of the magma chamber roof. The previous emptying of this magma chamber is often accomplished during a series of effusive eruptions in the volcanic system, even kilometers away from the magma chamber itself."}, {"url": "http://www.thefreedictionary.com/caldera", "passage_text": "caldera. n. 1. (Physical Geography) a large basin-shaped crater at the top of a volcano, formed by the collapse or explosion of the cone. See cirque. [C19: from Spanish Caldera (literally: cauldron), name of a crater in the Canary Islands]. (kaelˈdɛr kælˈdɛr, ə-). kɔl., n. pl Noun. 1. caldera-a large crater caused by the violent explosion of a volcano that collapses into a depression. crater, volcanic crater-a bowl-shaped geological formation at the top of a volcano."}, {"url": "https://en.wikipedia.org/wiki/Yellowstone_Caldera", "passage_text": "The Yellowstone Caldera is the volcanic caldera and supervolcano located in Yellowstone National Park in the United States, sometimes referred to as the Yellowstone Supervolcano. The caldera and most of the park are located in the northwest corner of Wyoming. "}]