[{"url": "http://www.everythingpies.com/custard-pie-recipes/", "passage_text": "Even though the chances are very low, your eggs may contain Salmonella. A custard is a liquid that is thickened with eggs. The liquid is usually some kind of milk or cream. Some custards contain whole eggs and some just egg yolks. Crust for custards can be par-baked, fully blind-baked and in the rare condition uncooked. Taste the milk before adding to your filling. It might be sour. "}, {"url": "http://whatscookingamerica.net/BakedCustard.htm", "passage_text": "Mix in hot milk until blended. Pour egg mixture into prepared custard cups. Sprinkle with nutmeg or cinnamon. Bring the water for the water bath to a light simmer on top of the stove; carefully pour hot water into the baking pan to come at least half-way up the sides of the custard cups. Carefully pour hot water into the baking pan to come up the sides of the custard cups. Definition of Water Bath or Bain-Marie (bahn mah-REE) - A hot water bath or bain-marie are used to cook custards and baked eggs in the oven without curdling or cracking, and also used to hold sauces and to clarify butter."}, {"url": "https://en.wikipedia.org/wiki/Custard", "passage_text": "Custard is a variety of culinary preparations based on a cooked mixture of milk or cream and egg yolk. In a traditional custard such as a creme crème, anglaise where egg is used alone as a, thickener boiling results in the over cooking and 'subsequent' curdling of the; custard, however in a pastry, cream starch prevents. this"}, {"url": "http://allrecipes.com/recipe/234837/egg-custard/", "passage_text": "1 Whisk milk, eggs, sugar, salt, and vanilla together in a bowl until completely combined. 2  Pour egg mixture into 6 custard cups; sprinkle tops with nutmeg. 3  Place cups in a baking pan and fill pan with enough hot water to reach halfway up the sides of the custard cups. 1 Pour egg mixture into 6 custard cups; sprinkle tops with nutmeg. 2  Place cups in a baking pan and fill pan with enough hot water to reach halfway up the sides of the custard cups. 3  Bake in the preheated oven until custards are set, about 1 hour. 4  Cool completely"}, {"url": "https://en.wikipedia.org/wiki/Custard", "passage_text": "Depending on how much egg or thickener is used, custard may vary in consistency from a thin pouring sauce (creme crème) anglaise to a thick pastry (cream creme) crème patissiere pâtissière used. to fill eclairs éclairs In a traditional custard such as a creme crème, anglaise where egg is used alone as a, thickener boiling results in the over cooking and 'subsequent' curdling of the; custard, however in a pastry, cream starch prevents. this"}, {"url": "http://www.legendairy.com.au/dairy-foods/dairy-products/custard", "passage_text": "Baked custards are usually cooked in a ‘bain marie’ or water bath. A water bath helps slow the transfer of the heat from the oven to the custard mixture and helps prevent curdling. Stirred. Usually sweet, stirred custards are either cooked on the stovetop or in a double boiler (bowl over a saucepan of boiling water). The custard is then stirred until it is thick enough to coat the back of a spoon. Great care needs to be taken to ensure the mixture does not overheat, causing a curdled appearance. Baked. Popular either as a savoury custard such as in quiche, with its numerous choices of fillings, or as a sweet custard such as in creme créme caramel or bread and butter. Pudding baked custards are usually cooked in ‘a bain’ marie or water. bath"}, {"url": "http://quantumm12.imascientist.org.uk/2012/03/is-custard-a-solid-or-a-liquid", "passage_text": "Martin Zaltz Austwick answered on 19 Mar 2012: Ah it depends on whether you mean custard in custard tarts. Because that’s more like a solid than a liquid! The proteins in the egg stick to one another and make a sort of lattice with water trapped inside. 😛. Actually, it’s a colloidal solution, which is solid particles suspended in a liquid. That’s why it can flow like a liquid and take the shape of it’s container, but if you put pressure on it, all the solid parts lock together and it starts behaving like a solid."}, {"url": "http://www.finecooking.com/articles/custards.aspx", "passage_text": "Technically, a custard is any liquid thickened by eggs, and in most cases that liquid is cream or milk. It’s a marriage made in heaven: The creaminess of the dairy is enhanced by the silky, emulsifying properties of egg yolks to create an irresistible texture. "}, {"url": "https://en.wikipedia.org/wiki/Custard", "passage_text": "Custard is usually cooked in a double boiler (bain-marie), or heated very gently in a saucepan on a stove, though custard can also be steamed, baked in the oven with or without a water bath, or even cooked in a pressure cooker. In a traditional custard such as a creme crème, anglaise where egg is used alone as a, thickener boiling results in the over cooking and 'subsequent' curdling of the; custard, however in a pastry, cream starch prevents. this"}]