[{"url": "http://www.healthline.com/health/serum-phosphorus", "passage_text": "Normal Serum Phosphorus Test Results. Serum phosphorus is measured in milligrams of phosphorus per deciliter of blood (mg/dL). A normal range is generally 2.4 to 4.1 mg/dL. The normal range varies slightly depending on your age. It’s natural for children to have higher phosphorus levels because they need more of this mineral to help their bones develop."}, {"url": "http://www.medicalhealthtests.com/blood-tests/blood-phosphate-level.html", "passage_text": "Phosphorus is an important element which is useful for the synthesis of bones and teeth. Apart from that phosphorous is also useful in maintaining normal functioning of the nerves and the contraction of the muscles. A huge chunk of the phosphorus present in our body is in the form of bones."}, {"url": "https://www.nlm.nih.gov/medlineplus/ency/article/003478.htm", "passage_text": "Normal values range from 2.4 - 4.1 milligrams per deciliter (mg/dL). Normal value ranges may vary slightly among different laboratories. Some labs use different measurements or test different samples. Talk to your doctor about the meaning of your specific test results."}, {"url": "http://www.medicalhealthtests.com/askquestion/1332/what-are-the-normal-phosphorus-levels-in-blood.html", "passage_text": "Normal phosphorus levels for patients who are on dialysis are 3.5 to 5.5 mg/dL. A phosphate test is usually recommended to check for the proper functioning of the parathyroid glands, bones and functioning of the kidneys. The normal phosphorous levels in the blood for children are 4.5 to 6.5 mg/dL."}, {"url": "http://emedicine.medscape.com/article/2090666-overview", "passage_text": "Reference Range. Phosphate concentration is characterized by a high physiological variation, depending on age, gender, physiological state (eg, pregnancy), and even season (due to the seasonal variation of vitamin D which is directly involved in the regulation of phosphate concentration)."}, {"url": "http://www.medicalhealthtests.com/blood-tests/blood-phosphate-level.html", "passage_text": "Results of a phosphate test are usually available in a couple of hours. Normal range of phosphate in blood for adults is 3 to 4.5 mg/dL (milligrams per deciliter). In children, phosphate levels are generally higher given bone growth and the normal range is 4.5 to 6.5 mg/dL and in infants the range is 4.3 to 9.3 mg/dL."}, {"url": "http://www2.kidney.org/professionals/KDOQI/guidelines_pedbone/guide5.htm", "passage_text": "5.3 After initiation of phosphorus restriction, serum phosphorus concentrations should be monitored at least every 3 months in patients with CKD Stages 3-4, and monthly in patients with CKD Stage 5. Serum phosphorus values below the target range for age should be avoided."}, {"url": "http://www.webmd.com/a-to-z-guides/phosphate-in-urine?page=2", "passage_text": "Results. The phosphate urine test measures the amount of phosphate in a sample of urine collected over 24 hours (24-hour urine test). Phosphate is a charged particle (ion) that contains the mineral phosphorus."}]