[{"url": "https://www.worldwidehealth.com/health-article-Manuka-Honey-and-Arthritis-the-New-Zealand-Honey-with-natural-analgesic-qualities.html", "passage_text": "The Manuka bush, is a part of the Tea Tree family from Australia, and has been used by generations of Maori tribes for its unique healing properties to combat day to day ailments. Manuka Honey contains anti-inflammatory properties that can be used as a natural pain reliever."}, {"url": "http://www.inflammation-information.com/pure-manuka-honey.html", "passage_text": "Pure Manuka Honey has natural anti-inflammatory properties that are extremely effective in treating these conditions. In addition, it has the ability to get into the depths of skin tissue to get to affected areas."}, {"url": "http://manukahoneyinfo.blogspot.com/2008/02/pain-relief-for-arthritis-sufferers.html", "passage_text": "The reason why Manuka Honey is effective in treating arthritis is because it has natural anti-inflammatory properties. In forms of Arthritis that are more tissue than bone related, Manuka Honey can reduce inflammation, providing a natural form of pain relief. Anything that is applied to the skin is absorbed into the body. Manuka Honey has a way of diffusing deep into the skin, getting to the effected area."}, {"url": "https://www.worldwidehealth.com/health-article-Manuka-Honey-and-Arthritis-the-New-Zealand-Honey-with-natural-analgesic-qualities.html", "passage_text": "Manuka Honey and Arthritis-the New Zealand Honey with natural analgesic qualities. This article has been viewed 26540 times. View article disclaimer and terms Tags: Manuka Honey, Arthritis help, Rheumatoid Arthritis. Manuka Honey is now being used for its natural pain relieving properties in the treatment of"}, {"url": "http://www.bbc.co.uk/2/hi/health/8132851.stm", "passage_text": "Professor Alan Silman of the Arthritis Research Campaign. The Manuka honey with added bee venom has been available in New Zealand for 13 years and its makers say although it does contain a venom, it has proved extremely safe."}, {"url": "http://yogabycandace.com/blog/2013/2/25/how-manuka-honey-changed-my-life", "passage_text": "Some honey is more potent than others, and manuka honey is the cream of the crop. Manuka honey comes from New Zealand by bees that pollinate the manuka bush. It contains methylglyoxal (MG). MG is found in most types of honey but in small quantities."}, {"url": "http://www.benefits-of-honey.com/arthritis-pain.html", "passage_text": "Manuka honey which has been known to have higher antibacterial activity than other types honey is also gaining popularity in treating arthritis pain due to its natural anti-inflammatory properties and healing power. It reduces joint inflammation and provides a natural form of pain relief."}]