[{"url": "http://www.famousscientists.org/linus-pauling/", "passage_text": "Linus Pauling was an American theoretical physical chemist and activist. He remains one of the greatest chemists ever, and the only person in history to be awarded two unshared Nobel Prizes; in 1954 for studying the nature of the chemical bond, and in 1962 for his efforts regarding the prohibition of nuclear testing. Early Life and Education: Born in Portland, Oregon in 1901 to a pharmacist father, Linus Pauling acquired his undergraduate degree in chemical engineering from Oregon Agricultural College in Corvallis (now Oregon State University), where he also worked as a lecturer for about one year."}, {"url": "http://www.nobelprize.org/nobel_prizes/chemistry/laureates/1954/pauling-facts.html", "passage_text": "Chemist and Peace Activist. One person, Linus Pauling, has won two undivided Nobel Prizes. In 1954 he won the Prize for Chemistry. Eight years later he was awarded the Peace Prize for his opposition to weapons of mass destruction. The atom bombs dropped on Hiroshima and Nagasaki were a turning point in Pauling's life."}, {"url": "https://en.wikipedia.org/wiki/Linus_Pauling", "passage_text": "Pauling is also one of only two people to be awarded Nobel Prizes in different fields, the other being Marie Curie. Pauling also worked on DNA 's structure, a problem which was solved by James Watson, Francis Crick and Maurice Wilkins. He was named Linus Carl, in honor of Lucy's father, Linus, and Herman's father, Carl. In 1901, after his sister Pauline was born, Pauling's parents decided to move out of Portland, to find more affordable and spacious living quarters than their one-room apartment."}, {"url": "http://www.newworldencyclopedia.org/entry/Linus_Pauling", "passage_text": "Linus Carl Pauling (February 28, 1901 – August 19, 1994) was an American quantum chemist and biochemist. He was also acknowledged as a crystallographer, molecular biologist, and medical researcher. Pauling is widely regarded as the premier chemist of the twentieth century. He pioneered the application of quantum mechanics to chemistry, and in 1954 was awarded the Nobel Prize in chemistry for his work describing the nature of chemical bonds."}, {"url": "http://www.nobelprize.org/nobel_prizes/chemistry/laureates/1954/pauling-bio.html", "passage_text": "Linus Pauling-Biographical. Linus Carl Pauling was born in Portland, Oregon, on 28th February, 1901, the son of a druggist, Herman Henry William Pauling, who, though born in Missouri, was of German descent, and his wife, Lucy Isabelle Darling, born in Oregon of English-Scottish ancestry. In 1963, he was awarded the Nobel Peace Prize. Pauling is a member of numerous professional societies in the U.S.A. as well as in many European countries, India, Japan and Chile."}, {"url": "http://www.paulingtherapy.com/", "passage_text": "Linus Pauling and Matthias Rath alerted the world to the cause of heart disease in 1989 -- a chronic, sub-clinical vitamin C deficiency -- due to a missing liver enzyme caused by the ancient GULO genetic defect in primate DNA. Linus Pauling's specific therapy for cardiovascular and heart diseases are high dosages of two essential nutrients; vitamin C and the amino acid lysine. Vitamin C is required to strengthen arteries so that the body does not try to patch arteries with plaster casts (atherosclerosis)"}, {"url": "https://en.wikipedia.org/wiki/Linus_Pauling", "passage_text": "Linus Carl Pauling (February 28, 1901 – August 19, 1994) was an American chemist, biochemist, peace activist, author, and educator. He was named Linus Carl, in honor of Lucy's father, Linus, and Herman's father, Carl. In 1901, after his sister Pauline was born, Pauling's parents decided to move out of Portland, to find more affordable and spacious living quarters than their one-room apartment."}, {"url": "https://en.wikipedia.org/wiki/Linus_Pauling", "passage_text": "Pauling was born in Portland, Oregon, the first-born child of Herman Henry William Pauling (1876–1910) and Lucy Isabelle Belle Darling (1881–1926). He was named Linus Carl, in honor of Lucy's father, Linus, and Herman's father, Carl. In 1901, after his sister Pauline was born, Pauling's parents decided to move out of Portland, to find more affordable and spacious living quarters than their one-room apartment."}]