[{"url": "http://www.summitmedicalgroup.com/library/adult_health/sma_shin_pain/", "passage_text": "View image. Shin pain is pain on the front of your lower leg between the knee and the ankle. It can hurt directly over your shinbone (tibia) or over the muscles that are on the inner or outer side of the tibia. Shin pain has often been called shin splints. Stress fractures of the fibula cause pain on the outer side of your lower leg. With medial tibial stress syndrome, you will have pain and tenderness along the edge of the shinbone, especially along the muscles."}, {"url": "http://orthoinfo.aaos.org/topic.cfm?topic=A00522", "passage_text": "The lower leg is made up of two bones: the tibia and fibula. The tibia is the larger of the two bones. It supports most of your weight and is an important part of both the knee joint and ankle joint. The long bones include the femur, humerus, tibia, and fibula. A tibial shaft fracture occurs along the length of the bone, below the knee and above the ankle."}, {"url": "http://emedicine.medscape.com/article/1898986-overview", "passage_text": "Femur, tibia, fibula, and patella. The knee is composed of 4 bones: the femur, tibia, fibula and patella. All these bones are functional in the knee joint, except for the fibula. The femur is the longest and strongest bone in the human body. The tibia lies distal to the femur and medial to the fibula. The proximal end consists of medial and lateral condyles, an intercondylar area, and the tibial tuberosity that articulates with the medial and lateral condyles of the femur. Distally, the tibia articulates with the ankle."}, {"url": "http://www.childrenshospital.org/conditions-and-treatments/conditions/broken-tibia-fibula-shin-bone-calf/symptoms-and-causes", "passage_text": "The tibia and fibula are the two long bones in the lower leg. They are closely linked at the knee and ankle, but they are two separate bones. Tibia. 1  The tibia is the bone that forms the shin and is the larger of the two lower-leg bones. 2  The top of the tibia connects to the knee joint and the bottom of the tibia connects to the ankle joint. 3  Although this bone carries all the body’s weight, it needs support from the fibula"}, {"url": "http://www.runnersworld.com/injury-treatment/a-primer-on-lower-leg-pain", "passage_text": "The tibia is the large bone of the lower leg; the fibula is the thin bone along the outer aspect of the lower leg. There are four compartments in the lower leg, each of which includes several muscles along with a nerve, artery and vein. Each compartment is surrounded by a tissue known as fascia. "}, {"url": "http://www.practicalplasticsurgery.org/docs/Practical_21.pdf", "passage_text": "FRACTURES OF THETIBIA AND FIBULA Fractures of the tibia and fibula are a special concern because missingearly warning signs can result in a useless leg.The tibia and the fibula are the two long bones of the calf. Most fractures of the tibia and fibula (tib-fib fractures) healwithout complication, and the patient is able to resume his or hernormal activities. However, potentially serious complications can develop, and you mustbe aware of their early warning signs."}, {"url": "http://www.innerbody.com/image_skelfov/skel27_new.html", "passage_text": "Click to read more below. The fibula is the long, thin and lateral bone of the lower leg. It runs parallel to the tibia, or shin bone, and plays a significant role in stabilizing the ankle and supporting the muscles of the lower leg. Compared to the tibia, the fibula is about the same length, but is considerably thinner. "}, {"url": "http://orthoinfo.aaos.org/topic.cfm?topic=A00522", "passage_text": "Tibia (Shinbone) Shaft Fractures. The tibia, or shinbone, is the most common fractured long bone in your body. The long bones include the femur, humerus, tibia, and fibula. A tibial shaft fracture occurs along the length of the bone, below the knee and above the ankle. Because it typically takes a major force to break a long bone, other injuries often occur with these types of fractures"}, {"url": "http://emedicine.medscape.com/article/826304-overview", "passage_text": "Background. Lower leg fractures include fractures of the tibia and fibula. Of these two bones, the tibia is the only weightbearing bone. Fractures of the tibia generally are associated with fibula fracture, because the force is transmitted along the interosseous membrane to the fibula. The skin and subcutaneous tissue are very thin over the anterior and medial tibia and as a result of this, a significant number of fractures to the lower leg are open. The tibia and fibula articulate at the proximal tibia-fibular syndesmosis. Fractures of the tibia can involve the tibial plateau, tibial tubercle, tibial eminence, proximal tibia, tibial shaft, and tibial plafond. See the image below. Shown is an intra-articular fracture of the medial condyle of the tibial plateau."}]