[{"url": "http://animals.sandiegozoo.org/animals/california-condor", "passage_text": "California condors are one of the largest flying birds. They are known for their enormous black wings, extraordinary eyesight, and an inquisitive and engaging intelligence. At one time there were thousands of California condors in the wild across the western United States and into Mexico."}, {"url": "http://www.defenders.org/california-condor/basic-facts", "passage_text": "The California condor (Gymnogyps californianus) is the largest bird in North America, and once dominated the western skies. The California condor is one of our nation's most magnificent birds, with wings spanning an amazing nine and half feet!"}, {"url": "http://birds.wikia.com/wiki/California_condor", "passage_text": "The California Condor (Gymnogyps californianus) is a North American species of bird in the New World vulture family Cathartidae and the largest North American land bird. Currently, this condor inhabits only the Grand Canyon area, Zion NP, and western coastal mountains of California and northern Baja California."}, {"url": "http://animals.nationalgeographic.com/animals/birds/california-condor/", "passage_text": "Sacred to Native Americans and the largest birds in North America, the California condor teeters on the brink of extinction, saved only by captive breeding programs."}, {"url": "http://www.peregrinefund.org/explore-raptors-species/California_Condor", "passage_text": "1 The California Condor is one of the largest birds in North America. 2  From wing tip to wing tip, it measures 9.5 feet. 3  That is just a little shorter than the standard height for a basketball hoop!"}, {"url": "http://animals.nationalgeographic.com/animals/birds/california-condor/", "passage_text": "Size relative to a 6-ft (2-m) man: The California condor is the largest flying bird in North America. Their wings may stretch nearly 10 feet (3 meters) from tip to tip. When in flight, these huge birds glide on air currents to soar as high as a dizzying 15,000 feet (4,600 meters)."}, {"url": "http://www.dfg.ca.gov/wildlife/nongame/t_e_spp/condor/", "passage_text": "The California condor, Gymnogyps californianus, is the one of the largest flying birds in the world. When it soars, the wings spread more than nine feet from tip to tip. Condors may weigh more than 20 pounds. The male Andean condor of South America is even larger than our California condor."}, {"url": "http://animals.nationalgeographic.com/animals/birds/california-condor/", "passage_text": "Audio. The California condor is the largest flying bird in North America. Their wings may stretch nearly 10 feet (3 meters) from tip to tip. When in flight, these huge birds glide on air currents to soar as high as a dizzying 15,000 feet (4,600 meters)."}]