[{"url": "http://wikitravel.org/en/Ecuador", "passage_text": "Ecuador is a country in Northwestern South America, with a Pacific Ocean coastline, lying on the Equator between Colombia, to the northeast, and Peru, to the south and east. Cotopaxi is the world's highest active volcano. Many cities and sites in Ecuador are listed as UNESCO World Heritage Sites."}, {"url": "http://www.mapsofworld.com/ecuador/ecuador-location-map.html", "passage_text": "The Republic of Ecuador is situated at the northwest part of South America bordered by Peru in the south and the east, Colombia in the north and the Pacific Ocean in the west. The Galapagos Islands in the Pacific Ocean are part of Ecuador’s territory. Ecuador is the seventy fourth largest country of the world covering a total area of 283,561 sq. km. including the Galapagos Islands. The Galapagos Island shares its border with Cocos Island of Costa Rica. It is also the place where Darwin’s Theory of Evolution was born and is also considered a UNESCO”S World Heritage Site. Ecuador is home to thousands of species of Butterflies, birds, reptiles and Plants."}, {"url": "http://www.cnn.com/2015/08/15/americas/ecuador-japan-volcanoes/index.html", "passage_text": "The stratovolcano is 45 kilometers (28 miles) from Quito. Straovolcanoes, or composite volcanoes, are steep-sided, symmetrical cones that are often very tall. Cotopaxi is 5,911 meters (19,388 feet) in elevation."}, {"url": "http://www.worldatlas.com/webimage/countrys/samerica/ec.htm", "passage_text": "Before the great Inca Empire began its conquest of this land called Ecuador in 1463, it was populated by a number of indigenous Indian tribes that were often at war with one another. In the early 16th century the Spanish discovered and subsequently conquered Ecuador."}, {"url": "http://www.worldatlas.com/webimage/countrys/samerica/ec.htm", "passage_text": "Quito, the capital, is the political center, while Guayaquil is the commercial hub. The world-famous Galapagos Islands (a territory of Ecuador) are positioned about 600 miles to its west. The indigenous populations mixed with those of European descent give Ecuador a unique cultural texture."}]