[{"url": "https://en.wikipedia.org/wiki/Teleology", "passage_text": "In western philosophy, the term and concept of teleology originated in the writings of Plato and Aristotle. Aristotle's Four Causes give special place to each thing's telos or final cause.. In this, he followed Plato in seeing purpose in both human and sub-human nature. It is derived from two Greek words: telos (end, goal, purpose) and logos (reason, explanation). A purpose that is imposed by a human use, such as that of a fork, is called extrinsic. Natural teleology contends that natural entities have intrinsic purposes, irrespective of human use or opinion."}, {"url": "https://en.wikipedia.org/wiki/Teleology", "passage_text": "Teleology is a reason or explanation for something in function of its end, purpose, or goal. It is derived from two Greek words: telos (end, goal, purpose) and logos (reason, explanation). A purpose that is imposed by a human use, such as that of a fork, is called extrinsic. Natural teleology contends that natural entities have intrinsic purposes, irrespective of human use or opinion."}, {"url": "http://www.sparknotes.com/philosophy/aristotle/themes.html", "passage_text": "The Teleology of Nature. Teleology is the study of the ends or purposes that things serve, and Aristotle’s emphasis on teleology has repercussions throughout his philosophy. Aristotle believed that the best way to understand why things are the way they are is to understand what purpose they were designed to serve. "}, {"url": "http://www.studymode.com/essays/Aristotle's-Concept-Of-Teleology-3031.html", "passage_text": "Aristotle's Concept of Teleology. In his Physics, Aristotle examines the theories and ideas regarding nature of his predecessors and then, based upon his own ideas, theories and experiments, argues against what he believes are incorrect conclusions. One idea that Aristotle argues specifically is teleology. Teleology is the idea that natural phenomena are determined not only by mechanical causes but by an overall design or purpose in nature. In this essay, I will examine what Aristotle's concept of teleology was and look at why he held this conception. First, let's talk about what we mean by teleology. Teleology is the study of ends, purposes, and goals. The word comes from the Greek word telos which means end or purpose. In cultures which have a teleological world view, the ends of things are seen as providing the meaning for all that has happened or that occurs."}, {"url": "http://www.merriam-webster.com/dictionary/teleology", "passage_text": "Medical Definition of TELEOLOGY. 1. a: the study of evidences of design in nature b: a doctrine (as in vitalism) that ends are immanent in nature c: a doctrine explaining phenomena by final causes. 2. : the fact or character attributed to nature or natural processes of being directed toward an end or shaped by a purpose."}, {"url": "https://en.wikiquote.org/wiki/Teleology", "passage_text": "Teleology. From Wikiquote. Teleology is the study of the purpose or design of natural occurrences. A teleology is any philosophical account that holds that final causes exist in nature, meaning that, analogous to purposes found in human actions, nature inherently tends toward definite ends. "}, {"url": "http://www.oxfordscholarship.com/view/10.1093/0199285306.001.0001/acprof-9780199285303", "passage_text": "Instead, he considers nature itself as an internal principle of change and as an end, and his teleological explanations focus on what is intr ... More. Aristotle is commonly considered the inventor of teleology, although the precise term originated in the eighteenth century. But if teleology means the use of ends or goals in natural science, then Aristotle was rather a critical innovator of teleological explanation. Aristotle’s philosophy was later conflated with the teleological proof for the existence of god, the anthropic cosmological principle, creationism, intelligent design, vitalism, animism, anthropocentrism, and opposition to materialism, evolution, and mechanism."}, {"url": "http://encyclopedia2.thefreedictionary.com/teleology", "passage_text": "teleology. 1. Philosophy. a. the doctrine that there is evidence of purpose or design in the universe, and esp that this provides proof of the existence of a Designer. b. the belief that certain phenomena are best explained in terms of purpose rather than cause. teleology. (tĕl'ēŏl`əjē, tē'lē–) , in philosophy, term applied to any system attempting to explain a series of events in terms of ends, goals, or purposes. It is opposed to mechanism, the theory that all events may be explained by mechanical principles of causation"}, {"url": "http://www.oxfordscholarship.com/view/10.1093/0199285306.001.0001/acprof-9780199285303", "passage_text": "Abstract. Aristotle is commonly considered the inventor of teleology, although the precise term originated in the eighteenth century. But if teleology means the use of ends or goals in natural science, then Aristotle was rather a critical innovator of teleological explanation. Aristotle’s philosophy was later conflated with the teleological proof for the existence of god, the anthropic cosmological principle, creationism, intelligent design, vitalism, animism, anthropocentrism, and opposition to materialism, evolution, and mechanism."}]