[{"url": "https://support.office.com/en-us/article/Copy-and-paste-multiple-items-by-using-the-Office-Clipboard-714A72AF-1AD4-450F-8708-C2931E73EC8A", "passage_text": "PowerPoint. Open the file that you want to copy items from. Select the first item that you want to copy. On the Home tab, in the Clipboard group, click Copy. Keyboard shortcut To copy an item, press CTRL+C. Continue copying items from the same or other files until you have collected all of the items that you want. The Office Clipboard can hold up to 24 items. If you copy a twenty-fifth item, the first item on the Office Clipboard is deleted"}, {"url": "http://graphpad.com/support/faq/troubleshooting-copying-and-pasting-graphs-from-prism-into-powerpoint/", "passage_text": "(1002). To read about copying and pasting to Microsoft Office applications, click here. When I copy and paste from Prism Windows into PowerPoint, Prism simply shuts down. We know of one situation where this can happen: You copy and paste-link data from Excel into a Prism file, and then move to a different computer. After copy and pasting a Prism graph (or layout) into Word or PowerPoint, double-clicking on that graph doesn't launch Prism (or launches the wrong version). This page explains the possible workarounds. When I copy and paste a Prism graph into PowerPoint 2007, it pastes as a picture instead of an object."}, {"url": "http://www.sevenforums.com/general-discussion/205226-cant-copy-move-files-error-message-open-other-program.html", "passage_text": "26 posts. Can't copy or move files-error message open in other program. When moving or renaming files I frequently get an error messages informing me that The action can't be completed because the folder or a file in it is open in another program. This typically happens with the second or third folder I try to rename or move. "}, {"url": "http://tips4pc.com/Computer_tips_and_tricks/creating_saving_copying_files_folders_.htm", "passage_text": "Once you have copied or cut a file or folder you will need to paste it somewhere. Just be careful because if you forget to paste a file after you have cut it then you may loose that file. 1  Go to the start menu and choose documents or my documents. 2  Go to the blank space in the documents folder with your mouse. 3  Then right click in the blank space, not on a folder or file. 4  A menu will appear."}, {"url": "http://answers.microsoft.com/en-us/windows/forum/windows_7-files/unable-to-move-or-copy-and-paste-files-getting/cd0887d2-fdf4-4f8c-8e4a-1a0a41ce8451", "passage_text": "C:\\Folder2. In Folder1 and Folder2 is a program I created call program.exe. If I open Explorer, go to Folder1, copy the file, go back to C: then open Folder2 adn paste, I can't because I get an error message that the file or folder is in use by another program. This is bogus-the only program in question is Explorer."}, {"url": "http://www.sevenforums.com/general-discussion/150977-folder-file-open-another-program.html", "passage_text": "Windows 7: The folder or a file in it is open in another program. Software. batch file open file for program in the startup folderI have a computer that is a drone specifically for an outside LED sign. This computer is designed to never shut off and doesn't have any other program on it besides Operating System and the sign software."}, {"url": "http://www.sevenforums.com/general-discussion/150977-folder-file-open-another-program.html", "passage_text": "This bug been going on for a while, on my win7 64bit. When I am done downloading anything through torrent (and no, I am talking legit files here), I can't move them to anywhere else, when I chose to cut them out and paste in new location it says it can't move the folder/file because it is open in another program. Software. batch file open file for program in the startup folderI have a computer that is a drone specifically for an outside LED sign. This computer is designed to never shut off and doesn't have any other program on it besides Operating System and the sign software."}, {"url": "https://support.office.com/en-us/article/Copy-and-paste-multiple-items-by-using-the-Office-Clipboard-714A72AF-1AD4-450F-8708-C2931E73EC8A", "passage_text": "Excel. Open the file that you want to copy items from. Select the first item that you want to copy. On the Home tab, in the Clipboard group, click Copy. Keyboard shortcut To copy an item, press CTRL+C. Continue copying items from the same or other files until you have collected all of the items that you want. The Office Clipboard can hold up to 24 items. If you copy a twenty-fifth item, the first item on the Office Clipboard is deleted"}, {"url": "http://www.javelin-tech.com/blog/2012/02/file-is-open-in-another-program/", "passage_text": "To help you resolve the ‘File is open in another program’ you can use The Process Explorer from Microsoft, amongst other things, will list the processes that are currently accessing the file or folder. You will then know which program/application to close; or if there is a process that is currently using the file – which you can close in the normal way using the Windows Task Manager (Right-click on the Windows Taskbar and select Start Task Manager)."}]