[{"url": "http://www.stopthestomachflu.com/Home/what-is-the-incubation-period-of-the-stomach-flu", "passage_text": "What is the incubation period of the stomach flu (norovirus and others)? Answer: The incubation period of the stomach flu is usually about 48 hours but it can vary. It generally takes about 48 hours from the time you swallow the virus (norovirus or others) to the time when you start to feel sick1. However, it can easily be less time or more time. Answer: The incubation period of the stomach flu is usually about 48 hours but it can vary. My sister has 5 children. They caught the stomach flu from relative they saw on Christmas day (Friday, December 25, 2009). My sister's first child got sick on Sunday night, 2 others on Monday night, and a 4th on Tuesday."}, {"url": "http://diarrhea.emedtv.com/norovirus-gastroenteritis/norovirus-incubation-period.html", "passage_text": "A person is not usually contagious during the norovirus incubation period. People infected with norovirus are usually contagious from the moment they begin feeling ill to at least 3 days after recovery. Some people may be contagious for as long as 2 weeks after recovery. After approximately 1 to 2 days, norovirus symptoms can appear. This period between the norovirus transmission and the start of norovirus symptoms is known as the norovirus incubation period.."}, {"url": "http://www.wales.nhs.uk/sitesplus/863/page/50698", "passage_text": "Although a relatively mild infection, Norovirus infection can occur at any age because even if you have it once, you are not immune. The incubation period for Norovirus is anything from 24 hours to three days, and symptoms usually last 12-60 hours. The onset is sudden, and those affected often feel very nauseous and can start vomiting. "}, {"url": "http://www.phac-aspc.gc.ca/fs-sa/fs-fi/norovirus-eng.php", "passage_text": "People exposed to the virus usually develop symptoms of illness within 24 to 48 hours, but symptoms can occur as soon as 12 hours after exposure. People infected with a norovirus can be contagious from the moment they start feeling ill to at least three days after they have recovered. People infected with a norovirus are contagious from the moment they begin feeling ill to at least three days after recovery. Some people may be contagious for as long as two weeks after recovery. Good hygiene practices, including frequent hand washing, are very important during this period."}, {"url": "http://diarrhea.emedtv.com/norovirus-gastroenteritis/norovirus-incubation-period.html", "passage_text": "Norovirus Incubation Period: A Summary. When a person becomes infected with norovirus, the virus begins to multiply within the small intestine. After approximately 1 to 2 days, norovirus symptoms can appear. This period between the norovirus transmission and the start of norovirus symptoms is known as the norovirus incubation period.."}, {"url": "http://www.lapublichealth.org/acd/docs/NorovirusFactSheet_06.pdf", "passage_text": "The symptoms of norovirus illness usually include nausea, vomiting, diarrhea, and some stomach cramping. Sometimes people additionally have a low-grade fever, chills, headache, muscle aches, and a general sense of tiredness. The illness often begins suddenly, and the infected person may feel very sick. "}, {"url": "http://www.medicinenet.com/norovirus_infection/page3.htm", "passage_text": "Norovirus may have a prolonged infection period that starts even before a patient gets sick. There is a short lag or incubation period (up to two days) between the time that people acquire the virus and the time they get symptoms. People may be contagious during this period. All people are contagious while they are having symptoms. Although the most contagious period is over when the patient's symptoms resolve, even some people who appear to have recovered completely after a norovirus infection may continue to shed the virus for weeks in their stool and may be a source of infection to others."}, {"url": "http://www.cdc.gov/norovirus/about/transmission.html", "passage_text": "Norovirus is a highly contagious virus. Anyone can get infected with norovirus and get sick. Also, you can get norovirus illness many times in your life. One reason for this is that there are many different types of noroviruses. Norovirus can be found in your stool (feces) even before you start feeling sick. The virus can stay in your stool for 2 weeks or more after you feel better. You are most contagious. 1  when you are sick with norovirus illness, and. 2  during the first few days after you recover from norovirus illness."}, {"url": "http://www.mayoclinic.org/diseases-conditions/viral-gastroenteritis/expert-answers/stomach-flu/faq-20057899", "passage_text": "You can be contagious from a few days up to two weeks or more, depending on which virus is causing your stomach flu (gastroenteritis). A number of viruses can cause gastroenteritis, including noroviruses and rotaviruses. The contagious period — the time during which a sick person can give the illness to others — is slightly different for each virus. 1  Norovirus. 2  With norovirus — the most common cause of viral gastroenteritis in adults and children — you're contagious from the moment you begin to feel ill"}]