[{"url": "http://www.insulation-guide.com/insulation-cost.html", "passage_text": "To calculate the total cost of an insulation project use the $/board foot column. A board foot is 1 inch by 1 foot by 1 foot. In other words, it is a square foot by 1 inch thick. So to figure the cost use the following equation: [square feet of area] x [inches of insulation thickness] x [cost per board foot] = [total cost for the installation]."}, {"url": "http://www.fixr.com/costs/home-insulation", "passage_text": "Cost breakdown. Generally, the typical home insulation costs include: 1  The Attic-according to the HomeInspectorLocator.com website the costs for insulating an attic to modern standards will run between $1 and $1.50 per square foot, though the costs increase by 100% when the insulation is one of the blown varieties."}, {"url": "http://www.fixr.com/costs/home-insulation", "passage_text": "1 The Attic-according to the HomeInspectorLocator.com website the costs for insulating an attic to modern standards will run between $1 and $1.50 per square foot, though the costs increase by 100% when the insulation is one of the blown varieties."}, {"url": "http://insulationinfo.org/insulation/how-much-does-insulation-cost/", "passage_text": "If you decide to ask a contractor to do the work, here is a rough estimate of the cost of insulation. For example, a rough estimate to insulate an open attic by contractor can range from as low as $0.50 in certain area to as high as $2.25 per square foot. That’s about $400 to $1800 for an 800 square feet attic space. Typically, the cost of attic insulation averages from $700 to $1100. Do-it-yourself materials for roll-out batting in an open attic can run $100 – $5"}, {"url": "http://www.icynene.com/en-us/blog/how-much-does-spray-foam-insulation-cost", "passage_text": "For a general sense of what spray foam insulation costs, if you choose a light density product the cost can be roughly about $0.44 to $0.65 per board foot while opting for a closed-cell insulation product can cost roughly $0.70 to $1 per board foot. Again, these costs should be regarded as a guide only."}]