[{"url": "https://www.didgeridoodojo.com/didgeridoo-buyers-guide/", "passage_text": "When you’re not near a shop, it’s a little harder to know what type of didgeridoo you like and what all the different factors are when buying your didgeridoo. In the end we hope that all of the information on this website will help you explore, discover and experience more than what you came here for. Whether it’s your first didgeridoo, or you’re an experienced player looking to round out your collection, we’ve put together some tips for you. You can navigate these tips on the left-hand side of the page under the didgeridoo buyer’s guide links or at the very bottom of the page."}, {"url": "http://www.kinderart.com/multic/didgeridoo.shtml", "passage_text": "A didgeridoo is a long wooden trumpet-like instrument used by the Aboriginal peoples of Australia. A real didgeridoo is made of a hollow wooden branch with a beeswax mouthpiece. You and your students can make your very own didgeridoo using offcuts of PVC (plumbing) pipe or wrapping paper tubes. Identification : Historical : Creation : Appreciation 1  : Students will discover a new way to create music."}, {"url": "http://didgeridoowebshop.com/Didgeridoo-eucalyptus", "passage_text": "When the outside of the didgeridoo is white and the inside red it will be even more durable. This counts for all eucalyptus didgeridoos. The sap wood protects the hardwood. The bark of the bloodwood trees look a bit like fish skin. This is a lighter type of eucalyptus didgeridoo tree that comes from the more southern and middle (not central like the desert) areas in Australia. It is not as dense as most of the trees used for didgeridoos and the wood is often light yellow in colour. The termites eat the inside out in a very clean way."}, {"url": "http://www.answers.com/Q/What_does_a_didgeridoo_look_like", "passage_text": "A didgeridoo looks like a very long straight wooden tube, often flared out at the end. Didgeridoos are usually painted or carved for decoration. "}, {"url": "https://en.wikipedia.org/wiki/Didgeridoo", "passage_text": "The didgeridoo (/ˌdɪdʒəriːˈduː/) (also known as a didjeridu) is a wind instrument developed by Indigenous Australians of northern Australia potentially within the last 1,500 years and still in widespread use today both in Australia and around the world. A modern didgeridoo is usually cylindrical or conical, and can measure anywhere from 1 to 3 m (3 to 10 ft) long. Most are around 1.2 m (4 ft) long"}, {"url": "http://www.koolkidscrafts.com/make-a-didgeridoo.html", "passage_text": "Here is a step by step guide on how to make a didgeridoo from cardboard tubes. It is a very unusual and ancient instrument that the Aborigine people play. Once we make it we can decorate it with some symbols they use for day to day life. You have 2 choices of what cardboard tubes to use. "}, {"url": "http://www.didjshop.com/didgeridoo_care/didgeridoo_mouthpieces.html", "passage_text": "Now take the strip of beeswax (if you have a block it will be very easy to cut a strip off. The strip should be about 130 to 150 mm long (5-6) and about 7-15 mm thick(1/4-3/4) depending on the top inside diameter of your didgeridoo). Step-by-step guide. 1. Let's start off with a didj without any mouthpiece. "}, {"url": "http://www.answers.com/Q/What_does_the_didgeridoo_look_like", "passage_text": "Making the world better, one answer at a time. A didgeridoo is a very long instrument. This instrument sort of looks like a giant piece of bamboo that people play. Genuine didgeridoos are always made of wood, usually the smaller trunks of living, young eucalyptus trees. The species of eucalyptus did not matter. They were not usually made … from branches. They were not made from dead wood hollowed out by termites-this is a common myth."}, {"url": "http://www.answers.com/Q/What_does_the_didgeridoo_look_like", "passage_text": "A didgeridoo looks like a very long straight wooden tube, often  flared out at the end. Didgeridoos are usually painted or carved  for decoration. Genuine didgeridoos are always made of wood, usually the smaller trunks of living, young eucalyptus trees. The species of eucalyptus did not matter. They were not usually made … from branches. They were not made from dead wood hollowed out by termites-this is a common myth."}]