[{"url": "http://mental-health.emedtv.com/dexmethylphenidate/dexmethylphenidate-dosing.html", "passage_text": "The dexmethylphenidate dose should be divided into two doses per day. For instance, if you were taking methylphenidate 20 mg total per day, your dexmethylphenidate starting dose would be dexmethylphenidate 5 mg twice daily. The dexmethylphenidate dose may be increased at weekly intervals, if necessary. The maximum recommended dose of dexmethylphenidate is 20 mg total per day (10 mg twice daily)"}, {"url": "http://www.bcbsnc.com/assets/services/public/pdfs/formulary/attention_deficit_disorder_criteria.pdf", "passage_text": "10mg 15mg 20mg 25mg 30mg 35mg 40mg Focalin (dexmethylphenidate) 2.5mg 3 tablets Administered twice daily at least 4 hours apart. Adults: 20mg/day Children (6-17yoa): 20mg/day Per FDA label, the maximum recommended dose is 20mg/day (10mg twice daily). "}, {"url": "http://www.rxlist.com/focalin-drug/indications-dosage.htm", "passage_text": "Patients Currently Using Methylphenidate. For patients currently using methylphenidate, the recommended starting dose of Focalin is half the dose of racemic methylphenidate. The maximum recommended dose is 20 mg/day (10 mg twice daily). There is no body of evidence available from controlled trials to indicate how long the patient with ADHD should be treated with Focalin. Dosage may be adjusted in 2.5 to 5 mg increments to a maximum of 20 mg/day (10 mg twice daily). In general, dosage adjustments may proceed at approximately weekly intervals."}, {"url": "http://www.psychatlanta.com/psychatlanta/wp-content/uploads/focalin.pdf", "passage_text": "Dosing Information The recommended starting dosage of Focalin for individuals who are not currently taking methylphenidate(Ritalin, Metadate) is 2.5 mg two times a day (5 mg/day). The dosage is adjusted in 2.5- to 5-mg daily increments. STIMULANTS. at weekly intervals to a maximum of 10 mg twice daily (20 mg/day). "}, {"url": "http://www.fda.gov/downloads/Drugs/DrugSafety/UCM088600.pdf", "passage_text": "The maximum recommended dose is 20 mg/day (10 mg twice daily). Maintenance/Extended Treatment There is no body of evidence available from controlled trials to indicate how long the patient with ADHD should be treated with Focalin. "}, {"url": "http://www.adultadhd.net/focalin/", "passage_text": "Like a lot of medications for adults attention deficit hyperactivity disorder, Dexmethylphenidate is a stimulant. Dexmethylphenidate increases the amount of dopamine, which can create a sense of euphoria. How do I take Focalin XR? Focalin XR comes in 5 mg, 10 mg, 15 mg, 20 mg, 30 mg, and 40 mg capsules. Physicians usually start dosage at the 5 gm per day level and then adjust the dosage upward by 5 mg increments, depending on the patient’s initial reaction to the medication. "}, {"url": "http://www.cms.gov/Medicare-Medicaid-Coordination/Fraud-Prevention/Medicaid-Integrity-Education/Pharmacy-Education-Materials/Downloads/stim-adult-dosingchart.pdf", "passage_text": "Patients currently taking dexmethylphenidate: Initial dose: the same total daily dose of. dexmethylphenidate given once a day; Maximum dose: 40 mg once a dayMay increase daily dose by 10 mg at weekly intervals. 5 mg once or twice a day; Maximum dose: 40 mg per day. May increase daily dose by 5 mg at weekly intervals until optimal. response is achieved. Only in rare cases will it be necessary to exceed. a total of"}, {"url": "http://www.rxlist.com/focalin-drug/indications-dosage.htm", "passage_text": "The recommended starting dose of Focalin for patients who are not currently taking racemic methylphenidate, or for patients who are on stimulants other than methylphenidate, is 5 mg/day (2.5 mg twice daily). Dosage may be adjusted in 2.5 to 5 mg increments to a maximum of 20 mg/day (10 mg twice daily). In general, dosage adjustments may proceed at approximately weekly intervals."}, {"url": "http://adhd.emedtv.com/focalin/focalin-dosing.html", "passage_text": "The Focalin dose should be divided into two doses per day. For instance, if you were taking methylphenidate 20 mg total per day, your Focalin starting dose would be Focalin 5 mg twice daily. The Focalin dose may be increased at weekly intervals, if necessary. The maximum recommended dose of Focalin is 20 mg total per day (10 mg twice daily). Focalin Medication. "}, {"url": "http://www.addforums.com/forums/showthread.php?t=56914", "passage_text": "Thanked 0 Times in 0 Posts. Focalin Xr at maximum adult dose. I have been taking Focalin Xr for a while now and I am on the maximum dose for adults, 20 mgs a day. I have noticed that I am not as focused as I was when I first started it and that I feel tired a lot. Re: Focalin Xr at maximum adult dose. I took 20mg in the morning and 10mg 5hrs after I got up. That pretty much elimanated any organizational/work issues I had but I definately was getting edgy and anti-social on it."}]