[{"url": "http://smallbusiness.chron.com/much-profit-margin-pizza-62139.html", "passage_text": "Consider the ingredients -- flour, yeast, water, sauce, cheese and toppings. None of these are expensive -- think about the cost at the grocery store. To build a medium pizza the cheese is the most expensive ingredient at $2.00, with the dough adding about $0.25 and the sauce $0.35. That adds up to $2.60 for a basic pizza that could be sold for twice that amount. There are, of course, other expenses to be factored into the cost. "}, {"url": "http://www.calypso-pos.com/blog/2014/07/cost-opening-sandwich-shop/", "passage_text": "Sandwich Shop Kitchen Equipment Sandwich shops have extremely low equipment costs. The cost of outfitting a sandwich shop kitchen can be as low as $10,000, if you will be serving mainly panini and cold sandwiches. You should put aside at least three months’ operating expenses, at a cost of $13,000 to $43,000, depending on the size of your sandwich shop staff and operation."}, {"url": "http://www.wikihow.com/Open-a-Sandwich-Shop", "passage_text": "And, although many sandwich shops are successful, what most customers don't see is all of the planning, investment and hard work that goes into running one. Learn how to open a sandwich shop if you have a sound knowledge of food and good business acumen. Find investors for your sandwich shop or apply for a business loan in order to raise the capital you'll need for opening a sandwich shop."}, {"url": "http://www.ehow.com/info_8369109_much-cost-start-sandwich-shop.html", "passage_text": "The average start-up cost of a restaurant is between $100,000 and $300,000, according to Forbes.. While starting a neighborhood sandwich shop is going to cost significantly less than opening a new five-star restaurant, you will still have to contend with expenses fundamental to the food service business. Expensive food such as filet mignon or salmon will cost more per pound so, for your sandwich shop, your costs can be much lower. Don't skimp on the menu items that will be your specialties, and consider what store-bought items you will make from scratch such as sauces and breads."}, {"url": "http://www.calypso-pos.com/blog/2014/07/cost-opening-sandwich-shop/", "passage_text": "Subway, the most popular sandwich shop franchise, has specific leasehold improvements, security deposits, and other required expenses that bring the total cost of their sandwich shops to between $116,000 and $262,000. You should put aside at least three months’ operating expenses, at a cost of $13,000 to $43,000, depending on the size of your sandwich shop staff and operation."}, {"url": "http://www.wikihow.com/Open-a-Sandwich-Shop", "passage_text": "Find a location for your sandwich shop. Always check with the city to find out if zoning laws allow for a sandwich shop in that area. Obtain any special permits. 10. Buy all the equipment you need to make and serve sandwiches, as well as cleaning equipment. Find investors for your sandwich shop or apply for a business loan in order to raise the capital you'll need for opening a"}, {"url": "http://www.therxforum.com/showthread.php?t=477313", "passage_text": "It's much cheaper and easier to buy an exisiting sandwich shop and just get the permits transferred. If you build or remodel one, then you have to get construction permits from the building dept. and health dept. Call them before you do anything if you have questions. There is a sandwich shop close to me and I've heard he makes 15k profit a month. Place only has about 5 tables, mostly take out, affordable prices, about 35 different kind of sandwiches,coffee,sodas,smoothies... Location,Location is everything.."}, {"url": "http://www.ehow.com/info_8369109_much-cost-start-sandwich-shop.html", "passage_text": "According to Forbes, the cost of goods sold should be between 25 percent and 40 percent of revenue. That is a large range; however, your menu will dictate your profit margin. Expensive food such as filet mignon or salmon will cost more per pound so, for your sandwich shop, your costs can be much lower. Don't skimp on the menu items that will be your specialties, and consider what store-bought items you will make from scratch such as sauces and breads."}, {"url": "http://www.calypso-pos.com/blog/2014/07/cost-opening-sandwich-shop/", "passage_text": "The cost of opening a sandwich shop ranges widely, from as little as $30,000 for a small mom-and-pop operation to as much as $500,000 for a nationally recognized sandwich shop franchise in a prime location. You should put aside at least three months’ operating expenses, at a cost of $13,000 to $43,000, depending on the size of your sandwich shop staff and operation."}, {"url": "http://www.calypso-pos.com/blog/2014/07/cost-opening-sandwich-shop/", "passage_text": "The following guide to sandwich shop expenses will help you determine the exact cost of opening your specific sandwich shop: Franchise Fees If you decide to open a sandwich shop franchise, initial franchise fees will run around $15,000 to $30,000, but the total investment required will be far more. You should put aside at least three months’ operating expenses, at a cost of $13,000 to $43,000, depending on the size of your sandwich shop staff and operation."}]