[{"url": "https://en.wikipedia.org/wiki/Type_three_secretion_system", "passage_text": "The term Type III secretion system was coined in 1993. This secretion system is distinguished from at least five other secretion systems found in Gram-negative bacteria. Many bacteria possess a T3SS and can transfer the T3SS gene cassette horizontally to other species. 1 The ability of a T3SS to secrete a specific protein or to secrete at all. 2  In order to assay this, secretion is induced in bacteria growing in liquid medium. 3  The bacteria and medium are then separated by centrifugation, and the medium fraction (the supernatant) is then assayed for the presence of secreted proteins."}, {"url": "http://mmbr.asm.org/content/76/2/262.full", "passage_text": "SUMMARY. Summary: Flagellar and translocation-associated type III secretion (T3S) systems are present in most Gram-negative plant-and animal-pathogenic bacteria and are often essential for bacterial motility or pathogenicity. To date, T3S4 proteins have been described for translocation-associated T3S systems from several animal-pathogenic bacteria (YscP from Yersinia spp., Spa32 from Shigella spp., and InvJ from Salmonella spp.) and the plant-pathogenic bacterium X. campestris pv. vesicatoria (HpaC) (Table 6)."}, {"url": "http://mmbr.asm.org/content/76/2/262.full", "passage_text": "Different translocation-associated T3S systems have also been identified in the animal-pathogenic bacteria Yersinia spp. and Burkholderia spp. Interestingly, Burkholderia spp. contain not only a SPI-1 T3S system but also Hrp-type T3S systems that are usually specific for plant-pathogenic bacteria (449, 522) (Fig. 1D). To date, T3S4 proteins have been described for translocation-associated T3S systems from several animal-pathogenic bacteria (YscP from Yersinia spp., Spa32 from Shigella spp., and InvJ from Salmonella spp.) and the plant-pathogenic bacterium X. campestris pv. vesicatoria (HpaC) (Table 6)."}, {"url": "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC2719110/", "passage_text": "1 How plant pathogenic bacteria orchestrate type III secretion. 2  Curr Opin Microbiol 9 193–200 [PubMed]. 3  Buettner Büttner, D Guerlebeck, Gürlebeck D, Noel Noël (ld) HpaB u 2004 hpab from. xanthomonas campestris pv vesicatoria acts as an exit control PROTEIN-in type iii.  dependent protein secretion 1 Lorenz C, Buettner Büttner (d) 2009 functional characterization of the TYPE iii ATPase HrcN hrcn from the plant Pathogen xanthomonas campestris. pv. "}, {"url": "http://www.plantphysiol.org/content/150/4/1656.full", "passage_text": "Many gram-negative plant and animal pathogenic bacteria employ a type III secretion system (T3SS) to subvert and colonize their respective host organisms. It is currently unknown whether plant and animal pathogenic bacteria employ similar mechanisms to control substrate specificity and length of extracellular appendages of the T3SS. In plant pathogenic bacteria, it is not yet clear whether or not T3SS pili have a defined length in vivo."}, {"url": "http://physiologyonline.physiology.org/content/20/5/326", "passage_text": "Abstract. The type III secretion (T3S) pathway allows bacteria to inject effector proteins into the cytosol of target animal or plant cells. T3S systems evolved into seven families that were distributed among Gram-negative bacteria by horizontal gene transfer. All of the T3S systems from plant pathogens can be grouped into two families on the basis of the genetic loci organization and regulatory systems (1, 2). This subdivision also appears in the phylogenetic trees (48, 56, 96). In both families, the injectisome has a long, flexible pilus instead of a needle."}, {"url": "https://en.wikipedia.org/wiki/Secretion", "passage_text": "Secretion in bacterial species means the transport or translocation of effector molecules for example: proteins, enzymes or toxins (such as cholera toxin in pathogenic bacteria for example Vibrio cholerae) from across the interior (cytoplasm or cytosol) of a bacterial cell to its exterior. For more on the T6SS, refer to the article Type VI Secretion Systems. Type VI secretion systems were originally identified in 2006 by the group of John Mekalanos at the Harvard Medical School (Boston, USA) in two bacterial pathogens, Vibrio cholerae and Pseudomonas aeruginosa."}, {"url": "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC2719110/", "passage_text": "Many gram-negative plant and animal pathogenic bacteria employ a type III secretion system (T3SS) to subvert and colonize their respective host organisms. 1 Lorenz C, Buettner Büttner (d) 2009 functional characterization of the TYPE iii ATPase HrcN hrcn from the plant Pathogen xanthomonas campestris. pv.  vesicatoria"}, {"url": "https://en.wikipedia.org/wiki/Type_three_secretion_system", "passage_text": "Type three secretion system (often written Type III secretion system and abbreviated TTSS or T3SS, also called Injectisome or Injectosome) is a protein appendage found in several Gram-negative bacteria. 1 The ability of a T3SS to secrete a specific protein or to secrete at all. 2  In order to assay this, secretion is induced in bacteria growing in liquid medium. 3  The bacteria and medium are then separated by centrifugation, and the medium fraction (the supernatant) is then assayed for the presence of secreted proteins."}]