[{"url": "http://geography.about.com/od/specificplacesofinterest/a/southernhemisphere.htm", "passage_text": "The majority of Earth's population and its largest cities are in the Northern Hemisphere, although there are large cities such as Lima, Peru, Cape Town, South Africa, Santiago, Chile, and Auckland, New Zealand. In comparison to the Northern Hemisphere, the Southern Hemisphere has fewer land masses and more water. The South Pacific, South Atlantic, Indian Oceans and various seas such as the Tasman Sea between Australia and New Zealand and the Weddell Sea near Antarctica make up around 80.9% of the Southern Hemisphere."}, {"url": "http://www.worldatlas.com/webimage/countrys/oceania/newzealand/nzlatlog.htm", "passage_text": "RELATIVE LOCATION: Located in the South Pacific Ocean, to the southeast of Australia, New Zealand is geographically positioned in both the southern and eastern hemispheres. This island country is completely surrounded by the Tasman Sea and the Pacific Ocean. "}, {"url": "http://www.enz.org/new-zealand-moved-to-the-northern-hemisphere.html", "passage_text": "New Zealand Moved to the Northern Hemisphere. If New Zealand could be taken on an imaginary journey to the opposite side of the globe, so that it lay in the Northern Hemisphere in the same latitudes as it currently does in the Southern Hemisphere, this is approximately where it would appear on a map. • Christchurch would be on Spain’s north coast, on a similar latitude to Bilbao, Toulouse and Florence. • Wellington would be close to the border between Northern Portugal and Spain, on a similar latitude to Barcelona and Naples. • Auckland would be in southern Spain, on a similar latitude to Malaga and Tunis."}, {"url": "https://en.wikipedia.org/wiki/Southern_Hemisphere", "passage_text": "The southern temperate zone, a subsection of the Southern Hemisphere, is nearly all oceanic. This zone includes all of Uruguay, Lesotho, Swaziland, and New Zealand; most of Chile, Argentina, South Africa, and Australia; and parts of Paraguay, Brazil, Namibia, Botswana, Mozambique, and Madagascar. Several islands off the Asian continental mainland are also in the Southern Hemisphere. Due to the tilt of Earth's rotation relative to the Sun and the ecliptic plane, summer is from December to March and winter is from June to September."}, {"url": "http://www.answers.com/Q/In_what_hemisphere_is_New_Zealand", "passage_text": "New Zealand is in the South Pacific ocean, … east across the Tasman  Sea from the south east coast of Australia. It is a long, narrow,  mountainous country consisting of two major islands, the North and  South Island, the smaller Stewart Island and many other small  islands. New Zealand is a westernised first-world country, located 1250 miles southeast of Australia, in the south-western Pacific Ocean. It is made up of two main islands and a number … of smaller ones. The indigenous people of New Zealand settled around 1000 years ago; they are called the Maori, who named the islands Aotearoa"}, {"url": "https://en.wikipedia.org/wiki/Southern_Hemisphere", "passage_text": "1 Australia (the entire mainland is in the Southern Hemisphere). 2  South America (mostly, south of the Amazon River mouth in the east and Quito in the west). 3  Zealandia (New Caledonia, the New Zealand landmass and associated islands are wholly within the Southern Hemisphere). Several islands off the Asian continental mainland are also in the Southern Hemisphere. Due to the tilt of Earth's rotation relative to the Sun and the ecliptic plane, summer is from December to March and winter is from June to September."}, {"url": "http://www.answers.com/Q/What_hemisphere_is_Auckland_New_Zealand_in", "passage_text": "The whole of New Zealand is in the southern hemisphere, and also in the eastern hemisphere. New Zealand is in the southern hemisphere. Answer   Auckland is situated on an isthmus in the north of the North Island, the narrowest point of the island. It is New Zealand's largest city."}, {"url": "http://www.enz.org/new-zealand-moved-to-the-northern-hemisphere.html", "passage_text": "New Zealand in the Northern Hemisphere. It’s clear that New Zealand stretches rather a long way from north to south, beginning on the same latitude as mid-France and ending in North Africa. • Christchurch would be on Spain’s north coast, on a similar latitude to Bilbao, Toulouse and Florence. • Wellington would be close to the border between Northern Portugal and Spain, on a similar latitude to Barcelona and Naples. • Auckland would be in southern Spain, on a similar latitude to Malaga and Tunis."}, {"url": "https://answers.yahoo.com/question/index?qid=20071001175352AALLoHW", "passage_text": "There is another what? Edit: From this definition (below) New Zealand would be in the Eastern Hemisphere and the Southern Hemisphere. Generally the Eastern Hemisphere includes most of Africa, about half of Antarctica, all of Asia and Australia/Oceania, and most of Europe. "}]