[{"url": "http://study.com/academy/lesson/polar-and-nonpolar-covalent-bonds-definitions-and-examples.html", "passage_text": "They are not equally sharing the toys. This unequal sharing also happens with a type of bond called polar covalent bonding. Polar covalent bonding is a type of chemical bond where a pair of electrons is unequally shared between two atoms. In a polar covalent bond, the electrons are not equally shared because one atom spends more time with the electrons than the other atom. In polar covalent bonds, one atom has a stronger pull than the other atom and attracts electrons."}, {"url": "http://cyberbridge.mcb.harvard.edu/bonding_4.html", "passage_text": "POLAR BONDS. 1) Covalent bond between two atoms with unequal electronegativities results in unequal sharing of electrons. 2) Unequal electron sharing leads to partially positive and partially negative charges on opposite ends of the bond. When the two atoms involved in a covalent bond both have equal affinity for electrons, the electrons in the bond are evenly shared between them. These types of covalent bonds are called polar bonds because the electron distribution or charge is unevenly distributed or polarized. Partial charges are represented by lower case delta (+) δ+ or lower case delta (-) δ-. A separation of partial charges within a polar covalent bond is referred to as a dipole."}, {"url": "http://hyperphysics.phy-astr.gsu.edu/hbase/Chemical/bond.html", "passage_text": "a chemical bond. The two extreme cases of chemical bonds are: Covalent bond: bond in which one or more pairs of electrons are shared by two atoms. Ionic bond: bond in which one or more electrons from one atom are removed and attached to another atom, resulting in positive and negative ions which attract each other. Other types of bonds include metallic bonds and hydrogen bonding. "}, {"url": "http://study.com/academy/lesson/polar-and-nonpolar-covalent-bonds-definitions-and-examples.html", "passage_text": "In this lesson you learned about two types of bonds: nonpolar covalent and polar covalent. Nonpolar covalent bonds are a type of chemical bond where two atoms share a pair of electrons with each other. Polar covalent bonding is a type of chemical bond where a pair of electrons is unequally shared between two atoms. In a polar covalent bond, the electrons are not equally shared because one atom spends more time with the electrons than the other atom. In polar covalent bonds, one atom has a stronger pull than the other atom and attracts electrons."}, {"url": "http://www.3rd1000.com/chem301/chem301f.htm", "passage_text": "Any homopolar bond has an electronegativity difference of zero and is purely covalent with equal sharing of electrons. As the difference in electronegativity of the two atoms in a heteropolar bond increases, the bonding electrons are found to lie closer to the more electronegative atom. "}, {"url": "http://www.answers.com/Q/What_is_a_bond_where_electrons_are_shared_unequally_called", "passage_text": "In Elements and Compounds. Yes, The electrons are unequally shared in an Ionic Bond. One atom has more electrons than the other atom. Every Atom has Electrons that are called Valence Electrons. There should be a stable number of Valence electrons (2 or 8) for an atom to be completely stable. To stabilize the valence electrons the atom bonds with other atoms. One type of bond is called ionic bond where one atom gives up a certain number of electrons to be stable and another atom gains all of those lost atoms."}, {"url": "https://quizlet.com/1867415/unit-5-terms-covalent-bonding-and-naming-flash-cards/", "passage_text": "polar covalent bond. a covalent bond in which the bonding electrons are NOT shared equally by the bonded atoms, resulting in an unequal distribution of electrical charge (occurs due to substantial differences in electronegativity values of the bonding atoms). nonpolar covalent bond. a covalent bond in which the bonding electrons are shared equally by the bonded atoms, resulting in a balanced distribution of electrical charge."}, {"url": "https://answers.yahoo.com/question/index?qid=20080628035855AA8VCsT", "passage_text": "Best Answer: Typically, we would say that this is a polar covalent bond. You would need to quantify the description since covalent can also refer to bonds between the same two elements which is pretty much an equal sharing of the electrons. Also, covalent really sums up almost ALL bonding between atoms. Even bonds that we think of as ionic are not completely, 100% ionic."}]