[{"url": "http://www.answers.com/Q/Why_is_the_cytoplasm_important", "passage_text": "1. Cytoplasm us a gelatinlike substance that fills the cell.   2. Most of the cell's life processes occur in the cytoplasm.   3. Cytoskeleton, framework of cytoplasm, … helps the cell maintain or  change its shape and enables some cells to move.   4. Cytoplasm constantly flows inside the cell membrane. A cytoplasm is the water-based gel in which the organelles of all  living things are suspended in a cell   a cytoplasm is the inside of a cell."}, {"url": "http://www.innovateus.net/innopedia/what-are-functions-cytoplasm", "passage_text": "Based on their function, cells are categorized into different types of cells, the somatic cells and the reproductive cells. Each cell has a nucleus and a jellylike watery substance that is 80% water that occupies the remaining part of the cell. This is called Cytoplasm. Cytoplasm can be divided into: Cytosol, organelles and cytoplasmic inclusions. Cytosol is a gelatinous material and most of the space in cytoplasm when an organelle is not present. Cytosol comprises of salt, water, cytoskeleton filaments and organic molecules."}, {"url": "http://www.knowswhy.com/why-do-cells-need-water/", "passage_text": "A‚ã· A â the cytoplasm in the cell consists mainly of water and, dissolved, nutrients, wastes ions proteins and. OTHER‚MOLECULES· A ã a â the plasma membrane is. Made from, fatty acids without water it will not combine as a fatty membrane. that houses the cell Cells greatly depend on water in order to function normally. Water is a very important part of the cell for a number of reasons such as: A‚ã· A â the cytoplasm in the cell consists mainly of water and, dissolved, nutrients, wastes ions proteins and. other molecules"}, {"url": "http://www.knowswhy.com/why-do-cells-need-water/", "passage_text": "Cells greatly depend on water in order to function normally. Water is a very important part of the cell for a number of reasons such as: A‚ã· A â the cytoplasm in the cell consists mainly of water and, dissolved, nutrients, wastes ions proteins and. OTHER‚MOLECULES· A ã a â the plasma membrane is. made from fatty acids Cells greatly depend on water in order to function normally. Water is a very important part of the cell for a number of reasons such as: A‚ã· A â the cytoplasm in the cell consists mainly of water and, dissolved, nutrients, wastes ions proteins and. other molecules"}, {"url": "https://en.wikipedia.org/wiki/Protoplasm", "passage_text": "Protoplasm is the living content of a cell that is surrounded by a plasma membrane. It is a general term for the cytoplasm. Protoplasm is composed of a mixture of small molecules such as ions, amino acids, monosaccharides and water, and macromolecules such as nucleic acids, proteins, lipids and polysaccharides. In eukaryotes the protoplasm surrounding the cell nucleus is known as the cytoplasm and that inside the nucleus as the nucleoplasm"}, {"url": "http://www.answers.com/Q/Why_is_the_cytoplasm_important", "passage_text": "The cytoplasm is important, because without it, the organelles inside the cell won't be able to function. Cytoplasm is important the combination of cytosol and the organelles, which cells require. A cytoplasm is the water-based gel in which the organelles of all  living things are suspended in a cell   a cytoplasm is the inside of a cell."}, {"url": "http://biology.tutorvista.com/animal-and-plant-cells/cytoplasm.html", "passage_text": "Basically cytoplasm is the substance that fills the cell. It is a jelly-like substance and it is made up of eighty percent water and is usually clear and colorless.Cytoplasm is a thick gel-like substance. It liq ue f ies when it is agitated or stirred. 1 Cytoplasm is the fluid substance that fills the space between the cell membrane and the cellular organelles. 2  Cytoplasm shows differential staining properties, the areas stained with the basic dyes are the basophilic areas of the cytoplasm and is termed as ergatoplasm for this material."}, {"url": "http://biology.tutorvista.com/animal-and-plant-cells/cytoplasm.html", "passage_text": "The cytoplasm of the animal cell is a gel-like material made of water. It fills the cells and contains proteins and important molecules that are necessary for the cell. The cytoplasm is made of proteins, carbohydrates, salts, sugars, amino acids and nucleotides. Cytoplasm holds all the cellular organelles. 1 Cytoplasm is the fluid substance that fills the space between the cell membrane and the cellular organelles. 2  Cytoplasm shows differential staining properties, the areas stained with the basic dyes are the basophilic areas of the cytoplasm and is termed as ergatoplasm for this material."}, {"url": "https://en.wikipedia.org/wiki/Cytoplasm", "passage_text": "The cytoplasm comprises cytosol (the gel-like substance enclosed within the cell membrane) – and the organelles – the cell 's internal sub-structures. All of the contents of the cells of prokaryote organisms (such as bacteria, which lack a cell nucleus) are contained within the cytoplasm. It is within the cytoplasm that most cellular activities occur, such as many metabolic pathways including glycolysis, and processes such as cell division."}]