[{"url": "http://smallbusiness.chron.com/initial-mcdonalds-franchise-fee-cover-41019.html", "passage_text": "Beyond the realm of fantasy, initial franchise fees add a significant percentage to the already substantial costs of opening a new business. At the time of publication, McDonald's initial franchise fee amounts to $45,000. Your burgers might be a thousand times better than those served by McDonald's, but if no one tastes them you cannot make a profit. Your initial franchise fee helps you circumvent that challenge by including your restaurant in a chain with the advantage of instant name recognition."}, {"url": "http://smallbusiness.chron.com/initial-mcdonalds-franchise-fee-cover-41019.html", "passage_text": "Your franchise fee enables you to meet McDonald's customer expectations. Brand X Pictures/Brand X Pictures/Getty Images. A new entrepreneur often struggles with the decision between following the tried-and-true formula offered by a franchise or following her dreams and creating something unique. Your burgers might be a thousand times better than those served by McDonald's, but if no one tastes them you cannot make a profit. Your initial franchise fee helps you circumvent that challenge by including your restaurant in a chain with the advantage of instant name recognition."}, {"url": "http://www.franchise.co.nz/article/368-what-do-you-get-for-your-franchise-fees-", "passage_text": "The Initial Franchise Fee. The initial (or ‘upfront’) fee is paid by a new franchisee to the franchisor, and this is the one-off payment made to get into the franchise. Accordingly, it is usually called the franchise fee. Where the ongoing fee is a flat one, or where the fee is gathered by means of a mark-up on products supplied, skimming is less of a concern but even then it can happen. Where skimming becomes obvious, the franchisor has to take action for three reasons: 1  They need to protect the integrity of the franchise agreement."}, {"url": "http://www.answers.com/Q/What_does_the_initial_franchise_fee_cover", "passage_text": "The initial fee varies from company to company and is paid by the franchisee when the franchise is granted. The initial franchise fee covers the cost of training, recruiting, territory analysis, site identification, specialist equipment, stationary, franchisee launch, etc. Charter Cable pays up to 5% of their gross revenue in a particular jurisdiction to that jurisdiction in the form of franchise fees, or fees paid to that jurisdiction for use o … f public right-of-way space."}, {"url": "http://smallbusiness.chron.com/franchise-fee-cover-pizza-hut-34902.html", "passage_text": "The Franchise Fee. The franchise fee is just one component of the total costs to start a franchise operation. Pizza Hut's franchise fee is $25,000 for each restaurant, and must be paid when the franchisee signs the franchise agreement, or some other time before the restaurant opens. Service and Other Fees. The new franchise requires working capital and funds for advertising, miscellaneous costs and development fees paid to Pizza Hut. The franchise agreement estimates a requirement of approximately $20,000 to $60,000 for these items, which is paid as incurred. The development fees are not included in this figure -- these amounts vary and must be paid in a lump sum when the franchisee signs a development agreement with Pizza Hut"}, {"url": "http://www.thefranchisemall.com/franchises/details/10061-0-arbys.htm", "passage_text": "How much does it cost to open a Arby's Franchise? The investment required to open a Arby's Franchise is between $352,500-$2,444,500. There is an initial franchise fee of $37,500 which grants you the license to run a business under the Arby's name."}, {"url": "http://smallbusiness.chron.com/initial-mcdonalds-franchise-fee-cover-41019.html", "passage_text": "Not only does your initial franchise fee buy you access to all of McDonald's recipes, but it gives you access to the company's successful business plan. Your burgers might be a thousand times better than those served by McDonald's, but if no one tastes them you cannot make a profit. Your initial franchise fee helps you circumvent that challenge by including your restaurant in a chain with the advantage of instant name recognition."}, {"url": "http://smallbusiness.chron.com/initial-mcdonalds-franchise-fee-cover-41019.html", "passage_text": "The Secret Recipe. Not only does your initial franchise fee buy you access to all of McDonald's recipes, but it gives you access to the company's successful business plan. Think of your franchise fee as insurance. Your burgers might be a thousand times better than those served by McDonald's, but if no one tastes them you cannot make a profit. Your initial franchise fee helps you circumvent that challenge by including your restaurant in a chain with the advantage of instant name recognition."}, {"url": "http://www.whichfranchise.com/feature_template.cfm?featureId=18", "passage_text": "Initial franchise fees The initial franchise fee varies from company to company and is paid by the franchisee when the franchise is granted. The initial franchise fee covers the cost of training, recruiting, territory analysis, site identification, specialist equipment, stationary, franchisee launch, etc. In some cases there will be no on-going fee – it will be covered in a mark-up on the product. There are also cases where the franchisor will justify an increase in fees on issues such as extra start-up costs and inflation."}]