[{"url": "http://www.bankrate.com/finance/mortgages/financial-reform-and-your-mortgage-1.aspx", "passage_text": "Introduction to mortgage section of Dodd-Frank Act. New financial reform legislation includes provisions to prevent lenders from offering mortgages borrowers can't afford or understand. The Dodd-Frank Wall Street Reform and Consumer Protection Act devotes more than 200 pages to a section called the Mortgage Reform and Anti-Predatory Lending Act. It addresses issues as diverse as prepayment penalties and Chinese drywall. "}, {"url": "https://www.law.cornell.edu/wex/dodd-frank_title_XIV", "passage_text": "High cost mortgages include first mortgages with an interest rate that is more than 6.5% higher than the average prime offer rate, or a second mortgage with an interest rate more than 8.5% higher than the average prime offer rate, as well as other enumerated definitions. See 15 U.S.C. § 1602 (Dodd-Frank Act § 1431). Additionally, to keep payments on high-cost mortgages lower, this Title prohibits “balloon payments” that rapidly increase so that scheduled payments are eventually twice as large as the average of earlier payments. See 15 U.S.C. § 1639(b) (Dodd-Frank Act § 1403). Further authority to prohibit deceptive, unfair or predatory loan terms is given to the Federal Reserve Board, which can regulate all residential mortgages to ensure that terms are in the interest of consumers and the public."}, {"url": "http://object.cato.org/sites/cato.org/files/pubs/pdf/working-paper-15.pdf", "passage_text": "1. Mortgage Reform under the Dodd-Frank Act Mark Calabria Many, if not most, accounts of the financial crisis of 2008 include a prominent role for the U.S. residential mortgage market. While Section 941’s risk retention requirement applies to any asset-backed security (ABS) issued under the 1934 Act, Dodd-Frank gives broad discretion to the SEC to make such determinations for ABS that do not contain residential mortgages."}, {"url": "http://www.consumerfinance.gov/f/201409_cfpb_readiness-guide_mortgage-implementation.pdf", "passage_text": "The Consumer Financial Protection Bureau (CFPB or Bureau) is updating the CFPB Dodd-Frank Mortgage Rules Readiness Guide (Guide) to help finan cial institutions come into and maintain compliance with the new mortgage rules outlined in Part I of this Guide. The CFPB amended Regulation X, which implements RESPA, and the official interpretation to Regulation X, as well as Regulation Z, which implements TILA, and the official interpretation to Regulation Z, to implement provisions of the Dodd-Frank Act regarding mortgage loan servicing."}, {"url": "http://object.cato.org/sites/cato.org/files/pubs/pdf/working-paper-15.pdf", "passage_text": "Impact of Dodd-Frank on Mortgage Availability. A goal of the Dodd-Frank Act is to eliminate certain products and practices from. the mortgage market. While Section 941’s risk retention requirement applies to any asset-backed security (ABS) issued under the 1934 Act, Dodd-Frank gives broad discretion to the SEC to make such determinations for ABS that do not contain residential mortgages."}, {"url": "http://www.cnbc.com/id/47075854", "passage_text": "The full name of the bill is the Dodd-Frank Wall Street Reform and Consumer Protection Act, but it is better known and most often referred to as Dodd-Frank. In simple terms, Dodd-Frank is a law that places major regulations on the financial industry. For many on Wall Street, Dodd-Frank is seen as an overreaction to the recession of 2008, one that will push investors to the sidelines, burden financial institutions with cumbersome rules, and stop overall economic growth."}, {"url": "https://www.whitehouse.gov/economy/middle-class/dodd-frank-wall-street-reform", "passage_text": "To make sure that a crisis like this never happens again, President Obama signed the Dodd-Frank Wall Street Reform and Consumer Protection Act into law. The most far reaching Wall Street reform in history, Dodd-Frank will prevent the excessive risk-taking that led to the financial crisis. Wall Street Reform: The Dodd-Frank Act. In the fall of 2008, a financial crisis of a scale and severity not seen in generations left millions of Americans unemployed and resulted in trillions in lost wealth."}, {"url": "http://files.consumerfinance.gov/f/201307_cfpb_mortgage-implementation-readiness-guide.pdf", "passage_text": "2 2013 CFPB Dodd-Frank Mortgage Rules. The Consumer Financial Protection Bureau (CFPB) is publishing the 2013 CFPB Dodd-Frank Mortgage Rules Readiness Guide (the Guide) to help financial institutions come into and maintain compliance with the new mortgage rules outlined in Part I of this guide. procedures. 3 Part I – Summary of the Rules. In January 2013, the Bureau issued eight final rules concerning mortgage markets in the United States pursuant to the Dodd-Frank Wall Street Reform and Consumer Protection Act (Dodd-Frank Act). Public Law 111-203, 124 Stat."}]