[{"url": "http://www.sugar.ca/Nutrition-Information-Service/Health-professionals/About-Sugar-and-Role-of-Sugar-in-Foods/Functional-Properties-of-Sugar.aspx", "passage_text": "Physical Properties. Solubility-Sugar is very soluble in water. The ability to produce solutions of varying sugar concentrations is important in many food applications. A high level of solubility, for example, is essential in beverages to provide sweetness and to increase viscosity to create a desirable ‘mouthfeel'."}, {"url": "http://scienceofcooking.com/sucrose.htm", "passage_text": "Sucrose is the most common food sweetener in the industrialized world, although it has been replaced in industrial food production by other sweeteners such as fructose syrups or combinations of functional ingredients and high intensity sweeteners. Sucrose is the most important sugar in plants, and can be found in the phloem sap. It is generally extracted from sugar cane or sugar beet and then purified and crystallized. Other (minor) commercial sources are sweet sorghum and sugar maples. Sucrose is ubiquitous in food preparations due to both its sweetness and its functional properties; it is important to the structure of many foods including biscuits and cookies, ice cream and sorbets, and also assists in the preservation of food"}, {"url": "http://www.dansukker.co.uk/uk/about-sugar/functional-properties-of-sugar.aspx", "passage_text": "In addition, the taste of foods would be disappointing without the ability of sugar to round off and enhance natural taste components. Learn more about the functional properties of sugar. Sweetness. Sugar has an exceptionally pure sweetness that is completely free of secondary flavours and aftertastes. Sugar has a range of unique properties that, either individually or in combination, make it an important ingredient in the modern Kitchen. Without sugar, jam would soon go off, ice cream would crystallise, and bread would lose its freshness and dry out."}, {"url": "http://www.nordicsugar.com/fileadmin/Nordic_Sugar/Brochures_factsheet_policies_news/Download_center/Functional_properties_of_sugar/Suk_funk_uk.pdf", "passage_text": "SweeTneSS The primary functions of sugar in food products are to provide sweetness and energy. Our sense of taste can identify four basic tastes: sweet, sour, salty and bitter. The first taste that we encounter (breast milk) is sweet, which may be why a sweet taste is appreciated and interpreted positively. For example, a small amount of added sugar can enhance the taste of nutritious, but sour or bitter foods. Sugar’s aroma enhancing properties are used in a wide range of foods, such as bread and fruit products."}, {"url": "http://www.comitesucre.org/site/about-sugar/sugars-role-in-food-and-nutrition/", "passage_text": "Sugar is first and foremost used because of its sweetening properties. It has a clean sweet taste with no aftertaste and is the reference against which other sweeteners are compared. Beyond its sweetening properties, sugar provides structure and texture to many traditional foods, such as bakery products and jam. As in addition to its sweet taste, sugar contributes to the colour, flavour and texture of food, adding sugar to foods can improve their taste and palatability, thereby increasing the range of foods that people can eat."}, {"url": "https://en.wikipedia.org/wiki/Fructose", "passage_text": "Fructose, or fruit sugar, is a simple ketonic monosaccharide found in many plants, where it is often bonded to glucose to form the disaccharide sucrose. It is one of the three dietary monosaccharides, along with glucose and galactose, that are absorbed directly into the bloodstream during digestion. When fructose is consumed in the form of sucrose, it is digested (broken down) and then absorbed as free fructose. As sucrose comes into contact with the membrane of the small intestine, the enzyme sucrase catalyzes the cleavage of sucrose to yield one glucose unit and one fructose unit, which are then each absorbed."}, {"url": "http://www.dansukker.co.uk/uk/about-sugar/functional-properties-of-sugar.aspx", "passage_text": "Sugar now comes in many varieties and can be used in many food products. Sugar has a range of unique properties that, either individually or in combination, make it an important ingredient in the modern Kitchen. Without sugar, jam would soon go off, ice cream would crystallise, and bread would lose its freshness and dry out."}, {"url": "http://www.sugar.ca/Nutrition-Information-Service/Health-professionals/About-Sugar-and-Role-of-Sugar-in-Foods/Functional-Properties-of-Sugar.aspx", "passage_text": "Functional Properties of Sugar. It is common for individuals to associate sugar (sucrose) with its inherent taste properties. Aside from providing a sweet taste and flavour, sugar imparts numerous functional properties that make it an important ingredient in many foods. Specific functional properties of sugar can be classified into four broad categories: sensory, physical, microbial and chemical. Solubility-Sugar is very soluble in water. The ability to produce solutions of varying sugar concentrations is important in many food applications. A high level of solubility, for example, is essential in beverages to provide sweetness and to increase viscosity to create a desirable ‘mouthfeel'."}, {"url": "http://scienceofcooking.com/sucrose.htm", "passage_text": "As such it is common in many processed and so-called junk foods. Sugar as a macronutrient. Human beings, and in fact most other mammals except felines, which lack the ability to taste sweetness will typically accept food sweetened with sucrose even if they are not hungry. Sucrose is the most important sugar in plants, and can be found in the phloem sap. It is generally extracted from sugar cane or sugar beet and then purified and crystallized. Other (minor) commercial sources are sweet sorghum and sugar maples. Sucrose is ubiquitous in food preparations due to both its sweetness and its functional properties; it is important to the structure of many foods including biscuits and cookies, ice cream and sorbets, and also assists in the preservation of foods"}]