[{"url": "https://www.yourmechanic.com/services/oil-pan-gasket-replacement", "passage_text": "Your engine needs oil to function properly and safely. The oil in your car is collected and stored in the oil pan. The oil pan gasket acts as a seal for the oil pan. When the gaskets are damaged, oil will leak out of the oil pan, past the gaskets, and out of your engine. The oil pan gasket seals the oil pan to the bottom of the engine. The engine has a lot of moving parts that need to be kept lubricated by the engine oil, without which the parts will damage each other. The oil pan and the gaskets are located under the car and are attached"}, {"url": "https://www.yourmechanic.com/services/oil-pan-gasket-replacement", "passage_text": "How It's Done: 1  Check oil pan for leaks and damage. 2  Remove engine oil pan and gasket. 3  Remove oil and filter. 4  Clean oil pan. 5  Install new gasket. 6  Add new engine oil and filter. 7  Run engine to operating temperature and check for any oil leaks. The oil pan gasket seals the oil pan to the bottom of the engine. The engine has a lot of moving parts that need to be kept lubricated by the engine oil, without which the parts will damage each other. The oil pan and the gaskets are located under the car and are attached"}, {"url": "http://www.carsdirect.com/car-maintenance/how-to-fix-an-oil-leak", "passage_text": "Check your car engine's oil filter and make sure that it's tightened securely and is not leaking. If the filter is leaking, try tightening it with a dry towel and your hands. If the oil filter still leaks, you may need to change the oil in your vehicle, replace the oil filter and add new oil. A cracked or damaged gasket is a common reason for many oil leaks. You will need to drain the oil from your vehicle in order to remove the gasket. Check the gasket to make sure there are no tears, cracks or other damage apparent in it."}, {"url": "http://www.carsdirect.com/car-maintenance/how-to-fix-an-oil-leak", "passage_text": "If you check the drain plug and oil filter of your vehicle, and there appear to be no leaks there, you should remove the oil pan and check the gasket. A cracked or damaged gasket is a common reason for many oil leaks. You will need to drain the oil from your vehicle in order to remove the gasket. Check the gasket to make sure there are no tears, cracks or other damage apparent in it."}, {"url": "http://www.wikihow.com/Troubleshoot-Leaking-Oil", "passage_text": "Steps. 1. Check your oil. Open your car's hood, remove the cap to your oil reservoir and take out the dipstick. Wipe off any oil with a rag or paper towel so you can see the mark that indicates the proper oil level. Dip the stick into the oil reservoir and then take it back out. Look to see if the oil on the stick reaches the oil level mark. 1  Add oil if the crankcase is low or empty. 2  Continue checking every 30 minutes. 3  Rapidly leaking oil could mean there is a hole in your oil pan."}, {"url": "http://www.carsdirect.com/car-maintenance/how-to-fix-an-oil-leak", "passage_text": "Step 2 – Find the Source of the Oil Leak. Check the engine area of your vehicle for any obvious leaks. Crawl underneath the vehicle and check the oil pan or drain plug for leaks. If the drain plug appears to be leaking, you may be able to stop the leak by simply tightening the plug. A cracked or damaged gasket is a common reason for many oil leaks. You will need to drain the oil from your vehicle in order to remove the gasket. Check the gasket to make sure there are no tears, cracks or other damage apparent in it."}, {"url": "http://www.autoleak.com/Oil/Engine-Oil-Leak.php", "passage_text": "Oil Pressure Sensor tracks the pressure of the oil in the engine. Sometimes the pressure sensor can fail and allow oil to escape through it-usually a fairly dramatic oil leak. To fix, replace the Oil Pressure Sensor. Finding oil on the outside of your engine is never a good sign. In some cases the bolts that hold the Oil Pan tight to the engine get loose allowing oil to escape. Replace Oil Pan Gasket. The next two items are common causes of an Engine Oil leak brought on by your last Oil Change. Oil Filter removes any dirt from engine oil as the oil is pumped around the engine."}, {"url": "http://www.autoleak.com/Oil/Engine-Oil-Leak.php", "passage_text": "If you are looking for a quick fix to your engine oil leak, you could always try the additives approach. This is where you add a chemical to the oil in your engine or change your oil to one that has the additive in it. Additive For Oil Leaks are chemicals added to your engine oil that try to stop leaks. They do this by filling in small holes in Oil Seals and by causing Oil Seals to expand/soften. In some cases the bolts that hold the Oil Pan tight to the engine get loose allowing oil to escape. Replace Oil Pan Gasket. The next two items are common causes of an Engine Oil leak brought on by your last Oil Change. Oil Filter removes any dirt from engine oil as the oil is pumped around the engine."}, {"url": "http://www.youtube.com/watch?v=OXFbK5Aber8", "passage_text": "Scotty Kilmer, mechanic for the last 46 years, shows how to fix engine oil leaks in your own car. And, If you like my car help, be sure to watch my live car talk show every Saturday morning at 10 AM CST on YouTube. I answer your car questions LIVE there. "}]