[{"url": "http://www.answers.com/Q/What_is_the_function_of_the_brain_stem", "passage_text": "Yes, it is basically the base of the brain; it is where the brain starts. The brain stem extends from the spinal cord into the brain and is the oldest (most primitive) part of … the brain. Over time, the brain has developed on top of the brain stem to come to what it is today (in modern humans). Confidence votes 5. The function is to regulate the flow of information between the brain and the rest of the body. The brain stem is the lower part of the brain, beneath the cerebrum and in front of the cerebellum. The brain stem connects the rest of the brain to the spinal cord, which runs down your neck and back."}, {"url": "http://www.answers.com/Q/What_is_the_function_of_the_brain_stem", "passage_text": "The brain stem connects the brain to the spinal cord, so that the brain can send messages through the cord to the rest of the body. The functioning of the body is severely com … promised if the spinal cord connections are severed. + 9 others found this useful. Confidence votes 5. The function is to regulate the flow of information between the brain and the rest of the body. The brain stem is the lower part of the brain, beneath the cerebrum and in front of the cerebellum. The brain stem connects the rest of the brain to the spinal cord, which runs down your neck and back."}, {"url": "http://www.strokeeducation.info/brain/brainstem/", "passage_text": "Midbrain. The midbrain, also called the mesencephalon, is a small region of the brain that serves as a relay center for visual, auditory, and motor system information. It regulates autonomic functions, those that the body carries out without conscious thought, such as digestion, heart rate, and breathing rate. major structure in the upper part of the brain stem is called the pons. The pons has two over-arching roles. The first is the regulation of breathing. In the pons, there is a structure called the pneumotaxic center."}, {"url": "http://www.ninds.nih.gov/disorders/brain_basics/know_your_brain.htm", "passage_text": "The hindbrain includes the upper part of the spinal cord, the brain stem, and a wrinkled ball of tissue called the cerebellum (1). The hindbrain controls the body’s vital functions such as respiration and heart rate. The cerebellum coordinates movement and is involved in learned rote movements. "}, {"url": "http://www.innerbody.com/image_nerv01/nerv46.html", "passage_text": "The brain stem is one of the most basic regions of the human brain, yet it is one of the most vital regions for our body’s survival. It forms the connection between the brain and the spinal cord, maintains vital control of the heart and lungs, and coordinates many important reflexes. "}, {"url": "http://www.alz.org/braintour/3_main_parts.asp", "passage_text": "1 The brain stem sits beneath your cerebrum in front of your cerebellum. 2  It connects the brain to the spinal cord and controls automatic functions such as breathing, digestion, heart rate and blood pressure."}, {"url": "http://www.neurosurgery.pitt.edu/centers-excellence/neurosurgical-oncology/brain-and-brain-tumors/brain-and-spinal-cord", "passage_text": "The cerebellum, under the cerebrum at the back of the brain, controls balance and complex actions like walking and talking. The brain stem connects the brain with the spinal cord. It controls hunger and thirst and some of the most basic body functions, such as body temperature, blood pressure, and breathing. The brain is protected by the bones of the skull and by a covering of three thin membranes called meninges. Together, the brain and spinal cord form the central nervous system. This complex system is part of everything we do. It controls the things we choose to do -- like walk and talk -- and the things our body does automatically -- like breathe and digest food."}, {"url": "https://en.wikipedia.org/wiki/Brainstem", "passage_text": "(January 2013). In the anatomy of humans and of many other vertebrates, the brainstem (or brain stem) is the posterior part of the brain, adjoining and structurally continuous with the spinal cord. The medulla oblongata often just referred to as the medulla, is the lower half of the brainstem continuous with the spinal cord. Its upper part is continuous with the pons. The medulla contains the cardiac, respiratory, vomiting and vasomotor centres dealing with heart rate, breathing and blood pressure."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=2517", "passage_text": "The brain stem controls the flow of messages between the brain and the rest of the body, and it also controls basic body functions such as breathing, swallowing, heart rate, blood pressure, consciousness, and whether one is awake or sleepy. The brain stem consists of the midbrain, pons, and medulla oblongata. "}]