[{"url": "http://www.webmd.com/digestive-disorders/picture-of-the-spleen", "passage_text": "Front View of the Spleen. The spleen is an organ in the upper far left part of the abdomen, to the left of the stomach. The spleen varies in size and shape between people, but it’s commonly fist-shaped, purple, and about 4 inches long. Because the spleen is protected by the rib cage, you can’t easily feel it unless it’s abnormally enlarged. It acts as a filter for blood as part of the immune system. Old red blood cells are recycled in the spleen, and platelets and white blood cells are stored there. The spleen also helps fight certain kinds of bacteria that cause pneumonia and meningitis."}, {"url": "http://www.buzzle.com/articles/spleen-function-of-the-spleen.html", "passage_text": "The human spleen is located in the upper left part of the abdomen, just below the diaphragm and behind the stomach. It is a small organ, not larger than the size of a fist. The average human spleen is about 12 cm in length, 7cm in height, 4cm thick and it weighs 150 gm approximately. Function of the Spleen. Spleen, a small, purple colored organ placed in the upper left part of the abdomen, has several important functions in human body. Basically, spleen functions as a part of the immune system and as a filter and reservoir of blood. Find out more information on function of the spleen."}, {"url": "http://patient.info/health/the-spleen", "passage_text": "This leaflet gives a brief overview of the spleen and its functions. The spleen is an organ about the size of a clenched fist found on the left-hand side of your upper abdomen. Its main functions are to filter your blood, create new blood cells and store platelets. It is also a key part of your body's immune system"}, {"url": "https://en.wikipedia.org/wiki/Spleen", "passage_text": "The spleen plays important roles in regard to red blood cells (also referred to as erythrocytes) and the immune system. It removes old red blood cells and holds a reserve of blood, which can be valuable in case of hemorrhagic shock, and also recycles iron. A study published in 2009 using mice found that the spleen contains, in its reserve, half of the body's monocytes within the red pulp. These monocytes, upon moving to injured tissue (such as the heart), turn into dendritic cells and macrophages while promoting tissue healing."}, {"url": "http://www.webmd.com/digestive-disorders/picture-of-the-spleen", "passage_text": "The spleen plays multiple supporting roles in the body. It acts as a filter for blood as part of the immune system. Old red blood cells are recycled in the spleen, and platelets and white blood cells are stored there. The spleen also helps fight certain kinds of bacteria that cause pneumonia and meningitis."}, {"url": "http://www.answers.com/Q/What_does_the_spleen_do_in_the_human_body", "passage_text": "The function of the spleen is the same in the human body as in other vertebrates. It plays a really big role with red blood cells and the immune system. In terms of red blood … cells, it removes worn out cells, recycles iron and also keeps some extra blood handy in case of a hemorrhagic shock. "}, {"url": "http://patient.info/health/the-spleen", "passage_text": "The spleen is found on the left side of your body, behind the stomach on a level with the 9th to 11th ribs. It is similar in structure to a lymph node, and is the largest lymphatic organ in the body. The spleen contains two main types of tissue-white pulp and red pulp. The spleen is an organ about the size of a clenched fist found on the left-hand side of your upper abdomen. Its main functions are to filter your blood, create new blood cells and store platelets. It is also a key part of your body's immune system"}, {"url": "http://www.cyh.com/HealthTopics/HealthTopicDetailsKids.aspx?p=335&np=152&id=2922", "passage_text": "What it does. The spleen plays several important roles in the human body. 1  Before the birth of a baby it works to produce the baby's red blood cells. 2  It gradually stops this before the birth and leaves this job to the bone marrow. The spleen is an organ which is found in the left upper part of the abdomen (tummy) just under the diaphragm, and is protected by the 9th to 12th ribs."}]