[{"url": "http://www.simplyhired.com/salaries-k-phd-neuroscience-jobs.html", "passage_text": "The average salary for phd neuroscience jobs is $87,000. Average phd neuroscience salaries can vary greatly due to company, location, industry, experience and benefits. This salary was calculated using the average salary for all jobs with the term phd neuroscience anywhere in the job listing."}, {"url": "http://study.com/articles/Careers_in_Neuroscience_Research_Job_Options_and_Salary_Info.html", "passage_text": "Salary Info. The BLS statistics for biochemists and biophysicists include neuroscientists. In May 2013, biochemists and biophysicists earned a median annual wage of $84,320. The highest paying industry was professional and commercial equipment and supplies merchant wholesalers, paying an annual mean salary of $123,650."}, {"url": "http://study.com/articles/Neurobiologist_Salary_Job_Description_and_Career_Outlook.html", "passage_text": "Salary of Neurobiologists. According to the U.S. Bureau of Labor Statistics (BLS), medical scientists, other than epidemiologists, earned a median annual salary of $79,840 in May 2013. The highest-paid 10% earned upwards of $149,310 per year, while the lowest-paid 10% earned less than $42,830. Bureau of Labor Statistics. According to the U.S. Bureau of Labor Statistics (BLS), medical scientists, other than epidemiologists, earned a median annual salary of $79,840 in May 2013. The highest-paid 10% earned upwards of $149,310 per year, while the lowest-paid 10% earned less than $42,830."}, {"url": "http://www.simplyhired.com/salaries-k-behavioral-neuroscience-jobs.html", "passage_text": "Average Behavioral Neuroscience Salaries. The average salary for behavioral neuroscience jobs is $64,000. Average behavioral neuroscience salaries can vary greatly due to company, location, industry, experience and benefits. This salary was calculated using the average salary for all jobs with the term behavioral neuroscience anywhere in the job listing."}, {"url": "http://work.chron.com/neuroscience-pay-scale-17866.html", "passage_text": "Focus your career path on research. Doctors and physicians who study diseases of the nervous system aren’t as well paid as neurologists, neurosurgeons or psychiatrists. Salaries for a neuropathologist can range anywhere from $128,500 to $168,500 a year, but the average was closer to $148,500 as of 2012."}, {"url": "http://work.chron.com/neuroscience-pay-scale-17866.html", "passage_text": "Opt for a surgical path in neuroscience. Neurosurgeons, who perform surgical procedures on the nervous system, earned more than neurologists. A survey by Allied Physicians found that salaries start out at $354,000 a year. With just three years of experience, salaries jumped to $541,000 a year, while the highest reported salary for this occupation was $936,000. Doctors and physicians who study diseases of the nervous system aren’t as well paid as neurologists, neurosurgeons or psychiatrists. Salaries for a neuropathologist can range anywhere from $128,500 to $168,500 a year, but the average was closer to $148,500 as of 2012."}, {"url": "http://www.ehow.com/info_7936696_average-salary-neuroscientist.html", "passage_text": "Salary Information. The U.S. Bureau of Labor Statistics classifies neuroscientists as medical scientists. In May 2013, the BLS reported that medical scientists earned an average salary of $90,230 a year. Top-earning medical scientists earned as much as $149,310 a year, while the bottom 10 percent earned $42,830 a year. According to Indeed, the average salary of a neuroscientist in July 2014 was $103,000 a year. Geographic location can affect salaries. For example, in California, neuroscientists earned $111,000 a year. In New York, the average salary is $124,000 a year. In Nebraska, however, the average salary is only $76,00"}]