[{"url": "http://www.answers.com/Q/How_long_can_you_refrigerate_a_honey-baked_ham", "passage_text": "Refrigerate the Honey-Baked Ham and Turkey Breast as soon as you receive it. in the refrigerator the Honey-Baked Ham will stay fresh for 7 to 10 days. Another Answer: If you keep it well sealed and refrigerated at a pretty cold temperature you can keep it there up to two weeks. If you keep it for one week in the fridge and then put it in the freezer in several packages it will be kept safe for a long time."}, {"url": "https://answers.yahoo.com/question/index?qid=20091222141713AAFgpHS", "passage_text": "In the refrigerator, the HoneyBaked Ham will stay fresh for 7 to 10 days and the Turkey Breast for approximately 5 to 7 days. To freeze unused ham portions for later use, wrap in aluminum foil and freeze within 5 days of thawing. The HoneyBaked Ham can be frozen for up to 6 weeks. To serve again, place in refrigerator for 24-48 hours ahead of time to thaw. Once thawed the Ham will keep for 2 days. Serve at Room Temperature The HoneyBaked Ham and Turkey Breast are fully cooked and ready to enjoy"}, {"url": "http://www.eatbydate.com/proteins/meats/ham-shelf-life-expiration-date/", "passage_text": "Ham Cindy 2015-04-21T07:16:00+00:00. How long does ham last? The shelf life of ham depends on a variety of factors, such as the sell by date, the preparation method and how it was stored. Ham, just like bacon, is a cured meat prepared from the hind thighs of a hog. The rear of the pig is thick and flavorful. It is the curing process that makes a ham, it is fully cooked."}, {"url": "http://answers.ifood.tv/question/what-is-the-shelf-life-of-honey-baked-hams", "passage_text": "Honey baked hams can stay in the refrigerator for up to 6-8 days and can stay good in the freezer also. It should be wrapped properly to save it from any contamination. This way it should last for at least 10 days. 1  Login to post comment. "}, {"url": "http://community.cookinglight.com/showthread.php?124335-How-Long-Does-a-Honeybaked-Ham-Last", "passage_text": "Ours arrived yesterday and will stay in the freezer until Tuesday. Product Care Refrigerate the HoneyBaked Ham and Turkey Breast as soon as you receive it. In the refrigerator, the HoneyBaked Ham will stay fresh for 7 to 10 days and the Turkey Breast for approximately 5 to 7 days. To freeze unused ham portions for later use, wrap in aluminum foil and freeze within 5 days of thawing. The HoneyBaked Ham can be frozen for up to 6 weeks. "}, {"url": "http://community.tasteofhome.com/community_forums/f/29/p/764965/6515956.aspx", "passage_text": "purseglove_MA_F_67. Three days for a cooked ham in the refrigerator and you wonder if it is fit to eat and yet you are feeding said pork product to your dogs? Whats wrong with this picture? Your ham is perfectly alright for you to eat. I just used up the last of the ham and it had been in the fridge for a week. I'm usually leary about keeping leftovers for more than a couple of days, but I figured the ham is salted and cured so it should be okay for a few additional days. Color, smell, and texture will tell you alot."}, {"url": "http://www.answers.com/Q/How_long_can_you_refrigerate_a_honey-baked_ham", "passage_text": "Cooked ham can be kept in the refrigerator for about 3 to 4 days  and should be eaten within that time frame or it should be frozen.  If it hasn't been eaten or frozen with … in the time frame, then it  should be discarded. 2 people found this useful. Another Answer: If you keep it well sealed and refrigerated at a pretty cold temperature you can keep it there up to two weeks. If you keep it for one week in the fridge and then put it in the freezer in several packages it will be kept safe for a long time."}, {"url": "http://community.tasteofhome.com/community_forums/f/29/p/764965/6515956.aspx", "passage_text": "purseglove_MA_F_67Three days for a cooked ham in the refrigerator and you wonder if it is fit to eat and yet you are feeding said pork product to your dogs? Whats wrong with this picture? Your ham is perfectly alright for you to eat. I just used up the last of the ham and it had been in the fridge for a week. I'm usually leary about keeping leftovers for more than a couple of days, but I figured the ham is salted and cured so it should be okay for a few additional days. Color, smell, and texture will tell you alot."}, {"url": "http://en.allexperts.com/q/Food-Safety-Issues-767/2008/3/Honey-Baked-Ham-1.htm", "passage_text": "Hi Shannon, The recommendation is to either eat or freeze a cooked ham that has been in the refrigerator for 4-5 days. Since you indicate your ham has been in the refrigerator 2 weeks, the recommendation is to not consume the ham and pitch it. A purchased ham that is vacuum sealed and dated with a sell by date, may be held 4-5 days pass the sell by date before it too must be frozen. Carol."}]