[{"url": "http://fohboh.com/profiles/blogs/understanding-food-cost-for-maximizing-restaurant-profitability", "passage_text": "This percentage should stay somewhere around 28-30% in order for the restaurant to show profitability. When food cost is combined with labor costs, it usually consumes between 50-75% of a restaurant’s total sales."}, {"url": "http://smallbusiness.chron.com/labor-cost-guidelines-restaurant-23753.html", "passage_text": "According to Randy White, CEO of the White-Hutchinson Leisure & Learning Group, a consulting group, the cost of labor and food at a restaurant should ideally be less than 60 percent of the revenue you bring in. Labor should be less than 30 percent of the revenue."}, {"url": "http://restaurants.about.com/od/menu/a/foodcost.htm", "passage_text": "Jordan Siemens/ Stone/ Getty images. Food Cost. Food cost refers to the menu price of a certain dish in comparison to the cost of the food used to prepare that same dish. In other words, how much you pay for food will determine how much you need to charge for it. Generally, food cost should be around 30-35%. This means that if you pay $1.00 for something, you need to charge minimum of $3.34. It may seem like you are charging a lot more than necessary, but keep in mind that you aren't just paying for the food itself."}, {"url": "http://smallbusiness.chron.com/common-food-labor-cost-percentages-14700.html", "passage_text": "How Food and Labor Costs are Calculated. Food and labor costs are calculated as a percentage of the total volume of sales. If a restaurant does $20,000 per week and the total cost of food and beverages is $7,000 for that week, then the food cost is considered 35 percent. If, at the same restaurant, labor (including payroll taxes and benefits) equal $5,000 for the week, then the labor cost is 25 percent."}, {"url": "http://smallbusiness.chron.com/common-food-labor-cost-percentages-14700.html", "passage_text": "Look at Prime Costs to Determine Success. In order to make money in the restaurant business, prime costs should generally be in the 60 percent to 65 percent range. How that breaks down between food and labor is less important than achieving a prime cost maximum that produces a satisfactory profit."}]