[{"url": "http://chemistry.about.com/od/chemistryglossary/a/covalentbonddef.htm", "passage_text": "Share. Covalent Bond Definition: A covalent bond is a chemical link between two atoms in which electrons are shared between them. Examples: There is a covalent bond between the oxygen and each hydrogen in a water molecule (H 2 O)."}, {"url": "http://www.definitions.net/definition/chemical%20bond", "passage_text": "A chemical bond is an attraction between atoms that allows the formation of chemical substances that contain two or more atoms."}, {"url": "http://www.definitions.net/definition/chemical%20bond", "passage_text": "Chemical bond. A chemical bond is an attraction between atoms that allows the formation of chemical substances that contain two or more atoms. The bond is caused by the electrostatic force of attraction between opposite charges, either between electrons and nuclei, or as the result of a dipole attraction."}, {"url": "http://www.thefreedictionary.com/Chemical+bonding", "passage_text": "covalent bond-a chemical bond that involves sharing a pair of electrons between atoms in a molecule. cross-link, cross-linkage-a side bond that links two adjacent chains of atoms in a complex molecule."}, {"url": "http://medical-dictionary.thefreedictionary.com/chemical+bond", "passage_text": "covalent bond a chemical bond between two atoms or radicals formed by the sharing of a pair (single bond), two pairs (double bond), or three pairs of electrons (triple bond)."}, {"url": "http://www.thefreedictionary.com/chemical+bond", "passage_text": "hydrogen bond-a chemical bond consisting of a hydrogen atom between two electronegative atoms (e.g., oxygen or nitrogen) with one side be a covalent bond and the other being an ionic bond."}, {"url": "http://www.thefreedictionary.com/chemical+bond", "passage_text": "attraction, attractive force-the force by which one object attracts another. covalent bond-a chemical bond that involves sharing a pair of electrons between atoms in a molecule. cross-link, cross-linkage-a side bond that links two adjacent chains of atoms in a complex molecule."}, {"url": "http://www.thefreedictionary.com/Chemical+bonding", "passage_text": "hydrogen bond-a chemical bond consisting of a hydrogen atom between two electronegative atoms (e.g., oxygen or nitrogen) with one side be a covalent bond and the other being an ionic bond."}]