[{"url": "http://www.careerprofiles.info/aerospace-engineer.html", "passage_text": "How to Become an Aerospace Engineer. A bachelor's degree is typically required to start out in aerospace engineering. Students who want to become an aerospace engineer should study physics, chemistry, and higher mathematics, such as trigonometry, algebra, and calculus. Certain universities also offer five-year programs in aerospace engineering. Students who complete these programs receive not only a bachelor's degree, but a master's degree as well. Engineers who hold a master's degree or higher are able to teach at universities and work on research and development projects."}, {"url": "http://study.com/articles/Aeronautical_Engineer_Educational_Requirements.html", "passage_text": "Educational Requirements. In order to become an aeronautical engineer, prospective candidates must complete a bachelor's degree program, usually in aerospace or aeronautical engineering. A program accredited by the Accreditation Board for Engineering and Technology (ABET) may be required to later earn licensure. Once EITs have completed the required experience, they may take the second exam to become professional aeronautical engineers. According to the U.S. Bureau of Labor Statistics (BLS), job opportunities for aerospace engineers were projected to increase 7% from 2012-2022, which is slower than average."}, {"url": "http://learn.org/articles/What_are_the_Requirements_for_Becoming_an_Engineer_in_the_US.html", "passage_text": "Engineers in the United States need a bachelor's degree in engineering. Engineers who work with the public are also required to become licensed. Licensure requirements include completing an accredited program and passing a series of exams. Job Requirements. The requirements to become an engineer typically include a bachelor's degree in an engineering discipline, though a master's degree may be needed for advancement in some fields."}, {"url": "http://www.skillchart.com/careers/engineering/aerospace.htm", "passage_text": "Aerospace engineers can also work for their respective governments such as NASA in the U.S. Education Required. To become an aerospace engineer requires a technical degree in engineering. You must obtain at a minimum a bachelor's degree in Aerospace engineering or an equivalent in mechanical or electrical engineering."}, {"url": "http://www.engin.umich.edu/aero/academics/undergrad/program/requirements", "passage_text": "Candidates for the Bachelor of Science degree in Engineering (Aerospace Engineering) - B.S.E (Aerospace E.) - must complete the program listed above. This sample schedule is an example of one leading to graduation in eight terms. "}, {"url": "http://www.ehow.com/list_7277201_education-needed-become-aerospace-engineer_.html", "passage_text": "High School Prep Classes. The road to becoming an aerospace engineer ideally starts in high school. Potential engineers should focus on advanced math classes such as trigonometry and calculus. Additionally, an early background in physics, chemistry and biology will help soon-to-be aerospace engineers in college. One condition of licensure is completing a program accredited by the Accreditation Board for Engineering and Technology (ABET). To become licensed, the aerospace engineer must show proof that he completed his education and pass a test administered by the state."}, {"url": "http://www.answers.com/Q/What_education_and_training_is_required_to_become_an_engineer", "passage_text": "Engineering is a 4 year college degree. You would take lots of math and science courses before you get into the core engineering courses. Chemical engineers often minor in chemistry, electrical engineers in computer science, mechanical and aeronautical engineers take a lot of physics and so on. All use math extensively. "}, {"url": "http://www.myfuture.com/careers/education/aerospace-engineers_17-2011.00", "passage_text": "Entry-level aerospace engineers usually need a bachelor's degree. High school students interested in studying aerospace engineering should take courses in chemistry, physics, and math, including algebra, trigonometry, and calculus. + Expand Section. "}, {"url": "http://www.bls.gov/ooh/architecture-and-engineering/aerospace-engineers.htm", "passage_text": "Aerospace engineers use the principles of calculus, trigonometry, and other advanced topics in mathematics for analysis, design, and troubleshooting in their work. Aerospace engineers must have a bachelor’s degree in aerospace engineering or some other field of engineering or science related to aerospace systems. Some aerospace engineers work on projects that are related to national defense and thus require security clearances. "}]