[{"url": "https://en.wikipedia.org/wiki/Seamount", "passage_text": "Most seamounts are volcanic in origin, and thus tend to be found on oceanic crust near mid-ocean ridges, mantle plumes, and island arcs. Overall, seamount and guyot coverage is greatest as a proportion of seafloor area in the North Pacific Ocean, equal to 4.39% of that ocean region. Seamounts can be found in every ocean basin in the world, distributed extremely widely both in space and in age. A seamount is technically defined as an isolated rise in elevation of 1,000 m (3,281 ft) or more from the surrounding seafloor, and with a limited summit area, of conical form. If small knolls, ridges and hills less than 1,000 m in height are included there are over 100,000 seamounts in the world ocea"}, {"url": "https://en.wikipedia.org/wiki/Seamount", "passage_text": "A seamount is a mountain rising from the ocean seafloor that does not reach to the water's surface (sea level), and thus is not an island. Seamounts are typically formed from extinct volcanoes that rise abruptly and are usually found rising from the seafloor to 1,000–4,000 metres (3,300–13,100 ft) in height. Seamounts can be found in every ocean basin in the world, distributed extremely widely both in space and in age. A seamount is technically defined as an isolated rise in elevation of 1,000 m (3,281 ft) or more from the surrounding seafloor, and with a limited summit area, of conical form. If small knolls, ridges and hills less than 1,000 m in height are included there are over 100,000 seamounts in the world ocean"}, {"url": "https://en.wikipedia.org/wiki/Geography_of_Bermuda", "passage_text": "It is nearly antipodal to Perth, Western Australia. Although commonly referred to in the singular (i.e., The Island, The Rock, and Bermuda), the territory consists of approximately 138 islands, with a total area of 71.7 km 2 (27.7 sq mi). Located off the east coast of the United States, it is situated around 1,770 km (1,100 mi) northeast of Miami, Florida and 1,350 km (840 mi) south of Halifax, Nova Scotia, west of Spain and north of Puerto Rico."}, {"url": "http://www.answers.com/Q/Is_bermuda_island_a_volcano", "passage_text": "Making the world better, one answer at a time. Bermuda is a basically a volcanic sea mountain that formed from the mid-Atlantic ridge about 100 million years ago. Its volcano is extinct and most Bermudians don't seem to be worried about the possibility of the volcano erupting in their lifetime. there is a island in the middle of the bermuda triangle thats why the bermuda triangle doesnt let you in because it doesnt want you to see the island. 9 people found this useful. Edit. Share to:"}, {"url": "https://en.wikipedia.org/wiki/Geography_of_Bermuda", "passage_text": "Bermuda is located in the Subtropics and has a Humid subtropical climate. Bermuda experiences hot and humid summers with the majority of precipitation falling from isolated showers and thunderstorms. Located off the east coast of the United States, it is situated around 1,770 km (1,100 mi) northeast of Miami, Florida and 1,350 km (840 mi) south of Halifax, Nova Scotia, west of Spain and north of Puerto Rico."}, {"url": "http://www.answers.com/Q/Is_bermuda_island_a_volcano", "passage_text": "1 Located off the east coast of North America, Bermuda is actually considered part of 2  …. Time for Two in Bermuda A Bermuda honeymoon may be the perfect way for you to spend the start of your new life together. there is a island in the middle of the bermuda triangle thats why the bermuda triangle doesnt let you in because it doesnt want you to see the island. 9 people found this useful. Edit. Share to:"}, {"url": "http://oceanexplorer.noaa.gov/explorations/09bermuda/background/bermudaorigin/bermudaorigin.html", "passage_text": "Origin of Bermuda and Its Caves. The islands of Bermuda sit atop a long-extinct, mid-ocean volcanic seamount located 1,000 kilometers (600 miles) east of the Carolinas in that part of the North Atlantic Ocean known as the Sargasso Sea. Based on the current area of the Bermuda Pedestal and the maximum elevation of other mid-ocean volcanoes, the elevation of the original Bermuda volcano would have been about 1,000 meters (3.280 feet)."}, {"url": "http://www.geographic.org/geographic_names/name.php?uni=-238370&fid=6444&c=undersea_features", "passage_text": "NOTE: The information regarding Great Meteor Tablemount in Undersea Features on this page is published from the data supplied by the National Geospatial-Intelligence Agency, a member of the Intelligence community of the United States of America, and a Department of Defense (DoD) Combat Support Agency. "}, {"url": "http://oceanexplorer.noaa.gov/explorations/09bermuda/background/bermudaorigin/bermudaorigin.html", "passage_text": "Watch a video about the formation of the Bermuda caves. Figure 1. These maps of Bermuda show its location in the North Atlantic (insert) and the orientation and structure of the four peaks comprising the Bermuda Islands and Pedestal, along with the adjacent Argus, Challenge, and Bowditch seamounts. Click image for larger view and image credit. Based on the current area of the Bermuda Pedestal and the maximum elevation of other mid-ocean volcanoes, the elevation of the original Bermuda volcano would have been about 1,000 meters (3.280 feet)."}]