[{"url": "http://www.emedicinehealth.com/kidney_infection/page2_em.htm", "passage_text": "The most common bacteria causing urinary tract infection or kidney infection are those that are normally seen in the vagina, gastrointestinal tract, or skin. By far, the most common organism causing urinary tract infection is Escherichia coli (E. coli), responsible for up to 80% of kidney and urinary infections. Sexual intercourse may increase the risk of urinary tract infections in women. Kidney infection may be facilitated by the introduction of bacteria from outside (vagina) to the urinary system through the urethra. Pregnant women may also be at higher risk for developing urinary tract"}, {"url": "http://answers.webmd.com/answers/1177457/what-are-different-types-of-kidney", "passage_text": "190 Followers. A. Kidney infection, or pyelonephritis, may be classified as uncomplicated, complicated, or chronic kidney infection (long-term). A complicated kidney infection refers to severe involvement of the kidney, for example, abscess formation, or gas seen in the kidney by an imaging study, such as a CT scan. In these situations, the symptoms may be more severe and less responsive to usual treatments. "}, {"url": "http://www.mayoclinic.org/diseases-conditions/kidney-infection/basics/definition/con-20032448", "passage_text": "Male urinary system. Kidney infection (pyelonephritis) is a specific type of urinary tract infection (UTI) that generally begins in your urethra or bladder and travels up into your kidneys. A kidney infection requires prompt medical attention. "}, {"url": "http://www.healthline.com/health/kidney-stones", "passage_text": "This type of stone is found mostly in women with urinary tract infections. These stones can be large and cause urinary obstruction. These stones are caused by a kidney infection. Treating an underlying infection can prevent the development of struvite stones. "}, {"url": "http://www.medicalnewstoday.com/articles/182306.php", "passage_text": "Kidney infection, also known as renal infection or pyelonephritis, is a type of urinary tract infection (UTI) that is usually caused caused by E. coli bacteria. The bacteria may have spread from the bladder or the urethra to one of the kidneys, infecting it. There are two types of kidney infection: 1  Uncomplicated kidney infection-the patient is healthy and serious complications are highly unlikely. 2  Complicated kidney infection-the patient is more likely to suffer complications, perhaps because of a pre-existing illness or condition."}, {"url": "http://www.medicinenet.com/kidney_infection/page4.htm", "passage_text": "Urine, similar to other fluids in the body, is normally sterile without any bacterial infection. Therefore, the presence of bacteria in the urine is considered abnormal and may lead to urinary tract infection. Typically, bacteria gain access to the urinary system from outside through the urethra (the drainage tube for urine from the bladder). The bacteria may then ascend in the urinary system and cause kidney infections."}, {"url": "http://www.emedicinehealth.com/kidney_infection/page2_em.htm", "passage_text": "Kidney Infection Causes. Kidney and urinary tract infections may be caused by bacteria invading the urine, which is normally a sterile body fluid. Bacteria most commonly gain access to the urine through the urethra, which can be exposed to bacteria from outside of the body. Sexual intercourse may increase the risk of urinary tract infections in women. Kidney infection may be facilitated by the introduction of bacteria from outside (vagina) to the urinary system through the urethra. Pregnant women may also be at higher risk for developing urinary tract infections."}, {"url": "http://www.emedicinehealth.com/kidney_infection/page2_em.htm", "passage_text": "Kidney stones are another factor that may increase the likelihood of urinary tract infection. Stones can cause partial or complete obstruction to the flow of urine from the kidneys and ureters. This obstruction may act as a focus of infection in the urinary system, leading to urinary tract infections. Sexual intercourse may increase the risk of urinary tract infections in women. Kidney infection may be facilitated by the introduction of bacteria from outside (vagina) to the urinary system through the urethra. Pregnant women may also be at higher risk for developing"}, {"url": "http://www.healthcommunities.com/kidney-infection/treatments.shtml", "passage_text": "Treatment for Kidney Infection. Kidney infections are treated using antibiotics to destroy the bacteria. The type of antibiotic used varies, depending on the type of bacteria that is causing the infection. Commonly-prescribed antibiotics include Amoxil, Cipro, Levaquin, and Bactrim. "}]