[{"url": "http://www.justanswer.com/dog-health/58pdz-first-signs-pregnancy-chihuahua-when.html", "passage_text": "Hello, The first few weeks of dog pregnancy you will probably see decreased appetite, a sudden decrease in activity, nipple growth, and behavioral changes. She may be far more affectionate than her regular behavior or just want to be left alone, it."}, {"url": "http://pets.thenest.com/10-ways-tell-dog-pregnant-3677.html", "passage_text": "A female dog's pregnancy term is only around two months, with most dogs remaining pregnant for between 58 and 66 days. This relatively short gestation period can make it easy to miss some of the early signs of pregnancy. "}, {"url": "http://www.welovechihuahuas.com/about-chihuahua-pregnancy/", "passage_text": "Chihuahua Pregnancy Preparations. If your chihuahua is pregnant, there are a few things you will need to know and do to prepare. 1  Gestation period. 2  This may be anything from 58 to 66 days. 3  Knowing the insemination date will allow you to predict the birth date and prepare for it. 1 Anything over 70 days is cause for concern and you should get your dog to a vet immediately in case of complications. 2  False pregnancy. 3  Your pooch will show all the signs of a real pregnancy but they will start to fade within a month. 4  Temperature drop."}, {"url": "http://barkersnook.com/chi_general.html", "passage_text": "CHIHUAHUA PREGNANCY & WHELPING ADVICE The signs of pregnancy vary from bitch to bitch, and some can conceal their secret for a surprisingly long time, especially if there is only one small puppy. On the other hand if there is a large litter, pregnancy may become apparent as early as the third week. "}, {"url": "http://pets.thenest.com/care-pregnant-chihuahua-3554.html", "passage_text": "Chihuahuas can have a successful pregnancy with your help. Your precious pooch is pregnant, so you want to make sure you do all you can for her. Chihuahuas may be the tiniest dogs in the world, but that doesn't mean they can't have a successful pregnancy. "}, {"url": "http://www.chiwawadog.com/breeding/pregnancy.html", "passage_text": "Dog Pregnancy. The gestation period of a Chihuahua lasts about 58-63 days after mating. You can tell whether or not a Chihuahua is pregnant by a blood test after 2 weeks or by other methods. The only way to find out early in the pregnancy is by an ultrasound examination. "}, {"url": "http://www.dog-first-aid-101.com/pregnant-chihuahua.html", "passage_text": "Most owners are a little skeptical when it comes to a Pregnant Chihuahua. If you think you have a Chihuahua that is pregnat first look for signs. 1  The first sign is your Chihuahua will not be as energetic as she once was before and sleep more often then usual. 2  The second sign will be that her stomach will appear bigger very quickly. When these signs appear, immediately take your Chihuahua to a vet. If your Chihuahua is giving birth through cesarean section there may be fur loss due to anesthetics. In due time the fur will grow back and is perfectly normal."}, {"url": "http://www.petchidog.com/chihuahua-pregnancy", "passage_text": "From time of conception to date of giving birth, your Chihuahua will be pregnant for 9 weeks (63 days). This, of course, is not a lot of time. At the first signs of pregnancy with your dog, you should bring her to the vet. Even if it appears that two dogs break early, a Chihuahua may become pregnant. Therefore, while many owners may believe that they stopped a mounting before anything happened, it may actually be too late. 3) A Chihuahua can become pregnant by two different dogs. This is known as a multi--sired litter."}, {"url": "http://www.welovechihuahuas.com/about-chihuahua-pregnancy/", "passage_text": "If your chihuahua is pregnant, there are a few things you will need to know and do to prepare. 1  Gestation period. 2  False pregnancy. 3  Temperature drop. 4  Help during pregnancy. 5  Quality feeding. 6  Rest and quiet. 7  Gentle treatment. 8  Nesting. 1 Anything over 70 days is cause for concern and you should get your dog to a vet immediately in case of complications. 2  False pregnancy. 3  Your pooch will show all the signs of a real pregnancy but they will start to fade within a month. 4"}]