[{"url": "http://medical-dictionary.thefreedictionary.com/Substrate+(biochemistry)", "passage_text": "substrate. any substance upon which an enzyme acts. substrate binding site. part of the active site of an enzyme which includes the amino acid residues that come into contact with the substrate. substrate specificity. range of substrates that can be catalytically converted to product by an enzyme."}, {"url": "http://saylor.org/site/wp-content/uploads/2011/01/Active-Site.pdf", "passage_text": "Structural Biochemistry/Enzyme/Active Site 1 Structural Biochemistry/Enzyme/Active Site Overview An active site is the part of an enzyme that directly binds to a substrate and carries a reaction. The binding of thesubstrate to the enzyme causes changes in the chemical bonds of the substrate and causes the reactions that lead tothe formation of products. The products are released from the enzyme surface to regenerate the enzyme for anotherreaction cycle."}, {"url": "http://chemistry.about.com/od/chemistryglossary/g/Substrate-Definition.htm", "passage_text": "By Anne Marie Helmenstine, Ph.D. Definition: A substrate is the medium in which a chemical reaction takes place or the reagent in a reaction that provides a surface for absorption. In biochemistry, an enzyme substrate is the substance the enzyme acts upon. "}, {"url": "http://www.thefreedictionary.com/substrate", "passage_text": "substrate-the substance that is acted upon by an enzyme or ferment. substance-the real physical matter of which a person or thing consists; DNA is the substance of our genes. sub·strate. 1. The material or substance on which an enzyme acts. See Note at enzyme. 2. The surface on which plants, algae, or certain animals, such as barnacles, live or grow. A substrate may serve as a source of food for an organism or simply provide support. - The surface on which an organism lives or moves."}, {"url": "http://www.thefreedictionary.com/substrate", "passage_text": "substrate. n. 1. (Biochemistry) biochem the substance upon which an enzyme acts. sub·strate. 1. The material or substance on which an enzyme acts. See Note at enzyme. 2. The surface on which plants, algae, or certain animals, such as barnacles, live or grow. A substrate may serve as a source of food for an organism or simply provide support. - The surface on which an organism lives or moves."}, {"url": "https://en.wikibooks.org/wiki/Structural_Biochemistry/Enzyme/Affinity_Labels_(reactive_substrate_analogs)", "passage_text": "Definition [edit]. Affinity label or reactive substrate analog are molecules that have a similar structure to the substrate allowing them to covalently bind to the active site of the enzyme. They react with the substrate, inhibiting the enzyme. Substrate analogs that bind to active sites of enzymes to form product of covalent bond that is stable on binding site to inhibit chemical reaction; irreversible enzyme inhibitor that react with functional group of enzyme and has more specificity for enzyme."}, {"url": "http://www.biology-online.org/dictionary/Substrate", "passage_text": "Substrate. Definition. noun, plural: substrates. (geology). A substratum or an underlying stratum. (chemistry). The substance acted upon by an enzyme. (biology). The earthy material in which an organism lives, or the surface or medium on which an organism grows or is attached. (marine biology). The material (e.g. dirt, rocks, sand, gravel) in the bottom of a marine habitat, or one that forms the bed of a stream (or of an aquarium); the source of food for some microorganisms."}, {"url": "https://en.wikipedia.org/wiki/Substrate_%28biochemistry%29", "passage_text": "Biochemistry [edit]. In biochemistry, the substrate is a molecule upon which an enzyme acts. Enzymes catalyze chemical reactions involving the substrate(s). In the case of a single substrate, the substrate bonds with the enzyme active site, and an enzyme-substrate complex is formed. In chemistry, a substrate is typically the chemical species being observed in a chemical reaction, which reacts with reagent to generate a product. In synthetic and organic chemistry, the substrate is the chemical of interest that is being modified. In biochemistry, an enzyme substrate is the material upon which an enzyme acts. When referring to Le Chatelier's Principle, the substrate is the reagent whose concentration is chang"}, {"url": "https://simple.wikipedia.org/wiki/Substrate_(biochemistry)", "passage_text": "In biochemistry, a substrate is the molecule acted on by an enzyme to produce a product. p37. The general equation for an enzyme reaction is: An example: Sucrase, 400 times the size of its substrate sucrose, splits the sucrose into its constituent sugars, which are glucose and fructose. 1 Enzymes increase the rate of reaction up to 10 billion-fold and are effective in tiny amounts. 2  One enzyme molecule may convert 1000 molecules of substrate a minute, and some are known to convert 3 million in a minute. 3  p39."}]