[{"url": "https://en.wikipedia.org/wiki/Cerebrospinal_fluid", "passage_text": "CSF circulates within the ventricular system of the brain. The ventricles are a series of cavities filled with CSF, inside the brain. The majority of CSF is produced from within the two lateral ventricles. The brain produces roughly 500 mL of cerebrospinal fluid per day. This fluid is constantly reabsorbed, so that only 100-160 mL is present at any one time."}, {"url": "http://www.principlesofanatomyandphysiology.com/category/nervous-system-study-guides/page/2/", "passage_text": "Some of the fluid continues down the 4.____ of the spinal cord, but most of it circulated into the 5.____ by passing through three tiny openings in the walls of the 6.____. As a rule, cerebrospinal fluid is formed and drained back into the venous blood at the same rate. If its drainage is blocked, a condition called 7.____ occurs, which results in increased pressure on the brain. Ordinarily, cerebrospinal fluid flows from the lateral ventricles to the third ventricle and then through the 3.____ to the fourth ventricle."}, {"url": "https://quizlet.com/18545469/anatomy-ch-7-nervous-system-flash-cards/", "passage_text": "the meninges, which cover the spinal cord, extend more inferiorly to form a sac from which cerebrospinal fluid can be withdrawn without damage to the spinal cord. monitors all information about changes occurring both inside and outside the body, processes and interprets the information received and integrates it in order to make decisions, commands responses by activating muscles, glands, and other parts of the nervous system."}, {"url": "http://www.answers.com/Q/Cerebrospinal_fluid_is_formed_by_capillary_knots_called", "passage_text": "The procedure to remove cerebrospinal fluid is called a lumbar puncture, or spinal tap, because the area of the spinal column used to obtain the sample is in the lumbar spine, … or lower section of the back. Justin Casper. It is produced in the brain by modified ependymal cells in the choroid plexus. 3 people found this useful. Edit. Share to: 1  John Long Climber John Long is a legend on the California rock-climbing scene, best known for his exploits with a group of other young men in the 1970s and 1980s."}, {"url": "https://en.wikipedia.org/wiki/Cerebrospinal_fluid", "passage_text": "Cerebrospinal fluid (CSF) is a clear, colorless body fluid found in the brain and spine. It is produced in the choroid plexuses of the ventricles of the brain. It acts as a cushion or buffer for the brain's cortex, providing basic mechanical and immunological protection to the brain inside the skull. The brain produces roughly 500 mL of cerebrospinal fluid per day. This fluid is constantly reabsorbed, so that only 100-160 mL is present at any one time."}, {"url": "https://en.wikipedia.org/wiki/Cerebrospinal_fluid", "passage_text": "Hydrocephalus is an abnormal accumulation of cerebrospinal fluid (CSF) in the ventricles, or cavities, of the brain, which may cause increased intracranial pressure (ICP) inside the skull. It may lead to enlargement of the cranium if hydrocephalus occurs during development. The brain produces roughly 500 mL of cerebrospinal fluid per day. This fluid is constantly reabsorbed, so that only 100-160 mL is present at any one time."}, {"url": "http://www.studystack.com/flashcard-197666", "passage_text": "MOst CSF circulates in to______ by passing through 3 tiny openingsin the walls of the_________. Subarachnoid; 4th ventricle. CSF is formed and drained back into the venous blood at the same rate. If its drainage is blocked, a donditionn called______ occurs, which results in increased pressure on the brain. Welcome to StudyStack, where users create FlashCards and share them with others. Click on the large flashcard to flip it over. Then click the green, red, or yellow box to move the current card to that box. Below the flashcards are blue buttons for other activities that you can try to study the same information."}, {"url": "http://www.principlesofanatomyandphysiology.com/category/nervous-system-study-guides/page/2/", "passage_text": "Cerebrospinal fluid is formed by the capillary knots called 1.____, which hang into the 2.____ of the brain. Ordinarily, cerebrospinal fluid flows from the lateral ventricles to the third ventricle and then through the 3.____ to the fourth ventricle."}, {"url": "http://www.answers.com/Q/Cerebrospinal_fluid_is_formed_by_capillary_knots_called_what", "passage_text": "In Human Anatomy and Physiology. The procedure to remove cerebrospinal fluid is called a lumbar puncture, or spinal tap, because the area of the spinal column used to obtain the sample is in the lumbar spine, … or lower section of the back. I am currently a Certified Nursing Assistant and a nursing student. Caring for people is something I love and could never get tired of. I got interested in health care ever since I started my volunteer work in a emergency room at age 15."}, {"url": "https://quizlet.com/18545469/anatomy-ch-7-nervous-system-flash-cards/", "passage_text": "some of the fluid continues down the __ of the spinal cord, but most of it circulates into the __ by passing through three tiny openings in the walls of the __. central canal, subarachnoid space, fourth ventricle. monitors all information about changes occurring both inside and outside the body, processes and interprets the information received and integrates it in order to make decisions, commands responses by activating muscles, glands, and other parts of the nervous system."}]