[{"url": "http://www.riskregisterapp.com/", "passage_text": "Risk Register+. Maintain a Risk Log of your Project on iPad. Risk Register is a tool commonly used in Project Management to assess and manage the Project Risk. It is also used for organizational risk assessments. It acts as a central repository for all risks identified by the project or organization. "}, {"url": "http://www.cio.com.au/article/401244/how_create_risk_register/", "passage_text": "If you're unsure how to create a Risk Register and the following the following is a brief guide on how to get started in just a few steps: 1  Create the Risk Register-this step will be undertaken when the project plan is approved and the Risk Section of the project plan should serve as the basis for the document. "}, {"url": "https://www.gartner.com/doc/1229543/risk-register-need-", "passage_text": "Summary. An IT-risk register is an important tool for communicating IT-related risks to senior leadership. An IT-risk register will help risk and security professionals convey information about the current status of IT-related risks and associated potential impacts to stakeholders within the business. "}, {"url": "http://continuingprofessionaldevelopment.org/key-elements-project-risk-register-template/", "passage_text": "Here are the 12 key elements of a Project Risk Register template together with some examples to help you understand how the process works. Elements 1 to 3 record the results of the Risk Identification phase. 1. Risk Category – This is where you categorize your risk. Your Project Risk Register Template is a handy tool to add structure and consistency to your project risk management process. Using this template framework puts you in the lead to quickly and easily carry out a complete risk management process."}, {"url": "http://www.brighthubpm.com/risk-management/111866-sample-risk-register-template/", "passage_text": "Additional Risk Register Templates. Irrespective of the type of project or risk, or even the techniques of project management applications (Business, Engineering, Technical, etc.), risk registers show a basic template pattern. "}, {"url": "http://www.risk.biz/register.html", "passage_text": "A Sample Corporate Risk Register. This item allows the user to enter their risks and impacts and manage them. The second part of the spreadsheet allows the user to set up relevant departments where the risks reside (some sample departments have been input but they can be amended). "}, {"url": "http://changingminds.org/disciplines/change_management/4d_change_project/documents/risk_register.htm", "passage_text": "Description. The Risk Register holds a list of key risks that need to be monitored and managed. The alternative is to close your eyes and hope that problems will not occur. Definition: a risk is an undesirable future event. The Risk Register analyzes risks and drives action to: 1  Reduce the likelihood of the risk occurring. 2  Increase the visibility of the risk. "}, {"url": "http://www.projectmanagementdocs.com/project-planning-templates/risk-register.html", "passage_text": "Risk Register. Manage Your Risks! Use the project Risk Register for the day to day management of the risks in your project-It just may be the most useful tool in your PM toolbox. The Risk Register contains a listing of all risks identified for a project. "}, {"url": "http://planning.usace.army.mil/toolbox/smart.cfm?Section=8&Part=4", "passage_text": "Using a Risk Register in Feasibility Studies. The risk register collects information about: 1  Risks and their causes. 2  Consequences of risk. 3  Likelihood of the risk occurring. 4  Confidence of the risk consequences and likelihood of its occurring. "}]