[{"url": "http://www.sussexbythesea.com/bognor-regis", "passage_text": "Sunniest Bognor Regis-famous for historic royal visits and Billy Butlin, Bognor Regis is a popular traditional seaside holiday resort in the centre of the south coast of England. Sheltered by our near neighbours, the Isle of Wight and The South Downs, come and discover the reason for our long hours of sunshine. Bognor Regis is also home to the well-known Butlin’s Resort – a four star holiday centre welcoming both day visitors and overnight guests. Its hotels and apartments are among a range of quality accommodation available across the town."}, {"url": "http://www.sussexbythesea.com/bognor-regis-attractions", "passage_text": "There’s a great range of things to do in Bognor Regis to keep everyone entertained. That’s why the West Sussex seaside town is such a firm favourite among the thousands of families who enjoy great days out and traditional family holidays, year after year. "}, {"url": "http://www.bognorregis.gov.uk/BR-Town-Council/Visitor_Information__12219.aspx", "passage_text": "Bognor Regis is also home to the largest seaside holiday centre in the South of England – the famous Butlins Resort (you will see it at the eastern end of the Promenade). The resort has some fantastic facilities and you can either base yourself there or just get a day pass to make the most of the attractions. A Warm Welcome awaits you insunniest Bognor Regis. Sunny Bognor Regis is a great place for family days out, a seaside holiday or short break. Our wonderful beaches have regularly flown the European Blue Flag and Seaside Award for being clean, safe and with good facilities."}, {"url": "http://www.bognor-regis.co.uk/welcome.html", "passage_text": "Welcome to Bognor Regis. 00:45 Thursday 15th October, 2015. Bognor Regis is a pleasant seaside town situated on the south coast of England, approximately half way between Porstmouth and Brighton and has more recorded hours of sunshine* than anywhere else in Britain. "}, {"url": "http://www.bognor-regis.org/", "passage_text": "Life Board Workshops help you to do this. Dog Walking in Bognor Regis-If you have time for a spot of dog walking; the Cinnamon Trust would like to hear from you today. Bognor Regis is a small seaside town on the south coast of England in the county of West Sussex. It is situated approximately 70 miles south west of London. The town can trace its roots back to when it was a small fishing village. "}, {"url": "https://en.wikipedia.org/wiki/Bognor_Regis", "passage_text": "Bognor is one of the oldest recorded Anglo-Saxon place names in Sussex. In a document of 680 AD it is referred to as Bucgan ora meaning Bucge's (a female Anglo-Saxon name) shore, or landing place. On the beach between Bognor Regis and Aldwick lies the wreck of a Floating Pontoon (Caisson) which was once part of the Mulberry Floating harbours used by the Allies to invade the French coast on D-Day 6 June 1944."}, {"url": "https://en.wikipedia.org/wiki/Bognor_Regis", "passage_text": "Bognor Regis /ˌbɒɡnər ˈriːdʒɨs/ is a seaside resort town and civil parish in the Arun district of West Sussex, on the south coast of England. It is 55.5 miles (89 km) south-west of London, 24 miles (39 km) west of Brighton, and 5.81 miles (9 km) south-east of the city of Chichester. On the beach between Bognor Regis and Aldwick lies the wreck of a Floating Pontoon (Caisson) which was once part of the Mulberry Floating harbours used by the Allies to invade the French coast on D-Day 6 June 1944."}, {"url": "http://www.leaders.co.uk/pages/bognor-regis", "passage_text": "About. What is life like in Bognor. Bognor Regis is a popular seaside resort on the south coast of England, combining idyllic waterside living with a strong community spirit and excellent links to other towns and cities in the region. "}]