[{"url": "http://www.foodnetwork.com/recipes/food-network-kitchens/roasted-turkey-recipe.html", "passage_text": "Tent the bird with foil. Roast the turkey for 2 hours. Remove the foil and baste with the remaining butter. Increase oven temperature to 425 degrees F and continue to roast until an instant read thermometer registers 165 degrees F in the thigh of the bird, about 45 minutes more. Remove turkey form the oven and set aside to rest for 15 minutes before carving."}, {"url": "http://www.foodconsumer.org/newsite/6/Cooking/what_temperature_to_cook_a_turkey_2511100127.html", "passage_text": "2. Be sure the turkey is completely thawed. A frozen turkey doubles the cooking time for cooking a thawed turkey. 3. Place the turkey breast-side up on a flat wire rack in a shallow roasting pan 2 to 2 1/2 inches deep. Optional steps: Tuck wing tips back under shoulders of the turkey (called akimbo). Now the turkey cooking time of a whole turkey is determined by a variety of variables including, but not limited to oven temperature and configuration, the size of the turkey, whether the bird is frozen or stuffed."}, {"url": "http://www.theepochtimes.com/n3/377295-what-temperature-to-cook-a-turkey-and-how-long/", "passage_text": "In a conventional oven, set the temperature to 325 degrees Fahrenheit. Then put the turkey or turkey breast on a rack in a shallow roasting pan. The USDA recommends not stuffing a turkey before its cooked. It is recommended to cook the stuffing outside the turkey in a casserole. "}, {"url": "http://www.cookingnook.com/how-to-cook-a-turkey/", "passage_text": "1 Roast turkey for about 20 minutes per pound, until the meat thermometer reads 170ºF for an unstuffed turkey or 180ºF for a stuffed turkey. 2  Remove turkey when cooking is completed and let stand for 15 to 20 minutes before you carve it to allow the juices to settle. 1 Cooked turkey may be stored in a covered container, plastic bag or wrapped in aluminum foil for up to 4 days in the refrigerator, or up to 3 months in the freezer. 2  After cooking, keep the turkey hot, above 140ºF or refrigerate below 40ºF. 3  Do not leave turkey at room temperature for more than 2 hours."}, {"url": "http://www.foodconsumer.org/newsite/6/Cooking/what_temperature_to_cook_a_turkey_2511100127.html", "passage_text": "When it comes to what temperature to cook a turkey, there are two things you need to know. they are the oven temperature and the inner temperature of the turkey when the cooking is done. Now the turkey cooking time of a whole turkey is determined by a variety of variables including, but not limited to oven temperature and configuration, the size of the turkey, whether the bird is frozen or stuffed."}, {"url": "http://www.foodconsumer.org/newsite/6/Cooking/what_temperature_to_cook_a_turkey_2511100127.html", "passage_text": "How long to cook a turkey depends on a number variables including the size of turkey, pan size and configuration, oven temperature among other things. Here is a turkey cooking time table for cooking an unstuffed turkey at the condition given below. Now the turkey cooking time of a whole turkey is determined by a variety of variables including, but not limited to oven temperature and configuration, the size of the turkey, whether the bird is frozen or stuffed."}, {"url": "http://www.butterball.com/how-tos/roast-a-turkey", "passage_text": "1 Place your turkey in the oven. 2  When the turkey is about ⅔ done, loosely cover breast and top of drumsticks with a piece of foil to prevent overcooking. 3  Your turkey is done when the temperature with a meat thermometer is 180° F in thigh and 165° F in breast or stuffing. Just follow these simple instructions for a fresh or thawed turkey: 1  Preheat oven to 325° F. Drain juices and pat dry with clean paper towels. 2  Place turkey breast side up on a flat rack in a shallow roasting pan 2 to 2½ inches deep. 3  Turn the wings back to hold the neck skin in place."}, {"url": "http://www.fabulousfoods.com/articles/19926/turkey-roasting-time-temperature-and-cooking-method-guide", "passage_text": "1. Do not roast the turkey in a oven temperature lower than 325° F. Poultry should be roasted at 325° F. or higher to avoid potential food safety problems. 2. Do not roast the turkey in a brown paper grocery bag. Present day grocery bags may be made of recycled materials and are not considered safe for food preparation. 3. Take the guesswork out of preparing the perfect turkey by choosing the right cooking method and temperature for your version of the perfect turkey. Since so many folks are intimidated by the prospect of cooking a turkey, we went to the experts for the lowdown."}, {"url": "http://www.fsis.usda.gov/wps/portal/fsis/topics/food-safety-education/get-answers/food-safety-fact-sheets/poultry-preparation/lets-talk-turkey/ct_index", "passage_text": "1 If using an oven-proof food thermometer, place it in the turkey at the start of the cooking cycle. 2  It will allow you to check the internal temperature of the turkey while it is cooking. 3  For turkey breasts, place thermometer in the thickest part. 4  For whole turkeys, place in the thickest part of the inner thigh. "}, {"url": "http://dish.allrecipes.com/how-to-cook-a-turkey/", "passage_text": "From prepping and basting to roasting and carving, get all the tips you need to cook your bird. 1  Heat oven to 350 degrees F. 2  Roast turkey uncovered for 20 minutes per pound. 3  Cook to an internal temperature of 165 degrees measured at the thigh. 4  Let rest 20 minutes before carving. "}]