[{"url": "http://emedicine.medscape.com/article/303533-overview", "passage_text": "Peripheral cyanosis. 1  Peripheral cyanosis is a dusky or bluish tinge to the fingers and toes and may occur with or without central cyanosis (ie, with or without hypoxemia). 2  When unaccompanied by hypoxemia, as determined by blood gas analysis, peripheral cyanosis is caused by peripheral vasoconstriction. 1 Peripheral cyanosis is a dusky or bluish tinge to the fingers and toes and may occur with or without central cyanosis (ie, with or without hypoxemia). 2  When unaccompanied by hypoxemia, as determined by blood gas analysis, peripheral cyanosis is caused by peripheral vasoconstriction."}, {"url": "http://patient.info/doctor/Cyanosis", "passage_text": "Cyanosis is the abnormal blue discoloration of the skin and mucous membranes, caused by an increase in the deoxygenated haemoglobin level to above 5 g/dL. "}, {"url": "http://www.healthline.com/symptom/discoloration-of-skin", "passage_text": "Blue Skin Discoloration-Cyanosis. Cyanosis is a term used to describe a bluish tint to your skin, as well as your fingernails and fingertips. It is a condition caused by not having enough oxygen in your blood. In people with light skin, such as Caucasians, this is quite distinctive. Many of the health conditions that cause cyanosis are the result of abnormalities in the blood, lungs, or heart. Blood abnormalities may make it difficult for the blood to absorb oxygen. Lung abnormalities may be related to the following conditions: 1  a blood clot in the vessels of the lung (pulmonary embolism)."}, {"url": "http://www.healthgrades.com/symptoms/cyanosis", "passage_text": "Cyanosis is a bluish hue to the skin, gums, fingernails, or mucous membranes caused by a lack of oxygen in the blood. When blood is fully oxygenated it appears bright red; when it lacks oxygen supply, the blood is a dark purple or bluish red. This lack of oxygen in the blood supply to a body part, such as the nail bed, skin, or mucous membrane, causes that body part to take on a bluish tint. Oxygen is present in your blood through hemoglobin, a red blood cell protein that carries oxygen"}, {"url": "http://medical-dictionary.thefreedictionary.com/Cyanosis", "passage_text": "Cyanosis is a physical sign causing bluish discoloration of the skin and mucous membranes. Cyanosis is caused by a lack of oxygen in the blood. Cyanosis is associated with cold temperatures, heart failure, lung diseases, and smothering. cyanosis. a bluish discoloration of the skin and mucous membranes due to excessive concentration of reduced hemoglobin in the blood. adj., adj cyanot´ic. central cyanosis that due to arterial unsaturation, the aortic blood carrying reduced hemoglobin."}, {"url": "http://www.news-medical.net/health/Causes-of-cyanosis.aspx", "passage_text": "Causes of peripheral cyanosis include (1-5): 1  Central cyanosis and its causes are all associated with peripheral cyanosis. 2  Decreased pumping of blood by the heart or reduced cardiac output. 3  This is seen in heart failure or circulatory shock. 4  Diseases of circulation like thrombosis or embolism. 1 Central cyanosis and its causes are all associated with peripheral cyanosis. 2  Decreased pumping of blood by the heart or reduced cardiac output. 3  This is seen in heart failure or circulatory shock. 4  Diseases of circulation like thrombosis or embolism. 5  Constriction of blood vessels of the limbs, fingers and toes."}, {"url": "http://www.medicinenet.com/cyanosisturning_blue/symptoms.htm", "passage_text": "Cyanosis is the medical term for a bluish color of the skin and the mucous membranes due to an insufficient level of oxygen in the blood. For example, the lips and fingernails may show cyanosis. "}, {"url": "http://www.petmd.com/dog/conditions/cardiovascular/c_dg_cyanosis", "passage_text": "Cyanosis is a medical condition characterized by blue colored skin and mucous membranes, which occurs as the result of inadequate amounts of oxygenated hemoglobin -- the molecule which carries oxygen to the body tissues -- or due to hemoglobin abnormalities. "}, {"url": "http://www.news-medical.net/health/Causes-of-cyanosis.aspx", "passage_text": "Causes of cyanosis. Cyanosis refers to bluish discoloration of skin, nail beds and mucous membranes. Normally haemoglobin carries most of the oxygen in blood. This oxygen carrying capacity of haemoglobin in the blood (present in the arteries) is called oxygen saturation. 1 Central cyanosis and its causes are all associated with peripheral cyanosis. 2  Decreased pumping of blood by the heart or reduced cardiac output. 3  This is seen in heart failure or circulatory shock. 4  Diseases of circulation like thrombosis or embolism. 5  Constriction of blood vessels of the limbs, fingers and toes."}]