[{"url": "http://healthyeating.sfgate.com/much-sodium-should-one-during-single-day-4533.html", "passage_text": "The Institute of Medicine has established adequate intake levels for sodium that address the typical needs of a healthy population. The recommended adequate intake of sodium for adults up to age 50 is 1,500 milligrams daily. Adequate daily intake for older Americans is 1,300 milligrams from age 50 through 70 and 1,200 milligrams after age 70. These recommendations take into account typical losses and the amount of sodium you are likely to consume while meeting other essential nutrient requirements."}, {"url": "http://www.davita.com/kidney-disease/diet-and-nutrition/lifestyle/sodium,-the-heart-and-kidney-disease/e/6954", "passage_text": "Today, the average sodium intake in an American diet is about 3,400 mg a day — 30 to 50 percent more than the recommended amount. And if you have chronic kidney disease (CKD) and consume too much sodium, you are at greater risk for complications, including high blood pressure and heart disease. According to the 2010 guidelines, sodium should be limited to 2,300 mg a day. For people 51 years or older, African Americans and anyone who has hypertension, diabetes or CKD, the new sodium goal is 1,500 mg a day. About half of the United States’ population and the majority of adults fall into this category."}, {"url": "http://www.medicalnewstoday.com/articles/146677.php", "passage_text": "You should check the labels of foods to find out which ones are high and low in salt content. If the label has more than 1.5g of salt (or 0.6g of sodium) per 100g it is a high salt content food. If it has 0.3g of salt (0.1g of sodium) per 100g then it is a low salt content food. "}, {"url": "http://healthyeating.sfgate.com/much-sodium-supposed-per-day-5703.html", "passage_text": "Aim for 2,300 milligrams of sodium or less per day. Evidence shows that consuming too much sodium can raise blood pressure, which is a risk factor for stroke. High blood pressure can also lead to heart disease, kidney disease and congestive heart failure. Most Americans will benefit from a lower sodium diet. Look for foods that have fewer than 200 milligrams of sodium per serving. Look for low sodium on the food label; this means the food has fewer than 140 milligrams of sodium per serving. Eat more fresh foods that are naturally low in sodium."}, {"url": "http://www.livestrong.com/article/433036-how-many-milligrams-of-sodium-should-i-have-in-one-day/", "passage_text": "Amount. The recommended amount of sodium that you should consume in a day depends on your age. Children ages 2 to 3 need 1,000 mg of sodium a day. That amount increases to 1,200 mg a day from ages 4 to 8 and 1,500 mg from 9 to 18. Adults need 2,300 mg of sodium a day, which is equal to about a teaspoon of salt."}, {"url": "http://healthyeating.sfgate.com/much-sodium-should-one-during-single-day-4533.html", "passage_text": "Virtually all adults in the United States consume too much sodium, according to the Dietary Guidelines for Americans, 2010.. Although your body requires a small amount of dietary sodium daily to replace quantities lost through sweat, urine and stool, too much may adversely affect your health. Adequate daily intake for older Americans is 1,300 milligrams from age 50 through 70 and 1,200 milligrams after age 70. These recommendations take into account typical losses and the amount of sodium you are likely to consume while meeting other essential nutrient requirements."}, {"url": "http://www.liver.ca/liver-disease/having-liver-disease/healthy-living-guidelines/sodium-guidelines.aspx", "passage_text": "Most Canadians consume far more sodium than is needed. The recommended amount per day is between 1500 mg (considered adequate intake) and 2300 mg (upper amount) for people 9 -50 years of age. For people over 50 years of age, an adequate intake drops to 1300 mg per day until 70 and then 1200 mg over 70 years of age. However, the average daily intake in the Canadian diet is about 3500 mg of sodium, although many Canadians eat well in excess of 5000 mg per day. Can I get too much sodium? Yes."}, {"url": "http://www.fitday.com/fitness-articles/nutrition/healthy-eating/how-much-sodium-should-you-consume-per-day.html", "passage_text": "Setting Limits. The American Heart Association recommends limiting your sodium intake to less than 2,000 milligrams per day. And this may be easier said than done, due to the amount of sodium found in processed and canned foods. Frozen foods can even contain high amounts of sodium in an effort to keep them fresh longer. Sodium plays a huge role in leading a healthy, sensible lifestyle. If you do not consume enough sodium in your diet on a daily basis, your body cannot maintain healthy fluid levels, and it may have a negative impact on the way your muscles expand and contract, especially during exercise."}]