[{"url": "http://www.webmd.com/depression/news/20120110/low-levels-vitamin-d-may-be-linked-depression", "passage_text": "New research suggests that low levels of vitamin D and depression may go hand in hand. The new study included about 12,600 people aged 20 to 90. Researchers measured the vitamin D in their blood and assessed symptoms of depression."}, {"url": "http://www.livestrong.com/article/361614-vitamin-d-deficiency-with-depression-anxiety/", "passage_text": "Depression and anxiety disorders often occur together, according to the National Institute of Mental Health. Vitamin D deficiency may cause low moods and muscle weakness -- symptoms that may also stem from depression and anxiety. Since vitamin D helps regulate your blood pressure, consuming too little may increase your risk for high blood pressure -- a condition also associated with anxiety."}, {"url": "http://www.livestrong.com/article/361614-vitamin-d-deficiency-with-depression-anxiety/", "passage_text": "Vitamin D deficiency may also increase depression and anxiety associated with premenstrual syndrome, thyroid disease, anorexia, bulimia and obesity. Depression and anxiety may also contribute to a vitamin D deficiency if your illness hinders your appetite, eating habits and/or weight."}, {"url": "http://www.webmd.com/depression/news/20120110/low-levels-vitamin-d-may-be-linked-depression", "passage_text": "Vitamin D deficiency may result in depression, or depression may increase risk for low vitamin D levels. For example, depressed people may spend more time indoors, and are less likely to eat a healthy diet and take care of themselves, all of which could affect"}, {"url": "http://www.livestrong.com/article/361614-vitamin-d-deficiency-with-depression-anxiety/", "passage_text": "Vitamin D deficiency, anxiety and depression may go hand-in-hand. Vitamin D is a fat-soluble nutrient that contributes to bone health, immune function and muscle wellness. Most adults require approximately 600 international units, or IUs, of vitamin D daily, according to the Office of Dietary Supplements."}, {"url": "http://www.webmd.com/depression/news/20120627/vitamin-d-deficiency-linked-to-depression", "passage_text": "Whether low levels of vitamin D cause depression, worsen it, or are a symptom of the underlying depression is not fully understood. There is no solid proof that vitamin D deficiency causes depression , says researcher Sonal Pathak, MD. She is an endocrinologist at Bay Health Endocrinology in Dover, Del."}, {"url": "http://www.webmd.com/depression/news/20120627/vitamin-d-deficiency-linked-to-depression", "passage_text": "Vitamin D is called the sunshine vitamin because our bodies produce it when exposed to sunlight. Vitamin D is also added to milk and other foods, and is available in small amounts in fatty fish like tuna, salmon, and mackerel; beef liver, cheese, and egg yolks."}, {"url": "https://www.vitamindcouncil.org/health-conditions/depression/", "passage_text": "Research does seem to show a link between low levels of vitamin D in the blood and symptoms of depression. However, research hasn’t yet shown clearly whether low vitamin D levels cause depression, or whether low vitamin D levels develop because someone is depressed."}]