[{"url": "http://city.milwaukee.gov/vote", "passage_text": "This is referred to as the “close of registration” date. You may still register to vote at City Hall during the 20 days before an election or at your voting site on Election Day. 1. BY MAIL. Download and print the Voter Registration Application. The City of Milwaukee provides four (4) opportunities for completing and updating your voter registration: by mail, at any Milwaukee Public Library, at City Hall"}, {"url": "http://www.gab.wi.gov/voters/absentee", "passage_text": "I want to vote absentee. Under Wisconsin law, voters do not need a reason or excuse, such as being out of town on Election Day, to vote absentee. Any voter who prefers to vote by absentee ballot may request one. You have several options for requesting an absentee ballot and casting your vote. Regular Wisconsin voters may also request that a ballot be sent to them by sending an e-mail or fax to their municipal clerk. This request must be made no later than 5:00 p.m. on the Thursday before the election in order for an absentee ballot to be SENT to you."}, {"url": "http://www.wisconsinvote.org/", "passage_text": "Governor Scott Walker Suspends Presidential Campaign. Governor Scott Walker late Monday afternoon announced he was suspending his presidential campaign immediately. Walker made the announcement at a hotel near the state Capitol. Ahead of his remarks about that, he offered condolences to the family of Wisconsin Supreme Court Justice Patrick Crooks, 77, who died earlier in the day at the court. GAB Overhaul Expected To Be Introduced This Week. Republican leaders in the Legislature are expected to unveil a bill sometime this week that would overhaul the board charged with overseeing elections, ethics and lobbying laws in Wisconsin."}, {"url": "https://www.wisconsin.edu/voting/", "passage_text": "For a complete list of voter eligibility requirements, visit the G.A.B. Voter Eligibility Guide. Among the requirements for voter eligibility in Wisconsin, all voters must be U.S. citizens who will be at least 18 years old on Election Day and who will have resided in Wisconsin for at least 28 days prior to the election. For specific guidance on residency requirements for UW students, see I’m a College Student. 1 Deadlines: You can find important registration deadlines for each regularly scheduled election at G.A.B.’s Voter Registration Deadlines. 2  Proof of Residence: Note that all Wisconsin voters must provide proof of residence to register to vote."}, {"url": "http://www.ci.wausau.wi.us/Services/Elections.aspx", "passage_text": "City of Wausau electors who are unwilling or unable to vote at their polling location may vote absentee in the Office of the City Clerk located at 407 Grant Street starting approximately 2 weeks prior to Election Day and ending the Friday prior to Election Day. In person absentee voting is available in the office of the City Clerk up to and including the Friday prior to Election Day during office hours (8:00 am-4:30 pm). For More Information and Election Night Results visit the web site of the Marathon County Clerk."}, {"url": "http://www.ci.wausau.wi.us/Services/Elections.aspx", "passage_text": "To find your sample ballot, go to https://myvote.wi.gov. Go to Regular Voter.. Type in your name and birthdate and click Search. Then double click on your name. There is a list of options on the left side of the screen. In person absentee voting is available in the office of the City Clerk up to and including the Friday prior to Election Day during office hours (8:00 am-4:30 pm). For More Information and Election Night Results visit the web site of the Marathon County Clerk."}, {"url": "http://city.milwaukee.gov/vote", "passage_text": "You may register to vote at the office of the Election Commission, Room 501, City Hall, 200 East Wells. Office hours are Monday through Friday, from 8:00 a.m. until 4:45 p.m. 4. REGISTER AT YOUR VOTING SITE ON ELECTION DAY. You may register and vote at your voting site on any Election Day. The City of Milwaukee provides four (4) opportunities for completing and updating your voter registration: by mail, at any Milwaukee Public Library, at City Hall or at your voting site on"}, {"url": "http://www.wisconsinvote.org/", "passage_text": "The ACLU will take on the state's voter ID law in federal court Monday — this time not challenging the constitutionality of the law itself, but rather asking a judge to expand the types of ID that can be used at the polls. GAB Overhaul Expected To Be Introduced This Week. Republican leaders in the Legislature are expected to unveil a bill sometime this week that would overhaul the board charged with overseeing elections, ethics and lobbying laws in Wisconsin."}, {"url": "http://city.milwaukee.gov/vote", "passage_text": "Therefore, you must complete a voter registration application if you are a new Wisconsin voter, your name and/or residential address has changed since you last registered to vote, or if you have not voted in the past four (4) years. The City of Milwaukee provides four (4) opportunities for completing and updating your voter registration: by mail, at any Milwaukee Public Library, at City Hall or at your voting site on Election Day."}]