[{"url": "http://grammar.about.com/od/ab/g/apposterm.htm", "passage_text": "Definition. An appositive is a noun, noun phrase, or series of nouns placed next to another word or phrase to identify or rename it. Nonrestrictive appositives are usually set off by commas, parentheses, or dashes. An appositive may be introduced by a word or phrase such as namely, for example, or that is"}, {"url": "http://grammar.about.com/od/grammarfaq/f/faqappositive.htm", "passage_text": "Answer: An appositive --a noun or noun phrase that identifies or renames another noun--is a handy way of adding details to a sentence. The term comes from the Latin word for placing close by, and an appositive usually appears right after the word or phrase that it renames. "}, {"url": "http://www.chompchomp.com/terms/appositive.pdf", "passage_text": "An appositive is a noun or noun phrase that renames another noun right beside it. The appositive can be a short or long combination of words. Look at these examples: The insect, a cockroach, is crawling across the kitchen table. "}, {"url": "http://www.grammar-monster.com/glossary/appositive_apposition.htm", "passage_text": "Search. An appositive is a noun, a noun phrase, or a noun clause which sits next to another noun to rename it or to describe it in another way. (The word appositive comes from the Latin for to put near .). Appositives are usually offset with commas, brackets, or dashes. Here are some examples of appositives: An appositive can be a noun, a noun phrase, or a noun clause. For example: Quite often, appositives are introduced with terms like namely, i.e. , that is, and in other words."}, {"url": "http://www.englishgrammar.org/appositive/", "passage_text": "The label appositive refers to a noun phrase which immediately follows another noun phrase of identical reference. An appositive is usually non-restrictive which means that it only gives additional information about the first noun phrase whose reference in quite clear. "}, {"url": "http://www.k12reader.com/term/appositive-phrase/", "passage_text": "An appositive is a noun or pronoun that renames or identifies another noun or pronoun in some way. An appositive phrase consists of an appositive and its modifiers. Appositives can be either essential (restrictive) or nonessential (nonrestrictive). An essential appositive provides information that is necessary for identifying the noun or pronoun that precedes it. "}, {"url": "http://www.chompchomp.com/terms/appositive.htm", "passage_text": "Recognize an appositive when you see one. An appositive is a noun or noun phrase that renames another noun right beside it. The appositive can be a short or long combination of words. Look at these examples: The insect, a cockroach, is crawling across the kitchen table. The insect, a large cockroach, is crawling across the kitchen table. "}, {"url": "http://www.buzzle.com/articles/appositive-phrase.html", "passage_text": "The definition of an appositive phrase is a noun or noun phrase that renames, modifies, or amplifies another noun besides it. This phrase can be short or long. It always appears after the word it identifies or explains. It is always a noun phrase or pronoun phrase. "}]