[{"url": "http://www.answers.com/Q/What_does_tcb_stand_for", "passage_text": "Takin' Care of Business. abbreviation for Taking Care of Business. The phrase or, rather abbreviation was used by artists as diverse as Elvis Presley, Aretha Franklin, and the Bachmann-Turner Overdrive."}, {"url": "http://memphis.about.com/od/elvis/f/Elvistcb.htm", "passage_text": "Answer: The initials T.C.B. stand for Taking Care of Business, which is what Elvis Presley called his band. He incorporated the letters into an emblem flanked by lightning bolts. This emblem was used in several pieces of Elvis' custom jewelry including his famous T.C.B. ring and necklace."}, {"url": "https://answers.yahoo.com/question/index?qid=20100103154617AAvmSed", "passage_text": "Best Answer: TCB is an abbreviation that was commonly used in the 1960s and 1970s, meaning Taking Care (of) Business, and it was particularly widely used in African-American culture. Source(s): wikipedia.com. Beatles '64 · 6 years ago. Thumbs up."}, {"url": "https://answers.yahoo.com/question/index?qid=20100103154617AAvmSed", "passage_text": "Rating Newest Oldest. Best Answer: TCB is an abbreviation that was commonly used in the 1960s and 1970s, meaning Taking Care (of) Business, and it was particularly widely used in African-American culture. Source(s): wikipedia.com. Beatles '64 · 6 years ago. Thumbs up."}, {"url": "http://www.abbreviations.com/TCB", "passage_text": "TCB. [IBM] 1. Trouble Came Back. An intermittent or difficult-to-reproduce problem that has failed to respond to neglect or shotgun debugging. Compare heisenbug. Not to be confused with: 2. Trusted Computing Base, an ‘official’ jargon term from the Orange Book."}, {"url": "http://www.answers.com/Q/What_does_tcb_stand_for", "passage_text": "Taking Care of Business Crealkiller Says: the lyrics on a website i found says its this: Chorus: R-E-S-P-E-C-T Find out what it means to me R-E-S-P-E-C-T Take care, TC … B so i doubt TCB is taking care of business it wouldn't make sense to take care, taking care of business. 1 person found this useful."}]