[{"url": "https://www.healthtap.com/topics/how-long-for-ankle-fracture-to-heal", "passage_text": "10. Get help from a doctor now ›. 6- 8 weeks: Typically an ankle fracture will take 6 - 8 weeks to heal. It depends how badly it was broken, if it is displaced, if it needs surgery, if there are other complicating factors to consider related to your health. ...Read more."}, {"url": "https://www.nlm.nih.gov/medlineplus/ency/patientinstructions/000548.htm", "passage_text": "Without surgery, your ankle will be placed in a cast or splint for 4 to 8 weeks. 1  The length of time you must wear a cast or splint depends on the type of fracture you have. 2  Your cast or splint may be changed more than once, as your swelling goes down."}, {"url": "http://www.webmd.com/a-to-z-guides/ankle-sprain-home-treatment", "passage_text": "Home Treatment. Ankle sprains take an average of 6 weeks to heal but can take can up to 4 months, depending on the severity. An ankle brace, air stirrup, hiking boots, or other form of ankle support should be worn during this time to protect the ligaments."}, {"url": "http://abcnews.go.com/Health/MensHealthQuestions/story?id=7931646", "passage_text": "Answer: Well, when considering how long it might take for a sprain to heal, you need to consider that there are varying degrees of sprain injuries. There's a grade one, where the ligament that holds the joint in place is stretched."}, {"url": "https://www.sharecare.com/health/sprains-strains-minor-pains/how-long-recover-sprained-ankle", "passage_text": "Grade two sprains can take 4 to 6 weeks to heal. This involves partial tearing of the ligaments. Signs of a grade two sprain include instability, moderate to severe pain, swelling, stiffness and possible bruising. Grade three sprains can take 8 to 12 weeks to heal. This is a complete tear of the ligament. With grade three sprains, there is a lot of instability within the joint, severe pain when the injury occurs and no pain after injury, severe swelling and excessiv"}, {"url": "http://www.webmd.com/a-to-z-guides/ankle-sprain-overview", "passage_text": "In more severe sprains, you may hear and/or feel something tear, along with a pop or snap. You will probably have extreme pain at first and will not be able to walk or even put weight on your foot. Usually, the more pain and swelling you have, the more severe your ankle sprain is and the longer it will take to heal."}]