[{"url": "http://www.answers.com/Q/Who_is_the_presiding_officer_of_the_US_Senate", "passage_text": "The Vice President of the United States is the President of the Senate. Next in order is the President pro tempore, who is generally the oldest or longest sitting majority mem … ber of the Senate. Since January 2009 Vice President Joe Biden leads the Senate. The day to day administration is actually delegated to the President Pro Tempore (at this time Daniel Inoye who is bestowed the duty because he is the longest serving Democratic member of the Senate)."}, {"url": "http://www.answers.com/Q/Who_is_the_presiding_officer_of_the_US_Senate", "passage_text": "Joe Biden is the President pro-tempore, the Vice President, and the presiding officer for the senate. He's really more of a figurehead-he only acts if the President were to d … ie, in which case he would take over, or if Senate needed a tie-breaking vote (then he may act as that vote). 1 person found this useful. The day to day administration is actually delegated to the President Pro Tempore (at this time Daniel Inoye who is bestowed the duty because he is the longest serving Democratic member of the Senate)."}, {"url": "https://en.wikipedia.org/wiki/List_of_the_Presidents_of_the_United_States_Senate", "passage_text": "List of Senate Presidents [edit]. This list includes Vice Presidents and Presidents pro tempore who served as a Presiding Officer of the Senate (not including senators who presided over sessions temporarily in the place of the sitting President). However, during a vacancy in the office (such as that caused by death, resignation or presidential succession), the President pro tempore of the United States Senate serves as the permanent President of the Senate."}, {"url": "https://en.wikipedia.org/wiki/Presiding_Officer_of_the_United_States_Senate", "passage_text": "The Presiding Officer is the person who presides over the United States Senate and is charged with maintaining order and decorum, recognizing members to speak, and interpreting the Senate's rules, practices and precedents. The Presiding Officer is a role, not an actual office; whoever is presiding at the time is the Presiding Officer."}, {"url": "http://apps.lis.virginia.gov/sfb1/Senate/Leadership.aspx", "passage_text": "The Lieutenant Governor is the presiding officer of the Senate and is elected in a statewide election for a four-year term. Inaugurated on January 11, 2014, Ralph S. Northam serves as Lieutenant Governor of Virginia. In the event of his absence, the President pro tempore carries out the duties of the presiding officer. "}, {"url": "https://en.wikipedia.org/wiki/Presiding_Officer_of_the_United_States_Senate", "passage_text": "More typically, junior senators of the majority party designated by the President pro tempore preside over the chamber. An exception to this pattern is when the Senate hears the impeachment trials of the President of the United States, in which the Chief Justice of the United States is the presiding officer. The Presiding Officer is a role, not an actual office; whoever is presiding at the time is the Presiding Officer."}, {"url": "http://www.house.mo.gov/content.aspx?info=/info/howbill.htm", "passage_text": "The Lieutenant Governor is president and presiding officer of the Senate. In his absence, the President Pro Tem, who is elected by the Senate members, presides. The House of Representatives consists of 163 members, elected at each general election for two-year terms. "}, {"url": "http://www.answers.com/Q/Who_is_the_presiding_officer_of_the_Senate", "passage_text": "In Government. The presiding officer of the Senate is called the President  Pro-Tempore. He keeps order and decorum in the Senate, he appoints  Senate officers, and he rules on contested i … ssues. His power is  more limited than his counterpart in the House. Answered. The presiding officer of state senates is the Lieutenant Governor.  The President Pro Tempore of the Senate presides in the absences of  the Lieutenant Governor."}, {"url": "https://en.wikipedia.org/wiki/Presiding_Officer_of_the_United_States_Senate", "passage_text": "The presiding officer is usually addressed as Mr. President or Madame President.. One exception is during impeachment trials of the president; the Chief Justice was referred to as Mr. Chief Justice both in 1868 and in 1999 while presiding over the Senate. The Presiding Officer is a role, not an actual office; whoever is presiding at the time is the Presiding Officer."}]