[{"url": "http://rationalwiki.org/wiki/Rationalization", "passage_text": "[edit] Sociology. Rationalization in sociology refers to the favoring of efficiency through quantification and calculation in social transactions over, for example, tradition or custom. It is usually tied into bureaucracy and the process of bureaucratization. Rationalization is considered to be central to the concept of modernity. Rationalization in psychology is often understood to mean making excuses, or post hoc explanations, for some action. Lying could be considered a conscious form of rationalization. Rationalization may also occur at the unconscious level, commonly known as self-deception."}, {"url": "http://study.com/academy/lesson/rationalization-of-society-definition-examples-quiz.html", "passage_text": "Rationalization of Society. The rationalization of society is a concept that was created by Max Weber. Rationalization refers to the process by which modern society has increasingly become concerned with: 1  Efficiency: achieving the maximum results with a minimum amount of effort. 2  Predictability: a desire to predict what will happen in the future. 3  Calculability: a concern with numerical data, i.e., statistics and scoring."}, {"url": "http://www.sociologyguide.com/socio-short-notes/rationalization-max-weber.php", "passage_text": "Rationalization-Max Weber. Max Weber adhered to the method of rationalization in sociological work. It is a product of the scientific specialization and technical differentiation peculiar to western culture and Weber sometimes associated to it with the notion of intellectualization. "}, {"url": "https://en.wikipedia.org/wiki/Rationalization_%28sociology%29", "passage_text": "For other uses, see Rationalization. In sociology, rationalisation or rationalization refers to the replacement of traditions, values, and emotions as motivators for behavior in society with rational, calculated ones. For Zygmunt Bauman, rationalization as a manifestation of modernity may be closely associated with the events of the Holocaust. In Modernity and Ambivalence, Bauman attempted to give an account of the different approaches modern society adopts toward the stranger."}, {"url": "http://www.sociologyindex.com/rationalization.htm", "passage_text": "Max Weber's works deal with rationalization in sociology of religion, government, organizational theory, and behavior. The process of rationalization affects economic life, law, administration, and religion. Within symbolic interactionism, rationalization is used more in the everyday sense of the word to refer to providing justifications or excuses for one's actions. The term 'rationalization' has two specific meanings in sociology:"}, {"url": "http://www.sociologyindex.com/rationalization.htm", "passage_text": "(1) The concept 'rationalization' was developed by German sociologist Max Weber (1864-1920) who used it in two ways. First, rationalization was the process through which magic, supernatural and religious ideas lose cultural importance in a society and ideas based on science and practical calculation become dominant. Within symbolic interactionism, rationalization is used more in the everyday sense of the word to refer to providing justifications or excuses for one's actions. The term 'rationalization' has two specific meanings in sociology:"}, {"url": "http://www.sociologyguide.com/socio-short-notes/rationalization.php", "passage_text": "Rationalization is a process whereby thought and action rooted in emotion; superstition and respect for mysterious forces, and tradition are replaced by value-rational thought and action. Value-rational thought and action involve striving to find the most efficient way to achieve a valued goal or result. "}, {"url": "http://rationalwiki.org/wiki/Rationalization", "passage_text": "Rationalization is a term of art in both psychology and sociology, though the term is most popularly used in the psychological sense. Rationalization in psychology is often understood to mean making excuses, or post hoc explanations, for some action. Lying could be considered a conscious form of rationalization. Rationalization may also occur at the unconscious level, commonly known as self-deception."}, {"url": "http://www.encyclopedia69.com/eng/d/rationalization/rationalization.htm", "passage_text": "In its second usage in sociology, rationalization refers to the organization of social and economic life according to principles of efficiency on the basis of technical knowledge. It was a concept first used by Max Weber in his analysis of modern capitalism. "}]