[{"url": "http://www.yourpurebredpuppy.com/health/westhighlandwhiteterriers.html", "passage_text": "White shaker dog syndrome is a neuromuscular disease that can occur in Westies. Pulmonary fibrosis occurs more often in Westies than in any other breed, appearing around 9 years old. It's a progressive lung disease where the lungs become chronically inflamed. Prognosis is poor. "}, {"url": "http://www.westielungdisease.co.uk/info/", "passage_text": "The classic early symptom of Westie Lung Disease is the sound of crackling in the lungs when your Westie breathes. This is the noise the “stiff” scarred tissue makes as it tries to expand and contract. As time progresses, more towards the latter stages of Westie Lung Disease, your Westie may well display a lot of the following symptoms: 1  The neck is elongated to get more air into the lungs. 2  A lack of desire to run or even walk quickly. 3  An increased obsession with sniffing on walks."}, {"url": "http://www.westielungdisease.co.uk/info/", "passage_text": "Symptoms. The classic early symptom of Westie Lung Disease is the sound of crackling in the lungs when your Westie breathes. This is the noise the “stiff” scarred tissue makes as it tries to expand and contract. It is very faint and can only be heard by putting your ear very close to your dog’s mouth in a quiet room. As time progresses, more towards the latter stages of Westie Lung Disease, your Westie may well display a lot of the following symptoms: 1  The neck is elongated to get more air into the lungs. 2  A lack of desire to run or even walk quickly. 3  An increased obsession with sniffing on walks."}, {"url": "http://www.westielungdisease.co.uk/info/", "passage_text": "Idiopathic Pulmonary Fibrosis otherwise known as Westie Lung Disease, to put in simple terms, is a disease which slowly over a period of 12 – 18 months increasingly prevents the lungs from functioning as they should, restricting their movement and therefore their ability to absorb oxygen into the body. As time progresses, more towards the latter stages of Westie Lung Disease, your Westie may well display a lot of the following symptoms: 1  The neck is elongated to get more air into the lungs. 2  A lack of desire to run or even walk quickly. 3  An increased obsession with sniffing on walks."}, {"url": "http://westierescue.com/article.asp?ArticleID=26", "passage_text": "When Westie Lung Disease or any other respiratory problem is advanced, treatment with a nebulizer can help your pet breath in times of distress. The dog is put in its crate and the door and holes are covered with a cloth or towel. The nebulizer pumps in medication through tubing. The condition is more accurately described as Pulmonary Fibrosis; a condition in which scar tissue forms in the connective tissue that supports the tiny air sacs (alveoli) in the lungs. Scarring can be a reaction to a large number of diseases and conditions that lead to inflammation of lung tissue."}, {"url": "http://www.terrierclub.com/Pet_Care/390.htm", "passage_text": "Re: westie lung disease I've had one foster with Westie Lung Disease a few years ago (12 yr old male-retired breeder) and currently have one that has been with me for a year now with, as our vet says, the beginning stages of WLD.Do you hear a cackle when your westie is breathing? I'm not an expert but the cackle is a sure sign."}, {"url": "http://www.dogtopics.com/169/westies-join-fight-against-fatal-lung-disease/", "passage_text": "West Highland White Terriers (Westies) are prone to a disease that is remarkably similar to IPF. The symptoms in Westie’s are a shortness of breath and excessive panting, and the disease is usually fatal within eighteen months of diagnosis. Pulmonary fibrosis tends to affects Westie’s when they are 7 to 9 years old; this is equivalent to 40 – 60 human years and is when IPF typically shows itself in humans. "}, {"url": "http://www.express.co.uk/life-style/health/389603/Pets-health-Can-Westie-be-saved-from-lung-disease", "passage_text": "The replacement of lung tissue with fibrous tissue is seen most often in West Highland whites. A This disease is called idiopathic pulmonary fibrosis. The lung tissue is gradually replaced by fibrous tissue similar to that seen in scarring. This results in the lung being unable to absorb oxygen, producing typical signs of a decrease in exercise tolerance, panting and later a persistent cough which is particularly evident when exercising. The reason for the replacement of lung tissue with fibrous tissue is unknown, which is why this is called idiopathic. The problem is seen most often in West Highland whites and is frequently diagnosed at around nine years of age."}, {"url": "http://www.westylungdisease.com/", "passage_text": "Westy/Westie Lung Disease is also known as Idiopathic Pulmonary Fibrosis. This website is about the life of Scamps, a 12 yr old little fella who lives in Sunderland North East England with Ian and Litsa and until 3 weeks ago was a healthy perfect guy with years ahead of him. A few days ago he was diagnosed with Westie Lung. This website is designed to log his time, the disease, and to try and help others in the future who have been given the same heart breaking news understand what is happening and what medications, treatments or help is available."}]