[{"url": "http://psychcentral.com/blog/archives/2014/02/25/how-stress-affects-mental-health/", "passage_text": "Chronic Stress. Chronic stress increases the risk of developing health problems including obesity, diabetes, heart disease, cancer, and a weakened immune system. Chronic stress also affects a person’s mental health. Many studies show a correlation between stress and the development of mood disorders such as anxiety disorders and depression. The body’s stress response was not made to be continuously engaged. Many people encounter stress from multiple sources, including work; money, health, and relationship worries; and media overload. With so many sources of stress, it is difficult to find time to relax and disengage."}, {"url": "http://www.cancer.gov/about-cancer/coping/feelings/stress-fact-sheet", "passage_text": "However, there is no evidence that successful management of psychological stress improves cancer survival. Evidence from experimental studies does suggest that psychological stress can affect a tumor’s ability to grow and spread. In contrast, people who are able to use effective coping strategies to deal with stress, such as relaxation and stress management techniques, have been shown to have lower levels of depression, anxiety, and symptoms related to the cancer and its treatment."}, {"url": "http://www.webmd.com/balance/stress-management/effects-of-stress-on-your-body", "passage_text": "The body reacts to these changes with physical, mental, and emotional responses. Stress is a normal part of life. Many events that happen to you and around you -- and many things that you do yourself -- put stress on your body. You can experience stress from your environment, your body, and your thoughts. Unfortunately, instead of relieving the stress and returning the body to a relaxed state, these substances tend to keep the body in a stressed state and cause more problems. Consider the following: 1  Forty-three percent of all adults suffer adverse health effects from stress."}, {"url": "http://www.webmd.com/balance/stress-management/effects-of-stress-on-your-body", "passage_text": "1 Stress can play a part in problems such as headaches, high blood pressure, heart problems, diabetes, skin conditions, asthma, arthritis, depression, and anxiety. 2  The Occupational Safety and Health Administration (OSHA) declared stress a hazard of the workplace. Unfortunately, instead of relieving the stress and returning the body to a relaxed state, these substances tend to keep the body in a stressed state and cause more problems. Consider the following: 1  Forty-three percent of all adults suffer adverse health effects from stress."}, {"url": "http://psychcentral.com/blog/archives/2014/02/25/how-stress-affects-mental-health/", "passage_text": "When someone is under chronic stress, it begins to negatively affect his or her physical and mental health. The body’s stress response was not made to be continuously engaged. Many people encounter stress from multiple sources, including work; money, health, and relationship worries; and media overload. With so many sources of stress, it is difficult to find time to relax and disengage."}, {"url": "http://www.calmclinic.com/anxiety/symptoms/behavior", "passage_text": "Anxiety is the faulty activation of your fight or flight system at times when there is no fear causing stimuli present. When anxiety hits, it automatically changes behaviors in the sense that it prepares your body to fight or run away by increasing your heart rate, causing sweating, etc. Compulsions. The strangest behaviors caused by anxiety are most likely compulsions. Compulsions affect those with obsessive compulsive disorder, and they're behaviors that a person does compulsively to rid themselves of their negative, anxiety producing thoughts."}, {"url": "http://www.stressaffect.com/psychological-effects-of-stress.html", "passage_text": "Learn how to manage your stress easily, using hypnosis... People under severe stress can behave in ways that just don’t make sense--unless you understand that they are completely distracted, and unable to think clearly. While the physical effects of stress can be devastating, make sure you don’t ignore the psychological effects of stress. When you are under duress, you can make poor decisions, argue with peers, and even jeopardize your job or important relationships."}, {"url": "http://www.cancer.gov/about-cancer/coping/feelings/stress-fact-sheet", "passage_text": "Stress can be caused both by daily responsibilities and routine events, as well as by more unusual events, such as a trauma or illness in oneself or a close family member. When people feel that they are unable to manage or control changes caused by cancer or normal life activities, they are in distress. In contrast, people who are able to use effective coping strategies to deal with stress, such as relaxation and stress management techniques, have been shown to have lower levels of depression, anxiety, and symptoms related to the cancer and its treatment."}, {"url": "http://www.apa.org/helpcenter/understanding-chronic-stress.aspx", "passage_text": "Stress is often described as a feeling of being overwhelmed, worried or run-down. Stress can affect people of all ages, genders and circumstances and can lead to both physical and psychological health issues. By definition, stress is any uncomfortable emotional experience accompanied by predictable biochemical, physiological and behavioral changes. 1 Some stress can be beneficial at times, producing a boost that provides the drive and energy to help people get through situations like exams or work deadlines."}]