[{"url": "http://www.turkeyandturkeyhunting.com/turkey-scratchings/brian-lovett-blog/turkeys-365-all-about-turkey-beards", "passage_text": "The beard is a collection of filaments, or bristles, protruding from the breast of a male turkey, just below his chest. It begins growing when a bird is about 5 months old and continues to grow throughout his life, typically 4 or 5 inches per year. Spring jakes usually have 3- to 4-inch beards, though some early-hatched birds sport 5-inch beards. When a gobbler reaches 2, his beard is usually 8 to 10 inches. A beard gets its black color from melanin, a pigment that colors and strengthens feathers. Therefore, most 3-year-old and older gobblers have “only” 9- to 10-inch beards. Further, their tips will be mostly black because the original amber filaments have broken off. Some hens — maybe one in 20, depending on the location — also grow beards. Typically, hen beards are thin and measure 6 to 8 inches."}, {"url": "http://guidedturkeyhunting.com/turkey-info/turkey-beard-anyway/", "passage_text": "Published January 18, 2013 | By Larry Stephens. The beard of a turkey is a curious oddity. Actually, it is not a beard or hair at all. It is a modified feather that forms kind of a stiff bristle. Since the cluster of bristles resembles a beard of sorts, people began referring to it as a beard. By the next spring he will be a 2 year old and sport a beard up to 9-10″. Beards over 10″ are typically found on birds of 3 years or older though few toms will grow a beard longer than 11-11 1/2″. A Wide Eastern (left), Thin Osceola (right). 1  Non-Typical Turkeys!"}, {"url": "http://guidedturkeyhunting.com/turkey-info/turkey-beard-anyway/", "passage_text": "He is referred to as a “jake” and his beard length will vary from barely visible to a maximum of about 4-5 inches long. By the next spring he will be a 2 year old and sport a beard up to 9-10″. Beards over 10″ are typically found on birds of 3 years or older though few toms will grow a beard longer than 11-11 1/2″. A Wide Eastern (left), Thin Osceola (right). 1  Non-Typical Turkeys!"}, {"url": "https://www.biggamelogic.com/ArticlesNews/tabid/136/articleType/ArticleView/articleId/438/Aging-A-Wild-Turkey.aspx", "passage_text": "Measuring beards is another way to age a gobbler. A two year old tom will have a 5 to 7 inch beard. A three year old turkey’s beard typically measure eight inches plus. Again, the math gets fuzzy from this point as well. The beard of a wild turkey continues to grow throughout life. "}, {"url": "http://www.huntingnet.com/forum/turkey-hunting/29857-how-fast-does-turkey-s-beard-grow.html", "passage_text": "Posts: 889. RE: how fast does a turkey' s beard grow? Maytom is right about the spurs tellin the age. a jake will have 1/2 or less spur length. a 2 year ole tom will have spurs up to one inch long. spurs longer than an inch, will be at least a 3 year old turkey. my personal belief is a tom with 1 1/8 spurs is a 3 year old. RE: how fast does a turkey' s beard grow? Totoe and Don are right on about the beards. Spurs are a better  age teller, but when they hit the 1 mark and a little beyond, it' s a toss up about the bird being a 3-4-5 year old!! Depending on which state you hunt, some spur length' s grow longer per age group."}, {"url": "https://www.biggamelogic.com/ArticlesNews/tabid/136/articleType/ArticleView/articleId/437/Scoring-A-Wild-Turkey.aspx", "passage_text": "That scores this gobbler at 65.25. In my book, that is a dandy bird that anyone would be proud of. Here’s where this math can ruin the fun. Our gorgeous example bird is a long way from the record eastern wild turkey. This Kentucky bird scored 104.81 with over 2” spurs, 13 ¾” beard, and a weight of over 33 ½ pounds. If you hunt in Missouri, the state record was scored at 94."}, {"url": "http://guidedturkeyhunting.com/turkey-info/turkey-beard-anyway/", "passage_text": "Another oddity among turkeys is the phenomena where a Hen will actually develop a beard. This is also fairly rare but can be found in up to 20% of the Hens in some populations. I have found it to be more rare than that in my travels. By the next spring he will be a 2 year old and sport a beard up to 9-10″. Beards over 10″ are typically found on birds of 3 years or older though few toms will grow a beard longer than 11-11 1/2″. A Wide Eastern (left), Thin Osceola (right). 1  Non-Typical Turkeys!"}, {"url": "http://www.turkeyandturkeyhunting.com/turkey-scratchings/brian-lovett-blog/turkeys-365-all-about-turkey-beards", "passage_text": "If you hold the beard of a 2-year-old gobbler under light, you’ll see the tips are mostly amber. When a gobbler is 3, his beard will have grown about 14 inches. However, few toms have beards that long because the bristles wear off at the tip at about the same rate as the beard grows. Therefore, most 3-year-old and older gobblers have “only” 9- to 10-inch beards. Further, their tips will be mostly black because the original amber filaments have broken off. Some hens — maybe one in 20, depending on the location — also grow beards. Typically, hen beards are thin and measure 6 to 8 inches."}, {"url": "http://wildturkeyzone.com/articles/aging3.htm", "passage_text": "Knowing this, you can be fairly certain a gobbler with a beard of less than 5 is a one year old bird.There are still exceptions to this though since mature gobblers can lose most or all of the beard to various causes. 1 Swampy area birds (Osceola) generally have longer beards and spurs than rocky area birds (Merriam's). 2  Leg Length -- If the legs are longer (like on an Osceola) the beard will grow longer before it starts to wear at the end."}]