[{"url": "http://www.healthgrades.com/symptoms/urine-odor", "passage_text": "Healthy urine may have a mild smell but generally does not have a foul odor. In some cases, an unusual or strong urine odor may be due to benign conditions that are not harmful, such as eating certain foods or taking certain medications."}, {"url": "http://www.answers.com/Q/What_does_foul-smelling_urine_mean", "passage_text": "Urethritis (inflammation of the urethra) is also a cause for foul and sulfur smelling urine. You really should go to a doctor. He/She will most likely prescribe Doxycycline or Zirythromax."}, {"url": "http://www.healthgrades.com/symptoms/urine-odor", "passage_text": "When urine persistently smells bad or has a foul, strong or unusual odor, it may be caused by an underlying disease, disorder or condition. Urine odor can be a symptom of a variety of conditions, including infection, inflammation, or other conditions of the urinary tract (kidneys, ureters, bladder and urethra)."}, {"url": "http://snippets.com/what-does-it-mean-if-there-is-bad-smelling-urine-from-a-male.htm", "passage_text": "you voted. Answer by kd97 (733). Foul smelling urine or discharge could be the symptom of an STD, or it could be from a UTI (urinary tract infection) Medications taken daily can also cause a bad smell. Odor when urinating can also be from a kidney infection, or a bladder infection."}, {"url": "http://www.medicinenet.com/urine_odor/symptoms.htm", "passage_text": "Normal urine is clear and has a straw-yellow color. While the odor of urine can vary somewhat, in most cases, it does not have a strong smell. With dehydration, the urine is more concentrated and may have a stronger ammonia scent than normal."}, {"url": "http://www.medicinenet.com/urine_odor/symptoms.htm", "passage_text": "The presence of bacteria in the urine, such as with a urinary tract infection (UTI), can affect the appearance and smell of urine. When there is an infection in the urinary tract, the urine may take on a foul-smelling odor as well as appear cloudy or bloody."}, {"url": "http://snippets.com/what-does-it-mean-if-there-is-bad-smelling-urine-from-a-male.htm", "passage_text": "Foul smelling urine or discharge could be the symptom of an STD, or it could be from a UTI (urinary tract infection) Medications taken daily can also cause a bad smell."}, {"url": "http://www.goaskalice.columbia.edu/answered-questions/why-does-my-urine-stink", "passage_text": "Dear Reader, Normally, urine doesn't have much of a smell to it. If you're dehydrated and your urine becomes overly concentrated, it can have a stronger-than-usual scent. Vitamins and certain foods (asparagus, for example) can give urine an unusual smell. Infection can cause the urine to smell unpleasant."}, {"url": "http://www.nhs.uk/conditions/smelly-urine/Pages/Introduction.aspx", "passage_text": "See your GP if: 1  You have symptoms of a urinary tract infection (UTI) , such as pain or a burning sensation when urinating and a need to urinate often. 2  This is the most likely cause of unexplained foul-smelling urine."}]