[{"url": "https://en.wikipedia.org/wiki/Inhaler", "passage_text": "A metered-dose inhaler (MDI). An inhaler (or puffer) is a medical device used for delivering medication into the body via the lungs. It is mainly used in the treatment of asthma and Chronic Obstructive Pulmonary Disease (COPD). Zanamivir (Relenza) , used to treat influenza, must be administered via inhaler"}, {"url": "http://www.coughdoc.com/index.cfm?asset_id=1439", "passage_text": "1 These inhalers are almost always in blue containers. 2  Examples are salbutamol (trade names-Ventolin, Salamol, Airomir) and terbutaline (trade name – Bricanyl). 3  Younger infants are sometimes given ipratropium bromide (trade name – Atrovent, which comes in a grey/white container with a green cap). 1 Examples are salmeterol (trade name – Serevent) and formoterol (trade name-Oxis). 2  They come in green or blue/green containers. 3  Salmeterol can be used via a spacer device or as a powder (in an accuhaler), but formoterol is only in powder form (in a turbohaler)."}, {"url": "http://patient.info/health/inhalers-for-copd-including-inhaled-steroids", "passage_text": "An inhaler is a device holding a medicine that you take by breathing in (inhaling). Inhalers are often used to treat chronic obstructive pulmonary disease (COPD). There are many different types of inhaler, which can be confusing. Steroid inhalers are only used in combination with a long-acting beta-agonist inhaler (this can be with two separate inhalers or with a single inhaler containing two medicines).The main inhaled steroid medications are: 1  Beclometasone. 2  Budesonide. 3  Ciclesonide. 4  Fluticasone. 5  Mometasone."}, {"url": "https://www.dred.com/uk/asthma-inhalers.html", "passage_text": "Long-Acting Asthma Inhalers – Bronchodilator Drugs. These are less common and come in a different colour, as they're usually green inhalers. They also belong to the class of bronchodilators and they are effective for up to 12 hours. Salmeterol is one of the most common long-acting bronchodilators, along with Formoterol. Blue Inhalers – Bronchodilator Drugs. This is the most common group of inhalers (also called reliever inhalers) which contain bronchodilator drugs (usually salbutamol). Bronchodilator simply means that the drug allows the airways in your lungs to dilate and let more air in."}, {"url": "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC2930224/", "passage_text": "Salbutamol in some countries comes in white inhalers with a blue cap. The colour coding of caps is never reliable as patients can easily change these stoppers. Across the world, inhaled corticosteroids (ICS) are available as brown, white, magenta, blue, orange brown, and red inhalers. Long-acting beta-agonists (LABA) are now marketed in green, blue, white, and greenish blue containers. The new hydrofluoroalkane propellant-based salbutamol is marketed in red or yellow jackets. Two overlapping coloured circles, one brown and the other green, convey that the inhaler contains ICS and LABA. Red can be kept aside for future use. We suggest that these identifiers be called ‘U dots’ (universal inhaler dots)."}, {"url": "http://patient.info/health/inhalers-for-copd-including-inhaled-steroids", "passage_text": "1 Beta-agonist inhalers. 2  Examples are formoterol (brand names Atimos®, Foradil®, and Oxis®), salmeterol (brand name Serevent® - a green-coloured inhaler) and indacaterol (brand name Onbrez Breezhaler®). 3  You can continue your short-acting bronchodilator inhalers with these medicines. Steroid inhalers are only used in combination with a long-acting beta-agonist inhaler (this can be with two separate inhalers or with a single inhaler containing two medicines).The main inhaled steroid medications are: 1  Beclometasone. 2  Budesonide. 3  Ciclesonide. 4  Fluticasone. 5  Mometasone."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20081106093447AAaFN9K", "passage_text": "Report Abuse. There are many different ones, but as a general rule, the blue inhaler is Ventolin (Salbutamol) which is a bronchodilator. The brown inhaler is Becotide (Beclometasone) this is a corticosteroid inhaler. The green inhaler is Serevent (Salmeterol) this is a long-acting beta2-adrenergic receptor agonist"}]