[{"url": "http://www.cdph.ca.gov/programs/nbs/Pages/NBSTraitInfoParents.aspx", "passage_text": "Parents of infants identified with sickle cell trait, hemoglobin C trait and hemoglobin D trait can learn more important information about hemoglobin traits by calling the hemoglobin trait toll free number at 1-(866)-954-2229. Hemoglobin is found in the red blood cells of all people."}, {"url": "http://www.healthy.arkansas.gov/programsServices/familyHealth/ChildAndAdolescentHealth/newBornScreening/Parents/Documents/FactSheets/hemoglobin_c_trait.pdf", "passage_text": "If one parent has hemoglobin C trait and the other has normal hemoglobin, it is unlikely that any of their children will have hemoglobin C disease. However, there is a 50% chance with each pregnancy that the child will have hemoglobin C trait."}, {"url": "http://www.healthy.arkansas.gov/programsServices/familyHealth/ChildAndAdolescentHealth/newBornScreening/Parents/Documents/FactSheets/hemoglobin_c_trait.pdf", "passage_text": "People with hemoglobin C trait inherit a normal hemoglobin gene (Hb A) from one parent and hemoglobin C gene (Hb C) from the other parent. These people produce both hemoglobin A and hemoglobin C. Persons with hemoglobin C trait are also known as hemoglobin C carriers. Hemoglobin C trait is not a disease."}, {"url": "http://www.uichildrens.org/Adam/?/HIE%20Multimedia/1/000572", "passage_text": "Hemoglobin C is an abnormal type of hemoglobin, the protein in red blood cells that carries oxygen. It is a type of hemoglobinopathy. The disease is caused by problem with a gene called beta globin."}, {"url": "http://emedicine.medscape.com/article/200853-overview", "passage_text": "Hemoglobin C trait (Hb AC) is clinically silent. Hemoglobin C disease (Hb CC) is a mild disorder that generally does not cause any symptoms and is associated with a normal life expectancy. Affected individuals exhibit normal growth and development and will tolerate surgery and pregnancy without issues."}, {"url": "http://www.idph.state.il.us/HealthWellness/fs/hemoglobinC_trait.htm", "passage_text": "Hemoglobin C trait (hemoglobin C carrier) occurs when a person inherits one gene for hemoglobin C and one gene for hemoglobin A. Individuals with hemoglobin C trait are NOT at risk to develop sickle cell disease or hemoglobin C disease. They generally do NOT have any medical problems and lead normal lives."}, {"url": "http://www.dhhs.nh.gov/dphs/bchs/mch/documents/hemo-c-trait-fs.pdf", "passage_text": "The normal, and most common, type of hemoglobin is called hemoglobin A. Hemoglobin C trait is when a babyinherited one gene for hemoglobin A from one parent and one gene for hemoglobin C from the other parent. Peoplewith hemoglobin C trait are not sick."}, {"url": "http://www.idph.state.il.us/HealthWellness/fs/hemoglobinC_trait.htm", "passage_text": "If both parents are carriers of sickle cell trait or another hemoglobin change (like hemoglobin C), there is a 25 percent (or one in four) chance that they will have a child with sickle cell disease."}]