[{"url": "http://www.merriam-webster.com/medical/Leydig%20cell", "passage_text": "Medical Definition of LEYDIG CELL. : a cell of interstitial tissue of the testis that is usually considered the chief source of testicular androgens and especially testosterone—called also cell of Leydig, interstitial cell of Leydig. "}, {"url": "https://en.wikipedia.org/wiki/Leydig_cell_tumor", "passage_text": "Leydig cell tumour, also Leydig cell tumor (US spelling), (testicular) interstitial cell tumour and (testicular) interstitial cell tumor (US spelling), is a member of the sex cord-stromal tumour group of ovarian and testicular cancers. It arises from Leydig cells. While the tumour can occur at any age, it occurs most often in young adults. A Sertoli-Leydig cell tumour is a combination of a Leydig cell tumour and a Sertoli cell tumour from Sertoli cells. "}, {"url": "http://medical-dictionary.thefreedictionary.com/Leydig+cell", "passage_text": "See interstitial cell. The testosterone-secreting cell of the testis which is located in clusters in the interstitium between the seminiferous tubules. Leydig cells are large and have centrally located nuclei, eosinophilic cytoplasm and numerous lipid-filled cytoplasmic vacuoles. Function. "}, {"url": "http://www.thefreedictionary.com/Leydig+cell", "passage_text": "Noun. 1. Leydig cell-a cell in the testes that secretes the hormone testosterone. Leydig's cell. cell - (biology) the basic structural and functional unit of all organisms; they may exist as independent units of life (as in monads) or may form colonies or tissues as in higher plants and animals. 1  Facebook."}, {"url": "http://medical-dictionary.thefreedictionary.com/Leydig+cells", "passage_text": "in·ter·sti·tial cells. 1. Cells between the seminiferous tubules of the testis that secrete testosterone. Synonym(s): Leydig cells. 2. Cells derived from the theca interna of atretic follicles of the ovary; they resemble luteal cells and are an important source of estrogens. Leydig cell adenoma-small benign tumors of the testis that often produce testosterone, causing endocrine symptoms. Synonym(s): interstitial cell tumor of testis. Leydig cells-c"}, {"url": "http://umm.edu/health/medical/ency/articles/leydig-cell-tumor", "passage_text": "Treatment. Treatment of a Leydig cell tumor depends on its stage. 1  Stage I cancer has not spread beyond the testicle. 2  Stage II cancer has spread to lymph nodes in the abdomen. 3  Stage III cancer has spread beyond the lymph nodes (possibly as far as the liver, lungs, or brain). "}, {"url": "https://www.utmedicalcenter.org/your-health/encyclopedia/disease/000409/", "passage_text": "Definition. A Leydig cell tumor is a tumor of the testicle. It develops from Leydig cells. These are the cells in the testicles that release the male hormone, testosterone. Treatment. Treatment of a Leydig cell tumor depends on its stage. 1  Stage I cancer has not spread beyond the testicle. 2  Stage II cancer has spread to lymph nodes in the abdomen. 3  Stage III cancer has spread beyond the lymph nodes (possibly as far as the liver, lungs, or brain)."}, {"url": "http://www.biology-online.org/dictionary/Leydig_cell", "passage_text": "interstitial cells of the mammalian testis, involved in synthesis of testosterone. leydig cell. Leydig cells, also known as interstitial cells of Leydig, are found adjacent to the seminiferous tubules in the testes. Leydig cells can synthesize testosterone and are often closely related to nerves. Leydig cells form during the 16th and 20th week of gestation. They are quiescent until puberty. sOURCE: http://www.answers.com/topic/leydig-cell. Please contribute to this project, if you have more information about this term feel free to edit this page."}]