[{"url": "http://www.soil-net.com/legacy/schools/what_is_soil1.htm", "passage_text": "Soil is one of the three major natural resources, alongside air and water. It is one of the marvellous products of nature and without which there would be no life. Soil is made up of three main components – minerals that come from rocks below or nearby, organic matter which is the remains of plants and animals that use the soil, and the living organisms that reside in the soil. The proportion of each of these is important in determining the type of soil that is present"}, {"url": "http://www.soils4kids.org/about", "passage_text": "Soils are complex mixtures of minerals, water, air, organic matter, and countless organisms that are the decaying remains of once-living things. It forms at the surface of land – it is the “skin of the earth.” Soil is capable of supporting plant life and is vital to life on earth. "}, {"url": "http://www.nrcs.usda.gov/wps/portal/nrcs/detail/soils/edu/?cid=nrcs142p2_054280", "passage_text": "This definition is from the Soil Science Glossary (Soil Science Society of America). soil - (i) The unconsolidated mineral or organic material on the immediate surface of the Earth that serves as a natural medium for the growth of land plants. The lower boundary that separates soil from the nonsoil underneath is most difficult to define. Soil consists of horizons near the Earth's surface that, in contrast to the underlying parent material, have been altered by the interactions of climate, relief, and living organisms over time."}, {"url": "http://www.nrcs.usda.gov/wps/portal/nrcs/detail/soils/edu/?cid=nrcs142p2_054280", "passage_text": "(ii) The unconsolidated mineral or organic matter on the surface of the Earth that has been subjected to and shows effects of genetic and environmental factors of: climate (including water and temperature effects), and macro-and microorganisms, conditioned by relief, acting on parent material over a period of time. The lower boundary that separates soil from the nonsoil underneath is most difficult to define. Soil consists of horizons near the Earth's surface that, in contrast to the underlying parent material, have been altered by the interactions of climate, relief, and living organisms over time."}, {"url": "http://www.answers.com/Q/What_is_soil", "passage_text": "Confidence votes 2.1K. Soil is the top layer of the earth in which plants grow, a dark brown or black mixture usually of mineral and organic constituents, clay and rock particles. Soil is made of 45% minerals (sand,clay,silt), 25% Water, 25% Air and 5% Organics. Soil also includes dirt that is made of materials that plants avoid growing in. Hence, soil a mixture of decayed organic material, living organisms, and minerals. The organic materials come from dead plants like banana peels and last year's leaves. This is due to the fact that plants grow on top of the soil and rocks are found underground. The type of soil that forms in a region will depend upon the climate, the bedrock underground, or the plants growing there. Although all soils are made of these basic ingredients, there are many variations."}, {"url": "http://www.thefreedictionary.com/soil", "passage_text": "soil 1. n. 1. The top layer of the earth's surface in which plants can grow, consisting of rock and mineral particles mixed with decayed organic matter and having the capability of retaining water. 2. A particular kind of earth or ground: sandy soil. 3. Country; land: native soil. 4. soil. n. 1. (Physical Geography) the top layer of the land surface of the earth that is composed of disintegrated rock particles, humus, water, and air. See zonal soil, azonal soil, intrazonal soil, horizon 4, horizon 5. 2. (Physical Geography) a type of this material having specific characteristics: loamy soil."}, {"url": "http://lifeunderyourfeet.org/en/soileco/intro/whatis.asp", "passage_text": "Soil is a mixture of broken rocks and minerals, living organisms, and decaying organic matter called humus. Humus is dark, soft and rich in nutrients. Soil also includes air and water. Organisms in the soil need air and water to survive. Having these essential materials-air, water, and organic matter-makes it possible for plants, bacteria, fungi and small animals like earthworms and insects to live in the soil. "}, {"url": "http://www.ehow.com/about_4644760_what-is-soil.html", "passage_text": "Some plants thrive in sandy soil, and others need the rich depth of loamy conditions while still others flourish in damp, heavy, clay soil. The soil is the foundation of a garden; it supports the plants, gives the plants' roots something to hold onto and makes nutrients and water available to the plants. Soil is a combination of inorganic particles and organic materials. The inorganic part of soil comes from rocks and minerals, and the organic part is made of decomposed plant material. The type of soil any garden has depends on the size of the inorganic particles."}, {"url": "http://www.answers.com/Q/How_is_soil_formed", "passage_text": "The topsoil contains most of the humus (which is a dark organic material of the soil), it i … s formed from the decay of various organisms The thick layer of soil below topsoil is subsoil, it is lighter in colour in comparison with the topsoil and often contains a lot of clay. "}, {"url": "https://en.wikipedia.org/wiki/Soil", "passage_text": "Soil is considered to be the skin of the earth and interfaces with its lithosphere, hydrosphere, atmosphere, and biosphere. Soil consists of a solid phase (minerals and organic matter) as well as a porous phase that holds gases and water. Accordingly, soils are often treated as a three-state system. The mineral material from which a soil forms is called parent material. Rock, whether its origin is igneous, sedimentary, or metamorphic, is the source of all soil mineral materials and the origin of all plant nutrients with the exceptions of nitrogen, hydrogen and carbon."}]