[{"url": "http://www.mccslejeune-newriver.com/inlinehockey/", "passage_text": "This is a fun and exciting form of exercise that everyone can enjoy while still getting a great work out. The rink is regulation size for inline hockey games and is open year-round. Anyone can reserve the rink a day in advance."}, {"url": "http://napavalleyregister.com/news/local/napa-on-ice-opens-for-third-year-of-skating-fun/article_23ccae4c-4f59-11e3-9f39-0019bb2963f4.html", "passage_text": "Hours are usually noon to 10 p.m. on weekends and 2 to 9 p.m. on school nights. Tickets are $12, skate rentals included. For information, check NapaOnIce.com. Napa’s seasonal skating rink opened this weekend with skaters of all ages strapping on new boots and hitting the new ice. On Friday, about 220 skaters inaugurated Napa On Ice’s third season. On Saturday, more skaters, including dozens of teenagers, returned to the rink at Second and Coombs streets."}, {"url": "http://napavalleyregister.com/news/local/napa-on-ice-opens-for-third-year-of-skating-fun/article_23ccae4c-4f59-11e3-9f39-0019bb2963f4.html", "passage_text": "His wife, Nancy, will remain more involved in the day-to-day operations of the rink as Napa On Ice’s coordinator. Napa On Ice employs 18 part-time employees, she said. This year’s budget is about $220,000, Peter Mott said."}, {"url": "http://napavalleyregister.com/news/local/ice-skating-returns-to-napa-next-week/article_e37397e0-29f0-11e2-a700-001a4bcf887a.html", "passage_text": "• Details: Hours of operation and special events are listed on donapa.com. A big sheet of ice is headed for downtown Napa. Crews began assembling the 70-by-90-foot ice skating rink Monday, building the frame that will hold several inches worth of ice and, next week, crowds of skaters. The Napa on Ice rink is returning for its second holiday season and will be more than 1,500 square feet larger than its predecessor. “It’s going to be really different this year,” said Peter Mott, the man who first decided to bring a seasonal rink downtown. “It’s going to be bigger and better.”."}]