[{"url": "http://www.thefreedictionary.com/unconventional", "passage_text": "unusual normal, regular, usual, ordinary, typical, conventional, proper, orthodox. 2. unorthodox, original, unusual, irregular, atypical, different, uncustomary The vaccine had been produced by an unconventional technique. At first, on sitting down to table, we had grown momentarily shy, with one of those sudden freaks of self-consciousness which occasionally surprise one, when, midway in some slightly unconventional situation to which the innocence of nature has led us, we realise it--for an instant and no more."}, {"url": "https://answers.yahoo.com/question/index?qid=20071119161652AAITT67", "passage_text": "Report Abuse. Unconventional means, in its original form against the flow. So, it could be meant as a person that displays courage in a more marked way than normal people (And yeah, mother Theresa and MLK could do) Or it could be meant as someone who show courage in an unique (possibly weird) way. "}, {"url": "https://en.wikipedia.org/wiki/Unconventional_oil", "passage_text": "Unconventional oil is petroleum produced or extracted using techniques other than the conventional (oil well) method. Oil industries and governments across the globe are investing in unconventional oil sources due to the increasing scarcity of conventional oil reserves. In a communication to the UK entitled Oil Sands Crude in the series The Global Range of Crude Oils, it was argued that that commonly used definitions of unconventional oil based on production techniques are imprecise and time-dependent."}, {"url": "https://en.wikipedia.org/wiki/Unconventional_oil", "passage_text": "Extraction techniques that are categorized as conventional use unconventional means such as gas re-injection or the use of heat not traditional oil extraction methods. As the use of newer technologies increase, unconventional oil recovery has become the norm not the exception. In a communication to the UK entitled Oil Sands Crude in the series The Global Range of Crude Oils, it was argued that that commonly used definitions of unconventional oil based on production techniques are imprecise and time-dependent."}, {"url": "http://www.investopedia.com/terms/u/uncoventional-oil.asp", "passage_text": "DEFINITION of 'Unconventional Oil'. A type of petroleum that is produced or obtained through techniques other than traditional oil well extraction. Unconventional oil production is commonly seen as more costly than conventional oil production, less efficient, and is likely to cause more environmental damage. This is because unconventional oil is considered “heavier” and requires more complex procedures to process."}, {"url": "https://en.wikipedia.org/wiki/Unconventional_warfare_(United_States_Department_of_Defense_doctrine)", "passage_text": "In United States doctrine, unconventional warfare (abbreviated UW) is the term for guerrilla warfare that is conducted or supported by units in the United States Special Operations Command. Guerrilla warfare is one aspect of the broader term insurgency. "}, {"url": "http://www.audioenglish.org/dictionary/unconventional.htm", "passage_text": "The adjective UNCONVENTIONAL has 3 senses: 1. not conforming to accepted rules or standards. 2. not conventional or conformist. 3. not conforming to legality, moral law, or social convention. Familiarity information: UNCONVENTIONAL used as an adjective is uncommon. UNCONVENTIONAL: related words searches. » bohemian: pronunciation in phonetic transcription. » go-as-you-please definition. » Meaning of way-out. » flaky: pronunciation in phonetic transcription. » Definition of gonzo"}, {"url": "http://www.thefreedictionary.com/unconventional", "passage_text": "Adj. 1. unconventional-not conforming to accepted rules or standards; her unconventional dress and hair style. original-being or productive of something fresh and unusual; or being as first made or thought of; a truly original approach; with original music; an original mind. At first, on sitting down to table, we had grown momentarily shy, with one of those sudden freaks of self-consciousness which occasionally surprise one, when, midway in some slightly unconventional situation to which the innocence of nature has led us, we realise it--for an instant and no more."}]