[{"url": "http://www.ancestry.com/name-origin?surname=siebert", "passage_text": "The information for this chart came from the U.S. Immigration Collection at Ancestry. You can find out where the majority of the Siebert families were living before they immigrated to the U.S and learn where to focus your search for foreign records. Immigration records can tell you an ancestor's name, ship name, port of departure, port of arrival, and destination. from the New York Passenger Lists. "}, {"url": "http://www.surnameweb.org/Siebert/surname-origin.htm", "passage_text": "Top Places of Origin for Siebert You can find out where the majority of Siebert families were living before they immigrated to the U.S. You can learn where to focus your search for foreign records. Ports of Departure for Siebert You can pinpoint where the majority of Siebert families booked passage to the US. Origin: Seibert has it's origins as a Germanic Patronymic name. It has 40 some-odd variations in spelling and pronunciation. It's original spelling came from two root words, 'siege' and 'beraht', meaning 'victorious & brilliant one, famous'. These two words combined, create the earliest common form of 'Siegbert'"}, {"url": "http://www.surnamedb.com/Surname/Siebert", "passage_text": "Recorded in many spellings including Siebert, Ziebart, Siebart, Segebrecht, Sagebrecht, Siebrecht, Zieprecht, Sibbert, Sagebarth, Sebrecht, Siebe, Sibbe, Siebecke and others, this is a surname of ancient Germanic origins. "}, {"url": "http://www.hebrewsurnames.com/SIEBERT", "passage_text": "This is an open forum to discuss the origin, the meaning and the family stories of the surname SIEBERT. Both your knowledge and the oral tradition of the origin and meaning of this surname will be helpfull. Using the Daitch-Mokotoff Soundex Code we can obtain some variants of scripture of the same surname. Below you will find the variants of scripture we have in our database. SIEBERT Genealogy. The vast majority of Argentine Jews are descended from immigrants who arrived from Europe. These ashkenazic Jews migrated from small towns or shtetels of Poland, Lithuania, Russia, Germany, Romania or Ukraine, leaving behind most of their Jewish relatives."}, {"url": "http://www.babynamespedia.com/meaning/Siebert", "passage_text": "[ 2 syll. sie-ber(t) , si-ebe-rt ] The baby boy name Siebert is pronounced as S IY BerT †. The origin of Siebert is the English language. Siebert is a derivative of the name Seabert. Siebert is not commonly used as a baby boy name. It is not in the top 1000 names. Baby names that sound like Siebert include Seabert, Seebert, Seeburt, Sieburt, Saebeorht, Safford, Safforde, Saford, Saforde, Schubert, Schuberte, Schubirt, Schuburt, Seabright, Seaburt, Sebert, Seburt, Seibert, Seiburt, and Seifert (German)."}, {"url": "http://surnames.meaning-of-names.com/genealogy/siebert/", "passage_text": "Siebert in RootsWeb surname mailing lists. Siebert genealogy mailing list for correspondence and sharing of information pertaining to family histories of the Siebert surname and its variations. Or check the index of mailing lists for a sound-alike name. Web Sites. Siebert Genealogy. Welcome to some of the best Siebert genealogy resources found on the web. We hope you will participate on the Siebert forums, it is a great place to find or post information on Siebert genealogy and is completely free to participate."}, {"url": "http://www.surnameweb.org/Siebert/surname-origin.htm", "passage_text": "Siebert Immigration to the US by Year You can find out when most of the Siebert families immigrated to the United States. You can focus your search to immigration records dating from that era. Name History and Origin for Siebert Naming patterns can help you learn more about your family s cultural and ethnic background. Origin: Seibert has it's origins as a Germanic Patronymic name. It has 40 some-odd variations in spelling and pronunciation. It's original spelling came from two root words, 'siege' and 'beraht', meaning 'victorious & brilliant one, famous'. These two words combined, create the earliest common form of 'Siegbert'"}, {"url": "http://www.babynamespedia.com/meaning/Seibert", "passage_text": "Seibert is of English origin. The meaning of the name is 'bright sea'. Seibert is a form of the name Seabert. A form of Seibert is the name Sebert. Seibert is unusual as a baby boy name. It is not ranked within the top 1000. "}, {"url": "http://www.hebrewsurnames.com/SIEBERT", "passage_text": "They will be useful to find and to determine the SIEBERT meaning. We invite you to post your knowledge and familiar tradition about your surnames. JUST DO IT at the end of the following posts. You can also try to find relatives posting here information about your relatives you are searching for. SIEBERT Genealogy. The vast majority of Argentine Jews are descended from immigrants who arrived from Europe. These ashkenazic Jews migrated from small towns or shtetels of Poland, Lithuania, Russia, Germany, Romania or Ukraine, leaving behind most of their Jewish relatives."}]