[{"url": "http://my.clevelandclinic.org/health/diseases_conditions/hic_Pulmonary_Hypertension_Causes_Symptoms_Diagnosis_Treatment", "passage_text": "Pulmonary hypertension is a rare lung disorder in which the arteries that carry blood from the heart to the lungs become narrowed, making it difficult for blood to flow through the vessels. As a result, the blood pressure in these arteries -- called pulmonary arteries -- rises far above normal levels. The first symptom of pulmonary hypertension is usually shortness of breath with everyday activities, such as climbing stairs. Fatigue, dizziness, and fainting spells also can be symptoms. Swelling in the ankles, abdomen or legs, bluish lips and skin, and chest pain may occur as strain on the heart increases."}, {"url": "http://www.nhs.uk/Conditions/pulmonary-hypertension/Pages/introduction.aspx", "passage_text": "Introduction. Pulmonary hypertension is raised blood pressure within the pulmonary arteries, which are the blood vessels that supply the lungs. It's a serious medical condition that can damage the right side of the heart, making the heart less efficient at pumping blood around the body and getting oxygen to the muscles."}, {"url": "http://www.healthline.com/health-slideshow/pulmonary-hypertension-prognosis", "passage_text": "Pulmonary hypertension (PH) is a serious health condition that results when the arteries carrying blood to the lungs are constricted, disrupting blood flow. Blood must travel through the lungs to pick up oxygen that it can deliver to all the organs, muscles, and tissue in the body. "}, {"url": "http://www.nhlbi.nih.gov/health/health-topics/topics/pah/", "passage_text": "Pulmonary hypertension (PULL-mun-ary HI-per-TEN-shun), or PH, is increased pressure in the pulmonary arteries. These arteries carry blood from your heart to your lungs to pick up oxygen. "}, {"url": "http://www.healthline.com/health-slideshow/symptoms-pulmonary-arterial-hypertension", "passage_text": "Pulmonary arterial hypertension (PAH) is a rare form of high blood pressure. It occurs in the pulmonary arteries that flow from your heart and through your lungs. Constricted and narrowed arteries prevent your heart from pumping adequate blood. When constriction occurs, the heart will need to work harder to compensate. "}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMH0001171/", "passage_text": "Pulmonary Hypertension (PH). Pulmonary hypertension, or PH, is increased pressure in the pulmonary arteries. These arteries carry blood from your heart to your lungs to pick up oxygen. PubMed Health Glossary. Pulmonary hypertension (PH) is high blood pressure in the lung circulation. It can occur without a known cause, or it can be caused by another lung disease or be secondary to abnormalities in the left side of the heart."}, {"url": "http://www.heart.org/HEARTORG/Conditions/CongenitalHeartDefects/TheImpactofCongenitalHeartDefects/Pulmonary-Hypertension_UCM_307044_Article.jsp", "passage_text": "High blood pressure in the arteries that supply the lungs is called pulmonary hypertension (PH) or pulmonary arterial hypertension (PAH). The blood pressure measured by a cuff on your arm isn't directly related to the pressure in your lungs. "}]