[{"url": "http://www.bcbusiness.ca/manufacturing-transport/vancouver-has-fewer-taxis-than-any-other-canadian-city", "passage_text": "Taxi licenses have sold for as much as $500,000 in Vancouver, according to a report cited in the Conference Board study. The next highest prices noted were $280,000 in Winnipeg and $220,000 in Montreal. The highest recorded price for a taxi license in Toronto is $114,000. A survey of taxi fares across the country indicates that while Vancouver taxi licences are the most expensive in the country, that isn’t reflected in passenger fares."}, {"url": "http://www.bcbusiness.ca/manufacturing-transport/vancouver-has-fewer-taxis-than-any-other-canadian-city", "passage_text": "According to the report, “The taxicab industry in Canada... is subject to heavy market regulation,” and the primary means of control is through limiting the number of licenses, or permits. Cost of a three kilometre taxi ride, including three minutes waiting time: Toronto: $11.06."}, {"url": "http://www.winnipegfreepress.com/opinion/analysis/taxi-licence-prices-tell-tale-79483737.html", "passage_text": "Martin Cash wrote that two licences recently went for $412,000. Ray Mundy, of the Tennessee Transportation and Logistics Foundation who produced a report for the Manitoba Taxi Board in February, pegged the top price for a licence at $250,000."}, {"url": "http://www.where.ca/winnipeg-airport/", "passage_text": "Time: 20 minutes to downtown. 22 limo lines service the Winnipeg Airport, and they vary in price and luxury. On average, a limo trip to downtown from the Winnipeg Airport will cost $35 in a sedan and $55 in a stretch limo."}, {"url": "http://www.where.ca/winnipeg-airport/", "passage_text": "TAXI Cost: $16 to downtown. Time: 20 minutes to downtown. Taxis from the Winnipeg Airport are priced by meter (not by flat rate). The average cost to downtown is $16, depending on traffic conditions. Only Unicity cabs travel from the Winnipeg Airport, and they are available just outside Exit 3 of the terminal building."}, {"url": "http://www.winnipegfreepress.com/opinion/analysis/taxi-licence-prices-tell-tale-79483737.html", "passage_text": "As Free Press columnist Martin Cash reported, the cost of a Winnipeg taxi licence has gone through the roof. Barry Prentice and Charles Mossman at the University of Manitoba's Asper School of Business have reported that the price of a licence has gone from around $100,000 to more than $300,000 over the past decade."}]