[{"url": "https://answers.yahoo.com/question/index?qid=20121219160048AAGoNDW", "passage_text": "Medical School = 4 years Orthopedic Residency = 4 years You could do a fellowship for extra training in a specific area such as spine or hips or shoulders, etc...which is another 1-3 years depending upon what you choose So anywhere from 8 to 11 years to complete starting with your first year of medical school. "}, {"url": "http://www.ehow.com/how_2041060_become-orthopedic-surgeon.html", "passage_text": "Extensive Training Required. Becoming an orthopedic surgeon requires 13 or more years of education and training. After obtaining a four-year-college degree and completing four years of medical school, an aspiring orthopedic surgeon must complete a five-year residency program in general and specialized surgery. To become board certified can take up to two additional years of clinical training."}, {"url": "http://www.answers.com/Q/How_long_does_it_take_to_become_an_orthopedic_surgeon", "passage_text": "For neurosurgery 7 years is typical.    To become a brain surgeon you need to take the following steps: 1.) Graduate from high school and apply and get accepted to a university. 2.) At a 4 year university get good grades (average is about a 3.5), do well on an admissions test (MCAT) and apply to medical schools. 3.) Attend a 4 year medical school. Near graduation you will need to apply for a residency program. 4.) Residency programs vary in length depending on the field."}, {"url": "http://www.youtube.com/watch?v=yUKY4VtIWD0", "passage_text": "Please try again later. Becoming a surgeon requires four years of undergraduate school, four years of medical school and four to eight years of specialized residency training. "}, {"url": "http://work.chron.com/schooling-needed-orthopedic-surgeon-10163.html", "passage_text": "Its median salary for pediatric orthopedic surgeons was $425,000, while hand and wrist surgeons reported median salaries of $476,039 per year. Joint replacement surgeons enjoyed a median income of $605,953 per year, and spinal surgeons topped the list at $688,503 per year. A residency in orthopedic surgery lasts five years, which gives new surgeons the time and opportunity to learn their profession under the watchful eye of experienced colleagues. During those five years, residents progress from observing to assisting, then to performing increasingly complex procedures on their own."}, {"url": "https://answers.yahoo.com/question/index?qid=20071226165425AAFSgDh", "passage_text": "Report Abuse. The soonest you'll ever become a physician is 7 years after college (4 years of medical school and 3 years residency). The residency for an orthopedic surgeon is quite long. I'd expect it to be 5 or 6 years. Best Answer: 4 years undergrad 4 years med school 3+ years residency (thats where you learn the skills required to be a orthopedic surgeon). Source(s): im2spoiled4me · 8 years ago. Thumbs up."}, {"url": "http://www.ehow.com/video_4754645_how-long-does-become-surgeon.html", "passage_text": "Or Neurosurgery which is eight years or more of residency time, over an above the time it takes to become a doctor. So, again there are so many types of surgeons. When we think of surgeons in general, we usually think of general surgeons. And they are usually four years. Orthopedic surgeons are the type of surgeons that deal with bones. They are going to be going to school for probably four to six years after they become a physician. Again there are so many possibilities reduced back to just the surgical fields. "}, {"url": "http://work.chron.com/schooling-needed-orthopedic-surgeon-10163.html", "passage_text": "Schooling. Becoming an orthopedic surgeon typically requires eight years of schooling, although some schools offer accelerated programs. The first four years are spent in earning a pre-medical degree. These are bachelor of science programs designed to meet the prerequisites for admission into a medical or osteopathic college. A residency in orthopedic surgery lasts five years, which gives new surgeons the time and opportunity to learn their profession under the watchful eye of experienced colleagues. During those five years, residents progress from observing to assisting, then to performing increasingly complex procedures on their own."}, {"url": "http://www.answers.com/Q/How_long_does_it_take_to_become_an_orthopedic", "passage_text": "Answered by The Community. Making the world better, one answer at a time. it takes fourteen years to become orthopedic/orthopedic surgeon.....four years college with many science classes, four years of medical school, one year internship and five years of residency. •The education of an orthopedic surgeon:    You must first go to university/college and get a  university/college degree, attend medical school and graduate  eith … er as a Doctor of Medicine (MD) or a Doctor of Osteopathic  Medicine (DO)."}]