[{"url": "http://www.merckmanuals.com/professional/neurologic-disorders/neuro-ophthalmologic-and-cranial-nerve-disorders/sixth-cranial-nerve-palsy", "passage_text": "Sixth cranial nerve palsy affects the lateral rectus muscle, impairing eye abduction. The eye may be slightly adducted when the patient looks straight ahead. The palsy may be secondary to nerve infarction, Wernicke encephalopathy, trauma, infection, or increased intracranial pressure, or it may be idiopathic. "}, {"url": "https://en.wikipedia.org/wiki/Oculomotor_nerve_palsy", "passage_text": "From Wikipedia, the free encyclopedia. Oculomotor nerve palsy or third nerve palsy is an eye condition resulting from damage to the third cranial nerve or a branch thereof. As the name suggests, the oculomotor nerve supplies the majority of the muscles controlling eye movements. "}, {"url": "https://en.wikipedia.org/wiki/Sixth_nerve_palsy", "passage_text": "From Wikipedia, the free encyclopedia. Sixth nerve palsy, or abducens nerve palsy, is a disorder associated with dysfunction of cranial nerve VI (the abducens nerve), which is responsible for causing contraction of the lateral rectus muscle to abduct (i.e., turn out) the eye. "}, {"url": "http://www.wisegeekhealth.com/what-is-cranial-nerve-palsy.htm", "passage_text": "Adorable animal families that will make you aww. Cranial nerve palsy is a form of palsy involving one or more of the cranial nerves. Palsy occurs when a muscle becomes paralyzed or someone loses control of it, experiencing erratic muscle movements, spastic jerks, and other problems. In people with cranial palsy, control over a muscle or group of muscles is lost, leading to drooping, paralysis, or erratic involuntary movements. There are a number of reasons why someone might develop cranial nerve palsy. Facial or head trauma can be a cause, as this may directly damage a nerve. People can also experience this condition after a surgery in which a surgeon inadvertently damages one of the cranial nerve"}, {"url": "http://www.healthline.com/health/sixth-nerve-palsy", "passage_text": "Sixth nerve palsy is a disorder affecting the sixth nerve, which supplies the lateral rectus muscle. This ocular muscle is responsible for turning the eyeball outward, away from the nose. When a person has sixth nerve palsy, the eye begins to point inward toward the nose, often resulting in double vision. "}, {"url": "http://www.merckmanuals.com/professional/neurologic-disorders/neuro-ophthalmologic-and-cranial-nerve-disorders/facial-nerve-palsy", "passage_text": "Facial nerve (7th cranial nerve) palsy is often idiopathic (formerly called Bell palsy). Idiopathic facial nerve palsy is sudden, unilateral peripheral facial nerve palsy. Symptoms of facial nerve palsy are hemifacial paresis of the upper and lower face. Etiology. Historically, Bell palsy was thought to be idiopathic facial nerve (peripheral 7th cranial nerve) palsy. However, facial nerve palsy is now considered a clinical syndrome with its own differential diagnosis, and the term Bell palsy is not always considered synonymous with idiopathic facial nerve palsy."}, {"url": "http://www.ninds.nih.gov/disorders/bells/detail_bells.htm", "passage_text": "Bell's palsy is a form of temporary facial paralysis resulting from damage or trauma to the facial nerves. The facial nerve-also called the 7th cranial nerve-travels through a narrow, bony canal (called the Fallopian canal) in the skull, beneath the ear, to the muscles on each side of the face. Bell's palsy occurs when the nerve that controls the facial muscles is swollen, inflamed, or compressed, resulting in facial weakness or paralysis. Exactly what causes this damage, however, is unknown."}, {"url": "http://www.wisegeekhealth.com/what-is-nerve-palsy.htm", "passage_text": "Bell's Palsy is a form of nerve palsy that causes paralysis or weakness on one side of the face. Treatment for various forms of nerve palsy may include massage therapy. Untreated nerve palsy may leave the feet completely incompacitated. A palsy of the third cranial nerve generally affects a patient’s ability to move the eyes, constrict the pupils and focus or move the upper eyelids. People who suffer from nerve palsy may experience abnormal, involuntary eye movements"}]