[{"url": "http://www.ehow.com/facts_5656332_incubation-period-flu_.html", "passage_text": "Incubation Period. According to the CDC, although the incubation period can range from one to four days, the typical incubation period is two days. People can begin infecting others about one day before any symptoms of the virus appear, and are contagious for about a week after that."}, {"url": "http://www.eohu.ca/segments/vocabulary_e.php?segmentID=23&topicID=283", "passage_text": "What is the difference between an antiviral and a vaccine? An incubation period is the amount of time it takes between exposure to a virus, and the development of symptoms caused by the virus. For the H1N1 flu virus, the incubation period is between 1 and 7 days, with 4 days being the most common."}, {"url": "http://www.cdph.ca.gov/HealthInfo/h1n1flufaqs/Pages/H1N1fluFAQs-01-GenInfo.aspx", "passage_text": "The estimated incubation period is unknown and could range from 1 to 7 days, and more likely 1 to 4 days. Persons with novel H1N1 flu virus infection should be considered potentially contagious (able to spread disease) for up to 7 days after illness onset."}, {"url": "http://www.webmd.com/cold-and-flu/news/20031205/raise-your-flu-iq", "passage_text": "That's the incubation period. For the flu, it is about two to five days. So if you are exposed today, you probably won't have any symptoms for three to five days. Then you have a little headache, maybe a few aches and pains and maybe a low fever. Then, the next day, you have a high fever and a runny nose."}, {"url": "http://www.ehow.com/facts_5656332_incubation-period-flu_.html", "passage_text": "Influenza is a highly contagious respiratory illness. According to the Centers for Disease Control and Prevention, every year between 5 and 20 percent of people in the United States get the flu. More than 200,000 are hospitalized due to flu-related complications and nearly 36,000 die from causes related to the virus."}, {"url": "http://www.commoncold.org/understand.htm", "passage_text": "(13) This interval is called the incubation period. Cold symptoms can also begin shortly after virus is first produced in the nose (10-12 hours). (13) The time from the beginning of the infection to the peak of symptoms is typically 36-72 hours."}, {"url": "http://www.cdc.gov/flu/professionals/acip/clinical.htm", "passage_text": "The typical incubation period for influenza is 1—4 days (average: 2 days). Most healthy adults may be able to infect others beginning 1 day before symptoms develop and up to 5 to 7 days after becoming sick."}, {"url": "http://wwwnc.cdc.gov/eid/article/14/11/08-0509_article", "passage_text": "Ascertainment of the incubation period for influenza virus (H5N1) is important to define exposure periods for surveillance of patients with suspected influenza virus (H5N1) infection. Limited data on the incubation period suggest that illness onset occurs 7 days after the last exposure to sick or dead poultry (1 – 4)."}]