[{"url": "http://motherchildnutrition.org/malnutrition-management/integrated-management/calculating-the-weight-for-height-length-percentage.html", "passage_text": "Calculating the Weight-for-Height/Length percentage or Standard Deviation score. Using the Weight/Height table to calculate the Weight-for-Height/Length percentage or Standard Deviation (Z-score). This reference table helps in the interpretation of anthropometric measurements through the Weight-for-Height/Length percentage (W/H %) or Standard Deviation score (Z-score). "}, {"url": "https://en.wikipedia.org/wiki/Standard_deviation", "passage_text": "This means that most men (about 68%, assuming a normal distribution) have a height within 3 inches of the mean (67–73 inches) – one standard deviation – and almost all men (about 95%) have a height within 6 inches of the mean (64–76 inches) – two standard deviations. If the standard deviation were 20 inches, then men would have much more variable heights, with a typical range of about 50–90 inches. Three standard deviations account for 99.7% of the sample population being studied, assuming the distribution is normal (bell-shaped)."}, {"url": "http://fathersmanifesto.net/standarddeviationheight.htm", "passage_text": "Mean male height: 69.3 in. Standard deviation: 2.8. Mean female height: 64 in. Standard deviation: 2.8. Out of 100 million adult females in the US, less than 5 million of them are taller than 68.2 inches, or 5 8.2. Out of 100 million adult males, less than 5 million are shorter than 66 inches, or 5. So about 5 million women are taller than 5 million men, while 95% of men are taller than 95% of women. This is the same Gaussian distribution, standard deviation and gender gap as almost all standardized tests. People come in lots of different heights. Let's think about the height of American men"}, {"url": "http://investing.calsci.com/statistics.html", "passage_text": "Standard Deviation is normally written as σ The standard deviation for American men's height is about 3. Knowing that, we can figure out what the rest of the population looks like too. Each time height increases by 3, by a standard deviation, the population drops off considerably. There are just about exactly 100,000,000 adult men in America. Now that we know their average height is 5'10 and the standard deviation is 3, we can predict how many of these men fall into various height categories."}, {"url": "http://www.solving-math-problems.com/standard-deviation-height-of-basketball-players.html", "passage_text": "0.5 is the probability that a player’s height is 184 cm or more.To determine the area from + three standard deviations to the right, use the same table of probabilities which was used in questions a. b. and c. Determine the area under the curve from x̄ to three standard deviations to the right. 0.5 is the probability that a player’s height is 184 cm or more.To determine the area from + one standard deviation to the right, use the following table of probabilities to determine the area under the curve from x̄ to one standard deviation to the right."}, {"url": "http://www.johndcook.com/blog/mixture_distribution/", "passage_text": "First, assume adult male heights are normally distributed with mean 70 inches and standard deviation 3 inches. Assume also that adult female heights are normally distributed with mean 64 inches and standard deviation 3 inches. "}, {"url": "https://simple.wikipedia.org/wiki/Standard_deviation", "passage_text": "A slightly harder, real life example: The average height for grown men in the United States is 70, with a standard deviation of 3. A standard deviation of 3” means that most men (about 68%, assuming a normal distribution) have a height 3 taller to 3” shorter than the average (67–73) — one standard deviation. If the standard deviation were 20, then some men would be much taller or much shorter than the average, with a typical range of about 50–90. For another example, each of the three groups {0, 0, 14, 14}, {0, 6, 8, 14} and {6, 6, 8, 8} has an average (mean) of 7. But their standard deviations are 7, 5, and 1."}, {"url": "http://www41.homepage.villanova.edu/klaus.volpert/teaching/MonteCarloSeminar/Presentations/Curcio.pptx", "passage_text": "Average height for males: 69.2 inches: 5 ft 9.2 inches. Average height for females: 63.8. 5 ft 3.8 inches. Standard Deviation for males & females is 2.8 inches. Males are about 5 inches taller than females, both have the same standard deviation. *Information taken from National Health and Nutrition Examination Survey. Other countries. Certain cultures discourage males from marrying taller females."}, {"url": "http://fathersmanifesto.net/standarddeviationheight.htm", "passage_text": "Each time height increases by 3, by a standard deviation, the population drops off considerably. There are just about exactly 100,000,000 adult men in America. Now that we know their average height is 5'9 and the standard deviation is 3, we can predict how many of these men fall into various height categories. Out of 100 million adult males, less than 5 million are shorter than 66 inches, or 5. So about 5 million women are taller than 5 million men, while 95% of men are taller than 95% of women. This is the same Gaussian distribution, standard deviation and gender gap as almost all standardized tests."}]