[{"url": "http://www.thatreallyfrostsme.com/2010/04/cake-boards.html", "passage_text": "One finished cake board...for the bottom. For the boards that go between the tiers there is one more step. I stick one more piece of contact paper on the back to completely seal in the cardboard. This step is crucial to the stability of your cake. Once you have the correct size and shape of cardboard pieces, get some elmer's glue or something similar. Put the glue between the layers on your multi-layer bottom cake board. I have used tape to hold the boards together but it showed through the contact paper in the next step."}, {"url": "http://www.cakecentral.com/forum/t/336003/what-to-use-to-separate-cake-tiers", "passage_text": "I put mine on the same size cake board as the tier, then on the Wilton cakes (I use the hidden columns)............that's my 2 cents. thems_my_kids Posted 8 Jun 2007, 6:00pm. post #4 of 5. To tier, I put the cake on teh exact same size wrapped cake board. 8 inch cake = 8 inch board. Then I use a wilton plate because it has the feet for the columns. I wouldn't put a cake directly on a wilton plate because I wouldn't want my plate scratched during teh slicing process. post #5 of 5. I use cardboard covered in clear plastic. It's actually the what you'd wrap a basket in, or something, comes in a roll like wrapping paper. But I make my circle the exact same size as the cake so it doesnt stick out and is covered by a border."}, {"url": "http://cakedecorating.about.com/od/Constructingthecake/a/How-To-Stack-A-Cake.htm", "passage_text": "1 Make sure each tier is completely level using a level from the hardware store set on the top. 2  Insert dowels into all the tiers except the top one. 3  Place a cake board the same size as the tier above the bottom one centered on top of the bottom tier and press it gently to imprint the outline on the icing or fondant. For example, a 16 inch or 18 inch cake will require at least eight dowels and a ten inch cake will need at least six dowels. You can gently press a cake board the same size as the upper tier on the top of the lower tier to mark where to place the dowels."}, {"url": "http://www.cooksinfo.com/cake-boards", "passage_text": "Newsletter sign up. Newsletter sign up. A Cake Board is a flat support placed under a cake, to make it easy to lift and transport. A cake is placed on a Cake Board and then spends the rest of its life span on the board: it is decorated on the board, transported on the board, and served from the board. Cake Boards come in different sizes and shapes, disposable and re-usable. They can be round, square or rectangular. "}, {"url": "http://www.thatreallyfrostsme.com/2010/04/cake-boards.html", "passage_text": "For the bottom cake board. that will carry the entire weight of the cake I use at least two layers. For a three tiered cake I would use 3-4 depending on the size of the tiers. My rule of thumb is that it is better to overkill on the stability than to have the cake crash. Once you have the correct size and shape of cardboard pieces, get some elmer's glue or something similar. Put the glue between the layers on your multi-layer bottom cake board. I have used tape to hold the boards together but it showed through the contact paper in the next step."}, {"url": "http://cakedecorating.about.com/od/Constructingthecake/a/How-To-Stack-A-Cake.htm", "passage_text": "1 Insert dowels into all the tiers except the top one. 2  Place a cake board the same size as the tier above the bottom one centered on top of the bottom tier and press it gently to imprint the outline on the icing or fondant. 3  Use this guideline to insert the appropriate number of dowels into the cake within the line. For example, a 16 inch or 18 inch cake will require at least eight dowels and a ten inch cake will need at least six dowels. You can gently press a cake board the same size as the upper tier on the top of the lower tier to mark where to place the dowels."}, {"url": "http://thedaintybaker.blogspot.co.uk/2011/12/how-to-assemble-tiered-cake.html", "passage_text": "Hi Kirsty, In order to hide the board between the tiers, you will need to use a board to fits the cake that is sitting on it exactly. So in this case you will need to use an 8 inch round board. I usually recommend up to 2 inches or more wider than the bottom cake tier for the board that the cake will sit on. This will include: - Wooden dowels-you can buy these at cake stores, they are usually only 30 cm long (see pic) or you can also go to Bunnings and get their wooden dowels approx 5-8 mm in diameter, these are like 1 m long. Note-you will need 1 longer central dowel to go through the total height of the cake."}, {"url": "http://www.thatreallyfrostsme.com/2010/04/cake-boards.html", "passage_text": "Cake boards are what you build your cakes on and use between tiers on a stacked cake. You could certainly use a platter or plate for the base, which I have done many times. This post will show you how to make them out of cardboard. I have made cardboard cake boards common practice in my kitchen for a few reasons. Once you have the correct size and shape of cardboard pieces, get some elmer's glue or something similar. Put the glue between the layers on your multi-layer bottom cake board. I have used tape to hold the boards together but it showed through the contact paper in the next step."}, {"url": "http://www.thatreallyfrostsme.com/2010/05/stacking-tiered-cake.html", "passage_text": "Yes, the top tier has a cake board. The dowels are the exact height of the lower tier. I do not push them down for the last inch because it helps to catch the top tier and get your fingers out of the way. The weight of the top tier will then press the dowels all the way down. The dowels do not poke into the top tier. Push it down until it touches the cake board. Mark the dowel at the top of the cake and remove. Cut the dowel at that mark. I use big kitchen scissors to cut mine, you know, the kind that cut chicken bones."}]