[{"url": "http://blog.odotech.com/part-brain-smell-special-guest-author-edition", "passage_text": "There is a second special characteristic of the sense of smell. For all the other senses (seeing, hearing, tasting, touching), the information from the sensory organs (the eyes, the ears, the skin, the tongue) travels through a brains structure called the thalamus (from Greek: room)."}, {"url": "http://www.brainandspine.org.uk/anatomy-brain", "passage_text": "Parietal lobe. The parietal lobe gives you a sense of 'me'. It figures out the messages you receive from the five senses of sight, touch, smell, hearing and taste. This part of the brain tells you what is part of the body and what is part of the outside world."}, {"url": "http://answers.google.com/answers/threadview/id/95932.html", "passage_text": "Subject: Re: part of brain that associate with the five senses (taste, smell, etc.) From: tehuti-ga on 01 Nov 2002 17:36 PST. Subject: Re: part of brain that associate with the five senses (taste, smell, etc.) From: aceresearcher-ga on 02 Nov 2002 05:27 PST. Subject: Re: part of brain that associate with the five senses (taste, smell, etc.) From: 20021104-ga on 04 Nov 2002 13:31 PST. Subject: Re: part of brain that associate with the five senses (taste, smell, etc.) From: unstable-ga on 04 Nov 2002 17:51 PST."}, {"url": "http://www.tsbvi.edu/seehear/summer05/smell.htm", "passage_text": "The sense of smell, just like the sense of taste, is a chemical sense. They are called chemical senses because they detect chemicals in the environment, with the difference being that smell works at dramatically larger distances than that of taste. The process of smelling goes more or less like this:"}, {"url": "http://www.tsbvi.edu/seehear/summer05/smell.htm", "passage_text": "The olfactory bulb is one of the structures of the limbic system and a very ancient part of the brain. As mentioned in the previous description of the olfactory process, the information captured by the sense of smell goes from the olfactory bulb to other structures of the limbic system."}, {"url": "http://www.tsbvi.edu/seehear/summer05/smell.htm", "passage_text": "All of this is very valuable information. The sense of smell is a strong sense for identification purposes and can have a strong impact in your brain because it is such an integral part of it (to the point that strong chemical smells can definitely elicit seizures)."}]