[{"url": "http://www.eduers.com/mcat/exam.htm", "passage_text": "The four timed sections include verbal reasoning, physical sciences, the writing sample, and biological sciences. How Long Is the MCAT? TOTAL TIME: Approximately 5 hours and 45 minutes, plus 1 hour for lunch, 20 minutes for breaks, and 45-60 minutes spent filling out personal information. Use CollegeQuest to find a school that best fits you. The MCAT stands for Me dical College Admission Test. Unlike the GRE CAT, the MCAT lasts twice as long and covers a broader range of verbal, science, and writing components. Most medical schools assess your academic prowess from your transcript and your MCAT score; the MCAT indicates whether you possess a solid foundation to build a successful medical career"}, {"url": "http://www.princetonreview.com/medical/mcat-sections", "passage_text": "The MCAT is a 7 1/2 hour exam that consists of four sections: Physical Sciences, Verbal Reasoning, Biological Sciences, and a Writing Sample. More about the MCAT Tests: "}, {"url": "http://novapress.net/mcat/", "passage_text": "The MCAT (Medical College Admission Test) is a 5.5-hour test, consisting of 4 sections: Verbal Reasoning, Physical Sciences, Biological Sciences, and a Writing Sample. The science portions of the MCAT consist mainly of a series of passages, each with several questions or problems. Often the passages involve unfamiliar situations and, rather than numbers, explanations, relationships among various quantities, and extrapolations to new situations."}, {"url": "http://mcat-review.org/", "passage_text": "You want to review for the MCAT in the most efficient way. First, review only the topics that will be on the exam. Second, review these exam topics with the test in mind. What this means is that you must do content review in conjunction with working real exam questions. If you just do content review alone, then you'll end up forgetting most of what you went over. To sum things up, review for the MCAT effectively by going over the official test topics published by the AAMC. Use the online notes here to guide your studies. And remember, do not wait until the last minute to take past MCAT exams. Start doing MCAT questions as early as possible, in conjunction with content review."}, {"url": "http://portal.mcatquestion.com/whats-not-on-the-mcat/", "passage_text": "1 The only sections will be Physical Sciences, Verbal Reasoning, and Biological Sciences. 2  There will also be an optional section at the end of the test that is intended to be a transition into the MCAT in 2015, but will not contribute to your overall score. 3  Save your essay-writing chops for med school apps! MCAT. Everyone talks about what you can expect to see on the MCAT, but it’s hard to figure out what information won’t be on the exam. For some topics (like quantum physics or astronomy), it’s commonly understood that they’re not tested."}, {"url": "http://novapress.net/mcat/", "passage_text": "Each MCAT section is assigned a numerical score from 1 to 15, with 15 being the highest. The essays are assigned a letter score from J to T, with T being the highest. You will receive your scores by first-class mail in approximately 60 days after the test date. The science portions of the MCAT consist mainly of a series of passages, each with several questions or problems. Often the passages involve unfamiliar situations and, rather than numbers, explanations, relationships among various quantities, and extrapolations to new situations."}, {"url": "http://novapress.net/mcat/", "passage_text": "The physical sciences test covers physics and general chemistry. The biological sciences test covers biology and organic chemistry, with concentration on biology. The science portions of the MCAT consist mainly of a series of passages, each with several questions or problems. Often the passages involve unfamiliar situations and, rather than numbers, explanations, relationships among various quantities, and extrapolations to new situations."}, {"url": "http://www.experts123.com/q/what-topics-does-the-mcat-cover.html", "passage_text": "0 the biological sciences section of the mcat encompasses topics in biology and organic chemistry the physical sciences section covers general chemistry and general physics non calculus based the verbal reasoning section has passages from many areas social sciences ecology political sciences the humanities and arts the writing sample consists of two essays on a topic that will be provided"}]