[{"url": "https://www.bgi-usa.com/bougainvillea-care/", "passage_text": "Bougainvillea are tropical plants that thrive in areas outdoors with low rainfall and intense heat. For maximum blooming, they need direct sunlight for at least 5 hours per day. For best results, night temperatures should stay above 60°F (15°C) while daytime temperatures can exceed 100°F (38°C) without ill effect. "}, {"url": "http://www.wikihow.com/Prune-Bougainvillea", "passage_text": "Bougainvillea is a climbing, flowering vine or shrub native to Brazil. This tropical perennial gained its nickname, paper flower, for its delicate bracts that come in a variety of colors, including purple, red and orange. 1 When learning how to prune bougainvillea, keep in mind that the more often you prune off dead blooms, the more new blooms your plant will produce. 2  Pinch pruning is easy and quick, and is the best method to use in between pruning with shears. 3  It can also be done any time of year and as often as you lik"}, {"url": "http://www.bhg.com/gardening/plant-dictionary/vine/bougainvillea/", "passage_text": "Bougainvillea. Bougainvillea is one of the showiest vines you can grow. The large plant practically smothers itself in big clusters of papery bracts. These bracts appear in bold shades of pink, lavender, red, gold, or orange and create a display you can see a block away. While bougainvillea is tropical, it's usually grown as an annual in cold-winter areas."}, {"url": "http://gardeningsolutions.ifas.ufl.edu/plants/ornamentals/bougainvillea.html", "passage_text": "Bougainvillea. Photo: Dan Culbert. Bougainvillea is a tropical vining shrub that comes in a wide array of bright and fanciful colors. The flowers are actually modified leaves, called bracts, that are long-lasting and bright. The colorful bracts outshine the plant's true (but tiny) flower, much like a poinsettia. "}, {"url": "https://www.bgi-usa.com/bougainvillea-101/", "passage_text": "Along with palms, sunshine, and beaches, the cascading blooms of bougainvillea provide one of Florida’s signature tropical images. As a profuse bloomer, bougainvillea is most striking during the winter, when it is at its peak and few other plants are able to provide color. Bougainvillea are tropical and must be protected from frost. In Zone 8 and cooler, you are almost limited to growing them in some kind of container unless you treat them as an annual (plant a new plant outdoors each year). Bougainvillea thrives in full sun."}, {"url": "https://en.wikipedia.org/wiki/Bougainvillea", "passage_text": "Bougainvillea (/ˌbuːɡɨnˈvɪliə/ or /ˌboʊɡɨnˈvɪliə/) is a genus of thorny ornamental vines, bushes, and trees with flower-like spring leaves near its flowers. Different authors accept between four and 18 species in the genus. "}, {"url": "http://www.south-florida-plant-guide.com/bougainvillea-tree.html", "passage_text": "But a bougainvillea standard (meaning a shrub trained to grow as a tree) is often easier to maintain than the vine or shrub form. You can get in closer to the plant because you're trimming it often and the base is not full of branches that can reach out and grab you. "}, {"url": "http://www.wikihow.com/Grow-Bougainvillea", "passage_text": "1. Decide whether to plant in the ground or in a pot. Bougainvillea thrives in places that are hot and relatively dry. If you want to keep bougainvillea outdoors all year long, it's best to be in hardiness zone 9 or higher. If you're in a colder, wetter zone, you can still grow bougainvillea if you plant it in a pot and bring it indoors for the winter. 1  Bougainvillea do best when night temperature don't drop below 60 °F (16 °C) and daytime temperatures don't exceed 100 °F (38 °C). Plant the bougainvillea. Dig a hole as deep as the bougainvillea plant's root ball. Add a high-phosphate fertilizer to the hole to promote root growth and help the flowers bloom. Lift the bougainvillea plant from its container and wet the root ball into the hole."}, {"url": "http://www.south-florida-plant-guide.com/dwarf-bougainvillea.html", "passage_text": "Dwarf bougainvilleas have thorns but because they're smaller overall than full-size varieties, they won't tear you to bits. Sunvilleas (like the Pixie variety, covered under the 4-6' Shrubs section) have dense foliage that covers up the thorns on their stems. Bougainvilleas bloom on and off all year-even in winter. The flower of any bougainvillea plant is actually the tiny white blossom...the colorful parts are the flower bracts that encircle the little white blooms. Bougainvillea spp. Dwarf bougainvillea provides glorious color to your landscape without the rampant growth of full size varieties. The most well-known dwarf variety is Helen Johnson bougainvillea. This is a versatile and hardy shrub you can keep trimmed to 3 feet."}]