[{"url": "http://www.militarydegreeprograms.org/faq/dea-fbi-or-cia-which-branch-is-easier-to-be-accepted-into/", "passage_text": "Working in the DEA. To become a DEA Special Agent you must be 21 years of age and no older than 36 upon time of application. Most candidates have a bachelor’s or master’s degree in Criminal Justice or related disciplines. You are tested for acute hearing and need exceptional distance vision."}, {"url": "http://www.drugenforcementedu.org/", "passage_text": "In order to become a special agent with the DEA, candidates should meet the following minimum requirements: 1  Bachelor’s degree or higher (may be waived for candidates with extensive and closely related law enforcement experience)."}, {"url": "http://www.degreetree.com/resources/how-to-become-a-dea-agent", "passage_text": "The requirements to become a dea agent are complex. The Most Competitive candidates possess a bachelor's or master's degree, along with a GPA of 2.95 or higher. Special consideration is given to candidates with degrees in. 1  Criminal Justice or Police Science or other related disciplines; 2  Finance. 3  Accounting. 4  Economics."}, {"url": "http://www.criminaljusticeinformation.com/professions/dea-agent-job-description-salary-and-training", "passage_text": "For a DEA special agent, the starting salary is approximately $49,746 for someone at the GS-7 level and $55,483 for someone at level GS-9."}, {"url": "http://www.criminaljusticeinformation.com/professions/dea-agent-job-description-salary-and-training", "passage_text": "Special agents for the DEA need to have a bachelor’s, master’s, LL.B. or J.D. degree. A grade point average of at least 2.95 is also required. Applicants with degrees in criminal justice, police science or a related area will get special consideration."}, {"url": "http://criminaljusticeonlineblog.com/dea-careers/", "passage_text": "DEA Special Agent Requirements. Applicants must be at least 21 years of age and no more than 36 years of age at the time of appointment. Competitive candidates for these coveted positions have a bachelor’s or master’s degree with a GPA of 2.95 or higher."}]