[{"url": "http://www.glassforeurope.com/en/products/main-types-of-glass.php", "passage_text": "Annealed glass. Annealed glass is the basic flat glass product that is the first result of the float process. It is common glass that tends to break into large, jagged shards. It is used in some end products and often in double-glazed windows. Extra clear glass. Extra clear glass is not the result of processing of annealed glass, but instead a specific type of melted glass. Extra clear glass differs from other types of glass by its basic raw material composition."}, {"url": "https://en.wikipedia.org/wiki/Laminated_glass", "passage_text": "Laminated glass is also used to increase the sound insulation rating of a window, where it significantly improves sound attenuation compared to unlaminated glass panes of the same thickness. For this purpose a special acoustic PVB compound is used for the interlayer. Laminated glass is normally used when there is a possibility of human impact or where the glass could fall if shattered and also for architectural applications. Skylight glazing and automobile windshields typically use laminated glass."}, {"url": "http://www.answers.com/Q/What_is_the_difference_between_tempered_glass_and_annealed_glass", "passage_text": "Tempered glass and standard annealed glass are made the same way. The difference is in the cooling process. Tempered is cooled very quickly. This produces a stronger glass. Annealed is cooled slowly, producing a strong glass, but not as strong as tempered. Yes, both are different. Tempered glass is made by heating annealed (normal float) glass above 6000C and then fast cooling, this makes the glass 4 to 5 times stronger than no … rmal glass. Tempered glass breaks into small circular fragments, while normal glass breaks into sharp pieces."}, {"url": "https://en.wikipedia.org/wiki/Laminated_glass", "passage_text": "Modern laminated glass is produced by bonding two or more layers of ordinary annealed glass (or tempered glass) together with a plastic interlayer, usually polyvinyl butyral or ethylene-vinyl acetate (EVA). Laminated glass is normally used when there is a possibility of human impact or where the glass could fall if shattered and also for architectural applications. Skylight glazing and automobile windshields typically use laminated glass."}, {"url": "https://www.onedayglass.com/types-of-tempered-glass/annealed-glass/", "passage_text": "Tempering glass is the method of strengthening annealed glass. Annealed glass is created by slowly cooling the glass and is ideal when it serves as a cabinet doors and sometimes furniture coverings. While tempered glass and annealed glass are both viable options, annealed glass does lack the safety features of tempered glass. Again, tempered glass should be used when there is a chance of breakage due to impact or moderate heat because of its extreme durability and to reduce damage that could occur. For many jobs, price is a significant factor – and this is where annealed glass has an obvious advantage over"}, {"url": "https://en.wikipedia.org/wiki/Architectural_glass", "passage_text": "Laminated glass that is made up of annealed glass is normally used when safety is a concern, but tempering is not an option. Windshields are typically laminated glasses. When broken, the PVB layer prevents the glass from breaking apart, creating a spider web cracking pattern. Architectural glass is glass that is used as a building material. It is most typically used as transparent glazing material in the building envelope, including windows in the external walls. Glass is also used for internal partitions and as an architectural feature"}, {"url": "http://www.nationalglass.com.au/catalogues/NGP_Section_05.pdf", "passage_text": "The glass is generally not as flat as ordinary annealed glass. Therefore a thicker interlayer is utilised to adequately bond the glass and interlayer;0 Glass panel edges – Laminated glass must have ‘good’ straight clean cut edges with minimal defects. The glass and interlayer are bonded together by heat and pressure in an autoclave. Generally this interlayer is 0.38mm thick for annealed glass but other thicknesses are available. 05 laminated safety glass 30 laminated glass features and applications 0 Safety – Grade A safety glass which meets AS1288 requirements."}, {"url": "https://en.wikipedia.org/wiki/Laminated_glass", "passage_text": "Laminated glass is a type of safety glass that holds together when shattered. In the event of breaking, it is held in place by an interlayer, typically of polyvinyl butyral (PVB) or ethylene-vinyl acetate (EVA), between its two or more layers of glass. Laminated glass is normally used when there is a possibility of human impact or where the glass could fall if shattered and also for architectural applications. Skylight glazing and automobile windshields typically use laminated glass."}]