[{"url": "http://www.buildabear.com/shopping/contents/contents.jsp?catId=&id=2300007", "passage_text": "1 The Build-A-Bear Workshop Foundation is funded through pin pad donations taken at registers and by the sale of purple satin hearts ($1 each) in Canada. 2  It is a public foundation that supports children, families and animals along with associate assistance programs. 1 The Build-A-Bear Workshop process allows Guests to make a furry friend that is special and unique. 2  At Choose Me, Guests are introduced to all the furry characters in the store and then select one, which soon becomes their new friend."}, {"url": "http://www.buildabear.com/shopping/contents/contents.jsp?catId=&id=2300007", "passage_text": "1 The Build-A-Bear Workshop Bear Hugs Foundation is funded through the sale of special animals in our stores. 2  It is a private foundation that provides grants to children's health and wellness, literacy and domestic pet programs. 1 The Build-A-Bear Workshop process allows Guests to make a furry friend that is special and unique. 2  At Choose Me, Guests are introduced to all the furry characters in the store and then select one, which soon becomes their new friend."}, {"url": "http://www.buildabear.com/shopping/contents/contents.jsp?catId=&id=2300007", "passage_text": "1 Our Guests are passionate about and feel ownership of our brand. 2  At Build-A-Bear Workshop, our Guests are the heart of our business. 3  They inspire us, they challenge us and they make us smile. 4  Our consumer-centric focus is what makes us the company we are today: innovative, curious, successful and growing. 1 The Build-A-Bear Workshop process allows Guests to make a furry friend that is special and unique. 2  At Choose Me, Guests are introduced to all the furry characters in the store and then select one, which soon becomes their new friend."}, {"url": "http://www.referenceforbusiness.com/history2/44/Build-A-Bear-Workshop-Inc.html", "passage_text": "Kansas City Equity Partners invested in the company, leading Build-A-Bear to open its second store in Overland Park near Kansas City, Kansas, in August 1998. A $4.5 million investment from Windsor Capital funded the opening of two stores in the Chicago area. With additional investment funds Build-A-Bear accelerated expansion, as Clark aimed to meet her goal of operating 100 stores in 2002. Walnut Capital Partners invested more than $60 million to fund new store development in 2000 and 2001."}, {"url": "http://www.csrwire.com/press_releases/17573-Build-A-Bear-Workshop-Bear-Hugs-Foundation-Awards-Grants-to-Programs-Supporting-Children-s-Health-and-Welfare-in-North-America-", "passage_text": "Build-A-Bear Workshop, Inc. is the only global company that offers an interactive make-your-own stuffed animal retail-entertainment experience. Founded in St. Louis in 1997, the company currently operates more than 300 stores in the United States, Puerto Rico, Canada, the United Kingdom, Ireland and France. Build-A-Bear Workshop Guests live by the teddy bear philosophy of being good members of the community and the world, said Matt Oldani, manager of the Build-A-Bear Workshop Bear Hugs Foundation. One way our Guests carry out this ideal is by purchasing cause animals like Champ."}, {"url": "http://www.hoovers.com/company-information/cs/company-profile.Build-A-Bear_Workshop_Inc.23d33aa3304cf38a.html", "passage_text": "Build-A-Bear, founded by CEO Maxine Clark in 1997, boasts more than 300 stores in the US, Puerto Rico, Canada, the UK, and Ireland, as well as about 85 franchised locations across Europe, Asia, Australia, and Africa. The Build-A-Bear Workshop covers the bear necessities and much more. Located mainly in malls, the company's stores allow kids to design their own teddy bears and other stuffed animals complete with clothing (formal wear to western wear), shoes (including."}, {"url": "http://corporateofficehq.com/build-a-bear-corporate-office/", "passage_text": "Build A Bear Workshop History. Build-A-Bear Workshop was founded in 1997 by current CEO Maxine Clark. The first workshop was in the Saint Louis Galleria. In 2006, the company acquired the Bear Factory, a London based business owned by Hamleys. By 2007, there were over 400 stores and over 50 million bears had been sold"}, {"url": "http://www.referenceforbusiness.com/history2/44/Build-A-Bear-Workshop-Inc.html", "passage_text": "History of Build-A-Bear Workshop Inc. Located in upscale, family-oriented shopping malls, Build-A-Bear Workshop Inc. owns and operates more than 150 stores in 35 states in the United States and three provinces in Canada. Retail store developments in Europe and Asia occur through franchise agreement. With additional investment funds Build-A-Bear accelerated expansion, as Clark aimed to meet her goal of operating 100 stores in 2002. Walnut Capital Partners invested more than $60 million to fund new store development in 2000 and 2001."}]