[{"url": "https://answers.yahoo.com/question/index?qid=20080404163517AAsr3cB", "passage_text": "Report Abuse. Well the chlorophyll helps the plant go through photosynthesis by absorbing the the light into the plant and transferring it into food. The definition for chlorophyll is the pigment in green plants that absorbs solar energy. Now chlorophyll a is important because chlorophyll is the molecule found in all plant cells and therefore its concentration is what is reported during chlorophyll analysis. During this process of photosynthesis, chlorophyll produces energy, in the form of sugary carbohydrates, which will power all of the plant's essential growth and development. This amazing molecule also gives plants their distinctive green color."}, {"url": "http://www.bbc.co.uk/schools/gcsebitesize/science/add_aqa_pre_2011/plants/plants1.shtml", "passage_text": "Green plants absorb light energy using chlorophyll in their leaves. They use it to react carbon dioxide with water to make a sugar called glucose. The glucose is used in respiration, or converted into starch and stored. Oxygen is produced as a by-product. This process is called photosynthesis. Photosynthesis [photosynthesis: The chemical change that occurs in the leaves of green plants. It uses light energy to convert carbon dioxide and water into glucose. Oxygen is produced as a by-product of photosynthesis. ] is the chemical change which happen"}, {"url": "http://www.answers.com/Q/Why_is_chlorophyll_needed_for_photosynthesis", "passage_text": "Yes, because chlorophyll gives foliage the green pigment needed for photosynthesis to occurr. It is needed because with it there are chloroplasts in the foliage which ab … sorb the sunlight producing oxygen for us life forms. Chlorophyll is a green pigment, that can be found in most plants. It absorbs sun light, the energy source for Photosynthesis, and is essential for plants to make food."}, {"url": "https://en.wikipedia.org/wiki/Chlorophyll", "passage_text": "Chlorophyll (also chlorophyl) is a term used for several closely related green pigments found in cyanobacteria and the chloroplasts of algae and plants. Its name is derived from the Greek words χλωρός, chloros (green) and φύλλον, phyllon (leaf). The function of the vast majority of chlorophyll (up to several hundred molecules per photosystem) is to absorb light and transfer that light energy by resonance energy transfer to a specific chlorophyll pair in the reaction center of the photosystems."}, {"url": "http://www.chm.bris.ac.uk/motm/chlorophyll/chlorophyll_h.htm", "passage_text": "Chlorophyll is the molecule that absorbs sunlight and uses its energy to synthesise carbohydrates from CO 2 and water. This process is known as photosynthesis and is the basis for sustaining the life processes of all plants. Chlorophyll is the molecule that traps this 'most elusive of all powers' - and is called a photoreceptor. It is found in the chloroplasts of green plants, and is what makes green plants, green. The basic structure of a chlorophyll molecule is a porphyrin ring, co-ordinated to a central atom."}, {"url": "https://sg.answers.yahoo.com/question/index?qid=20070718051122AAsgE2h", "passage_text": "Relevance. Rating Newest Oldest. Best Answer: Definitely, chlorophyll is necessary for photosynthesis. Chlorophyll functions to absorb light and transfer that light energy by resonance energy transfer to a specific chlorophyll pair in the reaction center of the photosystems. There is a simple experiment that can show how chlorophyll is needed for photosynthesis. "}, {"url": "http://www.answers.com/Q/Why_is_chlorophyll_needed_for_photosynthesis", "passage_text": "Chlorophyll is the molecule that absorbs sunlight and uses its  energy to synthesis carbohydrates from CO2 and water. This process  is known as photosynthesis and is the bas … is for sustaining the life  processes of all plants. Chlorophyll is a green pigment, that can be found in most plants. It absorbs sun light, the energy source for Photosynthesis, and is essential for plants to make food."}, {"url": "http://www.answers.com/Q/Why_is_chlorophyll_needed_for_photosynthesis", "passage_text": "Confidence votes 75. Chlorophyll is the molecule that absorbs sunlight and uses its energy to synthesis carbohydrates from CO2 and water. This process is known as photosynthesis and is the basis for sustaining the life processes of all plants. Chlorophyll is a green pigment, that can be found in most plants. It absorbs sun light, the energy source for Photosynthesis, and is essential for plants to make food."}, {"url": "https://answers.yahoo.com/question/index?qid=20080404163517AAsr3cB", "passage_text": "Best Answer: Chlorophyll makes it possible for plants to convert carbon dioxide and water, in the presence of sunlight, into oxygen and glucose. During this process of photosynthesis, chlorophyll produces energy, in the form of sugary carbohydrates, which will power all of the plant's essential growth and development. This amazing molecule also gives plants their distinctive green color."}]