[{"url": "https://en.wikipedia.org/wiki/United_States_Department_of_Defense", "passage_text": "In addition, four national intelligence services are subordinate to the Department of Defense: the Defense Intelligence Agency (DIA), the National Security Agency (NSA), the National Geospatial-Intelligence Agency (NGA), and the National Reconnaissance Office (NRO). The Department of Defense is responsible for 93% of all US government fuel consumption in 2007 (Department of the Air Force: 52%; Department of the Navy: 33%; Department of the Army: 7%; other Department components: 1%)."}, {"url": "http://www.encyclopedia.com/topic/United_States_Department_of_Defense.aspx", "passage_text": "DEFENSE, DEPARTMENT OF (DOD), established by the National Security Act (1947), was initially named the National Military Establishment (NME). Including cabinet departments of the army, navy, and air force, the Joint Chiefs of Staff, and several other defense agencies, the NME replaced the War and Navy departments. The Dept. of Defense was created by the National Security Act of 1947 by combining the Depts. of War and Navy and was called the National Military Establishment; it became the Dept. of Defense when the act was amended (1949). James V. Forrestal pioneered in this reorganization."}, {"url": "http://www.dod.gov/pubs/dod101/", "passage_text": "The U.S. Air Force was also created, along with a new Department of the Air Force. The War Department was converted to the Department of the Army. Finally, the three services, Army, Navy, and Air Force, were placed under the direct control of the new Secretary of Defense. The Department of the Navy, was founded in 1798. The Coast Guard (part of Homeland Security in peacetime), can trace it's history back to 1790. Congress, in 1947, established a civilian, Cabinet-level Secretary of Defense to oversee an also newly created National Military Establishment."}, {"url": "http://www.defense.gov/About-DoD", "passage_text": "History. The Army, Navy, and Marine Corps were established in 1775, in concurrence with the American Revolution. The War Department was established in 1789, and was the precursor to what is now the Department of Defense. One year later, in 1790, the Coast Guard (part of Homeland Security in peace time) was established. This was followed by the founding of the Department of the Navy in 1798. That same year, the U.S. Air Force was established followed by the founding of the Department of the Air Force. Finally, the three military branches, Army, Navy, and Air Force, were placed under the direct control of the new Secretary of Defense, confirmed by Senate."}, {"url": "http://www.dod.gov/pubs/dod101/", "passage_text": "The Army, Navy, and Marine Corps were established in 1775, in concurrence with the American Revolution. The War Department was established in 1789, and was the precursor to what is now the Department of Defense. The Department of the Navy, was founded in 1798. The Coast Guard (part of Homeland Security in peacetime), can trace it's history back to 1790. Congress, in 1947, established a civilian, Cabinet-level Secretary of Defense to oversee an also newly created National Military Establishment."}, {"url": "https://en.wikipedia.org/wiki/United_States_Department_of_Defense", "passage_text": "Beneath the Department of Defense are three subordinate military departments: the United States Department of the Army, the United States Department of the Navy, and the United States Department of the Air Force. The Department of Defense is responsible for 93% of all US government fuel consumption in 2007 (Department of the Air Force: 52%; Department of the Navy: 33%; Department of the Army: 7%; other Department components: 1%)."}, {"url": "http://www.allgov.com/departments/department-of-defense?detailsDepartmentID=569", "passage_text": "During World War I, the War Department was given supervision over the newly created National Guard, and under the National Defense Act of 1916, the officers’ reserve corps was created within the department. This act also established the office of Assistant Secretary of War to coordinate the procurement of munitions. The NME was renamed the Department of Defense (DoD) in 1949. In the succeeding years of the Cold War, the DoD (commonly referred to as the Pentagon) grew into the largest of all U.S. governmental institutions as American military operations became tantamount in U.S.-Soviet jockeying for international dominance."}, {"url": "http://www.infoplease.com/encyclopedia/history/defense-united-states-department-of-creation.html", "passage_text": "Creation. The Dept. of Defense was created by the National Security Act of 1947 by combining the Depts. of War and Navy and was called the National Military Establishment; it became the Dept. of Defense when the act was amended (1949). James V. Forrestal pioneered in this reorganization. The Secretary of the Army, the Secretary of the Navy, and the Secretary of the Air Force—made cabinet members by the act of 1947—were subordinated (1949) to give the Secretary of Defense full cabinet authority over the department."}]