[{"url": "http://boisdejasmin.com/2013/02/10-ways-to-use-rosewater-perfume-beauty-food.html", "passage_text": "3. Hair Rinse. Another way I incorporate rosewater into my beauty regimen is to use it as a hair rinse (2 Tablespoons per 1 cup of water). After I shampoo and condition my hair, I thoroughly rinse and then follow up with the rosewater mix. It’s excellent for skin and leaves a very delicate scent in my locks. I use it in my Rose and Vanilla Almond Oil, or if I’m pressed for time, I mix rosewater and my regular body cream. You can also add it to scrubs and directly into bath water. A rose scented bath at the end of a long day is the best antidote to stress."}, {"url": "http://www.herbalremedies.com/rosewater.html", "passage_text": "Write a Review. Description Aromatherapeutic Rosewater Concentrate is made from Rose Oil, alcohol, distilled water and Rose fragrances. Rosewater is believed to be the first modern ferfume, credited tot he famous Arabian physician Avicenna, who discovered the process of distilling oil from rose petals. Contains 2% Rose Oil. Directions Suggested Usage: This product may be used in cold creams and lotions or other cosmetic uses"}, {"url": "http://heritagestore.com/rose-petals-rosewater-concentrate.html", "passage_text": "Product Description. Rose is the Queen of Flowers in the Aromatherapy Language of Love. Subtly relaxing, harmonious and revitalizing rosewater is thought to be the original perfume first distilled from rose petals by the author of The Canon of Medicine Ibn Sina (Avicenna, 980-1037). Essential rosewater is a natural emollient and ageless beauty secret renowned to be one of Cleopatra's favorites. "}, {"url": "http://www.qacollections.com/How-to-Use-Rosewater-Concentrate", "passage_text": "Rosewater concentrate is a commercially produced byproduct of rose oil, which is typically used in the production of skin-care products and body oils. Rosewater concentrate has a beautiful, aromati... Read More ». http://www.ehow.com/how_5685956_use-rosewater-concentrate.html. Rosewater is a by-product created through the production of rose oil and is often used to make perfume and skin care products. You can make your own rosewater or purchase bottled rosewater in speci... Read More »."}, {"url": "http://healthgenesis.com/rosewater-concentrate-1-oz", "passage_text": "Rosewater Concentrate - 1 oz. Suggested Use: This product may be used in cold creams and lotions or other cosmetic uses. Also may be used in potpourri as a pleasant scent. Mix with vegetable glycerine for moisturizing use. Warnings: None. "}, {"url": "http://www.herbspro.com/rosewater-concentrate-68681.html", "passage_text": "* Refreshing Condition: In need of a more affordable alternative to Rose Oil, or looking to make a refreshing facial mist. Solution: Rosewater Concentrate is made from Rose Oil, alcohol, distilled water and Rose fragrances. Rosewater is believed to be the first modern perfume, credited to the famous Arabian physician, Avicenna, who discovered the process of distilling oil from rose petals. Contains 2% pure Rose Oil. "}, {"url": "http://www.oilsandplants.com/rosewater.htm", "passage_text": "Rosewater is a very useful adjunct to the use of essential oils, particularly in skin treatments and in the care of the eyes. It is obtained from rose petals by distillation. Steam is passed through the mass of rose petals, and collected in a tube which then passes through a cooling tank. "}, {"url": "http://www.vitacost.com/now-foods-solutions-rosewater-concentrate-1-fl-oz-1", "passage_text": "Condition: In need of a more affordable alternative to Rose Oil, or looking to make a refreshing facial mist. Solution: Rosewater Concentrate is made from Rose Oil, alcohol, distilled water and Rose fragrances. Rosewater is believed to be the first modern perfume, credited to the famous Arabian physician, Avicenna, who discovered the process of distilling oil from rose petals. "}]