[{"url": "http://www.insidewoodworking.com/luanplywood.html", "passage_text": "Uses For Luan Plywood. As mentioned one of the most common uses for Luan or Lauan plywood is in the manufacture of doll houses and miniature tools. Because of the wood's softness, it is often possible to stamp out these boards with a die. This is why Luan wood is often called die cut plywood, especially when it is 1/8 or ¼ inch thick. And because it is light, Luan wood can also be used in projects like kayaks. Luan Veneer. Luan (also called Lauan plywood) is made from trees in the Shorea family of trees. Manufacturers create veneer from these trees, which are typically either White Lauan (created from Shorea almon) or Red Lauan (from Shorea negrosensis), and this veneer is glued together in layers to make the plywood"}, {"url": "http://theplywood.com/luan", "passage_text": "Views: 7653. Luan or Lauan plywood is made from the wood of the Lauan tree from the South Pacific Rim. Lauan wood is usually referred to a medium-grade Philippine mahogany. This produces a very lightweight wood that is softer than most softwood plywood. The surface finish of Luan plywood is very smooth, mostly without defects. Luan is typically only manufactured in 1/4 inch thickness, although you can find it as thin as 1/8 inch at times. Being so thin, it’s utility for furniture and construction is somewhat limited. The thickness table makes it easier to compare and the plywood prices chart makes Luan available for every budget."}, {"url": "http://homeguides.sfgate.com/luan-wood-99466.html", "passage_text": "Characteristics. The term luan comes from the lauan tree, native to the Philippines and other Southeast Asian countries. It is also sometimes called Philippine mahogany or meranti. Nowadays, manufacturers create veneer from either white lauan (Shorea almon) or red lauan (S. negrosensis). Uses. Because of its pliable nature, luan is an excellent product for dollhouses, toys and other small craft projects that require thin wooden panels. It is used to make small boats and tools as well. It is easy to die-cut small parts out of the plywood."}, {"url": "http://ths.gardenweb.com/discussions/2646884/what-is-luan", "passage_text": "tom999. luan is a type of wood, plywood is a type of wood panel, made up of plys or layers of thin wood veneer, glued togather with the grain running across the preceeding layer. Typically luan is made as plywood. Luan is an inexpensive alternative to pine or fir plywood. Luan is typically used in interior applications, such as an underlayment for vinyl flooring. It's also used to make hollow core interior doors. I'm not sure what the core material is. I suspect it is some kind of compressed wood fiber material. I also do not know if the glue is rated for exterior use"}, {"url": "http://ths.gardenweb.com/discussions/2646884/what-is-luan", "passage_text": "luan is a type of wood, plywood is a type of wood panel, made up of plys or layers of thin wood veneer, glued togather with the grain running across the preceeding layer. Typically luan is made as plywood. Luan is typically used in interior applications, such as an underlayment for vinyl flooring. It's also used to make hollow core interior doors. I'm not sure what the core material is. I suspect it is some kind of compressed wood fiber material. I also do not know if the glue is rated for exterior use"}, {"url": "http://homeguides.sfgate.com/luan-wood-99466.html", "passage_text": "Luan, also spelled lauan, refers to a tropical hardwood plywood product usually made from trees in the Shorea family. It has many home and hobby applications and is readily available at lumberyards and home improvement stores. The term typically refers to a plywood panel 1/4 or, less commonly, 1/8 inch thick. Uses. Because of its pliable nature, luan is an excellent product for dollhouses, toys and other small craft projects that require thin wooden panels. It is used to make small boats and tools as well. It is easy to die-cut small parts out of the plywood."}]