[{"url": "http://www.realsimple.com/food-recipes/browse-all-recipes/baked-sweet-potatoes", "passage_text": "Directions. 1  Heat oven to 400° F. Pierce each sweet potato several times with the tines of a fork. 2  Place the sweet potatoes on a rimmed baking sheet lined with foil. 3  Bake until tender, about 45 minutes. 4  Make a slit in the top of each sweet potato. 5  Top with 1 tablespoon of butter and season with the salt and pepper. 1 Place the sweet potatoes on a rimmed baking sheet lined with foil. 2  Bake until tender, about 45 minutes. 3  Make a slit in the top of each sweet potato. 4  Top with 1 tablespoon of butter and season with the salt and pepper."}, {"url": "http://www.simplyrecipes.com/recipes/oven_baked_sweet_potato_fries/", "passage_text": "Another commenter recommends preheating the baking sheet, to help the fries get crisp.). 5 Bake for a total of 25 to 30 minutes. After the first 15 minutes, remove the baking sheet from the oven and turn over all of the sweet potato pieces. Return to the oven and bake for another 10-15 minutes, or until they are well browned. Let cool for 5 minutes before serving"}, {"url": "http://www.ncsweetpotatoes.com/how-to-cook-sweet-potatoes/bake-sweet-potatoes/", "passage_text": "Baking Sweet Potatoes. 1  Preheat oven to 400°F. 2  With a fork, pierce sweet potato skin 5-6 times. 3  Place on baking sheet lined with foil. 4  Bake until tender, 45 minutes to 1 hour. "}, {"url": "http://www.foodnetwork.com/recipes/tyler-florence/roasted-sweet-potatoes-with-honey-butter-recipe.html", "passage_text": "Directions. Preheat oven to 375 degrees F. Lay the sweet potatoes out in a single layer on a roasting tray. Drizzle the oil, honey, cinnamon, salt and pepper over the potatoes. Roast for 25 to 30 minutes in oven or until tender. Take sweet potatoes out of the oven and transfer them to a serving platter. "}, {"url": "http://www.simplyrecipes.com/recipes/oven_baked_sweet_potato_fries/", "passage_text": "The baking times are approximate; it depends on how thick you cut the wedges or rounds of sweet potatoes. Try to cut them evenly so they all cook at about the same rate. For best browning results bake only one sheet at a time. 5 Bake for a total of 25 to 30 minutes. After the first 15 minutes, remove the baking sheet from the oven and turn over all of the sweet potato pieces."}, {"url": "http://www.wikihow.com/Bake-Sweet-Potatoes", "passage_text": "Bake the fries. Bake the sweet potato fries for 15 or 20 minutes. Remove the baking sheet from the oven and stir the fries, flipping them to the other side. Bake for 5 to ten more minutes, or until the fries are lightly browned and crispy around the edges. 3. Bake the sweet potatoes. Place the sweet potatoes directly on the rack in your oven, or on a baking sheet if you prefer. Bake for about 45 minutes, or until they feel soft inside when you poke them with a fork. Remove them from the oven and allow them to cool"}, {"url": "http://chocolatecoveredkatie.com/2013/02/25/crispy-homemade-sweet-potato-fries/", "passage_text": "Instructions. How to make crispy sweet potato fries: Preheat oven to 400F and grease a baking sheet. Cut the potatoes into fry shapes (thick or thin), then soak them in water for around 45 minutes. "}, {"url": "http://www.realsimple.com/food-recipes/browse-all-recipes/baked-sweet-potatoes", "passage_text": "1 Heat oven to 400° F. Pierce each sweet potato several times with the tines of a fork. 2  Place the sweet potatoes on a rimmed baking sheet lined with foil. 3  Bake until tender, about 45 minutes. 4  Make a slit in the top of each sweet potato. 1 Place the sweet potatoes on a rimmed baking sheet lined with foil. 2  Bake until tender, about 45 minutes. 3  Make a slit in the top of each sweet potato. 4  Top with 1 tablespoon of butter and season with the salt and pepper."}]