[{"url": "http://outlanderlists.weebly.com/jamies-outlander-timeline.html", "passage_text": "Jamie manages to get back to Cranesmuir just in time to prove Claire is not a witch by flinging her jet rosary over her head, as jet is said to burn a witch's skin. With the help of Geillis, Jamie gets Claire away from the mob (Outlander, chapter 25)Jamie forces Claire to tell the truth about who she really is. In an act of utter selflessness and love Jamie takes Claire to Craigh na Dun so that she can go back home to Frank."}, {"url": "http://outlander.wikia.com/wiki/Jamie_Fraser", "passage_text": "1 SPOILER: The ghost that Frank sees in Outlander is Jamie, and Diana has revealed that ghost-Jamie is about 25 years old. 2  Diana Gabaldon was inspired to create the Outlander series after watching an episode of Doctor Who on PBS. 3  The episode was part of the serial titled  The War Games  from 1969."}, {"url": "http://outlanderlists.weebly.com/jamies-outlander-timeline.html", "passage_text": "When Randall holds a knife to Claire's throat Jamie offers himself to Randall on the condition that he will let Claire go-an offer that Randall accepts (Outlander, chapter 35) Randall abuses Jamie physically and mentally to the extent that Jamie wishes he were dead."}, {"url": "http://outlander.wikia.com/wiki/Dragonfly_in_Amber", "passage_text": "Once in Scotland, Claire and Jamie settle in to farm life at Jamie's home at Lallybroch with his sister, Jenny, and her family. However Jamie receives a letter from Charles Stuart announcing his attempt to retake the throne of Scotland."}, {"url": "http://www.dianagabaldon.com/books/outlander-series/voyager/", "passage_text": "He was dead. However, his nose throbbed painfully, which he thought odd in the circumstances.. Thus begins the third book in the OUTLANDER series, in which we learn that—despite his best efforts—Jamie Fraser did not die on the battlefield at Culloden. He isn’t pleased. Back in the 20th century, Claire is equally shocked by the revelation of Jamie’s survival—but much more pleased about it."}, {"url": "http://outlander.wikia.com/wiki/Dragonfly_in_Amber", "passage_text": "Dragonfly in Amber is the second novel in the Outlander series by Diana Gabaldon. In 1968, Claire Randall brings her daughter Brianna to Scotland on holiday, and introduces her to the young historian Roger Wakefield, for whom Claire has a few research requests concerning the Jacobite Rising of 1745."}, {"url": "http://outlander.wikia.com/wiki/Jamie_Fraser", "passage_text": "Personal History Edit. Jamie was born to Ellen and Brian Fraser in the Scottish Highlands, at their family home of Lallybroch. He was very close to his older brother, William, and was devastated when his brother died of smallpox when Jamie was only six or so."}]