[{"url": "http://www.tpub.com/neets/book7/25a.htm", "passage_text": "For instance, notice the NPN transistor below: NPN REVERSE-BIASED JUNCTION. - The second PN junction (base-to-collector), or reverse-biased junction as it is called (fig. 2-6), blocks the majority current carriers from crossing the junction. However, there is a very small current, mentioned earlier, that does pass through this junction. This current is called. , or. ."}, {"url": "http://qmlab.ubc.ca/ARPES/PEOPLE/Andrea/Teaching/PHYS309/lecture9.pdf", "passage_text": "These views are related by the current–voltage relation of the base–emitter junction, which is just the usual exponential current–voltage curve of a p-n junction (diode). The physical explanation for collector current is the amount of minority-carrier charge in the base region. In an NPN transistor, for example, when a positive voltage is applied to the base–emitter junction, the equilibrium between thermally generated carriers and the repelling electric field of the depletion region becomes unbalanced, allowing thermally excited electrons to inject into"}, {"url": "http://www.answers.com/Q/What_are_the_majority_carriers_in_the_base_region_of_an_npn_transistor", "passage_text": "P is for Positive and N is for Negative So basically put a PNP Transistor Would use N to Switch P, in the name PNP or NPN the first character is for the polarity of … the Collector-pin, the second for the Base-Pin, and the third for the Emmiter-pin. N-p-n transistor is made by sandwiching thin layer of p-type semiconductor between two layers of n-type semiconductor. It has three terminals, Emitter, Base and collector. The … npn transistor has two supplies, one is connected through the emitter base and one through the collector base."}, {"url": "http://www.radartutorial.eu/21.semiconductors/hl20.en.html", "passage_text": "The interaction between the forward-and reverse-biased junctions in a pnp transistor is very similar to that in an npn transistor, except that in the pnp transistor, the majority current carriers are holes. In the pnp transistor shown in figure 4, the positive voltage on the emitter repels the holes toward the base. In the reverse-biased junction (figure 3), the negative voltage on the collector and the positive voltage on the base block the majority current carriers from crossing the junction."}, {"url": "https://en.wikipedia.org/wiki/NPN_transistor", "passage_text": "A BJT consists of three differently doped semiconductor regions: the emitter region, the base region and the collector region. These regions are, respectively, p type, n type and p type in a PNP transistor, and n type, p type and n type in an NPN transistor. The remainder of the holes recombine with electrons, the majority carriers in the base, making a current through the base connection to form the base current, . As shown in the diagram, the emitter current, , is the total transistor current, which is the sum of the other terminal currents (i.e., I E = I B + I C)."}, {"url": "https://en.wikipedia.org/wiki/NPN_transistor", "passage_text": "In an NPN transistor, when positive bias is applied to the base–emitter junction, the equilibrium is disturbed between the thermally generated carriers and the repelling electric field of the n-doped emitter depletion region. This allows thermally excited electrons to inject from the emitter into the base region. The remainder of the holes recombine with electrons, the majority carriers in the base, making a current through the base connection to form the base current, . As shown in the diagram, the emitter current, , is the total transistor current, which is the sum of the other terminal currents (i.e., I E = I B + I C)."}, {"url": "http://www.radartutorial.eu/21.semiconductors/hl19.en.html", "passage_text": "Figure 4: The reverse-biased junction in an npn transistor. The second pn-junction (base-to-collector), or reverse-biased junction as it is called (figure 4), blocks the majority current carriers from crossing the junction. However, there is a very small current, that does pass through this junction. This current is called minority current, or reverse current. Since electrons are the majority carriers in the n-material, they will move through the n-material emitter to the emitter-base junction. With this junction forward biased, electrons continue on into the base region. Once the electrons are in the base, which is a p-type material, they become minority carriers."}, {"url": "http://electronics.stackexchange.com/questions/129624/if-the-depletion-layer-of-a-transistor-collector-base-junction-is-thick-why-are", "passage_text": "When the base-emitter junction is 'on', lots of holes are injected into the thin and lightly doped base region so a large fraction of the injected holes exist long enough to 'slide down' the potential and into the collector region where they are majority carriers. share | improve this answer. "}, {"url": "https://en.wikipedia.org/wiki/NPN_transistor", "passage_text": "In the NPN transistor in what is called active mode, the base–emitter voltage and collector–base voltage are positive, forward biasing the emitter–base junction and reverse-biasing the collector–base junction. The remainder of the holes recombine with electrons, the majority carriers in the base, making a current through the base connection to form the base current, . As shown in the diagram, the emitter current, , is the total transistor current, which is the sum of the other terminal currents (i.e., I E = I B + I C)."}, {"url": "http://www.allaboutcircuits.com/textbook/semiconductors/chpt-2/bipolar-junction-transistors/", "passage_text": "(a) NPN junction bipolar transistor. (b) Apply reverse bias to collector base junction. It is customary to reverse bias the base-collector junction of a bipolar junction transistor as shown in (Figure above (b). Note that this increases the width of the depletion region. NPN junction bipolar transistor with reverse biased collector-base: (a) Adding forward bias to base-emitter junction, results in (b) a small base current and large emitter and collector currents. In Figure below we take a closer look at the current amplification mechanism."}]