[{"url": "https://www.patientslikeme.com/treatments/show/12268-prexum-side-effects-and-efficacy?brand=t", "passage_text": "Perindopril is in a group of drugs called ACE inhibitors. ACE stands for angiotensin converting enzyme. Perindopril is used to treat high blood pressure (hypertension) and to prevent heart attack in people with coronary artery disease. Perindopril may also be used for other purposes not listed in this medication guide. "}, {"url": "http://www.lifescript.com/health/a-z/drugs_a-z/drugdatabase/p/perindopril_erbumine.aspx", "passage_text": "Perindopril is used alone or in combination with other medications to treat high blood pressure. Perindopril is in a class of medications called angiotensin-converting enzyme (ACE) inhibitors. It makes blood flow more smoothly by preventing the production of certain natural chemicals that tighten the blood vessels. Perindopril comes as a tablet to take by mouth. It is usually taken once or twice a day. Follow the directions on your prescription label carefully, and ask your doctor or pharmacist to explain any part you do not understand. Take perindopril exactly as directed."}, {"url": "http://www.webmd.com/drugs/2/drug-11247/perindopril-erbumine-oral/details", "passage_text": "Uses. Perindopril is used to treat high blood pressure (hypertension). Lowering high blood pressure helps prevent strokes, heart attacks, and kidney problems. This medication is also used to prevent heart attacks in patients with a certain type of heart disease (stable coronary artery disease). Perindopril belongs to a class of drugs known as ACE inhibitors. It works by relaxing blood vessels so blood can flow more easily. OTHER USES: This section contains uses of this drug that are not listed in the approved professional labeling for the drug but that may be prescribed by your health care professional."}, {"url": "http://blood-pressure.emedtv.com/perindopril/perindopril.html", "passage_text": "Perindopril, a prescription medicine, is commonly used to help control high blood pressure (also known as hypertension). Perindopril (Aceon ®) is a prescription medication that has been licensed for controlling high blood pressure (hypertension) in adults. However, the medication is not a cure for high blood pressure. Perindopril is part of a class of drugs called angiotensin-converting enzyme inhibitors, or ACE inhibitors for short. Perindopril helps to block this enzyme, which is normally part of a reaction in the body that causes the blood vessels to narrow (constrict). By blocking this enzyme, the medication causes blood vessels to relax, which can lower"}, {"url": "http://www.everydayhealth.com/drugs/perindopril", "passage_text": "Perindopril is in a group of drugs called ACE inhibitors. ACE stands for angiotensin converting enzyme. Perindopril is used to treat high blood pressure (hypertension) and to prevent heart attack in people with coronary artery disease. Perindopril may also be used for purposes not listed in this medication guide. Do not use perindopril if you are pregnant."}, {"url": "http://www.rxlist.com/aceon-drug/patient-images-side-effects.htm", "passage_text": "Perindopril is in a group of drugs called ACE inhibitors. ACE stands for angiotensin converting enzyme. Perindopril is used to treat high blood pressure (hypertension) and to prevent heart attack in people with coronary artery disease. Perindopril may also be used for purposes not listed in this medication guide."}, {"url": "https://en.wikipedia.org/wiki/Perindopril", "passage_text": "Perindopril is a long-acting ACE inhibitor used to treat high blood pressure, heart failure, or stable coronary artery disease in form of perindopril arginine (trade names include Coversyl, Coversum) or perindopril erbumine (Aceon). Each tablet contains 2, 4, or 8 mg of the tert-butylamine salt of perindopril. Perindopril is also available under the trade name Coversyl Plus, containing 4 mg of perindopril combined with 1.25 mg indapamide. In Australia, each tablet contains 2.5, 5, or 10 mg of perindopril arginine."}, {"url": "http://drugs.webmd.boots.com/drugs/drug-360-Perindopril+Erbumine.aspx", "passage_text": "Do not store above 30° C. Perindopril erbumine is used to treat conditions that result from problems with circulation of the blood, such as high blood pressure and heart failure. It is a type of ACE inhibitor, and is used to widen blood vessels, making it easier for the heart to pump blood through the body. "}]