[{"url": "http://www.themedicalquestions.com/fitness/how-many-steps-does-an-average-person-take-in-a-day.html", "passage_text": "http://wiki.answers.com/Q/How_many_steps_does_the_average_person_take_each_day. on average a person takes about 3,000-5,000 steps a day. you should take at least 10,000 steps a day :]."}, {"url": "http://www.nhs.uk/LiveWell/loseweight/Pages/10000stepschallenge.aspx", "passage_text": "The average person walks between 3,000 and 4,000 steps per day. To find out how many steps you take each day, buy a pedometer similar to the one in the video at the bottom of this page."}, {"url": "http://www.livescience.com/43956-walking-10000-steps-healthy.html", "passage_text": "If you normally walk about 5,000 steps a day, getting in an extra 30-minute, brisk walk into your day would take you to about 8,000 steps, Tudor-Locke said. The average U.S. adult walks about 5,900 steps daily, she said."}, {"url": "http://snowbrains.com/brain-post-how-far-does-the-average-human-walk-in-a-lifetime/", "passage_text": "The average moderately active person take aound 7,500 step/day. If you maintain that daily average and live until 80 years of age, you’ll have walked about 216,262,500 steps in your lifetime. Doing the math; the average person with the average stride living until 80 will walk a distance of around 110,000 miles."}, {"url": "http://well.blogs.nytimes.com/2010/10/19/the-pedometer-test-americans-take-fewer-steps/comment-page-4/", "passage_text": "The fitness gap detected by the pedometer studies is equal to about 30 to 40 minutes of walking each day. One mile of walking covers about 2,000 steps, researchers say. The health community typically urges people to take at least 10,000 steps a day to maintain good health, which is equal to about five miles of walking."}, {"url": "http://well.blogs.nytimes.com/2010/10/19/the-pedometer-test-americans-take-fewer-steps/comment-page-4/", "passage_text": "The results were compared to similar pedometer studies in Switzerland, Australia and Japan. The data collected showed that Americans, on average, took 5,117 steps a day, far short of the averages in western Australia (9,695 steps), Switzerland (9,650 steps) and Japan (7,168 steps)."}, {"url": "http://www.themedicalquestions.com/fitness/how-many-steps-does-an-average-person-take-in-a-day.html", "passage_text": "Health related question in topics Demographics Fitness .We found some answers as below for this question How many steps does an average person take in a day,you can compare them. The average person takes from 3,000 to 5,000 steps per day and will walk around the earth twice in their lifetime. ChaCha on. [ Source: http://www.chacha.com/question/how-many-steps-does-an-average-person-take-in-a-day ]. More Answers to  How many steps does an average person take in a day ."}]