[{"url": "http://www.chileinside.cl/en/chile-guide/149-culture-and-language", "passage_text": "The official language of the Republic of Chile is Spanish (castellano) that is spoken by the whole population. Also in existence are indigenous communities that still utilize their languages and dialects like the Mapudungun (mapudungún in the) south The (aymara aymará In The andes region in) the north And (the Rapanui Of). easter island "}, {"url": "https://en.wikipedia.org/wiki/Rapa_Nui_language", "passage_text": "According to census data, there are about 3,700 people on the island and on the Chilean mainland who identify as ethnically Rapa Nui. Census data do not exist on the primary known and spoken languages among these people and there are recent claims that the number of fluent speakers is as low as 800. 1 The old, the new, the in-between: Comparative aspects of Hispanisation on the Marianas and Easter Island (Rapa Nui). 2  In T. Stolz, D. Bakker, R.S. 3  Palomo (eds) Hispanisation: The Impact of Spanish on the Lexicon and Grammar of the Indigenous Languages of Austronesia and the Americas."}, {"url": "http://www.omniglot.com/writing/rapanui.htm", "passage_text": "Rapa Nui (Vananga rapa nui). Rapa Nui, or Rapanui, is a Polynesian language spoken by about 2,700 people on Easter Island and also in Chile, Tahiti and the USA. Rapa Nui is a member of the eastern branch of Polynesian languages and is related to the languages of Tahiti and the Marquesas, and also to Maori. Easter Island, which is known as Rapa Nui in Rapa Nui and Isla de Pascua in Spanish, was annexed by Chile on 9 September 1888 and has been run by Chile since then. A version of the Latin alphabet is used to write Rapa Nui, although the language is rarely written, and most Easter islanders write in Spanish. However in 2010 the first ever newspaper in Rapa Nui was published, and there are plans for a dictionary."}, {"url": "http://blog.southpacific.org/language-in-the-south-pacific", "passage_text": "Some 1,200 languages, a third of the world’s total, are spoken in the Pacific islands, though most have very few speakers. The Austronesian language family includes more than 900 distinct languages spoken in an area stretching from Madagascar to Easter Island. "}, {"url": "http://www.frommers.com/destinations/south-pacific/253670", "passage_text": "Language. Like their DNA, linguists have traced the islanders' languages to present-day Taiwan. They belong to the Austronesian family of languages spoken from Madagascar, off the coast of Africa, to Easter Island, off the coast of South America. No other group of ancient languages spread to so much of the earth's surfac"}, {"url": "http://www.forbestravelguide.com/santiago-chile/what-language-is-spoken-in-santiago", "passage_text": "Correspondent. Santiago, Chile, South America. Spanish is the official language in Chile... although some Spanish speakers may struggle to pick it up at first. Fourteen million of Chile's 16 million population speak Spanish as their first language. A few communities have their own indigenous languages: the Mapuche people speak Mapudungun; the people of Easter Island speak Rapa Nui; and in the far north, Quechua is spoken. Chilean Spanish is fast, furious and the end syllables are often missed off. To my ear, it sounds like the Chileans are eating their words. "}, {"url": "http://www.answers.com/Q/What_language_is_spoken_in_Easter_Island", "passage_text": "English is the most widely spoken language in Rhode Island, by far. There are some immigrant communites that speak other languages also, such as Spanish and French. Easter Island, a territory of the Republic of Chile, is a Polynesian Island at the southeastern edge of the Polynesian Triangle, with mysterious monolithic statues carved from … giant blocks of stone. Easter Island is famous for these statues, called Moai (pronounced MOE-eye), created by the Rapanui people."}, {"url": "https://en.wikipedia.org/wiki/Rapa_Nui_language", "passage_text": "[ˈɾapa ˈnu.i]) also known as Pascuan /ˈpaeskjuːən/ , ˈpæskjuːən Or, pascuense is An Eastern polynesian language spoken on the island Of Rapa, nui also known As Easter. island 1 The old, the new, the in-between: Comparative aspects of Hispanisation on the Marianas and Easter Island (Rapa Nui). 2  In T. Stolz, D. Bakker, R.S. 3  Palomo (eds) Hispanisation: The Impact of Spanish on the Lexicon and Grammar of the Indigenous Languages of Austronesia and the Americas."}, {"url": "https://en.wikipedia.org/wiki/Rapa_Nui_people", "passage_text": "Rapanui is a minority language as most Rapa Nui people speak Spanish as their first language. Spanish is the most widely spoken language on Easter Island and the primary language of education and administration. It is believed that Rapanui is currently undergoing a shift towards more Spanish sentence structure. The Rapa Nui currently speak Spanish and the traditional Rapanui language. The Rapanui language, also known as Pascuan, is classified as an Eastern Polynesian language and is currently written in Latin script."}, {"url": "https://en.wikipedia.org/wiki/Rapa_Nui_people", "passage_text": "The Rapa Nui are the native Polynesian inhabitants of Easter Island, or Rapa Nui, in the Pacific Ocean. The easternmost Polynesian culture, the Rapa Nui people currently make up 60% of Easter Island's population and have a significant portion of their population residing in mainland Chile. They speak both the traditional Rapa Nui language and the primary language of the island, Spanish. The Rapa Nui currently speak Spanish and the traditional Rapanui language. The Rapanui language, also known as Pascuan, is classified as an Eastern Polynesian language and is currently written in Latin script."}]