[{"url": "http://www.familytravelnetwork.com/articles/cruise_minimum_age.asp", "passage_text": "These have a 12 month minimum boarding age. All guests under 21 years of age must be accompanied by a parent, guardian or chaperone who is at least 25 years of age. One adult chaperone who is at least 25 is required for every five persons under the age of 21. In addition, guests only need to be 18 years of age or older to book and cruise on their own. Several cruise lines, such as Holland America and Norwegian Cruise Line, require minors under the age of 18 who are cruising unaccompanied by one or both of their parents to produce notarized documents before boarding."}, {"url": "http://cruisemates.com/forum/family-cruising/374142-what-age-do-you-pay-them.html", "passage_text": "With all the people talking about taking babies (under 2 years it seems) on these cruises, do you actually have to pay for them as well, or are they free to a certain age. I have twins, no way would I pay up to $2000 to have them on a cruise with me, not to mention air fare for them. "}, {"url": "http://www.familytravelnetwork.com/articles/cruise_minimum_age.asp", "passage_text": "Disney Cruise Line: Infants must be at least 12 weeks of age at time of boarding. Guests must be 18 years of age or older to book a Disney cruise and travel on their own. Any minor guest under the age of 18 must be accompanied by a responsible adult who is 21 years of age or older. In addition, guests only need to be 18 years of age or older to book and cruise on their own. Several cruise lines, such as Holland America and Norwegian Cruise Line, require minors under the age of 18 who are cruising unaccompanied by one or both of their parents to produce notarized documents before boarding."}, {"url": "http://www.frommers.com/articles/4020.html", "passage_text": "Those 18 and younger must share a cabin with a parent or guardian 21 or older. Disney Cruise Line (www.disneycruiseline.com). All passengers must be 21 years old to drink alcohol and you must be at least 18 to occupy a cabin without an adult. Norwegian Cruise Line (www.ncl.com) Passengers ages 18 to 20, with the written consent of their parents or guardian, can purchase beer or wine for themselves only when the ship is sailing in international waters (except in Alaska and Hawaii, where you must be 21 years of age to consume or purchase alcohol or any kind)."}, {"url": "http://www.frommers.com/articles/4020.html", "passage_text": "All passengers must be 21 years old to drink alcohol and 18 to gamble in the casino. All passengers must be 21 years old, or have at least one person in the cabin over age 21. During certain times of the year, like Spring Break, passengers ages 21 to 24 must have one person at least 25 years old in the same cabin. Norwegian Cruise Line (www.ncl.com) Passengers ages 18 to 20, with the written consent of their parents or guardian, can purchase beer or wine for themselves only when the ship is sailing in international waters (except in Alaska and Hawaii, where you must be 21 years of age to consume or purchase alcohol or any kind)."}, {"url": "http://www.frommers.com/articles/4020.html", "passage_text": "To gamble in the casino, passengers must be 21 or older. Those 18 and younger must share a cabin with a parent or guardian 21 or older. Disney Cruise Line (www.disneycruiseline.com) All passengers must be 21 years old to drink alcohol and you must be at least 18 to occupy a cabin without an adult. Norwegian Cruise Line (www.ncl.com) Passengers ages 18 to 20, with the written consent of their parents or guardian, can purchase beer or wine for themselves only when the ship is sailing in international waters (except in Alaska and Hawaii, where you must be 21 years of age to consume or purchase alcohol or any kind)."}, {"url": "http://www.familytravelnetwork.com/articles/cruise_minimum_age.asp", "passage_text": "All guests under 21 years of age when boarding must be accompanied by a parent or guardian in the same stateroom. On some sailings, even guests 21-24 years of age must have at least one person in the stateroom who is at least 25 years old and will agree to be responsible for the under-25 year old guests. In addition, guests only need to be 18 years of age or older to book and cruise on their own. Several cruise lines, such as Holland America and Norwegian Cruise Line, require minors under the age of 18 who are cruising unaccompanied by one or both of their parents to produce notarized documents before boarding."}, {"url": "https://answers.yahoo.com/question/index?qid=20090417161144AAScIGx", "passage_text": "Best Answer: All of the cruise lines, except Carnival, require that at least one person in each cabin be age 21 or older. Carnival requires that at least one person be age 25 or older. All of the cruise lines are concerned that there is a responsible adult (age 21 or 25) to supervise anyone under that age. In addition, all cruise line cabins are sold based on double occupancy (two people per cabin). You can still cruise alone if you are age 21 but you will have to pay a single supplement to occupy that cabin alone. The single supplement is essentially a double fare; same as if two people were in the cabin. So if you see a fare that $599 for a 7-day cruise that's for each of the two people."}]