[{"url": "http://www.teleflora.com/meaning-of-flowers/protea", "passage_text": "Among the oldest families of flowers on earth, dating back 300 million years, Greek legend tells us that protea were named after Proteus, the son of Poseidon. A sea god who had the power to know all things past, present and future, Proteus was defiant and preferred to nap on the island of Pharos rather than prophesize. "}, {"url": "http://www.thefreedictionary.com/protea", "passage_text": "protea-any tropical African shrub of the genus Protea having alternate rigid leaves and dense colorful flower heads resembling cones. genus Protea-type genus of Proteaceae; tropical African shrubs. honeypot, king protea, Protea cynaroides-South African shrub whose flowers when open are cup-shaped resembling artichokes. 1. (Plants) any shrub or small tree of the genus Protea, of tropical and southern Africa, having flowers with coloured bracts arranged in showy heads: family Proteaceae. [C20: from New Latin, from Proteus, referring to the large number of different forms of the plant]. Thesaurus AntonymsRelated WordsSynonymsLegend:"}, {"url": "http://www.merriam-webster.com/dictionary/protea", "passage_text": "Definition of PROTEA. : any of a genus (Protea of the family Proteaceae, the protea family) of African evergreen shrubs often grown as ornamentals for their showy bracts and dense flower heads. ADVERTISEMENT. Tweet. : any of a genus (Protea of the family Proteaceae, the protea family) of African evergreen shrubs often grown as ornamentals for their showy bracts and dense flower heads."}, {"url": "https://en.wikipedia.org/wiki/Protea_cynaroides", "passage_text": "From Wikipedia, the free encyclopedia. The king protea (Protea cynaroides) is a flowering plant. It is a distinctive member of Protea, having the largest flower head in the genus. The species is also known as giant protea, honeypot or king sugar bush. It is widely distributed in the southwestern and southern parts of South Africa in the fynbos region. The king protea is the national flower of South Africa. "}, {"url": "http://www.fiftyflowers.com/product/King-Protea-Flower_24160.htm", "passage_text": "Customer Reviews. Protea King flower is an incredibly unique tropical flower that looks straight out of a storybook. This novelty flower is the largest in the protea family and features a huge white fuzzy center that gently slopes upward to a soft point. "}, {"url": "http://www.universeofsymbolism.com/flower-symbolism-page-three.html", "passage_text": "Protea Flower... The beautiful and exotic Protea flower is a symbol of curiosity and change. Protea brings the meaning to explore your dreams and wishes, and changes in your journey with the curiosity and wonder of a child. Protea flower works with the 3rd eye chakra"}, {"url": "http://www.thefreedictionary.com/protea", "passage_text": "protea. n. 1. (Plants) any shrub or small tree of the genus Protea, of tropical and southern Africa, having flowers with coloured bracts arranged in showy heads: family Proteaceae. [C20: from New Latin, from Proteus, referring to the large number of different forms of the plant]. Thesaurus AntonymsRelated WordsSynonymsLegend:"}, {"url": "http://capetown.dj/nature/flora/protea/protea.html", "passage_text": "The Protea-South Africa's national flower. The Protea is the national flower of South Africa, and the flagship species of the Cape Floral Kingdom (they are a typical example of fynbos). Proteas are mostly bird-pollinated."}, {"url": "http://www.audioenglish.org/dictionary/protea.htm", "passage_text": "• PROTEA (noun). The noun PROTEA has 1 sense: 1. any tropical African shrub of the genus Protea having alternate rigid leaves and dense colorful flower heads resembling cones. Familiarity information: PROTEA used as a noun is very rare."}]