[{"url": "http://www.elp.com/articles/2011/11/walmart-now-taking-bill-payments-for-pg-e-sdg-e-socalgas.html", "passage_text": "Walmart now taking bill payments for PG&E, SDG&E, SoCalGas. Brookfield, Wis., November 1, 2011 — Walmart is expanding its offer of the CheckFreePay walk-in bill payment service from Fiserv, Inc. to become an authorized walk-in bill payment center for multiple California utilities. Customers can now visit a Walmart store to pay a bill from Pacific Gas & Electric Co. , San Diego Gas & Electric and Southern California Gas Co. Walmart is an authorized payment center for PG&E, SDG&E and SoCalGas meaning customers can pay bills from these companies without incurring a convenience fee."}, {"url": "http://www.creditcardcatalog.com/walmart-credit-card-payment-login-and-customer-service-information/", "passage_text": "Walmart credit cards are issued in partnership with Synchrony Bank (formerly GE Capital Retail Bank), and it is Synchrony you will interact with when it comes to paying your bill online or by mail, or to get customer service assistance. If you want to send in your Walmart credit card payment, here is the mailing address: Walmart Credit Card. P.O. Box 530927. Atlanta, GA 30353-0927. or, if you want to send a payment via overnight mail: 485 Lake Mirror Road. Building 700."}, {"url": "http://www.flyertalk.com/forum/manufactured-spending/1471728-billpay-walmart.html", "passage_text": "Billpay at Walmart. I have always seen the bill payment service listed on the WM Money Center board, but never thought much of it. I recently used one of the chase no fee gcs to pay off my Amex CC at WM Money Center for $1.5 fee. However, when I tried paying off my Chase CC it did not go through"}, {"url": "http://corporate.walmart.com/contact-us/store-corporate-feedback", "passage_text": "Store & Corporate Feedback. Walmart is committed to providing you superior customer service and a pleasant shopping experience. We're happy to respond to your questions about Walmart and appreciate your comments or suggestions. Please use the form below to let us know how we can assist you"}, {"url": "http://www.elp.com/articles/2011/11/walmart-now-taking-bill-payments-for-pg-e-sdg-e-socalgas.html", "passage_text": "Payments can be made using cash or a PIN-based debit card. Payments are processed through the CheckFreePay bill payment service from Fiserv offered by Walmart, and are sent electronically to the utility on the same business day. Walmart already offers customers the ability to pay more than 2,500 bills using CheckFreePay. Customers can now visit a Walmart store to pay a bill from Pacific Gas & Electric Co. , San Diego Gas & Electric and Southern California Gas Co. Walmart is an authorized payment center for PG&E, SDG&E and SoCalGas meaning customers can pay bills from these companies without incurring a convenience fee."}, {"url": "https://www.doxo.com/info/walmart-discover", "passage_text": "Support resources for Walmart are available online at www.walmart.com. The information listed on that page can help if you need to update your account or have other questions about your bill or statement. Reach Walmart via phone at (866) 611-1148. Walmart does not offer their customers a mobile app for iOS or Android. You can use the doxo My Account Manager app to keep your account info, notes, documents, and contact information for Walmart."}, {"url": "https://www.doxo.com/info/walmart", "passage_text": "Support resources for Walmart Store Card are available online at help.walmart.com. The information listed on that page can help if you need to update your account or have other questions about your bill or statement. Reach Walmart Store Card via phone at 800-966-6546. Walmart Store Card customers with an iPhone or iPad can install the Walmart Store Card for iOS app to login to their account via a mobile phone or tablet. There is no Walmart Store Card app for Android available."}, {"url": "http://www.creditcardcatalog.com/walmart-credit-card-payment-login-and-customer-service-information/", "passage_text": "*****. If you want to send in your Walmart credit card payment, here is the mailing address: Walmart Credit Card. P.O. Box 530927. Atlanta, GA 30353-0927. or, if you want to send a payment via overnight mail: 485 Lake Mirror Road. Building 700."}, {"url": "http://www.creditcardcatalog.com/walmart-credit-card-payment-login-and-customer-service-information/", "passage_text": "If you are having trouble making an online payment or need to reach Walmart credit card customer service for another reason, the phone number to call is 1-877-294-7880 for the store card and 1-866-611-1148 for the Walmart MasterCard. If you want to send in your Walmart credit card payment, here is the mailing address: Walmart Credit Card. P.O. Box 530927. Atlanta, GA 30353-0927. or, if you want to send a payment via overnight mail: 485 Lake Mirror Road. Building 700."}, {"url": "http://www.creditcardcatalog.com/walmart-credit-card-payment-login-and-customer-service-information/", "passage_text": "You CAN pay your Walmart credit card bill in a Walmart store as well — visit the Customer Service desk to make your payment. If you want to send in your Walmart credit card payment, here is the mailing address: Walmart Credit Card. P.O. Box 530927. Atlanta, GA 30353-0927. or, if you want to send a payment via overnight mail: 485 Lake Mirror Road. Building 700."}]