[{"url": "http://www.destinvacationboatrentals.com/blog-post/crab-island-the-complete-visitors-guide-to-destins-most-popular-hangout/", "passage_text": "Crab Island is located on the north side of the Destin Bridge at the entrance of the Choctawhatchee Bay. It is only accessible by boat (or kayak or standup paddleboard if you’re in the mood for a good workout) due to the distance from shore and the strong currents and boat traffic that surround it. Do a Google search for Crab Island and you’re likely to find pictures of a drunken party crowd. And parts of Crab Island are like that…sometimes. The good news is the real-life image is much different. If you’re with your family and you want to avoid the party scene, you can."}, {"url": "http://www.destinflorida.com/crab-island-destin-florida-guide/", "passage_text": "Activities for Families on Crab Island. Once you arrive at Crab Island Destin Florida, you will have ample activities to enjoy. Snorkeling is popular on Crab Island, especially if you are new to snorkeling. The shallow water makes it easy to get the hang of it. It does not matter if you are traveling with an entire family or you want to party with your friends. Crab Island Destin Florida is the perfect place to visit during your vacation. Two Sides of Crab Island. Before you go to Crab Island Destin Florida, you need to know that the area has two distinct sections."}, {"url": "https://en.wikipedia.org/wiki/Destin,_Florida", "passage_text": "Destin is a city located in Okaloosa County, Florida. It is a principal city of the Fort Walton Beach-Crestview-Destin, Florida Metropolitan Statistical Area. Located on Florida's Emerald Coast, Destin is known for its white beaches and emerald green waters. Originating as a small fishing village, it is now a popular tourist destination."}, {"url": "http://www.edgewaterbeach.com/destin-vacation-blog/what-is-crab-island", "passage_text": "Actually, Crab Island isn’t an island at all! The area known as Crab Island is a submerged sandbar in the middle of Destin’s East Pass where locals and visitors can anchor and walk around in crystal clear waters that are only 2 to 5 feet deep. So what is the big deal? Well, it’s basically a party in the middle of the sea! On any given summer day, you will find hundreds of boats and folks hanging out together. The translucent waters at Crab Island instinctively draw everyone’s eyes away from the road as they cross the bridge from Okaloosa Island into Destin."}, {"url": "http://www.destinvacationboatrentals.com/blog-post/crab-island-the-complete-visitors-guide-to-destins-most-popular-hangout/", "passage_text": "The name Crab Island makes you assume it’s an island. Actually, at one time it WAS an island, as this picture shows: but drifting sands from the Gulf of Mexico eroded it over time and now it is an underwater sandbar and popular place to anchor your boat (rented or personal). Do a Google search for Crab Island and you’re likely to find pictures of a drunken party crowd. And parts of Crab Island are like that…sometimes. The good news is the real-life image is much different. If you’re with your family and you want to avoid the party scene, you can."}, {"url": "http://www.mycrabisland.com/about-crab-island.html", "passage_text": "Crab Island is a sandbar that is located just South of the Marler Bridge in Destin, FL. Crab Island started to gain in popularity as boaters used the area to anchor their boats to catch some rays and wade on the sandbar. Crab Island is just south of the Marler Bridge (Also Called The Marler Bridge). Although it may seem as if you can access it by foot, you must have some type of watercraft to get yourself to the location."}, {"url": "http://www.mycrabisland.com/", "passage_text": "Crab Island is a sandbar that is located just South of the Marler Bridge in Destin, FL. Crab Island started to gain in popularity as boaters used the area to moor their boats to catch some rays and wade in the sand bar. Now Crab Island has erupted into a popular social scene where locals and tourists congregate... Read More."}, {"url": "http://www.destinflorida.org/things-to-do/crab-island-destin/", "passage_text": "Photo compliments of Crab Island Facebook Page. Crab Island is the perfect getaway from the tourist-side of Destin, Florida. This sand bar, party island is somewhere different to spend your day or week. Just pull your boat up and park for a day of fun out on the crystal clear emerald waters of the Gulf. Crab Island Destin is peppered with food floats where you can swim up and buy hot, fresh food and cocktails, so be sure and bring some money along. You will also find inflatable water toys such as a giant water slide and an ocean trampoline, making this a great place to take kids who can swim."}, {"url": "http://www.crabislandcruises.com/What-is-Crab-Island-.html", "passage_text": "An underwater boating and party island located on the North side of the Destin bridge. As you cross the Destin bridge, during the spring and summer months, you will see anywhere from tens to hundreds of boats anchored in the bay over the shallow sandbar. "}]