[{"url": "http://support.bell.ca/mobility/smartphones_and_mobile_internet/samsung-galaxy-s5.how_to_turn_data_roaming_and_data_services_onoff", "passage_text": "Touch Mobile data again to turn data services on. When abroad, data roaming is required to use email, web browsing and other data services. Please note that data roaming charges will apply. To avoid unwanted roaming charges, you can turn off data roaming. You can also turn off data services altogether. Touch Data roaming again to turn it off"}, {"url": "http://support.bell.ca/Mobility/Smartphones_and_mobile_internet/Samsung-Galaxy-S3.how_to_turn_data_roaming_on_and_off_on_my", "passage_text": "To switch the network off completely, touch Use packet data. When abroad, data roaming is required to use email, web browsing and other data services. Please note that data roaming charges will apply. To avoid unwanted roaming charges, you can turn off data roaming. You can also turn off data services altogether. 5"}, {"url": "http://deviceguides.vodafone.ie/web/samsung-galaxy-s4/change-settings/data-usage/turn-data-roaming-on-or-off/", "passage_text": "Turn data roaming on or off. You can limit your data usage when abroad by turning off data roaming. You'll then not be able to access the internet using the mobile network when abroad. You can still use Wi-Fi even though data roaming is turned off. Remember, you need to turn on mobile data."}, {"url": "http://ee.co.uk/help/phones-and-device/samsung/samsung-galaxy-s5/samsung-galaxy-S5-internet-and-applications/samsung-galaxy-S5---enable-or-disable-data-roaming", "passage_text": "Enable or Disable Data Roaming. Find out how to enable or disable data roaming on your device. 1  From the home screen, tap Apps. 2  Tap Settings. 3  Scroll to and tap More networks. 4  Tap Mobile networks. 5  Tap Data roaming. 6  Tap OK if prompted. "}, {"url": "http://support.bell.ca/Mobility/Smartphones_and_mobile_internet/Samsung-Galaxy-S3.how_to_turn_data_roaming_on_and_off_on_my", "passage_text": "4. Scroll to and touch Mobile networks. When abroad, data roaming is required to use email, web browsing and other data services. Please note that data roaming charges will apply. To avoid unwanted roaming charges, you can turn off data roaming. You can also turn off data services altogether. 5"}, {"url": "http://devicehelp.singtel.com/web/samsung-galaxy-note-4/data-usage/turning-data-roaming-on-my-mobile-phone-on-or-off/", "passage_text": "Turn data roaming on or off. Return to the home screen. If you want to avoid using data when you're abroad, you need to turn off data roaming on your mobile phone. Once done, you can only make voice calls, send SMS and use applications that don't require an internet connection. "}, {"url": "http://support.bell.ca/Mobility/Smartphones_and_mobile_internet/Samsung-Galaxy-S3.how_to_turn_data_roaming_on_and_off_on_my", "passage_text": "Touch Data roaming again to turn it off. When abroad, data roaming is required to use email, web browsing and other data services. Please note that data roaming charges will apply. To avoid unwanted roaming charges, you can turn off data roaming. You can also turn off data services altogether. 5"}, {"url": "http://devicehelp.optus.com.au/web/samsung-galaxy-s-ii/connectivity/data-usage/turning-data-roaming-on-my-mobile-phone-on-or-off/", "passage_text": "Turning data roaming on my mobile phone on or off. If you want to avoid using data when you're abroad, you need to turn off data roaming on your mobile phone. Once done, you can only make voice calls, send SMS and use applications that don't require an internet connection. 1. Find Mobile networks. Tap Applications. Tap Settings. Tap Wireless and network. "}, {"url": "http://support.bell.ca/Mobility/Smartphones_and_mobile_internet/Samsung-Galaxy-S3.how_to_turn_data_roaming_on_and_off_on_my", "passage_text": "Touch Use packet data again to turn data services on. When abroad, data roaming is required to use email, web browsing and other data services. Please note that data roaming charges will apply. To avoid unwanted roaming charges, you can turn off data roaming. You can also turn off data services altogether. 5"}, {"url": "http://www.samsung.com/nz/support/skp/faq/432810", "passage_text": "To prevent data roaming charges when using the device abroad, ensure that the Data Roaming is disabled. To enable or disable Data Roaming on your Galaxy S3, follow these steps: Step 1: On the Home screen, tap Apps. Step 2: Tap Settings. Step 3: Tap More settings. Step 4: Under Wireless and networks, tap Mobile networks. Step 5: Tap Data roaming. Step 6: A warning message will pop up. Tap OK to proceed."}]