[{"url": "http://literarydevices.net/epithet/", "passage_text": "Epithet Definition. Epithet is a descriptive literary device that describes a place, a thing or a person in such a way that it helps in making the characteristics of a person, thing or place more prominent than they actually are. Also, it is known as a by-name or descriptive title."}, {"url": "http://www.yourdictionary.com/epithet", "passage_text": "(plural epithets). 1  A term used to characterize a person or thing. 2  A term used as a descriptive substitute for the name or title of a person. 3  An abusive or contemptuous word or phrase. ( 4 biology) A word in the scientific name of a taxon following the name of the genus or species."}, {"url": "http://www.softschools.com/examples/grammar/epithet_examples/139/", "passage_text": "Epithet Examples. Epithet. Epithet is the literary term for the application of a word or phrase to someone that describes that person's attributes or qualities. Often, this word or phrase, used to describe the person, becomes synonymous with the person and can be used as part of his/her name or in place of his/her name. Examples of Epithet:"}, {"url": "http://www.softschools.com/examples/grammar/epithet_examples/139/", "passage_text": "Epithet is the literary term for the application of a word or phrase to someone that describes that person's attributes or qualities. Often, this word or phrase, used to describe the person, becomes synonymous with the person and can be used as part of his/her name or in place of his/her name. Examples of Epithet:"}, {"url": "http://literarydevices.net/epithet/", "passage_text": "Kenning examples may also be considered as epithet examples. Kenning is a type of an epithet, which is a two-word phrase that describes an object by employing metaphors. The Fixed Epithet. Fixed epithets are found in epic poetry that involves the repetitive use of a phrase or word for the same object."}, {"url": "https://en.wikipedia.org/wiki/Epithet", "passage_text": "An epithet (from Greek: ἐπίθετον epitheton, neut. of ἐπίθετος epithetos, attributed, added) is a byname, or a descriptive term (word or phrase), accompanying or occurring in place of a name and having entered common usage. It can be described as a glorified nickname."}]