[{"url": "http://www.simplyrecipes.com/recipes/roast_leg_of_lamb/", "passage_text": "4 Roast at 425°F for 20 minutes. Then reduce the heat to 300°F and roast an additional 40 minutes (for a 6 pound boneless roast) to an hour (for a 6 pound bone-in roast). If you are cooking a roast bone-in, the bone will act as an insulator and will require a longer cooking time than a boneless roast. "}, {"url": "http://www.beefandlamb.com.au/How_to/Cooking_beef_and_lamb/Roasting/How_to_slow_roast_lamb", "passage_text": "Slow roasting would have to be one of the easiest ways to cook lamb, in fact it’s a roast that practically cooks itself! Cuts. Best lamb cuts are lamb leg and shoulders, as well as lamb shanks. Timing-two options. Cook in the oven: at 140ºC for around 4 hours; or a little faster at 160ºC for 2-3 hours. Season the lamb well a generous dusting of herbs like fresh rosemary or dried oregano or any other herb of your choice. You can also rest it on some garlic cloves or onion wedges if you like. 1 Make sure the lamb roast stands at room temperature for around 15 -20 minutes before cooking. 2  This takes the fridge chill from the lamb and allows it to cook evenly."}, {"url": "http://girlinafoodfrenzy.com/the-sunday-roast-or-8-hr-slow-cooked-lamb/", "passage_text": "I add approximately 1.5 cups of water at this stage and place the lamb in the centre rack of the oven for at least 35 mins, optional add a glug of red wine if you like. After the first 30 mins are up, spoon some of the juices over the lamb leg. Reduce temperature to approx 180C (356 F) and now begins the slow cook. For the next hour & a half monitor the lamb, (basting) the juices over the meat if it begins to look too dry, (alternatively cover with aluminium foil too,)."}, {"url": "http://www.esquire.com/food-drink/food/how-to/a10795/lamb-shoulder-recipe-0911/", "passage_text": "Sear: Place lamb in the middle of the oven and roast for 20 minutes. Slow-roast: Remove lamb from the oven, leave the door ajar for 10 minutes to cool it down, then bring it to 225 degrees. Rub lamb all over with harissa mixture and place in oven until the internal temperature is 140 degrees. This can take anywhere from 2½ to 3½ hours. Rest: Remove roast from oven and let rest for 30 minutes. Don't ruin a great piece of meat by slicing it too quickly."}, {"url": "http://www.bbc.co.uk/food/recipes/slow_roast_leg_of_lamb_34951", "passage_text": "Rub the garlic mixture over the whole surface of the lamb. Place the lamb into a deep sided roasting tin. Add 250ml/9fl oz of water to the roasting tin. Baste the meat with the liquid then cover the lamb with foil. Place in the oven and roast for 3-3½ hours, until cooked to your liking. When cooked, pour off any excess oil from the top of the liquid, leaving the cloudy, herby sediment in place."}, {"url": "http://www.foodnetwork.com/recipes/emeril-lagasse/rosemary-and-garlic-roast-leg-of-lamb-recipe.html", "passage_text": "Directions. Preheat the oven to 400 degrees F. Using your hands, rub the lamb all over with the lemon juice. Pat the garlic and rosemary evenly all over the surface of the meat. Season the meat with the salt and pepper and place the lamb in a roasting pan. Place the lamb in the oven and roast for 30 minutes"}, {"url": "http://www.taste.com.au/recipes/24749/slow+roasted+lamb+with+skordalia", "passage_text": "Place lamb in a large roasting pan. Drizzle with oil and lemon juice. Sprinkle with garlic, oregano and thyme. Season with salt and pepper. Roast for 4 hours and 30 minutes to 5 hours or until meat is tender and falling off the bone. Remove lamb from oven. Cover loosely with foil. Rest for 10 minutes. Serve lamb with skordalia and thyme. Serve lamb with pan-fried lemon halves. Heat a non-stick frying pan over medium-high heat. Cook lemon halves, cut side-down, for 3 to 5 minutes or until browned. Set aside until cool enough to handle."}, {"url": "http://www.wikihow.com/Slow-Cook-a-Roast", "passage_text": "Slow cooking a roast provides you with a tender, juicy, delicious meal. Even though it takes a long time to do properly, slow cooking is worth the wait. Many types of meat can be used including beef, pork, or lamb. Whether you’re cooking in a slow cooker or an oven, a little preparation goes a long way to help you make the perfect roast."}, {"url": "http://dish.allrecipes.com/how-to-roast-lamb/", "passage_text": "Rest Your Roast. Once your roast is within 10 degrees F (5 degrees C) of its ideal cooked temperature, remove from the oven, place a foil tent loosely over it, and let rest for 15-20 minutes. "}]