[{"url": "http://www.payscale.com/research/US/Job=Automotive_Service_Technician_%2f_Mechanic/Hourly_Rate", "passage_text": "(United States). Very much a male-dominated career in the United States, Auto Mechanics earn an average of $16.82 per hour. The most important factor affecting compensation for this group is the company, followed by the particular city and tenure. The majority of workers are highly satisfied with their job."}, {"url": "http://work.chron.com/much-can-diesel-mechanic-make-3107.html", "passage_text": "National Averages. Diesel mechanics nationwide earned a mean $20.63 per hour or $42,910 per year as of May 2011, according to the Bureau of Labor Statistics. A diesel mechanic could earn $61,590 a year or more in the top 10 percent of earners. The median salary was $41,640 a year."}, {"url": "http://work.chron.com/much-marine-mechanic-make-4259.html", "passage_text": "Pay by Industry. As of 2011, the majority of marine mechanics worked for marine dealerships and earned an average of $35,960 per year. Those who worked for marine and small-engine repair shops earned similar pay, an average of $36,470 per year. Marine mechanics employed in the ship-and boat-building industry earned significantly more, an average of $40,55"}, {"url": "http://work.chron.com/much-can-diesel-mechanic-make-3107.html", "passage_text": "In 2011, diesel mechanics in this industry earned mean wages of $18.77 per hour or $39,040 per year. Local government had the next highest number of jobs for diesel mechanics and paid mean wages of $23.57 per hour or $49,03"}, {"url": "http://work.chron.com/much-can-diesel-mechanic-make-3107.html", "passage_text": "Diesel mechanics nationwide earned a mean $20.63 per hour or $42,910 per year as of May 2011, according to the Bureau of Labor Statistics. A diesel mechanic could earn $61,590 a year or more in the top 10 percent of earners. The median salary was $41,640 a year."}, {"url": "http://work.chron.com/much-marine-mechanic-make-4259.html", "passage_text": "Average and Median Pay. The Bureau of Labor Statistics reports that $17.87 was the average hourly income of marine mechanics in 2011, and that they earned an average of $37,170 per year."}]