[{"url": "http://www.health.ny.gov/publications/1443/", "passage_text": "A. Once your request is received, a physician or health care facility has 10 days to provide you with an opportunity to inspect your records. The law does not provide a specific time period by which copies of medical records must be provided. However, the state Health Department considers 10 to 14 days to be a reasonable time in which a practitioner should respond to such a request. Physicians and hospitals are required by state law to maintain patient records for at least six years from the date of the patient's last visit. A doctor must keep obstetrical records and records of children for at least six years or until the child reaches age 19, whichever is later."}, {"url": "http://www.thedoctors.com/KnowledgeCenter/PatientSafety/articles/CON_ID_001849", "passage_text": "Medical Record Retention. A number of variables affect the length of time a physician should keep a medical record. Factors include state and federal laws, medical board and association policies, and the type of record (for example, that of an adult patient versus that of a pediatric patient). The California Medical Association has concluded that, while a retention period of at least 10 years may be sufficient, all medical records should be retained indefinitely or, in the alternative, for 25 years."}, {"url": "http://www.arkmed.org/resources/faq/", "passage_text": "4. If you are trying to locate a previous provider and cannot find an address, you can search our doc finder or look on the medical board’s website. If it has been 10 years since your last visit with a physician, it is likely your medical records have been destroyed."}, {"url": "http://www.answers.com/Q/How_long_do_doctor%27s_have_to_keep_medical_records", "passage_text": "In the US, doctors, psychologists, psychiatrists, hospitals, and dentists must keep medical records for a minimum of 7 years. Some exclusions exist, however, and you may be charged for copies. There are usually state laws governing the keeping of medical records. They usually require the doctor to be able to provide copies of records and keep the original file for a … specified period, often 5 years for adults and longer for children."}, {"url": "http://www.arkmed.org/resources/faq/", "passage_text": "All records required by the federal Health Insurance Portability and Accountability Act must be retained a minimum of six years. As far as patient medical records, ethically the physician is bound to recognize that the interests of the patient are paramount. If you are trying to locate a previous provider and cannot find an address, you can search our doc finder or look on the medical board’s website. If it has been 10 years since your last visit with a physician, it is likely your medical records have been destroyed."}, {"url": "http://www.answers.com/Q/How_long_do_doctor%27s_have_to_keep_medical_records", "passage_text": "As with any medical record the federal law requires 7 years from the date of occurance. If it is a minor until the age of 21.   As with any medical record the federal … law requires 7 years from the date of occurance. If it is a minor until the age of 21. There are usually state laws governing the keeping of medical records. They usually require the doctor to be able to provide copies of records and keep the original file for a … specified period, often 5 years for adults and longer for children."}, {"url": "http://www.arkmed.org/resources/faq/", "passage_text": "Medical records are important to the patient not only for medical care but also for employment, insurance, litigation, or other reasons. Therefore, a physician’s ethical duty is to preserve medical records during the time there is a reasonable likelihood of their usefulness to the patient. If you are trying to locate a previous provider and cannot find an address, you can search our doc finder or look on the medical board’s website. If it has been 10 years since your last visit with a physician, it is likely your medical records have been destroyed."}, {"url": "http://www.cmanet.org/news/detail/?article=faq-how-long-do-you-need-to-keep-medical", "passage_text": "Medical-legal document #1160,  Retention of Medical Records , as well as the rest of the CMA medical-legal library (formerly CMA On-Call), is available free to members in CMA’s online resource library. Nonmembers can purchase medical-legal documents for $2 per page. Medical record retention is an issue that routinely arises in a physician’s medical practice and one that should be evaluated when you are developing appropriate office policies and procedures."}, {"url": "http://www.thedoctors.com/KnowledgeCenter/PatientSafety/articles/CON_ID_001849", "passage_text": "Medical Board and Medical Association Policies and Recommendations. When state or federal laws are silent on medical record retention, medical boards may be able to provide policies or recommendations on how long a physician should keep records. The California Medical Association has concluded that, while a retention period of at least 10 years may be sufficient, all medical records should be retained indefinitely or, in the alternative, for 25 years."}]