[{"url": "http://www.merriam-webster.com/dictionary/judge", "passage_text": "Full Definition of JUDGE. transitive verb. 1. : to form an opinion about through careful weighing of evidence and testing of premises. 2. : to sit in judgment on: try. 3. : to determine or pronounce after inquiry and deliberation. 4. : govern, rule —used of a Hebrew tribal leader. Word Root of JUDGE. The Latin word jus, meaning “ law ” or “ rights, ” and its form juris give us the roots jus and jur. Words from the Latin jus have something to do with law. A jur or is a person who decides the facts of a case in a court of law. A jur y is a group of jurors."}, {"url": "http://www.thefreedictionary.com/judge", "passage_text": "judge. v. judged, judg·ing, judg·es. v. tr. 1. To form an opinion or estimation of after careful consideration: judge heights; judging character. judge. 1  affidavit, deponent-An affidavit (literally, he has stated on oath) is taken by a judge, while the deponent swears, makes, or takes an affidavit. 2  arbiter-Latin for judge, supreme ruler.. 3  arbitrate-Can mean give an authoritative decision (from Latin arbiter, judge)."}, {"url": "http://www.thefreedictionary.com/judge", "passage_text": "judge. n. 1. (Professions) a public official with authority to hear cases in a court of law and pronounce judgment upon them. Compare magistrate 1, justice 5, justice 6. 2. a person who is appointed to determine the result of contests or competitions. judge. 1  affidavit, deponent-An affidavit (literally, he has stated on oath) is taken by a judge, while the deponent swears, makes, or takes an affidavit. 2  arbiter-Latin for judge, supreme ruler.. 3  arbitrate-Can mean give an authoritative decision (from Latin arbiter, judge)."}, {"url": "https://answers.yahoo.com/question/index?qid=20080309081525AAi9JU0", "passage_text": "If a person says, The Bible says to love each other and not to judge, so, those people who are hating and judging and sneering, even though they call themselves Christians, don't seem to be very Christian, that's an I statement that is a more of a fact-based opinion about what I perceive. Our Lord tells us, Judge not and you shall not be judged.....For with what measure you judge. so you shall be judged, and the measure you give will be the measure you get. (Mt 7:1-3) On earth, every person has the potential of becoming good, better and even a saint by the force and power of God's graces."}, {"url": "http://www.gotquestions.org/do-not-judge.html", "passage_text": "Question: What does the Bible mean that we are not to judge others?. Answer: Jesus’ command not to judge others could be the most widely quoted of His sayings, even though it is almost invariably quoted in complete disregard of its context. And the Bible’s command that we not judge others does not mean there should be no mechanism for dealing with sin. The Bible has a whole book entitled Judges. The judges in the Old Testament were raised up by God Himself (Judges 2:18)."}, {"url": "http://www.audioenglish.org/dictionary/judge.htm", "passage_text": "The verb JUDGE has 5 senses: 1. determine the result of (a competition). 2. form a critical opinion of. 3. judge tentatively or form an estimate of (quantities or time). 4. pronounce judgment on. 5. put on trial or hear a case and sit as the judge at the trial of. Familiarity information: JUDGE used as a verb is common. Dictionary entry details. "}, {"url": "http://www.huffingtonpost.com/skye-jethani/what-did-jesus-mean-by-ju_b_708057.html", "passage_text": "Sometimes judge is used to mean judge between things, to differentiate, or discern. In this case we judge between right and wrong, good and evil, righteous and unrighteous. But this kind of judging -- the act of discernment -- is not what Jesus is forbidding. Given these findings, it's pretty important that both Christians and non-Christians understand what Jesus means when he says judge not.. The key is recognizing that the word judge can be used in two different ways in the New Testament."}, {"url": "http://www.gotquestions.org/do-not-judge.html", "passage_text": "The Bible’s command that we not judge others does not mean we cannot show discernment. Immediately after Jesus says, “Do not judge,” He says, “Do not give dogs what is sacred; do not throw your pearls to pigs” (Matthew 7:6). A little later in the same sermon, He says, “Watch out for false prophets. And the Bible’s command that we not judge others does not mean there should be no mechanism for dealing with sin. The Bible has a whole book entitled Judges. The judges in the Old Testament were raised up by God Himself (Judges 2:18)."}]