[{"url": "http://www.victorianplaces.com.au/maribyrnong", "passage_text": "Maribyrnong is a residential and industrial suburb enclosed on three sides by the Maribyrnong River, 6 km north-west of central Melbourne. The southern side is adjacent to Maidstone. Maribyrnong city is discussed at the end of this entry. Maribyrnong was spelled ‘Marriburnong’ in a map dated 1840. The name is thought to be derived from an Aboriginal word meaning saltwater river. The main road through Maribyrnong is Raleigh Road, which joins Maribyrnong Road on the east side of the river. To the west its name changes to Cordite Avenue. Maribyrnong city is a municipality formed on 15 December 1994, comprising the former Footscray city and the parts of Sunshine city known as Braybrook, Maidstone and Maribyrnong."}, {"url": "http://parkweb.vic.gov.au/explore/bays-rivers-and-ports/maribyrnong", "passage_text": "0 visitor ratings. This park has been rated 4.5 stars by users. The Maribyrnong River, which begins on the slopes of Mount Macedon and flows to Port Phillip, has played a major role in the occupation and development of western Victoria. Aboriginal tribes have frequented its banks for at least 40,000 years. 1 Parklands on either side of the river include Maribyrnong Park and Fairbairn Park where there are boat landings and picnic facilities."}, {"url": "https://en.wikipedia.org/wiki/City_of_Maribyrnong", "passage_text": "The City of Maribyrnong is a local government area within the metropolitan area of Melbourne, Australia. It comprises the inner western suburbs between 5 and 10 kilometres from the Melbourne city centre. It was formed in 1994 from the merger of the City of Footscray and parts of the City of Sunshine. The City of Maribyrnong is a place of diversity, opportunities and challenges. The level and type of development occurring over the past ten years, and likely to continue for the next ten to twenty years, is unique to inner Melbour"}, {"url": "https://en.wikipedia.org/wiki/Maribyrnong,_Victoria", "passage_text": "Maribyrnong is a suburb 8 km north-west of Melbourne, Victoria, Australia. Its local government area is the City of Maribyrnong, part of the River Ward. At the 2011 Census, Maribyrnong had a population of 10,165. Maribyrnong takes its name from the Maribyrnong River which bounds the suburb to the north and east. Its other borders are Williamson Road, Rosamond Road, Mephan Street and Owen Street to the south"}, {"url": "http://www.aec.gov.au/profiles/Vic/Maribyrnong.htm", "passage_text": "Area and Location Description: The Division of Maribyrnong is located in Melbourne's north-western suburbs. It covers an area of approximately 73 sq km from Moonee Ponds in the east to St Albans in the west, Airport West in the north to Braybrook in the south. "}, {"url": "http://profile.id.com.au/maribyrnong", "passage_text": "The Maribyrnong City Estimated Resident Population for 2014 is 81,859, with a population density of 26.23 persons per hectare. The City of Maribyrnong is located in Melbourne's inner western suburbs – between 5 and 11 kilometres west of Melbourne. The Maribyrnong City Community Profile provides demographic analysis for the City and its suburbs based on results from the 2011, 2006, 2001, 1996 and 1991 Censuses of Population and Housing."}]