[{"url": "http://www.lake-lbj.net/", "passage_text": "Lake LBJ, named after President Lyndon B. Johnson, is part of the Highland Lakes chain of seven lakes starting in Austin and going northwest for over 85 miles. Lake LBJ starts near Horseshoe Bay, 45 miles from Austin, and goes all of the way to Kingsland. Sailing on Lake LBJ. Lake LBJ is normally a constant level lake and is just over 21 miles long with a maximum width of 10,800 feet. Lake LBJ is perfect for sailing, boating and all water related activities."}, {"url": "http://www.lakelbj.com/", "passage_text": "Advertise Contribute My Account. Officially known as Lake Lyndon B. Johnson, Lake LBJ is located on the Colorado River in the Texas Hill Country just one hour northwest of Austin Texas. As one of the few constant level lakes in Texas, Lake LBJ is it a popular weekend destination for boating, wakeboarding, water skiing, sailing, fishing and much more. Plan your next vacation at Lake LBJ and see for yourself why life is better at Lake LBJ. More Lake Information."}, {"url": "http://www.lakelbjmarina.com/location.htm", "passage_text": "Located next to Horseshoe Bay. Take Hwy 2147 from Hwy 281 in Marble Falls and drive about 4 miles west. Turn right on Wirtz Dam Road (across the street from Zeke's Bar & Grill). Lake LBJ Yacht Club and Marina is located 500 yards north of Hwy 2147 on Wirtz Dam Road. Lake LBJ Yacht Club & Marina. Constant level (see LCRA), Lake LBJ, Away from congested Metro. One hour from Austin, 90 minutes from San Antonio and a short distance from anywhere for boat lovers. From Austin I-35 @ Hwy 71 - West 38 miles to Hwy 281, north 4 miles to FM 2147, west 5 miles to Wirtz Dam Road, 500 yards north to Marina."}, {"url": "http://www.highlandlakes.com/lakelbj/", "passage_text": "Water sports are very popular on Lake LBJ. Lake LBJ, named after President Lyndon B. Johnson, is part of the Highland Lakes chain of seven lakes starting in Austin and going northwest for over 85 miles. Lake LBJ starts near Horseshoe Bay, 45 miles from Austin, and goes all of the way to Kingsland. Sailing"}, {"url": "http://lakesandhills.com/lakelbj.htm", "passage_text": "The Llano River intersects with the Colorado River in Kingsland and flows downstream through Lake LBJ providing water and recreational opportunities to the communities of Kingsland, Granite Shoals, Highland Haven, Sunrise Beach, Blue Lake, Dear Haven, Oak Ridge, Horseshoe Bay and Cottonwood Shores. "}, {"url": "http://www.lakelbjmarina.com/location.htm", "passage_text": "Location Lake LBJ Yacht Club & Marina is located at Wirtz Dam on Lake LBJ, 5 miles from Marble Falls, Texas, toward the world famous Horseshoe Bay Resort. Constant level (see LCRA), Lake LBJ, Away from congested Metro. One hour from Austin, 90 minutes from San Antonio and a short distance from anywhere for boat lovers. From Austin I-35 @ Hwy 71 - West 38 miles to Hwy 281, north 4 miles to FM 2147, west 5 miles to Wirtz Dam Road, 500 yards north to Marina."}, {"url": "https://en.wikipedia.org/wiki/Lake_Lyndon_B._Johnson", "passage_text": "Lake Lyndon B. Johnson (more commonly referred to as Lake LBJ and originally named Lake Granite Shoals) is a reservoir on the Colorado River in the Texas Hill Country in the United States. The reservoir was formed in 1950 by the construction of Granite Shoals Dam by the Lower Colorado River Authority. The lake was originally called Lake Granite Shoals. The dam would be renamed Wirtz Dam in 1952 for Alvin J. Wirtz, the first general counsel of the LCRA, and the lake was renamed to Lake Lyndon B. Johnson in 1965 in honor of US President Lyndon Baines Johnson."}, {"url": "https://en.wikipedia.org/wiki/Lake_Lyndon_B._Johnson", "passage_text": "The lake is used as a venue for aquatic recreation and provides cooling water for the Thomas J. Ferguson power plant operated by the LCRA. The boundary line separating Burnet County and Llano County runs down the center of the lake. Lake LBJ is located 45 miles northwest of Austin. The other reservoirs on the Colorado River are Lake Buchanan, Inks Lake, Lake Marble Falls, Lake Travis, Lake Austin, and Lady Bird Lake. The lake was originally called Lake Granite Shoals. The dam would be renamed Wirtz Dam in 1952 for Alvin J. Wirtz, the first general counsel of the LCRA, and the lake was renamed to Lake Lyndon B. Johnson in 1965 in honor of US President Lyndon Baines Johnson."}, {"url": "http://www.lakelbj.com/", "passage_text": "Lake LBJ. Officially known as Lake Lyndon B. Johnson, Lake LBJ is located on the Colorado River in the Texas Hill Country just one hour northwest of Austin Texas. As one of the few constant level lakes in Texas, Lake LBJ is it a popular weekend destination for boating, wakeboarding, water skiing, sailing, fishing and much more. Plan your next vacation at Lake LBJ and see for yourself why life is better at Lake LBJ. More Lake Information."}]