[{"url": "http://forums.whirlpool.net.au/archive/1903374", "passage_text": "The bigger issue I have found is that now I have Foxtel on T Box, I can no longer record anything, be it Foxtel or Free to air programs on my dvd recorder. I understand that it's up to Foxtel whether or not I can record the shows they broadcast as they have the copyright."}, {"url": "https://answers.yahoo.com/question/index?qid=20111211040547AAgIyHl", "passage_text": "Now I know it is the small tv with the problem, not power adapters, power points because I have tried it on different ones and the same results occur. So I would love someone to tell me what is wrong with the tv and what I will have to do (eg: take it into a shop to fix it and what to say to them)."}, {"url": "http://www.dtvforum.info/index.php/topic/122220-trouble-with-foxtel-or-is-it-my-equipment/", "passage_text": "You didn't mention if your Foxtel signal is via cable or satellite. Given the problem happens when you move/touch cables, it's likely to be either faulty connections on the cable, or faulty connection in the decoder, which may be a dry solder joint and moving the cable causes intermittent connection of that joint."}, {"url": "http://exchange.telstra.com.au/2014/09/04/foxtel-from-telstra-bringing-more-content-for-less/", "passage_text": "I totally agree, I am so frustrated with the amount of ads on Foxtel that I may as well cancel it. The content of repeat shows is disgusting. I am paying for nothing but crap tv with ads thrown in. What sort of offer is this, I pay nearly $100 pm, for what, it isn’t worth it."}, {"url": "http://community.foxtel.com.au/t5/Foxtel-TV/REAL-SOLUTION-to-Foxtel-IQ2-Error-F100-No-Signal-F108-Technical/td-p/35920", "passage_text": "You will no doubt have seen the standard Foxtel Response whenever these errors are mentioned : NO, there is nothing wrong with my decoder antenna connections. NO, there are no trees in the way interfering with signal strength. NO, there is not any bad weather in my area."}, {"url": "https://answers.yahoo.com/question/index?qid=20111211040547AAgIyHl", "passage_text": "Next. Hello im just wondering what is wrong with my tv. Now I have 2 tvs in my living room, the main tv which is connected to foxtel and a smaller one which is used to play the ps3 on. Now every time I played the ps3 over the past say 2 years I would always have the main one on as well, so I could watch that to. Now a..."}]