[{"url": "http://healthyeating.sfgate.com/health-benefits-strawberries-blueberries-blackberries-4515.html", "passage_text": "Vitamins and Minerals. Berries contain vitamin C, a nutrient that helps prevent infection and support a healthy immune system. You need between 75 and 90 milligrams of vitamin C each day. Strawberries contain the most per 1-cup serving with 97.6 milligrams."}, {"url": "http://www.whfoods.com/genpage.php/genpage.php?tname=foodspice&dbid=8", "passage_text": "In addition to the nutrients highlighted in our ratings chart, an in-depth nutritional profile for Blueberries is also available. This profile includes information on a full array of nutrients, including carbohydrates, sugar, soluble and insoluble fiber, sodium, vitamins, minerals, fatty acids, amino acids and more."}, {"url": "http://www.livestrong.com/article/347012-what-nutrients-are-in-blueberries/", "passage_text": "Blueberries are an especially rich source of vitamin C, a nutrient that helps you metabolize fats and keep tendons and ligaments healthy. Each serving of blueberries provides 14.4 milligrams of vitamin C -- 19 and 16 percent of the recommended daily dose for women and men, respectively."}, {"url": "http://healthyeating.sfgate.com/food-nutrients-found-blueberries-1210.html", "passage_text": "Vitamin C. Blueberries are a rich source of vitamin C. This powerful nutrient acts like an antioxidant in your system by neutralizing harmful free radicals. When free radicals scavenge through your blood, they damage cells and increase your risk of chronic illness."}, {"url": "http://www.blueberrycouncil.org/healthy-living/blueberry-nutrition-facts/", "passage_text": "Vitamins and Minerals in Blueberries. Blueberries contribute vitamins and minerals including vitamin C, vitamin K and manganese, making them a good choice to help meet nutrient needs. For more in depth information and scientific research on blueberries, check out our blueberry health tips and blueberry health research."}, {"url": "http://www.nutrition-and-you.com/blueberries.html", "passage_text": "Health benefits of blueberries. Blueberries are very low in calories. 100 g fresh berries carry just 57 calories. Nonetheless, they possess notable health benefiting plant-nutrients such as soluble dietary fiber, minerals, vitamins, and pigment anti-oxidants that contribute immensely towards optimum health and wellness."}, {"url": "http://www.medicalnewstoday.com/articles/287710.php", "passage_text": "The blueberry's fiber, potassium, folate, vitamin C, vitamin B6 and phytonutrient content, coupled with its lack of cholesterol, all support heart health. The fiber in blueberries helps lower the total amount of cholesterol in the blood and decrease the risk of heart disease."}, {"url": "http://www.healthaliciousness.com/fruits/blueberry.php", "passage_text": "Natural vitamins, minerals, and nutrients found in Blueberries: Vitamin C | Vitamin K | Dietary Fiber | Manganese |. How to choose Blueberries: Look for the darkest blueberries you can find."}]