[{"url": "http://www.herbs2000.com/herbs/herbs_mullein.htm", "passage_text": "The leaves and flowers of the herb are widely used as an infusion to diminish the production of mucus as well as arouse the coughing up of phlegm or thick mucus. It may be mentioned here that mullein blends well with other expectorants (medicines for cough) like coltsfoot and thyme."}, {"url": "http://www.naturalnews.com/033990_mullein_medicinal_herbs.html", "passage_text": "Native Americans used the leaves of the mullein plant to ease respiratory discomfort. Mullein tea is also an effective way of treating respiratory and other types of conditions such as asthma, bronchitis, and allergies. It is also effective in treating sore throats and coughs."}, {"url": "http://botanical.com/botanical/mgmh/m/mulgre63.html", "passage_text": "[ Top ]. ---Parts Used--- The leaves and flowers are the parts used medicinally. Fresh Mullein leaves are also used for the purpose of making a homoeopathic tincture. ---Constituents--- The leaves are nearly odourless and of a mucilaginous and bitterish taste."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-572-MULLEIN.aspx?activeIngredientId=572&activeIngredientName=MULLEIN", "passage_text": "Mullein is applied to the skin for wounds, burns, hemorrhoids, bruises, frostbite, and skin infections (cellulitis). The leaves are used topically to soften and protect the skin. In manufacturing, mullein is used as a flavoring ingredient in alcoholic beverages."}, {"url": "http://www.herbs2000.com/herbs/herbs_mullein.htm", "passage_text": "INFUSION: An infusion prepared with the dried mullein leaves may be used for unceasing coughs as well as swelling and irritation in the throat. Normally, the infusion is prepared by adding 50 grams of the dried leaves of the herb to 500 ml of water."}, {"url": "http://www.uofmhealth.org/health-library/hn-2133009", "passage_text": "A tea of mullein is made by pouring 1 cup (250 ml) of boiling water over 1–2 teaspoons (5–10 grams) of dried leaves or flowers and steeping for ten to fifteen minutes. The tea can be drunk three to four times per day. For the tincture, 1/4–3/4 teaspoon (1–4 ml) is taken"}, {"url": "http://botanical.com/botanical/mgmh/m/mulgre63.html", "passage_text": "---Parts Used--- The leaves and flowers are the parts used medicinally. Fresh Mullein leaves are also used for the purpose of making a homoeopathic tincture. ---Constituents--- The leaves are nearly odourless and of a mucilaginous and bitterish taste."}]