[{"url": "https://en.wikipedia.org/wiki/Subsidies_in_India", "passage_text": "Even if merit subsidies are set aside, the remaining subsidies alone amount to 10.7% of GDP, comprising 3.8% and 6.9% of GDP, pertaining to Centre and State subsidies respectively. The average all-India recovery rate for these non-merit goods/services is just 10.3%, implying a subsidy rate of almost 90%. The total non-merit subsidies for the year 1994-95 amounted to 10.71% of GDP at market prices, resulting in a combined fiscal deficit of 7.3% for the Centre, States and Union Territories. Therefore, if these subsidies were phased out, the same would have a discernible impact on the fiscal deficit."}, {"url": "http://www.masslegalhelp.org/housing/multi-family-subsidized-housing", "passage_text": "Section 236 Rental Assistance Program (RAP). This is an early form of rental subsidy that was used for up to 20% of the units in Section 236 developments prior to the Section 8 program. Some developments still have Section 236 RAP assistance. With this subsidy, your rent is set at 30% of income. A number of apartments are subsidized under the Section 8 Moderate Rehabilitation (or mod rehab) program. In exchange for providing a moderate level of rehabilitation to a property, the owner is provided a rent subsidy for a number of years by the local housing authority or a regional nonprofit housing agency."}, {"url": "https://en.wikipedia.org/wiki/Subsidy", "passage_text": "A subsidy is a form of financial aid or support extended to an economic sector (or institution, business, or individual) generally with the aim of promoting economic and social policy. The most common forms of subsidies are those to the producer or the consumer. Producer/Production subsidies ensure producers are better off by either supplying market price support, direct support, or payments to factors of production."}, {"url": "http://www.bcbsm.com/index/health-insurance-help/faqs/topics/buying-insurance/eligible-subsidy.html", "passage_text": "A subsidy is financial assistance that helps you pay for something. It's not a loan; you don't pay it back. There are two kinds of subsidies available from the federal government for individual health insurance plans. 1  The Advanced Premium Tax Credit lowers your monthly health insurance payment, or premium. If you're an individual who makes about $29,000 or less, or a family of four that makes about $59,000 or less, you may qualify for both subsidies. If you get a subsidy, you'll have to report it when you send in your taxes. When it's time to file your taxes, you'll get a 1095 form with all the necessary information."}, {"url": "https://en.wikipedia.org/wiki/Subsidies_in_India", "passage_text": "However, the argument against subsidies in India does not consider that just agricultural and fisheries subsidies form over 40% of the EU budget (see Agricultural subsidy) although in Europe less than 10% of the people compared to India will be affected. The total non-merit subsidies for the year 1994-95 amounted to 10.71% of GDP at market prices, resulting in a combined fiscal deficit of 7.3% for the Centre, States and Union Territories. Therefore, if these subsidies were phased out, the same would have a discernible impact on the fiscal deficit."}, {"url": "http://www.investopedia.com/terms/s/subsidy.asp", "passage_text": "DEFINITION of 'Subsidy'. A benefit given by the government to groups or individuals usually in the form of a cash payment or tax reduction. The subsidy is usually given to remove some type of burden and is often considered to be in the interest of the public. Politics play an important part in subsidization. A subsidy is a benefit given to an individual, business or institution, typically by the government. Subsidies are given to promote a social good or an economic policy."}, {"url": "http://www.masslegalhelp.org/housing/multi-family-subsidized-housing", "passage_text": "This is an early form of rental subsidy that was used in Section 221(d)(3) and Section 236 developments prior to the Section 8 program. Some developments still have rent supplement assistance. Your rent is the higher of either 30% of income or 30% of the gross rent. A number of apartments are subsidized under the Section 8 Moderate Rehabilitation (or mod rehab) program. In exchange for providing a moderate level of rehabilitation to a property, the owner is provided a rent subsidy for a number of years by the local housing authority or a regional nonprofit housing agency."}, {"url": "http://www.investordictionary.com/definition/subsidy", "passage_text": "A subsidy is a grant or monetary gift given by a private person or entity (often a government) to another private person or entity, as financial assistance or to help launch an enterprise. Examples of subsidies include welfare, farm subsidies, and certain aspects of student loans. A subsidy normally exemplifies the opposite of a tax, but can also be given using a reduction of the tax burden. These kinds of subsidy are generally called tax expenditures."}, {"url": "http://www.masslegalhelp.org/housing/multi-family-subsidized-housing", "passage_text": "The term of these Section 8 subsidy contracts can vary from 5 to 40 years. Rent is set at 30% of your income. 75 This is a very large and important resource. There are approximately 33,000 apartments with Section 8 project-based multifamily assistance in Massachusetts. A number of apartments are subsidized under the Section 8 Moderate Rehabilitation (or mod rehab) program. In exchange for providing a moderate level of rehabilitation to a property, the owner is provided a rent subsidy for a number of years by the local housing authority or a regional nonprofit housing agency."}]