[{"url": "http://rabbit.org/faq-orphaned-baby-bunnies/", "passage_text": "Older baby bunnies who are found outside of the nest may not be orphaned or in need of assistance. This is most often the case. Baby cottontails are born without fur but develop a full coat in a week. Their eyes open in 10 days, and in three to four weeks they are weaned. You will not see the mom. The mom will only come back in the middle of the night to feed her babies. If the mom was killed, the best thing you can do for a wild orphaned baby bunny is to get in touch with a skilled rehabilitator. In the meantime, call your local humane society or animal control and one of these vets for a wildlife referral: Rabbit Vets and Pet Bunny Vets"}, {"url": "http://rabbit.org/faq-orphaned-baby-bunnies/", "passage_text": "Bunnies do not voluntarily leave the nest until around 4 – 5 weeks old. One way to help protect a nest from a dog (or lawnmower) is to use a cheap, plastic lattice work style laundry basket that you can turn over and place on top of the nest. You will not see the mom. The mom will only come back in the middle of the night to feed her babies. If the mom was killed, the best thing you can do for a wild orphaned baby bunny is to get in touch with a skilled rehabilitator. In the meantime, call your local humane society or animal control and one of these vets for a wildlife referral: Rabbit Vets and Pet Bunny Vets"}, {"url": "http://animalstime.com/what-feed-rabbits-what-feed-baby-rabbits/", "passage_text": "According to the House Rabbit Society, baby bunnies must be fed with alfalfa hay with the introduction of some grass in the first 6 to 7 months. The amount of hay must be lowered down steadily compensating it with a grass only until your bunny reaches 1 year when the lone grass makes the bulk of bunnies diet. Feeding rabbits can be a daunting task especially when you’re not aware as to what to feed rabbits. There is a general belief regarding rabbits diet in that the species can be fed on lettuce and carrots; yet the truth is that feeding these items to bunnies might lead to the death."}, {"url": "http://www.raising-rabbits.com/feeding-baby-rabbits.html", "passage_text": "Feeding Baby Rabbits. Feeding baby rabbits falls mostly to the mother rabbit for the first 3 weeks of the bunny’s life. Between 3 weeks and around 6 weeks old, the baby rabbits need less and less of mom, and more and more pellets and hay. If you’re still nervous about the doe, just leave the nestbox outside the nest all day, and then put it back in with the doe about suppertime. The foster doe will do a much better job at feeding baby rabbits than you could, if you don’t overwhelm the new doe with a bazillion bunnies."}, {"url": "http://www.wikihow.com/Care-for-a-Baby-Wild-Rabbit", "passage_text": "Five Parts: Preparing a Place for the Rabbits Planning to Feed the Rabbits Feeding a Newborn Bunny Providing Bunnies with Outside Time Transitioning Rabbits Outdoors. With the wild rabbit population increasing in urban areas, the probability of discovering a nest of baby rabbits is higher than ever these days. Unfortunately, nests that appear abandoned are often not, and wild baby rabbits removed from their nests by humans are unlikely to survive without the care of a vet or skilled wildlife rehabilitator. In many states, it is illegal to care for wild rabbits unless you are a licensed"}, {"url": "http://www.mybunny.org/info/caring-for-newborn-baby-rabbits/", "passage_text": "How much to feed varies greatly on what breed of rabbit you are feeding, and how big the kit is, but here is a basic guideline for the daily amount to feed a domestic rabbit who will be approximately 5-6 pounds as an adult (average rabbit size). You can increase the amounts as needed for larger breeds. WHAT TO FEED THE BABIES. Baby rabbits should be fed Kitten Milk Replacer (KMR) or goat milk, which you can buy at pet stores, or sometimes even a local veterinarian’s office. Because rabbit milk is the most caloric of all mammals, we add in one tablespoon of 100% heavy whipping cream (no sugar) to each can of KMR."}, {"url": "http://www.mybunny.org/info/caring-for-newborn-baby-rabbits/", "passage_text": "Baby rabbits feed from their mothers while lying on their backs. You may loosely wrap baby in a soft face cloth or hand towel and lay it on your lap or in the crook of your arm. If bunny will NOT eat this way, of course, do the best you can. WHAT TO FEED THE BABIES. Baby rabbits should be fed Kitten Milk Replacer (KMR) or goat milk, which you can buy at pet stores, or sometimes even a local veterinarian’s office. Because rabbit milk is the most caloric of all mammals, we add in one tablespoon of 100% heavy whipping cream (no sugar) to each can of KMR."}, {"url": "http://animalstime.com/what-feed-rabbits-what-feed-baby-rabbits/", "passage_text": "Hence, you can feed your bunnies with grass hay and alfalfa hay but bear in mind these vegetables are not good for the regular feeding because of the excess calcium involved. Before feeding your bunnies grass, make sure that it’s completely dry and is has not emerged from a place with pesticides. Feeding rabbits can be a daunting task especially when you’re not aware as to what to feed rabbits. There is a general belief regarding rabbits diet in that the species can be fed on lettuce and carrots; yet the truth is that feeding these items to bunnies might lead to the death."}]