[{"url": "https://simple.wikipedia.org/wiki/Assassination_attempt_on_Ronald_Reagan", "passage_text": "The Assassination attempt on Ronald Reagan happened on Monday, March 30, 1981. 69 days after becoming President, Ronald Reagan was leaving after a speaking engagement at the Washington Hilton Hotel in Washington, D.C. . Shots were fired by John Hinckley, Jr. as he left to enter the presidential limo."}, {"url": "http://news.bbc.co.uk/onthisday/hi/dates/stories/march/30/newsid_2530000/2530913.stm", "passage_text": "1981: President Reagan is shot President Ronald Reagan has been shot and wounded after a lone gunman opened fire in Washington. He is currently undergoing emergency surgery at George Washington University Hospital but there are unconfirmed reports he walked in unaided. Initial reports claim he may have a punctured lung."}, {"url": "http://www.youtube.com/watch?v=3Bj6aOgfcJU", "passage_text": "The Reagan assassination attempt occurred on March 30, 1981, just 69 days into the presidency of Ronald Reagan. While leaving a speaking engagement at the Washington Hilton Hotel in Washington, D.C., President Reagan and three others were shot and wounded by John Hinckley."}, {"url": "http://news.bbc.co.uk/onthisday/hi/dates/stories/march/30/newsid_2530000/2530913.stm", "passage_text": "1981: President Reagan is shot President Ronald Reagan has been shot and wounded after a lone gunman opened fire in Washington. 1981: President Reagan is shot. He is currently undergoing emergency surgery at George Washington University Hospital but there are unconfirmed reports he walked in unaided."}, {"url": "http://www.nytimes.com/learning/general/onthisday/big/0330.html", "passage_text": "Washington, March 30 -- President Reagan was shot in the chest today by a gunman, apparently acting alone, as Mr. Reagan walked to his limousine after addressing a labor meeting at the Washington Hilton Hotel. The White House press secretary and two law-enforcement officers were also wounded by a burst of shots."}, {"url": "https://en.wikipedia.org/wiki/Reagan_assassination_attempt", "passage_text": "The attempted assassination of United States President Ronald Reagan occurred on March 30, 1981, 69 days into his presidency. While leaving a speaking engagement at the Washington Hilton Hotel in Washington, D.C., President Reagan and three others were shot and wounded by John Hinckley, Jr."}, {"url": "http://learning.blogs.nytimes.com/2012/03/30/march-30-1981-president-reagan-is-shot/comment-page-1/", "passage_text": "On March 30, 1981, President Ronald Reagan was shot and seriously injured outside a Washington hotel by John W. Hinckley Jr. Also wounded were the White House news secretary James Brady, who was left paralyzed by the shooting, a Secret Service agent and a District of Columbia police officer."}, {"url": "http://www.pbs.org/wgbh/americanexperience/features/bonus-video/presidents-crisis-reagan/", "passage_text": "On March 30, 1981, 70 days into his presidency, President Reagan was shot outside the Washington Hilton Hotel. Narrator: On March 30th, seventy days into his presidency, Reagan delivered yet another pitch -- to a union convention at"}]