[{"url": "https://www.kidney.org/atoz/content/dialysisinfo", "passage_text": "Usually, each hemodialysis treatment lasts about four hours and is done three times per week. A type of hemodialysis called high-flux dialysis may take less time. You can speak to your doctor to see if this is an appropriate treatment for you."}, {"url": "https://www.kidney.org/atoz/content/dialysisinfo", "passage_text": "Average life expectancy on dialysis is 5-10 years, however, many patients have lived well on dialysis for 20 or even 30 years. Talk to your healthcare team about how to take care of yourself and stay healthy on dialysis."}, {"url": "https://www.kidney.org/atoz/content/dialysisinfo", "passage_text": "If your kidneys have failed, you will need to have dialysis treatments for your whole life unless you are able to get a kidney transplant. Life expectancy on dialysis can vary depending on your other medical conditions and how well you follow your treatment plan."}, {"url": "http://www.aakp.org/education/resourcelibrary/dialysis-resources/item/what-are-the-pros-and-cons-of-undergoing-kidney-dialysis-if-you-are-not-a-candidate-for-a-kidney-transplant-how-long-can-you-remain-on-dialysis.html", "passage_text": "Not surprisingly, the younger one is when stricken by ESRD, the longer the possible life extension. As examples, a 20 year old may live another 40 years while an 80 year old may expect less than five years of additional life from ESRD treatment. What caused the kidney failure can often limit future life."}, {"url": "http://www.davita.com/kidney-disease/dialysis/the-basics/dialysis:-questions-and-answers/e/5071", "passage_text": "Most people qualify for Medicare when they need dialysis or a transplant, even if they are under age 65. Medicare pays for 80 percent of treatment for kidney disease when kidney function has dropped to 10-15 percent, or when your doctor justifies it."}, {"url": "http://www.billpeckham.com/from_the_sharp_end_of_the/2008/03/dialysis-lifesp.html", "passage_text": "Two things to know-you can live a long time on dialysis; do not max out your credit cards. Remember when looking at statistics that averages are made of extremes. If five patients live two years and one patient lives twenty years, the average life span would be five years."}, {"url": "http://www.davita.com/kidney-disease/dialysis/the-basics/dialysis:-questions-and-answers/e/5071", "passage_text": "How long you can live on dialysis, and how well you do, will depend on a number of things, including how healthy you are, your attitude, your quality of healthcare and how much you take an active role in your care. Sign up for no-cost Kidney Smart® education class to learn more about kidney disease."}, {"url": "http://www.healthguideinfo.com/kidney-disorders/p96099/", "passage_text": "How long can I be on peritoneal dialysis? Find out about peritoneal dialysis, what life is like while on it and the prognosis for those suffering from this condition. Learn how long a patient can be on peritoneal dialysis while awaiting kidney transplant."}, {"url": "http://www.webmd.com/a-to-z-guides/kidney-dialysis?page=2", "passage_text": "Kidney dialysis is a necessary treatment for people with end-stage kidney disease or permanent kidney failure. You need dialysis if you've lost about 85% to 90% of your kidney function. Temporary dialysis may be needed in some cases."}]