[{"url": "http://emedicine.medscape.com/article/326510-overview", "passage_text": "Definition. Traumatic brain injury (TBI) is a nondegenerative, noncongenital insult to the brain from an external mechanical force, possibly leading to permanent or temporary impairment of cognitive, physical, and psychosocial functions, with an associated diminished or altered state of consciousness. The definition of TBI has not been consistent and tends to vary according to specialties and circumstances. Often, the term brain injury is used synonymously with head injury, which may not be associated with neurologic deficits."}, {"url": "http://medical-dictionary.thefreedictionary.com/Cerebral+contusion", "passage_text": "cerebral contusion contusion of the brain following a head injury. It may occur with extradural or subdural collections of blood, in which case the patient may be left with neurologic defects or epilepsy. (See also cranial hematoma .). contrecoup contusion one resulting from a blow on one side of the head with damage to the cerebral hemisphere on the opposite side by transmitted force."}, {"url": "http://medical-dictionary.thefreedictionary.com/Cerebral+contusion", "passage_text": "Etymology: L, contundere, to bruise. an injury that does not disrupt the integrity of the skin, caused by a blow to the body and characterized by swelling, discoloration, and pain. The immediate application of cold may limit the development of a contusion. Also called bruise. Compare ecchymosis. contrecoup contusion one resulting from a blow on one side of the head with damage to the cerebral hemisphere on the opposite side by transmitted force."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=2838", "passage_text": "Contusion: Another name for a bruise. What is a bruise? A bruise, or contusion, is caused when blood vessels are damaged or broken as the result of a blow to the skin (be it bumping against something or hitting yourself with a hammer)."}, {"url": "http://www.mayoclinic.org/diseases-conditions/traumatic-brain-injury/basics/definition/CON-20029302", "passage_text": "Appointments & care. At Mayo Clinic, we take the time to listen, to find answers and to provide you the best care. Traumatic brain injury occurs when an external mechanical force causes brain dysfunction. Traumatic brain injury usually results from a violent blow or jolt to the head or body. An object penetrating the skull, such as a bullet or shattered piece of skull, also can cause traumatic brain injury. "}, {"url": "http://medical-dictionary.thefreedictionary.com/brain+contusion", "passage_text": "brain contusion. Neurology A head injury often associated with a concussion, which is of sufficient force to bruise the brain surface and cause extravasation of blood without rupturing the pia-arachnoid. See Coup, Contrecoup"}, {"url": "https://en.wikipedia.org/wiki/Cerebral_contusion", "passage_text": "Cerebral contusion, Latin contusio cerebri, a form of traumatic brain injury, is a bruise of the brain tissue. Like bruises in other tissues, cerebral contusion can be associated with multiple microhemorrhages, small blood vessel leaks into brain tissue. Contusion occurs in 20–30% of severe head injuries. A cerebral laceration is a similar injury except that, according to their respective definitions, the pia-arachnoid membranes are torn over the site of injury in laceration and are not torn in contusion."}, {"url": "http://emedicine.medscape.com/article/326510-overview", "passage_text": "Overview. Traumatic brain injury (TBI) is the result of an external mechanical force applied to the cranium and the intracranial contents, leading to temporary or permanent impairments, functional disability, or psychosocial maladjustment. The definition of TBI has not been consistent and tends to vary according to specialties and circumstances. Often, the term brain injury is used synonymously with head injury, which may not be associated with neurologic deficits."}]