[{"url": "http://www.ehow.co.uk/about_5340561_long-cure-bladder-infection.html", "passage_text": "As a rule, the further up your urinary tract the infection has travelled, the more severe your case it. The severity of your case plays a major role in how long it takes to treat it. Bladder infections are relatively harmless and can be cured in a matter of days or weeks."}, {"url": "http://www.ehow.com/about_5317658_long-antibiotics-work-bladder-infection.html", "passage_text": "Treatment is generally done through one of several brands of antibiotics, depending on the seriousness of the infection. The antibiotics can normally cure a bladder infection within two weeks or so."}, {"url": "http://www.ehow.co.uk/about_5317658_long-antibiotics-work-bladder-infection.html", "passage_text": "Most antibiotics will be prescribed for a week to 10 days but there are some that work in one to three days. Short-term treatments are usually reserved for women because men tend to respond better to long-term treatment."}, {"url": "http://www.howlongdoes.com/health/how-long-does-a-bladder-infection-last/", "passage_text": "Regular health checkups are a safer way to avoid the increase of a bladder infection, if any. In case of men, how long does a bladder infection last has a different answer of up to 10 days or even more depending on the condition. Prevention, detection and treatment are necessary in case of a bladder infection."}, {"url": "http://www.ehow.com/about_5317658_long-antibiotics-work-bladder-infection.html", "passage_text": "Most antibiotics will be prescribed for a week to 10 days but there are some that work in one to three days. Short-term treatments are usually reserved for women because men tend to respond better to long-term treatment."}, {"url": "https://answers.yahoo.com/question/index?qid=20130802095748AADVfkS", "passage_text": "Best Answer: With antibiotics it should take no more than 7 days for your bladder infection to go. The symptoms should go or atleast be relieved within the first 48 hours of taking the antibiotics. Depending on how long you've taken them if more than a week then I would visit your doctors and tell them about this."}, {"url": "http://www.ehow.com/about_5317658_long-antibiotics-work-bladder-infection.html", "passage_text": "Bladder infections (also known as urinary tract infections or cystitis) are very common and most people will experience at least one in their lifetime. Although bladder infections are not serious, they can be painful and inconvenient."}]