[{"url": "https://en.wikipedia.org/wiki/Caffeine", "passage_text": "Caffeine is classified by the Food and Drug Administration as  generally recognized as safe  (GRAS). Toxic doses, over 10 grams per day for an adult, are much higher than typical dose of under 500 milligrams per day. A cup of coffee contains 80–175 mg of caffeine, depending on what bean (seed) is used and how it is prepared (e.g. drip, percolation, or espresso). Caffeine can have both positive and negative health effects. It can be used to treat bronchopulmonary dysplasia of prematurity, and to prevent apnea of prematurity: caffeine citrate was placed on the WHO Model List of Essential Medicines in 2007."}, {"url": "http://svmsl.chem.cmu.edu/vmsl/Caffeine/Caffeine_effects.htm", "passage_text": "It falls in the stimulant class, and effects the central nervous system. The lethal dose of caffeine is too high to be of daily concern; the lethal dose is 170 mg/kg, or 12.5-14.6 g for an average adult male. This corresponds to drinking about 80-100 cups of coffee in a short period of time assuming the entire amount was absorbed into the body. "}, {"url": "http://webmarksonline.com/what-is-the-lethal-dose-of-caffiene/", "passage_text": "“The LD50 of caffeine in humans is dependent on individual sensitivity, but is estimated to be about 150 to 200 milligrams per kilogram of body mass or roughly 80 to 100 cups of coffee for an average adult.”. “overdose for adults requires roughly 10 grams of caffeine. Wikipedia says …. “The LD50 of caffeine in humans is dependent on individual sensitivity, but is estimated to be about 150 to 200 milligrams per kilogram of body mass or roughly 80 to 100 cups of coffee for an average adult.”. which corroborates what the calculator gave. LD50 is the “median lethal dose”. So it is difficult to overdose caffeine by drinking coffee by a healthy person. But it is possible to reach lethal dose by caffeine pills or by individuals who has impaired ability to metabolize caffeine. PopSci.com writes …"}, {"url": "https://answers.yahoo.com/question/index?qid=20090118223847AAmqXdK", "passage_text": "Soft drinks and coffee/tea are other sources you should consume in moderation. While I can't give you a lethal dose, know that it IS possible in cases for caffeine to have negative health effects (which may or may not lead to death) depending on the dosage and/on context. Here's a related article: http://www.ctv.ca/servlet/ArticleNews/st... "}, {"url": "http://www.themedicalquestions.com/illness/what-is-a-lethal-dose-of-caffeine.html", "passage_text": "http://www.consumergenetics.com/caffeine_test.php. The lethal dose of caffeine is 2 grams of caffeine per day, that is, 80-100 cups of coffee a day. For slow metabolizers of caffeine, the lethal dose of caffeine can be lower. It's dependent on weight & individual sensitivity & estimated to be about 150-200 milligrams/kilogram of body mass. ChaCha on! [ Source: http://www.chacha.com/question/what-is-a-lethal-dose-of-caffeine ]. More Answers to  What is a lethal dose of caffeine ."}, {"url": "https://faculty.washington.edu/chudler/caff.html", "passage_text": "In massive doses, caffeine is lethal. A fatal dose of caffeine has been calculated to be more than 10 grams (about 170 mg/kg body weight) - this is the same as drinking 80 to 100 cups of coffee in rapid succession-not an easy thing to do."}, {"url": "https://en.wikipedia.org/wiki/Caffeine", "passage_text": "Caffeine is a central nervous system (CNS) stimulant of the methylxanthine class of psychoactive drugs. It is the world's most widely consumed psychoactive drug, but unlike many other psychoactive substances, it is legal and unregulated in nearly all parts of the world. Caffeine can have both positive and negative health effects. It can be used to treat bronchopulmonary dysplasia of prematurity, and to prevent apnea of prematurity: caffeine citrate was placed on the WHO Model List of Essential Medicines in 2007."}, {"url": "http://www.standard.net/Health/2014/08/21/All-about-caffeine", "passage_text": "The lethal dose for caffeine is in the neighborhood of 150 milligrams per kilogram of body weight (one kilogram equals roughly 2.2 pounds). While the average person’s caffeine consumption is around 200 milligrams a day, the Mayo Clinic advises against exceeding 500 to 600 milligrams per day. "}]