[{"url": "http://www.enkivillage.com/difference-between-vegan-and-vegetarian.html", "passage_text": "One of the main differences between a vegan and a vegetarian is in not only what they eat but in what they will not eat. A vegan will not eat anything to do with animals, which includes meat, poultry, fish, dairy, eggs, honey or gelatin. Their diet consists solely of beans, grains, fruits, nuts, seeds and vegetables. A lacto-ovo vegetarian is a vegetarian who does include eggs and dairy into their diet. To be considered a vegetarian, you would not eat meat of any kind. The vegetarian way of eating is often called a meat-free or meatless diet."}, {"url": "https://answers.yahoo.com/question/index?qid=20080728234126AAraH8P", "passage_text": "Best Answer: Hi! Your question is very common. The difference between a vegan and a vegetarian is that a vegan eliminates all animal products from their diet, including dairy. Those following a vegan lifestyle do not wear leather and avoid products made from animals such as wool, silk and down. "}, {"url": "http://www.differencebetween.com/difference-between-vegetarian-and-vegan/", "passage_text": "• A vegetarian does not include meat, poultry and fish in his diet whereas a vegan does not eat animal products such as milk and cheese. • A vegetarian does not mind eating animal products and wearing clothing made of animal products whereas a vegan is opposed to wearing clothing made of animal products. A vegetarian is a person who does not consume meat, poultry, seafood or fish. A vegan is a person that does not consume any product that is derived from animals. These products include dairy products and other"}, {"url": "http://www.wisegeek.org/what-is-the-difference-between-a-vegan-and-a-vegetarian.htm", "passage_text": "A vegan will generally not use any product made from animals, including silk. An ovo-vegetarian will eat eggs, while a vegan will not. Cattle consume more protein in grains than they deliver in meat. A vegan won't wear any clothing made of leather, unless it's special vegan leather that's made without animal products. Vegan mayonnaise doesn't use eggs. Vegetarian meat crumbles are made of textured vegetable protein. Some vegans have an allergy or sensitivity to dairy products or avoid them for ethical reasons. Ovo-vegetarians will eat eggs, but not dairy. Lacto-ovo vegetarians will eat eggs and dairy products. The reasons for these choices are varied and based on individual beliefs. In some cases they are based on moral choices, and in others on dietary needs or simple preference."}, {"url": "http://www.thevegetariancenter.com/", "passage_text": "The difference between Vegan and Vegetarian is basic. There are some foods that come from animals that Vegetarians do eat and Vegans don't. These are milk, cheese and various other dairy items, eggs and honey. Speaking of cheese, a product called rennet is used in the making of cheese. "}, {"url": "http://www.enkivillage.com/difference-between-vegan-and-vegetarian.html", "passage_text": "The main difference between being a vegan and being a vegetarian is that being vegetarian is mostly limited to what a person eats while being a vegan is a lifestyle. A vegan does not eat meal, they also do not have anything to do with animal products in their lives. A lacto-ovo vegetarian is a vegetarian who does include eggs and dairy into their diet. To be considered a vegetarian, you would not eat meat of any kind. The vegetarian way of eating is often called a meat-free or meatless diet."}, {"url": "http://animalrights.about.com/od/veganandvegetariandiets/a/What-Is-The-Difference-Between-A-Vegan-And-A-Vegetarian.htm", "passage_text": "The term  lacto-ovo vegetarian  is sometimes used to specify that the person does eat dairy and eggs. Anyone who doesn't eat meat is considered vegetarian, including vegans, lacto-vegetarians, ovo-vegetarians, and lacto-ovo vegetarians. A vegetarian diet is sometimes called a meatless or meat-free diet. Vegetarians do not eat animal flesh. "}, {"url": "http://www.diffen.com/difference/Vegan_vs_Vegetarian", "passage_text": "Diffen › Food › Diet & Nutrition. Neither vegans nor vegetarians eat meat. However, while vegetarians tend to consume dairy products and eggs, a vegan avoids all animal products, including eggs and dairy, and often inedible animal-based products, such as leather, wool, and silk. Vegans endeavor not to use or consume animal products of any kind. Vegetarianism is the practice of a diet that excludes meat (including game and slaughter by-products; fish, shellfish and other sea animals; and poultry). There are several variants of the diet, some of which also exclude eggs."}, {"url": "http://www.wisegeek.org/what-is-the-difference-between-a-vegan-and-a-vegetarian.htm", "passage_text": "Post 11. A vegan is the strictest form of vegetarian. They do not eat any form of animal by products, including honey. Any person who eats white meat (fish, seafood) is considered as a pestician). Any person who eats red meat as well as vegetarian diet is known as a semi vegetarian or flexitarian. Ovo-vegetarians will eat eggs, but not dairy. Lacto-ovo vegetarians will eat eggs and dairy products. The reasons for these choices are varied and based on individual beliefs. In some cases they are based on moral choices, and in others on dietary needs or simple preference."}, {"url": "http://www.diffen.com/difference/Vegan_vs_Vegetarian", "passage_text": "Lacto-vegetarians consume dairy products, but not eggs; ovo-vegetarians eat eggs, but not dairy products; and lacto-ovo-vegetarians eat eggs as well as dairy products. There is also pescetarianism, a vegetarian-like diet that avoids meat and poultry but does include fish. Vegans endeavor not to use or consume animal products of any kind. Vegetarianism is the practice of a diet that excludes meat (including game and slaughter by-products; fish, shellfish and other sea animals; and poultry). There are several variants of the diet, some of which also exclude eggs."}]