[{"url": "https://en.wikipedia.org/wiki/Burmese_cat", "passage_text": "Not to be confused with the Sacred Cat of Burma; see Birman. The Burmese (Thai: ทองแดง or ศุภลักษณ์) rtgs: Thong Daeng or Suphalak, meaning copper colour) is a breed of domestic cat originating in Southeast Asia and developed in the United States. Most modern Burmese are descendants of one female cat called Wong Mau, which was brought from Burma to America in 1930 and bred with American Siamese. From there, American and British breeders developed distinctly different Burmese breed standards, which is unusual among pedigreed domestic cat"}, {"url": "http://www.petplace.com/article/cats/keeping-your-cat-healthy/senior-cat-care/life-expectancy-in--cats", "passage_text": "Today cats live longer than ever. Just 20 years ago the life expectancy of a cat was four to six years; today they live 15 years or more. Life expectancy in cats depends on many things, but the most important factor is whether he is an indoor-only cat or an outdoor cat. Life expectancy varies significantly between the two. 1  Indoor cats generally live from 12-18 years of age. 2  Many may live to be in their early 20s."}, {"url": "http://cats.petbreeds.com/l/40/Burmese", "passage_text": "But for cat lovers around the world, it just doesn’t matter…. The 25 Longest-Living Cats With an average life expectancy of 15 years or more, these cat breeds will be part of the family for a long time. With an average life expectancy of 15 years or more, these cat breeds will be part of the family for a long time. "}, {"url": "http://www.answers.com/Q/What_is_the_life_span_or_a_burmese_cat", "passage_text": "The average lifespan of cats is much lower than the possible life expectancy, which is in a range from 10 to 17 years. The mortality rate for wild cats can be high, and most … adult cats do not live 10 years, as they die of diseases, lack of nutrition, or accidents. Some fortunate cats, however, have lived up to 30 years."}, {"url": "http://www.pet-adoption-guide.com/burmese-cat.html", "passage_text": "Lifespan and Weight. The average lifespan of a Burmese Cat is around 15 years. However, with the advancement of veterinary medicine, pets have been known to live up to 20 years and even longer. The average weight for this breed of cat is around 15 lbs. Common Diseases. Luckily the Burmese has very little health problems"}, {"url": "http://www.pets4homes.co.uk/pet-advice/cat-lifespan-the-life-expectancy-of-cats.html", "passage_text": "The average life expectancy of cats. Taking into account all factors, breeds and causes of death, the average lifespan of the cat is between fifteen and seventeen years. "}, {"url": "http://www.anniemany.com/2013/06/life-expectancy-in-burmese-cats.html", "passage_text": "Life expectancy in Burmese Cats. Burmese is a healthy cat breed with almost no genetic health problems.These cats are not to be confused with Sacred cat of Burma or Siamese.A normal Burmese cat usually has a lifespan of 15-18 years. Image Source:flickr. Labels: Burmese Cat, Cats."}, {"url": "http://www.catbreedsjunction.com/burmese-cat-breed.html", "passage_text": "life expectancy of the burmese cat breed. The Burmese cat has a life span of about 15 years-this is the average age and is dependent of many factors such as diet, exercise, annual vaccinations and the general care of your cat. Chocolate Burmese Cat | photo © Theresa Fouche."}]