[{"url": "http://digiday.com/publishers/what-online-ads-really-cost/", "passage_text": "There’s been a lot of talk about what a mobile app should cost to produce, but according to one brand marketer, they typically sell for between $100,000 and $150,000, based on functionality. That doesn’t include the media to promote or distribute it, though. -. Facebook log-out screen ad = $100,000. When Facebook launched its log-out screen ads, reports suggested it was charging $700,000 for them, but in reality they came bundled with a homage ad commitment, too. Buyers say they’re now selling log-out ads standalone for around $100,000."}, {"url": "http://www.answers.com/Q/How_much_does_internet_advertising_cost", "passage_text": "What is the average of internet advertising costs? THe average cost of internet or website advertising is in the range of $30 to $1500 per week. If one was to take the average of $30 and $1500 it would be $765 per week. The cost to advertise on buses varies from market to market, and  from country to country.    In larger markets like New York and Los Angeles, bus advertising  rates … are about $600 to $900 per bus per 4 week period and certain  minimum purchase requirements apply."}, {"url": "http://www.ehow.com/about_7319131_much-cost-advertise-online_.html", "passage_text": "PPC Costs. Pay-per-click means you pay a certain amount each time a prospect clicks on your text ad. You set a bid amount and a daily budget with the online ad provider. Per-click rates range from less than a $1 to $10 or more, as of publication. By setting a daily budget, though, you control total click costs. This rate, expressed as CPM, is an amount you pay for every 1,000 ad impressions. Typical CPMs range from less than $1 up to $3 to $5, as of publication. Thus, you would pay around $100 to $500 per month for a site that generates around 100,000 monthly"}, {"url": "https://en.wikipedia.org/wiki/Online_advertising", "passage_text": "Online advertising, also called online marketing or Internet advertising, is a form of marketing and advertising which uses the Internet to deliver promotional marketing messages to consumers. In 2013, Internet advertising revenues in the United States totaled $42.8 billion, a 17% increase over the $36.57 billion in revenues in 2012. U.S. internet ad revenue hit a historic high of $20.1 billion for the first half of 2013, up 18% over the same period in 2012."}, {"url": "http://www.ehow.com/about_7319131_much-cost-advertise-online_.html", "passage_text": "Banner Ads. To place a banner ad on a website, you typically pay a cost-per-thousand rate. This rate, expressed as CPM, is an amount you pay for every 1,000 ad impressions. Typical CPMs range from less than $1 up to $3 to $5, as of publication. Thus, you would pay around $100 to $500 per month for a site that generates around 100,000 monthly impressions."}, {"url": "http://fitsmallbusiness.com/how-much-does-billboard-advertising-cost/", "passage_text": "The production costs for making a billboard advertisement are relatively minimal. Printing an advertisement on vinyl for a bulletin billboard (almost 700 square feet of material) will cost around $500. To ballpark production costs per billboard, take the area of the billboard in square feet and multiply it by $0.80. If you wanted to buy billboard advertising in Atlanta, Georgia for a year, the annual cost would be the (number of months) times (the minimum number of billboards) times (the cost per billboard). 12 x 28 x $2,500 = $840,000."}, {"url": "http://www.wahm.com/articles/the-costs-of-internet-marketing-and-advertising.html", "passage_text": "The position of the ad depends on how high the bid is. The advertiser even sets a limit on how much they want to spend--if the budget is $500 and you purchase a keyword for $5, the ad will display until 100 people click on it. The cost of banner ads very much depends on where you place them. The CPM can vary from as little as $10 to $100 per impression depending on how much traffic the website receives and how targeted the website is. E-mail ads work on a similar model--one pays for the number of e-mails delivered which can vary from less than $1.00 to $10.00. "}, {"url": "http://fitsmallbusiness.com/how-much-does-billboard-advertising-cost/", "passage_text": "Cost Per Billboard: $2,500 per billboard (rate for the purchase 28 billboards). If you wanted to buy billboard advertising in Atlanta, Georgia for a year, the annual cost would be the (number of months) times (the minimum number of billboards) times (the cost per billboard). 12 x 28 x $2,500 = $840,000."}, {"url": "http://digiday.com/publishers/what-online-ads-really-cost/", "passage_text": "According to media buyers Yahoo asks for $600,000 for a one-day homepage takeover, but typically sells them for around $450,000. -. YouTube homepage takeover = $400,000. To own the large display ad with video on the YouTube homepage, advertisers typically cough up about $400,000. It’s usually sold as a package, though, with other media such as in-stream video ads, display ads, or featured video listings. -. Facebook log-out screen ad = $100,000. When Facebook launched its log-out screen ads, reports suggested it was charging $700,000 for them, but in reality they came bundled with a homage ad commitment, too. Buyers say they’re now selling log-out ads standalone for around $100,000."}]