[{"url": "http://www.differencebetween.com/difference-between-mitochondria-and-vs-chloroplast/", "passage_text": "Mitochondria vs Chloroplast. Both mitochondria and chloroplast are two large organelles found in eukaryotic cells. They are known as the cellular generators of eukaryotic cells. "}, {"url": "http://www.nature.com/scitable/topicpage/plant-cells-chloroplasts-and-cell-walls-14053956", "passage_text": "Besides the presence of chloroplasts, another major difference between plant and animal cells is the presence of a cell wall. The cell wall surrounds the plasma membrane of plant cells and provides tensile strength and protection against mechanical and osmotic stress. Plant cells have certain distinguishing features, including chloroplasts, cell walls, and intracellular vacuoles. Photosynthesis takes place in chloroplasts; cell walls allow plants to have strong, upright structures; and vacuoles help regulate how cells handle water and storage of other molecules. eBooks."}, {"url": "http://www.cellsalive.com/cells/cell_model.htm", "passage_text": "Chloroplast (plant cells only) : Chloroplasts are specialized organelles found in all higher plant cells. These organelles contain the plant cell's chlorophyll responsible for the plant's green color and the ability to absorb energy from sunlight. "}, {"url": "http://www.ivyroses.com/Biology/Organelles/Chloroplast.php", "passage_text": "A chloroplast is a type of organelle. Chloroplasts are the site of photosynthesis in eukaryotic cells. Therefore they are only present in photosynthetic cells e.g. plant cells and algae. There are no chloroplasts in animal cells or bacteria cells (bacteria cells are also known as prokaryotic cells and do not contain any membrane-bound organelles). As shown in the diagram of a plant cell, chloroplasts are bigger and fatter than mitochondria. : A chloroplast is an organelle (found inside plant cells but not animal cells); a chloroplast is not a cell. For more about cells: the structure of a plant cell, the structure of an animal cell & comparison of plant, animal and bacterial cells."}, {"url": "http://micro.magnet.fsu.edu/cells/chloroplasts/chloroplasts.html", "passage_text": "Plant cells are remarkable in that they have two organelles specialized for energy production: chloroplasts, which create energy via photosynthesis, and mitochondria, which generate energy through respiration, a particularly important process when light is unavailable. Like the mitochondrion, the chloroplast is different from most other organelles because it has its own DNA and reproduces independently of the cell in which it is found; an apparent case of endosymbiosis."}, {"url": "http://biology.tutorvista.com/animal-and-plant-cells/chloroplasts.html", "passage_text": "Chloroplasts are organelles present in plant cells and some eukaryotic organisms. Chloroplasts are the most important plastids found in plant cells. It is the structure in a green plant cell in which photosynthesis occurs. Chloroplast is one of the three types of plastids. The chloroplast are double membrane bound organelles and are the site of photosynthesis The chloroplasts have a system of three membranes: the outer membrane, the inner membrane and the thylakoid system. The outer and the inner membrane of the chloroplast enclose a semi-gel-like fluid known as the stroma."}, {"url": "http://www.plant-biology.com/Chloroplast-Function.php", "passage_text": "Function of the Chloroplast. Chloroplasts are organelles that are found in plant cells and other eukaryotic organisms that can undergo photosynthesis or produce their own food. Chloroplast function as the food producers of the cell and every green plant in the planet is working to convert the sun’s energy into sugars. Chloroplasts are organelles that are found in plant cells and other eukaryotic organisms that can undergo photosynthesis or produce their own food"}, {"url": "http://learn.genetics.utah.edu/content/cells/organelles/", "passage_text": "Mitochondria Have DNA. Mitochondria and chloroplasts have striking similarities to bacteria cells. They have their own DNA, which is separate from the DNA found in the nucleus of the cell. And both organelles use their DNA to produce many proteins and enzymes required for their function. "}]