[{"url": "https://www.datalounge.com/thread/12970195-who-are-the-oldest-actors-still-alive-", "passage_text": "oldest working actors would include Jean-Louis Trintignant, Emmanuelle Riva, Max von Sydow, Christopher Plummer, Christopher Lee, Danielle Darrieux (although she hasn't worked since 2010) Eli Wallach (ditto) and Betty White. The oldest actor alive today could be some character actor or bit player you've never heard of. R9 has just appointed him or herself as the new HALL MONITOR."}, {"url": "http://gbtimes.com/life/cinemas-10-oldest-living-actresses", "passage_text": "Zohra Sehgal (27 April 1912). Indian actress Zohra Sehgal is the oldest surviving Bollywood star on our list, as well as the first actor to appear in the long-running BBC sci-fi TV series “Doctor Who” and live to the age of 100 and beyond. "}, {"url": "http://www.answers.com/Q/Who_is_the_oldest_living_movie_actor", "passage_text": "Living Bollywood actor/actress with date of birth Zohra  sahgal(1912),Manna dey(1919), Pran Krishna sikand(1920), Dilip  kumar(1922) is the oldest surviving actor in the hin … di film  industry. She is best known for her stage work and for her roll as Helen in the short lived sitco … m You Take the Kids. Stein Grieg Halvorsen (born October 19, 1909) is the oldest living known male actor. He is Norwegian, and was a stage actor who worked for Norwegian theatres starting in 1928."}, {"url": "http://stargayzing.com/30-stars-of-hollywoods-golden-era-who-are-still-alive-caution-time-sensitive-material/", "passage_text": "[…] 30 Stars of Hollywood’s Golden Era Who … – #Stargayzing honors 30 Stars of Hollywood’s Golden Age who are still alive, from #Ann-Margret, the baby of the list, to #LuiseRainer who is 104…. […]. Ann-Margret (born Apri 28, 1941 – age 72). “I just love my privacy.”. An actress/singer/dancer who is equally comfortable in musicals like Viva Las Vegas (1964) and Bye, Bye Birdie (1963), or in dramas like Carnal Knowledge (1971), Ann-Margret has been a major star of film, TV, records, and the stage since the 1950s."}, {"url": "http://thefilmexperience.net/blog/2013/12/16/100-of-the-oldest-living-screen-stars-of-note.html", "passage_text": "100 of the Oldest Living Screen Stars of Note. Monday, December 16, 2013 at 7:00PM. Thank you to everyone who visited this page over the past two years and the crazy active comments but the list was out of date being published two years ago. Here is the updated list of 200 Oldest Living Screen Stars. "}, {"url": "http://www.indiaeinfo.com/bollywoods-old-alive-actors-who-crossed-70/", "passage_text": "There are many actor and actresses of Bollywood who crossed their 70 years but still working well in movies and society. Here is list of those Bollywood’s alive stars who crossed age of 70 year. They are icon of Indian cinema. God! give them long and healthy life. 1  Nazir Hussain (DOB-May 15, 1922) – 93 Years. "}, {"url": "http://www.answers.com/Q/Who_is_the_oldest_film_actor", "passage_text": "She is best known for her stage work and for her roll as Helen in the short lived sitco … m You Take the Kids. Stein Grieg Halvorsen (born October 19, 1909) is the oldest living known male actor. He is Norwegian, and was a stage actor who worked for Norwegian theatres starting in 1928. "}, {"url": "http://stargayzing.com/30-stars-of-hollywoods-golden-era-who-are-still-alive-caution-time-sensitive-material/", "passage_text": "One of the best moments of Cher’s most recent sit down with David Letterman was her quip—and I paraphrase, “Sometimes the best career move is to die young.” This got me to thinking about some of the actors of Hollywood’s Golden Era who have not heeded Cher’s advice and are still alive. Ann-Margret (born Apri 28, 1941 – age 72). “I just love my privacy.”. An actress/singer/dancer who is equally comfortable in musicals like Viva Las Vegas (1964) and Bye, Bye Birdie (1963), or in dramas like Carnal Knowledge (1971), Ann-Margret has been a major star of film, TV, records, and the stage since the 1950s."}, {"url": "http://www.ranker.com/list/old-celebrities-you-didn-and-_39_t-realize-are-still-alive/carlybobarly", "passage_text": "25 Old Celebrities You Didn't Realize Are Still Alive. List of famous people you didn't realize are still alive. These old actors and actresses were stars decades ago, but have dropped off the face of the planet in recent years. Maybe you thought it was because they died. It wasn't. They just had other things to do. This list includes some of the oldest living actors who were once acclaimed by critics and nominated for many prestigious awards, including Kirk Douglas, Doris Day, and Gene Wilder. Just because these stars are out of the limelight doesn't mean they've passed on. Maureen O'Hara is an Irish film actress and singer. She was first educated at the John Street West Girls' School near Thomas Street in Dublin's Liberties Area. From the age of 6–17 she trained in drama, music and dance, and at the age of 10 joined the Rathmines Theatre Company and worked in amateur ..."}, {"url": "http://cassavafilms.com/list-of-9/nine-movie-stars-who-are-over-95", "passage_text": "Nine Movie Stars Who Are Over 95 and Still Alive. Keyword(s): celebrities. This is one of those lists I really can't put off writing, as time is of the essence-especially for these nine actors. While there are many more film and TV stars who are in the 95+ club right now, none are nearly as well-known as this crowd. Mostly, this list serves as a reminder of just how ancient these people are. You may even be surprised that some of them are still alive. From youngest to oldest: 1  Joan Fontaine, 95"}]