[{"url": "http://www.healthgrades.com/physician/dr-manubai-nagamani-yyygh", "passage_text": "Dr. Nagamani's Care Philosophy. Dr.Nagamani provides individualized personal care and all the procedures including ultrasounds, intrauterine inseminations and all other procedures are performed by herself and not by nurses or other health care providers. Thank You. Our records show that you have already confirmed your survey for Dr. Nagamani. Please note: it takes 24 hours for your survey results to show up on the doctor’s profile."}, {"url": "http://houstonbayareafertilitycenter.com/", "passage_text": "Dr.Nagamani is one of the leaders in the field of infertility. She has more than 25 years experience treating women with infertility as the Director of the Infertility and In vitro fertilization program at the university. Dr.Nagamani has excellent pregnancy rates with tubal ligation reversals because of her experience in microsurgical surgical techniques. Dr.Nagamani is internationally recognized as an expert in treatment of infertility in women with PCOS."}, {"url": "https://en.wikipedia.org/wiki/Vasuki", "passage_text": "Vasuki (Sanskrit: वासुकी, वासव) is a naga, and a nagaraja, one of the King serpents of Hindu and Buddhist mythology. He is a great king of the nagas and has a gem (Nagamani) on his head. Manasa, another naga, is his sister. Vasuki is Shiva's (The destroyer) Snake. Vasuki is also mentioned and used as a tightening rope in other Hindu scriptures, such as in each of the Itihasas (Ramayana and Mahabharata). In Buddhist mythology, Vasuki and the other Naga Kings appear in the audience for many of the Buddha 's sermons."}, {"url": "http://tantraveda.org/naag-mani-cobra-pearl.html", "passage_text": "There are various types of Naag Mani which may be called stones of a snake or snake stones aka snake gems or Snake Pearls. Colors & Power Attributes of Naag Mani : Naag Manis are available in various colours and textures which are either light emitting or glowing ones or the non-light emitting ones. We have the largest collection of all the rare powerful tantric spiritual and puja products at one place, where you can order any number of pieces in any quantity at once. We sell and export 100% authentic and real products."}, {"url": "http://www.healthgrades.com/physician/dr-manubai-nagamani-yyygh", "passage_text": "Dr.Nagamani has extensive experience in assisted reproductive technologies and uses up to date cutting edge technologies resulting in excellent pregnancy rates higher than national average. Dr. Nagamani is an expert in micro-surgical tubal reanastamosis (reversal) procedure. Thank You. Our records show that you have already confirmed your survey for Dr. Nagamani. Please note: it takes 24 hours for your survey results to show up on the doctor’s profile."}, {"url": "http://www.occulttreasures.com/cobra_pearl.html", "passage_text": "Most People believe Naga Mani Generally forms in the hood of a cobra or king cobra. Actually it is not formed in the poison gland., but the higher cobra spirit of Naga Loka, chooses one highly special, spiritual and magical stone for itself. One is very lucky to get such a unusual gem of Naga Loka. Sri Garuda Purana:  A pearl found in the hood of a cobra is round in shape like the one obtained from the mouth of a fish and emits a dazzling effulgence from its own natural seat. After copious washing such a pearl assumes the luster of a well-polished sword."}, {"url": "https://en.wikipedia.org/wiki/Vasuki", "passage_text": "Vasuki is known in Chinese and Japanese mythology as being one of the eight Great Naga Kings (八大龍王 Hachi Ryuu-ou), amongst Nanda (Nagaraja), Upananda, Sagara (Shakara), Takshaka, Balavan, Anavatapta and Utpala. Vasuki is also mentioned and used as a tightening rope in other Hindu scriptures, such as in each of the Itihasas (Ramayana and Mahabharata). In Buddhist mythology, Vasuki and the other Naga Kings appear in the audience for many of the Buddha 's sermons."}, {"url": "http://www.occulttreasures.com/cobra_pearl.html", "passage_text": "According to Garuda Purana it gives wisdom, victory and blessing of gods. Generally it is preserved as a crown gem in the kings treasure. Sahasrapheni Naga Mani: This is one of the highest ranking Nag Mani which comes from an ancient king cobra of massive body. It bless one with the power of Nag Dev. Sri Garuda Purana:  A pearl found in the hood of a cobra is round in shape like the one obtained from the mouth of a fish and emits a dazzling effulgence from its own natural seat. After copious washing such a pearl assumes the luster of a well-polished sword."}, {"url": "https://en.wikipedia.org/wiki/Vasuki", "passage_text": "Vasuki is famous for coiling around the neck of Lord Shiva. Lord Shiva blessed Vasuki and wore him as an ornament. The most famous legend in Hinduism in which Vasuki took part was the incident of Samudra manthan, the churning of the ocean of milk. Vasuki is also mentioned and used as a tightening rope in other Hindu scriptures, such as in each of the Itihasas (Ramayana and Mahabharata). In Buddhist mythology, Vasuki and the other Naga Kings appear in the audience for many of the Buddha 's sermons."}]