[{"url": "https://en.wikipedia.org/wiki/Positive_psychology", "passage_text": "Positive psychology is the branch of psychology that uses scientific understanding and effective intervention to aid in the achievement of a satisfactory life, rather than treating mental illness. The positive branch complements, without intention to replace or ignore, the traditional areas of psychology. By adding an important emphasis to use the scientific method to study and determine positive human development, this area of psychology fits well with the investigation of how human development can falter."}, {"url": "https://en.wikipedia.org/wiki/Humanistic_psychology", "passage_text": "In the 20th century humanistic psychology was referred to as the third force in psychology, distinct from earlier, even less humanistic approaches of psychoanalysis and behaviorism. One of humanistic psychology's early sources was the work of Carl Rogers, who was strongly influenced by Otto Rank, who broke with Freud in the mid-1920s."}, {"url": "https://en.wikipedia.org/wiki/Humanistic_psychology", "passage_text": "Humanistic psychology is a psychological perspective which rose to prominence in the mid-20th century in response to the limitations of Sigmund Freud 's psychoanalytic theory and B. F. Skinner 's behaviorism. One of humanistic psychology's early sources was the work of Carl Rogers, who was strongly influenced by Otto Rank, who broke with Freud in the mid-1920s."}, {"url": "https://en.wikipedia.org/wiki/Humanistic_psychology", "passage_text": "The major theorists considered to have prepared the ground for Humanistic Psychology are Otto Rank, Abraham Maslow, Carl Rogers and Rollo May. Maslow was heavily influenced by Kurt Goldstein during their years together at Brandeis University. Psychoanalytic writers also influenced humanistic psychology. One of humanistic psychology's early sources was the work of Carl Rogers, who was strongly influenced by Otto Rank, who broke with Freud in the mid-1920s."}, {"url": "https://www.ahpweb.org/about/new-vision/item/33-humanistic-view--methods.html", "passage_text": "The Humanistic View of Human Behavior. Humanistic psychology is a value orientation that holds a hopeful, constructive view of human beings and of their substantial capacity to be self-determining. It is guided by a conviction that intentionality and ethical values are strong psychological forces, among the basic determinants of human behavior. The purpose is to provide a level of understanding that can promote the power of personal choice and the care and effectiveness of social groups. Humanistic psychology recognizes that human existence consists of multiple layers of reality: the physical, the organic and the symbolic."}, {"url": "https://www.ahpweb.org/about/new-vision/item/33-humanistic-view--methods.html", "passage_text": "Humanistic View & Methods. Humanistic psychology is strongly supportive of phenomenological and clinical approaches to the study of the human position in the order of life. It also encourages the discovery of new research approaches which seek to further understand the richness in the depth of human being. The purpose is to provide a level of understanding that can promote the power of personal choice and the care and effectiveness of social groups. Humanistic psychology recognizes that human existence consists of multiple layers of reality: the physical, the organic and the symbolic."}, {"url": "http://www.simplypsychology.org/whatispsychology.html", "passage_text": "Psychology is a multifaceted discipline and includes many sub-fields of study such areas as human development, sports, health, clinical, social behavior and cognitive processes. Psychology is really a very new science, with most advances happening over the past 150 years or so. However, it's origins can be traced back to ancient Greece, 400 – 500 years BC. The emphasis was a philosophical one, with great thinkers such as Socrates influencing Plato, who in turn influenced Aristotle."}, {"url": "http://www.sageofasheville.com/pub_downloads/CARL_ROGERS_AND_HUMANISTIC_EDUCATION.pdf", "passage_text": "Rogers and Humanistic Education Rogers identifies himself with the movement known as humanistic psychology, being one of the founders of the American Association for Humanistic Psychology. Yet he does not use the term humanistic to designate his approach to education. In fact, he has no specific designation for it. "}, {"url": "http://www.mang.canterbury.ac.nz/people/nilakant/spirit/abraham_maslow_and_spirituality.htm", "passage_text": "He studied at the University of Wisconsin, where he received his doctorate in psychology in 1934. Maslow was drawn to the study of human motivation and personality. His theory of the hierarchy of needs, which leads to the self-actualized individual, was a strong catalyst for the founding of humanistic psychology. Maslow successfully bridged motivation and personality in his theories of needs, self-actualizing persons, and peak experiences. Beyond self-actualisation and transcendence, spiritual pursuit and union with universal self are considered to be the ultimate aim of life. Results confirmed the hypothesis that the ultimate motive in life in the Indian context is union with the universal self through spiritual pursuit."}]