[{"url": "http://www.thefreedictionary.com/Prakrit", "passage_text": "2. Prakrit-any of the vernacular Indic languages of north and central India (as distinguished from Sanskrit) recorded from the 3rd century BC to the 4th century AD. Indic, Indo-Aryan-a branch of the Indo-Iranian family of languages. 1. Any of the vernacular and literary Indic languages recorded from the third century bc to the fourth century ad, as opposed to Sanskrit."}, {"url": "http://www.audioenglish.org/dictionary/prakrit.htm", "passage_text": "The noun PRAKRIT has 2 senses: 1. any of the modern Indic languages. 2. any of the vernacular Indic languages of north and central India (as distinguished from Sanskrit) recorded from the 3rd century BC to the 4th century AD. Familiarity information: PRAKRIT used as a noun is rare. Dictionary entry details. Meaning: Any of the vernacular Indic languages of north and central India (as distinguished from Sanskrit) recorded from the 3rd century BC to the 4th century AD. Classified under: Nouns denoting communicative processes and contents. Hypernyms (Prakrit is a kind of...):"}, {"url": "https://en.wikipedia.org/wiki/Prakrit", "passage_text": "Alternatively, Prakrit can be taken to mean derived from an original, which means evolved in a natural way. Prakrit is foremost a native term, designating vernaculars as opposed to Sanskrit. The Prakrits became literary languages, generally patronized by ancient Indian kings identified with the Kshatriya Varna of Hinduism, but were regarded as illegitimate by the orthodoxy. Prakrit grammarians would give the full grammar of Ardhamagadhi first, and then define the other grammars with relation to it."}, {"url": "https://en.wikipedia.org/wiki/Prakrit", "passage_text": "The word Prakrit itself has a flexible definition, being defined sometimes as original, natural, artless, normal, ordinary, usual, or  vernacular , in contrast to the literary and religious orthodoxy of Sanskrit. Prakrit grammarians would give the full grammar of Ardhamagadhi first, and then define the other grammars with relation to it."}, {"url": "https://en.wikipedia.org/wiki/Prakrit", "passage_text": "The Ardhamagadhi Prakrit (half-Magadhi ), which was used extensively to write the scriptures of Jainism, is often considered to be the definitive form of Prakrit, while others are considered variants thereof. Prakrit grammarians would give the full grammar of Ardhamagadhi first, and then define the other grammars with relation to it."}, {"url": "http://www.thefreedictionary.com/Prakrit+languages", "passage_text": "Prakrit-any of the vernacular Indic languages of north and central India (as distinguished from Sanskrit) recorded from the 3rd century BC to the 4th century AD. Indic, Indo-Aryan-a branch of the Indo-Iranian family of languages. "}, {"url": "http://astrobix.com/name/meaning/Prakrit", "passage_text": "Meaning of Indian name: Prakrit. Meaning of the name Prakrit is 'Nature; Handsome'. Prakrit is a name of Hindu / Indian origin, and is commonly used for males. The name number for Prakrit is '3'. Click here to get the numerological analysis for the name 'Prakrit'"}]