[{"url": "http://www.afinitor.com/angiomyolipoma-tsc/patient/AML-TSC.jsp", "passage_text": "An AFINITOR patient talks about her diagnosis with kidney angiomyolipoma with TSC and how she is managing today. PLAY VIDEO. Get personalized patient and caregiver support, as well as guidance throughout the insurance process. Plus, learn about the AFINITOR Co-Pay Card Program. "}, {"url": "http://www.wisegeek.org/what-is-an-angiomyolipoma.htm", "passage_text": "Top 10 unbelievable historical concurrencies. An angiomyolipoma is a benign fatty tumor that can form in kidneys. They are made up of muscle and vessels as well as fatty tissue. "}, {"url": "http://www.rightdiagnosis.com/a/angiomyolipoma/intro.htm", "passage_text": "Read about other experiences, ask a question about Angiomyolipoma, or answer someone else's question, on our message boards: 1  I can not get a diagnosis. 2  Tell us your medical story. 3  Share your misdiagnosis story. 4  What is the best treatment for this? 5  See all the forums. Angiomyolipoma: Introduction. Angiomyolipoma: A rare, benign growth that usually occurs in the kidney. It is usually asymptomatic unless it becomes large or starts bleeding. It is usually associated with tuberous sclerosis."}, {"url": "http://www.rightdiagnosis.com/medical/angiolipoma.htm", "passage_text": "Description of Angiolipoma. Angiolipoma: A benign tumor that containing blood vessels and tissue. Also called lipoma cavernosum or telangiectatic lipoma. Angiolipoma: A lipoma with prominent vascularity. The vascular tissue is more abundant at the periphery of the tumor. "}, {"url": "http://www.thefreedictionary.com/Angiolipoma", "passage_text": "li·po·ma. n. pl. li·po·ma·ta (-mə-tə) or li·po·mas. A benign tumor composed chiefly of fat cells. li·pom′a·tous (-pŏm′ə-təs) adj. "}, {"url": "http://howshealth.com/lipoma/", "passage_text": "It is also called lipoma cavernosum or telangiectatic lipoma. Unlike the other lipoma types, angiolipoma is painful. It is a vascular subcutaneous nodule.[ 2 ] Though benign, individuals with angiolipoma might opt to have it removed because of the pain. This is a type of lipoma which is mostly seen women and appears commonly on the dermis of head, neck, trunk, or the extremieties. It is a slow-growing benign tumor. Intradermal Spindle Cell Lipoma on the neck."}, {"url": "http://howshealth.com/lipoma/", "passage_text": "Lipoma Definition. Lipoma is a growth of a “small ball” typically found underneath the skin composed of fatty lumps or mass of tissues. This is the most common benign soft tissue neoplasm (“new growth”) [ 1 ]. This is a type of lipoma which is mostly seen women and appears commonly on the dermis of head, neck, trunk, or the extremieties. It is a slow-growing benign tumor. Intradermal Spindle Cell Lipoma on the neck."}, {"url": "http://www.rightdiagnosis.com/a/angiomyolipoma/intro.htm", "passage_text": "User Interactive Forums. Read about other experiences, ask a question about Angiomyolipoma, or answer someone else's question, on our message boards: 1  I can not get a diagnosis. 2  Please help. 3  Tell us your medical story. 4  Share your misdiagnosis story. Angiomyolipoma: Introduction. Angiomyolipoma: A rare, benign growth that usually occurs in the kidney. It is usually asymptomatic unless it becomes large or starts bleeding. It is usually associated with tuberous sclerosis."}]