[{"url": "http://www.rileywilliamsmd.com/elbow/arthrotomy", "passage_text": "Arthrotomy is a traditional, open surgery in which the doctor has a full view of the elbow joint. Anesthesia is required for this procedure and may be either general or regional. Most people achieve a full recovery in three to six months after the arthrotomy. Physical therapy is a vital component to a complete recovery, helping to strengthen the muscles and tendons around the elbow and regain a normal range of motion for the joint."}, {"url": "https://en.wikipedia.org/wiki/Arthrotomy", "passage_text": "An arthrotomy is the creation of an opening in a joint that may be used in drainage. "}, {"url": "http://www.orthopale.com/synovectomy.php", "passage_text": "Synovectomy is an operation performed to remove partial or all the synovial membrane of a joint. The procedure is either by classic arthrotomy or arthroscopy. Arthroscopic synovectomy has many advantages over open synovectomy: including minimal invasive surgery, short hospital stay, diminution of postoperative joint stiffness, and better complete synovectomy. In an arthroscopic procedure, the excision can be restricted to the areas of involvement in the localized form. When total synovectomy is indicated, an experienced arthroscopist can more adequately perform a total synovectomy than an open A"}, {"url": "http://www.medicalport.org/medical-procedures-medical-tourism-portugal/orthopedics/knee-arthrotomy-and-arthroscopy.aspx", "passage_text": "Arthroscopy is a surgical procedure by which the internal structure of a joint is examined for diagnosis and/or treatment using a tube-like viewing instrument called an arthroscope. Arthroscopy was popularized in the 1960s and is now commonplace throughout the world. If you would like to learn more information about Knee Arthrotomy and Arthroscopy in Portugal, contact us through email, by calling +351 220 973 751, by filling out our form, or using our free call service to your right."}, {"url": "http://www.sciencedirect.com/science/article/pii/S1877056811000417", "passage_text": "The most common procedure is the total knee arthoplasty (TKA). Other reasons for arthrotomy of the knee joint might be the surgical treatment of intra-articular infections, resection of tumor lesions, traumatic ligament tears, intra-articular fractures, etc. Rehabilitation protocol after arthrotomy of the knee joint was the same for all cases. It consisted of a 3–1 femoral block for pain management, walking with the physiotherapist on postoperative day 1, active and passive flexion on day 2 with the physiotherapist, continuous passive motion twice a day."}, {"url": "http://www.wisegeek.org/what-is-an-arthrotomy.htm", "passage_text": "One reason to perform these procedure is to gain access to the joint for the purpose of a joint repair or replacement surgery. Cutting into the joint may be necessary to access the surgical field and to make the interior of the joint visible to the physician. It also increases healing time, however. Most arthrotomy incisions are covered by a sterile dressing for a few days to a week after surgery. Orthopedic surgeons must carefully review a patient's x-ray prior to performing an arthrotomy. An arthrotomy will likely be performed by an orthopedic surgeon."}, {"url": "http://emedicine.medscape.com/article/1268369-overview", "passage_text": "In a prospective, controlled study comparing open arthrotomy and arthroscopic drainage for the treatment of early septic arthritis of the hip in children, arthroscopic drainage was found to be effective and was associated with fewer days in the hospital than arthrotomy was (3.8 days and 6.4 days, respectively). Daily joint aspirations are usually required until the joint cultures are negative. The knee joint is probably the joint that is most amenable to repeated aspirations. Most cases of uncomplicated septic arthritis of the knee can be treated satisfactorily by means of repeated closed needle"}, {"url": "http://www.rileywilliamsmd.com/elbow/arthrotomy", "passage_text": "Arthrotomy. An arthrotomy is any surgical procedure that requires opening a joint. In the case of the elbow, arthrotomy is performed to relieve the persistent symptoms and pain resulting from a condition such as tennis elbow. Most people achieve a full recovery in three to six months after the arthrotomy. Physical therapy is a vital component to a complete recovery, helping to strengthen the muscles and tendons around the elbow and regain a normal range of motion for the joint."}, {"url": "http://www.wisegeek.org/what-is-an-arthrotomy.htm", "passage_text": "The medical term “arthrotomy” means “cutting into a joint.” Also known as a synosteotomy, this procedure can be performed for a variety of reasons, usually as part of a larger surgery that is intended to address a problem inside the joint or an issue with one or more of the bones which articulates at the joint. Most arthrotomy incisions are covered by a sterile dressing for a few days to a week after surgery. Orthopedic surgeons must carefully review a patient's x-ray prior to performing an arthrotomy. An arthrotomy will likely be performed by an orthopedic surgeon."}, {"url": "https://en.wikipedia.org/wiki/Arthroscopy", "passage_text": "Arthroscopy (also called arthroscopic surgery) is a minimally invasive surgical procedure on a joint in which an examination and sometimes treatment of damage is performed using an arthroscope, an endoscope that is inserted into the joint through a small incision. The advantage over traditional open surgery is that the joint does not have to be opened up fully. For knee arthroscopy only two small incisions are made, one for the arthroscope and one for the surgical instruments to be used in the knee cavity."}]