[{"url": "http://www.mademan.com/mm/how-build-indoor-soccer-field.html", "passage_text": "1 You will first need to find a big facility to build your indoor soccer field. 2  Building an indoor soccer field is very expensive. 3  The average soccer facility costs between one and five million dollars. 4  To build your indoor soccer field, it would be best to find a warehouse. 5  That will save you a little money. Once your road map is in place, you can begin to build an indoor soccer field. 1 "}, {"url": "http://www.mademan.com/mm/how-build-indoor-soccer-field.html", "passage_text": "1 The length of your indoor soccer field is very important. 2  The length of an indoor soccer field may not be any longer than one hundred and thirty yards and cannot be shorter than one hundred yards. 3  The width of your indoor soccer field should not exceed one hundred yards and be no less than fifty yards. Once your road map is in place, you can begin to build an indoor soccer field. 1  You will first need to find a big facility to build your indoor soccer field. 2  Building an indoor soccer field is very expensive. 3  The average soccer facility costs between one and five million dollars."}, {"url": "http://www.mademan.com/mm/how-build-indoor-soccer-field.html", "passage_text": "1 The average soccer facility costs between one and five million dollars. 2  To build your indoor soccer field, it would be best to find a warehouse. 3  That will save you a little money. 4  It will also be helpful to visit a couple of existing soccer fields to get a broad understanding of how they operate. Once your road map is in place, you can begin to build an indoor soccer field. 1  You will first need to find a big facility to build your indoor soccer field. 2  Building an indoor soccer field is very expensive. 3 "}, {"url": "http://www.answers.com/Q/How_much_does_indoor_soccer_field_cost", "passage_text": "In Basketball Rules and Regulations. The dimensions of an indoor soccer field are 200 feet long by 85  feet wide. The games are divided into four quarters of 15 minutes  each for a total of 60 minutes of play t … ime. Answered."}, {"url": "http://www.answers.com/Q/How_much_does_indoor_soccer_field_cost", "passage_text": "a lot For a UEFA standards compliant new soccer-specific stadium, the costs on average, are between $17 to $140 million and more. The costs rises due to the need of buildi … ng supportive structures around the soccer field. The dimensions of an indoor soccer field are 200 feet long by 85  feet wide. The games are divided into four quarters of 15 minutes  each for a total of 60 minutes of play t … ime. Answered."}, {"url": "http://www.bplans.com/indoor_soccer_facility_business_plan/company_summary_fc.php", "passage_text": "2.2 Start-up Summary. The start-up cost of Dribbling Indoor soccer is focused primarily on the field installation and the setup of the soccer store. The Les and Noh Klew will invest in the business, and, addition, the Klews will obtain a long-term loan. Details of start-up expenses and funding and shown in the tables and chart below. "}, {"url": "http://arizonstructures.com/air-structures/air-structure-air-dome/sports-dome/soccer-dome-indoor-soccer-field/", "passage_text": "Soccer Domes & Indoor Soccer Fields. Arizon builds the world’s finest and most cost and energy effective solutions for soccer domes, indoor soccer fields, and multisport buildings. Our soccer fabric structures are used by professional teams, universities, and municipalitie"}, {"url": "http://www.bplans.com/indoor_soccer_facility_business_plan/strategy_and_implementation_summary_fc.php", "passage_text": "5.2 Sales Strategy. Dribbling Indoor Soccer will sell the indoor facility to the current outdoor soccer teams. We will operate a booth at the city's soccer fields on the weekends for the two months before Dribbling opens. In addition, we will call the team captains and coaches directly and sell the quality and convenience of the facility. Teams can also purchase clinics. A 1/2 day clinic, that can include up to 15 people will cost $400. Children's clinics/camps will be priced at $80 for five half day sessions. The fields will be available for rent on an hourly basis to members. Rental of a field will cost $55 per hour during the day and $65 per hour during the evenings and weekends"}, {"url": "http://www.bplans.com/indoor_soccer_facility_business_plan/strategy_and_implementation_summary_fc.php", "passage_text": "Dribbling Indoor Soccer will offer membership rates for field rental to these teams to get them in the facility. Spring is notorious for poor field conditions prior to the beginning of the soccer season. Teams can also purchase clinics. A 1/2 day clinic, that can include up to 15 people will cost $400. Children's clinics/camps will be priced at $80 for five half day sessions. The fields will be available for rent on an hourly basis to members. Rental of a field will cost $55 per hour during the day and $65 per hour during the evenings and weekends"}]