[{"url": "http://www.cigna.com/healthwellness/hw/medical-topics/pelvic-organ-prolapse-tv1000", "passage_text": "Pelvic organ prolapse occurs when a pelvic organ—such as your bladder—drops (prolapses) from its normal place in your lower belly and pushes against the walls of your vagina. This can happen when the muscles that hold your pelvic organs in place get weak or stretched from childbirth or surgery. Symptoms of pelvic organ prolapse include: 1  Feeling pressure from pelvic organs pressing against the vaginal wall. 2  This is the most common symptom. 3  Feeling very full in your lower belly. 4  Feeling as if something is falling out of your vagina. 5  Feeling a pull or stretch in your groin area or pain in your lower back."}, {"url": "http://www.fda.gov/MedicalDevices/ProductsandMedicalProcedures/ImplantsandProsthetics/UroGynSurgicalMesh/ucm262299.htm", "passage_text": "Pelvic organ prolapse (POP) occurs when the tissue and muscles of the pelvic floor no longer support the pelvic organs resulting in the drop (prolapse) of the pelvic organs from their normal position. The pelvic organs include the vagina, cervix, uterus, bladder, urethra, and rectum. The bladder is the most commonly involved organ in pelvic organ prolapse. "}, {"url": "http://www.voicesforpfd.org/p/cm/ld/fid=6", "passage_text": "Pelvic Organ Prolapse. Pelvic organ prolapse, or POP, is the dropping of the pelvic organs caused by the loss of normal support of the vagina. POP occurs when there is weakness or damage to the normal support of the pelvic floor. The pelvic floor holds up the pelvic organs, including the vagina, cervix, uterus, bladder, urethra, intestines and rectum."}, {"url": "http://www.acog.org/Patients/Patient-Education-Videos/Pelvic-Organ-Prolapse", "passage_text": "This problem also runs in families. Pelvic organ prolapse is a disorder in which one or more of the pelvic organs drop from their normal position. It is caused by injury to the muscles or tissues that support the pelvic organs. The main cause of this injury is pregnancy and childbirth, especially vaginal childbirth. Other causes include prior pelvic surgery, menopause, and aging. Pelvic Organ Prolapse. Pelvic organ prolapse is a disorder in which one or more of the pelvic organs drop from their normal position. It is caused by injury to the muscles or tissues that support the pelvic organs."}, {"url": "http://www.medicinenet.com/pictures_slideshow_pelvic_pain_causes/article.htm", "passage_text": "Pelvic Organ Prolapse. Pelvic prolapse is a condition where a pelvic organ such as the bladder or uterus drops into a lower than normal position and in some instances protrude into the vaginal canal. This condition results in pelvic pain that is pressure-like and may include vaginal and back pressure. Usually there is pain with sex. "}, {"url": "http://www.mayoclinic.org/diseases-conditions/pelvic-organ-prolapse/basics/definition/CON-20036092", "passage_text": "When the muscles and ligaments supporting a woman's pelvic organs weaken, the pelvic organs can slip out of place and create a bulge in the vagina (prolapse). Women most commonly develop pelvic organ prolapse years after childbirth, after a hysterectomy or after menopause. "}, {"url": "https://en.wikipedia.org/wiki/Pelvic_cavity", "passage_text": "The pelvic cavity primarily contains reproductive organs, the urinary bladder, the pelvic colon, and the rectum. The rectum is placed at the back of the pelvis, in the curve of the sacrum and coccyx; the bladder is in front, behind the pubic symphysis. The lesser pelvis contains the pelvic colon, rectum, bladder, and some of the sex organs. The rectum is at the back, in the curve of the sacrum and coccyx; the bladder is in front, behind the pubic symphysis. In the female, the uterus and vagina occupy the interval between these viscera."}, {"url": "http://www.webmd.com/urinary-incontinence-oab/pelvic-organ-prolapse", "passage_text": "And as women age, pelvic organ prolapse and other pelvic floor disorders become more common. When pelvic floor disorders develop, one or more of the pelvic organs may stop working properly. Conditions associated with pelvic floor disorders include: 1  Pelvic organ prolapse. 2  Urinary incontinence. Anything that puts increased pressure in the abdomen can lead to pelvic organ prolapse. Common causes include: 1  Pregnancy, labor, and childbirth (the most common causes). 2  Obesity. 3  Respiratory problems with a chronic, long-term cough. 4  Constipation. 5  Pelvic organ cancers."}, {"url": "http://medical-dictionary.thefreedictionary.com/pelvic+organs", "passage_text": "Pelvic organs. The organs inside of the body that are located within the confines of the pelvis. This includes the bladder and rectum in both sexes and the uterus, ovaries, and fallopian tubes in females. Mentioned in: Appendectomy"}]