[{"url": "http://www.titanicuniverse.com/titanic-sinks", "passage_text": "Weather Conditions. An obvious possible reason for the Titanic sinking is the weather on the Atlantic during the time of the tragedy. The ocean was unusual because of the calm sea without wind or swell. Under normal conditions the waves would have broken over the base of the iceberg giving lookouts sooner warning."}, {"url": "http://www.usnews.com/news/national/articles/2008/09/25/the-secret-of-how-the-titanic-sunk", "passage_text": "For decades after the disaster, there was little doubt about what sank the Titanic. When the unsinkable ship, the largest, most luxurious ocean liner of its time, crashed into an iceberg on its maiden voyage in 1912, it took more than 1,500 of its 2,200 passengers to the bottom."}, {"url": "http://www.exploretitanic.com/sinking/what-caused-the-titanic-to-sink.html", "passage_text": "The Titanic hit the iceberg on it's starboard side, this cause the iceberg to buckle the steel plates of Titanic's hull across several of the watertight compartments. It's theorized that had Titanic hit the iceberg head on, less watertight bulkheads would have been breached and the Titanic would not have sunk."}, {"url": "http://www.nbcnews.com/science/science-news/10-causes-titanic-tragedy-f620220", "passage_text": "The unsinkable Titanic was sunk by an iceberg, but there are other reasons why the tragedy that occurred 100 years ago this month was as tragic as it was."}, {"url": "http://titanic.wikia.com/wiki/Sinking_of_the_Titanic", "passage_text": "The Sinking of the Titanic is one of the best known disasters ever. When the 'practically unsinkable' liner hit an iceberg after a failed port-around maneuver, she sank in 2.5 hours, taking over 1500 souls with her. Only 712 passengers & crew survived."}, {"url": "http://www.historyonthenet.com/Titanic/blame.htm", "passage_text": "The belief that the ship was unsinkable was, in part, due to the fact that the Titanic had sixteen watertight compartments. However, the compartments did not reach as high as they should have done. The White Star Line did not want them to go all the way up because this would have reduced living space in first class."}, {"url": "http://cosmiclog.nbcnews.com/_news/2012/04/01/10970732-10-causes-of-the-titanic-tragedy", "passage_text": "From 2010: NBC's Kerry Sanders reports on an expedition to map the wreckage of the Titanic. Follow @b0yle. The unsinkable Titanic was sunk by an iceberg, but there are other reasons why the tragedy that occurred 100 years ago this month was as tragic as it was."}]