[{"url": "https://en.wikipedia.org/wiki/Cessationism", "passage_text": "In Christianity, cessationism is the doctrine that spiritual gifts such as speaking in tongues, prophecy and healing ceased with the original twelve apostles. "}, {"url": "http://www.rapidnet.com/~jbeard/bdm/Psychology/char/areview.htm", "passage_text": "Any time divisions are a result of exercising spiritual gifts, it is an indication that these gifts are not being used as God intended. The variety of gifts is parallel to the parts of the human body, and Paul uses this analogy in 1 Corinthians 12:4 17. Now there are varieties of gifts, but the same Spirit (1 Cor. 2. Spiritual gifts are a means of serving in the Body of Christ. Gifts are not to exalt the person who has the gift; they are to enable that person to serve other believers. As each one has received a special gift, employ it in serving one another, as good stewards of the manifold grace of God (1 Pet. 4:10)."}, {"url": "http://www.insearchoftruth.org/articles/apostles.html", "passage_text": "Introduction. The office of apostle is a critical work of the New Testament church. It is listed first in the gifts given to the church (Ephesians 4:11), and the church is described as being built on the foundation of the apostles and prophets, Jesus Christ Himself being the chief cornerstone (Ephesians 2:19-21). The first in this list of spiritual offices is that of apostle. The original word for apostle was a generic Greek word (apostolos) that meant ambassador, or a delegate, messenger, one sent forth with orders (Thayer's Greek Lexicon, 676)."}, {"url": "http://www.biblefragrances.com/studies/gftapos.html", "passage_text": "There were several men who were called apostles because of their close association with an apostle and because they represented apostolic authority as delegated by an apostle. But these did not have the spiritual gift of apostle. A. Barnabas: Acts 14:14; Gal. 2:9 B. James (the half-brother of Jesus): 1 Cor. 15:7; Gal. 10:6, sent to the house of Israel.. C. The keys of the kingdom are an evangelistic mandate and do not carry special authority. D. The commission to the disciples was not a spiritual gift of apostle but, in the original sense of the word, an assignment to carry out a specific task. 4. They had absolute authority with regard to policy and doctrine throughout the Christian church as illustrated by Paul in 2 Cor. 11:23, 28"}, {"url": "http://www.reformedspokane.org/Doctrine_pages/The%20doctrine%20of%20the%20church/The%20Offices%20in%20the%20Church/Temporary_Offices_Spiritual_Gifts.html", "passage_text": "12:28). These gifts belong to the apostles, in the life of the body or church, and were found in connection with their labors, also among their co-laborers. They were gifts given to the church, but centrally residing in the office of apostle. Mark 16. 12:28,  1st Apostles, 2nd prophets, 3rd teachers, after that miracles, gifts of healing, helps governments diversities of tongues, etc. The office of the ministry was unfolded in the life of the church in harmony with the need to lay the foundation and then build upon it."}, {"url": "http://www.spiritualgiftstest.com/spiritual-gift-of-apostleship", "passage_text": "The spiritual gift of apostleship is sometimes confused with the office of Apostle. The office of Apostle was held by a limited number of men chosen by Jesus including the twelve disciples (Mark 3:13-19) and Paul (Romans 1:1). The Apostles were given authority by Jesus to do many different things to establish the church, including writing Scripture and performing miracles (John 14:26, 2 Peter 3:15-16, 2 Corinthians 12:12). There are no more that hold the office of Apostle today, but the gift of apostleship continues in a different sense. Jesus gave apostles, prophets, evangelists, shepherds and teachers at His ascension (Ephesians 4:7-12), and these represent a distinct category of apostles"}, {"url": "http://www.letusreason.org/Doct77.htm", "passage_text": "The Holy Spirit is the author of all the gifts and the Holy Spirit is still in those who believe the gospel, otherwise we could not have a Spiritual birth. We should make a distinction of the gifts and the fruit of the Spirit though both have their source from the Holy Spirit s indwelling. "}, {"url": "http://www.spiritualgiftstest.com/spiritual-gifts", "passage_text": "The spiritual gift of apostleship is sometimes confused with the office of Apostle. The office of Apostle was held by a limited number of men chosen by Jesus, including the twelve disciples (Mark 3:13-19) and Paul (Romans 1:1). Paul says in 1 Corinthians 14:1 to “ Pursue love, and earnestly desire the spiritual gifts, especially that you may prophesy.” This gift is a blessing to the church and should not be quenched or despised (1 Thessalonians 5:20)."}]