[{"url": "http://comparemricost.com/", "passage_text": "MRI cost can range between $400 to $3,500 depending upon which MRI procuedure is performed (example: brain mri vs. shoulder mri) and where you have the MRI test performed. The same exact MRI test can vary by hundreds of dollars from testing facility to testing facility. MRI's are expensive because of the price of the equipment. With the average MRI machine costing over $1 million dollars they have to charge enough per test to cover the expense of the machine. Now, that doesn't mean you can get a better price that what is published."}, {"url": "http://www.radiologystudents.com/radiology-questions/how-much-does-it-cost-for-a-shoulder-mri/", "passage_text": "says: It truly depends on your insurance plan but an MRI of the shoulder without contrast costs approx $1700-$2000. Check with your insurance provider and be tough sometimes they don’t give out the info readily. Hope you feel better. "}, {"url": "http://health.costhelper.com/mri.html", "passage_text": "1 It typically costs about $1,000-$5,000, depending on the complexity of the condition being investigated, including a $100-$200 doctor's fee. 2  A pelvic MRI is used to diagnose or monitor various types of pelvic diseases or to clarify results from other tests. 1 An open MRI is wider than an enclosed MRI and is often recommended for obese patients, those who struggle with claustrophobia, or patients whose joints are being examined. 2  An open MRI typically costs about the same as a conventional MRI, about $1,000-$5,000, depending on the parts of the body"}, {"url": "http://www.webmd.com/a-to-z-guides/magnetic-resonance-imaging-mri-of-the-shoulder", "passage_text": "Magnetic Resonance Imaging (MRI) of the Shoulder. Guide. Magnetic resonance imaging (MRI) is a test done with a large machine that uses a magnetic field and pulses of radio wave energy to make pictures of the shoulder. Muscles, ligaments, cartilage, and other joint structures are best seen with an MRI. Magnetic resonance imaging (MRI) of the shoulder is done to: 1  Check unexplained shoulder pain. 2  Find problems in the shoulder, such as arthritis, bone tumors, worn-out cartilage, torn ligaments, torn tendons, or infection. 3  An MRI can detect tears in the cartilage (labrum) in"}, {"url": "http://www.cigna.com/healthwellness/hw/medical-tests/magnetic-resonance-imaging-of-the-shoulder-tu6374", "passage_text": "Test Overview. Magnetic resonance imaging (MRI) is a test done with a large machine that uses a magnetic field and pulses of radio wave energy to make pictures of the shoulder. Muscles, ligaments, cartilage, and other joint structures are best seen with an MRI"}, {"url": "http://www.emedicinehealth.com/script/main/art.asp?articlekey=135956", "passage_text": "Magnetic resonance imaging (MRI) is a test done with a large machine that uses a magnetic field and pulses of radio wave energy to make pictures of the shoulder. Muscles, ligaments, cartilage, and other joint structures are best seen with an MRI. Magnetic resonance imaging (MRI) of the shoulder is done to: 1  Check unexplained shoulder pain. 2  Find problems in the shoulder, such as arthritis, bone tumors, worn-out cartilage, torn ligaments, torn tendons, or infection. 3  An MRI can detect tears in the cartilage (labrum) in"}, {"url": "http://health.costhelper.com/mri.html", "passage_text": "Our insurance gave us an EOB yesterday the MRI is going to cost us $2700.00 and the contrast dye was $600.00 so in total a 45 minute brain MRI with contrast dye at Aurora St. Lukes in Milwaukee, WI is $3300.00 with Allegiance Medical Insurance. 1 An open MRI is wider than an enclosed MRI and is often recommended for obese patients, those who struggle with claustrophobia, or patients whose joints are being examined. 2  An open MRI typically costs about the same as a conventional MRI, about $1,000-$5,000, depending on the parts of the body"}, {"url": "http://comparemricost.com/", "passage_text": "It's very similar to the two MRI facilities in Dallas. Facility A cost for an MRI is only $1,785 while Facility B's cost is $2,199. A difference of $414. It's like this in every city around the US. Imagine how much money you could save if you called a few more facilities and asked them what they charge for an MRI. It's up to you to make sure you get the best price. MRI's are expensive because of the price of the equipment. With the average MRI machine costing over $1 million dollars they have to charge enough per test to cover the expense of the machine. Now, that doesn't mean you can get a better price that what is published."}, {"url": "http://www.webmd.com/a-to-z-guides/magnetic-resonance-imaging-mri-of-the-shoulder", "passage_text": "For an MRI test, you are placed inside the magnet so that your shoulder is inside the strong magnetic field. MRI can find changes in the structure of organs or other tissues. It also can find tissue damage or disease, such as infection or a tumor. Magnetic resonance imaging (MRI) of the shoulder is done to: 1  Check unexplained shoulder pain. 2  Find problems in the shoulder, such as arthritis, bone tumors, worn-out cartilage, torn ligaments, torn tendons, or infection. 3  An MRI can detect tears in the cartilage (labrum) in the shoulder."}, {"url": "https://answers.yahoo.com/question/index?qid=20080114174053AAUwFOo", "passage_text": "Best Answer: I work in Northern California. A shoulder MRI runs about $1250 where I work. My best advice would be to look in your local yellow pages, and make calls for estimated costs at facilities in your area. Prices will vary depending on which state you are in....in fact, the prices can vary quite a bit between facilities in the same area. "}]