[{"url": "http://www.medicinenet.com/nail_separation/symptoms.htm", "passage_text": "Separation of the nail from the nail bed, medically known as onycholysis, is a common condition that results in a white appearance of the affected part of the nail. Fingernail or toenail separation can have numerous causes but is typically related to trauma or a fungal infection of the nails. Nail separation can sometimes be associated with other abnormalities of the nails, including nail pitting, flaking or crumbling, or other damage to or changes in the nail."}, {"url": "http://www.answers.com/Q/What_would_make_my_fingernails_separate_from_my_nail_bed", "passage_text": "1 Nail becomes detached from its bed at base and side, creating a space under nail that accumulates dirt. 2  Air under nail may cause grey-white colour but can vary from yellow to brown. 3  In psoriasis can see yellowish-brown margin between margin between normal nail (pink) and detached parts (white)."}, {"url": "http://www.skinsight.com/adult/onycholysis.htm", "passage_text": "Nail lifting (onycholysis) is the spontaneous separation (detachment) of the fingernail or toenail from the nail bed at the end of the nail (distal) and/or on the sides of the nail (lateral)."}, {"url": "http://www.nailsmag.com/article/92526/under-the-microscope-onycholysis", "passage_text": "Onycholysis is a condition that causes nails to separate from the nail bed beginning at the distal end of the nail (under the free edge). The nail itself will appear healthy, often maintaining its shape and strength."}, {"url": "http://www.nailsmag.com/article/40054/when-nails-separate", "passage_text": "Over time, this can result in separation of the nail plate from the nail bed. Other minor traumas include habitual finger sucking, nail biting, and using the nails as tools. A blunt trauma to the nail such as getting a finger smashed in a window or door can also cause onycholysis."}, {"url": "http://www.rightdiagnosis.com/sym/separation_of_the_nail_bed.htm", "passage_text": "Separation of the nail bed: Separation of the nail bed is a condition in which a fingernail or toenail partially or totally pulls away from the nail bed. See detailed information below for a list of 4 causes of Separation of the nail bed, including diseases and drug side effect causes."}]