[{"url": "http://www.antarcticglaciers.org/modern-glaciers/glacial-processes/", "passage_text": "The work of these authors[17] and others[16] indicates that cold-based glaciers can generate landforms, and erode, transport and deposit sediment. Bedrock erosion occurs through fracture and abrasion[16] as well as deposition."}, {"url": "http://coolgeography.co.uk/A-level/AQA/Year%2012/Cold%20environs/Fluvioglacial/Fluvioglacial%20processes.htm", "passage_text": "Meltwater is hugely important in allowing glaciers to move by basal slippage within Temperate or warm based glaciers. It is also responsible for a range of other landforms, which are collectively known as fluvioglacial landforms (recall – fluvial is just a posh Geography word for rivers)."}, {"url": "http://www.coolgeography.co.uk/A-level/AQA/Year%2012/Cold%20environs/Fluvioglacial/Fluvioglacial%20landforms.htm", "passage_text": "A fluvioglacial landform created by both erosion and deposition by melt water is a Sandur or outwash plain that often has braided streams. Outwash plains are areas that may have been glaciated by ice sheets and then affected by melt water or they may be areas in front of the snout."}, {"url": "http://coolgeography.co.uk/A-level/AQA/Year%2012/Cold%20environs/Fluvioglacial/Fluvioglacial%20processes.htm", "passage_text": "Meltwater can create landforms through both erosion and deposition, and the environment is highly dynamic and in constant flux. Meltwater moves in many ways through a glacier, water can move on the glaciers surface (supraglacial channels), within the ice (englacial channels) and under the ice (subglacially)."}, {"url": "http://www.geographylwc.org.uk/A/AS/asice/icesow.doc", "passage_text": "Cold environments. The global distribution of cold environments –polar (land and marine based), alpine, glacial and periglacial. Glaciers as systems: glacial budgets. Ice movement – types of flow: internal deformation, rotational, compressional, extensional and basal sliding; warm and cold based glaciers. Glacial processes and landscape development. Weathering in cold environments – frost shattering."}, {"url": "http://www.oxforddictionaries.com/definition/english/fluvioglacial", "passage_text": "Relating to or denoting erosion or deposition caused by flowing meltwater from glaciers or ice sheets. Example sentences. 1  During cold stages of the Quaternary, very large amounts of dust were also generated by wind erosion of extensive fluvioglacial outwash deposits, notably in North America, Europe, and Siberia."}, {"url": "http://www.youtube.com/watch?v=Xii_SGklnhk", "passage_text": "Fluvio-Glacial Landforms are features that have been formed by the deposition of sediment through meltwater of glaciers. Material is transported through supraglacial and subglacial streams that often flow at high velocity."}]