[{"url": "http://www.brighthub.com/science/genetics/articles/14586.aspx", "passage_text": "Transcription-The process by which DNA is converted into RNA. Translation-The conversion of RNA into protein. Central Dogma of Molecular Biology-The name given for the whole process, t he idea that information coded in the DNA is converted into RNA and then"}, {"url": "http://www.nature.com/scitable/topicpage/Translation-DNA-to-mRNA-to-Protein-393", "passage_text": "In the simplest sense, expressing a gene means manufacturing its corresponding protein, and this multilayered process has two major steps. In the first step, the information in DNA is transferred to a messenger RNA (mRNA) molecule by way of a process called transcription."}, {"url": "http://hyperphysics.phy-astr.gsu.edu/hbase/Organic/transcription.html", "passage_text": "The RNA to which the information is transcribed is messenger RNA (mRNA). The process associated with RNA polymerase is to unwind the DNA and build a strand of mRNA by placing on the growing mRNA molecule the base complementary to that on the template strand of the DNA."}, {"url": "http://www.brighthub.com/science/genetics/articles/14586.aspx", "passage_text": "The genetic code is written in the language of DNA, the four chemical bases-A, C, G and T. However, when it is time to make a protein, the DNA code is converted into RNA before it is translated into protein. This article is an in depth look at the first stage in this process, how RNA is formed from DNA."}, {"url": "http://www.atdbio.com/content/14/Transcription-Translation-and-Replication", "passage_text": "Transcription is the process by which DNA is copied (transcribed) to mRNA, which carries the information needed for protein synthesis. Transcription takes place in two broad steps. First, pre-messenger RNA is formed, with the involvement of RNA polymerase enzymes."}, {"url": "http://chemguide.co.uk/organicprops/aminoacids/dna3.html", "passage_text": "Transcription Transcription is the name given to the process where the information in a gene in a DNA strand is transferred to an RNA molecule. The coding strand and the template strand of DNA The important thing to realise is that the genetic information is carried on only one of the two strands of the DNA."}, {"url": "http://chemguide.co.uk/organicprops/aminoacids/dna3.html", "passage_text": "Transcription is the name given to the process where the information in a gene in a DNA strand is transferred to an RNA molecule. The coding strand and the template strand of DNA. The important thing to realise is that the genetic information is carried on only one of the two strands of the DNA."}, {"url": "http://serc.carleton.edu/microbelife/research_methods/genomics/translat.html", "passage_text": "Translation is the process that takes the information passed from DNA as messenger RNA and turns it into a series of amino acids bound together with peptide bonds. It is essentially a translation from one code (nucleotide sequence) to another code (amino acid sequence)."}, {"url": "http://chemguide.co.uk/organicprops/aminoacids/dna3.html", "passage_text": "Getting from the code in DNA to the final protein is a very complicated process. The code is first transcribed (copied, although with one important difference-see later) to messenger RNA. That then travels out of the nucleus of the cell (where the DNA is found) into the cytoplasm of the cell."}]