[{"url": "https://answers.yahoo.com/question/index?qid=20100928060855AAmkmn9", "passage_text": "Best Answer: Personal issues are often also political issues, because it is about how people fit into a social and political structure. Carol Hanisch, a radical feminist, is best known for popularizing the phrase The Personal is Political. According to Hanisch, calling women's consciousness-raising groups therapy was a misnomer, as the groups were not intended to solve any women's personal problems."}, {"url": "http://chalcedon.edu/research/articles/the-personal-is-political-a-christian-reappraisal/", "passage_text": "A common slogan of the feminist movement in the late 1960s was “the personal is political.” This phrase developed various shades of meaning, but its main thrust involved making a connection between women's personal problems and the structure of power in society."}, {"url": "https://en.wikipedia.org/wiki/Carol_Hanisch", "passage_text": "Carol Hanisch is a radical feminist and was an important member of New York Radical Women and Redstockings. She is best known for popularizing the phrase  The Personal Is Political  in a 1969 essay of the same name."}, {"url": "https://answers.yahoo.com/question/index?qid=20100928060855AAmkmn9", "passage_text": "RE: What is the meaning of the term &quot;the personal is political&quot; in structural social work practice? what is the meaning of empowerment,consciousness-raising,collectivization and normalization in structural social work practice as well."}, {"url": "http://womenshistory.about.com/od/feminism/a/consciousness_raising.htm", "passage_text": "The Political Meaning. Carol Hanisch's essay explains the idea behind the phrase the personal is political.. A common debate between personal and political questioned whether women's consciousness-raising groups were a useful part of the political women's movement."}, {"url": "http://womenshistory.about.com/od/feminism/a/consciousness_raising.htm", "passage_text": "Her essay The Personal Is Political said that coming to a personal realization of how grim the situation was for women was as important as doing political action such as protests."}, {"url": "http://womenshistory.about.com/od/feminism/a/consciousness_raising.htm", "passage_text": "The personal is political was a frequently heard feminist rallying cry, especially during the late 1960s and 1970s. The exact origin of the phrase is unknown and sometimes debated. Many second-wave feminists used the phrase the personal is political or its underlying meaning in their writing, speeches, consciousness-raising, and other activities."}]