[{"url": "http://www.botswana.co.za/africa_nxai.html", "passage_text": "In the south of Nxai Pan, Baines' Baobabs comprise a clump of large baobab trees, rendered immortal in 1862 by painter Thomas Baines, a member of Livingstone's expedition. The Park was originally state land."}, {"url": "http://www.youtube.com/watch?v=Bfzs1YIUvtE", "passage_text": "Mooie video van Baines Baobabs en omliggende zoutpan en savanne. In Nxai Pan National Park, Botswana."}, {"url": "http://africageographic.com/blog/baines-baobabs-botswanas-ancient-oasis/", "passage_text": "Baines’ baobabs: Botswana’s ancient oasis. Posted on 10 March, 2014 by Chloe Cooper in Travel & Lifestyle — 2 Comments ↓. The cluster of millennia-old baobab trees in the Nxai Pan National Park in Botswana owes its name to the man known to have discovered them. Thomas Baines, artist and fellow explorer to John Chapman, captured in paint the scene in 1862 on a trip through the expansive salt pans, en route to the Victoria Falls."}, {"url": "http://www.namibweb.com/bainesbaobab.htm", "passage_text": "When Nxai Pan was declared a national park it was enlarged to include Baines's Baobabs. Baines's Baobabs is one of the highlights of Nxai Pan National Park. These baobabs were named after the explorer Thomas Baines who painted them on 22 May 1862."}, {"url": "http://www.namibweb.com/bainesbaobab.htm", "passage_text": "Baines Baobab: photo album. (Wilderness Site and Baobabs are National Monuments) They were named after the famous painter and explorer Thomas Baines in 1862.These group of Baobabs are known as the sleeping sisters. Baines Baobab overlooks Kaudia Camp Pan on the South side of the Nxai South camp."}, {"url": "http://www.jenmansafaris.com/national-parks-and-attractions/baines-baobabs/", "passage_text": "The Nxai Pan National Park has recognized the importance of the Baines Baobabs, and efforts are in place to ensure the protection of these trees in the future."}, {"url": "http://www.go2africa.com/accommodation/7971", "passage_text": "Nxai Pan Camp is situated in the widlife-rich Nxai Pan National Park, an off-the-beaten-track Kalahari reserve encompassing golden grasslands, seasonal pans and acacia woodland as well as the famous Baines' Baobabs."}]