[{"url": "http://www.ehow.com/about_5096059_much-paycheck-should-spend-rent_.html", "passage_text": "As a guideline, your budget should allocate 30 to 35 percent of your take home income to housing. This includes rent or mortgage, housing insurance and electricity. Examine whether you can afford other life necessities -- like food, transportation, medical costs and savings -- after you have paid rent."}, {"url": "http://budgeting.thenest.com/percentage-income-should-rent-31823.html", "passage_text": "The Percentages. Most financial experts suggest that no more than 30 percent of your income should be spent on rent. That percentage is not universally recognized, however. Some experts put the ratio at 35 percent, while others say it should be 25 percent to 30 percent."}, {"url": "http://budgeting.thenest.com/guidelines-budget-family-income-percentages-3183.html", "passage_text": "Rent or Mortgage. You should expect to spend between 25 to 30 percent of your net income each month on rent or mortgage. Landlords and property managers typically require you to make at least 2.5 to three times the rent to qualify as a tenant."}, {"url": "http://www.lendkey.com/resources/how-much-of-your-income-should-you-spend-on-housing/", "passage_text": "Rule of thumb: Spend a fixed percentage of your income on housing. The general recommendation is to spend about 30% of your gross monthly income (before taxes) on rent. Therefore, if you’ll be making $4,000 per month, then your rent should be $4,000 x 0.3, or about $1,200."}, {"url": "http://budgeting.thenest.com/percentage-income-should-rent-31823.html", "passage_text": "If that new apartment rents for less than 30 percent of your income, you should be in good financial shape. The cost of paying for a place to live is usually the largest single monthly expense for any household, whether you own or rent your home."}, {"url": "http://budgeting.thenest.com/guidelines-budget-family-income-percentages-3183.html", "passage_text": "Allot between 12 and 25 percent of your income to personal items and activities as well as groceries. This includes entertainment and beauty services such as hair salons and barber shops. Two to 10 percent can be expected for personal expenses while the remaining 10 to 15 percent can be spent on food."}, {"url": "http://www.nakedapartments.com/blog/rent-to-income/", "passage_text": "Rent to Income. Landlords typically require that your annual income is at least 40 times the monthly rent. For example, if you and your roommate are looking at a $3,000 per month apartment, the landlord would require a combined income of $3,000 × 40, which equals $120,000."}, {"url": "http://budgeting.thenest.com/percentage-income-should-rent-31823.html", "passage_text": "For example, suppose you earn $50,000 a year, or $4,167 a month. If 35 percent of your income goes to rent, you'll be paying about $1,458 a month. But if only 25 percent goes to rent, the monthly payment is about $1,042 -- a savings of more than $400 a month."}]