[{"url": "http://smallbusiness.chron.com/needed-morale-boosters-call-center-81959.html", "passage_text": "Like the employees in any workplace, call center workers want the sense that the people in charge value front-line contributions to the overall enterprise and its bottom line. In some cases, morale depends on giving employees recognition in ways that exceed the momentary boost of a pat on the back. Partner up with local merchants to create a loyalty program that offers your workforce special discounts at restaurants and other businesses near your call center office. Digital Vision./Photodisc/Getty Images. Call center work -- inbound or outbound -- puts your employees in contact with long lists of strangers, some of whom may react in less-than-friendly ways to your personnel's calls. Keeping the phones busy and your workforce in an upbeat mood takes more than Have a nice day signs in your company lobby"}, {"url": "http://confidencecenter.com/art01.htm", "passage_text": "After leaving the call center room, I sat down with the manager and six of her supervisors in a small conference room, and I explained the basic theory of employee morale and gave her ideas about what she could do to raise morale at her company on a shoestring budget. Here's what she learned. The ideas, forms, and certificates, and tons more morale boosters will keep your employees energized, happy and loyal. They contain everything you need to boost morale-on a shoestring budget. * For details and to take a sneek peak inside the Employee Morale Center Click Here."}, {"url": "http://insights.magneticnorth.com/the-best-ways-to-motivate-staff-and-improve-call-centre-morale", "passage_text": "So what are the best ways to motivate your staff and improve call centre morale? Ask your Employees Many organisations have a ‘suggestions box’ allowing staff to put forward ideas or feedback. What many don’t have is a calibrated and repeatable system for measuring staff satisfaction. The best ways to motivate staff and improve call centre morale. Posted by Sonia Rabone. Find me on: Google+. Motivating a team to get a job done in any industry within the modern workplace follows the mantra “a happy workforce is a productive workforce”."}, {"url": "http://www.techrepublic.com/article/talking-shop-strategies-to-boost-morale-and-retention-in-call-center-environments/", "passage_text": "He said the following strategies do not work: None of these things work if the environment is sick with bad attitudes, Weisler said. Instead, the way to improve your call center's performance is by lifting your employees' morale and making them feel a part of something. By the end of 2001, Sento's annual attrition rate decreased from 150 percent to 17 percent and productive employees were staying an average of two years, instead of a mere six months. We interviewed Weisler about why call center work can be so challenging and how call center morale and retention can be raised."}, {"url": "http://cdn.ttgtmedia.com/searchCRM/downloads/Chapter_1--Managing_the_mood_of_the_call_center.pdf", "passage_text": "They want to come towork, or at least are enthusiastic about work once they get there. Onthe other hand, when morale is low in a contact center, employees canbecome bored, discouraged, and lethargic.Motivation, on the other hand, refers to employees’ drive to getthe job done. Highly motivated employees tend to be high producers,but that doesn’t necessarily mean their morale is high. q The following list contains some additional tips to help you main-tain high morale in your own environment. Make an effort to followthrough with these tips on a consistent basis, and we’re sure you’ll seeencouraging results. Contact Center Manager’s Checklist:How to Boost EmployeeMorale and Motivation."}, {"url": "http://www.callcentertimes.com/Home/tabid/37/ctl/NewsArticle/mid/395/CategoryID/1/NewsID/391/Default.aspx", "passage_text": "Taking these steps to do so will greatly improve the state of your company as well as the output of each employee. Craig Handley is the CEO and founder of Listen Up Espanol español which operates In, Portland maine with a call center In, Hermosillo, Sonora. mexico "}, {"url": "http://smallbusiness.chron.com/team-building-ideas-call-centers-21168.html", "passage_text": "Plan an Office Social. Food, props, entertainment and laughter can boost your call center employee's morale, and encourage them to bring in sales. Plan a Fiesta celebration, filed with non-alcoholic margaritas, salsa, queso, tortilla chips, enchiladas, tamales and churros. Provide each call center employee with a set of maracas that feature the company's logo, and a sombrero. Hire a salsa dance teacher to come in and teach your staff how to salsa to sultry Latin sounds. This celebration helps employees get to know each other, take some time to unwind and learn a new dance together."}, {"url": "http://searchcrm.techtarget.com/feature/Improving-call-center-agent-motivation-and-morale", "passage_text": "As we've all experienced at one time or another, complaints are often good ideas having a bad day. The morale of your call center will be conveyed to customers through the words, actions and attitude of your frontline employees. However, when morale is high, the team invests its time and energy in finding solutions rather than creating problems. Employees show respect for one another even if they disagree. Guidelines to call center morale and motivation. Here's What We Know. 1  The manager sets the tone for the entire department. 2  Morale is contagious. 3  Different things motivate different people. 4  Environmental conditions affect morale. 5  Motivations change."}, {"url": "http://confidencecenter.com/art01.htm", "passage_text": "Get Creative low-cost Employee Morale Boosters for your workplace... Take a peek inside the Employee Morale Center.. The ideas, forms, and certificates, and tons more morale boosters will keep your employees energized, happy and loyal. They contain everything you need to boost morale-on a shoestring budget. * For details and to take a sneek peak inside the Employee Morale Center Click Here."}]