[{"url": "https://en.wikipedia.org/wiki/Pulse_pressure", "passage_text": "Pulse pressure is the difference between the systolic and diastolic pressure readings. It is measured in millimeters of mercury (mmHg). It represents the force that the heart generates each time it contracts. If resting blood pressure is (systolic/diastolic) 120/80 millimeters of mercury (mmHg), pulse pressure is 40."}, {"url": "http://www.mayoclinic.org/diseases-conditions/high-blood-pressure/expert-answers/pulse-pressure/faq-20058189", "passage_text": "Generally, a pulse pressure greater than 40 mm Hg is abnormal. A pulse pressure lower than 40 may mean you have poor heart function, while a higher pulse pressure may mean your heart's valves are leaky (valve regurgitation). The most important cause of elevated pulse pressure is stiffness of the aorta, the largest artery in the body. The stiffness may be due to high blood pressure or fatty deposits on the walls of the arteries (atherosclerosis). The greater your pulse pressure, the stiffer and more damaged the vessels are thought to be. A high pulse pressure may be a strong predictor of heart problems and, especially for older adults, if your pulse pressure is greater than 60 it is considered a risk factor for cardiovascular disease."}, {"url": "http://www.webmd.com/heart-disease/pulse-measurement?page=3", "passage_text": "The chart below shows the normal range of a resting heart rate (pulse rate after resting 10 minutes) in beats per minute, according to age. Many things can cause changes in your normal heart rate, including your age, activity level, and the time of day. "}, {"url": "http://www.livescience.com/42219-blood-pressure.html", "passage_text": "The bottom number, called the diastolic pressure, is the measurement as the heart relaxes between beats. Normal blood pressure is a systolic pressure of less than 120 millimeters of mercury (mm Hg) and a diastolic pressure of less than 80 mm Hg, or 120/80 mm Hg, according to the American Heart Association (AHA). Having a blood pressure greater than 140/90 mm Hg is considered high blood pressure or hypertension. A blood pressure level between normal and hypertension, is called prehypertension, meaning it is higher than normal, but not high enough to be considered hypertension."}, {"url": "http://www.healthcentral.com/high-blood-pressure/c/58370/110775/pulse", "passage_text": "Pulse pressure refers to the difference between the systolic (top) and diastolic (bottom) blood pressure. If your blood pressure (BP) is 120/80, for instance, your pulse pressure is 120 - 80 = 40 mmHg. A pulse pressure of 40 mmHg is normal."}, {"url": "http://study.com/academy/lesson/what-is-pulse-pressure-definition-variation-normal-range.html", "passage_text": "Pulse pressure is the difference between the systolic blood pressure and the diastolic blood pressure. It is measured by millimeters of mercury (mmHg). A millimeter is the metric unit that represents 1/1000th of a meter. Mercury is the only metal that is liquid at room temperature, so it is used to determine measurement of thermometers and barometers. The normal range for the pulse pressure is between 30 to 50 mmHg."}, {"url": "http://study.com/academy/lesson/what-is-pulse-pressure-definition-variation-normal-range.html", "passage_text": "To read someone's pulse pressure, you subtract the diastolic blood pressure from the systolic blood pressure. Normal values for pulse pressure are between 30 to 40 mmHg. Pulse pressures may vary in several conditions including hypovolemia, bradycardia, and irregular heart beats. Mercury is the only metal that is liquid at room temperature, so it is used to determine measurement of thermometers and barometers. The normal range for the pulse pressure is between 30 to 50 mmHg."}, {"url": "http://study.com/academy/lesson/what-is-pulse-pressure-definition-variation-normal-range.html", "passage_text": "But higher than the normal range of pulse pressure can help to predict heart disease especially in adults over 60 years old. At a pulse pressure of 60 mmHg or greater, the person would be considered at risk for heart disease. Mercury is the only metal that is liquid at room temperature, so it is used to determine measurement of thermometers and barometers. The normal range for the pulse pressure is between 30 to 50 mmHg."}, {"url": "https://www.healthtap.com/topics/normal-pulse-pressure-range", "passage_text": "2. Get help from a doctor now ›. See below: The difference between systolic and diastolic BP is called pulse pressure. The normal range is between 30 - 60 mm. It can be widened for example in dehydration and certain valvular and muscle diseases of heart and also in senior citizen. ...Read more"}]