[{"url": "http://www.iberostar.com/en/hotels/majorca/iberostar-cala-millor", "passage_text": "The IBEROSTAR Cala Millor is an exclusive hotel with spa in Cala Millor, Majorca, standing right on the beach, next to the Waterfront Promenade. It is ideal for a romantic getaway, having 171 new fully furnished rooms, designed for a unique experience in rest and comfort. 1 Leave stress behind and come to the lovely beach in Cala Millor or enjoy the sunset as you stroll down the 2km waterfront promenade. 2  Full comfort in Cala Millor, Majorca. 3  The personalised service and assistance of our hotel with spa in Majorca will make you feel at home."}, {"url": "http://protur-hotels.com/en/hotels-in-majorca/", "passage_text": "1 Residencia Restaurant Son Floriana Majorca • Cala Bona A charming hotel in Cala Bona, Majorca. 2  Situated near the fishing port of Cala Bona, the Residencia Son Floriana is perfect for couples looking for relaxation, tranquility and to enjoy the excellent cuisine in its restaurant. The Hotel Protur Alicia is located right on the seafront in Cala Bona and offers magnificent sea views, both of the bay of Cala Millor and of Cala Bona beach."}, {"url": "http://us.venere.com/nh449739/spain/hotels-in-cala-millor-mallorca-island/", "passage_text": "On your next trip to Mallorca Island, make the choice to stay in a Cala Millor neighborhood. Venere.com lists the 47 hotels near Cala Millor to help you choose the best nearby accommodations. Explore the area and its nearby attractions on your vacation. Choose a hotel in Cala Millor so that you can explore the area on foot."}, {"url": "http://protur-hotels.com/en/hotels-in-majorca/", "passage_text": "Majorca • Cala Bona. The Hotel Protur Alicia is located right on the seafront in Cala Bona and offers magnificent sea views, both of the bay of Cala Millor and of Cala Bona beach. It is a charming hotel to spend an enjoyable stay in Majorc"}, {"url": "http://www.mallorca-now.com/apt-villa-cala-millor.html", "passage_text": "The nearest resort beaches of of Cala Bona and Cala Millor are a very short drive away (10 minutes). Bedroom Bedroom. The bedrooms are fitted to a very high standard, 3 with double beds (2 extra large) and one with twin beds. The large terrace has comfortable sofa seating where you can enjoy the views over the Swimming-Pool together with the spectacular sea views over Cala Millor and Sa Coma."}, {"url": "http://www.mallorca-now.com/apt-villa-cala-millor.html", "passage_text": "The resorts and beaches of Cala Millor, Cala Bona and Sa Coma can easily be reached within 10 minutes drive from the Villa. Villa Miramar has 4 large bedrooms (two with balcony) all with en-suite luxury bathrooms (inc jacuzzi). The large terrace has comfortable sofa seating where you can enjoy the views over the Swimming-Pool together with the spectacular sea views over Cala Millor and Sa Coma."}, {"url": "http://us.venere.com/nh449739/spain/hotels-in-cala-millor-mallorca-island/", "passage_text": "Stay near all of the local tourist attractions in Mallorca Island by choosing from the best hotels in Cala Millor. They are all listed right here at Venere.com. Choosing a hotel in Cala Millor will allow you to get to know the area. Venere.com lists the 47 hotels near Cala Millor to help you choose the best nearby accommodations. Explore the area and its nearby attractions on your vacation. Choose a hotel in Cala Millor so that you can explore the area on foot."}, {"url": "http://www.mallorca-now.com/apt-villa-cala-millor.html", "passage_text": "Luxury 4 bedroom Villa (Country House) for Rent in Rural Son Carrio, near Cala Millor, Mallorca with Heated Swimming Pool, Jacuzzi and beautiful sea views over. The large terrace has comfortable sofa seating where you can enjoy the views over the Swimming-Pool together with the spectacular sea views over Cala Millor and Sa Coma."}, {"url": "http://us.venere.com/nh449739/spain/hotels-in-cala-millor-mallorca-island/", "passage_text": "The best way to get the local feel of Mallorca Island is to stay right in the heart of Cala Millor and see the area on foot the way the locals do. Cala Millor is one of the most popular and most visited areas of Mallorca Island. Use Venere.com to search all of the best hotels in the area. Venere.com lists the 47 hotels near Cala Millor to help you choose the best nearby accommodations. Explore the area and its nearby attractions on your vacation. Choose a hotel in Cala Millor so that you can explore the area on foot."}, {"url": "http://protur-hotels.com/en/hotels-in-majorca/", "passage_text": "A charming hotel in Cala Bona, Majorca. Situated near the fishing port of Cala Bona, the Residencia Son Floriana is perfect for couples looking for relaxation, tranquility and to enjoy the excellent cuisine in its restaurant. The Hotel Protur Alicia is located right on the seafront in Cala Bona and offers magnificent sea views, both of the bay of Cala Millor and of Cala Bona beach."}]