[{"url": "http://www.thefreedictionary.com/hexameter", "passage_text": "hexameter. n. 1. (Poetry) a verse line consisting of six metrical feet. 2. (Poetry) (in Greek and Latin epic poetry) a verse line of six metrical feet, of which the first four are usually dactyls or spondees, the fifth almost always a dactyl, and the sixth a spondee or trochee. "}, {"url": "http://www.shmoop.com/odyssey/writing-style.html", "passage_text": "To create one, Homer follows three steps: 1) saying what it is that whatever you're talking about is like, usually some sort of an event; 2) describing the thing you're comparing it to in extreme detail; and 3) reminding the audience of what you were originally talking about. Let's look at an example. But if you look at learning Homeric style like learning a new dialect, it won't take you long to get the hang of it. Once you get past the initial strangeness, you'll see that Homer's work is almost never complicated for its own sake."}, {"url": "http://www.lib.uchicago.edu/e/webexhibits/homerinprint/modernhomer.html", "passage_text": "Poet and professor Allen Mandelbaum used iambic pentameter to capture Homer's musicality.. He associated himself with the Unitarians and viewed the Odyssey as essentially the work of one author, but detected later interpolations in the Greek text, which he left out of his translation. "}, {"url": "https://en.wikipedia.org/wiki/Iambic_pentameter", "passage_text": "Iambic pentameter is a commonly used type of metrical line in traditional English poetry and verse drama. The term describes the rhythm that the words establish in that line, which is measured in small groups of syllables called  feet . A line of iambic pentameter is made up of five such pairs of short/long, or unstressed/stressed, syllables. Iambic rhythms come relatively naturally in English. Iambic pentameter is the most common meter in English poetry; it is used in many of the major English poetic forms, including blank verse, the heroic couplet, and some of the traditional rhymed stanza forms. William Shakespeare used iambic pentameter in his plays and sonnets"}, {"url": "http://ancienthistory.about.com/od/poets/qt/081309DactylicHexameter.htm", "passage_text": "Dactylic Hexameter is a very important meter in Greek and Latin poetry. It is especially associated with epic poetry, and so is referred to as heroic. The very words dactylic hexameter often stand for epic poetry. In contrast with the other five feet, the last foot of the line of dactylic hexameter is usually not a dactyl. It may be a spondee (_ _) or a shortened spondee, with only 3 morae. In a shortened spondee, there would be two syllables, the first long and the second short (_ U)."}, {"url": "http://www.lib.uchicago.edu/e/webexhibits/homerinprint/language.html", "passage_text": "George Chapman, who produced the first translations of Homer into English verse and was determined to present him as a poet, used rhyming fourteeners that required substantial paraphrase. Prose translations avoid this problem but give the reader no sense of oral poetry. The first lines from English translations of the Iliad and the Odyssey are reproduced in this and other cases so that viewers can experience their vast range and variety. Madame Dacier (d. 1720). L'Illiade d'Homere. . . ."}, {"url": "https://en.wikipedia.org/wiki/Hexameter", "passage_text": "Hexameter is a metrical line of verses consisting of six feet. It was the standard epic metre in classical Greek and Latin literature, such as in the Iliad, Odyssey and Aeneid. 1 A foot can be made up of two long syllables (– –), a spondee; or a long and two short syllables, a dactyl (– υ υ). 2  The first four feet can contain either one of them. 3  The fifth is almost always a dactyl, and last must be a spondee."}, {"url": "http://ancienthistory.about.com/od/poets/qt/081309DactylicHexameter.htm", "passage_text": "Dactylic hexameter describes Homeric epic meter (Iliad and Odyssey) and that of Vergil's (Aeneid). It is also used in shorter poetry. In Ovid (Yale U Press, 1988), Sara Mack discusses Ovid's 2 meters, dactylic hexameter and elegiac couplets. Ovid uses the dactylic hexameter for his Metamorphoses. In contrast with the other five feet, the last foot of the line of dactylic hexameter is usually not a dactyl. It may be a spondee (_ _) or a shortened spondee, with only 3 morae. In a shortened spondee, there would be two syllables, the first long and the second short (_ U)."}, {"url": "https://en.wikipedia.org/wiki/Hexameter", "passage_text": "In classical hexameter, the six feet follow these rules: 1  A foot can be made up of two long syllables (– –), a spondee; or a long and two short syllables, a dactyl (– υ υ). 2  The first four feet can contain either one of them. 3  The fifth is almost always a dactyl, and last must be a spondee. 1"}]