[{"url": "http://patient.info/medicine/paracetamol-calpol-disprol-hedex-panadol", "passage_text": "1 Never take more than the dose recommended on the label. 2  Taking too much paracetamol can cause damage to your liver. 3  If you suspect that you or someone else might have taken an overdose of paracetamol, go to the accident and emergency department of your local hospital at once, even if you/they feel well. 1 Recommended doses of paracetamol are: 2  For adults: 500 mg-1 g every 4-6 hours up to a maximum of 4 g daily. 3  For children aged 12-16 years: 480-750 mg every 4-6 hours up to a maximum of four doses daily. 4  For children aged 10-12 years: 480-50"}, {"url": "http://patient.info/medicine/paracetamol-calpol-disprol-hedex-panadol", "passage_text": "1 Take paracetamol exactly as you have been told by your doctor or pharmacist, or as directed on the label of the container. 2  Recommended doses of paracetamol are: 3  For adults: 500 mg-1 g every 4-6 hours up to a maximum of 4 g daily. 1 Recommended doses of paracetamol are: 2  For adults: 500 mg-1 g every 4-6 hours up to a maximum of 4 g daily. 3  For children aged 12-16 years: 480-750 mg every 4-6 hours up to a maximum of four doses daily. 4  For children aged 10-12 years: 480-50"}, {"url": "http://www.mydr.com.au/babies-pregnancy/paracetamol-for-children", "passage_text": "The correct dose of paracetamol for a child does not depend on its age, but its weight. The usual dose is 15 mg per kilogram of weight. In other words if a baby weighs 10 kg it should have 150 mg. This dose can be taken once every 4 hours, up to 4 times per day if needed. You should not exceed the recommended dose except on the advice of your doctor. No child should take a total of more than 90 mg per kilogram in a day. "}, {"url": "http://www.drugsdb.com/otc/paracetamol/paracetamol-dosage/", "passage_text": "Paracetamol Dosage for Younger Children. For children ages 6 to 11 years, the recommended dosage of paracetamol is 325 mg or one tablet of regular-strength paracetamol every 4 to 6 hours as needed, with maximum of five tablets in 24 hours. Alternatively, your healthcare provider may prescribe based on the weight-related dosing schedule. Paracetamol (Pandol) is an over-the-counter antipyretic (fever reducer) and analgesic (painkiller). Your dosage of paracetamol depends on a number of factors that include your age, the drug formulation, other medications currently taken, and other underlying medical conditions."}, {"url": "http://patient.info/medicine/paracetamol-calpol-disprol-hedex-panadol", "passage_text": "You can take a dose of paracetamol every 4-6 hours if needed, but do not take more than four doses in any 24-hour period. Do not take with anything else which contains paracetamol. Talk to a doctor straightaway if you take too much paracetamol, even if you feel well. 1 Recommended doses of paracetamol are: 2  For adults: 500 mg-1 g every 4-6 hours up to a maximum of 4 g daily. 3  For children aged 12-16 years: 480-750 mg every 4-6 hours up to a maximum of four doses daily. 4  For children aged 10-12 years: 480-50"}, {"url": "https://www.tga.gov.au/community-qa/recommended-paracetamol-doses", "passage_text": "In Australia, the recommended paracetamol dosing for adults and children 12 years and over is 500 to 1000 mg every four to six hours as necessary, with a maximum of 4000 mg in any 24 hour period. Recommended paracetamol doses. Consumers may be aware that that in the USA and the UK there have been recent changes to the recommended dosages of some paracetamol-containing products."}, {"url": "https://en.wikipedia.org/wiki/Paracetamol", "passage_text": "The common adult dose is 500 mg to 1000 mg. The recommended maximum daily dose, for adults, is 4000 mg. In recommended doses, paracetamol is generally safe for children and infants, as well as for adults, although rare cases of acute liver injury have been linked to amounts lower than 2500 mg per day. "}, {"url": "https://www.tga.gov.au/community-qa/recommended-paracetamol-doses", "passage_text": "Background. Recent changes to the recommended use of paracetamol in the USA and UK are as follows: 1  On 28 July 2011, McNeil Consumer Healthcare announced their decision to reduce the maximum recommended adult dosing on their paracetamol 500 mg Tylenol products, from 4000 mg to 3000mg per day. Recommended paracetamol doses. Consumers may be aware that that in the USA and the UK there have been recent changes to the recommended dosages of some paracetamol-containing products."}, {"url": "http://www.drugsdb.com/otc/paracetamol/paracetamol-dosage/", "passage_text": "Under this dosing schedule, the recommended single dose of paracetamol is 10 to 15 mg/kg of body weight every 4 to six hours. There are various drug preparations for children such as syrup, suspension and others. Paracetamol (Pandol) is an over-the-counter antipyretic (fever reducer) and analgesic (painkiller). Your dosage of paracetamol depends on a number of factors that include your age, the drug formulation, other medications currently taken, and other underlying medical conditions."}]