[{"url": "http://woman.thenest.com/muscles-leg-curl-extension-machine-work-11669.html", "passage_text": "Leg extensions target your quadriceps. This large muscle group located on the front of your thigh contains four muscles. Three of the muscles -- known collectively as the vasti -- are only capable of extending the knee joint. The fourth muscle -- the rectus femoris -- can extend the knee and flex, or bend, the hip."}, {"url": "http://healthyliving.azcentral.com/muscles-leg-extension-work-12281.html", "passage_text": "The leg extension exercise involves extending, or straightening, the knee against resistance in a seated, lying or standing position. Although an effective upper thigh exercise, the leg extension only targets a small area of the leg musculature through one joint movement, knee extension."}, {"url": "http://www.livestrong.com/article/539351-what-muscles-does-the-leg-curl-extension-machine-work/", "passage_text": "When using either the seated or lying leg curl machine, the muscles on the back of the thigh will contract to bend your knee. The hamstrings are made of three muscles -- the biceps femoris, the semimembranosus and the semitendinosus. The largest of the three is the biceps femoris."}, {"url": "http://healthyliving.azcentral.com/muscles-leg-extension-work-12281.html", "passage_text": "Considerations. The leg extension is an isolation exercise -- it involves movement at only one joint and targets one muscle group. For a complete leg routine, include compound, or multi-joint, exercises in your workout, such as squats and lunges."}, {"url": "http://www.livestrong.com/article/539351-what-muscles-does-the-leg-curl-extension-machine-work/", "passage_text": "Leg curl and leg extension machines both exercise your legs, but each works muscles on different sides. Using a leg curl machine involves loading the muscles in the back or posterior of the leg. You either sit or lie down for this exercise, depending on the machine you use to bend your knee, or knee flexion."}, {"url": "http://healthyliving.azcentral.com/muscles-leg-extension-work-12281.html", "passage_text": "The primary mover during the seated or lying leg extension exercise is a group of four muscle heads on the front of the thigh, collectively referred to as the quadriceps. The largest muscle head is the rectus femoris, which sits in the center of the front thigh. The vastus intermedius lies under the rectus femoris."}]