[{"url": "http://www.carriesexperimentalkitchen.com/common-herbs-used-in-mediterranean-style-cooking/", "passage_text": "Such is the case with many Mediterranean fresh herbs and spices. There are many herbs which you might automatically think would be associated in this list like basil, rosemary and fennel. However, there are some herbs like ginger and cilantro, that are also used in Mediterranean-style cooking as well. Today I’ll be sharing the most commonly used fresh herbs in Mediterranean-style cooking that I like to use in many of my recipes here at Carrie’s Experimental Kitchen. Basil. 1  Originates from southern France and Italy and comes from the mint family. 2  Has a sweet, peppery taste. 3  Can be used in a variety of dishes like pesto, sauces, soups, salads, marinades and dressings. 4  Basil blends well with other herbs and spices such as parsley, rosemary, oregano, thyme, sage, and saffron."}, {"url": "http://www.carriesexperimentalkitchen.com/common-herbs-used-in-mediterranean-style-cooking/", "passage_text": "1 Cilantro has been found in both Southern Europe and the Middle/Far East. 2  This herb comes from the leaf of the coriander plant. 3  It has a strong flavor that tastes of a combination of sage and lemon. 4  Cilantro can be used in Mediterranean stews, soups, curries, vegetables, salads, relishes and tomato-based sauces. Basil. 1  Originates from southern France and Italy and comes from the mint family. 2  Has a sweet, peppery taste. 3  Can be used in a variety of dishes like pesto, sauces, soups, salads, marinades and dressings. 4  Basil blends well with other herbs and spices such as parsley, rosemary, oregano, thyme, sage, and saffron."}, {"url": "http://davesgarden.com/guides/articles/view/2197/", "passage_text": "Some herbs do not like the fertilized loamy soil you plant them in. Despite their possible lush growth, their flavor, aroma, and medicinal strengths will suffer. Mediterranean herbs do best when allowed to struggle a little in the dry alkaline, and rocky soil of their origins, making them well suited for xeriscaping."}, {"url": "http://www.gardeningknowhow.com/edible/herbs/hgen/greek-herb-gardening.htm", "passage_text": "Medical issues such as colds, swelling, burns and headaches were all treated using Mediterranean herb plants. Herbs were often incorporated in incense and were the main component of aromatherapy oils. Many culinary recipes included the use of herbs and gave rise to the common practice of ancient Greek herb gardening. By Amy Grant. Theophrastus was an ancient Greek known as the father of botany. In fact, the ancient Greeks were quite adept and knowledgeable regarding plants and their uses, specifically herbs. Mediterranean herb plants were commonly cultivated for daily use during the tenure of this ancient civilization. Growing Greek herbs were used fresh or dried in powders, poultices, ointments and tinctures to treat a variety of physical ailments"}, {"url": "http://www.sunset.com/garden/flowers-plants/mediterranean-herb-garden", "passage_text": "Our Mediterranean herb garden, pictured above, contains some old favorites such as parsley and thyme, as well as newer introductions, such as conehead thyme (whose flavor is similar to winter savory) and Italian oregano thyme (which ― true to its name ― is a thyme with oregano overtones). Thomas J. Story Click to Enlarge. Sunset's Mediterranean herb garden features old favorites and new introductions. Also see diagram on next page. Thomas J. Story. Mediterranean herbs are some of the most rewarding plants you can grow. Their leaves flavor everything from meats, soups, and stews to pizza and spaghetti. And the plants add beauty to kitchen gardens-many are evergreen in mild climates"}, {"url": "http://patch.com/new-jersey/triboro/bp--common-herbs-used-in-mediterranean-style-cooking", "passage_text": "1 This herb comes from the leaf of the coriander plant. 2  It has a strong flavor that tastes of a combination of sage and lemon. 3  Cilantro can be used in Mediterranean stews, soups, curries, vegetables, salads, relishes and tomato-based sauces. 4  Try Roasted Chicken with Pomegranate, Lime and Cilantro. When in actuality, they are also quite popular in other areas of the world as well. Such is the case with many Mediterranean fresh herbs and spices. There are many herbs which you might automatically think would be associated in this list like basil, rosemary and fennel. However, there are some herbs like ginger and cilantro, that are also used in Mediterranean-style cooking as well"}, {"url": "http://patch.com/new-jersey/triboro/bp--common-herbs-used-in-mediterranean-style-cooking", "passage_text": "1 Cilantro has been found in both Southern Europe and the Middle/Far East. 2  This herb comes from the leaf of the coriander plant. 3  It has a strong flavor that tastes of a combination of sage and lemon. 4  Cilantro can be used in Mediterranean stews, soups, curries, vegetables, salads, relishes and tomato-based sauces. When in actuality, they are also quite popular in other areas of the world as well. Such is the case with many Mediterranean fresh herbs and spices. There are many herbs which you might automatically think would be associated in this list like basil, rosemary and fennel. However, there are some herbs like ginger and cilantro, that are also used in Mediterranean-style cooking as well"}]