[{"url": "https://technet.microsoft.com/en-us/library/cc770946(v=ws.10).aspx", "passage_text": "Active Directory Domain Services (AD DS) stores directory data and manages communication between users and domains, including user logon processes, authentication, and directory searches. An Active Directory domain controller is a server that is running AD DS."}, {"url": "http://searchwindowsserver.techtarget.com/definition/Microsoft-Active-Directory-Domain-Services-AD-DS", "passage_text": "Active Directory Domain Services (AD DS) is a server role in Active Directory that allows admins to manage and store information about resources from a network, as well as application data, in a distributed database."}, {"url": "https://msdn.microsoft.com/en-us/library/aa362244(v=vs.85).aspx", "passage_text": "Active Directory Domain Services run on Windows 2000 and later domain controllers. However, client applications can be written for and run on Windows Vista, Windows Server 2003, Windows XP, Windows 2000, Windows NT 4.0, Windows 98, and Windows 95."}, {"url": "https://msdn.microsoft.com/en-us/library/aa362244(v=vs.85).aspx", "passage_text": "Microsoft Active Directory Domain Services are the foundation for distributed networks built on Windows 2000 Server, Windows Server 2003 and Microsoft Windows Server 2008 operating systems that use domain controllers."}, {"url": "https://msdn.microsoft.com/en-us/library/aa362244(v=vs.85).aspx", "passage_text": "Active Directory Domain Services provide secure, structured, hierarchical data storage for objects in a network such as users, computers, printers, and services. Active Directory Domain Services provide support for locating and working with these objects."}, {"url": "http://social.technet.microsoft.com/wiki/contents/articles/699.active-directory-domain-services-ad-ds-overview.aspx", "passage_text": "By using the Active Directory® Domain Services (AD DS) server role, you can create a scalable, secure, and manageable infrastructure for user and resource management, and you can provide support for directory-enabled applications, such as Microsoft® Exchange Server."}, {"url": "https://technet.microsoft.com/en-us/library/dd448614.aspx", "passage_text": "Active Directory Domain Services (AD DS) stores directory data and manages communication between users and domains, including user logon processes, authentication, and directory searches. An Active Directory domain controller is a server that is running AD DS. More..."}]