[{"url": "https://en.wikipedia.org/wiki/Koloa,_Hawaii", "passage_text": "Kōloa is a census-designated place (CDP) in Kauaʻi County, Hawaiʻi, United States. The population was 1,942 at the 2000 census. Kōloa is often incorrectly translated as native duck, which is the correct translation for the similar-looking koloa (without the macron). Kōloa has no known translation. According to one account, the district Kōloa was named for a steep rock called Pali-o-kō-loa which was found in 'Waikomo' stream. Males had a median income of $31,125 versus $25,938 for females. The per capita income for the CDP was $16,224. About 16.7% of families and 17.8% of the population were below the poverty line, including 26.5% of those under age 18 and 6.0% of those age 65 or over."}, {"url": "http://www.kauai.gov/", "passage_text": "KOLOA – The Department of Water (DOW) has scheduled a water shutdown on Thursday, Oct. 22, for customers in the Kukuiula area located on Ala Pualeikukui Street, Kaulu Street, Uluwehi Street, Kupulau Place, Mahua Street and Lau Nahele Street. This website provides convenient access to local government services and information, as well as a variety of other valuable resources. Whether you are a resident, a business, or a visitor, Kauai.gov is here for you. Please feel free to use the website to learn more about Kauaʻi and the many services that are available."}, {"url": "https://en.wikipedia.org/wiki/Koloa,_Hawaii", "passage_text": "The median income for a household in the CDP was $34,786, and the median income for a family was $43,393. Males had a median income of $31,125 versus $25,938 for females. The per capita income for the CDP was $16,224. About 16.7% of families and 17.8% of the population were below the poverty line, including 26.5% of those under age 18 and 6.0% of those age 65 or over."}, {"url": "http://www.bizapedia.com/nv/KOLOA-SURF-COMPANY-INC.html", "passage_text": "Koloa Surf Company, Inc. is a Nevada Domestic Corporation filed on June 18, 2014. The company's filing status is listed as Active and its File Number is E0317142014-8. The Registered Agent on file for this company is United States Corporation Agents, Inc. and is located at 500 N Rainbow Blvd Ste 300a, Las Vegas, NV 89107. The company has 2 principals on record."}, {"url": "http://www.yelp.com/biz/nukumoi-surf-co-koloa", "passage_text": "Established in 1995. Nukumoi Surf Co. opened our doors August 1995 as a small surf shop in a great location and we have expanded as our name and customers grows. We are basically a family owned and operated shop. Specialties. We are a Core surf shop with everything that you need for fun in the ocean. We specialize in quality Surfboard and Body Board sales and rentals and have a great selection of S.U.P.'s. We also have snorkel rentals with the best prices on all of our rentals on the Island."}, {"url": "http://www.facebook.com/nukumoi", "passage_text": "See More. Here's the schedule for tomorrow's Contest #1 at PK's. Please double check to ensure your competitor is in the right division(s) (age as of 1/1/2016). Our start ... time is set for 8:00 a.m. Please note that all heat times are approximate, and may move up or be pushed back. Mahalo to our generous sponsors: Hawaii Life Real Estate Brokers and Nukumoi Surf Co. "}, {"url": "http://joesusa.com/koloa-surf-co-colorful-tie-dye-t-shirt/", "passage_text": "Product Description. Koloa Surf Company has the perfect Colorful Tie-Dye T-Shirt for you. 1  5.4-ounce, 100% pigment-dyed cotton. 2  Sewn with cotton thread for a finished look. 3  Rib knit crewneck. 4  Taped neck and shoulders. 5  Double-needle sleeves and hem. "}, {"url": "http://www.yelp.com/biz/honolua-surf-koloa", "passage_text": "See all 19 photos. “I like the Big Island and Kauai the most, although Maui is close behind.” in 2 reviews. “The only thing I didn't like was that they didn't carry a lot of shirts that said  Kauai  on it so I was a little disappointed.” in 2 reviews. "}]