[{"url": "https://en.wikipedia.org/wiki/Clean_Water_Act", "passage_text": "Technically, the name of the law is the Federal Water Pollution Control Act. The first FWPCA was enacted in 1948, but took on its modern form when completely rewritten in 1972 in an act entitled the Federal Water Pollution Control Act Amendments of 1972. The Clean Water Act (CWA) is the primary federal law in the United States governing water pollution."}, {"url": "https://www.ametsoc.org/sloan/cleanair/cleanairlegisl.html", "passage_text": "It was an act to make the nation more aware of this environmental hazard. Eight years later, Congress passed the nation's Clean Air Act of 1963. This act dealt with reducing air pollution by setting emissions standards for stationary sources such as power plants and steel mills. Clean Air Act of 1970. public law 91-604. An Act to amend the Clean Air Act to provide for a more effective program to improve the quality of the Nation's air.. The amendments in 1970 were an entirely rewritten version of the original Clean Air Act."}, {"url": "https://en.wikipedia.org/wiki/Clean_Air_Act_%28United_States%29", "passage_text": "Congress passed the first legislation to address air pollution with the 1955 Air Pollution Control Act that provided funds to the U.S. Public Health service, but did not formulate pollution regulation. However, the Clean Air Act in 1963, created a research and regulatory program in the U.S. Public Health Service. In the Clean Air Act Extension of 1970, Congress greatly expanded the federal mandate by requiring comprehensive federal and state regulations for both industrial and mobile sources. The law established four new regulatory programs: 1  National Ambient Air Quality Standards (NAAQS)."}, {"url": "http://www.arb.ca.gov/fcaa/fcaa.htm", "passage_text": "The Federal Clean Air Act. This page last reviewed May 5, 2015. Background: The Federal Clean Air Act (FCAA) is the federal law passed in 1970, and last amended in 1990, which forms the basis for the national air pollution control effort."}, {"url": "http://www.pbs.org/wgbh/americanexperience/features/general-article/bush-domestic/", "passage_text": "The New York Times referred to the passage of the Clean Air Act Amendments of 1990 as the single most distinguished policy achievement of the Bush administration. The original Clean Air Act had been passed in 1970 under Richard Nixon and renewed in 1977. "}, {"url": "https://www.ametsoc.org/sloan/cleanair/cleanairlegisl.html", "passage_text": "legislation. clean air acts of 1955, 1963, 1970, 1990. In 1955, after many state and local governments had passed legislation dealing with air pollution, the federal government decided that this problem needed to be dealt with on a national level. Clean Air Act of 1970. public law 91-604. An Act to amend the Clean Air Act to provide for a more effective program to improve the quality of the Nation's air.. The amendments in 1970 were an entirely rewritten version of the original Clean Air Act."}, {"url": "http://environmentallaw.uslegal.com/federal-laws/clean-air-act/", "passage_text": "Clean Air Act. The Clean Air Act was major legislation passed to control air pollution in the United States. The Act was passed in 1963, but important and major amendments were added to the original Act in 1970 and 1990. But it was the Clean Air Act of 1970 that for the first time granted real power to the federal government instead of the states."}, {"url": "http://www.ucsusa.org/global_warming/solutions/reduce-emissions/the-clean-air-act.html", "passage_text": "Search. The Clean Air Act, originally passed in 1973 and amended in 1990, is a United States federal law designed to protect human health and the environment from the effects of air pollution. "}, {"url": "http://environmental.laws.com/clean-air-act", "passage_text": "Getting Fresh Air with the Clean Air Act. The Clean Air Act is a federal law that was passed to protect the public from harmful emission coming out of the both moving and stationary sources. "}, {"url": "https://en.wikipedia.org/wiki/Clean_Air_Act_%28United_States%29", "passage_text": "The Clean Air Act was the first major environmental law in the United States to include a provision for citizen suits. Numerous state and local governments have enacted similar legislation, either implementing federal programs or filling in locally important gaps in federal programs. In the Clean Air Act Extension of 1970, Congress greatly expanded the federal mandate by requiring comprehensive federal and state regulations for both industrial and mobile sources. The law established four new regulatory programs: 1  National Ambient Air Quality Standards (NAAQS)."}]