[{"url": "http://biblehub.com/isaiah/52-7.htm", "passage_text": "How beautiful upon the mountains are the feet of him that announceth glad tidings, that publisheth peace; that announceth glad tidings of good, that publisheth salvation, that saith unto Zion, Thy God reigneth! English Revised Version. How beautiful on the mountains are the feet of the messenger who announces the good news, All is well.. He brings the good news, announces salvation, and tells Zion that its God rules as king. JPS Tanakh 1917. How beautiful upon the mountains Are the feet of the messenger of good tidings, That announceth peace, the harbinger of good tidings, That announceth salvation; That saith unto Zion: 'Thy God reigneth!' New American Standard 1977."}, {"url": "https://www.biblegateway.com/passage/?search=Isaiah+52%3A7&version=KJV", "passage_text": "Isaiah 52:7 King James Version (KJV). How beautiful upon the mountains are the feet of him that bringeth good tidings, that publisheth peace; that bringeth good tidings of good, that publisheth salvation; that saith unto Zion, Thy God reigneth! King James Version (KJV). by Public Domain."}, {"url": "http://www.biblestudytools.com/isaiah/52-7-compare.html", "passage_text": "Isaiah 52:7 (ASV) How beautiful upon the mountains are the feet of him that bringeth good tidings, that publisheth peace, that bringeth good tidings of good, that publisheth salvation, that saith unto Zion, Thy God reigneth! Yeshayah 52:7 (OJB) How beautiful upon the mountains are the feet of the Mevaser (bringer of Good Tidings, the Evangelist), that publisheth shalom; that bringeth good tidings of tov, that publisheth Yeshuah (Salvation); that saith unto Tziyon, Thy G-"}, {"url": "http://www.gospelweb.net/RonSerStandAlone1/DoYouHaveBeautifulFeet.htm", "passage_text": "Text passages: Isaiah 52:7. How beautiful upon the mountains are the feet of him that bringeth good tidings, that publisheth peace; that bringeth good tidings of good, that publisheth salvation; that saith unto Zion, Thy God reigneth! Romans 10:14-15."}, {"url": "http://biblehub.com/isaiah/52-7.htm", "passage_text": "How beautiful upon the mountains are the feet of him that bringeth good tidings, that publisheth peace; that bringeth good tidings of good, that publisheth salvation; that saith unto Zion, Thy God reigneth! Holman Christian Standard Bible. How beautiful on the mountains are the feet of the messenger who announces the good news, All is well.. He brings the good news, announces salvation, and tells Zion that its God rules as king. JPS Tanakh 1917. How beautiful upon the mountains Are the feet of the messenger of good tidings, That announceth peace, the harbinger of good tidings, That announceth salvation; That saith unto Zion: 'Thy God reigneth!' New American Standard 1977."}, {"url": "http://www.godvine.com/bible/isaiah/52-7", "passage_text": "Webster's Revision. How beautiful upon the mountains are the feet of him that bringeth good tidings, that publisheth peace, that bringeth good tidings of good, that publisheth salvation, that saith unto Zion, Thy God reigneth! World English Bible. How beautiful on the mountains are the feet of him who brings good news, who publishes peace, who brings good news of good, who publishes salvation, who says to Zion, Your God reigns!."}, {"url": "http://www.biblestudytools.com/isaiah/52-7-compare.html", "passage_text": "Isaiah 52:7 (KJVA) How beautiful upon the mountains are the feet of him that bringeth good tidings, that publisheth peace; that bringeth good tidings of good, that publisheth salvation; that saith unto Zion, Thy God reigneth ! Yeshayah 52:7 (OJB) How beautiful upon the mountains are the feet of the Mevaser (bringer of Good Tidings, the Evangelist), that publisheth shalom; that bringeth good tidings of tov, that publisheth Yeshuah (Salvation); that saith unto Tziyon, Thy G-d reigneth!"}, {"url": "http://www.biblestudytools.com/isaiah/52-7-compare.html", "passage_text": "Isaiah 52:7 (JUB) How beautiful upon the mountains are the feet of him that brings good tidings, that publishes peace, that brings good tidings of good, that publishes saving health, that saith unto Zion, Thy God reigns! Yeshayah 52:7 (OJB) How beautiful upon the mountains are the feet of the Mevaser (bringer of Good Tidings, the Evangelist), that publisheth shalom; that bringeth good tidings of tov, that publisheth Yeshuah (Salvation); that saith unto Tziyon, Thy G-d reigneth!"}, {"url": "http://www.godvine.com/bible/isaiah/52-7", "passage_text": "King James Version (KJV). How beautiful upon the mountains are the feet of him that bringeth good tidings, that publisheth peace; that bringeth good tidings of good, that publisheth salvation; that saith unto Zion, Thy God reigneth! World English Bible. How beautiful on the mountains are the feet of him who brings good news, who publishes peace, who brings good news of good, who publishes salvation, who says to Zion, Your God reigns!."}]