[{"url": "http://www.answers.com/Q/What_is_the_typical_temperature_of_a_household_freezer", "passage_text": "However, most recommend that a freezer's temperature should be maintained cold enough to keep ice cream frozen brick-solid. Ice cream … freezes at about 5°F (-15°C). Therefore, it is recommended that a freezer's temperature be maintained at 0°F (-17°C). Your freezer should be set at −18 °C (0 ºF) or lower, but definitely not above −10 ºC (14 ºF). Ice cream will start to soften between −14 °C (6 °F) and −12 °C (10 °F) (well for serving, but not for longer storage). Some yeasts can start to grow around 15°F."}, {"url": "http://www.fda.gov/Food/ResourcesForYou/Consumers/ucm253954.htm", "passage_text": "1 If you do lose power, keep the doors to your fridge and freezer closed as much as possible to keep foods cold. 2  Before using any foods, check your refrigerator and freezer thermometers. 3  If the fridge is still at or below 40 °F, or the food has been above 40 °F for only two hours or less, it should be safe to eat. "}, {"url": "http://www.fda.gov/ForConsumers/ConsumerUpdates/ucm093704.htm", "passage_text": "1 Keep the refrigerator temperature at or below 40° F (4° C). 2  The freezer temperature should be 0° F (-18° C). 3  Check temperatures periodically. 4  Appliance thermometers are the best way of knowing these temperatures and are generally inexpensive. 1 Also, when putting food away, don't crowd the refrigerator or freezer so tightly that air can't circulate. 2  Keep your appliances at the proper temperatures. 3  Keep the refrigerator temperature at or below 40° F (4° C). 4  The freezer temperature should be 0° F (-18° C). 5"}, {"url": "http://www.digitaltrends.com/home/what-temperature-should-my-fridge-be/", "passage_text": "The FDA advises that you should keep the temperature of your fridge between 32 and 40 degrees Fahrenheit, preferably right in the middle of that range, at, say, 35 degrees. Set the temperature at 35, and you avoid the risk of frozen food (that’s what the freezer’s for!) and you avoid the risk of spoilage. "}, {"url": "http://cooking.stackexchange.com/questions/4529/what-temperatures-should-i-keep-my-refrigerator-and-freezer-set-at", "passage_text": "Normally a domestic freezer is best set to −18 °C (0 °F) or colder, as that's what the expiration dates for many food items are based on. It's also a requirement for freezers in restaurants, supermarkets & other places that sell food (at least here in Europe) to maintain a temperature of at most -18 °C. A general purpose domestic fridge should be at around 1-4 °C (so, just above the freezing point, and below 5 °C). In order to keep food out of the Danger Zone, your fridge must be set between 32-40°F (0-4°C). Your freezer must be below 32°F (0°C). I keep mine as cold as it will go."}, {"url": "http://www.fda.gov/ForConsumers/ConsumerUpdates/ucm093704.htm", "passage_text": "1 If an appliance thermometer was kept in the freezer, check the temperature when the power comes back on. 2  If the freezer thermometer reads 40°F or below, the food is safe and may be refrozen. 3  If a thermometer has not been kept in the freezer, check each package of food to determine its safety. 1 Also, when putting food away, don't crowd the refrigerator or freezer so tightly that air can't circulate. 2  Keep your appliances at the proper temperatures. 3  Keep the refrigerator temperature at or below 40° F (4° C). 4  The freezer temperature should be 0° F (-18° C). 5  Check temperatures periodically."}, {"url": "http://www.repairclinic.com/RepairHelp/FAQ/19/Freezer-What-Temperature-Should-My-Freezer-Be", "passage_text": "All freezers should be in the 0 to 8 degrees Fahrenheit (approximately -18 degrees to -13 degrees Celsius) range. However, when you first turn on the freezer, or put a lot of food into it, it may take up to 24 hours for the freezer to reach this temperature range. "}, {"url": "https://knowhow.com/article.dhtml?articleReference=786&country=uk", "passage_text": "1 Fridge: put the thermometer in a glass of water. 2  Check the temperature during the first door opening after not using the fridge for 8 hours or more (such as overnight). 3  Freezer: put thermometer between two bags of vegetables and as above check after 8 hours or more. The Knowhow. 1  A fridge should have a temperature of between 37°F(3°C) and 40°F (5°C). 2  Any higher and the food will go off, any lower and you’ll lose nutrients and fresh food can be ruined. 3  The ideal freezer temperature is 0°F (-18°C) which will store food safely and stop bacteria forming."}, {"url": "http://lifehacker.com/what-temperature-should-you-keep-your-refrigerator-set-533534221", "passage_text": "In order to keep food out of the Danger Zone, your fridge must be set between 32-40° F (0-4 degrees Celsius). Your freezer must be below 32° F (0° Celsius). I keep mine as cold as it will go. Keep your freezer efficient by half-filling it with bottles of water. "}, {"url": "http://www.favoritefreezerfoods.com/ideal-freezer-temperature.html", "passage_text": "The ideal freezer temperature is 0 Fahrenheit (-18 Celsius) for storing food. And -10 Fahrenheit (-23 Celsius) is recommended when freezing food. The faster food freezes the smaller the ice crystals. The smaller the ice crystals the smaller the change in texture and better quality when thawed. "}]