[{"url": "http://smallbusiness.chron.com/restore-backup-new-iphone-53329.html", "passage_text": "Step 4. Tap the Restore From ICloud Backup option and then tap Next.. Enter your Apple ID and password in the input fields to log in to your iCloud account. Step 5. Tap to select the latest backup of your old iPhone. Push the Restore button. Step 4. Plug the USB cable that came with the iPhone into the computer and the iPhone. Wait for iTunes to detect the device and launch automatically. Step 5. Click to select the radio button next to the restore from backup option in the Set Up Your IPhone pop-up window."}, {"url": "http://www.recoverlostpassword.com/article/itunes/password-to-restore-iphone-from-backup.html", "passage_text": "This password is so-called iTunes backup password. When you back up your iPhone 5/4S/4 in iTunes, you may choose to encrypt the backup files. Then if you want to restore from the backup afterwards, you are prompted to enter this password to restore iPhone backup files. Step 3. Start to get back the password to restore iPhone backup file. Then you can enter your password to restore iPhone backup. Or you change the password to encrypt th"}, {"url": "https://discussions.apple.com/thread/3091672?start=0&tstart=0", "passage_text": "If you encrypt an iPhone backup in iTunes and then forget your password, you will not be able to restore from backup and your data will be unrecoverable. If you forget the password you can continue to do backups and use the device, however you will not be able to restore the encrypted backup to any device without the password. You do not need to enter the password for your backup each time you back up or sync."}, {"url": "http://hints.binaryage.com/itunes-asks-for-a-password-to-unlock-a-backup-that-you-never-set/", "passage_text": "Then on the backup password dialogue, try the old password and the newly set password. Step 7) Try your Windows Administrator password. This is a common solution. Also, even more common is to try the Windows administrator password that you used when you first set up your computer or when you first set up your iPhone. Step 1) Try your iTunes Store password first. This is most commonly the password to restore your backup. Step 2) Try your 4 digit unlock code for your device. If you have a more complex unlock code involving characters and such, try that too. Step 3) Try 0000 as the password, sometimes the default password is in fact, 0000"}, {"url": "http://apple.stackexchange.com/questions/29545/i-forgot-my-local-backup-password-to-unlock-the-iphone-backup-file", "passage_text": "You do not need to enter the password for your backup each time you back up or sync. It appears that you have secured your iPhone backup using a password. Therefore, iTunes prompts you for a password to unlock your encrypted backup file in order to read the contents and restore them onto the new device."}, {"url": "http://www.windowspasswordsrecovery.com/iphone/password-to-restore-iphone-backup.html", "passage_text": "I am having a bad time with trying to find it.. iTunes backup is a really wonderful lifesaver that allows you to restore iPhone contents in just a few minutes. But when you use iTunes to restore iPhone from backup, only to find a pop-up window in the iTunes asking for password to restore iPhone backup files. And this happens to your iPad or iPod as well. If you forgot this password, or never set such a password before, you may have no idea what to do next. Do not be panic. "}, {"url": "https://support.apple.com/en-us/HT204184", "passage_text": "iCloud. 1  Turn on your device. 2  Follow steps in the iOS Setup Assistant. 3  Tap Restore from an iCloud Backup. 4  Choose a backup. 5  If you've purchased iTunes or App Store content using multiple Apple IDs, you'll be asked to sign in to each. 6  Stay connected. 1 Turn on your device. 2  You should see a Hello screen. 3  Follow steps in the iOS Setup Assistant. 4  Join a Wi-Fi network and follow steps until you see the Set Up Device screen. 5  Tap Restore from an iCloud Backup. 6  Then sign in to iCloud. 7  Choose a backup. 8  Look at the date and size of each and pick the most relevant."}, {"url": "http://www.recoverlostpassword.com/article/itunes/password-to-restore-iphone-from-backup.html", "passage_text": "3. Step 3. Start to get back the password to restore iPhone backup file. Then you can enter your password to restore iPhone backup. Or you change the password to encrypt the backup file. But make sure you will keep it in your mind firmly this time"}, {"url": "https://support.apple.com/en-us/HT201252", "passage_text": "Use iTunes to restore your iPhone, iPad, or iPod to factory settings. When you restore your iOS device or iPod to factory settings, you'll also install the latest version of software. You can then set up your device as new, or restore from a backup. Restore your device. 1  Connect your device to your computer using the cable that came with it. 2  Select your iPhone, iPad, or iPod when it appears in iTunes. 3  In the Summary panel, click Restore."}]