[{"url": "http://geography.about.com/video/What-Is-Geography.htm", "passage_text": "While geography is most commonly thought of as the study of Earth's physical make-up, in actuality it is a vast area of study that encompasses Earth's physical features, its four spheres, human activity, and the examination of how these sets interact and impact one another to form the world we know. Geography is commonly thought of as the study of earth's physical make-up, but it is actually a study that incorporates earth's physical features and human activity."}, {"url": "http://geography.about.com/od/culturalgeography/a/humangeography.htm", "passage_text": "Human geography is one of the two major branches of geography (versus physical geography) and is often called cultural geography. Globalization is also becoming increasingly important to the field of human geography as it is allowing these specific aspects of culture to easily travel across the globe. Cultural landscapes are also important because they link culture to the physical environments in which people live"}, {"url": "https://en.wikipedia.org/wiki/Human_geography", "passage_text": "As an intellectual discipline, geography is divided into the sub-fields of physical geography and human geography, which concentrates upon the study of human activities, by the application of qualitative and quantitative research methods. (May 2010). Human geography is the branch of the social sciences that deals with world, its people and their communities, cultures, economies and interaction with the environment by emphasizing their relations with and across space and place."}, {"url": "http://www.learner.org/resources/series85.html", "passage_text": "Now on DVD. Human Geography combines economic and cultural geography to explore the relationships between humans and their natural environment, and to track the broad social patterns that shape human societies. "}, {"url": "http://www.neok12.com/Geography.htm", "passage_text": "Geography. Geography is a branch of science that deals with the study of the Earth, its land and other physical features, environment and its relationship to human life. It has two main sub-fields: physical geography and human geography. Physical geography deals with Earth's climate, physical structure, atmosphere, soil, rock, water and related natural processes. Human geography focuses on the study of human interaction with the environment, its cultural, social and economic aspects."}, {"url": "http://www.bu.edu/earth/education/undergraduate/majors/human-geography/", "passage_text": "Human geography is the study of the spatial organization of human activity and human interaction with the physical environment. "}, {"url": "https://apstudent.collegeboard.org/apcourse/ap-human-geography/course-details", "passage_text": "The purpose of the AP course in Human Geography is to introduce students to the systematic study of patterns and processes that have shaped human understanding, use, and alteration of Earth's surface. "}, {"url": "http://www.eas.ualberta.ca/hg/", "passage_text": "Human geography is a branch of social science that focuses on the relationships between human societies and the built and natural environments in which they operate. Human geographers believe hat understanding these relationships requires being attentive to the location, space and scale of social phenomena. "}]