[{"url": "http://www.censusdata.abs.gov.au/census_services/getproduct/census/2011/quickstat/LGA21890?opendocument&navpos=220", "passage_text": "In the 2011 Census, there were 136,474 people in Darebin (C) (Local Government Areas) of these 48.7% were male and 51.3% were female. Aboriginal and Torres Strait Islander people made up 0.8% of the population. In Darebin (C) (Local Government Areas), of occupied private dwellings 8.4% had 1 bedroom, 31.3% had 2 bedrooms and 43.2% had 3 bedrooms. The average number of bedrooms per occupied private dwelling was 2.7."}, {"url": "https://en.wikipedia.org/wiki/City_of_Darebin", "passage_text": "From Wikipedia, the free encyclopedia. The City of Darebin is a local government area in Victoria, Australia, in the northern suburbs of Melbourne. It has an area of 53 square kilometres (20.5 sq mi), and at the 2012 Census, Darebin had a population of 144,086. Municipal offices are located at 350 High Street, Preston. Darebin was rated 386th of 590 Australian Local Government Areas in the BankWest Quality of Life Index 2008. As of 2012, Darebin has 144,086 residents living in its boundaries which include 5,344 hectares or 53 km². This gives the area of Darebin a population density of 26.96 persons per hectare. Darebin residents have a median age of 36 and earn on average $1,178 per week."}, {"url": "http://darebin.vic.gov.au/en/Your-Council/How-council-works/Council-Jobs", "passage_text": "Darebin City Council is located in Melbourne’s northern suburbs and was established on the 22 June 1994 as part of the government amalgamation process. Darebin is home to one of the largest, most diverse communities anywhere in Victoria. It is a free service available to both businesses and residents. We are keen to help our local businesses grow and make living locally, working locally and employing locally a reality. Join the Darebin Jobs Link to receive updates on the latest jobs in your local area."}, {"url": "http://www.recyclingnearyou.com.au/council/DarebinVIC", "passage_text": "Recycling in the Darebin City Council area. Each link below will provide you with recycling information for the Darebin City Council area. Using any of these services can help reduce the amount of waste going to landfill and ensure you place the right thing in the right bin. Information about recycling in Darebin can be found at: w... (more) Booked hard waste collection Date: 14-Nov-13 Running from 23 September to 20 December this year.This is a limited collection, and is in addition to the area-base... (more)."}, {"url": "https://en.wikipedia.org/wiki/Preston,_Victoria", "passage_text": "Preston is a suburb of Melbourne, Victoria, Australia, nine kilometres north from Melbourne's Central Business District. Its local government area is the City of Darebin. At the 2011 Census, Preston had a population of 29,925. Parcels of land between 300 acres (in the southern area) and over 1000 acres (in the north) were all sold during the Melbourne 'land boom' sales of the late 1830s. The first permanent white resident was Samuel Jeffrey in 1841 and from him the area's early name was Irishtown."}, {"url": "https://en.wikipedia.org/wiki/City_of_Darebin", "passage_text": "Since 2006, gentrification in the Darebin area has seen average incomes and property values increase siginifcantly in the region, particularly in the suburbs of Northcote, Fairfield, Alphington and Thornbury. As of 2012, Darebin has 144,086 residents living in its boundaries which include 5,344 hectares or 53 km². This gives the area of Darebin a population density of 26.96 persons per hectare. Darebin residents have a median age of 36 and earn on average $1,178 per week."}, {"url": "http://profile.id.com.au/darebin/about", "passage_text": "The City of Darebin is an established residential, industrial, commercial, cultural and educational area, with substantial parklands. The City encompasses a total land area of about 53 square kilometres. The City of Darebin is served by Bell Street, High Street, Plenty Road, St Georges Road and the Epping and Hurstbridge railway lines."}, {"url": "https://en.wikipedia.org/wiki/City_of_Darebin", "passage_text": "The City of Darebin is a local government area in Victoria, Australia, in the northern suburbs of Melbourne. As of 2012, Darebin has 144,086 residents living in its boundaries which include 5,344 hectares or 53 km². This gives the area of Darebin a population density of 26.96 persons per hectare. Darebin residents have a median age of 36 and earn on average $1,178 per week."}, {"url": "http://darebin.vic.gov.au/en/Your-Council/How-council-works/Council-Jobs", "passage_text": "Darebin City Council is one of the largest employers in the municipality with an operating expenditure budget of $120 million and capital expenditure budget of $37 million. Darebin has a population of 143,057 and we are also home to two significant tertiary organisations well serviced by public transport. It is a free service available to both businesses and residents. We are keen to help our local businesses grow and make living locally, working locally and employing locally a reality. Join the Darebin Jobs Link to receive updates on the latest jobs in your local area."}]