[{"url": "http://zylla.wipos.p.lodz.pl/games/hanoi-ex.html", "passage_text": "3. The Classical Towers of Hanoi-an initial position of all disks is on post 'A'. The solution of the puzzle is to build the tower on post 'C'. The Arbitrary Towers of Hanoi-at start, disks can be in any position provided that a bigger disk is never on top of the smaller one (see Fig. 3)"}, {"url": "http://illuminations.nctm.org/ActivityDetail.aspx?ID=40", "passage_text": "The Tower of Hanoi puzzle was invented by the French mathematician Edouard Lucas in 1883. We are given a tower of eight disks (initially three in the applet below), initially stacked in increasing size on one of three pegs. "}, {"url": "http://www.towerofhanoi.org/", "passage_text": "Tower of Hanoi (which also goes by other names like Tower of Brahma or The Lucas Tower), is a recreational mathematical puzzle that was publicized and popularized by the French mathematician Edouard Lucas in the year 1883. "}, {"url": "http://www.cut-the-knot.org/recurrence/hanoi.shtml", "passage_text": "Tower of Hanoi. The Tower of Hanoi puzzle was invented by the French mathematician Edouard Lucas in 1883. We are given a tower of eight disks (initially four in the applet below), initially stacked in increasing size on one of three pegs. The objective is to transfer the entire tower to one of the other pegs (the rightmost one in the applet below), moving only one disk at a time and never a larger one onto a smaller. To solve the puzzle drag disks from one peg to another following the rules. You can drop a disk on to a peg when its center is sufficiently close to the center of the peg. The applet expects you to move disks from the leftmost peg to the rightmost peg."}, {"url": "http://www.mathsisfun.com/games/towerofhanoi.html", "passage_text": "Object of the game is to move all the disks over to Tower 3 (with your mouse). But you cannot place a larger disk onto a smaller disk. Games Index Games 1 Games 2 Games 3 Games 4 Puzzle Games. Search :: Index :: About :: Contact :: Contribute :: Cite This Page :: Privacy. "}, {"url": "http://www.primarygames.com/puzzles/strategy/hanoi/", "passage_text": "Tower of Hanoi. Tower of Hanoi. Description: Utilize your precise organization skills to conquer the Tower of Hanoi! Your goal in this game is to move all rings from pile A to pile C and stack them according to the original order. Instructions: Click to take a ring, click again to place a ring. You can only take one ring at a time."}, {"url": "http://mathworld.wolfram.com/TowerofHanoi.html", "passage_text": "Tower of Hanoi. The tower of Hanoi (commonly also known as the  towers of Hanoi), is a puzzle invented by E. Lucas in 1883. It is also known as the Tower of Brahma puzzle and appeared as an intelligence test for apes in the film Rise of the Planet of the Apes (2011) under the name Lucas Tower.. "}, {"url": "http://mathforum.org/dr.math/faq/faq.tower.hanoi.html", "passage_text": "According to the legend of the Tower of Hanoi (originally the Tower of Brahma in a temple in the Indian city of Benares), the temple priests are to transfer a tower consisting of 64 fragile disks of gold from one part of the temple to another, one disk at a time. "}, {"url": "https://en.wikipedia.org/wiki/Tower_of_Hanoi", "passage_text": "With three disks, the puzzle can be solved in seven moves. The minimum number of moves required to solve a Tower of Hanoi puzzle is 2 - 1, where n is the number of disks. The simplest multistack game, Tower of Hanoi (2 × 4), has two stacks and four pegs, and it requires 3[ T (n)] moves to solve where T (n) is the number of moves needed to solve a single stack classic of n disks. The game proceeds in seesaw fashion with longer and longer series of moves that alternate between color"}]