[{"url": "http://screenrant.com/ghost-whisperer-season-premiere-aco-27956/", "passage_text": "Last season on Ghost Whisperer we said goodbye to Rick Payne (Jay Mohr) and hello to Eli James (Jamie Kennedy). Melinda (Jennifer Love Hewitt) finds out she’s pregnant while Jim (David Conrad) is shot and turns into Sam/Jim. "}, {"url": "https://en.wikipedia.org/wiki/Ghost_Whisperer_(season_5)", "passage_text": "Ghost Whisperer' s fifth and final season aired in the United States (U.S.) on Fridays at 8:00 pm ET on CBS, a terrestrial television network, followed by the sixth season of Medium, where it received an average of 7.78 million viewers per episode, becoming the least watched season of the series. On May 18, 2010, citing rising costs and a decline in viewership, CBS announced that Ghost Whisperer would not be renewed for another season. On May 18, 2010, CBS cancelled the show after five seasons. ABC expressed interest in picking up Ghost Whisperer for Fall 2010."}, {"url": "https://en.wikipedia.org/wiki/Ghost_Whisperer_(season_5)", "passage_text": "On May 5, 2008 it was announced that the first three seasons of Ghost Whisperer were purchased for $169.8 million ($700,000 per episode, per network) for syndication by SyFy, ION Television, and WE TV. Episodes began airing in Summer 2009 on ION, and in Fall 2009 on SyFy and WE. On May 18, 2010, citing rising costs and a decline in viewership, CBS announced that Ghost Whisperer would not be renewed for another season. On May 18, 2010, CBS cancelled the show after five seasons. ABC expressed interest in picking up Ghost Whisperer for Fall 2010."}, {"url": "http://deadline.com/2010/05/ghost-whisperer-to-end-after-deal-with-abc-fell-through-44262/", "passage_text": "Ghost Whisperer is one of two cancelled CBS series that has been looking for a new life on ABC, along with comedy The New Adventures of Old Christine. I hear the chances of Old Christine don’t look good either but the producers are expected to make one last effort to make a deal with the network. Ghost Whisperer that was one of the very best shows ever…I love Ghost Whisperer….. Yeah They are right all the shows on tv are about the same cops, drs.,private investigators, watch one and you know about them all."}, {"url": "https://en.wikipedia.org/wiki/Ghost_Whisperer_(season_5)", "passage_text": "Ghost Whisperer (season 5). From Wikipedia, the free encyclopedia. The fifth and final season of Ghost Whisperer, an American television series created by John Gray, commenced airing in the United States on September 25, 2009, concluded May 21, 2010, and consisted of 22 episodes. On May 18, 2010, citing rising costs and a decline in viewership, CBS announced that Ghost Whisperer would not be renewed for another season. On May 18, 2010, CBS cancelled the show after five seasons. ABC expressed interest in picking up Ghost Whisperer for Fall 2010."}, {"url": "http://deadline.com/2010/05/ghost-whisperer-to-end-after-deal-with-abc-fell-through-44262/", "passage_text": "After some encouraging early signs out of ABC following CBS’ cancellation of Ghost Whispere r last week, I hear the financial aspect of ABC picking up the veteran drama starring Jennifer Love Hewitt ultimately could not be worked out. Ghost Whisperer that was one of the very best shows ever…I love Ghost Whisperer….. Yeah They are right all the shows on tv are about the same cops, drs.,private investigators, watch one and you know about them all."}, {"url": "http://www.answers.com/Q/Why_did_they_end_ghost_whisperer", "passage_text": "Making the world better, one answer at a time. Jennifer didn't want to end the Series, but the producers had said that they thought the show had been on for too long, I mean, there were like 22 episodes in each season, which was quite alot. Jennifer Love Hewitt said; For me, it was a total shock, she says of realizing the series wouldn't continue. "}, {"url": "http://ultimateghostwhisperer.wikia.com/wiki/Jim_Clancy", "passage_text": "Daniel Clancy-Brother. Jim Clancy is a main character of the television series, Ghost Whisperer, portrayed by David Conrad. Jim is a paramedic and a firefighter who saves Melinda from a fire in her apartment block and they soon begin dating. Jim and Melinda get married and move in at the start of the first season. "}, {"url": "http://www.ew.com/article/2009/09/25/ghost-whisperer-season-5-premiere", "passage_text": "Ghost Whisperer. Posted September 25 2009 — 8:00 AM EDT. Last season, Ghost Whisperer took a huge creative risk. Jim (David Conrad), the supportive husband of Melinda (Jennifer Love Hewitt) died, refused to cross over, and stepped into the body of a dying man named Sam."}, {"url": "http://tvseriesfinale.com/tv-show/ghost-whisperer-ending-jennifer-love-hewitt-19003/", "passage_text": "It’s been many months now since CBS cancelled Ghost Whisperer. Many fans of the TV show are still shocked and upset about the cancellation and series star Jennifer Love Hewitt can sympathize. In a recent interview with Zap2it, Hewitt revealed that she bought into the rumors that ABC might pick it up and talked about Ghost Whisperer’s abrupt end. Hewitt also expressed sadness about the fact that the story of Melinda Gordon was left unfinished. She noted, “I didn’t feel the series ended the way that [Melinda] deserved for it to."}]