[{"url": "http://www.rc.umd.edu/sites/default/RCOldSite/www/rchs/rime/tygerlamb.html", "passage_text": "Below you will find The Tyger and The Lamb from William Blake's Songs of Innocence and of Experience. Included are both text transcriptions of the poems and links to electronic versions of the Blake plates from which they were derived. "}, {"url": "http://www.bachelorandmaster.com/britishandamericanpoetry/the-lamb.html", "passage_text": "The lamb is one of the simplest poems of Blake. The symbolic meaning of it is almost clearly stated in the poem The Lamb which is probably the most important among the poem of innocence. Here the symbols of child, lamb and Christ are assimilated each other. The poem begins with a child like directness and natural world that show none of the signs of grownups."}, {"url": "http://www.rc.umd.edu/sites/default/RCOldSite/www/rchs/reader/tygerlamb.html", "passage_text": "Songs of Innocence and of Experience, copy Z. Below you will find The Tyger and The Lamb from William Blake's Songs of Innocence and of Experience. Included are both text transcriptions of the poems and links to electronic versions of the Blake plates from which they were derived. The links to the plates will take you to The William Blake Archive at the University of Virginia. Simply use your web browser's back button to return to this page. See the notes below for important details on the texts and images"}, {"url": "http://www.markedbyteachers.com/gcse/english/the-tyger-and-the-lamb-are-often-2-poems-paired-together-and-i-think-that-was-blakes-intention.html", "passage_text": "The Tyger and The Lamb are often 2 poems paired together and I think that was Blakes intention, Extracts from this document... Introduction. William Blake William Blake is referred to as many things, including poet, engraver, painter and mystic, but he is probably most famous for his poetry. Blake began writing the poems below in about 1790 whilst living in Lambeth, London. In The Lamb the speaker's tone is soft and gentle giving the poem an overall feeling of serenity. In The Tyger, the speaker uses more disturbing words to get his point across about the evilness of the tyger. Both speakers use questions to set the tone."}, {"url": "http://www.sparknotes.com/poetry/blake/section1.rhtml", "passage_text": "“Holy Thursday”. Little Lamb who made thee Dost thou know who made thee Gave thee life & bid thee feed. By the stream & o’er the mead; Gave thee clothing of delight, Softest clothing wooly bright; Gave thee such a tender voice, Making all the vales rejoice! Little Lamb who made thee Dost thou know who made thee Little Lamb I’ll tell thee, Little Lamb I’ll tell thee! The poem is a child’s song, in the form of a question and answer. The first stanza is rural and descriptive, while the second focuses on abstract spiritual matters and contains explanation and analogy."}, {"url": "https://en.wikipedia.org/wiki/The_Lamb", "passage_text": "Little lamb, God bless thee! The Lamb is the counterpart poem to Blake's poem: . The Tyger  in Songs of Experience. Blake wrote Songs of Innocence as a contrary to the Songs of Experience – a central tenet in his philosophy and a central theme in his work. The lamb is a common metaphor for Jesus Christ, who is also called The Lamb of God in John 1:29. This poem has a simple rhyme scheme: AA BB CC DD AA AA EF GG FE AA. The layout is set up by two stanzas with the refrain: Little Lamb who made thee/Dost thou know who made thee."}, {"url": "https://en.wikipedia.org/wiki/The_Lamb", "passage_text": "Like many of Blake's works, the poem is about Christianity. The lamb is a common metaphor for Jesus Christ, who is also called The Lamb of God in John 1:29. This poem has a simple rhyme scheme: AA BB CC DD AA AA EF GG FE AA. The layout is set up by two stanzas with the refrain: Little Lamb who made thee/Dost thou know who made thee."}, {"url": "https://en.wikipedia.org/wiki/The_Lamb", "passage_text": "The Lamb  is a poem by William Blake, published in Songs of Innocence in 1789. The lamb is a common metaphor for Jesus Christ, who is also called The Lamb of God in John 1:29. This poem has a simple rhyme scheme: AA BB CC DD AA AA EF GG FE AA. The layout is set up by two stanzas with the refrain: Little Lamb who made thee/Dost thou know who made thee."}, {"url": "http://study.com/academy/lesson/the-lamb-by-william-blake-poem-analysis.html", "passage_text": "About William Blake. 'The Lamb' is a short poem written by William Blake, an English poet who lived from 1757 to 1827 and wrote at the beginning of the Romantic movement. This movement centered on human spirituality and expressiveness with a focus on nature. Little Lamb, God bless thee!'. This second stanza supplies the answer proposed in the first stanza. Blake describes the Lord Jesus Christ as the creator of the lamb. Since Jesus is often called the 'Lamb of God,' the symbolism of the animal chosen in the poem is very obvious."}]