[{"url": "http://www.wikihow.com/Say-%22I-Love-You%22", "passage_text": "1 Saying I love you in the heat of passion for the first time might not be a good idea, as the person may question the sincerity of your pledge. 2  Follow them up with actions of kindness. 3  If your interest is not in the other person, but rather in how that person can enhance your experience of life, then it is not love. Whether or not your family is comfortable expressing their love for each other, be the icebreaker and tell them. 1  You can tell them during an event—a wedding dinner, Thanksgiving, or just a family dinner. 2  You can tell them in private, in an unguarded moment."}, {"url": "https://answers.yahoo.com/question/index?qid=20090421220600AAXP5Lg", "passage_text": "Best Answer: The definition of unconditional is not limited by conditions; absolute: an unconditional promise.. Loving someone unconditionally means that you will love them no matter what they do, or no matter what happens. Your love will continue on any condition. "}, {"url": "http://www.valleymorningstar.com/sie/what_do_you_think/article_948c1b32-8940-573f-9994-be08ade6d4b9.html", "passage_text": "When someone is in love they'd do anything and everything just to be with them. Being in love is like a little old woman and a little old man who are still friends even after they know each other so well. You know someone is in love by the way they look, and talk about each other making forever seem like a reality. When you know that someone is in love, is when they day dream. They also drop there grades because they pay more attention to some one else in stead of there work. They also stare at the person they like. Or sometimes they miss a lesson for going to sleep during class."}, {"url": "http://www.mayoclinic.org/diseases-conditions/suicide/in-depth/suicide/ART-20044707", "passage_text": "Suicide: What to do when someone is suicidal. When someone you know appears suicidal, you might not know what to do. Learn warning signs, what questions to ask and how to get help. When someone says he or she is thinking about suicide, or says things that sound as if the person is considering suicide, it can be very upsetting. You may not be sure what to do to help, whether you should take talk of suicide seriously, or if your intervention might make the situation worse."}, {"url": "http://www.valleymorningstar.com/sie/what_do_you_think/article_948c1b32-8940-573f-9994-be08ade6d4b9.html", "passage_text": "People who are in love are very fortunate to know the feeling. You know if someone’s in love when they always have a smile on their face when they’re with that one person they truly adore. They forgive and forget things that have happened and are grateful just to have that person in their life. When you know that someone is in love, is when they day dream. They also drop there grades because they pay more attention to some one else in stead of there work. They also stare at the person they like. Or sometimes they miss a lesson for going to sleep during class."}, {"url": "http://www.valleymorningstar.com/sie/what_do_you_think/article_948c1b32-8940-573f-9994-be08ade6d4b9.html", "passage_text": "When someone is in love I think is when the person who sees the girl or guy first, they'll do anything to get their attention or if the one she or he likes wouldn't care how the other person is .Like his attitude or the way they are, specially what others think about the one she or he loves. When you know that someone is in love, is when they day dream. They also drop there grades because they pay more attention to some one else in stead of there work. They also stare at the person they like. Or sometimes they miss a lesson for going to sleep during class."}, {"url": "http://www.huffingtonpost.com/margaret-paul-phd/types-of-love_b_3222974.html", "passage_text": "Non-Romantic Love. • Universal Love. When I say I love you to someone with whom I'm not in a close relationship, what I mean is that I love them in a universal way -- the way I love everyone. In my heart, I love everyone in the sense that I truly want everyone's highest good. I want everyone to flourish and have joy in their lives. "}, {"url": "http://www.wikihow.com/Say-%22I-Love-You%22", "passage_text": "1 Say it to your loved one when the time is right. 2  If you already said I love you and didn't mean it, and now you think the time is right, say it in a very unforgettable way. 3  They will notice the difference from the first time to the second time. 4  Make it special. Whether or not your family is comfortable expressing their love for each other, be the icebreaker and tell them. 1  You can tell them during an event—a wedding dinner, Thanksgiving, or just a family dinner. 2  You can tell them in private, in an unguarded moment."}, {"url": "http://www.valleymorningstar.com/sie/what_do_you_think/article_948c1b32-8940-573f-9994-be08ade6d4b9.html", "passage_text": "The way I know if someone is in love is when they are always talking about that person, they are always daydreaming, and they are always distracted in the work that they are doing. When someone is in love they do not care what other people say, they just follow their heart and go as far as their heart takes them. When you know that someone is in love, is when they day dream. They also drop there grades because they pay more attention to some one else in stead of there work. They also stare at the person they like. Or sometimes they miss a lesson for going to sleep during class."}]