[{"url": "http://www.webmd.com/a-to-z-guides/anterior-cruciate-ligament-acl-injuries-topic-overview", "passage_text": "This is called chronic ACL deficiency. The abnormal bone movement can also damage the tissue (cartilage) that covers the ends of the bones and can trap and tear the pads (menisci) that cushion the knee joints. This damage can lead to osteoarthritis. Sometimes other knee ligaments or parts of the knee are also injured. This includes cartilage such as the menisci, or bones in the knee joint, which can be broken. Your ACL can be injured if your knee joint is bent backward, twisted, or bent side to side. The ACL keeps the knee stable. Injuries range from mild, such as a small tear, to severe, such as when the ligament tears completely or when the ligament and part of the bone separate from the rest of the bone."}, {"url": "http://www.webmd.com/fitness-exercise/guide/knee-ligament-injuries", "passage_text": "1 Mentioned above, the anterior cruciate ligament (ACL) is one of the two major ligaments in the knee. 2  It connects the thigh bone to the shin bone in the knee. 3  ACL injuries are a common cause of disability in the knee. Two important ligaments in the knee, the ACL and posterior cruciate ligament (PCL), connect the femur or thigh bone with the tibia, one of the bones of the lower leg."}, {"url": "https://en.wikipedia.org/wiki/Anterior_cruciate_ligament", "passage_text": "The anterior cruciate ligament is one of the four main ligaments of the knee, and the ACL provides 85% of the restraining force to anterior tibial displacement at 30 degrees and 90 degrees of knee flexion. An anterior view of the right knee, showing anterior cruciate ligament with anteromedial (AM) and posterolateral (PL) bundles. Anterior cruciate ligament (surrounded by synovium) during knee arthroscopy. Lateral epicondylus of the femur can be seen to the right."}, {"url": "http://www.kingbrand.com/Ligament-ACL-Injury.php?REF=M_ACL.Tendon", "passage_text": "Heal Your ACL Quickly. Anterior Cruciate Ligament (ACL) injuries can be quite debilitating as the ACL is one of two major knee ligaments located inside the knee. Along with the MCL, the ACL helps to stabilize the knee joint. "}, {"url": "https://en.wikipedia.org/wiki/Anterior_cruciate_ligament", "passage_text": "The anterior cruciate ligament (ACL) is one of a pair of cruciate ligaments (the other being the posterior cruciate ligament) in the human knee. They are also called cruciform ligaments as they are arranged in a crossed formation. An anterior view of the right knee, showing anterior cruciate ligament with anteromedial (AM) and posterolateral (PL) bundles. Anterior cruciate ligament (surrounded by synovium) during knee arthroscopy. Lateral epicondylus of the femur can be seen to the right."}, {"url": "http://www.webmd.com/a-to-z-guides/anterior-cruciate-ligament-acl-injuries-topic-overview", "passage_text": "An anterior cruciate ligament, or ACL, injury is a tear in one of the knee ligaments that joins the upper leg bone with the lower leg bone. The ACL keeps the knee stable. Injuries range from mild, such as a small tear, to severe, such as when the ligament tears completely or when the ligament and part of the bone separate from the rest of the bone. Without treatment, the injured ACL is less able to control knee movement, and the bones are more likely to rub against each other"}, {"url": "http://www.webmd.com/fitness-exercise/guide/knee-ligament-injuries", "passage_text": "These injuries are common in soccer players, football players, basketball players, skiers, gymnasts, and other athletes. There are four ligaments in the knee that are prone to injury: 1  Mentioned above, the anterior cruciate ligament (ACL) is one of the two major ligaments in the knee. 2  It connects the thigh bone to the shin bone in the knee. 3  ACL injuries are a common cause of disability in the knee. Two important ligaments in the knee, the ACL and posterior cruciate ligament (PCL), connect the femur or thigh bone with the tibia, one of the bones of the lower leg."}, {"url": "https://answers.yahoo.com/question/index?qid=20071113110945AAh5XjA", "passage_text": "Report Abuse. anterior cruciate ligament (or ACL) is one of the four major ligaments of the knee. It connects from a posterio-lateral part of the femur to an anterio-medial part of the tibia. These attachments allow it to resist anterior translation of the tibia, in relation to the femur. The ACL (Anterior Cruciate Ligament) is one of four main ligaments in your knee. As you can tell from the name it is located in the front of the knee and prevents the shin from sliding too far forward from under you knee. It also helps with rotational stability of the knee"}]