[{"url": "http://localfoods.about.com/od/blackberries/a/About-Marionberries.htm", "passage_text": "Photo © Molly Watson. Marionberries Are Here! shout the signs. Offerings of marionberry shakes, pies, tarts, ice creams, sorbets, salads, and more litter menus across the state of Oregon come July and August. Tables at farmers markets get covered with baskets of the shiny blue-black berries. Marionberry season is serious business in the Pacific Northwest. The marionberry is the queen of blackberries with a complex and rich earthy flavor that skirts that edge of bitterness found in many blackberries. Many tasters find a similarity between marionberries and the rich earthy juiciness of Cabernet grapes."}, {"url": "http://www.salemhistory.net/commerce/marionberries.htm", "passage_text": "A Delicious Part of Salem's Past. The Marionberry is a bright, glossy blackberry with medium to large fruit, somewhat longer than wide. It is special to the area because it is named after the county in which it was developed, and 90% of the world's Marionberries are grown near Salem. The new variety was released under its name of Marionberry in 1956. The Marionberry is a trailing vigorous grower, generally producing only a few long canes which grow up to 20 feet. The Marionberry can produce up to six tons of fruit per acre. The quality of the Marionberry is high, with flavor superior to the Boysenberry or Evergreen blackberries"}, {"url": "http://www.oregon-berries.com/pick-a-berry/marionberry/", "passage_text": "Seedlings from the Chehalem-by-Olallie cross have been rather successful – producing big berries that are full of flavor. The most outstanding of these selections is the Marion Blackberry or Marionberry. Introduced by George F. Waldo in 1956 and adapted to Western Oregon, the Marionberry is named after Marion County, where it was tested extensively. The berry is medium to large, round and somewhat longer than wide. "}, {"url": "https://en.wikipedia.org/wiki/Marionberry", "passage_text": "Description and flavor [edit]. The marionberry is a vigorously growing trailing vine, usually producing just a few canes up to 20 feet long. The vines have many large spines, and the fruiting laterals are long and strong, producing many berries. The marionberry's growing conditions are perfectly adapted to the mild, maritime Oregon climate, with its mild rains and warm summers. The berries ripen throughout late spring and early summer. The harvesting season is typically between July 10 and August 10, with a single acre producing up to six tons in a harvest."}, {"url": "http://www.ehow.com/about_6365312_difference-between-blackberry-marionberry.html", "passage_text": "Marionberry combines the best traits of its parents. Denise Jones/iStock/Getty Images. Fruit Qualities. When it was introduced, the marionberry was the largest -- and generally considered the best-tasting -- blackberry cultivar when compared to wild blackberries and other blackberry cultivars. Its flavor has been characterized as complex, rich and earthy, with a good blend of sweetness and tartness. "}, {"url": "https://en.wikipedia.org/wiki/Marionberry", "passage_text": "The ' Marion' cultivar (Rubus L. subgenus Rubus) or Marion blackberry, marketed as marionberry (help·info) , is an indigenous blackberry developed by the USDA ARS breeding program in cooperation with Oregon State University. It is a cross between the ' Chehalem ' and ' Olallie ' blackberries. The marionberry's growing conditions are perfectly adapted to the mild, maritime Oregon climate, with its mild rains and warm summers. The berries ripen throughout late spring and early summer. The harvesting season is typically between July 10 and August 10, with a single acre producing up to six tons in a harvest."}, {"url": "https://simple.wikipedia.org/wiki/Marionberry", "passage_text": "Marionberry is a cultivar of blackberry. The cultivar is also known as marion blackberry. It was developed by a joint venture of Oregon State University, and currently accounts for over half of the blackberry cultivars sold in Oregon. "}, {"url": "http://www.merriam-webster.com/dictionary/marionberry", "passage_text": "Definition of MARIONBERRY. : the large black juicy fruit of a cultivar of a hybrid blackberry that originated in Oregon and is grown chiefly in the northwestern United States; also: a bramble bearing marionberries. ADVERTISEMENT. Marion Co., Oregon. Tweet"}]