[{"url": "http://www.sportsknowhow.com/soccer/dimensions/soccer-dimensions.html", "passage_text": "Adult Soccer Field Dimensions: Overall Dimensions. The overall dimensions of a regulation soccer field is 100 yards long and 60 yards wide. Midfield Line. The middle of the field is divided lengthwise by the midfield line. Center Circle."}, {"url": "http://www.answers.com/Q/What_are_the_dimensions_of_a_soccer_field", "passage_text": "The field dimension of a soccer stadium, in which is found optimal  by FIFA, is 110-120 yards long, and 70-80 yards wide. Most  organizations and high schools use these same … dimensions for their  soccer fields."}, {"url": "http://soccerhelp.com/Soccer_Field_Size.shtml", "passage_text": "The official soccer field size for adults can range from 50 to 100 yards wide by 100 to 130 yards long. However, the rules allow soccer field sizes to be reduced for women, players with disabilities and for players under 16 and over 35 years of age. The soccer field size used by youth leagues vary greatly."}, {"url": "http://amfootball.isport.com/amfootball-guides/american-football-field-dimensions", "passage_text": "Overall Dimensions: At the professional level, the total size of the field is 120 yards (360 feet) long by 53.5 yards (160 feet) wide; that total length is broken down into 100 yards of playing field and two end zones that are each 10 yards in length."}, {"url": "http://www.football-bible.com/soccer-info/field-dimensions-markings.html", "passage_text": "The dimensions are specified in Law 1 of the official FIFA Laws of the Game. According to FIFA rules, the standard length of a football pitch should be between 90-120 meters (100-131 yards) while its width is from 45-90 meters (49-100 yards). Football fields used in international matches have similar measurement to the league pitches."}, {"url": "http://www.soccer-training-guide.com/soccer-field-dimensions.html", "passage_text": "The overall dimensions of a regular soccer field are: 1  Minimum length: 100 yards (90 m). 2  Maximum length: 130 yards (120 m). 3  Minimum width: 50 yards (45 m). 4  Maximum wid"}]