[{"url": "https://answers.yahoo.com/question/index?qid=20090602093113AAxNthi", "passage_text": "Answers. Best Answer: The Grand Canyon is located in north of state of Arizona. It is located inside the Grand Canyon National Park. Its exact location is Latitude :- 36 15' N Longitude - 112 38' W The largest city located close to it Flagstaff which is in south."}, {"url": "http://www.answers.com/Q/What_is_the_latitude_and_longitude_of_the_Grand_Canyon", "passage_text": "A set of latitude and longitude describes a single point. Grand Rapids is a big place, with a lot of points in it, and every point has different coordinates. The center of … the intersection of Fulton and Division is located at 42.96323° north latitude 85.66813° west longitude. Anywhere else in town, those numbers will be somewhat different. They are used to measure distance north and south of the equator. Longitude lines, such as the Prime Meridian, connect the North Pole to the South Pole and are used to measure distances east and west of the Prime Meridian."}, {"url": "http://www.answers.com/Q/What_is_the_latitude_and_longitude_of_the_Grand_Canyon", "passage_text": "The longitude angles are expressed either east or west of the Prime Meridian, and 180° east is the same as 180° west. Latitude and longitude are used by mapmakers and navigators to determine the location of any given point on the earth. They are used to measure distance north and south of the equator. Longitude lines, such as the Prime Meridian, connect the North Pole to the South Pole and are used to measure distances east and west of the Prime Meridian."}, {"url": "http://www.travelmath.com/landmark/Grand+Canyon", "passage_text": "Landmarks. Travelmath provides a database of landmarks around the world, including the location of each land mark based on the latitude and longitude. You can view a satellite map of the landmark and find the local time zone. "}, {"url": "http://www.latlong.net/place/grand-canyon-5.html", "passage_text": "Grand Canyon Lat Long Coordinates Info. The latitude of Grand Canyon is 36.056595, and the longitude is -112.125092. Grand Canyon is located at United States country in the Canyons place category. Coordinates of Grand Canyon is given above in both decimal degrees and DMS (degrees, minutes and seconds) format. The country code given is in the ISO2 format. Last edited by voyager"}, {"url": "http://www.findlatitudeandlongitude.com/?loc=grand+canyon+national+park", "passage_text": "Map Coordinates of mouse displays the latitude and longitude in degrees, minutes, seconds decimal, degrees minutes decimal and degrees decimal of the current mouse location. Instructions. Map Coordinates displays the latitude and longitude coordinates in degrees, minutes, seconds decimal, degrees minutes decimal and degrees decimal of the current location. Selected Location displays the reverse geocoded location of the current latitude and longitude (approximation only)"}, {"url": "http://www.travelmath.com/cities/Grand+Canyon,+AZ", "passage_text": "Cities. Travelmath provides a database of major and local cities around the world. You can find the latitude and longitude of any world city, and check the city distance by comparing the flight distance between cities with the driving distance to see how far two cities are from each other. "}]