[{"url": "https://uk.answers.yahoo.com/question/index?qid=20080823031814AAKGBbp", "passage_text": "Rating Newest Oldest. Best Answer: Gaudy comes from the Latin 'gaudium' - joy. By 1647 the word was being used to mean rejoicing. Later uses include something fine or luxurious, which may have adorned a rosary. A gaudy-day was a day of rejoicing. The Spanish name Gaudi may well have derived from the Latin. "}, {"url": "http://www.edenics.net/english-word-origins.aspx?word=ARCHITECT", "passage_text": "English Word. The ARCHIVIST and ARCHITECT derive from Indo-European root arkhein (to begin, command, rule), a Greek verb of unknown origin.. The above mentioned professions involve organizing, arranging, and setting in order more than giving orders. Roots. The ARCHIVIST and ARCHITECT derive from Indo-European root arkhein (to begin, command, rule), a Greek verb of unknown origin.. The above mentioned professions involve organizing, arranging, and setting in order more than giving orders."}, {"url": "http://www.definitions.net/definition/architect", "passage_text": "Wiktionary (0.00 / 0 votes) Rate this definition: architect (Noun). A professional who designs buildings or other structures, or who prepares plans and superintends construction. Plato made the causes of things to be matter, ideas, and an efficient architect. "}, {"url": "http://www.answers.com/Q/Where_did_the_word_gothic_originate", "passage_text": "The word gothic is derived from a European tribe called the Goths, thought to have originated in southern Sweden, who spread all over Europe. The word is now used to describe an architectural style and, as a derivation of that, a genre of literature based on dark deeds in crumbling gothic mansions and castles. The modern trend in style called goth is similarly based on dark or arcane themes"}, {"url": "http://www.answers.com/Q/Where_did_the_word_gothic_originate", "passage_text": "The word comes from the name of a group of people who lived in Eastern Europe about 100 AD. It also refers to a style of architecture, painting and other arts used in Europe f … rom the 12th century to the 16th cetury. The word is now used to describe an architectural style and, as a derivation of that, a genre of literature based on dark deeds in crumbling gothic mansions and castles."}, {"url": "http://www.edenics.net/english-word-origins.aspx?word=ARCHITECT", "passage_text": "Hebrew Word. The ARCHIVIST and ARCHITECT derive from Indo-European root arkhein (to begin, command, rule), a Greek verb of unknown origin.. The above mentioned professions involve organizing, arranging, and setting in order more than giving orders. Roots. The ARCHIVIST and ARCHITECT derive from Indo-European root arkhein (to begin, command, rule), a Greek verb of unknown origin.. The above mentioned professions involve organizing, arranging, and setting in order more than giving orders."}, {"url": "http://www.english-for-students.com/arch.html", "passage_text": "This ROOT-WORD is the Root ARCH which means RULER. It comes from the GREEK archos. From this basic meaning it is associated with chief or head or king or origin in one way or another. You can make many words with ARCH, from ARCHbishop to ARCHfoe, from ARCHfriend to ARCHilar. Sometimes it is pronounced ARCH and sometimes ARK. 1. Myriarch: myri ARCH (mir’ i ark) n."}, {"url": "https://en.wikipedia.org/wiki/Architecture", "passage_text": "1 The design activity of the architect, from the macro-level (urban design, landscape architecture) to the micro-level (construction details and furniture). On the difference between the ideals of architecture and mere construction, the renowned 20th-century architect Le Corbusier wrote: You employ stone, wood, and concrete, and with these materials you build houses and palaces: that is construction. Ingenuity is at work."}, {"url": "https://en.wikipedia.org/wiki/Architecture", "passage_text": "Section of Brunelleschi 's dome drawn by the architect Cigoli (c. 1600). Architecture (Latin architectura, from the Greek ἀρχιτέκτων arkhitekton architect, from ἀρχι- chief and τέκτων builder) is both the process and the product of planning, designing, and constructing buildings and other physical structures. On the difference between the ideals of architecture and mere construction, the renowned 20th-century architect Le Corbusier wrote: You employ stone, wood, and concrete, and with these materials you build houses and palaces: that is construction. Ingenuity is at work."}]