[{"url": "http://math.about.com/od/statistics/a/MeanMedian.htm", "passage_text": "The Mode is 15 (15 occurs the most at 3 times). *It is important to note that there can be more than one mode and if no number occurs more than once in the set, then there is no mode for that set of numbers. Ocasionally in Statistics you'll be asked for the 'range' in a"}, {"url": "http://www.mathsisfun.com/mode.html", "passage_text": "To find the mode, or modal value, first put the numbers in order, then count how many of each number. A number that appears most often is the mode."}, {"url": "http://www.purplemath.com/modules/meanmode.htm", "passage_text": "The median is the middle value in the list of numbers. To find the median, your numbers have to be listed in numerical order, so you may have to rewrite your list first. The mode is the value that occurs most often. If no number is repeated, then there is no mode for the list."}, {"url": "http://www.purplemath.com/modules/meanmode.htm", "passage_text": "The median is the middle value. In a list of ten values, that will be the (10 + 1) ÷ 2 = 5.5 th value; that is, I'll need to average the fifth and sixth numbers to find the median: (10 + 11) ÷ 2 = 21 ÷ 2 = 10.5. The mode is the number repeated most often. This list has two values that are repeated three times."}, {"url": "http://mathworld.wolfram.com/Mode.html", "passage_text": "The most common value obtained in a set of observations. For example, for a data set (3, 7, 3, 9, 9, 3, 5, 1, 8, 5) (left histogram), the unique mode is 3. Similarly, for a data set (2, 4, 9, 6, 4, 6, 6, 2, 8, 2) (right histogram), there are two modes: 2 and 6. A distribution with a single mode is said to be unimodal."}, {"url": "http://www.wikihow.com/Find-the-Mode-of-a-Set-of-Numbers", "passage_text": "1 A data set's mean is its average. 2  To find the mean, add up all of the values in the data set, then divide by the number of values in the set. 3  For instance, for our example data set ({11, 15, 17, 17, 18, 19, 21, 21, 21}), the mean would be 11 + 15 + 17 + 17 + 18 + 19 + 21 + 21 + 21 = 160/9 = 17.78."}, {"url": "http://www.mathsteacher.com.au/year8/ch17_stat/02_mean/mean.htm", "passage_text": "The median of a set of data values is the middle value of the data set when it has been arranged in ascending order. That is, from the smallest value to the highest value. The mode of a set of data values is the value(s) that occurs most often."}, {"url": "http://www.purplemath.com/modules/meanmode.htm", "passage_text": "But there is no middle number, because there are an even number of numbers. In this case, the median is the mean (the usual average) of the middle two values: (2 + 4) ÷ 2 = 6 ÷ 2 = 3. The mode is the number that is repeated most often, but all the numbers in this list appear only once, so there is no mode."}]