[{"url": "http://www.investopedia.com/terms/i/intangibleasset.asp", "passage_text": "An asset that is not physical in nature. Corporate intellectual property (items such as patents, trademarks, copyrights, business methodologies), goodwill and brand recognition are all common intangible assets in today's marketplace. Should computer software be classified as an intangible asset or part of property, ... In accounting terms, an intangible asset is something of value that is not of physical nature. On the other hand,"}, {"url": "http://www.ehow.com/info_8103127_intangible-asset.html", "passage_text": "An intangible asset is an idea, concept or legal right that has some monetary value, but is not physical in nature. In essence, an intangible asset is a piece of valuable property that you cannot touch, see, hear, smell or taste. It has real value and existence, but it has no physical embodiment. Intangible assets include intellectual property, licenses and approvals, and business good will. Another common form of intangible assets is a copyright. A copyright gives the holder of the copyright the exclusive right to use or sell a specific literary or artistic rendition. A copyright is a legal right that has value even though the copyright itself is made up of nothing physical."}, {"url": "http://www.businessdictionary.com/definition/intangible-asset.html", "passage_text": "Definition. Reputation, name recognition, and intellectual property such as knowledge and know how. Intangible assets are the long-term resources of an entity, but have no physical existence. They derive their value from intellectual or legal rights, and from the value they add to the other assets"}, {"url": "https://en.wikipedia.org/wiki/Intangible_asset", "passage_text": "An intangible asset is an asset that lacks physical substance and usually is very hard to evaluate. It includes patents, copyrights, franchises, goodwill, trademarks, trade names. "}, {"url": "http://www.accountingtools.com/definition-intangible-asset", "passage_text": "Intangible Asset. Definition: An intangible asset is a non-physical asset having a useful life greater than one year. If an intangible asset is determined to have a useful life, then its book value is amortized over that useful life"}, {"url": "http://www.accountingtools.com/questions-and-answers/what-are-examples-of-intangible-assets.html", "passage_text": "An intangible asset is a non-physical asset having a useful life greater than one year. These assets are generally recognized as part of an acquisition, where the acquirer is allowed to assign some portion of the purchase price to acquired intangible assets. "}, {"url": "http://www.investopedia.com/ask/answers/012815/what-difference-between-tangible-and-intangible-assets.asp", "passage_text": "Tangible Assets. Tangible assets are physical assets such as land, vehicles, equipment, machinery, furniture, inventory, stock, bonds and cash. These assets are the backbone of a company that keep it in production but are not available to customers. "}, {"url": "http://financial-dictionary.thefreedictionary.com/intangible+asset", "passage_text": "intangible asset. An asset such as a patent, goodwill, or a mining claim that has no physical properties. Since intangible assets are often difficult to value accurately, such assets when included on a corporate balance sheet may have a true value significantly different from the dollar amounts indicated there."}, {"url": "http://financial-dictionary.thefreedictionary.com/intangible+asset", "passage_text": "A company's nonphysical assets, such as intellectual property (items such as patents, trademarks, copyrights, and business methodologies), goodwill, and brand recognition; an intangible asset can be classified as either indefinite or definite. An asset such as a patent, goodwill, or a mining claim that has no physical properties. Since intangible assets are often difficult to value accurately, such assets when included on a corporate balance sheet may have a true value significantly different from the dollar amounts indicated there."}]