[{"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMHT0011276/?report=details", "passage_text": "Uses of This Medicine. Morphine injection is used to relieve moderate to severe pain. It may also be used before or during surgery with an anesthetic (medicine that puts you to sleep). Morphine belongs to the group of medicines called narcotic analgesics (pain medicines). It acts on the central nervous system (CNS) to relieve pain"}, {"url": "https://en.wikipedia.org/wiki/Morphine", "passage_text": "Morphine, sold under many trade names, is a pain medication of the opiate type. It acts directly on the central nervous system (CNS) to decrease the feeling of pain. It can be used for both acute pain and chronic pain. Morphine is also frequently used for pain from myocardial infarction and during labour. It can be administered orally, intramuscularly, subcutaneously, intravenously, into the space around the spinal cord, or rectally. The primary source of morphine is isolation from poppy straw of the opium poppy. In 2013 an estimated 523,000 kilograms of morphine were produced. About 45,000 kilograms were used directly for pain, an increase over the last twenty years of four times. Most use for this purpose was in the developed world."}, {"url": "https://en.wikipedia.org/wiki/Morphine", "passage_text": "Morphine is primarily used to treat both acute and chronic severe pain. It is also used for pain due to myocardial infarction and for labor pains. However, concerns exist that morphine may increase mortality in the setting of non ST elevation myocardial infarction. The primary source of morphine is isolation from poppy straw of the opium poppy. In 2013 an estimated 523,000 kilograms of morphine were produced. About 45,000 kilograms were used directly for pain, an increase over the last twenty years of four times. Most use for this purpose was in the developed world."}, {"url": "http://drug.addictionblog.org/what-is-morphine-used-for/", "passage_text": "The main medical use of morphine is for relief of moderate to severe pain. Patients treated with morphine are diagnosed with either acute or chronic pain. Acute pain is considered pain that emerges suddenly and is severe and/or surprising. This includes anything from a broken bone to a respiratory attack. Share. 1. 1. 2. Morphine, an incredibly helpful pain reliever, has become a drug of abuse. Here, we explore what makes morphine addictive, morphine’s medicinal and recreational uses, as well as its negative side effects (such as dependence on morphine or morphine addiction)."}, {"url": "https://en.wikipedia.org/wiki/Morphine", "passage_text": "About 70% of morphine is used to make other opioids such as hydromorphone, oxycodone, heroin, and methadone. It is a Schedule II drug in the United States, Class A in the United Kingdom, and Schedule I in Canada. The primary source of morphine is isolation from poppy straw of the opium poppy. In 2013 an estimated 523,000 kilograms of morphine were produced. About 45,000 kilograms were used directly for pain, an increase over the last twenty years of four times. Most use for this purpose was in the developed world."}, {"url": "http://www.everydayhealth.com/drugs/morphine", "passage_text": "Morphine sulfate is a prescription drug used to treat moderate to severe acute or chronic pain. It's sold under several brand names, including Roxanol, Kadian, and Avinza. Morphine is part of a class of drugs called opiate (narcotic) analgesics, or opioid agonists, which block the transmission of pain signals to the brain by binding to nervous system proteins called opioid receptors. Morphine is also sometimes prescribed off label to treat pain in hospitalized children"}, {"url": "http://www.everydayhealth.com/drugs/morphine", "passage_text": "A: Morphine is a medication that is used for pain management and is in the class of medications called opioid narcotics. Opioids act by attaching to specific proteins called opioid receptors, which are found in the brain, spinal cord, and gastrointestinal tract. Morphine is part of a class of drugs called opiate (narcotic) analgesics, or opioid agonists, which block the transmission of pain signals to the brain by binding to nervous system proteins called opioid receptors. Morphine is also sometimes prescribed off label to treat pain in hospitalized children"}, {"url": "http://pain.emedtv.com/morphine/morphine-uses.html", "passage_text": "Morphine is an active ingredient in many different prescription medications. It is most often used to treat pain, although it is sometimes also used for other reasons (such as for anesthesia during surgeries or other procedures or for treating shortness of breath). For pain control, morphine is used both for short-term pain (such as after a surgery) and for long-term pain."}]