[{"url": "http://www.gamefaqs.com/webonly/562728-runescape/answers/79309-which-f2p-skill-is-the-best-for-making-money", "passage_text": "Holy_Morale answered: Really nothing is THAT good for making money on f2p, if you get members and do runecrafting 99, then you will end up making well over 300mil gp for it. 6 years ago 0 0. Ex-Kefiroth answered: The BEST way to make money in f2p is to man up and get your mining level to 85 so you can mine runite. (powermine iron in Al-Kharid for 32k xp per hour, this may take a few weeks). The only place you can find runite in f2p is in level 46 wilderness, northeast of the caged lesser demons. (2 rocks). Smithing is best even with 1 smithing, just smith bronze bars, also when you have 48 smithing, smith steel pl8 and sell. Wc-a nice skill to make money, only good at 60 wc. Yews are the most expensive logs, worth 350-500 ea. Runecrafting-turns out good when you can craft at least 6 air runes per ess."}, {"url": "http://www.wikihow.com/Make-Money-in-RuneScape-as-a-Non-Member", "passage_text": "If you’re new to RuneScape or are simply strapped for cash, there are plenty of ways to build up your savings. To make money in RuneScape as a non-member, try some of the following methods. Ad. How to Make Money in RuneScape as a Non Member. 12 Methods: Monster/NPC Drops Cooking/Food Crafting Fishing Magic Mining Smithing Runecrafting Woodcutting Other Methods Misthalin Training Centre of Excellence Method (10,000 gp) Additional Merchant Methods Featured on wikiHow."}, {"url": "http://www.gold4fans.com/news/best-way-to-make-money-in-old-school-runescape", "passage_text": "« Back. Today, Gold4fans wants to offer you the best way to make money in old school RuneScape! This is just a quick guide that will tell you one of the best and quickest ways to make money on Oldschool Runescape 2013. Check the guide and farm rs gold old school now! "}, {"url": "http://runescape.wikia.com/wiki/Money_making_guide", "passage_text": "This provides players with a list of ways to make money in RuneScape, along with the requirements, estimated profit per hour, and a guide explaining each method in detail. "}, {"url": "http://www.wikihow.com/Make-Money-in-RuneScape-as-a-Member", "passage_text": "1 Magic logs have a profit of 1.3k each, and the best way for making money for members with Woodcutting. 2  As of the 27/5/10 (DD/MM/YY), magic logs are roughly 1500 gp each on the Grand Exchange, but can increase or decrease depending on the time. This article presents several methods for making money in RuneScape as a Member. If you are not a RuneScape member, you may want to read how to make money in RuneScape as a non-member."}, {"url": "http://runescape.salmoneus.net/tips/making-money.html", "passage_text": "The best way for free-to-players to make money with the Fishing skill is on Karamja. Since they can only fish up to Swordfish, these fish along with Lobsters and sometimes Tuna are the best healing fish in the Free-to-play world. You can try to sell them either on the Grand Exchange, or in the RuneScape forums. However, it is usually hard to sell them in the RuneScape forums, so the Grand Exchange is recommended. Another alternative is using the High Alchemy spell on the Longbows. You will get 768 coins for each alchemy spell."}, {"url": "http://runescape.salmoneus.net/tips/making-money.html", "passage_text": "To make money off of Firemaking, you need to be a member in RuneScape. The only way to make money off of the Firemaking Skill is Shade Burning. To be able to burn shades it's suggested to go to World 77, the themed world for Shade burning. You can try to sell them either on the Grand Exchange, or in the RuneScape forums. However, it is usually hard to sell them in the RuneScape forums, so the Grand Exchange is recommended. Another alternative is using the High Alchemy spell on the Longbows. You will get 768 coins for each alchemy spell."}, {"url": "http://runescape.salmoneus.net/tips/making-money.html", "passage_text": "Levels 1 to 15. This, sad to say, is one of the worst times to make money through Woodcutting. All you will need to do, is gather around 1,000 normal logs with the best place to buy them is in Draynor Village. Then sell them on the Runescape Forums (You have to be a member to post on there, but not to view it). You can try to sell them either on the Grand Exchange, or in the RuneScape forums. However, it is usually hard to sell them in the RuneScape forums, so the Grand Exchange is recommended. Another alternative is using the High Alchemy spell on the Longbows. You will get 768 coins for each alchemy spell."}, {"url": "http://www.wikihow.com/Make-Money-in-RuneScape-as-a-Member", "passage_text": "1 Level 68-75: You are now at the level to chop Choking Ivy. 2  It's not very slow; this is the best way to get experience, but not money. 3  You can start on this at any level (68 or above). ( 4 This is a very good strategy for those that would like to get a few levels in one night). This article presents several methods for making money in RuneScape as a Member. If you are not a RuneScape member, you may want to read how to make money in RuneScape as a non-member."}]