[{"url": "http://www.wisegeekhealth.com/what-is-porphyria.htm", "passage_text": "Porphyria is a group of at least eight disorders that affect the human nervous system and skin. These disorders are usually genetic, but some people with a porphyria may not experience symptoms unless they encounter certain triggers, and others may never experience symptoms at all."}, {"url": "http://ghr.nlm.nih.gov/condition/porphyria", "passage_text": "Porphyria is a group of disorders caused by abnormalities in the chemical steps that lead to heme production. Heme is a vital molecule for all of the body's organs, although it is most abundant in the blood, bone marrow, and liver."}, {"url": "http://www.healthgrades.com/conditions/porphyria", "passage_text": "Acute porphyrias affect the nervous system. These types of porphyria are mainly inherited or genetic. Symptoms, which occur sporadically, include abdominal pain, numbness or tingling, cramping, vomiting, and mental disorders. Acute porphyrias are treated with medication and, in some cases, hospitalization."}, {"url": "https://labtestsonline.org/understanding/conditions/porphyria/", "passage_text": "The porphyrias are a group of uncommon diseases that produce signs and symptoms related to the skin, the nervous system, or both. They are caused by the accumulation of porphyrins within the body to unusually high levels. In all, there are seven types of porphyria."}, {"url": "http://www.webmd.com/a-to-z-guides/porphyria-symptoms-causes-treatment", "passage_text": "Porphyria is a group of disorders that can cause nerve or skin problems. A porphyria that affects the skin is called cutaneous porphyria. A porphyria that affects the nervous system is called acute porphyria. The most common type of porphyria is porphyria cutanea tarda (PCT), which affects the skin."}, {"url": "http://www.mayoclinic.org/diseases-conditions/porphyria/basics/definition/CON-20028849", "passage_text": "Porphyria (poor-FEAR-e-uh) refers to a group of disorders that result from a buildup of natural chemicals that produce porphyrin in your body. Porphyrins are essential for the function of hemoglobin — a protein in your red blood cells that links to porphyrin, binds iron, and carries oxygen to your organs and tissue."}, {"url": "http://ghr.nlm.nih.gov/condition/porphyria", "passage_text": "Other types of porphyria, called acute porphyrias, primarily affect the nervous system. These disorders are described as acute because their signs and symptoms appear quickly and usually last a short time. Episodes of acute porphyria can cause abdominal pain, vomiting, constipation, and diarrhea."}]