[{"url": "http://www.babynamewizard.com/baby-name/boy/roel", "passage_text": "Comments and insights on the name Roel: | Edit. Roel is a Dutch name, and short for Roeland or Roland. In Dutch, it's pronounced Ruhl (think: rule). "}, {"url": "http://www.sheknows.com/baby-names/name/roel", "passage_text": "French Meaning: The name Roel is a French baby name. In French the meaning of the name Roel is: Rock. American Meaning: The name Roel is an American baby name. In American the meaning of the name Roel is: Rock. SoulUrge Number: 11"}, {"url": "http://www.sheknows.com/baby-names/name/roel", "passage_text": "The name Roel is a French baby name. In French the meaning of the name Roel is: Rock. American Meaning: The name Roel is an American baby name. In American the meaning of the name Roel is: Rock."}, {"url": "http://www.ourbabynamer.com/meaning-of-Roel.html", "passage_text": "Last year this name was ranked as one of the top 1000 most popular names within its gender. Keep in mind how popular a name is. Your child may feel that they fit in more with a more popular name. On the other hand, they may feel more special if their name is less popular and more uniquely their own. As you see it can go both ways, so just keep this point in mind as you examine the different possibilities"}, {"url": "http://www.meaning-of-names.com/french-names/roel.asp", "passage_text": "Meaning of Roel. French name. In French, the name Roel means-rock.The name Roel originated as an French name. The name Roel is most often used as a boy name or male name. French Name Meaning-rock"}, {"url": "http://www.babynamespedia.com/meaning/Roel", "passage_text": "[ 1 syll. roe (l), ro-el ] The baby boy name Roel is pronounced R AH-L †. Roel's language of origin is Germanic. Roel is a form of the English, French, German, and Welsh Roland. Roel is an uncommon baby name for boys. At the modest height of its usage in 1975, 0.005% of baby boys were given the name Roel. Its ranking then was #937."}, {"url": "http://www.ancestry.com/name-origin?surname=roel", "passage_text": "You can find out when most of the Roel families immigrated to the United States. You can focus your search to immigration records dating from that era. Immigration records can tell you an ancestor's name, ship name, port of departure, port of arrival and destination. You can find out where the majority of the Roel families were living before they immigrated to the U.S and learn where to focus your search for foreign records. Immigration records can tell you an ancestor's name, ship name, port of departure, port of arrival,"}, {"url": "http://www.babynameshub.com/boy-names/Roel.html", "passage_text": "This chart illustrates how many Boys were named Roel in the U.S. since 1880. A few facts about the boy's name Roel: Records indicate that 690 boys in the United States have been named Roel since 1880. The greatest number of people were given this name in 1975, when 77 people in the U.S. were given the name Roel. Those people are now 40 years old. So .."}, {"url": "http://www.babynology.com/meaning-roel-m46.html", "passage_text": "List of Netherlands baby names, Netherlands baby boy names (male), girl names (female) & Netherlands names meanings has been compiled from various resources. Please use this list of Netherlands baby names only for reference/idea to name your kid/child. Database of baby names has been compiled from various references and suggestions provided by our web site visitors and resources partners. Meaning of Roel in Netherlands origin/culture for Boy name with history and fame detail"}]