[{"url": "http://www.answers.com/Q/If_you_touch_lava_will_you_die", "passage_text": "But if you touch lava at all you will be very badly burnt. Yes you will die if you are exposed to it for any amount of time."}, {"url": "http://volcano.oregonstate.edu/how-close-can-i-get-lava-and-will-it-hurt-or-kill-me", "passage_text": "How close you can get depends on what kind of lava flow it is, and whether you are upwind or downwind. For example, the most approachable lava is pahoehoe. This is because each toe forms an insulating skin seconds after emerging on the surface."}, {"url": "http://www.youtube.com/watch?v=iZrotNEdgow", "passage_text": "what happens if you touch the lava. lava. lava lamp. lava hound. lava rock. lava grill. lava pixar. lavender."}, {"url": "https://in.answers.yahoo.com/question/index?qid=20061120213511AAamV8c", "passage_text": "You would quickly realize how idiotic it is to touch molten rock. First you would need to get to the lava, which would completely be dependent on the wind. If it's blowing to your front, you won't get very close, if it's blowing to your back, then fair will have it that you'll be successful in touching lava."}, {"url": "http://www.answers.com/Q/If_you_touch_lava_will_you_die", "passage_text": "It would technically be possible to touch a small amount of it, but  it would instantly result in a third degree burn. Normally,  however, if you try to approach lava, the h … eat will become  unbearable before you can get close enough to touch it."}, {"url": "http://www.answers.com/Q/What_do_you_do_if_you_touch_lava", "passage_text": "It depends on how big the body of water is and how much lava touches it. For example, in the Hawaiian islands, on Big Island, the volcano Mauna Kea regulary erupts non-explosi … vely, with rivers of pahoehoe lava flowing into the ocean."}, {"url": "http://volcano.oregonstate.edu/how-close-can-i-get-lava-and-will-it-hurt-or-kill-me", "passage_text": "Lava won't kill you if it briefly touches you. You would get a nasty burn, but unless you fell in and couldn't get out, you wouldn't die. With prolonged contact, the amount of lava coverage and the length of time it was in contact with your skin would be important factors in how severe your injuries would be!"}, {"url": "http://www.answers.com/Q/What_do_you_do_if_you_touch_lava", "passage_text": "It would technically be possible to touch a small amount of it, but  it would instantly result in a third degree burn. Normally,  however, if you try to approach lava, the h … eat will become  unbearable before you can get close enough to touch it."}]