[{"url": "http://www.school-for-champions.com/astronomy/sun.htm", "passage_text": "The Sun is the center of our solar system, with 9 planets and is one of billions of stars in our galaxy. The Sun provides light and heat to the orbiting planets. It is extremely large compared to the Earth and is 92 million miles away. Explanation of the Characteristics of our Sun by Ron Kurtus-Succeed in Understanding Astronomy. Key words: solar system, stars, planets, galaxy, Earth, universe, meteors, comets, Physical Science, School for Champions."}, {"url": "http://www.school-for-champions.com/astronomy/sun.htm", "passage_text": "The Sun is the center of our solar system, with 9 planets, asteroids and other objects rotating around it. One of 100 billion stars in our galaxy, the Sun provides light and heat to the orbiting planets. It is extremely large compared to the Earth. Explanation of the Characteristics of our Sun by Ron Kurtus-Succeed in Understanding Astronomy. Key words: solar system, stars, planets, galaxy, Earth, universe, meteors, comets, Physical Science, School for Champions."}, {"url": "http://space-facts.com/the-sun/", "passage_text": "Sun Facts. The Sun or Sol, is the star at the centre of our solar system and is responsible for the Earth’s climate and weather. The Sun is an almost perfect sphere with a difference of just 10km in diameter between the poles and the equator. The average radius of the Sun is 695,508 km (109.2 x that of the Earth) of which 20–25% is the core."}, {"url": "http://www.ehow.com/about_5348711_unique-sun.html", "passage_text": "Size and Age. The sun is 109 times wider than the Earth and 330,000 times heavier. The sun formed approximately 4.5 billion years ago and will burn for an estimated 5 billion years more, so the sun is at the mid-point of its lifespan. "}, {"url": "http://www.space.com/58-the-sun-formation-facts-and-characteristics.html", "passage_text": "The photosphere is the lowest layer of the sun's atmosphere, and emits the light we see. It is about 300 miles (500 km) thick, although most of the light comes from its lowest third. Temperatures in the photosphere range from 11,000 F (6,125 C) at bottom to 7,460 F (4,125 C) at top. Sunspots are relatively cool, dark features on the sun's surface that are often roughly circular. They emerge where dense bundles of magnetic field lines from the sun's interior break through the surface. [ Related: Largest Sunspot in 24 Years Wows Scientists, But Also Mystifies ]."}, {"url": "http://www.infoplease.com/encyclopedia/science/sun-astronomy-general-characteristics-sun.html", "passage_text": "Its mass is almost 700 times the total mass of all the bodies in the solar system and 332,000 times that of the earth. The sun's surface gravity is almost 28 times that of the earth; i.e., a body on the surface of the sun would weigh about 28 times its weight on earth. General Characteristics of the Sun. The sun is a star of about medium size; it appears so much larger and brighter than the other stars because of its relative nearness to the earth. The earth's distance from the sun varies from 91,377,000 mi (147,053,000 km) at perihelion to 94,537,000 mi (152,138,000 km) at aphelion (see apsis). The mean distance is c.92,960,000 mi (149,591,000 km); this is taken as the astronomical unit (AU) of distance used for measuring distances within the solar system"}, {"url": "http://www.space.com/58-the-sun-formation-facts-and-characteristics.html", "passage_text": "The solar atmosphere above that consists of the photosphere, chromosphere, a transition region and the corona. Beyond that is the solar wind, an outflow of gas from the corona. The core extends from the sun's center to about a quarter of the way to its surface. Although it only makes up roughly 2 percent of the sun's volume, it is almost 15 times the density of leadand holds nearly half of the sun's mass. Next is the radiative zone, which extends from the core to 70 percent of the way to the sun's surface, making up 32 percent of the sun's volume and 48 percent of its mass. Sunspots are relatively cool, dark features on the sun's surface that are often roughly circular. They emerge where dense bundles of magnetic field lines from the sun's interior break through the surface. [ Related: Largest Sunspot in 24 Years Wows Scientists, But Also Mystifies ]."}, {"url": "http://www.infoplease.com/encyclopedia/science/sun-astronomy-general-characteristics-sun.html", "passage_text": "| Share | Cite. The sun is a star of about medium size; it appears so much larger and brighter than the other stars because of its relative nearness to the earth. The earth's distance from the sun varies from 91,377,000 mi (147,053,000 km) at perihelion to 94,537,000 mi (152,138,000 km) at aphelion (see apsis). The mean distance is c.92,960,000 mi (149,591,000 km); this is taken as the astronomical unit (AU) of distance used for measuring distances within the solar system. General Characteristics of the Sun. The sun is a star of about medium size; it appears so much larger and brighter than the other stars because of its relative nearness to the earth."}]