[{"url": "https://en.wikipedia.org/wiki/Summary_judgment", "passage_text": "From Wikipedia, the free encyclopedia. In law, a summary judgment (also judgment as a matter of law) is a judgment entered by a court for one party and against another party summarily, i.e. , without a full trial. Such a judgment may be issued on the merits of an entire case, or on discrete issues in that case. Issuance of summary judgment can be based only upon the court's finding that: 1  there are no disputes of material fact requiring a trial to resolve, and. 2  in applying the law to the undisputed facts, one party is clearly entitled to judgment."}, {"url": "http://law.freeadvice.com/litigation/civil_law_suits/response-to-motion-for-summary-judgment.htm", "passage_text": "Filing an Opposition to a Motion for Summary Judgment. If a motion for summary judgment is filed against you, you must file an opposition to the motion for summary judgment showing that there are issues of fact in dispute. A response must be in writing and include the same supporting documents as a motion for summary judgment. If there are any issues in dispute, the motion for summary judgment will be denied. Failure to comply with any rules of procedures can also result in a denial of a motion or a response. If a motion for final summary judgment is granted, the decision can be appealed."}, {"url": "http://jailhouselaw.org/summary-judgment/", "passage_text": "The judge can then end your case by awarding summary judgment to the prison officials. On the other hand, if you give the judge some evidence that supports your version of the important facts, then there is a real dispute. The prison officials are not entitled to summary judgment and your case should go to trial. Through summary judgment, a court can throw out part or all of your case. Under Rule 56(c)(2), to win on summary judgment, the prison officials have to prove to the judge there is no genuine issue as to any material fact and that defendants are entitled to judgment as a matter of law."}, {"url": "http://www.cochranfirm.com/what-is-a-motion-for-summary-judgment/", "passage_text": "If the motion is granted, the judgment on the issue or case is deemed to be a final judgment from which a party may seek an appeal. The court of appeal can reverse the grant of summary judgment and reinstate the claim in the lower court. However, this is rarely done and most summary judgments are upheld on appeal. As the name implies, the motion for summary judgment is a motion filed by one of the parties seeking to obtain a judgment on all or part of the case in a summary fashion."}, {"url": "https://en.wikipedia.org/wiki/Summary_judgment", "passage_text": "Absent an award of summary judgment (or some type of pretrial dismissal), a lawsuit will ordinarily proceed to trial, which is an opportunity for litigants to present evidence in an attempt to persuade the factfinder that they are saying what really happened, and that, under the applicable law, they should prevail. Issuance of summary judgment can be based only upon the court's finding that: 1  there are no disputes of material fact requiring a trial to resolve, and. 2  in applying the law to the undisputed facts, one party is clearly entitled to judgment."}, {"url": "http://www.nolo.com/legal-encyclopedia/credit-card-debt-judgments.html", "passage_text": "The creditor files a motion for summary judgment and tries to convince the judge that none of the facts of the case are in dispute—for example, that you signed a legal loan agreement, made no payments, and have no defense as to why you’re not paying. If the credit card company gets a judgment, it can use all sorts of collection methods against you to get paid. There several ways a credit card company can get a judgment against you after it has filed a lawsuit."}, {"url": "https://en.wikipedia.org/wiki/Summary_judgment", "passage_text": "In law, a summary judgment (also judgment as a matter of law) is a judgment entered by a court for one party and against another party summarily, i.e. , without a full trial. Issuance of summary judgment can be based only upon the court's finding that: 1  there are no disputes of material fact requiring a trial to resolve, and. 2  in applying the law to the undisputed facts, one party is clearly entitled to judgment."}, {"url": "http://jailhouselaw.org/summary-judgment/", "passage_text": "If there is a real dispute, the court should just deny summary judgment. In reality however, if the prison officials moving for summary judgment have a lot of evidence, like witness statements and medical records, and all you have is a verified complaint, you may lose summary judgment. Through summary judgment, a court can throw out part or all of your case. Under Rule 56(c)(2), to win on summary judgment, the prison officials have to prove to the judge there is no genuine issue as to any material fact and that defendants are entitled to judgment as a matter of law."}, {"url": "http://law.freeadvice.com/litigation/civil_law_suits/response-to-motion-for-summary-judgment.htm", "passage_text": "If you find yourself in a lawsuit, you could be served with a motion for summary judgment, which is a request to end a case without a trial. A motion for summary judgment filed by an opposing party claims that you cannot prevail in the case because there is no legal dispute or your claim is without merit or a defense. Failure to respond to a motion for summary judgment can result in your case being dismissed or a judgment being rendered against you. If there are any issues in dispute, the motion for summary judgment will be denied. Failure to comply with any rules of procedures can also result in a denial of a motion or a response. If a motion for final summary judgment is granted, the decision can be appealed."}]