[{"url": "http://www.apparentag.com.au/documents/msds/66891_APPARENT_OXYFLUORFEN_240_HERBICIDE_MSDS_1.pdf", "passage_text": "This product is a Schedule 5 Poison (S5) and must be stored in accordance with the relevant Health Department regulations. Apparent Oxyfluorfen 240 Herbicide is not classified as Dangerous Goods under the Australian Code for the Transport of Dangerous Goods by Road and Rail. SECTION 8 EXPOSURE CONTROLS / PERSONAL PROTECTION Exposure Guidelines: Exposure guidelines have been established for N-methyl pyrrolidone by safe Work Australia. In the case of spillage, stop leak if safe to do so, and contain spill. and absorb spilled material with absorbent material such as sand, clay or cat litter and dispose of waste as indicated in section 13 or according to the Australian Standard 2507 - Storage and Handling of Pesticides."}, {"url": "http://msdssearch.dow.com/webapps/include/GetDoc.aspx?ObjectId=&filepath=au/pdfs/noreg/012-10171.pdf&pdf=true&Referrer=", "passage_text": "SAFETY DIRECTIONS • Will damage the eyes and irritate the skin. • Avoid contact with eyes and skin. • When opening the container and preparing spray and using the prepared spray, wear cotton overalls buttoned to the neck and wrist and a washable hat, elbow-length butyl rubber gloves and goggles. • If product on skin, immediately wash area with soap and water. • If product in eyes wash it out immediately with water"}, {"url": "http://www.pestgenie.com.au/MSDS/SYNGENTA/Innova_Oxyfluorfen_240EC_MSDS.pdf", "passage_text": "Syngenta Crop Protection Pty Ltd Page 3 of 7 Innova Oxyfuorfen 240 EC Herbicide April 2008 (5) Shovel the absorbed spill into drums. (6) Decontaminate the spill area with detergent and water and rinse with the smallest volume of water practicable. "}, {"url": "http://herbiguide.com.au/Labels/OXY24_62699-0108.PDF", "passage_text": "APVMA Approval No.: 62699/0108OzCrop Oxyfluorfen 240 EC • Page 8 of 8 MSDS Additional information is listed in the material safety data sheet(MSDS). A material safety data sheet for OXYFLUORFEN 240 EC isavailable from CMS TRADE on request. CROP SAFETY OXYFLUORFEN 240 EC may be applied as directed spray arounddormant peach, plum, apricot, almond, apple and pear trees and grap evines of all ages when applied at rates of less than 1.0 L/ha."}, {"url": "http://pmep.cce.cornell.edu/profiles/extoxnet/metiram-propoxur/oxyfluorfen-ext.html", "passage_text": "Reproductive Effects. The NOEL in a 3-generation reproduction study with rats was 10 ppm (0.5 mg/kg/day). At 100 ppm (5 mg/kg/day), there were decreased survival of fetuses and decreased maternal and fetal weights (5). It is therefore highly resistant to degradation in the soil environment (7). Decomposition by light occurs slowly, with 15% of the oxyfluorfen applied to a soil surface degrading within 28 days (7). In laboratory studies, its soil half-life was 6 months (7). Its soil half-life in field studies is 30 to 70 days, with much of the loss probably due to volatilization (3, 4, 7"}, {"url": "http://dkt.net.au/msdsfiles/Oxyfluorfen%20240.pdf", "passage_text": "(7) Decontaminate the spill area with detergent and water and rinse. Syngenta Crop Protection Pty Ltd Page 3 of 6 INNOVA OXYFLUORFEN 240 HERBICIDE March 2008 with the smallest volume of water practicable. Section 7: HANDLING AND STORAGE Precautions for Safe Handling: Will damage eyes and will irritate the skin. Avoid contact with eyes and skin. Syngenta Crop Protection Pty Ltd Page 2 of 6 INNOVA OXYFLUORFEN 240 HERBICIDE March 2008 Section 4: FIRST AID MEASURES In case of poisoning by any exposure route contact a doctor or Poisons Information Centre on 131 126. Have the product label or SDS with you when calling or going for treatment."}, {"url": "http://www.fluoridealert.org/wp-content/pesticides/oxyfluorfen-page.htm", "passage_text": "Use Profile Oxyfluorfen is a diphenyl-ether herbicide used for broad spectrum pre-and post-emergent control of annual broadleaf and grassy weeds in a variety of tree fruit, nut, vine, and field crops. The largest agricultural markets in terms of total pounds active ingedient are wine grapes and almonds. Much of this increase in treated broccoli and onion acreage was due to the end of production of DCPA (a pre-emergence herbicide). An estimated 12% of cotton acreage in Louisiana was treated with oxyfluorfen in 1992; that estimate increased to 20% of cotton acreage in Louisiana in 1997."}]