[{"url": "https://en.wikipedia.org/wiki/Malpighian_tubule_system", "passage_text": "Malpighian tubules are slender tubes normally found in the posterior regions of arthropod alimentary canals. Each tubule consists of a single layer of cells that is closed off at the distal end with the proximal end joining the alimentary canal at the junction between the midgut and hindgut. The system is named after Marcello Malpighi, a seventeenth-century anatomist. It is unclear as to whether the Malpighian tubules of arachnids and those of the Uniramia are homologous or the result of convergent evolution."}, {"url": "http://www.wisegeek.com/what-is-a-malpighian-tubule.htm", "passage_text": "A Malpighian tubule is an anatomical structure found in the digestive system of insects that live on land. Usually, these tubules excrete solid waste products, creating an efficient way for the insect to expel toxins and products left over from the breakdown of the insect’s food. Sometimes, a Malpighian tubule is used for functions that are specific to a certain type of insect."}, {"url": "http://micro.magnet.fsu.edu/optics/olympusmicd/galleries/darkfield/grasshoppermalpighian1.html", "passage_text": "The grasshopper's tubules, as with other insect Malpighian tubules, discharge into the posterior region of the gut tube (the hindgut) and function in a similar fashion to the kidneys of higher terrestrial animals. In contrast, aquatic insects eliminate nitrogenous wastes as ammonia using nephridia. Contributing Authors. Grasshopper Malpighian Tubules. The challenges of survival for terrestrial insects such as the grasshoppers (order Orthoptera) include conserving water, particularly in arid regions of the world including the deserts and grasslands."}, {"url": "http://encyclopedia2.thefreedictionary.com/Malpighian+tubules", "passage_text": "Malpighian Tubules. excretory organs in the majority of arachnids, myriopods, and insects; they are blind tubular appendages of the intestine, on the boundary between the mesenteron (midgut) and proctodeum (hindgut)."}, {"url": "http://www.merriam-webster.com/dictionary/Malpighian%20tubule", "passage_text": "Definition of MALPIGHIAN TUBULE. : any of a group of long blind vessels opening into the posterior part of the alimentary canal in most insects and some other arthropods and functioning primarily as excretory organs —called also Malpighian tube. See Malpighian tubule defined for kids. ADVERTISEMENT"}, {"url": "http://www.thefreedictionary.com/Malpighian+tubule+system", "passage_text": "Any of the tubules that extend from the posterior portion of the digestive tract of insects and certain other arthropods and that absorb waste material from the hemolymph for excretion. Also called Malpighian tube. "}, {"url": "https://en.wikipedia.org/wiki/Malpighian_tubule_system", "passage_text": "The Malpighian tubule system is a type of excretory and osmoregulatory system found in some insects, myriapods, arachnids, and tardigrades. The system consists of branching tubules extending from the alimentary canal that absorbs solutes, water, and wastes from the surrounding hemolymph. The wastes then are released from the organism in the form of solid nitrogenous compounds. The system is named after Marcello Malpighi, a seventeenth-century anatomist. It is unclear as to whether the Malpighian tubules of arachnids and those of the Uniramia are homologous or the result of convergent evolution."}, {"url": "http://micro.magnet.fsu.edu/optics/olympusmicd/galleries/darkfield/grasshoppermalpighian1.html", "passage_text": "The uric acid is absorbed by the Malpighian tubules and the low pH in the tubule lumen causes uric acid to precipitate out as dry matter. The nitrogen waste is excreted with other solid waste through the anus of the grasshopper. Grasshopper Malpighian Tubules. The challenges of survival for terrestrial insects such as the grasshoppers (order Orthoptera) include conserving water, particularly in arid regions of the world including the deserts and grasslands."}, {"url": "http://insects.about.com/od/m/g/def_malpighian.htm", "passage_text": "By Debbie Hadley. Definition: Slender tubules attached to the insect's alimentary canal, at the point where the midgut and hindgut are joined. The Malpighian tubules function as an excretory system and aid in osmoregulation. The tubules empty into the alimentary canal, and remove nitrogenous wastes from the insect's body. These structures were named for an Italian anatomist named Marcello Malpighi, who discovered the tubules in the seventeenth century."}]