[{"url": "http://www.efile.com/tax-return-costs-preparation-prices-fees-and-free-efile/", "passage_text": "On hrblock.com ® or turbotax.com ® , not only do you pay a higher price for a state return (which varies based on the federal return you prepare), but you also have to pay for EACH state. No matter how many state tax returns you need to prepare, efile.com will charge you ONLY a single fee of $19.95. Turbo Tax does not have a Basic Edition, but they have a Free Federal Edition for returns that can be prepared on Form 1040-EZ or 1040-A efile.com only charges $24.95 for as many state returns as you need to prepare, and that price will not change no matter what type of federal return you prepare."}, {"url": "http://personalfinance.costhelper.com/tax-returns.html", "passage_text": "1 A part-time tax-preparer who operates out of a home may charge around $100 for a relatively simple return. 2  A professional CPA operating out of an office might charge $200-$400 for a relatively straightforward return, depending on the complexity of the return, the local cost of living, and the size of the office. 1 Software, such as Intuit's TurboTax, typically costs between $20-$90, depending on the complexity of your returns and whether you need to complete a state return. 2  During the past two years, retail discounts during February and March have been common. 3  An online version, Web TurboTax, is also available."}, {"url": "http://www.accountingweb.com/tax/irs/tax-return-preparation-fees-vary-by-type-of-return-geographic-region", "passage_text": "For example, tax preparation firms with gross annual income of $50,000 or less charge an average of $174 for an itemized Form 1040 with Schedule A and a state tax return, while a company with gross income of $400,000 or more charges an average of $305. Even one extra deduction or tax credit can more than cover the fee paid to a professional tax preparer.. The survey found that tax preparation fees for an itemized Form 1040 with Schedule A and a state tax return averaged $217 at one-person firms and jumped slightly to $245 for firms with three or more staff. Firms with lower levels of gross income also charge less on average than larger companies"}, {"url": "http://blogs.wsj.com/totalreturn/2013/01/24/what-tax-preparers-really-charge/", "passage_text": "They have various credentials, including CPA, IRS enrolled agent and accredited tax preparer. According to the survey, the average cost to prepare an itemized Form 1040 with a Schedule A (for itemized deductions) and a state tax return is $246. The average rate for a return without itemized deductions is lower: $143. “I think most people would say this is worth the money,” says NSA official John Ams. Here is the average fee for an itemized Form 1040 with Schedule A and a state tax return in different U.S. census districts: 1  New England (CT, ME, MA, NH, RI, VT) – $237. 2  Middle Atlantic (NJ, NY, PA) – $258. 3  South Atlantic (DE, DC, FL, GA, MD, NC, SC, VA, WV) – $253."}, {"url": "http://www.cbsnews.com/news/how-much-do-you-pay-for-tax-prep/", "passage_text": "In its annual survey of Tax Return Preparation Fee Averages, the National Society of Accountants reports the following average fees its members charged to prepare 2014 tax returns: 1  1040 with state return with no itemized deductions: $159. 2  1040 with Schedule A (itemized deductions) and state return: $273. 1 The average additional fee charged if you don't provide your information at least two weeks before a filing deadline is about $93. 2  The average additional fee for expediting a tax return is $88. 3  And the average fee for filing for an extension is $42."}, {"url": "http://www.fivecentnickel.com/2010/04/13/how-much-does-tax-preparation-cost-2/", "passage_text": "I just ran across a bit of interesting information on the cost of tax preparation from the National Society of Accountants. According to their biennial survey, the average tax prep fee for an itemized Form 1040 with Schedule A plus a state tax return is $229. For a Form 1040 and state return without itemized deductions, the average price drops to $129. Update: Be sure to check out this recent post from GetRichSlowly with tons of additional data on tax preparation costs for 2012. Tax prep fees also vary regionally, so the above average aren’t necessarily applicable depending on where you live. The lowest costs are in the “East South Central” region (AL, KY, MS, TN) where a Form 1040 with a Schedule A and state return averages $137."}, {"url": "http://www.accountingweb.com/tax/irs/tax-return-preparation-fees-vary-by-type-of-return-geographic-region", "passage_text": "The average tax preparation fee for an itemized Form 1040 with Schedule A and a state tax return in each U.S. Census district are as follows: • New England (CT, ME, MA, NH, RI, VT) – $205. • Middle Atlantic (NJ, NY, PA) – $252. • South Atlantic (DE, DC, FL, GA, MD, NC, SC, VA, WV) – $243. Even one extra deduction or tax credit can more than cover the fee paid to a professional tax preparer.. The survey found that tax preparation fees for an itemized Form 1040 with Schedule A and a state tax return averaged $217 at one-person firms and jumped slightly to $245 for firms with three or more staff. Firms with lower levels of gross income also charge less on average than larger companies"}, {"url": "https://www.irs.gov/publications/p334/ch08.html", "passage_text": "Tax preparation fees. You can deduct on Schedule C or C-EZ the cost of preparing that part of your tax return relating to your business as a sole proprietor or statutory employee. You can deduct the remaining cost on Schedule A (Form 1040) if you itemize your deductions. "}]