[{"url": "http://study.com/academy/lesson/organelles-in-cells-definition-functions-quiz.html", "passage_text": "Organelles and Their Functions. The nucleus is arguably the most important organelle in the cell. It is the control center, telling all of the other organelles what to do and when to do it. The nucleus also contains all of the cell's genetic material, or its DNA."}, {"url": "http://www.answers.com/Q/What_organelle_functions_as_the_cells_power_plant", "passage_text": "Confidence votes 1.7K. The mitochondria (Singular: Mitochondrion) is often called a cells power plant. This is because it makes the cells energy."}, {"url": "http://biology.about.com/od/cellanatomy/ss/organelles.htm", "passage_text": "1 Nucleus-a membrane bound structure that contains the cell's hereditary (DNA) information and controls the cell's growth and reproduction. 2  It is commonly the most prominent organelle in the cell. 3  Mitochondria-as the cell's power producers, mitochondria convert energy into forms that are usable by the cell."}, {"url": "http://www.answers.com/Q/Which_organelle_is_the_power_plant_of_the_cell", "passage_text": "The organelles of a plant cell include: The Cell Wall, Chloroplasts, Endoplasmic Reticulum, Golgi Apparatus, Microfilaments, Microtubules, Mitochondria, Nucleus, Peroxisomes, … Plasmodesmata, Plasma Membrane, Ribosomes, and Vacuoles."}, {"url": "http://biology.about.com/od/cellanatomy/ss/organelles.htm", "passage_text": "The nucleus is an organelle that is surrounded by a double membrane called the nuclear envelope. The nuclear envelope separates the contents of the nucleus from the rest of the cell. Eukaryotic cells also have a cell membrane (plasma membrane), cytoplasm, cytoskeleton, and various cellular organelles."}, {"url": "http://www.answers.com/Q/What_organelle_functions_as_the_cells_power_plant", "passage_text": "The organelles in a plant are ribosomes, mitochondria, vacuoles, nucleus, nuclear membrane, cytoplasm, the cell membrane, chloroplasts which contains chlorophyll, and the cell … wall. 20 people found this useful. 1  The Five Major Parts of the Brain At its most basic, the brain controls the body."}, {"url": "http://www.nature.com/scitable/topicpage/mitochondria-14053590", "passage_text": "Mitochondria are unusual organelles. They act as the power plants of the cell, are surrounded by two membranes, and have their own genome. They also divide independently of the cell in which they reside, meaning mitochondrial replication is not coupled to cell division."}, {"url": "http://biologyfunfacts.weebly.com/cell-organelles.html", "passage_text": "Nucleus. The nucleus is one of the most important organelles in a cell. It is often the largest organelle in animal cells, but this is not always the case. Nuclei contain the genetic material called DNA that is responsible for controlling and directing all cell activities."}]