[{"url": "http://www.legacy.com/Obituaries.asp?Page=LifeStory&PersonId=46083", "passage_text": "PITTSBURGH (AP) Hall of Famer Willie Stargell, the thunderous home run hitter who carried the Pittsburgh Pirates into two World Series with his power and helped win them with his patriarchal leadership, died early Monday after a long illness. He was 61. "}, {"url": "https://simple.wikipedia.org/wiki/Willie_Stargell", "passage_text": "Wilver Dornell Willie Stargell (March 6, 1940 – April 9, 2001) was an American professional baseball player. He was nicknamed pops in the later years of his career. He played Major League Baseball for 21 years. "}, {"url": "https://en.wikipedia.org/wiki/Willie_Stargell", "passage_text": "Wilver Dornell Willie Stargell (March 6, 1940 – April 9, 2001), nicknamed Pops in the later years of his career, was an American professional baseball player. Over his 21-year career with the Pirates, he batted .282, with 2,232 hits, 423 doubles, 475 home runs and 1,540 runs batted in, helping his team capture six National League East division titles, two National League pennants and two World Series (1971, 1979). Stargell was inducted into the Baseball Hall of Fame in 1988."}, {"url": "http://www.baseball-almanac.com/players/player.php?p=stargwi01", "passage_text": "Willie Stargell Stats. Willie Stargell was born on Wednesday, March 6, 1940, in Earlsboro, Oklahoma. Stargell was 22 years old when he broke into the big leagues on September 16, 1962, with the Pittsburgh Pirates. 17 - Willie Stargell went 17-for-54 in his World Series Stats, a .315 career batting average. Willie Stargell was the seventeenth player elected to the National Baseball Hall of Fame on the first ballot. 18 - Willie Stargell hit seven home runs that cleared the roof in Forbes Field"}, {"url": "http://baseballhall.org/hof/stargell-willie", "passage_text": "Willie Stargell. “Having Willie Stargell on your ball club is like having a diamond ring on your finger.” --Chuck Tanner, who managed Stargell with the Pirates from 1977-82. Willie Stargell was a feared power hitter, and a leader on the field and in the clubhouse during his 21 seasons with the Pittsburgh Pirates, from 1962-1982. Primary position: Left Fielder. “Having Willie Stargell on your ball club is like having a diamond ring on your finger.” --Chuck Tanner, who managed Stargell with the Pirates from 1977-82."}, {"url": "http://www.williestargellfoundation.org/", "passage_text": "Your first look at who will be attending this year's Willie Stargell Celebrity Invitational! Willie Stargell Celebrity Invitational added 57 new photos to the album: 2015 Celebrity Guest List.Your first look at who will be attending this year's Willie Stargell Celebrity Invitational! ... See moreSee less. Willie Stargell Celebrity Invitational shared Pittsburgh Pirates's photo. ... See moreSee less. 35 years ago today, the 1979 #Pirates became the 4th team in history to erase a 3-1 series deficit to win the World Series."}, {"url": "https://en.wikipedia.org/wiki/Willie_Stargell", "passage_text": "Stargell was born in Earlsboro, Oklahoma, but later moved to Florida with an aunt after the divorce of his parents. Later he returned to Alameda, California to live with his mother. He attended Encinal High School, where his baseball teammates included future MLB players Tommy Harper and Curt Motton. Over his 21-year career with the Pirates, he batted .282, with 2,232 hits, 423 doubles, 475 home runs and 1,540 runs batted in, helping his team capture six National League East division titles, two National League pennants and two World Series (1971, 1979). Stargell was inducted into the Baseball Hall of Fame in 1988."}, {"url": "http://www.baseball-almanac.com/players/player.php?p=stargwi01", "passage_text": "4 - Willie Stargell hit three home runs in a game four (4) times in his career. Only four other players at the time of his retirement had at least four three-homer games: Johnny Mize (6 times), Ernie Banks (4 times), Lou Gehrig (4 times) and Ralph Kiner (4 times). 17 - Willie Stargell went 17-for-54 in his World Series Stats, a .315 career batting average. Willie Stargell was the seventeenth player elected to the National Baseball Hall of Fame on the first ballot. 18 - Willie Stargell hit seven home runs that cleared the roof in Forbes Field"}]