[{"url": "http://www.drugs.com/vet/advantage-ii-small-cat.html", "passage_text": "Treatment of cats with Advantage II for cats rapidly kills fleas and reduces the incidence of this condition. Advantage II for cats kills fleas and may reduce the incidence of this condition. Advantage II for cats kills the existing fleas on cats within 12 hours."}, {"url": "https://www.facebook.com/CrazyCatLadiesUnite/posts/407305909375464", "passage_text": "Advantage Multi is a comprehensive product for cats that controls not only fleas, but roundworm, hookworm, heartworm disease and whipworm. Effects. Side effects of Advantage are rare, but may include mild skin irritation, depending on the sensibility of the animal's skin. Some consumers have noted topical hair loss on cats and slight fur discoloration."}, {"url": "http://www.consumersearch.com/flea-control/advantage-ii-for-cats", "passage_text": "Advantage II for Cats gets consistently high ratings from both vets and cat owners. Though it doesn't work for every cat, it's more consistently effective than any other product. One monthly dose, applied to the back of the cat's neck, kills adult fleas as well as eggs and larvae."}, {"url": "http://www.drugs.com/vet/advantage-ii-small-cat.html", "passage_text": "Fleas, eggs and larvae in the cat’s surroundings are killed following contact with an Advantage II for cats treated cat. Advantage II for cats provides multi-stage flea control effectively breaking all flea life-cycle stages for lasting control of flea populations."}, {"url": "http://pictures-of-cats.org/advantage-ii-flea-treatment-neurological-side-effect.html", "passage_text": "Bayer’s Advantage® II flea treatment for cats contains unlisted inert ingredients that may cause permanent neurological damage to your cat or dog (vetinfo). Advantage® II for cats contains an active ingredient which acts on the nervous system of the flea."}, {"url": "https://www.vetdepot.com/advantage-ii.html", "passage_text": "Advantage II for Dogs & Cats is a topical flea preventative for dogs and cats where a single application lasts for an entire month. As soon as you apply it to your pet's skin, Advantage II goes to work."}, {"url": "https://www.vetdepot.com/advantage-ii.html", "passage_text": "Advantage II is a monthly, topical flea preventative for dogs older than 7 weeks of age and cats older than 8 weeks of age. You apply it to your pet's skin every 30 days where its two ingredients--imidacloprid and pyriproxyfen--go to work killing adult fleas, larvae, and eggs."}, {"url": "http://www.1800petmeds.com/Advantage+II+-prod10433.html", "passage_text": "Q & A. Advantage II is a monthly flea preventative for dogs and cats that offers comprehensive flea protection by killing adult fleas, larvae, and eggs. Plus, it kills fleas through contact, which means fleas don't have to bite your pet to die. Advantage II also treats, prevents, and controls lice on dogs."}]