[{"url": "https://askabiologist.asu.edu/chlorophyll-and-chloroplasts", "passage_text": "show/hide words to know. 1  Chlorophyll: the pigment that gives plants their green color and allows them to absorb sunlight... 2  more. 3  Chloroplast: a part of a cell found in plants that converts light energy into energy plants can use (sugar). 4  Other living organisms such as algae also have cells that contain chloroplasts. show/hide words to know. 1  Chlorophyll: the pigment that gives plants their green color and allows them to absorb sunlight... 2  Chloroplast: a part of a cell found in plants that converts light energy into energy plants can use (sugar). 3  Thylakoid: the disk-shaped parts of a plant cell where light-dependent reactions occur..."}, {"url": "https://askabiologist.asu.edu/chlorophyll-and-chloroplasts", "passage_text": "1 Chlorophyll: the pigment that gives plants their green color and allows them to absorb sunlight... 2  more. 3  Chloroplast: a part of a cell found in plants that converts light energy into energy plants can use (sugar). 4  Other living organisms such as algae also have cells that contain chloroplasts. show/hide words to know. 1  Chlorophyll: the pigment that gives plants their green color and allows them to absorb sunlight... 2  Chloroplast: a part of a cell found in plants that converts light energy into energy plants can use (sugar). 3  Thylakoid: the disk-shaped parts of a plant cell where light-dependent reactions occur..."}, {"url": "http://www.answers.com/Q/What_does_chlorophyll_do_in_chloroplast", "passage_text": "Chloroplasts are plastids (Small organelles which contain pigment or food) which contain chlorophyll where photosynthesis occurs. Chlorophyll is the green pigment present in … the chloroplast responsible for the absorption of sunlight to provide energy for photosynthesis."}, {"url": "http://www.answers.com/Q/What_does_chlorophyll_do_in_chloroplast", "passage_text": "Chloroplasts are the plastids that chlorophyll and chlorophyll is the green pigment present in the plant that help it for the process of photosynthesis. Chlorophyll is the green pigment present in … the chloroplast responsible for the absorption of sunlight to provide energy for"}, {"url": "https://en.wikipedia.org/wiki/Chlorophyll", "passage_text": "Chlorophyll is vital for photosynthesis, which allows plants to absorb energy from light. Chlorophyll molecules are specifically arranged in and around photosystems that are embedded in the thylakoid membranes of chloroplasts. In these complexes, chlorophyll serves two primary functions. "}, {"url": "https://askabiologist.asu.edu/chlorophyll-and-chloroplasts", "passage_text": "Being green. Chlorophyll, a green pigment found in chloroplasts, is an important part of the light-dependent reactions. Chlorophyll soaks up the energy from sunlight. It is also the reason why plants are green. You may remember that colors are different wavelengths of light. show/hide words to know. 1  Chlorophyll: the pigment that gives plants their green color and allows them to absorb sunlight... 2  Chloroplast: a part of a cell found in plants that converts light energy into energy plants can use (sugar). 3  Thylakoid: the disk-shaped parts of a plant cell where light-dependent reactions occur..."}, {"url": "https://in.answers.yahoo.com/question/index?qid=20070423051913AAKABNK", "passage_text": "Chlorophyll is a green photosynthetic pigment found in most plants, algae, and cyanobacteria. Chlorophyll is vital for photosynthesis, which helps plants obtain energy from light. for more details click below. Source(s): http://en.wikipedia.org/wiki/Chlorophyll. VISU · 9 years ago. Report Abuse. "}, {"url": "https://askabiologist.asu.edu/chlorophyll-and-chloroplasts", "passage_text": "The story of chlorophyll and chloroplasts. Chloroplasts are tiny factories inside the cells of plants. They are also found in the cells of other organisms that use photosynthesis. Chloroplasts take the energy from the sunlight and use it to make plant food. show/hide words to know. 1  Chlorophyll: the pigment that gives plants their green color and allows them to absorb sunlight... 2  Chloroplast: a part of a cell found in plants that converts light energy into energy plants can use (sugar). 3  Thylakoid: the disk-shaped parts of a plant cell where light-dependent reactions occur..."}, {"url": "https://en.wikipedia.org/wiki/Chloroplast", "passage_text": "A chloroplast is one of three types of plastids, characterized by its high concentration of chlorophyll (the other two types, the leucoplast and the chromoplast, contain little chlorophyll and do not carry out photosynthesis). Chlorophyll b is an olive green pigment found only in the chloroplasts of plants, green algae, any secondary chloroplasts obtained through the secondary endosymbiosis of a green alga, and a few cyanobacteria. It is the chlorophylls a and b together that make most plant and green algal chloroplasts green."}, {"url": "http://www.answers.com/Q/Does_chloroplast_contain_chlorophyll", "passage_text": "Chloroplasts are plastids (Small organelles which contain pigment or food) which contain chlorophyll where photosynthesis occurs. Chlorophyll is the green pigment present in … the chloroplast responsible for the absorption of sunlight to provide energy for photosynthesis. The thylakoids contain the chlorophyll. Chlorophyll molecules are embedded in the thylakoid membranes. Together with associated proteins, they form the system for trap … ping light energy and converting it into chemical form."}]