[{"url": "https://eoss.asu.edu/wellness/sleep", "passage_text": "Within a 24-hour cycle, the average sleep need for children is 9 hours, for adolescents (13-24 years old) is 9.25 hours, and for adults is 8 hours. As people move into senior ages, their sleep needs reflect those of adolescents. If you are unsure of how much sleep you need each night, work with the average amount of 8 hours. This gives you an idea of your weekly sleep need (in this case, 56 hours). Think about how many hours, on average, you get each night of the week."}, {"url": "https://www.uhs.uga.edu/sleep/", "passage_text": "College students, like Americans overall, are sleeping less, and if you are like most college students, chances are you are not getting enough sleep. On average, most college students get 6 - 6.9 hours of sleep per night, and the college years are notoriously sleep-deprived due to an overload of activities. Recent research on college students and sleep indicates that insufficient sleep impacts our health, our moods, our GPA and our safety. Sleep really matters. Approximately 30-50% of college students nap, but the effect is that nappers sleep less than non-nappers. If you do nap, nap early in the day and keep it to about 20-30 minutes."}, {"url": "http://collegetidbits.com/do-i-really-need-to-sleep-sleep-deprivation-college-students/", "passage_text": "Various studies show that college students average less than six hours of sleep every night – with many getting much less than that – and that as little as 10 percent of college student self-identify as being good sleepers. Sleep deprivation in college students is a significant problem, especially considering that the average college students only sleeps roughly 6 hours a night – a full 120 minutes less than what is recommended by science!"}, {"url": "http://campusgrotto.com/how-much-should-college-students-sleep.html", "passage_text": "The trick is to find the proper balance by not under or oversleeping. According to Stanford University, the average sleep requirement for college students is well over eight hours, and the majority of students would fall within the range of this value plus or minus one hour.. Unfortunately, not everyone has that much time to dedicate to sleep on a consistent nightly basis. No one really needs to be sleeping more than 9 hours a night. It is important to find the proper balance of sleep because studies show that people who sleep 8 hours or more, or less than 6.5 hours, don't live as long as those who get between 6.5 and 7.5 a night."}, {"url": "http://www.gallup.com/poll/166553/less-recommended-amount-sleep.aspx", "passage_text": "U.S. adults likely get less sleep than would be ideal, with the average reported 6.8 hours below the minimum recommendation of seven hours per night. Forty percent get six hours sleep or less per night. PRINCETON, NJ -- Fifty-nine percent of Americans get seven or more hours of sleep at night, while 40% get less than seven hours. Those figures are largely unchanged from Gallup polls in the 1990s and 2000s, but Americans, on average, slept much more in the 1940s."}, {"url": "http://www.brighthub.com/education/college/articles/91620.aspx", "passage_text": "So what is the recommended amount of sleep for college students? It depends on who you ask. For a long time, the National Sleep Foundation has recommended 7-9 hours of sleep per night for adults, with young adults such as college students falling in the 8-9 hours range. Newer research, however, suggests this may be an overstatement and that 6.5 to 7.5 hours of sleep is best, with over 8 hours per night actually having negative health effects. So college students today might want to shoot for 7-8 hours, at least until the sleep researchers work out their differences."}]