[{"url": "http://www.ehow.com/about_6629271_definition-analytical-laboratory-technician.html", "passage_text": "Description. An analytical laboratory technician runs tests in a laboratory environment and analyzes her results. She is not a scientist and cannot create the tests that she runs. The laboratory scientists will create the test and the conditions for the test. The types of tests vary depending on her lab and her scientific focus. Pay. The pay of an analytical laboratory technician can vary depending on his lab. According to the Indeed, the average salary of a laboratory technician was around $40,000. Payscale reported the hourly wage to be about $14 to $19 on regular time and $19 to $29 on overtime."}, {"url": "http://www.mymajors.com/career/analytical-technician/", "passage_text": "What Chemical Technicians do: 1  Maintain, clean, or sterilize laboratory instruments or equipment. 2  Provide and maintain a safe work environment by participating in safety programs, committees, or teams and by conducting laboratory or plant safety audits. 1 Provide technical support or assistance to chemists or engineers. 2  Compile and interpret results of tests and analyses. 3  Develop or conduct programs of sampling and analysis to maintain quality standards of raw materials, chemical intermediates, or products."}, {"url": "http://www.mymajors.com/career/analytical-technician/", "passage_text": "1 Monitor product quality to ensure compliance with standards and specifications. 2  Conduct chemical or physical laboratory tests to assist scientists in making qualitative or quantitative analyses of solids, liquids, or gaseous materials. 3  Order and inventory materials to maintain supplies. 1 Provide technical support or assistance to chemists or engineers. 2  Compile and interpret results of tests and analyses. 3  Develop or conduct programs of sampling and analysis to maintain quality standards of raw materials, chemical intermediates, or products."}, {"url": "http://www.mymajors.com/career/analytical-technician/", "passage_text": "1 Conduct chemical or physical laboratory tests to assist scientists in making qualitative or quantitative analyses of solids, liquids, or gaseous materials. 2  Order and inventory materials to maintain supplies. 3  Train new employees on topics such as the proper operation of laboratory equipment. 1 Provide technical support or assistance to chemists or engineers. 2  Compile and interpret results of tests and analyses. 3  Develop or conduct programs of sampling and analysis to maintain quality standards of raw materials, chemical intermediates, or products."}, {"url": "http://www.indeed.com/q-ANALYTICAL-LAB-TECHNICIAN-jobs.html", "passage_text": "Lab Assistant/Technician. 1269, during the entire time they are assisting in the analytical testing phase. The Laboratory Assistant will follow the guidelines set by CLIA, and the CA... "}, {"url": "http://study.com/what_does_a_medical_lab_technician_do.html", "passage_text": "Medical laboratory technicians assist physicians in the diagnosis and treatment of diseases by performing tests on tissue, blood and other body fluids. Medical lab technicians most commonly work in hospitals or doctors' offices. Medical lab technicians work under the supervision of a physician, lab manager or medical technologist and perform laboratory tests on specimens. The tests that lab techs conduct assist doctors in verifying the causes of an illness, making medical decisions and determining treatment option"}, {"url": "http://www.mymajors.com/career/analytical-technician/", "passage_text": "1 Maintain, clean, or sterilize laboratory instruments or equipment. 2  Provide and maintain a safe work environment by participating in safety programs, committees, or teams and by conducting laboratory or plant safety audits. 1 Provide technical support or assistance to chemists or engineers. 2  Compile and interpret results of tests and analyses. 3  Develop or conduct programs of sampling and analysis to maintain quality standards of raw materials, chemical intermediates, or products."}, {"url": "http://www.wisegeek.org/what-does-a-laboratory-technician-do.htm", "passage_text": "Often, people are familiar with the work laboratory technicians do in a medical lab, but they work in many other environments as well. For example, this person may find work in the pharmaceutical industry or in the education field. He might also work for a research organization or even for the government. "}]