[{"url": "http://rempros.com/costs/granite_countertop_prices.html", "passage_text": "Cost to get a new granite countertop installed varies from $30 to $75 per square foot. There are three essential factors which determine the total cost of granite countertop installation: amount spent on purchasing granite slab, cost of fabrication, and actual on-site installation expenses. The information about purchasing price of granite slabs usually not provided to homeowners and might be useful just for a general idea why not all granite colors cost the same. Typically granite separated by color names into groups with $5 - $10 price difference"}, {"url": "http://ths.gardenweb.com/discussions/2476854/price-of-graniteam-i-totally-ignorant", "passage_text": "My kitchen was right at 60 sq feet of counter top space, and I chose a level I granite (St Cecilia Gold) that was $40 per sq foot, which included templating, cutting, edging, and installation. I also paid an additional $150 per sink cutout, and had two sinks. So $2700 total. In the new house I was quoted the same for quartz, $85 for Bianco Romano, and initially $130 for Blue Pearl. We did find excessive inventory Blue Pearl and got it for $100 sq ft. I checked 4 different suppliers in our area, and they were all about the same price."}, {"url": "http://www.construction-bids.com/granite-countertops.php", "passage_text": "Santa Cecilia Granite Price: Installation santa cecilia granite price should range from $34 to $45 per sq ft. 12x12 granite tiles can range $5.75 to $10 a piece. For raw material expect to from $18 to $23 per sq ft. Baltic Brown Granite Reviews: Aka Bruno Baltico. Speckle pattern. Ubatube Granite price for slab will vary depending on thickness and how much custom work needs to be done. Average price for installation can range from $32.00 to $42.00 per sq ft. Raw material cost will range from $13 to $15 a sq ft."}, {"url": "http://www.contractortalk.com/f11/cost-slab-granite-23919/", "passage_text": "Originally Posted by GraniteNJ. I'm a granite installer in new jersey and stone can cost for as little as $5 sqft all the way up to $100 to $1000 sqft for exotic stone and slab range from 48in to 76in tall by 84in to 130in long. but average stone is like 66in X 110in and $10 to $25 on average. __________________. "}, {"url": "http://rempros.com/costs/granite_countertop_prices.html", "passage_text": "Cost difference between ¾” (2 cm) and 1 ¼” (3 cm) granite countertop. Thickness of granite countertop normally won’t affect the total cost significantly. On average expect to pay up to 10% cheaper for ¾” compare to 1 ¼” option but there is no proration of price for granite countertop installation based on its thickness. The information about purchasing price of granite slabs usually not provided to homeowners and might be useful just for a general idea why not all granite colors cost the same. Typically granite separated by color names into groups with $5 - $10 price difference per square foot."}, {"url": "http://rempros.com/costs/granite_countertop_prices.html", "passage_text": "Some granite countertop fabricators will include the sink cutout in the total price of granite countertop installed resulting higher cost per square foot while others will add it as a separate fee which might vary from $130 to $360. The information about purchasing price of granite slabs usually not provided to homeowners and might be useful just for a general idea why not all granite colors cost the same. Typically granite separated by color names into groups with $5 - $10 price difference per square foot."}, {"url": "http://www.construction-bids.com/granite-countertops.php", "passage_text": "Absolute Black Granite Price: If purchasing tiles: Black Granite Price will average around $2.80 to $6.98 for a 12x12 piece. Absolute Black Granite Price for installation will range from $25-$35 per sq ft. Raw material cost will average $20 to $26 a sq ft. Caledonia Granite Reviews: AKA Caledonia Brown. Ubatube Granite price for slab will vary depending on thickness and how much custom work needs to be done. Average price for installation can range from $32.00 to $42.00 per sq ft. Raw material cost will range from $13 to $15 a sq ft."}, {"url": "http://ths.gardenweb.com/discussions/2667661/cost-of-granite-slabs", "passage_text": "Justmeind, Depends on so much, size, grade of the slab, of course type of granite, and thickness. Figure from $500 to $750 for a 55 square foot slab for level one, Uba Tuba, Santa Cecilia and such, 3cm thick, a few bucks a square foot less for 2cm. Nicer granite will run $12 to $16.00 per square foot, $880 to $1,000. The better yardstick for granite pricing is the cost per square foot (mine was $40/sf, but again it was an exotic). I believe that common or garden variety granites are in the $10-16/sf range for 2 cm; 3 cm granites are, perhaps, 25-40% more if available in your area."}, {"url": "http://rempros.com/costs/granite_countertop_prices.html", "passage_text": "Usually there is a fee for demolishing and hauling away of an existing countertop. Each contractor will have own rates for preparation work, but on average expect to pay $130 - $220 for removing the old countertop and $90 - $140 for a disposal charge. How much did you pay for granite countertop installation. The information about purchasing price of granite slabs usually not provided to homeowners and might be useful just for a general idea why not all granite colors cost the same. Typically granite separated by color names into groups with $5 - $10 price difference per square foot."}]