[{"url": "http://getruchin.blogspot.com/2011/02/what-is-vanna-whites-salary-on-wheel-of.html", "passage_text": "Vanna White's Salary. 1. Vanna White's salary arrangement has not been made public but as of October 2010 her Wheel of Fortune host salary has been estimated at $4 million per year, according to Celebrity Net Worth."}, {"url": "http://www.celebritynetworth.com/richest-celebrities/models/vanna-white-net-worth/", "passage_text": "Vanna White net worth and salary: Vanna White is an American television personality best known as the hostess and puzzle-board turner of Wheel of Fortune who has a net worth of $30 million dollars. Vanna White was born Vanna Marie Rosich on February 18, 1957 in Conway, South Carolina. After her birth father abandoned the family, Vanna's mom married a man named Herbert Stackley White, Jr. Vanna soon adopted Herbert's last name and was forever known as the now famous Vanna White."}, {"url": "http://www.therichest.com/celebnetworth/celeb/actress/vanna-white-net-worth/", "passage_text": "About Vanna White. Best recognized as the hostess of Wheel of Fortune, Vanna White is an American film actress and TV personality with an estimated net worth of $15 million as of 2012. Vanna White debuted as a TV personality in one episode of The Price of Right on June 20, 1980."}, {"url": "http://www.celebritynetworth.com/richest-celebrities/models/vanna-white-net-worth/", "passage_text": "$8 million. Vanna White net worth and salary: Vanna White is an American television personality best known as the hostess and puzzle-board turner of Wheel of Fortune who has a net worth of $30 million dollars. Vanna White was born Vanna Marie Rosich on February 18, 1957 in Conway, South Carolina. After her birth father abandoned the family, Vanna's mom married a man named Herbert Stackley White, Jr. Vanna soon adopted Herbert's last name and was forever known as the now famous Vanna White."}, {"url": "http://ecelebrityfacts.com/Celebrity-Net-Worth/vanna-white-net-worth.html", "passage_text": "Vanna White is an American television personality and film actress best known as the hostess of Wheel of Fortune since 1982. Currently her net worth has been estimated around $20 million dollars. Her annual salary has been concluded to be around $4 million per year. Vanna White was born on February 18, 1957 in Conway, South Carolina with a birth name of Vanna Marie Rosich. After her birth father abandoned the family, Vanna's mom married a man named Herbert Stackley White, Jr."}]