[{"url": "https://sites.google.com/site/climatetypes/tropical-wet", "passage_text": "Tropical Wet gets it name from the regular rainfall it receives throughout the year. It sometimes rains every day--usually in the morning or early afternoon. The reason it rains so much here is because of the regular warm temperatures, which evaporate water and keep the humidity high. Most areas of Tropical Wet receive over 100 inches of rain per year, although some receive nearly 300 inches per year. The constant rain and direct sunlight at the equator allow tropical rainforests to develop. This is the only climate that can support true rainforests. Tropical rainforests only cover 6% of the Earth's surface, yet they produce 40% of the oxygen and support nearly half of all plant and animal species known to Earth."}, {"url": "https://en.wikipedia.org/wiki/Tropical_savanna_climate", "passage_text": "1 The third type of tropical savanna climate features a lengthy wet season and a relatively short dry season. 2  This version features seven or more wet season months and five or less dry season months. 3  This version's precipitation pattern is similar to precipitation patterns observed in some tropical monsoon climates. In essence, a tropical savanna climate tends to either see less rainfall than a tropical monsoon climate or have more pronounced dry seasons. There are generally four types of tropical savanna climate: 1  One form of the tropical savanna climate features distinct wet and dry seasons of relatively equal duration."}, {"url": "https://en.wikipedia.org/wiki/Tropical_savanna_climate", "passage_text": "1 One form of the tropical savanna climate features distinct wet and dry seasons of relatively equal duration. 2  Most of the region's annual rainfall is experienced during the wet season and very little precipitation falls during the dry season. In essence, a tropical savanna climate tends to either see less rainfall than a tropical monsoon climate or have more pronounced dry seasons. There are generally four types of tropical savanna climate: 1  One form of the tropical savanna climate features distinct wet and dry seasons of relatively equal duration."}, {"url": "http://www.earthonlinemedia.com/ebooks/tpe_3e/climate_systems/tropical_wetdry_1.html", "passage_text": "Figure 9.6 Impala on the Savanna. (Source: FAO). The Tropical Wet/Dry climate is located on the poleward sides of the tropical wet climates, positioned between them and the tropical dry climates. This location places the climate at an intermediate position between the ITCZ and the Subtropical High. However, the average annual temperature is similar to that of the other tropical wet climates. Mean monthly temperatures in the Tropical Wet/Dry climate range from 18 o C (64.4 o F) to above 25 o C (77 o F)."}, {"url": "http://www.earthonlinemedia.com/ebooks/tpe_3e/climate_systems/tropical_wetdry_1.html", "passage_text": "(UN/DPI Photo #187250C by Evan Schneider). The Tropical Wet/Dry climate is the driest of the tropical wet climates. Like the monsoon climate, it has a distinct seasonality to its precipitation. However, its wet season is much shorter and receives far less precipitation than the monsoon climate. However, the average annual temperature is similar to that of the other tropical wet climates. Mean monthly temperatures in the Tropical Wet/Dry climate range from 18 o C (64.4 o F) to above 25 o C (77 o F)."}, {"url": "http://www.earthonlinemedia.com/ebooks/tpe_3e/climate_systems/tropical_steppe.html", "passage_text": "Figure 9.9 Tropical steppe of Ethiopia. (Sources (FAO). The tropical steppe climate is a transitional climate between the tropical wet and tropical dry climates. The controlling factors of the climate are similar to that of the tropical dry climate, though temperatures are cooler and annual precipitation is higher. The tropical steppe is not as dry as the tropical desert climate as it lies closer to a source of moisture. If on the equatorward side of the desert it is the ITCZ, or the subpolar low and midlatitude cyclones if it is located poleward side."}, {"url": "http://www.earthonlinemedia.com/ebooks/tpe_3e/climate_systems/tropical_wetdry_1.html", "passage_text": "Precipitation Figure 9.7 A Baobab tree, with its thick trunk and large edible fruit, Dakar, Senegal. (UN/DPI Photo #187250C by Evan Schneider) The Tropical Wet/Dry climate is the driest of the tropical wet climates. Like the monsoon climate, it has a distinct seasonality to its precipitation. However, its wet season is much shorter and receives far less precipitation than the monsoon climate. However, the average annual temperature is similar to that of the other tropical wet climates. Mean monthly temperatures in the Tropical Wet/Dry climate range from 18 o C (64.4 o F) to above 25 o C (77 o F)."}, {"url": "http://thebritishgeographer.weebly.com/the-climate-of-tropical-regions.html", "passage_text": "The general pattern of the tropical climate is warm temperatures. Depending on the type of tropical climate, humidity is variable with Equatorial climates experiencing large quantities of precipitation all year round and Tropical Wet and Dry and Tropical Monsoon climates expereincing seasonal shifts in rain patterns. The Tropical Climate Control. The most important climate control in regard to the tropical climate types relates to the position of the Inter Tropical Convergent Zone or ITCZ. The ITCZ is an area of low pressure and marks the point of trade wind convergence."}, {"url": "https://en.wikipedia.org/wiki/Tropical_savanna_climate", "passage_text": "Tropical savanna climate or tropical wet and dry climate is a type of climate that corresponds to the Koeppen köppen climate classification Categories aw And. as In essence, a tropical savanna climate tends to either see less rainfall than a tropical monsoon climate or have more pronounced dry seasons. There are generally four types of tropical savanna climate: 1  One form of the tropical savanna climate features distinct wet and dry seasons of relatively equal duration."}]