[{"url": "http://hivinsite.ucsf.edu/insite?page=basics-00-18", "passage_text": "The HIV test is designed to detect antibodies to HIV in your blood or saliva. Antibodies are proteins produced by your body when you have an infection and they help fight infection. If you are infected with HIV, your body makes very specific antibodies to fight the infection. Results from either type of test usually take 1 to 2 weeks. There is a rapid HIV test where you can receive the results in less than 30 minutes. For the rapid test, a clinic staff member will prick your finger with a needle and take a few drops of your blood."}, {"url": "http://www.cdc.gov/hiv/basics/testing.html", "passage_text": "These antigen/antibody combination tests can find HIV as soon as 3 weeks after exposure to the virus, but they are only available for testing blood, not oral fluid. The rapid test is an immunoassay used for screening, and it produces quick results, in 30 minutes or less. If your first test is a lab test, and it is positive, the lab will conduct follow-up testing, usually on the same blood specimen as the first test. Currently there are only two home HIV tests: the Home Access HIV-1 Test System and the OraQuick In-home HIV test."}, {"url": "https://en.wikipedia.org/wiki/Diagnosis_of_HIV/AIDS", "passage_text": "The window period is the time from infection until a test can detect any change. The average window period with HIV-1 antibody tests is 25 days for subtype B. Antigen testing cuts the window period to approximately 16 days and NAT (Nucleic Acid Testing) further reduces this period to 12 days."}, {"url": "http://www.webmd.com/hiv-aids/hiv-aids-screening", "passage_text": "Standard tests. These blood tests check for HIV antibodies. Your body makes antibodies in response to the HIV infection. These tests can't detect HIV in the blood soon after infection because it takes time for your body to make these antibodies. It generally takes two to 8 weeks for your body to produce antibodies, but in some cases it can take up to six months. Newer tests can detect the presence of HIV antigen, a protein, up to 20 days earlier than standard tests. This helps prevent spread of the virus to others and means an earlier start for treatment. It is done with a pinprick to the finger."}, {"url": "https://aidsinfo.nih.gov/education-materials/fact-sheets/19/47/hiv-testing", "passage_text": "HIV screening tests. The HIV antibody test is the most common HIV screening test. The test checks for HIV antibodies in blood, urine, or fluids from the mouth. HIV antibodies are disease-fighting proteins that the body produces in response to HIV infection. "}, {"url": "http://www.sfaf.org/hiv-info/testing/hiv-test-window-periods.html", "passage_text": "Antibody tests (Rapid tests) — give a positive result based on antibodies to HIV, not the virus itself. 1  2-8 weeks (up to 2 months) after infection, most people will have enough antibodies to test positive. 2  12 weeks (3 months) after infection, about 97% of people will have enough antibodies to test positive. "}, {"url": "http://www.mayoclinic.org/diseases-conditions/hiv-aids/basics/tests-diagnosis/con-20013732", "passage_text": "HIV is most commonly diagnosed by testing your blood or saliva for antibodies to the virus. Unfortunately, it takes time for your body to develop these antibodies — usually up to 12 weeks. These tests include: 1  CD4 count. 2  CD4 cells are a type of white blood cell that's specifically targeted and destroyed by HIV. 3  Even if you have no symptoms, HIV infection progresses to AIDS when your CD4 count dips below 200. 4  Viral load. 5  This test measures the amount of virus in your blood."}, {"url": "http://www.webmd.com/hiv-aids/human-immunodeficiency-virus-hiv-test", "passage_text": "1 This test is usually the first one used to detect infection with HIV. 2  If antibodies to HIV are present (positive), the test is usually repeated to confirm the diagnosis. 3  If ELISA is negative, other tests are not usually needed. 1 If antibodies to HIV are present (positive), the test is usually repeated to confirm the diagnosis. 2  If ELISA is negative, other tests are not usually needed. 3  This test has a low chance of having a false result after the first few weeks that a person is infected. 4  Western blot."}, {"url": "http://www.nhs.uk/Conditions/HIV/Pages/Diagnosispg.aspx", "passage_text": "HIV tests. The most common form of HIV test is a blood test, in which a small amount of blood is taken and tested in a laboratory, the result is usually available within a few days, sometimes on the same day. These tests can provide a reliable result four weeks after exposure to HIV. "}]