[{"url": "http://www.biokids.umich.edu/critters/Amphibia/", "passage_text": "All amphibians are predators on other animals and will often eat any animal that is small enough to be swallowed whole. Most can only eat invertebrates, but some larger amphibians will eat small fish, other amphibians, or even small mammals. All amphibians are cold-blooded, like fish, snakes, lizards, and turtles. Amphibians include frogs, toads (actually a family of frogs), and salamanders. Amphibians are vertebrates, so they have a bony skeleton. Most amphibians live part of their lives underwater and part on land. Amphibians reproduce by laying eggs that do not have a soft skin, not a hard shell."}, {"url": "http://www.froglife.org/info-advice/frogs-and-toads-behaviour/", "passage_text": "Frogs and toads normally overwinter in places like compost heaps, amongst dead wood or under decking/your shed/other objects. Some amphibians, usually frogs and sometimes newts, will choose to overwinter at the bottom of the pond; they bury themselves down in the silt at the bottom and take in oxygen through their skin. "}, {"url": "http://www.dfw.state.or.us/conservationstrategy/frogs.asp", "passage_text": "Cascades frogs have gold eyes and long hind legs. They live in moist mountain meadows and damp bogs and forests. Home is usually a shallow pond, marsh or small stream. Studies indicate that populations are increasingly small, and some populations may be adversely affected by pollution and increasing sunlight levels. Northern Red-legged Frog (Rana aurora). Red-legged frogs like cool damp forests and wetlands. Adults have red underlegs, hence their name. Their decline in the northwest is due, in part, to habitat loss and invasive bullfrogs. Fun fact: It’s unlikely you’ll ever hear a red-legged frog call."}, {"url": "http://exoticpets.about.com/od/frogsandtoads/qt/frogsponds.htm", "passage_text": "How to Attract Frogs. The best way to attract frogs is to find out what kind of habitat your native frogs like and try to recreate that habitat in your yard. You may be able to get information on native frog species from your state or provincial wildlife or natural resources department. However, the best way to share your garden with frogs is to simply build a frog-friendly pond. Re-creating their natural habitat is the best way to attract frogs (toads are good too) and keep them from wandering off in search of more frog-friendly surroundings."}, {"url": "http://www.froglife.org/info-advice/frogs-toads-in-my-garden/", "passage_text": "There is no one who will come and remove toads or other amphibians from you garden. If you wish to exclude any species you will need to look at modifying the habitats in your garden so they are less attractive, although bare in mind this will have impacts on all wildlife. Common Frogs are frequently found in urban areas and gardens are an important amphibian habitat in their own right. If the animal is trapped or in danger – e.g. you’ve found it near a road or in a part of the garden you’re working on – release it into a nearby suitable habitat or another part of the garden."}, {"url": "http://www.wildaboutgardens.org.uk/wildlife/amphibians/toad-common.aspx", "passage_text": "Habitat preference. During the day, common toads tend to take refuge in holes in the ground or other damp areas such as leaf piles or compost heaps. They will use similar areas for hibernation during the winter months. At night they emerge to hunt for food in rough grass, woodland, scrub or other suitable habitats. Tadpoles of the two species are more difficult to distinguish between, but toad tadpoles are generally darker, often black, unlike the brown tadpoles of frogs. Both of these can be distinguished from newt tadpoles by the absence of external feathery gills. Up to 15cm (6in) long, but generally more like 8cm (3in)"}, {"url": "http://surrey-arg.org.uk/SARG/08000-TheAnimals/SARGSpeciesData.asp?Species=Common_Frog", "passage_text": "Habitat. The Common frog can be found in damp habitats in both lowland and upland areas, parkland, meadows, gardens, ponds, marshland, moorland, mountains, woodland and woodland edge habitat. Common frogs can also be found in wet areas of lowland heathland. Common frog, at a pool edge. The Common frog is a native animal to Great Britain. It has smooth, wet skin, long legs, large prominent eyes and ear drums (tympanum). It can be found in damp habitat"}, {"url": "http://zephyrus.co.uk/froghabitat.html", "passage_text": "The area round the pond provides plenty of slugs, flies and other insects for the frog to eat. The foliage round the pond provides shelter and protection from predators and keeps the air moist. The moist air round the pond stops the frog's skin from drying out. The frog's habitat is in or near ponds. The area round the pond provides plenty of slugs, flies and other insects for the frog to eat. The foliage round the pond provides shelter and protection from predators and keeps the air moist. The moist air round the pond stops the frog's skin from drying out. How the frog has adapted to live in water or on the land."}]