[{"url": "http://www.timeanddate.com/calendar/march-equinox.html", "passage_text": "not to scale). Equinoxes and solstices are opposite on either side of the equator, and the March equinox is also known as the spring (vernal) equinox in the northern hemisphere and as the autumnal (fall) equinox in the southern hemisphere. On the equinox, night and day are nearly exactly the same length – 12 hours – all over the world. This is the reason it's called an “equinox”, derived from Latin, meaning equal night. However, in reality equinoxes don't have exactly 12 hours of daylight."}, {"url": "http://www.space.com/20307-spring-season-vernal-equinox.html", "passage_text": "The vernal equinox, which occurs at 7:02 a.m. EDT today (March 20), is probably the most important astronomical event of the year. Although popularly described as  the first day of spring  in the Northern Hemisphere, the annual event is actually much more important than that. The vernal equinox, which marks the first day of the northern Spring season, occurs at 7:02 a.m. EDT on March 20, 2013. Credit: Starry Night Software View full size image."}, {"url": "http://www.timeanddate.com/calendar/march-equinox.html", "passage_text": "10 Facts About the March Equinox. There are two equinoxes every year – in March and September – when the Sun shines directly on the equator and the length of night and day are nearly equal. The Earth during the equinox. On the equinox the Earth's axis is perpendicular to the Sun's rays. On the equinox, night and day are nearly exactly the same length – 12 hours – all over the world. This is the reason it's called an “equinox”, derived from Latin, meaning equal night. However, in reality equinoxes don't have exactly 12 hours of daylight."}, {"url": "https://en.wikipedia.org/wiki/Equinox", "passage_text": "Equinoxes occur twice a year, around 21 March and 23 September. The equinoxes are the only times when the subsolar point (the place on Earth's surface where the center of the Sun is exactly overhead) is on the Equator, and, consequently, the only times when the Sun is at zenith over the Equator. "}, {"url": "http://resources.woodlands-junior.kent.sch.uk/time/equinox.html", "passage_text": "The Spring Equinox. The Spring Equinox is the first day of spring season and occurs when the sun passes the equator moving from the southern to the northern hemisphere. The North Pole begins to lean toward the sun again. Day and night have approximately the same length. Spring Equinox is near 20 March. The Autumn Equinox is the first day of the autumn season and occurs when the sun passes the equator moving from the northern to the southern hemisphere. The North Pole begins to tilt away from the sun. Day and night have approximately the same length. Autumnal equinox is near 22 September."}, {"url": "http://www.infoplease.com/spot/riteofspring1.html", "passage_text": "Equinox Means Equal Night. Translated literally, equinox means equal night.. Because the Sun is positioned above the equator, day and night are about equal in length all over the world during the equinoxes. A second equinox occurs each year on Sept. 22 or 23; in 2015, it will be on Sept. 23 at 4:20 A.M. EDT. This date will mark the autumnal equinox in the Northern Hemisphere and the vernal equinox in the Southern (vernal denotes spring). "}, {"url": "http://earthsky.org/space/how-often-do-we-have-a-march-equinox-solar-eclipse", "passage_text": "The greatest eclipse occurs at 9:46 Universal Time, while the March equinox comes to pass some 13 hours later at 22:45 Universal Time. Supermoon total eclipse of equinox sun on March 20, 2015. After this 2015 equinox eclipse, the next solar eclipse at the March equinox will happen on March 20, 2034. Then there will be two more in this century: 2053 and 2072. Note the spacing of 19 years between these four eclipses of the March equinox sun. "}, {"url": "http://www.windows2universe.org/the_universe/uts/equinox.html", "passage_text": "Equinox literally means equal night. On the vernal (spring) and autumnal (fall) equinoxes, day and night are nearly the same length (the date on which day and night are actually closest to the same length is called the equilux, and occurs a few days towards the winter side of each equinox). "}, {"url": "http://www.answers.com/Q/When_does_the_spring_equinox_occur", "passage_text": "In the Northern Hemisphere, the vernal equinox is the March  equinox, which is the autumnal equinox in the southern hemisphere.  (March 20)   In the Southern Hemisphere, … the vernal (spring) equinox is the  September equinox, which is the autumnal equinox in the northern  hemisphere (Sept 22 or 23). The spring Equinox occurs on April 21 st. The fall Equinox is on September 21 st. The summer Solstice occurs on June 21 st and the winter Solstice occurs on December 21 st. 2 people found this useful."}, {"url": "http://www.answers.com/Q/When_does_the_spring_equinox_occur", "passage_text": "On the Vernal exuinox it is the first day of spring (March 20th) and on an Atumnal equinox its the frist day of fall   The … sun is vertically overhead the Equator, this occurs twice per year, once with the northen hemisphere heading towards the sun, and once with it heading away from the sun. The spring Equinox occurs on April 21 st. The fall Equinox is on September 21 st. The summer Solstice occurs on June 21 st and the winter Solstice occurs on December 21 st. 2 people found this useful."}]