[{"url": "https://en.wikipedia.org/wiki/Diatom", "passage_text": "Diatoms are producers within the food chain. A unique feature of diatom cells is that they are enclosed within a cell wall made of silica (hydrated silicon dioxide) called a frustule. These frustules show a wide diversity in form, but are usually almost bilaterally symmetrical, hence the group name"}, {"url": "http://westerndiatoms.colorado.edu/about/what_are_diatoms", "passage_text": "Nearly all diatoms are microscopic-cells range in size from about 2 microns to about 500 microns (0.5 mm), or about the width of a human hair (note that one micron is equal to 10 -6 meter). Diatoms have been placed in the division Bacilliariophyta, which is distinguished by the presence of an inorganic cell wall composed of hydrated silica. There are an estimated 20,000 to 2 million species of diatom on Earth."}, {"url": "http://www.answers.com/Q/Why_is_it_important_for_a_photosynthetic_organism_such_a_diatom_to_live_near_the_surface_of_a_body_of_water", "passage_text": "they synthesize their own food from the light of the sun. Therefore, they have to live near the water's surface so that the light can reach them for photosynthesis. water is the most important part in an living organism. our body is made up of 70% water and it helps the blood flow regular to our body parts. Every cell in the human body … needs water because many of the body's processes, including chemical reactions, take place in water."}, {"url": "https://en.wikipedia.org/wiki/Diatom", "passage_text": "Diatoms are a major group of algae, and are among the most common types of phytoplankton. Diatoms are unicellular, although they can form colonies in the shape of filaments or ribbons (e.g. Fragilaria), fans (e.g. Meridion), zigzags (e.g. Tabellaria), or stars (e.g. Asterionella). A unique feature of diatom cells is that they are enclosed within a cell wall made of silica (hydrated silicon dioxide) called a frustule."}, {"url": "http://www.answers.com/Q/Why_is_it_important_for_a_photosynthetic_organism_such_a_diatom_to_live_near_the_surface_of_a_body_of_water", "passage_text": "Not all marine organisms do live near the surface of the ocean, but those marine organisms that are producers (those that photosynthesise) do and they do so because to photosy … nthesise they need to live in the surface layers where sunlight can penetrate because at depth the oceans are dark. water is the most important part in an living organism. our body is made up of 70% water and it helps the blood flow regular to our body parts. Every cell in the human body … needs water because many of the body's processes, including chemical reactions, take place in water."}, {"url": "http://www.microbeworld.org/types-of-microbes/protista/diatoms", "passage_text": "Because they depend on sunlight for photosynthesis, diatoms generally live in the upper 200 meters of oceans and bodies of fresh water. Some species of diatoms simply float in the water currents near the surface. Others attach themselves to larger floating objects or to the sea floor. "}, {"url": "http://www.answers.com/Q/Why_is_it_important_for_diatoms_to_live_near_the_surface", "passage_text": "Diatoms are a major group of eukaryotic algae, and are one of the most common types of phytoplankton. Diatoms occur in virtually every environment that contains water. This in … cludes not only oceans, seas, lakes and streams, but also soil. 2 people found this useful. Diatoms refers to the groups of algae. The diatoms are very  important because they are used to point out water pollution  because of their ability to uptake and combine the … inorganic and  organic impurities. Answered. In Uncategorized."}, {"url": "http://westerndiatoms.colorado.edu/about/what_are_diatoms", "passage_text": "Diatoms are algae with distinctive, transparent cell walls made of silicon dioxide hydrated with a small amount of water (Si02 + H20). Silica is the main component of glass and hydrated silica is very like the mineral opal, making these algae, often called algae in glass houses more like algae in opal houses. Diatoms have been placed in the division Bacilliariophyta, which is distinguished by the presence of an inorganic cell wall composed of hydrated silica. There are an estimated 20,000 to 2 million species of diatom on Earth."}, {"url": "http://www.answers.com/Q/Why_is_it_important_for_a_photosynthetic_organism_such_a_diatom_to_live_near_the_surface_of_a_body_of_water", "passage_text": "Food and protection. The food of an alligator consists of fish and small animals that live near the water. Also the camouflage of the alligator is water related. found this useful. Rosa Zumaya. Edit. Share to: 1  Tips for Protecting Your Garden From Japanese Beetles Japanese beetles are one of a gardener's worst enemies. water is the most important part in an living organism. our body is made up of 70% water and it helps the blood flow regular to our body parts. Every cell in the human body … needs water because many of the body's processes, including chemical reactions, take place in water."}]