[{"url": "http://www.mnwest.edu/campuses/granite-falls/", "passage_text": "While in Granite Falls, you will have the opportunity to experience fine shopping and excellent customer service in either our quaint downtown, located on the West bank of the Minnesota River, or along Highway 212. Minnesota West-Granite Falls addresses the needs of the workforce and community by providing many online, technical, and liberal art courses. Whether you want to complete a few courses to transfer or earn a degree, the Granite Falls campus offers a variety of educational options."}, {"url": "http://www.mnwest.edu/", "passage_text": "Learn with Purpose! Minnesota West is a great place to start or continue your college education. We have campus locations in Canby, Granite Falls, Jackson, Pipestone, and Worthington and learning center locations in Luverne, Marshall and Redwood Falls. Take a video tour for more information about our programs and campuses"}, {"url": "http://www.city-data.com/city/Granite-Falls-Minnesota.html", "passage_text": "Granite Falls-area historical tornado activity is near Minnesota state average. It is 9% greater than the overall U.S. average. On 7/25/2000, a category F4 (max. wind speeds 207-260 mph) tornado 0.7 miles away from the Granite Falls city center killed one person and injured 15 people and caused $20 million in damages. Other colleges/universities with over 2000 students near Granite Falls: 1  Southwest Minnesota State University (about 27 miles; Marshall, MN; Full-time enrollment: 3,711)."}, {"url": "http://www.granitefallsenergy.com/", "passage_text": "Granite Falls Energy, LLC is located approximately three miles east of Granite Falls, MN in Chippewa County at the junction of Highways 212 and 23. GFE is a Minnesota Limited Liability Company (LLC) comprised of over 900 investors. Scale/Loading Hours: Monday thru Friday 7:30 am to 4:00 pm Business Office Hours: Monday thru Friday 8:00 am to 5:00 pm Granite Falls Energy, LLC 15045 Hwy 23 SE, PO Box 216 Granite Falls, MN 56241 (320) 564-3100 e-mail: Granite Falls Energy."}, {"url": "http://www.prairiesedgecasino.com/", "passage_text": "Prairies Edge Casino Resort; proudly owned & operated by the Upper Sioux Community, is located three miles south of Granite Falls on Highway 23 and offers everything you need for the ideal getaway. "}, {"url": "https://en.wikipedia.org/wiki/Granite_Falls,_Minnesota", "passage_text": "Granite Falls is a city in Chippewa, Renville and Yellow Medicine counties in the State of Minnesota. The population was 2,897 at the 2010 census. It is the county seat of Yellow Medicine County. The Andrew John Volstead House, a National Historic Landmark, is located in Granite Falls. The city was named for deposits of granite rock in the area. A post office has been in operation at Granite Falls since 1870. Granite Falls was incorporated as a city in 1889."}, {"url": "http://www.city-data.com/city/Granite-Falls-Minnesota.html", "passage_text": "Latest news from Granite Falls, MN collected exclusively by city-data.com from local newspapers, TV, and radio stations. Ancestries: Norwegian (30.5%), German (28.8%), Irish (5.1%), Swedish (4.6%), United States (4.3%), English (3.5%). Current Local Time: CST time zone. Elevation: 920 feet. Land area: 3.45 square miles. Other colleges/universities with over 2000 students near Granite Falls: 1  Southwest Minnesota State University (about 27 miles; Marshall, MN; Full-time enrollment: 3,711)."}, {"url": "http://www.mnwest.edu/campuses/granite-falls/", "passage_text": "The Granite Falls Campus of Minnesota West prides itself on a quality education with accessibility for many different types of students. Minnesota West is a leader in Renewable Energy and Computerized Manufacturing in the upper Midwest. Minnesota West-Granite Falls addresses the needs of the workforce and community by providing many online, technical, and liberal art courses. Whether you want to complete a few courses to transfer or earn a degree, the Granite Falls campus offers a variety of educational options."}]