[{"url": "http://cooking.stackexchange.com/questions/47748/what-is-the-difference-between-chickpeas-and-garbanzo-beans", "passage_text": "They're the same thing. About the only difference is that garbanzo bean is less common in British English than in American English, and chickpea is more common either way, but it's just a language thing. There are indeed different varieties, with some smaller and some larger, but they don't have common language names like that. Most of what we see in North America are the larger variety which is used more in certain cooking applications. The names chickpea and garbanzo are the same and interchangeable, with Garbanzo being the Spanish name. There are also several other names that would be interchangeable depending on where you are."}, {"url": "http://www.differencebetween.net/object/comparisons-of-food-items/processed-foods/difference-between-garbanzo-beans-and-chickpeas/", "passage_text": "Though referring to the same species, “chickpea” is often the common name used for English-speaking people while “garbanzo” is used by Spanish-speaking people. In a nation with both languages present, the names might be used interchangeably. Two types of garbanzo beans or chickpeas are known, the Kabuli and the Desi. Aside from preparations, another difference between the two is that the dried beans have hulls that need to be removed before using while the canned beans have their hulls removed in the factory. Summary: 1.Garbanzo beans and chickpeas are the same thing. They are both common names for a plant specie named Cicer arietinum. Because they are the same plant and entity, they share the same scientific classification, uses, types, and other identifying characteristics"}, {"url": "http://www.differencebetween.net/object/comparisons-of-food-items/processed-foods/difference-between-garbanzo-beans-and-chickpeas/", "passage_text": "Garbanzo Beans vs Chickpeas. Garbanzo beans and chickpeas are the same plant, or specifically, the same legume. Like many plants, garbanzo beans and chickpeas are just one of the various names and layman’s terms of the Cicer arietinum. Aside from preparations, another difference between the two is that the dried beans have hulls that need to be removed before using while the canned beans have their hulls removed in the factory. Summary: 1.Garbanzo beans and chickpeas are the same thing. They are both common names for a plant specie named Cicer arietinum. Because they are the same plant and entity, they share the same scientific classification, uses, types, and other identifying characteristics"}, {"url": "https://www.experts123.com/q/what-is-the-difference-between-garbanzo-beans-and-chickpeas.html", "passage_text": "Ah, that's an easy one. There is no difference. Chickpeas and garbanzo beans are the same thing. They're also called cece or ceci in Italy, kichererbse in Germany, and revithia in Greece. And they're as versatile as they are healthful. The beige or cream-colored, round, irregularly shaped chickpeas are beans, similar to kidney beans, pinto beans, black beans black-eyed peas and split peas. In the 2005 Dietary Guidelines, you can count these legumes in either the vegetable or in the meat and beans group."}, {"url": "http://www.differencebetween.com/difference-between-garbanzo-beans-and-vs-chickpeas/", "passage_text": "Desi chana, when split and cooked, is eaten as chana dal, and is a common dish to be eaten as curry with rice. Garbanzo beans are known all over the world for their rich fiber content, and its ability to be a staple food for those afflicted with blood sugar. These beans were grown by Romans, Greeks, and Egyptians because of their taste and health benefits. Summary. There is no difference between what are called Garbanzo beans or chickpeas and the only difference lies in their names depending upon their country of production. In Spain, people call it garbanzo while, in UK and nearby countries, it is called chickpea"}, {"url": "https://en.wikipedia.org/wiki/Chickpea", "passage_text": "The chickpea or chick pea (Cicer arietinum) is a legume of the family Fabaceae, subfamily Faboideae. It is also known as gram, or Bengal gram, garbanzo or garbanzo bean, and sometimes known as Egyptian pea, ceci, cece or chana, or Kabuli chana (particularly in northern India). Its seeds are high in protein. It is one of the earliest cultivated legumes: 7,500-year-old remains have been found in the Middle East. Hummus is the Arabic word for chickpeas, which are often cooked and ground into a paste and mixed with tahini (sesame seed paste), the blend called hummus bi tahini, or chickpeas are roasted, spiced, and eaten as a snack, such as leblebi."}, {"url": "http://www.ochef.com/323.htm", "passage_text": "Is there any difference between chick peas and garbanzo beans? No, chick pea is the garbanzo bean's nom de cuisine  or is it the other way around? "}, {"url": "http://cooking.stackexchange.com/questions/47748/what-is-the-difference-between-chickpeas-and-garbanzo-beans", "passage_text": "Almost everywhere on the internet I see that garbanzo beans and chickpeas are the same thing. Here on Seasoned Advice I also see that the tag chickpeas comes up when you type garbanzo. Most of what we see in North America are the larger variety which is used more in certain cooking applications. The names chickpea and garbanzo are the same and interchangeable, with Garbanzo being the Spanish name. There are also several other names that would be interchangeable depending on where you are."}]