[{"url": "http://www.meaning-of-names.com/irish-names/hughes.asp", "passage_text": "Meaning of Hughes. Irish name. In Irish, the name Hughes means-surname.The name Hughes originated as an Irish name. The name Hughes is most often used as a boy name or male name. Irish Name Meaning-surname. Origin-Ireland. Global Star Registery-Name a star after someone special!"}, {"url": "https://en.wikipedia.org/wiki/Hughes_(surname)", "passage_text": "Hughes /hjuːz/ is a patronymic surname of Welsh and Irish origin. It is also the etymologically unrelated Picard variant of the Germanic name Hugh. Hughes is the 15th most common name in the northern Irish province of Ulster, being especially common in the Ulster counties Armagh, Tyrone, Monaghan, and Fermanagh. It was the 34th most common name in Matheson's 1890 census of Ireland and the 44th most common surname in Ireland in the 1992-1997 period"}, {"url": "http://www.sheknows.com/baby-names/name/hughes", "passage_text": "Irish Meaning: The name Hughes is an Irish baby name. In Irish the meaning of the name Hughes is: Surname. SoulUrge Number: 8. Expression Number: 5. People with this name have a deep inner desire to lead, organize, supervise, and to achieve status, power and wealth."}, {"url": "http://www.thinkbabynames.com/meaning/1/Hughes", "passage_text": "Hughes /hugh-es/ [1 syll.] as a boys' name is of Old German derivation, and the meaning of the name Hughes is soul, mind, intellect. Hughes is an alternate spelling of Hugh (Old German). Hughs is a conventional last name. Kreatif forms: Highes, Hoghes, Hughesce. Hughes is an uncommonly occurring given name for males but a very prominent last name for all people (#83 out of 150436, Top 1%). (2000 U.S. Census). Popular variation forms of Hughes (not ranked) are Hugo (#438 the previous year) , Hugh (#869) , Huey and Hughie."}, {"url": "http://www.surnamedb.com/Surname/Hughes", "passage_text": "This interesting name derives from the Olde French personal name Hu(gh)e introduced by the Normans after 1066. This name is in origin a short form of any of the various Germanic compound names with the first element hug heart or mind. The first recorded spelling of the family name is shown to be that of Thomas Hughes, which was dated 1327, Pipe Rolls of Somerset, during the reign of King Edward 111, The Father of the Navy, 1327 - 1377. Surnames became necessary when governments introduced personal taxation."}, {"url": "http://genealogy.about.com/od/surname_meaning/p/hughes.htm", "passage_text": "HUGHES Surname Meaning & Origin: 1) A patronymic surname meaning son of Hugh.. The given name Hugh is a Germanic name meaning heart/mind, often after Saint Hugh. 2) Possibly a modern form of the ancient Irish name O'HAY.. Hughes is the 83rd most popular surname in the United States. Hughes is even more popular in England, coming in as the 18th most common surname."}, {"url": "https://en.wikipedia.org/wiki/Hughes_(surname)", "passage_text": "Aodh was frequently Anglicized as Hugh, with O hAodha haodha in turn being anglicized As hughes Or. Hayes hughes is the 15th most common name in the Northern irish province Of, ulster being especially common in The ulster Counties, Armagh, Tyrone, monaghan And. fermanagh Hughes is the 15th most common name in the northern Irish province of Ulster, being especially common in the Ulster counties Armagh, Tyrone, Monaghan, and Fermanagh. It was the 34th most common name in Matheson's 1890 census of Ireland and the 44th most common surname in Ireland in the 1992-1997 period."}]