[{"url": "http://www.gardenguides.com/130374-pink-jasmine.html", "passage_text": "Characteristics. The pink jasmine plant is a woody evergreen vine that grows to a length of 20 feet if properly cared for and given a support structure. It is possible to train a pink jasmine plant into a bushy shrub through pruning. Problems. Use caution when watering the pink jasmine with rainwater as the plant will yellow if the acidity is too high. Excess lime in water causes leaf spots on the plant. Use distilled water if you have problems with the water available."}, {"url": "http://homeguides.sfgate.com/growing-tips-pink-jasmine-72682.html", "passage_text": "Pink jasmine will look its best if you give it the care it needs. Also known as winter jasmine or French perfume, pink jasmine (Jasminum polyanthum) is a sprawling evergreen plant grown for its extraordinarily fragrant blooms, which appear from pretty pink buds. Culture. Pink jasmine is not a diva about soil and will grow happily in an average, moderately fertile garden soil that is well-draining. Space jasmines at least 8 feet apart. Crowded jasmine vines in areas with poor air circulation are more prone to fungal diseases, especially if watered from overhead."}, {"url": "https://en.wikipedia.org/wiki/Jasminum_polyanthum", "passage_text": "Jasminum polyanthum, also known as Pink Jasmine (or White Jasmine), is an evergreen twining climber native to China and Burma (Myanmar). It produces an abundance of reddish-pink flower buds in late winter and early spring, followed by fragrant five-petalled star-like white flowers which are about 2 cm in diameter. It has compound leaves with 5 to 7 leaflets which are dark green on the upper surface and a lighter green on the lower surface."}, {"url": "http://www.florafinder.com/Species/Jasminum_polyanthum.php", "passage_text": "About plant names... Native to southeastern China, pink jasmine has become naturalized in Australia and New Zealand, where in some areas it is considered an invasive species. It is not found in the wild in North America, though it is popular with gardeners. Identification: Plants produce twining vines that can reach 20' (6.1 m). "}, {"url": "http://www.gardenguides.com/80528-grow-pink-jasmine.html", "passage_text": "Overview. Pink jasmine is an evergreen vine that produces pink-white fragrant flowers. The flowers bloom in the late winter through early spring and occasionally at other times of the year. Pink jasmine, Jasminum polyanthum, is also know as winter jasmine or Chinese evergreen jasmine as it is native to China. The woody trailer vine will climb up to 20 feet in height, if given support. You can also train pink jasmine into a bushy shrub, with proper care and pruning."}, {"url": "http://homeguides.sfgate.com/plant-jasmine-shade-sun-48566.html", "passage_text": "Winter jasmine has a weeping or arching form when grown as a shrub. It is a deciduous plant, growing 6 to 10 feet tall in USDA zones 6 through 9. Winter jasmine likes full sun in colder regions of the country. Italian jasmine is hardy in USDA zones 8 through 11 and grows to about 15 feet. Carolina jessamine and star jasmine grow well in sun to part shade, while Asian jasmine is the preferred ground cover jasmine for planting under trees or on the north side of buildings. Although Asian jasmine is used primarily as a ground cover for shade, it also grows well in sun and part shade."}, {"url": "http://www.gardenguides.com/130374-pink-jasmine.html", "passage_text": "Plant the pink jasmine in a hole that is slightly larger than the root ball. Add organic compost to the bottom of a garden bed hole and set the plant on top so the top of the root ball is at ground level. Mix even quantities of organic compost into the removed soil and pack it around the pink jasmine root ball. Problems. Use caution when watering the pink jasmine with rainwater as the plant will yellow if the acidity is too high. Excess lime in water causes leaf spots on the plant. Use distilled water if you have problems with the water available."}, {"url": "http://www.desert-tropicals.com/Plants/Oleaceae/Jasminum_polyanthum.html", "passage_text": "The buds are pink, hence the name Pink Jasmine. The flowers are white and very fragrant. Their scent is not quite as enjoyable as other jasmines like Angelwing Jasmine, or Arabian Jasmine, but it is a nice complement since it blooms so much earlier. "}, {"url": "http://www.gardenguides.com/130374-pink-jasmine.html", "passage_text": "Pink jasmine, also called Arabian jasmine, is a tropical vine plant that grows best as a houseplant in most growing zones. Problems. Use caution when watering the pink jasmine with rainwater as the plant will yellow if the acidity is too high. Excess lime in water causes leaf spots on the plant. Use distilled water if you have problems with the water available."}]