[{"url": "http://www.wisegeek.org/what-is-the-nutrition-information-for-items-in-the-costco-food-court.htm", "passage_text": "There's no way that a slice of costco pizza is 700-800 calories (if this were true then other places would have slices over 1000 calories because costco pizza has hardly any grease/oil) The costco pizza comes in 10 pieces, so 1/6 of the pizza is not a slice...it would be 5/3 i.e. 1 and 2/3 slices."}, {"url": "http://www.livestrong.com/article/309975-calories-in-costco-food-court-items/", "passage_text": "Costco offers three different types of pizza; pepperoni contains 620 calories, the combo variety has 680 calories, and cheese pizza boasts 700 calories, says CalorieKing.com. Hot dogs, both Hebrew National and Polish, contain 550 calories per serving and the Turkey Wrap has 810 calories."}, {"url": "http://addictedtocostco.com/2008/03/02/how-many-calories-in-a-slice-of-costco-pizza/", "passage_text": "Now, if we just want an upper limit for the number of calories, we can easily calculate it because the highest density of calories within any food ingredient is 9 calories/gram. (Note that I’m using food calories .) So my 155 grams per slice means that there are no more than 1395 calories per slice of pizza. Before you panic and swear off Costco pizza, remember this is only an upper limit, a piece could have much less. And indeed, we’ll see with further analysis that it very, very likely does."}, {"url": "http://addictedtocostco.com/2008/06/03/calories-in-16-costco-pizzas/", "passage_text": "No, not really. All of the pizzas have less than 400 calories per slice, with the Cheese pizza the highest in calories (360 calories) and the Combo (270 calories) and Hawaiian (300 calories) having the least."}, {"url": "http://www.wisegeek.org/what-is-the-nutrition-information-for-items-in-the-costco-food-court.htm", "passage_text": "The calorie count for a Costco pizza is based on a serving (2 slices) not per slice. A serving is 1/6 of a whole pizza. Also, I posted previously that a serving of Costco combo pizza has 680 calories."}, {"url": "http://addictedtocostco.com/2008/03/02/how-many-calories-in-a-slice-of-costco-pizza/", "passage_text": "To get a better number, I assumed my Costco pizza was composed of a few major components: dough, tomato sauce, cheese, and a number of 3″ diameter pieces of pepperoni. I then measured the relative weight of each of these components in a single slice and looked up calorie counts for each."}, {"url": "http://addictedtocostco.com/2008/03/02/how-many-calories-in-a-slice-of-costco-pizza/", "passage_text": "This puts our total at only 318 calories for a single serving (one slice, 155 g) of Costco pepperoni pizza! It should be noted that the calorie densities used to arrive at this number are for products that may be different than what Costco uses."}]