[{"url": "https://en.wikipedia.org/wiki/P%C4%81keh%C4%81", "passage_text": "When the word was first adopted, the usual plural in English was Pakehas. However New Zealand English speakers are increasingly removing the terminal s and treating Pākehā as a collective noun. Opinions of the term vary amongst New Zealanders. Papa'a has a similar meaning in Cook Islands Māori. Its etymology is unclear, but the term was in use by the late 18th century, and in December 1814, the Māori children at Rangihoua in the Bay Of Islands were no less eager to see the packaha than the grown folks."}, {"url": "http://www.definitions.net/definition/pakeha", "passage_text": "Pākehā. Pākehā is a Māori language term for New Zealanders who are of European descent. Others refuse the aforementioned appellation of the word, and use Pākehā to either refer to any fair-skinned person, or to any non-Polynesian New Zealanders. Papa'a has a similar meaning in Cook Islands Māori. Its etymology is unclear, but the term was in use by the late 18th century."}, {"url": "http://www.wisegeek.org/what-is-the-difference-between-literally-and-figuratively.htm", "passage_text": "Confusion sometimes arises when the term literally is used as hyperbole, to exaggerate what is being said beyond its literal meaning. Although some people consider this usage of literally to be incorrect, this definition does appear in major dictionaries. Figures of Speech. When a person says something that is not meant to be taken literally — or meaning exactly what the words say — the phrase is being used figuratively. For example, a boy might say, When I heard the ice cream truck outside, I flew out the front door and out to the street.."}, {"url": "http://www.collinsdictionary.com/dictionary/english/literally", "passage_text": "USAGE The use of literally as an intensifier is common, esp in informal contexts. In some cases, it provides emphasis without adding to the meaning: the house was literally only five minutes walk away. Often, however, its use results in absurdity: the news was literally an eye-opener to me. "}, {"url": "http://www.salon.com/2013/08/22/according_to_the_dictionary_literally_now_also_means_figuratively_newscred/", "passage_text": "Much has been made of the use, misuse and overuse of the word “literally.”. Literally, of course, means something that is actually true: “Literally every pair of shoes I own was ruined when my apartment flooded.”. When we use words not in their normal literal meaning but in a way that makes a description more impressive or interesting, the correct word, of course, is “figuratively.”. Thanks in part to the overuse of literally, Merriam-Webster says the word can now mean its exact opposite."}, {"url": "http://www.oxforddictionaries.com/definition/english/literally", "passage_text": "Usage. In its standard use literally means ‘in a literal sense, as opposed to a non-literal or exaggerated sense’, as for example in I told him I never wanted to see him again, but I didn’t expect him to take it literally. "}, {"url": "http://www.wisegeek.org/what-is-the-difference-between-literally-and-figuratively.htm", "passage_text": "When a person says something that is not meant to be taken literally — or meaning exactly what the words say — the phrase is being used figuratively. Figures of Speech. When a person says something that is not meant to be taken literally — or meaning exactly what the words say — the phrase is being used figuratively. For example, a boy might say, When I heard the ice cream truck outside, I flew out the front door and out to the street.."}, {"url": "https://en.wikipedia.org/wiki/P%C4%81keh%C4%81", "passage_text": "Pākehā is a Māori language term for New Zealanders who are of European descent. Recently, the word has been used to refer inclusively either to fair-skinned persons or any non-Māori New Zealander. Papa'a has a similar meaning in Cook Islands Māori. Its etymology is unclear, but the term was in use by the late 18th century, and in December 1814, the Māori children at Rangihoua in the Bay Of Islands were no less eager to see the packaha than the grown folks."}, {"url": "http://www.wisegeek.org/what-is-the-difference-between-literally-and-figuratively.htm", "passage_text": "The term literally, however, also can be used as hyperbole to mean the same as figuratively.. By its main definition, literally means that an expression or phrase is not exaggerated or embellished — it means exactly what the words suggest. Figures of Speech. When a person says something that is not meant to be taken literally — or meaning exactly what the words say — the phrase is being used figuratively. For example, a boy might say, When I heard the ice cream truck outside, I flew out the front door and out to the street.."}]