[{"url": "http://www.md-health.com/Types-Of-Bacteria.html", "passage_text": "Harmful Bacteria. Some of the harmful types of bacteria are those which can cause disease or adversely affect one's health, and these include: Mycobacteria, which are rod-shaped, and neither Gram-positive nor Gram-negative microorganisms that can cause infections of the lungs, skin and other parts of the body. The most common diseases associated with these bacteria are leprosyand tuberculosis."}, {"url": "http://familydoctor.org/familydoctor/en/diseases-conditions/pneumonia.html", "passage_text": "From the alveoli, oxygen goes into your blood while carbon dioxide moves out of your blood. When you have pneumonia, your alveoli get inflamed (irritated and swollen) and fill with fluid. This makes it difficult for you to breathe. Pneumonia is usually caused by bacteria or a virus. There are 4 types of pneumonia: 1  Community-acquired pneumonia is the most common type of pneumonia. 2  You can catch it in public areas (such as work, school, the grocery store or the gym). 3  Bacteria, a virus, fungi or irritants in the air can cause community-acquired pneumonia"}, {"url": "http://www.nhlbi.nih.gov/health/health-topics/topics/pnu/causes", "passage_text": "Many types of bacteria can cause pneumonia. Bacterial pneumonia can occur on its own or develop after you've had a cold or the flu. This type of pneumonia often affects one lobe, or area, of a lung. When this happens, the condition is called lobar pneumonia. Many germs can cause pneumonia. Examples include different kinds of bacteria, viruses, and, less often, fungi. Most of the time, the body filters germs out of the air that we breathe to protect the lungs from infection."}, {"url": "http://www.cdc.gov/pneumococcal/about/infection-types.html", "passage_text": "Pneumococcus is the most common cause of bloodstream infections, pneumonia, meningitis, and middle ear infections in young children. You have probably heard of pneumonia, which is an infection of the lungs. Pneumonia can be caused by many different bacteria, viruses, and even fungi. Pneumococcus is one of the most common causes of severe pneumonia. Besides pneumonia, pneumococcus can cause other types of infections too, such as: 1  Ear infections. 2  Sinus infections."}, {"url": "http://www.healthline.com/health/pneumonia", "passage_text": "Pneumonia is an infection in one or both lungs. The infection may be caused by fungi, bacteria, or viruses. Pneumonia causes inflammation in your lung’s air sacs, also referred to as alveoli. The alveoli fill with fluid or pus, making it difficult to breathe. Symptoms of pneumonia can range from mild to life threatening. In fact, pneumonia causes more deaths worldwide than any other illness."}, {"url": "http://www.hopkinsmedicine.org/healthlibrary/conditions/respiratory_disorders/pneumonia_85,P01321/", "passage_text": "Pneumonia is an infection of one or both of the lungs. It's caused by bacteria, viruses, fungi, or chemical irritants. Pneumonia is a serious infection or inflammation in which the air sacs fill with pus and other liquid. Lobar pneumonia affects one or more sections (lobes) of the lungs. This type is caused by various bacteria, the most common of which is streptococcus pneumoniae (pneumococcus). It usually occurs when the body is weakened in some way, such as by illness, malnutrition, old age, or impaired immunity, and the bacteria are able to work their way into"}, {"url": "http://www.hopkinsmedicine.org/healthlibrary/conditions/respiratory_disorders/pneumonia_85,P01321/", "passage_text": "Bacterial pneumonia. This type is caused by various bacteria, the most common of which is streptococcus pneumoniae (pneumococcus). It usually occurs when the body is weakened in some way, such as by illness, malnutrition, old age, or impaired immunity, and the bacteria are able to work their way into the lungs."}, {"url": "http://www.nhs.uk/conditions/Staphylococcal-infections/Pages/Introduction.aspx", "passage_text": "Staphylococcal infections are a group of infections caused by the bacterium Staphylococcus. You may have heard them referred to as staph infections. Staph bacteria can cause a wide range of infections, from relatively minor skin infections such as boils, to more serious infections of the blood, lungs and heart. There are many types of Staphylococci, but most infections are caused by a group called Staphylococcus aureus. "}, {"url": "http://www.md-health.com/Types-Of-Bacteria.html", "passage_text": "2. Some of the harmful types of bacteria are those which can cause disease or adversely affect one's health, and these include: Mycobacteria, which are rod-shaped, and neither Gram-positive nor Gram-negative microorganisms that can cause infections of the lungs, skin and other parts of the body. The most common diseases associated with these bacteria are leprosyand tuberculosis."}]