[{"url": "http://www.crayfishman.com/cooking.html", "passage_text": "Boil crayfish in salted water using only about 1/4 to 1/3 the salt you would've used for straight salted crayfish. Place a layer of the still hot crayfish about 2-3 deep in the bottom of a clean Coleman-type plastic cooler, making sure the plug is in. Sprinkle some cajun seasoning on top."}, {"url": "http://www.crayfishman.com/cooking.html", "passage_text": "Bring a pot (2 - 3 gallons) of water to a boil. Stir in one pound of non-iodized salt and return to boil. This may seem like an excessive amount of salt, but crayfish are not in the water very long and it's not easy for the salt/seasoning to seep around the shell into the meat.Boil crayfish for 3 or 4 minutes."}, {"url": "http://whatscookingamerica.net/Seafood/CrawfishBoil.htm", "passage_text": "Maintain a boil and cook 10 minutes or until potatoes are tender. Add crawfish to the wire basket, stirring them a bit. Once the water starts a rolling boil again, boil 5 minutes. Regulate the burner so the rolling boil is maintained, but where the pot does not boil over."}, {"url": "http://www.foodnetwork.com/recipes/crawfish-boil-recipe-for-40-to-45-pounds-of-crawfish-recipe.html", "passage_text": "Bring to a boil and cook the crawfish for 15 minutes. Turn the heat off and allow the crawfish to simmer in the liquid for an additional 15 minutes. Remove the crawfish and serve with the potatoes and corn. Traditionally, the crawfish is dumped onto a newspaper covered table (we used a door on 2 sawhorses)."}, {"url": "http://www.crayfishman.com/cooking.html", "passage_text": "If you are going to cook more than one pot of crayfish you will need a pot with a strainer basket to hold your crayfish. Crayfish can be cooked on a kitchen stove, but it's easier if you have one of the outdoor gas cookers. These units can bring a big pot of water to boil in a hurry. They can be purchased at many large department or building supply stores for under $50.00."}, {"url": "http://www.answers.com/Q/How_long_does_it_take_to_boil_crawfish", "passage_text": "Bring to boil. Stir crawfish into boiling water, boil for 5-10 minutes, add your frozen corn, sausage and fresh red potatoes, let soak for 25-30 minutes."}, {"url": "http://www.foodnetwork.com/recipes/crawfish-boil-recipe-for-40-to-45-pounds-of-crawfish-recipe.html", "passage_text": "Add the 2 sticks of butter and 2/3 of the bag of Crawfish Crab and Shrimp Boil, and the 5 pounds of red potatoes. Cover and bring to a boil. Cook potatoes for 15 minutes and, while the potatoes are cooking, rinse the crawfish. Place the bag of crawfish in 1 of the coolers, or, on the ground and hose down the bag until the water runs clear, about 5 minutes. Open the bag and pour the live crawfish into 1 of the coolers."}]