[{"url": "http://learn.org/articles/What_is_the_Average_Salary_for_a_Family_Lawyer.html", "passage_text": "Family Lawyer Earnings. An average salary figure for family lawyers isn't readily available. However, the U.S. Bureau of Labor Statistics reported in May 2013 that the average salary for all lawyers was $131,990. Pay for lawyers can vary according to location and the type of employer. "}, {"url": "http://money.usnews.com/careers/best-jobs/lawyer/salary", "passage_text": "Average Lawyer Pay vs. Other Best Jobs. Lawyers earned an average annual salary of $131,990 in 2013, which is substantially more than any other occupation on our list of Best Social Service Jobs. In 2013, paralegals earned an average annual salary of $51,170. Other jobs that also earn less than half of what lawyers make include patrol officers ($58,720), high school teachers ($58,260) and school counselors ($56,160)"}, {"url": "http://work.chron.com/average-salary-criminal-lawyers-11800.html", "passage_text": "Public defenders tend to make slightly more than prosecutors, according to the NALP. As of 2012, starting public defenders reported a median salary of $50,500 per year, while those with five years of experience reported salaries of $62,800 and those with between 11 and 15 years earned a median of $78,600. According to the Bureau of Labor Statistics, lawyers employed by the federal government tend to earn the highest salaries of any public attorneys, an average of $129,430 per year. By comparison, state attorneys averaged $81,960 and local government attorneys $93,07"}, {"url": "http://learn.org/articles/What_is_the_Average_Salary_for_an_Immigration_Lawyer.html", "passage_text": "Median Salary for Immigration Lawyers. PayScale.com reported that the median yearly salary for lawyers practicing immigration law was $60,837, according to a January 2014 report. Other factors like location, experience and employer could influence your salary as an immigration lawyer. The following figures are the salary ranges for immigration lawyers with various years of work experience, as reported by PayScale.com in January 2014: 1  1-4 years: $37,788-$80,537. 2  5-9 years: $48,479-$88,319. 3  10-19 years: $73,000-$141,000."}, {"url": "http://www.indeed.com/salary/q-Attorney-l-Miami,-FL.html", "passage_text": "Average Attorney salaries for job postings in Miami, FL are 5% lower than average Attorney salaries for job postings nationwide. "}, {"url": "http://www.abajournal.com/magazine/article/what_americas_lawyers_earn", "passage_text": "This map shows a range of mean (average) lawyer salaries for virtually every market in the United States. The statistics underlying the map represent the latest data available from the Bureau of Labor Statistics in its May 2009 Occupational Employment Statistics survey. Note: Alaska's average lawyer salary is $104,970. "}, {"url": "http://www.payscale.com/research/US/Job=Attorney_%2f_Lawyer/Salary", "passage_text": "Attorney / Lawyer Salary. (United States). The average pay for an Attorney / Lawyer is $77,252 per year. Experience has a moderate effect on salary for this job. People in this job generally don't have more than 20 years' experience. Skills that are associated with high pay for this job are Intellectual Property (IP), Regulatory Compliance, Complex Litigation Case Management, Leadership, and Contract Negotiation."}, {"url": "http://www.bls.gov/ooh/Legal/Lawyers.htm", "passage_text": "The median annual wage for lawyers was $113,530 in May 2012. The median wage is the wage at which half the workers in an occupation earned more than that amount and half earned less. The lowest 10 percent earned less than $54,310, and the top 10 percent earned more than $187,200. "}, {"url": "http://www1.salary.com/Attorney-I-salary.html", "passage_text": "For example the median expected annual pay for a typical Attorney I in the United States is $84,531, so 50% of the people who perform the job of Attorney I in the United States are expected to make less than $84,531. Source: HR Reported data as of October 2015. 1  Salary. 2  Salary + Bonus. 3  Benefits. "}]