[{"url": "http://everlastroofing.com/pbr-panel/", "passage_text": "Multiple Applications. The Everlast PBR Panel is designed for both roofing and siding applicatiions. This panel is excellent for most any exterior use, including industrial, commercial, and agricultural applications. The PBR Panel can also be used as an interior liner panel. The PBR Panel provides optimum strength, which is ideal for maximum spanning capabilities and the weather-tight side lap allows for applications on roof pitches as low as 1:12. The PBR Panel is manufactured in painted and unpainted Galvalume in both 24 and 26 gauge steel."}, {"url": "http://www.starbuildings.com/products/desc-wall-pbr.html", "passage_text": "The PBR panel's deep ribs create an even-shadowed appearance. The area between the major ribs is reinforced with minor ribs. PBR is one of the most economical panel systems and can be used for both roof and wall applications. "}, {"url": "http://www.mbci.com/products/roof/exposed-fastening-roof-panels/pbr/", "passage_text": "The PBR panel is commonly used for a wide variety of architectural, agricultural, commercial and industrial applications. PBR is a structural panel and an exposed fastener panel that can be used for both roof and wall applications. The minimum roof slope for PBR is ½:12. "}, {"url": "http://www.metalsales.us.com/agricultural/products/metal-roofing-panel/pbr-panel", "passage_text": "Optional Gauge(s): 22 ga. PBR panels are versatile panels. They are used in a wide variety of applications and are suited for open framing support conditions, as well as a solid substrate. Available Substrate(s): Open Framing Solid Substrate."}, {"url": "http://www.ascbp.com/commercial/prodDetailPBR.html?id=207", "passage_text": "26 gauge PBR panel is available in a wide variety of standard colors with the Dura Tech nt Cool Color coating system. The tested and proven technology promises a lifetime of durability, and is offered in a number of standard Cool Colors. 1  Color Chart (See back of product sheet) (pdf). "}, {"url": "http://www.abcmetalroofing.com/Products/Panel-Profiles/PBR/", "passage_text": "Product Information. Recognized for versatility in multiple environments, the PBR metal panel is a staple, providing various designs through horizontal and vertical options as well as roof and wall applications. PBR offers high quality with the ease of delivery and installation. "}, {"url": "http://www.steelbuilding.com/buildings/panel_profiles.htm", "passage_text": "Roof Panel Profiles for Metal & Commercial Buildings. STEELBUILDING.COM's standard roof sheeting is the PBR panel, which is available in GALVALUME as well as a variety of colors. The R profile has long been an industry standard and is installed on most metal buildings. "}, {"url": "http://www.ascbp.com/agricultural/prodDetailPBR.html", "passage_text": "Colors and Warranties. 26 gauge PBR panel is available in a wide variety of standard colors with the Dura Tech nt Cool Color coating system. The tested and proven technology promises a lifetime of durability, and is offered in a number of standard Cool Colors. 1  Color Chart (See back of product sheet) (pdf). 2  Dura Tech nt Warranty (pdf)"}, {"url": "http://metaloutlet.com/pbrpanel.htm", "passage_text": "PBR Panel is a common metal building industry profile and is used both for roof and wall applications. Also available without the purlin bearing leg (R-Panel). "}, {"url": "http://www.unioncorrugating.com/rpanel.html", "passage_text": "Union Corrugating's R, PBR, & IR metal roofing panels are designed for industrial, commercial, and steel-frame building applications. The R family of metal roofing panels has the strength to perform on roof pitches as low as 1:12 and on spans up to five feet. For R, PBR, and IR metal roofing panel applications, a minimum slope of 1:12 is recommended. Please click here for the R, PBR, and IR panel installation guide."}]