[{"url": "http://www.sparknotes.com/biology/cellstructure/cellmembranes/section2.rhtml", "passage_text": "Problems. In addition to the lipid bilayer, the cell membrane also contains a number of proteins. We have already mentioned the presence of certain proteins in the cell membrane. In this section we will discuss the different classes of proteins found there. Membrane Proteins, page 2. In addition to the lipid bilayer, the cell membrane also contains a number of proteins. We have already mentioned the presence of certain proteins in the cell membrane. In this section we will discuss the different classes of proteins found there."}, {"url": "https://answers.yahoo.com/question/index?qid=20071106163158AAbKR3S", "passage_text": "In order to regulate the transport of molecules, there are two types of proteins in the cell: carrier proteins and transport proteins. The two types of transport proteins are channel and carrier protein. Transport is either active or passive. Active transport is moving molecules against the concentration gradient and energy is required in the form of ATP. Passive transport is moving molecules down the concentration gradient and no energy is required"}, {"url": "http://www.sparknotes.com/biology/cellstructure/cellmembranes/section2.rhtml", "passage_text": "page 1 of 2. In addition to the lipid bilayer, the cell membrane also contains a number of proteins. We have already mentioned the presence of certain proteins in the cell membrane. In this section we will discuss the different classes of proteins found there. Membrane Proteins, page 2. In addition to the lipid bilayer, the cell membrane also contains a number of proteins. We have already mentioned the presence of certain proteins in the cell membrane. In this section we will discuss the different classes of proteins found there."}, {"url": "http://www.ehow.com/list_7365613_types-proteins-cell-membranes.html", "passage_text": "Cells are surrounded by a membrane called a plasma or cell membrane. The membrane consists of phospholipids and proteins. Phospholipids make up the membrane and create the barrier between the cell's contents and area outside the cell. Two types of proteins are found in the cell membrane: integral and peripheral proteins."}, {"url": "https://answers.yahoo.com/question/index?qid=20080219195400AAAzpxC", "passage_text": "Best Answer: Channel proteins-amphipathic proteins (one end polar one end nonpolar) that allow for ions to pass through the membrane down their concentration gradient Transport proteins-proteins that change shape when they bind to a substrate and help facilitate diffusion of substances down their concentration gradient. Transport proteins move molecules through by active transport -- from lower concentration to higher concentration. 3. Proteins on the outer surface act as recognition molecules to help the organism recognize its own cells. 4. Proteins on the inner surface provide anchorage points for the cytoskeleton."}, {"url": "https://answers.yahoo.com/question/index?qid=20071106163158AAbKR3S", "passage_text": "Best Answer: Proteins that are found in the bilayer are receptor proteins, which deal with communication, recognition proteins and transport proteins that regulate the movement of water and soluble molecules through the membrane. The two types of transport proteins are channel and carrier protein. Transport is either active or passive. Active transport is moving molecules against the concentration gradient and energy is required in the form of ATP."}, {"url": "https://en.wikipedia.org/wiki/Membrane_protein", "passage_text": "Membrane proteins are proteins that interact with biological membranes. They are one of the common types of protein along with soluble globular proteins, fibrous proteins, and disordered proteins. They are targets of over 50% of all modern medicinal drugs. It is estimated that 20–30% of all genes in most genomes encode membrane proteins."}, {"url": "http://www.ehow.com/list_7365613_types-proteins-cell-membranes.html", "passage_text": "Transport Proteins. Transport proteins, the final type of integral protein, extend through the membrane and transport materials in and out of the cell. Some transport proteins actively move materials in and out of the cell, while other simply provide an opening for materials to passively move. Phospholipids make up the membrane and create the barrier between the cell's contents and area outside the cell. Two types of proteins are found in the cell membrane: integral and peripheral proteins."}, {"url": "http://www.sparknotes.com/biology/cellstructure/cellmembranes/section2.rhtml", "passage_text": "While the lipid bilayer provides the structure for the cell membrane, membrane proteins allow for many of the interactions that occur between cells. As we discussed in the previous section, membrane proteins are free to move within the lipid bilayer as a result of its fluidity. Membrane Proteins, page 2. In addition to the lipid bilayer, the cell membrane also contains a number of proteins. We have already mentioned the presence of certain proteins in the cell membrane. In this section we will discuss the different classes of proteins found there."}]