[{"url": "http://www.scholastic.com/teachers/contributor/christopher-paul-curtis", "passage_text": "Christopher Paul Curtis was born and reared in Flint, Michigan. After high school graduation, he worked on the assembly line of the Fisher Body Plant/Flint Plant No. 1 and graduated from the Flint branch of the University of Michigan. From the word 'go' Elijah and I became close friends. When I'd go to the library to write, it was as if he were anxiously waiting for me, watiing to tell about his life, his worries, his adventues.. Christopher Paul Curtis lives with his wife and two children in Windsor, Ontario, Canada."}, {"url": "http://www.goodreads.com/author/show/141596.Paul_Christopher", "passage_text": "Paul Christopher is a pseudonym used by the author Christopher Hyde.Librarian Note: There is more than one author in the Goodreads database with this name. Like. “Buying almost up to America’s entrance into the war in December 1942, the New York division shipped out the last purchases within a few days of the attack on Pearl Harbor.”."}, {"url": "http://www.nobodybutcurtis.com/biography.html", "passage_text": "NOBODY BUT CURTIS is the official website for the Newbery Medal and Coretta Scott King award-winning children’s author, Christopher Paul Curtis. The name is derived from Christopher’s professional jazz playing grandfather, Herman E. Curtis Sr. (who Herman E. Calloway of Bud, Not Buddy fame is partially based). "}, {"url": "https://en.wikipedia.org/wiki/Christopher_Paul_Curtis", "passage_text": "Christopher Paul Curtis was born in Flint, Michigan, on May 10, 1953, to Dr. Herman Elmer Curtis, a chiropodist and factory worker/supervisor, and Leslie Jane Curtis, an educator. He has set many of his books in Flint. Curtis is a product of the Flint school system. He appeared on The Today Show Book Club in 2007. 1  The Watsons Go to Birmingham – 1963 (1996) – When Kenny's 13-year-old brother, Byron, gets to be too much trouble, the Watsons head from Flint, Michigan, to Birmingham, Alabama, to visit Grandma Sands, the one person who can shape Byron up."}, {"url": "http://www.biography.com/people/chris-paul-21330627#!", "passage_text": "Christopher Emmanuel Paul was born on May 6, 1985, in Lewisville, North Carolina, the second son of Charles and Robin Paul. Chris' father was a former athlete who taught him and his older brother C.J. the fundamentals of basketball and football, and encouraged their involvement in team sports. "}, {"url": "http://www.readingrockets.org/books/interviews/curtis", "passage_text": "Biography. Christopher Paul Curtis was born in Flint Michigan in 1953. Growing up in an all-black neighborhood, the only white people he ever saw were the teachers at his school. From kindergarten through eighth grade, Christopher was a straight A student who thought he wanted to become a doctor like his father. You can watch the interview below, view the interview transcript, read a short biography on Christopher Paul Curtis, or see a selected list of his children's books. (This video is also available on YouTube and iTunes .)."}, {"url": "http://www.readingrockets.org/books/interviews/curtis", "passage_text": "Christopher Paul Curtis. Christopher Paul Curtis did not become a published author until he was in his 40's. Before his first novel was published, he spent much of his adult life working in an automobile factory. You can watch the interview below, view the interview transcript, read a short biography on Christopher Paul Curtis, or see a selected list of his children's books. (This video is also available on YouTube and iTunes .)."}, {"url": "https://en.wikipedia.org/wiki/Charles_McCarry", "passage_text": "McCarry is best known for a series of books concerning the life of super spy Paul Christopher. Born in Germany before WWII of a German mother and an American father, Christopher joins the CIA after serving as a First lieutenant in the U.S. Marine Corps. McCarry was editor-at-large for National Geographic and has contributed pieces to The New York Times, The Wall Street Journal, The Washington Post, and other national publications."}, {"url": "http://www.orderofbooks.com/authors/christopher-hyde/", "passage_text": "Christopher Hyde is a Canadian author of thriller novels. He has worked for CBC as a writer and producer. His series characters include Finn Ryan and John Holliday. He commonly writes under the pen name Paul Christopher. Christopher Hyde made his debut as a published author in 1979 with The Wave. Below is a list of Christopher Hyde’s books in order of when they were originally released: "}]