[{"url": "http://www.psychologycareercenter.org/salaries.html", "passage_text": "Psychologist Salary and Benefits Information. A career in psychology can provide a lifetime of rewards. Your psychologist mind is probably saying that the most important are the intangibles that come from the positive impact you get to have on peoples’ lives. We agree with you. "}, {"url": "http://www.kentuckytherapist.com/html/benefits_of_counseling.html", "passage_text": "The main benefit of counseling is that it helps you to have a life which you can more fully enjoy and appreciate. It can help you to become the sort of person you want to be. It can also help you to more deeply enjoy your important relationships. You might use therapy to: 1  feel better about yourself. "}, {"url": "http://worldvolunteerweb.org/resources/how-to-guides/manage-volunteers/doc/how-volunteers-benefit-organizations.html", "passage_text": "Volunteers serve in many capacities within organizations by contributing time, energies or talents that help to fulfil the organizations' mission. Volunteers generate enthusiasm and interest and help to create a positive image of the organization in the community. Volunteers extend and augment the work of paid staff. "}, {"url": "http://nsgc.org/p/cm/ld/fid=51", "passage_text": "GENETIC counseling can benefit you and your family. Genetic counselors use their specialized education in both medical genetics and counseling to give you the personalized help you need when it comes to you and your family’s genetic health. "}, {"url": "http://www.innerbody.com/careers-in-criminal-justice/how-to-be-a-substance-abuse-counselor.html", "passage_text": "Requirements for counselors who do not have a private practice also vary from state to state; in some states a license is still required to provide substance abuse services, while in others supervision is adequate. Information about state licensing boards can be found at the Addiction Technology Transfer Center. A substance abuse counselor who has a bachelor’s or master’s degree will not likely need any training before beginning a substance abuse counselor position. However, those counselors who have only a high school diploma do typically require training."}, {"url": "http://www.parklandsd.org/web/omsguidance/benefits-of-school-counseling-programs", "passage_text": "BENEFITS OF SCHOOL COUNSELING PROGRAMS. Comprehensive developmental school counseling programs positively impact students, parents, teachers, administrators, boards of education, other student services personnel, school counselors, business, and industry. The benefits to each of these groups include the following: 4. Provides a means of evaluating school counseling programs. BENEFITS OF THE SCHOOL COUNSELING PROGRAM FOR BOARDS AND DEPARTMENTS OF EDUCATION: 1. Provides rationale for implementing a comprehensive developmental counseling program in the school system."}, {"url": "http://www.edits.net/information/newsletters/career-counseling-benefits-society.html", "passage_text": "America’s Career Resource Network Association (ACRNA) supports the importance of career counseling for students and society as a whole. In their report, ACRNA outlines the educational, social and economic benefits of comprehensive career counseling in schools. Providing students with a comprehensive career education program points students in the right direction and encourages them to stay in school to meet their career goals. Additionally, the text encourages students to explore their career options through the use of the COPSystem assessments. The ACRNA report makes the important point that it is informed career decision-making that ultimately results in the benefits to society. Career education and guidance is a continuous process based on some key steps. A few of these important steps are:"}, {"url": "http://www.innerbody.com/careers-in-criminal-justice/how-to-be-a-substance-abuse-counselor.html", "passage_text": "An effective drug and alcohol counselor will develop treatment plans that benefit the client, the client’s family, and society at large. Addiction counselors work one-on-one with clients in therapeutic settings, determining the causes and triggers of their alcohol or drug abuse. Together, the client and counselor work to determine a treatment plan that will help the client to get clean or remain drug and alcohol free. A substance abuse counselor who has a bachelor’s or master’s degree will not likely need any training before beginning a substance abuse counselor position. However, those counselors who have only a high school diploma do typically require training."}, {"url": "http://ct.counseling.org/2012/03/what-the-future-holds-for-the-counseling-profession/", "passage_text": "The major trends in society will not be what drive the future of counseling practice, however. It will be determined more by how professional counselors educate others as to who we are and how we contribute to the realization of a healthy society by fostering wellness and human dignity. "}]