[{"url": "http://www.theartstory.org/movement-abstract-expressionism.htm", "passage_text": "Franz Kline was an American abstract painter and one of the pioneers of Abstract Expressionism. His signature black-and-white abstractions were inspired by Japanese calligraphy, and inspired a later generation of artists who created Minimalism. Almost all the artists who would later become abstract painters in New York in the 1940s and 1950s were stamped by the experience of the Great Depression, and they came to maturity whilst painting in styles influenced by social realism and the Regionalist movement."}, {"url": "https://en.wikipedia.org/wiki/Abstract_expressionism", "passage_text": "Abstract expressionism is a post– World War II art movement in American painting, developed in New York in the 1940s. It was the first specifically American movement to achieve international influence and put New York City at the center of the western art world, a role formerly filled by Paris. In the years after World War II, a group of New York artists started one of the first true schools of artists in America, bringing about a new era in American artwork: Abstract Expressionism."}, {"url": "http://www.artmovements.co.uk/expressionism.htm", "passage_text": "Expressionism. Key Dates: 1905-1925. A term used to denote the use of distortion and exaggeration for emotional effect, which first surfaced in the art literature of the early twentieth century. In a broader sense Expressionism is one of the main currents of art in the later 19th and the 20th centuries, and its qualities of highly subjective, personal, spontaneous self-expression are typical of a wide range of modern artists and art movements."}, {"url": "http://www.metmuseum.org/toah/hd/abex/hd_abex.htm", "passage_text": "The first generation of Abstract Expressionism flourished between 1943 and the mid-'50s. The movement effectively shifted the art world's focus from Europe (specifically Paris) to New York in the postwar years. The paintings were seen widely in traveling exhibitions and through publications. Mature Abstract Expressionism: Gesture. In 1947, Pollock developed a radical new technique, pouring and dripping thinned paint onto raw canvas laid on the ground (instead of traditional methods of painting in which pigment is applied by brush to primed, stretched canvas positioned on an easel)."}, {"url": "http://www.metmuseum.org/toah/hd/abex/hd_abex.htm", "passage_text": "A new vanguard emerged in the early 1940s, primarily in New York, where a small group of loosely affiliated artists created a stylistically diverse body of work that introduced radical new directions in artand shifted the art world's focus. Mature Abstract Expressionism: Gesture. In 1947, Pollock developed a radical new technique, pouring and dripping thinned paint onto raw canvas laid on the ground (instead of traditional methods of painting in which pigment is applied by brush to primed, stretched canvas positioned on an easel)."}, {"url": "http://www.artyfactory.com/art_appreciation/art_movements/expressionism.htm", "passage_text": "ERNST LUDWIG KIRCHNER (1880-1938). 'Davos under Snow', 1923 (oil on canvas). Expressionism is a term that embraces an early 20th century style of art, music and literature that is charged with an emotional and spiritual vision of the world. "}, {"url": "https://en.wikipedia.org/wiki/Expressionism", "passage_text": "While the word expressionist was used in the modern sense as early as 1850, its origin is sometimes traced to paintings exhibited in 1901 in Paris by an obscure artist Julien–Auguste Herve, hervé which he Called. expressionismes However, the term Expressionism did not firmly establish itself until 1913. Though initially mainly a German artistic movement, most predominant in painting, poetry and the theatre between 1910–30, most precursors of the movement were not German."}, {"url": "https://en.wikipedia.org/wiki/Expressionism", "passage_text": "Expressionism was developed as an avant-garde style before the First World War. It remained popular during the Weimar Republic, particularly in Berlin. The style extended to a wide range of the arts, including expressionist architecture, painting, literature, theatre, dance, film and music. However, the term Expressionism did not firmly establish itself until 1913. Though initially mainly a German artistic movement, most predominant in painting, poetry and the theatre between 1910–30, most precursors of the movement were not German."}, {"url": "https://en.wikipedia.org/wiki/Abstract_expressionism", "passage_text": "Although the term abstract expressionism was first applied to American art in 1946 by the art critic Robert Coates, it had been first used in Germany in 1919 in the magazine Der Sturm, regarding German Expressionism. In the years after World War II, a group of New York artists started one of the first true schools of artists in America, bringing about a new era in American artwork: Abstract"}, {"url": "https://en.wikipedia.org/wiki/Expressionism", "passage_text": "Expressionism was a modernist movement, initially in poetry and painting, originating in Germany at the beginning of the 20th century. Its typical trait is to present the world solely from a subjective perspective, distorting it radically for emotional effect in order to evoke moods or ideas. However, the term Expressionism did not firmly establish itself until 1913. Though initially mainly a German artistic movement, most predominant in painting, poetry and the theatre between 1910–30, most precursors of the movement were not German."}]