[{"url": "http://medical-dictionary.thefreedictionary.com/extracellular+fluid", "passage_text": "extracellular constituents. all of the constituents of the body outside the cells; include water, electrolytes, protein, glucose, enzymes, hormones. extracellular fluid. all of the body fluid lying outside the cells. Includes intravascular fluid or plasma and the interstitial fluid. That part of the extracellular fluid that is in special cavities which have special characteristics, e.g. synovial fluid, urine, aqueous humor of eye, are called transcellular fluids. extracellular matrix. "}, {"url": "http://www.differencebetween.com/difference-between-intracellular-and-vs-extracellular-fluids/", "passage_text": "• Intracellular fluid is found inside cells while extracellular fluid is found outside the cells. • The presence of proteins and amino acids is a feature of intracellular fluid while the absence of those is featured in extracellular fluid. Mainly, there are two major types of extracellular fluids known as interstitial fluid and blood plasma. All those discussed factors are the main properties and constituents of interstitial fluids, which is roughly about 12 litres in a fully-grown human. The total volume of blood plasma is about three litres in a human."}, {"url": "http://www.answers.com/Q/What_is_the_extracellular_fluid_in_most_tissues_is_called", "passage_text": "All the body fluid which is found outside the cells is called  extracellular fluid (ECF) or tissue fluid. In animals its major  portion consists of blood plasma and intersti … tial fluid, with  little amount of transcellular fluid (e.g cerebrospinal fluid and  joint fluid). 2 people found this useful. "}, {"url": "http://www.answers.com/Q/What_is_extracellular_fluid", "passage_text": "You are a PERISHABLE item,live accordingly :). All the body fluid which is found outside the cells is called extracellular fluid (ECF) or tissue fluid. In animals its major portion consists of blood plasma and interstitial fluid, with little amount of transcellular fluid (e.g cerebrospinal fluid and joint fluid). Cytoplasm is the inner part of the cell or its the contents of the cell, which is surrounded by plasma membrane. While extracellular fluid is the fluid located outside of the … cells and divided into 1.plasma in the blood vessel. 2.interstitial fluid between the cells."}, {"url": "http://www.differencebetween.com/difference-between-plasma-and-vs-interstitial-fluid/", "passage_text": "by admin. Plasma vs Interstitial Fluid. Water is the main component of body fluids. The body water can be found mostly in two major compartments called intracellular fluid and extracellular fluid. Intracellular fluid can be found within the cells of the body. The extracellular fluid can be found outside of the cells. Plasma. The extracellular fluid found within the vascular system is the blood plasma. Blood cells and platelets are suspended in this blood plasma. The blood plasma contains many dissolved substances like oxygen, carbon dioxide, salts, amino acids, fatty acids, hormones, and plasma proteins."}, {"url": "http://www.answers.com/Q/What_is_extracellular_fluid", "passage_text": "Extracellular fluid is the body fluid outside the cell that is composed of blood plasma, interstitial fluid, lymph and transcellular fluid. It resides outside the cells and tr … ansports mmaterials to and from the cells. 2 people found this useful. Answered. Cytoplasm is the inner part of the cell or its the contents of the cell, which is surrounded by plasma membrane. While extracellular fluid is the fluid located outside of the … cells and divided into 1.plasma in the blood vessel. 2.interstitial fluid between"}, {"url": "https://en.wikipedia.org/wiki/Extracellular_fluid", "passage_text": "Extracellular fluid (ECF) or extracellular fluid volume (ECFV) usually denotes all body fluid outside of the cells. The remainder is called intracellular fluid. In some animals, including mammals, the extracellular fluid can be divided into two major subcompartments, interstitial fluid and blood plasma. The extracellular fluid also includes the transcellular fluid, which comprises about 2.5 percent of the ECF. In humans, the normal glucose concentration of extracellular fluid that is regulated by homeostasis is approximately 5 mM/L, and the pH is tightly regulated by buffers around 7.4."}, {"url": "http://medical-dictionary.thefreedictionary.com/intracellular+fluid", "passage_text": "Etymology: L, intra + cella, storeroom, fluere, to flow. a fluid within cell membranes throughout most of the body, containing dissolved solutes that are essential to electrolytic balance and to healthy metabolism. Also called intracellular water. Compare extracellular fluid, interstitial fluid, lymph, plasma."}]