[{"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-286-ASPARAGUS.aspx?activeIngredientId=286&activeIngredientName=ASPARAGUS", "passage_text": "Asparagus is also used for preventing stones in the kidney and bladder and anemia due to folic acid deficiency. Some people apply asparagus directly to the skin for cleaning the face, drying sores, and treating acne. In foods, asparagus spears are eaten as a vegetable. This can produce a pungent odor in the urine. The seed and root extracts of asparagus are used in alcoholic beverages."}, {"url": "http://www.livescience.com/45295-asparagus-health.html", "passage_text": "Risks of eating asparagus. “There are no life threatening side effects of eating too much asparagus,” said nutritionist Laura Flores, “but there may be some uncomfortable side effects such as gas, and a noticeable smell to the urine.”. It is also possible to have an asparagus allergy, in which case you should not eat it, she said. People who are allergic to other members of the lily family, such as onions, garlic, and chives, are more likely to be allergic to asparagus. Symptoms include a runny nose, hives, trouble breathing, and puffiness or swelling around the mouth and lips."}, {"url": "http://www.eatingwell.com/blogs/health_blog/5_powerful_health_benefits_of_asparagus_you_probably_didn_t_know", "passage_text": "Asparagus is just packed with health benefits: 1  It’s loaded with nutrients: Asparagus is a very good source of fiber, folate, vitamins A, C, E and K, as well as chromium, a trace mineral that enhances the ability of insulin to transport glucose from the bloodstream into cells. There are, however, no harmful effects, either from the sulfuric compounds or the odor! While it is believed that most people produce these odorous compounds after eating asparagus, few people have the ability to detect the smell."}, {"url": "https://www.organicfacts.net/health-benefits/vegetable/health-benefits-of-asparagus.html", "passage_text": "The health benefits of asparagus include fertility, relief from pre-menstrual syndrome, cancer, diabetes, hangover, cataract, rheumatism, tuberculosis, depression, neurodegenerative diseases, and convulsions. It also reduces urinary tract infections and blood cholesterol. "}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-1167-ASPARAGUS%20RACEMOSUS.aspx?activeIngredientId=1167&activeIngredientName=ASPARAGUS%20RACEMOSUS", "passage_text": "ASPARAGUS RACEMOSUS Overview Information. Asparagus racemosus is a plant used in traditional Indian medicine (Ayurveda). The root is used to make medicine. Don’t confuse asparagus racemosus with Asparagus officinalis, which is the type of asparagus that is commonly eaten as a vegetable. People use asparagus racemosus for upset stomach (dyspepsia), constipation, stomach spasms, and stomach ulcers. It is also used for fluid retention, pain, anxiety, cancer, diarrhea, bronchitis, tuberculosis, dementia, and diabetes. Some people use it to ease alcohol withdrawal."}, {"url": "http://www.livestrong.com/article/320473-negative-side-effects-of-eating-asparagus-daily/", "passage_text": "Asparagus provides many essential vitamins and minerals with very few calories -- only about 20 calories per 5.3 ounces -- making it a nutrient-rich food. Although good for your health, eating asparagus on a daily basis may lead to negative side effects that, although not life threatening or serious, can be annoying. Asparagus is a vegetable belonging to the lily family, which also includes onions, leeks and garlic. Eat asparagus as part of a heart-healthy diet, as it contains no fat, no cholesterol and very little sodium."}, {"url": "http://myhealthbynature.com/asparagus-health-benefits-and-side-effects/", "passage_text": "Side Effects of Asparagus. While asparagus is generally good for the body, certain side effects can be expected when it is eaten in exceptionally high amounts. Its common side effects include: 1. Without any doubt, asparagus may just be one of the most nutritious foods cultivated by the earth. Although it is actually an herbaceous plant, asparagus can be considered as greens. And all green veggies are good for you. Discover all the health benefits of asparagus as listed below and you’ll definitely add it to your diet as often as necessary."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-286-ASPARAGUS.aspx?activeIngredientId=286&activeIngredientName=ASPARAGUS", "passage_text": "ASPARAGUS Side Effects & Safety. Asparagus is safe when eaten in food amounts. However, there isn't enough information to know if asparagus is safe when used in larger medicinal amounts. Asparagus can cause allergic reactions when eaten as a vegetable or used on the skin. Pregnancy and breast-feeding: Asparagus is UNSAFE to use in medicinal amounts during pregnancy. Asparagus extracts have been used for birth control, so they might harm hormone balances during pregnancy. Some people apply asparagus directly to the skin for cleaning the face, drying sores, and treating acne. In foods, asparagus spears are eaten as a vegetable. This can produce a pungent odor in the urine. The seed and root extracts of asparagus are used in alcoholic beverages."}, {"url": "http://myhealthbynature.com/asparagus-health-benefits-and-side-effects/", "passage_text": "1. Jam packed with lots of nutrients. Asparagus is loaded with loads of nutrients that the body needs and can definitely use. Asparagus has high contents of Vitamin A, E, K, and C. It also has high levels of folate, fiber, chromium, and different trace minerals. 2. Without any doubt, asparagus may just be one of the most nutritious foods cultivated by the earth. Although it is actually an herbaceous plant, asparagus can be considered as greens. And all green veggies are good for you. Discover all the health benefits of asparagus as listed below and you’ll definitely add it to your diet as often as necessary. 1"}]