[{"url": "http://www.defenders.org/cheetah/threats", "passage_text": "Threats to Cheetahs. The cheetah’s future is uncertain due to a variety of threats. The biggest is habitat loss due to human encroachment. In addition, they often deal with declines in prey and conflicts with humans."}, {"url": "http://animalstime.com/cheetah-facts-kids-cheetah-habitat-diet/", "passage_text": "Here are some of the most interesting and amazing cheetah facts for kids. The cheetah (Acinonyx jubatus) is a feline that is endemic to Africa with some of the species are also found in the Middle East. These animals are the extant members of genus Acinonyx. Without any doubt, cheetah is the fastest living animal on earth and covers a vast distance of about 500 metres (1,600 feet). Cheetahs are considered to be endangered animals in that only 12,400 species are left in more than 20 different African countries."}, {"url": "http://www.lions.org/cheetah-habitat.html", "passage_text": "In addition, cheetahs are believed to be in direct competition with the local ranchers, which makes them constant targets for trapping and hunting. Today it is hard to imagine that just 100 years ago Africa was a wild and open place, with small pockets of human agriculture and development. Namibia is a desert country, and much like America 's southwest, cattle and sheep ranching are the principle agricultural efforts. As a result, cheetahs are thought to be in direct conflict with ranchers and are exterminated in high numbers. In fact, the Namibian cheetah population has declined by half in the last ten years. Still, an excellent opportunity exists to develop progressive conservation strategies for this endangered ca"}, {"url": "http://www.lions.org/cheetah-habitat.html", "passage_text": "Cheetahs may be fast but the question that wildlife biologists ask is, are they fast enough to outrun extinction? Today cheetahs are an endangered species. Like all spotted and striped cats, cheetahs have long been under pressure by the fur trade. But, over-hunting is not the principle problem facing cheetahs. Loss of habitat, competition with large predators and ranchers, as well as its own loss of genetic variation, is killing off the remaining cheetahs. Namibia is a desert country, and much like America 's southwest, cattle and sheep ranching are the principle agricultural efforts. As a result, cheetahs are thought to be in direct conflict with ranchers and are exterminated in high numbers. In fact, the Namibian cheetah population has declined by half in the last ten years. Still, an excellent opportunity exists to develop progressive conservation strategies for this endangered cat"}, {"url": "https://en.wikipedia.org/wiki/Cheetah", "passage_text": "The cheetah (Acinonyx jubatus) is a big cat in the subfamily Felinae that inhabits most of Africa and parts of Iran. It is the only extant member of the genus Acinonyx. The cheetah can run as fast as 109.4 to 120.7 km/h (68.0 to 75.0 mph), faster than any other land animal. In the wild, the cheetah is a prolific breeder, with up to nine cubs in a litter. The majority of cubs do not survive to adulthood, mainly as a result of depredation from other predators. The rate of cub mortality varies from area to area, from 50% to 75%, and in extreme cases such as the Serengeti ecosystem, up to 90%."}, {"url": "http://www.livescience.com/27319-cheetahs.html", "passage_text": "Cheetahs are carnivores, meaning their primary food is meat. The predators stick to smaller prey, such as gazelles, hares, young wildebeest, warthogs and birds. These cats were made for a dry lifestyle. They only need to drink water every three or four days. Female cheetahs, on the other hand, are loners and only spend time with their young. The only other time females are around cheetahs is during mating season. Female cheetahs carry their young for a gestation period of around three months."}, {"url": "http://animalstime.com/cheetah-facts-kids-cheetah-habitat-diet/", "passage_text": "1 With a narrow waist and slim body, cheetah’s body is covered by several black-circled spots that measure 2 – 3 cm (0.79 – 1.2 inches). 2  These cats are capable to reach a speed of 100 km (62 miles) within just 3 seconds; however, they can retain this much speed for a short burst of time. Without any doubt, cheetah is the fastest living animal on earth and covers a vast distance of about 500 metres (1,600 feet). Cheetahs are considered to be endangered animals in that only 12,400 species are left in more than 20 different African countries."}, {"url": "http://nationalzoo.si.edu/SCBI/EndangeredSpecies/Cheetah/default.cfm", "passage_text": "Cheetahs are well studied in their natural habitat; however, studying cheetah biology in the wild remains difficult. Nuances of cheetah health and behavior remain undocumented and continually present challenges to managers. "}, {"url": "http://www.answers.com/Q/What_is_a_cheetah%27s_natural_habitat", "passage_text": "The cheetah runs down its prey and therefore needs open spaces across which to do this. they enjoy eating frogs and lizards. Cheetahs have a top speed of aorund 60-70 miles per hour but can only run in short bursts. cheetahs have to take breaks after chasing prey or they will overheat. common habitats are grasslands, flat areas with light brush, and savanna. Savanna, dry forest."}]