[{"url": "http://www.best-job-interview.com/list-of-strengths-and-weaknesses.html", "passage_text": "Identify the strengths that will contribute to successful job performance. Using the list of strengths and weaknesses describe your strength and support your answer with examples of how this strength is evident in your work performance. Everyone has a fair number of these! Employers want to know how you manage the weakness. Recognizing the weakness is the first essential step to managing it properly. This list of strengths and weaknesses will help you do this."}, {"url": "http://www.best-job-interview.com/list-of-strengths-and-weaknesses.html", "passage_text": "Strengths and Weaknesses. This list of strengths and weaknesses helps you to recognize those that apply to you. Know how to present these strengths and weaknesses in the best way when answering interview questions. Everyone has a fair number of these! Employers want to know how you manage the weakness. Recognizing the weakness is the first essential step to managing it properly. This list of strengths and weaknesses will help you do this."}, {"url": "http://smallbusiness.chron.com/key-strengths-exceptional-employee-10221.html", "passage_text": "Work Ethic. Diligence and hard work are some of the factors that make up a strong work ethic. An employer does not want someone who is there simply to draw a paycheck. An employee with a strong work ethic knows he is there to perform a job to the best of his ability, and he will not require constant supervision. Idleness or laziness are frowned upon by employers, and can lead to employee termination. By employing critical thinking skills, an employee can weigh the pros and cons of a situation and provide a workable solution to a problem with a minimum amount of supervision or direction from his superiors. Employees with superior decision-making skills save their employers time and money."}, {"url": "http://smallbusiness.chron.com/examples-employee-strengths-13723.html", "passage_text": "Employee strengths can help companies perform more efficiently. NA/Photos.com/Getty Images. Employees are the backbone of any small company or corporation, and certain strengths they possess or acquire help companies operate more efficiently. As a manager or business owner, you should always assess your employees strengths, then place them in positions where these strengths can best be used. Strengths can be both skill-based or related to personal values. Some of the most important employee strengths include communications skills. There are three main types of communications skills, according to Quintessential Careers: listening, written and oral. Listening skills allow you to follow instructions from supervisors."}, {"url": "http://smallbusiness.chron.com/key-strengths-exceptional-employee-10221.html", "passage_text": "Communication. One of the most mentioned strengths sought after by employers is the ability to speak, listen and write effectively. Communication only occurs when the listener understands the message, and an essential part of communication is effective listening. By employing critical thinking skills, an employee can weigh the pros and cons of a situation and provide a workable solution to a problem with a minimum amount of supervision or direction from his superiors. Employees with superior decision-making skills save their employers time and money."}, {"url": "http://plum.io/blog/how-to-handle-employees-weaknesses/", "passage_text": "Let your employees do what they do best. Your job as a manager should be to encourage growth and skill-building. Give more project ideas to creative-types and more responsibility to the industriously minded. Position these complementary types together for dynamite results. "}, {"url": "http://www.mysticmadness.com/list-of-top-5-strengths-and-weaknesses.html", "passage_text": "The best way to deal with weaknesses would be to leverage the strengths so that our faults are minimised. Lets start with 5 weaknesses from the list of top 5 strength and weaknesses. Procrastination: Missed opportunities are often the result of this serious weakness. They are just the representative and the list of top strength and weaknesses can vary from individual to individual. The challenge is to recognize which ones is your own and do your best to work with them."}, {"url": "http://smallbusiness.chron.com/examples-employee-strengths-13723.html", "passage_text": "Your sales and profits rely on such employee strengths. For example, as a brand manager, you may need to determine the best solution for dealing with a competitive price reduction. It may not be feasible to just reduce your prices, as the larger competitor may enjoy more economies of scale. Some of the most important employee strengths include communications skills. There are three main types of communications skills, according to Quintessential Careers: listening, written and oral. Listening skills allow you to follow instructions from supervisors."}]