[{"url": "http://www.paajaka.com/2008/08/wheat-laddu-with-ghee-residue.html", "passage_text": "It is prepared by melting unsalted butter until the liquid turns honey color. We usually filter the residue and use the clear ghee in cooking. We usually discard the ghee residue which is dark in color. It is the burnt butter that remains in the bottom of the pan when preparing ghee. I have used this residue in making wheat laddu. Do not drain all of the ghee. Leave a couple of teaspoons of ghee. To this residue add wheat flour and keep stirring in reduced heat in the same pan, until the raw smell goes away from the wheat flour. To this add sugar and keep mixing."}, {"url": "http://www.paajaka.com/2008/08/wheat-laddu-with-ghee-residue.html", "passage_text": "Method: After draining the ghee, you will find some residue at the bottom of the pan. Do not drain all of the ghee. Leave a couple of teaspoons of ghee. To this residue add wheat flour and keep stirring in reduced heat in the same pan, until the raw smell goes away from the wheat flour. To this add sugar and keep mixing."}, {"url": "http://www.thenourishinggourmet.com/2008/06/making-ghee.html", "passage_text": "Ghee is a wonderful food. It is basically butter that has been melted, the moisture evaporated, and the milk solids browned in the fat and strained out. This leaves pure butter fat or oil. It is the pure “good stuff” in butter. All of those great properties in butter are found in the butter oil. "}, {"url": "https://www.organicfacts.net/health-benefits/other/ghee-clarified-butter.html", "passage_text": "Ghee is a clarified type of butter, meaning that it is butter that has been simmered into a concentrate and the residue has been removed. What remains is basically a pure combination of fats, without any milk residue, which means that it does not need to be refrigerated. Ghee can last for months, or even years, without refrigeration, which made it very popular throughout history, before modern times and refrigeration."}, {"url": "http://whatscookingamerica.net/Q-A/ButterGhee.htm", "passage_text": "Clarified Butter: Clarified butter and ghee are not the same. Ghee is clarified butter that has been cooked longer to remove all the moisture, and the milk solids are browned (caramelized) in the fat and then strained out. This gives a rich nutty taste. Ghee has a longer shelf life, both refrigerated and at room temperature. Butter Ghee: Butter Ghee: Clarified butter and ghee are not the same. Ghee is clarified butter that has been cooked longer to remove all the moisture, and the milk solids are browned (caramelized) in the fat and then strained out."}, {"url": "http://www.answers.com/Q/How_do_you_reuse_the_ghee_residue_economically", "passage_text": "Take butter slowly melt, remove from heat let the milk solids separate (sink to the bottom of the pan) from the golden liquid on the surface. This is ghee or clarified butter … . Ghee can be stored at room temperature once you have separated the milk solids from the golden liquid. Use like oil in any dish. Take it a step further by simmering it until all of the moisture evaporates and the milk solids begin to brown, giving the resulting butter a nutty, caramel like flavor and aroma, is called brown butter. + 11 others found this useful. Pam Dexter"}, {"url": "http://www.foodnetwork.com/recipes/alton-brown/ghee-recipe.html#!", "passage_text": "Place butter in medium saucepan over medium-high heat. Bring butter to boil. This takes approximately 2 to 3 minutes. Once boiling, reduce heat to medium. The butter will form a foam which will disappear. Ghee is done when a second foam forms on top of butter, and the butter turns golden. Approximately 7 to 8 minutes. Brown milk solids will be in bottom of pan."}, {"url": "https://en.wikipedia.org/wiki/Ghee", "passage_text": "Ghee is prepared by simmering butter, which is churned from cream, and removing the liquid residue. Spices can be added for flavor. The texture, color, and taste of ghee depend on the quality of the butter, source of the milk used in the process and the duration of the boiling. 1 Litre can of Cow Ghee. Traditionally, ghee [Sanskrit: गोघृत go-ghṛta ] is always made from the milk of cows, which are considered sacred, and it is a sacred requirement in Vedic yajna yajña and (homa fire), sacrifices through the medium Of (agni) fire to offer oblations to various. deities"}, {"url": "http://www.ijstr.org/final-print/nov2012/Use-of-Ghee-Residue-As-A-Substrate-For-Microbial-Lipase-Production.pdf", "passage_text": "Thus, it can be stated that ghee residue as a substrate for SSF better yield gives in comparison to conventional SLF. Ghee residue is produced in large quantity by dairy industries and most of the ghee residue goes to waste [4] , which can be. used as a substrate for large scale production of lipase enzyme. Also the production cost reduced for the lipase would be enzyme, whichfinds applications in wide range of industries. Most of the times, it is considered as a As ghee residue contains 3270% of fats,– it could be used poential substrate for production of lipase [5] . In the present study, solid state fermentation was used for hee residue as a substrate [6] ."}]