[{"url": "https://en.wikipedia.org/wiki/Stone_(weight)", "passage_text": "Ten years later, a stone still varied from 5 pounds (glass) to 8 pounds (meat and fish) to 14 pounds (wool and horseman's weight). However, the Act of 1835 permitted using a stone of 14 pounds for trade but other values remained in use. STONE also denotes a certain quantity or weight of some commodities. A stone of beef, in London, is the quantity of eight pounds; in Hertfordshire, twelve pounds; in Scotland sixteen pounds."}, {"url": "http://home.howstuffworks.com/question329.htm", "passage_text": "The way we talk about paper in the United States is amazingly convoluted. The short answer is that 500 sheets of bond paper with a size of 17 by 22 have a weight of 20 pounds. The manufacturer would cut a sheet that big into four letter-size sheets, so a 500-sheet ream of 20-pound bond paper weighs 5 pounds. If it was something other than bond paper, then the size of the standard sheet used to determine the weight might be different. "}, {"url": "http://www.investopedia.com/terms/h/hundredweight.asp", "passage_text": "A unit of measurement for weight used in certain commodities trading contracts. In North America, a hundredweight is equal to 100 pounds and is also known as a short hundredweight. In Britain, a hundredweight is 112 pounds and is also known as a long hundredweight. Next Up. For example, on the Chicago Mercantile Exchange, the futures contract for rough rice is 2,000 hundredweights of long grain rough rice. In the past, hundredweight was used as a unit of measure for buying and selling many more commodities."}, {"url": "http://steelmillsoftheworld.com/activities/datacenter/G_Note1.pdf", "passage_text": "Also, almost all automotive specifications require designation of the coating mass on each side of the sheet, e.g., 40G40G, requires 40 g/m 2 on each side. The Inch-Pound term G40, a designator used only for hot-dip galvanized sheet, is defined by A 653/A 653M as total coating weight, both sides. The commonInch-Pound coating weightdesignat ions (ordered as A 653)for galvannealed product are, in oz/ft 2: A25 A40 A60 As with the galvanized product designators, A40 for example requires a minimum coating weight of 0.40 oz/ft 2."}, {"url": "http://www.scafco.com/upload/userfiles/Stud/Brochures/Galvanized_Coatings/GalvInfo_-_Coating_Weight_Designations.pdf", "passage_text": "One of the coating weight designation systems in this standard uses descriptors such as G60, G90, etc. The “G” means the coating is galvanize (zinc), and the numbers refer to the weight of zinc on the surface of the steel sheet in inch-pound (English/Imperial) units. No inch-pound designations are used since single side coatings are traditionally ordered in SI units only. Examples are: 60G 70G 90G These designations specify the minimum and maximum SST value on each surface, e.g., 60G requires a minimum of 60 g/m 2 and a maximum of 110 g/m 2 of zinc on each surface for any SST."}, {"url": "http://steelmillsoftheworld.com/activities/datacenter/G_Note1.pdf", "passage_text": "The designation system for coating weight (mass) is given in ASTM Standard A 792/A 792M. The three Inch-Pound coating weight designations (ordered as A 792) are, in oz/ft 2: AZ50 AZ55 AZ60 These designators are comparable to those used for galvanized in that the dimensions are oz /ft 2. The commonInch-Pound coating weightdesignat ions (ordered as A 653)for galvannealed product are, in oz/ft 2: A25 A40 A60 As with the galvanized product designators, A40 for example requires a minimum coating weight of 0.40 oz/ft 2."}, {"url": "https://en.wikipedia.org/wiki/Stone_(weight)", "passage_text": "The Scottish stone was equal to 16 Scottish pounds (17 lb 8 oz avoirdupois or 7.936 kg). In 1661, the Royal Commission of Scotland recommended that the Troy stone be used as a standard of weight and that it be kept in the custody of the burgh of Lanark. STONE also denotes a certain quantity or weight of some commodities. A stone of beef, in London, is the quantity of eight pounds; in Hertfordshire, twelve pounds; in Scotland sixteen pounds."}, {"url": "http://www.galvinfo.com/ginotes/GalvInfoNote_1_1.pdf", "passage_text": "The common inch-pound coating weight designations (ordered as A1046) are, in oz/ft 2: ZM30 ZM40 ZM60 ZM75 ZM90 These designations specify the minimum average of a TST, total-both-sides, tested per A924/A924M, e.g., ZM60 requires a minimum average TST of 0.60 oz/ft 2 total-both-sides. This alloy-coated sheet has a coating that consists of zinc with 5-13% aluminum, and 2-4% magnesium. The designation systems for coating weight and coating mass are given in ASTM Standard A1046/A1046M."}, {"url": "http://www.scafco.com/upload/userfiles/Stud/Brochures/Galvanized_Coatings/GalvInfo_-_Coating_Weight_Designations.pdf", "passage_text": "The common inch-pound coating weight designations (ordered as A 875) are, in oz/ft 2: GF30 GF45 GF60 GF75 GF90 For Zn-5% Al alloy-coated sheet, since the coating contains about 95% zinc, and thus has nearly the same density as zinc, a GF90 coating is approximately equivalent in thickness to a G90 galvanized coating. No inch-pound designations are used since single side coatings are traditionally ordered in SI units only. Examples are: 60G 70G 90G These designations specify the minimum and maximum SST value on each surface, e.g., 60G requires a minimum of 60 g/m 2 and a maximum of 110 g/m 2 of zinc on each surface for any SST."}, {"url": "http://www.civilwarartillery.com/calibertopounder.htm", "passage_text": "For example, the same 8-inch Parrott rifle was referred to as a 200-pounder by the army and a 150-pounder in the navy. The confusion existed because the original 200 pound projectile had been shortened, thus reducing the weight to 150 pounds. The navy carried the new designation while the army retained the older. The 10-inch Parrott was known as a 300-pounder, even though it actually fired a shell weighing about 250 pounds."}]