[{"url": "http://www.opticsplanet.com/riflescope-mounts-rings-and-bases.html", "passage_text": "We also have a variety of terrific How-To resources on the topic of Rifle Scope Mounts, Rings & Bases, written by our product experts such as How to Secure Rifle Scope Mounting Systems, Mounting a Rifle Scope and How to Choose and Install Mounts Rings and Bases. 9 models Burris Zee Signature 1 inch Rifle Scope Mount Rings for Weaver Style bases (112) As Low As $39.89 Save up to 30% Best Rated. 2 models Nikon M-223 1in Mount (34) As Low As $79.79 Free 2 Day Shipping. 34 models Leupold Dual Dovetail DD Bases (87) As Low As $17.99 Save up to 49% Clearance."}, {"url": "http://www.opticsplanet.com/burris-xtreme-tactical-1-two-rings.html", "passage_text": "Burris Xtreme Tactical Picatinny Style Rail 1 inch Weapon Rings Product Info. Ideal for all rifle scopes on AR15/M16 flattop receivers for proper cheek weld, Burris 1 Xtreme Tactical Ultra-Strong rings are available in four heights from 1/4 to 1 to accommodate any type of scope. Burris Xtreme Military Rings are ready for the heaviest of scopes, massive recoil, and severe usage."}, {"url": "http://www.weaveroptics.com/rings_bases/tactical/", "passage_text": "Special-purpose tactical equipment requires specialized mounting hardware to install model-specific scopes and sights. Or utilize our bases to add-on other accessories to your tactical weapon. Whatever your requirements, our complete systems are skillfully designed and built to the exact, military-grade specifications. "}, {"url": "https://www.leupold.com/resources/about-leupold-mounting-systems/", "passage_text": "Leupold has created a number of mounting systems, each matched to different needs and preferences. Most of the following rings and bases are available in gloss, matte or silver to compliment your scope or receiver. Different ring heights accommodate various objective sizes and barrel shapes. The Leupold steel standard bases and rings are the most versatile of any mounting system we offer. The rear ring is secured by windage adjustment screws, allowing the scope’s internal adjustments to be reserved for precise sight-in."}, {"url": "http://www.cabelas.com/category/Mounts-Bases/104008680.uts", "passage_text": "1 2 3 | Next. Make sure your scope is secure at the most crucial moments with riflescope mounts and bases from Cabela's. We offer a vast selection of rings, bases, scope mounts, and mount kits to make sure your scope fits perfectly and securely on your gun. "}, {"url": "http://www.opticsplanet.com/riflescope-mounts-rings-and-bases.html", "passage_text": "At OpticsPlanet, we are truly excited to offer such an exceptional lineup of Rifle Scope Mounts, Rings & Bases. Shop with confidence knowing that the scope mounting system you buy with us is coming from top brands like Leupold, Warne, Weaver, Burris, Browning, Ruger and Nikon. 9 models Burris Zee Signature 1 inch Rifle Scope Mount Rings for Weaver Style bases (112) As Low As $39.89 Save up to 30% Best Rated. 2 models Nikon M-223 1in Mount (34) As Low As $79.79 Free 2 Day Shipping. 34 models Leupold Dual Dovetail DD Bases (87) As Low As $17.99 Save up to 49% Clearance."}, {"url": "https://www.leupold.com/resources/about-leupold-mounting-systems/", "passage_text": "Mark 4 Tactical Mounts. Mark 4 tactical bases and rings are the strongest of all Leupold mounting systems. The one-piece base features a built-in 15 MOA slope for long range shooting. Both 6-48 shoulder screws and the larger 8-40 screws are included to accommodate high recoil applications. The Leupold steel standard bases and rings are the most versatile of any mounting system we offer. The rear ring is secured by windage adjustment screws, allowing the scope’s internal adjustments to be reserved for precise sight-in."}, {"url": "https://www.leupold.com/tactical/mounting-systems/", "passage_text": "Mark 4 Mounting Systems. Mark 4 tactical bases and rings are the strongest of all Leupold mounting systems. The one-piece base features a built-in 15 MOA slope for long range shooting. Both 6-48 shoulder screws and the larger 8-40 screws are included to accommodate high recoil applications. Leupold® mounts are every bit as rugged and dependable as the Leupold optics they’re intended to secure. With a huge variety of mounting systems, for nearly every type of firearm under the sun, you’re sure to find the perfect match for you firearm, and your style of shooting. Mount Finder"}]