[{"url": "http://www.sciencedirect.com/science/article/pii/S1359511305003223", "passage_text": "5. Schematic diagram of the fractional precipitation and the results obtained for the pre-purification of paclitaxel from biomass. The methanol concentration in water, paclitaxel content in the crude extract, storage temperature, and storage time were 61.5% (v/v), 0.5% (w/v), 0 °C, and 3 days, respectively. In this study, the storage temperature, an important process variable in fractional precipitation, was optimized in terms of the yield and purity of paclitaxel for a fixed methanol concentration in water (61.5%, v/v), paclitaxel content in the crude extract (0.5%, w/v), and storage time (3 days)."}, {"url": "http://www.chemistry-dictionary.com/definition/fractional+precipitation.php", "passage_text": "Definition of fractional precipitation. 1) Removal of some ions from solution by precipitation while leaving other ions with similar properties in solution. Related Terms & Definitions. Here are some related terms and definitions we found for this term. » 1  Acid Rain. » 2  Climate. » 3  bulk modulus (K). » 4  Fractional Distillation. » 5  Mohr Titration."}, {"url": "http://www.sciencedirect.com/science/article/pii/S1359511305003223", "passage_text": "Fractional precipitation is a rapid, simple, and efficient procedure for the pre-purification of paclitaxel with high purity and yield. Here, we report optimization of the storage temperature, a key process variable in fractional precipitation, to obtain paclitaxel of high purity and yield in a pre-purification step. In this study, the storage temperature, an important process variable in fractional precipitation, was optimized in terms of the yield and purity of paclitaxel for a fixed methanol concentration in water (61.5%, v/v), paclitaxel content in the crude extract (0.5%, w/v), and storage time (3 days)."}, {"url": "http://encyclopedia2.thefreedictionary.com/fractional+precipitation", "passage_text": "Fractional Precipitation. a method of separating a mixture of substances by means of their gradual precipitation from a solution. The methods of fractional precipitation, which are generally used for separation of mixtures of substances that are close in terms of chemical properties and solubility, are extremely labor-intensive. Kolthoff, I. M., and E. B. Sandell. Kolichestvennyi analiz, 3rd ed. Moscow-Leningrad, 1948"}, {"url": "https://en.wikipedia.org/wiki/Cohn_process", "passage_text": "Finally, albumin is located in fraction V. The precipitation of albumin is done by reducing the pH to 4.8, which is near the pI of the protein, and maintaining the ethanol concentration to be 40%, with a protein concentration of 1%. Thus, only 1% of the original plasma remains in the fifth fraction. Any precipitate formed here is done so by filtration and is an impurity. These precipitates are discarded. Reprecipitation, or repetition of the precipitation step in order to improve purity, is done so by raising ethanol concentration back to 40% from the extraction stage. The pH is 5.2 and it is conducted at −5 °C."}, {"url": "http://www.sciencedirect.com/science/article/pii/S1359511305003223", "passage_text": "To obtain a high yield of paclitaxel from fractional precipitation, the optimal storage temperature was 0 °C at a fixed methanol concentration (61.5%, v/v) in water, storage time (3 days), and paclitaxel content (0.5%, w/v) in methanol solution. In this study, the storage temperature, an important process variable in fractional precipitation, was optimized in terms of the yield and purity of paclitaxel for a fixed methanol concentration in water (61.5%, v/v), paclitaxel content in the crude extract (0.5%, w/v), and storage time (3 days)."}, {"url": "http://www.answers.com/Q/What_is_fractional_precipitation", "passage_text": "Precipitation, from a weather point of view, is the condensation of water from the air around us. Three types are rain, snow and hail. Another type is sleet. 14 people found this useful. Since they fall into these objects and they are made out of water there are now apart of the storage system.Precipitation is the storage part from the water cycle. The sun heat's turns water into gas..evaoration."}, {"url": "http://encyclopedia2.thefreedictionary.com/fractional+precipitation", "passage_text": "fractional precipitation. (analytical chemistry). Method for separating elements or compounds with similar solubilities by a series of analytical precipitations, each one improving the purity of the desired element. The methods of fractional precipitation, which are generally used for separation of mixtures of substances that are close in terms of chemical properties and solubility, are extremely labor-intensive. Kolthoff, I. M., and E. B. Sandell. Kolichestvennyi analiz, 3rd ed. Moscow-Leningrad, 1948"}]