[{"url": "https://en.wikipedia.org/wiki/Pulmonary_surfactant", "passage_text": "This is a phospholipid with two 16-carbon saturated chains and a phosphate group with quaternary amine group attached. The DPPC is the strongest surfactant molecule in the pulmonary surfactant mixture. It also has higher compaction capacity than the other phospholipids, because the apolar tail is less bent. Pulmonary surfactant is a surface-active lipoprotein complex (phospholipoprotein) formed by type II alveolar cells."}, {"url": "http://medical-dictionary.thefreedictionary.com/surfactant", "passage_text": "Surfactant prevents this collapse by reducing the surface tension of the fluids that line the lungs and helping to equalize the pressures between large and small air spaces. Surface tension is a measure of the attraction molecules of a fluid have for each other. If the surface tension is lowered, the attraction among molecules of the fluid is decreased and the surface area of the fluid increases. For example, if a drop of detergent is added to a drop of water, the detergent reduces the surface tension and the drop of water flattens out. In the lungs, surfactant reduces the surface tension and helps to maximize the surface area available for gas exchange"}, {"url": "http://medical-dictionary.thefreedictionary.com/surfactant", "passage_text": "Surfactant reduces the surface tension of fluid in the lungs and helps make the small air sacs in the lungs (alveoli) more stable. If the surface tension is lowered, the attraction among molecules of the fluid is decreased and the surface area of the fluid increases. For example, if a drop of detergent is added to a drop of water, the detergent reduces the surface tension and the drop of water flattens out. In the lungs, surfactant reduces the surface tension and helps to maximize the surface area available for gas exchang"}, {"url": "https://en.wikipedia.org/wiki/Pulmonary_surfactant", "passage_text": "The normal surface tension for water is 70 dyn/cm (70 mN/m) and in the lungs it is 25 dyn/cm (25 mN/m); however, at the end of the expiration, compressed surfactant phospholipid molecules decrease the surface tension to very low, near-zero levels. Pulmonary surfactant is a surface-active lipoprotein complex (phospholipoprotein) formed by type II alveolar cells."}, {"url": "https://en.wikipedia.org/wiki/Pulmonary_surfactant", "passage_text": "By adsorbing to the air-water interface of alveoli hydrophilic head groups in the water and the hydrophobic tails facing towards the air, the main lipid component of surfactant, dipalmitoylphosphatidylcholine (DPPC), reduces surface tension. Pulmonary surfactant is a surface-active lipoprotein complex (phospholipoprotein) formed by type II alveolar cells."}, {"url": "https://quizlet.com/4850139/surfactant-flash-cards/", "passage_text": "Surfactant. Surfactant is a complex substance containing phospholipids and a number of apoproteins. This fluid is produced by the Type II alveolar cells, and lines the alveoli and smallest bronchioles. Surfactant reduces surface tension throughout the lung. Smaller alveoli would therefore be expected to empty into larger alveoli as lung volume decreases. This does not occur, however, because surfactant differentiallyreduces surface tension, leading to alveolar stability and reducing the likelihood of alveolar collapse."}, {"url": "http://medical-dictionary.thefreedictionary.com/surfactant", "passage_text": "surfactant. 1. surface-active agent. 2. in pulmonary physiology, a mixture of phospholipids that reduces the surface tension of pulmonary fluids and thus contributes to the elastic properties of pulmonary tissue. If the surface tension is lowered, the attraction among molecules of the fluid is decreased and the surface area of the fluid increases. For example, if a drop of detergent is added to a drop of water, the detergent reduces the surface tension and the drop of water flattens out. In the lungs, surfactant reduces the surface tension and helps to maximize the surface area available for gas exchang"}, {"url": "http://www2.hawaii.edu/~yzuo/research1-surfactant.html", "passage_text": "Research: Biophysical Study of Lung Surfactant. Lung/pulmonary surfactant is a phospholipid-protein complex that lines a thin film at the air-water interface of the lung. The surfactant film of the lung plays a dual role of surface tension reduction and host defense against inhaled pathogens and particles"}]