[{"url": "http://www.webopedia.com/TERM/M/module.html", "passage_text": "(1) In software, a module is a part of a program. Programs are composed of one or more independently developed modules that are not combined until the program is linked. A single module can contain one or several routines. (2) In hardware, a module is a self-contained component."}, {"url": "http://programmers.stackexchange.com/questions/167859/what-is-actually-a-module-in-software-engineering", "passage_text": "As the definition a module consists a single block of code that can be invoked in the way that a procedure, function, or method is invoked, the definition seems very vague and broad. So could anyone explain it in other clear words and show some actual example how to break a requirement into module. Thanks. A module, 1  encapsulates code and data to implement a particular functionality. 2  has an interface that lets clients to access its functionality in an uniform manner. 3  is easily pluggable with another module that expects its interface."}, {"url": "http://xbnotes.freehosting.net/modular.html", "passage_text": "Modular Programming. Modular programming can be used to break up a large program into manageable units, or to create code that can be easily re-used. A modular program consists of a main module and one or more auxiliary modules. Each module originates from a separate source code file. The main module is compiled as an EXE, and calls functions in the auxiliary modules. The entry function in an auxiliary module is not called automatically when the module is statically linked. If the entry function is used to initialize the module, it is necessary for the main module to explicitly call it. This is particularly important for a modular GUI Designer program."}, {"url": "https://en.wikipedia.org/wiki/Modular_programming", "passage_text": "Modular programming is closely related to structured programming and object-oriented programming, all having the same goal of facilitating construction of large software programs and systems by decomposition into smaller pieces, and all originating around the 1960s. Furthermore, the term package has other uses in software. A component is a similar concept, but typically refers to a higher level; a component is a piece of a whole system, while a module is a piece of an individual program."}, {"url": "http://searchenterpriselinux.techtarget.com/definition/module", "passage_text": "Super Micro SuperBlade. A module is a separate unit of software or hardware. Typical characteristics of modular components include portability, which allows them to be used in a variety of systems, and interoperability, which allows them to function with the components of other systems. The term was first used in architecture. 1) In computer programming, especially in older languages such as PL/1, the output of the language compiler was known as an object module to distinguish it from the set of source language statements, sometimes known as the source module."}, {"url": "https://en.wikipedia.org/wiki/Modular_programming", "passage_text": "It is not to be confused with code refactoring. Modular programming is a software design technique that emphasizes separating the functionality of a program into independent, interchangeable modules, such that each contains everything necessary to execute only one aspect of the desired functionality. Furthermore, the term package has other uses in software. A component is a similar concept, but typically refers to a higher level; a component is a piece of a whole system, while a module is a piece of an individual program."}, {"url": "https://en.wikipedia.org/wiki/Modular_programming", "passage_text": "The scale of the term module varies significantly between languages; in Python it is very small-scale and each file is a module, while in Java 9 it is planned to be large-scale, where a module is a collection of packages, which are in turn collections of files. Furthermore, the term package has other uses in software. A component is a similar concept, but typically refers to a higher level; a component is a piece of a whole system, while a module is a piece of an individual program."}]