[{"url": "http://www.wikiprofessional.org/Neurosurgeon_Salary", "passage_text": "Neurosurgeon Salary. The median salary, which is that amount where the same number of neurosurgeons earned less than that amount and the same number earned more, is more than $704,170. Neurosurgeons are among the highest paid of the medical professionals. This is due to the extensive educational and residency requirements. The top 10% of neurosurgeons earn up to $1,229,881. Neurosurgeons specialize in the treatment of medical disorders involving the nervous system. They diagnose and treat patients with degenerative spinal issues, strokes, brain infections, tumors and more. Neurosurgeons also perform surgical procedures as necessary."}, {"url": "http://www1.salary.com/TX/Houston/neurologist-salary.html", "passage_text": "This chart describes the expected percentage of people who perform the job of Physician-Neurology in Houston, TX that make less than that salary. For example 50% of the people who perform the job of Physician-Neurology in Houston are expected to make less than the median. For example the median expected annual pay for a typical Physician-Neurology in the United States is $232,601 so 50% of the people who perform the job of Physician-Neurology in the United States are expected to make less than $232,601. Source: HR Reported data as of October 2015. 1  Salary. 2  Bonus. 3  Benefits."}, {"url": "http://neuro.memorialhermann.org/houston-neurologists-neurosurgeons/", "passage_text": "Houston Neurologists and Neurosurgeons. Mischer Neuroscience Institute is home to nationally recognized neurologists and neurosurgeons – many of the most experienced and accomplished in Houston."}, {"url": "http://www.indeed.com/salary/q-Neurosurgeon-l-Houston,-TX.html", "passage_text": "$128,000. Average Neurosurgeon salaries for job postings in Houston, TX are 13% higher than average Neurosurgeon salaries for job postings nationwide."}, {"url": "http://work.chron.com/salary-experienced-neurosurgeon-3916.html", "passage_text": "In its 2011 survey of physician salaries, the Medical Group Management Association ranked neurosurgeons second among the 25 highest-paid surgical specialties in hospitals, behind only spinal surgeons. Their data showed an average salary of $701,927 for neurosurgeons in hospitals across the United States. Overall, neurosurgeons in all types of practice averaged $767,627 in the the same study, with pediatric neurosurgeons trailing their peers at a still-substantial $643,188. Orthopedic spinal surgeons can compete with experienced neurosurgeons on income, with an average annual salary of $714,088 among hospital-employed surgeons. Pediatric cardiovascular surgeons are also high earners, at a national average of $762,846."}, {"url": "http://work.chron.com/salary-experienced-neurosurgeon-3916.html", "passage_text": "There are numerous advantages to both sides. Staffing agency Jackson & Coker shows neurosurgeons earning an average of $671,086 a year nationally, with an additional $134,217 in bonuses. However, each surgeon generates an average of more than $2.7 million a year for the hospital in gross revenues, and helps raise the hospital's profile. Orthopedic spinal surgeons can compete with experienced neurosurgeons on income, with an average annual salary of $714,088 among hospital-employed surgeons. Pediatric cardiovascular surgeons are also high earners, at a national average of $762,846."}, {"url": "http://work.chron.com/annual-salary-neurosurgeon-6734.html", "passage_text": "Experience. Experience makes a big difference in neurosurgeons' salaries. A survey conducted in 2011 by Profiles found a median starting salary of $395,000 for neurological surgeons. After six years in practice, the average salary grew to $589,500. Neurosurgery Market Watch reports that neurosurgeons six to 15 years into their profession earned a median income of $914,796. Top neurosurgeons make more than $1 million annually, according to Becker's Hospital Review.. Compensation reflects the required expertise and the weight of the job. Becker's Hospital Review reported that neurosurgeons enjoyed an annual average salary of $767,627 in 2010. Median salaries jumped from $592,811 in 2009 to $625,300 in 2010, the New England Journal of Medicine reported."}]