[{"url": "http://geology.com/rocks/sandstone.shtml", "passage_text": "Sandstones are rocks composed primarily of sand grains. The grains of sand in a sandstone are usually particles of mineral, rock or organic material that have been reduced to sand size by weathering and transported to their depositional site by the action of moving water, wind or ice."}, {"url": "http://geology.com/rocks/sandstone.shtml", "passage_text": "Sandstone is one of the most common types of sedimentary rock and is found in sedimentary basins throughout the world. It is often mined for use as a construction material or as a raw material used in manufacturing."}, {"url": "http://geology.com/rocks/sandstone.shtml", "passage_text": "To a geologist the word sand in sandstone refers to the particle size of the grains in the rock rather than the material of which it is composed. Sand-size particles range in size from 1/16 millimeter to 2 millimeters in diameter."}, {"url": "http://geology.com/rocks/sandstone.shtml", "passage_text": "Sandstone is a sedimentary rock composed of sand-sized grains of mineral, rock or organic material. It also contains a cementing material that binds the sand grains together and may contain a matrix of silt-or clay-size particles that occupy the spaces between the sand grains."}, {"url": "http://www.merriam-webster.com/dictionary/sandstone", "passage_text": "Full Definition of SANDSTONE. : a sedimentary rock consisting of usually quartz sand united by some cement (as silica or calcium carbonate). See sandstone defined for English-language learners. See sandstone defined for kids. ADVERTISEMENT."}, {"url": "http://www.thefreedictionary.com/sandstone", "passage_text": "sandstone-a sedimentary rock consisting of sand consolidated with some cement (clay or quartz etc.). firestone-a sandstone that withstands intense heat; used to line fireplaces and furnaces and kilns. holystone-a soft sandstone used for scrubbing the decks of a ship. arenaceous rock-a sedimentary rock composed of sand."}, {"url": "http://volcano.oregonstate.edu/book/export/html/1056", "passage_text": "Sandstone is a clastic sedimentary rock that forms from the cementing together of sand sized grains forming a solid rock. Quartz is the most abundant mineral that forms sandstone. Calcium carbonate, silica, or iron has been added to the water that is in contact with the sand grains."}]