[{"url": "https://en.wikipedia.org/wiki/Hepatitis_A", "passage_text": "Hepatitis A (formerly known as infectious hepatitis) is an acute infectious disease of the liver caused by the hepatitis A virus (HAV). Many cases have few or no symptoms, especially in the young. The time between infection and symptoms, in those who develop them, is between two and six weeks. "}, {"url": "http://www.cdc.gov/hepatitis/PublicInfo.htm", "passage_text": "The word hepatitis means inflammation of the liver. Hepatitis is most often caused by a virus. In the US, the most common types are Hepatitis A, Hepatitis B, and Hepatitis C. Heavy alcohol use, toxins, some medications and certain medical conditions can also cause hepatitis. Hepatitis E is a serious liver disease caused by the Hepatitis E virus (HEV) that usually results in an acute infection. It does not lead to a chronic"}, {"url": "http://www.emedicinehealth.com/hepatitis_a/page2_em.htm", "passage_text": "Hepatitis A Causes. The cause of hepatitis A is hepatitis A virus (HAV) that is transmitted person to person by contaminated foods, water or other drinks (including ice), blood, stool, and direct contact. The virus is a Picornavirus that contains single-stranded RNA as its genome covered by a protein shell"}, {"url": "http://www.webmd.com/hepatitis/hepa-guide/hepatitis-a-topic-overview", "passage_text": "Hepatitis A is a virus that can infect the liver. In most cases, the infection goes away on its own and doesn't lead to long-term liver problems. In rare cases, it can be more serious. Other viruses (hepatitis B and hepatitis C) also can cause hepatitis. Hepatitis A is the most common type. "}, {"url": "http://hepc.liverfoundation.org/what-is-hepatitis-c/", "passage_text": "Hepatitis C is a disease caused by a virus that infects the liver. The virus, called the Hepatitis C virus or HCV for short, is just one of the hepatitis viruses. The other common hepatitis viruses are A and B, which differ somewhat from HCV in the way they are spread and treated. "}, {"url": "http://www.cdc.gov/vaccines/hcp/vis/vis-statements/hep-a.html", "passage_text": "Hepatitis A is a serious liver disease caused by the hepatitis A virus (HAV). HAV is found in the stool of people with hepatitis A. It is usually spread by close personal contact and sometimes by eating food or drinking water containing HAV. "}, {"url": "http://www.medicinenet.com/hepatitis_a/article.htm", "passage_text": "Hepatitis A is a virus, or infection, that causes liver disease and inflammation of the liver. Viruses can cause sickness. For example, the flu is caused by a virus. People can pass viruses to each other. Inflammation is swelling that occurs when tissues of the body become injured or infected. 1 Hepatitis A is an inflammatory disease of the liver caused by a virus. 2  The liver stores nutrients and vitamins, helps digest foods, helps prevent infections, and helps remove harmful substances from blood."}]