[{"url": "http://www.tourism.net.nz/new-zealand/about-new-zealand/colonisation.html", "passage_text": "Before 1840, there were about 2000 Pakeha (Europeans) in New Zealand, most living in the Bay of Islands. At this time, intertribal Maori warfare was frequent, and the arrival of guns, which Maori traded from Pakeha, made it deadly. With growing numbers of British migrants, and a dwindling and largely landless Maori population, British culture dominated New Zealand life throughout the 19 th and first half of the 20 th centuries. However, since World War II, New Zealand has moved towards its own unique national identity and place in the world."}, {"url": "http://www.newzealand.com/int/history/", "passage_text": "Māori were the first to arrive in New Zealand, journeying in canoes from Hawaiki about 1,000 years ago. A Dutchman, Abel Tasman, was the first European to sight the country but it was the British who made New Zealand part of their empire. In 1840, the Treaty of Waitangi was signed, an agreement between the British Crown and Maori."}, {"url": "http://www.answers.com/Q/New_zealand_was_colonized_by", "passage_text": "New Zealand is a westernised first-world country, located 1250 miles southeast of Australia, in the south-western Pacific Ocean. It is made up of two main islands and a number … of smaller ones. The indigenous people of New Zealand settled around 1000 years ago; they are called the Maori, who named the islands Aotearoa. The country was founded by the Treaty of Waitangi between Maori and Pakeha (non-Maori, represented by the British Crown) which was signed on the 4th of February, 1840. "}, {"url": "http://www.teara.govt.nz/en/australia-and-new-zealand/page-1", "passage_text": "Early history. Australia and New Zealand had quite separate indigenous histories, settled at different times by very different peoples – Australia from Indonesia or New Guinea around 50,000 years ago, New Zealand from islands in the tropical Pacific around 1250–1300 AD. Australia and New Zealand were both colonised by Britain. New South Wales was the mother colony for New Zealand as well as for eastern Australia. Māori were involved from the start in shaping trans-Tasman relations."}, {"url": "https://en.wikipedia.org/wiki/Colony_of_New_Zealand", "passage_text": "The Colony of New Zealand was a British colony that existed in New Zealand from 1841 to 1907. Originally a Crown colony under a Governor appointed by the United Kingdom, the colony became self-governing from 1853. In 1907, the colony became the Dominion of New Zealand. "}, {"url": "https://en.wikipedia.org/wiki/History_of_New_Zealand", "passage_text": "The history of New Zealand dates back at least 700 years to when it was discovered and settled by Polynesians, who developed a distinct Māori culture centred on kinship links and land. The first European explorer to sight New Zealand was Abel Janszoon Tasman on 13 December 1642. Captain James Cook, who reached New Zealand in October 1769 on the first of his three voyages, was the first European explorer to circumnavigate and map New Zealand. From the late 18th century, the country was regularly visited by explorers and other sailors, missionaries, traders and adventurers. The country's economy suffered in the aftermath of the 1973 global energy crisis, the loss of New Zealand's biggest export market upon Britain's entry to the European Economic Community, and rampant inflation."}, {"url": "http://www.tourism.net.nz/new-zealand/about-new-zealand/colonisation.html", "passage_text": "First to discover New Zealand in 1642, Abel Tasman annexed the country for Holland under the name of 'Staten Landt' (later changed to 'New Zealand' by Dutch mapmakers). Sailing up the country's West Coast, Tasman's first contact with Maori was at the top of the South Island in what is now called Golden Bay. With growing numbers of British migrants, and a dwindling and largely landless Maori population, British culture dominated New Zealand life throughout the 19 th and first half of the 20 th centuries. However, since World War II, New Zealand has moved towards its own unique national identity and place in the world."}, {"url": "http://www.tourism.net.nz/new-zealand/about-new-zealand/colonisation.html", "passage_text": "New Zealand Colonisation. Though a Dutchman was the first European to sight the country, it was the British who colonised New Zealand. With growing numbers of British migrants, and a dwindling and largely landless Maori population, British culture dominated New Zealand life throughout the 19 th and first half of the 20 th centuries. However, since World War II, New Zealand has moved towards its own unique national identity and place in the world."}, {"url": "http://www.history-nz.org/colonisation.html", "passage_text": "De Thierry had plans for the systematic colonisation of New Zealand, similar to those ideas of Edward Gibbon Wakefield. It was not until 1837, 15 years later, that de Thierry arrived in New Zealand to claim his land. During this long lapse of time the M&#257ori chiefs from Hokianga had sold portions of de Thierry's land to other Europeans, who settled the land and thus brought economic opportunities to the local people."}, {"url": "https://en.wikipedia.org/wiki/History_of_New_Zealand", "passage_text": "From the 1890s the New Zealand parliament enacted a number of progressive initiatives, including women's suffrage and old age pensions. The country remained an enthusiastic member of the British Empire, and 110,000 men fought in World War I (see New Zealand Expeditionary Force). The country's economy suffered in the aftermath of the 1973 global energy crisis, the loss of New Zealand's biggest export market upon Britain's entry to the European Economic Community, and rampant inflation."}]