[{"url": "http://www.imdb.com/name/nm0060259/bio", "passage_text": "Mini Bio (1). Shirley Bassey was born in Tiger Bay, Cardiff, Wales, and raised in the nearby working class neighborhood of Splott. Her mother was originally from Yorkshire, and her father was a Nigerian seaman who left the family when she was less than two. She later helped to support her family by working in an Enamelware factory. She made her professional debut at 16 appearing in a touring revue Memories of Al Jolson . Her first major hit was The Banana Boat Song, and she later sang Goldfinger in the James Bond movie Goldfinger (1964). Her younger daughter died of drowning in 1985. She currently lives in Monte Carl"}, {"url": "https://en.wikipedia.org/wiki/Shirley_Bassey", "passage_text": "In the US, in particular, she is best known for recording the theme songs to the James Bond films Goldfinger (1964), Diamonds Are Forever (1971), and Moonraker (1979). In 2000, Bassey was made a Dame by Queen Elizabeth II for services to the performing arts. Shirley Veronica Bassey was the sixth and last child of Henry Bassey and Eliza Jane Start and was born in Tiger Bay, Cardiff, Wales, of paternal Nigerian and maternal English descent. Two of her mother's four children from previous relationships lived in the Bassey household."}, {"url": "http://www.cnn.com/2015/09/08/entertainment/gallery/james-bond-theme-song-singers/index.html", "passage_text": "Shirley Bassey, perhaps the most iconic Bond theme-song singer, sang the title theme to 1964's Goldfinger.. Bassey brought her strong, distinctive voice back to the series in title tunes for 1971's Diamonds Are Forever and 1979's Moonraker.. "}, {"url": "http://www.songfacts.com/detail.php?id=6089", "passage_text": "Anthony Newley and Leslie Bricusse wrote the lyrics and John Barry the music. It was Shirley Bassey's biggest hit. On Shirley Bassey's website, she says about Goldfinger: John Barry wrote the music. We were touring in England at the time and he was conducting for me. One day he said, 'There is this new song for the James Bond film Goldfinger and we'd like you to do it. "}, {"url": "http://www.youtube.com/watch?v=-orFtcORyuM", "passage_text": "ABOUT the song, Goldfinger: Goldfinger was the title song from the 1964 James Bond film Goldfinger. Composed by John Barry and with lyrics by Leslie Bricusse and Anthony Newley, the song was performed by Shirley Bassey for the film's opening and closing title sequences, as well as the soundtrack album release. Shirley recorded two versions of this song. She recorded the soundtrack to the movie, 'Goldfinger' and then she recorded a version to be sold as a 'single.' Both versions are superb, but I believe she holds that big last note longer here, on the 'Single' version! Simply amazing!"}, {"url": "http://www.rollingstone.com/music/lists/the-top-10-james-bond-theme-songs-20121005/shirley-bassey-goldfinger-1964-19691231", "passage_text": "Harry Hammond/V&A Images/Getty Images. Shirley Bassey already had a number of U.K. hits under her belt when she sang Goldfinger, but the Bond theme became her first true international hit. This song and Diamonds are Forever became so famous that she had a hard time establishing a separate pop career outside of England. "}, {"url": "https://en.wikipedia.org/wiki/Goldfinger_(song)", "passage_text": "Upon being asked to create a theme song for the film-in-progress, Bricusse and Newley looked at each other and sang out: Goldfinger. . . wider than a mile, to the melody of  Moon River , the successful theme song from Breakfast at Tiffany's. John Barry reacted badly. He hated it, saying That's the worst *** song I've ever heard in my *** life (Saltzman would also dislike Bassey's subsequent Bond theme, that for Diamonds Are Forever). However time constraints did not allow for the possibility of a replacement Goldfinger theme song being written and recorded."}, {"url": "https://en.wikipedia.org/wiki/Goldfinger_(song)", "passage_text": "Goldfinger  was the title song from the 1964 James Bond film Goldfinger. Composed by John Barry and with lyrics by Leslie Bricusse and Anthony Newley, the song was performed by Shirley Bassey for the film's opening and closing title sequences, as well as the soundtrack album release. He hated it, saying That's the worst *** song I've ever heard in my *** life (Saltzman would also dislike Bassey's subsequent Bond theme, that for Diamonds Are Forever). However time constraints did not allow for the possibility of a replacement Goldfinger theme song being written and recorded."}, {"url": "http://www.last.fm/music/Shirley+Bassey/_/Goldfinger", "passage_text": "+165 other releases. read more. Goldfinger was the title song from the 1964 James Bond film Goldfinger. Composed by John Barry with lyrics by Leslie Bricusse and Anthony Newley, the song was performed by Shirley Bassey for the film's opening and closing title sequences, as well as the soundtrack album release. "}]