[{"url": "https://answers.yahoo.com/question/index?qid=20070605001949AAHRnhz", "passage_text": "Report Abuse. You need to check out this video on how to increase your credit score by using a 100% legal loophole. Here is the video URL: http://www.creditscoresecret.org I was able to get to 595 from 489 in just one day and from 489 to 748 in just a few week; that's pretty fast in my book. Good luck! "}, {"url": "http://www.bankrate.com/finance/credit-cards/7-steps-to-spring-clean-your-credit-report-1.aspx", "passage_text": "Just as you regularly tidy and reorganize your closets and garage, you should make sure to clean up your credit report. Your credit history is the foundation to financial stability. The information in your credit report is what scoring companies such as FICO use to generate your credit score, which governs everything from how much you pay for a loan -- or if you can get a loan at all -- to your insurance rates. Good news: You can get your credit report for free at myBankrate. "}, {"url": "https://www.annualcreditreport.com/", "passage_text": "FREE Credit Reports. 1  Get a free copy of your credit report every 12 months from each credit reporting company. 2  Ensure that the information on all of your credit reports is correct and up to date. "}, {"url": "http://www.homebuyinginstitute.com/mortgage/clean-credit-report-165/", "passage_text": "So you request a free copy from Experian, TransUnion and Equifax. On your TransUnion report, you notice a 30-day late payment that’s not yours. It relates to a retail account for a store you’ve never even visited before. This might be a computer data mix-up, or a case of identity theft. So when you attempt to clean up your credit report, just remember that you may need to do it three times. It’s possible to find an erroneous entry on just one of your reports, but not the other two. In other cases, you’ll have to clean up certain items on all three reports."}, {"url": "http://www.wikihow.com/Get-Your-Credit-Report-for-Free", "passage_text": "6. Request a credit report by phone or mail. If you're not the internet type, there are two other ways to request your free annual credit report: 1  By phone – To request that your report be mailed to you by phone, call 1-877-322-8228 and ask for a copy of your report from each of the three reporting agencies. Go to annualcreditreport.com. This is the website set up by the three credit reporting agencies – Equifax, TransUnion, and Experian – to allow customers to easily request a credit report. This is the only site authorized to issue free credit reports, so be sure to use it, and not other “impostor” sites."}, {"url": "http://www.usatoday.com/story/money/personalfinance/2012/10/03/improving-your-credit-report/1610571/", "passage_text": "Cleaning up your credit: Three nationwide consumer credit reporting companies — Equifax, Experian and TransUnion — must provide free copies of your credit report once every 12 months. But consumers must take action to get their reports. See www.annualcreditreport.com or call 877-322-8228 to order a free annual report. Your Money: Cleaning up your credit report. I heard from a mother the other day who wanted to know if there was any way her daughter could get rid of some bad blemishes on he"}, {"url": "http://www.consumerfinance.gov/askcfpb/311/how-do-i-get-a-copy-of-my-credit-report.html", "passage_text": "Visit AnnualCreditReport.com to get a free copy of your credit report from each of the nationwide credit reporting companies. You can receive a free credit report from each reporting company once every 12 months. You can also order your free credit report: 1  By phone: Call (877) 322-8228. 2  By mail: Download and complete the Annual Credit Report Request Form and mail it to: 3  Annual Credit Report Request Service. 4  P.O. 5  Box 105281. Other sites give you a free report and then bill you for services you have to cancel. To get the free credit report authorized by law, go to AnnualCreditReport.com or call (877) 322-8228. Tip: If you have a problem with credit reporting, you can submit a complaint with the CFPB online."}, {"url": "http://www.nolo.com/legal-encyclopedia/clean-up-credit-report-how-to-30017.html", "passage_text": "Step Four: Send a Dispute Letter to the Credit Reporting Agency. Then, send a detailed letter to the CRA, detailing what is wrong and why, and including suporting document. For details on how to do this, see How to Clean Up Your Credit Report. You'll have to send the letter directly to the CRA. Use the particular address the CRA sets forth for these dispute letters. You can find those addresses on the CRAs' website: 1  Equifax -- www.equifax.com. 2  TransUnion LLC -- www.transunion.com. Cleaning up your credit report means getting rid of inaccurate information, outdated information, or fixing anything that is not correct. It does not mean getting rid of delinquent accounts that are, in fact, delinquent. Or getting rid of anything else that has a legitimate right to be on your report."}, {"url": "http://www.youtube.com/watch?v=6GTjVl9a47Y", "passage_text": "Don't fall victim to this, learn how to remove collections from a credit report for free now and start fixing collections on your credit history forever. This is your financial report card. Make it the best it can be now, so that your credit history has time to heal before your next loan application. Always be prepared! and watch How to remove collections from a credit report for free today! Subscribe = http://www.youtube.com/subscription_c... For more free information on credit and credit scoring check out my blog at http://www.thecreditguy.tv. Google + http://www.google.com/+DaveSullivanth... "}]