[{"url": "https://en.wikipedia.org/wiki/Corn_construction", "passage_text": "The silk is combined with other parts of the corn plant to be used as part of animal feed, silage, and fuels. Husks are made into dolls and used as filling materials. The stalk is used to make paper, wallboard, silage, syrup, and rayon (artificial silk).."}, {"url": "http://botany.about.com/od/PlantAnatomyAndMorphology/a/The-Anatomy-Of-Corn.htm", "passage_text": "The tassel and the corn ears are responsible for reproduction and formation of the corn kernels. The tassel is the male part of the plant, which emerges from the top of the plant after all of the leaves have developed. Many male flowers are on the tassel."}, {"url": "http://kids.britannica.com/comptons/art-53137/At-the-top-of-a-mature-corn-plant-is-the", "passage_text": "corn: parts of a corn plant. At the top of a mature corn plant is the tassel, the male part of the plant. Along the stalk are the leaves and the ears of corn, wrapped closely in husks. Hundreds of filaments, called silk, protrude from the top of each ear. These filaments are the female flowers."}, {"url": "http://www.answers.com/Q/What_part_of_the_plant_is_the_corn", "passage_text": "Corn is what the entire plant is called. What you're probably thinking about is the part we eat. This is the seed, know in corn plants as the kernel (pronounced as it is spelled), and is located on the at the top of the plant on what most people call the cob. The cob is surrounded by a husk (really fibrous leaves) that protect it as it is growing."}, {"url": "http://www.answers.com/Q/What_are_the_parts_of_a_corn_plant", "passage_text": "Corn is what the entire plant is called. What you're probably thinking about is the part we eat. This is the seed, know in corn plants as the kernel (pronounced as it is spell … ed), and is located on the at the top of the plant on what most people call the cob."}, {"url": "http://www.answers.com/Q/What_part_of_the_plant_is_the_corn", "passage_text": "Most corn plants have a single stem, called a stalk, which grows  vertically upward from the ground. The height of the stalk depends  both on the variety of the corn and the … environment in which a corn  plant is grown. As the stalk grows, leaves emerge."}]