[{"url": "http://www.gamewinners.com/Cheats/index.php/Pokemon_Shuffle", "passage_text": "Extra stages. Earn the indicated number of S ranks to unlock the corresponding EX stage. They feature special Pokemon to catch and have different rules, such as time limits. To access them, tap the Extra option at the bottom left of the touch screen. To return to the normal stage selection screen, tap Main. Note: Earning S ranks on the Extra stages will not count towards your total"}, {"url": "http://www.cheatcodes.com/pokemon-shuffle-android/", "passage_text": "Get the latest Pokemon Shuffle cheats, codes, unlockables, hints, Easter eggs, glitches, tips, tricks, hacks, downloads, hints, guides, FAQs, walkthroughs, and more for Android (Android). "}, {"url": "http://www.cheatcodes.com/pokemon-shuffle-iphone/", "passage_text": "Get the latest Pokemon Shuffle cheats, codes, unlockables, hints, Easter eggs, glitches, tips, tricks, hacks, downloads, achievements, guides, FAQs, walkthroughs, and more for iPhone (iOS). CheatCodes.com has all you need to win every game you play! "}, {"url": "http://www.ign.com/cheats/games/pokemon-shuffle-3ds-20030062", "passage_text": "EX Stages. Earn S-Ranks on the standard stages and as you do, you'll gain access to special EX stages (see below for a list of the stages you will unlock at each milestone). In the EX stages, you can follow special rules to potentially earn the special Pokemon listed. 1  Stage EX-01 (Absol) - 5 S-Ranks. 2 Unlockables. Submitted by: ign_cheats. Earn S-Ranks on the standard stages and as you do, you'll gain access to special EX stages (see below for a list of the stages you will unlock at each milestone). In the EX stages, you can follow special rules to potentially earn the special Pokemon listed"}, {"url": "http://gamewise.co/games/55467/Pokemon-Shuffle/Cheats", "passage_text": "Pokemon Shuffle Cheats and Codes. Welcome to the Pokemon Shuffle Cheats and Codes page where our team of contributors will help you with a set of cheats, codes, hints, hacks, tips and unlockables. Pokemon Shuffle Overview. Pokemon Shuffle is a free-to-play puzzle game developed by Genius Sonority and published by Nintendo for the Nintendo 3DS. Pokemon Shuffle is a match-three puzzle game starring pokemon. The object of the game is to match three identical pokemon to remove them from play."}, {"url": "http://gamewise.co/games/55467/Pokemon-Shuffle/Cheats", "passage_text": "Pokemon Shuffle-Cheats. Welcome to the Pokemon Shuffle Cheats and Codes page where our team of contributors will help you with a set of cheats, codes, hints, hacks, tips and unlockables. Pokemon Shuffle Overview. Pokemon Shuffle is a free-to-play puzzle game developed by Genius Sonority and published by Nintendo for the Nintendo 3DS. Pokemon Shuffle is a match-three puzzle game starring pokemon. The object of the game is to match three identical pokemon to remove them from play."}, {"url": "http://www.gamerevolution.com/cheats/pokemon-shuffle", "passage_text": "Mew is available in Pokemon Shuffle from launch through March 8, 2015, as part of the first event, but there are no guarantees you'll be able to capture one before the event concludes. "}, {"url": "http://www.slidetoplay.com/pokemon-shuffle-tips-tricks-hints-and-cheats/", "passage_text": "Pokemon Shuffle Tips, Tricks, Hints, and Cheats. When choosing your support Pokemon, pokémon the game will give you clues as to which of Your pokemon pokémon will do more or less damage against the enemy you are about. to fight Fansided has published some great tips and tricks on getting the most out of Pokemon Shuffle. Like this:"}, {"url": "http://www.ign.com/wikis/pokemon-shuffle/Cheats_and_Secrets", "passage_text": "Cheats and Secrets. Edit Page Last Edit: 4 months 20 days ago. IGN's Pokemon Shuffle cheats and secrets guide gives you the inside scoop into every cheat, hidden code, helpful glitch, exploit, and secret in Pokemon Shuffle. This cheats and secrets page is a stub. Make it more useful by clicking the Edit button and adding your own text, pictures, and videos! "}]