[{"url": "http://ieer.org/resource/factsheets/plutonium-factsheet/", "passage_text": "Physical, Nuclear, and Chemical Properties of Plutonium. Plutonium-239 is one of the two fissile materials used for the production of nuclear weapons and in some nuclear reactors as a source of energy. The other fissile material is uranium-235. Plutonium-239 is virtually nonexistent in nature. It is made by bombarding uranium-238 with neutrons in a nuclear reactor. Plutonium-238, which is made in nuclear reactors from neptunium-237, is used to make compact thermoelectric generators; plutonium-239 is used for nuclear weapons and for energy; plutonium-241, although fissile, (see next paragraph) is impractical both as a nuclear fuel and a material for nuclear warheads."}, {"url": "https://en.wikipedia.org/wiki/Plutonium", "passage_text": "Plutonium is a transuranic radioactive chemical element with symbol Pu and atomic number 94. It is an actinide metal of silvery-gray appearance that tarnishes when exposed to air, and forms a dull coating when oxidized. The element normally exhibits six allotropes and four oxidation states. Plutonium-238 has a half-life of 88 years and emits alpha particles. It is a heat source in radioisotope thermoelectric generators, which are used to power some spacecraft. Plutonium isotopes are expensive and inconvenient to separate, so particular isotopes are usually manufactured in specialized reactor"}, {"url": "https://en.wikipedia.org/wiki/Plutonium", "passage_text": "Both plutonium-239 and plutonium-241 are fissile, meaning that they can sustain a nuclear chain reaction, leading to applications in nuclear weapons and nuclear reactors. Plutonium-240 exhibits a high rate of spontaneous fission, raising the neutron flux of any sample containing it. Plutonium-238 has a half-life of 88 years and emits alpha particles. It is a heat source in radioisotope thermoelectric generators, which are used to power some spacecraft. Plutonium isotopes are expensive and inconvenient to separate, so particular isotopes are usually manufactured in specialized reactors"}, {"url": "http://www.wisegeek.com/what-is-plutonium.htm", "passage_text": "Plutonium is a metallic chemical element classified among the actinides on the periodic table of elements. This highly radioactive element is used primarily in weapons and nuclear power plants, and it has become somewhat well known because of these uses. On the periodic table of elements, plutonium is identified with the symbol Pu and the atomic number 94. Credit for the discovery of the element is usually given to a team of scientists at the University of California, Berkeley, who uncovered it in 1940 while studying the properties of uranium."}, {"url": "http://www.answers.com/Q/How_is_plutonium_made", "passage_text": "Plutonium is used to make nuclear weapons and nuclear fuel. Plutonium was first produced by Glenn T. Seaborg, Joseph W. Kennedy, Edward M. McMillan and Arthur C. Wohl by bom … barding an isotope of uranium, uranium-238, with deuterons that had been accelerated in a device called a cyclotron. It is a fissile element used in most modern nuclear weapons. The most significant isotope of plutonium is 239Pu, with a half-life of 24,100 years. It can be made from natural uranium."}]