[{"url": "http://traveltips.usatoday.com/passport-ohio-105885.html", "passage_text": "1 Applicants who need their passports guaranteed in 14 days or less must apply in person at a regional passport agency. 2  The closest agencies to Ohio are the Detroit Passport Agency at 211 W. Fort St. and the Philadelphia Passport Agency at 200 Chestnut St., Room 103. 3  Call 877-487-2778 for an appointment. Before heading out on an international vacation, people who live in Ohio can apply for a passport from one of the hundreds of acceptance facilities situated throughout the state."}, {"url": "http://www.uspassporthelpguide.com/passport/ohio/passport-offices-in-hamilton-county-ohio/", "passage_text": "Passport Offices in Hamilton County. Hamilton County applicants looking to find a passport offices in Ohio would need to visit any of the 16 locations official US passport acceptance facilities located in Hamilton County. Ohio state has a total of 88 passport acceptance offices that you would be able to obtain a passport. The passport agent in Hamilton County would be able give you the passport form and witness your signature to obtain a passport."}, {"url": "http://www.us-passport-service-guide.com/cincinnati-passport.html", "passage_text": "Cincinnati Passport-Where to Apply for a Passport in Cincinnati, OH. Cincinnati passport facilities can be found in several locations throughout the city. New passport application Form DS-11 can be submitted at a nearby passport application acceptance facility so that an agent can administer an oath, witness the signing of the form and seal it with your supporting documents in an envelope."}, {"url": "http://www.us-passport-service-guide.com/ohio-passport-acceptance-facility-list.html", "passage_text": "Ohio has over 300 passport acceptance facilities where American citizens can apply for new passports. If none is available where you live, you will be directed to one in a neighboring city. "}, {"url": "https://www.usps.com/international/passports.htm", "passage_text": "1 Renew Your Passport Renew by Mail You can renew your passport by mail with application DS-82 if you meet the criteria listed on the U.S. Department of State web site. 2  Renew by Mail Checklist You can also renew your passport by bringing your prepared renewal application to a Post Office™ location. Get a Passport in a Hurry. Priority Mail Express. 1 "}, {"url": "http://www.us-passport-service-guide.com/cincinnati-passport.html", "passage_text": "5136611033. You can submit the application for a passport at the regional processing center if you have urgent travel plans. If you are unable to travel from Cincinnati to the regional agency, you can have a registered expediting service submit the application for expedited passport service. New passport application Form DS-11 can be submitted at a nearby passport application acceptance facility so that an agent can administer an oath, witness the signing of the form and seal it with your supporting documents in an envelope."}, {"url": "http://www.us-passport-service-guide.com/cincinnati-passport.html", "passage_text": "A couple of other options availabe to residents of Cincinnati who want to apply for a passport are the regional agency and private expediting services. Below is a list of locations where you can submit a passport application if you live in Cincinnati, Ohio. New passport application Form DS-11 can be submitted at a nearby passport application acceptance facility so that an agent can administer an oath, witness the signing of the form and seal it with your supporting documents in an envelope."}, {"url": "http://www.uspassporthelpguide.com/passport/ohio/passport-offices-in-butler-county-ohio/", "passage_text": "Passport Offices in Butler County. Butler County applicants looking to find a passport offices in Ohio would need to visit any of the 13 locations official US passport acceptance facilities located in Butler County. Ohio state has a total of 88 passport acceptance offices that you would be able to obtain a passport. The passport agent in Butler County would be able give you the passport form and witness your signature to obtain a passport. Passport acceptance agents at the Butler Offices require an appointment so you will have to call the postal office for an appointment."}]