[{"url": "http://www.answers.com/Q/What_is_the_average_cost_of_land_per_acre_in_Georgia", "passage_text": "The average price for land in Mississippi varies based upon what  type of land you are interested in. The average range from simple  land to land which is rich with timber i … s between $800 and $3,000  an acre. Answered. In Colonial America. What is the average cost of an acre of land in San Jose California? Depending on the area, the cost of an acre of land in San Jose, CA  is about $400,000 to $900,000."}, {"url": "http://www.trulia.com/real_estate/Atlanta-Georgia/market-trends/", "passage_text": "Summary for Atlanta. The median sales price for homes in Atlanta GA for Jul 15 to Oct 15 was $255,000. This represents a decline of 2.7%, or $7,000, compared to the prior quarter and an increase of 6.2% compared to the prior year. Sales prices have appreciated 64% over the last 5 years in Atlanta. Average price per square foot for Atlanta GA was $183, an increase of 7.6% compared to the same period last year. Popular neighborhoods in Atlanta include Midtown, North Buckhead, Morningside-Lenox Park, Kirkwood, Downtown, and Grant Park"}, {"url": "http://www.zillow.com/atlanta-ga/home-values/", "passage_text": "The median home value in Atlanta is $175,700. Atlanta home values have gone up 11.0% over the past year and Zillow predicts they will rise 5.5% within the next year. The median rent price in Atlanta is $1,200, which is the same as the Atlanta Metro median of $1,200. Read more. Mortgage delinquency is the first step in the foreclosure process."}, {"url": "http://www.loopnet.com/Atlanta_Georgia_Market-Trends", "passage_text": "The average asking rental rate per sq ft/year for Industrial properties in Atlanta, GA as of Aug 15 was $5.84. This represents an increase of 5.9% compared to the prior 3 months, with an increase of +13.4% year-over-year. -17.0%. The average asking rental rate per sq ft/year for Retail Commercial properties in Atlanta, GA as of Aug 15 was $16.31. This represents a decrease of -6.1% compared to the prior 3 months, with a decrease of -17.0% year-over-year."}, {"url": "http://www.loopnet.com/Atlanta_Georgia_Market-Trends", "passage_text": "Current Atlanta market trends data indicates an increase of +8.5% in the median asking price per sq ft for Office properties compared to the prior 3 months, with an increase of +15.1% compared to last year's prices. -17.0%. The average asking rental rate per sq ft/year for Retail Commercial properties in Atlanta, GA as of Aug 15 was $16.31. This represents a decrease of -6.1% compared to the prior 3 months, with a decrease of -17.0% year-over-year."}, {"url": "http://www.loopnet.com/Atlanta_Georgia_Market-Trends", "passage_text": "Current Atlanta market trends data indicates an increase of +3.4% in the median asking price per sq ft for Retail Commercial properties compared to the prior 3 months, with an increase of +3.2% compared to last year's prices. -17.0%. The average asking rental rate per sq ft/year for Retail Commercial properties in Atlanta, GA as of Aug 15 was $16.31. This represents a decrease of -6.1% compared to the prior 3 months, with a decrease of -17.0% year-over-year."}, {"url": "http://www.lincolninst.edu/subcenters/land-values/metro-area-land-prices.asp", "passage_text": "Land Prices for 46 Metro Areas. The data provided here contain estimates of the average value of housing, land, and structures, and price indexes for land and housing, for the average single-family detached owner-occupied housing unit in each of 46 large metropolitan areas in the United States."}]