[{"url": "http://www.thefreedictionary.com/muscle+fiber", "passage_text": "Noun. 1. muscle fiber-an elongated contractile cell that forms the muscles of the body. muscle cell, muscle fibre. fibre, fiber-any of several elongated, threadlike cells (especially a muscle fiber or a nerve fiber). muscle, musculus-one of the contractile organs of the body. 1. muscle fiber-an elongated contractile cell that forms the muscles of the body. muscle cell, muscle fibre. fibre, fiber-any of several elongated, threadlike cells (especially a muscle fiber or a nerve fiber)"}, {"url": "https://en.wikipedia.org/wiki/Skeletal_striated_muscle", "passage_text": "Skeletal muscle is made up of individual muscle cells or myocytes, known as muscle fibers. They are formed from the fusion of developmental myoblasts (a type of embryonic progenitor cell that gives rise to a muscle cell) in a process known as myogenesis. Muscle fibres are cylindrical, and multinucleated. Muscle fibers are in turn composed of myofibrils. The myofibrils are composed of actin and myosin filaments, repeated in units called sarcomeres, the basic functional units of the muscle fiber. The sarcomere is responsible for the striated appearance of skeletal muscle, and forms the basic machinery necessary for muscle contraction."}, {"url": "http://www.ivyroses.com/HumanBody/Muscles/Muscle_Cell.php", "passage_text": "1 The nuclei of muscle fibres ( muscle cells ) are located at the edges of the diameter of the fibre, adjacent to the sarcolemma. 2  As illustrated, a single muscle fibre may have many nuclei. 3  Cytoplasm is present in all living cells. 4  The cytoplasm present is muscle fibres (muscle cells) is called sarcoplasm. 1 Each muscle fibre ( muscle cell ) is covered by a plasma membrane sheath which is called the sarcolemma. 2  Tunnel-like extensions from the sarcolemma pass through the muscle fibre from one side of it to the other in transverse sections through the diameter of the fibre."}, {"url": "https://en.wikipedia.org/wiki/Muscle", "passage_text": "Muscle is a soft tissue found in most animals. Muscle cells contain protein filaments of actin and myosin that slide past one another, producing a contraction that changes both the length and the shape of the cell. Muscles function to produce force and motion. 1 Type I, slow twitch, or red muscle, is dense with capillaries and is rich in mitochondria and myoglobin, giving the muscle tissue its characteristic red color. 2  It can carry more oxygen and sustain aerobic activity using fats or carbohydrates as fuel."}, {"url": "http://www.teachpe.com/anatomy/fibre_types.php", "passage_text": "Within skeletal muscle there are three types of fiber: Type I. Type I fibers are also known as slow twitch fibers. They are red in colour due to the presence of large volumes of myoglobin and so oxygen and high numbers of Mitochondria. For this reason the muscles containing mainly type I fibers are often postural muscles such as those in the neck and spine due to their endurance capabilities Also, athletes such as marathon runners have a high number of this type of fiber, partly through genetics, partly through training. Type IIa."}, {"url": "http://www.ptdirect.com/training-design/anatomy-and-physiology/skeletal-muscle-2013-anatomy-and-fiber-types", "passage_text": "Characteristics of muscle fibre types. As we know there are three types of skeletal muscle fibre and they each have different capacities to produce force, different fatigue rates and rely on different energy systems in order to function. The reason for these differences is due to their individual characteristics. Each muscle fibre consists of many contractile units called myofibrils which run the length of each muscle fibre. Individual muscle fibres are wrapped with fascia and then further bound together by more fascia into bundles called fascicules."}, {"url": "https://en.wikipedia.org/wiki/Skeletal_striated_muscle", "passage_text": "Skeletal muscle is a form of striated muscle tissue which is under the voluntary control of the somatic nervous system. It is one of three major muscle types, the others being cardiac muscle and smooth muscle. Most skeletal muscles are attached to bones by bundles of collagen fibers known as tendons. The myofibrils are composed of actin and myosin filaments, repeated in units called sarcomeres, the basic functional units of the muscle fiber. The sarcomere is responsible for the striated appearance of skeletal muscle, and forms the basic machinery necessary for muscle contraction."}]