[{"url": "https://en.wikipedia.org/wiki/Household_income_in_the_United_States", "passage_text": "According to the US Census Bureau persons with doctorates in the United States had an average income of roughly $81,400. The average for an advanced degree was $72,824 with men averaging $90,761 and women averaging $50,756 annually. 1 In 2013, real median household income was 8.0 percent lower than in 2007, the year before the latest recession. 2  Real median household income averaged $50,781 from 1964-2013, ranging from a low of $43,558 in 1967 to a high of $56,895 in 1999."}, {"url": "https://en.wikipedia.org/wiki/Household_income_in_the_United_States", "passage_text": "Overall, the mean household income in the United States, according to the US Census Bureau 2014 Annual Social and Economic Supplement, was $72,641, or $20,702 (39.86%) higher than the median household income ($51,939). 1 In 2013, real median household income was 8.0 percent lower than in 2007, the year before the latest recession. 2  Real median household income averaged $50,781 from 1964-2013, ranging from a low of $43,558 in 1967 to a high of $56,895 in 1999."}, {"url": "https://en.wikipedia.org/wiki/Household_income_in_the_United_States", "passage_text": "In 2007, all households in the United States earned roughly $7.723 trillion. One half, 49.98%, of all income in the US was earned by households with an income over $100,000, the top twenty percent. Over one quarter, 28.5%, of all income was earned by the top 8%, those households earning more than $150,000 a year. 1 In 2013, real median household income was 8.0 percent lower than in 2007, the year before the latest recession. 2  Real median household income averaged $50,781 from 1964-2013, ranging from a low of $43,558 in 1967 to a high of $56,895 in 1999."}, {"url": "http://www.mybudget360.com/how-much-do-americans-earn-what-is-the-average-us-income/", "passage_text": "The average US income is a less useful measure because it is skewed by high income households and mega income earners. According to Social Security tax records for 2011 you have 93 Americans making more than $50,000,000 with average earnings of $79,000,000+. "}, {"url": "http://www.ssa.gov/OACT/COLA/AWI.html", "passage_text": "To determine the national average wage index for 2013 at a level that is consistent with the national average wage indexing series for prior years, we multiply the 2012 national average wage index of 44,321.67 by the percentage change in average wages from 2012 to 2013 (based on our tabulated wage data). For retirement, eligibility is at age 62. If a person reaches age 62 in 2015, for example, then 2015 is the person's year of eligibility. We always index an individual's earnings to the average wage level two years prior to the year of first"}, {"url": "https://en.wikipedia.org/wiki/Household_income_in_the_United_States", "passage_text": "One key measure is the real median level, meaning half of households have income above that level and half below, adjusted for inflation. According to the Federal Reserve, this measure was $51,939 in 2013, below the 1999 peak of around $57,000. 1 In 2013, real median household income was 8.0 percent lower than in 2007, the year before the latest recession. 2  Real median household income averaged $50,781 from 1964-2013, ranging from a low of $43,558 in 1967 to a high of $56,895 in 1999."}, {"url": "http://www.fool.com/investing/general/2015/01/18/how-does-your-income-stack-up-against-the-average.aspx", "passage_text": "By the numbers. According to the Bureau of Labor Statistics, the average American worker got paid $24.57 per hour in December, or $850.12 per week. That was up from $24.17 per hour and $829.03 per week a year ago. However, average income can be misleading given that wages differ significantly from industry to industry. For example, utilities employees were the best paid workers in December, earning an average $35.86 per hour, or $1,509.71 per week. "}, {"url": "http://www.averagesalarysurvey.com/united-states", "passage_text": "Average incomes in Florida are $75,000. Average salaries in Michigan and Pennsylvania are $73,000 per annual. By far most paid US city is San Francisco, with average salary about $100,000 per annual. The second largest salaries are in New York City, Washington DC, and Boston, all from $87,000 to $88,000 per annual. United States. The most frequent salary ranges in the US are from 45K to 55K. The 28% of employees earn from 40K to 60K. About 18% earn below the 45K per annual. Please note that data are extracted from our salary polls and those salaries are higher than for entire population."}, {"url": "http://www.ssa.gov/OACT/COLA/AWI.html", "passage_text": "Determination of the National Average Wage Index for 2013. To determine the national average wage index for calendar year 2013, we multiplied the 2012 national average wage index of 44,321.67 by the percentage change in average wages from 2012 to 2013, as measured by annual wage data we tabulated. For retirement, eligibility is at age 62. If a person reaches age 62 in 2015, for example, then 2015 is the person's year of eligibility. We always index an individual's earnings to the average wage level two years prior to the year of first"}]