[{"url": "https://answers.yahoo.com/question/index?qid=20100722085111AAWEJux", "passage_text": "PARAFFIN WAX:Paraffin wax, which is classified as a natural wax, is the most common wax used in candlemaking, and can be said to ultimately come from plant life. In order to protect themselves from adverse weather conditions plants produce a layer of wax on their leaves and stems. You can get wax from bee hives and also from various plant sources. There's a tree that grows around here called the wax myrtle, and if you boil its berries wax floats to the surface of the water. This tree is found all over the east coast of the US. Before that type of wax was discovered, tallow was used."}, {"url": "https://answers.yahoo.com/question/index?qid=20100722085111AAWEJux", "passage_text": "The refinery will process the wax into a clean, clear liquid, or as a solid milky white block, and make it available to companies who may have a use for it.The refined wax is called paraffin, which comes from the Latin parum = few or without and affinis = connection or attraction (affinity). You can get wax from bee hives and also from various plant sources. There's a tree that grows around here called the wax myrtle, and if you boil its berries wax floats to the surface of the water. This tree is found all over the east coast of the US. Before that type of wax was discovered, tallow was used."}, {"url": "http://www.generalwax.com/candle-making/about-candle-wax.php", "passage_text": "The refined wax is called paraffin, which comes from the Latin parum = few or without and affinis = connection or attraction (affinity) . Basically there are few substances that will chemically react with or bind to this type of wax. Beeswax. A less common but more highly renowned wax for candlemaking is beeswax. Classified as a natural wax, it is produced by the honeybee for use in the manufacture of honeycombs. Beeswax is actually a refinement of honey. A female worker bee eats honey, and her body converts the sugar in the honey into wax. The wax is expelled from the bee's body in the form of scales beneath her abdomen"}, {"url": "https://en.wikipedia.org/wiki/Beeswax", "passage_text": "Beeswax (Cera alba) is a natural wax produced by honey bees of the genus Apis. The wax is formed into scales by eight wax-producing glands in the abdominal segments 4 through 7 of worker bees, who discard it in or at the hive. The hive workers collect and use it for comb structural stability, to form cells for honey-storage and larval and pupal comfort and protection within the bee hive."}, {"url": "https://answers.yahoo.com/question/index?qid=20100722085111AAWEJux", "passage_text": "RE: Where does candle wax come from? As I was watching a movie &quot;The Village&quot; which was a group of people leaving modern society and creating their own world solely, based on life in the 1800&#39;s that candles (wax) are derived from a natural source. You can get wax from bee hives and also from various plant sources. There's a tree that grows around here called the wax myrtle, and if you boil its berries wax floats to the surface of the water. This tree is found all over the east coast of the US. Before that type of wax was discovered, tallow was used."}, {"url": "https://answers.yahoo.com/question/index?qid=20061228100819AAB2Dcb", "passage_text": "Your question was probably, where does candle wax come from? They used to boil animal fat in the old days to make candle wax, but I'm sure that there must be sum sort of artificial chemicals they use these days. I know that you can also use bees wax. The refinery will process the wax into a clean, clear liquid, or as a solid milky white block, and make it available to companies who may have a use for it. The refined wax is called paraffin, which comes from the Latin parum = few or without and affinis = connection or attraction (affinity). Basically there are few substances that will chemically react with or bind to this type of wax. BEESWAX A less common but more highly renowned wax for candlemaking is bees"}, {"url": "http://www.generalwax.com/candle-making/about-candle-wax.php", "passage_text": "Paraffin Wax. Paraffin wax, which is classified as a natural wax, is the most common wax used in candlemaking, and can be said to ultimately come from plant life. In order to protect themselves from adverse weather conditions plants produce a layer of wax on their leaves and stems. Beeswax. A less common but more highly renowned wax for candlemaking is beeswax. Classified as a natural wax, it is produced by the honeybee for use in the manufacture of honeycombs. Beeswax is actually a refinement of honey. A female worker bee eats honey, and her body converts the sugar in the honey into wax. The wax is expelled from the bee's body in the form of scales beneath her abdomen"}]