[{"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=14969", "passage_text": "Reservoir of infection: Any person, animal, plant, soil or substance in which an infectious agent normally lives and multiplies. The reservoir typically harbors the infectious agent without injury to itself and serves as a source from which other individuals can be infected. "}, {"url": "http://www.cdc.gov/ophss/csels/dsepd/SS1978/Lesson1/Section10.html", "passage_text": "In direct transmission, an infectious agent is transferred from a reservoir to a susceptible host by direct contact or droplet spread. Direct contact occurs through skin-to-skin contact, kissing, and sexual intercourse. Direct contact also refers to contact with soil or vegetation harboring infectious organisms. Information about dengue fever is provided on the following pages. After studying this information, outline the chain of infection by identifying the reservoir(s), portal(s) of exit, mode(s) of transmission, portal(s) of entry, and factors in host susceptibility."}, {"url": "http://medical-dictionary.thefreedictionary.com/reservoir+host", "passage_text": "the host preferred by a parasite. primary host. definitive host. reservoir host. an animal (or species) that is infected by a parasite, and which serves as a source of infection for humans or another species. host risk factors. epidemiological factors contributing to the development of a disease and which are contributed by the host. reservoir host. n. A host that serves as a source of infection and potential reinfection of humans and as a means of sustaining a parasite when it is not infecting humans."}, {"url": "http://medical-dictionary.thefreedictionary.com/reservoir+host", "passage_text": "reservoir host, a nonhuman host that serves as a means of sustaining an infectious organism as a potential source of human infection. Wild monkeys are reservoir hosts for the yellow fever virus, which can spread from the jungle to infect humans. reservoir host. n. A host that serves as a source of infection and potential reinfection of humans and as a means of sustaining a parasite when it is not infecting humans."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20130502122856AAVCy0o", "passage_text": "Best Answer: Human reservoirs are people with active infections of a communicable disease. Carriers can remain asymptomatic and infective for years, much like AIDS carriers. Some carriers go through the stages of disease while others may never develop illness at all. For each all of the terms write a definition and give examples of an organism that may be found in each reservoir: 1. Human reservoirs, 2."}, {"url": "https://answers.yahoo.com/question/index?qid=20091103085200AAtXE8o", "passage_text": "Best Answer: There are some reservoirs of some diseases. These reservoirs serve as continuing source of disease agents, and are important in perpetuating the disease. In smallpox, the sole reservoir of viruses is humans. "}, {"url": "https://en.wikipedia.org/wiki/Natural_reservoir", "passage_text": "A natural reservoir or nidus (the latter from the Latin word for nest) is the long-term host of a pathogen of an infectious disease. Hosts often do not get the disease carried by the pathogen or it is carried as a subclinical infection and so asymptomatic and non-lethal. Once discovered, natural reservoirs elucidate the complete life cycle of infectious diseases, providing effective prevention and control."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20130502122856AAVCy0o", "passage_text": "What is a Human Reservoirs,animals reservoirs and non-living reservoirs? For each all of the terms write a definition and give examples of an organism that may be found in each reservoir: 1. Human reservoirs, 2. Animal reservoirs, 3."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20130502122856AAVCy0o", "passage_text": "Animal reservoirs are animals that serve as a reservoir of the pathogen, much like a carrier vessel. These pathogens care capable of infecting humans with diseases called zoonoses or zoonotic diseases. Examples are rabies-infected dogs, mad cow disease-infected cattle. For each all of the terms write a definition and give examples of an organism that may be found in each reservoir: 1. Human reservoirs, 2."}, {"url": "http://www.cdc.gov/ophss/csels/dsepd/SS1978/Lesson1/Section10.html", "passage_text": "Reservoir. The reservoir of an infectious agent is the habitat in which the agent normally lives, grows, and multiplies. Reservoirs include humans, animals, and the environment. The reservoir may or may not be the source from which an agent is transferred to a host. Information about dengue fever is provided on the following pages. After studying this information, outline the chain of infection by identifying the reservoir(s), portal(s) of exit, mode(s) of transmission, portal(s) of entry, and factors in host susceptibility."}]