[{"url": "http://www.wisegeek.com/what-are-diatoms.htm", "passage_text": "Diatoms are unicellular algae which form distinct and beautiful cell walls from silica. They are widely distributed throughout the upper layers of the oceans of the world, and can also be found in fresh water or moist environments, such as the undersides of plants. "}, {"url": "http://www.microscopy-uk.org.uk/mag/wimsmall/diadr.html", "passage_text": "Diatoms are delicate unicellular organisms that have a yellow-brown chloroplast that enables them to photosynthesize. Their cell walls are made of silica almost like a glass house. The construction of the cell wall, called the frustule, consists of two valves that fit into each other like a little pill box. "}, {"url": "http://people.westminstercollege.edu/faculty/tharrison/emigration/diatoms.htm", "passage_text": "Diatoms are single celled algae that have two hard coverings of silica, SiO2, (almost identical to opal). [2,3] The two sides are called the epitheca and hypotheca; they fit together like a box and lid or petri dish, the epitheca overlapping the hypotheca. [2]. More than one way to look at a diatom. "}, {"url": "http://www.advbio.cascadeschools.org/00-01/diatomswebfolder/diatoms.html", "passage_text": "Diatoms are a protist (single cell organism) which is part of the family of eucaryotic (Cells that have nuclei) algae. There are two types of diatoms, pennales (pennate shaped), and centrales (circular shaped). Diatoms like all plant cells are photosynthetic, meaning they make their own sucrose (sugar) from light, water, and nutrients. Diatoms use oils to store sugar. The oil also keeps the diatoms afloat"}, {"url": "http://huey.colorado.edu/diatoms/about/diatoms.php", "passage_text": "Algae. Diatoms are single-celled algae found in nearly every aquatic habitat. Their silica (SiO2) walls are one of the features that make them useful as environmental tools in a number of fields, including paleoclimatology, ecology, geology, anthropology, and paleontology. "}, {"url": "https://en.wikipedia.org/wiki/Diatom", "passage_text": "Diatoms are a major group of algae, and are among the most common types of phytoplankton. Diatoms are unicellular, although they can form colonies in the shape of filaments or ribbons (e.g. Fragilaria), fans (e.g. Meridion), zigzags (e.g. Tabellaria), or stars (e.g. Asterionella). Diatoms are a widespread group and can be found in the oceans, in freshwater, in soils and on damp surfaces. Most live pelagically in open water, although some live as surface films at the water-sediment interface (benthic), or even under damp atmospheric conditions."}, {"url": "https://en.wikipedia.org/wiki/Diatom", "passage_text": "Diatoms are producers within the food chain. A unique feature of diatom cells is that they are enclosed within a cell wall made of silica (hydrated silicon dioxide) called a frustule. These frustules show a wide diversity in form, but are usually almost bilaterally symmetrical, hence the group name. Diatoms are a widespread group and can be found in the oceans, in freshwater, in soils and on damp surfaces. Most live pelagically in open water, although some live as surface films at the water-sediment interface (benthic), or even under damp atmospheric conditions."}, {"url": "http://www.ldeo.columbia.edu/%7elouisab/sedpage/bio.html", "passage_text": "Diatoms are microscopic algae living in both fresh and salt water. They are unicellular organisms with heavily silica impregnated cell walls. Living diatoms are amongst the most abundant forms of plankton and represent an essential part of the food chain in the ocean. Once dead, their shells accumulate on the seabed and eventually form siliceous sediment deposits"}, {"url": "http://westerndiatoms.colorado.edu/about/what_are_diatoms", "passage_text": "Morphology. Diatoms are algae with distinctive, transparent cell walls made of silicon dioxide hydrated with a small amount of water (Si02 + H20). Silica is the main component of glass and hydrated silica is very like the mineral opal, making these algae, often called algae in glass houses more like algae in opal houses. Diatoms have been placed in the division Bacilliariophyta, which is distinguished by the presence of an inorganic cell wall composed of hydrated silica. There are an estimated 20,000 to 2 million species of diatom on Earth."}, {"url": "http://study.com/academy/lesson/diatoms-definition-characteristics-types.html", "passage_text": "Lesson Summary. Diatoms are single-celled algae that form a silica-based cell wall. They are broken up into two major groups, the centric diatoms and the pennate diatoms, based on the form of their frustule. Diatoms live in all aquatic environments, including the ocean, freshwater lakes, and moist soils. "}]