[{"url": "http://www.botanical.com/botanical/mgmh/o/orchid13.html", "passage_text": "Sahlep. Satyrion. Levant Salep. ---Part Used---Root. Most of the Orchids native to this country have tuberous roots full of a highly nutritious starch-like substance, called Bassorin, of a sweetish taste and with a faint, somewhat unpleasant smell, which replaces starch as a reserve material."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-1263-DENDROBIUM.aspx?activeIngredientId=1263&activeIngredientName=DENDROBIUM", "passage_text": "DENDROBIUM Overview Information. Dendrobium is in the orchid plant family. This type of orchid is native to China, Hong Kong, Taiwan, India, Thailand, Vietnam, and other temperate and tropical Asian regions. Traditionally, dendrobium plants have been used in Traditional Chinese medicine."}, {"url": "http://www.orchidologist.com/medicinal.html", "passage_text": "We have many historic evidences about uses of orchids in China, Japan, Europea, Americas, Asia, Australia, Africa, Arabia and Anatolia. In Figure 1, it is presented medicinal uses of orchids 16th and 17th century."}, {"url": "http://natureproducts.net/Forest_Products/Orchids/Medicine/medicine.html", "passage_text": "Orchids, particularly the species Dendrobium officinale, have been used as medicinal herbs for centuries. New research has discovered many new applications of the different orchid species, and today there are at least 50 orchid species used especially in traditional Chinese medicine formulas."}, {"url": "http://www.justaddiceorchids.com/Just-Add-Ice-Orchid-Blog/bid/95356/The-Use-of-Orchids-in-Medicine", "passage_text": "Other types of orchids that may possess medicinal properties include orchis latifolia, eulophia campestris, vanda tessellate, and vanda roxburghii. It is believed that these orchids have certain antibacterial substances and phytochemicals that can help in the treatment of certain illnesses."}, {"url": "http://www.orchidologist.com/medicinal.html", "passage_text": "Figure 1: Uses and misuses of Orchids (1). Chinese were the first to cultivate and describe orchids. Chinese legend Shen-shên nung Described bletilla striata and A dendrobium species in His Materia medica of the 28th CENTURY (bc). 1 the medicinal use of orchids continues In chinese herbal medicine to this. day"}, {"url": "http://www.justaddiceorchids.com/Just-Add-Ice-Orchid-Blog/bid/95356/The-Use-of-Orchids-in-Medicine", "passage_text": "Orchid Beverage in Turkey In Turkey, orchids are used for making a traditional beverage called Salep. Salep is a type of flour that is produced by grinding tubers of orchis militaris, orchis mascula, and other kinds of orchids with ovoid tubers."}]