[{"url": "http://traveltips.usatoday.com/delta-airline-baggage-regulations-63779.html", "passage_text": "Checked Baggage Fees. Passengers on many Delta flights must pay baggage fees to check their bags. The first checked bag for a domestic Delta flight costs travelers $25 as of 2011. The second checked bag includes a $35 fee. Checked Baggage Limitations. Delta charges oversize fees to travelers whose bags are larger than the airline's limitations. Delta requires that all checked baggage weighs 50 lbs. or less. Checked bags also must not exceed 62 linear inches."}, {"url": "http://www.airline-baggage-fees.com/delta-airlines.php", "passage_text": "Overweight baggage is also charged on a flat-fee basis, rather than per kilogram, so even being overweight be 3 or 4 lbs may incur a fee of up to $75. On some routes, Delta has incremental fees, usually of $75 if your bag weighs between 51-70lbs (23-32kg), and $200 if between 71-100 lbs (32-44kg). Delta Airlines Carry-On Allowance 2015 ↑ Back to Top Carry-On Summary Delta allows one bag as carry-on bag, and one personal item, free of charge. The maximum dimensions for the carry-on bag are 22 x 14 x 9 inches (56x46x23cm)."}, {"url": "http://www.independenttraveler.com/travel-tips/air-travel/airline-baggage-fees", "passage_text": "Oversized Bags: $100 - $300 for each bag measuring 63 to 80 inches, depending on destination. Bags measuring 81 - 115 linear inches are considered specialty items, for which fees vary by destination. Bags measuring more than 115 inches are not permitted. Overweight Bags: For travel within the United States, Canada, U.S.V.I. and Puerto Rico: $90 for each bag weighing 51 to 70 pounds, and $175 for each bag weighing 71 to 100 pounds. For travel outside these regions, fees vary by itinerary from as little as $50 to as much as $450 per bag. See link below for details."}, {"url": "http://budgettravel.about.com/od/budgettraveltoptenlists/ss/majors-bagfees.htm", "passage_text": "Delta charges $25 USD/CDN for the first checked bag and $35 for a second when you pay at airport ticket counter, kiosk, or curbside. Online payments are discounted $2-$3. A third checked bag is $125. Fees increase to $200, beginning with the fourth checked bag. Each piece must weigh less than 50 lbs. A carry-on piece less than 23 lbs. is also permitted. Additional bags are subject to a fee between $100-$150 USD. Oversize and overweight bags cost $30-$300, with variations dictated by the size of the bag and the destination city."}, {"url": "http://traveltips.usatoday.com/delta-airline-baggage-regulations-63779.html", "passage_text": "Overweight & Oversized Bags. Travelers that want to check more than two bags on a Delta domestic flight should be prepared to pay $125 for the third bag. All subsequent bags cost $200 each. All flights to Europe cost $200 per bag after the second bag. Checked Baggage Limitations. Delta charges oversize fees to travelers whose bags are larger than the airline's limitations. Delta requires that all checked baggage weighs 50 lbs. or less. Checked bags also must not exceed 62 linear inches."}, {"url": "http://www.independenttraveler.com/travel-tips/air-travel/airline-baggage-fees", "passage_text": "Below is an airline-by-airline roundup of checked bag fees (as well as who's exempt from those fees), excess baggage penalties, and charges for oversized/overweight luggage. Use the links below to jump straight to your favorite airline. Overweight Bags: For travel within the United States, Canada, U.S.V.I. and Puerto Rico: $90 for each bag weighing 51 to 70 pounds, and $175 for each bag weighing 71 to 100 pounds. For travel outside these regions, fees vary by itinerary from as little as $50 to as much as $450 per bag. See link below for details."}, {"url": "http://www.surfline.com/travel/boardbag_charges.cfm?id=15425", "passage_text": "One surfboard bag with up to two boards can be considered as one standard piece of baggage (but they have a limited checked bag allowance). Max of 50 lbs and 6'5. Overweight/oversized or excess baggage are subject to fees (anywhere from $60-$200) depending on your trip. Contact the airline for details. "}, {"url": "http://www.airline-baggage-fees.com/delta-airlines.php", "passage_text": "Delta Airlines Oversize/Overweight Baggage Fees 2015 ↑ Back to Top Excess/Oversize/Overweight Summary Additional bags will be charged flat rates depending on your specific route, with rates ranging from $125/bag up to $285/bag. Delta has some of the harshest extra bag fees in the industry, so be sure to carefully read and understand the limits for your flight. Delta Airlines Carry-On Allowance 2015 ↑ Back to Top Carry-On Summary Delta allows one bag as carry-on bag, and one personal item, free of charge. The maximum dimensions for the carry-on bag are 22 x 14 x 9 inches (56x46x23cm)."}, {"url": "http://www.airline-baggage-fees.com/delta-airlines.php", "passage_text": "Excess/Oversize/Overweight Summary. Additional bags will be charged flat rates depending on your specific route, with rates ranging from $125/bag up to $285/bag. Delta has some of the harshest extra bag fees in the industry, so be sure to carefully read and understand the limits for your flight. Delta Airlines Carry-On Allowance 2015 ↑ Back to Top Carry-On Summary Delta allows one bag as carry-on bag, and one personal item, free of charge. The maximum dimensions for the carry-on bag are 22 x 14 x 9 inches (56x46x23cm)."}, {"url": "http://www.delta.com/content/www/en_US/traveling-with-us/baggage/before-your-trip/excess.html", "passage_text": "Additional, overweight and oversized baggage is accepted on a standby basis. Bags that do not meet our size and weight restrictions will require special handling and additional fees. It's important to know that there are separate fees for each limitation you exceed: size, weight and quantity. 1 Up to 10 bags may be checked per passenger on flights operated by Delta or Delta Shuttle® and up to four total checked bags on Delta Connection® carrier flights. 2  We may limit the amount of excess baggage when such excess prevents us from transporting up to two bags per passenger."}]