[{"url": "http://www.computerhope.com/issues/ch000801.htm", "passage_text": "Connect the monitor, flat panel, or projector to the laptop's external video connection on the back of the computer. An example of a VGA connector for a computer monitor and VGA port on a laptop is shown to the right. Once connected, your laptop may automatically switch to the new external display, or you may be required to press a key or keys on the keyboard to switch to the external display."}, {"url": "http://www.wikihow.com/Connect-Two-Monitors", "passage_text": "If the port you need for the second monitor is already in use, you may need to purchase an adapter or custom cable with a splitter. For example, if you have two DVI monitors and only one DVI port, you can purchase a DVI-to-VGA adapter so you can use the empty VGA port. 2. Plug in the matching cable from the second monitor into the appropriate port. If the port you must use for the second monitor is already in use, you may need to buy an adapter or custom cable with a splitter. For example, if you have two DVI monitors and just one DVI port, you can buy a DVI-to-HDMI adapter so you can use the empty HDMI"}, {"url": "http://www.pcworld.com/article/216364/Connect_a_Second_Monitor_to_Your_PC.html", "passage_text": "If so, just plug in your second monitor and you're good to go. (See below for Windows configuration instructions.) If not, consider upgrading to a dual-port video card, which you can do for under $50. As for laptops, virtually all models have a VGA, DVI, or HDMI port for connecting an external display. Hot on the heels of Friday's post on connecting a TV to your PC, reader Maina wants to know how to connect a second (and possibly even third) monitor to his PC. He wants one for documents, another for his Web browser or music software, and so on."}, {"url": "http://www.intel.com/content/www/us/en/tech-tips-and-tricks/how-to-connect-a-monitor-to-a-laptop.html", "passage_text": "1 Get the right cable. 2  When you connect an external monitor to a laptop computer, you have to run a cable between the two devices. 3  Make sure that you get a monitor cable that matches the sockets on your laptop and monitor. 4  Tell your operating system you’re using a second screen. 1 Multi-tasking: Connecting your laptop to a monitor enables you to go into split screen mode, where you can watch a movie on your PC monitor and tweet about it on your laptop screen. 2  This gives you a cool setup that prevents you from having to keep toggling back and forth between applications."}, {"url": "http://www.ehow.com/how_7278292_connect-laptop-second-monitor.html", "passage_text": "Instructions. Plug the monitor video cable into your laptop. Verify that you have the correct video output port for the monitor. Most laptops provide either DVI or VGA output. Whereas DVI ports contain a group of holes next to a set of narrow horizontal slits, VGA ports contain holes only. Many monitors, but not all, come with cables for both ports. You will have to purchase an adapter if your notebook computer does not have the correct port. Twist the thumb screws attached to the monitor cable head to secure it to the laptop, if necessary. Some laptops do not have holes for these thumb screws."}, {"url": "http://www.computerhope.com/issues/ch000801.htm", "passage_text": "If your external display uses VGA, DVI or HDMI instead, you can also get a DisplayPort adapter cable, allowing you to connect your VGA, DVI or HDMI display to the laptop's DisplayPort. An example of a VGA connector for a computer monitor and VGA port on a laptop is shown to the right. Once connected, your laptop may automatically switch to the new external display, or you may be required to press a key or keys on the keyboard to switch to the external display."}, {"url": "http://www.computerhope.com/issues/ch000801.htm", "passage_text": "If your display has a DVI connection, but your laptop only has a VGA connection, you need to use a video converter that converts VGA into DVI. Newer laptops may also have a DisplayPort, which can be used to connect external display devices that utilize a DisplayPort cable. An example of a VGA connector for a computer monitor and VGA port on a laptop is shown to the right. Once connected, your laptop may automatically switch to the new external display, or you may be required to press a key or keys on the keyboard to switch to the external display."}, {"url": "http://www.pcworld.com/article/216364/Connect_a_Second_Monitor_to_Your_PC.html", "passage_text": "By Rick Broida, PCWorld. Hot on the heels of Friday's post on connecting a TV to your PC, reader Maina wants to know how to connect a second (and possibly even third) monitor to his PC. He wants one for documents, another for his Web browser or music software, and so on."}, {"url": "http://www.youtube.com/watch?v=ueJoPgeqSYM", "passage_text": "Look at the back of your computer and locate an available VGA or DVI port. The VGA or DVI cord from the second monitor will fit the port. Tip. Purchase and install an AGP or PCI video card if your computer does not have an available port. Step 2: Attach second monitor. Plug in the second monitor and turn it on. Connect the best monitor to the DVI port to optimize your hardware. Restart your computer. Tip. If neither monitor comes with a DVI port, use a DVI-to-VGA adapter to connect the monitor. Step 3: Setup on Windows. Set up the second monitor on a PC by right-clicking the Desktop and then clicking Properties. On the Display Properties window, click the Settings tab. "}]