[{"url": "http://www.answers.com/Q/What_is_ID_drawing", "passage_text": "A drawing is a mark or collection of marks made upon a surface that  usually depicts an object, person, place or scene. Drawings upon  cave walls would document the details … of a hunt. A head drawing may  give you an idea of what the subject (the person depicted in the  portrait) looked like, as well as what the draughtsman (person who  drew it) thought of the portrait's subject. Plus you can draw on a computer or using different technologies and programs to create a different drawing! Drawing is an ART. Its an Art to represent your feelings/thoughts/emotions/a story/an episode. Drawing is illustrating ie. uses signs or symbols instead of alphabets to represent the thing."}, {"url": "http://www.pids-a-drafters-perspective.com/index_WhatBelongsOnAPID.htm", "passage_text": "A P&ID is an acronym that could mean: Piping and instrumentation diagram-a schematical diagram showing piping, equipment and instrumentation connections within process units in oil refineries, petrochemical and chemical plants, natural gas processing plants, power plants, water treatment and other similar plants. A P&ID is a diagram in the process industry which shows the piping of the process flow together with the installed equipment and instrumentation. Piping and Instrument Diagram is the most common terminology for the oil and gas industry."}, {"url": "https://mangeshkalbhor.wordpress.com/2008/07/19/what-is-a-pid-piping-and-instrumentation-drawing/", "passage_text": "≈ 13 Comments. Tags. AutoCAD, AutoCAD P&ID, P&ID. P&ID is a very common term used in the world of process industries. Working as a Process Engineer in a manufacturing plant I could not avoid myself from creating new and/or modifying the already existing P&ID to the as-is plant modifications. All the Chemical Engineering and related Engineering ... As we all (most of us) know P&ID is Piping and Instrumentation Drawing. A P&ID is a detailed graphical representation of a process including the hardware and software (e.g., piping, equipment, instrumentation) necessary to design, construct and operate the facility."}, {"url": "https://www.edrawsoft.com/simple-pid-drawing-example.php", "passage_text": "An example P&ID drawing, showing a simple process and instrumentation drawing. The simple process and instrumentation diagram uses some P&IDs such as distillation tower, instruments, gate valves, check valves and pipelines. The above P&ID drawing is drawn with the Edraw Max software. Download Full Software Package and View Examples for Free. "}, {"url": "https://en.wikipedia.org/wiki/Piping_and_instrumentation_diagram", "passage_text": "A piping and instrumentation diagram/drawing (P&ID) is defined by the Institute of Instrumentation and Control as follows: 1  A diagram which shows the interconnection of process equipment and the instrumentation used to control the process. 2  The primary schematic drawing used for laying out a process control installation. 1 A diagram which shows the interconnection of process equipment and the instrumentation used to control the process. 2  In the process industry, a standard set of symbols is used to prepare drawings of processes."}, {"url": "https://en.wikipedia.org/wiki/Piping_and_instrumentation_diagram", "passage_text": "Symbols according to EN ISO 10628 and EN 62424. A piping and instrumentation diagram/drawing (P&ID) is a diagram in the process industry which shows the piping of the process flow together with the installed equipment and instrumentation. 1 A diagram which shows the interconnection of process equipment and the instrumentation used to control the process. 2  In the process industry, a standard set of symbols is used to prepare drawings of processes."}, {"url": "http://www.engineeringtoolbox.com/p-id-piping-instrumentation-diagram-d_466.html", "passage_text": "A Piping and Instrumentation Diagram-P&ID, is a schematic illustration of functional relationship of piping, instrumentation and system equipment components. P&ID shows all of piping including the physical sequence of branches, reducers, valves, equipment, instrumentation and control interlocks. The P&ID are used to operate the process system. A P&ID should include:"}]