[{"url": "http://www.brighthubpm.com/certification/46151-how-much-money-do-project-managers-make/", "passage_text": "As to be expected, entry-level project managers start lower on the pay scale than their more experienced colleagues. According to PayScale.com, entry-level project managers typically start at around $52,000 a year. Those with 1-4 years of experience can expect to make about $56,000 a year. According to PayScale, project managers employed by the government make the most money on average at about $84,000 a year, and those who are employed through a fellowship make the least averaging about $58,000 a year. That's almost a $30,000 a year difference in income."}, {"url": "http://work.chron.com/much-marketing-manager-paid-8361.html", "passage_text": "Marketing managers in the New York metropolitan area, for example, averaged $167,590 per year in May 2011, the BLS reports. Those working in the San Francisco metro area averaged $169,520 per year. The highest paying state for marketing managers was New York, at an annual average salary of $163,480. The median wage, or midway point between the lowest and highest salary, was $116,010 per year. Twenty-five percent of marketing managers earned less than $83,290 per year while another 25 percent earned more than $155,050."}, {"url": "http://work.chron.com/much-marketing-manager-paid-8361.html", "passage_text": "Salary. The Bureau of Labor Statistics reports that marketing managers in the United States earned an average annual wage of $126,190 as of May 2011. The median wage, or midway point between the lowest and highest salary, was $116,010 per year. Twenty-five percent of marketing managers earned less than $83,290 per year while another 25 percent earned more than $155,050."}, {"url": "http://money.usnews.com/careers/best-jobs/marketing-manager/salary", "passage_text": "Marketing managers earned a median annual wage of $123,220 in 2013, according to the BLS. The best-paid 10 percent in the field made more than $187,199 per year, while the bottom 10 percent made less than $64,440. The best-paying jobs are located in the metropolitan areas of San Jose, California; Williamsport, Pennsylvania; and New York City. Best Paying Cities for Marketing Managers. The highest paid in the marketing manager profession work in the metropolitan areas of San Francisco, San Jose, California, and New York City. The Philadelphia area also pays well, as does the city of Williamsport, Pennsylvania."}, {"url": "http://www1.salary.com/Social-Media-Marketing-Manager-salary.html", "passage_text": "For example the median expected annual pay for a typical Social Media Marketing Manager in the United States is $106,182 so 50% of the people who perform the job of Social Media Marketing Manager in the United States are expected to make less than $106,182. Source: HR Reported data as of October 2015. Median $106,182. This chart describes the expected percentage of people who perform the job of Social Media Marketing Manager in the United States that make less than that annual salary."}, {"url": "http://money.usnews.com/careers/best-jobs/marketing-manager", "passage_text": "Marketing managers earned a median annual wage of $123,220 in 2013, according to the BLS. The best-paid 10 percent in the field made more than $187,199 per year, while the bottom 10 percent made less than $64,440. The best-paying jobs are located in the metropolitan areas of San Jose, California; Williamsport, Pennsylvania; and New York City."}, {"url": "http://work.chron.com/much-money-hr-managers-make-9218.html", "passage_text": "Pay. Some HR managers made as little as $60,070 per year, or $28.88 per hour. Others made as much as $169,310 annually, or $81.40 hourly. On average, however, they earned an annual $108,600, or $52.21 per hour, as of May 2011, according to the U.S. Bureau of Labor Statistics. In small companies, they could earn their salaries by being the sole employee in charge of human resources. How much money HR, or human resources, managers make depends on their employers and locations. Some HR managers made as little as $60,070 per year, or $28.88 per hour."}, {"url": "http://www1.salary.com/Marketing-Manager-salary.html", "passage_text": "For example the median expected annual pay for a typical Marketing Manager in the United States is $88,641, so 50% of the people who perform the job of Marketing Manager in the United States are expected to make less than $88,641. Source: HR Reported data as of October 2015. 1  Salary. 2  Salary + Bonus. 3  Benefits. This chart describes the expected percentage of people who perform the job of Marketing Manager that make less than that salary. For example 50% of the people who perform the job of Marketing Manager are expected to make less than the median."}]