[{"url": "https://en.wikipedia.org/wiki/Pigmented_villonodular_synovitis", "passage_text": "Pigmented villonodular synovitis (PVNS) is a joint disease characterized by inflammation and overgrowth of the joint lining. It usually affects the hip or knee. "}, {"url": "http://www.mdguidelines.com/synovitis", "passage_text": "A rare, slow-growing, benign tumor of the synovial membranes (pigmented villonodular synovitis [PVNS]) can cause pain and swelling in the knee synovium in 80% of cases and to a lesser extent may involve hip, ankle, or shoulder joints (McGrath). Synovitis is commonly confirmed with arthroscopic examination. "}, {"url": "http://www.hog.org/handbook/article/4/18/what-is-synovitis", "passage_text": "share. The synovial membrane is the part of the body that lines the inside of certain joints. It lines the joint capsule in the knee, ankle, wrist, elbow, hand, foot, and shoulder. When this membrane gets inflamed, it is called synovitis. Synovitis is often the result of repeated joint bleeds that are not treated early or correctly. With synovitis, the synovial membrane thickens and grows more blood vessels, causing even more bleeding into the joint."}, {"url": "http://familydoctor.org/familydoctor/en/diseases-conditions/pigmented-villonodular-synovitis.html", "passage_text": "Pigmented villonodular synovitis (PVNS) is a joint problem that usually affects the hip or knee. It can also occur in the shoulder, ankle, elbow, hand or foot. When you have PVNS, the lining of a joint becomes swollen and grows. This growth harms the bone around the joint. The lining also makes extra fluid that can cause swelling and make movement very painful."}, {"url": "https://www.healthtap.com/topics/glenohumeral-synovitis", "passage_text": "Synovitis (Definition). The synovial membrane is the lining of a joint and synovitis is inflammation of that lining. It can cause joint pain, swelling, and stiffness. When inflamed, the lining will create excessive joint fluid, causing swelling and increased joint pressure. Get help from a doctor now ›. Yes: Synovitis is inflammation of the lining of a joint. It can occur as a result of injury, infection, joint degeneration, or autoimmune conditions usch as rheumatoid arthritis. Common symptoms of synovitis are joint pain, fluid accumulation in the joint, and stiffness."}, {"url": "https://en.wikipedia.org/wiki/Synovitis", "passage_text": "Synovitis is the medical term for inflammation of the synovial membrane. This membrane lines joints which possess cavities, known as synovial joints. The condition is usually painful, particularly when the joint is moved. The joint usually swells due to synovial fluid collection. Synovitis may occur in association with arthritis as well as lupus, gout, and other conditions. Synovitis is more commonly found in rheumatoid arthritis than in other forms of arthritis, and can thus serve as a distinguishing factor, although it is also present in many joints affected with osteoarthriti"}, {"url": "http://www.youtube.com/watch?v=fPlaaDpYfS8", "passage_text": "Uploaded on Sep 14, 2011. Synovitis is a condition that causes the entire shoulder joint to become swollen and tender. Your shoulder joints are held together by a capsule of tissues and ligaments. The inner-most tissue of the capsule is a membrane called the synovium. The synnovial membrane provides an oil-like fluid that helps lubricate the joints. When the synovium becomes inflamed, it is called synovitis."}, {"url": "https://www.hss.edu/condition-list_synovitis.asp", "passage_text": "Synovitis. Synovitis is an inflammation of the joint lining, called synovium. The symptoms are often of short duration and may change location although when caused by overuse tend to remain in one joint. The pain is usually more severe than expected based on the appearance of the joint on examination. "}, {"url": "https://www.healthtap.com/topics/glenohumeral-synovitis", "passage_text": "Get help from a doctor now ›. Joint inflammation: The synovial membrane is the lining of a joint and synovitis is inflammation of that lining. It can cause joint pain, swelling, and stiffness. When inflamed, the lining will create excessive joint fluid, causing swelling and increased joint pressure. Get help from a doctor now ›. Yes: Synovitis is inflammation of the lining of a joint. It can occur as a result of injury, infection, joint degeneration, or autoimmune conditions usch as rheumatoid arthritis. Common symptoms of synovitis are joint pain, fluid accumulation in the joint, and stiffness."}]