[{"url": "http://www.livestrong.com/article/449416-what-is-ash-in-food/", "passage_text": "The ash material in animal products and grains is acidic, while the ash in fruits and vegetables is alkaline. The claim is that eating more alkaline ash foods changes the pH of your blood and targets harmful cells such as cancer. This, however, is false, according to allergy and immunology specialist Gabe Mirkin. The ash in the food you eat can change the pH of your urine, but not your blood's or anything else in your body."}, {"url": "http://www.livestrong.com/article/449416-what-is-ash-in-food/", "passage_text": "Woman reading ingredients on a box in grocery store. Photo Credit Monkey Business Images/Monkey Business/Getty Images. If you have started paying more attention to the nutrient content of your food, you might notice that ash frequently turns up as a component in most foods."}, {"url": "http://www.ars.usda.gov/Services/docs.htm?docid=23429", "passage_text": "Each of the food and beverage items that can be reported in WWEIA, National Health and Nutrition Examination Survey are placed in one of the mutually exclusive food categories. This is done by linking each food code contained in the Food and Nutrient Database for Dietary Studies (FNDDS) to one WWEIA category."}, {"url": "http://people.umass.edu/~mcclemen/581Ash&Minerals.html", "passage_text": "4. Analysis of Ash and Minerals. 4.1 Introduction. The ash content is a measure of the total amount of minerals present within a food, whereas the mineral content is a measure of the amount of specific inorganic components present within a food, such as Ca, Na, K and Cl."}, {"url": "http://www.livestrong.com/article/449416-what-is-ash-in-food/", "passage_text": "Ash refers to any inorganic material, such as minerals, present in food. It's called ash because it's residue that remains after heating removes water and organic material such as fat and protein. Food scientists ash foods so that they can examine this leftover material to better determine a food's content."}, {"url": "http://www.catinfo.org/docs/SortableCatFoodChartCatinfo.org2-22-13.htm", "passage_text": "44. 1  100% of a diet's calories come from protein, fat, and carbohydrate. 2  Therefore: % protein calories + % fat calories + % carbohydrate calories = 100% This means that if, for example, a diet is appropriately low in carbohydrates, the diet will be higher in protein, fat, or both."}]