[{"url": "http://www.animalbehaviorcollege.com/VeterinaryAssistant/become-vet-assistant.asp", "passage_text": "Infographic by Jesse Hernandez. Veterinary assistants should have a high school diploma or GED or pass the Ability to Benefit Test. No further education is required to become a vet assistant, but veterinary assistant courses are highly recommended. A standardized education in veterinary medicine provides students the basic knowledge they need. Those enrolled in a veterinary assistant school, such as a non-degree program, know how to perform their jobs in addition to why they do them."}, {"url": "http://www.innerbody.com/careers-in-health/how-to-become-a-veterinary-assistant.html", "passage_text": "For those who love animals, there are few jobs more rewarding than that of veterinary assistant. The compassionate presence of these professionals eases the experience of a visit to the vet for pets and pet owners alike. Some veterinary assistants choose to go back to school to complete an associate’s degree and become veterinary technicians. Others choose to complete a bachelor’s degree with pre-veterinary requirements, allowing them to apply to veterinary school."}, {"url": "http://www.indeed.com/forum/job/veterinary-assistant/qualifications-do-you-need-become-vet-assistant/t49104", "passage_text": "88 months ago. I was thinking about being a vet assistant once out of school and would like to know the qualifications needed to become one. also do you have to go the collage or university or can you just go and become one when you leave school,the do the people there show you what do and what the rules are. I was thinking about being a vet assistant once out of school and would like to know the qualifications needed to become one. Also, is it required to go to university to become one or can a person just go through tafe to become a vet assistant."}, {"url": "http://www.animalbehaviorcollege.com/VeterinaryAssistant/become-vet-assistant.asp", "passage_text": "As the first to greet patients, vet assistants are also frequently in contact with pet owners. They educate owners of diseases and health problems, and explain to them how they can better take care of their pets. Duties of veterinary assistants include, but are not limited to: 1  Feed, bathe, and exercise animals. A standardized education in veterinary medicine provides students the basic knowledge they need. Those enrolled in a veterinary assistant school, such as a non-degree program, know how to perform their jobs in addition to why they do them."}, {"url": "http://www.innerbody.com/careers-in-health/how-to-become-a-veterinary-assistant.html", "passage_text": "According to the US Bureau of Labor Statistics, the median annual salary for veterinary assistants in 2010 was $22,040, with a range extending from $16,490 to $33,780. Some veterinary assistants choose to go back to school to complete an associate’s degree and become veterinary technicians. Others choose to complete a bachelor’s degree with pre-veterinary requirements, allowing them to apply to veterinary school."}, {"url": "http://www.animalbehaviorcollege.com/VeterinaryAssistant/become-vet-assistant.asp", "passage_text": "Myths About Veterinary Assistants. Being a veterinary assistant is more than taking care of animals. There are times when an animal needs to undergo surgery, in which case, the veterinary assistant has to stand ready to provide assistance to the vet technician and veterinarian. The sight of blood, bones, and feces is not uncommon in the veterinary world. A standardized education in veterinary medicine provides students the basic knowledge they need. Those enrolled in a veterinary assistant school, such as a non-degree program, know how to perform their jobs in addition to why they do them."}, {"url": "http://www.animalbehaviorcollege.com/veterinaryassistantprogram/", "passage_text": "Locations in All 50 States and Every Canadian Province. The ABC Certified Veterinary Assistant Program is a viable option for students anywhere in the United States and Canada. That's because ABC has over 1,000 partner veterinary facilities nationwide and throughout Canada. Upon completion of our NAVTA-approved program, graduates will have earned the privilege and opportunity to take NAVTA's national test and become an Approved Veterinary Assistant (AVA)."}, {"url": "http://www.innerbody.com/careers-in-health/how-to-become-a-veterinary-assistant.html", "passage_text": "Education. Most veterinary assistants have a high school diploma or GED. Some veterinary assistants choose to earn a certificate through a non-degree program, but certification is not required. Employers generally prefer to hire veterinary assistants who have an associate’s or bachelor’s degree in animal science. Some veterinary assistants choose to go back to school to complete an associate’s degree and become veterinary technicians. Others choose to complete a bachelor’s degree with pre-veterinary requirements, allowing them to apply to veterinary school."}]