[{"url": "http://www.efile.com/how-to-pay-taxes-online-installment-plans/", "passage_text": "The IRS will charge a one time user fee of $120 for a request to enter into an installment agreement. If you set up a direct debit installment plan, the user fee will be reduced to $52. The user fee will generally be added to the total amount of back taxes, penalties, and interest that you owe. "}, {"url": "http://www.irsvideos.gov/Individual/PayingTaxes/OPA", "passage_text": "File on time and pay as much as you can. That will keep your penalties and interest to a minimum. And if you need time to pay the balance, use the IRS Online Payment Agreement Application to set up a payment plan. Thanks for watching. But if you can´t pay your bill in full, file on time and pay what you can. That will keep your penalties and interest to a minimum. And for the rest of what you owe, an IRS payment plan may be an option."}, {"url": "http://taxes.about.com/od/taxtrouble/ht/IRS_Payment.htm", "passage_text": "1 The IRS must agree to accept your installment agreement if you meet certain criteria: your total tax does not exceed $10,000 and the monthly payments will pay your tax debt in full within 3 years. 2  You can ask your tax professional to help you set up a payment plan. 1 They will set up a payment plan over the phone and send you some paperwork to fill out. 2 "}, {"url": "http://www.filelater.com/resources/does-irs-offer-payment-plans", "passage_text": "Also known as an IRS Payment Plan, this arrangement allows you to pay-off your tax liability over a period of time (sometimes up to five years). Note that the type of arrangement you get will depend on what kind of tax debt you have and how much you owe. By approving your payment plan request, the IRS agrees to let you pay the tax you owe in monthly installments (instead of immediately paying the amount in full). In return, you are agreeing to make your monthly payments on time. You are also agreeing to meet all your future tax liabilities."}, {"url": "https://answers.yahoo.com/question/index?qid=20100315192313AAJFZrO", "passage_text": "Report Abuse. Dear Ro: The IRS charges a nominal rate in the area of 4-5%. If you can send a small amount, do it and then the IRS will bill you for the rest. To set up a payment plan costs about $105 so do what ever you can to avoid the installment agreement. You have until Apr 15 to get $700 together. "}, {"url": "http://taxpayeradvocate.irs.gov/get-help/payment-plans", "passage_text": "Payment Plans. It’s in your best interest to pay your tax debt as soon as possible because paying can limit the penalties and interest the IRS may charge. However, if you can’t pay your taxes in full, the IRS offers a number of payment options. If the IRS denies your request for a payment plan. If you’re eligible for an installment agreement or offer in compromise, and the IRS denies your request or rejects your offer, you have the right to appeal that decision to the IRS Office of Appeals."}, {"url": "http://taxpayeradvocate.irs.gov/get-help/payment-plans", "passage_text": "Penalties, interest, held refunds, and fees. 1  Even if the IRS agrees to an installment agreement, it will still charge penalties and interest and may file a Notice of Federal Tax Lien. 2  For more information, see IRS Publication 594, The IRS Collection Process. If the IRS denies your request for a payment plan. If you’re eligible for an installment agreement or offer in compromise, and the IRS denies your request or rejects your offer, you have the right to appeal that decision to the IRS Office of Appeals."}, {"url": "http://www.filelater.com/resources/does-irs-offer-payment-plans", "passage_text": "To ask for an installment agreement, use Tax Form 9465, known as the Installment Agreement Request. You should receive a response from the IRS within 30 days. You can also apply for an installment agreement online. To do that, go to the IRS website and click on the “Payments” tab at the top. By approving your payment plan request, the IRS agrees to let you pay the tax you owe in monthly installments (instead of immediately paying the amount in full). In return, you are agreeing to make your monthly payments on time. You are also agreeing to meet all your future tax liabilities."}, {"url": "https://www.irs.gov/taxtopics/tc202.html", "passage_text": "The IRS charges a one-time installment agreement user fee of $120 when you enter into a standard installment agreement or a payroll deduction installment agreement. If you choose to pay through a direct debit from your bank account, the user fee is $52. IRS electronic payment options are the best way for you to pay federal taxes. Paying electronically is the most convenient and secure way to make tax payments. You can make electronic payments online, by phone, or from a mobile device."}]