[{"url": "http://www.bloodpressure-drs-practical-guide.com/pulsepressure.html", "passage_text": "If you subtract the smaller blood pressure number from the larger one you get a number which is the Pulse Pressure. For example, a blood pressure of 120 over 80 yields one of 40 mm Hg (120 minus 80 = 40). Obviously it is the difference between the systolic and the diastolic pressures. Let's call it PP. Thus there are three components to this (or any other) blood pressure reading: Systolic pressure (120), diastolic pressure (80) and pulse pressure (40)."}, {"url": "http://www.ehow.com/facts_4813452_normal-pulse-rate-blood-pressure.html", "passage_text": "heart pulse image by jim from Fotolia.com. Normal pulse rate and blood pressure are two of the leading indicators of an individual's physical health. Pulse is defined as the number of times a person's heart beats per minute, and is often measured at the neck, temple, wrist, back of the knee or inside of the foot. "}, {"url": "http://www.livescience.com/42219-blood-pressure.html", "passage_text": "The bottom number, called the diastolic pressure, is the measurement as the heart relaxes between beats. Normal blood pressure is a systolic pressure of less than 120 millimeters of mercury (mm Hg) and a diastolic pressure of less than 80 mm Hg, or 120/80 mm Hg, according to the American Heart Association (AHA). Having a blood pressure greater than 140/90 mm Hg is considered high blood pressure or hypertension. A blood pressure level between normal and hypertension, is called prehypertension, meaning it is higher than normal, but not high enough to be considered hypertension."}, {"url": "http://www.healthcentral.com/high-blood-pressure/c/58370/110775/pulse", "passage_text": "Pulse pressure refers to the difference between the systolic (top) and diastolic (bottom) blood pressure. If your blood pressure (BP) is 120/80, for instance, your pulse pressure is 120 - 80 = 40 mmHg. A pulse pressure of 40 mmHg is normal."}, {"url": "http://answers.webmd.com/answers/5039739/what-is-a-normal-blood-pressure-and-heart-rate", "passage_text": "17 Followers. A. A healthy blood pressure should be less than 120 mm Hg (systolic) and less than 80 mm Hg (diastolic). A normal pulse rate for adults is 60 to 100 beats a minute. You should speak with your doctor about your blood pressure reading and pulse rate. This answer should not be considered medical advice... "}, {"url": "https://en.wikipedia.org/wiki/Pulse_pressure", "passage_text": "Pulse pressure is the difference between the systolic and diastolic pressure readings. It is measured in millimeters of mercury (mmHg). It represents the force that the heart generates each time it contracts. If resting blood pressure is (systolic/diastolic) 120/80 millimeters of mercury (mmHg), pulse pressure is 40. "}, {"url": "http://www.heart.org/HEARTORG/Conditions/More/MyHeartandStrokeNews/All-About-Heart-Rate-Pulse_UCM_438850_Article.jsp", "passage_text": "Even if you’re not an athlete, knowledge about your heart rate can help you monitor your fitness level — and it might even help you spot developing health problems. Your heart rate, or pulse, is the number of times your heart beats per minute. Normal heart rate varies from person to person. Knowing yours can be an important heart-health gauge. "}, {"url": "http://www.disabled-world.com/calculators-charts/bpm-chart.php", "passage_text": "Pulse Rate: Defined, as the rate at which your heart beats. Your pulse is usually called your heart rate, which is the number of times your heart beats each minute (bpm). Changes in your heart rate or rhythm, a weak pulse, or a hard blood vessel may be caused by heart disease or other problem(s). "}, {"url": "http://www.bloodpressureuk.org/BloodPressureandyou/Thebasics/Whatisnormal/", "passage_text": "Ideally, we should all have a blood pressure below 120 over 80 (120/80). This is the ideal blood pressure for people wishing to have good health. At this level, we have a much lower risk of heart disease or stroke. If your blood pressure is optimal, this is great news. If your blood pressure is above 120/80mmHg, you will need to lower it. Most adults in the UK have blood pressure readings in the range from 120 over 80 (120/80) to 140 over 90 (140/90). If your blood pressure is within this range, you should be taking steps to bring it down or to stop it rising any further. Our five top tips will show you how"}]