[{"url": "https://answers.yahoo.com/question/index?qid=20060921020741AA6wqkg", "passage_text": "Report Abuse. Anisotropic filtering DEFINITION-Anisotropic filtering (AF) is a feature of some video cards that sharpens the details of the fading-away part of a 3D object that recedes into the distance. In mip mapping, the mip level is anisotropic, so a 256x256 texture may be downsized to a 128x64 bitmap, which doubles its horizontal resolution. Thus when the texture is applied, it appears consistent with the camera to plane angle."}, {"url": "http://www.geforce.com/whats-new/guides/aa-af-guide", "passage_text": "Anisotropic filtering improves the clarity and crispness of textured objects in games. Textures are images containing various types of data such as color, transparency, reflectivity, and bumps (normals) that are mapped to an object and processed by the GPU in order to give it a realistic appearance on your screen. As previously mentioned, bilinear and trilinear filtering suffer from resultant quality loss when the sampled textures are oblique with the camera due to both methods obtaining texel samples from mipmaps assuming that the mapped texel is perfectly square in the rendered space, which is rarely true."}, {"url": "https://en.wikipedia.org/wiki/Anisotropic_filtering", "passage_text": "Anisotropic filtering is relatively intensive (primarily memory bandwidth and to some degree computationally, though the standard space–time tradeoff rules apply) and only became a standard feature of consumer-level graphics cards in the late 1990s. With RIP map anisotropic filtering, in addition to downsampling to 128 × 128, images are also sampled to 256 × 128 and 32 × 128 etc. These anisotropically downsampled images can be probed when the texture-mapped image frequency is different for each texture axis."}, {"url": "https://answers.yahoo.com/question/index?qid=20060921020741AA6wqkg", "passage_text": "Best Answer: (m) In 3D computer graphics, Anisotropic filtering (AF) is a method of enhancing the image quality of textures on surfaces that are far away and steeply angled with respect to the camera. In mip mapping, the mip level is anisotropic, so a 256x256 texture may be downsized to a 128x64 bitmap, which doubles its horizontal resolution. Thus when the texture is applied, it appears consistent with the camera to plane angle."}, {"url": "https://en.wikipedia.org/wiki/Anisotropic_filtering", "passage_text": "Like bilinear and trilinear filtering, anisotropic filtering eliminates aliasing effects, but improves on these other techniques by reducing blur and preserving detail at extreme viewing angles. With RIP map anisotropic filtering, in addition to downsampling to 128 × 128, images are also sampled to 256 × 128 and 32 × 128 etc. These anisotropically downsampled images can be probed when the texture-mapped image frequency is different for each texture axis."}, {"url": "https://answers.yahoo.com/question/index?qid=20060921020741AA6wqkg", "passage_text": "True antistopic filtering generates the anisotropic texture maps on the fly on a per-pixel basis. When the texture is sampled, several pixels (samples) of the texture around the center point are taken, but on a sample grid skewed according to view perspective. The texture is 'pre-perspective corrected', so to speak. In mip mapping, the mip level is anisotropic, so a 256x256 texture may be downsized to a 128x64 bitmap, which doubles its horizontal resolution. Thus when the texture is applied, it appears consistent with the camera to plane angle."}, {"url": "https://en.wikipedia.org/wiki/Anisotropic_filtering", "passage_text": "An illustration of texture filtering methods showing a trilinear mipmapped texture on the left and the same texture enhanced with anisotropic texture filtering on the right. With RIP map anisotropic filtering, in addition to downsampling to 128 × 128, images are also sampled to 256 × 128 and 32 × 128 etc. These anisotropically downsampled images can be probed when the texture-mapped image frequency is different for each texture axis."}, {"url": "http://www.wisegeek.com/what-is-anisotropic-filtering.htm", "passage_text": "10 most extreme places on Earth. Anisotropic filtering is a technique used in the 3-D computing field to enhance the image quality of textures on rendered surfaces which are sloped relative to the viewer. This is achieved by eliminating aliasing, which is responsible for the jagged or pixelated quality of some graphics. In addition to its anti-aliasing qualities, this filtering also reduces blurring of sloped textures, an improvement over previous types of filtering known as bilinear and trilinear filtering."}, {"url": "https://answers.yahoo.com/question/index?qid=20060921020741AA6wqkg", "passage_text": "This avoids pixel shimmer. In mip mapping, the mip level is anisotropic, so a 256x256 texture may be downsized to a 128x64 bitmap, which doubles its horizontal resolution. Thus when the texture is applied, it appears consistent with the camera to plane angle."}, {"url": "http://whatis.techtarget.com/definition/anisotropic-filtering-AF", "passage_text": "Anisotropic filtering (AF) is a feature of some video card s that sharpens the details of the fading-away part of a 3D object that recedes into the distance. Think of the text in the titles at the beginning of the Star Wars movies that is presented in large letters and then scrolls back into the distance. In a 3D image, you may want a comparable effect to retain the sharpness of an object as it recedes; anisotropic filtering does this. (Isotropic describes objects or image elements with vector s of equal value along different axes, such as squares and cubes."}]