[{"url": "https://answers.yahoo.com/question/index?qid=20081101192958AAqBCua", "passage_text": "Pan Fried Chicken. Ingredients 16 pieces of chicken (preferably drumsticks and thighs) 6 cups buttermilk 3 cups all-purpose flour 4 teaspoons salt 2 teaspoons freshly ground black pepper 1 teaspoon cayenne pepper 1 1/2 quarts vegetable oil, for frying In a large bowl, toss the chicken with the buttermilk. Best Answer: The best way to pan fry chicken-Fill a large skillet (cast iron is best) a 1/4 of the way with crisco (lard), batter it, the grease should sizzle when adding the chicken. Do not over load the skillet, make sure you have plenty of room."}, {"url": "http://www.answers.com/Q/How_long_does_it_take_to_fry_chicken_legs", "passage_text": "You should deep fry chicken leg quarters until they are golden  brown which would be approximately 20 minutes. The internal  temperature of the chicken leg quarter should be … 180 degrees when  fully cooked. It really depends on the size of the piece. for a 1/2 lb chicken breast with the bones in I'll fry it for 15 minutes on one side and flip it and fry for 5 minutes on the other … . For deep frying in 375F oil (190C) I'll cook it for 12 - 15 minutes"}, {"url": "http://www.soulfoodandsoutherncooking.com/how-long-to-cook-fried-chicken-in-deep-fryer.html", "passage_text": "Allow the chicken to cook without touching it. After 5 minutes turn your chicken with tongs do not poke with a fork. Allow the chicken to cook on the other side for 5 more minutes then remove from oil and let rest for an additional 5 minutes. You are now ready to enjoy your Midwest Fried chicken with a southern twist. My secret to crispy fried chicken legs....take a good pot or cast iron pot fill with vegetable oil half way I use a whole 42 oz bottle. Heat oil to the perfect temperature."}, {"url": "http://www.craftsy.com/blog/2014/11/pan-fried-chicken-legs/", "passage_text": "Cook for 25-30 minutes more, or until the chicken closest to the bone slices of cleanly. Place the chicken on paper towels to cool and blot for about five minutes before serving. If you are not serving the chicken right away, reheat it in the oven at 475 degrees F for about five minutes before serving. "}, {"url": "http://www.answers.com/Q/How_long_does_it_take_to_fry_chicken_legs", "passage_text": "It will take an estimated 20 to 25 minutes to fry chicken legs on the stove top. If frying in a deep fryer, the time will be about 10 to 15 minutes. It really depends on the size of the piece. for a 1/2 lb chicken breast with the bones in I'll fry it for 15 minutes on one side and flip it and fry for 5 minutes on the other … . For deep frying in 375F oil (190C) I'll cook it for 12 -"}, {"url": "http://www.bhg.com/recipes/how-to/cooking-basics/how-to-oven-bake-chicken-legs/", "passage_text": "Preheat the oven to 400°F. Bake the chicken, uncovered, for 35 to 40 minutes or until the chicken is no longer pink inside. You can bake the chicken legs in a 375°F. oven, if desired. Increase the baking time to 45 to 50 minutes. "}, {"url": "http://www.answers.com/Q/How_long_do_you_deep_fry_chicken_legs", "passage_text": "You should deep fry chicken leg quarters until they are golden  brown which would be approximately 20 minutes. The internal  temperature of the chicken leg quarter should be … 180 degrees when  fully cooked. 11 people found this useful. "}, {"url": "http://www.howtocookmeat.com/recipes/chicken/how-to-deep-fry-chicken-legs.htm", "passage_text": "Bread the chicken a few minutes just before you fry it. Heat up the oil to 375–400 degrees before you add the chicken. This will help to compensate for the temperature drop after you add the chicken. Try to keep the oil at 350 degrees. 4. Fry the chicken legs. I recommend using peanut oil, as long as no one is allergic. Otherwise, use canola or frying shortening. Heat up the oil on the stove until it reaches 375 degrees F. Add the chicken and begin frying it."}, {"url": "http://www.ehow.com/way_5261930_long-fry-drumsticks.html", "passage_text": "A 4- to 6-ounce chicken drumstick takes 12 to 14 minutes of deep-frying or 20 to 25 minutes of shallow frying, plus two minutes of rest time, to fully cook. Breading doesn't affect cooking time. "}]