[{"url": "http://www.definitions.net/definition/chthonic", "passage_text": "Chthonic. Chthonic designates, or pertains to, deities or spirits of the underworld, especially in relation to Greek religion. The Greek word khthon is one of several for earth; it typically refers to the interior of the soil, rather than the living surface of the land or the land as territory."}, {"url": "http://www.oxforddictionaries.com/definition/english/chthonic", "passage_text": "1 For Apollo presents life in a way that is tolerable, through exclusion of the chthonic depths; while Dionysus ignores nothing, forcing us to face the fundamental terrors of existence. 2  In all their dark glamor, they evoke the global workings of industry, awful and chthonic."}, {"url": "http://www.oxforddictionaries.com/definition/english/chthonic", "passage_text": "Relating to or inhabiting the underworld: a chthonic deity. More example sentences. 1  For Apollo presents life in a way that is tolerable, through exclusion of the chthonic depths; while Dionysus ignores nothing, forcing us to face the fundamental terrors of existence. 2  In all their dark glamor, they evoke the global workings of industry, awful and chthonic."}, {"url": "https://en.wikipedia.org/wiki/Chthonic", "passage_text": "Chthonic (UK /ˈkθɒnɪk/ , US /ˈθɒnɪk/ from Greek χθόνιος khthonios [kʰtʰonios] , kʰtʰónios, in, under or beneath the, earth from χθών khthōn) earth literally means. Subterranean the translation of meaning discusses deities or spirits of the, underworld especially In greek. religion"}, {"url": "http://ancienthistory.about.com/od/chcl/g/122007chthonic.htm", "passage_text": "By N.S. Gill. Definition: Chthonic is a term used to describe earth gods and goddesses. It can refer to Underworld gods. In Greek mythology, chthonic is contrasted with the ouranic, Olympian, or sky gods. Chthonic comes from the Greek word for earth, chthonos."}, {"url": "https://en.wikipedia.org/wiki/Chthonic", "passage_text": "The translation of meaning discusses deities or spirits of the underworld, especially in Greek religion. The Greek word khthon is one of several for earth; it typically refers to the interior of the soil, rather than the living surface of the land (as Gaia or Ge does), or the land as territory (as khora (χώρα) does)."}]