[{"url": "http://www.emedicinehealth.com/ringworm_of_the_skin-health/page2_em.htm", "passage_text": "Ringworm infection is caused by a fungus. Fungi (plural of fungus) that cause ringworm live and spread on the outer layer of skin. Ringworm is not caused by a worm or other parasite. Fungi are present everywhere in our environment, including on the human body."}, {"url": "http://www.medicinenet.com/ringworm/article.htm", "passage_text": "1 Ringworm causes a scaly, crusted rash that may appear as round, red patches on the skin.Other symptoms and signs of ringworm include patches of hair loss or scaling on the scalp, itching, and blister-like lesions."}, {"url": "http://www.drgreene.com/qa-articles/ringworm-lookalikes/", "passage_text": "Other conditions that occasionally look like ringworm include seborrhea, psoriasis, pityriasis, contact dermatitis (such as poison oak), drug reactions, tinea versicolor, vitiligo, erythema migrans (a rash seen in Lyme disease), and even lupus."}, {"url": "http://www.webmd.com/skin-problems-and-treatments/ss/slideshow-ringworm", "passage_text": "Other rashes can look like ringworm, including spider bites, nummular eczema, and Lyme disease, a more serious infection that produces a bull's-eye shaped rash. These require different treatments, so it's important to consult a medical professional."}, {"url": "http://www.wikihow.com/Identify-and-Treat-Ringworm", "passage_text": "Ringworm is a fungal infection of the skin that is characterized by an often itchy, reddish to brownish ring-shaped rash. Ringworm on the body is also known as tinea corporis and is related to other fungal infections such as ringworm of the scalp, athlete's foot and jock itch. Ad."}, {"url": "http://www.webmd.boots.com/skin-problems-and-treatments/guide/ringworm-symptoms", "passage_text": "Ringworm isn't caused by worms. The skin infection, also known as tinea, is caused by fungi called dermatophytes. Fungi are microscopic organisms that can live off the dead tissues of your skin, hair, and nails, much like a mushroom can grow on the bark of a tree. Ringworm is caused by a fungus that grows on the skin."}, {"url": "http://www.babycentre.co.uk/a548378/ringworm", "passage_text": "Ringworm is a contagious fungal infection of the skin that has nothing to do with worms. It's called ringworm because the infection appears as a rash in a ring or round shape. It can be itchy, but it's not painful or dangerous."}, {"url": "http://www.webmd.com/skin-problems-and-treatments/ss/slideshow-ringworm", "passage_text": "No. Ringworm is not caused by a worm. It's a fungal infection that often forms a ring-shaped rash. It can have a red center (seen here) or normal skin tone inside the ring."}]