[{"url": "https://www.ukpower.co.uk/home_energy/tariffs-per-unit-kwh", "passage_text": "How energy bills are calculated. When calculating the price of your bill, energy providers monitor how many kilowatt hours of gas or electricity you have used over a certain period of time, and then multiply this by the price per unit set in your tariff. Gas & Electricity Tariff Prices per Unit. Although many people may not realize it, the price that you pay for your energy is made up of two different charges: 1  Standing charge-this is a fixed amount that you are charged each day, regardless of how much gas or electricity you use."}, {"url": "http://www.electricityprices.org.uk/eon-electricity-supplier-review/", "passage_text": "Eon is one of the largest energy suppliers in the UK for gas and electricity products for home and business use and has a vast array of tariff rates with different prices depending on where you live in the country. 1 FixOnline – current version 4 which means you can fix your electricity prices for the next 15 months and save around 0.5% on current average bills. 2  So if you believe prices may rise this may be for you. 3  There are no clubcard points with this offer and it comes with a £10 termination fee if you change your mind."}, {"url": "http://blog.comparemysolar.co.uk/electricity-price-per-kwh-eon-energy/", "passage_text": "Comparison of Eon Energy rates per kWh for currently available electricity tariffs. Following our price comparison of standard electricity rates of the big six suppliers, we focus on all available rates from Eon Energy: Standard, Energy Fixed 1 Year and Energy Fixed 2 Years. Note: price in pence per kWh based on yearly usage of Low (2100 kWh), Medium (3300 kWh) or High (5100 kWh) electricity user based in London postcode. Review of Eon Energy Tariffs: 1  Standard Variable (Standing Charge: 26 pence, Unit Rate: 14.52 pence) – Fully variable, no cancellation fees, 20 pound discount if you take both gas and electricity, but at a large premium of 2.75 pence/kWh. 2  Will cost 60-140 pounds more per year depending on usage"}, {"url": "http://www.moneymatterstome.co.uk/Interactive-workshops/KWh.htm", "passage_text": "1 Look at the cost you pay per unit (unit cost) (this may be anywhere between 4p and 12p depending upon your supplier and any special discount schemes) you c an get the exact amount per unit from your electricity bill. 2  Look on the appliance label and look for its power consumption in Watts or kW (1000's of watts). Your electricity bill will show the electricity used in 'units', the price of each unit is also shown. Ever wondered what a 'unit' of electricity is or how long you can run an appliance for on one unit."}, {"url": "http://blog.comparemysolar.co.uk/electricity-price-per-kwh-eon-energy/", "passage_text": "1 Energy Fixed 2 Year (Standing Charge: 25 pence, Unit Rate: 12.36 pence) – Fixed for longer, but at a premium of 0.59 pence/kWh, 20 pound discount if you take both gas and electricity. 2  Will cost 12-30 pounds more per year depending on usage. 3  Best if price rises of 10%+ are expected during next two years. Note: price in pence per kWh based on yearly usage of Low (2100 kWh), Medium (3300 kWh) or High (5100 kWh) electricity user based in London postcode. Review of Eon Energy Tariffs: 1  Standard Variable (Standing Charge: 26 pence, Unit Rate: 14.52 pence) – Fully variable, no cancellation fees, 20 pound discount if you take both gas and electricity, but at a large premium of 2.75 pence/kWh. 2  Will cost 60-140 pounds more per year depending on usage"}, {"url": "http://www.which.co.uk/news/2012/09/new-eon-energy-tariffs-what-you-need-to-know-297673/", "passage_text": "This is expected to cost £1,148.24 per year for the average customer. It includes a winter payment of £10 (£20 for those over 80) and there is no cancellation fee. Meanwhile Eon Energy Fixed 1 year (which anyone can sign up to) will cost £1,158.74. This is significantly more expensive than the cheapest fixed plan on the market, First Utility’s iSave Fixed v4 March 2014, which is expected to cost £1,087. The cheapest variable deal from the energy giant is now Eon Energy Discount, which will cost £1,123.71 per year for the average user (including dual fuel discount). The current cheapest variable deal on the market is First Utility’s iSave v12, which will cost £1,054 per year for an average user"}, {"url": "https://www.ukpower.co.uk/home_energy/tariffs-per-unit-kwh", "passage_text": "1 Standing charge-this is a fixed amount that you are charged each day, regardless of how much gas or electricity you use. 2  Unit rate-this is the price you will pay per unit (kWh) of energy, so it can fluctuate depending on how much energy you use. Gas & Electricity Tariff Prices per Unit. Although many people may not realize it, the price that you pay for your energy is made up of two different charges: 1 "}]