[{"url": "https://en.wikipedia.org/wiki/Walia_ibex", "passage_text": "However, young ibex are often hunted by a variety of fox and cat species. The ibex are members of the goat family, and the walia ibex is the southernmost of today's ibexes. In the late 1990s, the walia ibex went from endangered to critically endangered due to the declining population. The walia ibex is also known as the Abyssinian ibex. The walia ibex is considered to be endangered by the IUCN and needs further conservation measures to survive. Since no captive population is kept anywhere in the world, the IUCN recommends capturing a few individuals to form the nucleus of a captive breeding group."}, {"url": "http://animaldiversity.org/accounts/Capra_walie/", "passage_text": "Conservation Status. Over the last half-century, Walia Ibex has been considered one of the most endangered ungulates in the world (Nievergelt, 1990). Today, this species is deemed critically endangered primarily because of the very small population left in the wild. Capra walie, or the Walia Ibex, is found exclusively in the mountains of northern Ethiopia. Nearly all of the remaining population resides along 25 kilometers of the northern escarpment in the Simien Mountains National Park (Massicot, 2001). 1  Biogeographic Regions. 2  ethiopian. 3  native."}, {"url": "https://en.wikipedia.org/wiki/Walia_ibex", "passage_text": "The walia ibex (Capra walie, Ge'ez: ዋልያ wālyā) is an endangered species of ibex. The walia ibex is considered to be endangered by the IUCN and needs further conservation measures to survive. Since no captive population is kept anywhere in the world, the IUCN recommends capturing a few individuals to form the nucleus of a captive breeding group."}, {"url": "http://abc.museucienciesjournals.cat/files/ABC_38-1_pp_1-10.pdf", "passage_text": "Animal Biodiversity and Conservation, 38.1: 1–10.AbstractHabitat preference of the endangered Ethiopian walia ibex (Capra walie) in the Simien Mountains National Park, Ethiopia.— Walia ibex (Capra walie) is an endangered and endemic species restricted to the Simien Mountains National Park, Ethiopia. 2006). The total area of the park is 412 km 2, and walia ibex habitats (mountainous regions and sub–afroalpine grasslands) are restricted to 94.1 km 2 .From 2000 to 2009, the mean annual rainfall at SMNP was 1,054 mm."}, {"url": "http://www.animalinfo.org/species/artiperi/caprwali.htm", "passage_text": "Picture: Walia Ibex (18 Kb JPEG) (. ). The walia ibex, a member of the goat family, weighs 80 - 125 kg (180 - 280 lb). It dwells on steep cliffs between 2500 - 4500 m (8200 - 14,750') in regions characterized by rocky mountains, gorges, outcrops and loose stony screes. Habitat: The walia ibex dwells on steep cliffs between 2500 - 4500 m (8200 - 14,750') in regions characterized by rocky mountains, gorges, outcrops and loose stony screes. It depends on undisturbed juniper and other mountain forest, subalpine grasslands and scrub, and a year-round supply of water."}, {"url": "http://thewebsiteofeverything.com/animals/mammals/Artiodactyla/Bovidae/Capra/Capra-walie.html", "passage_text": "The Walia ibex (Capra walie) is a species of wild goat that is found exclusively in the mountains of northern Ethiopia. It is also known as the abyssinian ibex. Nearly all of the remaining endangered population resides along 25 kilometers (15.5 miles) in the Simien Mountains National Park. The only known predator for the adults is the hyena, but the young are also often hunted by a variety of fox and cat species. Due to rapid population declines, the Walia ibex is classified as a critically endangered species."}, {"url": "http://www.livescience.com/28102-ibex.html", "passage_text": "According to the IUCN, the Walia ibex is endangered, with only about 500 of their kind left. One species, the Pyrenean ibex, was declared extinct in 2000. However, it may not be gone forever. In 2009, Spanish biologists used frozen tissue to clone a Pyrenean ibex. "}, {"url": "https://en.wikipedia.org/wiki/Walia_ibex", "passage_text": "It is sometimes considered a subspecies of the Alpine ibex. Threats against the species include habitat loss, poaching, and restricted range; only about 500 individuals survived in the mountains of Ethiopia, concentrated in the Semien Mountains, largely due to past poaching and habitat depletion. The walia ibex is considered to be endangered by the IUCN and needs further conservation measures to survive. Since no captive population is kept anywhere in the world, the IUCN recommends capturing a few individuals to form the nucleus of a captive breeding group."}]