[{"url": "http://education.seattlepi.com/littering-affect-environment-6802.html", "passage_text": "Litter consists of trash and household toxic substances that are improperly disposed of on land or in water. Whether the litter is intentional or unintentional, large or small, it can drastically affect the environment for years to come. Marine Litter. Litter that is tossed into the ocean can travel long distances with the currents and winds. Not only does this litter directly affect marine life and birds, but it also washes onto beaches, is caught in fishing nets, damages boat motors, is an eyesore and smells bad."}, {"url": "http://pollutionarticles.blogspot.com/2012/02/why-is-littering-bad-for-environment.html", "passage_text": "Littering can also sometimes lead to wildfires because it is possible for spark to hit a piece of litter like a paper bag and start a fire. Cigarettes could also start fire if not being properly put out prior to being littered. Many litter items are not biodegradable which means that their chemical decomposition takes a very long time and these items can therefore create long-term damage to environment (as this is the case with cigarette butts)."}, {"url": "http://pollutionarticles.blogspot.com/2012/02/why-is-littering-bad-for-environment.html", "passage_text": "Littering is a very frequent form of environmental pollution and a clear sign that our society still has to learn a lot when it comes to a global environmental conscience. Many litter items are not biodegradable which means that their chemical decomposition takes a very long time and these items can therefore create long-term damage to environment (as this is the case with cigarette butts)."}, {"url": "http://www.knowswhy.com/why-is-littering-bad/", "passage_text": "Littering is bad both for the environment and to our self. A â if we, litter it only means that we also throw away the gift of. LIFE A â as the, saying goes whatever we throw will come back to us a. hundred folds A â some litters can poison the land because there might be chemicals in it that are harmful to the. SOIL A â, with this plants and other organism. Might’die it s also hazardous to litter in bodies of water such as, the, seas, rivers. LAKES Streams a â too much litter can cause poison that might harm. the marine life"}, {"url": "http://pollutionarticles.blogspot.com/2012/02/why-is-littering-bad-for-environment.html", "passage_text": "Organic litter is particularly hazardous form of litter as it can even lead to a major water pollution and lead to a shortage of drinking water, for instance if there is garbage in a river then the water is no longer safe to drink. Organic litter has been also found to cause algal bloom in certain water bodies. Many litter items are not biodegradable which means that their chemical decomposition takes a very long time and these items can therefore create long-term damage to environment (as this is the case with cigarette butts)."}, {"url": "http://www.ehow.com/info_12088210_five-reasons-littering-bad.html", "passage_text": "Appearances. One of the obvious effects of littering is the negative impact it has on the appearance of an area. A litter-strewn location looks dirty and unsightly, making it a less pleasant environment for those that live in or use it. Litter that accumulates may also smell, further reducing the quality of a location. When littering becomes commonplace in an area, it sends the message that the practice is acceptable, and the result is that people continue to discard litter carelessly."}, {"url": "http://www.answers.com/Q/Why_is_the_effects_on_littering_so_bad", "passage_text": "Making the world better, one answer at a time. Littering is very bad for the environment! When animals eat the litter, they have indigestion problems and die. Littering effects rivers, if there is garbage in a river then the water is no longer able to drink. "}, {"url": "https://zambiagoesgreen.wordpress.com/2013/02/28/littering/", "passage_text": "Littering: Why it’s so Bad to Throw Trash on the Ground. February 28, 2013 · Filed under The Basic Issues. Throwing trash on the side of the road and on the ground looks bad, but it also hurts animals and plants. When you throw your trash on the ground instead of a garbage bin, it is called littering. The trash on the ground is called litter. First, litter is bad for people. As I said, it looks bad. "}]