[{"url": "http://energy.gov/about-us/web-policies/social-media", "passage_text": "Access to and Use of Social Media. The Department of Energy encourages the responsible use of social media consistent with current laws, policies and guidance that govern information and information technology."}, {"url": "http://energy.gov/about-us/web-policies/social-media", "passage_text": "Social Media. The Department of Energy is committed to expanding the conversation on energy issues and upholding open government principles of transparency, participation and collaboration. One of the key ways we seek to accomplish this is through the use of social media."}, {"url": "http://energy.gov/about-us/web-policies/social-media", "passage_text": "DON’T. 1  DON’T speak on behalf of the Department unless you are authorized to do so. 2  Energy Department social media content is considered official in nature, meaning it is meant to represent official messaging, policy and objectives of the Energy Department."}, {"url": "http://thehill.com/policy/technology/157501-state-dept-shifts-digital-resources-to-social-media", "passage_text": "The manpower once devoted to the site, provided through the State Department’s Bureau of International Information Programs (IIP), is being redirected toward the department’s “social media assets,” which use Twitter, Facebook and YouTube."}, {"url": "http://www.brookings.edu/blogs/up-front/posts/2012/10/26-ediplomacy-hanson", "passage_text": "It’s easy to assume this is just a broadcast function. But State’s use of social media is much broader than that. The paper identifies six different ways social media is being used by State. These include many that are obvious – like fast official messaging and consular updates – but many that are subtler."}, {"url": "https://www.dhs.gov/social-media-directory", "passage_text": "The Department of Homeland Security and its component agencies use numerous social media accounts to provide you with information in more places and more ways. The Department uses non-government sites to make information and services more widely available."}, {"url": "http://www.policechiefmagazine.org/magazine/index.cfm?fuseaction=display_arch&article_id=2951&issue_id=62013", "passage_text": "The social media policy must address. 1  why the law enforcement agency is using social media to investigate criminal activity and gather intelligence, and. 2  how this purpose is consistent with the agency’s mandate and authority."}, {"url": "http://www.informationweek.com/applications/top-14-government-social-media-initiatives/d/d-id/1102918", "passage_text": "It's the latest example of how local, state, and federal government agencies are using social media platforms and technologies to engage the public in a variety of ways, from providing information on government services to emergency response."}]