[{"url": "http://www.youtube.com/watch?v=CYqM-YdyyQc", "passage_text": "Type in the following: =Lower(the cell containing the capital letters). In this manner, you can change caps to lowercase in excel. Step 2 -- Drag the formula. You will see that the text written in the cell was copied to the one where you placed the formula. However in the transition process, the caps was changed to lowercase. "}, {"url": "https://support.office.com/en-us/article/Change-text-to-upper-lower-or-proper-normal-font-C4056AAB-8053-498F-A764-C23C6AD1C244", "passage_text": "Change text to upper, lower, or proper (normal) font. If you need to quickly change the text case to uppercase, lowercase, or proper (normal) case, use Flash Fill instead of retyping all the text. For example, column A has a list of names in lower case. Here's how you can change the names to proper case. "}, {"url": "http://www.ehow.com/how_8194719_convert-column-caps-excel.html", "passage_text": "Save. Unlike Microsoft Word, Excel does not have a Change Case button. To convert an existing column of text to all caps, you need to use the UPPER function in another column. This function copies the text from your original column and changes its cas"}, {"url": "http://smallbusiness.chron.com/change-font-capitalization-excel-30754.html", "passage_text": "Step 1. Open the Excel document that contains the words that you want to change to all caps. Step 2. Right-click on the header of the column to the right of the column of text that you want to convert to all caps. Select the Insert option from the drop-down menu to insert a new column. Related Reading: How to Change the Case in Excel 2007."}, {"url": "https://www.ablebits.com/office-addins-blog/2014/04/25/change-case-excel-uppercase-lowercase/", "passage_text": "Microsoft Excel has three special functions that you can use to change the case of text. They are UPPER, LOWER and PROPER. The upper() function allows you to convert all lowercase letters in a text string to uppercase. The lower() function helps to exclude capital letters from text. "}, {"url": "https://support.office.com/en-us/article/Change-the-case-of-text-01481046-0fa7-4f3b-a693-496795a7a44d", "passage_text": "Change the case of text. Unlike Microsoft Word, Microsoft Excel doesn't have a Change Case button for changing capitalization. However, you can use the UPPER, LOWER, or PROPER functions to automatically change the case of existing text to uppercase, lowercase, or proper case. Functions are just built-in formulas that are designed to accomplish specific tasks—in this case, converting text case. Use =UPPER(A2) in cases where you need to convert text to uppercase, replacing A2 with the appropriate cell reference. Now, fill down the formula in the new column. The quickest way to do this is by selecting cell B2, and then double-clicking the small black square that appears in the lower-right corner of the cell."}, {"url": "http://www.theexceladdict.com/_t/t031112.htm", "passage_text": "1 Find a blank cell to the right of the cell containing the uppercase text and enter the formula =LOWER(origtext) . 2  Replace ' origtext ' in the formula with the address of the cell that contains the original uppercase text i.e. =LOWER(A1) . 3  Excel will instantly convert it to lowercase. Next time here's what you can do: Find a blank cell to the right of the cell containing the uppercase text and enter the formula =LOWER(origtext). Replace 'origtext' in the formula with the address of the cell that contains the original uppercase text i.e. =LOWER(A1)."}, {"url": "https://support.microsoft.com/en-us/kb/263580", "passage_text": "The text that was in column A is now in lowercase: To make these cells lowercase in Excel 2003 and earlier versions of excel, follow these steps: The text that was in column A is now in lowercase: LOWER-Converts all uppercase letters in a text string to lowercase. UPPER-Converts all lowercase letters in a text string to uppercase. 1 Note The new column now contains the lowercase version of the text in column A. 2  Note You can also fill cells B2 through B7 by clicking cell B1, and then dragging the fill handle to cell B7. 3  Highlight cells B1 through B7, click Home, and then click Copy."}, {"url": "https://support.microsoft.com/en-us/kb/263580", "passage_text": "=LOWER(A1). 1  In column B, select all the cells to the right of the cells that contain data in column A. 2  On the Edit menu, point to Fill, and then click Down. 3  The new column now contains the lowercase version of the text in column A. 4  With the same range selected, click Copy on the Edit menu. 5  Select cell A1, and click Paste Special on the Edit menu. 6  D 1 Note The new column now contains the lowercase version of the text in column A. 2  Note You can also fill cells B2 through B7 by clicking cell B1, and then dragging the fill handle to cell B7. 3  Highlight cells B1 through B7, click Home, and then click Copy."}]