[{"url": "http://www.costowl.com/home-improvement/foundations-framing-install-cost.html", "passage_text": "1 Labor costs to pour and form concrete run somewhere around $3.50 to $7.00 per square foot. 2  One homeowner paid $11,000 for a crawl space for a 1,500 square foot home. 3  One customer in Texas received a quote for a 2,500 square foot foundation slab of about $20,000. Below are some concrete prices to help you determine your new concrete foundation cost. 1  Concrete is typically measured by cubic yards (3’x3’x3’). 2  An average cost for a cubic yard of concrete is $75 to $125, depending on how much is needed and local prices."}, {"url": "http://www.turtlesoft.com/Construction-Costs/Concrete/Footings_Per_Yard.htm", "passage_text": "Concrete construction unit cost for installation of concrete footings for a foundation or retaining wall. This cost covers the cost per volume for any size of footing. Use it in combination with the footing cost per foot. NOTE -- This is half of a two-part unit cost that covers any footing size. Goldenseal also includes one-part unit costs for footings in two common sizes, 6x16 and 8x24. "}, {"url": "http://www.costowl.com/home-improvement/foundations-framing-install-cost.html", "passage_text": "1 Concrete is typically measured by cubic yards (3’x3’x3’). 2  An average cost for a cubic yard of concrete is $75 to $125, depending on how much is needed and local prices. 3  Labor costs to pour and form concrete run somewhere around $3.50 to $7.00 per square foot. Below are some concrete prices to help you determine your new concrete foundation cost. 1  Concrete is typically measured by cubic yards (3’x3’x3’). 2  An average cost for a cubic yard of concrete is $75 to $125, depending on how much is needed and local prices."}, {"url": "http://ths.gardenweb.com/discussions/2345609/cost-of-concrete-footings-and-other-work", "passage_text": "1. Dig the trenches its $10,000. 2. provide and place steel in the trenches it is $30,000 (this seems crazy to me). 3. Provide the concrete is $17,500 ($133 a yard, really high). 4. Pour the concrete costs $25 a yard or $7,500 (also seems high just for pouring. Also, for flatwork, they're quoting me by the yard for 4 slabs. For 1st floor concrete floors (above grade) they're quoting me 150 a yard for flatwork."}, {"url": "http://www.concretenetwork.com/concrete/poured_concrete_retaining_walls/cost.html", "passage_text": "Retaining Wall Cost. Poured retaining walls with elaborate curves require complex formwork and will drive up cost for a wall. The total cost to have a concrete retaining wall installed will be a combination of material and labor prices. For a basic wall you can expect to pay between $30 and $40 per square foot. If you add a decorative finish, curves, steps, lighting or other upgrades, the cost will rise. For Ralston, $39 per square foot is the average cost he charges for a wall under 4 feet tall. For walls below 4 feet, he says his prices are often competitive with finished block. A block wall has to be stuccoed or finished with veneer, while a concrete wall does not need an added finish."}, {"url": "http://www.answers.com/Q/What_is_the_average_cost_of_concrete_footings_per_lineal_foot", "passage_text": "According t … o www.doityourself.com a yard of concrete will cost about $75.00 so a cubic foot will cost you $75/27, which would be about $2.78 per cubic foot. 1 foot of concrete is a very small volume so you will probably be charged for a minimum quantity which will be more that the cost of 1 foot. "}, {"url": "http://www.costowl.com/home-improvement/foundations-framing-install-cost.html", "passage_text": "1 An average cost for a cubic yard of concrete is $75 to $125, depending on how much is needed and local prices. 2  Labor costs to pour and form concrete run somewhere around $3.50 to $7.00 per square foot. 3  One homeowner paid $11,000 for a crawl space for a 1,500 square foot home. Below are some concrete prices to help you determine your new concrete foundation cost. 1  Concrete is typically measured by cubic yards (3’x3’x3’). 2  An average cost for a cubic yard of concrete is $75 to $125, depending on how much is needed and local prices."}, {"url": "http://home.costhelper.com/house-foundation.html", "passage_text": "1 A slab foundation for an average 1,600- to 1,800-square-foot family home might cost about $7,000-$16,000 or more, while a slab foundation for a 3,000- to 4,500-square-foot home might cost $13,000-$40,000 or more. "}, {"url": "http://turtlesoft.com/Construction-Costs/Concrete/Footings_Per_Foot.htm", "passage_text": "Concrete construction unit cost for installation of concrete footings for a foundation or retaining wall. This cost covers the cost per foot of any size of footing. Use it in combination with the footing cost per yard. NOTE -- This is half of a two-part unit cost that covers any footing size. "}]