[{"url": "https://en.wikipedia.org/wiki/Human_body_temperature", "passage_text": "Normal human body temperature, also known as normothermia or euthermia, depends upon the place in the body at which the measurement is made, the time of day, as well as the activity level of the person. Nevertheless, commonly mentioned typical values are: In humans, the average internal temperature is 37.0 °C (98.6 °F), though it varies among individuals. However, no person always has exactly the same temperature at every moment of the day. Temperatures cycle regularly up and down through the day, as controlled by the person's circadian rhythm."}, {"url": "http://hypertextbook.com/facts/LenaWong.shtml", "passage_text": "The normal core body temperature of a healthy, resting adult human being is stated to be at 98.6 degrees fahrenheit or 37.0 degrees celsius. "}, {"url": "https://answers.yahoo.com/question/index?qid=20070324183207AAcbX1Z", "passage_text": "Normal human temperature Previously, average oral temperature for healthy adults had been considered 98.6 °F (37.0 °C), while normal ranges are 36.1 to 37.8 °C. In Russia, the temperature had been measured axillary. 36.6 °C was considered ideal temperature, while normal ranges are 36 to 36.9 °C. Though the body temperature measured on an individual can vary, a healthy human body can maintain a fairly consistent body temperature that is around the mark of 37.0 degrees celsius."}, {"url": "http://www.answers.com/Q/What_is_the_Average_human_body_temperature_in_degrees_celsius", "passage_text": "The average normal human body temperature is 37 degrees C (98.6 degress F) but it can vary somewhat for an individual. The average adult temperature is 36.8 degrees C (98.2 degrees F). Older people will average a bit less. These values can also vary with time of day, with a typical individual range of 0.5 degrees C (0.9 degrees F). Temperatures can and will be markedly different with exposure to cold or hot environmental temperatures."}, {"url": "http://www.answers.com/Q/What_is_the_Average_human_body_temperature_in_degrees_celsius", "passage_text": "The equivalent to 98.6 degrees Fahrenheit is 37 degrees Celsius. This is the average normal human body temperature, which is slightly lower in adults. The range is 36.8 degr … ees plus or minus 0.7 degrees. Normal temperature range will vary, sometimes considerably, for individuals. The average adult temperature is 36.8 degrees C (98.2 degrees F). Older people will average a bit less. These values can also vary with time of day, with a typical individual range of 0.5 degrees C (0.9 degrees F). Temperatures can and will be markedly different with exposure to cold or hot environmental temperatures."}, {"url": "http://www.medicalhealthtests.com/articles/245/health-articles/body-temperature-scale.html", "passage_text": "According to the body temperature scale in Celsius, the temperature is normal when it is 37 degrees Celsius. Temperatures up to 37.3 and down to 36.7 are considered to be within the normal body temperature scale in Celsius. Hyperthermia occurs when the temperature rises above 37.3 degrees. The body temperature scale may also be represented using Fahrenheit temperatures. On the body temperature scale in Fahrenheit, an individual is considered to be hypothermic when the body temperature rises above 100 degrees Fahrenheit."}, {"url": "https://en.wikipedia.org/wiki/Human_body_temperature", "passage_text": "The normal human body temperature is often stated as 36.5–37.5 °C (97.7–99.5 °F). In adults a review of the literature has found a wider range of 33.2–38.2 °C (91.8–100.8 °F) for normal temperatures, depending on the gender and location measured. In humans, the average internal temperature is 37.0 °C (98.6 °F), though it varies among individuals. However, no person always has exactly the same temperature at every moment of the day. Temperatures cycle regularly up and down through the day, as controlled by the person's circadian rhythm."}, {"url": "http://www.webmd.com/first-aid/body-temperature", "passage_text": "Most people think of a normal body temperature as an oral temperature of 98.6°F (37°C) . This is an average of normal body temperatures. Your temperature may actually be 1°F (0.6°C) or more above or below 98.6°F (37°C) . "}, {"url": "http://www.urmc.rochester.edu/encyclopedia/content.aspx?ContentTypeID=85&ContentID=P00866", "passage_text": "Normal body temperature can range from 97.8 degrees F (or Fahrenheit, equivalent to 36.5 degrees C, or Celsius) to 99 degrees F (37.2 degrees C) for a healthy adult. A person's body temperature can be taken in any of the following ways: Orally. "}, {"url": "http://www.answers.com/Q/What_is_the_normal_human_body_temperature_in_Celsius", "passage_text": "Confidence votes 6.9K. The equivalent to 98.6 degrees Fahrenheit is 37 degrees Celsius. This is the average normal human body temperature, which is slightly lower in adults. The range is 36.8 degrees plus or minus 0.7 degrees. Normal temperature range will vary, sometimes considerably, for individuals. The average human body temperature is 98.6º F or 37º C, but it can vary somewhat. Average adult temperature is 98.2º F (36.8º C). Older people average a bit less. These va … lues can also vary with time of day."}]