[{"url": "https://www.pardons.org/pardons/faqs/", "passage_text": "Yes. If you are not a Canadian citizen, you can be removed from Canada for having a criminal record. Permanent residents may be deported if they are convicted of a serious offence in Canada. It is important to apply for your pardon/record suspension as soon as possible. It is also advisable to contact an immigration lawyer to discuss how the charge will affect your status as a permanent resident. Yes. People who have been deported can apply to come back to Canada with written permission from the Minister of Citizenship and Immigration. It is always best to receive a pardon/record suspension first then you can be sponsored by a family member to come back to Canada."}, {"url": "http://www.cic.gc.ca/english/information/inadmissibility/conviction.asp", "passage_text": "If you have been convicted in Canada and want to apply for a record suspension (formerly known as a pardon) , check with the Parole Board of Canada. If you get a Canadian record suspension, you will no longer be inadmissible. A Canadian immigration officer will decide if you can enter Canada when you apply for a visa, an Electronic Travel Authorization (eTA), or when you arrive at a port of entry. Under Canada’s immigration law, if you have committed or been convicted of a crime, you may not be allowed into Canada."}, {"url": "https://www.pardons.org/pardons/faqs/", "passage_text": "It takes an average of 12-24 months for a pardon/record suspension application to be processed and granted. However, to prepare the pardon/record suspension application, many documents must be collected. Acquiring the proper supporting documents takes between 3-10 months. Yes. People who have been deported can apply to come back to Canada with written permission from the Minister of Citizenship and Immigration. It is always best to receive a pardon/record suspension first then you can be sponsored by a family member to come back to Canada."}, {"url": "http://www.slsedmonton.com/criminal/how-to-get-a-pardon/", "passage_text": "• You can apply for a record suspension with the help of a lawyer or professional, but you do not need to. Record Suspension Application Guide and Application Form. The fist step in applying for a record suspension is getting a Record Suspension Application Guide from the PBC. If you have a criminal record that is more than five to ten years old, you may be eligible for a record suspension."}, {"url": "https://nationalpardon.org/how-long-does-it-take-to-get-a-canadian-pardon/", "passage_text": "If you are concerned about how long a pardon will take the only really good rule of thumb is the age old wisdom most of heard from our parents long ago. If it sounds too good to be true, it probably is. At the time of writing the National Pardon Centre is quoting 10 – 12 months start to finish for an expedited pardon. Anyone guaranteeing you a pardon in a certain number of months is just telling you what you want to hear. At the National Pardon Centre we provide estimates. We do our best to provide accurate estimates based on current processing times but it is not possible to accurately predict how long every file will take."}, {"url": "http://assuredpardons.com/canadian_pardon_faq.php", "passage_text": "Yes, a pardon can be revoked if: No. If the required waiting periods have passed for each of your convictions, and if you have met all of the other requirements, you can apply to have all of your convictions pardoned at the same time. For summary convictions, you must wait 3 years. If you have been charged with a crime and the charges against you were dismissed, stayed or withdrawn, you have a criminal record. A fingerprint number (FPS#) is assigned to your name and date of birth, and will exist until you take steps to have your record cleared."}, {"url": "http://assuredpardons.com/canadian_pardon_faq.php", "passage_text": "You do not need to apply for a pardon if you were found guilty in a youth court-your record will be destroyed as set out in the Young Offenders Act. If you have been charged with a crime and the charges against you were dismissed, stayed or withdrawn, you have a criminal record. A fingerprint number (FPS#) is assigned to your name and date of birth, and will exist until you take steps to have your record cleared."}, {"url": "http://assuredpardons.com/canadian_pardon_faq.php", "passage_text": "A pardon application can take anywhere from 1 to 12 months from the time the application is filed. Yes. Even if the exact date of eligibility is known, it is important to begin collecting the necessary paperwork as soon as possible because it can take several months. If you have been charged with a crime and the charges against you were dismissed, stayed or withdrawn, you have a criminal record. A fingerprint number (FPS#) is assigned to your name and date of birth, and will exist until you take steps to have your record cleared."}, {"url": "https://www.pardons.org/pardons/faqs/", "passage_text": "You cannot apply for a pardon/record suspension if your charge was a sexual conviction where the victim was a minor; if you have 4 or more indictable convictions, each of which 2 years or more of jail time was served. For discharges, waiting periods begin from the court date. Yes. People who have been deported can apply to come back to Canada with written permission from the Minister of Citizenship and Immigration. It is always best to receive a pardon/record suspension first then you can be sponsored by a family member to come back to Canada."}]