[{"url": "http://www.whatargentina.com/music-argentina.html", "passage_text": "Folk Music. Traditional Folk music characteristic of the indigenous populations of the Andes is still prominent in Argentina. It is particularly identifiable by the soft sound of wind, percussion and string instruments. Chamame chámame has become a deep rooted symbol of local tradition in this area Of, argentina, however its development was inspired by influences from much farther. Afield chamame, chámame is in, a Sense an argentine take on the traditional music Styles, Of germany Poland, and austria where polkas and waltzes were the order of. the day"}, {"url": "http://www.visitargentina.net/top-attractions/top-five-argentina-dances.html", "passage_text": "Top Five Argentina Dances. Dance is an important part of Argentina's culture. Although Argentina is basically famous as the exclusive the birthplace of the tango, the country is home to various music and dance styles from its many geographic regions. The Chacarera is another popular style which originated in Argentina. This dance goes back to the 19th century and is of folk genre and emerged from north western Argentina. The Chacarera is believed to have originated from the province of Santiago del Estero."}, {"url": "http://acad.depauw.edu/mkfinney_web/teaching/Com227/culturalPortfolios/argentina/Cultural%20Traditions.htm", "passage_text": "Dance and Music: Argentina has received worldwide fame for their native dance--the tango (see picture below). Immigrants from Africa and Europe brought the tango with them when they visited the brothels in Argentina in the 1880's. Thus, the tango was originally a dance for the lowest classes in Argentina. Art and Literature: The artistic world in Argentina is very prominent due to the European influences that have entered into society. The most famous literary writers in Argentina are Jorge Luis Borges, Julio Cort zar, Ernesto S basto, Manuel Puig and Osvaldo Soriano."}, {"url": "https://en.wikipedia.org/wiki/Music_of_Argentina", "passage_text": "Folk, pop and classical music are also popular, and Argentine artists like Mercedes Sosa and Atahualpa Yupanqui contributed greatly to the development of the nueva cancion. Canción argentine rock has also led to a defiant rock scene In. argentina Folk music —called musica música folklorica folklórica or Folklore, in spanish from transliteration Of the —english folklore comes in, many forms developed in different Parts of argentina With different european and. indigenous influences"}, {"url": "https://en.wikipedia.org/wiki/Music_of_Argentina", "passage_text": "Folk, pop and classical music are also popular, and Argentine artists like Mercedes Sosa and Atahualpa Yupanqui contributed greatly to the development of the nueva cancion. canción Folk music —called musica música folklorica folklórica or Folklore, in spanish from transliteration Of the —english folklore comes in, many forms developed in different Parts of argentina With different european and. indigenous influences"}, {"url": "http://www.whatargentina.com/music-argentina.html", "passage_text": "The most obvious music and dance to come out of Argentina is undoubtedly, the Tango, and we'll come to that later, but many of the different regions have their own musical styles which are serve as creative projections of the history and way of life in the area. Chamame chámame has become a deep rooted symbol of local tradition in this area Of, argentina, however its development was inspired by influences from much farther. Afield chamame, chámame is in, a Sense an argentine take on the traditional music Styles, Of germany Poland, and austria where polkas and waltzes were the order of. the day"}, {"url": "http://www.tremormusic.com/", "passage_text": "About. Tremor is a trio from Buenos Aires, Argentina, that combines rhythms and sound across genre borders, fitting component parts of varying tradition together in eloquent symmetry. The artist breaks sound barriers across South America and presents their digital folklore tracks to a new, global audience. "}, {"url": "https://en.wikipedia.org/wiki/Music_of_Argentina", "passage_text": "The music of Argentina is known mostly for the Tango, which developed in Buenos Aires and surrounding areas, as well as Montevideo, Uruguay. Folk music —called musica música folklorica folklórica or Folklore, in spanish from transliteration Of the —english folklore comes in, many forms developed in different Parts of argentina With different european and. indigenous influences"}]