[{"url": "http://georgia.sacreduniverse.com/category/cremation/", "passage_text": "Some cremations follow a funeral service where a viewing or visitation is held. In Georgia, one can arrange a cremation for as little as $700, but added goods and services can exceed $2,500. The national average cost for a direct cremation – with the container provided – is between $1,146 and $1,542."}, {"url": "http://www.neptunesociety.com/location/atlanta-cremation", "passage_text": "Prepaid Cremation, Atlanta GA. Establishing a cremation plan with Neptune Society Atlanta will bring you piece of mind; prepaying for cremation will bring you our best value. Neptune Atlanta offers safe and secure plans to prepay for Atlanta cremation services."}, {"url": "http://www.georgiacremationcenters.com/", "passage_text": "Georgia Cremation Centers serves the communities in Atlanta and all over the State of Georgia with a full range of cremation services, including custom memorial services, urns, and permanent memorial options."}, {"url": "http://www.heritagecremationprovider.com/cremation-services-costs/georgia", "passage_text": "Cremation services in Georgia will be able to direct you to the purchase of your own cremation urn which might cost as little as $50, while some people who intend to keep the urn on display for many years can pay as much as $2000+."}, {"url": "http://georgia.sacreduniverse.com/2011/11/cost-of-cremation-in-georgia/", "passage_text": "In many instances, family is allowed to view the cremation or a portion of it. Some cremations follow a funeral service where a viewing or visitation is held. In Georgia, one can arrange a cremation for as little as $700, but added goods and services can exceed $2,500. The national average cost for a direct cremation – with the container provided – is between $1,146 and $1,542. There are additional costs for different services, ceremonies, and merchandise, in addition to costs for facility and staff time related to selected services."}, {"url": "http://www.csog.com/", "passage_text": "The Cremation Society of Georgia is Georgia's first provider of cremation services. Society members come from all social, religious, and economic backgrounds, finding unity in their mutual attraction to the simplicity of the cremation rite."}]