[{"url": "http://www.huffingtonpost.com/2014/10/21/high-fiber-foods_n_1543165.html", "passage_text": "Apples. Alamy. When it comes to sources of fiber, apples are basically hiding in plain sight. Anything with 3 grams of fiber is considered a good source of fiber, and an excellent source is anything with 5 grams, Crandall says. An apple has about 4 grams of fiber.. Given that, eating just one a day can really help you meet your fiber goals. "}, {"url": "http://greatist.com/health/surprising-high-fiber-foods", "passage_text": "Fiber: 16.3 grams per cup, cooked. Go-To Recipe: Spinach and Yellow Split Pea Soup. A staple in Indian cooking, split peas form a terrific, protein-rich base for soups, stews, and dhals. This South Asian recipe is the best kind of comfort food: healthy, satisfying, and super filling. "}, {"url": "http://www.mayoclinic.org/healthy-lifestyle/nutrition-and-healthy-eating/in-depth/fiber/art-20043983", "passage_text": "Most plant-based foods, such as oatmeal and beans, contain both soluble and insoluble fiber. However, the amount of each type varies in different plant foods. To receive the greatest health benefit, eat a wide variety of high-fiber foods. 1 This type of fiber dissolves in water to form a gel-like material. 2  It can help lower blood cholesterol and glucose levels. 3  Soluble fiber is found in oats, peas, beans, apples, citrus fruits, carrots, barley and psyllium."}, {"url": "http://healthyeating.sfgate.com/sources-soluble-fiber-natural-foods-2125.html", "passage_text": "Legumes consist of seeds that are covered by a pod or shell. This classification of foods, which includes beans, lentils, peanuts and peas, is high in both soluble and insoluble fiber. Black beans, kidney beans and navy beans are especially high in soluble fiber. Each contains at least 2 grams per 1/2-cup serving. Fiber is a type of carbohydrate that does not get digested in the system. Fiber is either insoluble and soluble. Both types fill you up, which is good for weight loss, but soluble fiber gives you a little more bang for your buck. Once it is consumed, it attracts water and forms a gel-like consistency in your stomach"}, {"url": "http://www.mensfitness.com/nutrition/what-to-eat/10-best-sources-of-fiber", "passage_text": "next. 6 Ways to Stop Excessive Sweating. One of the keys to unlocking a lifelong lean and healthy body is fueling your body with low impact high fiber foods. These are foods that contain ample amounts of fiber but don’t contain a lot of other carbohydrates that will send your blood sugar levels on a roller coaster ride. "}, {"url": "http://www.whfoods.com/genpage.php?tname=foodspice&dbid=7", "passage_text": "At about 3 grams per medium banana, we rank bananas as a good source of fiber. Approximately one-third of the fiber in bananas is water-soluble fiber. For one medium-sized banana, this amount translates into 1 gram of soluble fiber per banana. "}, {"url": "http://www.mayoclinic.org/healthy-lifestyle/nutrition-and-healthy-eating/in-depth/fiber/art-20043983", "passage_text": "1 Soluble fiber. 2  This type of fiber dissolves in water to form a gel-like material. 3  It can help lower blood cholesterol and glucose levels. 4  Soluble fiber is found in oats, peas, beans, apples, citrus fruits, carrots, barley and psyllium. 1 This type of fiber dissolves in water to form a gel-like material. 2  It can help lower blood cholesterol and glucose levels. 3"}, {"url": "http://www.whfoods.com/genpage.php?tname=foodspice&dbid=90", "passage_text": "1 We correctly think about corn as a good source of fiber. 2  Corn is a food that gives us plenty of chewing satisfaction, and its high ratio of insoluble-to-soluble fiber is partly the reason. 3  Past researchers have not been clear, however, about the ability of corn fiber to nourish our lower digestive tract. Some of that satisfaction comes from corn's fiber content. At 4.6 grams of fiber per cup, corn is a good fiber source, and in research studies, corn intake is often associated with good overall fiber intake."}]