[{"url": "http://homeguides.sfgate.com/much-deposit-need-home-loan-6967.html", "passage_text": "A down payment is required by most lenders for a mortgage. Mortgage lenders require home buyers to place a deposit or down payment in order to secure the loan and provide insurance against default. If the buyer fails to make payments and defaults on the loan, the lender keeps the down payment as partial compensation."}, {"url": "https://www.stgeorge.com.au/personal/home-loans/tools/faqs/getting-started", "passage_text": "Generally, a 20% deposit is required to borrow without mortgage insurance. However, with Lender's Mortgage Insurance you only need a 5% deposit if you've been a St.George customer for at least 6 months, or 10% if you are new to St.George. 2."}, {"url": "https://www.loanmarket.co.nz/products/how-much-deposit-do-i-need-for-a-home-loan", "passage_text": "Minimum deposits vary between lenders and depend on the loan product you choose. A deposit of 20% or more will help you avoid paying Lender’s Mortgage Insurance (LMI), however you can still get a home loan with a smaller deposit."}, {"url": "https://www.banksa.com.au/personal/home-loans/tools/faqs/getting-started", "passage_text": "Generally, a 20% deposit is required to borrow without mortgage insurance. However, with Lender's Mortgage Insurance you only need a 5% deposit if you've been a BankSA customer for at least 6 months, or 10% if you are new to BankSA."}, {"url": "http://www.which.co.uk/money/mortgages-and-property/guides/mortgage-deposit-explained/how-much-deposit-do-i-need-for-a-mortgage/", "passage_text": "The cheapest mortgage deals on the market will typically require you to have a 40% deposit or more, so on a £150,000 property this would mean a deposit of £60,000. However, saving up a 40% deposit is unrealistic for many people."}, {"url": "http://www.yourmortgage.com.au/article/how-much-deposit-does-a-homebuyer-need-117214.aspx", "passage_text": "For instance, on a home purchase of $400,000, you could access a 95% loan of $380,000, meaning you’ll need to provide a cash deposit of $20,000. However, you can add the cost of LMI of to the loan amount (up to $8,000), which brings the total loan up to $388,000 or 97%."}, {"url": "http://homeguides.sfgate.com/much-deposit-need-home-loan-6967.html", "passage_text": "If the down payment is five percent, the interest rate is 7 percent, and the maximum mortgage payment the buyer can make is $1,060, then the buyer can afford a $167,712 house. With a 20-percent down payment, however, the buyer can shop for a $199,158 house."}]