[{"url": "http://www.thefreedictionary.com/given+name", "passage_text": "1. 'first name'. Your first name is the name that was given to you when you were born. Your first name comes in front of your surname. At some point in the conversation Brian began calling Philip by his first name. 2. 'Christian name'. In British English, people sometimes use Christian name instead of first name. A name given to a person at birth or at baptism, as distinguished from a surname."}, {"url": "http://www.behindthename.com/glossary/view/given_name", "passage_text": "A given name is a name that is assumed by a person at or after birth. As opposed to a family name, it is generally not inherited. In Europe and North America, where the given name precedes the family name, given names are called first names or forenames. They are also sometimes called Christian names. "}, {"url": "https://en.wikipedia.org/wiki/Surname", "passage_text": "A surname or family name is a name added to a given name. In many cases, a surname is a family name and many dictionaries define surname as a synonym of family name.. In the western hemisphere, it is commonly synonymous with last name because it is usually placed at the end of a person's given name. First/given, middle, and last/family/surname diagram with J. S. Bach as example. J. S. Bach shared his given name with six immediate family members and many extended family members. He shared his family name with most"}, {"url": "https://answers.yahoo.com/question/index?qid=20080402021736AAFTggi", "passage_text": "When writing my full name, I put my first name or given name in front of my father's name. So does my Dad, he put his first/given name before his father's name. Example: My name is Thomas Jefferson. My Dad is Jefferson Charles. For me, my given name is Thomas and my surname is Jefferson. Please tell me in simple words what is my Surname and Given Name. In our country we do not write names in this way (sur and given), I always write my name in my educational and official documents in this way: Name: Waqas Ahmad Nisar Father Name: Nisar Ahmad Even this is written on my..."}, {"url": "https://answers.yahoo.com/question/index?qid=20080402021736AAFTggi", "passage_text": "Given Name(s): Waqas Ahmad Surname: Nisar Simply put, your last name is your surname. First Name: Waqas Middle Name: Ahmad Last name: Nisar Note: Your father's full name does not make any difference. Only your name matters. Please tell me in simple words what is my Surname and Given Name. In our country we do not write names in this way (sur and given), I always write my name in my educational and official documents in this way: Name: Waqas Ahmad Nisar Father Name: Nisar Ahmad Even this is written on my..."}, {"url": "https://en.wikipedia.org/wiki/Given_name", "passage_text": "First/given, middle, and last/family/surname diagram with J.S. Bach as example. J. S. Bach shared his given name with six immediate family members and many extended family members. He shared his family name with most family members. It identifies a specific person, and differentiates that person from other members of a group, such as a family or clan, with whom that person shares a common surname. The term given name refers to the fact that the name is bestowed upon, or given to a child, usually by its parents, at or near the time of birth."}, {"url": "https://en.wikipedia.org/wiki/Given_name", "passage_text": "A given name (also known as a personal name, first name, forename, or Christian name) is a part of a person's full nomenclature. It identifies a specific person, and differentiates that person from other members of a group, such as a family or clan, with whom that person shares a common surname. The term given name refers to the fact that the name is bestowed upon, or given to a child, usually by its parents, at or near the time of birth."}, {"url": "https://answers.yahoo.com/question/index?qid=20120921191920AA963YZ", "passage_text": "Report Abuse. Your first name is your given name. Your last name is your surname and your family name, they are the same thing. So if your name is legally Tiffany Park Patcharapa then your first name is Tiffany and your surname/family name is Patcharapa. Leah · 3 years ago. Thumbs up. Your family name is the same. Parks is ur name surname,given and family. If you are of Spanish decent then you have two last names. Mom's madden name and Dad's last name. If u live in the US. Use ur fathers last name. When you get married then you can take his name."}, {"url": "http://www.answers.com/Q/What_is_the_difference_between_given_name_and_first_name", "passage_text": "Confidence votes 52.6K. AnswerYour given name is the name that your parents gave you when you were born. Your first name is your actual name now. For example your given name could be Joe Black, but when you turned twenty you changed it to Larry Black. Joe is your given name and Larry is now your first name."}]