[{"url": "http://www.medscape.com/viewarticle/571418_7", "passage_text": "In adults, the manufacturer recommends an oral dose of 150 mg to 300 mg every 6 hours for serious infections and a dose of 300 to 450 mg every 6 hours for severe infections. Clindamycin capsules should be taken with a full glass of water to prevent esophagitis. 7 of 9. In older neonates, a dose of 20-30 mg/kg/day may be divided and given every 6 to 8 hours. The recommended adult dose for parenteral clindamycin is 600 to 1,200 mg/day divided and given IV or IM every 12, 8, or 6 hours."}, {"url": "https://www.pfizermedicalinformation.com/en-us/cleocin-pediatric", "passage_text": "CLEOCIN PEDIATRIC (clindamycin palmitate HCl) is indicated in the treatment of serious infections caused by susceptible anaerobic bacteria. Clindamycin is also indicated in the treatment of serious infections due to susceptible strains of streptococci, pneumococci and staphylococci. See WARNING box. Clostridium difficile associated diarrhea (CDAD) has been reported with use of nearly all antibacterial agents, including CLEOCIN PEDIATRIC (Clindamycin Palmitate HCL) , and may range in severity from mild diarrhea to fatal colitis."}, {"url": "http://www.medscape.com/viewarticle/571418_7", "passage_text": "The recommended oral dose of clindamycin in children with serious infections is 8 to 16 mg/kg/day divided and given every 6 or 8 hours. In those with more severe infections, a higher dose of 16 to 20 mg/kg/day may be used. In older neonates, a dose of 20-30 mg/kg/day may be divided and given every 6 to 8 hours. The recommended adult dose for parenteral clindamycin is 600 to 1,200 mg/day divided and given IV or IM every 12, 8, or 6 hours."}, {"url": "http://www.webmd.com/drugs/2/drug-163002/clindamycin-pediatric-oral/details", "passage_text": "How to use Clindamycin Pediatric. Shake the bottle well before each dose. Then carefully measure out the prescribed amount of medication. Take it by mouth with or without food, usually 3 or 4 times a day, or as directed by your doctor. Uses. Clindamycin is used to treat a wide variety of serious bacterial infections. It is an antibiotic that works by stopping the growth of bacteria. This antibiotic only treats bacterial infections. It will not work for viral infections (e.g., common cold, flu)."}, {"url": "http://www.druglib.com/druginfo/cleocin-pediatric/indications_dosage/", "passage_text": "CLEOCIN PEDIATRIC (clindamycin palmitate HCl) is indicated in the treatment of serious infections caused by susceptible anaerobic bacteria. Clindamycin is also indicated in the treatment of serious infections due to susceptible strains of streptococci, pneumococci and staphylococci. To reduce the development of drug-resistant bacteria and maintain the effectiveness of CLEOCIN PEDIATRIC and other antibacterial drugs, CLEOCIN PEDIATRIC should be used only to treat or prevent infections that are proven or strongly suspected to be caused by susceptible bacteria."}, {"url": "http://www.medscape.com/viewarticle/571418_7", "passage_text": "The parenteral dose for clindamycin in children is 20 to 40 mg/kg/day divided and given IV or IM every 6 or 8 hours. In neonates, the dose should be based on both weight and age, to allow for a slower elimination. In preterm neonates less than 2 kg, a dose of 10 mg/kg/day should be divided and given every 12 hours. In older neonates, a dose of 20-30 mg/kg/day may be divided and given every 6 to 8 hours. The recommended adult dose for parenteral clindamycin is 600 to 1,200 mg/day divided and given IV or IM every 12, 8, or 6 hours."}, {"url": "http://www.webmd.com/drugs/2/drug-163002/clindamycin-pediatric-oral/details", "passage_text": "This medication should be used only for serious bacterial infections because it can sometimes cause a severe (rarely fatal) intestinal condition (Clostridium difficile-associated diarrhea) due to a resistant bacteria. This condition may occur during treatment or even weeks after treatment has stopped. Uses. Clindamycin is used to treat a wide variety of serious bacterial infections. It is an antibiotic that works by stopping the growth of bacteria. This antibiotic only treats bacterial infections. It will not work for viral infections (e.g., common cold, flu)."}, {"url": "https://www.pfizermedicalinformation.com/en-us/cleocin-pediatric", "passage_text": "In pediatric patients weighing 10 kg or less, ½ teaspoon (37.5 mg) three times a day should be considered the minimum recommended dose. Serious infections due to anaerobic bacteria are usually treated with CLEOCIN PHOSPHATE ® Sterile Solution. See WARNING box. Clostridium difficile associated diarrhea (CDAD) has been reported with use of nearly all antibacterial agents, including CLEOCIN PEDIATRIC (Clindamycin Palmitate HCL) , and may range in severity from mild diarrhea to fatal colitis."}]