[{"url": "http://www.inkpal.com/ink-news/inkjet-cartridges-may-look-cheaper-than-laser-toners-but-looks-are-deceiving/", "passage_text": "Laser Toner Lasts Longer than Ink. Now let's compare these costs per page to a laserjet printer. An HP laser printer that retails for $400 and uses a $115 laser toner will yield around 8,000 pages. If you print 40,000 pages the cost will be approximately $400, plus $460 for the ink toner. That’s a total cost of $860. A similar Brother laserjet printer costs around $930 for the same number of pages. The total cost is less than $.02 a page, which is eight times less than the cost of an inkjet."}, {"url": "http://www.pcmag.com/article2/0,2817,2367866,00.asp", "passage_text": "Lexmark T650n. ($749 direct). The cost per page for a number of single-function printers in the $500 and up price range falls between 1.7 and 1.8 cents, but the Lexmark T650n is closer to 1.7 cents than some of its direct competitors. In an office that prints 10,000 or more pages a month, even small differences can add up. Lexmark T650n($749 direct) The cost per page for a number of single-function printers in the $500 and up price range falls between 1.7 and 1.8 cents, but the Lexmark T650n is closer to 1.7 cents than some of its direct competitors. In an office that prints 10,000 or more pages a month, even small differences can add up."}, {"url": "http://www.ganson.com/TCO-For-Color.html", "passage_text": "Laser Printer Cost Advantages. Consider that an entry level business Color Laser printer can be bought for less than $250. If one uses the same cost comparison method, the cost is less than $0.16 per page. ($231 street price divided by 1500 sheets = $0.154 per page). The savings become even greater when the costs of the printer and subsequent high capacity replacement toner cartridges are used and factored in over a 3 year period. It’s not uncommon for inkjet cost per page analyses to work out to be $0.25 to more than a $1 per page. Be sure to consider all of the costs when you attempt to compare printers! For a relatively low volume of 50 to 100 pages a month, the supply costs aren’t too bad!"}, {"url": "http://www.computerhope.com/issues/ch001400.htm", "passage_text": "1 More efficient use of toner-a laser printer is efficient on toner use, compared to Inkjet printer usage of ink. 2  A laser printers cost per page can be considerably less, which means a total lower cost of ownership over the life of the printer. 1 A laser printers cost per page can be considerably less, which means a total lower cost of ownership over the life of the printer. 2  Faster print speeds-a laser printer can print documents quite fast, especially larger documents, when compared to an Inkjet printer."}, {"url": "http://www.ganson.com/TCO-For-Color.html", "passage_text": "(the considered useful life of a laser printer!) The use of high capacity toner cartridges can lower the costs even more! ($231 divided by 5000 sheets = $0.046 per page). Be sure to consider all of these issues when you start to compare printers. It’s not uncommon for inkjet cost per page analyses to work out to be $0.25 to more than a $1 per page. Be sure to consider all of the costs when you attempt to compare printers! For a relatively low volume of 50 to 100 pages a month, the supply costs aren’t too bad!"}, {"url": "http://www.printershowcase.com/color-laser-printers.aspx", "passage_text": "Compare color laser printers by category. Cost per page calculations include all printer supplies and maintenance kits where applicable. "}, {"url": "http://www.computerhope.com/issues/ch001400.htm", "passage_text": "1 Less efficient ink use-Inkjet printers have a higher cost per page when it comes to printing, due to their rather inefficient usage of ink. 2  When compared to Inkjet printers laser printers are much more efficient with their toner. 1 A laser printers cost per page can be considerably less, which means a total lower cost of ownership over the life of the printer. 2  Faster print speeds-a laser printer can print documents quite fast, especially larger documents, when compared to an Inkjet printer."}, {"url": "http://wirthconsulting.org/2012/07/16/review-save-money-compare-printers-cost-per-page-not-just-purchase-price/", "passage_text": "For instance, if my color inkjet printer has a color cost per page of 7¢ while my color laser printer has a cost per page of 20¢, if I’m printing a 1,000 pages per month on my inkjet printer, my ink cartridge cost will add up to $70 per month, while my color laser printer’s cartridges will cost me $200 per month. In fact, cost per page can be considerably lower with these business-class inkjets versus color laser printers/All-in-Ones – for instance, 9 cents for inkjet color cost per page versus up to 26 cents for a comparable color laser printer/All-in-One."}]