[{"url": "http://www.smokingmeatforums.com/t/95861/best-practice-for-reheating-brisket", "passage_text": "I like the crock pot, or sealed tightly in foil in a low oven approach. With either one, I add some thinned out bbq sauce to provide a little liquid and just let them slowly come up to temp. Also, i find that if you keep your left over brisket in a chunk instead of slicing it, it doesn't dry out so bad. I wish I had some of that brisky. I'm in the middle of a house remodel and my smoker has benn cool and dark for about a month now."}, {"url": "http://www.virtualweberbullet.com/storing.html", "passage_text": "Most barbecued meats refrigerate and reheat well. Reheating low and slow in the microwave, oven or smoker is the key. Cooked meat can be refrigerated up to 4 days; otherwise it should be frozen. Use a Foodsaver vacuum sealing machine or Ziploc freezer bags to portion meats before freezing."}, {"url": "http://www.auntsassysauces.com/aunt-sassy/cooking-tip-15-how-to-reheat-food-without-drying-it-out/", "passage_text": "When it comes time to reheat a meal, forget the microwave as it can sometimes dry out your food, alter the original taste and remove nutrients. Our little trick will keep your food moist, hot and preserve the nutrients inside of it! Grab a large pot and fill it with about 1 – 2 inches of water. Then take a smaller pot (one that can fit inside the large pot), fill it with your food, and carefully place it into the large pot."}, {"url": "http://www.livestrong.com/article/481905-how-to-reheat-a-brisket/", "passage_text": "Reheat a brisket so it stays moist and tender, just as when it first came out of the oven or smoker. Reserving the juices when you cook it makes reheating easier, but you can use other liquids, if necessary. Chilled brisket is actually easier to cut so the reheating stage is the ideal time to cut it into slices. Step 8. Photo Credit Holli Alvarado/Demand Media. Place the pan in the preheated oven and cook for about 30 minutes, or until the meat is heated throughout and it reaches 165 degrees on a meat thermometer. 1  Pour 1 cup of water or broth over the brisket if you do not have any remaining pan ju"}, {"url": "http://kamadojim.com/how-to-properly-reheat-brisket/", "passage_text": "Set the oven for 300F and plan to reheat about 20 minutes or so if it’s already sliced or up to an hour or so if it isn’t. You should then have yourself a perfectly warm and moist brisket dinner that’s every bit as good as it was when it first came off the smoker. Some folks will tell you to let it thaw slowly in the refrigerator, but that isn’t necessary. The sink is perfectly fine. Next, take your brisket and place it in an oven-safe baking dish. Pour in just enough beef broth to cover the bottom of the dish and then tightly wrap the dish in aluminum foil."}, {"url": "http://www.youtube.com/watch?v=mF7QRszgbqQ", "passage_text": "Thaw them out before you reheat them. Then reheat them in the oven at 250 degrees for about an hour. That'll dry them out. Wrap it up in two or three layers of foil to keep the juices in, and cover it in extra sauce to be sure."}, {"url": "http://www.thekitchn.com/the-best-ways-to-reheat-leftovers-tips-from-the-kitchn-219381", "passage_text": "1. Foods to Reheat in the Oven or Toaster Oven. The toaster or toaster oven is usually my go-to reheating appliance because it provides even, gentle heating. If you're worried that food will dry out, just cover it with foil. "}, {"url": "http://bbq.about.com/cs/barbecuetips/a/aa083102s.htm", "passage_text": "Keep the meat wrapped to avoid drying it out. If you need to reheat it faster thaw the meat in the microwave on the proper thaw setting. Be careful that the thawing doesn't actually start cooking the meat. Once defrosted, microwave the meat on a setting of 50%. The microwave with soften any crusty parts of the meat. "}, {"url": "http://www.chowhound.com/food-news/125882/how-to-reheat-meat-without-overcooking/", "passage_text": "Chowhounds recently shared their strategies for gently reheating meat. Wrapping in foil and reheating in the oven is inaplasticcup 's preferred method. But if you decide to use the microwave, covering the meat with a damp paper towel will create steam that helps keep it from drying out. "}]