[{"url": "http://www.minerals.net/mineral/titanite.aspx", "passage_text": "The Mineral titanite. Titanite is frequently called by the name Sphene, which was the more popular term for this mineral prior to 1982. In 1982, the IMA adopted the official name as Titanite and discredited Sphene. The name Sphene is still frequently used, especially in Europe. Sphene also persists as the more prevalent name for faceted Titanite gemstones or transparent crystal forms. Titanite is known for its high luster and dispersion rate. Titanite is named for its titanium content. Its alternate name Sphene is named from the Greek term sphenos, which means wedge, in allusion to the typical wedge-shaped crystals exhibited by this mineral. For additional information, see the gemstone section on Sphene."}, {"url": "https://en.wikipedia.org/wiki/Perovskite", "passage_text": "Perovskite (pronunciation: /pəˈrɒvskaɪt/) is a calcium titanium oxide mineral composed of calcium titanate, with the chemical formula Ca Ti O 3. The mineral was discovered in the Ural Mountains of Russia by Gustav Rose in 1839 and is named after Russian mineralogist Lev Perovski (1792–1856). "}, {"url": "https://en.wikipedia.org/wiki/Titanite", "passage_text": "Titanite is a source of titanium dioxide, TiO 2, used in pigments. As a gemstone, titanite is usually some shade of chartreuse, but can be brown or black. Hue depends on Fe content, with low Fe content causing green and yellow colours, and high Fe content causing brown or black hues. Zoning is typical in titanite. It is prized for its exceptional dispersive power (0.051, B to G interval) which exceeds that of diamond."}, {"url": "http://www.gemselect.com/gem-info/sphene/sphene-info.php", "passage_text": "Sphene is a very rare brilliant yellowish-green, green, orange or brown gemstone with a high lustre, also known as titanite due to its titanium content. The name sphene comes from the Greek word, sphen, meaning wedge, which alludes to the formation of its crystals. Sphene can occur yellow, brown, green or reddish and various shades in between, such as cognac colour. Intense green sphene is also known as chrome sphene, due to the colour agent being chromium."}, {"url": "https://en.wikipedia.org/wiki/Titanite", "passage_text": "Titanite, or sphene (from the Greek sphenos (σφηνώ), meaning wedge), is a calcium titanium nesosilicate mineral, Ca Ti Si O 5. Trace impurities of iron and aluminium are typically present. Also commonly present are rare earth metals including cerium and yttrium; calcium may be partly replaced by thorium. Hue depends on Fe content, with low Fe content causing green and yellow colours, and high Fe content causing brown or black hues. Zoning is typical in titanite. It is prized for its exceptional dispersive power (0.051, B to G interval) which exceeds that of diamond."}, {"url": "http://www.minerals.net/gemstone/sphene_gemstone.aspx", "passage_text": "Sphene is the gemstone name of the mineral Titanite. Sphene is known for its exceptional dispersion, resulting in gemstones that show brilliant fire. The dispersion of Sphene exceeds even that of Diamond. However, the relatively low hardness of Sphene inhibits its use as a mainstream gemstone."}, {"url": "http://www.gemselect.com/gem-info/sphene/sphene-info.php", "passage_text": "Sphene Colour Sphene can occur yellow, brown, green or reddish and various shades in between, such as cognac colour. Intense green sphene is also known as chrome sphene, due to the colour agent being chromium. Chrome sphene and yellowish-green sphene are the most desirable colours."}, {"url": "http://www.gemstoneslist.com/sphene.html", "passage_text": "Sphene (also called Titanite) is a fairly uncommon calcium titanium nesosilicate mineral with the chemical formula CaTiSiO 5. "}, {"url": "http://geology.about.com/od/minerals/ig/silicates/minpictitanite.htm", "passage_text": "Titanite is CaTiSiO 5, a yellow or brown mineral that forms characteristic wedge or lozenge-shaped crystals. (more below). Titanite is typically found in calcium-rich metamorphic rocks and scattered in some granites. Its chemical formula often includes other elements (Nb, Cr, F, Na, Fe, Mn, Sn, V or Yt). Titanite has long been known as sphene. That name is now deprecated by the mineralogical authorities, but you may still hear it used by mineral and gem dealers, collectors, and geological old-timers. Other Primary Miner"}]