[{"url": "https://en.wikipedia.org/wiki/Visigoths", "passage_text": "These tribes flourished and spread during the late Roman Empire in Late Antiquity, or the Migration Period. The Visigoths emerged from earlier Gothic groups (possibly the Thervingi) who had invaded the Roman Empire beginning in 376 and had defeated the Romans at the Battle of Adrianople in 378. (Little else is known about the Visigoths' history during the 7th century, since records are relatively sparse.) In 711 or 712, a force of invading Arabs and Berbers defeated the Visigoths in the Battle of Guadalete. Their king and many members of their governing elite were killed, and their kingdom rapidly collapsed."}, {"url": "https://en.wikipedia.org/wiki/Visigoths", "passage_text": "The Visigoths invaded Italy under Alaric I and sacked Rome in 410. After the Visigoths sacked Rome, they began settling down, first in southern Gaul and eventually in Spain and Portugal, where they founded the Visigothic Kingdom and maintained a presence from the 5th to the 8th centuries AD. (Little else is known about the Visigoths' history during the 7th century, since records are relatively sparse.) In 711 or 712, a force of invading Arabs and Berbers defeated the Visigoths in the Battle of Guadalete. Their king and many members of their governing elite were killed, and their kingdom rapidly collapsed."}, {"url": "https://en.wikipedia.org/wiki/Portuguese_people", "passage_text": "Portuguese people (Portuguese: os portugueses) are an ethnic group native to the country of Portugal, in the west of the Iberian Peninsula of Southwestern Europe. Portuguese people were a key factor to the Age of Exploration, discovering several unknown lands to the Europeans in Americas, Africa, Asia and Oceania."}, {"url": "https://en.wikipedia.org/wiki/Visigoths", "passage_text": "The Visigoths first settled in southern Gaul as foederati of the Romans-a relationship established in 418. However, they soon fell out with their Roman hosts (for reasons that are now obscure) and established their own kingdom with its capital at Toulouse. (Little else is known about the Visigoths' history during the 7th century, since records are relatively sparse.) In 711 or 712, a force of invading Arabs and Berbers defeated the Visigoths in the Battle of Guadalete. Their king and many members of their governing elite were killed, and their kingdom rapidly collapsed."}, {"url": "http://www.themiddleages.net/visigoths.html", "passage_text": "The Visigoths were one of two main branches of the East Germanic tribe known as Goths (the other tribe is the Ostrogoths). The Goths were among the Germanic peoples who disturbed the late Roman Empire during the Migration Period, following a Visigothic force led by Alaric I's sacking of Rome in 410. "}, {"url": "http://historymedren.about.com/od/vterms/g/Visigoths.htm", "passage_text": "By Melissa Snell. Definition: The Visigoths were a tribe of Germanic people who were very active during the waning years of the Western Roman Empire and the following few centuries. Originally part of the Gothic people, the Visigoths are believed to have broken away from them in the 4th century C.E. "}, {"url": "http://www.ancient.eu/visigoth/", "passage_text": "The Visigoths were the western tribe of the Goths (a Germanic people) who settled west of the Black Sea sometime in the 3rd century CE. Theodosius I then became emperor of the Western Roman Empire and tried to halt the progress of the Visigoths as they then swept on to Thrace. In 382 CE a peace treaty was concluded between Athanaric of the Visigoths and Theodosius I of Rome."}, {"url": "http://www.answers.com/Q/Where_did_the_visigoths_originate", "passage_text": "The Visigoths and Ostrogoths were originally Goths, a Germanic tribe who lived in what is now Scandinavia. In the third century A.D. the Goths invaded the eastern provinces of … the Roman Empire, and during the fourth century they broke into two groups. After sacking Rome in 410, the Visigoths were driven into Gaul by Constantius III in 412. They settled in Aquitania (Gaul). They established a kingdom in Gaul, and through conquest, they extended their territory into Hispania (modern-day Spain and Portugal)."}, {"url": "http://www.spainthenandnow.com/spanish-history/visigoths-or-invisigoths/default_155.aspx", "passage_text": "From the beginning of the 6th century to the early years of the 8th, the Visigoths dominated Hispania (i.e. the Iberian Peninsula), but we would be hard put to find any substantial evidence of their presence. How substantial these Visigothic contributions were for the future country of Spain (or Portugal) is open to debate. Some Spanish historians view these years as the birth of the nation, others reject even the idea that the Visigoths were Spaniards."}]