[{"url": "http://2012books.lardbucket.org/books/introduction-to-chemistry-general-organic-and-biological/s21-09-enzyme-cofactors-and-vitamins.html", "passage_text": "Most water-soluble vitamins act as coenzymes or are required for the synthesis of coenzymes. The fat-soluble vitamins are important for a variety of physiological functions. Most coenzymes are vitamins or are derived from vitamins. VitaminsAn organic compound that is essential in very small amounts for the maintenance of normal metabolism. are organic compounds that are essential in very small (trace)"}, {"url": "https://quizlet.com/15212245/chapter-7-vitamins-flash-cards/", "passage_text": "Water Soluble VItamins. Include the B vitamins and vitamin C. Where the B vitamins are directly involved in the synthesis of ATP from fat, Carbohydrates and protein, (Co-enzymes in the production of Acetyl-CoA), and vitamin C is needed to synthesize connective tissue and protect from oxidative damage or free radicals. Biotin. a water-soluble vitamin that also functions as a co-enzyme for the production of energy and glucose synthesis. It is also important in the metabolism of amino acids and fatty acids. Good sources of Biotin include cooked eggs, liver, yogurt and nuts."}, {"url": "http://www.livestrong.com/article/291313-vitamins-that-function-as-coenzymes/", "passage_text": "Vitamins That Function As Coenzymes. B vitamins act as coenzymes to help enzymes do their work in metabolism. Photo Credit Fred Froese/Photodisc/Getty Images. Members of the vitamin B complex serve as coenzymes that assist every cell in the human body. They help the body metabolize carbohydrates, proteins and fats and build DNA for new cells. Without its coenzyme, an enzyme will not function. Vitamins work together in impressive ways as coenzymes or precursors to coenzymes. Precursors are substances that can be converted into active vitamins and coenzymes."}, {"url": "https://www.integratedhealth.com/coenzyme-vitamins/index.html", "passage_text": "Coenzyme Vitamins. Vitamins are substances needed in small amounts for normal body functions that the body cannot synthesize in adequate amounts. In many cases vitamins act as cofactors that are needed in order to allow enzymes to perform their important work of facilitating metabolism in the body. In this case the vitamins are called coenzyme vitamins. Some examples of coenzyme vitamins include Vitamin B1 in the form of thiamin diphosphate (or cocarboxylase) and Vitamin B6 in the form of pyridoxal 5’-phosphate"}, {"url": "https://en.wikipedia.org/wiki/Coenzyme", "passage_text": "However, vitamins do have other functions in the body. Many organic cofactors also contain a nucleotide, such as the electron carriers NAD and FAD, and coenzyme A, which carries acyl groups. Most of these cofactors are found in a huge variety of species, and some are universal to all forms of life. A cofactor is a non-protein chemical compound that is required for the protein's biological activity. These proteins are commonly enzymes, and cofactors can be considered helper molecules that assist in biochemical transformations."}, {"url": "https://en.wikibooks.org/wiki/Structural_Biochemistry/Enzyme/Cofactors", "passage_text": "Cofactors, mostly metal ions or coenzymes, are inorganic and organic chemicals that assist enzymes during the catalysis of reactions. Coenzymes are non-protein organic molecules that are mostly derivatives of vitamins soluble in water by phosphorylation; they bind apoenzyme to proteins to produce an active holoenzyme. "}, {"url": "https://en.wikipedia.org/wiki/Coenzyme", "passage_text": "Organic cofactors are often vitamins or are made from vitamins. Many contain the nucleotide adenosine monophosphate (AMP) as part of their structures, such as ATP, coenzyme A, FAD, and NAD+ . This common structure may reflect a common evolutionary origin as part of ribozymes in an ancient RNA world. A cofactor is a non-protein chemical compound that is required for the protein's biological activity. These proteins are commonly enzymes, and cofactors can be considered helper molecules that assist in biochemical transformations."}, {"url": "http://www.livestrong.com/article/291313-vitamins-that-function-as-coenzymes/", "passage_text": "Pyridoxine, also called vitamin B6, is a precursor to a coenzyme for important reactions that involve protein metabolism, including the synthesis of amino acids. When you eat meat, fish and poultry, you benefit from vitamin B6. It also occurs in many vegetables, such as potatoes and tomatoes. Without its coenzyme, an enzyme will not function. Vitamins work together in impressive ways as coenzymes or precursors to coenzymes. Precursors are substances that can be converted into active vitamins and"}, {"url": "http://education.seattlepi.com/role-vitamins-play-enzyme-activity-3732.html", "passage_text": "Vitamins fall into two general categories: water-soluble and fat-soluble. Water-soluble vitamins are found mainly in watery or starchy foods such as grains and vegetables, while fat-soluble vitamins are found mainly in fatty foods such as butter, seafood and organ meats."}]