[{"url": "http://www.livescience.com/27443-zebras.html", "passage_text": "Some experts say that there are three species of zebras — Grevy's zebra, plains zebra and mountain zebra — and that Hartmann's zebra is a subspecies of mountain zebra. Other experts say Hartmann's zebra is a separate species."}, {"url": "http://faculty.pnc.edu/pwilkin/eas391e/mwc3.doc", "passage_text": "Keystone Species. A keystone species is a species that has an unbalanced effect on the environment relative to its abundance. It affects many other organisms and helps to determine the types and numbers of the other species in the community. If a keystone species is removed, the ecosystem can experience a dramatic change."}, {"url": "http://www.citelighter.com/science/environment/knowledgecards/keystone-species", "passage_text": "A keystone species is a species that has a disproportionately large effect on its environment relative to its abundance."}, {"url": "http://www.citelighter.com/science/environment/knowledgecards/keystone-species", "passage_text": "One problem with the concept of keystone species is that it is difficult to measure all the direct and indirect impact of a keystone species on other organisms in a community. Consequently, most evidence for the existence of keystone species is based on indirect observations rather than on experimental manipulations."}, {"url": "http://www.livescience.com/27443-zebras.html", "passage_text": "Though they all live in Africa, each species of zebra has its own home area. Plains zebras live in the treeless grasslands and woodlands of eastern and southern Africa. The Grevy's zebra lives in in the arid grasslands of Ethiopia and northern Kenya. The mountain zebra is found in South Africa, Namibia and Angola."}, {"url": "http://faculty.pnc.edu/pwilkin/eas391e/mwc3.doc", "passage_text": "Diporeia are keystone species in the Great Lakes. These are tiny, shrimp-like, invertebrate organisms that are normally found offshore in the bottom mud. They rely on settling algae from water as a food source. It seems that zebra mussels are competing and winning against Diporeia for their"}]