[{"url": "http://www.handymanusa.com/articles/polarity.html", "passage_text": "How can you tell, and what can you do about it. An outlet should be wired such that the HOT lead is connected to a specific side of the outlet, and the neutral lead to the other. Cords where it matters will have one of the prongs wider so the neutral side and hot side line up correctly. An outlet should be wired such that the HOT lead is connected to a specific side of the outlet, and the neutral lead to the other. This is done for safety reasons."}, {"url": "http://www.audioenglish.org/dictionary/polarity.htm", "passage_text": "• POLARITY (noun). The noun POLARITY has 2 senses: 1. a relation between two opposite attributes or tendencies. 2. having an indicated pole (as the distinction between positive and negative electric charges). Familiarity information: POLARITY used as a noun is rare. Dictionary entry details."}, {"url": "http://www.answers.com/Q/What_is_reverse_polarity", "passage_text": "Confidence votes 7.8K. Reverse polarity is the opposite of normal polarity. Normal polarity in electronics is when you have the positive hooked up to the positive terminal and the negative to the negative terminal. Reverse polarity would be having the positive hooked up to the negative terminal and the negative to the positive terminal. The same concept can be used with magnets."}, {"url": "http://www.rcgroups.com/forums/showthread.php?t=350659", "passage_text": "Hello, I am wondering what reversed polarity means. People are telling me that reversed polarity could cause my ESC to burn or short out. I ask because I have a Multiplex EasyStar which is a pusher plane and I soldered my ESC on to the motor so that it turns counterclockwise (pulls like a non-pusher). "}, {"url": "http://www.inspectapedia.com/electric/Electrical_Outlet_Reversed_Polarity.php", "passage_text": "Watch out: Reversed polarity on an electrical outlet is dangerous. If you accidentally reverse these wires the device you plug in to the receptacle may work but it is unsafe and risks a short circuit, shock, or fire. We also explain the difference between reversed polarity and reversed LINE-LOAD connections in a building electrical circuit. This article series describes how to choose, locate, and wire an electrical receptacle in a home."}, {"url": "http://www.handymanusa.com/articles/polarity.html", "passage_text": "What does reversed polarity mean? How can you tell, and what can you do about it. An outlet should be wired such that the HOT lead is connected to a specific side of the outlet, and the neutral lead to the other. This is done for safety reasons. Cords where it matters will have one of the prongs wider so the neutral side and hot side line up correctly"}, {"url": "http://www.handymanwire.com/articles/polarity.html", "passage_text": "What does reversed polarity mean? How can you tell, and what can you do about it. An outlet should be wired such that the HOT lead is connected to a specific side of the outlet, and the neutral lead to the other. This is done for safety reasons."}, {"url": "http://www.inspectapedia.com/electric/Electrical_Outlet_Reversed_Polarity.php", "passage_text": "When a lamp or light fixture is connected with proper polarity, the hot wire connects to a contact at the bottom inside center of the bulb socket or screw-in base, and the neutral wire is connected to the shell that contacts the sides of the bulb when it is inserted and screwed into the socket. We also explain the difference between reversed polarity and reversed LINE-LOAD connections in a building electrical circuit. This article series describes how to choose, locate, and wire an electrical receptacle in a home."}, {"url": "https://answers.yahoo.com/question/index?qid=20090220220210AAYQb1m", "passage_text": "Answers. Best Answer: Reverse polarity is the opposite of normal polarity. Normal polarity in electronics is when you have the positive hooked up to the positive terminal and the negative to the negative terminal. Reverse polarity would be having the positive hooked up to the negative terminal and the negative to the positive terminal. The same concept can be used with magnets. A magnetic field (like Earth's) has a north pole and a south pole. If it flips so that the north pole is where the south pole was and vice versa the polarity has reversed. Source(s): http://en.wikipedia.org/wiki/Earth's_mag... water_skipper · 7 years ago."}, {"url": "http://www.marinesurveyor.com/allport/polarity.html", "passage_text": "The polarity indicator should be installed upstream of this, or between the main breaker and the boat's shore power cord inlet. The proper way to connect your boat to shore power is to turn off the main breaker on the boat and the breaker at the shore power pedestal. Then make the connections with the shore power cord. "}]