[{"url": "http://www.htc.com/us/support/htc-one-m8/howto/464867.html", "passage_text": "Use Bluetooth to transfer contacts from an iPhone, a phone that has Android version 2.1 (or earlier version), or other types of phones. Depending on the capabilities of your old phone, you may be able to transfer not only contacts but also other data such as calendar events and text messages to your new HTC phone. "}, {"url": "http://www.ehow.com/how_6027878_do-song-one-phone-another_.html", "passage_text": "Sending the Songs. Go into your music folder by way of the main menu. Select the song you want to send. Go to Options which should be located in the bottom-left or-right corner of your phone screen, and select Send file by Bluetooth.. Select the Bluetooth name that you wish to send the file to, and click OK.. Turn the Discovery mode on, for both the host phone and receiver phone. One of the phones will discover the other one, once the Bluetooth signal is picked up. Once connected, the name of the phone or phone model will show up on the screen. Select the correct name for the phone from both handsets."}, {"url": "http://www.youtube.com/watch?v=x6aRbfQxUdU", "passage_text": "Learn how you can transfer music to another device using Bluetooth on the Samsung Galaxy S4. samsung galaxy galaxy samsung s iv s4 s 4 s iv s iv galaxy s iv galaxy s4 galaxy s iv. FOLLOW US ON TWITTER: http://bit.ly/10Glst1. LIKE US ON FACEBOOK: http://on.fb.me/ZKP4nU. "}, {"url": "http://www.ehow.com/how_6310887_do-song-iphone-another-person_.html", "passage_text": "Slide your finger over the Sharing switch to turn it on. On the other iPhone, tap the Bluetooth Transfer icon at the bottom of the screen and tap the file he wishes to receive. Tap Transfer File to retrieve the song from your iPhone. Instructions. Press the Home button on your iPhone, and tap the Settings icon on your home screen. Tap the General tab and tap the Bluetooth tab. Slide your finger over the switch to turn on Bluetooth."}, {"url": "http://www.android.net/forum/android-forum/60834-how-do-i-send-songs-through-bluetooth-another-phone-my-motorola-xt720.html", "passage_text": "Go into settings then wireless and network options. Turn on Bluetooth then go to Bluetooth settings and search for devices. Once you find it you should be able to send media files. "}, {"url": "http://forums.androidcentral.com/t-mobile-nexus-s/85347-how-transfer-music-between-phones-via-bluetooth.html", "passage_text": "Re: how to transfer music between phones via bluetooth. Download Bluetooth file transfer from android market. once on the app go to media then musiclong press the songs or song u want to send then press ur settings icon on ur phone and select more. then select send via Bluetooth. 07-26-2013, 12:47 PM #4. how to transfer music between phones via bluetooth. Trying to send some songs from my phone to my fiances but can't seem to find that option anywhere. Any help. Thanked by: basha805. basha805."}, {"url": "http://www.cnet.com/how-to/how-to-transfer-data-to-the-htc-one-m8/", "passage_text": "To transfer your contacts, click on the Get content from another phone option in the HTC One M8's settings and select the All other phones option. On your old device, enable Bluetooth, pair it with the M8, and grant it access to download your contacts and call history. Select the file you would like to restore to your HTC One M8 and click OK. You will then have the option to transfer your iPhone's contacts, calendar, messages, camera roll, wallpapers, and bookmarks to your device. Simply select the files you want to transfer and click Start. Screenshot by Dan Graziano/CNET. To sync your iPhone contacts with the HTC One M8, click on the Get content from another phone option in the M8's settings, select iPhone, and choose the Transfer contacts over Bluetooth option"}]