[{"url": "http://www.cnn.com/2014/08/05/showbiz/celebrity-news-gossip/sandra-bullock-highest-paid-actress/index.html", "passage_text": "1 of 8. 8 photos: Photos: Forbes' highest-paid actresses. Forbes' highest-paid actresses – No. 2: The Hunger Games actress Jennifer Lawrence earned $34 million between June 2013 and June 2014 -- not so surprising considering the star's tireless work ethic."}, {"url": "http://www.nydailynews.com/entertainment/movies/sandra-bullock-tops-forbes-list-highest-paid-actresses-article-1.1891501", "passage_text": "Sandra Bullock arrives at the Oscars in March 2014. Sandra Bullock's earnings defied gravity this year. The 50-year-old Bullock is Hollywood's highest paid actress, hauling in $51 million from June 2013 to June 2014, Forbes reported Monday. The stratospheric sum was due in large part to the success of sci-fi thriller Gravity, which drew $716 million at the box office."}, {"url": "https://en.wikipedia.org/wiki/List_of_highest_paid_film_actors", "passage_text": "Salaries for the world's highest paid film actors currently range from $20–30 million, but an actor can earn substantially more by deferring all or part of their salary against a percentage of the film's gross, known within the industry as a profit participation deal."}, {"url": "http://www.cnn.com/2013/07/31/showbiz/how-hollywoods-highest-paid-actresses/index.html", "passage_text": "Compare the highest-paid actresses of Hollywood to Forbes world's most powerful celebrities list, of which there are six women in the top 10, Jolie moves much further down to number 41."}, {"url": "http://www.cnn.com/2013/07/31/showbiz/how-hollywoods-highest-paid-actresses/index.html", "passage_text": "10 photos: Forbes: highest paid actresses in 2013. 3. Kristen Stewart – Kristen Stewart was top of the list last year but with the Twilight films completed, Stewart's earnings of $22 million mean she has dropped to third."}, {"url": "http://abcnews.go.com/Business/sandra-bullock-tops-highest-paid-actresses/story?id=24837460", "passage_text": "Gravity star Sandra Bullock is the highest-paid actress in Hollywood, at least from between June 2013 and June 2014, according to Forbes."}, {"url": "http://www.cnn.com/2013/07/31/showbiz/how-hollywoods-highest-paid-actresses/index.html", "passage_text": "10 photos: Forbes: highest paid actresses in 2013. 10. Julia Roberts – Julia Roberts only made one film last year but the other Snow White remake, Mirror Mirror helped landed the well-known superstar on the recent Forbes list with earnings of $10 million."}]