[{"url": "http://www.kiplinger.com/article/saving/T047-C001-S002-retirement-plan-contribution-limits-in-2015.html", "passage_text": "The contribution limits for your 401(k) will be higher in 2015 than in 2014. The maximum you’ll be able to stash in a 401(k), 403(b), 457 or the federal government’s Thrift Savings Plan will increase by $500, to $18,000 in 2015. The catch-up contribution limit for anyone who turns 50 in 2015 will also increase, from $5,500 to $6,000 (for a maximum contribution of $24,000)."}, {"url": "http://www.hl.co.uk/pensions/sipp/how-much-can-i-invest", "passage_text": "For example: If you earn £35,000, you should be able to contribute £35,000 gross to your pension. The payment you make will be £28,000, to which the taxman will automatically add (20%) basic-rate tax relief of £7,000. Higher and top-rate taxpayers can claim back even more through their tax return. The maximum you can contribute is £3,600 gross-a payment of £2,880 to which the taxman adds £720. This is the case even for people who don't pay tax, such as children and non-earning spouses. 1  Scenario 2: I want to contribute over £40,000 this tax year »."}, {"url": "http://money.cnn.com/retirement/guide/401k_401kplans.moneymag/index2.htm", "passage_text": "There are annual limits. In 2014, if you are under 50 years old, you can contribute a maximum of $17,500. If you're 50 or older, you can make an additional catch-up contribution of as much as $5,500, for a total of up to $23,000. Those contribution limits change annually to track inflation. "}, {"url": "http://www.hl.co.uk/pensions/sipp/how-much-can-i-invest", "passage_text": "The annual allowance (generally £40,000) is the maximum amount that can be contributed by anyone (yourself or your employer, for instance) into all your pensions in a tax year. Those who have contributions registered between 6 April 2015 and 8 July 2015 may have a higher allowance for the 2015/2016 tax year. The maximum you can contribute is £3,600 gross-a payment of £2,880 to which the taxman adds £720. This is the case even for people who don't pay tax, such as children and non-earning spouses. 1  Scenario 2: I want to contribute over £40,000 this tax year »."}, {"url": "http://www.investopedia.com/ask/answers/100214/what-maximum-i-can-contribute-my-401k-plan.asp", "passage_text": "By Investopedia.com AAA |. A: The maximum you can contribute to your 401(k) plan annually is $17,500 if you are under the age of 50. If you are 50 or older, an extra $5,500 can be invested for a total of $23,500. Most financial experts advise that a person should invest between 6 and 10% of his income for retirement, so for someone who makes $1,000 a month, $60 to $100 a month should be saved for retirement."}, {"url": "http://www.consumerismcommentary.com/401k-contribution-limits/", "passage_text": "As a result, if you are 50 or older, you can contribute a maximum of $24,000 into these tax-advantaged accounts. That’s up from a total of $23,000 in 2014. The total contribution limit, including employer contributions, has increased from $52,000 to $53,000. The benefits of a 401(k) plan are designed to be directed primarily at people who most need an incentive to save for retirement. By the end of the year, I expect to have maximized the employee portion of my 401(k) contributions at $16,500 with extra invested for the employer portion. My 2010 contributions fell short from the maximum by about $700, and a portion of that is due to leaving the company in the middle of December."}, {"url": "https://blog.personalcapital.com/retirement-planning/can-contribute-401k-ira/", "passage_text": "Contributions to a Roth are never deductible. For instance, if you are covered by a retirement plan at work: 1  You can deduct up to the contribution limit, if you’re single and your modified AGI is $60,000. 2  And you can take a partial deduction if your income is between $60,000 and $70,000. For instance, if you are covered by a retirement plan at work: 1  You can deduct up to the contribution limit, if you’re single and your modified AGI is $60,000. 2  If you’re married and filing jointly, you can deduct the full amount if your modified AGI is $96,000 or less."}, {"url": "http://www.efile.com/ira-401k-maximum-contributions-limits/", "passage_text": "Overall contributions include all deferrals, employer contributions, and catch-up contributions. * Or 100% of your salary, whichever is less. For example, if you had a 401(k) plan in 2013, you could contribute 100% of your salary to it if you earned under $17,500 for the year. "}, {"url": "http://www.investopedia.com/ask/answers/100314/does-my-employers-matching-contribution-count-towards-maximum-i-can-contribute-my-401k-plan.asp", "passage_text": "For participants over age 50, the IRS allows catch-up contributions to be made. These can come from salary deferrals and employer match contributions. The additional amount for catch-up contributions for participants in 2015 is $6,000, bringing the total to $24,000 ($18,000 and $6,000). The catch-up contributions are not subject to the employer maximum limit. "}, {"url": "https://www.ameriprise.com/retirement/retirement-planning/retirement-savings/maximize-retirement-contributions/", "passage_text": "Saving any amount toward your retirement is good — if you can, contribute the maximum allowed amount to your IRA or employer retirement plan. You should also build up short-term savings so that you don't have to tap into retirement savings for emergencies. You can make maximum contributions to both an employer plan such as a 401(k) and an IRA in the same year, assuming you have earned income and you otherwise qualify. But you may not be able to deduct your traditional IRA contribution, depending on your income."}]