[{"url": "https://ca.answers.yahoo.com/question/index?qid=20080928014659AAZXE88", "passage_text": "I'd think it would take longer to process this time of year. One thing I can tell you for sure. the CRA does not recognize any separation that is less than ninety days. So if you separated at the start of September and immediately sent notification of your change inmarital status, they won't process it. Sparky · 7 years ago. "}, {"url": "http://www.cra-arc.gc.ca/netfile/", "passage_text": "NETFILE is an electronic tax-filing service that allows you to send your individual income tax and benefit return directly to the Canada Revenue Agency (CRA) using the Internet and a NETFILE-certified software product. It streamlines the tax-filing process and offers the following benefits: The CRA accepts responsibility for the security of information once the CRA has received it, and the CRA takes precautions to ensure the confidentiality of data sent using the NETFILE web service. Throughout the session, the CRA takes extensive measures to make sure that security is maintained."}, {"url": "https://answers.yahoo.com/question/index?qid=20080429233214AAanq1I", "passage_text": "Report Abuse. The CRA says 6 weeks if you mail it but it is usually a bit longer, given that you filed right at the deadline and so does everyone else. I would expect it by end of June/early July. You can check the status of your refund online through the CRA website's Access. Next year, I suggest filing online via Netfile. "}, {"url": "http://settlement.org/ontario/daily-life/personal-finance/taxes/what-happens-after-i-file-my-tax-return/", "passage_text": "If you are owed a refund, you will get a direct deposit into your bank account. You can expect your tax return in about 2 weeks if you used NETFILE, and 4 - 6 weeks if you filed it by mail. See information about CRA penalties and interest rates. When you file your tax return, the federal government determines if you are eligible for benefits, such as the Canada Child Tax Benefit (CCTB) , the Ontario Child Benefit, or the Harmonized Sales Tax (HST) credit."}, {"url": "http://www.taxtips.ca/filing/refund.htm", "passage_text": "Canada Revenue Agency (CRA) says it takes about 2 weeks to process returns filed using NetFile, EFile, or Telefile, but they do not start processing returns until mid-February. The methods to check on the status of your return or your refund are: Direct Deposit to Your Bank Account-Will be Mandatory April 2016 By April 2016, the federal government will be phasing out all government cheques in favour of direct deposits."}, {"url": "http://www.canadian-disability-tax-credit-association.ca/FAQ_Accounting_Company_Toronto_Canada.html", "passage_text": "The Disability Tax Credit is a qualification used by the Canada Revenue Agency (CRA) to determine eligibility for certain tax credits and benefits. Canadian Disability Tax Credit Association helps disabled Canadians apply for these tax credit and benefits. "}, {"url": "http://www.getsmarteraboutmoney.ca/en/managing-your-money/planning/understanding-tax/Pages/If-your-tax-return-is-reviewed.aspx", "passage_text": "Warning Do not ignore a letter from the CRA. If the CRA doesn't receive a response to its letter within 30 days, it will adjust your claim based on the information it has. This may not be in your favour. ​The Canada Revenue Agency (CRA) may contact you about your tax return, and not necessarily just at tax time. This is called a tax review — it is not the same as a tax audit. But it may lead to an audit if the CRA is not satisfied with your response to the review."}, {"url": "http://www.cra-arc.gc.ca/netfile/", "passage_text": "1 After you have filed your return using NETFILE.  The NETFILE program will be open for transmissions on February 9, 2015, until January 15, 2016, for the electronic filing of your 2013 and 2014 personal income tax and benefit return. The CRA accepts responsibility for the security of information once the CRA has received it, and the CRA takes precautions to ensure the confidentiality of data sent using the NETFILE web service. Throughout the session, the CRA takes extensive measures to make sure that security is maintained."}, {"url": "http://canadaonline.about.com/od/personalincometax/a/taxrefund.htm", "passage_text": "Processing Times for Tax Refunds. The length of time it takes the CRA to process your income tax return and refund depends on how and when you file your return. Processing Times for Paper Returns. Paper returns usually take four to six weeks to process. For paper tax returns filed before April 15, wait four weeks before you check on your refund. For paper tax returns filed after April 15, wait six weeks before you check. Processing Times for Electronic Returns."}]