[{"url": "https://en.wikipedia.org/wiki/Parkinsonism", "passage_text": "The neurodegenerative condition Parkinson's disease (PD) is the most common cause of parkinsonism. However, a wide range of other etiologies may lead to a similar set of symptoms, including some toxins, a few metabolic diseases, and a handful of neurological conditions other than Parkinson's. Parkinsonism is a clinical syndrome characterized by tremor, bradykinesia, rigidity, and postural instability. Parkinsonism shares symptoms found in Parkinson's disease, from which it is named; but parkinsonism is a symptom complex, and differs from Parkinson disease which is a progressive neurodegenerative illnes"}, {"url": "http://www.ninds.nih.gov/disorders/parkinsons_disease/detail_parkinsons_disease.htm", "passage_text": "Parkinson's disease (PD) is a degenerative disorder of the central nervous system that belongs to a group of conditions called movement disorders. It is both chronic, meaning it persists over a long period of time, and progressive, meaning its symptoms grow worse over time. PD is the most common form of parkinsonism [1] , in which disorders of other causes produce features and symptoms that closely resemble Parkinson’s disease. While most forms of parkinsonism have no known cause, there are cases in which the cause is known or suspected or where the symptoms result from another disorder."}, {"url": "http://www.webmd.com/parkinsons-disease/tc/parkinsons-disease-topic-overview", "passage_text": "Parkinson's disease affects the way you move. It happens when there is a problem with certain nerve cells in the brain. Normally, these nerve cells make an important chemical called dopamine. Dopamine sends signals to the part of your brain that controls movement. It lets your muscles move smoothly and do what you want them to do. In time, Parkinson's affects muscles all through your body, so it can lead to problems like trouble swallowing or constipation. In the later stages of the disease, a person with Parkinson's may have a fixed or blank expression, trouble speaking, and other problems. Some people also lose mental skills (dementia)."}, {"url": "https://en.wikipedia.org/wiki/Parkinson%27s_disease", "passage_text": "Parkinson's disease is more common in older people, with most cases occurring after the age of 50; when it is seen in young adults, it is called young onset PD (YOPD). The main motor symptoms are collectively called parkinsonism, or a parkinsonian syndrome. The disease can be either primary or secondary. Primary Parkinson's disease is referred to as idiopathic (having no known cause), although some atypical cases have a genetic origin, while secondary parkinsonism is due to known causes like toxins."}, {"url": "https://en.wikipedia.org/wiki/Parkinson%27s_disease", "passage_text": "Parkinson's disease is the most common form of parkinsonism and is usually defined as primary parkinsonism, meaning parkinsonism with no external identifiable cause. In recent years several genes that are directly related to some cases of Parkinson's disease have been discovered. The disease can be either primary or secondary. Primary Parkinson's disease is referred to as idiopathic (having no known cause), although some atypical cases have a genetic origin, while secondary parkinsonism is due to known causes like toxins."}, {"url": "http://www.mayoclinic.org/diseases-conditions/parkinsons-disease/basics/symptoms/CON-20028488", "passage_text": "Parkinson's disease symptoms and signs may vary from person to person. Early signs may be mild and may go unnoticed. Symptoms often begin on one side of your body and usually remain worse on that side, even after symptoms begin to affect both sides. 1 Over time, Parkinson's disease may reduce your ability to move and slow your movement, making simple tasks difficult and time-consuming. 2  Your steps may become shorter when you walk, or you may find it difficult to get out of a chair. 3  Also, you may drag your feet as you try to walk, making it difficult to move."}, {"url": "http://www.movementdisorders.org/MDS/About/Movement-Disorder-Overviews/Parkinsons-Disease--Parkinsonism.htm", "passage_text": "Parkinson’s disease (PD) is the most common neurodegenerative cause of parkinsonism, a clinical syndrome characterized by lesions in the basal ganglia, predominantly in the substantia nigra. PD makes up approximately 80% of cases of parkinsonism. "}, {"url": "https://en.wikipedia.org/wiki/Parkinson%27s_disease", "passage_text": "Parkinson's disease (PD, also known as idiopathic or primary parkinsonism, hypokinetic rigid syndrome (HRS), or paralysis agitans) is a degenerative disorder of the central nervous system mainly affecting the motor system. The disease can be either primary or secondary. Primary Parkinson's disease is referred to as idiopathic (having no known cause), although some atypical cases have a genetic origin, while secondary parkinsonism is due to known causes like toxins."}]