[{"url": "http://www.ehow.com/how-does_4682846_pedometers-work.html", "passage_text": "Pedometers are exercise training tools that count the number of steps you take. Getting in 10,000 steps every day can improve your heart health and lower body fat, and you can use a pedometer to monitor your progress."}, {"url": "http://www.wisegeek.org/how-does-a-pedometer-work.htm", "passage_text": "A pedometer is a small device used to count how many steps a person takes while walking. Experts recommend taking around 10,000 steps per day to improve physical fitness. Since most people cannot spend their entire day counting their steps, a pedometer acts as a sensible way to monitor and relay such information."}, {"url": "http://www.wisegeek.org/how-does-a-pedometer-work.htm", "passage_text": "Pedometers measure how many steps a person takes while walking. Experts advise that individuals take approximately 10,000 steps each day in order to increase their physical fitness. Many digital pedometers use internal gyroscopes to record movement."}, {"url": "http://mohdaslam.com/pedometer-and-step-counter-mobile-apps-how-does-it-work/", "passage_text": "Pinterest. Mobile applications today with accelerometer sensor can work as a Pedometer or Step Counter for counting the number of steps you take while walking, running or step aerobics. In this blog I will discuss how it works and review of couple of apps on Android and Iphone."}, {"url": "http://www.explainthatstuff.com/how-pedometers-work.html", "passage_text": "We can then multiply the number of steps by the length of each one to figure out the overall distance walked. This is pretty much how a pedometer works. Photo: Pedometers can measure your steps because your body swings from side to side as you walk. Each swing counts as one step. Multiplying the number of swings by the average length of your steps tells you how far you've gone."}, {"url": "http://www.livestrong.com/article/79938-pedometer-work-exactly/", "passage_text": "A pedometer is a device that tracks the number of steps a person takes throughout the course of the day. This small device is often used to help a person meet a set goal of steps taken per day in order to increase the amount of calories burned."}, {"url": "http://mohdaslam.com/pedometer-and-step-counter-mobile-apps-how-does-it-work/", "passage_text": "Benefits of Pedometer or Pedometer Apps: Using a Pedometer helps in keeping track of the steps you take while doing aerobics, running, walking, steps exercise.While starting any fitness activity, You set some goals and would like to monitor it. E.g."}]