[{"url": "http://www.hxbenefit.com/splenic-flexure-syndrome.html", "passage_text": "Splenic Flexure Syndrome (SFS) can be defined as a form of chronic digestive disorder that is characterized by spasms of splenic flexure of colon which is caused by the trapped gas in splenic flexure or the bends of colon. The splenic flexure can be found close to the spleen and a part of the large intestine."}, {"url": "http://syndromespedia.com/splenic-flexure-syndrome-symptoms-treatment.html", "passage_text": "Splenic flexure syndrome is a condition basically characterized by pain and discomfort of the upper abdomen. Muscle spasms and abdominal distention are considered as causative of the syndrome."}, {"url": "http://www.myhealthyfeeling.com/splenic-flexure-syndrome/", "passage_text": "Splenic flexure syndrome refers to a digestive condition which causes spasm of the splenic flexure occurring in the colon. Trapping of gas is what leads to the spasm. The abdominal pain and discomfort that is endured is debilitating and intense and can be compared to that experienced during a cardiac arrest."}, {"url": "http://howshealth.com/splenic-flexure-syndrome/", "passage_text": "The splenic flexure is a sharp bend that is located in the abdomen, particularly, between the transverse and descending colon. The bend in the colon is a normal structure of the colon. Another name that is given to the splenic flexure is left colic flexure."}, {"url": "http://www.wisegeek.org/what-is-splenic-flexure-syndrome.htm", "passage_text": "Splenic flexure syndrome describes a digestive disorder characterized by gas becoming trapped inside of flexures located inside the colon. While gas symptoms are normal in humans, this particular digestive disorder produces excessive gas and other symptoms considered to be abnormal."}, {"url": "http://www.wisegeek.com/what-is-the-splenic-flexure.htm", "passage_text": "The splenic flexure is a sharp bend between the transverse colon and the descending colon. Splenic flexure syndrome can sometimes be mistaken for a heart attack. Splenic flexure causes pain in the upper abdomen."}, {"url": "http://www.wisegeek.com/what-is-the-splenic-flexure.htm", "passage_text": "The splenic flexure is a sharp bend between the transverse colon and the descending colon in the human abdomen. This bend is simply part of the normal structure of the colon."}, {"url": "http://www.myhealthyfeeling.com/splenic-flexure-syndrome/", "passage_text": "The splenic flexure is situated next to the spleen and a section of the large intestine or colon. It is a quick bend in the upper left abdomen, which alters direction from horizontal to vertical."}]