[{"url": "http://www.naturalqi.com/acupuncture", "passage_text": "There are several different treatment modalities within Traditional Chinese Medicine, and acupuncture is just one of them. Chinese medicine also provides healing through herbs, muscle manipulation called Tui Na, diet and nutrition, and breathing and exercise with practices such as Qi Gong and Tai Chi. There are over a thousand known acupuncture points on the body. The connections between the acupuncture points ensure that there is an even circulation of qi, a balance between Yin and Yang. When illness or disease occurs, it points to an im"}, {"url": "http://www.medicinenet.com/acupuncture/article.htm", "passage_text": "Acupuncture is a component of the health care system of China that can be traced back at least 2,500 years. The general theory of acupuncture is based on the premise that there are patterns of energy flow (Qi) through the body that are essential for health. Disruptions of this flow are believed to be responsible for disease"}, {"url": "http://www.takingcharge.csh.umn.edu/explore-healing-practices/acupuncture", "passage_text": "Acupuncture is the insertion of very fine, filiform needles through the skin at specific points on the body with the intention of manipulating Qi. Acupuncture is based upon the jing luo channel network theory of the circulation of Qi. Although Qi permeates every part of the body, it tends to collect and travel along channels called jing luo.."}, {"url": "http://www.naturalqi.com/acupuncture", "passage_text": "Acupuncture is the insertion of fine needles into specific points along channels just under the skin to balance the flow of energy, or qi, through these channels. There are over a thousand known acupuncture points on the body. The connections between the acupuncture points ensure that there is an even circulation of qi, a balance between Yin and Yang. When illness or disease occurs, it points to an imbalance between Yin and Yang."}, {"url": "http://www.webmd.com/pain-management/acupuncture-20788", "passage_text": "Acupuncture is a form of Chinese medicine that has been practiced for centuries. It's based on the theory that energy, called chi (say chee), flows through and around your body along pathways called meridians. Acupuncturists believe that illness occurs when something blocks or unbalances your chi. Acupuncture is a way to unblock or influence chi and help it flow back into balance. Acupuncture is done by putting very thin needles into your skin at certain points on your body. This is done to influence the energy flow."}, {"url": "http://acupuncturist.edu/academy-clinic/what-is-acupuncture/", "passage_text": "The practice of acupuncture is based on understanding the flow of qi, or vital energy in nature and in ourselves. The Chinese have mapped the flow of qi through our bodies along specific pathways called meridians. When our qi is full and flowing, we experience health. When our qi is obstructed or imbalanced, illness and pain can occur. The symptoms we experience are signals that we need to take measures to restore balance."}, {"url": "http://umm.edu/health/medical/altmed/treatment/acupuncture", "passage_text": "Acupuncture is a treatment based on Chinese medicine -- a system of healing that dates back thousands of years. At the core of Chinese medicine is the notion that a type of life force, or energy, known as qi (pronounced chee) flows through energy pathways (meridians) in the body. "}, {"url": "https://en.wikipedia.org/wiki/Acupuncture", "passage_text": "Acupuncture (from Latin, acus (needle) and punctura (to puncture)) is a form of alternative medicine and a key component of traditional Chinese medicine (TCM) involving thin needles inserted into the body at acupuncture points. Acupuncture is commonly used for pain relief, though it is also used for a wide range of other conditions. Clinical practice varies depending on the country. There is a diverse range of acupuncture approaches, involving different philosophies. The method used in TCM is likely the most widely adopted in the US."}, {"url": "http://www.naturalqi.com/acupuncture", "passage_text": "Acupuncture is more than just needles. “Qi” is roughly pronounced “chee”, and is the Chinese name for a concept that exists not only in Chinese medicine, but in other types of eastern whole medicine systems as well. Qi is what makes up our body’s fundamental consitution. There are over a thousand known acupuncture points on the body. The connections between the acupuncture points ensure that there is an even circulation of qi, a balance between Yin and Yang. When illness or disease occurs, it points to an im"}]