[{"url": "http://kids.nceas.ucsb.edu/biomes/grassland.html", "passage_text": "In Eurasia temperate grasslands are known as steppes and they are found between the Ukraine and Russia. In South America they are called pampas, and are located in Argentina and Uruguay. In South Africa temperate grasslands are known as veldts. WEATHER: Temperatures in this biome vary greatly between summer and winter. Temperate grasslands have some of the darkest, richest soils in the world (not in wealth, but in nutrients). People who live in grassland regions often use these soils for farming. In North America we call temperate grasslands prairies."}, {"url": "http://grasslandscience10.weebly.com/temperate-grassland.html", "passage_text": "Temperature: Temperatures in this biome vary greatly between summer and winter, summer temperatures can be well over 35° C while winter temperatures can be as low as -25° C. Precipitation: temperate grasslands can be found in areas that receive between 10 and 35 inches of rain each year. "}, {"url": "http://www.defenders.org/grasslands/temperate-grasslands", "passage_text": "Temperate Grasslands. Temperate grasslands are located north of the Tropic of Cancer (23.5 degrees North) and south of the Tropic of Capricorn (23.5 degrees South). The major temperate grasslands include the veldts of Africa, the pampas of South America, the steppes of Eurasia, and the plains of North America. Climate. Temperate grasslands have hot summers and cold winters. Summer temperatures can be well over 100 degrees Fahrenheit, while winter temperatures can be as low as -40 degrees Fahrenheit. They typically have between 10 and 35 inches of precipitation a year, much of it occurring in the late spring and early summer."}, {"url": "http://biology.about.com/od/landbiomes/a/aa042106a.htm", "passage_text": "Location. Grasslands are located on every continent with the exception of Antarctica. Some locations of temperate grasslands include: 1  Argentina-pampas. 2  Australia-downs. 3  Central North America-plains and prairies. 4  Hungary-puszta. 5  New Zealand-downs. 6  Russia-steppes. 7  South Africa-veldts"}, {"url": "http://kids.nceas.ucsb.edu/biomes/grassland.html", "passage_text": "LOCATION: The name for this biome, temperate grasslands, is a great description for what it is like here. The most important plants in this biome are grasses! Temperate grasslands have some of the darkest, richest soils in the world (not in wealth, but in nutrients). People who live in grassland regions often use these soils for farming. In North America we call temperate grasslands prairies. Major grasslands in North America are the Great Plains of the Midwest, The Palouse Prairie of eastern Washington State, and other grasslands in the southwest."}, {"url": "http://zaneandjackproject.weebly.com/location.html", "passage_text": "Temperate grasslands are located in these moderate places because all abiotic and biotic features match to criteria of a temperate grassland. The Tropical grassland biome, are located between the tropics of Cancer (23.4 degrees North) and Capricorn (23.4 degrees South). "}, {"url": "http://traveltips.usatoday.com/interesting-temperate-grassland-61857.html", "passage_text": "Most temperate grasslands are located in Africa, South America, Hungary, Russia and North America. Most of the grasslands exist north of the Tropic of Cancer at 23.5 degrees north in latitude and south of the Tropic of Capricorn at 23.5 degrees south in latitude. Grassland are further broken down into two groups, including prairie and steppes. Prairies feature tall species of grass while steppes include short grass types. Most temperate grasslands receive just 10 to 30 inches of rain each year with most of it occurring in late spring and early summer."}, {"url": "http://www.defenders.org/grasslands/temperate-grasslands", "passage_text": "Location. Temperate grasslands are located north of the Tropic of Cancer (23.5 degrees North) and south of the Tropic of Capricorn (23.5 degrees South). The major temperate grasslands include the veldts of Africa, the pampas of South America, the steppes of Eurasia, and the plains of North America. Climate. Temperate grasslands have hot summers and cold winters. Summer temperatures can be well over 100 degrees Fahrenheit, while winter temperatures can be as low as -40 degrees Fahrenheit. They typically have between 10 and 35 inches of precipitation a year, much of it occurring in the late spring and early summer."}]