[{"url": "http://www.landscapingnetwork.com/fencing/deer.html", "passage_text": "We recommend a minimum of 7’ high fence for deer fence. The cost averages as low as $0.20 a linear foot when purchasing economy fencing in quantities of 5,000 linear feet or greater. Note that this price is for the net alone and excludes posts, cables, gates, and accessories. "}, {"url": "http://forums.gardenweb.com/discussions/1937893/how-high-of-a-fence-could-a-deer-jump-over", "passage_text": "Most fences to keep deer or elk in/out are at least 8'. Some States have laws requiring deer farms to have fences 96 inches or higher. A frightened animal will jump higher to escape than a calm one searching for food. For a couple of years I had a 6' hot tape fence that I was told when I purchased it would keep the deer out. Not a chance. Ultimately I ended up taking the advice from a couple of other orchard folks, bit the bullet and put up an 8' high-tensile wire fence, mounted to 5 posts spaced 16' apart."}, {"url": "https://en.wikipedia.org/wiki/Agricultural_fencing", "passage_text": "In areas where such a tall fence is unsuitable (for example, on mountains subject to very high winds), deer may be excluded (or contained) by a fence of ordinary height (about 1.5 metres, four feet), with a smaller one of about one metre (three feet) high, about one metre away from it, on the same side as the deer. "}, {"url": "http://www.dfw.state.or.us/wildlife/living_with/deer_elk.asp", "passage_text": "Total height of the fence should be at least 60 inches. Use wooden posts at least 6 inches in diameter and ten feet in length with approximately four feet buried in the ground for corner, brace and riser posts. The height of the fence should be 5 feet. Corner posts on small garden plots may be steel #133-T type posts 7 feet long with at least 1 1/2 feet in the ground. Wooden corner posts are recommended for larger enclosures. These should be at least 5 inches top diameter and sunk approximately 2"}, {"url": "http://forums.gardenweb.com/discussions/1937893/how-high-of-a-fence-could-a-deer-jump-over", "passage_text": "I put up a 6 foot fence with a 2 foot out leaning top. i used 4 feet range fence then 4 feet on top. I put 11/2 inch pvc over post then 45% on that and another foot pvc. as deer haveto be close to jump the 45 acts as deturent. Like Bookmark February 7, 2014 at 7:23PM. Thank you for reporting this comment. For a couple of years I had a 6' hot tape fence that I was told when I purchased it would keep the deer out. Not a chance. Ultimately I ended up taking the advice from a couple of other orchard folks, bit the bullet and put up an 8' high-tensile wire fence, mounted to 5 posts spaced 16' apart."}, {"url": "http://fenceblog.tumblr.com/post/27126828097/how-high-should-a-deer-fence-be", "passage_text": "There’s even evidence that a 6-foot deer fence works most of the time. Some years back various Connecticut towns banned all fencing over 6 feet high. The local deer fence installers shook their heads but went ahead and installed a bunch of 6-foot deer fences. To their surprise, the fences worked pretty well. High enough to reliably keep out deer. That’s not so high as you might think. The literature says white-tailed deer can jump as high as 12 or even 15 feet. But they generally don’t, because Nature tells them not to. After all, what goes up must come down, and a deer with a broken leg is unlikely to survive"}, {"url": "http://www.arcadia-farms.net/keeping-deer-out-of-the-garden/", "passage_text": "A Tall Fence. You can keep deer out of the garden with a fence. That being said, most deer can jump up to 8 feet of fence and some of the larger ones can sometimes clear 10 feet. Our particular fence is only 6 feet tall and, to date, we haven’t had any issues with deer jumping over."}, {"url": "http://www.omafra.gov.on.ca/english/livestock/alternat/facts/97-027.htm", "passage_text": "The fences or walls around the handling facility must be of sufficient height that deer will not attempt to jump. For most deer 2.5 m (8') is adequate but white-tailed deer and elk require at least 2.7 m (9'). A bend or turn into the handling facility from the raceway is necessary to keep deer flowing. "}, {"url": "http://pss.uvm.edu/ppp/articles/deerfences.html", "passage_text": "Just because you have a fence doesn't mean it will be effective at keeping out deer. There are several facts you need to keep in mind when installing such a fence. Height, or width, is probably the most important factor with deer fences, especially if high deer pressure. White-tailed deer can jump almost eight feet high, so effective upright fences against them should be this high. Deer may be able to jump high, but not both high and over a distance. So a fence may not be as high, perhaps six feet, but slanted outward. The deer will try walking under the fence and meet resistance. If you have a standard fence about four or five feet feet high, you can add a similar and additional one about four feet away. While not high, with this width deer usually wont like to try and clear both and perhaps get caught between or on them."}]