[{"url": "http://www.distancesfrom.com/directions-from-LEGOLAND-Florida-to-Orlando-International-Airport-Orlando/DirectionHistory/1742994.aspx", "passage_text": "Check the Flight distance between LEGOLAND Florida and Orlando International Airport Orlando.With the road route plan from LEGOLAND Florida to Orlando International Airport you might also want to know the Travel timeYou can find the the Travel Time from LEGOLAND Florida to"}, {"url": "http://www.bizjournals.com/tampabay/print-edition/2011/07/15/road-to-legoland-spans-tampa-orlando.html", "passage_text": "The 150-acre Legoland Florida, just over an hour from Orlando International Airport and a… more. Julie Schafer. For visitors in Orlando who want to access the theme park without a car, Legoland will offer daily shuttle service from shopping center Orlando Premium Outlets."}, {"url": "https://www.orlando-vacationhomerental.com/park/where-is-legoland-florida/", "passage_text": "1 Legoland Florida to the Orlando International Airport – 49 miles +/- or an estimated 1 hour of driving depending upon traffic conditions. 2  Legoland to Downtown Orlando – 47 miles +/- or roughly 1 hour of driving time. 3  Legoland to Universal Orlando® and the Harry Potter World – 40 miles +/- or approximately 50 minutes."}, {"url": "http://www.familyvacationcritic.com/legoland-florida-planning-and-tips/dtp/", "passage_text": "Orlando International is about an hour from LEGOLAND Florida. A much smaller airport that might work depending on your home-airport is the Orlando Sanford International Airport offering 43-direct destinations and located about an hour and a half"}, {"url": "http://www.distancesfrom.com/directions-from-LEGOLAND-Florida-to-Orlando-International-Airport-Orlando/DirectionHistory/1742994.aspx", "passage_text": "Get to know how much would be the Trip Cost from LEGOLAND Florida to Orlando International Airport Orlando. Your directions start from LEGOLAND Florida, Legoland Way, Winter Haven, FL. And Orlando International Airport, Orlando is the place you need to reach."}]