[{"url": "http://mhhe.com/biosci/ap/histology_mh/cartilag.html", "passage_text": "There are three varieties of cartilage, hyaline, elastic, and fibrocartilage. The most abundant type is hyaline, found as supportive tissues in the nose, ears, trachea, larynx, and smaller respiratory tubes. As articular cartilage, hyaline is found covering the articular surfaces of bones in synovial joints. Here, hyaline cartilage reduces friction and acts as shock-absorbing tissue."}, {"url": "https://en.wikipedia.org/wiki/Cartilage", "passage_text": "Cartilage is classified in three types, elastic cartilage, hyaline cartilage and fibrocartilage, which differ in relative amounts of cartilage. Chondroblasts that get caught in the matrix are called chondrocytes. Cartilage does not contain blood vessels (avascular) or nerves (aneural). "}, {"url": "http://www.histology.leeds.ac.uk/bone/cartilage_types.php", "passage_text": "Cartilage: The three types of cartilage. There are three types of cartilage: 1  Hyaline-most common, found in the ribs, nose, larynx, trachea. 2  Is a precursor of bone. 3  Fibro-is found in invertebral discs, joint capsules, ligaments. 4  Elastic-is found in the external ear, epiglottis and larynx. Hyaline cartilage has widely dispersed fine collagen fibres (type II), which strengthen it. The collagen fibres are hard to see in sections. It has a perichondrium, and it is the weakest of the three types of cartilage. Look at the eMicroscope of a section of cartilage on the left."}, {"url": "http://www.wisegeek.com/what-is-hyaline-cartilage.htm", "passage_text": "Hyaline cartilage appears on the ends of bones where they form joints, between the ribs and the sternum or breastplate, in the trachea and bronchii of the lungs, and in the ear and the larynx or voice box. It is also the forerunner of skeletal bones in the fetus. Top 10 unbelievable historical concurrencies. Hyaline cartilage is a type of body tissue, also called gristle. It is shiny, slippery, firm, translucent, and bluish-gray in color. It is simple in structure, with no nerves or blood vessels. It has high elasticity and helps cushion and protect bone"}, {"url": "http://medical-dictionary.thefreedictionary.com/hyaline+cartilage", "passage_text": "a type of connective tissue composed of specialized cells in a translucent, pearly blue matrix. Hyaline cartilage thinly covers the articulating ends of bones, connects the ribs to the sternum, and supports the nose, the trachea, and part of the larynx. It is covered by a membranous perichondrium, except where it coats the ends of bones, and tends to calcify in advanced age. a bar of hyaline cartilage that attaches a rib to the sternum in the case of true ribs, or to the immediately cranial rib in the case of the anterior false ribs. cricoid cartilage. a ringlike cartilage forming the caudal part of the larynx. diarthrodial cartilage. articular"}, {"url": "http://www.histology.leeds.ac.uk/bone/cartilage_types.php", "passage_text": "There are three types of cartilage: 1  Hyaline-most common, found in the ribs, nose, larynx, trachea. 2  Fibro-is found in invertebral discs, joint capsules, ligaments. 3  Elastic-is found in the external ear, epiglottis and larynx. Hyaline cartilage has widely dispersed fine collagen fibres (type II), which strengthen it. The collagen fibres are hard to see in sections. It has a perichondrium, and it is the weakest of the three types of cartilage. Look at the eMicroscope of a section of cartilage on the left."}, {"url": "https://en.wikipedia.org/wiki/Hyaline_cartilage", "passage_text": "Hyaline cartilage is cartilage that is hyaline (transparent). It is found on many joint surfaces. It is pearly bluish in color with firm consistency and has a considerable amount of collagen. Articular cartilage is hyaline cartilage on the articular surfaces of bones. As such, it lies inside the joint cavity of synovial joints, bathed in synovial fluid produced by the synovial membrane that lines the walls of the cavity."}, {"url": "https://en.wikipedia.org/wiki/Hyaline_cartilage", "passage_text": "Hyaline cartilage matrix is mostly made up of type II collagen and chondroitin sulfate, both of which are also found in elastic cartilage. Hyaline cartilage exists on the ventral ends of ribs; in the larynx, trachea, and bronchi; and on the articular surface of bones. Articular cartilage is hyaline cartilage on the articular surfaces of bones. As such, it lies inside the joint cavity of synovial joints, bathed in synovial fluid produced by the synovial membrane that lines the walls of the cavity."}, {"url": "https://en.wikipedia.org/wiki/Hyaline_cartilage", "passage_text": "Hyaline cartilage is covered externally by a fibrous membrane, called the perichondrium, except at the articular ends of bones and also where it is found directly under the skin, i.e. ears and nose. This membrane contains vessels that provide the cartilage with nutrition. Articular cartilage is hyaline cartilage on the articular surfaces of bones. As such, it lies inside the joint cavity of synovial joints, bathed in synovial fluid produced by the synovial membrane that lines the walls of the cavity."}]