[{"url": "http://www.babycenter.com/0_how-much-youll-spend-on-childcare_1199776.bc", "passage_text": "The average cost of center-based daycare in the United States is $11,666 per year ($972 a month), but prices range from $3,582 to $18,773 a year ($300 to $1,564 monthly), according to the National Association of Child Care Resource & Referral Agencies (NACCRRA). Costs for daycare for preschool-age children are generally lower, averaging $8,800 a year ($733 a month). Depending on where you live, you'll pay anywhere from $4,460 to $13,185 a year ($371 to $1,100 a month)."}, {"url": "http://www.telegraph.co.uk/finance/personalfinance/insurance/longtermcare/10435265/Care-home-fees-the-scandal-of-secret-mark-ups.html", "passage_text": "The costs of such annuities can be high, however, even where the person requiring care is elderly. An 85 year-old in otherwise fair health, needing to meet care home fees of £20,000 per year, would pay £105,000 for a policy from Partnership, the leading insurer in this field. The Office of Fair Trading has a free guide entitled Fair Terms for Care, oft.gov.uk, 08457 22 44 99. The figures differ by region. On average, in England, the cost of providing residential care, including the care home operator's slice of profit, is worked out at £563 per week, according to Valuing Care, the consultancy which provided the data."}, {"url": "http://www.afamilyforeverychild.org/Adoption/AFFECreportonchildreninfostercare.pdf", "passage_text": "Children in Foster Care November 2011 The Cost of One Child for One Year in Foster Care The financial cost for one child to remain in foster care in Oregon for just one year is, at minimum, $26,600 1. The average annual net savings for one child being adopted out of foster care is $17,636 in Oregon, and it is $15,480 nationally. In 2010, AFFEC contributed to the work of getting approximately 132 children and siblings out of foster care and into homes with permanent and loving families."}, {"url": "http://www.pssru.ac.uk/project-pages/unit-costs/2013/index.php?file=stanley-rome", "passage_text": "The level of detail about the prices/costs of residential child care available from the Freedom of Information request is rarely seen outside each local authority. Figures 1 and 2 show each reported weekly price or cost plotted on a graph. Unit Costs of Health and Social Care 2013 21 Residential child care: costs and other information requirements Jonathan Stanley 1 and Andrew Rome 2 Introduction The residential child care sector looks after some of the most vulnerable children who have complex and challenging needs."}, {"url": "http://mn.gov/mnddc/past/pdf/60s/67/67-mn-arc-cost-res-care-comm.pdf", "passage_text": "The 73 counties who provided information for this study reported a total of 1,402 mentally. retarded persons in residential facilities other than state institutions. The total monthly cost of care for. these persons was $191,560, an average monthly cost of $136 per person. The maximum cost to counties would be $10 per month per resident rather. than the present average monthly cost of $164. State participation in the cost of caring for the people in these private facilities, under the. proposed bill, would be $1,039,452 annually."}, {"url": "http://www.afamilyforeverychild.org/Adoption/AFFECreportonchildreninfostercare.pdf", "passage_text": "Additional public costs may also be incurred in the form of subsidized guardianship and residential treatment not covered through Medicaid. The total annual public cost for a child who has been adopted from care in Oregon is $8,964. This is close to one reported national average of $10,302 (Zill, 2011). The average annual net savings for one child being adopted out of foster care is $17,636 in Oregon, and it is $15,480 nationally. In 2010, AFFEC contributed to the work of getting approximately 132 children and siblings out of foster care and into homes with permanent and loving families."}, {"url": "http://www.payingforcare.org/care-home-fees", "passage_text": "It is important to bear in mind that although you may not need nursing care now, this could change in the future. On average you can expect to pay around £28,500 a year in residential care costs, rising to over £37,500 a year if nursing care is necessary*. Residential care costs are not the same in all parts of the UK, there are significant regional variations. See the table below for more information on average regional weekly care home fees around the UK for 2013/14. Source: Laing & Buisson Care of Older People, UK Market Report 2013/14."}, {"url": "http://www.afamilyforeverychild.org/Adoption/AFFECreportonchildreninfostercare.pdf", "passage_text": "As in many other states, Oregon families who adopt children from foster care are able to access adoption subsidy funding. This funding, on average (for monthly payment as well as a $1,500 one-time payment) results in a public cost of about $7,464 per year. The average annual net savings for one child being adopted out of foster care is $17,636 in Oregon, and it is $15,480 nationally. In 2010, AFFEC contributed to the work of getting approximately 132 children and siblings out of foster care and into homes with permanent and loving families."}]