[{"url": "https://en.wikipedia.org/wiki/Corporate_branding", "passage_text": "Corporate branding refers to the practice of promoting the brand name of a corporate entity, as opposed to specific products or services. The activities and thinking that go into corporate branding are different from product and service branding because the scope of a corporate brand is typically much broader. "}, {"url": "https://en.wikipedia.org/wiki/Corporate_social_responsibility", "passage_text": "Corporate social responsibility (CSR, also called corporate conscience, corporate citizenship or responsible business) is a form of corporate self-regulation integrated into a business model. Business ethics is the part of applied ethics that examines ethical principles and moral or ethical problems that can arise in a business environment. ISO 26000 is the recognized international standard for CSR. Public sector organizations (the United Nations for example) adhere to the triple bottom line (TBL)."}, {"url": "http://work.chron.com/job-description-brand-ambassador-17805.html", "passage_text": "A brand is a company's most important asset. Brand ambassadors help marketing and sales managers increase brand value by representing the brand to target customers. Advertising creates the most famous brand ambassadors, such as Flo for Progressive Insurance or the gecko lizard for Geico."}, {"url": "http://www.paladinstaff.com/jobs/careers/brand-manager-job-description/", "passage_text": "If they are positive, inspiring and make you want to run out to buy the brand’s newest product, then a brand manager somewhere is doing his or her job. Brand managers are responsible for ensuring that the products, services and product lines that fall under their domain resonate with current and potential customers. To do so, these professionals continuously monitor marketing trends and keep a close eye on competitive products in the marketplace. Brand Managers are responsible for more than executing marketing campaigns; they are also in charge of managing and developing P&L and driving market growth. Strong analytical skills, business savvy and the ability to multitask are all essential."}, {"url": "http://www.prestigebrands.com/careers/brand-manager.html", "passage_text": "Brand Manager. The Brand Manager is responsible for leading and managing one or more of our consumer brands on either our Household Products or Over-the-Counter Healthcare marketing teams. The individual must be able to work in a fast paced, small, entrepreneurial environment with an emphasis on collective, collaborative teamwork. Careers. The Brand Manager is responsible for leading and managing one or more of our consumer brands on either our Household Products or Over-the-Counter Healthcare marketing teams."}, {"url": "http://www.businessnewsdaily.com/4679-corporate-social-responsibility.html", "passage_text": "Here are a few of the broad categories of social responsibility that businesses are practicing: Environment: One primary focus of corporate social responsibility is the environment. Businesses, both large and small, have a large carbon footprint. Any steps they can take to reduce those footprints are considered both good for the company and society as a whole. "}, {"url": "http://branduniq.com/2011/brand-manager-job-description/", "passage_text": "A brand management career can be very rewarding. As a Brand Manager you are responsible for managing the company’s most important assets, its brands. A strong brand increases profitability, builds customer loyalty and provides protection in difficult economic times"}, {"url": "http://www.paladinstaff.com/jobs/careers/brand-manager-job-description/", "passage_text": "Most brand managers work in a business or corporation. The brand manager may be in charge of their own team of marketers and creative, communications and digital professions, or they may be part of a larger shared-services marketing department where resources and personnel are shared across brands. Brand Managers are responsible for more than executing marketing campaigns; they are also in charge of managing and developing P&L and driving market growth. Strong analytical skills, business savvy and the ability to multitask are all essential."}]