[{"url": "http://www.differencebetween.net/business/difference-between-corporation-and-incorporation/", "passage_text": "1 While incorporation is the process, corporation is the organisation formed out of this process. 2  Corporation, as is generally known, is a body formed for the purpose of carrying out a business of any kind. 3  The term Corporation should be used when talking of business institutions or organisations or groups."}, {"url": "http://www.answers.com/Q/What_is_the_difference_between_corporation_and_incorporation", "passage_text": "Answer   A corporation is a business that has been legally incorporated. Being incorporated is signified by the initials Inc. after a business or after the name of … a person who has incorporated themseves as a corporate business."}, {"url": "http://smallbusiness.chron.com/differences-between-incorporation-corporation-nonprofit-60214.html", "passage_text": "Jupiterimages/Comstock/Getty Images. The terms “corporation,” “incorporation” and “nonprofit” refer to the formation and structure of legal entities. A corporation is an entity that the law treats as a “person.” Incorporation refers to the actions that form a corporation. A nonprofit is a type of corporation whose structure and purposes differ from a business"}, {"url": "http://www.answers.com/Q/What_is_the_difference_between_corporation_and_incorporation", "passage_text": "Confidence votes 12.6K. 'Incorporation' is the legal process whereby a 'corporation' is created. A corporation is a legal entity and is often referred to as an 'artificial person.' The corporation has an existence separate and apart from the person or persons who were involved in having it created."}, {"url": "http://www.wisegeek.org/what-is-the-difference-between-inc-and-corp.htm", "passage_text": "There is no real difference between Inc. and Corp. Any new business organizing under standard articles of incorporation, whether it is a C or S corporation, usually must identify itself by one of these designations and use it in all its business correspondence, but there is no real legal difference between the two."}, {"url": "http://smallbusiness.chron.com/differences-between-incorporation-corporation-nonprofit-60214.html", "passage_text": "Incorporation is the process that creates the corporation. The organizers must file articles of incorporation, or charter, with the state's corporations office. The corporation's birth certificate identifies the corporation’s name, which must be distinct from that of another corporation in the state and may not mislead."}]