[{"url": "http://ods.od.nih.gov/factsheets/Calcium-HealthProfessional/", "passage_text": "Food. Milk, yogurt, and cheese are rich natural sources of calcium and are the major food contributors of this nutrient to people in the United States [ 1 ]. Nondairy sources include vegetables, such as Chinese cabbage, kale, and broccoli. Spinach provides calcium, but its bioavailability is poor. "}, {"url": "http://www.dietitians.ca/Your-Health/Nutrition-A-Z/Calcium/Food-Sources-of-Calcium.aspx", "passage_text": "It helps your muscles work and your heartbeat. *This includes sources of calcium from food and supplements. Milk and milk alternatives are excellent sources of calcium. If you do not include milk or milk alternatives in your diet, there are other foods which contain calcium as well. This table will show you which foods are a source of calcium. "}, {"url": "http://www.webmd.com/food-recipes/guide/calcium-vitamin-d-foods", "passage_text": "The best way to get more calcium is from your diet. You probably already know that dairy products -- such as milk, cheese, and yogurt -- provide calcium. Other foods that are high in calcium include: 1  Spinach. 2  Kale. 3  Okra. 4  Collards. 5  Soybeans. 6  White beans. 7  Some fish, like sardines, salmon, perch, and rainbow trout."}, {"url": "http://www.vrg.org/nutrition/calcium.php", "passage_text": "However, other excellent sources of calcium exist. Sources of well-absorbed calcium for vegans include calcium-fortified soy milk and juice, calcium-set tofu, soybeans and soynuts, bok choy, broccoli, collards, Chinese cabbage, kale, mustard greens, and okra. Our Vegan Food Guide indicates good sources of calcium from several food groups. By choosing the suggested number of servings of calcium-rich foods daily, vegans should meet calcium needs. Table 2 shows several menus that contain more than 1000 mg of calcium."}, {"url": "http://www.wisegeek.org/which-foods-are-good-sources-of-calcium.htm", "passage_text": "Spinach can be used to make healthy, green smoothies. Some dairy products are fortified with vitamin D to boost calcium absorption. A sandwich made with Swiss cheese, a good source of calcium. Dairy products are a good source of calcium. Bananas contain calcium. A six-ounce serving of yogurt has 300 milligrams of calcium. Many nuts contain calcium. Milk is a good source of calcium. Spinach is one of the better-known vegetables with calcium"}, {"url": "http://www.spine-health.com/wellness/nutrition-diet-weight-loss/sources-calcium-food", "passage_text": "In the US, milk is fortified with Vitamin D, and a few other foods are sometimes also vitamin D-fortified (such as some types of cereal and bread). This vitamin occurs naturally in only a few foods, such as fatty fish (salmon, sardines) and egg yolks. "}, {"url": "http://www.healthlinkbc.ca/healthfiles/hfile68e.stm", "passage_text": "Foods high in calcium include milk, yogurt and beverages with calcium added such as soy beverages, orange juice, and rice beverages. Cheese is also a good source of calcium. For other foods, check the label. Calcium has been added if you see 'fortified' or 'enriched' on the label. Very few foods have vitamin D in them. Foods with a higher amount of vitamin D include fish, liver, and egg yolk. Excellent sources of vitamin D are foods and beverages that have vitamin D added to them."}]