[{"url": "http://www.webmd.com/osteoarthritis/guide/arthritis-basics", "passage_text": "Types of Arthritis. There are more than 100 different types of arthritis. Some of the more common types include: 1  Osteoarthritis. 2  This is the most common type of arthritis. 3  It occurs when the cartilage covering the end of the bones gradually wears away. 4  Without the protection of the cartilage, the bones begin to rub against each other and the resulting friction leads to pain and swelling"}, {"url": "http://www.webmd.com/rheumatoid-arthritis/guide/most-common-arthritis-types", "passage_text": "Joints that bear weight -- such as your knees, hips, feet, and spine-are the most common places it affects. It often comes on gradually over months or years. It causes the pain in the affected joint. But people who have it don’t feel sick or have the fatigue that comes with some other types of arthritis. Rheumatoid Arthritis. What it is: RA is an autoimmune disease. That means the immune system attacks parts of the body, especially the joints. That leads to inflammation, which can cause severe joint damage if you don’t treat it."}, {"url": "http://arthritis.emedtv.com/arthritis/arthritis-symptoms.html", "passage_text": "Any joint can be affected by arthritis. However, certain types are arthritis are more likely to affect certain joints. For example, ankylosing spondylitis most often affects the joints in the lower spine. Some types of arthritis affect other parts of the body besides the joints. For example, rheumatoid arthritis may cause more generalized symptoms that include weakness, tiring easily, a decreased appetite, weight loss, and a low-grade fever"}, {"url": "http://www.healthline.com/health-slideshow/arthritis-types", "passage_text": "Systemic lupus erythematosus (SLE) is another autoimmune disease that can affect joints. Many types of connective tissue are attacked in patients with SLE. SLE can damage joints, skin, kidneys, the brain, and other organs as well. Lupus is more common in women, and more likely in those with African or Asian ancestry. In autoimmune disease, the body attacks healthy joint tissue and causes pain, swelling and inflammation. The Arthritis Foundation estimates that 1.3 million adults in the United States have rheumatoid arthritis (RA), a form of arthritis caused by autoimmune disease."}, {"url": "http://www.healthline.com/health-slideshow/types-rheumatoid-arthritis", "passage_text": "Rheumatoid arthritis (RA) is an autoimmune disease that causes inflammation of the joints. Because many symptoms of RA are similar to those of a variety of other diseases, diagnosis can be difficult. A correct diagnosis requires clinical evaluation, X-rays, and a series of laboratory tests. The Mayo Clinic reports that juvenile RA is the most common type of arthritis in children under age 16. Symptoms may be temporary or last for a lifetime. Like adult RA, symptoms of juvenile RA include joint inflammation, stiffness, and pain."}, {"url": "https://en.wikipedia.org/wiki/Arthritis", "passage_text": "There are over 100 different forms of arthritis. The most common form of arthritis is osteoarthritis (degenerative joint disease), a result of trauma to the joint, infection of the joint, or age. Other arthritis forms are rheumatoid arthritis, psoriatic arthritis, and related autoimmune diseases. "}, {"url": "http://www.medicalnewstoday.com/articles/7621.php", "passage_text": "1 Types of arthritis such as lupus and rheumatoid arthritis affect multiple organs and cause a long list of symptoms. 2  In the US, there are reported to be 52.5 million adults with some form of arthritis. 3  Arthritis can impair a person's ability to perform everyday tasks. "}, {"url": "http://www.niams.nih.gov/Health_Info/Bone/Osteoporosis/Conditions_Behaviors/osteoporosis_arthritis.asp", "passage_text": "Arthritis. Arthritis is a general term for conditions that affect the joints and surrounding tissues. Joints are places in the body where bones come together, such as the knees, wrists, fingers, toes, and hips. The two most common types of arthritis are osteoarthritis and rheumatoid arthritis. 1  Osteoarthritis (OA) is a painful, degenerative joint disease that often involves the hips, knees, neck, lower back, or small joints of the hands. "}, {"url": "http://www.nhs.uk/conditions/Arthritis/Pages/Introduction.aspx", "passage_text": "1 Gout – a type of arthritis caused by too much uric acid in the body. 2  This can be left in joints (usually affecting the big toe) but can develop in any joint. 3  It causes intense pain and swelling. 4  Psoriatic arthritis – an inflammatory joint condition that can affect people with psoriasis. 1 Lupus – an autoimmune condition that can affect many different organs and the body's tissues. 2  Gout – a type of arthritis caused by too much uric acid in the body. 3  This can be left in joints (usually affecting the big toe) but can develop in any joint. 4"}, {"url": "http://arthritis.ca/aboutarthritis", "passage_text": "Arthritis is a disease that can involve any of the joints in the body, often occurring in the hip, knee, spine or other weight-bearing joints, but can also affect the fingers and other non-weight-bearing joints. Symptoms of arthritis include joint pain, swelling, stiffness and fatigue. "}]