[{"url": "http://www.analytictech.com/mb313/elements.htm", "passage_text": "Theoretical Framework. A theoretical framework is a collection of interrelated concepts, like a theory but not necessarily so well worked-out. A theoretical framework guides your research, determining what things you will measure, and what statistical relationships you will look for."}, {"url": "http://www.statisticssolutions.com/theoretical-framework/", "passage_text": "The theoretical framework is how you conceptualize the nature of your research problem, its basis and the analysis you will choose to investigate that problem. This framework determines how you perceive, make sense of, and interpret your data."}, {"url": "http://trentu.ca/history/workbook/theoreticalframeworks.php", "passage_text": "When using a theoretical framework to examine a topic, it is important to be explicit about: 1  what that theoretical framework is, 2  who is credited with coming up with the original theory (including notable people who modified or expanded on the theory), and. 3  any changes you are making to the theory in your use of it."}, {"url": "http://libguides.usc.edu/writingguide/theoreticalframework", "passage_text": "The theoretical framework is the structure that can hold or support a theory of a research study. The theoretical framework introduces and describes the theory that explains why the research problem under study exists. Swanson, Richard A. Theory Building in Applied Disciplines."}, {"url": "http://www.statisticssolutions.com/theoretical-framework/", "passage_text": "The theoretical framework is presented in the early section of a dissertation and provides the rationale for conducting your research to investigate a particular research problem. Consider the theoretical framework as a conceptual model that establishes a sense of structure that guides your research."}, {"url": "http://www.answers.com/Q/What_is_theoretical_framework_mean", "passage_text": "2. A Theoretical Framework is a collection of related concepts that guides your research, determine what things you will need to measure and/or what statistical relationship to look for. It is used in deductive, theory-testing studies."}, {"url": "http://www.analytictech.com/mb313/elements.htm", "passage_text": "In this sense, you are always being guided by a theoretical framework, but you don't know it. Not knowing what your real framework is can be a problem. The framework tends to guide what you notice in an organization, and what you don't notice. In other words, you don't even notice things that don't fit your framework!"}, {"url": "http://www.analytictech.com/mb313/elements.htm", "passage_text": "A theoretical framework is a collection of interrelated concepts, like a theory but not necessarily so well worked-out. A theoretical framework guides your research, determining what things you will measure, and what statistical relationships you will look for."}]