[{"url": "http://www.omnilexica.com/?q=felicio", "passage_text": "Cornicola, Felicio, master of the military at Venice; 738 73 Cornificius, L., Latin poet and consul of Rome; B.C. 35 D.H. X. Cornificius, Quintus, Roman statesman and tribune, friend of Cicero; B.C. D.H.X. Cornificius, Quintus, Roman statesman, ... "}, {"url": "http://www.answers.com/Q/What_is_fellatio", "passage_text": "Merge this question into. Split and merge into it. Answer by Invigilator - 007. Confidence votes 47.0K. SENIOR SUPERVISOR-SENIOR MENTOR. Fellatio is a form of oral sex performed on a male and is most commonly know as a blow job.. The male or female puts his or her partner's penis in the mouth and sucks on it. Oral sex on a female. Actually, you've listed both forms of oral sex. Fellatio is the act of oral stimulation of the male genitalia, and Cunnilingus is the act of oral stimul … ation on the female genitalia. + 38 others found this useful."}, {"url": "http://www.thinkbabynames.com/meaning/1/Felicio", "passage_text": "Felicio /fe-li-cio/ [4 sylls.] as a boys' name is of Latin derivation, and the name Felicio means happy, lucky. Felicio is a variant transcription of Felix (Latin): masculine of Felicity. Compare surname Felicia. Kreatif forms: Fenlicio, Flecio, Flelicio. Felicio is an unusual given name for males but a somewhat prominent surname for all people (#81414 out of 150436, Top 54%). (2000 U.S. Census). Felix (#267 the previous year) is the only prominent variation form of Felicio (outside Top 1000) ."}, {"url": "http://www.babynamespedia.com/meaning/Felicio", "passage_text": "[ syll. fe-li-cio, fel-ic-io ] The baby boy name Felicio is pronounced as FAHL IH Siyow †. The origin of Felicio is Latin. Felicio is a variant transcription of Felix. Felicio is unusual as a baby boy name. It is not listed in the top 1000. Out of the family of boy names directly linked to Felicio, Felix was the most widely used in 2012. "}, {"url": "http://www.answers.com/Q/What_is_fellatio", "passage_text": "Fellatio is a form of oral sex performed on a male and is most commonly know as a blow job.. Oral sex on a female. Actually, you've listed both forms of oral sex. Fellatio is the act of oral stimulation of the male genitalia, and Cunnilingus is the act of oral stimul … ation on the female genitalia. + 38 others found this useful."}]