[{"url": "http://www.emedicinehealth.com/hepatitis_a/page2_em.htm", "passage_text": "Hepatitis A Causes. The cause of hepatitis A is hepatitis A virus (HAV) that is transmitted person to person by contaminated foods, water or other drinks (including ice), blood, stool, and direct contact. The virus is a Picornavirus that contains single-stranded RNA as its genome covered by a protein shell"}, {"url": "https://en.wikipedia.org/wiki/Hepatitis_A", "passage_text": "Hepatitis A (formerly known as infectious hepatitis) is an acute infectious disease of the liver caused by the hepatitis A virus (HAV). Many cases have few or no symptoms, especially in the young. The time between infection and symptoms, in those who develop them, is between two and six weeks. "}, {"url": "http://www.medicinenet.com/hepatitis_a/article.htm", "passage_text": "Hepatitis A is a virus, or infection, that causes liver disease and inflammation of the liver. Viruses can cause sickness. For example, the flu is caused by a virus. People can pass viruses to each other. 1 Hepatitis A is an inflammatory disease of the liver caused by a virus. 2  The liver stores nutrients and vitamins, helps digest foods, helps prevent infections, and helps remove harmful substances from blood. 3  Hepatitis A viruses cause the disease termed hepatitis A."}, {"url": "http://www.webmd.com/hepatitis/hepa-guide/hepatitis-a-topic-overview", "passage_text": "Hepatitis A is a virus that can infect the liver. In most cases, the infection goes away on its own and doesn't lead to long-term liver problems. In rare cases, it can be more serious. Other viruses (hepatitis B and hepatitis C) also can cause hepatitis. Hepatitis A is the most common type. "}, {"url": "http://www.rightdiagnosis.com/h/hepatitis_a/causes.htm", "passage_text": "Primary Cause of Hepatitis A. The primary cause of Hepatitis A is the result: 1  of eating food from an animal infected with an infectious agent, or from food that is contaminated from the food handler (who is infected with Hepatitis A), or from contaminated soil or water, or from toxins produced by an infectious organism. "}, {"url": "http://www.symptomfind.com/diseases-conditions/hepatitis-a/", "passage_text": "Definition. Hepatitis A is a viral infection that causes irritation and swelling of the liver. Hepatitis A is the most common strain amongst the several types of hepatitis infections. It is easily spread by close contact with someone who is infected."}, {"url": "http://www.who.int/mediacentre/factsheets/fs328/en/", "passage_text": "1 Hepatitis A is a viral liver disease that can cause mild to severe illness. 2  The hepatitis A virus is transmitted through ingestion of contaminated food and water or through direct contact with an infectious person. 3  Almost everyone recovers fully from hepatitis A, but very small proportions die from fulminant hepatitis. Key facts. 1 "}]