[{"url": "http://www.seniorhomes.com/s/minnesota/nursing-homes/", "passage_text": "The average cost of Nursing Homes in Minnesota is $231. Nursing Homes costs range from $107 to $380 depending on location and other factors. In Minnesota there are 409 Nursing Homes. We can help you find the best matches for your needs. The average cost of Nursing Homes in Minnesota is $231 per day."}, {"url": "http://www.zillow.com/minneapolis-mn/home-values/", "passage_text": "The median home value in Minneapolis is $202,200. Minneapolis home values have gone up 3.1% over the past year and Zillow predicts they will rise 1.6% within the next year. The median rent price in Minneapolis is $1,495, which is higher than the Minneapolis-St Paul Metro median of $1,450. Read more. Foreclosures will be a factor impacting home values in the next several years. In Minneapolis 4.6 homes are foreclosed (per 10,000). This is greater than the Minneapolis-St Paul Metro value of 3.0 and also greater than the national value of 3.5. Mortgage delinquency is the first step in the foreclosure process. This is when a homeowner fails to make a mortgage payment."}, {"url": "http://www.trulia.com/real_estate/Minneapolis-Minnesota/market-trends/", "passage_text": "Summary for Minneapolis. The median sales price for homes in Minneapolis MN for Jul 15 to Oct 15 was $225,000. This represents an increase of 0.1%, or $174, compared to the prior quarter and an increase of 5.6% compared to the prior year. Sales prices have appreciated 13% over the last 5 years in Minneapolis. Average price per square foot for Minneapolis MN was $133, an increase of 0% compared to the same period last year. Popular neighborhoods in Minneapolis include Linden Hills, Victory, Kingfield, Fulton, Downtown West, and Howe."}, {"url": "https://www.rentjungle.com/average-rent-in-minneapolis-rent-trends/", "passage_text": "Minneapolis Average Rent. As of August 2015, average apartment rent within 10 miles of Minneapolis, MN is $1259. One bedroom apartments in Minneapolis rent for $1022 a month on average and two bedroom apartment rents average $1355. See our listings of Minneapolis Apartments. The average apartment rent over the prior 6 months in Minneapolis has increased by $129 (11.4%). One bedroom units have increased by $133 (15%) and two bedroom apartments have increased by $129 (10.5%)"}, {"url": "http://www.areavibes.com/minneapolis-mn/cost-of-living/", "passage_text": "1 The price of pizza in Minneapolis is 12.6% higher than the national average. 2  Truckee, CA is the most expensive city for pizza at $15.99. 3  Kennewick, WA is the least expensive city for pizza at $6.99. 1 The price of coffee in Minneapolis is 4.7% higher than the national average. 2  Honolulu, HI is the most expensive city for coffee at $7.79. 3  Fort Lauderdale, FL is the least expensive city for coffee at $2.99."}, {"url": "https://www.rentjungle.com/average-rent-in-minneapolis-rent-trends/", "passage_text": "Rent trend data in Minneapolis, Minnesota. As of August 2015, average apartment rent within 10 miles of Minneapolis, MN is $1259. One bedroom apartments in Minneapolis rent for $1022 a month on average and two bedroom apartment rents average $1355. See our listings of Minneapolis Apartments. The average apartment rent over the prior 6 months in Minneapolis has increased by $129 (11.4%). One bedroom units have increased by $133 (15%) and two bedroom apartments have increased by $129 (10.5%)"}, {"url": "http://www.areavibes.com/minneapolis-mn/cost-of-living/", "passage_text": "1 The price of gas in Minneapolis is 6.8% lower than the national average. 2  Kodiak, AK is the most expensive city for gas at $3.74 per gallon. 3  Colorado Springs, CO is the least expensive city for gas at $1.62 per gallon. 1 The price of coffee in Minneapolis is 4.7% higher than the national average. 2  Honolulu, HI is the most expensive city for coffee at $7.79. 3  Fort Lauderdale, FL is the least expensive city for coffee at $2.99."}, {"url": "http://www.zillow.com/mn/home-values/", "passage_text": "The median home value in Minnesota is $181,700. Minnesota home values have gone up 2.6% over the past year and Zillow predicts they will rise 1.5% within the next year. The median rent price in Minnesota is $1,400. Read more. Foreclosures will be a factor impacting home values in the next several years. In Minnesota 2.8 homes are foreclosed (per 10,000)"}, {"url": "http://www.areavibes.com/minneapolis-mn/cost-of-living/", "passage_text": "1 The price of pizza in Minneapolis, MN is $10.58. 2  The price of pizza in Minneapolis is 12.6% higher than the national average. 3  Truckee, CA is the most expensive city for pizza at $15.99. 1 The price of coffee in Minneapolis is 4.7% higher than the national average. 2  Honolulu, HI is the most expensive city for coffee at $7.79. 3  Fort Lauderdale, FL is the least expensive city for coffee at $2.99."}]