[{"url": "http://www.axs.com/news/prince-announces-partnership-with-warner-bros-plans-purple-rain-re-rel-10401", "passage_text": "No timetable has been announced as to when fans can expect for the Purple Rain reissue or new music to arrive, but Prince has been steadily releasing music over the past year or so. Most recently, he shared a surprisingly club-friendly collaboration with Zooey Deschanel called “ Fallinlove2nite .”. “Everyone at Warner Bros Records is delighted to be working with Prince once again: he is one of the world’s biggest stars and a truly unique talent” Entertainment Weekly quoted Warner Bros. Records chairman Cameron Strang as saying in a statement."}, {"url": "https://en.wikipedia.org/wiki/Purple_Rain_(album)", "passage_text": "Purple Rain is the sixth studio album by American recording artist Prince and The Revolution and is the soundtrack album to the 1984 film of the same name. It was released on June 25, 1984 by Warner Bros. Records. Purple Rain is regularly ranked among the best albums in music history. Time magazine ranked it the 15th greatest album of all time in 1993, and it placed 18th on VH1 's Greatest Rock and Roll Albums of All Time countdown. The 1000th issue of Entertainment Weekly dated July 4, 2008 listed Purple Rain at number one on their list of the top 100 best albums of the past 25 years. In 2013, the magazine also listed the album at number two on their list of the 100 Greatest Albums ever."}, {"url": "https://en.wikipedia.org/wiki/Purple_Rain_(song)", "passage_text": "Purple Rain (song).  Purple Rain  is a song by Prince and The Revolution. It is the title track from the 1984 album of the same name, which in turn is the soundtrack album for the 1984 film of the same name, and was released as the third single from that album. The song is a combination of rock, pop, gospel, and orchestral music. "}, {"url": "https://en.wikipedia.org/wiki/Purple_Rain_(album)", "passage_text": "Purple Rain was released by Warner Bros. Records on June 25, 1984, and was Prince's sixth album. Prince wrote all of the songs on the album, some with the input of fellow band members. The 1000th issue of Entertainment Weekly dated July 4, 2008 listed Purple Rain at number one on their list of the top 100 best albums of the past 25 years. In 2013, the magazine also listed the album at number two on their list of the 100 Greatest Albums ever."}, {"url": "https://en.wikipedia.org/wiki/Purple_Rain_(film)", "passage_text": "Purple Rain is a 1984 American rock musical drama film directed by Albert Magnoli and written by Magnoli and William Blinn. In it, Prince makes his film debut, which was developed to showcase his particular talents. Hence, the film contains several extended concert sequences. The film grossed more than US$80 million at the box office and became a cult classic. Purple Rain is the only feature film starring Prince that he did not direct. The film won an Academy Award for Best Original Song Score, currently the last film to receive the award. It was nominated for two Razzie Awards, including Worst New Star for Apollonia Kotero and Worst Original Song for  Sex Shooter "}, {"url": "http://www.axs.com/news/prince-announces-partnership-with-warner-bros-plans-purple-rain-re-rel-10401", "passage_text": "10401. Prince announced a partnership with his old record label, Warner Bros., on Friday that will give him the rights to his back catalog and includes a remastered re-release of his classic album Purple Rain in time for its 30th anniversary this summer. “Everyone at Warner Bros Records is delighted to be working with Prince once again: he is one of the world’s biggest stars and a truly unique talent” Entertainment Weekly quoted Warner Bros. Records chairman Cameron Strang as saying in a statement."}, {"url": "http://www.nytimes.com/movie/review?res=950CE4D9143AF934A15754C0A962948260", "passage_text": "''Purple Rain,'' which introduces Prince, the rising young rock performer, to theatrical films, is probably the flashiest album cover ever to be released as a movie. However, like many album covers, ''Purple Rain,'' though sometimes arresting to look at, is a cardboard come-on to the record it contains. PURPLE RAIN, directed by Albert Magnoli; screenplay by Albert Magnoli and William Blinn; director of photography, Donald L. Thorin; edited by Albert Magnoli; music by Prince; produced by Robert Cavallo, Joseph Ruffalo and Steven Fargnoli; released by Purple Films Company and Warner Bros."}, {"url": "http://www.pinkisthenewblog.com/2014-06-25/princes-purple-rain-album-was-released-30-years-ago-today", "passage_text": "Six albums into his career, Prince had found a terrific band in the Revolution and figured out how to sell his freakiness in malls and movie houses across the country. It was 30 years ago today, on June 25, 1984, that Prince released his masterpiece soundtrack album Purple Rain. The album was released a couple of months before the movie was released in theaters, giving the music some time to storm the Billboard charts and get people excited for the film. Billboard magazine has published a track-by-track review of Purple Rain which you can read in full HERE. If you have the time, I suggest you cue up this album (or play your MP3s) at some point today to mark the 30th anniversary of the release of"}]