[{"url": "https://collegegrad.com/careers/social-workers", "passage_text": "The median annual wage for social workers was $44,200 in May 2012. The median wage is the wage at which half the workers in an occupation earned more than that amount and half earned less. The lowest 10 percent earned less than $27,450, and the top 10 percent earned more than $72,980."}, {"url": "https://www.bwc.ohio.gov/downloads/blankpdf/award.pdf", "passage_text": "An injured worker has two years from date of injury to filefor the VSSR award. Permanent total disability Permanent total disability compensation is paid to an injured worker when the IC declares him or her permanently and totally disabled due to a work-related injury or occupational disease. Injured workers receiving permanent total disability compensa-tion cannot return to work. "}, {"url": "https://www.ssa.gov/ny/jobs-salary.htm", "passage_text": "Jobs With Social Security. Competitive starting salaries: between $31,628 to $35,662 at the GS-5 level, and $39,179 to $44,175 at the GS-7 level. (Salaries vary by geographic location.)."}, {"url": "http://www1.salary.com/Disability-Claims-Examiner-Salary.html", "passage_text": "For example the median expected annual pay for a typical Disability Claims Examiner in the United States is $41,189 so 50% of the people who perform the job of Disability Claims Examiner in the United States are expected to make less than $41,189. Source: HR Reported data as of October 2015. Median $41,189. 1  Salary. "}, {"url": "http://www.payscale.com/research/CA/Job=Community_Support_Worker/Hourly_Rate", "passage_text": "Community Support Worker Salary. (Canada). A Community Support Worker earns an average wage of C$16.79 per hour. Pay for this job does not change much by experience, with the most experienced earning only a bit more than the least. Most people move on to other jobs if they have more than 20 years' experience in this career"}, {"url": "http://www.salary.com/benefits/layouthtmls/bnfl_display_nocat_Ser77_Par166.html", "passage_text": "Long-term disability insurance usually begins after the short-term disability coverage period ends. It covers a portion of salary in case an employee is out of work for an extended period because of illness. Usually there is no charge to the employee. Short-term disability. When an employee needs to be away from work for an extended period-say, for a nonwork-related disability like maternity, illness, or injury-that employee may have access to a short-term disability (STD) program, which helps provide at least partial income protection."}, {"url": "http://www.indeed.com/salary/q-Social-Worker-Developmental-Disability-Case-Manager-l-Janesville,-WI.html", "passage_text": "Average Social Worker Developmental Disability Case Manager salaries for job postings in Janesville, WI are 14% lower than average Social Worker Developmental Disability Case Manager salaries for job postings nationwide. "}, {"url": "https://www.ssa.gov/ny/jobs-salary.htm", "passage_text": "Information on Salary and Benefits. Competitive starting salaries: between $31,628 to $35,662 at the GS-5 level, and $39,179 to $44,175 at the GS-7 level. (Salaries vary by geographic location.). An excellent retirement program that includes a tax-deferred savings plan with matching contribution"}, {"url": "http://www.nolo.com/legal-encyclopedia/how-much-does-long-term-disability-pay.html", "passage_text": "Talk to a Lawyer. Enter Your Zip Code to Connect with a Lawyer Serving Your Area. Long-term disability (LTD) benefits pay a percentage of your salary or wages and can be increased by cost-of-living adjustments (COLAs) and/or decreased by offsets of other benefits, earnings from work, and taxes. The offset works like this: if you receive $1,400 in LTD benefits and are approved for $1,100 from Social Security, you will receive the full $1,100 from Social Security, but only $300 from your insurance company, for a total of $1,400."}]