[{"url": "http://sasgreekart.pbworks.com/w/page/10150033/Temple%20of%20Athena%20Nike", "passage_text": "This temple is in a sacred area of the city and was and is an important part of the Athenian Acropolis. How it was built: The Temple of Athena Nike, around the Mediterranean, was designed by architects of the Parthenon, Callicrates and built in 427 BC. This temple was made of cut stone and bearing masonry, and planned to be 12 feet and 10 fingers by 14 feet. "}, {"url": "https://en.wikipedia.org/wiki/Temple_of_Athena_Nike", "passage_text": "Nike means victory in Greek, and Athena was worshipped in this form, as goddess of victory in war and wisdom. The citizens worshipped the goddess in hope of a prosperous outcome in the long Peloponnesian War fought on land and sea against the Spartans and their allies. In the sixth century BC a cult of Athena Nike was established and a small temple was built using Mycenaean fortification and Cyclopean masonry. After the temple was demolished by the Persians in 480BC a new temple was built over the remains."}, {"url": "https://en.wikipedia.org/wiki/Temple_of_Athena_Nike", "passage_text": "The Temple of Athena Nike was built around 420BC, during the Peace of Nicias. It is a tetrastyle (four column) Ionic structure with a colonnaded portico at both front and rear facades (amphiprostyle), designed by the architect Kallikrates. The columns along the east and west fronts were monolithic columns. In the sixth century BC a cult of Athena Nike was established and a small temple was built using Mycenaean fortification and Cyclopean masonry. After the temple was demolished by the Persians in 480BC a new temple was built over the remains."}, {"url": "http://www.answers.com/Q/What_was_the_temple_of_Athena_Nike_built_out_of", "passage_text": "The Temple of Athena Nike was built in honor of the goddess, but it was later replaced by one of Greece's most renowned architectural masterpieces: the Parthenon. 3 people found this useful. "}, {"url": "http://www.visit-ancient-greece.com/temple-of-athena-nike.html", "passage_text": "Built in honour of Athena. The temple of Athena Nike was added between 432 to 421 BC. The Peloponnesian war between Athens and Sparta was fought between 431 to 404 BC, so the temple was constructed during the war. The great Athenian leader, Pericles, died in 429 BC. Many visitors to the Acropolis almost miss the temple of Athena Nike. It's easily done. As you climb the steps to the PropylaeaFrom the Greek pro (before or in front of) plus pylon or pylaion (gate), which came to mean 'gate building'."}, {"url": "http://www.answers.com/Q/Why_was_the_temple_of_athena_nike_built", "passage_text": "The Temple of Athena Nike was built in honor of the goddess, but it was later replaced by one of Greece's most renowned architectural masterpieces: the Parthenon. "}, {"url": "http://www.ancient.eu/article/62/", "passage_text": "By the sixth century B.C., also known as the Archaic period, a cult of Athena Nike was established and a small, earlier temple was built on the site. When the Persians sacked Athens and destroyed the Acropolis in 480 B.C., the temple to Athena Nike was also left in ruins. The Temple of Athena Nike is the smallest structure on the Athenian Acropolis, but holds no less importance than its neighboring shrines. Built to honor Athena Nike, the goddess of victory, the site upon which the temple was constructed has ceremonial roots that date back to the Bronze Age"}, {"url": "http://www.ancient.eu/article/62/", "passage_text": "Today, the Temple of Athena Nike can be seen on the Athenian Acropolis, in its restored state. It suffered much the same fate as the other buildings of the Acropolis, having been the victim of Ottoman occupation and Turkish siege in 1687. In 1834, the temple was reconstructed after Greece's emancipation. The Temple of Athena Nike is the smallest structure on the Athenian Acropolis, but holds no less importance than its neighboring shrines. Built to honor Athena Nike, the goddess of victory, the site upon which the temple was constructed has ceremonial roots that date back to the Bronze Age"}, {"url": "http://www.aviewoncities.com/athens/acropolis.htm", "passage_text": "Temple of Athena Nike. In front of the south wing of the Propylaea stands the Temple of Athena Nike, dedicated to the goddess of Victory. It is a small temple built in 421 BC, during a pause in the Peloponnesian War. The temple was designed by Kallikrates, who had also worked on the Parthenon. "}]