[{"url": "http://www.everydayhealth.com/osteoporosis/osteoporosis-and-gender.aspx", "passage_text": "However, when men get osteoporosis, it is usually related to another health condition, a lifestyle choice (smoking or alcohol abuse), or medication that has bone loss as a side effect. Osteoporosis risk is different for men and women, but the disease is dangerous for anyone who gets it. Women start with lower bone density than their male peers and they lose bone mass more quickly as they age, which leads to osteoporosis in some women. Between the ages of 20 and 80, the average white woman loses one-third of her hip bone density, compared to a bone density loss of only one-fourth in men."}, {"url": "http://www.webmd.com/menopause/osteoporosis-menopause", "passage_text": "Osteoporosis is a disease that weakens bones, increasing the risk of sudden and unexpected fractures. Literally meaning porous bone, osteoporosis results in an increased loss of bone mass and strength. Osteoporosis and Menopause. Osteoporosis is a disease that weakens bones, increasing the risk of sudden and unexpected fractures. Literally meaning porous bone, osteoporosis results in an increased loss of bone mass and strength. The disease often progresses without any symptoms or pain."}, {"url": "http://www.health.ny.gov/publications/2047/index.htm", "passage_text": "Osteoporosis is a disease that causes bones to become thin, weak and more likely to break, most often from a minor fall. Although you can break a bone in any part of your body, the most common broken bones are the spine, wrist or hip. Osteoporosis is often called a silent disease.. You can't feel or see your bones getting thinner. Many people do not even know that they have thin bones until a bone breaks"}, {"url": "https://en.wikipedia.org/wiki/Osteoporosis", "passage_text": "Osteoporosis becomes more common with age. About 15% of white people in their 50s and 70% of those over 80 are affected. It is more common in women than men. In the developed world, depending on the method of diagnosis, 2% to 8% of males and 9% to 38% of females are affected. Bone loss increases after menopause due to lower levels of estrogen. Osteoporosis may also occur due to a number of diseases or treatments including alcoholism, anorexia, hyperthyroidism, surgical removal of the ovaries, and kidney disease."}, {"url": "http://nihseniorhealth.gov/osteoporosis/whatisosteoporosis/01.html", "passage_text": "A Bone Disease. Osteoporosis is a disease that thins and weakens the bones to the point that they become fragile and break easily. Women and men with osteoporosis most often break bones in the hip, spine, and wrist, but any bone can be affected. You can't catch osteoporosis or give it to someone else. In the United States, more than 40 million people either already have osteoporosis or are at high risk due to low bone mass, placing them at risk for more serious bone loss and fractures. Although osteoporosis can strike at any age, it is most common among older people, especially older women."}, {"url": "http://www.osteoporosis.ca/osteoporosis-and-you/osteoporosis-facts-and-statistics/", "passage_text": "1 Osteoporosis is a condition that causes bones to become thin and porous, decreasing bone strength and leading to increased risk of breaking a bone. 2  The most common sites of osteoporotic fracture are the wrist, spine, shoulder and hip. 3  No single cause for osteoporosis has been identified. About osteoporosis. 1  Osteoporosis is a condition that causes bones to become thin and porous, decreasing bone strength and leading to increased risk of breaking a bone. 2  The most common sites of osteoporotic fracture are the wrist, spine, shoulder and hip. 3  No single cause for osteoporosis has been identified."}, {"url": "https://en.wikipedia.org/wiki/Osteoporosis", "passage_text": "Osteoporosis is a disease where decreased bone strength increases the risk of a broken bone. It is the most common reason for a broken bone among people who are old. Bones that commonly break include the back bones, the bones of the forearm, and the hip. Until a broken bone occurs there are typically no symptoms. Bone loss increases after menopause due to lower levels of estrogen. Osteoporosis may also occur due to a number of diseases or treatments including alcoholism, anorexia, hyperthyroidism, surgical removal of the ovaries, and kidney disease."}]