[{"url": "https://en.wikipedia.org/wiki/Landlocked", "passage_text": "Countries thus have made particular efforts to avoid being landlocked, by acquiring land that reaches the sea: 1  As result of a 2005 territorial exchange with Ukraine, Moldova received a 600m-long bank of the Danube River (which is an international waterway), subsequently building its Port of Giurgiulești there. A country is doubly landlocked or double-landlocked when it is surrounded entirely by one or more landlocked countries (requiring the crossing of at least two national borders to reach a coastline). There are currently only two such countries: 1  Liechtenstein in Central Europe, surrounded by Switzerland and Austria."}, {"url": "http://www.sheppardsoftware.com/Asiaweb/factfile/Unique-facts-Asia4.htm", "passage_text": "It is often listed as the world's largest lake, though it is not a freshwater one. The Caspian Sea is bordered by Russia (Dagestan, Kalmykia, Astrakhan Oblast), Republic of Azerbaijan, Iran (Guilan, Mazandaran and Golestan provinces), Turkmenistan, and Kazakhstan, with the central Asian steppes to the north and east. On its eastern Turkmen shore is a large embayment, the Kara Bogaz Gol. "}, {"url": "https://en.wikipedia.org/wiki/Landlocked", "passage_text": "Landlocked countries: 42 landlocked (green), 2 doubly landlocked (purple). A landlocked state or country is a sovereign state entirely enclosed by land, or whose only coastlines lie on closed seas. There are currently 48 such countries, including four partially recognised states. A country is doubly landlocked or double-landlocked when it is surrounded entirely by one or more landlocked countries (requiring the crossing of at least two national borders to reach a coastline). There are currently only two such countries: 1  Liechtenstein in Central Europe, surrounded by Switzerland and Austria."}, {"url": "https://en.wikipedia.org/wiki/Landlocked", "passage_text": "1 The Danube is an international waterway, and thus landlocked Austria, Hungary, Moldova, Serbia, and Slovakia have secure access to the Black Sea (the same access is given to southern parts of Germany, itself not landlocked, and eastern parts of Croatia, which is also not landlocked). A country is doubly landlocked or double-landlocked when it is surrounded entirely by one or more landlocked countries (requiring the crossing of at least two national borders to reach a coastline). There are currently only two such countries: 1  Liechtenstein in Central Europe, surrounded by Switzerland and Austria."}, {"url": "http://geography.about.com/od/politicalgeography/a/landlocked.htm", "passage_text": "The two doubly-landlocked countries are Uzbekistan (surrounded by Afghanistan, Kazakhstan, Kyrgyzstan, Tajikistan, and, Turkmenistan) and Liechtenstein (surrounded by Austria and Switzerland). Kazakhstan is the world's ninth largest country but is the world's largest landlocked country. It's 1.03 million square miles (2.67 million km 2) and is bordered by Russia, China, the Kyrgyz Republic, Uzbekistan, Turkmenistan, and the landlocked Caspian Sea. Approximately one-fifth of the world's countries are landlocked, meaning they have no access to the oceans. There are 43 landlocked countries that do not have direct access to an ocean or ocean-accessible sea (such as the Mediterranean Sea)"}, {"url": "http://www.answers.com/Q/Why_is_Russia_landlocked", "passage_text": "Confidence votes 4. Russia has no direct outlets except on the Pacific Ocean and the White and Arctic Seas. To reach the Atlantic, the ships must travel along devious routes: in the north via the Finnish Gulf, the Baltic Sea, and the North Sea; in the south through the Black Sea, the Dardanelles, and the Mediterranean. 1 Doubly Landlocked Countries The geology of a country can have a huge impact on its existence. 2  Land and water formations often determine a country's military and economic well-being. 3  Access to the sea is…. 4  Europe on a Budget: 21 Free Walking Tours in Europe Walking tours can be a great way to get to know a new city."}, {"url": "http://edelweisstravel.org/index.php?option=com_content&view=article&id=44&Itemid=169", "passage_text": "It is neighbored to Russia, China,Kyrgyzstan, Uzbekistan, Turkmenistan, and also has borders on a significant part of the Caspian Sea. Although Kazakhstan does not share a border with Mongolia, its most easterly point is only 38 kilometers from Mongolia's western tip. The ninth largest country in the world by land area, it is also the world's largest landlocked country. Its territory is 2,727,300 square kilometers that is larger than Western Europe. While located primarily in Asia, a small portion of Kazakhstan is also located west of the Urals in Ea"}, {"url": "http://edelweisstravel.org/index.php?option=com_content&view=article&id=44&Itemid=169", "passage_text": "The Republic of Kazakhstan, is a transcontinental country in Central Asia and Europe. The ninth largest country in the world by land area, it is also the world's largest landlocked country. Its territory is 2,727,300 square kilometers that is larger than Western Europe. While located primarily in Asia, a small portion of Kazakhstan is also located west of the Urals in Eastern Europe."}]