[{"url": "http://cookieandkate.com/2012/crispy-baked-french-fries/", "passage_text": "1 Drain the potatoes and pat them dry thoroughly with a tea towel or paper towels. 2  Toss the potatoes with the remaining 1 teaspoon oil and mix evenly. 3  Arrange the fries in a single layer on a baking sheet and cover the sheet tightly with foil. 4  Bake for 5 minutes, then remove the foil and continue to bake for 10 minutes."}, {"url": "http://www.recklessabandoncook.com/2012/12/crispy-oven-baked-french-fries.html", "passage_text": "-large bowl of ice water. First, slice your potatoes into 1/2 inch discs and then again to make 1/2 inch sticks. Also, preheat your oven to 450 degrees. Place the fries in a large bowl of ice water and let soak for at least 10 minutes. Drain the water from the fries and throughly pat dry with paper towels."}, {"url": "http://www.health-foodie.com/2010/03/10-tips-to-make-your-oven-fries-crispier/", "passage_text": "You simply soak the potato fries in some water for 1-2 hours before baking them. Feel free to change the water half-way through. By soaking them, some of the starches leech out into the water. The starch in potatoes hinders moisture from escaping, which leaves more water in the potato."}, {"url": "http://cookieandkate.com/2012/crispy-baked-french-fries/", "passage_text": "1 Bake for 5 minutes, then remove the foil and continue to bake for 10 minutes. 2  Rotate the pan and cook another 5 to 10 minutes, until the underside of the potatoes are spotty golden brown. 3  Remove the baking sheet from the oven and scrape the fries loose with a spatula."}, {"url": "http://foodformyfamily.com/the-kitchen-sink/the-right-and-proper-way-to-bake-a-french-fry", "passage_text": "Method: Add cut potatoes to large bowl and cover with warm water. Allow to soak for 20 minutes as you preheat your oven to 475°F. Drain the potatoes, pat dry and toss in oil to coat. Season and bake for 10-15 minutes, rotating the sheet halfway through. Turn the fries and bake for an additional 10 minutes or until golden brown. Results: These produced nice, crispy french fires, but they were also a bit time consuming with all the soaking, drying and then baking again."}]