[{"url": "https://en.wikipedia.org/wiki/Ossicles", "passage_text": "The ossicles (also called auditory ossicles) are three bones in either middle ear that are among the smallest bones in the human body. They serve to transmit sounds from the air to the fluid-filled labyrinth (cochlea). The structure is known as the middle ear, and is made up of the stapes, incus, malleus, and tympanic membrane. These correspond to the columella, quadrate, articular, and angular structures in the amphibian, bird or reptile jaw."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=21685", "passage_text": "There are three small bones, or ossicles, that are located adjacent to the tympanic membrane. The malleus, incus, and stapes are attached like a chain to the tympanic membrane and convert sound waves that vibrate the membrane into mechanical vibrations of the three bones. "}, {"url": "http://www.answers.com/Q/The_auditory_ossicles_are_located_within_the", "passage_text": "The three auditory ossicles are located in the middle ear. Their  function is to transmit and amplify the sound vibrations from the  tympanic membrane (eardrum) to the oval … window. middle ear. The auditory ossicles are the three smallest bones in the body, the malleus, incus, and stapes."}, {"url": "http://www.theodora.com/anatomy/the_auditory_ossicles.html", "passage_text": "The tympanic cavity contains a chain of three movable ossicles, the malleus, incus, and stapes. The first is attached to the tympanic membrane, the last to the circumference of the fenestra vestibuli, the incus being placed between and connected to both by delicate articulations. "}, {"url": "http://bioweb.uwlax.edu/aplab/Lab-Unit-04/Lab-04-13.html", "passage_text": "2. Incus (anvil). 3. Malleus (hammer). The auditory ossicles consist of three small bones found within a space (the tympanic cavity) in the temporal bone of the skull. The bones (which are named for their shape) are connected by synovial joints"}, {"url": "http://www.answers.com/Q/The_auditory_ossicles_are_located_within_the", "passage_text": "The stapes (aka stirrup) is the smallest of the three auditory  ossicles of the middle ear. These little bones amplify and  transmit sound vibrations from the tympanic mem … brane (eardrum) to  the oval window. The stapes is in direct contact with the oval  window. middle ear. The auditory ossicles are the three smallest bones in the body, the malleus, incus, and stapes."}, {"url": "https://en.wikipedia.org/wiki/Middle_ear", "passage_text": "The Middle Ear is the portion of the ear internal to the eardrum, and external to the oval window of the inner ear. Also mammalian middle ear contains three ossicles, which transfers the vibrations of the eardrum into waves in the fluid and membranes of the inner ear. The hollow space of the middle ear has also been called the tympanic cavity, or cavum tympani. The middle ear contains three tiny bones known as the ossicles: malleus, incus, and stapes. The ossicles were given their Latin names for their distinctive shapes; they are also referred to as the hammer, anvil, and stirrup, respectively."}, {"url": "http://www.answers.com/Q/Where_are_auditory_ossicles_located", "passage_text": "The stapes (aka stirrup) is the smallest of the three auditory  ossicles of the middle ear. These little bones amplify and  transmit sound vibrations from the tympanic mem … brane (eardrum) to  the oval window. The stapes is in direct contact with the oval  window. "}, {"url": "http://medical-dictionary.thefreedictionary.com/auditory+ossicles", "passage_text": "auditory ossicles. the malleus, incus and stapes, the three small bones of the tympanic cavity of the ear. They form a connecting bony system from the tympanic membrane to the oval window that is the opening to the internal ear. auditory tube. the narrow channel connecting the nasopharynx to the middle ear. See also pharyngotympanic tube. Etymology: L, audire + ossiculum, little bone. the malleus, the incus, and the stapes, three small bones in the middle ear that articulate with each other. As the tympanic membrane vibrates, it transmits sound waves through the ossicles to the cochlea."}]