[{"url": "http://www.merriam-webster.com/dictionary/myopia", "passage_text": "Full Definition of MYOPIA. 1. : a condition in which the visual images come to a focus in front of the retina of the eye resulting especially in defective vision of distant objects. 2. : a lack of foresight or discernment: a narrow view of something. — my·o·pic \\-ˈō-pik, -ˈae-\\ ˈä. adjective"}, {"url": "http://www.definitions.net/definition/myopia", "passage_text": "Myopia. Myopia, commonly known as being nearsighted and shortsighted, is a condition of the eye where the light that comes in does not directly focus on the retina but in front of it. This causes the image that one sees when looking at a distant object to be out of focus, but in focus when looking at a close object."}, {"url": "http://www.webmd.com/eye-health/tc/nearsightedness-myopia-topic-overview", "passage_text": "Most nearsightedness is caused by a natural change in the shape of the eyeball. Less often, nearsightedness may be caused by a change in the cornea or the lens. These problems cause light rays entering the eye to focus in front of the retina. Normally, light focuses directly on the retina. If you are nearsighted, objects in the distance appear blurry and out of focus. You might squint or frown when trying to see distant objects clearly. View a photo as seen through a normal and a nearsighted eye. Nearsightedness is usually a variation from normal, not a disease."}, {"url": "http://www.aoa.org/patients-and-public/eye-and-vision-problems/glossary-of-eye-and-vision-conditions/myopia?sso=y", "passage_text": "Myopia (Nearsightedness). Nearsightedness, or myopia, as it is medically termed, is a vision condition in which close objects are seen clearly, but objects farther away appear blurred. Nearsightedness occurs if the eyeball is too long or the cornea, the clear front cover of the eye, has too much curvature. "}, {"url": "http://medical-dictionary.thefreedictionary.com/myopia", "passage_text": "Myopia is said to be caused by an elongation of the eyeball. This means that the oblong (as opposed to normal spherical) shape of the myopic eye causes the cornea and lens to focus at a point in front of the retina. physiological myopia This is the most common type of myopia. It is believed that high myopia is due mainly to genetic factors whereas low myopia is more likely due to environmental influences. It occurs because of a failure in correlation of the refractive power of lens and cornea, and the length of the eye."}, {"url": "http://www.webmd.com/eye-health/tc/nearsightedness-myopia-topic-overview", "passage_text": "Nearsightedness (myopia) is a common cause of blurred vision. It can be mild, moderate, or severe. If you are nearsighted, objects in the distance appear blurry and out of focus. You might squint or frown when trying to see distant objects clearly. View a photo as seen through a normal and a nearsighted eye. Nearsightedness is usually a variation from normal, not a disease."}, {"url": "http://www.answers.com/Q/What_does_myopic_mean", "passage_text": "The opposite to myopic/myopia is HYPEROPIC/HYPEROPIA. Myopia is also known as short sightedness or near sightedness. Hyperopia is also known as long sightedness or far s … ightedness. A myopic eye focuses the image before it reaches the retina at the back of the eye. This is because the eye is too strong. A myopic eye will find it easier to focus on a close up object rather than a far away object. A myopic eye needs to be corrected with a minus/negative powered prescription lens (-)"}, {"url": "http://medical-dictionary.thefreedictionary.com/myopia", "passage_text": "To understand myopia it is necessary to have a basic knowledge of the main parts of the eye's focusing system: the cornea, the lens, and the retina. The cornea is a tough, transparent, dome-shaped tissue that covers the front of the eye (not to be confused with the white, opaque sclera). physiological myopia This is the most common type of myopia. It is believed that high myopia is due mainly to genetic factors whereas low myopia is more likely due to environmental influences. It occurs because of a failure in correlation of the refractive power of lens and cornea, and the length of the eye."}, {"url": "http://medical-dictionary.thefreedictionary.com/myopia", "passage_text": "a condition of nearsightedness caused by the elongation of the eyeball or by an error in refraction so that parallel rays are focused in front of the retina. Myopia can be classified as curvature myopia, index myopia, and pathologic myopia. Also called nearsightedness, short sight, shortsightedness. myopic, adj. physiological myopia This is the most common type of myopia. It is believed that high myopia is due mainly to genetic factors whereas low myopia is more likely due to environmental influences. It occurs because of a failure in correlation of the refractive power of lens and cornea, and the length of the eye."}, {"url": "http://medical-dictionary.thefreedictionary.com/myopia", "passage_text": "Refractive condition of the eye in which the images of distant objects are focused in front of the retina when the accommodation is relaxed. Thus distance vision is blurred. In myopia the point conjugate with the retina, that is the far point of the eye, is located at some finite point in front of the eye (Fig. physiological myopia This is the most common type of myopia. It is believed that high myopia is due mainly to genetic factors whereas low myopia is more likely due to environmental influences. It occurs because of a failure in correlation of the refractive power of lens and cornea, and the length of the eye."}]