[{"url": "http://articles.orlandosentinel.com/2010-03-24/travel/orl-travel-senior-travel-032410_1_rental-agencies-minimum-age-limits", "passage_text": "-- Czech Republic, Greece, Poland, and Slovakia: Some rental agencies impose a maximum age of 70. -- United Kingdom: Some rental agencies apply an extra fee for travelers age 70 or over; some rental agencies apply a maximum age limit of 69 on some car classes. Rental agencies in Ireland (Republic) nominally bar anyone over 75 from renting a car and agencies in Romania bar anyone over 70. Travelers of any age over the minimum can rent cars in Austria, Belgium, Bulgaria, Croatia, Estonia, Finland, France, Germany, Hungary, Iceland, Italy, Latvia, Luxembourg, Netherlands, Norway, Portugal, Slovenia, Spain, Sweden, or Switzerland."}, {"url": "http://traveltips.usatoday.com/enterprise-requirements-renting-car-62736.html", "passage_text": "Drivers must be at least 23 years of age to rent a vehicle in the United Kingdom and Ireland and at least 21 years old in Germany. All drivers under the age of 25 are subject to a Youthful Driver's Fee and those under 30 in the United Kingdom are restricted from renting certain vehicles. Age Requirements. The minimum age to rent an Enterprise car is 21 at most locations. Drivers under the age of 25 must pay a higher rental rate and select vehicles are unavailable to those under age 25."}, {"url": "http://www.autoeurope.com/go/travel-tips/rental-car-age-requirements/", "passage_text": "Norway rental car age requirements restrict drivers under 19 from renting a car. There is no maximum age limit, but renters between 19 and 25 years old will incur an additional fee of 125 - 160 NOK per day. Belgium car rental age restrictions can vary, with some minimums as low as 19 and others as high as 23. There are no maximum limits, but the fees for a driver under 25 in Belgium can vary, costing anywhere from €15 - €30 per day."}, {"url": "http://traveltips.usatoday.com/age-requirement-rent-car-62294.html", "passage_text": "Older Drivers. Car rental agencies in the United States do not typically impose a maximum age limit on rentals. In some countries, however, a maximum age limit is common. Age limits vary between rental agencies and from country to country, but often fall between age 75 and 80. If you are over age 70, check with the rental agency before finalizing your reservation. All other states allow rental car companies the discretion to set their own minimum age requirement, which is typically but not always 25. Most rental agencies in New York and Michigan apply graduated surcharges to younger drivers, with the heaviest fees charged to those between 18 and 21."}, {"url": "http://www.autoeurope.com/go/travel-tips/rental-car-age-requirements/", "passage_text": "Switzerland rental car age requirements will incur a fee of 15 - 20 CHF per day for drivers under 24. There are no maximum age limits, but the minimum allowed age is typically 19 and sometimes 21, depending on the supplier. Belgium car rental age restrictions can vary, with some minimums as low as 19 and others as high as 23. There are no maximum limits, but the fees for a driver under 25 in Belgium can vary, costing anywhere from €15 - €30 per day."}, {"url": "http://articles.orlandosentinel.com/2010-03-24/travel/orl-travel-senior-travel-032410_1_rental-agencies-minimum-age-limits", "passage_text": "In several countries, however, some suppliers impose maximum age limits to rentals, generally, or to rentals of some models of cars: -- Denmark: Some rental agencies impose a maximum age of 80. -- Slovenia: Some rental agencies impose a maximum age limit of 73, and renters ages 70 to 73 may face surcharges. Travelers of any age over the minimum can rent cars in Austria, Belgium, Bulgaria, Croatia, Estonia, Finland, France, Germany, Hungary, Iceland, Italy, Latvia, Luxembourg, Netherlands, Norway, Portugal, Slovenia, Spain, Sweden, or Switzerland."}, {"url": "http://www.best-car-rental-tips.com/maximum-age-to-rent-a-car.html", "passage_text": "When checking the maximum age to rent a car, you should can check company websites' location specific policies. You'll usually see links to rental conditions, local policy, terms of rental, important info or some such term during the rate quote/reservation process which should list any restrictions. Generally, car rental companies in Ireland maintain a max age of 75 to rent a car. (possible exceptions): Enterprise.com states . The minimum age is 23 years old and we do not have a maximum age limit as long as the driver has a valid driving licence .."}, {"url": "http://www.autoeurope.com/go/travel-tips/rental-car-age-requirements/", "passage_text": "18 / None. The rental car age limit in Italy is typically a minimum of 18, but some suppliers will not rent to anyone under 21. There are no maximum age limits but any drivers under 24 will usually have to pay around an additional €20 per day. Belgium car rental age restrictions can vary, with some minimums as low as 19 and others as high as 23. There are no maximum limits, but the fees for a driver under 25 in Belgium can vary, costing anywhere from €15 - €30 per day."}, {"url": "http://www.best-car-rental-tips.com/maximum-age-to-rent-a-car.html", "passage_text": "Budget-Maximum age 73 for all car groups. Dollar-Charges a surcharge of EUR 17.00 per rental for drivers over 65. Hertz-The maximum age for rentals in Cyprus is 75 years old. Thrifty-Charges a surcharge of EUR 17.00 per rental for drivers over 65. Sixt-Maximum age in Cyprus is 75. A Surcharge of EUR 5.75 per day applies for drivers between 71 and 75 years age. Alamo-No maximum age was listed, but terms stated that some locations may maintain upper age limits. Generally, car rental companies in Ireland maintain a max age of 75 to rent a car. (possible exceptions): Enterprise.com states . The minimum age is 23 years old and we do not have a maximum age limit as long as the driver has a valid driving licence .."}]