[{"url": "https://en.wikipedia.org/wiki/Lewis_acids_and_bases", "passage_text": "Lewis acid is a chemical species that reacts with a Lewis base to form a Lewis adduct. A Lewis base, then, is any species that donates a pair of electrons to a Lewis acid to form a Lewis adduct. For example, OH − and NH 3 are Lewis bases, because they can donate a lone pair of electrons. In the adduct, the Lewis acid and base share an electron pair furnished by the Lewis base. Usually the terms Lewis acid and Lewis base are defined within the context of a specific chemical reaction. For example, in the reaction of Me3B and NH3 to give Me 3 BNH 3, Me 3 B acts as a Lewis acid, and NH 3 acts as a"}, {"url": "http://chemed.chem.purdue.edu/genchem/topicreview/bp/ch11/lewis.php", "passage_text": "The Lewis acid-base theory can also be used to explain why nonmetal oxides such as CO 2 dissolve in water to form acids, such as carbonic acid H 2 CO 3. CO2(g) + H2O(l) H2CO3(aq). In the course of this reaction, the water molecule acts as an electron-pair donor, or Lewis base. A Lewis acid is therefore any substance, such as the H + ion, that can accept a pair of nonbonding electrons. In other words, a Lewis acid is an electron-pair acceptor. A Lewis base is any substance, such as the OH-ion, that can donate a pair of nonbonding electrons. A Lewis base is therefore an electron-pair donor."}, {"url": "http://chemed.chem.purdue.edu/genchem/topicreview/bp/3organic/acids.html", "passage_text": "Lewis Acid-Base Theory. In 1923, G. N. Lewis introduced a theory of acids and bases that is even more powerful than the Br nsted theory. As a result, it is important to differentiate between the terms acid and base as they have been used so far and the terms Lewis acid and Lewis base.. Lewis noted that the Br nsted theory was limited because it focused exclusively on the transfer of a proton (H +). He argued that a more general definition of acid-base reactions could be obtained by looking at what happens when an H + ion combines with an OH-ion to form water."}, {"url": "http://chemguide.co.uk/physical/acidbaseeqia/theories.html", "passage_text": "The Bronsted-Lowry Theory of acids and bases The theory An acid is a proton (hydrogen ion) donor. A base is a proton (hydrogen ion) acceptor. The relationship between the Bronsted-Lowry theory and the Arrhenius theory The Bronsted-Lowry theory doesn't go against the Arrhenius theory in any way-it just adds to it. Hydroxide ions are still bases because they accept hydrogen ions from acids and form water. An acid produces hydrogen ions in solution because it reacts with the water molecules by giving a proton to them. The Bronsted-Lowry theory says that they are acting as bases because they are combining with hydrogen ions. The reason they are combining with hydrogen ions is that they have lone pairs of electrons-which is what the Lewis theory says. The two are entirely consistent."}, {"url": "https://en.wikibooks.org/wiki/General_Chemistry/Properties_and_Theories_of_Acids_and_Bases", "passage_text": "The Arrhenius theory is simple and useful. It explains many properties and reactions of acids and bases. For instance, mixing hydrochloric acid (HCl) with sodium hydroxide (NaOH) results in a neutral solution containing table salt (NaCl). However, the Arrhenius theory is not without flaws. There are many well known bases, such as ammonia (NH 3) that do not contain the hydroxide ion. Furthermore, acid-base reactions are observed in solutions that do not contain water. To resolve these problems, there is a more advanced acid-base theory. Lewis acids and bases react to create an adduct, a compound in which the acid and base have bonded by sharing the electron pair. Lewis acid/base reactions are different from redox reactions because there is no change in oxidation state."}, {"url": "http://chemed.chem.purdue.edu/genchem/topicreview/bp/ch11/lewis.php", "passage_text": "In the Lewis theory of acid-base reactions, bases donate pairs of electrons and acids accept pairs of electrons. A Lewis acid is therefore any substance, such as the H + ion, that can accept a pair of nonbonding electrons. In other words, a Lewis acid is an electron-pair acceptor. A Lewis base is any substance, such as the OH-ion, that can donate a pair of nonbonding electrons. A Lewis base is therefore an electron-pair donor. One advantage of the Lewis theory is the way it complements the model of oxidation-reduction reacti"}, {"url": "http://www.chemteam.info/AcidBase/Intro-to-Lewis-AcidBase.html", "passage_text": "The Lewis theory of acids and bases is more general than the one sided nature of the Bronsted-Lowry theory. Keep in mind that Bronsted-Lowry, which defines an acid as a proton donor and a base as a proton acceptor, REQUIRES the presence of a solvent, specifically a protic solvent, of which water is the usual example. The Lewis definitions of acid and base do not have the constraints that the Bronsted-Lowry theory does and, as we shall see, many more reactions were seen to be acid base in nature using the Lewis definition than when using the Bronsted-Lowry definitions. II. The Acid Base Theory. The modern way to define a Lewis acid and base is a bit more concise than above: 1  Acid: an electron acceptor. 2  Base: an electron donor"}, {"url": "http://chemguide.co.uk/physical/acidbaseeqia/theories.html", "passage_text": "This page describes the Arrhenius, Bronsted-Lowry, and Lewis theories of acids and bases, and explains the relationships between them. It also explains the concept of a conjugate pair-an acid and its conjugate base, or a base and its conjugate acid. The Bronsted-Lowry theory says that they are acting as bases because they are combining with hydrogen ions. The reason they are combining with hydrogen ions is that they have lone pairs of electrons-which is what the Lewis theory says. The two are entirely consistent."}, {"url": "http://chemguide.co.uk/physical/acidbaseeqia/theories.html", "passage_text": "The theory An acid is an electron pair acceptor. A base is an electron pair donor. The relationship between the Lewis theory and the Bronsted-Lowry theory Lewis bases It is easiest to see the relationship by looking at exactly what Bronsted-Lowry bases do when they accept hydrogen ions. The Bronsted-Lowry theory says that they are acting as bases because they are combining with hydrogen ions. The reason they are combining with hydrogen ions is that they have lone pairs of electrons-which is what the Lewis theory says. The two are entirely consistent."}]