[{"url": "http://www.payscale.com/research/IN/Job=Deputy_General_Manager/Salary", "passage_text": "A Deputy General Manager earns an average salary of Rs 1,718,033 per year. X Total Pay combines base annual salary or hourly wage, bonuses, profit sharing, tips, commissions, overtime pay and other forms of cash earnings, as applicable for this job. It does not include equity (stock) compensation, cash value of retirement benefits, or the value of other non-cash benefits (e.g. healthcare)."}, {"url": "http://www.totaljobs.com/salary-checker/average-deputy-manager-salary", "passage_text": "Salary results for Deputy Manager. Here you can see the average salary for the job you entered, based on our most recent job adverts. Our salary calculator also lets you view the highest and lowest salaries recently offered for that job, and how your current salary compares. Find Deputy Manager jobs. You can search for jobs within your industry at any time. Alternatively, our browse jobs section allows you to find relevant roles and careers."}, {"url": "http://www.payscale.com/research/IN/Job=Deputy_General_Manager/Salary", "passage_text": "(India). A Deputy General Manager earns an average salary of Rs 1,718,033 per year. Most people in this job have more than five years' experience in related jobs. Pay for this job rises steadily for more experienced workers, but goes down noticeably for employees with more than 20 years' experience. The skills that increase pay for this job the most are Telecommunications, Strategic Planning, and Engineering Design. X Total Pay combines base annual salary or hourly wage, bonuses, profit sharing, tips, commissions, overtime pay and other forms of cash earnings, as applicable for this job. It does not include equity (stock) compensation, cash value of retirement benefits, or the value of other non-cash benefits (e.g. healthcare)."}, {"url": "http://www1.salary.com/Project-Engineering-Manager-salary.html", "passage_text": "Our team of Certified Compensation Professionals has analyzed survey data collected from thousands of HR departments at companies of all sizes and industries to present this range of annual salaries for people with the job title Project Engineering Manager in the United States. This chart describes the expected percentage of people who perform the job of Project Engineering Manager that make less than that salary. For example 50% of the people who perform the job of Project Engineering Manager are expected to make less than the median."}, {"url": "http://www1.salary.com/Project-Engineering-Manager-salary.html", "passage_text": "For example the median expected annual pay for a typical Project Engineering Manager in the United States is $116,766, so 50% of the people who perform the job of Project Engineering Manager in the United States are expected to make less than $116,766. Source: HR Reported data as of October 2015. 1  Salary. 2  Salary + Bonus. This chart describes the expected percentage of people who perform the job of Project Engineering Manager that make less than that salary. For example 50% of the people who perform the job of Project Engineering Manager are expected to make less than the median."}, {"url": "http://www1.salary.com/Engineering-Salaries.html", "passage_text": "Well there are a wide range of jobs in the Engineering category and their pay varies greatly. If you know the pay grade of the job you are searching for you can narrow down this list to only view Engineering jobs that pay less than $30K, $30K-$50K, $50K-$80K, $80K-$100K, or more than $100K. Related job categories: IT -- All, Construction and Installation. Browse Engineering jobs by salary range: , $30K-$50K, $50K-$80K, $80K-$100K, or. Search by: Keyword Category. Search. Jobs by Salary Ranges: Click a salary category to find jobs in your target salary range."}, {"url": "http://www.totaljobs.com/salary-checker/average-deputy-manager-salary", "passage_text": "High: The typical high-end salary you can expect for this kind of job, based on last month's job ads. Average: This is the 'median', or middle salary, from a list of last month's related job ads. Low: The typical low-range salary for this kind of job, again based on last month's job ads. Find Deputy Manager jobs. You can search for jobs within your industry at any time. Alternatively, our browse jobs section allows you to find relevant roles and careers."}, {"url": "http://www.payscale.com/research/US/Job=Project_Manager%2c_Engineering/Salary", "passage_text": "Project Manager, Engineering Salary. (United States). The national average salary for Engineering Project Managers is $85K per year; Chevron Corporation pays the most in this field, though, offering a median salary of $171K. Apple Computer, Inc, Schlumberger, and Jacobs Engineering Group Inc also offer top salaries for Engineering Project Managers. For Engineering Project Managers, Houston provides a pay rate that is 25 percent greater than the national average. Engineering Project Managers will also find cushy salaries in Los Angeles (+14 percent), Denver (+7 percent), Boston (+6 percent), and Pittsburgh (+2 percent)."}]