[{"url": "http://usgovinfo.about.com/od/socialsecurity/a/socsecapply.htm", "passage_text": "You can retire as early as age 62, but if you retire before your full retirement age, your benefits will be permanently reduced, based on your age. For example, if you retire at age 62, your benefit would be about 25 percent lower than what it would be if you waited until you reach full retirement age. To draw full retirement benefits, the following Social Security Administration age rules apply: Born in 1937 or earlier-Full retirement can be drawn at age 65. Born in 1938 - Full retirement can be drawn at age 65 years and 2 months. Born in 1939 -- Full retirement can be drawn at age 65 years and 4 months"}, {"url": "http://www.aarp.org/work/social-security/info-07-2012/when-can-i-apply-social-security-benefits.html", "passage_text": "A. You can. Social Security will accept your application for early benefits when you're 61 years 9 months. Regardless of how old you are, the agency generally recommends that you apply three months before you would like the first payment to arrive."}, {"url": "http://seniorliving.about.com/od/socialsecurity101/a/break_even_calc.htm", "passage_text": "Should you apply as soon as you are eligible and take reduced benefits for life, or wait until your full retirement age and get a bigger check each month? Or maybe you should delay your benefits for a few years after full retirement age —up to age 70—to ensure an even bigger Social Security check. By contrast, if you elect to receive Social Security benefits early, say at age 62, then you get a reduced monthly benefit for more years."}, {"url": "http://socialsecurity.findlaw.com/social-security-basics/when-should-you-start-claiming-social-security-benefits.html", "passage_text": "Between your full retirement age (see chart above), and the age of 70, your Social Security benefits will increase between 3 and 8 percent each year you delay your retirement. For example, for anyone born 1943 and later, their retirement benefits will increase by 8% for each year they delay until the age of 70. Under the Social Security laws, you can begin to receive your retirement payments once you hit the age of 62 (early retirement), at full retirement age (varies by year you were born), or at late retirement age (any age after your full retirement age)."}, {"url": "http://usgovinfo.about.com/od/socialsecurity/a/socsecapply.htm", "passage_text": "Born in 1960 or later -- Full retirement can be drawn at age 67. Remember that while you can begin drawing Social Security retirement benefits at age 62, your benefits will be 25 percent less than what they will be if you wait until your full retirement age as shown above. To draw full retirement benefits, the following Social Security Administration age rules apply: Born in 1937 or earlier-Full retirement can be drawn at age 65. Born in 1938 - Full retirement can be drawn at age 65 years and 2 months. Born in 1939 -- Full retirement can be drawn at age 65 years and 4 months"}, {"url": "http://ssa.gov/planners/retire/applying8.html", "passage_text": "1 You must be at least 61 years and 9 months old to apply for retirement benefits. 2  If you are already age 62, you may be able to start your benefits in the month you apply. 3  You should apply for benefits no more than four months before the date you want your benefits to start. If you do not live in the U.S. or one of its territories you can also-Contact the nearest U.S. Social Security office, U.S. Embassy or consulate. Reminders: 1  You must be at least 61 years and 9 months old to apply for retirement benefits."}, {"url": "http://money.usnews.com/money/retirement/articles/2013/09/09/the-most-popular-ages-to-claim-social-security", "passage_text": "Social Security benefits are reduced for workers who sign up at age 62, and the amount of the reduction has recently increased from 20 percent for people born in 1937 or earlier to 25 percent for baby boomers born between 1943 and 1954. "}, {"url": "http://www.aarp.org/work/social-security/info-07-2012/when-can-i-apply-social-security-benefits.html", "passage_text": "I hope you've thought out the consequences of applying for benefits at the earliest possible age: You'll be accepting a monthly amount that's 25 percent below what you'd get if you wait until your full retirement age, 66. This AARP Social Security Benefits calculator can help you work out the numbers. Social Security will accept your application for early benefits when you're 61 years 9 months. Regardless of how old you are, the agency generally recommends that you apply three months before you would like the first payment to arrive."}]