[{"url": "http://www.hrzone.com/hr-glossary/what-is-basic-salary", "passage_text": "Basic Salary definition. Basic salary is the amount paid to an employee before any extras are added or taken off, such as reductions because of salary sacrifice schemes or an increase due to overtime or a bonus. Allowances, such as internet for home-based workers or contributions to phone usage, would also be added to the basic salary. This compares with gross salary and net salary. Companies also use the term cost to company, which refers to the total cost to the company of employing someone."}, {"url": "http://www.citehr.com/453842-difference-between-salary-net-salary-gross-salary.html", "passage_text": "The salary consists of following parts. #Basic Salary: As the name suggests, this forms the very basis of salary. This is the core of salary, and many other components may be calculated based on this amount. It usually depends on one s grade within the company s salary structure. It is a fixed part of one s compensation structure. Many Of Us having confusion regarding Salary, Net Salary, Gross, Cost to Company they are same or different. I Hope this may help you in clearing you doubts. I shall try to cover what makes the salary? What is the difference between Salary, Net Salary, Gross Salary, Cost to Company."}, {"url": "https://en.wikipedia.org/wiki/Salary", "passage_text": "A salary is a form of periodic payment from an employer to an employee, which may be specified in an employment contract. Salary is also determined by leveling the pay rates and salary ranges established by an individual employer. Salary is also affected by the number of people available to perform the specific job in the employer's employment locale."}, {"url": "http://www.communicate.co.za/_blog/Communicate_Blog/post/Salaries_101_-_Understanding_Salary_Terminology/", "passage_text": "Your Basic Salary is the amount you earn before any additional benefits such as medical aid, pension, and allowances are added to your salary. Your basic salary is the section of your salary that is fixed every month and would not include any bonuses or 13th cheque. Cost to Company: This is a term used to calculate the total cost to the Company to employ you, in other words all the costs associated with your employment contract. Your net salary is just that, it’s the amount you take home after all your deductions. Tax: If you are a salary earner you are well aware that a certain amount of money is deducted every month for PAYE (Pay As You Earn). PAYE is levied on your basic salary and your fringe benefits."}, {"url": "http://study.com/articles/EMT_-_Basic_Salary_and_Career_Information.html", "passage_text": "EMT-Basic Salary. The median salary for EMTs and paramedics was $31,270 in May 2013, according to the U.S. Bureau of Labor Statistics (BLS). The highest 25% of workers had wages of $41,470 or more, and the lowest 25% earned $24,800 or less. "}, {"url": "https://www.linkedin.com/pulse/20140915101359-123796194-salary-gross-salary-net-salary-et-al-what-you-need-to-know", "passage_text": "“Your gross salary is the TOTAL amount of compensation that you receive from your employer. Depending on the type of job that you have, this can include any bonuses, commissions, profit sharing plans, retirement plans and overtime pay. It is not uncommon for employees to make the majority of their compensation from non-base pay” (http://www.ehow.com/info_8165672_base-gross-salary-same.html). "}, {"url": "https://en.wikipedia.org/wiki/Salary", "passage_text": "Salary is a fixed amount of money or compensation paid to an employee by an employer in return for work performed. Salary is also determined by leveling the pay rates and salary ranges established by an individual employer. Salary is also affected by the number of people available to perform the specific job in the employer's employment locale."}, {"url": "http://myarmybenefits.us.army.mil/Home/Benefit_Library/Federal_Benefits_Page/Basic_Pay.html?serv=147", "passage_text": "Benefit Fact Sheet. Summary: Basic Pay is the base salary for a Soldier on active duty and counts for part of total military income. Basic Pay is electronically distributed on the 1st and 15th of every month, similar to many civilian jobs. Basic Pay for a Soldier depends on length of service as well as rank (most enlisted Soldiers enter the Army as a private)."}]