[{"url": "http://www.ebay.com/gds/How-to-Change-the-Rear-Wheel-on-Your-Motorcycle-/10000000178722956/g.html", "passage_text": "For example, it is necessary to remove and reinstall the rear wheel of your motorcycle whenever you replace the rear wheel or rear tire. Rear axle replacement, drive chain or drive shaft replacement, and rear sprocket replacement also require you to remove the rear wheel. Change the Rear Wheel on Your Motorcycle. Changing the rear wheel on your motorcycle is relatively straightforward. Removing and reinstalling the rear wheel of your motorcycle only has a few steps. Take a few extra minutes to avoid future breakdowns and expensive repairs."}, {"url": "http://www.ebay.com/gds/How-to-Change-the-Rear-Wheel-on-Your-Motorcycle-/10000000178722956/g.html", "passage_text": "Remove the Rear Wheel. Remove the rear wheel from the swingarm assembly. If the motorcycle uses a chain drive, you may need to push the rear wheel towards the center of the motorcycle in order to remove the chain from the rear sprocket. Once the chain is free from the sprocket, remove the rear wheel. Change the Rear Wheel on Your Motorcycle. Changing the rear wheel on your motorcycle is relatively straightforward. Removing and reinstalling the rear wheel of your motorcycle only has a few steps. Take a few extra minutes to avoid future breakdowns and expensive repairs."}, {"url": "http://www.doityourself.com/stry/how-to-safely-remove-a-motorcycle-rear-wheel", "passage_text": "Follow the steps below to safely remove the rear wheel from your motorcycle. It’s not a difficult job so you should be able to get the hang of it quickly. Wear protective clothing to carry out this task. Heavy duty gloves, knee pads and even safety glasses can protect you in the event of mishaps. Step 2 - Remove Disc or Drum Brakes. To remove disc brakes, unscrew the caliper from the mount and carefully detach it from the disc. Make secure with a cable tie to avoid putting undue stress on the brake hoses. If you have drum brakes, unscrew the cabling or link that connects them to the main controls."}, {"url": "http://www.ehow.com/video_4948831_removing-rear-motorcycle-tires.html", "passage_text": "To change a rear motorcycle tire you must first remove the old wheel from the body of the bike. Watch this free video clip and learn how to do this from a motorcycle expert. Part of the Video Series: How to Pimp Motorcycles. 1  Removing Motorcycle Exhaust Systems. "}, {"url": "http://www.mademan.com/mm/how-remove-rear-wheel-harley-motorcycle.html", "passage_text": "To remove a rear wheel on a Harley motorcycle you need: 1  socket and ratchet set. 2  wrench set. 3  torque wrench. 4  rear stand. 5  rubber mallet. 6  Jack up your motorcycle. 7  Place your motorcycle onto a rear stand to get the rear end of the bike off of the ground. 8  Remove the bolts. To remove a rear wheel on a Harley motorcycle you need: 1  socket and ratchet set. 2  wrench set. 3  torque wrench. 4  rear stand. 5  rubber mallet. 6  Jack up your motorcycle. 7  Remove the bolts. 8  Remove the rear axle. 9  Remove the wheel."}, {"url": "http://diy-auto-repair.wonderhowto.com/how-to/removal-and-install-rear-motorcycle-wheel-210872/", "passage_text": "How to Removal and install a rear motorcycle wheel. Save some money by learning how to change your bike's wheels. Here is a demonstration on how to remove the rear wheel on a motorcycle. The second part of this sequence shows you how to do a chain adjustment and reinstall your rear wheel. "}, {"url": "http://www.mademan.com/mm/how-remove-rear-wheel-harley-motorcycle.html", "passage_text": "1 Jack up your motorcycle. 2  Place your motorcycle onto a rear stand to get the rear end of the bike off of the ground. 3  Remove the bolts. 4  Remove all of the bolts and nuts that hold the rear wheel on your Harley motorcycle into place. 5  Remove any additional parts that might be in the way of removing the rear wheel. To remove a rear wheel on a Harley motorcycle you need: 1  socket and ratchet set. 2  wrench set. 3  torque wrench. 4  rear stand. 5  rubber mallet. 6  Jack up your motorcycle. 7  Remove the bolts. 8  Remove the rear axle. 9  Remove the wheel."}, {"url": "http://www.youtube.com/watch?v=F4ns9u_JRJ0", "passage_text": "Part 1 of 2. Demonstration on how to remove the rear wheel on a motorcycle. 1  Autos & Vehicles. 2  Standard YouTube License"}, {"url": "http://dansmc.com/rear_wheels.htm", "passage_text": "Loosen Nut, push forward and unhook chain. Pull wheel to the rear. Some bikes have a removable block, held on with a bolt, on the rear of the swing arm. Remove the axle, push forward, pop off the chain, remove the block and then slide out the wheel to the rear. Some bikes have a pinch bolt on the rear axle. If yours doesn't have a center stand, you will have to figure out some way of holding the rear wheel off the ground. You may also have to remove mufflers and/or shocks, so you can get the wheel out. Remove the axle nut, brake rod nut and brake anchor bolt. Remove the Axle nut, axle, and then the wheel."}]