[{"url": "https://en.wikipedia.org/wiki/Travel_agency", "passage_text": "A travel agency is a private retailer or public service that provides travel and tourism related services to the public on behalf of suppliers such as airlines, car rentals, cruise lines, hotels, railways, and package tours. Travel agencies choose between two approaches. One is the traditional, multi-destination, outbound travel agency, based in the traveler's originating location; the other is the destination focused, inbound travel agency, that is based in the destination and delivers an expertise on that location."}, {"url": "https://en.wikipedia.org/wiki/Travel_agency", "passage_text": "A travel agency's main function is to act as an agent, selling travel products and services on behalf of a supplier. Consequently, unlike other retail businesses, they do not keep a stock in hand. A package holiday or a ticket is not purchased from a supplier unless a customer requests that purchase. Travel agencies choose between two approaches. One is the traditional, multi-destination, outbound travel agency, based in the traveler's originating location; the other is the destination focused, inbound travel agency, that is based in the destination and delivers an expertise on that location."}, {"url": "http://hometravelagency.com/host-agency/", "passage_text": "Home-based travel agents are not employees of their host agency, although many home-based travel agents seem to think they are and many host agencies treat them just that way. The home-based travel agent is an independent contractor, a separate business, just like the host agency. Most home-based travel agents work with at least one “host agency.” Host agencies are bonded, accredited ARC/IATAN agencies through which the home-based agent makes bookings."}, {"url": "https://en.wikipedia.org/wiki/Travel_agency", "passage_text": "A travel agent may work for a travel agency or work freelance. With many people switching to self-service internet websites, the number of available jobs as travel agents is decreasing. Travel agencies choose between two approaches. One is the traditional, multi-destination, outbound travel agency, based in the traveler's originating location; the other is the destination focused, inbound travel agency, that is based in the destination and delivers an expertise on that location."}, {"url": "https://nationalcareersservice.direct.gov.uk/advice/planning/jobprofiles/Pages/travelagent.aspx", "passage_text": "As a travel agent, you could be based in a large travel agency in a shopping centre or supermarket, or you could work for a local high street travel agent. Work activities. As a travel agent, you could be based in a large travel agency in a shopping centre or supermarket, or you could work for a local high street travel agent. For some roles you may be based in a contact centre."}, {"url": "http://www.yourdictionary.com/travel-agency", "passage_text": "LINK / CITE ADD TO WORD LIST. noun. The definition of a travel agency is a business that is designed to help customers make various types of arrangements for trips such as tickets and hotel reservations. An example of a travel agency is a business that books clients on cruises or that books hotel stays for their clients. "}, {"url": "https://en.wikipedia.org/wiki/Travel_agency", "passage_text": "The modern travel agency first appeared in the second half of the 19th century. Thomas Cook, in addition to developing the package tour, established a chain of agencies in the last quarter of the 19th century, in association with the Midland Railway. Travel agencies choose between two approaches. One is the traditional, multi-destination, outbound travel agency, based in the traveler's originating location; the other is the destination focused, inbound travel agency, that is based in the destination and delivers an expertise on that location."}, {"url": "https://nationalcareersservice.direct.gov.uk/advice/planning/jobprofiles/Pages/travelagent.aspx", "passage_text": "Travel agents book business and leisure travel for customers. As a travel agent you will sell holiday packages and give travel advice. Your role is to make travel planning easier, and to make sure your customers have the best trip possible. For this role you’ll need to be well organised and have an eye for detail. Work activities. As a travel agent, you could be based in a large travel agency in a shopping centre or supermarket, or you could work for a local high street travel agent. For some roles you may be based in a contact centre."}, {"url": "http://www.bls.gov/ooh/Sales/Travel-agents.htm", "passage_text": "Travel agents offer advice on destinations, plan trip itineraries, and make travel arrangements for clients. Travel agents sell transportation, lodging, and admission to entertainment activities to individuals and groups planning trips. They offer advice on destinations, plan trip itineraries, and make travel arrangements for clients. Travel agents also may visit destinations to get firsthand experience so that they can make recommendations to clients or colleagues. They may visit hotels, resorts, and restaurants to evaluate the comfort, cleanliness, and quality of the establishment."}]