[{"url": "http://financial-dictionary.thefreedictionary.com/Net+Income+After+Taxes", "passage_text": "See net income. Profit, which is also called net income or earnings, is the money a business has left after it pays its operating expenses, taxes, and other current bills."}, {"url": "http://www.businessdictionary.com/definition/profit-after-tax.html", "passage_text": "Definition. The net amount earned by a business after all taxation related expenses have been deducted. The profit after tax is often a better assessment of what a business is really earning and hence can use in its operations than its total revenues."}, {"url": "http://www.accountingtools.com/questions-and-answers/net-operating-profit-after-tax-definition-and-usage.html", "passage_text": "Net operating profit after tax definition and usage. Net operating profit after tax (NOPAT) is the results of a business before the impact of any financing arrangements are included. This means that NOPAT does not include the tax shelter provided by the interest expense associated with debt."}, {"url": "http://www.investopedia.com/terms/n/nopat.asp", "passage_text": "DEFINITION of 'Net Operating Profit After Tax-NOPAT'. A company's potential cash earnings if its capitalization were unleveraged (that is, if it had no debt). NOPAT is frequently used in economic value added (EVA) calculations."}, {"url": "http://www.diffen.com/difference/Income_vs_Revenue", "passage_text": "For a business, income refers to net profit i.e. what remains after expenses and taxes are subtracted from revenue. Revenue is the total amount of money the business receives from its customers for its products and services."}, {"url": "http://www.investopedia.com/terms/n/net-income-after-taxes-niat.asp", "passage_text": "While the net income after taxes calculation is one of the most solid measures of a company's performance, numerous accounting scandals in recent years have proven it to be less than 100% reliable."}, {"url": "http://www.investinganswers.com/financial-dictionary/financial-statement-analysis/net-operating-profit-after-tax-nopat-2820", "passage_text": "What it is: Net operating profit after tax (NOPAT) is a measure of profit that excludes the costs and tax benefits of debt financing. Put another way, NOPAT is earnings before interest and taxes (EBIT) adjusted for the impact of taxes."}]