[{"url": "http://leahmichelledesigns.com/2014/07/22/free-pattern-totally-triangular-scarf-2/", "passage_text": "If you enjoyed the Truly Triangular Scarf, then try your hand at this one. With one small change to the pattern, you get a longer, narrower scarf. In this pattern, the same number of stitches are cast on and bound off. The same amount of yarn is used. Remember to weigh your yarn before you begin and periodically while working the increase section."}, {"url": "http://www.favecrafts.com/Knitting/26-Free-Scarf-Knitting-Patterns", "passage_text": "Easy scarf knitting patterns for men is a great way to come up with a gift for your husband, boyfriend, son, uncle, and all the other men in your life. With these various scarf knitting patterns, you're sure to find something perfect for all the men on your list! You'll find winter scarves, cowls, wraps, and more! You can also customize these patterns if you plan on knitting a scarf for the man in your life. Adult knitting patterns are a great option if you want to skip the mall and save money."}, {"url": "http://knitting.about.com/od/scarfpatterns/", "passage_text": "Share. Knitting a scarf with a bunch of different yarns on huge needles is a quick and easy way to finish a project. Choosing yarns that are all in the same color makes for an interesting look and the perfect gift for someone when you knit them a scarf in their favorite color. Try out a new stitch pattern or technique on a scarf with one of these scarf knitting patterns."}, {"url": "http://leahmichelledesigns.com/2014/07/21/free-pattern-truly-triangular-scarf/", "passage_text": "I love using this edge stitch, especially on a garter stitch shawl or scarf. It makes a lovely neat and clean edge. To make this edge, the first stitch of every row is slipped knitwise (as if to knit) while holding the yarn at the back of the work (wyib). The last stitch of every row is purled. The Truly Triangular Scarf is a simple garter stitch sideways triangular scarf. The increase stitch used is kfb (knit into the front and back of the stitch) which is a great choice for garter stitch as it is nearly invisible."}, {"url": "http://www.allfreeknitting.com/Knit-Scarves", "passage_text": "Scarves. Free knitting patterns are great when you can use them to make knit scarves. These free knitting patterns for scarves will have you bundled up for the cold winter season. "}, {"url": "http://leahmichelledesigns.com/2014/07/22/free-pattern-totally-triangular-scarf-2/", "passage_text": "If you like a scarf with long ends to wrap around your shoulders, this is the pattern for you. I have used the same slipped stitch edge on this scarf. To make this edge, the first stitch of every row is slipped knitwise (as if to knit) while holding the yarn at the back of the work (wyib). With one small change to the pattern, you get a longer, narrower scarf. In this pattern, the same number of stitches are cast on and bound off. The same amount of yarn is used. Remember to weigh your yarn before you begin and periodically while working the increase section."}, {"url": "http://www.favecrafts.com/Knitting/26-Free-Scarf-Knitting-Patterns", "passage_text": "Patterns like the Little Boy's Hat and Scarf Set are easy to customize-kids will love picking out the colors! There are plenty of easy scarf knitting patterns that you can work on and later donate to charity as a way to give back to the community. You'll find winter scarves, cowls, wraps, and more! You can also customize these patterns if you plan on knitting a scarf for the man in your life. Adult knitting patterns are a great option if you want to skip the mall and save money."}, {"url": "http://www.favecrafts.com/Knitting/26-Free-Scarf-Knitting-Patterns", "passage_text": "Whether you're new to knitting or have been purling for years, there's no denying that knitting scarves is a fun and easy project for all. These free scarf knitting patterns are perfect for all kinds of knitters, people, and genders. You'll find winter scarves, cowls, wraps, and more! You can also customize these patterns if you plan on knitting a scarf for the man in your life. Adult knitting patterns are a great option if you want to skip the mall and save money."}, {"url": "http://www.marthastewart.com/264106/basic-scarf-pattern", "passage_text": "Since its edges do not curl, garter stitch is often used for borders. Before you begin the scarf, follow our basic knitting instructions to knit a gauge swatch in stockinette stitch using size-9 needles and Aran-weight yarn. 4 stitches and 6 rows equal 1 inch. Finished size of scarf: 8 by 60 inches. For this craft we use the abbreviations: k (knit), p (purl), sts (stitches). Work the 6 rows of the pattern stitch. Repeat rows 9 and 10 until scarf measures 56 inches from the cast-on row. End after working a row 9. Work the 6 rows of the pattern stitch. Repeat Rows 9 and 10 until the scarf is 59 inches. Knit next 8 rows. Cast off. Weave in yarn ends."}, {"url": "http://www.youtube.com/watch?v=pK6Y23991qM", "passage_text": "Facebook page: https://www.facebook.com/TheCastingOn... Chunky Lace Scarf Knitting Tutorial.This lace scarf contains a main repeat of 10 stitches and 6 rows.You will need an additional 5 stitches to balance the lace stitch fabric and to create edges to your scarf."}]