[{"url": "http://www.gcsescience.com/a9-reaction-magnesium-chlorine.htm", "passage_text": "gcsescience.com 11 gcsescience.com. The Ionic Bond formation for Magnesium Chloride. Magnesium is in group 2 of the periodic table. A magnesium atom will lose 2 electrons to form a stable 2+ ion. Chlorine is in group 7 of the periodic table. A chlorine atom will gain 1 electron to form a stable 1- ion. In this example the electrons are shown as dots and crosses. Two chlorine atoms will each gain one electron from the magnesium atom. The atoms become ions. The attraction between the oppositely charged ions forms the ionic bond between magnesium and chlorine. The formula for magnesium chloride is MgCl2."}, {"url": "http://dluetgens.com/userfiles//Lab%206.2%20emp%20formula%20magnesium%20chloride.doc", "passage_text": "Describe the ions (Include number of protons and electrons). Especially the magnesium ion so you can compare it to the magnesium atom in the reactants. Describe how magnesium chloride as a solid is different from the magnesium chloride in solution. "}, {"url": "https://en.wikipedia.org/wiki/Chloride", "passage_text": "Chloride ion is much larger than a chlorine atom, 167 and 99 pm, respectively. The ion is colorless and diamagnetic. In aqueous solution, it is highly soluble in most cases, however some chloride salts, such as silver chloride, lead(II) chloride, and mercury(I) chloride are slightly soluble in water. An example is table salt, which is sodium chloride with the chemical formula NaCl. In water, it dissociates into Na + and Cl − ions. Salts such as calcium chloride, magnesium chloride, potassium chloride have varied uses ranging from medical treatments to cement formation."}, {"url": "http://www.ancient-minerals.com/magnesium-benefits/what-is-function/", "passage_text": "In nature, magnesium can be found in many different forms, bonded with other atoms, such as: 1  Magnesium chloride, found naturally in the sea. 2  Magnesite, the insoluble rock salt also known as magnesium carbonate. 3  In plant matter, as the central element in chlorophyll. "}, {"url": "https://en.wikipedia.org/wiki/Magnesium_chloride", "passage_text": "Magnesium chloride is the name for the chemical compounds with the formulas MgCl 2 and its various hydrates MgCl 2 (H 2 O) x. These salts are typical ionic halides, being highly soluble in water. The hydrated magnesium chloride can be extracted from brine or sea water. This compound is also used in fire extinguishers: obtained by the reaction of magnesium hydroxide and hydrochloric acid (HCl) in liquid form along with water in gaseous state. Magnesium chloride also is used in several medical and topical (skin related) applications."}, {"url": "http://intro.chem.okstate.edu/1314F00/Lecture/Chapter3/Molstuff/Lec9800.html", "passage_text": "This equation reads 1 atom of magnesium combines with one molecule of chlorine to form one formula unit of the ionic compound magnesium chloride. "}, {"url": "http://www.ancient-minerals.com/magnesium-benefits/facts-info/", "passage_text": "1 Magnesium is the fourth most abundant mineral in the body. 2  Magnesium is the second most abundant positively charged intracellular (inside the cells) ion in the body. 3  Other positively charged cations found in the body include calcium, sodium, and potassium. 4  Negatively charged anions include phosphate and chloride. "}, {"url": "http://www.bbc.co.uk/schools/gcsebitesize/science/add_ocr_pre_2011/periodic_table/ionsrev1.shtml", "passage_text": "When these electrons are lost, a magnesium ion Mg 2+ is formed. A magnesium ion has the same electronic structure as a neon atom (Ne). Calcium, Ca. Calcium is also in Group 2. It has two electrons in its outer shell. When these electrons are lost, a calcium ion Ca 2+ is formed. "}, {"url": "https://answers.yahoo.com/question/index?qid=20150129115128AAeEohQ", "passage_text": "1- Magnesium has a 2- oxidation number and chlorine has a 2+ oxidation number. 2-Magnesium has a 2+ oxidation number and chlorine has a 1- oxidation number. 3-Magnesium has a 1+ oxidation number and chlorine has a 1- oxidation number. Follow. 1 answer 1. "}, {"url": "http://www.answers.com/Q/How_many_atoms_are_in_Magnesium_chloride", "passage_text": "One magnesium atom and two chlorine atoms react to form one unit of magnesium chloride. This is because the magnesium atom has an oxidation number of -2 and each chlorine atom … has an oxidation number of +1. 3 people found this useful. Answered. In Elements and Compounds. The formula unit for magnesium hydroxide is Mg(OH)2. This shows that in each formula unit there are two oxygen atoms, two hydrogen atoms, and one magnesium atom for a total of … five atoms altogether. 5"}]