[{"url": "http://www.military.com/special-operations/delta-force.html", "passage_text": "by Stew Smith. Delta Force, officially known as 1st Special Forces Operational Detachment-Delta (1st SFOD-D), is one of the U.S. special missions units primarily focused on the counter-terrorism mission. The SFOD-D curently receives its recruits from all over the Army, still pulling mainly from the Ranger Regiments and Special Forces Groups. Recruits must be in the Army, male, with at least 2.5 years of service left on enlistment, and within the E4 - E8 rank."}, {"url": "https://en.wikipedia.org/wiki/The_Delta_Force", "passage_text": "The Delta Force is a 1986 American action film starring Chuck Norris and Lee Marvin (in his final film) as leaders of an elite squad of Special Forces troops based on the real life U.S. Army Delta Force unit. "}, {"url": "http://science.howstuffworks.com/delta-force1.htm", "passage_text": "Delta Force is separated into three combat squadrons -- A, B and C -- along with a support squadron, signal squadron, aviation platoon and a funny platoon -- the intelligence-gathering outfit of the Delta Force, rumored to be the only special operations platoon to include women. The Delta Force is one of two military outfits in the United States charged with counterterrorist operations. Like the other, the Navy 's Special Warfare Development Group (DEVGRU), Delta Force can deploy at a moment's notice."}, {"url": "http://www.armyenlist.com/special-missions/delta-force/", "passage_text": "Delta Force. The 1st Special Forces Operational Detachment-Delta (SFOD-D) is one of two units in the United States Armed Forces assigned primarily to combat terrorism. The other is the Navy’s ‘Dev Group.’ Delta members are experts at counterinsurgency, small unit tactics, and various infiltration techniques. Unofficially, Delta Force is considered one of the U.S. military’s elite special operations units, its members drawn from all branches. Based at Fort Bragg, North Carolina, its formal name is 1st Special Forces Operational Detachment – Delta."}, {"url": "https://answers.yahoo.com/question/index?qid=20090211223025AAWOP4G", "passage_text": "Delta Force is a part of the American Special Forces chain. It is a branch were members are in a self-contained unit. This unit is highly secretive and classified. They are officially an Anti-terroist unit however black-ops would be more correct. Rating Newest Oldest. Best Answer: here is a link http://www.army.com/enlist/delta-force.h... and here is a short explanation: They are black ops and little to nothing is known by the public about what they do."}, {"url": "https://en.wikipedia.org/wiki/Delta_Force", "passage_text": "The Delta Force (1st Special Forces Operational Detachment-Delta), is a U.S. Army unit used for hostage rescue and counterterrorism, as well as direct action and reconnaissance against high value targets. The unit is under the organization of the US Army Special Operations Command (USASOC) but is controlled by the Joint Special Operations Command (JSOC). Command of 1st SFOD-D is a Colonel's billet."}, {"url": "https://en.wikipedia.org/wiki/Delta_Force", "passage_text": "Delta Force was formed after numerous, well-publicized terrorist incidents in the 1970s. These incidents led the U.S. government to develop a full-time counter-terrorism unit. Key military and government figures had already been briefed on a model for this type of unit in the early 1960s. The unit is under the organization of the US Army Special Operations Command (USASOC) but is controlled by the Joint Special Operations Command (JSOC). Command of 1st SFOD-D is a Colonel's billet."}, {"url": "http://callofduty.wikia.com/wiki/Delta_Force", "passage_text": "We can guarantee you a medal, a body bag, or both. . — Delta. The 1st Special Forces Operational Detachment-Delta, also known as Delta Force, Delta or Delta Team, is the U.S. Army's elite counter-terrorism/special operations unit. "}, {"url": "http://www.wikihow.com/Join-Delta-Force", "passage_text": "Three Parts: Preliminary Requirements SFQC Training Standing Out. The 1st Special Forces Operational Detachment-Delta (SFOD-D) is commonly referred to as Delta Force, America's frontline in counter-terrorism defense. To join Delta Force, you do not need to be an experienced Special Forces operator. All military members that meet the pre-requisites are send an information letter and invited to attend a briefing. Members of Delta Force are recruited from all branches and specialties of the Military."}, {"url": "http://science.howstuffworks.com/delta-force.htm", "passage_text": "Delta Force is often referred to as Special Forces Operational Detachment-Delta. It's also known as the Combat Applications Group (CAG). While it often draws its ranks from the Army Special Forces (the Army Green Berets) and shares Fort Bragg, N.C. , headquarters with them, it isn't an Army Special Forces detachment. A Delta Force operator prepares for a HALO (High Altitude Low Opening) Exercise. Photo Greg Matheison/Mai/ Time LifePictures/ Getty Images. Consider a special operations force that's trained to the highest level in the United States military."}]