[{"url": "http://www.mayoclinic.org/diseases-conditions/keratitis/basics/causes/CON-20035288", "passage_text": "1 If an object scratches the surface of one of your corneas or penetrates a cornea, keratitis without an infection may result. 2  In addition, an injury may allow bacteria or fungi to gain access to the cornea through the damaged surface, causing infectious keratitis."}, {"url": "http://eyewiki.aao.org/Fungal_Keratitis", "passage_text": "Fungal keratitis or keratomycosis refers to an infective process of the cornea caused by any of the multiple pathologic fungi capable of invading the ocular surface."}, {"url": "http://www.cdc.gov/contactlenses/fungal-keratitis.html", "passage_text": "Microscopic image of Fusarium, a fungus that causes eye infections. Fungal keratitis is an infection of the cornea (the clear dome covering the colored part of the eye) that is caused by a fungus. Some fungi that have been known to commonly cause fungal keratitis include 1  : Fusarium species. 2  Aspergillus species."}, {"url": "http://emedicine.medscape.com/article/1194167-overview", "passage_text": "The trauma that accompanies contact lens wear is miniscule; contact lenses are not a common risk factor of fungal keratitis. Candida is the principal cause of keratitis associated with therapeutic contact lenses, and filamentous fungi are associated with refractive contact lens wear."}, {"url": "http://misc.medscape.com/pi/android/medscapeapp/html/A1194167-business.html", "passage_text": "The term fungal keratitis refers to a corneal infection caused by fungi. One type of fungus that can infect the cornea is Fusarium. When Fusarium infects the cornea, the eye disease is referred to as Fusarium keratitis."}, {"url": "http://www.mayoclinic.org/diseases-conditions/keratitis/basics/causes/CON-20035288", "passage_text": "Causes of keratitis include: 1  Injury. 2  If an object scratches the surface of one of your corneas or penetrates a cornea, keratitis without an infection may result. 3  In addition, an injury may allow bacteria or fungi to gain access to the cornea through the damaged surface, causing infectious keratitis."}, {"url": "http://emedicine.medscape.com/article/1194167-overview", "passage_text": "Fungal corneal ulcer, with excessive vascularization. Keratitis is a general term meaning any inflammation of the cornea. The term fungal keratitis refers to a corneal infection caused by fungi. One type of fungus that can infect the cornea is Fusarium. When Fusarium infects the cornea, the eye disease is referred to as Fusarium keratitis."}]