[{"url": "http://www.usnews.com/education/blogs/medical-school-admissions-doctor/2015/04/21/weigh-medical-school-carefully-as-an-older-applicant", "passage_text": "Identifying the right school is important. Carefully examine the medical school’s prospectus for the average age of applicants. If it's higher than the AAMC mean age, you can conclude that the​ school has some older students."}, {"url": "http://www.studentdoc.com/phpBB2/viewtopic.php?t=10838", "passage_text": "The average age of my class was 24 as well. Most students were 22 and 23, but that was set off by the non-traditionals in the class who were in their 30s. Many take a year off for whatever reason, some do the 5 yr plan, but there are about a third who just went straight through college to med school."}, {"url": "http://talk.collegeconfidential.com/pre-med-topics/836239-average-age-accepted-into-med-school.html", "passage_text": "The average age is probably in the 22-23 range, only at a few select med schools will the average age be 24 (UCSF comes to mind). The point is that a sizable chunk of your med school class will have gone straight from college to med school and a sizable chunk will have taken a year or more off."}, {"url": "http://www.nontraditionalmedicalstudent.com/medwhere.html", "passage_text": "Where to Apply. Applying to medical school is a highly competitive process, where the demand is much greater than the number of available seats in U.S. schools. The odds are even higher for nontraditional students. In 1998-1999, the overall acceptance rate was about 42%."}, {"url": "http://www.usnews.com/education/blogs/medical-school-admissions-doctor/2015/04/21/weigh-medical-school-carefully-as-an-older-applicant", "passage_text": "The mean age of students entering medical school is 24 years, according to the Association of American Medical Colleges. The data also show that matriculants over the age of 31 comprise less than 4 percent of new students. Despite daunting statistics, entering medical school at an older age is achievable."}, {"url": "http://talk.collegeconfidential.com/pre-med-topics/836239-average-age-accepted-into-med-school.html", "passage_text": "If the average age accepted to med school is 24-25, aren't those students who are in college applying to med school..well..a bit screwed? We'd be 22 once we graduate from college, and then we'd start at 23."}, {"url": "http://www.usnews.com/education/blogs/medical-school-admissions-doctor/2012/01/09/what-to-consider-when-applying-to-medical-school-with-a-low-gpa", "passage_text": "1. Time off: The average age of entering medical students is now 24, with a considerable number of students applying later. Not only do medical schools appreciate mature applicants who learned from their mistakes, but if you take time off you will have more time to prepare a more competitive application."}, {"url": "http://www.usnews.com/education/blogs/medical-school-admissions-doctor/2015/04/21/weigh-medical-school-carefully-as-an-older-applicant", "passage_text": "First, weigh the cost of medical school. An AAMC fact card shows that the average medical school graduate owes more than $176,000, equaling a repayment of $328,000, assuming a three-year residency and standard 10-year payoff. Repayment, if extended, could cost upward of $400,000 or more, according to the AAMC example."}]