[{"url": "http://www.allergyuk.org/what-is-an-allergy/what-is-an-allergy", "passage_text": "An allergy is the response of the body's immune system to normally harmless substances, such as pollens, foods, and house dust mite. Whilst in most people these substances (allergens) pose no problem, in allergic individuals their immune system identifies them as a’ threat’ and produces an inappropriate response."}, {"url": "https://en.wikipedia.org/wiki/Allergen", "passage_text": "Allergens can be found in a variety of sources, such as dust mite excretion, pollen, pet dander or even royal jelly. Food allergies are not as common as food sensitivity, but some foods such as peanuts (a legume), nuts, seafood and shellfish are the cause of serious allergies in many people."}, {"url": "http://www.medicalnewstoday.com/articles/264419.php", "passage_text": "People with allergies blame the allergen for their symptoms-a friend's pet, pollen or dust mites. However, the allergens are not harmful. The problem is not the allergen but the allergic person's immune system which mistakes harmless substances for harmful ones."}, {"url": "http://www.webmd.com/allergies/default.htm", "passage_text": "Allergies are an abnormal response of the immune system. People who have allergies have an immune system that reacts to a usually harmless substance in the environment. This substance (pollen, mold, and animal dander, for example) is called an allergen."}, {"url": "https://en.wikipedia.org/wiki/Allergen", "passage_text": "An allergen is a type of antigen that produces an abnormally vigorous immune response in which the immune system fights off a perceived threat that would otherwise be harmless to the body. Such reactions are called allergies."}, {"url": "https://www.nlm.nih.gov/medlineplus/ency/article/000812.htm", "passage_text": "It also reacts to foreign substances called allergens. These are usually harmless and in most people do not cause a problem. In a person with allergies, the immune response is oversensitive. When it recognizes an allergen, the immune system launches a response."}, {"url": "http://www.aafa.org/display.cfm?id=9&cont=79", "passage_text": "The substances that cause allergic disease in people are known as allergens. “Antigens,” or protein particles like pollen, food or dander enter our bodies through a variety of ways. If the antigen causes an allergic reaction, that particle is considered an “allergen” – and antigen that triggers an allergic reaction."}, {"url": "https://en.wikipedia.org/wiki/Allergen", "passage_text": "An allergic reaction can be caused by any form of direct contact with the allergen—consuming food or drink one is sensitive to (ingestion), breathing in pollen, perfume or pet dander (inhalation), or brushing a body part against an allergy-causing plant (direct contact)."}, {"url": "http://www.medicalnewstoday.com/articles/264419.php", "passage_text": "Allergies are hypersensitive immune responses to substances that either enter or come in contact with the body, such as pet dander, pollen or bee venom. A substance that causes an allergic reaction is called an allergen."}]