[{"url": "http://my.clevelandclinic.org/services/orthopaedics-rheumatology/diseases-conditions/hic-carpal-tunnel-syndrome", "passage_text": "Carpal tunnel syndrome is a common condition that causes pain, numbness, and weakness in the hands and wrist. It occurs when there is increased pressure on a nerve called the median nerve. This nerve provides sensation to the thumb, index and middle fingers, and to half of the ring finger. The carpal tunnel is a narrow canal in the wrist. The bottom and sides of the tunnel are formed by a semi-circle of bones called carpal bones. A strong tissue, called a ligament, forms the top of the tunnel. The median nerve and tendons pass through this narrow space."}, {"url": "https://www.healthtap.com/topics/could-carpal-tunnel-syndrome-come-back-after-surgery", "passage_text": "Yes: Unfortunately carpal tunnel syndrome (cts) may recur in a small population of patients. This is best assessed by your md using a physical exam and a emg/ncv (needle study of your nerve /muscles) exam. The good news is that most patients do well with open carpal tunnel release surgery in the case of recurrence. Entrapment of the median nerve at the wrist is how we describe carpal tunnel. There are 8 carpal bones, but the hamate and pisiform form the ulnar side. The trapezium and scaphoid for the radial side. Flex the 3rd digit and look at the palmar hand side."}, {"url": "http://umm.edu/health/medical/reports/articles/carpal-tunnel-syndrome", "passage_text": "1 Symptoms of carpal tunnel syndrome usually progress gradually over weeks and months, or sometimes years. 2  Anyone with recurrent or persistent pain, numbness and tingling, or weakness of the hand should consult a doctor for an evaluation. 1 In general, carpal tunnel syndrome develops when the tissues around the median nerve of the hand swell and press on the nerve. 2  Early in the disorder, the process is reversible. 3  Over time, however, the insulation on the nerves may wear away, and permanent nerve damage may develop."}, {"url": "http://www.webmd.com/pain-management/carpal-tunnel/open-carpal-tunnel-surgery-for-carpal-tunnel-syndrome", "passage_text": "During open carpal tunnel release surgery, the transverse carpal ligament is cut, which releases pressure on the median nerve and relieves the symptoms of carpal tunnel syndrome. An incision is made at the base of the palm of the hand. This allows the doctor to see the transverse carpal ligament. "}, {"url": "https://answers.yahoo.com/question/index?qid=20090204133428AAIHgL6", "passage_text": "Yes it is possible for carpal tunnel to return after surgery. And as the Orthopdeic surgeon said you may need another surgery to fix it. Source(s): My sister had carpal tunnel surgery done years ago and now it has returned. "}, {"url": "http://orthoinfo.aaos.org/topic.cfm?topic=A00005", "passage_text": "The carpal tunnel is a narrow, tunnel-like structure in the wrist. The bottom and sides of this tunnel are formed by wrist (carpal) bones. The top of the tunnel is covered by a strong band of connective tissue called the transverse carpal ligament. The most common symptoms of carpal tunnel syndrome include: 1  Numbness, tingling, and pain in the hand. 2  An electric shock-like feeling mostly in the thumb, index, and long fingers. 3  Strange sensations and pain traveling up the arm toward the shoulder."}, {"url": "http://www.nhs.uk/Conditions/Carpal-tunnel-syndrome/Pages/Treatment.aspx", "passage_text": "During surgery the roof of the carpal tunnel, known as the carpal ligament, is cut to reduce pressure on the median nerve in the wrist. A local anaesthetic is used to numb your hand and wrist, but you will remain awake throughout the operation. After surgery. Following carpal tunnel release surgery, your hand will remain in a bandage for a couple of days and you may need to wear a sling. You should keep your hand raised for 48 hours to help reduce any swelling and stiffness in your fingers."}, {"url": "http://orthoinfo.aaos.org/topic.cfm?topic=A00005", "passage_text": "Carpal tunnel syndrome is caused by pressure on the median nerve traveling through the carpal tunnel. Many things contribute to the development of carpal tunnel syndrome: 1  Heredity is the most important factor-carpal tunnels are smaller in some people, and this trait can run in families. 2  Hand use over time can play a role. 3  Hormonal changes related to pregnancy can play a role. The most common symptoms of carpal tunnel syndrome include: 1  Numbness, tingling, and pain in the hand. 2  An electric shock-like feeling mostly in the thumb, index, and long fingers. 3  Strange sensations and pain traveling up the arm toward the shoulder."}, {"url": "http://umm.edu/health/medical/reports/articles/carpal-tunnel-syndrome", "passage_text": "Introduction. Carpal tunnel syndrome (CTS) is a disorder that causes pain and weakness in the hand and wrist. CTS develops from problems in a nerve in the wrist -- not the muscles, as some people believe. The symptoms of CTS can range from mild to incapacitating. 1 In general, carpal tunnel syndrome develops when the tissues around the median nerve of the hand swell and press on the nerve. 2  Early in the disorder, the process is reversible. 3  Over time, however, the insulation on the nerves may wear away, and permanent nerve damage may develop."}]