[{"url": "http://connect.microsoft.com/SQLServer/feedbackdetail/view/512142/ssis-multicast-conditional-split-derived-column-problem", "passage_text": "An SSIS package with a multicast followed by a conditional split followed by a derived column task appears to clear data from the pipeline."}, {"url": "https://msdn.microsoft.com/en-us/library/ms137701.aspx", "passage_text": "This transformation is similar to the Conditional Split transformation. Both transformations direct an input to multiple outputs. The difference between the two is that the Multicast transformation directs every row to every output, and the Conditional Split directs a row to a single output. For more information, see Conditional Split Transformation. You configure the Multicast transformation by adding outputs."}, {"url": "https://www.mssqltips.com/sqlservertip/2047/ssis-multicast-transformation-vs-conditional-split-transformation/", "passage_text": "Conditional split also provides a default output in the case that the incoming row does not match any of the defined conditions, the row goes to the default output. This default output is normally used to move erroneous rows to a separate table."}, {"url": "https://technet.microsoft.com/en-us/library/ms137701(v=sql.110).aspx", "passage_text": "The difference between the two is that the Multicast transformation directs every row to every output, and the Conditional Split directs a row to a single output. For more information, see Conditional Split Transformation. You configure the Multicast transformation by adding outputs."}, {"url": "http://www.techbrothersit.com/2014/09/ssis-what-is-difference-between.html", "passage_text": "What is the difference between Multicast and Conditional Split Transformation is very common question asked to an SSIS developer. Multicast Transformation is used to create multiple outputs from single input. We often has the situation were we need to load the same data to multiple destinations. Multicast Transformation is the transformation that take single input of data and create multiple copies of data for us to use."}, {"url": "https://technet.microsoft.com/en-us/library/ms137701(v=sql.110).aspx", "passage_text": "Both transformations direct an input to multiple outputs. The difference between the two is that the Multicast transformation directs every row to every output, and the Conditional Split directs a row to a single output. For more information, see Conditional Split Transformation. You configure the Multicast transformation by adding outputs."}]