[{"url": "http://www.medicalnewstoday.com/articles/249182.php", "passage_text": "Pus is a sign of infection. This brings good and bad news: 1  Good news-it means that the body's immune system is fighting the infection. 2  Bad news-it means that there is a post-surgical complication-an"}, {"url": "http://www.healthgrades.com/symptoms/pus", "passage_text": "Pus is a thick, whitish to yellowish material composed primarily of dead cells that generally forms as a by-product of bacterial infections. The inflammatory cells that participate in the body’s immune response at the site of an infection eventually degrade and die, creating the substance known as pus."}, {"url": "http://www.healthgrades.com/symptoms/pus", "passage_text": "An infection that leads to the production of pus is called a purulent infection. When pus forms within enclosed spaces in the tissues, it causes abscesses. When it forms on the skin surface, it causes lumps known as pustules or pimples. Pus can also form when infections develop in internal organs, such as the bones, brain, lungs, and gastrointestinal tract."}, {"url": "http://www.wisegeek.org/what-causes-pus.htm", "passage_text": "Pus is a viscous substance that is a part of the body’s natural immune response system. It is most often whitish-yellow in color, although it may also be greenish, brownish, reddish, or even blue. Pus often has a somewhat necrotic smell, and is often the sign of an infection when found in a wound. When the body detects some sort of foreign infection, it immediately begins a response to neutralize the invader and limit damage to the system."}, {"url": "https://www.sharecare.com/health/acne-skin-pimples/why-does-pus-form-in-pimple", "passage_text": "Pus in a pimple, formed of oil, dead cells, and bacteria, is a result a local infection and the immune system’s response. Watch the animation to learn more about pimples."}, {"url": "http://www.medicalnewstoday.com/articles/249182.php", "passage_text": "Pus is a protein-rich fluid called liquor puris, usually whitish-yellow, yellow, or yellow brown in color. Pus consists of a buildup of dead leukocytes (white blood cells) from the body's immune system in response to infection. It accumulates at the site of inflammation."}]