[{"url": "https://www.wikipedia.org/search-redirect.php?family=wikipedia&search=Shawshank+Redemption&language=en&go=++%E2%86%92++&go=Go", "passage_text": "Adapted from the Stephen King novella Rita Hayworth and Shawshank Redemption, the film tells the story of Andy Dufresne, a banker who is sentenced to life in Shawshank State Prison for the murder of his wife and her lover despite his claims of innocence."}, {"url": "http://www.rogerebert.com/reviews/great-movie-the-shawshank-redemption-1994", "passage_text": "It is a strange comment to make about a film set inside a prison, but The Shawshank Redemption creates a warm hold on our feelings because it makes us a member of a family. Many movies offer us vicarious experiences and quick, superficial emotions. Shawshank slows down and looks."}, {"url": "http://www.filmsite.org/shaw.html", "passage_text": "The Shawshank Redemption (1994) is an impressive, engrossing piece of film-making from director/screenwriter Frank Darabont who adapted horror master Stephen King's 1982 novella Rita Hayworth and Shawshank Redemption (first published in Different Seasons) for his first feature film."}, {"url": "https://www.wikipedia.org/search-redirect.php?family=wikipedia&search=Shawshank+Redemption&language=en&go=++%E2%86%92++&go=Go", "passage_text": "The Shawshank Redemption is a 1994 American drama film written and directed by Frank Darabont and starring Tim Robbins and Morgan Freeman."}, {"url": "http://www.npr.org/2011/08/04/138986482/on-location-mansfield-ohios-shawshank-industry", "passage_text": "The Ohio State Reformatory, in Mansfield, Ohio, where the 1994 film The Shawshank Redemption was shot. The buildings, which once formed the perimeter of the Reformatory — and which can be seen in the film — have been torn down, but the Reformatory and its massive east and west cellblocks remain."}, {"url": "http://www.youtube.com/watch?v=129Bp2ma9OM", "passage_text": "The Shawshank Redemption is a 1994 American drama film written and directed by Frank Darabont, loosely based on the Stephen King novella, Rita Hayworth and Shawshank Redemption. The film stars Tim Robbins as Andrew Andy Dufresne and Morgan Freeman as Ellis Boyd Red Redding."}, {"url": "http://www.npr.org/2011/08/04/138986482/on-location-mansfield-ohios-shawshank-industry", "passage_text": "The 1994 prison drama The Shawshank Redemption is a Hollywood rarity, in that it wasn't shot in Hollywood. The filmmakers didn't use New York or Toronto either. Instead, Shawshank was filmed almost entirely on location, in and around the Rust Belt city of Mansfield, Ohio, about halfway between Columbus and Cleveland."}, {"url": "http://www.movie-locations.com/movies/s/shawshank.html", "passage_text": "The Shawshank Redemption filming location: stickers identify locations on the Shawshank Trail: Shawshank Trail, Mansfield, Ohio. Mansfield Tourism has laid out a helpful Shawshank Trail if you want to explore the film’s other locations in Mansfield and the surrounding area. Stickers identify the key locations."}]