[{"url": "http://www.thefreedictionary.com/flag", "passage_text": "flag 1. 1. a typically rectangular piece of cloth marked with distinctive colors or designs and used as a symbol, as of a nation or organization, or as a means of signaling. 2. the tail of a deer or of a setter dog. 3. a tab or tag attached, as to a page, to attract attention. A piece of cloth, usually rectangular, of distinctive color and design, used as a symbol, standard, signal, or emblem. 2. National or other allegiance, as symbolized by a flag: ships of the same flag. 3. A ship carrying the flag of an admiral; a flagship."}, {"url": "http://www.investopedia.com/terms/f/flag.asp", "passage_text": "DEFINITION of 'Flag'. A technical charting pattern that looks like a flag with a mast on either side. Flags result from price fluctuations within a narrow range and mark a consolidation before the previous move resumes. "}, {"url": "http://www.thefreedictionary.com/What+is+a+Flag", "passage_text": "flag 1. n. 1. A piece of cloth, usually rectangular, of distinctive color and design, used as a symbol, standard, signal, or emblem. 2. National or other allegiance, as symbolized by a flag: ships of the same flag. 3. A ship carrying the flag of an admiral; a flagship. 4. A marking device, such as a gummed strip of paper, attached to an object to attract attention or ease identification; a tab. 5."}, {"url": "http://www.thefreedictionary.com/What+is+a+Flag", "passage_text": "flag 1. 1. a typically rectangular piece of cloth marked with distinctive colors or designs and used as a symbol, as of a nation or organization, or as a means of signaling. 2. the tail of a deer or of a setter dog. 3. a tab or tag attached, as to a page, to attract attention. 2. National or other allegiance, as symbolized by a flag: ships of the same flag. 3. A ship carrying the flag of an admiral; a flagship. 4. A marking device, such as a gummed strip of paper, attached to an object to attract attention or ease identification; a tab. 5."}, {"url": "http://www.webopedia.com/TERM/F/flag.html", "passage_text": "A flag is like a switch that can be either on or off. The flag is said to be set when it is turned on. (2) A special mark indicating that a piece of data is unusual. For example, a record might contain an error flag to indicate that the record consists of unusual, probably incorrect, data. "}, {"url": "http://www.thefreedictionary.com/flag", "passage_text": "flag 1. n. 1. A piece of cloth, usually rectangular, of distinctive color and design, used as a symbol, standard, signal, or emblem. 2. National or other allegiance, as symbolized by a flag: ships of the same flag. 3. A ship carrying the flag of an admiral; a flagship."}, {"url": "https://en.wikipedia.org/wiki/Flag", "passage_text": "Due to the use of flags by military units, flag is also used as the name of some military units. A flag (Arabic: لواء) is equivalent to a brigade in Arab countries, and in Spain, a flag (Spanish: bandera) is a battalion-equivalent in the Spanish Legion. 1 The Soviet flag, with its golden symbols of the hammer and sickle on a red field, was an inspiration to flags of other communist states, such as East Germany, People's Republic of China, Vietnam, Angola, Afghanistan (1978–1980) and Mozambique."}, {"url": "http://legal-dictionary.thefreedictionary.com/What+is+a+Flag", "passage_text": "The official banner of a state or nation, often decorated with emblems or images that symbolize that state or nation. On the U.S. flag, 13 horizontal stripes (in red and white) represent the original 13 colonies. The union is represented by 50 white stars, for the 50 states, arrayed on a field of blue. The U.S. flag is sometimes called the Stars and Stripes, Old Glory, or the Red, White, and Blue."}, {"url": "https://en.wikipedia.org/wiki/National_flag", "passage_text": "A national flag is a flag that symbolises a country. The flag is flown by the government, but usually can also be flown by citizens of the country. Both public and private buildings such as schools and courthouses may fly the national flag. In some countries, the national flags are only flown from non-military buildings on certain flag days."}, {"url": "http://whatis.techtarget.com/definition/flag", "passage_text": "Part of the Programming glossary: In programming, a flag is a predefined bit or bit sequence that holds a binary value. Typically, a program uses a flag to remember something or to leave a sign for another program. For example, in a message being exchanged by two programs, a three-bit flag's field or data area might be set to one of three configurations:"}]