[{"url": "http://www.thebeatles.com/song/while-my-guitar-gently-weeps", "passage_text": "Still my guitar gently weeps. . While My Guitar Gently Weeps  is a song written by George Harrison, first recorded by the Beatles in 1968 for their eponymous double album (also known as The White Album). The song features lead guitar by Eric Clapton, although he was not formally credited on the album."}, {"url": "http://beatles.wikia.com/wiki/While_My_Guitar_Gently_Weeps", "passage_text": "While My Guitar Gently Weeps is a song written and sung by George Harrison. It was included on The Beatles album, also known as The White Album. This song has appeared on Rolling Stone's Top 500 Songs List at #135, and #7 on Rolling Stone's Top 100 Greatest Guitar Songs."}, {"url": "http://www.beatlesbible.com/songs/while-my-guitar-gently-weeps/", "passage_text": "Anthology 3. Love. George Harrison's most celebrated song on the White Album, While My Guitar Gently Weeps was inspired by the I Ching, and featured his friend Eric Clapton on lead guitar. Harrison began writing the music for the song in India, although the lyrics were mostly completed upon his return to England."}, {"url": "https://en.wikipedia.org/wiki/While_My_Guitar_Gently_Weeps", "passage_text": ". While My Guitar Gently Weeps  is a song written by George Harrison, first recorded by the Beatles in 1968 for their eponymous double album (also known as the White Album). The song features lead guitar by Eric Clapton, although he was not formally credited on the album."}, {"url": "http://www.last.fm/music/The+Beatles/_/While+My+Guitar+Gently+Weeps", "passage_text": "read more. While My Guitar Gently Weeps written by George Harrison for The Beatles on their double album The Beatles (also known as The White Album)."}, {"url": "http://www.beatlesbible.com/songs/while-my-guitar-gently-weeps/", "passage_text": "George Harrison's most celebrated song on the White Album, While My Guitar Gently Weeps was inspired by the I Ching, and featured his friend Eric Clapton on lead guitar. Harrison began writing the music for the song in India, although the lyrics were mostly completed upon his return to England."}]