[{"url": "https://in.answers.yahoo.com/question/index?qid=20080509025015AAELYAU", "passage_text": "Best Answer: Beer is healthier overall than fruit juice, milk, water, and of course soda. Here is some evidence: First off, drinking every day is fine, in moderation. I drink at least 2 beers every day. I love the taste, and it's good for me. Wine is good. Some hard spirits are good."}, {"url": "http://www.differencebetween.net/object/comparisons-of-food-items/difference-between-beer-and-whiskey/", "passage_text": "The major differences between beer and whiskey are the percentage of alcohol, price, color, taste and appearance. There is also a difference in their bottles, corks and labels. Eleven ounces of beer contains five percent alcohol, compared to forty milliliters of whiskey that contains forty percent alcohol. Whiskey, when compared to beer, is dangerous to one’s health and can cause heart conditions, whereas according to some doctors beer has a heart protecting compound in it, called flavonoids."}, {"url": "http://www.theluxuryspot.com/10-health-benefits-of-whiskey/", "passage_text": "Alcohol is alcohol (be it from beer, wine or whiskey), and can cause your blood glucose level to drop (or rise). If you’re taking meds that lower your blood sugar, adding alcohol to the mix (regardless of source) can cause hypoglycemia."}, {"url": "https://in.answers.yahoo.com/question/index?qid=20080117031901AAS0DUx", "passage_text": "(Red wine is best for the antioxidant benefit) Beer can lots of calories and carbohydrates, but much less than a whiskey and pop. Whiskey has a high alcohol content, thus being harder on the liver. Whiskey, which is usually mixed with pop, will be high in calories and also sugar."}, {"url": "http://icohol.com/health-benefits/", "passage_text": "Whisky, Red Wine, Beer and Health Benefits. It’s true that alcohol, when consumed in excess, is bad for you and can cause a massive range of health and social problems, from cirrhosis of the liver to families breaking up among other things."}, {"url": "http://icohol.com/health-benefits/", "passage_text": "However, when alcohol is enjoyed responsibly, in moderation, it can actually benefit your health. Here’s a look at some of the surprising ways whisky, red wine, and beer can make you a healthier person. Whisky."}]