[{"url": "http://www.answers.com/Q/What_is_the_antonym_for_embrace", "passage_text": "Other examples: Small is an antonym of big The antonym of smart would be unintelligent. Walk can be an antonym of run Happy is an antonym of sad (or possibly angry) Catch is an antonym of throw Black can be an antonym for white Antonyms are words that have opposite (or nearly opposite)  meanings. Not all antonyms will be opposites in every context or  use."}, {"url": "http://www.synonyms.net/antonyms/embrace", "passage_text": "To caress is less than to embrace; more dignified and less familiar than to fondle. A visitor caresses a friend's child; a mother fondles her babe. Fondling is always by touch; caressing may be also by words, or other tender and pleasing attentions."}, {"url": "http://www.thefreedictionary.com/embrace", "passage_text": "1. (also intr) (of a person) to take or clasp (another person) in the arms, or (of two people) to clasp each other, as in affection, greeting, etc; hug. 2. to accept (an opportunity, challenge, etc) willingly or eagerly. 3. to take up (a new idea, faith, etc); adopt: to embrace Judaism."}, {"url": "http://www.thefreedictionary.com/embrace", "passage_text": "1. embrace-include in scope; include as part of something broader; have as one's sphere or territory; This group encompasses a wide range of people from different backgrounds; this should cover everyone in the group."}, {"url": "http://www.audioenglish.org/dictionary/embrace.htm", "passage_text": "The verb EMBRACE has 3 senses: 1. include in scope; include as part of something broader; have as one's sphere or territory. 2. squeeze (someone) tightly in your arms, usually with fondness. 3. take up the cause, ideology, practice, method, of someone and use it as one's own."}, {"url": "http://www.einfopedia.com/antonyms-of-embrace.php", "passage_text": "Embrace. Antonym: Reject. Meaning: To clasp or hold close with the arms, usually as an expression of affection. Sentence: We allowed the warm water to embrace us."}, {"url": "http://www.answers.com/Q/What_is_the_antonym_for_embrace", "passage_text": "An antonym of a particular word is one that has the opposite meaning. An antonym is usually an adjective or adverb, but can include verb forms such as coming / going, leadi … ng/ following, and heeding / ignoring."}, {"url": "http://www.audioenglish.org/dictionary/embrace.htm", "passage_text": "• EMBRACE (noun). The noun EMBRACE has 3 senses: 1. the act of clasping another person in the arms (as in greeting or affection). 2. the state of taking in or encircling. 3. a close affectionate and protective acceptance. Familiarity information: EMBRACE used as a noun is uncommon."}]