[{"url": "https://en.wikipedia.org/wiki/Natural_gas_condensate", "passage_text": "The feedstock mixture of gas, liquid condensate and water is then routed to a high pressure separator vessel where the water and the raw natural gas are separated and removed. The raw natural gas from the high pressure separator is sent to the main gas compressor. 1 Dry gas wells—These wells typically produce only raw natural gas that does not contain any hydrocarbon liquids. 2  Such gas is called non-associated gas. 3  Condensate from dry gas is extracted at gas processing plants and, hence, is often referred to as plant condensate."}, {"url": "http://study.com/academy/lesson/what-is-condensation-definition-examples-quiz.html", "passage_text": "The rapid cooling of water vapor from the plane engine causes the water vapor to condense and cause cloud formation, or vapor trails. In fact, the formation of clouds themselves is caused by condensation of water vapor in the atmosphere condensing into a liquid state. "}, {"url": "https://en.wikipedia.org/wiki/Natural_gas_condensate", "passage_text": "Natural-gas condensate is a low-density mixture of hydrocarbon liquids that are present as gaseous components in the raw natural gas produced from many natural gas fields. It condenses out of the raw gas if the temperature is reduced to below the hydrocarbon dew point temperature of the raw gas. 1 Dry gas wells—These wells typically produce only raw natural gas that does not contain any hydrocarbon liquids. 2  Such gas is called non-associated gas. 3  Condensate from dry gas is extracted at gas processing plants and, hence, is often referred to as plant condensate."}, {"url": "https://en.wikipedia.org/wiki/Natural_gas_condensate", "passage_text": "1 Condensate produced from oil wells is often referred to as lease condensate. 2  Dry gas wells—These wells typically produce only raw natural gas that does not contain any hydrocarbon liquids. 3  Such gas is called non-associated gas. 1 Dry gas wells—These wells typically produce only raw natural gas that does not contain any hydrocarbon liquids. 2  Such gas is called non-associated gas. 3  Condensate from dry gas is extracted at gas processing plants and, hence, is often referred to as plant"}, {"url": "http://www.glossary.oilfield.slb.com/en/Terms/c/condensate.aspx", "passage_text": "Liquid phase occurring in gas condensate reservoirs when the pressure is below the dewpoint pressure. 3. n. [Production Testing, Enhanced Oil Recovery]. A natural gas liquid with a low vapor pressure compared with natural gasoline and liquefied petroleum gas. Condensate is mainly composed of propane, butane, pentane and heavier hydrocarbon fractions. The condensate is not only generated into the reservoir, it is also formed when liquid drops out, or condenses, from a gas stream in pipelines or surface facilities. See: natural gas liquids"}, {"url": "https://en.wikipedia.org/wiki/Natural_gas_condensate", "passage_text": "The natural gas condensate is also referred to as simply condensate, or gas condensate, or sometimes natural gasoline because it contains hydrocarbons within the gasoline boiling range. 1 Dry gas wells—These wells typically produce only raw natural gas that does not contain any hydrocarbon liquids. 2  Such gas is called non-associated gas. 3  Condensate from dry gas is extracted at gas processing plants and, hence, is often referred to as plant condensate."}, {"url": "https://en.wikipedia.org/wiki/Condensation", "passage_text": "It can also be defined as the change in the state of water vapor to liquid water when in contact with a liquid or solid surface or cloud condensation nuclei within the atmosphere. When the transition happens from the gaseous phase into the solid phase directly, the change is called deposition. Condensation forming in the low pressure zone above the wing of an aircraft due to adiabatic expansion. Condensation is the change of the physical state of matter from gas phase into liquid phase, and is the reverse of evaporation. Mostly refers to the water cycle."}, {"url": "http://www.tlv.com/global/TI/steam-theory/introduction-to-condensate-recovery.html", "passage_text": "Condensate is the liquid formed when steam passes from the vapor to the liquid state. In a heating process, condensate is the result of steam transferring a portion of its heat energy, known as latent heat, to the product, line, or equipment being heated. Example of Steam Heating Process."}, {"url": "http://www.thefreedictionary.com/condensate", "passage_text": "condensate. n. 1. (General Physics) a substance formed by condensation, such as a liquid from a vapour. (kənˈdɛn seɪt, ˈkɒn dənˌseɪt). 1. The liquid resulting from condensation of a gas, such as a product of distillation or another method of separation. 2. The part of a natural gas mixture that consists of volatile hydrocarbons and can be easily condensed."}, {"url": "http://info.drillinginfo.com/what-exactly-is-condensate/", "passage_text": "Condensate is a very light hydrocarbon with an American Petroleum Institute (API) specific gravity of greater than 50 degrees and less than 80 degrees. In underground formations condensate can exist separately from the crude oil or dissolved in the crude oil. Plant and Field Condensate. When produced at the wellhead and run through a stabilizer it is known as “field” or “lease” condensate. In dry gas or condensate wells, condensate remains suspended in the gas stream until separated at gas processing facility, thus earning the name “plant” condensate or “natural gasoline”."}]