[{"url": "http://www.chemguide.co.uk/organicprops/aniline/preparation.html", "passage_text": "Nitrobenzene to phenylamine The conversion is done in two main stages: Stage 1: conversion of nitrobenzene into phenylammonium ions Nitrobenzene is reduced to phenylammonium ions using a mixture of tin and concentrated hydrochloric acid. The mixture is heated under reflux in a boiling water bath for about half an hour. The benzene is first converted to nitrobenzene which is in turn reduced to phenylamine. Benzene to nitrobenzene Benzene is nitrated by replacing one of the hydrogen atoms on the benzene ring by a nitro group, NO2."}, {"url": "http://www.chemguide.co.uk/organicprops/aniline/preparation.html", "passage_text": "Benzene to nitrobenzene. Benzene is nitrated by replacing one of the hydrogen atoms on the benzene ring by a nitro group, NO 2. The benzene is treated with a mixture of concentrated nitric acid and concentrated sulphuric acid at a temperature not exceeding 50°C. The benzene is first converted to nitrobenzene which is in turn reduced to phenylamine. Benzene to nitrobenzene Benzene is nitrated by replacing one of the hydrogen atoms on the benzene ring by a nitro group, NO2."}, {"url": "https://en.wikipedia.org/wiki/Nitrobenzene", "passage_text": "Nitrobenzene is an organic compound with the chemical formula C6H5 NO2. It is a water-insoluble pale yellow oil with an almond-like odor. This mixture is sometimes called mixed acid.. The production of nitrobenzene is one of the most dangerous processes conducted in the chemical industry because of the exothermicity of the reaction (δ H = −117 kJ/mol). World capacity for nitrobenzene in 1985 was about 1.7×10 6 tonnes."}, {"url": "https://en.wikipedia.org/wiki/Nitrobenzene", "passage_text": "Nitrobenzene is prepared by nitration of benzene with a mixture of concentrated sulfuric acid, water, and nitric acid. This mixture is sometimes called mixed acid.. The production of nitrobenzene is one of the most dangerous processes conducted in the chemical industry because of the exothermicity of the reaction (δ H = −117 kJ/mol). World capacity for nitrobenzene in 1985 was about 1.7×10 6 tonnes."}, {"url": "http://www.inchem.org/documents/ehc/ehc/ehc230.htm", "passage_text": "Nitrobenzene is produced commercially by the exothermic nitration of benzene with fuming nitric acid in the presence of a sulfuric acid catalyst. The crude nitrobenzene is passed through washer-separators to remove residual acid and is then distilled to remove benzene, water, dinitrobenzene and trinitrobenzene. "}, {"url": "http://encyclopedia2.thefreedictionary.com/nitrobenzene", "passage_text": "C 6 H 5 NO 2, very poisonous, flammable, pale yellow, liquid aromatic compound with an odor like that of bitter almonds. It is sometimes called oil of mirbane or nitrobenzol. Nitrobenzene melts at 5.85&degC;, boils at 210.9&degC;, is only slightly soluble in water, but is very soluble in ethanol, ether, and benzene. The major use of nitrobenzene is in the production of aniline aniline, C6H5NH2, colorless, oily, basic liquid organic compound; chemically, a primary aromatic amine whose molecule is formed by replacing one hydrogen atom of a benzene molecule with an amino group...... Click the link for more information."}, {"url": "https://en.wikipedia.org/wiki/Nitrobenzene", "passage_text": "The nitration process involves formation the nitronium ion (NO 2 +), followed by an electrophilic aromatic substitution reaction of it with benzene. The nitronium ion is generated in situ by the reaction of nitric acid and an acidic dehydration agent, typically sulfuric acid: This mixture is sometimes called mixed acid.. The production of nitrobenzene is one of the most dangerous processes conducted in the chemical industry because of the exothermicity of the reaction (δ H = −117 kJ/mol). World capacity for nitrobenzene in 1985 was about 1.7×10 6 tonnes."}, {"url": "http://www.oocities.org/nepalorganic/nitro_benzene.htm", "passage_text": "HNO3 and conc. H2SO4 on benzene at the ordinary temperature. NO 2. + HNO3 + H2O. Benzene Nitrobenzene. 50 ml of concentrated nitric acid and 50 ml of concentrated sulphuric acid acid are taken in a round bottomed flask and cooled. 50 ml of benzene is added to this mixture slowly by instalments adding 2-3 ml at a time. On a large scale also, nitrobenzene is prepared by the action of a mixture of nitric acid and sulphuric acid on benzene. At the end, the spent acids are withdrawn and the nitrobenzene layer given the necessary washings. Physical Properties. 1."}, {"url": "http://www.answers.com/Q/Is_nitrobenzene_a_strong_acid", "passage_text": "Usually an acid with a pH of about 1 or 2. Some examples are hydrochloric acid (HCl), nitric acid (HNO3) & sulfuric acid (H2SO4). More specifically a strong acid is a substa … nce that when dissolved in water, completely dissociates into ions with the positive ion being hydrogen (H+). Hydrochloric acid (HCl) is a strong acid because HCl co … mpletely dissolves into H+ and Cl-ions in water. This means that every molecule of HCl that dissolves produces one hydronium ion."}, {"url": "https://www.chemours.com/Aniline/en_US/products/nitrobenzene.html", "passage_text": "Nitrobenzene Products. Nitrobenzene (NB; oil of mirbane) is a pale yellow liquid with an odor resembling that of bitter almonds. It was first synthesized in 1834 by treating benzene with fuming nitric acid and has commercial importance as the major precursor to aniline. Sales Specifications."}]