[{"url": "http://www.realcartips.com/leasing/0439-good-lease-deal.shtml", "passage_text": "On the other hand, your financing rate could have been lower which would lower the monthly figures. This is a quick and easy way to see if your lease is a good deal or not. As long as it falls below $135 per $10k worth of car, you're looking at a pretty decent lease deal. TrueCar No-Haggle and Edmunds Price Promise are the quickest way to see the lowest car prices in your area."}, {"url": "http://www.realcartips.com/leasing/0439-good-lease-deal.shtml", "passage_text": "When comparing lease deals, there's a simple way to determine if it's a good deal or not. What you need to do is figure out your monthly cost per $10,000 worth of vehicle for a 36 month lease."}, {"url": "http://www.abpcopy.com/blog1/2012/03/29/frequently-asked-questions-when-leasing-or-buying-a-copier/", "passage_text": "If you are the owner of a new business, and are concerned about long term survival it may not make sense, A copier lease is almost always impossible to break, so if long term commitment is not in your future, than leasing is not a good idea."}, {"url": "http://www.ncagr.gov/aglaw/leases.htm", "passage_text": "A lease is a contract between two parties for the use of goods or land for a term in return for some form of “consideration” (i.e., payment – anything of value, whether it be money, some services, a promise of some future action, etc.)."}, {"url": "http://www.realcartips.com/leasing/0439-good-lease-deal.shtml", "passage_text": "I've highlighted the important parts needed to calculate whether this is a good lease deal or not. This is a 36 month lease on a car with an MSRP of $39,000. The lease payment is $379 per month with $2,500 down and a lease acquisition fee of $725."}, {"url": "http://www.bankrate.com/finance/auto/should-i-lease-my-next-car-1.aspx", "passage_text": "1 2 3 4 5 6 7. If your clunker of a car is gasping its final breath, you are probably in the midst of deciding whether to lease a car. There are pros and cons to either leasing or buying, but financial experts say buying and keeping a new car for the long term is usually the better deal."}, {"url": "http://legal-dictionary.thefreedictionary.com/Lease", "passage_text": "8.-3. As to the form, leases may be in writing or not in writing. See Parol Leases. Leases in writing are either by deed or without deed; a deed is a writing sealed and delivered by the parties, so that a lease under seal is a lease by deed."}, {"url": "http://legal-dictionary.thefreedictionary.com/Lease", "passage_text": "A contractual agreement by which one party conveys an estate in property to another party, for a limited period, subject to various conditions, in exchange for something of value, but still retains ownership. A lease contract can involve any property that is not illegal to own. Common lease contracts include agreements for leasing real estate and apartments, manufacturing and farming equipment, and consumer goods such as automobiles, televisions, stereos, and appliances."}]