[{"url": "https://en.wikipedia.org/wiki/British_thermal_unit", "passage_text": "The British thermal unit (BTU or Btu) is a traditional unit of work equal to about 1055 joules. It is the amount of work needed to raise the temperature of one pound of water by one degree Fahrenheit (Physical analogue: one four-inch wooden kitchen match consumed completely generates approximately 1 BTU). In science, the joule, the SI unit of energy, has largely replaced the BTU."}, {"url": "http://www.airmovementsystems.com/whatisabtu.html", "passage_text": "What is a BTU. A BTU, short for British Thermal Unit, is a basic measure of thermal (heat) energy. One BTU is the amount of energy needed to heat one pound of water one degree Fahrenheit, measured at its heaviest point. A unit of measure called the MMBTU is the equivalent of a million BTU's. Few man-made objects can generate this level of thermal energy, however. When shopping for heating or cooling systems, keep in mind that even the smallest window-mounted air conditioner or space heater can produce thousands of BTU's."}, {"url": "http://www.northcool.com/air_conditioner_size.html", "passage_text": "Btu – British Thermal Unit (Btu) is the international measure of energy. A Btu is the amount of heat needed to raise 1 (one) pound of water by 1(one) degree Fahrenheit. In HVAC industry, Btu's measure the quantity of heat a conditioning unit can remove from a room per hours. One BTU per hour is equal to 0293 watts. As the Btu rating increases, so does the weight, size and cost of the air conditioner."}, {"url": "http://www.answers.com/Q/What_does_BTU_measure", "passage_text": "BTU is short for British Thermal Unit. 1 BTU is the heat required to raise 1 lb of water by 1 degF. So it is a quantity of heat, which is equivalent to a quantity of energy, in fact 1 BTu = 1.055 kilojoules, so 1 BTU/second = 1.055 kilowatts. This is called the mechanical equivalent of heat. If measuring heat, a BTU measures the amount of heat that is  required to raise the temperature of a pound of water to 1Aº  1âº. Fahrenheit in terms of air, conditioning The … B tu determines  the amount of heat the unit can remove from the. room"}, {"url": "https://servicechampions.com/what-does-btu-mean-for-your-furnace-ac/", "passage_text": "BTU is a unit of measurement for energy. One BTU is equal to the amount of energy used to raise the temperature of one pound of water one degree Fahrenheit. In most applications the BTU has been replaced by the joule, but BTU remains a popular measurement of heating and cooling equipment. "}, {"url": "http://www.wisegeek.org/what-is-a-btu.htm", "passage_text": "A BTU is a measurement of thermal energy where one BTU is equal to the amount of energy needed to raise the temperature of 1 pound of water by 1° Fahrenheit. Even small space heaters can produce thousands of BTUs. A central air conditioner, which uses hundreds of thousands of BTUs. A BTU, short for British thermal unit, is a basic measure of thermal (heat) energy. One BTU is the amount of energy needed to raise the temperature of 1 pound (0.45 kg) of water by 1° Fahrenheit (0.55° Celsius)."}, {"url": "https://en.wikipedia.org/wiki/British_thermal_unit", "passage_text": "A BTU is the amount of heat required to raise the temperature of 1 avoirdupois pound of liquid water by 1 degree Fahrenheit at a constant pressure of one atmosphere. calorie, several definitions of the BTU exist, because the temperature response of water to heat energy is non-linear. It is the amount of work needed to raise the temperature of one pound of water by one degree Fahrenheit (Physical analogue: one four-inch wooden kitchen match consumed completely generates approximately 1 BTU). In science, the joule, the SI unit of energy, has largely replaced the BTU."}, {"url": "http://www.wikihow.com/Calculate-BTU-Per-Square-Foot", "passage_text": "The British Thermal Unit (BTU) is the basic measure of heat energy in the Imperial system. One BTU is defined as the amount of heat necessary to raise 1 pound (0.454 kg) of water 1 degree Fahrenheit (0.55 degrees Celsius). "}, {"url": "https://en.wikipedia.org/wiki/British_thermal_unit", "passage_text": "The BTU/h is most often used as a measure of power in the power, steam generation, heating, and air conditioning industries, and also as a measure of agricultural energy production (BTU/kg). It is the amount of work needed to raise the temperature of one pound of water by one degree Fahrenheit (Physical analogue: one four-inch wooden kitchen match consumed completely generates approximately 1 BTU). In science, the joule, the SI unit of energy, has largely replaced the BTU."}]