[{"url": "http://www.answers.com/Q/Who_sang_starry_starry_night", "passage_text": "The song is Vincent and it was recorded in 1971 by Don McLean. It is sometimes referred to by the name Starry Starry Night.. It is dedicated to famous post-impressionist ar … tist Vincent van Gogh (1853-1890), whose best known work includes an 1889 painting called The Starry Night. 1 Vincent van Gogh's The Starry Night Like the Impressionist painters, who influenced him to brighten his palette, Vincent van Gogh sought out the effects of light, both natural and artificial."}, {"url": "http://www.answers.com/Q/Who_sang_starry_starry_night", "passage_text": "Don McLean The song is Vincent (1971). The song was written and recorded by Don McLean and is sometimes referred to by the name Starry Starry Night.. It is dedicated to f … amous post-impressionist artist Vincent van Gogh (1853-1890), whose best known work includes an 1889 painting called The Starry Night. 1 Vincent van Gogh's The Starry Night Like the Impressionist painters, who influenced him to brighten his palette, Vincent van Gogh sought out the effects of light, both natural and artificial."}, {"url": "http://www.youtube.com/watch?v=oxHnRfhDmrk", "passage_text": "Don McLean's Vincent (Starry,Starry Night) Almost all images created by Vincent Van-Gogh. Song by Don McLean I in no way assume any credit for song or images.  1 Vincent by Don McLean (Google Play • iTunes • AmazonMP3). 2  Music. 3  Standard YouTube License. "}, {"url": "http://www.answers.com/Q/Who_sang_starry_starry_night", "passage_text": "Vincent van Gogh's painting is called The Starry Night. Starry Starry Nigh is a song written and sung by Don McLean. 1 Vincent van Gogh's The Starry Night Like the Impressionist painters, who influenced him to brighten his palette, Vincent van Gogh sought out the effects of light, both natural and artificial."}, {"url": "http://www.answers.com/Q/Who_sang_'Starry_Starry_Night'", "passage_text": "The song is Vincent and it was recorded in 1971 by Don McLean. It is sometimes referred to by the name Starry Starry Night.. It is dedicated to famous post-impressionist ar … tist Vincent van Gogh (1853-1890), whose best known work includes an 1889 painting called The Starry Night. Vincent van Gogh's painting is called The Starry Night. Starry Starry Nigh is a song written and sung by Don McLean. The real title of the song is Vincent, and it was wri … tten as a tribute to the famous impressionist, Vincent van Gogh. 4 people found this useful."}, {"url": "http://www.vangoghgallery.com/painting/starrynightlyrics.html", "passage_text": "Understanding the lyrics and Van Gogh's Life. Below are the lyrics to Don McLean's hit song Vincent (Starry, Starry Night) and a comparison to Van Gogh's Actual Life. They are Van Gogh's eyes that watch the world. This is all metaphorically speaking though. Starry, starry night. Portraits hung in empty halls, Frameless head on nameless walls, With eyes that watch the world and can't forget."}, {"url": "http://www.answers.com/Q/Who_sang_'Starry_Starry_Night'", "passage_text": "The song is Vincent (1971). The song was written and recorded by Don McLean and is sometimes referred to by the name Starry Starry Night.. It is dedicated to famous post-impressionist artist Vincent van Gogh (1853-1890), whose best known work includes an 1889 painting called The Starry Night. Vincent van Gogh's painting is called The Starry Night. Starry Starry Nigh is a song written and sung by Don McLean. The real title of the song is Vincent, and it was wri … tten as a tribute to the famous impressionist, Vincent van Gogh. 4 people found this useful."}, {"url": "https://en.wikipedia.org/wiki/Vincent_%28song%29", "passage_text": "Vincent  is a song by Don McLean written as a tribute to Vincent van Gogh. It is also known by its opening line,  Starry Starry Night , a reference to Van Gogh's painting The Starry Night. The song also describes different paintings done by the artist. McLean wrote the lyrics in 1971 after reading a book about the life of the artist"}, {"url": "http://www.allmusic.com/album/starry-starry-night-mw0000003600", "passage_text": "AllMusic Review by Bruce Eder. Don McLean 's third official live album, Starry Starry Night, isn't precisely the soundtrack to the video of his PBS special, from a November 2, 1999, performance at Austin, TX's Paramount Theater, so much as another permutation of the show. "}]