[{"url": "http://money.usnews.com/careers/best-jobs/financial-manager", "passage_text": "Financial managers usually start by earning a bachelor’s degree in finance, accounting, economics or business administration. Many also earn a master’s degree (in business administration, finance or economics) and continue getting financial management training, both on the job and off. Financial managers have the responsibility of overseeing the finances of major companies, agencies and everything in between. Along with their teams, they coordinate accounting and produce financial reports, cash-flow statements and profit projections."}, {"url": "https://en.wikipedia.org/wiki/Financial_management", "passage_text": "The term typically applies to an organization or company's financial strategy, while personal finance or financial life management refers to an individual's management strategy. It includes how to raise the capital and how to allocate capital, i.e. capital budgeting. (February 2014). Financial management refers to the efficient and effective management of money (funds) in such a manner as to accomplish the objectives of the organization. It is the specialized function directly associated with the top management"}, {"url": "http://www.bls.gov/ooh/management/financial-managers.htm", "passage_text": "What Financial Managers Do. Financial managers are responsible for the financial health of an organization. They produce financial reports, direct investment activities, and develop strategies and plans for the long-term financial goals of their organization. Financial managers also do tasks that are specific to their organization or industry. For example, government financial managers must be experts on government appropriations and budgeting processes, and healthcare financial managers must know about issues in healthcare finance."}, {"url": "http://managementstudyguide.com/financial-management.htm", "passage_text": "Meaning of Financial Management. Financial Management means planning, organizing, directing and controlling the financial activities such as procurement and utilization of funds of the enterprise. It means applying general management principles to financial resources of the enterprise. 1 Management of cash: Finance manager has to make decisions with regards to cash management. 2  Cash is required for many purposes like payment of wages and salaries, payment of electricity and water bills, payment to creditors, meeting current liabilities, maintainance of enough stock, purchase of raw materials, etc."}, {"url": "http://www.bls.gov/ooh/management/financial-managers.htm", "passage_text": "Financial managers typically have a bachelor’s degree and 5 years or more of experience in another business or financial occupation, such as loan officer, accountant, auditor, securities sales agent, or financial analyst. Financial managers also do tasks that are specific to their organization or industry. For example, government financial managers must be experts on government appropriations and budgeting processes, and healthcare financial managers must know about issues in healthcare finance."}, {"url": "http://www.wisegeek.com/what-does-a-financial-manager-do.htm", "passage_text": "Finance management is usually a high-level position, and an aspiring financial manager is typically promoted to the position after working a related job, such as financial analyst, accountant, or auditor. Some companies do provide management training in finance. A financial manager typically works closely with other members of the management team on matters that can affect the financial health of the organization. Financial managers often lead teams of accountants."}, {"url": "http://www.wisegeek.com/what-does-a-financial-manager-do.htm", "passage_text": "A financial manager is in charge of the functions involving money in a large or small organization. While answerable to corporate management or a board of directors, he or she holds authority over decisions regarding income, costs, payroll, investments, mergers, and acquisitions. A financial manager typically works closely with other members of the management team on matters that can affect the financial health of the organization. Financial managers often lead teams of accountants."}]