[{"url": "http://www.genesiscareer.edu/career-center/get-your-license-or-certification/cosmetology-license/", "passage_text": "The Tests. Once you apply for your license with the Alabama board, you can schedule your written exam with PSI Exams Online. Here is a link explaining how to take the written cosmetology licensing test: Cosmetology Written Examination Information. Print this document and read it over."}, {"url": "http://www.beautyschoolsdirectory.com/blog/cosmetology-school-education/how-to-pass-the-cosmetology-license-exam/", "passage_text": "3. Mentally Prepare Yourself. Get familiar with the structure of the exam. Written examinations typically last 1 to 2 hours. Practical examinations can last from 4 to 8 hours depending on your state for full cosmetology, and typically 2 to 4 hours for shorter exams like esthetics, nail technology and electrology exams."}, {"url": "http://www.genesiscareer.edu/career-center/get-your-license-or-certification/cosmetology-license/", "passage_text": "Alabama. To get your license to work in Alabama, first apply for licensure with the Alabama Board of Cosmetology and Barbering – then the board gives notice to both independent test vendors that you are qualified to schedule and take the exams (both written and “practical”)."}, {"url": "http://www.hairdesignschool.edu/faq/cosmetology-and-licensing/", "passage_text": "You will be able to get your license once you take the state board exam. Upon completion of cosmetology school, states require a graduate to take a certification exam in their program of study known as the state board examination."}, {"url": "http://www.beautyschoolsdirectory.com/blog/cosmetology-school-education/how-to-pass-the-cosmetology-license-exam/", "passage_text": "Some states offer cosmetology license exam study guides, others do not. Talk to your board of cosmetology to ask. Be prepared to answer any surprise questions, and make sure you absolutely know every angle of the services you need to do on that practical. Remember all your safety and sanitation training."}, {"url": "http://www.hairdesignschool.edu/faq/cosmetology-and-licensing/", "passage_text": "Cost-There is fee to take the state board exam to become licensed, and there is also a certain fee to be paid in order to keep the license current. This cost can vary from $60 to $100 depending on the state. Contact your local state board for exact information."}, {"url": "http://www.hairdesignschool.edu/faq/cosmetology-and-licensing/", "passage_text": "All cosmetology licensure laws and regulations vary by state. Begin by checking your state’s regulatory agency for license and testing information upon graduating from beauty school. You then need to register to take the exam. Many states now have online registration available."}, {"url": "https://www.tdlr.texas.gov/cosmet/cosmetexam.htm", "passage_text": "Cosmetologist Exam Information. Lower Exam Fees Starting September 1, 2015 - TDLR’s mission is to honor the trust of all Texans, ensure public safety and consumer protection, and provide a fair, efficient licensing and regulation environment at the lowest possible cost."}]