[{"url": "http://www.wikihow.com/Replace-Car-Keys", "passage_text": "Depending on the sophistication of your car key you may be able to have a new electronic key programmed by a locksmith. Many new car keys have a microchip in them to prevent duplication. However, if you have a key with a transponder in it you can probably get a new one at a locksmith for around $50.00. Manufacturers started using transponders in the 1990’s – they are chips in the head of the key that communicate with the car. If the wrong key is in the ignition, the car will not start"}, {"url": "http://www.ehow.com/how_7474140_can-replace-lost-chrysler-key.html", "passage_text": "Go to your Chrysler dealership or locksmith's office. Provide them with the VIN number, year and model of your vehicle. If your key has a computer chip in the fob, your local dealer and locksmith can determine what it is based on the VIN. Wait while your new key is created and pay the fee for the replacement. In the event of a lost or stolen key, contact a certified Chrysler dealer, ... How to Replace Chrysler Car Keys. Chrysler... 1  How to Replace the Key in the Chrysler Crossfire Key FOB."}, {"url": "http://www.denver-locksmith.net/2013/11/dodge-ram-truck-key-replacement/", "passage_text": "In general, Dodge Ram Pickup Truck keys are very easy to make. If you lost the key or just need a key copy, first, you will need to find out what kind of key your truck requires, and if there is a chip inside the key or not. Mile High Lock and Key, LLC is an expert automotive locksmith company. We can make new keys, repair keys, and program them. 1 You can buy a transponder chip key blank online or at a locksmith shop. 2  You can also get one at a Dodge dealership. 3  Pick one of the working keys and copy it to your new key. 4  You can also have the key copied at different hardware stores."}, {"url": "http://www.ehow.com/how_7474140_can-replace-lost-chrysler-key.html", "passage_text": "Instructions. Contact your local Chrysler dealership or a professional locksmith. Explain that you've lost your keys and need to acquire a replacement. Write down the vehicle identification number of your Chrysler. In the event of a lost or stolen key, contact a certified Chrysler dealer, ... How to Replace Chrysler Car Keys. Chrysler... 1  How to Replace the Key in the Chrysler Crossfire Key FOB."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20081125082613AAZJ1Be", "passage_text": "A locksmith cannot make you a key for a car. You need to call a dealership (i.e. if it's a chevy call a chevy dealership) with your VIN number and if it's not real old they can get the key codes to cut you a new key. Yes I have lost my car keys, only good thing is car was locked on own drive way not in a car park, Does anyone know how i can get a copy as the one i lost was the only one i had, Source(s): ve lost car keys set: https://biturl.im/C20xM. Tresa · 2 months ago. Thumbs up."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20081125082613AAZJ1Be", "passage_text": "· just now. Report Abuse. Get the vin number and take your title to the dealer or a good locksmith, they can cut you a new one. I hope you learned a lesson here, always have a spare key or two at your house or a friends in case you lock your keys in the car. Yes I have lost my car keys, only good thing is car was locked on own drive way not in a car park, Does anyone know how i can get a copy as the one i lost was the only one i had, Source(s): ve lost car keys set: https://biturl.im/C20xM. Tresa · 2 months ago. Thumbs up."}, {"url": "http://www.chrysler-keys.com/index.html", "passage_text": "If you have lost your keys to your Chrysler car or truck, We can send you a factory replacement key right away! Our locksmith service is normally 20% to 50% cheaper than if you went to a Chrysler dealership and purchased the exact same key or transponder. Discount Chrysler keys is all we do! Step 1 Fax us a copy of your vehicle registration, or title, and our replacement key order form. Step 2 Complete the Paypal payment process below. Step 3 We ship your Chrysler car or truck key directly to you!"}, {"url": "http://www.ehow.com/how_7474140_can-replace-lost-chrysler-key.html", "passage_text": "You've lost the keys to your Chrysler vehicle. Rest assured that whatever the model and year of your car, a replacement key can be obtained. In the event of a lost or stolen key, contact a certified Chrysler dealer, ... How to Replace Chrysler Car Keys. Chrysler... 1  How to Replace the Key in the Chrysler Crossfire Key FOB."}, {"url": "http://www.chrysler-keys.com/index.html", "passage_text": "Welcome to Chrysler Keys! Chrysler Keys is a locksmith service that makes keys for any Chrysler vehicle ever made. As locksmiths, we cater to the repossession service industry and individuals who have lost their keys, or transponder. We have keys for ALL Chrysler cars, and ALL Chrysler trucks. Discount Chrysler keys is all we do! Step 1 Fax us a copy of your vehicle registration, or title, and our replacement key order form. Step 2 Complete the Paypal payment process below. Step 3 We ship your Chrysler car or truck key directly to you!"}]