[{"url": "https://simple.wikipedia.org/wiki/Puberty", "passage_text": "Girls also experience a growth spurt during puberty. In the first year after puberty begins, they grow about 8 cm (3 in). They grow even faster the next year or so, then the growth slows down and almost stops when they start menstruating. This happens about two years after puberty starts, usually between the ages of 13 and 15. When a boy reaches the end of his growth spurt when he is about 18 years old, he will be at his adult height. His body will not grow much taller after that. Because of their growth spurt, boys' muscles can feel sore."}, {"url": "http://www.nationwidechildrens.org/early-puberty-in-boys", "passage_text": "A problem in the thyroid gland could also start puberty early. Some boys can have “partial” precocious puberty and may have growth of pubic or underarm hair but no other sexual development. Children with partial early puberty may need to be seen by a doctor. Early Puberty in Boys. Tweet. Puberty is the time when boys’ bodies and minds mature and they grow into young men. This usually starts when a boy is about 12 years old. Sometimes, though, a much younger boy starts to show the signs of puberty. This is called precocious (pre-KOH-shuss), or early puberty (PU-ber-ty)."}, {"url": "http://www.kaahe.org/health/en/765-puberty/765-2-puberty-hormones-and-puberty.html", "passage_text": "Two areas of the brain produce the hormones that are needed for puberty: the hypothalamus and the pituitary gland. The hypothalamus, among many other functions, controls body temperature, hunger, and thirst. The pituitary gland is a pea-sized organ attached to the hypothalamus. The hypothalamus sends signals to the pituitary gland. These signals cause the pituitary gland to make hormones that control other glands and many of the body’s functions, including growth. Puberty starts when the hypothalamus releases a hormone called the gonadotropin-releasing hormone. "}, {"url": "http://www.webmd.com/children/early-puberty-10/slideshow-puberty-stages", "passage_text": "Later Stages of Puberty for Girls. About a year after puberty begins, girls have a growth spurt. A girl will get taller and start to get wider hips and fuller breasts. Some curve-related fat will appear on her stomach, buttocks, and legs. Girls usually reach adult height by their mid-to late teens. Growth Spurts: From Boys to Men. The peak growth spurt for boys happens later than it does for girls. It occurs around six months after pubic hair development. When it does, your son's shoulders will become fuller and broader, and he'll grow taller, too."}, {"url": "http://www.magicfoundation.org/downloads/cppbrochure993.pdf", "passage_text": "The body makes many hormones (e.g., thyroid, growth, sex and adrenal hormones) that work together to maintain normal bodily function. Hormones involved in the control of puberty include: GnRH: Gonadotropin releasing hormone, which comes from the brain in boys and in girls. "}, {"url": "http://highered.mheducation.com/sites/0072414561/student_view0/part1/chapter1/chapter_outline.html", "passage_text": "1 The hypothalamus is the thermostat of the hormonal system. 2  The hypothalamus, pituitary gland, and the gonads (ovaries, testicles) operate in a feedback loop, producing and maintaining the levels of sex hormones (androgens and estrogens) that are mainly responsible for the primary and secondary changes of puberty. "}, {"url": "http://www.chw.org/medical-care/adolescent-health-and-medicine/issues-and-concerns/adoloscent-growth-and-development/female-physical-development/puberty-adolescent-female/", "passage_text": "As the adolescent nears puberty, a gland in the brain called the pituitary gland increases the secretion of a hormone called follicle-stimulating hormone (FSH). This hormone then causes additional effects. In girls, FSH activates the ovaries to start producing estrogen. In boys, FSH causes sperm to develop. "}, {"url": "http://www.hormone.org/questions-and-answers/2013/delayed-puberty", "passage_text": "1 Girls start to grow underarm hair and pubic hair, and have a growth spurt. 2  They start having menstrual periods about 2 to 3 years after their breasts start to develop. 3  For boys, puberty usually starts between ages 9 and 14 years. 4  The testicles and penis get larger. 1 For boys, puberty usually starts between ages 9 and 14 years. 2  The testicles and penis get larger. 3  Boys start to grow underarm hair, pubic hair, and facial hair. 4  Their voices deepen and they"}, {"url": "https://simple.wikipedia.org/wiki/Puberty", "passage_text": "Puberty is started by hormones, which are chemicals that tell parts of the body to do things. Today, on average, girls start puberty at age 10 or 11, and boys at age 11 or 12. However, people all over the world start puberty at different ages. This happens about two years after puberty starts, usually between the ages of 13 and 15. When a boy reaches the end of his growth spurt when he is about 18 years old, he will be at his adult height. His body will not grow much taller after that. Because of their growth spurt, boys' muscles can feel sore."}]