[{"url": "http://globalnews.ca/news/1763212/how-to-borrow-money-from-your-rrsp-without-getting-penalized/", "passage_text": "The HBP allows you to borrow up to $25,000 from your RRSP to buy or build a home. To take advantage of the HBP you must be a first-time home buyer or haven’t owned a home in the last five years and you must repay the money within 15 years. You can also borrow from your RRSP to finance education for yourself or spouse through the Lifelong Learning Plan. The LLP allows you to borrow up to $10,000 a year, up to a total of $20,000. To participate in the program the student must be enrolled on a full-time basis in a qualified program."}, {"url": "https://www.cibc.com/ca/loans/articles/rrsp-loan-withdrawal.html", "passage_text": "If you choose to withdraw money from your RRSP under the HBP, you have to repay it within 15 years. Generally, you have to repay 1/15 of the total amount you withdrew for each year of your repayment period. Your repayment period starts the second year following the year you make your withdrawal. If you need to withdraw money from your RRSP, you can do so, but keep in mind you will be taxed on the amount you withdraw. There are only two exceptions to this rule: buying your first home, and borrowing from your RRSP to further your education."}, {"url": "http://www.cra-arc.gc.ca/hbp/", "passage_text": "The Home Buyers' Plan (HBP) is a program that allows you to withdraw up to $25,000 in a calendar year from your registered retirement savings plans (RRSPs) to buy or build a qualifying home for yourself or for a related person with a disability. "}, {"url": "https://www.cibc.com/ca/loans/articles/rrsp-loan-withdrawal.html", "passage_text": "You can take $25,000 out of your RRSP to buy a home under the Home Buyers Plan (HBP) . Remember to consult the CRA website to be sure your home meets the necessary requirements. You can also withdraw money from your RRSP to pay for your education under the Lifelong Learning Plan (LLP) . If you need to withdraw money from your RRSP, you can do so, but keep in mind you will be taxed on the amount you withdraw. There are only two exceptions to this rule: buying your first home, and borrowing from your RRSP to further your education."}, {"url": "http://www.investopedia.com/university/rrsp/rrsp7.asp", "passage_text": "As with the HBP, the maximum amount you're allowed to withdraw is $20,000, and only $10,000 can be withdrawn each year. Repaying an RRSP withdrawal from the Lifelong Learning Plan doesn't have to start until five years after the first withdrawal. Once your repayments begin, you will have 10 years to pay the money back to your RRSP before the opportunity to replace these funds is lost entirely. Because you have not always made the maximum allowable contribution, you have also accumulated $30,000 in additional contribution room. If you withdraw the $15,000 and want to re-contribute that $15,000 at a later date, the re-contribution will reduce your $30,000 unused contribution room down to $15,000."}, {"url": "https://www.td.com/ca/apply/forms/524028.pdf", "passage_text": "The Home Buyers' Plan is a program that allows you to withdraw up to $20,000 from your registered retirement savings plan (RRSP) to buy or build a qualifying home for yourself or for a related person with a disability. "}, {"url": "http://www.getsmarteraboutmoney.ca/en/managing-your-money/investing/rrsps-for-retirement/Pages/Making-RRSP-withdrawals-before-you-retire.aspx", "passage_text": "The maximum you can take out in any year is $10,000. You won’t pay any tax on the money as long as you pay it back over a period of 10 years. You can't borrow money from your RRSP to pay for your child's education. But you can save tax free for your child's post-secondary education in an RESP. You pay a withholding tax. Your financial institution will hold back the tax on the amount you take out and pay it directly to the government on your behalf. The withholding tax rate is between 10% and 30%, depending on how much you take out of your RRSP. In Quebec, the rate is between 5% and 15% and there will also be provincial tax withheld"}, {"url": "http://www.getsmarteraboutmoney.ca/en/managing-your-money/investing/rrsps-for-retirement/Pages/Making-RRSP-withdrawals-before-you-retire.aspx", "passage_text": "1. Your financial institution will hold back the tax on the amount you take out and pay it directly to the government on your behalf. The withholding tax rate is between 10% and 30%, depending on how much you take out of your RRSP. In Quebec, the rate is between 5% and 15% and there will also be provincial tax withheld. You pay a withholding tax. Your financial institution will hold back the tax on the amount you take out and pay it directly to the government on your behalf. The withholding tax rate is between 10% and 30%, depending on how much you take out of your RRSP."}, {"url": "http://cawidgets.morningstar.ca/ArticleTemplate/ArticleGL.aspx?id=588275", "passage_text": "If you wait to withdraw from your RRSP until age 71 -- when the account must be collapsed and converted into a registered retirement income fund (RRIF) or registered annuity -- you'll be affected by the minimum withdrawal requirements. In the first year, you must withdraw 7.38% from the RRIF, Diamond notes. Now, let's say Bob also has a $500,000 RRSP. He deferred withdrawing from his RRSP until he converted it to a RRIF at age 71. The mandatory 7.38% means he must withdraw $36,900 in the year he turns 72. That significantly increases Bob's taxable income to $87,900, which moves him to a higher tax bracket."}]