[{"url": "http://work.chron.com/responsibilities-dna-analyst-9407.html", "passage_text": "Matching DNA Samples. One of the primary responsibilities of a forensic DNA analyst is to match a DNA sample found at a crime scene, such as hair or flakes of skin, with the DNA of a suspect. DNA analysts working in health care settings generally have the sample to be analyzed delivered to them, but forensic DNA analysts sometimes have to assist in the process of recovering a sample containing genetic material to be analyzed. For example, they may help remove hair or blood samples from a piece of clothing."}, {"url": "http://jobstat.net/jobs/forensic-dna-analyst/", "passage_text": "Average annual salary for a Forensic DNA Analyst is $43727 based on statistics in the U.S. as of 2015. The highest salary recorded was $61209. The lowest salary reported was $28436. These figures will vary on a state to state basis as these are averages across all 50 states. Median hourly wage for a Forensic DNA Analyst is $21.74 based on statistics in the U.S. as of 2015. The highest hourly rate recorded was $30.44. The lowest hourly rate recorded was $14.14."}, {"url": "http://study.com/articles/DNA_Analyst_Job_Description_Duties_and_Requirements.html", "passage_text": "DNA analysts often work in forensic crime labs where they examine samples of DNA to identify potential suspects. After conducting tests on each sample, analysts compare the identity of the sample with other known samples. To work in a crime lab approved by the Federal Bureau of Investigation (FBI), DNA analysts must meet the minimum requirement of a bachelor's degree related to molecular biology, genetics or forensic sciences."}, {"url": "http://www.forensicscolleges.com/careers/dna-analyst", "passage_text": "Career Outlook for a Forensic DNA Analyst. The employment outlook for those in the field of forensic science and DNA analysis is quite good actually. According to the 2010 U.S. Bureau of Labor Statistics report, the field of forensic science should grow at a rate of about 19 percent between 2010 and 2020. DNA analyst salaries can vary quite a bit based on a number of different factors. The 2012 BLS report shows that the median 2012 salary for forensic science techs, including the DNA analyst salary, was $52,480."}, {"url": "http://jobstat.net/jobs/forensic-dna-analyst/", "passage_text": "Bonuses for a Forensic DNA Analyst are based on the years of experience using statistics from the U.S. as of 2015. The average bonus recorded was $0 from people with 15+ years of experience. The average bonus recorded was $0 from people with under 1 year of experience. Median hourly wage for a Forensic DNA Analyst is $21.74 based on statistics in the U.S. as of 2015. The highest hourly rate recorded was $30.44. The lowest hourly rate recorded was $14.14. These figures will vary on a state to state basis as these are averages across all 50 states"}, {"url": "http://www.forensicscolleges.com/careers/dna-analyst", "passage_text": "In some cases, the DNA analyst job position may require a presentation of findings in a courtroom setting. In order to become an actual DNA analyst and work in a crime lab, one must have a bachelor’s of arts or a bachelor’s of science degree in chemistry, biology, or forensic science. DNA analyst salaries can vary quite a bit based on a number of different factors. The 2012 BLS report shows that the median 2012 salary for forensic science techs, including the DNA analyst salary, was $52,480."}, {"url": "http://www.payscale.com/research/US/Job=Forensic_DNA_Analyst/Salary", "passage_text": "Read More... A forensic DNA analyst is a scientist that plays an important role in criminal investigations. The DNA analyst can generally divide his or her work into two processes. First, he or she conducts chemical and genetic analysis on samples provided by police and crime scene investigators. Job satisfaction for Forensic DNA Analysts is high. Medical benefits are awarded to a large number, and a fair number earn dental coverage. Female Forensic DNA Analysts far outnumber their male contemporaries among survey respondents."}]