[{"url": "http://www.physicsclassroom.com/class/light/Lesson-2/Color-Subtraction", "passage_text": "Each primary color of paint absorbs one primary color of light. The color absorbed by a primary color of paint is the complementary color of that paint. The three colors that are primary to an artist (magenta, cyan, and yellow) subtract red, green, and blue individually from an otherwise white sheet of paper. Thus, Magenta paints absorb green light. Cyan paints absorb red light. Yellow paints absorb blue light. Let's suppose that an artist wishes to use the three primary colors of paint in order to produce a picture of the colorful bird shown at the right."}, {"url": "http://www.joyousworld.com/qabalah/color/", "passage_text": "Red and cyan, green and megenta, or blue and yellow light shined on the same area will appear as white light. For this reason, opposite colors are called complementary colors. Note that this white light appears white, but does not contain all the colors of the spectrum like, for example, sunlight."}, {"url": "http://www.physicsclassroom.com/reviews/light/lightans2.cfm", "passage_text": "Red filters absorb cyan light (the complementary color of red). If white light (red + blue + green) shines on a red filter and cyan (blue + green) light is absorbed, all that is left to be transmitted is red light."}, {"url": "http://ux1.eiu.edu/~cfadd/1160/Ch23RR/Sub.html", "passage_text": "Cyan is light with a wavelength between green and blue or a combination of green and blue light. Cyan pigment will absorb the red and reflect green and blue or cyan colored light. Magenta is a combination of red and blue, without any green. And yellow is seen when red and green light are combined. These colors are illustrated here: We have already seen what happens when we mix various combinations of red, green, and blue paint. Now we shall do the same with cyan, yellow, and magenta."}, {"url": "http://www.joyousworld.com/qabalah/color/", "passage_text": "Yellow pigment absorbs blue light. Cyan pigment absorbs red light. Transparent pigments work similarly, but instead of reflecting colors, they allow them to pass through. To make a pure red print color, blue and green have to be absorbed."}]