[{"url": "http://www.baa.org/races/boston-marathon/participant-information/athlete-registration.aspx/", "passage_text": "ABOUT THE 2016 BOSTON MARATHON. The 120th Boston Marathon will be held on Monday, April 18, 2016, Patriots’ Day in the Commonwealth of Massachusetts, and for the 31st consecutive year the event will be sponsored by John Hancock Financial."}, {"url": "http://www.history.com/topics/boston-marathon-bombings", "passage_text": "Introduction. On April 15, 2013, two bombs went off near the finish line of the Boston Marathon, killing three spectators and wounding more than 260 other people. On April 15, 2014, the mayor of Boston and the governor of Massachusetts will host a ceremony honoring the marathon bombing victims along with the first responders on the scene. The 118th running of the marathon will take place the following week, on April 21."}, {"url": "https://en.wikipedia.org/wiki/Boston_Marathon", "passage_text": "Begun in 1897, inspired by the success of the first modern-day marathon competition in the 1896 Summer Olympics, the Boston Marathon is the world's oldest annual marathon and ranks as one of the world's best-known road racing events. It is one of six World Marathon Majors, and is one of four major events held in the United States through the years of both World Wars (Kentucky Derby, Rose Parade, and Westminster Kennel Club Dog Show are the others). Since 1897, the Boston Athletic Association (B.A.A.) has managed this event."}, {"url": "https://en.wikipedia.org/wiki/Boston_Marathon", "passage_text": "During the 2013 Boston Marathon, on April 15, 2013 at 2:49 p.m. EDT, nearly three hours after the winners crossed the finish line, two explosions occurred about 200 yards (180 m) apart on Boylston Street, in approximately the last 225 yards (200 m) of the course. The race was halted, preventing many from finishing. It is one of six World Marathon Majors, and is one of four major events held in the United States through the years of both World Wars (Kentucky Derby, Rose Parade, and Westminster Kennel Club Dog Show are the others). Since 1897, the Boston Athletic Association (B.A.A.) has managed this event."}, {"url": "https://en.wikipedia.org/wiki/Boston_Marathon", "passage_text": "The Boston Marathon is an annual marathon hosted by several cities in greater Boston in eastern Massachusetts, United States. It is always held on Patriots' Day, the third Monday of April. It is one of six World Marathon Majors, and is one of four major events held in the United States through the years of both World Wars (Kentucky Derby, Rose Parade, and Westminster Kennel Club Dog Show are the others). Since 1897, the Boston Athletic Association (B.A.A.) has managed this event."}, {"url": "http://running.competitor.com/2014/05/news/boston-2015_100855", "passage_text": "About the only thing known for sure is that the 119th Boston Marathon will be held on Monday, April 20, 2015. As for everything else, the initial discussions about next year are already underway. But it’s unlikely the race will return with a field of approximately 36,000 runners in 2015. "}, {"url": "http://www.adventure-marathon.com/Boston-Marathon.aspx", "passage_text": "Page 1/2 Boston Marathon 2015/2016. The Boston Marathon is the oldest annual city marathon in the world, appearing for the first time in 1897. In this first version of the Boston Marathon only 18 runners entered the race, but the number of participants has increased steadily since then. The largest field of runners so far was in 1996, when over 35,000 people finished the 100th Boston Marathon. The Boston Marathon is one of five members of the World Marathon Majors, consisting of marathons in Berlin, Chicago, London and New York, apart from the one in Boston. For registration in the Boston Marathon and further information, please follow the link to the official site here."}, {"url": "http://www.baa.org/", "passage_text": "Moment 1. 1920 - Ashland Start. The Boston Marathon began in Ashland, Massachusetts from 1897 through 1923 then moved to Hopkinton for the 1924 race. The course was lengthened to 26 miles, 385 yards to conform to the Olympic standard, and the starting line was moved west from Ashland to Hopkinton"}]