[{"url": "http://lifestyle.iloveindia.com/lounge/benefits-of-groundnut-1944.html", "passage_text": "Benefits Of Groundnut. Groundnuts, also known as peanuts, are considered a very healthy snack. Groundnut is the member of the legume family and is native to regions like South America, Mexico and Central America. However, it is successfully grown in other parts of the world as well. Health Benefits Of Eating Groundnuts. 1  Groundnuts and groundnut products are very beneficial in the treatment of hemophilia and other such inherited blood disorders. 2  People suffering from nose bleeding also benefit from eating groundnuts and it is also helpful in reducing excessive menstruation bleeding in women."}, {"url": "http://lifestyle.iloveindia.com/lounge/benefits-of-groundnut-1944.html", "passage_text": "Throughout the world, they are known for their nutrition and health benefits. Peanuts or groundnuts are among the most common oil-seeds, since time immemorial. The nuts are rich with significant, beneficial nutrients that are essential for optimum health. Health Benefits Of Eating Groundnuts. 1  Groundnuts and groundnut products are very beneficial in the treatment of hemophilia and other such inherited blood disorders. 2  People suffering from nose bleeding also benefit from eating groundnuts and it is also helpful in reducing excessive menstruation bleeding in women."}, {"url": "http://www.seedguides.info/peanuts/", "passage_text": "Peanuts, popularly known as groundnuts, monkey nuts, pig nut s, etc belong to the Fabaceae (bean) family. Peanuts, Arachis hypogaea is a legume species, and native to South America, Mexico and Central America. In many parts of Africa, peanuts are more commonly known as groundnuts, a reference to the underground location favored by the pods. Peanuts play a vital nutritional role in many parts of Africa, since they are high in protein and healthy fats."}, {"url": "http://www.gardeningknowhow.com/ornamental/vines/groundnut-vine/how-to-grow-groundnuts.htm", "passage_text": "Groundnut Health Benefits. Groundnuts can be eaten raw but are usually boiled or roasted and then added to soups and stews. Mild in flavor, they are used much like a potato, though more nutritious. They contain three times the protein of a potato. They can also be stored much like potatoes in a cool, dry area for a lengthy period of time."}, {"url": "http://www.differencebetween.net/object/difference-between-groundnut-and-peanut/", "passage_text": "Peanuts are known by multiple names like earth nuts, groundnuts, monkey nuts and goober nuts. The term ‘monkey nuts’ is often used in common parlance to denote the peanut pod; the bambara variety of groundnut ripens under the ground. Groundnut vs. Peanut. A peanut is a kind of groundnut which belongs to the legume family. The family of groundnuts includes arachis villosulicarpa, bambara groundnut, peanut, hausa groundnut and others. The bambara groundnut belongs to the fabaceae family and is said to have originated in Western Africa."}, {"url": "https://en.wikipedia.org/wiki/Peanut", "passage_text": "Peanut, also known as groundnut (Arachis hypogaea) is a crop of global importance. It is widely grown in the tropics and subtropics, being important to both smallholder and large commercial producers. It is classified as both a grain legume, and, because of its high oil content, an oil crop. The botanical definition of a  nut  is a fruit whose ovary wall becomes very hard at maturity. Using this criterion, the peanut is not a nut, but rather a legume. However, for culinary purposes and in common English language usage, peanuts are usually referred to as nuts."}, {"url": "http://lifestyle.iloveindia.com/lounge/benefits-of-groundnut-1944.html", "passage_text": "Groundnuts, also known as peanuts, are considered a very healthy snack. Groundnut is the member of the legume family and is native to regions like South America, Mexico and Central America. Health Benefits Of Eating Groundnuts. 1  Groundnuts and groundnut products are very beneficial in the treatment of hemophilia and other such inherited blood disorders. 2  People suffering from nose bleeding also benefit from eating groundnuts and it is also helpful in reducing excessive menstruation bleeding in women."}, {"url": "http://health.wikinut.com/Health-Benefits-of-Groundnuts/bvxm3kh5/", "passage_text": "Posted in Wikinut Health Diet & Nutrition. Groundnuts, also known as peanuts, are considered a very healthy snack. Throughout the world, they are known for their nutritional value and health benefits. Peanuts or groundnuts are among the most common oil-seeds, since time immemorial. "}, {"url": "http://forest.mtu.edu/pcforestry/resources/studentprojects/groundnut.html", "passage_text": "Groundnuts are a staple food in many developing countries. Also called peanuts, groundnuts are a protein rich tuber that grows well in semi-arid regions. There are two main types of groundnuts: the American groundnut (Arachis hypogaea), and the African groundnut, the Bambara nut (Voandzeia subterranea). Both are grown in Western Africa as a protein source. Groundnuts also contain sufficient quantities of carbohydrates and fats. Groundnuts are often grown by small farm holders and is considered a woman's crop in Western Africa. This web page provides information on groundnut production programs in Africa. It focuses on how to mobilize women agricultural groups and can be used as an intial resource on groundnuts."}]