[{"url": "http://www1.salary.com/Entry-Level-Income-Marketing-Salaries.html", "passage_text": "The Marketing job titles listed on this page pay salaries that fall between Entry Level income level. These are considered to be Entry Level income jobs in the Marketing category. If you are not concerned with what category a job falls in you may wish to browse all jobs by salary range. If you are only concerned with Marketing jobs you may wish to browse Marketing jobs by salary range or browse all Marketing jobs."}, {"url": "http://www.simplyhired.com/salaries-k-entry-level-marketing-jobs.html", "passage_text": "Average Entry Level Marketing Salaries. The average salary for entry level marketing jobs is $62,000. Average entry level marketing salaries can vary greatly due to company, location, industry, experience and benefits. The entry level marketing salary comparisons feature allows job seekers to get the information required to make important career decisions and negotiate salary ranges. For additional entry level marketing salary information, we recommend visiting Payscale.com"}, {"url": "http://marketing.about.com/od/careersinmarketing/a/marketinginternships.htm", "passage_text": "1 You are going into marketing, you are asking for an internship or an entry level position and the competition is fierce. 2  You are going to have to stand out, so what will you do to show that you have what it takes to gain the attention of those that matter? 3  This piece is crucial. 1 Create a plan on how you will market yourself. 2  That's right, I said market yourself. 3 "}, {"url": "http://www.indeed.com/q-Entry-Level-Marketing-jobs.html", "passage_text": "Search Marketing Coordinator. The Marketing Coordinator is an entry level position that will assist account managers in the day-to-day planning and execution of paid search marketing for... Easily apply. 6 hours ago-save job-email-more... Charity Advertising and Marketing Partners is seeking a motivated, energetic team player for entry level customer service and public relations.... 19"}, {"url": "http://www.indeed.com/q-Entry-Level-Marketing-jobs.html", "passage_text": "1 View all Hynes Construction jobs in Ardmore, PA-Ardmore jobs. 2  Salary Search: Entry Level Marketing Position salaries in Ardmore, PA. 3  Learn more about working at Hynes Construction. Charity Advertising and Marketing Partners is seeking a motivated, energetic team player for entry level customer service and public relations.... 19 hours ago-save job-email-more..."}, {"url": "http://www.ehow.com/about_6677885_entry-level-marketing-job-description.html", "passage_text": "Entry-level marketing jobs require workers to design and create marketing strategies to increase sales and improve revenue. Entry-level marketers might design story boards or advertisements to promote specific products or services. As an entry-level marketer, you must create and maintain relationships with customers and industry professionals so clients choose your company to meet their marketing and advertising needs. Other People Are Reading."}, {"url": "http://work.chron.com/entry-level-marketing-job-description-24632.html", "passage_text": "Provide Customer Service. Most entry-level marketing positions will require interaction with customers or clients. Whether interaction is within the formal context of a professional office or within the casual environment of a retail setting, employees are expected to provide customer service. Entry-level marketing employees are expected to listen to customer needs and deliver a product or idea that can satisfy. For example, an advertising sales agent is expected to build relationships with clients and offer media products that can meet the client’s expectations."}, {"url": "http://work.chron.com/entry-level-marketing-job-description-24632.html", "passage_text": "Sell a Product, Service or Idea. Marketing is the act of selling a product or an idea. The act of selling transcends across multiple industries in entry-level marketing. For example, social media, telemarketing, territory sales and retail are each based on the principle of selling a product, service or idea. Entry-level marketing employees are expected to listen to customer needs and deliver a product or idea that can satisfy. For example, an advertising sales agent is expected to build relationships with clients and offer media products that can meet the client’s expectations."}]