[{"url": "http://wikitravel.org/en/Czech_Republic", "passage_text": "The Czech Republic (or informally Czechia) is a small landlocked country in Central Europe, situated south-east of Germany and bordering Austria to the south, Poland to the north and Slovakia to the south-east. "}, {"url": "https://en.wikipedia.org/wiki/Czech_Republic", "passage_text": "The Czech Republic (/ˈtʃɛk rɨˈpʌblɪk/ CHEK-rə-PUB-lik; Czech: Česká česká [republika ˈt͡ʃɛskaː]. ) ˈrɛpuˌblɪka is a landlocked country In Central europe bordered By germany to the, West austria to the, South slovakia to the east And poland to the. northeast On August 2015, Czech GDP growth was 4.4%, giving the Czech economy the highest growth rate in Europe. Unemployment rate is at 4.9%, giving the Czech Republic the second lowest unemployment rate in the European Union after Germany."}, {"url": "http://atlas.media.mit.edu/en/profile/country/cze/", "passage_text": "The top export destinations of the Czech Republic are Germany ($44.3B), Slovakia ($11.5B), Poland ($7.9B), France ($7.76B) and the United Kingdom ($7.46B). The top import origins are Germany ($37.1B), China ($15B), Poland ($10.7B), Slovakia ($8.68B) and Russia ($7.4B). The Czech Republic is the 30th largest export economy in the world and the 6th most complex economy according to the Economic Complexity Index (ECI). In 2013, the Czech Republic exported $150B and imported $141B, resulting in a positive trade balance of $9.3B."}, {"url": "http://www.eurail.com/europe-by-train/czech-republic", "passage_text": "The train is a common means of transportation in the Czech Republic. Most Czech cities, towns and many villages have train stations. They are interconnected well enough to make train travel a convenient way of getting from one place to another. International train services to the Czech Republic run from most points in Europe, with direct connections from Slovakia, Poland, Germany, Switzerland, Austria and Hungary. Categories of Czech trains from slow to fast: Osobni (Osobní) – os local train that stops (everywhere: Short). os "}, {"url": "http://www.everyculture.com/Cr-Ga/Czech-Republic.html", "passage_text": "Location and Geography. The area of the Czech Republic is 30,450 square miles (78,866 square kilometers), with Bohemia being twice as large as Moravia. The republic is bounded by Poland on the north, Germany on the northwest and southwest, Austria on the south, and the Slovak Republic on the east. The term Czech refers to the cultural characteristics of the Czech-speaking inhabitants of the Czech Republic (Česká česká), republika which Includes (Čechy), čechy the larger western, part And (Moravia), morava the eastern. part"}, {"url": "http://www.roughguides.com/destinations/europe/czech-republic/", "passage_text": "Sitting in the centre of Europe, with Germany to the east, Poland to the north, Slovakia to the east and Austria in the south, the Czech Republic has one foot in Western Europe, and one in the Slavic East. “Prague never lets you go”, said Franz Kafka, “this dear little mother has claws”. "}, {"url": "http://www.my-prague-sights.com/where-is-prague.html", "passage_text": "Prague is a short distance to other countries. Germany is the Czech Republic's closest neighboring country. It's just to the west (and north) of Prague. This map of the Czech Republic notes each neighboring country: Germany (DE), Poland (PL), Austria (AT) and Slovakia (SK). Prague is the capital and largest city of Czech Republic. It's located in Bohemia which is the western half of the country."}]