[{"url": "http://earthguide.ucsd.edu/eoc/teachers/t_tectonics/p_platetectonics.html", "passage_text": "The concept that describes and explains how the major features of the Earth form and/or deform. The essential processes of plate tectonics are 1)seafloor spreading and 2) subduction. These two processes operate on basic units called plates. Key surface features such as mountain ranges form in particular tectonic settings when these processes act on plates directly or indirectly. "}, {"url": "https://en.wikipedia.org/wiki/Plate_tectonics", "passage_text": "The lithosphere, which is the rigid outermost shell of a planet (the crust and upper mantle), is broken up into tectonic plates. The Earth's lithosphere is composed of seven or eight major plates (depending on how they are defined) and many minor plates. Where the plates meet, their relative motion determines the type of boundary: convergent, divergent, or transform. Earthquakes, volcanic activity, mountain-building, and oceanic trench formation occur along these plate boundaries. The lateral relative movement of the plates typically ranges from zero to 100 mm annually."}, {"url": "http://www.ucmp.berkeley.edu/geology/tecmech.html", "passage_text": "Plate Tectonics: The Mechanism. The main features of plate tectonics are: 1  The Earth's surface is covered by a series of crustal plates. 2  The ocean floors are continually moving, spreading from the center, sinking at the edges, and being regenerated. "}, {"url": "http://hkss.cedd.gov.hk/hkss/eng/education/GS/eng/hkg/chapter2.htm", "passage_text": "Plate Tectonics-Formidable Forces. Plate tectonics is the fundamental mechanism that drives geological processes in the geosphere. Plate tectonic theory is based on an understanding of the Earth's internal structure, the different types of tectonic plates and plate boundaries, and the driving forces of plate movements. Plate tectonics is a process that maintains the surface of the Earth in a dynamic and active state. Consequently, it drives such processes as: 1  Magmatism: the primary way in which new elements and new materials are transported as molten rock (magma) from the mantle to the crust."}, {"url": "http://earthguide.ucsd.edu/eoc/teachers/t_tectonics/p_seafloorspreading.html", "passage_text": "1 Seafloor spreading is one of the two major processes of plate tectonics, the other being subduction. 2  Seafloor spreading is the continuous process of forming new igneous rock at midocean ridges by injection of magma that forms new seafloor. "}, {"url": "http://australianmuseum.net.au/plate-tectonic-processes", "passage_text": "The lithosphere consists of rigid plates on a non-rigid subsurface (from approximately 70 km - 700 km in depth). Tectonic processes mostly take place at the plate edges. A plate moves as a single entity along the surface of the Earth over a plastic mantle. 1 It is made of both the crust and the uppermost part of the upper mantle. 2  Under oceanic crust it extends down to 70 km, while under continental crust it extends down to 150 km. 3  The word lithos is Greek for rock. 4  Asthenosphere: this starts with a sharp decrease in shear strength known as the Low Velocity Zone (LVZ)."}, {"url": "http://australianmuseum.net.au/plate-tectonic-processes", "passage_text": "Since the 1950s, several discoveries have led to a new understanding of how the Earth works. This includes Plate Tectonics, which explains the structure of the Earth's lithosphere (outer shell) and the forces that drive changes in its structure. Tectonics comes from the Greek word tekton, meaning builder. 1 It is made of both the crust and the uppermost part of the upper mantle. 2  Under oceanic crust it extends down to 70 km, while under continental crust it extends down to 150 km. 3  The word lithos is Greek for rock. 4  Asthenosphere: this starts with a sharp decrease in shear strength known as the Low Velocity Zone (LVZ)."}, {"url": "http://www.tulane.edu/~sanelson/eens1110/pltect.pdf", "passage_text": "Plate Tectonics By combining the sea floor spreading theory with continental drift and information on global seismicity, the new theory of Plate Tectonics became a coherent theory to explain crustal movements.Plates are composed of lithosphere, about 100 km thick, that float on the ductile asthenosphere. "}]