[{"url": "http://www.wisegeek.com/what-does-a-telecommunications-director-do.htm", "passage_text": "Top 10 unbelievable historical concurrencies. A telecommunications director generally is responsible for the planning and design of an organization’s telecommunication system which is comprised of voice services, data networks, and communication systems. The director usually takes into account present, as well as projected, volume of an organization’s communications. She then considers the efficiency and sufficiency of the present telecommunications system and makes recommendations for change."}, {"url": "http://www.ehow.com/about_6544430_telecommunication-manager-job-description.html", "passage_text": "Telecommunication managers have strong project management skills. When a bank wants to install a computer network that works across all its branches, for example, managers coordinate the purchase, installation and testing of equipment and systems, and ensure the projected is completed on time and on budget. The work of telecommunication managers goes beyond ensuring the efficiency of an organization’s telecommunication infrastructure."}, {"url": "http://www.payscale.com/research/US/Job=Telecommunications_Manager/Salary", "passage_text": "Telecommunications Managers in the United States tend to be well-versed in their field, and roughly four in five have more than 10 years of experience. Total incomes of Telecommunications Managers incorporate potential for, in a few cases, more than $15K from bonuses and close to $30K from profit sharing; these performance components cause packages to range between $48K and $118K."}, {"url": "https://en.wikipedia.org/wiki/Telecommunications_network", "passage_text": "A telecommunications network is a collection of terminal nodes, links are connected so as to enable telecommunication between the terminals. Computer networks can range from a local network area to a wide area network. The difference between the types of networks is the size. These types of computer networks work at certain speeds, also known as broadband. The Internet network connects computers worldwide."}, {"url": "http://www.wisegeek.com/what-does-a-telecommunications-director-do.htm", "passage_text": "It is also her duty to coordinate with vendors of products and providers of services related to telecommunications. The telecommunications director usually is also responsible for allocating resources to each office or department. She directs the preparation of equipment specifications and floor plans for installation of equipment. The director usually takes into account present, as well as projected, volume of an organization’s communications. She then considers the efficiency and sufficiency of the present telecommunications system and makes recommendations for change."}, {"url": "http://www.payscale.com/research/US/Job=Telecommunications_Manager/Salary", "passage_text": "Read More... Telecommunications managers work with of all forms of telecommunications technology and the workers who maintain and implement them. A Telecommunications manager may be responsible for managing work related to telephone, computer or wireless networks depending on the specific position. Total incomes of Telecommunications Managers incorporate potential for, in a few cases, more than $15K from bonuses and close to $30K from profit sharing; these performance components cause packages to range between $48K and $118K."}, {"url": "http://www.documents.dgs.ca.gov/DGS/Approved_DGS_DDT.pdf", "passage_text": "business of public safety services. COMPENSATION AND BENEFITS The salary for the Deputy Director, Telecommunications Division, is open and negotiable depending upon the skills and qualifications of the successful candidate. The Deputy Director is a Governor’s Office appointee. The Deputy Director receives direction from the Director of the Department of General Services, and operationally reports through the Department’s Chief Deputy Director. The Deputy Director’s office is located in Sacramento, California."}, {"url": "http://www1.salary.com/Telecommunications-Salaries.html", "passage_text": "Well there are a wide range of jobs in the Telecommunications category and their pay varies greatly. If you know the pay grade of the job you are searching for you can narrow down this list to only view Telecommunications jobs that pay less than $30K, $30K-$50K, $50K-$80K, $80K-$100K, or more than $100K. If you are unsure how much your Telecommunications job pays you can choose to either browse all Telecommunications salaries below or you can search all Telecommunications salaries. Other related categories you may wish to browse are Consulting Services jobs and IT -- Networking jobs. jobs in. industry."}, {"url": "http://www.wisegeek.com/what-does-a-telecommunications-director-do.htm", "passage_text": "Duties of a telecommunications director usually include obtaining information on new equipment and system developments, acquisition and installation costs, adaptability to the existing system, and expected resulting improvement to the system. The director usually takes into account present, as well as projected, volume of an organization’s communications. She then considers the efficiency and sufficiency of the present telecommunications system and makes recommendations for change."}, {"url": "http://www.telecomsjobsource.co.uk/jobs/telecommunications/marketing", "passage_text": "Devise Marketing Director We are currently recruiting for our client, a prestigious telecommunications company, for an Devise Marketing Director to join their business in Philippines.... Find Marketing jobs in the Telecommunications industry. Search and apply today. If you'd rather take a back seat in your job hunt then register with telecomsjobsource.co.uk, upload your CV and let Telecommunications recruiters find you."}]