[{"url": "https://en.wikipedia.org/wiki/Muscarinic_acetylcholine_receptor", "passage_text": "Muscarinic acetylcholine receptors, or mAChRs, are acetylcholine receptors that form G protein-receptor complexes in the cell membranes of certain neurons and other cells."}, {"url": "https://en.wikipedia.org/wiki/Muscarinic_acetylcholine_receptor", "passage_text": "Like the M 1 and M 3 muscarinic receptor, M 5 receptors are coupled with G proteins of class Gq that upregulate phospholipase C and, therefore, inositol trisphosphate and intracellular calcium as a signaling pathway."}, {"url": "http://pharmacologycorner.com/acetylcholine-receptors-muscarinic-and-nicotinic/", "passage_text": "Nicotinic receptors. Unlike muscarinic receptors (which are G-protein coupled receptors), nicotinic receptors are ligand-gated ion channels. When bound to acetylcholine, these receptors undergo a conformational change that allows the entry of sodium ions, resulting in the depolarization of the effector cell."}, {"url": "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC2643856/", "passage_text": "1, muscarinic receptors are composed of seven transmembrane helical domains connected by three extracellular and three intracellular loops. Initially, on the basis of pharmacological selective affinity to the muscarinic agonist pirenzepine, two subtypes of muscarinic receptors, M 1 R and M 2 R, were described (61). In 1987, using molecular cloning techniques, Bonner et al. (14) described five muscarinic receptor subtypes (M 1 R–M 5 R)."}, {"url": "http://medical-dictionary.thefreedictionary.com/Muscarinic+receptors", "passage_text": "muscarinic receptors. cholinergic receptors of autonomic effector cells (and also on some autonomic ganglion cells and some central neurons) that are stimulated by muscarine and parasympathomimetic drugs and antagonized by atropine."}, {"url": "http://www.sigmaaldrich.com/technical-documents/articles/biology/rbi-handbook/non-peptide-receptors-synthesis-and-metabolism/acetylcholine-muscarinic-receptor.html", "passage_text": "Muscarinic acetylcholine receptors are members of the superfamily of G protein-coupled receptors (GPCRs). They are relatively abundant and mediate many of the diverse actions of acetylcholine in the CNS, as well as throughout non-nervous tissues innervated by the parasympathetic nervous system."}, {"url": "http://www.guidetopharmacology.org/GRAC/FamilyIntroductionForward?familyId=2", "passage_text": "Muscarinic receptor physiological role. The role of muscarinic receptors in the contraction of smooth muscle, particularly of airway, ileum, iris and bladder, are considered a classical muscarinic response mediated primarily by M 3 -muscarinic receptors expressed on the smooth muscle cells [ 8, 11 ]."}]