[{"url": "http://home.costhelper.com/locksmith.html", "passage_text": "1 The cost of having a locksmith make a house call when you've locked yourself out of your home or vehicle varies considerably depending on location, type of lock and time of day, but starts with a minimum charge (also called a mobile fee) of $35-$150 for coming to you."}, {"url": "http://home.costhelper.com/door-lock.html", "passage_text": "1 (The cost per lock will depend on the type of lock and the prevailing rates in your area.) For a typical home with four locks it can run anywhere from $60-$200, and costs can be even higher if the work is done off-hours, in the evening or on a weekend."}, {"url": "http://www.answers.com/Q/What_is_cost_to_change_the_locks_on_a_home", "passage_text": "The price for a locksmith will vary depending on the area you live in and what type of lock you're working with, but on average the national hourly rate for a locksmith is $50 … -$60 per hour. Most locksmiths also charge a service call to get to you house with their equipment as well as a per lock charge."}, {"url": "http://home.costhelper.com/door-lock.html", "passage_text": "1 To have a locksmith come to your home and install new locks, there's usually a minimum fee of $40-$100 plus a labor charge of $20-$30, for a total of $120-$220 for just the labor for a home with four locks (you supply the new hardware)."}, {"url": "http://home.costhelper.com/door-lock.html", "passage_text": "1 For a home with four locks (both a doorknob and a deadbolt lock on the front and back entry doors) it will run $20-$60. 2  Call ahead (before removing the cylinders) to be sure someone will be available that day to re-key your locks, and that they will re-key your particular brand and model of lock."}, {"url": "http://home.costhelper.com/locksmith.html", "passage_text": "1 Having the locksmith rekey or replace the locks adds to the total cost. 2  Locksmiths typically charge $1.50-$4 to copy a standard key, but they may charge $3-$20 or more for specialized keys, and it can be $50-$175 for vehicle keys with an electronic or transponder chip."}, {"url": "http://home.costhelper.com/door-lock.html", "passage_text": "1 Buying basic locks and installing them yourself runs around $15-$50 per lock, or $60-$200 for four locks on a typical home, depending on the quality and style of the locks. 2  Except to pay at the higher end of the scale if you have all the locks keyed to operate with one key, instead of a separate key for each lock."}, {"url": "http://calocksmith.net/the-cost-of-changing-the-locks-on-a-house/", "passage_text": "The minimum base cost can range from $50 to $100. Each keyhole will run between $15 and $25 on top of the base cost, so a home with four keyholes will pay between $110 and $200 for basic locks."}, {"url": "http://www.answers.com/Q/How_much_does_it_cost_to_have_a_locksmith_change_house_locks", "passage_text": "The price for a locksmith will vary depending on the area you live in and what type of lock you're working with, but on average the national hourly rate for a locksmith is $50-$60 per hour. Most locksmiths also charge a service call to get to you house with their equipment as well as a per lock charge."}]