[{"url": "http://www.bibliotecapleyades.net/ciencia/ciencia_agua19.htm", "passage_text": "Alkalinity is a measure of the capacity of water to neutralize acids. It measures the presence of carbon dioxide, bicarbonate, carbonate, and hydroxide ions that are naturally present in water. At normal drinking water pH levels, bicarbonate, and carbonate are the main contributors to alkalinity. Alkalinity is a measure of the buffering capacity of water-its ability to resist sudden changes in pH. pH is a measure of how acidic or basic water is. Alkalinity is the water s capacity to resist changes in pH that would make the water more acidic."}, {"url": "http://www.bibliotecapleyades.net/ciencia/ciencia_agua19.htm", "passage_text": "When we eat food and drink water, especially alkaline water, the pH value inside the stomach goes up. When this happens, there is a feedback mechanism in our stomach to detect this and commands the stomach wall to secrete more hydrochloric acid into the stomach to bring the pH value back to 4. Alkalinity is a measure of the buffering capacity of water-its ability to resist sudden changes in pH. pH is a measure of how acidic or basic water is. Alkalinity is the water s capacity to resist changes in pH that would make the water more acidic."}, {"url": "http://water-research.net/index.php/the-role-of-alkalinity-citizen-monitoring", "passage_text": "Alkalinity is a measure of how much acid can be added to a liquid without causing a large change in pH. Higher alkalinity levels in surface waters will buffer acid rain and other acid wastes and prevent pH changes that are harmful to aquatic life. If increasing amounts of acids are added to a body of water, the water's buffering capacity is consumed. If additional buffering material can be obtained from surrounding soils and rocks, the alkalinity level may eventually be restored."}, {"url": "http://www.safewater.org/PDFS/communitywatertestkit/Water_Quality_Tests.pdf", "passage_text": "It is important that there is a good balance to the alkalinity of our water. In Canada, the recommended range of alka-linity is 80-120 ppm or parts per million. If the levels are higher or lower than this, there can be problems with water quality. Alkalinity of water is due to the presence of certain ions: carbonates, bicarbonates, and hydroxides (often referred to as alkaline salts). Bicarbonates are the most common cause of alkalinity and are found in almost all natural water sources, as are carbonates."}, {"url": "http://www.safewater.org/PDFS/communitywatertestkit/Water_Quality_Tests.pdf", "passage_text": "The ideal pH range for water is between 7.2 and 7.6. This means that the water is slightly basic. By maintaining the proper alkalinity of water, the pH will stay around the ideal levels. However, if the alkalin-ity gets too low, the pH can start to deviate and can begin to cause water quality problems. Alkalinity of water is due to the presence of certain ions: carbonates, bicarbonates, and hydroxides (often referred to as alkaline salts). Bicarbonates are the most common cause of alkalinity and are found in almost all natural water sources, as are carbonates."}, {"url": "http://www.safewater.org/PDFS/communitywatertestkit/Water_Quality_Tests.pdf", "passage_text": "Water with high alkalinity has a soda-like taste, can dry out skin and can cause scaling on fixtures and throughout water distribution systems. This scaling is undesirable because it begins to decrease the efficiency of plumbing systems, which results in greater power consumption and increased costs. Alkalinity of water is due to the presence of certain ions: carbonates, bicarbonates, and hydroxides (often referred to as alkaline salts). Bicarbonates are the most common cause of alkalinity and are found in almost all natural water sources, as are carbonates."}, {"url": "http://www.thirteen.org/edonline/studentstake/water/schoolwater/alkalinity/alkalinity.htm", "passage_text": "Alkalinity is important to have in our school water because if water is alkalinity free it is more likely to be prone to be acidic. Alkalinity helps the water stay stable in pH. It is essential for us drink clean water for health reason, plus us teens need water for our daily diet :). Read to learn more about alkalinity and if it's found in our school water."}, {"url": "http://www.livestrong.com/article/370249-what-are-the-dangers-in-drinking-alkaline-water/", "passage_text": "Tap water is processed to create alkaline water. Photo Credit TongRo Images/TongRo Images/Getty Images. Alkaline water is generally considered safe, but it has the potential to produce side effects. It can reduce stomach acid, which may sound like a benefit if you have acid reflux. However, for most healthy people, low levels of stomach acid are likely to cause problem"}, {"url": "http://www.thirteen.org/edonline/studentstake/water/schoolwater/alkalinity/alkalinity.htm", "passage_text": "Alkalinity acts as a buffer if any changes are made to the water's pH value. The Alkalinity in the water will help keep the water's pH stabilized. The drinking water and all water should be a pH of 7 meaning that it's neutral. High alkalinity is good to have in our drinking water because it keeps the water safe for us to drink. The amount of Alkalinity that should be in our water is 20-200 mg/L for typical drinking water. Alkalinity is basically dissolved minerals in the water that help neutralize the water we drink. Alkalinity helps the water stay stable in pH. It is essential for us drink clean water for health reason, plus us teens need water for our daily diet :). Read to learn more about alkalinity and if it's found in our school water."}, {"url": "http://www.safewater.org/PDFS/communitywatertestkit/Water_Quality_Tests.pdf", "passage_text": "If the alkalinity is too low, the ability of your water to resist pH changes decreases. This means that the pH will yo-yo up and down, changing from acidic to basic fairly rapidly. Water with low alkalinity can also be corrosive and can irritate the eyes. Alkalinity of water is due to the presence of certain ions: carbonates, bicarbonates, and hydroxides (often referred to as alkaline salts). Bicarbonates are the most common cause of alkalinity and are found in almost all natural water sources, as are carbonates."}]