[{"url": "http://www.longisland.com/long-island.html", "passage_text": "Totaling 1,377 square miles of land area, Long Island New York is divided into four counties: Kings (Brooklyn), Queens, Nassau, and Suffolk. Suffolk is the easternmost and by far the largest of the four, covering an expanse of 911 square miles."}, {"url": "http://www.discoverlongisland.com/", "passage_text": "Long Island, New York. Whether you choose a barefoot walk on the beach…an adventuresome climb atop a famous lighthouse …an afternoon sampling the latest vintages at a local vineyard …or touring the stately halls and gardens of the Long Island, New York Gold Coast mansions ...Long Island, NY has it all."}, {"url": "http://www.longisland.com/long-island.html", "passage_text": "About Long Island. Long Island New York is the largest island adjoining the contiguous United States, extending approximately 118 miles east-northeast from the mouth of the Hudson River. It is separated from the mainland on the north by the Long Island Sound and bounded by the Atlantic Ocean on the south and east."}, {"url": "http://www.bahamas.com/islands/long", "passage_text": "Long Island. Breathtaking cliffs, brilliant coral reefs, serene beaches. Long Island is home to it all. Featuring dramatic cliffs that tower over its eastern shore, the island is a haven for fishers, divers and boaters, boasting world-class bonefishing and thrilling encounters with sea life. The island’s western shore is a bit more tranquil."}, {"url": "http://www.longisland.com/long-island.html", "passage_text": "To the north of the island is Long Island Sound, which separates it from the coast of Connecticut and Rhode Island. To the south are the Great South Bay, South Oyster Bay, and Jamaica Bay, which are actually lagoons, protected from the Atlantic Ocean by a string of narrow barrier islands, most notably Fire Island."}, {"url": "http://wikitravel.org/en/Long_Island", "passage_text": "For other places with the same name, see Long Island (disambiguation). Long Island is an island stretching eastward from New York City in the Metro New York region. The largely suburban area is approximately 115 miles long from Brooklyn and Queens at the western end, to Montauk at the easternmost point. At its widest the island is approximately 20 miles from north to south."}, {"url": "http://www.discoverlongisland.com/", "passage_text": "Explore Long Island, New York by county or visit one of our four regions including the North Shore, South Shore, North Fork or South Fork."}]