[{"url": "http://www.webmd.com/drugs/2/drug-16568/piperacillin-tazobactam-intravenous/details", "passage_text": "Uses. This medication is used to treat a wide variety of bacterial infections. This medication is a combination of 2 drugs. Piperacillin is a penicillin-type antibiotic that works by stopping the growth of bacteria. How to use piperacillin-tazobactam intravenous. This medication is given by injection into a vein as directed by your doctor, usually every 6 hours. It should be injected slowly over at least 30 minutes. The dosage is based on your medical condition, age, weight, and response to treatment."}, {"url": "http://www.accessdata.fda.gov/drugsatfda_docs/label/2012/050684s055s061_050750s016s020lbl.pdf", "passage_text": "ZOSYN (piperacillin and tazobactam for injection, USP) is supplied as a powder in the. pharmacy bulk vial as follows: 40.5 g pharmacy bulk vial containing piperacillin sodium equivalent to 36 grams of piperacillin. and tazobactam sodium equivalent to 4.5 grams of tazobactam. "}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMHT0011750/?report=details", "passage_text": "Uses of This Medicine. Piperacillin and tazobactam injection is used to treat bacterial infections in many different parts of the body. Piperacillin and tazobactam combination is an antibiotic that belongs to the group of medicines known as penicillins and beta-lactamase inhibitors. "}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/24277036", "passage_text": "Evaluation of vancomycin in combination with piperacillin-tazobactam or oxacillin against clinical methicillin-resistant Staphylococcus aureus Isolates and vancomycin-intermediate S. aureus isolates in vitro. Dilworth TJ(1), Sliwinski J, Ryan K, Dodd M, Mercier RC. "}, {"url": "http://www.rxlist.com/zosyn-drug/indications-dosage.htm", "passage_text": "INDICATIONS. ZOSYN is a combination product consisting of a penicillin-class antibacterial, piperacillin, and a β- lactamase inhibitor, tazobactam, indicated for the treatment of patients with moderate to severe infections caused by susceptible isolates of the designated bacteria in the conditions listed below. "}, {"url": "http://www.everydayhealth.com/drugs/zosyn", "passage_text": "Zosyn is a combination medication that contains two drugs, piperacillin and tazobactam. Piperacillin is an antibiotic, and tazobactam is a beta-lactamase inhibitor, which prevents resistance to the antibiotic. Zosyn is used to treat a variety of bacterial infections, including pneumonia, appendicitis, E. coli, pelvic inflammatory disease, and postpartum endometritis. Zosyn (Piperacillin Tazobactam) Dosage. Zosyn is typically given three to four times a day (or once every 6 hours) over 30 minutes through an IV solution that drips through a needle or catheter in the vein or is infused by a pump. Zosyn is usually given for 7 to 10 days."}, {"url": "http://www.webmd.com/drugs/2/drug-16577/zosyn-intravenous/details", "passage_text": "Uses. This medication is used to treat a wide variety of bacterial infections. This medication is a combination of 2 drugs. Piperacillin is a penicillin-type antibiotic that works by stopping the growth of bacteria. How to use Zosyn intravenous. This medication is given by injection into a vein as directed by your doctor, usually every 6 hours. It should be injected slowly over at least 30 minutes. The dosage is based on your medical condition, age, weight, and response to treatment"}]