[{"url": "http://www.healthline.com/human-body-maps/external-oblique-muscle", "passage_text": "The external oblique muscle is one of the largest parts of the trunk area. Each side of the body has an external oblique muscle. The external oblique muscle is one of the outermost abdominal muscles, extending from the lower half of the ribs around and down to the pelvis."}, {"url": "http://www.innerbody.com/image_musfov/musc14-new.html", "passage_text": "The external abdominal obliques are a pair of broad, thin, superficial muscles that lie on the lateral sides of the abdominal region of the body. Contraction of these muscles may result in several different actions, but they are best known for their lateral flexion and rotation of the trunk known as a side bend."}, {"url": "http://www.healthline.com/human-body-maps/internal-oblique", "passage_text": "The internal abdominal oblique muscle ends at the bottom edge of the rib cage, the rectus sheath (fibrous tissue that covers the abdominal muscles), and the pubic crest (an area in the lower-front of the pelvis). The internal abdominal oblique muscle is located closer to the skin than the transverse abdominal muscle. This muscle supports the abdominal wall, assists in forced respiration, aids in raising pressure in the abdominal area, and rotates and turns the trunk with help from other muscles."}, {"url": "http://getfit.jillianmichaels.com/abdominal-internal-oblique-exercises-2190.html", "passage_text": "The rectus abdominis, transverse abdominis, external oblique and the internal oblique make up the abdominal muscles. The internal obliques are located just underneath the external obliques and allow you to bend from the side, as well as twist your torso."}, {"url": "https://www.sharecare.com/health/types-of-exercise-programs/what-my-oblique-muscles-do", "passage_text": "Your have external obliques and internal obliques. The external oblique is the largest muscle closest to the surface on your side. Its main job is to pull the chest downwards and compress the abdominal cavity. The internal obliques, on the other hand, have two main jobs."}, {"url": "http://getfit.jillianmichaels.com/abdominal-internal-oblique-exercises-2190.html", "passage_text": "Side crunches target the internal and external obliques. Lie on your back with your knees bent. Rotate hips and knees until both knees are turned to the right side and touching the ground. Lift your shoulder blades off the floor and exhale as you come up."}]