[{"url": "http://www.cookapalooza.org/2012/05/marinated-boneless-chicken-thighs-good.html", "passage_text": "1/4 tsp each salt and pepper. Dash or two of hot sauce. 12 boneless, skinless chicken thighs (approx. 2.5 lbs / 1 kg). To make marinade, in a small bowl combine lime juice, oil, molasses, soy sauce, cinnamon, garlic, onions, salt, pepper and hot sauce. Place chicken thigh in a large resealable plastic bag. Add marinade, seal bag and turn several times to coat chicken. Marinate for at least 2 hours."}, {"url": "http://www.foodnetwork.com/recipes/marc-forgione/marinated-chicken-thighs-recipe.html#!", "passage_text": "Mix the parsley, thyme, rosemary, garlic, shallots, black peppercorns and pink peppercorns together in a bowl. Add the olive oil to cover the herbs/spices. Set aside 2 tablespoons of the marinade. Place the chicken thighs in a resealable plastic bag. Add the marinade and marinate overnight in the refrigerator. Preheat the grill to medium. Remove the chicken thighs from the marinade, pat with a paper towel and place, fleshy-side down, on the hot grill. Grill until cooked through, turning once, 7 to 8 minutes per side. Finish with the reserved 2 tablespoons of marinade and some flaky salt. Serve on top of your favorite salad. "}, {"url": "http://ifoodblogger.com/killer-chicken-thigh-marinade/", "passage_text": "Now, you can mix the ingredients up, cover chicken thighs, marinate for 30 minutes and bake, and they will taste quite good. But if you let them marinate in a fridge for a few hours or even longer, say overnight, they will blow your mind with intense, deep and complex flavors, and tender and juicy meat. 1 Add the chicken and make sure that every piece is covered evenly. 2  Marinate in a fridge for at least 30 minutes to 2 hours or, better yet, overnight. 3  Preheat oven to 450 degrees F. 4  Place the chicken and all of the marinade in a baking dish."}, {"url": "http://natashaskitchen.com/2014/04/25/juicy-barbecued-chicken-thighs-recipe/", "passage_text": "Marinating the Meat: 1. Season both sides of chicken thighs to taste. I used a total of 1 tsp sea salt, 1/4 tsp pepper, 1 tsp Mrs. Dash Seasoning, 1/2 tsp garlic powder. Turn the chicken to coat evenly with seasoning. "}, {"url": "http://ifoodblogger.com/killer-chicken-thigh-marinade/", "passage_text": "How long to cook chicken thighs really depends on the size of the thighs and the oven temperature, but if you use bone-in, skin on thighs and bake at 450 degrees F, they will reach 165 degrees F internal temperature and be ready in about 25-30 minutes. 1 Add the chicken and make sure that every piece is covered evenly. 2  Marinate in a fridge for at least 30 minutes to 2 hours or, better yet, overnight. 3  Preheat oven to 450 degrees F. 4  Place the chicken and all of the marinade in a baking dish."}, {"url": "http://www.marthastewart.com/340992/roasted-chicken-thighs", "passage_text": "Directions. In a bowl, toss chicken thighs with olive oil and lemon juice; season with salt and pepper and marinate 1 hour (or up to a day). Preheat oven to 375 degrees. Roast chicken, skin side down, in an oiled roasting pan, 20 to 25 minutes; flip and roast 10 more minutes. Watch: How to Gauge When Meat Is Cooked. "}, {"url": "http://allrecipes.com/recipe/138118/delectable-marinated-chicken/", "passage_text": "1 Coat chicken thighs with the marinade, seal, and marinate for 4 hours in the refrigerator, redistributing the chicken in the marinade occasionally. 2  Preheat an outdoor grill for medium heat. "}, {"url": "http://www.marthastewart.com/1074133/grilled-marinated-chicken-thighs", "passage_text": "Preheat grill to medium-high. Combine lemon juice, oil, garlic, and herbs in a baking dish. Season chicken with salt and pepper and grill, turning frequently, until cooked through, about 10 minutes. Transfer to baking dish and turn to coat with marinade. Serve immediately, or refrigerate chicken in marinade up to 1 day, turning to coat a few times. "}, {"url": "http://www.wikihow.com/Cook-Chicken-Thighs", "passage_text": "1 If you are unsure of how much salt and pepper to use, start with roughly 1/4 tsp (1.25 ml) salt and 1/8 tsp (0.625 ml) black pepper. 2  Use a basting brush to brush the olive oil over the chicken for a more thorough coating. 3  The oil helps the chicken to stay moist and to brown in the oven. Sprinkle the chicken with salt and pepper and allow it to sit in the buttermilk for at least 2 hours. 1  The salt and pepper should be to taste, but if you aren't sure how much to use, start with 1/4 tsp (1.25 ml) salt and 1/8 tsp (0.625 ml) black pepper. 2  Make sure that the chicken is in a nonreactive bowl."}, {"url": "http://ifoodblogger.com/killer-chicken-thigh-marinade/", "passage_text": "1 Marinate in a fridge for at least 30 minutes to 2 hours or, better yet, overnight. 2  Preheat oven to 450 degrees F. 3  Place the chicken and all of the marinade in a baking dish. 4  Bake uncovered at 450 degrees F for 25-30 minutes with the skin side up, until the internal temperature reaches 165°F. 1 Add the chicken and make sure that every piece is covered evenly. 2  Marinate in a fridge for at least 30 minutes to 2 hours or, better yet, overnight. 3  Preheat oven to 450 degrees F. 4"}]