[{"url": "http://health.howstuffworks.com/human-body/systems/immune/immune-system3.htm", "passage_text": "Viral and bacterial infections are by far the most common causes of illness for most people. They cause things like colds, influenza, measles, mumps, malaria, AIDS and so on. The job of your immune system is to protect your body from these infections. The immune system protects you in three different ways: 1  It creates a barrier that prevents bacteria and viruses from entering your body."}, {"url": "http://www.youtube.com/watch?v=zQGOcOUBi6s", "passage_text": "Every second of your life you are under attack. Bacteria, viruses, spores and more living stuff wants to enter your body and use its resources for itself. The immune system is a powerful army of cells that fights like a T-Rex on speed and sacrifices itself for your survival. Without it you would die in no time. "}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/22397569", "passage_text": "The immune response to severe bacterial infections: consequences for therapy. Giamarellos-Bourboulis EJ, Raftogiannis M. The immune response to a bacterial stimulus starts when pathogen-associated molecular patterns of the bacterial pathogens activate pattern recognition receptors of the innate immune system."}, {"url": "http://bitesized.immunology.org/pathogens-and-disease/immune-responses-to-bacteria/", "passage_text": "Immune proteins like acute phase proteins (like complement) and antibodies bind to the surface of bacteria by a process called opsonisation. Opsonised bacteria are, therefore, coated with molecules that phagocytic cells recognise and respond to. The alternative complement pathway does not require antibody to initiate the lysis of bacteria. In this pathway, complement proteins from a complex known as C3 directly bind to bacteria and activate downstream components in the complement cascade, once again ending in formation of MAC that causes lysis of the bacterium."}, {"url": "http://bitesized.immunology.org/pathogens-and-disease/immune-responses-to-bacteria/", "passage_text": "Via complement-mediated lysis. When bacteria, such as Neisseria meningitidis, invade the body, they are attacked by immune proteins called complement proteins. Complement proteins assist in bacterial killing via three pathways, the classical complement pathway, the alternative complement pathway or the lectin pathway. The alternative complement pathway does not require antibody to initiate the lysis of bacteria. In this pathway, complement proteins from a complex known as C3 directly bind to bacteria and activate downstream components in the complement cascade, once again ending in formation of MAC that causes lysis of the bacterium."}, {"url": "http://www.lehigh.edu/~jas0/V09.html", "passage_text": "Virus infection in vertebrates results in two general types of immune response. The first is a rapid-onset innate response against the virus, which involves the synthesis of proteins called interferons and the stimulation of natural killer lymphocytes. IMMUNE RESPONSE TO VIRAL INFECTION. Until now, we have concerned ourselves with the molecular details of how viruses replicate in our cells to produce hundreds of progeny per cell."}, {"url": "https://en.wikipedia.org/wiki/Immune_response", "passage_text": "Inflammation is one of the first responses of the immune system to infection. The symptoms of inflammation are redness, swelling, heat, and pain, which are caused by increased blood flow into tissue. Inflammation is produced by eicosanoids and cytokines, which are released by injured or infected cells. Some bacteria form biofilms to protect themselves from the cells and proteins of the immune system. Such biofilms are present in many successful infections, e.g., the chronic Pseudomonas aeruginosa and Burkholderia cenocepacia infections characteristic of cystic fibrosis."}, {"url": "http://www.biology.arizona.edu/immunology/tutorials/AIDS/response.html", "passage_text": "The immune system protects the body from invading disease-causing organisms, or pathogens. Pathogens and other non-self molecules are antigens  foreign molecules recognized by the immune system, stimulating an immune response. The majority of infections by pathogens occurs in mucous membranes of our body."}, {"url": "http://www.textbookofbacteriology.net/innate.html", "passage_text": "The immune system and the adaptive or specific immune system. The innate immune system is a primary defense mechanism against invading organisms, while the adaptive immune system acts as a second line of defense. Both aspects of the immune system have cellular and humoral components by which they carry out their protective functions. In addition, there is interplay between these two systems, i.e., cells or components of the innate immune system influence the adaptive immune system and vice versa."}, {"url": "http://www.lsic.ucla.edu/classes/mimg/spring_05/mimgc106/b_IMMUNERESPONSE_3.pdf", "passage_text": "Some of these cytokines recruit moreinflammatory cells to the site of infection (from M φ: IL-1, IL-6,IL-8).• Some of these cytokines are involved with the initiation of“Specific Adaptive Immunity” (from Mφ: IL-1, IL-6, IL-10,IL-12). INDUCED BUT NON-ADAPTIVE IMMUNEMECHANISMS. These bacterial molecules(pathogen associated molecular patterns; PAMPs) bind to TLRreceptors on Mφ, PMNs, epithelial cells resulting in the pro-inflammatory response (IL-1, IL-6, IL-8, TNF α).• When Macrophages & PMNs ingest and degrade the pathogen,they secrete cytokines."}]