[{"url": "http://ghr.nlm.nih.gov/condition/pyruvate-dehydrogenase-deficiency", "passage_text": "The genes involved in pyruvate dehydrogenase deficiency each provide instructions for making a protein that is a component of a group of proteins called the pyruvate dehydrogenase complex. This complex plays an important role in the pathways that convert the energy from food into a form that cells can use. Pyruvate dehydrogenase deficiency can have different inheritance patterns. When the condition is caused by mutations in the PDHA1 gene, it is inherited in an X-linked recessive pattern. The PDHA1 gene is located on the X chromosome, which is one of the two sex chromosomes"}, {"url": "https://en.wikipedia.org/wiki/Pyruvate_dehydrogenase_deficiency", "passage_text": "Pyruvate dehydrogenase deficiency (also known as pyruvate dehydrogenase complex deficiency or PDCD) is one of the most common neurodegenerative disorders associated with abnormal mitochondrial metabolism. The most commonly seen form of PDCD is caused by mutations in the X-linked E1 alpha gene and is approximately equally prevalent in both males and females. However, a greater severity of symptoms tends to affect males more often than heterozygous females."}, {"url": "http://www.orpha.net/consor/cgi-bin/OC_Exp.php?Expert=765", "passage_text": "Summary. Pyruvate dehydrogenase deficiency (PDHD) is a rare neurometabolic disorder characterized by a wide range of clinical signs with metabolic and neurological components of varying severity. Manifestations range from often fatal, severe, neonatal lactic acidosis to later-onset neurological disorders. "}, {"url": "http://emedicine.medscape.com/article/948360-overview", "passage_text": "Pyruvate dehydrogenase complex (PDC) deficiency (PDCD) is one of the most common neurodegenerative disorders associated with abnormal mitochondrial metabolism. The citric acid cycle is a major biochemical process that derives energy from carbohydrates. All children are born with some residual enzyme activity, because a complete deficiency of pyruvate dehydrogenase complex is incompatible with life. Infants with 15% or less pyruvate dehydrogenase complex activity normally do not survive the newborn period."}, {"url": "https://en.wikipedia.org/wiki/Pyruvate_dehydrogenase", "passage_text": "Pyruvate dehydrogenase is the first component enzyme of pyruvate dehydrogenase complex (PDC). The pyruvate dehydrogenase complex contributes to transforming pyruvate into acetyl-CoA by a process called pyruvate decarboxylation (Swanson Conversion). Pyruvate dehydrogenase (PDH) deficiency is a congenital degenerative metabolic disease resulting from a mutation of the pyruvate dehydrogenase complex (PDC) located on the X chromosome. While defects have been identified in all 3 enzymes of the complex, the E1-α subunit is predominantly the culprit."}, {"url": "http://www.webmd.com/children/pyruvate-dehydrogenase-deficiency", "passage_text": "General Discussion. Pyruvate dehydrogenase complex deficiency (PDCD) is a rare disorder of carbohydrate metabolism caused by a deficiency of one of the three enzymes in the pyruvate dehydrogenase complex (PDC). The age of onset and severity of disease depends on the activity level of the PDC enzymes. Pyruvate Dehydrogenase Complex Deficiency. Important. It is possible that the main title of the report Pyruvate Dehydrogenase Complex Deficiency is not the name you expected. Please check the synonyms listing to find the alternate name(s) and disorder subdivision(s) covered by this report."}, {"url": "http://ghr.nlm.nih.gov/condition/pyruvate-dehydrogenase-deficiency", "passage_text": "Pyruvate dehydrogenase deficiency is characterized by the buildup of a chemical called lactic acid in the body and a variety of neurological problems. Signs and symptoms of this condition usually first appear shortly after birth, and they can vary widely among affected individuals. Pyruvate dehydrogenase deficiency can have different inheritance patterns. When the condition is caused by mutations in the PDHA1 gene, it is inherited in an X-linked recessive pattern. The PDHA1 gene is located on the X chromosome, which is one of the two sex chromosome"}, {"url": "https://en.wikipedia.org/wiki/Pyruvate_dehydrogenase", "passage_text": "Acetyl-CoA may then be used in the citric acid cycle to carry out cellular respiration, so pyruvate dehydrogenase contributes to linking the glycolysis metabolic pathway to the citric acid cycle and releasing energy via NADH. Pyruvate dehydrogenase (PDH) deficiency is a congenital degenerative metabolic disease resulting from a mutation of the pyruvate dehydrogenase complex (PDC) located on the X chromosome. While defects have been identified in all 3 enzymes of the complex, the E1-α subunit is predominantly the culprit."}, {"url": "http://emedicine.medscape.com/article/948360-overview", "passage_text": "Pathophysiology. Pyruvate dehydrogenase complex (PDC) converts pyruvate to acetyl-coenzyme A (CoA), which is one of the two essential substrates needed to produce citrate (see the image below). This diagram shows a simplified version of the citric acid cycle and shows the enzyme deficit. All children are born with some residual enzyme activity, because a complete deficiency of pyruvate dehydrogenase complex is incompatible with life. Infants with 15% or less pyruvate dehydrogenase complex activity normally do not survive the newborn period."}]