[{"url": "http://www.sheknows.com/baby-names/name/hadassah", "passage_text": "The name Hadassah is a Persian baby name. In Persian the meaning of the name Hadassah is: Myrtle or bride. SoulUrge Number: 3. Expression Number: 7. People with this name have a deep inner desire to create and express themselves, often in public speaking, acting, writing or singing."}, {"url": "http://www.thinkbabynames.com/meaning/0/Esther", "passage_text": "Her Hebrew name was Hadassah meaning both myrtle and bride, and the form Esther is a Persian translation of it. It could also derive from Persian stara meaning star, or be a Hebrew form of the name of the Persian goddess of love and fertility Ishtar."}, {"url": "http://www.thinkbabynames.com/meaning/0/Hadassah", "passage_text": "Hadassah is a rare given name for females and a rare surname too for all people. (2000 U.S. Census). Displayed below is the baby name popularity of Hadassah for girls. Hadassah was first listed in 2007 and reached its top position of #701 in the U.S. in the year 2014."}, {"url": "http://www.thinkbabynames.com/meaning/0/Hadassah", "passage_text": "Hadassah /ha-das-sah/ [3 sylls.] as a girls' name is pronounced ha-DAHS-sah. It is of Hebrew origin, and the meaning of Hadassah is myrtle, bride; star. Biblical: the Persian Queen Esther 's Hebrew name. Related girl name: Asta. Kreatif forms: Hadassi, Handassah, Hapdassah."}, {"url": "http://www.babynamespedia.com/meaning/Hadassah", "passage_text": "[ 3 syll. ha-das-sah, had-ass-ah ] The baby girl name Hadassah is pronounced as HHaa-D- AH Saa- †. Hadassah is primarily used in the English and Hebrew languages. It is of Hebrew origin. A biblical name, it is derived from the word 'hadas' meaning myrtle, myrtle tree. In the Bible, Hadassah was the Hebrew name of Queen Esther; Esther was the Persian form of the name. Hadassah is still used as a modern Hebrew name. The name Dassa, the name Hadas, the English Hadasa, the English Hadasah, the German and Hebrew Hadassa, the name Haddasah, and the Yiddish Hode are forms of Hadassah."}, {"url": "http://www.chabad.org/library/article_cdo/aid/1769366/jewish/What-Does-the-Name-Hadassah-Mean.htm", "passage_text": "הדסה) was one of the names of Queen Esther, the heroine of the Purim story, and is now given to Jewish girls. The name is of biblical origin, first cited in the Scroll of Esther (2:7), “And [ Mordechai ] had raised Hadassah, she is Esther. . .”. The name Hadassah is derived from the Hebrew word hadas (Heb."}]