[{"url": "https://www.recruiter.com/salaries/laborers-and-freight-stock-and-material-movers-hand-salary/", "passage_text": "Laborers and Freight, Stock, and Material Movers, Hand can earn a compensation of Twenty Five Thousand Six Hundred dollars yearly. Laborers and Freight, Stock, and Material Movers, Hand are compensated at the highest average salary in Alaska, where they can earn average wages of just about $35520. They are compensated highest in Public Administration, where they earn average wages of $36380. To qualify for this position, a high school education is usually required. Before beginning official work, up to a year of job training may be required before official work can begin. A Freight/Stock/Material Mover Laborer receives average salaries ranging between 16000 - 24000 based on experience and talent."}, {"url": "http://www.indeed.com/salary/Truck-Movers.html", "passage_text": "Average Truck Movers salaries for job postings nationwide are 54% lower than average salaries for all job postings nationwide. "}, {"url": "http://www.payscale.com/research/US/Job=Mover/Hourly_Rate", "passage_text": "Mover Salary. (United States). Men make up the majority of Movers in the United States, and the nationwide average salary in this area lies in the neighborhood of $12.16 per hour. Compensation ranges between $9.56 per hour and $17.15"}, {"url": "http://money.usnews.com/money/personal-finance/articles/2014/04/30/the-hidden-costs-of-moving", "passage_text": "And open your wallet. According to the American Moving & Storage Association, the average cost of an intrastate move is $1,170, and the average move between states costs $5,630. The cost of a self-storage unit varies widely and depends on the location. CostHelper.com says a self-storage unit that’s 10 feet by 20 feet typically ranges from $95 to $155 a month, and $170 to $180 if the unit is climate-controlled."}, {"url": "http://www.themovingblog.com/average-moving-costs/", "passage_text": "The average moving cost for hiring a truck to take you from Northern Virginia to Boston for example would cost you approximately between $650 and $750. If you decide to hire a truck for moving, this would cost you on average between $650 and $750 which is a price that does not include fuel cost. Also, usually one hour more is going to be charged for you on behalf of the moving company and this is travel time – the time the moving experts need to reach to your living place. The average moving cost per hour varies between $85 to $95 depending on the moving date."}, {"url": "http://www.themovingblog.com/average-moving-costs/", "passage_text": "You may also wish to buy some furniture pads to protect your belongings during transportation and they cost about $8 each. This means that the average cost of packing materials will vary between $170 and $220 for a 3 bedroom house. These are the calculations for average moving costs for your upcoming move. You can find more tips on hiring movers here. Also, usually one hour more is going to be charged for you on behalf of the moving company and this is travel time – the time the moving experts need to reach to your living place. The average moving cost per hour varies between $85 to $95 depending on the moving date."}, {"url": "http://www.indeed.com/salary/Professional-Movers.html", "passage_text": "Average Professional Movers salaries for job postings nationwide are 45% lower than average salaries for all job postings nationwide. "}, {"url": "http://www.salarylist.com/company/Flat-Rate-Moving-Salary.htm", "passage_text": "Flat Rate Moving Salary. Flat Rate Moving average salary is $82,167, median salary is $86,487 with a salary range from $29,994 to $125,700. Flat Rate Moving salaries are collected from government agencies and companies. Each salary is associated with a real job position. "}, {"url": "http://www.themovingblog.com/average-moving-costs/", "passage_text": "You may also decide to hire additional help for the moving to pack, load and unload the moving truck with your things. Based on the average cost per hour at about $90 for 3 people for 4 hours you would have to pay $320. This is one of the highest costs of all costs along with hiring a truck and paying for its fuel. Also, usually one hour more is going to be charged for you on behalf of the moving company and this is travel time – the time the moving experts need to reach to your living place. The average moving cost per hour varies between $85 to $95 depending on the moving date."}]