[{"url": "http://www.thenamemeaning.com/jermaine/", "passage_text": "Jermaine Name Meaning. The meaning of Jermaine is “Brother”. Keep in mind that many names may have different meanings in other countries and languages, so be careful that the name that you choose doesn’t mean something bad or unpleasant. The name Jermaine is of French, Latin origins, which means it has more than one root, and is used mostly in English speaking countries but also in a few other countries and languages of the world."}, {"url": "http://www.behindthename.com/name/jermaine", "passage_text": "Variant of GERMAIN. The name was popularized in the 1970s by Jermaine Jackson (1954-), a member of the singing group The Jackson 5."}, {"url": "http://www.thenamemeaning.com/jermaine/", "passage_text": "Search comprehensively and find the name meaning of Jermaine and its name origin or of any other name in our database. Also note the spelling and the pronunciation of the name Jermaine and check the initials of the name with your last name to discover how it looks and sounds. The name Jermaine is of French, Latin origins, which means it has more than one root, and is used mostly in English speaking countries but also in a few other countries and languages of the world."}, {"url": "http://www.sheknows.com/baby-names/name/jermaine", "passage_text": "French Meaning: The name Jermaine is a French baby name. In French the meaning of the name Jermaine is: German or 'from Germany', from the French word, Germain. SoulUrge Number: 2. Expression Number: 3. People with this name have a deep inner desire for love and companionship, and want to work with others to achieve peace and harmony."}, {"url": "http://www.thinkbabynames.com/meaning/1/Jermaine", "passage_text": "Jermaine is a very popular first name for men (#400 out of 1220, Top 33%) but a unique surname for both adults and children. (2000 U.S. Census). Displayed below is the birth name popularity of Jermaine for boys. Jermaine was first listed in 1970-1979 and reached its highest position of #191 in the U.S. then, and is at #730 presently. (Top 1000 Baby Names Records, 2014). Below is a charted analysis of the usage of the boy name Jermaine and affiliated names. Prominent related forms of Jermaine (#730 last year) are Germaine, German and Jermain."}, {"url": "http://www.sheknows.com/baby-names/name/jermaine", "passage_text": "The name Jermaine is an English baby name. In English the meaning of the name Jermaine is: Brotherly.. Singer Jermaine Jackson. Latin Meaning: The name Jermaine is a Latin baby name. The name Jermaine is a French baby name. In French the meaning of the name Jermaine is: German or 'from Germany', from the French word, Germain. SoulUrge Number: 2. Expression Number: 3."}, {"url": "http://www.thinkbabynames.com/meaning/0/Germaine", "passage_text": "Germaine /ger-mai-ne/ [2 sylls.] as a girls' name (also used as boys' name Germaine) is pronounced jer-MAYNE. It is of Latin and French origin, and the meaning of Germaine is brotherly; from Germany. Feminine of Germain, from a Roman name meaning brother. May also mean from Germany. Saint Germaine (16th century) was a French shepherdess. Modern use may be homage to famous author and feminist Germaine Greer. Germaine is a very popular first name for females (#1005 out of 4276, Top 23%) and also a very popular last name for both adults and children (#18811 out of 150436, Top 13%). (2000 U.S. Census). Shown below is the birth name popularity of Germaine for girls."}, {"url": "http://www.ohbabynames.com/meaning/name/jermaine/1751", "passage_text": "Etymology & Historical Origin-Jermaine. Jermaine is an Americanized respelling of the French masculine name Germain which itself comes from an ancient Roman name “Germanus” meaning “brother” in Latin (derived from “germen” meaning “seed, branch, off-spring”). Popularity of the Name Jermaine. The name Jermaine came charging on to the American male naming charts in 1970. Not coincidentally, this was the same year that Jermaine Jackson came bursting on to the American music scene along with his brothers in the pop-group The Jackson 5."}, {"url": "https://en.wikipedia.org/wiki/Jermaine", "passage_text": "The masculine given name Jermaine was popularized in the 1970s by Jermaine Jackson (b. 1954-), a member of the singing group The Jackson 5. Jermaine ranked among the top 200 names given to boys born in the United States between 1960 and 1980. It has since declined in popularity and was ranked as the 738th most popular name for American males born in 2013."}, {"url": "https://en.wikipedia.org/wiki/Jermaine", "passage_text": "Look up Jermaine in Wiktionary, the free dictionary. Jermaine (/dʒərˈmeɪn/ jər-MAYN) is a masculine given name of French origin, derived from the French given name Germaine, meaning; Courageous, Honest, Determined, Original, and Creative. Jermaine ranked among the top 200 names given to boys born in the United States between 1960 and 1980. It has since declined in popularity and was ranked as the 738th most popular name for American males born in 2013."}]