[{"url": "http://apps.americanbar.org/litigation/committees/insurance/articles/janfeb2012-large-matching-deductibles.html", "passage_text": "[A] self-insured retention (“SIR”) differs from a deductible in that a SIR is an amount that an insured retains and covers before insurance coverage begins to apply. Once a SIR is satisfied, the insurer is then liable for amounts exceeding the retention less any agreed deductible. . . . . . In contrast, a deductible is an amount that an insurer subtracts from a policy amount, reducing the amount of insurance. With a deductible, the insurer has the liability and defense risk from the beginning and then deducts the deductible amount from the insured coverage.[27]."}, {"url": "https://en.wikipedia.org/wiki/Deductible", "passage_text": "In an insurance policy, the deductible is the amount of expenses that must be paid out of pocket before an insurer will pay any expenses. In general usage, the term deductible may be used to describe one of several types of clauses (see below) that are used by insurance companies as a threshold for policy payments. "}, {"url": "http://www.genins.com/img/~www.genins.com/commercial%20lines%20articles/self-insured%20retentions%20vs.%20deductibles%20your%20skin%20in%20the%20game.pdf", "passage_text": "Self-Insured Retentions vs. Deductibles: Your Skin in the Game Self-insured retentions (SIR) and deductibles are the two conventional mechanisms insureds use to reduce both premiums and loss ratios in liability policies. Using either simply to reduce premiums is foolish, and could prove to be very dangerous. A self-insured retention means that the insured carries a fixed amount of risk, including adjusting and legal expenses. The insurance policy, whether a primary or umbrella contract, is excess coverage above the SIR."}, {"url": "https://turbotax.intuit.com/tax-tools/tax-tips/Self-Employment-Taxes/Deducting-Health-Insurance-Premiums-If-You-re-Self-Employed/INF12128.html", "passage_text": "If you are self-employed, you may be eligible to deduct premiums that you pay for medical, dental and qualifying long-term care insurance coverage for yourself, your spouse and your dependents. The bottom line. If you qualify, the deduction for self-employed health insurance premiums is a valuable tax break. With the rising cost of health insurance, a tax deduction can help you pay at least a portion of the premium cost. And that will help to keep you healthy—and happy—in 2013 and beyond"}, {"url": "http://johnsonandbell.com/alerts-blog/insurance/self-insured-retentions-and-high-deductibles-their-impact-on-insurers-and-policyholders/", "passage_text": "However, there are important differences in the way they operate. Insurance policies written with deductibles provide that the insurer will pay the defense and indemnity costs in connection with a covered claim, and then charge or bill back the deductible amount to the insured. Another difference between a deductible and a SIR is that the SIR does not reduce available policy limits, whereas a deductible may reduce policy limits. Thus, an excess insurance contract with limits of $750,000 sitting above a $250,000 SIR will provide the insured with $750,000 in coverage once the SIR is satisfied."}, {"url": "https://www.healthcare.gov/blog/6-things-to-know-about-deductibles-in-the-health-insurance-marketplace/", "passage_text": "1 A health insurance deductible is different from other types of deductibles. 2  Unlike auto, renters, or homeowners insurance, where you don’t get services until you pay your deductible, many health insurance plans provide some benefits before you meet the deductible. "}, {"url": "http://riskretentionservices.com/claim/self-insured-retentions-and-deductibles/", "passage_text": "A deductible requires the insured to pay the first level of expenses or damages, before the insurer is “on the hook.” In a business liability or workers compensation policies, deductibles range from nothing to $250,000 or more. "}]