[{"url": "http://www.slate.com/articles/life/food/2009/03/dietary_fibber.html", "passage_text": "The fiber in Cocoa Pebbles comes from a little-known ingredient called polydextrose, which is synthesized from glucose and sorbitol, a low-calorie carbohydrate. Functional refers to both the synthetic variety like polydextrose as well as naturally occurring inulin, which is extracted and purified from chicory roots. Polydextrose shares with dietary fiber one fundamental property: It seems to rev up your GI tract."}, {"url": "https://en.wikipedia.org/wiki/Polydextrose", "passage_text": "It is also used as a humectant, stabiliser, and thickening agent. Polydextrose is a form of soluble fiber and has shown healthful prebiotic benefits when tested in animals. It contains only 1 kcal per gram and, therefore, is able to help reduce calories. However, polydextrose is not universally well tolerated. It is frequently used to increase the non-dietary fiber content of food, to replace sugar, and to reduce calories and fat content. It is a multi-purpose food ingredient synthesized from dextrose (glucose), plus about 10 percent sorbitol and 1 percent citric acid. Its E number is E1200. The FDA approved it in 1981."}, {"url": "https://en.wikipedia.org/wiki/Polydextrose", "passage_text": "Polydextrose is a synthetic polymer of glucose. It is a food ingredient classified as soluble fiber by the U.S. Food and Drug Administration (FDA) as well as Health Canada, as of April 2013. It is frequently used to increase the non-dietary fiber content of food, to replace sugar, and to reduce calories and fat content. It is a multi-purpose food ingredient synthesized from dextrose (glucose), plus about 10 percent sorbitol and 1 percent citric acid. Its E number is E1200. The FDA approved it in 1981."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/10227745", "passage_text": "A review of the studies of the safety of polydextrose in food. Burdock GA(1), Flamm WG. Author information: (1)Burdock & Associates, Vero Beach, FL 32963, USA. Polydextrose (CAS no. 68424-04-4) is a water-soluble polymer of glucose that provides to foods the bulk and texture of sucrose. There are two main forms of polydextrose, an acidic form (PD-A) and a neutralized potassium salt (PD-N). "}, {"url": "https://www.sharecare.com/health/carbohydrates/what-is-polydextrose", "passage_text": "Polydextrose is a carbohydrate and a nondigestible polysaccharide, used primarily as a sugar replacement. It has been studied for its effects on impaired glucose tolerance and childhood growth promotion. It has also been investigated for its potential laxative and lipid-lowering effects. "}, {"url": "http://www.ehow.com/about_5782918_side-effects-polydextrose.html", "passage_text": "Side Effects. Polydextrose is generally well tolerated in those who use it in moderation. However, in large quantities or in particularly sensitive people, polydextrose can cause a variety of side effects, including abdominal cramping, bloating and excessive gas. Synthesized from dextrose, sorbitol and citric acid, polydextrose is used in a wide range of commercial food products for a variety of purposes. Used as a humectant, polydextrose helps keep foods moist. As a stabilizer, thickener or bulking agent, it helps keep flavor and texture uniform in packaged food"}, {"url": "http://www.wisegeek.com/what-is-polydextrose.htm", "passage_text": "As a sugar substitute that is derived from dextrose, polydextrose is a food ingredient that can be used as a low calorie substitute in many recipes. "}, {"url": "https://www.mrsupplement.com.au/polydextrose", "passage_text": "However, polydextrose is commonly used in food as a replacement for sugar, starch, and fat, resulting in a low calorie alternative. Foods that may contain polydextrose include cakes, dessert mixes, sweetes, breakfast cereals, puddings, and more. Polydextrose is a tasteless synthetic form of soluble dietary fibre that is synthesised by combining glucose (AKA dextrose) molecules together with a little bit of sorbitol and citric acid."}, {"url": "https://en.wikipedia.org/wiki/Polydextrose", "passage_text": "Polydextrose is commonly used as a replacement for sugar, starch, and fat in commercial beverages, cakes, candies, dessert mixes, breakfast cereals, gelatins, frozen desserts, puddings, and salad dressings. Polydextrose is frequently used as an ingredient in low-carb, sugar-free, and diabetic cooking recipes. It is frequently used to increase the non-dietary fiber content of food, to replace sugar, and to reduce calories and fat content. It is a multi-purpose food ingredient synthesized from dextrose (glucose), plus about 10 percent sorbitol and 1 percent citric acid. Its E number is E1200. The FDA approved it in 1981."}]