[{"url": "http://www.prepscholar.com/sat/s/colleges/Howard-University-admission-requirements", "passage_text": "The average GPA at Howard University is 3.29. (Most schools use a weighted GPA out of 4.0, though some report an unweighted GPA. With a GPA of 3.29, Howard University accepts below-average students. It's OK to be a B-average student, with some A's mixed in. It'd be best to avoid C's and D's, since application readers might doubt whether you can handle the stress of college academics. If you want to get in, the first thing to look at is the acceptance rate. This tells you how competitive the school is and how serious their requirements are. The acceptance rate at Howard University is 57% . For every 100 applicants, 57 are admitted."}, {"url": "http://www.collegetransfer.net/HowardUniversity/TransferProfile/tabid/145/Default.aspx", "passage_text": "Avg. Financial Aid. Howard University is an institution that is experienced, dynamic, and diverse with a tradition of quality education since 1867 provided by the constant engagement of its faculty toward the students and their needs, and by its rich campus social and cultural life."}, {"url": "http://www2.howard.edu/admission", "passage_text": "Facebook Twitter. Howard University is one of only 48 U.S. private, Doctoral/Research universities, comprising 13 schools and colleges with over 11,000 students enjoying academic pursuits in more than 120 areas of study leading to undergraduate, graduate, and professional degrees. "}, {"url": "http://collegeapps.about.com/od/GPA-SAT-ACT-Graphs/ss/howard-university-admission-gpa-sat-act.htm", "passage_text": "Calculate Your Chances of Getting In with this free tool from Cappex. Discussion of Howard's Admissions Standards: A little over half of all applicants to Howard University will get in. Most successful applicants have solid grades and standardized test scores. In the graph above, the blue and green dots represent accepted students. Most admitted students had a high school GPA of B- or higher, an SAT score of 1450 or higher (M+CR+W), and an ACT composite score of 20 or higher. Many applicants had scores and test scores well above this lower range."}, {"url": "http://healthsciences.howard.edu/education/colleges/medicine/admissions", "passage_text": "Admissions. At Howard University College of Medicine we provide students of high academic potential with a medical education of exceptional quality and prepare physicians and other health care professionals to serve the underserved."}, {"url": "http://www2.howard.edu/admission/undergraduate", "passage_text": "The University promotes academic excellence through a highly selective admission process. Students who are admitted demonstrate strong personal motivation along with backgrounds of consistent academic growth and achievement. The University encourages the submission of applications from socially and economically disadvantaged students who exemplify promise of gaining from a Howard University education."}, {"url": "http://medical-schools.startclass.com/l/96/Howard-University-College-of-Medicine", "passage_text": "Lower than Average GPA. The average GPA of students admitted to Howard University College of Medicine is 3.41. If a school has a noticeably lower average admitted GPA compared to other schools, you should be vigilant in assessing the school's academic curriculum. Students admitted to Howard University College of Medicine typically have an undergraduate GPA between 2.94 and 3.88 and have a median MCAT score of 27 out of 45 possible points."}, {"url": "http://www.prepscholar.com/sat/s/colleges/Howard-University-admission-requirements", "passage_text": "The average SAT score composite at Howard University is a 1635. This score makes Howard University Competitive for SAT test scores. The 25th percentile SAT score is 1360, and the 75th percentile SAT score is 2020. In other words, a 1360 places you below average, while a 2020 will move you up to above average. If you want to get in, the first thing to look at is the acceptance rate. This tells you how competitive the school is and how serious their requirements are. The acceptance rate at Howard University is 57% . For every 100 applicants, 57 are admitted."}]