[{"url": "http://www.wisegeek.org/what-is-a-muscle-cell.htm", "passage_text": "A muscle cell is a special kind of cell that makes up an organism's muscle tissues. The muscles allow independent movement and regulate biological functions such as digestion and heartbeat. An organism's muscle tissue is composed of muscle cells. Multi-unit smooth muscle cells operate independently and single-unit, or visceral, smooth muscle cells operate together as a unit. Muscle mass can be gained artificially from injections of performance-enhancing drugs and hormones."}, {"url": "http://www.answers.com/Q/What_are_examples_of_cells", "passage_text": "A muscel cell is not an example of a gamete cell. A gamete cell is  a reproductive cell that unite during sexual reproduction to form a  new cell called the zygote. In males … the sperm is the gamete cell  and in females the ovum is the gamete cell. An Amoeba is an example of a cell. In fact, an Amoeba is the only complete one cell organism; it is complete, and ready to carry out all life functions. This gives the Amoeba … a position in the animal kingdom, and that sets it apart from all other cells."}, {"url": "https://en.wikipedia.org/wiki/Muscle", "passage_text": "Muscle is a soft tissue found in most animals. Muscle cells contain protein filaments of actin and myosin that slide past one another, producing a contraction that changes both the length and the shape of the cell. Muscles function to produce force and motion"}, {"url": "http://training.seer.cancer.gov/anatomy/muscular/structure.html", "passage_text": "Each skeletal muscle fiber is a single cylindrical muscle cell. An individual skeletal muscle may be made up of hundreds, or even thousands, of muscle fibers bundled together and wrapped in a connective tissue covering. Each muscle is surrounded by a connective tissue sheath called the epimysium. "}, {"url": "http://www.wisegeek.org/what-is-a-muscle-cell.htm", "passage_text": "Skeletal muscle structure. Different types of muscle tissue. An organism's muscle tissue is composed of muscle cells. Multi-unit smooth muscle cells operate independently and single-unit, or visceral, smooth muscle cells operate together as a unit. Muscle mass can be gained artificially from injections of performance-enhancing drugs and hormones."}, {"url": "https://answers.yahoo.com/question/index?qid=20140718045636AAmB6MQ", "passage_text": "Relevance. Rating Newest Oldest. B. a somatic cell A muscle cell is a body' cell (somatic means body). A gamete is a haploid cell, such as an egg or a sperm, related to sexual reproduction, When an egg and a sperm fuse during fertilization they produce a diploid cell called a zygote"}, {"url": "https://en.wikipedia.org/wiki/Muscle", "passage_text": "Muscle tissues are derived from the mesodermal layer of embryonic germ cells in a process known as myogenesis. There are three types of muscle, skeletal or striated, cardiac, and smooth. Muscle cells contain protein filaments of actin and myosin that slide past one another, producing a contraction that changes both the length and the shape of the cell."}, {"url": "http://droualb.faculty.mjc.edu/Course%20Materials/Elementary%20Anatomy%20and%20Physiology%2050/Lecture%20outlines/skeletal_muscle_physiology.htm", "passage_text": "Skeletal muscle is an example of muscle tissue, one of the four types of basic tissue. The essential characteristic of muscle tissue is that it shortens or contracts. There are three kinds of muscle tissue, skeletal, cardiac and smooth. Skeletal muscle is the only type of muscle that we can consciously control through our nervous system. This is the reason it is also voluntary. Skeletal muscle cells are also long and cylindrical. For this reason a skeletal muscle cell can also be referred to as a skeletal muscle fiber."}, {"url": "http://www2.estrellamountain.edu/faculty/farabee/biobk/BioBookAnimalTS.html", "passage_text": "Nervous tissue, shown in Figure 14, functions in the integration of stimulus and control of response to that stimulus. Nerve cells are called neurons. Each neuron has a cell body, an axon, and many dendrites. Nervous tissue is composed of two main cell types: neurons and glial cells. Neurons transmit nerve messages."}]