[{"url": "http://www1.toronto.ca/wps/portal/contentonly?vgnextoid=3e5eae0b7e612310VgnVCM1000003dd60f89RCRD&vgnextchannel=4a27ba2ae8b1e310VgnVCM10000071d60f89RCRD", "passage_text": "The average weekly cost for food for a family of four in Toronto is $136.28 ($590.09 per month average). These amounts are based on the province of Ontario's 2008 Nutritious Food Basket. Included in these figures are 66 items from the four food groups recommended in Canada's Food Guide to Healthy Living."}, {"url": "http://www.usatoday.com/story/news/nation/2013/05/01/grocery-costs-for-family/2104165/", "passage_text": "The cost of feeding a family of four a healthy diet can run $146 to $289 a week, according to the latest numbers from the U.S. Department of Agriculture. That's based on preparing all the meals and snacks at home for a couple with two school-aged children."}, {"url": "http://www.ehow.com/about_6502861_typical-budget-family-four.html", "passage_text": "The cost of living can vary from year to year, typically going up. The U.S. Department of Health and Human Services establishes the current year's poverty level for a family of four. In 2010, this figure was set at $22,050. This is a national average and some areas have a higher cost of living than others."}, {"url": "http://www.brighthub.com/money/personal-finance/articles/68655.aspx", "passage_text": "Cost of Living for a Family of 4. According to the U.S. Department of Health and Human Services, the poverty line for a family of 4 is $22,050. This is the poverty line for the 48 contiguous states and the District of Columbia. Alaska is a little higher at $27,570 and Hawaii's poverty line is $25,360. The cost of living for a family of 4 does vary per state. Some fall below while others are a bit higher."}, {"url": "http://www.nydailynews.com/new-york/nyc-tops-new-living-expenses-article-1.1390134", "passage_text": "Marshall County has the lowest cost of modest living for a family of four in the U.S., according to a new study by the Economic Policy Institute. The average monthly rent in the small city of 7,900 people is about $500 a month, and spacious houses can be snapped up for less than $100,000."}, {"url": "http://www.nydailynews.com/new-york/nyc-tops-new-living-expenses-article-1.1390134", "passage_text": "As expected, the cities with the highest total living expenses were New York, Washington, D.C. ($88,600), Boston ($85,600) and San Francisco ($84,100). The median cost of modest living was $63,000 for a family of four living in Newaygo County, Mich., EPI said."}]