[{"url": "http://www.answers.com/Q/What_is_zeus'_role", "passage_text": "In Greek mythology Cronus the Titan had 5 children-Poseidon, Hades, Hestia, Hera and Demeter and, because he was told one of his children would kill him, swallowed each of them. When his sixth child Zeus was born, Cronus' wife, Rhea, wrapped a stone in cloth and he swallowed that instead, thinking it was Zeus."}, {"url": "http://www.answers.com/Q/What_is_zeus'_role", "passage_text": "Zeus is the head or king God of the greek pantheon. He was the main God worshipped by most Greeks or Hellenists and is said to be the most powerful. He was the child of Cronus and Rhea and the husband of Hera."}, {"url": "http://www.answers.com/Q/What_role_did_Zeus_play_in_greek_mythology", "passage_text": "Zeus was king of the gods and goddesses in Greek mythology. Zeus, the youngest son of Cronus and Rhea (Cronus and Rhea were both 'Titans', the beings before the gods), he was … the supreme ruler of Mount Olympus and of the Pantheon of gods who resided there."}, {"url": "http://www.greekmythology.com/Olympians/Apollo/apollo.html", "passage_text": "Apollo was the son of Zeus and Leto, twin brother of Artemis. He was the god of music, and he is often depicted playing a golden lyre. He was also known as the Archer, far shooting with a silver bow; the god of healing, giving the science of medicine to man; the god of light; and the god of truth."}, {"url": "http://www.ancientgreece.com/s/GreekGods/Zeus/", "passage_text": "Zeus, like most of the gods of the Greek pantheon, had many roles and epithets aside from his main function as weather god and king of Olympus. His title Zeus Panhellenios shows his applicability to all of Greece as it literally translates as Zeus of all the Hellenes."}, {"url": "http://www.ancientgreece.com/s/GreekGods/Zeus/", "passage_text": "Unlike many Greek divinities, the origins of Zeus' name are undisputed. Zeus is connected with an ancient Indo-European deity Dyeus, which roughly translates as 'sky', 'day' (as opposed to night) and 'clear'. All of these point to his role as a god of the heavens, the sky and thunder. As the king of the Greek Gods, Zeus has been portrayed endlessly in art, often with specific aspects or symbols to identify him and his purpose."}, {"url": "http://www.ancient.eu/zeus/", "passage_text": "1 Athena-with Metis but as Zeus swallowed his wife in fear a son would usurp his position, Athena was born from Zeus’ head and she became the god’s favourite child. 2  Apollo & Artemis-with Leto. 3  Hermes-with the Nymph Maia. 4  Zeus, impressed by his trickery and silver tongue, gave him the role of messenger of the gods."}, {"url": "http://www.answers.com/Q/What_role_did_Zeus_play_in_greek_mythology", "passage_text": "It was believed that Zeus was The main god in Greek mythology along with Hera, and a few others. He had power of the sky and storm. Some legends say he was the lord of all the … gods."}, {"url": "http://www.greekmythology.com/Olympians/Zeus/zeus.html", "passage_text": "Zeus was the god of the sky and ruler of the Olympian gods. He overthrew his father, Cronus, and then drew lots with his brothers Poseidon and Hades, in order to decide who would succeed their father on the throne. Zeus won the draw and became the supreme ruler of the gods, as well as lord of the sky and rain."}]