[{"url": "http://www.fitday.com/fitness-articles/nutrition/healthy-eating/the-nutritional-food-value-of-carrots.html", "passage_text": "Here are some of the key vitamins and nutrients that come from raw carrots: 1  Vitamin A (almost 700 percent of the daily value your body requires in a single serving!). 2  Vitamin K. 3  Vitamin C. 4  Dietary Fiber. 5  Potassium. 6  Vitamin B6. 7  Manganese. "}, {"url": "http://www.nutrition-and-you.com/carrots.html", "passage_text": "Carrots nutrition facts. Naturally sugary, delicious and crunchy, carrots are healthy additions you can make to the vegetable list of your diet. Indeed, these root vegetables come with wholesome health benefiting compounds such as beta-carotenes, falcarinol, vitamin A, minerals and anti-oxidants in ample amounts. Health benefits of carrots. Sweet and crunchy carrots are notably rich in anti-oxidants, vitamins and dietary fiber. They provide only 41 calories per 100 g, negligible amount of fat and no cholesterol. They are exceptionally rich source of carotenes and vitamin-A. 100 g fresh carrot contains 8285 µg of beta-carotene and 16706 IU of vitamin A. Studies have found that flavonoid compounds in carrots may offer protect from skin, lung and oral cavity cancers. Carotenes converted into vitamin A in the liver cell"}, {"url": "http://healthyeating.sfgate.com/nutrients-carrots-provide-3172.html", "passage_text": "Vitamin A. Carrots a rich source of vitamin A, particularly in the form of beta-carotene, which gives them their vibrant orange color. Beta-carotene converts into retinol, the most usable form of vitamin A. Retinol protects the membranes surrounding your eyes that absorb light. Carrots are full of nutrients for eye health. Carrots are rich in vitamins, minerals and fiber but only contribute a small amount of calories to your diet. They are virtually guilt-free, offering a minimal 50 calories per 1 cup of raw chopped carrots"}, {"url": "http://healthyeating.sfgate.com/nutrition-juicing-carrots-1311.html", "passage_text": "Carrots are known for improving eyesight because of their high vitamin A content. However, vitamin A also promotes healthy brain, cellular and lung growth. With 60,142 international units, or IU, of vitamin A in a single serving of carrot juice, the vegetable more than lives up to its healthy reputation. "}, {"url": "http://juicing-for-health.com/health-benefits-of-carrot.html", "passage_text": "Skin problems: The high quality vitamin C and other rich nutrients in carrot juice efficiently nourish the skin, preventing dry skin, psoriasis and other skin blemishes. Thread worms: One small cup of carrot juice in the morning taken daily for a week may help clear up thread worms in children. Carrot greens/tops CAN be eaten. It is very rich with potassium, calcium, magnesium, vitamin K and protein. Potassium is a key mineral in our body, thus high consumption of it keeps all the organs in our body in tip-top condition."}, {"url": "http://www.whfoods.com/genpage.php?tname=foodspice&dbid=21", "passage_text": "In addition to the nutrients highlighted in our ratings chart, an in-depth nutritional profile for Carrots is also available. This profile includes information on a full array of nutrients, including carbohydrates, sugar, soluble and insoluble fiber, sodium, vitamins, minerals, fatty acids, amino acids and more. Carrots can be as small as two inches or as long as three feet, ranging in diameter from one-half of an inch to over two inches. Carrot roots have a crunchy texture and a sweet and minty aromatic taste, while the greens are fresh tasting and slightly bitter."}, {"url": "http://juicing-for-health.com/health-benefits-of-carrot.html", "passage_text": "Nutritional Benefits. Carrot is one of the most healing foods that provides the finest and highest quality in nutrients, especially from its juice. It is an excellent source of pro-vitamin A, vitamins C, D, E, K, B1 and B6. It is rich with biotin, potassium, calcium, magnesium, phosphorus, organic sodium and some trace minerals. Carrot greens/tops CAN be eaten. It is very rich with potassium, calcium, magnesium, vitamin K and protein. Potassium is a key mineral in our body, thus high consumption of it keeps all the organs in our body in tip-top condition."}]