[{"url": "http://www.ehow.com/facts_8010025_much-cost-grass-cut.html", "passage_text": "Do-It-Yourself. If you are willing to cut the grass yourself, the cost is nothing. If you don't already own a lawn mower, you will have to invest in one but the cost of the mower will quickly pay for itself if you compare the cost of hiring a professional landscaper for the job. The Neighborhood Lawn Mower. Another option is hire a teenager in the neighborhood to mow your lawn. He will cost far less than a professional landscaper, but you still have the added convenience. Some may charge as little as $10 to $15 for an average size lawn but maybe not even more than $25 or $30 for a large lawn."}, {"url": "http://yardcare.toro.com/restore/when-should-you-mow-your-lawn/", "passage_text": "Cut warm-season grasses when they reach heights of 2- to 2-½-inches. If the lawn grows too high for you to cut off one-third of the height and have an acceptable length, cut off one-third and then wait two or three days before cutting off another one-third. If you cut more than one-third, you will have: 1) clumps of clippings that lie on top of the lawn, 2) slower decomposition, and 3) a less attractive, bristly appearing lawn. If this occurs, rake and remove or use a leaf blower to obliterate the shavings."}, {"url": "http://www.costowl.com/home-improvement/landscaping-lawncare.html", "passage_text": "Lawn Care Prices. 1  A reasonable price for lawn care is $25-$35 per week, or $100-$140 per month. 2  By the hour, this works out to $20-$25 per hour, or $40-$50 for half acre lawns. 3  Most landscapers will include basic lawn maintenance such as lawn mowing and edging. 4  Larger lawns cost more. "}, {"url": "http://www.ehow.com/facts_8010025_much-cost-grass-cut.html", "passage_text": "A small front and back yard may be as little as $20 to $25 per week or cut, but the average lawn will likely be anywhere from $30 to $50 per week or cut and a large lawn on a quarter of an acre or more may cost closer to $60 or $70 per week or cut, as of 2011. The Neighborhood Lawn Mower. Another option is hire a teenager in the neighborhood to mow your lawn. He will cost far less than a professional landscaper, but you still have the added convenience. Some may charge as little as $10 to $15 for an average size lawn but maybe not even more than $25 or $30 for a large lawn."}, {"url": "http://www.homewyse.com/services/cost_to_mow_lawn.html", "passage_text": "Our free calculator uses recent, trusted data to estimate costs for your Small Lawn Mowing project. For a basic 500 square feet project in zip code 47474, the benchmark cost to Mow a Lawn ranges between $0.03 - $0.14 per square foot* . To estimate costs for your project: 1. Set Project Zip Code Enter the Zip Code for the location where labor is hired and materials purchased"}, {"url": "http://landscaping.about.com/od/landscapecolor/f/grass_height.htm", "passage_text": "Well, there's a general rule of thumb for determining grass height. An optimal height for a cool-season grass generally is about 2 1/2 inches. And at each mowing, you should only be removing about the top 1/3 of the grass blade. Consequently, a good time to mow lawns is when your grass is about 3 2/3 inches high. "}, {"url": "http://smallbusiness.chron.com/price-lawn-cutting-12042.html", "passage_text": "Step 1. Establish a base price. The average cost to cut a lawn is between $20 and $40. Determine a base price for small, medium and large-sized properties. For example, you may only charge $20 to cut the front and back of a small property that only takes 30 to 60 minutes, but charge $40 for a property that takes twice as long to complete. Step 2. "}, {"url": "http://www.homeadvisor.com/cost/lawn-and-garden/maintain-a-lawn/", "passage_text": "Dethatching or power raking moves away dead grass, excess grass and putting holes in the ground and is considered another method of aeration that costs less. It can cost between $100 and $200 depending on the size of your lawn. See how much lawn aeration costs if you have it done professionally. Grass cutting rates will also vary depending on the frequency of mowing. If you have your lawn trimmed too infrequently, it will be more difficult to maintain. They are also based on square footage, though there is a minimum cost."}]