[{"url": "http://www.everydayhealth.com/drugs/lyrica", "passage_text": "A: Lyrica is medication available to treat painful nerve pain sometimes associated with neuropathy or shingles. Side effects of Lyrica are dry mouth, headache, difficulty sleeping, nausea and unfortunately constipation or diarrhea. That can vary from person to person. Lyrica (pregabalin) is an anticonvulsant or anti-seizure drug that works by slowing down impulses in the brain that cause seizures. It also affects chemicals in the brain that send pain signals across the nervous system."}, {"url": "http://www.rxlist.com/lyrica-side-effects-drug-center.htm", "passage_text": "Lyrica (pregabalin) is an oral medication chemically related to gabapentin (Neurontin, Gabarone) used for neuropathic pain associated with diabetic peripheral neuropathy or postherpetic neuralgia, and for treating partial onset seizures in adults, and fibromyalgia. It is not known whether Lyrica is excreted in human breast milk. Our Lyrica Side Effects Drug Center provides a comprehensive view of available drug information on the potential side effects when taking this medication. This is not a complete list of side effects and others may occur. Call your doctor for medical advice about side effects."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/19845736", "passage_text": "The severity of symptoms was dose dependent. Pregabalin can cause marked constipation in some patients, and can lead to multiple unnecessary investigations and procedures if the clinician is not aware of this entirely reversible side effect.evere and disabling constipation: an adverse effect of pregabalin. Kamel JT(1), D'Souza WJ, Cook MJ. Author information: (1)The Department of Neurology & Neurological Research, The Department of Medicine, St Vincent's Hospital Melbourne, Melbourne, Vic, Australia."}, {"url": "http://www.naturalconstipationrelief.org/is-lyrica-constipation/", "passage_text": "Originally printed in Participate from painless diarrhea or constipation, to pain associated with diarrhea and/or constipation (usually called irritable bowel syndrome). Important Safety Information LYRICA is contraindicated in patients with known hypersensitivity to pregabalin or any of its other components.onstipation/Diarrhea Urinary retention/ incontinence Neurontin gabapentin) and Lyrica: treatment of diabetic neuropathy found significant improvement in stance, functional reach, and ankle motor nerve. Lyrica pregabalin Patient Education Generic Name: pregabalin Pronounced: pre GAB a lin dry mouth, constipation."}, {"url": "http://www.everydayhealth.com/drugs/lyrica", "passage_text": "A: Lyrica (pregabalin) is an anticonvulsant or anti-seizure medication. The exact way it works is not completely understood, but it is thought to slow down impulses in the brain and affect pain signals in the body. Lyrica is primarily used to treat seizures, fibromyalgia, and certain types of nerve pain.hat can vary from person to person. Lyrica (pregabalin) is an anticonvulsant or anti-seizure drug that works by slowing down impulses in the brain that cause seizures. It also affects chemicals in the brain that send pain signals across the nervous system."}, {"url": "http://www.naturalconstipationrelief.org/is-lyrica-constipation/", "passage_text": "Lyrica is indicated for the treatment of peripheral and central neuropathic pain in adults. paralytic ileus, constipation) when pregabalin was co-administered with medications that have the potential to produce constipation, such as opioid analgesics. When. Constipation/Diarrhea Urinary retention/ incontinence Neurontin gabapentin) and Lyrica: treatment of diabetic neuropathy found significant improvement in stance, functional reach, and ankle motor nerve. Lyrica pregabalin Patient Education Generic Name: pregabalin Pronounced: pre GAB a lin dry mouth, constipation. This is not a complete list of side effects and others may occur. Call your doctor for medical advice about side effects"}, {"url": "http://www.everydayhealth.com/drugs/lyrica", "passage_text": "A: Lyrica (pregabalin) is a medication used to treat nerve pain, seizures, and fibromyalgia. It works by slowing down impulses in the brain that cause seizures and also affects chemicals in the brain that send pain signals across the nervous system.hat can vary from person to person. Lyrica (pregabalin) is an anticonvulsant or anti-seizure drug that works by slowing down impulses in the brain that cause seizures. It"}, {"url": "http://www.rxlist.com/lyrica-side-effects-drug-center.htm", "passage_text": "Lyrica Overview-Patient Information: Side Effects. SIDE EFFECTS: Drowsiness, dizziness, dry mouth, constipation, difficulty concentrating, swollen arms/legs, and weight gain may occur. If any of these effects persist or worsen, tell your doctor or pharmacist promptly.t is not known whether Lyrica is excreted in human breast milk. Our Lyrica Side Effects Drug Center provides a comprehensive view of available drug information on the potential side effects when taking this medication."}]