[{"url": "http://www.answers.com/Q/How_long_does_it_take_you_to_become_a_PE_teacher", "passage_text": "The most basic college degree to become a school teacher is called a Bachelor Degree. It usually takes 4 years to complete a Bachelor's Degree in Education. My sister completed a Bachelor's Degree in Physical Education at Florida State University in about 4 years in 1968. They may have expanded the program for completion of a Bachelor's Degree in Education, or Physical Education, since then. That depends onn your state requirement for teacher certification. If starting from first year, no college, I would say four to five years to complete the required course work … and field studies. If coming back with a B.A. it can probably done in 2 or 2.5."}, {"url": "http://study.com/articles/Physical_Education_Teacher_How_to_Become_a_PE_Teacher.html", "passage_text": "Learn how to become a physical education teacher. Research the job description and the education and licensing requirements, and find out how to start a career as a physical education teacher. View 10 Popular Schools ». In general, all states require a physical education teacher to hold a bachelor's degree from an accredited teacher education program and pass state licensing exams. Most states require one general exam followed by an exam that focuses on the particular specialty of the teacher."}, {"url": "https://answers.yahoo.com/question/index?qid=20081215120505AAXCiMX", "passage_text": "career path(where to begin, how to move up, any levels etc) You can get more pay with a Master's degree or becoming Nationally Board Certified. education and training requirements: You'll need a BS in Physical Education (4-years) Pros & Cons of teaching PE. Pros: 1. 8 weeks off in Summer. 2. 2 weeks off for Christmas. 3. 1 week off in Spring. "}, {"url": "http://www.answers.com/Q/How_long_does_it_take_to_train_as_a_PE_teacher", "passage_text": "You are looking at two parts in this question: How long does it take to complete the requirements to become a teacher, and how long does it take to complete a Physical E … ducation degree?   The most basic college degree to become a school teacher is called a Bachelor Degree. It usually takes 4 years to complete a Bachelor's Degree in Education. My sister completed a Bachelor's Degree in Physical Education at Florida State University in about 4 years in 1968. They may have expanded the program for completion of a Bachelor's Degree in Education, or Physical Education, since then"}, {"url": "http://www.answers.com/Q/How_long_does_it_take_you_to_become_a_PE_teacher", "passage_text": "To become an elementary school teacher, you have to complete a 4-year bachelor's degree program at an accredited college. During that time, you will complete several weeks of … student teaching. That depends onn your state requirement for teacher certification. If starting from first year, no college, I would say four to five years to complete the required course work … and field studies. If coming back with a B.A. it can probably done in 2 or 2.5."}, {"url": "http://work.chron.com/degree-need-gym-teacher-11550.html", "passage_text": "Bachelor's Degree. Graduating with a bachelor's degree in health and physical education from an accredited college or university is required to become a gym teacher. Some students choose to major in education and minor in physical education, while others choose to major in physical education and minor in education. "}, {"url": "http://learn.org/articles/What_are_the_Requirements_for_Becoming_a_Gym_Teacher.html", "passage_text": "Education. Before becoming a gym teacher, you must obtain a bachelor's degree, such as a Bachelor of Arts or Bachelor of Science, with a major in education and a concentration or second major in physical education. "}, {"url": "http://education.seattlepi.com/long-would-school-order-physical-education-teacher-1471.html", "passage_text": "College Major Courses. Physical education teachers are required to take roughly two years of major courses that focus in great depth and scope on heath and physical education. These classes also vary across institutions, but are often heavily focused on science, teaching methods and physical education courses. "}, {"url": "http://study.com/articles/Physical_Education_Teacher_How_to_Become_a_PE_Teacher.html", "passage_text": "Step 1: Complete a Bachelor's Degree Program. Physical education teachers must complete teacher education programs focused on a health and fitness-related subject. Some colleges and universities offer a Bachelor of Science in Education program with an emphasis on physical education. In general, all states require a physical education teacher to hold a bachelor's degree from an accredited teacher education program and pass state licensing exams. Most states require one general exam followed by an exam that focuses on the particular specialty of the teacher."}]