[{"url": "https://en.wikipedia.org/wiki/Orb-weaver_spider", "passage_text": "The typical orb-weaver spiders (family Araneidae) are the most common group of builders of spiral wheel-shaped webs often found in gardens, fields and forests. Many orb-weavers build a new web each day. Most orb-weavers tend to be active during the evening hours; they hide for most of the day. Generally, towards evening, the spider will consume the old web, rest for approximately an hour, then spin a new web in the same general location."}, {"url": "http://www.spiderbitetreatment.com/orb-weaver-spider/", "passage_text": "The orb weaver spider builds spiral wheel-shaped web. The orb weaver spider is part of the spider family Araneidae and is known for building spiral wheel-shaped webs in forests, fields and even gardens of homes."}, {"url": "https://en.wikipedia.org/wiki/Orb-weaver_spider", "passage_text": "Most arachnid webs are vertical and the spiders usually hang with their head downward. A few webs, such as those of orb-weaver in the genus Metepiera have the orb hidden within a tangled space of web. Some Metepiera are semisocial and live in communal webs. Many orb-weavers build a new web each day. Most orb-weavers tend to be active during the evening hours; they hide for most of the day. Generally, towards evening, the spider will consume the old web, rest for approximately an hour, then spin a new web in the same general location."}, {"url": "http://aggie-horticulture.tamu.edu/galveston/beneficials/beneficial-23_spiny_orb_weaver_spider.htm", "passage_text": "The famous spider from Charlotte's Web is a barn orb-weaver spider, Araneus cavaticus. Orb weaving spiders produce the familiar flat, ornate, circular webs usually associated with spiders. Orbweavers come in many shapes and sizes, but the brightly colored garden orbweavers, Argiope spp., are the largest and best known. One of the bright-hued spiders is the spiny orb weaver, Gasteracantha cancriformis. Although not as large as some of the other orb weavers, its combined color, shape, and distinctive web makes G. cancriformis a very recognizable spider. FIGURE 2."}, {"url": "https://en.wikipedia.org/wiki/Spider_web", "passage_text": "A spider web, spiderweb, spider's web, or cobweb (from the archaic word coppe, meaning spider) is a device created by a spider out of proteinaceous spider silk extruded from its spinnerets. "}, {"url": "https://en.wikipedia.org/wiki/Orb-weaver_spider", "passage_text": "Generally, orb-weaving spiders are three-clawed builders of flat webs with sticky spiral capture silk. The building of a web is an engineering feat, begun when the spider floats a line on the wind to another surface. The spider secures the line and then drops another line from the center, making a Y. Many orb-weavers build a new web each day. Most orb-weavers tend to be active during the evening hours; they hide for most of the day. Generally, towards evening, the spider will consume the old web, rest for approximately an hour, then spin a new web in the same general location."}, {"url": "http://www.mdavid.com.au/spiders/orbweavers.shtml", "passage_text": "An orb weaver includes any spider that makes an orb web, and orb webs are those round webs built on a radiating structure of spokes like a bicycle wheel, like the one in the photo above. Some orb webs can be very big and strong. Because their webs do such a brilliant job at catching and immobilising prey. Here are some of the more common orb-weaving spiders from the east coast of Australia. 1: St Andrew’s Cross Spider with an especially large and clear cross pattern in the centre of its web. 2: The males are much smaller than the females."}, {"url": "http://animals.mom.me/types-orbweaving-spiders-8390.html", "passage_text": "Most types will make their webs just about anywhere, but the most common places to find an orb-shaped web are under covered porches, in corners, around light fixtures, on tree branches and in tall grass. Many orb-weaving spiders are nocturnal and will rebuild their web every night to catch a fresh meal. "}, {"url": "http://www.spiderroom.info/va_barnspider.html", "passage_text": "Description. The Barn Spider is an orb weaver, a spider that spins its web in a circle-type shape. This orb weaver is about 3/4 inch long with a large round abdomen. It spins a large orb web, hangs its head down in the middle at night and retreats to a nearby crevice during the day. This spider is a dark brown color, with darker markings on the back of the abdomen."}, {"url": "http://aggie-horticulture.tamu.edu/galveston/beneficials/beneficial-23_spiny_orb_weaver_spider.htm", "passage_text": "FIGURE 1. One of the bright-hued spiders is the spiny orb weaver, Gasteracantha cancriformis. Although not as large as some of the other orb weavers, its combined color, shape, and distinctive web makes G. cancriformis a very recognizable spider. FIGURE 2."}]