[{"url": "https://en.wikipedia.org/wiki/General_ledger", "passage_text": "The general ledger should include the date, description and balance or total amount for each account. It is usually divided into at least seven main categories. These categories generally include assets, liabilities, owner's equity, revenue, expenses, gains and losses. The general ledger is where posting to the accounts occurs. Posting is the process of recording amounts as credits (right side), and amounts as debits (left side), in the pages of the general ledger. Additional columns to the right hold a running activity total (similar to a chequebook)."}, {"url": "http://college-cram.com/study/accounting/accounting-cycle/general-ledger-accounting/", "passage_text": "The General Ledger. The general ledger is where all accounting transactions are posted in a double entry system using debits (on the left) and credits (on the right) for each transaction. An additional column to the far right can keep a running total of activity in the account, similar to your checkbook. "}, {"url": "http://www.brighthub.com/office/finance/articles/72981.aspx", "passage_text": "You will keep the general ledger, and it will serve as a record (permanently) for your company. When you need to create a balance sheet, most of the information you will need to do this will be found in the general ledger. The first step of setting up a general ledger is to open your ledger. This amount will not be equal to zero. Instead, you will have any tangible assets and invested cash listed as assets. Additionally, any liabilities already accrued (startup loans, mortgage, etc.) will be listed."}, {"url": "http://www.brighthub.com/office/finance/articles/72981.aspx", "passage_text": "The general ledger is the basic record for accounting. It will be the core of any company's record-keeping system. The general ledger is your go-to document where you can determine the fiscal health of the company you are performing accounting for. The first step of setting up a general ledger is to open your ledger. This amount will not be equal to zero. Instead, you will have any tangible assets and invested cash listed as assets. Additionally, any liabilities already accrued (startup loans, mortgage, etc.) will be listed."}, {"url": "http://www.thehrspecialist.com/30289/Company_Records_What_to_Keep_What_to_Dump.hr?cat=tools&sub_cat=white_paper", "passage_text": "In the event that a legal action does transpire, immediately cease all disposal activities. You have to know what you have and how long to keep it—legally and for your own business purposes—before you can establish an efficient records management system. That's why it's important to inventory your records and draw up a company retention schedule. "}, {"url": "http://www.osyb.com/blog/small-business/how-long-should-i-keep-accounting-records/", "passage_text": "4. Seven Year Rule for Record Retention(general rule). The rules on how long to keep financial records varies depending on what you are saving. For up to date tax filings, 7 years is a safe rule of thumb. Some people might say that is too long, but it is easier to follow this rule than to have to keep track how long you should keep different info. We suggest you keep tax returns for the life of your company. Scan them and save them both on and off site."}, {"url": "https://blog.udemy.com/general-ledger-example/", "passage_text": "With software, you record a check that you wrote and in the background, the expense account is automatically debited and is then posted to your accounting ledger for you, saving you time. First, you must know how to decide whether the account should be credited or debited. This is done with accounting journal entries. A general ledger, which is simply a collection of your account charts, is a simple and effective way to view spending and to keep your business on track. The general ledger is used in conjunction with accounting journal entries. In most cases, the general ledger and the journal entries are done on a computer. There are many software programs available that will do most of the work for you, but it is important to know how to do this yourself in case the software crashes or there are power outag"}]