[{"url": "http://www.scripps.org/assets/documents/skin_rashes_zelac.pdf", "passage_text": "What is a rash? Definition by Webster’s – an eruption of the bodyDefinition-The popular term for a group of spots or red, inflamed skin that is usually a symptom of an underlying condition or disorder. Often temporary, a rash is only rarely a sign of a serious problem."}, {"url": "http://www.clinicaladvisor.com/features/that-annular-lesion-is-not-necessarily-tinea/article/117267/", "passage_text": "In most annular lesions for which the diagnosis is uncertain, a skin scraping should be obtained and tested with KOH to determine if the etiology is fungal. The child has been around farm animals that could have exposed her to a fungus. While tinea infection is a common cause of annular skin lesions, consideration of other possible diagnoses is necessary. In a superficial annular lesion with scale, first obtain a KOH. If it is positive, the condition is most likely fungal in origin"}, {"url": "http://www.rightdiagnosis.com/sym/annular_rash.htm", "passage_text": "Causes of Similar Symptoms to Annular rash. Research the causes of these symptoms that are similar to, or related to, the symptom Annular rash: 1  Skin rash (461 causes). 2  Skin blisters (426 causes). 3  Skin ulcers. 4  Psoriasis. 5  Tinea (13 causes). 6  Dermatophytoses. 7  Leprosy (23 causes). 8  Urticaria (156 causes)."}, {"url": "https://en.wikipedia.org/wiki/Erythema_Annulare_Centrifugum", "passage_text": "Erythema anulare centrifugum (also known as Deep gyrate erythema, Erythema perstans, Palpable migrating erythema, and Superficial gyrate erythema) is a descriptive term for a skin lesion. The lesions form consists of redness (erythema) in a ring form (anulare) that spreads from the center (centrifugum). EAC was first described by Darier in 1916. Many different terms have been used to classify these types of lesions and it is still controversial on what exactly defines EAC."}, {"url": "http://medical-dictionary.thefreedictionary.com/annular+dermatitis", "passage_text": "ring-shaped. annular dermatitis. inflammation and crusting in an annular pattern is characteristic of dermatophytosis (ringworm), particularly in pigs. annular vessel of eye. a loop of the hyaloid artery which encircles the margin of the optic cup during development of the eye."}, {"url": "http://www.betterlife4backs.com/about_chiro/What_is_a_Disc_Bulge.htm", "passage_text": "WHAT IS A DISC BULGE? To really understand what a bulging disc is, I will discuss the classifications to describe the disc lesions because there are a variety of terms commonly used like disc prolapse, slipped disc, ruptured disc and disc herniation. Another term people often hear is called Disc Dessication."}, {"url": "http://www.rightdiagnosis.com/sym/annular_rash.htm", "passage_text": "1 Annular rash and Skin symptoms (6 causes). 2  Annular rash and Nerve symptoms (6 causes). 3  Annular rash and Sensory symptoms (6 causes). 4  Annular rash and Arm symptoms (5 causes). 5  Annular rash and Head symptoms (5 causes). 6  Annular rash and Leg symptoms (5 causes). 7  Annular rash and Limb symptoms (5 causes). Research the causes of these symptoms that are similar to, or related to, the symptom Annular rash: 1  Skin rash (461 causes). 2  Skin blisters (426 causes). 3  Skin ulcers. 4  Psoriasis. 5  Tinea (13 causes). 6  Dermatophytoses. 7  Leprosy (23 causes). 8  Urticaria (156 causes)."}, {"url": "http://www.aafp.org/afp/2001/0715/p289.html", "passage_text": "Annular lesions are extremely common and striking in appearance but can also be misleading. The term “annular” stems from the Latin word “annulus,” meaning ringed. 1 The lesions appear as circular or ovoid macules or patches with an erythematous periphery and central clearing. The condition is considered benign and is characterized by smooth, skin-colored annular plaques and papules. 1 The lesions are usually found on the hands, feet, wrists and ankles but can potentially occur anywhere on the body."}, {"url": "http://www.rightdiagnosis.com/sym/annular_rash.htm", "passage_text": "Annular rash: A rash that is ring shaped. See detailed information below for a list of 10 causes of Annular rash, Symptom Checker, including diseases and drug side effect causes. » Review Causes of Annular rash: Causes | Symptom Checker ». Research the causes of these symptoms that are similar to, or related to, the symptom Annular rash: 1  Skin rash (461 causes). 2  Skin blisters (426 causes). 3  Skin ulcers. 4  Psoriasis. 5  Tinea (13 causes). 6  Dermatophytoses. 7  Leprosy (23 causes). 8  Urticaria (156 causes)."}]