[{"url": "http://hyperphysics.phy-astr.gsu.edu/hbase/electric/conins.html", "passage_text": "Conductors and Insulators. In a conductor, electric current can flow freely, in an insulator it cannot. Metals such as copper typify conductors, while most non-metallic solids are said to be good insulators, having extremely high resistance to the flow of charge through them. Conductor implies that the outer electrons of the atoms are loosely bound and free to move through the material. Any external influence which moves one of them will cause a repulsion of other electrons which propagates, domino fashion through the conductor. Simply stated, most metals are good electrical conductors, most nonmetals are not."}, {"url": "https://answers.yahoo.com/question/index?qid=20140116194621AA83gHc", "passage_text": "Copper, Gold, and Silver are all good conductors of heat and electricity. Generally, all transition metals, which are the elements located in the middle of the periodic table, will be good conductors. Maria · 2 years ago. "}, {"url": "http://www.answers.com/Q/What_are_elements_that_are_good_conductors_of_heat_and_electricity", "passage_text": "metals are the best conductor of heat and electricity. because the metals contains free electrons. the best conductor is silver (Ag). Metals like silver, copper & aluminiu … m are good conductor of eleectricity as well as of heat. + 4 others found this useful. Margaret Hutchinson. "}, {"url": "http://mste.illinois.edu/users/Murphy/HoleFlow/Structure.php", "passage_text": "Atoms of some elements let go of their outer electrons pretty easily, which makes these elements good conductors. In other elements, the atoms hold on to their electrons, so these elements don't conduct electricity as well. Copper and silicon are used here as examples. The same general ideas apply to other elements. "}, {"url": "https://answers.yahoo.com/question/index?qid=20070830050954AAo5rtR", "passage_text": "Best Answer: All metals can conduct electricity. The best conductor is silver. Then Copper Here is a list of specific resistance in Ohms*mm^2/m-Silver - 0.016 - Copper - 0.0175 - Gold - 0.022 - Aluminium 0.0278 Those are the best conductors according their rank. There are non-metallic conductors."}, {"url": "http://hyperphysics.phy-astr.gsu.edu/hbase/electric/conins.html", "passage_text": "In copper, the valence electrons are essentially free and strongly repel each other. Any external influence which moves one of them will cause a repulsion of other electrons which propagates, domino fashion through the conductor. Simply stated, most metals are good electrical conductors, most nonmetals are not."}, {"url": "http://www.convertit.com/Go/ConvertIt/Calculators/Science/Periodic_Table.ASP", "passage_text": "A solid substance that is a good conductor of heat and electricity. Can be formed into many shapes. Metalloid. Middle elements - conduct heat and electricity better than nonmetals, but not as well as metals. Easier to shape than nonmetals, but not as easy as metals. "}, {"url": "http://chemistry.about.com/od/elements/f/What-Is-The-Most-Conductive-Element.htm", "passage_text": "Although it is the best conductor, copper and gold are used more often in electrical applications because copper is less expensive and gold has a much higher corrosion resistance. Most metals conduct electricity. Other elements with high electrical conductivity, are aluminum, zinc, nickel, iron and platinum. "}, {"url": "http://www.answers.com/Q/What_elements_are_good_conductors_of_electricity", "passage_text": "metals are the best conductor of heat and electricity. because the metals contains free electrons. the best conductor is silver (Ag). Metals like silver, copper & aluminiu … m are good conductor of eleectricity as well as of heat. + 4 others found this useful. Margaret Hutchinson. Metals. The elements that are classified as Transition Metals and are located in Groups 3 - 12 of the Periodic Table are elements that are shiny bendable and good conductors … of"}, {"url": "https://answers.yahoo.com/question/index?qid=20070830050954AAo5rtR", "passage_text": "Report Abuse. The best electrical conductor are superconductors. But it is not an element. Among other metals Aluminium,copper,gold ,platinum,silver etc ar very good conductors. But to use gold, silver and platinum is not at all economic. The best conductor is silver. Then Copper Here is a list of specific resistance in Ohms*mm^2/m-Silver - 0.016 - Copper - 0.0175 - Gold - 0.022 - Aluminium 0.0278 Those are the best conductors according their rank. There are non-metallic"}]