[{"url": "http://bakingbites.com/2010/07/what-is-brioche/", "passage_text": "But what sets brioche apart from, say, regular sandwich bread? Brioche is an enriched French bread, meaning that the dough contains a high proportion of fat it in. Brioche is often used in sweet dishes, leading to the perception that the bread is sweet."}, {"url": "https://en.wikipedia.org/wiki/Brioche", "passage_text": "Brioche is considered a Viennoiserie, in that it is made in the same basic way as bread, but has the richer aspect of a pastry because of the extra addition of eggs, butter, liquid (milk, water, cream, and, sometimes, brandy) and occasionally a bit of sugar. Brioche Nanterre is a loaf of brioche made in a standard loaf pan. Instead of shaping two pieces of dough and baking them together, two rows of small pieces of dough are placed in the pan. Loaves are then proofed (allowed to rise) in the pan, fusing the pieces together."}, {"url": "https://en.wikipedia.org/wiki/Brioche_knitting", "passage_text": "Brioche knitting is a family of knitting patterns involving tucked stitches, i.e., yarn overs that are knitted together with a slipped stitch from the previous row. The brioche-purl stitch (or the burp stitch (abbreviated brp) is the purled version. Each bark or burp stitch is followed by a yarn-front, slip-one, yarnover (yf-sl1yo). This sets up the bark and burp stitches for the next row."}, {"url": "https://en.wikipedia.org/wiki/Brioche", "passage_text": "[bʁi.ɔʃ]) is a pastry of French origin that is similar to a highly enriched bread, and whose high egg and butter content give it a rich and tender crumb. Brioche Nanterre is a loaf of brioche made in a standard loaf pan. Instead of shaping two pieces of dough and baking them together, two rows of small pieces of dough are placed in the pan. Loaves are then proofed (allowed to rise) in the pan, fusing the pieces together."}, {"url": "http://www.definitions.net/definition/brioche", "passage_text": "Brioche. Brioche is a pastry akin to a highly enriched bread of French origin, whose high egg and butter content give it a rich and tender crumb. It is light and slightly puffy, more or less fine, according to the proportion of butter and eggs"}, {"url": "https://en.wikipedia.org/wiki/Brioche", "passage_text": "Brioche, along with pain au lait and pain aux raisins —which are commonly eaten at breakfast or as a snack—form a leavened subgroup of Viennoiserie. Brioche Nanterre is a loaf of brioche made in a standard loaf pan. Instead of shaping two pieces of dough and baking them together, two rows of small pieces of dough are placed in the pan. Loaves are then proofed (allowed to rise) in the pan, fusing the pieces together."}, {"url": "https://en.wikipedia.org/wiki/Brioche", "passage_text": "Brioche is often cooked with fruit or chocolate chips and served as a pastry or as the basis of a dessert with many local variations in added ingredients, fillings or toppings. Brioche is eaten with dessert or tea, but also has numerous uses in cuisine. Brioche Nanterre is a loaf of brioche made in a standard loaf pan. Instead of shaping two pieces of dough and baking them together, two rows of small pieces of dough are placed in the pan. Loaves are then proofed (allowed to rise) in the pan, fusing the pieces together."}, {"url": "http://www.thefreedictionary.com/brioche", "passage_text": "Noun. 1. brioche-a light roll rich with eggs and butter and somewhat sweet. bun, roll-small rounded bread either plain or sweet. Translations. [briˈɒʃ] n → brioche f."}, {"url": "http://bakingbites.com/2010/07/what-is-brioche/", "passage_text": "July 13, 2010 in Baking, How-To's and Tips, Ingredients 10 Comments. Brioche is a type of bread that comes up often in recipes, particularly recipes for bread pudding and french toast where you might want to add some extra richness to the finished product. Brioche is often used in sweet dishes, leading to the perception that the bread is sweet."}]