[{"url": "http://www.innerbody.com/image/musfov.html", "passage_text": "The muscular system is responsible for the movement of the human body. Attached to the bones of the skeletal system are about 700 named muscles that make up roughly half of a person’s body weight. Each of these muscles is a discrete organ constructed of skeletal muscle tissue, blood vessels, tendons, and nerves. Muscle tissue is also found inside of the heart, digestive organs, and blood vessels. In these organs, muscles serve to move substances throughout the body.... Skeletal muscle fibers differ dramatically from other tissues of the body due to their highly specialized functions. Many of the organelles that make up muscle fibers are unique to this type of cell. The sarcolemma is the cell membrane of muscle fibers."}, {"url": "http://www.teachpe.com/anatomy/muscles.php", "passage_text": "Major Muscles of the Human Body. Click on the links below to see the major muscles of the human body in detail with origins, insertions, actions, common injuries and more. "}, {"url": "http://www.innerbody.com/anatomy/muscular/upper-torso", "passage_text": "Nine muscles of the chest and upper back are used to move the humerus (upper arm bone). The coracobrachialis and pectoralis major muscles connect the humerus anteriorly to the scapula and ribs, flexing and adducting the arm toward the front of the body when you reach forward to grab an object. These important muscles control many motions that involve moving the arms and head – such as throwing a ball, looking up at the sky, and raising your hand. Breathing, a vital body function, is also controlled by the muscles connected to the ribs of the chest and upper back...."}, {"url": "https://en.wikipedia.org/wiki/List_of_muscles_of_the_human_body", "passage_text": "Nevertheless, the exact number is difficult to define because different sources group muscles differently, e.g. regarding what is defined as different parts of a single muscle or as several muscles. Examples range from 640 to 850. The muscles of the human body can be categorized into a number of groups which include muscles relating to the head and neck, muscles of the torso or trunk, muscles of the upper limbs, and muscles of the lower limbs. The action refers to the action of each muscle from the standard anatomical position. In other positions, other actions may be performed. These muscles are described using anatomical terminology."}, {"url": "http://www.healthpages.org/anatomy-major-anterior-muscles/", "passage_text": "This chart shows the outermost layer, called the superficial layer, of our major muscles. Muscles are usually work in pairs because although they can contract and shorten (flex), they are pulled by an opposite (antagonist) muscle to straighten out (extend) again. It’s the largest and the most outermost of the three flat muscles of the outside front of the abdomen. It has limited actions in both flexion and rotation of the vertebral column. One side of the obliques contracting can create lateral flexion."}, {"url": "http://study.com/academy/lesson/major-muscle-groups-of-the-human-body.html", "passage_text": "The major muscle groups of the lower body are the quadriceps, hamstrings (biceps femoris and semitendinosus), gluteus, gastrocnemius and soleus. The quadriceps form the front part of your upper leg, many people refer to them as thigh muscles. These muscles are used for motions such as walking or kicking a ball. The first of these groups is collectively known as the abdominal muscles. Abdominal muscles, or abs, are found overtop your stomach. In the diagram below, you'll notice these muscles forming the midsection of the body's front side."}, {"url": "http://www.healthpages.org/anatomy-major-anterior-muscles/", "passage_text": "Pectoralis major. A chest muscle that pulls the arm in towards the body. This is one of the internal rotator muscles that attach the humerus and internally rotate the arm. The pectoralis major originates along the clavicle, down the sternum, and across the ribs and inserts into the humerus. It’s the largest and the most outermost of the three flat muscles of the outside front of the abdomen. It has limited actions in both flexion and rotation of the vertebral column. One side of the obliques contracting can create lateral flexion."}, {"url": "http://study.com/academy/lesson/major-muscle-groups-of-the-human-body.html", "passage_text": "Skeletal muscle is muscle that is used for moving the body. The major skeletal muscle groups forming the upper body are the abdominal, pectoral, deltoid, trapezius, latissimus dorsi, erector spinae, biceps, and triceps. The major skeletal muscle groups of the lower body are the quadriceps, hamstrings, gastrocnemius, soleus, and gluteus. The first of these groups is collectively known as the abdominal muscles. Abdominal muscles, or abs, are found overtop your stomach. In the diagram below, you'll notice these muscles forming the midsection of the body's front side."}, {"url": "http://www.healthpages.org/anatomy-major-anterior-muscles/", "passage_text": "Teres major muscle. is a muscle of the arm and one of six scapulohumeral muscles. It is not part of the rotator cuff. The teres major is a medial rotator and adductor of the humerus and assists the latissimus dorsi in drawing the previously raised humerus down and backward (extension, but not hyper extension). It’s the largest and the most outermost of the three flat muscles of the outside front of the abdomen. It has limited actions in both flexion and rotation of the vertebral column. One side of the obliques contracting can create lateral flexion."}]