[{"url": "http://iotsolutionsalliance.intel.com/member-roster/american-megatrends-inc", "passage_text": "American Megatrends, Inc. American Megatrends Inc. (AMI) is a one-stop-shop technology provider! Best known for AMIBIOS and Aptio, AMI supplies core firmware, remote management, KVM over IP, motherboards, disk subsystems and innovative storage solutions to today's industry leaders. "}, {"url": "https://ami.com/", "passage_text": "About American Megatrends, Inc. (AMI). American Megatrends (AMI) is a leader in BIOS, UEFI, Remote Management, Network Data Storage, Android Solutions and more-using a proven process to support its valued customers as they design, develop and bring their products and solutions to life. For more information on Bluetooth support in Aptio V UEFI Firmware from American Megatrends, please contact an AMI representative at 1-800-U-BUY-AMI / +1-770-246-8600, or visit www.ami.com. Bluetooth® is a registered trademark of the Bluetooth SIG. All other trademarks are the property of their respective owners."}, {"url": "http://answers.microsoft.com/en-us/ie/forum/ie10-windows_7/what-is-american-megatrends/ddc0bdba-5b2b-44cf-89ea-598964bc68d9", "passage_text": "American megatrend or AMI is the Basic input output system or better know as BIOS. It will show up depending on your machine, if you press certain keys or key. But if it is starting up without any input from the user, You may have a problem with hardware. out of curiosity what is it asking you to do. and if you could. "}, {"url": "https://en.wikipedia.org/wiki/American_Megatrends", "passage_text": "American Megatrends Incorporated (AMI) is an American hardware and software company that specializes in PC hardware and firmware. The company was founded in 1985 by Pat Sarma and S. Shankar, who was chairman and president as of 2011. AMIBIOS (also written as AMI BIOS) is the IBM PC-compatible BIOS developed and sold by American Megatrends. As of 1994, the company claimed that 75% of PC clones used the AMIBIOS. It is used on motherboards made by AMI and by other companies."}, {"url": "http://www.tricksage.com/2013/11/showing-american-megatrends-window-on.html", "passage_text": "American Megatrends Incorporated (AMI) is an America based hardware and software company that focused in PC hardware and software. “American Megatrends” Press F1 to run setup window will show until you change the battery. The another problem is the when system starts up there will be a change in the Date and time. It will be difficult to browse https websites that time."}, {"url": "http://www.tomshardware.com/answers/id-1735325/american-megatrends-startup.html", "passage_text": "For some reason when i turn on my PC American Megatrends opens up then it automatically goes to Intel Boot Agent, then after 3 seconds Intel Boot Agent fails and then my PC starts up normally... I've also noticed that my Product Key is different then the one on my sticker on the side of my PC... So my question is... How do i stop the American Megatrends and the Intel Boot Agent to open when i turn my PC on, because it's really annoying... Oh yeah, I also noticed a new button--. When i right click Computer and go to properties. (Control Panel\\System and Security\\System)."}, {"url": "http://www.techsupportforum.com/forums/f16/american-megatrends-warning-of-imminent-hard-drive-failure-130102.html", "passage_text": "Hallo there. During pc boot I'm getting a screen coming up from American Megatrends. It contains information about various drives and at the bottom the warning that my hard drive is in danger of imminent failure and that I should backup data and replace it. "}, {"url": "https://en.wikipedia.org/wiki/American_Megatrends", "passage_text": "American Megatrends Inc. (AMI) was founded in 1985 by Subramonian Shankar and Pat Sarma with funds from a previous consulting venture, Access Methods Inc. (also AMI). Access Methods was a company run by Pat Sarma and his partner. AMIBIOS (also written as AMI BIOS) is the IBM PC-compatible BIOS developed and sold by American Megatrends. As of 1994, the company claimed that 75% of PC clones used the AMIBIOS. It is used on motherboards made by AMI and by other companies."}, {"url": "http://www.answersthatwork.com/Download_Area/ATW_Library/Hardware_Maint/HW___8-American_Megatrends_Inc_(AMI)_2.61_BIOS_setup_guidelines_for_AM2_AM3_motherboards.pdf", "passage_text": "Award, American Megatrends (AMI), Phoenix, etc... l What revision of the BIOS your motherboard has, e.g. v4.51, v5.00, etc.. In this guide and manual we are providing setup guidelines for the American Megatrends Inc (AMI) v02.61 BIOS for AM2/AM2+/AM3 motherboards (AMD chipset) . "}, {"url": "https://answers.yahoo.com/question/index?qid=20130417110440AA0lFpQ", "passage_text": "About a week ago when I booted up my laptop (Asus u50a) the American Megatrends screen started popping up. "}]