[{"url": "http://www.philosophyzer.com/the-allegory-of-the-cave-by-plato-summary-and-meaning/", "passage_text": "The Cave. 1  In Plato’s theory, the cave represents people who believe that knowledge comes from what we see and hear in the world – empirical evidence. 2  The cave shows that believers of empirical knowledge are trapped in a ‘cave’ of misunderstanding. The Allegory of the cave by Plato should not be taken at face value. In essays and exams, whoever is marking it expects you to have a deeper understanding of the meaning of the theory. You can then use these to think about criticisms and then to form your own opinion."}, {"url": "http://www.bachelorandmaster.com/creationofknowledge/allegory-of-the-cave.html", "passage_text": "Plato (427-347 BC). In allegorical writing characters, actions and setting are used as symbols and they should be interpreted to make the allegorical meaning. In the Allegory of the Cave, Plato has given a description of the cave of the cave world. The cave is very dark because there is little light inside it and hardly seen the objects. There are some chained people on their necks as well as feet, these chained people cannot move easily. In Allegory of the cave, Plato has also described about our perception. He says that there are two types of perception: sensory perception and spiritual"}, {"url": "http://historyguide.org/intellect/allegory.html", "passage_text": "Plato, The Allegory of the Cave The son of a wealthy and noble family, Plato (427-347 B.C.) was preparing for a career in politics when the trial and eventual execution of Socrates (399 B.C.) changed the course of his life. "}, {"url": "https://en.wikipedia.org/wiki/Allegory_of_the_Cave", "passage_text": "The Allegory of the Cave (also called the analogy of the cave, myth of the cave, metaphor of the cave, parable of the cave, and Plato's Cave) is presented by the Greek philosopher Plato in his work the Republic (514a–520a) to compare the effect of education (παιδεία) and the lack of it on our nature . The allegory is presented after the analogy of the sun (508b–509c) and the analogy of the divided line (509d–513e)."}, {"url": "http://www.philosophyzer.com/the-allegory-of-the-cave-by-plato-summary-and-meaning/", "passage_text": "The ‘Allegory Of The Cave’ is a theory put forward by Plato, concerning human perception. Plato claimed that knowledge gained through the senses is no more than opinion and that, in order to have real knowledge, we must gain it through philosophical reasoning. ‘The Allegory of the Cave’ by Plato. The Allegory of the cave by Plato should not be taken at face value. In essays and exams, whoever is marking it expects you to have a deeper understanding of the meaning of the theory. You can then use these to think about criticisms and then to form your own opinion."}, {"url": "http://www.wisegeek.org/what-is-the-allegory-of-the-cave.htm", "passage_text": "The Allegory of the Cave is a narrative device used by the Greek philosopher Plato in The Republic, one of his most well known works. It is an extended allegory where humans are depicted as being imprisoned by their bodies and what they perceive by sight only. "}, {"url": "http://m.learning.hccs.edu/faculty/fred.gaines/math0312/tips-for-success/the-cave", "passage_text": "An Analysis of The Allegory of the Cave. The Allegory of the Cave is Plato's explanation of the education of the soul toward enlightenment. He sees it as what happens when someone is educated to the level of philosopher. Socrates, in Book VII of The Republic, just after the allegory told us that the cave was our world and the fire was our sun. He said the path of the prisoner was our soul's ascent to knowledge or enlightenment. He equated our world of sight with the intellect's world of opinion."}]