[{"url": "http://smallbusiness.chron.com/account-incorporation-costs-3924.html", "passage_text": "Step 6. Visit the website for the Internal Revenue Service and the tax board for your state of incorporation to learn of any filing fees that correspond with your form of corporation. Usually, there are different fees associated with S corporations versus C and other corporations. Make sure to examine both the taxes for your corporation as well as the impact on your personal finances. Step 5. Look at the costs and fees in other states by visiting their secretary of state websites. Many companies incorporate in states other than where they are based for tax and regulatory advantages. Nevada and Delaware are common states for incorporation"}, {"url": "https://www.legalzoom.com/articles/what-are-the-general-costs-of-incorporating", "passage_text": "There are typically four types of fees to incorporating: a fee to file the articles of incorporation with the Secretary of State; a first year franchise tax prepayment; fees for various governmental filings; and attorney fees. The corporation itself pays taxes, at the corporate rate, on any profits of the corporation. However, incorporation can be a complicated and costly process, and it is important a business owner understands the general costs of incorporating before beginning the incorporation process."}, {"url": "https://www.sba.gov/blogs/startup-cost-tax-deductions-how-write-expense-starting-your-business", "passage_text": "If you started your business in 2011, had startup costs of $50,000 or less, and incurred startup and/or organizational expenses after October 22, 2004, you can deduct up to $5,000 in business startup costs on your 2011 tax return. You can see from these examples that if your startup costs are going to exceed $50,000, then your deductible is reduced, and completely wiped out if you exceed $55,000 in expenses."}, {"url": "https://www.legalzoom.com/articles/what-are-the-general-costs-of-incorporating", "passage_text": "Fees for Various Governmental Filings: Corporations are required to pay between $50 and $200 in government filing fees. This is in addition to the filing fees paid to the Secretary of State. Government filings are based on the type of business being incorporated and the state in which the business is incorporating. The corporation itself pays taxes, at the corporate rate, on any profits of the corporation. However, incorporation can be a complicated and costly process, and it is important a business owner understands the general costs of incorporating before beginning the incorporation process."}, {"url": "https://incorporate.com/illinois.html", "passage_text": "Costs and Fees to Incorporate in Illinois. The state filing fee to incorporate in Illinois is $125.00, plus the initial franchise tax of at least $25.00. It typically takes 7-10 business days for Illinois business registration. Expedited filings, which require an additional fee, typically take 24 hours."}, {"url": "http://forums.redflagdeals.com/how-amortize-incorporation-costs-617636/", "passage_text": "Originally Posted by timv Just curious, why not just expense incorporation costs in your first year of business. If you happen not to make any money in your first year you can just carry the loss forward to future tax years. "}, {"url": "https://www.legalzoom.com/articles/what-are-the-general-costs-of-incorporating", "passage_text": "How to Choose Your State: Because incorporation costs vary from state-to-state, it is important to investigate various states' incorporation costs before deciding where to incorporate. If you intend to do business in only one state, it is usually a wise decision to incorporate in that state. The corporation itself pays taxes, at the corporate rate, on any profits of the corporation. However, incorporation can be a complicated and costly process, and it is important a business owner understands the general costs of incorporating before beginning the incorporation process."}, {"url": "http://www.bookkeeping-essentials.com/incorporation-cost-bookkeeping-entries.html", "passage_text": "Hi Diane, All you need to do is expense the $175 to professional costs to clear the asset. In about 2000, the rules for handling incorporation costs changed. I think Section 3064 paragraph 12 of the old CICA Handbook (I no longer have a Handbook to verify this) excluded incorporation costs from intangible assets. It used to be they were capitalized and amortized over time. Now they are expensed for the most part."}]