[{"url": "http://tootsie.com/", "passage_text": "Launched in 1896 by the popularity of a single product, the iconic oblong piece of chewy, chocolate candy-Tootsie Roll Industries has grown to become one of the country's largest candy companies, with a lineup that includes some of the world's most popular candy, chocolate, and bubble gum brands. Thank you for visiting! Family of Products. Tootsie's brands include some of the most familiar candy names: Tootsie Roll, Tootsie Pop, Charms Blow Pop, Mason Dots, Andes, Sugar Daddy, Charleston Chew, Dubble Bubble, Razzles, Caramel Apple Pop, Junior Mints, Cella's Chocolate-Covered Cherries, and Nik-L-Nip."}, {"url": "http://shop.tootsie.com/Dubble-Bubble/c/TootsieRoll@DubbleBubble", "passage_text": "Dubble Bubble Bubble Gum Fun is the ultimate bubble gum mix! With a generous helping of Classic Chunk Dubble Bubble Gum, Dubble Bubble Gum Balls, and Cry Baby Extra Sour Gum Balls, this mix has something for everyone. In a convenient stand-up resealable bag. 27 oz. "}, {"url": "http://www.candywarehouse.com/brands/dubble-bubble/", "passage_text": "Dubble Bubble. Once upon a time, a chewing gum company in Philadelphia was searching for a non-sticky gum formula that would allow kids to blow bubbles with ease. Finally in 1928, after a year’s worth of trial and error, Walter Diemer created one… only to lose the recipe the very next day! Diemer’s new bubble gum creation was soon sold under the name of -- you guessed it -- Dubble Bubble! Treat yourself to America’s original bubble gum, now in an assortment of sizes, shapes, colors, and flavors -- fabulous bubble blowing madness is sure to ensue with every chew! 1 2 3 4 5 6 Next of 6 View All."}, {"url": "http://tootsie.com/candy/dubble-bubble/dubble-bubble-gum-balls", "passage_text": "Dubble Bubble History: Created in 1928 by Fleer Candy Company accountant Walter Diemer (he claims he stumbled upon the recipe by accident), the gum featured comic strip featuring brothers Dub and Bub (replaced in 1950 by Pud). Dubble Bubble joined the Tootsie family in 2003, adding its standing as the world’s favorite bubble gum brand to the world’s favorite candy lineup. Click Here to download the Dubble Bubble Bulk Catalog. 1  Nut Free. 2  Kosher. 3  Gluten Free. 4  Peanut Free."}, {"url": "https://www.gumball.com/pages/history-of-dubble-bubble", "passage_text": "Click to see the most amazing selection of Dubble Bubble gumballs on earth! The world’s first bubble gum is Dubble Bubble. It was invented in 1928 by Walter E. Diemer—an accountant at Fleer Company. After his retirement, Diemer admitted that the recipe was discovered by accident. "}, {"url": "https://en.wikipedia.org/wiki/Dubble_Bubble", "passage_text": "Dubble Bubble gum products are nut-free, gluten-free, peanut-free and kosher. Dubble Bubble twist gum is a 5 g, bite-size piece of chewing gum containing 20 calories with 0 g of fat, 0 mg of cholesterol, 5 mg of sodium, 5 g of carbohydrates, 0 g of dietary fiber, 4 g of sugar and 0 g of protein. Diemer’s bubble gum was the first-ever commercially sold bubble gum, and its sales surpassed 1.5 million dollars in the first year. To help sell the new bubble gum, Diemer himself taught salespeople how to blow bubbles so that they in turn could teach potential customers."}, {"url": "https://en.wikipedia.org/wiki/Dubble_Bubble", "passage_text": "In 1957 Fleer introduced the first gum 6-pack with Dubble Bubble. In 1998, Dubble Bubble was purchased by Concord Confections and in 1999 they introduced Dubble Bubble as a gumball. In 2003, Tootsie Roll Industries acquired Concord and today the gum is sold in over 50 countries. Diemer’s bubble gum was the first-ever commercially sold bubble gum, and its sales surpassed 1.5 million dollars in the first year. To help sell the new bubble gum, Diemer himself taught salespeople how to blow bubbles so that they in turn could teach potential customers."}, {"url": "http://tootsie.com/candy/dubble-bubble/dubble-bubble-gum-balls", "passage_text": "It also was part of the first-ever gum five-pack (1957). Dubble Bubble joined the Tootsie family in 2003, adding its standing as the world’s favorite bubble gum brand to the world’s favorite candy lineup. Click Here to download the Dubble Bubble Bulk Catalog. 1  Nut Free. 2  Kosher. 3  Gluten Free. 4  Peanut Free."}, {"url": "http://www.oldtimecandy.com/walk-the-candy-aisle/dubble-bubble-gum", "passage_text": "Dubble Bubble Gum History. Created in 1928 by Fleer Candy Company accountant Walter Diemer (he claims he stumbled upon the recipe by accident), the gum featured comic strip featuring brothers Dub and Bub (replaced in 1950 by Pud). It grew in popularity, and was even distributed as part of military rations during World War II"}]