[{"url": "http://link.springer.com/article/10.1007/BF02475355", "passage_text": "Abstract. A gas-lift bubble column was used to investigate the kinetics of the reaction between oxygen and aqueous solutions of sodium sulfite in the presence of cobalt sulfate catalyst. Reaction orders have been determined for the sulfite, catalyst, and oxygen under high and low oxygen partial-pressure conditions."}, {"url": "http://www.indspec-chem.com/PRODUCTS/SodiumSulfite/SodiumSulfite.asp", "passage_text": "Sodium Sulfite. Sodium Sulfite, Commercial, Anhydrous is an economical chemical for the sulfite pulping of wood in manufacturing various grades of paper. It is also a source for sodium sulfide used in Kraft pulping. Sodium Sulfite is oxidized to sodium sulfate and is used to remove oxygen from boiler feed water."}, {"url": "http://scrantonassociates.com/soc.pdf", "passage_text": "The performance of sodium sulfite is very sensitive to catalysis from trace amounts of manganese, copper, iron, nickel, or cobalt. The sulfite/oxygen reaction is known to be inhibited by some alcohols, phenols, amines, and. thiosulfate."}, {"url": "http://www.sciencedirect.com/science/article/pii/S1385894707002471", "passage_text": "Using intermittent apparatus, the intrinsic oxidation kinetics of sodium sulfite catalyzed by peracetic acid were subsequently studied. The findings showed that the intrinsic reaction was 1.0 order in peracetic acid, 1.5 order in sulfite and zero order in dissolved oxygen."}, {"url": "http://www.google.com/patents/US4231894", "passage_text": "The present invention is directed to a method of stabilizing aqueous solutions containing alkali metal sulfite or bisulfite and a catalyst therefor. The catalyzed sulfites which are of primary concern in the present instance are those which are used to inhibit or control oxygen corrosion in water treatment,..."}, {"url": "http://chemicalland21.com/industrialchem/inorganic/SODIUM%20SULFIDE.htm", "passage_text": "Sulfite (also sulphite) is a compound that contain the sulfite ion SO 3. Sulfites are salts or esters of sulfurous acid (H 2 SO 3), formed by replacing one or both of the hydrogens with a metal or a radical as in sodium sulfite, Na 2 SO 3."}, {"url": "http://www.sciencedirect.com/science/article/pii/S0009250904007122", "passage_text": "The sulfite oxidation reaction rate was then measured photographically for various sodium sulfite and Co 2+ 2+ concentrations. The sulfite oxidation reaction rate was affected by the mass transfer characteristics of the gas–liquid absorbers with the cobalt ion catalyst as well as the reaction kinetics."}]