[{"url": "http://geography.about.com/library/faq/blqzdistancedegree.htm", "passage_text": "&quot;Big Five&quot; Personality Quiz. Degrees of latitude are parallel so the distance between each degree remains almost constant but since degrees of longitude are farthest apart at the equator and converge at the poles, their distance varies greatly. Each degree of latitude is approximately 69 miles (111 kilometers) apart. The range varies (due to the earth's slightly ellipsoid shape) from 68.703 miles (110.567 km) at the equator to 69.407 (111.699 km) at the poles. This is convenient because each minute (1/60th of a degree) is approximately one mile. A degree of longitude is widest at the equator at 69.172 miles (111.321) and gradually shrinks to zero at the poles. At 40° north or south the distance between a degree of longitude is 53 miles (85 km). "}, {"url": "http://www.colorado.edu/geography/gcraft/warmup/aquifer/html/distance.html", "passage_text": "Longitude (X axis value): Length of 1 degree of Longitude = cosine (latitude) * length of degree (miles) at equator 1° Longitude = cos (33.1519) * 69.172 mi = 57.912 miles * 5280 feet · mile-1 = 305,775 ft. Latitude (Y axis value): Degrees of Latitude vary from polar flattening, but only by 0.7 miles (1.13 km). Since this value is neglible, you can ignore the effects of flattening to obtain the length of 1 degree of latitude (http://www.ncgia.ucsb.edu/education/curricula/giscc/units/u014/u014_f.html)."}, {"url": "https://en.wikipedia.org/wiki/Longitude", "passage_text": "Longitude at a point may be determined by calculating the time difference between that at its location and Coordinated Universal Time (UTC). Since there are 24 hours in a day and 360 degrees in a circle, the sun moves across the sky at a rate of 15 degrees per hour (360°/24 hours = 15° per hour). So if the time zone a person is in is three hours ahead of UTC then that person is near 45° longitude (3 hours × 15° per hour = 45°"}, {"url": "https://answers.yahoo.com/question/index?qid=20080129210207AAWv6pg", "passage_text": "In measuring the distance between meridians of longitude, we are measuring along a parallel of latitude, and the distance varies from a little over 60 nautical miles at the equator, to zero at the poles. In my answer to your other question, I noted that there are not EXACTLY 60 nautical miles per degree at the equator. "}, {"url": "http://www.colorado.edu/geography/gcraft/warmup/aquifer/html/distance.html", "passage_text": "we only want a fraction of the total 1 degree: 305,775 ft · 1° of longitude-1 * 0.4292° longitude on map (difference between X minimum and maximum in Grid Info...) = = 131,239 ft along bottom latitude This is the X value = 131,239 ft. Latitude (Y axis value): Degrees of Latitude vary from polar flattening, but only by 0.7 miles (1.13 km). Since this value is neglible, you can ignore the effects of flattening to obtain the length of 1 degree of latitude (http://www.ncgia.ucsb.edu/education/curricula/giscc/units/u014/u014_f.html)."}, {"url": "http://academic.brooklyn.cuny.edu/geology/leveson/core/linksa/lat_long.html", "passage_text": "I seem to remember that the circumference of the earth along the equator is roughly 24,901.92 miles (heh heh!). Well, there's 360 degrees in a circle, so if we divide 24,901.92 miles by 360 degrees, we get 69.172 miles per degree! How's that! And furthermore, the distance between two lines of latitude, from 0 degrees to 1 degree north, is also 69.2 miles-because it's also 1/360th of the circumference of the earth! . You take my breath away, Lou! At the equator, the distance between 15 and 30 degrees W longitude is quite a lot! But as you follow those two longitude lines towards the poles, the distance between them shrinks down to zero! All the lines of longitude actually meet at the poles!"}, {"url": "http://ncgia.ucsb.edu/units/u014/u014.html", "passage_text": "1 The distance between meridians of longitude on a sphere is a function of latitude: 2  Mathematical expression: Length of a degree of longitude = cos (latitude) * 111.325 kilometers. 3  Example: 1 of longitude at 40 N = cos (40) * 111.325. 4  Since the cosine of 40 is 0.7660, the length of one degree is 85.28 kilometers. 1 Since the variation in lengths of degrees of latitude varies by only 1.13 kilometers (0.7 mile), the standard figure of 111.325 kilometers (69.172 miles) can be used. 2  For example, anywhere on the earth, the length represented by 3 of latitude is (3 * 111.325) 333.97"}, {"url": "http://www.coastalnavigation.com/samples/sec_1/1_pages/1_2.htm", "passage_text": "Degrees and Minutes The distance between degrees of longitude is about 60 nautical miles at the equator. It is less further north or south as the longitude lines converge towards the poles. Degrees of latitude are always 60 nautical miles apart. At the equator, a grid of 1° of longitude by 1° of latitude covers about 3,600 square miles. For greater precision, degrees are divided into 60 minutes (') - of distance, not time. By comparison, a statute mile is 5,280 feet or about 87% of a nautical mile and a kilometre is 54%. One minute of latitude equals one nautical mile and degrees of latitude are 60 nm apart. The distance between degrees of longitude isn't constant because they"}]