[{"url": "http://www.tablascreek.com/vineyard_and_winemaking/grapes/grenache", "passage_text": "Grenache, (also known as Grenache Noir, to distinguish it from its white counterpart Grenache Blanc) is the most widely planted grape in the southern Rhone Rhône, valley and the second most widely planted varietal in the. world "}, {"url": "http://www.wine-searcher.com/grape-202-grenache-garnacha", "passage_text": "Grenache (Garnacha) is a red-wine grape grown extensively in France, Spain, Australia and the United States. It is particularly versatile both in the vineyard and the winery, which may explain why it is one of the most widely distributed grapes in the world. However, old-vine Grenache grown in schist or stone, such as in Priorat and Chateauneuf-du-Pape, can produce profoundly concentrated wines capable of aging over many decades. Produced as varietal wine, Grenache exhibits rich, spicy, berry flavors, particularly raspberry."}, {"url": "http://www.winepros.org/wine101/grape_profiles/grenache.htm", "passage_text": "Rootstocks with low vigor can markedly increase fruit quality. A long, warm growing season is necessary, as Grenache tends to ripen late. Cool and damp conditions can cause deadarm disease in grenache, however, and its compact and well-filled clusters are quite prone to rot. Grenache is also susceptible to shatter or coulure. Prior to the establishment of France's AOC, Burgundy's dirty little secret was that Grenache, grown in the Rhone Rhône, valley often contributed flavorful appeal to save the sometimes thin and Weak Pinot. Noir on its, own grenache can make, fleshy heady wines with lots of fruit appeal in their. youth"}, {"url": "http://www.winepros.org/wine101/grape_profiles/grenache.htm", "passage_text": "Nearly three times as much grenache is planted in Spain as in France. The spanish know this grape and wine as garnacha or garnacha tinta, where it is the dominant red wine variety in Catalonia and prominent in Rioja. 2 The grape is known in Italy as cannonau. Prior to the establishment of France's AOC, Burgundy's dirty little secret was that Grenache, grown in the Rhone Rhône, valley often contributed flavorful appeal to save the sometimes thin and Weak Pinot. Noir on its, own grenache can make, fleshy heady wines with lots of fruit appeal in their. youth"}, {"url": "https://en.wikipedia.org/wiki/Grenache", "passage_text": "Grenache was one of the first varieties to be introduced to Australia in the 18th century and eventually became the country's most widely planted red wine grape variety until it was surpassed by Shiraz in the mid 1960s. Until the mid 20th century, Grenache was Australia's most widely planted red wine grape variety with significant plantings in the vast Riverland region where it was vital component in the fortified port-style wines of the early Australian industry."}, {"url": "https://en.wikipedia.org/wiki/Grenache", "passage_text": "Grenache (/ɡrəˈnɑːʃ/) or Garnacha (. [ɡarˈnatʃa]) is one of the most widely planted red wine grape varieties in the world. It ripens late, so it needs hot, dry conditions such as those found in Spain, where the grape most likely originated. It is also grown in Sardinia, the south of France, Australia, and California 's San Joaquin Valley. Until the mid 20th century, Grenache was Australia's most widely planted red wine grape variety with significant plantings in the vast Riverland region where it was vital component in the fortified port-style wines of the early Australian industry."}, {"url": "http://www.wine-searcher.com/grape-202-grenache-garnacha", "passage_text": "Grenache is a vigorous and hardy vine with a strong wooden frame, often grown as free-standing bush vines. It is resistant to wind and drought, making it suitable for use in arid climates in California and South Australia. However, old-vine Grenache grown in schist or stone, such as in Priorat and Chateauneuf-du-Pape, can produce profoundly concentrated wines capable of aging over many decades. Produced as varietal wine, Grenache exhibits rich, spicy, berry flavors, particularly raspberry."}, {"url": "https://en.wikipedia.org/wiki/Grenache", "passage_text": "Aragon, believed to be the probable origin of the grape, concentrates the largest surface of Grenache (or Garnacha as it is called locally) in Spain, with 40,034 acres (16,201 ha) planted. Garnacha is the dominant variety in the region and is typically used to produce single variety wines. Until the mid 20th century, Grenache was Australia's most widely planted red wine grape variety with significant plantings in the vast Riverland region where it was vital component in the fortified port-style wines of the early Australian industry."}, {"url": "http://www.winepros.org/wine101/grape_profiles/grenache.htm", "passage_text": "Grenache noir is the world's most widely planted grape used to make red wine, sometimes bottled as a single unblended red variety, frequently as a rose, rosé but most often as the backbone of red. blends Prior to the establishment of France's AOC, Burgundy's dirty little secret was that Grenache, grown in the Rhone Rhône, valley often contributed flavorful appeal to save the sometimes thin and Weak Pinot. Noir on its, own grenache can make, fleshy heady wines with lots of fruit appeal in their. youth"}]