[{"url": "http://www.homehealthtesting.com/opiates-drug-test-way-urine-test-p-72.html", "passage_text": "So sometimes oxycodone will show up on an opiates test, but not with the same accuracy as it shows up on an OxyContin / Vicodin test. The OxyContin / Vicodin test specifically tests for oxycodone in urine, so is much more reliable for that purpose than the opiates test, which detects morphine in urine."}, {"url": "http://www.answers.com/Q/Do_oxycodone_and_oxycontin_show_up_the_same_on_urine_test", "passage_text": "Yes, Oxycontin and morphine will show up the same because both are in the opiate class of medications. Actually they are different, Oxycontin is oxycodone. And on a standard … employment drug test oxycodone is not tested for. They do test for morphine, which heroin and codein break down to."}, {"url": "https://answers.yahoo.com/question/index?qid=20080519082152AAu8vKJ", "passage_text": "Opiates on a drug test such as codeine, morphine and heroin will show up as Opiates on a drug screen because they all metabolize in the body back into the opiate they test for. Oxycodone and hydrocodone are Opioids, and do not metabolize into the same metabolite that opiates do. Therefore it will not show up on your standard 5 panel drug screen. As far as Hydrocodone showing up as Oxycodone, I wouldn't risk it, these drugs are very closely related."}, {"url": "http://www.homehealthtesting.com/vicodin-test-oxycontin-test-oxycodone-drug-test-way-urin-p-76.html", "passage_text": "The opiates test is designed for drugs like codeine and morphine. Morphine and codeine are opiates. The compounds are found in the opium poppy. Oxycodone, hydrocodone, and hydromorphone are semi-synthetic opioids, meaning that they are made up from opiates but are not found in nature."}, {"url": "http://www.drugs.com/answers/does-oxycontin-and-oxycodone-show-up-the-same-on-453440.html", "passage_text": "Actually, sometimes Oxycontin (oxycodone) doesn't show up on a drug test. Most drug tests for opiates test for morphine (which most opiates are converted to in the body). Oxycontin (oxycodone) does not break down into morphine and can be missed on a drug test. The drug test has to specifically test for oxycodone."}, {"url": "http://www.drugs.com/answers/what-is-the-difference-between-oxycodone-and-485852.html", "passage_text": "Oxycontin is generally prescribed without acetominophen while oxycodone is generally prescribed with. The will show the same on a drug panel. They last in your system for upto 5 days after your last dose depending on your frequency, strength and personal metabolism. Laurie."}, {"url": "http://www.answers.com/Q/Do_oxycodone_and_oxycontin_show_up_the_same_on_urine_test", "passage_text": "Oxycodone does not come up as morphine on a standard test. Now you can test for oxycodone, and you can test for them both on the same drug test. But they come up as too totally different opiates. But their is a catch to this."}]