[{"url": "http://www.mathsisfun.com/definitions/frequency.html", "passage_text": "How often something happens (usually during a period of time). On the right is a heartbeat with a frequency of 78 beats per minute. Try some different beats per minute yourself: Amplitude, Period, Frequency and Phase Shift. "}, {"url": "http://www.gcsescience.com/pen9-heat-radiation-temperature.htm", "passage_text": "Infra-red radiation (also called thermal radiation) transfers heat between all objects. The frequency at which an object emits electromagnetic radiation is called its principle frequency. The principle frequency increases as the temperature increases. The Sun is hotter than the Earth and so has a higher principle frequency. Infra-red radiation is an electromagnetic wave and can travel through a vacuum. Heat from the Sun reaches us through the vacuum of space by travelling as infra-red radiation. "}, {"url": "https://keshgcsemaths.files.wordpress.com/2013/11/48_frequency-polygon2.pdf", "passage_text": "Edexcel GCSE Mathematics (Linear) – 1MA0 FREQUENCY POLYGONS Materials required for examination Items included with question papers Ruler graduated in centimetres and Nil millimetres, protractor, compasses, pen, HB pencil, eraser. Tracing paper may be used. "}, {"url": "http://www.youtube.com/watch?v=M6Pv22kQ_JU", "passage_text": "Frequency and Frequency density. In this exercise we have looked at frequency dnsity ad frequency in terms of area. Te histogram shows uneven width and with hat we havet find out the area occupiedby a given number of trees. We have used the idea of unit area and unit ength since the key does not tell us the units of the raph used in the histogram"}, {"url": "http://www.bbc.co.uk/schools/gcsebitesize/science/aqa_pre_2011/radiation/anintroductiontowavesrev2.shtml", "passage_text": "The wavelength of a wave is the distance between a point on one wave and the same point on the next wave. It is often easiest to measure this from the crest of one wave to the crest of the next wave, but it doesn't matter where as long as it is the same point in each wave. Frequency. The frequency of a wave is the number of waves produced by a source each second. It is also the number of waves that pass a certain point each second. The unit of frequency is the hertz (Hz). It is common for kilohertz (kHz), megahertz (MHz) and gigahertz (GHz) to be used when waves have very high frequencies"}, {"url": "http://www.gcse.com/waves/frequency.htm", "passage_text": "Frequency. This is less well understood, but is easy if you look at the word. Frequency means how frequent. In other words, how often something happens. In physics, we normally expect frequency to be how many times something happens per second. For a wave, frequency means: how many waves per second."}, {"url": "http://hannahhelpphysics.blogspot.com/2013/03/33-define-amplitude-frequency.html", "passage_text": "The number of waves per second, it is measured in Hertz (Hz). You can think of it as how quickly the waves are travelling. The distance between one point on a wave and the same point on the next wave; usually the point from the top/bottom of one wave (peak/trough) to the top/bottom of the next."}, {"url": "http://sohcahtoa.org.uk/pages/files/maths_gcse-rules-and-tools-data.pdf", "passage_text": "Grouped frequency tally chart Frequency The word 'frequency' is used in Maths to mean 'the number of data items that have this value'. On your radio, it is the number of cycles per second that the radio wave oscillates at – quite different. "}, {"url": "http://www.mathsisfun.com/definitions/relative-frequency.html", "passage_text": "more ... How often something happens divided by all outcomes. Example: if your team has won 9 games from a total of 12 games played: • the Frequency of winning is 9 • the Relative Frequency of winning is 9/12 = 75% Have a try yourself: See: Frequency. "}]