[{"url": "https://en.wikipedia.org/wiki/AFC_North", "passage_text": "The AFC North is usually called the toughest division in football. The AFC North currently has four members: Baltimore Ravens, Cincinnati Bengals, Cleveland Browns, and Pittsburgh Steelers."}, {"url": "http://www.answers.com/Q/Have_the_Cleveland_Browns_ever_won_the_afc_championship", "passage_text": "Share to: Though the Browns have not won or even played in a Super Bowl (which was implemented in 1970) they have won 4 NFL Championships which was comparable to winning a Super Bowl. T … hey won in 1950, '54, '55 and '64."}, {"url": "http://www.answers.com/Q/Have_the_Cleveland_Browns_ever_won_the_afc_championship", "passage_text": "As of September 2014, the Cleveland Browns have won four NFL  Championship, the most recent in 1964. The Browns are one of four  NFL teams that have never appeared in a Supe … r Bowl game."}, {"url": "http://www.cleveland.com/browns/index.ssf/2012/12/cleveland_browns_beat_the_balt.html", "passage_text": "Plain Dealer file. Forty-eight years ago today the Cleveland Browns beat the Baltimore Colts, 27-0, to claim the NFL Championship, the last time a Cleveland team has won a championship in any of the major sports."}, {"url": "http://articles.baltimoresun.com/1995-11-12/sports/1995316143_1_city-of-cleveland-browns-move-to-baltimore", "passage_text": "Modell lied to Cleveland. Shame on Art Modell and shame on Baltimore! I have lived in Baltimore for the past three years, but I grew up and spent the first 26 years of my life in Cleveland. I was born and raised on the Cleveland Browns. Naturally, I am disgusted by what has transpired during the past week."}, {"url": "http://www.pro-football-reference.com/blog/?p=6880", "passage_text": "1 In the mid-'80s, Cleveland fans suffered through some of their most painful memories. 2  First, the '86 Browns lost in the AFC Championship game to the Broncos and The Drive ; the next season, The Fumble in the final minutes prevented the team from reaching their first ever Super Bowl."}, {"url": "http://www.answers.com/Q/Have_the_Cleveland_Browns_ever_won_the_afc_championship", "passage_text": "The last NFL championship for the Browns was the 1964 season when they defeated the Baltimore Colts, 27-0, in the championship game."}]