[{"url": "https://en.wikipedia.org/wiki/Lascaux", "passage_text": "Lascaux (Lascaux Caves) (English /laesˈkoʊ/ , [læsˈkoʊ]) lasko is the setting of a complex of caves in Southwestern france famous for Its paleolithic cave. Paintings the original caves are located near the village Of, montignac in the department Of. Dordogne they contain some of the-best Known Upper paleolithic. art Lascaux II, a replica of the Great Hall of the Bulls and the Painted Gallery located 200 meters away from the original, was opened in 1983, so that visitors may view the painted scenes without harming the originals."}, {"url": "https://en.wikipedia.org/wiki/Lascaux", "passage_text": "Reproductions of other Lascaux artwork can be seen at the Centre of Prehistoric Art at Le Thot, France. Since 1998, the cave has been beset with a fungus, variously blamed on a new air conditioning system that was installed in the caves, the use of high-powered lights and the presence of too many visitors. Lascaux II, a replica of the Great Hall of the Bulls and the Painted Gallery located 200 meters away from the original, was opened in 1983, so that visitors may view the painted scenes without harming the originals."}, {"url": "http://www.bradshawfoundation.com/lascaux/", "passage_text": "In collaboration with Noel Noël, Coye conservateur du, Patrimoine ministere ministère De la culture et De, La. Communication france lascaux is famous For its palaeolithic, cave paintings found in a complex of caves In the dordogne region Of, southwestern france because of their, exceptional, quality size sophistication. and antiquity There are 90 paintings of stags. Also represented are cattle, bison, felines, a bird, a bear, a rhinoceros, and a human. Among the most famous images are four huge, black bulls or aurochs in the Hall of the Bulls. One of the bulls is 17 feet (5.2 m) long-the largest animal discovered so far in cave art."}, {"url": "http://lascaux.fieldmuseum.org/", "passage_text": "Caves of Lascaux. Discover the beautifully sophisticated paintings and engravings created by our early ancestors in the caves of southern France nearly 20,000 years ago!"}, {"url": "http://www.bradshawfoundation.com/lascaux/", "passage_text": "Lascaux is famous for its Palaeolithic cave paintings, found in a complex of caves in the Dordogne region of southwestern France, because of their exceptional quality, size, sophistication and antiquity. There are 90 paintings of stags. Also represented are cattle, bison, felines, a bird, a bear, a rhinoceros, and a human. Among the most famous images are four huge, black bulls or aurochs in the Hall of the Bulls. One of the bulls is 17 feet (5.2 m) long-the largest animal discovered so far in cave art."}, {"url": "http://www.lascaux-dordogne.com/en/lascaux-cave", "passage_text": "The Lascaux cave. In 1940, The Lascaux cave (Not the Lascaux Caves) was “ found” by four Perigourdin périgourdin young (boys From). Montignac montignac is situated in The Vezere vézère valley In the Departement-Département. Of dordogne Perigord Périgord After, The second world war lascaux was open to the public for. several years until 1963 Today, the original Lascaux cave is closed. The painting cave is under close surveillance in order to preserve this site which is registered as a the World Heritage of the Humanity by UNESCO (Unesco world Heritage site)."}, {"url": "http://www.lascaux-dordogne.com/en/lascaux-cave", "passage_text": "The Lascaux cave. In 1940, The Lascaux cave (Not the Lascaux Caves) was “ found” by four Perigourdin périgourdin young (boys From). Montignac montignac is situated in The Vezere vézère valley In the Departement-Département. of dordogne perigord périgord Today, the original Lascaux cave is closed. The painting cave is under close surveillance in order to preserve this site which is registered as a the World Heritage of the Humanity by UNESCO (Unesco world Heritage site)."}, {"url": "https://en.wikipedia.org/wiki/Lascaux", "passage_text": "Lascaux (Lascaux Caves) (English /laesˈkoʊ/ , [læsˈkoʊ]) lasko is the setting of a complex of caves in Southwestern france famous for Its paleolithic cave. paintings Lascaux II, a replica of the Great Hall of the Bulls and the Painted Gallery located 200 meters away from the original, was opened in 1983, so that visitors may view the painted scenes without harming the originals."}, {"url": "https://en.wikipedia.org/wiki/Cave_painting", "passage_text": "Cave paintings (also known in archaeology as  parietal art ) are paintings found on cave walls and ceilings, and especially those of prehistoric origin, which date back to some 40,000 years ago in both Asia and Europe. The exact purpose of the Paleolithic cave paintings is not known. The earliest known cave paintings/drawings of animals are at least 35,000 years old, at Maros on the island of Sulawesi in Indonesia, according to datings announced in 2014. Previously it was believed that the earliest paintings were in Europe."}]