[{"url": "http://www.webmd.com/a-to-z-guides/genetics-carrier-identification", "passage_text": "Carrier Identification. Every person carries two copies of most genes (one copy from the mother and one from the father). A carrier is a person who has a change in one copy of a gene. The carrier does not have the genetic disease related to the abnormal gene. A carrier can pass this abnormal gene to a child."}, {"url": "http://medical-dictionary.thefreedictionary.com/carrier", "passage_text": "carrier. 1. an individual who harbors the specific organisms of a disease without manifest symptoms and is capable of transmitting the infection; the condition of such an individual is referred to as the carrier state."}, {"url": "http://www.ghr.nlm.nih.gov/glossary=carrier", "passage_text": "A carrier is an individual who carries and is capable of passing on a genetic mutation associated with a disease and may or may not display disease symptoms. Carriers are associated with diseases inherited as recessive traits."}, {"url": "http://www.rightdiagnosis.com/medical/infectious_disease_carrier.htm", "passage_text": "Carrier conditions (medical condition): A condition where a person is symptom-free despite a genetic or infectious disease. Carrier conditions (medical condition): The term carrier is used for any person who is symptom-free (or has only very mild symptoms) despite having a medical condition. The two main types are carriers of genetic diseases and carriers of infectious diseases."}, {"url": "http://medical-dictionary.thefreedictionary.com/carrier", "passage_text": "the state of being a carrier of an infectious disease or of a genetic defect. carrier test herd. a herd consisting entirely of known carriers of a gene which is under investigation; a definition which could be extended to include a herd comprising only individuals known to carry a specific infectious agent."}, {"url": "http://www.webmd.com/a-to-z-guides/genetics-carrier-identification", "passage_text": "1 If both parents carry the abnormal gene, there is a 1-in-4 (25%) chance that their child will have the disease and a 2-in-4 (50%) chance that their child will be a carrier of the disease (but will not have it)."}]