[{"url": "http://www.webmd.com/skin-problems-and-treatments/hyperpigmentation-hypopigmentation", "passage_text": "Hyperpigmentation in skin is caused by an increase in melanin, the substance in the body that is responsible for color (pigment). Certain conditions, such as pregnancy or Addison's disease (decreased function of the adrenal gland), may cause a greater production of melanin and hyperpigmentation. Pigmentation is the coloring of a person's skin. When a person is healthy, his or her skin will appear normal in color. In the case of illness or injury, the person's skin may change color, becoming darker (hyperpigmentation) or lighter (hypopigmentation)."}, {"url": "http://www.yourhormones.info/Hormones/Melanocytestimulating_hormone.aspx", "passage_text": "Melanocyte-stimulating hormone is a collective name for a group of peptide hormones produced by the skin, pituitary gland and hypothalamus in response to ultraviolet (UV) radiation. It plays a key role in producing coloured pigmentation found in the skin, hair and eyes. Print | Email article to a friend | Last updated: March 31, 2015. Melanocyte-stimulating hormone describes a group of hormones produced by the pituitary gland, hypothalamus and skin cells. It is important for protecting the skin from UV rays, development of pigmentation and control of appetite."}, {"url": "http://www.rnceus.com/hormone/antpit.html", "passage_text": "1 Melanocyte-stimulating hormone (MSH) is another anterior pituitary hormone that increases during pregnancy. 2  For many years, it's increase was thought to be responsible for many of the skin changes of pregnancy, particularly skin darkening (darkening of the areola, chloasma, and linea nigra). "}, {"url": "http://www.healthline.com/symptom/increased-skin-pigmentation", "passage_text": "Hyperpigmentation is a condition that causes the skin to darken. It can occur in small patches or cover large areas of the body. It can also affect the entire body. Hyperpigmentation is usually not harmful. But it can be a symptom of another medical condition. 1 They are related to excess sun exposure over time. 2  They generally appear as spots of hyperpigmentation on areas frequently exposed to the sun, such as the hands and face. 3  Post-inflammatory hyperpigmentation is a result of prior injury to the skin (American College of Osteopathic Dermatology)."}, {"url": "https://en.wikipedia.org/wiki/Melanocyte-stimulating_hormone", "passage_text": "MSH increases in humans during pregnancy. This, along with increased estrogens, causes increased pigmentation in pregnant women. Cushing's syndrome due to excess adrenocorticotropic hormone (ACTH) may also result in hyperpigmentation, such as acanthosis nigricans in the axilla. "}, {"url": "http://www.answers.com/Q/What_hormone_increases_skin_pigmentation", "passage_text": "Split and merge into it. Answer by Bathinipravin. Confidence votes 15. melatonin is the pigment which increases skin pigmentation. This is produced by melanocyte stimulating harmone. melanocyte-stimulating hormone. Melanin stimulating hormone, or melanocyte stimulating hormone (MSH). It is produced in the pituitary and cause melanocytes to increase production of melanin, the pigment responsible for darkening of the skin. "}, {"url": "http://www.answers.com/Q/Which_hormone_increases_pigmentation_of_the_skin", "passage_text": "This is produced by melanocyte stimulating harmone melanocyte-stimulating hormone Melanin stimulating hormone, or m … elanocyte stimulating hormone  (MSH). It is produced in the pituitary and cause melanocytes to  increase production of melanin, the pigment responsible for  darkening of the skin. 1 This period of change is called pu…. 2  Vitiligo Patches Vitiligo is a condition that results in patches of de-pigmentation in the skin, and is the result of melanocytes (the cells responsible for the colour in skin) starting to di…."}, {"url": "http://www.answers.com/Q/Which_hormone_increases_pigmentation_of_the_skin", "passage_text": "1 Vitiligo Patches Vitiligo is a condition that results in patches of de-pigmentation in the skin, and is the result of melanocytes (the cells responsible for the colour in skin) starting to di…. 1 This period of change is called pu…. 2 "}, {"url": "http://www.yourhormones.info/Hormones/Melanocytestimulating_hormone.aspx", "passage_text": "Melanocyte-stimulating hormone levels are also raised during pregnancy and in women using birth control pills, which can cause hyperpigmentation of the skin. Cushing’s syndrome, due to an excess production of adrenocorticotropic hormone, can also lead to hyperpigmentation. Print | Email article to a friend | Last updated: March 31, 2015. Melanocyte-stimulating hormone describes a group of hormones produced by the pituitary gland, hypothalamus and skin cells. It is important for protecting the skin from UV rays, development of pigmentation and control of appetite."}]