[{"url": "https://en.wikipedia.org/wiki/Atmospheric_pressure", "passage_text": "The standard atmosphere (symbol: atm) is a unit of pressure equal to 101325 Pa or 1013.25 hectopascals or millibars. Equivalent to 760 mmHg (torr), 29.92 inHg, 14.696 psi. (The pascal is a newton per square meter or in terms of SI base units, kilogram per meter per second-squared.). Atmospheric pressure is the pressure exerted by the weight of air in the atmosphere of Earth (or that of another planet). In most circumstances atmospheric pressure is closely approximated by the hydrostatic pressure caused by the weight of air above the measurement point."}, {"url": "http://www.sensorsone.com/atm-standard-atmosphere-pressure-unit/", "passage_text": "What does one atmospheric pressure equal in inches of mercury? The standard constant value used for atmospheric pressure at sea level is 1 atm (standard atmosphere) which equals 101325 pascals in SI units, and is equivalent to 29.9213 inches of mercury. The standard atmosphere value has many uses in atmospheric calculations and one example of this is the FAA procedures for setting aircraft altimeters at altitudes of 18,000 feet and above to ensure all aircraft are using the same pressure reference when measuring the height above sea level."}, {"url": "http://www.enotes.com/homework-help/sea-level-what-approximate-value-atmospheric-125807", "passage_text": "At sea level, the approximate value of atmospheric pressure in those units of measure is as follows: 1  101.3 kPa which is how it is usually expressed. 2  In pascals, it is 101325 pascals. Although 1013.25 mb (760 mm Hg) is considered to be the standard atmospheric pressure at sea level, it does not mean that the pressure at this level has this value, actually this being 1011 mb."}, {"url": "http://www.enotes.com/homework-help/sea-level-what-approximate-value-atmospheric-125807", "passage_text": "At sea level, the approximate value of atmospheric pressure in those units of measure is as follows: 1  101.3 kPa which is how it is usually expressed. 2  In mmHg (milimeters of mercury), the measure is 760. 3  In atm (atmospheres) it is 1 atm. Although 1013.25 mb (760 mm Hg) is considered to be the standard atmospheric pressure at sea level, it does not mean that the pressure at this level has this value, actually this being 1011 mb."}, {"url": "http://www.thefreedictionary.com/Atmospheric+air+pressure", "passage_text": "1. the pressure exerted by the earth's atmosphere at any given point. 2. a value of standard or normal atmospheric pressure, equivalent to the pressure exerted by a column of mercury 29.92 in. (760 mm) high, or 1013 millibars (101.3 kilopascals). Also called barometric pressure. [1655–65]. "}, {"url": "http://whatis.techtarget.com/definition/standard-temperature-and-pressure-STP", "passage_text": "This is essentially the freezing point of pure water at sea level, in air at standard pressure. Standard pressure supports 760 millimeters in a mercurial barometer (760 mmHg). This is about 29.9 inches of mercury, and represents approximately 14.7 pounds per inch (14.7 lb/in 2). Imagine a column of air measuring one inch square, extending straight up into space beyond the atmosphere. "}, {"url": "http://www.thefreedictionary.com/atmospheric+pressure", "passage_text": "1. the pressure exerted by the earth's atmosphere at any given point. 2. a value of standard or normal atmospheric pressure, equivalent to the pressure exerted by a column of mercury 29.92 in. (760 mm) high, or 1013 millibars (101.3 kilopascals). Also called barometric pressure. [1655–65]."}, {"url": "http://units.wikia.com/wiki/Atmospheric_pressure", "passage_text": "One atmosphere (101.325 kPa or 14.7 lbf/in²) is the amount of pressure that can lift water approximately 10.3 m (33.9 feet). Thus, a diver at a depth 10.3 meters under water in a fresh-water lake experiences a pressure of about 2 atmospheres (1 atm for the air and 1 atm for the water). "}, {"url": "http://www.enotes.com/homework-help/sea-level-what-approximate-value-atmospheric-125807", "passage_text": "Posted on. (Answer #3). The atmospheric pressure at the sea level is equal to 760 mm of height of the column of mercury. With this height of 760 mm of mecury, the atmospheric pressure is equal to the weight force of the 760 mm of mercury. Although 1013.25 mb (760 mm Hg) is considered to be the standard atmospheric pressure at sea level, it does not mean that the pressure at this level has this value, actually this being 1011 mb."}]