[{"url": "http://www.wikihow.com/Sell-on-eBay", "passage_text": "To find eBay, simply use your favorite search engine and type in eBay. eBay tailors its site to countries all over the world, so make sure that you are looking at your country's eBay site. For people in the United States, it is www.ebay.com."}, {"url": "http://ebay.about.com/od/gettingstarted/a/gs_bids.htm", "passage_text": "1 On eBay, auctions are open to bids for exactly 1, 3, 5, 7, or 10 days. 2  When time is up, the high bidder wins, even if people are still frantically bidding. 3  You must place a bid that is higher than the current bid."}, {"url": "http://pages.ebay.com/help/sell/sell-getstarted.html", "passage_text": "Manage your listing. When you have your listing up and running, you can check to see if anyone's bid on or bought it by going to the Sell section of My eBay. You can also revis"}, {"url": "http://www.dummies.com/how-to/content/how-does-paypal-work.html", "passage_text": "After you sign into your PayPal account and click the Send Money tab, you can send money from PayPal in the following ways: Paying for eBay items: When you buy an eBay item on eBay, you need to pay through the eBay Checkout system. Goods (other): By clicking this radio button, you can send money to anyone in the world for goods purchased anywhere other than eBay."}, {"url": "http://pages.ebay.com/help/sell/sell-getstarted.html", "passage_text": "You can create your shipping label and packing slip on eBay. If you use free carrier pickup (available with orders that include Priority Mail or for a small on-demand fee), you can save a trip to the post office. Leave your buyer Feedback: Your Feedback about your buyer is important for other sellers."}, {"url": "http://www.ebay.com/gds/How-To-Work-From-Home-On-eBay-Beyond-The-Basics-/10000000008163507/g.html", "passage_text": "After a while, your buyers will know by the auction design if it is you. This will help you establish a look for your work from home business on eBay. It is called branding. Overall, taking your eBay business beyond the basics is not difficult."}, {"url": "http://www.ebay.com/gds/How-To-Work-From-Home-On-eBay-Beyond-The-Basics-/10000000008163507/g.html", "passage_text": "You know how to work from home on eBay. You have been doing it for a little while now and you want to take your business beyond the basics. There are other things that you may be ready to do at this point. Lets take a look. First lets look at your rating on eBay."}, {"url": "http://www.ebay.com/gds/How-To-Work-From-Home-On-eBay-Beyond-The-Basics-/10000000008163507/g.html", "passage_text": "Other advanced techniques on how to work from home on eBay that will take you beyond the basics are fixed price auctions with multiple quantities. You need to be an authorized eBay user for at least 14 days, and you must have a rating of 30 or higher."}]