[{"url": "http://www.wikihow.com/Rent-a-Room-in-Your-House", "passage_text": "1 The proximity of the home to a university, shopping, large cities, and/or local attractions. 2  If your home is located near a university, there may be a steady supply of students looking for rooms to rent, thereby driving up the price of a room in your home. 1 If you have decided to allow your tenant to do work around the house, such as mowing the lawn, preparing meals, or babysitting, in lieu of paying some portion of the rent, you will want to provide this information as well. 2  Term of the lease. 3  Be sure to state the term of the lease in your agreement."}, {"url": "http://money.usnews.com/money/blogs/my-money/2014/06/11/the-best-ways-to-split-rent-with-roommates", "passage_text": "1 Start by figuring out the cost per square foot of the apartment. 2  You’ll do this by dividing the total cost of rent by the total square footage of the apartment. 3  For example, if your rental rate is $1,000 per month for a 1,000-square-foot apartment, the cost per square foot is $1. 1 Splitting the cost by size: If there is a big disparity in the size of the bedrooms, you may want to base what each roommate pays by square footage. 2  Start by figuring out the cost per square foot of the apartment. 3"}, {"url": "https://answers.yahoo.com/question/index?qid=20081111155831AALkxbc", "passage_text": "I'm trying to determine how much rent to charge a 45 year old single man renting a room out of my house. He will share a bathroom, kitchen and other common areas but have the privacy of the bedroom and the storage area of my one car garage. I will do all of the grocery shopping and this person will... it definitely depends on where you live and what the going rate for renting a room is there, because i know where i live to rent a room you end up paying a minimum of $750-800."}, {"url": "http://evolvingpf.com/2013/04/how-to-price-a-room-for-rent/", "passage_text": "You should let your local market determine what the rent for your room should be. Comparable Rents. The first strategy to do is to find comparable rentals in your area to set your price in a reasonable range or to figure out the going rate for a similar room. Put It on the Market. If there are no comparable rentals that you can find, you can just test out the market! If you aren’t in a hurry to rent the room, price it at the high end of what you think is reasonable and see if you get any nibbles. You can always bring the price down a bit to attract more interest."}, {"url": "http://evolvingpf.com/2013/04/how-to-price-a-room-for-rent/", "passage_text": "Split the total rent in terms of the square footage used by each renter, both for private (full price) and shared (price divided by number of users) space. For example, let’s say there are three roommates living in a 3 BR, 2 BA residence with a total square footage of 1300 sq. ft. that they rent for $1000. Put It on the Market. If there are no comparable rentals that you can find, you can just test out the market! If you aren’t in a hurry to rent the room, price it at the high end of what you think is reasonable and see if you get any nibbles. You can always bring the price down a bit to attract more interest."}, {"url": "http://roomiecalc.com/", "passage_text": "Notes. The area of a room is equal to the length times the width, in feet. You may decide to round rents to the nearest quarter. For instance, if rents shown for two people are $429.81 and $370.19, for simplicity, you may decide to round those to $429.75 and $370.25. The sum of all rents may not equal the total rent due to rounding. For instance, it may show each of three people owing $333.33 rent on a $1000 a month unit. The sum of the rents is off by a penny, which someone will need to chip in. For the above calculations, a private bath is considered equal to 100-square-feet added to the bedroom area. If you only have three bedrooms, just fill out the first three rows. When done, hit Calculate, and each person's rent will be shown. That's all there is to it! Note: If you live where square meters are used instead of square feet, just multiply your square meters times 10, and enter those numbers."}, {"url": "http://www.wikihow.com/Rent-a-Room-in-Your-House", "passage_text": "1 The proximity of the room to yours and your family member’s rooms. 2  For example, if you have 3 bedrooms upstairs, and 1 down, you may wish to rent the one downstairs, in order to avoid having a stranger’s bedroom so close to yours and your family member’s bedrooms. 1 If you have decided to allow your tenant to do work around the house, such as mowing the lawn, preparing meals, or babysitting, in lieu of paying some portion of the rent, you will want to provide this information as well. 2  Term of the lease. 3  Be sure to state the term of the lease in your agreement."}, {"url": "http://money.usnews.com/money/blogs/my-money/2014/06/11/the-best-ways-to-split-rent-with-roommates", "passage_text": "1 You’ll do this by dividing the total cost of rent by the total square footage of the apartment. 2  For example, if your rental rate is $1,000 per month for a 1,000-square-foot apartment, the cost per square foot is $1. 1 Splitting the cost by size: If there is a big disparity in the size of the bedrooms, you may want to base what each roommate pays by square footage. 2  Start by figuring out the cost per square foot of the apartment. 3 "}, {"url": "http://money.usnews.com/money/blogs/my-money/2014/06/11/the-best-ways-to-split-rent-with-roommates", "passage_text": "1 For example, if your rental rate is $1,000 per month for a 1,000-square-foot apartment, the cost per square foot is $1. 2  Next, determine the square footage of each bedroom, and multiply that number by the cost per square footage. 1 Splitting the cost by size: If there is a big disparity in the size of the bedrooms, you may want to base what each roommate pays by square footage. 2  Start by figuring out the cost per square foot of the apartment. 3  You’ll do this by dividing the total cost of rent by the total square footage"}, {"url": "http://www.answers.com/Q/How_do_you_calculate_Cost_Per_Rented_Room", "passage_text": "The actual cost per room per day for laundry products-for  example, if a motel/hotel spends $600.00 a month for laundry  products, and it was a 30 day month, the cost per … day would be easy  to calculate: $600.00 divided by 30 days = $20.00 per day. Hotels  normally know their occupance rate (or percentage). This will also be a factor in the price of the rental horse. But on the average the cost will be from $45 to $65 an hour on average. But it is a great way to see if horse ownership is right for you. You can try it for an hour or two and see if it is something that you may want to be involved in."}]