[{"url": "https://www.a1autotransport.com/how-much-does-it-cost-to-ship-a-boat.php", "passage_text": "Boat transport cost is different from car transport cost as there are different factors to be considered for an estimate. You cannot call up a truck service and ask them to haul your (oversized) boat to the destination.f your boat is bigger than 9 feet, add an extra $.25 for each foot. So if you have a 10 foot boat and you are starting from the East, your base rate per mile will be around $2.5. Then multiply that cost with the total number of miles to be covered."}, {"url": "http://www.boattrader.com/research/resources/boat-shipping-transport", "passage_text": "BOAT TRANSPORT AND SHIPPING. Delivery services are a must for boaters who find themselves needing to move a boat. These services can haul your boat by land, provide expert crew to move it by water, or even arrange transport by ship or air. Ship boats on uShip and get up to a $100 rebate!"}, {"url": "http://sevenseasmarinegroup.com/", "passage_text": "Seven Seas Marine Group is a fully insured and DOT compliant boat shipping company in Florida. We specialize in hauling and shipping oversized powerboats, sailboats, speed boats, jet skis, and center consoles as well as special and unique marine craft. The Seven Seas boat shipping company is based in sunny Palm beach, Florida. We have been serving the yacht and boat transport community for over 10 years -- providing professional,nationwide yacht and boat carrier service for marine craft of all sizes."}, {"url": "http://www.howmuchisit.org/boat-transport-cost/", "passage_text": "The prices of transporting a boat are going to depend on a variety of factors. 1  The cost to transport a boat will mostly depend on the size of the boat. 2  On average, a boat that varies from 28 to 40 foot will commonly pay anywhere from $1.50 to $4 per mile. 1 If the boat is over sized, most states will require permits to legally transport it on the road. 2  If the boat has to be transported across state lines, multiple permits will have to be pulled. 3  Depending on the state, permits can average $100 to $300. 4  Most states have a height limit of 13’6″."}, {"url": "http://www.uship.com/boats/", "passage_text": "With the right knowledge and preparation, shipping a boat is simple. Although one would think that shipping a boat is just like car transport, there are a few unique things to consider. We suggest you begin the planning process for shipping your boat at least a month before your ship date."}, {"url": "http://www.howmuchisit.org/boat-transport-cost/", "passage_text": "1 The cost to transport a boat will mostly depend on the size of the boat. 2  On average, a boat that varies from 28 to 40 foot will commonly pay anywhere from $1.50 to $4 per mile. 1 If the boat is over sized, most states will require permits to legally transport it on the road. 2  If the boat has to be transported across state lines, multiple permits will have to be pulled. 3  Depending on the state, permits can average $100 to $300. 4  Most states have a height limit of 13’6″."}, {"url": "http://united-yacht.com/", "passage_text": "United Yacht Transport is the leader in North American yacht transport and is based in Fort Lauderdale, Florida. We are a direct carrier providing safe, reliable and cost-effective yacht shipping services for boats ranging in size from 30 feet up to 160 feet. ‘Price Beat Guarantee’ is our signature opportunity."}, {"url": "http://www.boattransportpros.com/quote-request", "passage_text": "Your free quote is provided for you to obtain boat transportation costs and a boat shipping quote. Accurate boat dimensions and specifications insure your boat transporter quote is an actual transport cost. No auction style bids, with surprise charges. Our Privacy Policy: Boat Transport Pros respects your privacy and guarantees you as our potential customer and client that we will never share any of your information with another entity, company or person(s) without your permission."}, {"url": "http://www.howmuchisit.org/boat-transport-cost/", "passage_text": "1 Another paid $3,400 for a 31-foot boat to be shipped from Florida to Wisconsin, which turned out to be $2.12 per mile. 2  BoatHaulingUS.com, a company based in Minnesota, charges anywhere from $1.50 to $2.50 per mile. 3  A boat up to 8’6” will cost $1.50, while a boat over 12′ can cost more than $2.50 per mile. If the boat is over sized, most states will require permits to legally transport it on the road. 2  If the boat has to be transported across state lines, multiple permits will have to be pulled. 3  Depending on the state, permits can average $100 to $300. 4  Most states have a height limit of 13’6″."}, {"url": "http://www.boathaulingus.com/rates.html", "passage_text": "Boat hauling prices are figured simply by origin and width. 1  From the West origins are $1.50 base rate per mile and From the East, from the North, from the South are $2.50 up to 8’6” *Based on an average boat haul of 2000 miles.auling a sailboat from Bellingham, WA to Montauk, NY which is 11 ft wide: 1  West origin = $1.50/mile base rate. 2  11ft wide = +$.75/mile (9,10,11 ft). 3  Equals = $2.25/mile total."}]