[{"url": "http://food-answers.co.uk/questions/how-long-will-eggplant-parmesan-keep-in-the-fridge-767094.html", "passage_text": "Cooked meat can stay in the refrigerator for 3 to 4 days under normal cooling temperatures, and for 2 to 3 months when it is kept in the freezer. When the meat has gravy broth added on top of it, it... (more). "}, {"url": "https://answers.yahoo.com/question/index?qid=20090220064445AAoiMsF", "passage_text": "Rating Newest Oldest. Best Answer: Eggplant can be stored in the refrigerator for up to a week. However, it is important to keep eggplant away from fruits or vegetables that produce ethylene, such as apples and apricots. These items will speed up the ripening process. You can cook the eggplant (bread and fry it) then freeze it for up to 2 months. The lettuce will stay for a fair while if you put it in an airtight container. Tomatoes will last about 10 days. The bananas will turn brown and mushy and then they are overripe."}, {"url": "http://www.mnn.com/food/recipes/blogs/how-to-bread-fry-and-freeze-eggplant", "passage_text": "Place the fried eggplant on a baking sheet, and put it in the freezer for two hours so that each individual slice freezes. Once the fried eggplant is frozen, you can transfer it to a freezer-safe container. It will keep for about three to four months. If you freeze the slices individually first, you should be able to pull out as many slices as you need at a time. Teaser photo: Dream79/Shutterstock. Another option would have been to make Roasted Eggplant Soup and freeze it, but I decided to go with the fried eggplant instead. If you have the room in your freezer, here’s how you can preserve some of the end-of-season eggplant to use over the next few months. Cut the eggplant to your desired thickness."}, {"url": "http://sweetwater-organic.org/veggies/eggplant/", "passage_text": "Eggplants do not store well for long periods of time. Without refrigeration, eggplants can be stored in a cool, dry place for 1 or 2 days. If you don’t intend to eat the eggplant within 2 days, it should be refrigerated. Eggplant is a member of the nightshade or potato family, which also includes tomatoes and hot peppers. Many useful medicines are derived from this family. Eggplants can be purple, green, white or striped, pear-shaped or cylindrical and the size of a golf ball to a football. They are often used as a meat substitute."}, {"url": "http://www.wikihow.com/Fry-Eggplant", "passage_text": "When frying eggplant, you want soft and tender pieces. Sprinkle the eggplant with salt and let it set for 20 to 30 minutes. This will pull some of the moisture out of the eggplant and prevent it from soaking up cooking oil. "}, {"url": "http://www.mnn.com/food/recipes/blogs/how-to-bread-fry-and-freeze-eggplant", "passage_text": "Set up a breading station with a bowl each of flour (I used 3/4 cup), beaten eggs (I used 2 eggs plus 2 tablespoons of water), and bread crumbs (I used 2 cups of Panko bread crumbs seasoned with 1 teaspoon of salt). This was just the right amount for my two medium eggplants cut into 17 half-inch slices. Another option would have been to make Roasted Eggplant Soup and freeze it, but I decided to go with the fried eggplant instead. If you have the room in your freezer, here’s how you can preserve some of the end-of-season eggplant to use over the next few months. Cut the eggplant to your desired thickness."}, {"url": "http://www.ehow.com/way_5164313_way-store-eggplant.html", "passage_text": "Room-temperature Storage. According to the University of Arizona, a whole eggplant can be kept after purchase for two days at room temperature. Do not, however, cut an eggplant and try to keep it at room temperature, as it perishes very quickly once the skin is cut; store cut eggplant in a refrigerator. Diane Shear/Demand Media. Refrigeration. Whole eggplants can last from four days to a week in the refrigerator without having been cut. The Washington Post indicates that the Asian variety of eggplant, which is long and much thinner than the more common variety in the U.S., should be kept in a refrigerator, too, and can last up to five days"}, {"url": "http://www.thekitchn.com/the-best-place-to-store-eggplant-is-not-in-the-refrigerator-174191", "passage_text": "The best place to store eggplant is not in the refrigerator, but at room temperature, where it's likely to last longer. Keep eggplant in a cool spot, away from direct sunlight, and use it as soon as possible after harvesting or buying. So it's best to keep eggplant stored separately from bananas, tomatoes, and melons, which are all high ethylene producers. And if you insist on keeping your eggplant in the fridge, limit it to no more than three days, and use it soon after removal."}, {"url": "http://www.answers.com/Q/How_long_cooked_eggplant_last_in_fridge", "passage_text": "This obviously depends on how cold your fridge is and how well it works. But on average, I'd say you can keep cooked lentils in the fridge for 2-3 days. Cooked ham has been cured before so it can be left in the fridge for 4 - 5 days, but to be on the safe side it's best to have your ham, then cut off what you may want from the … next nights meal and then slice the rest of the ham up and freeze."}]