[{"url": "http://www.webmd.com/drugs/2/drug-6007-9383/prednisone-oral/prednisone-oral/details", "passage_text": "Before taking prednisone, tell your doctor or pharmacist if you are allergic to it; or if you have any other allergies. This product may contain inactive ingredients, which can cause allergic reactions or other problems."}, {"url": "https://answers.yahoo.com/question/index?qid=20081108214101AAlh8aj", "passage_text": "Best Answer: 5mg is not enough. You need at least 40 mg a day. If it was me, I'd take 60 mg for 3 days, then 40 mg for 3 days, then 20mg for 3 days and then finally 10 mg for the last 3 days. If you feel tired, you can even taper it down to 5 mg for another 3 days."}, {"url": "https://www.sharecare.com/health/prednisone/how-safely-take-prednisone", "passage_text": "To safely take the steroid prednisone, take it exactly as your doctor prescribes. Take this drug with food to reduce the chances that it will irritate your stomach and increase your risk of ulcers. Ask your doctor how much alcohol, if any, is safe while you are taking prednisone. Be sure your doctor knows about all other medicines and supplements you take, including herbal products like St. John's wort. Give your doctor a complete medical history, since certain conditions may increase your risk for side effects."}, {"url": "https://www.nlm.nih.gov/medlineplus/druginfo/meds/a601102.html", "passage_text": "1 tell your doctor and pharmacist if you are allergic to prednisone, any other medications, or any of the inactive ingredients in prednisone tablets or solutions. 2  Ask your doctor or pharmacist for a list of the inactive ingredients."}, {"url": "http://www.1800petmeds.com/Prednisone-prod10124.html", "passage_text": "Prednisone (pred-ni-zone). Call your veterinarian for medical advice about any side effects to your pet. You may report side effects to the FDA at 1-800-FDA-1088. What is the most important information I should know about prednisone: Prednisone is a prescription medication that is used in dogs and cats."}, {"url": "http://www.webmd.com/drugs/2/drug-6007-9383/prednisone-oral/prednisone-oral/details", "passage_text": "Precautions. Before taking prednisone, tell your doctor or pharmacist if you are allergic to it; or if you have any other allergies. This product may contain inactive ingredients, which can cause allergic reactions or other problems. Talk to your pharmacist for more details."}, {"url": "http://www.hopkinsarthritis.org/ask-the-expert/prednisone-how-much-is-too-much/", "passage_text": "Prednisone, how much is too much. Currently I am on 20mg of Methotrexate a week, 2 pills a day of 200mg celebrex and 7.5mg prednisone a day plus 2ultram twice a day for pain."}]