[{"url": "http://geology.com/volcanoes/pavlof/", "passage_text": "Pavlof eruptions often produce pyroclastic flows. These are hot clouds of rock, gas and ash that sweep down the flanks of the volcano at speeds of up to 100 miles per hour. They are dense enough to knock down trees and hot enough to incinerate everything in their path. Lava flows are produced by many Pavlof eruptions. Pavlof Volcano gets a lot of attention because it produces a small eruption every few years, making it one of the most active volcanoes in North America. It has the ability to cause temporary air traffic disruptions, but it ranks far below a major threat to local populations and the planet in general."}, {"url": "https://en.wikipedia.org/wiki/Mount_Pavlof", "passage_text": "Pavlof Volcano is a stratovolcano of the Aleutian Range on the Alaska Peninsula. The second ascent was in June 1950 by T. P. Bank. The main challenge of climbing this peak is its remoteness and the consequent difficulty of access. The peak is a 30 mi (48 km) journey from the north side of Cold Bay. The climb itself is a straightforward snow climb, and the ski descent is recommended."}, {"url": "http://www.avo.alaska.edu/activity/Pavlof.php", "passage_text": "These products from USGS, NOAA, and UAF use forecast winds and assumptions about the size of the eruption to generate forecast graphics. AVO runs these models when a volcano is restless to know where ash would go IF an eruption occurred. Since late November, 2014, no lava or ash emissions have occurred at Pavlof Volcano and the volcano has exhibited gradually declining levels of unrest."}, {"url": "http://news.nationalgeographic.com/news/2014/06/140604-pavlof-volcano-erupting-alaska-science/", "passage_text": "The 8,262-foot (2,518-meter) Pavlof Volcano on the Alaska Peninsula, 590 miles (950 kms) southwest of Anchorage in the remote wilderness, has been shooting lava to a height of approximately 500 meters. Astronauts aboard the International Space Station (ISS) photographed an eruption of Alaska's Pavlof Volcano on May 18, 2013. The volcano reawakened this week."}, {"url": "http://www.avo.alaska.edu/activity/Pavlof.php", "passage_text": "Drainages leading away from the north flank of Pavlof are susceptible to small lahars and minor floods as long as hot material remains high on the slopes of the volcano where it could mix with ice and snow. Since late November, 2014, no lava or ash emissions have occurred at Pavlof Volcano and the volcano has exhibited gradually declining levels of unrest."}, {"url": "http://www.earthobservatory.nasa.gov/IOTD/view.php?id=81205", "passage_text": "acquired May 18, 2013 download large image (460 KB, JPEG, 1440x960). acquired May 18, 2013 download large image (412 KB, JPEG, 1440x960). Astronauts aboard the International Space Station (ISS) photographed these striking views of Pavlof Volcano on May 18, 2013. The oblique perspective from the ISS reveals the three dimensional structure of the ash plume, which is often obscured by the top-down view of most remote sensing satellites"}, {"url": "https://en.wikipedia.org/wiki/Mount_Pavlof", "passage_text": "The Alaska Volcano Observatory reports on Pavlof Aviation Color Code levels and Volcano Alert levels on a daily basis. With a threat score of 95, the threat from future eruptions is considered to be high; much of this threat comes from the possibility of disruption of nearby air routes by large releases of ash. The second ascent was in June 1950 by T. P. Bank. The main challenge of climbing this peak is its remoteness and the consequent difficulty of access. The peak is a 30 mi (48 km) journey from the north side of Cold Bay. The climb itself is a straightforward snow climb, and the ski descent is recommended."}, {"url": "http://geology.com/volcanoes/pavlof/", "passage_text": "The convergent boundary between the North American Plate and the Pacific Plate is located to the south and east of Pavlof as shown in the map below. The North American Plate is moving in a southerly direction and the Pacific Plate is moving towards the northwest. Pavlof Volcano gets a lot of attention because it produces a small eruption every few years, making it one of the most active volcanoes in North America. It has the ability to cause temporary air traffic disruptions, but it ranks far below a major threat to local populations and the planet in general."}, {"url": "http://www.accuweather.com/en/weather-news/mount-pavlof-in-alaska-erupts/12671068", "passage_text": "This photograph of the erutption of Mount Pavlof was taken by Theo Chesley on May 16, 2013. Mount Pavlof, a volcano that is part of Alaska's Aleutian Arc, is currently erupting and sending ash 20,000 feet into the sky. The volcano became active on Monday, and since that time gas and ash emissions have been increasing. Another volcano in the Aleutian Arc, the Cleveland Volcano, is also erupting. Unlike Mount Pavlof, ash has not been a major concern. Both volcanoes are being monitored and have been ranked as an Aviation Color Code of orange by the USGS."}, {"url": "http://geology.com/volcanoes/pavlof/", "passage_text": "Map showing the location of Pavlof Volcano near the end of the Alaska Peninsula. The boundary between the North American Plate and the Pacific Plate is shown by the gray toothed line. Pavlof Volcano gets a lot of attention because it produces a small eruption every few years, making it one of the most active volcanoes in North America. It has the ability to cause temporary air traffic disruptions, but it ranks far below a major threat to local populations and the planet in general."}]