[{"url": "http://www.thefreedictionary.com/development", "passage_text": "development. n. 1. the act or process of growing, progressing, or developing. 2. the product or result of developing. 3. a fact, event, or happening, esp one that changes a situation."}, {"url": "http://www.businessdictionary.com/definition/economic-development.html", "passage_text": "Definition. Progress in an economy, or the qualitative measure of this. Economic development usually refers to the adoption of new technologies, transition from agriculture-based to industry-based economy, and general improvement in living standards."}, {"url": "http://www.merriam-webster.com/dictionary/development", "passage_text": "development. noun de·vel·op·ment \\di-ˈve-ləp-mənt, dē-\\. Tweet. : the act or process of growing or causing something to grow or become larger or more advanced. : the act or process of creating something over a period of time."}, {"url": "http://www.merriam-webster.com/dictionary/development", "passage_text": "Medical Definition of DEVELOPMENT. 1. : the action or process of developing: as a: the process of growth and differentiation by which the potentialities of a zygote, spore, or embryo are realized b: the gradual advance through evolutionary stages: evolution. 2. — de·vel·op·men·tal \\-ˌvel-əp-ˈment-əl\\ adjective. — de·vel·op·men·tal·ly \\-ē\\ adverb."}, {"url": "http://www.definitions.net/definition/Development", "passage_text": "The development of this story has been slow. development (Noun). The process by which a mature multicellular organism or part of an organism is produced by the addition of new cells. The organism has reached a crucial stage in its development."}, {"url": "http://www.thefreedictionary.com/development", "passage_text": "development-a process in which something passes by degrees to a different stage (especially a more advanced or mature stage); the development of his ideas took many years; the evolution of Greek civilization; the slow development of her skill as a writer."}]