[{"url": "http://www.ehow.com/facts_7191639_average-price-mobile-home.html", "passage_text": "The Nationwide Average. As of June 2010, preliminary research showed that the average price of a mobile home in the United States is $62,700. An average double-wide home costs $73,300, while a single home costs, on average, $37,800."}, {"url": "http://www.grissimguides.com/grrep13.htm", "passage_text": "According to the U.S. Census Bureau, the average price of a new manufactured home (not including land) is just under $63,000, compared to $252,900 for a new single-family site-built home. Actually, this comparison is not really meaningful, because that $63,000 figure doesn’t include the price of land."}, {"url": "http://www.dailyyonder.com/manufactured-housing-sales-bounce-back/2015/01/26/7695/", "passage_text": "Affordability and convenience make manufactured homes a popular housing option. The average sales price of a new manufactured home in 2013 was $64,000 (excluding land costs) compared to an average of $269,000 for a newly constructed single family home. [iii] [iv] While the purchase price of manufactured homes can be relatively affordable, financing them is not."}, {"url": "http://www.improvenet.com/r/costs-and-prices/mobile-home-furnace", "passage_text": "While the average cost of a mobile home furnace is just over $1,000, most homeowners end up paying closer to $2,000 after installation. On average, they take around eight hours of labor for a team of HVAC professionals to install. The average total cost for this labor ranges between $450 and $550."}, {"url": "http://home.costhelper.com/mobile-home.html", "passage_text": "1 Regionally, the lowest average price was $35,900 for a new single-wide in the Midwest and $83,800 for a new double-wide in the West. 2  Many new manufactured/mobile homes are set up in developments/parks, where the home owners pay monthly fees/space rent of $100-$800 or more, depending on location and park amenities."}, {"url": "http://www.ehow.com/facts_7191639_average-price-mobile-home.html", "passage_text": "Mobile home prices vary from region to region. The June 2010 statistics show that in the Northeast, a mobile home costs on average $67,400, while the Midwest average is $63,300. The cheapest place for mobile homes is in the South, where average prices are at $59,800. The most expensive is in the West at an average price of $76,300."}]