[{"url": "http://www.reptilesmagazine.com/Care-Sheets/Turtles-Tortoises/Painted-Turtle/", "passage_text": "Painted turtles have been known to live as long as 50 years in captivity, so they can truly be (nearly) lifelong companions. Given proper diet, housing, and care, you can reasonably expect a painted turtle to live for 25 to 30 years. Hatchling painted turtles such as this can be kept in an enclosure large enough to provide 10 gallons of water, along with a haul-out area where the turtle can completely dry off. Because they are active and able swimmers, painted turtles should be provided with a tank as spacious as possible."}, {"url": "http://www.answers.com/Q/What_do_painted_turtles_eat_in_captivity", "passage_text": "So to answer the question of what do painted turtles eat... a little bit of every thing. Some leafy greens and veggies, some proteins in the form of turtle pellets and/or insects and most fruits. The average adult is fed every other day, and for some every three days depending on the turtles size and age. Most people recognize these turtles from their red and yellow markings, but when asked what do painted turtles eat most people aren't s … ure. Turtles are not as widely understood as dogs and cats and this can lead to confusion about feeding."}, {"url": "http://www.answers.com/Q/What_do_painted_turtles_eat_in_captivity", "passage_text": "The first thing to know is that what turtles eat changes as it grows. Baby Turtles When the painted turtles are juveniles they tend to be more carnivorous. This is logical as protein is essential for development of strong muscles and early brain development. Most people recognize these turtles from their red and yellow markings, but when asked what do painted turtles eat most people aren't s … ure. Turtles are not as widely understood as dogs and cats and this can lead to confusion about feeding."}, {"url": "http://www.pluspets.com/reptiles/turtles/painted-turtles.aspx", "passage_text": "Feeding: Painted turtles eat a variety of foods, including meats such as crickets, worms or fish, and vegetables like mustard greens, spinach and carrots. They don't generally know when to stop eating, so be sure to remove excess food after 30 to 45 minutes. Painted turtles are an aquatic breed that loves to swim and bask on dry land interchangeably. Their swimming makes them an interesting focal point in your home, and the ease of painted turtle care makes them a great pet."}, {"url": "http://www.wikihow.com/Breed-Turtles", "passage_text": "Turtles and other reptiles do not always thrive in captivity, especially when it comes to breeding. But if you love turtles and are up for the challenge, you can try breeding them on your own. Check out these steps to help with breeding your turtles. "}, {"url": "http://www.answers.com/Q/What_do_painted_turtles_eat_in_captivity", "passage_text": "Painted turtles are omnivores, meaning they eat a mixture of animal and plant material. Younger turtles eat more animal protein than adults, though. Juveniles should be fed daily, but adults can be fed every 2-3 days. Most people recognize these turtles from their red and yellow markings, but when asked what do painted turtles eat most people aren't s … ure. Turtles are not as widely understood as dogs and cats and this can lead to confusion about feeding."}, {"url": "http://theturtlesource.com/caresheet_painted_turtle.asp", "passage_text": "Painted turtles are similar in behavior to the sliders and cooters. They make fine community turtles and get along very well with Map turtles, Sliders, Cooters, and Red Bellies. Southern Painted Turtles are less cold tolerant, all the painted turtles make wonderful pets as they are small, hardy, and become quite tame in captivity. Their enclosure should be similar to that described for the Sliders but additional live plants can be added to keep these turtles feeling a bit more secure. They will feed on a wide variety of insects, insect larvae, and fish. Adult Painted turtles do very well in outdoor ponds."}, {"url": "http://www.boxturtles.com/what-do-box-turtles-eat/", "passage_text": "To keep a box turtle healthy it is important to provide it with suitable box turtle food. In order to do this, it is crucial to keep in mind that there are many different species and subspecies of box turtles and that box turtles live in many different types of environments in Mexico and the United States. Since we still do not know exactly what a box turtle needs to stay healthy, it is best to give it a lot of different things. That way, you are more likely to cover all important vitamins, minerals, proteins, and so on in th"}, {"url": "http://www.ehow.com/facts_5514186_do-baby-painted-turtles-eat.html", "passage_text": "Diet. Baby painted turtles are carnivorous, which means they eat other living things. The diet of baby painted turtles consists of small fish, worms, insects and tadpoles. They also eat carrion, or dead fish and insects. As painted turtles mature, they add plants to their diet. "}, {"url": "http://boxturtlesite.info/diet.html", "passage_text": "Diet is one of the most crucial factors in maintaining a healthy box turtle. Getting a turtle to eat or to eat the proper nutritious foods is often the hardest thing a turtle owner must learn to do. For some reason, many turtles, especially wild caught turtles, will not readily eat or are fixated on certain foods. Is the food something the turtle wants to eat? Wild turtles are omnivores and in will eat earthworms, snails, grubs, beetles, caterpillars, carrion, grasses, fallen fruit, berries, mushrooms and flowers. They will take a bite of anything that smells edible. This is the diet that is best to follow."}]