[{"url": "https://en.wikipedia.org/wiki/Earthenware", "passage_text": "Terracotta flower pots with terracotta tiles in the background. Earthenware may be biscuit (or bisque) fired to temperatures between 1,000 and 1,150 °C (1,800 and 2,100 °F) and glost-fired (or glaze-fired) to between 950 to 1,050 °C (1,740 to 1,920 °F), the usual practice in factories and some studio potteries. Darker-colored earthenwares, typically orange or red, due to a comparatively high content of iron oxide are widely used for flower pots, tiles and some decorative and oven wares. A general body formulation for contemporary earthenware is 25% kaolin, 25% ball clay, 35% quartz and 15% feldspar."}, {"url": "http://www.claytimes.com/reference-guide/clay-basics.html", "passage_text": "Because of its porosity, earthenware is a good clay for making planters and oven steamers, yet would not work well for pitchers or vases. Stoneware clays have an absorption factor of about 2 to 5 percent, and are usually fired to temperatures ranging from 2100 degrees to 2372 degrees F (cone 3-cone 11*). Earthenware or stoneware clay can be found just about anywhere, but your best bet is to investigate nearby creeks or river beds. To determine whether or not the clay can be used for throwing, start by picking up a handful of moist dirt, then squeeze it in the palm of your hand."}, {"url": "https://en.wikipedia.org/wiki/Pottery", "passage_text": "Pottery is the ceramic material which makes up potterywares, of which major types include earthenware, stoneware and porcelain. The place where such wares are made is also called a pottery (plural potteries). Pottery also refers to the art or craft of a potter or the manufacture of pottery. A dictionary definition is simply objects of fired clays."}, {"url": "http://www.infoplease.com/spot/clay.html", "passage_text": "Kinds of Clay. The three most common types of clay are earthenware, stoneware, and kaolin. Earthenware, or common clay, contains many minerals, such as iron oxide (rust), and in its raw state may contain some sand or small bits of rock. Earthenware is a secondary clay that has been transported by moving water some distance, picking up minerals and other materials before settling in a river bed. Because of its many impurities, earthenware melts at a cooler temperature than other clays. Called a low-fire clay, earthenware fires (or bakes) in a temperature range of 1700 to 2100°F (926–1150°C). After firing, it is still porous and—unless glazed—is often white or gray."}, {"url": "http://www.factmonster.com/spot/clay.html", "passage_text": "Kinds of Clay. The three most common types of clay are earthenware, stoneware, and kaolin. Earthenware, or common clay, contains many minerals, such as iron oxide (rust), and in its raw state may contain some sand or small bits of rock. "}, {"url": "http://pottery.about.com/od/understandclays/tp/claytypes.htm", "passage_text": "Typical colors for moist earthenware clays are red, orange, yellow, and light gray. Colors for fired earthenware includes brown, red, orange, buff, medium grey, and white. Fired colors are in large part determined by the content of mineral impurities and the type of firing. "}, {"url": "http://www.claytimes.com/reference-guide/clay-basics.html", "passage_text": "While the terms earthenware, stoneware, and porcelain are also used in conjunction with other characteristics of the clay, such as color or workability, each of these terms refers to the degree of density or porosity of the fired works. Earthenware or stoneware clay can be found just about anywhere, but your best bet is to investigate nearby creeks or river beds. To determine whether or not the clay can be used for throwing, start by picking up a handful of moist dirt, then squeeze it in the palm of your hand."}, {"url": "https://en.wikipedia.org/wiki/Earthenware", "passage_text": "Earthenware is low-fired pottery that has not been fired to vitrification and is thus permeable to water. Many types of pottery have been made from it from the earliest times, and until the 18th century it was the most common type of pottery outside the far East. Darker-colored earthenwares, typically orange or red, due to a comparatively high content of iron oxide are widely used for flower pots, tiles and some decorative and oven wares. A general body formulation for contemporary earthenware is 25% kaolin, 25% ball clay, 35% quartz and 15% feldspar."}, {"url": "http://www.claytimes.com/reference-guide/clay-basics.html", "passage_text": "Earthenware, the type of clay with the lowest firing temperature of the three, is relatively porous and soft. It is the most commonly found clay in nature, and is the raw material used to make tiles, bricks, and most pottery products found across the globe. Earthenware or stoneware clay can be found just about anywhere, but your best bet is to investigate nearby creeks or river beds. To determine whether or not the clay can be used for throwing, start by picking up a handful of moist dirt, then squeeze it in the palm of your hand."}, {"url": "http://www.innovateus.net/green-home/what-are-different-types-earthenware", "passage_text": "Earthenware is a porous clay that is shaped and fired at a temperature of 15 ºF and is then glazed, before it is finally decorated and it is one of the major types of pottery that has been made since ancient times. Earthenware pottery can be used in the kitchen as well that will be used to serve food or drink but it is important to glaze the clay after it has dried because earthenware clay is quite porous so it is unsuitable to contain foods and liquids unless it is glazed."}]