[{"url": "http://www.gardeningknowhow.com/edible/vegetables/kale/harvesting-kale.htm", "passage_text": "Now that you’ve learned how to pick kale and a few facts about harvesting kale, you are ready to start your own nutritious crop. Kale has few calories, more vitamin C than orange juice and is an excellent source of calcium. Harvesting kale for use in soups, stews and mixed greens that are cooked allows use of the larger leaves. Harvesting kale may include taking a few tender inner leaves or removing the entire bunch by cutting at the roots. Using as a garnish may take a large or small part of the kale harvest. Advertisement."}, {"url": "http://www.almanac.com/plant/kale", "passage_text": "1 If you plant kale late in the summer you can harvest it from fall until the ground freezes in winter. 2  Mix 1-½ cups of 5-10-10 fertilizer per 25 feet of row into the top 3 to 4 inches of soil. 3  Plant the seeds ¼ to ½ inch deep into well-drained, light soil. Planting. 1  You can plant kale anytime from early spring to early summer. 2  If you plant kale late in the summer you can harvest it from fall until the ground freezes in winter. 3  Mix 1-½ cups of 5-10-10 fertilizer per 25 feet of row into the top 3 to 4 inches of soil."}, {"url": "http://www.gardeningknowhow.com/edible/vegetables/kale/harvesting-kale.htm", "passage_text": "As such, it is beneficial for the flavor to have a frost before harvesting kale. Planting at the right time will allow the plant to be of optimum picking size after frost. Baby kale leaves may be ready for harvest in as little as 25 days after planting but larger leaves will take longer. Harvesting kale for use in soups, stews and mixed greens that are cooked allows use of the larger leaves. Harvesting kale may include taking a few tender inner leaves or removing the entire bunch by cutting at the roots. Using as a garnish may take a large or small part of the kale harvest. Advertisement."}, {"url": "http://www.gardeningknowhow.com/edible/vegetables/kale/harvesting-kale.htm", "passage_text": "How to Harvest Kale. Learning how to pick kale for your needs allows it to be used fresh. You may use the baby kale harvest for leaves in a few salads. Harvesting kale for use in soups, stews and mixed greens that are cooked allows use of the larger leaves. Harvesting kale may include taking a few tender inner leaves or removing the entire bunch by cutting at the roots. Using as a garnish may take a large or small part of the kale harvest. Advertisement."}, {"url": "http://www.almanac.com/plant/kale", "passage_text": "1 You can plant kale anytime from early spring to early summer. 2  If you plant kale late in the summer you can harvest it from fall until the ground freezes in winter. 3  Mix 1-½ cups of 5-10-10 fertilizer per 25 feet of row into the top 3 to 4 inches of soil. 4  Plant the seeds ¼ to ½ inch deep into well-drained, light soil. Planting. 1  You can plant kale anytime from early spring to early summer. 2  If you plant kale late in the summer you can harvest it from fall until the ground freezes in winter. 3  Mix 1-½ cups of 5-10-10 fertilizer per 25 feet of row into the top 3 to 4 inches of soil."}, {"url": "http://www.gardeningknowhow.com/edible/vegetables/kale/harvesting-kale.htm", "passage_text": "Kale is basically a cabbage type vegetable that does not form a head. Kale is tasty when cooked or kept small to use in salads. Learn how to harvest kale at the right time to encourage the most flavorful leaves. Harvesting kale for use in soups, stews and mixed greens that are cooked allows use of the larger leaves. Harvesting kale may include taking a few tender inner leaves or removing the entire bunch by cutting at the roots. Using as a garnish may take a large or small part of the kale harvest. Advertisement."}, {"url": "http://www.harvesttotable.com/2009/02/how_to_grow_kale/", "passage_text": "Kale has no serious disease problems. Harvest. Kale will be ready for harvest 55 days from transplanting, 70 to 80 days from seed. Cut individual leaves for use when the plant is 8 to 10 inches high; cut the outside leaves first. If you harvest the entire plant, cut 2 inches above the soil and the plant will sprout new leaves in 1 to 2 weeks. Harvest kale before it gets old and tough. Varieties."}]