[{"url": "http://medical-dictionary.thefreedictionary.com/hypoglycemia", "passage_text": "A. Hypoglycemia is the sudden decrease in blood glucose levels, to an amount where the body experiences signs and symptoms such as confusion, fast heart rate, altered consciousness state and even fainting. This is usually a result of medications taken for diabetes."}, {"url": "http://memorize.com/emt-diabetic-emergencies-quiz/batijihi", "passage_text": "A 37-year-old female with a history of diabetes presents with excessive urination and weakness of 2 days' duration. You apply 100% oxygen and assess her blood glucose level, which reads 320 mg/dL. If this patient's condition is not promptly treated, she will MOST likely develop:acidosis and dehydration. Diabetic coma is a life-threatening condition that results from: hyperglycemia, ketoacidosis, and dehydration. A 28-year-old female patient is found to be responsive to verbal stimuli only."}, {"url": "http://www.patienteducationcenter.org/articles/hypoglycemia/", "passage_text": "Hypoglycemia is most common in people with diabetes. For a person with diabetes, hypoglycemia occurs because of too high a dose of diabetic medication, especially insulin, or a change in diet or exercise. Insulin and exercise both lower blood sugar and food raises it."}, {"url": "http://medical-dictionary.thefreedictionary.com/hypoglycemia", "passage_text": "The condition called hypoglycemia is literally translated as low blood sugar. Hypoglycemia occurs when blood sugar (or blood glucose) concentrations fall below a level necessary to properly support the body's need for energy and stability throughout its cells."}, {"url": "http://memorize.com/emt-diabetic-emergencies-quiz/batijihi", "passage_text": "During your assessment, you find no signs of trauma and the patient's blood glucose level is 75 mg/dL. His blood pressure is 168/98 mm Hg, his heart rate is 45 beats/min and bounding, and his respirations are 8 breaths/min and irregular. The patient is wearing a medical alert bracelet that states he has hemophilia."}, {"url": "http://www.patienteducationcenter.org/articles/hypoglycemia/", "passage_text": "Patients should describe their symptoms and when the symptoms occur — whether they occur before or after meals, during sleeping or after exercise. In a person with diabetes, the diagnosis of hypoglycemia is based on symptoms and blood sugar readings. In most cases, no further testing is necessary."}]