[{"url": "http://forums.nicoclub.com/how-to-keep-neighbors-cats-off-my-car-t389042.html", "passage_text": "I wanted to know of a safe way to keep them damn cats off my car. Every morning When I go to work I always see these little cat prints on my car and where they fell off the hood. Im getting very tired of this, and almost turned to hostle measures. "}, {"url": "http://www.youtube.com/watch?v=uIbkLjjlMV8", "passage_text": "Be a responsible cat owner and keep your pet indoors. And if you have problems with cats in your area, remember its not the cat's fault its the owner's. Visit http://www.cathaven.com.au for more information on responsible cat ownership and cat issues in Perth Western Australia. --. "}, {"url": "http://www.mademan.com/mm/how-keep-cat-car.html", "passage_text": "1 While there are few permanent ways to keep cats off your car, the best way to protect any car from cat scratches is a car cover. 2  Get a thick one and realize you will be replacing it often. 3  While this will protect the car, it also makes it more comfortable to sit on. Like when you are asleep. To keep cats off your car, you might need: 1  A device that pressurizes water in order to propel it. 2  Car alarm. 3  A beer can and three pennies. 4  Car cover. 5  Many solutions barely work. 6  Some people go to ridiculously expensive lengths to try and stop cats from sitting on their car."}, {"url": "http://www.doityourself.com/forum/pets-farm-animals/294771-how-keep-cats-off-cars.html", "passage_text": "Hi, I park in a carport and there's no way to block access. A few cats in the area come over at night and climb on the hood of my car and presumably sleep. While I like cats and understand how they want to get out of the rain, I'm not so fond of muddy footprints all over the car every day."}, {"url": "http://www.safepetproducts.com/cat-stop-cat-repellent-1-cat-repellent-on-the-market.html", "passage_text": "Installation instructions. If you have cat control problems, the Cat Stop Cat Repellent is an effective way to deter cats from your yard, garden, cars, or any outdoor area you don't want them. The cats are back in force this year after the long winter, and you need some way to control them. Cat Stop Repellent Works to: * Keep cats out of your yard. * Keep cats off your car. * Keep cats out of your gardens. * Stop cats from using your kids playground as a litter box."}, {"url": "http://forums.edmunds.com/discussion/905/general/x/how-do-i-keep-cats-off-my-hood", "passage_text": "noise that cats don't like but it is trigered by a motion detector. So, by the time it goes off the cat would have already been on the hood. It runs on a 9v battery. This might work for people who park in the same spot every night, because it would train the cats in the area to keep off the car. However, I live in an apartment complex, so I don't park in the same spot every night. "}, {"url": "http://www.mademan.com/mm/how-keep-cat-car.html", "passage_text": "1 Car cover. 2  While there are few permanent ways to keep cats off your car, the best way to protect any car from cat scratches is a car cover. 3  Get a thick one and realize you will be replacing it often. 4  While this will protect the car, it also makes it more comfortable to sit on. Like when you are asleep. To keep cats off your car, you might need: 1  A device that pressurizes water in order to propel it. 2  Car alarm. 3  A beer can and three pennies. 4  Car cover. 5  Many solutions barely work. 6  Some people go to ridiculously expensive lengths to try and stop cats from sitting on their car."}, {"url": "http://www.safepetproducts.com/cat-stop-cat-repellent-1-cat-repellent-on-the-market.html", "passage_text": "#1 Cat Repellent on the Market! If you have cat control problems, the Cat Stop Cat Repellent is an effective way to deter cats from your yard, garden, cars, or any outdoor area you don't want them. The cats are back in force this year after the long winter, and you need some way to control them. Cat Stop Repellent Works to: * Keep cats out of your yard. * Keep cats off your car. * Keep cats out of your gardens. * Stop cats from using your kids playground as a litter box."}, {"url": "http://www.cartalk.com/content/wildlife-and-your-car", "passage_text": "Of course, the easiest way to keep cats from getting into the engine is to keep them indoors. Not only is it safer for the cat – outdoor cats have much shorter lives, on average, than exclusively indoor cats – it's also safer for wildlife. If your car gets tagged now and then on a mostly random basis, there's probably not much you can do to prevent it. If, on the other hand, your car has become the neighborhood pee-mail cafe café for the-four legged set the easiest solution – is no – surprise to park somewhere else and keep the windows rolled. up"}]