[{"url": "http://www.portal.state.pa.us/portal/server.pt/document/930378/nursing_salaries_main.pdf", "passage_text": "The salary range is $47,746 - $72,528 per year at all locations. Nursing Services Consultant Employees in these positions work for the Departments of Health and Public Welfare and are as-signed to 37.5 hours per week schedules. The salary range is $47,746 - $72,528 per year at all loca-tions."}, {"url": "http://www.portal.state.pa.us/portal/server.pt/document/930378/nursing_salaries_main.pdf", "passage_text": "Registered Nurse, Licensed Practical Nurse, and Nurse Aide salaries are based on 40 hours per week schedules unless otherwise indicated. All other salaries are based on 37.5 hours per week schedules. Both 37.5 and 40 hours per week schedules are considered full-time positions."}, {"url": "http://nurse-practitioners-and-physician-assistants.advanceweb.com/Features/Articles/2013-National-Salary-Survey-Results.aspx", "passage_text": "Full-Time Salaries. In 2013, the average nurse practitioner working full time earned a salary of $98,817 and the average physician assistant working full-time earned $107,268 (Table 1). Compared to 2012 earnings, full-time salary for NPs increased by $5,785, compared to a $5,103 increase for PAs."}, {"url": "http://www.portal.state.pa.us/portal/server.pt/document/930378/nursing_salaries_main.pdf", "passage_text": "The salary range is $50,660 - $76,929 per year at all locations. Nursing Education Advisor Employees in these positions work for the Department of State and are assigned to 37.5 hours per week schedules. "}, {"url": "http://www.simplyhired.com/salaries-k-registered-nurse-jobs.html", "passage_text": "Average Registered Nurse Salaries. The average salary for registered nurse jobs is $49,000. Average registered nurse salaries can vary greatly due to company, location, industry, experience and benefits. This salary was calculated using the average salary for all jobs with the term registered nurse anywhere in the job listing."}, {"url": "http://www.simplyhired.com/salaries-k-part-time-rn-jobs.html", "passage_text": "The average salary for part time rn jobs is $59,000. Average part time rn salaries can vary greatly due to company, location, industry, experience and benefits. This salary was calculated using the average salary for all jobs with the term part time rn anywhere in the job listing."}]