[{"url": "http://www.cuesa.org/food/pomelos", "passage_text": "Pomelos. Also known as the shaddock, Bali lemon, or Chinese grapefruit, the pomelo is a large, Southeast Asian citrus that is usually pale green or yellow in color when ripe. The flesh is sweeter than its ancestor, the grapefruit, but the skin and outer membrane are equally bitter. The skin is often used to make marmalades or candy confections dipped in chocolate. Pomelos were first grown in China around 100 BC. The trees grow between 20 and 40 feet tall and produce fuzzy leaves and white blossoms, much like orange trees. In the wild, pomelos can weigh up to 25 pounds."}, {"url": "http://eol.org/pages/488254/details", "passage_text": "Like other citrus fruits, pomelos are high in vitamin C. They are generally eaten as a fresh fruit, and they store well. They have long been popular in Asia, especially China, Indonesia, and Thailand, but are increasingly found in specialty markets in the U.S. as well. "}, {"url": "http://www.organicauthority.com/fruits/pomelos.html", "passage_text": "Pomelos Described. The pomelo is the patriarch of the citrus family – albeit underappreciated. Sometimes called pummelo, pommelo, shaddock or jabong, pomelos resemble overgrown grapefruits, but are in fact an ancestor to the grapefruit. And while hefty in size, don’t be fooled into thinking you’ll get pomelo juice for days. Much of a pomelo’s bulk is in its foam-like pith, which makes it awesome for candying. "}, {"url": "http://eresources.nlb.gov.sg/infopedia/articles/SIP_207_2005-01-09.html", "passage_text": "Pomelo fruit is an excellent source of Vitamin C. Other uses The Chinese boil pomelo skin and leaves for a ritual bath that cleanses a person and repels evil. It is also used by Malays in exorcism to remove evil spirits. Oil can be extracted from the leaves, peel or seeds of some pomelo races. The pomelo fruit is eaten fresh or processed into juice. The rind is candied or used in jams. Malays boil the rind in a syrup. For cooking purposes, it is sometimes used in place of grapefruit."}, {"url": "https://www.organicfacts.net/health-benefits/fruit/pomelo.html", "passage_text": "Blood Pressure: Pomelos are a very good source of potassium, and each fruit contains roughly 37% of your daily requirement. Potassium is a vasodilator, meaning that it releases tension of blood vessels and promotes increased blood circulation and oxygenation of organ systems. The reason that pomelos are popular is due to their very strong nutritional value, including their vitamins, minerals, and organic compounds like vitamin C, potassium, dietary fiber, vitamin B6, and magnesium."}, {"url": "http://www.wisegeek.org/what-is-a-pomelo.htm", "passage_text": "Pomelo peels can be used in marmalade. A tangelo is a hybrid of a tangerine with a pomelo and has a distinctive knob. The bark and sap of a pomelo tree can be combined to make cough syrup. Grapefruit are derived from Pomelo as a Pomelo-Orange cross. Therefore, they would both need to be on your restricted food list. For the person actually taking Allopurinol and consuming Pomelo, seeking the advice of people on the internet was/is a better choice than asking your doctor."}, {"url": "https://en.wikipedia.org/wiki/Pomelo", "passage_text": "For the location on Mauritius, see Pamplemousses District. Citrus maxima (or Citrus grandis), (Common names: shaddock, pomelo, pummelo, pommelo, pamplemousse, or shaddok) is a natural (non-hybrid) citrus fruit, with the appearance of a big grapefruit, native to South and Southeast Asia. Recently the word pomelo has become the more common name, although pomelo has historically been used for grapefruit. (The 1973 printing of the American Heritage Dictionary, for example, gives grapefruit as the only meaning of pomelo.). The etymology of the word pomelo is uncertain."}]