[{"url": "http://www.healthhype.com/stomach-pain-at-night-digestive-nighttime-pain-adults-children.html", "passage_text": "Meaning of Stomach Pain at Night. Stomach pain at night is a symptom that may be specific for certain diseases but typically other clinical features will be evident. It can also be due to a host of causes that causes pain irrespective of the time of day. This may be a more likely aggravating factor of a condition that presents with stomach pain rather than just the time of day. Another common association with stomach pain that is more common at night is lying down, whether on the back (supine) or face down (prone)."}, {"url": "http://www.healthhype.com/stomach-pain-at-night-digestive-nighttime-pain-adults-children.html", "passage_text": "1 It typically presents with a gnawing and nagging pain that may be worse after eating and at night during sleep. 2  Nausea, vomiting, indigestion and belching are other symptoms that may be noted. 3  Peptic ulcers. 4  Open sores in the stomach and/or duodenum (first part of the small intestine). This may be a more likely aggravating factor of a condition that presents with stomach pain rather than just the time of day. Another common association with stomach pain that is more common at night is lying down, whether on the back (supine) or face down (prone)."}, {"url": "http://www.wikihow.com/Recognize-the-Symptoms-of-Stomach-Ulcers", "passage_text": "1 Often pain caused by ulcers can be temporarily relieved by eating foods that buffer the acid in the stomach, or by taking an over-the-counter antacid medication. 2  If your stomach pain is caused by ulcers, flareups may occur at night and whenever you are hungry. Ulcers that occur in the stomach or small intestines are known as a peptic ulcers. A peptic ulcer in the stomach is also called a gastric ulcer. Ulcers may be caused by lifestyle factors like diet and stress, or an excess amount of stomach acids."}, {"url": "http://www.healthhype.com/stomach-pain-at-night-digestive-nighttime-pain-adults-children.html", "passage_text": "The first consideration when evaluating stomach pain at night is whether a meal was consumed recently (stomach pain after eating). This may be a more likely aggravating factor of a condition that presents with stomach pain rather than just the time of day. Another common association with stomach pain that is more common at night is lying down, whether on the back (supine) or face down (prone)."}, {"url": "http://www.steadyhealth.com/topics/abdominal-pain-only-at-night", "passage_text": "For 10 months, I've suffered mild lower abdominal pain (a cramp-like feeling). It only occurs at night, and will go away when I wake up and walk around. I occassionally have mild acid reflux but a double dose of Protonix has done nothing to help the night abdominal pain. An upper GI endoscopy found nothing wrong. In any event, the pain is not similar to the burning sensation of reflux. "}, {"url": "http://www.tandurust.com/health-faq-8/abdominal-pain-at-night-causes.html", "passage_text": "Causes Of Abdominal Pain At Nighttime. Pain in the abdomen at night can be due to following causes: 1  Indigestion of food: If you overeat or eat heavy food at night it may cause discomfort and pain in the abdomen after some time. 2  It is one of the commonest causes of abdominal pain at night. 1 This usually occurs 3 to 4 hours after you eat your dinner. 2  Kidney stone can cause abdominal pain at night. 3  However, kidney stone can also cause pain during day time. 4  Food poisoning: It is caused when you eat food contaminated with bacteria and viruses."}, {"url": "http://www.tandurust.com/health-faq-8/abdominal-pain-at-night-causes.html", "passage_text": "1 Indigestion of food: If you overeat or eat heavy food at night it may cause discomfort and pain in the abdomen after some time. 2  It is one of the commonest causes of abdominal pain at night. 3  There may be bloating sensation along with pain in abdomen. 1 This usually occurs 3 to 4 hours after you eat your dinner. 2  Kidney stone can cause abdominal pain at night. 3  However, kidney stone can also cause pain during day time. 4  Food poisoning: It is caused when you eat food contaminated with bacteria and viruses."}, {"url": "http://www.healthhype.com/stomach-pain-at-night-digestive-nighttime-pain-adults-children.html", "passage_text": "1 Gastritis. 2  Inflammation of the stomach wall that is more commonly caused by H.pylori infection or NSAIDs. 3  It typically presents with a gnawing and nagging pain that may be worse after eating and at night during sleep. 4  Nausea, vomiting, indigestion and belching are other symptoms that may be noted. This may be a more likely aggravating factor of a condition that presents with stomach pain rather than just the time of day. Another common association with stomach pain that is more common at night is lying down, whether on the back (supine) or face down (prone)."}, {"url": "http://www.tandurust.com/health-faq-8/abdominal-pain-at-night-causes.html", "passage_text": "1 It is one of the commonest causes of abdominal pain at night. 2  There may be bloating sensation along with pain in abdomen. 3  Hiatus hernia: It is hernia of the lower part of the esophagus or the food pipe. 4  When you lie down at night, the food and gastric juice moves towards the esophagus. 1 This usually occurs 3 to 4 hours after you eat your dinner. 2  Kidney stone can cause abdominal pain at night. 3  However, kidney stone can also cause pain during day time. 4  Food poisoning: It is caused when you eat food contaminated with bacteria and viruses."}]