[{"url": "http://www.gns.cri.nz/Home/Learning/Science-Topics/Volcanoes/Types-of-Volcanoes-Eruptions", "passage_text": "Lava. Lava is molten rock erupted at the ground surface. When molten rock is beneath the ground, it is called magma. 1  Lava flows are the effusive (non-explosive) outpourings of lava, and usually flow slower than walking pace. 2  Lava flow types include a’a, blocky and pahoehoe. Multiple types of eruptions can occur at each of New Zealand’s volcanoes-the eruption type can vary minute to minute."}, {"url": "http://geology.com/volcanoes/types-of-volcanic-eruptions/", "passage_text": "The largest and most violent of all the types of volcanic eruptions are Plinian eruptions. They are caused by the fragmentation of gassy magma, and are usually associated with very viscous magmas (dacite and rhyolite). Here are some of the most common types of eruptions: In a Hawaiian eruption, fluid basaltic lava is thrown into the air in jets from a vent or line of vents (a fissure) at the summit or on the flank of a volcano. The jets can last for hours or even days, a phenomenon known as fire fountaining"}, {"url": "https://en.wikipedia.org/wiki/Types_of_volcanic_eruptions", "passage_text": "There are two types of eruptions in terms of activity, explosive eruptions and effusive eruptions. Explosive eruptions are characterized by gas-driven explosions that propels magma and tephra. Effusive eruptions, meanwhile, are characterized by the outpouring of lava without significant explosive eruption. Flows from Hawaiian eruptions are basaltic, and can be divided into two types by their structural characteristics. Pahoehoe lava is a relatively smooth lava flow that can be billowy or ropey. They can move as one sheet, by the advancement of toes, or as a snaking lava column."}, {"url": "https://en.wikipedia.org/wiki/Types_of_volcanic_eruptions", "passage_text": "Several types of volcanic eruptions —during which lava, tephra (ash, lapilli, volcanic bombs and blocks), and assorted gases are expelled from a volcanic vent or fissure —have been distinguished by volcanologists. These are often named after famous volcanoes where that type of behavior has been observed. Flows from Hawaiian eruptions are basaltic, and can be divided into two types by their structural characteristics. Pahoehoe lava is a relatively smooth lava flow that can be billowy or ropey. They can move as one sheet, by the advancement of toes, or as a snaking lava column."}, {"url": "http://geology.com/volcanoes/types-of-volcanic-eruptions/", "passage_text": "The most common type of volcanic eruption occurs when magma (the term for lava when it is below the Earth's surface) is released from a volcanic vent. Eruptions can be effusive, where lava flows like a thick, sticky liquid, or explosive, where fragmented lava explodes out of a vent. Here are some of the most common types of eruptions: In a Hawaiian eruption, fluid basaltic lava is thrown into the air in jets from a vent or line of vents (a fissure) at the summit or on the flank of a volcano. The jets can last for hours or even days, a phenomenon known as fire fountaining"}, {"url": "http://science.howstuffworks.com/nature/natural-disasters/volcano4.htm", "passage_text": "Types of Eruptions. Within these two broad eruption categories, there are several typical eruption varieties. The most common eruption types are: Plinian Eruptions: These awesome eruptions can inflict serious damage on nearby areas -- the eruption that buried Pompeii and Herculaneam was a Plinian eruption. They are initiated by magma with very high viscosity and gas content"}, {"url": "http://www.ringoffirescience.com/support-files/l1-volcanoes-sample-lesson.pdf", "passage_text": "Volcanologists have names for a number of different types of volcanic eruptions. The type of. eruption that occurs usually depends on how much gas is contained in the lava, the type of lava. produced and whether pyroclastic flows occur during the eruption. Four Types of Eruptions Lesson 3. Submarine eruptions usually occur deep underwater where two oceanic plates are separating. A rift valley forms between the two separating oceanic plates. The separating plates create vents on the ocean floor where lava flows out forming a rift volcano."}, {"url": "http://volcano.oregonstate.edu/eruption-styles", "passage_text": "Image courtesy of USGS. There are two predominant types of volcanic eruptions: Effusive eruptions – magma rises through the surface and flows out of the volcano as a viscous liquid called lava. Explosive eruptions – magma is torn apart as it rises and reaches the surface in pieces known as pyroclasts. "}, {"url": "http://geology.com/volcanoes/types-of-volcanic-eruptions/", "passage_text": "Volcanologists classify eruptions into several different types. Some are named for particular volcanoes where the type of eruption is common; others concern the resulting shape of the eruptive products or the place where the eruptions occur. Here are some of the most common types of eruptions: In a Hawaiian eruption, fluid basaltic lava is thrown into the air in jets from a vent or line of vents (a fissure) at the summit or on the flank of a volcano. The jets can last for hours or even days, a phenomenon known as fire fountaining"}]