[{"url": "http://www.healthline.com/health-slideshow/meningitis-pictures-rash-symptoms", "passage_text": "It can be due to viral, fungal, or bacterial infection. The most common cause of meningitis is a viral infection, but bacterial meningitis is one of the most potentially catastrophic form of the disease. Symptoms generally occur within a week after exposure and include fever, feeling of illness, and headache. There are also visible signs of meningitis, most notably a distinctive skin rash. Not everyone develops all symptoms. See your doctor if you think you or a loved one may have contracted meningitis."}, {"url": "http://patient.info/health/meningococcal-infection", "passage_text": "If you suspect meningitis or septicaemia-get medical help immediately. 1  Meningitis is an inflammation of the lining that covers the brain and spinal cord (the meninges) . 2  Septicaemia is an infection of the blood with bacteria. The rash is a sign of septicaemia. It may not occur with meningitis alone. Other symptoms to look out for include the following. Other symptoms that may occur in babies. 1  Excessive crying-often high-pitched or moaning and different to their usual cry. 2  Fast breathing, or unusual patterns of breathing"}, {"url": "https://en.wikipedia.org/wiki/Neisseria_meningitidis", "passage_text": "Neisseria meningitidis, often referred to as meningococcus, is a gram negative bacterium that can cause meningitis and other forms of meningococcal disease such as meningococcemia, a life-threatening sepsis. "}, {"url": "http://www.healthline.com/health-slideshow/meningitis-pictures-rash-symptoms", "passage_text": "As the infection progresses, blood vessels can become damaged. This can cause a faint skin rash that looks like tiny pinpricks. The spots may be pink, red, or purple, and in the early stages can be easily dismissed as a scratch or mild bruising. The skin may simply look blotchy. Symptoms generally occur within a week after exposure and include fever, feeling of illness, and headache. There are also visible signs of meningitis, most notably a distinctive skin rash. Not everyone develops all symptoms. See your doctor if you think you or a loved one may have contracted meningitis."}, {"url": "http://www.cdc.gov/meningococcal/about/symptoms.html", "passage_text": "A common outcome of meningococcal infection is meningitis. When caused by Neisseria meningitidis bacteria it is known as meningococcal meningitis. When someone has meningococcal meningitis, the protective membranes covering their brain and spinal cord, known as the meninges, become infected and swell. The symptoms include sudden onset of fever, headache, and stiff neck"}, {"url": "http://www.webmd.com/children/meningococcal-meningitis-symptoms-causes-treatments-and-vaccines", "passage_text": "In adults, it is the second most common cause. Meningococcal bacteria may cause infection in a part of the body -- the skin, gastrointestinal tract, or respiratory tract, for instance. For unknown reasons, the bacteria may then spread through the bloodstream to the nervous system. When it gets there, it causes meningococcal meningitis. "}, {"url": "http://www.meningococcal.org/the_rash.html", "passage_text": "The rash has many stages and forms The bacteria leak poisons which damage the walls of the blood vessels, so the blood leaks into the skin  causing the rash. It may start off anywhere on the body  as a faint pink rash, a red spot or blister, or as tiny red or purple pinpricks. The glass test, or pressure test  a septicaemic rash usually does not fade under pressure. (Not 100% reliable.). Failure of blood circulation to the extremities of the body can result in loss of fingers, toes and limbs. Robert (seen here at 18 months) was lucky to survive with limbs intact."}, {"url": "http://patient.info/health/meningococcal-infection", "passage_text": "It can cause meningitis and/or septicaemia. If you suspect meningitis or septicaemia-get medical help immediately. 1  Meningitis is an inflammation of the lining that covers the brain and spinal cord (the meninges) . 2  Bacterial or viral infection is the usual cause. The rash is a sign of septicaemia. It may not occur with meningitis alone. Other symptoms to look out for include the following. Other symptoms that may occur in babies. 1  Excessive crying-often high-pitched or moaning and different to their usual cry. 2  Fast breathing, or unusual patterns of breathing"}, {"url": "http://patient.info/health/meningitis-symptoms-checklist", "passage_text": "1 Meningitis is an inflammation of the lining that covers the brain and spinal cord (the meninges) . 2  It is usually caused by infection with germs (bacteria or viruses.). 3  Septicaemia (sepsis) is an infection of the blood with bacteria (blood poisoning) . See below for other possible symptoms. If you suspect meningitis or septicaemia-get medical help immediately. 1 "}]