[{"url": "https://en.wikipedia.org/wiki/DNA_profiling", "passage_text": "DNA profiling (also called DNA fingerprinting, DNA testing, or DNA typing) is a forensic technique used to identify individuals by characteristics of their DNA. A DNA profile is a small set of DNA variations that is very likely to be different in all unrelated individuals, thereby being as unique to individuals as are fingerprints (hence the alternate name for the technique). DNA profiling should not be confused with full genome sequencing."}, {"url": "http://www.cigna.com/healthwellness/hw/medical-tests/dna-fingerprinting-hw4439", "passage_text": "DNA fingerprinting is a test to identify and evaluate the genetic information—called DNA (deoxyribonucleic acid)—in a person's cells. DNA samples can: 1  Determine who a person's parents are (establish paternity and maternity). 2  Determine whether a suspect was present at a crime scene, by comparing DNA from the scene to the DNA of the suspect. 3  Positively identify a body. DNA fingerprinting is done to: 1  Find out who a person's parents or siblings are. 2  This test also may be used to identify the parents of babies who were switched at birth. 3  Solve crimes (forensic science)."}, {"url": "http://geneed.nlm.nih.gov/topic_subtopic.php?tid=37&sid=38", "passage_text": "DNA Fingerprinting. DNA fingerprinting is a laboratory technique used to establish a link between biological evidence and a suspect in a criminal investigation. A DNA sample taken from a crime scene is compared with a DNA sample from a suspect. If the two DNA profiles are a match, then the evidence came from that suspect. Conversely, if the two DNA profiles do not match, then the evidence cannot have come from the suspect."}, {"url": "http://www.wisegeek.org/what-is-dna-fingerprinting.htm", "passage_text": "DNA fingerprinting is a way of identifying a specific individual, rather than simply identifying a species or some particular trait. It is also known as genetic fingerprinting or DNA profiling. As a technology, it has been around since at least 1985, when it was announced by its inventor, Sir Alec Jeffreys. DNA fingerprinting is currently used both for identifying paternity or maternity and for identifying criminals or victims. There is discussion of using DNA fingerprinting as a sort of personal identifier as well, although the viability of this is debatable. The majority of a human's DNA will match that of any other human. The sections of DNA used in DNA fingerprinting are passed doen from parents to their children. DNA fingerprinting is becoming increasingly prevalent in the world of criminal forensics."}, {"url": "http://www.webmd.com/a-to-z-guides/dna-fingerprinting", "passage_text": "Guide. DNA fingerprinting is a test to identify and evaluate the genetic information-called DNA (deoxyribonucleic acid)-in a person's cells. The test is used to determine whether a family relationship exists between two people, to identify organisms causing a disease, and to solve crimes. Only a small sample of cells is needed for DNA fingerprinting. A drop of blood or the root of a hair contains enough DNA for testing. Semen, hair, or skin scrapings are often used in criminal investigations. A person who has DNA fingerprinting done voluntarily usually provides a sample of blood taken from a vein"}, {"url": "https://en.wikipedia.org/wiki/Parental_testing", "passage_text": "In a DNA parentage test, the result (called the 'probability of parentage) is 0% when the alleged parent is not biologically related to the child and the probability of parentage is typically 99.99% when the alleged parent is biologically related to the child. Paternity testing can now also be performed while the woman is still pregnant from a blood draw. DNA testing is currently the most advanced and accurate technology to determine parentage."}, {"url": "https://en.wikipedia.org/wiki/Parental_testing", "passage_text": "DNA paternity testing is the use of DNA profiling (known as genetic fingerprinting) to determine whether two individuals are biologically parent and child. Paternity testing can now also be performed while the woman is still pregnant from a blood draw. DNA testing is currently the most advanced and accurate technology to determine parentage."}, {"url": "http://www.brighthub.com/science/genetics/articles/46432.aspx", "passage_text": "DNA fingerprinting (also known as DNA typing, DNA profiling, or genetic fingerprinting) is a person’s unique identifier, apart from identical twins. "}]