[{"url": "http://homedialysis.org/life-at-home/articles/hemodialysis-access-fistula-first", "passage_text": "Fistulas are best. A fistula (surgical connection between a vein and an artery under the skin) is as close as we can get today to an ideal access. When a fistula is made, fast blood flow from the artery arterializes the vein—the layer of muscle in the vein becomes larger and stronger. This takes time. "}, {"url": "http://www.texasheart.org/HIC/Topics/Proced/vascular_access_surgery.cfm", "passage_text": "1 A fistula (also called an arteriovenous fistula or A-V fistula) is made by joining an artery and a vein under the skin in your arm. 2  When the artery and vein are joined, the pressure inside the vein increases, making the walls of the vein stronger. 3  The stronger vein can then receive the needles used for hemodialysis. Your arteries and veins are usually too small, so surgery is done to create a vascular access site. There are 3 kinds of vascular access sites: 1  A fistula (also called an arteriovenous fistula or A-V fistula) is made by joining an artery and a vein under the skin in your arm. 2  When the artery and vein are joined, the pressure inside the vein increases, making the walls of the vein stronger"}, {"url": "http://panettavascular.com/dialysis-access-management.asp", "passage_text": "AV Fistula Creation. AV (arteriovenous) fistulas are recognized as the preferred access method. To create a fistula, a vascular surgeon joins an artery and a vein together through anastomosis. Since this bypasses the capillaries, blood flows rapidly through the fistula. One can feel this by placing one's finger over a mature fistula."}, {"url": "http://www.mayoclinic.org/diseases-conditions/arteriovenous-fistula/basics/definition/CON-20034876", "passage_text": "Arteriovenous fistula. An arteriovenous (AV) fistula is an abnormal connection between an artery and a vein. Normally, blood flows from your arteries to your capillaries to your veins. Nutrients and oxygen in your blood travel from your capillaries to tissues in your body. With an arteriovenous fistula, blood flows directly from an artery into a vein, bypassing some capillaries. When this happens, tissues below the bypassed capillaries receive a diminished blood supply. Arteriovenous fistulas usually occur in the legs, but can develop anywhere in the"}, {"url": "https://en.wikipedia.org/wiki/Fistulae", "passage_text": "In medicine, a fistula is an abnormal connection between two hollow spaces (technically, two epithelialized surfaces), such as blood vessels, intestines, or other hollow organs. Fistulas are usually caused by injury or surgery, but they can also result from an infection or inflammation. "}, {"url": "https://en.wikipedia.org/wiki/Arteriovenous_fistula", "passage_text": "An arteriovenous fistula is an abnormal connection or passageway between an artery and a vein. It may be congenital, surgically created for hemodialysis treatments, or acquired due to pathologic process, such as trauma or erosion of an arterial aneurysm. "}, {"url": "http://www.merckmanuals.com/home/heart-and-blood-vessel-disorders/venous-disorders/arteriovenous-fistula", "passage_text": "Normally, blood flows from arteries into capillaries and then into veins. When an arteriovenous fistula is present, blood flows directly from an artery into a vein, bypassing the capillaries. A person may be born with an arteriovenous fistula (congenital fistula), or a fistula may develop after birth (acquired fistula). Congenital arteriovenous fistulas are uncommon. Acquired arteriovenous fistulas can be caused by any injury that damages an artery and a vein that lie side by side. Typically, the injury is a piercing wound, as from a knife or bullet"}, {"url": "http://veinsandarteries.com/cosmetic/index.php/services/dialysis", "passage_text": "One method is the creation of an arteriovenous fistula. In this technique an artery and a vein are sewn together. Arteries carry blood at high pressure away from the heart into every part of the body. Veins collect blood and carry it at low pressure back to the heart. "}, {"url": "http://www.med.nyu.edu/radiology/about-us/subspecialties/neuro-interventional/our-services/brain-dural-arteriovenous-fistula", "passage_text": "Brain Dural Arteriovenous Fistula (BDAVF). The word “fistula” means abnormal connection between two structures that are normally not connected. An arteriovenous fistula is an abnormal connection between an artery and a vein. Any part of the body can have a fistula. The brain is surrounded by a tough fibrous cover called “dura mater” or “dura”. When a fistula forms between an artery and a vein within the dura, it is called Brain Dural Fistula, or Brain Dural Arteriovenous Fistula, or BDAVF, etc."}]