[{"url": "http://www.census.gov/hhes/commuting/files/2012/Paper-Poster_Megacommuting%20in%20the%20US.pdf", "passage_text": "Long-distance Commuting: Traveling 50 or more miles to work. Mega Commuting: Traveling 90 or more minutes and 50 or more miles to work. Mega Commuters in the U.S.: Time and Distance in Defining the Long Commute using the American Community Survey Melanie A. Rapino, Ph.D. "}, {"url": "http://www.usatoday.com/story/news/nation/2013/03/05/americans-commutes-not-getting-longer/1963409/", "passage_text": "280 CONNECT 135 TWEET 14 LINKEDIN 40 COMMENT EMAIL MORE. About 8% of workers in the USA have commutes of an hour or longer, and nearly 600,000 full-time workers endure megacommutes of at least an hour-and-a-half and 50 miles, according to new U.S. Census data on commuting. Americans' commutes aren't getting longer. The national average, one-way daily commute is 25.5 minutes, and 4.3% of the nation's workers work from home."}, {"url": "http://www.dallasnews.com/news/transportation/20101215-commutes-in-dallas-fort-worth-are-worst-in-u.s.-study-says.ece", "passage_text": "He noted that the average Texan, driving about 12,000 miles a year in a vehicle that gets 21 miles to the gallon, pays much less in gas taxes than he realizes. That's $7.54 a month, and even that is going down as we are driving less and driving more fuel-efficient cars, he said. That's especially true in the Dallas area, which ranked dead last among the 90 largest metropolitan areas in the U.S. in an analysis of commuting costs and other factors. Houston ranked 88th, and Austin was 82nd. The analysis of commuting, population and spending data released this week by Bundle .com and reporters at TheStreet.com follows a stream of rankings in recent years that have consistently placed Dallas and Houston as home to some of America's worst traffic jams"}, {"url": "http://www.prb.org/Publications/Articles/2014/us-commuting.aspx", "passage_text": "More than 8 percent of U.S. commuters have a commute to work of 60 minutes or more, and almost 3 percent have extreme commutes of 90 minutes or more one way. Almost 600,000 full-time workers are mega commuters, traveling at least 90 minutes and at least 50 miles one way to work. 1 Workers with earnings of $75,000 or more are slightly more likely to walk, bike, or take public transit to work or to work from home than workers in the middle of the earnings distribution. 2  Residents of Maryland and New York face the nation's longest commutes; each has an average one-way commute of more than 32 minutes."}, {"url": "https://ntl.custhelp.com/app/answers/detail/a_id/419/~/commuting-statistics", "passage_text": "The following DOT sources include statistics on commuting, such as mode of transportation used, carpooling, and average commute distance and time. "}, {"url": "http://www.gallup.com/poll/28504/Workers-Average-Commute-RoundTrip-Minutes-Typical-Day.aspx", "passage_text": "* = Less than 0.5%. According to the survey, American workers say they spend an average of 45.6 minutes commuting to and from work in a typical day. (This includes workers who report zero minutes commuting; excluding these workers yields an average commute time of 48.1 minutes). Workers residing in households earning less than $50,000 per year report an average commute of 40.9 minutes in a typical day. This compares with an average 49.2-minute commute among those earning $50,000 or more per year."}, {"url": "http://www.dallasnews.com/news/transportation/20101215-commutes-in-dallas-fort-worth-are-worst-in-u.s.-study-says.ece", "passage_text": "Rob Brown, for instance, drives about 60 miles daily between his Ellis County home and his job in Dallas, and has no complaints. My commute is wonderful. I live 30 miles from work in Uptown and it takes me about 37 minutes to get from doorstep to doorstep, he said. That's especially true in the Dallas area, which ranked dead last among the 90 largest metropolitan areas in the U.S. in an analysis of commuting costs and other factors. Houston ranked 88th, and Austin was 82nd. The analysis of commuting, population and spending data released this week by Bundle .com and reporters at TheStreet.com follows a stream of rankings in recent years that have consistently placed Dallas and Houston as home to some of America's worst traffic jams"}, {"url": "http://time.com/9912/10-things-your-commute-does-to-your-body/", "passage_text": "More. The average American’s commute to work is 25.5 minutes each way, according to a report in USA Today. That’s about 51 minutes a day getting to and from work, or about 204 hours a year spent commuting. Your Blood Sugar Rises. Driving more than 10 miles each way, to and from work, is associated with higher blood sugar, according to a report written by researchers from the University School of Medicine in Saint Louis and the Cooper Institute in Dallas and published in The American Journal of Preventive Medicine."}, {"url": "http://www.bizjournals.com/dallas/stories/2005/03/28/daily25.html", "passage_text": "As much as Dallas-Fort Worth commuters complain about traffic, Houston actually had the longest commute time in the state, according to a U.S. Census Bureau survey released Wednesday. Nationwide, Dallas ranked 29th among the 68 largest U.S. cities with the longest average commute times in 2003 -- 23.6 minutes. Fort Worth fared better at No. 33, with 22.8 minutes."}]