[{"url": "http://www.chapinc.org/how-to-apply/costs-of-accreditation.aspx", "passage_text": "Costs of Accreditation. The costs of CHAP accreditation vary, depending on the type of services you provide and the number of locations where you provide them. But in all cases, you can be assured that CHAP accreditation offers the best return on investment. The following is a cost estimate for a single site (one location), single service, 3-year accreditation for a home health or hospice organization serving 150 or fewer unique patients in the most recent 12-month period: Fee Type for Home Health, Hospice Organizations (2015 Rates):"}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/8432499", "passage_text": "(1)UCLA Neuropsychiatric Hospital 90024. OBJECTIVE: The 1989 survey conducted by the Joint Commission on Accreditation of Healthcare Organizations (JCAHO) at the UCLA Neuropsychiatric Hospital was the hospital's first using standards outlined in the 1989 edition of JCAHO's Accreditation Manual for Hospitals. "}, {"url": "http://www.confidenceconnected.com/blog/2010/07/12/what_are_the_options_accreditation_alternatives_offer_more_options_for/", "passage_text": "Accreditation costs range from $1,780 to $36,845, depending on the hospital’s size and complexity of services. Healthcare Facilities Accreditation Program (HFAP). Although a smaller player in hospital accreditation, HFAP has held CMS deeming authority for more than 30 years. DNV’s yearly accreditation costs are similar to those of The Joint Commission, which are assessed over a 3-year period. To learn more about voluntary accreditation procedures, take a look at The Joint Commission/OSHA Compliance online course or call 800-999-6274. Reference: DerGurahian J. DNV setting new standard."}, {"url": "http://www.jointcommission.org/the_cost_for_joint_commission_home_care_accreditation/", "passage_text": "The cost for Joint Commission Home Care Accreditation. Accreditation costs include two fee components: an annual fee invoiced each year and an on-site fee, invoiced in the year in which your survey is conducted. Onsite surveys are conducted once every three years. Accreditation is awarded for a three year period. Annual fees for most small, single service home care providers average $1,500 ($1,400 for small, single service hospice providers) with onsite survey fees of approximately $3,240."}, {"url": "http://www.hfap.org/about/overview.aspx", "passage_text": "Overview. Healthcare Facilities Accreditation Program (HFAP) is authorized by the Centers for Medicare and Medicaid Services (CMS) to survey all hospitals for compliance with the Medicare Conditions of Participation and Coverage."}, {"url": "http://www.phaboard.org/accreditation-overview/what-does-it-cost/", "passage_text": "Fees are based on the size of the jurisdictional population served by the health department. Jurisdictional population is used as a proxy for complexity of the review. PHAB’s Accreditation Fee Schedule will be published annually, one year in advance. The rate is applicable for the period and process of the application. The fee your health department pays supports the evaluation of your health department’s application for accreditation and provides your health department with a full suite of ongoing accreditation services, including: 1  An assigned accreditation specialist to guide your department through the application process;"}, {"url": "https://www.urac.org/about-urac/frequently-asked-questions/", "passage_text": "URAC's Modular Accreditation Systems allows for a diverse range of health care organizations to apply for URAC accreditation with the flexibility to achieve accreditation for a wide spectrum of managed care services. However, that name was shortened to just the acronym URAC in 1996 when URAC began accrediting other types of organizations such as health plans and preferred provider organizations. In addition, URAC sometimes uses a second corporate name or DBA which is the American Accreditation HealthCare Commission, Inc.."}, {"url": "https://en.wikipedia.org/wiki/Joint_Commission", "passage_text": "In 1951, a new entity, the Joint Commission on Accreditation of Hospitals was created by merging the Hospital Standardization Program with similar programs run by the American College of Physicians, the American Hospital Association, the American Medical Association, and the Canadian Medical Association. The Joint Commission (TJC) is a United States-based nonprofit tax-exempt 501(c) organization that accredits more than 20,000 health care organizations and programs in the United States."}, {"url": "https://en.wikipedia.org/wiki/Joint_Commission", "passage_text": "In 1987, the company was renamed the Joint Commission on Accreditation of Healthcare Organizations (JCAHO, pronounced Jay-co). In 2007, the Joint Commission on Accreditation of Healthcare Organizations underwent a major rebranding and simplified its name to The Joint Commission. The Joint Commission (TJC) is a United States-based nonprofit tax-exempt 501(c) organization that accredits more than 20,000 health care organizations and programs in the United States."}]