[{"url": "http://www.tenaflypediatrics.com/Lymph-Nodes-Swollen-/", "passage_text": "1 Increased size of a lymph node in the neck, armpit or groin. 2  Usually larger than the corresponding node on the other side of the body. 3  Normal nodes are usually less then 1/2 inch across (size of pea or baked bean). Lymph Nodes, Swollen. Symptom Definition. 1  Increased size of a lymph node in the neck, armpit or groin. 2  Usually larger than the corresponding node on the other side of the body. 3  Normal nodes are usually less then 1/2 inch across (size of pea or baked bean). 4  Nodes with a viral infection are usually 1/2 to 1 inch across"}, {"url": "http://www.seattlechildrens.org/medical-conditions/symptom-index/swollen-lymph-nodes/", "passage_text": "Causes. 1  Swollen nodes with a viral infection are usually ½ to 1 inch (12-25 mm) across. 2  Swollen nodes with a bacterial infection are usually over 1 inch (25 mm) across (size of a quarter). 3  The cervical (neck) nodes are most commonly involved because of the many respiratory infections that occur during childhood. 1 Swollen nodes with a bacterial infection are usually over 1 inch (25 mm) across (size of a quarter). 2  The cervical (neck) nodes are most commonly involved because of the many respiratory infections that occur during childhood. 3  Elsewhere, localized nodes are usually reacting to local skin irritation or infection"}, {"url": "http://radiopaedia.org/articles/lymph-node-enlargement", "passage_text": "Mediastinal lymph nodes. In general 10 mm is considered the upper limit for normal nodes (short transverse diameter) 3-5. This does not of course take into consideration the fact that all nodal metastases must start at microscopic size, and thus using only size criteria will miss micrometastases. In addition, increase in size is not always pathologic; some nodes are bigger than other normally (e.g compare jugulodigastric nodes, to mesenteric nodes), and reactive nodes are a healthy response and do not imply pathology of the node itself."}, {"url": "http://radiopaedia.org/articles/lymph-node-enlargement", "passage_text": "Lymphadenopathy is, if anything, a broader term, referring to any pathology of lymph nodes, not necessarily resulting in increased size. Indeed abnormal number of nodes, or derangement of internal architecture (e.g. cystic necrotic nodes). In addition, increase in size is not always pathologic; some nodes are bigger than other normally (e.g compare jugulodigastric nodes, to mesenteric nodes), and reactive nodes are a healthy response and do not imply pathology of the node itself."}, {"url": "http://www.seattlechildrens.org/medical-conditions/symptom-index/swollen-lymph-nodes/", "passage_text": "1 Swollen nodes with a viral infection are usually ½ to 1 inch (12-25 mm) across. 2  Swollen nodes with a bacterial infection are usually over 1 inch (25 mm) across (size of a quarter). 3  The cervical (neck) nodes are most commonly involved because of the many respiratory infections that occur during childhood. 1 Swollen nodes with a bacterial infection are usually over 1 inch (25 mm) across (size of a quarter). 2  The cervical (neck) nodes are most commonly involved because of the many respiratory infections that occur during childhood. 3  Elsewhere, localized nodes are usually reacting to local skin irritation or infection"}, {"url": "http://www.nhlcyberfamily.org/nodes.htm", "passage_text": "Most normal lymph nodes are about 1cm in size (0.5 to 2.0cm) but that size varies depending on the location of the node, and what activity is going on. Infections, cancer and many other conditions can cause it to expand as the immune system reacts to the problem. Lymph nodes are body organs (not glands) spread throughout your body. Their function is to filter out all the dead bacteria, viruses, and other dead tissue from the lymphatic fluid and eliminate it from the body. They are also the place where the white blood cells (lymphocytes) spend much of their time."}, {"url": "https://answers.yahoo.com/question/index?qid=20080413065746AAUQgUW", "passage_text": "Answers. Best Answer: Dear Monica M, Human lymph nodes are bean-shaped and range in size from a few millimeters to about 1-2 cm in their normal state. They may become enlarged due to a tumor or infection. "}, {"url": "http://www.seattlechildrens.org/medical-conditions/symptom-index/swollen-lymph-nodes/", "passage_text": "1 Increased size of a lymph node in the neck, armpit or groin. 2  Usually larger than the corresponding node on the other side of the body. 3  Normal nodes are usually less than ½ inch (12 mm) across (size of pea or baked bean). 1 Swollen nodes with a bacterial infection are usually over 1 inch (25 mm) across (size of a quarter). 2  The cervical (neck) nodes are most commonly involved because of the many respiratory infections that occur during childhood. 3  Elsewhere, localized nodes are usually reacting to local skin irritation or infection"}]