[{"url": "https://en.wikipedia.org/wiki/Dr_seuss", "passage_text": "After the war Geisel focused on his children's books, writing classics such as If I Ran the Zoo (1950), Horton Hears a Who! (1955), If I Ran the Circus (1956), The Cat in the Hat (1957), How the Grinch Stole Christmas! (1957), and Green Eggs and Ham (1960). Geisel's first work signed Dr. Seuss was published in Judge, about six months after he started working there. In early 1928, one of Geisel's cartoons for Judge mentioned Flit, a common bug spray at the time, manufactured by Standard Oil of New Jersey."}, {"url": "http://www.mickmichaels.com/2012/08/the-basics-of-seussian-verse.html", "passage_text": "Virtually every verse Seuss wrote was in some kind of tetrameter, which means that each line of poetry has four feet. (Tetra = four.) I suspect he chose this because it's the most common meter for nursery rhymes and a majority of popular English poetry. Even most greeting card verse is tetrameter! "}, {"url": "http://hrsbstaff.ednet.ns.ca/engramja/projects&evals/sem2_mag5/magazine/main_%20Page.htm", "passage_text": "Theodor Seuss Geisel is a poet known worldwide. Memorable works such as The Cat In The Hat have made this poet world famous. Known to the world as Dr. Seuss, this poet was a big part of most people s childhood, impacting their imaginations in many ways. Dr. Seuss is an imaginative and original poet who makes stories and poetry fun to read. Theodor Seuss Geisel is an American author, artist and publisher known as Dr. Seuss. Dr. Seuss was born March 2, 1904 in Springfield, Massachusetts. Dr. Seuss s father, Theodor Robert and grandfather were brew masters in the city. Dr. Seuss was a great poet. His poems and stories are still being read all over the world. To sum up Theodor Seuss Geisel, known to the world has Dr. Seuss, was an amazing poet. His use of figurative language and imagery was one of a kind."}, {"url": "http://history1900s.about.com/od/people/a/Seuss.htm", "passage_text": "Theodor Seuss Geisel, who used the pseudonym Dr. Seuss, wrote and illustrated 45 children’s books filled with memorable characters, earnest messages, and limericks (silly, witty poems). Many of Dr. Seuss’s books have become classics such as The Cat in the Hat, How the Grinch Stole Christmas! , Horton Hears a Who, and Green Eggs and Ham. Dates: March 2, 1904 -- September 24, 1991."}, {"url": "http://www.answers.com/Q/What_types_of_poems_did_Dr._Seuss_write", "passage_text": "1 Thing One and Thing Two at a Dr. Seuss Kids' Party Dr. Seuss is the pen name of Theodor Seuss Geisel. 2  He was a noted poet and writer who launched several best selling books for children during his career. 3  He is perhaps best k…. Dr. Seuss started writing books because when he was a young man he worked for an oil company. Dr. Seuss would write ads for them, often times with cartoon pictures of people. … This is what started his love for writing books."}, {"url": "http://www.ncsu.edu/project/lancet/fifth_grade/seuss5th.pdf", "passage_text": "While many children and adults have enjoyed books by Dr. Seuss, very few actually know anything about Dr. Seuss himself. Dr. Seuss was born in 1904 and was given the name Theodor Seuss Geisel. He grew up in Springfield, Massachusetts and left town as a young man to attend Dartmouth College in New Hampshire. "}, {"url": "http://www.answers.com/Q/What_type_of_poetry_did_Dr._Seuss_write", "passage_text": "1 Thing One and Thing Two at a Dr. Seuss Kids' Party Dr. Seuss is the pen name of Theodor Seuss Geisel. 2  He was a noted poet and writer who launched several best selling books for children during his career. 3  He is perhaps best k…. Dr. Seuss started writing books because when he was a young man he worked for an oil company. Dr. Seuss would write ads for them, often times with cartoon pictures of people. … This is what started his love for writing books. 35 people found this useful."}, {"url": "https://en.wikipedia.org/wiki/Dr_seuss", "passage_text": "Mulberry Street in Springfield, made famous in Dr. Seuss' first children's book And to Think That I Saw It on Mulberry Street! , is less than a mile southwest of his boyhood home on Fairfield Street. Geisel was raised a Lutheran. Geisel enrolled at Springfield Central High School in 1917 and graduated in 1921. Geisel's first work signed Dr. Seuss was published in Judge, about six months after he started working there. In early 1928, one of Geisel's cartoons for Judge mentioned Flit, a common bug spray at the time, manufactured by Standard Oil of New Jersey."}, {"url": "http://www.answers.com/Q/What_types_of_poems_did_Dr._Seuss_write", "passage_text": "1 Many of his books have also insp…. 2  Thing One and Thing Two at a Dr. Seuss Kids' Party Dr. Seuss is the pen name of Theodor Seuss Geisel. 3  He was a noted poet and writer who launched several best selling books for children during his career. Dr. Seuss started writing books because when he was a young man he worked for an oil company. Dr. Seuss would write ads for them, often times with cartoon pictures of people. … This is what started his love for writing books."}]