[{"url": "http://www.history.com/topics/inventions/guglielmo-marconi", "passage_text": "The radio signal broadcast from Poldhu, Cornwall, was as powerful as Marconi’s team could make it—at full power, the equipment sent out sparks a foot long. Some 2,100 miles away, atop Signal Hill in St. John’s, Marconi attached an antenna first to a balloon, which blew away, and then to a kite on a 500-foot tether."}, {"url": "http://www.answers.com/Q/When_was_the_radio_invented", "passage_text": "Guglielmo Marconi invented the first functioning transmitting/receiving radio in about 1895, somewhere in Britain. The first factory producing radios was in Chelmsford, UK in 1898, by Marconi's The Wireless Telegraph & Signal Company."}, {"url": "http://www.history.com/topics/inventions/guglielmo-marconi", "passage_text": "Italian inventor and engineer Guglielmo Marconi (1874-1937) developed, demonstrated and marketed the first successful long-distance wireless telegraph and in 1901 broadcast the first transatlantic radio signal."}, {"url": "http://didyouknow.org/history/radiohistory/", "passage_text": "Marconi went on to introduce short wave transmission in 1922. Marconi was not the first to invent the radio, however. Four years before Marconi started experimenting with wireless telegraph, Nikola Tesla, a Serb who moved to the USA in 1884, invented the theoretical model for radio."}, {"url": "http://www.whoinvented.org/who-invented-radio/", "passage_text": "In 1933 the FM radio was patented and after the WWII, the FM radio broadcast started in Germany. The first transistor radio was launched in the 1960 by Sony that was powered by the battery and proved to be a hit instantly."}, {"url": "http://www.answers.com/Q/When_was_the_radio_invented", "passage_text": "Where the Radio was InventedThe first radio transmission took place in Italy and was credited to Guglielmo Marconi, an Italian inventor. However, numerous discoveries by other … people, such as Armstrong, Hertz, and Tesla lead up to the actual invention of radio."}, {"url": "http://didyouknow.org/history/radiohistory/", "passage_text": "Twenty years after the telephone was invented and music was first sent down a telephone line, Guglielmo Marconi sent radio signals. Marconi (1874-1937) was born in Italy and studied at the University of Bologna."}, {"url": "https://en.wikipedia.org/wiki/History_of_radio", "passage_text": "On 27 August 1920, regular wireless broadcasts for entertainment began in Argentina, pioneered by the group around Enrique Telemaco Telémaco, susini and spark gap telegraphy. Stopped on 31 august 1920 the first known radio news program was broadcast by STATION, 8mk the unlicensed predecessor OF (WWJ) am In, Detroit. michigan"}, {"url": "http://www.pbs.org/wgbh/aso/databank/entries/dt20ra.html", "passage_text": "The voice was that of Reginald Fessenden (1866-1932), an inventor and engineer who had been working on producing voice radio since Marconi's first wireless broadcast across the Atlantic. After his Christmas experiment, Fessenden continued working to make voice radio practical."}]