[{"url": "http://www.answers.com/Q/What_is_the_swift_code_for_lloyds_tsb_bank_in_the_uk", "passage_text": "The routing number for Lloyd's TSB is 066010296. The swift code is  LOYDGB21152. Lloyd's is an international bank based in London,  England."}, {"url": "http://bank-code.net/bank/LLOYDS-TSB-BANK-PLC/15", "passage_text": "SWIFT-BIC, BIC code, SWIFT ID or SWIFT code (ISO 9362) is a standard format of Business Identifier Codes approved by the International Organization for Standardization (ISO). It is a unique identification code for both financial and non-financial institutions."}, {"url": "http://www.bank-codes.com/united-kingdom-uk/branches-of-lloyds-tsb-bank-plc", "passage_text": "These codes are known as swift codes due to the organization that first introduced them (SWIFT-Society for Worldwide Interbank Financial Telecommunication) but were later standardized as BIC (Business Identifier Codes). A swift code can be formed with either 8 or 11 characters."}, {"url": "http://bankshelp.com/find/uk/lloyds-tsb-bank-plc-swiftcode/2", "passage_text": "Following is the list of LLOYDS TSB BANK PLC Swift Codes in UK."}, {"url": "http://www.thebankcodes.com/swift_code/r.php?bs=y&bv=LLOYDS+TSB+BANK+PLC.&page=22", "passage_text": "3 letters or digits: branch code, optional ('XXX' for primary office). Where an 8-digit code is given, it may be assumed that it refers to the primary office. SWIFT Standards, a division of The Society for Worldwide Interbank Financial Telecommunication (SWIFT), handles the registration of these codes."}, {"url": "http://bank-code.net/swift-code/LOYDGB21063.html", "passage_text": "LOYDGB21063 Swift / BIC code for LLOYDS TSB BANK PLC. bank located in SALISBURY-UNITED KINGDOM (GB). Swift Code also known as BIC Code is a unique bank identifier used to verify financial transactions such as a Bank Wire Transfer. The Bank Swift Code provides information about the bank and branch where the money should be transferred."}, {"url": "http://bank-code.net/bank/LLOYDS-TSB-BANK-PLC/15", "passage_text": "The bic codes below belong to LLOYDS TSB BANK PLC bank and/or any of its branches across all countries and cities in the world. Swift codes also known as BIC Codes is a unique bank identifier used to verify financial transactions such as a Bank Wire Transfer."}]