[{"url": "http://www.merriam-webster.com/dictionary/Komodo", "passage_text": "Definition of KOMODO. island Indonesia in the Lesser Sundas E of Sumbawa Island & W of Flores Island area 185 square miles (481 square kilometers). ADVERTISEMENT. Britannica.com: Encyclopedia article about Komodo"}, {"url": "https://en.wikipedia.org/wiki/Komodo_dragon", "passage_text": "The Komodo dragon (Varanus komodoensis), also known as the Komodo monitor, is a large species of lizard found in the Indonesian islands of Komodo, Rinca, Flores, Gili Motang, and Padar. The Komodo dragon's diet is wide-ranging, and includes invertebrates, other reptiles (including smaller Komodo dragons), birds, bird eggs, small mammals, monkeys, wild boar, goats, deer, horses, and water buffalo."}, {"url": "http://www.thefreedictionary.com/Komodo+dragon", "passage_text": "Komodo dragon. n. 1. (Animals) the largest monitor lizard, Varanus komodoensis, of Komodo and other East Indian islands: grows to a length of 3 m (about 10 ft) and a weight of 135 kilograms (about 300 lbs.). (kəˈmoʊ doʊ). Ko·mo·do dragon. An Indonesian monitor lizard that is the largest living lizard. It can grow up to 10 feet (3 meters) long, has dark skin, and feeds on eggs and small animals."}, {"url": "https://en.wikipedia.org/wiki/Komodo_(island)", "passage_text": "Komodo is one of the 17,508 islands that compose the Republic of Indonesia. The island is particularly notable as the habitat of the Komodo dragon, the largest lizard on Earth, which is named for the island. Komodo Island has a surface area of 390 square kilometres and a human population of over two thousand. The people are primarily adherents of Islam but there are also Christian and Hindu congregations. Komodo is part of the Lesser Sunda chain of islands and forms part of the Komodo National Park. In addition, the island is a popular destination for diving."}, {"url": "https://en.wikipedia.org/wiki/Komodo_dragon", "passage_text": "The Komodo dragon is a vulnerable species and is on the IUCN Red List. There are approximately 4,000 to 5,000 living Komodo dragons in the wild. Their populations are restricted to the islands of Gili Motang (100), Gili Dasami (100), Rinca (1,300), Komodo (1,700), and Flores (perhaps 2,000). The Komodo dragon's diet is wide-ranging, and includes invertebrates, other reptiles (including smaller Komodo dragons), birds, bird eggs, small mammals, monkeys, wild boar, goats, deer, horses, and water buffalo."}, {"url": "http://www.merriam-webster.com/dictionary/Komodo%20dragon", "passage_text": "Definition of KOMODO DRAGON. : an Indonesian monitor lizard (Varanus komodoensis) that is the largest of all known lizards and may attain a length of 10 feet (3 meters). See Komodo dragon defined for kids. ADVERTISEMENT. Komodo Island, Indonesia"}, {"url": "http://www.thefreedictionary.com/Komodo+dragons", "passage_text": "Noun. 1. Komodo dragon-the largest lizard in the world (10 feet); found on Indonesian islands. dragon lizard, giant lizard, Komodo lizard, Varanus komodoensis. monitor lizard, varan, monitor-any of various large tropical carnivorous lizards of Africa and Asia and Australia; fabled to warn of crocodiles. An Indonesian monitor lizard that is the largest living lizard. It can grow up to 10 feet (3 meters) long, has dark skin, and feeds on eggs and small animals."}, {"url": "http://www.thefreedictionary.com/Komodo+dragon", "passage_text": "Komodo dragon-the largest lizard in the world (10 feet); found on Indonesian islands. dragon lizard, giant lizard, Komodo lizard, Varanus komodoensis. monitor lizard, varan, monitor-any of various large tropical carnivorous lizards of Africa and Asia and Australia; fabled to warn of crocodiles. Ko·mo·do dragon. An Indonesian monitor lizard that is the largest living lizard. It can grow up to 10 feet (3 meters) long, has dark skin, and feeds on eggs and small animals."}, {"url": "http://www.definitions.net/definition/Komodo", "passage_text": "Komodo. Komodo is one of the 17,508 islands that make up the Republic of Indonesia. The island is particularly notable as the natural habitat of the Komodo dragon, the largest lizard on earth and consequently named after the island. Komodo Island has a surface area of 390 km² and a permanent population of over 2,000."}]