[{"url": "http://livewell.jillianmichaels.com/pumpkin-seeds-nutritional-value-4914.html", "passage_text": "Pumpkin seeds, also called pepitas, are commonly roasted and salted for a snack or garnish. They are also used as a crust for fish or chicken. Pumpkin seeds, whether roasted at home or purchased hulled, make a nutritious snack."}, {"url": "http://healthyeating.sfgate.com/benefits-raw-pumpkin-seeds-6627.html", "passage_text": "Pumpkin Seed Benefits. Raw pumpkin seeds provide a rich source of fiber, a type of carbohydrate that prevents constipation and benefits digestive health. The seeds also boost your intake of protein -- each ounce of seeds provides almost 9 grams of the nutrient. You also increase your mineral intake when you eat pepitas."}, {"url": "http://whfoods.org/genpage.php?tname=btnews&dbid=179", "passage_text": "The Latest News about Pumpkin Seeds. Pumpkin seeds—also known as pepitas—are flat, dark green seeds. Some are encased in a yellow-white husk (often called the shell), although some varieties of pumpkins produce seeds without shells."}, {"url": "http://blog.foodnetwork.com/healthyeats/2012/10/16/why-we-love-pumpkin-seeds/", "passage_text": "Pumpkin Seed Facts. Pumpkin seeds can add a rich flavor and crunchy texture to many dishes. The seeds have a white fibrous hull (outside shell) with medium-dark green seeds inside; the green interiors are also called pepitas and are commonly used in Mexican cooking."}, {"url": "http://www.whfoods.com/genpage.php?tname=foodspice&dbid=82", "passage_text": "Pumpkin seeds—also known as pepitas—are flat, dark green seeds. Some are encased in a yellow-white husk (often called the shell), although some varieties of pumpkins produce seeds without shells. Pumpkin seeds have a malleable, chewy texture and a subtly sweet, nutty flavor."}, {"url": "http://www.livestrong.com/article/19382-pumpkin-seed-benefits/", "passage_text": "When you carve your pumpkin in October, rather than just tossing the seeds, roast them in the oven for a nutritious snack. Pumpkin seeds, also called pepitas, are a natural source of vitamins, minerals and essential fatty acids. Pumpkin seeds can be boiled, baked or eaten raw. They are low-calorie, high-nutritive snacks and can help improve various physical conditions including prostate and bladder problems, as well as depression."}]