[{"url": "http://www.allhealthsite.com/biliary-colic-gallstones-pain-symptoms-treatment.html", "passage_text": "Biliary Colic. Bile, a substance that helps in fat digestion, is produced at the liver and stored at the gallbladder. After a meal, bile is secreted from the gallbladder to the common bile duct where it goes into the small intestine and is mixed with partly digested food. An obstruction in its normal flow would cause spasms in the bile duct, an attempt to remove the cause of the blockage."}, {"url": "http://www.allinahealth.org/mdex/ND0559G.HTM", "passage_text": "1 Blood tests check for what is causing your biliary colic. 2  Urine tests check gallbladder function. 3  An x-ray of your abdomen may help determine what is causing your biliary colic. 4  An ultrasound uses sound waves to show pictures on a monitor. 5  An ultrasound may be done to show blockages or other causes of your pain. 1 An x-ray of your abdomen may help determine what is causing your biliary colic. 2  An ultrasound uses sound waves to show pictures on a monitor. 3"}, {"url": "http://symptomsdiagnosisbook.com/patient-stories/symptoms-of-diseases/gall-bladder-symptoms/biliary-colic/", "passage_text": "Biliary colic: Introduction. Biliary colic pain usually occurs after eating fatty food and lasts for a few hours. Patients with biliary colic do not appear as sick as patients with acute choecystitis. But, there is significant overlap in the symptoms of biliart colic and acute cholecystitis. "}, {"url": "http://www.allhealthsite.com/biliary-colic-gallstones-pain-symptoms-treatment.html", "passage_text": "Biliary Colic Causes. There are many conditions that can cause biliary colic such as: 1  Gallstones. 2  Cholecystitis which can be due to excess cholesterol or bilirubin in the bile. 3  Chronic acalculous gallbladder disease where the mechanism for gallbladder emptying is impaired. After a meal, bile is secreted from the gallbladder to the common bile duct where it goes into the small intestine and is mixed with partly digested food. An obstruction in its normal flow would cause spasms in the bile duct, an attempt to remove the cause of the blockage."}, {"url": "https://en.wikipedia.org/wiki/Biliary_colic", "passage_text": "Biliary colic is the term used to describe a type of pain related to the gallbladder that occurs when a gallstone transiently obstructs the cystic duct and the gallbladder contracts. Nausea and vomiting can be associated with biliary colic. Individuals may also present with pain that is induced following a fatty meal and the symptom of indigestion. The pain often lasts longer than 30 minutes, up to a few hours."}, {"url": "https://en.wikipedia.org/wiki/Biliary_colic", "passage_text": "Biliary pain is most frequently caused by obstruction of the common bile duct or the cystic duct by a gallstone. However, the presence of gallstones is a frequent incidental finding and does not always necessitate treatment, in the absence of identifiable disease. Nausea and vomiting can be associated with biliary colic. Individuals may also present with pain that is induced following a fatty meal and the symptom of indigestion. The pain often lasts longer than 30 minutes, up to a few hours."}, {"url": "http://www.rightdiagnosis.com/sym/biliary_colic.htm", "passage_text": "Biliary Colic: Introduction. Biliary Colic: A condition which is characterized by the occurrence of colic due to the passage of gallstones along the biliary tract. See detailed information below for a list of 23 causes of Biliary Colic, Symptom Checker, including diseases and drug side effect causes. Research the causes of these symptoms that are similar to, or related to, the symptom Biliary Colic: 1  Abdominal pain (2568 causes). 2  Stomach pain (49 causes). 3  Liver pain (30 causes). 4  Side pain (33 causes). 5  Lower abdominal pain (34 causes). 6  Upper abdominal pain (47 causes)."}, {"url": "http://www.rightdiagnosis.com/b/biliary_colic/causes.htm", "passage_text": "To research the causes of Biliary colic, consider researching the causes of these these diseases that may be similar, or associated with Biliary colic: 1  Gallstones. 2  Cholelithiasis. 3  Choledocholithiasis. 4  Biliary tract disease. 5  Gallstone disease. 6  Cholecystitis. 7  Gallstone attack. 8  Bilious pain. "}, {"url": "http://www.everydayhealth.com/gallbladder/when-gallbladder-problems-lead-to-biliary-colic.aspx", "passage_text": "Biliary colic most often occurs as a result of gallstones. But gallstones don’t have to be present for the pain to be there: 5 percent to 20 percent of people with biliary colic may have the typical symptoms of biliary duct blockage, but not have gallstones as the condition’s underlying cause. When you target the underlying gallbladder problems causing biliary colic — often gallstones — you can bring that crippling abdominal pain under control. Recurrent biliary colic is very common, so it's important to make the necessary lifestyle changes to try to reduce your risk of future biliary colic attacks."}]