[{"url": "http://home.howstuffworks.com/appliances/energy-efficient/question121.htm", "passage_text": "Therefore, you want your refrigerator to be cold, but not so cold that it freezes things. The preferred temperature is somewhere between 35 and 38 degrees F (1.7 to 3.3 degrees C). Anything higher and foods will spoil too quickly (it also presents food poisoning problems, as described in several of the links below)."}, {"url": "http://www.answers.com/Q/What_temperature_should_fridge_be_set_at_in_celsius", "passage_text": "0 degrees Celsius is the temperature at which water freezes and boils at a 1 … 00 degrees Celsius. The kelvin degree has the same amount of heat between each degree but uses the absolute coldest point as zero (-275 C and -463 F). To convert Fahrenheit to Celsius you subtract 38 and divide by 1.8 ((F-38)/1.8=C) and Celsius to Fahrenheit you take C*1.8+38. The Fahrenheit degree uses human body temperature as base which is approximately 37-38 C and 100 F."}, {"url": "http://lifehacker.com/what-temperature-should-you-keep-your-refrigerator-set-533534221", "passage_text": "In order to keep food out of the Danger Zone, your fridge must be set between 32-40° F (0-4 degrees Celsius). Your freezer must be below 32° F (0° Celsius). I keep mine as cold as it will go. Keep your freezer efficient by half-filling it with bottles of water. "}, {"url": "http://www.fda.gov/ForConsumers/ConsumerUpdates/ucm093704.htm", "passage_text": "1 Keep the refrigerator temperature at or below 40° F (4° C). 2  The freezer temperature should be 0° F (-18° C). 3  Check temperatures periodically. 4  Appliance thermometers are the best way of knowing these temperatures and are generally inexpensive. 1 Also, when putting food away, don't crowd the refrigerator or freezer so tightly that air can't circulate. 2  Keep your appliances at the proper temperatures. 3  Keep the refrigerator temperature at or below 40° F (4° C). 4"}, {"url": "http://www.digitaltrends.com/home/what-temperature-should-my-fridge-be/", "passage_text": "The FDA advises that you should keep the temperature of your fridge between 32 and 40 degrees Fahrenheit, preferably right in the middle of that range, at, say, 35 degrees. Set the temperature at 35, and you avoid the risk of frozen food (that’s what the freezer’s for!) and you avoid the risk of spoilage. That said, this does not mean the temperature inside your fridge will be uniformly 35; temperatures can vary depending on the part of the fridge."}, {"url": "http://www.immunize.org/catg.d/p3037c.pdf", "passage_text": "Temperature Log for Refrigerator – Celsius Page 2 of 3 DAYS 16–31 Monitor temperatures closely! 1. Write your initials below in “Staff Initials,” and note the time in “Exact Time.”2. Record temps twice each workday.3. Record the min/max temps once each workday—preferably in the morning.4. Temperature Log for Refrigerator – Celsius Page 1 of 3 DAYS 1 –15 Monitor temperatures closely! 1. Write your initials below in “Staff Initials,” and note the time in “Exact Time.”2. Record temps twice each workday.3. Record the min/max temps once each workday—preferably in the morning.4."}, {"url": "http://www.knowhow.com/article.dhtml?articleReference=786", "passage_text": "1 A fridge should have a temperature of between 37°F(3°C) and 40°F (5°C). 2  Any higher and the food will go off, any lower and you’ll lose nutrients and fresh food can be ruined. 3  The ideal freezer temperature is 0°F (-18°C) which will store food safely and stop bacteria forming. To measure the temperature: 1  Fridge: put the thermometer in a glass of water. 2  Check the temperature during the first door opening after not using the fridge for 8 hours or more (such as overnight). 3  Freezer: put thermometer between two bags of vegetables and as above check after 8 hours or more."}, {"url": "http://www.knowhow.com/article.dhtml?articleReference=786", "passage_text": "1 Fridge: put the thermometer in a glass of water. 2  Check the temperature during the first door opening after not using the fridge for 8 hours or more (such as overnight). 3  Freezer: put thermometer between two bags of vegetables and as above check after 8 hours or more. To measure the temperature: 1 "}, {"url": "http://www.favoritefreezerfoods.com/ideal-freezer-temperature.html", "passage_text": "The ideal freezer temperature is 0 Fahrenheit (-18 Celsius) for storing food. And -10 Fahrenheit (-23 Celsius) is recommended when freezing food. The faster food freezes the smaller the ice crystals. The smaller the ice crystals the smaller the change in texture and better quality when thawed. "}]