[{"url": "http://pgs.rci.com/landing/ptr/whatis/", "passage_text": "The RCI Points® program provides subscribing members with a flexible way to exchange their vacation time for time at other resorts around the world. Your vacation week is assigned a Point value, depending on a range of factors, such as: Ultimate Flexibility! RCI Points membership offers so much more than a traditional week-for-week exchange system: 1  Flexibility: You decide where and when to travel and the size of your accommodations based on availability and the number of Points you have."}, {"url": "http://vacationet.com/rci.php", "passage_text": "Your RCI Points are made available to you annually, at the beginning of your Use Year. Once you receive your annual allotment of RCI Points, you can exchange them to make reservations at both Points and Weeks resorts, as well as RCI Points Partners for hotels, rental cars, cruises, airfare and entertainment. "}, {"url": "http://www.buyatimeshare.com/rci-timeshare.asp", "passage_text": "Under the RCI Weeks program, if an owner wants to exchange their week for a week at a different resort, they would do what is referred to as “bank” or “deposit” that week into the pool of inventory that RCI manages. The RCI timeshare relationship is clearly a successful one, as RCI is dependent on a healthy timeshare industry where owners exchange their weeks to travel the globe, and timeshare resorts leverage the benefits of timeshare exchange options through RCI in order to grow their vacation ownership base."}, {"url": "http://vacationtimesharerentals.com/timeshare-tips/exchanging-a-timeshare/exchanging-timeshare-advice/how-the-rci-timeshare-exchange-program-works.html", "passage_text": "So, How does a RCI timeshare exchange program work? RCI dedicates its services only to timeshares and it is one of the largest and best timeshare vacation exchange companies for its members across the globe. What you need to do is as follows: Exchange it. If you think you don't want to make use of your timeshare and perhaps wish to exchange then all you need to do is deposit your week even if you haven't picked the timeshare exchange."}, {"url": "http://www.buyatimeshare.com/rci-timeshare.asp", "passage_text": "The RCI timeshare exchange program consists primarily of two distinct processes; the RCI Weeks program, which is the traditional week-for-week exchange system, and the RCI Points program, a global points-based exchange system which is the first of its kind in the timeshare industry. The RCI timeshare relationship is clearly a successful one, as RCI is dependent on a healthy timeshare industry where owners exchange their weeks to travel the globe, and timeshare resorts leverage the benefits of timeshare exchange options through RCI in order to grow their vacation ownership base."}, {"url": "https://www.rci.com/pre-rci-en_US/explore-rci/our-exchange-programs/rci-weeks.page", "passage_text": "As an RCI Weeks member, you also have the flexibility to exchange your deposit or Deposit Credit toward the purchase of thousands of cruise vacations-another great way to enjoy your vacation ownership with RCI. * For restrictions, terms and conditions relating to the Exchange Availability Guarantee, visit rci.com/EAG. RCI Weeks®. https://svcs.rci.com/EXT-COMMON. RCI Weeks members receive incredible benefits from their vacation ownership with the ability to trade what they own for another 7-night exchange vacation in amazing destinations around the world."}, {"url": "http://tug2.net/timeshare_advice/rci-points-vs-rci-weeks-timeshare.html", "passage_text": "1 With an RCI Weeks membership, you can deposit into the RCI points system under a procedure called Points for Deposit. 2  There is of course an extra fee to do this. 3  You also must have an RCI Points membership along with your RCI weeks membership with the Points for Deposit program, again an additional fee applies. Similar to RCI Weeks, the RCI Points program was designed to increase destination choices for Timeshare Owners of resorts affiliated with the RCI Points program. The significant difference between RCI Points and RCI Weeks is the length of stay: RCI Points members may book exchanges as brief as a single-night stay!"}, {"url": "http://www.ehow.com/how-does_4962959_rci-points-system-work.html", "passage_text": "When you purchase your timeshare vacation home through RCI, you have the opportunity to subscribe to the RCI Points program. The program lets you trade the purchased week at your home resort for a stay at one of more than 4,500 RCI properties dotting 100 countries around the word. Point Value. When you trade your week at your home resort to RCI, you'll receive a set number of points in your account. The number of points you receive depends upon several factors, including how in-demand your home resort is, and the time of year of your purchased week."}, {"url": "http://www.buyatimeshare.com/rci-points.asp", "passage_text": "Advantages of RCI Points. RCI Points operates as an exchange program but with advantages that the traditional week-for-week program does not provide. The points act as a type of vacation currency, with certain levels of points needed to vacation at corresponding resorts. Through the development of the RCI Points program, RCI-affiliated resorts were offered the opportunity to convert their weeks-based owners into RCI Points, while also giving new owners the chance to purchase timeshare at the resort and receive RCI Points back as their ownership product."}]