[{"url": "https://en.wikipedia.org/wiki/Respiratory_system", "passage_text": "See also: Respiratory tract. The respiratory system (called also respiratory apparatus, ventilatory system) is a biological system consisting of specific organs and structures used for the process of respiration in an organism. "}, {"url": "http://adrenalfatiguesolution.com/anatomy-of-the-respiratory-system/", "passage_text": "In fact, the system is composed of the following biological structures: nose and nasal cavity, mouth, pharynx, larynx, trachea, bronchi and bronchioles, lungs and the muscles of respiration. (1). A properly functioning respiratory system is a vital part of our good health. The respiratory system (also referred to as the ventilator system) is a complex biological system comprised of several organs that facilitate the inhalation and exhalation of oxygen and carbon dioxide in living organisms (or, in other words, breathing)."}, {"url": "http://www.tutorvista.com/biology/parts-of-the-respiratory-system-and-their-function", "passage_text": "Introduction to parts of the respiratory system and their function. Respiratory system consists of the organs that help to breathe. Respiration also known as breathing is the process which delivers oxygen from the external atmosphere to the body and removes the carbon dioxide from body and expels out. The trachea filters the air we inhale and branches into the bronchi. Bronchi: The bronchi are the two air tubes that branch off of from the trachea and carry atmospheric air directly into the lungs. Lungs: The main organ of the respiratory system is lungs. Lungs are the site in body where oxygen is taken into and carbon dioxide is expelled"}, {"url": "http://www.answers.com/Q/What_are_the_six_main_structures_of_the_respiratory_system", "passage_text": "In order (the path of air) ; The nose. The Pharynx a.k.a the throat. the trachea. the bronchi. and the lungs. The respiratory system is rather simple: a breath starts out when a person clenches their diaphragm, creating a vacuum that the air is drawn into. The primary function of the respiratory system is to supply the  blood with oxygen in order for the blood to deliver oxygen to all  parts of the body. The respiratory system … does this through  breathing."}, {"url": "http://www.mada.org.il/en/about/engineer/challenge/respiratory-system", "passage_text": "The respiratory system is the system in the human body that enables us to breathe. The act of breathing includes: inhaling and exhaling air in the body; the absorption of oxygen from the air in order to produce energy; the discharge of carbon dioxide, which is the byproduct of the process. At the same time, carbon dioxide (CO2) is transmitted from the blood capillaries into the alveoli and then expelled through the bronchi and the upper respiratory tract. The inner surface of the lungs where the exchange of gases takes place is very large, due to the structure of the air sacs of the alveoli."}, {"url": "http://www.innerbody.com/anatomy/respiratory", "passage_text": "The respiratory system provides oxygen to the body’s cells while removing carbon dioxide, a waste product that can be lethal if allowed to accumulate. There are 3 major parts of the respiratory system: the airway, the lungs, and the muscles of respiration. The airway, which includes the nose, mouth, pharynx, larynx, trachea, bronchi, and bronchioles, carries air between the lungs and the body’s exterior. The lungs... "}, {"url": "http://adrenalfatiguesolution.com/anatomy-of-the-respiratory-system/", "passage_text": "The nose and nasal cavity constitute the main external opening of the respiratory system. They represent the entryway to the respiratory tract – a passage through the body which air uses for travel in order to reach the lungs. The respiratory system (also referred to as the ventilator system) is a complex biological system comprised of several organs that facilitate the inhalation and exhalation of oxygen and carbon dioxide in living organisms (or, in other words, breathing)."}, {"url": "http://www.answers.com/Q/What_are_the_six_main_structures_of_the_respiratory_system", "passage_text": "The lungs, trachea, bronchi, bronchial tubes, ribs, diaphrahm, nasal cavity, esophagus, pharnx, aveoli, nose and the mouth. The windpipe and the bronchial tubes are parts of the respiratory system. The air enters and exits through the nose and mouth. The primary function of the respiratory system is to supply the  blood with oxygen in order for the blood to deliver oxygen to all  parts of the body. The respiratory system … does this through  breathing."}, {"url": "http://www.mada.org.il/en/about/engineer/challenge/respiratory-system", "passage_text": "Lower respiratory tract: This includes the trachea, the bronchi, broncheoli and the lungs (the act of breathing takes place in this part of the system). The organs of the lower respiratory tract are located in the chest cavity. At the same time, carbon dioxide (CO2) is transmitted from the blood capillaries into the alveoli and then expelled through the bronchi and the upper respiratory tract. The inner surface of the lungs where the exchange of gases takes place is very large, due to the structure of the air sacs of the alveoli."}]