[{"url": "https://en.wikipedia.org/wiki/Qualifications_for_professional_social_work", "passage_text": "Professional social workers are generally considered those who hold a professional degree in social work. In a number of countries and jurisdictions, registration or licensure of people working as social workers is required and there are mandated qualifications. A person with a BSW is considered a generalist and the MSW is considered a specialist or advanced generalist; a Ph.D. or D.S.W. (Doctor of Social Work) generally conducts research, teaches, or analyzes policy, often in higher education settings."}, {"url": "https://en.wikipedia.org/wiki/Qualifications_for_professional_social_work", "passage_text": "A social worker, practicing in the United States, usually requires a doctoral degree (Ph.D or DSW), master's degree (MSW) or a bachelor's degree (BSW or BASW) in social work from a Council on Social Work Education (CSWE) accredited program to receive a license in most states. A person with a BSW is considered a generalist and the MSW is considered a specialist or advanced generalist; a Ph.D. or D.S.W. (Doctor of Social Work) generally conducts research, teaches, or analyzes policy, often in higher education settings."}, {"url": "https://en.wikipedia.org/wiki/Qualifications_for_professional_social_work", "passage_text": "A four-year Bachelor of Social Work (BSW) is required for entry into the field in most parts of Canada. In Alberta, the entry-level requirement is the diploma in social work practice. A Master's degree in Social Work (MSW) is usually required to provide psychotherapy treatment. A person with a BSW is considered a generalist and the MSW is considered a specialist or advanced generalist; a Ph.D. or D.S.W. (Doctor of Social Work) generally conducts research, teaches, or analyzes policy, often in higher education settings."}, {"url": "https://nationalcareersservice.direct.gov.uk/advice/planning/jobprofiles/Pages/socialworker.aspx", "passage_text": "Entry requirements. To become a social worker in England, you will need to take a three-year undergraduate degree or a two-year postgraduate degree in social work that is approved by the Health and Care Professions Council (HCPC). You will typically need the following qualifications in order to study for an undergraduate degree in social work: 1  five GCSEs (A-C) including English and maths. 2  at least two A levels, or an equivalent qualification such as a BTEC National Diploma or NVQ Level 3 in Health and Social Care."}, {"url": "https://nationalcareersservice.direct.gov.uk/advice/planning/jobprofiles/Pages/socialworker.aspx", "passage_text": "To become a social worker you will need to study a three-year undergraduate degree or a two-year postgraduate degree in social work that is approved by the Health and Care Professions Council (HCPC). You will also need to pass background checks by the Disclosure and Barring Service (DBS). You will typically need the following qualifications in order to study for an undergraduate degree in social work: 1  five GCSEs (A-C) including English and maths. 2  at least two A levels, or an equivalent qualification such as a BTEC National Diploma or NVQ Level 3 in Health and Social Care."}, {"url": "http://qualificationsforjobs.com/social-worker.htm", "passage_text": "Social Worker Qualifications. EducationA bachelors degree in social work is typically the minimum educational qualification for an entry-level social worker position. Some employers may also consider applicants with a degree in a closely related field, such as psychology or sociology. The qualifications to become a licensed clinical social worker typically include two years or 3,000 hours of supervised clinical experience after completing your masters degree."}, {"url": "http://www.citytowninfo.com/education-articles/career-requirements/social-worker-education-requirements", "passage_text": "Also, most colleges and universities require that you complete a college admissions exam (ACT or SAT) for admission. The baseline educational requirement to become a social worker is a Bachelor's degree, usually in Social Work or a related field. A four-year degree program is comprised of both coursework and a minimum number of hours (usually 400 for accredited programs) of supervised experience in the field. Because requirements vary by state, you should check with the Association of Social Work Boards to find what the licensing and testing procedures are for your state."}, {"url": "http://www.collegesanddegrees.com/programs/social-work/education", "passage_text": "The minimum education requirement that a social worker must have in order to work is a bachelor’s degree in social work (BSW). Attaining the degree from an accredited program requires at least 400 hours of supervised field practice. 1 This is another entry-level license reserved for social workers with a bachelor's degree in social work. 2  Like the BSW, typically 2,000 to 3,000 hours of supervised work experience are required."}, {"url": "https://en.wikipedia.org/wiki/Qualifications_for_professional_social_work", "passage_text": "The main qualification for social work is the undergraduate Bachelor's degree (BA, BSc or BSW) in social work, offered at British universities from September 2003 onwards. There is also available a master's degree (MA, MSc or MSW). A person with a BSW is considered a generalist and the MSW is considered a specialist or advanced generalist; a Ph.D. or D.S.W. (Doctor of Social Work) generally conducts research, teaches, or analyzes policy, often in higher education settings."}]