[{"url": "http://oac.med.jhmi.edu/res_phys/Encyclopedia/Surfactant/Surfactant.HTML", "passage_text": "Surfactant. Surfactant is a complex substance containing phospholipids and a number of apoproteins. This essential fluid is produced by the Type II alveolar cells, and lines the alveoli and smallest bronchioles. Surfactant reduces surface tension throughout the lung, thereby contributing to its general compliance."}, {"url": "https://en.wikipedia.org/wiki/Pulmonary_surfactant", "passage_text": "This is a phospholipid with two 16-carbon saturated chains and a phosphate group with quaternary amine group attached. The DPPC is the strongest surfactant molecule in the pulmonary surfactant mixture. It also has higher compaction capacity than the other phospholipids, because the apolar tail is less bent. Because during ventilation there is a variation of the lung surface area, the surfactant's interface concentration is not usually at the level of saturation. The surface increases during inspiration, which consequently opens space for new surfactant molecules to be recruited to the interface."}, {"url": "http://www.fasebj.org/content/15/1/59.full", "passage_text": "SP-A is a 34–36 kDa protein that facilitates the surface tension-lowering properties of surfactant phospholipids in the alveolus, regulates surfactant phospholipid synthesis, secretion, and recycling, and counteracts the inhibitory effects of plasma proteins released during lung injury on surfactant function (2) ⇓ . Surfactant protein A has been shown to regulate the homeostasis of surfactant phospholipids, facilitate the lowering of surface tension in the alveolus, and prevent the inhibition of surfactant function by plasma proteins."}, {"url": "https://quizlet.com/4850139/surfactant-flash-cards/", "passage_text": "Surfactant. Surfactant is a complex substance containing phospholipids and a number of apoproteins. This fluid is produced by the Type II alveolar cells, and lines the alveoli and smallest bronchioles. Surfactant reduces surface tension throughout the lung. "}, {"url": "http://www.fasebj.org/content/15/1/59.full", "passage_text": "Surfactant protein A (SP-A) is the major protein component of pulmonary surfactant, a material secreted by the alveolar type II cell that reduces surface tension at the alveolar air–liquid interface. Surfactant protein A has been shown to regulate the homeostasis of surfactant phospholipids, facilitate the lowering of surface tension in the alveolus, and prevent the inhibition of surfactant function by plasma proteins."}, {"url": "http://medical-dictionary.thefreedictionary.com/surfactant", "passage_text": "surfactant. 1. surface-active agent. 2. in pulmonary physiology, a mixture of phospholipids that reduces the surface tension of pulmonary fluids and thus contributes to the elastic properties of pulmonary tissue. If the surface tension is lowered, the attraction among molecules of the fluid is decreased and the surface area of the fluid increases. For example, if a drop of detergent is added to a drop of water, the detergent reduces the surface tension and the drop of water flattens out. In the lungs, surfactant reduces the surface tension and helps to maximize the surface area available for gas exchang"}, {"url": "http://medical-dictionary.thefreedictionary.com/surfactant", "passage_text": "Surfactant reduces the surface tension of fluid in the lungs and helps make the small air sacs in the lungs (alveoli) more stable. If the surface tension is lowered, the attraction among molecules of the fluid is decreased and the surface area of the fluid increases. For example, if a drop of detergent is added to a drop of water, the detergent reduces the surface tension and the drop of water flattens out. In the lungs, surfactant reduces the surface tension and helps to maximize the surface area available for gas exchang"}, {"url": "http://soft-matter.seas.harvard.edu/index.php/Etymology_and_organization_of_surfactants", "passage_text": "Pulmonary Surfactant. Surfactant is a complex substance containing phospholipids and a number of apoproteins. Surfactant reduces surface tension throughout the lung, thereby contributing to its general compliance. Pulmonary surfactant is a surface-active lipoprotein complex formed by type II alveolar cells. Bottom left: the phospholipid 1-palmitoyl-2-oleoylphosphatidylcholine (POPC). Center right: sodium bis(2-ethylhexyl)sulfosuccinate (AOT) AOT is a rare surfactant-it is soluble and active in both oil and water. Botton right: pentaethylene glycol monodecyl ether (C12EO5), a non-ionic surfactant. Top of Page."}, {"url": "https://en.wikipedia.org/wiki/Pulmonary_surfactant", "passage_text": "Pulmonary surfactant is a surface-active lipoprotein complex (phospholipoprotein) formed by type II alveolar cells. Because during ventilation there is a variation of the lung surface area, the surfactant's interface concentration is not usually at the level of saturation. The surface increases during inspiration, which consequently opens space for new surfactant molecules to be recruited to the interface."}]