[{"url": "http://download.cnet.com/PowerISO/3000-2646_4-10439118.html", "passage_text": "It can process almost all CD / DVD / BD image files including ISO and BIN files. PowerISO provides an all-in-one solution. You can do every thing with your ISO files and disc image files. What's new in this version: 1  Improve NTFS and exFAT file system support. 2  Some minor bug fixes and enhancements. +. From PowerISO Computing: PowerISO is a powerful CD / DVD / BD image file processing tool, which allows you to open, extract, burn, create, edit, compress, encrypt, split and convert ISO files, and mount ISO files with internal virtual drive."}, {"url": "http://pcsupport.about.com/od/termsi/g/isofile.htm", "passage_text": "Even Windows 8 and Windows 7 can be purchased directly by Microsoft in ISO format. There are several programs, many of them free, that you can use to create your own ISO file from a disc. See How To Create an ISO Image File From a CD, DVD, or BD for help doing that. ISO images end in the file extension ISO. The most common way to make use of an ISO file is to burn the ISO file to a CD, DVD, or BD disc. It's a different process than burning a bunch of music or document files to a disc because your CD/DVD/BD burning software must assemble the contents of the ISO file onto the disc."}, {"url": "http://www.magiciso.com/", "passage_text": "Simple and Intelligent. MagicISO is a powerful CD/DVD image file creating/editing/extracting tool. It can open / create / edit /extract CD/DVD image files, and it can convert bin to iso and back. as well as make ISO file from DVD/CD-ROM or hard disk, and handle bootable information at meanwhile. "}, {"url": "http://www.wikihow.com/Open-ISO-Files", "passage_text": "How to Open ISO Files. An ISO image file (one with an .iso extension) is a type of disc image file used to replicate the contents of an optical disc, such as a CD. The ISO file for a given disc contains every piece of information written to the disc. "}, {"url": "http://pcsupport.about.com/od/termsi/g/isofile.htm", "passage_text": "An ISO file, often called an ISO image, is a single file, perfect representation of an entire CD, DVD, or BD. The entire contents of a disc can be precisely duplicated in a single ISO file. The most common way to make use of an ISO file is to burn the ISO file to a CD, DVD, or BD disc. It's a different process than burning a bunch of music or document files to a disc because your CD/DVD/BD burning software must assemble the contents of the ISO file onto the disc."}, {"url": "http://pcsupport.about.com/od/toolsofthetrade/ht/burnisofile.htm", "passage_text": "How To Burn an ISO Image File to a DVD. 1  Download Free ISO Burner, a completely free program that only burns ISO files, making it really easy to use. 2  Important: Free ISO Burner is completely free and fully functional. 1 You must have a optical burner to write ISO files to a disc. 2  You will not be able to burn ISO files if you only have a standard CD, DVD, or BD drive. 3  Many ISO files, like some memory testing programs and password recovery tools, are intended to be booted from after they are burned."}, {"url": "http://www.microsoft.com/en-us/software-download/windows10ISO", "passage_text": "Download Windows 10 Disc Image (ISO File). If you need to install or reinstall Windows 10, you can use the tools on this page to create your own installation media using either a USB flash drive or a DVD. Before you begin. 1  Make sure you have: 2  An internet connection (internet service provider fees may apply). 3  Sufficient data storage available on a computer, USB or external drive for the download. 4  A blank USB or DVD (and DVD burner) with at least 4 GB of space if you want to create media."}, {"url": "http://www.pcworld.com/article/241047/how_to_create_and_mount_an_iso_disc_image.html", "passage_text": "How to Mount an ISO Image. When you insert a disc into a PC's optical drive, Windows automatically mounts the disc on the drive. When you want to use an ISO image, you must create a virtual drive and mount the ISO image on it. During its installation, Daemon Tools Lite creates a virtual drive for you. Select Mount from the context menu. Use this menu to mount an ISO disc image. 3. Choose the ISO image you wish to mount. 4. The selected ISO image will appear in Windows as a virtual disc loaded in a virtual drive. You can interact with the ISO image as you would with an optical disc loaded in a drive."}, {"url": "https://support.apple.com/en-us/HT203909", "passage_text": "Create your own ISO. Use these steps to make an ISO copy of your Windows DVD or USB flash drive: 1  While your Mac is started from OS X, insert the Windows installation DVD in an external optical USB drive or connect your Windows USB drive to a USB port on your Mac. "}]