[{"url": "http://www.medicinenet.com/poison_ivy_oak_and_sumac/article.htm", "passage_text": "1 Poison ivy, poison oak, and poison sumac are plants than can cause an itchy rash upon contact. 2  A substance called urushiol, found in these plants, causes the rash. 3  The rash is not contagious. 4  The rash usually disappears in one to three weeks. 5  The majority of cases can be treated at home. Poison ivy, oak, and sumac facts. 1  Poison ivy, poison oak, and poison sumac are plants than can cause an itchy rash upon contact. 2  A substance called urushiol, found in these plants, causes the rash. 3  The rash is not contagious. 4  The rash usually disappears in one to three weeks"}, {"url": "http://www.tricalm.com/uses/poison-ivy-oak-sumac/", "passage_text": "Causes: When people come in contact with poison ivy, poison oak or poison sumac they often develop an allergic reaction that causes a rash at the site of exposure. The leaves of the plant secrete a resin called urushiol (u-ROO-she-ol) that provokes a delayed allergic reaction one day or more after exposure to the skin. Myths: 1  Poison ivy rash is contagious. 2  The blisters and rash produced by the urushiol do not spread nor are they contagious to others. 3  You can however spread the rash if the urushiol has been left on your hands or clothes and they come in contact with other parts of your body or someone else."}, {"url": "http://www.webmd.com/skin-problems-and-treatments/tc/poison-ivy-oak-or-sumac-topic-overview", "passage_text": "Poison ivy, oak, and sumac are plants that can cause a red, itchy rash called allergic contact dermatitis. It is the most common skin problem caused by contact with plants. The rash is caused by contact with a sticky oil called urushiol (say yoo-ROO-shee-all) found in poison ivy, oak, or sumac. You can get the rash from: 1  Touching or brushing against any part of these plants, including the leaves, stems, flowers, berries, and roots, even if the plant is dead. Some people are very allergic to the oil. In these people, even a little bit of the oil may cause serious symptoms that need medical attention right away, such as: 1  Trouble breathing. 2  Swelling of the face, mouth, neck, or genitals. 3  The eyelids may swell shut. 4  Widespread, large blisters that ooze a lot of fluid."}, {"url": "http://www.mayoclinic.org/diseases-conditions/contact-dermatitis/multimedia/poison-ivy-rash/img-20006890", "passage_text": "Poison ivy rash. Brushing against a poison ivy plant can cause a red, itchy rash with swelling, bumps and blisters. Frequently, the rash takes a linear form (as in the top-left corner of the photo) due to the way the plant sweeps across the skin. "}, {"url": "http://health.alot.com/conditions/poison-ivy-symptoms--2089/", "passage_text": "The symptoms of poison ivy are basically the same symptoms as hives. For many people, brushing against or handling poison ivy causes a rapid allergic response. The blood vessels in the skin dilate. This causes fluid to ooze out of them into the skin. "}, {"url": "http://www.webmd.com/allergies/guide/poison-ivy-oak-sumac", "passage_text": "A. A. A. Poison ivy, poison oak, and poison sumac are plants that contain an irritating, oily sap called urushiol. Urushiol triggers an allergic reaction when it comes into contact with skin, resulting in an itchy rash, which can appear within hours of exposure or up to several days later. Poison ivy, poison oak, and poison sumac can be found in most areas of the U.S., except Alaska, Hawaii, and the deserts of the Southwest. In some areas of the country (East, Midwest, and South), poison ivy grows as a vine. In the northern and western U.S., and around the Great Lakes, it grows as a shrub."}, {"url": "http://www.emedicinehealth.com/allergy_poison_ivy_oak_and_sumac/article_em.htm", "passage_text": "Causes of Poison Ivy, Oak, and Sumac Rash. The rash caused by poison ivy, oak, and sumac is an allergic skin reaction to an oil called urushiol that is inside the plant. This oil is found in all parts of the plant, including the leaves, stems, roots, and berries. Exposure to the oil occurs through any of the following: The rash caused by poison ivy, oak, and sumac is an allergic skin reaction to an oil called urushiol that is inside the plant. This oil is found in all parts of the plant, including the leaves, stems, roots, and berries"}]