[{"url": "http://www.cdc.gov/heartdisease/coronary_ad.htm", "passage_text": "Plaque buildup causes the inside of the arteries to narrow over time. This process is called atherosclerosis. Coronary artery disease (CAD) is the most common type of heart disease in the United States. For some people, the first sign of CAD is a heart attack. You and your health care team may be able to help you reduce your risk for CAD"}, {"url": "http://www.heart.org/HEARTORG/Conditions/Cholesterol/WhyCholesterolMatters/Atherosclerosis_UCM_305564_Article.jsp", "passage_text": "Atherosclerosis, or hardening of the arteries, is a condition in which plaque builds up inside the arteries. Plaque is made of cholesterol, fatty substances, cellular waste products, calcium and fibrin (a clotting material in the blood). Atherosclerosis is a type of arteriosclerosis. Some of the diseases that may develop as a result of atherosclerosis include coronary heart disease, angina (chest pain), carotid artery disease, peripheral artery disease (PAD) and chronic kidney disease. Two things that can happen where plaque occurs are: 1  A piece of the plaque may break off."}, {"url": "http://training.seer.cancer.gov/staging/intro/process.html", "passage_text": "The Disease Process of Cancer. According to the most widely accepted theory of cancer development, cancer originates in a single cell somewhere in the body. The cell divides and grows in the organ of origin, causing a localized tumor. "}, {"url": "http://www.sjsu.edu/faculty/gerstman/hs161/InfxDProcess.htm", "passage_text": "The Infectious Disease Process. [last update 11/24/03]. The infectious disease process includes the following components: (1) agent (2) reservoir (3) portals of entry and exit (4) mode of transmission (5) immunity. Types of agents range from the submicroscopic to the large parasites. The classes of agents are summarized in Table 3.1 (p. 63). "}, {"url": "https://en.wikipedia.org/wiki/Disease", "passage_text": "A disease is a particular abnormal condition, a disorder of a structure or function, that affects part or all of an organism. The causal study of disease is called pathology. "}, {"url": "https://en.wikipedia.org/wiki/Medical_diagnosis", "passage_text": "Medical diagnosis (abbreviated DS or Dx) is the process of determining which disease or condition explains a person's symptoms and signs. "}, {"url": "http://www.heart.org/HEARTORG/Caregiver/Resources/WhatisCardiovascularDisease/What-is-Cardiovascular-Disease_UCM_301852_Article.jsp", "passage_text": "Heart and blood vessel disease — also called heart disease — includes numerous problems, many of which are related to a process called atherosclerosis. Atherosclerosis is a condition that develops when a substance called plaque builds up in the walls of the arteries. This buildup narrows the arteries, making it harder for blood to flow through. If a blood clot forms, it can stop the blood flow. This can cause a heart attack or stroke. A heart attack occurs when the blood flow to a part of the heart is blocked by a blood clot. If this clot cuts off the blood flow completely, the part of the heart muscle supplied by that artery begins to die"}, {"url": "http://www.medi-info.com/diabetes-mellitus/", "passage_text": "– A disease complex characterized by persistent hyperglycemia caused by insufficient insulin production or resistance to the metabolic action of insulin. Diabetes mellitus (DM) is generally classified as insulin-dependent (IDDM, type I), non-insulin-dependent (NIDDM, type II), or secondary diabetes mellitus. Diabetes occurs if the body cannot produce insulin (type I), or if it is unable to use the insulin produced (type II); in either case, the ultimate result is hyperglycemia and impaired glucose transport. Type I diabetes is characterized by a genetic predisposition manifested in one of several human leukocyte antigen"}, {"url": "http://dictionary.reverso.net/english-definition/disease%20process", "passage_text": "n an infectious disease of ruminants characterized by chronic inflammation of the bowel and caused by Mycobacterium paratuberculosis, a bacterium that can be transmitted in milk and is a possible cause of Crohn's disease in humans. (C20: named after H. A. Johne (1839--1910), German veterinary surgeon). deduction. n. the process of using the knowledge or information you have in order to understand something or form an opinion, or the opinion that you form (). I have to make deductions about the meaning of words in poem then, I could understand more."}]