[{"url": "http://antibiotics.emedtv.com/omnicef/what-is-omnicef-prescribed-for.html", "passage_text": "It can also be substituted in place of penicillin to treat common infections in people who are allergic to this particular drug. It is not effective against any infection caused by a virus, such as the flu, stomach flu, or common cold. (For more information on what the drug is prescribed for, click Omnicef Uses. This article discusses specific uses of Omnicef, whether it is safe for use in children, and potential off-label uses.)"}, {"url": "http://www.rxlist.com/omnicef-drug/patient-images-side-effects.htm", "passage_text": "Cefdinir is in a group of drugs called cephalosporin (SEF a low spor in) antibiotics. It works by fighting bacteria in your body. Cefdinir is used to treat many different types of infections caused by bacteria. Cefdinir may also be used for purposes not listed in this medication guide. Cefdinir will not treat a viral infection such as the common cold or flu. Antibiotic medicines can cause diarrhea, which may be a sign of a new infection. If you have diarrhea that is watery or bloody, stop taking cefdinir and call your doctor. Do not use anti-diarrhea medicine unless your doctor tells you to."}, {"url": "http://www.everydayhealth.com/drugs/cefdinir", "passage_text": "Cefdinir belongs to a class of antibiotics called cephalosporins, which work by killing bacteria or halting their growth. Be aware that cefdinir, which is available in capsules or in a strawberry-flavored powder that mixes with water, will not work on viral infections: It's not a cure for the common cold or the flu. Cefdinir (Omnicef) Dosage. Cefdinir comes in 300 milligram (mg) capsules, and in a powder (125 or 250 mg) to be mixed with water. The total daily dose for all infections, except pneumonia and skin infections, is 600 mg, which can be taken twice a day in 300 mg doses, or in one 600 mg dose."}, {"url": "http://www.rxlist.com/omnicef-drug.htm", "passage_text": "OMNICEF®. (cefdinir) for Oral Suspension. To reduce the development of drug-resistant bacteria and maintain the effectiveness of OMNICEF (cefdinir) and other antibacterial drugs, OMNICEF (cefdinir) should be used only to treat or prevent infections that are proven or strongly suspected to be caused by bacteria. Call your doctor at once if you have any of these serious side effects: 1  diarrhea that is watery or bloody; 2  chest pain; 3  fever, chills, body aches, flu symptoms; 4  unusual bleeding; 5  seizure (convulsions); 6  pale or yellowed skin, dark colored urine, fever, confusion or weakness; 7  jaundice (yellowing of the skin or eyes);"}, {"url": "http://www.mayoclinic.org/drugs-supplements/cefdinir-oral-route/description/DRG-20073288", "passage_text": "Cefdinir is used to treat bacterial infections in many different parts of the body. It belongs to the class of medicines known as cephalosporin antibiotics. It works by killing bacteria or preventing their growth. "}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMHT0009492/?report=details", "passage_text": "Uses of This Medicine. Cefdinir is used to treat bacterial infections in many different parts of the body. It belongs to the class of medicines known as cephalosporin antibiotics. It works by killing bacteria or preventing their growth. However, this medicine will not work for colds, flu, or other virus infections. "}, {"url": "http://www.everydayhealth.com/drugs/cefdinir", "passage_text": "13 Reviews. 13 Reviews. Cefdinir is an antibiotic prescribed to treat a wide range of bacterial infections, including certain types of pneumonia, sinusitis, bronchitis, strep throat, sore throat, middle-ear infections, and certain skin infections. Cefdinir (Omnicef) Dosage. Cefdinir comes in 300 milligram (mg) capsules, and in a powder (125 or 250 mg) to be mixed with water. The total daily dose for all infections, except pneumonia and skin infections, is 600 mg, which can be taken twice a day in 300 mg doses, or in one 600 mg dose."}, {"url": "http://www.medicinenet.com/cefdinir/article.htm", "passage_text": "GENERIC NAME: cefdinir. DRUG CLASS AND MECHANISM: Cefdinir is a semi-synthetic (partially man-made) oral antibiotic in the cephalosporin family of antibiotics. Therapeutic uses of cefdinir include otitis media (infections of the middle ear), infections of soft tissues, and respiratory tract infections. The FDA approved cefdinir in December 1997."}, {"url": "http://antibiotics.emedtv.com/omnicef/what-is-omnicef-prescribed-for.html", "passage_text": "Omnicef ® (cefdinir) is a prescription medication used to treat a variety of bacterial infections in adults and children (as young as six months old). Specifically, it is prescribed for treating: 1  Bronchitis. 2  Middle ear infection (otitis media). It is not effective against any infection caused by a virus, such as the flu, stomach flu, or common cold. (For more information on what the drug is prescribed for, click Omnicef Uses."}]