[{"url": "http://www.shanghai.climatemps.com/", "passage_text": "1 Total annual Precipitation averages 1111 mm (43.7 inches) which is equivalent to 1111 Litres/m (27.25 Gallons/ft). 2  On average there are 1874 hours of sunshine per year. 3  Visit the sunshine and daylight section to check monthly details including how high in the sky the sun reaches each month. 1 Shanghai, China is at 31 13'N, 121 27'E, 6 m (20 ft). 2  See map. 3  Shanghai has a humid subtropical climate that is mild with no dry season, constantly moist (year-round rainfall)."}, {"url": "http://www.beijing.climatemps.com/precipitation.php", "passage_text": "1 On average there are 66 days per year with more than 0.1 mm (0.004 in) of rainfall (precipitation) or 5.5 days with a quantity of rain, sleet, snow etc. per month. Rainfall/ Precipitation in Beijing, China. 1  Beijing receives on average 576.9 mm (22.7 in) of rainfall per year, or 48.1 mm (1.9 in) per month. 2 "}, {"url": "http://www.beijing.climatemps.com/precipitation.php", "passage_text": "1 Beijing receives on average 576.9 mm (22.7 in) of rainfall per year, or 48.1 mm (1.9 in) per month. 2  On average there are 66 days per year with more than 0.1 mm (0.004 in) of rainfall (precipitation) or 5.5 days with a quantity of rain, sleet, snow etc. per month. Rainfall/ Precipitation in Beijing, China. 1  Beijing receives on average 576.9 mm (22.7 in) of rainfall per year, or 48.1 mm (1.9 in) per month."}, {"url": "http://www.answers.com/Q/What_is_the_average_yearly_rainfall_in_China", "passage_text": "The US Dept of the interior and the US Geological Survey both report that Illinois has an average yearly rainfall of 38.82 inches.   Al … though, for the past 2 years we have been experiencing higher amounts of rainfall in the spring, and cooler temperatures during the summer. This April we are expected to reach 12 inches of rain in some parts of the state. The average for April is 3.4 inches."}, {"url": "http://iprc.soest.hawaii.edu/newsletters/newsletter_sections/iprc_climate_vol5_1/changing_rainfall_china.pdf", "passage_text": "Precipitation The rain-gauge data show that in central, northern, and northeastern China the average annual precipitation has decreased signiﬁcantly from 1961 to 2001, whereas in southwestern, northwestern, and eastern China it has increased. Wang and Zhou studied the linear trend over those 40 years. 6 IPRC Climate, vol. 5, no. 1, 2005 The Changing Rainfall in China O ver the last decades, China has experienced signiﬁcant changes in snow-and rainfall patterns."}, {"url": "http://www.answers.com/Q/What_is_the_average_yearly_rainfall_in_China", "passage_text": "The average yearly rainfall varies greatly among the islands. For the country as a whole it is about 1500 mm (about 59 inches). The greatest rainfall is in the summer months o … f June and July. 25 people found this useful. Al … though, for the past 2 years we have been experiencing higher amounts of rainfall in the spring, and cooler temperatures during the summer. This April we are expected to reach 12 inches of rain in some parts of the state. The average for April is 3.4 inches."}, {"url": "http://www.currentresults.com/Weather/China/average-yearly-precipitation.php", "passage_text": "Average Annual Precipitation for China. The tables below give yearly averages for rainfall plus snowfall at cities in China. Each place has a total for how many days of wet weather it usually gets a year and for the normal amount of precipitation. The calculation of days only includes the days when precipitation totalled at least one millimetre (0.04 inches). The annual amount of precipitation is an average of long-term historical weather data. You can jump to a separate table for each section of the country: North China, Northeast China, East China, South Central China, Southwest China and Northwest China."}, {"url": "http://www.holiday-weather.com/beijing/averages/", "passage_text": "Beijing: Annual Weather Averages. July is the hottest month in Beijing with an average temperature of 27°C (81°F) and the coldest is January at -4°C (25°F) with the most daily sunshine hours at 12 in June. The wettest month is August with an average of 182mm of rain. Loading weather data"}]