[{"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=4428", "passage_text": "Monosomy: Missing one chromosome from a pair. For example, if a female has one X chromosome (X monosomy) rather than two, she has Turner syndrome. "}, {"url": "http://medical-dictionary.thefreedictionary.com/monosomy", "passage_text": "monosomy 9p− syndrome a rare chromosomal disorder in which a piece of the short arm of the ninth chromosome is broken and often lost. Symptoms include mental retardation, a triangular head with forward angulation of the frontal bone, and various other physical deformities. See also aneuploidy. monosomic, adj. (1) A type of aneuploidy, defined by the formula 2n – 1, where n is the haploid number. (E.g., Turner syndrome or monosomy X.). (2) The state of having a single chromosome of a particular type; lacking a homologous chromosome (e.g., normal males are monosomic for the X chromosome)."}, {"url": "http://www.oxforddictionaries.com/definition/english/monosomy", "passage_text": "noun. The condition of having a diploid chromosome complement in which one chromosome lacks its homologous partner. Example sentences. 1  The predominant anomalies in reproductive specimens include trisomy of the autosomes and monosomy of the X chromosome. 1 The predominant anomalies in reproductive specimens include trisomy of the autosomes and monosomy of the X chromosome. 2  Both monosomy and trisomy of specific chromosomes are associated with developmental defects and cancer risk."}, {"url": "https://en.wikipedia.org/wiki/Monosomy", "passage_text": "From Wikipedia, the free encyclopedia. Monosomy is a form of aneuploidy with the presence of only one chromosome from a pair. Partial monosomy occurs when only a portion of the chromosome has one copy, while the rest has two copies. 1 Turner syndrome – Women with Turner syndrome typically have one X chromosome instead of the usual two sex chromosomes. 2  Turner syndrome is the only full monosomy that is seen in humans—all other cases of full monosomy are lethal and the individual will not survive development."}, {"url": "http://www.biology-online.org/dictionary/Monosomy", "passage_text": "Is a rare chromosomal disorder in which there is deletion (monosomy) of a portion of chromosome 9. Symptoms include microgenitalia, mental retardation with microcephaly and dysmorphic features. Please contribute to this project, if you have more information about this term feel free to edit this page. This page was last modified on 1 February 2007, at 01:42.This page has been accessed 27,217 times. What links here | Related changes | Permanent link."}, {"url": "https://en.wikipedia.org/wiki/Monosomy", "passage_text": "Human conditions due to monosomy: 1  Turner syndrome – Women with Turner syndrome typically have one X chromosome instead of the usual two sex chromosomes. 2  Turner syndrome is the only full monosomy that is seen in humans—all other cases of full monosomy are lethal and the individual will not survive development. 1"}, {"url": "http://www.ghr.nlm.nih.gov/glossary=monosomy", "passage_text": "Monosomy is the state of having a single copy of a chromosome pair instead of the usual two copies found in diploid cells. Monosomy can be partial if a portion of the second chromosome copy is present. Monosomy, or partial monosomy, is the cause of some human diseases such as Turner syndrome and Cri du Chat syndrome. "}, {"url": "http://study.com/academy/lesson/monosomy-definition-examples-disorders.html", "passage_text": "Turner Syndrome is the only complete monosomy that is tolerated in humans. Women with this syndrome have only one X chromosome instead of the usual two. Symptoms of this disorder include shorter stature, ovarian and heart defects and weblike pieces of skin on the sides of their necks. Partial Monosomy Occurs because of Deletion or Chromosome Translocation. Partial monosomy is when part of a chromosome is missing. One way this can happen is if part of a chromosome is accidentally deleted during meiosis or during the early development of the embryo."}, {"url": "http://study.com/academy/lesson/monosomy-definition-examples-disorders.html", "passage_text": "When a diploid organism has only one copy of one of its chromosomes instead of two, it's called monosomy. Mono means one, and somy refers to chromo somes. Monosomy is an example of aneuploidy, or having an abnormal number of chromosomes. A human with a monosomy would only have 45 chromosomes instead of 46. Partial Monosomy Occurs because of Deletion or Chromosome Translocation. Partial monosomy is when part of a chromosome is missing. One way this can happen is if part of a chromosome is accidentally deleted during meiosis or during the early development of the embryo."}, {"url": "http://medical-dictionary.thefreedictionary.com/monosomy", "passage_text": "monosomy. existence in a cell of only one instead of the normal diploid pair of a particular chromosome, seen in Turner's syndrome, monosomy 9p− disease, and various other conditions. adj., adj monoso´mic. See also aneuploidy. monosomic, adj. (1) A type of aneuploidy, defined by the formula 2n – 1, where n is the haploid number. (E.g., Turner syndrome or monosomy X.). (2) The state of having a single chromosome of a particular type; lacking a homologous chromosome (e.g., normal males are monosomic for the X chromosome)."}]