[{"url": "https://support.office.com/en-us/article/Determine-the-right-threshold-for-project-cost-and-schedule-variances-3AE31373-65B8-4BA4-9402-83940CAAB6D4", "passage_text": "The scheduled duration is now 25 days: 15 days for the actual duration of the 50 percent that's complete and the baseline 10 days for the remaining 50 percent. If a variance value is positive, the scheduled value is greater than the baseline value, and your project is either over budget or behind schedule. Duration This is the difference between the scheduled duration of a task or project and the baseline duration. It indicates if tasks are taking longer than planned, which in turn affects the project schedule. Work Determine the gap between scheduled and baseline work times."}, {"url": "https://certifedpmp.wordpress.com/tag/ev/", "passage_text": "The Schedule Variance (SV) determines whether a project is ahead of or behind schedule. It is calculated by subtracting the Planned Value (PV) from the Earned Value (EV). A positive value indicates a favorable condition and a negative value indicates an unfavorable condition. The Schedule Variance can be expressed as a percentage by dividing the Schedule Variance (SV) by the Planned Value (PV). In other words, the project is 33 percent behind schedule, meaning that 33 percent of the planned work has not been accomplished."}, {"url": "http://www.techrepublic.com/article/use-earned-value-management-evm-to-determine-project-status/", "passage_text": "Earned Value Management (EVM) is a technique that allows you to determine more precisely where your project stands in terms of your baseline schedule and budget. The general idea behind earned value is to compare where you actually are against where you planned to be. "}, {"url": "https://support.office.com/en-us/article/Determine-the-right-threshold-for-project-cost-and-schedule-variances-3AE31373-65B8-4BA4-9402-83940CAAB6D4", "passage_text": "Office Project 2007 has fields for commonly used variances: Cost This variance is the difference between your scheduled and original baseline costs. It shows if you are over or under budget. Duration This is the difference between the scheduled duration of a task or project and the baseline duration. It indicates if tasks are taking longer than planned, which in turn affects the project schedule. Work Determine the gap between scheduled and baseline work times."}, {"url": "http://www.brighthubpm.com/monitoring-projects/79366-what-should-you-do-when-a-project-is-behind-schedule/", "passage_text": "Identify the Reasons. Sometimes the reasons why a project is behind schedule are more than obvious but this is not always the case. If you don't identify correctly why the project is behind schedule, then the steps you take to get back on track might be the wrong ones and the result could be really devastating. In a sense, if the patient has gastritis, you don't give him an aspirin because this will only make his situation worse."}, {"url": "http://www.brighthubpm.com/monitoring-projects/79366-what-should-you-do-when-a-project-is-behind-schedule/", "passage_text": "When a project is behind schedule, not everything is lost and there are many steps you can take to fix things. You need to know what to do when a project is behind schedule but first you need to identify the reason(s) why a project is behind schedule. If you don't identify correctly why the project is behind schedule, then the steps you take to get back on track might be the wrong ones and the result could be really devastating. In a sense, if the patient has gastritis, you don't give him an aspirin because this will only make his situation worse."}, {"url": "http://idioms.thefreedictionary.com/behind+schedule", "passage_text": "having failed to do something by the appointed time, especially the time given on a written plan. (*Typically: be ~; fall ~; get ~. ) We have to hurry and finish soon or we will fall behind schedule. The project is behind schedule by six months. "}, {"url": "http://www.taskmanagementsoft.com/products/taskmanagerpro/tutorials/customization-guide/schedule-variance-percentage-per-project-sv-.php", "passage_text": "Schedule Variance Percentage % (SV %) = $6 000 USD / 9 000 USD = - 0.67 or 67 %. According to this example, the project is 67 % behind the schedule. You need to do 67% of work to be on track with your schedule in terms of budgeted cost. Schedule Variance Percentage % (SV %) with negative value shows the percentage of work that should be done to be on track with your schedule. In other words, your project is behind the schedule in terms of budgeted cost."}, {"url": "http://www.tutorialspoint.com/earn_value_management/schedule_variance.htm", "passage_text": "Schedule Variance % indicates how much ahead or behind the schedule a project is running in terms of percentage. Schedule Variance % can be calculated using the following formula: The formula mentioned above gives the variance in terms of cost which indicates how much cost of the work is yet to be completed as per schedule or how much cost of work has been completed over and above the scheduled cost. A positive SV indicates we are ahead of schedule. A negative SV indicates we are behind schedule."}]