[{"url": "http://www.radiologyinfo.org/en/info.cfm?PG=headmr", "passage_text": "Magnetic resonance imaging (MRI) of the head uses a powerful magnetic field, radio waves and a computer to produce detailed pictures of the brain and other cranial structures that are clearer and more detailed than other imaging methods."}, {"url": "http://www.healthline.com/health/head-mri", "passage_text": "Magnetic resonance imaging (MRI) of the head is a painless, noninvasive test that produces detailed images of your brain and brain stem. The test is carried out with an MRI machine, which produces the images using a magnetic field and radio waves."}, {"url": "https://www.nlm.nih.gov/medlineplus/mriscans.html", "passage_text": "Magnetic resonance imaging (MRI) uses a large magnet and radio waves to look at organs and structures inside your body. Health care professionals use MRI scans to diagnose a variety of conditions, from torn ligaments to tumors. MRIs are very useful for examining the brain and spinal cord."}, {"url": "http://www.nytimes.com/health/guides/test/mri/overview.html", "passage_text": "An MRI (magnetic resonance imaging) scan is an imaging test that uses powerful magnets and radio waves to create pictures of the body. It does not use radiation (x-rays). Single MRI images are called slices. The images can be stored on a computer or printed on film."}, {"url": "http://www.advancedimagingofmt.com/index.php?page=mri-faq", "passage_text": "1 MRI of the Soft Tissue Neck … 25-35 minute scan time. 2  MRI of the Cervical Spine … 20-35 minute scan time. 3  MRI of the Upper Extremity … 20-45 minute scan time. 4  MRI of the Thoracic Spine … 25-45 minute scan time. 5  MRI of the Chest … 25-45 minute scan time. 6  MRI of the Abdomen"}, {"url": "http://www.advancedimagingofmt.com/index.php?page=mri-faq", "passage_text": "The length of the exam depends on the type of study being performed. 1  MRI of the Brain … 20-45 minute scan time. 2  MRI of the Orbits … 20-35 minute scan time. 3  MRI of the TMJ … 45-60 minute scan time. 4  MRI of the Soft Tissue Neck … 25-35 minute scan time. 5  MRI of the Cervical Spine"}, {"url": "https://www.nlm.nih.gov/medlineplus/ency/article/003791.htm", "passage_text": "A head MRI (magnetic resonance imaging) is an imaging test that uses powerful magnets and radio waves to create pictures of the brain and surrounding nerve tissues."}]