[{"url": "http://www.cooksinfo.com/raw-olives", "passage_text": "Newsletter sign up. Olives, like many other kinds of produce such as potatoes and sour cherries, just aren't something that you eat raw. Unprocessed, straight off the tree, they are bitter, very bitter, and the green ones even more so than ones which have fully ripened to black. No one from a Mediterranean culture, where olives have been gathered since about 8000 BC and certainly cultivated since about 3000 BC, would even think of eating them olives raw."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20081014074330AARL5Du", "passage_text": "Best Answer: They need to be processed, there are two types of processing, salty brine for any stage and oil curing for black olives. Fresh olives are extremely bitter and so are the leaves, but the leaves contain a bitter substance that is anti-viral, anti-bacterial, anti-protozoal, and anti-fungal. They were once used as a treatment for malaria."}, {"url": "http://www.cooksinfo.com/raw-olives", "passage_text": "All glucosides are bitter for the most part, no matter what plant they are in, but the olive's glucoside, called oleuropein, is noteworthy for its bitterness. Oleuropein is also contained in the leaves and the wood of the tree, in case you're a real raw food fan and are thinking of chomping down on those, too."}, {"url": "http://www.olives.com/musco/olives.html", "passage_text": "Let us take you on the journey of an olive, from the tree to your table. The olive tree is revered as one of the longest-living and hardiest trees on earth. A slow-growing tree, it can bear fruit for hundreds of years."}, {"url": "http://www.youaskandy.com/questions-answers/28-articles-series-1990/1735-can-you-eat-raw-olives.html", "passage_text": "Originally found only in the eastern Mediterranean basin, olive trees are now grown in many of the world's tropical regions. One thing is certain: You do not eat the olive raw. Fresh olives have a bitter substance that makes them unpleasant to eat raw. This bitter substance must be largely or entirely removed as the fruit is prepared for market. Olives abroad are grown first of all for their oil. In the United States, a large part of the industry is based on preparing the fruit for eating."}]