[{"url": "https://answers.yahoo.com/question/index?qid=20080318141041AAhur6l", "passage_text": "Answers. Best Answer: Organs formed inside a coelom can freely move, grow, and develop independently of the body wall while fluid cushions and protects them from shocks. This key innovation evolved hundreds of millions of years ago and led to the evolution of nearly all large, complex animals. Best Answer: Organs formed inside a coelom can freely move, grow, and develop independently of the body wall while fluid cushions and protects them from shock"}, {"url": "https://en.wikipedia.org/wiki/Body_cavity", "passage_text": "Organs formed inside a coelom can freely move, grow, and develop independently of the body wall while fluid cushions and protects them from shocks. Arthropods and most mollusks have a reduced (but still true) coelom, usually the pericardial cavity and the gonocoel. Their principal body cavity is the hemocoel or haeomocoel of an open circulatory system, often derived from the blastocoel."}, {"url": "http://bio.rutgers.edu/~gb102/lab_2/3i3m-coelom.html", "passage_text": "A true coelom is formed within the mesoderm layer; thus, the true coelom is entirely lined with mesoderm. Both the gut and the body wall have mesodermal components. A pseudocoelom is not fully lined by mesoderm; in pseudocoelomates the mesoderm is only associated with the outer body wall, and not with the gut. The addition of mesoderm is very important; it is this embryonic tissue which gives rise to the muscular system, as well as many other adult structures. In some bilaterally symmetrical organisms we see an important new addition to the body plan, a body cavity. A body cavity is a space between the gut tube (lined with endoderm) and the body wall (with its outer covering of ectoderm). Such a body cavity, or coelom, can be formed in two ways"}, {"url": "http://www.wisegeek.org/what-is-a-coelom.htm", "passage_text": "A coelom is a cavity that separates the gut from the body wall. Most animals are coelomates, meaning they have a coelom. The coelom allows the body's internal organs to develop independently of the body wall. Animals without it, such as flatworms, are called acoelomates. In between there are some animals called pseudocoelomates, which possess a false coelom, which is an unlined or partially lined body cavity between the gut and body wall. A coelom is defined as a cavity that separates the gut from the body wall. It allows the internal organs to shift around and develop independently of the body wall, creating more physiological and evolutionary flexibility"}, {"url": "http://zoologyinfosolution.blogspot.com/2013/04/introduction-significance-of-coelom.html", "passage_text": "The space between the parietal layer and the visceral layer is known as the coelom or body cavity. In Deuterostomes, the coelom forms by enterocoely mesoderm buds from the walls of the archenteron and hollows to become the coelomic cavities. (iii) In the past, zoologists grouped animals based on characters related to the coelom. The presence or absence of a coelom and the way in which it was formed was believed to be important in understanding the phylogenetic relationships of animal phyla."}, {"url": "http://www.answers.com/Q/What_is_the_importance_of_coelom_in_an_earthworm", "passage_text": "A coelom is a fluid filled cavity within the mesoderm, it can be seen as the digestive track of an earthworm. Coelomic fluids assist in locomotion and regulation of fluid tran … sfer through the body wall. Confidence votes 497. Coelom provides space for different organs like heart, lungs, kidneys etc., Presence of coelom also gives flexibility of the body so that animal can move in direction freely. Depending upon type of coelom present, the animals are divided into three groups. 1"}]