[{"url": "http://www.emedicinehealth.com/carbon_monoxide_poisoning/page2_em.htm", "passage_text": "Carbon Monoxide Poisoning Causes. Carbon monoxide is formed when organic compounds burn. The most common sources are motor vehicle exhaust, smoke from fires, engine fumes, and nonelectric heaters. Carbon monoxide poisoning is often associated with malfunctioning or obstructed exhaust systems and with suicide attempts."}, {"url": "http://www.doityourself.com/stry/3-common-causes-of-carbon-monoxide-poisoning", "passage_text": "Another very common source of carbon monoxide poisoning is from cigarette smoke. Second-hand smoke is one of the leading causes of health problems for those that are around smokers frequently. If you have a house full of smokers, the smoke can actually cause a serious amount of carbon monoxide poisoning. Getting a carbon monoxide detector can help you to know if you are being subjected to the deadly gas. However, many people ignore these safety devices and are still hurt by the gas. Here are a few common causes of carbon monoxide poisoning that you can avoid with a little common sense. 1. Power Outages. One of the biggest problems with carbon monoxide comes when people are subjected to extended power outages"}, {"url": "http://www.mayoclinic.org/diseases-conditions/carbon-monoxide/basics/causes/CON-20025444", "passage_text": "Causes. Carbon monoxide poisoning is caused by inhaling combustion fumes. When too much carbon monoxide is in the air you're breathing, your body replaces the oxygen in your red blood cells with carbon monoxide. This prevents oxygen from reaching your tissues and organs. "}, {"url": "https://en.wikipedia.org/wiki/Carbon_monoxide", "passage_text": "The most common symptoms of carbon monoxide poisoning may resemble other types of poisonings and infections, including symptoms such as headache, nausea, vomiting, dizziness, fatigue, and a feeling of weakness. Affected families often believe they are victims of food poisoning. Infants may be irritable and feed poorly. Carbon monoxide consists of one carbon atom and one oxygen atom, connected by a triple bond that consists of two covalent bonds as well as one dative covalent bond. It is the simplest oxocarbon and is isoelectronic with the cyanide anion, the nitrosonium cation and molecular nitrogen."}, {"url": "http://sunsethc.com/common-reasons-carbon-monoxide-detector-goes/", "passage_text": "Each year, hundreds of families experience the pain caused by losing a loved one to carbon monoxide poisoning. Unfortunately, this odorless, colorless gas is very common, and whenever something is burned, carbon monoxide is released. After it’s inhaled, carbon monoxide causes a rapid displacement of oxygen in the bloodstream. "}, {"url": "http://www.webmd.com/first-aid/tc/carbon-monoxide-poisoning-topic-overview", "passage_text": "Carbon monoxide poisoning happens when you breathe too much carbon monoxide. Carbon monoxide is a gas produced by burning any type of fuel-gas, oil, kerosene, wood, or charcoal. What makes this gas so dangerous is that when you breathe it, it replaces the oxygen in your blood. Without oxygen, cells throughout the body die, and the organs stop working. "}, {"url": "https://en.wikipedia.org/wiki/Carbon_monoxide_poisoning", "passage_text": "Carbon monoxide can also have severe effects on the fetus of a pregnant woman. Chronic exposure to low levels of carbon monoxide can lead to depression, confusion, and memory loss. Carbon monoxide mainly causes adverse effects in humans by combining with hemoglobin to form carboxyhemoglobin (HbCO) in the blood. "}, {"url": "http://www.health.state.mn.us/divs/eh/indoorair/co/", "passage_text": "Carbon Monoxide (CO) Poisoning in Your Home. Carbon monoxide (CO) is an odorless, colorless gas often formed in the process of incomplete combustion of organic substances, including fuels. It is dangerous because it interferes with normal oxygen uptake for humans and other living organisms needing oxygen to liv"}, {"url": "http://www.emedicinehealth.com/carbon_monoxide_poisoning/article_em.htm", "passage_text": "Carbon monoxide poisoning can cause brain damage and death. You can't see it, smell it, or taste it; but carbon monoxide can kill you. 1  Carbon monoxide is odorless, tasteless, and colorless gas is known as the silent killer.. 2  Carbon monoxide is produced by common household appliances. 1 Carbon monoxide is odorless, tasteless, and colorless gas is known as the silent killer.. 2  Carbon monoxide is produced by common household appliances. 3  When not properly ventilated, carbon monoxide emitted by these appliances can build up."}]