[{"url": "https://en.wikipedia.org/wiki/Straw_hat", "passage_text": "The hat is designed to protect the head from the sun and against heatstroke, but straw hats are also used in fashion as a decorative element or a uniform. Many of these hats are formed in a similar way to felt hats; they are softened by steam or by submersion in hot water, and then formed by hand or over a hat block. Finer and more expensive straw hats have a tighter and more consistent weave."}, {"url": "https://en.wikipedia.org/wiki/Straw_hat", "passage_text": "There are several styles of straw hats, but all of them are woven using some form of plant fibre. Many of these hats are formed in a similar way to felt hats; they are softened by steam or by submersion in hot water, and then formed by hand or over a hat block. Finer and more expensive straw hats have a tighter and more consistent weave."}, {"url": "http://www.delmonicohatter.com/terminology.htm", "passage_text": "Cowboy Hat. Hat with a high crown and a wide brim originally worn in the American west by cow hands. It is usually made of felt, leather, or straw. Crown. The vertical portion of a felt or straw hat. Many times there is a crease or pinch in the crown. Brim. The horizontal part of a felt or straw hat. The brim may be turned up, turned down, or up in the back and down in the front. Hats with the brim up in the back and down in the front are called snap brims. Bucket Hat. Fabric hat with a flat-topped, slightly conical crown sloping brim. Cap. Low profile fabric hat with a small peak at the front. Chef's Hat. White, starched bonnet worn by chefs"}, {"url": "https://en.wikipedia.org/wiki/Straw_hat", "passage_text": "1 Boater hat — a formal straw hat with a flat top and brim. 2  Conical hat — the distinctive hat worn primarily by farmers in Southeast Asia. 3  Panama hat — a fine and expensive hat made in Ecuador. Many of these hats are formed in a similar way to felt hats; they are softened by steam or by submersion in hot water, and then formed by hand or over a hat block. Finer and more expensive straw hats have a tighter and more consistent weave."}, {"url": "https://en.wikipedia.org/wiki/Cowboy_hat", "passage_text": "Stetson hat. Modern cowboy hats are made of fur-based felt, straw or, less often, leather. They are sold with a tall, rounded crown and a wide flat brim. They have a simple sweat band on the inside to stabilize the fit of the head, and usually a small decorative hat band on the outside of the crown. The shape of a cowboy hat's crown and brim are often modified by the wearer for fashion and to protect against weather. It is an item of apparel that can be worn in any corner of the world, and receive immediate recognition as part of North American cowboy culture."}, {"url": "https://en.wikipedia.org/wiki/Conical_Asian_hat", "passage_text": "(January 2012). Vietnamese style conical hat, non nón. La Lá the asian conical hat is a simple style of conical hat Originating, In, east South And, southeast Asia, Particularly, Bangladesh, Bhutan, China, Cambodia, India, Indonesia, Japan, Korea, Malaysia, myanmar Philippines. and vietnam In mainland China and Taiwan, it is called dǒuli (dǒulì), 斗笠 literally meaning a-one dǒu bamboo, (hat, 笠帽). 竹笠 it is known as (sugegasa) 菅笠 In, japan'do un In, cambodia and caping In. Indonesia In, korea the hat is called (satgat), 삿갓 a cognate of The filipino saklat or. salakot"}, {"url": "http://onepiece.wikia.com/wiki/Straw_Hat_Pirates", "passage_text": "The Straw Hat Pirates are a pirate crew that originated from East Blue, but have various members from different areas. They are the main focus and protagonists of the anime and manga One Piece, and are led by the main protagonist, Monkey D. Luffy. Straw Hat Luffy. As the captain of the crew, Luffy has been recognized by the World Government as the most dangerous member of the Straw Hats. Due to Luffy being a relatively new pirate, the World Government originally did not pay much attention to him."}, {"url": "https://en.wikipedia.org/wiki/Conical_Asian_hat", "passage_text": "The Asian conical hat is a simple style of conical hat originating in East, South, and Southeast Asia, particularly Bangladesh, Bhutan, China, Cambodia, India, Indonesia, Japan, Korea, Malaysia, Myanmar, Philippines, and Vietnam. In mainland China and Taiwan, it is called dǒuli (dǒulì), 斗笠 literally meaning a-one dǒu bamboo, (hat, 笠帽). 竹笠 it is known as (sugegasa) 菅笠 In, japan'do un In, cambodia and caping In. Indonesia In, korea the hat is called (satgat), 삿갓 a cognate of The filipino saklat or. salakot"}, {"url": "https://en.wikipedia.org/wiki/Straw_hat", "passage_text": "Straw hats are commonly blocked into shapes found in felt hats. 1  Boater hat — a formal straw hat with a flat top and brim. 2  Conical hat — the distinctive hat worn primarily by farmers in Southeast Asia. 3  Panama hat — a fine and expensive hat made in Ecuador. Many of these hats are formed in a similar way to felt hats; they are softened by steam or by submersion in hot water, and then formed by hand or over a hat block. Finer and more expensive straw hats have a tighter and more consistent weave."}]