[{"url": "http://lpi.oregonstate.edu/mic/minerals/sodium", "passage_text": "Salt (sodium chloride) is essential for life. The tight regulation of the body's sodium and chloride concentrations is so important that multiple mechanisms work in concert to control them. "}, {"url": "https://en.wikipedia.org/wiki/Sodium_chloride", "passage_text": "Common salt has a well-established 1:1 molar ratio of sodium and chlorine. In 2013, compounds of sodium and chloride of different stoichiometries have been discovered by a team at Stony Brook University; five new compounds were predicted (e.g., Na 3 Cl, Na 2 Cl, Na 3 Cl 2, NaCl 3, and NaCl 7). Solid sodium chloride has a melting point of 801 °C. Thermal conductivity of sodium chloride as a function of temperature has a maximum of 2.03 W/(cm K) at 8 K (−265.15 °C; −445.27 °F) and decreases to 0.069 at 314 K (41 °C; 106 °F). It also decreases with doping."}, {"url": "http://www.middleschoolchemistry.com/lessonplans/chapter5/lesson3", "passage_text": "1 Salt (sodium chloride) is made from positive sodium ions bonded to negative chloride ions. 2  Water can dissolve salt because the positive part of water molecules attracts the negative chloride ions and the negative part of water molecules attracts the positive sodium ions. Point out that the water molecules are attracted to the sodium and chloride ions of the salt crystal. Explain that the positive area of a water molecule is attracted to a negative chloride ion. The negative area water of a water molecule is attracted to a positive sodium ion."}, {"url": "http://www.rsc.org/learn-chemistry/wiki/Substance:Sodium_chloride", "passage_text": "Read more... Edit at Wikipedia... Sodium chloride, also known as salt, common salt, table salt or halite, is an ionic compound with the chemical formula NaCl, representing a 1:1 ratio of sodium and chloride ions. Sodium chloride is the salt most responsible for the salinity of seawater and of the extracellular fluid of many multicellular organism s. In the form of edible or table salt it is commonly used as a condiment and food preservative. Large quantities of sodium chloride are used in many industrial processes, and it is a major source of sodium and chlorine compounds used as feedstocks for further chemical syntheses."}, {"url": "https://en.wikipedia.org/wiki/Sodium_chloride", "passage_text": "When dissolved in water, the sodium chloride framework disintegrates as the Na + and Cl − ions become surrounded by the polar water molecules. These solutions consist of metal aquo complex with the formula [Na(H 2 O) 8 ] + , with the Na-O distance of 250 pm. Solid sodium chloride has a melting point of 801 °C. Thermal conductivity of sodium chloride as a function of temperature has a maximum of 2.03 W/(cm K) at 8 K (−265.15 °C; −445.27 °F) and decreases to 0.069 at 314 K (41 °C; 106 °F). It also decreases with doping."}, {"url": "https://en.wikipedia.org/wiki/Sodium_chloride", "passage_text": "Sodium chloride /ˌsoʊdiəm ˈklɔraɪd/ , also known as salt, common salt, table salt or halite, is an ionic compound with the chemical formula NaCl, representing a 1:1 ratio of sodium and chloride ions. Solid sodium chloride has a melting point of 801 °C. Thermal conductivity of sodium chloride as a function of temperature has a maximum of 2.03 W/(cm K) at 8 K (−265.15 °C; −445.27 °F) and decreases to 0.069 at 314 K (41 °C; 106 °F). It also decreases with doping."}, {"url": "http://www.cosmeticsinfo.org/ingredient/sodium-chloride", "passage_text": "Sodium Chloride, or table salt, is a white crystalline solid. In cosmetics and personal care products, Sodium Chloride is used in the formulation of oral hygiene products, shampoos, fragrance, skin, hair, nail, cleansing, suntan, makeup and bath products."}, {"url": "https://en.wikipedia.org/wiki/Sodium_chloride", "passage_text": "Sodium chloride is the salt most responsible for the salinity of seawater and of the extracellular fluid of many multicellular organisms. In the form of edible or table salt it is commonly used as a condiment and food preservative. Solid sodium chloride has a melting point of 801 °C. Thermal conductivity of sodium chloride as a function of temperature has a maximum of 2.03 W/(cm K) at 8 K (−265.15 °C; −445.27 °F) and decreases to 0.069 at 314 K (41 °C; 106 °F). It also decreases with doping."}, {"url": "http://www.middleschoolchemistry.com/lessonplans/chapter5/lesson3", "passage_text": "1 Water can dissolve salt because the positive part of water molecules attracts the negative chloride ions and the negative part of water molecules attracts the positive sodium ions. 2  The amount of a substance that can dissolve in a liquid (at a particular temperature) is called the solubility of the substance. Point out that the water molecules are attracted to the sodium and chloride ions of the salt crystal. Explain that the positive area of a water molecule is attracted to a negative chloride ion. The negative area water of a water molecule is attracted to a positive sodium ion."}, {"url": "http://www.middleschoolchemistry.com/lessonplans/chapter5/lesson3", "passage_text": "Project the animation Sodium Chloride Dissolving in Water. Point out that the water molecules are attracted to the sodium and chloride ions of the salt crystal. Explain that the positive area of a water molecule is attracted to a negative chloride ion. The negative area water of a water molecule is attracted to a positive sodium ion."}]