[{"url": "https://en.wikipedia.org/wiki/Limerick_(poetry)", "passage_text": "A limerick is a form of poetry, especially one in five-line, predominantly anapestic meter with a strict rhyme scheme (AABBA), which is sometimes obscene with humorous intent. The first, second and fifth lines are usually longer than the third and fourth. "}, {"url": "https://www.youngwriters.co.uk/types-limerick", "passage_text": "A Limerick consists of five lines. The first line of a limerick poem usually begins with 'There was a....' and ends with a name, person or place. The last line of a limerick is normally a little farfetched or unusual. A limerick should have a rhyme scheme of aabba: "}, {"url": "http://www.webexhibits.org/poetry/explore_famous_limerick_examples.html", "passage_text": "A look at memorable limericks, each with five lines and an aabba rhyme scheme, clearly shows their intended audiences, as well as the bawdiness, nonsense, humor, and delightful storytelling simplicity of the form. "}, {"url": "http://www.poetrysoup.com/dictionary/limerick", "passage_text": "Poetry Definition. A limerick is a five-line, often humorous and ribald poem with a strict meter. Lines 1, 2, and 5 of have seven to ten syllables (three metrical feet) and rhyme with one another. Lines 3 and 4 have five to seven (two metrical feet) syllables and also rhyme with each other. The rhyme scheme is usually A-A-B-B-A. "}, {"url": "http://www.poetrysoup.com/poems/limerick", "passage_text": "Limerick Poems. Below are examples of limerick poems. This list of poems in the limerick form of poetry is made of PoetrySoup member poems. PoetrySoup is a great resource for examples of limerick poems or a list of limerick poetry. These examples illustrate what limerick poems look like and its form."}, {"url": "http://kidzone.ws/poetry/limerick.htm", "passage_text": "How to write a limerick: The first, second and fifth lines rhyme with each other and have the same number of syllables (typically 8 or 9). The third and fourth lines rhyme with each other and have the same number of syllables (typically 5 or 6). Introduction : A limerick is a silly poem with five lines. They are often funny or nonsensical. Limericks were made famous by Edward Lear, a famous author who wrote the Book of Nonsense in the 1800's."}, {"url": "http://www.familyfriendpoems.com/poems/funny/limerick/", "passage_text": "Funny Limericks. A limerick is a five-line witty poem with a distinctive rhythm. The first, second and fifth lines, the longer lines, rhyme. The third and fourth shorter lines rhyme. (AABBA). This five line poem also follows a syllable count."}, {"url": "http://www.limerickexamples.com/", "passage_text": "Limerick Meaning. A limerick is a humorous poem consisting of five lines. The first, second, and fifth lines must have seven to ten syllables while rhyming and having the same verbal rhythm. The third and fourth lines only have to have five to seven syllables, and have to rhyme with each other and have the same rhythm. The standard form of a limerick is a stanza of five lines, with the first, second and fifth rhyming with one another and having three feet of three syllables each; and the shorter third and fourth lines also rhyming with each other, but having only two feet of three syllables."}, {"url": "http://www.writeawriting.com/poetry/limerick/", "passage_text": "Rhyming Format of a Limerick Poem. A standard limerick poem consists of a stanza of five lines, with the first, second and fifth usually rhyming with one another and having three feet of three syllables each. The shorter third and fourth lines also rhyme with each other, but have only two feet of three syllables each. "}, {"url": "http://literarydevices.net/limerick/", "passage_text": "Edward Lear was considered to be the father of limericks. This is one of the very good examples of limerick poems, following its typical format with first, second and fifth lines rhyming together and longer in length, while remaining two are shorter, and give a faster read. Lear has referred this form as nonsense."}]