[{"url": "http://www.sheknows.com/baby-names/name/antonio", "passage_text": "The name Antonio is an English baby name. In English the meaning of the name Antonio is: Highly praiseworthy. From a Roman clan name. In the 17th century, the spelling Anthony was associated with the Greek anthos meaning flower. Italian Meaning: The name Antonio is an Italian baby name. In Italian the meaning of the name Antonio is: beyond praise'. Shakespearean Meaning: The name Antonio is a Shakespearean baby name. In Shakespearean the meaning of the name Antonio is: Two Gentlemen of Verona' Father to Proteus. The name Antonio is a Spanish baby name. In Spanish the meaning of the name Antonio is: Beyond praise. American Meaning: The name Antonio is an American baby name. In American the meaning of the name Antonio is: Beyond praise."}, {"url": "http://www.meaning-of-names.com/english-names/antonio.asp", "passage_text": "English name. In English, the name Antonio means-Variant of Anthony: Highly praiseworthy. From a Roman clan name. In the 17th century, the spelling Anthony was associated with the Greek anthos meaning flower.. Other origins for the name Antonio include-English, Spanish, Italian, Spanish.The name Antonio is most often used as a boy name or male name. English Name Meaning-Variant of Anthony: Highly praiseworthy"}, {"url": "http://www.ohbabynames.com/meaning/name/antonio/1291", "passage_text": "Etymology & Historical Origin-Antonio. The name Antonio is the Spanish and Italian version of Anthony which comes from an old Roman Family name “Antonius” (originating out of modern-day Tuscany). Most notably, Mark Anthony comes from this family (Marcus Antonius). Not much else is known about its origin. Literary Characters of the Baby Name Antonio. Antonio (The Merchant of Venice) Antonio is the title character of Shakespeare’s Merchant of Venice, who agrees to Shylock’s infamous “pound of flesh” collateral on behalf of his friend, Bassanio’s loan."}, {"url": "http://www.babynamewizard.com/baby-name/boy/antonio", "passage_text": "Origin of the name Antonio: Derived from the Latin Antonius, an old Roman family name of unknown etymology. “Priceless” and “of inestimable worth” are popular folk definitions of the name. Var: Anton, Antonio. Short: Toni, Tonio, Tony. From A World of Baby Names by Teresa Norman. "}, {"url": "http://www.ourbabynamer.com/meaning-of-Antonio.html", "passage_text": "Antonio is a form of the name Anthony. The name Anthony is derived from the old Roman clan or family name Antonius. Antonius is probably of Etruscan origin. Antonio is a variant spelling of Anthony. Anthony is the English form of the old Roman family name Antonius. Antonius is probably of Etruscan origin. The name was origianlly spelled without an h, Antony. The letter h was inserted in the seventeenth century, under the mistaken belief that the name derived from the Greek word anthos meaning flower."}, {"url": "http://www.sheknows.com/baby-names/name/antonio", "passage_text": "Latin Meaning: The name Antonio is a Latin baby name. In Latin the meaning of the name Antonio is: Worthy of praise; of value. Saint Anthony is the patron sain of poor people. Famous Bearer: actor Anthony Hopkins. The name Antonio is a Spanish baby name. In Spanish the meaning of the name Antonio is: Beyond praise. American Meaning: The name Antonio is an American baby name. In American the meaning of the name Antonio is: Beyond praise."}, {"url": "https://en.wikipedia.org/wiki/Antonio", "passage_text": "Look up Antonio in Wiktionary, the free dictionary. Antonio is a Spanish, Italian, and Portuguese first name of Latin origin. In the English language it is translated as Anthony, and has some female derivatives: Antonia, Antonia, Antónia, Antonieta, antonietta And. antonella The Greek versions of the name are Antonios and Antonis (αντώνης). The name derives from Antonius, a well known Latin family name, probably of Etruscan origin. The Roman general Marcus Antonius held that the origin of the name was Anthon, son of Hercules. This myth, recorded by Plutarch, was probably created by Marcus Antonius himself, in order to claim divine parentage."}]