[{"url": "http://jobsearch.about.com/od/jobs/qt/database-admin-earn.htm", "passage_text": "Database Administrator Salaries. According to the Bureau of Labor Statistics, Database Administrators earned an average of $77,080 in 2012. The bottom 10% of Database Administrators earned a mean salary of $42,930 and the top 10% earned at least $118,720. Quick Facts: Database Administrator (Occupational Outlook Handbook) | List of Database Administrator Skills."}, {"url": "http://www1.salary.com/Database-Administrator-I-salary.html", "passage_text": "For example the median expected annual pay for a typical Database Administrator I in the United States is $63,563 so 50% of the people who perform the job of Database Administrator I in the United States are expected to make less than $63,563. Source: HR Reported data as of October 2015. Median $63,563. "}, {"url": "http://money.usnews.com/careers/best-jobs/database-administrator/salary", "passage_text": "Salary Outlook. The Labor Department reports that database administrators made a median salary of $78,520 in 2013. The highest-paid 10 percent in the profession earned $120,990, while the lowest-paid earned $43,720 that year. Best Paying Cities for Database Administrators. The highest paid in the database administrator profession work in the metropolitan areas of San Francisco, Trenton, New Jersey, and District of Columbia. The San Jose, California area also pays well, as does the city of Boulder, Colorado."}, {"url": "http://www.payscale.com/research/UK/Job=Database_Administrator_(DBA)/Salary", "passage_text": "(United Kingdom). A Database Administrator (DBA) earns an average salary of £29,021 per year. People in this job generally don't have more than 20 years' experience. The highest paying skills associated with this job are UNIX, Linux, Oracle, PL/SQL, and MySQL. £15,848 - £44,928"}, {"url": "http://www.payscale.com/research/US/Job=Database_Administrator_(DBA)/Salary", "passage_text": "A Database Administrator (DBA) earns an average salary of $69,909 per year. People in this job generally don't have more than 20 years' experience. The skills that increase pay for this job the most are UNIX, Oracle, Linux, and PL/SQL. "}, {"url": "http://www.bls.gov/ooh/computer-and-information-technology/database-administrators.htm", "passage_text": "The median annual wage for database administrators (DBAs) was $77,080 in May 2012. The median wage is the wage at which half the workers in an occupation earned more than that amount and half earned less. The lowest 10 percent earned less than $42,930, and the top 10 percent earned more than $118,720. Employment of database administrators (DBAs) is projected to grow 15 percent from 2012 to 2022, faster than the average for all occupations. Growth in this occupation will be driven by the increased data needs of companies in all sectors of the economy."}, {"url": "http://jobsearchtech.about.com/od/careertypes/a/Database-Administrator-Salary.htm", "passage_text": "Salaries by Software Expertise. The job search website Indeed.com calculates the average salary of jobs based on job titles. According to their data, the average salary of a database administrator in 2012 is $82,000, while the average salary of a senior DBA is $96,000. An SQL DBA makes $90,000 on average, while a senior SQL DBA makes $100,000. According to Indeed.com's data, a PostgreSQL DBA makes $102,000 on average. Those working in educational services had a median income of $62,580. The job search website Indeed.com calculates the average salary of jobs based on job titles. According to their data, the average salary of a database administrator in 2012 is $82,000, while the average salary of a senior DBA is $96,000."}, {"url": "http://money.usnews.com/careers/best-jobs/database-administrator/salary", "passage_text": "Average Database Administrator Pay vs. Other Best Jobs. Bringing home an average annual salary of $80,740, or about $38.82 per hour, database administrators are well-compensated. But they are eclipsed in the paycheck department by computer programmers ($80,930), computer systems analysts ($85,320), software developers ($96,260) and IT managers ($132,570). Best Paying Cities for Database Administrators. The highest paid in the database administrator profession work in the metropolitan areas of San Francisco, Trenton, New Jersey, and District of Columbia. The San Jose, California area also pays well, as does the city of Boulder, Colorado."}]