[{"url": "http://www.answers.com/Q/Why_are_DNA_and_RNA_important_for_living_organisms", "passage_text": "Expert answer by Hilmar Zonneveld. Confidence votes 54.7K. Basically, DNA stores the information about the characteristics of a living being, and RNA transfers this information, to make the corresponding proteins-each gene (a small part of DNA) encodes a protein sequence, and RNA transfers these instructions. "}, {"url": "http://www.dnaftb.org/40/", "passage_text": "All living organisms store genetic information using the same molecules — DNA and RNA. Written in the genetic code of these molecules is compelling evidence of the shared ancestry of all living things. "}, {"url": "http://www.dummies.com/how-to/content/what-is-the-role-of-nucleic-acids-in-living-things.html", "passage_text": "Nucleic acids are large molecules that carry tons of small details: all the genetic information. Nucleic acids are found in every living thing — plants, animals, bacteria, viruses, fungi — that uses and converts energy. Every single living thing has something in common. Ribonucleic acid (RNA). The nitrogenous bases that RNA uses are adenine, guanine, cytosine, and uracil (instead of thymine). And, the sugar in RNA is ribose (instead of 2-deoxyribose). Those are the major differences between DNA and RNA. In most animals, RNA is not the major genetic material"}, {"url": "https://en.wikibooks.org/wiki/Biochemistry/DNA_and_RNA", "passage_text": "Difference between DNA and RNA [edit]. DNA is the permanent genetic information storage medium, found in the nucleus of most cells of most living organisms. RNA is, in the case of eukaryotes, the medium that transfers the genetic information from the nucleus to the cytoplasm where proteins are synthesized. The bases of DNA are A,T,C,and G, DNA is a long polymer with phosphate and deoxyribose backbone. In contrast, RNA bases are A,U, C,and G, RNA backbone contain ribose and phosphate. The job of DNA on the cell is to store and transmit genetic information."}, {"url": "http://education.seattlepi.com/two-major-functions-nucleic-acid-living-things-6104.html", "passage_text": "Nucleic acids are the molecules that carry the genetic information that is passed down from parent to child. However, nucleic acids are special since they can also combine with proteins to become the machines -- called ribosomes -- that turn genetic instructions in nucleic acids into other protein machines. Genetic Information. The main job of DNA is to carry the code for making proteins. A gene is a stretch of DNA that can be read by proteins called ribosomes, and copied into a type of nucleic acid called messenger RNA (mRNA). The mRNA then carries this information to a protein machine that reads the information in mRNA and makes protein"}, {"url": "https://answers.yahoo.com/question/index?qid=20070929214140AAZOoNA", "passage_text": "DNA is sequence of nucleotides that form a double helix. The sequence of our DNA is transcribed by enzymes in our cells into mRNA. These mRNA (messenger RNA) are a similar sequence of nucleotides. The RNA's are then translated by a ribosome into a sequence of amino acids into a polypeptide or protein. But yes, DNA carries information and RNA is the way to get that information put into a functional form. "}, {"url": "http://www.umassmed.edu/rti/biology/role-of-rna-protein-in-synthesis/", "passage_text": "In all living cells, the process of translating genetic information from DNA into the proteins that do most of the work in a cell is carried out by molecular machines made of a combination of RNA and protein. "}, {"url": "https://en.wikipedia.org/wiki/DNA", "passage_text": "Deoxyribonucleic acid (/diˌɒksiˌraɪbɵ.njuːˌkleɪ.ɨk ˈaesɪd/ ; ˈæSɪD) dna is a molecule that carries most of the genetic instructions used in the, development functioning and reproduction of all known living organisms and many. viruses "}]