[{"url": "http://www.merriam-webster.com/dictionary/fermentation", "passage_text": "Definition of FERMENTATION. 1. a: a chemical change with effervescence b: an enzymatically controlled anaerobic breakdown of an energy-rich compound (as a carbohydrate to carbon dioxide and alcohol or to an organic acid); broadly: an enzymatically controlled transformation of an organic compound. 2. : ferment 2. See fermentation defined for kids."}, {"url": "http://www.yourdictionary.com/fermentation", "passage_text": "Fermentation is defined as a process involving yeasts or other microorganisms breaking down a substance, or a state of excitement. 1  When grapes are crushed or transferred into a press, cultured yeast is added, and the sugars in the grapes start to convert into alcohol, this is an example of fermentation."}, {"url": "http://medical-dictionary.thefreedictionary.com/fermentation", "passage_text": "fermentation. the anaerobic enzymatic conversion of organic compounds, especially carbohydrates, to simpler compounds, especially to lactic acid or ethyl alcohol, producing energy in the form of ATP."}, {"url": "http://www.merriam-webster.com/dictionary/fermentation", "passage_text": "Medical Definition of FERMENTATION. 1. : a chemical change with effervescence. 2. : an enzymatically controlled anaerobic breakdown of an energy-rich compound (as a carbohydrate to carbon dioxide and alcohol or to an organic acid); broadly: an enzymatically controlled transformation of an organic compound."}, {"url": "https://en.wikipedia.org/wiki/Fermentation_in_food_processing", "passage_text": "Beer fermenting at a brewery. Fermentation in food processing is the conversion of carbohydrates to alcohols and carbon dioxide or organic acids using yeasts, bacteria, or a combination thereof, under anaerobic conditions. Fermentation usually implies that the action of microorganisms is desirable."}, {"url": "https://en.wikipedia.org/wiki/Fermentation_in_food_processing", "passage_text": "The term fermentation is sometimes used to specifically refer to the chemical conversion of sugars into ethanol, a process which is used to produce alcoholic beverages such as wine, beer, and cider."}]