[{"url": "http://www.healthline.com/health/rickets", "passage_text": "Rickets is a nutritional disorder that can develop if you do not get enough vitamin D, calcium, or phosphate. Rickets leads to poor functioning of a bone’s growth plate (growing edge), softened and weakened bones, stunted growth, and, in severe cases, skeletal deformities. "}, {"url": "https://www.algaecal.com/research/osteomalacia/", "passage_text": "Osteomalacia | Osteomalacia Treatment and Diagnosis. Osteomalacia or “ soft bones ” is a condition that affects your bones and is most often due to a lack of vitamin D and sometimes due to mineral deficiency. When found in children, this condition is called rickets. Nowadays it is rare to see rickets, but osteomalacia is still a threat to adult"}, {"url": "https://www.sharecare.com/health/rickets/is-there-cure-for-rickets", "passage_text": "A Honor Society of Nursing (STTI) answered. Rickets is curable if the underlying cause is resolved quickly and no permanent damage has been done to the bones. Rickets is caused by a vitamin D deficiency, which leads to an imbalance of calcium and phosphorus levels in the body. Maintaining the proper level of these vitamins and minerals will cure rickets."}, {"url": "http://www.aafp.org/afp/2006/0815/p629.html", "passage_text": "Treatment depends on the type of rickets your child has. Your doctor will find out why your child has rickets and treat the cause. Nutritional rickets is treated with vitamin D and calcium. If your child has inherited rickets or has an illness causing the problem, a doctor who specializes in rickets may need to help."}, {"url": "https://in.answers.yahoo.com/question/index?qid=20080605074508AAiUvvC", "passage_text": "· just now. Report Abuse. Treatment depends on the type of rickets your child has....Nutritional rickets is treated with vitamin D and calcium, and often improvements occur within a few weeks of treatment.... If your child has inherited rickets or has an illness causing the problem, you may need to see a doctor who specializes in rickets. "}, {"url": "http://www.nhs.uk/Conditions/Rickets/Pages/Treatment.aspx", "passage_text": "Treating rickets. Most cases of rickets are caused by a vitamin D and calcium deficiency. Therefore, rickets is usually treated by increasing a child's intake of vitamin D and calcium. Vitamin D and calcium levels can be increased by: 1  eating more foods rich in calcium and vitamin D. "}, {"url": "http://www.healthgrades.com/conditions/rickets", "passage_text": "Rickets is a disease in children that causes the bones to develop softer than normal, resulting in muscle and bone weakness and deformity. Rickets is impaired mineralization of the growth plates of bones. The most common cause of rickets is a lack of vitamin D. "}, {"url": "https://en.wikipedia.org/wiki/Rickets", "passage_text": "The predominant cause is a vitamin D deficiency, but lack of adequate calcium in the diet may also lead to rickets (cases of severe diarrhea and vomiting may be the cause of the deficiency). Rickets is defective mineralization or calcification of bones before epiphyseal closure in immature mammals due to deficiency or impaired metabolism of vitamin D, phosphorus or calcium, potentially leading to fractures and deformity. Rickets is among the most frequent childhood diseases in many developing countries."}, {"url": "http://www.medicinenet.com/rickets/article.htm", "passage_text": "Rickets is a disorder caused by a deficiency of vitamin D, calcium, or phosphate. Rickets leads to softening and weakening of the bones and is seen most commonly in children 6-24 months of age. There are several subtypes of rickets, including hypophosphatemic rickets (vitamin-D-resistant rickets), renal or kidney rickets (renal osteodystrophy), and most commonly, nutritional rickets (caused by dietary deficiency of vitamin D, calcium, or phosphate)."}]