[{"url": "http://www.ehow.com/info_8598749_young-cottontail-rabbit-eat.html", "passage_text": "The eastern cottontail is the most common of the cottontail rabbits found in North American and is most widely recognized for its cottonball-like tail. Cottontails are herbivores, meaning they eat plants. They seek out habitats in fields, meadows and farms, where such food is easily found. As herbivores, the cottontail rabbits' diet consists solely of plants. What they eat depends on the season and what vegetation is readily available. During the summer they will each grasses, clover, herbs, fruits and vegetables, including those in your garden. As much as half of their diet may come from grasses."}, {"url": "http://www.fcps.edu/islandcreekes/ecology/eastern_cottontail.htm", "passage_text": "Cottontails are mostly nocturnal, feeding at night, in the evening, and at dawn. They eat over a hundred different plants. They are not picky and will eat bark, stems, leaves, twigs, branches, flowers, buds, seeds, fruits, and grasses. They tend to eat certain foods, depending on the season. Most rabbits live about a year. Some predators of Eastern Cottontails are raccoons, foxes, hawks, owls, crows, snakes, opossum, cats, and dogs. Copyright, John White. Eastern Cottontails breed frequently. The males fight each other during breeding season, and do a dance for the females."}, {"url": "http://www.ehow.com/info_8598749_young-cottontail-rabbit-eat.html", "passage_text": "Winter Diet of a Young Cottontail Rabbit. Cottontails do not hibernate, but their diet during the winter months is much less appealing. They will eat the woody parts of plants, including twigs and bark, as well as any small buds they can find. They have been known to eat birch, dogwood, maple, oak and sumac. As herbivores, the cottontail rabbits' diet consists solely of plants. What they eat depends on the season and what vegetation is readily available. During the summer they will each grasses, clover, herbs, fruits and vegetables, including those in your garden. As much as half of their diet may come from grasses."}, {"url": "http://icwdm.org/handbook/mammals/CottontailRabbits.asp", "passage_text": "The proverbial carrot certainly is not the only vegetable that cottontails eat. Anyone who has had a row of peas, beans, or beets pruned to ground level knows how rabbits like these plants. Only a few crops-corn, squash, cucumbers, tomatoes, potatoes, and some peppers-seem to be immune from rabbit problems. Cottontail rabbits must be distinguished from jackrabbits and other hares, which are generally larger in size and have longer ears. Jackrabbits are discussed in another chapter of this book. The eastern cottontail rabbit is approximately 15 to 19 inches (37 to 48 cm) in length and weighs 2 to 4 pounds (0.9 to 1.8 kg)."}, {"url": "http://www.fcps.edu/islandcreekes/ecology/eastern_cottontail.htm", "passage_text": "The Eastern Cottontail is a common mammal that can be seen year-round. It has grayish-brown fur, with a reddish-brown neck, and a white tail. Eastern Cottontails are easily recognized by their long ears. This rabbit usually lives in brushy areas where it can hide. Most rabbits live about a year. Some predators of Eastern Cottontails are raccoons, foxes, hawks, owls, crows, snakes, opossum, cats, and dogs. Copyright, John White. Eastern Cottontails breed frequently. The males fight each other during breeding season, and do a dance for the females."}, {"url": "https://en.wikipedia.org/wiki/Cottontail_rabbit", "passage_text": "In appearance, most cottontail rabbits closely resemble the wild European rabbit (Oryctolagus cuniculus). Most Sylvilagus species have stub tails with white undersides that show when they retreat, giving them their name: cottontails. "}, {"url": "http://animals.nationalgeographic.com/animals/mammals/cottontail-rabbit/", "passage_text": "Size relative to a tea cup: There are several species of cottontail rabbit, but the eastern cottontail is the most common. This ubiquitous animal can be found from Canada to South America and, in the United States, from the East Coast to the Great Plains. "}, {"url": "http://www.ndow.org/Species/Furbearer/Desert_Cottontail_Rabbit/", "passage_text": "Cottontails are coprophagic, meaning they eat thier own waste or pellets. Grass is hard to digest, so the rabbits eat the first-formed set of pellets after a meal. Additional nutrition is absorbed during the second digestive process. Pellets from the second set are very hard, fibrous and lack any nutritional value. "}, {"url": "http://icwdm.org/handbook/mammals/CottontailRabbits.asp", "passage_text": "Rabbits mean different things to different people. For hunters, the cottontail rabbit is an abundant, sporting, and tasty game animal. However, vegetable and flower gardeners, farmers, and homeowners who are suffering damage may have very little to say in favor of cottontails. Cottontail rabbits must be distinguished from jackrabbits and other hares, which are generally larger in size and have longer ears. Jackrabbits are discussed in another chapter of this book. The eastern cottontail rabbit is approximately 15 to 19 inches (37 to 48 cm) in length and weighs 2 to 4 pounds (0.9 to 1.8 kg)."}]