[{"url": "https://en.wikipedia.org/wiki/Euro_banknotes", "passage_text": "The euro banknotes are pure cotton fibre, which improves their durability as well as giving the banknotes a distinctive feel. They measure from 120 by 62 millimetres (4.7 in × 2.4 in) to 160 by 82 millimetres (6.3 in × 3.2 in) and have a variety of colour schemes. The euro notes contain many complex security features such as watermarks, invisible ink, holograms and microprinting that document their authenticity. There are seven different denominations of the euro banknotes — €5, €10, €20, €50, €100, €200 and €500 — each having a distinctive colour and size. The designs for each of them have a common theme of European architecture in various artistic eras."}, {"url": "http://www.diffen.com/difference/Euro_vs_US_Dollar", "passage_text": "edit Countries. The Euro is the official currency of the Eurozone, which is made up of 17 of the 27 member states of the European Union. These countries are Austria, Belgium, Cyprus, Estonia, Finland, France, Germany, Greece, Ireland, Italy, Luxembourg, Malta, the Netherlands, Portugal, Slovakia, Slovenia and Spain. The Euro (EUR) is the currency of 22 European countries, including 17 countries in the European Union. This comparison focuses on the history and evolution, central banking, amount of money in circulation and the exchange rate between these two currencies."}, {"url": "https://en.wikipedia.org/wiki/100_euro_note", "passage_text": "As of May 2013, there are approximately 1,721,763,600 €100 banknotes in circulation around the Eurozone. That is approximately €172,176,363,800 worth of €100 banknotes. The European Central Bank is closely monitoring the circulation and stock of the euro coins and banknotes. The one hundred euro note (€100) is one of the higher value euro banknotes and has been used since the introduction of the euro (in its cash form) in 2002."}, {"url": "http://www.dimensionsinfo.com/dollar-bill-dimensions/", "passage_text": "The Dimensions of a Dollar Bill. Throughout the history of the United States, the dollar bill was released in two major formats, namely in large-size notes and in small-size notes. Released in 1862, the large-size one-dollar bill measured approximately 189 by 79 millimeters or 7.4218 by 3.125 inches. This kind of design lasted until the middle parts of the 1920s. After that, the size of all currency was changed to 155.956 by 66.294 by 0.10922 millimeters or 6.14 by 2.61 by 0.0043 inches. Until now, it remains as the standard size of all U.S. currency. The one-dollar bill has gone through a number of significant redesign"}, {"url": "https://en.wikipedia.org/wiki/Euro_banknotes", "passage_text": "The euro banknotes are the banknotes of the euro, the currency of the Eurozone. The first series has been in circulation since 2002. They are issued by the National Central Banks of the Eurosystem or the European Central Bank. In 1999 the euro was introduced virtually, and in 2002 notes and coins began to circulate. There are seven different denominations of the euro banknotes — €5, €10, €20, €50, €100, €200 and €500 — each having a distinctive colour and size. The designs for each of them have a common theme of European architecture in various artistic eras."}, {"url": "http://ec.europa.eu/economy_finance/euro/cash/index_en.htm", "passage_text": "Advanced technical specifications were also developed for the coins, making illegal reproduction, especially for the 1- and 2-euro coins, extremely difficult. The eight denominations of coins vary in size, colour and thickness according to their values, which are 1, 2, 5, 10, 20 and 50 cents, and 1 euro and 2 euros. Europa series. The Europa series banknotes are to be introduced gradually over several years, in ascending order. Years of planning and preparation went into the euro’s design to find a good balance of aesthetic appeal, practical dimensions and security features – resulting in the seven banknotes and eight coins designed for the launch in January 2002."}, {"url": "http://www.answers.com/Q/What_are_the_dimensions_of_Euro_pillows", "passage_text": "The Euro (symbol '€') is the single currency of The European Union. It is the currency of 17 European Union members (Austria, Belgium, Cyprus, Estonia, Finland, France, Ge … rmany, Greece, Ireland, Italy, Luxembourg, Malta, The Netherlands, Portugal, Slovakia, Slovenia and Spain). # Step 2  For the back of the Euro sham, cut two pieces of fabric, each 27 inches wide by 15 1/2 inches tall, or the same width as the front piece and half the height plus 2 inches."}]