[{"url": "http://www.answers.com/Q/How_many_chromosomes_in_a_somatic_cell_from_a_mule", "passage_text": "Mules are a mix between a horse, which has 62 chromosomes, and a donkey, which has 64 chromosomes. Therefore mules have 63 chromosomes in their somatic cells."}, {"url": "http://medical-dictionary.thefreedictionary.com/somatic+chromosome", "passage_text": "The normal diploid number of chromosomes is constant for each species. For humans, the diploid number is 46 (23 pairs in all somatic cells). In the formation of gametes (ovum and spermatozoon), the number is reduced to one half (haploid number); i.e., the ovum and sperm each contain 23 chromosomes."}, {"url": "http://www.answers.com/Q/How_many_chromosomes_in_a_somatic_cell_from_a_mule", "passage_text": "Gametes, on the other han … d, are haploid (n), with a single set of chromosomes, ie. half as many as the somatic cell. Now, the haploid chromosome number (n) is characteristic of the species, and in humans this number happens to be 23."}, {"url": "http://www.answers.com/Q/How_many_chromosomes_do_you_have_in_your_somatic_cells", "passage_text": "Gametes, on the other han … d, are haploid (n), with a single set of chromosomes, ie. half as many as the somatic cell. Now, the haploid chromosome number (n) is characteristic of the species, and in humans this number happens to be 23."}, {"url": "http://www.answers.com/Q/How_many_chromosomes_in_a_somatic_cell_from_a_mule", "passage_text": "How many chromosomes in a somatic cell from a mule? already exists. already exists as an alternate of this question. exists and is an alternate of. When I'm not modeling or pursuing my acting career, you can find me _________. How would you fill in the blank? How many chromosomes are in a human somatic cell? How many chromosomes does a chicken ..."}, {"url": "http://www.wisegeek.org/what-are-somatic-cells.htm", "passage_text": "Germ cells each contain 23 chromosomes. When an egg and sperm fuse to produce a zygote, the new cell therefore has the full complement of 46, with one set of 23 from the egg and one from the sperm. All of the somatic cells that develop from the zygote have the same 46"}, {"url": "http://www.answers.com/Q/How_many_chromosomes_do_you_have_in_your_somatic_cells", "passage_text": "46 chromosomes are there in a human somatic cell. 22 pairs of homologous chromosomes are there with one pair of XX (in case of females) and one pair of XY (in case of males). Hence, 22 pairs of chromosomes + one pair of XX/XY chromosomes gives 23 pairs of chromosomes, i.e., 46 chromosomes."}, {"url": "http://medical-dictionary.thefreedictionary.com/somatic+chromosome", "passage_text": "Each organism of a species is normally characterized by the same number of chromosomes in its somatic cells. The diploid numbers (number of total chromosomes per cell) are cattle—60, sheep—54, horse—64, donkey—62, pig—38, dog—78, cat—38, human—46."}, {"url": "http://medical-dictionary.thefreedictionary.com/somatic+chromosome", "passage_text": "Each organism of a species is normally characterized by the same number of chromosomes in its somatic cells, 46 being the number normally present in humans, including 22 pairs of autosomes and the two sex chromosomes (XX or XY), which determine the sex of the organism."}]