[{"url": "https://www.weldingschool.com/blog/pipefitting/what-does-a-pipefitter-do/", "passage_text": "Essentially, a pipefitter 1 is the person responsible for maintaining a variety of piping and plumbing systems. These systems might be used to transport liquids such as water, chemicals, or gasses. Skills You’ll Learn as a Pipefitter. As a pipefitter, you may read blueprints, perform calculations, and use a variety of tools including blowtorches, measuring tapes, saws, and pipe benders on a daily basis. Training in these areas and in using these tools is essential to landing a job as a pipe fitter."}, {"url": "http://www.wisegeek.com/what-is-a-pipefitter.htm", "passage_text": "Pipefitters are also responsible for the installation and maintenance of automated control devices used in various types of mechanical piping assemblies. A pipefitter is sometimes referred to as a steamfitter to avoid being confused with a plumber. Unlike a plumber, a pipefitter can fabricate pipes, as well as install and maintain them. Some pipefitters are are specially trained to work in distilleries and breweries. A person who wants to become a pipefitter must complete all classroom training requirements, which includes welding."}, {"url": "http://www.local562.org/about.aspx?zone=About&pID=3689", "passage_text": "A pipefitter journeyman (once referred to as a steamfitter), through his formal training and field experience, has a clear understanding of the theory, installation, and the practical application of steam systems. The ability to assemble industrial piping modules, high pressure piping systems, food grade, and high purity systems is dependent upon the skills and abilities of the welder. The pipefitter apprentice undergoes a thorough and technically advanced welding program."}, {"url": "https://en.wikipedia.org/wiki/Pipefitter", "passage_text": "A pipefitter is a tradesperson who installs, assembles, fabricates, maintains and repairs mechanical piping systems. Pipefitters usually begin as helpers or apprentices. Journeyman pipefitters deal with industrial/commercial/marine piping and heating/cooling systems. Pipefitters install, assemble, fabricate, maintain, repair and troubleshoot mechanical piping systems carrying fuel, chemicals, water, steam and air in heating, cooling, lubricating and various other process"}, {"url": "http://www1.salary.com/Pipefitter-salary.html", "passage_text": "For example the median expected annual pay for a typical Pipefitter in the United States is $43,381 so 50% of the people who perform the job of Pipefitter in the United States are expected to make less than $43,381. Source: HR Reported data as of October 2015. Median $43,381. "}, {"url": "http://work.chron.com/pay-scale-pipefitter-welder-10731.html", "passage_text": "Welder and pipefitter are actually two separate careers, though some welders may be pipefitters and vice versa. Welders primarily fuse metal parts together, working on construction projects and for manufacturers. Job Outlook. The number of jobs for welders and pipefitters is expected to increase by 15 and 26 percent, respectively, between 2010 and 2020, according to BLS data. Jobs for welders will be primarily driven by a growing economy, especially in manufacturing and oil production."}, {"url": "http://www.local562.org/about.aspx?zone=About&pID=3689", "passage_text": "Generally, the Pipefitter is responsible for all aspects of installing and maintaining pipe systems, pipe supports, and related hydraulic and pneumatic equipment for steam, hot water, heating, cooling, lubricating, and industrial production and processing systems. The ability to assemble industrial piping modules, high pressure piping systems, food grade, and high purity systems is dependent upon the skills and abilities of the welder. The pipefitter apprentice undergoes a thorough and technically advanced welding program."}, {"url": "http://www.local562.org/about.aspx?zone=About&pID=3689", "passage_text": "Today's pipefitter installs refrigeration systems, process piping and equipment of every description, performs site work, and provides building and industrial maintenance, HVAC services and maintenance, and building automation in the residential, commercial and industrial sectors of the marketplace. The ability to assemble industrial piping modules, high pressure piping systems, food grade, and high purity systems is dependent upon the skills and abilities of the welder. The pipefitter apprentice undergoes a thorough and technically advanced welding program."}, {"url": "http://www.wisegeek.com/what-is-a-pipefitter.htm", "passage_text": "These 10 facts about space will blow your mind. A pipefitter is a worker who is responsible for the installation and maintenance of high pressure mechanical piping systems. These systems are typically used for moving liquids and gases in buildings, marine vessels, aircraft, and industrial process plants. Unlike a plumber, a pipefitter can fabricate pipes, as well as install and maintain them. Some pipefitters are are specially trained to work in distilleries and breweries. A person who wants to become a pipefitter must complete all classroom training requirements, which includes welding."}, {"url": "http://www.wisegeek.com/what-is-a-pipefitter.htm", "passage_text": "Pipefitters, or steamfitters, are responsible for installing piping systems. Unlike a plumber, a pipefitter can fabricate pipes, as well as install and maintain them. Some pipefitters are are specially trained to work in distilleries and breweries. A person who wants to become a pipefitter must complete all classroom training requirements, which includes welding."}]