[{"url": "https://en.wikipedia.org/wiki/Virus", "passage_text": "Most virus species have virions that are too small to be seen with an optical microscope. The average virion is about one one-hundredth the size of the average bacterium. Viruses spread in many ways; viruses in plants are often transmitted from plant to plant by insects that feed on plant sap, such as aphids; viruses in animals can be carried by blood-sucking insects. These disease-bearing organisms are known as vectors. Influenza viruses are spread by coughing and sneezing."}, {"url": "https://en.wikipedia.org/wiki/Reverse_transcriptase", "passage_text": "A Reverse transcriptase (RT) is an enzyme used to generate complementary DNA (cDNA) from an RNA template, a process termed reverse transcription. It is mainly associated with retroviruses. Telomerase is another reverse transcriptase found in many eukaryotes, including humans, which carries its own RNA template; this RNA is used as a template for DNA replication."}, {"url": "https://en.wikipedia.org/wiki/Virus", "passage_text": "HIV is one of several viruses transmitted through sexual contact and by exposure to infected blood. The range of host cells that a virus can infect is called its  host range . This can be narrow, meaning a virus is capable of infecting few species, or broad, meaning it is capable of infecting many. Viruses spread in many ways; viruses in plants are often transmitted from plant to plant by insects that feed on plant sap, such as aphids; viruses in animals can be carried by blood-sucking insects. These disease-bearing organisms are known as vectors. Influenza viruses are spread by coughing and sneezing."}, {"url": "http://www.shmoop.com/microorganisms-viruses/virus-genomes.html", "passage_text": "Well, it gets worse. While most genomes are non-segmented (the genome is all on one piece of RNA or DNA), some genomes are segmented, meaning there are several fragments of DNA/RNA that make a complete virus genome. Also, some genomes are linear, meaning that there is a beginning and end to the genome, while other genomes are circular (no beginning and no end, Kind of like that friendship song, except by friends we mean piles of microscopic goo)."}, {"url": "https://en.wikipedia.org/wiki/Virus", "passage_text": "A virus is a small infectious agent that replicates only inside the living cells of other organisms. Viruses can infect all types of life forms, from animals and plants to microorganisms, including bacteria and archaea. Viruses spread in many ways; viruses in plants are often transmitted from plant to plant by insects that feed on plant sap, such as aphids; viruses in animals can be carried by blood-sucking insects. These disease-bearing organisms are known as vectors. Influenza viruses are spread by coughing and sneezing."}, {"url": "https://en.wikipedia.org/wiki/Reverse_transcriptase", "passage_text": "Reverse transcriptase enzymes include an RNA-dependent DNA polymerase and a DNA-dependent DNA polymerase, which work together to perform transcription. In addition to the transcription function, retroviral reverse transcriptases have a domain belonging to the RNase H family which is vital to their replication. Telomerase is another reverse transcriptase found in many eukaryotes, including humans, which carries its own RNA template; this RNA is used as a template for DNA"}, {"url": "http://www.mayomedicallaboratories.com/interpretive-guide/?alpha=H&unit_code=88634", "passage_text": "A quantitative result expressed in IU/mL and log IU/mL indicates the degree of active HBV viral replication in the patient. Monitoring HBV DNA levels over time is important for assessing disease progression or monitoring a patient's response to anti-HBV therapy. This test is not licensed by the FDA as a screening test for hepatitis B virus (HBV) infections or a diagnostic test to confirm the presence of HBV infection. Laboratory evaluation of HBV infection status should begin with HBV serologic testing, including testing for the presence of hepatitis B surface antigen."}, {"url": "http://www.nanowiki.no/wiki/Virus:_Shapes_and_structure,_life_cycle", "passage_text": "The viral genome. The viral genome of a virus is a nucleic acid, DNA or RNA. It can be double-stranded (ds) or single-stranded(ss), and it might have a sense. The sense is a property possessed by some nucleic acids, the ssRNA. The structure of a simple virus consists of a protein shell and a viral genome. The size of an ordinary virus usually varies from 10 to 300 nm and it is composed of a viral genome and a capsid. Sometimes there is also an enveloppe. More complex viruses also occur, with two protein shells for example"}, {"url": "https://labtestsonline.org/understanding/analytes/viral-load/tab/test", "passage_text": "In someone who is being treated for HIV/AIDS, it means that the treatment is not effective. During treatment and monitoring, a high viral load can be anywhere from 5,000 to 10,000 copies/mL. A low viral load is usually between 40 to 500 copies/mL, depending on the type and sensitivity of the test used. This result indicates that HIV is not actively reproducing and that the risk of disease progression is low. An undetectable viral load in someone who has a diagnosed HIV infection does not mean that the person is cured; it means only that the level of HIV RNA is currently below the threshold needed for detection. Changes in viral load can often be more important during HIV monitoring than a single test result."}]