[{"url": "http://finalfantasy.wikia.com/wiki/Geomancer_(Tactics)", "passage_text": "Elemental/Geomancy Edit. Geomancy, also known as Elemental, is a Geomancer's command ability. In Final Fantasy Tactics, every tile in the battlefield is designated a specific type of terrain to determine which Geomancy ability will be used. It is a balanced Job in the physical classes, similar to Samurai, but more defensive. The Geomancer has the action ability Geomancy to bend the earth itself to attack and inflicts an ailment to the targets within a certain range. It costs 2,870 JP to master this Job."}, {"url": "http://finalfantasy.wikia.com/wiki/Geomancer", "passage_text": "Main article: Geomancer (Final Fantasy III). Gained from the Water Crystal in the original and from the Fire Crystal in the DS version, Geomancers have the ability to use the terrain as a weapon, with the effects changing depending on the type of battle field. They can walk across dungeons without fear of traps like pitfalls, or damaging floors like lava. Their signature skill is Terrain, which lets the Geomancer execute special attacks based on the terrain the party is fighting on."}, {"url": "http://thegeomancer.netfirms.com/geomancy.htm", "passage_text": "Geomancy is the practice of identifying subtle energies, or 'earth radiations' that directly affect our health and well-being. It involves identifying those energies that are disruptive to our lives and balancing them. The Geomancer performs a geopathic stress analysis of your environment, and identifies and facilitates clearing, stabilizing or shielding negative Earth Energies, EMFs, Technological and Metaphysical Energies."}, {"url": "http://geomancygroup.org/geomancy/", "passage_text": "Geomancy literally means, “divining the Earth”. It is an art that analyses the subtle earth energies that ebb and flow throughout the landscape, influencing health and wealth; home, garden and office alike. Geomancy works harmoniously with these energies to enhance our relationship with Spirit and Place. This creates stability, acceptance by the spirit of the land, and very real anchor lines which allow energy flow between the structure and surrounding landscape.”. –Ivan McBeth. Every culture has ancient geomantic traditions – the Chinese tradition is feng-shui."}, {"url": "https://en.wikipedia.org/wiki/Geomancy", "passage_text": "Isidore of Seville lists geomancy with other methods of divination including pyromancy, hydromancy, aeromancy, and necromancy without describing its application or methods; it could be that Isidore of Seville was listing methods of elemental scrying more than what is commonly known as geomancy. It can also involve a mouse as the agent of the earth spirit. Ifa, ifá one of the oldest forms of, geomancy originated In West, africa and uses the same sixteen geomantic figures as In arabic And western geomancy with different meanings and; names the process is shortened to using only two. figures"}, {"url": "https://en.wikipedia.org/wiki/Geomancy", "passage_text": "In Renaissance magic, geomancy was classified as one of the seven forbidden arts, along with necromancy, hydromancy, aeromancy, pyromancy, chiromancy (palmistry), and spatulamancy (scapulimancy). Geomancy is dismissed by the scientific community and skeptics as being superstition. It can also involve a mouse as the agent of the earth spirit. Ifa, ifá one of the oldest forms of, geomancy originated In West, africa and uses the same sixteen geomantic figures as In arabic And western geomancy with different meanings and; names the process is shortened to using only two. figures"}, {"url": "https://en.wikipedia.org/wiki/Geomancy", "passage_text": "Geomancy, from Ancient Greek geōmanteia geōmanteía translates literally to foresight by; earth it is a translation of The arabic ‛term ilm-al, raml or the science of the. Sand Earlier greek renditions of this word borrowed the word (raml) sand, directly rendering it as rhamplion or. rabolion It can also involve a mouse as the agent of the earth spirit. Ifa, ifá one of the oldest forms of, geomancy originated In West, africa and uses the same sixteen geomantic figures as In arabic And western geomancy with different meanings and; names the process is shortened to using only two. figures"}, {"url": "http://renaissanceastrology.com/astrologicalgeomancy.html", "passage_text": "The word geomancy means earth divination and is believed to have come from the use of sand to generate the geomantic figures, the basis of prediction in geomancy. This also accounts for its Arabic name, ilm al-raml, literally the science or wisdom of the sand. Because of its close connection to astrology, geomancy has been called the Daughter of Astrology and known as terrestial astrology. The 16 Geomantic Figures TOP 16 Geomantic Figures The basis of geomancy is the 16 geomantic figures, composed of 4 rows of either one or two points."}, {"url": "https://en.wikipedia.org/wiki/Geomancy", "passage_text": "Geomancy (Greek: γεωμαντεία, earth divination) is a method of divination that interprets markings on the ground or the patterns formed by tossed handfuls of soil, rocks, or sand. It can also involve a mouse as the agent of the earth spirit. Ifa, ifá one of the oldest forms of, geomancy originated In West, africa and uses the same sixteen geomantic figures as In arabic And western geomancy with different meanings and; names the process is shortened to using only two. figures"}, {"url": "http://finalfantasy.wikia.com/wiki/Geomancer", "passage_text": "Etymology Edit. [view · edit · purge] Geomancy (Greek: γεωμαντεία, earth divination) is a method of divination that interprets markings on the ground or the patterns formed by tossed handfuls of soil, rocks, or sand. Geomancy is derived from the roots geo- (Earth) and-mancy (prophecy). They can walk across dungeons without fear of traps like pitfalls, or damaging floors like lava. Their signature skill is Terrain, which lets the Geomancer execute special attacks based on the terrain the party is fighting on."}]