[{"url": "http://www.simplyhired.com/salaries-k-actor-jobs.html", "passage_text": "Average Actor Salaries. The average salary for actor jobs is $53,000. Average actor salaries can vary greatly due to company, location, industry, experience and benefits. This salary was calculated using the average salary for all jobs with the term actor anywhere in the job listing"}, {"url": "http://work.chron.com/annual-entry-wage-being-actor-7466.html", "passage_text": "Median Wage. According to the U.S. Department of Labor, the annual median wage for actors is $19.14 per hour. This is the equivalent of $39,811.20 per year for a fulltime, 40- hour-per week actor. Rarely does an actor get a steady schedule of 40 hours per week, every single week. On average, it takes two to three months to shoot an entire feature film production. In this scenario, the average actor earns $24,350.40 for one shoot. If he shoots three productions per year, his annual entry wage is $73,051.20. An entry-level background actor can expect pay of $145 to $160 per day, which is significantly lower than the reported annual mean. Entry-level day players can expect pay of $842 per day"}, {"url": "http://learn.org/articles/What_Is_the_Salary_Range_for_Actors.html", "passage_text": "These fields all can provide actors with varying salaries. For example, the BLS reported that actors employed at amusement parks and arcades made a low average wage of $18.66 per hour as of May 2012. Actors who worked in film, on the other hand, had a much higher hourly wage average of $44.61. Actors associated with performing arts companies earned a mean wage of $22.78 per hour in 2012, while radio and television actors averaged $31.25 per hour, per the BLS"}, {"url": "https://en.wikipedia.org/wiki/List_of_highest_paid_film_actors", "passage_text": "Salaries for the world's highest paid film actors currently range from $20–30 million, but an actor can earn substantially more by deferring all or part of their salary against a percentage of the film's gross, known within the industry as a profit participation deal. "}, {"url": "http://learn.org/articles/What_Is_the_Salary_Range_for_Actors.html", "passage_text": "According to the U.S. Bureau of Labor Statistics (BLS), the median hourly wage for actors as of May 2012 was $20.26 (www.bls.gov). The bottom ten percent of actors earned $8.92 per hour or less, while the top 25% of wage earners made an hourly wage of $44.86 or higher. Employment for this occupation was projected by the BLS to grow at a slower-than-average pace of four percent between 2012 and 2022. For example, the BLS reported that actors employed at amusement parks and arcades made a low average wage of $18.66 per hour as of May 2012. Actors who worked in film, on the other hand, had a much higher hourly wage average of $44.61."}, {"url": "http://www.mtv.com/news/1725308/actor-average-salary/", "passage_text": "Of the 155,740 actors, directors and producers included in the survey by the Department of Labor report, the average person made $89,000 in 2013, at the rate of $42.80 an hour. "}, {"url": "http://work.chron.com/typical-starting-average-salaries-actor-9953.html", "passage_text": "Averages. Actors averaged a mean $33.82 per hour in 2011, according to the BLS. The lowest-paid 10 percent made $8.79 hourly, and the highest-paid 10 percent earned over $90 hourly. Most worked in the motion picture and video industries to make a mean hourly $43.33. However, independent actors made the highest average pay at $45.39 per hour. Other typical employers and average salaries were performing arts companies, which offered $21.15 per hour, television broadcasting with $24.84 hourly and radio broadcasting with $24.83 per hour. On the opposite coast, the Hollywood area theater contract defined pay based on box office weekly gross and theater size. For example, actors in theaters with up to 199 seats whose productions earned $25,000 or less per week earned a minimum $343 per week."}, {"url": "http://www.payscale.com/research/US/Job=Actor_%2f_Actress/Salary", "passage_text": "Pay Difference by Location. Hollywood is home to an above-average pay rate for Actors and Actresses, 439 percent higher than the national average. Actors and Actresses will also find cushy salaries in Los Angeles (+28 percent). Median of all compensation (including tips, bonus, and overtime) by years of experience. The average beginner in this position makes around $45K, but folks who have been around for five to 10 years see a markedly higher median salary of $49K."}]