[{"url": "http://www.abpischools.org.uk/page/modules/dietanddigestion/diet2.cfm", "passage_text": "1 Digestion-breaking down the large insoluble food molecules into small soluble molecules. 2  Absorption-taking the soluble food molecules into the bloodstream. 3  Egestion-getting rid of any undigested food from the body in the form of faeces. "}, {"url": "http://healthyeating.sfgate.com/body-absorb-carbohydrates-lipids-fats-proteins-8943.html", "passage_text": "Carbohydrates are your body's preferred energy source and are found in the forms of starch, sugar and fiber. Digestion begins in your mouth where the process of chewing mechanically breaks food into small pieces. Enzymes in the saliva initiate chemical digestion. "}, {"url": "http://www.bbc.co.uk/bitesize/ks3/science/organisms_behaviour_health/diet_drugs/revision/5/", "passage_text": "Fats. Lipase enzymes break down fat into fatty acids and glycerol. Digestion of fat in the small intestine is helped by bile, made in the liver. Bile breaks the fat into small droplets that are easier for the lipase enzymes to work on. Proteins. Proteins are digested in the stomach and small intestine. Protease enzymes break down proteins into amino acids. Digestion of proteins in the stomach is helped by stomach acid, which is strong hydrochloric acid. This also kills harmful micro-organisms that may be in the food."}, {"url": "http://www.whfoods.com/genpage.php/genpage.php?tname=faq&dbid=16", "passage_text": "In addition, around eight to 10 liters of fluid is also absorbed in the small intestine each day. Complex carbohydrates that resist the enzyme degradation, such as fiber and resistant starch, remain, as do a small amount of other food molecules and nutrients that have escaped the digestion process. "}, {"url": "http://www.bbc.co.uk/bitesize/ks3/science/organisms_behaviour_health/diet_drugs/revision/5/", "passage_text": "Carbohydrates. Carbohydrates are digested in the mouth, stomach and small intestine. Carbohydrase enzymes break down starch into sugars. The saliva in your mouth contains amylase, which is another starch digesting enzyme. Proteins. Proteins are digested in the stomach and small intestine. Protease enzymes break down proteins into amino acids. Digestion of proteins in the stomach is helped by stomach acid, which is strong hydrochloric acid. This also kills harmful micro-organisms that may be in the food."}, {"url": "https://answers.yahoo.com/question/index?qid=20061124221524AAfT21r", "passage_text": "3/ Amylase speeds up digestion of maltose into two glucose molecules, Protease breaks down proteins. The final breakdown of proteins are amino acids. 4/ The body cannot use whole food products, so lipids, carbs, and proteins must be broken down to be asborbed in to the blood. 2. most of the contents of the small intestine are liquid as broken down food is absorbed by the villi, but large food particles also go through on their way to the large intestine. 3. Amylase speed up the digestion of STARCH."}, {"url": "https://answers.yahoo.com/question/index?qid=20061124221524AAfT21r", "passage_text": "Best Answer: 1. starch is digested by your saliva which breaks it down into sugars. 2. most of the contents of the small intestine are liquid as broken down food is absorbed by the villi, but large food particles also go through on their way to the large intestine. 3. Amylase speed up the digestion of STARCH."}, {"url": "http://www.answers.com/Q/Why_do_starch_protein_and_fat_need_to_be_digested", "passage_text": "starch is digested in the mouth by the enzyme carbohydrase (amylase), which digests them into dextrines (sugars or glocuse). protein is digested in the stomach by the enzyme … protease, which converts them into amino acids. fats are digested in the duodenum (small intestine) with bile (from liver) and the enzyme lipase, which digests them into glycerol and fatty acids. The digestion of fat will begin in the small intestine, whereas the digestion of starch which begin in the mouth (the mouth contains the enzyme amylase, which helps break down … starch)."}, {"url": "http://www.livestrong.com/article/488214-starch-and-digestion/", "passage_text": "Starch is the main form of dietary, digestible carbohydrates. The process of digestion involves the breakdown of a complex molecule into the simplest form the body can use. Once the starch molecule is broken down, the small intestine transfers it into the bloodstream, where it is shuttled to the cells that need it. Starch digestion is a multi-step process that begins in the mouth. The goal of digestion is the breakdown of nutrients into their simplest, usable form by the body"}]