[{"url": "http://www.healthline.com/health/mastoidectomy", "passage_text": "A mastoidectomy is performed to remove diseased mastoid air cells. These cells sit in a hollow space in the skull, behind the ear. The diseased cells are often the result of an ear infection that has spread into the skull. Sometimes the infection spreads onto the temporal bone."}, {"url": "http://www.nhs.uk/conditions/mastoiditis/Pages/Introduction.aspx", "passage_text": "Mastoiditis is a serious bacterial infection that affects the mastoid bone behind the ear. It's usually more common in children, although adults can also sometimes be affected. The mastoid bone has a honeycomb-like structure that contains air spaces called mastoid cells."}, {"url": "https://www.nlm.nih.gov/medlineplus/ency/article/001034.htm", "passage_text": "Causes. Mastoiditis is most often caused by a middle ear infection (acute otitis media). The infection may spread from the ear to the mastoid bone. The bone has a honeycomb-like structure that fills with infected material and may break down. The condition is most common in children."}, {"url": "http://www.chop.edu/conditions-diseases/mastoiditis", "passage_text": "Mastoiditis is usually a result of an extension of the inflammation of the middle ear infection into the mastoid air cells. A child with mastoiditis usually has a history of having a recent ear infection or has middle ear infections that continue to reoccur."}, {"url": "http://www.webmd.com/cold-and-flu/ear-infection/mastoiditis-symptoms-causes-treatments", "passage_text": "Mastoiditis Causes. As mentioned above, mastoiditis most often develops as a result of a middle ear infection. Bacteria from the middle ear can travel into the air cells of the mastoid bone. In addition, a type of skin cyst in the middle ear, called a cholesteatoma, may block drainage of the ear, leading to mastoiditis."}, {"url": "http://www.chop.edu/conditions-diseases/mastoiditis", "passage_text": "Mastoiditis. Mastoiditis is an inflammation or infection of the mastoid bone, which is a portion of the temporal bone. The mastoid consists of air cells that drain the middle ear. Mastoiditis can be a mild infection or can develop into life-threatening complications."}, {"url": "http://www.webmd.com/cold-and-flu/ear-infection/mastoiditis-symptoms-causes-treatments", "passage_text": "Mastoiditis is a bacterial infection of the mastoid bone. The mastoid bone, which sits behind the ear, consists of air spaces that help drain the middle ear. When the mastoid cells become infected or inflamed, often as a result of an unresolved middle ear infection (otitis media), mastoiditis can develop."}]