[{"url": "http://www.simplyhired.com/salaries-k-assistant-manager-journeys-jobs.html", "passage_text": "The average salary for assistant manager journeys jobs is $36,000."}, {"url": "http://www.indeed.com/cmp/Journeys/salaries", "passage_text": "Average Journeys hourly pay ranges from approximately $7.35 per hour for Sales Representative to $14.00 per hour for Store Manager. The average Journeys salary ranges from approximately $16,400 per year for Retail Sales Associate to $105,000 per year for District Manager. Salary information comes from 322 data points collected directly from employees, users, and jobs on Indeed."}, {"url": "http://www.answers.com/Q/How_much_money_does_a_Store_Manager_earn_from_Journey's", "passage_text": "Depends on the region I suppose. As a Journeys Store Manager I made $250 a week salary plus 10% commission and a percentage of the store monthly. It also depends on how much you and your team sell. My checks (bi-weekly) were anywhere from $650 to $850 usually, sometimes more during peak holidays."}, {"url": "http://www.answers.com/Q/How_much_money_does_a_Store_Manager_earn_from_Journey's", "passage_text": "As a Journeys Store Manager I made $250 a week salary plus 10% commission and a percentage of the store monthly. It also depends on how much you and your team sell. My checks (bi-weekly) were anywhere from $650 to $850 usually, sometimes more during peak holidays."}, {"url": "http://www.simplyhired.com/salaries-k-assistant-manager-journeys-jobs.html", "passage_text": "Average Assistant Manager Journeys Salaries. The average salary for assistant manager journeys jobs is $36,000. Average assistant manager journeys salaries can vary greatly due to company, location, industry, experience and benefits."}, {"url": "http://www1.salary.com/Retail-Store-Manager-Assistant-salary.html", "passage_text": "For example the median expected annual pay for a typical Retail Store Manager Assistant in the United States is $40,243, so 50% of the people who perform the job of Retail Store Manager Assistant in the United States are expected to make less than $40,243."}]