[{"url": "http://www.livescience.com/37277-easter-island-statues-walked-there.html", "passage_text": "Rapa Nui's majestic rock statues (also known as Stone Heads of Easter Island) have been a mystery since Europeans first arrived in the 1700s on the island, located in the Pacific Ocean off the west coast of Chile. "}, {"url": "https://www.easterisland.travel/easter-island-facts-and-info/moai-statues/", "passage_text": "Easter Island moai statues with heads visible in quarry Rano Raraku. Moai statues are massive megaliths at Easter Island, and these are what this island is famous for. The moais were built in approximately 1400 - 1650 A.D. by the natives of this island also known as Rapa Nui. Many know them as the."}, {"url": "http://www.bradshawfoundation.com/easter/sentinels_in_stone.php", "passage_text": "The Rise & Fall of Easter Island's Culture. The giant stone statues of Easter Island, called moai, have brought the island reknown and have fascinated scores of scholars, travellers and artists. Their distinctive stone faces appear locked in silence; Sentinels in Stone that convey both power and tragedy. "}, {"url": "http://www.sciencekids.co.nz/sciencefacts/earth/easterisland.html", "passage_text": "Learn about the amazing moai statues found on the island, where the island is located, how the Polynesian population has faired throughout history and much more. Easter Island, also called Rapa Nui, is a Polynesian island in the Pacific Ocean. The island became a special territory of Chile in 1888. Easter Island is famous for having 887 massive statues, called moai, which were sculpted and erected by the early Rapa Nui people. In 1995, Easter Island became a UNESCO World Heritage Site, with most of the island protected in the Rapa Nui National Park. Easter Island had around 5,800 residents in 2012. "}, {"url": "http://www.huffingtonpost.com/2013/06/10/easter-island-heads-walking-stone-theory_n_3411650.html", "passage_text": "Ancient enigma. Rapa Nui's majestic rock statues (also known as Stone Heads of Easter Island) have been a mystery since Europeans first arrived in the 1700s on the island, located in the Pacific Ocean off the west coast of Chile. "}, {"url": "https://en.wikipedia.org/wiki/Moai", "passage_text": "Nearly half are still at Rano Raraku, the main moai quarry, but hundreds were transported from there and set on stone platforms called ahu around the island's perimeter. Almost all moai have overly large heads three-eighths the size of the whole statue. "}, {"url": "http://www.easterislandquest.com/moai.htm", "passage_text": "Often called mo'ai, these are gigantic stone monoliths located on Easter Island (Rapa Nui). Contrary to what we most often believe heads are rather busts, many statues have shoulders, chest, even arms and a single one even has legs. About 900 moai statues are located on Easter Island. Most of them are at the Rano Raraku quarry placed around the island, along the shores, like they were put there to guard. Plural for the word moai is also moai. Moais is incorrect."}, {"url": "http://www.easterislandquest.com/moai.htm", "passage_text": "There are exactly 887 moai on Rapa Nui. 834 moai are made from tuff (compressed volcanic ash), 13 from basalt, 22 from trachyte, 17 from red scoria rock (which is a softer stone). A total of 288 moai were successfully transported to the ahu platforms. The Rapa Nui people build special connecting roads for this purpose. About 900 moai statues are located on Easter Island. Most of them are at the Rano Raraku quarry placed around the island, along the shores, like they were put there to guard. Plural for the word moai is also moai. Moais is incorrect."}, {"url": "https://en.wikipedia.org/wiki/Easter_Island", "passage_text": "Easter Island is famous for its 887 extant monumental statues, called moai, created by the early Rapa Nui people. In 1995, UNESCO named Easter Island a World Heritage Site, with much of the island protected within Rapa Nui National Park. The name Easter Island was given by the island's first recorded European visitor, the Dutch explorer Jacob Roggeveen, who encountered it on Easter Sunday (5 April) in 1722, while searching for Davis or David's island. Roggeveen named it Paasch-Eyland (18th century Dutch for Easter Island)."}, {"url": "https://en.wikipedia.org/wiki/Easter_Island", "passage_text": "The large stone statues, or moai, for which Easter Island is famous, were carved in the period 1100–1680 CE (rectified radio-carbon dates). A total of 887 monolithic stone statues have been inventoried on the island and in museum collections so far. The name Easter Island was given by the island's first recorded European visitor, the Dutch explorer Jacob Roggeveen, who encountered it on Easter Sunday (5 April) in 1722, while searching for Davis or David's island. Roggeveen named it Paasch-Eyland (18th century Dutch for Easter Island)."}]