[{"url": "http://www.ncbi.nlm.nih.gov/gene/7276", "passage_text": "This gene encodes transthyretin, one of the three prealbumins including alpha-1-antitrypsin, transthyretin and orosomucoid. Transthyretin is a carrier protein; it transports thyroid hormones in the plasma and cerebrospinal fluid, and also transports retinol (vitamin A) in the plasma."}, {"url": "http://www.merriam-webster.com/medical/transthyretin", "passage_text": "Medical Definition of TRANSTHYRETIN. : a protein component of blood serum that functions especially in the transport of thyroxine—called also prealbumin."}, {"url": "http://ghr.nlm.nih.gov/condition/transthyretin-amyloidosis", "passage_text": "Transthyretin amyloidosis is a slowly progressive condition characterized by the buildup of abnormal deposits of a protein called amyloid (amyloidosis) in the body's organs and tissues."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=38464", "passage_text": "Transthyretin: A plasma protein consisting of 127 amino acids that binds retinol and thyroxine. The gene TTR that encodes transthyretin is in chromosome region 18q11.2-q12.1. Many distinct forms of amyloidosis have been related to different point mutations in TTR."}, {"url": "http://ghr.nlm.nih.gov/gene/TTR", "passage_text": "The TTR gene provides instructions for producing a protein called transthyretin. This protein transports vitamin A (retinol) and a hormone called thyroxine throughout the body. To transport thyroxine, four transthyretin proteins must be attached (bound) to each other to form a four-protein unit (tetramer)."}, {"url": "http://ghr.nlm.nih.gov/condition/transthyretin-amyloidosis", "passage_text": "Transthyretin transports vitamin A (retinol) and a hormone called thyroxine throughout the body. To transport retinol and thyroxine, four transthyretin proteins must be attached (bound) to each other to form a four-protein unit (tetramer). Transthyretin is produced primarily in the liver."}, {"url": "http://ghr.nlm.nih.gov/gene/TTR", "passage_text": "other disorders-associated with the TTR gene. In elderly people, deposits of transthyretin protein cause a condition called senile systemic amyloidosis. People with this condition do not have a mutation in the TTR gene; for reasons that are unclear, the transthyretin protein abnormally begins to form protein deposits."}, {"url": "http://ghr.nlm.nih.gov/gene/TTR", "passage_text": "transthyretin amyloidosis-caused by mutations in the TTR gene. More than 100 mutations in the TTR gene have been found to cause transthyretin amyloidosis. Nearly all of these mutations change one protein building block (amino acid) in the transthyretin protein."}]