[{"url": "http://www.edibleweedsandthings.com/edible-weeds/broadleaf-plantain-plantago-major/", "passage_text": "Broadleaf plantain has long been used medicinally as poultices, ointments, and teas. Because of its high tannin content, broadleaf plantain can be used, in poultice form, as an astringent to draw skin tissue together and stop bleeding. It can be used to treat bee stings, cuts, burns, sores, and to reduce inflammation. The leaves may grow up to about 6 inches long and 4 inches wide. Long, thick green-flowered shoots grow out of the center of the plant followed by a small seedpod with about 5 or 6 small black / brown seeds. Edible Parts. All parts of the broadleaf plantain are edible. The leaves, shoots, flowers, root, and seeds. The oval-shaped leaves can be eaten cooked or raw and are tastiest when they are small and tender, usually in the early spring. The bigger leaves are good but are a bit more fibrous and bitter"}, {"url": "http://www.ediblewildfood.com/broadleaf-plantain.aspx", "passage_text": "Broadleaf plantain is packed with nutrients and is safe to ingest. If a person chomps on some fresh leaves, these can be applied to the skin to treat minor burns, insect bites or open wounds. - click to play video -. Distinguishing Features: Broadleaf plantain has green, oval to egg-shaped leaves that grow in a rosette. These leaves have thick stems that meet at a base. When these stems are broken, they reveal string-like veins that resemble those in celery. Fields of Nutrition has medicinal benefits and vitamin/mineral content of Broadleaf Plantain. Leaves: The leaves grow in a rosette and can range from 5 to 30 cm in length. Plantain leaves have stems that contain string-like veins and these veins are seen on the leaf."}, {"url": "https://en.wikipedia.org/wiki/Plantago_major", "passage_text": "Plantago major (broadleaf plantain or greater plantain) is a species of plantago, family Plantaginaceae. The plant is native to most of Europe and northern and central Asia, but has widely naturalised elsewhere in the world. Plantago major is an herbaceous perennial plant with a rosette of leaves 15–30 cm in diameter. Each leaf is oval-shaped, 5–20 cm long and 4–9 cm broad, rarely up to 30 cm long and 17 cm broad, with an acute apex and a smooth margin; there are five to nine conspicuous veins."}, {"url": "http://www.youtube.com/watch?v=2gGz17EbOzo", "passage_text": "The fruit is a two-celled capsule and containing four to sixteen seeds. Gather young edible Broadleaf Plantain leaves in spring. Gather Plantain after flower spike forms, dry for later herb use. The young leaves of the Broadleaf Plantain plant are edible as a raw salad or cooked as spinach. Broadleaf Plantain contains Acubin which is reported to be a powerful anti-toxin."}, {"url": "http://wildutahedibles.com/Common-Plantain.php", "passage_text": "Details: Broadleaf plantain is a very helpful medicinal plant. This is also one that is edible (though often not real palatable) so there is no real worry about toxicity from eating this plant. Of course since it is usually bitter it is not likely anybody would eat a lot of it anyway. "}, {"url": "http://www.ediblewildfood.com/broadleaf-plantain.aspx", "passage_text": "Broadleaf Plantain is a perennial broadleaf plant that grows in many locations from spring to autumn. Not only is this a vital wild edible plant for overall good health, this wild weed can be used to treat chronic diarrhea as well as digestive tract disorders. Fields of Nutrition has medicinal benefits and vitamin/mineral content of Broadleaf Plantain. Leaves: The leaves grow in a rosette and can range from 5 to 30 cm in length. Plantain leaves have stems that contain string-like veins and these veins are seen on the leaf."}, {"url": "http://theprepperproject.com/plantain-edible-medicinal-weed/", "passage_text": "Left: Broadleaf Plantain; Right: Narrowleaf Plantain. Plantain leaves form a rosette, growing out from the center-point. Broadleaf plantain has oval shaped leaves, while the Narrowleaf variety has lance-shaped leaves. The backside of Narrowleaf Plantain. Notice the prominent veins. Both have prominent veins running parallel from the base to the tip of the leaf."}, {"url": "https://en.wikipedia.org/wiki/Plantago_major", "passage_text": "Broadleaf plantain is also a highly nutritious wild edible, that is high in calcium and vitamins A, C, and K. The young, tender leaves can be eaten raw, and the older, stringier leaves can be boiled in stews and eaten. Plantago major is an herbaceous perennial plant with a rosette of leaves 15–30 cm in diameter. Each leaf is oval-shaped, 5–20 cm long and 4–9 cm broad, rarely up to 30 cm long and 17 cm broad, with an acute apex and a smooth margin; there are five to nine conspicuous veins."}]