[{"url": "http://www.today.com/food/make-burrito-bowl-recipe-chipotle-style-takeout-your-own-freezer-t13411", "passage_text": "Make your base components — spicy chicken, flavorful black beans and that irresistibly zippy rice — ahead of time, then refrigerate or freeze for pre-layered, ready-to-go burrito bowls you can microwave or reheat on the stovetop. Then top your warmed bowl with fresh tomato and/or corn salsa, sour cream and more. Bring the water, lime juice and lemon juice to a boil in a small (1 ½ to 2 quart) saucepan over medium heat. Add the salt and stir to dissolve, then stir in the rice. Cover and reduce the heat to low. Cook without stirring or uncovering the pot for about 20 minutes, until the rice is fluffy and has absorbed the liquid."}, {"url": "http://www.foodnetwork.com/recipes/food-network-kitchens/chipotle-chicken-burritos-recipe.html", "passage_text": "Add 1/2 cup pico de gallo, the chopped chipotle, and adobo sauce to taste; cook until the mixture starts to sizzle, about 2 minutes. Add the beans and 3/4 cup water; bring to a low boil, then stir in the chicken and cook until the mixture is slightly thickened, about 2 minutes. Stir in the cilantro and season with salt. "}, {"url": "http://www.today.com/food/make-burrito-bowl-recipe-chipotle-style-takeout-your-own-freezer-t13411", "passage_text": "Fresh ingredients, made to order, assembled just the way you like them — it's no wonder that Chipotle's endlessly customizable burrito bowls are a crazy popular option for a weekday office lunch or quick dinner. Bring the water, lime juice and lemon juice to a boil in a small (1 ½ to 2 quart) saucepan over medium heat. Add the salt and stir to dissolve, then stir in the rice. Cover and reduce the heat to low. Cook without stirring or uncovering the pot for about 20 minutes, until the rice is fluffy and has absorbed the liquid."}, {"url": "http://hip2save.com/2014/03/03/chipotle-inspired-cilantro-lime-black-bean-bowl/", "passage_text": "In a 2-quart heavy saucepan, heat oil or butter over low heat, stirring occasionally until melted. Add rice and lime juice, stir for 1 minute. Add water and salt and bring to a full rolling boil. At boiling, cover and turn down to simmer over low heat until rice is tender and the water is absorbed – about 25 minutes. Add in the cilantro and fluff rice with a fork."}, {"url": "http://hip2save.com/2014/03/03/chipotle-inspired-cilantro-lime-black-bean-bowl/", "passage_text": "1 cup Monterey Jack cheese. 1 cup black beans. 1/2 onion. 2 bell peppers, sliced. 1 cup corn. 1/2 head of lettuce, chopped. optional toppings: sour cream. avocado or guacamole. salsa. Directions: Saute sauté onion and bell peppers with a small amount of butter and season as. desired Add rice and lime juice, stir for 1 minute. Add water and salt and bring to a full rolling boil. At boiling, cover and turn down to simmer over low heat until rice is tender and the water is absorbed – about 25 minutes. Add in the cilantro and fluff rice with a fork."}, {"url": "http://www.today.com/food/make-burrito-bowl-recipe-chipotle-style-takeout-your-own-freezer-t13411", "passage_text": "Heat 1 tablespoon olive oil in a large skillet over medium heat and add about 1/4 of the marinated chicken cubes — don't crowd the pan, or the chicken will steam instead of brown. Cook, flipping after 2-3 minutes, until the chicken is cooked through, and transfer to a clean bowl or plate. Bring the water, lime juice and lemon juice to a boil in a small (1 ½ to 2 quart) saucepan over medium heat. Add the salt and stir to dissolve, then stir in the rice. Cover and reduce the heat to low. Cook without stirring or uncovering the pot for about 20 minutes, until the rice is fluffy and has absorbed the liquid."}, {"url": "http://www.recipechatter.com/how-to-make-a-chipotle-style-burrito-bowl-at-home/", "passage_text": "To Make the Chicken: 1  Add some oil of chose to a frying pan and toss chicken in. 2  Add 1/4 cup of water and entire package of fajita seasoning (you can also just follow the directions on that packet). 3  Toss and stir chicken until evenly coated, turn heat to low-med and simmer for another 5 to 8 minutes. 1 Add some oil of chose to a frying pan and toss chicken in. 2  Heat chicken on medium heat, stirring often to get chicken cooking evenly. 3"}, {"url": "http://www.recipelion.com/Cooking-Tips/How-To-Make-a-Chipotle-style-Burrito-Bowl-at-Home", "passage_text": "If you've ever wanted to learn how to make your own copycat recipes for Chipotle, this tutorial is exactly what you'll need. See How To Make a Chipotle-Style Burrito Bowl at Home and learn just how easy it can be. Follow the recipe exactly, or put your own twist into it. Add chopped cilantro, 1/4 cup of onions, lime juice, salsa or tomatoes and mix well. Add pepper to taste. To Assemble: Now that everything’s complete you can get large bowls for each person. Add in the following order: rice, black beans, chicken, corn, and cheese."}, {"url": "http://www.food.com/recipe/chipotle-style-chicken-burrito-bowls-299989", "passage_text": "Cook. I love those chicken burrito bowls at the restaurant Chipotle, and this version is just as good-to me and my family anyway! The recipe appears to be long, but it consists of mostly toppings. "}, {"url": "http://www.recipelion.com/Cooking-Tips/How-To-Make-a-Chipotle-style-Burrito-Bowl-at-Home", "passage_text": "To Make the Chicken: 1  Add some oil of chose to a frying pan and toss chicken in. 2  Add 1/4 cup of water and entire package of fajita seasoning (you can also just follow the directions on that packet). 3  Toss and stir chicken until evenly coated, turn heat to low-med and simmer for another 5 to 8 minutes. Add chopped cilantro, 1/4 cup of onions, lime juice, salsa or tomatoes and mix well. Add pepper to taste. To Assemble: Now that everything’s complete you can get large bowls for each person. Add in the following order: rice, black beans, chicken, corn, and cheese."}]