[{"url": "http://www.ecmag.com/section/systems/plenum-vs-non-plenum", "passage_text": "So after you choose fiber or copper, Category 5 or Category 5e, you still have another decision to make. It may seem like a minor one, but it is important nonetheless since plenum and non-plenum are so different. In this corner. Plenum-rated cable gets its name from an HVAC term—plenum spaces. The plenum spaces are those that lie between a drop and standard ceiling (or a similar version in the floor space) and it is this section where the air in a building circulates, thus aiding in heating and cooling functions. "}, {"url": "http://searchdatacenter.techtarget.com/definition/plenum", "passage_text": "A plenum may also be under a raised floor. In buildings with computer installations, the plenum space is often used to house connecting communication cables. Because ordinary cable introduces a toxic hazard in the event of fire, special plenum cabling is required in plenum areas."}, {"url": "http://homeguides.sfgate.com/plenum-hvac-system-87219.html", "passage_text": "A forced-air HVAC system distributes conditioned air through a plenum. A household forced-air heating, ventilation and air conditioning system depends on a system of ducts to provide a controlled path for distributing heated or cooled air throughout the home. The HVAC equipment has a blower that forces heated or cooled air into the supply plenum and from the plenum into the rooms through the supply duct system. Air-cleaning filters may be located in the supply plenum."}, {"url": "http://homeguides.sfgate.com/plenum-hvac-system-87219.html", "passage_text": "Return Plenum. Forced-air systems also have return ducts that connect to the HVAC equipment through an air-collection box known as a return plenum. As freshly conditioned air is blown out of the room supply ducts, “used” air from the rooms is sucked into the return ducts. The HVAC equipment has a blower that forces heated or cooled air into the supply plenum and from the plenum into the rooms through the supply duct system. Air-cleaning filters may be located in the supply plenum."}, {"url": "http://searchdatacenter.techtarget.com/definition/plenum", "passage_text": "In building construction, a plenum (pronounced PLEH-nuhm, from Latin meaning full) is a separate space provided for air circulation for heating, ventilation, and air-conditioning (sometimes referred to as HVAC) and typically provided in the space between the structural ceiling and a drop-down ceiling. In buildings with computer installations, the plenum space is often used to house connecting communication cables. Because ordinary cable introduces a toxic hazard in the event of fire, special plenum cabling is required in plenum areas."}, {"url": "https://en.wikipedia.org/wiki/Plenum_space", "passage_text": "A plenum space is a part of a building that can facilitate air circulation for heating and air conditioning systems, by providing pathways for either heated/conditioned or return airflows, usually at greater than atmospheric pressure. Vertical section through a commercial building without a plenum airspace. When both the supply and return ducts are constructed in this manner, it is possible to insulate the ducts and the dropped ceiling so that the upper airspace is not heated or cooled, increasing energy efficiency."}, {"url": "http://www.improvenet.com/r/costs-and-prices/return-air-plenums", "passage_text": "Return air plenums are the ducting units used as the central chamber for return air ducting. Furnaces and air handlers should have a return air plenum so that they can operate at their maximum efficiency. Return air plenums recycle the air in a structure back to the air handling unit and exhaust the air out of the home. Generally, a return air plenum will cost approximately $50 to $60 per unit. The other costs to consider are those for the labor and materials needed to install the return air plenum. The installation takes an average of about five hours with the sum of labor costs between $290 and $370."}, {"url": "http://www.hvac-for-beginners.com/hvac-duct.html", "passage_text": "Your hvac duct system is the heart of your home's heating and cooling system. Without a healthy system you could be wasting a lot of money. Like the human body, if the heart isn't healthy you are in trouble. A duct system provides a controlled path for air flow throughout the home. The two main types of supply systems are extended plenum and central plenum. A central plenum system is a system where all of the branch ducts start at the same location called a plenum. The extended plenum system consists of a supply air plenum which is connected to the outlet of the hvac equipment."}, {"url": "http://homeguides.sfgate.com/plenum-hvac-system-87219.html", "passage_text": "Supply Plenum. A plenum is an air-distribution box attached directly to the supply outlet of the HVAC equipment that heats or cools the air to make the house comfortable. The ductwork that distributes the heated or cooled air to individual rooms of the house connects to the plenum. The HVAC equipment has a blower that forces heated or cooled air into the supply plenum and from the plenum into the rooms through the supply duct system. Air-cleaning filters may be located in the supply plenum."}]