[{"url": "http://www.shh.org/outpatient-services/imaging/mri-mra-mrv.asp", "passage_text": "Magnetic resonance angiography (MRA) is a special type of MRI that examines arteries and their blood flow. Contrast material may be used to help see arteries more clearly. Magnetic resonance venography (MRV) is a special type of MRI that examines vein"}, {"url": "https://www.cedars-sinai.edu/Patients/Programs-and-Services/Imaging-Center/For-Patients/Exams-by-Procedure/MRI/Head-MRI-MRA-MRV.aspx", "passage_text": "The MRA and MRV are specifically designed to examine your blood vessels. Our team of specialists is led by Barry D. Pressman, MD, Chief of Neuroradiology, and by Franklin Moser, MD, Clinical Chief of Neuroradiology and Interventional Neuroradiology."}, {"url": "http://neurohealth.info/diagnostic-testing/mrimra-mrv", "passage_text": "Magnetic Resonance Imaging (MRI). Magnetic resonance uses a large circular magnet and radio frequencies to generate signals from atoms in the body. These signals are used to construct images of the brain and body organs. The MRI machine looks like a large box with an opening in the center."}, {"url": "http://www.webmd.com/brain/magnetic-resonance-imaging-mri-of-the-head", "passage_text": "Magnetic resonance imaging (MRI) is a test that uses a magnetic field and pulses of radio wave energy to take pictures of the head. In many cases, MRI gives information that can't be seen on an X-ray, ultrasound, or computed tomography (CT) scan."}, {"url": "http://neurohealth.info/diagnostic-testing/mrimra-mrv", "passage_text": "MRV and MRA examinations are similar to an MRI, but they focus exclusively on the venous and arterial blood vessels in the head and neck area. A strong magnetic field is used to evaluate blood flow patterns and blood vessel abnormalities."}, {"url": "http://www.webmd.com/brain/magnetic-resonance-imaging-mri-of-the-head", "passage_text": "Magnetic resonance imaging (MRI) of the head is done to: 1  Look for the cause of headaches. 2  Help diagnose a stroke or blood vessel problems in the head. 3  Problems with blood vessels may include an aneurysm or abnormal twisted blood vessels that are present at birth (this is called an arteriovenous [AV] malformation)."}, {"url": "http://www.hopkinsmedicine.org/healthlibrary/test_procedures/cardiovascular/magnetic_resonance_angiography_mra_135,14/", "passage_text": "You might be familiar with the testing procedure called magnetic resonance imaging (MRI) . In this test, radio waves, a magnetic field, and a computer create a scan of your body parts to look for health problems. Magnetic resonance angiography – also called a magnetic resonance angiogram or MRA – is a type of MRI that looks specifically at the body’s blood vessels."}, {"url": "http://codapedia.com/topicOpen.cfm?id=C23B1944-733D-414C-A3CEFBD0F4AE908C", "passage_text": "MRV stands for magnetic resonance venography. It is an MRI studies of the blood vessels. MRVs are used to assess abnormalities in the blood vessels of patients with a history of stroke, aneurysm, heart disease, and atherosclerotic vascular disease."}]