[{"url": "http://msmosites.com/dogloverstore/general/japanese-knotweed-toxic-dogs/", "passage_text": "It’s that time of year again! Flowers are blooming, the grass is growing, and those pesky Japanese Knotweeds are more invasive than ever. Japanese Knotweed is one of the most invasive weeds. No matter how many times you chop them down or pull out their roots they seem to find a way to keep popping up."}, {"url": "http://japaneseknotweed.com/japanese-knotweed-faqs/", "passage_text": "Japanese Knotweed. Japanese knotweed is one of the most invasive plants in the UK. It grows rapidly (over 1.5m in a month) and spreads easily by stem fragments and rhizomes (underground creeping stems). 1  Overview / Identification Notes. 2  Image Gallery."}, {"url": "http://www.ediblewildfood.com/japanese-knotweed.aspx", "passage_text": "Japanese Knotweed is known as Polygonum cuspidatum in North America, in Europe it is known as Fallopia japonica. It is a very tolerant plant and survives in a wide range of soil types. Its rhizomes can survive temperatures of −35 °C (−31 °F). "}, {"url": "http://www.eattheweeds.com/japanese-knotweed-dreadable-edible/", "passage_text": "Japanese Knotweed gets no respect. Nearly everywhere it grows it’s listed as a prolific, noxious, invasive, dangerous bad-for-the-world, the-sky-is-falling weed. Oh by the way, it’s edible. Might be even really healthy for you…. pesky weeds have that habit. Botanically take your pick: Japanese Knotweed is known as Fallopia japonica, Polygonum cuspidatum, and Reynoutria japonica. In Europe they prefer Fallopia japonica (named for Gabriello Fallopia, 16th century Italian anatomist who “discovered” fallopian tubes."}, {"url": "http://www.soilutions.co.uk/guides/is-japanese-knotweed-poisonous/", "passage_text": "Click to see more answers to your questions. Simply put Japanese Knotweed is not poisonous, and isn’t harmful to humans like other invasive species. In fact the knotweed can be used as a food source with a taste and texture likened to rhubarb. Apparently it can also be brewed into a type of beer. Now we are not suggesting you rush out and cook up a nice pie. "}, {"url": "http://japaneseknotweed.com/japanese-knotweed-faqs/", "passage_text": "Japanese knotweed (Fallopia japonica) is a large perennial plant that grows throughout much of the UK. It was imported to Britain from Japan during the mid 19 th century as popular ornamental feature to many gardens. Japanese knotweed is one of the most invasive plants in the UK. It grows rapidly (over 1.5m in a month) and spreads easily by stem fragments and rhizomes (underground creeping stems). 1  Overview / Identification Notes. 2  Image Gallery."}, {"url": "https://en.wikipedia.org/wiki/Japanese_knotweed", "passage_text": "Fallopia japonica, commonly known as Japanese knotweed, is a large, herbaceous perennial plant of the family Polygonaceae, native to East Asia in Japan, China and Korea. In North America and Europe the species is very successful and has been classified as an invasive species in several countries. "}, {"url": "http://www.eattheweeds.com/japanese-knotweed-dreadable-edible/", "passage_text": "Knotweed Creats a Knot. Knotweed, in the Buckwheat family, is not liked in western nations because it grows around three feet a month, sends roots down some 10 feet, grows through concrete, damaging roads, dams, buildings and just about anything made by man. It’s a pain in the asphalt. Botanically take your pick: Japanese Knotweed is known as Fallopia japonica, Polygonum cuspidatum, and Reynoutria japonica. In Europe they prefer Fallopia japonica (named for Gabriello Fallopia, 16th century Italian anatomist who “discovered” fallopian tubes."}, {"url": "http://www.argyll-bute.gov.uk/planning-and-environment/invasive-and-harmful-plants", "passage_text": "Herbicide control. Dense stands of Japanese Knotweed can be treated with a glyphosate-based herbicide, . If the Japanese Knotweed is sparsely distributed, spot-treat or use 2, 4-D amine, which is specific to broadleaved plants and will not harm the grasses. Japanese Knotweed. Japanese Knotweed was introduced in the UK in the 1850's as an ornamental plant and as a fodder plant. It is a very invasive weed though not harmful if consumed. It is generally found along rivers and streams, road verges, in gardens and on waste ground."}]