[{"url": "http://www.watchman.org/articles/occult/what-is-the-occult/", "passage_text": "The term occult is derived from the latin word occultus which means to cover up, to hide, or those things which are hidden or secret. When used in this paper the word occult means any attempt to gain supernatural knowledge or power apart from the God of the Bible. A biblical warning concerning the occult is also provided that can be used as an outline for a Bible study on the subject or as a helpful tool in witnessing to someone involved in aspects of the occult."}, {"url": "http://www.allabouttheoccult.org/the-occult.htm", "passage_text": "The occult world is more detailed than what many of us may think or what the movies portray. The word, occult, is derived from the Latin word, occultus, which means things that are mysterious, hidden, and very secretive. Angelic and demonic forces play a large part in the practices which make up a part of the occultic world. "}, {"url": "http://www.equip.org/perspectives/the-occult-what-is-the-difference-between-the-words-cult-and-occult/", "passage_text": "CULT AND OCCULT-Cult. The term “cult” is typically used by the secular media to describe religious or semi-religious groups whose members are controlled in almost every single respect by a single individual. Some good examples are Hare Krishnas or Scientologists. CULT AND OCCULT-Theological Sense of the Word. CULT AND OCCULT-Some Cross-over. It should be clearly noted here that there is some cross-over between cults and the occult in that some cults, such as the Church of Satan and others, are also clearly involved with occultic practices."}, {"url": "http://www.gotquestions.org/occult.html", "passage_text": "Answer: The dictionary defines occult as “hidden, secret and mysterious, particularly pertaining to the supernatural.” Examples of occult practices are astrology, witchcraft (Wicca), the black arts, fortune telling, magic (both black and white), Ouija boards, Tarot cards, spiritism, parapsychology, and Satanism. "}, {"url": "http://www.watchman.org/articles/occult/what-is-the-occult/", "passage_text": "It is often said that the term cult and the occult are two sides of the same coin. It is true that there are common aspects of both terms and often some blurring occurs; cults frequently practice aspects of the occult and occult groups are (in a larger aspect of the word) themselves cults. Watchman Fellowship, however, usually makes a distinction between the term cult and occult. A biblical warning concerning the occult is also provided that can be used as an outline for a Bible study on the subject or as a helpful tool in witnessing to someone involved in aspects of the occult."}, {"url": "https://en.wikipedia.org/wiki/Occult", "passage_text": "Occultism is the study of occult practices, including (but not limited to) magic, alchemy, extra-sensory perception, astrology, spiritualism, religion, and divination. Christian authorities have generally regarded occultism as heretical whenever they met this: from early Christian times, in the form of gnosticism, to late Renaissance times, in the form of various occult philosophies."}, {"url": "http://www.christiananswers.net/q-eden/edn-occult-defn.html", "passage_text": "T he word “occult” is generally associated with secret knowledge and practices dealing with the supernatural or “psychic” phenomena, often for the purpose of obtaining personal power. Some occult practices rely on demons or “ spirits ” to achieve their goals. Occultism is rapidly increasing throughout the world. There are now thousands of publishers of occultic books and magazines (not to mention Web sites). Please understand that the terms “occult” and “cult” refer to completely different things—although there can be crossover in some specific instances. That is, some cults have occultic practices. The following practices are considered to be occultic: (partial list, in alphabetical order). 1  Alchemy. 2  Animism. 3  Astrology."}, {"url": "https://en.wikipedia.org/wiki/Occult", "passage_text": "For other uses, see Occult (disambiguation) . The occult (from the Latin word occultus clandestine, hidden, secret) is knowledge of the hidden. In common English usage, occult refers to knowledge of the paranormal , as opposed to knowledge of the measurable , usually referred to as science. Christian authorities have generally regarded occultism as heretical whenever they met this: from early Christian times, in the form of gnosticism, to late Renaissance times, in the form of various occult philosophies."}]