[{"url": "http://homeschooling.about.com/od/unitssubjsci/p/octopus.htm", "passage_text": "The octopus is a cephalopod that inhabits many diverse regions of the ocean, especially coral reefs. Octopuses are characterized by their eight arms, usually with sucker cups on them. They are highly intelligent, but have a very short life span."}, {"url": "http://animals.howstuffworks.com/marine-life/octopus1.htm", "passage_text": "Octopus Body Plan. ­The octopus belongs to the phylum mollusca, where you will also find its slimy next of kin, the clams, snails and slugs. But octopuses are separated from the mollusks into the class cephalopoda, which includes the most advanced animals of the phylum. Squid, cuttlefish and nautilus belong to this class as well."}, {"url": "http://animals.howstuffworks.com/marine-life/octopus1.htm", "passage_text": "Behind the octopus's head, directly opposite the arms, is its mantle. The mantle is a highly muscled structure that houses all of the animal's organs. Its gills, hearts, digestive system and reproductive glands are all crammed into this one space."}, {"url": "http://www.ehow.com/about_5044703_mantle-cavity.html", "passage_text": "The mantle cavity is an anatomical part of a mollusk. Mollusks include snails, clams, mussels, scallops, squid, octopus and cuttlefish. One of the most important anatomical features is the mantle skirt. This is the soft, fleshy part of the animal situated in between the two shells."}, {"url": "http://homeschooling.about.com/od/unitssubjsci/p/octopus.htm", "passage_text": "An octopus uses its mantle to breathe. It has 'mantle slits' behind the eyes. It draws in water through the slits into the mantle. Two gills remove the oxygen from the water, then the slits close and the water is released through a tube called the siphon.. Moving About: Octopuses use their mantle to swim. They tighten all the mantle muscles at once, squeezing a blast of water from the siphon, causing the octopus to launch forward."}, {"url": "http://www.worldanimalfoundation.net/f/Octopus.pdf", "passage_text": "Octopuses draw water into their mantle cavity where it passes through its gills. As a mollusc, octopus gills are finely divided and vascularilzed outgrowths of either the outer or the inner body surface. DEFENSE: Three defensive mechanisms are typical of octopuses: ink sacs, camouflage, and autotomising limbs."}]