[{"url": "http://encyclopedia2.thefreedictionary.com/Algae", "passage_text": ", a green slime found in stagnant water, is a green alga, as is the green film found on the bark of trees. The more complex brown algae and red algae are chiefly saltwater forms; the green color of the chlorophyll is masked by the presence of other pigments."}, {"url": "http://www.dec.ny.gov/chemical/77118.html", "passage_text": "Most algae are harmless and are an important part of the food web. Algae are naturally present in slow moving streams, lakes, marine waters and ponds in low numbers. Certain types can become abundant and form blooms under the right conditions. Some algae can produce toxins that can be harmful to people and animals."}, {"url": "https://en.wikipedia.org/wiki/Algae", "passage_text": "The largest and most complex marine algae are called seaweeds, while the most complex freshwater forms are the Charophyta, a division of green algae that includes, for example, Spirogyra and the stoneworts."}, {"url": "http://www.bioremediate.com/algae2.html", "passage_text": "Types of Algae common in Ponds. Filamentous algae. Filamentous algae, or commonly referred to as pond scum or pond moss forms greenish mats upon the water’s surface. The stringy, fast-growing algae can cover a pond with slimy, lime-green clumps or mats in a short period of time."}, {"url": "http://encyclopedia2.thefreedictionary.com/Algae", "passage_text": "Kelps, the largest algae, may attain a length of more than 200 ft (61 m). Euglena and similar genera are free-swimming one-celled forms that contain chlorophyll but that are also able, under certain conditions, to ingest food in an animallike manner. The green algae include most of the freshwater forms."}, {"url": "http://www.dec.ny.gov/chemical/77118.html", "passage_text": "Freshwater Blue-green Algal Blooms. Blue-green algae, technically known as cyanobacteria, are naturally present in lakes and streams in low numbers. Blue-green algae can form. that discolor the water or produce floating rafts or scums on the surface of the water."}, {"url": "http://www.infoplease.com/encyclopedia/science/algae-types-algae.html", "passage_text": "Kelps, the largest algae, may attain a length of more than 200 ft (61 m). Euglena and similar genera are free-swimming one-celled forms that contain chlorophyll but that are also able, under certain conditions, to ingest food in an animallike manner. The green algae include most of the freshwater forms. The pond scum, a green slime found in stagnant water, is a green alga, as is the green film found on the bark of trees."}, {"url": "http://homeguides.sfgate.com/common-types-pond-water-algae-48888.html", "passage_text": "Lyngbya algae species form green, black or gray clumps made up of thousands of cells that may be found on the bottom of the pond or floating along the surface. Pithophora is a dark green filamentous algae often referred to as horsehair algae. It grows in coarse, tangled clumps of filaments that resemble steel wool."}, {"url": "http://www.lakerestoration.com/t-algae-control.aspx", "passage_text": "Algae control in ponds is a very important part of maintaining a healthy pond. In very high densities, algae blooms may discolor the water and out-compete, poison, or asphyxiate other life forms. Some algae are toxic to humans and dogs. Excessive algae growth can indicate problems with water quality."}]