[{"url": "http://www.ucmp.berkeley.edu/diapsids/dinodiscoveriesna.html", "passage_text": "The first discoveries. The clade Dinosauria was originally defined by Sir Richard Owen in 1842, in a two hour speech that reportedly held the audience captivated. The original dinosaurs of this new group were Megalosaurus, Iguanodon and Hylaeosaurus. However, each of these animals was known only from fragmentary specimens."}, {"url": "http://www.usatoday.com/story/tech/2014/09/04/dinosaur-skeleton-discovered/15031803/", "passage_text": "A newly discovered skeleton of a massive dinosaur could serve as a Rosetta Stone to unlock mysteries in the world of paleontology. Dreadnoughtus once stood two-stories high at the shoulder, was as long as a city bus, and weighed in at 65 tons."}, {"url": "http://www.ucmp.berkeley.edu/diapsids/dinodiscoveriesna.html", "passage_text": "It is generally accepted that the first discovery of dinosaur remains in North America was made in 1854 by Ferdinand Vandiveer Hayden during his exploration of the upper Missouri River."}, {"url": "http://www.bbc.com/earth/story/20150603-the-land-that-gave-us-dinosaurs", "passage_text": "It was there that the first fossil dinosaur fragments were studied by scientists; there that the first essentially complete dinosaur skeleton was unearthed; there that the very word dinosaur was born about 170 years ago; and there that the name almost died just a few decades later."}, {"url": "http://www.cnn.com/2014/01/26/world/meast/when-dinosaurs-roamed-saudi-arabia/index.html", "passage_text": "Dinosaurs in the desert – An international team of scientists has discovered the first evidence of dinosaurs in Saudi Arabia. Dinosaur remnants are exceptionally rare in the Arabian Peninsula (enough to fit inside a shoe box according to Benjamin Kear, the study's lead author)."}, {"url": "http://www.roadsideamerica.com/story/11155", "passage_text": "In October 2003, a statue was erected in downtown Haddonfield commemorating the World's First Dinosaur Skeleton Discovery in October, 1858. The Hadrosaurus foulkii was the first nearly complete dinosaur skeleton found, and the first to be mounted for public display. It sparked the start of the field of dinosaur paleontology, and can probably be blamed for the profusion of life-size dino statues across America. The Hadrosaurus statue is an 8-ft."}, {"url": "http://www.thegreatstory.org/hadrosaurus.html", "passage_text": "It is here that the first nearly complete skeleton of a dinosaur was unearthed. Hadrosaurus foulkii was a late Cretaceous duck-billed dinosaur. In 1858 its mineralized bones were found in a marl pit from which local farmers extracted a calcium-rich mud that they then blended into their own sandy farm fields."}, {"url": "http://www.levins.com/dinosaur.shtml", "passage_text": "First Nearly-Complete Dinosaur Skeleton Foulke had discovered the first nearly-complete skeleton of a dinosaur -- an event that would rock the scientific world and forever change our view of natural history."}]