[{"url": "http://help.solidworks.com/2014/English/SolidWorks/sldworks/t_defining_editing_title_blocks.htm", "passage_text": "You can define or edit title blocks to specify which properties are editable by users of a drawing. When you define the title block, you also specify a hotspot area that drawing or template users select to enter title block data. To define or edit a title block for use in templates: 1  Open a drawing sheet, right-click the sheet format in the FeatureManager design tree, and select Define Title Block."}, {"url": "http://www.roymech.co.uk/Useful_Tables/Drawing/Title_blocks.html", "passage_text": "BS ISO 7200 Technical Drawings-Title Blocks identifies the title block requirements to be used on engineering drawings.... The drawing sheet size should be in accordance with BS EN ISO 5457 TD-Sizes and layout of drawing sheets Drawing Sheet Sizes. A title block is the form on which the actual drawing is a section."}, {"url": "http://isda.ncsa.uiuc.edu/NARA/titleBlockRDF/", "passage_text": "Technical Drawings: Title Block Description. The Title Block Description includes the terms necessary for describing Title blocks of technical drawings, particularely NAVY ships drawings. This work is part of the NARA project. The primary purpose of a drawing title block is to identify a drawing."}, {"url": "http://www.wisegeek.com/what-is-a-title-block.htm", "passage_text": "The title block is an important element found in professional architectural drawings that contains data about the drawing, such as the title, its number, and the name of the architect. It may also have a company logo, copyright information, and data on the date it was completed."}, {"url": "http://engineersedge.com/drafting/drawing_title_block.htm", "passage_text": "Drafting Menu | Engineering, Design and Drafting Store. The title block of a drawing, usually located on the bottom or lower right hand corner, contains all the information necessary to identify the drawing and to verify its validity. A title block is divided into several areas. On of the areas normally found within the title block are the drawing title, the drawing number, and lists the location, the site, or the vendor. The drawing title and the drawing number are used for identification and filing purposes."}]