[{"url": "http://www.medicineonline.com/articles/E/2/Elevated-Body-Temperature/Fever.html", "passage_text": "Overview, Causes, & Risk Factors. Fever is a higher-than-normal body temperature. Normal temperature is usually defined as 98.6 degrees Fahrenheit (F) or 37 degrees Celsius (C). Many healthcare providers would say a person truly has a fever when their temperature is greater than 99.5 degrees F or 37.5 degrees C."}, {"url": "http://www.webmd.com/first-aid/body-temperature", "passage_text": "Most people think of a normal body temperature as an oral temperature of 98.6°F (37°C) . This is an average of normal body temperatures. Your temperature may actually be 1°F (0.6°C) or more above or below 98.6°F (37°C) . Also, your normal body temperature changes by as much as 1°F (0.6°C) throughout the day, depending on how active you are and the time of day. Body temperature is very sensitive to hormone levels and may be higher or lower when a woman is ovulating or having her menstrual period."}, {"url": "http://www.webmd.boots.com/a-to-z-guides/fever-symptoms-causes-treatment", "passage_text": "Fever symptoms. A fever is a high temperature when the body's temperature rises above 37.5C (99.5F). The normal body temperature is between 36C-37C (96.8F-98.6F). The high temperature or fever often lasts around two to three days. Check for high temperature or fever using an appropriate thermometer and following the instructions. "}, {"url": "http://www.healthhype.com/what-is-a-fever-pyrexia-normal-and-high-body-temperature.html", "passage_text": "1 For children, a body temperature above 38 degrees Celsius/100.4 Farenheit (rectally) is considered as a fever. 2  High Fever. 3  A high fever is considered as a body temperature equal to and above 40 degrees Celsius/104 degrees Farenheit. 1 In infants younger than 8 weeks, a body temperature greater than 38.3 degree Celsius/101 degrees Farenheit should be considered as a high fever and requires prompt immediate medical attention."}, {"url": "http://www.ferinheighttocelsius.com/F-to-C/doc/37-celsius", "passage_text": "37 °C is a value that one encounters probably more often than any other temperature reading. If you are used to the Celsius scale, you recognize it immediately. Indeed, a normal body temperature of a healthy person is in the vicinity of 37 degrees Celsius, which makes this value so special and important. For the Fahrenheit folks, you may know it as 98.6 °F (as you can easily verify using our online converter)."}, {"url": "http://www.urmc.rochester.edu/encyclopedia/content.aspx?ContentTypeID=85&ContentID=P00866", "passage_text": "Normal body temperature can range from 97.8 degrees F (or Fahrenheit, equivalent to 36.5 degrees C, or Celsius) to 99 degrees F (37.2 degrees C) for a healthy adult. A person's body temperature can be taken in any of the following ways: Orally. "}, {"url": "http://www.emedicinehealth.com/script/main/art.asp?articlekey=128929", "passage_text": "Most people think of a normal body temperature as an oral temperature of 98.6°F (37°C) . This is an average of normal body temperatures. Your temperature may actually be 1°F (0.6°C) or more above or below 98.6°F (37°C) . Also, your normal body temperature changes by as much as 1°F (0.6°C) throughout the day, depending on how active you are and the time of day."}, {"url": "https://en.wikipedia.org/wiki/Human_body_temperature", "passage_text": "An early morning temperature higher than 37.2 °C (99.0 °F) or a late afternoon temperature higher than 37.7 °C (99.9 °F) is normally considered a fever, assuming that the temperature is elevated due to a change in the hypothalamus's setpoint. The body temperature of a healthy person varies during the day by about 0.5 °C (0.9 °F) with lower temperatures in the morning and higher temperatures in the late afternoon and evening, as the body's needs and activities change."}, {"url": "https://en.wikipedia.org/wiki/Hyperthermia", "passage_text": "In humans, hyperthermia is defined as a temperature greater than 37.5–38.3 °C (99.5–100.9 °F), depending on the reference used, that occurs without a change in the body's temperature set point. The normal human body temperature can be as high as 37.7 °C (99.9 °F) in the late afternoon. "}, {"url": "http://www.healthhype.com/what-is-a-fever-pyrexia-normal-and-high-body-temperature.html", "passage_text": "A fever, also referred to as pyrexia, is an elevation in the body temperature above the norm. This is broadly defined as oral temperature reading above 37.5 degrees Celsius (99 degrees Farenheit) and a core body temperature (rectally) above 38 degrees Celsius (100.4 degrees Farenheit). Variations in temperature may occur depending on where the measurement is taken (oral, rectal, axilla). 1 In infants younger than 8 weeks, a body temperature greater than 38.3 degree Celsius/101 degrees Farenheit should be considered as a high fever and requires prompt immediate medical attention."}]