[{"url": "http://jgdarden.com/batteryfaq/carfaq9.htm", "passage_text": "For example, if a deep cycle battery's capacity is rated at 100 ampere hours (AH) at the 20 hour (C/20) rate, it will produce approximately 83 AH at the eight hour (C/8) rate, 63 A in two hours (C/2), and 55 AH in one hour (C/1). This is due to the Peukert Effect. For example, if 50 amp hours has been consumed from a 100 amp hour battery, then you do not want to recharge it at rate any greater than 25 amps in one hour. At a 25 amp charging rate, it should take approximately two hours to get to a 80% State-of-Charge."}, {"url": "http://www.aussiebatteries.com.au/blog/charging-deep-cycle-batteries/", "passage_text": "The charging time for deep cycle batteries depends on the number of amp hours it stores. Divide the amp hour rating of your battery by the amp rating of the charger and you’ll have an estimate of the time needed to reach full charge. For example, a 100 amp hour battery at a 50% stage of charge (50 amp hours) would take approximately five hours to charge on a ten amp battery charger."}, {"url": "https://answers.yahoo.com/question/index?qid=20080818110336AASh942", "passage_text": "Amp Hours, or Ah, is the capacity of the battery. How much current a battery can delivery starting a car is called cold cranking amps. A deep cycle marine battery will typically be more than 40Ah. A 40Ah car battery at 50% charge will more than likely start your car in fair weather. Cold weather is another story. So, to get a completely dead car battery to 50% - 20Ah-would be maybe two days of full sunlight-with only a 50% charge, or about 12.2 Volts. Watts = volts x amps a 12volt battery needs an incoming current of at least 13 volts to charge it; 13.5 volts is better. so if the output VOLTAGE of the panel is less than 13 volts it wont do anything. Even if it is, 10 / 13.5 = .74 amp.(three quarters)."}, {"url": "https://answers.yahoo.com/question/index?qid=20080818110336AASh942", "passage_text": "It will take forever and a day to charge a deeply discharged deep cycle battery.......... consider that a small 110v battery charger is putting out 3-5 amps (or 3 x 110 =330 Watts) and the alternator on a car is putting out 20 to 50 amps at 14 volts (280 to 730 Watts). Source(s): Watts = volts x amps a 12volt battery needs an incoming current of at least 13 volts to charge it; 13.5 volts is better. so if the output VOLTAGE of the panel is less than 13 volts it wont do anything. Even if it is, 10 / 13.5 = .74 amp.(three quarters)."}, {"url": "http://www.batteries-faq.com/activekb/questions.php?questionid=1", "passage_text": "3. Charging current; C = The amp hour (Ah) capacity rated at the 20 hour rate. 4. Float condition is for long term storage / (several weeks) inactivity. 5. Equalize every 4 to 8 weeks or when the difference in specific gravity readings vary by 0.020 points or more and always after a normal charge. "}, {"url": "https://answers.yahoo.com/question/index?qid=20090227112833AAZBcIH", "passage_text": "Best Answer: Depending on the charger, you may only be charging at 2A for the last 4 hours. But if you had discharged the battery say 60% used, leaving 40% in the battery, It would charge at 10 Amps for 4-5 hours. but as it reaches 85% most Automatic chargers cut back to 2 amps or so and take several hours to top up. At that point it will shutoff or stay at the trickle rate. Check the spec. on your charger"}, {"url": "http://forums.iboats.com/forum/general-boating-outdoors-activities/boat-topics-and-questions-not-engine-topics/20117-how-long-does-a-deep-cycle-battery-take-to-charge", "passage_text": "This is only if I only used about 60% of the capacity. If all the capacity is used and the battery has no life, it will take about 48 hours at the 2 amp rate. I could charge my deep cycle faster on a higher setting but from experience, the higher rate after prolong useage, the life expectancy drops. If you slow charge (about 2 amperhours) you will not cook the plates that are inside the battery. Depending on the deep cycle rate of the battery will depend on how long you will achive a full charge. With the battery that I have, it will take about 24 hours to charge on the 2 amp setting."}, {"url": "http://www.bassresource.com/bass-fishing-forums/topic/125007-charging-deep-cycle-marine-battery/", "passage_text": "Posted. When you hear all this stuff about how you should slow charge a deep cycle battery, remember the manufacturers considers 10% of the battery capacity a SLOW charge. So, a 100 Ah battery would be charged at 10 amps. The two amp setting is for your lawn mower size batteries, not a TM battery. As mentioned above, to fully charge a deep cycle battery, it requires being over charged by 6%, Your standard hot box as I call them automatic chargers will not do this. Most of them will actually cut off before it's reaches 100% much less over charge it the necessary 6%."}]