[{"url": "http://www.sa-venues.com/attractionsec/eastern_cape_sunshine_coast.htm", "passage_text": "Cannon Rocks is a delightful seaside village situated on the Sunshine Coast of the Eastern Cape, South Africa. Nestled in between the Boknes Village and the boundary of the Greater Addo Elephant Park it has the vast expanse of the warm Indian Ocean... More information and photographs: Cannon Rocks Information. Sunshine Coast is an apt description of a coastal belt beset with countless little villages, each offering access to beaches, rivers, lagoons and hiking trails that stretches between the Tsitsikamma and East London in the Eastern Cape."}, {"url": "https://en.wikipedia.org/wiki/Sunshine_Coast,_Queensland", "passage_text": "Major rivers of the Sunshine Coast include Noosa River, Maroochy River, Mooloolah River and the Stanley River. The region includes several lakes such as Lake Cootharaba and Lake Weyba. Ewen Maddock Dam, Wappa Dam and Baroon Pocket Dam have been built for water storage. A number of private hospitals exist throughout the region, most notably the 'Sunshine Coast Private Hospital' at Buderim, Caloundra Private Hospital (formerly known as Andrea Ahern) at Caloundra, Selangor Hospital at Nambour, the recently established Kawana Private Hospital, and smaller facilities at Noosa."}, {"url": "http://www.sunshinecoast.com/regions.html", "passage_text": "Sunshine Coast Regions. Noosa. Just 130 km north of Brisbane lays Noosa, the jewel in the crown of Queensland's stunning Sunshine Coast. A delightful coastal village renowned for its pristine beaches, majestic hinterland and the largest sand island in the world, Noosa attracts visitors from all over the world. With over 65 km of the world's best beaches Maroochydore is widely recognised as a major tourist attraction for local and international visitors alike. Surfing is one of Maroochydore's big drawcards however it is also popular as the Sunshine Coast's main business district."}, {"url": "https://en.wikipedia.org/wiki/Sunshine_Coast,_Queensland", "passage_text": "Sunshine Coast is a metropolitan area and the third most populated area in the Australian state of Queensland. Located 100 km north of the state capital Brisbane in South East Queensland on the Pacific Ocean coastline, its urban area spans approximately 60 km of coastline and hinterland from Pelican Waters to Tewantin. A number of private hospitals exist throughout the region, most notably the 'Sunshine Coast Private Hospital' at Buderim, Caloundra Private Hospital (formerly known as Andrea Ahern) at Caloundra, Selangor Hospital at Nambour, the recently established Kawana Private Hospital, and smaller facilities at Noosa."}, {"url": "http://www.queensland.com/en-US/Explore-Queensland/Sunshine-Coast", "passage_text": "By the beach. Choose your patch of sand from over 100 kilometres of pristine coastline – stretching from Caloundra in the south to Noosa and the rainbow sands of the Cooloola coast in the north – and soak up the warm sunshine and laid-back atmosphere. 1  Paddle into the home of longboarding with a surf lesson at Noosa’s Main Beach. Sample the ‘Sunny Coast’ With award-winning restaurants, food trails, vibrant food festivals and bustling farmers markets, the Sunshine Coast is one giant celebration of food and wine. 1  Tick off your foodie bucket list with beachfront and rainforest restaurants worth travelling for."}, {"url": "http://www.sunshinecoastcanada.com/", "passage_text": "Enjoy some bonding time with your favorite four legged friend on the Sunshine Coast, BC Continue reading... The Sunshine Coast is British Columbia's best kept secret, stretching along 180km of land from Langdale to Lund with many quaint, tiny coastal communities in between. Family fun, romantic escapes, golf, adventure, oceanside adventure-The Sunshine Coast has a vacation package for you. SEE ALL... "}, {"url": "http://rosebrookcottages.com/", "passage_text": "Set on 12 acres of undulating countryside in the picturesque Maleny region of the Sunshine Coast Hinterland, yet just 2 minutes from the Maleny Town Centre and Restaurants. "}, {"url": "http://www.queensland.com/en-US/Explore-Queensland/Sunshine-Coast", "passage_text": "Noosa National Park. On the Sunshine Coast, the only thing more refreshing than the water is the lifestyle. With its endless beaches, lush rainforests and easy smiles, it’s a place where you will feel like a local from the moment you arrive. Sample the ‘Sunny Coast’ With award-winning restaurants, food trails, vibrant food festivals and bustling farmers markets, the Sunshine Coast is one giant celebration of food and wine. 1  Tick off your foodie bucket list with beachfront and rainforest restaurants worth travelling for."}, {"url": "https://www.canadastays.com/sunshine-coast-cabin-rentals", "passage_text": "In addition to outdoor activities, the Sunshine Coast is home to the highest per capita population of artists, artisans and crafters in Canada! As such, the region’s dozen or so oceanside towns are full of galleries, markets and festivals to explore before retiring to your Sunshine Coast vacation rental. Sunshine Coast, British Columbia Rentals. The Sunshine Coast located along 180km of land from Gibsons to Lund with many quaint, tiny coastal communities in between. Here you will meet people living along the Canadian Coast filled with Sun, shopping, Nature and adventure."}]