[{"url": "http://www.holiday-weather.com/chicago/averages/", "passage_text": "Chicago: Annual Weather Averages. July is the hottest month in Chicago with an average temperature of 23°C (73°F) and the coldest is January at -6°C (21°F) with the most daily sunshine hours at 12 in July. The wettest month is July with an average of 100mm of rain"}, {"url": "https://weatherspark.com/averages/30851/Chicago-Illinois-United-States", "passage_text": "This report describes the typical weather at the Chicago Midway International Airport (Chicago, Illinois, United States) weather station over the course of an average year. It is based on the historical records from 1974 to 2012. The average fraction of time spent in various temperature bands: frigid (below 15A°15â), f (FREEZING°15a 15â F°To), 32a (32â°F cold 32A°32â), f (TO°50a 50â F°Cool), 50a (50â°F to 65A°65â), f (COMFORTABLE°65a 65â F°To), 75a (75â°F warm 75A°75â) f to (85a 85â°F). hot 85a 85â f to 100a 100â f and sweltering above"}, {"url": "https://weatherspark.com/averages/31158/5/Chicago-Illinois-United-States", "passage_text": "This report describes the typical weather at the O'Hare International Airport (Chicago, Illinois, United States) weather station over the course of an average May. It is based on the historical records from 1974 to 2012. Earlier records are either unavailable or unreliable. The highest average wind speed of 11 mph (gentle breeze) occurs around May 1, at which time the average daily maximum wind speed is 18 mph (fresh breeze). The lowest average wind speed of 9 mph (gentle breeze) occurs around May 29, at which time the average daily maximum wind speed is 16 mph (moderate breeze)."}, {"url": "http://www.currentresults.com/Weather/Illinois/temperature-may.php", "passage_text": "Average Temperatures for Illinois in May. Average temperatures for May at cities throughout Illinois are listed below. The tables give the normal maximum and minimum temperatures based on weather data collected from 1981 to 2010 by the US National Climatic Data Center. You can jump to a separate table for each region of the state: Chicago Area, Northern Illinois, Central Illinois and Southern Illinois."}, {"url": "http://www.currentresults.com/Weather/Illinois/Places/chicago-temperatures-by-month-average.php", "passage_text": "The average high and low temperatures are listed below by month and annually for Chicago, in both degrees Fahrenheit and Celsius. Maximums and minimums are only part of the temperature picture. To fill in the rest, there's information on how many days a month get above or below a given temperature. Freezing Temperatures in Chicago. Freezing temperatures can occur anytime from November to April in Chicago. Typically, for seven days each year the thermometer drops to zero degrees Fahrenheit (-18 °C) or colder. The daytime temperature doesn't rise above freezing for 43 days annually, on average."}, {"url": "http://www.holiday-weather.com/chicago/averages/may/", "passage_text": "The average daily temperature for Chicago in May is a warm 21 C, but this can drop to 9 C on average. Long suny days are beginning to be seen again in Chicago in May, with the city experiencing on average 9 hours of sun per day. The average rainfall experienced in Chicago during this month drops to only 88 mm. The beaches also open in May, so get ready for some warmer weather and a final goodbye to the winter. The average daily temperature for Chicago in May is a warm 21 C, but this can drop to 9°C on average. Long suny days are beginning to be seen again in Chicago in May, with the city exp... Read more."}, {"url": "http://www.currentresults.com/Weather/Illinois/Places/chicago-temperatures-by-month-average.php", "passage_text": "Days of Hot Weather in Chicago. Temperatures don't normally reach 100 °F in Chicago. But it does get into the 90s on an average 14 days a year. The days are above 50 degrees from June to September and nearly every day in May and October. But Chicago only gets that warm for a few days in winter. Freezing Temperatures in Chicago. Freezing temperatures can occur anytime from November to April in Chicago. Typically, for seven days each year the thermometer drops to zero degrees Fahrenheit (-18 °C) or colder. The daytime temperature doesn't rise above freezing for 43 days annually, on average."}, {"url": "http://www.holiday-weather.com/chicago/averages/may/", "passage_text": "May in Chicago means the good weather is finally coming into effect and the promise of summer is imminent. The beaches also open in May, so get ready for some warmer weather and a final goodbye to the winter. The average daily temperature for Chicago in May is a warm 21 C, but this can drop to 9°C on average. Long suny days are beginning to be seen again in Chicago in May, with the city exp... Read more."}]