[{"url": "http://www.merck.com/product/usa/pi_circulars/p/pregnyl/pregnyl_pi.pdf", "passage_text": "1 Pregnyl ® (chorionic gonadotropin for injection USP) DESCRIPTION Human chorionic gonadotropin (HCG), a polypeptide hormone produced by the human placenta, is composed of an alpha and a beta subunit. The beta subunits of these hormones differ in amino acid sequence. PREGNYL ® (chorionic gonadotropin for injection USP) is a highly purified pyrogen-free preparation obtained from the urine of pregnant females. It is standardized by a biological assay procedure"}, {"url": "http://www.steroidsworldwide.com/pregnyl-organon-5000iu-p-60.html", "passage_text": "Click to enlarge. HCG Pregnyl by Organon 5000iu x 3 amps + solvent Price: $105.00 HCG or Human chorionic gonadotropin, which is derived from the urine of pregnant women, is an injectable drug availably commercially in the States as well as many other Countries. "}, {"url": "http://www.wakehealth.edu/IVF/Human-chorionic-gonadotropin.htm", "passage_text": "hCG (Pregnyl, Profasi, Ovidrel). Pregnyl and Profasi are human chorionic gonadotropin (hCG) hormone products derived and purified from the urine of pregnant women. Ovidrel is produced by genetic recombinant cell technology (non-human derived) and is a pure form of recombinant hCG (r-hCG). "}, {"url": "http://www.thebump.com/a/pregnyl", "passage_text": "Pregnyl is a brand name for beta hCG — human chorionic gonadotropin — which is the human pregnancy hormone. Doctors use it to induce ovulation. This is the “trigger shot” that you probably hear people talk about. Beta hCG comes with several different brand names, including Pregnyl and Ovidrel. "}, {"url": "http://www.ehow.com/facts_5589240_hcg-pregnyl_.html", "passage_text": "HCG Pregnyl is a prescription medication that was approved over 25 years ago for female fertility issues and pediatric hormone therapy. HCG Pregnyl is distributed by the Schering-Plough Corporation and is referred to as Pregnyl. Pregnyl contains the luteinizing hormone (LH) and the follicle stimulating hormone (FSH) which, when produced naturally in the female human body during the course of a normal menstrual cycle, trigger ovulation."}, {"url": "http://www.ehow.com/facts_5589240_hcg-pregnyl_.html", "passage_text": "Pregnyl has been used to treat fertility issues. Pregnyl may be administered to women after first finishing a round of another medication, called menotropins, to cause ovulation. Pregnyl may also be used in prepubescent boys to initiate the dropping of the testicles. Pregnyl contains the luteinizing hormone (LH) and the follicle stimulating hormone (FSH) which, when produced naturally in the female human body during the course of a normal menstrual cycle, trigger"}, {"url": "http://www.everydayhealth.com/drugs/hcg", "passage_text": "Be the first to review this Drug. Human chorionic gonadotropin (HCG) is a natural hormone that doctors prescribe as an injectable drug with the brand names Pregnyl and Novarel, and in a related form called Ovidrel. HCG improves fertility by increasing sperm production in men and encouraging egg release in women. A: Human chorionic gonadotropin (HCG) is a hormone that supports the normal development of an egg in a woman's ovary, and stimulates the release of the egg during ovulation. It can be used to cause ovulation and to treat infertility in women, and to increase sperm count in men. It is not indicated for weight loss."}, {"url": "http://www.ehow.com/facts_5589240_hcg-pregnyl_.html", "passage_text": "Pregnyl is the liquid, purified prescription form of human chorionic gonadotropin (HCG). Pregnyl contains the luteinizing hormone (LH) and the follicle stimulating hormone (FSH) which, when produced naturally in the female human body during the course of a normal menstrual cycle, trigger ovulation."}, {"url": "http://www.medicines.org.uk/emc/medicine/12613", "passage_text": "Pregnyl is a preparation of human chorionic gonadotrophin obtained from the urine of pregnant women. It stimulates the steroidogenesis in the gonads by virtue of a biological effect similar to that of LH (Luteinizing hormone, which is the same as interstitial cell stimulating hormone). Pregnyl consists of a freeze-dried powder for injection. The active ingredient [human chorionic gonadotrophin (hCG)] which is obtained from the urine of pregnant women, has luteinizing hormone (LH) activity."}]