[{"url": "https://en.wikipedia.org/wiki/Titanium", "passage_text": "Titanium is a chemical element with symbol Ti and atomic number 22. It is a lustrous transition metal with a silver color, low density and high strength. It is highly resistant to corrosion in sea water, aqua regia and chlorine. Titanium was discovered in Cornwall, Great Britain, by William Gregor in 1791 and named by Martin Heinrich Klaproth for the Titans of Greek mythology. It is a strong metal with low density that is quite ductile (especially in an oxygen-free environment), lustrous, and metallic-white in color. The relatively high melting point (more than 1,650 °C or 3,000 °F) makes it useful as a refractory metal."}, {"url": "http://gilletts.com.au/titanium-ring-information-i-6.html", "passage_text": "Does the color fade or wear-How to care for your titanium rings and colored titanium rings. Although titanium is a very strong metal, much stronger than gold, platinum and silver, and is more scratch, bend and dent resistant, it is not completely scratch resistant. The color will not fade or chip though it can be scratched off. The titanium in not colored through the entire depth of the metal. Although titanium is a very strong metal, as with any metal it can, and will scratch, and with scratching, the titanium color can be removed. See below for further information."}, {"url": "http://www.titaniumart.com/titanium-info.html", "passage_text": "As the thickness of oxide varies, so will color. Oxides form naturally on titanium leaving the metal a gray color, but applied heat and or electrochemical treatment will increase the oxide thickness to produce a spectrum of color similar to a rainbow. This same filtering effect can be seen in colors on soap bubbles. TiO2 oxide is surface oxide of titanium, and if not properly cared for the colored surface will be altered by abrasion. In order to maintain this beautiful surface, please take care of the following items: 1  Wash with a soft sponge, or cloth using mild detergent."}, {"url": "http://gilletts.com.au/titanium-ring-information-i-6.html", "passage_text": "Titanium is a natural element which has a silver-greyish-white color. Titanium is the hardest natural metal in the world. It is very strong, three times the strength of steel and much stronger than gold silver and platinum and yet is very light weight. The color will not fade or chip though it can be scratched off. The titanium in not colored through the entire depth of the metal. Although titanium is a very strong metal, as with any metal it can, and will scratch, and with scratching, the titanium color can be removed. See below for further information."}, {"url": "https://en.wikipedia.org/wiki/Titanium", "passage_text": "The two most useful properties of the metal are corrosion resistance and the highest strength-to-density ratio of any metallic element. In its unalloyed condition, titanium is as strong as some steels, but less dense. It is a strong metal with low density that is quite ductile (especially in an oxygen-free environment), lustrous, and metallic-white in color. The relatively high melting point (more than 1,650 °C or 3,000 °F) makes it useful as a refractory metal."}, {"url": "http://www.wikihow.com/Color-Titanium", "passage_text": "This simple guide describes how to anodize titanium. Colorize sheets of titanium to create permanent, metal artwork. Titanium is valued for its weather resistance and durability, but it is also valued by artists for its beauty and colors when oxidized. All it takes is a thin, transparent layer of oxide to create color on the surface."}, {"url": "http://gilletts.com.au/titanium-ring-information-i-6.html", "passage_text": "The color of our titanium rings is not a paint, plate or pigment. The color in our titanium rings is caused by oxidisation. Titanium is a type of refractory metal that has an interesting relationship with oxygen. The color will not fade or chip though it can be scratched off. The titanium in not colored through the entire depth of the metal. Although titanium is a very strong metal, as with any metal it can, and will scratch, and with scratching, the titanium color can be removed. See below for further information."}, {"url": "http://ganoksin.com/blog/noel/magic-color-on-metal-titanium/", "passage_text": "Magic Color on Metal: Titanium. As you may know, most of my most personal and ambitious work includes detailed imagery in anodized titanium, a truly marvelous and magical material. Here is an article I wrote that gives some basic information on how that work can happen. This causes the oxide layer to appear colored. The mechanism is the same as for the colors on an oil slick or a soap bubble, but with two important differences. First, it is permanent. Second, the thickness of the layer changes in increments, causing it to produce some colors, and only those colors."}, {"url": "http://ganoksin.com/blog/noel/magic-color-on-metal-titanium/", "passage_text": "As either temperature or voltage is increased, the succession of colors on titanium will always be the same. The exact voltage, or time with the torch, will depend on the size and thickness of the piece of titanium. The correspondence between voltage and color, at least in studio conditions, is somewhat approximate. This causes the oxide layer to appear colored. The mechanism is the same as for the colors on an oil slick or a soap bubble, but with two important differences. First, it is permanent. Second, the thickness of the layer changes in increments, causing it to produce some colors, and only those colors."}]