[{"url": "http://biology.about.com/od/basicgenetics/ss/gene-mutation.htm", "passage_text": "Gene mutations are most commonly caused as a result of two types of occurrences. Environmental factors such as chemicals, radiation, and ultraviolet light from the sun can cause mutations. These mutagens alter DNA by changing nucleotide bases and can even change the shape of DNA."}, {"url": "http://www.yourgenome.org/facts/what-types-of-mutation-are-there", "passage_text": "Large-scale mutations. 1  Copy number variation (CNV) is a type of mutation where large chunks of DNA are inserted, repeated or lost. 2  These regions of DNA can be between 10,000 and 5,000,000 bases long. 3  Duplication of genes. 4  When there is an increase in the number of copies of a gene."}, {"url": "http://www.yourgenome.org/facts/what-types-of-mutation-are-there", "passage_text": "1 Copy number variation (CNV) is a type of mutation where large chunks of DNA are inserted, repeated or lost. 2  These regions of DNA can be between 10,000 and 5,000,000 bases long. 3  Duplication of genes. 4  When there is an increase in the number of copies of a gene. 5  Deletions of large regions of the chromosome."}, {"url": "http://biology.about.com/od/basicgenetics/ss/gene-mutation.htm", "passage_text": "1 Silent Mutation: Although a change in the DNA sequence occurs, this type of mutation does not change the protein that is to be produced. 2  This is because multiple genetic codons can encode for the same amino acid. 3  Amino acids are coded for by three nucleotide sets called codons."}, {"url": "http://greengenes.lbl.gov/cgi-bin/JD_Tutorial/nph-Mutations.cgi", "passage_text": "Of the three types of point mutations the most harmful are insertions and deletions. They result in what is known as a frameshift mutation. When a nucleotide base is either inserted or deleted it disrupts the amino acids coded for from the site of the mutation on to the end of the gene."}, {"url": "http://ghr.nlm.nih.gov/handbook/mutationsanddisorders/possiblemutations", "passage_text": "A nonsense mutation is also a change in one DNA base pair. Instead of substituting one amino acid for another, however, the altered DNA sequence prematurely signals the cell to stop building a protein. This type of mutation results in a shortened protein that may function improperly or not at all."}, {"url": "http://www.biotecharticles.com/Others-Article/Types-of-Gene-Mutations-Diseases-Caused-By-Gene-Mutation-80.html", "passage_text": "There are two types of mutations mainly: 1) Hereditary mutations:- This kind of gene mutations are hereditary that is they pass from parents to the off spring. These mutations are present in the egg or sperm of an individual and pass to the next generation."}, {"url": "http://ghr.nlm.nih.gov/handbook/mutationsanddisorders/possiblemutations", "passage_text": "Frameshift mutation (illustration). This type of mutation occurs when the addition or loss of DNA bases changes a gene’s reading frame. A reading frame consists of groups of 3 bases that each code for one amino acid. A frameshift mutation shifts the grouping of these bases and changes the code for amino acids."}, {"url": "http://biology.about.com/od/basicgenetics/ss/gene-mutation.htm", "passage_text": "Mutations cause changes in the genetic code that lead to genetic variation and the potential to develop disease. Gene mutations can be generally categorized into two types: point mutations and base-pair insertions or deletions. Point mutations are the most common type of gene mutation. Also called a base-pair substitution, this type of mutation changes a single nucleotide base pair."}]