[{"url": "http://wmdjunction.com/110923_contagion.htm", "passage_text": "For MEV-1, the symptoms are cough, headache, malaise, fever, and, as a prelude to death, frothing around the mouth; SARS sufferers present with high fever, body aches, headache, mild respiratory symptoms, and, eventually, dry cough. The mortality rate for MEV-1 is 25 percent; for SARS, about 10 percent. "}, {"url": "https://en.wikipedia.org/wiki/Contagion_(film)", "passage_text": "Contagion is a 2011 American science fiction medical thriller film directed by Steven Soderbergh. The film features an ensemble cast that includes Marion Cotillard, Bryan Cranston, Matt Damon, Laurence Fishburne, Jude Law, Gwyneth Paltrow, Kate Winslet, and Jennifer Ehle. Following that film's release, Burns brought up the idea of producing a medical thriller film depicting the rapid spread of a virus, which was inspired by various pandemics such as the 2003 SARS epidemic and the 2009 flu pandemic."}, {"url": "http://www.itmonline.org/arts/lonicera.htm", "passage_text": "There are often remarkable heat symptoms at the very beginning of the disease, such as high fever, thirst, irritability, restlessness, concentrated dark urine, red tongue, and rapid pulse. Fever is the principal manifestation. Inclusion with the lower class of herbs reflects the fact that it treated serious diseases (mainly various kinds of swellings) quickly, rather than indicating anything inferior about forsythia or the others in that class."}, {"url": "https://en.wikipedia.org/wiki/Contagion_(film)", "passage_text": "The plot of Contagion documents the spread of a virus transmitted by fomites, attempts by medical researchers and public health officials to identify and contain the disease, the loss of social order in a pandemic, and finally the introduction of a vaccine to halt its spread. Following that film's release, Burns brought up the idea of producing a medical thriller film depicting the rapid spread of a virus, which was inspired by various pandemics such as the 2003 SARS epidemic and the 2009 flu pandemic."}, {"url": "https://en.wikipedia.org/wiki/Tannerella_forsythia", "passage_text": "Tannerella forsythia is an anaerobic, Gram-negative bacterial species of the Cytophaga-Bacteroidetes family. It has been implicated in periodontal diseases and is a member of the red complex of periodontal pathogens. T. forsythia was previously named Bacteroides forsythus and Tannerella forsythensis. Tannerella forsythia was discovered by and named after Dr. Anne Tanner who works at The Forsyth Institute located in Cambridge, MA."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-1103-FORSYTHIA.aspx?activeIngredientId=1103&activeIngredientName=FORSYTHIA", "passage_text": "The fruit is used for medicine. Forsythia is used for swelling of small air passages in the lung (bronchiolitis), tonsillitis, sore throat, fever, vomiting, heart disease, HIV /AIDS, gonorrhea, pain and swelling (inflammation), and a severe skin rash with fever and vomiting caused by a bacterium (erysipelas). "}, {"url": "https://en.wikipedia.org/wiki/Contagion_(film)", "passage_text": "Contagion premiered at the 68th Venice Film Festival in Venice, Italy on September 3, 2011, and went on general release on September 9. Following that film's release, Burns brought up the idea of producing a medical thriller film depicting the rapid spread of a virus, which was inspired by various pandemics such as the 2003 SARS epidemic and the 2009 flu pandemic."}, {"url": "http://www.gardeningknowhow.com/ornamental/shrubs/forsythia/yellow-leaves-on-forsythia.htm", "passage_text": "Diagnosing Yellow Leaves on Forsythia. A forsythia with yellow leaves may be occurring due to any number of diseases. Below are the more common ones: 1  Yellow veins may indicate tobacco ringspot virus or arabis mosaic virus. 2  Each is generally introduced through nematodes. 1 Yellow, black or brown spots that form a larger necrotic tissue can mean that forsythia with yellow leaves are caused by anthracnose, one of the most common fungal diseases on ornamental plants. 2  The yellow tissue may also be colonized by tiny fruiting bodies."}, {"url": "http://www.medscape.com/viewarticle/749482", "passage_text": "Editor's Note: We thought that Medscape readers would be interested in hearing from one of our infectious disease experts about the medical aspects of the movie Contagion. So often, science is trumped by drama in popular movies -- but not this time, says Paul A. Offit, MD, a vaccine coinventor in real life. "}, {"url": "http://www.ediblewildfood.com/blog/2012/04/pruning-forsythia-but-save-the-blossoms/", "passage_text": "5 Comments. forsythia, forsythia bush, forsythia flowers. Those beautiful forsythia ornamental bushes are not just another bush. The brilliant yellow forsythia bush can grow to 3 metres (10’) tall and can get as wide as 3.5 metres (12’). The flowers have four lobes and appear mostly in clusters of two to six. "}]