[{"url": "https://www.law.cornell.edu/background/amistad/slavery.html", "passage_text": "The practice of trading in and using African slaves was introduced to the United States by the colonial powers, and when the American colonies received their common law from the United Kingdom, the legality of slavery was part of that law. "}, {"url": "http://www.history.com/topics/black-history/fugitive-slave-acts", "passage_text": "Introduction. The Fugitive Slave Acts were a pair of federal laws that allowed for the capture and return of runaway slaves within the territory of the United States. Fugitive Slave Acts: Background. Statutes regarding refugee slaves existed in America as early as 1643 and the New England Confederation, and slave laws were later enacted in several of the 13 original colonies."}, {"url": "http://www.bowdoin.edu/~prael/projects/gsonnen/page3.html", "passage_text": "Laws Pertaining to Slavery. Slaves were not considered citizens in antebellum America. Before the fourteenth amendment to the national constitution (July 28, 1868), blacks held no legal rights in this country. Whites controlled politics, and used them to keep slaves and free blacks on a subordinate societal level. "}, {"url": "http://loc.gov/teachers/classroommaterials/connections/slaves-court/history4.html", "passage_text": "States' Rights and the Fugitive Slave Law. Slaves and the Court, 1740-1860 focuses strongly on issues related to states’ rights and the fugitive slave laws, a controversial issue from as early as 1793. "}, {"url": "https://en.wikipedia.org/wiki/Fugitive_slave_laws", "passage_text": "The fugitive slave laws were laws passed by the United States Congress in 1793 and 1850 to provide for the return of slaves who escaped from one state into another state or territory. Both the fact of the escape and the identity of the fugitive were determined on purely ex parte testimony. If a slave was brought in and returned to the master, the person who brought in the slave would receive the sum of $10 ($283 as of 2015), per slave."}, {"url": "http://www.drbronsontours.com/PGslaveryfederallawsregardingslavery.html", "passage_text": "Federal Laws Regarding Slavery. There are two paths for Federal laws regarding slavery: 1. fugitive slaves 2. free African Americans. These issues intertwine themselves in the early years of the Republic. Slavery is viewed as a local (state) issue so that the U. S. Constitution only mentions slavery indirectly. This act concerned building boats for use in slave trade. Enforcement of this law appears as elusive as the fugitive slave trade laws and further refinements of the act were found necessary.In 1807 Congress passed a law (2 U. S. Stat. 426) against importing slaves into the United States."}, {"url": "https://en.wikipedia.org/wiki/Slavery", "passage_text": "Slavery is a legal or economic system in which principles of property law can apply to humans so that people can be treated as property, and can be owned, bought and sold accordingly, and cannot withdraw unilaterally from the arrangement. According to those proposing a change in terminology, slave perpetuates the crime of slavery in language, by reducing its victims to a nonhuman noun instead of, according to Andi Cumbo-Floyd, carry[ing] them forward as people, not the property that they were."}, {"url": "http://memory.loc.gov/ammem/awhhtml/awlaw3/slavery.html", "passage_text": "35. Virginia was one of the first states to acknowledge slavery in its laws, initially enacting such a law in 1661. 36 The following year, Virginia passed two laws that pertained solely to women who were slaves or indentured servants and to their illegitimate children. Before the Civil War, slaves and indentured servants were considered personal property, and they or their descendants could be sold or inherited like any other personalty. Like other property, human chattel was governed largely by laws of individual states."}, {"url": "https://en.wikipedia.org/wiki/Fugitive_slave_laws", "passage_text": "But for some time the Fugitive Slave Law was considered still to hold in the case of fugitives from masters in the border states who were loyal to the Union government, and it was not until June 28, 1864 that the Act of 1850 was fully repealed. Both the fact of the escape and the identity of the fugitive were determined on purely ex parte testimony. If a slave was brought in and returned to the master, the person who brought in the slave would receive the sum of $10 ($283 as of 2015), per slave."}]