[{"url": "http://encyclopedia2.thefreedictionary.com/superphosphate", "passage_text": "Superphosphate. the most widely used mineral phosphorus fertilizer. The phosphorus in superphosphate is usually in the form of monocalcium phosphate and free phosphoric acid. The fertilizer contains gypsum and other admixtures, such as iron and aluminum phosphates, silica, and fluorine compounds. "}, {"url": "http://forums.gardenweb.com/discussions/1532366/what-is-superphosphate-and-is-it-organic", "passage_text": "peebee 1: superphosphate isn't organic, and it's too strong for use in growing vegetables organically. A pity, perhaps; my Uncle George used it with excellent results in the 1930s, and 40s. I use soft rock phosphate if and when I need phosphorus. I try to use organic products only. I have been using bone meal in my vegetable garden, usually before planting. I have been looking for an alterative, and noticed in some of the past threads that superphosphate is recommended."}, {"url": "http://www.wisegeek.com/what-is-a-superphosphate-fertilizer.htm", "passage_text": "Superphosphate fertilizers have a high content of the nutrient phosphate. One of the three nutrients essential to healthy plant growth, phosphate can be applied in a high concentration with a superphosphate fertilizer to plants ranging from houseplants to agricultural crops. Several different types of this fertilizer have been created for different needs. All three types of superphosphate are usually made with a naturally occurring substance called rock phosphate. While this can be applied as a fertilizer in its raw form, putting it through the chemical reactions to create other types of fertilizer has been found to make it more effective."}, {"url": "http://www.ipni.net/publication/nss.nsf/beagle?OpenAgent&d=NSS-14&f=NSS-14%20Triple%20Superphosphate.pdf", "passage_text": "Triple Superphosphate Triple superphosphate (TSP) was one of the first high analysis P fertilizers that became widely used in the 20th cen-tury. Technically, it is known as calcium dihydrogen phosphate and as monocalcium phosphate, [Ca(H 2 PO 4) 2 .H 2 O]. "}, {"url": "http://www.merriam-webster.com/dictionary/superphosphate", "passage_text": "Definition of SUPERPHOSPHATE. 1. : an acid phosphate. 2. : a soluble mixture of phosphates used as fertilizer and made from insoluble mineral phosphates by treatment with sulfuric acid. See superphosphate defined for kids. ADVERTISEMENT"}, {"url": "https://en.wikipedia.org/wiki/Monocalcium_phosphate", "passage_text": "This solid is called triple superphosphate. Several million tons are produced annually for use as fertilizers. Residual HF typically reacts with silicate minerals co-mingled with the phophate ores to produce hydrofluorosilicic acid (H 2 SiF 6). Monocalcium phosphate is an inorganic compound with the chemical formula Ca(H 2 PO 4) 2 (ACMP or CMP-A for anhydrous monocalcium phosphate). It is commonly found as the monohydrate (MCP or MCP-M), Ca(H 2 PO 4) 2 ·H 2 O (CAS# 10031-30-8). Both salts are colourless solids."}, {"url": "http://www.wisegeek.com/what-is-a-superphosphate-fertilizer.htm", "passage_text": "Single superphosphate is the mildest grade, and contains between 16 and 20 percent phosphate. It is typically available in a liquid or a dry formula, both of which are used with the same efficiency by plants. It is also known as normal superphosphate fertilizer. All three types of superphosphate are usually made with a naturally occurring substance called rock phosphate. While this can be applied as a fertilizer in its raw form, putting it through the chemical reactions to create other types of fertilizer has been found to make it more effective."}, {"url": "http://www.teara.govt.nz/en/superphosphate/page-4", "passage_text": "There are alternatives to superphosphate as a source of phosphorus for crops and pastures. Superphosphate is not used on organic farms because it is a manufactured (chemical) fertiliser. Organic farmers use unmodified rock phosphates that will react with the natural acids in the soil to release phosphorus. "}, {"url": "http://www.wisegeek.com/what-is-a-superphosphate-fertilizer.htm", "passage_text": "When applied to the soil, a superphosphate fertilizer raises the amount of phosphorus available to plants. Regardless of type of plant, all require a healthy amount of phosphorus in order to survive. This nutrient is present in every cell of the plant, and is vital in maintaining the strength of the cell structure. All three types of superphosphate are usually made with a naturally occurring substance called rock phosphate. While this can be applied as a fertilizer in its raw form, putting it through the chemical reactions to create other types of fertilizer has been found to make it more effective."}]