[{"url": "http://www.ancientegypt.co.uk/pharaoh/explore/bluec_b1.html", "passage_text": "The pharaoh wore several different headdresses, such as: White crown The White Crown symbolised the pharaoh's control over Upper Egypt,and was worn on occasions involving Upper Egypt only. Red crown The Red Crown symbolised the pharaoh's control over Lower Egypt, and was worn on occasions involving Lower Egypt only. Double crown The Double Crown was a combination of the Red Crown of Lower Egypt and the White Crown of Upper Egypt. It symbolised the joining of the two lands, and the pharaoh's control over the two lands. Blue crown The Blue Crown (the Khepresh) was a blue cloth or leather headdress decorated with bronze or gold discs. The Blue Crown was worn in battles, as well as on ceremonial occasions"}, {"url": "http://www.eternalegypt.org/EternalEgyptWebsiteWeb/HomeServlet?ee_website_action_key=action.display.module&story_id=&module_id=219&language_id=1&text=text", "passage_text": "To display their power and association with the gods, the Pharaohs wore different clothes than the nobles and the common people. The royal headdress called the Nemes is an important royal emblem. Originally, it was a piece of linen cloth gathered together at the back of the head. "}, {"url": "http://www.touregypt.net/featurestories/headdress.htm", "passage_text": "Nekhbet. Nekhbet was depicted as a woman wearing the crown of Upper Egypt or the vulture headdress, a woman with the head of a vulture. She was shown to wear the vulture crown because she was believed to be the mother-the Egyptian word used the hieroglyph of the vulture-of the pharaoh. The ancient Egyptian deities tended to each have a distinctive headdress, which can often be used to tell the gods and goddesses apart. The headdress seems to have been strongly linked to the attributes of the particular deity, giving the Egyptians a visual clue as to the powers of the god or goddess."}, {"url": "http://landofpyramids.org/crown-of-egypt.htm", "passage_text": "Facts about the Crowns of Egypt The different crowns of Egypt are depicted in ancient Egyptian Hieroglyphics, art, artefacts and relics. Examples of the crowns and headdresses can be found in the tombs, temples and manuscripts of the ancient Egyptians. Facts about the Crowns of Egypt-The Headdresses & Crowns of the Egyptian Gods The pictures and images provide facts and interesting information about some of the ancient gods and goddesses and the symbolism of their crowns and headdresses."}, {"url": "http://www.ancient-origins.net/ancient-places-africa-news-general-opinion/crowns-pharaohs-00579", "passage_text": "Gods were depicted with crowns because they were the first mythical kings in the time before creation and prior to the first Egyptian dynasty about 5.000 years ago. The pharaohs were the chosen ones and descendants from these gods in Egyptian mythology. Therefore they were provided with a crown to show their divinity. Different crowns represent the life of the pharaoh and the last crown or Nemes headdress marks the conclusion of earthly life and the beginning of life hereafter. The blue-striped Nemes headdress as a death mask. The best example is the death mask of Tut-Ankh-Amen (image 1). "}, {"url": "http://landofpyramids.org/crown-of-egypt.htm", "passage_text": "The history the ancient Egyptians and the significance of the red, white and double crown of Egypt. Headdresses and Crowns of Egypt Discover the history and religious beliefs surrounding the different types and styles of the crown of Egypt. The red, white and double crown of Egypt feature in many images, hieroglyphs, pictures and amulets found in ancient Egypt. Facts about the Crowns of Egypt-The Headdresses & Crowns of the Egyptian Gods The pictures and images provide facts and interesting information about some of the ancient gods and goddesses and the symbolism of their crowns and headdresses."}, {"url": "http://www.ancientegyptianfacts.com/ancient-egyptian-headress.html", "passage_text": "A crown or headdress associated with the pharaoh is the Nemes headdress. It is most famously represented by the funerary mask of Tutankhamen and is also seen on the Sphinx. This head cloth was often full of bright colours. Headdresses and crowns were one of the distinguishing characteristics of the ancient Egyptians. Not only Egyptian deities, but Pharaohs, the queens, the aristocrats also had a variety of headdresses. Before the unification of Upper and Lower Egypt, The red crown, or Deshret, was associated with Upper Egypt and The white crown, or Hedjet with Lower Egypt"}, {"url": "http://landofpyramids.org/crown-of-egypt.htm", "passage_text": "The different styles of the royal crown of Egypt all had meanings, some were worn by the Pharaoh and others by the ancient Egyptian gods. The different types of crowns of Egypt represented status, power and authority of both the Egyptian Pharaohs and gods. Facts about the Crowns of Egypt-The Headdresses & Crowns of the Egyptian Gods The pictures and images provide facts and interesting information about some of the ancient gods and goddesses and the symbolism of their crowns and headdresses."}]