[{"url": "http://geology.com/records/highest-mountain-in-the-world.shtml", "passage_text": "Chimborazo in Ecuador has an altitude of 6,310 meters (20,703 feet). Mount Everest has a higher altitude and Mauna Kea is taller. However, Chimborazo has the distinction of being the highest mountain above Earth's center. Highest Altitude: An altitude of 8,850 meters (29,035 feet) above sea level makes Mount Everest the mountain on Earth with the highest altitude. Highest altitude means that it has the highest elevation above mean sea level."}, {"url": "http://www.wonderslist.com/top-10-highest-mountains-in-the-world/", "passage_text": "Mount Everest. Mount Everest is the Earth’s highest mountain, with a peak at 8,848 metres (29,029 ft) above sea level and the 5th tallest mountain measured from the centre of the Earth. It is located on the border between Sagarmatha Zone, Nepal, and Tibet, China and is part of the Himalayan Mountain Range. "}, {"url": "http://www.answers.com/Q/Which_mountain_range_has_the_world's_highest_peak", "passage_text": "The Himalayas, a large mountain range in southern Asia, contains Mount Everest, the world's highest mountain peak when measured from sea level. The Himalayan range forms a barrier between the Plateau of Tibet to the north and the plains of the Indian subcontinent to the south. The name of the world's highest mountain range is the Himalayas. This has the world's highest elevation because it contains Mt. Everest -- the world's tallest peak."}, {"url": "http://www.infoplease.com/ipa/A0001771.html", "passage_text": "Highest Mountain Peaks of the World. The following table lists the highest mountain peaks of the world including mountain name, mountain range, vertical height, and location, according to the National Geographic Society. See Named Summits in the U.S. Over 14,000 Feet Above Sea Level for U.S. Peaks. More on Highest Mountain Peaks of the World from Infoplease: 1  Everest Almanac: Measuring Mountains-Measuring Mountains The world's highest peak and past pretenders to the throne by Borgna ..."}, {"url": "http://10mosttoday.com/10-highest-mountains-in-the-world/", "passage_text": "Mount Everest – highest mountain in the world. 2. K2, Baltoro Karakoram – The second highest mountain in the world and the only one outside the Himalayas in the top 10 highest mountains, with a peak of 8,611 meters (28,251 ft). Located on the border between Pakistan and China. K2 Mountain. Second highest in the world. "}, {"url": "http://geology.com/records/highest-mountain-in-the-world.shtml", "passage_text": "Depending upon how you define highest mountain, Mount Everest has some rivals! Highest Altitude: An altitude of 8,850 meters (29,035 feet) above sea level makes Mount Everest the mountain on Earth with the highest altitude. Highest altitude means that it has the highest elevation above mean sea level."}, {"url": "http://geology.com/records/continents-highest-mountains.shtml", "passage_text": "Mount Everest: Highest Mountain in Asia. Mount Everest as seen from Everest Base Camp, Tibet. Mount Everest is the highest mountain on the Asian continent and the highest mountain in the world. Its summit is 29,035 feet (8,850 meters) above sea level. It is located on the border of Nepal and China. Image of Mount Everest copyright by iStockPhoto and Holger Mette. "}, {"url": "http://apexplanet.blogspot.com/2013/03/himalayas-highest-mountain-range-in.html", "passage_text": "The Himalayas, also called Himalaya, is the highest mountain range in the world. It is home to some of the planet's highest peaks. The Himalayan mountain range has 9 out of 10 of the world’s highest peaks, including Mount Everest. Because of the extreme height of the mountain range, the Himalaya is called the Third Pole. Mount Everest is the highest peak of the Himalaya and is the world's highest peak with an elevation of 29,035 feet (8,850 meters). K2 is the second highest peak of the Himalayan mountain range and also the second highest peak on earth with an elevation of 28,251 feet (8,611 meters). Other famous peaks include Kailash, Kanchenjunga, Nanga Parbat, Annapurna, and Manasklu"}, {"url": "http://geology.com/records/highest-mountain-in-the-world.shtml", "passage_text": "Mount Everest is called the world's highest mountain because it has the highest elevation above sea level . We could also say that it has the highest altitude. The peak of Mount Everest is 8,850 meters (29,035 feet) above sea level. No other mountain on Earth has a higher altitude. However, some mountains might be considered taller (with taller being the total vertical distance between their base and their summit). Highest Altitude: An altitude of 8,850 meters (29,035 feet) above sea level makes Mount Everest the mountain on Earth with the highest altitude. Highest altitude means that it has the highest elevation above mean"}]