[{"url": "http://www.payscale.com/research/US/Job=Coal_Mine_Worker/Hourly_Rate", "passage_text": "A Coal Mine Worker earns an average wage of $21.54 per hour. People in this job generally don't have more than 20 years' experience. Experience has a moderate effect on salary for this job. "}, {"url": "http://work.chron.com/starting-salary-coal-mining-engineer-4667.html", "passage_text": "The disparity between coal mining and other industries was greatest in North Dakota. Workers across all industries in that state had average salaries of $38,028 a year, while coal mining professionals, including engineers, earned an average salary of $88,567. (References 4). A 2011 report by the Bureau of Labor of Statistics found that coal mining engineers in the U.S. have an average annual salary of $86,900. This amounts to an hourly average wage of $41.78."}, {"url": "http://technology.infomine.com/reviews/MiningSalaries/welcome.asp?view=full", "passage_text": "The average salary for a chemist at a Canadian mine is reported to be $81,300. In the eastern region of the country the average is $73,100; in the western region it is $85,700. That is probably the result of the oil sands mines. At surface mines the ranges of the salary for a chemist on a mine in Canada is $51.500 to $120,400. The range on underground mines is $53,000 to $108,000. I do not know what the cost of living is in Australia, but the salaries sound good. The University of New South Wales, School of Mining Engineering reports, A survey of the 2005 final year students in Mining Engineering at UNSW found their mean starting package was $81,950 per year and ranged from $72,000 to $96,000."}, {"url": "http://work.chron.com/starting-salary-coal-mining-engineer-4667.html", "passage_text": "The wages of mining engineers tend to rise as they gain experience. A 2011 report by the Bureau of Labor of Statistics found that coal mining engineers in the U.S. have an average annual salary of $86,900. This amounts to an hourly average wage of $41.78."}, {"url": "http://technology.infomine.com/reviews/MiningSalaries/welcome.asp?view=full", "passage_text": "Currently, new hires are starting with salaries ranging from $80,000 to $140,000, depending on the degree.. The average salary for new petroleum geologists has climbed above $80,000, according to a survey by the American Association of Petroleum Geologists. Salaries are similar in the mining industry. I do not know what the cost of living is in Australia, but the salaries sound good. The University of New South Wales, School of Mining Engineering reports, A survey of the 2005 final year students in Mining Engineering at UNSW found their mean starting package was $81,950 per year and ranged from $72,000 to $96,000."}, {"url": "http://technology.infomine.com/reviews/MiningSalaries/welcome.asp?view=full", "passage_text": "Canadian Mining Salaries - 2013. More from the CostMine 2013 Survey of Canadian Mine Salaries, Wages and Benefits. This time we look at the annual salaries (in thousands of Canadian $) for mainly engineering types in Canadian mines. I do not know what the cost of living is in Australia, but the salaries sound good. The University of New South Wales, School of Mining Engineering reports, A survey of the 2005 final year students in Mining Engineering at UNSW found their mean starting package was $81,950 per year and ranged from $72,000 to $96,000."}, {"url": "http://www.wsj.com/articles/SB10001424052970204621904577016172350869312", "passage_text": "The average salary in the Australian mining industry was about 108,000 Australian dollars, or about US$110,000, in 2010, which includes some part-time and lower-skilled workers and is well above the A$66,594 average for all Australians, according to the Australian government's Bureau of Statistics. "}, {"url": "http://www.simplyhired.com/salaries-k-mine-workers-jobs.html", "passage_text": "Average Mine Workers Salaries. The average salary for mine workers jobs is $49,000. Average mine workers salaries can vary greatly due to company, location, industry, experience and benefits. This salary was calculated using the average salary for all jobs with the term mine workers anywhere in the job listing."}, {"url": "http://www1.salary.com/Mining-Salaries.html", "passage_text": "Well there are a wide range of jobs in the Mining category and their pay varies greatly. If you know the pay grade of the job you are searching for you can narrow down this list to only view Mining jobs that pay less than $30K, $30K-$50K, $50K-$80K, $80K-$100K, or more than $100K."}, {"url": "http://iminco.net/mining-job-salaries-how-much-can-you-earn-mining-careers/", "passage_text": "Average Salary: $80,000 – $200,000. Open-cut Mine Jobs. Open-cut miners (above ground) are responsible for safe operation of specialised equipment to excavate, load and transport coal, ore and rock in an open-cut mining operation. Average Salary: $100,000 – $200,000. Average Salary: $100,000 – $250,000. As you can see, there are many mining job opportunities for highly skilled and semi-skilled workers. Mining is a tough industry with big rewards for people who have the ability to adapt to a challenging environment."}]