[{"url": "http://www.kiplinger.com/article/taxes/T056-C001-S003-tax-records-you-can-safely-toss.html", "passage_text": "If you’re self-employed or have a small business, or you have income from a variety of sources or a complex tax situation, keep your records longer. The IRS has up to six years to audit anyone who neglects to report more than 25% of his or her income. "}, {"url": "https://www.gov.uk/keeping-your-pay-tax-records", "passage_text": "You’ll need your records to fill in your tax return correctly. If. checks your tax return, they may ask for the documents. You must also keep records for business income and outgoings if you’re self-employed. Try to get copies of as much as you can, eg ask banks for copies of statements, suppliers for duplicate invoice etc. You can use ‘provisional’ or ‘estimated’ figures if you can’t recreate all your records. You must use the ‘Any other information’ box on the tax return to say that this is what you’re doing."}, {"url": "https://www.gov.uk/self-employed-records/overview", "passage_text": "You’ll also need to keep records of your personal income. If you’re the nominated partner in a partnership, you must also keep records for the partnership. There are different rules on keeping records for limited companies. Many businesses use traditional accounting where you record income and expenses by the date you invoiced or were billed. Example You invoiced a customer on 28 March 2014. You record that invoice for the 2013 to 2014 tax year-even if you didn’t receive the money until the next tax year."}, {"url": "http://www.taxvol.org.uk/about-tax/information-keep/", "passage_text": "How long to keep your business records. You must normally keep your business records for another five years after the online tax return deadline of 31 January. For example: The tax return deadline for an online 2014-15 return is 31 January 2016. You need to keep your records until 31 January 2021, five years later. We suggest that you keep records for the same amount of time even if you pay your tax via PAYE. For example: The tax return deadline for an online 2014-15 return is 31 January 2016. You need to keep your records until 31 January 2017, one year later."}, {"url": "http://www.taxdonut.co.uk/tax/tax-self-assessment/self-assessment-tax-records", "passage_text": "You should keep business tax records relating to a particular tax year for at least five years after that year’s tax return deadline (31 January following the end of the tax year). For example, suppose you have chosen the calendar year (to 31 December) as the accounting period used for working out your annual profits. The tax return deadline is 31 January 2013 and the tax records should be kept until at least 31 January 2018. Non-business tax records should be kept for at least a year after the tax deadline. If you file your tax return late, the tax records should be kept for at least 15 months after the date of filing."}, {"url": "http://www.taxdonut.co.uk/tax/tax-self-assessment/self-assessment-tax-records", "passage_text": "Tax records for self-employment. You must keep tax records that will allow you to complete your self-assessment tax return. These tax records need to include details of all your business income and outgoings, and of any purchases or sales of business assets. The tax return deadline is 31 January 2013 and the tax records should be kept until at least 31 January 2018. Non-business tax records should be kept for at least a year after the tax deadline. If you file your tax return late, the tax records should be kept for at least 15 months after the date of filing."}, {"url": "http://smallbusiness.chron.com/long-keep-company-records-54232.html", "passage_text": "Income Tax Records. The Internal Revenue Service requires companies to keep business tax returns and supporting documents for a minimum of three years from the time of filing. During this time, the return can be amended or audited. If you failed to report income, however, the IRS can come after your business for up to six years. If the business took a deduction for a worthless security or bad debt, the IRS can pursue the issue for seven years. To be safe, a business should keep tax records in its permanent files. "}, {"url": "http://smallbusiness.chron.com/long-self-employed-person-need-keep-tax-records-4254.html", "passage_text": "Some special circumstances require that tax records be kept longer than four years. If you failed to report income, and it is more than 25 percent of the gross income you reported; then you need to keep the records relating to that income for six years. Self Employment Tax. The self-employed are required to pay a self-employment tax. In 2009, the self-employment tax was 15.3 percent of the first $106,800 net earnings; all earnings $106,800 are taxed at 2.9 percent for Medicare. This tax is the Social Security and Medicare tax that is normally paid by employe"}, {"url": "https://www.gov.uk/keeping-your-pay-tax-records", "passage_text": "How to keep your records. There are no rules on how you must keep records. You can keep them on paper, digitally or as part of a software program (like book-keeping software). Try to get copies of as much as you can, eg ask banks for copies of statements, suppliers for duplicate invoice etc. You can use ‘provisional’ or ‘estimated’ figures if you can’t recreate all your records. You must use the ‘Any other information’ box on the tax return to say that this is what you’re doing."}]