[{"url": "https://en.wikipedia.org/wiki/Protein_precursor", "passage_text": "For other uses, see Precursor (disambiguation) . A protein precursor, also called a pro-protein or pro-peptide, is an inactive protein (or peptide) that can be turned into an active form by posttranslational modification. The name of the precursor for a protein is often prefixed by pro. Examples include proinsulin and proopiomelanocortin. Like other proteins that contain a signal peptide, their name is prefixed by pre. They are thus called pre-pro-proteins or pre-pro-peptides. The signal peptide is cleaved off in the endoplasmic reticulum. An example is preproinsulin."}, {"url": "https://in.answers.yahoo.com/question/index?qid=20070307074535AARMv2i", "passage_text": "This is because pseudoephedrine is a precursor molecule and can be chemically changed to methamphetamine. It is the immediate precursor, and in fact, methamphetamine is pseudoephedrine with one molecule chemically removed. Another example is insulin. It is proinsulin until it is released in the blood. Then an enzyme helps break a sulfide bond in the molecule to allow it to form its effective structure as insulin."}, {"url": "https://in.answers.yahoo.com/question/index?qid=20070307074535AARMv2i", "passage_text": "· just now. Report Abuse. A precursor molecule is a molecule that is synthesized in an immature form and needs processing before it become activated. A good example is represented by some hormones (such as progesterone) and digestive enzymes, such as trypsin. Another example is insulin. It is proinsulin until it is released in the blood. Then an enzyme helps break a sulfide bond in the molecule to allow it to form its effective structure as insulin."}, {"url": "http://www.cholesterol-and-health.com/Steroid-Hormones.html", "passage_text": "Cholesterol is the precursor to a hormone called pregnenolone, which has important functions itself, but is also the precursor to all other steroid hormones. In females, and to a lesser degree in males, testosterone is further modified, undergoing conversion to estradiol, a different type of sex hormone called an estrogen. You can peruse the references, share this article, or leave a comment below. Read more about the author, Chris Masterjohn, PhD, here."}, {"url": "https://en.wikipedia.org/wiki/Protein_precursor", "passage_text": "Some protein precursors are secreted from the cell. Many of these are synthesized with an N-terminal signal peptide that targets them for secretion. Like other proteins that contain a signal peptide, their name is prefixed by pre. They are thus called pre-pro-proteins or pre-pro-peptides. The signal peptide is cleaved off in the endoplasmic reticulum. An example is preproinsulin."}, {"url": "http://www.collinsdictionary.com/dictionary/english/precursor", "passage_text": "Translations for 'precursor'. 1  British English: precursor A precursor of something is a similar thing that happened or existed before it, often something which led to the existence or development of that thing. 2  NOUNHe said that the deal should not be seen as a precursor to a merger. 1"}, {"url": "https://en.wikipedia.org/wiki/Precursor_(chemistry)", "passage_text": "From Wikipedia, the free encyclopedia. In chemistry, a precursor is a compound that participates in the chemical reaction that produces another compound. In biochemistry, the term precursor is used more specifically to refer to a chemical compound preceding another in a metabolic pathway. Raman spectroscopy has been successfully tested to detect explosives and their precursors. A portable, advanced sensor based on infrared spectroscopy in a hollow fiber matched to a silicon-micromachined fast gas chromatography column can analyze illegal stimulants and precursors with nanogram-level sensitivity."}]