[{"url": "http://ctu.edu.vn/%7Edvxe/Hoa%20Lan/Doc%20on%20web/Orchid%20Anatomy.htm", "passage_text": "T he structure of orchid flowers is unique among floral plants. The orchid flower is typically has an outer whorl of three sepals, an inner whorl of three petals, and a single large column (the gynostemium, composed of the male stamens attached to the female pistil) in the center. The sepals are the protective cover of the flower bud. This is the primary identification feature of an orchid. At the top of the column is the male anther which contains packets of pollen called pollinia. Below the anther is the stigma, a shallow, usually sticky cavity in which the pollen is placed for fertilization."}, {"url": "http://www.teara.govt.nz/en/orchids/page-1", "passage_text": "Reproductive parts. Male and female reproductive parts in the middle of orchid flowers are fused into a structure called the column. Variations in the column and other flower parts promote insect pollination, or as is more common in New Zealand, self-pollination. The detailed structure of the column is important in identifying a species. "}, {"url": "http://www.landscape-and-garden.com/Orchids/BiologicalStructure", "passage_text": "The Orchid Flower. The Orchid Flower. The orchid flower is bilaterally symmetrical. This means that every orchid flower can be divided on a vertical plane, and a vertical plane only, to produce two identical halves that are mirror images of each other. However, there is also a common thread – the orchid flower consists of three sepals and three petals that are arranged in a whorl and a reproductive column. The sepals and petals form the outer and inner whorls of the orchid flower. Often the sepals can be mistaken for petals due to its color and texture and they are usually of equal size. In some orchid species the dorsal or upper sepal can be slightly larger and more prominent than the lateral or lower sepals"}, {"url": "http://www.kew.org/science/orchids/orchidstructure.html", "passage_text": "The fused organ in the centre of an orchid flower is called the column. In this species, and in most Pacific island orchids, a single anther lies at the apex of the column. The pollen in the anther is not powdery as in most plants, but is borne in eight discrete masses, called pollinia (single pollinium). Let us take, as an example, the common Asian and Pacific Island orchid Phaius tankervilleae, which is similar in general floral structure to the majority of orchids. Its floral parts are situated at the apex of the ovary which itself can be seen to be tripartite in cross section."}, {"url": "http://orchids.wikia.com/wiki/Orchid_Morphology", "passage_text": "This page is about Orchid Morphology which refers to the outward appearance (shape, structure, colour, pattern) of orchids and their component parts. "}, {"url": "https://en.wikipedia.org/wiki/Orchidaceae", "passage_text": "Orchidaceae are well known for the many structural variations in their flowers. Some orchids have single flowers, but most have a racemose inflorescence, sometimes with a large number of flowers. In some extremely specialized orchids, such as the Eurasian genus Ophrys, the labellum is adapted to have a colour, shape and odour which attracts male insects via mimicry of a receptive female. Pollination happens as the insect attempts to mate with flowers."}, {"url": "http://www.kew.org/science/orchids/orchidstructure.html", "passage_text": "Orchids are no exception. This can most easily be seen in the two outer whorls of the flower. Let us take, as an example, the common Asian and Pacific Island orchid Phaius tankervilleae, which is similar in general floral structure to the majority of orchids. Its floral parts are situated at the apex of the ovary which itself can be seen to be tripartite in cross section."}, {"url": "http://ctu.edu.vn/%7Edvxe/Hoa%20Lan/Doc%20on%20web/Orchid%20Anatomy.htm", "passage_text": "The orchid's reproductive organs are combined into a single column (a gynostemium) unlike the usually separate male stamen/anther and female pistil/stigma configurations of other flowers. This is the primary identification feature of an orchid. At the top of the column is the male anther which contains packets of pollen called pollinia. Below the anther is the stigma, a shallow, usually sticky cavity in which the pollen is placed for fertilization."}, {"url": "http://ctu.edu.vn/%7Edvxe/Hoa%20Lan/Doc%20on%20web/Orchid%20Anatomy.htm", "passage_text": "Petals-Orchids always have three petals. Two are normal, and the third becomes a highly specialized structure called a lip. 3. Lip or Labellum-The lower petal of an orchid. Used by the flower to provide a 'landing platform' for its pollinator. This is the primary identification feature of an orchid. At the top of the column is the male anther which contains packets of pollen called pollinia. Below the anther is the stigma, a shallow, usually sticky cavity in which the pollen is placed for fertilization."}]