[{"url": "http://www.definitions.net/definition/shiksa", "passage_text": "Shiksa is a Yiddish and Polish word that has moved into English usage, mostly in North American Jewish culture, as a term for a non-Jewish woman, initially and sometimes still pejorative but now often used satirically. Shiksa refers to any non-Jewish woman or girl who might be a temptation to Jewish men or boys, e.g., for dating, intermarriage, etc. Professor Frederic Cople Jaher writes: Among Orthodox Jews, the term may be used to describe a Jewish girl or woman who fails to follow Orthodox religious precepts."}, {"url": "http://crazyjewishconvert.blogspot.com/2011/04/why-you-should-never-call-someone-or.html", "passage_text": "Shiksa is a Yiddish word that means non-Jewish female.. It's especially used for an attractive woman who could be a temptation to Jewish men. The people who use this word in conversation very rarely know its real meaning: abomination. Here is the link: http://schvach.blogspot.com/2009/10/sowhats-shiksa-already-by-schvach-yid_04.html. You're absolutely right, 'shiksa' not only means abominable, the word itself is abominable. I never use it (except in that one blog). THAT word has joined the ranks of the 'N' word."}, {"url": "https://en.wikipedia.org/wiki/Shiksa", "passage_text": "The etymology of the word shiksa is partly derived from the Hebrew term שקץ shekets, meaning abomination, impure, or object of loathing, depending on the translator. Several dictionaries define shiksa as a disparaging and offensive term applied to a non-Jewish girl or woman. In Polish, siksa (. [ɕiksa]) is a pejorative word for an immature young girl or teenage girl, as it is a conflation between the Yiddish term and usage of the Polish verb sikać (to urinate). It means pisspants and is roughly equivalent to the English terms snot-nosed brat, little squirt, or kid."}, {"url": "http://judaism.about.com/od/glossary/g/Shiksa-Yiddish-Sayings.htm", "passage_text": "Meaning and Origins. Shiksa (שיקסע, pronounced shick-suh) is a Yiddish word that refers to a non-Jewish woman who is either romantically interested in a Jewish man or who is a Jewish man's object of affection. The shiksa represents an exotic other to the Jewish man, someone who is theoretically forbidden and thus incredibly desirable. The term originates from the same Hebrew word meaning abomination and is used to refer to a non-Jewish boy or man. The antithesis of the shiksa is the shayna maidel, which is slang and means a pretty girl and is typically applied to a Jewish woman. Pop Culture. Although pop culture has appropriated the term and coined popular phrases like  shiksa goddess, shiksa is not a term of endearment or empowerment"}, {"url": "http://www.merriam-webster.com/dictionary/shiksa", "passage_text": "Definition of SHIKSA. 1. often disparaging: a non-Jewish girl or woman. 2. : a Jewish girl or woman who does not observe Jewish precepts —used especially by Orthodox Jews. "}, {"url": "https://en.wikipedia.org/wiki/Shiksa", "passage_text": "Writer Menachem Kaiser argues in his essay Anti-non-Semitism: An Investigation of the Shiksa that the pejorative connotation of 'shiksa' is fuzzy at best because 'shiksa' today is used as often as not in winking self-reference. In Polish, siksa (. [ɕiksa]) is a pejorative word for an immature young girl or teenage girl, as it is a conflation between the Yiddish term and usage of the Polish verb sikać (to urinate). It means pisspants and is roughly equivalent to the English terms snot-nosed brat, little squirt, or kid."}, {"url": "https://en.wikipedia.org/wiki/Shiksa", "passage_text": "For the 1970 film, see Shiksha (film) . Shiksa (Yiddish: שיקסע shikse) is an often disparaging term of Yiddish origin that has moved into English usage (as well as Polish and German), mostly in North American Jewish culture, as a term for a non-Jewish woman or girl. In Polish, siksa (. [ɕiksa]) is a pejorative word for an immature young girl or teenage girl, as it is a conflation between the Yiddish term and usage of the Polish verb sikać (to urinate). It means pisspants and is roughly equivalent to the English terms snot-nosed brat, little squirt, or kid."}, {"url": "http://judaism.about.com/od/glossary/g/Shiksa-Yiddish-Sayings.htm", "passage_text": "As Yiddish is a melding of German and Hebrew, shiksa originates from the Hebrew shekets (שקץ) which roughly translates to abomination or blemish, and was likely first used in the late 19th century. It's also believed to be the feminine form of a similar term for a man: shaygetz (שייגעץ). The term originates from the same Hebrew word meaning abomination and is used to refer to a non-Jewish boy or man. The antithesis of the shiksa is the shayna maidel, which is slang and means a pretty girl and is typically applied to a Jewish woman. Pop Culture. Although pop culture has appropriated the term and coined popular phrases like  shiksa goddess, shiksa is not a term of endearment or empowerment"}]