[{"url": "http://www.wikihow.com/Become-a-Chartered-Accountant", "passage_text": "Becoming a Chartered Accountant (CA) is a challenging yet rewarding career decision. This designation demonstrates that you have mastery in accounting. As well, this profession can offer excellent job prospects on a global scale, desirable starting salaries, and job flexibility. Enroll in a chartered accountant prep program. Some accountancy programs offer programs that prepare you to start a CA training program. These programs give you education in specific subject areas to build your numeracy skills and other areas."}, {"url": "http://www.nzica.com/CApathway.aspx", "passage_text": "How to become a Chartered Accountant. Chartered Accountants (CAs) are highly qualified professionals who have completed the required degree level study supplemented with workplace experience and a professional competence programme. There are three main steps to becoming a CA: 1  Complete a recognised academic programme. 2  Complete a practical experience programme. "}, {"url": "https://en.wikipedia.org/wiki/Chartered_Accountant", "passage_text": "Chartered accountants work in all fields of business and finance, including audit, taxation, financial and general management. The Institute of Chartered Accountants of Bermuda works with the Canadian Institute of Chartered Accountants and American Institute of Certified Public Accountants, and is the sole organisation in Bermuda with the right to award the chartered accountant designation."}, {"url": "https://en.wikipedia.org/wiki/Chartered_Accountant", "passage_text": "In India, chartered accountants are regulated by the Institute of Chartered Accountants of India which was established by the Chartered Accountants Act 1949. Prior to 1949, Restricted State Auditors were registered with the respective princely states and British provincial state governments. The Institute of Chartered Accountants of Bermuda works with the Canadian Institute of Chartered Accountants and American Institute of Certified Public Accountants, and is the sole organisation in Bermuda with the right to award the chartered accountant designation."}, {"url": "http://www.investopedia.com/terms/c/ca.asp", "passage_text": "Chartered Accountants claim to be the first accounting group to form a professional body, in 1854 in Britain. A Chartered Accountant (CA) designation typically proves the holder has the qualifications to audit financial statements and business practices as well as offer advisory services to clientele. Clientèle the equivalent to A ca designation in The.U. s is THE. Cpa Next. up"}, {"url": "http://www.investopedia.com/terms/c/ca.asp", "passage_text": "DEFINITION of 'Chartered Accountant-CA'. An accounting designation given to accounting professionals in many countries around the world outside of the United States. A Chartered Accountant (CA) designation typically proves the holder has the qualifications to audit financial statements and business practices as well as offer advisory services to clientele. clientèle A Chartered Accountant (CA) designation typically proves the holder has the qualifications to audit financial statements and business practices as well as offer advisory services to clientele. Clientèle the equivalent to A ca designation in The.U. s is THE. Cpa Next. up"}, {"url": "http://www.charteredaccountants.com.au/Chartered-Accountants/What-is-a-Chartered-Accountant/What-makes-a-Chartered-Accountant-different", "passage_text": "The Institute of Chartered Accountants Australia (ICAA) and the New Zealand Institute of Chartered Accountants have amalgamated to become Chartered Accountants Australia and New Zealand. As a result, some content from the ICAA website has been relocated to our new corporate website. "}, {"url": "http://www.ehow.com/facts_7492633_chartered-accountant.html", "passage_text": "Qualifications. The required education of a chartered accountant includes an undergraduate degree in accounting or other finance-related field. Chartered accountants must also must pursue post-graduate studies and have three years work experience to qualify for application. They must also pass a variety of examinations. Accounting image by Guitar75 from Fotolia.com. According to the Association of Chartered Accountants in the United States, the title chartered accountant, and the designated letters CA, CCA and FCA originated in Scotland and England during the 1800s."}]