[{"url": "http://www.sabc.co.za/wps/portal/SABC/dtt", "passage_text": "The digital signals can be received using a standard aerial for TV. 4. DTH – Direct-to-Home (satellite transmission): It refers to the broadcasting of the digital television signal via satellite. DTH will be used in areas where the terrestrial television signal is very poor or non-existent. 5. DVB-Digital Video Broadcasting: Is a consortium of more than 300 organisations and manufacturers committed to making global standards for delivery of digital television and data services. The migration is in line with international standards and trends. 2. BSD-Broadcast Signal Distribution: Broadcasting signals that are intended for general reception. 3. DTT-Digital Terrestrial Television/Transmission: It refers to the broadcasting of terrestrial television in a digital format."}, {"url": "http://saveourgps.org/Satellite_and_Terrestrial_Signal_Differences.aspx", "passage_text": "Why the two signals need separation. At the heart of the threat to the nation's Global Positioning System (GPS) is the proposal to place two signals—one faint and one blaring—in operation immediately adjacent to each other. And the term blaring actually considerably understates the situation. As astonishing as it might sound, the strength of the signal from a LightSquared ground station would be one billion or more times greater, as received on Earth, than the signal from a GPS satellite."}, {"url": "https://en.wikipedia.org/wiki/Digital_terrestrial_television", "passage_text": "Digital terrestrial television (DTTV or DTT) is a technological evolution of broadcast television and an advancement over analog television. DTTV broadcasts land-based (terrestrial) signals. A terrestrial implementation of digital television (DTV) technology uses an aerial to broadcast to a conventional television antenna (or aerial) instead of a satellite dish or cable television connection. Competing variants of broadcast television systems are being used around the world."}, {"url": "http://www.radio-electronics.com/info/broadcast/digital-video-broadcasting/what-is-dvb-t-basics-tutorial.php", "passage_text": "DVB-T or Digital Video Broadcast-Terrestrial is the most widely used digital television standard in use around the globe for terrestrial television transmissions. It provides many facilities and enables a far more efficient use of the available radio frequency spectrum than the previous analogue transmissions. - an overview, information or tutorial about the basics of what is DVB-T, Digital Video Broadcast-Terrestrial, the digital television format adopted around the globe. 1  DVB basics tutorial."}, {"url": "http://vistabeam.com/5g-fixed-terrestrial-wireless/", "passage_text": "Fixed Terrestrial Wireless systems utilize high gain, fixed point antennas that can maintain a very high signal-to-noise ratio (SNR). SNR is one of the primary factors determining the speed and reliability of a broadband system. "}, {"url": "http://www.sabc.co.za/wps/portal/SABC/dtt", "passage_text": "• Terrestrial television uses a network of transmission towers to relay the signal across the country. Each transmission tower has a specific area of coverage, and it is the network of coverage that provides television signals across the country. The migration is in line with international standards and trends. 2. BSD-Broadcast Signal Distribution: Broadcasting signals that are intended for general reception. 3. DTT-Digital Terrestrial Television/Transmission: It refers to the broadcasting of terrestrial television in a digital format."}, {"url": "https://en.wikipedia.org/wiki/Terrestrial_television", "passage_text": "(January 2010). Terrestrial television is a type of television broadcasting in which the television signal is transmitted by radio waves to the TV receiver from a terrestrial (Earth based) transmitter, a television station, and received with an antenna. The rise of digital terrestrial television, especially high-definition television (HDTV), may mark an end to the decline of broadcast television reception by traditional receiving antennas, which can receive over-the-air HDTV signals."}]