[{"url": "https://en.wikipedia.org/wiki/Nanocomposite", "passage_text": "The reinforcing material can be made up of particles (e.g. minerals), sheets (e.g. exfoliated clay stacks) or fibres (e.g. carbon nanotubes or electrospun fibres). The area of the interface between the matrix and reinforcement phase(s) is typically an order of magnitude greater than for conventional composite materials. The matrix material properties are significantly affected in the vicinity of the reinforcement. In this group of composites the main part of the volume is occupied by a ceramic, i.e. a chemical compound from the group of oxides, nitrides, borides, silicides etc.. In most cases, ceramic-matrix nanocomposites encompass a metal as the second component."}, {"url": "http://www.wisegeek.com/what-is-a-nanocomposite.htm", "passage_text": "A nanocomposite is a manmade material designed for enhanced performance in any number of unique applications: structural, functional or cosmetic. Of the many applications for nanocomposite materials, a few of interest are electronic, optical and biomedical. Nanocomposites combining a polymer base medium with carbon nanotubes are used in the packaging of electronics that require housings to dissipate static electrical charges and thermal buildups."}, {"url": "https://en.wikipedia.org/wiki/Nanocomposite", "passage_text": "Another kind of nanocomposite is the energetic nanocomposite, generally as a hybrid sol–gel with a silica base, which, when combined with metal oxides and nano-scale aluminum powder, can form superthermite materials. In this group of composites the main part of the volume is occupied by a ceramic, i.e. a chemical compound from the group of oxides, nitrides, borides, silicides etc.. In most cases, ceramic-matrix nanocomposites encompass a metal as the second component."}, {"url": "http://www.understandingnano.com/nanocomposites-applications.html", "passage_text": "Using nanocomposites to make flexible batteries. A nanocomposite of cellulous materials and nanotubes could be used to make a conductive paper. When this conductive paper is soaked in an electrolyte, a flexible battery is formed. A survey of the applications of nanocomposites: The following survey of nanocomposite applications introduces you to many of the uses being explored, including: Producing batteries with greater power output. Researchers have developed a method to make anodes for lithium ion batteries from a composite formed with silicon nanospheres and carbon nanoparticles"}, {"url": "https://en.wikipedia.org/wiki/Nanocomposite", "passage_text": "From Wikipedia, the free encyclopedia. Nanocomposite is a multiphase solid material where one of the phases has one, two or three dimensions of less than 100 nanometers (nm), or structures having nano-scale repeat distances between the different phases that make up the material. In this group of composites the main part of the volume is occupied by a ceramic, i.e. a chemical compound from the group of oxides, nitrides, borides, silicides etc.. In most cases, ceramic-matrix nanocomposites encompass a metal as the second component."}, {"url": "https://en.wikipedia.org/wiki/Polymer_nanocomposite", "passage_text": "Polymer nanocomposites (PNC) consist of a polymer or copolymer having nanoparticles or nanofillers dispersed in the polymer matrix. These may be of different shape (e.g., platelets, fibers, spheroids), but at least one dimension must be in the range of 1–50 nm. These PNC's belong to the category of multi-phase systems (MPS, viz. blends, composites, and foams) that consume nearly 95% of plastics production. This affects the properties of the particles when they are reacting with other particles. Because of the higher surface area of the nano-particles, the interaction with the other particles within the mixture is more and this increases the strength, heat resistance, etc. and many factors do change for the mixture."}, {"url": "http://www.understandingnano.com/nanocomposites-applications.html", "passage_text": "Nanocomposites, their Uses and Applications. A nanocomposite is a matrix to which nanoparticles have been added to improve a particular property of the material. The properties of nanocomposites ha ve caused researchers and companies to consider using this material in several fields. A survey of the applications of nanocomposites: The following survey of nanocomposite applications introduces you to many of the uses being explored, including: Producing batteries with greater power output. Researchers have developed a method to make anodes for lithium ion batteries from a composite formed with silicon nanospheres and carbon nanoparticle"}, {"url": "http://www.cem.msu.edu/~kanatzid/Nanocomposites.html", "passage_text": "The definition of nano-composite material has broadened significantly to encompass a large variety of systems such as one-dimensional, two-dimensional, three-dimensional and amorphous materials, made of distinctly dissimilar components and mixed at the nanometer scale. The general class of organic/inorganic nanocomposites may also be of relevance to issues of bio-ceramics and biomineralization in which in-situ growth and polymerization of biopolymer and inorganic matrix is occurring."}]