[{"url": "http://www.agius.com/hew/resource/expos.htm", "passage_text": "Occupational exposure is a measure of the intensity and/or extent to which the human body experiences a particular hazard. For a given hazard, the greater the exposure the greater the risk of an adverse effect on health. This is because of the exposure-response relationship. Occupational Exposure. Exposure is determined by various factors including the time-exposed (duration), and factors such as the concentration of a substance inhaled, the intensity of a radiation field etc."}, {"url": "https://www.osha.gov/dsg/annotated-pels/", "passage_text": "OSHA recognizes that many of its permissible exposure limits (PELs) are outdated and inadequate for ensuring protection of worker health. Most of OSHA’s PELs were issued shortly after adoption of the Occupational Safety and Health (OSH) Act in 1970, and have not been updated since that time. "}, {"url": "http://www.businessdictionary.com/definition/occupational-exposure-limit.html", "passage_text": "Definition. Legally enforceable limit on the amount or concentration of a substance in the work environment to which employees/workers may be exposed during a specified period. "}, {"url": "https://en.wikipedia.org/wiki/Permissible_exposure_limit", "passage_text": "Excursion limits are enforced in some states (for example Oregon) and on the federal level for certain contaminants such as asbestos. A short-term exposure limit is one that addresses the average exposure over a 15-30 minute period of maximum exposure during a single work shift. A ceiling limit is one that may not be exceeded for any period of time, and is applied to irritants and other materials that have immediate effect"}, {"url": "https://en.wikipedia.org/wiki/Permissible_exposure_limit", "passage_text": "The permissible exposure limit (PEL or OSHA PEL) is a legal limit in the United States for exposure of an employee to a chemical substance or physical agent. For chemicals, the chemical regulation is usually expressed in parts per million (ppm), or sometimes in milligrams per cubic meter (mg/m 3). A short-term exposure limit is one that addresses the average exposure over a 15-30 minute period of maximum exposure during a single work shift."}, {"url": "https://www.osha.gov/SLTC/toluene/exposure_limits.html", "passage_text": "Occupational Exposure Limits. The amount of toluene that a worker breathes over a work day is determined by the concentration in air, and the length of time the worker is in that atmosphere. Enforceable limits in the United States for the concentration in air have been established by Federal OSHA"}, {"url": "http://thelawdictionary.org/occupational-exposure-limit/", "passage_text": "Did you find this definition of OCCUPATIONAL EXPOSURE LIMIT helpful? You can share it by copying the code below and adding it to your blog or web page. "}, {"url": "http://www.labour.gov.on.ca/english/hs/topics/oels.php", "passage_text": "Occupational Exposure Limits (. s) restrict the amount and length of time a worker is exposed to airborne concentrations of hazardous biological or chemical agents. There are. s for over 725 substances under R.R.O. 1990, Regulation 833 (Control of Exposure to Biological or Chemical Agents) and Ontario Regulation 490/09 (Designated Substances) under Ontario’s Occupational Health and Safety Act."}, {"url": "http://www.ehs.wisc.edu/chem/OccupationalExposureLimits.pdf", "passage_text": "Below is some information on the major occupational exposure values. Permissible Exposure Limits (PELs): The Occupational Health and Safety Administration (OSHA) has set permissible exposure limits (PELs) on the amount or concentration of a substance in the air. Some of the PELs are listed as ceiling values – concentrations above which a worker should never be exposed, or short-term exposure limits (STELs) –average concentrations which should not be exceeded over a 15 minute time period. It is important to note that the PELs tend to be higher than other published values."}, {"url": "https://www.osha.gov/SLTC/toluene/exposure_limits.html", "passage_text": "Certain OSHA State Plan states, such as the California OSHA program, have limits as well. Recommendations for exposure limits have been made by the National Institute for Occupational Safety and Health (NIOSH) and the American Conference of Governmental Industrial Hygienists. The Hazard Communication Standard requires that the Threshold Limit Value (TLV) be disclosed on a safety data sheet. The amount of toluene that a worker breathes over a work day is determined by the concentration in air, and the length of time the worker is in that atmosphere."}]