[{"url": "http://medical-dictionary.thefreedictionary.com/trigeminal+neuralgia", "passage_text": "Trigeminal neuralgia is a disorder of the trigeminal nerve (the fifth cranial nerve) that causes episodes of sharp, stabbing pain in the cheek, lips, gums, or chin on one side of the face. trigeminal neuralgia, a neurologic condition of the trigeminal facial nerve, characterized by paroxysms of flashing, stablike pain radiating along the course of a branch of the nerve from the angle of the jaw."}, {"url": "http://www.thefreedictionary.com/trigeminal", "passage_text": "1. trigeminal-the main sensory nerve of the face and motor nerve for the muscles of mastication. fifth cranial nerve, nervus trigeminus, trigeminal nerve, trigeminus. cranial nerve-any of the 12 paired nerves that originate in the brain stem. trigeminal. adj. 1. (Anatomy) anatomy of or relating to the trigeminal nerve."}, {"url": "http://medical-dictionary.thefreedictionary.com/trigeminal", "passage_text": "pertaining to the fifth cranial nerve (trigeminal nerve). trigeminal nerve the fifth cranial nerve; it arises in the pons, is composed of sensory and motor fibers, and has three divisions: ophthalmic, maxillary, and mandibular. 2. pertaining to the fifth cranial (trigeminal) nerve. trigeminal nerve paralysis. causes an inability to close the mouth (dropped jaw), difficulty in mastication and atrophy of the masticatory muscles. See also mandibular neurapraxia."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=26023", "passage_text": "Inflammation of the trigeminal nerve (the fifth cranial nerve) that most commonly causes paroxysms of very intense lightning pain in the areas of the face the nerve supplies -- the lips, eye, nose, scalp, forehead, gums, cheek, and chin -- on the involved side of the face. "}, {"url": "http://www.merriam-webster.com/dictionary/trigeminal", "passage_text": "Definition of TRIGEMINAL. : of or relating to the trigeminal nerve. ADVERTISEMENT."}, {"url": "http://www.merriam-webster.com/dictionary/trigeminal%20nerve", "passage_text": "Definition of TRIGEMINAL NERVE. : either of a pair of large mixed nerves that are the fifth cranial nerves and supply motor and sensory fibers mostly to the face —called also trigeminal. ADVERTISEMENT. noun."}, {"url": "https://en.wikipedia.org/wiki/Trigeminal_neuralgia", "passage_text": "Trigeminal neuralgia (TN, or TGN), also known as prosopalgia, tic doloureux, or Fothergill's disease is a neuropathic disorder characterized by episodes of intense pain in the face. It has been described as among the most painful conditions known. The pain of TN is from the trigeminal nerve. The trigeminal nerve is a paired cranial nerve that has three major branches: the ophthalmic nerve (V 1), the maxillary nerve (V 2), and the mandibular nerve (V 3). One, two, or all three branches of the nerve may be affected"}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=7608", "passage_text": "Trigeminal nerve: The chief nerve of sensation for the face, which is also the motor nerve that controls the muscles used for chewing. Problems with the sensory part of the trigeminal nerve result in pain or loss of sensation in the face. Problems with the motor root of the trigeminal nerve result in deviation of the jaw toward the affected side and trouble chewing. The trigeminal nerve is the fifth cranial nerve"}, {"url": "http://www.mayoclinic.org/diseases-conditions/trigeminal-neuralgia/basics/definition/CON-20043802", "passage_text": "Trigeminal neuralgia is a chronic pain condition that affects the trigeminal nerve, which carries sensation from your face to your brain. If you have trigeminal neuralgia, even mild stimulation of your face — such as from brushing your teeth or putting on makeup — may trigger a jolt of excruciating pain. "}]