[{"url": "https://www.brown.edu/admission/undergraduate/explore/admission-facts", "passage_text": "Consider that within 10 years of graduation, 80% of Brown students have furthered their education through graduate school or professional study. Our 85% admission rate to medical school and 89% admission rate to law school are both far above the national average. We've compiled some Admission data for you on a variety of subjects below. For more facts about Brown in general, please visit the facts page on our main website."}, {"url": "http://www.prepscholar.com/sat/s/colleges/Brown-University-SAT-scores-GPA", "passage_text": "The average GPA at Brown University is 4.05. This makes Brown University Extremely Competitive for GPAs. (Most schools use a weighted GPA out of 4.0, though some report an unweighted GPA. This school did not officially report its average GPA, but we've estimated it here using data from over 1,000 schools.). With a GPA of 4.05, Brown University requires you to be at the top of your class. Average SAT: 2155. The average SAT score composite at Brown University is a 2155. The 25th percentile SAT score is 2000, and the 75th percentile SAT score is 2310. In other words, a 2000 places you below average, while a 2310 will move you up to above average."}, {"url": "http://www.acceptancerate.com/schools/brown-university", "passage_text": "Over nine thousand students are enrolled at Brown University. Students can submit either the SAT or ACT exam scores at this school. A score within the range of 2000 - 2310 on the SAT exam, or 29 - 34 on the ACT exam is among the 25th - 75th percentile range among admitted students. By applying sampled GPA data from over 150 schools, we are able to estimate that the Brown University average GPA ranges from 3.82 to 4 for accepted students. The acceptance rate of this school is considered highly competitive, with only 9% of those who applied applicants on average being admitted. Overall Brown University Acceptance Rate-Fall 2013. 9.2%. The overall acceptance rate for Brown University was reported as 9.2% in Fall 2013 with over 28,900 applications submitted to"}, {"url": "http://www.prepscholar.com/act/s/colleges/Brown-University-ACT-scores-GPA", "passage_text": "The average ACT score composite at Brown University is a 32. The 25th percentile ACT score is 29, and the 75th percentile ACT score is 34. In other words, a 29 places you below average, while a 34 will move you up to above average. This makes Brown University Extremely Competitive for GPAs. (Most schools use a weighted GPA out of 4.0, though some report an unweighted GPA. This school did not officially report its average GPA, but we've estimated it here using data from over 1,000 schools.)."}, {"url": "http://talk.collegeconfidential.com/brown-university/923193-average-gpa-of-brown-students.html", "passage_text": "Obviously this number is high, though it's noteworthy that Brown students are, as a whole, less concerned with grades than students at comparable schools. The transcript is a more useful tool than this simple number for comparing students, but the number does serve to give a general sense of the grade breakdown. From this, we could calculate that the average GPA is roughly, unless I made a mistake, 3.61 (note that averaging the course grades does not necessarily yield the average GPA, but it should be somewhat close). Adding in failures, which do not appear on the external transcript, we get 3.44."}, {"url": "http://www.acceptancerate.com/schools/brown-university", "passage_text": "Brown University has a very competitive selection process for applicants, where most students accepted have a higher than average high school GPA and scored in the top percentiles on standardized tests like the SAT or ACT exam. Overall Brown University Acceptance Rate-Fall 2013. 9.2%. The overall acceptance rate for Brown University was reported as 9.2% in Fall 2013 with over 28,900 applications submitted to this school."}, {"url": "http://talk.collegeconfidential.com/brown-university/923193-average-gpa-of-brown-students.html", "passage_text": "Brown does not calculate GPA. With that said, here are some statistics (and I'll go as far as to calculate the sort of GPA that students may calculate from this information). (Data source: http://www.brown.edu/Administration/Institutional_Research/documents/TABLE21.pdf). From this, we could calculate that the average GPA is roughly, unless I made a mistake, 3.61 (note that averaging the course grades does not necessarily yield the average GPA, but it should be somewhat close). Adding in failures, which do not appear on the external transcript, we get 3.44."}, {"url": "http://www.prepscholar.com/act/s/colleges/Brown-University-ACT-scores-GPA", "passage_text": "The average GPA at Brown University is 4.03. This makes Brown University Extremely Competitive for GPAs. (Most schools use a weighted GPA out of 4.0, though some report an unweighted GPA. This school did not officially report its average GPA, but we've estimated it here using data from over 1,000 schools.). With a GPA of 4.03, Brown University requires you to be at the top of your class"}, {"url": "http://collegeapps.about.com/od/GPA-SAT-ACT-Graphs/ss/brown-admission-gpa-sat-act.htm", "passage_text": "In the graph above, the blue and green represent accepted students. You can see that the great majority of students who got into Brown University have a nearly perfect 4.0 GPA, an ACT composite score above 30, and a combined SAT score (CR+M+W) of above 2100. As the graph shows, a few students were accepted with test scores and grades below the norm. Brown University, like all members of the Ivy League, has holistic admissions, so the admissions officers are evaluating students based on more than numerical data."}]