[{"url": "http://www.answers.com/Q/What_are_the_normal_limits_of_pulse_rates", "passage_text": "The normal pulse rate for an adult is 60 to 100 beats per minute. In general, people that are physically fit have lower resting pulse rates, while people that are less physica … lly fit tend to have a bit higher resting pulse rates. 3 people found this useful. Normal adult pulse rate should be between 80-100 bpm. Factors such as cardiovascular and overall fitness, height/weight ratio, and genetics may affect this number. For exa … mple, a distance runner may have a resting heart rate of 35 or 40, while an obese adult may have a resting heart rate of 85."}, {"url": "http://www.urmc.rochester.edu/encyclopedia/content.aspx?ContentTypeID=85&ContentID=P00866", "passage_text": "Strength of the pulse. The normal pulse for healthy adults ranges from 60 to 100 beats per minute. The pulse rate may fluctuate and increase with exercise, illness, injury, and emotions. Females ages 12 and older, in general, tend to have faster heart rates than do males. "}, {"url": "http://www.answers.com/Q/What_are_the_normal_limits_of_pulse_rates", "passage_text": "A normal pulse rate for a resting person should be around 60 beats per minute. During exercise, depending on what kind of exercise one is doing, a normal pulse should be betw … een 100 and 180 beats per minute. + 13 others found this useful. Kathleen Durand. Normal adult pulse rate should be between 80-100 bpm. Factors such as cardiovascular and overall fitness, height/weight ratio, and genetics may affect this number. For exa … mple, a distance runner may have a resting heart rate of 35 or 40, while an obese adult may have a resting heart rate of 85."}, {"url": "http://www.buzzle.com/articles/normal-pulse-rate.html", "passage_text": "The rate at which your heart beats when you are resting is considered your normal pulse rate, and is measured in beats per minute (BPM). Normal Pulse Rate for Adults and Children. A pulse rate of 60-100 BPM is usually considered normal, but then, there exist a few exceptions to this rule. While a well-conditioned athlete can have a heart rate of 40 BPM, in a newborn the same can be as high as 180-190 BPM. A convenient way to determine your pulse rate (heart beats per minute) is to count the beats for 10 seconds, and multiply the number by 6. If you get 12 beats in 10 seconds, you will have to multiply 12 by 6."}, {"url": "http://www.nhs.uk/chq/Pages/2024.aspx?CategoryID=52", "passage_text": "Most adults have a resting heart rate of 60-100 beats per minute (bpm). The fitter you are, the lower your resting heart rate is likely to be. For example, athletes may have a resting heart rate of 40-60 bpm or lower. You should contact your GP if you think your heart rate is continuously above 120 bpm or below 40 bpm, although this could just be normal for you."}, {"url": "http://www.medicalnewstoday.com/articles/235710.php", "passage_text": "How to measure your pulse and heart rate. Your pulse is your heart rate, or the number of times your heart beats in one minute. 2 Pulse rates vary from person to person. Your pulse is lower when you are at rest and increases when you exercise (more oxygen-rich blood is needed by the body when you exercise). 1 A normal adult resting heart beat is between 60-100 heartbeats per minute. 2  Some experienced athletes may see their resting heartrate fall below 60 beats per minute. 3  Tachycardia refers to the heart beating too fast at rest-over 10"}, {"url": "http://www.hopkinsmedicine.org/healthlibrary/conditions/cardiovascular_diseases/vital_signs_body_temperature_pulse_rate_respiration_rate_blood_pressure_85,P00866/", "passage_text": "The pulse rate is a measurement of the heart rate, or the number of times the heart beats per minute. As the heart pushes blood through the arteries, the arteries expand and contract with the flow of the blood. Taking a pulse not only measures the heart rate, but also can indicate the following: Heart rhythm. Strength of the pulse. The normal pulse for healthy adults ranges from 60 to 100 beats per minute. The pulse rate may fluctuate and increase with exercise, illness, injury, and emotions. Females ages 12 and older, in general, tend to have faster heart rates than do males"}, {"url": "http://www.drjohnm.org/2011/08/whats-a-normal-heart-rate/", "passage_text": "As a heart rhythm specialist, I am often asked to see patients referred for low or high heart rates. We are asked to be the judge for what is “normal.”. The old school teaching holds that the normal resting heart rate is greater than 55 and less than 100 beats per minute (bpm). Maximal heart rates are estimated by the well known formula: 220 – your age = Max heart rate. "}]