[{"url": "http://www.fpl.info/kidsweb/extras/makeachart/makeachart.html", "passage_text": "STEP 6. 1  If you want to change the colors of the bars on your chart (Microsoft Word calls these the data points): 2  Make sure the chart is selected (a rectangle should show up around the chart. 3  Click on of the bars. 4  Now single click on the bar whose color you want to change. 5  Then use the RIGHT mouse button to click the same bar, and select Format ... STEP 5. 1  To add a title to your chart and show the value of your data: 2  Make sure the chart is selected (a rectangle should show up around the chart. 3  Then on the menu bar, click. 4  Type the title in the Chart Title box. 5  Click the Data Labels tab and click Show Value. 6  Click OK to close the Chart Options box."}, {"url": "http://blog.hubspot.com/marketing/how-to-build-excel-graph", "passage_text": "To make a bar graph, highlight the data and include the titles of the X and Y axis. Go to the ‘Insert’ tab, click ‘Charts,’ click ‘Column,’ and choose the graph you wish. In this example, I will be picking the first 2-D Column choice -- just because I prefer it over the 3-D look. Step 3: Switch axes, if necessary. To make a bar graph, highlight the data and include the titles of the X and Y axis. Go to the ‘ Insert ’ tab, click ‘ Charts ,’ click ‘ Column "}, {"url": "http://www.mathsisfun.com/data/bar-graph.html", "passage_text": "Make a Bar Graph. Bar Graphs are a good way to show relative sizes. Click on the graph to set bar heights. You can also put your own labels and title. Try the new version  Data Graphs  (includes Line and Pie Chart). Graphs Index"}, {"url": "http://www.wikihow.com/Make-a-Bar-Graph-in-Excel", "passage_text": "1. Click on the arrow next to the type of chart you would like to make. If you want a traditional bar graph, you will choose Bar.. If you want a vertical graph, click the arrow next to Column.. 2. Select the type of bar graph you want from the choices available in the Bar menu. You can choose 2-D, 3-D, Cylinder, Cone or Pyramid shaped bar graphs. 1  You can also choose to cluster or stack your bar graph to highlight a second type of data in your data series"}, {"url": "http://staff.argyll.epsb.ca/jreed/comphelp/bargrphMS.html", "passage_text": "Highlight the portion of your data that you want to include in your pie chart and press on the tool bar at the top of the page. If you click on a category of graphs in the left-hand column, the various options for that type of graph are displayed on the right. To choose from the many options, just click on the graph of choice. It is likely that you should make a bar graph (i.e., Column) of the 1st sub-type. "}, {"url": "http://www.wikihow.com/Make-Bar-Graphs", "passage_text": "A bar graph, also known as a bar chart, is a graph that uses rectangular bars to represent different values to show comparisons among categories, such as the amount of rainfall that occurred during different months of a year, or the average salary in different states. //d5kh2btv85w9n.cloudfront.net/7/7f/Make Bar Graphs Step 1 Version 4.360p.mp4. 1  Another use of rectangular bars on a graph is called a histogram , not bar graph, to display a continuous range of data in increasing or decreasing value in a list of equally divided range segments to show how these compare."}, {"url": "http://www.wikihow.com/Make-a-Bar-Graph-in-Excel", "passage_text": "3. Double click the area near the exterior of your bar graph. Choose a different font or formatting for the outside area of the graph. Click Ok after you make your changes. 1  Click on Alt Text to name your graph and add a description. 2  Click on Properties to choose the object positioning. Click on the arrow next to the type of chart you would like to make. If you want a traditional bar graph, you will choose Bar.. If you want a vertical graph, click the arrow next to Column.. 2. Select the type of bar graph you want from the choices available in the Bar menu."}, {"url": "http://www.chartgo.com/en/chartbar.jsp", "passage_text": "Bar Chart Create bar charts with specific settings such as bar shades, bar layout or bar shapes. Simply pick your general chart settings, then choose your bar specifics settings and finally paste your data in the data fields. Create a bar graph online. PREVIEW. "}, {"url": "http://blog.hubspot.com/marketing/how-to-build-excel-graph", "passage_text": "The data I'm working with will look best in a bar graph, so let's pursue making that one. To make a bar graph, highlight the data and include the titles of the X and Y axis. Go to the ‘ Insert ’ tab, click ‘ Charts ,’ click ‘ Column ,’ and choose the graph you wish. In this example, I will be picking the first 2-D Column choice -- just because I prefer it over the 3-D look"}]