[{"url": "https://www.linkedin.com/company/alps-a-dst-company/careers", "passage_text": "Headquartered in Denver, with offices in Boston, New York, Seattle, and Toronto, ALPS, a wholly-owned subsidiary of DST Systems, Inc., today represents more than 500 employees, over 200 clients, and an executive team that has been in place for more than 18 years. "}, {"url": "http://finance.yahoo.com/q?s=APELF", "passage_text": "Business Summary. Alps Electric Co., Ltd. engages in the development, manufacture, and marketing of electronic components worldwide. The company operates in three segments: Electronic Components, Automotive Infotainment, and Logistics."}, {"url": "http://www.alpsinc.com/about-alps.php", "passage_text": "ALPS is solely focused on providing a suite of asset servicing and asset gathering solutions to the investment management industry. Clients successfully leverage both aspects of ALPS to combine a top-rated fund servicing model with the expertise needed to raise assets. Management at ALPS has made a conscious decision to control growth so that we never have to compromise our service levels or our reputation in the industry for delivering tailored, high-touch services to our clients."}, {"url": "https://en.wikipedia.org/wiki/Alps_Electric", "passage_text": "The company was established in 1948 as Kataoka Electric Co., Ltd. and changed its name to Alps Electric Co., Ltd. in December 1964. Since June 22, 2012, the President has been Toshihiro Kuriyama and Chairman is Masataka Kataoka. Alps is also well known for the Alpine brand of car audio. Alps touchpad hardware is developed and manufactured by the Cirque Corporation, which they acquired in 2003; however, the parent company continues to write their own drivers. Their drivers are Windows certified. They are mostly found in Sony, Toshiba and Dell notebooks, as well as the OLPC XO-1."}, {"url": "http://www.alpsinc.com/", "passage_text": "Headquartered in Denver, with offices in Boston, New York, Seattle, and Toronto, ALPS, a wholly-owned subsidiary of DST Systems, Inc., today represents more than 500 employees, over 250 clients, and an executive team that has been in place for more than 20 years. Learn More. "}, {"url": "https://en.wikipedia.org/wiki/Alps_Electric", "passage_text": "Alps Group comprises 84 subsidiary companies, 25 through Alps Electric, 32 through Alpine Electronics and 27 through Alps Logistics. The company is listed on the Tokyo Stock Exchange and a constituent of the Nikkei 225 stock index. Alps touchpad hardware is developed and manufactured by the Cirque Corporation, which they acquired in 2003; however, the parent company continues to write their own drivers. Their drivers are Windows certified. They are mostly found in Sony, Toshiba and Dell notebooks, as well as the OLPC XO-1."}, {"url": "http://finance.yahoo.com/q?s=AMLP", "passage_text": "Fund Summary. The investment seeks investment results that correspond (before fees and expenses) generally to the price and yield performance of its underlying index, the Alerian MLP Infrastructure Index. The fund will normally invest at least 90% of its total assets in securities that comprise the underlying index. "}, {"url": "http://www.reuters.com/finance/stocks/overview?symbol=6770.T", "passage_text": "About. ALPS ELECTRIC CO., LTD. is a Japan-based company mainly engaged in the manufacture and sale of electronic components and audio equipment. The Company operates in three segments. The Electronic Component segment is engaged in the manufacture and sale of various electronic components. The Audio segment is engaged in the developmen... (more). ¥1,631. ALPS ELECTRIC CO., LTD. is a Japan-based company mainly engaged in the manufacture and sale of electronic components and audio equipment."}, {"url": "http://www.alpsredrocks.com/", "passage_text": "Learn More. Red Rocks Capital, LLC, a wholly owned subsidiary of ALPS, A DST Company, is an asset management firm specializing in listed private equity and other private asset investments. "}]