[{"url": "http://www.answers.com/Q/What_does_tokidoki_mean_in_Japanese", "passage_text": "exists and is an alternate of. Merge this question into. Split and merge into it. Answer by Answers Publisher. Confidence votes 261K. The definition of the word Tokidoki, means sometimes. Tokidoki was created in 2005 and inspired by the Japanese lifestyle. The Tokidoki logo is a heart over to crossbones."}, {"url": "http://www.thisisalimitededition.com/artist/view/tokidoki/", "passage_text": "tokidoki. S imone Legno’s tokidoki is one of the most recognisable artist driven brands on Earth. The Roman born, now Los Angeles based, artist has created a sprawling colourful world full of cute characters and beautifully drawn girls, a sexy and fun-packed adventure awaits at every turn. An adventure that derives from Simone’s Italian background and his love for all things Japanese. tokidoki characters and artwork have adorned everything from vinyl toys and clothing, to cool artistic limited edition collaborations with Karl Lagerfeld, Guggenheim, Hello Kitty, MLB and more."}, {"url": "http://www.ebay.com/sch/i.html?_nkw=Tokidoki+The", "passage_text": "Tokidoki The. Follow Tokidoki The to get e-mail alerts and updates on your eBay Feed. Unfollow Tokidoki The to stop getting updates on your eBay Feed. Yay! You're now following Tokidoki The in your eBay Feed."}, {"url": "http://www.tokidoki.it/about/", "passage_text": "About tokidoki. Headquartered in Los Angeles, CA, tokidoki was founded in 2003 by designer Simone Legno and his partners Pooneh Mohajer and Ivan Arnold. An innovative line of apparel, handbags, cosmetics, accessories and more, tokidoki has built a worldwide following with its larger-than-life characters and designs. "}, {"url": "http://www.ebay.com/sch/i.html?_nkw=tokidoki", "passage_text": "Follow tokidoki to get e-mail alerts and updates on your eBay Feed. Unfollow tokidoki to stop getting updates on your eBay Feed. Yay! You're now following tokidoki in your eBay Feed. "}, {"url": "https://www.facebook.com/Tokidoki", "passage_text": "tokidoki. September 16 at 12:43pm ·. We, along with the San Francisco Giants, are excited to welcome you to AT&T Park to join us for a tokidoki extravaganza. Various pre-game and in-game components will be tokidoki-themed, providing a family-fun atmosphere that Giants and tokidoki fans of all ages will enjoy! "}, {"url": "http://www.tokidokilove.com/what-is-tokidoki", "passage_text": "Overview. Tokidoki. tokidoki is a popular designer brand that was created in 2005 by Italian artist Simone Legno and partners in business Ivan Arnold and Pooneh Mohajer. The name tokidoki is derived from the Japanese word “sometimes”. The company is famous for producing a wide range of exotic bags and handbags. "}, {"url": "https://en.wikipedia.org/wiki/Tokidoki", "passage_text": "tokidoki ( sometimes  in Japanese) is the Japanese-inspired lifestyle brand created in 2005 by Italian artist Simone Legno and his business partners Pooneh Mohajer and Ivan Arnold. They produce apparel, footwear, accessories and other products using art, iconic characters and the logo designed by Simone Legno. "}]