[{"url": "http://www.wikihow.com/Tell-How-Old-a-Kitten-Is", "passage_text": "1 A kitten weighing between 1.5 pounds to 2 pounds (680g-900g) is likely 7-8 weeks old. 2  The average cat aged three months or more will weigh one pound per month of age until its weight stabilizes at around 10 pounds. 3  So, a 3-pound cat will likely be 3 months old, and a 4-pound cat will be 4 months old. A good way to assess the age of both young and juvenile kittens is to check the presence and development of her teeth. A kitten with no teeth is likely a newborn, younger than 2 weeks of age. If teeth are present, you can still estimate the age based on the number and characteristics of the teeth."}, {"url": "http://www.wikihow.com/Tell-How-Old-a-Kitten-Is", "passage_text": "1 Kittens do not open their eyes until they reach about ten to 14 days in age, but some do open their eyes as early as 7 to 10 days. 2  If your kitten has closed eyes, he is likely a newborn. 3  If your kitten has already opened its eyes, she is at least a full week old. A good way to assess the age of both young and juvenile kittens is to check the presence and development of her teeth. A kitten with no teeth is likely a newborn, younger than 2 weeks of age. If teeth are present, you can still estimate the age based on the number and characteristics of the teeth."}, {"url": "http://cats.about.com/od/catcare/f/catsage.htm", "passage_text": "Female cats will have their first estrus cycle sometime between the ages of five and twelve months. A female cat will tell you she is experiencing estrus very visibly and vocally. According to PetEducation.com, length of daylight and weight of the cat also have some effect on the time of the queen's first estrus cycle. In older cats, the amount of staining (tartar) is also an indicator of age, which veterinarian's use. However, with pets' tooth cleaning products readily available, tartar may not be a good indicator, depending on the diligence of the cat's caregiver in providing a dental care program."}, {"url": "http://pets.thenest.com/long-cat-kitten-10750.html", "passage_text": "Age Range for a Kitten. Your kitten grows fast. He’ll reach adolescence much sooner than a human child. From birth to about 6 months of age, your feline is officially a kitten; then, as he enters puberty, he leaves kittenhood behind. From here until his 6th birthday, he’s considered a young adult."}, {"url": "https://answers.yahoo.com/question/index?qid=20100111000352AAhrWSv", "passage_text": "infant until about 8weeks. kitten until about 6 months. teenager until about 2 years. adult until about 10 years. senior for the rest of her life. many just call kitten from birth to 1 year. but, it learns to walk and feed itself by 8 weeks and is sexually mature at 6 months, so it really isn't a kitten. Jr. is angry · 6 years ago."}, {"url": "http://www.catster.com/lifestyle/how-can-you-tell-how-old-a-cat-kitten-is-age-ask-a-vet", "passage_text": "The many rules of thumb that are available to compare cat ages to human ages are usually based upon total life expectancy. An average cat’s life expectancy is around 17 years, and a human’s is around 84 years. This leads to a rough equivalency of five-to-one. But it is not an apples-to-apples comparison. Conventional wisdom holds that each year for a cat is equivalent to seven years of development and aging for a person. Or that each cat year is equivalent to five human years. Or that the first two years are equivalent to 21 years, and each subsequent year is equivalent to four or five years."}, {"url": "http://www.peteducation.com/article.cfm?c=1+2139&aid=922", "passage_text": "At what age can a cat have her first litter? Puberty (the age at which animals can reproduce) in the cat ranges from 4 to 12 months, with the average being 6 to 9 months. At puberty, cats are generally about 75% of their mature body weight. Domestic shorthair cats, as a breed, generally reach puberty earlier than domestic longhair cats. "}, {"url": "http://www.catster.com/cats-101/calculate-cat-age-in-cat-years", "passage_text": "And a kitten’s teeth first come in between two to four weeks; their more permanent set appears at around four months of age. So if you open a cat’s mouth and find permanent, white teeth, the feline is likely to be around a year old. A popular misconception is that cats age seven years (in human years) for each calendar year. In fact, feline aging is much more rapid during the first two years of life. A cat reaches the approximate human age of 15 during its first year, then 24 at age 2"}]