[{"url": "http://www.suunto.com/en-US/Products/Dive-Computers-and-Instruments/suunto-zoop/suunto-zoop-yellow/", "passage_text": "THE ALL-TIME FAVORITE. Suunto Zoop is a great value, easy-to-use dive computer for recreational divers. Though Suunto Zoop is a great choice for your first dive computer, its full decompression capabilities and nitrox mode mean it’s designed to give you years of serious fun. PRODUCT HIGHLIGHTS."}, {"url": "http://www.scuba.com/scuba-gear-17/009449/Suunto-ZOOP--Air---Nitrox-Wrist-Computer.html", "passage_text": "THE ALL-TIME FAVORITE. Suunto Zoop is a great value, easy-to-use dive computer for recreational divers. Though Suunto Zoop is a great choice for your first dive computer, its full decompression capabilities and nitrox mode mean it’s designed to give you years of serious fun. PRODUCT HIGHLIGHTS."}, {"url": "http://www.ehow.com/how_7468704_set-suunto-core.html", "passage_text": "Back at the main menu, scroll to time/date and select date.. Use the [+] and [-LIGHT] buttons to set the year, month and day values and press [MODE] to exit. The Core allows you to also set the time for a different time zone. To do this press the [MODE] button and scroll to time/date and select dual time.. Use the [+] and [-LIGHT] buttons to set the hour and minute values"}, {"url": "http://www.dive-computer-wizard.com/products-suunto_zoop.html", "passage_text": "Suunto Zoop-All Dive Data In One Screen. I've bought Suunto Zoop as a backup computer to use it with my D6 and found it very easy to use and navigate. It has easy to follow documentation and I was ready to dive with it very quick."}, {"url": "http://www.suunto.com/en-US/Products/Dive-Computers-and-Instruments/suunto-zoop/suunto-zoop-yellow/", "passage_text": "Suunto Zoop/Vyper interactive learning tool Practice how to use Suunto Zoop or Vyper, such as setting up dive modes and viewing logs. Try the virtual air and nitrox dives to see how Zoop and Vyper work during a dive. The tool is available in English only. Suunto DM5 The Suunto DM5 allows you to download your dive logs for advanced analysis and create dive plans."}, {"url": "http://www.scuba.com/scuba-gear-17/009449/Suunto-ZOOP--Air---Nitrox-Wrist-Computer.html", "passage_text": "Suunto Zoop is a great value, easy-to-use dive computer for recreational divers. Though Suunto Zoop is a great choice for your first dive computer, its full decompression capabilities and nitrox mode mean it’s designed to give you years of serious fun."}]