[{"url": "http://ivn.us/2012/08/01/president-profile-of-the-day-dwight-d-eisenhower/", "passage_text": "The former president even installed a putting green on the White House lawn. 2. One often asks how Dwight D. Eisenhower came by the nickname, ‘Ike.’ It turns out ‘Ike’ was an Eisenhower family nickname. Eisenhower and all five of his brothers were nicknamed ‘Ike,’ at one time or another. 3. Dwight D. Eisenhower graduated 61 st in his class, out of his 164, from West Point. However, his undistinguished academic performance was not the only reason for his mediocre ranking. "}, {"url": "http://www.answers.com/Q/Which_President_was_nicknamed_Ike", "passage_text": "President Dwight David Eisenhower, 34th President of the United States of America, was nicknamed Ike. The Presidential campaign slogan, I like Ike, was derived from his ni … ckname. 1 person found this useful. Some of the them, such as Ike Eisenhower and Dutch Reagan got their nicknames when they were boys. Some such as Old Hickory Jackson and Old Rough and Ready picked up … nicknames from the men they commanded in the army. Others got their nicknames from campaigns and newspaper writers after they got into politics"}, {"url": "http://deadpresidents.tumblr.com/post/87172241567/why-was-eisenhower-called-ike", "passage_text": "They also called the future President by his middle name of “Dwight” rather than his given first name of “David” since that was his dad’s name instead of just naming him “Dwight David Eisenhower” in the first place. Dwight Eisenhower was the only one of his brothers who continued being called “Ike” past his childhood. Eisenhower himself was never really sure where the nickname came from, but some suggested that it was a shortened version of his nickname, although it seems like it would be much easier for his parents to just call the sons by their first names instead of shortening the last name that they all shared."}, {"url": "http://www.answers.com/Q/Why_was_President_Eisenhower's_nickname_Ike", "passage_text": "The reason his nickname was Ike is because that's what his parents used to call him. There was no reason, it just stuck with him through his whole life. Confidence votes 645. "}, {"url": "https://answers.yahoo.com/question/index?qid=20090224225631AA5Ezta", "passage_text": "Report Abuse. He was given the nickname Ike when he went off to college. His real name was actually David Dwight Eisenhower he reverse the order of his name on his college application and he's used ever since. His birthplace is one block away from where I live now. "}, {"url": "http://www.answers.com/Q/Which_President_was_nicknamed_Ike", "passage_text": "Dwight D. Eisenhower has the nickname of Ike. I like Ike appeared on his. campaign buttons. Some of the them, such as Ike Eisenhower and Dutch Reagan got their nicknames when they were boys. Some such as Old Hickory Jackson and Old Rough and Ready picked up … nicknames from the men they commanded in the army. Others got their nicknames from campaigns and newspaper writers after they got into politic"}]