[{"url": "https://en.wikipedia.org/wiki/Bill_Gates%27_house", "passage_text": "The Gates' Mansion is a large mansion that overlooks Lake Washington in Medina, Washington. The 66,000-square-foot (6,100 m 2) mansion is noted for its design and the technology it incorporates. It is nicknamed Xanadu 2.0 after the title character's estate in Citizen Kane. Many trees block much of the house from view from Lake Washington. The house was the result of a collaboration between Bohlin Cywinski Jackson Architects (based in Pennsylvania but with satellite offices in Seattle and San Francisco) and Cutler-Anderson Architects of Bainbridge Island"}, {"url": "http://www.priceline.com/hotel/POI-Medina_WA_Medina_Washington_United_States-88436106.html", "passage_text": "Hotels Near Medina, WA. Priceline can help you find great deals on high quality hotels near Medina, WA. If you know when you're traveling to Medina, WA, use the search box below to check prices and availability. For the deepest discounts, Name Your Own Price® for a Medina hotel."}, {"url": "http://www.historylink.org/index.cfm?displaypage=output.cfm&file_id=1059", "passage_text": "In 1940 the Lake Washington Floating Bridge opened south of Medina. It crossed the lake from Seattle's Mount Baker neighborhood via the northern end of Mercer Island to the eastern shore near Bellevue. Ferries that had cruised the lake for decades began disappearing. He wasted little time claiming his stake, and took ownership of land along Lake Washington from what later became NE 8th Street south to and including Dabney Point. By 1890 he'd built Medina's first ferry dock, Dabney's Landing, near the future location of NE 8th. Roads quickly followed."}, {"url": "http://www.medina-wa.gov/", "passage_text": "Welcome to Medina. Located on the West end of Bellevue, and just across the lake from Seattle, Medina makes up a large part of the Lake Washington waterfront, while having just over 3,000 total residents. Medina’s schools are part of the larger City of Bellevue School District, which is one of the top ranking and award winning school districts in the nation. The City takes safety and security seriously, with highly visible police officers using current technology to create and maintain a safe small town community."}, {"url": "https://en.wikipedia.org/wiki/Medina,_Washington", "passage_text": "Medina (/məˈdaɪnə/) is a city located in the Eastside, a region of King County, Washington, United States. Surrounded on the north, west, and south by Lake Washington, opposite Seattle, Medina is bordered by Clyde Hill and Hunts Point, as well as the satellite city of Bellevue. The city's population was 2,969 at the 2010 census. The city is mostly residential and includes Bill Gates' house. Medina has the second highest per-capita income in the state of Washington and the 49th highest in the United States."}, {"url": "http://www.historylink.org/index.cfm?displaypage=output.cfm&file_id=1059", "passage_text": "HistoryLink.org Essay 1059: Printer-Friendly Format. The small city of Medina in King County is blessed with an almost pristine location on the eastern shore of Lake Washington, a short bridge crossing (ferry ride in earlier years) away from the pleasures and perils of Seattle. He wasted little time claiming his stake, and took ownership of land along Lake Washington from what later became NE 8th Street south to and including Dabney Point. By 1890 he'd built Medina's first ferry dock, Dabney's Landing, near the future location of NE 8th. Roads quickly followed."}, {"url": "http://www.apartmentguide.com/apartments/Washington/Medina/", "passage_text": "ApartmentGuide.com-Your source for apartments for rent in Medina, Washington. Medina apartments for rent are located right off the shores of Meydenbauer Bay-a cozy alcove of Lake Washington. Your neighborhood is steeped in the urban atmosphere of Seattle with a hustle and bustle that brings an air of liveliness to the surrounding area"}, {"url": "http://www.medina-wa.gov/", "passage_text": "The Lake Washington waterfront in Medina is nicknamed “Medina’s Gold Coast”, and is some of the most-sought after waterfront in the Pacific Northwest. Medina today is a small, very quiet, very private community. Medina’s schools are part of the larger City of Bellevue School District, which is one of the top ranking and award winning school districts in the nation. The City takes safety and security seriously, with highly visible police officers using current technology to create and maintain a safe small town"}]