[{"url": "https://www.nhlbi.nih.gov/health/health-topics/topics/ms/", "passage_text": "You must have at least three metabolic risk factors to be diagnosed with metabolic syndrome. 1  A large waistline. 2  This also is called abdominal obesity or having an apple shape.. 3  Excess fat in the stomach area is a greater risk factor for heart disease than excess fat in other parts of the body, such as on the hips. The risk of having metabolic syndrome is closely linked to overweight and obesity and a lack of physical activity. Insulin resistance also may increase your risk for metabolic syndrome. Insulin resistance is a condition in which the body can't use its insulin properly. Insulin is a hormone that helps move blood sugar into cells where it's used for energy"}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMH0004546/", "passage_text": "About Metabolic Syndrome. Metabolic (met-ah-BOL-ik) syndrome is the name for a group of risk factors that raises your risk for heart disease and other health problems, such as diabetes and stroke. The term metabolic refers to the biochemical processes involved in the body's normal functioning. "}, {"url": "https://www.nhlbi.nih.gov/health/health-topics/topics/ms/", "passage_text": "Your risk for heart disease, diabetes, and stroke increases with the number of metabolic risk factors you have. In general, a person who has metabolic syndrome is twice as likely to develop heart disease and five times as likely to develop diabetes as someone who doesn't have metabolic syndrome. The risk of having metabolic syndrome is closely linked to overweight and obesity and a lack of physical activity. Insulin resistance also may increase your risk for metabolic syndrome. Insulin resistance is a condition in which the body can't use its insulin properly. Insulin is a hormone that helps move blood sugar into cells where it's used for energy"}, {"url": "http://www.mayoclinic.org/diseases-conditions/inherited-metabolic-disorders/basics/definition/CON-20036708", "passage_text": "Inherited metabolic disorders refer to different types of medical conditions caused by genetic defects — most commonly inherited from both parents — that interfere with the body's metabolism. These conditions may also be called inborn errors of metabolism. "}, {"url": "http://my.clevelandclinic.org/health/diseases_conditions/hic_Metabolic_Syndrome", "passage_text": "Metabolic syndrome is a collection of heart disease risk factors that increase your chance of developing heart disease, stroke, and diabetes. The condition is also known by other names including Syndrome X, insulin resistance syndrome, and dysmetabolic syndrome. "}, {"url": "http://www.healthline.com/health/nutrition-metabolism-disorders", "passage_text": "A metabolic disorder occurs when the metabolism process fails and causes the body to have either too much or too little of the essential substances needed to stay healthy. Our bodies are very sensitive to errors in metabolism. "}]