[{"url": "http://www.audioenglish.org/dictionary/broadloom.htm", "passage_text": "Familiarity information: BROADLOOM used as a noun is very rare. • BROADLOOM (adjective). The adjective BROADLOOM has 1 sense: 1. (of rugs or carpets) woven full width. Familiarity information: BROADLOOM used as an adjective is very rare. "}, {"url": "http://www.wisegeek.org/what-is-broadloom-carpet.htm", "passage_text": "Adorable animal families that will make you aww. A broadloom carpet is simply any type of carpet that is woven on a very wide loom. These carpets carry a distinct and obvious advantage when they are used to create area carpeting in large rooms, as they can be installed without creating seams. When a broadloom carpet is installed as wall-to-wall or area carpeting, it is typically laid over a carpet pad. Carpet pads help to provide more insulation, and they also protect the carpet from condensation"}, {"url": "http://www.home-style-choices.com/area-rugs-or-carpet-article.html", "passage_text": "Even if your floor is in fine shape, you may opt for broadloom because the unbroken plane of color and texture has the effect of making your room appear larger. Broadloom refers to the machine used to make large carpets. Broadlooms are commonly used for large applications, such as wall-to-wall and office carpeting. 1 Broadloom carpets are more or less permanent-the time and effort it takes to replace them is hardly worth it. 2  If you're the type that changes your tastes frequently, area rugs may be a better choice. 3  Faster Wear. 4  Most people rotate area rugs from time to time to minimize wear."}, {"url": "http://www.wisegeek.org/what-is-broadloom-carpet.htm", "passage_text": "Ad. When a broadloom carpet is installed as wall-to-wall or area carpeting, it is typically laid over a carpet pad. Carpet pads help to provide more insulation, and they also protect the carpet from condensation"}, {"url": "http://www.whatisall.com/what-is-a-broadloom-carpet/", "passage_text": "Knowing what is a broadloom carpet will enhance your knowledge towards interior designing and you will be delighted to plan the interior of your home. Broadloom carpet has a distinct feature due to which it is used in variety of purposes. It is used to create area carpeting for bigger rooms and can be installed without forming seams."}, {"url": "http://www.whatisall.com/what-is-a-broadloom-carpet/", "passage_text": "/ 0 comments. Knowing what is a broadloom carpet will enhance your knowledge towards interior designing and you will be delighted to plan the interior of your home. It is a type of carpet that is woven on a very wide loom. Broadloom carpet has a distinct feature due to which it is used in variety of purposes. It is used to create area carpeting for bigger rooms and can be installed without forming seams. It is used as a standalone rugs and carpets and can be found as machine-woven carpet for its size advantage"}, {"url": "http://rugsandcarpets.about.com/od/Purchasing-Carpet/g/What-Is-Broadloom.htm", "passage_text": "Broadloom is defined as a carpet woven on a wide loom. Historically, carpets were hand woven on looms, and so a broad loom was literally a loom that was wider than the average loom size, and used to make a large carpet. Today, the term broadloom generally refers to tufted carpet sold on rolls that are usually 12’ or 15’ wide"}, {"url": "http://www.ehow.com/info_8774707_broadloom-carpet.html", "passage_text": "Jupiterimages/Pixland/Getty Images. The simple definition of broadloom carpet is a carpet produced on a wide or broad loom. In the carpet industry, the term broadloom also refers to carpets designed not to have seams, which are produced in one piece to serve as floor covering for any room in your home. Widths. Manufacturers produce broadloom carpet in 12-, 13 1/2- and 15-foot widths. Installers choose a size just wider than the room to reduce waste. In large spaces, tape and stitches create seams to hold pieces of carpet together."}, {"url": "https://www.sourcefloor.com/broadloom-vs-carpet-tiles-in-commercial-applications/", "passage_text": "0 Comments. Posted June 28, 2013 in Carpets, Flooring. Broadloom carpet, as the name implies, is woven on a very wide loom. Most commonly shipped and installed in 12-foot wide large rolls, this type of carpet is still the most commonly used for wall-to-wall carpeting in both commercial and residential applications. "}]