[{"url": "http://www.heart.org/HEARTORG/Conditions/HeartAttack/SymptomsDiagnosisofHeartAttack/Angina-Chest-Pain_UCM_450308_Article.jsp", "passage_text": "Angina is chest pain or discomfort caused when your heart muscle doesn't get enough oxygen-rich blood. It may feel like pressure or squeezing in your chest. The discomfort also can occur in your shoulders, arms, neck, jaw, or back. Angina pain may even feel like indigestion. But, angina is not a disease. It is a symptom of an underlying heart problem, usually coronary heart disease (CHD). There are many types of angina, including microvascular angina, Prinzmetal's angina, stable angina, unstable angina and variant angina"}, {"url": "http://www.beaumont.edu/heart/diseases-conditions/angina/", "passage_text": "Angina. Angina is recurring chest pain or discomfort that happens when some part of the heart does not receive enough blood and oxygen. Angina is a symptom of coronary heart disease (CHD), which occurs when arteries that carry blood to the heart become narrowed and blocked due to atherosclerosis or a blood clot."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMH0001247/", "passage_text": "Angina may feel like pressure or squeezing in your chest. The pain also can occur in your shoulders, arms, neck, jaw, or back. Angina pain may even feel like indigestion. Angina isn't a disease; it's a symptom of an underlying heart problem. Angina usually is a symptom of coronary heart disease (CHD). CHD is the most common type of heart disease in adults. It occurs if a waxy substance called plaque (plak) builds up on the inner walls of your coronary arteries. These arteries carry oxygen-rich blood to your hear"}, {"url": "http://www.heart.org/HEARTORG/Conditions/HeartAttack/SymptomsDiagnosisofHeartAttack/Angina-Chest-Pain_UCM_450308_Article.jsp", "passage_text": "Angina can also be a symptom of coronary microvascular disease (MVD). This is heart disease that affects the heart’s smallest coronary arteries and is more likely to affect women than men. Coronary MVD also is called cardiac syndrome X and non-obstructive CHD. Learn more about angina in women. It may feel like pressure or squeezing in your chest. The discomfort also can occur in your shoulders, arms, neck, jaw, or back. Angina pain may even feel like indigestion. But, angina is not a disease. It is a symptom of an underlying heart problem, usually coronary heart disease (CHD)."}, {"url": "http://www.webmd.com/heart-disease/tc/angina-topic-overview", "passage_text": "Angina (say ANN-juh-nuh or ann-JY-nuh) is a symptom of heart disease. Angina happens when there is not enough blood flow to the heart muscle. This is often a result of narrowed blood vessels, usually caused by hardening of the arteries (atherosclerosis). "}, {"url": "http://www.cdc.gov/heartdisease/other_conditions.htm", "passage_text": "Acute coronary syndrome is a term that includes heart attack and unstable angina. Angina, a symptom of coronary artery disease, is chest pain or discomfort that occurs when the heart muscle is not getting enough blood. Angina may feel like pressure or a squeezing pain in the chest. The pain also may occur in the shoulders, arms, neck, jaw, or back. It may feel like indigestion. Recommend on Facebook Tweet ShareCompartir. Angina, a symptom of coronary artery disease, is chest pain or discomfort that occurs when the heart muscle is not getting enough blood. Angina may feel like pressure or a squeezing pain in the chest."}, {"url": "http://www.nhlbi.nih.gov/health/health-topics/topics/angina/", "passage_text": "Angina may feel like pressure or squeezing in your chest. The pain also can occur in your shoulders, arms, neck, jaw, or back. Angina pain may even feel like indigestion. Angina isn't a disease; it's a symptom of an underlying heart problem. Angina usually is a symptom of coronary heart disease (CHD). CHD is the most common type of heart disease in adults. It occurs if a waxy substance called plaque (plak) builds up on the inner walls of your coronary arteries. These arteries carry oxygen-rich blood to your heart. "}, {"url": "http://www.healthgrades.com/conditions/angina", "passage_text": "Angina pectoris is the medical term for pain or other discomfort in the chest that is due to coronary heart disease. The chest pain or discomfort associated with angina occurs when an area of the heart muscle does not receive enough oxygen-rich blood. Coronary heart disease is the most common type of heart disease in adults. As such, angina is a common cardiovascular condition in the United States. Angina develops due to coronary heart disease and an underlying heart problem called myocardial ischemia. This occurs when one or more of the heart’s coronary arteries, the blood vessels that supply blood to the heart muscle, is narrowed or blocked."}, {"url": "http://www.medicalnewstoday.com/articles/8886.php", "passage_text": "Angina-or angina pectoris (Latin for squeezing of the chest) - is chest pain, discomfort, or tightness that occurs when an area of the heart muscle is receiving decreased blood oxygen supply. It is not a disease itself, but rather a symptom of coronary artery disease, the most common type of heart disease. Angina is most frequently the result of underlying coronary artery disease. The coronary arteries supply the heart with oxygen rich blood. When cholesterol aggregates on the artery wall and hard plaques form, the artery narrows."}]