[{"url": "http://motherhood.modernmom.com/long-colorado-blue-spruce-grow-11136.html", "passage_text": "The Colorado blue spruce is a slow grower, developing between 6 to 12 inches of new growth each year. In situations where special care is given, the tree can grow upwards of 2 feet each year, according to the Idaho Forest Products Commission."}, {"url": "http://www.ehow.com/how-does_5421161_fast-do-spruce-trees-grow.html", "passage_text": "While the majority of these coniferous tree species have a fairly unremarkable average growth rate (between 6 inches and 11 inches per year), the Sitka spruce (Picea sitchensis), Norway spruce (Picea abies) and Colorado blue spruce (Picea pungens glauca) are renowned for their extraordinarily fast rates of growth."}, {"url": "http://www.windbreaktrees.com/whitespruce.html", "passage_text": "The White Spruce is a medium to fast growing (2ft plus) evergreen that has a light green or even bluish colored needles that are about 1 inch long. It has a strong evergreen smell when crushed and is one way to tell it from other spruce. It never drops its needles and can stay on for as long as 20 years."}, {"url": "http://homeguides.sfgate.com/long-colorado-blue-spruce-grow-82853.html", "passage_text": "Growth Rate. Although Colorado blue spruce may grow slowly in the first few years after planting, its growth rate picks up once it's established. Its growth rate is moderate to quick, so some trees may grow a scant 12 inches a year while others may grow upward of 24 inches in a single growing season."}, {"url": "http://www.ehow.com/how-does_5421161_fast-do-spruce-trees-grow.html", "passage_text": "Coming in second with an average growth rate of 30 inches annually, the Norway spruce has an impressive yet manageable height between 40 and 60 feet. With a branch spread of 25 feet across, landscape designers will often arrange Norway spruces to provide privacy and wind blockage for houses on larger lots."}, {"url": "http://homeguides.sfgate.com/long-colorado-blue-spruce-grow-82853.html", "passage_text": "Size. The blue spruce generally doesn't grow as large under cultivated conditions as it does in the wild. Under the best circumstances in the garden, you can expect it to hit about 65 feet, with a width of 10 to 20 feet. In the wild, however, the tree may grow as tall as 100 feet or more."}, {"url": "http://www.ehow.com/info_8791793_long-dwarf-alberta-spruce-grow.html", "passage_text": "Alberta spruce is a relatively slow growing species of tree, attaining a mature height of 12 feet after about 50 years. The tree grows vertically at a rate of 3 inches per year, and much more slowly horizontally. Dwarf Alberta spruce trees spread about 5 feet laterally, over a period of many years."}]