[{"url": "http://www.forensicscolleges.com/careers/forensic-scientist", "passage_text": "(BLS, 2012). The typical forensic scientist salary in the best paying jobs make between $65,000 and $72,000 per year, according to 2012 data from the BLS. For new forensic scientists, the typical forensic scientist salary is between $48,000 and $60,000 per year. Overall, the median in 2010 was $51, 570, BLS data from 2010 shows. Within the forensic science category, there are several specialties that may change salary and compensation. According to the Colorado Bureau of Investigation (2013), the annual forensic scientist salary of a latent print examiner is between $55,000 and $78"}, {"url": "http://www.forensicsciencecareers.net/forensic-scientist/salary.html", "passage_text": "Over time, a forensic scientist can build experience which increases ones pay. Some forensic scientists who have been in the business for 5 years see their salaries double from $1500 to $3000 per month just because of the experience factor. Other forensic scientists eventually earn salaries that are between $35,000 and $50,000 per year"}, {"url": "http://learn.org/articles/What_is_the_Salary_for_Forensic_Scientists.html", "passage_text": "Salaries by Experience. PayScale.com reported in January 2014 that forensic scientists with less than a year of experience made $42,500-$66,500. Those with 1-4 years of experience made $30,913-$77,083. Salaries were $34,905-$79,227 for those with 5-9 years of experience and $45,171-$96,190 for those with 10-19 years of experience. As of May 2012, the BLS reported that the median salary for forensic science technicians was $52,840 annually, and the average salary was $55,730."}, {"url": "http://www.forensicsciencetechnician.net/average-salary-for-forensic-science-technicians/", "passage_text": "Base Salary for a Forensic Science Technician. According to the Bureau of Labor Statistics, forensic science technicians make an average of $55,040, with the top 10 percent in this field making over $82,990. Location plays a significant role in determining what you get paid as a forensic science technician. The following states have the highest average salaries for this type of career: 1  Illinois: $72,990. 2  Virginia:$69,860. 3  California: $67,720."}, {"url": "http://work.chron.com/average-income-forensic-scientist-10194.html", "passage_text": "Basics. Forensic scientists earned an average $55,660 per year, or $26.76 per hour, as of May 2011, according to the U.S. Bureau of Labor Statistics. The lowest-earning made less than an annual $32,760, or $15.75 hourly, while the highest-paid received over $84,980 yearly, or $40.86 per hour"}, {"url": "http://www.healthcare-salaries.com/technicians/forensic-science-technician-salary", "passage_text": "Conclusion about forensic science technician salary. The hourly wage for a forensic science technician with less than 1 year experience is around $15.75 per hour while the hourly wage for those with over 5 years of experience is around $32.29 per hour. In addition, a well-established forensic science technician receives a much higher salary ranging from between $48,279 to $86,474 per annum. An average hourly wage for a forensic science technician geneticist ranges from between 14.90–$38.62 per hour."}, {"url": "http://www.healthcare-salaries.com/technicians/forensic-science-technician-salary", "passage_text": "The starting salary for a forensic science technician averages from between $29,577 to $46,255 per annum while an average forensic science technician receives an annual salary ranging from between $28,713 to $43,158 per year. In addition, a well-established forensic science technician receives a much higher salary ranging from between $48,279 to $86,474 per annum. An average hourly wage for a forensic science technician geneticist ranges from between 14.90–$38.62 per hour."}, {"url": "http://www.healthcare-salaries.com/technicians/forensic-science-technician-salary", "passage_text": "According to the U.S. BLS, an average annual salary for a forensic science technician in the United States is about $52,180 per annum and an hourly wage is $40.86 per hour. 1  Share on Facebook. 2  Share on Twitter. 3  Share on Google+. In addition, a well-established forensic science technician receives a much higher salary ranging from between $48,279 to $86,474 per annum. An average hourly wage for a forensic science technician geneticist ranges from between 14.90–$38.62 per hour."}, {"url": "http://www.forensicsciencecareers.net/forensic-scientist/salary.html", "passage_text": "Location, type of facility, experience and certification all play parts in ones annual income. Another factor is what type of forensic scientist you are. Toxicologists can earn starting salaries up to $55,000 while a Forensic Quality Manager can earn up to $93,000. Some forensic scientists who have been in the business for 5 years see their salaries double from $1500 to $3000 per month just because of the experience factor."}]