[{"url": "http://www.euronews.com/2015/03/06/the-who-suggests-we-eat-50g-of-sugar-per-day-but-how-much-is-that-exactly/", "passage_text": "Currently, Western European adults consume an average of 101 grams of sugar per day, while in South America the figure rises to 130 grams. Sugar represents around 16-17% of an adult’s daily energy intake in the United Kingdom and Spain."}, {"url": "http://answers.webmd.com/answers/5008459/how-many-grams-of-sugar-per-day", "passage_text": "For example, the World Health Organization recommends keeping added sugar intake to 10% of total calories. For the average 2000 calorie-diet that's a maximum of 50 grams. The American Heart Association recommends 6 teaspoons of sugar for women and 9 for men (1 teaspoon of sugar has about 4g of sugar)."}, {"url": "http://www.euronews.com/2015/03/06/the-who-suggests-we-eat-50g-of-sugar-per-day-but-how-much-is-that-exactly/", "passage_text": "The World Health Organisation suggests that adults should eat no more than 50 grams of sugar (12 teaspoons) per day to avoid the risks of obesity and tooth decay."}, {"url": "http://www.peertrainer.com/nutrition/how-much-sugar-should-you-have.aspx", "passage_text": "For example, a 12 ounce can of soda contains around 40 grams of sugar! This alone is more than the recommended amount of added sugar for the entire day according to the AHA guidelines! Juice also is a concentrated source of sugar, often containing just as much as soda."}, {"url": "http://www.eatingwell.com/diet_nutrition_health/nutrition_news_information/3_ways_to_break_your_sugar_habit", "passage_text": "How much sugar is too much, and simple ways to eat less added sugar. A recent survey suggests that Americans consume 355 calories, or 22 teaspoons, of added sugar a day—much of that comes from soda and packaged foods."}, {"url": "http://www.livestrong.com/article/474832-recommended-grams-of-sugar-per-day/", "passage_text": "The average American consumes 3 pounds of sugar a week and 130 pounds a year, reports Forbes.com. This is equal to about 3,550 pounds of sugar in a lifetime. The consumption of added sugar accounts for an intake of 500 calories per day, which can cause a weight gain of 1 pound per week."}, {"url": "http://healthyeating.sfgate.com/much-sugar-should-someone-consume-day-9919.html", "passage_text": "Sugar Allowance. Because sugar isn’t an essential nutrient, it doesn’t have an official recommendation. However, the American Heart Association set a recommended limit, so you don’t get too many extra calories in your diet. Men shouldn't have more than 9 teaspoons daily, while women shouldn't have more than 6 teaspoons."}, {"url": "http://www.peertrainer.com/nutrition/how-much-sugar-should-you-have.aspx", "passage_text": "Therefore, it is best to consume some carbohydrates every day. While it is possible to live on a very low-carbohydrate diet, most researchers agree that the ideal amount for health is around 40-45% of your total daily calories, or about 150 grams for the average female and 190 grams for the average male."}, {"url": "http://www.livestrong.com/article/474832-recommended-grams-of-sugar-per-day/", "passage_text": "Women should limit sugar intake to no more than 6 teaspoons per day, which provides about 100 calories. Men should limit sugar intake to no more than 9 teaspoons, or about 150 calories. In contrast, the average adult consumes 22 teaspoons per day."}, {"url": "http://www.peertrainer.com/nutrition/how-much-sugar-should-you-have.aspx", "passage_text": "Increased sugar intake is also linked to increased risk for type 2 diabetes and cardiovascular disease. We Eat Four Times As Much Sugar As We Should! According to a 2009 study in Circulation, annual sugar intake has increased 19% from 1970 to 2005."}]