[{"url": "https://en.wikipedia.org/wiki/Prison_reform", "passage_text": "Prison reform is the attempt to improve conditions inside prisons, establish a more effective penal system, or implement alternatives to incarceration. Russia, which had only started to reform its penal and judicial system in 1860 by abolishing corporal punishment, continued the use of exile with hard labor as a punishment and this was increased to a new level of brutality under Joseph Stalin, despite early reforms by the Bolsheviks."}, {"url": "https://en.wikipedia.org/wiki/Prison_reform", "passage_text": "In the early 1900s Samuel June Barrow was a leader in prison reform. President Cleveland appointed him International Prison Commissioner for the U.S. in 1895, and in 1900 Barrows became Secretary of the Prison Association of New York and held that position until his death on April 21, 1909. Russia, which had only started to reform its penal and judicial system in 1860 by abolishing corporal punishment, continued the use of exile with hard labor as a punishment and this was increased to a new level of brutality under Joseph Stalin, despite early reforms by the Bolsheviks."}, {"url": "http://reformproject.wikispaces.com/prison_reform_19th_century", "passage_text": "The American Prison Reform Movement of the 1800s was some peoples' answer to this question. In America, prisons have been around since the Europeans landed (and probably even before) in the early 1600s. The earliest prisons were local township jails that were seen as housing facilities for those awaiting trial. There were two primary systems of prison reform used in the 19th century: the Pennsylvania System, or Separate System; and the Auburn System, also known as the Silent System. Pennsylvania System. Auburn System. After the deterioration of prisons in the 19th century, the federal government became involved."}, {"url": "http://www.ushistory.org/us/26d.asp", "passage_text": "The champion of discipline and first national figure in prison reform was Louis Dwight. founder of the Boston Prison Discipline Society, he spread the Auburn system throughout America's jails and added salvation and Sabbath School to further penitence. In addition to the problems in asylums, prisons were filled to overflowing with everyone who gave offense to society from committing murder to spitting on the street. Men, women, children were thrown together in the most atrocious conditions."}, {"url": "https://en.wikipedia.org/wiki/Prison_reform", "passage_text": "Prison populations of various countries in 2008. Prisons have only been used as the primary punishment for criminal acts in the last few centuries. Far more common earlier were various types of corporal punishment, public humiliation, penal bondage, and banishment for more severe offences, as well as capital punishment. Russia, which had only started to reform its penal and judicial system in 1860 by abolishing corporal punishment, continued the use of exile with hard labor as a punishment and this was increased to a new level of brutality under Joseph Stalin, despite early reforms by the Bolsheviks."}, {"url": "http://gem.greenwood.com/wse/wsePrint.jsp?id=id536", "passage_text": "was a movement to reform the conditions under which women were incarcerated. This effort, which began about 1870, continues to influence women's prisons today. Prison reform was part of the broader social feminist movement that, after the Civil War, carried middle-class women into public life, especially in policy areas involving women, children, and other disadvantaged groups."}, {"url": "https://en.wikipedia.org/wiki/Prison_abolition_movement", "passage_text": "The prison abolition movement is a movement that seeks to reduce or eliminate prisons and the prison system, and replace them with more humane and effective systems. Anarchist organizations believe that the best form of justice arises naturally out of social contracts. However, many supporters for prison abolition intend to replace it with other systems, reducing prisons to a smaller role in society."}, {"url": "http://www.encyclopedia.com/article-1G2-2587100021/prison-reform-movement.html", "passage_text": "9: The Prison Reform Movement. Prison reform has had a long history in the United States, beginning with the construction of the nation's first prisons. Magazine article from: Colorlines Magazine ...modern prison abolition movement. Abu-Jamal's commentaries...Prison Society, a reform group founded in 1787...obscurity, even as the prison state grew more potent and far-reaching."}, {"url": "http://gem.greenwood.com/wse/wsePrint.jsp?id=id536", "passage_text": "The first phase of the prison reform movement, 1870 to 1900, began in the Midwest. Michigan led the way by establishing a prototype of the women's reformatory in the late 1860s. Prison reform was part of the broader social feminist movement that, after the Civil War, carried middle-class women into public life, especially in policy areas involving women, children, and other disadvantaged groups."}, {"url": "http://gem.greenwood.com/wse/wsePrint.jsp?id=id536", "passage_text": "Enduring about 60 years, the prison reform movement in time challenged nearly every assumption of traditional prison practice. It produced an entirely new model of prison for adults, the women's reformatory, which eventually was adopted by states throughout the country. Prison reform was part of the broader social feminist movement that, after the Civil War, carried middle-class women into public life, especially in policy areas involving women, children, and other disadvantaged groups."}]