[{"url": "http://www.mayoclinic.org/diseases-conditions/aortic-valve-regurgitation/basics/symptoms/CON-20022523", "passage_text": "Symptoms. Most often, aortic valve regurgitation develops gradually, and your heart compensates for the problem. You may have no signs or symptoms for years, and you may even be unaware that you have the condition. However, as aortic valve regurgitation worsens, signs and symptoms may include: 1  Fatigue and weakness, especially when you increase ...."}, {"url": "http://www.mayoclinic.org/diseases-conditions/aortic-valve-regurgitation/basics/definition/CON-20022523", "passage_text": "Definition. Aortic valve regurgitation — or aortic regurgitation — is a condition that occurs when your heart's aortic valve doesn't close tightly. Aortic valve regurgitation allows some of the blood that was just pumped out of your heart's main pumping chamber (left ventricle) to leak back into it."}, {"url": "http://www.nytimes.com/health/guides/disease/aortic-insufficiency/overview.html", "passage_text": "Aortic insufficiency is a heart valve disease in which the aortic valve does not close tightly. This allows blood to flow from the aorta (the largest blood vessel) into the left ventricle (a chamber of the heart)."}, {"url": "http://www.mayoclinic.org/diseases-conditions/aortic-valve-regurgitation/basics/symptoms/CON-20022523", "passage_text": "However, as aortic valve regurgitation worsens, signs and symptoms may include: 1  Fatigue and weakness, especially when you increase your activity level. 2  Shortness of breath with exertion or when you lie down. 3  Swollen ankles and feet (edema). 4  Chest pain (angina), discomfort or tightness, often increasing during exercise."}, {"url": "http://www.webmd.com/heart-disease/tc/aortic-valve-regurgitation-symptoms", "passage_text": "For others, symptoms may develop over 2 to 3 years. Symptoms of aortic valve regurgitation include: 1  Shortness of breath, especially with activity. 2  Fatigue and weakness. 3  Fainting (syncope). 4  Trouble breathing at night. 5  Swelling in the legs and sometimes the rest of the body (edema). 6  Awareness of the heartbeat (palpitations), especially when lying on the left side."}, {"url": "https://en.wikipedia.org/wiki/Aortic_insufficiency", "passage_text": "Aortic insufficiency (AI), also known as aortic regurgitation (AR), is the leaking of the aortic valve of the heart that causes blood to flow in the reverse direction during ventricular diastole, from the aorta into the left ventricle."}, {"url": "https://www.nlm.nih.gov/medlineplus/ency/article/000179.htm", "passage_text": "Aortic insufficiency is a heart valve disease in which the aortic valve does not close tightly. This allows blood to flow from the aorta (the largest blood vessel) into the left ventricle (a chamber of the heart)."}, {"url": "http://www.heart-valve-surgery.com/aortic-valve-regurgitation-symptoms.php", "passage_text": "However, as aortic regurgitation progresses, signs and symptoms usually appear and may include: 1  Fatigue and weakness, especially when you increase your activity level. 2  Shortness of breath, especially with exertion or when you lie flat. 3  Chest pain, discomfort or tightness, often increasing during exercise."}]