[{"url": "https://ca.answers.yahoo.com/question/index?qid=20091028154454AAfb0jc", "passage_text": "Report Abuse. As a result of the first Battle of Ypres, a part of the Allied front line bulged into German territory. Just like the German line bulged into the American line during the Battle of the Bulge, 30 years later in WW2. It was called the Ypres salient. "}, {"url": "http://www.answers.com/Q/Why_did_the_second_battle_of_Ypres_happen", "passage_text": "The Second Battle of Ypres was the first poison gas attack of the war. It was made by the Germans, and chlorine gas was used. This battle also inspired John McCrae's poem 'In … Flanders Field'. In addition, Canadian troops were proved capable in their success in holding the line regardless of the gas. The second battle of Ypres (April 22nd-May 25th, 1915) was the first major use of gas (the first was on the eastern front), which caused all to develop a gas mask, and led to the use of gas to never be effective, or a surprise."}, {"url": "http://www.historylearningsite.co.uk/world-war-one/battles-of-world-war-one/the-battle-of-passchendaele/", "passage_text": "The Battle of Passchendaele. The Battle of Passchendaele, fought July 1917, is sometimes called the Third Battle of Ypres. For the soldiers who fought at Passchendaele, it was known as the ‘Battle of Mud’. Few battles encapsulate World War One better than the Battle of Passchendaele. The attack at Passchendaele was Sir Douglas Haig’s attempt to break through Flanders."}, {"url": "http://www.answers.com/Q/Why_did_the_second_battle_of_Ypres_happen", "passage_text": "At the Second Battle of Ypres, the gas attack was effective, and that's why there are gas bombs today. =) During WW1 there were 3 main battles fo … ught at Ypres. It was a strategic strong point known as the Yrpes Salient. This means that it stuck out into the German's front line. The second battle of Ypres (April 22nd-May 25th, 1915) was the first major use of gas (the first was on the eastern front), which caused all to develop a gas mask, and led to the use of gas to never be effective, or a surprise."}, {"url": "https://en.wikipedia.org/wiki/First_Battle_of_Ypres", "passage_text": "The First Battle of Ypres (19 October – 22 November) was a First World War battle fought around Ypres, in western Belgium during October and November 1914. The battles at Ypres began at the end of the Race to the Sea which involved attempts by the German and Franco-British armies to advance past the northern flank of their opponents."}, {"url": "https://en.wikipedia.org/wiki/First_Battle_of_Ypres", "passage_text": "The battle took place as part of the First Battle of Flanders (French: Premiere Première bataille Des Flandres: German Erste), flandernschlacht in Which, German, French belgian And british armies fought From arras In france To nieuport on The belgian, coast from 10 october to-Mid. november The battles at Ypres began at the end of the Race to the Sea which involved attempts by the German and Franco-British armies to advance past the northern flank of their opponents."}, {"url": "http://hrsbstaff.ednet.ns.ca/macquekl/History%20Web%20Page/History/WorldWarIsite/battleofypres.htm", "passage_text": "Battle of Ypres. The Battle of Ypres actually includes three battles. They were fought in Ypres, Belgium. The town of Ypres was always under attack from the Germans because it was a key point in keeping them from the English Channel. Image courtesy of http://www.info.ox.ac.uk/jtap/ dce/vicars/Ypres. The First Battle of Ypres. The first Battle of Ypres took place between October 30 - November 24, 1914"}, {"url": "https://en.wikipedia.org/wiki/Battle_of_Passchendaele", "passage_text": "The Battle of Passchendaele, also known as the Third Battle of Ypres, was a campaign of the First World War, fought by the Allies against the German Empire. The battle took place on the Western Front, from July to November 1917, for control of the ridges south and east of the Belgian city of Ypres in West Flanders, as part of a strategy decided by the Allies at conferences in November 1916 and May 1917."}, {"url": "http://www.firstworldwar.com/battles/ypres3.htm", "passage_text": "Battles-The Third Battle of Ypres, 1917. Whereas the first and second battles of Ypres were launched by the Germans in 1914 and 1915 respectively, Third Ypres was intended as Sir Douglas Haig's Allied forces breakthrough in Flanders in 1917. Haig had long mulled the idea of launching a major offensive in Flanders. It was his preferred choice for 1916, although in the event the Battle of the Somme took precedence that summer. Meticulously planned, Third Ypres was launched on 31 July 1917 and continued until the fall of Passchendaele village on 6 November."}]