[{"url": "https://answers.yahoo.com/question/index?qid=20110521062628AAJF5Jf", "passage_text": "RE: What is lexical choice? What is lexical choice? I know its word choice, so does that mean figurative language such as personifications, similies etc is type of lexical choice? Please help i have a English exam on monday so i have no time to ask my teacher :| Thank you. The lexical choices you make are simply the ways that you choose to express yourself. You may find, as an individual, that you adjust your lexical choice to match the audience."}, {"url": "http://www.englishbiz.co.uk/grammar/main_files/definitionsa-m.htm", "passage_text": "Accent refers solely to the way words are pronounced, e.g. in the south of England, it is normal to pronounce the word path as p-ar-th, but in the Midlands and the North, the phoneme 'a' is articulated as a short vowel and pronounced as in, 'cat'. Lexis (lexical). Lexis means the vocabulary of a language as opposed to other aspects such as the grammar of the text. Lexis is clearly an important aspect of creating a suitable style or register (i.e. when choosing language and language features to suit a particular genre, context, audience and purpose)."}, {"url": "http://www.teachingenglish.org.uk/article/lexical-approach-1-what-does-lexical-approach-look", "passage_text": "This is the first part of an article looking at the theories of language which form the foundations of the lexical approach to teaching English. 1  Introduction. 2  The theory of language. 3  Principle 1 - Grammaticalised Lexis. 4  Principle 2 - Collocation in action. 5  About the authors. 6  Further Reading. In this first of two articles we look at how advocates of the Lexical Approach view language. In our second article we apply theories of language learning to a Lexical Approach and describe what lexical lessons could look like. We have also produced teaching materials for you to try out in your own classrooms."}, {"url": "https://answers.yahoo.com/question/index?qid=20110521062628AAJF5Jf", "passage_text": "Best Answer: lexicon is a term that refers to the words and phrases that you actually employ to transfer meaning to others. The lexical choices you make are simply the ways that you choose to express yourself. You may find, as an individual, that you adjust your lexical choice to match the audience."}, {"url": "https://en.wikipedia.org/wiki/Lexicon", "passage_text": "A lexicon is the vocabulary of a person, language, or branch of knowledge (such as nautical or medical). In linguistics, a lexicon is a language's inventory of lexemes. The word lexicon derives from the Greek λεξικόν (lexicon), neuter of λεξικός (lexikos) meaning of or for words. "}, {"url": "http://www.oxforddictionaries.com/definition/english/lexical", "passage_text": "adjective. 1 Relating to the words or vocabulary of a language: lexical analysis. More example sentences. 1  Further it is hypothesized that there are different formulators for each language, while there is one lexicon where lexical elements from different languages are stored together. 1.1 Relating to or of the nature of a lexicon or dictionary: a lexical entry. More example sentences. 1  WordNet is a big lexical dictionary heavily used by this community for creation of natural language systems."}, {"url": "http://www.oxforddictionaries.com/definition/english/lexical", "passage_text": "1 In terms of lexical category ambiguity, languages do differ in the extent to which their word-forms are specialized for syntactic function. 2  Nevertheless, there is an inverse correlation between the lexical expansion of a language and the iconicity of its grammar. 1.1 Relating to or of the nature of a lexicon or dictionary: a lexical entry. More example sentences. 1  WordNet is a big lexical dictionary heavily used by this community for creation of natural language systems."}, {"url": "https://en.wikipedia.org/wiki/Lexical_choice", "passage_text": "Lexical choice is the subtask of Natural language generation that involves choosing the content words (nouns, verbs, adjectives, and adverbs) in a generated text. Function words (determiners, for example) are usually chosen during Realisation. Examples [edit]. The simplest type of lexical choice involves mapping a domain concept (perhaps represented in an ontology) to a word. For example, the concept Finger might be mapped to the word finger. A more complex situation is when a domain concept is expressed using different words in different situations"}]