[{"url": "http://www.hometowndemolitioncontractors.com/demolition-cost/building-demolition/garage-demolition", "passage_text": "Garage demolition-basic concrete and wood structure for $4,250 being the final cost. Final Cost: $1,000. Space Converted to a Garage for $1,000. The garage in my home had been converted to a bedroom and I hired Watco to restore it back to a garage."}, {"url": "http://www.hometowndemolitioncontractors.com/demolition-cost/building-demolition/garage-demolition", "passage_text": "It's a 2-car garage demolition. Demolition Cost Details: Two-car garage, constructed primarily of wood. Final Cost: $1,500. Garage Demolition in North Richland Hills, TX. Demolish an all wood detached garage. It measured 20 ft. by 20 ft. and sat on a slab. We had all the debris hauled away. The slab was untouched."}, {"url": "http://smallbusiness.chron.com/determine-building-demolition-costs-15447.html", "passage_text": "Ask the asbestos abatement professional for an estimate on how much this will cost. Usually, it is around $2 or $3 per square foot. For instance, if you have a building that has 1,750 square feet and was quoted $2 per square foot for asbestos removal, the cost for this part of the demolition will cost $3,500."}, {"url": "http://costowl.com/home-improvement/other-demolition-cost.html", "passage_text": "The average cost for residential demolition is $5 to $15 per square foot. For an average room that is 15X15 the cost will fall somewhere between $1,125 and $3,375. This is a rough estimate."}, {"url": "http://www.hometowndemolitioncontractors.com/blog/what-does-it-cost-to-demolish-a-garage", "passage_text": "Because it’s not as complicated of a job compared to taking down a house or inground swimming pool, it costs less. The national average cost to demolish a garage or large shed is $2,100. TIP: Use Hometown’s free Garage and Shed Demolition Costs tool. Various factors play a role in whether the price to demolish your garage is more or less than the national average. Some of these factors include your location, size of the garage or shed, ease of access, disposal costs and overall complexity of the job."}, {"url": "http://home.costhelper.com/build-garage.html", "passage_text": "Grittihs) we got a quote in less than 45 mins. for a 1.5 car garage the estimate is $12,354 for a 2 car garage (with a short approaching driveway) will cost us $16,325 this includes the demolition of old garage, 30 year roof, all electrical, slab, garage door, an entrance door and 1 window."}, {"url": "http://www.hometowndemolitioncontractors.com/demolition-cost/building-demolition/garage-demolition", "passage_text": "The garage is built on a concrete slab and has an aluminum roof. Demolition Cost Details: concrete, wood and aluminum debris. Quoted Cost: $3,600. Garage Demolition in Detroit, MI. Demolish a 2-car garage. It measures 400 square feet."}]