[{"url": "http://www.diabetes.org/living-with-diabetes/treatment-and-care/blood-glucose-control/checking-for-ketones.html", "passage_text": "Checking for Ketones. Ketone is a chemical produced when there is a shortage of insulin in the blood and the body breaks down body fat for energy. Ketones in the urine is a sign that your body is using fat for energy instead of using glucose because not enough insulin is available to use glucose for energy. Small or trace amounts of ketones may mean that ketone buildup is starting. You should test again in a few hours. Moderate or large amounts are a danger sign. They upset the chemical balance of your blood and can poison the body."}, {"url": "http://www.walmart.com/ip/ReliOn-Ketone-Test-Strip/13037592", "passage_text": "About this item. ReliOn Ketone Test Strips provide a fast, convenient way of testing urine for the presence and concentration of ketone (acetoacetic acid). This substance, when found in the urine, provides information on carbohydrate and fat metabolism. "}, {"url": "http://www.diabetesmonitor.com/glucose-meters/test-strips/what-are-ketone-test-strips.htm", "passage_text": "The byproduct of this process is ketones, which show up in your blood and urine. Ketones can indicate hyperglycemia, which can be a serious situation if not treated properly. Ketone test strips can help determine the level of ketones in either urine or blood. Testing ketones with a blood-based test strip that you insert in a meter is just like testing your blood sugar. Testing with a urine strip means you either collect a small sample of urine or urinate directly onto the strip. Options for ketone test strips. When choosing urine ketone test strips, keep in mind how often you will use them. Test strips in a vial must be used before the expiration date, which is typically within six months after opening the package."}, {"url": "http://www.lowcarb.ca/tips/tips011.html", "passage_text": "Ketone urine-testing strips, also called Ketostix or just ketone sticks ... are small plastic strips that have a little absorptive pad on the end. This contains a special chemical that will change colour in the presence of ketones in the urine. "}, {"url": "http://www.diabetesforecast.org/2014/Jan/ketone-test-strips-2014.html", "passage_text": "Ketones are a by-product of fat breakdown, and high levels can be toxic. Ketone testing strips check for the presence in urine of one type of ketone, called acetoacetic acid. Read the directions that come with your strips for proper use. You’ll either run the strip through a stream of urine or collect urine in a clean container and dip the strip into it. "}, {"url": "http://www.joslin.org/info/ketone_testing_what_you_need_to_know.html", "passage_text": "You can test to see if your body is making any ketones by doing a simple urine test. There are several products available for ketone testing and they can be purchased, without a prescription, at your pharmacy. The test result can be negative, or show small, moderate, or large quantities of ketones. Continue testing your blood glucose every 3 - 4 hours, testing for ketones if the blood glucose is over 250 mg/dl. Do not exercise if your blood glucose is over 250 mg/dl and ketones are present. For more information, turn to. ."}, {"url": "http://www.webmd.com/diabetes/ketones-14241", "passage_text": "A ketone test checks for ketones in your blood or urine. Ketones are substances that are made when the body breaks down fat for energy. Normally, your body gets the energy it needs from carbohydrate in your diet. But stored fat is broken down and ketones are made if your diet does not contain enough carbohydrate to supply the body with sugar (glucose) for energy or if your body can't use blood sugar (glucose) properly. Ketones can be tested in a laboratory."}, {"url": "http://www.diabetesmonitor.com/glucose-meters/test-strips/what-are-ketone-test-strips.htm", "passage_text": "Urine ketone test strips are looking for acetoacetic acid in the urine. This acid reacts with nitroprusside, a chemical in the strip, to produce a color. This color corresponds with a chart that comes packaged along with your test strips, usually on the outside of the vial. Options for ketone test strips. When choosing urine ketone test strips, keep in mind how often you will use them. Test strips in a vial must be used before the expiration date, which is typically within six months after opening the package."}, {"url": "http://www.webmd.com/diabetes/tc/urine-test-for-ketones-topic-overview", "passage_text": "A ketone test checks for ketones in your blood or urine. Ketones are substances that are made when the body breaks down fat for energy. Normally, your body gets the energy it needs from glucose (sugar). If your body cannot use glucose for energy-for example, if your body doesn't make or use insulin-ketones are formed. Blood ketones can be tested using some blood sugar meters. You can test your urine for ketones by using specially prepared tablets or plastic strips."}]