[{"url": "http://drsircus.com/medicine/sodium-bicarbonate-baking-soda/side-effects-contraindications", "passage_text": "Thank you very much for your answer. I try to keep my pH between 7.00 and 7.50. It is unbelievable when I start drinking Coffee, my pH drop to 6.00. I am stopping with the Bicarbonate of Soda for 1 month and replace it with 1 Lemon in 500 ml. water first thing in the morning."}, {"url": "http://www.livestrong.com/article/376495-the-effects-of-drinking-baking-soda-water/", "passage_text": "Safe Dosage. According to Arm & Hammer, a manufacturer of baking soda, mixing 1/2 teaspoon of baking soda into 1/2 glass of water is a safe dose for the relief of heartburn. People between the ages of 5 and 60 can take up to 7 doses spaced at least 2 hours apart in a 24-hour period."}, {"url": "http://www.md-health.com/Drinking-Baking-Soda.html", "passage_text": "It even boosts athletic performance. Drinking baking soda-also called bicarbonate of soda or sodium bicarbonate―dissolved in water, has long been used to relieve the signs and symptoms of arthritis, indigestion, heartburn, and infection, among other maladies."}, {"url": "http://articles.mercola.com/sites/articles/archive/2012/08/27/baking-soda-natural-remedy.aspx", "passage_text": "Story at-a-glance 1  +. Baking soda (sodium bicarbonate) is one of the safest and most versatile substances around; it's useful not only for baking but for countless medicinal and household purposes."}, {"url": "http://www.ehow.co.uk/how_5616960_drink-bicarbonate-soda-health.html", "passage_text": "Ryan McVay/Photodisc/Getty Images. Bicarbonate of soda, better known as baking soda or sodium bicarbonate, has numerous uses--it's a cleaning agent, antacid, fire extinguisher and more. There also are interesting health benefits when you drink baking soda, which is alkaline, in water."}, {"url": "http://www.ehow.com/how_5616960_drink-bicarbonate-soda-health.html", "passage_text": "Save. Bicarbonate of soda, better known as baking soda or sodium bicarbonate, has numerous uses–it's a cleaning agent, antacid, fire extinguisher and more. There also are interesting health benefits when you drink baking soda, which is alkaline, in water."}, {"url": "http://articles.mercola.com/sites/articles/archive/2012/08/27/baking-soda-natural-remedy.aspx", "passage_text": "Use baking soda to scrub your barbecue grill. Clean baby toys in a mixture of 4 tablespoons of baking soda and 1 quart of water. Baking soda can also be used as a fabric softener in your laundry, or to get your clothes whither and brighter (add one cup to your laundry load)."}]