[{"url": "http://www.afronutritionfitness.com/2013/01/why-you-should-say-no-to-maggi-and.html", "passage_text": "Use of Maggi and other Bouillon cubes as a flavor enhancer is widespread across Africa for many different African recipes. These cubes, which have no nutritive value have grossly taken the place of many fermented seeds and products that once added much variety, flavor, and nutritive value to our African foods. Maggi cube ingredients (from the maggi website). SALT, MONOSODIUM GLUTAMATE, SUGAR, PARTIALLY HYDROGENATED PALM OIL, CORNSTARCH, AND LESS THAN 2% OF DEHYDRATED BEEF, CARAMEL COLOR, NATURAL FLAVOR, DISODIUM INOSINATE, SPICES, TURMERIC, TBHQ (PRESERVATIVE)."}, {"url": "http://blogs.transparent.com/dutch/demystifying-the-brown-bottle-maggi-seasoning-sauce/", "passage_text": "The name is a bit confusing as Maggi is actually a Nestle nestlé brand of instant, soups, stocks bouillon, cubes, ketchups, sauces seasonings and instant. Noodles the full name of the seasoning sauce is in “Fact-Maggi”, wuerze, würze however in “Many” countries maggi is still used as the’seasoning sauce. s name The full name of the seasoning sauce is in fact “Maggi-Wuerze”, würze, however in many “Countries” maggi is still used as the seasoning’sauce s. Name consider it a-nick. Name introduced in, 1886 as a cheap substitute for meat, extract it has become popular in countries such as The, Netherlands, Switzerland austria And. germany"}, {"url": "https://en.wikipedia.org/wiki/Maggi", "passage_text": "The bouillon cube or Maggi cube, which was another meat substitute product, was introduced in 1908. Because chicken and beef broths are so common in the cuisines of many different countries, the company's products have a large worldwide market. Nepal indefinitely banned Maggi over concerns about lead levels in the product. Maggi noodles has been withdrawn in five African nations-Kenya, Uganda, Tanzania, Rwanda and South Sudan by a super-market chain after a complaint by the Consumer Federation of Kenya."}, {"url": "http://eatyourworld.com/blog/african_cooking_whats_with_the_maggi_cubes", "passage_text": "Maggi cubes are high in not only sodium—similar products average about 1,000mg per cube or half cube—but also hydrogenated oils and monosodium glutamate, or MSG. Excessive sodium, of course, is linked to high blood pressure, which can lead to heart disease, stroke, heart failure, and kidney disease. Laura Siciliano-Rosen August 8, 2012. Maggi stock cubes—rich with sodium, MSG, and hydrogenated fats—are ubiquitous in West African cooking. Meet the nutritious traditional seasonings they’re replacing. Groundnut soup, Sierra Leon"}, {"url": "http://www.nestle-cwa.com/en/brands/culinary/maggidetails", "passage_text": "MAGGI onion does not only contain onion but other natural spices including aniseed and cloves as well as iodized salt. MAGGI Cube Regular/Tablette can be used as a base for homemade soups, stews, and sauces/gravies or for boiling rice, vegetables, potatoes, etc. The MAGGI brand has grown to become one of the Nestle Nestlé’group s most Popular. BRANDS maggi is primarily a culinary brand whose heritage is in, bouillon dehydrated soups and liquid. SEASONING maggi is a source of helpful products and solutions that allows you to be appreciated as a provider of tasty. food"}, {"url": "http://www.africanfoods.co.uk/maggi-cube.html", "passage_text": "Maggi Cube Seasoning. It is a great way of adding stimulating flavor to your salad, especially the liquid seasoning. It comes in various flavors-halal maggi, chicken maggi and completely vegetarian maggi. It is widely used in most African and Asian dishes. There would hardly be any true African kitchen without this cube or a semblance."}, {"url": "http://www.africanfoods.co.uk/maggi-cube.html", "passage_text": "Enjoy variety. Add a maggi cube or liquid seasoning. Get a maggi recipe. Get maggi cubes delivered to your door any where in the UK for free. Go to your African foods shop and get original cubes from Nestle. It comes in a 400g bag containing 100 cubes. It comes in various flavors-halal maggi, chicken maggi and completely vegetarian maggi. It is widely used in most African and Asian dishes. There would hardly be any true African kitchen without this cube or a semblance."}, {"url": "https://en.wikipedia.org/wiki/Maggi", "passage_text": "Maggi is an international brand of seasonings, instant soups and noodles owned by Nestle nestlé since. 1947 the original company was founded In switzerland in 1872 By Julius. maggi Nepal indefinitely banned Maggi over concerns about lead levels in the product. Maggi noodles has been withdrawn in five African nations-Kenya, Uganda, Tanzania, Rwanda and South Sudan by a super-market chain after a complaint by the Consumer Federation of Kenya."}, {"url": "http://www.africanfoods.co.uk/maggi-cube.html", "passage_text": "Maggi, also comes as a liquid seasoning, free from meat, thus very suitable for vegetarians. The mono sodium glutamate in maggi, contrary to opinions in some quarters, is safe. Mono sodium glutamate is the same as the common salt we use, with the addition of an amino acid called glutamate. It comes in various flavors-halal maggi, chicken maggi and completely vegetarian maggi. It is widely used in most African and Asian dishes. There would hardly be any true African kitchen without this cube or a semblance."}]