[{"url": "http://www.news-medical.net/drugs/Clexane.aspx", "passage_text": "Things you must not do. Do not give Clexane to anyone else, even if they have the same condition as you. Do not use Clexane to treat any other complaints, unless your doctor tells you to. Do not stop using Clexane, or lower the dosage, without checking with your doctor or pharmacist. Do not freeze Clexane. Do not leave Clexane in the car. Keep Clexane away from direct sunlight. Do not store Clexane or any other medicine in the bathroom, near a sink or stove or on a windowsill. Heat, light and dampness can destroy some medicines."}, {"url": "http://www.news-medical.net/drugs/Clexane.aspx", "passage_text": "When you must not use it. Do not use Clexane if you have an allergy to Clexane, heparin or its derivatives including other LMWHs. Some signs and symptoms of an allergic reaction can include swelling of the face, lips or tongue, wheezing or troubled breathing, skin rash, itching hives, blisters or peeling skin. Do not freeze Clexane. Do not leave Clexane in the car. Keep Clexane away from direct sunlight. Do not store Clexane or any other medicine in the bathroom, near a sink or stove or on a windowsill. Heat, light and dampness can destroy some medicines."}, {"url": "http://www.rch.org.au/uploadedFiles/Main/Content/rchcpg/hospital_clinical_guideline_index/LMWH%20information%20for%20parents%20and%20children_April2013(1).pdf", "passage_text": "Clexane belongs to a group of drugs called anticoagulants. Clexane stops unwanted blood clots from forming and can stop any blood clots that have already formed from growing bigger. This test is called an anti-Factor Ten-A (anti-Xa) test. Once a child’s anti-Xa level is in the right range, we usually don’t need to do blood tests more often than once every two to four weeks. Clexane’s Side Effects Bleeding is the most common side effect of clexane therapy."}, {"url": "https://en.wikipedia.org/wiki/Enoxaparin_sodium", "passage_text": "Enoxaparin is a low molecular weight heparin marketed under the trade names Lovenox, Xaparin and Clexane, among others. It is an anticoagulant used to prevent and treat deep vein thrombosis or pulmonary embolism, and is given as a subcutaneous injection (by a health care provider or the patient). Enoxaparin is a FDA pregnancy category B drug, and is not expected to harm an unborn baby. Enoxaparin does not cross the placenta. In animal models, there was no evidence of teratogenic effects or fetotoxicity due to enoxaparin. Pregnancy alone can raise a woman's risk of life-threatening thromboembolic event."}, {"url": "http://xpil.medicines.org.uk/ViewPil.aspx?DocID=11709", "passage_text": "What Clexane is and what it is used for. The name of your medicine is Clexane 20mg, 40mg, 60mg, 80mg and 100mg Pre-filled Syringes (called Clexane in this leaflet). Clexane contains a medicine called enoxaparin sodium. This belongs to a group of medicines called Low Molecular Weight Heparins. If you are able to give Clexane to yourself, your doctor or nurse will show you how to do this. Do not try to inject yourself if you have not been trained how to do so. If you are not sure what to do, talk to your doctor or nurse immediately."}, {"url": "http://www.medicinenet.com/enoxaparin/article.htm", "passage_text": "DRUG CLASS AND MECHANISM: Enoxaparin is a low molecular weight heparin (LMWH) that is used to prevent blood clots. It is produced by chemically breaking heparin into smaller-sized molecules. Unlike heparin, the effect of enoxaparin does not need to be monitored with blood tests. "}, {"url": "http://www.rch.org.au/uploadedFiles/Main/Content/rchcpg/hospital_clinical_guideline_index/LMWH%20information%20for%20parents%20and%20children_April2013(1).pdf", "passage_text": "They have had a blood clot and are taking clexane to make sure the blood clot doesn’t grow or break off and travel to another part of the body (e.g. the lungs). 2. They haven’t had a blood clot yet, but for some reason their doctor thinks they have a bigger risk than other people for getting a blood clot. This test is called an anti-Factor Ten-A (anti-Xa) test. Once a child’s anti-Xa level is in the right range, we usually don’t need to do blood tests more often than once every two to four weeks. Clexane’s Side Effects Bleeding is the most common side effect of clexane therapy."}, {"url": "http://www.myvmc.com/drugs/clexane/", "passage_text": "Indication. Clexane is a medicine that is used to treat blood clots, or stop clots from forming inside the body. Clexane is commonly used to prevent clotting after an operation such as a hip replacement, or in certain heart conditions. Action. Clexane works by preventing certain molecules in the blood called clotting factors from working. Clotting factors are needed to from a clot (eg. on a cut or scratch). Sometimes, however, blood clots can form inside the body and travel to areas such as the lungs or brain, where they can from a block."}]