[{"url": "http://education.jlab.org/itselemental/ele042.html", "passage_text": "Molybdenum was discovered by Carl Welhelm Scheele, a Swedish chemist, in 1778 in a mineral known as molybdenite (MoS 2) which had been confused as a lead compound. Molybdenum was isolated by Peter Jacob Hjelm in 1781. Today, most molybdenum is obtained from molybdenite, wulfenite (PbMoO 4) and powellite (CaMoO 4). "}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-1249-MOLYBDENUM.aspx?activeIngredientId=1249&activeIngredientName=MOLYBDENUM", "passage_text": "Molybdenum is a trace mineral found in foods such as milk, cheese, cereal grains, legumes, nuts, leafy vegetables, and organ meats. Children: For children, molybdenum is LIKELY SAFE in amounts that do not exceed the UL of 0.3 mg per day for children 1 to 3 years, 0.6 mg per day for children 4 to 8 years, 1.1 mg per day for children 9 to 13 years, and 1.7 mg per day for adolescents."}, {"url": "https://en.wikipedia.org/wiki/Molybdenum", "passage_text": "Molybdenum is a chemical element with symbol Mo and atomic number 42. The name is from Neo-Latin molybdaenum, from Ancient Greek μόλυβδος molybdos, meaning lead, since its ores were confused with lead ores. Molybdenum-98 is the most abundant isotope, comprising 24.14% of all molybdenum. Molybdenum-100 has a half-life of about 10 19 y and undergoes double beta decay into ruthenium -100. Molybdenum isotopes with mass numbers from 111 to 117 all have half-lives of approximately 150 ns."}, {"url": "http://www.chemicool.com/elements/molybdenum.html", "passage_text": "Discovery of Molybdenum. Molybdenite, also known as molybdena, is a soft black mineral that was once used to make pencils. The mineral was often confused for graphite and it was thought to contain lead. It is now known to be molybdenum disulfide (MoS 2). Molybdenum is used as glass furnace electrodes due to its high melting point. It is also used in the petroleum industry, to catalyze the removal of organic sulfur compounds in coal liquification and gas liquification processes. Molybdenum is an essential trace element for animals and plants."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-1249-MOLYBDENUM.aspx?activeIngredientId=1249&activeIngredientName=MOLYBDENUM", "passage_text": "MOLYBDENUM Overview Information. Molybdenum is a trace mineral found in foods such as milk, cheese, cereal grains, legumes, nuts, leafy vegetables, and organ meats. The amount in plant-derived foods depends on the soil content in the growing area. Molybdenum is also present in water in varying amounts. Children: For children, molybdenum is LIKELY SAFE in amounts that do not exceed the UL of 0.3 mg per day for children 1 to 3 years, 0.6 mg per day for children 4 to 8 years, 1.1 mg per day for children 9 to 13 years, and 1.7 mg per day for adolescents."}, {"url": "https://en.wikipedia.org/wiki/Molybdenum", "passage_text": "Molybdenum does not occur naturally as a free metal on Earth, but rather in various oxidation states in minerals. The free element, which is a silvery metal with a gray cast, has the sixth-highest melting point of any element. Molybdenum-98 is the most abundant isotope, comprising 24.14% of all molybdenum. Molybdenum-100 has a half-life of about 10 19 y and undergoes double beta decay into ruthenium -100. Molybdenum isotopes with mass numbers from 111 to 117 all have half-lives of approximately 150 ns."}, {"url": "http://www.merriam-webster.com/dictionary/molybdenum", "passage_text": "Medical Definition of MOLYBDENUM. : a metallic element that resembles chromium and tungsten in many properties, is used especially in strengthening and hardening steel, and is a trace element in plant and animal metabolism—symbol Mo; see element table. molybdenum. noun mo·lyb·de·num \\-də-nəm\\. : a metallic element that resembles chromium and tungsten in many properties, is used especially in strengthening and hardening steel, and is a trace element in plant and animal metabolism—symbol Mo; see element table."}, {"url": "http://www.merriam-webster.com/dictionary/molybdenum", "passage_text": "Definition of MOLYBDENUM. : a metallic element that resembles chromium and tungsten in many properties, is used especially in strengthening and hardening steel, and is a trace element in plant and animal metabolism — see element table. See molybdenum defined for kids. ADVERTISEMENT. molybdenum. noun mo·lyb·de·num \\-də-nəm\\. : a metallic element that resembles chromium and tungsten in many properties, is used especially in strengthening and hardening steel, and is a trace element in plant and animal metabolism—symbol Mo; see element table."}, {"url": "https://en.wikipedia.org/wiki/Molybdenum", "passage_text": "Molybdenum minerals have been known throughout history, but the element was discovered (in the sense of differentiating it as a new entity from the mineral salts of other metals) in 1778 by Carl Wilhelm Scheele. The metal was first isolated in 1781 by Peter Jacob Hjelm. Molybdenum-98 is the most abundant isotope, comprising 24.14% of all molybdenum. Molybdenum-100 has a half-life of about 10 19 y and undergoes double beta decay into ruthenium -100. Molybdenum isotopes with mass numbers from 111 to 117 all have half-lives of approximately 150 ns."}]