[{"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMHT0012290/?report=details", "passage_text": "Uses of This Medicine. Tamoxifen is a medicine that blocks the effects of the estrogen hormone in the body. It is used to treat breast cancer in women or men. It may also be used to treat other kinds of cancer, as determined by your doctor. Tamoxifen also may be used to reduce the risk of developing breast cancer in women who have a high risk of developing breast cancer."}, {"url": "http://www.steroidabuse.com/Profiles/nolvadex.html", "passage_text": "Nolvadex is a Selective Estrogen Receptor Modulator (SERM) comprised of the active drug Tamoxifen first created by Imperial Chemical Industries (ICI.) Originally developed to provide a “Morning After” effect this soon proved to be useless. "}, {"url": "http://www.rxlist.com/nolvadex-side-effects-drug-center.htm", "passage_text": "Nolvadex (tamoxifen citrate) is a nonsteroidal antiestrogen used to treat breast cancer that has spread to other parts of the body (metastatic breast cancer), to treat breast cancer in certain patients after surgery and radiation therapy, and to reduce the chances of breast cancer in high-risk patients."}, {"url": "http://www.postcycletherapy.net/nolvadex/", "passage_text": "Nolvadex is the generic name of Tamoxifen Citrate, a type of drug that is classified as a selective estrogen receptor modulator (SERM) and originally formulated as treatment for some types of breast cancer in both men and women. "}, {"url": "http://www.everydayhealth.com/drugs/tamoxifen", "passage_text": "Tamoxifen is prescribed to treat metastatic breast cancer, or cancer that has spread to other parts of the body. Tamoxifen is also used to lower the chance of breast cancer in high-risk women (for example, those with a family history of breast cancer). The drug may also be prescribed for off-label uses, such as treating certain brain cancers and McCune-Albright syndrome, a genetic disorder that can cause early puberty in girls. Tamoxifen is used for breast cancer and in women who are at a high risk of developing breast cancer. (http://www.everydayhealth.com/breast-cancer/understanding.aspx). Common side effects of tamoxifen include hot flashes, depressed mood, nausea, headache and thinning of the hair."}, {"url": "http://www.webmd.com/drugs/2/drug-4495/nolvadex-oral/details", "passage_text": "Uses. Tamoxifen is used to treat breast cancer that has spread to other parts of the body (metastatic breast cancer), to treat breast cancer in certain patients after surgery and radiation therapy, and to reduce the chances of breast cancer in high-risk patients. This medication can block the growth of breast cancer."}, {"url": "https://en.wikipedia.org/wiki/Tamoxifen", "passage_text": "Tamoxifen is an antagonist of the estrogen receptor in breast tissue via its active metabolite, 4-hydroxytamoxifen. In other tissues such as the endometrium, it behaves as an agonist, and thus may be characterized as a selective estrogen-receptor modulator."}, {"url": "https://en.wikipedia.org/wiki/Tamoxifen", "passage_text": "Tamoxifen is currently used for the treatment of both early and advanced ER+ (estrogen receptor positive) breast cancer in pre-and post-menopausal women. Additionally, it is the most common hormone treatment for male breast cancer."}, {"url": "http://www.everydayhealth.com/drugs/tamoxifen", "passage_text": "Tamoxifen is the generic form of the brand-name drug Soltamox, which is used to treat some types of breast cancer in men and women. Tamoxifen is used for breast cancer and in women who are at a high risk of developing breast cancer. (http://www.everydayhealth.com/breast-cancer/understanding.aspx). Common side effects of tamoxifen include hot flashes, depressed mood, nausea, headache and thinning of the hair."}]