[{"url": "http://www.remodelcostguide.com/brick-paver-driveway-installation-costs/", "passage_text": "Driveway Pavers Material Costs: Depending on the style you choose, they’ll cost $3 to $5 per square foot. Brick Paver Driveway Labor Costs: The cost depends on the amount of preparation work that needs to be done and the intricacy of the pattern. Labor costs will range from $4.50 to $12.50"}, {"url": "http://homewyse.com/services/cost_to_install_brick_paver_driveway.html", "passage_text": "Our free calculator uses recent, trusted data to estimate costs for your Brick Paver Driveway Installation project. For a basic 120 square feet project in zip code 47474, the benchmark cost to Install a Brick Paver Driveway ranges between $10.75 - $15.51 per square foot* . To estimate costs for your project: 1."}, {"url": "http://home.costhelper.com/paver-driveways.html", "passage_text": "1 Concrete is typically the least expensive and easiest to install of the three types of driveway pavers, and come in a wide variety of looks from traditional charm to modern sleekness. 2  Installing a brick driveway typically costs $10 -$30 or more a square foot, or $3,000 -$9,000 for 12'x25' or $9,600 -$28,800 for 24'x40'."}, {"url": "http://www.homewyse.com/services/cost_to_install_driveway_pavers.html", "passage_text": "Our free calculator uses recent, trusted data to estimate costs for your Driveway Paver Installation project. For a basic 120 square feet project in zip code 47474, the benchmark cost to Install Driveway Pavers ranges between $9.69 - $13.34 per square foot* . To estimate costs for your project: 1."}, {"url": "http://www.improvenet.com/r/costs-and-prices/interlocking-driveway-pavers", "passage_text": "The pavers are sold by numerous manufacturers at various quality levels. An average paver costs from $1.23 to $1.50/sf. The substrate for a 1,000-square-foot driveway would cost more than $500, and the concrete would cost around $75. Joint sand would cost under $50. The second category is cost of installation."}, {"url": "http://www.remodelcostguide.com/brick-paver-driveway-installation-costs/", "passage_text": "Total Costs for a Brick Paver Driveway: With installation as the biggest variable, your total costs for a paver stone driveway will be $7.50 to $17.50 per square foot with an average cost of about $13.50 per square foot."}]