[{"url": "http://www.answers.com/Q/Why_was_machu_picchu_built", "passage_text": "Macchu Picchu is in the Andes Mountains, in Peru. Machu Picchu was built by the Inca's Civilization (Tahuantinsuyo Empire) in the Andes Mountains near Cusco. It's the jungle … of Cusco. Machu Picchu is one of The New Seven Wonders of the World. Machu Picchu was built by the Incan Civilization around 1450 in the jungle and mountains near Cusco, Peru. Machu Picchu is one of The Seven Won … "}, {"url": "http://www.answers.com/Q/Why_was_machu_picchu_built", "passage_text": "Machu Picchu was built by the Inca's Civilization or Tahuantinsuyo Empire, Machu Picchu is one of The Seven Wonders of th … e World, Machu Picchu is in Cusco Peru and is beautiful and sacred. Machu Picchu was built by the Incan Civilization around 1450 in the jungle and mountains near Cusco, Peru. Machu Picchu is one of The Seven Won … ders of the World."}, {"url": "http://www.answers.com/Q/Who_built_Machu_Picchu", "passage_text": "it is located in Peru and the Inca empire built it. Machu Picchu was built by the Inca's Civilization or Tahuantinsuyo Empire, Machu Picchu is one of The Seven Wonders of th … e World, Machu Picchu is in Cusco Peru and is beautiful and sacred. The Incas built Machu Picchu. Machu Picchu was built by the Incan Civilization around 1450 in the jungle and mountains near Cusco, Peru. Machu Picchu is one of The Seven Wonders of the World."}, {"url": "http://www.discover-peru.org/machu-picchu/", "passage_text": "It is believed that Machu Picchu was built around AD1460. The Inca citadel is located 80 km northwest the city of Cusco, it sits majestically between the mountains of Machu Picchu and Wuayna Picchu in the most unreachable area of the Urubamba River. "}, {"url": "http://www.livescience.com/22869-machu-picchu.html", "passage_text": "An emperor’s abode. Machu Picchu is believed to have been built by Pachacuti Inca Yupanqui, the ninth ruler of the Inca, in the mid-1400s. An empire builder, Pachacuti initiated a series of conquests that would eventually see the Inca grow into a South American realm that stretched from Ecuador to Chile. Machu Picchu is a 15th-century Inca site located on a ridge between the Huayna Picchu and Machu Picchu mountains in Peru. It sits 7,970 feet (2,430 meters) above sea level on the eastern slope of the Andes and overlooks the Urubamba River hundreds of feet below"}, {"url": "http://www.answers.com/Q/Who_built_Machu_Picchu", "passage_text": "Macchu Picchu is in the Andes Mountains, in Peru. Machu Picchu was built by the Inca's Civilization (Tahuantinsuyo Empire) in the Andes Mountains near Cusco. It's the jungle … of Cusco. Machu Picchu is one of The New Seven Wonders of the World. The Incas built Machu Picchu. Machu Picchu was built by the Incan Civilization around 1450 in the jungle and mountains near Cusco, Peru. Machu Picchu is one of The"}, {"url": "https://en.wikipedia.org/wiki/Machu_Picchu", "passage_text": "It is situated on a mountain ridge above the Sacred Valley which is 80 kilometres (50 mi) northwest of Cuzco and through which the Urubamba River flows. Most archaeologists believe that Machu Picchu was built as an estate for the Inca emperor Pachacuti (1438–1472). Machu Picchu (in hispanicized spelling, [ˈmatʃu ˈpiktʃu]) or Machu Pikchu (Quechua machu old, old person, pikchu peak; mountain or prominence with a broad base which ends in sharp peaks, old peak, pronunciation [ˈmɑtʃu ˈpixtʃu]) is a 15th-century Inca site located 2,430 metres (7,970 ft) above sea level."}, {"url": "https://en.wikipedia.org/wiki/Machu_Picchu", "passage_text": "Machu Picchu was declared a Peruvian Historical Sanctuary in 1981 and a UNESCO World Heritage Site in 1983. In 2007, Machu Picchu was voted one of the New Seven Wonders of the World in a worldwide Internet poll. Machu Picchu was built in the classical Inca style, with polished dry-stone walls. Machu Picchu (in hispanicized spelling, [ˈmatʃu ˈpiktʃu]) or Machu Pikchu (Quechua machu old, old person, pikchu peak; mountain or prominence with a broad base which ends in sharp peaks, old peak, pronunciation [ˈmɑtʃu ˈpixtʃu]) is a 15th-century Inca site located 2,430 metres (7,970 ft) above sea level."}, {"url": "https://worldhistoryproject.org/1450/machu-picchu-built", "passage_text": "It is situated on a mountain ridge above the Urubamba Valley in Peru, which is 80 kilometres (50 mi) northwest of Cuzco and through which the Urubamba River flows. Most archaeologists believe that Machu Picchu was built as an estate for the Inca emperor Pachacuti (1438–1472). Machu Picchu (which means Old Peak) was most likely a royal estate and religious retreat. It was built between 1460 and 1470 AD by Pachacuti Inca Yupanqui, an Incan ruler."}]