[{"url": "http://www.thespicehouse.com/spices/wasabi-powder", "passage_text": "Wasabi is a variety of green horseradish, the powder has a sharp flavor that's a bit hotter than the familiar white horseradish. Wasabi powder provides a nice change of pace from chiles. It provides heat, but has more of an herbal overtone and dissapates more quickly. "}, {"url": "http://www.wikihow.com/Make-Wasabi", "passage_text": "Wasabi, a flavor-packed condiment eaten with sushi and other Asian meals,is a striking green colored and potent variety of horseradish. This Japanese condiment adds flavor and heat as a base ingredient in sauces and spreads. Making wasabi is easy. Genuine wasabi paste is made from wasabi root or powder, but you can use an alternative recipe to make a wasabi-like product that substitutes white horseradish, mustard and green food coloring instead of real wasabi. This latter mixture is akin to the pre-made wasabi paste you can purchase at the grocery store. Ad."}, {"url": "https://en.wikipedia.org/wiki/Wasabi", "passage_text": "Wasabi (わさび（山葵） , originally 和佐比; Eutrema japonicum/Wasabia japonica) is a plant of the Brassicaceae family, which includes cabbages, horseradish, and mustard. It is also called Japanese horseradish, although horseradish is a different plant (which is often used as a substitute for wasabi)."}, {"url": "http://www.sushifaq.com/sushi-sashimi-info/sushi-item-profiles/sushi-items-wasabi/", "passage_text": "Wasabi (wah-sah-bee), often incorrectly called Japanese horseradish, is among the most misunderstood yet integral aspect of the sushi experience. What looks like a lump of green putty is a very complex, spicy yet sweet complement to your sushi meal. When dining and served wasabi with your sushi, the wasabi you are served is not always what it seems. Due to a high demand and limited supply, what is often served with your sushi is a mix of American horseradish, mustard and coloring, which the Japanese call seiyō wasabi (“western wasabi”)."}, {"url": "http://www.merriam-webster.com/dictionary/wasabi", "passage_text": "Full Definition of WASABI. 1. : a condiment that is prepared from the ground thick pungent greenish root of an Asian herb (Wasabia japonica syn. Eutrema wasabi) of the mustard family and is similar in flavor and use to horseradish; also: the root. 2. : the herb that yields wasabi."}, {"url": "https://en.wikipedia.org/wiki/Wasabi", "passage_text": "Wasabi is generally sold either as a stem, which must be very finely grated before use, as dried powder in large quantities, or as a ready-to-use paste in tubes similar to travel toothpaste tubes. It is also called Japanese horseradish, although horseradish is a different plant (which is often used as a substitute for wasabi)."}, {"url": "http://www.kinjirushi.co.jp/english/wasabi.html", "passage_text": "Wasabi (sawa-wasabi) is originated in Japan, and traditionally it has been used as a natural herb. Now, wasabi is one of a primary condiments for Japanese dishes, especially for soba noodle, sashimi and of course for sushi. Usually, rhizome of wasabi is grated and used as condiment. "}, {"url": "http://www.thefreedictionary.com/wasabi", "passage_text": "2. wasabi-the thick green root of the wasabi plant that the Japanese use in cooking and that tastes like strong horseradish; in powder or paste form it is often eaten with raw fish. condiment-a preparation (a sauce or relish or spice) to enhance flavor or enjoyment; mustard and ketchup are condiments. wasabi. n. 1. (Plants) a Japanese cruciferous plant, Eutrema Wasabi, cultivated for its thick green pungent root. 2. (Cookery) the root of this plant, esp in paste or powder form, used as a condiment in Japanese cookery."}, {"url": "http://www.wisegeek.org/what-is-wasabi.htm", "passage_text": "Real wasabi is notoriously difficult to find, and expensive when it is found. Wasabi is sometimes called Japanese horseradish, and its taste is very similar. Real wasabi, called wasabia japonica, is a relative of the watercress family and an elusive little root. Like horseradish, it is a root, or rhizome, and it is grated or sliced for use in cooking. It is difficult to find because it is difficult to grow."}]