[{"url": "http://livingafield.com/Plants_Plantago.htm", "passage_text": "Plantago major: The plant puts forth a densely clustered, green flowered stalk, which later bears numerous seeds. Plantago lanceolata: The summer flower stalk of this variety rises a couple of feet from the ground and is capped by a tiny, green cattail-like cob, from which little tiny flowers sparsely bloom in a halo. Plantago lanceolata: As the name implies, the leaves are lance shaped, or grass-like, and prefer to grow amongst a variety of other plants, usually in fields and meadows Stem/Trunk: N/A Root: Leafstalks emanate from a fibrous root mass."}, {"url": "http://www.witchipedia.com/herb:plantago", "passage_text": "Description. Plantago major is often called plantain, not to be confused with the banana-like plantain which is delicious fried. Plantago is an Eurasian plant that is naturalized throughout much of the United States and considered to be an annoying weed by most who come across it. Plantago lanceolata or narrowleaf plantain is a similar species with longer, thinner leaves and a shorter flower cluster on top of a longer stem. It has similar magical and medicinal properties to broadleaf plantain."}, {"url": "https://en.wikipedia.org/wiki/Plantago_major", "passage_text": "Plantago major (broadleaf plantain or greater plantain) is a species of plantago, family Plantaginaceae. The plant is native to most of Europe and northern and central Asia, but has widely naturalised elsewhere in the world. Plantago major is one of the most abundant and widely distributed medicinal crops in the world."}, {"url": "http://www.botanical.com/botanical/mgmh/p/plarib48.html", "passage_text": "Family: N.O. Several of the wild Plantains have been used indiscriminately for Plantago major. Of these, the most important is Plantago lanceolatus (Linn.), the Ribwort Plantain. ---Description--- This is a very dark green, slender perennial, growing much taller than P. major. ---Parts Used---Leaves, seeds. Several of the wild Plantains have been used indiscriminately for Plantago major. Of these, the most important is Plantago lanceolatus (Linn.), the Ribwort Plantain. ---Description---"}, {"url": "http://www.botanical.com/botanical/mgmh/p/plarib48.html", "passage_text": "Plantaginaceae. Several of the wild Plantains have been used indiscriminately for Plantago major. Of these, the most important is Plantago lanceolatus (Linn.), the Ribwort Plantain. ---Description--- This is a very dark green, slender perennial, growing much taller than P. major. ---Parts Used---Leaves, seeds. Several of the wild Plantains have been used indiscriminately for Plantago major. Of these, the most important is Plantago lanceolatus (Linn.), the Ribwort Plantain. ---Description---"}, {"url": "https://en.wikipedia.org/wiki/Plantago", "passage_text": "As Old English Wegbrade the plantago is one of the nine plants invoked in the pagan Anglo-Saxon Nine Herbs Charm, recorded in the 10th century. In Serbia, Romania, and Bulgaria, leaves from Plantago major are used as a folk remedy to preventing infection on cuts and scratches because of its antiseptic properties. The genus name Plantago descends from the classical Latin name plantago which in classical Latin meant some Plantago species, including Plantago major and Plantago media."}, {"url": "http://livingafield.com/Plants_Plantago.htm", "passage_text": "Plantago lanceolata: A perennial herbaceous plant that prefers to grow amongst a variety of other plants, usually in fields and meadows. Identifying characteristics: Plantago major: A perennial herbaceous plant growing in a basal rosette. Plantago lanceolata: A perennial herbaceous plant that prefers to grow amongst a variety of other plants, usually in fields and meadows. Growth Type: Plantago major: A perennial herbaceous plant growing in a basal rosette. Plantago lanceolata: As the name implies, the leaves are lance shaped, or grass-like, and prefer to grow amongst a variety of other plants, usually in fields and meadows Stem/Trunk: N/A Root: Leafstalks emanate from a fibrous root mass."}, {"url": "http://www.witchipedia.com/herb:plantago", "passage_text": "Magical Attributes. Plantago is feminine in nature and resonates with the planet Venus and the element earth. It is used in spells related to strength, healing and protection and as a charm against snakebites. It can also be used in any working to enhance the affect of other herbs. Plantago lanceolata or narrowleaf plantain is a similar species with longer, thinner leaves and a shorter flower cluster on top of a longer stem. It has similar magical and medicinal properties to broadleaf plantain."}, {"url": "http://livingafield.com/Plants_Plantago.htm", "passage_text": "Plantago lanceolata: As the name implies, the leaves are lance shaped, or grass-like, and prefer to grow amongst a variety of other plants, usually in fields and meadows. Plantago major: Broad, ovate, with prominent raised veins that run parallel to one another along the length of the underside of the leaf. Plantago lanceolata: As the name implies, the leaves are lance shaped, or grass-like, and prefer to grow amongst a variety of other plants, usually in fields and meadows Stem/Trunk: N/A Root: Leafstalks emanate from a fibrous root mass."}, {"url": "http://www.prairielandherbs.com/plantain.htm", "passage_text": "There are over 200 species in the plantain family, and they are found worldwide. Many have herbal uses. Plantago major is the most common one in North America, but Plantago lanceolata can also be found. Both have the same medicinal uses, and are very similar in appearance. Plantago major has wide rounded leaves, with a flowering spike covered with small nubbly seeds; Plantago lanceolata has longer, slender leaves, and a mostly bare flowering stem, with a conelike cluster of flowers on the top. It will grow in sun to shade, and in almost any soil-plantain is very adaptable. Plantain spreads by seeds. Plantain is a low-growing, green plant with oval, ribbed short-stemmed leaves. The leaves form basal rosettes which tend to hug the ground."}]