[{"url": "https://en.wikipedia.org/wiki/Polyethylene_terephthalate", "passage_text": "PET in its natural state is a colorless, semi-crystalline resin. Based on how it is processed, PET can be semi-rigid to rigid, and it is very lightweight. It makes a good gas and fair moisture barrier, as well as a good barrier to alcohol (requires additional barrier treatment) and solvents. "}, {"url": "http://lairdplastics.com/product/materials/petg", "passage_text": "Polyethylene terephthalate (aka. PET, PETE, PETG) is a plastic resin of the polyester family that is used to make beverage, food and other liquid containers, as well as for some other thermoforming applications. PETG is a clear amorphous thermoplastic that can be injection molded or sheet extruded. It can be colored during processing."}, {"url": "http://www.theplanetbottle.net/what-is-pet.html", "passage_text": "PET stands for polyethylene terephthalate, a plastic resin and a form of polyester. Polyethylene terephthalate is a polymer that is formed by combining two monomers: modified ethylene glycol and purified terephthalic acid. "}, {"url": "http://petresin.org/faq.asp", "passage_text": "PET is a polymer of ethylene glycol and terephthalic acid. Pellets of PET resin are heated to a molten liquid, which can be easily extruded or molded into almost any shape. PET was first synthesized in the U.S. during the mid-1940s by DuPont chemists searching for polymers that could be used to make new textile fibers. When PET is used for fiber or fabric applications, it is usually referred to as polyester.. When used for container and packaging applications, it is typically called PET or PET resin.."}, {"url": "http://petresin.org/faq.asp", "passage_text": "PET, or polyethylene terephthalate, is the chemical name for polyester. When PET is used for fiber or fabric applications, it is usually referred to as polyester.. When used for container and packaging applications, it is typically called PET or PET resin.. Back to Top"}, {"url": "http://www.napcor.com/PET/whatispet.html", "passage_text": "PET is polyethylene terephthalate. It's a plastic resin and the most common type of polyester. Two monomers—modified ethylene glycol and purified terephthalic acid—are combined to form the polymer called polyethylene terephthalate. PET was discovered and patented in England in 1941. PET is the plastic labeled with the #1 code. Many beverages, food items and other consumer products are delivered in bottles or packages made from PET. The #1 code is usually found on or near the bottom of the container. Up to 100% of a PET package can be made from recycled PET."}, {"url": "http://petresin.org/aboutpet.asp", "passage_text": "About PET. PET, which stands for polyethylene terephthalate, is a clear, strong and lightweight plastic belonging to the polyester family. It is typically called polyester when used for fibers or fabrics, and PET or PET Resin when used for bottles, jars, containers and packaging applications"}, {"url": "http://www.plastic-products.com/part12.htm", "passage_text": "PET is an unreinforced, semi-crystalline thermo-plastic polyester derived from polyethylene terephthalate. Its excellent wear resistance, low coefficient of friction, high flexural modulus, and superior dimensional stabilty make it a versatile material for designing mechanical and electro-mechanical parts. "}, {"url": "http://petresin.org/faq.asp", "passage_text": "PET, which stands for polyethylene terephthalate, is a form of polyester (just like the clothing fabric). It is extruded or molded into plastic bottles and containers for packaging foods and beverages, personal care products, and many other consumer products. When PET is used for fiber or fabric applications, it is usually referred to as polyester.. When used for container and packaging applications, it is typically called PET or PET resin.."}]