[{"url": "http://www.webmd.com/mental-health/dementia-head-injury?print=true", "passage_text": "Persons with a head injury may require medication to treat symptoms such as depression, mania, psychosis, aggression, irritability, mood swings, insomnia, apathy, or impaired concentration. Headaches may also get better with drug treatment."}, {"url": "https://www.alzheimers.org.uk/site/scripts/documents_info.php?documentID=110", "passage_text": "People with dementia may develop behavioural and psychological symptoms including restlessness, aggression, delusions, hallucinations, apathy and sleep disturbances. This factsheet looks at the different types of drugs that can be used to treat these symptoms if non-drug treatments have not worked."}, {"url": "http://www.lbda.org/content/treatment-behavioral-symptoms-when-consider-antipsychotic-medications-lbd", "passage_text": "For example, over-the-counter sleep aids, bladder control medications, and dopaminergic drugs used to treat the motor symptoms of LBD (such as tremors, shuffling walk, and stiffness in arms or legs) can cause confusion, agitation, hallucinations, and delusions."}, {"url": "http://www.gpdsc.com/omha-resources-psych_meds_101.htm", "passage_text": "Haldol (Haloperidol)- is used to treat psychotic disorders and symptoms such as hallucinations, delusions, and hostility and to control muscular tics of the face, neck, hands, and shoulders. Has a sedative quality to it."}, {"url": "http://www.mayoclinic.org/diseases-conditions/schizoaffective-disorder/basics/treatment/con-20029221", "passage_text": "1 Doctors prescribe these medications to treat psychotic symptoms, such as delusions, paranoia and hallucinations. 2  In addition to paliperidone (Invega), other antipsychotic medications that may be prescribed include clozapine (Clozaril), risperidone (Risperdal), olanzapine (Zyprexa) and haloperidol (Haldol)."}, {"url": "http://www.gpdsc.com/omha-resources-psych_meds_101.htm", "passage_text": "Seroquel (Quetiapine)- is used to treat psychotic disorders and symptoms such as hallucinations, delusions, and hostility. Stelazine (Trifluoperazine) - is used to treat schizophrenia"}, {"url": "https://www.alzheimers.org.uk/site/scripts/documents_info.php?documentID=110", "passage_text": "Anticonvulsant drugs are a group of medications that are usually used to treat epilepsy, but are sometimes used for symptoms of aggression and agitation in people with dementia. For example, there is some evidence to suggest that the drug carbamazepine can be effective for the treatment of aggression."}, {"url": "http://www.gpdsc.com/omha-resources-psych_meds_101.htm", "passage_text": "Compazine (Prochlorperazine) - It also is used to treat psychotic symptoms such as hallucinations and hostility, additionally it can assist in anxiety. Daxolin, Loxitane (Loxapine) - is used to treat psychotic disorders and symptoms such as hallucinations, delusions, and hostility."}, {"url": "https://www.alzheimers.org.uk/site/scripts/documents_info.php?documentID=110", "passage_text": "Antipsychotic drugs (also known as neuroleptics or major tranquillisers) are a group of medications that are usually used to treat people with mental health conditions such as schizophrenia. They are also commonly prescribed for behavioural and psychological symptoms in dementia."}, {"url": "http://www.mayoclinic.org/diseases-conditions/schizoaffective-disorder/basics/treatment/con-20029221", "passage_text": "However, a number of medications approved for the treatment of other mental health conditions also may be helpful for schizoaffective disorder. These medications include: 1  Antipsychotics. 2  Doctors prescribe these medications to treat psychotic symptoms, such as delusions, paranoia and hallucinations."}]