[{"url": "https://answers.yahoo.com/question/index?qid=20081228163651AAhvabi", "passage_text": "Best Answer: Protein does not stop ketosis at all. You're supposed to have about 55% of your diet protein, 40% fat, and 5% carbs (or around there). Ketosis stops when you eat too many carbs. And to the person who says that ketosis is catabolic is an idiot"}, {"url": "http://www.marksdailyapple.com/forum/thread6755.html", "passage_text": "On Mark's carbohydrate curve, it states that 0g-50g would put you in ketosis/fat burning but it really depends on the individual. 20g sounds good to me-- I usually do about 10g-30g myself per day. As the title suggests, I would like to know how many carbs one would heave to eat to get into ketosis. I've been getting around 20, almost exclusively from eggs, bacon, almonds, and a bit of lemon on my chicken."}, {"url": "http://forum.lowcarber.org/showthread.php?t=151877", "passage_text": "For me the only thing that seems to stop ketosis is too much cheese :P When you get to around 40g net carbs the sticks will no longer register, but you can still be in jetosis. Rememebr too that keotenes are used for energy, so you can burn most of them and still be in ketosis. "}, {"url": "http://www.bodyrecomposition.com/nutrition/how-many-carbohydrates-do-you-need.html/", "passage_text": "So, summing up mid-article, the absolute requirement for carbohydrates is zero grams per day. However, depending on protein intake, a practical minimum for carbs lies between 50 grams/day (if someone functions well in ketosis) to 100-120 grams per day (if they don’t function well in ketosis). "}, {"url": "http://www.livestrong.com/article/441686-how-many-carbs-should-i-eat-to-prevent-ketosis/", "passage_text": "If you're trying to prevent ketosis but still follow a low-carb diet, aim for between the 50 to 80 grams Sisson says is the initiation point of ketosis and the minimum recommended carb intake set by the IoM. Again, your individual carb intake needs for weight loss depend mostly on your weight and activity level. One of these is ketosis -- a state in which levels of compounds called ketones increase in your body. Ketosis can have undesirable side effects, so you should know how many carbs you need to eat to prevent it from occurring. Talk to your doctor before beginning a low-carb diet"}, {"url": "http://getfit.jillianmichaels.com/eating-fruit-stop-lowcarb-ketosis-2114.html", "passage_text": "Many diets help you lose body fat. For example, a ketogenic -- or low-carbohydrate -- diet is an effective method. You must restrict your total carbohydrate intake and specifically avoid certain types of carbohydrates to remain in ketosis. "}, {"url": "http://forum.bodybuilding.com/showthread.php?t=132736453&pagenumber=1", "passage_text": "Ketosis is not an on/off switch that your muscles will respond to, its just an indicator of the ketone levels in the blood. You don't need carbs to build muscle, and you can derive plenty of energy (to train) from dietary fat. If you want to go low carb, just go full keto and eat 65% fat, 30% protein, 5% carbs. "}, {"url": "http://ketodietapp.com/Blog/post/2013/11/21/How-Many-Carbs-per-Day-on-Low-Carb-Ketogenic-Diet", "passage_text": "While in ketosis, your body effectively uses fat for fuel. In general, the daily intake of net carbs required to enter ketosis could vary from 20 to 100 grams per day (and very rarely over 100 grams per day). Most people, who have experienced ketosis, claim to have reached that state at about 20-50 grams of net carbs per day. I'd suggest you start at 20-30 grams and see how you can adjust it for your needs. Start from a low level of net carbs to ensure you quickly enter ketosis (~ 20 grams of net carbs per day). When you detect ketosis after about 2-3 days, start adding net carbs (about 5 grams each week) until you detect a very low-level or no ketones (using Ketostix or blood ketone meter)."}]