[{"url": "http://nchfp.uga.edu/how/freeze/blanching.html", "passage_text": "Use one gallon water per pound of prepared vegetables. Put the vegetable in a blanching basket and lower into vigorously boiling water. Place a lid on the blancher. The water should return to boiling within 1 minute, or you are using too much vegetable for the amount of boiling water. Start counting blanching time as soon as the water returns to a boil. To cool, plunge the basket of vegetables immediately into a large quantity of cold water, 60ºF or below. Change water frequently or use cold running water or ice water. If ice is used, about one pound of ice for each pound of vegetable is needed. Cooling vegetables should take the same amount of time as blanching."}, {"url": "http://nchfp.uga.edu/how/freeze/blanching.html", "passage_text": "Blanching. Blanching (scalding vegetables in boiling water or steam for a short time) is a must for almost all vegetables to be frozen. It stops enzyme actions which can cause loss of flavor, color and texture. Blanching cleanses the surface of dirt and organisms, brightens the color and helps retard loss of vitamins. To cool, plunge the basket of vegetables immediately into a large quantity of cold water, 60ºF or below. Change water frequently or use cold running water or ice water. If ice is used, about one pound of ice for each pound of vegetable is needed. Cooling vegetables should take the same amount of time as blanching."}, {"url": "http://foodpreservation.about.com/od/Freeze-Vegetables/a/How-To-Blanch-And-Freeze-Green-Beans.htm", "passage_text": "While you are preparing the green beans, have a pot of water coming to a boil on the stove. Also get a big bowl of ice water ready. Blanch. Once you have prepped the beans and, if desired, chopped them into pieces, drop the green beans into the pot of rapidly boiling water. Let them cook for 3 minutes. "}, {"url": "http://localfoods.about.com/od/preparationtips/qt/How-To-Blanch.htm", "passage_text": "1 Bring a pot of water to a boil. 2  If you are blanching peaches or tomatoes in order to peel them, leave the water plain. 3  For everything else, add enough salt so it tastes the water tastes a bit salty. 4  I am not kidding here. 5  None of this dash-of-salt nonsense when it comes to blanching! "}, {"url": "http://www.bhg.com/recipes/how-to/preserving-canning/freeze-green-beans/", "passage_text": "1 Bring a large pot of water to boiling. 2  Allow 1 gallon of water per pound of green beans. 3  Fill a large bowl with ice water. 4  Working in batches, carefully lower the green beans into the boiling water. 5  Boil small beans for 2 minutes, medium beans for 3 minutes, and large beans for 4 minutes. 1 Working in batches, carefully lower the green beans into the boiling water. 2  Boil small beans for 2 minutes, medium beans for 3 minutes, and large beans for 4 minutes. 3  Cool the beans quickly by plunging them into ice water. 4  After the beans have cooled, drain them from the"}, {"url": "http://www.pickyourown.org/beansfreezing.htm", "passage_text": "Blanching times for beans is 3 minutes (the duration should be just long enough to stop the action of the enzymes and kill the bacteria). Begin counting the blanching time as soon as you place the green beans in the boiling water. Plunge the green beans into a large quantity of ice-cold water (I keep adding more ice to it). A good rule of thumb: Cool for the same amount of time as the blanch step. For instance, if you blanch sweet green beans for 7 minutes, then cool in ice water for 7 minutes."}, {"url": "http://www.wikihow.com/Blanch-Beans", "passage_text": "Boil a pot of water. Heat a pot of water to boiling, using approximately one gallon for each pound of beans (8 liters of water per kilogram of beans). If you are only blanching a handful or two of beans, you do not need to measure precisely. 1  Optionally, add salt to the water for flavor. "}, {"url": "http://www.theyummylife.com/blanch_and_peel_tomatoes", "passage_text": "Boil a pot of water. Add tomatoes to the boiling water--no more than a dozen at a time. More than that is hard to handle quickly. Boil for 30-60 seconds, remove tomatoes from the boiling water, and. . . . . . immediately put the tomatoes in an ice-water-filled sink or bowl. As they chill, you will see the skins start to pull away from the meat of the tomato. Remove the tomatoes from the ice water"}, {"url": "http://www.pickyourown.org/freezingcorn.htm", "passage_text": "Blanching times generally vary from one to 10 minutes, depending on the vegetable. The duration should be just long enough to stop the action of the enzymes. Begin counting the blanching time as soon as you place the corn in the boiling water, noting that the water ought to return to a boil in a minute or less. Blanching time varies depending on the type of frozen corn you are making: cut-whole kernel, cream style or corn-on-the-cob: Blanching times, for freezing the corn: Whole Kernel Corn. - 4 to 6minutes. Cream style corn - 4 to 6 minutes."}]