[{"url": "http://www.gardenguides.com/106615-flowers-repel-squirrels.html", "passage_text": "Allium, a perennial from the family Liliaceae, drives squirrels away with the aroma of onions and garlic. There are hundreds of species within the Allium genus that grow from 4 inches to 3 feet in height, projecting colorful pompoms in shades of white, purple, yellow or red. Squirrels enjoy tree nuts, plant seeds, fruit, flowers and bulbs as part of their daily diet."}, {"url": "http://www.wildaboutgardens.org.uk/wildlife/mammals/squirrel-grey.aspx", "passage_text": "Woodland is the best habitat for grey squirrels as it provides abundant of food and shelter. Home for the squirrel is either a nest called a drey, hidden in the high branches, or a den in a hollow tree. These provide protection from the weather and a place to rear their young. Grey squirrels can adapt to the open and are commonly found in urban parks and gardens, collecting much of their food from the ground. Grey squirrels are familiar rodents with a grey bushy tail and body, except for white underparts and a small amount of russet colouring."}, {"url": "http://www.wildaboutgardens.org.uk/wildlife/mammals/squirrel-grey.aspx", "passage_text": "Don’t confuse grey squirrels with the native red squirrel, which is red-brown all over except for a white patch on its chest, and which has tufts on its ears in winter. Grey squirrels are familiar rodents with a grey bushy tail and body, except for white underparts and a small amount of russet colouring."}, {"url": "http://www.anti-squirrel.com/index.php", "passage_text": "Some side effects of thyroid condition. Side effects of undertaking certain medication. It is important to meet your physician for a blood test, so as to determine the cause of these symptoms in you. The only perfect and sure way of determining the level of your testosterone is through a blood test. People don't relate to romantic partners in the same way that they do to, say, their accountant. Objectivity doesn't factor in as fully when it comes to romance. At the same time, it's not all about emotion either. A relationship is something like a bridge which sits soundly in the middle of both factors."}, {"url": "http://www.pleasebekind.com/squirrel.html", "passage_text": "Peaceful Coexistence SQUIRRELS Squirrel Facts Squirrels are one of the most successful mammals in accommodating to human-altered environments. They are among the top vote-getters for presenting problems to people. They are also among the best-loved animals. There are several species of squirrels in North America, but the gray squirrel is usually the one involved in homeowner conflicts. They are about 8 to 10 inches long with a tail that is almost the same length. Their color can vary from a reddish tint to almost pure white. There is even an all black form."}, {"url": "http://www.humanesociety.org/animals/squirrels/tips/solving_problems_squirrels.html", "passage_text": "Here's what to do about: » Squirrels and Bird Feeders» Squirrel Damage in Your Yard and Garden » Squirrels Nesting in the Attic» Squirrels Nesting in the Chimney» A Squirrel Loose In the House. Tree squirrels are cute, fuzzy, and fun to watch, but humans have something of a love/hate relationship with them. We love their crazy antics—but we hate when they're raiding our birdfeeders."}, {"url": "http://www.gardenguides.com/106615-flowers-repel-squirrels.html", "passage_text": "Comments. Submit. Squirrels enjoy tree nuts, plant seeds, fruit, flowers and bulbs as part of their daily diet. While chemical repellents and live traps are widely available, natural methods of deterring squirrels from prized plants are less expensive, environmentally friendly and do not harm the animals"}, {"url": "http://www.humanesociety.org/animals/squirrels/tips/solving_problems_squirrels.html", "passage_text": "If you've got squirrels driving you nutty, remember that they're only doing what's natural: looking for a meal and a safe place to sleep at night. Whether you need to evict them from your attic or stop them from stealing your bird food, be patient and look for a way that won't harm the critters or their young. Tree squirrels are cute, fuzzy, and fun to watch, but humans have something of a love/hate relationship with them. We love their crazy antics—but we hate when they're raiding our birdfeeders."}, {"url": "http://homeguides.sfgate.com/sound-repellent-devices-really-keep-rodents-away-88767.html", "passage_text": "Sound repellent devices claim to repel everything from insects to rodents. Sonic or ultrasonic sound repellents are marketed as a way to drive or frighten a variety of rodents away from your home and garden. While these devices may seem to work initially, their effectiveness is not proven."}, {"url": "http://www.humanesociety.org/animals/squirrels/tips/solving_problems_squirrels.html", "passage_text": "What to Do About Squirrels. Adapted from the book Wild Neighbors. Tree squirrels are cute, fuzzy, and fun to watch, but humans have something of a love/hate relationship with them. We love their crazy antics—but we hate when they're raiding our birdfeeders."}]