[{"url": "https://en.wikipedia.org/wiki/Red_wine", "passage_text": "A glass of red wine. Red wine is a type of wine made from dark-coloured (black) grape varieties. The actual colour of the wine can range from intense violet, typical of young wines, through to brick red for mature wines and brown for older red wines."}, {"url": "http://winefolly.com/review/light-red-wine/", "passage_text": "Pinot Noir. Pinot Noir sets the benchmark for light red wine. It is the most widely grown wine variety, originally cultivated by Cistertian monks in Burgundy, France. Pinot Noir’s high acidity and low alcohol make it a great wine for long term aging. Because of the way it’s produced, Lambrusco is the lightest red wine on our list. Lambrusco is the name of several indigenous wine grapes in the region of Emilia Romagna in Northern Italy (where they make all that delicious cheese). There are about 15 kinds of Lambrusco grapes, but about 6 are commonly known."}, {"url": "http://vinepair.com/wine-101/wine-body-guide/", "passage_text": "The reason alcohol is the main contributor to a wine’s body is because alcohol is what gives a wine its viscosity and is responsible for either the heavy or light mouthfeel we experience when we sip a wine. Wine Body Definition: In wine talking about body is not a discussion of shapeliness, but instead an analysis of the way a wine feels inside our mouth."}, {"url": "http://vinepair.com/wine-101/wine-body-guide/", "passage_text": "Wine body breaks down into three categories: light body, medium body and full body, and a good way to think about the difference between them is the way skim milk, whole milk and cream feel in your mouth. While there are many factors that can contribute to a wine’s body, the main factor is alcohol. Wine Body Definition: In wine talking about body is not a discussion of shapeliness, but instead an analysis of the way a wine feels inside our mouth."}, {"url": "http://vinepair.com/wine-101/wine-body-guide/", "passage_text": "This is why we call a heavily viscous wine full-bodied and a low viscosity wine light-bodied. Here are the general rules: Wines Under 12.5% alcohol (the alcohol percentage should always be written on the wine’s label) are said to light-bodied. Wine Body Definition: In wine talking about body is not a discussion of shapeliness, but instead an analysis of the way a wine feels inside our mouth."}, {"url": "http://winefolly.com/review/light-red-wine/", "passage_text": "Lambrusco. Because of the way it’s produced, Lambrusco is the lightest red wine on our list. Lambrusco is the name of several indigenous wine grapes in the region of Emilia Romagna in Northern Italy (where they make all that delicious cheese). There are about 15 kinds of Lambrusco grapes, but about 6 are commonly known."}, {"url": "http://wine.about.com/od/redwines/a/redwinebasics.htm", "passage_text": "As with all wines, the particular winemaker will have adequate “say” in the style of wine he will produce. That said, red wines are often classified by “ body-type .” For example, one might say that a certain red wine is “light-bodied” – referring to the mouth-feel and tannin structure. A light-bodied wine will have fewer tannins present and less presence on the palate. These wines tend to be less demanding partners with flavor-filled foods. An example of a light-bodied red wine would be one derived from the Gamay grape varietal, such as France’s famed young red wine: Beaujolais Nouveau. Sometimes, you will hear of red wines referred to by their popular regional names. For example, a Bordeaux is a red wine from France that is made primarily from three varietals: Cabernet Sauvignon, Cabernet Franc and Merlot grapes."}, {"url": "http://www.webstaurantstore.com/guide/580/types-of-wine-glasses.html", "passage_text": "Red wines are best served in large wine glasses, like these red wine glasses. The bowls of these glasses will be fuller and rounder with a larger opening than other wine glasses of similar capacities in order to allow you to dip your nose into the glass to detect aroma. The bowls of wine glasses are also designed to allow an amount of surface area appropriate to the wine-red wine glasses will have a larger amount of surface area for the wine to allow it to breathe, while white wine glasses will have a smaller amount of surface area."}]