[{"url": "http://www.urbandictionary.com/define.php?term=juggalo%2Fjuggalette", "passage_text": "20 Words related to juggalo/juggalette. 1  juggalo. 2  icp. 3  juggalette. 4  insane clown posse. 5  clown. 6  juggalettes. 7  juggalos. 8  down with the clown. 9  family. 10  faygo. 11  hatchet. 12  mmfwcl. 13  psychopathic records. 14  shangri-la. 15  twiztid. 16  wicked. 17  boondox. 18  jugalo. 19  lette. 20  ninja. 5. Claim that you don't have to like ICP, or even psychopathic records to be a juggalo. This statement, in and of itself, is absolutely moronic. Since ICP coined the term juggalo to refer to their fans, I doubt that die-hard Shania Twain fans are going to be calling themselves juggalos anytime soon."}, {"url": "https://en.wikipedia.org/wiki/Juggalo", "passage_text": "Juggalo (feminine Juggalette, or Juggala in Spanish speaking countries) is a name given to fans of the group Insane Clown Posse or any other Psychopathic Records hip hop group. Juggalos have developed their own idioms, slang and characteristics. Many characteristics of the Juggalo culture originated from in the 1980s, when Joseph Bruce (Violent J) and his family were living in poverty. He and his brother Robert received all their clothes from rummage sales, and their food from canned food drives held at their own school."}, {"url": "http://www.urbandictionary.com/define.php?term=juggalo", "passage_text": "20 Words related to juggalo. 1  icp. 2  juggalette. 3  insane clown posse. 4  juggalos. 5  twiztid. 6  faygo. 7  clown. 8  ninja. 9  dark carnival. 10  psychopathic records. 11  family. 12  psychopathic. 13  violent j. 14  juggalettes. 15  hatchet. 16  shaggy 2 dope. 17  insane. 18  dark lotus. 19  hatchetman. 20  juggalo/juggalette. juggalo. For the most part, an uneducated, pathetic excuse for a human being who listens to the group ICP who are bold enough to actually consider themselves musicians. People you see wearing hatchet-man accesories. They should not be allowed to reproduce, because that is too cruel to future generations"}, {"url": "http://www.definitions.net/definition/Juggalo", "passage_text": "Juggalo. Juggalo is a name given to fans of Insane Clown Posse or any other Psychopathic Records hip hop group. Juggalos have developed their own idioms, slang and characteristics. "}, {"url": "https://en.wikipedia.org/wiki/Juggalos_(gang)", "passage_text": "(Redirected from Juggalos (gang)). Not to be confused with the Juggalo music subculture from which the gang was birthed. Juggalo (or Juggalette for females) is a name given to dedicated fans of the rap group Insane Clown Posse or any other Psychopathic Records artist."}, {"url": "http://www.yourdictionary.com/juggalo", "passage_text": "LINK / CITE ADD TO WORD LIST. noun. The definition of a Juggalo is a fan of psychopathic records hip hop groups, especially the Insane Clown Posse. An example of a Juggalo is someone who goes to all of the Insane Clown Posse events."}, {"url": "http://juggalos.wikia.com/wiki/List_of_Juggalo_terms", "passage_text": "J Edit. Juffalo-A term a juggalo uses to insult another juggalo they consider to be fake. Juggaho-A term a juggalo uses to insult another juggalo they consider to be fake. Juggalo-A name given to fans of Insane Clown Posse or any other Psychopathic Records act. Also the name of the sub culture. "}, {"url": "https://en.wikipedia.org/wiki/Juggalo", "passage_text": "During the song The Juggla, Violent J addressed the audience as Juggalos, and the positive response resulted in Violent J and Shaggy 2 Dope using the word thereafter to refer to themselves and their friends, family and fans, including other Psychopathic Records artists. Many characteristics of the Juggalo culture originated from in the 1980s, when Joseph Bruce (Violent J) and his family were living in poverty. He and his brother Robert received all their clothes from rummage sales, and their food from canned food drives held at their own school."}]