[{"url": "https://en.wikipedia.org/wiki/Lip_Sync_Battle", "passage_text": "Lip Sync Battle debuted on the American cable network Spike, on Thursday April 2, 2015. It is produced by John Krasinski and Stephen Merchant and hosted by rapper and actor LL Cool J."}, {"url": "https://en.wikipedia.org/wiki/Lip_Sync_Battle", "passage_text": "Lip Sync Battle is an American musical comedy television program which premiered on April 2, 2015, on Spike cable network."}, {"url": "http://www.nytix.com/TVShows/2015/lipsyncbattle.html", "passage_text": "Spike TV's Lip Sync Battle TV Show was developed by Stephen Merchant, John Krasinski and Emily Blunt and began as a small segment on Jimmy Fallon's Tonight Show in April 2014. The first recording of the new stand-alone-show was in January 2015, at the ABC studios at 320 W. 66th street in New York City."}, {"url": "http://www.rollingstone.com/music/news/jimmy-fallons-lip-sync-battle-gets-spinoff-tv-show-20141122", "passage_text": "One of the most beloved routines from Jimmy Fallon's Tonight Show reign is about to get its own television show: Lip Sync Battle, based on those ridiculous competitions that pit the late night host up against celebrities to see who can pantomime pop songs better, will head to Spike TV in 2015."}, {"url": "http://www.sidereel.com/lip_sync_battle", "passage_text": "30 minutes. Each Lip Sync Battle episode will feature celebrities going head to head – lip synching the song of their choice – battling for bragging rights. Along with serving as executive producers, Fallon, Krasinski, and Merchant will appear and perform."}, {"url": "http://www.spike.com/shows/lip-sync-battle", "passage_text": "Lip Sync Battle is already a huge viral sensation. Now Spike is taking it to the next level with its very own show, hosted by LL Cool J and with colorful commentary by social media maven and supermodel co-host, Chrissy Teigen. Each episode will feature two A-list celebrities like you've never seen them before-synching their hearts out in hysterically epic performances."}, {"url": "http://www.rollingstone.com/music/news/jimmy-fallons-lip-sync-battle-gets-spinoff-tv-show-20141122", "passage_text": "Former SNL director Beth McCarthy-Miller will direct Lip Sync Battle. The pilot episode will film in front of a live audience in New York this coming January, with the Spike premiere penciled in for April 2, 2015. Lip Sync Battle 's fulltime host and participating talent will be announced later, the Hollywood Reporter writes."}, {"url": "https://en.wikipedia.org/wiki/Lip_Sync_Battle", "passage_text": "Overview [edit]. Lip Sync Battle debuted on the American cable network Spike, on Thursday April 2, 2015. It is produced by John Krasinski and Stephen Merchant and hosted by rapper and actor LL Cool J. Model Chrissy Teigen serves as color commentator."}]