[{"url": "http://www.ninds.nih.gov/disorders/headache/detail_headache.htm", "passage_text": "Some of the more serious causes of secondary headache include: Brain tumor. A tumor that is growing in the brain can press against nerve tissue and pain-sensitive blood vessel walls, disrupting communication between the brain and the nerves or restricting the supply of blood to the brain. The presumed cause of trigeminal neuralgia is a blood vessel pressing on the nerve as it exits the brain stem, but other causes have been described. Symptoms include headache and intense shock-like or stabbing pain that comes on suddenly and is typically felt on one side of the jaw or cheek."}, {"url": "http://www.webmd.com/cancer/lymphoma/blood-disorder-types-and-treatment", "passage_text": "Blood Disorders Affecting Red Blood Cells. Blood disorders that affect red blood cells include: Anemia: People with anemia have a low number of red blood cells. Mild anemia often causes no symptoms. More severe anemia can cause fatigue, pale skin, and shortness of breath with exertion. Iron-deficiency anemia: Iron is necessary for the body to make red blood cells. Low iron intake and loss of blood due to menstruation are the most common causes of iron-deficiency anemia. It may also be caused by blood loss from the GI tract because of ulcers or cancer."}, {"url": "http://www.healthline.com/health/bleeding-disorders", "passage_text": "A bleeding disorder is a condition that affects the way your blood normally clots. When you get injured, your blood normally begins to clot to prevent a massive loss of blood. Sometimes the mechanism that causes the blood to clot fails, resulting in rapid or prolonged bleeding. Other conditions that can cause bleeding disorders are: 1  liver disease. 2  low red blood cell count. 3  vitamin K deficiency. 4  medication side-effects."}, {"url": "http://umm.edu/health/medical/reports/articles/menstrual-disorders", "passage_text": "Common causes of secondary dysmenorrhea include: 1  Endometriosis. 2  Endometriosis is a chronic and often progressive disease that develops when the tissue that lines the uterus (endometrium) grows onto other areas, such as the ovaries, bowels, or bladder. 3  It often causes chronic pelvic pain. Blood tests can help rule out other conditions that cause menstrual disorders. For example, your doctor may test thyroid function to make sure that low thyroid (hypothyroidism) is not present. Blood tests can also check follicle-stimulating hormone, estrogen, and prolactin levels."}, {"url": "http://www.hematology.org/Patients/Anemia/", "passage_text": "Anemia and Pregnancy-Learn about the risk factors and symptoms of anemia during pregnancy. Aplastic anemia is a rare form of anemia that occurs when the body stops making enough red blood cells. Common causes include viral infections, exposure to toxic chemicals, drugs, and autoimmune diseases. Idiopathic aplastic anemia is the term used when the reason for low red blood cell production is not known. Anemia occurs when you do not have enough red blood cells or when your red blood cells do not function properly. It is diagnosed when a blood test shows a hemoglobin value of less than 13.5 gm/dl in a man or less than 12.0 gm/dl in a woman. Normal values for children vary with age."}, {"url": "http://www.hematology.org/Patients/Anemia/", "passage_text": "Hemolytic anemia occurs when red blood cells are broken up in the bloodstream or in the spleen. Hemolytic anemia may be due to mechanical causes (leaky heart valves or aneurysms), infections, autoimmune disorders, or congenital abnormalities in the red blood cell. Anemia occurs when you do not have enough red blood cells or when your red blood cells do not function properly. It is diagnosed when a blood test shows a hemoglobin value of less than 13.5 gm/dl in a man or less than 12.0 gm/dl in a woman. Normal values for children vary with age."}, {"url": "http://umm.edu/health/medical/reports/articles/menstrual-disorders", "passage_text": "1 Endometriosis. 2  Endometriosis is a chronic and often progressive disease that develops when the tissue that lines the uterus (endometrium) grows onto other areas, such as the ovaries, bowels, or bladder. 3  It often causes chronic pelvic pain. Blood tests can help rule out other conditions that cause menstrual disorders. For example, your doctor may test thyroid function to make sure that low thyroid (hypothyroidism) is not present. Blood tests can also check follicle-stimulating hormone, estrogen, and prolactin levels."}, {"url": "http://www.healthline.com/health/bleeding-disorders", "passage_text": "Bleeding disorders are often caused by a failure of the blood to clot. Several conditions can affect the way the blood clots. Many causes are related to protein defects in the plasma (the liquid component of blood). Other conditions that can cause bleeding disorders are: 1  liver disease. 2  low red blood cell count. 3  vitamin K deficiency. 4  medication side-effects."}, {"url": "http://www.mayoclinic.org/diseases-conditions/chest-pain/basics/causes/con-20030540", "passage_text": "Lung-related causes. Many lung disorders can cause chest pain, including: 1  Pulmonary embolism. 2  This cause of chest pain occurs when a blood clot becomes lodged in a lung (pulmonary) artery, blocking blood flow to lung tissue. 3  Pleurisy. Heart-related causes. Examples of heart-related causes of chest pain include: 1  Heart attack. 2  A heart attack is a result of a blood clot that's blocking blood flow to your heart muscle. 3  Angina."}]