[{"url": "http://bna.birds.cornell.edu/bna/species/031/articles/breeding", "passage_text": "Incubation. Incubation begins with laying of the first egg and continues until the second egg hatches or is abandoned (usually 1 or 2 d after hatching of first egg). Cranes will continue to incubate an addled or infertile clutch 10-15 d beyond the normal incubation period (Nesbitt 1988). "}, {"url": "http://www.fws.gov/northflorida/WhoopingCrane/whoopingcrane-fact-2001.htm", "passage_text": "Whooping cranes generally do not produce fertile eggs until age 4. RANGE AND POPULATION LEVEL: Historic: The historic range of the whooping crane once extended from the Arctic coast south to central Mexico, and from Utah east to New Jersey, into South Carolina, Georgia, and Florida. The life span is estimated to be 22 to 24 years in the wild. Whooping cranes are omnivorous feeders. They feed on insects, frogs, rodents, small birds, minnows, and berries in the summer. In the winter, they focus on predominantly animal foods, especially blue crabs and clams."}, {"url": "http://friendsofthewildwhoopers.org/record-164-whooping-cranes-now-incubating-eggs/", "passage_text": "Based on past research, approximately 90% of the nest will contain 2 eggs, 9% will contain 1 egg and 1% will contain 3 eggs. Eggs average 100 mm in length and 63 mm in width. Whooping crane pairs share in incubation of the eggs. Incubation lasts from 29 to 31 days. Fortunately, egg predation is uncommon, and re-nesting by whooping cranes is believed to be rare. So, normally whooping cranes usually produce clutches of 2 eggs laid 48 to 60 hours apart. Incubation begins with the first egg laid. Therefore, hatching of the eggs does not occur at the same time."}, {"url": "http://www.answers.com/Q/What_is_the_gestation_period_foe_sandhill_cranes", "passage_text": "Making the world better, one answer at a time. Based solely on google searches, it appears the gestation period for sandhill cranes is about 30 to 32 days. They often lay 2 eggs (alternating days) and often only 1 is fertile. There are 2 eggs being watched now (5/22/2012) that were layed on or about 5/4/2012. "}, {"url": "http://www.bringbackthecranes.org/technicaldatabase/NestProductionStudies.html", "passage_text": "The incubation period is from 29 to 31 days. Around 90 percent of the clutches contain two eggs. Whooping cranes may re-nest if their first clutch is destroyed or lost before mid-incubation. Egg predation is uncommon at Wood Buffalo NP, and renesting has only been documented a few times. Several pairs have nested in the same areas for 22 consecutive years. Wild whooping cranes may start laying eggs as early as three years of age although the average age of first egg production is usually five years old."}, {"url": "http://www.fws.gov/northflorida/WhoopingCrane/whoopingcrane-fact-2001.htm", "passage_text": "They construct nests of bulrush and lay one to three eggs, (usually two) in late April and early May. The incubation period is about 29 to 31 days. Whooping cranes will renest if the first clutch is lost or destroyed before mid-incubation. Both sexes share incubation and brood-rearing duties. Despite the fact that most pairs lay two eggs, seldom does more than one chick reach fledging. The life span is estimated to be 22 to 24 years in the wild. Whooping cranes are omnivorous feeders. They feed on insects, frogs, rodents, small birds, minnows, and berries in the summer. In the winter, they focus on predominantly animal foods, especially blue crabs and clams."}, {"url": "http://www.bringbackthecranes.org/technicaldatabase/NestProductionStudies.html", "passage_text": "Prepared 2010; updated 2011. The number of young hatched and successfully raised by whooping crane pairs in the reintroduced population is below expectation with most pairs abandoning first nests after egg laying. Several pairs have nested in the same areas for 22 consecutive years. Wild whooping cranes may start laying eggs as early as three years of age although the average age of first egg production is usually five years old."}, {"url": "https://en.wikipedia.org/wiki/Whooping_crane", "passage_text": "The whooping crane (Grus americana), the tallest North American bird, is an endangered crane species named for its whooping sound. In 2003, there were about 153 pairs of whooping cranes. Along with the sandhill crane, it is one of only two crane species found in North America. The whooping crane's lifespan is estimated to be 22 to 24 years in the wild. After being pushed to the brink of extinction by unregulated hunting and loss of habitat to just 21 wild and two captive whooping cranes by 1941, conservation efforts have led to a limited recovery."}, {"url": "http://www.answers.com/Q/What_is_the_gestation_period_of_a_crane", "passage_text": "Based solely on google searches, it appears the gestation period for sandhill cranes is about 30 to 32 days. They often lay 2 eggs (alternating days) and often only 1 is ferti … le. There are 2 eggs being watched now (5/22/2012) that were layed on or about 5/4/2012. "}]