[{"url": "http://www.medtrng.com/blackboard/pain_assessment_and_management.htm", "passage_text": "d. In the hospitalized patient, document the patient s response to the pain medication. This is very important for the ongoing accurate assessment of the patient s pain. e. When administering narcotic analgesia, monitor for signs and symptoms of overdose, especially respiratory depression and severe sedation. Classic definition of pain: Pain is an abstract concept which refers to a personal, private sensation of hurt, a harmful stimulus which signals current or impending tissue damage, and a pattern of responses which operate to protect the organism."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/17990126", "passage_text": "The sympathetic nervous system and pain. Schlereth T(1), Birklein F. Author information: (1)Department of Neurology, Johannes Gutenberg-University, Langenbeckstr. 1, Mainz 55101, Germany. schleret@uni-mainz.de. The sympathetic nervous system (SNS) and pain interact on many levels of the neuraxis. In healthy subjects, activation of the SNS in the brain usually suppresses pain mainly by descending inhibition of nociceptive transmission in the spinal cord. Furthermore, some experimental data even suggest that the SNS might control peripheral inflammation and nociceptive activation. In the periphery, inflammation or nociceptive activation is enhanced, spinal descending inhibition is reversed to spinal facilitation, and finally the awareness of all these changes will induce anxiety, which furthermore amplifies pain perception, affects pain behavior, and depresses mood."}, {"url": "http://www.acupunctureintegrated.com/articles/hypersensitivity", "passage_text": "A variety of painful or uncomfortable symptoms may occur that are different from the normal sensation of pain and often very alarming or debilitating. These symptoms often come in episodes with sudden inexplicable onset, are difficult to relieve, and go away just as inexplicably. "}, {"url": "http://www.webmd.com/pain-management/guide/complex-regional-pain-syndrome", "passage_text": "A. A. A. Complex regional pain syndrome (CRPS), also called reflex sympathetic dystrophy syndrome, is a chronic pain condition in which high levels of nerve impulses are sent to an affected site. Experts believe that CRPS occurs as a result of dysfunction in the central or peripheral nervous systems"}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/7632421", "passage_text": "While studies in animal models of neuropathic pain and clinical observations point to a role of the sympathetic nervous system in certain chronic pain states, the function of the sympathetics in postoperative pain and inflammation is debatable. "}, {"url": "http://www.nursingtimes.net/nursing-practice/specialisms/pain-management/understanding-the-physiological-effects-of-unrelieved-pain/205262.article", "passage_text": "Activation of the sympathetic nervous system during an episode of acute pain is known as the ‘fight or flight’ response. The physiological responses that take place via the sympathetic nervous system and the neuro-endocrine system are numerous and intrinsically linked. A noxious stimulus or pain is a stressor that can threaten homeostasis (a steady physiological state). The adaptive response to such a stress involves physiological changes that, in the initial stages, are useful and are also potentially life-saving."}, {"url": "http://www.practicalpainmanagement.com/resources/pain-self-regulation", "passage_text": "A simple example involves pain in association with muscular injury of a limb. The initial response to the injury and consequent pain is the instinctive behavior of ‘splinting’—the generalized spasm of the affected area and not moving the limb. This behavior results in reduction of the pain or avoidance of worse pain. "}, {"url": "https://en.wikipedia.org/wiki/Sympathetic_nervous_system", "passage_text": "The sympathetic nervous system is described as being complementary to the parasympathetic nervous system which stimulates the body to rest-and-digest or feed and breed. (January 2009). The sympathetic nervous system is one of the two main divisions of the autonomic nervous system, the other being the parasympathetic nervous system. The autonomic nervous system functions to regulate the body's unconscious actions. The sympathetic nervous system's primary process is to stimulate the body's fight-or-flight response. It is, however, constantly active at a basic level to maintain homeostasis"}]