[{"url": "http://sweatsolver.com/sweat-stopping-tutorials/reduce-armpit-sweating-in-minutes/", "passage_text": "Reduce Armpit Sweating in Secondary Hyperhidrosis. Sometimes excessive underarm sweat can be caused by problems such as anxiety or obesity. In order to reduce armpit sweating, you need to treat the main problem. If you are overweight, then try to slim down some. If so, then you might have a condition called axillary hyperhidrosis. This type of sweating can be so extreme that most deodorants aren’t enough to control it. Many people wish they knew how to reduce armpit sweating, but it’s not always easy. These remedies are really just the start!"}, {"url": "http://hyperhidrosis-center.com/how-to-stop-underarm-sweating/", "passage_text": "The medical term for excessive underarm sweating is axillary hyperhidrosis and the armpits are notorious for severe sweating. Even though this condition is incredibly common, very few people know how to manage or successfully overcome this condition. An alternative to soap and a method that has been proven to help reduce excessive underarm sweat is exfoliation with a loofah. This clears the pores and seems to work well as a method of how to stop underarm sweating."}, {"url": "http://www.wikihow.com/Stop-Armpit-Sweating", "passage_text": "1 Try using apple vinegar or other malt vinegar to neutralize the armpits' natural odor-causing bacteria. 2  This in turn creates a drying effect in your underarm, which conditions your armpits to sweat less and to stay dry. 3  Try a mixture of lemon juice and tomato pulp before bed. 4  Let sit for 15 minutes. 1 Applying deodorant will do nothing to stop your armpits from sweating though it will mask the odor. 2  You can't stop your body from perspiring completely without medical procedures, which are typically only performed in extreme cases."}, {"url": "http://www.wikihow.com/Stop-Armpit-Sweating", "passage_text": "There are all-natural commercial deodorants, but you can also create your own natural deodorant to control sweat produced in your underarms. 1  Mix equal parts of baking soda and water to create a sweat-controlling paste, then let it sit for 20-30 minutes. 2  After that time, rinse off the mixture with water. 1 Applying deodorant will do nothing to stop your armpits from sweating though it will mask the odor. 2  You can't stop your body from perspiring completely without medical procedures, which are typically only performed in extreme cases."}, {"url": "http://hyperhidrosis-center.com/how-to-stop-underarm-sweating/", "passage_text": "Many of those that live with excessive underarm sweating scrub that the armpit area excessively with soap whilst bathing in an attempt to banish body odour and prevent further sweating. Unfortunately by doing this you are clogging the pores in the armpits which can actually make your sweating problem worse. An alternative to soap and a method that has been proven to help reduce excessive underarm sweat is exfoliation with a loofah. This clears the pores and seems to work well as a method of how to stop underarm sweating."}, {"url": "http://sweatsolver.com/sweat-stopping-tutorials/reduce-armpit-sweating-in-minutes/", "passage_text": "The Cause of the Problem and How to Reduce Armpit Sweating. In extreme cases, the problem can be associated with the sympathetic nervous system. In such cases, medical procedures such as botox, iontophoresis, Anticholinergic drugs, and surgery are the primary options. If so, then you might have a condition called axillary hyperhidrosis. This type of sweating can be so extreme that most deodorants aren’t enough to control it. Many people wish they knew how to reduce armpit sweating, but it’s not always easy. These remedies are really just the start!"}, {"url": "http://www.livestrong.com/article/90756-reduce-sweating-underarms/", "passage_text": "Step 3. Apply antiperspirant at night instead of in the morning. Your underarms produce less sweat at night; thus, the antiperspirant can soak into your pores more easily. Apply another layer of antiperspirant the next morning. Showering will not remove the antiperspirant, since it is already in your pores"}, {"url": "http://www.youtube.com/watch?v=fZIo1Nmgf0s", "passage_text": "Sweating is actually a natural process; it's one of the ways by which the body regulates internal temperature. However, some people have an abnormal number of sweat glands in certain areas of the body such as the armpits, the feet, or the hands. "}, {"url": "http://www.wikihow.com/Stop-Armpit-Sweating", "passage_text": "1 If you struggle from body odor and sweat stains, you need to use an approach that addresses these problems individually. 2  Applying deodorant will do nothing to stop your armpits from sweating though it will mask the odor. 1 Applying deodorant will do nothing to stop your armpits from sweating though it will mask the odor. 2  You can't stop your body from perspiring completely without medical procedures, which are typically only performed in extreme cases."}]