[{"url": "http://www.answers.com/Q/What_is_a_poetic_device", "passage_text": "A poetic device is a language feature such as a simile, metaphor, pun etc. poetic devices or often called poetic methods can be a number of things used in a poem. Examples of poetic devices are."}, {"url": "http://study.com/academy/lesson/poetic-devices-definition-types-examples.html", "passage_text": "Poetic devices are tools that a poet can use to create rhythm, enhance a poem's meaning, or intensify a mood or feeling. These devices help piece the poem together, much like a hammer and nails join planks of wood together."}, {"url": "https://answers.yahoo.com/question/index?qid=20090122140255AAr3Uws", "passage_text": "Report Abuse. Here are some common poetic devices. Alliteration is when a sound is repeated at the beginning like Lisa's lilacs or kicking kangaroo. Onomatopoeia is a like a sound word such as buzz. Rhyme obviously is like cat/bat dog/log etc. A simile compares two things using like or as. Her eyes were like fire."}, {"url": "http://ezinearticles.com/?Poetic-Devices-in-Poetry&id=110584", "passage_text": "Below are the more commonly used poetic devices and terms. Hopefully, with the examples given, everyone can better understand some of the ways to make poetry, well, more poetic. The examples used are my own poetry and are copyrighted in my name."}, {"url": "http://storytrail.com/poetry/poeticdevices.htm", "passage_text": "The following poetic devices can be used in both poetry and prose compositions. The examples given are from personal mask poems composed by Ms. Roderick's ceramics students at Sabino High School (2002-2003). Read through the terms and examples. Then answer the question at the end of this page."}, {"url": "http://study.com/academy/lesson/poetic-devices-definition-types-examples.html", "passage_text": "Devices That Enhance Meaning. There are many devices that can enhance the meaning of a poem. A simile is a comparison between two unlike things. Similes use the words 'like' or 'as.' A simile can get the reader to look at something in a different way."}, {"url": "http://www.chaparralpoets.org/devices.pdf", "passage_text": "–1– Poetic Devices Poetry is the kind of thing poets write. — Robert Frost Man, if you gotta ask, you’ll never know. — Louis Armstrong A POET IS LIMITED in the materials he can use in creating his works: all he has are words to expresshis ideas and feelings."}, {"url": "https://answers.yahoo.com/question/index?qid=20090122140255AAr3Uws", "passage_text": "Here are some common poetic devices. Alliteration is when a sound is repeated at the beginning like Lisa's lilacs or kicking kangaroo. Onomatopoeia is a like a sound word such as buzz. Rhyme obviously is like cat/bat dog/log etc. A simile compares two things using like or as. Her eyes were like fire."}]