[{"url": "http://www.fairmark.com/college/saving/coverdell/contrib.htm", "passage_text": "Per Child Contribution Limit. The annual contribution limit is $2,000 per child. If you have three eligible children you can contribute $2,000 for each of them. But you can't contribute more than $2,000 for any one child even if you set up multiple Coverdell accounts for that child. The $2,000 limit applies to all contributions from all contributors to all Coverdell accounts for any one child for a given year. Example: Your sister-in-law put $1,200 into a Coverdell account for your daughter earlier this year."}, {"url": "http://www.fairmark.com/college/saving/coverdell/contrib.htm", "passage_text": "What's more, if someone else has contributed to a Coverdell account for the same child, the amount you can contribute is reduced. The $2,000 limit applies to all contributions from all contributors to all Coverdell accounts for any one child for a given year. Example: Your sister-in-law put $1,200 into a Coverdell account for your daughter earlier this year."}, {"url": "http://finance.zacks.com/contributing-529-coverdell-same-year-1644.html", "passage_text": "Coverdell Contribution Limits. Each year, only $2,000 can be contributed for each beneficiary, regardless of who is making the contribution. For example, if your child's uncle puts $2,000 in a Coverdell ESA for the child, you can't contribute to an ESA for the child. In addition, you can't contribute to a Coverdell ESA if your income exceeds the annual limits, according to IRS Publication 970. For example, if you put $2,000 in a Coverdell and $13,000 in a 529 plan for your son, you're over the annual exclusion. If you're over the annual limit, you won't owe any gift tax until you've used up your lifetime gift tax credit, but you will have to file a gift tax return."}, {"url": "http://www.savingforcollege.com/intro_to_esas/index.php?esa_faq_category_id=2", "passage_text": "Can we have different family members each set up an account and contribute $2,000? The answer, unfortunately, is no. Besides the $2,000 annual limit on how much you can contribute for a particular child, there is also an overall $2,000 annual limit on contributions to ESAs for the benefit of that particular child."}, {"url": "http://finance.zacks.com/contributing-529-coverdell-same-year-1644.html", "passage_text": "The gift tax exclusion does apply cumulatively to both 529 plan and Coverdell contributions in the same year. As of 2012, the annual gift tax exclusion is $13,000 per person, per year. For example, if you put $2,000 in a Coverdell and $13,000 in a 529 plan for your son, you're over the annual exclusion. If you're over the annual limit, you won't owe any gift tax until you've used up your lifetime gift tax credit, but you will have to file a gift tax return."}, {"url": "https://www.360financialliteracy.org/Topics/Paying-for-Education/College-Savings-Options/529-Plans-vs.-Coverdell-Education-Savings-Accounts", "passage_text": "Contribution limits and restrictions. The annual contribution limit for Coverdell ESAs is $2,000 per beneficiary. That's considerably less than you can contribute to most 529 plans (most plans have lifetime contribution limits of at least $300,000 total). So the more money you have to invest, the more attractive a 529 plan becomes. The age of the beneficiary also limits the use of a Coverdell ESA. You can't start a Coverdell ESA for any beneficiary who's age 18 or older, because you can't make any contributions to a Coverdell ESA after the beneficiary reaches age 18."}, {"url": "http://www.fool.com/college/college02.htm", "passage_text": "Any individual may contribute a maximum of $2,000 a year to a Coverdell ESA for the benefit of any person under age 18. But the contribution limit is phased out for contributors with a modified adjusted gross income between $95,000 and $110,000 for single persons and between $190,000 and $220,000 for joint filers. But there is no reason that Jocelyn can't make a $2,000 gift to Spanky, who can then open his own Coverdell ESA with $2,000, since he's well under the income limitations (assuming his lemonade stand doesn't rake in more than $95,000 a year)."}, {"url": "http://www.fairmark.com/college/saving/coverdell/contrib2.htm", "passage_text": "Example: In a year when you're permitted to contribute $500 to a Coverdell account you contribute $1,500, and there is no corrective distribution. There's an excess of $1,000, so a $60 penalty applies. If the $1,000 excess isn't removed by the end of the next year, another $60 penalty applies. For 2003 you were eligible to contribute $2,000 to the Coverdell account but you contributed only $1,500. You contributed $500 less than the maximum, so you're treated as if you withdrew the $500 excess from the previous year."}, {"url": "http://www.fairmark.com/college/saving/coverdell/contrib2.htm", "passage_text": "1 Two relatives each make contributions to Coverdell accounts for the same student without consulting each other. 2  Remember, anyone can contribute to a Coverdell account, but the $2,000 limit applies to all contributions by all people for any one beneficiary for any one year. For 2003 you were eligible to contribute $2,000 to the Coverdell account but you contributed only $1,500. You contributed $500 less than the maximum, so you're treated as if you withdrew the $500 excess from the previous year."}, {"url": "http://www.fairmark.com/college/saving/coverdell/contrib2.htm", "passage_text": "At one time, a penalty would apply if there were contributions to a 529 plan and a Coverdell account for the same beneficiary in the same year. That restriction disappeared in 2002. As a result, you don't have to give up the Coverdell account if you're saving more than $2,000. For 2003 you were eligible to contribute $2,000 to the Coverdell account but you contributed only $1,500. You contributed $500 less than the maximum, so you're treated as if you withdrew the $500 excess from the previous year."}]