[{"url": "https://en.wikipedia.org/wiki/Supersaturation", "passage_text": "Therefore, at high temperatures, more solute can be dissolved than at room temperature. If this solution were to be suddenly cooled at a rate faster than the rate of precipitation, the solution will become supersaturated until the solute precipitates to the temperature-determined saturation point. Special conditions need to be met in order to generate a supersaturated solution. One of the easiest ways to do this relies on the temperature dependence of solubility. As a general rule, the more heat is added to a system, the more soluble a substance becomes."}, {"url": "http://www.fondriest.com/environmental-measurements/parameters/water-quality/dissolved-oxygen/", "passage_text": "In a stable body of water with no stratification, dissolved oxygen will remain at 100% air saturation. 100% air saturation means that the water is holding as many dissolved gas molecules as it can in equilibrium. At equilibrium, the percentage of each gas in the water would be equivalent to the percentage of that gas in the atmosphere – i.e. its partial pressure ¹³. Just as low dissolved oxygen can cause problems, so too can high concentrations. Supersaturated water can cause gas bubble disease in fish and invertebrates ¹². Significant death rates occur when dissolved oxygen remains above 115%-120% air saturation for a period of time."}, {"url": "http://www.beaumont.edu/press/news-stories/2013/2/supersaturated-oxygen-key-to-preventing-permanent-heart-attack-damage/", "passage_text": "Over the past two decades, cardiologists have explored many different treatments to help prevent permanent heart damage after a heart attack. One treatment that appears to be very promising is supersaturated oxygen-a therapy based on the known benefits of hyperbaric oxygen treatment in patients with burns and wounds. A heart attack is caused by a sudden blockage in one of the coronary arteries that supply the heart muscle with oxygen. This interruption in blood flow causes the muscle cells to die which may weaken the pumping ability of the heart, resulting in congestive heart failure or death."}, {"url": "https://en.wikipedia.org/wiki/Oxygen_saturation", "passage_text": "Oxygen saturation (symbol SO2) is a relative measure of the amount of oxygen that is dissolved or carried in a given medium. It can be measured with a dissolved oxygen probe such as an oxygen sensor or an optode in liquid media, usually water. The standard unit of oxygen saturation is percent (%). In medicine, oxygen saturation refers to oxygenation, or when oxygen molecules (O 2) enter the tissues of the body. In this case blood is oxygenated in the lungs, where oxygen molecules travel from the air and into the blood."}, {"url": "https://en.wikipedia.org/wiki/Supersaturation", "passage_text": "Supersaturation is a state of a solution that contains more of the dissolved material than could be dissolved by the solvent under normal circumstances. It can also refer to a vapor of a compound that has a higher (partial) pressure than the vapor pressure of that compound. Special conditions need to be met in order to generate a supersaturated solution. One of the easiest ways to do this relies on the temperature dependence of solubility. As a general rule, the more heat is added to a system, the more soluble a substance becomes."}, {"url": "http://www.thefreedictionary.com/supersaturated", "passage_text": "supersaturated-being more concentrated than normally possible and therefore not in equilibrium. saturated, concentrated-being the most concentrated solution possible at a given temperature; unable to dissolve still more of a substance; a saturated solution. su·per·sat·u·rate. tr.v. su·per·sat·u·rat·ed, su·per·sat·u·rat·ing, su·per·sat·u·rates. 1. To cause (a chemical solution) to contain more dissolved solute than is normally possible under given conditions of temperature and pressure. 2. To cause (a vapor) to exceed the normal saturation vapor pressure at a given temperature"}, {"url": "http://www.fondriest.com/environmental-measurements/parameters/water-quality/dissolved-oxygen/", "passage_text": "Gas saturation decreases by 10% per meter increase in depth due to hydrostatic pressure ¹². This means that if the concentration of dissolved oxygen is at 100% air saturation at the surface, it would only be at 70% air saturation three meters below the surface. Just as low dissolved oxygen can cause problems, so too can high concentrations. Supersaturated water can cause gas bubble disease in fish and invertebrates ¹². Significant death rates occur when dissolved oxygen remains above 115%-120% air saturation for a period of time."}, {"url": "https://en.wikipedia.org/wiki/Oxygen_saturation", "passage_text": "In aquatic environments, oxygen saturation is a ratio of the concentration of dissolved oxygen (O 2) in the water to the maximum amount of oxygen that will dissolve in the water at that temperature and pressure under stable equilibrium. In medicine, oxygen saturation refers to oxygenation, or when oxygen molecules (O 2) enter the tissues of the body. In this case blood is oxygenated in the lungs, where oxygen molecules travel from the air and into the blood."}, {"url": "http://www.waterontheweb.org/curricula/bs/teacher/oxygen/teaching.html", "passage_text": "temperature (usually 25°C for water) is proportional to the partial pressure of the gas above the liquid. When gas under pressure contacts a liquid, the pressure tends to force gas molecules into solution. At a given pressure the number of gas molecules that will enter into solution rises until equilibrium is reached. Outcomes. Students will be able to: 1  Explain and diagram how nonpolar gases enter into solutions in water. 2  Explain the roles that pressure and temperature play in altering the concentration of gases in water. 3  Explain the physical basis for oxygen supersaturation and how it is related to."}]