[{"url": "http://businesstravel.about.com/od/airlineinformation/g/Oneworld-Members.htm", "passage_text": "Oneworld is one of the leading global airline alliance programs, with twelve major world airlines. In addition to the formal oneworld alliance members, there are a number of airlines affiliated with each member, bringing the combination to over 30 airlines, flying to more than 750 destinations around the world. "}, {"url": "https://en.wikipedia.org/wiki/Oneworld", "passage_text": "Oneworld (marketed as one world; CRS : *O) is an airline alliance founded on 1 February 1999. The alliance's stated objective is to be the first-choice airline alliance for the world's frequent international travelers. Its central alliance office is currently based in New York, New York, in the United States. Oneworld announced the formation of a central alliance team, the Oneworld Management Company (oMC), in February 2000, to mark the alliance's first anniversary."}, {"url": "https://www.oneworld.com/member-airlines/overview", "passage_text": "TAM, which joined the oneworld alliance on 31 March 2014, is the leading carrier in Brazil – Latin America's biggest economy and the region's largest market for air travel. TAM serves 61 destinations in 16 countries in Latin America, the USA and Europe, with a fleet of 172 aircraft operating 800 departures daily. Qatar Airways, the national carrier of the State of Qatar, joined the one world ® alliance in 2013. This Skytrax-rated five-star airline operates a modern fleet of over 125 aircraft to over 130 key business and leisure destinations worldwide."}, {"url": "https://en.wikipedia.org/wiki/Oneworld", "passage_text": "As of 31 March 2014, Oneworld is the third largest global alliance in terms of passengers with 512.8 million passengers, behind Star Alliance (637.6 M) and SkyTeam (588 M). Its slogan is, An alliance of the world's leading airlines working as one.. Oneworld announced the formation of a central alliance team, the Oneworld Management Company (oMC), in February 2000, to mark the alliance's first anniversary."}, {"url": "http://www.britishairways.com/en-gb/information/partners-and-alliances/oneworld", "passage_text": "LAN Airlines is one of the largest and most awarded carriers in Latin America. LAN joined the one world alliance in 2000. The airline serves more than 70 destinations in 20 countries throughout South America, North America, Europe and the Pacific. Established in 1951, Japan Airlines is one of the world’s premier carriers. It joined the one world alliance in 2007. The airline has major hubs at Tokyo, Osaka, Nagoya and Okinawa, and operates almost 900 daily flights to more than 70 destinations across 20 countries."}, {"url": "https://www.oneworld.com/member-airlines/overview", "passage_text": "Japan Airlines. Established in 1951, Japan Airlines is one of the world's premier carriers and joined the one world® alliance in 2007. The airline has major hubs at Tokyo, Osaka and Nagoya, and, with its oneworld affiliates, operates flights to some 75 destinations in 20 countries. Qatar Airways, the national carrier of the State of Qatar, joined the one world ® alliance in 2013. This Skytrax-rated five-star airline operates a modern fleet of over 125 aircraft to over 130 key business and leisure destinations worldwide."}, {"url": "https://www.oneworld.com/member-airlines/overview", "passage_text": "British Airways is one of the world's premier airlines and a founding member of the one world alliance. The airline reaches some 200 destinations in nearly 90 countries from its London Heathrow hub. Qatar Airways, the national carrier of the State of Qatar, joined the one world ® alliance in 2013. This Skytrax-rated five-star airline operates a modern fleet of over 125 aircraft to over 130 key business and leisure destinations worldwide."}, {"url": "http://www.britishairways.com/en-gb/information/partners-and-alliances/oneworld", "passage_text": "airberlin, Germany’s second largest airline, joined the one world alliance in March 2012. It currently serves over 160 destinations in 40 countries. The airline's hubs are Berlin, Duesseldorf, Düsseldorf palma De mallorca And. vienna airberlin AFFILATE niki is the second biggest airline In austria and also a member of one. world Established in 1951, Japan Airlines is one of the world’s premier carriers. It joined the one world alliance in 2007. The airline has major hubs at Tokyo, Osaka, Nagoya and Okinawa, and operates almost 900 daily flights to more than 70 destinations across 2"}, {"url": "https://www.oneworld.com/member-airlines/overview", "passage_text": "A founding member of one world, Australia's Qantas is one of the world's leading airlines, with services to some 80 destinations throughout Asia, the Pacific, Europe, North America and Africa. Qatar Airways, the national carrier of the State of Qatar, joined the one world ® alliance in 2013. This Skytrax-rated five-star airline operates a modern fleet of over 125 aircraft to over 130 key business and leisure destinations worldwide."}]