[{"url": "http://study.com/radiological_tech.html", "passage_text": "Radiological Tech Job Description. Radiological technicians, sometimes called radiographers, help identify medical issues by creating x-ray pictures, or radiographs, of various sections of an individual's body. Technicians must follow specific directions given by physicians in order to get the images of the correct areas of a patient's body. A voluntary certification is offered by the American Registry of Radiologic Technologists (ARRT), and many employers prefer to hire radiographers who have been certified. Certified radiographers have the flexibility to practice freely in most states since ARRT certification is accepted everywhere."}, {"url": "http://www.mymajors.com/career/radiologic-technologists/skills/", "passage_text": "Medicine and Dentistry-Knowledge of the information and techniques needed to diagnose and treat human injuries, diseases, and deformities. This includes symptoms, treatment alternatives, drug properties and interactions, and preventive health-care measures. Personnel and Human Resources-Knowledge of principles and procedures for personnel recruitment, selection, training, compensation and benefits, labor relations and negotiation, and personnel information systems."}, {"url": "http://www.bls.gov/ooh/Healthcare/Radiologic-technologists.htm", "passage_text": "Radiologic and MRI technologists must be licensed or certified in some states; requirements vary by state. To become licensed, technologists must graduate from an accredited program and must pass a certification exam from the state or from the American Registry of Radiologic Technologists (ARRT). Radiologic technologists specialize in x-ray, and computed tomography (CT) imaging. Some radiologic technologists prepare a mixture for the patient to drink that allows soft tissue to be viewed on the images that the radiologist reviews. Radiologic technologists might also specialize in mammography."}, {"url": "http://www.job-interview-site.com/radiologic-technologist-resume-sample.html", "passage_text": "Radiologic Technologist Resume Sample. This sample resume for Radiologic technologist is designed to give you a quick start on writing your own optimized resume for your job application. Radiologic technologists diagnose patient’s body with the help of X-rays images to detect any possible problem. "}, {"url": "http://work.chron.com/radiology-career-skills-11196.html", "passage_text": "A career in radiology requires good communication skills. The ability to listen to what a patient or staff member is saying and make correct decisions on what needs to be done is important. Interpersonal Skills. Whether you choose a career as a radiologist or a radiologic tech, you will be dealing with people. Your patients might be in pain, ill, frightened or stressed. You will need to gain their cooperation if you are to obtain images that are useful for diagnoses."}, {"url": "http://work.chron.com/radiology-career-skills-11196.html", "passage_text": "If you choose to become a radiologic technician or technologist, you can typically earn your certificate in less than one year or your associate degree in about two years. On the other hand, if you choose to become a radiologist, you will need to attend medical school, serve an internship and complete a residency. Regardless of how much time you want to spend to pursue a radiology career, there are certain skills that are essential to the job. Interpersonal Skills. Whether you choose a career as a radiologist or a radiologic tech, you will be dealing with people. Your patients might be in pain, ill, frightened or stressed. You will need to gain their cooperation if you are to obtain images that are useful for diagnoses."}, {"url": "http://hiring.monster.com/hr/hr-best-practices/recruiting-hiring-advice/job-descriptions/radiologic-technologist-job-description.aspx", "passage_text": "This radiologic technologist sample job description can assist in your creating a job application that will attract job candidates who are qualified for the job. Feel free to revise this job description to meet your specific job duties and job requirements. "}, {"url": "http://study.com/articles/Radiology_Tech_Educational_Requirements.html", "passage_text": "Radiology Tech: Educational Requirements. Learn about the education and preparation needed to become a radiology technician. Get a quick view of the requirements as well as details about degree programs, job duties and state licensure to find out if this is the career for you. View 10 Popular Schools ». There is a variety of formal training programs available to future radiology technicians. They may earn certificates, associate's degrees or bachelor's degrees in radiology to be eligible for employment in the U.S.; however, most radiology technicians enter the career with associate's degrees."}, {"url": "http://work.chron.com/radiology-career-skills-11196.html", "passage_text": "Similar logic skills are needed by radiologic techs, who must determine the best method of gaining the view needed with the least distress to the patient. Problem-solving skills are a must in order to suggest treatment or resolve the situation. Interpersonal Skills. Whether you choose a career as a radiologist or a radiologic tech, you will be dealing with people. Your patients might be in pain, ill, frightened or stressed. You will need to gain their cooperation if you are to obtain images that are useful for diagnoses."}, {"url": "http://study.com/articles/Radiology_Tech_Educational_Requirements.html", "passage_text": "Certificate programs in radiology generally take 1-2 years to complete. Through classroom instruction and clinical training, these programs equip students with the technical skills necessary for entry-level positions in radiology technology. There is a variety of formal training programs available to future radiology technicians. They may earn certificates, associate's degrees or bachelor's degrees in radiology to be eligible for employment in the U.S.; however, most radiology technicians enter the career with associate's degrees."}]