[{"url": "http://www.cic.gc.ca/english/passport/forms/pdf/PPTC190.pdf", "passage_text": "Any Canadian certificate of identity or Canadian refugee travel document issued to you in the last five (5) yearsAny valid or expired foreign travel document or national passport issued to you or in which your name appears. If you require an immigration status document, contact Citizenship and Immigration Canada (see section F). J. Previous Canadian Travel Document Enclose any valid Canadian certificate of identity or Canadian refugee travel document issued in your name."}, {"url": "http://www.canadainternational.gc.ca/philippines/consular_services_consulaires/faq_passport_passeport.aspx?lang=eng", "passage_text": "A Canadian citizenship card is your proof of Canadian citizenship. It is not a valid travel document and cannot be used for travel purposes. You are advised to always carry a valid Canadian passport when travelling. Leaving a foreign country and re-entering Canada. No. Canadians can use their passport to return to Canada provided the document is still valid. * If you require a plug-in or a third-party software to view this file, please visit the alternative formats section of our help page. 1  Discover Canada. 2  Visa and Immigration."}, {"url": "http://gocanada.about.com/od/canadatravelplanner/qt/valid_travel_ID.htm", "passage_text": "1 Both U.S. and Canadian citizens apply through U.S. Customs and Border Protection. 2  U.S. Passport Card: This U.S. Department of State-issued ID is valid for entry into Canada by land or sea, though not valid for international air travel. 3  Enhanced Driver's License (EDL) : EDLs indicate both citizenship and identity. "}, {"url": "http://www.cic.gc.ca/english/passport/travel-documents/apply-how.asp", "passage_text": "If you want your travel document to be picked up in person, you need to pay the additional fee when you apply. New travel documents may be picked up by a third party if they provide written consent from the applicant, as well as valid identification. If you applied by mail, the travel document (and any original documentation you submitted) will be returned to you by mail; and may be in two separate packages. If you applied in person and paid for a pickup service, the pickup date will be indicated on your receipt."}, {"url": "http://www.cic.gc.ca/english/passport/forms/pdf/PPTC190.pdf", "passage_text": "If you are issued a Canadian travel document and you later obtain a travel document or a passport issued by your country of citizenship, you must return the Canadian travel document to Passport Program, Citizenship and Immigration Canada. B. If you require an immigration status document, contact Citizenship and Immigration Canada (see section F). J. Previous Canadian Travel Document Enclose any valid Canadian certificate of identity or Canadian refugee travel document issued in your name."}, {"url": "http://www.immigroup.com/canadian-permanent-resident-travel-document", "passage_text": "Canadian Permanent Resident Travel Document. Canadian travel document application is for permanent residents who are outside Canada and who do not have a valid permanent resident card to return to Canada. "}, {"url": "https://en.wikipedia.org/wiki/Travel_document", "passage_text": "The US passport is a type of travel document. A travel document is an identity document issued by a government or international treaty organization to facilitate the movement of individuals or small groups of persons across international boundaries. The most common travel document is a passport, which usually gives the bearer more privileges like visa-free access to certain countries. However, the term is sometimes used only for those documents which do not bear proof of nationality, such as a refugee travel document"}, {"url": "http://www.cbsa-asfc.gc.ca/travel-voyage/td-dv-eng.html", "passage_text": "For all modes of entry, we recommend you carry a valid passport for all travel abroad, including visits to Canada from the United States. A passport may be required by your airline or alternative transportation authority, as it is the only universally-accepted identification document. Identification for international travel. The Government of Canada recommends that Canadian citizens travel with a valid Canadian passport because it is the only reliable and universally-accepted travel and identification document available to Canadians for the purpose of"}, {"url": "https://www.united.com/web/en-US/content/travel/destination/international/passport.aspx", "passage_text": "A secure document is a passport, U.S. permanent resident card, or Stateless travel document, Re-Entry Permit, NEXUS card, U.S Merchant Mariner Card, military ID or emergency travel document issued by an embaRefugeessy or consulate. U.S. passport cards are not valid for air travel outside the United States. "}]