[{"url": "http://hyperphysics.phy-astr.gsu.edu/hbase/Geophys/glacier.html", "passage_text": "Even though the amount of water locked up in glaciers and ice caps is a small percentage of all water on (and in) the Earth, it represents a large percentage of the world's total freshwater. Glaciers can be separated into two broad categories: Continental and Alpine. Continental glaciers form horizontal sheets, accumulating hundreds of meters in thickness-they flatten everything in their path."}, {"url": "http://beyondpenguins.ehe.osu.edu/issue/icebergs-and-glaciers/glaciers-earths-rivers-of-ice", "passage_text": "Simply stated, a glacier is a large, slow-moving mass of ice. While there are many types of glaciers, they can be divided into two categories: alpine and continental. Alpine glaciers are found in a mountainous region and flow down valleys. Continental glaciers are dome-shaped glaciers that flow away from a central region and are largely unaffected by the land’s topography. The Greenland and Antarctic ice sheets are examples of continental glaciers. Smaller masses of ice, called ice caps, are also considered continental glaciers. Alpine glaciers are further classified by their shape as well as the surface they flow onto. Alpine glaciers flow down valleys, and continental glaciers flow outward in all directions from a central point. Glaciers move by two mechanisms: internal deformation and sliding. Internal deformation occurs when the enormous mass of a glacier causes it to spread out due to gravity."}, {"url": "http://www.nature.org/ourinitiatives/regions/northamerica/unitedstates/indiana/journeywithnature/how-glaciers-shaped-indiana.xml", "passage_text": "Glaciers are massive bodies of ice that slowly move across the landscape. They form by layers of snow compacted over the years to form a very thick layer of ice. Two primary types of glaciers exist: continental and alpine. Continental glaciers are large, dome-shaped sheets of ice and are vastly spread throughout the land. Alpine glaciers are found in mountain regions and in their valleys"}, {"url": "http://geography.about.com/od/geographyintern/a/glaciers.htm", "passage_text": "Glaciers can be characterized in two ways based on their formation: alpine and continental. There are two types of glacial movement: sliders and creepers. Sliders travel along a thin film of water located on the bottom of the glacier. Glaciers are also found in Antarctica, Greenland, Iceland, Canada, Alaska, and even South America (the Andes), California (the Sierra Nevada), and Mount Kilimanjaro in Tanzania."}, {"url": "http://geography.about.com/od/geographyintern/a/glaciers.htm", "passage_text": "Types of Glaciers. Alpine Glacier-Most glaciers that form in a mountain are known as alpine glaciers. There are several subtypes of alpine glaciers: 1  Cirque: a cirque is a bowl shaped hollow at the head of a valley. 2  Within a cirque lies a snowfield, the place where snow accumulates to form a cirque glacier. Glaciers are also found in Antarctica, Greenland, Iceland, Canada, Alaska, and even South America (the Andes), California (the Sierra Nevada), and Mount Kilimanjaro in Tanzania."}, {"url": "https://en.wikipedia.org/wiki/List_of_glaciers_in_the_United_States", "passage_text": "This is a list of glaciers existing in the United States, currently or in recent centuries. These glaciers are located in nine states, all in the Rocky Mountains or further west. The southernmost named glacier among them is the Lilliput Glacier in Tulare County, east of the Central Valley of California. This is an incomplete list that may never be able to satisfy particular standards for completeness."}, {"url": "http://www.onegeology.org/eXtra/kids/earthProcesses/continentalGlaciers.html", "passage_text": "Continental glaciers. Continental glaciers are continuous masses of ice that are much larger than alpine glaciers. Small continental glaciers are called ice fields. Big continental glaciers are called ice sheets. Greenland and Antarctica are almost entirely covered with ice sheets that are up to 3500 m (11 500 ft) thick. Domed and roughly circular ice caps are bigger than ice fields but smaller than ice sheets. "}, {"url": "http://nsidc.org/cryosphere/glaciers/questions/types.html", "passage_text": "These glaciers develop in high mountainous regions, often flowing out of icefields that span several peaks or even a mountain range. The largest mountain glaciers are found in Arctic Canada, Alaska, the Andes in South America, and the Himalaya in Asia. "}, {"url": "http://www.answers.com/Q/Where_are_continental_glaciers_found_today", "passage_text": "Alpine glaciers, even though they move, are confined to mountain valleys, which in most instances had previously been a stream valley. Continental ice sheets exist on a much l … arger scale. These huge masses flow out in all directions from one or more centers of the land. "}, {"url": "http://www.cbhs.k12.nf.ca/glengillard/Glaciation.pdf", "passage_text": "Continental Glaciers Continental Glaciers vs. Alpine glaciers Continental glaciers cover parts of continental land masses like Greenland; Alpine glaciers are found high in mountain valleys, above the snow-line. Like continental glaciers, alpine glaciers create land forms by weathering and deposition. They typically erode the mountain beneath them into a u-shaped valley with steep sides. Some alpine or valley glaciers are 1000m thick and up to 160 km long, though most are only a few km in length."}]