[{"url": "http://www.eschooltoday.com/science/elements-mixtures-compounds/separation-of-mixtures.html", "passage_text": "Filtration. This is a more common method of separating an insoluble solid from a liquid. An example of such a mixture is sand and water. Filtration is used in water treatment plants, where water from rivers are filtered to remove solid particles. CLICK HERE to see how it works. Evaporation Evaporation is great for separating a mixture (solution) of a soluble solid and a solvent. The process involves heating the solution until the solvent evaporates (turns into gas) leaving behind the solid residue. Most of them can be separated, and the kind of separation method depends on the kind of mixture it is. Below are some common separation methods: Paper Chromatography. This method is often used in the food industry. It is used to identify chemicals (coloring agents) in foods or inks."}, {"url": "http://www.glenames.com/uploads/4/0/0/6/4006334/on7sb_058.pdf", "passage_text": "Other kinds do not. You can use this property to separate a mixture of salt and pepper.Equipment and Materials: apron; 2 clear plastic cups; spoon; 1 large spoonful of salt; 1 large spoonful of pepper; warm water; ﬁ lter paper (coffee ﬁ lter)1. Put on your apron. Mix the salt and pepper together in a cup. Examine the mixture"}, {"url": "http://www.mentorials.com/high-school-chemistry-matter-separation-of-mixtures.htm", "passage_text": "Filtration. Filtration is used for separating insoluble solids from a liquid. When a mixture of chalk and water is poured through a filter paper in a funnel, chalk particles remains as residue in the filter paper, while the water gets collected in the beaker below as filtrate. (see Fig. Sublimation is a process in which some solids, on heating, are transformed directly to vapour without passing through the liquid phase, and vice versa. This technique can be used to separate a mixture of solids, one of which can undergo sublimation. The vapours are then cooled separately to get the sublimed solid back."}, {"url": "http://www.ccri.edu/chemistry/courses/chem_1030/Physical_Separation.pdf", "passage_text": "If one component of a mixture sublimates, this property may be used to separate it from the other components of the mixture. Iodine (I2), naphthalene (C10H8, mothballs), ammonium chloride (NH4Cl) and dry ice (solid CO2) are some substances which sublime. CHROMATOGRAPHY is the process of separating a mixture by the distribution of its components between two phases, one phase being stationary and the other phase moving. Some examples of chromatography are gas chromatography, paper chromatography, and thin-layer chromatography. "}, {"url": "http://www.answers.com/Q/Name_two_processes_that_are_used_to_separate_mixtures", "passage_text": "separating an insoluble solid from a liquid: decantation, filtration separating a dissolved solid (solute) from a solution: evaporation, crystallization separating the solute … and solvent from a solution: simple distillation separating a mixture of two miscible liquids: fractional distillation. Chromatography is used to separate pigments. The word comes from the Greek: 'chroma' meaning colour and 'graphein' meaning to write. To analyse a mixture, thin layer chromatog … raphy (TLC) is commonly used (often simple paper chromatography is carried out in schools)"}, {"url": "https://en.wikipedia.org/wiki/Separation_process", "passage_text": "Crude oil occurs naturally as a mixture of various hydrocarbons and impurities. The refining process splits this mixture into other, more valuable mixtures such as natural gas, gasoline and chemical feedstocks, none of which are pure substances, but each of which must be separated from the raw crude. In both of these cases, a series of separations is necessary to obtain the desired end products. The purpose of a separation may be analytical, i.e. to help analyze components in the original mixture without any attempt to save the fractions, or may be preparative, i.e. to prepare fractions or samples of the components that can be saved."}, {"url": "http://www.mentorials.com/high-school-chemistry-matter-separation-of-mixtures.htm", "passage_text": "Sublimation. Sublimation is a process in which some solids, on heating, are transformed directly to vapour without passing through the liquid phase, and vice versa. This technique can be used to separate a mixture of solids, one of which can undergo sublimation. The vapours are then cooled separately to get the sublimed solid back."}, {"url": "http://www.bbc.co.uk/bitesize/ks3/science/chemical_material_behaviour/compounds_mixtures/revision/9/", "passage_text": "Fractional distillation. This is good for separating two or more liquids from each other. For example, ethanol (alcohol) can be separated from a mixture of ethanol and water by fractional distillation. This method works because the two liquids have different boiling points. "}, {"url": "http://www.answers.com/Q/Name_two_processes_that_are_used_to_separate_mixtures", "passage_text": "Some of the types of properties that can be used to separate  mixtures are:    Filtration  Distillation  Chromatography  Magnetism  Floatation  Extraction  Crystal … lization  Mechanical Separation  . 1 person found this useful. Answered. Chromatography is used to separate pigments. The word comes from the Greek: 'chroma' meaning colour and 'graphein' meaning to write. To analyse a mixture, thin layer chromatog … raphy (TLC) is commonly used (often simple paper chromatography is carried out in schools)"}]