[{"url": "http://download.cnet.com/Blue-Light-Therapy/3000-2129_4-75740598.html", "passage_text": "From Singularity Tech: Play with blue light and feel better!Blue Light Therapy App is intended to stimulate your brain with blue light. SupraChiasmatic Nucleus (SCN), a region of your brain receives information about the light that you see through your eyes and makes sleep/wake transition decisions. I do not know if the app will work for you-when I play with it, I FEEL VERY GOOD!HOW TO USE:1)Hold the phone in your hand and touch the screen to create ripples of blue.-OR-2)Start the app and set it to create ripples automatically."}, {"url": "http://www.health.harvard.edu/staying-healthy/blue-light-has-a-dark-side", "passage_text": "Light at night is bad for your health, and exposure to blue light emitted by electronics and energy-efficient lightbulbs may be especially so. Until the advent of artificial lighting, the sun was the major source of lighting, and people spent their evenings in (relative) darkness. What you can do. Use dim red lights for night lights. Red light has the least power to shift circadian rhythm and suppress melatonin. Avoid looking at bright screens beginning two to three hours before bed. If you work a night shift or use a lot of electronic devices at night, consider wearing blue-blocking glasses."}, {"url": "http://www.taimeopt.com/top-blue-light-filter-apps-help-sleep-better/", "passage_text": "Installing these blue light blocking apps will also help you to be able to sleep better at night since blue light also interferes with sleep patterns. Now more and more people pay much attention to the impact of screen brightness in our daily life. They tend to search computer glasses for blue light protection. It helps users avoid eye strain because it adjusts the screen colors to reduce the effects of blue light and thus helps the eyes to be relaxed and so it doesn’t interfere with sleeping habits. To use it all you have to do is download, install and launch this app and it automatically starts working."}, {"url": "http://www.taimeopt.com/top-blue-light-filter-apps-help-sleep-better/", "passage_text": "Blue Light Filter Computer Software. f.lux is a blue light filter app that works with Windows, Mac OS X, Linux and iOS, it allows the computer display to adapt to the time of the day, somewhat like some GPS systems in vehicles do. As the day changes, it is brighter in the daytime and a darker, warmer color at night. It helps users avoid eye strain because it adjusts the screen colors to reduce the effects of blue light and thus helps the eyes to be relaxed and so it doesn’t interfere with sleeping habits. To use it all you have to do is download, install and launch this app and it automatically starts working."}, {"url": "http://android.stackexchange.com/questions/63949/does-the-bluelight-filter-for-eye-care-app-really-work", "passage_text": "Sorry to tell you that no app can really filter the blue light emitted from your digital screen. This kind of app does reduce our eye strain because it helps to change the contrast, adjust the brightness, and add some shades. Want to know whether the eye care app filters blue light effectively, you should use a spectrometer. – geffchang Feb 20 '14 at 14:13. The app purports to reduce the blue light emitted by your device, so the question is really whether that is even possible on Android. Since this answer conflates a bunch of apps that do different things, I doubt it really addresses the issue of blue light."}, {"url": "http://www.webmd.com/skin-problems-and-treatments/acne/news/20100212/can-you-treat-acne-with-an-iphone-app", "passage_text": "When the app is downloaded, users are asked to chose a light option, with the red and blue alternating light recommended. The device gives off wavelengths of 420 nanometers of blue light and 660 nanometers of red, according to the product information. Blue light, according to the app, fights acne-causing bacteria, while red light helps heal skin. Users are warned not to use the app if they are on medication that makes the skin light sensitive or if they have medical conditions that make the skin sensitive to light. "}, {"url": "https://gigaom.com/2014/09/01/what-is-the-blue-light-from-our-screens-really-doing-to-our-eyes/", "passage_text": "For now, there are screens for tablets that purport to filter out the blue light, and as well as apps that let you put your device in a bedtime mode where the light contains less blues and more ambers. Hansler is suspicious of whether those screens and apps work, and wants more research done. “I discovered that using light at night is bad for people’s health and interferes with their sleep. I felt a moral obligation to do something about it, particularly when I learned it’s the blue component in ordinary white light that is suppressing the production of melatonin."}, {"url": "https://itunes.apple.com/us/app/blue-light-therapy/id537446731?mt=8", "passage_text": "Play with blue light and feel better! Blue Light Therapy App is intended to stimulate your brain with blue light. SupraChiasmatic Nucleus (SCN), a region of your brain receives information about the light that you see through your eyes and makes sleep/wake transition decisions. I do not know if the app will work for you-when I play with it, I FEEL VERY GOOD! HOW TO USE: Now you have a little piece of sky everywhere you go! Put this phone wallpaper next to your computer as you work and start the app. The ever-changing pattern of ripples will keep your brain from filtering out the light. Escape depression with an ever changing patterns of blue and white light therapy!"}, {"url": "https://itunes.apple.com/us/app/blue-light-therapy/id537446731?mt=8", "passage_text": "Try this app after you wake up if you have a sleep disorder-blue light therapy has been shown to promote sleep/wake transition. The exact intensity and wavelength of such light is unknown. Now you have a little piece of sky everywhere you go! Put this phone wallpaper next to your computer as you work and start the app. The ever-changing pattern of ripples will keep your brain from filtering out the light. Escape depression with an ever changing patterns of blue and white light therapy!"}]