[{"url": "http://www.alltrails.com/trail/us/north-carolina/cherokee-to-clingmans-dome", "passage_text": "Unlimited access to National Geographic TOPO! & Trails Illustrated Maps. Cherokee to Clingmans Dome is a 51.5 mile out and back trail located near Cherokee, North Carolina that features a river and is good for all skill levels. The trail is primarily used for scenic driving and is accessible from April until November. "}, {"url": "http://www.clingmansdome.com/", "passage_text": "Fall foliage at Clingmans Dome and in Great Smoky Mountains National Park is a must see. Leaves begin to change to rich shades of red, orange, and yellow in mid-October. Views from Clingmans Dome are magnificent and a drive over Newfound Gap Road. Clingmans Dome is a popular Park destination. Located along the state-line ridge, it is half in North Carolina and half in Tennessee. The peak is accessible after driving Clingmans Dome Road from Newfound Gap, and then walking a steep half-mile trail. A paved trail leads to a 54-foot observation tower."}, {"url": "http://www.clingmansdome.com/cd10.html", "passage_text": "Clingmans Dome is accessed from Hwy 441 (between Gatlinburg, TN and Cherokee, NC) and is located in Great Smoky Mountains National Park. The Appalachian Trail trailhead is 0.5 mile from the Clingmans Dome Trail trailhead. Clingmans Dome Trail provides access to the Appalachian Trail and Mountains-To-Sea Trail. The Appalachian Trail is a continuous marked footpath (a distance of about 2,160 miles) that goes from Katahdin in Maine to Springer Mountain in Georgia."}, {"url": "http://www.smokies.ws/clingmans-dome-smoky-mountains/", "passage_text": "Clingmans Dome is the highest peak in the Great Smoky Mountains. At 6,643 feet above sea level, it is the 3rd highest peak east of the Mississippi. An observation tower at the top provides a spectacular 360 degree panoramic view of the park. Clingmans Dome is one of the more popular spots in the Smokies. The Clingmans dome road starts 0.1 mile south of Newfound Gap, which is about 1/2 way between Gatlinburg and Cherokee. It is about 25 miles to Clingmans Dome from Gatlinburg or Cherokee."}, {"url": "http://www.allthingscherokee.com/clingmans-dome/", "passage_text": "by Christina Berry. Clingmans Dome towers at 6,643 feet and stands as the highest point in the Smoky Mountains National Park, the highest point along the Appalachian Trail, the highest point in Tennessee, and the second highest point east of the Mississippi river. It is very close to Cherokee, North Carolina (25 miles) to the east and Gatlinburg, Tennessee (22 miles) to the west. If you’re looking for a comfortable place to stay the night, check out Expedia for nearby lodging: Directions: Clingmans Dome is located in the middle of the Great Smoky Mountains."}, {"url": "http://www.clingmansdome.com/", "passage_text": "It is the highest point in Tennessee, and the second highest point east of the Mississippi. Only North Carolina's Mt. Mitchell (6,684 feet) rises higher. Clingmans Dome is a popular Park destination. Located along the state-line ridge, it is half in North Carolina and half in Tennessee. The peak is accessible after driving Clingmans Dome Road from Newfound Gap, and then walking a steep half-mile trail. A paved trail leads to a 54-foot observation tower."}, {"url": "http://www.stayandplayinthesmokies.com/vendor/clingman-s-dome-great-smoky-mountains-national-park/", "passage_text": "We highly recommend visiting Clingmans Dome when in the Great Smoky Mountains or Cherokee NC area. The dome offers 360 degree views from the highest peak in Great Smoky Mountains National Park at 6,643 feet. "}, {"url": "http://www.smokies.ws/clingmans-dome-smoky-mountains/", "passage_text": "Newfound Gap is about 1/2 way between Gatlinburg and Cherokee. The Clingmans dome road starts 0.1 mile south of Newfound Gap. Follow Clingmans Dome road 7 miles until it dead ends into the Clingmans Dome parking area. It is about 25 miles to Clingmans Dome from Gatlinburg or Cherokee. The Clingmans dome road starts 0.1 mile south of Newfound Gap, which is about 1/2 way between Gatlinburg and Cherokee"}, {"url": "http://www.clingmansdome.com/cd10.html", "passage_text": "This is a view of fall foliage on the North Carolina side of the Smoky Mountains from Clingmans Dome. At 6,643 feet, Clingmans Dome is Great Smoky Mountains National Park's highest point. Clingmans Dome Trail provides access to the Appalachian Trail and Mountains-To-Sea Trail. The Appalachian Trail is a continuous marked footpath (a distance of about 2,160 miles) that goes from Katahdin in Maine to Springer Mountain in Georgia."}, {"url": "http://cnyhiking.com/ATinNC-ClingmansDomeToNewfoundGap.htm", "passage_text": "This 7.5 mile section of the Appalachian Trail takes the trail from Clingmans Dome to Newfound Gap and the only time the AT crosses a road during its 70+ mile journey in Great Smoky Mountain National Park. The trail crosses US 441 at Newfound Gap. Part of this stretch of the AT coincides with the Mountains-To-Sea Trail. "}]