[{"url": "http://www.thebabycorner.com/page/1260/", "passage_text": "Implantation typically occurs 6 to 10 days after ovulation, or day 20 to 24 of a menstrual cycle. However, it can happen a few days earlier or later. In an average 28-day cycle, ovulation occurs on day 14 with the first day of a woman's period being considered day 1 in a cycle."}, {"url": "http://www.babyhopes.com/articles/conception-implantation.html", "passage_text": "Definitely your ex. Takes at least 3-4 days after implantation to get a positive result on a HPT. So to be the new guy it would have had to be at least 10 days before you got a + and you only had 6. Little one wouldn’t have even implanted yet."}, {"url": "http://www.babyhopes.com/articles/conception-implantation.html", "passage_text": "Implantation bleeding does not occur with every woman. Usually only about 30% of women will experience implantation bleeding. You will usually see implantation bleeding 4 to 7 days before your period is due if you are one of the 30%."}, {"url": "http://www.thepregnancyzone.com/ovulation/how-long-after-ovulation-does-implantation-occur/", "passage_text": "It is quite easy to get an answer to your question how long after ovulation does implantation occur if you keep an eye out for the signs. In some cases women can notice some spotting when the implantation takes place. This is known as implantation bleeding."}, {"url": "http://www.thepregnancyzone.com/ovulation/how-long-after-ovulation-does-implantation-occur/", "passage_text": "Here it will get embedded into the lining of the uterus and this is known as implantation. When asking how long after ovulation does implantation occur, you should know that in order for fertilization to take place, you must have sexual intercourse 12-24 hours after you ovulated."}, {"url": "http://www.thepregnancyzone.com/ovulation/how-long-after-ovulation-does-implantation-occur/", "passage_text": "In order to understand how long after ovulation does implantation occur, you should know exactly what ovulation and implantation means. Although ovulation is something normal and it takes place regularly, the same thing can’t be said about implantation."}, {"url": "http://www.babyhopes.com/articles/conception-implantation.html", "passage_text": "Well if you had implantation bleeding, you usually will be able to test in about 4 or 5 days after that. If you have taken a pregnancy test already and it is negative, and then you take another one that is positive, your conception date would be about two weeks ago."}]