[{"url": "https://en.wikipedia.org/wiki/Biofuel", "passage_text": "Biofuels currently make up 3.1% of the total road transport fuel in the UK or 1,440 million litres. By 2020, 10% of the energy used in UK road and rail transport must come from renewable sources – this is the equivalent of replacing 4.3 million tonnes of fossil oil each year. Bioethanol is an alcohol made by fermentation, mostly from carbohydrates produced in sugar or starch crops such as corn, sugarcane, or sweet sorghum. Cellulosic biomass, derived from non-food sources, such as trees and grasses, is also being developed as a feedstock for ethanol production."}, {"url": "http://www.natureworldnews.com/articles/6997/20140512/algenols-algae-based-biofuel-the-next-generation-in-renewable-energy.htm", "passage_text": "Algenol, an up-and-coming company that specializes in algae-based biofuels, has developed and perfected its revolutionary technology, likely securing its spot as the next generation's leader in renewable energy. Share This Story. "}, {"url": "http://environment.nationalgeographic.com/environment/global-warming/biofuel-profile/", "passage_text": "Photograph by Sarah Leen. Biofuels have been around as long as cars have. At the start of the 20th century, Henry Ford planned to fuel his Model Ts with ethanol, and early diesel engines were shown to run on peanut oil. But discoveries of huge petroleum deposits kept gasoline and diesel cheap for decades, and biofuels were largely forgotten. For decades, Brazil has turned sugarcane into ethanol, and some cars there can run on pure ethanol rather than as additive to fossil fuels. And biodiesel—a diesel-like fuel commonly made from palm oil—is generally available in Europe. On the face of it, biofuels look like a great solution."}, {"url": "https://en.wikipedia.org/wiki/Biofuel", "passage_text": "Biodiesel can be used as a fuel for vehicles in its pure form, but it is usually used as a diesel additive to reduce levels of particulates, carbon monoxide, and hydrocarbons from diesel-powered vehicles. Biodiesel is produced from oils or fats using transesterification and is the most common biofuel in Europe. Bioethanol is an alcohol made by fermentation, mostly from carbohydrates produced in sugar or starch crops such as corn, sugarcane, or sweet sorghum. Cellulosic biomass, derived from non-food sources, such as trees and grasses, is also being developed as a feedstock for ethanol production."}, {"url": "http://www.dec.ny.gov/energy/43310.html", "passage_text": "Biofuels are solid, liquid or gas fuels made from recently-harvested biological material (biomass). Most biofuel is derived from plants, either crops grown specifically for fuel use or material left over from plants harvested for other uses. Burning biofuel releases carbon dioxide to the atmosphere, just as burning any other fuel does. However, unlike fossil fuel, biofuel can be renewable and low in carbon intensity -- if it is derived from plants that are grown sustainably (with new growth continuously replacing harvested material)."}, {"url": "https://en.wikipedia.org/wiki/Biofuel", "passage_text": "A biofuel is a fuel that is produced through contemporary biological processes, such as agriculture and anaerobic digestion, rather than a fuel produced by geological processes such as those involved in the formation of fossil fuels, such as coal and petroleum, from prehistoric biological matter. Bioethanol is an alcohol made by fermentation, mostly from carbohydrates produced in sugar or starch crops such as corn, sugarcane, or sweet sorghum. Cellulosic biomass, derived from non-food sources, such as trees and grasses, is also being developed as a feedstock for ethanol production."}, {"url": "http://www.dec.ny.gov/energy/43310.html", "passage_text": "1 Biofuels can be low in carbon intensity (the net amount of carbon released to the atmosphere) - as long as uptake by other growing plants balances the carbon that is released in biofuel production and use. 2  Locally-grown biofuel can enhance energy security by increasing independence from petroleum. Burning biofuel releases carbon dioxide to the atmosphere, just as burning any other fuel does. However, unlike fossil fuel, biofuel can be renewable and low in carbon intensity -- if it is derived from plants that are grown sustainably (with new growth continuously replacing harvested material)."}, {"url": "http://www.darvill.clara.net/altenerg/biofuels.htm", "passage_text": "Introduction. By biofuels on this page, I mean fuels for vehicles, such as biodiesel and bioethanol - although you can also use the term biofuel to cover any kind of fuel made from living materials or their waste. Biogas is another biofuel which can be used to power vehicles, and is covered on another page. How it works"}]