[{"url": "http://www.thefreedictionary.com/ethnic+cleansing", "passage_text": "Noun. 1. ethnic cleansing-the mass expulsion and killing of one ethnic or religious group in an area by another ethnic or religious group in that area. group action-action taken by a group of people. Translations. 1. (Government, Politics & Diplomacy) the violent removal by one ethnic group of other ethnic groups from the population of a particular area: used esp of the activities of Serbs against Croats and Muslims in the former Yugoslavia."}, {"url": "https://en.wikipedia.org/wiki/Ethnic_cleansing", "passage_text": "Ethnic cleansing vs. genocide [edit]. The crimes committed during an ethnic cleansing are similar to those of genocides, but while genocide includes an intent at complete or partial destruction of the target group, ethnic cleansing may involve murder only to the point of mobilizing the target group out of the territory. At one end it is virtually indistinguishable from forced emigration and population exchange while at the other it merges with deportation and genocide. At the most general level, however, ethnic cleansing can be understood as the expulsion of a population from a given"}, {"url": "http://www.merriam-webster.com/dictionary/ethnic%20cleansing", "passage_text": "ethnic cleansing. noun. Tweet. : the practice of removing or killing people who belong to an ethnic group that is different from the ruling group in a country or region."}, {"url": "http://flamingpolarbears.weebly.com/what-is-ethnic-cleansing.html", "passage_text": "1 Ethnic cleansing is a process in which a more powerful ethnic group forcible removes less powerful one in create a ethnically homogeneous region. 2  To avoid clashes between armies, ethnic cleansing involves the removal of every member of the less powerful ethnicity. 1 After World War II, millions of ethnic Germans, Poles, Russians, and other groups were forced to migrate because of boundary changes. 2  In the 1990's, a new term called ethnic cleansing was invented to describe new practices by ethnic groups against other ethnic groups."}, {"url": "http://www.thefreedictionary.com/ethnic+cleansing", "passage_text": "1. ethnic cleansing-the mass expulsion and killing of one ethnic or religious group in an area by another ethnic or religious group in that area. group action-action taken by a group of people. 1. (Government, Politics & Diplomacy) the violent removal by one ethnic group of other ethnic groups from the population of a particular area: used esp of the activities of Serbs against Croats and Muslims in the former Yugoslavia."}, {"url": "http://rainbowllamas.weebly.com/what-is-ethnic-cleansing.html", "passage_text": "Ethnic Cleansing. The term Ethnic Cleansing was created in the 1990's to describe the new interactions between some ethnic groups. The purpose of Ethnic Cleansing is to rid an area of an entire ethnic group so the remaining ethnicity can be the only inhabitants of the area. Ethnic cleansing is not to defeat an enemy or subjugate them as is the case in traditional wars. "}, {"url": "https://simple.wikipedia.org/wiki/Ethnic_cleansing", "passage_text": "The origin of the word genocide. Genocide is the crime of killing many people who are all part of one ethnic or religious group, or some sort of similar group, and trying to destroy that group. Genocide is done usually by a group, such as a government, or military group, not by one person or a small number of people. "}, {"url": "http://www.history.com/topics/ethnic-cleansing", "passage_text": "Introduction. “Ethnic cleansing” has been defined as the attempt to get rid of (through deportation, displacement or even mass killing) members of an unwanted ethnic group in order to establish an ethnically homogenous geographic area. Definition of Ethnic Cleansing. The phrase “ethnic cleansing” came into wide usage in the 1990s, to describe the treatment suffered by particular ethnic groups during conflicts that erupted after the disintegration of the former Yugoslavia."}, {"url": "http://www.thefreedictionary.com/ethnic+cleansing", "passage_text": "ethnic cleansing-the mass expulsion and killing of one ethnic or religious group in an area by another ethnic or religious group in that area. 1. (Government, Politics & Diplomacy) the violent removal by one ethnic group of other ethnic groups from the population of a particular area: used esp of the activities of Serbs against Croats and Muslims in the former Yugoslavia."}, {"url": "https://en.wikipedia.org/wiki/Ethnic_cleansing", "passage_text": "Ethnic cleansing is the systematic forced removal of ethnic or religious groups from a given territory by a more powerful ethnic group, with the intent of making it ethnically homogeneous. At one end it is virtually indistinguishable from forced emigration and population exchange while at the other it merges with deportation and genocide. At the most general level, however, ethnic cleansing can be understood as the expulsion of a population from a given territory."}]