[{"url": "http://www.indeed.com/salary/q-Practice-Last-Frontier-l-Alaska.html", "passage_text": "Average Practice Last Frontier salaries for job postings in Alaska are 26% lower than average Practice Last Frontier salaries for job postings nationwide. "}, {"url": "http://www.celebritynetworth.com/richest-celebrities/singers/atz-kilcher-net-worth/", "passage_text": "Throughout the 50s and 60s, the Kilcher family toured Alaska and Europe to perform songs and live shows. Atz is currently one of the stars of the Discovery Channel show, Alaska: The Last Frontier, which chronicles the Kilcher family and their homestead in Southern Alaska. Mr. Kilcher is in charge of protecting his family's herd of cattle from local predators such as coyotes, wolves, and bears. $5 Million. Atz Kilcher net worth: Atz Kilcher is an American musician, artist and reality TV star who has a net worth of $5 million dollars. Born and raised in Homer, Alaska, Atz Kilcher grew up in a musical family with seven siblings who were all home-schooled for many years because their childhood home was so remote."}, {"url": "http://www.celebritynetworth.com/richest-businessmen/business-executives/otto-kilcher-net-worth/", "passage_text": "Otto Kilcher net worth: $4 Million. Otto Kilcher net worth: Otto Kilcher is an American mechanic and reality television personality who has a net worth of $4 million dollars. Born in Alaska, Otto Kilcher grew up raising cattle on his family's farm. Always interested in mechanics, he began collecting broken machinery and repairing it. He has since become a master mechanic and machinist. He is the sixth of eight children born to Yule and Ruth Kilcher. The Kilcher family is the subject of the Discovery Channel reality series, Alaska: The Last Frontier, which follows the residents of Homer, Alaska as they live off of the land."}, {"url": "http://wojdylosocialmedia.com/eivin-eve-kilcher-alaska-last-frontier-discovery-tv-show/", "passage_text": "By Jesse Wojdylo-Published: 02/26/2015 - Section: TV. For the first time, I sat down and watched Alaska: The Last Frontier on Thursday, February 26th, 2015. I went to Alaska in 2013 and ran into some people who at that time a lot of Gold Rush was set up, they gave on group the gold for end of the season.i don’t really believe that is what is going on ,on GR now with the young kid getting over 2M in gold."}, {"url": "http://www.therichest.com/celebnetworth/celeb/tv-personality/otto-kilcher-net-worth/", "passage_text": "The Kilcher family became the subject of the reality series Alaska: The Last Frontier on the Discovery Channel. The show follows the residents of Homer, Alaska as they live off the land. Otto is the uncle of country singer, Jewel Kilcher or popularly known as Jewel. He ranches and operates a boat transportation service while he sits on the Kenai Peninsula Cooperative Weed Management Area Council. He is also an active member of the Kenai Peninsula Farm Bureau. Mr. Kilcher has earned his estimated net worth of $4 million as a master mechanic and machinist."}, {"url": "http://fillygirl.com/alaska-the-last-frontier-is-atz-just-ottos-ranch-hand/", "passage_text": "Discovery Channel’s widely successful reality show “Alaska: The Last Frontier” (2.7 million viewers per episode) features three generations of the Kilcher family who live off the land that Yule Kilcher homesteaded over 80 years ago. "}, {"url": "http://www.discovery.com/tv-shows/alaska-the-last-frontier/", "passage_text": "Eivin and Eve's View of the Bay Check out this live view of Eivin and Eve Kilcher's Alaskan homestead as seen on Alaska: The Last Frontier. Check out this live view of Eivin and Eve Kilcher's Alaskan homestead as seen on Alaska: The Last Frontier. Spring Has Sprung Gallery Photos from the Spring Has Sprung episode of Discovery's Alaska:The Last Frontier airing Sundays at 9/8c."}, {"url": "http://www.therichest.com/celebnetworth/celeb/tv-personality/otto-kilcher-net-worth/", "passage_text": "About Otto Kilcher. American mechanic and reality television personality Otto Kilcher has an estimated net worth of $4 million. He was born in Alaska and is the sixth of the eight children of Yule and Ruth Kilcher. He grew up in a family homestead on East End Road in Homer, Alaska where he raised cattle and running the farm. He ranches and operates a boat transportation service while he sits on the Kenai Peninsula Cooperative Weed Management Area Council. He is also an active member of the Kenai Peninsula Farm Bureau. Mr. Kilcher has earned his estimated net worth of $4 million as a master mechanic and machinist."}]