[{"url": "https://en.wikipedia.org/wiki/Multinational_corporation", "passage_text": "A multinational corporation (MNC) or multinational enterprise is an organization that owns or controls production of goods or services in one or more countries other than their home country. A multinational corporation is usually a large corporation which produces or sells goods or services in various countries. 1  Importing and exporting goods and services. 2  Making significant investments in a foreign country."}, {"url": "http://www.wisegeek.org/what-is-a-multinational-corporation.htm", "passage_text": "Adorable animal families that will make you aww. Multinational corporations (MNCs) are business entities that operate in more than one country. A typically one normally functions with a headquarters that is based in one country, while other facilities are based in locations in other countries. In some circles, this type of corporation is referred to as a multinational enterprise (MBE) or a transnational corporation (TNC). Another structural model for a multinational organization or MNO is to base the parent company in one nation and operate subsidiaries in other countries around the world. With this model, just about all the functions of the parent are based in the country of origin."}, {"url": "http://www.investopedia.com/terms/m/multinationalcorporation.asp", "passage_text": "Nearly all major multinationals are either American, Japanese or Western European, such as Nike, Coca-Cola, Wal-Mart, AOL, Toshiba, Honda and BMW. Advocates of multinationals say they create jobs and wealth and improve technology in countries that are in need of such development. Such companies have offices and/or factories in different countries and usually have a centralized head office where they co-ordinate global management. Very large multinationals have budgets that exceed those of many small countries. Sometimes referred to as a transnational corporation."}, {"url": "http://smallbusiness.chron.com/company-multinational-corporation-60186.html", "passage_text": "Multinational corporations are typically large companies headquartered in one country but with operations in several countries. The defining trait of a multinational corporation is being incorporated -- usually in its home country -- and doing business in several countries. While a business can technically be considered a multinational corporation if it has offices in two countries, most multinational corporations have relatively large operations. They might, for example, have business headquarters in each country or operate large warehouses, factories or office"}, {"url": "http://www.referenceforbusiness.com/management/Mar-No/Multinational-Corporations.html", "passage_text": "As the name implies, a multinational corporation is a business concern with operations in more than one country. These operations outside the company's home country may be linked to the parent by merger, operated as subsidiaries, or have considerable autonomy. "}, {"url": "http://www.bbc.co.uk/bitesize/higher/business_management/business_enterprise/business_contemporary_society/revision/13/", "passage_text": "Multinational organisations. A multinational organisation is a company which has its headquarters in one country but has assembly or production facilities in other countries. Coca Cola, Nike and BP are examples of multinationals. "}, {"url": "http://www.investopedia.com/terms/m/multinationalcorporation.asp", "passage_text": "DEFINITION of 'Multinational Corporation-MNC'. A corporation that has its facilities and other assets in at least one country other than its home country. Such companies have offices and/or factories in different countries and usually have a centralized head office where they co-ordinate global management. Very large multinationals have budgets that exceed those of many small countries. Sometimes referred to as a transnational corporation."}, {"url": "http://www.youtube.com/watch?v=OGg9K1wymWk", "passage_text": "Publisert 2. feb. 2015. Our word of the day is “Multinational Corporation”. A multinational corporation is a business that has its facilities and other assets in at least one country other than its home country. Such companies have offices and/or factories in different countries and usually have a centralized head office where they co-ordinate global management. Generally, any company or group that derives a quarter of its revenue from operations outside of its home country is considered a multinational corporation."}]