[{"url": "http://www.mayoclinic.org/diseases-conditions/prostate-cancer/in-depth/prostate-cancer/ART-20048087", "passage_text": "But getting a PSA test for prostate cancer may not be necessary for some men, especially men 75 and older. Professional organizations vary in their recommendations about who should — and who shouldn't — get a PSA screening test."}, {"url": "https://www.mskcc.org/cancer-care/types/prostate/screening/screening-guidelines-prostate", "passage_text": "Men aged 71 – 75 should talk with their doctor about whether to have a PSA test. The decision whether to have a PSA test should be based on past PSA levels and health of the man. Men 76 and older. Prostate cancer screening is not recommended for men aged 76 or older."}, {"url": "http://www.menshealth.com/health/psa-test-guidelines", "passage_text": "For decades, men have dutifully shown up at their doctor’s office sometime around their 50th birthday for a baseline PSA (prostate-specific antigen test). As PSA levels rise, the theory went, so do your odds of having prostate cancer."}, {"url": "http://www.nhs.uk/Livewell/Prostatehealth/Pages/psa-test.aspx", "passage_text": "Men with a higher risk of prostate cancer, such as black men or men with a family history of the condition, may be encouraged to think about having a PSA test by their GP. If you are worried about prostate cancer, you should talk to your GP."}, {"url": "http://www.webmd.com/prostate-cancer/news/20130408/most-men-dont-need-psa-tests-doctors-group-says", "passage_text": "MONDAY, April 8 (HealthDay News) -- Men have long been encouraged to get prostate cancer screenings, but there's insufficient evidence that the benefits of a PSA test outweigh the substantial risks associated with the screening."}, {"url": "https://www.mskcc.org/cancer-care/types/prostate/screening/screening-guidelines-prostate", "passage_text": "Men aged 45 – 49 should have a baseline PSA test. 1  If the PSA level is 3 ng / mL or higher, men should talk with their doctor about having a biopsy of the prostate. 2  If the PSA level is between 1 and 3 ng / mL, men should see their doctor for another PSA test every 2 - 4 years."}, {"url": "https://www.mskcc.org/cancer-care/types/prostate/screening/screening-guidelines-prostate", "passage_text": "Men aged 50 – 59 should have their PSA level checked. 1  If the PSA level is 3 ng / mL or higher, men should talk with their doctor about having a biopsy of the prostate. 2  If the PSA level is between 1 and 3 ng / mL, men should see their doctor for another PSA test every 2 - 4 years."}, {"url": "http://www.mayoclinic.org/diseases-conditions/prostate-cancer/in-depth/prostate-cancer/ART-20048087", "passage_text": "Cons of PSA screening. PSA screening may help you detect prostate cancer early. Some prostate cancers are slow growing and never spread beyond the prostate gland. Cancer is easier to treat and is more likely to be cured if it's diagnosed in the early stages of the disease."}, {"url": "http://www.mayoclinic.org/diseases-conditions/prostate-cancer/in-depth/prostate-cancer/ART-20048087?pg=2", "passage_text": "According to the ACS, men should explore the risks and benefits of the PSA test starting at age 50 if they are at average risk of prostate cancer, at age 45 if they are at high risk and at age 40 if they are at very high risk (those with several first-degree relatives who had prostate cancer at an early age)."}, {"url": "http://www.cancerresearchuk.org/about-cancer/type/prostate-cancer/about/screening-for-prostate-cancer", "passage_text": "If you want a PSA test. Although there is no prostate screening programme, men aged over 50 can ask their GP for a PSA test. This is part of the UK Prostate Cancer Risk Management programme. If you ask to have the test your GP first explains all the possible benefits and risks."}]