[{"url": "http://www.allpsychologyschools.com/counseling/how-to-become-a-counselor/", "passage_text": "Most states require licensure or certification. The National Board for Certified Counselors (NBCC) grants a general practice credential, National Certified Counselor (NCC), to counselors who have passed their examination, have completed a graduate degree and have two years of fieldwork. With a master’s degree in rehabilitation counseling, you might become one of the many who incorporate different therapies into treatment programs."}, {"url": "http://study.com/articles/School_Guidance_Counselor_How_to_Become_a_School_Guidance_Counselor.html", "passage_text": "Step 3: Become Licensed. All states require a state license to work as a school counselor in a public school. To become licensed, most states require a background check and experience, either through an internship or practicum completed during the master's degree program. Step 1: Earn a Bachelor's Degree. Most states require school counselors to have a master's degree. Prospective school guidance counselors can generally choose any undergraduate program, depending on their state's requirements and their desired graduate school's prerequisites."}, {"url": "http://www.alleydog.com/marriage-counselor.php", "passage_text": "How To Become A Marriage Counselor. The first step in becoming a marriage counselor is to complete your education. Most marriage counselors will have at a master's degree, doctoral degree or have completed a post-graduate clinical training program. In the United States, the profession of marriage counselor is regulated and licensing exams are required. "}, {"url": "http://study.com/articles/School_Guidance_Counselor_How_to_Become_a_School_Guidance_Counselor.html", "passage_text": "In many states, a master's degree is required to work as a school counselor. Common master's programs include school counseling or educational psychology with a specialization in school counseling. Students may be required to complete coursework addressing the needs of special education students. Step 1: Earn a Bachelor's Degree. Most states require school counselors to have a master's degree. Prospective school guidance counselors can generally choose any undergraduate program, depending on their state's requirements and their desired graduate school's prerequisites."}, {"url": "http://www.ehow.com/info_7873631_degree-become-school-guidance-counselor.html", "passage_text": "To become a school guidance counselor, you must obtain a bachelor's degree in a related field such as psychology, education or counseling. In many states, certification as a guidance counselor is required once degree requirements are completed. Education Degree. Since a school guidance counselor works in the educational system, an education degree is a preferable degree option. When you get a bachelor's degree in education, you can specialize in counseling so you are better equipped to address the emotional needs of students requiring guidance."}, {"url": "http://www.innerbody.com/careers-in-health/how-to-become-school-counselor.html", "passage_text": "Requirements. Education. The first step in the education of a school counselor is to obtain a bachelor's degree-usually in counseling, psychology, education or social work, though a degree in a related field can be acceptable. "}, {"url": "http://www.wikihow.com/Become-a-Counselor", "passage_text": "3. Complete your master's degree. If you want to become a licensed career counselor in some states, you must complete a master's degree. Career counselors usually pursue a master's degree in Counseling, with a concentration in vocational or adult counseling. "}, {"url": "http://www.learnhowtobecome.org/counselor/", "passage_text": "With few exceptions, a master’s degree is required to be a school counselor. Although a master’s degree in a related field — psychology, sociology, education — can be considered adequate preparation for a career in counseling, it’s more common and preferable to complete a degree specific to school counseling. "}, {"url": "http://www.goodtherapy.org/become-a-therapist/education-requirements.html", "passage_text": "Master's Degree. Your master's degree is where you will get the specialized training you need to become a licensed therapist. You will likely take classes in interpersonal, group, family, and child psychology, as well as classes on ethics in therapy, psychological theories, research methods, and clinical best practices. Before you begin formal training in graduate school to become a therapist, you will have to finish a bachelor's degree at a college or university. A major in a field such as psychology or social work can give you the strong background you will need to excel in graduate school."}]