[{"url": "http://www.hongkiat.com/blog/70-creative-advertisements-that-makes-you-look-twice/", "passage_text": "It’s quite true about the saying – There’s no second chance at making a good first impression. Advertisement, regardless online or offline, if they don’t catch your attention within seconds they are considered failed. Agencies and big corporations do not believe in ‘cool factors’ in advertisement anymore. Instead, to really stand out of the crowd, the idea has to be really out of the box, something that makes you laugh, talks about it or at least make you look twice. Here’s 70 really creative advertisement that will"}, {"url": "https://support.google.com/adwords/answer/1704392?hl=en", "passage_text": "Match your ad to your landing page. Have a look at the page that you're linking to from your ad (the landing page), and make sure that the promotions or products in your ad are included there. People might leave your website if they don’t find what they expect. Also, consider creating ads devoted to people on mobile devices, using the mobile version of your website as a landing page, and offering specials suited to a mobile audience. Keep in mind, your text ads can appear differently on mobile."}, {"url": "http://www.wikihow.com/Create-an-Advertisement", "passage_text": "1 For instance, you might be selling tickets to a benefit gala that is designed to feel elegant and luxurious, even if the ticket price is well below what most wealthy people would be able to pay. 2  If you are selling an aspirational product, try to make your advertisement exude an air of indulgence. The simpler the better, in fact. An ad sums up everything that is smart, innovative, and distinguished about your brand, and is almost indispensable in today's economic marketplace. To write, design, and test an ad, follow these steps."}, {"url": "http://www.inc.com/doug-cantor/5-tips-for-making-an-effective-video-ad.html", "passage_text": "5. Just as a good movie requires a strong cast and a solid script, the effectiveness of a video ad ultimately rests on the quality of the product. The biggest mistake to make when embarking on a video is to assume that a video can answer questions that the product can't on its own, Lisagor says. If you're not funny, don't make a jokey video. Many videos go viral due to a smart, well-timed joke, so it's tempting to come up with a funny concept for your ad or at least try to inject some humor into it."}, {"url": "http://www.convinceandconvert.com/social-media-tools/3-common-facebook-ad-mistakes-everyone-is-making/", "passage_text": "On Facebook, the smaller and more relevant the audience for an ad, the better it performs. For instance, take a look at this ad from Aspen Heights, what I believe is a real estate company: They already have a relevance issue with “Aspen” in the name. This ad was targeted toward me, but I live in NYC. Aspen makes me think of Colorado and skiing. When we think through this process, it makes complete sense. The more relevant an ad is to you specifically, the more likely you are to notice and act on it. And we know most Facebook fans are existing customers or potential customers of a business."}, {"url": "http://www.wikihow.com/Make-Your-Own-Advertising-Posters", "passage_text": "Decide what demographic you're advertising to. Understanding your market is crucial for any form of advertising. For you, understanding your market will determine where you place your posters, as well as how you word your advertisement. Decide what information you'll put on the poster. This depends on what in particular you're advertising. If you're advertising for your store or business, you'll want to include your location, hours, and contact information."}, {"url": "http://www.wikihow.com/Create-an-Advertisement", "passage_text": "6. Try to make sure your advertisement will age well. You don't want people looking back at your ad in 10 years and being shocked at its content. For good examples of how common social tropes can look terrible in older ads, search for cigarette or diet pill ads from the 1950s and '60s. The simpler the better, in fact. An ad sums up everything that is smart, innovative, and distinguished about your brand, and is almost indispensable in today's economic marketplace. To write, design, and test an ad, follow these steps."}, {"url": "http://www.inc.com/doug-cantor/5-tips-for-making-an-effective-video-ad.html", "passage_text": "Advertisement. For a startup, producing a video advertisement is one of the boldest ways to announce your presence to a wide audience. In no more than a couple of minutes, a cleverly executed spot can explain what your business does and galvanize viewers in a way static ads can't. If you're not funny, don't make a jokey video. Many videos go viral due to a smart, well-timed joke, so it's tempting to come up with a funny concept for your ad or at least try to inject some humor into it."}, {"url": "http://www.verticalresponse.com/blog/how-to-create-effective-small-business-advertising/", "passage_text": "Using these elements can make an effective ad, but here are a few additional guidelines to follow: 1  Hierarchy of information – Choose the information from the above list that’s most important and make it your main element of the ad. 2  Every piece of information in your ad should be weighted according to its importance. But first, here’s what you should include in every advertisement: 1  Your logo or business name – If your business’s logo/name doesn’t contain what you do, make sure to clarify that in the ad. 2  For example saying “Klimisch’s Inc Collision Repair” instead of just “Klimisch’s Inc.”"}]