[{"url": "http://omninoggin.com/microbiology/viruses-viroids-and-prions/", "passage_text": "Viruses can be found either inside a cell (intracellular) or outside of a cell (extracellular). If it is found extracellular, the virus is called a virion. A virion contains a protein coating called a capsid, which surrounds the core of the virus containing the nucleic acid (either DNA or RNA). Together with the capsid and the DNA or RNA core is called a nucleocapsid. Some virions also contain an envelope which is made up of a phospholipid membrane. They are not within any kingdom and carry their own significant characteristics. 1  obligate intracellular parasite – require a host to cause damage. 2  filterable – small enough to be filtrated. 3  contains an outer protein coat and inner genome. 4  has only 1 kind of nucleic acid (RNA or DNA, but never both)."}, {"url": "https://en.wikipedia.org/wiki/Retrovirus", "passage_text": "Retroviridae is a family of enveloped viruses that replicate in a host cell through the process of reverse transcription. A retrovirus is a single-stranded positive-sense RNA virus with a DNA intermediate and, as an obligate parasite, targets a host cell. "}, {"url": "http://web.clark.edu/rrausch/biolabs/260/Ch11Notes.pdf", "passage_text": "General Characteristics of Viruses. a. Are inert when not within a host cell. b. Require a living host cell to multiply. i. They are therefore considered to be obligate intracellular parasites. c. Viruses contain DNA or RNA, but not both. The range of host cells the virus can infect. ii. The host range of a virus is determined by specific host attachment sites and cellular factors necessary for viral multiplication. 1. Attachment sites include things such as cell walls, fimbriae, flagella, and plasma membrane proteins. iii."}, {"url": "https://quizlet.com/4831522/virus-biology-1-flash-cards/", "passage_text": "Viral capsids self-assemble from many copies of the same viral protein or a small group of viral proteins. The simplest icosahedral nucleocapsid (polio virus) is composed of 5 viral protein groups protomers arranged in a pentamer. 12 of these pentamers fit together to make the icosahedral capsid. The same basic principles are used by other viruses to produce more complicated and larger nucleocapsids. Two major types of virion surfaces: Nucleocapsid structures are either icosahedral (20-sided) or helical, both are very stable structures For some virions, nucleocapsid is the virion."}, {"url": "https://quizlet.com/4831522/virus-biology-1-flash-cards/", "passage_text": "2. Describe the 3 characteristics that are used to classify viruses into related families, in addition to sequence (These are not related to the target organ). Virion morphology (shape, +/- membrane, physical characteristics Type of genome (and proteins) Means of replication. Two major types of virion surfaces: Nucleocapsid structures are either icosahedral (20-sided) or helical, both are very stable structures For some virions, nucleocapsid is the virion."}, {"url": "https://quizlet.com/4831522/virus-biology-1-flash-cards/", "passage_text": "1) Viruses are smaller: can pass through filter 2) Viruses are not toxins-dilution does not diminish pathogenesis 3) Viruses are obligate intracellular parasites a. Need cells machinery to make energy, proteins, etc. Two major types of virion surfaces: Nucleocapsid structures are either icosahedral (20-sided) or helical, both are very stable structures For some virions, nucleocapsid is the virion."}, {"url": "http://www.nlv.ch/Virologytutorials/Classification.htm", "passage_text": "Classification of Viruses. Viruses are not usually classified into conventional taxonomic groups but are usually grouped according to such properties as size, the type of nucleic acid they contain, the structure of the capsid and the number of protein subunits in it, host species, and immunological characteristics. "}, {"url": "http://www.niaid.nih.gov/topics/HIVAIDS/Understanding/howHIVCausesAIDS/pages/howhiv.aspx", "passage_text": "Embedded in the viral envelope are proteins from the host cell, as well as 72 copies (on average) of a complex HIV protein (frequently called spikes) that protrudes through the surface of the virus particle (virion). The core of HIV also includes a protein called p7, the HIV nucleocapsid protein. Three enzymes carry out later steps in the virus's life cycle: reverse transcriptase, integrase, and protease. Another HIV protein called p17, or the HIV matrix protein, lies between the viral core and the viral envelope."}, {"url": "http://classes.midlandstech.edu/carterp/Courses/bio225/chap13/ss1.htm", "passage_text": "Introduction 1. Define virus. 2. List the characteristics of viruses. 3. Describe the: · Composition of a virus · Location of viral multiplication · Host range viruses. 4. Explain what determines viral host range. 5. List the three kinds of viruses according to type of hosts. Viral Structure 6. Define: · Virion · Capsid · Capsomere · Protomere. 7. "}, {"url": "http://www.niaid.nih.gov/topics/HIVAIDS/Understanding/howHIVCausesAIDS/pages/howhiv.aspx", "passage_text": "HIV belongs to a class of viruses called retroviruses. Retroviruses are RNA (ribonucleic acid) viruses, and to replicate (duplicate). they must make a DNA (deoxyribonucleic acid) copy of their RNA. It is the DNA genes that allow the virus to replicate. The core of HIV also includes a protein called p7, the HIV nucleocapsid protein. Three enzymes carry out later steps in the virus's life cycle: reverse transcriptase, integrase, and protease. Another HIV protein called p17, or the HIV matrix protein, lies between the viral core and the viral envelope."}]