[{"url": "http://www.mayoclinic.org/diseases-conditions/high-blood-pressure/in-depth/beta-blockers/art-20044522", "passage_text": "Beta blockers, also known as beta-adrenergic blocking agents, are medications that reduce your blood pressure. Beta blockers work by blocking the effects of the hormone epinephrine, also known as adrenaline. When you take beta blockers, the heart beats more slowly and with less force, thereby reducing blood pressure."}, {"url": "http://familydoctor.org/familydoctor/en/drugs-procedures-devices/prescription-medicines/beta-blockers-for-heart-problems.html", "passage_text": "A beta-blocker is a medicine that is often used to treat high blood pressure and heart problems. Some examples of beta-blockers are atenolol, metoprolol and propranolol. This kind of medicine blocks the harmful effects of stress hormones on your heart. It also slows your heart rate. "}, {"url": "http://www.webmd.com/hypertension-high-blood-pressure/guide/hypertension-treatment-beta-blockers", "passage_text": "Font Size. A. A. A. Beta-blockers are drugs used to treat high blood pressure. They block the effects of the sympathetic nervous system on the heart. This reduces the work of the heart so that it requires less blood and oxygen. As a result, the heart doesn't have to work as hard, which in turn lowers blood pressure. "}, {"url": "http://www.healthline.com/health/heart-disease/beta-blockers", "passage_text": "Beta blockers block the effects of stress hormones like adrenaline on the heart. Learn about side effects, benefits, and how they work. Beta blockers are often prescribed for heart arrhythmias (irregular heartbeat), high blood pressure, and after heart attacks. They’re a class of medication used to block the effects of stress hormones like adrenaline (also called epinephrine) on the heart. "}, {"url": "http://www.nhs.uk/conditions/Beta-blockers/Pages/Introduction.aspx", "passage_text": "Introduction. Beta-blockers, also known as beta-adrenoceptor blocking agents, are medications used to treat conditions such as angina, heart failure and high blood pressure. They decrease the activity of the heart by blocking the action of hormones like adrenaline"}, {"url": "http://www.ehow.com/how-does_5499457_do-beta-blockers-do.html", "passage_text": "Uses. Beta blockers are widely known as beta-adrenergic blocking agents, these block adrenaline from binding to the beta receptors on the nerves. Beta blockers are used primarily in the treatment of cardiac arrhythmia and high blood pressure. Beta Receptors. To best explain what a beta blocker does, you need to understand a little bit about the nervous system and what beta receptors are. A beta receptor is a protein molecule that processes specific messages carried by the central nervous system and various hormones. There are a variety of different types of beta receptors"}, {"url": "http://www.rxlist.com/beta_blockers/drugs-condition.htm", "passage_text": "Beta blockers, also known as beta-adrenergic blocking agents, are a class of drugs that works by blocking the neurotransmitters norepinephrine and epinephrine from binding to receptors. There are three known types of beta receptors, known as beta 1 (β 1), beta 2 (β 2) and beta 3 (β 3). "}]