[{"url": "http://www.advancedvalve.com/elastomer-seated-valves.php", "passage_text": "Elastomer Seated Valves. 1  Elastomers include Teflon*, Viton*, Neoprene, Buna, EPT, and other commercially available elastomers. 2  Designs for low pressure gas and liquid handling systems means lower operating torques which reduces the cost of actuation packages. 1 Elastomers include Teflon*, Viton*, Neoprene, Buna, EPT, and other commercially available elastomers. 2  Designs for low pressure gas and liquid handling systems means lower operating torques which reduces the cost of actuation packages."}, {"url": "http://www.2b1stconsulting.com/ept/", "passage_text": "Comment. The primary synthetic rubbers include nitrile, isoprene, styrene-butadiene, butyl, chloroprene, polysulfide, silicone, urethane and ethylene propylene diene terpolymer (ETP) or Ethylene Propylene Diene Monomer (EPDM). The synthetics rubbers are called indistinctly ETP or EPDM. EPT is a synthetic rubber known for its superior ability to cope with various climatic conditions, and its resistance to ozone, heat and coldness. It also performs well as an electric insulator and is known for its chemical resistance"}, {"url": "http://www.sealsales.com/gasketmaterial/EPR60Durometer.shtml", "passage_text": "EPDM Gasket Material. A unique characteristic of EPDM is it's resistance to Ozone. It's why the auto industry has been sealing your windows with EPDM seals for years. Generally lasting 20 years in sunlight. EPDM also has good chemical resistance, and electrical properties. Good up to 212 F, animal fats, water, even low temp steam."}, {"url": "https://en.wikipedia.org/wiki/EPDM_rubber", "passage_text": "Typical properties of EPDM vulcanizates are given below. EPDM can be compounded to meet specific properties to a limit, depending first on the EPDM polymers available, then the processing and curing method(s) employed. The higher the ethylene content, the higher the loading possibilities of the polymer, better mixing, and extrusion. Peroxide curing these polymers gives a higher crosslink density compared with their amorphous counterpart. The amorphous polymer is also excellent in processing."}, {"url": "https://en.wikipedia.org/wiki/EPDM_rubber", "passage_text": "EPDM rubber (ethylene propylene diene monomer (M-class) rubber), a type of synthetic rubber, is an elastomer characterized by a wide range of applications. The M refers to its classification in ASTM standard D-1418; the M class includes rubbers having a saturated chain of the polymethylene type. The higher the ethylene content, the higher the loading possibilities of the polymer, better mixing, and extrusion. Peroxide curing these polymers gives a higher crosslink density compared with their amorphous counterpart. The amorphous polymer is also excellent in processing."}, {"url": "https://en.wikipedia.org/wiki/EPDM_rubber", "passage_text": "The ethylene content is around 45% to 85%. The higher the ethylene content, the higher the loading possibilities of the polymer, better mixing, and extrusion. Peroxide curing these polymers gives a higher crosslink density compared with their amorphous counterpart. The amorphous polymer is also excellent in processing."}, {"url": "http://www.viprubber.com/page/technical_epdm", "passage_text": "EPDM rubber is closely related to ethylene propylene rubber, but EPDM rubber has a diene-component. EPDM rubber is similar to EPT rubber (ethylene-propylene terpolymer) and EPR (ethylene propylene rubber). The ethylene content of EPDM rubber is around 45% to 85%. Higher ethylene content means higher loading, better mixing and improved extrusion. What is EPDM Rubber. EPDM rubber (ethylene propylene diene monomer rubber) is a type of synthetic rubber. EPDM is an elastomer, which is an elastic polymer or links of identical large molecules than have both viscosity and elasticity."}]