[{"url": "http://answers.webmd.com/answers/1174500/what-is-a-schatzki-ring", "passage_text": "242,161 Helpful Votes. 190 Followers. A. Schatzki’s rings are smooth, benign, circumferential, and narrowed rings of tissue in the lower end of the esophagus (the food pipe that connects the mouth to the stomach). These rings are located just above the junction of the esophagus with the stomach. "}, {"url": "http://medical-dictionary.thefreedictionary.com/Schatzki+ring", "passage_text": "Schatzki ring-a contraction ring or incomplete mucosal diaphragm in the lower third of the esophagus, which is occasionally symptomatic. [Richard Schatzki, U.S. radiologist, 1901–1992]. A lower esophageal mucosal ring composed of a thin annular weblike tissue located at the squamocolumnar junction at or near the border of the lower esophageal sphincter. When the diameter of the ring is less than 1.3 cm, dysphagia is present. Treatment involves stretching the ring with dilators"}, {"url": "https://en.wikipedia.org/wiki/Schatzki_ring", "passage_text": "A Schatzki ring is a specific type of esophageal ring, and Schatzki rings are further subdivided into those above the esophagus / stomach junction (A rings), and those found at the squamocolumnar junction in the lower esophagus (B rings). 1 Schatzki rings can be associated with swallow syncope, a rare variety of syncope. 2  Schatzki rings are associated with lesser incidence of Barrett's esophagus, which is considered to be a pre-cancerous condition of the esophagus in some cases."}, {"url": "http://www.memorialhermann.org/digestive/schatzkis-ring/", "passage_text": "Symptoms. Patients with a Schatzki’s ring are usually asymptomatic. Any symptoms are directly associated with the extent of narrowing caused by the ring. Usually rings of 13 millimeters (0.5 inches) in diameter or narrower are the ones that cause symptoms. "}, {"url": "http://diseaseslist.org/schatzki-ring-symptoms-causes-treatment/", "passage_text": "A Schatzki ring thus refers to constriction of the lower section of the esophagus which can lead to swallowing difficulties. The constriction is understood to be caused by a ring made of muscular tissue or mucosal tissue that can be found in the linings of the esophagus. "}, {"url": "https://en.wikipedia.org/wiki/Schatzki_ring", "passage_text": "A Schatzki ring or Schatzki–Gary ring is a narrowing of the lower esophagus that can cause difficulty swallowing (dysphagia). The narrowing is caused by a ring of mucosal tissue (which lines the esophagus) or muscular tissue. 1 Schatzki rings can be associated with swallow syncope, a rare variety of syncope. 2  Schatzki rings are associated with lesser incidence of Barrett's esophagus, which is considered to be a pre-cancerous condition of the esophagus in some cases."}, {"url": "http://www.medicinenet.com/schatzki_ring/article.htm", "passage_text": "Many years ago, Schatzki described a smooth, benign, circumferential, and narrow ring of tissue in the lower end of the esophagus (the food pipe that connects the mouth to the stomach). These rings are located just above the junction of the esophagus with the stomach. These rings are common. The diagnosis of Schatzki ring can usually be made by barium x-ray examination of the esophagus; however, a narrow ring can be missed on x-ray. In patients with symptoms of dysphagia, doctors usually also order an upper endoscope examination. Endoscopy is the best way of diagnosing a Schatzki ring."}, {"url": "http://www.gandhofcny.com/education/diseases/esophageal-ring-stricture/", "passage_text": "An esophageal ring, or Schatzki ring, is a ring of tissue near the end of the food pipe (esophagus) just above the opening to the stomach. The area with the ring is narrower than the rest of the food pipe. Many people have a Schatzki ring and do not know it, because most of the time a Schatzki rings causes no symptoms. Symptoms may occur when poorly chewed food gets caught at the ring before reaching the stomach. A Schatzki ring can cause chest pain or a feeling that the food is stuck and won’t move in"}]