[{"url": "http://www.food.com/recipe/baked-chicken-tenders-194400", "passage_text": "1 Preheat Oven to 425°F. 2  Mix chicken tenders and mayonnaise in a bowl to lightly coat chicken with mayonnaise. 3  Mix bread crumbs and cheese in a gallon-size zippie bag. 4  Prepare baking sheet with cooking spray. 5  Put 1-2 chicken tenders in the zippie bag with the bread crumbs and shake to coat. 1 Mix bread crumbs and cheese in a gallon-size zippie bag. 2  Prepare baking sheet with cooking spray. 3  Put 1-2 chicken tenders in the zippie bag with the bread crumbs and shake to coat. 4  Place chicken tenders in a single layer on prepared baking sheet. 5  Continue until all tenders are coated and on the"}, {"url": "http://www.food.com/recipe/baked-chicken-tenders-194400", "passage_text": "1 Put 1-2 chicken tenders in the zippie bag with the bread crumbs and shake to coat. 2  Place chicken tenders in a single layer on prepared baking sheet. 3  Continue until all tenders are coated and on the baking sheet. 4  Bake in preheated oven for 8 minutes. 1 Mix bread crumbs and cheese in a gallon-size zippie bag. 2  Prepare baking sheet with cooking spray. 3  Put 1-2 chicken tenders in the zippie bag with the bread crumbs and shake to coat. 4  Place chicken tenders in a single layer on prepared baking sheet. 5"}, {"url": "http://www.rachaelrayshow.com/recipe/15328_Baked_Chicken_Tenders/", "passage_text": "Dredge the chicken tenders in the flour to coat, shaking off any excess flour. Dip the floured chicken tenders into the egg and finally, coat the chicken tenders with the breadcrumbs. Place the breaded chicken tenders onto a baking sheet and bake in the oven for 12-15 minutes, until golden brown. Salt and black pepper. Ingredients. Preparation. Preheat oven to 375F. Season the chicken tenders with salt and black pepper. In a shallow dish, season the flour with salt and black pepper then beat the eggs in another shallow dish with the milk. In a third shallow dish, place the breadcrumbs."}, {"url": "http://www.answers.com/Q/How_long_do_you_cook_chicken_breast_tenderloins", "passage_text": "1.) not very long, and 2.) not very well. A chicken breast doesn't weigh very much and at that temperature you will dry it out before you cook all the way through. Use 350 … and cook for 20 minutes. Or cover with some mushroom soup and cook for 45 minutes in a pre-heated oven. Pan cooking on the stove top is what I would do."}, {"url": "http://www.tyson.com/products/boneless-skinless-chicken-tenderloins-2-5-lb-bag.aspx", "passage_text": "1. Preheat oven to 375°F. 2. Bake frozen tenderloins 20 to 30 minutes, or until juices run clear when thickest part of chicken is pierced and temperature on instant read thermometer reaches 170°F. (Bake thawed tenderloins 15 to 25 minutes). Grill (Char Grill / Gas Grill). 1. Preheat grill to MEDIUM heat. 2. Grill frozen tenderloins, turning occasionally, 20 to 25 minutes, or until juices run clear when thickest part of chicken is pierced and temperature on instant read thermometer reaches 170°F. (Grill thawed tenderloins 10 to 15 minutes)."}, {"url": "http://www.bettycrocker.com/recipes/oven-fried-chicken-tenders/46a69e4d-4c31-485b-9d43-67d40b353f2e", "passage_text": "1 In third shallow dish, mix bread crumbs and cheese. 2  Coat chicken with flour; dip into egg mixture, then coat with bread crumb mixture. 3  Place on cookie sheet. 4  3 Bake 15 to 20 minutes, turning once, until chicken is no longer pink in center and coating is golden brown. 5  Serve with dipping sauce. 1 1 Heat oven to 425°F. Line cookie sheet with foil; spray with cooking spray. 2  2 In shallow dish, place flour. 3  In another shallow dish, beat egg and water. 4  In third shallow dish, mix bread crumbs and cheese. 5"}, {"url": "http://www.food.com/recipe/baked-chicken-tenders-194400", "passage_text": "1 Place chicken tenders in a single layer on prepared baking sheet. 2  Continue until all tenders are coated and on the baking sheet. 3  Bake in preheated oven for 8 minutes. 4  Gently flip each one, so as not to remove the breading, and bake an additional 8 minutes. 5  Serve with your favorite dipping sauce. 1 Mix bread crumbs and cheese in a gallon-size zippie bag. 2  Prepare baking sheet with cooking spray. 3  Put 1-2 chicken tenders in the zippie bag with the bread crumbs and shake to coat. 4  Place chicken tenders in a single layer on prepared baking sheet. 5"}, {"url": "http://www.answers.com/Q/How_long_do_you_cook_chicken_breast_tenderloins", "passage_text": "I usually cook bonless chicken breasts in a pre-heated oven @ 350 for 30-35mins   350 for 1 hour is comon temperature. or 375 for 45 minutes.   45 mins to an hour for bo … ne-in chicken (thighs,legs,breast) at 350 degrees ..either way,pierce it with a fork,if the juice comes out clear and NOT pink, it is cooked. A chicken breast doesn't weigh very much and at that temperature you will dry it out before you cook all the way through. Use 350 … and cook for 20 minutes. Or cover with some mushroom soup and cook for 45 minutes in a pre-heated oven. Pan cooking on the stove top is what I would do."}, {"url": "http://www.livestrong.com/article/538163-how-to-bake-boneless-skinless-chicken-tenders-in-the-oven/", "passage_text": "Put the baking sheet in the oven after all tenders are coated. Bake until fully cooked, about 15 to 20 minutes. Check the internal temperature of the tenders reaches 165 F. How to Bake Boneless Skinless Chicken Tenders in the Oven. How to Bake Boneless Skinless Chicken Tenders in the Oven Photo Credit Michael Gann/Demand Media. Baking boneless chicken strips doesn’t have to be a challenge -- or a problem for your waistline."}]