[{"url": "http://www.webmd.com/a-to-z-guides/ankle-sprain-overview", "passage_text": "An ankle sprain can range from mild to severe, depending on how badly the ligament is damaged and how many ligaments are injured. With a mild sprain, the ankle may be tender, swollen, and stiff. But it usually feels stable, and you can walk with little pain. "}, {"url": "http://www.howlongdoes.com/health/how-long-does-sprained-ankle-take-to-heal/", "passage_text": "How long does sprained ankle take to heal may vary from seven days to couple of fortnights. Primarily couple of treatments is regularly practiced thought contradicting from each other yet popular. The healing span will vary immensely depending upon your choice. "}, {"url": "https://answers.yahoo.com/question/index?qid=20061211131455AAY5FNe", "passage_text": "Report Abuse. A sprained ankle can take from 2 weeks to 2 months to feel completely healthy again. Some sprains will actually take longer than a broken ankle to heel. This is all dependant on how bad you twisted and pulled the tendons and ligaments in your ankle. There are 2 very important steps to recovering quickly and fully from a sprained ankle. Can take anywhere from 2 weeks to 6 months. Depends on how bad the sprain was. Ice it a lot and keep it elevated and that might make the recovery time less."}, {"url": "http://www.webmd.com/a-to-z-guides/ankle-sprain-home-treatment", "passage_text": "Home Treatment. Ankle sprains take an average of 6 weeks to heal but can take can up to 4 months, depending on the severity. An ankle brace, air stirrup, hiking boots, or other form of ankle support should be worn during this time to protect the ligaments. Some people who have repeated or severe sprains can develop long-term joint pain and weakness. Treating a sprained ankle can help prevent ongoing ankle problems. Rehabilitation (rehab) exercises for an ankle sprain can be done at home to promote proper healing and prevent chronic pain and instability."}, {"url": "https://www.sharecare.com/health/sprains-strains-minor-pains/how-long-recover-sprained-ankle", "passage_text": "It usually takes 5 to 14 days to recover from a grade one ankle sprain. This is when slight stretching and damage occurs to the ligaments. With a grade one sprain, there is slight instability, pain, swelling, joint stiffness, and trouble walking. A Dr. Holman Chan, MD, Foot & Ankle Surgery, answered on behalf of Sunrise Hospital & Medical Center. How long it takes to recover from a sprained ankle can be from one week to one year, says Holman Chan, MD, an orthopedic surgeon at Sunrise Hospital."}, {"url": "http://www.ehow.com/about_5471943_long-sprained-ankle-heal.html", "passage_text": "Most grade 2 sprains take four to six weeks to heal. A grade 3 sprain is the most serious injury with the longest healing/recovery time. A sprain of this severity can easily take 8 to 12 weeks or even longer to heal completely. Physicians usually immobilize the joint and prescribe physical therapy, just as with a grade 2 sprain. However, the immobilization period is longer, as is the physical-therapy program"}, {"url": "http://www.ehow.com/about_5471943_long-sprained-ankle-heal.html", "passage_text": "Grade 3 Sprain. A grade 3 sprain is the most serious injury with the longest healing/recovery time. A sprain of this severity can easily take 8 to 12 weeks or even longer to heal completely. Physicians usually immobilize the joint and prescribe physical therapy, just as with a grade 2 sprain. However, the immobilization period is longer, as is the physical-therapy program"}, {"url": "http://abcnews.go.com/Health/MensHealthQuestions/story?id=7931646", "passage_text": "Answer: Well, when considering how long it might take for a sprain to heal, you need to consider that there are varying degrees of sprain injuries. There's a grade one, where the ligament that holds the joint in place is stretched. As you can imagine, that's going to really impact just how long it takes for that ligament to heal itself back together. General rule of thumb, say for ankle sprain, perhaps a grade one: two, three weeks; grade two: four weeks; and a grade three: sometimes four, six weeks -- sometimes longer. Comments. ."}, {"url": "https://www.sharecare.com/health/sprains-strains-minor-pains/how-long-recover-sprained-ankle", "passage_text": "Grade two sprains can take 4 to 6 weeks to heal. This involves partial tearing of the ligaments. Signs of a grade two sprain include instability, moderate to severe pain, swelling, stiffness and possible bruising. Grade three sprains can take 8 to 12 weeks to heal. This is a complete tear of the ligament. With grade three sprains, there is a lot of instability within the joint, severe pain when the injury occurs and no pain after injury, severe swelling and excessive bruising. A Dr. Holman Chan, MD, Foot & Ankle Surgery, answered on behalf of Sunrise Hospital & Medical Center. How long it takes to recover from a sprained ankle can be from one week to one year, says Holman Chan, MD, an orthopedic surgeon at Sunrise Hospital."}]