[{"url": "http://www.landscapingnetwork.com/swimming-pool/cost.html", "passage_text": "$1,500 - $5,000: Vinyl-lined Pools. The nationwide average is about $50 per square foot, which can be dramatically altered depending upon the location, the type of pool, and the customization added to a pool. "}, {"url": "http://home.costhelper.com/swimming-pool.html", "passage_text": "1 Installing an aboveground pool can cost $1,500-$5,000; for in-ground estimated costs are $7,000-$16,000 for a vinyl-lined model, $15,000-$25,000 for a fiberglass shell and $17,000-$45,000 for concrete or gunite. 2  However, custom designs can run prices much higher. Shopping for a swimming pool: 1  Aboveground pools are relatively easy to install by following the manufacturer's instructions; in-ground ones require excavating, plumbing and much more. 2  This Old House uses photos to show the steps used to create an $80,000 custom concrete in-ground pool."}, {"url": "http://www.fixr.com/costs/build-swimming-pool", "passage_text": "1 The vinyl is the least expensive with a standard cost of roughly $18,000. 2  The fiberglass bump up the costs to $20,000 without installation. 3  There are also concrete and gunite pools that require around $20,000 to $50,000 to install. According to P.K. Data the average cost of a 19' diameter above ground swimming pool is $6,243; while the average cost of a 32'x16' inground swimming pool is $21,919."}, {"url": "http://homewyse.com/services/cost_to_install_concrete_pad.html", "passage_text": "Get an INSTANT estimate of the cost to Install a Concrete Pad! Our free calculator uses recent, trusted data to estimate costs for your Concrete Pad Installation project. For a basic 120 square feet project in zip code 47474, the benchmark cost to Install a Concrete Pad ranges between $4.64 - $6.36 per square foot* . To estimate costs for your project: 1."}, {"url": "http://home.costhelper.com/concrete-resurfacing.html", "passage_text": "1 ThisOldHouse.com estimates it took two people five hours and six bags ($150-$180) of material to resurface a 9'x27' driveway and a 3'x18' walkway (about 300 square feet). 2  Renting a pressure washer to clean the existing concrete before resurfacing can add $40-$75 to the total DIY costs. 1 Expect to pay a resurfacing contractor $3-$10 a square foot depending on the condition of the existing concrete, the resurfacing system used and local rates. 2  Small residential projects tend to cost more per square foot and may be subject to a minimum charge of $500-$1,000 or more."}, {"url": "http://liquidblue.net.au/price_calculator.php", "passage_text": "For in-ground reinforced concrete pools of the following size. 1  7.0 x 3.75 metre (24.5 m2). 2  8.0 x 4.0 metre (32 m2). 3  9.0 x 4.5 metre (40.5 m2). "}, {"url": "http://www.homewyse.com/services/cost_to_install_concrete_pool_deck.html", "passage_text": "Our free calculator uses recent, trusted data to estimate costs for your Concrete Pool Deck Installation project. For a basic 125 square feet project in zip code 47474, the benchmark cost to Install a Concrete Pool Deck ranges between $3.85 - $5.04 per square foot* . To estimate costs for your project: 1. Set Project Zip Code Enter the Zip Code for the location where labor is hired and materials purchased"}, {"url": "http://www.fixr.com/costs/inground-gunite-concrete-swimming-pool", "passage_text": "Standard finish is smoothed and painted. The cost of an average in-ground Gunite-concrete swimming pool varies by location, shape, size, and decorative quality of the finish and surroundings. The typical 12' x 24' rectangular (288 sq.ft. of water surface area) concrete pool will cost around $72 per square foot. Typical extras raise that cost to about $103 per square foot. Low: $20,710 (12' x 24' installed without extras). High: $35,915 (12' x 24' installed with extras). Cost to build an in-ground gunite (concrete) swimming pool varies greatly by region. Get free estimates from swimming pool builders in your city."}, {"url": "http://homeguides.sfgate.com/estimate-costs-inground-pool-28828.html", "passage_text": "4. Estimate the cost for the pool accessories by adding together the costs of the accessories you want to buy. These can range from something as small as pool toys for your kids, to larger items such as lounge chairs and other furniture for the pool deck, as well as a slide or a waterfall for the pool."}]