[{"url": "http://www.definitions.net/definition/genetic%20diversity", "passage_text": "Genetic diversity. Genetic diversity, the level of biodiversity, refers to the total number of genetic characteristics in the genetic makeup of a species. It is distinguished from genetic variability, which describes the tendency of genetic characteristics to vary."}, {"url": "http://www.wwf.org.au/our_work/saving_the_natural_world/what_is_biodiversity/genetic_diversity/", "passage_text": "Genetic diversity refers to the variety of genes within a species. Each species is made up of individuals that have their own particular genetic composition. Within a species there may also be discrete populations with distinctive genes. "}, {"url": "http://edugreen.teri.res.in/explore/life/genetic.htm", "passage_text": "Surf. Go back Genetic biodiversity All forms of life on earth, whether microbes, plants, animals, or human beings, contain genes. Genetic diversity is the sum of genetic information contained in the genes of individual plants, animals, and micro-organisms."}, {"url": "http://www.wwf.org.au/our_work/saving_the_natural_world/what_is_biodiversity/", "passage_text": "Biodiversity comprises all the millions of different species that live on our planet, as well as the genetic differences within species. It also refers to the multitude of different ecosystems in which species form unique communities, interacting with one another and the air, water and soil. Biological diversity – or biodiversity – is the term given to the variety of life on Earth. It is the variety within and between all species of plants, animals and micro-organisms and the ecosystems within which they live and interact."}, {"url": "https://en.wikipedia.org/wiki/Biodiversity", "passage_text": "Biodiversity is the variety of different types of life found on Earth and the variations within species. It is a measure of the variety of organisms present in different ecosystems. This can refer to genetic variation, ecosystem variation, or species variation (number of species) within an area, biome, or planet. Terrestrial biodiversity tends to be greater near the equator, which seems to be the result of the warm climate and high primary productivity."}, {"url": "http://www.merriam-webster.com/dictionary/biodiversity", "passage_text": "Full Definition of BIODIVERSITY. : biological diversity in an environment as indicated by numbers of different species of plants and animals. — bio·di·verse \\-dī-ˈvərs, -də-\\ adjective. See biodiversity defined for English-language learners. See biodiversity defined for kids. "}, {"url": "http://jamaicachm.org.jm/BHS/definition.htm", "passage_text": "Definition of Biodiversity. 4.1 Explain the term biodiversity. Include gene, species and ecosystem levels. The term BIODIVERSITY was first coined by the entomologist E.O. Wilson in 1986. A neologism from biology and diversity, it refers to the variety of life on the planet. There is no single standard definition for biodiversity. 1. 1. Biodiversity may be defined as the totality of different organisms, the genes they contain, and the ecosystems they form. Biodiversity may be considered at three levels: genetic diversity, species diversity, and ecosystem diversity (see figure 1 below). Figure 1: Illustrations of various levels of biodiversity. back to top. Species diversity. - refers to the variety of living species within a geographic area."}, {"url": "http://www.biology-online.org/dictionary/Genetic_diversity", "passage_text": "Genetic diversity. Definition. noun. Genetic diversity refers to both the vast numbers of different species as well as the diversity within a species. The greater the genetic diversity within a species, the greater that species' chances of long-term survival. This is because negative traits (such as inherited diseases) become widespread within a population when that population is left to reproduce only with its own members."}, {"url": "https://en.wikipedia.org/wiki/Genetic_diversity", "passage_text": "Genetic diversity is the total number of genetic characteristics in the genetic makeup of a species. It is distinguished from genetic variability, which describes the tendency of genetic characteristics to vary. Genetic diversity serves as a way for populations to adapt to changing environments. With more variation, it is more likely that some individuals in a population will possess variations of alleles that are suited for the environment. Those individuals are more likely to survive to produce offspring bearing that allele. The interdependence between genetic and species diversity is delicate. Changes in species diversity lead to changes in the environment, leading to adaptation of the remaining species. Changes in genetic diversity, such as in loss of species, leads to a loss of biological diversity."}]