[{"url": "http://www.cosmeticsinfo.org/ingredient/mica-0", "passage_text": "The Food and Drug Administration (FDA) lists Mica as a color additive exempt from certification. Mica, is safe for use in coloring products, including cosmetics and personal care products applied to the lips, and the area of the eye."}, {"url": "http://www.cosmeticsinfo.org/ingredient/mica-0", "passage_text": "Mica imparts a sparkly white appearance to cosmetics and personal care products. Scientific Facts: Mica is a group of silicate minerals that are widely distributed in different types of rock. Mica often occurs as flakes, scraps, or sheets, and has been used by humans since prehistoric times."}, {"url": "https://www.truthinaging.com/ingredients/mica", "passage_text": "Mica. * A mineral that reflects light. * Please read TIA’s article on Mineral Make Up and Why TIA Isn’t Always in Favor. Functions: Mica is a silicate mineral used in cosmetics for its brilliant or shimmering appearance, according to Wikipedia. The word mica is actually thought to be derived from the Latin word micare, meaning to glitter.."}, {"url": "http://www.safecosmetics.org/get-the-facts/chemicals-of-concern/mica/", "passage_text": "Mica minerals are often used as color additives in cosmetics. [2] They also have reflective properties, allowing for a shimmery effect in mineral foundations."}, {"url": "http://www.safecosmetics.org/get-the-facts/chemicals-of-concern/mica/", "passage_text": "Mica is a naturally occurring mineral dust often used in makeup foundations, as filler in cement and asphalt, and as insulation material in electric cables. Workers in cosmetic manufacturing factories are at high risk of mica exposure through inhalation."}, {"url": "http://www.cosmeticsinfo.org/ingredient/mica-0", "passage_text": "Mica is a naturally occurring group of silicate minerals. In cosmetics and personal care products, Mica, from muscovite mica is used in the formulation of a wide variety of product types, including makeup, nail products and skin care products."}]