[{"url": "http://electronicdesign.com/energy/what-s-difference-between-watts-and-volt-amperes", "passage_text": "Power in watts is the rate at which energy is consumed (or generated). One watt is one joule (energy) per second (1 W = 1 J/s). You pay your utility company for watts expressed as energy, which is power consumed for a time period, typically shown by your utility company in kilowatt-hours."}, {"url": "http://science.howstuffworks.com/environmental/energy/question501.htm", "passage_text": "­The­ three most basic units in electricity are voltage (V), current (I, uppercase i) and resistance (r). Voltage is measured in volts, current is measured in amps and resistance is measured in ohms. A neat analogy to help understand these terms is a system of plumbing pipes. The voltage is equivalent to the water pressure, the current is equivalent to the flow rate, and the resistance is like the pipe size."}, {"url": "https://en.wikipedia.org/wiki/Watt", "passage_text": "The watt (symbol: W) is a derived unit of power in the International System of Units (SI), named after the Scottish engineer James Watt (1736–1819). The unit is defined as joule per second and can be used to express the rate of energy conversion or transfer with respect to time."}, {"url": "http://science.howstuffworks.com/environmental/energy/question5011.htm", "passage_text": "Electrical Efficiency. In an electrical system, increasing either the current or the voltage will result in higher power. Let's say you have a system with a 6-volt light bulb hooked up to a 6-volt battery. The power output of the light bulb is 100 watts."}, {"url": "http://www.askoncor.com/EN/Pages/FAQs/Other-9.aspx", "passage_text": "​ ​Wattage measures the work being done at a given point and time. It’s found by multiplying voltage by the current flowing in a wire. For example, a 100-watt light bulb burning for 10 hours uses 1,000 wattage hours — or one kilowatt hours (kWh). A kwh equals 1,000 watts used for one hour. Kilowatt-hours are the measurements that Oncor uses to determine your electric consumption."}, {"url": "http://www.wikihow.com/Calculate-Wattage", "passage_text": "How to Calculate Wattage. There is a very simple calculation equation for computing watt usage for an electronic device. All you need to know is the number of amperes (amps) and the number of volts for the device, which is easily located."}]