[{"url": "https://uk.answers.yahoo.com/question/index?qid=20090712035615AAhQq1m", "passage_text": "Answers. Best Answer: Polyamide is a synthetic polymeric fibre made via the condensation of monomers terminated with either/or an amine group and a carboxyl group. Any polymer held together with amide (R-NHOOC-R') link is considered a polyamide, including aramids such as kevlar. That is the technical description. "}, {"url": "https://answers.yahoo.com/question/index?qid=20080903033040AAYCxeE", "passage_text": "Polyamide is the class name for a group of polymers wherein the repeat units are connected by amide linkages. They are also called nylon, from the original DuPont trademark. The most common polyamides are nylon 6 and nylon 6,6 (polyhexamethylene adipamide). "}, {"url": "https://en.wikipedia.org/wiki/Polyamide", "passage_text": "All polyamides are made by the formation of an amide function to link two molecules of monomer together. The monomers can be amides themselves (usually in the form of a cyclic lactam such as Caprolactam), α,ω-amino acids or a stoichiometric mixture of a diamine and a diacid. For the industrial production of synthetic polyamides with at least one aliphatic monomer (nylon polymers), the amide link is produced from the condensation reaction of an amino group and a carboxylic acid group, water is eliminated. For fully aromatic polyamides or 'aramids' e.g."}, {"url": "http://www.textileschool.com/articles/85/polyamide-fibres-manmade-artificial-fibres", "passage_text": "Polyamide Fibers. Synthetic man-made account for the largest part of the raw material used in manufacturing nonwoven bonded fabrics. In this group of synthetic nonwoven bonded fabrics, polyamide fibres are the not only the oldest ones used in production, they also increase the serviceability of the product. This improved quality is of importance for various purposes, e.g.:"}, {"url": "http://www.essentialchemicalindustry.org/polymers/polyamides.html", "passage_text": "However, other manufactured polyamides are also important and these include an aromatic polyamide, Kevlar and plastics produced from carbamide (urea). The nomenclature for describing the linear, aliphatic polyamides (the nylons) is based on the number of carbon atoms in the repeating unit. Polyamides are polymers which contain repeating amide, -CO-NH-, linkages. Proteins are examples of naturally occurring polyamides."}, {"url": "https://en.wikipedia.org/wiki/Polyamide", "passage_text": "A polyamide is a macromolecule with repeating units linked by amide bonds. Polyamides occur both naturally and artificially. Examples of naturally occurring polyamides are proteins, such as wool and silk. Artificially made polyamides can be made through step-growth polymerization or solid-phase synthesis yielding materials such as nylons, aramids, and sodium poly(aspartate) . Synthetic polyamides are commonly used in textiles, automotive applications, carpets and sportswear due to their high durability and strength. For the industrial production of synthetic polyamides with at least one aliphatic monomer (nylon polymers), the amide link is produced from the condensation reaction of an amino group and a carboxylic acid group, water is eliminated. For fully aromatic polyamides or 'aramids' e.g."}, {"url": "http://www.craftyandy.net/2007/12/what-is-polyamide-fiber-made-of.html", "passage_text": "A polyamide is a polymer containing monomers joined by peptide bonds. They can occur both naturally, examples being proteins, such as wool and silk, and can be made artificially, examples being Nylons, Aramids, and sodium poly(aspartate) . It is made of repeating units linked by peptide bonds (another name for amide bonds) and is frequently referred to as polyamide (PA). Nylon was the first commercially successful polymer and the first synthetic fiber to be made entirely from coal, water and air."}, {"url": "http://www.cirfs.org/ManmadeFibres/Fibrerange/Polyamide.aspx", "passage_text": "Polyamide. A polyamide fibre is defined by BISFA as being a fibre composed of linear macromolecules having in the chain recurring amide linkages, at least 85% of which are joined to aliphatic or cycloaliphatic units. There are many polyamide fibres made but only two, described below, are made in significant quantities. To produce fibres from the polyamide polymers the molten polymer is pumped through spinneret holes at a temperature approaching 300 degrees C to form filaments that are cooled and solidified in a quench air stream."}]