[{"url": "http://www.bobvila.com/articles/wood-shingles-and-shakes/", "passage_text": "Wood shingles costs between $400 and $700 per square installed, while a shake roof runs between $600 and $900—that’s three or six times the cost of an asphalt roof! "}, {"url": "http://www.improvenet.com/r/costs-and-prices/red-cedar-shingle-roofing", "passage_text": "The Costs. The average maximum reported cost of red cedar shingle roofing in the United States is $8.87 per square foot. The average minimum reported cost of red cedar shingle roofing in the United States is $6.80 per square foot. When it comes to cedar roofing, red cedar is certainly the most popular option. However, it is also important to note that white cedar roofing shingles are available as well."}, {"url": "http://www.vinylsidingprices.co/materials/cedar-shake-siding-prices.html", "passage_text": "Cedar siding prices for installation vary from $1.00 to $2.00 per square foot. The installation of shingles is an easy process which can be accomplished using a nail gun. The price is along similar lines to that of vinyl siding. The cost of the lower to mid-range cedar shakes will be on a per square foot basis ranging from $1 - $1.75. The price may be for the white cedar rather than red cedar. The white cedar isn't as long lasting or durable as the red, but it does slowly change to a nice silver color after a few years"}, {"url": "http://www.vinylsidingprices.co/materials/cedar-shake-siding-prices.html", "passage_text": "Cedar Shake Siding Prices. Homeowners can expect cedar shake siding prices to vary from $3 - $6.50 installed. The price is inclusive of all costs including the shake shingles, installation, project materials and labor. Price Range: $3 - $6.50 per sq. ft. installed. The cost of the lower to mid-range cedar shakes will be on a per square foot basis ranging from $1 - $1.75. The price may be for the white cedar rather than red cedar. The white cedar isn't as long lasting or durable as the red, but it does slowly change to a nice silver color after a few years"}, {"url": "http://www.answers.com/Q/What_is_the_cost_to_install_Cedar_shingles_per_square", "passage_text": "What is the average cost per square foot to install roof? It depends on the type of roof. A single story low pitch asphalt shingle roof will cost around $40 - $80 per square (100 sq. ft.) to tear off and $75 - $100 per square to inst … all new shingles. If the plywood sheathing underneath is damaged, it will cost extra, up to $50 per sheet replaced. "}, {"url": "https://answers.yahoo.com/question/index?qid=20110909155027AAKNMvO", "passage_text": "Rating Newest Oldest. Best Answer: Here in northern Michigan I get $70.00 per 100 square feet for tear off, and $271.00 per 100 square feet for labor and material for cedar shingles. Cedar Shakes are much higher in price. I hope this helps. "}, {"url": "http://www.networx.com/article/cost-of-new-shingles", "passage_text": "Asphalt. Retail price for 25-year, 3-tab shingles is about $25 to $30 per bundle, plus tax. You need three bundles per square, so the total price is around $75 to $90 per square. For architectural shingles, the retail price jumps to about $33 to over $52 per bundle, or $100 to $160 per square. Architectural shingles typically have higher wind ratings and longer warrantees than standard 3-tab materials. If you've ever had a roof replaced, you know that the majority of the cost is in the labor. But that doesn't mean the cost of materials is anything to sniff at, and the prices for shingles alone vary widely. That's why a new roof can run you anywhere from $225 to $1,000 and up"}, {"url": "http://www.vinylsidingprices.co/materials/cedar-shake-siding-prices.html", "passage_text": "You can expect to pay between $1.75 and $2.50 per square foot for these mid to premium shake shingles. The price may be for the traditional red cedar, this cedar is long lasting and more durable than white cedar. Red cedar can darken over the years making it look almost black and blotchy. The cost of the lower to mid-range cedar shakes will be on a per square foot basis ranging from $1 - $1.75. The price may be for the white cedar rather than red cedar. The white cedar isn't as long lasting or durable as the red, but it does slowly change to a nice silver color after a few years"}, {"url": "http://home.costhelper.com/wood-shingle-roof.html", "passage_text": "Additional costs: 1  Shingles and shakes are typically made of cedar, spruce or treated pine. 2  Like most roofing materials, shingles and shakes are sold by the square -- which is enough to cover a 10x10-foot area (100 square feet). 1 Like most roofing materials, shingles and shakes are sold by the square -- which is enough to cover a 10x10-foot area (100 square feet). 2  It's customary to buy about 10 percent extra materials (to cover unavoidable waste) for a basic roof and about 15 percent for a more complex project."}]