[{"url": "http://homeguides.sfgate.com/paint-ceiling-downlights-30397.html", "passage_text": "Downlights sit flush with your ceiling surface. Downlights in your ceiling are recessed light boxes that you install in your attic. The boxes extend down into your ceiling, allowing the inside edges of the downlights to show. Climb a ladder to remove the light bulbs from the downlights. Cover the light socket and other visible hardware with painter's tape and newspaper. Tape around the outer edges of the downlight as well to keep paint from getting on the ceiling."}, {"url": "http://homeguides.sfgate.com/paint-ceiling-downlights-30397.html", "passage_text": "2. Climb a ladder to remove the light bulbs from the downlights. Cover the light socket and other visible hardware with painter's tape and newspaper. Tape around the outer edges of the downlight as well to keep paint from getting on the ceiling."}, {"url": "http://www.fire.nsw.gov.au/page.php?id=709", "passage_text": "1 Always use a licensed electrical contractor to install the halogen down-lights and ensure the lights meet the current Australian Standards. 2  Never install halogen down-lights near structural timber members such as roof, ceiling or floor beams. Halogen down-lights create a lot of heat and if they are not correctly insulated, installed and maintained they can cause a fire. Halogen lights generate very high temperatures which can get anywhere up to 370C."}, {"url": "http://www.fire.nsw.gov.au/page.php?id=709", "passage_text": "1 Never install halogen down-lights near structural timber members such as roof, ceiling or floor beams. 2  Ensure the lights and transformers are not covered by ceiling insulation such as pulped paper, rock wool, fibreglass batts or polyester batts. 3  The heat from the lights can cause the insulation to smoulder or ignite. Halogen down-lights create a lot of heat and if they are not correctly insulated, installed and maintained they can cause a fire. Halogen lights generate very high temperatures which can get anywhere up to 370C."}, {"url": "http://homeguides.sfgate.com/paint-ceiling-downlights-30397.html", "passage_text": "Paint the downlight with a heat-resistant paint to match your ceiling or a colored paint to make the downlights stand out from the ceiling. Heat-resistant paint can withstand the heat given off by the light bulbs and helps prevent peeling and bubbling. Climb a ladder to remove the light bulbs from the downlights. Cover the light socket and other visible hardware with painter's tape and newspaper. Tape around the outer edges of the downlight as well to keep paint from getting on"}, {"url": "http://www.build.com.au/are-downlights-fire-hazard", "passage_text": "Bear in mind that it’s not just insulation that can pose a threat. Exposed downlights can also ignite timber beams, and general ceiling debris such as rubbish and leaves. Rodents, nesting birds and humans moving debris in the roof space can also inadvertently create a fire hazard. Preventive measures. First and foremost, the installation of insulation – or any work done in the roof cavity for that matter – should be done by experienced, qualified tradespeople. There are major electrical dangers in a roof space, particularly when downlights are involved."}, {"url": "http://www.liteonled.com.au/help-information/halogen-downlight-dangers/", "passage_text": "The NSW Fire Brigade also make a good comment that “Smoke alarms will only detect smoke below the ceiling…” They suggest to consider replacing 50W bulbs with 20W or 35W Infra-Red coated bulbs which emit less heat. Or we suggest even better replace with 7W to 10W LED light bulbs which emit considerably less heat. Insulation too close to a downlight (image from Energy Safe, 26). For this reason there are now strict guidelines and rules for the installation of halogen downlighting such as the new wiring rules in AS/NZS 3000:2007. "}, {"url": "http://www.dfes.wa.gov.au/safetyinformation/fire/fireinthehome/pages/downlights.aspx", "passage_text": "If downlights are not correctly installed or maintained they can set fire to insulation, wiring, leaf litter or timber which can burn undetected in the roof space above smoke alarms. Old or poorly installed ceiling downlights are thought to cause at leat one house fire a week in Western Australia. "}, {"url": "http://www.fire.nsw.gov.au/page.php?id=709", "passage_text": "Halogen down light fire safety. 1  Always use a licensed electrical contractor to install the halogen down-lights and ensure the lights meet the current Australian Standards. 2  Never install halogen down-lights near structural timber members such as roof, ceiling or floor beams. Halogen down-lights create a lot of heat and if they are not correctly insulated, installed and maintained they can cause a fire. Halogen lights generate very high temperatures which can get anywhere up to 370C."}, {"url": "http://www.build.com.au/are-downlights-fire-hazard", "passage_text": "Managing heat from downlights has always been an issue though. It has long been reported that when heat generated by the stylish lighting mixes with loose, flammable insulation in the roof cavity, the results are potentially disastrous. Preventive measures. First and foremost, the installation of insulation – or any work done in the roof cavity for that matter – should be done by experienced, qualified tradespeople. There are major electrical dangers in a roof space, particularly when downlights are involved."}]