[{"url": "http://www.webmd.com/skin-problems-and-treatments/erythromelalgia-11058", "passage_text": "Erythromelalgia is a rare condition that primarily affects the feet and, less commonly, the hands (extremities). It is characterized by intense, burning pain of affected extremities, severe redness (erythema), and increased skin temperature that may be episodic or almost continuous in nature. Important. It is possible that the main title of the report Erythromelalgia is not the name you expected. Please check the synonyms listing to find the alternate name(s) and disorder subdivision(s) covered by this report."}, {"url": "http://emedicine.medscape.com/article/200071-overview", "passage_text": "Erythromelalgia is a rare disorder characterized by burning pain, warmth, and redness of the extremities. "}, {"url": "https://www.patientslikeme.com/conditions/813-erythromelalgia", "passage_text": "Erythromelalgia is a rare disorder characterized by periodic inflammation and blockage of the vessels of the extremities, resulting in skin redness, swelling, and burning pain. It may manifest as a primary disorder caused by genetic mutation or as a secondary disorder due to blood disorders. "}, {"url": "http://www.erythromelalgia.org/WhatisEM.aspx", "passage_text": "What is EM? Erythromelalgia is a rare and frequently devastating disorder that typically affects the skin of the feet or hands, or both, and causes visible redness, intense heat and burning pain. The term erythromelalgia describes the syndrome: erythros (redness), melos (extremity) and algia (pain). "}, {"url": "http://www.facebook.com/media/set/?set=a.148526505234721.38771.110313705722668&type=3", "passage_text": "Erythromelalgia is a condition characterised by intense burning pain, erythema (marked redness), and increased skin temperature, primarily of the feet and hands. The condition is classified into primary and secondary erythromelalgia. "}, {"url": "http://www.rightdiagnosis.com/e/erythromelalgia/intro.htm", "passage_text": "Erythromelalgia: A rare disorder characterized by periods of burning pain, redness and warmth in the feet and hands. More detailed information about the symptoms, causes, and treatments of Erythromelalgia is available below. "}, {"url": "http://ghr.nlm.nih.gov/condition/erythromelalgia", "passage_text": "Erythromelalgia is a condition characterized by episodes of pain, redness, and swelling in various parts of the body, particularly the hands and feet. These episodes are usually triggered by increased body temperature, which may be caused by exercise or entering a warm room. "}, {"url": "http://www.nhs.uk/Conditions/erythromelalgia/Pages/Introduction.aspx", "passage_text": "Introduction. Erythromelalgia is a rare disorder that causes episodes of burning pain and redness in the hands and feet, and sometimes the arms, legs, ears and face. Cooling the skin or raising the affected hands or feet may reduce the pain. Symptoms can begin at any age"}, {"url": "https://rarediseases.org/rare-diseases/erythromelalgia/", "passage_text": "Erythromelalgia is a rare condition that primarily affects the feet and, less commonly, the hands (extremities). It is characterized by intense, burning pain of affected extremities, severe redness (erythema), and increased skin temperature that may be episodic or almost continuous in nature. Signs & Symptoms. Erythromelalgia is characterized by severe, burning pain, marked redness (erythema) of the skin, swelling, and increased skin temperature, particularly of the feet. However, in some affected individuals, the hands may be the primary sites of involvement."}]