[{"url": "https://en.wikipedia.org/wiki/Vascular_tissue", "passage_text": "This article is about vascular tissue in plants. For transport in animals, see Circulatory system. Vascular tissue is a complex conducting tissue, formed of more than one cell type, found in vascular plants. The primary components of vascular tissue are the xylem and phloem. These two tissues transport fluid and nutrients internally. There are also two meristems associated with vascular tissue: the vascular cambium and the cork cambium. The vascular tissue in plants is arranged in long, discrete strands called vascular bundles. These bundles include both xylem and phloem, as well as supporting and protective cells. In stems and roots, the xylem typically lies closer to the interior of the stem with phloem towards the exterior of the stem."}, {"url": "https://en.wikipedia.org/wiki/Xylem", "passage_text": "Xylem is one of the two types of transport tissue in vascular plants, phloem being the other. The most distinctive xylem cells are the long tracheary elements that transport water. Tracheids and vessel elements are distinguished by their shape; vessel elements are shorter, and are connected together into long tubes that are called vessels. Xylem also contains two other cell types: parenchyma and fibers."}, {"url": "http://www.bbc.co.uk/schools/gcsebitesize/science/add_ocr_gateway/green_world/planttransportrev1.shtml", "passage_text": "Plants have two different types of transport tissue. Xylem transports water and solutes from the roots to the leaves, phloem transports food from the leaves to the rest of the plant. Transpiration is the process by which water evaporates from the leaves, which results in more water being drawn up from the roots. Plants have adaptations to reduce excessive water loss. Xylem. Xylem vessels xylem vessel: Vein-like tissue which transports water and minerals up a plant are involved in the movement of water through a plant from its roots to its leaves. Water: 1  Is absorbed from the soil through root hair cells. 2  Is transported through the xylem vessels up the stem to the leaves."}, {"url": "http://www.diffen.com/difference/Phloem_vs_Xylem", "passage_text": "Phloem and xylem are complex tissues that perform transportation of food and water in a plant. They are the vascular tissues of the plant and together form vascular bundles. They work together as a unit to bring about effective transportation of food, nutrients, minerals and water. Xylem transports water and soluble mineral nutrients from roots to various parts of the plant. It is responsible for replacing water lost through transpiration and photosynthesis."}, {"url": "http://facweb.furman.edu/~lthompson/bgy34/plantanatomy/plant_cells.htm", "passage_text": "The vascular tissue system is important in transport. The vascular tissue system is composed of the xylem (transport of water and dissolved minerals) and phloem (transport of food-usually sucrose and other sugars-, nitrogen containing compounds, and hormones). The xylem and phloem in the primary plant body are usually closely associated in the form of vascular bundles"}, {"url": "http://www.bbc.co.uk/schools/gcsebitesize/science/add_ocr_gateway/green_world/planttransportrev1.shtml", "passage_text": "Xylem vessels xylem vessel: Vein-like tissue which transports water and minerals up a plant are involved in the movement of water through a plant from its roots to its leaves. Water: 1  Is absorbed from the soil through root hair cells. Xylem. Xylem vessels xylem vessel: Vein-like tissue which transports water and minerals up a plant are involved in the movement of water through a plant from its roots to its leaves. Water: 1  Is absorbed from the soil through root hair cells. 2  Is transported through the xylem vessels up the stem to the leaves."}, {"url": "http://www.xtremepapers.com/revision/gcse/biology/transport_in_plants.php", "passage_text": "In the centre of the root, is the beginning of the transport system of the plant, which is made of two main transport tissues, the xylem tissue and the phloem tissue. The diagram below shows a transverse section through a root. The xylem vessel is specialised to transport water and dissolved minerals from the root up to all the other parts of the plant, and also to helps supporting the stem and strengthening it. These walls of the xylem vessel contains holes called pits which water enters through."}, {"url": "http://www.bbc.co.uk/schools/gcsebitesize/science/triple_aqa/transport_systems/transport_in_plants/revision/1/", "passage_text": "Plants have two systems for the transportation of substances-using two different types of transport tissue. Xylem transports water and solutes from the roots to the leaves, while phloem transports food from the leaves to the rest of the plant. Transpiration is the process by which water evaporates from the leaves, which results in more water being drawn up from the roots. Plants have two transport systems to move food, water and minerals through their roots, stems and leaves. These systems use continuous tubes called xylem and phloem, and together they are known as vascular bundles."}, {"url": "https://en.wikipedia.org/wiki/Vascular_tissue", "passage_text": "The cells in vascular tissue are typically long and slender. Since the xylem and phloem function in the conduction of water, minerals, and nutrients throughout the plant, it is not surprising that their form should be similar to pipes. The vascular tissue in plants is arranged in long, discrete strands called vascular bundles. These bundles include both xylem and phloem, as well as supporting and protective cells. In stems and roots, the xylem typically lies closer to the interior of the stem with phloem towards the exterior of the stem."}]