[{"url": "http://saylor.org/site/wp-content/uploads/2010/11/Wiki-Interphase.pdf", "passage_text": "Interphase is also considered to be the'living' phase of the cell, in which the cell obtains nutrients, grows, reads itsDNA, and conducts other normal cell functions. The majority ofeukaryotic cells spend most of their time in interphase. "}, {"url": "https://sg.answers.yahoo.com/question/index?qid=20080203182831AA2lOhr", "passage_text": "Answers. Best Answer: Interphase is the longest phase of the cell cycle because it can be thought of as the most active phase. A cell spends most of its life in interphase; during this phase, a cell grows, makes ATP and organelles, copies chromosomes, makes microfilaments, prepares for mitosis, etc. Basically, most of the stuff a cell does in its life is during interphase. It's why so much time is consumed during it. Source(s): "}, {"url": "http://www.answers.com/Q/Why_do_cells_spend_more_time_in_interphase", "passage_text": "The interphase is the state in which the cell actually does most of its work. I collects food, or stands guard or holds a body together, or prepares necessary chemicals or the like. Cells spend most of their time in interphase. Individual chromosomes cannot be distinguished in the nucleus of the cell, they are working harder to duplicate chromosomes befor … e they undergo cell division and enter prophase. It is a longer process than the rest of the cycles. + 3 others found this useful."}, {"url": "https://ca.answers.yahoo.com/question/index?qid=20071020211406AAbX7FR", "passage_text": "In this case, they may spend the vast majority of their lifespan in interphase. Other rapidly dividing cells (skin cells, hair cells, etc.) have a much shorter interphase. I haven't studied the plant cell cycle in depth, but I know that they do spend a little more than 90% of their time in interphase. Source(s): Molecular Biology of the Cell 4th ed. by Alberts et al"}, {"url": "http://www.answers.com/Q/Do_cells_spend_more_time_in_mitosis_or_inter-phase", "passage_text": "Cells are in the Interphase 90% of the total time during cell cycle. In this phase cells grow and copies chromosomes in preparation for division. Interphase has 3 sections: G1 … ,S and G2. Just during the S phase occur DNA synthesis. Cells spend most of their time in interphase. Individual chromosomes cannot be distinguished in the nucleus of the cell, they are working harder to duplicate chromosomes before they undergo cell division and enter prophase."}, {"url": "https://answers.yahoo.com/question/index?qid=20070207181656AAgmkOv", "passage_text": "Best Answer: Because cells have to grow, and get energy before they can divide. Interphase is the phase in the cell cycle which would be pretty much the normal activity of the cell. The cell grows during interphase and carries on its normal activities. Many cells never divide and their entire lives are spent in interphase. Even those that are meant to divide-like in a root tip or stem tip-spend the bulk of their time"}, {"url": "https://en.wikipedia.org/wiki/Interphase", "passage_text": "The duration of time spent in interphase and in each stage of interphase is variable and depends on both the type of cell and the species of organism it belongs to. Most cells of adult mammals spend about 20 hours in interphase; this accounts for about 90% of the total time involved in cell division. Interphase is the 'daily living' or metabolic phase of the cell, in which the cell obtains nutrients and metabolizes them, grows, reads its DNA, and conducts other normal cell functions. The majority of eukaryotic cells spend most of their time in interphase. This phase was formerly called the resting phase"}, {"url": "http://cronodon.com/BioTech/Cell_Cycle.html", "passage_text": "Cell CycleThe cell cycle is the life-cycle of the cell. Cells in multicellular animals, like humans, cycle between two phases: interphase (I phase), the interval between mitosis, and mitosis (M phase) itself (including nuclear division and cell division). Most cells are in interphase most of the time. "}]