[{"url": "http://k6educators.about.com/od/assessmentandtesting/a/meritypay.htm", "passage_text": "1 And the highest performing teachers should be first in line for this financial recognition. 2  We are in the middle of a teaching shortage. 3  Merit pay would inspire potential teachers to give the profession more consideration as a viable career choice, rather than a personal sacrifice for the higher good. Tetra Images-Jamie Grill/Brand X Pictures/Getty Images. Teaching unions around the United States are lessening their opposition to merit pay for teachers, and finding new ways to experiment with the concept, passionate reactions erupted from teachers everywhere."}, {"url": "http://www.scholastic.com/browse/subarticle.jsp?id=1882", "passage_text": "The Good & Bad of Teacher Merit Pay. Teacher merit pay has long been debated in education, and both sides raise valid points. PROS. 1  Merit pay raises the bar of professionalism in teaching. 2  Teachers must be held more accountable and judged in relation to their peers. 3  Evaluation is part of being a professional. "}, {"url": "http://smallbusiness.chron.com/advantages-merit-pay-programs-20265.html", "passage_text": "Focus on Quality. Employers sometimes reward employees based on tangible outcomes, such as the number of products they produce. However, a strong merit pay program focuses more on intangible outcomes. Rewarding employees for intangible outcomes, such as customer satisfaction, tends to increase the quality of service. In the long run, quality often matters more than quantity to a company's reputation."}, {"url": "http://k6educators.about.com/od/assessmentandtesting/a/meritypay.htm", "passage_text": "1 We are in the middle of a teaching shortage. 2  Merit pay would inspire potential teachers to give the profession more consideration as a viable career choice, rather than a personal sacrifice for the higher good. Tetra Images-Jamie Grill/Brand X Pictures/Getty Images. Teaching unions around the United States are lessening their opposition to merit pay for teachers, and finding new ways to experiment with the concept, passionate reactions erupted from teachers everywhere."}, {"url": "https://en.wikipedia.org/wiki/Merit_pay", "passage_text": "The positive side of salary pay is salary pay is more fair. Salary pay is competitive. The positive side of Merit pay is the merit pay program will attract more teachers to elementary schools, increase teacher performance, and student test scores. Salary pay verses Merit Pay by Rochelle Griffin Many states are considering the difference between salary and merit pay for teachers; however, both have positive and negative factors. Salary pay is a set amount of money that the employer pays the employee."}, {"url": "http://www.ernweb.com/educational-research-articles/pros-and-cons-of-merit-pay-for-teachers-a-point-counterpoint-look-at-the-issue-from-one-of-the-leading-practitioners-of-performance-based-compensation/", "passage_text": "4 Responses to “Pros and cons of merit pay for teachers: A point-counterpoint look at the issue from one of the leading practitioners of performance-based compensation”. Teachers and athleetes are not analogous….yes public school taught me to understand the analogy…but i had to learn it. The authors, Lewis Solmon and Michael Podgursky, developed a list of 15 common arguments against merit pay or performance-based compensation for educators. They then asked 50 educators who had been awarded a Milken Educators Award to comment on those statements and they specifically asked for negative statements."}, {"url": "http://www.ernweb.com/educational-research-articles/pros-and-cons-of-merit-pay-for-teachers-a-point-counterpoint-look-at-the-issue-from-one-of-the-leading-practitioners-of-performance-based-compensation/", "passage_text": "Performance-based compensation programs reward the top 15-20% of performers without making any effort to improve all teachers. Many programs place arbitrary limits on how many teachers receive merit pay (e.g. 10%, or one in each department, etc.). Merit pay need not be limited to a fixed percentage of the workforce. All teachers can be evaluated for merit pay. In tiered systems, all teachers can move from one level to the next. The authors, Lewis Solmon and Michael Podgursky, developed a list of 15 common arguments against merit pay or performance-based compensation for educators. They then asked 50 educators who had been awarded a Milken Educators Award to comment on those statements and they specifically asked for negative statements."}, {"url": "http://www.ernweb.com/educational-research-articles/pros-and-cons-of-merit-pay-for-teachers-a-point-counterpoint-look-at-the-issue-from-one-of-the-leading-practitioners-of-performance-based-compensation/", "passage_text": "One working model for merit pay or performance-based compensation for teachers is the Teacher Advancement Program (TAP) launched by the Milken Family Foundation in 1999. A trademark of TAP is that it ties educators’ salaries and bonuses to instructional performance and growth in student achievement. The authors, Lewis Solmon and Michael Podgursky, developed a list of 15 common arguments against merit pay or performance-based compensation for educators. They then asked 50 educators who had been awarded a Milken Educators Award to comment on those statements and they specifically asked for negative statements."}]