[{"url": "http://www.litcharts.com/lit/pygmalion/themes", "passage_text": "The title of Shaw's play is taken from the myth of Pygmalion. In this story, Pygmalion scorns all the women around him and makes a sculpture of his ideal woman. The sculpture is so beautiful that he falls in love with it and it comes to life. By titling his play after this story, Shaw calls attention to questions of femininity and gender."}, {"url": "https://answers.yahoo.com/question/index?qid=20090317053346AAzOL6G", "passage_text": "Report Abuse. Pygmalion-George Bernard Shaw THEMES Major Themes Shaw called Pygmalion a potboiler and subtitled it A Romance.. Thus the play's main thematic concern is romantic in the literary use of the term. It is a play that has a highly improbable plot. Best Answer: Pygmalion (1913) is a play by George Bernard Shaw loosely inspired by the Greek myth of the same name."}, {"url": "http://www.gradesaver.com/pygmalion/study-guide/themes", "passage_text": "Myths of Creation. Of all Shaw's plays, Pygmalion has the most references to Greek and Roman mythology. Higgins represents Pygmalion, a Greek sculptor who lived alone because he hated women. Pygmalion created a sculpture of a perfect woman and fell in love with it; after he prayed, Aphrodite brought it to life for him. This statue is named Galatea, and it is represented in Shaw's play by Liza. Unlike the myth, Shaw's play does not end in a marriage between the pair, and Liza is infuriated with Higgins's suggestion that her success is his success and that he has made her what she is. She has worked to recreate her identity as well."}, {"url": "http://www.litcharts.com/lit/pygmalion/themes", "passage_text": "Shaw's play explores aspects of language in a variety of ways. Higgins and Pickering study linguistics and phonetics, taking note of how people from different backgrounds speak differently. In this story, Pygmalion scorns all the women around him and makes a sculpture of his ideal woman. The sculpture is so beautiful that he falls in love with it and it comes to life. By titling his play after this story, Shaw calls attention to questions of femininity and gender."}, {"url": "http://study.com/academy/lesson/pygmalion-by-shaw-summary-characters-theme.html", "passage_text": "Lesson Summary. Pygmalion is a play by George Bernard Shaw that tells the story of Eliza Doolittle, a young flower girl who speaks cockney and does not get respect from others. Pygmalion is a play by George Bernard Shaw that tells the story of a poor, young flower girl who has been disrespected and overlooked because of her appearance and the dialect she speaks."}, {"url": "https://en.wikipedia.org/wiki/Pygmalion_(mythology)", "passage_text": "Pygmalion (/pɪɡˈmeɪliən/ ; Greek: πυγμαλίων, gen .: πυγμαλίωνος) is a legendary figure of Cyprus. Though Pygmalion is the Greek version of the Phoenician royal name Pumayyaton, he is most familiar from Ovid 's narrative poem Metamorphoses, in which Pygmalion was a sculptor who fell in love with a statue he had carved. George Bernard Shaw 's Pygmalion (1912, staged 1914) owes something to both the Greek Pygmalion and the legend of King Cophetua and the beggar maid; in which a king lacks interest in women, but one day falls in love with a young beggar-girl, later educating her to be his queen."}, {"url": "http://www.answers.com/Q/What_are_the_themes_of_Pygmalion", "passage_text": "There are two Dootlittles in Pygmalion. Eliza Doolittle is the protagonist of the play. Eliza is introduced in Act I. She is the one being transformed by Mr. Higgins throug … h speech, as she ascends up the social ladder. Alfred Doolittle is Eliza's father. He is introduced in Act II"}, {"url": "http://study.com/academy/lesson/pygmalion-by-shaw-summary-characters-theme.html", "passage_text": "'Pygmalion' is a play written by George Bernard Shaw. It tells the story of the transformation of a young girl's life. Learn more about the 'Pygmalion', the characters in the story, and themes for the story, and then test your knowledge with a quiz. Pygmalion is a play by George Bernard Shaw that tells the story of a poor, young flower girl who has been disrespected and overlooked because of her appearance and the dialect she speaks."}, {"url": "https://en.wikipedia.org/wiki/Pygmalion_(mythology)", "passage_text": "In Ovid's narrative, Pygmalion was a Cypriot sculptor who carved a woman out of ivory. According to Ovid, after seeing the Propoetides he was not interested in women, but his statue was so fair and realistic that he fell in love with it. George Bernard Shaw 's Pygmalion (1912, staged 1914) owes something to both the Greek Pygmalion and the legend of King Cophetua and the beggar maid; in which a king lacks interest in women, but one day falls in love with a young beggar-girl, later educating her to be his queen."}]