[{"url": "https://en.wikipedia.org/wiki/Amylase", "passage_text": "An amylase (/ˈaemɨleɪs/) ˈæmɨleɪs is an enzyme that catalyses the hydrolysis of starch into. sugars Amylase is present in the saliva of humans and some other mammals, where it begins the chemical process of digestion. Foods that contain large amounts of starch but little sugar, such as rice and potatoes, may acquire a slightly sweet taste as they are chewed because amylase degrades some of their starch into sugar."}, {"url": "http://homepages.wmich.edu/~rossbach/bios312/LabProcedures/Starch%20Hydrolysis%20Medium.html", "passage_text": "Starch Hydrolysis Medium. Purpose: To determine if a bacterium produces the enzyme amylase, which breaks down starch to glucose. Principle: Starch Hydrolysis medium is a simple medium that contains beef extract, soluble starch and agar. Because starch is such a large molecule it cannot be directly transported into a bacterial cell. "}, {"url": "http://www.austincc.edu/microbugz/starch_hydrolysis.php", "passage_text": "Starch agar is a simple nutritive medium with starch added. Since no color change occurs in the medium when organisms hydrolyze starch, we add iodine to the plate after incubation. Iodine turns blue, purple, or black (depending on the concentration of iodine) in the presence of starch. A clearing around the bacterial growth indicates that the organism has hydrolyzed starch."}, {"url": "http://www.vumicro.com/vumie/help/VUMICRO/Starch_Hydrolysis_Test.htm", "passage_text": "The purpose is to see if the microbe can use starch, a complex carbohydrate made from glucose, as a source of carbon and energy for growth. Use of starch is accomplished by an enzyme called alpha-amylase. Place the dropper above the plate and add the reagent to the culture. The starch in the plate is changed to blue-brown by the iodine reagent. Areas where starch has been digested by bacterial growth exhibit clear halos in the midst of the dark plate, indicating a positive alpha-amylase, or starch hydrolysis test."}, {"url": "https://en.wikipedia.org/wiki/Starch", "passage_text": "Starch is processed to produce many of the sugars in processed foods. Dissolving starch in warm water gives wheatpaste, which can be used as a thickening, stiffening or gluing agent. The biggest industrial non-food use of starch is as adhesive in the papermaking process. Pure starch is a white, tasteless and odorless powder that is insoluble in cold water or alcohol. It consists of two types of molecules: the linear and helical amylose and the branched amylopectin. Depending on the plant, starch generally contains 20 to 25% amylose and 75 to 80% amylopectin by weight."}, {"url": "https://en.wikipedia.org/wiki/Amylase", "passage_text": "An amylase (/ˈaemɨleɪs/) ˈæmɨleɪs is an enzyme that catalyses the hydrolysis of starch into. Sugars amylase is present in the saliva of humans and some other, mammals where it begins the chemical process of. digestion Amylase is present in the saliva of humans and some other mammals, where it begins the chemical process of digestion. Foods that contain large amounts of starch but little sugar, such as rice and potatoes, may acquire a slightly sweet taste as they are chewed because amylase degrades some of their starch into sugar."}, {"url": "http://www.austincc.edu/microbugz/starch_hydrolysis.php", "passage_text": "Starch agar is a differential medium that tests the ability of an organism to produce certain exoenzymes, including a-amylase and oligo-1,6-glucosidase, that hydrolyze starch. Since no color change occurs in the medium when organisms hydrolyze starch, we add iodine to the plate after incubation. Iodine turns blue, purple, or black (depending on the concentration of iodine) in the presence of starch. A clearing around the bacterial growth indicates that the organism has hydrolyzed starch."}, {"url": "http://www1.lsbu.ac.uk/water/enztech/starch.html", "passage_text": "The use of enzymes in starch hydrolysis. Starch is the commonest storage carbohydrate in plants. It is used by the plants themselves, by microbes and by higher organisms so there is a great diversity of enzymes able to catalyse its hydrolysis. Starch from all plant sources occurs in the form of granules which differ markedly in size and physical characteristics from species to species."}]