[{"url": "http://patient.info/health/chilblains", "passage_text": "They usually go away over 7-14 days. If you are prone to developing chilblains then you should keep warm in cold weather. Chilblains (sometimes called pernio) are small, itchy, painful, red swellings on the skin. Chilblains are caused by an abnormal skin reaction to cold. They tend to occur on 'extremities' that more easily become cold. That is, your toes, fingers, nose and earlobes. However, other areas of skin sometimes develop chilblains when they become cold."}, {"url": "https://en.wikipedia.org/wiki/Chilblains", "passage_text": "Chilblains (/ˈtʃɪlbleɪnz/ ; also known as pernio and perniosis) is a medical condition that occurs when a predisposed individual is exposed to cold and humidity, causing tissue damage. It is often confused with frostbite and trench foot. Damage to capillary beds in the skin causes redness, itching, inflammation, and sometimes blisters. Chilblains can be reduced by keeping the feet and hands warm in cold weather, and avoiding extreme temperature changes."}, {"url": "http://www.webmd.boots.com/skin-problems-and-treatments/guide/chilblains", "passage_text": "There are two types of chilblains: chronic and acute. The chronic type of chilblains last for at least five months of the year for at least three years. With chronic chilblains you may also see scarring. People who have acute chilblains usually only have them for one to two weeks. If you are susceptible to chilblains, be sensible in cold weather by wearing gloves and warm clothing worn in layers. If you are outside in the cold, keep active to improve your circulation and do not wear tight shoes because this can restrict circulation. Keep your skin moisturised."}, {"url": "http://medical-dictionary.thefreedictionary.com/chilblain", "passage_text": "redness and swelling of the skin caused by excessive exposure to cold. Burning, itching, blistering, and ulceration that are similar to those characteristic of a thermal burn may occur. Treatment includes protection against cold and injury, gentle warming, and avoidance of tobacco. Erythema, itching, and burning, especially of the dorsa of the fingers and toes, and of the heels, nose, and ears, resulting from exposure to moist cold. Also called erythema pernio."}, {"url": "https://chilblains.org/", "passage_text": "The Chilblains.org Treatment ™. The Best Chilblains Treatment is the worlds only natural chilblains treatment guaranteed to get rid of chilblains or your money back! 1  Improvement in as little as 24 hours. 2  100% natural and cosmetic grade ingredients. 3  Thousands of satisfied customers around the world. The development of chilblains is often linked to cold weather or sudden changes in temperature. Poor circulation is also often attributed to chilblains and the symptoms are often amplified by wearing tight shoes and/or restrictive clothing."}, {"url": "http://www.webmd.boots.com/skin-problems-and-treatments/guide/chilblains", "passage_text": "Chilblains. Chilblains occur in response to extremely cold temperatures. If you have chilblains you will notice small red itchy painful bumps on your skin, usually in the areas where you feel cold the most: toes, fingers, nose and ears. These bumps appear a few hours after exposure to the cold. If you are susceptible to chilblains, be sensible in cold weather by wearing gloves and warm clothing worn in layers. If you are outside in the cold, keep active to improve your circulation and do not wear tight shoes because this can restrict circulation. Keep your skin moisturised."}, {"url": "https://en.wikipedia.org/wiki/Chilblains", "passage_text": "A history of chilblains is suggestive of a connective tissue disease (such as lupus). Chilblains in infants, together with severe neurologic disease and unexplained fevers, can be seen in Aicardi–Goutieres goutières, syndrome a rare inherited. condition It is often confused with frostbite and trench foot. Damage to capillary beds in the skin causes redness, itching, inflammation, and sometimes blisters. Chilblains can be reduced by keeping the feet and hands warm in cold weather, and avoiding extreme temperature changes."}, {"url": "http://dc.wikia.com/wiki/Chillblaine", "passage_text": "This is the Chillblaine disambiguation page. Chillblaine is the name used by a series of super-villains who have been boyfriends to Golden Glider. She recruits them as her crime partners using cold gun technology designed by her brother Captain Cold. Because of this they are usually strong and handsome but not very smart. She recruits them as her crime partners using cold gun technology design This is the Chillblaine disambiguation page. Chillblaine IV New EarthA · I · G Chillblaine is the name used by a series of super-villains who have been boyfriends to Golden Glider."}, {"url": "https://chilblains.org/", "passage_text": "Chilblains, also known as chilblain, pernio or perniosis are patches of swollen, discoloured and sometimes itchy skin often caused by a combination of cold weather and poor circulation. Chilblains often affect the toes however other areas of the body such as fingers, earlobes and the nose can also develop chilblains. The development of chilblains is often linked to cold weather or sudden changes in temperature. Poor circulation is also often attributed to chilblains and the symptoms are often amplified by wearing tight shoes and/or restrictive clothing."}]