[{"url": "http://usatoday30.usatoday.com/tech/columnist/aprilholladay/2006-09-25-measuring-planets_x.htm", "passage_text": "• Analyzing light from the planet tells us about its atmosphere. Density: We determine a planet's makeup primarily by learning its density. For example, Earth's density is about 5.5 times water's density. So, if we learn that a new planet has about the same density as Earth's, we might guess it is similar to Earth. A: Scientists determine a planet's ingredients in several ways, depending partly on how close it is to Earth. Planets within our solar system: For planets like Mars that robots have visited, we analyzed rock and atmospheric samples on the spot. We also measure the planet's magnetic properties."}, {"url": "http://www.universetoday.com/85749/is-the-moon-a-planet/", "passage_text": "“A planet is a celestial body that (a) is in orbit around the Sun, (b) has sufficient mass for its self-gravity to overcome rigid body forces so that it assumes a hydrostatic equilibrium (nearly round) shape, and (c) has cleared the neighborhood around its orbit.”. According to the geophysical planet definition, what makes a planet a planet is that it is a non-self-luminous celestial spheroidal body orbiting a star, free floating in space, or even orbiting another planet. In other words, what makes a planet a planet are its intrinsic characteristics. If an object is not a star and is large enough for its gravity to squeeze it into a round or nearly round shape, it is a planet. By this definition, Earth’s moon qualifies as a planet"}, {"url": "http://www.scientificamerican.com/article/how-do-scientists-measure/", "passage_text": "The weight (or the mass) of a planet is determined by its gravitational effect on other bodies. Newton's Law of Gravitation states that every bit of matter in the universe attracts every other with a gravitational force that is proportional to its mass. "}, {"url": "https://en.wikipedia.org/wiki/IAU_definition_of_planet", "passage_text": "From Wikipedia, the free encyclopedia. A planet is a celestial body that (a) has sufficient mass for its self-gravity to overcome rigid body forces so that it assumes a hydrostatic equilibrium (nearly round) shape, and (b) is in orbit around a star, and is neither a star nor a satellite of a planet. The definition of planet set in Prague in 2006 by the International Astronomical Union (IAU) states that, in the Solar System, a planet is a celestial body which: 1  is in orbit around the Sun, 2  has sufficient mass to assume hydrostatic equilibrium (a nearly round shape), and"}, {"url": "http://www.iau.org/public/themes/pluto/", "passage_text": "A celestial body that (a) is in orbit around the Sun, (b) has sufficient mass for its self-gravity to overcome rigid body forces so that it assumes a hydrostatic equilibrium (nearly round) shape, and (c) has cleared the neighbourhood around its orbit. A: A dwarf planet is an object in orbit around the Sun that is large enough (massive enough) to have its own gravity pull itself into a round (or nearly round) shape. Generally, a dwarf planet is smaller than Mercury. A dwarf planet may also orbit in a zone that has many other objects in it."}, {"url": "https://en.wikipedia.org/wiki/Definition_of_planet", "passage_text": "(2) A dwarf planet is a celestial body that: (a) is in orbit around the Sun, (b) has sufficient mass for its self-gravity to overcome rigid body forces so that it assumes a hydrostatic equilibrium (nearly round) shape 2, (c) has not cleared the neighbourhood around its orbit, and (d) is not a satellite. This definition, which applies only to the Solar System, states that a planet is a body that orbits the Sun, is massive enough for its own gravity to make it round, and has  cleared its neighbourhood  of smaller objects around its orbit."}]