[{"url": "http://study.com/academy/lesson/dna-and-the-chemical-structure-of-nucleic-acids.html", "passage_text": "A polynucleotide is a nucleic acid molecule consisting of a long chain of nucleotides. Nucleotides in a polynucleotide molecule are held together by a bond between the phosphate group of one nucleotide and the sugar of a second nucleotide, which is called a phosphodiester bond. To unlock this lesson you must be a Study.com Member."}, {"url": "http://www.sparknotes.com/biology/molecular/structureofnucleicacids/section1.rhtml", "passage_text": "Nucleotides. A nucleotide consists of three things: The nitrogen bases are pyrimidine in structure and form a bond between their 1' nitrogen and the 1' -OH group of the deoxyribose. This type of bond is called a glycosidic bond."}, {"url": "http://myhome.sunyocc.edu/~weiskirl/nucleotides_nucleicacid.htm", "passage_text": "1 Nucleotides can be connected to make nucleic acids. 2  The connection that forms between nucleotides is between the sugar of the first nucleotide and the phosphate group of the second. 3  Each connection between nucleotides is a covalent bond, so the nucleic acids have a covalently attached sugar-phosphate backbone."}, {"url": "http://www.brooklyn.cuny.edu/bc/ahp/SDPS/SD.PS.polynuc.html", "passage_text": "There are five common nitrogenous bases; adenine, guanine, thymine, cytosine and uracil. Nucleotides are joined together by covalent bonds between the phosphate group of one nucleotide and the third carbon atom of the pentose sugar in the next nucleotide."}, {"url": "http://www.nature.com/scitable/definition/phosphate-backbone-273", "passage_text": "DNA and RNA are composed of nucleotides that are linked to one another in a chain by chemical bonds, called ester bonds, between the sugar base of one nucleotide and the phosphate group of the adjacent nucleotide. The sugar is the 3' end, and the phosphate is the 5' end of each nucleiotide."}, {"url": "http://myhome.sunyocc.edu/~weiskirl/nucleotides_nucleicacid.htm", "passage_text": "1 The connection that forms between nucleotides is between the sugar of the first nucleotide and the phosphate group of the second. 2  Each connection between nucleotides is a covalent bond, so the nucleic acids have a covalently attached sugar-phosphate backbone."}, {"url": "http://knowgenetics.org/nucleotides-and-bases/", "passage_text": "The sugar and phosphate group make up the backbone of the DNA double helix, while the bases are located in the middle. A chemical bond between the phosphate group of one nucleotide and the sugar of a neighboring nucleotide holds the backbone together. Chemical bonds (hydrogen bonds) between the bases that are across from one another hold the two strands of the double helix together. Bases."}]