[{"url": "http://www.archives.gov/legislative/features/oklahoma/", "passage_text": "On September 17, 1907 the people of the Indian and Oklahoma Territories voted favorably on statehood. The vote was certified and delivered to the President of the United States Theodore Roosevelt and on November 16, 1907, Roosevelt issued Presidential Proclamation 780 admitting Oklahoma as the forty-sixth state. First page of the Joint Statehood Convention, Oklahoma City, July 12, 1905. Although the Oklahoma and Indian Territories had sufficient population to be admitted as separate states, Congress insisted that the territories would only be granted statehood as a single, combined state."}, {"url": "http://www.history.com/this-day-in-history/oklahoma-enters-the-union", "passage_text": "On November 16, Oklahoma was welcomed into the United States by President Theodore Roosevelt. Oklahoma initially prospered as an agricultural state, but the drought years of the 1930s made the state part of the Dust Bowl. Oklahoma, with a name derived from the Choctaw Indian words okla, meaning “people,” and humma, meaning “red,” has a history of human occupation dating back 15,000 years."}, {"url": "http://www.history.com/this-day-in-history/oklahoma-enters-the-union", "passage_text": "The following year, the region was divided into Indian Territory and Oklahoma Territory. In 1907, Congress decided to admit Indian Territory and Oklahoma Territory into the Union as a single state, with all Indians in the state becoming U.S. citizens. Oklahoma, with a name derived from the Choctaw Indian words okla, meaning “people,” and humma, meaning “red,” has a history of human occupation dating back 15,000 years."}, {"url": "https://en.wikipedia.org/wiki/Oklahoma", "passage_text": "The name was settled upon statehood, Oklahoma Territory and Indian Territory were merged and Indian was dropped from the name. On November 16, 1907, Oklahoma became the 46th state to enter the union. Its residents are known as Oklahomans, or informally Okies, and its capital and largest city is Oklahoma City. Oklahoma is the 20th-largest state in the United States, covering an area of 69,898 square miles (181,035 km 2), with 68,667 square miles (177847 km 2) of land and 1,281 square miles (3,188 km 2) of water."}, {"url": "http://www.answers.com/Q/When_did_Oklahoma_become_a_US_state", "passage_text": "Part of Oklahoma's land was acquired in the Louisiana Purchase in 1803 and the rest was sought sometime around 1848. Oklahoma became a state on November 16, 1907. Today, the state's  population is an estimated 3.851 million. 49,340 Contributions. Oklahoma became the 46th US State on Saturday, November 16, 1907 under President Theodore Roosevelt. It is the 20th largest, 28th most populated and 36th most densely populate … d state. Oklahoma became a state November 16, 1907 when Theodore Roosevelt signed the Oklahoma Enabling Act."}, {"url": "http://www.answers.com/Q/When_did_Oklahoma_become_a_US_state", "passage_text": "Oklahoma was the 46th state to join the Union, is the 20th largest of the states in total area, and as of 2010 ranked 28th among the states in terms of population (3,751,000). 2 people found this useful. Edit. Share to: 49,340 Contributions. Oklahoma became the 46th US State on Saturday, November 16, 1907 under President Theodore Roosevelt. It is the 20th largest, 28th most populated and 36th most densely populate … d state. Oklahoma became a state November 16, 1907 when Theodore Roosevelt signed the Oklahoma Enabling Act."}, {"url": "http://www.history.com/this-day-in-history/oklahoma-enters-the-union", "passage_text": "Indian Territory and Oklahoma Territory collectively enter the United States as Oklahoma, the 46th state. Oklahoma, with a name derived from the Choctaw Indian words okla, meaning “people,” and humma, meaning “red,” has a history of human occupation dating back 15,000 years."}, {"url": "http://www.politico.com/story/2009/11/oklahoma-enters-the-union-nov-16-1907-029548", "passage_text": "Share on Facebook Share on Twitter. On this day in 1907, Oklahoma joined the Union when President Theodore Roosevelt signed legislation making it the 46th state. In 1890, the region had been divided into the Indian Territory and the Oklahoma Territory; Congress then sought to admit them both as a single state. "}, {"url": "https://en.wikipedia.org/wiki/Oklahoma", "passage_text": "Oklahoma /ˌoʊkləˈhoʊmə/ (Cherokee: Asgaya gigageyi / ᎠᏍᎦᏯ ᎩᎦᎨᏱ; or translated ᎣᎦᎳᎰᎹ (oɡalahoma), òɡàlàhoma: Pawnee, Uukuhuuwa: Uukuhuúwa) cayuga gahnawiyoˀgeh is a state located In The South Central. United states oklahoma is the 20th most extensive and the 28th most populous of The 50. united states Oklahoma is the 20th-largest state in the United States, covering an area of 69,898 square miles (181,035 km 2), with 68,667 square miles (177847 km 2) of land and 1,281 square miles (3,188 km 2) of water."}]