[{"url": "http://www.mayoclinic.org/symptoms/hyperkalemia/basics/when-to-see-doctor/sym-20050776", "passage_text": "If you have symptoms of hyperkalemia and have reason to think your potassium level might be high, call your doctor immediately. Hyperkalemia is a serious and potentially life-threatening disorder. It can cause: 1  Muscle fatigue. 2  Weakness. 3  Paralysis. 4  Abnormal heart rhythms (arrhythmias). 5  Nausea. 6  Causes."}, {"url": "http://www.webmd.com/a-to-z-guides/hyperkalemia-causes-symptoms-treatments", "passage_text": "Causes of Hyperkalemia. Hyperkalemia -- high potassium in your blood -- may occur if your kidneys do not work properly and cannot remove potassium from your body or if your body's cells release too much potassium. Kidney disease is the most common cause of hyperkalemia. Your kidneys help control the balance of potassium in your body. If they do not work properly, they cannot filter extra potassium from the blood or remove it from the body."}, {"url": "http://www.webmd.com/a-to-z-guides/hyperkalemia-causes-symptoms-treatments", "passage_text": "Excess potassium in the diet can also contribute to increased levels in your blood, especially if there is an issue with kidney function. Salt substitutes typically contain high amounts of potassium. Foods such as melons, orange juice, and bananas are rich in potassium, too."}, {"url": "http://www.medicinenet.com/hyperkalemia/page2.htm", "passage_text": "More serious symptoms of hyperkalemia include slow heartbeat and weak pulse. Severe hyperkalemia can result in fatal cardiac standstill (heart stoppage). Generally, a slowly rising potassium level (such as with chronic kidney failure) is better tolerated than an abrupt rise in potassium levels."}, {"url": "http://umm.edu/health/medical/altmed/condition/hyperkalemia", "passage_text": "Your kidneys usually maintain levels of potassium in the blood. But if you have kidney disease -- the most common cause of hyperkalemia -- potassium levels can build up. Medications or diet may also affect the amount of potassium in the blood. Hyperkalemia can be life threatening and must be treated promptly."}, {"url": "http://study.com/academy/lesson/hyperkalemia-definition-causes-symptoms-treatment.html", "passage_text": "Causes and Symptoms. Hyperkalemia is typically caused by a loss in plasma membrane integrity or reduced secretion of potassium into urine by the kidneys. Most cells actively take-up potassium from the extracellular fluid to create the potassium gradient described above."}]