[{"url": "https://en.wikipedia.org/wiki/Associate%27s_Degree", "passage_text": "Time requirements [edit]. An associate degree is awarded to students who complete 90 quarter credit hours or 60 semester credit hours of schooling. Typically, on a full-time schedule, this requires two years to complete. Conversely, high school graduates who enter college with a high amount of transfer credits (AP, AICE, IB, CLEP) could finish the degree in less than two years. In rare circumstances, some students take one year to earn the associate degree."}, {"url": "http://www.answers.com/Q/How_many_credits_do_you_need_to_get_an_associate%27s_degree", "passage_text": "It depends on how many courses one plans to take per semester. Most associate degrees require about 64 hours of college credit. If an individual were to take 16 cred … it hours during the Fall and Spring semesters and take summers off then one could complete the degree within 2 years. How much longer would depend on the credit load carried each semester. Typically, an associates degree takes between 60 and 64 credits to complete depending on the specific school, program of study, and state mandates."}, {"url": "http://www.answers.com/Q/How_many_credits_do_you_need_to_get_an_associate%27s_degree", "passage_text": "Number of credits for a AA/AS Degree. The number of credits that are required to complete an associate's degree will depend upon the state mandate and your program of study. Typically, this degree requires 60 to 64 semester hours or 95 to 105 quarter hours. How much longer would depend on the credit load carried each semester. Typically, an associates degree takes between 60 and 64 credits to complete depending on the specific school, program of study, and state mandates."}, {"url": "http://www.answers.com/Q/How_many_credits_do_you_need_to_get_an_associate%27s_degree", "passage_text": "If it's an associates degree, then it takes two years, and requires 60 semester credit hours (or 90 quarter credits, if that's the system the college uses instead of the semester credit hour system). How much longer would depend on the credit load carried each semester. Typically, an associates degree takes between 60 and 64 credits to complete depending on the specific school, program of study, and state mandates."}, {"url": "http://aztransfer.com/associates_degrees/", "passage_text": "Completing the appropriate associate’s degree provides a solid educational foundation, and you should only need an additional 56-60 university credits to complete your bachelor’s degree, with a total of 120 credits. The Associate in Arts-Fine Arts degree is designed for students who plan to transfer to an Art, Dance, Theater, or Music related major at an Arizona public university. Generally, the degree will transfer as a block without loss of credit to Arizona's public universities. The AGEC-A is a component within the AAFA degree."}, {"url": "https://www.insidehighered.com/news/2013/06/17/associate-degree-program-requirements-typically-top-60-credits", "passage_text": "None of the 104 associate degree tracks surveyed had a median requirement of 60 credits or lower, according to the research conducted by HCM Strategists, a public policy research and advocacy firm. About 13 programs required 64 credits. Many topped 70 or more. The group is pushing for states and community colleges to reduce the number of associate degree programs that require more than 60 credits. Maryland is one of several states that have passed legislation aimed at limiting degree requirements."}, {"url": "https://www.ccsf.edu/Info/How_to_Get_An_Associates_Degree/", "passage_text": "An associate degree is a type of undergraduate degree requiring a minimum of 60 semester credits/units (for our purposes the terms credits and units are used interchangeably). The traditional AA/AS Degree program consists of three parts: general education requirements, major requirements, and electives. For more information, see your counselor. Area A-H from the CCSF Associate Degree Requirements worksheet. In addition to English and Math, a student must also complete a series of General Education (GE) Requirements."}, {"url": "http://valenciacollege.edu/aadegrees/courserequirement.cfm", "passage_text": "The Associate in Arts Degree requires a minimum of 60 college-level credit hours including 36 hours in general education, 24 hours of acceptable electives, and satisfaction of the foreign language proficiency requirement. A. General Education Requirements for the Associate in Arts Degree- 36 Credits. "}, {"url": "https://en.wikipedia.org/wiki/Associate%27s_Degree", "passage_text": "An associate degree is awarded to students who complete 90 quarter credit hours or 60 semester credit hours of schooling. Conversely, high school graduates who enter college with a high amount of transfer credits (AP, AICE, IB, CLEP) could finish the degree in less than two years. In rare circumstances, some students take one year to earn the associate degree."}, {"url": "https://www.insidehighered.com/news/2013/06/17/associate-degree-program-requirements-typically-top-60-credits", "passage_text": "There are many explanations for why community college students typically take more than two years to earn an associate degree -- often much more -- even when they are enrolled full time. Students regularly skip semesters because of money woes or other life complications outside of college. The group is pushing for states and community colleges to reduce the number of associate degree programs that require more than 60 credits. Maryland is one of several states that have passed legislation aimed at limiting degree requirements."}]