[{"url": "http://www.lpn123.com/", "passage_text": "LPN Salary: Salaries for LPN vary depending on the type of facility you work at and the state of the country you work. Average Annual Salary: $34,000 (ALL US, Nationwide Averages), Salary Range: $32,000 to $40,000. May work under the supervision of a RN, registered nurse. Salaries for LPN vary depending on the type of facility you work at and the state of the country you work. Average Annual Salary: $34,000 (ALL US, Nationwide Averages), Salary Range: $32,000 to $40,000."}, {"url": "http://www.lpn.com/state/new-york-lpn/", "passage_text": "New York has a growing number of opportunities in the nursing field. Within the state, LPNs make up 21 % of nurses in the state. The New York LPN comfort score is 59. LPN Degree and Education in New York. In the state of New York, the practical nursing program is the quickest route to becoming a nurse. To earn a degree requires one year of courses as well as hands-on practice. You are required to obtain a CPR card, and pass the NCLEX-PN exam upon completion of the course."}, {"url": "http://www.ehow.com/info_8154217_salary-lpn-new-york.html", "passage_text": "Shares & Saves. Save. Licensed practical nurses in New York made an average of $42,280 per year as of 2009, according to the New York State Department of Labor. LPNs who were new to the field made an average of $32,330 each year, while those with the most experience received an average of $47,260 annually. "}, {"url": "http://www.op.nysed.gov/prof/nurse/nursing.htm", "passage_text": "The practice of nursing or use of Registered Professional Nurse (RN) or Licensed Practical Nurse (LPN) titles within New York State requires licensure. To be licensed as a registered professional nurse in New York State you must: 1  be of good moral character; 2  be at least eighteen years of age; To be licensed as a licensed practical nurse in New York State you must: 1  be of good moral character; 2  be at least seventeen years of age; 3  be a high school graduate or the equivalent; 4  meet education requirements; and. 5  meet examination requirements."}, {"url": "http://www.payscale.com/research/US/Job=Licensed_Practical_Nurse_(LPN)/Hourly_Rate/017476d4/New-York-NY", "passage_text": "(United States). The average rate for a Licensed Practical Nurse (LPN) in New York, New York is $22.98 per hour. Most people with this job move on to other positions after 20 years in this field. "}, {"url": "http://www.payscale.com/research/US/Job=Licensed_Practical_Nurse_(LPN)/Hourly_Rate/068ac402/Buffalo-NY", "passage_text": "A Licensed Practical Nurse (LPN) in Buffalo, New York earns an average wage of $17.38 per hour. A skill in Psychiatric is associated with high pay for this job. Pay for this job does not change much by experience, with the most experienced earning only a bit more than the least. $28,581 - $47,010. "}, {"url": "http://salarybystate.org/tag/how-much-do-lpns-make", "passage_text": "As you can see from our salary by state LPN wages listed below a licensed practical nurse can expect to make as much $51,000 a year if getting employed in one of the highest paying states. This adds $1,160 a year to the pay and shows a bump in the per hour rate by .55 cents. The total number of LPN jobs available on the market in 2010 was 752,300 with a growth rate of 22% expected to take place from 2010 to 2020."}, {"url": "http://salarybystate.org/tag/how-much-do-lpns-make", "passage_text": "This table displays LPN Salaries By State so that people can compare how much an LPN makes in a specific state. This comparison engine will help people easily identify the best salaries for LPNs. Google Trend growth of search interest around an LPN increased a lot from 2005 and saw a small decline from 2009 to 2013. This adds $1,160 a year to the pay and shows a bump in the per hour rate by .55 cents. The total number of LPN jobs available on the market in 2010 was 752,300 with a growth rate of 22% expected to take place from 2010 to 2020."}]