[{"url": "http://www1.salary.com/Aerospace-and-Defense-Salaries.html", "passage_text": "Well there are a wide range of jobs in the Aerospace and Defense category and their pay varies greatly. If you know the pay grade of the job you are searching for you can narrow down this list to only view Aerospace and Defense jobs that pay less than $30K, $30K-$50K, $50K-$80K, $80K-$100K, or more than $100K."}, {"url": "http://www.simplyhired.com/salaries-k-subcontractor-jobs.html", "passage_text": "Average Subcontractor Salaries. The average salary for subcontractor jobs is $62,000. Average subcontractor salaries can vary greatly due to company, location, industry, experience and benefits. This salary was calculated using the average salary for all jobs with the term subcontractor anywhere in the job listing."}, {"url": "http://mechanicalengineeringpros.com/mechanical_engineering_rates_and_fees.htm", "passage_text": "When you hire the engineers at Mechanical Engineering Professionals, LLC for your contract projects, you are hiring some of the most skilled and creative mechanical design engineers in the country."}, {"url": "http://www.construction-forms.net/docs/ccw/CA_Public_Works_Subcontract.pdf", "passage_text": "When any or all of a Change Order is added to Work performed by a Sub-subcontractor, Subcontractor shall add 10 percent markup to the first $50,000 of that Work and 7 percent on the balance beyond $50,000."}, {"url": "http://www.construction-forms.net/docs/ccw/CA_Public_Works_Subcontract.pdf", "passage_text": "Sub-subcontract is a written agreement between a specialty contractor and subcontractor. Terms of the sub-subcontract require the specialty contractor to complete some portion of the work Subcontractor is obligated to perform under another agreement, usually with the General Contractor."}, {"url": "http://www.gsa.gov/graphics/fas/MLSolicitation_with_Modifications.pdf", "passage_text": "The term subcontract as used in this clause excludes (a) purchase orders not exceeding$100,000 and (b) subcontracts or purchase orders for public utility services at rates established foruniform applicability to the general public."}, {"url": "http://www.cey.ca/library/consultingfees.pdf", "passage_text": "The difference relates to the costs of doing business, and it will vary from one firm to another with time, specialty, and employees. The numbers are fairly typical, but could vary by 20% or more. The employee is assumed to be paid $35/hour for 37.5 hours/week (ie the monthly salary is 35 x 37.5 x 52 ¸ 12 = $5,687.50)."}, {"url": "http://www.careercornerstone.org/pdf/aerospace/aeroeng.pdf", "passage_text": "The lowest 10% earned $59,610. The highest 10% earned $124,550. In terms of starting salaries, the average starting salary for aerospace engineers who have earned a Bachelor's degree is $53,408, while those with a Master's were offered $62,459."}]