[{"url": "http://info.nimblestorage.com/rs/nimblestorage/images/nimble-storage-sb-cisco-vmware-vdi.pdf", "passage_text": "VMware View Manager leverages these architecture to streamline the provisioning and deployment of new virtual desktops. Get Started Today As partners, Cisco, Nimble Storage, and VMware have created a complete validated solution for midsized VDI deployments that is cost effective and easy to manage. This joint. solution takes the guesswork out of VDI planning and validation, helping midsized organi-. zations accelerate the move to a virtual desktop environment. ®. delivers a cost-effective, validated datacenter platform for VDI to help midsized IT organization tackle these issues. This joint solution can be quickly deployed, is easy to manage, and delivers the perfor-. mance and capacity that customers require."}, {"url": "http://searchdatacenter.techtarget.com/tip/Using-virtualization-for-cost-effective-servers", "passage_text": "Virtualization converts each application and operating system to a unique virtual instance or virtual machine (VM) while disconnecting the instance from the underlying server hardware, drivers and other elements that traditionally tied hardware and software together. Optimizing hardware for cost-effective server utilization. Cost-effectiveness often means getting more utilization from server hardware, but this requires insight about each server's hardware, the ways that hardware is utilized by each VM and the underlying operating system hypervisor."}, {"url": "http://searchdatacenter.techtarget.com/tip/Using-virtualization-for-cost-effective-servers", "passage_text": "Conversely, it may be more cost-effective to allocate the upgrade cost toward a new server. A new server is certainly more expensive than upgrade components, and the labor needed to install and configure a new server can be substantial. Optimizing hardware for cost-effective server utilization. Cost-effectiveness often means getting more utilization from server hardware, but this requires insight about each server's hardware, the ways that hardware is utilized by each VM and the underlying operating system hypervisor."}, {"url": "http://info.nimblestorage.com/rs/nimblestorage/images/nimble-storage-sb-cisco-vmware-vdi.pdf", "passage_text": "This move also enables midsized organi-zations with limited staff and tight IT budgets to deploy virtual desktop infrastructure (VDI) in the most cost-effective and simplest manner possible. When executed correctly, desktop virtualization can provide compelling benefits — both economic and operational. ®. delivers a cost-effective, validated datacenter platform for VDI to help midsized IT organization tackle these issues. This joint solution can be quickly deployed, is easy to manage, and delivers the perfor-. mance and capacity that customers require."}, {"url": "http://searchvmware.techtarget.com/Virtualization-benefits-are-worth-the-extra-cost-over-physical-servers-alone", "passage_text": "The total cost for this server to be used as a virtual host is $9,548; to add virtualization software to this server costs nothing if you use the free edition of ESXi. This gives us a host with 8 processor cores, 32 GB of memory, 1 TB of disk and 6 network interface cards (NICs). So if we chose the no failover route the cost comparison between eight physical servers and one virtual host is $9,080 vs. $9,548. Now this is a pure hardware cost comparison and doesn't take into account the many advantages that virtualization provides in features and energy savings."}, {"url": "http://www-01.ibm.com/common/ssi/ShowDoc.wss?docURL=/common/ssi/rep_ca/1/897/ENUS215-261/index.html&lang=en", "passage_text": "KVM for IBM z is an open virtualization solution offered for z Systems servers that will provide simple, robust, cost-effective server virtualization for Linux workloads running on the z Systems platform. "}, {"url": "https://en.wikipedia.org/wiki/Virtualization", "passage_text": "In computing, virtualization refers to the act of creating a virtual (rather than actual) version of something, including virtual computer hardware platforms, operating systems, storage devices, and computer network resources. Hardware virtualization or platform virtualization refers to the creation of a virtual machine that acts like a real computer with an operating system. Software executed on these virtual machines is separated from the underlying hardware"}, {"url": "http://www.vmware.com/pdf/vi_intel_vmware.pdf", "passage_text": "Network interface cards provide a dedicated, full-time network connection for enterprise desktop PCs or servers. Virtual infrastructure is the basis for flexible, scalable and low-cost enterprise IT that has the capability to respond immediately to changing business needs. However, to take greatest advantage of the benefits of virtualization, IT organizations require a critical infrastructure element that is designed to ensure reliability and improve performance: multiport network interface cards (NICs)."}, {"url": "http://www.dell.com/learn/us/en/vn/secure/2014-02-10-dell-wyse-cloud-client-desktop-virtualization", "passage_text": "1 New solution provides a single, cost-effective virtual desktop deployment on Microsoft Windows Server 2012 R2 with Hyper-V. 2  Integration of Dell Wyse Datacenter for Microsoft VDI and vWorkspace delivers fast and flexible deployment of 10 to 35,000+ virtual desktops. "}, {"url": "http://searchdatacenter.techtarget.com/tip/Using-virtualization-for-cost-effective-servers", "passage_text": "Because virtualization potentially supports several VMs on a given server, use of the server's computing resources is significantly higher. It's not uncommon to find a virtual server using 50% or more of its computing resources. The cost benefits of virtualization are well understood: There are simply fewer servers, and each virtualized server can perform more business work per dollar spent on hardware, power, cooling, management and maintenance. Optimizing hardware for cost-effective server utilization. Cost-effectiveness often means getting more utilization from server hardware, but this requires insight about each server's hardware, the ways that hardware is utilized by each VM and the underlying operating system hypervisor."}]