[{"url": "http://globerove.com/canada/canadian-goose-egg/2805", "passage_text": "The Canadian goose breeds once a year and females start laying eggs during the first week of March and may continue till as late as June in some parts of the Arctic region. Every season a Canadian Goose may lay anywhere from 2 to 9 eggs which average out to five eggs per bird. The Canadian Goose egg takes approximately 23 to 30 days to hatch and 68 to 78 days is the time to fledging. The gosling will reach reproductive maturity by the age of one year on average regardless of whether it is a male or female."}, {"url": "http://wdfw.wa.gov/living/canada_geese.html", "passage_text": "If the nest or eggs are destroyed, geese often re-nest in or near the first nest. Canada geese can raise one clutch per year. Longevity and Mortality Predators of Canada geese and their eggs include humans, coyotes, raccoons, skunks, bobcats, and foxes, as well as gulls, eagles, crows, ravens, and magpies. Canada geese hatched in urban environments may have very low first-year mortalities due to the abundance of food and relative scarcity of natural predators. Canada geese can live more than 20 years in captivity; in the wild they have a much shorter life span."}, {"url": "http://www.answers.com/Q/How_many_eggs_will_a_goose_lay_in_one_day", "passage_text": "Confidence votes 6.4K. That depends on the breed/species. Most domestic geese can lay 1 egg every 1.5 days. She will continue laying until she goes broody (will sit on the eggs to incubate them), if she is inclined to do so-some breeds are not good sitters. "}, {"url": "http://www.backyardchickens.com/t/450553/how-often-do-they-lay-goose-eggs", "passage_text": "My geese generally lay 1 egg every couple days, had some hens that layed an egg daily too. They will start setting on the eggs when they feel they have enough in the nest(for my girls thats about 18 eggs) then they will go broody on them. By the sounds of it you have 2 hens. Boothcreek Ranch. They don't spread as much as chicken eggs. A fresh goose egg is likely to be more than 1 thick at the yoak when fried. Baking is one of the places they are good, better than chicken eggs, All that protein will hold a huge amount of air when it is beaten in."}, {"url": "https://en.wikipedia.org/wiki/Canada_goose", "passage_text": "The Canada goose (Branta canadensis) is a large wild goose species with a black head and neck, white patches on the face, and a brown body. Native to arctic and temperate regions of North America, its migration occasionally reaches northern Europe. "}, {"url": "http://www.backyardchickens.com/t/553464/how-often-do-geese-lay", "passage_text": "Hi there. Yes geese are usually seasonal layers usually from March to May. Once they lay their eggs and then incubate then that can be it. Some will re-clutch if the nest fails. With our Dewlaps we leave an egg in the nest to encourage laying and females can lay between 12 to 30 depending on age and bloodline. By June many geese have started the moult and this usually indicates and end to the egg laying season. My goose lays every other day and this year she didn't set until she had collected 9 eggs. Goose eggs are delicious, but you don't keep geese as egg producers for the family table. They just don't lay enough."}, {"url": "http://preservewildlife.com/geeseworld.htm", "passage_text": "Females lay 2-9 dull white oval eggs in each clutch (a set of eggs laid at one time. Canada geese lay 1 egg every 1 to 2 days; the eggs are usually laid early in the morning. Incubation takes an average of 28 days, with the female sitting on the eggs and the male guarding the area around the goose. There are two subspecies, the Branta Canadensis Interiori (interior Canada goose), and the Branta Canadensis Maxima (giant Canada goose). The Interior Canada goose may weigh from 7-10 pounds, and is shorter and a little more slender than the giant Canada goose. The giant Canada goose may weigh up to 15-20 pounds"}, {"url": "http://www.backyardchickens.com/t/450553/how-often-do-they-lay-goose-eggs", "passage_text": "The one draw back is that you need to adjust your recipies. a Large chicken egg should weigh 2 ounces, my smaller goose eggs are about 6 ounces (3 chicken=1 goose egg) Some of the big goose eggs are more like 8 ounces plus you often have to add extra liquid because goose eggs are dryer than chicken eggs. Good Luck!~gd. They don't spread as much as chicken eggs. A fresh goose egg is likely to be more than 1 thick at the yoak when fried. Baking is one of the places they are good, better than chicken eggs, All that protein will hold a huge amount of air when it is beaten in."}, {"url": "http://about.lovecanadageese.com/nest.html", "passage_text": "The eggs could have been laid by an immature goose who wasn't ready to have a nest this year. A Canada goose egg is about three times the size of a chicken egg and weighs about 5 ounces. Nests are spaced about 30-50 feet from each other and ganders patrol their territory, seldom venturing into other gander territories. The most agressive ganders maintain the largest territories. "}]