[{"url": "http://www.caffeineinformer.com/caffeine-metabolism", "passage_text": "Advertisement. It only takes 45 minutes for 99% of the caffeine to be absorbed through these membranes. In humans the half-life for caffeine is anywhere from 4 to 6 hours on average, which explains why the average energy drink or coffee’s effect lasts about 4 to 6 hours."}, {"url": "http://www.dotfit.com/content-35789.html", "passage_text": "Print Version. The half-life, which is the time required by the body to metabolize or inactivate 1/2 of a substance activity, for caffeine (doses lower than 4.50mg/lb) ranges from 2.5 to 10hrs. Meaning, caffeine has little to no pharmacological effect after this time but may still be present in small amounts in the body. The variability in rates of elimination is due to an individual’s efficiency in metabolizing caffeine, not absorption. The modern average cup (8oz) of coffee may contain 100-200mgs of caffeine so its effects should be inactivated within 2-5hrs depending on individuality. But it may take the full day to eliminate all traces of caffeine from the body"}, {"url": "http://www.med-health.net/How-Long-Does-Caffeine-Last.html", "passage_text": "How Long Does Caffeine Stay in the Body? In most cases, caffeine has a half-life of about 5 hours (meaning 5 hours is needed to eliminate half the coffee amount). However, it might take longer – for instance, a pregnant woman might have caffeine in her system up to 20 hours after she ingests it. Pregnant women need to consume less caffeine for the sake of the baby. Between 150 and 200 milligrams is considered safe in most studies, but many doctors recommend pregnant women avoid caffeine altogether. That’s because no matter how long caffeine stays in the body of the mother, it might stay even longer in the baby."}, {"url": "http://boards.straightdope.com/sdmb/archive/index.php/t-330963.html", "passage_text": "On a serious note, The half-life of caffeine in your body is about 6 hours. That means that if you consume a big cup of coffee with 200 mg of caffeine in it at 3:00 PM, by 9:00 PM about 100 mg of that caffeine is still in your system. Studies reveal that peak plasma levels of caffeine occur from 15 to 60 minutes after ingestion. Studies on the optimal time of pre-event loading for ergogenesis also ranged from 15 to 60 minutes. Blood half-life of caffeine was as low as two and as high as seven hours in the literature I reviewed."}, {"url": "http://neutral-izer.blogspot.com/2007/09/how-long-does-caffeine-stay-in-your.html", "passage_text": "As long as caffeine is in your blood, it's effects will also manifest. The time it takes for the body to eliminate one half of a caffeine dose is normally between 3 to 12 hours. It is called the half-life of caffeine. Several factors can shorten or lengthen the half life of caffeine. Smoking, medications and diseases are some factors."}, {"url": "https://au.answers.yahoo.com/question/index?qid=20070729154045AAJmYPX", "passage_text": "Women on oral contraceptives, women who are pregnant, and anyone with liver disease will take even longer to digest caffeine. In pregnant women, the half-life of caffeine is nine to eleven hours, meaning that the drug will stay in a pregnant woman’s body for nearly one full day. Source(s): http://www.professorshouse.com/food-beve... Clare · 8 years ago."}, {"url": "http://www.livestrong.com/article/272782-how-long-does-coffee-caffeine-stay-in-your-system/", "passage_text": "Onset and Duration. It takes approximately 15 to 45 minutes for caffeine to reach its peak levels in your bloodstream. Caffeine has a half-life of approximately five to six hours, meaning that it takes this long for its concentration in your bloodstream to reduce by half. "}, {"url": "https://www.sharecare.com/health/coffee-drink-health/take-caffeine-leave-your-system", "passage_text": "The half-life, which is the time required by the body to metabolize or inactivate 1/2 of a substance activity, for caffeine (doses lower than 4.50mg/lb) ranges from 2.5 to 10hrs. Meaning, caffeine has little to no pharmacological effect after this time but may still be present in small amounts in the body. "}, {"url": "http://www.just-health.net/How-Long-Does-Caffeine-Last.html", "passage_text": "The half-life of caffeine, which refers to the time needed to eliminate half amount of caffeine out of the body, depends on many other factors such as age, body condition, liver function, etc. 1  In healthy adults, the half-life of caffeine is 4.9 hours. 2  In pregnant women, the half-life is 9-11 hours. 1 In pregnant women, the half-life is 9-11 hours. 2  In infants as well as young kids, the half-life of caffeine is longer than the adults, about 30 hours. 3  Patients with severe liver disease, caffeine may accumulate in the liver with the half-life up to about 96 hours."}]