[{"url": "https://en.wikipedia.org/wiki/Sedimentary_rock", "passage_text": "Sedimentary rocks are types of rock that are formed by the deposition of material at the Earth 's surface and within bodies of water. The sedimentary rock cover of the continents of the Earth's crust is extensive, but the total contribution of sedimentary rocks is estimated to be only 8% of the total volume of the crust. Sedimentary rocks are only a thin veneer over a crust consisting mainly of igneous and metamorphic rocks."}, {"url": "http://volcano.oregonstate.edu/book/export/html/1056", "passage_text": "Clastic sedimentary rocks are made of pieces of rock or mineral grains that have been broken from preexisting rock. These particles and grains have become solid rock by the processes of compaction or cementation of sediments. A sedimentary rock is a layered rock that is formed from the compaction, cementation, and the recrystallization of sediments. Compaction is the squeezing together of layers of sediment due to the great weight of overlying layers of rock."}, {"url": "http://www.answers.com/Q/What_type_of_rock_can_be_the_source_of_deposited_sediments", "passage_text": "Rock sediments are deposited at the bottom of a body of water, such  as a river or lake. When the flow of water changes direction, the  sediment has different momentum, so i … t does not change direction as  fast, and it will collide with the river bank and then settle. All forms of rock can weather and form sediment that is carried by water, wind or glaciers. Some just break down more easily than others. Example One is fine grained igneous b … asalt (lava) that is very difficult to break down."}, {"url": "https://en.wikipedia.org/wiki/Sedimentary_rock", "passage_text": "Sedimentary rocks are formed when sediment is deposited out of air, ice, wind, gravity, or water flows carrying the particles in suspension. This sediment is often formed when weathering and erosion break down a rock into loose material in a source area. The material is then transported from the source area to the deposition area. The type of sediment transported depends on the geology of the hinterland (the source area of the sediment). The sedimentary rock cover of the continents of the Earth's crust is extensive, but the total contribution of sedimentary rocks is estimated to be only 8% of the total volume of the crust. Sedimentary rocks are only a thin veneer over a crust consisting mainly of igneous and metamorphic rocks."}, {"url": "https://en.wikipedia.org/wiki/Sedimentary_rock", "passage_text": "Particles that form a sedimentary rock by accumulating are called sediment. Before being deposited, sediment was formed by weathering and erosion in a source area, and then transported to the place of deposition by water, wind, ice, mass movement or glaciers which are called agents of denudation. The sedimentary rock cover of the continents of the Earth's crust is extensive, but the total contribution of sedimentary rocks is estimated to be only 8% of the total volume of the crust. Sedimentary rocks are only a thin veneer over a crust consisting mainly of igneous and metamorphic rocks."}, {"url": "http://www.tulane.edu/~sanelson/eens1110/sedrx.htm", "passage_text": "The formation of a clastic sediment and sedimentary rocks involves five processes: 1  Weathering-The first step is transforming solid rock into smaller fragments or dissolved ions by physical and chemical weathering as discussed in the last lecture. Such material, called detritus, consists of fragments of rocks and minerals. When the energy of the transporting current is not strong enough to carry these particles, the particles drop out in the process of sedimentation. This type of sedimentary deposition is referred to as clastic"}, {"url": "http://www.honolulu.hawaii.edu/instruct/natsci/geology/brill/gg101/Programs/program21%20SedimentaryRocks/program21.html", "passage_text": "Most of these sediments, which become continental sedimentary rocks are deposited in shallow seas, either on the continents or on the continental shelf and then uplifted above sea level by tectonic processes; in fact, it's fairly rare to find really deep sea sediments uplifted in mountain ranges. "}, {"url": "http://volcano.oregonstate.edu/book/export/html/1056", "passage_text": "Sedimentary rocks are formed in three ways from these different sized sediments. A sedimentary rock is a layered rock that is formed from the compaction, cementation, and the recrystallization of sediments. Compaction is the squeezing together of layers of sediment due to the great weight of overlying layers of rock."}, {"url": "http://www.tulane.edu/~sanelson/eens1110/sedrx.htm", "passage_text": "Diagenesis. LIthification of sediment into sedimentary rocks takes place after the sediment has been deposited and buried. The processes by which the sediment becomes lithified into a hard sedimentary rock is called diagenesis and includes all physical, chemical and biological processes that act on the sediment. Such material, called detritus, consists of fragments of rocks and minerals. When the energy of the transporting current is not strong enough to carry these particles, the particles drop out in the process of sedimentation. This type of sedimentary deposition is referred to as clastic"}]