[{"url": "https://en.wikipedia.org/wiki/Joe_Oliver_(politician)", "passage_text": "Early life and career [edit]. Oliver was born and raised in Montreal, Quebec, to a Jewish family. His father was a dentist and his mother was a teacher. He grew up attending Congregation Shaar Hashomayim. He is currently married to Golda Goldman and has two sons, David and Jeffrey. Oliver received a Bachelor of Arts degree in 1961 and a Bachelor of Civil Law degree in 1964 from McGill Universit"}, {"url": "http://www.youtube.com/watch?v=Gc_19GBn59E", "passage_text": "Armstrong called Oliver Papa Joe and referred to Oliver as his idol and inspiration all his life. In Armstrong's autobiography, Satchmo-My Life in New Orleans, he writes about Oliver: It was my ambition to play as he did. I still think that if it had not been for Joe Oliver, Jazz would not be what it is today. He was a creator in his own right.. King Oliver and his Dixie Syncopaters-West End Blues (1928)."}, {"url": "http://www.ebay.com/sch/i.html?_nkw=Joe+Oliver", "passage_text": "Related: joe oliver reds ruben sierra joe oliver baseball pedro beato lloyd mcclendon 1991 mark mcgwire dmitri young tucker barnhart wade boggs. Follow Joe Oliver to get e-mail alerts and updates on your eBay Feed. Unfollow Joe Oliver to stop getting updates on your eBay Feed. Yay! You're now following Joe Oliver i"}, {"url": "https://en.wikipedia.org/wiki/King_Oliver", "passage_text": "Not to be confused with Oliver King. Joseph Nathan Oliver (December 19, 1881 – April 10, 1938) better known as King Oliver or Joe Oliver, was an American jazz cornet player and bandleader. He was particularly recognized for his playing style and his pioneering use of mutes in jazz. In the summer of 1921 he took a group to the West Coast, playing engagements in San Francisco and Oakland, California. In 1922 Oliver and his band returned to Chicago, where they began performing as King Oliver and his Creole Jazz Band at the Royal Gardens cabaret (later renamed the Lincoln Gardens)."}, {"url": "http://www.youtube.com/watch?v=Gc_19GBn59E", "passage_text": "He was the mentor and teacher of Louis Armstrong. Two of Armstrong's most famous recordings, West End Blues and Weather Bird, were Oliver compositions. His influence was such that Armstrong claimed, if it had not been for Joe Oliver, Jazz would not be what it is today. Joseph Oliver was born in Aben, Louisiana, near Donaldsonville in Ascension Parish, and moved to New Orleans in his youth. In Armstrong's autobiography, Satchmo-My Life in New Orleans, he writes about Oliver: It was my ambition to play as he did. I still think that if it had not been for Joe Oliver, Jazz would not be what it is today. He was a creator in his own right.. King Oliver and his Dixie Syncopaters-West End Blues (1928)."}, {"url": "https://en.wikipedia.org/wiki/Joe_Oliver_(politician)", "passage_text": "On May 18, 2011, Oliver was sworn in as the Minister of Natural Resources. In June 2011, Oliver repeated Harper's campaign promise to support Quebec's asbestos industry, by claiming that chrysotile asbestos, a carcinogen, could be used safely. His father was a dentist and his mother was a teacher. He grew up attending Congregation Shaar Hashomayim. He is currently married to Golda Goldman and has two sons, David and Jeffrey."}, {"url": "http://redhotjazz.com/kingo.html", "passage_text": "Joe Oliver is one of the most important figures in early Jazz. When we use the phrase Hot Jazz, we are really referring to his style of collective improvisation (rather than solos). He was the mentor and teacher of Louis Armstrong. Louis idolized him and called him Papa Joe. Oliver even gave Armstrong the first cornet that Louis was to own. Oliver was blinded in one eye as a child, and often played while sitting in a chair, or leaning against the wall, with a derby hat tilted so that it hid his bad eye"}, {"url": "https://www.facebook.com/MinJoeOliver", "passage_text": "Joe Oliver added 3 new photos. 21 hrs ·. Delighted to celebrate the Philippine Canadian Charitable Foundation (PCCF)'s 5th Annual Gala with Maureen Harquail for Don Valley East, John Carmichael, Ravinder Malhi for Scarborough North, Jobson Easow, and Senator Tobias Enverga. Joe Oliver. September 15 at 7:14am ·. I am proud that, under the leadership of Prime Minister Stephen Harper, Canada balanced its budget last year, one year ahead of schedule, with a $1.9 billion surplus. That is $3.9 billion higher than anticipated in Budget 2015, mainly due to increased revenues"}, {"url": "http://thegrio.com/2012/04/04/joe-oliver-george-zimmermans-friend-no-longer-his-media-advisor/", "passage_text": "Joe Oliver, who made a media splash as the friend who stepped forward to support George Zimmerman, has stepped down as Zimmerman’s media adviser. Oliver said he has known Zimmerman since the 28 year old began dating his now-wife, whose mother is friends with Oliver’s wife. In his initial television appearances, including on MSNBC, he was introduced as a friend, not a media adviser, though Oliver insists he made his role clear from the start."}]