[{"url": "http://www.dol.gov/whd/regs/compliance/whdfs6.pdf", "passage_text": "Overtime pay at a rate not less than. one and one-half times the employee's regular rate of pay is required after 40 hours are worked in a workweek. Certain retail or service employees paid by commissions may be exempt from overtime pay."}, {"url": "http://www.lni.wa.gov/WorkplaceRights/files/policies/esa101.pdf", "passage_text": "an exception to the payment of overtime for hours in excess of 40 in a week to certain. commissioned employees of retail sales or service establishments. How to determine who is covered by the retail and service establishment overtime exception."}, {"url": "http://www.hrhero.com/hl/articles/2008/01/25/retail-sales-exemption-to-federal-wage-law/", "passage_text": "Whether an employer qualifies as a “retail or service establishment” eligible for the exemption is a factual inquiry. The regulations interpreting the FLSA provide a partial list of establishments whose sales or services may be recognized as retail."}, {"url": "http://www.americanbar.org/content/dam/aba/administrative/labor_law/meetings/2009/ac2009/171.pdf", "passage_text": "Retail or Service EstablishmentsSection 7(i) does not define the term “retail or service establishment”—instead, the courtsand the DOL have relied on the definition of “retail or service establishment” contained in thenow repealed Section 13(a)(2) to construe the scope of Section 7(i)."}, {"url": "http://www.hrhero.com/hl/articles/2008/01/25/retail-sales-exemption-to-federal-wage-law/", "passage_text": "Exemption criteria The Fair Labor Standards Act (FLSA) , the federal law governing overtime, contains a provision exempting certain retail or service establishments from paying overtime. Specifically, a retail or service establishment need not pay overtime to an employee if:"}, {"url": "http://www.americanbar.org/content/dam/aba/administrative/labor_law/meetings/2009/ac2009/171.pdf", "passage_text": "Before its repeal in 1989,Section 13(a)(2) of the FLSA exempted employees of “retail or service establishment[s]” fromthe Act’s minimum wage and overtime pay requirements. Despite the repeal of Section 13(a)(2),the regulations that interpret the “retail or service establishment” exemption have remained inplace."}, {"url": "http://hr.complianceexpert.com/federal-agency-documents/wage-hour-guidance/flsa-field-operations-handbook/chapter-21-retail-or-service-establishment-exemptions-from-secs-6-and-7?qr=1", "passage_text": "(c) In any case where a florist’s establishment meets the statutory definition of a “retail or service establishment” and is not part of a covered enterprise, it is still necessary to determine for purposes of the Sec 13(a)(2) exemption whether more than 50% of the establishment’s ADV of sales is made within the State."}, {"url": "http://www.lni.wa.gov/WorkplaceRights/files/policies/esa101.pdf", "passage_text": "Definition of “retail or service establishment.” Retail and service establishments are defined as establishments where 75 percent of the annual dollar volume of sales of goods or services (or of both) is not for resale and is recognized as retail sales or services in the particular industry."}, {"url": "http://www.jacksonlewis.com/resources-publication/new-york-court-expands-retail-or-service-establishment-commissioned-sales-overtime-exemption", "passage_text": "The regulations define a retail or service establishment as one in which 75% of annual dollar volume of sales is not for resale, and the establishment is recognized as a retail sales or services company within a particular industry. The regulations further define this establishment as:"}]