[{"url": "http://www.wikihow.com/Use-Uber", "passage_text": "All fare payments are handled automatically by the Uber service and your credit card on file. If using the TAXI service, you can select the amount to be tipped through your Uber Payment Settings-the default is 20%. You do not need to tip the other Uber services, including UberX, but tips are appreciated."}, {"url": "http://www.idrivewithuber.com/how-to-become-an-uber-driver/", "passage_text": "I make between $15 and $25 an hour after Uber’s commission, taxes, fuel, and other car expenses. Read the full post about how much money I make driving for Uber. There are a few things you can do to maximize your earnings."}, {"url": "http://therideshareguy.com/questions/documents-still-pending/", "passage_text": "It sounds like either you haven’t submitted your inspection receipt or Uber seems to have not verified it yet. If it’s the latter, then I suggest e-mailing your local Uber partner support team about the issue and they should be able to get it resolved pretty quickly."}, {"url": "http://uber-partners-static.s3.amazonaws.com/chicago_uberx/faq.html", "passage_text": "Uber's system is designed to be as flexible for you as possible. The system is available 24/7 and you are welcome to drive as much or as little as your schedule allows. We only ask that you make sure to complete at least 1 trip every 2-3 weeks."}, {"url": "http://www.wikihow.com/Use-Uber", "passage_text": "1 The Uber app will provide you with the phone number of your driver. 2  You can use this contact the driver if you have any special considerations. 3  If you need to cancel your reservation, you will be charged a $5-$10 fee if you cancel after five minutes. 4  Average pickup times vary by city, time, and amount of business."}, {"url": "http://uber-partners-static.s3.amazonaws.com/chicago_uberx/faq.html", "passage_text": "Users tend to rate drivers lower if they have been contacted multiple times during a trip request. If you have arrived at the pickup location and have not seen the customer after 1 to 2 minutes, it is then a good idea to call the customer to make sure they are aware of your arrival."}, {"url": "http://www.wikihow.com/Use-Uber", "passage_text": "Uber charges are based on a combination of time and distance. If the car is travelling under 11 mph (18 km/h), you will be charged by the minute, and if you are travelling over 11 mph (18 km/h), you will be charged by the mile. You will also have to pay a base rate, that varies by location."}, {"url": "http://uber-partners-static.s3.amazonaws.com/chicago_uberx/faq.html", "passage_text": "We suggest that drivers wait for users for at least 5 minutes after arriving at the trip starting point. After the 5 minute free waiting period, a user can ask a driver to continue waiting. After the user have given you permission, you may hit begin trip and the user will start to get charged for the fare."}, {"url": "http://hyrecar.com/driver-faq", "passage_text": "Ride sharing, specially Uber and Lyft are a booming industry. Our average driver makes around $200-$400 per day depending on how they driver and in which city they drive. Uber and Lyft also claim that their driver can make upto $1500 per week in gross earnings."}]