[{"url": "http://www.travelmath.com/time-change/from/Hawaii/to/New+York", "passage_text": "Meeting planner for Hawaii (HI) and New York (NY). To schedule a conference call or plan a meeting at the best time for both parties, you should try between 9:00 AM and 11:00 AM your time in Hawaii. That will end up being between 3:00 PM and 5:00 PM in New York."}, {"url": "http://www.travelmath.com/time-change/from/Hawaii/to/West+Virginia", "passage_text": "Meeting planner for Hawaii (HI) and West Virginia (WV). To schedule a conference call or plan a meeting at the best time for both parties, you should try between 9:00 AM and 11:00 AM your time in Hawaii. That will end up being between 3:00 PM and 5:00 PM in West Virginia. The chart on the right shows overlapping times."}, {"url": "https://answers.yahoo.com/question/index?qid=20061015140533AAg3KsZ", "passage_text": "Hawaii is 2 hours behind PST (Pacific Standard Time) and 4 hours behind EST (Eastern Standard Time). As I write this answer, the current time in Virginia would be 5:44PM and it is currently 11:44 AM in Hawaii."}, {"url": "http://www.answers.com/Q/What_is_the_time_zone_difference_between_EST_and_Hawaii_time", "passage_text": "There is a 5 hour time zone difference between EST and HST. Eastern time is ahead of Hawaiian time. US Eastern Standard Time = GMT -5 = UTC -5 = Military time zone R (Romeo). US Hawaii-Aleutian Standard Time = GMT -10 = UTC -10 = Military time zone W (Whiskey). Example:"}, {"url": "http://www.travelmath.com/time-change/from/Hawaii/to/New+York", "passage_text": "This will be between 7AM - 11PM their time, since New York (NY) is 6 hours ahead of Hawaii (HI). If you're available any time, but you want to reach someone in New York at work, you may want to try between 3:00 AM and 11:00 AM your time. This is the best time to reach them from 9AM - 5PM during normal working hours."}, {"url": "https://answers.yahoo.com/question/index?qid=20090125073012AAdTFuJ", "passage_text": "Best Answer: Juraj, You are getting confusing answers because the time difference between Massachusetts and Hawaii is different from winter to summer. The reason is that Hawaii does not observe Daylight Saving Time. In the winter (now) there is a 5 hour time difference. If it is 3:00 pm Eastern Standard Time in Boston then it will be 10:00 am Hawaii Standard Time in Honolulu. In the summer after the time changes there is a 6"}]