[{"url": "http://www.lhsc.on.ca/Patients_Families_Visitors/Blood_Conservation_Program/Alternatives/EPO.htm", "passage_text": "Eprex must be kept refrigerated. Make sure it doesn’t freeze. If you need to take your Eprex with you, carry it in a cooler with an ice pack. Eprex needs to be at room temperature for 10 to 15 minutes before the needle is given to you. If Eprex is at room temperature for longer than 60 minutes, it should not be used. Eprex should not be shaken. Eprex is a clear liquid given to patients by a needle under the skin. The most common dose is one needle per week for 2 to 4 weeks before your operation. The patient blood management nurse at LHSC or your family doctor’s office can give you the Eprex needles, depending on what is easiest for you."}, {"url": "http://www.rexall.ca/articles/view/1054/Eprex", "passage_text": "Eprex® is synthetic erythropoietin (epoetin alfa) and is used to replace the erythropoietin that is lacking in people who can't make enough, usually because their kidneys are not working properly. Epoetin alfa is used to treat anemia in people with chronic kidney disease (CKD), whether or not they are on dialysis. If you experience symptoms such as sharp pain and swelling in the leg, or difficulty breathing, contact your doctor immediately. Cancer: Epoetin alfa is used to treat anemia caused by chemotherapy treatment of non-myeloid cancers. It is not used to treat anemia that is due to the cancer itself."}, {"url": "http://www.nps.org.au/medicines/hormonal-and-metabolic-system/red-blood-cell-production-medicines/epoetin-alfa-rch/eprex-solution-for-injection", "passage_text": "EPREX is used to treat the anaemia associated with kidney disease. If you have kidney disease, your kidney may not produce enough erythropoietin (necessary for red blood cell production) and your doctor may wish to correct this by prescribing EPREX. Do not use EPREX: 1  If you have an allergy to EPREX or any of the ingredients. 2  See Product Description at the end of this leaflet for a list of ingredients. 3  If you have high blood pressure that is not properly controlled with blood pressure-lowering drugs."}, {"url": "http://www.news-medical.net/drugs/Eprex.aspx", "passage_text": "If you have kidney disease, your kidney may not produce enough erythropoietin (necessary for red blood cell production) and your doctor may wish to correct this by prescribing EPREX. This medicine stimulates your bone marrow to produce more red blood cells, helping to treat your anaemia. EPREX can be used as an alternative to a blood transfusion in adult patients about to undergo major orthopaedic (bone) surgery where there is a potentially high risk from blood transfusion complications. EPREX is not addictive."}, {"url": "http://www.news-medical.net/drugs/Eprex.aspx", "passage_text": "EPREX prefilled syringes contain the active ingredient epoetin alfa, a protein that stimulates bone marrow to produce more red blood cells. Red blood cells are responsible for carrying oxygen to all parts of your body. A decrease in the number of red blood cells can cause anaemia. EPREX can be used as an alternative to a blood transfusion in adult patients about to undergo major orthopaedic (bone) surgery where there is a potentially high risk from blood transfusion complications. EPREX is not addictive."}, {"url": "http://www.news-medical.net/drugs/Eprex.aspx", "passage_text": "EPREX can also be used to treat anaemia and reduce the need for a blood transfusion if you are receiving chemotherapy for cancer and your doctor decides you may need a blood transfusion. EPREX can be used as an alternative to a blood transfusion in adult patients about to undergo major orthopaedic (bone) surgery where there is a potentially high risk from blood transfusion complications. EPREX is not addictive."}, {"url": "http://mcs.open.ac.uk/nlg/old_projects/pills/corpus/PIL/data/JanssenCilag/Eprex/Eprex.html", "passage_text": "Eprex is used to treat the anaemia associated with kidney disease. If you have kidney disease, your kidney may not produce enough erythropoietin (necessary for red cell production) and your doctor may wish to correct this by prescribing Eprex. At the start of your therapy, Eprex may be injected by medical or nursing staff. However, your doctor may decide that it is right for you to learn how to inject Eprex under the skin (subcutaneously) yourself. You will receive appropriate training for you to do this."}, {"url": "http://www.medsafe.govt.nz/consumers/cmi/e/Eprex.pdf", "passage_text": "It is important that you read this. leaflet. Keep this leaflet with your medicine. What EPREX is used. for. EPREX prefilled syringes contain the. active ingredient epoetin alfa, a. protein that stimulates bone marrow. to produce more red blood cells. Red blood cells are responsible for. carrying oxygen to all parts of your. body. A decrease in the number of. red blood cells can cause anaemia."}, {"url": "http://www.nps.org.au/medicines/hormonal-and-metabolic-system/red-blood-cell-production-medicines/epoetin-alfa-rch/eprex-solution-for-injection", "passage_text": "What EPREX is used for. EPREX prefilled syringes contain the active ingredient epoetin alfa, a protein that stimulates bone marrow to produce more red blood cells. Red blood cells are responsible for carrying oxygen to all parts of your body. A decrease in the number of red blood cells can cause anaemia. Do not use EPREX: 1  If you have an allergy to EPREX or any of the ingredients. 2  See Product Description at the end of this leaflet for a list of ingredients. 3  If you have high blood pressure that is not properly controlled with blood pressure-lowering drugs."}]