[{"url": "http://kingencyclopedia.stanford.edu/encyclopedia/encyclopedia/enc_student_nonviolent_coordinating_committee_sncc/", "passage_text": "The Student Nonviolent Coordinating Committee (SNCC) was founded in April 1960, by young people who had emerged as leaders of the sit-in protest movement initiated on February 1 of that year by four black college students in Greensboro, North Carolina."}, {"url": "http://www.history.com/topics/black-history/sncc", "passage_text": "A+E Networks. The Student Non-Violent Coordinating Committee (SNCC), formed to give younger blacks more of a voice in the civil rights movement, became one of the movement’s more radical branches."}, {"url": "http://www.answers.com/Q/What_was_the_purpose_of_SNCC_during_the_early_years_of_the_Civil_Rights_era", "passage_text": "Student Nonviolent Coordinating Committee-Mostly made up or College Students, trying to speed up the process of Civil Rights Changes. African Americans would SIT in protest (… called sit-ins) at restaurants and other Stores, forcing them to desegregate."}, {"url": "http://www.history.com/topics/black-history/sncc", "passage_text": "Introduction. The Student Non-Violent Coordinating Committee (SNCC), formed to give younger blacks more of a voice in the civil rights movement, became one of the movement’s more radical branches."}, {"url": "http://www.georgiaencyclopedia.org/articles/history-archaeology/student-nonviolent-coordinating-committee-sncc", "passage_text": "In Georgia SNCC concentrated its efforts in Albany and Atlanta. Freedom Riders. Emerging from the student-led sit-ins to protest segregated lunch counters in Greensboro, North Carolina, and Nashville, Tennessee, SNCC's strategy was much different from that of already established civil rights organizations."}, {"url": "http://www.answers.com/Q/What_was_the_purpose_of_SNCC_during_the_early_years_of_the_Civil_Rights_era", "passage_text": "SNCC or The Student Nonviolent coordinating Committee was  originally formed to give students a voice in the Civil Rights  Movement."}, {"url": "http://kingencyclopedia.stanford.edu/encyclopedia/encyclopedia/enc_student_nonviolent_coordinating_committee_sncc/", "passage_text": "The idea for a locally based, student-run organization was conceived when Ella Baker, a veteran civil rights organizer and an SCLC ofﬁcial, invited black college students who had participated in the early 1960 sit-ins to an April 1960 gathering at Shaw University in Raleigh, North Carolina."}, {"url": "http://www.answers.com/Q/What_was_SNCC_and_what_was_its_purpose", "passage_text": "The purpose of SNCC during the early years of the Civil Rights era  was that it coordinated students around the south in resisting  segregation laws."}, {"url": "http://kingencyclopedia.stanford.edu/encyclopedia/encyclopedia/enc_student_nonviolent_coordinating_committee_sncc/", "passage_text": "SNCC’s emergence as a force in the southern civil rights movement came largely through the involvement of students in the 1961 Freedom Rides, designed to test a 1960 Supreme Court ruling that declared segregation in interstate travel facilities unconstitutional."}, {"url": "http://www.answers.com/Q/What_was_the_purpose_of_SNCC_during_the_early_years_of_the_Civil_Rights_era", "passage_text": "Making the world better, one answer at a time. The purpose of SNCC during the early years of the Civil Rights era was that it coordinated students around the south in resisting segregation laws."}]