[{"url": "http://www.criminaljusticeinformation.com/professions/dea-agent-job-description-salary-and-training", "passage_text": "Education Requirements for DEA. Each position in the DEA has its own criteria for education. The science-based positions usually require a degree or college coursework in chemistry or a related subject. Forensic chemists need a bachelor’s degree or a combination of experience and 30 hours of coursework in chemistry. For a DEA special agent, the starting salary is approximately $49,746 for someone at the GS-7 level and $55,483 for someone at level GS-9. For DEA positions like diversion investigator or forensic chemist, the pay is commensurate on education, previous experience and other skill-based factors."}, {"url": "http://study.com/articles/Become_a_DEA_Agent_Education_and_Career_Roadmap.html", "passage_text": "Research the requirements to become a special agent for the U.S. Drug Enforcement Administration (DEA). Learn about the job description and duties, and read the step-by-step process to start a career as a DEA special agent. View 10 Popular Schools ». Step 4: Complete DEA Basic Agent Training. Newly hired applicants must successfully complete an 18-week Basic Agent Training program to become a special agent. This training is held at a DEA training academy at Quantico, VA. Trainees reside and attend classes at the academy."}, {"url": "http://www.criminaljusticeinformation.com/professions/dea-agent-job-description-salary-and-training", "passage_text": "Special agents for the DEA need to have a bachelor’s, master’s, LL.B. or J.D. degree. A grade point average of at least 2.95 is also required. Applicants with degrees in criminal justice, police science or a related area will get special consideration. For a DEA special agent, the starting salary is approximately $49,746 for someone at the GS-7 level and $55,483 for someone at level GS-9. For DEA positions like diversion investigator or forensic chemist, the pay is commensurate on education, previous experience and other skill-based factors."}, {"url": "http://study.com/articles/Become_a_DEA_Agent_Education_and_Career_Roadmap.html", "passage_text": "The first step for DEA applicants is to attend a special agent applicant orientation at a field division office. The hiring process may take 12 months or longer. Step 4: Complete DEA Basic Agent Training. Newly hired applicants must successfully complete an 18-week Basic Agent Training program to become a special agent. This training is held at a DEA training academy at Quantico, VA. Trainees reside and attend classes at the academy."}, {"url": "http://www.drugenforcementedu.org/", "passage_text": "In order to become a special agent with the DEA, candidates should meet the following minimum requirements: 1  Bachelor’s degree or higher (may be waived for candidates with extensive and closely related law enforcement experience). With basic degree requirements met, the initial step in the application process is to contact a DEA Special Agent Coordinator from one of the many DEA Field Recruitment Offices located throughout the country."}, {"url": "http://study.com/articles/Become_a_DEA_Agent_Education_and_Career_Roadmap.html", "passage_text": "Applicants without a bachelor's degree but with relevant work experience may be eligible to become a special agent. For example, the DEA seeks individuals with substantive experience in law enforcement investigations related to narcotics, which includes providing information toward prosecution and testifying in court. Step 4: Complete DEA Basic Agent Training. Newly hired applicants must successfully complete an 18-week Basic Agent Training program to become a special agent. This training is held at a DEA training academy at Quantico, VA. Trainees reside and attend classes at the academy."}, {"url": "http://www.criminaljusticeschoolguide.com/careers/dea-agent/", "passage_text": "Job Outlook for DEA Agents. Job opportunities look plentiful for DEA agents. A DEA agent’s salary starts between $49,746 and $55,483 depending on experience and education. In just four years, DEA agents can be eligible to make up to $92,592 annually. DEA Agent Education Requirements. DEA agents are required to have a bachelor’s degree. DEA agents who have degrees in criminal justice, police science, accounting, finance, economics, a foreign language, or another related field are preferred."}, {"url": "http://www.wikihow.com/Become-a-DEA-Agent", "passage_text": "DEA agents work for the Drug Enforcement Administration, a branch of the United States federal government. DEA agents are responsible for enforcing laws to curtail the trafficking of illegal drugs and controlled substances within the United States. The work of a DEA agent is challenging and dangerous but also rewarding. Entrance requirements for acceptance into the DEA agent training program are numerous and rigorous. The application process encompasses several phases, is very competitive and can take up to 1 year to complete. Here are some helpful tips and suggestions on how to become a DEA agent."}]