[{"url": "http://answers.microsoft.com/en-us/windows/forum/windows_7-networking/networking-a-usb-printer-via-a-router-windows-7-xp/d75b6a0f-764b-e011-8dfc-68b599b31bf5", "passage_text": "Your best solution is to use a Wireless Network ready printer (Brother make such printer that is very similar to the one that you got). The Wireless network ready printer connects to the Wireless Router and every computer on the Network (wire, or Wireless) can connect to it, print, scan, fax etc.."}, {"url": "http://smallbusiness.chron.com/install-usb-printer-wireless-router-52835.html", "passage_text": "Plug your print server's power adapter into the wall and plug its power cable into the Power input on the back of your print server. If it has a power switch, turn it on. Step 2. Connect your printer's USB port to your print server's USB port using the USB cable. Turn on your printer. Step 3. Wait for your print server to finish booting up and recognize your printer. Every print server is different, but if you give it a minute until a few lights are steadily on, it should be ready to go."}, {"url": "http://www.wikihow.com/Add-a-Laser-Printer-to-a-Home-Network", "passage_text": "Determine the type of connection to use. To add a network printer directly to a home network, a physical connection to a network router or hub is required. This connection could be made using an Ethernet cable, a USB cable or a wireless connection."}, {"url": "http://smallbusiness.chron.com/install-usb-printer-wireless-router-52835.html", "passage_text": "Use a USB cable to connect your printer to the USB port on your wireless router. Generally speaking, higher end routers will offer this functionality. Step 2. Turn on the printer and wait at least 60 seconds for the router to recognize it."}, {"url": "http://compnetworking.about.com/od/homenetworking/a/routernetworks_2.htm", "passage_text": "Connecting a Printer to the Router. Normally you can connect your printer to the router using a USB cable or a USB-to-Ethernet cable. Alternatively, wireless print server hardware also exists. A print server connects to your printer's USB jack and in turn makes a WiFi connection to a wireless router."}, {"url": "http://yourbusiness.azcentral.com/set-up-printer-print-wireless-router-12359.html", "passage_text": "Connect the Wired Printer. Connect one end of an Ethernet cable or USB cable to an available port on your printer. Then, connect the other end to an available port on the back of your wireless router. Not all routers support USB connections, but most routers have extra Ethernet ports to connect devices."}]