[{"url": "http://www.infoplease.com/encyclopedia/science/planarian.html", "passage_text": "planarian. planarian, common name for several genera of the free-living (turbellarian) flatworms belonging to the order Tricladida, a name that derives from their characteristic three-branched digestive cavities. 1 flatworm: meaning and definitions-flatworm: Definition and Pronunciation. 2  Platyhelminthes: Class Turbellaria-Class Turbellaria The mostly free-living, primarily carnivorous, flatworms of class Turbellaria are ..."}, {"url": "https://en.wikipedia.org/wiki/Flatworm", "passage_text": "From Wikipedia, the free encyclopedia. The flatworms, or Platyhelminthes, Plathelminthes, or platyhelminths (from the Greek πλατύ, platy, meaning flat and ἕλμινς (root: ἑλμινθ-), helminth- , meaning worm) are a phylum of relatively simple bilaterian, unsegmented, soft-bodied invertebrates. These are often called flukes, as most have flat rhomboid shapes like that of a flounder (Old English floc). Flóc they have 11,000 11000, species more than all other platyhelminthes, combined and second only to roundworms among parasites on. metazoans"}, {"url": "http://encyclopedia2.thefreedictionary.com/phylum+Platyhelminthes", "passage_text": "flatworm. see Platyhelminthes Platyhelminthes, phylum containing about 20,000 species of soft-bodied, bilaterally symmetrical, invertebrate animals, commonly called flatworms. There are four classes: the free-living, primarily aquatic class, Turbellaria, and Trematoda, Cestoda, and Monogenea, which are...."}, {"url": "http://www.biologyreference.com/Ph-Po/Platyhelminthes.html", "passage_text": "Platyhelminthes. The phylum name Platyhelminthes literally means flatworms.. Members of this phylum are soft, thin-bodied, leaf or ribbonlike worms, including the familiar planaria of ponds and streams, as well as the flukes and tapeworms parasitic in human and other animal bodies. "}, {"url": "http://www.answers.com/Q/What_is_the_most_common_name_for_flatworms", "passage_text": "Share to: The phylum is Platyhelmenthus   The three classes are   1. turbellaria   2. trematoda   3. cestoda   Platyhelminthes is a phylum composed of three classes of fl … atworms. "}, {"url": "https://en.wikipedia.org/wiki/Planarian", "passage_text": "A planarian is one of many flatworms of the Turbellaria class. It is also the common name for a member of the genus Planaria within the family Planariidae. Sometimes it also refers to the genus Dugesia. Planaria are common to many parts of the world, living in both saltwater and freshwater ponds and rivers. Some species are terrestrial and are found under logs, in or on the soil, and on plants in humid areas."}, {"url": "https://en.wikipedia.org/wiki/Flatworm", "passage_text": "Over half of all known flatworm species are parasitic, and some do enormous harm to humans and their livestock. Schistosomiasis, caused by one genus of trematodes, is the second-most devastating of all human diseases caused by parasites, surpassed only by malaria. These are often called flukes, as most have flat rhomboid shapes like that of a flounder (Old English floc). Flóc they have 11,000 11000, species more than all other platyhelminthes, combined and second only to roundworms among parasites on. metazoans"}, {"url": "http://soilbugs.massey.ac.nz/turbellaria.php", "passage_text": "Scienific name: phylum Platyhelminthes — “flat worms”, class Turbellaria, order Seriata, infraorder Terricola. Description. The flatworms (Turbellaria) are mostly marine, some inhabit fresh water, and the members of Terricola (terrestrial flatworms) live in moist terrestrial habitats. "}, {"url": "http://encyclopedia2.thefreedictionary.com/phylum+Platyhelminthes", "passage_text": "; worm worm,common name for various unrelated invertebrate animals with soft, often long and slender bodies. Members of the phylum Platyhelminthes, or the flatworms, are the most primitive; they are generally small and flat-bodied and include the free-living planarians (of the class..... see Platyhelminthes Platyhelminthes, phylum containing about 20,000 species of soft-bodied, bilaterally symmetrical, invertebrate animals, commonly called flatworms."}]