[{"url": "http://www.uua.org/beliefs/history", "passage_text": "Since the merger of the two denominations in 1961, Unitarian Universalism has nurtured its Unitarian and Universalist heritages to provide a strong voice for social justice and liberal religion. After consolidating in 1961, these faiths became the new religion of Unitarian Universalism through the Unitarian Universalist Association (UUA). Both religions have long histories and have contributed important theological concepts that remain central to Unitarian Universalism."}, {"url": "http://www.religionfacts.com/unitarian-universalism", "passage_text": "The Unitarian Universalist Association (UUA) was formed in 1961 by the merger of the Unitarian and Universalist denominations. Although historically rooted in Protestant Christianity, Unitarian Universalists do not regard their faith as a Christian denomination. 1. These are two common questions people have about Unitarian congregations. Unitarian Universalism (UU for short) is a liberal, non-creedal religious movement that welcomes pluralism and diversity in its members' beliefs and practices."}, {"url": "http://www.uubrunswick.org/visitors/learn-about-the-uu-church/", "passage_text": "The Northern New England District (NNED) of the Unitarian Universalist Association of Congregations, created by the consolidation of the Northeast District (Maine) and the New Hampshire Vermont District of Unitarian Universalist Societies in July 2008. The Unitarian Universalist Association (UUA) is a religious organization that combines two traditions: the Universalists, who organized in 1793, and the Unitarians, who organized in 1825."}, {"url": "http://www.uua.org/beliefs/history", "passage_text": "Learn more about how Unitarians and Universalists helped to shape American history. Unitarian Universalism is a liberal religious tradition that was formed from the consolidation of two religions: Unitarianism and Universalism. In America, the Universalist Church of America was founded in 1793, and the American Unitarian Association in 1825. After consolidating in 1961, these faiths became the new religion of Unitarian Universalism through the Unitarian Universalist Association (UUA). Both religions have long histories and have contributed important theological concepts that remain central to Unitarian Universalism."}, {"url": "https://en.wikipedia.org/wiki/Universalist", "passage_text": "The Unitarian Universalist Association (UUA) was formed in 1961, a consolidation of the American Unitarian Association, established in 1825, and the Universalist Church of America, established in 1866. It is headquartered in Boston, Massachusetts, and serves churches mostly in the United States. Universalism is a religious, theological, and philosophical concept with universal application or applicability. Universalist doctrines consider all people in their formation. In terms of religion, in a broad sense, universalism claims that religion is a universal human quality."}, {"url": "https://en.wikipedia.org/wiki/Unitarian_Universalism", "passage_text": "Unitarian Universalism is a liberal religion characterized by a free and responsible search for truth and meaning . Unitarian Universalists do not share a creed but are unified by their shared search for spiritual growth. As such, the Unitarian Universalist Church (UU) includes many agnostics, theists, and atheists among its membership. The roots of UU are in liberal Christianity, specifically Unitarianism and Universalism. A group of thirty Philippine congregations is represented as a sole member within the UUA. The Canadian Unitarian Council (CUC) became an independent body in 2002. The UUA and CUC are, in turn, two of the seventeen members of the International Council of Unitarians and Universalists."}, {"url": "https://en.wikipedia.org/wiki/Unitarian_Universalism", "passage_text": "The Unitarian Universalist Association (UUA) was formed in 1961, a consolidation of the American Unitarian Association, established in 1825, and the Universalist Church of America, established in 1866. It is headquartered in Boston, Massachusetts, and serves churches mostly in the United States. A group of thirty Philippine congregations is represented as a sole member within the UUA. The Canadian Unitarian Council (CUC) became an independent body in 2002. The UUA and CUC are, in turn, two of the seventeen members of the International Council of Unitarians and Universalists."}, {"url": "http://www.rapidnet.com/~jbeard/bdm/Cults/unitari.htm", "passage_text": "Unitarian Universalism (UU), known officially as the. (with headquarters in Boston, Mass.), was officially formed in 1961 with the merger of two separate religious groups whose roots date back to the early 1500s -- the American Unitarian Association (1825) and the Universalist Church of America (1793)."}, {"url": "http://a2u2.org/about-unitarian-universalism.aspx", "passage_text": "About Unitarian Universalism. The national Unitarian Universalist Association was created in 1961 by the merger of Unitarianism and Universalism, both strong Christian movements through the nineteenth and early twentieth centuries. The American Unitarian Association helped rescue Jews and others escaping Nazi Germany at the beginning of WWII. The Unitarians formed a Service Committee in 1940. The Universalists helped rescue Jews from Holland and formed their Service Committee in 1945."}]