[{"url": "https://answers.yahoo.com/question/index?qid=20081123225824AA1WC6s", "passage_text": "Best Answer: Physically, polar compounds are not balanced, the way someone on a tightrope is balanced with a pole. At least one of the atoms is very large and offsetting the other atoms making up the compound. Let's take water. It looks like a 'mickey mouse' head. "}, {"url": "http://www.answers.com/Q/What_does_water_polarity_mean", "passage_text": "When someone mentions water polarity, they are talking about the intermolecular properties of water. Water is a polar-covalent bonded molecule which means that even though the hydrogens are sharing electrons with the oxygens, the electrons will be attracted slightly more to the element with the bigger nucleus."}, {"url": "http://whatis.techtarget.com/definition/polarity", "passage_text": "Part of the Smart grid glossary: Also see bipolar signaling and unipolar signaling. Polarity is a term used in electricity, magnetism, and electronic signaling. Suppose there is a constant voltage, also called an electric potential or electromotive force (EMF), between two objects or points. In such a situation, one of the objects or points (poles) has more electrons than the other. "}, {"url": "http://www.thefreedictionary.com/polarity", "passage_text": "2. polarity-having an indicated pole (as the distinction between positive and negative electric charges); he got the polarity of the battery reversed; charges of opposite sign. sign. oppositeness, opposition-the relation between opposed entities. positiveness, positivity-the character of the positive electric pole. "}, {"url": "http://www.answers.com/Q/What_does_Polarity_mean", "passage_text": "What is meant by polarity?   Answer   An electric charge has a polarity of either positive or negative. Also a voltage has a polarity, in that it could be positive … or negative, with respect to some other voltage, such as the one at the other end of a battery or electric circuit. When someone mentions water polarity, they are talking about the intermolecular properties of water. Water is a polar-covalent bonded molecule which means that even though the … hydrogens are sharing electrons with the oxygens, the electrons will be attracted slightly more to the element with the bigger nucleus. 5 people found this useful"}, {"url": "http://www.merriam-webster.com/dictionary/polarity", "passage_text": "Full Definition of POLARITY. 1. : the quality or condition inherent in a body that exhibits opposite properties or powers in opposite parts or directions or that exhibits contrasted properties or powers in contrasted parts or directions: the condition of having poles. 2. Medical Definition of POLARITY. 1. : the quality or condition inherent in a body that exhibits contrasting properties or powers in contrasting parts or directions. 2. : attraction toward a particular object or in a specific direction."}, {"url": "http://www.audioenglish.org/dictionary/polarity.htm", "passage_text": "• POLARITY (noun). The noun POLARITY has 2 senses: 1. a relation between two opposite attributes or tendencies. 2. having an indicated pole (as the distinction between positive and negative electric charges). Familiarity information: POLARITY used as a noun is rare. Dictionary entry details."}, {"url": "http://www.school-for-champions.com/chemistry/polar_molecules.htm", "passage_text": "Molecules can be grouped as polar or non-polar molecules. Some molecules are in between the two. The arrangement or geometry of the atoms in some molecules is such that one end of the molecule has a positive electrical charge and the other side has a negative charge. "}, {"url": "https://answers.yahoo.com/question/index?qid=20061108111244AAyWrXK", "passage_text": "Best Answer: With respect to covalent bonds, polarity refers to the tendency of electrons to move towards one of the atoms. Polarity in covalent bonds arises from differences in electronegativity between the participating elements. For example, the covalent bond in a molecule of water, H2O, is polar. Oxygen is more electronegative than hydrogen, so the end of the molecule containing the oxygen atom has a partial negative charge."}]