[{"url": "http://animals.mom.me/snails-need-live-4646.html", "passage_text": "A snail requires a clean and damp environment that is not too cramped. A large jar is big enough for a small species; a bigger snail will require an aquarium or a large plastic container. Do not simply throw away snail eggs, as they can hatch and spread live snails into local flora, wreaking havoc on native vegetation. Handle snails gently by picking them up by their shells, and do not attempt to pluck them from the sides of their aquarium, as this can cause injury."}, {"url": "https://en.wikipedia.org/wiki/Snail", "passage_text": "Snail is a common name that is applied most often to land snails, terrestrial pulmonate gastropod molluscs. Although land snails may be more familiar to people, marine snails constitute the majority of snail species, and have much greater diversity and a greater biomass. Numerous kinds of snail can also be found in fresh water."}, {"url": "http://animals.mom.me/survival-adaptations-snails-5298.html", "passage_text": "The term snail is a common name applied to any gastropod mollusk who can retract into his shell. Thousands of species of snails live on land, in freshwater streams and ponds, and in saltwater bodies. They inhabit a range of regions including arid deserts and frigid sea depths. Snails' shells protect them from predators and the elements, and different snails have different adaptations, depending upon the regions they inhabit."}, {"url": "http://www.snail-world.com/where-do-snails-live/", "passage_text": "What is often found is that land snails live in locations where there are humans around. If you have a garden then chances are you have already seen them exploring this area as well. What you will discover is that snails species are quite abundant with thousands of them out there. Of course a snail can’t move very far in a day but they do continually move most of the time to new locations. Snails are loners but they often come into contact with each other due to the feeding grounds where they find plenty for all of them to share. This is also where they find each other for mating to occur"}, {"url": "https://en.wikipedia.org/wiki/Snail", "passage_text": "Snail-like animals that naturally lack a shell, or have only an internal shell, are mostly called slugs, and land snails that have only a very small shell (that they cannot retract into) are often called semi-slugs. Although land snails may be more familiar to people, marine snails constitute the majority of snail species, and have much greater diversity and a greater biomass. Numerous kinds of snail can also be found in fresh water."}, {"url": "http://applesnail.net/content/ecology.php", "passage_text": "Predators and the techniques used by apple snails to avoid them. As apple snail are a popular food source for various animals like birds, turtles, fishes, insects and crocodiles, it is not surprising that they have developed several techniques to avoid predation. The most important enemy of the apple snail is man. "}, {"url": "http://www.snail-world.com/where-do-snails-live/", "passage_text": "Snail Habitat. Snails are quite plentiful in the world so it shouldn’t come as a surprise to learn they are found in very diverse habitats. Some of them are comfortable in the desert while others live in ditches and cooler climates. These include the mountain areas and even in marshes. Of course a snail can’t move very far in a day but they do continually move most of the time to new locations. Snails are loners but they often come into contact with each other due to the feeding grounds where they find plenty for all of them to share. This is also where they find each other for mating to occur"}, {"url": "https://en.wikipedia.org/wiki/Snail", "passage_text": "Snails can be found in a very wide range of environments, including ditches, deserts, and the abyssal depths of the sea. Although land snails may be more familiar to people, marine snails constitute the majority of snail species, and have much greater diversity and a greater biomass. Numerous kinds of snail can also be found in fresh water."}, {"url": "https://en.wikipedia.org/wiki/Land_snail", "passage_text": "Land snails are terrestrial gastropod mollusks that have shells (those without shells are known as slugs). In reality however, it is not always easy to say which species are terrestrial, because some are more or less amphibious between land and freshwater, and others are relatively amphibious between land and saltwater. The majority of land snails are pulmonates, i.e. they have a lung and breathe air. The lifespan of land snails varies from species to species. In the wild, Achatinidae snails live around 5 to 7 years and Helix snails live about 2 to 3 years. Many deaths are due to predators or parasites. In captivity, the lifespan of snails is much longer than in the wild, ranging from 10 to 15 years for many species."}]