[{"url": "http://www.answers.com/Q/What_does_imbowers_mean", "passage_text": "Their means belonging to them.. The homophone of there/their/they're    There refers  to some place.  Their is the  possessive pronoun of them or themselves. …  They're is a contraction or shortening of 'they are'.     The homophone of there/their/they're      There refers to some place.   Their  is the possessive pronoun of them or themselves.   They're is a contraction or shortening of 'they are'.   . Their means belonging to people or things previously mentioned or  easily identified (Your parents do not look similar, except for  their noses)."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20070422073514AATcrq9", "passage_text": "Best Answer: It means flitted = moved quickly I think it's an archaic word, such as hath was used instead of have, art instead of to be... Here's a list of archaic English words: http://en.wikipedia.org/wiki/List_of_arc... In the time of Alfred Lord Tennyson, -th was often put on the end of verbs, so I am guessing that Tennyson used flitteth to mean flitted or was flitting. Something like She flitteth about like a dove in a grain store."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20070422073514AATcrq9", "passage_text": "I am doing this very important piece of homework on 'the lady of shalott' by alfred lord tennyson and i need to find what this word means. ty. bex xxx. Add your answer. In the time of Alfred Lord Tennyson, -th was often put on the end of verbs, so I am guessing that Tennyson used flitteth to mean flitted or was flitting. Something like She flitteth about like a dove in a grain store."}, {"url": "http://www.shmoop.com/lady-of-shalott/isolation-quotes.html", "passage_text": "And the silent isle imbowers. The Lady of Shalott. (lines 17-18). We think this line really rides on that big vocab word: imbowers.. This means to close up in a bower, which is an old term that refers to a lady's private room. In another kind of poem, this could be associated with protection, keeping someone safe from the outside world."}, {"url": "http://www.shmoop.com/lady-of-shalott/part-1-lines-11-23-summary.html", "passage_text": "Little breezes dusk and shiver. 1  The speaker mentions little breezes that blow around the island too, and says that they dusk and shiver.. 2  It's a little hard to say exactly what those words mean in this context, since we usually don't talk about something dusking.. The Lady of Shalott. 1  Finally, we meet the star of this little show, the Lady herself. 2  The only thing we learn right away is that the silent island of Shalott imbowers her."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20070422073514AATcrq9", "passage_text": "I am doing this very important piece of homework on 'the lady of shalott' by alfred lord tennyson and i need to find what this word means. ty bex xxx. In the time of Alfred Lord Tennyson, -th was often put on the end of verbs, so I am guessing that Tennyson used flitteth to mean flitted or was flitting. Something like She flitteth about like a dove in a grain store."}, {"url": "http://www.shmoop.com/lady-of-shalott/part-1-lines-11-23-summary.html", "passage_text": "1 The only thing we learn right away is that the silent island of Shalott imbowers her. 2  This might be an unfamiliar word, but it's really important for this poem. 3  It means to enclose, to shut up in a bower, which was the private room of a medieval lady. The Lady of Shalott. 1  Finally, we meet the star of this little show, the Lady herself. 2 "}, {"url": "http://www.lexic.us/definition-of/imbowers", "passage_text": "Literary usage of Imbowers. Below you will find example usage of this term as found in modern and/or classical literature: 1. The works of Alfred, lord Tennyson by Alfred Tennyson (1884). Four gray walls, and four gray towers, Overlook a space of flowers, And the silent isle imbowers .... There, oft let the farmer hail The sacred orchard which imbowers his gate, And show to strangers passing down the vale, .... 3. The Harvard Classics by Charles William Eliot (1910). ... river Flowing down to Camelot Four gray walls, and four gray towers, Overlook a space of flowers, And the silent isle imbowers."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20070422073514AATcrq9", "passage_text": "To flit means to moves lightly and switly, to dart about. Bees flit fom flower to flower. In the time of Alfred Lord Tennyson, -th was often put on the end of verbs, so I am guessing that Tennyson used flitteth to mean flitted or was flitting. Something like She flitteth about like a dove in a grain store."}, {"url": "http://www.shmoop.com/lady-of-shalott/part-1-lines-11-23-summary.html", "passage_text": "1 The speaker mentions little breezes that blow around the island too, and says that they dusk and shiver.. 2  It's a little hard to say exactly what those words mean in this context, since we usually don't talk about something dusking.. The Lady of Shalott. 1  Finally, we meet the star of this little show, the Lady herself. 2  The only thing we learn right away is that the silent island of Shalott imbowers her."}]