[{"url": "http://www.urbandictionary.com/define.php?term=pisco", "passage_text": "pisco. Peruvian pisco is a grape brandy, distilled from fresh grape must. Pisco is transparent or slightly yellowish, with an alcohol content of about 42%. Pisco is also a port in Peru, the very same port where the liquor was first exported from thus giving it its name. Chile which also produces a lower quality Pisco has stolen both the name and the market place for the liquor. There is nothing more Peruvian than a Pisco Sour."}, {"url": "http://www.wisegeek.com/what-is-pisco.htm", "passage_text": "Pisco is a popular liquor in South America, particularly in Bolivia, Chile and Peru. Pisco is a type of Latin American brandy. The Serena Libre is made from pisco and papaya juice. Pure pisco is made from a single grape variety, usually the traditional Quebranta grape. Aromatic pisco is made from Muscat, or similar strains of grape, such as Torontel and Italia, which are closely related to Muscat. Production of Green Must pisco incorporates the use of partially fermented must."}, {"url": "http://southamericanfood.about.com/od/drinks/a/pisco.htm", "passage_text": "Pisco is a potent South American brandy with a storied history and a passionate following. Pisco is exported from both Peru and Chile, and both countries claim to be the original producers of the liqueur. Pisco is made from only certain varieties of grapes, which are fermented and distilled into a potent aguardiente. There are four categories of pisco, made from seven varieties of grapes. Pisco puro is made only from black, nonaromatic grapes, usually the quebranta variety. These were the original grapes brought over from Spain, which supposedly changed and adapted to their new environment, resulting in a unique taste."}, {"url": "http://www.barsolpisco.eu/en/pisco.html", "passage_text": "Pisco is South America's famous brandy. Pisco is a South American brandy (distilled from full, fermented grapes), constituting the national spirit of Chile (Chilenian Pisco) as well as Peru (Peruvian Pisco). The piscos of both countries-Chilenian Pisco and Peruvian Pisco-are very different. Pisco is a South American brandy (distilled from full, fermented grapes), constituting the national spirit of Chile (Chilenian Pisco) as well as Peru (Peruvian Pisco)"}, {"url": "http://www.wisegeek.com/what-is-pisco.htm", "passage_text": "Most pisco is produced in Chile and Peru, and is a very popular drink in these countries. It is also popular in Bolivia. Pisco was first produced strictly from the Quebranta grape, which means “broken” in Spanish. Since the early production days, other grape varietals have been used as well. Pure pisco is made from a single grape variety, usually the traditional Quebranta grape. Aromatic pisco is made from Muscat, or similar strains of grape, such as Torontel and Italia, which are closely related to Muscat. Production of Green Must pisco incorporates the use of partially fermented must."}, {"url": "https://en.wikipedia.org/wiki/Pisco_Sour", "passage_text": "A pisco sour is a cocktail typical of South American cuisine. The drink's name comes from pisco, which is its base liquor, and the cocktail term sour, in reference to sour citrus juice and sweetener components. The Peruvian pisco sour uses Peruvian pisco as the base liquor and adds Key lime (or lemon) juice, syrup, ice, egg white, and Angostura bitters. The Chilean version is similar, but uses Chilean pisco and pica lime, and excludes the bitters and egg white."}, {"url": "https://en.wikipedia.org/wiki/Pisco", "passage_text": "Pisco is a colorless or yellowish-to-amber colored brandy produced in winemaking regions of Peru and Chile. Made by distilling grape wine into a high-proof spirit, it was developed by 16th century Spanish settlers as an alternative to orujo, a pomace brandy that was being imported from Spain. A Peruvian pisco peculiarity is that the first part of the distillation (called the heads) is kept and mixed in with the rest of the distillate. Re-adding the 'heads' adds more 'character', and is how Peruvians traditionally liked it."}, {"url": "https://en.wikipedia.org/wiki/Pisco_Sour", "passage_text": "Chile and Peru both claim the Pisco Sour as their national drink, and each asserts ownership of the cocktail's base liquor—pisco; consequently, the Pisco Sour has become a significant and oft-debated topic of Latin American popular culture. The Peruvian pisco sour uses Peruvian pisco as the base liquor and adds Key lime (or lemon) juice, syrup, ice, egg white, and Angostura bitters. The Chilean version is similar, but uses Chilean pisco and pica lime, and excludes the bitters and egg white."}]