[{"url": "http://www.merriam-webster.com/dictionary/declination", "passage_text": "Definition of DECLINATION. 1. : angular distance north or south from the celestial equator measured along a great circle passing through the celestial poles. 2. : a turning aside or swerving. 3. 4. : a bending downward: inclination. 5. : a formal refusal. "}, {"url": "https://en.wikipedia.org/wiki/Magnetic_declination", "passage_text": "By convention, declination is positive when magnetic north is east of true north, and negative when it is to the west. Isogonic lines are lines on the Earth's surface along which the declination has the same constant value, and lines along which the declination is zero are called agonic lines. Magnetic declination should not be confused with magnetic inclination, also known as magnetic dip, which is the angle that the Earth's magnetic field lines make with the downward side of the horizontal plane."}, {"url": "http://www.thefreedictionary.com/magnetic+declination", "passage_text": "magnetic declination-the angle (at a particular location) between magnetic north and true north. magnetic variation, variation. angle-the space between two lines or planes that intersect; the inclination of one line to another; measured in degrees or radians. magnetic declination. The angle between the magnetic and geographical meridians at any place, expressed in degrees east or west to indicate the direction of magnetic north from"}, {"url": "http://education.usgs.gov/lessons/compass.html", "passage_text": "If magnetic north is east of true north, the local declination is positive. If magnetic north is west of true north, the local declination is negative. B) Draw a line on the map that connects your starting point with the destination (your map bearing). Magnetic declination is the direction and amount of variation between the Magnetic Pole and True North. The amount and direction of declination depends upon how those two poles align relative to a given point on Earth."}, {"url": "https://en.wikipedia.org/wiki/Magnetic_declination", "passage_text": "Magnetic declination or variation is the angle on the horizontal plane between magnetic north (the direction the north end of a compass needle points, corresponding to the direction of the Earth's magnetic field lines) and true north (the direction along a meridian towards the geographic North Pole). Magnetic declination should not be confused with magnetic inclination, also known as magnetic dip, which is the angle that the Earth's magnetic field lines make with the downward side of the horizontal plane."}, {"url": "https://en.wikipedia.org/wiki/Magnetic_declination", "passage_text": "The magnetic declination in a given area may (most likely will) change slowly over time, possibly as little as 2–2.5 degrees every hundred years or so, depending upon how far from the magnetic poles it is. For a location closer to the pole like Ivujivik, the declination may change by 1 degree every three years. Magnetic declination should not be confused with magnetic inclination, also known as magnetic dip, which is the angle that the Earth's magnetic field lines make with the downward side of the horizontal plane."}, {"url": "http://www.thecompassstore.com/whatisdec.html", "passage_text": "There is a True Geographic North Pole at the top of the world, and a Magnetic North Pole. The Magnetic North Pole is always moving. It has been as much as 1,200+ miles from true north, but in 2005 is only around 500 miles from the True North Pole. We typically say that a compass points to Magnetic North, not True North. "}, {"url": "https://en.wikipedia.org/wiki/Declination", "passage_text": "In astronomy, declination (abbreviated dec; symbol δ) is one of the two angles that locate a point on the celestial sphere in the equatorial coordinate system, the other being hour angle. Neglecting atmospheric refraction, declination is always 0° at east and west points of the horizon. At the north point, it is 90° − | φ |, and at the south point, −90° + | φ |."}, {"url": "https://en.wikipedia.org/wiki/Magnetic_declination", "passage_text": "The term magnetic deviation is sometimes used loosely to mean the same as magnetic declination, but more correctly it refers to the error in a compass reading induced by nearby metallic objects, such as on board a ship or aircraft. Magnetic declination should not be confused with magnetic inclination, also known as magnetic dip, which is the angle that the Earth's magnetic field lines make with the downward side of the horizontal plane."}, {"url": "https://www.ngdc.noaa.gov/geomag/declination.shtml", "passage_text": "Magnetic declination, sometimes called magnetic variation, is the angle between magnetic north and true north. Declination is positive east of true north and negative when west. Magnetic declination changes over time and with location. As the compass points with local magnetic fields, declination value is needed to obtain true north.. more."}]