[{"url": "https://johnparankimalil.wordpress.com/2012/03/26/meaning-nature-and-aims-of-education/", "passage_text": "Education is a systematic process through which a child or an adult acquires knowledge, experience, skill and sound attitude. It makes an individual civilized, refined, cultured and educated. For a civilized and socialized society, education is the only means.. Education is development of individual and the society-It is called a force for social development, which brings improvement in every aspect in the society. 4. Education is modification of behaviour-Human behaviour is modified and improved through educational process. 5."}, {"url": "http://www.whitleycountycommunityfoundation.org/pdf/srcscholarship%20110811.pdf", "passage_text": "J:ADM:SRC:srcscholarship 110811 1 “Education is a social process…Education is growth…Education is not a preparation for life; education is life itself.” – John Dewey The desire for higher education must never be considered an impossible goal to obtain. "}, {"url": "http://www.quotes-positive.com/quote/education-social-process-growth-not-132/", "passage_text": "education is not the answer to the question education is the means to the answer to all questions william allin the great difficulty in education is to get experience out of ideas george santayana thank you for visiting education is a social process by john deweyeducation is a social process education is growth education is not a preparation for life education is life itself john dewey related topics education to me faith means not worryingohn dewey education is not a preparation for life education is life itself john dewey please sign up for my free inspirational daily email on the form below sign up for your free subscription to my daily inspiration daily quote email"}, {"url": "http://www.chegg.com/homework-help/questions-and-answers/john-dewey-suggests-education-social-process-education-growth-education-preparation-life-l-q3075222", "passage_text": "Question. John Dewey suggests education is a social process; education is growth; education is not preparation for life but is life itself .This reminds me of my team teaching episode of circle time. "}, {"url": "http://www.quotes-inspirational.com/quote/education-social-process-growth-not-132/", "passage_text": "by john dewey education is a social process education is growth education is not a preparation for life education is life itself john dewey related topics education education is not a preparation for life education is life itself john dewey to find out what one is fitted to do and to secure an opportunity to do it is the key to happiness john dewey to me faith means not worrying"}, {"url": "https://johnparankimalil.wordpress.com/2012/03/26/meaning-nature-and-aims-of-education/", "passage_text": "2. Education is a systematic process-It refers to transact its activities through a systematic institution and regulation. 3. Education is development of individual and the society-It is called a force for social development, which brings improvement in every aspect in the society.4. Education is modification of behaviour-Human behaviour is modified and improved through educational process.5.. Education is development of individual and the society-It is called a force for social development, which brings improvement in every aspect in the society. 4. Education is modification of behaviour-Human behaviour is modified and improved through educational process. 5."}, {"url": "http://www.goodreads.com/quotes/395317-education-is-a-social-process-education-is-growth-education-is", "passage_text": "― John Dewey. “Education is a social process; education is growth; education is not preparation for life but is life itself.”. "}, {"url": "http://thinkexist.com/quotation/education_is_a_social_process-education_is_growth/148047.html", "passage_text": "John Dewey quotes. “Education is a social process; education is growth; education is not a preparation for life but is life itself.”. John Dewey quotes (American Philosopher, Psychologist and Educator, 1859-1952). “Education is not a preparation for life; education"}, {"url": "http://www.slideshare.net/rdcormia/learning-as-a-social-process-1152436", "passage_text": "1 1. Learning as a Social Process Robert D. Cormia Foothill College; 2. Learning as a Social Process. Learning is a social process – it is i} DUPipeline_QISnippet_FirstGood_Snippet_v1: {},{-1|-1|1|Learning as a Social Process. 2"}, {"url": "http://www.elearnspace.org/blog/2005/07/18/learning-as-a-social-process/", "passage_text": "I’m getting a bit frustrated with the continual statements that learning is a social process. Certain types of learning certainly require a social process. Other types of learning are not at all socially enabled. I’m a strong advocate for the value of individuality in learning (especially group learning). My interest in learning networks stems from the individuality of each node in the larger network."}]