[{"url": "https://eaware.org/thymus-gland/", "passage_text": "The Thymus. The thymus is located in the upper part of the chest. It is made of two lobes that join in front of the trachea. The thymus is an important part of children's immune systems. It grows larger until puberty and then begins to shrink. After the white blood cells mature, they leave the thymus gland and get settled in the spleen and the lymph nodes, where a fresh batch of T cells is produced. These white blood cells are the body's immune system and protect the body by producing antibodies that stop the invasion of foreign agents, bacteria and viruses."}, {"url": "https://en.wikipedia.org/wiki/Thymus", "passage_text": "The thymus is a specialized primary lymphoid organ of the immune system. Within the thymus, T cells or T lymphocytes mature. T cells are critical to the adaptive immune system, where the body adapts specifically to foreign invaders. The thymus is composed of two identical lobes and is located anatomically in the anterior superior mediastinum, in front of the heart and behind the sternum."}, {"url": "http://www.lymphomation.org/lymphatic.htm", "passage_text": "The major parts of the system are the bone marrow, spleen, thymus gland, lymph nodes, and the tonsils. Other organs, including the heart, lungs, intestines, liver, and skin also contain lymphatic tissue. gorhams.dk Lymphoma Is a disease in which malignant lymphocytes grow too fast or live too long. "}, {"url": "http://www.innerbody.com/image_endoov/lymp04-new.html", "passage_text": "The thymus gland, despite containing glandular tissue and producing several hormones, is much more closely associated with the immune system than with the endocrine system. The thymus serves a vital role in the training and development of T-lymphocytes or T cells, an extremely important type of white blood cell."}, {"url": "http://www.endocrineweb.com/endocrinology/overview-thymus", "passage_text": "1 The thymus gland, located behind your sternum and between your lungs, is only active until puberty. 2  After puberty, the thymus starts to slowly shrink and become replaced by fat. 3  Thymosin is the hormone of the thymus, and it stimulates the development of disease-fighting T cells. Throughout your childhood years, white blood cells called lymphocytes pass through the thymus, where they are transformed into T cells. Once T cells have fully matured in the thymus, they migrate to the lymph nodes (groups of immune system cells) throughout the body, where they aid the immune system in fighting disease."}, {"url": "http://erikanderson.net/endocrine/thymus.shtml", "passage_text": "The thymus is located in the upper part of the chest. It is made of two lobes that join in front of the trachea. The thymus is an important part of children's immune systems. It grows larger until puberty and then begins to shrink. The gland produces thymosins, which are hormones that stimulate the development of antibodies."}, {"url": "https://answers.yahoo.com/question/index?qid=20080822114439AASvLmv", "passage_text": "When you look at what body system a organ belongs you look at its main function. Its main function is to produce hormones that produce white blood cells, therefore in my opinion the thymus as apart of the endocrine system. Alot of these functions overlap into different body systems The thymus converts lymphocytes into T-cells so it can look at is as apart of the immune system. Online medical dictionaries see the the thymus as part of the lymphatic system because it is made up of lymphatic tissue."}, {"url": "http://teachmeanatomy.info/thorax/organs/thymus/", "passage_text": "The thymus gland is a pink, lobulated lymphoid organ, located in the thoracic cavity and neck. In the adolescent, it is involved the development of the immune system. After puberty, it decreases in size and is slowly replaced by fat. Embryologically, the thymus gland is derived from the third pharyngeal pouch. "}, {"url": "http://www.wisegeek.org/what-is-the-thymus-gland.htm", "passage_text": "The thymus gland is an organ in the upper chest cavity that processes lymphocytes, a type of white blood cell that fights infections in the body. This organ is part of both the lymphatic system, which makes up a major part of the immune system, and the endocrine system, which includes all glands that produce hormones. The thymus is most important in children and young adults, when it programs lymphocytes to attack antigens, like viruses."}, {"url": "http://biology.about.com/od/anatomy/ss/thymus.htm", "passage_text": "Thymus. The thymus gland is the main organ of the lymphatic system. Located in the upper chest region, the primary function of this gland is to promote the development of specific cells of the immune system called T lymphocytes. The thymus gland acts to regulate the immune system through the development of immune cells responsible for cell mediated immunity. In addition to immune function, the thymus also produces hormones that promote growth and maturation."}]