[{"url": "http://www.rxlist.com/vicodin-drug/consumer-uses.htm", "passage_text": "Daily alcohol use, especially when combined with acetaminophen, may damage your liver. Avoid alcohol. USES: This combination medication is used to relieve moderate to severe pain. It contains a narcotic pain reliever (hydrocodone) and a non-narcotic pain reliever (acetaminophen). Hydrocodone works in the brain to change how your body feels and responds to pain. Acetaminophen can also reduce a fever."}, {"url": "http://www.webmd.com/drugs/2/drug-251/hydrocodone-acetaminophen-oral/details", "passage_text": "Uses. This combination medication is used to relieve moderate to severe pain. It contains a narcotic pain reliever (hydrocodone) and a non-narcotic pain reliever (acetaminophen). Hydrocodone works in the brain to change how your body feels and responds to pain. Acetaminophen can also reduce a fever."}, {"url": "http://www.rxlist.com/vicodin-side-effects-drug-center.htm", "passage_text": "Vicodin (hydrocodone/acetaminophen) is a combination of the narcotic hydrocodone and non-narcotic pain reliever acetaminophen used for the relief of moderate to moderately severe pain. A generic version is available. The most common side effects of Vicodin include lightheadedness, dizziness, anxiety, nausea, vomiting, upset stomach, drowsiness, constipation, headache, mood changes, blurred vision, ringing in your ears, dry mouth, and difficulty urinating."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMHT0010590/?report=details", "passage_text": "Uses of This Medicine. Hydrocodone and acetaminophen combination is used to relieve moderate to moderately severe pain. Acetaminophen is used to relieve pain and reduce fever in patients. It does not become habit-forming when taken for a long time. But acetaminophen may cause other unwanted effects when taken in large doses, including liver damage. Hydrocodone belongs to the group of medicines called narcotic analgesics (pain medicines)."}, {"url": "https://www.opiates.com/vicodin/", "passage_text": "Vicodin Uses. Vicodin is a commonly prescribed opiate painkiller made up of hydrocodone and paracetamol, which is acetaminophen. Vicodin is the trademark name for the drug, which is also marketed under the names Vicodin ES and Vicodin HP. 1  Vicodin contains 500 mg of paracetamol and 5 mg of hydrocodone."}, {"url": "http://www.webmd.com/drugs/2/drug-3459/vicodin-oral/details", "passage_text": "Uses. This combination medication is used to relieve moderate to severe pain. It contains a narcotic pain reliever (hydrocodone) and a non-narcotic pain reliever (acetaminophen). Hydrocodone works in the brain to change how your body feels and responds to pain. Acetaminophen can also reduce a fever"}, {"url": "https://www.opiates.com/vicodin/", "passage_text": "Vicodin. Home » Vicodin. Vicodin ® is a combination of Hydrocodone and Acetaminophen. Hydrocodone belongs to a group of drugs called narcotic pain relievers. Vicodin ® is used in the treatment of moderate to severe pain. Acetaminophen enhances the pain relieving qualities of the Hydrocodone. Vicodin is a commonly prescribed opiate painkiller made up of hydrocodone and paracetamol, which is acetaminophen. Vicodin is the trademark name for the drug, which is also marketed under the names Vicodin ES and Vicodin HP. 1  Vicodin contains 500 mg of paracetamol and 5 mg of h"}, {"url": "http://pain.emedtv.com/vicodin/vicodin-uses.html", "passage_text": "Vicodin contains two different medications: hydrocodone and acetaminophen. Hydrocodone is a semi-synthetic narcotic, opioid pain reliever. It acts similarly to codeine. "}, {"url": "https://en.wikipedia.org/wiki/Hydrocodone", "passage_text": "Hydrocodone is a semi-synthetic opioid synthesized from codeine, one of the opioid alkaloids found in the opium poppy. It is a narcotic analgesic used orally as an antitussive/ cough suppressant, but also commonly taken orally for relief of moderate to severe pain. "}]