[{"url": "http://www.pcas.org/assets/documents/Dentaliuim_001.pdf..pdf", "passage_text": "Finally, Harrison (1964:273)described finding five Dentalium shells at SBA-78(Dos Pueblos), four from deposits in Area A associ-ated with the historic village of Mikiw and one fromArea C, which is dated to the Middle Holocene. 1). San Miguel, thewesternmost of the Northern Channel Islands, islocated approximately 40 km from the mainland coast.Roughly 17 km long and 7 km wide, the island issurrounded by a rocky coastline punctuated withstretches of sandy beach."}, {"url": "https://en.wikipedia.org/wiki/Tusk_shell", "passage_text": "The mantle of a scaphopod is entirely within the shell. The foot extends from the larger end of the shell, and is used to burrow through the substrate. The scaphopod positions itself head down in the substrate, with the apical end of the shell (at the rear of the animal's body) projecting upward. The shells of the members of the Gadilida are usually glassy-smooth in addition to being quite narrow and with a reduced aperture. This along with other structures of their anatomy allows them to move with surprising speed through loose sediment to escape potential bottom-dwelling predators."}, {"url": "https://en.wikipedia.org/wiki/Tusk_shell", "passage_text": "The tusk shells or tooth shells, often referred to by the more-technical term scaphopods /ˈskaefəˌpɒd/ (ˈskæfəˌpɒd, greek-boat), footed are members of a class of shelled marine mollusc with worldwide, distribution and are the only class of exclusively infaunal marine. molluscs The shells of the members of the Gadilida are usually glassy-smooth in addition to being quite narrow and with a reduced aperture. This along with other structures of their anatomy allows them to move with surprising speed through loose sediment to escape potential bottom-dwelling predators."}, {"url": "http://www.pcas.org/assets/documents/Dentaliuim_001.pdf..pdf", "passage_text": "On SanMiguel Island, Heye (1921) described eight incised Dentalium shells from an undated burial. Morerecently, two D. pretiosum beads were found in the6500-year-old Stratum C at Daisy Cave (SMI-261), ina stratified context roughly the same age as theartifacts from Otter Cave. 1). San Miguel, thewesternmost of the Northern Channel Islands, islocated approximately 40 km from the mainland coast.Roughly 17 km long and 7 km wide, the island issurrounded by a rocky coastline punctuated withstretches of sandy beach."}, {"url": "http://www.matoska.com/cgibin/gencat.cgi?AC=gencat&PC=12&ST=0&RS=NULL&S1S2=60%2CNULL", "passage_text": "Dentalium Shells. Dentalium is often used for earrings, chokers, and on the capes of Plains women's dresses. The shells come in two sizes. The large size is smooth, very much like the old-style dentalium, and average about 1 to 1 inches long. They are hard to find and we are pleased to be able to offer them for your craft needs. The small average about 3/4 inch long and there are approximately 225 pieces per 2 ounce package"}, {"url": "https://en.wikipedia.org/wiki/Dentalium_shell", "passage_text": "Dentalium shells were used by Inuit, First Nations, and Native Americans as an international trade item. Nuu-chah-nulth peoples were the primary harvesters of dentalium shells. Among the Northwest Coastal tribes, the shells were valued for both trade and adornment. Young Nuu-chah-nulth girls of high status wore elaborate dentalia jewelry."}, {"url": "https://en.wikipedia.org/wiki/Dentalium_shell", "passage_text": "On the Central Coast of California, shells of Dentalium neohexagonum (a species that occurs from Monterey, California to Baja California) have been recovered from prehistoric habitation sites of the Chumash, who apparently used these shells as tubes, possibly in jewelry. Nuu-chah-nulth peoples were the primary harvesters of dentalium shells. Among the Northwest Coastal tribes, the shells were valued for both trade and adornment. Young Nuu-chah-nulth girls of high status wore elaborate dentalia jewelry."}, {"url": "http://www.pcas.org/assets/documents/Dentaliuim_001.pdf..pdf", "passage_text": "Two types of Dentalium shells live alongthe Pacific Coast. The Indian money tusk (D.pretiosum) ranges from Alaska to southern or BajaCalifornia and is generally found subtidally, burrow-ing in muds or sands between about 2 m and 150 mdeep (Andrews 1989:32). 1). San Miguel, thewesternmost of the Northern Channel Islands, islocated approximately 40 km from the mainland coast.Roughly 17 km long and 7 km wide, the island issurrounded by a rocky coastline punctuated withstretches of sandy beach."}, {"url": "http://www.pcas.org/assets/documents/Dentaliuim_001.pdf..pdf", "passage_text": "At least one Dentalium shell artifactwas found displaced in the largest drip feature, whichextended through strata 4, 5A, 5B, and 5C, and it ispossible that others were, as well.In the laboratory at the University of Oregon, allscreen residuals from Unit 1 were separated into1/8th-inch and 1/16th-inch fractions. 1). San Miguel, thewesternmost of the Northern Channel Islands, islocated approximately 40 km from the mainland coast.Roughly 17 km long and 7 km wide, the island issurrounded by a rocky coastline punctuated withstretches of sandy beach."}, {"url": "https://en.wikipedia.org/wiki/Dentalium_shell", "passage_text": "Traditionally, the shells of Antalis pretiosum (previously known as Dentalium pretiosum, the precious dentalium (a species which occurs from Alaska to Baja California) were harvested were harvested from deep waters around the Pacific Northwest coast of North America, especially off the coast of Vancouver Island. Nuu-chah-nulth peoples were the primary harvesters of dentalium shells. Among the Northwest Coastal tribes, the shells were valued for both trade and adornment. Young Nuu-chah-nulth girls of high status wore elaborate dentalia jewelry."}]