[{"url": "http://www.gardenandflowers.com/facts_7209643_much-vegetable-plants-need-garden_.html", "passage_text": "Plant Spacing. When planting from seed, sow seeds at the intervals recommended on the seed packet. When seedlings emerge, they may be thinned to the required spacing. For example, broccoli, cauliflower, peppers and watermelon should be thinned to ensure 18 to 24 inches of space between plants. Peas, lettuce, spinach and carrots may grow closer together, requiring only 2 to 3 inches on each side. Tomatoes require 24 to 36 inches of space, depending on the mature height of the variety"}, {"url": "http://www.tropicalpermaculture.com/growing-watermelons.html", "passage_text": "If you like growing things in neat rows, or if you want to plant a large area, grow watermelons on ridges, like the commercial growers do. Rows should be about 2 m (6 ft) apart and the plants spaced at 30 cm/a foot apart. "}, {"url": "http://www.gardenersnet.com/vegetable/watermel.htm", "passage_text": "For regular watermelons, sow three to four seeds per hill, spacing the hills eight to ten feet apart. Space the rows ten feet apart or more, if you have room. Thin watermelon seedlings in each hill, to two seedlings one week after they have germinated. When planting in rows, space the seeds four to six inches apart and thin seedlings to ten to twelve inches apart. Important: Make sure you know how many days you need to reach maturity for the variety you buy. Give a little more time than the seed packet suggests to reach harvest, before that first killing frost. Days to Maturity: 80 to 90 days for baby bush varieties, and 90 to 100 days or more for the larger varieties. How to Grow Watermelon: Watermelon plants need full sun to grow healthy vines and big frui"}, {"url": "http://www.wikihow.com/Grow-Watermelons", "passage_text": "2. Choose a planting location. Watermelon plants need a minimum of 6 hours of sun every day. They produce large vines that spread and take up a lot of space; plan on allotting a 4 by 6 foot plot for each plant, unless you're planting a mini-watermelon variety. 3. Till the soil. "}, {"url": "http://homeguides.sfgate.com/growing-melons-much-room-34410.html", "passage_text": "The average space needed between hills is 4 to 6 feet. For larger watermelon varieties, leave 6 to 12 feet between hills. For smaller melon varieties, leave about 2 feet between hills. When using the row method, leave about 2 to 3 feet between plants. Space the rows at least 6 feet apart. You'll need a trellis at least 8 feet tall to support the vines of a melon plant. Plant melons at the base of the trellis, spaced 12 inches apart for cantaloupe or honeydew and 24 inches apart for watermelon. Slings made from fabric support the melons as they grow"}, {"url": "http://homeguides.sfgate.com/much-sun-watermelon-plant-need-50893.html", "passage_text": "Full Sun. Watermelons require full sun for proper growth. For full sun, choose a location where watermelons receive eight to 10 hours of direct sunlight. The plants need sun to remain healthy and productive. Choose a garden location where trees, buildings or other structures do not block the sun and shade the plants. Tip for Growing Watermelons. Plant watermelons after all danger of frost have passed, because they cannot withstand even a light frost. Watermelons need good air circulation, so space them about 6 to 12 feet apart. Giving the melons enough space and sun keeps them dry and helps to prevent disease."}]