[{"url": "http://www.mayoclinic.org/drugs-supplements/penicillin-oral-route-injection-route-intravenous-route-intramuscular-route/proper-use/DRG-20062334", "passage_text": "Penicillins (except bacampicillin tablets, amoxicillin, penicillin V, pivampicillin, and pivmecillinam) are best taken with a full glass (8 ounces) of water on an empty stomach (either 1 hour before or 2 hours after meals) unless otherwise directed by your doctor. 1 For bacterial infections: 2  For oral dosage form (oral solution, oral suspension, and tablets): 3  Adults and teenagers—200,000 to 500,000 Units (125 to 312 milligrams [mg]) every four to six hours. 4  Infants and children less than 12 years of age—Dose is based on body weight and must be determin"}, {"url": "http://patient.info/medicine/phenoxymethylpenicillin-for-infection", "passage_text": "0. 12. Make sure you tell your doctor if you are allergic to penicillin. Phenoxymethylpenicillin is a type of penicillin-do not take it if you are allergic to penicillin. Space your doses out evenly over the day and complete the full course of this antibiotic, even if you feel your infection has cleared up. 1 Take phenoxymethylpenicillin exactly as your doctor tells you to. 2  It is usually taken four times daily. 3  Your doctor or pharmacist will tell you how much to take and when to take it, and your dose will also be on the label of the pack to remind you."}, {"url": "http://www.nhs.uk/Conditions/Antibiotics-penicillins/Pages/Introduction.aspx", "passage_text": "Introduction. Antibiotics are medications used to treat – and, in some cases, prevent – bacterial infections. They can be used to treat relatively mild conditions such as acne, as well as potentially life-threatening conditions such as pneumonia. However, antibiotics often have no benefit for many other types of infe"}, {"url": "http://www.answers.com/Q/How_often_do_you_take_penicillin_500_mg", "passage_text": "The prescribed rate is one or two 5/500mg every 4-6hrs. The 500mg in each pill is Tylenol. If you look closely on your label you'll notice a 5/500mg printed there. The narco … tic in each pill is only 5mg, so two of them would be only ten mg.. "}, {"url": "http://en.hesperian.org/hhg/Where_There_Is_No_Dentist:Tooth_Abscess", "passage_text": "Note: If you do not have penicillin, use amoxicillin, 3 times a day for 7 days. Adults and children over 25 kg take 500 mg each dose, and children under 25 kg take 250 mg each dose. To use ampicillin, see Where There Is No Doctor. People allergic to penicillin will also be allergic to amoxicillin and ampicillin. For the doses for serious infections, look at the box below. If you still think an injection is necessary, look at the section on procaine penicillin. Adults and children over 25 kg (60 pounds) of weight should take the same amount of oral"}, {"url": "http://www.nhs.uk/Conditions/Antibiotics-penicillins/Pages/Introduction.aspx", "passage_text": "1 oral antibiotics – tablets, pills and capsules or a liquid that you drink, which can be used to treat most types of mild to moderate infections in the body. 2  topical antibiotics – creams, lotions, sprays or drops, which are often used to treat skin infections. Antibiotics are medications used to treat – and, in some cases, prevent – bacterial infections. They can be used to treat relatively mild conditions such as acne, as well as potentially life-threatening conditions such as pneumonia."}, {"url": "http://www.rxlist.com/amoxicillin-drug/patient-how-to-take.htm", "passage_text": "Do not use this medication if you are allergic to amoxicillin or to any other penicillin antibiotic, such as: 1  ampicillin (Principen, Unasyn). 2  dicloxacillin (Dycill, Dynapen); 3  oxacillin (Bactocill); or. 4  penicillin (Bicillin L-A, PC Pen VK, Pfizerpen), and others. Visit your doctor regularly. If you are being treated for gonorrhea, your doctor may also have you tested for syphilis, another sexually transmitted disease. If you are taking amoxicillin with clarithromycin and/or lansoprazole to treat stomach ulcer, use all of your medications as directed. Read the medication guide or patient instructions provided with each medication. Do not change your doses or medication schedule without your doctor's advice"}, {"url": "http://www.mayoclinic.org/healthy-lifestyle/consumer-health/in-depth/antibiotics/art-20045720", "passage_text": "Overuse of antibiotics. The overuse of antibiotics — especially taking antibiotics even when they're not the appropriate treatment — promotes antibiotic resistance. Antibiotics treat bacterial infections but not viral infections. For example, an antibiotic is an appropriate treatment for strep throat, which is caused by the bacterium Streptococcus pyogenes. "}, {"url": "http://www.nhs.uk/Conditions/Antibiotics-penicillins/Pages/Introduction.aspx", "passage_text": "Doses of antibiotics can be provided in several ways: 1  oral antibiotics – tablets, pills and capsules or a liquid that you drink, which can be used to treat most types of mild to moderate infections in the body. 2  topical antibiotics – creams, lotions, sprays or drops, which are often used to treat skin infections. Antibiotics are medications used to treat – and, in some cases, prevent – bacterial infections. They can be used to treat relatively mild conditions such as acne, as well as potentially life-threatening conditions such as pneumonia."}]