[{"url": "http://www.absa.co.za/deployedfiles/Absacoza/PDFs/Economic%20Research/Property%20Research/Property%20Commentary/2015/01.%20January/Building_Stats_Jan_2015.pdf", "passage_text": "The average building cost of new housing constructed averaged R5 8 12 per square metre in the. first eleven months of 2014, which came to an increase of 1 2,6% y/y from R5 16 per square. metre in the same period last year. Building costs are affected by factors such as building material."}, {"url": "http://www.property24.com/articles/building-a-new-house-is-more-expensive-in-2015/22379", "passage_text": "The building cost of new housing constructed averaged R5 908 per square metre in the period January to April this year, resulting in an increase of 3.2% year-on-year on the building cost of R5 724 per square metre in the corresponding period last year."}, {"url": "http://moladi.com/cost%20per%20square%20metre.htm", "passage_text": "BUILDING A BUILDING B. Example of how building Cost per square meter can vary. Area on plan = 400m Length of walling = 80m Assume 3m high walling @ Currency 200.00/m. Then cost/m = 80 x 3 x 200 400 = Currency 120.00/m-cost per square meter. Area on plan = 400m Length of walling = 208m Assume 3m high walling @ Currency 200.00/m. Then cost/m = 208 x 3 x 200 400 = Currency 312.00/m-cost per square meter. The length of building B thus resulted in an additional expense of Currency 76,800.00 over that of Building A influencing "}, {"url": "http://www.absa.co.za/deployedfiles/Absacoza/PDFs/Economic%20Research/Property%20Research/Property%20Commentary/2014/03.%20March/Building%20stats%20Jan%202014.pdf", "passage_text": "number of new housing units built in January compared with a year ago. The average building cost of new housing constructed came to R5 586 per square metre in. January 2014, which was up by 15,6% from R4 831 per square metre in the corresponding. month last year, when building costs rose by 14,8% y/y."}, {"url": "http://onproperty.com.au/build-a-house/", "passage_text": "The cheapest you can build a house for in Australia is somewhere around $155,000. Front to back slope – $6,000/metre slope Side by side slope – $9,000/metre slope. 4 bedroom homes range from $130,000 (160sqm) to $190,000 (300sqm) when looking at the most basic range of properties."}]