[{"url": "http://animals.howstuffworks.com/mammals/wallaby-vs-kangaroo.htm", "passage_text": "As a rule, the kangaroo is generally much larger than the wallaby. The kangaroo has more height between its ankles and knees, which makes its legs seem out of proportion to its body. The kangaroo's legs are built for speed on open terrain. The wallaby's more compact legs are built for agility in forested areas. "}, {"url": "http://www.diffen.com/difference/Kangaroo_vs_Wallaby", "passage_text": "Both the kangaroo and the wallaby belong to the macropod family, which contains large-footed animals. They have oversized feet that they use for jumping — their only form of locomotion. Both these animals also belong to marsupial infraclass, meaning they have a front-opening pouch to carry their babies. "}, {"url": "https://en.wikipedia.org/wiki/Wallabee", "passage_text": "For other uses, see Wallaby (disambiguation) . A wallaby is a small-or mid-sized macropod found in Australia and New Guinea. They belong to the same taxonomic family as kangaroos and sometimes the same genus, but kangaroos are specifically categorised into the six largest species of the family. "}, {"url": "https://simple.wikipedia.org/wiki/Wallaby", "passage_text": "Wallabies are marsupials from the islands of Australia, Tasmania, New Zealand and New Guinea. They are small-to medium-sized kangaroos. There are 30 different types of wallabies that live in many types of habitats, including rocky areas, grasslands, forests and swamps. "}, {"url": "http://a-z-animals.com/animals/wallaby/", "passage_text": "The wallaby is most closely related to Australia's largest marsupial, the kangaroo. The wallaby is generally smaller than a kangaroo although some wallaby individuals have been known to reach 6ft tall. There are roughly 30 different species of wallaby found in a variety of habitats throughout the Australian continent. The wallaby is a marsupial meaning that the female wallaby has a pouch on her tummy in which to raise her young. The female wallaby gives birth to a single baby wallaby (occasionally twins), known as a joey, after a gestation period of only a month."}, {"url": "http://www.answers.com/Q/FAQ/10837", "passage_text": "All wallabies are in the kangaroo family, but the term wallaby is used for a number of the smaller and more stocky species of the family. Wallaby can refer to both the smaller types of kangaroo, or to the genus Wallabia. All are Macropods. The word 'wallaby' refers to any of about thirty species of macropod (Family Macropodidae). A wallaby is smaller than a kangaroo or wallaroo. It is actually a member of the kangaroo family, with its own distinct species and classification."}, {"url": "http://www.answers.com/Q/What_is_a_wallaby", "passage_text": "A wallaby is one of any of about thirty species of macropod (Family Macropodidae). It is smaller than a kangaroo or wallaroo. It is actually a member of the kangaroo family, with its own distinct species and classification. Wallabies are native to Australia and are grouped/classified according to the habitat in which they live. Thus, there are swamp wallabies, brush wallabies, and rock wallabies. Any member of the kangaroo family, or macropods, is related to the wallaby, and this includes Red Kangaroos, Grey Kangaro … os, Pademelons, Tree Kangaroos, Quokkas and Euros (Wallaroos), to name a few."}, {"url": "https://en.wikipedia.org/wiki/Wallaby", "passage_text": "The term wallaby is an informal designation generally used for any macropod that is smaller than a kangaroo or wallaroo that has not been designated otherwise. There are 11 species of brush wallabies (g. Macropus, s.g. Protemnodon). Their head and body length is 45 to 105 cm and the tail is 33 to 75 cm long. The six named species of rock-wallabies (g. Petrogale) live among rocks, usually near water; two species are endangered. An adult female wallaby is known as a doe, flyer, or jill. A group of wallabies is called a court, mob, or troupe. Forest-dwelling wallabies are known as  pademelons  (genus Thylogale) and dorcopsises (genera Dorcopsis and Dorcopsulus)."}, {"url": "https://en.wikipedia.org/wiki/Wallaby", "passage_text": "Dorcopsulus) are native to the island of New Guinea. The dwarf wallaby is the smallest member of the genus and the smallest known member of the kangaroo family. Its length is about 46 cm from nose to tail, and it weighs about 1.6 kg. An adult female wallaby is known as a doe, flyer, or jill. A group of wallabies is called a court, mob, or troupe. Forest-dwelling wallabies are known as  pademelons  (genus Thylogale) and dorcopsises (genera Dorcopsis and Dorcopsulus)."}, {"url": "http://animals.nationalgeographic.com/animals/mammals/wallaby/", "passage_text": "Size relative to a 6-ft (2-m) man: Wallabies are members of the kangaroo clan found primarily in Australia and on nearby islands. There are many wallaby species, grouped roughly by habitat: shrub wallabies, brush wallabies, and rock wallabies. Hare wallabies are named for their size and their hare-like behavior. All wallabies are marsupials or pouched mammals. Wallaby young are born tiny, helpless, and undeveloped."}]