[{"url": "http://www.payscale.com/research/US/Job=Cardiovascular_Advanced_Registered_Nurse_Practitioner_(ARNP)/Salary", "passage_text": "(United States). A Cardiovascular Advanced Registered Nurse Practitioner (ARNP) earns an average salary of $90,151 per year. Pay for this job does not change much by experience, with the most experienced earning only a bit more than the least. People in this job generally don't have more than 20 years' experience. $73,066 - $114,868. "}, {"url": "http://www.aspiringnurse.com/cardiac-nurse/cardiac-nurse-salary/", "passage_text": "Cardiac Nurse Salary by College. In order to verify the value of your college education, you may want to look over the salary levels for graduates at different universities. Here are some of the most popular colleges for cardiac nurses: 1  Emory University: $77,430 – $82,738 per year. 2  University of Florida: $75,000 – $89,528 per year. Cardiac Nurse Salary by Certification. You may need more than a college degree to become a cardiac nurse, so you will inevitably have to take some certification exams in this career. Those certifications can lead to better salary levels over time, including: 1  Advanced Cardiac Life Support: $66,497 – $106,923 per year."}, {"url": "http://www.miminc.org/emergency-room-er-nurse-salary/", "passage_text": "Emergency Room Nurse Salary. The average yearly salary for an ER nurse is $60.772. The highest paid ER nurses receive $88,067 per year; while the lowest paid receive $44,414 per year. The average hourly salary for an ER nurse ranges from $19.27 to $47.30. ER nurses also receive annual profit sharing. "}, {"url": "http://www.aspiringnurse.com/cardiac-nurse/cardiac-nurse-salary/", "passage_text": "Cardiac Nurse Salary by Employer Type. The type of employer you work with will play one of the biggest roles in calculating your salary. Here is a list of some of the most common employer types you may come across in the future: 1  College or University: $69,776 – $87,497 per year. 2  Company: $71,517 – $104,950 per year. Cardiac Nurse Salary by Certification. You may need more than a college degree to become a cardiac nurse, so you will inevitably have to take some certification exams in this career. Those certifications can lead to better salary levels over time, including: 1  Advanced Cardiac Life Support: $66,497 – $106,923 per year."}, {"url": "http://www.aspiringnurse.com/cardiac-nurse/cardiac-nurse-salary/", "passage_text": "Since cardiac nurses can work in a wide range of industries, it is important to learn about how your industry will impact your salary. Possible fluctuations by industry include: 1  Acute Care Hospital: $59,180 – $105,570 per year. 2  Cardiology: $71,108 – $112,995 per year. 3  Cardiothoracic Surgery: $58,382 – $128,22 per year. Cardiac Nurse Salary by Certification. You may need more than a college degree to become a cardiac nurse, so you will inevitably have to take some certification exams in this career. Those certifications can lead to better salary levels over time, including: 1  Advanced Cardiac Life Support: $66,497 – $106,923 per year."}, {"url": "http://www1.salary.com/Cardiac-Technician-salary.html", "passage_text": "For example the median expected annual pay for a typical Cardiac Technician in the United States is $40,959, so 50% of the people who perform the job of Cardiac Technician in the United States are expected to make less than $40,959. Source: HR Reported data as of October 2015. 1  Salary. 2  Salary + Bonus. 3  Benefits. "}, {"url": "http://www1.salary.com/Nurse-Practitioner-Salary.html", "passage_text": "For example the median expected annual pay for a typical Nurse Practitioner in the United States is $97,688, so 50% of the people who perform the job of Nurse Practitioner in the United States are expected to make less than $97,688. Source: HR Reported data as of October 2015. 1  Salary. 2  Salary + Bonus. "}, {"url": "http://money.usnews.com/careers/best-jobs/registered-nurse/salary", "passage_text": "$67,930. In 2013, registered nurses made an average salary of $68,910, which is pretty good pay compared with some of the other health care professions on this year’s Best Jobs list. The highest-paid RN positions are clustered in California, including the metropolitan areas of San Francisco, San Jose and Vallejo. In 2013, registered nurses made an average salary of $68,910, which is pretty good pay compared with some of the other health care professions on this year’s Best Jobs list."}, {"url": "http://www.indeed.com/salary/Cardiac-Nurse.html", "passage_text": "Average Cardiac Nurse salaries for job postings nationwide are 10% higher than average salaries for all job postings nationwide. "}]