[{"url": "http://www.sparknotes.com/drama/misanthrope/summary.html", "passage_text": "Alceste, a French aristocrat, raves to his friend Philinte about the corruption of French society. Alceste identifies hypocrisy as one of mankind's worst flaws. Despite Philinte's objections, Alceste insists that truth and honesty, no matter how painful, are essential to true integrity. Alceste leaves to find out more about the situation. He finds Philinte, who counsels him to challenge the verdict issued against him. Alceste refuses, stating that he wants the verdict to stand as an example of human corruption. He announces that he will isolate himself from society forever."}, {"url": "https://en.wikipedia.org/wiki/Misanthropy", "passage_text": "Misanthropy is the general hatred, distrust or disdain of the human species or human nature. A misanthrope or misanthropist is someone who holds such views or feelings. The word's origin is from the Greek words μῖσος (misos, hatred) and ἄνθρωπος (anthrōpos, man, human). The condition is often confused with asociality. Martin Heidegger had also been said to show misanthropy in his concern of the they—the tendency of people to conform to one view, which no one has really thought through, but is just followed because, they say so. This might be thought of as more of a criticism of conformity rather than people in general."}, {"url": "http://www.rightdiagnosis.com/m/misanthropy/intro.htm", "passage_text": "Misanthropy: Introduction. Misanthropy: An exaggerated or irrational hatred of mankind. Sufferers have a great distrust of human nature and tend to dislike or distrust other people. More detailed information about the symptoms, causes, and treatments of Misanthropy is available below. Read about other experiences, ask a question about Misanthropy, or answer someone else's question, on our message boards: 1  I can not get a diagnosis. 2  Please help. 3  Tell us your medical story."}, {"url": "http://www.merriam-webster.com/dictionary/misanthropy", "passage_text": "Full Definition of MISANTHROPY. : a hatred or distrust of humankind. See misanthropy defined for English-language learners. See misanthropy defined for kids. ADVERTISEMENT. "}, {"url": "http://www.merriam-webster.com/dictionary/misanthrope", "passage_text": "1 Rather she is the genuine article, a misanthrope so pure she can't understand “why solitary confinement is considered punishment.” —Lewis Burke Frumkes, New York Times Book Review, 10 May 1992. 1 The young people thought him a gloomy misanthrope, because he never joined in their sports—the old men thought still more hardly of him, because he followed no trade, … —Washington Irving, [Salmagundi November 24, 1807], in History, Tales, and Sketches, 1977."}, {"url": "http://www.sparknotes.com/drama/misanthrope/summary.html", "passage_text": "When Oronte asks Alceste's opinion, Alceste suggests that Oronte give up his aspirations as a poet. Insulted, Oronte leaves. Alceste confronts his love interest Celimene (célimène whose house is the setting for the) play about her recent, behavior which he considers. inappropriate Alceste leaves to find out more about the situation. He finds Philinte, who counsels him to challenge the verdict issued against him. Alceste refuses, stating that he wants the verdict to stand as an example of human corruption. He announces that he will isolate himself from society forever."}, {"url": "http://www.merriam-webster.com/dictionary/misanthrope", "passage_text": "1 Many members of the contemporary movie audience, only marginally socialized, would have made a misanthrope of Gandhi; they undermine every argument for intelligent design in the universe. 1 The young people thought him a gloomy misanthrope, because he never joined in their sports—the old men thought still more hardly of him, because he followed no trade, … —Washington Irving, [Salmagundi November 24, 1807], in History, Tales, and Sketches, 1977."}, {"url": "http://psychology.wikia.com/wiki/Misanthropy", "passage_text": "Misanthropy is a personality trait characterized by a general dislike, distrust, or hatred of the human species or a disposition to dislike and/or distrust other people's silent consensus about reality. The word comes from the Greek words μίσος (misos, hatred) and άνθρωπος (anthrōpos, man, human being). Misanthropy may be motivated by feelings of isolation or social alienation, or simply contempt for the prevailing characteristics of humanity. Misanthropy is commonly misinterpreted and distorted as a widespread and individualized hatred of humans."}, {"url": "http://www.merriam-webster.com/dictionary/misanthrope", "passage_text": "Full Definition of MISANTHROPE. : a person who hates or distrusts humankind. See misanthrope defined for English-language learners. See misanthrope defined for kids. 1 The young people thought him a gloomy misanthrope, because he never joined in their sports—the old men thought still more hardly of him, because he followed no trade, … —Washington Irving, [Salmagundi November 24, 1807], in History, Tales, and Sketches, 1977."}]