[{"url": "http://www.cheese.com/halloumi/", "passage_text": "Halloumi. Halloumi is a Cypriot firm, brined, slightly springy white cheese, traditionally made from a mixture of goat and sheep milk, although these days cow’s milk is also used. Its texture is similar to that of mozzarella or thick feta, except that it has a strong, salty flavour imbibed from the brine preserve. Cooking the Halloumi removes all its saltiness and empowers it with a creamy texture. Since the cheese has a high melting point, it can be easily fried or grilled. Its unusualness lies in the preparation of the cheese where no acid or acid-producing bacterium is required. Halloumi is generally served during the warmer months with watermelon, due to its refreshing qualities"}, {"url": "https://en.wikipedia.org/wiki/Halloumi", "passage_text": "Traditional halloumi is made from unpasteurised sheep and goat milk. Many people also like halloumi that has been aged; kept in its own brine, it is much drier, much stronger and much saltier. This cheese is very different from the milder halloumi that Western chefs use as an ingredient. Cypriots like eating halloumi with watermelon in the warm months, and as halloumi and lountza – a combination of halloumi cheese and either a slice of smoked pork, or a soft lamb sausage."}, {"url": "http://halloumicheese.com/", "passage_text": "Halloumi, the incredible Cypriot gourmet cheese, has been around for hundreds of years but is just now catching on in the United States. Halloumi cheese is made by hand from a mix of sheep's and goat's milk. The milk is produced in the villages surrounding the Avdhimou area between Limassol and Paphos districts. The soft, springy, oval-shaped curd resembles a fresh mozzarella and has a mild yet tangy flavor. The best part is that it's so versatile"}, {"url": "http://www.huffingtonpost.com/2012/06/18/halloumi-recipes_n_1601001.html", "passage_text": "Enjoy grilled cheese without the bread -- it's the best way to eat it in the summertime. And not just any cheese, but halloumi. Halloumi is a semi-hard cheese made from a mixture of sheep, goat and cow's milk that's popular in Cypriot cuisine. (Cypriot is a blend of Greek, Turkish, Italian and Middle Eastern foods.). Halloumi has a high melting point so it can be fried or grilled and still keep its shape while getting a nice golden crust on the exterior and becoming tenderly soft inside. While that's a pretty great quality for a cheese to have, even better is its flavor."}, {"url": "http://vegetarian.about.com/od/vegetarianbarbecuerecipes/r/Grilled-Halloumi-Cheese.htm", "passage_text": "Grilled halloumi cheese photo by flickr user Mags L. Grilled halloumi cheese: It's trendy, it's easy, it's gourmet and it's quick, but the real reason to try grilled halloumi cheese on your indoor our outdoor grill is that it tastes, quite simply, incredible. If you've never tried grilled halloumi cheese, you simply must learn how to do it with this easy recipe. "}, {"url": "https://en.wikipedia.org/wiki/Halloumi", "passage_text": "It has a high melting point and so can easily be fried or grilled. Halloumi is set with rennet and is unusual in that no acid or acid-producing bacterium is used in its preparation. Halloumi is popular in the Levant, Greece and Turkey. Cypriots like eating halloumi with watermelon in the warm months, and as halloumi and lountza – a combination of halloumi cheese and either a slice of smoked pork, or a soft lamb sausage."}, {"url": "http://vegetarian.about.com/od/glossary/qt/What-is-Halloumi-Cheese.htm", "passage_text": "Halloumi cheese, sometimes just called grilling cheese, is making it's way up the list of popular food trends-and with good reason! Depending on your recipe, Halloumi is not usually easy to substitute. Tofu or Indian paneer may be used in some recipes, but it won't be quite the same as halloumi or a similar grillable cheese. If you can't find halloumi cheese locally where you live you may want to try shopping online for Halloumi."}, {"url": "https://en.wikipedia.org/wiki/Halloumi", "passage_text": "Halloumi cheese originated in Cyprus and was initially made during the Medieval Byzantine period (AD 395 – 1191), by the local Greek population, subsequently gaining popularity throughout the Middle East region. Cypriots like eating halloumi with watermelon in the warm months, and as halloumi and lountza – a combination of halloumi cheese and either a slice of smoked pork, or a soft lamb sausage."}, {"url": "http://vegetarian.about.com/od/glossary/qt/What-is-Halloumi-Cheese.htm", "passage_text": "Plain, Halloumi is firm, salty and a bit rubbery, perhaps most comparable to a thick feta in taste with a smoother texture, though the taste of halloumi is certainly unique. But halloumi is not meant to be eaten plain! Halloumi should be warmed, grilled, or otherwise fired up in order to really be enjoyed. Depending on your recipe, Halloumi is not usually easy to substitute. Tofu or Indian paneer may be used in some recipes, but it won't be quite the same as halloumi or a similar grillable cheese. If you can't find halloumi cheese locally where you live you may want to try shopping online for Halloumi."}, {"url": "http://www.cheesewiki.com/halloumi", "passage_text": "Halloumi or haloumi (Greek χαλούμι, Turkish hellim, Arabic حلوم ḥallūm) is a traditional Cypriot cheese that is also popular in the rest of the Middle East and Greece, and is now made the world over. It is made from a mixture of goat's and sheep milk, although some halloumi can be bought that also contains cow's milk. "}]