[{"url": "https://en.wikipedia.org/wiki/Glen_Eden_(ski_area)", "passage_text": "Lake Kelso also provides a natural, economical and convenient source of very cold water for snow-making for the Glen Eden Ski & Snowboard Centre; negating the need to use water from Halton's main line utility service. The Park also offers 20 campsites, 18 reserve-able picnic sites, and two camping/picnic mixed sites. Glen Eden Ski & Snowboard Centre is located in the park and offers downhill skiing, snowboarding and tubing during the winter months. In addition, the Halton Region Museum is also located on the Kelso grounds."}, {"url": "http://www.glen-eden.com/", "passage_text": "We are an American company that manufacturers wool carpets of exceptional quality. We strive to exceed your expectations with luxurious textures that invite touch, patterns that beckon the eye, and colors that speak the language of any decor. "}, {"url": "http://www.glen-eden.com/care-and-maintenance", "passage_text": "Care & Maintenance. To protect the investment made in a Glen Eden Wool carpet or rug, it's important to follow prescribed maintenance periodically to keep it looking and performing at its best. Cleaning at regular intervals-rather than waiting until the carpet is heavily soiled-actually extends its life. Properly maintained carpets enhance the appearance and atmosphere of interiors either contract or residential. A well-maintained Glen Eden Wool residential or commercial carpet absorbs dirt, airborne dust particles, fumes and noise. It even makes the indoor environment more hygienic. Maintenance makes sense. Maintaining the beauty of wool carpet is exceptionally easy-in fact, a lot easier than most people think"}, {"url": "http://www.booking.com/hotel/za/glen-eden-farm.html", "passage_text": "After booking, all of the property’s details, including telephone and address, are provided in your booking confirmation and your account. Glen Eden Farm offers pet-friendly accommodations in Rietvlei Number 1. Swellendam is 16 miles away. Free private parking is available on site. The accommodation has a sitting and dining area. Some units include a terrace and/or patio with mountains views. "}, {"url": "http://gleneden.com/about-us/directions/", "passage_text": "Glen Eden is centrally located in an unincorporated area of the city of Corona, at 25999 Glen Eden Road in Corona, California, 92883, USA. We are easily accessible from the nearby 15 freeway. Refer to the Google map below. You can get specific directions to Glen Eden by entering a starting address. Of course, if you get lost or aren’t sure how to get here, we’d be happy to help. Just call us at (800) 843-6833 or (951) 277-4650."}, {"url": "http://www.streetadvisor.com/glen-eden-hayward-alameda-county-california", "passage_text": "Pretty Good Neighborhood . The Glen Eden neighborhood at the far southwestern end of Hayward is relatively typical of Hayward, except for the fact that it has a newer section filled with Mediterranean style homes. This section, built in the 1990s, is nice with red-tiled roofs and adobe walls. the rest of Glen Eden is pretty much made up of older Ranch style homes, like most of Hayward. The median home price in Glen Eden is $275K. There are also a fair number of apartments here. You can rent a 1 bedroom for around $1250"}, {"url": "https://en.wikipedia.org/wiki/Glen_Eden_(ski_area)", "passage_text": "The Glen Eden ski area is located within the Kelso Conservation Area, with skiing, snowboarding, and snow tubing. The ski area is owned and operated by the Halton Region Conservation Authority. The Glen Eden ski area is highly visible from the eastbound lane of Highway 401 near Milton, Ontario. The Park also offers 20 campsites, 18 reserve-able picnic sites, and two camping/picnic mixed sites. Glen Eden Ski & Snowboard Centre is located in the park and offers downhill skiing, snowboarding and tubing during the winter months. In addition, the Halton Region Museum is also located on the Kelso grounds."}, {"url": "http://gleneden.on.ca/", "passage_text": "Message from the Summit. As I write this, we are in the heat of the summer. Despite summer camps, mountain bike races and the buzz of Kelso during the busy July and August months, the countdown to Glen Eden’s opening day has begun! Last season was certainly one for the books. Looking forward to the 2015/16 season, our priority will continue to be the guest experience. We have been working on new ways to streamline your experience from lift ticket or season pass purchases to finding new and innovative ways to enhance the guest experience through efficiencies with parking, rentals and more."}]