[{"url": "http://www.moveforwardpt.com/SymptomsConditionsDetail.aspx?cid=f85bbe8f-685c-43bf-bb51-9bc43dd8fb01", "passage_text": "A femur fracture is a break, crack, or crush injury of the thigh bone. It is sometimes referred to as a hip fracture; or broken hip if the break is in the upper part of the bone near the hip-joint area. Femur fractures that are simple, short cracks in the bone usually do not require surgery."}, {"url": "http://ezinearticles.com/?How-Much-Force-Can-Our-Bones-Handle-Before-They-Break&id=7242657", "passage_text": "The more force you apply to a bone, the easier it is to break it. In some studies, it was found out that bones can handle about 3,300 Newton of force if thrown into a rib and up to 4,000 Newton if released onto the femur."}, {"url": "http://www.healthgrades.com/conditions/fractured-femur", "passage_text": "A fractured femur is a breakage in the thigh bone (femur), the longest, strongest and heaviest bone in the human body. The strength and size of the femur means that under typical circumstances, a large force or extensive trauma is needed in order to result in a fracture."}, {"url": "http://scienceline.ucsb.edu/getkey.php?key=3088", "passage_text": "That depends on the bone. It is very easy to fracture a small bone, especially if the pressure is applied across the weakest point. I'm not sure exactly how much pressure is needed, but I can tell you that as little as 25 pounds of pressure applied to one of your small bones will cause a fracture."}, {"url": "http://www.answers.com/Q/How_much_force_can_your_femur_hold", "passage_text": "A fractured femur can result in 1500 to 3000 mL of hemorrhage. If an artery or vein has been ruptured on the fracture, depends on the extension and seriousness of it."}, {"url": "http://madsci.org/posts/archives/2010-12/1291221694.An.r.html", "passage_text": "A sharp edge would need a much smaller force than a blunt one. Assuming we can scale the force down to the size of the stapes which is about 3mm wide, with the typical femur width of 3cm, this would mean a pressure of 170 PSI (100,000 kilograms per square meter) would be enough to 'break' the stapes."}, {"url": "http://madsci.org/posts/archives/2010-12/1291221694.An.r.html", "passage_text": "p245). The force needed to break a human femur is about 1700 PSI or over 1 million kilograms per square meter (according to emedicine http://emedicine.medscape.com) which agrees with numerous other sources around the internet."}]