[{"url": "http://www.answers.com/Q/What_is_oxidation_of_metal", "passage_text": "The oxidation of a metal occurs when the metal loses one or more electrons, so that the atoms of the metal go from the neutral state and become a positively charge ion. This commonly results in the formation of a metal oxide (in the case of iron, that is known as rust). It occurs in the presence of oxygen."}, {"url": "http://www.rustblock.com/corrosion-process-explained.html", "passage_text": "The electrochemical degradation of metals due to reaction with their environment. oxidation-reduction reaction where electrons are released at the anode and taken up at the cathode. the general disintegration of surface metal through oxidation. Process by which metals are eaten away by salt water and air."}, {"url": "http://www.nobelprize.org/nobel_prizes/chemistry/laureates/1992/illpres/oxidation.html", "passage_text": "Oxidation of metals. Most metals are oxidized by the oxygen in air. This process is called corrosion. Electrons leap from the metal to the oxygen molecules. The negative oxygen ions which are thus formed penetrate into the metal, causing the growth of an oxide surface. As the oxide layer grows the rate of electron transfer decreases. The corrosion stops and the metal is made passive."}, {"url": "http://metals.about.com/od/metallurgy/g/Oxidation.htm", "passage_text": "Definition: Oxidation is a chemical process by which an ionic chemical reaction occurs at the surface of a metal when in the presence of oxygen. This can happen in air or when metal is exposed to water or acids."}, {"url": "http://corrosion-doctors.org/Principles/What-is.htm", "passage_text": "Degradation of the metal substrate by oxidation. That is the formation of an oxide layer on the metal surface. This process requires that the metal surface be exposed to oxygen, and is favoured in the presence of water."}, {"url": "http://www.lpdlabservices.co.uk/problem_solving/typical_technical_expertise/corrision.php", "passage_text": "Corrosion, oxidation and degradation commonly spoil the aesthetics, leads to component weakening, the requirement for remedial actions and, in the worse case, failure of materials in products."}]