[{"url": "http://www.drugs.com/pro/chantix.html", "passage_text": "1 Most people will take Chantix for up to 12 weeks. 2  If you have completely quit smoking by 12 weeks, your doctor may prescribe Chantix for another 12 weeks to help you stay cigarette-free. 3  Take Chantix after eating and with a full glass (8 ounces) of water. 4  This dosing schedule may not be right for everyone."}, {"url": "http://www.chantix.com/what-to-expect", "passage_text": "Choose a date to quit smoking. Your quit date is the day you stop smoking completely. Do your best to stick to it. You can start CHANTIX and then pick your quit date up to 35 days after you start taking it. Talk to your doctor about choosing a quit date with CHANTIX."}, {"url": "http://www.chantix.com/what-to-expect", "passage_text": "Your dose will increase slowly over the first week (see table below). CHANTIX is recommended to be taken for 12 weeks (3 months). Talk to your doctor if you are having any side effects. Always take CHANTIX with food and a full glass (8 oz) of water. Talk to your doctor about how to quit smoking."}, {"url": "http://www.fda.gov/downloads/Drugs/DrugSafety/ucm088569.pdf", "passage_text": "• Most people will take CHANTIX for up to 12 weeks. If you have completely quit smoking by 12 weeks, your doctor may. prescribe CHANTIX for another 12 weeks to help you stay cigarette-free. • Take CHANTIX after eating and with a full glass (8 ounces) of water. • This dosing schedule may not be right for everyone."}, {"url": "http://www.coreynahman.com/chantix.html", "passage_text": "Chantix is a prescription pill taken twice per day that is designed to help adults stop smoking. Chantix comes in two strengths. It is available as a white tablet (which contains 0.5mg of Chantix) and a blue pill (that contains 1 mg of Chantix)."}, {"url": "http://www.rxwiki.com/chantix", "passage_text": "1 Take Chantix after eating and with a full glass (8 ounces) of water. 2  Most people will take Chantix for up to 12 weeks. 3  If you have completely quit smoking by 12 weeks, your doctor may prescribe Chantix for another 12 weeks to help you stay cigarette-free."}]