[{"url": "https://en.wikipedia.org/wiki/Defined_contribution_plan", "passage_text": "In a defined contribution plan, fixed contributions are paid into an individual account by employers and employees. The contributions are then invested, for example in the stock market, and the returns on the investment (which may be positive or negative) are credited to the individual's account. For example, the number of defined contribution plans in the US has been steadily increasing, as more and more employers see pension contributions as a large expense avoidable by disbanding the defined benefit plan and instead offering a defined contribution plan."}, {"url": "https://en.wikipedia.org/wiki/Defined_contribution_plan", "passage_text": "In the United States, the legal definition of a defined contribution plan is a plan providing for an individual account for each participant, and for benefits based solely on the amount contributed to the account, plus or minus income, gains, expenses and losses allocated to the account (see 26 U.S.C. § 414(i)). For example, the number of defined contribution plans in the US has been steadily increasing, as more and more employers see pension contributions as a large expense avoidable by disbanding the defined benefit plan and instead offering a defined contribution plan."}, {"url": "http://www.myretirementpaycheck.org/retirement-plans/defined-benefit-plans.aspx", "passage_text": "About Defined Contribution Plans. A defined contribution plan specifies how much money will go into a retirement plan today. The amount typically is either a percentage of an employee's salary or a specific dollar amount."}, {"url": "http://www.investopedia.com/terms/d/definedcontributionplan.asp", "passage_text": "DEFINITION of 'Defined-Contribution Plan'. A retirement plan in which a certain amount or percentage of money is set aside each year by a company for the benefit of the employee. There are restrictions as to when and how you can withdraw these funds without penalties. Next Up"}, {"url": "http://financial-dictionary.thefreedictionary.com/Defined+contribution+plan", "passage_text": "Defined Contribution Plan. A retirement plan in which the employee and/or employer contribute a set dollar amount each month. The benefits of a defined contribution plan are not set, and depend upon how well the contributions are invested before the pensioner starts to make withdrawals."}, {"url": "https://en.wikipedia.org/wiki/Defined_contribution", "passage_text": "Retirement plans may be classified as defined benefit or defined contribution according to how the benefits are determined. A defined benefit plan guarantees a certain payout at retirement, according to a fixed formula which usually depends on the member's salary and the number of years' membership in the plan. In the United States, the legal definition of a defined contribution plan is a plan providing for an individual account for each participant, and for benefits based solely on the amount contributed to the account, plus or minus income, gains, expenses and losses allocated to the account (see 26 U.S.C. § 414(i))."}, {"url": "https://en.wikipedia.org/wiki/Defined_contribution_plan", "passage_text": "In contrast, a Defined Contribution retirement plan is an arrangement where an employer, during the time a person is employed, puts money in a registered retirement account on the employee's behalf. For example, the number of defined contribution plans in the US has been steadily increasing, as more and more employers see pension contributions as a large expense avoidable by disbanding the defined benefit plan and instead offering a defined contribution plan."}, {"url": "http://financial-dictionary.thefreedictionary.com/Defined+contribution+plan", "passage_text": "In a defined contribution retirement plan, the benefits -- that is, what you can expect to accumulate and ultimately withdraw from the plan -- are not predetermined, as they are with a defined benefit plan. The benefits of a defined contribution plan are not set, and depend upon how well the contributions are invested before the pensioner starts to make withdrawals."}, {"url": "https://en.wikipedia.org/wiki/Defined_contribution_plan", "passage_text": "A defined contribution (DC) plan is a type of retirement plan in which the employer, employee or both make contributions on a regular basis. For example, the number of defined contribution plans in the US has been steadily increasing, as more and more employers see pension contributions as a large expense avoidable by disbanding the defined benefit plan and instead offering a defined contribution plan."}]