[{"url": "http://www.finchinfo.com/birds/finches/species/blue_faced_parrot_finch.php", "passage_text": "Although Parrot Finches may become sexually mature at 4-5 months of age, many breeders recommend waiting until the birds are at least 8-10 months of age before breeding them. 1  Blue-faced Parrot Finch-Species profile. They do not tend to clump together on perches nor allo-preen, although young blue-faced parrot finches fostered by Society Finches may exhibit some of these behaviors. In the wild, these finches forage on the ground as well as among grass & low bushes, eating grass seeds, bamboo seeds, fig seeds, and termites."}, {"url": "http://www.finchinfo.com/birds/finches/species/blue_faced_parrot_finch.php", "passage_text": "Limit one pair of Blue-faced parrot finches per breeding enclosure, as these birds do not breed well in colony fashion. Because they prefer to nest in dense cover, Blue-faced parrot finches are unlikely to breed well in cages, and instead should be bred in large, densely planted aviaries. They do not tend to clump together on perches nor allo-preen, although young blue-faced parrot finches fostered by Society Finches may exhibit some of these behaviors. In the wild, these finches forage on the ground as well as among grass & low bushes, eating grass seeds, bamboo seeds, fig seeds, and termites."}, {"url": "http://www.finchinfo.com/birds/finches/species/red_throated_parrot_finch.php", "passage_text": "Red-throated Parrot Finches. 1  Red-headed Parrot Finch-Introductory article by Bruce Dixon. 2  The Red-faced Parrot Finch-Detailed species profile, includes photos of mutations. Red-headed Parrot Finch, Red-headed Parrotfinch, Red throated Parrotfinch, Red-throated Parrotfinch, Red-throated Parrot-Finch. New Caledonia, an island about 800 miles off the Queensland coast. Over the entire island of New Caledonia. Lively, inquisitive, peaceful."}, {"url": "http://www.theparrotfinches.com/trichroa.htm", "passage_text": "The Blue-faced parrot finch is easy to cater for and breed in captivity. They will thrive on a good seed mix, the occasional greens, soaked seed and egg food. Blue-faced parrot finches love a good bath, so make sure that you supply clean fresh water daily. They are sometimes found in flocks of 15-30 birds feeding on seeds of grasses, fruits, figs and a variety of live foods including termites and other small insects. Description: Length: 4 to 4 inches (11.5 to 12 cm). The Blue-faced parrot finch is heavy built bird it has a vivid blue face mask."}, {"url": "http://www.parrot-finches.com/blue_faced/blue-faced-1.htm", "passage_text": "General-The normal bird is primarily green with a deep blue mask. The Blue-faced Parrot Finch lies midway between the very active, inquisitive, friendly, Red-headed Parrot Finch and the shy, reclusive, relatively inactive Pin-tailed. It is an engaging character. Housing-Blue-faced Parrot Finches ideally should be bred as single pairs in flights or large cages. A metre cube is my minimum. Although they will breed in relatively small cages, but obesity can occur and birds lose condtition. I have tried to colony breeding with absolutely no success."}, {"url": "http://www.theparrotfinches.com/trichroa.htm", "passage_text": "The Blue-faced parrot finch inhabits forests edges, cultivated areas and plantations. They are sometimes found in flocks of 15-30 birds feeding on seeds of grasses, fruits, figs and a variety of live foods including termites and other small insects. Description: Length: 4 to 4 inches (11.5 to 12 cm). The Blue-faced parrot finch is heavy built bird it has a vivid blue face mask. The upper parts of the male's body are rich green. The under parts extending from the throat downward is a much lighter green. The rump and upper tail coverts are red"}, {"url": "http://www.surfbirds.com/namericanbirds/sparrows-finches.html", "passage_text": "The male Painted Bunting is often described as the most beautiful bird in North America. Its beautiful colors, dark blue head, green back, red rump and underparts, make it easy to identify. Their striking colors and warbled song have made them a popular cage bird in Mexico, Central America and the Caribbean. House Finch-Adults have a long brown tail and are a brown or dull-brown color across the back with some shading into deep grey on the wing feathers. Breast and belly feathers may be streaked. In most cases, adult males have a reddish color to their heads, necks and shoulders."}, {"url": "http://www.parrot-finches.com/", "passage_text": "Four species are now covered, with help from well-known UK Parrotfinch (and Waxbill) breeder Graham Lee. Breeding Blue-faced Parrot Finches, Red-headed Parrot Finches and Tricolor or Forbes Parrot Finches is relatively straightforward. Pin-tailed Parrot Finches may be less easy but they are not difficult. A robust, easy-to-care-for bird (with a nice little song), which is freely available in the UK. Not suited to colony breeding, unlike the Pin-tailed Parrot Finch. However, unlike several other parrotfinches, it is a good parent-rearing bird."}]