[{"url": "http://www.calce.umd.edu/TSFA/Hardness_ad_.htm", "passage_text": "The Rockwell Hardness test is a hardness measurement based on the net increase in depth of impression as a load is applied. Hardness numbers have no units and are commonly given in the R, L, M, E and K scales. The higher the number in each of the scales means the harder the material. For instance, the progression from calcite to fluorite (from 3 to 4 on the Mohs scale) reflects an increase in hardness of approximately 25 percent; the progression from corundum to diamond, on the other hand (9 to 10 on the Mohs scale), reflects a hardness increase of more than 300 percent."}, {"url": "http://www.answers.com/Q/What_is_the_unit_of_hardness", "passage_text": "The scale of mineral hardness is referred to as the Mohs scale.  They run from 1 which is Talc to 10, which is diamond. The other  units are 2: Gypsum, 3: Calcite, 4: Fluori … te, 5: Apatite, 6:  Feldspar, 7: Quartz, 8: Topaz, and 9: Corundum. The smallest unit of space on a hard drive is a bit. Eight bits make a byte, which is the basic unit. Half a byte is (appropriately) called a nibble. One thousand and twen … ty-four bytes make up a kilobyte, 1024 kilobytes make up a megabyte, 1024MB equals a gigabyte, and 1024GB equals one terabyte."}, {"url": "http://www.answers.com/Q/What_is_the_unit_of_hardness", "passage_text": "The most familiar to most pe … ople would be the Mohs' scale. It is used to measure the hardness of stone on a non-linear scale from 1 to ten. Talc, the softest, is 1 and the hardest, diamond, is 10. It isn't linear because diamond is actually 42 times harder than talc, not 10 times. The smallest unit of space on a hard drive is a bit. Eight bits make a byte, which is the basic unit. Half a byte is (appropriately) called a nibble. One thousand and twen … ty-four bytes make up a kilobyte, 1024 kilobytes make up a megabyte, 1024MB equals a gigabyte, and 1024GB equals one terabyte."}, {"url": "https://en.wikipedia.org/wiki/Vickers_hardness_test", "passage_text": "The unit of hardness given by the test is known as the Vickers Pyramid Number (HV) or Diamond Pyramid Hardness (DPH). The hardness number can be converted into units of pascals, but should not be confused with pressure, which also has units of pascals. The hardness number is determined by the load over the surface area of the indentation and not the area normal to the force, and is therefore not pressure. Vickers hardness numbers are reported as xxxHVyy, e.g. 440HV30, or xxxHVyy/zz if duration of force differs from 10 s to 15 s, e.g. 440Hv30/20, where: 1  440 is the hardness number, 2  HV gives the hardness scale (Vickers), 3  30 indicates the load used in kgf."}, {"url": "http://www.calce.umd.edu/TSFA/Hardness_ad_.htm", "passage_text": "ASTM E-10 is a standard test for determining the Brinell hardness of metallic materials. The load applied in this test is usually 3,000, 1,500, or 500 kgf, so that the diameter of the indentation is in the range 2.5 to 6.0 mm. The load is applied steadily without a jerk. For instance, the progression from calcite to fluorite (from 3 to 4 on the Mohs scale) reflects an increase in hardness of approximately 25 percent; the progression from corundum to diamond, on the other hand (9 to 10 on the Mohs scale), reflects a hardness increase of more than 300 percent."}, {"url": "http://www.mrwa.com/WaterWorksMnl/Chapter%2015%20Hardness.pdf", "passage_text": "HARDNESS MEASUREMENTS. Water hardness is unfortunately, expressed in several different units and it is often necessary to convert from one unit to another when making calculations. Most commonly used units include grains per gallon (gpg), parts per million (ppm), and milligrams per liter (mg/L). "}, {"url": "http://sizes.com/units/hardness_rockwell.htm", "passage_text": "Rockwell hardness scales. A scale indicating the hardness of materials, first used in 1919, when it was invented by Stanley P. Rockwell. The measurement has no units. The symbol is HR followed by a letter indicating one of a number of possible scales, described in the table below. For example, “HRC 96” means 96 on the Rockwell C scale."}, {"url": "https://en.wikipedia.org/wiki/Hardness", "passage_text": "Scratch hardness is the measure of how resistant a sample is to fracture or permanent plastic deformation due to friction from a sharp object. The principle is that an object made of a harder material will scratch an object made of a softer material. "}, {"url": "http://www.answers.com/Q/What_are_the_units_of_hardness", "passage_text": "There is no simple answer or single unit of hardness, but there are many different scales and systems used to measure different kinds of hardness. The most familiar to most pe … ople would be the Mohs' scale. It is used to measure the hardness of stone on a non-linear scale from 1 to ten. Talc, the softest, is 1 and the hardest, diamond, is 10. It isn't linear because diamond is actually 42 times harder than talc, not 10 times."}, {"url": "http://www.answers.com/Q/What_are_the_units_of_hardness", "passage_text": "The scale of mineral hardness is referred to as the Mohs scale. They run from 1 which is Talc to 10, which is diamond. The other units are 2: Gypsum, 3: Calcite, 4: Fluorite, 5: Apatite, 6: Feldspar, 7: Quartz, 8: Topaz, and 9: Corundum. The most familiar to most pe … ople would be the Mohs' scale. It is used to measure the hardness of stone on a non-linear scale from 1 to ten. Talc, the softest, is 1 and the hardest, diamond, is 10. It isn't linear because diamond is actually 42 times harder than talc, not 10 times."}]