[{"url": "http://www.oxforddictionaries.com/definition/english/plot-ratio", "passage_text": "1 In a bid to fully utilise the maximum plot ratio of 0.5 times, alterations costing more than HK $100 million have been made to the project. 2  The 191,256 square feet site has a plot ratio of nine times and will have a gross floor area of 1.72 million sq ft."}, {"url": "http://encyclopedia2.thefreedictionary.com/Plot+ratio", "passage_text": "Plot ratio. The gross floor area of a building divided by the area of its site. The basic ratio permitted is frequently modified by providing a bonus for arcades, setbacks, plazas, and the incorporation of existing buildings of architectural significance."}, {"url": "https://hklandsurveyor.wordpress.com/2012/08/31/plot-ratio/", "passage_text": "For example, if a building has 12 storeys and the area of each floor being 1,500 square metres, the GFA of the building is 18,000 square metres. If the site area is 2,000 square metres, the plot ratio is 9."}, {"url": "https://hklandsurveyor.wordpress.com/2012/08/31/plot-ratio/", "passage_text": "Definition. According to Reg 21(3) of the Building (Planning) Regulations (Cap 123F), the plot ratio (地積比率) of a building is obtained by dividing the gross floor area (GFA) (總樓面面積) of the building by the area of the site on which the building is erected."}, {"url": "http://www.oxforddictionaries.com/definition/english/plot-ratio", "passage_text": "1 A lower plot ratio means the floor area the developer can build at the site will be reduced. 2  In a bid to fully utilise the maximum plot ratio of 0.5 times, alterations costing more than HK $100 million have been made to the project."}, {"url": "http://www.larapedia.com/glossary_of_building_and_construction_terms/plot_ratio_meaning_and_definition.html", "passage_text": "Meaning and definition of plot ratio : Plot ratio: The total floor area of all buildings on a site divided by the area of the site. [NDADP]. The meaning and definition indicated above are indicative not be used for medical and legal purposes."}, {"url": "http://www.oxforddictionaries.com/definition/english/plot-ratio", "passage_text": "More example sentences. 1  A lower plot ratio means the floor area the developer can build at the site will be reduced. 2  In a bid to fully utilise the maximum plot ratio of 0.5 times, alterations costing more than HK $100 million have been made to the project."}, {"url": "https://en.wikipedia.org/wiki/Floor_area_ratio", "passage_text": "Floor area ratio (FAR) (also floor space ratio (FSR), floor space index (FSI), site ratio and plot ratio) is the ratio of a building's total floor area (gross floor area) to the size of the piece of land upon which it is built. The terms can also refer to limits imposed on such a ratio. As a formula:"}]