[{"url": "http://www.ign.com/wikis/the-witcher-3-wild-hunt/Kaer_Morhen", "passage_text": "After the opening cutscene, Geralt finds himself in Kaer Morhen, the last remaining stronghold of the Witchers. Using Geralt’s Witcher Senses, look around the room until you locate the key (outlined in red) on the book sitting atop the desk near the door. "}, {"url": "http://witcher.wikia.com/wiki/Kaer_Morhen", "passage_text": "Kaer Morhen exterior concept painting. Kaer Morhen, the School of the Wolf is an old keep where witchers used to be trained. The name is a corruption of the Elder Speech term Caer a'Muirehen, which means Old Sea Keep. It was named as such due to the presence of fossilized sea creatures embedded in the stones of which it was built. The Price of Neutrality  is set in and around Kaer Morhen. The outer courtyards of the keep are where Deidre Ademeyn, a princess allegedly affected by the Curse of the Black Sun has taken refuge, who is aided somewhat by the witchers wintering there: Vesemir, Lambert and in particular, Eskel."}, {"url": "http://thewitcher3.wiki.fextralife.com/Kaer+Morhen", "passage_text": "Kaer Morhen is a location in Witcher 3: Wild Hunt. Kaer Morhen is the home of the Witchers. The monster-slayers spread around the world whilst on The Path would gather here during the roughest parts of the year to regroup, share stories and have a brief rest before their work beckoned them into the wild again."}, {"url": "http://www.ign.com/wikis/witcher-2/Sword_of_Kaer_Morhen", "passage_text": "The Sword of Kaer Morhen is a silver sword found in the Arachnas glade in Chapter 1. The best time to get it is after killing the monster, and not agreeing to meet Iorveth immediately (meet him later at the Elven Ruins). Next Sword of the Dun Banner Previous Sword of Creyden. See All Top Contributors ». "}, {"url": "http://www.vg247.com/2015/05/01/the-witcher-3-kaer-morhen-walkthrough/", "passage_text": "The Witcher 3 beings with Kaer Morhen, which is both a place and the opening quest. The story opens in a bedroom at Kaer Morhen, the witcher stronghold, shared by Geralt and Yennefer. Once you gain control, familiarise yourself with the controls for using your Witcher Senses – hold L2/LT to spot interactive objects, highlighted with a red glow. You can interact with them with X/A."}, {"url": "http://witcher.gamepedia.com/Kaer_Morhen", "passage_text": "For the opening quest in The Witcher 3, see Kaer Morhen (quest). Kaer Morhen is an old keep where the witchers used to be trained. The name is a corruption of the Elder Speech Caer a'Muirehen, which means Old Sea Keep due to the presence of fossilized of sea creatures embedded in stones of which it was built. It is located in the mountains of the kingdom of Kaedwen, on the Gwenllech. From there they could see the ruins of Kaer Morhen huddled against the stone precipices-the partially demolished trapezium of the defensive wall, the remains of the barbican and gate, the thick, blunt column of the donjon. ”. — pg(s)."}, {"url": "http://witcher.wikia.com/wiki/Kaer_Morhen_(quest)", "passage_text": "Kaer Morhen is the first main quest in The Witcher 3: Wild Hunt. It serves as the tutorial level for movement and combat as well as introducing to some of the important characters. Every story has to start somewhere. This one starts in the guest room at Kaer Morhen, the stronghold of the witchers in the Blue Mountains. It starts with Geralt taking a bath, disproving the theory that witchers neglect personal hygiene."}]