[{"url": "http://www.answers.com/Q/How_many_ounces_are_in_1_cup", "passage_text": "Confidence votes 8.8K. In the US, 1 cup = 8 fluid ounces (*not identical to the avoirdupois ounce which is weight). In the US, one standard measuring cup contains 8 fluid ounces, but there is also a dry measure using the term cup, equal to 8 ounces."}, {"url": "http://www.asknumbers.com/OuncesToCupsConversion.aspx", "passage_text": "The conversion factors from fluid ounces (fl oz) to cups for imperial and US customary volume measurement systems are listed below. To find out how many cups in ounces, multiply by the right conversion factor or use the converter below. 1 Ounce [Fluid, US] = 0.125 (1/8) Cup [US]. Fluid ounce is an imperial and U.S. customary volume unit. Since often causes confusion, please note that it is different than the ounces which is a mass (weight) unit."}, {"url": "http://www.ask.com/food/many-ounces-cup-44b1fb6dade20d94", "passage_text": "There are approximately 2.6 ounces in one-third cup. Convert cup measurements to ounces by multiplying the cup measurement by 8, which is the number of fluid ounces in 1 cup. Other common conversions to ounces are one-third to 0.33, one-half to 0.5, one-fourth to 0.25 and one-eighth to 0.125."}, {"url": "http://www.ask.com/food/many-ounces-cup-44b1fb6dade20d94", "passage_text": "There are 5 1/3 ounces in 2/3 of a cup. One cup is the equivalent of 8 ounces, and 2/3 of 8 is 5 1/3."}, {"url": "http://1howmany.com/how-many-ounces-in-a-cup", "passage_text": "Example How Many Ounces in a Cup. Units of Measure / How Many Ounces in a Cup. Experienced cooks can measure the amount of food or liquid simply by eyeballing and they can do in milliliters, grams, ounces or cups. But for an ordinary housewife it is not a simple task, and converting units is even more difficult."}, {"url": "http://www.answers.com/Q/How_many_dry_ounces_are_in_a_cup", "passage_text": "One cup wet or dry is equal to 8 ounces. So basically the answer is 4 oz = 1/2 cup.   But of course there is a difference between dry weight which generally is measur … ed in US pound (lb) while the rest of the world uses grains(gr) , and grams (gm, mg[0.065gm =60mg=1gr}, kg {1000g = 1 kg}."}]