[{"url": "https://en.wikipedia.org/wiki/SRAM_Corporation", "passage_text": "SRAM now incorporates the former bicycle division of Fichtel and Sachs, Sachs-Huret, and recently acquired component makers RockShox, Avid, Truvativ, Zipp, and QUARQ (see below). SRAM has purchased a number of companies to allow it to offer a full set of components rather than develop them from scratch. At the forefront of the company is the SRAM marque which is used for most of its groupsets. Companies SRAM has purchased and converted into marque brands include Rockshox, Truvativ, Sachs, Avid and Zipp"}, {"url": "http://wheelworld.com/articles/sram-bicycle-components-pg187.htm", "passage_text": "SRAM Bicycle Components! SRAM began with the goal of creating the absolute best shifting system for bicycles. In 1988, SRAM released the original Grip Shift system which took a fresh look at drivetrain components with modern twist shifters. SRAM continues to refine and redefine the ultimate ride. This is most evident in the harsh testing arena of the professional cyclist. They stress their drivetrains with powerful force and demand clean crisp shifting and powerful braking all in a stunningly lightweight and durable package."}, {"url": "https://en.wikipedia.org/wiki/Velocio-SRAM_Pro_Cycling", "passage_text": "Velocio-SRAM Pro Cycling, formerly known as Specialized–lululemon, is a professional cycling team based in the United States that competes in elite road bicycle racing and track cycling events. The title sponsors are SRAM Corporation and Cervelo bicycles. "}, {"url": "http://www.diffen.com/difference/SRAM_vs_Shimano", "passage_text": "Diffen › Recreation › Biking. Bicycle component manufacturers Shimano and SRAM both offer a range of products from entry-level to high-end competition components. SRAM is based in Chicago and is focused on making only high-end bicycles and bicycle parts. Shimano, a Japanese company, extends their product range to sport fishing and rowing equipment, although the biggest portion of their revenue comes from bicycle components. 1 The shifting actuation ratio (between the shifter and the indexer) is different: Shimano shifts at 2:1, while SRAM shifts at a 1:1 ratio. 2  The 1:1 ratio means the cable moves further for each shift, possibly making the setup less sensitive to mud or other influences."}, {"url": "http://www.diffen.com/difference/SRAM_vs_Shimano", "passage_text": "SRAM Corporation is a privately held bicycle component manufacturer based in Chicago, USA. SRAM is an acronym comprising the names of its founders, Scott, Ray, and Sam. 1 The shifting actuation ratio (between the shifter and the indexer) is different: Shimano shifts at 2:1, while SRAM shifts at a 1:1 ratio. 2  The 1:1 ratio means the cable moves further for each shift, possibly making the setup less sensitive to mud or other influences."}, {"url": "http://www.bikeradar.com/tags/sram/", "passage_text": "All you need to know about SRAM. SRAM Corporation are a bicycle components manufacturer founded in 1987. SRAM is an acronym containing the names of its founders, Scott, Ray, and Sam (where Ray is the middle name of company CEO Stan Day). As a result SRAM acts as the parent company to the following brands within their line-up: Rockshox, Truvativ, Sachs, Avid, Quarq and Zipp. BikeRadar's SRAM hub brings you all the latest news and reviews of SRAM products, including the popular SRAM XX1 and the SRAM Red groupsets."}, {"url": "http://www.bicycling.com/bikes-gear/components/first-look-sram-force1-and-rival1-drivetrains", "passage_text": "Riffing off its popular one-by (1x) mountain bike and Force CX1 ’cross drivetrains, SRAM is introducing an expanded range of 1x products pitched to gravel, adventure, triathlon/time trial, fitness, commuter, and road riders. The groups are called Force1 and Rival1. "}, {"url": "https://en.wikipedia.org/wiki/SRAM_Corporation", "passage_text": "(December 2007). SRAM Corporation is a privately held bicycle component manufacturer based in Chicago, Illinois, USA, founded in 1987. SRAM is an acronym comprising the names of its founders, S cott, R ay, and S am, (where Ray is the middle name of company head Stan Day). SRAM has purchased a number of companies to allow it to offer a full set of components rather than develop them from scratch. At the forefront of the company is the SRAM marque which is used for most of its groupsets. Companies SRAM has purchased and converted into marque brands include Rockshox, Truvativ, Sachs, Avid and Zipp"}, {"url": "http://wheelworld.com/articles/sram-bicycle-components-pg187.htm", "passage_text": "Then, to support their innovative outlook, SRAM invested in Sachs Bicycle Company and built a state-of-the-art manufacturing facility in Schweinfurt Germany.Today, all SRAM fabricates is bicycle components, which is why they do them so well. SRAM continues to refine and redefine the ultimate ride. This is most evident in the harsh testing arena of the professional cyclist. They stress their drivetrains with powerful force and demand clean crisp shifting and powerful braking all in a stunningly lightweight and durable package."}]