[{"url": "http://dhs.georgia.gov/take-precautions-when-leaving-children-home-alone", "passage_text": "Georgia’s Guidelines for leaving a child without adult supervision: 1  Children under 8 years old should never be left alone, even for short periods of time. 2  Children between the ages of 9 and 12, based on level of maturity, can be left home alone for brief periods of time. 1 Children between the ages of 9 and 12, based on level of maturity, can be left home alone for brief periods of time. 2  Children 13 and older can generally be left as babysitters, with the exception of children in foster care."}, {"url": "http://family.findlaw.com/parental-rights-and-liability/when-can-you-leave-a-child-home-alone-.html", "passage_text": "8 to 10 years-Should not be left alone for more than 1½ hours and only during daylight and early evening hours. 11 to 12 years-May be left alone for up to 3 hours but not late at night or in circumstances requiring inappropriate responsibility. 13 to 15 years-May be left unsupervised, but not overnight. 16 to 17 years-May be left unsupervised (in some cases, for up to two consecutive overnight periods). Laws for Leaving a Child Home Alone. Only a couple of states have laws that specify the age when a child can be left home alone, including Maryland (age 8) and Illinois (age 14). However, most states have guidelines with the Department of Health and Human Services or other child protective agencies that test a child's ability to be left home alone"}, {"url": "http://www.latchkey-kids.com/latchkey-kids-age-limits.htm", "passage_text": "The National SAFEKIDS Campaign recommends that no child under the age of 12 be left at home alone. However, consider a child's age and maturity level. For example, if a child is extremely impulsive, it might be best to wait until he or she is older than 12. These states do not set a specific age after which a child legally can stay home alone but do provide recommendations. CARE Latchkey Kids Calling Solutions. DSC provides an easy and secure sign-up procedure (For a quick overview, please visit the registration information web page)."}, {"url": "http://dhs.georgia.gov/take-precautions-when-leaving-children-home-alone", "passage_text": "1 Children under 8 years old should never be left alone, even for short periods of time. 2  Children between the ages of 9 and 12, based on level of maturity, can be left home alone for brief periods of time. 3  Children 13 and older can generally be left as babysitters, with the exception of children in foster care. 1 Children between the ages of 9 and 12, based on level of maturity, can be left home alone for brief periods of time. 2"}, {"url": "http://www.211.idaho.gov/elibrary/HomeAlone.html", "passage_text": "Deciding when your child is ready to stay home alone is a difficult decision for parents. There is no set age, either prescribed by Idaho law or by child development experts. It comes down to a judgment call on the part of parents. 1 Age. 2  Many experts believe a child should be at least 12 before being left home alone, and at least 15 before your child can care for a younger sibling."}, {"url": "http://info.legalzoom.com/legal-age-children-left-alone-pennsylvania-20767.html", "passage_text": "A parent who leaves a child home alone before he is ready may face charges of neglect in Pennsylvania. Although Pennsylvania doesn't have a set minimum age at which it's legal for children to be left home alone, a parent is still responsible for knowing when her child may be safely left home without supervision. A young babysitter must be able to handle the responsibility of the child as well. A child of 13 who doesn't have the same maturity level and often breaks rules may be not able to stay home alone without endangering himself. Regardless of maturity level, a child home alone should have easy access to an adult nearby for help at all times."}, {"url": "http://family.findlaw.com/parental-rights-and-liability/when-can-you-leave-a-child-home-alone-.html", "passage_text": "Below are general guidelines to follow when considering the age range for leaving a child home alone. 7 & under-Should not be left alone for any period of time. This may include leaving children unattended in cars, playgrounds, and backyards. Laws for Leaving a Child Home Alone. Only a couple of states have laws that specify the age when a child can be left home alone, including Maryland (age 8) and Illinois (age 14). However, most states have guidelines with the Department of Health and Human Services or other child protective agencies that test a child's ability to be left home alone"}, {"url": "http://www.todaysparent.com/kids/home-alone/", "passage_text": "No one law across Canada stipulates how old a child must be to stay home alone, but the Canada Safety Council (CSC) recommends age 10 as a minimum, and that children younger than 12 shouldn’t be left in charge of their younger siblings. "}, {"url": "http://info.legalzoom.com/legal-age-children-left-alone-pennsylvania-20767.html", "passage_text": "The official website of Erie County, Pennsylvania, recommends never leaving a child under 10 home alone. Parents must decide for themselves whether a child can be left home alone, rather than decide strictly by age, according to the U.S. Administration for Children & Families. Parents should consider how safe their neighborhood is when making the decision. A child of 13 who doesn't have the same maturity level and often breaks rules may be not able to stay home alone without endangering himself. Regardless of maturity level, a child home alone should have easy access to an adult nearby for help at all times."}]