[{"url": "http://www.bbc.co.uk/science/humanbody/body/factfiles/liver/liver.shtml", "passage_text": "Function: To get rid of toxins, to regulate your blood sugar levels and to produce bile. Largest internal organ. Your liver is your largest internal organ. A big blood vessel, called the portal vein, carries nutrient-rich blood from your small intestine directly to your liver. Chemical processing factory. Hepatic cells make up about 60 percent of your liver tissue. These specialised liver cells carry out more chemical processes than any other group of cells in your body. "}, {"url": "http://sciencenetlinks.com/student-teacher-sheets/cells-your-body/", "passage_text": "Different cells have different jobs to do. Each cell has a size and shape that is suited to its job. Cells that do the same job combine together to form body tissue, such as muscle, skin, or bone tissue. Groups of different types of cells make up the organs in your body, such as your heart, liver, or lungs. Cells continually divide to make more cells for growth and repair in your body. The nucleus contains the information that allows cells to reproduce, or make more cells. Another important part of a cell is the mitochondrion. This is the part of the cell where food and oxygen combine to make energy."}, {"url": "http://www.cancer.org/cancer/livercancer/detailedguide/liver-cancer-what-is-liver-cancer", "passage_text": "The liver is made up mainly of cells called hepatocytes. It also is made up of other types of cells, including cells that line its blood vessels and cells that line small tubes in the liver called bile ducts. The bile ducts extend out of the liver and carry bile from the liver to the gallbladder or directly to the intestines."}, {"url": "http://www.innerbody.com/image_digeov/card10-new2.html", "passage_text": "The liver functions as an organ of the immune system through the function of the Kupffer cells that line the sinusoids. Kupffer cells are a type of fixed macrophage that form part of the mononuclear phagocyte system along with macrophages in the spleen and lymph nodes. Blood Vessels. The blood supply of the liver is unique among all organs of the body due to the hepatic portal vein system. Blood traveling to the spleen, stomach, pancreas, gallbladder, and intestines passes through capillaries in these organs and is collected into the hepatic portal vein."}, {"url": "https://en.wikipedia.org/wiki/Liver", "passage_text": "The liver is a reddish brown wedge-shaped organ with four lobes of unequal size and shape. A human liver normally weighs 1.44–1.66 kg (3.2–3.7 lb). It is both the largest internal organ and the largest gland in the human body. Located in the right upper quadrant of the abdominal cavity, it rests just below the diaphragm, to the right of the stomach and overlying the gallbladder. Terminology related to the liver often starts in hepar-or hepat-from the Greek word for liver, hēpar (ἧπαρ, root hepat-, ἡπατ-). There is currently no way to compensate for the absence of liver function in the long term, although liver dialysis techniques can be used in the short term."}, {"url": "http://www.innerbody.com/image_digeov/card10-new2.html", "passage_text": "Weighing in at around 3 pounds, the liver is the body’s second largest organ; only the skin is larger and heavier. The liver performs many essential functions related to digestion, metabolism, immunity, and the storage of nutrients within the body. Blood Vessels. The blood supply of the liver is unique among all organs of the body due to the hepatic portal vein system. Blood traveling to the spleen, stomach, pancreas, gallbladder, and intestines passes through capillaries in these organs and is collected into the hepatic portal vein."}, {"url": "http://www.siumed.edu/~dking2/erg/liver.htm", "passage_text": "INTRODUCTION TO LIVER. The liver is one of the largest, most important, and least appreciated organs in the body. The bulk of the liver consists of hepatocytes, which are epithelial cells with a unique configuration. The liver is essentially an exocrine gland, secreting bile into the intestine. But, the liver is also -- and significantly so -- an endocrine gland and a blood filter."}, {"url": "https://en.wikipedia.org/wiki/Liver", "passage_text": "The liver is a gland and plays a major role in metabolism with numerous functions in the human body, including regulation of glycogen storage, decomposition of red blood cells, plasma protein synthesis, hormone production, and detoxification. Terminology related to the liver often starts in hepar-or hepat-from the Greek word for liver, hēpar (ἧπαρ, root hepat-, ἡπατ-). There is currently no way to compensate for the absence of liver function in the long term, although liver dialysis techniques can be used in the short term."}]