[{"url": "http://kiseijuu.wikia.com/wiki/Satomi_Murano", "passage_text": "In the anime, Satomi has short, maroon hair with her hair tied up in the front. She has brown eyes. In the manga, she has short, dark hair with a fringe in the front. She is considerably attractive (this is known because other people have feelings for her which causes Shinichi to get into fights). Background Edit. A young Satomi is shown to approach Shinichi during the results of their high school entrance exams, after he found out that he was accepted. A brief misunderstanding happened between the two of them when she thought that Shinichi wasn't the person she thought him to be."}, {"url": "http://www.japanese-names.org/?meaning-of=satomi", "passage_text": "Satomi-Meaning of Satomi. 1  The meaning of Satomi is beautiful and wise . 2  The most common Kanji used in the name Satomi is 聡美. 3  The name meaning can vary if alternative Kanji (Japanese characters) is chosen by the parents. 1 The meaning of Satomi is beautiful and wise . 2  The most common Kanji used in the name Satomi is 聡美."}, {"url": "http://www.babynamespedia.com/meaning/Satomi", "passage_text": "[ 3 syll. sa-to-mi, sat-omi ] The baby girl name Satomi is pronounced S AA-Tow-Miy- †. Satomi's language of origin is Japanese and it is also predominantly used in Japanese. Satomi's meaning is 'wise beauty'. Satomi is an uncommon baby name for girls. "}, {"url": "https://en.wikipedia.org/wiki/Y%C5%8Dko_Satomi", "passage_text": "Yōko Satomi (里見瑤子, Satomi Yōko) is a Japanese pink film actress who has also used the name Saki Shiratori (白鳥 さき, Shiratori Saki) . Variations on the spelling of her name include 里見瑶子, 里見瑤子, and 里美瑤子. She has appeared in award-winning pink films, and was herself given a Best Actress award for her work in this genre in 1999 and 2001. AllRovi calls it a funny and oddly poignant film. Satomi won her second Best Actress award for her performance in Mamoru Watanabe 's Young Wive's Pleasure Lessons: Enslaved (若妻快楽レッスン　虜, Wakazuma kairaku ressun: toriko) (2001). Satomi was again the lead feature of P*G magazine in October 2002."}, {"url": "http://kiseijuu.wikia.com/wiki/Satomi_Murano", "passage_text": "Satomi Murano (村野 里美 lit. Murano Satomi) is a deuteragonist in the series. Shinichi's best friend and sometime companion. Background Edit. A young Satomi is shown to approach Shinichi during the results of their high school entrance exams, after he found out that he was accepted. A brief misunderstanding happened between the two of them when she thought that Shinichi wasn't the person she thought him to be."}, {"url": "http://www.thenamemeaning.com/satomi/", "passage_text": "Search comprehensively and find the name meaning of Satomi and its name origin or of any other name in our database. Also note the spelling and the pronunciation of the name Satomi and check the initials of the name with your last name to discover how it looks and sounds. The history and meaning of the name Satomi is fascinating, learn more about it. The meaning of Satomi is “Wise beauty”. Keep in mind that many names may have different meanings in other countries and languages, so be careful that the name that you choose doesn’t mean something bad or unpleasant."}, {"url": "http://www.answers.com/Q/What_is_the_meaning_of_the_name_Satomi", "passage_text": "God is talking to Moses and Moses is basically asking God what name he is to say to the people when they ask. … Now here is the kicker. I... do not believe that God is responding with his name or WHO he is per se. God is telling Moses WHAT he is, not his name. Names are labels that have a huge affect on people. The meaning of a person's name can make them feel more noble or comfortable with who they are... being named after someone can cause a lot of introspection and either rebellion against that example, or close following of the same. + 3 others found this useful."}, {"url": "http://www.thenamemeaning.com/satomi/", "passage_text": "Popularity of the Name Satomi. This name is not popular in the US, according to Social Security Administration, as there are no popularity data for the name. This doesn't mean that the name Satomi is not popular in other countries all over the world. The name might be popular in other countries, in different languages, or even in a different alphabet, as we use the characters from the Latin alphabet to display the data. The meaning of Satomi is “Wise beauty”. Keep in mind that many names may have different meanings in other countries and languages, so be careful that the name that you choose doesn’t mean something bad or unpleasant."}]