[{"url": "http://www.floridatechonline.com/resources/information-technology/information-systems-vs-information-technology/", "passage_text": "Information Systems. Information systems is an umbrella term for the systems, people and processes designed to create, store, manipulate, distribute and disseminate information. The field of information systems bridges business and computer science."}, {"url": "http://www.differencebetween.com/difference-between-information-systems-and-vs-information-technology/", "passage_text": "Information technology and information systems are two closely related fields of study that people find very confusing to differentiate between. This is because of overlapping of topics in courses that are designed to teach these subjects."}, {"url": "http://whatis.techtarget.com/definition/IS-information-system-or-information-services", "passage_text": "A special form of IS is a management information system (MIS), which provides information for managing an enterprise. 2) IS (information services) is a common name for an organization within an enterprise that is responsible for its data processing and information system or systems."}, {"url": "http://www.differencebetween.com/difference-between-information-systems-and-vs-information-technology/", "passage_text": "Information technology can be considered as a subset of information systems. It deals with the technology part of any information system, and as such deals with hardware, servers, operating systems and software etc. A system is always a combination of people, machines, processes and technology."}, {"url": "http://whatis.techtarget.com/definition/IS-information-system-or-information-services", "passage_text": "Part of the Computing fundamentals glossary: 1) IS (information system) is the collection of technical and human resources that provide the storage, computing, distribution, and communication for the information required by all or some part of an enterprise."}, {"url": "http://www.differencebetween.com/difference-between-information-systems-and-vs-information-technology/", "passage_text": "One reason why people confuse between information systems and information technology is that they presume systems to be computer systems. However, ‘information systems’ is rather large field of study that refers to systems that are designed to create, modify, store and distribute information."}, {"url": "http://www.webopedia.com/TERM/M/MIS.html", "passage_text": "MIS is short for management information system or management information services. Management information system, or MIS, broadly refers to a computer-based system that provides managers with the tools to organize, evaluate and efficiently manage departments within an organization."}]