[{"url": "http://medical-dictionary.thefreedictionary.com/conjunctivitis", "passage_text": "Conjunctivitis may be caused by a viral infection, such as a cold, acute respiratory infection, or disease such as measles, herpes simplex, or herpes zoster. Symptoms include mild to severe discomfort in one or both eyes, redness, swelling of the eyelids, and watery, yellow, or green discharge. pseudomembranous conjunctivitis A non-specific inflammatory reaction characterized by the formation on the conjunctiva of a coagulated fibrinous plaque consisting of inflammatory cells and an exudate containing mucus and proteins. This plaque forms either a membrane or a pseudomembrane."}, {"url": "http://medical-dictionary.thefreedictionary.com/conjunctivitis", "passage_text": "acute conjunctivitis Conjunctivitis characterized by an onset of hyperaemia (most intense near the fornices), purulent or mucopurulent discharge and symptoms of irritation, grittiness and sticking together of the eyelids on waking. pseudomembranous conjunctivitis A non-specific inflammatory reaction characterized by the formation on the conjunctiva of a coagulated fibrinous plaque consisting of inflammatory cells and an exudate containing mucus and proteins. This plaque forms either a membrane or a pseudomembrane."}, {"url": "http://encyclopedia2.thefreedictionary.com/chlamydial+conjunctivitis", "passage_text": "conjunctivitis. (kənjəngtəvī`təs) , inflammation or infection of the mucosal membrane that covers the eyeball and lines the eyelid, usually acute, caused by a virus or, less often, by a bacillus, an allergic reaction, or an irritating chemical. Commonly called pinkeye, mild conjunctivitis usually causes redness, discharge, and itching of the membrane. Conjunctivitis may also be associated with upper respiratory infection or with childhood diseases such as measles."}, {"url": "https://en.wikipedia.org/wiki/Conjunctivitis", "passage_text": "Inclusion conjunctivitis of the newborn (ICN) is a conjunctivitis that may be caused by the bacteria Chlamydia trachomatis, and may lead to acute, purulent conjunctivitis. However, it is usually self-healing. It is commonly due to an infection (usually viral, but sometimes bacterial or parasitic), or an allergic reaction. Conjunctivitis can affect one or both eyes and is the most likely diagnosis in someone with eye redness and discharge (fluid coming from the eye)."}, {"url": "https://en.wikipedia.org/wiki/Conjunctivitis", "passage_text": "(May 2012). Conjunctivitis, also known as pink eye is inflammation of the conjunctiva (the outermost layer of the eye and the inner surface of the eyelids). It is commonly due to an infection (usually viral, but sometimes bacterial or parasitic), or an allergic reaction. Conjunctivitis can affect one or both eyes and is the most likely diagnosis in someone with eye redness and discharge (fluid coming from the eye). The affected eye is often stuck shut in the morning. Bacterial and viral conjunctivitis are highly contagious, and are transmitted through contact with the discharge"}, {"url": "http://encyclopedia2.thefreedictionary.com/chlamydial+conjunctivitis", "passage_text": "Conjunctivitis is classified as either acute or chronic, according to its course. Acute conjunctivitis is manifested by a purulent discharge from the eye and redness (hyperemia) of the palpebral and ocular conjunctivae and sometimes by punctate hemorrhages under the conjunctiva and conjunctival edema. Commonly called pinkeye, mild conjunctivitis usually causes redness, discharge, and itching of the membrane. Conjunctivitis may also be associated with upper respiratory infection or with childhood diseases such as measles."}, {"url": "http://medical-dictionary.thefreedictionary.com/conjunctivitis", "passage_text": "Conjunctivitis is the inflammation of the conjunctiva, a thin, delicate membrane that covers the eyeball and lines the eyelid. Conjunctivitis is an extremely common eye problem because the conjunctiva is continually exposed to microorganisms and environmental agents that can cause infections or allergic reactions. pseudomembranous conjunctivitis A non-specific inflammatory reaction characterized by the formation on the conjunctiva of a coagulated fibrinous plaque consisting of inflammatory cells and an exudate containing mucus and proteins. This plaque forms either a membrane or a pseudomembrane."}, {"url": "http://medical-dictionary.thefreedictionary.com/conjunctivitis", "passage_text": "Conjuctivitis is an inflammation or redness of the lining of the white part of the eye and the underside of the eyelid (conjunctiva) that can be caused by infection, allergic reaction, or physical agents like infrared or ultraviolet light. pseudomembranous conjunctivitis A non-specific inflammatory reaction characterized by the formation on the conjunctiva of a coagulated fibrinous plaque consisting of inflammatory cells and an exudate containing mucus and proteins. This plaque forms either a membrane or a pseudomembrane."}, {"url": "http://www.medilexicon.com/medicaldictionary.php?t=19905", "passage_text": "purulent conjunctivitis. Definitions: 1. a violently acute inflammation of the conjunctiva, with copious pus and a marked tendency for corneal involvement. The definition information for purulent conjunctivitis is provided by Stedman's. You can search our medical dictionary here."}, {"url": "http://medical-dictionary.thefreedictionary.com/purulent+conjunctivitis", "passage_text": "purulent conjunctivitis. Etymology: L, purulentus, pus formation, conjunctivus, connecting; Gk, itis, inflammation. an inflammation of the conjunctiva caused by suppurative microorganisms, including species of streptococci, gonococci, and pneumococci. "}]