[{"url": "http://metals.about.com/od/properties/a/Metal-Profile-Tungsten.htm", "passage_text": "Tungsten Alloys: Tungsten metal can be combined with other metals to increase their strength and resistance to wear and corrosion. Steel alloys often contain tungsten for these beneficial properties. Many high speed steels-those used in cutting and machining tools like saw blades-contain around 18 percent tungsten. Production: Tungsten is primarily extracted from two types of minerals, wolframite and scheelite. However, tungsten recycling also accounts for about 30% of the global supply. China is the world's largest producer of the metal, providing over 80% of the world supply."}, {"url": "https://en.wikipedia.org/wiki/Tungsten", "passage_text": "Tungsten compounds are also often used as industrial catalysts. Tungsten is the only metal from the third transition series that is known to occur in biomolecules, where it is used in a few species of bacteria and archaea. It is the heaviest element known to be used by any living organism. A hard, rare metal under standard conditions when uncombined, tungsten is found naturally on Earth only in chemical compounds. It was identified as a new element in 1781, and first isolated as a metal in 1783. Its important ores include wolframite and scheelite"}, {"url": "http://education.jlab.org/itselemental/ele074.html", "passage_text": "Pure tungsten is a light gray or whitish metal that is soft enough to be cut with a hacksaw and ductile enough to be drawn into wire or extruded into various shapes. If contaminated with other materials, tungsten becomes brittle and difficult to work with. Tungsten has the highest melting point of all metallic elements and is used to make filaments for incandescent light bulbs, fluorescent light bulbs and television tubes. Tungsten expands at nearly the same rate as borosilicate glass and is used to make metal to glass seals. "}, {"url": "https://en.wikipedia.org/wiki/Tungsten", "passage_text": "The word tungsten comes from the Swedish language tung sten, which directly translates to heavy stone. Its name in Swedish is volfram, however, in order to distinguish it from scheelite, which in Swedish is alternatively named tungsten. A hard, rare metal under standard conditions when uncombined, tungsten is found naturally on Earth only in chemical compounds. It was identified as a new element in 1781, and first isolated as a metal in 1783. Its important ores include wolframite and scheelite"}, {"url": "https://en.wikipedia.org/wiki/Tungsten_carbide", "passage_text": "In its most basic form, tungsten carbide is a fine gray powder, but it can be pressed and formed into shapes for use in industrial machinery, cutting tools, abrasives, armor-piercing rounds, other tools and instruments, and jewelry. "}, {"url": "http://www.wisegeek.org/what-is-tungsten.htm", "passage_text": "Tungsten is a metallic chemical element classified among the transition metals of the periodic table of elements. It is well known for its strength and durability, which make it extremely useful in a wide range of industrial applications. One of the most famous uses of tungsten is as a filament in light bulbs. The metal is also used in an assortment of alloys to increase their hardness and tensile strength. Many structural metal alloys use it since the metal has an extremely high melting point, and the element is also used to make wear-resistant tools."}, {"url": "http://www.azom.com/article.aspx?ArticleID=4827", "passage_text": "Background. Tungsten Carbide is often referred to as a Hard Metal due to it’s very high hardness in relation to other metals. Typically a Tungsten Carbide Hard Metal can have a hardness value of 1600 HV, whereas mild steel would be in the region of 160 HV a factor of 10 lower."}, {"url": "http://minerals.usgs.gov/minerals/pubs/commodity/tungsten/", "passage_text": "Subscribe. Tungsten (W) is a metal with a wide range of uses, the largest of which is as tungsten carbide in cemented carbides. Cemented carbides (also called hardmetals) are wear-resistant materials used by the metalworking, mining, and construction industries. Tungsten is also used to make heavy metal alloys for armaments, heat sinks, and high-density applications, such as weights and counterweights; superalloys for turbine blades; tool steels; and wear-resistant alloy parts and coatings. Tungsten composites are used as a substitute for lead in bullets and shot."}]