[{"url": "http://www.succulent-plant.com/families/euphorbiaceae.html", "passage_text": "The 850 succulent species are mainly native to Africa and Madagascar with a few in India and other hot countries. The obsolete genera Endadenium, Monadenium, Pedilanthus from tropical America, Phyllanthus, and Synadenium have been merged into Euphorbia, but will be encountered often in old books and on plant labels."}, {"url": "https://bouldercolorado.gov/ipm/noxious-weeds-myrtle-spurge", "passage_text": "A drought-tolerant perennial native to Eurasia, Myrtle Spurge was first introduced to North America as an ornamental. It is considered a noxious weed because it is aggressive and proliferates easily, outcompetes native plants, and has toxic milky sap."}, {"url": "http://www.dnr.state.mn.us/invasives/terrestrialplants/herbaceous/leafyspurge.html", "passage_text": "Description: Appearance: Perennial herbaceous plant, 2- 3 1/2' tall, erect branching, smooth stems growing from a deep vertical root. Stems, flowers, and leaves emit a white milky sap when broken. Leaves: Alternate, small, oblong to lance-shaped, on the upper part of stem; scale-like on the lower part of the stem."}, {"url": "http://www.bellarmine.edu/faculty/drobinson/prostratespurge.asp", "passage_text": "Interesting Information About Plant: The Euphorbia maculata (spotted spurge) is a plant native to North America. The Prostrate Spurge, also commonly known as creeping spurge or spotted spurge, typically grows in the side walk cracks next to bushes, shrubs, and trees."}, {"url": "http://www.bellarmine.edu/faculty/drobinson/prostratespurge.asp", "passage_text": "(Euphorbia maculate). Interesting Information About Plant: The Euphorbia maculata (spotted spurge) is a plant native to North America. The Prostrate Spurge, also commonly known as creeping spurge or spotted spurge, typically grows in the side walk cracks next to bushes, shrubs, and trees."}, {"url": "https://bouldercolorado.gov/ipm/noxious-weeds-myrtle-spurge", "passage_text": "Myrtle Spurge (Euphorbia myrsinites), also called donkey tail or creeping spurge, is one of Colorado's List A noxious weeds, which requires it to be eradicated and prevented from propagating."}, {"url": "http://www.wildflower.org/plants/result.php?id_plant=PAPR7", "passage_text": "USDA Native Status: L48 (N). Mountain spurge or Allegheny spurge is a low perennial, spreading with long rhizomes. Toothed leaves crowd near the top of somewhat fleshy, 6 in., erect stems. Fragrant, white flowers cluster in a spike, the many staminate flowers above, the few pistillate flowers below."}]