[{"url": "https://blog.udemy.com/sushi-nutrition/", "passage_text": "Sushi nutrition varies a lot from roll to roll, and in traditional vs. contemporary dishes. Yes, sushi may be small, put each little piece has the potential to pack a ton of calories depending on what you order. The Rainbow Roll is an uramaki sushi roll made with crab substitute, avocado, and a variety of raw fish toppings. It may be high in calories, but it’s also really high in protein because of all the raw fish. Very high in carbs, so be warned."}, {"url": "http://www.shape.com/healthy-eating/meal-ideas/6-best-low-calorie-sushi-rolls", "passage_text": "6 of 6. Best Low-Calorie Sushi Rolls: Shrimp. 199 calories, 0g fat per roll. Skip the deep-fried tempura roll—which has more than 500 calories and 21 grams of fat—in favor of this healthier counterpart. 3 of 6. Best Low-Calorie Sushi Rolls: Rainbow. 330 calories, 8g fat per roll. Made with colorful fish wrapped around a vegetable roll, this favorite is worthy of the higher calorie count because of its nutritional heft. Pair one with a bowl of miso soup for a filling meal that’s still under 425 calories."}, {"url": "http://www.calories-in-foods.com/calories-in-sushi.php", "passage_text": "1 Sushi Philadelphia roll-A 3.5 oz serving has 204 sushi calories and 2 calories per gram of sushi. 2  Sushi vegetable roll, brown rice - 4 pieces weighing 4.9 oz have 140 sushi calories and 1 calorie per gram of sushi. 1 Small sushi roll, raw salmon - 2 pieces or 1/3 of a roll has 61 sushi calories. 2  Small sushi roll, cucumber - 2 pieces or 1/3 of a roll has 45 sushi calories. 3  Spicy roll, Baby Shrimp-A 10.1 oz serving has 419"}, {"url": "http://www.shape.com/healthy-eating/meal-ideas/6-best-low-calorie-sushi-rolls", "passage_text": "Best Low-Calorie Sushi Rolls: Salmon Cucumber. 231 calories, 4g fat per roll. This pick is high in heart-healthy omega-3 fats. Order it straight instead of spicy—just 1 tablespoon of chili-spiked mayonnaise tacks on an extra 99 calories and 11 grams of fat. 3 of 6. Best Low-Calorie Sushi Rolls: Rainbow. 330 calories, 8g fat per roll. Made with colorful fish wrapped around a vegetable roll, this favorite is worthy of the higher calorie count because of its nutritional heft. Pair one with a bowl of miso soup for a filling meal that’s still under 425 calories."}, {"url": "http://www.calories-in-foods.com/calories-in-sushi.php", "passage_text": "1 Small sushi roll, cucumber - 2 pieces or 1/3 of a roll has 45 sushi calories. 2  Spicy roll, Baby Shrimp-A 10.1 oz serving has 419 sushi calories and 1 calorie per gram of sushi. 3  Cream cheese roll-A 9.9 oz serving has 530 calories in sushi and 2 calories per gram of sushi. 1 Small sushi roll, raw salmon - 2 pieces or 1/3 of a roll has 61 sushi calories. 2  Small sushi roll, cucumber - 2 pieces or 1/3 of a roll has 45 sushi calories. 3"}, {"url": "http://thecaloriecounter.net/calories-in-sushi/", "passage_text": "Check the amount of calories and nutrients in basic sushi rolls, Nigiri sushi (sushi on rice bed), sashimi (sushi without rice), and sushi condiments such as soy sauce and Wasabi. Fortunately sushi is not a fattening food and contains not much calories. Rice contains some amount of carbohydrates. Sushi can be eaten even without rice as sashimi which will also reduce amount of eaten calories. Sushi is also rich in protein and this helps in building lean muscle."}, {"url": "http://www.calories-in-foods.com/calories-in-sushi.php", "passage_text": "1 Sushi California roll-A 9.5 oz serving has 365 sushi calories and there is 1 calorie per gram of sushi. 2  Spicy Tuna roll-A 10.1 oz serving has 461 sushi calories and there are 2 calories per gram of sushi. 1 Small sushi roll, raw salmon - 2 pieces or 1/3 of a roll has 61 sushi calories. 2  Small sushi roll, cucumber - 2 pieces or 1/3 of a roll has 45 sushi calories. 3  Spicy roll, Baby Shrimp-A 10.1 oz serving has 419 sushi calories and"}, {"url": "http://www.calories-in-foods.com/calories-in-sushi.php", "passage_text": "1 Tempura roll-A 11.1 oz serving has 542 calories in sushi and 2 calories per gram of sushi. 2  Dragon roll (eel) - A 10.2 oz serving has 520 calories in sushi and 2 calories per gram of sushi. 3  Sushi rice, cooked-An 8 fl oz cup has 298 calories in sushi and 37 calories per fl oz. 1 Small sushi roll, raw salmon - 2 pieces or 1/3 of a roll has 61 sushi calories. 2  Small sushi roll, cucumber - 2 pieces or 1/3 of a roll has 45 sushi calories. 3  Spicy roll, Baby Shrimp-A 10.1 oz serving has 419 sushi calories and 1 calorie"}, {"url": "http://www.livestrong.com/article/321261-calories-in-vegetable-sushi/", "passage_text": "Calorie Estimate. Vegetable sushi may contain a broad range of ingredients, and the varying sizes also make it difficult to give this food a specific calorie total. However, a typical roll may contain about 30 calories per piece, or about 350 calories per roll of 12 pieces. "}]