[{"url": "http://www.liverfoundation.org/abouttheliver/info/alcohol/", "passage_text": "There are three main types of alcohol-related liver disease: alcoholic fatty liver disease, alcoholic hepatitis, and alcoholic cirrhosis. Alcoholic fatty liver disease. Alcoholic fatty liver disease results from the deposition of fat in liver cells. It is the earliest stage of alcohol-related liver disease. There are usually no symptoms. If symptoms do occur, they may include fatigue, weakness, and discomfort localized to the right upper abdomen."}, {"url": "http://www.nhs.uk/Conditions/Liver_disease_(alcoholic)/Pages/Introduction.aspx", "passage_text": "Introduction. Alcohol-related liver disease (ARLD) refers to liver damage caused by excess alcohol intake. There are several stages of severity and a range of associated symptoms. ARLD doesn't usually cause any symptoms until the liver has been severely damaged. When this happens, symptoms can include: 1  feeling sick. 2  weight loss."}, {"url": "http://pubs.niaaa.nih.gov/publications/aa19.htm", "passage_text": "Alcoholic Liver Disease The three alcohol-induced liver conditions are fatty liver, alcoholic hepatitis, and cirrhosis. Some degree of fat deposition usually occurs in the liver after short-term excessive use of alcohol. However, fatty liver rarely causes illness (2)."}, {"url": "http://www.liverfoundation.org/abouttheliver/info/alcohol/", "passage_text": "Symptoms of cirrhosis may be similar to those of severe alcoholic hepatitis. Cirrhosis is the most advanced type of alcohol-related liver disease and is not reversed with abstinence. However, abstinence may improve the symptoms and signs of liver disease and prevent further damage."}, {"url": "http://www.nhs.uk/Conditions/Liver_disease_(alcoholic)/Pages/Introduction.aspx", "passage_text": "Liver disease. Alcohol-related liver disease is a range of conditions and associated symptoms that develop when the liver becomes damaged due to alcohol misuse. In this video, consultant hepatologist Mark Wright talks about how avoiding alcohol can help those with the condition."}, {"url": "http://pubs.niaaa.nih.gov/publications/aa19.htm", "passage_text": "Alcohol and the Liver. Alcoholic liver disease is one of the most serious medical consequences of chronic alcohol use. Moreover, chronic excessive alcohol use is the single most important cause of illness and death from liver disease (alcoholic hepatitis and cirrhosis) in the United States (1)."}]