[{"url": "http://www.cancer.org/cancer/bileductcancer/detailedguide/bile-duct-cancer-signs-symptoms", "passage_text": "Bile duct cancer is not common, and these symptoms and signs are more likely to be caused by something other than bile duct cancer. For example, people with gallstones may have many of these same symptoms. There are many far more common causes of abdominal pain"}, {"url": "http://www.healthline.com/health/choledocholithiasis", "passage_text": "Choledocholithiasis (also called bile duct stones or gallstones in the bile duct) is the presence of a gallstone in the common bile duct. Gallstones usually form in your gallbladder. The gallbladder is a pear-shaped organ below your liver in the upper-right side of your abdomen."}, {"url": "http://www.mayoclinic.org/diseases-conditions/gallstones/basics/complications/CON-20020461", "passage_text": "Complications of gallstones may include: 1  Inflammation of the gallbladder. 2  A gallstone that becomes lodged in the neck of the gallbladder can cause inflammation of the gallbladder (cholecystitis). 3  Cholecystitis can cause severe pain and fever. 4  Blockage of the common bile duct."}, {"url": "http://www.merckmanuals.com/home/liver-and-gallbladder-disorders/gallbladder-and-bile-duct-disorders/gallstones", "passage_text": "About 80% of people with gallstones do not have any symptoms for many years, if ever, particularly if the gallstones remain in the gallbladder. Gallstones may cause pain. Pain develops when the stones pass from the gallbladder into the cystic duct, common bile duct, or ampulla of Vater and block the duct."}, {"url": "http://www.cancer.org/cancer/bileductcancer/detailedguide/bile-duct-cancer-signs-symptoms", "passage_text": "Jaundice is the most common symptom of bile duct cancer, but most cases of jaundice are not caused by cancer. Jaundice is more often caused by hepatitis (inflammation of the liver) or a gallstone that has traveled to the bile duct. But whenever jaundice occurs, a doctor should be seen right away."}, {"url": "http://www.ehow.com/info_8108496_symptoms-gallstone-bile-duct.html", "passage_text": "Some gallstones can irritate the gallbladder or become lodged in the hepatic, cystic, common bile or pancreatic ducts. Symptoms similar to other conditions, such as a heart attack and appendicitis, may be present with gallstones. Proper diagnosis and medical attention is necessary when symptoms occur."}, {"url": "http://www.merckmanuals.com/home/liver-and-gallbladder-disorders/gallbladder-and-bile-duct-disorders/gallstones", "passage_text": "Stones in the gallbladder (called cholelithiasis) sometimes pass into the bile ducts, or stones may form in the bile ducts. Stones in the bile ducts are called choledocholithiasis. These stones sometimes block a bile duct. Most gallstones do not cause symptoms."}]