[{"url": "https://en.wikipedia.org/wiki/Chaff", "passage_text": "In grasses (including cereals such as rice, barley, oats and wheat), the ripe seed is surrounded by thin, dry, scaly bracts (called glumes, lemmas and paleas), forming a dry husk (or hull) around the grain. The process of loosening the chaff from the grain so as to remove it is called threshing – traditionally done by milling or pounding. Separating remaining loose chaff from the grain is called winnowing – traditionally done by repeatedly tossing the grain up into a light wind which gradually blows the lighter chaff away."}, {"url": "http://www.answers.com/Q/What_is_the_husk_of_a_grain_called", "passage_text": "The beard portion of the seed head of a cereal grain plant is  called, collectively, awns. A single awn is the bristle portion of  a seed of grain that extends up at the t … op point of this seed. The  hull protects the endosperm, germ and bran portion of the grain  seed. Cereal grains which have such beards or awns are wheat,  barley, rye and triticale. Rice, corn, and oats do not have such  awns due to the different characteristics of their inflorescences  or flowering portion of the grass plant. Grain is stored in what is called a Granary (also called Grainery or Grainary, depending on where you live). Grain is also stored in a Grain Elevator, a Silo, or a Grain Bin. 30 people found this useful."}, {"url": "https://en.wikipedia.org/wiki/Husk", "passage_text": "The husk of a legume and some similar fruits is called a pod. Plantago-seed mucilage is often referred to as husk, or psyllium husk. Crop plants of several species have been selected that have hulless seeds, including pumpkins, oats, and barley. It often refers to the leafy outer covering of an ear of maize (corn) as it grows on the plant. Literally, a husk or hull includes the protective outer covering of a seed, fruit or vegetable. It can also refer to the exuvia of bugs or small animals left behind after moulting."}, {"url": "http://www.answers.com/Q/What_is_the_husk_of_a_grain_called", "passage_text": "exists and is an alternate of. Merge this question into. Split and merge into it. Answer by J. J. Confidence votes 170. there is no name or scientific name its just callled a husk. Chaff. 1  actually, the husk of cereal grains is called bran. Grain is stored in what is called a Granary (also called Grainery or Grainary, depending on where you live). Grain is also stored in a Grain Elevator, a Silo, or a Grain Bin. 30 people found this useful."}, {"url": "https://en.wikipedia.org/wiki/Husk", "passage_text": "Husk (or hull) in botany is the outer shell or coating of a seed. It often refers to the leafy outer covering of an ear of maize (corn) as it grows on the plant. Literally, a husk or hull includes the protective outer covering of a seed, fruit or vegetable. It can also refer to the exuvia of bugs or small animals left behind after moulting. In cooking, hull can also refer to other waste parts of fruits and vegetables, notably the cap or sepal of a strawberry"}, {"url": "http://www.agintheclassroom.org/TeacherResources/TerraNova/clr_wheatnews.pdf", "passage_text": "Wheat is a grain (a plant that produces a dry edible seed called a kernel) used mostly for human consumption. Wheat is an annual grass plant that will grow 2 to 3 feet tall. There are two major types of wheat planted in the United States. They are winter wheat and spring wheat. The wheat seeds are put into the ground. by a machine called a grain drill. The drill. is pulled by a tractor and digs narrow rows. in the earth and drops the wheat seeds. into the rows. Then it covers the seeds. with soil so they can take root. The seed begins to grow when there is enough. mositure in the soil."}, {"url": "http://www.robinsonlibrary.com/agriculture/plant/field/wheat.htm", "passage_text": "Wheatthe world's most important grain crop Wheat is a grass-type plant that belongs to the group of grains called cereals, which also includes rice, oats, corn, barley, and rye. A common food staple in North and South America, Europe, Africa, Australia, and much of Asia, wheat covers more of the earth's surface than any other food crop. the world's most important grain crop. Wheat is a grass-type plant that belongs to the group of grains called cereals, which also includes rice, oats, corn, barley, and rye."}, {"url": "http://lakecountyshow.org/grain.htm", "passage_text": "What remains on the canvas is a combination of grain and chaff or husks. To get rid of the useless chaff the material is tossed into the air, preferably on a windy day in a process called winnowing. The wind blows the feather light chaff away and the heavier grain falls to the canvas. The term means to separate the seeds of grain from the husks and straw. Some types of grains are wheat, oats, barley and rice. Early threshing was done by laying out a canvas tarp, breaking open a sheave of wheat and spreading it in an even, shallow way."}, {"url": "http://www.agintheclassroom.org/TeacherResources/TerraNova/clr_wheatnews.pdf", "passage_text": "Thresh: to beat the stems and husks of grain or cereal plants with a machine to separate the grains and seeds. Tiller: an erect shoot arising from the crown of a grass. Wheat germ: the embryo of the wheat kernel that will develop into a wheat plant. The wheat seeds are put into the ground. by a machine called a grain drill. The drill. is pulled by a tractor and digs narrow rows. in the earth and drops the wheat seeds. into the rows. Then it covers the seeds. with soil so they can take root. The seed begins to grow when there is enough. mositure in the soil."}]