[{"url": "https://www.quora.com/Why-cant-dopamine-cross-the-blood-brain-barrier-while-L-dopa-or-other-substituted-phenethylamines-can", "passage_text": "2.5k Views. The blood brain barrier (BBB) is formed by endothelial cells with the presence of tight junctions and a relative lack of transcytotic vesicular transport or receptor-mediated endocytosis. This prevent most substances to cross over such barrier. "}, {"url": "http://www.cancerresearchuk.org/about-cancer/type/brain-tumour/treatment/chemotherapy/about-brain-tumour-chemotherapy", "passage_text": "It can be difficult to treat some brain tumours with chemotherapy drugs because the brain is protected by the blood brain barrier. This is a natural filter within the body. It only allows certain substances through from the blood to the brain tissues. Some drugs can cross the blood brain barrier. Some brain tumours damage the blood brain barrier so that the chemotherapy can enter the brain. Chemotherapy can be given as tablets or capsules or as injections into a vein. It is possible to inject some drugs into the fluid that circulates around the brain and spinal cord. "}, {"url": "https://en.wikipedia.org/wiki/Blood%E2%80%93brain_barrier", "passage_text": "A small number of regions in the brain, including the circumventricular organs (CVOs), do not have a blood–brain barrier. The blood–brain barrier occurs along all capillaries and consists of tight junctions around the capillaries that do not exist in normal circulation. The blood–brain barrier acts very effectively to protect the brain from many common bacterial infections. Thus, infections of the brain are very rare. Infections of the brain that do occur are often very serious and difficult to treat."}, {"url": "https://en.wikipedia.org/wiki/Blood%E2%80%93brain_barrier", "passage_text": "It is believed that latent HIV can cross the blood–brain barrier inside circulating monocytes in the bloodstream ( Trojan horse theory) within the first 14 days of infection. The blood–brain barrier acts very effectively to protect the brain from many common bacterial infections. Thus, infections of the brain are very rare. Infections of the brain that do occur are often very serious and difficult to treat."}, {"url": "https://faculty.washington.edu/chudler/bbb.html", "passage_text": "Functions of the BBB. The BBB has several important functions: 1  Protects the brain from foreign substances in the blood that may injure the brain. 2  Protects the brain from hormones and neurotransmitters in the rest of the body. 1 Large molecules do not pass through the BBB easily. 2  Low lipid (fat) soluble molecules do not penetrate into the brain. 3  However, lipid soluble molecules, such as barbituate drugs, rapidly cross through into the brain. 4  Molecules that have a high electrical charge are slowed."}, {"url": "http://neuroscience.uth.tmc.edu/s4/chapter11.html", "passage_text": "11.1 Blood-brain Barrier Maintains the Constancy of the Brain's Internal Environment. The blood-brain barrier (BBB) protects the neural tissue from variations in blood composition and toxins. Elsewhere in the body the extracellular concentrations of hormones, amino acids and potassium undergo frequent fluctuations, especially after meals, exercise or stressful times. Discovery of blood-brain barrier. The discovery of the BBB dates back more than 100 years when, in the 1880s, Paul Ehrlich observed that intravenous administration of certain dyes (e.g. trypan blue) stained all organs except the brain and the spinal cord."}, {"url": "http://www.abc.net.au/science/articles/2013/07/23/3808471.htm", "passage_text": "The blood-brain barrier has two specific proteins involved in this process — one brings the beta-amyloid out of the bloodstream into the brain, while the other protein does the opposite. Perhaps keeping the beta amyloid out of the brain might be a prevention, or even a cure, for Alzheimer's disease. We can now see that the blood-brain barrier is not just a flyscreen with little holes in it, but a vital organ made of many different types of cells. The anatomy and micro-anatomy is astonishing. The blood vessels in the brain (and in the spinal cord as well) are lined on the inside with specialised endothelial cells."}, {"url": "http://www.abc.net.au/science/articles/2013/07/23/3808471.htm", "passage_text": "But these blood vessels are different from all the other blood vessels in our body. They are lined by a strange structure called the blood-brain barrier. It closely controls what is, and is not, allowed to leave the blood supply and enter the brain. It's your own personal customs and border security. We can now see that the blood-brain barrier is not just a flyscreen with little holes in it, but a vital organ made of many different types of cells. The anatomy and micro-anatomy is astonishing. The blood vessels in the brain (and in the spinal cord as well) are lined on the inside with specialised endothelial cells."}, {"url": "http://www.inspire.com/groups/advanced-breast-cancer/discussion/what-crosses-blood-brain-barrier-our-study/", "passage_text": "However, there has been research in this area. In germany, frankincense (boswellia serrata) is aparently considered a standard treatment for cancer in brain because it is one of the few substances believed to cross the BBB. Wormwood (Artemisia absinthium) is another possibility. "}, {"url": "http://neuroscience.uth.tmc.edu/s4/chapter11.html", "passage_text": "All areas of the brain do not have a blood-brain barrier. The structures located at strategic positions in the midline of the ventricular system and lack the BBB are collectively referred to as circumventricular organs (CVOs). Discovery of blood-brain barrier. The discovery of the BBB dates back more than 100 years when, in the 1880s, Paul Ehrlich observed that intravenous administration of certain dyes (e.g. trypan blue) stained all organs except the brain and the spinal cord."}]