[{"url": "http://www.tubefilter.com/2014/02/03/youtube-average-cpm-advertising-rate/", "passage_text": "The most interesting part of the article, however, concerns dwindling CPMs (cost per one thousand ad views) on YouTube. According to data from Tubemogul, the average YouTube CPM in 2013 was $7.60, down $1.75 from 2012. To the uninitiated, that may seem like a big number, though additional analysis from Tubemogul explains that the CPM isn’t as straightforward as it seems."}, {"url": "http://www.marketingterms.com/dictionary/cpm/", "passage_text": "The total price paid in a CPM deal is calculated by multiplying the CPM rate by the number of CPM units. For example, one million impressions at $10 CPM equals a $10,000 total price. 1,000,000 / 1,000 = 1,000 units 1,000 units X $10 CPM = $10,000 total price. The amount paid per impression is calculated by dividing the CPM by 1000. For example, a $10 CPM equals $.01 per impression."}, {"url": "http://smallbusiness.chron.com/typical-cpm-74763.html", "passage_text": "CPM can be calculated for print and digital ads as well as direct mail. Jupiterimages/liquidlibrary/Getty Images. CPM stands for cost per thousand.. It's a standard marketing calculation used to determine the cost of reaching 1,000 potential customers with an ad campaign. CPM is calculated by taking the total cost of the marketing method and dividing it by the number of impressions it makes. CPM for magazine ads is calculated on the estimated circulation size of the magazine, which you can find in the magazine's media kit. Most provide audited figures, including the total number of readers broken down by subscribers and newsstand sales."}, {"url": "https://support.google.com/adwords/answer/6310?hl=en", "passage_text": "Cost-per-thousand impressions (CPM). CPM bidding means that you pay based on the number of impressions (times your ads are shown) that you receive on the Google Display Network. Starting this year, CPM bidding will be replaced by viewable CPM bidding. Existing CPM bids will eventually be transitioned to vCPM automatically. 1 CPM stands for cost-per-thousand impressions, so you pay for each set of a thousand views of your ad. 2  You set CPM bids to tell Google how much you're willing to pay for that set of impressions. 3  CPM bidding is best suited for advertisers who are focused on brand awareness."}, {"url": "https://en.wikipedia.org/wiki/Cost_per_impression", "passage_text": "Cost per impression (CPI), or Cost per thousand impressions (CPM), is a term used in traditional advertising media selection, as well as online advertising and marketing related to web traffic. Cost per impression, along with cost per click and cost per order, is used to assess the cost effectiveness and profitability of online advertising."}, {"url": "http://smallbusiness.chron.com/typical-cpm-74763.html", "passage_text": "A banner ad that costs $100 for 20,000 impressions has a CPM of $5, for example. By examining the costs to reach 1,000 customers for each marketing tactic you're considering, you can see at a glance which tactic costs more to reach the same number of people to help you decide where to invest your marketing dollars. CPM for magazine ads is calculated on the estimated circulation size of the magazine, which you can find in the magazine's media kit. Most provide audited figures, including the total number of readers broken down by subscribers and newsstand sales."}, {"url": "https://en.wikipedia.org/wiki/Cost_per_mille", "passage_text": "Cost per mille (CPM), also called cost ‰ and cost per thousand (CPT) (in Latin mille means thousand), is a commonly used measurement in advertising. Radio, television, newspaper, magazine, out-of-home advertising, and online advertising can be purchased on the basis of showing the ad to one thousand viewers. Note: Notice how the CPM is $6.25 and not $0.00625, this is because we are looking at cost per thousand. 1  In online advertising, if a website sells banner ads for a $20 CPM, that means it costs $20 to show the banner on 1000 page views."}, {"url": "http://smallbusiness.chron.com/typical-cpm-74763.html", "passage_text": "Marketers often track both the CPM and the CPI, or cost per interaction, for social media, and they use both metrics to judge the costs and effectiveness of their marketing efforts. The average CPM for social media banner advertising is $1 to $4, but the price can vary considerably. CPM for magazine ads is calculated on the estimated circulation size of the magazine, which you can find in the magazine's media kit. Most provide audited figures, including the total number of readers broken down by subscribers and newsstand sales."}, {"url": "http://www.investopedia.com/terms/c/cpm.asp", "passage_text": "DEFINITION of 'Cost Per Thousand-CPM'. The price of 1,000 advertisement impressions on one webpage. If a website publisher charges $2 CPM, that means an advertiser must pay $2 for every 1,000 impressions of its ad. The M in CPM represents the roman numeral for 1,000. CPM is the most common method for pricing web ads. However, an advertisement's success cannot be measured by CTR alone, because an ad that is viewed but not clicked on may still have an impact."}, {"url": "https://www.adspeed.com/Knowledges/19/Sales/CPM_effective_CPM_rate.html", "passage_text": "CPM is the cost per 1,000 impressions. For example, a $1 CPM means $1 for 1000 ad views. For the purpose of ad serving, it is the cost to serve 1,000 ad impressions. You can compare our rates with other ad management solutions. You will see that our pricing has one of the most competitive CPM rates on the market. "}]