[{"url": "https://www.psychologytoday.com/blog/arts-and-health/201101/so-you-want-be-art-therapist-part-two-art-therapy-education", "passage_text": "In deciding if an art therapy masters degree is for you, there are a couple of challenges you'll face. The first hurdle is cost. The vast majority of art therapy education programs are in private colleges and universities rather than state-funded ones. "}, {"url": "https://nationalcareersservice.direct.gov.uk/advice/planning/jobprofiles/Pages/arttherapist.aspx", "passage_text": "Part-time courses take three years. To do a postgraduate course, you will need to have a degree in art and design or be a qualified art teacher. You may also be considered if you have a degree in another subject relevant to this career, for instance psychology, nursing or social work. "}, {"url": "http://careersinpsychology.org/start-your-art-therapy-career/", "passage_text": "However, as one would expect, an art therapy career also usually requires a certain degree of artistic talent as well. For example, art therapists should be good at painting, drawing, sculpting, or some other form of art. They should also be open to different forms and styles of artwork as well. Art therapy is a form of therapy that uses art as the primary form of therapeutic expression. Therapists in this field can help their clients interpret and understand their feelings and emotions through the art that they create."}, {"url": "http://learn.org/articles/What_Type_of_Degree_Do_I_Need_to_Become_an_Occupational_Therapist.html", "passage_text": "To become an occupational therapist, you'll need a minimum of a master's degree in occupational therapy. The following article offers information on preparing for and entering an occupational therapy program, as well as information about certification and licensure. Once in college, occupational therapy students who don't opt for a dual bachelor's and master's degree program should be sure to adequately prepare by choosing an undergraduate major in occupational therapy or one of the following disciplines:"}, {"url": "http://study.com/art_therapist.html", "passage_text": "Artists who also have a deep interest in psychology might consider an art therapy career. Art therapists help patients deal with problems through the creation of art. Most art therapists have at least a bachelor's degree, and most employers prefer to hire certified art therapists. Graduates of a program typically earn a master's degree in art therapy. They may also earn a master's degree in counseling with a concentration in art therapy. Some art therapists return to school to earn a Ph.D."}, {"url": "http://careersinpsychology.org/start-your-art-therapy-career/", "passage_text": "An art therapist’s job is not to teach art or critique a client’s work, however. Instead of teaching or criticizing a client or his work, an art therapist will typically just keep encouraging him to create as much art as he feels comfortable with during the course of his therapy. Art therapy is a form of therapy that uses art as the primary form of therapeutic expression. Therapists in this field can help their clients interpret and understand their feelings and emotions through the art that they create."}, {"url": "http://careersinpsychology.org/start-your-art-therapy-career/", "passage_text": "Before an art therapist starts working with a client, he will usually assess the client first. This usually involves determining whether art therapy is right for the client, and whether the client will respond well to this type of therapy. Art therapy is a form of therapy that uses art as the primary form of therapeutic expression. Therapists in this field can help their clients interpret and understand their feelings and emotions through the art that they create."}, {"url": "http://study.com/art_therapist.html", "passage_text": "Certification Requirements. Art therapists are required to be certified by the Art Therapy Credentials Board (ATCB). After earning a master's degree and fulfilling post-graduate art therapy experience requirements, new therapists are eligible to earn a credential to become a registered art therapist (ATR). Graduates of a program typically earn a master's degree in art therapy. They may also earn a master's degree in counseling with a concentration in art therapy. Some art therapists return to school to earn a Ph.D."}, {"url": "http://www.innerbody.com/careers-in-health/how-to-become-an-art-therapist.html", "passage_text": "Requirements. Education. Becoming an art therapist requires a Master’s Degree in Art Therapy, or in counseling with an emphasis in art therapy, from an accredited institution. Graduate schools require a bachelor’s degree from an accredited four-year institution. To become a registered art therapist, candidates must complete a master’s degree as well as the requisite number of post-graduate training hours. Board certified necessitates additional post-graduate clinical training under the supervision of a licensed clinician."}, {"url": "http://study.com/art_therapist.html", "passage_text": "They then apply to a master's degree program in art therapy. According to the American Art Therapy Association, prospective art therapy graduate students must submit a portfolio of their artwork in order to be admitted to an art therapy degree program (www.americanarttherapyassociation.org). Graduates of a program typically earn a master's degree in art therapy. They may also earn a master's degree in counseling with a concentration in art therapy. Some art therapists return to school to earn a Ph.D."}]