[{"url": "http://eyecreamadvisor.com/what-is-collagen/", "passage_text": "Produced within the bodies of animals (including humans), collagen is a collection of proteins. It’s present in the skin, but it’s also required to make and maintain healthy connective tissue throughout the body. Of course, what we’re really interested in here is what collagen does to maintain the skin’s integrity. Along with keratin, a protein most often associated with hair and skin, and elastin, collagen maintains elasticity and strength. It also “plumps out” the skin, making lines appear more shallow."}, {"url": "http://organicbeautyandskin.com/what-is-my-skin-type/collagen-skin-care.html/", "passage_text": "Collagen is a protein present in all the body’s organs and tissues. It provides the matrix that sustains the body’s structure. Collagen’s main function is to sustain tendons, skin and cartilage. It provides integrity, firmness and elasticity to their structures. Maximizing collagen levels will keep skin supple. "}, {"url": "http://www.vitalproteins.com/what-is-collagen", "passage_text": "If you lack the amino acids that combine to form collagen, your body's cells can't produce enough of it. Threonine is an essential amino acid for collagen production. Collagen is an important building block for the skin. It makes up to 30% of the protein of the living body and 70% of the protein that makes up skin. Collagen ensues the cohesion, elasticity and regeneration of skin. "}, {"url": "http://wilsonbleasdaleclinic.co.uk/cosmetic-acupuncture/why-is-collagen-important/", "passage_text": "Collagen makes up 75% of our skin. Thus the smooth plump appearance of young healthy skin is due, in large part, to the presence of healthy collagen levels. The breakdown of healthy collagen and the decline in collagen production leads to the development of unwanted wrinkles and the appearance of aged skin. Collagen is the body’s major structural protein composed of three protein chains wound together in a tight triple helix. This protein supports tissues and organs and connects these structures to bones."}, {"url": "https://answers.yahoo.com/question/index?qid=20130428104855AAbGKA5", "passage_text": "This combination of collagen and elastin is very important in many parts of the body, including, but not limited to, the lungs, bones, and tendons. Even the blood vessels rely on both collagen and elastin.Often, collagen is discussed in relation to the skin. Best Answer: Collagen is a type of protein. Fibrous in nature, it connects and supports other bodily tissues, such as skin, bone, tendons, muscles, and cartilage. It also supports the internal organs and is even present in teeth."}, {"url": "http://eyecreamadvisor.com/what-is-collagen/", "passage_text": "When collagen is collected into fibers, called fibrils, it is found in the skin, ligaments and tendons, corneas, cartilage and bone, blood vessels and even the gut. It also constitutes 1-2% of your muscle. Amazingly, collagen makes up nearly 35% of your entire body’s protein content! Of course, what we’re really interested in here is what collagen does to maintain the skin’s integrity. Along with keratin, a protein most often associated with hair and skin, and elastin, collagen maintains elasticity and strength. It also “plumps out” the skin, making lines appear more shallow."}, {"url": "https://www.nuskin.com/en_ZA/corporate/company/science/skin_care_science/collagen.html", "passage_text": "Collagen is a major structural protein in the skin. It plays a key role in providing the structural scaffolding for cells, tissues, and organs. If it weren't for collagen, the body would literally fall apart. Collagen is created by fibroblasts, which are specialized skin cells located in the dermis. Fibroblasts also produce other skin structural proteins such as elastin (a protein which gives the skin its ability to snap back) and glucosaminoglycans (GAGs). GAGs make up the ground substance that keeps the dermis hydrated."}, {"url": "http://www.biosilusa.com/why-is-collagen-important/", "passage_text": "Collagen is a protein. It’s the most important building block in the human body. It comprises over a third of your body’s proteins. It makes up 75% of your skin. In your joints, Collagen makes up 70% of cartilage and up to 90% of tendons and ligaments. Collagen increases blood flow to your scalp – helping to saturate your hair with vital growth nutrients creating thicker, stronger hair."}, {"url": "https://www.nuskin.com/en_ZA/corporate/company/science/skin_care_science/collagen.html", "passage_text": "Because collagen gives the skin its strength, durability, and smooth, plump appearance, it's important to protect and promote collagen growth. Taking good care of your skin means taking care of your collagen. Zoe Diana Draelos. M.D., F.A.A.D. Collagen is created by fibroblasts, which are specialized skin cells located in the dermis. Fibroblasts also produce other skin structural proteins such as elastin (a protein which gives the skin its ability to snap back) and glucosaminoglycans (GAGs). GAGs make up the ground substance that keeps the dermis hydrated."}]