[{"url": "https://www.med.unc.edu/imig/about", "passage_text": "Internal Medicine encompasses the care of all adults, healthy and sick. Internists (as all doctors who complete an internal medicine residency are called) can be generalists or subspecialists, like cardiologists or rheumatologists. If you choose not to subspecialize, you are known as a General Internist. General Internists serve as primary care physicians, along with family medicine doctors and pediatricians. The biggest difference between Family Medicine and Internal Medicine is that IM training focuses on adults, with residents spending time between various adult medicine subspecialties."}, {"url": "http://www.wisegeek.org/what-is-internal-medicine.htm", "passage_text": "Internal medicine is a medical specialty which focuses on the diagnosis, treatment, and prevention of nonsurgical conditions in adults. This specialty has a number of subspecialties ranging from nephrology, the study of the kidneys, to immunology, the study of allergies and immune system disorders. Although internal medicine focuses on diagnosing and treating disease, injury or other conditions related to internal organs, the practice does the same for external body parts, also."}, {"url": "http://www.thedoctorsclinic.com/specialties/internal-medicine.aspx", "passage_text": "Overview. Doctors of internal medicine, called internists focus on comprehensive adult medicine. While the name internal medicine may lead one to believe that internists only treat internal problems, this is not the case. Doctors of internal medicine treat the whole person, not just internal organs. They care for their patients for life, from late teen years through old age."}, {"url": "https://en.wikipedia.org/wiki/Internal_medicine", "passage_text": "Internal medicine or general medicine (in Commonwealth nations) is the medical specialty dealing with the prevention, diagnosis, and treatment of adult diseases. Physicians specializing in internal medicine are called internists, or physicians (without a modifier) in Commonwealth nations. Internists are skilled in the management of patients who have undifferentiated or multi-system disease processes. The term internal medicine originates from the German term Innere Medizin, popularized in Germany in the late 19th century to describe physicians who combined the science of the laboratory with the care of patients."}, {"url": "https://en.wikipedia.org/wiki/Internal_medicine", "passage_text": "Internists are qualified physicians with postgraduate training in internal medicine and should not be confused with  interns , who are doctors in their first year of residency training (officially the term intern is no longer in use). The term internal medicine originates from the German term Innere Medizin, popularized in Germany in the late 19th century to describe physicians who combined the science of the laboratory with the care of patients."}, {"url": "https://en.wikipedia.org/wiki/Internal_medicine", "passage_text": "Because internal medicine patients are often seriously ill or require complex investigations, internists do much of their work in hospitals. Internists often have subspecialty interests in diseases affecting particular organs or organ systems. The term internal medicine originates from the German term Innere Medizin, popularized in Germany in the late 19th century to describe physicians who combined the science of the laboratory with the care of patients."}, {"url": "http://www.healthcommunities.com/health-care-providers/what-is-an-internist.shtml", "passage_text": "Print. An internist, also called a general internist or doctor of internal medicine, is a medical doctor that specializes in the diagnosis and medical (nonsurgical) treatment of adults. Internists provide long-term, comprehensive care and manage both common and complex diseases. "}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=3995", "passage_text": "Internal medicine: The medical specialty dedicated to the diagnosis and medical treatment of adults. A physician who specializes in internal medicine is referred to as an internist. "}]