[{"url": "https://answers.yahoo.com/question/index?qid=20100128123101AAjg9Ih", "passage_text": "Depending on your oven temp it should not take more t han 1/1/2 hours at 350 deg. Pour tomatoe sause over meat orio to puting in oven. Dont cover the meatloaf.If you find its still not done leave in oven for another 1/2 hour. Meeat lofes are thick, but you dont want it to turn crispy. "}, {"url": "http://www.foodnetwork.com/recipes/ina-garten/turkey-meatloaf-recipe.html", "passage_text": "Allow to cool to room temperature. Combine the ground turkey, bread crumbs, eggs, and onion mixture in a large bowl. Mix well and shape into a rectangular loaf on an ungreased sheet pan. Spread the ketchup evenly on top. Bake for 1 1/2 hours until the internal temperature is 160 degrees F. and the meatloaf is cooked through. (A pan of hot water in the oven under the meatloaf will keep the top from cracking.) Serve hot, at room temperature, or cold in a sandwich. Copyright 1999, The Barefoot Contessa Cookbook, All Rights Reserved. "}, {"url": "https://answers.yahoo.com/question/index?qid=20070624055855AAbhyGb", "passage_text": "If you cook a 2 pound meatloaf at 350 degrees, it should take 1 hour and 20 to 30 minutes depending on the oven variations in temperature. The more fatty the hamburger, and the more liquids used in the recipe, the faster the meat will cook. Source(s): hushnowjustplayit · 8 years ago. Report Abuse. For a 2 pound meatloaf....I'd set the oven to 350 degrees and place the meatloaf on a heavy baking pan. (like the bottom of the broiler pan). It's heavy so it browns well. Spray or rub with olive oil..and place the meatloaf there sprinkle with flour all over and pat it on."}, {"url": "https://answers.yahoo.com/question/index?qid=20070624055855AAbhyGb", "passage_text": "Place your meatloaf in the roasting pan and shape into a loaf. Bake at 350 degrees for 1 hour to 1 1/2 hours. Cooking the meatloaf this way ensures that all of the heat from the oven can get to all sides of the meatloaf and not just the top like in a loaf pan. Report Abuse. For a 2 pound meatloaf....I'd set the oven to 350 degrees and place the meatloaf on a heavy baking pan. (like the bottom of the broiler pan). It's heavy so it browns well. Spray or rub with olive oil..and place the meatloaf there sprinkle with flour all over and pat it on."}, {"url": "https://answers.yahoo.com/question/index?qid=20070624055855AAbhyGb", "passage_text": "For a 2 pound meatloaf....I'd set the oven to 350 degrees and place the meatloaf on a heavy baking pan. (like the bottom of the broiler pan). Report Abuse. For a 2 pound meatloaf....I'd set the oven to 350 degrees and place the meatloaf on a heavy baking pan. (like the bottom of the broiler pan). It's heavy so it browns well. Spray or rub with olive oil..and place the meatloaf there sprinkle with flour all over and pat it on."}, {"url": "http://www.thekitchn.com/how-to-make-meatloaf-cooking-lessons-from-the-kitchn-197077", "passage_text": "Remove from heat and let cool slightly. Make the meatloaf mix: In a large mixing bowl, combine the ground meat, beaten eggs, Worcestershire sauce, salt and pepper, soaked bread and milk, and the cooked vegetables. Use your hands to work the ingredients together until just combined. Any ground meat can be used to make meatloaf: beef, pork, veal, or lamb. You can use just one kind of meat, or you can mix a few different kinds together to give your meatloaf different flavors and textures. Personally, I love a mix of about 70% beef (for its flavor) and 30% pork (for its fatty richness)."}, {"url": "http://www.simplyrecipes.com/recipes/classic_meatloaf/", "passage_text": "Cover the meatloaf mixture with the rest of the ketchup. 5 Bake for 1 hour at 350°F, or until a meat thermometer inserted into the center of the meatloaf reads 155°F. Remove from oven and let sit for 10 minutes. Then use a metal spatula to gently lift the meatloaf out of the loaf pan to a serving plate. Make thick slices to serve. "}, {"url": "http://www.answers.com/Q/What_is_the_final_cooking_temperature_for_meatloaf", "passage_text": "A typical two pound meatloaf should be covered in foil. Preheat  oven at 375 degrees and back for 80 minutes. Next remove the foil  and cook at 375 for another 15 minutes. beef should be cooked 145 (med. rare) to 165 (med) for things like meatloaf, you wanna pull the loaf out when it's about 5 degrees below the desired temp."}, {"url": "http://www.answers.com/Q/What_is_the_final_cooking_temperature_for_meatloaf", "passage_text": "Best thing to do is to get a thermometer, once the meatloaf hits 160-165F internally then it should be moist and juicy and cooked.   See my blog for the best turkey meatloaf recipe ever and for amazing and original turkey recipes.   http://www.loveturkeymeat.info. beef should be cooked 145 (med. rare) to 165 (med) for things like meatloaf, you wanna pull the loaf out when it's about 5 degrees below the desired temp."}, {"url": "http://homecooking.about.com/od/beef/a/meatloaftips.htm", "passage_text": "• For individual servings that bake quickly, mound meat mixture into greased muffin tins, which should be done in about 20 minutes. • Meatloaf baked in a standard 4-inch by 4-inch by 8-inch loaf pan is baked at 350 degrees F. for 1 to 1-1/2 hours. • Use about 1/2 cup filler per 1 pound of meat. This filler can be bread crumbs, mashed moist bread, oat bran, grated potato, grated carrot, mashed potatoes or wherever your experiments take you. • Add a cup of grated cheese to the meatloaf mixture before baking, and another 1/2 cup over the top of the loaf during the last 15 minutes of baking. • Add 1/3 cup of vegetable juice, wine, beef broth, or beer to the mixture for added flavor."}]