[{"url": "http://emedicine.medscape.com/article/835021-overview", "passage_text": "The orbit, which protects, supports, and maximizes the function of the eye, is shaped like a quadrilateral pyramid, with its base in plane with the orbital rim. Seven bones conjoin to form the orbital structure, as shown in the image below. The orbital plate of the maxilla joins the orbital plate of the zygoma and the orbital plate of the palatine bones to form the floor. Medially, the orbital wall consists of the frontal process of the maxilla, the lacrimal bone, the sphenoid, and the thin lamina papyracea of the ethmoid."}, {"url": "http://emedicine.medscape.com/article/835021-overview", "passage_text": "The superficial bony orbit is defined by the orbital margin, which is rectangular with rounded corners. The margin is discontinuous at the lacrimal fossa. The supraorbital notch (seen in the image below) is within the supraorbital rim and is closed to form the supraorbital foramen in 25% of individuals. The orbital plate of the maxilla joins the orbital plate of the zygoma and the orbital plate of the palatine bones to form the floor. Medially, the orbital wall consists of the frontal process of the maxilla, the lacrimal bone, the sphenoid, and the thin lamina papyracea of the ethmoid."}, {"url": "http://www.innerbody.com/image_skel01/skel40_new_skull.html", "passage_text": "The frontal bone is a bone of the skull found in the forehead region. It is one of eight bones that form the cranium, or brain case. The frontal bone plays a vital role in supporting and protecting the delicate nervous tissue of the brain. It gives shape to the skull and supports several muscles of the head. "}, {"url": "https://en.wikipedia.org/wiki/Orbitofrontal_cortex", "passage_text": "The orbitofrontal cortex (OFC) is a prefrontal cortex region in the frontal lobes in the brain which is involved in the cognitive processing of decision-making. In non-human primates it consists of the association cortex areas Brodmann area 11, 12 and 13; in humans it consists of Brodmann area 10, 11 and 47. It is defined as the part of the prefrontal cortex that receives projections from the magnocellular, medial nucleus of the mediodorsal thalamus, and is thought to represent emotion and reward in decision making."}, {"url": "http://emedicine.medscape.com/article/835021-overview", "passage_text": "The major nerves and vessels to the orbit and globe enter through 3 openings. The superior orbital fissure is bounded by the lesser and greater wings of the sphenoid. The greater wing of the sphenoid, the maxilla, and the palatine bones of the orbit form the boundaries of the inferior orbital fissure. The optic canal is at the apex of the orbit and lies within the sphenoid bone. The orbital plate of the maxilla joins the orbital plate of the zygoma and the orbital plate of the palatine bones to form the floor. Medially, the orbital wall consists of the frontal process of the maxilla, the lacrimal bone, the sphenoid, and the thin lamina papyracea of the ethmoid."}, {"url": "http://teachmeanatomy.info/head/organs/eye/bony-orbit/", "passage_text": "The borders and anatomical relations of the bony orbit are as follows: 1  Roof (superior wall) – Formed by the frontal bone and the lesser wing of the sphenoid. 2  The frontal bone separates the orbit from the anterior cranial fossa. 3  Floor (inferior wall) – Formed by the maxilla, palatine and zygomatic bones. 1 The frontal bone separates the orbit from the anterior cranial fossa. 2  Floor (inferior wall) – Formed by the maxilla, palatine and zygomatic bones. 3  The maxilla separates the orbit from the underlying maxillary sinus. 4  Medial wall – Formed by the ethmoid, maxilla, lacrimal and sphenoid bones."}, {"url": "https://en.wikipedia.org/wiki/Orbit_(anatomy)", "passage_text": "This article is about the orbit, the anatomical space that contains the eye. For other uses of orbit or orbita see Orbit (disambiguation) and Orbita (disambiguation) . In anatomy, the orbit is the cavity or socket of the skull in which the eye and its appendages are situated. Orbit can refer to the bony socket, or it can also be used to imply the contents. In the adult human, the volume of the orbit is 30 mL, of which the eye occupies 6.5 mL. The orbits are conical or four-sided pyramidal cavities, which open into the midline of the face and point back into the head. Each consists of a base, an apex and four walls. There are two important foramina, or windows, two important fissures, or grooves, and one canal surrounding the globe in the orbit."}, {"url": "https://www.kenhub.com/en/library/anatomy/bones-of-the-orbit", "passage_text": "Pathology. One of the most severe fractures that include the bony orbit is the blow out fracture. This is when the floor of the bony orbit, namely the maxilla caves in as a result of a combination of facial fractures such as the Le Fort II or III and zygomatic fractures. "}, {"url": "http://healthylifemed.com/what-is-sphenoid-bone/", "passage_text": "The sphenoid bone – Anatomy and Functions. Functions: One of the main functions of the sphenoid bone is that it helps in the development of the essential anatomical structures and formations of the skull. The sphenoid bone is located towards the front in the middle part of the skull, anterior of the temporal bone and near the bottom section of the occipital bone. It forms the cranium’s base, just posterior to the orbitals."}]