[{"url": "http://abc.go.com/shows/castle/about-the-show", "passage_text": "When viewers first met Richard Castle, a famous mystery novelist, he was creatively blocked. But when the NYPD questioned him in connection with a series of murders staged to imitate crime scenes from his books, Castle found inspiration in NYPD Detective Kate Beckett. The case has ties to the elusive Triple Killer. Castle is held hostage during a bank robbery and the team is seen in 1947 for the case of “The Blue Butterfly.” There’s a CIA showdown with rogue agents and a woman from Castle’s past."}, {"url": "http://www.castlewales.com/castles.html", "passage_text": "M any castles in Breconshire are of the type called motte and bailey, that is the large steep-sided conical mound with a defensive enclosure at its base. Later, or sometimes simultaneously with these constructions, stone elements were added to the castle. I n the early Medieval period in Wales and the border up to 1282, castles in the true sense of the word, were for defence. Other buildings more like country houses were built where the primary function was living accommodation."}, {"url": "https://en.wikipedia.org/wiki/Castle", "passage_text": "The word castle is derived from the Latin word castellum which is a diminutive of the word castrum, meaning fortified place. The Old English castel, Old French castel or chastel, French chateau, Château spanish, Castillo italian, castello and a number of words in other languages also derive from. castellum Due to the lord's presence in a castle, it was a centre of administration from where he controlled his lands. He relied on the support of those below him, as without the support of his more powerful tenants a lord could expect his power to be undermined."}, {"url": "https://en.wikipedia.org/wiki/Castle", "passage_text": "A castle (from Latin: castellum) is a type of fortified structure built in Europe and the Middle East during the Middle Ages by nobility. Scholars debate the scope of the word castle, but usually consider it to be the private fortified residence of a lord or noble. Due to the lord's presence in a castle, it was a centre of administration from where he controlled his lands. He relied on the support of those below him, as without the support of his more powerful tenants a lord could expect his power to be undermined."}, {"url": "http://www.angelfire.com/wy/svenskildbiter/castle.html", "passage_text": "The French use the word chateau for castle but it used to cover both: the Chateau-Gaillard, a fortress of the 12th century; and the manors dating from the 12th to the 18th century, which have no or little defensive capability. ...The castle has a double nature; it is both a home and a fortress...(It is) this double nature which makes the castle so different from dwellings and fortification of other periods."}, {"url": "http://abc.go.com/shows/castle/about-the-show", "passage_text": "Season 5: Castle and Beckett try to keep their new relationship a secret as they learn the man responsible for Johanna Beckett’s murder is the powerful Senator Bracken. When Alexis is kidnapped, Castle gets his daughter back with help from a man he’s never really met—his father. The case has ties to the elusive Triple Killer. Castle is held hostage during a bank robbery and the team is seen in 1947 for the case of “The Blue Butterfly.” There’s a CIA showdown with rogue agents and a woman from Castle’s past."}, {"url": "http://www.definitions.net/definition/CASTLE", "passage_text": "A castle is a type of fortified structure built in Europe and the Middle East during the Middle Ages by nobility. Scholars debate the scope of the word castle, but usually consider it to be the private fortified residence of a lord or noble. Wiktionary (0.00 / 0 votes) Rate this definition: castle (Noun). A large building that is fortified and contains many defences; in previous ages often inhabited by a nobleman or king. castle (Noun). A chess piece shaped like a castle tower which is also called a rook."}, {"url": "http://www.merriam-webster.com/dictionary/castle", "passage_text": "Definition of CASTLE for Kids. 1. : a large building or group of buildings usually having high walls with towers that was built in the past to protect against attack. 2. : a large or impressive house. Full Definition of CASTLE. 1. a: a large fortified building or set of buildings b: a massive or imposing house. 2. : a retreat safe against intrusion or invasion. 3. : 3rook. See castle defined for English-language learners. See castle defined for kids."}, {"url": "http://abc.go.com/shows/castle", "passage_text": "Continue Reading. When viewers first met Richard Castle, a famous mystery novelist, he was creatively blocked. But when the NYPD questioned him in connection with a series of murders staged to imitate crime scenes from his books, Castle found inspiration in NYPD Detective Kate Beckett. Once that initial case was solved, Castle and Beckett continued to investigate strange homicides in New York, combining Castle’s writer intuition and Beckett's creative detective work. In the Season 7 finale, Beckett was faced with a choice about her future."}]