[{"url": "http://www.answers.com/Q/How_long_does_it_take_to_get_to_Mars_from_Earth", "passage_text": "The actual yearly minimum distance is from 60 to 100 million kilometers. Unmanned probes from Earth can take from 7 months to two years to reach Mars, depending on when they are launched and how fast they can travel. The direct distance can vary from about 58 million kilometers to more than 400 million kilometers. The distance is at least 36 million miles (58 million km). Mars varies from 36 million to 250 million miles from Earth, so at the speed of light (186,282 miles per second) it woul … d take between 3.2 and 22.4 minutes for a radio transmission (of a picture, or whatever) to reach Earth from Mars."}, {"url": "http://www.answers.com/Q/How_long_does_it_take_to_get_to_Mars_from_Earth", "passage_text": "Making the world better, one answer at a time. Unmanned probes from Earth can take from 7 months to two years to reach Mars, depending on when they are launched and how fast they can travel. The direct distance can vary from about 58 million kilometers to more than 400 million kilometers. The distance is at least 36 million miles (58 million km). Mars varies from 36 million to 250 million miles from Earth, so at the speed of light (186,282 miles per second) it woul … d take between 3.2 and 22.4 minutes for a radio transmission (of a picture, or whatever) to reach Earth from Mars."}, {"url": "http://www.space.com/24701-how-long-does-it-take-to-get-to-mars.html", "passage_text": "To determine how long it will take to reach Mars, we must first know the distance between the two planets. Mars is the fourth planet from the sun, and the second closest to Earth (Venus is the closest). But the distance between the two planets is constantly changing as they travel around the sun. "}, {"url": "http://image.gsfc.nasa.gov/poetry/venus/q2811.html", "passage_text": "It depends on the details of the orbit you take between the Earth and Mars. The typical time during Mars's closest approach to the Earth every 1.6 years is about 260 days. Again, the details depend on the rocket velocity and the closeness of the planets, but 260 days is the number I hear most often give or take 10 days. For a more detailed discussion, see the. How long does it take? It takes the Earth one year to orbit the Sun and it takes Mars about 1.9 years (say 2 years for easy calculation) to orbit the Sun. The elliptical orbit which carries you from Earth to Mars is longer than Earth's orbit, but shorter than Mars' orbit."}, {"url": "http://www.youtube.com/watch?v=MpOJ6fQ0roI", "passage_text": "The journey from Earth to Mars takes about 300 days. Every two years Mars is at its closest point, only 55 million km from Earth, and it's the ideal time to send a spacecraft. Travel time depends on the positions of the planets and how much fuel you're willing to burn."}, {"url": "http://www.universetoday.com/14841/how-long-does-it-take-to-get-to-mars/", "passage_text": "Every two years or so, Mars and Earth reach their closest point, called “opposition”, when Mars can be as close as 55,000,000 km from Earth. And every two years, space agencies take advantage of this orbital alignment to send spacecraft to the Red Planet. Why Does it Take So Long? When you consider the fact that Mars is only 55 million km away, and the spacecraft are travelling in excess of 20,000 km/hour, you would expect the spacecraft to make the journey in about 115 days, but it takes much longer."}, {"url": "http://www.answers.com/Q/How_long_would_it_take_to_get_to_Mars_in_a_jet_from_earth", "passage_text": "Unmanned probes from Earth can take from 7 months to two years to reach Mars, depending on when they are launched and how fast they can travel. The direct distance can vary fr … om about 58 million kilometers to more than 400 million kilometers. The distance is at least 36 million miles (58 million km). "}, {"url": "http://www.universetoday.com/14841/how-long-does-it-take-to-get-to-mars/", "passage_text": "The total journey time from Earth to Mars takes between 150-300 days depending on the speed of the launch, the alignment of Earth and Mars, and the length of the journey the spacecraft takes to reach its target. It really just depends on how much fuel you’re willing to burn to get there. More fuel, shorter travel time. Why Does it Take So Long? When you consider the fact that Mars is only 55 million km away, and the spacecraft are travelling in excess of 20,000 km/hour, you would expect the spacecraft to make the journey in about 115 days, but it takes much longer."}]