[{"url": "http://work.chron.com/much-should-supervisor-field-social-work-make-per-year-16658.html", "passage_text": "Employers. The largest employers of social work supervisors were organizations that provide individual and family services, according to the BLS. The average pay here was $58,820 yearly as of May 2011. Other major employers were local governments and state governments. Locations. The state with the most opportunities for social work supervisors was California, with 14,560 jobs. Supervisors there averaged $68,930 per year as of May 2011, the BLS reports. Other high-employment states are New York, Pennsylvania, Texas and Massachuset"}, {"url": "http://work.chron.com/much-money-welfare-case-worker-make-per-year-15955.html", "passage_text": "A survey by the National Association of Social Workers found that practice area had a direct impact on earnings. In 2010, child and family case workers made anywhere from $42,400 to $72,000 a year. The median, however, was closer to $55,000. Those working with adolescent welfare earned a median of $50,000 a year. School social work, on the other hand, commanded a salary of $62,000 a year. While $7,000 more than a child and family case worker, it’s still not the highest income for the occupation. Administrators were the highest paid for the industry, earning $78,000 a year. As with any job, employers affect salaries, and a case worker is no exception. Those working directly for social services, where many welfare case workers are employed, earned a median of $53,000 a year; while those working for other government agencies made $66,300 a year."}, {"url": "http://www.access2knowledge.org/jobs-education/how-much-do-social-workers-make/", "passage_text": "How much does a social worker make? According to the May 2012 records from the Bureau of Labor Statistics, the mean annual healthcare social worker salary is $51,460, or $24.74 per hour. The lowest ten percent earn $31,410, while the top ten percent make an average of $74,030 annually. Social workers employed in general hospitals earn more with an average annual salary $56,960, while those in individual and family services make less than average at $42,110. The top paying industry for this occupation is in specialty hospitals at $61,750 per year, as well as employment services at $60,16"}, {"url": "http://www1.salary.com/Social-Work-Manager-salary.html", "passage_text": "For example the median expected annual pay for a typical Social Work Manager in the United States is $83,995 so 50% of the people who perform the job of Social Work Manager in the United States are expected to make less than $83,995. Source: HR Reported data as of October 2015. Median $83,995. Requires a master's degree in social work and at least 5 years of experience in the field or in a related area. Familiar with a variety of the field's concepts, practices, and procedures. Relies on extensive experience and judgment to plan and accomplish goals. Performs a variety of tasks."}, {"url": "http://money.usnews.com/careers/best-jobs/child-and-family-social-worker/salary", "passage_text": "Salary Outlook. Social workers who specialize in children and family welfare made a median salary of $42,120 in 2013, according to the BLS. The best-paid 10 percent in the field earned around $72,350, while the lowest-paid made approximately $27,420. With an average salary of $46,060 per year, child and family social workers earn slightly more than mental health counselors ($43,700) and substance abuse and behavioral disorder counselors ($41,090). However, they earn less than other professionals."}, {"url": "http://www.access2knowledge.org/jobs-education/how-much-do-social-workers-make/", "passage_text": "Social workers employed in the District of the Columbia earn the highest annual salary at a whopping $66,130. Following close behind, Nevada social workers make an average $64,640 and those in California earn $63,480. Social workers employed in general hospitals earn more with an average annual salary $56,960, while those in individual and family services make less than average at $42,110. The top paying industry for this occupation is in specialty hospitals at $61,750 per year, as well as employment services at $60,160 annually."}, {"url": "http://work.chron.com/much-money-welfare-case-worker-make-per-year-15955.html", "passage_text": "In 2011, social workers averaged $54,220 a year, according to the U.S. Bureau of Labor Statistics (BLS). But high salaries can sometimes skew the average, and median wage is often a better indication of a case worker’s earnings. Half of all social workers earned less than $53,900 a year. As with any job, employers affect salaries, and a case worker is no exception. Those working directly for social services, where many welfare case workers are employed, earned a median of $53,000 a year; while those working for other government agencies made $66,300 a year."}, {"url": "http://www.collegesanddegrees.com/programs/social-work/salary-prospects", "passage_text": "How Much Does a Social Worker Make? The average annual salary for social workers ranges from $24,000 to $70,000 a year, according to the Bureau of Labor Statistics (BLS); PayScale puts the pay range at $26,000 to $56,000. The average annual salary is around $42,000, according to the BLS. Glassdoor.com puts the average salary at about $50,000. Pay also varies within specialization depending on the type of facility where the social worker is employed. For example, school, child, and family social workers make $54,000 in elementary and secondary schools, while they only make $35,000, on average, in individual and family services."}]