[{"url": "https://uk.answers.yahoo.com/question/index?qid=20110721021648AACqkul", "passage_text": "Next. i sent my daughters (aged 5 months old) passport off on the 12/07/2011 and they would av recieved it on the 13/07/2011 i did it through the check and send service via post office and was wondering how long it should take to come back, i have been tracking it and been saying for a few days now (examination... Report Abuse. Depends how busy they are-any passports I have sent off though have always been back within a week (new applications and renewals) - the official time they say to allow for it to be processed is two to three weeks though I think. Mummy Of 4! · 4 years ago."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20070205032012AASzffl", "passage_text": "Report Abuse. Passports usually takes 6-8 weeks to get in but you can pay extra (it might be $60, I'm not exactly sure) to have it expedited which should take about 2 weeks. Call your post office and ask them for exact details. If you go and get it now you should have it back way before June. I just wouldn't go any later March"}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20110721021648AACqkul", "passage_text": "i sent my daughters (aged 5 months old) passport off on the 12/07/2011 and they would av recieved it on the 13/07/2011 i did it through the check and send service via post office and was wondering how long it should take to come back, i have been tracking it and been saying for a few days now (examination progress). Report Abuse. Depends how busy they are-any passports I have sent off though have always been back within a week (new applications and renewals) - the official time they say to allow for it to be processed is two to three weeks though I think. Mummy Of 4! · 4 years ago."}, {"url": "http://www.cic.gc.ca/english/passport/times.asp", "passage_text": "Check processing times for passport services. Find out how long it takes for the Passport Program to process your passport application. Processing times begin once we have received a complete application. They are based on how you applied and whether you requested express or urgent service. "}, {"url": "https://www.gov.uk/renew-adult-passport", "passage_text": "How long it takes. It should take 3 weeks to get the passport-use a different service if you need the passport urgently. It can take longer if more information is needed or your application hasn’t been filled out correctly. Don’t book travel until you have a valid passport-doing so is at your own risk. Renew or replace your adult passport. You can renew or replace your passport at any time. It costs £72.50, or £82.25 through the Post Office’s Passport Check and Send service. Time left on an existing passport is added to your new one, up to a maximum of 9 months."}, {"url": "https://answers.yahoo.com/question/index?qid=20090612094719AA8Aw8o", "passage_text": "I sent my passport off on Wednesday 10th June. How long does it take to come back? Some people say 6-8 weeks and some people say 10 days ! I want to go on Holiday on the 15th July!! I've already booked my ticket. Report Abuse. If you had it expedited it takes about 3 weeks, this would've cost you just under 200 dollars. If you just had it sent out by regular mail its 4-6 weeks. I'm afraid those are your only two options."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20110721021648AACqkul", "passage_text": "Depends how busy they are-any passports I have sent off though have always been back within a week (new applications and renewals) - the official time they say to allow for it to be processed is two to three weeks though I think. Report Abuse. Depends how busy they are-any passports I have sent off though have always been back within a week (new applications and renewals) - the official time they say to allow for it to be processed is two to three weeks though I think. Mummy Of 4! · 4 years ago."}]