[{"url": "https://en.wikipedia.org/wiki/Humanistic_psychology", "passage_text": "Humanistic psychology. Humanistic psychology is a psychological perspective which rose to prominence in the mid-20th century in response to the limitations of Sigmund Freud 's psychoanalytic theory and B. F. Skinner 's behaviorism. While humanistic psychology is a specific division within the American Psychological Association (Division 32) , humanistic psychology is not so much a discipline within psychology as a perspective on the human condition that informs psychological research and practice."}, {"url": "http://openstudy.com/updates/532ca53ce4b09ca30f9028f4", "passage_text": "Which of the following is considered a strength of the humanistic perspective? It takes into account various factors that make up the self.. Professional judgment of the therapist is highly valued. "}, {"url": "http://www.simplypsychology.org/perspective.html", "passage_text": "There are various different approaches in contemporary psychology. An approach is a perspective (i.e. view) that involves certain assumptions (i.e. beliefs) about human behavior: the way they function, which aspects of them are worthy of study and what research methods are appropriate for undertaking this study. Each perspective has its strengths and weaknesses, and brings something different to our understanding of human behavior. For this reason, it is important that psychology does have different perspectives to the understanding and study of human and animal behavior."}, {"url": "http://www.simplypsychology.org/humanistic.html", "passage_text": "Humanistic, humanism and humanist are terms in psychology relating to an approach which studies the whole person, and the uniqueness of each individual. Essentially, these terms refer the same approach in psychology. Both behaviorism and psychoanalysis are regarded as dehumanizing by humanistic psychologists. 1) It offered a new set of values for approaching an understanding of human nature and the human condition. 2) It offered an expanded horizon of methods of inquiry in the study of human behavior."}, {"url": "http://www.answers.com/Q/What_are_the_strengths_and_weaknesses_of_humanistic_approach", "passage_text": "A humanistic approach to psychology stresses the inherent goodness  of people, and believes that all people have potential for personal  growth. This school of thought was i … n competition with  psychoanalysis and behaviorism, and it is still a large component  of psychological thought today. Strenghts of the behaviourists approach are that it has had a major influence on psychology, it is very scientific, its easily testable, it is able to explain individual … differences, explains behaviour using simple principles and it has many practical applications."}, {"url": "https://answers.yahoo.com/question/index?qid=20100526082527AAhrwGA", "passage_text": "Answers. Best Answer: Well the humanistic view takes a more positive approach to humans. It's basic foundation is that humans are essentially good, but choose bad decisions at times. This is very true!! It also gives humans more control over their problems instead of going into the fact that their past shaped their behaviors. "}, {"url": "http://web.cortland.edu/andersmd/HUMAN/CRITIC.HTML", "passage_text": "Strengths. One of the greatest strengths of humanisticpsychology is that it emphasizes individual choice and responsibility. Humanistic psychology satisfies most people's idea of what being human meansbecause it values personal ideals and self-fulfillment. "}, {"url": "http://www.sacramentoriverportal.org/essay-sample-analyzing-humanistic-theories.htm", "passage_text": "Analyzing Humanistic Theories. In contrast to Freudian and Lacanian psychoanalytical theory which posited the unconscious as the driving force behind human action to which the self had little control, Humanistic theory instead focused on the positive attributes to what they considered it is to be human. "}, {"url": "http://www.simplypsychology.org/humanistic.html", "passage_text": "Humanism is a psychological perspective that emphasizes the study of the whole person. Humanistic psychologists look at human behavior not only through the eyes of the observer, but through the eyes of the person doing the behaving. Sometimes the humanistic approach is called phenomenological. Both behaviorism and psychoanalysis are regarded as dehumanizing by humanistic psychologists. 1) It offered a new set of values for approaching an understanding of human nature and the human condition. 2) It offered an expanded horizon of methods of inquiry in the study of human behavior."}, {"url": "http://www.simplypsychology.org/humanistic.html", "passage_text": "Humanism rejected the assumptions of the behaviorist perspective which is characterized as deterministic, focused on reinforcement of stimulus-response behavior and heavily dependent on animal research. Both behaviorism and psychoanalysis are regarded as dehumanizing by humanistic psychologists. 1) It offered a new set of values for approaching an understanding of human nature and the human condition. 2) It offered an expanded horizon of methods of inquiry in the study of human behavior."}]