[{"url": "https://en.wikipedia.org/wiki/Reiki", "passage_text": "Reiki (/ˈreɪkiː/) is a form of alternative medicine developed in 1922 by Japanese Buddhist Mikao Usui. Since its beginning in Japan, Reiki has been adapted across varying cultural traditions. It uses a technique commonly called palm healing or hands-on-healing. Through the use of this technique, practitioners believe that they are transferring universal energy through the palms of the practitioner, which they believe encourages healing. Reiki is considered pseudoscience. It is based on qi (chi), which practitioners say is a universal life force, although there is no empirical evidence that such a life force exists. Surveys of the clinical research do not show Reiki to be effective as a medical treatment"}, {"url": "http://www.reiki.org/faq/WhatIsReiki.html", "passage_text": "A Brief Overview. Reiki is a Japanese technique for stress reduction and relaxation that also promotes healing. It is administered by laying on hands and is based on the idea that an unseen life force energy flows through us and is what causes us to be alive. If one's life force energy is low, then we are more likely to get sick or feel stress, and if it is high, we are more capable of being happy and healthy."}, {"url": "http://www.reiki.org/faq/WhatIsReiki.html", "passage_text": "While Reiki is not a religion, it is still important to live and act in a way that promotes harmony with others. Mikao Usui, the founder of the Reiki system of natural healing, recommended that one practice certain simple ethical ideals to promote peace and harmony, which are nearly universal across all cultures. It is administered by laying on hands and is based on the idea that an unseen life force energy flows through us and is what causes us to be alive. If one's life force energy is low, then we are more likely to get sick or feel stress, and if it is high, we are more capable of being happy and healthy."}, {"url": "http://healing.about.com/cs/reiki/a/reikiplex.htm", "passage_text": "Reiki (pronounced Ray Key) is a combination of two Japanese words rei and ki meaning universal life energy. Reiki is an ancient laying-on of hands healing technique that uses the life force energy to heal, balancing the subtle energies within our bodies. Reiki addresses physical, emotional, mental and spiritual imbalances. This healing art is an effective delivery system. Either way, Reiki energies flow where they are suppose to. Reiki is a smart energy that automatically flows where the imbalances are in your body regardless of where the practitioner's hands are placed. 1  Touch Therapy. 2  Reiki Testimonials. 3  Reiki Hand Placement Photos."}, {"url": "http://www.takingcharge.csh.umn.edu/explore-healing-practices/reiki", "passage_text": "Reiki is a spiritual, vibrational healing practice used to promote balance throughout the human system. Reiki does not involve physical manipulation or the ingestion or application of any substances, but works with the subtle vibrational field thought to surround and penetrate the body. "}, {"url": "http://reikiinmedicine.org/reiki-can-help-you/", "passage_text": "My life can be divided into “before Reiki” and “after Reiki.” Before Reiki I was consumed with anxiety, unable to experience joy, unable to meditate, so unable to cope with the stresses of work that I was always about to quit, unable to even be in the same room with my mother. "}, {"url": "http://www.livescience.com/40275-reiki.html", "passage_text": "View full size image. Reiki is a therapy often described as palm healing or hands-on-body healing in which a practitioner places hands lightly on or over a patient's body to facilitate the patient's process of healing. Reiki combines the Japanese and Chinese word-characters of rei (spiritual or supernatural) and ki (vital energy). One idea is that Reiki is perhaps related to electromagnetic-type energy, and that it interacts with a person's electromagnetic field.. Another theory is that Reiki promotes relaxation, which in turn lowers a patient's stress response and encourages healing, according to UMN's Center for Spirituality & Healing."}, {"url": "http://animalhealings.com/reiki-faq.html", "passage_text": "REIKI - (pronounced Ray-Key) is a gentle Japanese healing modality has roots in ancient Japanese for stress reduction and relaxation, and it is similar to the laying on of hands healing, but it can also be done as a distance healing too. it's used to promote healing and a sense of well being. In its simplest form, Reiki and animal Reiki is the use of hands with the positive intent to bring about healing and willing for Reiki energy to flow. A skilled Reiki practitioner can bring healing to a recipient regardless of distance."}, {"url": "http://www.hopkinsmedicine.org/integrative_medicine_digestive_center/services/reiki.html", "passage_text": "Reiki is a very specific form of energy healing, in which hands are placed just off the body or lightly touching the body, as in “laying on of hands.” Reiki can also be done “long-distance,” as a form of prayer. "}]