[{"url": "http://www.answers.com/Q/What_does_interquartile_range_mean", "passage_text": "The interquartile range is the upper quartile (75th percentile) minus (-) the lower percentile (75th percentile). The interquartile range uses 50% of the data. It is a measure of the central tendency just like the standard deviation. A small interquartile range means that most of the values lie close to each other. The Inter-quartile range is the range of the middle half of the data. It is the difference between the upper and lower quartile. Example: 35,80,100 110,120,120,170,180. Th … e Inter-quartile range would be 145-90 or 55 To find the interquartile range, you: 1) Arrange the data in numerical order."}, {"url": "http://www.abs.gov.au/websitedbs/a3121120.nsf/home/statistical+language+-+measures+of+spread", "passage_text": "10. 11. The interquartile range (IQR) is the difference between the upper (Q3) and lower (Q1) quartiles, and describes the middle 50% of values when ordered from lowest to highest. The IQR is often seen as a better measure of spread than the range as it is not affected by outliers. "}, {"url": "http://davidmlane.com/hyperstat/A48607.html", "passage_text": "Next section: Variance and Standard Deviation. The semi-interquartile range is a measure of spread or dispersion. It is computed as one half the difference between the 75th percentile [often called (Q3)] and the 25th percentile (Q1). The formula for semi-interquartile range is therefore: (Q3-Q1)/2. "}, {"url": "http://www.mathsteacher.com.au/year9/ch17_statistics/06_quartiles/quartiles.htm", "passage_text": "1 The median is the middle value of the data set. 2  The lower quartile (Q 1) is the median of the lower half of the data set. 3  The upper quartile (Q 3) is the median of the upper half of the data set. 4  The interquartile range (IQR) is the spread of the middle 50% of the data values. 1 The lower quartile (Q 1) is the median of the lower half of the data set. 2  The upper quartile (Q 3) is the median of the upper half of the data set. 3  The interquartile range (IQR) is the spread of the middle 50% of the data values. 4  So:"}, {"url": "http://study.com/academy/lesson/quartiles-the-interquartile-range-definition-formulate-examples.html", "passage_text": "The interquartile range is a value that is the difference between the upper quartile value and the lower quartile value. Coach Taylor can use the interquartile range to summarize the overall accuracy of his players. To find the quartiles of this data set use the following steps: 1  Order the data from least to greatest. To find the interquartile range, simply take the upper quartile and subtract the lower quartile: 7.5 - 2.5 = 5. The interquartile range for this data set is 5. That means that the majority of the group can make about five out of ten free throw shots."}, {"url": "https://en.wikipedia.org/wiki/Interquartile_range", "passage_text": "In descriptive statistics, the interquartile range (IQR), also called the midspread or middle fifty, is a measure of statistical dispersion, being equal to the difference between the upper and lower quartiles, IQR = Q 3 − Q 1. "}, {"url": "http://www.statcan.gc.ca/edu/power-pouvoir/ch12/5214890-eng.htm", "passage_text": "Interquartile range. The interquartile range is another range used as a measure of the spread. The difference between upper and lower quartiles (Q 3 –Q 1), which is called the interquartile range, also indicates the dispersion of a data set. The interquartile range spans 50% of a data set, and eliminates the influence of outliers because, in effect, the highest and lowest quarters are removed."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20061202052549AAz5x2s", "passage_text": "The interquartile range is a measure of the central tendency just like the standard deviation. Half the data points lie within the interquartile range (and that's true whether you have 20 measurements or 10,000). A small interquartile range means that the data are very consistent (most values lie close to each other)."}, {"url": "http://www.mathsteacher.com.au/year9/ch17_statistics/06_quartiles/quartiles.htm", "passage_text": "The interquartile range is a more useful measure of spread than the range as it describes the middle 50% of the data values. 1  The median is the middle value of the data set. 2  The lower quartile (Q 1) is the median of the lower half of the data set. 1 The lower quartile (Q 1) is the median of the lower half of the data set. 2  The upper quartile (Q 3) is the median of the upper half of the data set. 3  The interquartile range (IQR) is the spread of the middle 50% of the data values. 4  So:"}]