[{"url": "http://www.accountingtools.com/dictionary-financial-asset", "passage_text": "Definition: A financial asset is an asset whose value comes from a contractual claim. These assets are frequently traded. Financial assets include the following items:"}, {"url": "http://accountingforinvestments.com/definition-of-financial-assets-and-financial-liabilities/", "passage_text": "1 A contractual right. 2  To receive cash or another financial asset from another entity. 3  To exchange financial assets or financial liabilities with another entity under conditions that are potentially favorable to the entity. 4  A contract that will/may be settled in the entity’s own equity instruments and is."}, {"url": "http://www.ehow.com/info_7735584_financial-assets.html", "passage_text": "A financial asset is any asset that can be quickly converted to purchasing power. Some assets are more easily converted to purchasing power than others. These assets are called liquid, and to sell them to raise cash is to liquidate.."}, {"url": "http://www.investopedia.com/terms/f/financialasset.asp", "passage_text": "DEFINITION of 'Financial Asset'. An asset that derives value because of a contractual claim. Stocks, bonds, bank deposits, and the like are all examples of financial assets. Next Up."}, {"url": "https://en.wikipedia.org/wiki/Financial_asset", "passage_text": "From Wikipedia, the free encyclopedia. A financial asset is an intangible asset whose value is derived from a contractual claim, such as bank deposits, bonds, and stocks. Financial assets are usually more liquid than other tangible assets, such as commodities or real estate, and may be traded on financial markets."}, {"url": "https://en.wikipedia.org/wiki/Financial_asset", "passage_text": "A financial asset is an intangible asset whose value is derived from a contractual claim, such as bank deposits, bonds, and stocks. Financial assets are usually more liquid than other tangible assets, such as commodities or real estate, and may be traded on financial markets."}, {"url": "http://accountingforinvestments.com/definition-of-financial-assets-and-financial-liabilities/", "passage_text": "1 To receive cash or another financial asset from another entity. 2  To exchange financial assets or financial liabilities with another entity under conditions that are potentially favorable to the entity. 3  A contract that will/may be settled in the entity’s own equity instruments and is."}]