[{"url": "http://www.visitlondon.com/traveller-information/getting-around-london/congestion-charge", "passage_text": "How to Pay the Congestion Charge. You can pay online up to 90 days in advance, on the day of travel or by midnight the next charging day. As well as online, you can pay the Congestion Charge via CC Auto Pay, by telephone and even by text message once you've registered online. The Congestion Charge applies to most vehicles entering Central London. Make sure you know how it might affect your visit. London was the world's first major city to introduce a Congestion Charge to reduce the flow of traffic into and around the city centre. The Congestion Charge comes into effect on weekdays between certain times of the day and in various locations within Central London. You must pay the Congestion Charge to avoid receiving a fine of £130, but some drivers and vehicles are exempt or qualify for discounts"}, {"url": "https://www.theaa.com/motoring_advice/congestion_charging/", "passage_text": "If you don't pay the Congestion Charge within the time limit (before midnight the following charging day) you will receive a penalty charge notice of £130, reduced to £65 if paid within 14 days. Latest. From 16 June 2014, the daily Congestion Charge will go up from £10 to £11.50 (or £10.50 if paid using CC Auto Pay or £14 if paid the next charging day). A network of cameras reads vehicle numberplates as you enter, drive around and leave the zone."}, {"url": "https://en.wikipedia.org/wiki/London_congestion_charge", "passage_text": "The London congestion charge is a fee charged on most motor vehicles operating within the Congestion Charge Zone (CCZ) in Central London between 07:00 and 18:00 Mondays to Fridays. It is not charged on weekends, public holidays or between Christmas Day and New Year's Day (inclusive). "}, {"url": "https://tfl.gov.uk/modes/driving/congestion-charge/paying-the-congestion-charge", "passage_text": "You can pay in advance or on the day of travel. If you don't pay by midnight on the charging day after you drove in the zone, you'll get a Penalty Charge Notice (PCN). Paying the Congestion Charge. Not all drivers have to pay. Find out about discounts and exemptions. Congestion Charge Auto Pay (CCAP). This automated payment system will record the number of charging days a vehicle travels within the charging zone each month and bill your debit or credit card each month."}, {"url": "http://www.tfl.gov.uk/modes/driving/congestion-charge", "passage_text": "Congestion Charge. The Congestion Charge is an £11.50 daily charge for driving a vehicle within the charging zone between 07:00 and 18:00, Monday to Friday. The easiest way to pay the charge is by registering for Congestion Charge Auto Pay. There are a range of exemptions and discounts available to certain vehicles and individuals. "}, {"url": "https://tfl.gov.uk/modes/driving/congestion-charge/paying-the-congestion-charge", "passage_text": "Pay the charge in advance, on the day of travel or up to midnight the following charging day. The charge is £11.50 if you pay in advance or on the same day, or £14 if paid the following charging day. Outside of call centre hours, payments for travel on the day can be made online (up to midnight) at a charge of £11.50. Congestion Charge Auto Pay (CCAP). This automated payment system will record the number of charging days a vehicle travels within the charging zone each month and bill your debit or credit card each month."}, {"url": "http://www.toptiplondon.com/practical-tips/london-congestion-charge", "passage_text": "You can pay the Congestion Charge online with TfL. You don’t need to register or create a password but you do need to enter your vehicle registration number and the country of registration. Payment is made by credit or debit card. Only use the official Transport for London (TfL) website to pay the Congestion Charge. You can drive in and out of the zone as many times as you like between 7am–6pm Monday–Friday — you only pay one fee. If you leave your car in a car park in central London between 7am–6pm Monday–Friday, you don’t have to pay the congestion charge. The charge only applies when you actually drive in central London."}, {"url": "https://www.theaa.com/motoring_advice/congestion_charging/", "passage_text": "Tweet. Transport for London (TfL) impose a charge per weekday on most vehicles. Transport for London (TfL) impose a charge per weekday on most vehicles, being used in Central London. You pay for the charge for the day and can drive within the charging zone as often as you want within the day. Latest. From 16 June 2014, the daily Congestion Charge will go up from £10 to £11.50 (or £10.50 if paid using CC Auto Pay or £14 if paid the next charging day). A network of cameras reads vehicle numberplates as you enter, drive around and leave the zone."}, {"url": "https://tfl.gov.uk/modes/driving/congestion-charge/paying-the-congestion-charge", "passage_text": "You can pay the Congestion Charge in a number of ways. It's quickest and easiest if you register for CC Auto Pay. Congestion Charge Auto Pay is an automated payment system. We'll automatically record the number of charging days a vehicle travels within the charging zone each month and bill your debit or credit card each month. Congestion Charge Auto Pay (CCAP). This automated payment system will"}]