[{"url": "http://www.chooseresponsibility.org/legal_age_21/", "passage_text": "1 Twice as many 21 year olds as 18 year-olds were involved in alcohol-related traffic fatalities in that year. 2  Legal Age 21 has postponed fatalities-not reduced them-because every claim of an 18, 19, or 20 year-old life saved as a result of Legal Age 21 is offset by the number of 21, 22, or 23 year-old lives lost. 1 Legal Age 21 has postponed fatalities-not reduced them-because every claim of an 18, 19, or 20 year-old life saved as a result of Legal Age 21 is offset by the number of 21, 22, or 23 year-old lives lost. 2  The number of drunken driving fatalities tracks almost exactly, up or down, with the size of an age segment."}, {"url": "https://calisza.wordpress.com/2009/03/09/how-to-validate-date-of-birth-with-jquery/", "passage_text": "In a recent project I had to implement what’s commonly referred to as a Legal Drinking Age (LDA) page. Basically what needs to happen is that the user has to enter their date of birth and thus ‘confirm’ that they are of a legal drinking age for their respective country. You can view an example of just such a page here. So to do this we use “currdate.getFullYear() – age” . Once we have the date of 18 years ago and the user’s birth date, both in the same format, it’s simply a matter of making sure that the required date minus the birth date isn’t greater than 0."}, {"url": "http://www.alvingolf.com/age-calculator.html", "passage_text": "Drinking Age. Persons under 21 cannot purchase alcohol at Alvin Golf & Country Club or anywhere in the State of Texas. Use this age calculator and a valid ID to verify whether a person is legally old enough to purchase alcohol. Ask for a valid ID to determine a golfers legal drinking age and golf rate age. Alvin Golf & Country Club gives discounts to golfers age 60 and above and to golfers under age 18."}, {"url": "http://www.appszoom.com/android_applications/productivity/legal-drinking-age_cgxqi.html", "passage_text": "Description. Legal Drinking Age widget is a homescreen display of today’s required date of birth for current legal age of alcohol consumption. Also included is Legal Drinking Age Application that allows user to enter a date of birth to see a person’s age and if they are legally allowed to consume alcohol. Tags: legal drinking age calculator, legal drinking age today calculator, drinking age calculator, legal drinking age today, legal drinking age calendar, drinking age as of today, legal age to drink calculator, legal drinking age as of today, alcohol age calculator. Users review."}, {"url": "http://holidaysofyear.com/legal-drinking-age-day/", "passage_text": "Legal Drinking Age Day 2015 is on July 21, 2015. Study of the Day: Drinking Age of 21 Saves 1,200 Women a Year ... minimum legal drinking age. the legal drinking age is 21 because the brain is finally done growing and if you drink before then it damages your brain even more. The legal drinking age in Mexico is 18; however, asking for ID or denying purchase is extremely rare.Grocery stores sell everything from beer and wine to national and imported liquors."}, {"url": "http://news.uga.edu/releases/article/study-lower-legal-drinking-age-increases-poor-birth-outcomes/", "passage_text": "The researchers found that a drinking age of 18: 1  Increases prenatal alcohol consumption among 18- to 20-year-old women by 21 percent; 2  Increases the number of births to 18- to 20-year-olds by 4.6 percent in white women and 3.9 percent in 18- to 20-year-old African-American women; 1 Increases the likelihood of women under age 21 having a low-birth weight baby by 6 percent (4 percent for white women and 8 percent for African-American women); and. 2  Increases the likelihood of premature birth by 5 percent in white women under age 18 and by 7 percent in African-American women under age 18."}, {"url": "http://www.bu.edu/today/2014/pov-legal-drinking-age-of-21-works-deal-with-it/", "passage_text": "That’s the calculation that led the United States to have a national age-21 law. This came about in 1984, when President Reagan signed a law that incentivized states with a lower legal drinking age to go up to 21. Between 1982 and 2007, the rate of alcohol-related traffic fatalities for people ages 18 to 20 dropped 60 percent, whereas the rate for people ages 21 to 24 dropped only 44 percent. "}, {"url": "http://www.answers.com/Q/If_Born_on_what_year_to_be_legal_to_drink_today", "passage_text": "In the US, drinking age is 21 in all 50 states. 19 year olds are not permitted to purchase or consume alcohol (except in certain limited exceptions, such as church wine). Thei … r country of origin is irrelevant. When a person is in the US, he/she must abide by US laws, regardless of the laws in their home country. 21 is the legal drinking age in Utah and I think, now, every other state. Some states used to have 18/21 laws where you could buy beer at 18 and hard liquor at 21, but I … think everybody's at 21 for everything now. 3 people found this useful."}]