[{"url": "http://www.osr.nsw.gov.au/taxes/payroll/", "passage_text": "Payroll tax is applied to a business’s New South Wales (NSW) wages that exceed the payroll tax threshold. The payroll tax rate is 5.45%. "}, {"url": "https://en.wikipedia.org/wiki/Rossmore,_New_South_Wales", "passage_text": "Rossmore is a suburb of Sydney, in the state of New South Wales, Australia. It is bound to the east by Kemps Creek, the west by South Creek, the north by Fifteenth Avenue, and the south by Rileys Creek in the southwest and a non natural border from there. The main road through the centre of the suburb is Bringelly Road. "}, {"url": "https://en.wikipedia.org/wiki/New_South_Wales", "passage_text": "As Australia's most populous state, New South Wales is home to a number of cultural institutions of importance to the nation. In music, New South Wales is home to the Sydney Symphony Orchestra, Australia's busiest and largest orchestra. Australia's largest opera company, Opera Australia, is headquartered in Sydney. The form of the Government of New South Wales is prescribed in its Constitution, dating from 1856 and currently the Constitution Act 1902 (NSW). Since 1901 New South Wales has been a state of the Commonwealth of Australia, and the Australian Constitution regulates its relationship with the Commonwealth."}, {"url": "http://portlandnsw.com/", "passage_text": "PORTLAND NSW - The Town that built Sydney. Portland is only 2 1/2 hours from Sydney. It is an easy 40 minutes to Bathurst and 30 minutes from Lithgow. The town is of interest as an historic mining town and as the place of the first cement works in Australia, which was opened in 1902. "}, {"url": "http://www.whereis.com/nsw/sydney-2000", "passage_text": "Map of Sydney, NSW 2000. Sydney, with a population of over 4 million, and covering almost 1120 square kilometres, is a remarkably easy city to move around in. Most Sydney tourist attractions are either within the central business district, close to the CBD or at points around the harbour. The exceptions are Bondi and Manly-surf beach suburbs situated south and north of Sydney Heads. For visitors with limited time, perhaps take a walk around the wider CBD area, visit the Rocks or Darling Harbour or spend some time on the harbour."}, {"url": "https://en.wikipedia.org/wiki/St_Marys,_New_South_Wales", "passage_text": "St Marys is a suburb in western Sydney, in the state of New South Wales Australia. It is 45 kilometres west of the Sydney central business district, in the local government area of the City of Penrith. "}, {"url": "https://en.wikipedia.org/wiki/New_South_Wales", "passage_text": "New South Wales (abbreviated as NSW) is a state on the east coast of Australia. It borders Queensland to the north, Victoria to the south, South Australia to the west, the Tasman Sea to the east and surrounds the whole of the Australian Capital Territory. The form of the Government of New South Wales is prescribed in its Constitution, dating from 1856 and currently the Constitution Act 1902 (NSW). Since 1901 New South Wales has been a state of the Commonwealth of Australia, and the Australian Constitution regulates its relationship with the Commonwealth."}, {"url": "http://www.destinationnsw.com.au/", "passage_text": "Welcome to Destination NSW. Destination NSW is the lead government agency for the New South Wales (NSW) tourism and major events sectors. Sydney to Welcome New Daily Services from Qatar Airways 30 September 2015. Destination NSW will welcome a new daily service from Doha, Qatar from 1 March 2016, providing an additional 122,500 seats into Sydney each year."}, {"url": "https://en.wikipedia.org/wiki/New_South_Wales", "passage_text": "New South Wales is bordered on the north by Queensland, on the west by South Australia, on the south by Victoria and on the east by the Tasman Sea. The Australian Capital Territory and the Jervis Bay Territory form a separately administered entity that is bordered entirely by New South Wales. The form of the Government of New South Wales is prescribed in its Constitution, dating from 1856 and currently the Constitution Act 1902 (NSW). Since 1901 New South Wales has been a state of the Commonwealth of Australia, and the Australian Constitution regulates its relationship with the Commonwealth."}]