[{"url": "http://reference.medscape.com/drug/viberzi-eluxadoline-1000018", "passage_text": "Cautions. Eluxadoline is a mu opioid receptor agonist; because of this mechanism of action, the potential for increased risk of sphincter of Oddi spasm exists, resulting in pancreatitis or hepatic enzyme elevation associated with acute abdominal pain (see Contraindications). 1 Oral and SC administration of eluxadoline to rats and rabbits during organogenesis at doses approximately 51 and 115 times the human exposure after a single oral dose of 100 mg, respectively, demonstrated no teratogenic effects. 2  In a prenatal and postnatal development study in rats."}, {"url": "http://www.rxwiki.com/eluxadoline", "passage_text": "Updated: Eluxadoline is a prescription medication used to irritable bowel syndrome with diarrhea (IBS-D) in adults. Eluxadoline belongs to a group of drugs called mu-opioid receptor antaognists. The exact mechanism of eluxadoline in IBS-D is not known, but eluxadoline interacts with opioid receptors in the gut. This medication comes in tablet form and is taken 2 times a day with food. It is not known if eluxadoline crosses into human milk. Because many medications can cross into human milk and because of the possibility for serious adverse reactions in nursing infants with use of this medication, a choice should be made whether to stop nursing or stop the use of this medication."}, {"url": "http://pharmpractice.ku.edu/journal-club-digest/eluxadoline-use-ibs-d", "passage_text": "After at least 85 patients per arm had completed four weeks of therapy, each eluxadoline arm was evaluated for efficacy by an outside source. At this time, randomization to the 5 mg arm was discontinued due to lack of efficacy. New patients were then randomized (1:1:1:1) to the remaining eluxadoline arms or placebo. 8 IBS-D involves abnormally increased GI motility and secretions, leading to stool urgency and abdominal pain. 2 Altering the function of these opioid receptors may improve symptoms and help regulate colon function. 8 This article will discuss the use of eluxadoline in patients with IBS-D."}, {"url": "http://www.rxlist.com/viberzi-drug.htm", "passage_text": "DRUG DESCRIPTION. The active ingredient in VIBERZI is eluxadoline, a mu-opioid receptor agonist. The full chemical name is 5-[[[(2S)-2-amino-3-[4-(aminocarbonyl)-2,6-dimethylphenyl]-1- oxopropyl][(1S)-1-(4-phenyl-1H-imidazol-2-yl)ethyl]amino]methyl]-2-methoxybenzoic acid. (eluxadoline) Tablets"}, {"url": "http://www.rxlist.com/viberzi-drug/clinical-pharmacology.htm", "passage_text": "Eluxadoline is a mu-opioid receptor agonist; eluxadoline is also a delta opioid receptor antagonist and a kappa opioid receptor agonist. The binding affinities (Ki) of eluxadoline for the human mu and delta opioid receptors are 1.8 nM and 430 nM, respectively. The binding affinity (Ki) of eluxadoline for the human kappa opioid receptor has not been determined; however, the Ki for guinea pig cerebellum kappa opioid receptor is 55 nM. In animals, eluxadoline interacts with opioid receptors in the gut. Coadministration of a single dose of 100 mg VIBERZI with a single dose of 500 mg probenecid resulted in a 35% and 31% increase in eluxadoline AUC and Cmax, respectively, compared to administration of VIBERZI alone. This change in eluxadoline exposures is not expected to be clinically meaningful."}, {"url": "http://pharmpractice.ku.edu/journal-club-digest/eluxadoline-use-ibs-d", "passage_text": "A new medication, eluxadoline (MuDelta), is being investigated for the treatment of IBS-D unresolved by diet or OTC medications. This medication targets mu and delta opioid receptors in the GI tract, which are thought to influence proper GI motility, function, and secretion production. 8 IBS-D involves abnormally increased GI motility and secretions, leading to stool urgency and abdominal pain. 2 Altering the function of these opioid receptors may improve symptoms and help regulate colon function. 8 This article will discuss the use of eluxadoline in patients with IBS-D."}, {"url": "https://en.wikipedia.org/wiki/Eluxadoline", "passage_text": "(June 2015). Eluxadoline (INN, USAN) (brand name Viberzi; former developmental code name JNJ-27018966) is a novel, orally-active drug approved for the treatment of diarrhea and abdominal pain in individuals with diarrhea-predominant irritable bowel syndrome (IBS-D). Following a 100 mg dose of eluxadoline, the Cmax was about 2 to 4 ng/ml and AUC was 12-22 ng.h/ml. Eluxadoline has linear pharmacokinetics with no accumulation upon repeated twice daily dosing. Its plasma protein binding was 81% and its half life was 3.7 to 6 hours and it was excreted mainly in feces."}, {"url": "http://pharmpractice.ku.edu/journal-club-digest/eluxadoline-use-ibs-d", "passage_text": "Eluxadoline is currently under investigation for treatment of diarrhea and pain associated with IBS-D in patients uncontrolled by diet or OTC medications. Recently, two phase III clinical trials examined the safety and efficacy of eluxadoline in both female and male patients with IBS-D. 8 IBS-D involves abnormally increased GI motility and secretions, leading to stool urgency and abdominal pain. 2 Altering the function of these opioid receptors may improve symptoms and help regulate colon function. 8 This article will discuss the use of eluxadoline in"}, {"url": "https://en.wikipedia.org/wiki/Eluxadoline", "passage_text": "Eluxadoline is a μ- and κ-opioid receptor agonist and δ-opioid receptor antagonist that acts locally in the enteric nervous system, possibly decreasing adverse effects on the central nervous system. Following a 100 mg dose of eluxadoline, the Cmax was about 2 to 4 ng/ml and AUC was 12-22 ng.h/ml. Eluxadoline has linear pharmacokinetics with no accumulation upon repeated twice daily dosing. Its plasma protein binding was 81% and its half life was 3.7 to 6 hours and it was excreted mainly in feces."}]