[{"url": "http://www.ehow.com/facts_7695749_average-cost-build-porch.html", "passage_text": "Size. The size of your porch greatly affects its cost. A small, do-it-yourself porch costs $50 to $2,000, as of 2010, according to Cost Helper. Larger porches that require foundations start about $15,000. You will spend much less on a basic, concrete-slab porch vs. a larger, screened-in porch or sunroom. Prefabricated porches cost approximately $10,000 to $20,000, while a custom porch built by a contractor can cost $45,000, according to Cost Helper."}, {"url": "http://budgeting.thenest.com/average-cost-build-porch-22719.html", "passage_text": "The average cost to build a porch really depends on what type of porch you want. Costs can range from a couple hundred dollars for a slab of concrete and a rail, to $30,000 or more for a fully enclosed wrap-around porch. Your choice of materials and whether or not you hire a contractor also affect the price. A basic sun porch with a translucent roof that is 6-by-9 feet costs about $6,500. A prefabricated shade porch with a solid roof that is 15 feet wide and 24 feet long costs about $24,000. Shipping can cost anywhere between $650 to $1000, depending on the distance it is being shipped and the weight of the components."}, {"url": "http://costowl.com/home-improvement/deck-porch-building-cost.html", "passage_text": "1 The cost to build a 16’ x 20’ covered, enclosed porch is approximately $60 to $100 per square foot, or a total of around $16,000 to $32,000. 2  Larger porches generally cost less per square foot while smaller porches tend to cost more per square foot. 1 The cost of a porch could be anywhere from $5,000 for a simple structure or less to $75,000 or more for a sunroom or similar fully enclosed structure. 2 "}, {"url": "http://budgeting.thenest.com/average-cost-build-porch-22719.html", "passage_text": "The concrete alone for a porch this size will cost between $500 and $1,000, depending on what kind of deal you can get on the concrete. For example, you may be able to get them to deliver yours after a larger job. A basic sun porch with a translucent roof that is 6-by-9 feet costs about $6,500. A prefabricated shade porch with a solid roof that is 15 feet wide and 24 feet long costs about $24,000. Shipping can cost anywhere between $650 to $1000, depending on the distance it is being shipped and the weight of the components."}, {"url": "http://home.costhelper.com/porch.html", "passage_text": "1 Just the Redi-mix concrete delivered for a 50x20-foot porch slab could run $1,000-$2,000; hiring someone to install a 50x20-foot slab could be $3,000-$6,000 or more, depending on location and the complexity of the project. Shopping for a porch: 1  A covered porch needs to be at least 4 feet deep to protect both the house and doorway from the weather; at least 6 feet deep to allow people to sit comfortably on the porch; and at least 8-10 feet deep to accommodate a small table with four chairs or benches around it."}, {"url": "http://www.improvenet.com/r/costs-and-prices/screened-porch-price", "passage_text": "1 The total cost for a basic 200-square-foot screened-in porch will range from $766 to $1,025 or an average cost of $4.48 per square feet. 2  The cost of materials for a top-of-the-line screened-in porch on an existing deck runs between $860 and $1,070 with an installation cost between $297 and $304. 1 The cost of materials for a top-of-the-line screened-in porch on an existing deck runs between $860 and $1,070 with an installation cost between $297 and $304. 2  The total cost for a screened-in porch on a existing deck will be between $1,157 and $1,374 or an average cost of $6.33 per square feet"}, {"url": "http://home.costhelper.com/porch.html", "passage_text": "1 A screened porch or sunroom can run anywhere from $500-$1,500 for do-it-yourself materials for a simple project to $10,000-$70,000, depending on the complexity of the project and the location. Shopping for a porch: 1  A covered porch needs to be at least 4 feet deep to protect both the house and doorway from the weather; at least 6 feet deep to allow people to sit comfortably on the porch; and at least 8-10 feet deep to accommodate a small table with four chairs or benches around it."}, {"url": "http://www.fixr.com/costs/porch-addition", "passage_text": "1 According to Hanley Wood and their Remodeling magazine the average porch addition in which a completely covered and enclosed porch is added to the exterior of a home will cost $21,670. 2  The resale value of this update would hold at $18,181 or a nearly 84% return on investment. "}, {"url": "http://home.costhelper.com/porch.html", "passage_text": "1 Pre-built (modular) porch systems eliminate a lot of the complicated carpentry needed to build a wooden porch, and cost an average of $10,000-$20,000 with do-it-yourself installation plus the additional costs of any needed prep work (foundation, concrete slab). Shopping for a porch: 1  A covered porch needs to be at least 4 feet deep to protect both the house and doorway from the weather; at least 6 feet deep to allow people to sit comfortably on the porch; and at least 8-10 feet deep to accommodate a small table with four chairs or benches around it."}]