[{"url": "http://www.healthcare-salaries.com/physicians/medical-doctor-salary-md", "passage_text": "Based on years of work experience, medical doctors (doctors of medicine) earn different salaries in the United States. MDs with more than 5 years of practice experience earn an average yearly salary of around $155,861, whereas Medical doctors with 20+ years of practice experience earn around $174,000 per year."}, {"url": "http://money.usnews.com/careers/best-jobs/physician/salary", "passage_text": "Dentists, who made an average salary of $164,570 had the next highest salary. And pharmacists, by comparison, made approximately $116,500 in 2013. Registered nurses, who often work closely with doctors, made an average salary of $68,910 in 2013, or about $119,530 less than physicians."}, {"url": "http://www.indeed.com/salary/q-Doctor-l-United-States.html", "passage_text": "Average Doctor salaries for job postings in United States are the same as average Doctor salaries for job postings nationwide."}, {"url": "http://www1.salary.com/Physician-Generalist-salary.html", "passage_text": "For example the median expected annual pay for a typical Physician-Generalist in the United States is $186,321, so 50% of the people who perform the job of Physician-Generalist in the United States are expected to make less than $186,321."}, {"url": "http://www.healthcare-salaries.com/physicians/medical-doctor-salary-md", "passage_text": "Medical doctor salary and wage in USA. Based on the type of medical specialty, an average hourly wage for a medical doctor In the United States is as follows: The average hourly wage for a MD family physician ranges from between $39.73 – $81.03 per hour. The average hourly wage for a MD psychiatrist in the US is around $90 per hour."}, {"url": "http://www.healthcare-salaries.com/physicians/doctor-salary", "passage_text": "The other states also pay around the same doctor’s salary – Minnesota with $235,730; Maine with $235,620; South Dakota with $235,230; and New Hampshire with $224,940 per year. Based on PayScale, a doctor working in California earn an annual salary of $175,586."}, {"url": "http://www.healthcare-salaries.com/physicians/medical-doctor-salary-md", "passage_text": "Average Medical doctor salary in US. An average annual salary for a specialist MD in the United States is around $339,738; while an annual salary for an MD general practitioner is around $186,044 per annum. The average salaries for physicians possessing Doctor of Medicine (M.D.) degree depends on various determinants."}, {"url": "http://www.healthcare-salaries.com/physicians/doctor-salary", "passage_text": "The average doctor salary for those working in the office varies based on whether they are primary care physicians or medical specialists. According to PayScale, general practitioners earn around $125,568 a year, while family doctors make $150,321 as the lowest earning doctors."}]