[{"url": "http://americanhistory.about.com/od/johnfkennedy/p/pkennedy.htm", "passage_text": "John F. Kennedy's Childhood and Education: The first president born in the 20th century, Kennedy was born on May 29, 1917. He grew up in a wealthy family. He was sickly as a child and continued to have health problems the rest of his life. Two other important events during his term were the Alliance for Progress (the US provided aid to Latin America) and the problems in Southeast Asia. North Vietnam was sending troops through Laos to fight in South Vietnam. The South's leader, Diem, was ineffective."}, {"url": "http://www.answers.com/Q/What_was_the_most_significant_event_of_president_lyndon_Johnson%27s_term", "passage_text": "Share to: Andrew Johnson, the 17th President of the United States, took office the day President Lincoln died; he serving the remaining term: April 15, 1865 - March 4, 1869, and was not … elected for a second term. President Johnson's running mate in the 1964 election was Hubert H. Humphrey; and following their victory, Humphrey was sworn in as President Johnson's vice president on Inauguration Day, January 20, 1965."}, {"url": "https://en.wikipedia.org/wiki/Presidency_of_Bill_Clinton", "passage_text": "The United States Presidency of Bill Clinton, also known as the Clinton administration, was the executive branch of the federal government of the United States from January 20, 1993 to January 20, 2001. Clinton was the first Democratic president since Franklin D. Roosevelt to win two full terms. "}, {"url": "http://www.answers.com/Q/What_was_the_most_significant_event_of_president_lyndon_Johnson%27s_term", "passage_text": "Lyndon B. Johnson, the 36th President of the United States, took office the day President John F. Kennedy died, serving the remaining term: November 22, 1963-January 19, 1964. He was elected for a second term, which he served from January 20, 1964-January 19, 1969. 2 people found this useful. President Johnson's running mate in the 1964 election was Hubert H. Humphrey; and following their victory, Humphrey was sworn in as President Johnson's vice president on Inauguration Day, January 20, 1965."}, {"url": "http://www.history.com/topics/us-presidents/lyndon-b-johnson", "passage_text": "On January 20, 1965, Lyndon B. Johnson began his first elected term as president of the United States. In his inaugural address, Johnson calls for the nation to unite toward a common goal. A+E Networks. Lyndon B. Johnson (1908-73) became the 36th president of the United States following the November 1963 assassination of President John F. Kennedy (1917-1963)."}, {"url": "http://www.history.com/topics/us-presidents/lyndon-b-johnson", "passage_text": "Introduction. Lyndon B. Johnson (1908-73) became the 36th president of the United States following the November 1963 assassination of President John F. Kennedy (1917-1963). A+E Networks"}, {"url": "https://en.wikipedia.org/wiki/President_Kennedy", "passage_text": "John Fitzgerald  Jack  Kennedy (May 29, 1917 – November 22, 1963), commonly referred to by his initials JFK, was an American politician who served as the 35th President of the United States from January 1961 until his assassination in November 1963. Caroline Bouvier Kennedy was born in 1957 and is the only surviving member of JFK's immediate family. John Fitzgerald Kennedy, Jr. , nicknamed John-John by the press as a child, was born in late November 1960, 17 days after his father was elected."}, {"url": "https://quizlet.com/2190276/us-presidents-and-important-events-flash-cards/", "passage_text": "John Adams. (1797-1801) The 11th Amendment is added to the Constitution in 1798. Washington D.C. becomes America's official capitol in 1800., He was the second president of the United States and a Federalist. He was responsible for passing the Alien and Sedition Acts. Prevented all out war with France after the XYZ Affair. "}, {"url": "http://www.history.com/topics/us-presidents/john-f-kennedy", "passage_text": "Introduction. Elected in 1960 as the 35th president of the United States, 43-year-old John F. Kennedy became the youngest man and the first Roman Catholic to hold that office. In November’s election, Kennedy won by a narrow margin–less than 120,000 out of some 70 million votes cast–becoming the youngest man and the first Roman Catholic to be elected president of the United States."}, {"url": "http://millercenter.org/president/kennedy/key-events", "passage_text": "John F. Kennedy - 01/20/1961: John F. Kennedy is inaugurated as the thirty-fifth…. John F. Kennedy is inaugurated as the thirty-fifth President of the United States. January 20, 1961. John F. Kennedy - 04/12/1961: Soviet cosmonaut Yuri Gagarin becomes the first ma…. Soviet cosmonaut Yuri Gagarin becomes the first man in space. April 12, 1961. John F. Kennedy - 04/15/1961: A U.S.-sponsored invasion of Cuba at the Bay of Pi…. A U.S.-sponsored invasion of Cuba at the Bay of Pigs fails."}]