[{"url": "http://www.beautyhows.com/scars/atrophic-scar-atrophic-acne-scars-treatment/", "passage_text": "An atrophic scar is a collection of fibrous tissue that takes the form of a sunken recess in the skin which gives the skin a pitted appearance. Atrophic scarring is often associated with various dermal conditions including acne, chicken pox and MRSA infection. Surgical procedures and injury to the skin can as cause it."}, {"url": "http://www.livestrong.com/article/100908-atrophic-scar-treatment/", "passage_text": "An atrophic scar is one in which the healed surface of the skin is below the level of normal dermal tissue, creating a small pit. It is characterized by a soft, white appearance and is often a result of acne."}, {"url": "http://scarformula.com/atrophic-scars.php", "passage_text": "Atrophic scars usually occur after a severe and chronic injury to the skin. This is usually due to permanent loss of collagen fibers of the skin in the area where there has been an injury."}, {"url": "http://www.scarremoval.org/keloid-hypertrophic/", "passage_text": "Atrophic Scars. Atrophic scars are those that leave a pit or depression in the skin. They occur when the injury to the skin has caused a loss of dermal tissue and the healing process does not produce enough collagen to replace the lost tissue. Atrophic scars are a common side effect of acne and other skin diseases."}, {"url": "http://www.scarsremovals.com/atrophic-scars.html", "passage_text": "Remove Atrophic Scar. Atrophic scars first of all are deep scars that can be seen as depressed areas of the skin. There is a significant loss of skin tissue and it is often due to acne scars that are deep. Removing atrophic scars could be difficult and may need the help of a skin specialist to do so."}, {"url": "http://www.livestrong.com/article/100908-atrophic-scar-treatment/", "passage_text": "Atrophic scars form whenever the skin produces insufficient collagen, or connective tissue, to heal the site of an infection. The result is a pitted scar similar in structure to the surface of a golf ball."}, {"url": "http://scarformula.com/atrophic-scars.php", "passage_text": "Atrophic scars can also lead to loss of skin pigmentation. Atrophic scarring is often an unfortunate and permanent complication of severe acne (acne vulgaris). Facial scars are emotionally and psychologically distressing and can result in poor self esteem, depression and anxiety."}, {"url": "http://scarformula.com/atrophic-scars.php", "passage_text": "ATROPHIC SCARS : Aggressive treatment of acne can often result in proper healing of the skin, thereby preventing scarring. Once a scar forms, it is often permanent and challenging to treat."}]