[{"url": "http://www.garageplans.co.uk/contents/en-uk/d36_faq_garage_sizes.html", "passage_text": "The average size of a single garage is 3 m wide and 6 m long. This is a metre longer than the minimum (see below) and allows for storage at the end of the garage. Sounds obvious but that's the short answer, the size of popular UK cars can be found at car sizes. I would recommend that a minimum size of a garage should be 3 m wide and 5 m long internally. Now for the long answer, there are no minimum sizes for garages."}, {"url": "http://www.garageplans.co.uk/contents/en-uk/d36_faq_garage_sizes.html", "passage_text": "300 mm passengers side allowance plus 1.8 m car plus 800 mm door plus 1.8 m car plus 800 mm door gives a minimum width of 5.5 m. The diagram on the left shows the standard 6 m x 6 m double garage, this size of garage allows additional space around the cars for people to have access. Sounds obvious but that's the short answer, the size of popular UK cars can be found at car sizes. I would recommend that a minimum size of a garage should be 3 m wide and 5 m long internally. Now for the long answer, there are no minimum sizes for garages."}, {"url": "http://www.landscapingnetwork.com/driveways/width.html", "passage_text": "Single car driveways can be as narrow as 9 feet, or as wide as 12 feet. A 9 foot driveway is quite tight and may have difficulty accommodating larger vehicles such as delivery or trash trucks. Additionally, 9 feet may mean that guests are stepping in grass or dirt as they exit their vehicles. The average dimensions for single and double car driveways. 1  The width of this driveway changes to create a unique, wavy edge. 2  AMS Landscape Design Studios in Newport Beach, CA. 3  Because of the retaining walls along its edges, this driveway was made extra wide so it wouldn't feel crowded or tight."}, {"url": "http://www.drivewaytips.com/layout.html", "passage_text": "A single car driveway width should be 10' wide, anything less. than 10 feet will be too narrow to drive or park on comfortably. 12' is often used for added comfort and assuring to get out of your vehicle without stepping on the lawn or landscape. "}, {"url": "http://www.williespaving.com/how-wide-should-my-driveway-be/", "passage_text": "When it comes to parking pads: We figure on 10 feet width per car. And 20 feet in length per car. If you desire for your cars to be parked side by side, a double wide parking pad measuring 20 feet wide is appropriate. However, paying attention to the length of the driveway or parking area is important too. If you have a mid-size car to pickup truck a 10 foot wide driveway would be the norm. For campers, trailers or bigger pickup trucks we would go to 12 feet in width."}, {"url": "http://www.answers.com/Q/What_are_average_car_dimensions", "passage_text": "In Building and Carpentry. There aren't any standard dimensions for a 1.5 car garage, but a  one-car garage is less than 300 square feet. A two-car garage is  usually just over 600 square feet, so a 1 … .5 car garage would be  somewhere in between the two measurements. 1 person found this useful."}, {"url": "http://www.garageplans.co.uk/contents/en-uk/d36_faq_garage_sizes.html", "passage_text": "With the average width of cars being 1.8 m and an allowance of 800 mm for the door access and a clearance of 300 mm on the passenger's side, then a minimum width of 2.9 m is needed. Sounds obvious but that's the short answer, the size of popular UK cars can be found at car sizes. I would recommend that a minimum size of a garage should be 3 m wide and 5 m long internally. Now for the long answer, there are no minimum sizes for garages."}, {"url": "http://www.williespaving.com/how-wide-should-my-driveway-be/", "passage_text": "10-12 Feet In Width Is Normal. If you are starting from scratch such as with nothing or a stone base we would go with 10 -12 feet wide. If you have a mid-size car to pickup truck a 10 foot wide driveway would be the norm. For campers, trailers or bigger pickup trucks we would go to 12 feet in width."}, {"url": "http://www.garageplans.co.uk/contents/en-uk/d36_faq_garage_sizes.html", "passage_text": "A smart car can fit into a garage that is only 2.6 m long yet a Jaguar XJ8 LWB needs at least twice as much 5.3 m. 95% of UK cars are shorter than 5 m long. The width of the garage should allow for the car door to open on the driver's side and a clearance space on the passenger's side. Sounds obvious but that's the short answer, the size of popular UK cars can be found at car sizes. I would recommend that a minimum size of a garage should be 3 m wide and 5 m long internally. Now for the long answer, there are no minimum sizes for garages."}, {"url": "http://www.dailymail.co.uk/news/article-2103592/How-Britains-favourite-cars-outgrown-parking-bays-average-vehicle-2in-wider-space.html", "passage_text": "For the average British car is 2in wider than the Department for Transport's minimum width for a parking bay. Research shows the most popular British cars have increased in width by around 16 per cent in the past 40 years as drivers demand more space and better safety standards. British cars are now on average 2in wider than the Department for Transport's minimum width for a parking bay-meaning many just don't fit. The Ford Escort, for example, one of the most popular medium-sized family cars in the UK, was just 5ft 2in wide when it was launched in 1968"}]