[{"url": "http://umm.edu/health/medical/ency/articles/stem-cell-research", "passage_text": "Definition. A stem cell is a generic cell that can make exact copies of itself indefinitely. A stem cell has the ability to make specialized cells for various tissues in the body, such as heart muscle, brain tissue, and liver tissue. Stem cells can be saved and used later to make specialized cells, when needed."}, {"url": "http://www.mayoclinic.org/tests-procedures/stem-cell-transplant/in-depth/stem-cells/ART-20048117", "passage_text": "Stem cells are the body's raw materials — cells from which all other cells with specialized functions are generated. Under the right conditions in the body or a laboratory, stem cells divide to form more cells called daughter cells."}, {"url": "http://www.mayoclinic.org/tests-procedures/stem-cell-transplant/in-depth/stem-cells/ART-20048117", "passage_text": "These stem cells come from embryos that are three to five days old. At this stage, an embryo is called a blastocyst and has about 150 cells. These are pluripotent (ploo-RIP-uh-tunt) stem cells, meaning they can divide into more stem cells or can become any type of cell in the body."}, {"url": "http://www.mayoclinic.org/tests-procedures/stem-cell-transplant/in-depth/stem-cells/ART-20048117?pg=2", "passage_text": "Researchers grow stem cells in a lab. These stem cells are manipulated to specialize into specific types of cells, such as heart muscle cells, blood cells or nerve cells. The specialized cells can then be implanted into a person."}, {"url": "http://www.mayoclinic.org/tests-procedures/stem-cell-transplant/in-depth/stem-cells/ART-20048117", "passage_text": "You've heard about stem cells in the news, and perhaps you've wondered if they might help you or a loved one with a serious disease. You may wonder what stem cells are, how they're being used to treat disease and injury, and why they're the subject of such vigorous debate."}, {"url": "http://rwjms.rutgers.edu/scinj/faq/", "passage_text": "Stem cells have the unique capacity to develop into many different cell types in the body, producing muscles, nerves, blood cells, or other tissues. They also exhibit the remarkable ability to self-renew. GSBS website. Stem cells are precursors to an entire family of cells (referred to as a lineage)."}, {"url": "http://stemcells.nih.gov/info/basics/", "passage_text": "Stem Cell Basics. This primer on stem cells is intended for anyone who wishes to learn more about the biological properties of stem cells, the important questions about stem cells that are the focus of scientific research, and the potential use of stem cells in research and in treating disease."}, {"url": "http://www.mayoclinic.org/tests-procedures/stem-cell-transplant/in-depth/stem-cells/ART-20048117?pg=2", "passage_text": "Cells in a stem cell line keep growing but don't differentiate into specialized cells. Ideally, they remain free of genetic defects and continue to create more stem cells. Clusters of cells can be taken from a stem cell line and frozen for storage or shared with other researchers."}]