[{"url": "http://www.miamisci.org/youth/unity/Unity1/Jasmine/pages/habitats%20of%20the%20tigers.html", "passage_text": "Distribution of the Tiger. Ever wonder where Tigers live! Well... Most Tigers live in Asia, specifically throughout Southeast Asia, China, Korea and Russia. Tigers like to live in swamps, grasslands,and rain forests. Usually where Tigers live there are trees, bushes, and clumps of tall grass. "}, {"url": "http://www.livescience.com/27441-tigers.html", "passage_text": "Habitat. Tigers live in Asia. Larger subspecies, such as the Siberian tiger, tend to live in northern, colder areas, such as eastern Russia and northeastern China. Smaller subspecies live in southern, warmer countries, such as India, Bangladesh, Nepal, Bhutan, Myanmar, Laos, Cambodia, Vietnam, Malaysia and Indonesia. Diet. All tigers are carnivores. Most of a tiger's diet consists of large prey, such as pigs, deer, rhinos or elephant calves. To kill their prey, tigers will clamp down on the animal's neck with their jaws and suffocate the animal."}, {"url": "http://www.answers.com/Q/Where_do_tigers_live", "passage_text": "Siberian tigers live in eastern Russia, Indochinese tigers and Malayan tigers live in southeastern Asia, Bengal tigers live in India, the South China tiger (from southern China), and Sumatran tigers which live on the Indonesian island of Sumatra, southeast of mainland Asia. There are also Bengal tigers, which live in India, the South China tigers, Indochinese and Malayan tigers, which live in southeast Asia, and Sumatran tigers, which live in Sumatra (an island in Indonesia, southeast of the Asian mainland)."}, {"url": "http://www.answers.com/Q/Where_do_tigers_live", "passage_text": "tigers live in jungles in Asian countries such as India, Russia and china. They live in throughout eastern Asia in Bangladesh, Bhutan, China, India, Nepal, Cambodia, Laos, Malaysia, Myanmar, Thailand and Vietnam, and Indonesia (Sumatra), a tigers habitat is the forest and the wild. Jungles,grasslands and forests are the habitats of a tiger. There are also Bengal tigers, which live in India, the South China tigers, Indochinese and Malayan tigers, which live in southeast Asia, and Sumatran tigers, which live in Sumatra (an island in Indonesia, southeast of the Asian mainland)."}, {"url": "http://www.answers.com/Q/Where_do_tigers_live", "passage_text": "There are several subspecies of tiger, but most live in Asia. In northern Asia, there is the Siberian tiger, which currently only lives in eastern Russia, although its range u … sed to include much of central Asia, all the way to the Caspian Mountains. There are also Bengal tigers, which live in India, the South China tigers, Indochinese and Malayan tigers, which live in southeast Asia, and Sumatran tigers, which live in Sumatra (an island in Indonesia, southeast of the Asian mainland)."}, {"url": "http://nationalzoo.si.edu/Animals/GreatCats/tigerfacts.cfm", "passage_text": "Tigers can live to 20 years of age in zoos but only 15 years in the wild. And most wild tigers do not live that long. Only half of all cubs survive to independence from their mother at about two years of age. Only 40 percent of these survivors live to establish a territory and begin to produce young. "}, {"url": "https://en.wikipedia.org/wiki/Tiger", "passage_text": "The tiger (Panthera tigris) is the largest cat species, reaching a total body length of up to 3.38 m (11.1 ft) over curves and exceptionally weighing up to 388.7 kg (857 lb) in the wild. "}, {"url": "http://wanttoknowit.com/where-do-tigers-live/", "passage_text": "Tigers are a large species of the cat family with 9 different subspecies. All tiger species can be identified by their stripy coats of fur and feline like features. They are the national animal of many Asian countries and are recognized as strong, mighty creatures. A Tiger’s Habitat. All species of Tiger prefer habitat were they have plenty of camouflage from trees and shrubs, there is abundant prey for the tigers to hunt and there is a plentiful source of fresh water. However, the different species of tigers can all live in many different habitats. These include…. 1  Forests."}, {"url": "http://animals.nationalgeographic.com/animals/mammals/siberian-tiger/", "passage_text": "Siberian Tiger Range. Siberian (or Amur) tigers are the world's largest cats. They live primarily in eastern Russia's birch forests, though some exist in China and North Korea. There are an estimated 400 to 500 Siberian tigers living in the wild, and recent studies suggest that these numbers are stable. "}]