[{"url": "http://www.simplyhired.com/salaries-k-entry-level-structural-engineer-jobs.html", "passage_text": "Average Entry Level Structural Engineer Salaries. The average salary for entry level structural engineer jobs is $54,000. Average entry level structural engineer salaries can vary greatly due to company, location, industry, experience and benefits. The average salary for entry level structural engineer jobs is $54,000"}, {"url": "http://www.payscale.com/research/US/Job=Structural_Engineer/Salary", "passage_text": "Structural Engineers in the United States can expect to earn an average of $65K per year. Compensation ranges from $50K on the lower end to $96K per year on the higher end. The average worker who claims fewer than five years of experience earns around $60K. In contrast, however, individuals who report five to 10 years in this occupation see a much larger median of $72K. After working for 10 to 20 years, Structural Engineers make a median salary of $84K. More than 20 years of experience seem related to solid financial gains; veterans in this group report earning a median of $100K"}, {"url": "http://www1.salary.com/Structural-Engineer-I-salary.html", "passage_text": "For example the median expected annual pay for a typical Structural Engineer I in the United States is $59,027, so 50% of the people who perform the job of Structural Engineer I in the United States are expected to make less than $59,027. Source: HR Reported data as of October 2015. 1  Salary. 2  Salary + Bonus. 3  Benefits. "}, {"url": "http://www.indeed.com/salary/q-Structural-Engineer-l-United-States.html", "passage_text": "Average Structural Engineer salaries for job postings in United States are the same as average Structural Engineer salaries for job postings nationwide. "}, {"url": "http://www.engineersalary.com/Civil-Engineer-Salary.asp", "passage_text": "Civil engineer salary range for the middle 50% is between $57,330 and $90,160. Civil engineer salaries for the lowest 10% are less than $45,780. Civil engineer salaries for the highest 10% are more than $110,890. Civil engineer salary in the private sector is an average of 8% higher than in government/public institutions. Civil engineer starting salary for BS degrees averages $49,540. New MS graduates have an average starting salary of $59,880; and new PhDs have an average starting salary of $65,470. "}, {"url": "http://www.payscale.com/research/US/Job=Structural_Engineer/Salary", "passage_text": "Pay Difference by Location. For Structural Engineers, busy Houston offers a higher-than-average pay rate, 21 percent above the national average. Structural Engineers will also find cushy salaries in Seattle (+13 percent), Washington (+13 percent), Los Angeles (+10 percent), and San Francisco (+6 percent). Portland is home to the smallest salaries in the field, lagging the national average by 5 percent. The average worker who claims fewer than five years of experience earns around $60K. In contrast, however, individuals who report five to 10 years in this occupation see a much larger median of $72K. After working for 10 to 20 years, Structural Engineers make a median salary of $84K. More than 20 years of experience seem related to solid financial gains; veterans in this group report earning a median of $100K"}, {"url": "http://www.payscale.com/research/CA/Job=Structural_Engineer/Salary", "passage_text": "A Structural Engineer earns an average salary of C$66,723 per year. Most people with this job move on to other positions after 20 years in this field. X Total Pay combines base annual salary or hourly wage, bonuses, profit sharing, tips, commissions, overtime pay and other forms of cash earnings, as applicable for this job. It does not include equity (stock) compensation, cash value of retirement benefits, or the value of other non-cash benefits (e.g. healthcare)."}, {"url": "http://www.simplyhired.com/salaries-k-structural-engineer-jobs.html", "passage_text": "The average salary for structural engineer jobs is $66,000. Average structural engineer salaries can vary greatly due to company, location, industry, experience and benefits. This salary was calculated using the average salary for all jobs with the term structural engineer anywhere in the job listing."}]