[{"url": "http://www.differencebetween.net/science/difference-between-dna-and-rna/", "passage_text": "RNA is a nucleic acid consisting long chain of nucleotide units. Like the DNA molecule, every nucleotide consists of a nitrogenous base, sugar and phosphates. RNA is created by a process known as Transcribing, which involves the following 4 steps: 1  DNA “unzips” as the bonds break. 2  The free nucleotides lead to the RNA pair up with the complementary bases."}, {"url": "http://chemistry.about.com/od/lecturenoteslab1/a/Dna-Versus-Rna.htm", "passage_text": "1 The only difference between ribose and deoxyribose is that ribose has one more-OH group than deoxyribose, which has-H attached to the second (2') carbon in the ring. 2  DNA is a double stranded molecule while RNA is a single stranded molecule. 3  DNA is stable under alkaline conditions while RNA is not stable."}, {"url": "http://www.saylor.org/site/wp-content/uploads/2010/11/BIO101-DNA-vs-RNA.pdf", "passage_text": "One of the major differences between DNA and RNA is the sugar, with 2-deoxyribose being replaced by the alternative pentose sugar ribose in RNA. The four bases found in DNA are adenine (abbreviated A), cytosine (C), guanine (G) and thymine (T)."}, {"url": "http://www.enotes.com/homework-help/what-similarities-differences-between-dna-rna-65255", "passage_text": "Both DNA and RNA are composed of repeating units of nucleotides. Each nucleotide consists of a sugar, a phosphate and a nucleic acid base. The sugar in DNA is deoxyribose. The sugar in RNA is ribose, the same as deoxyribose but with one more OH (oxygen-hydrogen atom combination called a hydroxyl)."}, {"url": "https://en.wikibooks.org/wiki/Structural_Biochemistry/Nucleic_Acid/Difference_between_DNA_and_RNA", "passage_text": "DNA is a double-stranded molecule with a long chain of nucleotides while RNA is single-stranded molecule, in most of its biological roles and has a shorter chain of nucleotides (after transcription and splicing, only exons remain in RNA)."}, {"url": "http://chemistry.about.com/od/lecturenoteslab1/a/Dna-Versus-Rna.htm", "passage_text": "1 DNA contains the sugar deoxyribose, while RNA contains the sugar ribose. 2  The only difference between ribose and deoxyribose is that ribose has one more-OH group than deoxyribose, which has-H attached to the second (2') carbon in the ring."}, {"url": "http://www.brighthub.com/science/genetics/articles/24064.aspx", "passage_text": "Nucleotides have a double-bonded oxygen at the first carbon that can bond with a nitrogenous base. The third carbon of the base is what bonds with the nucleotide. The hydroxyl (OH) at carbon two is what makes the difference between a ribose (in RNA) and a deoxyribose (in DNA). The fifth carbon bonds with the phosphate. Nucleotides are also important for metabolism as well as the maintenance and enhancement of cellular immunity."}]