[{"url": "http://www.bodybuilding.com/fun/creatine_101.htm", "passage_text": "Creatine is a substance that is naturally found in our bodies. Over 90% of the creatine in the human body is found in muscle. Bodybuilders consider creatine a necessity for getting results. Creatine monohydrate is the most cost-effective dietary supplement in terms of muscle mass and strength gains. Creatine can help support protein synthesis, which helps muscles grow. Creatine supplementation has been studied for over 80 years-broad use of this substance has only gained popularity in the past decade. A new course is available at Weik University on creatine monohydrate. Those interested in sitting through an easy course, no need to look any further because class has just begun. Everyone is guaranteed an A for the course as long as you sit through the course and pay attention (you can take notes if you wish)."}, {"url": "http://www.webmd.com/men/creatine", "passage_text": "Creatine is a natural substance that turns into creatine phosphate in the body. Creatine phosphate helps make a substance called adenosine triphosphate (ATP). ATP provides the energy for muscle contractions. The body produces some of the creatine it uses. It also comes from protein-rich foods such as meat or fish. "}, {"url": "http://www.youtube.com/watch?v=BR3dDO1Sz0E", "passage_text": "http://www.axislabs.net/pure-microniz... Creatine is a natural compound made in the body and is derived from the diet through meat products. In the body, Creatine is changed into a molecule called phosphocreatine which serves as a storage reservoir for regenerating ATP. ATP is the chemical source of energy for muscle contraction and quick energy. "}, {"url": "https://www.muscleandstrength.com/expert-guides/creatine-monohydrate", "passage_text": "Creatine Monohydrate is one of the most popular supplements used by people looking to build lean muscle mass, maximize performance and increase strength. According to survey data, over 40% of National Collegiate Athletic Association (NCAA) athletes reported that they have used creatine. Everything you want to know about creatine monohydrate: what it is, how to use it, is it right for you, what benefits come with creatine monohydrate supplementation, and more."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-873-CREATINE.aspx?activeIngredientId=873&activeIngredientName=CREATINE", "passage_text": "1 Also, creatine does not seem to increase endurance or improve performance in highly trained athletes. 2  There is some evidence that creatine “loading,” using 20 grams daily for 5 days, may be more effective than continuous use. Kidney disease or diabetes: Do not use creatine if you have kidney disease or a disease such as diabetes that increases your chance of developing kidney disease. There is some concern that creatine might make kidney disease worse."}, {"url": "http://www.muscletalk.co.uk/articles/article-creatine.aspx", "passage_text": "Creatine is one of the most popular sports supplements on the market and is used by bodybuilders, athletes, sportsmen and women alike. Creatine is a compound made naturally in our bodies as an energy replenisher. It is manufactured in the liver, kidneys and pancreas and secreted into blood for transport to muscle (amongst other) tissues. Its chemical name is methylguanido-acetic acid, formed from the amino acids arginine, methionine and glycine. "}, {"url": "https://en.wikipedia.org/wiki/Creatine", "passage_text": "For the use of creatine to increase athletic performance, see Creatine supplements. Not to be confused with creatinine. Creatine (/ˈkriːətiːn/ or /ˈkriːətɪn/) is a nitrogenous organic acid that occurs naturally in vertebrates and helps to supply energy to all cells in the body, primarily muscle. This is achieved by increasing the formation of adenosine triphosphate (ATP)"}, {"url": "https://www.muscleandstrength.com/expert-guides/creatine-monohydrate", "passage_text": "Creatine monohydrate is a natural substance that turns into creatine phosphate in the body. Creatine phosphate helps make a substance called adenosine triphosphate (ATP). ATP provides the energy for muscle contractions. Everything you want to know about creatine monohydrate: what it is, how to use it, is it right for you, what benefits come with creatine monohydrate supplementation, and more."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-873-CREATINE.aspx?activeIngredientId=873&activeIngredientName=CREATINE", "passage_text": "1 Creatine does not seem to improve performance in aerobic exercises, or benefit older people. 2  Also, creatine does not seem to increase endurance or improve performance in highly trained athletes. 3  There is some evidence that creatine “loading,” using 20 grams daily for 5 days, may be more effective than continuous use. Kidney disease or diabetes: Do not use creatine if you have kidney disease or a disease such as diabetes that increases your chance of developing kidney disease. There is some concern that creatine might make kidney disease worse."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-873-CREATINE.aspx?activeIngredientId=873&activeIngredientName=CREATINE", "passage_text": "Creatine is a chemical that is normally found in the body, mostly in muscles. It is made by the body and can also be obtained from certain foods. Fish and meats are good sources of creatine. Creatine can also be made in the laboratory. Kidney disease or diabetes: Do not use creatine if you have kidney disease or a disease such as diabetes that increases your chance of developing kidney disease. There is some concern that creatine might make kidney disease worse."}]