[{"url": "http://www.biologyexams4u.com/2013/04/steps-involved-in-dna-replication-in.html", "passage_text": "Step 3: The enzyme DNA primase (primase, an RNA polymerase) then attaches to the DNA and synthesises a short RNA primer to initiate synthesis of the leading strand of the first replication fork. II. Elongation. Step 4: DNA polymerase III extends the RNA primer made by primase."}, {"url": "https://www.ndsu.edu/pubweb/~mcclean/plsc431/eukarychrom/eukaryo2.htm", "passage_text": "The second two activities of DNA Pol I are important for replication, but DNA Polymerase III (Pol III) is the enzyme that performs the 5'-3' polymerase function. 1  Primase-The requirement for a free 3' hydroxyl group is fulfilled by the RNA primers that are synthesized at the initiation sites by these enzymes."}, {"url": "http://www.answers.com/Q/3_enzymes_involved_in_DNA_replication", "passage_text": "More than two enzymes are involved, but the main ones are DNA Polymerases (Pol III and Pol I in Prokaryotes, Pol α, Pol δ and Pol ε in Eukaryotes). In vitro you can achieve … replication with only taq polymerase and two primers."}, {"url": "https://www.ndsu.edu/pubweb/~mcclean/plsc431/eukarychrom/eukaryo2.htm", "passage_text": "In addition to these proteins, several other enzymes are involved in bacterial DNA replication. 1  DNA Polymerase-DNA Polymerase I (Pol I) was the first enzyme discovered with polymerase activity, and it is the best characterized enzyme. 2  5' to 3' elongation (polymerase activity). 3  3' to 5' exonuclease (proof-reading activity). 4  5' to 3' exonuclease ...."}, {"url": "http://www.answers.com/Q/What_are_the_three_enzymes_in_DNA_replication", "passage_text": "The main enzymes involved in DNA replication are: Helicase: unwinds the double helix into two strands Polymerase: adds nucleotides to an existing strand Ligase: brings togeth … er the Okazaki fragments Topoisomerase: cuts and rejoins the helix RNA primase: catalyzes the synthesis of RNA primers Hope this helps!"}, {"url": "http://www.answers.com/Q/What_are_the_three_enzymes_in_DNA_replication", "passage_text": "The enzyme that catalyzes DNA replication is known as DNA  polymerase. Helicase is another enzyme that is used in the process  of DNA replication."}, {"url": "https://www.ndsu.edu/pubweb/~mcclean/plsc431/eukarychrom/eukaryo2.htm", "passage_text": "Proteins of DNA Replication. 1  DNA Helicases-These proteins bind to the double stranded DNA and stimulate the separation of the two strands. 2  DNA single-stranded binding proteins-These proteins bind to the DNA as a tetramer and stabilize the single-stranded structure that is generated by the action of the helicases."}, {"url": "http://www.austincc.edu/emeyerth/dnarep.htm", "passage_text": "DNA replicates by the semiconservative model of replication. This model states that during replication of double stranded DNA, the two strands separate and each separate strand is then used as a template to make a new strand."}, {"url": "http://www.atdbio.com/content/14/Transcription-Translation-and-Replication", "passage_text": "Transcription is the process by which DNA is copied (transcribed) to mRNA, which carries the information needed for protein synthesis. Transcription takes place in two broad steps. First, pre-messenger RNA is formed, with the involvement of RNA polymerase enzymes."}]