[{"url": "http://anovaculinary.com/what-is-sous-vide/", "passage_text": "To cook sous vide, first prepare your food of choice — it can be anything from a steak or a chicken breast to corn on the cob — then place it in a plastic vacuum-sealed or zipper lock bag. Attach your immersion circulator to a pot of water and set the desired time and temperature."}, {"url": "https://www.vacmasterfresh.com/sous-vide/what-is-sous-vide/", "passage_text": "Sous vide is a unique process of cooking, the food must be packaged in a vacuum sealed bag, and then cooked at a low and consistent temperature in a water bath. The process started in France and has been growing in popularity; used by chefs on “Top Chef” and “The Taste”, as well as restaurants all over."}, {"url": "https://www.chefsteps.com/activities/what-is-sous-vide", "passage_text": "What is sous vide? It’s the easiest, most consistent way to get delicious results in the kitchen, from succulent steaks to flavor-packed veggies and fork-tender salmon. To prepare food sous vide (say: sue veed), we pick our desired doneness, then set a water bath to the appropriate time-and-temperature settings."}, {"url": "http://www.sousvidesupreme.com/en-us/sousvide101.htm", "passage_text": "The term sous vide (pronounced soo–veed) is a French term, meaning under vacuum. Sous vide is a culinary technique in which vacuum-sealed food is immersed in a water bath and cooked at a very precise, consistent temperature. This cooking technique typically involves cooking food for longer periods of time at a lower"}, {"url": "http://www.sousvidesupreme.com/en-us/sousvide101.htm", "passage_text": "The term s ous vide (pronounced soo–veed) is a French term, meaning under vacuum. Sous vide is a culinary technique in which vacuum-sealed food is immersed in a water bath and cooked at a very precise, consistent temperature. This cooking technique typically involves cooking food for longer periods of time at a lower"}, {"url": "http://www.cuisinesolutions.com/about-sous-vide/", "passage_text": "Sous-vide—French for “under-vacuum”—is an innovative cooking technique in which food is vacuum sealed and slow-cooked in water at constant low temperatures until it’s perfectly cooked through."}, {"url": "http://modernistcuisine.com/2013/01/why-cook-sous-vide/", "passage_text": "Cooking sous vide is easier than its fancy name might suggest. You simply seal the ingredients in a plastic bag (you can also use a canning jar) and place them in a water bath, a combi oven, or any other cooker that can set and hold a target temperature to within a degree or two."}, {"url": "http://anovaculinary.com/what-is-sous-vide/", "passage_text": "“Sous vide” is French for “under vacuum” and refers to the process of vacuum-sealing food and cooking it in temperature controlled water bath. However, that’s a bit of a misnomer."}, {"url": "http://www.merriam-webster.com/dictionary/sous%20vide", "passage_text": "Definition of SOUS VIDE. : relating to or denoting a method of cooking food slowly in a vacuum-sealed pouch at a low temperature so as to retain most of the juice and aroma."}]