[{"url": "https://www.copeplastics.com/nylatron.html", "passage_text": "Nylatron® GSM Nylon -- Nylatron® GSM contains finely divided particles of molybdenum disulphide (MoS2) to enhance its load bearing capabilities while maintaining the impact resistance inherent to nylon."}, {"url": "http://www.alro.com/divplastics/plasticsproduct_nylatron.aspx", "passage_text": "Nylatron® GSM (cast nylon) contains finely divided particles of molybdenum disulphide (MoS2) to enhance its load bearing capabilities while maintaining the impact resistance inherent to nylon. It is the most commonly used grade for gears, sheaves, sprockets and custom parts."}, {"url": "https://en.wikipedia.org/wiki/Nylatron", "passage_text": "Nylatron is a tradename for a family of nylon plastics, typically filled with molybdenum disulfide lubricant powder. It is used to cast plastic parts for machines, because of its mechanical properties and wear-resistance."}, {"url": "http://www.totalplastics.com/products/277", "passage_text": "Nylatron® GS is molybdenum disulphide (MoS2) filled nylon offering improved strength and rigidity. With a lower coefficient of linear thermal expansion than Nylon 101, Nylatron GS parts maintain better fit and clearances, and have less tendency to seize as bearings."}, {"url": "http://www.nylatron.net/", "passage_text": "Nylatron is of nylon plastic, usually filled with molybdenum disulfide lubricant powder. It's applications include casting plastic parts for machines, because of its mechanical properties and wear-resistance."}, {"url": "http://www.alro.com/divplastics/plasticsproduct_nylatronfamily.aspx", "passage_text": "Nylon is one of the most widely used and versatile thermoplastic resins. Its combination of physical properties and reasonable price make it a favorite choice for numerous applications. Nylons toughness, wear resistance, tensile strength and lubricity make it a good choice for many mechanical machine parts."}, {"url": "http://www.totalplastics.com/products/277", "passage_text": "Nylatron® GSM contains finely divided particles of molybdenum disulphide (MoS2) to enhance its load bearing capabilities while maintaining the impact resistance inherent to nylon. It is the most commonly used grade for gears, sheaves, sprockets and custom parts. It is grey-black in color."}, {"url": "http://lairdplastics.com/product/brands/nylatron", "passage_text": "NYLATRON. Nylatron® is the Trade Name for a family of Cast and Extruded Nylon shapes from Quadrant EPP. These productss are formulated to give superior performance in a variety of applications by adding proprietary additives to increase load, improve PV values, and give longer life in bearing and wear applications."}]