[{"url": "http://productforums.google.com/d/topic/chrome/u5FxGswFK_4", "passage_text": "Forums are the only place that I would need to make my text bold, so yes. In an Incognito window, the add-on is disabled so I'm not able to use the keyboard shortcut to make my text bold. For example, after I've made my text bold (by having to click the B in the forums interface), the BBcode will appear around it. (E.g. [B]This text would be bold due to the code around it.[/B])."}, {"url": "http://answers.microsoft.com/en-us/windows/forum/windows8_1-winapps/windows-81-how-do-i-bold-italicize-and-underline/15a0d213-c63f-4ef1-8294-8ff3c8ed360f", "passage_text": "With Windows XP, I could press CTRL and B to bold, CTRL and I to italicize, CTRL and U to underline. I can't do that with Windows 8.1. Can someone tell me how to do this with the key board? I do not want to use the touch screen to do it: I want to use the keyboard. Use Ctrl + B to bold letters. Use Ctrl + I to Italics. Use Ctrl + U to underline. Thank you. Hi, Try these combination keys and check if this helps"}, {"url": "https://support.office.com/en-us/article/Make-the-text-bold-7D24F3E1-74C1-47F2-88B0-2601779F7CB2", "passage_text": "Make text bold. Select the text that you want to make bold, and move your pointer to the Mini toolbar above your selection. Click Bold. Keyboard shortcut CTRL+B. Note Click Bold again to unbold the text that you selected. Make the text bold. In Microsoft Office Word 2007, you can use the formatting options Mini toolbar to quickly format text. The Mini toolbar appears automatically when you select text. It also appears with the menu when you select text and then right-click."}, {"url": "http://www.homeandlearn.co.uk/MW/s2p2.html", "passage_text": "Use Keyboard. Another easy way to make your text bold in Microsoft Word is with the keyboard. To make text bold by using the keyboard, do the following. 1  Highlight the text you want to make bold. 2  Hold down the Ctrl key on your keyboard. 3  Keep the Ctrl key held down. 4  Press the letter B on your keyboard. 5  To switch off the bold text, keep the Ctrl key held down and press the B key again. 1 Highlight the text you want to make bold. 2  Hold down the Ctrl key on your keyboard. 3  Keep the Ctrl key held down. 4  Press the letter B on your keyboard. 5  To switch off the bold text, keep the Ctrl key held down and press the B key again."}, {"url": "http://www.internet4classrooms.com/msword_keyboard_ibm.htm", "passage_text": "advertisement. Using Keyboard Shortcuts in MS Word You can avoid reaching for the mouse if you are familiar with keyboard shortcuts. If you forget one of these, use the mouse and go to the menu bar. In each pull down menu you will see keyboard commands given in the right side of the window. Commonly used keyboard combinations To use one of these combinations Hold the Ctrl or Alt key down and strike the letter key Ctrl+N Open a new word document quickly. Ctrl+X Cut-Removes the selection from the active document and places it on the clipboard. Ctrl+O Opens a previously saved document."}]