[{"url": "https://www.consumerlab.com/answers/What+is+the+benefit+of+magnesium+orotate+compared+to+other+forms+of+magnesium/magnesium_orotate/", "passage_text": "The bottom line : Magnesium orotate is not the best choice as a magnesium supplement and despite preliminary evidence of a benefit for people with heart disease, there is also evidence suggesting a potential safety concern at around the high dosage used for that purpose."}, {"url": "http://www.livestrong.com/article/496936-magnesium-orotate-vs-magnesium-citrate/", "passage_text": "Magnesium orotate and magnesium citrate are two fairly common types of magnesium formulations that are available. Magnesium may be used in conjunction with traditional therapies to treat such conditions as asthma, heart failure and RLS. Check with a healthcare professional to see which form of magnesium is best for you."}, {"url": "http://www.livestrong.com/article/496936-magnesium-orotate-vs-magnesium-citrate/", "passage_text": "In magnesium orotate, magnesium is bound to oratic acid. While a 500 milligram tablet of magnesium orotate may contain only 31 milligrams of magnesium, the mineral is absorbed very efficiently by your body. Magnesium orotate can be used to improve sleep, as it inhibits some stress hormones like adrenalin. Doctors also associate it with improved cardiovascular health, based on the fact that the mineral can help to relieve tension on blood vessels and lower blood pressure."}, {"url": "https://www.consumerlab.com/answers/What+is+the+benefit+of+magnesium+orotate+compared+to+other+forms+of+magnesium/magnesium_orotate/", "passage_text": "Answer: Magnesium orotate is a complex of magnesium plus orotic acid. Some people use it for its magnesium content (to prevent or treat magnesium deficiency) while others take it for its orotic acid, which is used for improving athletic performance and endurance, and for heart health."}, {"url": "https://www.consumerlab.com/answers/What+is+the+benefit+of+magnesium+orotate+compared+to+other+forms+of+magnesium/magnesium_orotate/", "passage_text": "As a magnesium supplement, it is often promoted as a better source of magnesium than other forms (e.g., magnesium oxide) due to improved absorption. Some websites claim that orotate carries magnesium across cell membranes and produces higher levels of magnesium within the cells."}, {"url": "http://www.globalhealingcenter.com/natural-health/what-is-magnesium-orotate/", "passage_text": "A catalyst in the bod, over 300 enzymatic reactions rely on magnesium to happen. Magnesium can relax the muscles and some claim it helps with symptoms associated with restless leg syndrome. Orotate, a type of magnesium salt from orotic acid, is common in many mineral supplements. Its function is the same as other types of magnesium, and research shows that it holds specific benefits for the heart."}, {"url": "http://magnesiumreview.com/information-of-magnesium-orotate/", "passage_text": "Introduction To Magnesium Orotate. First, let me tell you about magnesium. Magnesium is an alkaline earth metal that naturally occurs here on earth. In our body, it is the fourth most abundant mineral. With this fact, we can conclude that magnesium is a very important part of our body."}]