[{"url": "http://www.food.com/recipe/easy-oven-baked-cod-133718", "passage_text": "1 Preheat oven to 400°F Line your pan with aluminum foil and lightly brush with olive oil, or use a bit of cooking spray. 2  Combine parsley, garlic, lemon zest, and coarse salt on the cutting board. 3  Finely chop, then combine with the breadcrumbs in a shallow plate. 4  Brush top of each fillet with olive oil. Easy! Oven-Baked Cod. 5 5. I made this with sole fish, so I cook them for 20 minutes. I also didn't put them in olive oil before the breadcrumbs for a lighter version. But before I put them in the oven I dizzle some drops of olive oil. The result was a very tasty fish, easy to make and very healthy."}, {"url": "http://www.wikihow.com/Bake-Codfish", "passage_text": "How to Bake Codfish. Cod is a delicious fish that will literally melt in your mouth when it is prepared correctly. While recipes vary, baking is widely understood as the best method of preparing cod for its health and taste benefits."}, {"url": "http://www.foodista.com/question/22NDFQ27/how-long-should-i-bake-cod-and-at-what-temperature", "passage_text": "Cod should be baked at about 350 degrees for 10 to 15 minutes. This is more than sufficient cooking time since cod is a delicate fish and is easily overcooked. When in doubt, if the fish flakes easily with a fork it is finished cooking and ready to eat. "}, {"url": "http://www.food.com/recipe/easy-oven-baked-cod-133718", "passage_text": "Directions. 1  Preheat oven to 400°F Line your pan with aluminum foil and lightly brush with olive oil, or use a bit of cooking spray. 2  Combine parsley, garlic, lemon zest, and coarse salt on the cutting board. 3  Finely chop, then combine with the breadcrumbs in a shallow plate. Easy! Oven-Baked Cod. 5 5. I made this with sole fish, so I cook them for 20 minutes. I also didn't put them in olive oil before the breadcrumbs for a lighter version. But before I put them in the oven I dizzle some drops of olive oil. The result was a very tasty fish, easy to make and very healthy."}, {"url": "http://www.answers.com/Q/How_long_do_you_bake_cod_and_what_temperature", "passage_text": "When it comes to the heating temperature for baking salmon, this food is usually baked in an oven which is usually preheated to a temperature of 350-400 degrees Fahrenheit. If you need help with baking Salmon, please refer to link in sources. Think 8-10 minutes per inch of thickness, i.e. if … you have 2 pieces of 1-1/2 inch thickness and weighing about 16-20 ounces, do not cook it for any more than 20-30 minutes. Your oven should be set no high than 350 F or 160 C. Grilled cod fish is done once it starts to flake."}, {"url": "http://drhyman.com/blog/2010/05/18/recipe-baked-cod-with-thyme/", "passage_text": "Evenly spread the herb and oil mixture over the cod. Bake for approximately 12–15 minutes or until fish flakes easily with a fork: internal temperature of the cod should be 155 degrees. Makes: 4 servings. Prep time: 5 minutes. ½ tsp. sea salt. ¼ tsp. onion powder. Pre-heat oven to 375 degrees. Cut the cod into 5–ounce pieces or have your fish provider do this for you. Combine the olive oil, thyme, salt, and onion powder in a bowl. Mix. Rub or spray a cookie sheet with olive oil to prevent sticking (or cover the pan with parchment paper)."}, {"url": "http://thehousingforum.com/how-long-to-bake-cod/", "passage_text": "Baked Cod. Depending on the temperature of the oven and the size of the cod, it should take about fifteen minutes to bake code. Instead of relying on timing, you should learn how to judge when your fish is done. Cod, like most fish, can be checked for doneness by using a fork or knife to gently prod the fish"}]