[{"url": "https://ycharts.com/indicators/indiana_residential_propane_price", "passage_text": "Add to Watchlists. Indiana Residential Propane Price is at a current level of 1.505, down from 1.522 last week and down from 2.922 one year ago. This is a change of -1.12% from last week and -48.49% from one year ago. 1  Category: Energy. 2  Region: United States. 3  Report: Weekly Heating Oil and Propane Prices."}, {"url": "https://www.vectren.com/", "passage_text": "Manage Your Account Online By choosing to manage your Vectren account online, you can view your bill and payment history, sign up for eBill, make and schedule payments and more. Register Your Online Account. QUICK LINKS Pay Your Bill Start, Stop or Transfer Service Report an Outage. "}, {"url": "http://www.loopnet.com/Indiana/New-Albany_Gas-Stations-For-Sale/", "passage_text": "LoopNet's New Albany, IN Gas Station properties include Gas Stations with Convenience Stores, Gas Stations with Service and Repair and brand name service stations like BP Gas, Shell Oil, Chevron, Exxon and 76 Stations. Find Gas Stations with C-Stores at some of the greatest locations near Highway onramps, offramps and on main roads. All Gas Station listings in New Albany, IN have been sold or expired. Try clicking 'Advanced Search' above to tailor your search for your specific need"}, {"url": "http://www.loopnet.com/Indiana/New-Albany_Gas-Stations-For-Sale/", "passage_text": "LoopNet's New Albany Gas Station properties for sale include service stations, gas station repair shops, gas stations with convenience stores or gas stations without a cstore. Find Gas Stations with C-Stores at some of the greatest locations near Highway onramps, offramps and on main roads. All Gas Station listings in New Albany, IN have been sold or expired. Try clicking 'Advanced Search' above to tailor your search for your specific needs"}, {"url": "http://www.gaspricewatch.com/IN-indiana/New-Albany/zip-code-47150/gas-prices/page-1/2.htm", "passage_text": "6 hours ago. $2.43update. There are 16 Regular gas price reports in the past 5 days in New Albany, IN Zip Code 47150. The average Regular gas price in New Albany, IN Zip Code 47150 is $2.33, which is $0.45 lower than U.S. national average Regular gas price $2.78. The lowest Regular gas price is $2.16 of BP located at 3309 Grant Line Rd, New Albany, KY 47150"}]