[{"url": "http://www.cement.org/docs/default-source/fc_concrete_technology/durability/is177-concrete-slab-surface-defects-causes-prevention-repair.pdf?sfvrsn=4", "passage_text": "An excess amount of entrapped air held within the concrete bya high percentage of material passing the 600 µm, 300 µm,and 150 µm (No. 30, 50, and 100) sieves, resulting in asticky or tacky concrete that can become more easilysealed when floating or finishing it at any early age. Avoid placing a slab directly on polyethylene film or other vapor barriers. Use a 100-mm (4-in.) layer of compactible, drainable fill (not sand). A “crusher run” material, usually graded from 38 mm to 50 mm (1-1/2 in. to 2 in.) down to rock dust, is suitable. Following compaction, the surface can be choked off with a fine-grade material to separate the vaporbarrier from the concrete.5"}, {"url": "http://www.concretenetwork.com/cold-weather-concrete/weather.html", "passage_text": "Hot water-Your ready mixed concrete producer will usually have, and use, hot water in the concrete when the weather turns cold. Most producers will try to have the concrete be at least 65°F when it leaves the plant, which is generally good enough depending on air temperature and thickness of the concrete element. Specify the slump at less than 4 inches and use air entrained concrete to reduce bleeding. But these are concrete temperatures not air temperatures. So when it's cold, we need to protect the concrete until it can handle the cold on its own. The general rule is that once the concrete has gained strength to about 500 psi then it's OK."}, {"url": "http://nature.berkeley.edu/classes/es196/projects/2011final/GuanK_2011.pdf", "passage_text": "The air temperature above the different materials did not mimic the trend shown in surface temperatures (Figure 3). All average air temperatures were between 24°C to 25°C (Table 2). An ANOVA showed that there was no significance air temperatures (between F (3,45) = 0.05, p = 0.99). Differences in surface temperatures. The objectives of my study were to determine if there were differences in surface temperatures of various ground material and if these surface temperatures affect the ambient air temperature above the corresponding material. Based on my results, different ground materials have distinctly different surface temperatures"}, {"url": "http://www.level.org.nz/passive-design/controlling-indoor-air-quality/humidity-and-condensation/", "passage_text": "For example, a RH of 30% means that the air contains 30% of the moisture it can possibly hold at that particular temperature. When air can hold no more moisture at a given temperature (i.e. the RH is 100%), the air is said to be saturated. As air temperature increases, its capacity to hold moisture also increases, so if air temperature rises and its moisture content remains the same, the RH decreases."}, {"url": "http://www.rcil.ca/411.html", "passage_text": "Cement typically comprises 10 to 12 percent of the entire mix. When cement is mixed with water, sand and gravel, it turns into concrete, the rock-like substance associated with sidewalks, roadways, building foundations, and more. Plastic concrete exposed to a carbon dioxide source (CO2) during the concrete placing, finishing and curing period will develop a soft, chalky, carbonated surface, known as dusting. Carbon dioxide is an odourless and colourless gas that is heavier than air and is produced by all forms of combustion."}, {"url": "http://www.rcil.ca/411.html", "passage_text": "In its simplest form, concrete is a mixture of paste (cement & water) and aggregates (sand & stone). The paste coats the surface of the fine (sand) and coarse (stone) aggregates and binds them together into a rock-like mass known as concrete. Plastic concrete exposed to a carbon dioxide source (CO2) during the concrete placing, finishing and curing period will develop a soft, chalky, carbonated surface, known as dusting. Carbon dioxide is an odourless and colourless gas that is heavier than air and is produced by all forms of combustion."}]