[{"url": "http://www.ehow.com/info_12168569_difference-between-fanfold-rigid-foam-insulation.html", "passage_text": "Fanfold Insulation. Fanfold refers to the shape of the foam board. To create fanfold insulation, a single layer of the material is folded in on itself into a fan-like shape, compressing the material and making many layers out of one surface."}, {"url": "http://biytoday.com/sidingprep.htm", "passage_text": "Fanfold insulation is an Extruded Polystyrene foam insulation applied to the exterior of the house. It comes in a variety of colors depending on the manufacturer you choose. How to install Fanfold Insulation on"}, {"url": "http://www.howmuchisit.org/fanfold-insulation-cost/", "passage_text": "Fanfold insulation is an extruded polystyrene foam insulation applied to the exterior of the house. Fan-fold insulation choices should be based on how much insulation you need in a specific area of your house or building. Its purpose is to provide thermal protection and to form a second barrier between the elements and the framing of your house."}, {"url": "http://www.ehow.com/info_12168569_difference-between-fanfold-rigid-foam-insulation.html", "passage_text": "Rigid Foam. Rigid foam boards are the wider category of foam insulation to which fanfold board belongs. Any type of foam board is a type of rigid foam insulation. Rigid foam boards are easier to install than spray foam and can be used as underlayments for surface materials such as walls, siding and flooring."}, {"url": "http://biytoday.com/sidingprep.htm", "passage_text": "You will be using Fanfold insulation with an R-value of 1. The R-value of insulation is the term used to describe the level of thermal protection of a particular insulating material. As an example, on the interior of the house you will be using an R-19 on the walls and R-30 on the ceilings."}, {"url": "http://www.howmuchisit.org/fanfold-insulation-cost/", "passage_text": "1 Fanfold insulation which is 1/4 thick and 4 x 50 feet in size can cost $42 to $55. 2  For example, the R1 1/4′ FanFold Underlayment Board for Re-siding sold by the company Menards retails for $34. 3  A R-19 based fanfold insulation can cost $1.80 to $3 per square foot."}, {"url": "http://www.howmuchisit.org/fanfold-insulation-cost/", "passage_text": "1 Fanfold insulating material can vary anywhere from $4 to as much as $8 per square foot. 2  Fanfold insulation which is 1/4 thick and 4 x 50 feet in size can cost $42 to $55. 3  For example, the R1 1/4′ FanFold Underlayment Board for Re-siding sold by the company Menards retails for $34."}, {"url": "http://insulation.owenscorning.com/homeowners/renovation/products/propink-fanfold-board/", "passage_text": "PROPINK® Fanfold Underlayment Board is a thin extruded polystyrene fanfold board faced on both surfaces with a plastic film facer. PROPINK Fanfold Underlayment Board has an advanced cut folded hinge every 24 inches to provide ease of package assembly and ease of installation at the job site."}]