[{"url": "https://en.wikipedia.org/wiki/Osteopathy", "passage_text": "For diseases of the bone, see bone disease and osteology. Osteopathy is a type of alternative medicine that emphasizes the physical manipulation of the body's muscle tissue and bones. Its name derives from Ancient Greek bone (ὀστέον) and disease of (-πάθεια), Osteopathic medicine in the United States differs greatly in scope and approach from osteopathy as practised in Europe and elsewhere. The Osteopathy Board of Australia is part of the Australian Health Practitioner Regulation Agency which is the regulatory body for all recognized health care professions in Australia."}, {"url": "https://en.wikipedia.org/wiki/Osteopathy", "passage_text": "Osteopathy is a type of alternative medicine that emphasizes the physical manipulation of the body's muscle tissue and bones. The Osteopathy Board of Australia is part of the Australian Health Practitioner Regulation Agency which is the regulatory body for all recognized health care professions in Australia."}, {"url": "http://www.nhs.uk/chq/Pages/1100.aspx?CategoryID=68&SubCategoryID=154", "passage_text": "It is a legal requirement for osteopaths to register with the GOsC. If osteopathy is available on the NHS in your area, your GP may be able to refer you to an osteopath at a local osteopathic clinic if they feel that the treatment will benefit you. Sometimes, an osteopath may also provide treatment at your local hospital or GP surgery. Osteopathy is a type of complementary therapy. Like all complementary therapies, osteopathy is not available on the NHS in all parts of the country. Even in places where osteopathy is available, there may be limited availability."}, {"url": "http://www.medicalnewstoday.com/articles/70381.php", "passage_text": "email. Knowledge center. Osteopathy is a form of drug-free non-invasive manual medicine that focuses on total body health by treating and strengthening the musculoskeletal framework, which includes the joints, muscles and spine. Its aim is to positively affect the body's nervous, circulatory and lymphatic systems. Osteopathy is a five-year university course, which includes a degree and masters qualification. Senior Osteopathy students complete clinical training under the supervision of registered Osteopaths at student teaching clinics."}, {"url": "http://www.nhs.uk/Conditions/Osteopathy/Pages/Introduction.aspx", "passage_text": "Common uses. Most people who see an osteopath do so for help with conditions that affect the muscles, bones and joints, such as: 1  lower back pain. 2  neck pain. 3  shoulder pain. 4  arthritis. 5  problems with the pelvis, hips and legs. 6  sports injuries. They use a range of techniques, but don't use drugs or surgery. In the UK, osteopathy is a complementary or alternative medicine (CAM) , and is different from conventional western medicine. Although osteopaths may use some conventional medical techniques, the use of osteopathy isn't always based on scientific evidence."}, {"url": "http://www.healthcare-salaries.com/physicians/osteopath-salary", "passage_text": "According to all salary survey, the median salary for an osteopath is about £30,000. An average hourly wage for an osteopath is about £17. An osteopath’s salary varies based on his or her age as the one in 20s earns up to£25,500, in 30s earns about £33,320, in 40s and in 50s earns about £39,440 per annum. According to Pay scale reports, a median salary for an osteopath employed in hospital is about $148,569 per annum while the one employed in a company earns around $143,022. An osteopath working in a private practice earns around $169,631 per annum while a self-employed osteopath receives about $203,473."}, {"url": "http://www.osteopathy.org.au/", "passage_text": "About Osteopathy. Osteopathy is a hands on approach to healthcare recognising the important link between the structures of your body & the way it works. Osteopaths focus on how your skeleton, joints, muscles, nerves and circulation work together to improve your health & well-being. Find out more. Find your local Osteopath. "}, {"url": "http://www.medicalnewstoday.com/articles/70381.php", "passage_text": "This therapy is a unique holistic (whole body) approach to health care. Osteopaths do not simply concentrate on treating the problem area, but use manual techniques to balance all the systems of the body, to provide overall good health and wellbeing. Osteopathy is a five-year university course, which includes a degree and masters qualification. Senior Osteopathy students complete clinical training under the supervision of registered Osteopaths at student teaching clinics."}]