[{"url": "http://www.advancedimagingofmt.com/index.php?page=mri-faq", "passage_text": "The length of the exam depends on the type of study being performed. 1  MRI of the Brain … 20-45 minute scan time. 2  MRI of the Orbits … 20-35 minute scan time. 3  MRI of the TMJ … 45-60 minute scan time. 4  MRI of the Soft Tissue Neck … 25-35 minute scan time. 5  MRI of the Cervical Spine … 20-35 minute scan time. 1 MRI of the Orbits … 20-35 minute scan time. 2  MRI of the TMJ … 45-60 minute scan time. 3  MRI of the Soft Tissue Neck … 25-35 minute scan time. 4  MRI of the Cervical Spine … 20-35 minute scan time. 5  MRI of the Upper Extremity"}, {"url": "http://www.themedicalquestions.com/Med/how-long-does-a-mri-take.html", "passage_text": "The scan will take 30 to 90 minutes. Preparation and sedation take an additional 60 minutes. The length of time depends upon the part of the body being scanned. https://www.med.virginia.edu/internet/radiology/pediatrics/pediatrics-mri-scan.cfm. A really long time, maybe half an hour, that you can't move you head. Each procedure will take between 30-45 minutes. Scanning times will vary, depending on the scanning protocol and machine at each facility. For a more accurate time frame, you should call the facility where you are scheduled and ask how long those exams take.A brain MRI shows brain tissue, ventricles, sinuses etc."}, {"url": "https://myfootshop.wordpress.com/2009/11/23/my-mri-says-i-have-bone-edema-how-long-will-that-take-to-heal/", "passage_text": "So if your doctor recommends an MRI and your MRI comes back with a diagnosis of bone edema, be patient with your doc. She/he will try to guide you with answers, but defining how long bone edema will take to heal can be a challenge. Jeffrey A. Oster, DPM. My MRI says I have bone edema. Filed under: Foot and ankle trauma — Tags: bone contusion, bone edema, stress fracture — Jeffrey Oster, DPM @ 9:51 pm. Bone edema is the term used by doctors (radiologists) to describe swelling within bone."}, {"url": "http://www.kgbanswers.com/how-long-does-an-mri-take-for-a-ankle-scan/20489797", "passage_text": "Find out more at Daily Fusion. Not Medical Advice: The length of the exam will vary on the area being tested and if any contrast is used. A full exam of the foot and ankle could take anywhere from one hour to an hour and a half, as several pictures may be needed to complete the exam. Each picture can take anywhere from a few seconds to fifteen minutes. MRI images are very sensitive to movement. The patient should keep still during the scan; otherwise parts of the scan may have to be done again and may take longer. It is not uncommon at all to feel anxious or claustrophobic during an MRI scan, as the procedure involved sliding your body into a tight fitting tube."}, {"url": "https://myfootshop.wordpress.com/2009/11/23/my-mri-says-i-have-bone-edema-how-long-will-that-take-to-heal/", "passage_text": "And without a classification scheme, we then have a difficult time answering that question…how long will this bone edema injury take to heal. In my practice (foot and ankle care), I’ve tended to find that when we discover bone edema on an MRI, the injury may take as long if not longer than most fractures to heal. For instance, a common foot problem that we’ll see is a metatarsal stress fracture. My MRI says I have bone edema. Filed under: Foot and ankle trauma — Tags: bone contusion, bone edema, stress fracture — Jeffrey Oster, DPM @ 9:51 pm. Bone edema is the term used by doctors (radiologists) to describe swelling within bone."}, {"url": "http://sunnybrook.ca/content/?page=img-mri-faqs", "passage_text": "How long does the MRI scan take? For most exams, expect to be in the department for a minimum of one hour. We need time to prepare you for your scan, and then take you into the room for the actual exam. For most body cases (exams like liver, pelvis, heart) expect to be in the department for two hours. "}, {"url": "http://www.wisegeekhealth.com/what-should-i-expect-from-an-ankle-mri.htm", "passage_text": "Depending on the severity and complexity of an injury, the ankle MRI may take anywhere from about fifteen minutes to half an hour to complete. Once the procedure is finished, the technician will help the patient off of the table and allow him or her to redress. "}, {"url": "http://www.nhs.uk/Conditions/MRI-scan/Pages/How-is-it-performed.aspx", "passage_text": "How an MRI scan is performed. A magnetic resonance imaging (MRI) scan is a painless procedure that lasts 15 to 90 minutes, depending on the size of the area being scanned and the number of images being taken. You may be asked to hold your breath during short scans. Depending on the size of the area being scanned and how many images are taken, the whole procedure will take 15 to 90 minutes. The MRI scanner will make loud tapping noises at certain times during the procedure."}, {"url": "http://www.nhs.uk/Conditions/MRI-scan/Pages/How-is-it-performed.aspx", "passage_text": "A single scan may take from a few seconds to three or four minutes. You may be asked to hold your breath during short scans. Depending on the size of the area being scanned and how many images are taken, the whole procedure will take 15 to 90 minutes. The MRI scanner will make loud tapping noises at certain times during the procedure. This is the electric current in the scanner coils being turned on and off"}]