[{"url": "http://www.greatdayimprovements.com/asphalt-vs-concrete-driveways.aspx", "passage_text": "Concrete, on the other hand, can run between $4.00 to $6.00 per square foot for basic installation and can cost more depending on different finishes and detail. It’s not unheard of to have a stained concrete driveway with a smooth finish cost over $15.00 per square foot. Ignoring any maintenance costs, asphalt is generally much cheaper to install than concrete. On average, the cost per square foot for asphalt will run between $2.50 to $4.00. Fluctuations in crude oil prices can cause fluctuations in asphalt prices but the price will remain around this range."}, {"url": "http://www.homeadvisor.com/cost/garages/install-a-driveway/", "passage_text": "The average national cost of a driveway installation is $3,647, with most homeowners spending between $2,026 and $5,278. This data is based on actual project costs as reported by HomeAdvisor members. If you're thinking about installing a driveway, it's important to consider a couple of different things. Overall the cost of a driveway will depend on what materials you decide to use for your project. For some people a driveway is just a way to drive to the garage, but for others it's a prominent viewpoint in front of the house that needs to have the same curb appeal as the yard or exterior of the home."}, {"url": "http://www.howmuchisit.org/concrete-driveway-cost/", "passage_text": "1 Therefore, a driveway that is 1000 square feet will cost $4,000-$15,000 to complete. 2  This price depends on the extent of the job and the type of concrete selected. 3  The higher the quality of the concrete, the more expensive it will be per square foot. 1 The cost of concrete drive will be between $4-$15 per square foot. 2  Therefore, a driveway that is 1000 square feet will cost $4,000-$15,000 to complete. 3  This price depends on the extent of the job and the type of concrete selected. 4"}, {"url": "http://home.costhelper.com/driveway.html", "passage_text": "1 A plain concrete driveway can cost $3 -$10 or more a square foot, or $900 -$3,000 for 12'x25' or $2,900 -$9,600 for 24'x40', while a customized concrete driveway with multiple decorative elements can cost $15 -$25 or more a square foot, or $4,500 -$7,500 for 12'x25' or $14,400 -$24,000 for 24'x40'). A driveway is often the first thing that visitors see and the most-used outdoor area of a home, and is also key to the property's drainage. Depending on the materials used, a driveway can be utilitarian, like gravel, asphalt, or concrete, or decorative, like stamped asphalt, stamped concrete, or cobblestone."}, {"url": "http://www.drivewayguide.com/guides/cost-of-concrete-driveway-repairs-and-replacement/", "passage_text": "Multiplied by the cost of concrete, you’re total concrete driveway cost will be $3,500-$5,600. If you are interested in knowing how much concrete you will use, here’s how to do that. One yard of concrete will cover 81 square feet of ground 4 inches deep. It will require 1.5 yards of concrete to cover the same area to 6 inches deep. Depending on conditions in your area, your driveway contractor will suggest using at least 4 inches, and 6 inches is more common. Just for the concrete on a plain driveway, the cost will average $6-$9 per square foot. Take some measurements of your driveway and create your own concrete driveway cost calculator. Be sure to include the garage floor if you’re having that replaced."}, {"url": "http://www.concretenetwork.com/concrete/concrete_driveways/cost.html", "passage_text": "Cost of a Concrete Driveway. Longer-lasting, less maintenance, and cost-effective are the top three attributes of driveways installed with decorative concrete. Driveway costs can range from $6 per square foot to more than $15 per square foot depending upon the design and coloring effects desired. "}, {"url": "http://www.homewyse.com/services/cost_to_install_concrete_driveway.html", "passage_text": "Our free calculator uses recent, trusted data to estimate costs for your Concrete Driveway Installation project. For a basic 120 square feet project in zip code 47474, the benchmark cost to Install a Concrete Driveway ranges between $4.56 - $6.34 per square foot* . To estimate costs for your project: 1. Set Project Zip Code Enter the Zip Code for the location where labor is hired and materials purchased"}, {"url": "http://home.costhelper.com/concrete-driveways.html", "passage_text": "1 Resurfacing an existing concrete driveway typically costs $2 -$8 a square foot depending on the thickness of the resurfacing layer, the condition of the existing concrete, and whether there are any patterns or colors stamped on the resurfaced area. 1 Concrete should be sealed about 20-30 days after installation, and re-sealed about every two years. 2  Do-it-yourself materials typically cost $50 -$200 or more; professional sealing can cost $150 -$500 or more."}, {"url": "http://www.fixr.com/costs/concrete-driveway-paving", "passage_text": "The cost to pave an average concrete driveway varies by location, shape, size, concrete reinforcement material, labor rates, and decorative quality of the finish. A typical two-car driveway is 16 feet wide and 38 feet long without curves or slope, for a total surface area of 610 square feet. It will typically cost $4.99 per square foot to be professionally supplied and paved with concrete. The DIY Material Cost is around $2.59 per square foot. "}]