[{"url": "http://health.gov/dietaryguidelines/dga2005/document/html/chapter10.htm", "passage_text": "The refrigerator should be set at no higher than 40°F and the freezer at 0°F, and these temperatures should be checked with an appliance thermometer. Refrigerated leftovers may become unsafe within 3 to 4 days. Despite the appearance of a food, it may not be safe to eat. Uncooked and undercooked meat, poultry and eggs and egg products are potentially unsafe. Raw meat, poultry and eggs should always be cooked to a safe internal temperature (see fig. 5). The best way to tell if meat, poultry and egg dishes are cooked safely is to use a food"}, {"url": "http://www.recipetips.com/kitchen-tips/t--149/chicken-handling-safety-storage.asp", "passage_text": "Never leave the chicken at room temperature for more than two hours. Cooked chicken can be store for up to three or four days in a refrigerator at 40°F or less. If leftovers are not going to be used within this time, they can be frozen and stored for up to three or four months. The meat should be stored in the coldest section of the refrigerator. Chicken can be stored safely for 2 or 3 days in the refrigerator at 40°F or less. Chicken giblets and ground poultry should only be stored in the refrigerator for 1 day. If you are storing for a longer period of time, the chicken products should be frozen"}, {"url": "http://www.recipetips.com/kitchen-tips/t--149/chicken-handling-safety-storage.asp", "passage_text": "Do not leave the chicken at room temperature for more than two hours. If cooked chicken is not going to be used within four days of cooking, it should be frozen. Refrigerating. Raw or cooked chicken can be stored safely in a refrigerator at 40°F or lower for several days. The meat should be stored in the coldest section of the refrigerator. Chicken can be stored safely for 2 or 3 days in the refrigerator at 40°F or less. Chicken giblets and ground poultry should only be stored in the refrigerator for 1 day. If you are storing for a longer period of time, the chicken products should be frozen"}, {"url": "http://dish.allrecipes.com/chicken-cooking-basics/", "passage_text": "Read on for quick tips and top recipes. Keep It Cold. 1  Store raw chicken in the coldest part of your refrigerator and use it within two days. 2  Never leave raw or frozen chicken at room temperature, which encourages the growth of bacteria like Salmonella and Listeria. Handling Leftover Chicken. Cooked chicken should not be left at room temperature for more than two hours. Package it up in an air-tight container and store it in the fridge for up to two days."}, {"url": "http://www.fda.gov/Food/ResourcesForYou/HealthEducators/ucm082294.htm", "passage_text": "1 Your refrigerator should register at 40° F (4° C) and the freezer at 0° F (-18° C). 2  Place a refrigerator thermometer in the refrigerator, and check the temperature periodically. 3  During the automatic defrost cycle, the temperature may temporarily register slightly higher than 40° F (4° C). 4  This is okay. She can safely eat 12 ounces per week of a variety of cooked fish. A typical serving size of fish is from 3 to 6 ounces. Of course, if her serving sizes are smaller, she can eat fish more frequently."}, {"url": "http://www.healthycanadians.gc.ca/eating-nutrition/healthy-eating-saine-alimentation/safety-salubrite/meat-viandes/turkey-dinde-eng.php", "passage_text": "Thawing. The safest way to thaw frozen raw chicken or turkey is in the refrigerator. Always defrost food in the refrigerator, in cold water or in the microwave-never at room temperature. Thawing your poultry at room temperature can allow bacteria to grow. 1 This will keep your food out of the temperature danger zone between 4 °C (40 °F) to 60 °C (140 °F) where bacteria can grow quickly. 2  Place the poultry in a clean container or a plastic bag that will hold any leaking raw juices. 3  Cook fresh poultry within no more than two to three days after purchasing."}, {"url": "http://dish.allrecipes.com/chicken-cooking-basics/", "passage_text": "Thaw frozen chicken slowly and safely. It will take anywhere from 24 hours to two days to thaw a whole chicken in the refrigerator, and about 2 to 9 hours for cut-up chicken parts (less for boneless pieces). You can thaw chicken more quickly in a cold water bath or by using the defrost cycle of the microwave. Handling Leftover Chicken. Cooked chicken should not be left at room temperature for more than two hours. Package it up in an air-tight container and store it in the fridge for up to two days."}, {"url": "http://www.recipetips.com/kitchen-tips/t--149/chicken-handling-safety-storage.asp", "passage_text": "Proper Storage. Chicken should be stored at a temperature outside of the temperature zone in which bacteria, that causes foodborne illness, grows quickly. The danger temperature zone is a range between 40°F and 140°F. Raw chicken can be stored in a refrigerator for several days. The meat should be stored in the coldest section of the refrigerator. Chicken can be stored safely for 2 or 3 days in the refrigerator at 40°F or less. Chicken giblets and ground poultry should only be stored in the refrigerator for 1 day. If you are storing for a longer period of time, the chicken products should be frozen"}]