[{"url": "https://en.wikipedia.org/wiki/Mountain", "passage_text": "The highest mountain on Earth is Mount Everest in the Himalayas of Asia, whose summit is 8,850 m (29,035 ft) above mean sea level. The highest known mountain on any planet in the Solar System is Olympus Mons on Mars at 21,171 m (69,459 ft). The highest mountains above sea level are generally not the highest above the surrounding terrain. There is no precise definition of surrounding base, but Denali, Mount Kilimanjaro and Nanga Parbat are possible candidates for the tallest mountain on land by this measure."}, {"url": "http://www.thefreedictionary.com/mountain", "passage_text": "moun•tain. 1. a natural elevation of land rising more or less abruptly to a summit, and attaining an altitude greater than that of a hill. 2. a large mass or heap; pile. 3. a huge amount: a mountain of mail. 4. of or pertaining to mountains. 5. living, growing, or located in the mountains. A generally massive and usually steep-sided, raised portion of the Earth's surface. Mountains can occur as single peaks or as part of a long chain. They can form through volcanic activity, by erosion, or by the collision of two tectonic plate"}, {"url": "http://worldlandforms.com/landforms/mountain/", "passage_text": "Mountain Definition. A mountain is a natural elevation of the earth’s surface rising more or less abruptly to a summit, and attaining an altitude greater than that of a hill, usually greater than 2000 ft. Related to Mountain: Pyramidal Peak, Mountain Ranges, Mountain Pass. The most common way a mountain is formed is through plate tectonics. The Earth has massive plates that float. These plates can move under and over each other. When one plate moves under another the plate, the other plate rises up to form a mountain. After thousands of years, they mountains can get very high."}, {"url": "http://science.nationalgeographic.com/science/earth/surface-of-the-earth/mountains-article/", "passage_text": "Thirty of the world’s highest mountains are in the Himalaya. The summit of Mount Everest, at 29,035 feet (8,850 meters), is the highest point on Earth. The tallest mountain measured from top to bottom is Mauna Kea, an inactive volcano on the island of Hawaii in the Pacific Ocean. Other types of mountains form when stresses within and between the tectonic plates lead to cracking and faulting of the Earth's surface, which forces blocks of rock up and down. Examples of fault-block mountains include the Sierra Nevada in California and Nevada, the Tetons in Wyoming, and the Harz Mountains in Germany."}, {"url": "https://en.wikipedia.org/wiki/Mountain", "passage_text": "Heights of mountains are typically measured above sea level. Using this metric, Mount Everest is the highest mountain on Earth, at 8,848 metres (29,029 ft). There are at least 100 mountains with heights of over 7,200 metres (23,622 ft) above sea level, all of which are located in central and southern Asia. The highest mountains above sea level are generally not the highest above the surrounding terrain. There is no precise definition of surrounding base, but Denali, Mount Kilimanjaro and Nanga Parbat are possible candidates for the tallest mountain on land by this measure."}, {"url": "http://lib.colostate.edu/wildlife/mountain-biome.html", "passage_text": "The mountain biome is not usually described in other references because a variety of other biomes exist within it (such as grasslands at the base of a mountain, coniferous forest at the center of the mountain, and the tundra found at the top of the mountain). "}, {"url": "http://www.yourdictionary.com/mountain", "passage_text": "noun. Snow covered mountains. Snow covered mountains. The definition of a mountain is a part of Earth that is very wide, has a taller height than a hill and often has steep sides, or it is a large pile of something. 1  An example of a mountain is Mount Olympus. 2  An example of a mountain is a bowl with 10 large scoops of ice cream in it, a mountain of ice cream"}, {"url": "http://science.nationalgeographic.com/science/earth/surface-of-the-earth/mountains-article/", "passage_text": "A mountain range is a series or chain of mountains that are close together. The world's tallest mountain ranges form when pieces of Earth's crust—called plates—smash against each other, in a process called plate tectonics, and buckle up like the hood of a car in a head-on collision. Other types of mountains form when stresses within and between the tectonic plates lead to cracking and faulting of the Earth's surface, which forces blocks of rock up and down. Examples of fault-block mountains include the Sierra Nevada in California and Nevada, the Tetons in Wyoming, and the Harz Mountains in Germany."}, {"url": "http://www.bbc.co.uk/nature/habitats/Mountain", "passage_text": "Mountains. Mountains are in general a much tougher place to life than equivalent lowland habitats, partly due to the lower temperatures and harsher weather. At very high altitudes there is also less oxygen and carbon dioxide in the air, making life difficult for both animals and plants. "}]