[{"url": "http://www.payscale.com/research/US/Job=Licensed_Vocational_Nurse_(LVN)/Hourly_Rate/b447bfda/Los-Angeles-CA", "passage_text": "The average rate for a Licensed Vocational Nurse (LVN) in Los Angeles, California is $20.44 per hour. A skill in Acute Care is associated with high pay for this job. (United States). The average rate for a Licensed Vocational Nurse (LVN) in Los Angeles, California is $20.44 per hour. A skill in Acute Care is associated with high pay for this job. Most people with this job move on to other positions after 20 years in this field."}, {"url": "http://www.lvnprogramsincalifornia.net/lvn-salary-in-california/", "passage_text": "For example, BLS.gov data shows that LVNs in Salinas earn the highest average salary of anywhere in the country at $59,670 per year, just ahead of vocational nurses in the Bay Area (San Francisco, San Jose and Oakland in particular) who also average close to $60,000 annually. LVN Salary in California. If you’re thinking about becoming a Licensed Vocational Nurse, you’ll be interested to know that the average LVN salary in California is almost 10% higher than elsewhere in the United States according to www.BLS.gov."}, {"url": "http://work.chron.com/much-licensed-vocational-nurse-make-4142.html", "passage_text": "California was next on the list for opportunities, with 9 percent of U.S. jobs and mean salaries of $24.58 per hour, or $51,130 per year. The highest pay was in Connecticut, at an average $25.49 per hour, or $53,010 per year, in 2011. Nevada followed with a mean wage of $25.13 per hour, or $52,270 per year. Texas offered the most jobs for LVNs -- almost 10 percent of the total jobs in the country -- and paid a mean $20.32 per hour, or $42,260 per year, according to the 2011 BLS statistics."}, {"url": "http://nursesalaryguide.net/licensed-practical-nurse-lpn-salary-lvn/", "passage_text": "The latest data from the Bureau of Labor Statistics shows that the average annual salary for a LPN or LVN working in the United States is $42,400. This works out at $20.30 per hour, $815 per week and $3,533 per month. Look at the table below to see how this compares with the national average wage. "}, {"url": "http://www.healthcaresalaryonline.com/lpn-salary.html", "passage_text": "Hourly. Licensed Practical and Licensed Vocational Nurses median salary is $19.79 per hour. The lowest 10% earn $14.74 per hour and those in the upper 10% earn more than $27.00 per hour. Annually. On an annual basis the median Licensed Practical and Licensed Vocational Nurses salary is $41,150. The lowest 10% earn $30,650 per year while the upper 10% earn more than $57,000 per year."}, {"url": "http://work.chron.com/hourly-rate-lpn-make-1546.html", "passage_text": "According to figures released in May 2011 by the Bureau of Labor Statistics, the average hourly wage for LPNs across the country in 2010 was $20.21 per hour, which for full-time hours works out to $42,040 per year. Entry-level wages can be much lower. "}, {"url": "http://www.payscale.com/research/US/Job=Licensed_Vocational_Nurse_(LVN)/Hourly_Rate", "passage_text": "(United States). Licensed Vocational Nurses in the United States pull down an average of $19.72 per hour. The bottom of the pay range sits near $15.29 per hour, and the top verges on $25.41. The average worker who claims fewer than five years of experience earns around $40K. In contrast, however, individuals who report five to 10 years in this occupation see a much larger median of $44K. After working for 10 to 20 years, Licensed Vocational Nurses make a median salary of $45K."}, {"url": "http://www.healthcaresalaryworld.com/what-is-lvn-salary/", "passage_text": "Mean Annual LVN Salary. The average annual licensed vocational nurse salary is $42,910. The average salary is calculated by adding all the wages within the occupation and dividing that value by the total number of workers in this profession. The lowest 10% of licensed vocational nurse salaries are less than $31,300. "}, {"url": "http://www.ehow.com/info_7793004_average-lvn-salary-california.html", "passage_text": "California and National Pay. LVNs held 61,050 jobs in California in 2013, according to the U.S. Bureau of Labor Statistics. Their average hourly pay was $24.91, for an equivalent full-time annual wage of $51,800. The average pay for LVNs and LPNs nationwide was $20.63 per hour, or $42,910 annually in 2013. The top-paying state was Connecticut, where wages averaged $26.30 hourly, or $54,690 annually. As of 2012, approximately 80 percent of LVNs and LPNs nationwide worked full time, according to the BLS"}]