[{"url": "http://voxeu.org/article/market-economy-s-stability", "passage_text": "The market economy’s stability. Paul Beaudry, Dana Galizia, Franck Portier 04 July 2015. Whereas some view the macroeconomy as overall stable and on a smooth long-run growth path, others argue it is unstable with repeated periods of booms and busts. This column suggests that the market economy is inherently unstable and booms and busts arise endogenously as the results of market incentives."}, {"url": "http://voxeu.org/article/market-economy-s-stability", "passage_text": "Stability of a market economy. There are two polar views about the functioning of a market economy. 1  On the one hand, there is the view that such a system is inherently stable, with market forces tending to direct the economy to a smooth growth path. Whereas some view the macroeconomy as overall stable and on a smooth long-run growth path, others argue it is unstable with repeated periods of booms and busts. This column suggests that the market economy is inherently unstable and booms and busts arise endogenously as the results of market incentives."}, {"url": "http://climateobserver.org/open-and-shut/market-stability-reserve-msr/", "passage_text": "In the EU, one of the hybrid mechanisms (a market stability reserve) is being proposed to counter the problems the EU ETS is facing with oversupply of allowances and low prices. By creating a more stable carbon price, the MSR intends to increase the stability of the EUETS market and its resilience to sudden market shocks. This is important because it indicates to investors that carbon is being taxed seriously and consistently."}, {"url": "http://www.rba.gov.au/fin-stability/about.html", "passage_text": "About Financial Stability. A stable financial system is one in which financial intermediaries, markets and market infrastructure facilitate the smooth flow of funds between savers and investors and, by doing so, help promote growth in economic activity. "}, {"url": "http://climateobserver.org/open-and-shut/market-stability-reserve-msr/", "passage_text": "Back to all voices. The Market Stability Reserve (MSR) is a mechanism proposed within a broader reform of the EU Emission Trading System. Carbon pricing is one of the key responses to the problem of excessive greenhouse gas emissions in the atmosphere. There are two main types of carbon pricing: carbon trading and carbon taxing. By creating a more stable carbon price, the MSR intends to increase the stability of the EUETS market and its resilience to sudden market shocks. This is important because it indicates to investors that carbon is being taxed seriously and consistently."}, {"url": "https://www.ecb.europa.eu/pub/fsr/html/index.en.html", "passage_text": "Financial Stability Review. The Financial Stability Review is published twice a year (usually May and November). It provides an overview of the possible sources of risk and vulnerability to financial stability in the euro area. Its aim is to promote awareness of issues that are relevant for safeguarding the stability of the euro area financial system, both within the financial industry and among the public"}, {"url": "http://www.beginnermoneyinvesting.net/html/market_stability_.htm", "passage_text": "Market Stability. Market stability is called this way because it does not matter where the model of supply and demand starts, it always goes towards the market balance. The fact that the actions of the participants in the market, which are buyers and sellers, take the market towards equilibrium without external intervention, such as what the government does when it needs to regulate something, is very gratifying in this case."}, {"url": "http://www.cbb.gov.bh/assets/FSP/What%20is%20Financial%20Stability.pdf", "passage_text": "Alawode and Al Sadek What is Financial Stability? instability as “…conditions in financial markets that harm or threaten to harm an economy’s performance through their impact on the working of the financial system”. Alawode and Al Sadek What is Financial Stability? financial turmoil is a case in point, where central banks in key markets have been forced to take action even though the macroeconomic impact of the crisis was unknown. The political intervention in the distressed Northern Rock mortgage bank in the UK is another example."}, {"url": "https://www.ecb.europa.eu/pub/fsr/html/index.en.html", "passage_text": "Financial stability can be defined as a condition in which the financial system – intermediaries, markets and market infrastructures – can withstand shocks without major disruption in financial intermediation and in the effective allocation of savings to productive investment. It provides an overview of the possible sources of risk and vulnerability to financial stability in the euro area."}]