[{"url": "https://www.osha.gov/SLTC/etools/steelerection/fallprotection.html", "passage_text": "1 Without any kind of fall protection, an employee was walking atop structural steel to check joints and bolts. 2  He apparently slipped or misjudged his footing and fell approximately 20 feet to the concrete floor below, resulting in his death. In steel erection, a new, very narrow working surface is constantly being created as skeletal steel is erected at various heights. For many steel erectors, especially connectors, the work starts at the top level of the structure."}, {"url": "https://en.wikipedia.org/wiki/Structural_steel", "passage_text": "Structural steel members, such as I-beams, have high second moments of area, which allow them to be very stiff in respect to their cross-sectional area. This is due to the much larger volume required for a structural concrete member to support the same load; steel, though denser, does not require as much material to carry a load. However, this advantage becomes insignificant for low-rise buildings, or those with several stories or less."}, {"url": "http://www.steelconstruction.info/Fire_protecting_structural_steelwork", "passage_text": "Passive fire protection materials insulate steel structures from the effects of the high temperatures that may be generated in fire. They can be divided into two types, non-reactive, of which the most common types are boards and sprays, and reactive, of which thin film intumescent coatings are the most common example. [top] Partial protection. Standard fire tests have shown that structural members which are designed to not be fully exposed to fire can exhibit substantial levels of fire resistance without applied protection. Methods have been developed using this effect to achieve 30 and 60 minutes fire resistance."}, {"url": "https://en.wikipedia.org/wiki/Passive_fire_protection", "passage_text": "Fire-resistance rated wall assembly with fire door, cable tray penetration and intumescent cable coating. Passive Fire Protection (PFP) is an integral component of the three components of structural fire protection and fire safety in a building. Changes to fire protection systems or items affecting the structural or fire-integrity or use (occupancy) of a building is subject to regulatory scrutiny. A contemplated change to a facility requires a building permit, or, if the change is very minor, a review by the local fire prevention officer."}, {"url": "http://www.sharpfibre.com/what-we-do-structural-steel", "passage_text": "Fire resistance testing on structural steel members have shown, that by incorporating a proprietary fire protection system, the ability of the structure to resist fire will be greatly enhanced dependent upon the particular system chosen. It is this “char” that provides the fire protection to the steel work which, in some instances, can be up to 50 times its initial applied thickness. Therefore, secondary casings applied to the steel members must allow for expansion to ensure the intumescent paint system performs correctly. PRINTABLE VERSION."}, {"url": "https://en.wikipedia.org/wiki/Structural_steel", "passage_text": "Structural steel shape, size, composition, strength, storage, etc., is regulated in most industrialized countries. This is due to the much larger volume required for a structural concrete member to support the same load; steel, though denser, does not require as much material to carry a load. However, this advantage becomes insignificant for low-rise buildings, or those with several stories or less."}, {"url": "http://simplifiedsafety.com/store/fall-protection/anchor-points/i-beam-steelwork-anchors.html", "passage_text": "I-Beam and Structural Steel Anchors. Fall protection anchors in this category can be used to attache to I-Beam and other structural steelwork members. Beamers are designed to provide portable fall protection on steel beam construction. A Beamer can easily be attached and removed from a steel I-beam to create a portable, yet secure, anchor point"}, {"url": "http://www.fire.nist.gov/bfrlpubs/build04/PDF/b04047.pdf", "passage_text": "The scope of our discussion is, centrally, the fire protection of structural steel in high rise buildings, but the ramifications of the concepts identified go well beyond these boundaries to offer potential for improvements in risk management throughout the built environment. v Abstract This report summarizes activities, conclusions and recommendations of the National Institute of Standards and Technology (NIST) sponsored study on fire protection of structural steel in high-rise buildings."}, {"url": "http://www.totalmateria.com/page.aspx?ID=CheckArticle&LN=EN&site=kts&NM=300", "passage_text": "1. Passive Barrier Protection. Passive barrier protection works by coating the steel with a protective coating system that forms a tight barrier to prevent exposure to oxygen, water and salt (ions). The lower the permeability of the coating system to water, the better the protection provided. "}]