[{"url": "https://apstudent.collegeboard.org/creditandplacement/search-credit-policies", "passage_text": "Find colleges and universities that offer credit or placement for AP scores. Begin your search by entering the name of the institution below. For the most up-to-date AP credit policy information, be sure to check the institution's website. Find a college's credit policy."}, {"url": "http://www.studypoint.com/ed/ap-credits/", "passage_text": "1 Students may take tests in one or more subjects; a comprehensive list of all available AP courses and tests is available at collegeboard.com. 2  More than 90 percent of four-year colleges in the United States offer credits, advanced placement, or both based on AP exam scores."}, {"url": "http://www.studypoint.com/ed/ap-credits/", "passage_text": "1 Earning AP credits can help students graduate in four years and have more time to pursue activities like study abroad. 2  Myedu.com offers students a tool to help determine the credit value of their AP scores at various colleges and universities."}, {"url": "https://apstudent.collegeboard.org/exploreap/the-rewards", "passage_text": "Earn College Credits. By taking an AP course and scoring successfully on the related AP Exam, you can save on college expenses: most colleges and universities nationwide offer college credit, advanced placement, or both, for qualifying AP Exam scores."}, {"url": "http://www.campusexplorer.com/college-advice-tips/D783D75C/AP-Classes-That-Count-as-College-Credit/", "passage_text": "One of the biggest perks of AP classes is that you can get college credit as long as you score well on the AP Exam at the end of the semester. AP exams are scored on a scale of 1 to 5, with 5 being the highest. Many colleges accept a score of 4 or 5 on an AP exam as college credit in that subject area. In some cases, even a 3 is accepted for college credit."}, {"url": "http://www.studypoint.com/ed/ap-credits/", "passage_text": "1 AP exams are college-level tests administered by The College Board (makers of the SAT). 2  Students may take tests in one or more subjects; a comprehensive list of all available AP courses and tests is available at collegeboard.com."}, {"url": "http://admission.universityofcalifornia.edu/counselors/exam-credit/ap-credits/index.html", "passage_text": "AP credits. UC grants credit for College Board Advanced Placement examinations on which a student scores 3 or higher. Elective units awarded may be applied to UC graduation requirements for specific subjects and/or for general education/breadth requirements, as determined by each campus."}]