[{"url": "http://study.com/academy/lesson/dihybrid-cross-definition-example-quiz.html", "passage_text": "(For example, one phenotype of a pea plant is having purple flowers.) A dihybrid cross is a cross between two individuals that are both heterozygous for two different genes. A hybrid is just the offspring produced when two genetically different parents are crossed. Let's look at an example of a dihybrid cross and see how it can be used to predict the genotype and phenotype chances of offspring. As previously stated, pea plants have two alleles for flower color. Purple color (F) is dominant to white color (f). A second trait of pea plants is height."}, {"url": "http://www.bbc.co.uk/bitesize/higher/biology/genetics_adaptation/dihybrid_cross/revision/1/", "passage_text": "All genetic crosses show how characteristics are inherited through the generations: 1  a monohybrid cross shows the inheritance of one through two generations. 2  From parents to the F 1 generation and then from the F 1 generation to the F 2 generation. 1 From parents to the F 1 generation and then from the F 1 generation to the F 2 generation. 2  a dihybrid cross shows the inheritance of two"}, {"url": "https://en.wikipedia.org/wiki/Dihybrid_cross", "passage_text": "An example of a dihybrid crosses of two pea varieties that differ in seed color and form. Dihybrid cross is a cross between two pure lines (varieties, strains) that differ in two observed traits. In Mendelian sense, between the alleles of both these loci there is a relationship of complete dominance-recessive. For example: RRYY/rryy parents result in F 1 offspring that are heterozygous for both R and Y (RrYy). The rules of meiosis, as they apply to the dihybrid, are codified in Mendel's first law and Mendel's second law, which are also called the Law of Segregation and the Law of Independent Assortment, respectively."}, {"url": "http://www.hobart.k12.in.us/jkousen/Biology/2factor.html", "passage_text": "Cross a male that is heterozygous for both traits with a female that is heterozygous for both traits. (This is called a dihybrid cross). This one will be one of the hardest crosses to accomplish correctly. "}, {"url": "http://www.dnaftb.org/5/problem.html", "passage_text": "Let's try this problem. We have a pea plant that is heterozygous for two traits — height and seed color. The plant is tall and yellow, which are the dominant phenotypes. We will let this plant self-fertilize, and see what kind of offspring this plant produces. This is a dihybrid cross; we are tracking two traits. We will use T (tall) to denote height and Y (yellow) to denote seed color. The plant is heterozygous for both traits so the plant is TtYy. The first thing to do is determine the types of gametes this plant produces"}, {"url": "http://www.youtube.com/watch?v=1p47ndHOUHs", "passage_text": "Please try again later. http://www.BioLerner.com This video will help you to solve a dihybrid cross genetics problem. Learn how to use a Punnet square to show the inheritance of two traits and to demonstrate Mendel's principle of independent assortment. "}, {"url": "http://physics.scsu.edu/~dscott/gen/slides/slides3.pdf", "passage_text": "Mendel conducted both monohybrid and dihybrid crosses Dihybrid cross – initial parents differ in two traits. Figure 3-3 step 3 Mendel’s breeding scheme for a dihybrid cross R/R;y/y r/r;Y/Y: genes are in trans, as above R/R;Y/Y r/r;y/y: genes are in cis Both of these parental combinations = the same F 1. "}, {"url": "http://www.bbc.co.uk/bitesize/higher/biology/genetics_adaptation/dihybrid_cross/revision/1/", "passage_text": "All genetic crosses show how characteristics are inherited through the generations: 1  a monohybrid cross shows the inheritance of one through two generations. 2  a dihybrid cross shows the inheritance of two through two generations. 1 From parents to the F 1 generation and then from the F 1 generation to the F 2 generation"}, {"url": "http://www.biology.arizona.edu/mendelian_genetics/problem_sets/dihybrid_cross/dihybrid_cross.html", "passage_text": "Dihybrid Cross Problem Set A dihybrid cross involves a study of inheritance patterns for organisms differing in two traits. Mendel invented the dihybrid cross to determine if different traits of pea plants, such as flower color and seed shape, were inherited independently. Dihybrid Cross Problem Set. 1  Predicting combinations of alleles in gametes of plants heterozygous for two traits. 2  When does a phenotype ratio of 9:3:3:1 occur? 3  A genetic cross yielding a 9:3:3:1 ratio of offspring. 4  Predicting gametes of an SsYy plant. 5  A SsYy x ssyy test cross. 6  Offspring of a SsYy x ssyy test cross. 7  Homozygous offspring of a 8  ... Hete"}]