[{"url": "http://www.justanswer.com/pet-dog/0wl5r-long-does-placenta.html", "passage_text": "So there is no one answer as to how long a placenta will take to pass-if it is not with the puppy, it is usually passed within a couple of hours. It is possible for one or more placentas to be retained within the uterus. If this is the case, this can be a source for a serious infection."}, {"url": "http://www.petplace.com/article/dogs/diseases-conditions-of-dogs/reproduction/retained-placenta-in-dogs", "passage_text": "The placenta is usually passed within 15 minutes of the birth of each puppy, and can take longer in cats. A retained placenta is extremely uncommon in dogs, and even less common in cats."}, {"url": "http://www.vetinfo.com/assist-dog-giving-birth.html", "passage_text": "Occasionally, the placenta of another puppy will come out with a preceding puppy. As the puppy exits the mother, she will lick the puppy clean and may eat the placenta and sac. This is normal behavior and an integral part of the bonding process. During a dog birth, puppies can take up to four hours to appear."}, {"url": "http://dogcare.dailypuppy.com/long-placenta-come-out-after-dog-gives-birth-last-puppy-5010.html", "passage_text": "If you're watching your dog give birth to puppies, keeping track of the placentas might not be the first thing on your mind. It's important, however, because any whole or partial placentas remaining within the mother dog after delivery can cause serious illness, even death."}, {"url": "http://dogcare.dailypuppy.com/long-placenta-come-out-after-dog-gives-birth-last-puppy-5010.html", "passage_text": "The second stage consists of the actual delivery of the puppies. The third stage is passing of the placenta. The afterbirth might pass with each individual puppy, usually within 15 minutes of delivery. If the mother has a few puppies in rapid succession, those placentas may come out en masse. The final placenta should appear within half an hour of the last puppy's birth."}, {"url": "http://www.answers.com/Q/How_long_does_afterbirth_last_after_a_dog_has_puppies", "passage_text": "After birth is only designed to perform as long as the pregnancy. In canine birth, the afterbirth or placenta is usually delivered like a puppy ... the last puppy. If your dog does not deliver the placenta, it will need to be cleaned out somehow, possibly by your vet."}]