[{"url": "http://caribya.com/bermuda/weather/march/", "passage_text": "N.A. On any given day during March on Bermuda, you can expect early morning temperatures to be around 63.7 degrees. Temperatures on Bermuda typically rise during the day, to an average of 66.9 degrees in the early afternoon. By the early evening hours in March the temperature will generally fall to somewhere in the vicinity of 63.5 degrees. Overall, temperatures on Bermuda during March average around 64.2 degrees."}, {"url": "http://www.holiday-weather.com/bermuda/averages/march/", "passage_text": "Averages for Bermuda in March. The weather continues to improve in March in Bermuda, when the spring season is just around the corner. At this time of year, the island experiences pleasant temperatures of up to 21 C during the day, dropping to a mild 16 C after sunset."}, {"url": "http://www.bermuda.climatemps.com/temperatures.php", "passage_text": "Average Temperatures in Bermuda, Bermuda. 1  The annual mean temperature in Bermuda, Bermuda is really warm at 21.8 degrees Celsius (71.2 degrees Fahrenheit). 2  The range of mean monthly temperatures is 9.5 C (17.1 F) which is a very low range."}, {"url": "http://www.bermuda4u.com/essential/climate/sea-temperature/", "passage_text": "In November and December the water temperature averages 70 F. The period from January to April is the coldest, with an average temperature of 66 F. Most divers prefer to visit Bermuda in the summer months. One advantage of diving in the winter is that visibility is better, ranging from 125 to 175 feet."}, {"url": "http://caribya.com/bermuda/weather/march/", "passage_text": "Typical Weather in March. Temperatures on Bermuda during March generally vary between an average high during the day of 69.0 degrees and an average low at night of 60.0 degrees. On any given day during March on Bermuda, you can expect early morning temperatures to be around 63.7 degrees."}, {"url": "http://www.bermuda.climatemps.com/temperatures.php", "passage_text": "1 The annual mean temperature in Bermuda, Bermuda is really warm at 21.8 degrees Celsius (71.2 degrees Fahrenheit). 2  The range of mean monthly temperatures is 9.5 C (17.1 F) which is a very low range. 3  The range/ variation of diurnal average temperatures is 3.7 C (6.6 F)."}]