[{"url": "http://study.com/academy/lesson/innate-immunity-inflammation-neutrophils-natural-killer-cells.html", "passage_text": "The first response of the body to a localized injury or infection is inflammation or the immediate response of the body to injury or infection that includes an influx of blood plasma and immune cells to a localized area."}, {"url": "http://primer.crohn.ie/the-inflammatory-response", "passage_text": "When a bacterial infection is established in the body, the purpose of the immune system is to control or eradicate it. The initial reaction of the immune system to an infection varies, depending on the site which has been invaded and on the nature of the invader."}, {"url": "http://wps.aw.com/bc_goodenough_boh_4/177/45512/11651143.cw/index.html", "passage_text": "They release chemicals that constrict blood vessels at the wound site. They release chemicals that dilate blood vessels at the wound site. They release chemicals that cause blood to clot at the wound site. The pain associated with the inflammatory response is the direct result of ________. the mast cells touching and thus stimulating the sensory neurons. the swelling of the tissue and the chemicals released from certain cells. chemical messengers within the bloodstream that carry pain messages to the brain."}, {"url": "http://wps.aw.com/bc_goodenough_boh_4/177/45512/11651143.cw/index.html", "passage_text": "When you suffer an injury, white blood cells near the injury site initiate the inflammatory response. true. false. Inflamed tissue turns red because ________. there is an increased blood flow to the injured tissues due to dilation of arterioles in the injured area."}, {"url": "http://www.answers.com/Q/Which_activity_is_part_of_the_inflammatory_response", "passage_text": "The inflammatory response (inflammation) occurs when tissues are injured by bacteria, this happens when a part of your body is injured. leukocytes and plasma proteins ga … ther to inflame the area to fight infection is a nonspecific defense reaction to tissue damage caused by injury or infection Hahaha...look it up."}, {"url": "http://www.nottingham.ac.uk/nmp/sonet/rlos/bioproc/inflam/", "passage_text": "Introduction. The inflammatory response is a series of local cellular and vascular responses which are triggered when the body is injured, or invaded by. . For instance, when you nick your skin, get a foreign object in your eye, or are stung by a bee, reactions occur in order to protect you."}, {"url": "http://primer.crohn.ie/the-inflammatory-response", "passage_text": "An important point to note is that invading organisms, if they interfere with any of the chemicals above, or the cells that produce them, can cause a profound change on the bodies immune response to that organism. Effects of the inflammatory response."}, {"url": "http://study.com/academy/lesson/innate-immunity-inflammation-neutrophils-natural-killer-cells.html", "passage_text": "Inflammation is the immediate response of the body to injury or infection that includes an influx of blood plasma and immune cells to a localized area. The first immune cells that respond to inflammation are mostly neutrophils, which are quick-response immune cells that recognize and destroy bacteria."}]