[{"url": "http://www.cotf.edu/ete/modules/volcanoes/vlocation.html", "passage_text": "Many of the world's active volcanoes are located around the edges of the Pacific Ocean: the West Coast of the Americas; the East Coast of Siberia, Japan, the Philippines, and Indonesia; and in island chains from New Guinea to New Zealand--the so-called Ring of Fire (diagram to left). "}, {"url": "https://en.wikipedia.org/wiki/Pacific_Ring_of_Fire", "passage_text": "The volcanoes in Indonesia are among the most active of the Pacific Ring of Fire. They are formed due to subduction zones of three main active tectonic plates namely the Eurasian Plate, Pacific Plate, and the Indo-Australian Plate. About 90% of the world's earthquakes and 81% of the world's largest earthquakes occur along the"}, {"url": "http://www.worldatlas.com/aatlas/infopage/ringfire.htm", "passage_text": "The Ring of Fire, coinciding with the edges of one of the world's main tectonic plates, (the Pacific Plate) contains over 450 volcanoes and is home to approximately 75% of the world's active volcanoes. The large series of volcanoes (some active) encircling the Pacific Ocean are referred to as being part of the Ring of Fire, and notorious for frequent earthquakes and volcanic eruptions."}, {"url": "http://www.weatherwizkids.com/weather-volcano.htm", "passage_text": "The Pacific Ring of Fire is an area of frequent earthquakes and volcanic eruptions encircling the basin of the Pacific Ocean. The Ring of Fire has 452 volcanoes and is home to over 50% of the world's active and dormant volcanoes. "}, {"url": "https://en.wikipedia.org/wiki/Pacific_Ring_of_Fire", "passage_text": "The Ring of Fire is an area in the basin of the Pacific Ocean where a large number of earthquakes and volcanic eruptions occur. In a 40,000 km (25,000 mi) horseshoe shape, it is associated with a nearly continuous series of oceanic trenches, volcanic arcs, and volcanic belts and/or plate movements. About 90% of the world's earthquakes and 81% of the world's largest earthquakes occur along the Ring of Fire."}, {"url": "http://www.worldatlas.com/aatlas/infopage/ringfire.htm", "passage_text": "Approximately 90% of the world's earthquakes occur along the Ring of Fire; most recently, the devastating quakes in Chile, Japan and New Zealand. The large series of volcanoes (some active) encircling the Pacific Ocean are referred to as being part of the Ring of Fire, and notorious for frequent earthquakes and volcanic eruptions."}, {"url": "http://earthsky.org/earth/what-is-the-ring-of-fire", "passage_text": "The Ring of Fire is a long chain of volcanoes and other tectonically active structures surrounding the Pacific Ocean. The Ring of Fire is a long chain of volcanoes and other tectonically active structures that surround the Pacific Ocean. Deep ocean trenches are a common feature of the Ring of Fire. These trenches form along subduction zones where slabs of the ocean floor slide into the Earth. The deepest part of the ocean on Earth, the Mariana Trench, is located along the Ring of Fire in the western portion of the Pacific Ocean Basin."}, {"url": "https://en.wikipedia.org/wiki/Pacific_Ring_of_Fire", "passage_text": "All but 3 of the world's 25 largest volcanic eruptions of the last 11,700 years occurred at volcanoes in the Ring of Fire. The Ring of Fire is a direct result of plate tectonics and the movement and collisions of lithospheric plates. About 90% of the world's earthquakes and 81% of the world's largest earthquakes occur along"}, {"url": "http://volcano.oregonstate.edu/what-quotring-firequot", "passage_text": "Subduction of oceanic lithosphere. Most of the Earth's volcanoes are located around the Pacific Ring of Fire because that the location of most of the Earth's subduction zones. A subduction zone is a place where one plate of oceanic lithosphere (= the crust + uppermost mantle) is shoved under another plate. The downgoing plate is always the oceanic one. The Ring of Fire is a ring of volcanoes around the Pacific Ocean that result from subduction of oceanic plates beneath lighter continental plates."}]