[{"url": "http://www.acaloriecounter.com/food/cereals-ready-to-eat-muesli-dried-fruit-and-nuts", "passage_text": "Here you will find the full nutrition facts for Cereals ready-to-eat, MUESLI, dried fruit and nuts including calories, protein, carbs, fat and much more. To make sure you are viewing the most accurate nutrition information possible, select a serving size that best represents the actual amount that you are eating."}, {"url": "http://www.howmanycarbs.org/food/how-many-carbs-in-yoghurt-fruit-with-muesli.php", "passage_text": "How many carbs/carbohydrates, how many calories, how much fat, how much protein, sugar, fiber, cholesterol, energy, vitamins and lots of other nutritional facts about Yoghurt, fruit, with muesli."}, {"url": "https://recipes.sparkpeople.com/recipe-calories.asp?recipe=235878", "passage_text": "Here are the foods from our food nutrition database that were used for the nutrition calculations of this recipe. Calories per serving of Yogurt Muesli Breakfast. 82 calories of Uncle Toby's, Breakfast Cereals: Plus, Muesli Flakes, (0.50 serving). 40 calories of Yogurt, Stonyfield Farm fat free plain (6 oz), (0.50 cup)."}, {"url": "http://www.answers.com/Q/How_many_calories_does_a_bowl_of_muesli_have", "passage_text": "How many calories are in a bowl of meat chili?   My guess is that a bowl of meat chilli is made up of approx: 50% beef - 198 calories per 100g 25% tomatoes - 21 calories per tomato 25% kidney beans - 333 calories … per 100g So I would estimate, in one bowl, about 300 calories."}, {"url": "http://www.calories-in-foods.com/calories-in-muesli.php", "passage_text": "As muesli is a cereal, it makes sense to first look at the calories muesli contain by the bowl. 1  There are 340 calories in a 100 g bowl of muesli. 2  In an 85 g cupful of muesli there are 289 calories."}, {"url": "https://www.fatsecret.com/calories-nutrition/usda/muesli-(dried-fruit-and-nuts)", "passage_text": "There are 289 calories in 1 cup of Muesli (Dried Fruit and Nuts). Calorie breakdown: 13% fat, 92% carbs, 0% protein."}, {"url": "https://recipes.sparkpeople.com/recipe-calories.asp?recipe=61557", "passage_text": "Here are the foods from our food nutrition database that were used for the nutrition calculations of this recipe. Calories per serving of Yoghurt with muesli and fresh fruits. 218 calories of Breyer's Lowfat Strawberry Yogurt (1% Milkfat), (1 container (8 oz)). 105 calories of Banana, fresh, (1 medium (7 to 7-7/8 long)). 102 calories of Muesli, dried fruit and nuts cereal, (30 grams). 14 calories of Strawberries, fresh, (4 medium (1-1/4 dia))."}]