[{"url": "http://www.nhs.uk/Conditions/social-care-and-support-guide/Pages/how-to-claim-carers-allowance.aspx", "passage_text": "Backdating Carer's Allowance claims. Carer's Allowance can usually only be backdated for a maximum of three months if you claim it within three months of a decision to award a qualifying benefit to the person you care for. Similar rules apply if the person you look after goes into a care home, but Carer's Allowance will only be paid for up to four weeks for a care home stay. Find out how to challenge a Carer's Allowance decision that you're unhappy with. Page last reviewed: 15/01/2015."}, {"url": "http://www.askaboutmoney.com/threads/how-long-does-a-carers-allowance-decision-take.106941/", "passage_text": "I applied for Half Rate Carer's allowance... (I recieve Disability Allowance, and am caring for my mother)... I applied on Sept 27th 2007 (The day it became available!)... I recieved a letter informing me of being awarded it on Dec 20th 2007... To be fair, I recieved a cheque for the backdated payment (€1,284) on the 24th Dec... So my advice is to plan for a wait of three months, and if it's any shorter, well that's a bonus!..."}, {"url": "http://www.carersuk.org/help-and-advice/financial-support/help-with-benefits/challenging-a-benefit-decision", "passage_text": "From October 2013 there have been new rules in place for challenging a benefit decision made by the Department for Work and Pensions (DWP). If the Department for Work and Pensions (DWP) make a decision about your benefits that you do not agree with, you have 1 month to ask them to reconsider it. However, if you appeal the DWP’s reconsidered decision, then you will get ESA at the assessment rate up until a decision is made by the tribunal. For more information on ESA basic allowance rates and other benefit options, contact the Carers UK Adviceline."}, {"url": "http://www.netmums.com/coffeehouse/advice-support-40/special-needs-disabilities-support-502/923981-how-long-does-take-have-carers-allowance-awarded-all.html", "passage_text": "Hi Tracy thank you for your post. The information on the government website states: What you need to know It can take 4 to 6 weeks to process your claim. https://www.gov.uk/carers-allowance/how-to-claim I hope this is of help to you. It took about 5/6 weeks for me to get a letter back saying i was going to be awarded carers allowance. It said that i would get an award letter this month to tell me how much i'll be getting and then will be paid in May."}, {"url": "http://www.netmums.com/coffeehouse/advice-support-40/special-needs-disabilities-support-502/923981-how-long-does-take-have-carers-allowance-awarded-all.html", "passage_text": "If anyone receives income support and claims carers allowance then they take the amount out of yr income support so you would be left with 90.50 a fortnight. They dont take any money from DLA as this is yr childs money not yr money. Also would be entitled to housing benefit/council tax benefit too. It took about 5/6 weeks for me to get a letter back saying i was going to be awarded carers allowance. It said that i would get an award letter this month to tell me how much i'll be getting and then will be paid in May."}, {"url": "https://www.carersuk.org/help-and-advice/financial-support/help-with-benefits/carers-allowance", "passage_text": "If you claim Carers Allowance within 3 months of the person you care for getting a decision about their qualifying disability benefit, then Carers Allowance can get paid back up to the date the qualifying disability benefit was awarded from (as long as you meet the Carers Allowance conditions for the whole period). Taking a break. You can take a break from caring for up to 4 weeks in every 26 weeks and still be paid Carer's Allowance. You must have been providing 35 hours or more of care a week per week for at least 22 of the past 26 weeks."}, {"url": "https://www.carersuk.org/help-and-advice/financial-support/help-with-benefits/carers-allowance", "passage_text": "Carer's Allowance will continue to be paid for up to 12 weeks if you go into hospital. You must have been providing 35 hours or more of care a week for at least 14 of the past 26 weeks. The person you care for must have been in receipt of a qualifying benefit for that period. Taking a break. You can take a break from caring for up to 4 weeks in every 26 weeks and still be paid Carer's Allowance. You must have been providing 35 hours or more of care a week per week for at least 22 of the past 26 weeks."}, {"url": "http://www.netmums.com/coffeehouse/advice-support-40/special-needs-disabilities-support-502/923981-how-long-does-take-have-carers-allowance-awarded-all.html", "passage_text": "Hi, just to let you know I applied for carers on 26th may after receiving dla for my son, just called them for an update and was told a decision was made yesterday and I will get my award letter next week. And first payment will be around 29th June. It took about 5/6 weeks for me to get a letter back saying i was going to be awarded carers allowance. It said that i would get an award letter this month to tell me how much i'll be getting and then will be paid in May."}]