[{"url": "http://www.franchisedirect.com/businessservicesfranchise/h-r-block-franchise-07148/ufoc/", "passage_text": "Country of Origin: Canada. Business Description: H&R Block offers franchises for the establishment of offices which offer to the general public income tax return preparation, related services and income tax return preparation training courses conducted for a fee. "}, {"url": "http://www.investopedia.com/articles/personal-finance/022415/hr-block-vs-turbotax-vs-jackson-hewitt.asp", "passage_text": "You file the earned income tax credit: TurboTax is the only one of these three to cover this in its free filing package. Most help at the free federal tax level: Jackson Hewitt wins here; it gives you both chat and email support. TurboTax offers chat-based support only; H&R Block offers neither at the free level. H&R Block is best known for having tax offices within driving distance of most Americans. In fiscal 2014, the company prepared 24.2 million tax returns around the world and has more than 12,000 retail locations."}, {"url": "https://www.hrblock.com/", "passage_text": "Testimonial 4 of 9. “H&R Block is an easy to use program that offers simple guidance through the tax filing process and excellent customer support.”. – Werockyourweb.com, March 26, 2015. Testimonial 5 of 9.“H&R Block is one of the elite online tax software products on the market. With logical workflows and a clean design, H&R Block simplifies the tax filing process and allows you to complete your taxes with confidence.”. – Reviews.com, March 9, 2015. Testimonial 6 of 9."}, {"url": "http://www.efile.com/tax-return-costs-preparation-prices-fees-and-free-efile/", "passage_text": "H&R Block® and TurboTax® charge a higher fee, will charge that fee PER state return, and it will vary depending on what federal return you prepare. ***Refund Anticipation Check. **** Survey of service prices quoted from H&R Block Stores as of 1/30/2015. "}, {"url": "http://community.hrblock.com/t5/All-Things-Tax/How-much-does-it-cost-at-H-amp-R-block-to-file-simple-home/td-p/24929", "passage_text": "The Community Looking at life through tax. All Things Tax : : commaz Trusted Pioneer Posts: 7 Registered: ‎02-26-2014 How much does it cost at H&R block to file simple home business taxes ‎02-26-2014 09:58 AM Hi guys.I am in my early twenties and just starting out. BarbaraA Client Support Posts: 336 Registered: ‎02-17-2014 Re: How much does it cost at H&R block to file simple home business taxes ‎02-26-2014 10:25 AM We need to know more about your specific situation to give an exact price. Our fees for a simple tax situation start at $39 for a Federal 1040EZ."}, {"url": "http://community.hrblock.com/t5/All-Things-Tax/How-much-does-it-cost-at-H-amp-R-block-to-file-simple-home/td-p/24929", "passage_text": "Re: How much does it cost at H&R block to file simple home business taxes. ‎02-26-2014 10:25 AM. 1  We need to know more about your specific situation to give an exact price. 2  Our fees for a simple tax situation start at $39 for a Federal 1040EZ. BarbaraA Client Support Posts: 336 Registered: ‎02-17-2014 Re: How much does it cost at H&R block to file simple home business taxes ‎02-26-2014 10:25 AM We need to know more about your specific situation to give an exact price."}, {"url": "http://personalfinance.costhelper.com/tax-returns.html", "passage_text": "1 Tax preparation fees at retail outlets such as H&R Block and Jackson Hewitt can run $90-$130, but Refund Anticipation Loan fees, electronic filing fees, and check cashing fees can triple the amount. 2  In March, 2006, the New York Attorney General sued H&R Block for its business practices. "}, {"url": "https://www.hrblock.ca/file-in-an-office/refund-payment/", "passage_text": "Pay no tax preparation fee up front, we'll simply deduct your fee when you receive your tax refund. Once your refund is received we'll load the balance of your refund on an H&R Block Advantage Card or deliver it directly to your bank via direct deposit. Learn more. "}, {"url": "https://en.wikipedia.org/wiki/H%2BR_Block", "passage_text": "H&R Block World Headquarters building in Kansas City, Missouri. H&R Block is a tax preparation company in the United States, claiming more than 24.5 million tax returns prepared worldwide, with offices in Canada, Australia, Brazil, and India. The Kansas City-based company also offers banking, payroll, personal finance, and business consulting services. The H&R Block Bank was chartered in 2006 and offers low-cost services to its low-to moderate-income customers. Block has said that more than one-third of its clients have no banking services, and must pay high check-cashing fees for their paychecks, as well as tax refund checks."}]