[{"url": "http://arrhythmia.org/tachycardias.html", "passage_text": "Rate If the heart rate is rapid, or greater than 100 beats a minute, it is considered a tachycardia. Alternatively, a slow heart rate, below 60 beats a minute, is known as a bradycardia."}, {"url": "http://www.hrsonline.org/Patient-Resources/Symptoms-Diagnosis/Slow-Heartbeat", "passage_text": "Slow heartbeat (heart rate), called bradycardia, is an arrhythmia, or disorder of the heart’s rhythm. Each day, a normal heart beats about 100,000 times, at a rate any­where from 60 to 100 times a minute. Changes in heart rate caused by activity, diet, medications, and age are normal and common."}, {"url": "http://www.heart.org/HEARTORG/Conditions/Arrhythmia/AboutArrhythmia/Tachycardia-Fast-Heart-Rate_UCM_302018_Article.jsp", "passage_text": "Tachycardia = Too fast. A heart rate of more than 100 beats per minute (BPM) in adults is called tachycardia. What's too fast for you may depend on your age and physical condition."}, {"url": "http://www.livestrong.com/article/278050-heart-racing-in-women/", "passage_text": "A heart rate over 100 beats per minute while at rest is considered tachycardia. The heart has a rhythm that is regulated by electrical signals which are sent across the tissues of the heart. When at rest, the normal heart rate for an adult woman is 60 to 100 beats a minute, according to Mayoclinic.com."}, {"url": "http://www.answers.com/Q/What_is_considered_a_high_pulse_rate", "passage_text": "With regards to the pulse rate, on average, a heart at rest beats 60 to 100 times per minute. Anything over 100 is considered high. A high pulse rate (tachycardia) accompanied … with low blood pressure symptoms is a dangerous condition."}, {"url": "http://chemocare.com/chemotherapy/side-effects/rapid-heart-beat.aspx", "passage_text": "A rapid or fast heartbeat is when your heart is beating faster than normal. A normal heart rate is 60 to 100 beats per minute. Tachycardia is considered a heart rate of greater than 100 beats per minute. If you are exercising, or performing any kind of activity, your heart will normally beat faster. This allows your heart to pump blood through out your body, to provide oxygen to the tissues."}]