[{"url": "http://ghr.nlm.nih.gov/gene/XPA", "passage_text": "xeroderma pigmentosum-caused by mutations in the XPA gene. At least 25 mutations in the XPA gene have been found to cause xeroderma pigmentosum. Mutations in this gene are responsible for a very severe form of the disorder that is more common in the Japanese population than in other populations. DNA can be damaged by ultraviolet (UV) rays from the sun and by toxic chemicals, radiation, and unstable molecules called free radicals. DNA damage occurs frequently, but normal cells are usually able to fix it before it can cause problems."}, {"url": "http://ghr.nlm.nih.gov/condition/xeroderma-pigmentosum", "passage_text": "Xeroderma pigmentosum is caused by mutations in genes that are involved in repairing damaged DNA. DNA can be damaged by UV rays from the sun and by toxic chemicals such as those found in cigarette smoke. Normal cells are usually able to fix DNA damage before it causes problems. The POLH gene also plays a role in protecting cells from UV-induced DNA damage, although it is not involved in NER; mutations in this gene cause the variant type of xeroderma pigmentosum. The major features of xeroderma pigmentosum result from a buildup of unrepaired DNA damage."}, {"url": "http://ghr.nlm.nih.gov/condition/xeroderma-pigmentosum", "passage_text": "It is unclear why some people with xeroderma pigmentosum develop neurological abnormalities and others do not. Inherited mutations in at least eight genes have been found to cause xeroderma pigmentosum. More than half of all cases in the United States result from mutations in the XPC, ERCC2, or POLH genes. The POLH gene also plays a role in protecting cells from UV-induced DNA damage, although it is not involved in NER; mutations in this gene cause the variant type of xeroderma pigmentosum. The major features of xeroderma pigmentosum result from a buildup of unrepaired DNA damage."}, {"url": "http://emedicine.medscape.com/article/1119902-overview", "passage_text": "In the xeroderma pigmentosum variant, a mutation occurs in DNA polymerase η. Seven complementation groups, XPA through XPG, corresponding to defects in the corresponding gene products of XPA through XPG genes, have been described. Background. Xeroderma pigmentosum (XP) was first described in 1874 by Hebra and Kaposi. In 1882, Kaposi coined the term xeroderma pigmentosum for the condition, referring to its characteristic dry, pigmented skin. Xeroderma pigmentosum is a rare disorder transmitted in an autosomal recessive manner."}, {"url": "http://dnaftb.org/28/problem.html", "passage_text": "Cross pure-bred pea plants to identify dominant flower color. HI! Xeroderma pigmentosum (XP) is a recessive hereditary disease that causes extreme sensitivity to ultraviolet light. Most patients die at a young age after exposure to the sun causes skin cancer. James Cleaver hypothesized that a defect in a DNA repair system caused the disease. "}, {"url": "http://ghr.nlm.nih.gov/gene/XPA", "passage_text": "When xeroderma pigmentosum is caused by XPA gene mutations, it is often associated with progressive neurological abnormalities. These nervous system problems include hearing loss, poor coordination, difficulty walking, movement problems, loss of intellectual function, difficulty swallowing and talking, and seizures. DNA can be damaged by ultraviolet (UV) rays from the sun and by toxic chemicals, radiation, and unstable molecules called free radicals. DNA damage occurs frequently, but normal cells are usually able to fix it before it can cause problems."}, {"url": "http://atlasgeneticsoncology.org/Kprones/XerodermaID10004.html", "passage_text": "Clinics. Note. xeroderma pigmentosum (XP) is caused by a defect in nucleotide excision repair mechanisms; various clinical aspects and intensity of signs are described according to the gene involved (7 known complement groups) and type of mutation. "}, {"url": "http://www.cancer.net/cancer-types/xeroderma-pigmentosum", "passage_text": "Xeroderma pigmentosum (XP) is a hereditary condition characterized by extreme sun sensitivity, leading to a very high risk of skin cancer. Eye problems are also common. They also have very dry skin. There is a high risk of squamous cell and basal cell skin cancers and melanoma. People with XP also have eye problems, especially with the eyelids."}, {"url": "http://ghr.nlm.nih.gov/condition/xeroderma-pigmentosum", "passage_text": "Xeroderma pigmentosum, which is commonly known as XP, is an inherited condition characterized by an extreme sensitivity to ultraviolet (UV) rays from sunlight. The POLH gene also plays a role in protecting cells from UV-induced DNA damage, although it is not involved in NER; mutations in this gene cause the variant type of xeroderma pigmentosum. The major features of xeroderma pigmentosum result from a buildup of unrepaired DNA damage."}, {"url": "http://misc.medscape.com/pi/iphone/medscapeapp/html/A1119902-business.html", "passage_text": "In the xeroderma pigmentosum variant, a mutation occurs in DNA polymerase η. [5, 6]. Seven complementation groups, XPA through XPG, corresponding to defects in the corresponding gene products of XPA through XPG genes, have been described. "}]