[{"url": "http://www.mrsi.in/", "passage_text": "The Market Research Society of India (MRSI) is not for profit autonomous body established by the fraternity of researchers spread across India in 1988."}, {"url": "https://www.linkedin.com/company/mrsi-marketing-research-services-inc.-", "passage_text": "MRSI was acquired by ORC International effective January 1, 2013. ORC International is a leading global research firm. We invite you to learn more about our expanded capabilities in the areas of Customer, Employee, Markets & Products, and Strategy Research."}, {"url": "http://www.mrsi.org/", "passage_text": "Mountain Regional Services, Inc. (MRSI) is a nationally accredited provider of disability services. "}, {"url": "http://800notes.com/Phone.aspx/1-513-562-1300", "passage_text": "Received a call, no voice mail. The caller ID displayed MRSI. I called the number back on another phone and got the message that the number is no longer in service. I believe it is Marketing Research Services Inc based on earlier comments below."}, {"url": "http://www.nhs.uk/Conditions/MRSA/Pages/Introduction.aspx", "passage_text": "MRSA is a type of bacteria that's resistant to a number of widely used antibiotics. This means MRSA infections can be more difficult to treat than other bacterial infections. The full name of MRSA is meticillin-resistant Staphylococcus aureus. You may have heard it called a superbug."}, {"url": "http://midwestreproductionsymposium.org/about-mrsi.php", "passage_text": "About Us. The Midwest Reproductive Symposium International (MRSi) was designed in 2005 to promote the timely discussion of topics relevant to reproductive medicine."}, {"url": "http://businessdirectory.bizjournals.com/cincinnati/advertising_and_marketing/2255689/mrsi--marketing-research-services--inc.html", "passage_text": "Since 1973, MRSI has helped clients solve business challenges with insightful, strategic marketing research designed for their specific needs."}, {"url": "http://www.mrsisystems.com/about-us/", "passage_text": "Our headquarters is located in a 50,000 square building in Billerica, MA in the greater Boston area. MRSI’s sales are supported by a global network of direct service and support professionals located in Singapore, Taiwan, Korea, Israel, Malaysia, the Netherlands, China, the Philippines, and the United States."}, {"url": "http://www.mrsisystems.com/", "passage_text": "MRSI is a leading supplier of high precision dispense and assembly equipment for the semiconductor and microelectronics industry. It offers systems for the manufacture of IR sensors, print heads, MCMs, hybrid circuits, MEMs devices, and medical imaging components, such as CT scanners."}]