[{"url": "https://en.wikipedia.org/wiki/Wilderness", "passage_text": "The WILD Foundation states that wilderness areas have two dimensions: they must be biologically intact and legally protected. The World Conservation Union (IUCN) classifies wilderness at two levels, Ia (Strict Nature Reserves) and Ib (Wilderness Areas). Activities on the margins of specific wilderness areas, such as fire suppression and the interruption of animal migration also affect the interior of wildernesses. Especially in wealthier, industrialized nations, it has a specific legal meaning as well: as land where development is prohibited by law."}, {"url": "http://www.protectwildutah.org/faq/wilderness.html", "passage_text": "A wilderness area is designated land set aside by Congress to preserve its wild state and all of the values associated with that wilderness  scenic beauty, solitude, wildlife, geological features, archaeological sites, and other features of scientific, educational, or historical value. Wilderness areas are defined as roadless areas on public lands that have been designated by Congress to be preserved in a primitive condition. Parts of many National Parks are also preserved in a largely natural condition in which roads, mechanical devices and permanent structures are not allowed."}, {"url": "https://en.wikipedia.org/wiki/Wilderness", "passage_text": "Wilderness or wildland is a natural environment on Earth that has not been significantly modified by civilized human activity. Activities on the margins of specific wilderness areas, such as fire suppression and the interruption of animal migration also affect the interior of wildernesses. Especially in wealthier, industrialized nations, it has a specific legal meaning as well: as land where development is prohibited by law."}, {"url": "http://apa.ny.gov/State_Land/Definitions.htm", "passage_text": "The Adirondack wilderness may be considered the wonder and glory of New York. It is a vast natural park, one immense and silent forest, curiously and beautifully broken by gleaming waters of a myriad of lakes, between which rugged mountain ranges rise as a sea of granite billows.. A wild forest area is further defined as an area that frequently lacks the sense of remoteness of wilderness, primitive or canoe areas and that permits a wide variety of outdoor recreation. An intensive use area is an area where the state provides facilities for intensive forms of outdoor recreation by the public."}, {"url": "http://www.wilderness.net/NWPS/WhatIsWilderness", "passage_text": "Wilderness is the land that was-wild land beyond the frontier...land that shaped the growth of our nation and the character of its people. Wilderness is the land that is-rare, wild places where one can retreat from civilization, reconnect with the Earth, and find healing, meaning and significance. Wilderness is an indispensable part of American history, however, people have held various perspectives of wilderness throughout time. Historical events and articles, pamphlets, stories and books authored about wilderness and the environment tell us a story of shifting perceptions"}, {"url": "http://www.blm.gov/ca/st/en/prog/wilderness/wa.html", "passage_text": "Only federal land designated by Congress as wilderness, becomes part of the National Wilderness Preservation System. According to the Wilderness Act, federal lands must have certain special characteristics to be considered for wilderness preservation: 1  They must be in a generally natural condition. 2  They must have outstanding opportunities for solitude or a primitive and unconfined type of recreation. 1 They must have outstanding opportunities for solitude or a primitive and unconfined type of recreation. 2  They must be at least 5,000 acres or large enough to preserve and use as wilderness. 3  They may also contain ecological, geological, or other features of scientific, scenic, or historical value."}, {"url": "https://en.wikipedia.org/wiki/Wilderness", "passage_text": "The word wilderness derives from the notion of wildness—in other words, that which is not controlled by humans. The mere presence or activity of people does not disqualify an area from being wilderness.. Activities on the margins of specific wilderness areas, such as fire suppression and the interruption of animal migration also affect the interior of wildernesses. Especially in wealthier, industrialized nations, it has a specific legal meaning as well: as land where development is prohibited by law."}, {"url": "http://www.wilderness.net/index.cfm?fuse=NWPS&sec=designation", "passage_text": "Search. This figure presents a simplified schematic of the wilderness designation process, and this process is different depending on who recommends an area for wilderness designation (state or Federal land management agencies, organized groups, individuals, you). "}, {"url": "https://en.wikipedia.org/wiki/Wilderness_area", "passage_text": "A wilderness area is a region where the land is in a natural state; where impacts from human activities are minimal—that is, as a wilderness. It might also be called a wild or natural area. Especially in wealthier, industrialized nations, it has a specific legal meaning as well: as land where development is prohibited by law. Many nations have designated Wilderness Areas, including Australia, Canada, New Zealand, South Africa and the United States."}]