[{"url": "http://legacy.hopkinsville.kctcs.edu/instructors/Jason-Arnold/VLI/m1DNAfunction/m1DNAfunction_print.html", "passage_text": "A segment of DNA that contains the recipe for building one protein is called a gene. Genes occur on chromosomes. Mutations in genes can cause metabolic errors and genetic diseases. Without an understanding of DNA structure, it was unclear to scientists how DNA was used by cells. From DNA to RNA to Protein. In order to synthesize a protein, the genetic information in the DNA must be converted to an amino acid sequence. Its similar to the way that someone needs to read a recipe and mix the correct ingredients together. Step 1- Transcription involves the synthesis of mRNA from template DNA."}, {"url": "http://www2.le.ac.uk/departments/genetics/vgec/schoolscolleges/topics/dna-genes-chromosomes", "passage_text": "DNA. DNA (or deoxyribonucleic acid) is the molecule that carries the genetic information in all cellular forms of life and some viruses. It belongs to a class of molecules called the nucleic acids, which are polynucleotides-that is, long chains of nucleotides. Each nucleotide consists of three components:"}, {"url": "http://science.howstuffworks.com/life/cellular-microscopic/dna4.htm", "passage_text": "­DNA carr­ies all of the information for your physical characteristics, which are essentially determined by proteins. So, DNA contains the instructions for making a protein. In DNA, each protein is encoded by a gene (a specific sequence of DNA nucleotides that specify how a single protein is to be made). Specifically, the order of nucleotides within a gene specifies the order and types of amino acids that must be put together to make a protein."}, {"url": "http://www.livescience.com/37247-dna.html", "passage_text": "DNA structure. DNA is made up of molecules called nucleotides. Each nucleotide contains a phosphate group, a sugar group and a nitrogen base. The four types of nitrogen bases are adenine (A), thymine (T), guanine (G) and cytosine (C). The order of these bases is what determines DNA's instructions, or genetic code. "}, {"url": "http://ghr.nlm.nih.gov/handbook/basics/dna", "passage_text": "Most DNA is located in the cell nucleus (where it is called nuclear DNA), but a small amount of DNA can also be found in the mitochondria (where it is called mitochondrial DNA or mtDNA). The information in DNA is stored as a code made up of four chemical bases: adenine (A), guanine (G), cytosine (C), and thymine (T). DNA is a double helix formed by base pairs attached to a sugar-phosphate backbone. DNA, or deoxyribonucleic acid, is the hereditary material in humans and almost all other organisms. Nearly every cell in a person’s body has the same DNA."}, {"url": "http://www2.le.ac.uk/departments/genetics/vgec/highereducation/topics/dnageneschromosomes", "passage_text": "They contain the information our bodies need to make chemicals called proteins. Proteins form the structure of our bodies, as well playing an important role in the processes that keep us alive. Genes are made of a chemical called DNA, which is short for 'deoxyribonucleic acid'. The DNA molecule is a double helix: that is, two long, thin strands twisted around each other like a spiral staircase. Chromosomes. If you took the DNA from all the cells in your body and lined it up, end to end, it would form a strand 6000 million miles long (but very, very thin)! To store this important material, DNA molecules are tightly packed around proteins called histones to make structures called c"}, {"url": "http://ghr.nlm.nih.gov/handbook/basics?show=all", "passage_text": "An important property of DNA is that it can replicate, or make copies of itself. Each strand of DNA in the double helix can serve as a pattern for duplicating the sequence of bases. This is critical when cells divide because each new cell needs to have an exact copy of the DNA present in the old cell. DNA is a double helix formed by base pairs attached to a sugar-phosphate backbone. DNA, or deoxyribonucleic acid, is the hereditary material in humans and almost all other organisms. Nearly every cell in a person’s body has the same DNA."}, {"url": "http://ghr.nlm.nih.gov/handbook/basics?show=all", "passage_text": "Mitochondria (illustration). Mitochondria are complex organelles that convert energy from food into a form that the cell can use. They have their own genetic material, separate from the DNA in the nucleus, and can make copies of themselves. DNA is a double helix formed by base pairs attached to a sugar-phosphate backbone. DNA, or deoxyribonucleic acid, is the hereditary material in humans and almost all other organisms. Nearly every cell in a person’s body has the same DNA."}, {"url": "http://www.biology-online.org/9/4_genetic_information.htm", "passage_text": "Genes are sequences of DNA nucleotides that carry and transmit the information specifying amino acid sequences for protein synthesis. Each DNA molecule contains many genes. The genome refers collectively to the total genetic information coded in a cell. Each chromosome is packaged with proteins called histones. The complex of chromosome and histones are called nucleosomes. RNA molecules are responsible for transferring information from DNA to the site of protein synthesis. RNA molecules themselves are synthesized according to the information coded in DNA."}, {"url": "http://ghr.nlm.nih.gov/handbook/basics?show=all", "passage_text": "The information in DNA is stored as a code made up of four chemical bases: adenine (A), guanine (G), cytosine (C), and thymine (T). Human DNA consists of about 3 billion bases, and more than 99 percent of those bases are the same in all people. DNA is a double helix formed by base pairs attached to a sugar-phosphate backbone. DNA, or deoxyribonucleic acid, is the hereditary material in humans and almost all other organisms. Nearly every cell in a person’s body has the same DNA."}]