[{"url": "http://www.cat-world.com.au/the-cost-of-owning-a-cat", "passage_text": "Cat-This is hard to put a price on. Some people will obtain a cat for free from a friend or neighbour, some the shelter, pet shop or registered breeder. Breeds vary in price but range from $500 - 1000. Shelter cats are usually around the $100 - 150 range."}, {"url": "http://www.answers.com/Q/How_much_does_a_cat_check_up_cost", "passage_text": "Usually 20$ to 50$. Sometimes a check up is a ripoff. One time my rabbit needed a checkup and the vet started looking at him and touching him all in five minutes. It came out … to bt 43$!!!"}, {"url": "http://www.vetinfo.com/average-yearly-cat-vet-costs.html", "passage_text": "The cost of vaccinations is between $50 and $100. The cat should also get some flea treatment or preventive solutions, which may cost from $50 to $150. Heartworm prevention is recommended, and may cost up to $40. The cat should also be checked out by a vet, to make sure there are no problems; the vet bills may be between $50 (for a simple check up) to $300 for advanced tests, if these are needed."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20090829073910AA1NqVy", "passage_text": "To just have your typical yearly checkup done, it's not very expensive-all vets have a flat rate for this, and they'll tell you what it is on the phone if you call to ask. Mine charges $40 per cat for a checkup, $38 if you're coming in for a re-check or for a non-yearly checkup. You'll get charged whatever this is just for coming in, it's like the fee to reserve the half hour of the vet's time."}, {"url": "http://www.cat-world.com.au/the-cost-of-owning-a-cat", "passage_text": "Vaccinations-Again, if your cat hasn't been vaccinated when you obtain it, you will need to organise it through your vet. Vaccinations are a good chance to meet your vet and introduce him to your new cat. A vaccination will cost in the range of $50 - $70. Kittens require three vaccinations in their first year. Cat carrier-These range from $30 - $50 and are necessary as you will need one to take your cat to the vet. Food and water bowls-These can be as cheap or expensive as you want."}]