[{"url": "http://www.spectacle.org/197/nation.html", "passage_text": "Now, the essence of a nation is that all its people have a great deal in common, and also that they have forgotten a great deal. What Renan meant by this is that a nation, in the words of Benedict Anderson, is an imagined community, a group of people sharing a common story, a community by choice. "}, {"url": "http://www.towson.edu/polsci/ppp/sp97/realism/whatisns.htm", "passage_text": "In a nutshell. . . The terms nation, state, country and nation-state are used to refer to political, economic, social and cultural actors in the international system. The modern nation-state refers to a single or multiple nationalities joined together in a formal political union. A nation-state differs from a state or a nation for a couple of important reasons: A nation refers only to a socio-cultural entity, a union of people sharing who can identify culturally and linguistically. This concept does not necessarily consider formal political unions."}, {"url": "http://www.unesco.org/new/en/social-and-human-sciences/themes/international-migration/glossary/nation-state/", "passage_text": "The nation-state is one where the great majority are conscious of a common identity and share the same culture 1. The nation-state is an area where the cultural boundaries match up with the political boundaries. The ideal of 'nation-state' is that the state incorporates people of a single ethnic stock and cultural traditions 2. However, most contemporary states are polyethnic"}, {"url": "http://geography.about.com/cs/politicalgeog/a/statenation.htm", "passage_text": "The term country can be used interchangeably with State (note the capital S). A nation, however, is a tightly-knit group of people that share a common culture. Nations do not necessarily live within a single country; however, a nation-state is a nation which has the same borders as a State. "}, {"url": "http://www.differencebetween.com/difference-between-country-and-vs-nation/", "passage_text": "So, while a country has a land of its own, a nation does not necessarily have to own a territory to call themselves a nation. For example, the Kurdish people though they do not live inside the same boundaries (they live in Iran, Iraq and Turkey) consider themselves as the members of the Kurdish nation. Kurdish people. "}, {"url": "https://en.wikipedia.org/wiki/Nation_state", "passage_text": "A nation state is a geographical area that can be identified as deriving its political legitimacy from serving as a sovereign nation. A state is a political and geopolitical entity, while a nation is a cultural and ethnic one. The term nation state implies that the two coincide, but nation state formation can take place at different times in different parts of the world. The model of the nation state implies that its population constitutes a nation, united by a common descent, a common language and many forms of shared culture. When the implied unity was absent, the nation state often tried to create it."}, {"url": "https://en.wikipedia.org/wiki/Nation_state", "passage_text": "The concept of a nation state can be compared and contrasted with that of the multinational state, city state, empire, confederation, and other state formations with which it may overlap. The key distinction is the identification of a people with a polity in the nation state.. The model of the nation state implies that its population constitutes a nation, united by a common descent, a common language and many forms of shared culture. When the implied unity was absent, the nation state often tried to create it."}, {"url": "http://www.enotes.com/homework-help/what-makes-nation-what-contributes-nationalism-177673", "passage_text": "Very closely related to the concept of nation is the concept of a state. A nation is a group of people who share a common feeling of national unity. A state is an area of land whose people have an independent government. Posted on. (Answer #1). What makes a nation differs from country to country. In some countries, it is ethnicity that makes a nation. You can see this in countries like Japan where the nationality and the ethnicity go so closely together. In other countries, like the United States, the nation is made by allegiance to the same set of values and ideals"}]