[{"url": "http://www.indeed.com/salary/q-Teacher-l-Texas.html", "passage_text": "Average Teacher salaries for job postings in Texas are 3% lower than average Teacher salaries for job postings nationwide."}, {"url": "http://work.chron.com/average-beginning-teacher-salaries-1364.html", "passage_text": "As of 2011, 20 states reported average starting salaries for teachers that were less than $30,000. First-year teachers in Oklahoma, Missouri and Nebraska averaged between $29,000 and $30,000. Mississippi, New Hampshire, South Carolina and Arkansas reported starting salaries of between $28,000 and $29,000."}, {"url": "http://www.artteacheredu.org/texas/texas-salary/", "passage_text": "Texas Art Teacher Salaries. According to the National Education Association, the average starting salary for teachers in Texas (as of the 2012-2013 school year) is $38,091, somewhat higher than the national average of $36,141."}, {"url": "http://work.chron.com/average-beginning-teacher-salaries-1364.html", "passage_text": "National Pay Scale. According to industry website Teacher Portal, the average starting salary for teachers was $33,950 as of 2011. During the first one to four years, average pay increased to $35,873, while teachers with five to nine years of experience reported annual salaries that averaged $41,391."}, {"url": "http://www.teacherportal.com/salary/Texas-teacher-salary", "passage_text": "Fortunately, Texas pays new teachers well-Texas teacher starting salaries start at $38,091. It obviously depends on the school district-Houston Independent School District (or ISD), Austin ISD, Dallas ISD, El Paso ISD, etc. all range greatly in pay. You'll want to search for those districts separately."}, {"url": "http://www.peteacheredu.org/texas/texas-salary/", "passage_text": "Salary data compiled by the Texas Workforce Commission indicates that the median and average phys ed teacher salary in Texas is $56,764 and $59,845 respectively, which is a difference of only 5%. The average starting wage is $27,890 per year, but the average experience range salary is 36.8% higher at $75,822."}, {"url": "http://work.chron.com/average-salary-teachers-south-texas-25340.html", "passage_text": "According to the Bureau of Labor Statistics, preschool teachers in Texas earned an average of $33,010 per year in 2012. Those in nonmetropolitan areas tended to earn low pay, with a reported average salary of $32,190 in nonmetropolitan southern Texas and $33,740 in nonmetropolitan Gulf Coast Texas."}, {"url": "http://work.chron.com/average-salary-teachers-south-texas-25340.html", "passage_text": "The average salaries for college professors in Texas range widely by subject area, from a high of $111,930 for health specialties teachers to a low of $56,010 for art and music professors."}, {"url": "http://www.indeed.com/salary/q-Teacher-l-Houston,-TX.html", "passage_text": "Average Teacher salaries for job postings in Houston, TX are 13% higher than average Teacher salaries for job postings nationwide."}]