[{"url": "http://www.nasa.gov/topics/earth/features/20100108_Is_Antarctica_Melting.html", "passage_text": "The continent of Antarctica has been losing more than 100 cubic kilometers (24 cubic miles) of ice per year since 2002. Larger Image. There has been lots of talk lately about Antarctica and whether or not the continent's giant ice sheet is melting. One new paper 1, which states there’s less surface melting recently than in past years, has been cited as proof that there’s no global warming. There is a continent about the size of Australia underneath all this ice; the ice sheet sitting on top averages at a little over 2 kilometer (1.2 miles) thick. If all of this ice melted, it would raise global sea level by about 60 meter (197 feet)."}, {"url": "http://www.answers.com/Q/Why_is_Antarctica_melting", "passage_text": "Yes parts of Antarctica are melting, mainly the tip that juts out towards South America, but as a whole Antarctica has added .8% of ice per decade since 1970. So o … verall Antarctica is gaining ice mass. This is  building up in the centre of the continent. Warmer waters are  causing more ice shelves to split from the coasts, so the overall  result is less ice.     A:  The Antarctic ice pack is at its highest coverage in decades, and  continues to grow. Antarctica is not melting at this time."}, {"url": "http://www.nasa.gov/topics/earth/features/20100108_Is_Antarctica_Melting.html", "passage_text": "Known as East Antarctica, this section has an average altitude of about 2 kilometer (1.2 miles), higher than the American Colorado Plateau. There is a continent about the size of Australia underneath all this ice; the ice sheet sitting on top averages at a little over 2 kilometer (1.2 miles) thick. If all of this ice melted, it would raise global sea level by about 60 meter (197 feet). But little, if any, surface warming is occurring over East Antarctica"}, {"url": "http://www.answers.com/Q/Why_is_Antarctica_melting", "passage_text": "Antarctica is melting, but it is like a giant mirror. The sun  shines on Antarctica and it reflects back out to space. It is also  extremely cold (the record is: −89.2 °C … (−128.6 °F) at Vostok  Station), so it's difficult to see the changes. This is  building up in the centre of the continent. Warmer waters are  causing more ice shelves to split from the coasts, so the overall  result is less ice.     A:  The Antarctic ice pack is at its highest coverage in decades, and  continues to grow. Antarctica is not melting at this time."}, {"url": "http://www.csmonitor.com/Science/2014/1204/Why-is-Antarctica-melting-Scientists-reveal-clues", "passage_text": "Ocean waters around Antarctica have warmed steadily for the past 40 years, according to a new study. Some shallow areas have also heated more quickly than others, and waters around Antarctica are growing less salty in some regions, researchers reported today (Dec. 4) in the journal Science. Though Antarctica's land ice is melting, its seasonal sea ice is growing slightly larger each winter. Scientists think this freeze-up is related to more freshwater at the ocean surface."}, {"url": "http://www.cnn.com/2014/05/12/us/nasa-antarctica-ice-melt/index.html", "passage_text": "The rate at which the area's ice is melting has increased 77% since 1973, and there are several reasons, researchers said. The ice sheet there, unlike those in much of east Antarctica, is attached to a bed below sea level. That means ocean currents can deliver warm water at the glaciers' base, or grounding lines -- places where the ice attaches to the bed, NASA said."}, {"url": "http://www.answers.com/Q/Why_is_the_ice_melting_in_Antarctica", "passage_text": "The reason the ice in the Antarctica does not melt away when sunlight shines upon it is because the whiteness of the ice reflects most of the light back into space. But as a r … esult of global warming, much more ice are being melted now than before. And thus without the ice, more sea will appear. Approximately 100 cubic kilometers (24 cubic miles) of ice melts in Antarctica every year (NASA's Grace satellite). East Antarctica is a high, cold, desert plateau. Satelli … te data show a little mass loss at the edges, but this is counterbalanced by a buildup of snow in the centre."}, {"url": "http://ossfoundation.us/projects/environment/global-warming/antarctic-ice-melt", "passage_text": "Antarctica is losing ice mass while gaining ice extent. This is a confusing point to some. There are a few keys that can help us understand what this means in the context of global warming. Land ice is different than sea ice. Antarctica is melting, not growing. In fact the ice mass is dropping at an accelerating rate due to multiple factors including accelerated glacial ice calving rates. The loss of sea based ice allows the Antarctic ice to move faster towards the ocean resulting in an increased rate of loss of the Antarctic ice."}, {"url": "http://www.answers.com/Q/Why_is_Antarctica_melting", "passage_text": "Where is Antarctica melting? Antarctica is a continent, and continents do not melt. However, the  ice shelves attached to 44% of the continent are disintegrating,  due to the warming of the Southern Oce … an.   The ice sheet that covers 98% of the continent melts and freezes  cyclically. This is  building up in the centre of the continent. Warmer waters are  causing more ice shelves to split from the coasts, so the overall  result is less ice.     A:  The Antarctic ice pack is at its highest coverage in decades, and  continues to grow. Antarctica is not melting at this time."}]