[{"url": "https://quizlet.com/25767981/atlas-a-practice-exam-flash-cards/", "passage_text": "The most superficial wall of the pleural cavity is lined by the _____, whereas the outer surface of the lungs is covered by _____. In the appendicular region, the wrist is called the _____ region, and the ankle is called the ___________ region."}, {"url": "http://www.answers.com/Q/What_is_the_most_superior_segment_of_the_upper_limb_called", "passage_text": "1 The Five Major Parts of the Brain At its most basic, the brain controls the body. 2  Electrical impulses are sent along the nervous system to and from the brain that regulate all movement. 3  The brain and the nerv…. 4  The Invention of Prosthetic Limbs Prosthetic limbs form a major part of modern medicine. Share to: 1  The Five Major Parts of the Brain At its most basic, the brain controls the body. 2"}, {"url": "http://www.interactive-biology.com/4441/a-brief-introduction-to-the-upper-limb/", "passage_text": "Forearm. The forearm is said to be the second longest segment of the upper limb. It extends from the elbow and the wrist. It is composed of an anterior and posterior compartment. The upper limb is the region of the skeleton that is known for its mobility and dexterity. It is the area of the skeleton that is able to grasp, strike and conduct fine motor skills. It is supported and stabilized by various muscles attached to the ribs and vertebrae. The upper limb consists of four major parts:"}, {"url": "http://teachmeanatomy.info/upper-limb/bones/clavicle/", "passage_text": "Clinical Relevance: Fracture of the Clavicle. A function of the clavicle is to transmit forces from the upper limb to the axial skeleton. Thus, the clavicle is the most commonly fractured bone in the body. Fractures commonly result from a fall onto the shoulder, or onto an outstretched hand. The clavicle (collarbone) extends between the sternum and the acromion of the scapula. It is classed as a long bone, and can be palpated along its length. In thin individuals, it is visible under the skin. The clavicle has three main functions: 1  Attaches the upper limb to the trunk."}, {"url": "https://en.wikipedia.org/wiki/Upper_limb", "passage_text": "In formal usage, the term arm only refers to the structures from the shoulder to the elbow, explicitly excluding the forearm, and thus upper limb and arm are not synonymous. However, in casual usage, the terms are often used interchangeably. The muscles of the upper limb are innervated segmentally proximal to distal so that the proximal muscles are innervated by higher segments (C5–C6) and the distal muscles are innervated by lower segments (C8–T1). Motor innervation of upper limb by the five terminal nerves of the brachial plexus :"}, {"url": "http://studydroid.com/index.php?page=viewPack&packId=372173", "passage_text": "2) The ___ region of the left lower limb is proximal to the ____ region of the same limb. a) Carpal; manual. b) Femoral; crural. c) Antebrachial; brachial. d) Tarsal; crural. e) Brachial; femoral. b. 3) The ______ wraps around stomach, small intestine, and large intestine. "}, {"url": "http://www.answers.com/Q/What_is_the_most_superior_segment_of_the_upper_limb_called", "passage_text": "arm is a part of the upperlimb the upper limb consists of the arm, forearm and hand arm is a part of the upperlimb the upper limb consists of the arm, forearm and hand. Edit. Share to: 1  The Five Major Parts of the Brain At its most basic, the brain controls the body. 2  The Invention of Prosthetic Limbs Prosthetic limbs form a major part of modern medicine."}, {"url": "http://www.answers.com/Q/What_is_the_most_superior_segment_of_the_upper_limb_called", "passage_text": "What is the most superior segment of the upper limb called? already exists. already exists as an alternate of this question. exists and is an alternate of. You've been a busy guy in 2014. What can Danny Huston fans expect from you in 2015? What major abductor is in the upper limb? The bulge in the spinal cord that gives off nerves to the upper ... Share to: 1  The Five Major Parts of the Brain At its most basic, the brain controls the body. 2  The Invention of Prosthetic Limbs Prosthetic limbs form a major part of modern medicine."}, {"url": "https://en.wikipedia.org/wiki/Upper_limb", "passage_text": "The upper limb or upper extremity is the region in an animal extending from the deltoid region to the hand, including the arm, axilla and shoulder. Contents. The muscles of the upper limb are innervated segmentally proximal to distal so that the proximal muscles are innervated by higher segments (C5–C6) and the distal muscles are innervated by lower segments (C8–T1). Motor innervation of upper limb by the five terminal nerves of the brachial plexus :"}]