[{"url": "http://www.answers.com/Q/Which_of_the_four_major_islands_is_least_densely_populated", "passage_text": "The main island of Japan, Honshu, is the most densely populated of Japan's four major islands. The next most densely populated island is Kyushu, followed by Shikoku and Hokkaido."}, {"url": "http://www.answers.com/Q/Which_of_the_four_major_islands_is_least_densely_populated", "passage_text": "Answered by The Community. Making the world better, one answer at a time. The main island of Japan, Honshu, is the most densely populated of Japan's four major islands. The next most densely populated island is Kyushu, followed by Shikoku and Hokkaido."}, {"url": "http://geography.about.com/od/japanmaps/tp/japan-islands.htm", "passage_text": "Shikoku is the smallest of Japan's main islands with a total area of 7,260 square miles (18,800 sq km). This area is made up of main island as well as the small islets surrounding it. It is located to the south of Honshu and to the east of Kyushu and has a population of 4,414,955 (2005 estimate) (map)."}, {"url": "http://www.hoteltravel.com/japan/guides/overview.htm", "passage_text": "Hokkaido is the second largest of the Japanese islands, but the least populated. As Japan’s northernmost island, snowfall is abundant, making it the main winter resort and sport area in Japan. The island’s capital of Sapporo hosted the 1972 Winter Olympics."}, {"url": "http://www.answers.com/Q/Which_of_the_4_major_islands_of_japan_is_least_densely_populated", "passage_text": "Which of the four major islands is least densely populated? The main island of Japan, Honshu, is the most densely populated of  Japan's four major islands. The next most densely populated island  is Kyushu, followed by Shikoku and Ho … kkaido."}, {"url": "http://www.answers.com/Q/Which_of_the_4_major_islands_of_japan_is_least_densely_populated", "passage_text": "Shikoku is the smallest and most mountainous of the 4 major Japanese islands, and so its population is also smaller (about 4.2 million in 2008)."}]