[{"url": "http://andrewnoske.com/wiki/Virtual_reality_glasses", "passage_text": "In the videos below I demonstrate how you can make your own inexpensive 3D glasses (first video) and goggles (second video). YouTube Video: ....... How to build your own poor mans virtual reality glasses. Length: ..... 7 mins 37 seconds (building glasses is first 2 mins). read script"}, {"url": "http://www.dhgate.com/wholesale/virtual+reality+glasses.html", "passage_text": "Get cheap virtual reality glasses, optical stores, free 3d glasses online from China driving glasses wholesalers. DHgate.com helps you spend less money on more high quality virtual reality glasses. Hope you have a happy shopping experience."}, {"url": "http://www.popsci.com/diy/article/2013-01/build-your-own-diy-virtual-reality-glasses", "passage_text": "STEP 6. Don your virtual-reality glasses, and take a walk someplace far, far away. This project was excerpted from The Big Book Of Hacks: 264 Amazing DIY Tech Projects, a compendium of ingenious and hilarious projects for aspiring makers. Buy it here."}, {"url": "http://venturebeat.com/2015/04/06/wearalitys-virtual-reality-goggles-may-look-dorky-but-theyll-be-cheap-at-69/", "passage_text": "The Wearality Sky is like a huge pair of glasses, with an attachment that allows you to drop a large-screen smartphone into a holder a couple of inches from the lenses. And while they look goofy, they’re a lot more comfortable for viewing than attaching a heavy Samsung Gear VR virtual reality headset to your face."}, {"url": "http://www.youtube.com/watch?v=eT9vmpE8WcY", "passage_text": "Google surprised everyone at its I/O conference by giving out Cardboard, a cardboard-craft kit to make virtual reality goggles when paired with a Nexus 5 smartphone. We got our hands on a this experimental kit, assemble it, and test out Google's vision for low-cost VR. 1  Science & Technology."}, {"url": "http://andrewnoske.com/wiki/Virtual_reality_glasses", "passage_text": "1 How to make virtual reality goggles from safety goggles-uses safety goggles and cardboard-no stereo pair, but demonstrates on regular street-view. 2  OculusVR / Oculus Rift. 3  OpenDive-amazon kit open dive g+ community. 4  Poppy3D-a great VR system for taking videos and watching 3D for iPhones..."}, {"url": "http://venturebeat.com/2015/04/06/wearalitys-virtual-reality-goggles-may-look-dorky-but-theyll-be-cheap-at-69/", "passage_text": "From VentureBeat. Wearality ‘s virtual reality glasses sure look dorky, like the biggest pair of Coke bottle glasses you’ve ever seen. But the glasses use innovative optics that make it much easier — and cheaper — to view and enjoy virtual reality applications. Think of it as a View-Master for virtual reality."}, {"url": "http://money.cnn.com/2012/06/27/technology/google-glasses/index.htm", "passage_text": "SAN FRANCISCO (CNNMoney) -- Google's science-fiction-like virtual reality glasses will start shipping next year with a price tag of $1,500 -- but most buyers won't be able to get their hands on a pair just yet."}]