[{"url": "http://www.answers.com/Q/Why_did_Germany_invade_Denmark_and_Norway_in_World_War_2", "passage_text": "Germany invaded the following countries during World War Two: Poland, Denmark, Norway, Netherlands, Belgium, Luxemburg, France, Yugoslavia, Greece, Egypt (colony of Great Bri … tain), and the Soviet Union. Yes Norway was occupied by Germany in World War 2. Trust me this is real, I had to do a report on Norway, Denmark, Sweden, Finland, Poland, and Germany."}, {"url": "http://www.historylearningsite.co.uk/world-war-two/world-war-two-in-western-europe/the-attack-on-western-europe/the-invasion-of-norway-1940/", "passage_text": "The invasion of Norway 1940. Norway was invaded by Nazi Germany on April 9th 1940. Hitler had issued the order for the invasion of Norway on March 1st under the code word “Weseruebung”. Weserübung the order also included the invasion and occupation Of. denmark Norway was invaded by Nazi Germany on April 9th 1940. Hitler had issued the order for the invasion of Norway on March 1st under the code word “Weseruebung”. Weserübung the order also included the invasion and occupation Of. Denmark it was the start of war In Western – europe and an end to ‘The Phoney’. war"}, {"url": "http://www.ducksters.com/history/world_war_ii/ww2_in_europe.php", "passage_text": "After Poland was defeated, the country was divided up between Germany and the Soviet Union. Even though France and Great Britain declared war on Germany in 1939, there wasn't a lot of fighting at first. It was in April of 1940 when Germany went on the attack again. On April 9, 1940 Germany invaded Norway and Denmark. Next, he took part of Czechoslovakia. The other European countries didn't want war, so they didn't do anything. Finally, when Germany invaded Poland in 1939, the other countries knew he would not stop. France and Great Britain declared war on Germany and World War II had begun."}, {"url": "https://en.wikipedia.org/wiki/Invasion_of_Poland", "passage_text": "The invasion was referred to by Germany as the 1939 Defensive War since Hitler proclaimed that Poland had attacked Germany and that Germans in Poland are persecuted with a bloody terror and are driven from their homes. None of the parties to the conflict—Germany, the Western Allies or the Soviet Union—expected that the German invasion of Poland would lead to a war that would surpass World War I in its scale and cost."}, {"url": "http://www.answers.com/Q/Why_did_Germany_invade_Denmark_and_Norway_in_World_War_2", "passage_text": "Furthermore, having control of Denmark would secure the Baltic Sea for Germany and the Soviet Union (Germany had an alliance with the Soviet Union). Plus, Denmark was a Nordic country and was meant to show the benefits of being a German protectorate. Yes Norway was occupied by Germany in World War 2. Trust me this is real, I had to do a report on Norway, Denmark, Sweden, Finland, Poland, and Germany."}, {"url": "http://www.answers.com/Q/Why_did_Germany_invade_Denmark_and_Norway_in_World_War_2", "passage_text": "Germany occupied Denmark, Norway and Poland. Although neutral, German troops were allowed across Sweden to Norway in the period after the invasion. Finland was a German ally f … ollowing the German invasion of Russia in 1941, and German forces were present in Finland on that basis, particularly in the far north. Yes Norway was occupied by Germany in World War 2. Trust me this is real, I had to do a report on Norway, Denmark, Sweden, Finland, Poland, and Germany."}, {"url": "http://www.answers.com/Q/Why_did_Germany_invade_Norway", "passage_text": "Denmark: The invasion of Denmark would create a staging area for operations in Norway. Furthermore, having control of Denmark would secure the Baltic Sea for Germany and the S … oviet Union (Germany had an alliance with the Soviet Union). Germany invaded France and Poland also it invaded Austria. World War 2 started because Germany said to England they wouldn't invade Poland but they did-so Poland is the ea … siest country to remember that was invaded! 5 people found this useful."}, {"url": "https://en.wikipedia.org/wiki/German_occupation_of_Norway", "passage_text": "The German occupation of Norway began on 9 April 1940 after Nazi forces invaded the neutral Scandinavian country of Norway. It ended on 8 May 1945, after the capitulation of German forces in Europe. Throughout this period, Norway was continuously occupied by the Wehrmacht. Hitler garrisoned Norway with about 300,000 troops for the rest of the war. By occupying Norway, Hitler had ensured the protection of Germany's supply of iron ore from Sweden and had obtained naval and air bases with which to strike at Britain."}, {"url": "http://www.bbc.co.uk/history/events/germany_advances_through_europe", "passage_text": "Now a period known as the 'Phoney War’ began, in which Western Europe remained relatively quiet. This was interrupted in April 1940 when Germany invaded Denmark and Norway. Denmark surrendered but Norway fought on, with British and French help, until June. It was a disastrous failure for the British and forced the Prime Minster, Neville Chamberlain, to resign. On 10 May he was replaced by Winston Churchill. "}, {"url": "http://www.ducksters.com/history/world_war_ii/ww2_in_europe.php", "passage_text": "World War II in Europe began when Hitler's Nazi Germany attacked Poland. Germany had allies such as Italy, Hungary, Bulgaria, and Romania. These European countries were part of the Axis Powers. The countries that fought against Germany and the Axis Powers in Europe were called the Allied Powers. Next, he took part of Czechoslovakia. The other European countries didn't want war, so they didn't do anything. Finally, when Germany invaded Poland in 1939, the other countries knew he would not stop. France and Great Britain declared war on Germany and World War II had begun."}]