[{"url": "http://www.worldatlas.com/webimage/countrys/namerica/caribb/dominicanrepublic/doweather.htm", "passage_text": "Climate: The climate of the Dominican Republic is decidely tropical. The country's annual average temperature is 25 °C (77 °F). Temps are cooler in the higher elevations while near sea level the average temperatures reach 28 °C (82.4 °F). In some of the low lying valleys high temperatures near 40 °C (104 °F) are common."}, {"url": "http://www.currentresults.com/Weather/Dominican-Republic/annual-average-temperature-rainfall.php", "passage_text": "The tables below give the normal temperatures and rainfall for cities and popular vacation spots in Dominican Republic. The annual temperatures and rainfall are averages of weather data collected from 1961 to 1990."}, {"url": "http://www.holiday-weather.com/santo_domingo/averages/", "passage_text": "Santo Domingo: Annual Weather Averages. June is the hottest month in Santo Domingo with an average temperature of 28°C (82°F) and the coldest is February at 25°C (76°F) with the most daily sunshine hours at 9 in September. The wettest month is August with an average of 160mm of rain."}, {"url": "http://www.holiday-weather.com/punta_cana/averages/", "passage_text": "Punta cana: Annual Weather Averages. June is the hottest month in Punta cana with an average temperature of 28°C (82°F) and the coldest is January at 25°C (77°F) with the most daily sunshine hours at 10 in August. The wettest month is September with an average of 128mm of rain."}, {"url": "http://hispaniola.com/dominican_republic/info/nature_climate.php", "passage_text": "The majority of the Dominican Republic enjoys beautiful tropical weather all year round, with the average annual temperature hovering around 25°C (77°F). Some call the Dominican Republic's climate, 'the endless summer', due to warm and sunny conditions experienced pretty much everywhere in the country, all year round."}]