[{"url": "https://en.wikipedia.org/wiki/Granular_material", "passage_text": "Examples of granular materials. A granular material is a conglomeration of discrete solid, macroscopic particles characterized by a loss of energy whenever the particles interact (the most common example would be friction when grains collide). "}, {"url": "http://www.yourdictionary.com/granular", "passage_text": "LINK / CITE ADD TO WORD LIST. adjective. This sugar is granular. This sugar is granular. The definition of granular is something made up of grains or particles, or something with a rough surface. 1  Sugar that is made up of tiny little individual particles is an example of granular sugar. 2  A driveway with a rough surface and different gravel particles is an example of a granular surface."}, {"url": "http://medical-dictionary.thefreedictionary.com/granular+casts", "passage_text": "gran·u·lar. adj. 1. Composed or appearing to be composed of granules or grains. 2. Relating to or containing particles having a strong affinity for nuclear stains, as in certain bacteria. Called also granular vulvovaginitis. granular venereal disease. see granular vaginitis (above). granular vulvitis. part of a venereal disease caused by Ureaplasma diversum in cattle; other signs include embryonic death, abortion, dead or weak calves. granular vulvovaginitis. see granular vaginitis (above). 1  Facebook."}, {"url": "http://www.businessdictionary.com/definition/granularity.html", "passage_text": "Definition. The level of detail considered in a model or decision making process. The greater the granularity, the deeper the level of detail. Granularity is usually used to characterize the scale or level of detail in a set of data. Show more usage examples... Meetings always took longer when Jim was in them because he insisted on a high degree of granularity and explored everything in minute detail, no matter what was being discussed."}, {"url": "http://www.thefreedictionary.com/granular", "passage_text": "gran·u·lar. adj. 1. Composed or appearing to be composed of granules or grains: granular sugar; granular snow. 2. a"}, {"url": "http://medical-dictionary.thefreedictionary.com/granular", "passage_text": "granular vaginitis. spherical, 1 mm diameter nodules on the vulvar mucosa of the cow and the penile skin of the bull. Appears to be a nonspecific hyperplasia of lymphoid tissue, but linked anecdotally with Mycoplasma spp. Called also granular vulvovaginitis. granular venereal disease. see granular vaginitis (above). granular vulvitis. part of a venereal disease caused by Ureaplasma diversum in cattle; other signs include embryonic death, abortion, dead or weak calves. granular vulvovaginitis. see granular vaginitis (above)"}, {"url": "http://medical-dictionary.thefreedictionary.com/granular", "passage_text": "granular. made up of or marked by the presence of granules or grains. granular casts. homogeneous urinary casts with a granular structure; composed of fractions of serum proteins. Called also granular vulvovaginitis. granular venereal disease. see granular vaginitis (above). granular vulvitis. part of a venereal disease caused by Ureaplasma diversum in cattle; other signs include embryonic death, abortion, dead or weak calves."}, {"url": "http://medical-dictionary.thefreedictionary.com/granular+casts", "passage_text": "granular. made up of or marked by the presence of granules or grains. granular casts. homogeneous urinary casts with a granular structure; composed of fractions of serum proteins. Called also granular vulvovaginitis. granular venereal disease. see granular vaginitis (above). granular vulvitis. part of a venereal disease caused by Ureaplasma diversum in cattle; other signs include embryonic death, abortion, dead or weak calves. granular vulvovaginitis. see granular vaginitis (above). 1  Facebook."}, {"url": "http://www.businessdictionary.com/definition/granularity.html", "passage_text": "Use granularity in a sentence. Show more usage examples... Meetings always took longer when Jim was in them because he insisted on a high degree of granularity and explored everything in minute detail, no matter what was being discussed."}]