[{"url": "http://www.wisegeek.org/what-is-the-difference-between-an-associate-and-a-partner.htm", "passage_text": "People may be senior or junior associates, or junior, senior or managing partners. Essentially, you can view the associate as an employee of the partners. He or she is paid a salary or wage, and may be offered the opportunity to become a partner at a future point in time. The ability to “make partner” is based on job performance, hours billed, time on the job and other factors. Usually the only thing the separates the partners from the associates is experience. You can usually be promoted from an associate to a partner. Keep in mind that this can often be a very lengthy process."}, {"url": "http://www.bcgsearch.com/article/900042747/What-Law-Firm-Titles-Mean-Of-Counsel-Non-Equity-Partner-Equity-Partner-Explained/", "passage_text": "1 Of Counsel is an excellent safety net for very good attorneys who are not yet ready to be partner at a major, major law firm, or who will never be. 2  A law firm like Skadden may pay an of counsel attorney $375,000 a year and bill the same attorney out at $750 an hour. In order to maintain the position of equity partner, an attorney generally needs to consistently have work to do and keep associates and others beneath them busy. Equity partners are traditionally evaluated based on their contribution to the firm—but can be evaluated on a variety of other factors as well."}, {"url": "https://answers.yahoo.com/question/index?qid=20090315200523AAmRwbI", "passage_text": "Best Answer: Foremost, an associate attorney is, in a real sense, an attorney. Now, if you are referring to an associate attorney in a law firm, then an associate attorney is one who is a subordinate member of that firm as compared to partners whose name usually appear in the name of the firm. Source(s): pobreng tawo · 7 years ago. Normally it determines how long the attorney has been with the firm. An associate is typically an attorney who is new to the firm. If they are a partner then their name is on the firm (Example: Smith & Johnson). Smith and Johnson are full partners in the firm but there are still a few attorneys who work for the firm and they are considered associates. Your question is very vague"}, {"url": "https://en.wikipedia.org/wiki/Of_counsel", "passage_text": "Of Counsel is, in the legal profession of the United States, often the title of an attorney who has a relationship with a law firm or an organization, but is not an associate or a partner. Some firms use titles such as counsel, special counsel, and senior counsel for the same concept. "}, {"url": "http://www.jdunderground.com/docreview/thread.php%3FthreadId%3D956", "passage_text": "You can be an associate and there is no way you will ever be partner-of counsel at best, and that is made clear. In fact, at my firm, only 1/4 the associates are considered on a partnership track. Reply. (Apr 1, 2008 - 2:49 pm). WEMED: Read the NYT article. Where to begin... Associate is generally what everyone strives to become when they go to law school. No one, at least at the beginning, ever wants to become a Staff Attorney.. The technical difference is that Associates are partnership-track positions. In other words, if you get a job at a firm as an associate and work very hard, you have a chance of becoming a partner within seven to ten years. Staff Attorneys are non-partnership track positions"}, {"url": "http://www.bcgsearch.com/article/900042747/What-Law-Firm-Titles-Mean-Of-Counsel-Non-Equity-Partner-Equity-Partner-Explained/", "passage_text": "The biggest difference between a non-equity partner and of counsel is that a non-equity partner is someone who shows the ambition and drive to potentially be an equity partner. They generally have interpersonal skills, are willing to work very hard and also have good legal skills. In order to maintain the position of equity partner, an attorney generally needs to consistently have work to do and keep associates and others beneath them busy. Equity partners are traditionally evaluated based on their contribution to the firm—but can be evaluated on a variety of other factors as well."}]