[{"url": "http://www.gocompare.com/home-insurance/estimating-contents-cover/", "passage_text": "In the event of crime, fire or flood your belongings may get damaged. To make sure you have adequate contents insurance cover you need to provide an estimate of the value of your goods. Contents aren't just your valuables; the term includes pretty much everything that fills your home, said Gocompare.com's Ben Wilson. Taking out appropriate levels of content cover. When you compare contents insurance through Gocompare.com, our easy-to-use forms will ask you to estimate the total value of your contents and whether you need cover for bicycles and laptops away from home."}, {"url": "https://www.statefarm.com/insurance/home-and-property/homeowners/determine-home-insurance-coverage", "passage_text": "To determine your amount of homeowners insurance coverage: 1  Get an estimate of the replacement cost of your home. 2  Select the coverage amount that best fits your needs. Here's how: 1  Ask if a replacement cost estimate is available when you have the home appraised. 2  Or, consult with your local builder association or a reputable builder for an estimate. 3  You can also check with your State Farm ® agent to help you with this process."}, {"url": "http://www.ml.com/publish/content/application/pdf/GWMOL/Healthcare-Costs-in-Retirement-Guide_ARN5J2L6.pdf", "passage_text": "They are making their plan more accurate by including an estimate of annual healthcare expenses and using a higher rate of inflation for these costs.Today they both have employer-subsidized insurance. n Their share of the premium cost is about $116 a month each or $2,800 per year total ($116 x 2 people x 12 months). "}, {"url": "http://homeguides.sfgate.com/average-cost-homeowners-insurance-3020.html", "passage_text": "Estimates. According to the Federal Reserve Bureau, the average cost of an annual premium for homeowners insurance is between $300 and $1,000. For most homeowners, the annual costs for a homeowners insurance policy can be estimated by dividing the value of the home by 1,000, then multiplying the result by $3.50"}, {"url": "https://www.budgetdirect.com.au/home-contents-insurance/replacement-value-calculators.html", "passage_text": "Contents Calculator*. If you need an estimate on the contents value in your home, this is the tool for you. Just answer a series of questions, and the Sum Insured Home Contents Calculator will estimate the cost of replacing your home’s Contents. Calculate Contents Value Now. Tools to help you find the right amount of cover. People often underestimate the cost of replacing their home building and contents when applying for insurance cover."}, {"url": "http://www.theaa.com/services/insuranceandfinance/home/n_contents_calc_form.jsp", "passage_text": "Calculate your level of contents cover. It's easy to underestimate the value of all your household goods, domestic appliances, furniture, furnishings, personal belongings and valuables. Try our calculator and see just how much home insurance cover you need. Enter a price for the items in your home and then click Calculate below. Do remember to estimate the prices if you had to buy new, rather than the prices you paid for the items. Our home insurance provides new-for-old cover for your content"}, {"url": "https://www.statefarm.com/insurance/home-and-property/homeowners/determine-home-insurance-coverage", "passage_text": "Keeping up with the current market conditions in your area and changing your coverage amount accordingly, will help you maintain coverage at least equal to 100 percent of the estimated replacement cost coverage for your home. If you have any questions, contact your State Farm agent. Here's how: 1  Ask if a replacement cost estimate is available when you have the home appraised. 2  Or, consult with your local builder association or a reputable builder for an estimate. 3  You can also check with your State Farm ® agent to help you with this process."}, {"url": "https://learningcenter.statefarm.com/insurance/home/replacement-cost-vs-market-value/", "passage_text": "When you purchase a homeowners insurance policy, you ll make a number of decisions about your coverage. One of the most important is whether to insure your home for its replacement cost or its market value. "}]