[{"url": "http://www.celebritynetworth.com/richest-celebrities/rock-stars/darius-rucker-net-worth/", "passage_text": "$14 Million. Darius Rucker net worth: Darius Rucker is an American musician who has a net worth of $14 million dollars. Darius Rucker was born in Charleston, South Carolina in May 1966. Darius was the lead singer of the band Hootie & The Blowfish since the band formed in 1986."}, {"url": "http://www.biography.com/people/darius-rucker-224910", "passage_text": "Singer-songwriter Darius Rucker was born on May 13, 1966, in Charleston, South Carolina. Rucker later described his childhood as a typical Southern African-American upbringing, involving long hours at church on Sundays and enduring various financial struggles."}, {"url": "http://www.celebritynetworth.com/richest-celebrities/rock-stars/darius-rucker-net-worth/", "passage_text": "Darius Rucker net worth: Darius Rucker is an American musician who has a net worth of $14 million dollars. Darius Rucker was born in Charleston, South Carolina in May 1966. Darius was the lead singer of the band Hootie & The Blowfish since the band formed in 1986."}, {"url": "http://tasteofcountry.com/darius-rucker-things/", "passage_text": "Happy 45th birthday, Darius Rucker ! On May 13, 1966, Rucker was born in Charleston, S.C., and he and his five siblings were raised by their single mother, Carolyn. His passion for music was clear from a young age, and he gained international success as the frontman of ’90s pop-rock band Hootie and the Blowfish."}, {"url": "http://www.astrotheme.com/astrology/Darius_Rucker", "passage_text": "Rucker released his second country album, titled Charleston, SC 1966, on October 12, 2010. The title is inspired by Radney Foster's solo debut album, Del Rio, TX 1959. Its first single was Come Back Song, which Rucker wrote with Chris Stapleton and Casey Beathard."}, {"url": "http://www.browsebiography.com/bio-darius_rucker.html", "passage_text": "Born in Charleston, South Carolina, he first gained fame as the lead singer and rhythm guitarist of the rock band Hootie & the Blowfish, which he founded in 1986 at the University of South Carolina along with Mark Bryan, Jim Soni Sonefeld and Dean Felber."}, {"url": "http://www.imdb.com/name/nm0748519/bio", "passage_text": "Mini Bio (1). Darius Rucker was born on May 13, 1966 in Charleston, South Carolina, USA as Darius Carlos Rucker. He has been married to Beth Leonard since December 9, 2000. They have two children."}]