[{"url": "http://www.iherb.com/Now-Foods-Taurine-500-mg-100-Capsules/852", "passage_text": "Taurine helps to generate and regulate nerve impulses and aids in the maintenance of fluid balance; it is also used by the body in visual pathways, as well as in the brain and nervous system, where it works together with glycine and GABA as a neurotransmitter. Taurine is a conditionally essential amino acid which is not utilized in protein synthesis, but is mainly found free in most tissues, especially throughout the nervous system. It functions in tissues by stabilizing cell membranes, aiding the transport of potassium, sodium, calcium and magnesium in and out of cells"}, {"url": "http://newrootsherbal.com/product/id/904", "passage_text": "This amino acid helps the nervous system to function properly. It does this, as mentioned earlier, by aiding the movement of potassium, calcium, and magnesium in and out of the cells that help generate nerve impulses. Taurine is also essential for the proper digestion of fats and the absorption of fat-soluble vitamins. Magnesium citrate activates enzymes that are essential in many functions of the body. It is also essential for the metabolism of fat, carbohydrates, and amino acids."}, {"url": "http://nutritionreview.org/2013/10/taurine/", "passage_text": "in Amino Acids, Glossary. Taurine is one of the most abundant amino acids in the body. It is found in the central nervous system, skeletal muscle and is very concentrated in the brain and heart. It is synthesized from the amino acids methionine and cysteine, in conjunction with vitamin B6. Animal protein is a good source of taurine, as it is not found in vegetable protein. Vegetarians with an unbalanced protein intake, and therefore deficient in methionine or cysteine may have difficulty manufacturing taurine."}, {"url": "http://www.allstarhealth.com/lj_c/taurine.htm", "passage_text": "Taurine. Taurine is a metabolite of the amino acid L-cysteine. Taurine is concentrated in highly active tissues like the brain, retina, skeletal and heart muscle. Taurine helps the nervous system generate impulses and, by stabilizing cell membranes, maximizes the body's response to those impulses. Taurine can be obtained through the diet through meats, sea vegetables, and fish. Vegetarians who do not consume meat should consider using a taurine supplement"}, {"url": "http://nutritionreview.org/2013/10/taurine/", "passage_text": "It helps the movement of potassium, sodium, calcium and magnesium in and out of cells, which helps generate nerve impulses. Taurine is necessary for the chemical reactions that produce normal vision, and deficiencies are associated with retinal degeneration. It is synthesized from the amino acids methionine and cysteine, in conjunction with vitamin B6. Animal protein is a good source of taurine, as it is not found in vegetable protein. Vegetarians with an unbalanced protein intake, and therefore deficient in methionine or cysteine may have difficulty manufacturing taurine."}, {"url": "http://www.allstarhealth.com/lj_c/taurine.htm", "passage_text": "Taurine helps to regulate and generate nerve impulses; these impulses are responsible for all of our thoughts, moods and actions. In this way, taurine can support a good mood, physical energy and increase alertness without any stimulant properties. Taurine helps the nervous system generate impulses and, by stabilizing cell membranes, maximizes the body's response to those impulses. Taurine can be obtained through the diet through meats, sea vegetables, and fish."}, {"url": "http://www.drweil.com/drw/u/id/QAA263509", "passage_text": "In fact, it is one of the most abundant free amino-acid-like compounds found in skeletal and cardiac muscle, as well as in the nervous system, and it is important in metabolism, particularly in the brain. Taurine works in electrically active tissues to stabilize cell membranes. The manufacturers of Red Bull claim that the body's taurine production declines with extreme physical exertion and that this change can be remedied by drinking a can of Red Bull. I can't say whether the taurine in Red Bull is responsible for the purported energy boosting effects."}, {"url": "http://www.healthy.net/scr/Article.aspx?Id=1971", "passage_text": "Taurine aids the movement of potassium, sodium, calcium, and magnesium in and out of cells and thus helps generate nerve impulses. Zinc seems to support this effect of taurine. Taurine is found in the central nervous system, skeletal muscle, and heart; it is very concentrated in the brain and high in the heart tissues. Taurine is an inhibitory neurotransmitter, and its main use has been to help treat epilepsy and other excitable brain states, where it functions as a mild sedative. Taurine, a lesser known amino acid, is not part of our muscle protein yet is important in metabolism, especially in the brain. It is essential in newborns, as they cannot make it. Adults can produce sulfur-containing taurine from cysteine with the help of pyridoxine, B6."}]