[{"url": "http://www.howmuchisit.org/typhoid-vaccine-cost/", "passage_text": "1 TheTravelClinic.com, located in Oregon, charges $70 for four capsules. 2  According to JohnnyVagabond.com, it is claimed that one person paid $160 for a single typhoid vaccine. 3  Others quoted as much as $500 for a package of vaccines. 1 The oral vaccine is not recommended for those who have cancer of any kind. 2  Also, the oral vaccine should not be taken within 24 hours of intake of any antibiotics. 3  The typhoid vaccine does not guarantee 100 % protection from disease, so you should be careful against this disease even if you are vaccinated."}, {"url": "http://health.costhelper.com/typhoid-vaccine.html", "passage_text": "1 For patients not covered by health insurance, the cost of a typhoid vaccination typically includes: a consultation fee, sometimes a fee to administer the shot, and the cost of the vaccine -- either a single shot or four capsules. 1 Side effects of the typhoid vaccine shot can include fever, headache or redness or swelling at the injection site; side effects of the oral vaccine can include fever, headache, abdominal discomfort, nausea, vomiting or, in rare cases, a rash."}, {"url": "http://health.costhelper.com/typhoid-vaccine.html", "passage_text": "1 Neither type of typhoid vaccine is 100 percent effective; both protect 50 to 80 percent of recipients. 2  If you get the shot, the health care provider will administer the vaccine. 3  It is recommended that you have the shot two weeks before any possible exposure. 1 Side effects of the typhoid vaccine shot can include fever, headache or redness or swelling at the injection site; side effects of the oral vaccine can include fever, headache, abdominal discomfort, nausea, vomiting or, in rare cases, a rash."}, {"url": "http://www.howmuchisit.org/typhoid-vaccine-cost/", "passage_text": "Typhoid is a communicable disease caused by the bacteria Salmonella Typhi. The disease invades your blood stream causing systemic illness. Early symptoms of typhoid include fever, general illness, headache, and loss of appetite. Other common symptoms are severe fatigue, abdominal pain, and weakness. 1 The oral vaccine is not recommended for those who have cancer of any kind. 2  Also, the oral vaccine should not be taken within 24 hours of intake of any antibiotics. 3  The typhoid vaccine does not guarantee 100 % protection from disease, so you should be careful against this disease even if you are vaccinated."}, {"url": "http://health.costhelper.com/typhoid-vaccine.html", "passage_text": "1 According to a U.S. Centers for Disease Control and Prevention fact sheet, the oral vaccine provides immunity for five years, and the shot for two years. 2  Neither type of typhoid vaccine is 100 percent effective; both protect 50 to 80 percent of recipients. 1 Side effects of the typhoid vaccine shot can include fever, headache or redness or swelling at the injection site; side effects of the oral vaccine can include fever, headache, abdominal discomfort, nausea, vomiting or, in rare cases, a rash."}, {"url": "http://www.howmuchisit.org/typhoid-vaccine-cost/", "passage_text": "1 If your insurance policy does cover this vaccine, it will cost less than $45,on average. 2  TheTravelClinic.com, located in Oregon, charges $70 for four capsules. 3  According to JohnnyVagabond.com, it is claimed that one person paid $160 for a single typhoid vaccine. 4  Others quoted as much as $500 for a package of vaccines. 1 The oral vaccine is not recommended for those who have cancer of any kind. 2  Also, the oral vaccine should not be taken within 24 hours of intake of any antibiotics. 3  The typhoid vaccine does not guarantee 100 % protection from disease, so you should be careful against this disease even if you are vaccinated."}, {"url": "http://health.costhelper.com/typhoid-vaccine.html", "passage_text": "Prices widely vary on the vaccine depending on where you go. I got prices from $72-$310! Health insurance will not cover this vaccine so plan to pay out of pocket and up front. Definitely call around...look into local pharmacies such as walgreens and cvs who can or do stock the oral. 1 Side effects of the typhoid vaccine shot can include fever, headache or redness or swelling at the injection site; side effects of the oral vaccine can include fever, headache, abdominal discomfort, nausea, vomiting or, in rare cases, a rash."}, {"url": "http://health.costhelper.com/travel-vaccinations.html", "passage_text": "1 In general, a typhoid typically costs $85 to $300 total; a meningococcal meningitis typically costs $100 to $150 total; a yellow fever vaccination typically costs $150 to $350 total; a Japanese Encephalitis typically costs $450 to $800 total; and a rabies typically costs $500 to $1,000 total. 1 As an example of a travel clinic fee schedule, the Michigan State University Travel Clinic charges consultation fees for non-students ranging from $35 for 15 minutes to $95 for an hour, and shot administration fees of $20 for the first shot and $15 for each additional shot."}]