[{"url": "http://americanpregnancy.org/pregnancy-complications/early-fetal-development/", "passage_text": "A strong fetal heartbeat should be detectable by ultrasound, with a heartbeat of 140-170 bpm by the 9th week. If a strong heartbeat is not detected at this point, another ultrasound scan may be done to verify the viability of the fetus. A normal heartbeat at 6-7 weeks would be 90-110 beats per minute. The presence of an embryonic heartbeat is an assuring sign of the health of the pregnancy. Once a heartbeat is detected, the chance of the pregnancy continuing ranges from 70-90% dependent on what type of ultrasound is used."}, {"url": "http://thefetalheart.org/cases/TheNormalHeart/index.htm", "passage_text": "The normal fetal heart. The following images were obtained from a 25-week fetus with a normal heart. Being familiar with the ultrasound appearances of normality is important before abnormalites can be detected. Images 1 to 5 correspond to transverse sections through the fetal chest with fetus lying in cephalic position"}, {"url": "http://radiopaedia.org/articles/fetal-heart-rate", "passage_text": "A normal fetal heart rate (FHR) usually ranges from 120 to 160 beats per minute (bpm) in the in utero period. It is measurable sonographically from around 6 weeks and the normal range varies during gestation, increasing to around 170 bpm at 10 weeks and decreasing from then to around 130 bpm at term. Although in the healthy fetus the heart rate is usually regular, a beat-to-beat variation of approximately 5 to 15 beats per minute can be allowed."}, {"url": "http://americanpregnancy.org/pregnancy-complications/early-fetal-development/", "passage_text": "Generally from 6 ½ -7 weeks is the time when a heartbeat can be detected and viability can be assessed. A normal heartbeat at 6-7 weeks would be 90-110 beats per minute. The presence of an embryonic heartbeat is an assuring sign of the health of the pregnancy. Once a heartbeat is detected, the chance of the pregnancy continuing ranges from 70-90% dependent on what type of ultrasound is used."}, {"url": "https://en.wikipedia.org/wiki/Doppler_fetal_monitor", "passage_text": "Invented in 1958 by Dr. Edward H. Hon, a Doppler fetal monitor or Doppler fetal heart rate monitor is a hand-held ultrasound transducer used to detect the fetal heartbeat for prenatal care. It uses the Doppler effect to provide an audible simulation of the heart beat. Fetal heart rates [edit]. Starting at week 5 the fetal heart rate accelerates by 3.3 bpm per day for the next month. The fetal heart begins to beat at approximately the same rate as the mother's, which is typically 80 to 85 bpm. The approximate fetal heart rate for weeks 5 to 9 (assuming a starting rate of 80): 1  Week 5 starts at 80 and ends at 103 bpm. 2  Week 6 starts at 103 and ends at 126 bpm. 3  Week 7 starts at 126 and ends at 149 bpm"}, {"url": "http://americanpregnancy.org/pregnancy-complications/early-fetal-development/", "passage_text": "Between 5 ½ to 6 ½ weeks, a fetal pole or even a fetal heartbeat may be detected by vaginal ultrasound. The fetal pole is the first visible sign of a developing embryo. This pole structure actually has some curve to it with the embryo’s head at one end and what looks like a tail at the other end. A normal heartbeat at 6-7 weeks would be 90-110 beats per minute. The presence of an embryonic heartbeat is an assuring sign of the health of the pregnancy. Once a heartbeat is detected, the chance of the pregnancy continuing ranges from 70-90% dependent on what type of ultrasound is used."}, {"url": "http://www.fetaldopplerfacts.org/facts/dopplers/fetal-doppler-use.php", "passage_text": "Your baby's heart rate will be between 120 & 180 BPM. This is considered the normal range of a fetal heart rate. Conversely, your heart rate will be much less 60-100 BPM. Early in pregnancy its normal for the fetal heart rate to vary within a reasonable range. When can I start using a fetal doppler? In some woman the fetal heart can be detected as early as 8-12 weeks. The fetal heartbeat should be audible 95% of the time in 12-week pregnancies, and nearly 100% of the time after 14 weeks. Earlier in pregnancy, between 8-12 weeks, your success in finding the heart rate can have to do with the quality of your devic"}, {"url": "http://www.uniqueultrasound.com/the-fetal-heart", "passage_text": "Fetal Heart Beat. The fetal heart rate can usually be detected with a fetal ultrasound doppler as early as 8 weeks. The normal fetal heart rate is between 110 to 180 beats per minute, but can vary slights. Fluctuations can occur throughout the day due to activity level and are completely normal. The fetus’ heart begins to beat at 5 weeks gestation, at around 80-85 beats per minute. This rate increases about 3 beats per minute per day during the first month. When the fetus heart is first developed it resembles that of a tube."}]