[{"url": "http://www.merriam-webster.com/dictionary/organelle", "passage_text": "Medical Definition of ORGANELLE. : a specialized cellular part (as a mitochondrion or ribosome) that is analogous to an organ. : a specialized cellular part (as a mitochondrion, lysosome, or ribosome) that is analogous to an organ. See organelle defined for kids."}, {"url": "http://www.biology-online.org/dictionary/Organelle", "passage_text": "Supplement. A eukaryotic cell contains many organelles, for example, the nucleus, endoplasmic reticulum, golgi apparatus, mitochondria, and chloroplast (plastid). However, not all these organelles are found in only one cell or in an organism. The chloroplast, for instance, is abundant in plant cells but not in animal cells. "}, {"url": "http://www.wisegeek.com/what-are-organelles.htm", "passage_text": "Organelles are tiny structures that perform very specific functions within cells. The term is a reference to organs, likening the way these structures operate in cells to the way organs function in the body. A number of different organelles can be found inside various types of plant, animal, and bacteria cells. Organelles are the tiny structures that perform specific functions within a cell. Mitochondria are often called the power plant of the cell. The rough endoplasmic reticulum is an organelle. Mitochondrial disorders can cause digestive problems."}, {"url": "http://www.merriam-webster.com/dictionary/organelle", "passage_text": "Definition of ORGANELLE. : a specialized cellular part (as a mitochondrion, lysosome, or ribosome) that is analogous to an organ. See organelle defined for kids. ADVERTISEMENT"}, {"url": "http://www.biology-online.org/dictionary/Organelles", "passage_text": "A eukaryotic cell contains many organelles, for example, the nucleus, endoplasmic reticulum, golgi apparatus, mitochondria, and chloroplast (plastid). However, not all these organelles are found in only one cell or in an organism. The chloroplast, for instance, is abundant in plant cells but not in animal cells. Definition. noun, plural of organelle. Literally, the term means little organs. As the body is composed of various organs, the cell, too, has little organs that perform special functions."}, {"url": "http://www.biology-online.org/dictionary/Organelles", "passage_text": "Organelles. Definition. noun, plural of organelle. Literally, the term means little organs. As the body is composed of various organs, the cell, too, has little organs that perform special functions. They are membrane-bound compartments or structures of a cell"}, {"url": "https://en.wikipedia.org/wiki/Organelle", "passage_text": "The name organelle comes from the idea that these structures are to cells what an organ is to the body (hence the name organelle, the suffix-elle being a diminutive). Nevertheless, the use of organelle to refer to non-membrane bound structures such as ribosomes is common. This has led some texts to delineate between membrane-bound and non-membrane bound organelles."}, {"url": "https://en.wikipedia.org/wiki/Organelle", "passage_text": "In cell biology, an organelle /ɔrɡəˈnɛl/ is a specialized subunit within a cell that has a specific function. Individual organelles are usually separately enclosed within their own lipid bilayers. Nevertheless, the use of organelle to refer to non-membrane bound structures such as ribosomes is common. This has led some texts to delineate between membrane-bound and non-membrane bound organelles."}, {"url": "http://biology.about.com/od/cellanatomy/ss/organelles.htm", "passage_text": "The nucleus is an organelle that is surrounded by a double membrane called the nuclear envelope. The nuclear envelope separates the contents of the nucleus from the rest of the cell. Eukaryotic cells also have a cell membrane (plasma membrane), cytoplasm, cytoskeleton, and various cellular organelles. There are also certain organelles found in plant cells that are not found in animal cells and vice versa. Examples of organelles found in plant cells and animal cells include: Prokaryotic cells have a structure that is less complex than eukaryotic cells."}, {"url": "https://answers.yahoo.com/question/index?qid=20110412140439AAffc0e", "passage_text": "An organelle is a specialized subunit within a cell that has a specific function, and is usually separately enclosed within its own lipid bilayer.The name organelle comes from the idea that these structures are to cells what an organ is to the body (hence the name organelle, the suffix-elle being a diminutive). "}]