[{"url": "http://www.firsttankguide.net/betta.php", "passage_text": "Keep your Betta in a tank of at least 10 gallons (about 38 liters), and make sure that a minimum of 5 gallons (19 liters) of your tank space is dedicated to the Betta. This will provide sufficient space for your Betta and will allow the tank to help you keep healthy fish."}, {"url": "http://www.wikihow.com/Take-Care-of-a-Betta-Fish", "passage_text": "The minimum size tank for a betta fish is 2.5 gallons with a heater and filter. Please do not keep a betta fish in a bowl; it is terrible for their health and is very small! Your betta fish will not be happy or live as long."}, {"url": "http://pets.thenest.com/bettas-temperature-shock-3670.html", "passage_text": "Betta Temperature Needs. Because bettas originate in warm, tropical climates, in captivity they need the water in their bowls or tanks to be between 74 degrees to 78 degrees Fahrenheit (23 to 25 degrees Celsius) to thrive."}, {"url": "http://www.bellaonline.com/articles/art17131.asp", "passage_text": "The best water temperature for your Betta fish is within a range. Bettas are tropical fish and so they like their water a little warmer-but not too warm. Consistency in water temperature is also important. The optimal range of water temperature for your Betta fish is 74 -78 degrees Fahrenheit."}, {"url": "http://bettafishhome.com/water-temperature-for-betta-fish/", "passage_text": "The best water temperature for betta fish is around 74-78 Fahrenheit, or 23-25 Celsius. Your betta will generally be fine if the water temperature is slightly out of this range (72-80 F), but 74-78 is what their natural habitat of rice paddies in Thailand and other southeast asian countries contains."}, {"url": "http://www.wikihow.com/Keep-a-Betta's-Water-Warm", "passage_text": "1 1 gallon tanks need to be cleaned every 3 days, 2.5 gallon tanks every 5 days, and 5 gallon tanks every 7 days. 2  Take note of the tanks temperature. 3  You will need to match the new water to this temperature. 4  Scoop your fish out of the bowl and place it, along with some tank water, in a safe container."}, {"url": "http://bettafishhome.com/water-temperature-for-betta-fish/", "passage_text": "Slightly warmer water temperature for Betta fish (80-82 F) can be used if your betta is sick and needs to be quarantined or separated from other fish while he is being treated with medication."}, {"url": "http://www.ehow.com/info_8175449_ways-fish-tank-good-temperature.html", "passage_text": "Water Temperature. The ideal temperature for a tropical fish like a betta is between 75 degrees and 82 degrees Fahrenheit. A water heater is the best device to ensure the temperature stays within this range, however, a heater cannot be used in a tank smaller than five gallons."}]