[{"url": "https://en.wikipedia.org/wiki/Federal_Reserve_System", "passage_text": "The seven-member Board of Governors is a federal agency. It is charged with the overseeing of the 12 District Reserve Banks and setting national monetary policy. It also supervises and regulates the U.S. banking system in general. The Federal Reserve System also directly sets the discount rate, which is the interest rate for discount window lending, overnight loans that member banks borrow directly from the Fed. This rate is generally set at a rate close to 100 basis points above the target federal funds rate."}, {"url": "http://www.answers.com/Q/What_was_the_Federal_Reserve_Act_designed_to_prevent", "passage_text": "The Federal Reserve Act of 1913 is an Act of Congress and signed  into law by US President Woodrow Wilson. The Federal Reserve  System's original purposes were to give the c … ountry an elastic  currency, to provide facilities for discounting commercial paper  and to improve the supervision of banking. 1 In the United States, the Federal Reserve is responsible for a dual…. 2  The Federal Reserve and Inflation Rates The Federal Reserve, on top of other important roles, monitors and attempts to control inflation."}, {"url": "http://www.investopedia.com/terms/f/1913-federal-reserve-act.asp", "passage_text": "DEFINITION of '1913 Federal Reserve Act'. The 1913 U.S. legislation that created the current Federal Reserve System. The Federal Reserve Act intended to establish a form of economic stability through the introduction of the Central Bank, which would be in charge of monetary policy, into the United States. The Federal Reserve Act is perhaps one of the most influential laws concerning the U.S. financial system. Next Up."}, {"url": "http://www.answers.com/Q/What_was_the_Federal_Reserve_Act_designed_to_prevent", "passage_text": "The Federal Reserve is the central bank of the United States. Congress created the Federal Reserve System in 1913 to provide the nation with a safer, more flexible and more st … able monetary and financial system. 1 In the United States, the Federal Reserve is responsible for a dual…. 2  The Federal Reserve and Inflation Rates The Federal Reserve, on top of other important roles, monitors and attempts to control inflation."}, {"url": "https://www.federalreserveeducation.org/about-the-fed/structure-and-functions", "passage_text": "The Structure of the Federal Reserve System. The Federal Reserve System was created by the Federal Reserve Act in 1913 and began operating in 1914. The Fed is an unusual mixture of public and private elements. Test your knowledge about Federal Reserve structure through this quiz or word search. Additional quizzes and word searches are also available."}, {"url": "https://en.wikipedia.org/wiki/Federal_Reserve_System", "passage_text": "It was created on December 23, 1913, with the enactment of the Federal Reserve Act, largely in response to a series of financial panics, particularly a severe panic in 1907. Over time, the roles and responsibilities of the Federal Reserve System have expanded, and its structure has evolved. The Federal Reserve System also directly sets the discount rate, which is the interest rate for discount window lending, overnight loans that member banks borrow directly from the Fed. This rate is generally set at a rate close to 100 basis points above the target federal funds rate."}, {"url": "http://www.youtube.com/watch?v=7sr2DspCZig", "passage_text": "Publisert 6. sep. 2012. While most would say the Federal Reserve was designed to stabilize the economy and prevent bank failures, more investigation shows that the Fed is a private banking cartel designed to work against the best interests of the American people. Woodrow Wilson was the president that signed the Federal Reserve legislation. "}, {"url": "https://en.wikipedia.org/wiki/Federal_Reserve_Act", "passage_text": "In 1933, by way of the Banking Act of 1933, the Federal Reserve Act was amended to create the Federal Open Market Committee (FOMC), which consists of the seven members of the Board of Governors of the Federal Reserve System and five representatives from the Federal Reserve Banks. The Federal Reserve act did create a national currency, but more importantly, the act was to create a monetary system that could respond effectively to the different stresses in the banking system and create a stable financial system."}, {"url": "https://en.wikipedia.org/wiki/Federal_Reserve_Act", "passage_text": "3) is an Act of Congress that created and established the Federal Reserve System, the central banking system of the United States, and granted it the legal authority to issue Federal Reserve Notes (now commonly known as the U.S. Dollar) and Federal Reserve Bank Notes as legal tender. The Federal Reserve act did create a national currency, but more importantly, the act was to create a monetary system that could respond effectively to the different stresses in the banking system and create a stable financial system."}]