[{"url": "https://en.wikipedia.org/wiki/Drill_sergeant", "passage_text": "A Drill Instructor is a non-commissioned officer in the armed forces or police forces with specific duties that vary by country. For example, in the United States armed forces, they are assigned the duty of indoctrinating new recruits entering the military. Service as a Drill Instructor is considered a Special Duty Assignment in the Marine Corps (Or B billet), which is factored into consideration of a Marine's eligibility for promotion. A Marine assigned to DI School must have at least a rank of Sergeant (E-5)."}, {"url": "http://shq.lasdnews.net/shq/ebd/assets/a-new-era-for%20the-discipline-process.pdf", "passage_text": "Al Cobos is a sergeant and 20-year veteran of the Los Angeles County Sheriff’s Department. He has worked a variety of patrol, jail, and detective assignments, and is currently assigned to the Education-Based Discipline Unit of the Leadership and Training Division. LIFE typically has 12 to 16 students with 2 to 3 facilitators and will not be conducted at LASD facilities. Education-Based Discipline Unit The Education-Based Discipline Unit was created by Sheriff Baca in late 2008 and is now headed by Lieutenant Reinhardt J. Schuerger."}, {"url": "https://en.wikipedia.org/wiki/Lieutenant", "passage_text": "For example, a lieutenant master is likely to be second-in-command to the master in an organization using both ranks. Political uses include lieutenant governor in various governments, and Quebec lieutenant in Canadian politics. Second lieutenant is usually the most junior grade of commissioned officer. In most cases, newly commissioned officers do not remain at the rank for long before being promoted, and both university graduates and officers commissioned from the ranks may skip the rank altogether."}, {"url": "http://ncojournal.dodlive.mil/2013/11/26/ncos-training-lieutenants-one-at-a-time/", "passage_text": "The platoon sergeant and platoon NCOs do. The reality is the Army relies on this structure and on the forming of the subordinate-to-senior bond. At the platoon level this dual structure, and the bond, is critical in shaping the lieutenant. Field Manual 7-22.7 states, “The platoon sergeant helps the commander to train the lieutenant.” Though training and mentoring are not exactly the same, they do have similarities."}, {"url": "http://www.marines.mil/Marines/Ranks.aspx", "passage_text": "Master sergeants (E-8) and master gunnery sergeants (E-9) provide technical leadership as occupational specialists in their specific MOS. The sergeant major of the Marine Corps is the senior enlisted Marine of the entire Marine Corps, personally selected by the commandant. The sergeant major of the Marine Corps and the Marine gunner are the only billets which rate modified rank insignia in place of traditional rank insignia. "}, {"url": "https://en.wikipedia.org/wiki/Lieutenant", "passage_text": "A lieutenant (abbreviated Lt. , LT, LTA, Lieut. and LEUT.) is a junior commissioned officer in many nations' armed forces, fire service, or law enforcement. Second lieutenant is usually the most junior grade of commissioned officer. In most cases, newly commissioned officers do not remain at the rank for long before being promoted, and both university graduates and officers commissioned from the ranks may skip the rank altogether."}, {"url": "http://fas.org/irp/agency/army/mipb/1997-2/courtney.htm", "passage_text": "You will never know it all. Admitting to your platoon sergeant that you do not know something is not a sign of weakness, it is a sign of honesty. Weakness is the lieutenant who does not take the time to learn their profession and asks the platoon sergeant about everything. Professional development is something you should constantly pursue. Any good program of self-development should include vigorous professional reading. If you do not check something, your soldiers probably will think it is not important to you. Know What You Do Not Know (And Do Something About It). It is a cardinal error for a lieutenant to be a know-it-all.. Nothing turns off the troops faster or brings down morale more than a know-it-all lieutenant."}, {"url": "http://stargate.wikia.com/wiki/Military_rank", "passage_text": "Notes Edit. 1  The United States Air Force does not have a First Sergeant rank. 2  It is instead a duty denoted by a diamond within the upper field. 3  They usually act in the capacity of a Senior Enlisted Advisor to a Squadron Commander. 1 The United States Air Force does not have a First Sergeant rank. 2  It is instead a duty denoted by a diamond within the upper field. 3  They usually act in the capacity of a Senior Enlisted Advisor to a Squadron Commander. 4  Only one individual was awarded the rank of General of the Air Force, semi-retroactively"}, {"url": "http://www.army.mod.uk/structure/32321.aspx", "passage_text": "Lieutenant is a rank typically held for up to 3 years. They normally command of a platoon or troop of around 30 soldiers, but with experience comes increased responsibilities. They also have the opportunity to gain specialised skills outside their unit. Sergeant is a senior role of responsibility, promotion to which typically takes place after 12 years depending on ability. Sergeants typically are second in command of a troop or platoon of up to 35 soldiers, with the important responsibility for advising and assisting junior officers."}]