[{"url": "http://germanfood.about.com/od/regionalspecialties/tp/12Germansausages.htm", "passage_text": "Introducing the most common German sausages. They are all delicious and the cause of much national pride. A sausage recipe from a certain area is a closely guarded secret and the sausage as beloved as the town’s soccer team. 9. Leberkaese (leberkäse literally liver) cheese From bavaria is a type of sausage that does not contain cheese or. Liver it is similar to a pink, meatloaf with very finely minced corned, beef pork and, onions spiced with, marjoram baked in a bread pan until a golden crust. develops"}, {"url": "http://www.chowhound.com/post/german-brand-sausage-761392#!", "passage_text": "Follow. Not sure it's pervasive in other regions but in the Rocky Mtns.. when you buy generic German sausage (as opposed to anything ending in Wurst) the package usually says German Brand Sausage... "}, {"url": "http://fetzers-sausage.com/SamplePage.html", "passage_text": ".: Fetzer's German Brand Sausage. Lean pork & beef makes the family recipe come alive with just the right amount of seasonings and spices that make Fetzer's German Brand Sausage the best, absolutly NO preservatives or additives here, you can taste the difference!"}, {"url": "http://handwich.hofmannbrands.com/", "passage_text": "Hofmann Sausage Company, New York’s 135-year old purveyor of premium meats, has been nationally recognized for its award winning Natural Casing German Franks, Snappy Grillers and other premium sausages and our new brand of premium, handcrafted grab and go artisan sandwiches. "}, {"url": "https://en.wikipedia.org/wiki/German_sausage", "passage_text": "A sausage is a food usually made from ground meat, often pork, beef or veal, along with salt, spices and breadcrumbs, with a skin around it. Typically, a sausage is formed in a casing traditionally made from intestine, but sometimes synthetic. Longaniza is the most common type of sausage, or at least the most common name in Chile for sausages that also could be classified as chorizo. The Chilean variety is made of four parts pork to one part bacon (or less) and seasoned with finely ground garlic, salt, pepper, cumin, oregano, paprika and chilli sauce."}, {"url": "https://en.wikipedia.org/wiki/Bratwurst", "passage_text": "Bratwurst (. [ˈbʁaːtvʊɐ̯st]. ) is a type of German sausage made from veal, pork or beef. The name is derived from the Old High German Braetwurst, brätwurst from- , braet brät finely, chopped Meat, and, wurst sausage although In modern german it is often associated with the, verb braten to pan fry. or roast"}, {"url": "http://fetzers-sausage.com/", "passage_text": "Fetzer s German Brand Sausages are authentic Old World recipe sausages produced using the freshest, leanest, hand crafted all natural meats, and the finest ingredients available. We use Carlton Farms meat exclusively, which is truly Fresh and Natural. Since 1880 they have been using the same old world recipes created by Eugen Fetzer s grandfather. They are still in use today. Eugen and Marianne Fetzer produced their famous sausage in Germany for 25 years until they came to the United States in 1978."}, {"url": "https://en.wikipedia.org/wiki/German_sausage", "passage_text": "A sausage consists of meat, cut into pieces or ground, and filled into a casing, with other ingredients. Ingredients may include a cheap starch filler such as breadcrumbs, seasoning and flavourings such as spices, and sometimes others. The meat may be from any animal, but is often pork, beef, or veal. Longaniza is the most common type of sausage, or at least the most common name in Chile for sausages that also could be classified as chorizo. The Chilean variety is made of four parts pork to one part bacon (or less) and seasoned with finely ground garlic, salt, pepper, cumin, oregano, paprika and chilli sauce."}, {"url": "http://germanfood.about.com/od/regionalspecialties/tp/12Germansausages.htm", "passage_text": "1. Bratwurst. Bratwurst and Rostbratwurst is a sausage made from finely minced pork and beef and usually grilled and served with sweet German mustard and a piece of bread or hard roll. 9. Leberkaese (leberkäse literally liver) cheese From bavaria is a type of sausage that does not contain cheese or. Liver it is similar to a pink, meatloaf with very finely minced corned, beef pork and, onions spiced with, marjoram baked in a bread pan until a golden crust. develops"}]