[{"url": "https://uk.answers.yahoo.com/question/index?qid=20061112030706AAmMXvf", "passage_text": "Coat pork with remaining crumbs. Roast pork on a rack in a roasting pan in middle of oven 15 minutes. Reduce temperature to 325°F and roast until an instant-read thermometer diagonally inserted at least 2 inches into meat registers 155°F, 1 to 1 1/4 hours more. Let pork stand, loosely covered, 10 minutes. "}, {"url": "http://community.tasteofhome.com/community_forums/f/30/p/154106/2137667.aspx", "passage_text": "At what temperature and for how long per pound do you cook a pork roast? My co-worker wants her daughter(13) to put the roast in the oven for her before she gets home, but she did't know at what temp and for how long to tell her to leave it in. She said it is a small 2 lb pork roast. 4. Place the roasting pan in the oven; cook for 10 minutes, then lower the heat to 300 degrees. 5. Cook for about 45 minutes, then start checking the roast's temperature with an instant-read thermometer. Remove the roast when the internal temperature, measured as deep into the roast as you can get, reads 165 degrees. 6."}, {"url": "http://busycooks.about.com/od/porkentreerecipes/r/reginapork.htm", "passage_text": "Preheat oven to 450 degrees. Roast pork for 20 minutes, then reduce heat to 250 degrees without opening the oven door. Roast the pork until the internal temperature registers 155 degrees, about 23-30 minutes per pound. Let roast stand, covered, 5-10 minutes before carving. You can also roast the pork at 350 degrees for 20-25 minutes per pound, until the internal temperature registers 155 degrees. Cover and let stand for 10 minutes, then carve to serve"}, {"url": "http://www.food.com/recipe/perfect-rump-roast-294196", "passage_text": "1 Put the Roast in the oven and sear for 20 minutes. 2  Then add the water, the chopped onion and reduce the temperature to 275 degrees. 3  Cook for 20 minutes per lb. 4  I like mine rare so that is what you will get if you cook for this period of time. 1 Now Salt and Pepper the rest of the roast. 2  Put the Roast in the oven and sear for 20 minutes. 3  Then add the water, the chopped onion and reduce the temperature to 275 degrees. 4  Cook for 20 minutes per lb. 5"}, {"url": "http://community.tasteofhome.com/community_forums/f/30/p/154106/2137667.aspx", "passage_text": "3. Heat the oven to 500 degrees for a raw roast, 375 for a pre-browned one. 4. Place the roasting pan in the oven; cook for 10 minutes, then lower the heat to 300 degrees. 5. Cook for about 45 minutes, then start checking the roast's temperature with an instant-read thermometer. Remove the roast when the internal temperature, measured as deep into the roast as you can get, reads 165 degrees. 6."}, {"url": "https://answers.yahoo.com/question/index?qid=20070124120604AAoMcMw", "passage_text": "Best Answer: I'd say cook it at 350 F for at least 2.0 hours or 20 to 25 mins per pound. We always cook ours in a crock pot and that is on high for about 5 hours. If you add veggies etc. add after meat is just about done and then cook til veggies are cooked to desired doneness. (WOW that sounds really official). Good luck, and with our pork, we always add garlic, ginger etc"}, {"url": "http://www.food.com/recipe/perfect-rump-roast-294196", "passage_text": "1 Prep the roast by making 4-5 slits in the roast and filling the holes with salt, pepper and 1/2 of a clove of Garlic. 2  Now Salt and Pepper the rest of the roast. 3  Put the Roast in the oven and sear for 20 minutes. 4  Then add the water, the chopped onion and reduce the temperature to 275 degrees. 5  Cook for 20 minutes per lb. 1 Now Salt and Pepper the rest of the roast. 2  Put the Roast in the oven and sear for 20 minutes. 3  Then add the water, the chopped onion and reduce the temperature to 275 degrees. 4  Cook for 20 minutes per lb. 5  I like mine rare so that is what you will get if you cook for this period of time."}, {"url": "http://community.tasteofhome.com/community_forums/f/30/p/154106/2137667.aspx", "passage_text": "Should take 30-45 minutes per pound, but, it all depends on the internal temperature of the pork roast, more than the amount of time. It used to be 165F but some people say that is too long or past rare; and 185F is dry and stringy. 4. Place the roasting pan in the oven; cook for 10 minutes, then lower the heat to 300 degrees. 5. Cook for about 45 minutes, then start checking the roast's temperature with an instant-read thermometer. Remove the roast when the internal temperature, measured as deep into the roast as you can get, reads 165 degrees. 6."}, {"url": "https://answers.yahoo.com/question/index?qid=20070124120604AAoMcMw", "passage_text": "· just now. Report Abuse. I would put it in at 375 degrees for about 1 1/2 to 2 hours depending how you like it and the strength of your oven. It helps if you cover it with aluminum foil and every 30 minutes go in and with a baster take the juices and pour it over the pork roast so it doesn't dry out. We always cook ours in a crock pot and that is on high for about 5 hours. If you add veggies etc. add after meat is just about done and then cook til veggies are cooked to desired doneness. (WOW that sounds really official)."}, {"url": "http://www.copykat.com/2015/01/02/roasted-pork-loin/?hvid=3RcLkd", "passage_text": "To cook the pork roast correctly, make sure you note how much the meat weighs, it takes approximately 25 minutes per pound at 350 degrees. The internal temperature of the pork roast should between 145 and 160 degrees. Do not overcook the pork, it will become dry. Also make sure you allow the pork loin roast for about 10 minutes before serving. There is no need to cover the roast with foil or a lid while it is cooking; this is a dry roasting technique. One of my favorite ways to cook a pork loin is with garlic and rosemary. You can make one of these in the oven; it is practically fool-proof. This recipe only requires a 4 to 5 pound pork loin, kosher salt, some fresh rosemary and garlic."}]