[{"url": "http://www.halfbakedharvest.com/homemade-harissa-spicy-red-pepper-sauce/", "passage_text": "If you have never heard of Harissa it is a spicy sauce used in a lot of Moroccan cooking. Typically it is used as a garnish, with eggs, or sometimes it can be mixed into dishes too. To be honest, this is the first time I have even tried Harissa. Puree, purée slowly pouring in the olive oil to thicken the. Sauce if desired add-1 2 tablespoons of the reserved chile water to thin the sauce a (Bit i did not do). This season to taste with salt and extra lemon. Juice The harissa will keep refrigerated for a few. weeks"}, {"url": "http://www.seriouseats.com/2011/08/spice-hunting-harissa-north-african-tunisian-hot-sauce-paste-how-to-use.html", "passage_text": "Powerful stuff, but with the potential to make your food taste like sriracha at the expense of anything else. Harissa, artfully blended with oil, garlic, and lemon, kissed with cumin and coriander, is a whole different game. It can be as hot or not as you want it to be. And beneath a jolt of sharp, bright chile drums a beat of spice that elevates and compliments instead of overpowers. "}, {"url": "http://www.thekitchn.com/how-to-make-harissa-cooking-lessons-from-the-kitchn-190188", "passage_text": "Taste and adjust seasonings. The flavor of the harissa will deepen over the next day or two, but you can taste it now and add more salt or other optional ingredients to your liking. Top with olive oil and store. Transfer the harissa to a jar and cover the surface with a thin layer of olive oil. Combine the chiles, ground spices, garlic, and salt in the bowl of a food processor. (You can also use a mortar and pestle.) Make a paste. With the food processor running, slowly drizzle in the olive oil and process to form a smooth and thick paste."}, {"url": "http://www.wisegeek.org/what-is-harissa.htm", "passage_text": "10 most extreme places on Earth. Harissa is a spicy sauce that is a major feature in North African cuisine. It can be used like a condiment, and frequently the sauce appears on the table in a small dish as an accompaniment to traditional meals. It is also a major ingredient in many soups, stews, and curries. "}, {"url": "https://en.wikipedia.org/wiki/Harissa", "passage_text": "Harissa is sometimes described as Tunisia's main condiment, even the national condiment of Tunisia, or at least as the hallmark of Tunisia's fish and meat dishes. In Tunisia, harissa is used as an ingredient in a meat (goat or lamb) or fish stew with vegetables, and as a flavoring for couscous. It is also used for lablabi, a chickpea soup usually eaten for breakfast. In Algeria, harissa is commonly added to soups, stews, and couscous. In 2006, the Tunisian production of harissa was 22,000 tonnes, incorporating about 40,000 tonnes of peppers. Tunisian harissa is often made with chilis grown around Nabeul and Gabes, gabès which are relatively, mild 40,000-50,000 50000 on The scoville. scale"}, {"url": "http://tasty-yummies.com/2015/02/03/how-to-make-harissa-paste/", "passage_text": "Harissa is made by blending chiles into a thick paste with aromatic spices, a good quality olive oil, garlic, lemon juice and from there, the optional add-ins are endless. You can add roasted red pepper, roasted carrots or sun dried tomatoes, fresh herbs and so on. You may have to add a little more oil or you can also add some of the water used to soak the chiles. Make as thin or as thick as you would like. Give it a taste and adjust your seasonings, if necessary. Now, proceed to put it on ALL the things! Seriously. Storage: transfer the paste into an airtight glass jar."}, {"url": "http://www.thekitchn.com/how-to-make-harissa-cooking-lessons-from-the-kitchn-190188", "passage_text": "To make harissa, the chiles are blended into a thick paste with garlic, olive oil, and aromatic spices such as caraway and coriander (I like using cumin, too). Again, you can make it your own by adding a squeeze of lemon, herbs like mint, or even incorporating tomatoes or bell peppers. Or just keep it simple. Combine the chiles, ground spices, garlic, and salt in the bowl of a food processor. (You can also use a mortar and pestle.) Make a paste. With the food processor running, slowly drizzle in the olive oil and process to form a smooth and thick paste."}, {"url": "http://moroccanfood.about.com/od/spiceblendsmarinades/r/harissa_recipe.htm", "passage_text": "Tunisian in origin, harissa is a delicious red chili pepper condiment now accepted as part of Moroccan cuisine. Dried red chili peppers are ground to a paste with garlic, spices, lemon juice and olive oil. Some Moroccan recipes also include tomato paste or puree or roasted red peppers, but I prefer this version. "}, {"url": "http://www.ehow.com/about_5457368_harissa-sauce.html", "passage_text": "Green harissa is made with green chilies, spinach, herbs such as cilantro and mint, and spices. Moroccan harissa tends toward the gentler side, usually incorporating just rehydrated red chilies, tomato paste and salt, but in Tunisia and Algeria, garlic and lots of spices are added. A spicy, chili-flavored paste from the Middle East and North Africa, harissa sauce, usually known as simply harissa, adds pizzazz to many dishes. It is extremely popular in Algeria, Tunisia, Libya and Morocco as well as in France and Israel."}]