[{"url": "http://abcnews.go.com/Politics/political-convention/story?id=17066073", "passage_text": "By definition, a convention is a formal meeting of members, representatives or delegates, as of a political party, fraternal society, profession or industry, and that's what kicked off in Tampa, Fla., Monday and kicked into high gear Tuesday."}, {"url": "http://www.answers.com/Q/What_is_the_purpose_of_political_parties", "passage_text": "A political party's purpose is to gain majority party control of the government by nominating candidates for office, coordinating c … ampaigns, providing cues for voters, articulating policies, and coordinating policy-making."}, {"url": "https://apgovt.wikispaces.com/Ch+12+Political+Parties+-+Study+Questions+%28with+Answers%29", "passage_text": "Another function of a political party is to influence public opinion. By that, parties should make an effort to sway people to support and to vote for them. They should be the other option to an existing opposing candidate. 4) Discuss what a third party is and why they occur."}, {"url": "http://www.answers.com/Q/What_are_the_five_purposes_of_political_parties", "passage_text": "A political party's purpose is to gain majority party control of the government by nominating candidates for office, coordinating c … ampaigns, providing cues for voters, articulating policies, and coordinating policy-making. 5 people found this useful. Shakori Kae. 2 Contributions."}, {"url": "http://www.answers.com/Q/What_are_the_five_purposes_of_political_parties", "passage_text": "The purpose of having competing political parties is to make sure  one party does not have complete power, and that the people have a …  choice."}, {"url": "https://quizlet.com/1692529/political-parties-flash-cards/", "passage_text": "This type of party system only allows one party. Mostly all of them are dictatorships. Advantages: If people believe in their policies, the same party can benefit them. There's also no dispute over policies. Disadvantage: People have no choice if they disagree with the one party's policy."}, {"url": "http://www.answers.com/Q/What_is_the_purpose_of_political_parties", "passage_text": "Political parties exist to present a united front on issues. As a defeated motion in Canadian politics means a call for a new election it is important that the government in power is able to have a constant succession of passed motion."}, {"url": "http://www.wwnorton.com/college/polisci/governingtexas/ch/04/outline.aspx", "passage_text": "1. Perhaps the most important function of parties in Texas is that they provide a label under which candidates may run and with which voters may identify. 2. Approximately 91 percent of Texas voters either identify with or lean toward the Republican Party or the Democratic Party."}, {"url": "https://apgovt.wikispaces.com/Ch+12+Political+Parties+-+Study+Questions+%28with+Answers%29", "passage_text": "3) Discuss two functions of a political party. The main purpose of political parties is to join people, who hold similar points of view about the government, together. These groups work to participate and influence the government by having members elected to a government position."}]