[{"url": "http://www.wikihow.com/Feed-Chickens", "passage_text": "Change the starter feed to “grower feed” purchased from a feed supply store at 8 to 10 weeks. The protein level should be around 16 percent protein. Birds that will be used for meat can have up to 20 percent protein in their grower feed."}, {"url": "http://www.wikihow.com/Feed-Chickens", "passage_text": "Begin feeding your laying hens layer feed at 20 weeks of age. You can also use all-purpose feed; however, layer feed can have up to 2 percent more protein and more calcium content to promote better eggshells. You will need 18 to 24 lbs. (8 to 11 kg) of feed per week for 10 chickens. 1  You can purchase layer feed in pellet, mash or crumble forms, the choice is up to you."}, {"url": "http://poultryone.com/articles/feedingchickens-html", "passage_text": "If you’re raising layer hens: From when your chicks hatch until six weeks of age, feed your chicks a starter feed that has a protein level of 20-22 percent. Once the chicks hit six weeks of age, feed them pullet grower (14 to 16 percent protein) until age 20 weeks."}, {"url": "http://www.feathersite.com/Poultry/BRKRaisingChicks.html", "passage_text": "A chick starter feed should be fed to all chicks until they are 6 weeks of age. You can get this at your local feed store. After this time, feed them a pullet grower feed until about 20 weeks (25 weeks for heavy breeds like Cochins and Brahmas). Then they can be switched to a laying feed."}, {"url": "http://www.backyardchickens.com/t/337284/how-long-to-feed-chick-starter", "passage_text": "Last year, with my first babies, my chicken lady maven recommended that at about 12 weeks, mix the chick feed with adult layer feed, 50-50, then by about 16-17 weeks or so, totally on the adult feed. She also suggested holding off on the extra calcium until about 20 weeks or so, until right before they started to lay."}, {"url": "http://poultryone.com/articles/feedingchickens-html", "passage_text": "If you’re raising meat birds: Provide broiler starter with a protein level of 20 to 24 percent from the point of hatching to six weeks of age. After that, switch your meat chickens to broiler finisher (16 to 20 percent protein) until the birds are sent to be slaughtered."}, {"url": "http://www.backyardchickens.com/t/476101/how-long-do-chicks-need-to-be-on-chick-starter", "passage_text": "It's usually recommended that chicks be on starter until they are 8 weeks old and then switched to GROWER until they begin to lay, around 18-20 weeks (assuming you have layers). After that it's wise to switch them to layer feed, for the extra calcium and nice, strong egg shells."}, {"url": "http://www.backyardchickens.com/t/476101/how-long-do-chicks-need-to-be-on-chick-starter", "passage_text": "Hi-. It's usually recommended that chicks be on starter until they are 8 weeks old and then switched to GROWER until they begin to lay, around 18-20 weeks (assuming you have layers). After that it's wise to switch them to layer feed, for the extra calcium and nice, strong egg shells. Scratch is not a complete food."}, {"url": "http://www.feathersite.com/Poultry/BRKRaisingChicks.html", "passage_text": "For chicks from 1 day to 6 weeks you need to feed a starter feed. Feed comes in 3 forms: mash, crumbles and pellets. Mash is powdery, just as it sounds. Pellets are made of compressed mash, and crumbles of broken up pellets. I find mash wasteful and never use it."}]