[{"url": "http://www.livestrong.com/article/536133-the-best-ways-to-cook-a-rump-roast-as-choice-meat/", "passage_text": "Season the roast, sear it in hot oil and cook it in a 250 degree Fahrenheit oven for roughly 30 minutes per pound. One of the keys to keeping it tender is to slice it very thin just as you find in a delicatessen. In fact, if you purchase roast beef in a deli, there is a good chance you are getting rump roast. "}, {"url": "http://www.food.com/recipe/tender-juicy-roast-beef-ever-121393", "passage_text": "Directions. 1  Salt and pepper roast all over. 2  Place roast in roasting pan in a pre-heated oven at 450 for 15 minute. 3  Add a little water in pan to loosen up juices. 4  Turn down oven to 325 and cook for 1 hour and 10 minute. 5  Take out and cover with aluminun foil for 30 minute. 1 Add a little water in pan to loosen up juices. 2  Turn down oven to 325 and cook for 1 hour and 10 minute. 3  Take out and cover with aluminun foil for 30 minute. 4  You can choose to make gravy with the drippings or do what I do and use two packets McCormick Brown gravy and pour in the juice from the roast."}, {"url": "http://www.ehow.com/how_5147152_cook-tender-roast.html", "passage_text": "Season the roast with salt, pepper and Italian seasoning. Preheat Dutch oven on top of stove on medium-high. Add oil and swirl to cover the bottom of the pan. Brown the roast on both sides. Lift the roast and place the onion and garlic underneath it. Turn off the heat and add the beef broth and tomato sauce. Cover tightly and place in the preheated oven. Bake until tender, approximately 3 ½ to 4 hours. Add additional beef broth or water if necessary during cooking, do not allow it to cook dry"}, {"url": "http://www.wikihow.com/Cook-a-Beef-Rump-Roast", "passage_text": "Place in the oven and roast for 1 1/2 hours, or 30 minutes per pound. 7. Test the roast to make sure it's done. Remove the lid or foil from the pan and insert a meat thermometer into the roast. 1  Rare meat is done when its temperature has reached 125 degrees Fahrenheit(52 degrees Celsius). It's also the perfect type of meat to cook in a crock pot or slow cooker. This article describes three methods of cooking rump roast: braised in the oven, cooked in a slow cooker, and marinated. 1  Prep time (Braised): 15 minutes. 2  Cook time: 90 minutes. 3  Total time: 115 minutes."}, {"url": "http://www.food.com/recipe/tender-juicy-roast-beef-ever-121393", "passage_text": "1 Salt and pepper roast all over. 2  Place roast in roasting pan in a pre-heated oven at 450 for 15 minute. 3  Add a little water in pan to loosen up juices. 4  Turn down oven to 325 and cook for 1 hour and 10 minute. 5  Take out and cover with aluminun foil for 30 minute. 1 Add a little water in pan to loosen up juices. 2  Turn down oven to 325 and cook for 1 hour and 10 minute. 3  Take out and cover with aluminun foil for 30 minute. 4  You can choose to make gravy with the drippings or do what I do and use two packets McCormick Brown gravy and pour in the juice from the roast."}, {"url": "http://www.food.com/recipe/tender-juicy-roast-beef-ever-121393", "passage_text": "1 Place roast in roasting pan in a pre-heated oven at 450 for 15 minute. 2  Add a little water in pan to loosen up juices. 3  Turn down oven to 325 and cook for 1 hour and 10 minute. 1 Add a little water in pan to loosen up juices. 2  Turn down oven to 325 and cook for 1 hour and 10 minute. 3  Take out and cover with aluminun foil for 30 minute. 4  You can choose to make gravy with the drippings or do what I do and use two packets McCormick Brown gravy and pour in the juice from the roast."}, {"url": "http://www.wikihow.com/Cook-a-Beef-Rump-Roast", "passage_text": "3. Heat oil in a large dutch oven or frying pan. Place the roast in the pan and cook until it is brown on all sides. 1  Don't move the roast around in the pan until it is browned and ready to turn. Moving the meat will prevent it from browning thoroughly. 2  Do not overcook; remove the meat as soon as it is brown on all sides. It's also the perfect type of meat to cook in a crock pot or slow cooker. This article describes three methods of cooking rump roast: braised in the oven, cooked in a slow cooker, and marinated. 1  Prep time (Braised): 15 minutes. 2  Cook time: 90 minutes. 3  Total time: 115 minutes."}, {"url": "http://www.food.com/recipe/perfect-rump-roast-294196", "passage_text": "1 Put the Roast in the oven and sear for 20 minutes. 2  Then add the water, the chopped onion and reduce the temperature to 275 degrees. 3  Cook for 20 minutes per lb. 4  I like mine rare so that is what you will get if you cook for this period of time. 1 Pre-Heat the oven to 500 degrees. 2  Prep the roast by making 4-5 slits in the roast and filling the holes with salt, pepper and 1/2 of a clove of Garlic. 3  Now Salt and Pepper the rest of the roast. 4 "}, {"url": "http://www.food.com/recipe/perfect-rump-roast-294196", "passage_text": "1 Prep the roast by making 4-5 slits in the roast and filling the holes with salt, pepper and 1/2 of a clove of Garlic. 2  Now Salt and Pepper the rest of the roast. 3  Put the Roast in the oven and sear for 20 minutes. 4  Then add the water, the chopped onion and reduce the temperature to 275 degrees. 5  Cook for 20 minutes per lb. 1 Pre-Heat the oven to 500 degrees. 2  Prep the roast by making 4-5 slits in the roast and filling the holes with salt, pepper and 1/2 of a clove of Garlic. 3  Now Salt and Pepper the rest of the roast. 4"}]