[{"url": "http://www.opentable.com/sakana-sushi", "passage_text": "Come experience the variety of authentic foods and atmosphere. Sakana serves the best sushi in town. Japanese food is presently enjoying popularity in many parts of the world because it is not only pleasant to the eye and delicious, but is also highly regarded as health food. just want to confirm what I read from the previous review-the service was really poor. No response for questions, slow on request and she showed a really sad face to us. And also it was so noisy by having the radio out there with all the advertising commercials. Food was good but service and ambiance was horrible."}, {"url": "http://www.wisegeek.com/what-is-sakana.htm", "passage_text": "Some other more exotic fish items also can be on the menu where this kind of food is served. These include different kinds of roe or eggs from fish, sea urchins and other sea creatures. The squid, a staple in Japanese cooking, can also be used in this kind of food. Other kinds of sakana plates are vegetarian. Edamame is a very common snack anywhere that Japanese food is enjoyed. All of these could be part of a sakana-style presentation in a Japanese restaurant or other venue. In their original areas, these foods are often served in a particular kind of small bar known for the combination of food and drink mentioned above."}, {"url": "http://www.sakanajapanesesushi.com/", "passage_text": "DINE IN OR CARRY OUT. Sakana Japanese Sushi restaurants offer delicious dining and carryout to Meridian & Boise, Idaho. Sakana Japanese Sushi is a cornerstone in the Meridian and Boise communities and has been recognized for its outstanding Chinese & Asian cuisine, excellent service and friendly staff. "}, {"url": "http://www.wisegeek.com/what-is-sakana.htm", "passage_text": "Some associate the word sakana with fish because of its meaning in Japanese, which can refer to dried fish. One common characteristic of sakana dishes is that they do not usually include rice, which many other Japanese dishes do. Edamame is a very common snack anywhere that Japanese food is enjoyed. All of these could be part of a sakana-style presentation in a Japanese restaurant or other venue. In their original areas, these foods are often served in a particular kind of small bar known for the combination of food and drink mentioned above."}, {"url": "https://en.wikipedia.org/wiki/Sakana", "passage_text": "Sakana (肴) or shukō (酒肴) is a Japanese term referring to food eaten as an accompaniment to alcohol. Sakana may also be referred to as otsumami; this term usually applies to smaller dishes. Because fish, especially dried fish, was a popular choice for these dishes, over the years the term sakana also came to mean fish. In Japan, when alcohol is consumed, it is customary that the drinks are always accompanied with some sort of foodstuff. The term sakana traditionally refer to food served to accompany sake. These are usually quite salty and served in relatively small portions."}, {"url": "http://www.wisegeek.com/what-is-sakana.htm", "passage_text": "Top 10 facts about the world. Sakana is a sort of Japanese food. These foods could be called appetizers, and are frequently eaten along with alcoholic drinks. Most often, they are served in smaller plates and can often be quite salty. They are meant to be foods that can soak up alcohol and prevent increased inebriation. Edamame is a very common snack anywhere that Japanese food is enjoyed. All of these could be part of a sakana-style presentation in a Japanese restaurant or other venue. In their original areas, these foods are often served in a particular kind of small bar known for the combination of food and drink mentioned above."}, {"url": "http://www.sfsakana.com/main.php", "passage_text": "5:00PM-1:00AM(FRI-SAT). SAKANA SUSHI BAR & GRILL offers some of the most authentic Japanese cuisine in San Francisco. Founded in 1996 in downtown San Francisco, SAKANA's warm environment, great tasting food, and friendly service make the customers keep coming back from all over. the world. Tourists often wander right past this Post Street hole-in-the-wall sushi spot -- unless they're in the know or from Japan."}, {"url": "http://www.opentable.com/sakana-sushi", "passage_text": "The hello kitty roll is fantastic. As is crunchy roll and sakana roll. The udon is also really good if you are not in a sushi mood or with someone that doesn't want sushi. It isn't just a sushi place and I have ben happy with everything I have gotten there. just want to confirm what I read from the previous review-the service was really poor. No response for questions, slow on request and she showed a really sad face to us. And also it was so noisy by having the radio out there with all the advertising commercials. Food was good but service and ambiance was horrible."}, {"url": "http://www.sakanaoftokyo.com/", "passage_text": "The SAKANA OF TOKYO serves one of the highest quality Asian cuisines in Indianapolis. A favorite Japanese restaurant of local residents, customers speak highly of our specialty rolls, fresh authentic dishes and our friendly atmosphere. We offer you the very best sushi and quality food you'll ever find in Indianapolis. Japanese restaurant & bar is now hiring employees. The job application is available to download here. Filled application can be sent to contact@sakanaoftokyo.com or can be turned in at Sakan of Tokyo. The exact location is shown here."}]