[{"url": "http://www.niu.edu/onecard/huskiebucks/deposit/vts.shtml", "passage_text": "Value Transfer Stations (VTS Machines). Anyone may deposit cash into a Huskie Bucks account at the Value Transfer Stations (VTS Machines) around NIU's campus. The machines accept bills in the increments of $1, $5, $10, and $20 bills. They allow deposits to Huskie Bucks accounts on NIU OneCard ID's, as well as onto VTS Courtesy Cards. It is not possible to remove funds from an account with a VTS Machine."}, {"url": "http://www.loegering.com/tracksystems/vts.asp", "passage_text": "The VTS-Versatile Track System® is a complete rubber track undercarriage that bolts directly to your skid steer's standard hubs. VTS® utilizes forward placement of the front idler wheel to maintain flotation as well as added stability."}, {"url": "http://www.vulcangroup.com/product/vts-gantry/", "passage_text": "A library of motions is available, that is accessible by the operator, to make complex movements simple such as angular planes, radiuses, etc. Categories: Metal Removal Robots, Robotics, VTS Tags: Cut-Machines, Grinders & Cut-Offs, Manipulator, Metal Removal Robots, Reach Robots, Robotics, VTS."}, {"url": "http://www.vulcangroup.com/product/vts-gantry/", "passage_text": "VTS™ – Gantry Mounted Model. Leading edge manipulator/robotic technology, the VTS ™ (Vulcan Tactile System) is a telemanipulator using an Industrial Robot. This machine provides 3 modes of operation – Manual, Semi-Automatic, Fully Automatic."}, {"url": "http://www.vulcangroup.com/product/vts-gantry/", "passage_text": "The VTS ™ (Vulcan Tactile System) is a telemanipulator using an Industrial Robot. This machine provides 3 modes of operation – Manual, Semi-Automatic, Fully Automatic. The use of Tactile Force Feedback allows the operator to manually control the robot, not just program it."}, {"url": "http://www.loegering.com/data/upfiles/Owners%20Manual,%20Track,%20VTS%20(Mar%2009).pdf", "passage_text": "CAPACITIES When using the VTS system the machine will be able to push and lift larger loads; however, Loegering Mfg. recommends you do not exceed the manufacture’s push and lift maximums. The maximum machine weight for the large VTS is 10,500 lbs (4,763 kg)."}]