[{"url": "https://en.wikipedia.org/wiki/The_Scorpion_and_the_Frog", "passage_text": "The Scorpion and the Frog is an animal fable that seems to have first emerged in 1954. On account of its dark morality, there have been many references to it since then in popular culture, including in notable films, television shows, and books. "}, {"url": "http://www.ianridpath.com/startales/scorpius.htm", "passage_text": "Beta Scorpii is called Graffias, Latin for ‘claws’. This star is sometimes also known as Acrab, from the Arabic for ‘scorpion’. Delta Scorpii is called Dschubba, a strange-sounding name that is a corruption of the Arabic word meaning ‘forehead’, in reference to its position in the middle of the scorpion’s head. “There is a certain place where the scorpion with his tail and curving claws sprawls across two signs of the zodiac”, wrote Ovid in his Metamorphoses."}, {"url": "https://en.wikipedia.org/wiki/Scorpius", "passage_text": "There is also a version that Orion was better than the goddess Artemis but said that Artemis was better than he and so Artemis took a liking to Orion. The god Apollo, Artemis's twin brother, grew angry and sent a scorpion to attack Orion. After Orion was killed, Artemis asked Zeus to put Orion up in the sky. Scorpius is one of the constellations of the zodiac. Its name is Latin for scorpion, and its symbol is (Unicode ♏)."}, {"url": "https://en.wikipedia.org/wiki/Scorpion", "passage_text": "Scorpions are predatory arthropod animals of the order Scorpiones within the class Arachnida. They have eight legs and are easily recognised by the pair of grasping pedipalps and the narrow, segmented tail, often carried in a characteristic forward curve over the back, ending with a venomous stinger. Scorpion stings are painful but are usually harmless. For stings from species found in the United States, no treatment is normally needed for healthy adults although medical care should be sought for children and for the elderly."}, {"url": "http://exoticpets.about.com/cs/scorpions/a/scorpionanatomy.htm", "passage_text": "Lianne McLeod. The telson and pedipalps are the parts of the scorpion anatomy owners should be most aware of, as these comprise the main weapons of scorpion. They are shown in the labelled photo to the right. 1  Telson-specially modified segment at the tip of the tail that contains the venom gland (i.e. the stinger). "}, {"url": "https://en.wikipedia.org/wiki/Scorpius", "passage_text": "Marking the tip of the scorpion's curved tail are λ Sco (Shaula) and υ Sco (Lesath), whose names both mean sting.. Given their proximity to one another, λ Sco and υ Sco are sometimes referred to as the Cat's Eyes. The constellation's bright stars form a pattern like a longshoreman's hook. Scorpius is one of the constellations of the zodiac. Its name is Latin for scorpion, and its symbol is (Unicode ♏)."}, {"url": "http://www.orkin.com/stinging-pests/scorpions/scorpion-stinger/", "passage_text": "Scorpions have elongated bodies and segmented tails that are tipped with a sharp, venomous stinger. These stingers are the prickly organs designed for both offensive and defensive purposes; they have a poison gland ready to inflict a venomous wound from a single sting. Most scorpion stings will only cause pain and swelling similar to a wasp sting unless a person is allergic to the scorpion’s venom. Still, the fact remains that some scorpions are feared because their stingers are very deadly. Some of the most venomous scorpions are known to exist in Africa, India, Mexico and Arizona."}, {"url": "http://www.answers.com/Q/What_is_the_end_of_a_scorpion's_tail_called", "passage_text": "Scorpions have 2 natural enemies. The 1st is a frog that is immune to the scorpion's venom and the 2nd is a mammal called the meerkat. The meerkat is also immune to the scorpi … on's venom."}, {"url": "http://www.answers.com/Q/What_is_the_end_of_a_scorpion's_tail_called", "passage_text": "A scorpion's stinger is on the very end of its tail, so when it  wants to sting something the front two pincers will grab it to hold  it in place then the tail will come dow … n and strike they  prey/victim. 3 people found this useful. The 1st is a frog that is immune to the scorpion's venom and the 2nd is a mammal called the meerkat. The meerkat is also immune to the scorpi … on's venom."}, {"url": "http://www.orkin.com/stinging-pests/scorpions/scorpion-stinger/", "passage_text": "The curved scorpion stinger is found at the end of a scorpion’s arched tail, and is used to paralyze and kill any of a scorpion’s prey, such as insects and spiders. Scorpions hold prey using their large front claws in order to sting it. Most scorpion stings will only cause pain and swelling similar to a wasp sting unless a person is allergic to the scorpion’s venom. Still, the fact remains that some scorpions are feared because their stingers are very deadly. Some of the most venomous scorpions are known to exist in Africa, India, Mexico and Arizona."}]