[{"url": "http://www.goflyfishinguk.com/fly-fishing-locations/yorkshire-dales/river-wharfe.php", "passage_text": "Trout fishing on the River Wharfe starts around the end of March and finishes at the end of September with Grayling fishing starting in mid June and finishing at the end of February. Our guides in the Yorkshire Dales have many years of fly fishing experience on the River Wharfe and can teach you these techniques and find you fish. All tackle including waders and flies can be supplied or if you prefer you can bring your own."}, {"url": "http://www.godsowncounty.co.uk/yorkshire-history/top-bridges-over-the-river-wharfe/", "passage_text": "Leave a reply. Little bridges over the gills that feed the early reaches of the river Wharfe can be found at Cray and Yockenthwaite. Crook Gill and Cray Gill have individual bridges and where they meet there is another bridge called Stubbing Bridge. Yockenthwaite is on the old packhorse route from Wensleydale to Ribblesdale and has a bronze age stone circle near by. Our first serious bridge over the Wharfe is at Hubberholme. It connects the church, (where JB Priestley’s ashes were placed), to the George Inn and is on the old drover road from Lancaster to Newcastle. Getting greedy or functional, further down stream we have seven bridges in the parish of Linton."}, {"url": "http://www.goflyfishinguk.com/fly-fishing-locations/yorkshire-dales/river-wharfe.php", "passage_text": "The best of the fly fishing on the River Wharfe is in the Yorkshire Dales National Park above Bolton Abbey and within easy reach of Leeds, Bradford, Manchester, Harrogate and York. There is a direct rail link to Skipton from London Kings Cross which makes it easy to visit even from the South of England. Our guides in the Yorkshire Dales have many years of fly fishing experience on the River Wharfe and can teach you these techniques and find you fish. All tackle including waders and flies can be supplied or if you prefer you can bring your own."}, {"url": "https://en.wikipedia.org/wiki/River_Wharfe", "passage_text": "The River Wharfe is a river in Yorkshire, England. For much of its length it is the county boundary between West Yorkshire and North Yorkshire. The name Wharfe derives from the Old English 'weorf' or Old Norse 'hverfr' and means winding river. The valley of the River Wharfe is known as Wharfedale. The river source is at Beckermonds, Langstrothdale in the Yorkshire Dales National Park and flows through Kettlewell, Grassington, Bolton Abbey, Addingham, Ilkley, Burley-in-Wharfedale, Otley, Wetherby and Tadcaster"}, {"url": "http://www.yorkshire-dales-flyfishing.com/wharfe.htm", "passage_text": "The River Wharfe is probably the most famous of the Yorkshire rivers, maybe because of the top quality fly fishing it provides, or perhaps because it is surrounded by the most outstanding scenery. Other, more modern fly fishing methods, are also very successful today. The River Wharfe responds particularly well to the duo method of fishing a dry fly and nymph together and also to fishing a single dry fly-the Wharfe trout and grayling are very free rising."}, {"url": "http://www.goflyfishinguk.com/fly-fishing-locations/yorkshire-dales/river-wharfe.php", "passage_text": "Fly Fishing on the River Wharfe. The River Wharfe is the premier freestone or spate fly fishing river in the Yorkshire Dales and probably the most famous of all the rivers in the North of England. Our guides in the Yorkshire Dales have many years of fly fishing experience on the River Wharfe and can teach you these techniques and find you fish. All tackle including waders and flies can be supplied or if you prefer you can bring your own."}, {"url": "http://www.ukriversguidebook.co.uk/rivers/england/north-east/green-field-beck", "passage_text": "This is one of two streams forming the River Wharfe, the other being Oughtershaw Beck. OS Grid Ref: WGS84 Lat: Lng: PUT-INS/ TAKE-OUTS: Start as high as you can get (see below), probably around SD850800. Finish is at Beckermonds, where the two becks join. SD873803 (Yorkshire Dales tourist map). "}, {"url": "http://www.yorkshire-dales-flyfishing.com/wharfe.htm", "passage_text": "The River Wharfe rises near Beckermonds, in Langstrothdale, at the head of Wharfedale and flows some 60 miles through the Yorkshire Dales to meet the Yorkshire Ouse at Cawood. On its journey downstream the River Wharfe flows through lovely dales villages such as Buckden, Kettlewell, Kilnsey, Grassington and Burnsall. Other, more modern fly fishing methods, are also very successful today. The River Wharfe responds particularly well to the duo method of fishing a dry fly and nymph together and also to fishing a single dry fly-the Wharfe trout and grayling are very free rising."}, {"url": "http://www.yorkshire-dales-flyfishing.com/wharfe.htm", "passage_text": "Access to good fly fishing on the River Wharfe is much better than the River Ure and I can guide you to many miles of good and varied fly fishing water. Fly fishing on the River Wharfe started a long time ago fishing the wet fly, or North Country Spider fishing as it is know. Other, more modern fly fishing methods, are also very successful today. The River Wharfe responds particularly well to the duo method of fishing a dry fly and nymph together and also to fishing a single dry fly-the Wharfe trout and grayling are very free rising."}]