[{"url": "http://www.mayoclinic.org/healthy-lifestyle/nutrition-and-healthy-eating/expert-answers/sodium-nitrate/faq-20057848", "passage_text": "Sodium nitrate, a preservative that's used in some processed meats, such as bacon, jerky and luncheon meats, could increase your heart disease risk. It's thought that sodium nitrate may damage your blood vessels, making your arteries more likely to harden and narrow, leading to heart disease. "}, {"url": "http://getfit.jillianmichaels.com/foods-containing-high-levels-nitrates-1862.html", "passage_text": "Nitrates form from the decomposition of nitrogen-rich waste present in soil and water. Plants that come into contact with nitrate-rich soil or water contain varying levels of nitrates. When farmer's add fertilizers with nitrates to crops, some of the nitrates move from the soil into the plants. Vegetables can contain nitrates, and over 70 percent of the nitrates the average adult consumes comes from nitrates in natural foods, according to the Agency for Toxic Substances and Disease Registry. The agency indicates that nitrate-rich vegetables do not normally give you dangerous levels of nitrate"}, {"url": "http://www.livestrong.com/article/264858-list-of-foods-that-have-sodium-nitrate/", "passage_text": "Sodium Nitrate -- Meat Preservative. Sodium nitrate is present in foods such as hot dogs, lunch meat, bacon, ham, smoked fish, salami and beef jerky. You can read the ingredient list on the food labels to see if a food contains sodium nitrate as a preservative. Sodium nitrate is a type of salt used to preserve foods, particularly cured meat. It's added to cured meat to extend its shelf life by preventing rancidity and the growth of bacteria. The U.S. Environmental Protection Agency has set a legal limit for the concentration of nitrate allowed in food"}, {"url": "http://www.eatrightontario.ca/en/Articles/Food-technology/Biotechnology/Novel-foods/The-truth-about-nitrates.aspx", "passage_text": "Nitrates are naturally found in some vegetables, dairy products and meat. There is no recommendation to limit foods that naturally contain nitrates. Nitrates are also added to processed meats as a preservative. There is strong research that shows a diet high in processed meats increases the risk of colon cancer. 1 This means that the food may contain nitrates. 2  Avoid processed meat or have them once in awhile. 3  Have a cooked ham during the holidays or an occasional hot dog in the summer. 4  Skip the bacon and sausage for breakfast and try fresh fruit or grilled vegetables with your eggs."}, {"url": "http://www.ehow.com/how-does_4914598_do-nitrates-food-do-body.html", "passage_text": "Sources of Nitrates. Nitrates are not only found naturally in the soil, water and atmosphere, but are also in fruits and vegetables such as broccoli, cauliflower, collard greens and root vegetables. Preservatives, particularly those in processed meats such as hot dogs and deli meats, contain nitrates. Nitrates are found naturally in the environment -- mineral deposits, soil, fertilizers, seawater and even the atmosphere -- from which they enter the food you eat and the water you drink. Small amounts of nitrates won’t hurt you, but scientists need more research to determine safe upper limits."}, {"url": "http://www.healthychild.org/how-to-avoid-added-nitrates-and-nitrites-in-your-food/", "passage_text": "These foods may contain added chemicals you should know about: nitrates and nitrites. Manufacturers add nitrates and nitrites to foods such as cured sandwich meats, bacon, salami or sausages to give them color and to prolong their shelf life. 1 In addition to lunchmeat, some canned beans and vegetables with bacon, and even packaged seafood, may contain these added chemicals. 2  Eat organic food. 3  Synthetic nitrates and nitrites are not allowed as preservatives in organic packaged foods and meats."}, {"url": "http://www.healthychild.org/how-to-avoid-added-nitrates-and-nitrites-in-your-food/", "passage_text": "The naturally occurring nitrates in food come with vitamin C and other compounds that inhibit conversion into nitrosamines. There is no data to suggest that naturally occurring nitrates are harmful, so keep on eating those healthful foods. Here’s how to keep added nitrates and nitrites out of your body: 1  Minimize your consumption of processed foods and cured meat products such as hot dogs, sausage and cold cuts. 2  Check labels carefully and avoid products that list sodium or potassium nitrates and nitrites. 3  Eat organic food. 4  Find out if your water is tainted with nitrates or nitrites. 5  E 1 In addition to lunchmeat, some canned beans and vegetables with bacon, and even packaged seafood, may contain these added chemicals. 2  Eat organic food. 3  Synthetic nitrates and nitrites are not allowed as preservatives in organic packaged foods and meats."}]