[{"url": "http://electron6.phys.utk.edu/101/CH5/temperature.htm", "passage_text": "The absolute temperature of any substance is proportional to the average kinetic energy associated with the random motion of the substance. In a gas the individual atoms and molecules are moving randomly. The average kinetic energy of the molecules in a gas is proportional to the absolute temperature T of the gas."}, {"url": "http://www.chegg.com/homework-help/questions-and-answers/temperature-generally-proportional-substance-s--chemical-energy-b-vibrational-potential-en-q3453746", "passage_text": "Temperature is generally proportional to a substance's _____. A) chemical energy B) vibrational potential energy C) rotational kinetic energy D) average translational kinetic energy The force of gravity between two bodies depends on their _____."}, {"url": "http://www.kids.esdb.bg/heat_principles.html", "passage_text": "Temperature is a number that is related to the average kinetic energy of the molecules of a substance. If temperature is measured in Kelvin degrees, then this number is directly proportional to the average kinetic energy of the molecules. Heat is a measurement of the total energy in"}, {"url": "http://www.gwc.maricopa.edu/class/phy101/ptest/p101chap10pretest.pdf", "passage_text": "Chapter 10: Temperature and Heat 1. The temperature of a substance is A. proportional to the average kinetic energy of the molecules in a substance. B. equal to the kinetic energy of the fastest moving molecule in the substance. C. proportional to the lowest kinetic energy available to a molecule."}, {"url": "http://www.zonalandeducation.com/mstm/physics/mechanics/energy/heatAndTemperature/heatAndTemperature.html", "passage_text": "Here is the relation: If temperature is measured in Kelvin degrees, then the value of temperature is directly proportional to the average kinetic energy of the molecules of a substance. Note that temperature is not energy, it is a number proportional to a type of energy."}, {"url": "http://www.kids.esdb.bg/heat_principles.html", "passage_text": "Since Kelvin temperature is directly proportional to the average kinetic energy of molecules in a substance, an factor increase in temperature causes an equal factor increase in the average kinetic energy of the molecules."}, {"url": "http://www.zonalandeducation.com/mstm/physics/mechanics/energy/heatAndTemperature/gasMoleculeMotion/gasMoleculeMotion.html", "passage_text": "Temperature, when measured in Kelvin degrees, is a number that is directly proportional to the average kinetic energy of the molecules in a substance. So, when the molecules of a substance have a small average kinetic energy, then the temperature of the substance is low."}]