[{"url": "http://www.timeanddate.com/holidays/common/epiphany", "passage_text": "Celebrate Epiphany. January 6, which is 12 days after Christmas in the Gregorian calendar, marks not only the end of the Christmas holidays but also the start of the Carnival season, which climaxes with Mardi Gras."}, {"url": "http://www.timeanddate.com/holidays/common/epiphany", "passage_text": "Many Christians around the world annually celebrate Epiphany on January 6. It is a public holiday in many countries and marks two events in Jesus Christ’s life, according to the Christian Bible. The first event was when the three wise men, or kings, visited infant Jesus."}, {"url": "http://www.timeanddate.com/holidays/common/epiphany", "passage_text": "Epiphany is commonly known as Three Kings’ Day or the Feast of the Epiphany. It means “manifestation” or “showing forth”. It is also called Theophany (“manifestation of God”), especially by Eastern Christians."}, {"url": "http://www.timeanddate.com/holidays/us/epiphany", "passage_text": "Epiphany, commonly known as Three Kings’ Day in the United States, is on January 6. It celebrates the three wise men’s visit to baby Jesus and also remembers his baptism, according to the Christian Bible’s events."}, {"url": "http://www.timeanddate.com/holidays/common/epiphany", "passage_text": "Epiphany is a public holiday in countries such as Austria, Colombia, Croatia, Cyprus, Poland, Ethiopia (but on different date that varies annually), parts of Germany, Greece, Italy, Slovakia, Spain, and Uruguay."}, {"url": "http://www.bbc.co.uk/religion/religions/christianity/holydays/epiphany.shtml", "passage_text": "The Epiphany is an ancient Christian feast day and is significant in a number of ways. It celebrates the baptism of Jesus by John the Baptist and also celebrates Jesus' birth. Decoration showing the three kings on camelback following the star ©."}, {"url": "http://www.merriam-webster.com/dictionary/epiphany", "passage_text": "Full Definition of EPIPHANY. 1. capitalized: January 6 observed as a church festival in commemoration of the coming of the Magi as the first manifestation of Christ to the Gentiles or in the Eastern Church in commemoration of the baptism of Christ. 2. : an appearance or manifestation especially of a divine being. 3."}]