[{"url": "http://healthyeating.sfgate.com/can-women-drink-whey-protein-trying-lose-weight-8694.html", "passage_text": "Uses. To achieve weight loss with whey protein, you need to use it in a smart way. Rather than adding extra calories to your diet by drinking a whey shake in addition to meals, use the shake as a replacement for a daily snack or small meal. Since many bodybuilders and weight trainers use whey protein in an effort to add muscle mass, it might come as a surprise that it can also encourage weight loss."}, {"url": "http://www.shape.com/healthy-eating/diet-tips/whey-best-protein-powder-weight-loss", "passage_text": "3 More Types of Protein Powder. But there's a third reason why whey protein is recommended for people trying to lose weight: “It's the most effective food you can eat to help you turn on a process called protein synthesis, which starts the building new muscle,” says Arciero. In layman's terms, extra protein will ensure that you hold on to the muscle you already have—muscle mass is often a casualty during weight-loss attempts—and it will help you gain muscle more easily too."}, {"url": "http://www.bodybuilding.com/fun/how-whey-helps-drop-body-fat.htm", "passage_text": "A 2006 study found that adding 60 grams of whey protein per day, in comparison to 60 grams of soy protein or 60 grams of carbohydrate, led to significant decreases in body fat and weight after 6 months. 1  Use a food journal and write down everything you eat. If you've made changes to what, when and how much you eat as well as your training program but you still can't seem to drop that stubborn body fat, consider how the bodybuilding supplement whey protein may help."}, {"url": "http://healthyeating.sfgate.com/can-women-drink-whey-protein-trying-lose-weight-8694.html", "passage_text": "One theory behind the correlation between whey protein and weight loss is that protein encourages you to eat less. According to research published in “The American Journal of Clinical Nutrition” in 2008, protein is a more satiating nutrient than either fat or carbohydrate. Since many bodybuilders and weight trainers use whey protein in an effort to add muscle mass, it might come as a surprise that it can also encourage weight loss."}, {"url": "http://www.bodybuilding.com/fun/how-whey-helps-drop-body-fat.htm", "passage_text": "Whey protein is a milk protein that is the liquid by-product of cheese production. In supplement form, whey protein comes in three main forms: 1  Whey Protein Concentrate: Contains some fat and lactose and between 29% - 89% protein depending on the specific product. If you've made changes to what, when and how much you eat as well as your training program but you still can't seem to drop that stubborn body fat, consider how the bodybuilding supplement whey protein may help."}, {"url": "http://health.howstuffworks.com/wellness/natural-medicine/alternative/whey-protein4.htm", "passage_text": "The difference was in the kind of weight they lost. The people who used whey protein lost body fat, not muscle [source: Frestedt ]. Being able to lose weight but hang onto lean muscle has some important health implications. For one thing, your base metabolism is higher if you have a higher muscle-to-fat ratio. The body will do what it does with every excess nutrient: make fat. Sound dietary planning and physical activity remain the cornerstones of any weight loss program. Neither whey protein nor any other supplement is going to lose the weight for you. You still have to do the work."}, {"url": "http://www.livescience.com/45120-whey-protein-supplements.html", "passage_text": "Whey protein is a popular diet supplement among people of all ages. Baby formulas include it, as do nutrition shakes for the elderly. Weight-loss supplements contain whey powder as an appetite suppressor, yet young men buy whey protein powder by the gallon in hopes of building muscle mass. Like all proteins, whey protein is made of building blocks called amino acids. Protein in the body is primarily used for muscle growth and to repair tissues. When people digest food, they break down the proteins into amino acids, and then use those amino acids to build new proteins."}, {"url": "http://www.nutritionexpress.com/article+index/diet+weight+loss/diet+plans+tips/showarticle.aspx?id=1904", "passage_text": "Protein, carb and fat guide. Protein – eat 75 to 175 grams of protein per day Most people should eat between 0.5 to 1 gram of protein per pound of ideal body weight. Eating protein helps prevent the breakdown of muscle so your weight loss is fat, not muscle. In one study where dieters doubled their protein intake, they experienced a reduced appetite and consumed fewer calories, which ultimately led to significant weight loss."}, {"url": "http://www.med-health.net/Whey-Protein-Weight-Loss.html", "passage_text": "Derived from milk, whey protein is a mix of protein, amino acids, lactose and minerals. Whey contains very little fat since whey is the fluid that is left behind after the fats in milk form a solid called cheese. The liquid is then dehydrated to form a whey protein powder that is commonly used to build muscle. This will give you increased protein to use during the exercise resulting in increased fat burn and increased muscle building. Recipe. Ingredient and Instruction. Vanilla Whey Protein Shake. Ingredients: 1  Whey protein powder -- 2 tablespoons. 2  Low fat milk -- 1/2 cup."}, {"url": "http://www.wellnessresources.com/tips/articles/how_protein_helps_weight_loss/", "passage_text": "My recommendations for weight loss, based on helping thousands of people lose weight, is to consume 30 percent protein (600 calories), 30 percent carbohydrates (600 calories), and 40 percent fat (800 calories). Do not snack and do not eat after dinner at night. Eat either two or three meals a day. "}]