[{"url": "http://niams.nih.gov/Health_Info/Lupus/", "passage_text": "Other symptoms of lupus include chest pain, hair loss, anemia (a decrease in red blood cells), mouth ulcers, and pale or purple fingers and toes from cold and stress. Some people also experience headaches, dizziness, depression, confusion, or seizures."}, {"url": "http://www.medicalnewstoday.com/info/lupus", "passage_text": "1 Certain medications can provoke SLE-like symptoms (drug-induced lupus), which then disappear once the medications are stopped. 2  Subacute cutaneous lupus erythematosus is a type of lupus that causes skin lesions that appear on parts of the body exposed to sun."}, {"url": "http://www.healthline.com/health/lupus/early-signs", "passage_text": "Lupus is an autoimmune disease that causes swelling (inflammation) and a wide variety of symptoms. Lupus affects each individual uniquely. Some people have only a few mild symptoms and others have many, more severe symptoms. Symptoms usually start in early adulthood, anywhere from the teen years to the 30s."}, {"url": "https://www.womenshealth.gov/publications/our-publications/fact-sheet/lupus.html", "passage_text": "1 Drug-induced lupus is a form of lupus caused by certain medicines. 2  The symptoms of drug-induced lupus are like those of systemic lupus, but only rarely affect major organs. 3  Symptoms can include joint pain, muscle pain, and fever, and are mild for most people."}, {"url": "http://www.emedicinehealth.com/lupus_systemic_lupus_erythematosus_health/article_em.htm", "passage_text": "Systemic lupus erythematosus (SLE), or lupus, is an autoimmune disease in which a person's immune system attacks various organs or cells of the body, causing damage and dysfunction. Lupus is called a multisystem disease because it can affect many different tissues and organs in the body."}, {"url": "http://www.mayoclinic.org/diseases-conditions/lupus/basics/causes/CON-20019676", "passage_text": "The cause for lupus in most cases, however, is unknown. Some potential triggers include: 1  Sunlight. 2  Exposure to the sun may bring on lupus skin lesions or trigger an internal response in susceptible people. 3  Infections. 4  Having an infection can initiate lupus or cause a relapse in some people. 5  Medications."}, {"url": "http://umm.edu/health/medical/reports/articles/systemic-lupus-erythematosus", "passage_text": "Systematic Lupus Erythematosus (SLE) Overview. SLE is an autoimmune disease that causes a chronic inflammatory condition. The inflammation triggered by SLE can affect many organs in the body, including skin, joints, kidneys, lung, and nervous system."}]