[{"url": "https://answers.yahoo.com/question/index?qid=20080714145414AAZO8uX", "passage_text": "As to # of follicles, Clomid only increases the chance for twins by about 10% or less. Most women do NOT have multiple mature follicles when on Clomid. They may have a lot of follicles going into the cycle. . . but one will usually dominate and mature. It sounds like you are in this situation."}, {"url": "http://iamtryingtoconceive.com/topic/25121/how-many-folliclessize-are-typical-after-clomid-how-big-for-trigger/", "passage_text": "That's a great size for CD10 and you can expect them both to ovulate together. With clomid expect follicles to grow 1-3mm per day. Average is prob 3mm jump every 2 days. You are looking at triggering around CD 14-16 which is typical for clomid taken CD 5-7. If you had taken it CD 3-5 you would have been earlier."}, {"url": "https://in.answers.yahoo.com/question/index?qid=20080501230210AAtutse", "passage_text": "Best Answer: Try not to be anxious it wont help anything! I only had one mature follicle on my second cycle of clomid and i got pregnant, i also had the ovidrel shot but i had it on day 15 (i did clomid days 5-9). Good luck hope you get a BFP!!! Source(s): 22 weeks #1 It a girl!!! Emma's Mummy!!"}, {"url": "http://www.inspire.com/groups/living-after-infertility-resolution/discussion/did-you-get-preg-w-multiples-after-iui-w-injectables/", "passage_text": "I am currently 12 weeks pregnant with twins from injectables and IUI. I had three mature and five smaller follicles at the time of trigger. I had three heartbeats at 6 weeks, 4 days and then only two remained at 9 weeks, 4 days."}, {"url": "http://babyandbump.momtastic.com/assisted-conception/629043-1-follicle-2-eggs.html", "passage_text": "After 6 years of trying to conceive we are finally pregnant. 4th iui cycle but follie ovulated itself. We are expecting twins non identical own sacs and own placenta. Someone told me oh you had to have had 2 follies for this to happen. I am trying to find out of it is possible for 1 follicle to have 2 eggs."}, {"url": "https://in.answers.yahoo.com/question/index?qid=20080501230210AAtutse", "passage_text": "The chances are lower with only one mature follicle but it can happen. You will know more by the May blood workup. I have to say I don't miss all those Dr's appts and all that blood being drawn when i was TTC. Goodluck and hope it worked out for you."}]