[{"url": "http://articles.latimes.com/2011/feb/19/health/la-he-ancient-grains-20110220", "passage_text": "Newer products assert that they're made with grains that are true to their original form, as Trader Joe's Ancient Grain Bread (made with quinoa, oats, amaranth, Kamut, millet, teff and barley) states on its label. The ancient grains — confusingly — are not all grains. Grains are technically grasses. By that standard, Kamut, spelt and wheat are all grains, but quinoa and amaranth are not. Still, the common term grain has stuck for all of them. Grains such as quinoa, amaranth, spelt and Kamut are called ancient because they've been around, unchanged, for millennia. "}, {"url": "http://www.coreperformance.com/daily/nutrition/12-ancient-grains-you-may-have-never-tried.html", "passage_text": "Grains like wheat, corn, oats, and rice are the most popular on the market, but ancient grains are making a comeback. Now available in many specialty health food stores like Whole Foods, these delicious grains offer more of a variety of tastes, textures, and nutrients. Kamut. A form of grain grown in many cultures and is believed to have first been grown in Egypt or Asia, kamut is two to three times the size of common wheat and has 20-40 percent more protein and 65 percent more amino acids."}, {"url": "http://www.fda.gov/Food/GuidanceRegulation/GuidanceDocumentsRegulatoryInformation/LabelingNutrition/ucm059088.htm", "passage_text": "What products are made from durum wheat? Answer: Durum wheat is a type of wheat that has a high protein content and the flour has a yellow color. It is typically used for semolina and pastas. Durum flour should not be considered a whole grain flour because the germ and bran have been removed (21 CFR 137.220)."}, {"url": "http://www.glnc.org.au/grains/types-of-grains/wheat/", "passage_text": "Aside from bread wheat and durum, other types of wheat include spelt, emmer, einkorn and kamut. These wheat varieties are commonly referred to as ‘ancient’ grains and are increasingly being used in the manufacture of niche wheat-based food products. 1  Spelt is higher in protein than common wheat and can be used in place of common wheat in most recipes."}, {"url": "http://www.glnc.org.au/grains/types-of-grains/wheat/", "passage_text": "Wheat Types. Many different types of wheat grain exist, with two main types being eaten in Australia, namely bread wheat (Triticum aestivum vulgare) and durum wheat (Triticum turgidum durum). The durum variety is used in the manufacture of pasta while the other type is used to produce most other wheat-based foods. These wheat varieties are commonly referred to as ‘ancient’ grains and are increasingly being used in the manufacture of niche wheat-based food products. 1  Spelt is higher in protein than common wheat and can be used in place of common wheat in most recipes."}, {"url": "http://www.realsimple.com/food-recipes/shopping-storing/food/common-types-grains", "passage_text": "Start Right Arrow. Grains are an essential element in a healthy diet, and eating high-fiber whole grains may help reduce your risk of heart disease, ward off diabetes, and control cholesterol. 1  Start."}, {"url": "http://www.recipetips.com/kitchen-tips/t--1007/types-of-grain.asp", "passage_text": "Farro is an ancient Italian grain that is similar in taste to barley. In the United States, farro is known as a type of spelt or wheat. It is a hulled grain, meaning that the hull adheres to the grain when harvested, similar to barley and oats. The hull is then removed during processing. "}, {"url": "http://vegetarian.about.com/od/ingredientsandadditives/tp/Seven-Types-Of-Whole-Grains.htm", "passage_text": "Regular readers know that quinoa is my all-time favorite whole grain. Allow me to count the ways. First, it's much quicker-cooking than other whole grains. Quinoa takes about 15 minutes to cook, while some other grains can take upwards of an hour or more, and quinoa flakes cook in just a few minutes. Second, it's incredibly high in protein with 18 grams per cup, cooked."}, {"url": "https://en.wikipedia.org/wiki/Whole_grain", "passage_text": "Wheat flour (as opposed to wholegrain wheat flour or whole-wheat flour) as the first ingredient is not a clear indicator of the product's wholegrain content. If two ingredients are listed as grain products but only the second is listed as wholegrain, the entire product may contain between 1% and 49% wholegrain. A whole grain is a cereal grain that contains the germ, endosperm, and bran, in contrast to refined grains, which retain only the endosperm."}, {"url": "http://www.coreperformance.com/daily/nutrition/12-ancient-grains-you-may-have-never-tried.html", "passage_text": "Overall, wheat berries are high in fiber and protein and contain a variety of nutrients including vitamin E, calcium, B vitamins, folate, and potassium. Eat wheat berries in place of pasta, rice, and other grains, or use them in salads and side dishes. Kamut. A form of grain grown in many cultures and is believed to have first been grown in Egypt or Asia, kamut is two to three times the size of common wheat and has 20-40 percent more protein and 65 percent more amino acids."}]