[{"url": "http://www.calendar-updates.com/info/holidays/canada/winter.aspx", "passage_text": "In Canada and the rest of the northern hemisphere, the first day of the winter season is the day of the year when the Sun is farthest south (on December 21 st or 22 nd). This day is known as the Winter Solstice. The declination of the Sun on the winter solstice is known as the tropic of capricorn (-23° 27')."}, {"url": "http://www.calendar-updates.com/info/holidays/us/winter.aspx", "passage_text": "In the United States and the rest of the northern hemisphere, the first day of the winter season is the day of the year when the Sun is farthest south (on December 21 st or 22 nd). This day is known as the Winter Solstice."}, {"url": "http://www.almanac.com/content/first-day-seasons", "passage_text": "Astronomically speaking, in the Northern Hemisphere, the winter solstice is defined as when the Sun reaches its greatest declination (23-1/2 degrees) south of the celestial equator, around December 21. So, winter 2012 marks the time when the first day of winter begins for 2012/2013."}, {"url": "http://www.calendar-updates.com/info/holidays/canada/winter.aspx", "passage_text": "Winter. In Canada and the rest of the northern hemisphere, the first day of the winter season is the day of the year when the Sun is farthest south (on December 21 st or 22 nd). This day is known as the Winter Solstice. The declination of the Sun on the winter solstice is known as the tropic of capricorn (-23° 27')."}, {"url": "http://www.calendar-updates.com/info/holidays/us/winter.aspx", "passage_text": "That means it is warmer and we have summer. The day of the winter solstice is the shortest day of the year. The length of time elapsed between sunrise and sunset on this day is a minimum for the year. In the United States, there are only about 9½ hours of daylight on this day."}, {"url": "http://www.almanac.com/content/first-day-seasons", "passage_text": "December 21, 2012, at 6:12 am EST starts the first day of winter 2012/2013 (often just listed as winter 2012). Winter 2013/2014 (winter 2013) would begin on December 21, 2013, at 12:11 pm EST. In astronomy, each year in the Northern Hemisphere can be defined as beginning with the spring (vernal) equinox in March."}, {"url": "http://www.answers.com/Q/When_is_the_first_day_of_winter", "passage_text": "The official first day of the astronomical winter as mandated my the International Astronomical Union is December 21/22, 2011 (depending on the time zone) for the northern hemisphere and June 21, 2012 for the southern hemisphere."}]