[{"url": "http://agoodewedding.com/seating_procedures.htm", "passage_text": "Rights: The bride s family and friends sit on the left side of the aisle at the ceremony. The men of the wedding party wear their boutonnieres on their left lapels. The bride and groom wear their wedding rings on their left hands. The groom s family and friends sit on the right side of the aisle at the ceremony. The ushers offer each female guest their right arm as they escort her to her seat. The bride walks down the aisle on her father s right. During the wedding ceremony, the bride wears her engagement ring on her right hand"}, {"url": "http://www.wikihow.com/Know-Where-to-Sit-at-a-Wedding", "passage_text": "1. Learn that the bride and groom's parents sit according to whether they are parents of the bride or groom. 1  Seat the parents of the bride on the left side, in the front pew of the church, if the bride is given away, or at Catholic weddings. 2  The groom's family will then sit on the right side, also near the aisle. 1 The groom's family will then sit on the right side, also near the aisle. 2  This may be reversed for cases in which the couple enters the church down the aisle together (which is customary in many Protestant denominational churches). 3  In this case, the bride will probably walk on the right side and the groom on the left."}, {"url": "http://emilypost.com/advice/ceremony-seating-arrangements/", "passage_text": "The bride’s parents sit on the left side of the center section and the groom’s parents on the right. Seating widowed parents: Widowed parents of either the bride or groom may prefer to have someone by their side during the ceremony, and it is perfectly correct to do so. Their companion is treated as an honored guest. "}, {"url": "http://etiquette.about.com/od/Receptions/f/Where-Do-I-Sit-At-A-Wedding.htm", "passage_text": "1 The bride's parents should be in the very front on the left for a Christian wedding or right for a Jewish wedding. 2  The groom's parents should be in the front on the other side. 3  If there is room, the grandparents can be seated in the same pew or row. "}, {"url": "https://www.theknot.com/content/seating-at-the-head-table", "passage_text": "A: Traditionally, the bridal party head table is seated boy/girl, starting with the best man next to the bride and the maid of honor next to the groom. But you don't have to do it that way -- you could seat women on the bride's side and men on the groom's, or let everyone sit where they want. Unless their parents are in the wedding party, young children in the wedding usually sit with their parents at another reception table (young being the operative word)."}, {"url": "https://www.theknot.com/content/on-which-side-does-each-family-sit-at-the-ceremony", "passage_text": "A: In Christian ceremonies, the bride's family sits on the left, the groom's on the right. Likewise, the bride stands at the left at the altar while the groom stands to her right. In a Jewish ceremony, it's the opposite; the bride and her family are on the right, the groom and his are on the left."}, {"url": "http://www.bridesofaustralia.com/Wedding_Ceremony_Etiquette.html", "passage_text": "The groom's family and friends will sit on the right side of the church. If the church has two centre aisles, the bride's side sits on both sides of the left aisle, the groom's on both sides of the right. The parents sit in the centre section; the bride's on the left and groom's on the right. Q. Which order should the bride and grooms parents be seated? A. The head usher will escort the groom's mother to her seat. The groom's father follows a few feet behind the usher, and then takes a seat beside his wife. The groom's family and friends will sit on the right side of the church. If the church has two center"}, {"url": "http://blog.bridalspectacular.com/2012/05/30/chivalry-at-its-best-what-side-does-bride-stand-for-las-vegas-wedding-ceremony-and-why/", "passage_text": "Then the bride’s guests are seated on the left side of the ceremony area. Likewise, with the groom standing to the bride’s right, his guests should sit behind him on the ceremony area’s right side. No matter if the ceremony takes place in a church or on a country club lawn, the left-side bride is upheld as proper etiquette in Western tradition."}, {"url": "http://www.wikihow.com/Know-Where-to-Sit-at-a-Wedding", "passage_text": "1 Seat the parents of the bride on the left side, in the front pew of the church, if the bride is given away, or at Catholic weddings. 2  The groom's family will then sit on the right side, also near the aisle. 1 The groom's family will then sit on the right side, also near the aisle. 2  This may be reversed for cases in which the couple enters the church down the aisle together (which is customary in many Protestant denominational churches). 3  In this case, the bride will probably walk on the right side and the groom on the left."}]