[{"url": "http://www.ancient-minerals.com/magnesium-sources/dietary/", "passage_text": "The majority of good magnesium sources contain only about 10% or less of recommended daily amounts, as seen in a list of the magnesium content in common food sources of magnesium. Those that do contain more, such as certain nuts, fish and whole grains, are often eaten in too small quantities by the average person. "}, {"url": "http://www.everydayhealth.com/pictures/foods-high-in-magnesium/", "passage_text": "Other legumes rich in magnesium include black beans, kidney beans, white beans, chickpeas, black-eyed peas, and lentils. 1  Avocado Loaded with multivitamins, heart-healthy nutrients, and disease-thwarting chemical compounds, avocados are one of the most nutritious and versatile produce picks around. 1 Other nuts and seeds high in magnesium include almonds, sunflower seeds, Brazil nuts, cashews, pine nuts, flaxseed, and pecans."}, {"url": "http://www.livestrong.com/article/70088-list-foods-rich-magnesium-potassium/", "passage_text": "According to the U.S. Department of Agriculture, certain nuts and seeds contain potassium, magnesium and calcium. Eating dried pumpkin seeds, almonds, cashews and pistachios boosts your intake of these minerals. Dairy and Animal Products. salmon is a good seafood choice to get more magnesium, potassium and calcium Photo Credit Maria_Lapina/iStock/Getty Images. Dairy products, such as milk, yogurt and cheese, are another good way to increase your intake of all three nutrients."}, {"url": "https://ods.od.nih.gov/factsheets/Magnesium-HealthProfessional/", "passage_text": "Food. Magnesium is widely distributed in plant and animal foods and in beverages. Green leafy vegetables, such as spinach, legumes, nuts, seeds, and whole grains, are good sources [ 1, 3 ]. In general, foods containing dietary fiber provide magnesium. Magnesium is also added to some breakfast cereals and other fortified foods. Some types of food processing, such as refining grains in ways that remove the nutrient-rich germ and bran, lower magnesium content substantially [ 1 ]. Selected food sources of magnesium are listed in Table 2."}, {"url": "http://www.ehow.com/facts_4815517_high-calcium-potassium-amp-magnesium.html", "passage_text": "Fruits rich in potassium include bananas, apricots, prunes, dates, cantaloupe, watermelon and strawberries. Foods such as salmon, beans, turkey and fish also contain potassium as do peas, greens, spinach and tomatoes. If you are consuming three of these items a day, you are probably getting enough potassium. Foods such as milk, cheese and yogurt contain calcium. So do dark leafy vegetables. Kale, turnip greens, broccoli, brussel sprouts and cabbage are rich sources of calcium. Canned fish (with bones), such as salmon, sardines and mackerel are also good choices"}, {"url": "http://www.livestrong.com/article/70088-list-foods-rich-magnesium-potassium/", "passage_text": "Magnesium, potassium and calcium are minerals that your body needs to maintain strong bones and normal muscle function. They are all electrolytes, or minerals that conduct electrical impulses in your body. These minerals help to maintain fluid balance, nerve transmissions and a healthy blood pressure. Dairy and Animal Products. salmon is a good seafood choice to get more magnesium, potassium and calcium Photo Credit Maria_Lapina/iStock/Getty Images. Dairy products, such as milk, yogurt and cheese, are another good way to increase your intake of all three nutrients."}, {"url": "http://www.ehow.com/facts_4815517_high-calcium-potassium-amp-magnesium.html", "passage_text": "Foods Rich In Calcium. Foods such as milk, cheese and yogurt contain calcium. So do dark leafy vegetables. Kale, turnip greens, broccoli, brussel sprouts and cabbage are rich sources of calcium. Canned fish (with bones), such as salmon, sardines and mackerel are also good choices"}]