[{"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMH0001413/", "passage_text": "The most obvious symptom of subacute thyroiditis is pain in the neck. Sometimes the pain can spread (radiate) to the jaw or ears. Painful enlargement of the thyroid gland may last for weeks or, in rare cases, months. Symptoms. The most obvious symptom of subacute thyroiditis is pain in the neck. Sometimes the pain can spread (radiate) to the jaw or ears. Painful enlargement of the thyroid gland may last for weeks or, in rare cases, months. Other symptoms include: Difficulty swallowing. Fatigue."}, {"url": "http://familydoctor.org/familydoctor/en/diseases-conditions/thyroiditis.html", "passage_text": "1 Results in permanent hypothyroidism, which can be treated. 2  Subacute thyroiditis (also called de Quervain's thyroiditis). 3  Possibly caused by a viral infection. 4  Causes pain in the thyroid and symptoms of hyperthyroidism, followed by hypothyroidism. 5  Symptoms improve within a few months. "}, {"url": "http://www.healthline.com/health/subacute-thyroiditis", "passage_text": "Subacute thyroiditis leads to pain and discomfort in the thyroid gland. Individuals with this condition will also have symptoms of overactive thyroid and later develop symptoms of underactive thyroid. Subacute thyroiditis generally occurs after an upper respiratory viral infection such as the flu or the mumps. The mumps is a highly contagious viral infection that causes inflamed salivary glands."}, {"url": "http://www.medicinenet.com/thyroiditis/page3.htm", "passage_text": "Subacute thyroiditis. Symptoms are the same as in postpartum and silent thyroiditis, but the inflammation in the thyroid leads to pain in the neck, jaw, or ear. Unlike the other types of thyroiditis, subacute thyroiditis may be caused by an infection. Thyroid Gland-Thyroiditis. SOURCE: U.S. Womenshealth.gov."}, {"url": "http://emedicine.medscape.com/article/125648-overview", "passage_text": "Background. Subacute thyroiditis is a self-limited thyroid condition associated with a triphasic clinical course of hyperthyroidism, hypothyroidism, and return to normal thyroid function. Subacute thyroiditis may be responsible for 15-20% of patients presenting with thyrotoxicosis and 10% of patients presenting with hypothyroidism. "}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMH0001413/", "passage_text": "Causes. Subacute thyroiditis is a rare condition. It is thought to be caused by a viral infection. The condition often occurs after a viral infection of the upper respiratory tract, such as mumps and influenza, or a common cold. Symptoms. The most obvious symptom of subacute thyroiditis is pain in the neck. Sometimes the pain can spread (radiate) to the jaw or ears. Painful enlargement of the thyroid gland may last for weeks or, in rare cases, months. Other symptoms include: Difficulty swallowing. Fatigue."}, {"url": "https://en.wikipedia.org/wiki/Subacute_thyroiditis", "passage_text": "Subacute thyroiditis is a form of thyroiditis that can be a cause of both thyrotoxicosis and hypothyroidism. It is uncommon and can affect individuals of both sexes and all ages. The most common form, subacute granulomatous, or de Quervain's, thyroiditis manifests as a sudden and painful enlargement of the thyroid gland accompanied with fever, malaise and muscle aches."}, {"url": "http://www.healthcommunities.com/thyroid-disorders/thyroiditis.shtml", "passage_text": "Thyroiditis is inflammation of the thyroid, the gland at the base of the neck that produces thyroid hormone (thyroxine), crucial in the regulation of body growth and metabolism. There are three types of thyroiditis: acute, subacute, and chronic. "}, {"url": "http://www.healthline.com/health/subacute-thyroiditis", "passage_text": "Thyroiditis refers to an inflamed thyroid. Your thyroid is a gland in the front of your neck that controls your metabolism by releasing a variety of hormones. Most types of thyroiditis do not cause pain in the thyroid gland. Subacute thyroiditis generally occurs after an upper respiratory viral infection such as the flu or the mumps. The mumps is a highly contagious viral infection that causes inflamed salivary glands."}]