[{"url": "https://www.whitehouse.gov/1600/presidents/johnadams", "passage_text": "John Adams. John Adams, a remarkable political philosopher, served as the second President of the United States (1797-1801), after serving as the first Vice President under President George Washington. Learned and thoughtful, John Adams was more remarkable as a political philosopher than as a politician. People and nations are forged in the fires of adversity, he said, doubtless thinking of his own as well as the American experience. Adams was born in the Massachusetts Bay Colony in 1735."}, {"url": "https://answers.yahoo.com/question/index?qid=20100218103424AA4pHRT", "passage_text": "Adams, as President, was beset with a lot of issues, both international and domestic, that were all new to a President and to the country as a whole. Adams' personality and management style were totally different from Washington, and besides, he followed Washington which would have been tough for anybody. Jefferson was one of the Republicans, who wanted stronger states' rights. This was really a fundamental difference between the Founding Fathers and it caused a split between Adams and Jefferson (who had been friends) that lasted into their later years. They eventually reconciled."}, {"url": "http://www.answers.com/Q/Did_john_Adams_believe_in_slaves", "passage_text": "So no, he wasn't a fan of slavery. John Adams, our first Vice President and second President, was a lifelong opponent of slavery. Even though he opposed the system of slavery, he did not oppose removing Jefferson's condemnation of slavery in the original draft of the Declaration of Independence. John Adams   John Adams (October 30, 1735 - July 4, 1826) was an American politician and the second President of the United States (1797-1801), after being the first Vice … President (1789-1797) for two terms. He is regarded as one of the most influential Founding Fathers of the United States"}, {"url": "http://www.adherents.com/people/pa/John_Adams.html", "passage_text": "John Adams is regarded as one of the most important Founding Fathers of the United States of America. Before becoming the second President of the United States, John Adams served as the Vice-President under President George Washington. Prior to that, John Adams was a signer of the Declaration of Independence as a delegate from Massachusetts. "}, {"url": "https://en.wikipedia.org/wiki/Adams,_John", "passage_text": "John Adams, Jr. (October 30. 1735 – July 4, 1826) was an American lawyer, author, statesman, and diplomat. He served as the second President of the United States (1797–1801), the first Vice President (1789–1797), and as a Founding Father was a leader of American independence from Great Britain. Adams was a political theorist in the Age of Enlightenment who promoted republicanism and a strong central government. Adams was the father of John Quincy Adams, the sixth President of the United States. He died on the fiftieth anniversary of the adoption of the Declaration of Independence. Modern historians in the aggregate have ranked his administration as the twelfth most successful."}, {"url": "https://answers.yahoo.com/question/index?qid=20100218103424AA4pHRT", "passage_text": "im writing an essay about why Thomas Jefferson was a good choice to vote for to be president..but i also have to explain why John Adams was a bad choice..i know that Thomas Jefferson believed in strong state government,state banks, agriculture, he was against tariffs, and that people should have a say in what... Jefferson was one of the Republicans, who wanted stronger states' rights. This was really a fundamental difference between the Founding Fathers and it caused a split between Adams and Jefferson (who had been friends) that lasted into their later years. They eventually reconciled."}, {"url": "https://answers.yahoo.com/question/index?qid=20100218103424AA4pHRT", "passage_text": "Best Answer: The biggest difference between Jefferson and Adams was that Adams was part of the group called Federalists, who wanted a strong centralized government. Jefferson was one of the Republicans, who wanted stronger states' rights. This was really a fundamental difference between the Founding Fathers and it caused a split between Adams and Jefferson (who had been friends) that lasted into their later years. They eventually reconciled."}, {"url": "http://www.history.com/topics/us-presidents/john-adams", "passage_text": "Introduction. John Adams (1735-1826) was a leader of the American Revolution, and served as the second U.S. president from 1797 to 1801. The Massachusetts-born, Harvard-educated Adams began his career as a lawyer. Find out about John Adams' political career in the newly formed United States, from his vice presidency under George Washington to his rocky term as America's chief executive."}, {"url": "http://www.encyclopedia.com/topic/John_Adams.aspx", "passage_text": "John Adams. The second president of the United States, John Adams (1735-1826) played a major role in the colonial movement toward independence. He wrote the Massachusetts Constitution of 1780 and served as a diplomatic representative of Congress in the 1780s. Adams, John (1735–1826) Second US president (1797–1801). Influenced by his radical cousin Samuel Adams, he helped draft the Declaration of Independence (1776) and the Treaty of Paris (1783) ending the American Revolution. Adams was George Washington's vice president (1789–97)."}]