[{"url": "http://www.cbn.com/cbnnews/healthscience/2010/June/How-to-Avoid-Processed-Foods-in-a-Healthy-Diet-/", "passage_text": "Some of everything you eat, for better or worse, ends up in your skin. So if you have a lot of soda or chemicals, that's going to be a stress on your skin. High sugar foods, highly processed foods, you'll see it in the skin for sure.. Although identifying processed foods and removing them from our diet isn't easy, it may be less troubling than dealing with the health problems they could create. *Originally published June 16, 2010. "}, {"url": "http://www.cancercenter.com/discussions/blog/natural-vs-refined-sugars-whats-the-difference/", "passage_text": "CTCA. Sugar, in all forms, is a simple carbohydrate that the body converts into glucose and uses for energy. But the effect on the body and your overall health depends on the type of sugar you’re eating, either natural or refined. Natural sugars are found in fruit as fructose and in dairy products, such as milk and cheese, as lactose. Foods with natural sugar have an important role in the diet of cancer patients and anyone trying to prevent cancer because they provide essential nutrients that keep the body healthy and help prevent disease."}, {"url": "http://www.prevention.com/beauty/natural-beauty/how-sugar-ages-your-skin", "passage_text": "At blame is a natural process that's known as glycation, in which the sugar in your bloodstream attaches to proteins to form harmful new molecules called advanced glycation end products (or, appropriately, AGEs for short). The more sugar you eat, the more AGEs you develop. "}, {"url": "http://lifehacker.com/5809331/what-sugar-actually-does-to-your-brain-and-body", "passage_text": "As previously mentioned in the section about processed and unprocessed foods, fiber is very necessary in curbing sugar intake. It does what fructose can't do, and that's alert you that you've consumed calories and you don't need to eat anymore. Basically, fiber and fructose need to work together. "}, {"url": "http://www.builtlean.com/2012/12/07/natural-vs-processed-sugar/", "passage_text": "We included 5 of these questions below which range from the difference between natural vs. processed sugar to whether building muscle can get rid of loose skin. Certainly a mix of interesting questions related to exercise, nutrition, body composition, and general health. Regarding “natural” sugar, all plants produce sugar as a byproduct of photosynthesis. Fruits and vegetables have sugar in the form of fructose, which is broken down more slowly by the body than sucrose."}, {"url": "http://www.cancercenter.com/discussions/blog/natural-vs-refined-sugars-whats-the-difference/", "passage_text": "Refined sugar comes from sugar cane or sugar beets, which are processed to extract the sugar. It is typically found as sucrose, which is the combination of glucose and fructose. We use white and brown sugars to sweeten cakes and cookies, coffee, cereal and even fruit. Natural sugars are found in fruit as fructose and in dairy products, such as milk and cheese, as lactose. Foods with natural sugar have an important role in the diet of cancer patients and anyone trying to prevent cancer because they provide essential nutrients that keep the body healthy and help prevent disease."}, {"url": "http://www.huffingtonpost.com/2013/10/10/sugar-bad-for-skin_n_4071548.html", "passage_text": "Simple carbohydrates, like refined sugar, white bread and soda, cause your insulin levels to spike, which leads to what Dr. Perricone describes as a burst of inflammation throughout the body.. Inflammation produces enzymes that break down collagen and elastin, resulting in sagging skin and wrinkles. Exfoliation is an important and easy way to buff away the dead skin cells that cover up your skin's natural glow. Use a light exfoliator, like the Daily Microfoliant from Dermalogica, to freshen your face daily. When choosing a foundation, test a product on the skin near your jawline."}, {"url": "http://health.howstuffworks.com/skin-care/information/nutrition/5-reasons-sugar-hurts-your-skin.htm", "passage_text": "Cakes, cookies, and candy are bad for your waistline – and your complexion. Nicholas Perricone, M.D., best-selling author of The Wrinkle Cure and The Perricone Prescription explains why a low-sugar diet may be the best way to get the beautiful skin you want. "}, {"url": "http://www.builtlean.com/2012/12/07/natural-vs-processed-sugar/", "passage_text": "In short, processed, or refined sugars are derived from sugar cane, or beets and ideally be avoided. Processed sugar, referred to scientifically as “sucrose”, is not only totally devoid of nutrients, but has added chemicals and raises blood sugar levels faster so you get energy/hunger swings. Regarding “natural” sugar, all plants produce sugar as a byproduct of photosynthesis. Fruits and vegetables have sugar in the form of fructose, which is broken down more slowly by the body than sucrose."}, {"url": "http://www.huffingtonpost.com/2013/10/10/sugar-bad-for-skin_n_4071548.html", "passage_text": "We spoke to Dr. Nicholas Perricone, a dermatologist and nutritionist with an eponymous skincare line, and Dr. Maryann Mikhail, a New York-based dermatologist, to get the lowdown on what exactly sugar does to your skin and what you can do about it. Exfoliation is an important and easy way to buff away the dead skin cells that cover up your skin's natural glow. Use a light exfoliator, like the Daily Microfoliant from Dermalogica, to freshen your face daily. When choosing a foundation, test a product on the skin near your jawline."}]