[{"url": "https://en.wikipedia.org/wiki/Polysaccharide", "passage_text": "Polysaccharides are an important class of biological polymers. Their function in living organisms is usually either structure-or storage-related. Starch (a polymer of glucose) is used as a storage polysaccharide in plants, being found in the form of both amylose and the branched amylopectin. In animals, the structurally similar glucose polymer is the more densely branched glycogen, sometimes called 'animal starch'"}, {"url": "http://www.innovateus.net/science/what-are-different-polysaccharides", "passage_text": "The three common polysaccharides are Starch, Glycogen and Cellulose. Starches: While Starches are basically glucose polymers they need the enzyme Amylase to be broken down into glucose or to be digested. Plants store glucose in the form of starches. Glycogen: This is a storage form of glucose which is broken down into glucose when needed by animals and humans. Cellulose: These are polysaccharides that are the components of plants and are used as building material."}, {"url": "https://dlc.dcccd.edu/biology1-3/carbohydrates", "passage_text": "Plants synthesize two types of polysaccharides, starch and cellulose. The glycosidic bonds between glucose units in plant starch are similar to those in animal glycogen. Accordingly, starch molecules are structurally similar, forming compact coils, and play a similar role in energy storage for plants. "}, {"url": "http://study.com/academy/lesson/polysaccharide-definition-examples-quiz.html", "passage_text": "As mentioned, polysaccharides can be used for energy storage. Typically, storage takes the form of starch in both plants and animals. A starch is a chain of glucose molecules that usually takes a linear form. In plants the common storage starch is amylose; in animals the common storage starch is glycogen. Polysaccharides are long-chain monosaccharides linked together by glycosidic bonds. They're typically used for either energy (starches) or structural purposes. Linear starches such as amylose are found in plants, and glycogen is found in animals."}, {"url": "http://www.answers.com/Q/Starch_and_are_common_polysaccharide_carbohydrates_found_in_plants", "passage_text": "A common polysaccharide found in plants would be starch. Starch is made up of roughly 20% amylose and 80% amylopectin which both have a very similar structure except amylope … ctin is made up of much larger molecules. It is the energy storage system like batteries. Another very common polysaccharide is cellulose. This is the main structural material. All of these molecules are made up of glucose molecules bonded together. In starch the bonds are alpha while in cellulose beta. This sort of means right handed for starch and left handed for cellulose."}, {"url": "http://www.answers.com/Q/Starch_and_are_common_polysaccharide_carbohydrates_found_in_plants", "passage_text": "Yes starch is a polysaccharide. The three most common types of polysaccharides are starch, glycogen, and cellulose. Starch is a glucose polymer and insoluble in water; t … hey must be digested with amylases. 5 people found this useful. Another very common polysaccharide is cellulose. This is the main structural material. All of these molecules are made up of glucose molecules bonded together. In starch the bonds are alpha while in cellulose beta. This sort of means right handed for starch and left handed for"}, {"url": "http://www.brooklyn.cuny.edu/bc/ahp/LAD/C4c/C4c_polysaccharides.html", "passage_text": "Sometimes known as glycans, there are three common and principal types of polysaccharide, cellulose, starch and glycogen, all made by joining together molecules of glucose in different ways. Polysaccharides are very large, high molecular weight biological molecules that are almost pure carbohydrate. "}, {"url": "https://en.wikipedia.org/wiki/Polysaccharide", "passage_text": "Examples include storage polysaccharides such as starch and glycogen, and structural polysaccharides such as cellulose and chitin. Polysaccharides are often quite heterogeneous, containing slight modifications of the repeating unit. Their function in living organisms is usually either structure-or storage-related. Starch (a polymer of glucose) is used as a storage polysaccharide in plants, being found in the form of both amylose and the branched amylopectin."}, {"url": "http://hyperphysics.phy-astr.gsu.edu/hbase/Organic/sugar.html", "passage_text": "Glucose is a carbohydrate, and is the most important simple sugar in human metabolism. Glucose is called a simple sugar or a monosaccharide because it is one of the smallest units which has the characteristics of this class of carbohydrates. Fructose is a carbohydrate, and is a simple sugar found in fruits. It is often called just fruit sugar. Fruct"}, {"url": "https://en.wikipedia.org/wiki/Starch", "passage_text": "Starch or amylum is a carbohydrate consisting of a large number of glucose units joined by glycosidic bonds. This polysaccharide is produced by most green plants as an energy store. It is the most common carbohydrate in human diets and is contained in large amounts in staple foods such as potatoes, wheat, maize (corn), rice, and cassava."}]