[{"url": "http://www.importantindia.com/15448/short-paragraph-on-punctuality-and-its-advantages/", "passage_text": "Punctuality. Meaning and definition: Punctuality means the exactness in keeping timer and appointments. It is defined as a quality by virtue of which a person is able to do the right thing at the right time and never offers an excuse for the delay in work. The need for punctuality in everyday life: Punctuality plays an important role in every walk of life. Advantages of punctuality: Punctuality is the key to success. A man who is punctual in his everyday life enjoys certain advantages which others do not get. 1  People have a great regard for a punctual man. 2  He is always successful in his work"}, {"url": "http://www.purdue.edu/faculty_staff_handbook/employee_responsibilities/attendance.html", "passage_text": "Attendance and Punctuality. Regular attendance and punctuality are vital attributes for all employees. It is important for employees to attend work regularly and to arrive at work on time, because failure to do so detrimentally affects employee morale and productivity. "}, {"url": "http://www.studymode.com/essays/Importance-Of-Punctuality-194688.html", "passage_text": "Punctuality is essential for man in every walk of life. For students it is a great blessing. If you are punctual you will get enough time to do your work according to your plan. In hospitals, punctuality can make all the difference, of course between life and death. You never face any difficulty so far as time is concerned. You command respect and admiration of all who work with you and are an asset."}, {"url": "http://www.course-notes.org/blog/maria30/The_Importance_of_punctuality", "passage_text": "The punctuality is the most important thing in life and in every step of the life by which the person get punctual in their every work original MBA assignment papers by which they get to be punctual and regular on the work and studies which is very necessary to get success in life. 1  Log in or register to post comments. "}, {"url": "http://www.insideballet.com/patience-perseverance-and-punctuality/", "passage_text": "So as someone once said, “Better late than never, but better never late!”. And so it is that patience, perseverance, and punctuality are wonderful characteristics bestowed upon those who dance. Each one is a necessity, and each one can easily be applied to any area of life as well. The best thing dance has taught me about patience is that I don’t expect to be a whiz the first time I try anything new. I know I just have to keep applying myself and that over time I may (or may not) become a whiz at it. Perseverance is an important trait in a dancer."}, {"url": "http://smallbusiness.chron.com/punctuality-important-workplace-10253.html", "passage_text": "Workplace Effects. Lack of punctuality not only affects the machine of the workplace -- it affects the people in it. It may lead to resentment, as coworkers who are on time compare themselves to late-comers. Being late throws you out of the loop, as you may miss important information. This causes a harmful division among employee"}, {"url": "http://www.importantindia.com/7613/short-essay-on-importance-of-punctuality/", "passage_text": "No comments. Punctuality is the most important characteristic of all successful people. A punctual person is able to complete all his task on time. The student, the teacher, the politician, the official, the trader and even the layman all have to observe punctuality in order to win glory and success in life. No school, college or institution can function if punctuality is not observed there. Thus, punctuality is an important ingredient of all successful people. Punctuality implies maintaining regularity in our daily schedule of work. Punctuality is the gate-way to success."}]