[{"url": "http://www.gardeningknowhow.com/plant-problems/disease/alternaria-leaf-spot.htm", "passage_text": "Alternaria symptoms once infection begins include small, dark, circular spots that regularly reach ½ inch in diameter. As they spread, alternaria leaf spots may change in color from black to tan or gray, with a yellow halo around the outside. Because spot development is heavily influenced by the environment, there are frequently noticeable concentric rings that spread from the initial point of infection. The fungal pathogens in the genus Alternaria can be devastating to plants year after year. The spores overwinter on old plant debris and attach themselves to seeds, making alternaria leaf spot especially tricky to completely eliminate if you save your own seeds."}, {"url": "http://extension.unh.edu/resources/representation/Resource000572_Rep594.pdf", "passage_text": "Early blight, caused by the fungus Alternaria, and Septoria leaf spot, caused by the fungus Septoria, aretwo destructive tomato diseases which occur each year in the northeastern United States. "}, {"url": "https://en.wikipedia.org/wiki/Alternaria_solani", "passage_text": "From Wikipedia, the free encyclopedia. Alternaria solani is a fungal pathogen, that produces a disease in tomato and potato plants called early blight. The pathogen produces distinctive bullseye patterned leaf spots and can also cause stem lesions and fruit rot on tomato and tuber blight on potato. Early blight caused by A. solani is the most destructive disease of tomatoes in the tropical and subtropical regions. Each 1% increase in intensity can reduce yield by 1.36%, and complete crop failure can occur when the disease is most severe."}, {"url": "http://www.gardeningknowhow.com/plant-problems/disease/alternaria-leaf-spot.htm", "passage_text": "Alternaria leaf spot in the garden is a real problem for growers of brassicas, but it also makes life miserable for tomato and potato growers, causing plaque-like spots on leaves and fruits. The fungal pathogens in the genus Alternaria can be devastating to plants year after year. The spores overwinter on old plant debris and attach themselves to seeds, making alternaria leaf spot especially tricky to completely eliminate if you save your own seeds."}, {"url": "http://hort.uwex.edu/articles/alternaria-leaf-and-stem-blight/", "passage_text": "Alternaria leaf and stem blight is the most serious foliar disease of American ginseng (Panax quinquefolium) in Wisconsin. Left untreated, this disease can totally defoliate a ginseng garden in a few weeks. If available and legal to use, Dithane DF is the preferred fungicide for Alternaria leaf and stem blight control. Other, less effective fungicides such as a combination of Rovral and copper hydroxide, or Aliette may also be used."}, {"url": "http://www.gardeningknowhow.com/edible/vegetables/tomato/early-blight-alternaria-tomato-leaf-spots-yellow-leaves.htm", "passage_text": "Alternaria alternate, or tomato early blight alternaria, is a fungus that can cause cankers and plant leaf spots on tomato plants. It normally occurs during hot weather when there has been a significant amount of rain and humidity. Once a plant is infected tomato early blight alternaria, a fungicide can be sprayed on the plant. This can help reduce the damage from the plant, but frequently this will only lessen, not eliminate the problem. The best way how to treat leaf spot on tomatoes is to make sure it does not occur in the first place."}, {"url": "http://hort.uwex.edu/articles/alternaria-leaf-and-stem-blight/", "passage_text": "Alternaria leaf and stem blight is caused by the fungus Alternaria panax. This fungus first enters ginseng gardens as wind-borne spores. Once in a garden, the fungus can survive in diseased ginseng debris, and there produce spores that cause new infections. If available and legal to use, Dithane DF is the preferred fungicide for Alternaria leaf and stem blight control. Other, less effective fungicides such as a combination of Rovral and copper hydroxide, or Aliette may also be used."}, {"url": "http://www.extension.umn.edu/garden/yard-garden/vegetables/diseases-of-cucurbits/alternaria-leaf-blight/", "passage_text": "Alternaria leaf blight. Michelle Grabowski, University of Minnesota, Extension Educator. Alternaria leaf blight is caused by the fungus Alternaria cucumerina. This disease is most problematic on melon but can also occur on cucumber, pumpkin and squash. Alternaria leaf blight does not commonly infect fruit but can reduce yield and quality through reduced plant vigor and sunscald of exposed fruit."}, {"url": "http://www.gardeningknowhow.com/edible/vegetables/tomato/early-blight-alternaria-tomato-leaf-spots-yellow-leaves.htm", "passage_text": "If you have noticed tomato leaf spots and the lower leaves turning yellow, you may have tomato early blight alternaria. This tomato disease causes damage to the leaves, stems and even the fruit of the plant. Keep reading to learn more about what causes tomato early blight alternaria and how to treat leaf spot. Once a plant is infected tomato early blight alternaria, a fungicide can be sprayed on the plant. This can help reduce the damage from the plant, but frequently this will only lessen, not eliminate the problem. The best way how to treat leaf spot on tomatoes is to make sure it does not occur in the first place."}]