[{"url": "http://www.answers.com/Q/What_did_Penicillin_do_to_the_world", "passage_text": "Penicillin is not used to prevent infections. It is used to treat bacterial infections and cause the infection to be cured. I … t is derived from a common mold.       Penicillin treats bacterial infections, such as gonorrhea, which is a male oriented malady."}, {"url": "http://www.answers.com/Q/What_did_Penicillin_do_to_the_world", "passage_text": "Penicillin is an antibiotic (a drug used to treat bacterial infections) made from a type of mold, Penicillium, that is commonly found on bread products. Its antibiotic qualiti … es were discovered in 1928 by Alexander Fleming. Penicillin was commonly prescribed to take care of bacterial infections in humans and animals."}, {"url": "http://www.medicalnewstoday.com/articles/216798.php", "passage_text": "Penicillins are all β-Lactam (Beta-Lactam) antibiotics, which are antibiotic molecules with a β-Lactam nucleus. There are a number of penicillin types, that react to bacteria in a variety of degrees, some of these are: 1  ampicillin. 2  amoxicillin. 3  flucloxacillin. 4  phenoxymethylpenicillin."}, {"url": "http://www.botany.hawaii.edu/faculty/wong/BOT135/Lect21b.htm", "passage_text": "Today, the use of penicillin and other antibiotics are common place. The various antibiotics are used to treat a number of what are now common diseases and to prevent the onset of infections when our skin, our first barrier to fight off disease, is somehow broken through a simple cut or a more serious wound."}, {"url": "http://www.medicalnewstoday.com/articles/216798.php", "passage_text": "Also known in short as pen or PCN, they originate from a type of fungi called Penicillium fungi. They are used in the treatment or prevention of many different bacterial infections, usually caused by Gram-positive organisms."}, {"url": "http://www.answers.com/Q/What_did_penicillin_do", "passage_text": "Penicillin is an antibiotic (a drug used to treat bacterial infections) made from a type of mold, Penicillium, that is commonly found on bread products. Its antibiotic qualiti … es were discovered in 1928 by Alexander Fleming. Penicillin was commonly prescribed to take care of bacterial infections in humans and animals."}, {"url": "http://learn.genetics.utah.edu/content/microbiome/antibiotics/", "passage_text": "Antibiotics kill bacteria, not archaea, fungi, or protists. The discovery of the antibiotic penicillin in the 1920s made a big impact on human history. Not only did it lead to a cure for bacterial infections that were once deadly, but it also led a big interest in finding new antibiotics."}, {"url": "http://herbarium.usu.edu/fungi/funfacts/penicillin.htm", "passage_text": "Many of you are here only because penicillin saved your life, or the life of one of your parents or grandparents. Penicillin's ability to cure people of many once-fatal bacterial infections has saved so many lives that it is easy to understand why it was once called a miracle drug."}]