[{"url": "http://www.thedailymeal.com/what-is-tilapia", "passage_text": "Tilapia is the new “chicken of the sea.” With the widespread worries about mercury contamination, tuna is out, and tilapia is in. It’s a versatile and budget-friendly alternative that is open to a variety of preparations, including sauteing, sautéing, grilling, baking, broiling, poaching, frying and. steaming "}, {"url": "http://healthyeating.sfgate.com/tilapia-fish-healthy-5827.html", "passage_text": "Tilapia can be grilled whole as a low-fat cooking method that adds extra flavor to the fish. Tilapia is a firm-fleshed white fish that is most frequently farm-raised. It can be purchased frozen or fresh, and can be cooked in a variety of methods. Tilapia is usually not too expensive, and it has a neutral taste, so it can be paired with a variety of sauces or marinades. "}, {"url": "http://www.berkeleywellness.com/healthy-eating/food/food-safety/article/truth-about-tilapia", "passage_text": "The term tilapia actually refers to several related fish species that originated in the Middle East and Africa but are now farmed all over the world. Though its production is growing in the U.S., most of the tilapia we eat here is imported from Asia and Latin America. If you eat fish, you have probably already had tilapia (sometimes called St. Peter’s fish) even if you didn’t know it. Tilapia may not be as heart-healthy as fatty fish like salmon because of its low omega-3 levels, but that hardly means it’s unhealthy—and the claim that it's worse for you than bacon is ludicrous."}, {"url": "http://www.eatthis.com/tilapia-is-worse-than-bacon", "passage_text": "Order now to get your FREE GIFT! The true chicken-of-the-sea, tilapia is a mild-tasting white fish that’s cheap to breed and easy to sell. In fact, for the first time in 2012, farmed fish production topped that of beef, reaching a record 66 million tons, compared with beef at 63 million. It's the Worst Kind of Fat. Compared with other fish, farmed tilapia contains relatively small amounts of beneficial omega-3 fatty acids –the heart-healthy and essential fish oils touted by health and nutrition experts as the main reason to eat fish frequently."}, {"url": "http://www.snopes.com/food/warnings/tilapia.asp", "passage_text": "Tilapia are typically farmed in the U.S. and Canada using tanks with closed recirculating systems, but much of the tilapia consumed by Americans is imported from Latin America and Asia (particularly Ecuador, China, and Taiwan), where the fish are usually raised in outdoor freshwater ponds. Claim: Eating farm-raised tilapia and other fish from China is dangerous."}, {"url": "http://www.inquisitr.com/1522997/is-tilapia-really-bad-for-you/", "passage_text": "The National Fisheries Institute, says tilapia has become the fourth most eaten seafood in the U.S., behind shrimp, salmon, and canned tuna, Fox reports. “This fish gives you a lot of leeway to farm. It’s a very hearty variety that is adaptable to different types of feed. "}, {"url": "http://www.foxnews.com/leisure/2014/04/09/truth-about-tilapia/", "passage_text": "Tilapia has risen to the top as a seafood staple on American dinner tables. According to the National Fisheries Institute, the mild fish has climbed to become the fourth most eaten seafood in the U.S., behind only shrimp, salmon and canned tuna. “If your doctor or cardiologist is telling you to eat more fish, then you should look for varieties that have higher levels of omega-3 and avoid those with high inflammatory potential.”. The truth is, tilapia has as much omega-3 as other popular seafood, including lobster, mahi-mahi and yellowfin tuna. Tilapia is also very low in fat. A 4-ounce serving of tilapia has about 1 gram of saturated fat, 29 grams of protein and around 200 mg of omega-3. By comparison, a 1-ounce serving of bacon (about 4 strips) contains 4 grams of saturated fat, 10 grams of protein and 52 mg of omega-3"}, {"url": "http://www.berkeleywellness.com/healthy-eating/food/food-safety/article/truth-about-tilapia", "passage_text": "Famed as the food of pharaohs in ancient times, tilapia is the world’s second most farmed fish (after carp)—and the fourth most consumed type of seafood in the U.S. (after shrimp, tuna, and salmon). Tilapia may not be as heart-healthy as fatty fish like salmon because of its low omega-3 levels, but that hardly means it’s unhealthy—and the claim that it's worse for you than bacon is ludicrous."}, {"url": "https://en.wikipedia.org/wiki/Tilapia", "passage_text": "Tilapia (/tɨˈlɑːpiə/ ti-LAH-pee-ə) is the common name for nearly a hundred species of cichlid fish from the tilapiine cichlid tribe. Tilapia are mainly freshwater fish inhabiting shallow streams, ponds, rivers and lakes and less commonly found living in brackish water. "}]