[{"url": "https://www.truthinaging.com/review/what-is-it-aluminum-in-deodorant-and-is-it-dangerous", "passage_text": "Aluminum chlorohydrate is a group of salts that is made by reacting aluminum with hydrochloric acid. Its most common use is in deodorants and antiperspirants because it alters the pH balance of the skin and the production of sweat. "}, {"url": "http://www.alcopstore.com/index/", "passage_text": "There are several additional risks in a home wired with aluminum versus a home wired with copper. For example, aluminum wire oxidizes at a greater rate than copper. When aluminum or copper wire is exposed to oxygen, they oxidize, creating a layer of oxidation on the wire. The oxidation layer on aluminum in particular adds significantly more resistance. More resistance results in splices heating up hotter and hotter. Another danger in aluminum-wired homes can be found where the existing aluminum wire comes into contact with copper wire in applications known as “pig tailing.”. When electricity passes through any wire, it heats up and expands. When the power is off, the wire cools down and contracts."}, {"url": "http://www.atsdr.cdc.gov/PHS/PHS.asp?id=1076&tid=34", "passage_text": "Aluminum is the most abundant metal in the earth's crust and it is widely distributed. Aluminum is a very reactive element and is never found as the free metal in nature. It is found combined with other elements, most commonly with oxygen, silicon, and fluorine. Food. You cannot avoid exposure to aluminum because it is so common and widespread in the environment. Exposure to the levels of aluminum that are naturally present in food and water and the forms of aluminum that are present in dirt and aluminum pots and pans are not considered to be harmful."}, {"url": "http://chemicaloftheday.squarespace.com/most-controversial/2012/9/11/dangers-of-aluminum.html", "passage_text": "Aluminum is the world's most abundant metal in the earth's crust. It is a versatile metal that is lightweight, relatively soft, and durable. It is a fairly reactive element that combines with negatively charged ions or elements to form compounds such as aluminum oxide or aluminum sulfate. "}, {"url": "http://www.globalhealingcenter.com/natural-health/concerned-about-aluminum-dangers/", "passage_text": "Aluminum is the most widely distributed metal on the planet and it’s used in the production of many every-day products. Cookware is made from aluminum, soda cans are aluminum, and aluminum foil is found in most kitchens. Aluminum is also in antacids, aspirin, vaccines, and even flour. This overwhelming infestation of aluminum means that your risk of exposure is through the roof, which is also made of aluminum. Unlike vitamins, minerals, and trace elements, the body does not need aluminum."}, {"url": "http://www.bellaonline.com/articles/art7739.asp", "passage_text": "Aluminum is excreted by the kidneys, therefore toxic amounts can impair kidney function. Aluminum can also accumulate in the brain causing seizures and reduced mental alertness. The brain is normally protected by a blood-brain barrier, which filters the blood before it reaches it. Excessive use of antacids is also a common cause of aluminum toxicity in this country, especially for those who have kidney problems. Many over the counter type antacids contain amounts of aluminum hydroxide that may be to much for the kidneys to handle properly."}, {"url": "http://www.bellaonline.com/articles/art7739.asp", "passage_text": "Even though aluminum is not considered to be a heavy metal like lead, it can be toxic in excessive amounts and even in small amounts if it is deposited in the brain. Many of the symptoms of aluminum toxicity mimic those of Alzheimer s disease and osteoporosis. Excessive use of antacids is also a common cause of aluminum toxicity in this country, especially for those who have kidney problems. Many over the counter type antacids contain amounts of aluminum hydroxide that may be to much for the kidneys to handle properly."}, {"url": "http://www.atsdr.cdc.gov/PHS/PHS.asp?id=1076&tid=34", "passage_text": "This Public Health Statement is the summary chapter from the Toxicological Profile for Aluminum. It is one in a series of Public Health Statements about hazardous substances and their health effects. A shorter version, the ToxFAQs™, is also available. This information is important because this substance may harm you. Food. You cannot avoid exposure to aluminum because it is so common and widespread in the environment. Exposure to the levels of aluminum that are naturally present in food and water and the forms of aluminum that are present in dirt and aluminum pots and pans are not considered to be harmful."}, {"url": "http://articles.mercola.com/sites/articles/archive/2011/09/21/could-this-be-the-most-dangerous-aspect-of-vaccines.aspx#!", "passage_text": "Aluminum is a Brain Toxin Aluminum is found in the earth's crust, and in air, soil and water. However, although aluminum is a common, natural substance, it's important to realize that it has absolutely no biological role inside your body and is, in fact, a demonstrated neurotoxin."}, {"url": "https://answers.yahoo.com/question/index?qid=20070322200101AAppIPw", "passage_text": "In other people, aluminium is not considered as toxic as heavy metals, but there is evidence of some toxicity if it is consumed in excessive amounts. The use of aluminium cookware, popular because of its corrosion resistance and good heat conduction, has not been shown to lead to aluminium toxicity in general. "}]