[{"url": "http://healthyeating.sfgate.com/safe-eat-coconut-oil-9685.html", "passage_text": "Also check if the coconut oil has been partially hydrogenated. Partial hydrogenation is a food processing technique used mainly to prolong the shelf life and stability of vegetable oils. However, the process destroys some of the good fats and antioxidants that would otherwise be present in coconut oil. Heating an oil above its smoke point can produce dangerous byproducts, such as toxic fumes, free radicals and trans fatty acids. Do not worry if your coconut oil started out liquid and turns solid or vice versa -- both are safe to use in cooking and to eat."}, {"url": "http://healthyeating.sfgate.com/health-benefits-pros-cons-cooking-coconut-oil-3530.html", "passage_text": "Coconut oil, being mainly a saturated fat, is able to withstand higher temperatures than other oils, making it one of the best oils for cooking. It also gives a delicious taste and superb texture to foods. Use organic extra-virgin coconut oil for the best quality. Include coconut in your diet for healthy fats. The purported health benefits of coconut oil have sparked debate in the medical community. Conventional dietary advice has been to limit coconut oil because it is rich in saturated fats, which have been associated with heart disease."}, {"url": "http://www.huffingtonpost.com/2014/04/22/coconut-oil-healthy_n_5167057.html", "passage_text": "We use coconut oil as one of our main cooking fats, along with local pastured butter and organic olive oil. Coconut oil has a higher smoking point than olive oil and butter, so it's very useful in high heat cooking. It makes the best popcorn when mixed with ghee and you can't beat potatoes fried in coconut oil. About half of virgin coconut oil's saturated fat is lauric acid, a medium-chain triglyceride that turns out to have a number of health-promoting properties, including the ability to improve levels of good HDL cholesterol."}, {"url": "http://www.shape.com/lifestyle/sex-and-love/coconut-oil-new-lube", "passage_text": "There haven’t been any studies looking at the safety of coconut oil as a lubricant, she explains. “So far it seems safe—I haven’t had any patients report any negative side effects.” Plus, it’s natural, preservative free, and affordable compared with traditional lubricants you find at the drugstore. "}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-1092-COCONUT%20OIL.aspx?activeIngredientId=1092&activeIngredientName=COCONUT%20OIL", "passage_text": "However, these concerns have not been proven in scientific research. The safety of coconut oil used in medicinal amounts is unknown. Pregnancy and breast-feeding: Coconut oil is safe for pregnant and breast-feeding women when used in the amounts normally found in the diet. But the safety of using coconut oil in larger amounts is not known. It’s best to stick to food amounts if you are pregnant or breast-feeding. "}, {"url": "http://www.huffingtonpost.com/dr-mercola/coconut-oil-benefits_b_821453.html", "passage_text": "Obviously, coconut oil was doing nothing to harm the health of these islanders. It may be surprising for you to learn that the naturally occurring saturated fat in coconut oil is actually good for you and provides a number of profound health benefits, such as: • Improving your heart health."}, {"url": "http://getfit.jillianmichaels.com/coconut-oil-safe-daily-2053.html", "passage_text": "Amount. Coconut oil is safe for your health and you can consume it every day without any problem. You can replace the fats and oils in your diet with the same amount of coconut oil. Coconut oil is a versatile, stable oil that can be kept for up to a year and heated at relatively high temperatures without altering its composition. You can use coconut oil for cooking and baking, and take it as supplement. Coconut oil falls into the category of tropical oils, the main vegetable source of saturated fats, similar to those found in butter, lard, dairy and fatty meats"}, {"url": "http://healthyeating.sfgate.com/safe-eat-coconut-oil-9685.html", "passage_text": "Because coconut oil is used in beauty treatments and personal care, you'll sometimes find it sold alongside lotions and shampoos. Some of the coconut oil sold in these sections is actually safe to eat, but some is not. It all depends on how it was processed and how pure it is. Beware coconut oil products advertised as a hair or skincare oil. Heating an oil above its smoke point can produce dangerous byproducts, such as toxic fumes, free radicals and trans fatty acids. Do not worry if your coconut oil started out liquid and turns solid or vice versa -- both are safe to use in cooking and to eat."}]