[{"url": "http://www.wisegeek.com/what-is-marine-collagen.htm", "passage_text": "Japanese women have used marine collagen as a natural supplement for many years. Marine collagen is made from fish scales. Fish collagen may be used to promote healthier looking skin. Fish collagen may be used to promote healthier looking hair. Fish collagen may be featured in bath soap. Fish collagen may be used to help reduce the appearance of wrinkle"}, {"url": "http://puranaturals.blogspot.com/2012/11/so-what-exactlyiis-marine-collagen.html", "passage_text": "Collagen protein is also present in various marine organisms and can be derived from a substance found on fish scales or seaweed. The collagen matters produced, and thus collected, from these marine organisms are known collectively as marine collagen protein. "}, {"url": "https://en.wikipedia.org/wiki/Hydrolyzed_collagen", "passage_text": "Production [edit]. Hydrolyzed collagen is produced from collagen found in the bones, skin, and connective tissue of animals such as cattle, fish, horses, pigs, and rabbits. "}, {"url": "http://www.ehow.com/how-does_4924727_does-collagen-come.html", "passage_text": "Collagen is a protein that is naturally produced in the bodies of animals (especially mammals) and is the main component of connective tissues like cartilage (found in humans in places like the ears, the tip of the nose and between bones). Extracting. In order to be collected for use, collagen is taken from other dead mammals (usually livestock for commercial use). The basic extraction is generally done using a process of cooking cartilaginous animal materials, such as bones, connective tissues and skin."}, {"url": "http://www.wisegeek.com/what-is-marine-collagen.htm", "passage_text": "The only sentence in this whole article that actually tried to define Marine Collagen is: Marine collagen is a material derived from the substance found on fish scales. The rest is about application, history, etc. I would really like to know what kind of material it is that is found on fish scales. Marine collagen is made from fish scales. Fish collagen may be used to promote healthier looking skin. Fish collagen may be used to promote healthier looking hair. Fish collagen may be featured in bath soap."}, {"url": "http://www.wisegeek.com/what-is-marine-collagen.htm", "passage_text": "Marine collagen is a material derived from the substance found on fish scales. It has been widely used in Japan for many years as a natural supplement. People who use this substance claim it has various benefits, which include healthier bones and skin. Marine collagen is made from fish scales. Fish collagen may be used to promote healthier looking skin. Fish collagen may be used to promote healthier looking hair. Fish collagen may be featured in bath soap."}, {"url": "http://biocellcollagen.com/faqs", "passage_text": "Answer: No, collagen does not naturally exist in plants. Collagen is a group of proteins found in animals only. It is the most abundant protein in mammals, making up about 25% to 35% of the whole-body protein content. Collagen is a predominant component of the connective tissues and exists usually in the form of fibrils. Answer: BioCell Collagen is made from hormone and antibiotic free chicken sternal cartilage because it is a rich source of collagen type II, hyaluronic acid, and chondroitin sulfate and closely mirrors the composition of human articular cartilage."}, {"url": "http://www.news-medical.net/health/What-is-Collagen.aspx", "passage_text": "Collagen is the main component of connective tissue, and is the most abundant protein in mammals, making up about 25% to 35% of the whole-body protein content. An atomic-force-microscopy image of collagen fibrils in a collagen fiber. Image Credit: UChicago Argonne LLC. "}, {"url": "http://www.cosmeticsmd.org/collagen/", "passage_text": "What is it? Collagen is a fibrous protein that plays a very important role in various structures of the human body. There are several types in the human body and more or less they provide integrity to structures such as the skin, bone, tendon, cartilage, hair, placenta, etc."}, {"url": "https://en.wikipedia.org/wiki/Collagen", "passage_text": "Collagen /ˈkɒlədʒɨn/ is the main structural protein in the extracellular space in the various connective tissues in animals. As the main component of connective tissue, it is the most abundant protein in mammals, making up from 25% to 35% of the whole-body protein content. Collagen, in the form of elongated fibrils, is mostly found in fibrous tissues such as tendons, ligaments and skin. It is also abundant in corneas, cartilage, bones, blood vessels, the gut, intervertebral discs and the dentin in teeth."}]