[{"url": "http://www.rspb.org.uk/makeahomeforwildlife/advice/expert/previous/incubation.aspx", "passage_text": "This is called a 'brood patch'. Different birds sit on their eggs for different lengths of time. Bigger birds lay bigger eggs which take longer to hatch. Blue tits incubate their eggs for two weeks but swans sit on theirs for nearly six weeks! Most birds lay one egg a day until the eggs are all laid. Some birds lay up to 15 eggs but others lay only one. "}, {"url": "http://www.localharvest.org/blog/26992/entry/how_long_does_it_take", "passage_text": "If for some reason the temperature has dropped below the correct temperature on a few occasions, you could find some of your eggs only hatching on day 22, 23, or even on day 24 or 25. Whereas fertilized chicken eggs usually take exactly 21 days to hatch, most duck eggs take 28 days, apart from Muscovy ducks. As a general rule of thumb, the eggs of Muscovy ducks take 35 days, but once again, it can vary slightly depending on conditions. If on the other hand you use an incubator in order to hatch fertilized chicken eggs, they can sometimes hatch a day or two early, or they can also hatch out a few days late. Things like humidity and temperature play a significant role."}, {"url": "http://www.biokids.umich.edu/critters/Accipiter_gentilis/", "passage_text": "The female goshawk lays two to four eggs, two to three days apart. The eggs are rough textured, bluish-white, 59 milimeters long and 45 milimeters wide. The eggs begin to hatch within 28 to 38 days of laying. Incubation of the eggs is mostly done by the female, but the male will sometimes take her place to allow the her to hunt and eat. Nestlings stay at the nest until they are 34 to 35 days old, when they begin to move to nearby branches in the same tree. Female goshawks do the majority of egg incubation, but occasionally males will incubate the eggs to allow the female to hunt and eat. After the clutch has hatched, the female will not leave the nesting area until the nestlings are 25 days old."}, {"url": "https://answers.yahoo.com/question/index?qid=20061008190539AAujWrD", "passage_text": "Rating Newest Oldest. Best Answer: Duck eggs need to be incubated for 28 days. That is 28 days from the time she starts sitting on them. It may take her a couple of weeks to lay enough eggs for her to start sitting. When she feels that her clutch (group of eggs) is the right size, she will start sitting. Wait for 28 days. Duck eggs hatch in a period of 28-33 days after they are laid, if they are fertile. The ducklings will hatch over a period of several hours, maybe even over a day or so."}, {"url": "http://www.localharvest.org/blog/26992/entry/how_long_does_it_take", "passage_text": "So, how long does it take for fertilized chicken eggs to hatch? The answer to that is 21 days exactly, although you need to bear in mind that this can vary, depending on a number of circumstances. If on the other hand you use an incubator in order to hatch fertilized chicken eggs, they can sometimes hatch a day or two early, or they can also hatch out a few days late. Things like humidity and temperature play a significant role."}, {"url": "http://pet-doves.com/petdoves/dove_eggs.htm", "passage_text": "Don't get excited if the dove is not sitting on the egg or is standing over the egg not getting it warm. They will sit on it when they are ready. The incubation will take about 15 days for the eggs to fully hatch. Dove eggs do not have a waterproof membrane like chicken eggs so it is important not to get a dove egg wet. Anything you put on the egg will penetrate the shell and affect the baby inside. As long as an egg is not allowed to freeze or become too warm 72+, the eggs can be kept for days and weeks before starting incubation. Although some doves will start sitting after the first egg is laid, older doves wait until the second egg is laid to start sitting so they will hatch at the same time."}, {"url": "http://www.answers.com/Q/How_long_do_hens_set_on_their_eggs_before_hatching", "passage_text": "After she gets her clutch made, the eggs will hatch in approx. 21 days. She makes a clutch because if she just kept laying eggs and sitting on them, the chicks would all hatch … on different days. Eggs can keep for quite a while, while the hen is making a clutch. When incubating a clutch of fertilized eggs artificially, breeders collect eggs for … up to seven days and start them all at the same time. 21 days from the date they are first set into the incubator at 100.5 degrees F with a relative humidity of +50% will produce a hatch."}, {"url": "http://www.answers.com/Q/How_long_do_hens_set_on_their_eggs_before_hatching", "passage_text": "Time the Hens Set It only takes 21 days for fertile eggs, properly incubated by a hen or in an incubator, to hatch. Note that this number begins not when the first egg in the clutch is laid, but when the hen stops laying and begins the setting process. When incubating a clutch of fertilized eggs artificially, breeders collect eggs for … up to seven days and start them all at the same time. 21 days from the date they are first set into the incubator at 100.5 degrees F with a relative humidity of +50% will produce a hatch."}]