[{"url": "https://en.wikipedia.org/wiki/Bismuth", "passage_text": "Bismuth has long been considered as the element with the highest atomic mass that is stable. However, in 2003 it was discovered to be weakly radioactive: its only primordial isotope, bismuth-209, decays via alpha decay with a half life more than a billion times the estimated age of the universe. Elemental bismuth may occur naturally, although its sulfide and oxide form important commercial ores. The free element is 86% as dense as lead. It is a brittle metal with a silvery white color when freshly produced, but is often seen in air with a pink tinge owing to surface oxidation."}, {"url": "http://www.answers.com/Q/Is_bismuth_radioactive", "passage_text": "For nearly all practical purpose, bismuth can be regarded as not radioactive. There is only one isotope of bismuth ordinarily found in nature, 209Bi, and though it is radioactive, it is only barely so, having a half life of 19,000,000,000,000,000,000 years, a fact only recently discovered. Like all elements, there are synthetic radioactive isotopes of bismuth. Bismuth is a chemical element that has the symbol Bi and atomic number 83. This heavy, brittle, white crystalline trivalent poor metal has a pink tinge and chemically re … sembles arsenic and antimony."}, {"url": "https://en.wikipedia.org/wiki/Isotopes_of_bismuth", "passage_text": "Although bismuth-209 is now known to be unstable, it has classically been considered to be a stable isotope because it has a half-life of over 1.9×10 19 years, which is more than a billion (1000 million) times the age of the universe. Bismuth (Bi) has no stable isotopes, but does have one very long-lived isotope; thus, the standard atomic mass can be given as 208.9803987(16) u."}, {"url": "https://en.wikipedia.org/wiki/Radioactive_decay", "passage_text": "Radioactive decay, also known as nuclear decay or radioactivity, is the process by which a nucleus of an unstable atom loses energy by emitting radiation. A material that spontaneously emits such radiation — which includes alpha particles, beta particles, gamma rays and conversion electrons — is considered radioactive. Alpha decay is one type of radioactive decay, in which an atomic nucleus emits an alpha particle, and thereby transforms (or decays) into an atom with a mass number decreased by 4 and atomic number decreased by 2."}, {"url": "http://www.answers.com/Q/Is_bismuth_radioactive", "passage_text": "It is generally considered to be the last naturally occurring stable, non-radioactive element on the periodic table, although it is actually slightly radioactive, with an extremely long half-life.   Bismuth compounds are used in cosmetics, medicines, and in medical procedures. Bismuth is a chemical element that has the symbol Bi and atomic number 83. This heavy, brittle, white crystalline trivalent poor metal has a pink tinge and chemically re … sembles arsenic and antimony."}, {"url": "https://en.wikipedia.org/wiki/Bismuth", "passage_text": "Bismuth compounds account for about half the production of bismuth. They are used in cosmetics, pigments, and a few pharmaceuticals, notably Pepto-Bismol, used to treat diarrhea. Bismuth's unusual propensity to expand upon freezing is responsible for some of its uses, such as in casting of printing type. Elemental bismuth may occur naturally, although its sulfide and oxide form important commercial ores. The free element is 86% as dense as lead. It is a brittle metal with a silvery white color when freshly produced, but is often seen in air with a pink tinge owing to surface oxidation."}, {"url": "http://www.carondelet.pvt.k12.ca.us/Family/Science/Nitrogen/bismuth.html", "passage_text": "Bismuth is the heaviest non-radioactive naturally occurring element. It is a hard, brittle metal with an unusually low melting point (271 o C). Bismuth is a silver-white crystalline, brittle metal with a pinkish tinge. "}, {"url": "https://en.wikipedia.org/wiki/Bismuth", "passage_text": "Bismuth is a chemical element with symbol Bi and atomic number 83. Bismuth, a pentavalent post-transition metal, chemically resembles arsenic and antimony. Elemental bismuth may occur naturally, although its sulfide and oxide form important commercial ores. The free element is 86% as dense as lead. It is a brittle metal with a silvery white color when freshly produced, but is often seen in air with a pink tinge owing to surface oxidation."}, {"url": "https://en.wikipedia.org/wiki/Isotopes_of_bismuth", "passage_text": "Commercially the radioactive isotope bismuth-213 can be produced by bombarding radium with bremsstrahlung photons from a linear particle accelerator. In 1997 an antibody conjugate with Bi-213, which has a 45-minute half-life, and decays with the emission of an alpha-particle, was used to treat patients with leukemia. Bismuth (Bi) has no stable isotopes, but does have one very long-lived isotope; thus, the standard atomic mass can be given as 208.9803987(16) u."}, {"url": "https://en.wikipedia.org/wiki/Isotopes_of_bismuth", "passage_text": "Besides 209 Bi, the most stable bismuth radioisotopes are 210m Bi with a half-life of 3.04 million years, 208 Bi with a half-life of 368,000 years and 207 Bi, with a half-life of 32.9 years, none of which occur in nature. All other isotopes have half-lives under 1 year, most under a day. Bismuth (Bi) has no stable isotopes, but does have one very long-lived isotope; thus, the standard atomic mass can be given as 208.9803987(16) u."}]