[{"url": "http://www.who.int/water_sanitation_health/resources/vector288to301.pdf", "passage_text": "288 CHAPTER 5 • COCKROACHES CHAPTER 5 Cockroaches Unhygienic scavengers in human settlementsCockroaches are among the most common pests in many homes and otherbuildings. At night they search for food in kitchens, food storage places, rubbishbins, drains and sewers."}, {"url": "http://www.epestsupply.com/cockroaches.php", "passage_text": "Basically, there are 5 species of roaches that are common in the Western Hemisphere. It is interesting to note that each of these cockroaches has it's own distinct habits and traits, each cockroach behaves differently. Therefore each must be treated"}, {"url": "http://ento.psu.edu/extension/factsheets/american-cockroaches", "passage_text": "Cockroaches are among the most common of insects. Fossil evidence indicates that cockroaches have been on earth for over 300 million years. They are considered one of the most successful groups of animals. Because cockroaches are so adaptable, they have successfully adjusted to living with humans."}, {"url": "http://www.extension.umn.edu/garden/insects/find/cockroaches/", "passage_text": "There are four kinds of cockroaches that can infest homes in Minnesota, including German cockroach, brownbanded cockroach, American cockroach, and Oriental cockroach. These four species can be major pests in restaurants, hospitals, warehouses, offices and buildings with food-handling areas."}, {"url": "https://en.wikipedia.org/wiki/Cockroach", "passage_text": "Most species of cockroach are about the size of a thumbnail, but several species are bigger. The world's heaviest cockroach is the Australian giant burrowing cockroach Macropanesthia rhinoceros, which can reach 9 cm (3.5 in) in length and weigh more than 30 g (1.1 oz)."}, {"url": "http://insects.about.com/od/roachesandmantids/a/10-Facts-About-Cockroaches.htm", "passage_text": "I asked some friends what words come to mind when I say cockroach.. Their answers typified how most people feel about roaches: stomp, ewww, and  Joe's Apartment!  I'm here to tell you that cockroaches are not all that bad. In fact, they're rather cool."}, {"url": "http://insects.about.com/od/roachesandmantids/a/10-Facts-About-Cockroaches.htm", "passage_text": "2. Cockroaches can eat just about anything, and can survive without food for long periods of time. Cockroaches are scavengers. While most roaches prefer sweets given a choice, in a pinch, they will eat just about anything: glue, grease, soap, wallpaper paste, leather, bookbindings, or even hair."}, {"url": "http://www.epestsupply.com/cockroaches.php", "passage_text": "Cockroaches are among the most common insects. Based on fossil evidence, roaches are known to have been present on Earth for over 300 million years. Their sizes vary considerably; some species are up to several inches long."}]