[{"url": "https://microbewiki.kenyon.edu/index.php/Citrobacter_freundii", "passage_text": "The Citrobacter species, including Citrobacter freundii, are aerobic gram-negative bacilli. Citrobacter freundii are long rod-shaped bacteria typically 1-5 μm in length [1]. Most C. freundii cells are surrounded by many flagella used to move about, but a few are non-motile. Ecology. Citrobacter freundii are commonly found in the environment, mainly in soil, water, and sewages. They are an indicator of potential contamination of water. They are also found on different organs of diseased animals, including mammals, birds, reptiles, and amphibians [1]."}, {"url": "http://medical-dictionary.thefreedictionary.com/Citrobacter", "passage_text": "Citrobacter. A genus of motile bacteria (family Enterobacteriaceae) containing gram-negative rods that use citrate as a source of carbon; the motile cells are peritrichous. Fermentation of lactose by these organisms is delayed or absent; they produce trimethylene glycol from glycerol. Found in water, feces and urine, and not considered to be animal pathogens. Citrobacter freundii. have been identified as the cause of septicemic cutaneous ulcerative disease of turtles. The disease is characterized by cutaneous hemorrhage and ulceration, loss of claws and digits, flaccidity and paralysis. 1  Facebook."}, {"url": "https://microbewiki.kenyon.edu/index.php/Citrobacter_freundii", "passage_text": "Application to Biotechnology. In the Biotech industry, Citrobacter freundii produces many important enzymes. The first enzymes it produces is phosphatase. Phosphatase activity of C. freundii has been postulated to be involved in lead accumulation, which can have play an important role in the Biotech industry. Ecology. Citrobacter freundii are commonly found in the environment, mainly in soil, water, and sewages. They are an indicator of potential contamination of water. They are also found on different organs of diseased animals, including mammals, birds, reptiles, and amphibians [1]."}, {"url": "https://en.wikipedia.org/wiki/Citrobacter_freundii", "passage_text": "As an opportunistic pathogen, C. freundii is responsible for a number of significant infections. It is known to be the cause of a number of nosocomial infections of the respiratory tract, urinary tract, blood, and many other normally sterile sites in patients. C. freundii is responsible for reducing nitrate to nitrite in the environment. This conversion is an important and crucial stage in the nitrogen cycle. These bacteria also help in recycling nitrogen. C. freundii has also been investigated for biodegradation of tannic acid used in tanneries."}, {"url": "https://en.wikipedia.org/wiki/Citrobacter", "passage_text": "Citrobacter is a genus of Gram-negative coliform bacteria in the Enterobacteriaceae family. The species C. amalonaticus, C. koseri, and C. freundii can use citrate as a sole carbon source. Citrobacter species are differentiated by their ability to convert tryptophan to indole, ferment lactose, and use malonate. Citrobacter shows the ability to accumulate uranium by building phosphate complexes."}, {"url": "https://en.wikipedia.org/wiki/Citrobacter_freundii", "passage_text": "Citrobacter freundii is a species of facultative anaerobic. Gram-negative bacilli of the Enterobacteriaceae family. The bacteria are long rod-shaped with a typical length of 1–5 μm. Most C. freundii cells are surrounded by several flagella used for locomotion, but a few are not mobile. It can be found in soil, water, sewage, food, and the intestinal tracts of animals and humans. C. freundii is responsible for reducing nitrate to nitrite in the environment. This conversion is an important and crucial stage in the nitrogen cycle. These bacteria also help in recycling nitrogen. C. freundii has also been investigated for biodegradation of tannic acid used in tanneries."}, {"url": "http://www.denniskunkel.com/DK/Bacteria/261268A.html", "passage_text": "Caption: Citrobacter freundii-Gram-negative, anaerobic prokaryote (bacterium). It is a Proteobacteria in the Enterobacteriaceae family. It can be found in soil, water, sewage, and food. Citrobacter species use citrate as a carbon source. Citrobacter freundii and Citrobacter diversus are often the cause of opportunistic infections. Citrobacter spp. cause neonatal meningitis but are unique in their frequent association with brain abscess formation"}, {"url": "http://medical-dictionary.thefreedictionary.com/Citrobacter+freundii", "passage_text": "Citrobacter. a genus of gram-negative, lactose fermenting rods, members of the Enterobacteriaceae. Found in water, feces and urine, and not considered to be animal pathogens. Citrobacter freundii. have been identified as the cause of septicemic cutaneous ulcerative disease of turtles. The disease is characterized by cutaneous hemorrhage and ulceration, loss of claws and digits, flaccidity and paralysis. 1  Facebook."}, {"url": "http://www.rightdiagnosis.com/medical/citrobacter_freundii.htm", "passage_text": "Source: Diseases Database. Citrobacter freundii: A species of gram-negative, facultatively anaerobic, rod-shaped bacteria found in humans and other animals including MAMMALS; BIRDS; REPTILES; and AMPHIBIANS. Description of Citrobacter freundii. Citrobacter freundii: A species of gram-negative, facultatively anaerobic, rod-shaped bacteria found in humans and other animals including MAMMALS; BIRDS; REPTILES; and AMPHIBIANS."}]