[{"url": "http://www.nwkidney.org/living-with-kidney-disease/get-started/dialysis/", "passage_text": "Dialysis is a way to remove waste from your blood when your kidneys are unable to do so. If your chronic kidney disease progresses to Stage 5, kidney failure, only dialysis or a kidney transplant will keep you alive. People who do hemodialysis at home usually dialyze five or six times a week, for three and a half hours each treatment if they dialyze during the day or six to eight hours each treatment if they dialyze at night while they sleep. Peritoneal dialysis (PD)."}, {"url": "https://www.sharecare.com/health/dialysis/how-often-i-need-dialysis", "passage_text": "You will need dialysis treatment anywhere from a few times a week to several times daily, depending on the method prescribed. Conventional hemodialysis requires visits to a clinic three times a week. Daily hemodialysis means more frequent treatment sessions, about six a week, for shorter periods of time. If you opt for peritoneal dialysis, which is done at home, you will need to infuse and drain fluids anywhere from twice a day to several times a day, depending on the technique"}, {"url": "https://www.kidney.org/atoz/content/hemodialysis", "passage_text": "In a dialysis center, hemodialysis is usually done 3 times per week for about 4 hours at a time. People who choose to do hemodialysis at home may do dialysis treatment more frequently, 4-7 times per week for shorter hours each time. Your doctor will give you a prescription that tells you how much treatment you need. You need dialysis if your kidneys no longer remove enough wastes and fluid from your blood to keep you healthy. This usually happens when you have only 10 to 15 percent of your kidney function left."}, {"url": "http://www.davita.com/treatment-options/hemodialysis/in-center-hemodialysis/what-is-hemodialysis?/t/5594", "passage_text": "Talk to your doctor about how long you should be on hemodialysis. Some people feel that dialysis lasts a long time; however, healthy kidneys work 24 hours a day, 7 days a week and dialysis must do the job in only 12 or so hours a week. Alternative hemodialysis schedules include nocturnal and short daily. The dialyzer is the key to hemodialysis. The dialyzer is called the artificial kidney because it filters the blood — a job the kidneys used to do. The dialyzer is a hollow plastic tube about a foot long and three inches in diameter that contains many tiny filters."}, {"url": "http://www.webmd.com/a-to-z-guides/hemodialysis-compared-to-peritoneal-dialysis-topic-overview", "passage_text": "1 Hemodialysis usually is done 3 days a week and takes 3 to 5 hours a day. 2  You may be able to do dialysis at home. 3  Home hemodialysis requires training for you and at least one other person. 4  Your home may need some changes so that the equipment will work. 1 You will probably go to a hospital or dialysis center on a fairly set schedule. 2  Hemodialysis usually is done 3 days a week and takes 3 to 5 hours a day. 3  You may be able to do dialysis at home. 4  Home hemodialysis requires training for you and at least one other person"}, {"url": "https://www.kidney.org/atoz/content/dialysisinfo", "passage_text": "No. Dialysis does some of the work of healthy kidneys, but it does not cure your kidney disease. You will need to have dialysis treatments for your whole life unless you are able to get a kidney transplant. Many dialysis patients can go back to work after they have gotten used to dialysis. If your job has a lot of physical labor (heavy lifting, digging, etc.), you may need to get a different job."}, {"url": "http://www.davita.com/kidney-disease/dialysis/the-basics", "passage_text": "In the early stages of chronic kidney disease (CKD) , you do not need dialysis. The stages of chronic kidney disease can last for many years. But if your kidneys fail, you will need dialysis or a kidney transplant to keep you alive. In acute kidney failure, when kidneys stop functioning due to a sudden stress, kidney function may recover. But when the damage to your kidneys has been continuous and progressive over a number of years, as it is in chronic kidney disease (CKD), then the kidneys usually do not get better."}, {"url": "https://www.kidney.org/atoz/content/hemodialysis", "passage_text": "In hemodialysis, a dialysis machine and a special filter called an artificial kidney, or a dialyzer, are used to clean your blood. To get your blood into the dialyzer, the doctor needs to make an access, or entrance, into your blood vessels. This is done with minor surgery, usually to your arm. You need dialysis if your kidneys no longer remove enough wastes and fluid from your blood to keep you healthy. This usually happens when you have only 10 to 15 percent of your kidney function left."}, {"url": "https://www.kidney.org/atoz/content/dialysisinfo", "passage_text": "Usually, each hemodialysis treatment lasts about four hours and is done three times per week. A type of hemodialysis called high-flux dialysis may take less time. You can speak to your doctor to see if this is an appropriate treatment for you. Many dialysis patients can go back to work after they have gotten used to dialysis. If your job has a lot of physical labor (heavy lifting, digging, etc.), you may need to get a different job."}]