[{"url": "http://www.greekisland.co.uk/halkidiki/halkidiki.htm", "passage_text": "Kassandra is the most popular 'leg' of the Halkidiki peninsula as it is closest to the ferry and airport services of Thessaloniki. Both the east and west coast are blessed with large beach resorts and long sands. The Halkidiki region is primarily served by the international air and ferry ports at Thessaloniki and its characteristic three pointed prongs are called Kassandra, Sithonia and Athos, separated by two large bays. Halkidiki is noted for its long, sandy beaches, deep coves and fast-developing tourist resorts."}, {"url": "http://www.greeka.com/macedonia/halkidiki/greece/halkidiki-airport.htm", "passage_text": "Travel information about Halkidiki Airport. There is no airport in Halkidiki Greece. The closest airport to Halkidiki is the International Airport of Thessaloniki. Located about 15 km from the centre of Thessaloniki, in the region of Thermi, this airport receives daily flights from Athens and also regular flights from various Greek islands and from abroad"}, {"url": "https://en.wikipedia.org/wiki/List_of_airports_in_Greece", "passage_text": "Map of Greek airports. This is a list of airports in Greece, grouped by type and sorted by location. Greece, officially the Hellenic Republic, is a country in southeastern Europe, situated on the southern end of the Balkan Peninsula."}, {"url": "http://www.greekisland.co.uk/halkidiki/halkidiki.htm", "passage_text": "Athos beaches. Athos is the least populated of the Halkidiki peninsulas with holiday resort hotels restricted to the northern region. Most of the Athos peninsula is a closed 'monastic state' with severe limitations on entry and tourist activity restricted to offshore boat trips. The Halkidiki region is primarily served by the international air and ferry ports at Thessaloniki and its characteristic three pointed prongs are called Kassandra, Sithonia and Athos, separated by two large bays. Halkidiki is noted for its long, sandy beaches, deep coves and fast-developing tourist resorts."}, {"url": "http://www.greekisland.co.uk/halkidiki/sithonia.htm", "passage_text": "Sithonia is the centre prong of the triple pronged peninsula of Halkidiki and far less developed than the more commercialised Kassandra to the west. The Sithonia coastline has more variety with a succession of fishing ports, secluded inlets and attractive coves. Halkidiki as a whole is a sloping geological table, rising from the west to the east. In Kassandra, to the west, are the low plains while Sithonia is more hilly. It has the Singitic Gulf to the west and the Toronean Gulf"}, {"url": "http://www.santoriniairport.com/santorini-airport-code/", "passage_text": "Athens International Airport – ATH. Also called Eleftherios Venizelos or Spata, Spada; Athens is also spelled Athina. Heraklion Airport, Crete – HER. Also called Nikos Kazantzakis Airport; Heraklion is also spelled Iraklion or Iraklio."}, {"url": "http://www.angelfire.com/super2/greece/sithoniauk.html", "passage_text": "Sithonia is situated west of Athos and is the middle one of the three fingers in the south of the Halkidiki peninsula. The landscape is very rugged and mountainous here with small fishing villages and many, sometimes deserted, sandy beaches. One of the most popular resorts is Vourvourou which is located in the northeast of the Sithonia peninsula at 120 kilometers distance of Thessaloniki en 10 kilometers south of the town of Agios Nikolaos. Here you will find a pretty nature, beautiful white sandy beaches and the most beautiful blue water."}, {"url": "http://wikitravel.org/en/Greece", "passage_text": "Greece (Greek: ελλάδα, Ellada) elláda is a country In Southern, europe on the southernmost tip of The balkan, peninsula with extensive coastlines and islands in The, Aegean, ionian And Mediterranean. Seas it shares borders in the north With, albania The Former Yugoslav republic Of (MACEDONIA), Fyrom, bulgaria And. turkey "}, {"url": "http://www.thomson.co.uk/destinations/europe/greece/halkidiki/holidays-halkidiki.html", "passage_text": "Sani is a vibrant seaside town on the Kassandra Peninsula, part of Halkidiki in northern Greece. Million-pound yachts fill the elegant marina, which is ringed with restaurants, bars and boutique shops. Nea Moudania is the second-biggest town in Halkidiki on mainland Greece, and one of the country’s biggest fishing ports. That’s good news for those after shops and amenities – there are plenty here."}, {"url": "http://www.greekisland.co.uk/halkidiki/halkidiki.htm", "passage_text": "Kassandra beaches. Kassandra is the most popular 'leg' of the Halkidiki peninsula as it is closest to the ferry and airport services of Thessaloniki. Both the east and west coast are blessed with large beach resorts and long sands. There is plenty of good holiday hotel accommodation linked by a good road. The Halkidiki region is primarily served by the international air and ferry ports at Thessaloniki and its characteristic three pointed prongs are called Kassandra, Sithonia and Athos, separated by two large bays. Halkidiki is noted for its long, sandy beaches, deep coves and fast-developing tourist resorts."}]