[{"url": "http://www.bbc.co.uk/history/worldwars/wwtwo/japan_no_surrender_01.shtml", "passage_text": "But John Dower, one of America's most highly respected historians of wartime and post-war Japan, believes a major factor, often overlooked in seeking to explain why Japanese soldiers did not surrender, is that countless thousands of Japanese perished because they saw no alternative. He never spoke explicitly about 'surrender' or 'defeat', but simply remarked that the war 'did not turn in Japan's favour'. It was a classic piece of understatement. Nearly three million Japanese were dead, many more wounded or seriously ill, and the country lay in ruins."}, {"url": "http://www.bbc.co.uk/news/world-asia-25772192", "passage_text": "I've never regretted anything. A Japanese soldier who refused to surrender after World War Two ended and spent 29 years in the jungle has died aged 91 in Tokyo. Hiroo Onoda remained in the jungle on Lubang Island near Luzon, in the Philippines, until 1974 because he did not believe that the war had ended"}, {"url": "http://www.bbc.com/news/world-asia-25772192", "passage_text": "Following his surrender, Mr Onoda ran a ranch in Brazil, and opened a series of survival training schools in Japan. Mr Onoda was one of the last Japanese soldiers to surrender at the end of World War II. Private Teruo Nakamura, a soldier from Taiwan who served in the Japanese army, was found growing crops alone on the Indonesian island of Morotai in December 1974. Mr Nakamura was repatriated to Taiwan where he died in 1979. A Japanese soldier who refused to surrender after World War Two ended and spent 29 years in the jungle has died aged 91 in Tokyo."}, {"url": "http://www2.gvsu.edu/walll/Japan%20NO%20SURRENDER.htm", "passage_text": "But John Dower, one of America's most highly respected historians of wartime and post-war Japan, believes a major factor, often overlooked in seeking to explain why Japanese soldiers did not surrender, is that countless thousands of Japanese perished because they saw no alternative. He never spoke explicitly about 'surrender' or 'defeat', but simply remarked that the war 'did not turn in Japan's favour'. It was a classic piece of understatement. Nearly three million Japanese were dead, many more wounded or seriously ill, and the country lay in ruins"}, {"url": "http://www.answers.com/Q/Why_did_Japan_refuse_to_surrender_to_the_US", "passage_text": "No, Japan didn't immediately refuse after the bombing of Hiroshima. After the bombing, Emperor Hirohito (the Japanese leader during the Second World War) went into consultatio … n with the Imperial War Council (of Japan) where they were deciding whether or not to surrender. However, three days after the bombing of Hiroshima, America bombed Japan again, this time in Nagasaki"}, {"url": "http://www.answers.com/Q/Why_did_Japan_not_surrender_before_the_bombing", "passage_text": "No, Japan didn't immediately refuse after the bombing of Hiroshima. After the bombing, Emperor Hirohito (the Japanese leader during the Second World War) went into consultatio … n with the Imperial War Council (of Japan) where they were deciding whether or not to surrender. The Japanese did not surrender because they had too much honor. Their emperor would not accept defeat and their people would fight to the death. They were not afraid and even after the bombs were dropped they didn't"}, {"url": "https://sg.answers.yahoo.com/question/index?qid=20090806094009AAChbzk", "passage_text": "· just now. Report Abuse. The Japanese did not surrender because it was to do with Pride and Honour, they would rather die then surrender to anyone. They say that this is the reason they were so tough on prisoners of war, they surrendered and it went against all the Japanese believed in. "}, {"url": "https://en.wikipedia.org/wiki/Surrender_of_Japan", "passage_text": "The surrender of the Empire of Japan was announced by Imperial Japan on August 15 and formally signed on September 2, 1945, bringing the hostilities of World War II to a close. By the end of July 1945, the Imperial Japanese Navy was incapable of conducting major operations and an Allied invasion of Japan was imminent. If Japan does not surrender, bombs will have to be dropped on her war industries and, unfortunately, thousands of civilian lives will be lost. I urge Japanese civilians to leave industrial cities immediately, and save themselves from destruction. I realize the tragic significance of the atomic bomb."}]