[{"url": "http://www.sos.state.tx.us/corp/forms/503_boc.pdf", "passage_text": "The assumed name certificate must state the assumed name under which. the business or professional service is or is to be conducted. An entity may conduct business or. professional services under multiple assumed names, but a separate assumed name certificate must. be filed for each assumed name. The legal name of the entity filing the assumed name is: State the name of the entity as currently shown in the records of the secretary of state or on its organizational documents, if not filed with the secretary of state."}, {"url": "http://www.getincnow.com/What-is-an-Assumed-Name.php", "passage_text": "A business with an Assumed Name is not separate from its owners. An Assumed Name in itself does not include the liability protections of a registered Corporation. Corporations and LLCs often use an Assumed Name to market a separate product or service. Owners of a business with an Assumed Name are responsible for all business legal obligations and taxes. Some states refer to an Assumed Name as a Fictitious Name, Trade Name (not trademark) or DBA (Doing Business As). Using an Assumed Name allows you to present yourself to the public as a different business entitiy, while using only one Corporation or LLC and keeping only one set of books."}, {"url": "http://www.blnc.gov/Portals/15/Documents/Forms/Certificate_of_Assumed_Name_for_Corporation.pdf", "passage_text": "__________________________________________________________________________________________. CERTIFICATE OF ASSUMED NAME FOR CORPORATION. The undersigned corporation, proposing to engage in business in ___________________County, North Carolina, under an assumed name other than its corporate name, hereby certifies that: 1. The assumed name under which the business is to be conducted is: _________________________________________________________________________________________. 2. The names and address of the owner(s) of the business is (are): "}, {"url": "http://www.cyberdriveillinois.com/departments/business_services/assumed_name_adoptions/corpinstructions.html", "passage_text": "1 An expedited fee ($50 for business corporation and $25 for not-for-profit corporation) is in addition to the filing fee because the assumed name adoption is reviewed within 24 hours of receipt (excluding weekends and holidays). 1 A foreign or not-for-profit corporation may adopt an assumed name electronically if it is incorporated in one of the other 49 states or the District of Columbia. 2  The corporation must be on file and in good standing with the Secretary of State’s office at the time of adoption."}, {"url": "http://info.legalzoom.com/difference-between-assumed-name-legal-name-21169.html", "passage_text": "The Difference Between an Assumed Name and a Legal Name. Every person and business has a legal name. Some also have an assumed name by which they are known. A legal name is the official name by which the government knows the person or business. An assumed name is any other name used in business. "}, {"url": "http://www.michigan.gov/difs/0,5269,7-303-22535_23049-69104--,00.html", "passage_text": "Information is available regarding Choosing a Business Name and filing the Certificate of Assumed Name for use by corporations, limited partnerships and limited liability companies with the appropriate jurisdictional authorities (the county clerk or the State of Michigan). "}, {"url": "http://www.cyberdriveillinois.com/departments/business_services/assumed_name_adoptions/corpinstructions.html", "passage_text": "Fees. 1  An expedited fee ($50 for business corporation and $25 for not-for-profit corporation) is in addition to the filing fee because the assumed name adoption is reviewed within 24 hours of receipt (excluding weekends and holidays). 2  Each transaction also includes a $5 payment processor fee. 1 A foreign or not-for-profit corporation may adopt an assumed name electronically if it is incorporated in one of the other 49 states or the District of Columbia. 2  The corporation must be on file and in good standing with the Secretary of State’s office at the time of adoption."}, {"url": "https://en.wikipedia.org/wiki/Doing_business_as", "passage_text": "For trade names of other products and services, see brand name. A trade name, trading name, or business name is a pseudonym used by companies to perform their business under a name that differs from the registered, legal name of the business. "}, {"url": "http://www.dos.ny.gov/corps/assdnmins.html", "passage_text": "The total fee for a corporation to file a Certificate of Assumed Name in all counties in New York State, including the Department of State's fee, is $1,950. There is no county fee for limited liability companies or limited partnerships. "}, {"url": "http://www.getincnow.com/What-is-an-Assumed-Name.php", "passage_text": "Sometimes a business may want to transact business under a different name than its official Corporate name. This is referred to as using an Assumed Name, or Assumed Corporate Name. Some states refer to an Assumed Name as a Fictitious Name, Trade Name (not trademark) or DBA (Doing Business As). Using an Assumed Name allows you to present yourself to the public as a different business entitiy, while using only one Corporation or LLC and keeping only one set of books."}]