[{"url": "http://www.clemson.edu/extension/horticulture/nursery/irrigation/why_plants_need_water.html", "passage_text": "Plants need large quantities of water for growth. The most important factor driving water movement in plants is a process known as transpiration. Transpiration is the loss of water from plants in the form of vapor (evaporation). Plants utilize most of the water absorbed from the soil for transpiration (95%), but a small portion of the water absorbed is used during photosynthesis for producing the carbohydrates necessary for plant growth (5%)."}, {"url": "http://www.letusfindout.com/why-do-plants-need-water/", "passage_text": "There are many reasons why water is needed by plants. Solvent. Water acts as the solvent for the minerals present in the soil and with the absorption of water from the soil minerals also enters the plant body. While these minerals could not be easily and naturally taken up by the plants if they were in solid state."}, {"url": "http://www.knowswhy.com/why-do-plants-need-water/", "passage_text": "Although plants don’t have mouth to drink, they still need water in order to survive. Plants need water for a lot of reasons. Plants need water in order to dissolve the nutrients that are carried by the roots from the soil. Just like humans, plant also eats but their process is different. They get nutrients from the soil surrounding the root system. This is the reason why we need to water the plants on the roots."}, {"url": "http://www.science-sparks.com/2014/03/25/why-do-plants-need-water/", "passage_text": "Nutrient transfer. Plants need water to absorb nutrients from the soil. Transpiration. Transpiration is the process by which water moves up the stem of a plant from root to leaf when water is lost from the plant due to evaporation occurring at the leaves."}, {"url": "http://www.education.com/science-fair/article/watering-plants/", "passage_text": "Plants need sunlight, nutrient rich soil and water to grow. Though the quality of the water has an effect on the plant’s health, there are many plants that are able to grow even when they are given water that is polluted or that has some salt content."}]