[{"url": "http://www.gamewardenedu.org/salaries/", "passage_text": "69570. Conservation officer salaries, as with most other peace officer personnel salaries, vary according to rank. For example, at the federal level, conservation officers within the U.S. Fish and Wildlife Service may be hired at a salary of between $34,319 and $44,615 at the minimum federal pay level of GS-7. According to the Bureau of Labor Statistics (BLS), fish and game wardens earned a mean, annual salary of $49,400, as of May 2012, with the top 10 percent earning more than $70,750 during the same period."}, {"url": "http://www.answers.com/Q/How_much_money_does_a_fish_and_wildlife_enforcement_officer_make", "passage_text": "Supervisors oversee the officers at the institution and generally make much more than officers. The median annual income for people working at this level is about $56,000, but those with many years of experience can earn as much as $85,000 a year. In the federal system and in some states, correctional officers are represented by labor unions."}, {"url": "http://www.answers.com/Q/How_much_money_does_a_fish_and_wildlife_enforcement_officer_make", "passage_text": "Some work for private correctional facilities. Earnings for correctional officers are affected b … y the type of employer an officer works for and by the officer's level of experience. Typically, incomes range from about $25,000 to $65,000 a year, with a national median of $37,000 a year. Some employers pay more than others. The median annual income for people working at this level is about $56,000, but those with many years of experience can earn as much as $85,000 a year. In the federal system and in some states, correctional officers are represented by labor unions."}, {"url": "http://www.gamewardenedu.org/salaries/", "passage_text": "California’s fish and game warden cadets, for example, earn a monthly salary of between $3,267 and $4,278, while individuals in Range A earn between $3,581 and $4,698 per month and individuals in the next salary level, Range B, earn between $4,271 and $5,642 per month. According to the Bureau of Labor Statistics (BLS), fish and game wardens earned a mean, annual salary of $49,400, as of May 2012, with the top 10 percent earning more than $70,750 during the same period."}, {"url": "http://www.gamewardenedu.org/arkansas/arkansas-salary/", "passage_text": "In Arkansas, wildlife officers are employed by the Arkansas Game & Fish Commission (AGFC). Their hourly wage can range anywhere between $16.28 and $27.65 per hour according to the Commission. Their annual salaries as reported by the AGFC in 2013 are shown here: AGFC Wildlife Officer. 1  Entry Level Salary: $33,861. "}, {"url": "http://careercentre.dtwd.wa.gov.au/occupations/Pages/fisheries-officer.aspx", "passage_text": "They usually wear a uniform. Back to top Salary details Salary details Fisheries officers can expect to earn from $1000 per week ($52,000 per annum) depending on experience and the type of organisation. Back to top Tools and technologies Tools and technologiesFisheries officers need to have a current C class driver’s licence."}, {"url": "http://work.chron.com/salary-wildlife-protection-officer-8445.html", "passage_text": "In 2011, the BLS showed only two types of employers for wildlife protection officers. The biggest was state government, which had 6,360 out of 7,180 positions and paid the higher averages of $56,210 per year, or $27.02 per hour. The second was local government, with 820 jobs at a mean $51,550 annually, or $24.78 hourly. Wildlife protection officers earned a mean $55,670 per year, or $26.77 per hour, as of May 2011, states the Bureau of Labor Statistics."}, {"url": "http://work.chron.com/salary-wildlife-protection-officer-8445.html", "passage_text": "Work. Wildlife protection officers earned a mean $55,670 per year, or $26.77 per hour, as of May 2011, states the Bureau of Labor Statistics. The lowest-paid 10 percent received $31,710 per year, or $15.24 per hour, while the highest paid 10 percent received $81,080 per year, or $38.98 per hour"}, {"url": "http://www.dfo-mpo.gc.ca/fm-gp/enf-loi/officer-agent-eng.htm", "passage_text": "Featured Video. Read the transcript. A career as a Fishery Officer can be challenging, adventurous and rewarding. Fishery Officers are trained to carry out a wide range of duties, on land and at sea, and are the federal government's first line of support in: 1  enforcing the Fisheries Act and other related acts and regulations;"}]