[{"url": "http://www.cdc.gov/bloodsafety/bbp/diseases_organisms.html", "passage_text": "HIV is the human immunodeficiency virus. It is the virus that can lead to acquired immune deficiency syndrome, or AIDS. CDC estimates that about 56,000 people in the United States contracted HIV in 2006. This risk of transfusion-transmitted HIV is extremely remote due to the rigorous testing of the U.S. blood supply. A wide variety of organisms, including bacteria, viruses, prions, and parasites can be transmitted through blood transfusions. The use of a standard donor screening questionnaire as well as laboratory tests help to reduce the risk of an infectious organism being transmitted by blood transfusion."}, {"url": "http://www.cdc.gov/bloodsafety/bbp/diseases_organisms.html", "passage_text": "Bacterial contamination of blood products, especially in platelets that are stored at room temperature, is the most common infectious risk of blood transfusion, occurring in approximately 1 of 2000-3000 platelet transfusions. Transfusion–transmitted sepsis, while less common, can cause severe illness and death. A wide variety of organisms, including bacteria, viruses, prions, and parasites can be transmitted through blood transfusions. The use of a standard donor screening questionnaire as well as laboratory tests help to reduce the risk of an infectious organism being transmitted by blood transfusion."}, {"url": "https://en.wikipedia.org/wiki/Origin_of_AIDS", "passage_text": "The pandemic strain of HIV-1 is closely related to a virus found in the chimpanzees of the subspecies Pan troglodytes troglodytes, which live in the forests of the Central African nations of Cameroon, Equatorial Guinea, Gabon, Republic of Congo (or Congo-Brazzaville), and Central African Republic. In January 1985, a number of more-detailed reports were published concerning LAV and HTLV-III, and by March it was clear that the viruses were the same, were from the same source, and were the etiological agent of AIDS."}, {"url": "http://www.webmd.com/hiv-aids/guide/human-immunodeficiency-virus-hiv-infection-cause", "passage_text": "Cause. The HIV infection is caused by the human immunodeficiency virus (HIV). After HIV is in the body, it starts to destroy CD4+ cells, which are white blood cells that help the body fight infection and disease."}, {"url": "http://www.humanillnesses.com/General-Information-and-Infectious-Diseases-A-Co/AIDS-and-HIV-Infection.html", "passage_text": "AIDS is the disease caused by human immunodeficiency virus type 1, or HIV-1 (usually referred to as HIV). HIV belongs to the retrovirus family, a group of viruses that have the ability to use cells' machinery to replicate (make more copies of the infecting virus). The HIV virus attacks T-helper cells, or CD4+ cells, by fitting itself into the cell like a key in a lock. Once it has invaded, it can use its own RNA as a template to make copies of itself, multiplying and traveling through the body."}, {"url": "https://en.wikipedia.org/wiki/HIV", "passage_text": "The human immunodeficiency virus (HIV) is a lentivirus (a subgroup of retrovirus) that causes HIV infection and acquired immunodeficiency syndrome (AIDS). AIDS is a condition in humans in which progressive failure of the immune system allows life-threatening opportunistic infections and cancers to thrive. Without treatment, average survival time after infection with HIV is estimated to be 9 to 11 years, depending on the HIV subtype. Infection with HIV occurs by the transfer of blood, semen, vaginal fluid, pre-ejaculate, or breast milk. Within these bodily fluids, HIV is present as both free virus particles and virus within infected immune cells. HIV infects vital cells in the human immune system such as helper T cells (specifically CD4 + T cells), macrophages, and dendritic cells"}, {"url": "http://www.thebody.com/h/what-pathogenic-organism-causes-hiv.html/", "passage_text": "...first recognized in 1981 and has since become a major worldwide pandemic. AIDS is caused by the human immunodeficiency virus (HIV). By leading to the destruction and/or functional impairment of cells of the immune system, notably CD4+ T cells,... Read more ». Opportunistic infections with HIV. No one knows for certain but it's probably due to inherent differences in the disease-causing ability (pathogenicity) of the organism. TB is virulent enough to cause disease in people with normal immune systems, but another mycobacterium, MAC,..."}, {"url": "http://www.skwirk.com/p-c_s-4_u-92_t-212_c-713/aids/nsw/aids/small-world-microbiology-/microorganisms-and-the-human-body", "passage_text": "It is hard to believe but HIV is actually a very fragile organism. If HIV is outside the body, its capsid disintegrates very quickly which instantly 'disarms' the virus. That is why infection is virtually impossible without direct blood-to-blood contact or through the mixing of body fluids containing the virus. This DNA then becomes part of the infected cell's genetic material. HIV is a 'slow' type of virus that falls into the category of lentiviruses. Lentiviruses are called slow viruses because they take a long time to cause damage to the body. See image 1."}]