[{"url": "http://www.webmd.com/balance/features/the-secret-and-surprising-power-of-naps", "passage_text": "Naps and Sleep Deprivation. Daytime naps can be one way to treat sleep deprivation, says Sara C. Mednick, PhD, sleep expert and author of Take a Nap! Change Your Life. You can get incredible benefits from 15 to 20 minutes of napping, she says. The length of your nap and the type of sleep you get help determine the brain-boosting benefits. The 20-minute power nap -- sometimes called the stage 2 nap -- is good for alertness and motor learning skills like typing and playing the piano."}, {"url": "https://www.psychologytoday.com/blog/the-land-nod/201402/the-power-the-nap", "passage_text": "Naps can be the best addition to the day or they can make you feel more tired than you started out. This is a helpful article giving tips on napping in a way that makes you feel better. As it states, a short power nap can be a great way to accumulate a boost of energy during midday. Naps can be extremely beneficial for workplace performance. Naps improve mood and stress management abilities. Short, 20-minute nap sessions have been routinely demonstrated to reduce accidents and mistakes while also improving attention, concentration, performance and alertness."}, {"url": "https://sleepfoundation.org/sleep-topics/napping", "passage_text": "1 If you try to take it too early in the day, your body may not be ready for more sleep. 2  Naps can restore alertness, enhance performance, and reduce mistakes and accidents. 3  A study at NASA on sleepy military pilots and astronauts found that a 40-minute nap improved performance by 34% and alertness 100%. Here are some other negative effects: 1  Naps can leave people with sleep inertia, especially when they last more than 10-20 minutes. 2  Napping can also have a negative effect on other sleeping periods. 3  One study has indicated that napping is associated with increased risk of heart failure in people already at risk."}, {"url": "https://sleepfoundation.org/sleep-topics/napping", "passage_text": "As a nation, the United States appears to be becoming more and more sleep deprived. And it may be our busy lifestyle that keeps us from napping. While naps do not necessarily make up for inadequate or poor quality nighttime sleep, a short nap of 20-30 minutes can help to improve mood, alertness and performance. Here are some other negative effects: 1  Naps can leave people with sleep inertia, especially when they last more than 10-20 minutes. 2  Napping can also have a negative effect on other sleeping periods. 3  One study has indicated that napping is associated with increased risk of heart failure in people already at risk."}, {"url": "http://nicholasferguson.org/3-benefits-of-taking-naps-and-how-they-improve-your-life/", "passage_text": "Taking naps improves your mood. Your body needs 7-8 hours of sleep for you to function at your best. Unsurprisingly, sleep deprivation impairs your motivation, tolerance and patience — having insufficient sleep can result in you not being the friendliest person to be around. These are some of the benefits of taking naps and why you should make them part of your daily routine. Contrary to popular perception, research shows that daytime naps aren’t reserved for the lazy or depressed."}, {"url": "http://nicholasferguson.org/3-benefits-of-taking-naps-and-how-they-improve-your-life/", "passage_text": "Planned naps at home or work will improve your mood, enhance your performance, and increase your sex drive. Contrary to popular perception, research shows that daytime naps aren’t reserved for the lazy or depressed. These are some of the benefits of taking naps and why you should make them part of your daily routin"}, {"url": "http://www.huffingtonpost.com/2013/03/11/nap-benefits-national-napping-day_n_2830952.html", "passage_text": "Napping Improves Learning And Memory. It's the deeper rapid eye movement (REM) sleep that's been linked with the cognitive process, so it's no surprise that it takes a longer nap to reap real brain benefits. But if you can squeeze in an hour, or even 90 minutes, you may find your mental fatigue has vanished upon waking. "}, {"url": "https://www.psychologytoday.com/blog/the-land-nod/201402/the-power-the-nap", "passage_text": "Longer naps (and naps later in the day) can also interfere with nighttime sleep. Shorter naps are typically refreshing and can help increase alertness for a few hours. Make sure that your sleep environment is comfortable, quiet, dark and cool. If you are at home, try to nap only in your bed. Naps can be extremely beneficial for workplace performance. Naps improve mood and stress management abilities. Short, 20-minute nap sessions have been routinely demonstrated to reduce accidents and mistakes while also improving attention, concentration, performance and alertness."}, {"url": "https://sleep.org/articles/napping-health-benefits/", "passage_text": "Set an alarm to make sure you get just the right amount of sleep. (Napping for a length of time between 20 and 90 minutes may also help, but you’re likely to feel groggy afterward.). Zap Stress. Regular, short naps can help lower tension, which decreases your risk of heart disease. Get the most health benefits out of your nap by doing it right. Stick to a regular napping schedule during optimal hours, which are between 1:00pm and 3:00pm."}]