[{"url": "https://en.wikipedia.org/wiki/Plantar_wart", "passage_text": "Plantar warts are benign epithelial tumors generally caused by infection by human papilloma virus types 1, 2, 4, 60, or 63, but have also been caused by types 57, 65, 66, and 156. These types are classified as clinical (visible symptoms). Plantar warts occur on the soles of feet and toes. They may be painful when standing or walking. Plantar warts are often similar to calluses or corns, but can be differentiated by close observation of skin striations. Feet are covered in skin striae, which are akin to fingerprints on the feet."}, {"url": "http://www.wart-s.com/dangerous-warts/", "passage_text": "Dangerous Warts. Warts are commonly found on people of all ages; there is no particular age group that can be said to be free from having the skin condition at one time or the other. can also come up on many parts of the body. The skin condition is caused by a virus called human papilloma virus. Many of the types of warts around are not dangerous. But there are some other ones that are considerably dangerous. It may be somewhat difficult to differentiate between eth harmful warts and the ones that are not harmful."}, {"url": "http://www.livestrong.com/article/206829-dangers-of-plantar-warts/", "passage_text": "Dangers of Plantar Warts. Plantar warts often develop on the bottom of the feet. Plantar warts are noncancerous growths occurring on the bottom of the foot, which is also called the the plantar surface of the foot. Plantar warts are caused the by human papillomavirus, abbreviated HPV, which infects people through cuts in the skin"}, {"url": "http://www.emedicinehealth.com/plantar_warts/article_em.htm", "passage_text": "Warts are produced by an infection of the skin by human papillomavirus (HPV), which is the most common viral infection of the skin. Plantar warts grow on the plantar surface or the sole of the foot. They can be found anywhere in this area but tend to produce symptoms in areas of pressure and friction. "}, {"url": "http://www.webmd.com/skin-problems-and-treatments/tc/warts-and-plantar-warts-topic-overview", "passage_text": "Warts and Plantar Warts-Topic Overview. This topic has information about warts on any part of the body except the genitals. For information about warts on the genitals, see the topic Genital Warts. A wart is a skin growth caused by some types of the virus called the human papillomavirus (HPV) . HPV infects the top layer of skin, usually entering the body in an area of broken skin. The virus causes the top layer of skin to grow rapidly, forming a wart. Most warts go away on their own within months or years."}, {"url": "http://www.wart-s.com/are-warts-dangerous-2/", "passage_text": "Plantar warts are particularly dangerous because they appear in the hard regions of the skin and they often become more difficult to be treated with conventional medicines, surgery is often used in treating such warts. Warts are also dangerous because an ineffective treatment may make them return in the near future. It is very important that you check your warts and get the best medical treatment."}, {"url": "http://www.wart-s.com/dangerous-warts/", "passage_text": "How dangerous is wart. Many of the types of warts around are not dangerous. But there are some other ones that are considerably dangerous. It may be somewhat difficult to differentiate between eth harmful warts and the ones that are not harmful. This is why every one having warts should treat the skin condition as dangerous"}, {"url": "https://en.wikipedia.org/wiki/Plantar_wart", "passage_text": "A plantar wart also known as veruca, myrmecia and veruca plantaris is a wart caused by the human papillomavirus (HPV) occurring on the sole (Latin planta) or toes of the foot. HPV infections in other locations are not plantar; see human papillomavirus. Plantar warts occur on the soles of feet and toes. They may be painful when standing or walking. Plantar warts are often similar to calluses or corns, but can be differentiated by close observation of skin striations. Feet are covered in skin striae, which are akin to fingerprints on the feet."}, {"url": "http://americanpregnancy.org/naturally/treat-plantar-warts-naturally-pregnancy/", "passage_text": "Plantar warts are benign growths that generally appear on the heels or balls of the feet. Caused by a few specific strains of the human papillomavirus (HPV) , plantar warts are transmitted through direct contact with scrapes, cuts, and cracks in dry skin. "}, {"url": "http://www.webmd.com/skin-problems-and-treatments/guide/plantar-warts-palmer-warts", "passage_text": "The culprit is a strain of virus called human papillomavirus or HPV. Many strains of the virus exist, and those that cause common warts on the hands and feet are not the same strains of HPV that cause genital warts. Some people mistakenly think plantar warts or palmer warts are malignant. In fact, they are not harmful. Eventually, in about two years, most warts go away without treatment. Font Size. A. A. A. Plantar warts and Palmer warts are common, especially in children. These warts are named for where they appear on the body. Palmer warts occur on the hands, and plantar warts on the bottom of the foot. Virtually everyone will have a wart (or several) someplace at some time in their lives."}]