[{"url": "http://www.answers.com/Q/What_continent_does_Hawaii_belong_to", "passage_text": "Hawaii isn't part of any continent although it is politically part of the United States. Hawaii is a chain of islands in the Pacific Ocean, so it is not considered to be par … t of any continent. Instead, it is part of Oceania, a region centered on the islands of the tropical Pacific Ocean."}, {"url": "http://www.answers.com/Q/Which_continent_and_country_belongs_with_Hawaii", "passage_text": "Answer     Hawaii isn't part of any continent although it is politically part of the United States. Hawaii is part of the Polynesia region of Oceania which is the na … me given to islands in the Pacific including the continent of Australia. Hawaii is one point of the so-called Polynesian triangle together with New Zealand and Easter Island (Rapa Nui)."}, {"url": "http://whatisxs.00family.com/wyz/what-continent-h7.html", "passage_text": "Australia is the name of the continent on which the. is a region. which includes Australia, Christmas Islands, Cocos Islands, New Guinea, New Zealand, Norfolk Island and is. 'Who does this number belong to-world."}, {"url": "http://www.answers.com/Q/What_continent_does_Hawaii_belong_to", "passage_text": "The Hawaii Islands are not located on any continent, even though they are a part of the United States, which exists in North America."}, {"url": "http://www.answers.com/Q/What_continent_does_Hawaii_belong_to", "passage_text": "Hawaii is in the Pacific Ocean and is not a part of any continent physically, but it is a part of Oceania & Australia and politically a part of North America; Hawaii is occupi … ed by the United States of America."}, {"url": "http://www.answers.com/Q/What_continent_does_Hawaii_belong_to", "passage_text": "Hawaii is part of the Polynesia region of Oceania which is the na … me given to islands in the Pacific including the continent of Australia."}, {"url": "https://au.answers.yahoo.com/question/index?qid=20080116165419AAKGcuW", "passage_text": "Technically, its not part of a continent as a continent is defined as a continuous mass of land. Since it is an island in the pacific, it doesn't belong to any continent. However, in the world map, it is part of Oceana (i.e. Australia, New Zealand). http://www.geocities.com/cq43ax101/Ocean..."}]