[{"url": "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC3572649/", "passage_text": "Abstract. Aneurysmal subarachnoid hemorrhage- (aSAH-) associated vasospasm constitutes a clinicopathological entity, in which reversible vasculopathy, impaired autoregulatory function, and hypovolemia take place, and lead to the reduction of cerebral perfusion and finally ischemia. "}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/11286896", "passage_text": "Other potential causes for vasospasm are hemorrhages, homocysteinemia, head injury, acute intermittent porphyria, sickle cell disease, anorexia nervosa, Susac syndrome, mitochondriopathies, tumors, colitis ulcerosa, Crohn's disease, arteriosclerosis and drugs. Vasospasm, its role in the pathogenesis of diseases with particular reference to the eye. Flammer J(1), Pache M, Resink T. Author information: (1)University Eye Clinic Basel, Mittlere Strasse 91, CH-4012, Basel, Switzerland."}, {"url": "http://emedicine.medscape.com/article/153943-overview", "passage_text": "Coronary artery vasospasm, or smooth muscle constriction of the coronary artery, is an important cause of chest pain syndromes that can lead to myocardial infarction (MI), ventricular arrhythmias, and sudden death. It also plays a key role in the development of atherosclerotic lesions. Alternative (or coexisting) mechanisms of coronary artery vasospasm include enhanced phospholipase C activity. In addition, coronary artery vasospasm is associated with increased markers of oxidative stress and inflammation, including thioredoxin, C-reactive protein (CRP), and monocyte levels."}, {"url": "http://emedicine.medscape.com/article/153943-clinical", "passage_text": "Patients with coronary artery vasospasm typically describe anginal symptoms, including retrosternal pain or pressure with radiation to the neck, jaw, left shoulder, or arm. This may be particularly true if there is significant coexistent atherosclerosis. "}, {"url": "http://breastfeeding.support/nipple-vasospasm-breastfeeding/", "passage_text": "Vasospasm is a constriction of the blood vessels in the nipple that causes the nipple to blanch, or turn white. Compression of the nipple is a common cause, either due to shallow breastfeeding or the baby compressing the nipple to slow fast milk flow. Nipple vasospasm may be triggered by a shallow latch and it can also be connected with Raynaud’s phenomenon (a condition affecting blood supply). Vasospasm can also cause deep breast and muscle pain (Mammary Constriction Syndrome)."}, {"url": "https://en.wikipedia.org/wiki/Vasospasm", "passage_text": "Vasospasm refers to a condition in which a blood vessel's spasm leads to vasoconstriction. Cerebral vasospasm may arise in the context of subarachnoid hemorrhage. Symptomatic vasospasm or delayed cerebral ischemia is a major contributor to post-operative stroke and death especially after aneurysmal subarachnoid hemorrhage. Vasospasm typically appears 4 to 10 days after subarachnoid hemorrhage. Along with physical resistance, vasospasm is a main cause of ischemia. Like physical resistance, vasospasms can occur due to atherosclerosis. Vasospasm is the major cause of prinzmetal angina"}, {"url": "http://emedicine.medscape.com/article/153943-overview", "passage_text": "In many cases, coronary artery vasospasm can occur spontaneously without an identifiable cause. Known triggers of spasm in susceptible patients include hyperventilation, cocaine or tobacco use, and administration of provocative agents such as acetylcholine, ergonovine, histamine, or serotonin. Alternative (or coexisting) mechanisms of coronary artery vasospasm include enhanced phospholipase C activity. In addition, coronary artery vasospasm is associated with increased markers of oxidative stress and inflammation, including thioredoxin, C-reactive protein (CRP), and monocyte levels."}, {"url": "http://breastfeeding.support/nipple-vasospasm-breastfeeding/", "passage_text": "Share. A vasospasm is a sudden constriction (or narrowing) of the blood vessels. Nipple vasospasm may be triggered by a shallow latch and it can also be connected with Raynaud’s phenomenon (a condition affecting blood supply). Vasospasm can also cause deep breast and muscle pain (Mammary Constriction Syndrome)."}]