[{"url": "http://www.webmd.boots.com/digestive-disorders/leaky-gut-syndrome", "passage_text": "Leaky gut syndrome. Leaky gut syndrome usually refers to absorption problems with the bowel, intestine or lining of the gut. However, it is not an officially recognised medical diagnosis and the so-called condition remains something of a mystery, with little clinical evidence to support causes, symptoms or treatments."}, {"url": "http://www.leakygut-syndrome.com/", "passage_text": "Leaky gut syndrome is a little known but very common disorder that refers to an irritated and inflamed small intestine. This irritation or inflammation results in foreign substances being absorbed into the bloodstream thus causing symptoms and other health problems."}, {"url": "http://www.leakygutcure.com/blog/leaky-gut-syndrome-symptoms/", "passage_text": "If you suffer from leaky gut or one or more of these symptoms, then odds are your gut health is not up to par. But the good news is that you don’t have to continue to suffer."}, {"url": "http://www.webmd.com/digestive-disorders/features/leaky-gut-syndrome", "passage_text": "Reviewed by Brunilda Nazario, MD. Leaky gut syndrome is said to have symptoms including bloating, gas, cramps, food sensitivities, and aches and pains. But it's something of a medical mystery. “From an MD’s standpoint, it’s a very gray area,” says gastroenterologist Donald Kirby, MD, director of the Center for Human Nutrition at the Cleveland Clinic."}, {"url": "http://www.drweil.com/drw/u/QAA361058/what-is-leaky-gut.html", "passage_text": "I would be wary of any diagnosis of leaky gut syndrome if you don't have inflammatory bowel conditions (Crohn's disease, celiac disease, irritable bowel syndrome), rheumatoid arthritis, or asthma. The leaky gut treatment I recommend involves avoiding alcohol and NSAIDS as well as any foods that you're allergic to."}, {"url": "http://www.leakygutcure.com/blog/leaky-gut-syndrome-symptoms/", "passage_text": "Then any number or combination of these symptoms of leaky gut can and will develop. Think of it like this… Increased intestinal permeability is like the equivalent of having gaping holes all over your skin that allow for all of the bacteria and other harmful substances to enter straight into your body."}, {"url": "http://www.healthywomen.org/content/blog-entry/10-signs-you-have-leaky-gut%E2%80%94and-how-heal-it", "passage_text": ", headaches, fatigue and joint pain. Leaky gut can also be caused by medications including. , steroids or. pain relievers like. and. , which can irritate the intestinal lining and damage protective mucus layers."}]