[{"url": "http://whitetiger-nitin.blogspot.com/2011/10/diet-of-white-tiger.html", "passage_text": "A white tiger eats the same as a normal tiger. Meat, and lots of it. They are carnivores and most if not all of the vegetation they get comes from the inside of the animals they prey on. Tigers can live in almost any climate. They need only shade, water and prey. Diet of white tiger. White tigers are just like orange tigers and we are familiar with them. The differences between orange and white tigers are physics and color. Snow tigers also exist in the wild life and they have no strips on their bodies."}, {"url": "http://www.answers.com/Q/What_eats_a_white_tiger", "passage_text": "They are carnivores. So they eat any animal that is made of meat such as other orange or white tigers, rabbits, or birds. A white tigers diet mainly consists of pig, cattle, o … ther livestock and deer. Tigers are pu"}, {"url": "http://www.answers.com/Q/What_do_white_tigers_eat", "passage_text": "Answer by Rojasher25. Confidence votes 171. They are carnivores. So they eat any animal that is made of meat such as other orange or white tigers, rabbits, or birds. A white tigers diet mainly consists of pig, cattle, other livestock and deer. Tigers are pure carnivores. They prefer hunting large ungulates such as chital, sambar, gaur, and to a small extent also barasingha, water buffalo, nilgai, serow and takin. What does a white tiger eat and what eats it? tigers eat nothing but meat they feed on small monkeys to large gaurs. they kill leopards, inidan croc, sloth bear, brown bear, bobcats, Indian junfle cats."}, {"url": "http://cat-chitchat.pictures-of-cats.org/2008/06/what-do-white-tigers-eat.html#!", "passage_text": "23. White tiger-A White Bengal Tiger cub-photo copyright Frank Peters. In answer to the question,  what do white tigers eat, the answer is that they eat the same as orange tigers. White tigers are not a separate breed of wild cat. They are the tigers that w e are familiar with. "}, {"url": "http://animalstime.com/what-tigers-eat-tigers-diet/", "passage_text": "(What Do Tigers Eat). These cats prey on greater ungulates such as wild pig, with occasionally killing of other species including Gray langur, muntjac, and hog deer. They also consume small animals like hares, rabbits, mice, porcupines, and peafowl. (What Do Tigers Eat). Indochinese tigers primarily prey on medium-sized prey and greater ungulates. Some of the food sources include wild pigs, bovids, sambar deer, serow, young gaur, and banteng. They also prey on wild water buffalo, Eld’s Deer, kouprey, Schomburgk’s Deer"}, {"url": "http://www.rocketswag.com/animal/tiger/white-tiger/What-Do-White-Tigers-Eat.html", "passage_text": "As mentioned earlier, most white tigers around the world can be seen in zoos. This is mainly because these tigers are nearly extinct due to poaching. They hunt deer, antelopes, bison, cows, monkeys and peacocks for food. All tigers are carnivorous animals and have to hunt and eat for their survival. The white tigers also live in grasslands and mangroves. The average white tiger lives up to 10 years, but sometimes it can have a lifespan of 15 years. "}, {"url": "http://www.answers.com/Q/What_eats_a_white_tiger", "passage_text": "A white tiger is a carnivore so it eats meat probably from small to medium sized prey and from what I recall nothing eats tigers besides some very brave humans. 22 people found this useful. So they eat any animal that is made of meat such as other orange or white tigers, rabbits, or birds. A white tigers diet mainly consists of pig, cattle, o … ther livestock and deer. Tigers are pure carnivores"}, {"url": "http://animalstime.com/what-tigers-eat-tigers-diet/", "passage_text": "What Do Tigers Eat. For the reason that tigers are massively muscled, they used to bring down medium as well as large-sized animals including gaur, chital, deer, sambar, nilgai, barasingha, wild boar, water buffalo, domestic buffalo, and several other animals. These animals are found to be preyed in India. (What Do Tigers Eat). Indochinese tigers primarily prey on medium-sized prey and greater ungulates. Some of the food sources include wild pigs, bovids, sambar deer, serow, young gaur, and banteng. They also prey on wild water buffalo, Eld’s Deer, kouprey, Schomburgk’s Deer, and hog deer."}]