[{"url": "https://en.wikipedia.org/wiki/Wuchereria_bancrofti", "passage_text": "Wuchereria bancrofti is a human parasitic roundworm that is the major cause of lymphatic filariasis. It is one of the three parasitic worms, besides Brugia malayi and B. timori, that infect lymphatic system to cause lymphatic filariasis. These filarial worms are spread by a mosquito vector. "}, {"url": "http://www.humanillnesses.com/original/E-Ga/Elephantiasis.html", "passage_text": "Photo by: Henrik Larsson. Elephantiasis (el-e-fan-TY-a-sis) is the result of a tropical worm infection called filariasis (fil-a-RY-a-sis). When infected mosquitoes transmit the parasitic worm Wuchereria bancrofti to people, the worm blocks the lymphatic system. The blockage causes swelling in the legs or other parts of the body, making these body parts appear large and puffy, or elephant-like. Elephantiasis is not elephant man disease, which is an inherited condition with completely different causes and symptoms."}, {"url": "http://bioweb.uwlax.edu/bio203/s2008/krout_bria/elephant.htm", "passage_text": "Elephantiasis. Wuchereria Bancrofti is the causative agent of Lymphatic filariasis. This disease is transferred by mosquitoes and is found mainly in the tropics and sub-tropics. It is very rarely found in Western countries. Onset is seen after puberty in most cases. "}, {"url": "http://www.news-medical.net/health/What-is-Elephantiasis.aspx", "passage_text": "Elephantiasis refers to a parasitic infection that causes extreme swelling in the arms and legs. The disease is caused by the filarial worm, which is transmitted form human to human via the female mosquito when it takes a blood meal. The parasite grows into an adult worm that lives in the lymphatic system of humans. Elephantiasis of leg due to filariasis. Luzon, Philippines. "}, {"url": "http://mamashealth.com/parinfect/elep.asp", "passage_text": "Elephantiasis is caused by several different types of parasitic worms, including Wuchereria bancrofti, Brugia malayi, and B. timori. Elephantiasis is transmitted by female mosquitoes. When an infected female mosquito bites a person, she may inject the worm larvae into the bloodstream. "}, {"url": "https://en.wikipedia.org/wiki/Elephantiasis", "passage_text": "Elephantiasis is a symptom of a variety of diseases, where parts of a person's body swell to massive proportions. Some conditions that have this symptom include: 1  Elephantiasis nostras, due to longstanding chronic lymphangitis. 2  Elephantiasis tropica or lymphatic filariasis, caused by a number of parasitic worms, particularly Wuchereria bancrofti. 3  Nonfilarial elephantiasis or podoconiosis, an immune disease affecting the lymph vessels. 1 Elephantiasis tropica or lymphatic filariasis, caused by a number of parasitic worms, particularly Wuchereria bancrofti. 2  Nonfilarial elephantiasis or podoconiosis, an immune disease affecting the lymph vessels."}, {"url": "http://www.the-travel-doctor.com/filariasis.htm", "passage_text": "FILARIASIS. Causative Agent. Filariasis refers to a group of vector-borne infections caused by microscopic, threadlike worms called roundworms or nematodes. The 3 main types are: Lymphatic Filariasis (Elephantiasis) due to Wuchereria bancrofti or Brugia malayi. Loiasis (Eye Worm) due to Loa Loa"}, {"url": "http://medical-dictionary.thefreedictionary.com/elephantiasis", "passage_text": "True elephantiasis is the result of a parasitic infection caused by three specific kinds of round worms. The long, threadlike worms block the body's lymphatic system—a network of channels, lymph nodes, and organs that helps maintain proper fluid levels in the body by draining lymph from tissues into the bloodstream. elephantiasis. 1. a chronic filarial disease, usually seen in the tropics, due to infection with Brugia malayi or Wuchereria bancrofti, marked by inflammation and obstruction of the lymphatics and hypertrophy of the skin and subcutaneous tissues, chiefly affecting the legs and external genitals."}, {"url": "http://www.studyalways.com/forum/1543-which-causative-agent-elephantiasis.aspx", "passage_text": "Answer: Option 3. Explanation: Elephantiasis is caused by Wuchereria bancrofti. It is also known as lymphatic filariasis as the worms occupy the lymphatic system and block it causing it to enlarge in size. "}]