[{"url": "http://www.biggreenbook.com/index.php?page=7&art_id=764", "passage_text": "Potentially, there are many records that an organisation could keep. Careful consideration should be given to what records should be kept and for how long. Some records are required to be kept be various pieces of legislation, while others may be useful in defending legal actions. These regulations require records of reportable injuries, diseases and dangerous occurrences to be kept for at least three years. RIDDOR incidents may not be reported on-line or by phone, but all records must contain the basic information required by the HSE form F2508."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20120303023726AANXUqE", "passage_text": "Best Answer: COSHH records should be kept somewhere accessible in case of emergency. I am not sure it there is particular requirements in schools, but heads of depts should be ale to tell you where they are kept. COSHH stands for Control of Substances Hazardous to Health. They are details of each substance, i.e bleach, tippex, any chemicals used for cleaning etc, that list various information relating tot he product. This includes, risk phrases, actions to be taken in case of spillage, first aid requirements."}, {"url": "http://www.reading.ac.uk/web/FILES/health-and-safety/NOT29H_SRecords.pdf", "passage_text": "”. This Safety Note attempts to answer these questions. The University requires that certain types of record should be kept to comply with the University Health and Safety Policy (as specified in the various University Safety Guides, which give detailed advice on matters of health and safety). Also, civil claims for injury can be made up to 3 years after an incident, so it is a good idea to also keep risk assessments relating to the previous 3 years. Some records relating to health or environmental risks must be kept for longer periods – these are listed in the Appendix."}, {"url": "http://www.reading.ac.uk/web/FILES/health-and-safety/NOT29H_SRecords.pdf", "passage_text": "The file should serve as the central health and safety record for the department / school / directorate. Details of the following should be kept in the file (where applicable):  A current list of names of individuals with key health and safety roles-e.g. Also, civil claims for injury can be made up to 3 years after an incident, so it is a good idea to also keep risk assessments relating to the previous 3 years. Some records relating to health or environmental risks must be kept for longer periods – these are listed in the Appendix."}, {"url": "http://www.hse.gov.uk/health-surveillance/record-keeping/index.htm", "passage_text": "Health records, or a copy, should be kept in a suitable form for at least 40 years from the date of last entry because often there is a long period between exposure and onset of ill health. Individual, up-to-date health records must be kept for each employee placed under health surveillance. These should include details about the employee and the health surveillance procedures relating to them. Employee details should include: 1  surname. 2  forename(s). 3  gender. 4  date of bir"}, {"url": "http://www.bomelconsult.com/HSE/Package/OHMM/RECORD%20KEEPING.htm", "passage_text": "Some regulations-COSHH and those for lead, asbestos, ionising radiations and compressed air-state that records should be retained for much longer (up to 50 years) as ill health effects might not emerge until a long time after exposure. Health records should not contain personal medical information. These must be kept separately and in confidence by the occupational health professional (See below for advice on medical in confidence records) ."}, {"url": "http://safety.eng.cam.ac.uk/procedures/riskassessment/COSHH", "passage_text": "Notification will be given to Occupational Health and those working with them should complete a health record and submit it to the Safety Office annually. These records must be kept by the Department for 40 years to comply with the COSHH Regulations. "}, {"url": "http://www.healthandsafetytips.co.uk/forums/viewtopic.php?f=1&t=26095", "passage_text": "How long to keep accident records. by keith666 » Thu Sep 02, 2010 2:51 pm. Quick question before i trawl the legislation, how long should accident/incident records (and personnel files) be kept, we currently scan all over 3 years."}, {"url": "http://www.biggreenbook.com/index.php?page=7&art_id=764", "passage_text": "Using exposure to hazardous substances as an example: Regulation 11 of COSHH requires employers to maintain an up-to-date health record for each individual employee placed under health surveillance. This record should contain the information this is approved by HSE, namely: These regulations require records of reportable injuries, diseases and dangerous occurrences to be kept for at least three years. RIDDOR incidents may not be reported on-line or by phone, but all records must contain the basic information required by the HSE form F2508."}]