[{"url": "https://www.dhs.wisconsin.gov/vitalrecords/death.htm", "passage_text": "The cost for expedited service is $20.00 per record in addition to the usual $20.00 death certificate search fee. The search fee includes one copy of the certificate, if found. Additional copies of the same certificate, requested at the same time as the first, are $3.00 each. Expedited in-person requests for certified copies of death certificates generally will be completed within 15 to 30 minutes. Expedited in-person requests for uncertified copies of death certificates will be completed within two hours. Expedited requests will not be processed after 4:00 p.m. The cost for expedited service is $20.00 per record in addition to the $20.00 death certificate search fee"}, {"url": "https://www.health.ny.gov/vital_records/death.htm", "passage_text": "1 For Priority Handling: There is an additional fee of $15.00 per death certificate copy. ( 2 Total per copy is $45.00). 3  Internet and telephone orders require a major credit card. 4  These orders receive priority handling and the fee is $30.00 + $15.00 priority handling fee for a total of $45.00 per death certificate copy. 1 These orders receive priority handling and the fee is $30.00 + $15.00 priority handling fee for a total of $45.00 per death certificate copy. 2  There is an additional $8.00 vendor processing fee which is charged per transaction (not per copy)"}, {"url": "http://www.answers.com/Q/How_long_does_it_take_to_get_a_death_certificate_after_a_person_dies", "passage_text": "How long does it take to get a death certificate in the state of ne? If you go to the Nebraska Department of Health and Human Services in person, you can get a death certificate in about 30 minutes. If you order it by regular mail, it will take … 10 to 15 working days. If you order it using an expedited service, it will be processed in 1 or 2 working days. "}, {"url": "http://publichealth.lacounty.gov/dca/dcadeath.htm", "passage_text": "Death Certificate: $21.00 / certified copy Fetal Death Certificate: $18.00 / certified copy Still Birth: $20.00 / certified copy. Make check payable to County of Los Angeles. We accept cash, check**, credit/ATM*** or money order. Death Certificate: $21.00 / certified copy Fetal Death Certificate: $18.00 / certified copy Still Birth: $20.00 / certified copy. Mail"}, {"url": "http://publichealth.lacounty.gov/dca/dcadeath.htm", "passage_text": "We accept check** or money order. DO NOT SEND CASH. Death Certificate: $21.00 / certified copy Fetal Death Certificate: $18.00 / certified copy Still Birth: $20.00 / certified copy. Make check payable to County of Los Angeles. We accept cash, check**, credit/ATM*** or money order. Forms. 1. Application for a Death Certificate. 2. Death Certificate: $21.00 / certified copy Fetal Death Certificate: $18.00 / certified copy Still Birth: $20.00 / certified copy. Mail"}, {"url": "http://www.ok.gov/health/Birth_and_Death_Certificates/Death_Certificates/index.html", "passage_text": "The fee for the search of a death certificate is $15.00 and will include the issuance of one certified copy to a qualified applicant if the certificate is on file. Additional copies will be issued at a cost of $15.00 each. The searching fee is not refundable or transferable. "}, {"url": "https://www.health.ny.gov/vital_records/death.htm", "passage_text": "1 The fee is $30.00 per death certificate copy. 2  For Priority Handling: There is an additional fee of $15.00 per death certificate copy. ( 3 Total per copy is $45.00). 4  Internet and telephone orders require a major credit card. 1 These orders receive priority handling and the fee is $30.00 + $15.00 priority handling fee for a total of $45.00 per death certificate copy. 2  There is an additional $8.00 vendor processing fee which is charged per transaction (not per copy)"}, {"url": "http://adph.org/vitalrecords/index.asp?id=1560", "passage_text": "Cost. The fee to search for a death certificate is $15.00, which includes one certified copy of the death certificate or a Certificate of Failure to Find.. For each additional copy of the certificate ordered at the same time, the fee is $6.00. Checks or Money Orders should be made payable to the State Board of Health. 1 Montgomery, Alabama 36103-5625. 2  In Person in Alabama: You may go to any county health department in the State of Alabama to obtain a certified copy of an Alabama death certificate. 3  Most death certificates can be issued while you wait."}]