[{"url": "http://www.explainthatstuff.com/alloys.html", "passage_text": "You might see the word alloy described as a mixture of metals, but that's a little bit misleading because some alloys contain only one metal and it's mixed in with other substances that are nonmetals (cast iron, for example, is an alloy made of just one metal, iron, mixed with one nonmetal, carbon). Substitution alloys. If the atoms of the alloying agent replace atoms of the main metal, we get what's called a substitution alloy. An alloy like this will form only if the atoms of the base metal and those of the alloying agent are of roughly similar size."}, {"url": "http://evanstechnology.com/copper-deep-drawn-stampings/", "passage_text": "Copper and Copper Alloys. Copper and its alloys are widely used in deep draw and flat stamped products because they have excellent electrical and thermal performance, good resistance to corrosion, high ductility and relatively low cost. These sprinkler activators are copper with a tin plating. "}, {"url": "http://www.totalmateria.com/Article27.htm", "passage_text": "Copper and Copper Alloys. COPPER and its alloys constitute one of the major groups of commercial metals. They are widely used because of their excellent electrical and thermal conductivity, outstanding resistance to corrosion, and ease of fabrication, together with good strength and fatigue resistance. They are generally nonmagnetic. "}, {"url": "https://en.wikipedia.org/wiki/Architectural_metals", "passage_text": "Zinc is still used in alloys such as brass and nickel silver, and in the electroplating of steel as well. Today, galvanized steel and pure zinc material, usually Double Locked Standing Seam panels, are used for roofing a variety of buildings. "}, {"url": "http://chemistry.tutorvista.com/inorganic-chemistry/alloys.html", "passage_text": "Bronze which is an alloy of copper and tin has more resistance to corrosion and widely used is ship-building. Titanium alloys are less dense and stronger compare to other metals. Therefore they mainly used in ship, aircraft, and spacecraft. Generally pure metals are less useful sue to more softness. Alloys show quite different properties compare to their constituent metals. They show quite batter properties than metals. For example; steel is an alloy of iron and used as building material due to high strength. Similarly brass and bronze can easily mold in various shapes compare to"}, {"url": "http://encyclopedia2.thefreedictionary.com/alloy", "passage_text": "Alloys of iron and carbon include cast iron and steels; brass and bronze are important alloys of copper; amalgams are alloys that contain mercury; and chromium is an important additive in stainless steel. Because pure gold and silver are soft, they are often alloyed with one another or with other metals. For alternating-current applications, silicon-ferrite is commonly used. This is an alloy of iron containing as much as 5% silicon. Permalloy and some comparable cobalt-base alloys are used in the communications industry."}, {"url": "http://www.explainthatstuff.com/alloys.html", "passage_text": "Brass, for example, is a substitution alloy based on copper in which atoms of zinc replace 10–35 percent of the atoms that would normally be in copper. Brass works as an alloy because copper and zinc are close to one another in the periodic table and have atoms of roughly similar size. Substitution alloys. If the atoms of the alloying agent replace atoms of the main metal, we get what's called a substitution alloy. An alloy like this will form only if the atoms of the base metal and those of the alloying agent are"}, {"url": "https://en.wikipedia.org/wiki/Alloy", "passage_text": "For example, 14 karat gold is an alloy of gold with other elements. Similarly, the silver used in jewelry and the aluminium used as a structural building material are also alloys. The term alloy is sometimes used in everyday speech as a synonym for a particular alloy. For example, automobile wheels made of an aluminium alloy are commonly referred to as simply  alloy wheels , although in point of fact steels and most other metals in practical use are also alloys. The term alloy is used to describe a mixture of atoms in which the primary constituent is a metal. The primary metal is called the base, the matrix, or the solvent. The secondary constituents are often called solutes."}, {"url": "https://www.gemsociety.org/article/fundametals-jewelery-metals-overview/", "passage_text": "By mixing gold with other metals, or alloying it, gold is made stronger, which makes it durable enough to wear more often without experiencing wear. A variety of metals are commonly used to alloy gold, including silver, copper, nickel, iron, zinc, tin, manganese, cadmium, and titanium. Along with enhancing gold’s strength, alloying gold with other metals changes some of gold’s other properties as well. They are Gold, Silver, and Platinum. These three metals and the alloys that utilize them are referred to as the Noble Metals. Noble Metals have four properties in common. 1  They are precious metals and are also used as currency (a store of value) because of their intrinsic value."}, {"url": "https://en.wikipedia.org/wiki/Alloy", "passage_text": "An alloy is a mixture of metals or a mixture of a metal and another element. Alloys are defined by metallic bonding character. The term alloy is used to describe a mixture of atoms in which the primary constituent is a metal. The primary metal is called the base, the matrix, or the solvent. The secondary constituents are often called solutes."}]