[{"url": "https://answers.yahoo.com/question/index?qid=20090323102346AAGBqIX", "passage_text": "RE: What is a portrait style photograph? I&#39;m submitting an on-line application for a university, and it recommends I upload a &quot;portrait style identification photograph&quot; of myself. According to Wikipedia, &quot;Portrait photography ... is the capture by means of photography of the likeness of a person or a small group of... Source(s): portrait style photograph: https://tr.im/EsrW9."}, {"url": "https://en.wikipedia.org/wiki/Portrait", "passage_text": "A portrait is a painting, photograph, sculpture, or other artistic representation of a person, in which the face and its expression is predominant. The intent is to display the likeness, personality, and even the mood of the person. For this reason, in photography a portrait is generally not a snapshot, but a composed image of a person in a still position."}, {"url": "http://www.visual-arts-cork.com/genres/portrait-art.htm", "passage_text": "About Portrait Art. In fine art, a portrait can be a sculpture, a painting, a form of photography or any other representation of a person, in which the face is the main theme. Traditional easel-type portraits usually depict the sitter head-and-shoulders, half-length, or full-body. "}, {"url": "http://www.webopedia.com/TERM/P/portrait.html", "passage_text": "Main » TERM » P ». )The terms portrait and landscape refer to different orientations of the paper -- whether it is oriented vertically or horizontally. A page with portrait orientation, typical for letters, memos, and other text documents, is taller than it is wide"}, {"url": "https://en.wikipedia.org/wiki/Portrait_photography", "passage_text": "Portrait of a girl in costume in the natural environment of a gothic festival. Portrait photography or portraiture is photography of a person or group of people that displays the expression, personality, and mood of the subject. Like other types of portraiture, the focus of the photograph is usually the person's face, although the entire body and the background or context may be included. The relatively low cost of the daguerreotype in the middle of the 19th century and the reduced sitting time for the subject, though still much longer than now, led to a general rise in the popularity of portrait photography over painted portraiture."}, {"url": "https://answers.yahoo.com/question/index?qid=20090323102346AAGBqIX", "passage_text": "What they are looking for is a head-and-shoulders portrait of the person that clearly depicts the face. For a university application, I think you want to submit something that is more personal than a mere passport photo-perhaps something with somewhat more dramatic lighting and with an indication of personality. According to Wikipedia, &quot;Portrait photography ... is the capture by means of photography of the likeness of a person or a small group of... Source(s): portrait style photograph: https://tr.im/EsrW9."}, {"url": "https://answers.yahoo.com/question/index?qid=20090323102346AAGBqIX", "passage_text": "I'm submitting an on-line application for a university, and it recommends I upload a portrait style identification photograph of myself. According to Wikipedia, Portrait photography ... is the capture by means of photography of the likeness of a person or a small group of people, in which the... show more. Follow. According to Wikipedia, &quot;Portrait photography ... is the capture by means of photography of the likeness of a person or a small group of... Source(s): portrait style photograph: https://tr.im/EsrW9."}, {"url": "https://en.wikipedia.org/wiki/Portrait", "passage_text": "Roman-Egyptian funeral portrait of a young boy. A portrait is a painting, photograph, sculpture, or other artistic representation of a person, in which the face and its expression is predominant. The intent is to display the likeness, personality, and even the mood of the person. For this reason, in photography a portrait is generally not a snapshot, but a composed image of a person in a still position."}, {"url": "http://learnmyshot.com/9-fundamental-styles-of-portrait-photography/", "passage_text": "The term Lifestyle Portrait refers to portraits where emphasis is given to suggest the “style of living” of the individuals depicted. Technically it is a combination of environmental portrait and candid portrait. It is important for photographers to identify separate styles in order to choose the right creative direction for future projects. Being able to understand different styles will also help you to organize existing work in a portfolio. Below is a list of fundamental styles that relate to portrait photography."}]