[{"url": "http://digestivehealthguide.com/activia-probiotics/", "passage_text": "Activia yogurt is part of a huge health market that promotes and sells probiotic yogurts and drinks. Many of the manufacturers, including Danone have made made several claims that their yogurt can improve your digestive health and help alleviate certain digestive disorders."}, {"url": "http://digestivehealthguide.com/activia-probiotics/", "passage_text": "Activia Probiotic Strains. To be called a probiotic yogurt the product must contain a live active culture, which is a fancy name for a probiotic bacteria. Like many health food companies, Danone use their own exclusive probiotic cultures called Bifidus ActiRegularis® in their range of Activia yogurts."}, {"url": "http://www.powerofprobiotics.com/Activia.html", "passage_text": "Activia: Yogurt With Regularis Probiotics. Activia is a probiotic yogurt or smoothie that is marketed by the Danone company (Dannon in the US) to help with occasional constipation as long as 3 servings per day are consumed. It contains the beneficial bacteria B. lactis DN-173010, scientifically known as Bifidobacterium animalis subsp. lactis DN-173010. In the US, Dannon calls this probiotic Bifidus Regularis. For more information on Bifidus Regularis and on its various names in other countries, click here."}, {"url": "http://www.activia.us.com/", "passage_text": "Help face the day feeling good inside. Discover Activia ® - a creamy, delicious probiotic lowfat yogurt that not only tastes good, but helps regulate your digestive system * to help make you feel good inside. Dive into one of our seven yummy flavors today."}, {"url": "http://goaskalice.columbia.edu/answered-questions/will-probiotic-enriched-yogurt-aid-digestion", "passage_text": "Dannon (of course) says yes. Their Activia yogurt contains Bifidus regularis, a probiotic strain trademarked by Dannon that is not in other yogurts, and they claim that this particular strain speeds wastes through the digestive system and improves immunity in the intestines more effectively than other strains."}]