[{"url": "http://learn.genetics.utah.edu/content/labs/extraction/howto/", "passage_text": "First, you need to find something that contains DNA. Since DNA is the blueprint for life, everything living contains DNA. For this experiment, we like to use green split peas. But there are lots of other DNA sources too, such as: 1  Spinach. 2  Chicken liver. 3  Strawberries."}, {"url": "http://classic.sidwell.edu/us/science/vlb5/Labs/DNA_Extraction_Lab/Wheat_Germ/wheat_germ.html", "passage_text": "Gently stir in 2 g of the meat tenderizer and 5 mL of sodium bicarbonate solution (NaCO3). The meat tenderizer also settled at the bottom and mixed with the wheat germ. The NaCO3 mixed with the detergent as well."}, {"url": "http://www.biologyjunction.com/extracting_dna.htm", "passage_text": "The DNA in the nucleus of the cell is molded, folded, and protected by proteins. The meat tenderizer cuts the proteins away from the DNA. 1  Tilt your test tube and slowly pour rubbing alcohol (70-95% isopropyl or ethyl alcohol) into the tube down the side so that it forms a layer on top of the pea mixture."}, {"url": "http://www.biologyjunction.com/extracting_dna.htm", "passage_text": "1 First, you need to find something that contains DNA such as split peas, fresh spinach, chicken liver, onion, or broccoli. 2  Measure about 100 ml or 1/2 cup of split peas and place them in a blender. 3  Add a large pinch of salt (less than 1 ml or about 1/8 teaspoon) to the blender."}, {"url": "http://learn.genetics.utah.edu/content/labs/extraction/howto/", "passage_text": "Since DNA is the blueprint for life, everything living contains DNA. For this experiment, we like to use green split peas. But there are lots of other DNA sources too, such as: 1  Spinach. 2  Chicken liver. 3  Strawberries."}, {"url": "http://learn.genetics.utah.edu/content/labs/extraction/howto/enzyme/", "passage_text": "In this experiment, meat tenderizer acts as an enzyme to cut proteins just like a pair of scissors. The DNA in the nucleus of the cell is molded, folded, and protected by proteins. The meat tenderizer cuts the proteins away from the DNA."}, {"url": "http://www.biologyjunction.com/extracting_dna.htm", "passage_text": "Blender, split peas, salt, detergent, water, measuring cup and spoons, strainer, meat tenderizer, alcohol, test tube, glass stirring rod. Procedure: 1  First, you need to find something that contains DNA such as split peas, fresh spinach, chicken liver, onion, or broccoli. 2  Measure about 100 ml or 1/2 cup of split peas and place them in a blender. 3  Add a large pinch of salt (less than 1 ml or about 1/8 teaspoon) to the blender."}]