[{"url": "http://www.acunetix.com/blog/articles/what-is-an-htaccess-file/", "passage_text": "An .htaccess file is a configuration file which provides the ability to specify configuration settings for a specific directory in a website. The .htaccess file can include one or more configuration settings which apply only for the directory in which the .htaccess file has been placed. In the next example, the .htaccess file is included in the wordpress-website directory which controls who can access the wordpress-site directory. For instance, someone that has access to the htdocs directory might not be able to access the wordpress-site directory due to authentication restrictions."}, {"url": "http://www.htmlgoodies.com/beyond/webmaster/article.php/3899416/What-is-the-htaccess-File-and-What-Can-I-Do-With-It.htm", "passage_text": "Tweet. Before we go any farther, let's explain what the .htaccess file is. htaccess is short for Hypertext Access, and is a configuration file used by Apache-based web servers that controls the directory that it lives in--as well as all the subdirectories underneath that directory."}, {"url": "http://www.htaccess-guide.com/", "passage_text": ".htaccess is a configuration file for use on web servers running the Apache Web Server software. When a .htaccess file is placed in a directory which is in turn 'loaded via the Apache Web Server', then the .htaccess file is detected and executed by the Apache Web Server software. "}, {"url": "http://www.inmotionhosting.com/support/website/htaccess/what-is-the-htaccess-file-and-what-do-i-use-it-for", "passage_text": "In this tutorial: Htaccess files are hidden plain text files that are on the server to help control how your visitors interact with your website. The htaccess file is also used to block specific traffic from being able to view your website. If you look for your .htaccess file you'll see that there's no filename. "}, {"url": "https://wordpress.org/support/topic/what-is-htaccess-file-and-how-do-i-use-it", "passage_text": "Save the file as .htaccess and upload it the root directory or the folder itself that has the WordPress files.. I don't know why to do this, or how to do it. stvwlf. You need to upload it using FTP. The easiest way to do one file, one time, is to use the file management utility in your website hosting control panel. "}, {"url": "https://codex.wordpress.org/htaccess", "passage_text": "htaccess. Languages: English • 日本語 •. The .htaccess is a distributed configuration file, and is how Apache handles configuration changes on a per-directory basis. WordPress uses this file to manipulate how Apache serves files from its root directory, and subdirectories thereof. Most notably, WP modifies this file to be able to handle pretty permalinks. "}, {"url": "https://en.wikipedia.org/wiki/Htaccess", "passage_text": "(Redirected from Htaccess). A .htaccess (hypertext access) file is a directory-level configuration file supported by several web servers, that allows for decentralized management of web server configuration. The original purpose of .htaccess—reflected in its name—was to allow per-directory access control by, for example, requiring a password to access the content. More commonly, however, the .htaccess files override many other configuration settings such as content type, character set, CGI handlers, etc."}, {"url": "http://www.htaccess-guide.com/how-to-use-htaccess/", "passage_text": "How to use .htaccess. '.htaccess' is the filename in full, it is not a file extension. For instance, you would not create a file called, 'file.htaccess', it is simply called, '.htaccess'. This file will take effect when placed in any directory which is then in turn loaded via the Apache Web Server software. "}, {"url": "https://varvy.com/pagespeed/htaccess.html", "passage_text": "The .htaccess file is a small and powerful text file that controls many aspects of how your webpages display. Things like redirects, enabling compression, rewriting urls, leveraging browser caching and more can be accomplished by adding some code to this little file. "}]