[{"url": "http://sociology.about.com/od/Disciplines/a/Sociology-Of-Race-Ethnicity.htm", "passage_text": "An ethnic group is a social category of people who share a common culture, such as a common language, a common religion, or common norms, customs, practices, and history. Ethnic groups have a consciousness of their common cultural bond. Assimilation is a process in which a minority becomes absorbed into the dominant society – socially, economically, and culturally. Symbolic interaction theorists look at two issues in relation to race and ethnicity. First, they look at the role of social interaction and how it reduces racial and ethnic hostility."}, {"url": "http://www.racismreview.com/blog/2013/02/24/ethnicity-is-a-social-construction-too/", "passage_text": "Ethnicity is a Social Construction Too. February 24, 2013 • Zulema • capitalism, ethnic groups, Hispanic, identities, Latinos, white privilege, whiteness. Tweet. Those of us who study racial and ethnic relations in the United States recognize that race is a social construction. In other words, her racial identity is White (she mentions that “No one considers [me] Hispanic”), although she has on occasion identified as Hispanic for instrumental reasons. Either way, the social construction of race is apparent here."}, {"url": "http://www.racismreview.com/blog/2013/02/24/ethnicity-is-a-social-construction-too/", "passage_text": "From this perspective, ethnic self-identity matters for individuals and society in a way that racial self-identity doesn’t. Ironically, this idea is related to a counterintuitive conception of ethnicity that characterizes it as more fluid than race, because one’s ethnicity is always “optional” (Waters 1990) . In other words, her racial identity is White (she mentions that “No one considers [me] Hispanic”), although she has on occasion identified as Hispanic for instrumental reasons. Either way, the social construction of race is apparent here."}, {"url": "http://www.racismreview.com/blog/2013/02/24/ethnicity-is-a-social-construction-too/", "passage_text": "The problem with this construction of ethnicity is that it tends to reinforce the idea that ethnicity is somehow more “real” (if more fluid) than race. And if ethnicity is more real than race, then for some scholars, it becomes inherent, primordial. In other words, her racial identity is White (she mentions that “No one considers [me] Hispanic”), although she has on occasion identified as Hispanic for instrumental reasons. Either way, the social construction of race is apparent here."}, {"url": "http://www.pbs.org/race/000_About/002_04-experts-03-02.htm", "passage_text": "So while one could argue that both ethnicity and race are socially constructed, their influence in terms of power and inequality is in the way that racial identities have been constructed historically. One could argue that they're both illusory and imagined. I think the most powerful argument about the differentiation between race and ethnicity is that race becomes institutionalized in a way that has profound social consequences on the members of different groups."}, {"url": "http://www.ncddr.org/products/researchexchange/v04n01/concepts.html", "passage_text": "Disability as a socially constructed concept. Disability, like race, ethnicity, and culture, is a term whose definitions are culturally derived, even though its meaning in the U.S. has been given what Harry (1992, p. 113) calls transcendent status.. Moreover, because culture is a learned phenomenon, individuals and groups can and do change their ethnic or cultural identities and interests through such processes as migration, conversion, and assimilation or through exposure to modifying influences (Smedley, 1993, quoted in Carter & Qureshi, 1995, p. 241)."}, {"url": "http://sociology.about.com/od/Disciplines/a/Sociology-Of-Race-Ethnicity.htm", "passage_text": "Ethnic groups are also found in other societies, such as the Pashtuns in Afghanistan or the Shiites in Iraq, whose ethnicity is base on religious differences. Like ethnicity, race is primarily, though not exclusively, a socially constructed category. A race is a group that is treated as distinct in society based on certain characteristics. Assimilation is a process in which a minority becomes absorbed into the dominant society – socially, economically, and culturally. Symbolic interaction theorists look at two issues in relation to race and ethnicity. First, they look at the role of social interaction and how it reduces racial and ethnic hostility."}, {"url": "https://en.wikipedia.org/wiki/Social_constructionism", "passage_text": "Social constructionism or the social construction of reality (also social concept) is a theory of knowledge in sociology and communication theory that examines the development of jointly constructed understandings of the world. Hacking suggests that this third part of the analysis, the interaction between a socially constructed category and the individuals that are actually or potentially included in that category, is present in many social construction analyses involving types of human beings."}, {"url": "http://www.racismreview.com/blog/2013/02/24/ethnicity-is-a-social-construction-too/", "passage_text": "Why race as a social construction matters for ethnicity. The dialectical fluidity of race — between self-definition and other-definition, between an individual’s chosen racial identity versus society’s imposed racial identity — facilitates an understanding of race as a social construction. In other words, her racial identity is White (she mentions that “No one considers [me] Hispanic”), although she has on occasion identified as Hispanic for instrumental reasons. Either way, the social construction of race is apparent here."}, {"url": "http://www.answers.com/Q/What_does_it_mean_to_say_that_race_and_ethnicity_are_socially_constructed", "passage_text": "Even though race and ethnicity are socially constructed, people do not always have the ability to choose their race or ethnicity. This is because race and ethnicity are not random. Social class is more important than race-ethnicity in determining a family's characteristics because it reflects the kind of lifestyle a family is living. Social class is also … a representation of a family's financial capability. Race or ethnicity can represent cultures but not the standards of living."}]