[{"url": "http://www.naturalnews.com/024929_hair_stress_loss.html", "passage_text": "Nutritional deficiencies may be signaled by thinning hair. Your hair loss may be caused by vitamin D deficiency. Studies show that a large segment of the American population is deficient in this essential nutrient, with hair loss being one of the primary symptoms of this deficiency. Hair thinning will continue unless effective means of dealing with the stress are put in place and calmness can be restored. Prolonged hair loss caused by chronic stress is a warning that other bodily systems are in jeopardy."}, {"url": "http://www.healwithfood.org/hairloss/", "passage_text": "Another good tip is to incorporate dietary sources of vitamin A into your hair loss prevention diet. Vitamin A promotes the growth of healthy cells and tissues, including hair and the scalp. A deficiency of vitamin A can cause hair loss and thinning hair. The first tip for preventing hair loss is to add more vitamin C rich foods to your diet. Vitamin C is required for the synthesis of collagen which in turn supports hair follicles and keeps blood vessels in the scalp healthy."}, {"url": "http://www.webmd.com/beauty/hair-health-11/eat-hair-type", "passage_text": "Healthy Hair: Protein Is Important. Your hair needs the same well-rounded diet that provides all the recommended vitamins, minerals, and other nutrients needed for good health in the rest of your body. Take protein, for example. A strand of hair is composed of mostly protein, which means your hair needs protein to grow. You might be surprised to learn that it's a balanced diet. Experts agree that a healthy diet with the right mix of protein, iron, and other nutrients can help improve the health, look, and feel of your hair."}, {"url": "http://www.webmd.com/beauty/hair-health-11/eat-hair-type?page=2", "passage_text": "Not getting enough iron can cause hair loss. The best source of iron in your diet is meat, Gerbstadt says. Clams, oysters, and organ meat top the list But there are problems with eating a lot of organ meat, Gerbstadt says. Lean meat, though -- pork, beef, and fish -- are all good sources.. "}, {"url": "http://www.healthclop.com/mineral-protein-and-vitamin-deficiency-in-causing-hair-loss/", "passage_text": "And in fact, protein is the most essential basic nutrient for your hair growth. If you are being at lack of protein and you experience it frequently, your body is more likely to use protein efficiently and even save protein by altering the phase of growing hairs into the phase of resting. B-Vitamins deficiencies and hair loss. Lack of B vitamins (such as B1 and B2) can lead to undernourishment of cells of hair follicles. As a result, the hair follicles cannot grow optimally and also tends to fall out easily. Vitamin B-12 is also crucial."}, {"url": "http://www.nutritionist-resource.org.uk/articles/healthy-hair.html", "passage_text": "Protein deficiency. As hair is made mostly of protein, eating a diet that contains sufficient levels of protein is considered essential for keeping hair healthy, strong and growing naturally. A deficiency can lead to thin, brittle hair or hair loss. The top recommended protein-packed foods for healthy hair include: 1  Oily fish-Salmon, herring, mackerel, sardines and trout are packed with protein and good fats (omega-3 fatty acids) that contribute towards hair shine and strength, and help to prevent breakage."}, {"url": "http://www.huffingtonpost.com/2014/07/17/bad-hair-nails-diet-foods_n_2964618.html", "passage_text": "Just like your skin, your hair and nails are affected by the foods you choose to eat. And we're not talking about the sheen of those lustrous waves or a hangnail. Both hair and nails can become brittle and dry, and hair can thin or fall out without the right range of nutritious picks in your diet. Wu says she spends a good amount of time discussing diet with patients who come to her with thinning hair or brittle nails. One of the main culprits in her Los Angeles office is too much fish. Some fish contain high levels of mercury, and high levels of mercury can lead to hair loss , she says."}, {"url": "http://www.huffingtonpost.com/2014/07/17/bad-hair-nails-diet-foods_n_2964618.html", "passage_text": "Less research exists to document the impact of various foods on hair and nail health than to illustrate the role of diet in healthy skin. But there are still a few foods to consider avoiding if you're concerned about brittle nails or thinning hair. Wu says she spends a good amount of time discussing diet with patients who come to her with thinning hair or brittle nails. One of the main culprits in her Los Angeles office is too much fish. Some fish contain high levels of mercury, and high levels of mercury can lead to hair loss , she says."}, {"url": "http://www.naturalnews.com/024929_hair_stress_loss.html", "passage_text": "Hair loss may also be the result of deficiencies of the amino acid lysine, copper, and zinc. However, if your diet is comprised of a wide selection of whole foods including daily servings of fresh vegetables and fruits, this may not be the cause of your hair loss, especially if you are getting enough protein. Hair thinning will continue unless effective means of dealing with the stress are put in place and calmness can be restored. Prolonged hair loss caused by chronic stress is a warning that other bodily systems are in jeopardy."}, {"url": "https://answers.yahoo.com/question/index?qid=20101217002748AAQ0taB", "passage_text": "However, when your diet is lacking in proper nutrition, or when you make drastic changes to your current diet, hair loss can result. Try to avoid high amounts of fatty foods and high amounts of Vitamin A in your diet as these have been shown to cause hair loss. "}]