[{"url": "http://www.mayoclinic.org/diseases-conditions/high-blood-cholesterol/in-depth/cholesterol/ART-20045192", "passage_text": "Oatmeal, oat bran and high-fiber foods. Oatmeal contains soluble fiber, which reduces your low-density lipoprotein (LDL), the bad cholesterol. Soluble fiber is also found in such foods as kidney beans, apples, pears, barley and prunes. Soluble fiber can reduce the absorption of cholesterol into your bloodstream. Five to 10 grams or more of soluble fiber a day decreases your total and LDL cholesterol. Eating fatty fish can be heart healthy because of its high levels of omega-3 fatty acids, which can reduce your blood pressure and risk of developing blood clots. In people who have already had heart attacks, fish oil — or omega-3 fatty acids — may reduce the risk of sudden death."}, {"url": "http://www.mayoclinic.org/diseases-conditions/high-blood-cholesterol/in-depth/reduce-cholesterol/art-20045935", "passage_text": "1 Eat foods rich in omega-3 fatty acids. 2  Omega-3 fatty acids don't affect LDL cholesterol. 3  They have other heart benefits, such as helping to increase high-density lipoprotein (HDL, or good) cholesterol, reducing your triglycerides, a type of fat in your blood, and reducing blood pressure. Top 5 lifestyle changes to improve your cholesterol. Lifestyle changes can help reduce cholesterol, keep you off cholesterol-lowering medications or enhance the effect of your medications. Here are five lifestyle changes to get you started. High cholesterol increases your risk of heart disease and heart attacks"}, {"url": "http://www.mayoclinic.org/diseases-conditions/high-blood-cholesterol/in-depth/reduce-cholesterol/art-20045935", "passage_text": "1 They have other heart benefits, such as helping to increase high-density lipoprotein (HDL, or good) cholesterol, reducing your triglycerides, a type of fat in your blood, and reducing blood pressure. 2  Some types of fish — such as salmon, mackerel and herring — are rich in omega-3 fatty acids. Top 5 lifestyle changes to improve your cholesterol. Lifestyle changes can help reduce cholesterol, keep you off cholesterol-lowering medications or enhance the effect of your medications. Here are five lifestyle changes to get you started. High cholesterol increases your risk of heart disease and heart attack"}, {"url": "http://www.utmedicalcenter.org/heart-lung-vascular-institute/medical-services/healthy-living-kitchen/ways-to-improve-your-cholesterol/", "passage_text": "Ways to Improve Your Cholesterol. A blood test is used to measure cholesterol levels. A person’s total cholesterol level is determined from calculations and measurements of low-density lipoprotein (LDL), high-density lipoprotein (HDL), and triglycerides. Standard total cholesterol goals for adults are: "}, {"url": "http://www.cnn.com/2009/HEALTH/expert.q.a/03/06/cholesterol.hdl.ldl.diet.jampolis/index.html", "passage_text": "LDL (low-density lipoprotein) or bad cholesterol: Elevated LDL cholesterol is highly associated with heart disease. Lowering levels to less than 100 mg/dL (less than 70 mg/dL if you are at very high risk of a heart attack or sudden cardiac death) is very important for reducing your risk of heart attack and stroke. HDL (high-density lipoprotein) or good cholesterol: HDL cholesterol is important for transporting less-healthy cholesterol away from the heart, thereby preventing the buildup of unhealthy cholesterol in your coronary arteries. Low levels increase your risk of heart diseas"}, {"url": "https://www.sharecare.com/health/high-cholesterol/health-guide/heart-health-improve-cholesterol/cholesterol-diet-for-cholesterol", "passage_text": "The Mediterranean diet also includes a wide variety of other cholesterol-improving foods, such as fruits, vegetables, whole grains, legumes, and fish. Try a Little TLC. The TLC (Therapeutic Lifestyle Changes) Diet, created by the National Institutes of Health, is similar to the Mediterranean diet in many ways. Choose an overall heart-smart diet and you'll see those numbers improve. If you've been diagnosed with high cholesterol, your doctor has probably told you to change your diet in order to bring your numbers down. Fortunately, there are several options when it comes to a cholesterol-smart diet"}, {"url": "http://www.mayoclinic.org/diseases-conditions/high-blood-cholesterol/in-depth/reduce-cholesterol/art-20045935", "passage_text": "Trans fats affect cholesterol levels by increasing the bad cholesterol and lowering the good cholesterol. This bad combination increases the risk of heart attacks. Trans fats can be found in fried foods and many commercial products, such as cookies, crackers and snack cakes. Top 5 lifestyle changes to improve your cholesterol. Lifestyle changes can help reduce cholesterol, keep you off cholesterol-lowering medications or enhance the effect of your medications. Here are five lifestyle changes to get you started. High cholesterol increases your risk of heart disease and heart attack"}]