[{"url": "https://en.wikipedia.org/wiki/Fashion_Island", "passage_text": "On January 29, 2008, Nordstrom announced that it had signed a letter of intent to open a 138,000 sq ft (12,800 m 2) store in 2010 in the former Macy's Women's Store location. On April 16, 2010 Nordstrom Fashion Island officially opened. The Federated-May merger in 2006, greatly affected Fashion Island, resulting in the closure and demolition of the 80,000 square feet (7,400 m 2) Macy's Women's Store and conversion of the former Robinsons-May into a full-line Macy's store."}, {"url": "https://en.wikipedia.org/wiki/Fashion_Island", "passage_text": "Fashion Island is an upscale open-air lifestyle center in Newport Beach, California. It is served by Orange County Transportation Authority bus routes 1, 55, 57, 76, and 79. Fashion Island is owned by The Irvine Company. The Federated-May merger in 2006, greatly affected Fashion Island, resulting in the closure and demolition of the 80,000 square feet (7,400 m 2) Macy's Women's Store and conversion of the former Robinsons-May into a full-line Macy's store."}, {"url": "http://www.apple.com/retail/fashionisland/", "passage_text": "How to get here: The Apple Store is located in the Fashion Island mall, at 401 Newport Center Drive in Newport Beach, CA. Traveling on Highway 1, turn north onto Newport Center Drive and head into Fashion Island. The Apple Store is above street level, between Forever 21 and Nordstrom. Closest parking for the Apple Store is in front of Forever 21."}, {"url": "https://www.facebook.com/FashionIsland", "passage_text": "Fashion Island is sending love and support to the individuals participating in the Susan G. Komen Race for the Cure going on right around the corner today! Thank you for inspiring us and making a difference in the fight against breast cancer. Fashion Island. September 24 at 4:30pm ·. Visit Aerosoles now through 9/28 and receive 30% off a new pair of shoes if you bring in an older, lightly worn pair as part of their Soles4Souls charity initiative!"}, {"url": "http://www.visitnewportbeach.com/vacations/fashion-island/", "passage_text": "Fashion Island. With an open-air elegance that fuses Italian style with California cool, Fashion Island boasts chic luxury boutiques, cafes cafés and restaurants on lushly landscaped piazzas accented by fountains and palm. trees Whether you lose yourself in a cappuccino by the Koi pond, or you prefer a hip new concoction by one of the mixologists serving up inspired cocktails, there are refreshing rest stops to soothe your soles from the non-stop shopping at Fashion Island in Newport Beach."}, {"url": "http://www.shopfashionisland.com/", "passage_text": "THE PREFERRED GIFT CARD. The Preferred Gift Card is honored by over 400 merchants, wherever American Express Cards are accepted at Fashion Island, Irvine Spectrum Center and The Market Place. "}, {"url": "https://en.wikipedia.org/wiki/Fashion_Island_(Thailand)", "passage_text": "Fashion Island is a shopping mall located on Ramintra Road, in Khan Na Yao district outskirt of Bangkok, Thailand. Some of the anchors are. 1  Robinson Department Store. 2  Big C. 3  Major Cineplex. Opposite the shopping mall there is a closed down amusement park with a monorail and other rides. The monorail is 1.4 km in length and has 4 stations. The amusement park and monorail were both shut down after an accident. On 26 June 2002, a short circuit caused one train to catch fire."}, {"url": "http://www.stockteam.com/newport5.html", "passage_text": "Preferred seating is available at $20.00 and may be purchased through the Concierge at (949) 721-2000. Fashion Island’s concert series first debuted in 1967. To purchase tickets or for more information, call the Fashion Island concierge at (949) 721-2000 Below is a list of stores at Fashion Island. The list is subject to change without notice. Today, this metropolitan indoor/outdoor shopping plaza with promenades, kiosks, an indoor Farmer's Market and dozens of restaurants is both a shopping center and an entertainment venue. We have provided information for your interest but for official Fashion Island news, there is a web site they offer."}, {"url": "http://www.visitnewportbeach.com/shopping-and-malls/fashion-island/", "passage_text": "Located in the heart of Newport Beach, Fashion Island shopping is Southern California’s premier coastal shopping and dining experience. Fashion Island Newport Beach is also home to Orange County’s only Neiman Marcus, as well as Nordstrom, Bloomingdale’s, Bloomingdale’s Home Store, Elie Tahari, Trina Turk, Kate Spade, Jonathan Adler and Juicy Couture, just to name a few. Complimentary Personal Shopping & Styling Services."}]