[{"url": "https://en.wikipedia.org/wiki/Aruba", "passage_text": "To the east of Aruba are Bonaire and Curacao, curaçao two island territories which once formed the southwest part of The Netherlands. Antilles this group of islands is sometimes called THE abc. Islands they are located on The South american continental shelf and therefore geographically listed as part Of South. america [aːˈrubaː]) is an island country in the southern Caribbean Sea, located about 1,600 kilometres (990 mi) west of the Lesser Antilles and 29 kilometres (18 mi) north of the coast of Venezuela."}, {"url": "http://www.experts123.com/q/what-continent-is-aruba-on.html", "passage_text": "1 Answer. 0. Continent-wise, Central America is generally considered to be part of North America. Aruba, while just off the coast of South America, is one of the many Caribbean islands and part of Central/North America. "}, {"url": "http://www.gomapper.com/travel/where-is/aruba-0-located.html", "passage_text": "Aruba is a country with a very small population which is located in the continent/region of South America. Countries near Aruba include Netherlands Antilles, Dominican Republic, Haiti and Venezuela. Its biggest cities and towns include Oranjestad, Balashi, Babijn and Barcelona. "}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20070807150719AASGEQm", "passage_text": "All different entities. The caribbean is on no continent. Central America is not a continent. There are seven continents, North America (USA and Canada), South America, Africa, Asia, Europe, Antartica and Australia. All of the Caribbean belongs to the North American continent. Central America is NOT a continent. There are 7 continents. 1. Africa 2. Asia 3. Antarctica 4. Australia 5. North America 6. South America 7. Europe"}, {"url": "http://www.answers.com/Q/What_is_Aruba's_continent", "passage_text": "North America is the continent to which Aruba belongs. Aruba's considered part of the North American continent even though the tiny island is closer to the South American continent than to the North American continent. Aruba's only about 17 miles [27 kilometers; 14.7 nautical miles] from the northernmost point of mainland Venezuela. 1 It's a continent that many, especially in the western world, never visit in their lifet…. 2  Occidental Grand Aruba Resort Aruba is a honeymooner's paradise. 3  The Island's atmosphere exudes romance, which is why thousands of visitors visit this southern Caribbean island every year."}, {"url": "http://www.answers.com/Q/What_continent_is_Aruba_from", "passage_text": "Aruba is a small carribbean island. It's only a few miles away from Venezeula which is in the continent of South America, however Aruba is in North America. "}, {"url": "http://www.worldatlas.com/na/aw/where-is-aruba.html", "passage_text": "Located in the continent of the Caribbean, Aruba covers 180 square kilometers of land, making it the 222nd largest nation in terms of land area. Aruba is a dependant territory of The Netherlands. The population of Aruba is 107,635 (2012) and the nation has a density of 598 people per square kilometer. "}, {"url": "http://www.enotes.com/homework-help/what-continent-curacao-2046", "passage_text": "Posted on. (Answer #4). Curacao is part of the ABC (Aruba, Bonaire and Curacao) islands off the coast of Venezuela which is in South America. It is not on a continent but part of the Netherlands Antilles, a group of islands. The setting beginning is Curacao but the island Aruba plays a part. "}, {"url": "http://www.welcomearuba.com/where-is-aruba-located.html", "passage_text": "Aruba is located in the southern part of the Caribbean along of the Venezuela coast. It is a few miles north of Venezuela and belongs to what is known the Dutch Caribbean Island which also includes Bonaire and Curacao. To see Where is Aruba Located click this link: Aruba Located. Map of the Caribbean. Oranjestad is the capital and where the port and the international airport and the main airport are. It is where most of the businesses are located. Aruba is only has almost 100,000 residents and over the year over a million people visit this tiny island in"}]