[{"url": "http://activities.costhelper.com/piano-tuning.html", "passage_text": "1 The cost to repair or replace broken strings can vary depending on the type of string, with prices ranging from $20 to $98. 2  Pianos that have not been serviced or played in many years may need more than one tuning, according to Piano Finders. 1 Some tuners charge a flat fee for routine tunings of pianos in average to good condition. 2  Additional fees may be charged for pianos that are in poor condition or have not been serviced for many years."}, {"url": "http://www.howmuchisit.org/piano-tuning-cost/", "passage_text": "1 On average, the cost of piano tuning can be anywhere from $50 to as much as $200 for the complete tuning package. 2  The main factor that can influence this price is based on when the piano was last tuned. "}, {"url": "http://activities.costhelper.com/piano-tuning.html", "passage_text": "1 Basic tuning sometimes does not include services such as fixing squeaky pedals. 2  The cost to repair or replace broken strings can vary depending on the type of string, with prices ranging from $20 to $98. 3  Pianos that have not been serviced or played in many years may need more than one tuning, according to Piano Finders. 1 Some tuners charge a flat fee for routine tunings of pianos in average to good condition. 2  Additional fees may be charged for pianos that are in poor condition or have not been serviced for many years."}, {"url": "http://kansascitypianotuning.com/tuner/piano-tuning-price-cost/", "passage_text": "Price for basic Piano tuning. A basic piano tuning fee is $125. If the pitch of the piano is low to the point it needs extra work, pitch changes are $65. Customers with pianos that have not been tuned recently should expect a piano tuning fee between $125 and $190."}, {"url": "http://www.pyrseas.org/what-is-the-average-cost-of-piano-tuning/", "passage_text": "Most tunings will take around 1 hour to one-and-a-half. Average cost in the U.S. is about $100 per hour. As with every specialty field however, there are individuals who stand out. For a very experienced tuner with a sterling reputation, $150 to even $200 an hour is not unheard of. Generally though, technicians that skilled are only called on when someone has a very expensive instrument such as a Nord Stage 2 SW73 or large Grand Piano."}, {"url": "http://www.brownpianotuning.com/faq.htm", "passage_text": "To tune the piano to concert pitch: The standard fee alone applies to most well maintained pianos. Add $45 to a standard tuning fee for pianos that are up to 1/4 tone flat/sharp. This can be done in one visit. Double the standard tuning fee for pianos that are between 1/4 and 2/3 tone flat (2 visits). Pianos that are more than 2/3 tone flat may require additional pitch raisings at $45 each. If you have a tuning device, like a guitar tuner, you may be able to test the piano’s pitch yourself."}, {"url": "http://www.pianofinders.com/faqs/servicefaq.htm", "passage_text": "2. Tuning prices vary widely according to cost of living in the geographical area, the experience the tuner has, and how much in demand they are. A recent survey of tuning prices across the country indicated a range of from $50. to over $200. The average currently seems to run from around $75 to 125. "}, {"url": "http://www.steinwaypianos.com/kb/shopping/faq", "passage_text": "A piano can cost anywhere from $3,000 to more than $100,000, depending on the brand, size and the age of the piano. A quality digital piano starts around $2,000. Upright pianos start around $3,000 and grand pianos start around $5,000 for quality used pianos. New piano price ranges are slightly higher. "}, {"url": "http://www.primepianoservices.com/Tuning", "passage_text": "How much does it cost to tune a piano? –. When Russell makes a tuning call visit, he may need to tune your piano 1 time, 2 times or 3 times during that SAME visit depending upon the condition of the piano. Your tuning cost may be $99.00, or $124.00, or $159.00 for that day's tuning service. "}, {"url": "https://answers.yahoo.com/question/index?qid=20070915102434AA073lZ", "passage_text": "Where I live, standard tuning is $90.00, give or take. In LA, I have heard that $150.00 is the going rate. Also, a piano that is badly out of tune (hasn't been tuned for at least 5 years) will cost more to tune because it needs what's known as a pitch raise. "}]