[{"url": "http://itsawonderfulmovie.blogspot.com/2011/03/princess-for-christmas-hallmark-channel.html", "passage_text": "Florin Busuioc ... Duke of Belmont. At the invitation of an estranged relative (her grandfather) , a young woman travels with her niece and nephew to a castle in Europe for Christmas, where she unwittingly falls for a dashing Prince."}, {"url": "http://www.hallmarkchannel.com/a-princess-for-christmas", "passage_text": "Meet the Cast Get cast details, including Katie McGrath & Sir Roger Moore. Find out more about the cast of the Hallmark Channel Original Movie A Princess for Christmas, starr"}, {"url": "http://www.imdb.com/title/tt1083448/", "passage_text": "Ratings: 6.5 /10 from 3,193 users. Reviews: 24 user | 6 critic. At the invitation of an estranged relative, a young woman travels with her niece and nephew to a castle in Europe for Christmas where she unwittingly falls for a dashing Prince."}, {"url": "http://www.youtube.com/watch?v=UeqkKQv5SiY", "passage_text": "Network: Hallmark Channel. Storyline: After her sister and brother-in-law's tragic death, an American woman who is the guardian for her young niece and nephew is invited to a royal European castle for Christmas by her late brother-in-law's father, the Duke of Castlebury."}, {"url": "http://www.hulu.com/watch/558513", "passage_text": "A Princess For Christmas (2011). At the invitation of an estranged relative, a young woman travels with her niece and nephew to a castle in Europe for Christmas where she unwittingly falls for a dashing Prince. Movie | Aired: 12/22/2011 | Not Rated | 1 hr. 30 min."}, {"url": "http://shop.hallmark.com/gifts/movies/hallmark-channel/a-princess-for-christmas-hallmark-channel-dvd-31398159827.html", "passage_text": "Product Actions. 1  Christmas is right around the corner and Jules Daly (Kate McGrath) is doing her best to create a loving home as new guardian to her mischievous niece and nephew."}, {"url": "https://en.wikipedia.org/wiki/A_Royal_Christmas", "passage_text": "A Royal Christmas is an original Hallmark Channel movie and first aired on the Hallmark Channel on November 21, 2014."}]