[{"url": "http://healthcareers.about.com/od/physiciancareers/p/anesthesiologist.htm", "passage_text": "The average number of annual surgery cases for anesthesiologists is about 915 per year, according to the MGMA. Before You Become An Anesthesiologist: Anesthesiologists are well-paid, but that comes with a toll on one's personal life."}, {"url": "http://learn.org/articles/Anesthesiology_Become_an_Anesthesiologist_in_5_Steps.html", "passage_text": "If you wish to become an anesthesiologist, you must earn a bachelor's degree that is considered a pre-medicine track. Pre-med programs are heavy in biology, chemistry, physics and math courses."}, {"url": "http://learningpath.org/articles/Anesthesiologist_Career_Info.html", "passage_text": "An anesthesiologist is a medical doctor, so you will need to have a strong aptitude for math and science if you want to become one. You will have to be a pre-medical undergraduate student, and a significant portion of your college courses will be in biology, chemistry, physics and advanced mathematics."}, {"url": "http://study.com/articles/How_to_Become_an_Anesthesiologist_Education_and_Career_Roadmap.html", "passage_text": "The American Board of Anesthesiology (ABA) and the American Board of Physician Specialties (ABPS) offer opportunities for anesthesiologists to become board certified. Upon successful completion of this exam, an anesthesiologist can use the title of 'Board Certified Anesthesiologist'."}, {"url": "http://learn.org/articles/Anesthesiology_Become_an_Anesthesiologist_in_5_Steps.html", "passage_text": "Anesthesiologists are physicians who specialize in relieving pain and putting patients to sleep for surgical procedures. As an anesthesiologist, you'll be responsible for monitoring and maintaining a patient's vitals during surgery."}, {"url": "http://healthcareers.about.com/od/physiciancareers/p/anesthesiologist.htm", "passage_text": "Also Needed To Become An Anesthesiologist: Like all physicians, anesthesiologists must also do the following: 1  Pass the USMLE. 2  Obtain a state medical license in the state where you wish to practice. 3  Obtain Board Certification in Anesthesiology (Required by most employers). 4  Maintain a clean record."}, {"url": "http://www.howtobecome.com/how-to-become-an-anesthesiologist", "passage_text": "Counting four years of undergraduate study, four years of medical school, and four years of residency, it takes twelve years to become an anesthesiologist. Some medical students enroll in combined six-year undergraduate and medical school programs, which can reduce the time needed to begin a career."}, {"url": "http://healthcareers.about.com/od/physiciancareers/p/anesthesiologist.htm", "passage_text": "How to Become an Anesthesiologist: Because an anesthesiologist is a medical doctor, they must complete all of the education and training required of all physicians: 1  Undergraduate Degree-About 4 years of college."}]