[{"url": "http://www.thinkbabynames.com/meaning/0/Theresa", "passage_text": "Theresa. Theresa /the-re-sa/ [3 sylls.] as a girls' name is pronounced the-REE-sah, ter-REE-sah. It is of Greek origin, and the meaning of Theresa is late summer. Possibly a Greek place name: the first bearers of this name might have been from the Greek island of Therasia. Name of two popular Catholic saints"}, {"url": "http://www.ohbabynames.com/meaning/name/teresa/840", "passage_text": "Etymology & Historical Origin-Teresa. Teresa is the Spanish, Portuguese and Italian form of Theresa, a name of uncertain etymology. It is thought to come from the Greek “therizein” meaning “to harvest, harvester” or from the Greek “theros” meaning “summer”. Therasia is also the name of a Greek island. "}, {"url": "http://www.ohbabynames.com/meaning/name/theresa/1133", "passage_text": "Etymology & Historical Origin-Theresa. Theresa’s etymology is somewhat uncertain. It is thought to come from the Greek “therizein” meaning “to harvest, harvester” or from the Greek “theros” meaning “summer”. Therasia is also the name of a Greek island. Usage of Theresa as a female given name originated out of Spain and Portugal where it remained largely confined until the Middle Ages."}, {"url": "https://en.wikipedia.org/wiki/Teresa", "passage_text": "Teresa, Theresa, and Therese (French: Therese) thérèse are feminine given. Names the name may be derived from The greek verb (θερίζω), therizō therízō meaning. to harvest Spelled Teresa, it was the 580th most popular name for girls born in 2008, down from 206th in 1992 (it ranked 81st in 1950, and 220th in 1900)."}, {"url": "http://www.sheknows.com/baby-names/name/theresa", "passage_text": "Greek Meaning: The name Theresa is a Greek baby name. In Greek the meaning of the name Theresa is: Reaper; from Therasia. American Meaning: The name Theresa is an American baby name. In American the meaning of the name Theresa is: Reaper; from Therasia."}, {"url": "http://www.babynamewizard.com/baby-name/girl/theresa", "passage_text": "Origin of the name Theresa: Of uncertain etymology, Teresa is generally believed to be derived from the Greek therizein (to reap, to gather in) and thus takes the definition of “harvester.” The first known bearer of the name was the Spanish wife of St. Paulinus, a 5th century Roman bishop of Nola. Personal experiences with the name Theresa: | Edit. My adopted mother's name was Theresa. I always thought she was one of the most beautiful women I had ever seen. My daughter's name is Andrea and she was my grandparents first great-grandchild."}, {"url": "http://www.thinkbabynames.com/meaning/0/Theresa", "passage_text": "Theresa is a very prominent first name for females (#72 out of 4276, Top 2%) and a slightly less prominent surname for both adults and children (#118954 out of 150436, Top 79%). (2000 U.S. Census). Presented below is the birth name popularity of Theresa for girls. Theresa /the-re-sa/ [3 sylls.] as a girls' name is pronounced the-REE-sah, ter-REE-sah. It is of Greek origin, and the meaning of Theresa is late summer. Possibly a Greek place name: the first bearers of this name might have been from the Greek island of Therasia. Name of two popular Catholic saint"}, {"url": "https://en.wikipedia.org/wiki/Teresa", "passage_text": "Teresa, Theresa, and Therese (French: Therese) thérèse are feminine given. names Spelled Teresa, it was the 580th most popular name for girls born in 2008, down from 206th in 1992 (it ranked 81st in 1950, and 220th in 1900)."}]