[{"url": "http://www.cdc.gov/healthyweight/calories/index.html", "passage_text": "Weight management is all about balance—balancing the number of calories you consume with the number of calories your body uses or burns off.. 1  A calorie is defined as a unit of energy supplied by food. 2  A calorie is a calorie regardless of its source. 1 Whether you're eating carbohydrates, fats, sugars, or proteins, all of them contain calories. 2  Caloric balance is like a scale. 3  To remain in balance and maintain your body weight, the calories consumed (from foods) must be balanced by the calories used (in normal body functions, daily activities, and exercise)."}, {"url": "http://seplessons.ucsf.edu/node/349", "passage_text": "The number of calories in a food is a measure of how much potential energy that food has. See weblink What does 200 calories look like to see examples of high and low calorie foods. We will be using a homemade calorimeter in this lesson. • fat - 9 calories. That means if you know how many grams of each one are in a food, you can calculate the total calories. You would multiply the number of grams by the number of calories in a gram of that food component."}, {"url": "http://recipes.howstuffworks.com/question670.htm", "passage_text": "The number of calories in a food is a measure of how much potential energy that food possesses. A gram of carbohydrates has 4 calories, a gram of protein has 4 calories and a gram of fat has 9 calories. Foods are a compilation of these three building blocks. So if you know how many carbohydrates, fats and proteins are in any given food, you know how many calories, or how much energy, that food contains. For example, a gallon (about 4 liters) of gasoline contains about 31,000,000 calories. You could drive a car 22 miles (35 km) on the calories in 217 Big Macs. Specifically, a calorie is the amount of energy, or heat, it takes to raise the temperature of 1 gram of water by 1 degree Celsius (1.8 degrees Fahrenheit)."}, {"url": "http://seplessons.ucsf.edu/node/349", "passage_text": "• carbohydrate - 4 calories. • protein - 4 calories. • fat - 9 calories. That means if you know how many grams of each one are in a food, you can calculate the total calories. You would multiply the number of grams by the number of calories in a gram of that food component. For example, if a serving of potato chips (about 20 chips) has 10 grams of fat, 90 calories are from fat. That's 10 grams X 9 calories per gram. Some people watch their calories if they are trying to lose weight"}, {"url": "http://www.pbs.org/wgbh/nova/body/is-a-calorie-a-calorie.html", "passage_text": "Atwater values. The first to accurately measure the number of usable calories in foods was the USDA scientist Wilbur Atwater and his contemporaries over a century ago. Their measurements formed the basis of today's Atwater values: four calories per gram for proteins and carbohydrates, and nine for fats. Technically speaking, one kilocalorie—thus one food calorie in that chocolate or orange—is the amount of energy needed to raise 1 kilogram of water from 15°C to 16°C. (From here on, when we use the term calorie we mean food calorie.)."}, {"url": "http://www.nhs.uk/Livewell/Goodfood/Pages/What-does-100-calories-look-like.aspx", "passage_text": "Calories are a well-known measure of the amount of energy in food. Keeping track of the number of calories in our food helps us to balance the energy we put into our bodies with the energy we use every day, leading to a healthy weight. Go straight to 100-calorie portions of: 1  oil, mayonnaise and butter. 2  cheese. 3  sugar. "}, {"url": "http://www.thenumberofcalories.com/", "passage_text": "Although this a very understandable thing to do, the number of calories in foods doesn’t tell you anything about their nutritional value. Many foods that are high in calorie count are actually better for consumers than another food of the same weight that has fewer calories. (more…). "}, {"url": "http://recipes.howstuffworks.com/question670.htm", "passage_text": "A calorie is a unit of energy. We tend to associate calories with food, but they apply to anything containing energy. For example, a gallon (about 4 liters) of gasoline contains about 31,000,000 calories. You could drive a car 22 miles (35 km) on the calories in 217 Big Macs. Specifically, a calorie is the amount of energy, or heat, it takes to raise the temperature of 1 gram of water by 1 degree Celsius (1.8 degrees Fahrenheit)."}, {"url": "http://www.acaloriecalculator.com/calories-in-food/", "passage_text": "beef-burger). There are over 7000 foods in the food database, so a good match to what you are looking for can typically be found. It is useful during a weight loss process to keep track of your calorie intake and maintain a basic calorie deficit in your diet and exercise routine. "}, {"url": "http://www.scientificamerican.com/article/how-do-food-manufacturers/", "passage_text": "In order to answer this question, it helps to define a calorie. A calorie is a unit that is used to measure energy. The Calorie you see on a food package is actually a kilocalorie, or 1,000 calories. A Calorie (kcal) is the amount of energy needed to raise the temperature of 1 kilogram of water 1 degree Celsius. Sometimes the energy content of food is expressed in kilojoules (kj), a metric unit. One kcal equals 4.184 kj. So the Calorie on a food package is 1,000 times larger than the calorie used in chemistry and physics."}]