[{"url": "http://www.healthline.com/health/diverticulitis", "passage_text": "Diverticula are bulging sacs that can appear in the lining of your large intestine. Diverticulitis occurs when these sacs get acutely infected or inflamed. Although diverticula are most common in the large intestine (colon), they can develop anywhere in your digestive tract. Pain in the lower left side of your abdomen may indicate diverticulitis, especially when it’s accompanied by rectal bleeding. The condition is treatable, but it can recur."}, {"url": "http://www.medicinenet.com/diverticulosis/article.htm", "passage_text": "1 Treatment of diverticulosis can include high fiber diet, and anti-spasmodic drugs. 2  When diverticulosis is associated with inflammation and infection the condition is called diverticulitis. 3  Complications of diverticulosis and diverticulitis include rectal bleeding, abdominal infections, and colon obstruction. 1 When diverticulosis is associated with inflammation and infection the condition is called diverticulitis. 2"}, {"url": "http://www.emedicinehealth.com/diverticulosis_and_diverticulitis/article_em.htm", "passage_text": "1 Diverticulosis is a condition that describes small pouches in the wall of the digestive tract that occur when the inner layer of the digestive tract bulges through weak spots in the outer layer. 2  When these diverticula become inflamed, that is called diverticulitis. 1 One of the main causes of diverticulosis is a diet low in fiber. 2  Many people with diverticulosis have no symptoms. 3  When symptoms do occur they can include. 4  pain in the abdomen, 5  bloating, 6  constipation (less often, diarrhea), and. 7  cramping. 8  Diverticulitis is more serious and symptoms"}, {"url": "http://www.webmd.com/digestive-disorders/tc/diverticulosis-topic-overview", "passage_text": "Diverticulosis is a condition that develops when pouches (diverticula) form in the wall of the colon (large intestine). These pouches are usually very small (5 to 10 millimeters) in diameter but can be larger. In diverticulosis, the pouches in the colon wall do not cause symptoms. "}, {"url": "http://www.medicinenet.com/diverticulosis/article.htm", "passage_text": "1 Abdominal pain, constipation, and diarrhea, can occur with diverticulosis, which then may be called diverticular disease. 2  Diverticulosis can be diagnosed with barium X-rays, sigmoidoscopy, colonoscopy, or CT scan. 3  Treatment of diverticulosis can include high fiber diet, and anti-spasmodic drugs. 1 When diverticulosis is associated with inflammation and infection the condition is called diverticulitis. 2  Complications of diverticulosis and diverticulitis include rectal bleeding, abdominal infections, and colon obstruction."}, {"url": "http://www.webmd.com/digestive-disorders/tc/diverticulitis-topic-overview", "passage_text": "Doctors aren't sure what causes diverticulitis. Bacteria grow in the pouches, and this can lead to inflammation or infection. Symptoms of diverticulitis may last from a few hours to a week or more. Symptoms include: 1  Belly pain, usually in the lower left side, that is sometimes worse when you move. 2  This is the most common symptom. 3  Fever and chills. 4  Bloating and gas. 5  Diarrhea or constipation. 6  Nausea and sometimes vomiting"}, {"url": "http://www.mayoclinic.org/diseases-conditions/diverticulitis/basics/definition/CON-20033495", "passage_text": "Diverticula are small, bulging pouches that can form in the lining of your digestive system. They are found most often in the lower part of the large intestine (colon). Diverticula are common, especially after age 40, and seldom cause problems. Sometimes, however, one or more of the pouches become inflamed or infected. That condition is known as diverticulitis (die-vur-tik-yoo-LIE-tis). "}, {"url": "http://www.medicinenet.com/diverticulosis/page3.htm", "passage_text": "When a diverticulum ruptures and infection sets in around the diverticulum, the condition is called diverticulitis. An individual suffering from diverticulitis often has abdominal pain, abdominal tenderness, colonic obstruction and fever. "}, {"url": "http://www.medicalnewstoday.com/articles/152995.php", "passage_text": "When pouches begin to protrude outwards from the colon wall the person has diverticular disease or diverticulosis. When one of these pouches becomes infected and inflamed, that infection is called diverticulitis. People may have lots of protruding pouches and feel fine. 1 One outpouching is a diverticulum; two or more are diverticula. 2  3. Diverticular disease refers to people with diverticulosis who have symptoms. 3  4. Diverticulosis generally refers to cases without symptoms. 4  5. 5  When one of the outpouches (diverticula) becomes infected, it is known as"}, {"url": "https://en.wikipedia.org/wiki/Diverticulitis", "passage_text": "Diverticulitis is a common digestive disease which involves the formation of pouches (diverticula) within the bowel wall. This process is known as diverticulosis, and typically occurs within the large intestine, or colon, although it can occasionally occur in the small intestine as well. "}]