[{"url": "https://www.ourparents.com/hospices", "passage_text": "Hospice care in eldercare is a service that provides end of life care in the comfort of the home or in a hospice setting. This setting may be a nursing home or even a hospital setting. The role of hospice allows the patient to have control and direct their care regarding end of life. It allows an individual to have peace of mind, dignity and comfort on their terms. Hospice services are provided by professionals and volunteers."}, {"url": "https://en.wikipedia.org/wiki/Children%27s_hospice", "passage_text": "A typical children's hospice service offers: 1  Specialist children's palliative care, respite care, emergency, and terminal care (this may be at the hospice or within the child's home). 2  Bereavement counselling and support, typically offered as individual home support, as well as groups and work with brothers or sisters. 1 Specialist children's palliative care, respite care, emergency, and terminal care (this may be at the hospice or within the child's home). 2  Bereavement counselling and support, typically offered as individual home support, as well as groups and work with brothers or sisters. 3  Information, advice and practical assistance."}, {"url": "http://www.hcfmissoula.com/grants", "passage_text": "The Hospice Care Foundation (HCF) is a local nonprofit whose mission is to fund compassionate care activities and educate the community on hospice and palliative care options, while striving to ensure that hospice care options are available to all those in need. Summary: Volunteers play a vital role in palliative, end-of-life and hospice care services. While volunteers often provide supportive services to organizations in regards to administration or fund development activities, they also provide other necessary services."}, {"url": "http://www.aafp.org/afp/1998/0201/p491.html", "passage_text": "Hospice care is being used more frequently to provide skills and services that are not otherwise available in nursing homes. For eligible terminally ill patients, the Medicare Hospice Benefit supplies an interdisciplinary team with skills in pain management, symptom control and bereavement assistance. The hospice nurse visits the patient as needed and is on call, with other hospice nurses, 24 hours a day, seven days a week, for support of the nursing home staff, the terminally ill patient and the patient's family. 2."}, {"url": "http://hospicenyc.org/hospice-care/", "passage_text": "Hospice care at home is available to any person at any age. The criteria for hospice eligibility are established by state and federal regulations and require certification by a licensed physician stating that an individual has a life-limiting illness. MJHS Hospice services are offered in a variety of settings to ensure that patients have access to them when and where they need them. Patients can receive our hospice services in their homes, assisted living communities, nursing homes, hospice residences, or hospitals across Greater New York and Nassau County."}, {"url": "http://www.eldercare.gov/ELDERCARE.NET/Public/Resources/Factsheets/Hospice_Care.aspx", "passage_text": "These programs can assist the family (or other designated caregiver) in making the patient as comfortable as possible, and assistance is available around the clock, seven days a week. Hospice is primarily a concept of care, not a specific place of care. Hospice care usually is provided in the patient’s home. It also can be made available at a special hospice residence. Hospice is a combination of services designed to address not only the physical needs of patients, but also the psychosocial needs of patients, their loved ones. Hospice combines pain control, symptom management and emotional and spiritual support. Seniors and their families participate fully in the health care provided. "}, {"url": "http://www.caringinfo.org/files/public/brochures/HospiceVolunteers.pdf", "passage_text": "•ospice focuses on caring, not curing and, in most cases, care is Hprovided in the patient’s home. •ospice care also is provided in freestanding hospice centers, Hhospitals, nursing homes and other long-term care facilities. •ospice services are available to patients of any age, religion, Hrace, or illness."}, {"url": "http://www.hcfmissoula.com/grants", "passage_text": "Program/Project Support Grants Summary: The Hospice Care Foundation recognizes that there are many types of palliative care and hospice programs. The Foundation recognizes that there are programs, projects and activities relating to end of life, palliative care and grief. Summary: Volunteers play a vital role in palliative, end-of-life and hospice care services. While volunteers often provide supportive services to organizations in regards to administration or fund development activities, they also provide other necessary services."}, {"url": "http://www.theaftd.org/life-with-ftd/managing-health-care/hospice-end-of-life/what-hospice-offers", "passage_text": "Services Not Available through Hospice. Emergency Medical Care In addition to curative care hospice will not provide emergency medical care not included or contrary to the wishes of the patient as stated in an advance medical directive or similar document. Hospice in other parts of the world, and some private pay hospice plans, may not make this distinction and will provide palliative care along with medications or treatments intended to cure or stop the progression of a terminal illness."}]