[{"url": "https://en.wikipedia.org/wiki/Red_bean_paste", "passage_text": "Red bean paste or adzuki bean paste is a dark red, sweet bean paste. It is used in Japanese confectionery, Chinese cuisine, and Korean cuisine. It is prepared by boiling and mashing adzuki beans and then sweetening the paste with sugar or honey. "}, {"url": "http://healthyeating.sfgate.com/adzuki-bean-good-you-4205.html", "passage_text": "Adzuki beans are usually used dried. Adzuki beans are a relatively sweet red bean which can be used green in the pod, dried or in sprouted form. Dried beans, like adzuki beans, may lower your risk for cancer, diabetes and heart disease. They are a low-fat protein source that is rich in vitamins and minerals"}, {"url": "https://nuts.com/cookingbaking/beans/adzuki/premium.html", "passage_text": "Soak 1/2 cup of beans overnight in ample water. Drain and simmer in 2 cups of water for 40 minutes to an hour. Alternatively, pressure cook the soaked beans in 2 cups of water for 5-9 minutes at high pressure. If you don't have time to soak the beans, pressure cook for 15-20 minutes."}, {"url": "https://en.wikipedia.org/wiki/Azuki_bean", "passage_text": "The adzuki bean (Vigna angularis; from the Japanese アズキ（小豆） (azuki) , sometimes transliterated as azuki or aduki) is an annual vine widely grown throughout East Asia and the Himalayas for its small (approximately 5 mm) bean. The cultivars most familiar in Northeast Asia have a uniform red colour. In English-language discussions of Chinese topics, the term red bean is often used (especially in reference to red bean paste), but in other contexts this usage can cause confusion with other beans that are also red. In normal contexts, red cowpeas  have been used to refer to this bean."}, {"url": "http://www.drweil.com/drw/u/ART03207/Cooking-With-Legumes-Adzuki-Beans.html", "passage_text": "Cooking & Recipes. Cooking With Adzuki Beans. Adzuki beans are small, red beans that originated in China. These legumes (also called aduki or azuki beans) are most often enjoyed boiled with sugar and mashed into a sweet red bean paste that is used as a filling in many popular Asian desserts, including ice cream. Liquid per cup of legume: 4 cups. How to cook adzuki beans: Soak 1-2 hours. Drain water and replace with fresh, cold water for cooking. Place on stove and bring to a boil in a pot with a lid. Once boiling, reduce to a simmer, tilting the lid slightly to allow steam to escape, and leave to cook for up to an hour, or until tender"}, {"url": "http://www.bbcgoodfood.com/glossary/aduki-bean", "passage_text": "Prepare it. Soak beans overnight in water. Drain and simmer in water for an hour. Alternatively, pressure cook the soaked beans in 2 cups of water for 5-9 minutes at high pressure. If you don't have time to soak the beans, pressure cook for 15-20 minutes. Aduki bean. Pronounce it: a-dook-ee beens. The aduki bean is a tiny, reddish-brown bean with a cream coloured seam and sweet, nutty flavour. It is particularly popular in Asian cooking, most often used for sweet dishes including soups, desserts and as a dim sum filling."}, {"url": "http://www.askdrmao.com/natural-health-dictionary/azuki-bean/", "passage_text": "The azuki bean is a small, reddish-brown bean that is rounded in shape with a distinctive white ridge along one side. Sweet tasting, azuki is an annual that grows on a vine and is widely grown throughout East Asia. Evidence suggests that the azuki bean was first domesticated in the Himalayas. High in protein and low in fat, azuki beans contain high levels of potassium, fiber, folic acid, as well as B vitamins such as thiamin, niacin, and riboflavin, and minerals such as iron, zinc, and manganese."}, {"url": "https://en.wikipedia.org/wiki/Azuki_bean", "passage_text": "The name adzuki is a transliteration of the native Japanese name. Japanese also has a Chinese loanword, shōzu (小豆) , which means small bean, its counterpart large bean (大豆, daizu) being the soybean. It is common to write 小豆 in kanji but pronounce it as azuki listen (help·info) , an example of ateji. In English-language discussions of Chinese topics, the term red bean is often used (especially in reference to red bean paste), but in other contexts this usage can cause confusion with other beans that are also red. In normal contexts, red cowpeas  have been used to refer to this bean."}, {"url": "http://www.drweil.com/drw/u/ART03207/Cooking-With-Legumes-Adzuki-Beans.html", "passage_text": "| Bookmark This Page. Cooking With Adzuki Beans. Adzuki beans are small, red beans that originated in China. These legumes (also called aduki or azuki beans) are most often enjoyed boiled with sugar and mashed into a sweet red bean paste that is used as a filling in many popular Asian desserts, including ice cream. Liquid per cup of legume: 4 cups. How to cook adzuki beans: Soak 1-2 hours. Drain water and replace with fresh, cold water for cooking. Place on stove and bring to a boil in a pot with a lid. Once boiling, reduce to a simmer, tilting the lid slightly to allow steam to escape, and leave to cook for up to an hour, or until tender"}]