[{"url": "http://www.webmd.com/a-to-z-guides/aldosterone", "passage_text": "1 Measure the amount of aldosterone released into the body by the adrenal glands. 2  Check for a tumor in the adrenal glands. 3  Find the cause of high blood pressure or low blood potassium levels."}, {"url": "http://www.medical-institution.com/renin-angiotensin-aldosterone-system/", "passage_text": "1 In the adrenal cortex, it acts to cause the release of aldosterone. 2  Aldosterone acts on the tubules (e.g., the distal convoluted tubules and the cortical collecting ducts) in the kidneys, causing them to reabsorb more sodium and water from the urine."}, {"url": "http://mcatquestionoftheday.com/biology/aldosterone-release/", "passage_text": "Loading ... Correct Answer: D. The amount of salt reabsorbed in the kidneys will increase. Aldosterone is a hormone released from the adrenal gland. Its presence in the blood helps the kidney’s retain more sodium chloride (NaCl) in the nephrons, thereby desalinating the urine."}, {"url": "http://www.webmd.com/a-to-z-guides/aldosterone", "passage_text": "An aldosterone test measures the level of aldosterone (a hormone made by the adrenal glands), in the blood. Aldosterone helps regulate sodium and potassium levels in the body."}, {"url": "http://cvphysiology.com/Blood%20Pressure/BP015.htm", "passage_text": "Renin, which is primarily released by the kidneys, stimulates the formation of angiotensin in blood and tissues, which in turn stimulates the release of aldosterone from the adrenal cortex. Renin is a proteolytic enzyme that is released into the circulation primarily by the kidneys."}, {"url": "https://www.nlm.nih.gov/medlineplus/ency/article/003704.htm", "passage_text": "Aldosterone is a hormone released by the adrenal glands. It helps the body regulate blood pressure. Aldosterone increases the reabsorption of sodium and water and the release of potassium in the kidneys. This action raises"}, {"url": "http://www.webmd.com/a-to-z-guides/aldosterone", "passage_text": "Why It Is Done. An aldosterone test is done to: 1  Measure the amount of aldosterone released into the body by the adrenal glands. 2  Check for a tumor in the adrenal glands. 3  Find the cause of high blood pressure or low blood potassium levels."}, {"url": "http://www.differencebetween.com/difference-between-aldosterone-and-vs-antidiuretic-hormone-adh/", "passage_text": "• Aldosterone is produced in the cortex of the adrenal gland, whereas ADH is secreted by the hypothalamus. • Aldosterone is the main regulator of water and electrolytes such as Sodium and Potassium in the body, but ADH is released when water level of the blood stream is lower."}, {"url": "https://labtestsonline.org/understanding/analytes/aldosterone/tab/sample", "passage_text": "Renin is produced by the kidneys and controls the activation of the hormone angiotensin, which stimulates the adrenal glands to produce aldosterone. The kidneys release renin when there is a drop in blood pressure or a decrease in sodium chloride concentration in the tubules in the kidney."}]