[{"url": "https://sophirom.wordpress.com/2009/08/11/dragon-fish%E2%80%99s-habitat-were-build-hydro-dam/", "passage_text": "In Cambodia, dragon fish is one of endanger animals, because it was a kind of fish species that most of the people, especially the legend of Chinese. It was catch by the local people to market, but last recent years it has been preserved by Conservation International."}, {"url": "http://animalstime.com/leafy-sea-dragon-facts-leafy-sea-dragon-diet-habitat/", "passage_text": "Learn some of the most useful leafy sea dragon facts such as sea dragons diet, habitat, and reproduction. The leafy sea dragon (Phycodurus eques) is a marine fish that belongs to the family of Syngnathidae. It is the lone member of genus Phycodurus. Seahorses also come under the same family."}, {"url": "http://a-z-animals.com/animals/sea-dragon/", "passage_text": "The sea dragon is a small, delicate fish found in the tropical coastal waters of south and west Australia. Sea dragons look similar to and are in fact closely related to sea horses. There are two different species of sea dragon which are the leafy sea dragon and the weedy sea dragon."}, {"url": "https://sophirom.wordpress.com/2009/08/11/dragon-fish%E2%80%99s-habitat-were-build-hydro-dam/", "passage_text": "Dragon Fish’s Habitat were Build Hydro dam. Dragon fish is one of the fish species that habitat in the cardamom mountain in Cambodia. The habitat of the dragon fish, one of the world’s endanger species that it has been found in Cardamom Mountains has been proposed by the government of Cambodia to build the hydro dam."}, {"url": "http://animalstime.com/dragon-fish-facts-dragon-fish-diet-habitat/", "passage_text": "1 The length of the dragon fish measures around 2 – 50 cm (0.8 – 20 inches), with averaging 15 cm. 2  The largest dragon fish measures around 90 cm (35 inches) and is known as Scleropages formosus. 3  These fish are normally found in the deep sea oceanic waters where there is absolute darkness."}, {"url": "http://animalstime.com/dragon-fish-facts-dragon-fish-diet-habitat/", "passage_text": "The dragon fish is known as bottom-dwellers since they inhabit in deep sea water where there is no concept of sunlight. These types of fish are found in the Indian, Pacific, and Atlantic Ocean in Vietnam, Cambodia, Indonesia, Malaysia, Myanmar (Burma), Philippines, and Thailand."}, {"url": "http://animalstime.com/dragon-fish-facts-dragon-fish-diet-habitat/", "passage_text": "The dragon fish is a big-mouth-fish and has a fearsome reputation in the deep sea waters. These fishes that belong to the family of Stomidae, are also known as viperfish. The radiant barbels of dragon fish are employed for tempting their prey in complete darkness. They can grow to a size of about 20 inches."}]