[{"url": "http://m.mlb.com/player/502188/jeff-samardzija", "passage_text": "Chicago White Sox activated RHP Jeff Samardzija. RHP Jeff Samardzija roster status changed by Chicago White Sox. Oakland Athletics traded RHP Jeff Samardzija and RHP Michael Ynoa to Chicago White Sox for RHP Chris Bassitt, C Josh Phegley, 1B Rangel Ravelo and SS Marcus Semien."}, {"url": "http://surnames.meaning-of-names.com/genealogy/samardzija/", "passage_text": "Samardzija at RootsWeb databases. Samardzija in RootsWeb surname mailing lists. Samardzija genealogy mailing list for correspondence and sharing of information pertaining to family histories of the Samardzija surname and its variations. Or check the index of mailing lists for a sound-alike name."}, {"url": "http://m.mlb.com/player/502188/jeff-samardzija", "passage_text": "Chicago Cubs traded RHP Jason Hammel and RHP Jeff Samardzija to Oakland Athletics for SS Addison Russell, CF Billy McKinney, RHP Dan Straily and cash. RHP Jeff Samardzija roster status changed by Chicago White Sox. Oakland Athletics traded RHP Jeff Samardzija and RHP Michael Ynoa to Chicago White Sox for RHP Chris Bassitt, C Josh Phegley, 1B Rangel Ravelo and SS Marcus Semien."}, {"url": "http://espn.go.com/blog/chicago/white-sox/post/_/id/23979/jeff-samardzija-if-i-could-change-it-i-would", "passage_text": "Comment. CHICAGO -- Chicago White Sox pitcher Jeff Samardzija showed remorse for his actions one day after he became entangled in an on-field brawl with the Kansas City Royals. Ventura was ejected along with Samardzija, while Chicago White Sox starter Chris Sale was tossed along with Royals players Lorenzo Cain and Edinson Volquez. Jeff Samardzija (center) expressed regret for his actions in Thursday's brawl against the Royals, as he jumped right into the meat of the fray."}, {"url": "https://en.wikipedia.org/wiki/Jeff_Samardzija", "passage_text": "Jeff's father, Sam Samardzija, was a semi-professional hockey player, and his older brother, Sam Samardzija Jr., Jeff's current representation, was an All State football and baseball player who attended Indiana University and is now a sports agent in Major League Baseball. During the 2011 season Samardzija, statistically had his best season posting an 8-4 record and an ERA of 2.97 In 2012 Jeff was named a pitcher in the Cubs rotation and was solid going 9-13 with a 3.81 ERA and 180 strikeouts."}, {"url": "https://en.wikipedia.org/wiki/Jeff_Samardzija", "passage_text": "Jeffrey Alan Samardzija (/səˈmɑrdʒə/ ; born January 23, 1985), nicknamed The Shark, is an American professional baseball pitcher for the Chicago White Sox of Major League Baseball (MLB). He played college baseball and football for the University of Notre Dame, and was recognized as an All-American wide receiver. During the 2011 season Samardzija, statistically had his best season posting an 8-4 record and an ERA of 2.97 In 2012 Jeff was named a pitcher in the Cubs rotation and was solid going 9-13 with a 3.81 ERA and 180 strikeouts."}, {"url": "http://www.und.com/sports/m-basebl/mtt/samardzija_jeff00.html", "passage_text": "Irish Update From Around Professional Baseball. Former Irish standout Jeff Samardzija had an elite year on the mound for the Cubs and A's. "}, {"url": "https://en.wikipedia.org/wiki/Jeff_Samardzija", "passage_text": "In 2011, Samardzija made the opening day roster as a reliever. During the 2011 season Samardzija, statistically had his best season posting an 8-4 record and an ERA of 2.97 In 2012 Jeff was named a pitcher in the Cubs rotation and was solid going 9-13 with a 3.81 ERA and 180 strikeouts."}, {"url": "http://www.cbssports.com/mlb/players/playerpage/1114753/jeff-samardzija", "passage_text": "White Sox pitcher Jeff Samardzija earns win in Tuesday's start. by RotoWire Staff | RotoWire. Chicago White Sox pitcher Jeff Samardzija improved to 11-13 with a quality start Tuesday against Kansas Jayhawks City, as he allowed two runs on eight hits over seven innings. He struck out three and didn't walk a batter. "}]