[{"url": "https://en.wikipedia.org/wiki/Hepatitis_A", "passage_text": "Hepatitis A (formerly known as infectious hepatitis) is an acute infectious disease of the liver caused by the hepatitis A virus (HAV). Many cases have few or no symptoms, especially in the young. The time between infection and symptoms, in those who develop them, is between two and six weeks. "}, {"url": "http://www.mayoclinic.org/diseases-conditions/hepatitis-a/basics/causes/CON-20022163", "passage_text": "Causes. The hepatitis A virus, which causes the infection, usually is spread when a person ingests even tiny amounts of contaminated fecal matter. The hepatitis A virus infects liver cells and causes inflammation. The inflammation can impair liver function and cause other signs and symptoms of hepatitis A. "}, {"url": "http://www.womenshealth.gov/publications/our-publications/fact-sheet/viral-hepatitis.html", "passage_text": "Some people with viral hepatitis have no signs of the infection. Symptoms, if they do appear, can include: 1  Jaundice (JOHN-duhs), which is when the skin and whites of the eyes turn yellow. 2  Low-grade fever. 3  Headache. 4  Muscle aches. 5  Tiredness. 6  Loss of appetite. 7  Nausea. 8  Vomiting. "}, {"url": "http://www.cdc.gov/hepatitis/abc/index.htm", "passage_text": "Symptoms: Symptoms of hepatitis can include: fever, fatigue, loss of appetite, nausea, vomiting, abdominal pain, dark urine, grey-colored stools, joint pain, and jaundice. Many people with hepatitis do not have symptoms and do not know they are infected. If symptoms occur with an acute infection, they can appear anytime from 2 weeks to 6 months after exposure. Symptoms of chronic viral hepatitis can take decades to develop."}, {"url": "http://hepatitis.emedtv.com/viral-hepatitis/viral-hepatitis-symptoms.html", "passage_text": "In some cases, symptoms of viral hepatitis are not present, and some people are not even aware that anything is wrong until signs of cirrhosis appear. When a person becomes infected with one of the viruses that cause viral hepatitis, the virus begins to multiply within the liver. Within two weeks (or as long as six months, depending on the virus), a person may develop viral hepatitis symptoms."}, {"url": "http://www.medicinenet.com/viral_hepatitis/article.htm", "passage_text": "1 All hepatitis viruses can cause acute hepatitis. 2  Viral hepatitis types B and C can cause chronic hepatitis. 3  Symptoms of acute viral hepatitis include fatigue, flu-like symptoms, dark urine, light-colored stools, fever, and jaundice; however, acute viral hepatitis may occur with minimal symptoms that go unrecognized. The most common hepatitis viruses are types A, B, and C. Reference to the hepatitis viruses often occurs in an abbreviated form (for example, HAV, HBV, HCV represent hepatitis viruses A, B, and C, respectively.) The focus of this article is on these viruses that cause the majority of human viral"}, {"url": "http://www.medicinenet.com/viral_hepatitis/article.htm", "passage_text": "1 Symptoms of acute viral hepatitis include fatigue, flu-like symptoms, dark urine, light-colored stools, fever, and jaundice; however, acute viral hepatitis may occur with minimal symptoms that go unrecognized. 2  Rarely, acute viral hepatitis causes fulminant hepatic failure. The most common hepatitis viruses are types A, B, and C. Reference to the hepatitis viruses often occurs in an abbreviated form (for example, HAV, HBV, HCV represent hepatitis viruses A, B, and C, respectively.) The focus of this article is on these viruses that cause the majority of human viral hepatitis."}, {"url": "http://www.rightdiagnosis.com/v/viral_hepatitis/symptoms.htm", "passage_text": "Symptoms common to most forms of viral hepatitis include flu-like symptoms, fever, headache, nausea, muscle aches and jaundice, a yellowing of the skin and whites of the eyes. Young children often have no symptoms of hepatitis A. The list of signs and symptoms mentioned in various sources for Viral Hepatitis includes the 25 symptoms listed below: 1  No symptoms-in some cases. 2  Mild symptoms-in some cases. 3  Early symptoms: 4  Mild fever. 5  Headache. 6  Muscle aches. 7  Fatigue. 8  Loss of appetite."}, {"url": "http://www.medicinenet.com/viral_hepatitis/article.htm", "passage_text": "1 Viruses that primarily attack the liver are called hepatitis viruses. 2  There are several types of hepatitis viruses including types A, B, C, D, E, and possibly G. Types A, B, and C are the most common. 3  All hepatitis viruses can cause acute hepatitis. 4  Viral hepatitis types B and C can cause chronic hepatitis. The most common hepatitis viruses are types A, B, and C. Reference to the hepatitis viruses often occurs in an abbreviated form (for example, HAV, HBV, HCV represent hepatitis viruses A, B, and C, respectively.) The focus of this article is on these viruses that cause the majority of human viral"}, {"url": "http://www.medicinenet.com/viral_hepatitis/article.htm", "passage_text": "1 Viral hepatitis types B and C can cause chronic hepatitis. 2  Symptoms of acute viral hepatitis include fatigue, flu-like symptoms, dark urine, light-colored stools, fever, and jaundice; however, acute viral hepatitis may occur with minimal symptoms that go unrecognized. The most common hepatitis viruses are types A, B, and C. Reference to the hepatitis viruses often occurs in an abbreviated form (for example, HAV, HBV, HCV represent hepatitis viruses A, B, and C, respectively.) The focus of this article is on these viruses that cause the majority of human viral"}]