[{"url": "http://bonesmart.org/knee/how-successful-is-knee-replacement-surgery/", "passage_text": "Success rates. Success rates and quality of life improvements for knee replacement patients are reliably very high. Nine out of 10 knee replacement patients experience an immediate relief from knee pain, and 95% report they are satisfied with their procedure."}, {"url": "https://www.hss.edu/conditions_advancements-hip-knee-replacement-surgery.asp", "passage_text": "By that time, most patients have been advanced from a cane and can exercise on their own. The success rate for this surgery is high, with greater than 95% of patients experiencing relief from hip pain. The success rate of hip replacements 10 years after surgery is 90- 95% and at 20 years 80-85%. Should an implant wear or loosen, revision to a new hip replacement is possible."}, {"url": "http://www.ehow.com/about_6169424_overall-rate-knee-replacement-surgery_.html", "passage_text": "The success rate of TKR is over 90 percent, and most patients who have the operation experience a dramatic reduction of knee pain and a significant improvement in the ability to perform common activities of daily living, according to the American Academy of Orthopedic Surgeons (AAOS)."}, {"url": "http://bonesmart.org/knee/how-successful-is-knee-replacement-surgery/", "passage_text": "While knee replacement surgery is largely very successful, the success of the procedure is partly due to the rehabilitation period that follows the surgery. For you to expect a good result from knee replacement surgery, you must be an active rehab participant."}, {"url": "http://www.rediscoveryourgo.com/kneereplacementsurgery.aspx", "passage_text": "In fact, the success rate for knee replacements 10 years after surgery is 90-95%. 1. Of course, the decision to have knee replacement surgery should be a cooperative one made by you, your family, your primary care doctor, and your orthopaedic surgeon."}, {"url": "http://reallifetested.co.uk/knee-pain/considering-treatment/success-rates-and-risks", "passage_text": "Success rates and risks of knee replacement surgery. A knee replacement is a complex procedure, so before making the decision to go ahead with it, we feel you should have all the information at hand. So what you can find below is an honest appraisal of the success rates and the risks of getting a knee replacement."}]