[{"url": "http://mcclungmuseum.utk.edu/appalachians-tennessee-river-geologic-history/", "passage_text": "This delta is the product of the collision of Africa with North America that formed the Appalachian Mountains (Fig. 1). This last mountain-building event closed the last remaining ocean (the Theic ocean) separating Africa and North America. "}, {"url": "http://www.wvencyclopedia.org/articles/246", "passage_text": "The Appalachian Orogeny is generally separated into three periods, referred to as the Taconic, Acadian, and Alleghenian orogenies. In West Virginia, the evidence for these three events is limited to the thick sedimentary rock units that were deposited in the basin that formed to the west of the mountains. The Taconic Orogeny is thought to be the result of the collision of a volcanic arc with the east coast of North America. Extensive folding and metamorphism from New England to southeastern Pennsylvania is attributed to this event."}, {"url": "http://www.oberlin.edu/Geopage/projects/204projects/healey_204_project.html", "passage_text": "The Acadian Orogeny was one of three major orogenic phases in the creation of the Appalachian mountain chain. The first of these phases is called the Taconic orogeny and occurred during the middle to late Ordovician period. This phase is generally attributed to the subduction of North America under an island arc. "}, {"url": "http://www.fossilmuseum.net/fossilrecord/Appalachian-Orogeny.htm", "passage_text": "Carbonates and sediments from mountains formed in the Appalachian Orogeny were away to form limey rocks in a shallow sea that was later uplifted and now forms the majority of Tennessee, Kentucky, Indiana and Ohio. The Appalachian Orogeny is an excellent example of a mountain building event resulting from tectonics. The Appalachian Orogeny resulted from three separate continental collisions formed the Appalachian Mountains and Allegheny Mountains at the end of the Paleozoic"}, {"url": "https://en.wikipedia.org/wiki/Appalachian_Mountains", "passage_text": "Because North America and Africa were connected, the Appalachians formed part of the same mountain chain as the Little Atlas in Morocco. This mountain range, known as the Central Pangean Mountains, extended into Scotland, from the North America/Europe collision (See Caledonian orogeny). The Appalachian Mountains (/ˌaepəˈleɪʃɨn/ ˌæpəˈleɪʃɨn /or/ , ˌaepəˈlaetʃɨn: ˌæpəˈlætʃɨn French), les appalaches often Called, the appalachians are a system of mountains In Eastern. north america"}, {"url": "http://www.wvencyclopedia.org/articles/246", "passage_text": "In geological terms, ‘‘orogeny’’ refers to the process of mountain building. The Appalachian Orogeny, previously called the Appalachian Revolution, describes the collective geological events that produced the belt of folded, faulted, and metamorphosed rock that stretches from Newfoundland to northern Alabama. All of West Virginia is included within this belt. The Taconic Orogeny is thought to be the result of the collision of a volcanic arc with the east coast of North America. Extensive folding and metamorphism from New England to southeastern Pennsylvania is attributed to this event."}, {"url": "https://en.wikipedia.org/wiki/Alleghenian_orogeny", "passage_text": "The Alleghanian orogeny or Appalachian orogeny is one of the geological mountain-forming events that formed the Appalachian Mountains and Allegheny Mountains. This collision formed the super-continent Pangaea, which contained all major continental land masses. The collision provoked the orogeny: it exerted massive stress on what is today the Eastern Seaboard of North America, forming a wide and high mountain chain."}, {"url": "https://en.wikipedia.org/wiki/Alleghenian_orogeny", "passage_text": "The Alleghanian orogeny occurred approximately 325 million to 260 million years ago over at least five deformation events in the Carboniferous to Permian period. The orogeny was caused by Africa colliding with North America. This collision formed the super-continent Pangaea, which contained all major continental land masses. The collision provoked the orogeny: it exerted massive stress on what is today the Eastern Seaboard of North America, forming a wide and high mountain chain."}, {"url": "http://www.wvencyclopedia.org/articles/246", "passage_text": "The Taconic Orogeny is named after the Taconic Mountains of New York. The Taconic Orogeny is thought to be the result of the collision of a volcanic arc with the east coast of North America. Extensive folding and metamorphism from New England to southeastern Pennsylvania is attributed to this event."}]