[{"url": "http://www.answers.com/Q/What_capillary_bed_produces_filtrate", "passage_text": "The capillary wall is made up of a single layer of endothelium lying on a delicate basement membrane … . The thin capillary wall enables water and dissolved substances, including oxygen, to diffuse from the blood into the tissue spaces, where they become available for use by the cells."}, {"url": "https://en.wikipedia.org/wiki/Renal_glomerulus", "passage_text": "The rate at which the glomerulus produces filtrate from plasma (the glomerular filtration rate) is much higher than in systemic capillaries because of the particular anatomical characteristics of the glomerulus."}, {"url": "http://www.flashcardmachine.com/anatomy-2-urinary.html", "passage_text": "Glomerulus-Bowman's Capsule-proximal convoluted tubule-loop of henle-distal convoluted tubule-collecting tubule-calcyx-renal pelvis-ureter-bladder-urethra."}, {"url": "http://faculty.etsu.edu/currie/filtreab.htm", "passage_text": "Approximately 178.5 L of the 180 L of filtrate produced every day is reabsorbed (99.2% of filtrate is reabsorbed). Urine output is about 1.5 L per day but can fall to conserve water (400 mL/day) or increase dramatically to rid the body of excess water."}, {"url": "http://www.answers.com/Q/What_capillary_bed_produces_filtrate", "passage_text": "The diameter of the afferent renal arteriole narrows progressively  more and more into the glomerular capillaries, with the same blood  flow, leading to an increase in press … ure within the glomerulus."}, {"url": "http://www.answers.com/Q/What_capillary_bed_produces_filtrate", "passage_text": "The capillary also allows waste from the metabolizing cell to diffuse from the tissue spaces into the capillaries for transport by the blood to the organs of excretion. The capillaries are called exchange vessels because they allow for an exchange of nutrients and waste. 6 people found this useful."}, {"url": "http://www.angelo.edu/faculty/cadkins/renal2.doc", "passage_text": "1. Vascular component: glomerulus capillary bed, afferent (to) and efferent (from) arterioles, and peritubular capillaries (efferent arterioles divide to become these, supply kidneys with O2 and nutrients and are important in exchanges between blood and tubular component during urine formation. 2."}, {"url": "http://www.angelo.edu/faculty/cadkins/renal2.doc", "passage_text": "1. Most of the salt and water filtered from the blood is reabsorbed across the wall of the proximal tubule. 2. The reabsorption of water occurs by osmosis, in which water follows the active extrusion of NaCl from the tubule & into the surrounding peritubular capillaries."}, {"url": "http://www.easynotecards.com/print_list/14376", "passage_text": "Calculate the net filtration pressure if capillary hydrostatic pressure is 60 mm Hg, capillary osmotic pressure is 25 mm Hg, and capsular hydrostatic pressure is 10 mm Hg. Hint 1. Remember that hydrostatic pressure pushes water away and osmotic pressure draws water in."}]