[{"url": "http://www.pcmemoirs.com/2010/07/29/how-to-transfer-favorites-to-another-pc/", "passage_text": "1 Plug in a USB flash drive into the computer that already has the favorites. 2  Open My Computer, then double click on the C: drive, then Documents and Settings folder (in Windows XP) or Users in Vista/Windows 7, and then your user name. 3  Open the Favorites folder. 4  You’ll see the list of all your stored Web sites. Here are the detailed instructions: 1 "}, {"url": "http://www.ehow.com/how_8110876_move-new-computer-usb-drive.html", "passage_text": "Instructions. Plug a USB flash drive into an available USB port on your computer. If an Autorun window pops up, just close it. Open Internet Explorer. Click File in the top menu, and then Import and Export.... If you cannot see the menu bar, press the Alt key. Open Internet Explorer, click File and Import and Export.... Click Import from a file, and click Next.. Check Favorites, and click Next.. Click Browse, and double-click the bookmark.htm file on your USB flash drive."}, {"url": "http://answers.microsoft.com/en-us/ie/forum/ie8-windows_other/how-do-you-transfer-bookmarksfavorites-from-a/09f06186-10f9-49c1-993c-aed89c7e1b78", "passage_text": "Assuming you exported the file via Internet Explorer File | Import and Export | Export Favorites ... Place a copy of bookmarks.htm on the Win7 desktop | Right-click on the file and remove any Read Only attribute the file might have | IE File | Import and Export | Import Favorites | point the wizard to the desktop file. "}, {"url": "http://answers.microsoft.com/en-us/ie/forum/ie8-windows_vista/how-can-i-backup-my-ie8-favorites-to-a-usb-memory/0c896c3e-ca87-4ae1-a73b-86cfd895f7a3", "passage_text": "g) The next time you need to replace the Favorites then you can copy and paste the Favorites back to the “Favorites” folder. Hi PaulKershner, Method 1-. You need to follow the steps mentioned below to back up your favorites on to the Universal Serial Bus (USB) flash drive-. a) Plug the USB flash drive to your computer. b) Go to “ Computer ” and select the “ C drive ”. c) Select “ Users ” and then select your “ User Account ”. d) Now Right Click on the folder that says “ Favorites ” and select “ Send To ”. e) Now select the “ USB flash drive ”. f) The Favorites folder will be copied to USB flash drive. g) The next time you need to replace the Favorites then you can copy and paste the Favorites back to the “ Favorites ” folder. "}, {"url": "http://yourbusiness.azcentral.com/transfer-windows-internet-favorites-folder-one-hard-drive-another-22798.html", "passage_text": "If transferring the bookmark.htm file via email, open your email and download the bookmark.htm to the Documents folder on your second computer's hard drive. Step 8. Click the Favorites button in Internet Explorer and select the Import and Export option. Launch Internet Explorer, click the Favorites button near the top of the Internet Explorer window and select the Import and export option from the drop-down menu. Step 3. Click the Export to a file option in the Import/Export Settings window and click Next.."}, {"url": "http://yourbusiness.azcentral.com/transfer-windows-internet-favorites-folder-one-hard-drive-another-22798.html", "passage_text": "Internet Explorer saves favorite sites to your hard drive's Documents folder as a bookmark.htm text file, so you can easily email the file or save it to an external hard drive to transfer it to your new computer. Step 1. Attach your USB or external hard drive to your computer and turn the power on, if necessary. Step 2. Launch Internet Explorer, click the Favorites button near the top of the Internet Explorer window and select the Import and export option from the drop-down menu. Step 3. Click the Export to a file option in the Import/Export Settings window and click Next.."}, {"url": "https://answers.yahoo.com/question/index?qid=20080525201144AAsi3Pu", "passage_text": "For IE: 1. Within Internet Explorer, click the File menu and Import and Export.... 2. Within the Import and Export window click Next. 3. Click Export Favorites and click Next. 4. Select the folder wish to backup; if you wish to backup all favorites, leave the Favorites folder highlighted and click Next. 5. Select the destination you wish to save the favorites and click Next. 6. Click Finish. Best Answer: Favorites are stored in the C:\\documents and settings\\USERNAME\\favorites folder. They are all shortcuts. You can actually just copy all of the contents of this folder to a floppy or thumb drive and then you can copy them to your home computer using the reverse method."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20100917082231AAbTQU5", "passage_text": "Here's how to do it. Step 1: plug the USB drive to a USB port. Step 2: go to Bookmarks and then click on Organize Bookmarks. The Library menu will pop up on the screen. Step 3: in the Library menu, click on the button that says Import and Backups and then on the Backup Icon. Send you bookmarks to your USB drive once the save menu pop ups. Step 4: unplug the USB drive from the port and you're done."}, {"url": "http://www.ehow.com/how_8110876_move-new-computer-usb-drive.html", "passage_text": "Plug your USB flash drive into your new computer. Open Internet Explorer, click File and Import and Export.... Click Import from a file, and click Next.. Check Favorites, and click Next.. Click Browse, and double-click the bookmark.htm file on your USB flash drive. Click Next.. Click the folder you would like to import. If you wish to import all folders, click the top Favorites fold"}]