[{"url": "http://www.ehow.com/how-does_4579551_do-bail-bondsmen-make-money_.html", "passage_text": "The bail bonds office requires the defendant to pay 10 percent of the bail bond amount at the beginning of the transaction. This is a nonrefundable fee, even if the defendant shows up for trial as scheduled. To ensure that this does not happen, bail bondsmen require a tangible security to be placed with them, such as the title to a valuable car, or they place a lien on a defendant's home. If the bond is forfeit, the bail bonds office seizes the property and sells it to recoup the money paid out via the bond to the court."}, {"url": "https://en.wikipedia.org/wiki/Bail_bondsman", "passage_text": "A bail bondsman or bail bond agent is any person or corporation that will act as a surety and pledge money or property as bail for the appearance of persons accused in court. Bond agents generally charge a fee of 10% for a state charge and 15% for a federal bail bond, with a minimum of $100 in some states like Florida, required in order to post a bond for the full amount of the bond. This fee is not refundable and represents the bond agent's compensation for their services"}, {"url": "https://answers.yahoo.com/question/index?qid=20080908122312AArmCA2", "passage_text": "But basically, lets say you are arrested and your bond is $1000. But you can't come up with $1000. You can contact a bondsman and they will put up the $1000 bond and charge you a set fee (usually 10%, but can be more if you are risk or less if they know you) So you pay the bondsman $100 and he gets you out of jail. The catch is, you never get that $100 back. That is how he makes the money. He will collect a bunch of information on you and make sure you show up to court, so he isn't out the $1000. If you had put up the entire $1000 yourself, that would be returned to you if you appear in court."}, {"url": "http://work.chron.com/much-bail-bondsman-earn-annually-18871.html", "passage_text": "By paying a bond on your behalf, the bail bondsman is guaranteeing that you'll show up in criminal court as directed. However, before your bail bondsman posts your bond, he'll charge you a fee, typically 10 to 20 percent of your bail amount. BailBonds101.com says that experienced bail bondsmen can earn from $50,000 to $150,000 annually. The CareerBliss website lists a number of bail bond companies and salaries of bondsmen within them."}, {"url": "http://www.familybailbonds.com/blog/2011/07/how-does-a-bail-bondsman-and-a-bounty-hunter-make-money/", "passage_text": "Answer: A bail bondsman makes money from the “premium” which is legally mandated in most states at 10% of the total bail amount. That is a fee for providing bail services. Given the defendant goes to court, the bondsman pockets that amount. "}, {"url": "http://www.bailbonds101.com/make-money.asp", "passage_text": "How you ask? As a rule of thumb bail bondsman make money by charging 10% of a persons bail amount. Meaning if a person has a $1,000.00 bail amount a Bondsman would charge $100 and in turn give the jail or court the full amount of $1,000.00 in the form of a bail bond. A bail bond acts like a check deposited with the courthouse. So as long as the defendant shows up for court then the court wont deposit our check. If the Bondsman doesn’t find the defendant then they are out the full $1,000.00. As long as people show up for court when they are supposed to Bondsmen get to keep the full 10%. Essentially this is how to make money in bail bonds. Some Bail Bondsmen make money by chasing people when they skip bail."}, {"url": "http://www.ehow.com/how-does_4579551_do-bail-bondsmen-make-money_.html", "passage_text": "A bail bonds office that judiciously bails out low flight risks that carry high bail amounts can make money simply by taking in the 10 percent fee. For example, if a defendant is required to post $50,000 bail, the bail bondsman will seek a signature release of the individual and take $5,000 as up front payment to do so. If the bail bonds office bails out 10 such defendants in one week, they will have made $50,000. To ensure that this does not happen, bail bondsmen require a tangible security to be placed with them, such as the title to a valuable car, or they place a lien on a defendant's home. If the bond is forfeit, the bail bonds office seizes the property and sells it to recoup the money paid out via the bond to the court."}]