[{"url": "http://www.xe.com/currency/lsl-basotho-loti", "passage_text": "The Basotho Loti is the currency of Lesotho. Our currency rankings show that the most popular Lesotho Loti exchange rate is the USD to LSL rate. The currency code for Maloti is LSL. Below, you'll find Basotho Loti rates and a currency converter"}, {"url": "http://www.nationsencyclopedia.com/economies/Africa/Lesotho-MONEY.html", "passage_text": "Lesotho-Money. The loti is pegged with the South African rand; both currencies are legal tender in Lesotho. Those wanting to exchange maloti for convertible currency (dollars, marks, francs, etc.) usually exchange inside Lesotho, or change for South African rand, which is then convertible worldwide. Lesotho's currency is convertible internationally but is very uncommon outside of Southern Africa. In January 2000, US$1=6.125 maloti, a rate that has remained stable in the last 3 years. There is no domestic exchange rate policy, and there are no controls on regional exchange flows."}, {"url": "https://en.wikipedia.org/wiki/Lesotho_loti", "passage_text": "The loti (plural: maloti) is the currency of the Kingdom of Lesotho. It is subdivided into 100 lisente (sg. sente). It is pegged to the South African rand on a 1:1 basis through the Common Monetary Area, and both are accepted as legal tender within Lesotho. The loti was first issued in 1966, albeit as a non-circulating currency. In 1980, Lesotho issued its first coins denominated in both loti and lisente to replace the South African rand of Lesotho, though the Rand remains legal tender."}, {"url": "https://en.wikipedia.org/wiki/Lesotho", "passage_text": "The official currency is the loti (plural: maloti), but can be used interchangeably with the South African rand. Lesotho, Swaziland, Namibia, and South Africa also form a common currency and exchange control area known as the Common Monetary Area (CMA). Lesotho is a member of the Commonwealth of Nations. The name Lesotho translates roughly into the land of the people who speak Sesotho. About 40% of the population lives below the international poverty line of US $1.25 a day."}, {"url": "http://www.mytravelcost.com/Lesotho/currency/", "passage_text": "The currency used in Lesotho is called: Lesotho Loti with exchange rate of 1 USD = 12.75 Lesotho Loti updated on Tuesday, October 6, 2015. The information is based on data from the Bank of Canada and is updated daily for the major currencies. "}, {"url": "http://www.answers.com/Q/What_is_the_currency_of_Lesotho", "passage_text": "Making the world better, one answer at a time. The official currency is the loti (plural: maloti). They also use the South African 'rand' on a one-to-one exchange rate. What is the currency of Lesotho? already exists. already exists as an alternate of this question. exists and is an alternate of. Middle of Nowhere has won plenty of awards and received praised from all around the industry. Did you know the film would be so well-received when you read the script? Is lesotho poor? What is the nationality for lesotho?"}, {"url": "http://wikitravel.org/en/Lesotho", "passage_text": "Lesotho's currency, the Loti (LSL) (plural Maloti), is fixed at a 1:1 ratio with the South African Rand (ZAR). South African currency is accepted everywhere — there is no need to change money. However you will get Maloti in change (unless you ask) which is very difficult to unload in South Africa. "}, {"url": "http://wwp.greenwichmeantime.com/time-zone/africa/lesotho/currency-lesotho/", "passage_text": "NB Rates provided for information only. The Currency Converter is provided by xe.com. xe.com and its owners shall not be liable to User or any third party for any damage or loss incurred, monetary or otherwise, directly or indirectly, as a result of the use of the xe.com or the xe.com code."}, {"url": "http://coinmill.com/LSL_ZAR.html", "passage_text": "1 comment about Lesotho Maloti and South African Rand conversion. This Lesotho Loti and South African Rand convertor is up to date with exchange rates from October 14, 2015. Enter the amount to be converted in the box to the left of Lesotho Loti. Use Swap currencies to make South African Rand the default currency. The South African Rand is the currency in South Africa (ZA, ZAF). The South African Rand is also known as Rands. The symbol for LSL can be written L, and M. The symbol for ZAR can be written R. The Lesotho Loti is divided into 100 lisente."}, {"url": "https://en.wikipedia.org/wiki/Lesotho", "passage_text": "Lesotho (/lɨˈsuːtuː/ ; li-SOO-too), officially the Kingdom of Lesotho (Sotho : 'Muso oa Lesotho), is an enclaved, landlocked country in southern Africa completely surrounded by South Africa. It is just over 30,000 km 2 (11,583 sq mi) in size and has a population slightly over two million. Lesotho is a member of the Commonwealth of Nations. The name Lesotho translates roughly into the land of the people who speak Sesotho. About 40% of the population lives below the international poverty line of US $1.25 a day."}]