[{"url": "http://home.costhelper.com/pressure-treated-wood-deck.html", "passage_text": "1 A PT wood deck can cost $8-$50 a square foot ($2,560-$16,000 for a 16'x20' deck), but averages about $25-$35 a square foot ($8,000-$11,200 for 16'x20'), depending on the quality of materials, project complexity, and whether construction is by casual labor or a licensed contractor. How much does cost? Typical costs: 1  A PT wood deck can cost $8-$50 a square foot ($2,560-$16,000 for a 16'x20' deck), but averages about $25-$35 a square foot ($8,000-$11,200 for 16'x20'), depending on the quality of materials, project complexity, and whether construction is by casual labor or a licensed contractor."}, {"url": "http://www.hgtv.com/remodel/outdoors/budgeting-for-a-deck", "passage_text": "The more elaborate your deck design and the choice of materials will increase the cost of the deck, so keep those factors in mind. The cost of a professionally built pressured-treated wood deck starts at about $15 per square foot, including materials. The cost for an elaborately built deck using costly hardwoods or composite materials can run about $35 per square foot. "}, {"url": "http://home.costhelper.com/deck.html", "passage_text": "1 Composite deck installation can cost $25-$70 or more a square foot (8,000 -$22,400 for 16'x20). Home Depot Cost of Materials today $1478.98 Lowes Cost of Materials today $1492.56 Local lumber supplier Cost of Materials today $1704.54 that comes out to $11.11 per square foot on an average cost of $1600.00 for materials. if it takes me and my three guys 2 1/2 - 3 days with footings."}, {"url": "http://www.decks.com/how-to/539/budget---determines-deck-size-and-materials", "passage_text": "Most decks material costs range from $10 to $20 per square foot. That means a no frills 350 square foot cedar deck will run about $4,200 for materials or about $7,000 if you plan on using composite materials. If you are experiencing sticker shock right now you have discovered a design limitation in your deck design. "}, {"url": "http://www.improvenet.com/r/costs-and-prices/composite-decking-estimator", "passage_text": "1 For polypropylene-based decking, the average cost is $8.68 per square foot. 2  For solid polyvinyl chloride (PVC)-based decking, the average cost per square foot is $9.48 though buying this material in hollow slats can reduce the cost to around $7.50 per square foot. 1 Average: $35 per square foot. 2  For polythylene-based composite decking, the average cost per square foot is $7.82. 3 "}, {"url": "http://www.bhg.com/home-improvement/deck/building/budgeting-for-a-new-deck/", "passage_text": "Decks are less expensive than most other home additions. And because decks are so popular, they also make homes more marketable and valuable. Here's a look at what they cost. For basic designs using the least expensive lumber, you can expect to pay from about $6 to $8 per square foot of deck area. Even if you choose top-of-the-line redwood lumber or want a hot tub, material costs are still reasonable, anywhere from $20 to $35 per square foot. "}, {"url": "http://www.improvenet.com/r/costs-and-prices/trex-decking", "passage_text": "1 The total project cost for a Trex deck will be from $1,500 to $2,200 for a 250-square-foot deck. 2  Trex Select of basic quality averages approximately $7 per square foot. 3  Trex Enhance of higher quality is approximately $8 per square foot. 4  Trex Transcend, the highest grade, ranges between $9 and $9.50 per square foot. To get an idea of what this means to consumers, an estimated 140,000 plastic bags are in a 500-square foot Trex deck. 1 "}, {"url": "http://home.costhelper.com/deck.html", "passage_text": "1 Wood is the most traditional, common and easily available material for decks; it is typically easier to work with than composite materials. 2  Composite deck installation can cost $25-$70 or more a square foot (8,000 -$22,400 for 16'x20). Home Depot Cost of Materials today $1478.98 Lowes Cost of Materials today $1492.56 Local lumber supplier Cost of Materials today $1704.54 that comes out to $11.11 per square foot on an average cost of $1600.00 for materials. if it takes me and my three guys 2 1/2 - 3 days with footings."}, {"url": "http://www.ehow.com/info_12128455_price-per-square-foot-build-deck.html", "passage_text": "Cost Owl states that building a composite deck, with the same characteristics as a basic wood deck, costs $15,620 or about $48.81 per square foot. Although this price is initially higher than a wood construct, it saves money in the long run in the cost and time required for staining. "}]