[{"url": "http://www.iorgsoft.com/PDF/upload-pdf-to-facebook.html", "passage_text": "Part II: Upload PDF to a Free Hosting Site. The second option we are able to offer is to upload the PDF to a free hosting site like box.net, dropbox.com, fileden.com, sendspace.com, etc and then post the link on your Facebook Page. You'll only have a link to your document, not the actual document itself. "}, {"url": "http://www.investintech.com/resources/blog/archives/2841-3-different-ways-to-post-your-pdf-on-facebook.html", "passage_text": "Posting PDF Files With A Link. The first method involved sharing the PDF document as a link, which was probably the simplest way to post a document within a Note: … We looked into this and, unfortunately, the only things you can embed within a note is an image and a hyperlink. The HTML tags should disappear, leaving you with an active link in your Note: Using a link to post a PDF works with group, fanpage, and personal Walls, as well. The only difference is that you have to post the .pdf link into your Facebook status like you would with any web link you want to share on your Wall."}, {"url": "http://www.ehow.com/how_6155157_can-upload-pdf-file-facebook_.html", "passage_text": "Step 1: Open the PDF file you want to upload to your Facebook account in Adobe Acrobat. Choose Save As from the File menu. Acrobat Pro (Image: Courtesy of Internet Explorer). Step 2: Choose an image type in the Save as Type box, such as JPEG or PNG, and click Save to convert the PDF file to an image. Convert a PDF File to an Image to Upload to Facebook with GIMP. Step 1: Open the PDF file you want to upload to your Facebook account in GIMP. Click Export As in the File menu. Courtesy of GIMP (Image: Courtesy of GIMP). Step 2: Choose an image file type, such as PNG, and name the file."}, {"url": "http://smallbusiness.chron.com/convert-pdf-file-photo-facebook-uploading-51782.html", "passage_text": "If you want to share a PDF such as a quarterly report on Facebook, you can just upload it as a document to a Facebook group. Converting PDFs into photos, however, lets you share them more widely than documents. You can upload them to your page's timeline, to customers' timelines or to your own personal timeline. You can insert them into notes, make them into albums and tag contacts in them. One way to make these images is by using the Windows Snipping Tool, which copies a PDF's content directly from your screen. Step 1. Open the PDF file in a PDF reader and maximize the display window."}, {"url": "http://www.investintech.com/resources/blog/archives/2841-3-different-ways-to-post-your-pdf-on-facebook.html", "passage_text": "I would like to post a pdf (or Word) document to my Facebook page (not my personal page, to my business page). I would like to post it as a “Note” that everyone who has “liked” our business page can access. And I would like those who view the document to be able to print the document. The HTML tags should disappear, leaving you with an active link in your Note: Using a link to post a PDF works with group, fanpage, and personal Walls, as well. The only difference is that you have to post the .pdf link into your Facebook status like you would with any web link you want to share on your Wall."}, {"url": "http://smallbusiness.chron.com/make-pdf-facebook-31312.html", "passage_text": "Select your preferred share setting from the audience selector tool: choose to share the PDF document with the public, your friends lists, or a custom list of selected friends or friends lists. Step 6. Click the blue “Post” button to post the PDF link to Facebook. Step 4. Paste the copied PDF link into the input box and press “Enter.” Facebook detects the URL and displays the link address. Unlike with links to Web pages or blog posts, Facebook does not parse information or thumbnail images from the linked PDF document."}, {"url": "http://wendymoore.net/2011/07/how-to-add-a-pdf-document-to-a-facebook-page/", "passage_text": "A PDF document is a great addition to any Facebook page. You might choose to upload your regular newsletter or a flyer promoting your business or event. You can even share any media coverage such as a magazine page where you and your business may have been featured. The next step is to click the Add a New Document button and then Save Changes. And that’s it! Your PDFs will now show on your Facebook page as an added feature. If you need to edit, just click on the Edit Tab Settings again and click Edit Document."}, {"url": "http://www.ehow.com/how_6155157_can-upload-pdf-file-facebook_.html", "passage_text": "Step 4: Navigate to the PDF file you want to upload to your Facebook group and click Open. Internet Explorer (Image: Courtesy of Internet Explorer). Step 5: Note that the PDF file appears in the post editing box and click Post to publish your post. Internet Explorer (Image: Courtesy of Internet Explorer). Convert a PDF File to an Image to Upload to Facebook with GIMP. Step 1: Open the PDF file you want to upload to your Facebook account in GIMP. Click Export As in the File menu. Courtesy of GIMP (Image: Courtesy of GIMP). Step 2: Choose an image file type, such as PNG, and name the file."}, {"url": "http://wendymoore.net/2011/07/how-to-add-a-pdf-document-to-a-facebook-page/", "passage_text": "Once the Scribd tab has been installed in your Facebook page, you can immediately start uploading PDF documents. To do this, click on the orange Edit Tab Settings button on top of the page. The next step is to click the Add a New Document button and then Save Changes. And that’s it! Your PDFs will now show on your Facebook page as an added feature. If you need to edit, just click on the Edit Tab Settings again and click Edit Document."}]