[{"url": "http://www.ourbabynamer.com/meaning-of-Sky.html", "passage_text": "What does Sky mean, popularity, numerology and more. The name Sky is of American origin. The meaning of Sky is sky. It is also of English origin, where its meaning is simply sky. "}, {"url": "http://www.thinkbabynames.com/names/0/heaven", "passage_text": "Page 1/2 of 37 Heaven names. Akasha 1 .. Derivative of Sanskrit language. Space, sky .. Unusual, but Akasha is comparable to common-ha last name Altaha (top 54%) . See also Akosua. Hindu name from the word meaning .. Amber▲ 2 .. Heaven baby names and what they mean, for heaven, sky, heavenly."}, {"url": "http://www.thenamemeaning.com/sky/", "passage_text": "Sky Name Meaning. The meaning of Sky is “Sky”. Keep in mind that many names may have different meanings in other countries and languages, so be careful that the name that you choose doesn’t mean something bad or unpleasant. If you consider naming your baby Sky we recommend you take note of the special meaning and history of the name as your baby’s name will play a big role in its life and your baby will hear it spoken every day."}, {"url": "http://www.babynamewizard.com/baby-name/girl/sky", "passage_text": "Comments and insights on the name Sky: | Edit. Sky is more of a boys and girls name. There are currently 1.5 males for every female named Sky in the United States. That's 2 females for every 3 males. In November 1950, the musical Guys and Dolls premiered on Broadway. The starring character was named Sky Masterson. "}, {"url": "http://www.behindthename.com/names/meaning/sky", "passage_text": "Means heavenly star from Hawaiian hōkū star and lani heaven, sky, royal, majesty. KAHURANGI f & m Maori. From the name of a type of green gemstone found in New Zealand, meaning sky blue in Maori. KALANI m & f Hawaiian. Means the heavens from Hawaiian ka the and lani heaven, sky, royal, majesty. Means sky in French. It is not used as a given name in France itself. ĉIELA f Esperanto. Means heavenly, from the sky in Esperanto. GOEKER göker M. Turkish From turkish goek gök sky and er. brave man"}, {"url": "http://www.ohbabynames.com/meaning/name/sky/7239", "passage_text": "Etymology & Historical Origin-Sky. Sky is an English vocabulary word signifying the uncertain distance high above us or the upper regions of the air. The English word is a modern mutation of the Old Saxon “scio” borrowed from the Old Norse “ský” meaning “cloud”. "}, {"url": "http://www.thenamemeaning.com/sky/", "passage_text": "Search comprehensively and find the name meaning of Sky and its name origin or of any other name in our database. Also note the spelling and the pronunciation of the name Sky and check the initials of the name with your last name to discover how it looks and sounds. The history and meaning of the name Sky is fascinating, learn more about it. If you consider naming your baby Sky we recommend you take note of the special meaning and history of the name as your baby’s name will play a big role in its life and your baby will hear it spoken every day."}, {"url": "http://nameberry.com/blog/secret-nature-names-looking-to-the-sky", "passage_text": "Efron – The handsome Efron is a Hebrew name that means “lark”. Ingram — This unusual German name has the somewhat foreboding meaning “angel-raven”. Kane or Keyne is a Celtic name meaning “man of the eastern sky.”. Lonan – This attractive Irish alternative to the overused Logan means “blackbird”. Neal, Neil, or Niall – This Irish name and its variations mean “cloud”. Zeru — A Basque name that means “sky”. "}, {"url": "http://www.behindthename.com/names/meaning/sky", "passage_text": "Means sky in French. It is not used as a given name in France itself. ĉIELA f Esperanto. Means heavenly, from the sky in Esperanto. GOEKER göker M. Turkish From turkish goek gök sky and er. BRAVE man Goekhan. Gökhan M turkish from turkish goek, gök sky and han which is from the. title khan meaning leader Means sky in French. It is not used as a given name in France itself. ĉIELA f Esperanto. Means heavenly, from the sky in Esperanto. GOEKER göker M. Turkish From turkish goek gök sky and er. brave man"}]