[{"url": "http://health.costhelper.com/dental-crown.html", "passage_text": "1 Metal crowns of gold alloy (called high noble metal) or of base metal alloys (non-noble) can cost $600-$2,500 or more per tooth. 2  CostHelper readers without insurance report paying $830-$2,465 for a metal crown, at an average cost of $1,353. 1 If a large area of tooth is missing because of decay or damage, there may be an additional charge of $150-$250 or more to build up the tooth (although some dentists include this cost in their quoted price for a crown)."}, {"url": "http://www.mynewsmile.com/cosmetic/porcelaincrownscost.htm", "passage_text": "The cost for a porcelain crown on a front tooth will generally be from $950 to over $2000, depending on the part of the country and the dentist. Related information about porcelain crowns : 1 Visit our cosmetic dentistry costs page for fee survey information about the costs of porcelain crowns and other cosmetic dentistry procedures. 2  This page also contains general information about dental costs that will help you interpret this information. 3  Click here to learn more about porcelain crowns on front teeth."}, {"url": "http://howmuchdoesitcost.me/health-beauty/dental-crown-costs/", "passage_text": "1 All-porcelain crowns are the most delicate, most lifelike and most expensive and the cost reflects this. 2  These types of crowns cost from $800 to over $3,000. 3  Insurance copays for all-porcelain crowns range from $530 – $1,875, with an average out of pocket cost of $950 per crown. They are less expensive than all-porcelain crowns, but more than the porcelain-over-metal crowns. The average cost of a gold crown is $900, but the prices vary if the patient has insurance."}, {"url": "http://health.costhelper.com/dental-crown.html", "passage_text": "1 CostHelper readers without insurance report paying $830-$2,465 for a metal crown, at an average cost of $1,353. 2  CostHelper readers with insurance report out-of-pocket expenses of $519-$1,140, for an average payment of $882. 1 If a large area of tooth is missing because of decay or damage, there may be an additional charge of $150-$250 or more to build up the tooth (although some dentists include this cost in their quoted price for a crown)."}, {"url": "http://health.costhelper.com/dental-crown.html", "passage_text": "1 Porcelain-fused-to-metal crowns can cost $500-$1,500 or more per tooth. 2  For example, CostHelper readers without insurance coverage report paying $875-$1,400 for porcelain-fused-to-metal crowns, at an average cost of $1,093. 1 If a large area of tooth is missing because of decay or damage, there may be an additional charge of $150-$250 or more to build up the tooth (although some dentists include this cost in their quoted price for a crown)."}, {"url": "http://health.costhelper.com/dental-crown.html", "passage_text": "1 All-porcelain crowns require a higher level of skill and take more time to install than metal or porcelain-fused-to-metal crowns, and can cost $800-$3,000 or more per tooth. 2  CostHelper readers without insurance report paying $860-$3,000, at an average cost of $1,430. 1 If a large area of tooth is missing because of decay or damage, there may be an additional charge of $150-$250 or more to build up the tooth (although some dentists include this cost in their quoted price for a crown)."}, {"url": "http://howmuchdoesitcost.me/health-beauty/dental-crown-costs/", "passage_text": "1 Porcelain-fused–to-metal crowns are the most popular type of crown. 2  Costs run from $500 to $1,500 or more per tooth. 3  Patients with insurance generally had copays of $280 to $1,000 per crown with an average payment of $620. They are less expensive than all-porcelain crowns, but more than the porcelain-over-metal crowns. The average cost of a gold crown is $900, but the prices vary if the patient has insurance."}, {"url": "http://howmuchdoesitcost.me/health-beauty/dental-crown-costs/", "passage_text": "The prices for dental crowns range from $500 to $2,500 per crown and are dependent upon the materials used, location of tooth and geographic location. The average cost of a crown is $825, with or without dental insurance coverage. The cheapest cost of a dental crown is $500 for a simple metal crown. They are less expensive than all-porcelain crowns, but more than the porcelain-over-metal crowns. The average cost of a gold crown is $900, but the prices vary if the patient has insurance."}, {"url": "http://www.mynewsmile.com/cosmetic/porcelaincrownscost.htm", "passage_text": "A beautiful porcelain crown on a front tooth will generally cost much more than a basic crown on a back tooth. Besides the functional requirements, the porcelain crown on a front tooth will have to look perfect in order to blend in with the other teeth. 1 Visit our cosmetic dentistry costs page for fee survey information about the costs of porcelain crowns and other cosmetic dentistry procedures. 2  This page also contains general information about dental costs that will help you interpret this information. 3  Click here to learn more about porcelain crowns on front teeth."}]