[{"url": "https://answers.yahoo.com/question/index?qid=20110422190304AAtta6J", "passage_text": "Answers. Best Answer: As a full time professor, they'd start out making between 40k (most small colleges) and 70k (top schools). Also, there are far more PhDs in psychology who want to teach college than there are jobs for them, so it takes a lot to get that job in the first place. You can't teach at a 4-year college or university without a PhD, and they expect you to do research, publish frequently, and bring in grant money."}, {"url": "http://www.insidejobs.com/articles/how-much-does-a-college-professor-make", "passage_text": "The lowest-paid 10 percent of all University Professors earn less than $28,870, while the highest-paid 10 percent are paid more than $121,850 per year. The middle 50 percent of all University Professors earn between $41,600 and $83,960, so chances are good that you’ll earn more than the average annual salary. Special Education Professor Teach university students about special education practices. Education: Doctorate Salary: $33,000 – $104,000 Professor Teach university or college students."}, {"url": "https://answers.yahoo.com/question/index?qid=20110422190304AAtta6J", "passage_text": "Yes, some professors make far more than others; law, business, and nursing/medical profs make the most, humanities make the least. You can't teach at a 4-year college or university without a PhD, and they expect you to do research, publish frequently, and bring in grant money."}, {"url": "https://en.wikipedia.org/wiki/Professors_in_the_United_States", "passage_text": "By rank, the average was $98,974 for professors, $69,911 for associate professors, $58,662 for assistant professors, $42,609 for instructors, and $48,289 for lecturers. Faculty in 4-year institutions earn higher salaries, on average, than do those in 2-year schools. "}, {"url": "http://work.chron.com/much-professors-earn-8913.html", "passage_text": "Rank. Wages for professor varied by rank. The lowest-paid had no rank and earned a mean $65,574 per year for the 2010-11 school year, according to the American Association of University Professors. Lecturers earned an average annual $53,556 and instructors received an average $47,143 yearly. "}, {"url": "http://www.thebestschools.org/blog/2013/11/25/10-highest-paid-college-professors-u-s/", "passage_text": "10 Highest-Paid College Professors in the U.S. Many college professors change lives, challenge the world around us, and teach us the skills needed to improve our lives. However, their salaries range widely—anywhere from adjunct professors earnings around $30,000 to a full-time professor earning $500,000 and more. College professors may teach at either private or public universities; their level of expertise and interest will determine where they spend the bulk of their years teaching."}, {"url": "http://www.insidejobs.com/articles/how-much-does-a-college-professor-make", "passage_text": "The American Association of University Professors reports that the salary of full-time faculty at private colleges and universities average $92,257, as compared to $77,009 for those teaching at public colleges and universities. Special Education Professor Teach university students about special education practices. Education: Doctorate Salary: $33,000 – $104,000 Professor Teach university or college students."}, {"url": "http://www.byuaccounting.net/mediawiki/index.php?title=Life_as_a_Professor", "passage_text": "Salaries for accounting professors are usually higher if the employing school has a greater research reputation. Typical base salaries for accounting professors at a top 50 accounting research school start above $150,000 a year (and may start as high as $225,000). In addition to the base salary, many schools offer summer research support. Accounting professors are highly compensated. The AACSB conducts an annual faculty salary survey and reports the results. Numbers below are based on the 2013/2014 survey. The average salary of a recently hired accounting professor in 2013/2014 was $153,000."}, {"url": "http://work.chron.com/much-professor-university-make-per-year-9417.html", "passage_text": "For example, mathematical science professors at state-owned universities earned mean annual wages of $76,010, while those who taught at private universities made $77,060 as of May 2011, according to the Bureau of Labor Statistics. An assistant professor is a full-time professor, but without tenure. Once she gains tenure she is known as an associate professor. When an associate professor has achieved a significant body of work, she may be promoted to the highest level of her profession, full"}, {"url": "http://work.chron.com/much-professor-university-make-per-year-9417.html", "passage_text": "Although university professors might have numerous titles, the common levels of full-time professorship include assistant professor, associate professor and full professor. An assistant professor is a full-time professor, but without tenure. Once she gains tenure she is known as an associate professor. When an associate professor has achieved a significant body of work, she may be promoted to the highest level of her profession, full professor."}]