[{"url": "http://www.edurite.com/kbase/deciduous-forest-animals-adaptation", "passage_text": "A temperate deciduous forest, more precisely termed temperate broadleaf forest or temperate broadleaved forest, is a biome found in the eastern and western United States, Canada, central Mexico, southern South America, Europe, West Asia, China, Japan, North Korea, South Korea and parts of Russia. Organisms and their adaptations. Many well-known animals live in this kind of forest. Some examples are the Eastern Gray Squirrel, bear s, beaver s, fox es, deer, rat s, snake s, mice, wolves, raccoon s, and large birds of prey like red-tailed hawks. These animals have unique adaptations suited for seasonal life."}, {"url": "http://www.vtaide.com/png/temperateBiomes.htm", "passage_text": "The picture shows a food web in a temperate deciduous forest. The Temperate Deciduous Forest biome has four seasons of winter, spring, summer and fall. Animals and plants have special adaptations to cope with these yearly changes. Plant adaptations. Deciduous trees are trees that shed their leaves once a year at the approach of a cold or dry season and later grow new leaves. (Plants that keep their foliage throughout the year are called evergreens.) Deciduous trees usually have broad leaves e.g., ash, beech, birch, maple and oak. Animal adaptations. Animals in temperate deciduous forests also have to adapt to the changing seasons. "}, {"url": "http://www.edurite.com/kbase/deciduous-forest-plant-adaptations", "passage_text": "The trees of the deciduous biome include broadleaf and evergreen trees. The broadleaf deciduous are like the maple, oak, hickory and beech and the evergreens are the hemlock, spruce and fir. In typical deciduous forests there are three to four or sometimes five layers of plant growth. The fifth layer is the mosses and lichens that grow on tree trunks. Deciduous forest plant adaptations: The trees of the deciduous forest shed their leaves once in a year and during the dry or cold season the leaves are grown back in the spring and summer. The deciduous trees have broad leaves like in ash, beech, maple and oak"}, {"url": "http://www.edurite.com/kbase/deciduous-forest-plant-adaptations", "passage_text": "A temperate deciduous forest, more precisely termed temperate broadleaf forest or temperate broadleaved forest, is a biome found in the eastern and western United States, Canada, central Mexico, southern South America, Europe, West Asia, China, Japan, North Korea, South Korea and parts of Russia. The fifth layer is the mosses and lichens that grow on tree trunks. Deciduous forest plant adaptations: The trees of the deciduous forest shed their leaves once in a year and during the dry or cold season the leaves are grown back in the spring and summer. The deciduous trees have broad leaves like in ash, beech, maple and oak"}, {"url": "http://www.cotf.edu/ete/modules/msese/earthsysFlr/dforestA.html", "passage_text": "Deciduous Forest: Animals A wide variety of mammals, birds, insects, and reptiles can be found in a deciduous forest biome. Mammals that are commonly found in a deciduous forest include bears, raccoons, squirrels, skunks, wood mice, and, in the U.S., deer can be found in these forests. "}, {"url": "http://awesomedeciduous.weebly.com/adaptations.html", "passage_text": "Animal Adaptations. Animals living in a temperate deciduous forest must be able to adapt to the seasonal changes. They have to prepare for the colder temperatures of the winter months and be able to survive within limited food supplies. "}, {"url": "http://www.edurite.com/kbase/deciduous-forest-plant-adaptations", "passage_text": "Deciduous means to shed or to fall off; trees of the deciduous biome shed their leaves once in a year. The deciduous biomes are located in between the Polar Regions and the tropics. Deciduous forests are found in the eastern part of the United States and large areas of Europe. The fifth layer is the mosses and lichens that grow on tree trunks. Deciduous forest plant adaptations: The trees of the deciduous forest shed their leaves once in a year and during the dry or cold season the leaves are grown back in the spring and summer. The deciduous trees have broad leaves like in ash, beech, maple and oak"}, {"url": "http://www.cotf.edu/ete/modules/msese/earthsysFlr/dforestP.html", "passage_text": "Deciduous Forest: Plants Trees of this biome include both broadleaf, deciduous trees, such as maple, oak, hickory, and beech, and evergreens, such as hemlock, spruce, and fir. A deciduous forest typically has three to four, and sometimes five, layers of plant growth. "}, {"url": "http://www.blueplanetbiomes.org/deciduous_forest.htm", "passage_text": "Plants Animals Climate Northeast Asian Deciduous Forest Deciduous forests can be found in the eastern half of North America, and the middle of Europe. There are many deciduous forests in Asia. Some of the major areas that they are in are southwest Russia, Japan, and eastern China. "}]