[{"url": "http://www.bloomberg.com/quote/VOC:US", "passage_text": "Please check back later. Profile. Voc Energy Trust Trust is a Delaware statutory trust. The Trust was formed to own interests from production from substantially all of the interests in oil and natural gas properties in the states of Kansas and Texas held by VOC Sponsor. 919 Congress Avenue. "}, {"url": "http://www.marketwatch.com/investing/stock/VOC/profile", "passage_text": "Company Description. VOC Energy Trust operates as a statutory trust. Its business and affairs are managed by The Bank of New York Mellon Trust Co, N.A. The company was founded on November 3, 2010 and is headquartered in Austin, TX. "}, {"url": "http://www.dividend.com/dividend-stocks/basic-materials/independent-oil-and-gas/voc-voc-energy-trust/", "passage_text": "VOC Energy Trust (VOC) is a statutory trust formed by VOC Sponsor whichowns a term net profits interest of the net proceeds from production of the interests in oil and natural gas properties in the states of Kansas and Texas. The company was founded in 2010 and is based in Austin, Texas. Investor Resources. New Dividend Stock Added to Database (VOC). We are adding shares of VOC Energy Trust (VOC) to our database of over 1600 dividend-paying stocks -- this is not a recommendation of the stock, but just an initiation of coverage."}, {"url": "http://voc.investorhq.businesswire.com/", "passage_text": "AUSTIN, Texas--(BUSINESS WIRE)--VOC Energy Trust (NYSE: VOC) announced the Trust distribution of net profits for the second quarterly payment period ended June 30, 2015. Unitholders of record on July 30, 2015 will receive a distribution amounting to $1,870,000 or $0.11 per unit, payable August 14, 2015. Volumes, average sales prices and net profits for the payment period weremore... VOC Energy Trust Announces Trust Quarterly Distribution. Unitholders of record on April 30, 2015 will receive a distribution amounting to $2,720,000, or $0.16 per unit, payable May 15"}, {"url": "http://seekingalpha.com/symbol/VOC", "passage_text": "Company Description. VOC Energy Trustis a statutory trust,The Trust is created to acquire and hold a term net profits interest for the benefit of the Trust unitholders from production from the properties. VOC Energy Trust (VOC -16.7%) plunges after announcing a quarterly distribution."}, {"url": "http://www.google.com/finance?cid=4052007", "passage_text": "Description. VOC Energy Trust is a statutory trust formed under a trust agreement among VOC Brazos Energy Partners, L.P. (VOC Brazos) as trustor, The Bank of New York Mellon Trust Company, N.A., as Trustee and Wilmington Trust Company as Delaware Trustee. The Trust was created to acquire and hold a term net profits interest for the benefit of the Trust unit holders. VOC Brazos is engaged in the production and development of oil and natural gas from properties located in Texas."}, {"url": "http://www.google.com/finance?cid=4052007", "passage_text": "More from FactSet ». VOC Energy Trust is a statutory trust formed under a trust agreement among VOC Brazos Energy Partners, L.P. (VOC Brazos) as trustor, The Bank of New York Mellon Trust Company, N.A., as Trustee and Wilmington Trust Company as Delaware Trustee. The Trust was created to acquire and hold a term net profits interest for the benefit of the Trust unit holders. VOC Brazos is engaged in the production and development of oil and natural gas from properties located in Texas."}, {"url": "http://voc.investorhq.businesswire.com/", "passage_text": "AUSTIN, Texas--(BUSINESS WIRE)--VOC Energy Trust (NYSE: VOC) announced the Trust distribution of net profits for the first quarterly payment period ended March 31, 2015. Unitholders of record on April 30, 2015 will receive a distribution amounting to $2,720,000, or $0.16 per unit, payable May 15, 2015. Volumes, average sales prices and net profits for the payment period weremore..."}, {"url": "http://www.dividend.com/dividend-stocks/basic-materials/independent-oil-and-gas/voc-voc-energy-trust/", "passage_text": "VOC Energy Trust (VOC) - this company owns a term net profits interest of the net proceeds from production of the interests in oil and natural gas properties in the states of Kansas and Texas. It owns an 80% term net profits interest of the net proceeds on the underlying properties. New Dividend Stock Added to Database (VOC). We are adding shares of VOC Energy Trust (VOC) to our database of over 1600 dividend-paying stocks -- this is not a recommendation of the stock, but just an initiation of coverage."}, {"url": "http://www.dividendchannel.com/symbol/voc/", "passage_text": "VOC Energy Trust is a statutory trust. The business and affairs of Co. are managed by The Bank of New York Mellon Trust Company, N.A., as trustee. Co. is entitled to receive 80% of the net proceeds from the sale and production of all of the interests in oil and natural gas properties in the states of Kansas and Texas held by VOC Brazos Energy Partners, L.P. as of May 10, 2011."}]