[{"url": "http://health.costhelper.com/nutritionist.html", "passage_text": "1 A registered dietitian might recommend classes on healthful cooking, which can cost $10 or more each. 2  Some dietitians offer optional additional services, such as personalized grocery shopping and pantry stocking, that can cost $450 or more, plus the cost of groceries. 1 For patients covered by health insurance, typical out-of-pocket costs would be about $10 to $40 -- usually a copay or 10 to 20 percent of the total cost of the visit."}, {"url": "http://www.naturalhealers.com/nutritionist/degree/", "passage_text": "The cost of your program will depend on what degree level you want to earn and what institution you attend; a four-year bachelor’s degree will be the more expensive option, while a certificate from a two-year institution or program will cost less. Back to top. "}, {"url": "http://education.costhelper.com/nutritionist-school.html", "passage_text": "1 A bachelor's degree in health science, dietetics or a related field costs $14,000-$80,000. 2  This degree prepares students for more advanced careers in nutrition, and is often a prerequisite for licensure and graduate study in nutrition. 1 A master's degree in nutrition through the University of Bridgeport in Connecticut costs $21,200 for 31 credit hours. 2  Certification or licensure for a nutritionist differs in each state, but costs $100-$350."}, {"url": "http://health.costhelper.com/nutritionist.html", "passage_text": "1 If follow up visits are required, they typically cost $50 to $150 each, depending on length of consultation and whether the dietitian comes to your home. 1 For patients covered by health insurance, typical out-of-pocket costs would be about $10 to $40 -- usually a copay or 10 to 20 percent of the total cost of the visit."}, {"url": "http://health.costhelper.com/nutritionist.html", "passage_text": "1 For patients not covered by health insurance, a one-hour initial consultation with a registered dietitian, or RD, typically costs about $100 to $200 -- usually on the higher end if the dietitian comes to your home. 1 For patients covered by health insurance, typical out-of-pocket costs would be about $10 to $40 -- usually a copay or 10 to 20 percent of the total cost of the visit."}, {"url": "http://education.costhelper.com/nutritionist-school.html", "passage_text": "1 Certification or licensure for a nutritionist differs in each state, but costs $100-$350. 2  For example, Minnesota's licensing fees for a nutritionist include $175 to apply, $165 for the initial license and $50 annually to renew. 3  It costs $100 to reinstate a nutritionist's license once it has lapsed. 1 A master's degree in nutrition through the University of Bridgeport in Connecticut costs $21,200 for 31 credit hours. 2 "}, {"url": "http://education.costhelper.com/nutritionist-school.html", "passage_text": "1 An associate's degree in nutrition costs $5,000-$30,000 and can prepare entry-level workers for a career as a nutritionist or dietitian's assistant, but does not prepare individuals seeking licensure as a nutritionist. 1 A master's degree in nutrition through the University of Bridgeport in Connecticut costs $21,200 for 31 credit hours. 2  Certification or licensure for a nutritionist differs in each state, but costs $100-$350."}, {"url": "http://health.costhelper.com/nutritionist.html", "passage_text": "Discounts: 1  A registered dietitian might recommend classes on healthful cooking, which can cost $10 or more each. 2  Some dietitians offer optional additional services, such as personalized grocery shopping and pantry stocking, that can cost $450 or more, plus the cost of groceries. 1 For patients covered by health insurance, typical out-of-pocket costs would be about $10 to $40 -- usually a copay or 10 to 20 percent of the total cost of the visit."}, {"url": "http://education.costhelper.com/nutritionist-school.html", "passage_text": "1 The application fee is $45, the license costs $25, and the annual renewal fee costs $65. 2  All Pennsylvania dietitian-nutritionist licensees must complete at least 30 hours of continuing education credits to renew a license. 1 A master's degree in nutrition through the University of Bridgeport in Connecticut costs $21,200 for 31 credit hours. 2  Certification or licensure for a nutritionist differs in each state, but costs $100-$350."}]