[{"url": "http://traveltips.usatoday.com/climate-weather-lima-13619.html", "passage_text": "Winter Temperature. Winter temperatures are mild in Lima. The winter season lasts from late May through August. Average highs hover around 70 degrees F. Lows drop down to 50 degrees F on colder nights. The summer months in Lima are from December to April, with the hottest months being December and January. The average high here during summer is around 85 degrees F, and the low is around 70 degrees. Some summer days can get much hotter, with temperatures in the high 90s."}, {"url": "http://www.limaeasy.com/lima-info/the-weather-and-climate-in-lima", "passage_text": "Temperatures in Lima. The charts presents the values recorded by our weather station as three lines: Highest Temperatures, Average Temperatures and Lowest Temperatures (First chart with values in °F, second chart with values in °C). The Average Relative Humidity is not directly related to the values for the Lowest and Highest Humidity as they only indicate the most extreme values for each month. The Average Relative Humidity was calculated by using the measurements from the weather station in intervals of every 15 minutes for the whole month."}, {"url": "http://www.limaeasy.com/lima-info/the-weather-and-climate-in-lima", "passage_text": "It's usually described as mild and warm throughout the year without noteworthy rain making Lima one of the driest capitals in the world. The average temperatures range from 12°C/54°F to 18°C/64°F (low) and 24°C/75°F to 28°C/82°F (high). The Average Relative Humidity is not directly related to the values for the Lowest and Highest Humidity as they only indicate the most extreme values for each month. The Average Relative Humidity was calculated by using the measurements from the weather station in intervals of every 15 minutes for the whole month."}, {"url": "http://www.peru.climatemps.com/", "passage_text": "Climate, Average Weather of Peru. 1  Of the land area, 41.1% has a tropical rainforest climate (Af), 4.8% has a tropical wet and dry/ savanna climate (Aw), 11.8% has a arid/ desert climate (BW), 8.6% has a temperate/ mesothermal climate with dry winters (Cw), 33.7% has a alpine/ highland climate (H). 1 Of the population, 6.7% live in a tropical rainforest climate (Af), 6.2% live in a tropical wet and dry/ savanna climate (Aw), 46.8% live in a arid/ desert climate (BW), 1.2% live in a temperate/ mesothermal climate with dry winters (Cw), 39.2% live in a alpine/ highland climate (H)."}, {"url": "http://enjoyperu.com/peru_travel_tours_information/peru_useful_information/peru_climate_weather.html", "passage_text": "CLIMATE. G enerally speaking, the climate varies from region to region in Peru. In the Coast, the weather varies, with a damp and cloudy winter that runs from June to September. Average temperatures come in at 14 C. During the summer, temperatures can peak at 28 C or over. In the Highlands, the sun shines all year round during the morning, but temperatures descend at night, averaging 5 C. Lima is a city that features a moderate climate, ranging from a light drizzle in winter to a warm summer. Average temperature in summertime-from mid-December to mid-March is 25 / 28 C. Winter, which usually features overcast skies and high humidity, has temperatures ranging from 10 to 16 C."}, {"url": "http://www.limaeasy.com/lima-info/the-weather-and-climate-in-lima", "passage_text": "The below graphs will give you a good idea about the average temperatures in Lima, the constant high humidity and the very little amount of rainfall per year. The Average Relative Humidity is not directly related to the values for the Lowest and Highest Humidity as they only indicate the most extreme values for each month. The Average Relative Humidity was calculated by using the measurements from the weather station in intervals of every 15 minutes for the whole month."}, {"url": "http://traveltips.usatoday.com/climate-weather-lima-13619.html", "passage_text": "Summer Temperature. Lima is in the Southern Hemisphere. The summer months in Lima are from December to April, with the hottest months being December and January. The average high here during summer is around 85 degrees F, and the low is around 70 degrees. Some summer days can get much hotter, with temperatures in the high 90s."}, {"url": "http://www.cusco.climatemps.com/", "passage_text": "Cuzco Climate & Temperature. 1  Cuzco, Peru is at 13 32'S, 71 56'W, 3249 m (10659 ft). 2  See map. 3  Cuzco has a humid subtropical mild summer climate that is mild with dry winters, mild rainy summers and moderate seasonality. 4  This climate is usually found in the highlands of some tropical countries. 1 Average monthly temperatures vary by 3.95 °C (7.1°F). 2  This indicates that the continentality type is hyperoceanic, subtype truly hyperoceanic. 3  In the winter time records indicate temperatures by day reach 19.5°C (67.1°F) on average falling to 0.8°C (33.4°F) overnight."}]