[{"url": "http://pirate.shu.edu/~wachsmut/Teaching/MATH2511/10Spring/m2411-Kindle_setup.html", "passage_text": "The Kindle is an eBook reader that can store and display books-some free, some not-and other information. Just as an iPod/iPhone is tied to iTunes, the Kindle is tied to Amazon.com, but just as you can load other music files on an iPod, you can also load content from different sources onto a Kindle."}, {"url": "http://www.amazon.com/forum/kindle?cdForum=Fx1D7SY3BVSESG&cdThread=Tx24NQJ5CDKORN4", "passage_text": "You can absolutely download your iTunes music purchases onto your Kindle Fire. If you have all of your iTunes purchases backed up to the iCloud, once you've set up the Amazon Cloud Player it will automatically find your music then ask if you'd like to complete the set up (depending on how much size you have/need)."}, {"url": "https://removaldrm.wordpress.com/2012/12/30/how-to-sync-itunes-to-kindle-fire/", "passage_text": "After getting the files into the software select the destination format to which you want the files to be converted MP3, MP4, WAV, MIDI and OGG formats. In case you are opting for transferring itunes to kindle fire you can select MP3 and MP4 formats. Then start converting the files to the kindle fire and the files will be ready to be played on you Amazon kindle."}, {"url": "http://www.aimersoft.com/itunes-drm/itunes-to-kindle.html", "passage_text": "To play DRM iTunes music and video on Amazon Kindle Fire, you can use a DRM removal tool to get rid of iTunes DRM protection and then import the non-DRM files to Kindle Fire for playback."}, {"url": "http://usatoday30.usatoday.com/tech/products/story/2012-04-06/tecca-kindle-fire-itunes-music/54080800/1", "passage_text": "Even though you bought the music through Apple, you can enjoy it on your Kindle Fire with these easy steps. More from Tecca: Kindle Fire guide: Everything you need to know about Amazon's new tablet."}, {"url": "https://removaldrm.wordpress.com/2012/12/30/how-to-sync-itunes-to-kindle-fire/", "passage_text": "Though getting itunes to kindle is an easy task when the itunes have no DRM restrictions. When the itunes are free from DRM protection you can simply drag the itunes to the Amazon kindle fire to play and enjoy. The problem occurs when the files have DRM enabled protection."}, {"url": "https://support.apple.com/en-gb/HT204316", "passage_text": "To purchase and download from the iTunes Store, you need an Apple ID. If you've used other Apple services such as iCloud, the Mac App Store, or have purchased from the Apple Online Store, you can sign in to the iTunes Store using that same Apple ID. Before you create a new Apple ID, find out if you already have one."}, {"url": "http://www.aimersoft.com/itunes-drm/itunes-to-kindle.html", "passage_text": "When the conversion is done, you can get Kindle Fire supported no-DRM video and audio files on your destination folder. Then connect your Kindle Fire to computer with a USB and transfer the files to it. In this way, you can play iTunes video and music on Amazon Kindle Fire with ease!"}, {"url": "http://www.amazon.com/forum/kindle?cdForum=Fx1D7SY3BVSESG&cdThread=Tx24NQJ5CDKORN4", "passage_text": "Buy music on Amazon MP3 store, put it in the Amazon Cloud. You can configure the Amazon MP3 Downloader to automatically send the music to iTunes on your computer from the Amazon Cloud. Next time you sync your iPhone with your computer using iTunes, you'll get the music."}]