[{"url": "http://godofwar.wikia.com/wiki/Aegean_Sea", "passage_text": "Kratos' encounter with the Hydra, on the Aegean Sea. The Aegean Sea is a large body of water on the eastern side of Greece. It connects with the much larger Mediterranean Sea. "}, {"url": "https://en.wikipedia.org/wiki/Aegean_dispute", "passage_text": "The Aegean dispute is a set of interrelated controversial issues between Greece and Turkey over sovereignty and related rights in the area of the Aegean Sea. This set of conflicts has had a large effect on Greek-Turkish relations since the 1970s. "}, {"url": "http://www.allaboutturkey.com/sea.htm", "passage_text": "Aegean Sea. Aegean Sea (Ege Denizi in Turkish) is a part of Mediterranean Sea lying between Turkey and Greece. There is Mediterranean Sea to the south, Greek Peninsula to the west, Anatolia and part of Thrace to the east. It's connected to the Sea of Marmara by Dardanelles Strait to the northeast. There are approximately 3000 big and small islands in the Aegean Sea, most of them belong to Greece today. Some of the most famous Greek islands in the Aegean are; Crete, Rhodes, Lesbos, Chios, Santorini, Mykonos, Patmos, Delos, Paros, Kos, Symi, Samos and so on."}, {"url": "http://www.ancient.eu/aegean/", "passage_text": "The Aegean Sea features prominently in many of the most famous Greek myths (Icarus and Daedelus, Theseus and the Minotaur, Jason and the Argonauts, The Odyssey, among others) and Plato made ample use of the islands in his dialogues. The Aegean Sea features prominently in many of the most famous Greek myths. The early inhabitants of Greece, the Mycenaens, relied heavily on the Aegean for trade and, it seems, traveled as far as Spain and Egypt."}, {"url": "http://www.thefreedictionary.com/Aegean+Sea", "passage_text": "An arm of the Mediterranean Sea off southeast Europe between Greece and Turkey. The numerous Aegean Islands dotting the sea include the Cyclades, the Dodecanese, and the Sporades. Most of the islands belong to Greece. Aegean. Aegean island-an island in the Aegean Sea. Lemnos, Limnos-a Greek island in the northern Aegean Sea; famous for a reddish-brown clay that has medicinal properties. Mediterranean, Mediterranean Sea-the largest inland sea; between Europe and Africa and Asia."}, {"url": "http://www.worldatlas.com/aatlas/infopage/aegeansea.htm", "passage_text": "Positioned between Greece and Turkey, the Aegean Sea, part of the Mediterranean Sea, also includes the Sea of Crete and Thracian Sea. "}, {"url": "http://www.ancient.eu/aegean/", "passage_text": "by Joshua J. Mark. The Aegean Sea lies between the coast of Greece and Asia Minor (modern-day Turkey). It contains over 2,000 islands which were settled by the ancient Greeks; the largest among them being Crete (Kriti) and the best known and most often photographed, Santorini (Thera or Thira). The Aegean Sea features prominently in many of the most famous Greek myths. The early inhabitants of Greece, the Mycenaens, relied heavily on the Aegean for trade and, it seems, traveled as far as Spain and Egypt."}, {"url": "http://www.ancient.eu/aegean/", "passage_text": "Paros is an island in the Cyclades group in the central Aegean. It is the third largest island of the Cyclades and its position on important sea routes between mainland Greece and the coast of Asia Minor made it an important centre from the early Bronze Age through to Roman times. The Aegean Sea features prominently in many of the most famous Greek myths. The early inhabitants of Greece, the Mycenaens, relied heavily on the Aegean for trade and, it seems, traveled as far as Spain and Egypt."}, {"url": "http://www.encyclopedia.com/topic/Aegean_Sea.aspx", "passage_text": "© World Encyclopedia 2005, originally published by Oxford University Press 2005. Aegean Sea Part of the Mediterranean Sea between Greece and Turkey, bounded by Crete to the s and connected to the Black Sea and the Sea of Marmara by the Dardanelles to the ne. "}]