[{"url": "https://en.wikipedia.org/wiki/Responsible_government", "passage_text": "Governments (the equivalent of the executive branch) in Westminster democracies are responsible to parliament rather than to the monarch, or, in a colonial context, to the imperial government. The concept of responsible government is associated in Canada more with self-government than with parliamentary accountability; hence the notion that Newfoundland gave up responsible government when it suspended its self-governing status in 1933."}, {"url": "http://www.answers.com/Q/A_government_is_responsible_for", "passage_text": "A typical government is responsible for many things. As an example, the government of America is responsible for creating and enforcing laws, protecting and assisting citizens, making important decisions, keeping peace, and keeping judicial balance. The primary responsibility of each of the three branches of the U.S. government is: Legislative branch, to make laws; Judicial branch, to interpret laws; Executive branc … h, to enforce laws. The 3 branches of the government are the Executive, Judicial, and Legislative. The Executive Branch contains the president."}, {"url": "https://simple.wikipedia.org/wiki/Responsible_government", "passage_text": "Responsible government is a principle of some democratic governments. It is not the same as a government with responsibility. A 'responsible government' is one in which there is a degree of accountability towards parliament. There is also the fundamental concept of Bicameralism. For example, in the United Kingdom the accountability tends towards the Lower House (House of Commons), as the upper House (House of Lords) is not wholly elected. In countries that do not have responsible government, the cabinet and the legislature are each elected separately. This system has more separation of powers than a system with responsible government. Some examples of countries that do not have a system of responsible government are the United States and France."}, {"url": "http://www.house.gov/content/learn/branches_of_government/", "passage_text": "To ensure a separation of powers, the U.S. Federal Government is made up of three branches: legislative, executive and judicial. To ensure the government is effective and citizens’ rights are protected, each branch has its own powers and responsibilities, including working with the other branches. The legislative branch is made up of the House and Senate, known collectively as the Congress. Among other powers, the legislative branch makes all laws, declares war, regulates interstate and foreign commerce and controls taxing and spending policies."}, {"url": "http://www.answers.com/Q/What_is_responsible_government", "passage_text": "Split and merge into it. Answer by Christopher Girodat. Confidence votes 60. Responsible government is the concept that the Sovereign (or the representatives of the Sovereign) can only govern with the support of an elected assembly. In Canada, this means that the prime minister (and the Government of Canada) must enjoy the support of the elected House of Commons to govern. The Judicial Branch is strictly responsible for interpreting the law. What this means is that the Judicial Branch can overturn laws and bills if it is deemed unconstitution … al. (But only if they are part of a case being heard in that court)."}, {"url": "https://en.wikipedia.org/wiki/Responsible_government", "passage_text": "Responsible government is a conception of a system of government that embodies the principle of parliamentary accountability, the foundation of the Westminster system of parliamentary democracy. The concept of responsible government is associated in Canada more with self-government than with parliamentary accountability; hence the notion that Newfoundland gave up responsible government when it suspended its self-governing status in 1933."}, {"url": "https://en.wikipedia.org/wiki/Responsible_government", "passage_text": "If the parliament is bicameral, then the government is responsible first to the parliament's lower house, which is more numerous, directly elected and thus more representative than the upper house. Responsible government of parliamentary accountability manifests itself in several ways. The concept of responsible government is associated in Canada more with self-government than with parliamentary accountability; hence the notion that Newfoundland gave up responsible government when it suspended its self-governing status in 1933."}, {"url": "http://www.definitions.net/definition/responsible%20government", "passage_text": "Responsible government is a conception of a system of government that embodies the principle of parliamentary accountability, the foundation of the Westminster system of parliamentary democracy. If the parliament is bicameral, then the government is responsible first to the parliament's lower house, which is more numerous, directly elected and thus more representative than the upper house Responsible government of parliamentary accountability manifests itself in several ways."}, {"url": "https://en.wikipedia.org/wiki/Responsible_government", "passage_text": "Lastly, the Sovereign is in turn required to effectuate their sovereignty only through these responsible ministers. He or she must never attempt to set up a shadow government of executives or advisors and attempt to use them as instruments of government, or to rely upon their, unofficial advice. The concept of responsible government is associated in Canada more with self-government than with parliamentary accountability; hence the notion that Newfoundland gave up responsible government when it suspended its self-governing status in 1933."}]