[{"url": "http://www.thekitchn.com/how-to-cook-salmon-in-the-oven-cooking-lessons-from-the-kitchn-204559", "passage_text": "Place the salmon in the roasting pan: Place the salmon in the roasting pan, skin-side down. Transfer to the oven. Roast for 4 to 6 minutes per half-inch thickness of salmon: Roasting time depends on the thickness of your salmon, as determined by the thickest part of the salmon fillet. Line a roasting pan or baking sheet with foil. Pat the salmon dry: Pat the salmon dry with a paper towel. Rub the salmon with oil, salt, and pepper: Drizzle some oil over the top of each salmon — just enough to coat the salmon — and rub it over the salmon with your fingers or a pastry brush."}, {"url": "http://www.wikihow.com/Cook-Salmon-Fillet", "passage_text": "Coat the salmon. Place the salmon in the marinade and seal the bag. Turn the bag several times to coat all sides of the salmon. 1  If using a glass dish, turn the fillets in the marinade several times to coat all sides, then cover the dish with a lid or aluminum foil. Preheat the grill. You can use both gas and charcoal grills to prepare salmon fillets. 1  If using a gas grill, preheat the grill to 450 degrees Fahrenheit (232 degrees Celsius). 2  If using a charcoal grill, spread a layer of charcoal onto the bottom of the grill and light."}, {"url": "http://allrecipes.com/recipe/36487/blackened-salmon-fillets/", "passage_text": "1 Brush salmon fillets on both sides with 1/4 cup butter, and sprinkle evenly with the cayenne pepper mixture. 2  Drizzle one side of each fillet with 1/2 remaining butter. 3  In a large, heavy skillet over high heat, cook salmon, butter side down, until blackened, 2 to 5 minutes. 1 Drizzle one side of each fillet with 1/2 remaining butter. 2  In a large, heavy skillet over high heat, cook salmon, butter side down, until blackened, 2 to 5 minutes. 3  Turn fillets, drizzle with remaining butter, and continue cooking until blackened and fish is easily flaked with a fork."}, {"url": "http://www.bhg.com/recipes/fish/basics/how-to-bake-salmon/", "passage_text": "Bake Until Opaque and Flaky. Preheat the oven to 450 degrees F for fillets or 350 degrees F for a dressed fish. You can bake the fillets at a lower temperature, if desired, but remember to increase the cooking time. Bake salmon fillets or steaks, uncovered, for 4 to 6 minutes per 1/2-inch thickness. For a dressed salmon, bake for 6 to 9 minutes per 8 ounces of fish. To test for doneness, insert a fork into the salmon and gently twist. The salmon is done as soon as it begins to flake. Be sure to test at the minimum ba"}, {"url": "http://localfoods.about.com/od/maindishes/r/grilledsalmon.htm", "passage_text": "1 Brush the cooking grate with oil. 2  Place the salmon, skin-side-down, on the grill and cover. 3  Cook, undisturbed, until the salmon just starts to release (some might say ooze) its fat (opaque mayonnaise-y stuff) and/or the flesh flakes easily, 10 to 15 minutes for most 1-inch-thick fillets. 1 Place the salmon, skin-side-down, on the grill and cover. 2  Cook, undisturbed, until the salmon just starts to release (some might say ooze) its fat (opaque mayonnaise-y stuff) and/or the flesh flakes easily, 10 to 15 minutes for most 1-inch-thick fillets. 3  Allow another 10 minutes for each extra inch of thicknes"}, {"url": "http://www.wikihow.com/Cook-Salmon-Fillet", "passage_text": "Place the bag with the marinade and salmon fillets in the refrigerator for 30 minutes. 1  Salmon, like all fish, is not as dense as red meats and poultry. 2  As a result, it does not need to be marinaded for long in order to absorb flavor. 3  Remove the salmon from the refrigerator at least 10 minutes prior to cooking. Preheat the grill. You can use both gas and charcoal grills to prepare salmon fillets. 1  If using a gas grill, preheat the grill to 450 degrees Fahrenheit (232 degrees Celsius). 2  If using a charcoal grill, spread a layer of charcoal onto the bottom of the grill and light."}, {"url": "http://www.foodnetwork.com/recipes/food-network-kitchens/pan-fried-salmon-recipe2.html", "passage_text": "Bring the salmon to room temperature 10 minutes before cooking. Warm a large nonstick skillet with oil over medium-low heat. Season the fish with salt and pepper. Raise the heat to medium-high. Place the salmon, skin-side up in the pan. Cook until golden brown on 1 side, about 4 minutes. Turn the fish over with a spatula, and cook until it feels firm to the touch and the skin is crisp if desired, about 3 minutes more. The skin can be served or removed easily with a knife or spoon"}]