[{"url": "http://www.youtube.com/watch?v=kCDaQLeAnqg", "passage_text": "How can I transfer photos and videos from my smartphone to my PC? If you use the camera of your smartphone, it can be very useful to transfer photos and videos to a computer on a regular interval. Copying photos and videos from the micro-SD Card in your phone to a computer, allows you to back up and use them on your PC for editing, sharing or viewing."}, {"url": "http://www.phototransferapp.com/android/", "passage_text": "Photo Transfer App for Android Devices. Transfer photos between your Android device and your computer as well as other Android or iOS devices using your Wi-Fi network. No cables or extra software required. Get it now on Google Play. "}, {"url": "http://acer--uk.custhelp.com/app/answers/detail/a_id/4564/~/transferring-photos-and-videos-from-an-android-smartphone-to-a-pc", "passage_text": "SOLUTION. Use the following steps to copy photos and videos from your phone to a computer: 1  Download and install the USB drivers for your smartphone on your computer. 2  More information. 3  Visit the Drivers and Manuals section of Acer support website. 4  Enter your Serial Number/SNID or search for your product by Model. "}, {"url": "http://acer-au.custhelp.com/app/answers/detail/a_id/4564/~/transferring-photos-and-videos-from-an-android-smartphone-to-a-pc", "passage_text": "SOLUTION. Use the following steps to copy photos and videos from your phone to a computer: 1  Download and install the USB drivers for your smartphone on your computer. 2  More information. 3  Visit the Download section of Acer support website. 4  Enter your model name, and select your product from the list of suggested models. "}, {"url": "http://www.jihosoft.com/phone-transfer/transfer-photos-videos-from-android-to-computer.html", "passage_text": "3.Click on “Backup Now” and select the backup folder, then all your Android photos and videos will be quickly transferred to the computer. Important Note: - Jihosoft Android Manager allows you transfer all data from Android to PC/Mac, including contacts, text messages, call logs, music, and apps. Connect you Android to the computer via USB cable. 2.Once your Android phone is detected by the program, click “Backup Your Phone” and select Photos and Videos from the listed data types."}, {"url": "http://www.transphone.net/android-transfer/photos-from-android-to-pc.html", "passage_text": "Run the software on your computer and connect your Android phone or tablet to computer with USB cable. The information of your device will be displayed as soon as it's detected, like the sample below. Step 2 Transfer photos from Android to computer. Click the Photos tab under your Android devices column. All the albums and photos are listed on the right window. Open the album then check the photos you want to backup. Click Export on the menu bar. Then navigate the path you desire to save."}, {"url": "http://www.android-sms-transfer.com/help/transfer-video-from-android-to-computer.html", "passage_text": "Go to the “Notifications Bar” on your Android’s screen and choose “USB Connected”. Step 3: Touch the “Turn on USB Storage” on the Notification Bar to transfer videos from Android phone to computer. Step 4: Open your Android’s storage drive on your computer. Drag the video file you want to transfer from your Android phone to PC. Save it in the target folder on your PC. Step 5: When Android video transfer is complete, go back to the “Notifications Bar”, lightly drag down and touch the “Turn Off USB Storage”. Step 3: Connect your Android phone to PC via USB cable. Then copy the text messages (.db file) to target folder on your PC. 1  How to Backup Android SMS in SD Card. 2  How to Transfer Text Messages from Android to PC. 3  How to Backup Android SMS as CSV File"}, {"url": "http://www.jihosoft.com/phone-transfer/transfer-photos-videos-from-android-to-computer.html", "passage_text": "1.Install and run Android Photo & Video Transfer. Connect you Android to the computer via USB cable. 2.Once your Android phone is detected by the program, click “Backup Your Phone” and select Photos and Videos from the listed data types."}, {"url": "http://www.jihosoft.com/phone-transfer/transfer-photos-videos-from-android-to-computer.html", "passage_text": "1.Connect your Android to the computer using a USB cable. 2.On the notification area, tap “USB connected” and then click Mount. Your computer recognize the SD card of your Android and display it as a removable disk. Connect you Android to the computer via USB cable. 2.Once your Android phone is detected by the program, click “Backup Your Phone” and select Photos and Videos from the listed data types."}]