[{"url": "http://www.rocketswag.com/travel/asia/laos/What-Type-Of-Government-Does-Laos-Have.html", "passage_text": "Though being a communist Laos was also referred to as the democracy of people and had a strong hold on factors such as traditions, politics and social behavior. The rich and influential people of the land ruled over the country and the people of lower strata served them. Every five years a president is elected on the basis of two-thirds of votes of the National Assembly and the President has the power to appoint or dismiss the prime minister or any other members of the government with the approval of the National Assembly."}, {"url": "http://www.rocketswag.com/travel/asia/laos/What-Type-Of-Government-Does-Laos-Have.html", "passage_text": "The type of Government that Laos has is Communist. Laos was a traditional society till the year 1975 and it was ruled by a handful of powerful family members after 1975 it became a communist country after the Lao People’s Democratic Republic was founded. Every five years a president is elected on the basis of two-thirds of votes of the National Assembly and the President has the power to appoint or dismiss the prime minister or any other members of the government with the approval of the National Assembly."}, {"url": "https://en.wikipedia.org/wiki/Economy_of_Laos", "passage_text": "The economy of the Lao Peoples' Democratic Republic is rapidly growing, as the government began to decentralise control and encourage private enterprise in 1986. In 1989, the PDR Lao government reached agreement with the World Bank and the International Monetary Fund on additional reforms. The government agreed to introduce fiscal and monetary reform, promote private enterprise and foreign investment, privatize or close state firms, and strengthen banking."}, {"url": "http://www.answers.com/Q/What_kind_of_government_does_Laos_have", "passage_text": "Laos is ruled the Pathet Lao, which is a Communist Party. Laos is  usually considered a single-party socialist republic, which is a  fancy way of saying communist in the w … ay that China and Vietnam  are Communist. 4 people found this useful. The Swiss Confederation(Switzerland) is currently ruled by a Federal Republic.   Answer 2 Switzerland is a confederation of 26 semi-independent cantons. A canton is equiva … lent to what is called a state in English-speaking federal countries. It has a very democratic system of government."}, {"url": "https://en.wikipedia.org/wiki/Economy_of_Laos", "passage_text": "Within a few years, the PDR Lao government realized these types of economic policies were preventing, rather than stimulating, growth and development. No substantive reform was introduced, however, until 1986 when the government announced its new economic mechanism (NEM). In 1989, the PDR Lao government reached agreement with the World Bank and the International Monetary Fund on additional reforms. The government agreed to introduce fiscal and monetary reform, promote private enterprise and foreign investment, privatize or close state firms, and strengthen banking."}, {"url": "http://www.rocketswag.com/travel/asia/laos/What-Type-Of-Government-Does-Laos-Have.html", "passage_text": "Approval of the local heads and the constitution which is communist makes it a different political culture in itself. The power remains with people who are significant and have a lot of clout and they in turn pass on the power to their families or to their friends. More Articles 1  : Capital Of Laos. 2  Laos Culture. Every five years a president is elected on the basis of two-thirds of votes of the National Assembly and the President has the power to appoint or dismiss the prime minister or any other members of the government with the approval of the National Assembly."}, {"url": "https://en.wikipedia.org/wiki/Laos", "passage_text": "Laos is a single-party socialist republic. It espouses Marxism and is governed by a single party communist politburo dominated by military generals. The Socialist Republic of Vietnam and the Vietnam People's Army continue to have significant influence in Laos. Laos is a multi-ethnic country with the politically and culturally dominant Lao people making up approximately 60% of the population, mostly in the lowlands."}, {"url": "http://www.answers.com/Q/What_kind_of_government_does_Laos_have", "passage_text": "Answer   Laos is in Southeast Asia, surrounded by Thailand, Myanmar, China,  Vietnam, and Cambodia.   Laos or Lao PDR is in South East Asia, It is only landlocked  c … ountry in the ASEAN countries. The Swiss Confederation(Switzerland) is currently ruled by a Federal Republic.   Answer 2 Switzerland is a confederation of 26 semi-independent cantons. A canton is equiva … lent to what is called a state in English-speaking federal countries. It has a very democratic system of government."}, {"url": "http://www.answers.com/Q/What_type_of_government_does_Laos_have", "passage_text": "Laos is usually considered a single-party socialist republic, which is a fancy way of saying communist in the way that China and Vietnam are Communist. Laos or Lao PDR is in South East Asia, It is only landlocked  c … ountry in the ASEAN countries. It is near China to the north,  Thailand to the west, Burma to the north west, Vietnam to the east  and Cambodia to the south. 1 person found this useful."}]