[{"url": "http://www.answers.com/Q/Why_is_oil_called_a_fossil_fuel", "passage_text": "They are called fossil fuels because, like fossils, they were  formed a long time ago. Oil for example is a fossil fuel, … it was  formed millions of years ago as dead animals and plants died they  formed a layer of dead stuff. Coal, petroleum,and natural gas, are called fossil fuels because  they were formed millions of years ago, during the Carboniferous  period."}, {"url": "http://www.answers.com/Q/What_are_the_fossil_fuels_and_why_are_they_called_fossil_fuels", "passage_text": "Confidence votes 117. Fossil fuels are coal, oil and natural gas. They are called fossil fuels because, like fossils, they were formed a long time ago. Oil for example is a fossil fuel, it was formed millions of years ago as dead animals and plants died they formed a layer of dead stuff. Over time this Dead Stuff had rock covered over it and consequently was put under lots of pressure, this caused it to turn into oil."}, {"url": "http://www.eschooltoday.com/energy/non-renewable-energy/what-is-non-renewable-energy.html", "passage_text": "Energy exists freely in nature. Some of them exist infinitely (never run out, called RENEWABLE), the rest have finite amounts (they took millions of years to form, and will run out one day, called NON-RENEWABLE). Non-renewable energy is energy from fossil fuels (coal, crude oil, natural gas) and uranium. Fossil fuels are made up mainly of carbon. When they are burned (used) they produce a lot of carbon compounds (carbon dioxide and other greenhouse gases) that hurt the environment in many ways. Air, water and land pollution are all consequences of using fossil fuels."}, {"url": "http://www.answers.com/Q/Why_is_oil_called_a_fossil_fuel", "passage_text": "Propane is called a fossil fuel because it was formed millions of years ago from the remains of tiny sea animals and plants.  Propane is one of the many fuels that are includ … ed in the liquefied petroleum (or LP-gas) family. Coal, petroleum,and natural gas, are called fossil fuels because  they were formed millions of years ago, during the Carboniferous  period."}, {"url": "http://www.answers.com/Q/What_are_the_fossil_fuels_and_why_are_they_called_fossil_fuels", "passage_text": "A fossil fuel is any hydrocarbon that may be used as a source of  energy. Coal, oil and natural gas are the three basic fossil fuels,  formed 300 million years ago from orga … nic plant and animal life  subjected to great heat and pressure under the ground. Oil for example is a fossil fuel, it was formed millions of years ago as dead animals and plants died they formed a layer of dead stuff. Over time this Dead Stuff had rock covered over it and consequently was put under lots of pressure, this caused it to turn into oil."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20070216032959AAjCVd5", "passage_text": "Answers. Relevance. Rating Newest Oldest. Best Answer: The reason coal, oil and natural gas are called fossil fuels is that they are formed from the fossilized remains of ancient plants & animals. With the right amount of heat and pressure (as well as a tremendous amount of time), these fossils will be converted into coal, oil, and natural gas. Source(s): "}, {"url": "http://tiki.oneworld.org/global_warming/fossil_fuels.html", "passage_text": "Oil, petroleum, natural gas, gasoline, petrol, coal, coke: all these are types of what people call 'fossil fuels'. So why are they called 'fossil fuels'? Because, like fossils of shells or plants which you can find in some rocks, they are old, often hundreds of millions of years old. "}, {"url": "http://www.energyquest.ca.gov/story/chapter08.html", "passage_text": "Where Fossil Fuels Come From. There are three major forms of fossil fuels: coal, oil and natural gas. All three were formed many hundreds of millions of years ago before the time of the dinosaurs – hence the name fossil fuels. The age they were formed is called the Carboniferous Period. It was part of the Paleozoic Era. Fossil fuels take millions of years to make. We are using up the fuels that were made more than 300 million years ago before the time of the dinosaurs. Once they are gone they are gone."}, {"url": "http://climatekids.nasa.gov/carbon/", "passage_text": "They're called fossil fuels because the fuel in your gas tank comes from the chemical remains of prehistoric plants and animals! All living things on Earth contain carbon. Even you contain carbon. Lots of it. "}]