[{"url": "http://goafrica.about.com/od/peopleandculture/a/swahili.htm", "passage_text": "Basic Swahili (Kiswahili) for travelers to Kenya, Tanzania and Uganda. Learn some Swahili (Kiswahili) and traveling in East Africa will be even more rewarding. Greetings, numbers, animals, transport and other basic phrases are covered in this article about Swahili. To find out more about the origins of Swahili, where Swahili is spoken, Swahili online courses, language schools and more; click here."}, {"url": "http://www.nation.co.ke/news/Alliance-is-KCSE-champ/-/1056/2641824/-/53mhg8z/-/index.html", "passage_text": "The national school in Kiambu County had a mean score of 11.402 and was followed by Maranda in Siaya County, which had a mean score of 11.401 and Kabarak, in Nakuru County with 11.358. Other schools that emerged among top performers were Mang’u, a national school in Kiambu County and Starehe Boys in Nairobi County. Maryhill School, which was ranked 9th nationally in 2013 with a mean score of 10.6919, dropped to 9.830 last year while Mang’u had a mean score of 10.751, up from 10.150 the previous year. Kabarak, Alliance at top of the table as exams results released. Machakos Girls High School students celebrate 2014 KCSE results in Machakos Town streets. The school emerged top in Machakos County with a mean grade of 9.45."}, {"url": "http://www.nation.co.ke/news/Alliance-is-KCSE-champ/-/1056/2641824/-/53mhg8z/-/index.html", "passage_text": "Boys also seemed to have fared far better than girls. Among the top performers were Kapsabet Boys of Nandi County with a mean score of 11.254, Maseno School with a mean score of 10.9. Mangu of Kiambu County with 10.751 and Lenana School in Nairobi. Kabarak, Alliance at top of the table as exams results released. Machakos Girls High School students celebrate 2014 KCSE results in Machakos Town streets. The school emerged top in Machakos County with a mean grade of 9.45."}, {"url": "http://www.masterfabricators.co.ke/our-products/master-starehe", "passage_text": "Master Starehe. STAREHE is a kiswahili word meaning COMFORT. The Starehe bus is ideal for upcountry, highway 2 x 2 reclining coaching. The buses are available in various models and body types. The buses features include: Starehe Medium Models. Click thumbnail to see larger photo. ............................................................................................................................"}, {"url": "http://allafrica.com/stories/200502281156.html", "passage_text": "It was also the best ranked private school. Alliance Boys High came third nationally after Starehe Boys' Centre and Strathmore school. Alliance recorded a mean score of 10.1923 in the KCSE examination results released yesterday. But schools that used to do well were nowhere in the charts or very low in the ranking. A case in point is Maragua's Njiiri's High School, which had a mean score of 7.8028. It took position 76 in the provincial category and did not make it to the top 100 schools in the country."}, {"url": "http://www.kachwanya.com/2013/12/21/samsung-galaxy-call-log-arrows/", "passage_text": "An arrow pointing away from the phone ought to mean that the call is going away from the phone hence outgoing whereas an arrow pointing inside the phone should mean that the call is from outside to the phone hence an incoming phone. Just interchange the arrow directions and I’ll be cool. "}, {"url": "http://www.freekcsepastpapers.com/free-starehe-boys-high-school-2015-mock-papers-and-answers/", "passage_text": "Free Starehe Boys High School 2015 Mock Papers and answers. by Joshua Arimi on August 22, 2015. Good news! Your one stop revision site – free kcse past papers.com is up and running. As way of welcoming you back, we are giving you Starehe Boys High School 2015 Mocks papers and answers for free! Download these papers for free from the link below. Starehe Boys High School. Wishing you the best as you revise. "}, {"url": "http://allafrica.com/stories/200502281156.html", "passage_text": "Nairobi — Starehe Boys Centre Director, Dr Geoffrey Griffin, literally had to walk through a 'sea' of congratulatory handshakes from jovial students after he announced the school's 2004 KCSE glory. But schools that used to do well were nowhere in the charts or very low in the ranking. A case in point is Maragua's Njiiri's High School, which had a mean score of 7.8028. It took position 76 in the provincial category and did not make it to the top 100 schools in the country."}, {"url": "https://en.wikipedia.org/wiki/Nairobi", "passage_text": "The name Nairobi comes from the Maasai phrase Enkare Nairobi, which translates to cool water. The phrase is also the Maasai name of the Nairobi river, which in turn lent its name to the city. However, it is popularly known as the Green City in the Sun, and is surrounded by several expanding villa suburbs. Nairobi was founded in 1899 by the colonial authorities in British East Africa, as a rail depot on the Uganda Railway. The town quickly grew to replace Machakos as the capital of Kenya in 1907. After independence in 1963, Nairobi became the capital of the Republic of Kenya."}, {"url": "http://allafrica.com/stories/200502281156.html", "passage_text": "Keeping with the tradition, students at Starehe Boys' Centre received news of their victory in last year's Kenya Certificate of Secondary Examinations (KCSE) with screams of joy. But schools that used to do well were nowhere in the charts or very low in the ranking. A case in point is Maragua's Njiiri's High School, which had a mean score of 7.8028. It took position 76 in the provincial category and did not make it to the top 100 schools in the country."}]