[{"url": "https://en.wikipedia.org/wiki/Ninth_Amendment_to_the_United_States_Constitution", "passage_text": "The Bill of Rights in the National Archives. The Ninth Amendment (Amendment IX) to the United States Constitution, which is part of the Bill of Rights, addresses rights, retained by the people, that are not specifically enumerated in the Constitution. Thus, the Ninth Amendment originally applied only to the federal government, which is a government of enumerated powers. Some jurists have asserted that the Ninth Amendment is relevant to interpretation of the Fourteenth Amendment."}, {"url": "https://en.wikipedia.org/wiki/Ninth_Amendment_to_the_United_States_Constitution", "passage_text": "The Supreme Court held in Barron v. Baltimore (1833) that the Bill of Rights was enforceable by the federal courts only against the federal government, and not against the states. Thus, the Ninth Amendment originally applied only to the federal government, which is a government of enumerated powers. Some jurists have asserted that the Ninth Amendment is relevant to interpretation of the Fourteenth Amendment."}, {"url": "http://kids.laws.com/ninth-amendment", "passage_text": "Today, the Ninth Amendment is used mainly to stop the government from expanding their power rather than just limiting their power. Sometimes, courts try to use the Ninth Amendment as a way to provide and enforce rights that are not actually talked about in the Constitution. A Guide to the Ninth Amendment. The Ninth Amendment, or Amendment IX of the United States Constitution is the section of the Bill of Rights that states that there are other rights that may exist aside from the ones explicitly mentioned, and even though they are not listed, it does not mean they can be violated."}, {"url": "https://en.wikipedia.org/wiki/Tenth_Amendment_to_the_United_States_Constitution", "passage_text": "The Tenth Amendment (Amendment X) to the United States Constitution, which is part of the Bill of Rights, was ratified on December 15, 1791.he Bill of Rights in the National Archives. The powers not delegated to the United States by the Constitution, nor prohibited by it to the States, are reserved to the States respectively, or to the people."}, {"url": "http://www.ff.org/the-tenth-amendment-protecting-freedom-against-big-government/", "passage_text": "The Tenth Amendment: “The powers not delegated to the United States by the Constitution, nor prohibited by it to the States, are reserved to the States respectively, or to the people.”. The Tenth Amendment protects Americans from big, intrusive federal government action."}, {"url": "http://kids.laws.com/ninth-amendment", "passage_text": "The Ninth Amendment of the Bill of Rights was put into the United States Constitution on September 5, 1789 and was voted for by 9 out of 12 states on December 15, 1791. A Guide to the Ninth Amendment. The Ninth Amendment, or Amendment IX of the United States Constitution is the section of the Bill of Rights that states that there are other rights that may exist aside from the ones explicitly mentioned, and even though they are not listed, it does not mean they can be violated."}, {"url": "https://answers.yahoo.com/question/index?qid=20090106162718AAcY0Bb", "passage_text": "Report Abuse. They grant all rights not stated in the Constitution and not the government. It's interesting that people have used the 9th Amendment in the gun rights argument. Protestants were allowed to own and carry firearms under the English Bill of Rights of 1689. Jordan A · 7 years ago."}, {"url": "https://answers.yahoo.com/question/index?qid=20090106162718AAcY0Bb", "passage_text": "Aced it, it limits it like this: 9th Translation: The rights listed in the Constitution are not the only rights that people may have. 10th Translation: The rights that AREN'T listed in the Constitution are to be figured out by the states and people of the county. They grant all rights not stated in the Constitution and not the government. It's interesting that people have used the 9th Amendment in the gun rights argument. Protestants were allowed to own and carry firearms under the English Bill of Rights of 1689. Jordan A · 7 years ago."}, {"url": "http://tenthamendmentcenter.com/2009/04/26/the-ninth-amendment-the-tenths-partner/", "passage_text": "The 9th amendment's focus is on the people and it clarifies that the people's rights are not limited to those in the list. The 10th amendment's focus is on the federal government and makes it clear that the federal government has no power that is not listed in the Constitution.f you sometimes read the word “rights” in the Ninth Amendment as “powers” and “powers in the Tenth Amendment as “rights,” you can better understand their meaning. Few parts of the Constitution have been so misunderstood as the Ninth Amendment."}, {"url": "http://tenthamendmentcenter.com/2009/04/26/the-ninth-amendment-the-tenths-partner/", "passage_text": "The Ninth Amendment states, The enumeration in the Constitution, of certain rights, shall not be construed to deny or disparage others retained by the people.” It was designed to work with the Tenth Amendment to reinforce limits on the federal government. If you sometimes read the word “rights” in the Ninth Amendment as “powers” and “powers in the Tenth Amendment as “rights,” you can better understand their meaning. Few parts of the Constitution have been so misunderstood as the Ninth Amendment."}]