[{"url": "http://www.diynetwork.com/how-to/outdoors/gardening/how-to-grow-malabar-spinach", "passage_text": "Malabar spinach is a climbing plant that can reach 8' to 10' in height. Purchase or construct a support on which the plant can climb and place it in the garden site. Malabar spinach is a vining tropical plant that is grown as an annual in cooler climates. It is cultivated for its edible stems and leaves. There are two main varieties: red-stemmed and white-stemmed. This fast-growing leafy vegetable is easily started from seed sown directly in the garden."}, {"url": "http://www.rodalesorganiclife.com/garden/why-your-spinach-isnt-sweet-it-could-be", "passage_text": "Planting. Spinach does best when growing in moist, nitrogen-rich soil. Spinach plants form a deep taproot; for best growth, loosen the soil at least 1 foot deep before planting. Sow spinach seed as early as six weeks before the last frost or as soon as you can work the soil. Prepare the soil the previous autumn, and you can drop the seeds in barely thawed ground"}, {"url": "http://gardening.about.com/od/vegetables/a/Growing_Spinach.htm", "passage_text": "Growing Notes: Planting: You can start spinach indoors or direct seeded in the garden as soon as the soil is workable. Spinach grows quite quickly, so don't start plants indoors more than a 2-3 weeks before you plant to transplant them out. "}, {"url": "https://myfolia.com/plants/7-spinach-spinacia-oleracea", "passage_text": "Spinach grows as an annual and is an edible vegetable / herb. Being an annual plant, it tends to grow best over the course of a single year. Spinach is known for its spreading habit and growing to a height of approximately 60.0 cm (1.95 feet). Popular varieties of Spinach with home gardeners are Bloomsdale long standing, Bloomsdale, Tyee, Teton Hybrid and Giant Nobel. Spinach is a compact green, loose-leaf plant that grows up to about 30cm tall. It is grown for its oval to triangular leaves, which can be eaten either raw or cooked. It is a cool-season plant."}, {"url": "http://www.motherearthnews.com/organic-gardening/learn-how-to-grow-spinach-zmaz08onzgoe.aspx", "passage_text": "Learn How to Grow Spinach. Prepare the planting bed by loosening the soil at least 10 inches deep. Thoroughly mix in compost along with alfalfa meal, soybean meal or another high-nitrogen organic fertilizer (follow label directions). Sow seeds a half-inch deep and 2 inches apart, in rows spaced at least 8 inches apart. Spinach plants can be male or female. Male plants quickly grow tall and release pollen from clusters of fringe-like structures, while females are stockier and hold their flower clusters close to the main stem. If you save seeds, allow seed-bearing plants to stand in the garden until they begin to dry."}, {"url": "http://www.gardeningknowhow.com/edible/vegetables/chaya/growing-chaya-plants.htm", "passage_text": "Chaya spinach tree is actually a big leafy shrub that reaches a height of from 6-8 feet and resembles a cassava plant or healthy hibiscus, with 6-8 inch cupped leaves borne on slender stems. Growing tree spinach shrubs bloom often with both male and female flowers that are tiny and white resulting in 1-inch seed pods. "}, {"url": "http://www.bhg.com/gardening/plant-dictionary/vegetable/spinach/", "passage_text": "The nutritious leaves of spinach are loaded with iron, calcium, protein, and vitamin A. Plant this cool-season crop in early spring or late summer. Spinach. Spinacia oleracea. Growing spinach is one of the most rewarding gardening experiences. Tender young spinach, picked fresh from the garden, has no equal -- certainly not in the supermarket. You might not even recognize homegrown spinach as spinach! Use spinach fresh in salads."}, {"url": "http://www.grow-it-organically.com/growing-spinach.html", "passage_text": "Spinach Plant Spacing. When planting spinach in a single-dug or tilled bed (soil loosened 8-10” --20-25 cm--deep), plant spinach in rows 12” (30 cm) apart. Sow seeds ½” (1.3 cm) deep every 6” (15 cm) along the row, or sow more seeds and thin to this spacing. Cover with ½” (1.3 cm) of fine mulch. For baby spinach, sow in a 3-4” (7-10 cm) band on ¾” (2 cm) centers, 40-50 seeds per foot. Harvest in 3-5 weeks. When growing spinach in a deep-dug or raised garden bed (soil loosened 20-24”--50-60 cm deep), plant spinach on 8” (20 cm) centers (seeds or seedlings 8” (20 cm) apart in every direction)."}]