[{"url": "http://apparelyzed.com/spinalcord.html", "passage_text": "Spinal Nerves. Nerves called the spinal nerves or nerve roots, branch off the spinal cord and pass out through a hole in each of the vertebrae called the foramen. These nerves carry information from the spinal cord to the rest of the body, and from the body back up to the brain. The nerves which exit the spinal cord in the mid and lower section of the back, control the trunk and legs, as well as bladder, bowel and sexual function. The nerves which carry information from the brain to muscles are called motor neurones."}, {"url": "http://www.spine-health.com/conditions/spine-anatomy/spinal-cord-and-spinal-nerve-roots", "passage_text": "The spinal cord does not run through the lumbar spine (lower back). After the spinal cord stops in the lower thoracic spine, the nerve roots from the lumbar and sacral levels come off the bottom of the cord like a horse's tail (cauda equina) and exit the spine (view the spinal nerve roots with Figure 1). The spinal cord can be divided into segments according to the nerve roots that branch off of it. Nerves along the cord consists of 8 cervical nerves, 12 thoracic nerves, 5 lumbar nerves, 5 sacral nerves, and 1 coccygeal nerve. The nerve roots run through the bony canal, and at each level a pair of nerve roots exits from the spine. Article continues below. 1  Cervical spine nerve roots"}, {"url": "http://medical-dictionary.thefreedictionary.com/spinal+nerve", "passage_text": "spinal nerve. Any of the 31 sets of nerves originating in the spinal cord and emerging from the spinal canal through intervertebral foramina. Each spinal nerve is the concatenation of two sets of axons that emerge separately from the spinal cord: sensory axons (the dorsal root) and motor axons (the ventral root). See: illustration. Sensations of heat, cold, pressure and pain are conveyed by the sensory nerves. Motor nerves, or efferent nerves, transmit impulses from the brain and spinal cord to the periphery, especially the muscles. Mixed nerves are composed of both motor and sensory fibers, and transmit messages in both directions"}, {"url": "http://www.healthpages.org/anatomy-function/spinal-nerves/", "passage_text": "The spinal cord is the continuation of the brainstem, it lies protected within the vertebral column of the spine. A spinal nerve is any of the 31 pairs of nerves that arise from the spinal cord. The spinal nerves are named according to where it emerges and passes through the bones in the spinal vertebrae. As you can see in the image to the left, the nerve roots (in red) come off the spinal cord and out to the rest of the body between the vertebra."}, {"url": "http://neuroscience.uth.tmc.edu/s2/chapter03.html", "passage_text": "The spinal cord is the most important structure between the body and the brain. The spinal cord extends from the foramen magnum where it is continuous with the medulla to the level of the first or second lumbar vertebrae. It is a vital link between the brain and the body, and from the body to the brain. The spinal cord is 40 to 50 cm long and 1 cm to 1.5 cm in diameter. Two consecutive rows of nerve roots emerge on each of its sides. These nerve roots join distally to form 31 pairs of spinal nerves. "}, {"url": "http://www.healthpages.org/anatomy-function/spinal-nerves/", "passage_text": "The nervous system is divided into two systems. The Central Nervous System which is the brain and the spinal cord, and the Peripheral Nervous System which is the 12 cranial nerves, 31 pairs of spinal nerves and ganglia. The Peripheral Nervous System provides communication between the brain and spinal cord and the body’s muscles, glands and sensory receptors. The spinal nerves are named according to where it emerges and passes through the bones in the spinal vertebrae. As you can see in the image to the left, the nerve roots (in red) come off the spinal cord and out to the rest of the body between the vertebra."}, {"url": "http://www.saylor.org/site/wp-content/uploads/2013/05/Boundless.coms-Spinal-Nerves.pdf", "passage_text": "The spinal nerves are part of the peripheral nervous system (PNS). Location: Each spinal nerve is formed by the combination of nerve fibers from the dorsaland ventral roots of the spinal cord (Figure 0). The dorsal roots carry afferent sensory axons, while the ventral roots carry efferent motor axons.  Mixed Spinal Nerve: The term spinal nerve generally refers to a mixed spinal nerve, which carries motor, sensory, and autonomic signals between the spinal cord and the body. The peripheral nervous system (PNS) consists of the nerves and ganglia outside of the brain and spinal cord."}]