[{"url": "http://www.collegeatlas.org/nurse-salaries.html", "passage_text": "Nurses with 10 to 19 years of neonatal nursing experience earn high annual salaries, averaging between $80,901 and $104,313 per year. The most experienced neonatal nurse practitioners, 20 or more years of work experience, on average earn more than $111,000 per year. When contemplating a career in nursing, one of the factors that should be considered is that of a nurse’s salary and benefits. According to the Bureau of Labor Statistics, the median annual wage for a registered nurse in 2013 was approximately $65,470."}, {"url": "http://www.lpn.com/types-of-nurses/labor-delivery-nurse/", "passage_text": "Salary. The average yearly salary for a nurse specializing in labor and delivery is approximately $55,000 a year. A labor and delivery nurse who has several years of experience can expect to make closer to $70,000 or more. Those nurses with a master’s degree or higher can also make a significantly higher annual salary. The annual pay level for a labor and delivery nurse is often higher in metropolitan areas verses rural areas."}, {"url": "http://work.chron.com/much-baby-delivery-nurses-make-22504.html", "passage_text": "Average Pay for RNs. According to the Bureau of Labor Statistics, registered nurses in all specialties earned an average of $67,930 per year as of 2012. Half of all RNs made between $25.80 and $37.84 per hour and reported annual earnings ranging from $53,670 to $78,700 per year. Those working in the Southeast earned an average of $64,700 per year as of 2011, according to ADVANCE. Those in the Mid-Atlantic and Great Lakes States averaged $70,618 per year, while specialty-certified maternal-child nurses working in the Midwest earned an average salary of $71,000."}, {"url": "http://www.collegeatlas.org/nurse-salaries.html", "passage_text": "A Labor and delivery nurse’s salary can span a wide range, making it a bit more difficult to pinpoint just how much Labor and Delivery nurses make. On average, their salaries are set anywhere from $40,000 to 90,000 per year depending on experience, education, employer and location. When contemplating a career in nursing, one of the factors that should be considered is that of a nurse’s salary and benefits. According to the Bureau of Labor Statistics, the median annual wage for a registered nurse in 2013 was approximately $65,470."}, {"url": "http://www.healthcare-salaries.com/nursing/labour-and-delivery-nurse-salary", "passage_text": "Average labour and delivery nurse salary. The median wage of Labour and Delivery Nurse in the United States is around $59,725 per annum. The hourly average of Labour and Delivery Nurse is from $20.21 to $39.07 while the average overtime is from $10.07 to $60.82. A Labour and Delivery Nurse in the US can earn a top yearly bonus of $2,031. Labour and Delivery Nurse with 10 to 19 years of experience earn from $25.78 – $43.89 per hour and those with 20 plus years of experience earn from $21.96 – $41.11 per hour. labour and delivery nurse salary."}, {"url": "http://www.ehow.com/info_8223601_much-delivery-nurses-make-year.html", "passage_text": "Pay By Metropolitan Area. The top-paying metropolitan area for labor and delivery nurses in 2009 was Visalia-Porterville, CA, which paid an average of $111,030 a year, according to the U.S. Bureau of Labor Statistics. National Pay. The average pay for labor and delivery nurses in the United States in 2009 was $66,530 a year, according to the U.S. Bureau of Labor Statistics. This is a 6.5 percent increase since 2007."}, {"url": "http://www.healthcare-salaries.com/nursing/labour-and-delivery-nurse-salary", "passage_text": "A newly practicing labour and delivery nurse can receive a starting yearly minimum salary of $45,000. As labour and delivery nurse gains more years experience the salary increases considerably. A Labour and Delivery Nurse practicing for 10-19 years can receive up to $120,000 salary including perk/benefits and bonuses. Labour and Delivery Nurse with 10 to 19 years of experience earn from $25.78 – $43.89 per hour and those with 20 plus years of experience earn from $21.96 – $41.11 per hour. labour and delivery nurse salary."}, {"url": "http://www.collegeatlas.org/nurse-salaries.html", "passage_text": "Annual salaries for pediatric nurses are also influenced by specialization. For example, labor and delivery pediatric nursing specialists typically earn anywhere from $24,000 to 65,000 annually. Acute care specialists earn the highest annual salaries among pediatric nurses, $50,000 to 75,000 per year. When contemplating a career in nursing, one of the factors that should be considered is that of a nurse’s salary and benefits. According to the Bureau of Labor Statistics, the median annual wage for a registered nurse in 2013 was approximately $65,470."}]