[{"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-1092-COCONUT%20OIL.aspx?activeIngredientId=1092&activeIngredientName=COCONUT%20OIL", "passage_text": "The oil of the nut (fruit) is used to make medicine. Some coconut oil products are referred to as “virgin” coconut oil. Unlike olive oil, there is no industry standard for the meaning of “virgin” coconut oil. The term has come to mean that the oil is generally unprocessed. For example, virgin coconut oil usually has not been bleached, deodorized, or refined."}, {"url": "http://www.foodrenegade.com/how-to-choose-a-good-coconut-oil/", "passage_text": "In general, the coconut oil available in most stores can get quite pricey. (And, it’s not very likely to be a good product!) The way to really save money on coconut oil is to buy it in bulk. I buy anywhere from a gallon to five gallons at a time."}, {"url": "http://www.huffingtonpost.com/2012/06/27/coconut-oil-benefits_n_1625631.html", "passage_text": "Coconut oil commonly gets namedropped as the latest super-good-for-you miracle product. Admittedly, a year ago we'd barely heard of coconut oil. Maybe in our vegetable green curry or as an ingredient relegated to the shelves of the local health food store, but not something we were putting on our face."}, {"url": "http://www.foodrenegade.com/how-to-choose-a-good-coconut-oil/", "passage_text": "Consider this your definitive guide to how to choose a good coconut oil. The two most broad categories of coconut oil are refined and unrefined. Once you choose whether or not you want a refined or unrefined coconut oil, you’ll need to choose which method of extraction suits your tastes and purposes."}, {"url": "http://www.webmd.com/diet/coconut-oil-and-health", "passage_text": "Coconut oil, according to recent reports, is the latest food cure-all. Claims abound that coconut oil is a health food that can cure everything from poor immune function, thyroid disease, and heart disease, to obesity, cancer, and HIV."}, {"url": "http://www.foodrenegade.com/how-to-choose-a-good-coconut-oil/", "passage_text": "For example, let’s say you decided you want an expeller-pressed, refined coconut oil. You can find a good quality one that’s been refined using a natural, chemical-free cleaning process and and a relatively low-temperature extraction."}, {"url": "http://www.foodrenegade.com/how-to-choose-a-good-coconut-oil/", "passage_text": "An unrefined coconut oil is typically labeled “virgin” or “extra-virgin.” To my knowledge, there’s not any consistent difference between virgin and extra-virgin coconut oils across all brands."}, {"url": "http://www.webmd.com/diet/coconut-oil-and-health", "passage_text": "Like all fats, coconut oil is a blend of fatty acids. Coconut oil contains an unusual blend of short and medium chain fatty acids, primarily lauric (44%) and myristic (16.8%) acids. It is this unusual composition that may offer some health benefits."}]