[{"url": "http://www.blackpast.org/gah/songhai-empire-ca-1375-1591", "passage_text": "The Songhai Empire was the largest and last of the three major pre-colonial empires to emerge in West Africa. From its capital at Gao on the Niger River, Songhai expanded in all directions until it stretched from the Atlantic Ocean (modern Senegal and Gambia) to what is now Northwest Nigeria and central Niger. Gao, Songhai’s capital, which remains to this day a small Niger River trading center, was home to the famous Goa Mosque and the Tomb of Askia, the most important of the Songhai emperors. The cities of Timbuktu and Djenne were the other major cultural and commercial centers of the empire."}, {"url": "https://en.wikipedia.org/wiki/Songhai_Empire", "passage_text": "The Songhai Empire, also spelled as the Songhay Empire, was a Songhai state that dominated the western Sahel in the 15th and 16th century. At its peak the empire was one of the largest in African history. Songhai rulers subsequently took advantage of the weakened Mali Empire to expand Songhai rule. Under the rule of Sonni Ali, the Songhai surpassed the Malian Empire in area, wealth, and power, absorbing vast areas of the Mali Empire and reached its greatest extent."}, {"url": "http://chnm.gmu.edu/fairfaxtah/lessons/documents/africaPOSinfo.pdf", "passage_text": "The Empire of Mali was founded in the mid 1200s and lasted through the late 1400s. Ancient Mali was located in western Sudan. The name Mali means “where the king resides” or “hippopotamus.” The people of Mali were called Mandinkas, Malinkes, or Mandingoes. GHANA Ghana was the first great African empire of the western Sudan. Historians believe that a group of people called the Soninke founded Ghana as early as the year 300 and it thrived until around 1200. Ghana became known for its rich culture, wealth, organization, and power."}, {"url": "http://www.answers.com/Q/Which_river_is_located_were_the_songhai_empire_was_located", "passage_text": "West Africa The Songhay Empire was located in West Africa from about 1340 to 1590, named after the predominant ethnic group of the region. See the link below for a map o … f the region and additional information. Where are Egypt-Ghana-Mali and Songhai kingdoms located? Answer   All states are located in Africa [west-noth west] except Egypt who extends to both Africa [north east] and Asia with the greatest history in the past already 6 … .000 years old."}, {"url": "http://www.youtube.com/watch?v=9W67Od8oVgc", "passage_text": "This video gives a brief description of the Songhai Empire of west Africa. The Songhai Empire was a state located in western Africa. From the early 15th to the late 16th century, Songhai was one of the largest Islamic empires in history. This empire bore the same name as its leading ethnic group, the Songhai. Its capital was the city of Gao, where a Songhai state had existed since the 11th century. Its base of power was on the bend of the Niger River in present day Niger and Burkina Faso."}, {"url": "http://thesonghaycivilization.weebly.com/", "passage_text": "\\\\n \\\\n. The Songhai Empire, also known as the Songhay Empire, was a state located in western Africa. From the early 15th to the late 16th century, Songhai was one of the largest African empires in history. This empire bore the same name as its leading ethnic group, the Songhai. Its capital was the city of Gao, where a small Songhai state had existed since the 11th century. Its base of power was on the bend of the Niger River in present day Niger and Burkina Faso."}, {"url": "http://www.answers.com/Q/Where_was_the_Songhai_Empire", "passage_text": "Making the world better, one answer at a time. West Africa. The Songhay Empire was located in West Africa from about 1340 to 1590, named after the predominant ethnic group of the region. See the link below for a map of the region and additional information. "}, {"url": "https://en.wikipedia.org/wiki/Songhai_Empire", "passage_text": "Sonni Ali established Gao as the capital of the empire, although a Songhai state had existed in and around Gao since the 11th century. Songhai rulers subsequently took advantage of the weakened Mali Empire to expand Songhai rule. Under the rule of Sonni Ali, the Songhai surpassed the Malian Empire in area, wealth, and power, absorbing vast areas of the Mali Empire and reached its greatest extent."}, {"url": "http://www.timemaps.com/civilization/African-kingdoms", "passage_text": "Overview. The Songhai Empire, also known as the Songhay Empire, was a state located in western Africa. From the early 15th to the late 16th century, Songhai was one of the largest Islamic empires in history. This empire bore the same name as its leading ethnic group, the Songhai. - Decline of the Songhai Empire. History Atlas: Maps of Africa. Ghana Empire. Overview. The Ghana Empire or Wagadou Empire (existed before c. 830 until c. 1235) was located in what is now southeastern Mauritania, and Western Mali."}, {"url": "http://www.answers.com/Q/Which_river_is_located_were_the_songhai_empire_was_located", "passage_text": "The Mughal Empire was located in India, the Songhai Empire in West Africa and the Ottoman Empire was located across South East Europe, North East Africa and a bit of Asia. 13 people found this useful. Edit. Where are Egypt-Ghana-Mali and Songhai kingdoms located? Answer   All states are located in Africa [west-noth west] except Egypt who extends to both Africa [north east] and Asia with the greatest history in the past already 6 … .000 years old."}]