[{"url": "https://www.stgeorge.com.au/personal/bank-accounts/tools/faqs/using-your-account", "passage_text": "You can usually withdraw up to $1,000 each day via ATMs and EFTPOS or up to $8,000 per day on purchases, provided your account contains sufficient cleared funds, and you have not reached any other limits for transactions that apply to your account."}, {"url": "https://www.asb.co.nz/help/is-there-a-limit-to-how-much-i-can-spend-or-withdraw-on-my-card.html", "passage_text": "Yes. For your security there is. There are different daily limits for different cards. The transaction limits for ASB FastCash and Visa Debit cards are: 1  Purchases: Up to NZ$5,000 per card, per day. 2  Cash withdrawals (ATMs and EFTPOS): Up to NZ$2"}, {"url": "http://www.anz.co.nz/personal/ways-bank/eftpos-visa-debit-card/", "passage_text": "An ANZ EFTPOS card allows you to access funds from your ANZ everyday and savings accounts 24 hours a day, seven days a week. With your ANZ EFTPOS card you can make purchases using EFTPOS at retail outlets or withdraw funds and check your account balances at our network of ATMs throughout New Zealand."}, {"url": "https://www.commbank.com.au/support/faqs/137.html", "passage_text": "Your daily withdrawal limit is the total amount you can withdraw each day from all accounts that are linked to that card. Daily cash withdrawal limits are as follows (unless you have changed it): Keycards. 1  AUD$800, if issued before 28 July 2008. 2  AUD$1000, if issued after"}, {"url": "http://www.westpac.com.au/travel-centre/access-money-overseas/atms/", "passage_text": "1 When using a debit card, a $5 ATM withdrawal fee applies when you withdraw money from an ATM which is not part of the Global ATM Alliance network or a Westpac Group partner. 2  Westpac does not charge a fee for checking your account balance. 3  Some overseas banks may apply a fee for withdrawals and/or balance checks."}, {"url": "http://www.suncorpbank.com.au/faq/what-maxiumum-daily-withdrawal-my-cash-card-or-visa-debit-card", "passage_text": "What is the maxiumum daily withdrawal on my cash card or Visa Debit card? The combined cash out and withdrawal limit for ATMs and EFTPOS is $1,000 per day per card."}, {"url": "http://www.nab.com.au/personal/help-and-guidance/ways-to-bank/eftpos", "passage_text": "EFTPOS lets you pay for goods or services, including petrol and groceries, directly from your NAB deposit accounts or credit card. You can usually withdraw cash at the same time, so you don't have to go to a branch or NAB ATM."}, {"url": "https://www.commbank.com.au/support/faqs/137.html", "passage_text": "If you have your account linked to two cards, say a Keycard and a Debit MasterCard, you can withdraw up to each daily withdrawal limit per card per day. To confirm your current daily card limit or ask for a different limit, you can: 1  Log on to NetBank, 'More' tab, select 'Manage my accounts' and then select 'Change my daily card withdrawal limit'. 2  Call 13 2221, 24 hours a day, 7 days a week, OR."}]