[{"url": "http://heartbleed.com/", "passage_text": "Bug is in the OpenSSL's implementation of the TLS/DTLS (transport layer security protocols) heartbeat extension (RFC6520). When it is exploited it leads to the leak of memory contents from the server to the client and from the client to the server."}, {"url": "http://www.cnet.com/news/heartbleed-bug-what-you-need-to-know-faq/", "passage_text": "The Heartbleed bug, a newly discovered security vulnerability that puts users' passwords at many popular Web sites at risk, has upended the Web since it was disclosed earlier this week. It's an extremely serious issue, and as such, there's a lot of confusion about the bug and its implications as you use the Internet."}, {"url": "http://heartbleed.com/", "passage_text": "The Heartbleed bug allows anyone on the Internet to read the memory of the systems protected by the vulnerable versions of the OpenSSL software. This compromises the secret keys used to identify the service providers and to encrypt the traffic, the names and passwords of the users and the actual content."}, {"url": "http://money.cnn.com/2014/04/09/technology/security/heartbleed-bug/index.html", "passage_text": "It's called the Heartbleed bug, and it is essentially an information leak. It starts with a hole in the software that the vast majority of websites on the Internet use to turn your personal information into strings of random numbers and letters."}, {"url": "http://www.cnn.com/2014/04/08/tech/web/heartbleed-openssl/index.html", "passage_text": "A major online security vulnerability dubbed Heartbleed could put your personal information at risk, including passwords, credit card information and e-mails. Heartbleed is a flaw in OpenSSL, an open-source encryption technology that is used by an estimated two-thirds of Web servers. It is behind many HTTPS sites that collect personal or financial information."}, {"url": "http://heartbleed.com/", "passage_text": "The Heartbleed Bug. The Heartbleed Bug is a serious vulnerability in the popular OpenSSL cryptographic software library. This weakness allows stealing the information protected, under normal conditions, by the SSL/TLS encryption used to secure the Internet."}, {"url": "http://www.thewire.com/technology/2014/04/what-you-need-to-know-about-heartbleed-the-new-security-bug-scaring-the-internet/360366/", "passage_text": "Heartbleed is a security vulnerability in OpenSSL, a popular, open-source protocol used to encrypt vast portions of the web. It's used to protect your usernames, passwords, and sensitive information set on secure websites."}]