[{"url": "https://en.wikivoyage.org/wiki/Larissa", "passage_text": "The cost from the airport to Volos Bus station is 3 €. Then you need to get another bus or train from Volos to Larissa. The bus station in Volos is about 1 km from the train station. The nearest airport offering year-round international service is in Thessaloniki (SLK) about 2.5 hours away. "}, {"url": "http://www.travelmath.com/nearest-airport/Larisa,+Greece", "passage_text": "Nearest major airport to Larisa, Greece: The closest major airport to Larisa, Greece is Nea Anchialos National Airport (VOL / LGBL). This airport is in Volos, Greece and is 69 km from the center of Larisa, Greece. If you're looking for international or domestic flights to VOL, check the airlines that fly to VOL."}, {"url": "https://en.wikipedia.org/wiki/List_of_airports_in_Greece", "passage_text": "Map of Greek airports. This is a list of airports in Greece, grouped by type and sorted by location. Greece, officially the Hellenic Republic, is a country in southeastern Europe, situated on the southern end of the Balkan Peninsula. The Aegean Sea lies to the east of mainland Greece, the Ionian Sea to the west, and the Mediterranean Sea to the south. Greece is divided into 13 regions (the official regional administrative divisions), including nine on the mainland and four island groups. The regions are further subdivided into 74 regional units."}, {"url": "http://www.closestairportto.com/city/greece/larisa/", "passage_text": "Closest Airport to Larisa. Lárisa the closest airport Is Filippos (AIRPORT). Kzi distance From Filippos airport To larisa lárisa,is 87 (5,kilometers 54). 4 miles The closest airport is Filippos Airport (KZI). Distance from Filippos Airport to Larisa lárisa is,87 5 (kilometers,54 4). miles"}, {"url": "http://wikitravel.org/en/Larissa", "passage_text": "The cost from the airport to Volos Bus station is 3 €. Then you need to get another bus or train from Volos to Larissa. The bus station in Volos is about 1 km from the train station. The nearest airport offering year-round international service is in Thessaloniki (SLK) about 2 1/2 hours away. Larissa (Greek λάρισα) (Population: 200.000 (2011)) is the 4th biggest city in Greece capital of Prefecture of Larissa and region of Thessaly. Larissa is from Athens (355 km) and Thessaloniki (150 km). A lively agricultural and university town, it is visited by few tourists."}, {"url": "http://www.travelmath.com/nearest-airport/Larissa,+Greece", "passage_text": "Nearest major airport to Larissa, Greece: The closest major airport to Larissa, Greece is Nea Anchialos National Airport (VOL / LGBL). This airport is in Volos, Greece and is 71 km from the center of Larissa, Greece. If you're looking for international or domestic flights to VOL, check the airlines that fly to VOL. International airports near Larissa, Greece. 71 km: Volos, Greece (VOL / LGBL) Nea Anchialos National Airport. 167 km: Thessaloniki, Greece (SKG / LGTS) Thessaloniki International Airport. 215 km: Corfu, Greece (CFU / LGKR) Corfu International Airport."}]