[{"url": "http://science.howstuffworks.com/environmental/green-science/carbon-footprint.htm", "passage_text": "But while actual footprints offer details on size, weight and speed, carbon footprints measure how much carbon dioxide (CO2) we produce just by going about our daily lives. A drive to work, a flip of a light switch and a flight out of town all rely on the combustion of fossil fuels like oil, coal and gas. Some start by calculating their carbon footprint to set a benchmark -- like a weigh-in before a diet. A carbon footprint is simply a figure -- usually a monthly or annual total of CO2 output measured in tons."}, {"url": "http://www.takepart.com/flashcards/what-is-a-carbon-footprint", "passage_text": "A carbon footprint is the amount of greenhouse gases—primarily carbon dioxide—released into the atmosphere by a particular human activity. A carbon footprint can be a broad meaasure or be applied to the actions of an individual, a family, an event, an organization, or even an entire nation. You can't control everything, but being conscious of your carbon footprint helps. A carbon footprint is the amount of greenhouse gases produced"}, {"url": "https://en.wikipedia.org/wiki/Carbon_footprint", "passage_text": "A carbon footprint is historically defined as the total sets of greenhouse gas emissions caused by an organization, event, product or individual.. The total carbon footprint cannot be calculated because of the large amount of data required and the fact that carbon dioxide can be produced by natural occurrences. Once the size of a carbon footprint is known, a strategy can be devised to reduce it, e.g. by technological developments, better process and product management, changed Green Public or Private Procurement (GPP), carbon capture, consumption strategies, carbon offsetting and others."}, {"url": "https://carbonfund.org/reduce/", "passage_text": "how to reduce your carbon footprint. Reduce What You Can, Offset What You Can’t.™. That’s our motto, and we’re proud of it. Everyone has a responsibility to reduce their individual carbon footprint, and there are lots of ways to do so. We encourage everyone to think about their lifestyle decisions and find opportunities to reduce their climate impact. You can get partway to carbon neutrality through how you live your life, i.e., reducing your carbon footprint, and get the rest of the way there by supporting Carbonfund.org’s carbon offset projects."}, {"url": "http://www.takepart.com/flashcards/what-is-a-carbon-footprint", "passage_text": "Although adding up one’s individual carbon footprint can be difficult, online calculators can do some of the work for you, giving a rough estimate of your carbon footprint based on the size of your household, the efficiency of your appliances, how much you drive or fly, what you eat, and how much you recycle. You can't control everything, but being conscious of your carbon footprint helps. A carbon footprint is the amount of greenhouse gases produced by a particular human activity."}, {"url": "http://www.english-online.at/environment/carbon-footprint/reducing-carbon-footprint.htm", "passage_text": "How to reduce your carbon footprint. There are many actions you can take to reduce your carbon footprint. The way we travel, for example, has a major impact on our environment. Use your bike or walk for short distances. Public transport is a way of getting to places without putting a burden on the environment. It measures the amount of fossil fuels and electricity someone uses up as well as the carbon footprint of the products they buy. When we use our cars or heat our homes with oil or natural gas, carbon dioxide and various other gases are set free. These emissions lead to a denser atmosphere and global warming. You can measure your carbon footprint by using a calculator that you can find on various websites"}, {"url": "http://science.howstuffworks.com/environmental/green-science/carbon-footprint.htm", "passage_text": "Carbon offsets let you pay to reduce the global greenhouse gas total instead of making radical reductions of your own. When you buy an offset, you fund projects that reduce emissions by restoring forests, updating power plants and factories or increasing the energy efficiency of buildings and transportation. Some start by calculating their carbon footprint to set a benchmark -- like a weigh-in before a diet. A carbon footprint is simply a figure -- usually a monthly or annual total of CO2 output measured in tons."}, {"url": "http://www.footprintnetwork.org/en/index.php/GFN/page/carbon_footprint/", "passage_text": "Carbon Footprint. Today, the term “carbon footprint” is often used as shorthand for the amount of carbon (usually in tonnes) being emitted by an activity or organization. The carbon Footprint is 54 percent of humanity’s overall Ecological Footprint and its most rapidly-growing component. Humanity’s carbon footprint has increased 11-fold since 1961."}, {"url": "http://science.howstuffworks.com/environmental/green-science/carbon-footprint.htm", "passage_text": "People concerned with the environment and global warming usually try to reduce their carbon output by increasing their home's energy efficiency and driving less. Some start by calculating their carbon footprint to set a benchmark -- like a weigh-in before a diet. A carbon footprint is simply a figure -- usually a monthly or annual total of CO2 output measured in tons. Web sites with carbon calculators turn easy-to-supply information like annual mileage and monthly power usage into a measurable tonnage of carbon"}]