[{"url": "https://answers.yahoo.com/question/index?qid=20070709215744AAWg3vE", "passage_text": "Answers. Best Answer: Because it is a amphetamine that elevates the heart and therefore dilates all blood vessels. It shows your dialed pupils because it is natural to do so. It also increases certain brain functions that have other effects as well."}, {"url": "http://www.answers.com/Q/Does_Adderall_cause_dilated_pupils", "passage_text": "Certain drugs cause constriction of the pupils, such as alcohol and opioids. Other drugs, such as atropine, marijuana, LSD, cocaine, mescaline, psilocybin mushrooms, … and amphetamines cause pupil dilation."}, {"url": "http://www.answers.com/Q/Does_ADHD_cause_dilated_pupils", "passage_text": "Certain drugs cause constriction of the pupils, such as alcohol and opioids. Other drugs, such as atropine, marijuana, LSD, cocaine, mescaline, psilocybin mushrooms, … and amphetamines cause pupil dilation. + 88 others found this useful. John Curtis."}, {"url": "http://www.addforums.com/forums/showthread.php?t=128635", "passage_text": "I have been on Adderall for about 5 months now. I started on 20mg IR once a day and now I am up to 30mg IR twice a day. My first month on Adderall my pupils were very dilated, but ever since then my pupils have been constricted as if I had just taken an opiate."}, {"url": "http://www.addforums.com/forums/showthread.php?t=128635", "passage_text": "Please Help Me Figure This Out. This morning I started taking Adderall IR 15mg and haven't noticed anything different with my eyes/pupils. __________________. I have= ADHD-PI, Social Phobia, Mitral Valve Prolapse (heart condition), Internet Addiction..(self-diagnosed) Rx= Not taking meds due to side effects."}, {"url": "http://www.answers.com/Q/Does_Adderall_cause_dilated_pupils", "passage_text": "Drugs can cause a pupil to change in two ways by dilation making the pupil larger or constricting the pupils. … Only two drugs constrict the pupils those being opiates and alcohol. So anything but, these can cause the pupils to dilate. 18 people found this useful."}]