[{"url": "http://www.currentresults.com/Weather/Colorado/average-colorado-weather.php", "passage_text": "Detailed temperature information for Denver, Colorado with data on average monthly highs and lows plus number of days with hot or cold weather. Temperatures for each month at: Aspen Boulder Colorado Springs Crested Butte Durango Estes Park Fort Collins Pueblo Steamboat Springs Telluride Vail Wolf Creek. Colorado Weather Averages. Select a link for the average weather, by month or year, in cities, towns and parks throughout Colorado. The links take you to data for normal temperatures, precipitation, snowfall, sunshine and humidity."}, {"url": "http://www.areavibes.com/denver-co/weather/", "passage_text": "1.2. The highest average temperature in Denver is July at 74 degrees. The coldest average temperature in Denver is December at 28.5 degrees. The most monthly precipitation in Denver occurs in August with 2.7 inches. The Denver weather information is based on the average of the previous 3-7 years of data. Loading.."}, {"url": "http://www.currentresults.com/Weather/Colorado/Places/denver-temperatures-by-month-average.php", "passage_text": "Denver Temperatures: Averages by Month. The numbers here tell you how hot and cold the weather usually is in Denver, Colorado during each month of the year. The average high and low temperatures are listed below monthly and annually for Denver, in both degrees Fahrenheit and Celsius. Maximums and minimums are only part of the temperature picture. To fill in the rest, there's information on how many days a month get above or below a given temperature. To find out how often it rises over 70, 80 or 90 °F each month in Denver, scroll down farther. There are also monthly and yearly counts of days with cold weather. All the numbers are averages, based on climate data gathered from 1981 to 2010."}, {"url": "http://www.go-colorado.com/Denver/Weather/", "passage_text": "Climate. Denver has a mild climate, despite what out-of-state visitors might expect. On average, the city receives over 300 days of sunshine each year, and only a small amount of precipitation. "}, {"url": "https://weatherspark.com/averages/30040/Denver-Colorado-United-States", "passage_text": "This report describes the typical weather at the Denver International Airport (Denver, Colorado, United States) weather station over the course of an average year. It is based on the historical records from 1995 to 2012. Earlier records are either unavailable or unreliable. "}, {"url": "http://www.usclimatedata.com/climate/denver/colorado/united-states/usco0105", "passage_text": "9. 9. Climate data for denver stapelton, Longitude: -104.869, Latitude: 39.7633. Average weather Denver, CO - 80203 - 1981-2010 normals. Jan: January, Feb: February, Mar: March, Apr: April, May: May, Jun: June, Jul: July, Aug: August, Sep: September, Oct: October, Nov: November, Dec: December. "}, {"url": "http://www.rssweather.com/climate/Colorado/Denver/", "passage_text": "Climate for Denver, Colorado. Denver's coldest month is January when the average temperature overnight is 15.2°F. In July, the warmest month, the average day time temperature rises to 88.0°F. 44.1°F. Denver's coldest month is January when the average temperature overnight is 15.2°F. In July, the warmest month, the average day time temperature rises to 88.0°F."}, {"url": "http://www.denver.org/about-denver/weather/", "passage_text": "That’s more annual hours of sun than Miami and San Diego. Winters are mild with an average daily high temperature of 45 degrees Fahrenheit and days reaching 60 degrees are not uncommon. Snow doesn't stay on the ground long in Denver so golf courses and outdoor cafes are able to stay open all year. In summer, Denver enjoys low relative humidity, making for beautiful, sun-filled days and cool, comfortable evenings. The average daily high temperature in August is a mild 86 degrees Fahrenheit. The mild weather is due in part to the city's altitude: 5,280 feet above sea level, or exactly a mile high. "}, {"url": "http://www.rssweather.com/climate/Colorado/Denver/", "passage_text": "Average Temperatures for Denver. Denver's coldest month is January when the average temperature overnight is 15.2°F. In July, the warmest month, the average day time temperature rises to 88.0°F. 44.1°F. Denver's coldest month is January when the average temperature overnight is 15.2°F. In July, the warmest month, the average day time temperature rises to 88.0°F."}]