[{"url": "http://www.vet-pet-health-advice.com/dog-ear-yeast-infection.html", "passage_text": "There is also a bad odor to an ear infection, whether the infection is caused by yeast, or by bacteria. And often there is visible debris (goo) in the ear entrance. To your vet, it looks like this. a bacterial infection, mixed with yeast, or. an ear mite infestation, or a foreign body down in the ear, like a grass seed head (often called a grass awn), or a tumor inside the ear canal, or an infection deep in the middle ear where it's not even visible."}, {"url": "http://www.wikihow.com/Tell-if-a-Piercing-Is-Infected", "passage_text": "Look for any discharge or pus. Pus is the most obvious sign of an infected piercing. White pus tends to indicate a very minor infection, in which case you should simply continue with the normal cleansing process and look for signs of healing. In the case of a more serious infection, pus will either be yellow or green. 1 If the piercing is in an area of the body where an infection is more prone, (Ex: Ear, navel, genitals, lip) then there will be a higher risk of infection if not taken care of with caution."}, {"url": "http://www.medicinenet.com/anatomy_of_an_ear_infection_pictures_slideshow/article.htm", "passage_text": "An infection of the ear canal (the outer ear) is sometimes referred to as swimmer’s ear. The name comes from the fact that it most often occurs when the ear canal stays wet long enough for bacteria or other organisms to grow. Symptoms of an Ear Infection. Ear pain is the main sign of ear infection in children. Kids with ear infection may have trouble sleeping because of the pain. Other symptoms can include discharge or fluid coming from the ears, fever, problems with hearing, dizziness, or nasal congestion."}, {"url": "http://www.webmd.com/cold-and-flu/ear-infection/ss/slideshow-ear-infection-anatomy", "passage_text": "An infection in the outer ear is often called Swimmer’s Ear. It usually happens when the ear stays wet long enough to breed germs. Diagnosing an Ear Infection. The only way to know for sure if your child has an ear infection is for a doctor to check inside her ear with a device called an otoscope. This is basically just a tiny flashlight with a magnifying lens for the doctor to look through."}, {"url": "http://www.whatdoesitlooklike.net/what-does-an-ear-infection-look-like/", "passage_text": "So, the question is what does an ear infection look like. See, normally, the ear drum’s shiny and flat, and if you flash the otoscope at it, it will reflect the light. The colors of it is usually a little pearly or yellow. When you suffer from an ear infection, the drum becomes red and a little raised. It kind of seems to be swollen when you look at it from the outside. Apart from the swollen and red look, you’ll also experience pain coming from the inside of your ear and maybe even a banging noise. You can also hear a noise similar to what you hear if you decide to put your head under water, relax and not move. I am sure you know what I am talking about."}, {"url": "http://www.answers.com/Q/What_do_infected_ears_look_like", "passage_text": "An earring infection can't be fully seen, as it is often inside the ear, where the earring post goes through. However, the ear lobe often goes red, and swollen, pus and gunk k … eeps building up and has to be removed resulting in a lot of pain. I've had an earring infection myself and its not nice! "}, {"url": "http://www.webmd.com/a-to-z-guides/ear-examination", "passage_text": "An ear examination can detect problems in the ear canal, eardrum, and the middle ear, such as infection, excessive earwax, or an object like a bean or a bead. During an ear examination, an instrument called an otoscope is used to look at the outer ear canal and eardrum. How It Is Done. An ear examination can be done in a doctor's office, a school, or the workplace. For an ear examination, the doctor uses a special instrument called an otoscope to look into the ear canal and see the eardrum."}, {"url": "http://www.webmd.com/cold-and-flu/ear-infection/ss/slideshow-ear-infection-anatomy", "passage_text": "Fluid in the Ear. If the Eustachian tube gets blocked, fluid builds up inside your child’s middle ear. This makes the perfect breeding ground for bacteria and viruses, which can cause infections. Your doctor may look inside your child’s ear with an otoscope, which can blow a puff of air to make his eardrum vibrate. Diagnosing an Ear Infection. The only way to know for sure if your child has an ear infection is for a doctor to check inside her ear with a device called an otoscope. This is basically just a tiny flashlight with a magnifying lens for the doctor to look through."}]