[{"url": "https://en.wikipedia.org/wiki/Fuerteventura", "passage_text": "Fuerteventura (. [fweɾteβenˈtuɾa] ; loosely translated as Strong Winds or a corruption of the French term for Great Adventure) is one of the Canary Islands, in the Atlantic Ocean off the coast of Africa, politically part of Spain. The island has a population of 74,983. Throughout its long history, Fuerteventura has suffered from a population decline due to the economic situation and the climate, which have made it into a desert island."}, {"url": "https://en.wikipedia.org/wiki/Fuerteventura", "passage_text": "Fuerteventura is the oldest island in the Canary Islands dating back 20 million years to a volcanic eruption from the Canary hotspot. The majority of the island was created about 5 million years ago and since then has been eroded by wind and other weather. The island has a population of 74,983. Throughout its long history, Fuerteventura has suffered from a population decline due to the economic situation and the climate, which have made it into a desert island."}, {"url": "https://en.wikipedia.org/wiki/Fuerteventura", "passage_text": "The economy of Fuerteventura is mainly based on tourism. Primary tourist areas are located around the existing towns of Corralejo in the north and Morro Jable in Jandia, plus the purely tourist development of Caleta de Fuste, south of Puerto del Rosario. The island has a population of 74,983. Throughout its long history, Fuerteventura has suffered from a population decline due to the economic situation and the climate, which have made it into a desert island."}, {"url": "http://fuerteventura.com/", "passage_text": "With three thousand hours of sunshine a year, Fuerteventura is the closest Canary Island to the African coast with only 100km separating the 'Punta de la Entallada' from Cape Juby in Morroco and is the second largest (after Tenerife) of all the islands. "}, {"url": "http://www.sunnyfuerteventura.com/", "passage_text": "For a four day forecast, go to Sunny Fuerteventura Weather. Fuerteventura is the oldest Canary Island, and was formed about 70 million years ago as a result of volcanic activity. Fuerteventura's modern landscape is a result of the weathering of the original landscape that was created by the volcanoes. Fuerteventura's Location and Geography"}, {"url": "http://www.thomson.co.uk/destinations/europe/spain/fuerteventura/holidays-fuerteventura/places-to-go", "passage_text": "On the southwest peninsula of Fuerteventura, Jandia is the place for the more demanding beach lover. It’s set on a never-ending expanse of white sand, at the foot of the Pico de la Zarza mountain range. "}, {"url": "http://www.spain-holiday.com/Fuerteventura/articles/fuerteventura-canary-islands", "passage_text": "Fuerteventura’s geography. The seven islands that make up the Canary Islands archipelago are Tenerife, Gran Canaria, Lanzarote, Fuerteventura, La Gomera, La Palma and El Hierro. They stretch from east to west in a 500km arch. The island of Fuerteventura is the second largest and measures 1660km2 (including the island of Los Lobos). Widely believed to the oldest of the Islands, having been the result of a volcanic eruption some 20 million years ago. The island can be divided up into two sections: la Maxorata and the Jandia Peninsula. "}, {"url": "http://www.fuerteventura-tour.com/location.php", "passage_text": "Localization Fuerteventura. Fuerteventura is one of the seven islands that constitute the Canary Archipelago. Furthermore with a distance of only 90km to Cabo Jubi (Western Sahara) it is the Canary island which is closest to Africa. Canary Islands. Fuerteventura is located between 28 45' 04'' and 28 02' 16'' of Northern latitude and 13 49' 12'' and 14 30' 24'' of Eastern longitud. With a size of 1660km2 it is the longest and second largest island of the archipelago. Fuerteventura. Fuerteventura is a place where to go at least once in the life"}, {"url": "http://www.sunnyfuerteventura.com/fuerteventura-beaches/index.html", "passage_text": "Corralejo is at the northern tip of the island and is built around what was originally a small fishing port. There are several beaches in the immediate area. The ones closest to the town centre are family friendly as they provide a safe environment, and they are also close to the facilities that a family may need. "}, {"url": "http://www.sunnyfuerteventura.com/", "passage_text": "Fuerteventura is the most easterly of the Canary islands and is only 60 miles from the coast of Morocco. The geographical position of Fuerteventura means that for many tens of thousands of years sand from the Sahara has been deposited on Fuerteventura's shores. Fuerteventura's Location and Geography. Fuerteventura is the oldest Canary Island, and was formed about 70 million years ago as a result of volcanic activity. Fuerteventura's modern landscape is a result of the weathering of the original landscape that was created by the volcanoes."}]