[{"url": "https://en.wikipedia.org/wiki/Chilean_Declaration_of_Independence", "passage_text": "The Chilean Declaration of Independence is a document declaring the independence of Chile from the Spanish Empire. It was drafted in January 1818 and approved by Supreme Director Bernardo O'Higgins on February 12, 1818 at Talca, despite being dated in Concepcion concepción On january, 1. 1818 "}, {"url": "https://answers.yahoo.com/question/index?qid=20091103071305AAy0QM7", "passage_text": "This rebellion lasted nearly 100 years. Chile was under Spanish rule. In 1810, Chile wanted to get independence from Spain. A royal army was sent to Chile. Chile defeated them. In 1818, they got independence but they still had to fight the Spanish troops that came from Peru time to time. It was only in 1826 that they had complete independence from Spain. "}, {"url": "http://countrystudies.us/chile/8.htm", "passage_text": "Chile Table of Contents. Aristocratic Chileans began considering independence only when the authority and legitimacy of the crown were cast in doubt by Napoleon Bonaparte's invasion of Spain in 1807. Napoleon replaced the Spanish king with his brother, Joseph Bonaparte. Chile's first experiment with self-government, the Old Fatherland (Patria Vieja, 1810-14), was led by Jos Miguel Carrera Verdugo (president, 1812-13), an aristocrat in his mid-twenties. The military-educated Carrera was a heavy-handed ruler who aroused widespread opposition."}, {"url": "http://countrystudies.us/chile/8.htm", "passage_text": "Chile won its formal independence when San Mart n defeated the last large Spanish force on Chilean soil at the Battle of Maip on April 5, 1818. San Mart n then led his Argentine and Chilean followers north to liberate Peru; and fighting continued in Chile's southern provinces, the bastion of the royalists, until 1826. Chile's first experiment with self-government, the Old Fatherland (Patria Vieja, 1810-14), was led by Jos Miguel Carrera Verdugo (president, 1812-13), an aristocrat in his mid-twenties. The military-educated Carrera was a heavy-handed ruler who aroused widespread opposition."}, {"url": "http://www.mapsofworld.com/south-america/history/independence.html", "passage_text": "Peru got its independence on July 28th, 1821, and Uruguay on August 25, 1825. Chile declared its independence on 1810, but it came officially the next year, and is celebrated on the 8th of September. "}, {"url": "http://www.mapsofworld.com/chile/facts.html", "passage_text": "Chile only achieved its victory over Spain in 1818, with Chile’s Declaration of Independence, which was signed on February 12, 1818. Augusto Pinochet was a military leader and President of Chile who had a major impact on the country, in both good and bad ways. Chile formed its independent republic on September 18, 1810, with the First Government Junta, or the first step toward Chilean independence. September 18 is celebrated as the National Day of Chile."}, {"url": "https://en.wikipedia.org/wiki/Chilean_War_of_Independence", "passage_text": "A declaration of independence was officially issued by Chile on February 12, 1818 and formally recognized by Spain in 1844, when full diplomatic relations were established. The Chilean War of Independence was part of the more aroused Spanish American wars of independence. Independence did not have unanimous support among Chileans, who were divided between independentists and royalists. What started as a political movement among elites against the colonial power, ended as a full-fledged civil war."}, {"url": "http://latinamericanhistory.about.com/od/thehistoryofchile/p/09chileindependence.htm", "passage_text": "Prelude to Independence: In 1810, Chile was a relatively small and isolated part of the Spanish Empire. It was ruled by a governor, appointed by the Spanish, who answered to the Viceroy in Buenos Aires. Today, September 18 is celebrated in Chile as their Independence Day. It is remembered with the fiestas patrias or national parties.. The celebrations kick off in early September and can last for weeks."}, {"url": "http://latinamericanhistory.about.com/od/thehistoryofchile/p/09chileindependence.htm", "passage_text": "On September 18, 1810, Chile broke from Spanish rule, declaring their independence (although they still were theoretically loyal to King Ferdinand VII of Spain, then a captive of the French). Today, September 18 is celebrated in Chile as their Independence Day. It is remembered with the fiestas patrias or national parties.. The celebrations kick off in early September and can last for weeks."}, {"url": "https://en.wikipedia.org/wiki/Chilean_War_of_Independence", "passage_text": "The independence wars in Chile (1810–1818) and Peru (1809–1824) had a negative impact on the Chilean wheat industry. Trade was disrupted and armies in Chile pillaged the countryside. Independence did not have unanimous support among Chileans, who were divided between independentists and royalists. What started as a political movement among elites against the colonial power, ended as a full-fledged civil war."}]