[{"url": "http://www.answers.com/Q/How_much_does_a_Marriage_license_cost_in_CANADA", "passage_text": "Both the bride and groom must appear in person to apply for the marriage license. If you complete a qualifying premarital education program the cost of the marriage license is $16.00. If you do not complete a premarital education class, the cost of a marriage license is $56.00. The phone number for the Gwinnett County Probate Court is 770-822-8354. The marriage license fee varies from county to county. The range is from about $20 to $35. You apply for the marriage license at the County Clerk's office in the county where … the marriage will be performed."}, {"url": "http://weddings.costhelper.com/marriage-license.html", "passage_text": "1 Fees for marriage licenses range from a low of $10 (Colorado) to as much as $100 (Minnesota). 2  The cost varies based on county, city or municipality, residential status, and in some cases, completion of a pre-marital counseling or education course. 3  A few states, such as Hawaii ($60), have standard, statewide fees. 1 Most states require a couple to apply in person. 2  In some cases, there may be a waiting period of up to 3 days. 3  Marriage licenses are typically good for between 30 and 90 days. 4  Some cities require the couple to send back any license that has not been used before its expiration date."}, {"url": "http://www.niagaraparksweddings.ca/more-info/ontario-marriage-licence-requirements.php", "passage_text": "Ontario Marriage License Requirements. Fee. The fee for a license is $100.00 Canadian (Cash Only). The price is subject to change-call Niagara Falls City Hall (see contact information at bottom of page) in advance to verify. Age. Both parties MUST be 18 years of age or over to obtain a license. Applicants who are 16 or 17 years of age must have parental consent."}, {"url": "http://weddings.costhelper.com/marriage-license.html", "passage_text": "1 Marriage licenses are typically good throughout the state in which it was obtained. 2  In states that allow cities or counties to set individual fees, it is possible to save money by obtaining a license in a city or county with a lower fee. 3  For example, a marriage license costs $50 in Boston but only $25 in Cambridge. 1 Most states require a couple to apply in person. 2  In some cases, there may be a waiting period of up to 3 days. 3  Marriage licenses are typically good for between 30 and 90 days. 4  Some cities require the couple to send back any license that has not been used before its expiration date."}, {"url": "http://ottawa.ca/en/residents/laws-licenses-and-permits/birth-marriage-and-death/marriage-licences", "passage_text": "The City of Ottawa charges a $166.50 service fee for a marriage licence, which you can pay for by cash, cheque, Interac, Visa or MasterCard. Marriage licence fees are non-refundable. "}, {"url": "http://www.canadiancounty.org/index.aspx?NID=1071", "passage_text": "The certificate must be an original document on letterhead, not a copy, and shall state that the named persons have successfully completed the premarital counseling requirements. If you have a judge’s ceremony you will need to pay an additional $10.00 cash fee for judge’s services. Arrive at the courthouse at least 30 minutes before your appointment so we may issue the marriage license to you before you go before the judge to be married. The premarital counseling program must be conducted in accordance with Oklahoma State 43 O.S. 5.1."}, {"url": "http://www.canadiancounty.org/index.aspx?NID=1071", "passage_text": "The completed marriage license must be returned to the Court Clerk's Office within 5 days from the performance of marriage by minister. Cost: $50.00 license fee (cash or card, no checks) or $5.00 (cash or card, no checks) if premarital counseling is completed. The reduced fee shall apply upon presentation to the court clerk of an original certificate of successful completion of a premarital counseling program. Arrive at the courthouse at least 30 minutes before your appointment so we may issue the marriage license to you before you go before the judge to be married. The premarital counseling program must be conducted in accordance with Oklahoma State 43 O.S. 5.1."}, {"url": "http://weddings.costhelper.com/marriage-license.html", "passage_text": "1 For example, a marriage license costs $50 in Boston but only $25 in Cambridge. 2  Certain states will provide discounts to couples who complete pre-marital courses. 3  In Minnesota, the marriage license fee is usually $100, but is reduced to $30 with proof of completion of a 12-hour counseling course. 1 Most states require a couple to apply in person. 2  In some cases, there may be a waiting period of up to 3 days. 3  Marriage licenses are typically good for between 30 and 90 days. 4  Some cities require the couple to send back any license that has not been used before its expiration date."}, {"url": "http://www.answers.com/Q/How_much_does_a_Marriage_license_cost_in_CANADA", "passage_text": "The fee for a marriage license varies from county to county. The fee in Abbeville County is $40.00, but In Jasper County the fee is $50. The marriage license fee varies from county to county. The range is from about $20 to $35. You apply for the marriage license at the County Clerk's office in the county where … the marriage will be performed."}]