[{"url": "http://www.plasterersforum.com/threads/tanking-what-is-it-and-when-to-apply.29663/", "passage_text": "bigsegs Guest. Tanking is, as its name suggest a method of sealing a wall to prevent water ingress (think 'water tank). often mis-specified as a cure for damp problems it is basically a waterproof cementious slurry (wet mix) that is applied to a surface to prevent water penetrating the internal surface of a building.."}, {"url": "http://www.drywallandfloor.co.uk/whatistanking.htm", "passage_text": "Click here to see Tanking Products, check prices or Order. 'Tanking' is a general building term for coating or lining walls underground to seal them against water, hence the idea of forming a complete 'tank'. To really qualify as Tanking all the below ground walls and floors have to be coated or lined."}, {"url": "http://www.dampproofinglondon.co.uk/tanking-walls.html", "passage_text": "What is tanking? Tanking is a term that refers to damp proofing walls retrospectively by creating a complete water-impermeable barrier covering the entire wall. It is usually employed as a remedial method in situations where there is no access to the external wall of the structure, such as in basements and cellars."}, {"url": "http://www.diytanking.co.uk/", "passage_text": "A tanking slurry is used for waterproofing walls in an underground cellar or basement.. The tanking formula is a cement-quartz-acrylic polymer blend supplied in powdered form. Just mix with water to make a cementitious slurry compound that sets to make a completely waterproof barrier over a masonry wall surface."}, {"url": "http://www.drywallandfloor.co.uk/whatistanking.htm", "passage_text": "Let's make a Tank. 'Tanking' is a general building term for coating or lining walls underground to seal them against water, hence the idea of forming a complete 'tank'. To really qualify as Tanking all the below ground walls and floors have to be coated or lined."}, {"url": "http://www.lets-do-diy.com/Projects-and-advice/Damp-rot-and-infestation/Tanking.aspx", "passage_text": "Tanking a damp wall. Print Page. Summary: Learn how to tank a wet or damp wall, basement tanking, install a polypropylene membrane and apply an epoxy damp-proof membrane. Damp patches on an external wall following a period of wet weather could indicate a problem with penetrating damp."}]