[{"url": "http://www.wisegeekhealth.com/what-is-a-protruding-disc.htm", "passage_text": "Individuals suffering from a protruding disc may benefit from visiting a chiropractor. Pain medication may help relieve discomfort associated with a protruding disc. Disc herniation involves the rupture of the material that separates the vertebrae in the spine. body where the disk is protruding outward. The pain mixed with the constant numbness and pressure makes it harder to notice any improvement from my injections. I'm concerned with the degenerative disks and can't come up with a reasonable option to reverse or correct the painful problem."}, {"url": "http://www.spinal-foundation.org/conditions/disc-protrusion-symptoms-and-treatment", "passage_text": "A disc protrusion or bulge can occur anywhere along the length of the spinal column from the neck to the lower back. The condition may arise in the neck (cervical spine), back of chest (thoracic spine) or lower back (lumbar spine). In reality, this is a ‘catch-all’ term for a range of medical problems that relate to the ‘discs’ of soft tissue which separate the vertebrae in the spinal column. In medical terms you may be suffering from either a disc bulge (protrusion) or a ruptured disc (disc extrusion or sequestrum)."}, {"url": "http://www.wisegeekhealth.com/what-is-a-protruding-disc.htm", "passage_text": "A protruding disc is a disc in the spine which has herniated, meaning that the soft material which is normally on the inside of the disc has pushed through a weak point in the connective tissue which normally surrounds the disc. body where the disk is protruding outward. The pain mixed with the constant numbness and pressure makes it harder to notice any improvement from my injections. I'm concerned with the degenerative disks and can't come up with a reasonable option to reverse or correct the painful problem."}, {"url": "http://www.physioworks.com.au/injuries-conditions-1/bulging_disc", "passage_text": "A bulging disc injury is a common spine injury sustained to your spine's intervertebral disc. It can occur in your lumbar spine (lower back), thoracic spine (upper and mid-back) or your cervical spine (neck). A bulging disc can commonly be referred to as a slipped disc or a protruding disc. However, when the disc bulge is significant enough for the disc nucleus to the annulus it is known as a herniated disc. See diagram"}, {"url": "https://en.wikipedia.org/wiki/Spinal_disc_herniation", "passage_text": "Spinal disc herniation, also known as a slipped disc, is a medical condition affecting the spine in which a tear in the outer, fibrous ring of an intervertebral disc allows the soft, central portion to bulge out beyond the damaged outer rings. "}, {"url": "https://www.laserspineinstitute.com/back_problems/disc_protrusion/", "passage_text": "When a disc protrudes into the limited space of the spinal canal, the disc might place compressive pressure on, irritate or otherwise interfere with a nerve root or the spinal cord. It is this nerve compression that causes the most serious disc protrusion symptoms, including: 1  Local, chronic neck and back pain. 1 The next stage of disc deterioration is often a bulging disc, when the disc’s inner material, called nucleus pulposus, moves further around the disc circumference beyond its normal parameters as it pushes into the disc’s fibro-elastic outer wall, called the annulus fibrosus, creating a bulge."}, {"url": "http://www.michiganspineandpain.com/real-pain-real-solutions/diagnosis/herniated-disc-bulging-disc-protruding-disc/", "passage_text": "A main cause to these symptoms is a herniated, bulging or protruding disc, also sometimes referred to as a ruptured disc. The spine is made up of many vertebrae which are stacked upon one another, and in between each of these bones are discs. These discs are the spines shock absorbers. If it puts pressure on a spinal nerve, the herniated disk can cause pain, numbness or weakness in the back, legs or arms, depending on where the disk is located. Herniated disks are most common in the lower (lumbar) spine, but about 10 percent occur in the neck (cervical spine)."}, {"url": "http://www.spinal-foundation.org/conditions/disc-protrusion-symptoms-and-treatment", "passage_text": "If you have a disc protrusion then you are suffering from what is commonly called a ‘slipped disc’. In reality, this is a ‘catch-all’ term for a range of medical problems that relate to the ‘discs’ of soft tissue which separate the vertebrae in the spinal column. In medical terms you may be suffering from either a disc bulge (protrusion) or a ruptured disc (disc extrusion or sequestrum)."}, {"url": "http://www.physioworks.com.au/injuries-conditions-1/bulging_disc", "passage_text": "When a bulging disc, disc herniation or disc rupture occurs, it is typically due to either: 1  a pre-existing weakness in the annulus, or. 2  a sudden increase in pressure through the disc causing fibres of the annulus to tear. It can occur in your lumbar spine (lower back), thoracic spine (upper and mid-back) or your cervical spine (neck). A bulging disc can commonly be referred to as a slipped disc or a protruding disc."}, {"url": "http://www.healyourbulgingdisc.com/bulging-disc.html", "passage_text": "A bulging disc is a spinal condition, where the outer wall of the disc (the Annulus Fibrosus) becomes weak and starts to bulge into the spinal canal. This condition may also be referred to as a Protruding Disc or a Slipped Disc. What makes this condition different from a herniated disc or a ruptured disc is that, although the wall is weaker than normal, it does not tear, as you can see in the image below. Photo Courtesy of 3D Virtual Consultation For Doctors. "}]