[{"url": "http://www.ccfcc.org/greenway_project/stormwater-flood-issues.html", "passage_text": "According to government sources, one-third of flood loss claims are from property outside the 100-year flood plain. The Cypress Creek Watershed is a 320 square-mile drainage collection basin, the largest in Harris County. Because of its size, it has the potential for receiving greater volumes of floodwater than other watersheds in Harris County. The only flood reduction approach identified at that time, which met the cost-benefit criterion, was the acquisition and removal of 38 homes located low in the (5-year) floodplain. 10. Erosion and sediment: Cypress Creek is one of the few unchannelized streams lef"}, {"url": "http://www.ccfcc.org/mission/education/faq/flooding.html", "passage_text": "No information should be considered as being completely accurate nor warranted for any purpose. The Cypress Creek Flood Control Coalition is a participating Project Impact partner pledged to support developing a more disaster resistant community in Harris County and surrounding area. With the exception of a small Louisiana parish, Harris County has the most repetitive flood loss experience of any county in the United States. During the last four decades, record rainfalls and flooding have repeatedly occurred within the Houston metroplex."}, {"url": "http://www.ci.cypress.ca.us/whats_news/whats_news.htm", "passage_text": "The Orange County Workforce Investment Board and the City of Cypress invite you to the 2015 Cypress Job Fair, Wednesday, October 14, 2015, 9:00 a.m.-1:00 p.m., Cypress Community Center, 5700 Orange Avenue. Free admission, free parking, free resume critique. Bring copies of your resume and dress professionally. "}, {"url": "https://www.communityself-storage.com/", "passage_text": "Store In Your Community. Community Self Storage has the perfect storage space for all your storage needs. Our properties are built with you, our customer in mind. We provide the best customer service and take the necessary steps to ensure you have a pleasant moving and storage experience. Community Self Storage is the right choice for your storage needs. We offer convenient “drive-up” units that allow for easy access, saving time and a strain on your back. Climate Control units and our extra wide covered driveway provide protection against the elements"}, {"url": "http://www.ccfcc.org/mission/education/faq/flooding.html", "passage_text": "If your home is located in the Cypress Creek Watershed, rain that falls on your house will eventually end up in Cypress Creek. Mother Nature designs and builds watersheds, largely determined by the topography or lay of the land. Harris County has twenty-two major watersheds. With the exception of a small Louisiana parish, Harris County has the most repetitive flood loss experience of any county in the United States. During the last four decades, record rainfalls and flooding have repeatedly occurred within the Houston metroplex."}, {"url": "http://www.communityself-storage.com/our-locations/", "passage_text": "Community Self Storage has several area facilities to serve your needs. Our Fry Road facility located right outside of the Copperfield area, serves the Cypress/Katy/Houston area. The facility on Louetta Road serves the Spring and Klein areas. The Washington Avenue facility serves the Inner Loop and Downtown areas. Our Voss Road storage facility serves the Memorial Villages, Tanglewood and Galleria area."}, {"url": "http://www.ccfcc.org/mission/education/faq/flooding.html", "passage_text": "What are the terms used for some other Frequency Floods? There are an infinite number of flood frequencies that can occur. The .2% flood is called the 500-year flood; the 2% flood is called the 50-year flood; the 10% flood is called the 10-year flood; the 50% flood is called the 2-year flood, etc. With the exception of a small Louisiana parish, Harris County has the most repetitive flood loss experience of any county in the United States. During the last four decades, record rainfalls and flooding have repeatedly occurred within the Houston metroplex."}, {"url": "http://www.ccfcc.org/greenway_project/stormwater-flood-issues.html", "passage_text": "Note: The Corps of Engineers flood protection plan being developed for the Cypress Creek Watershed, as authorized by Harris County Commissioners Court in February 1994, was dropped in 1997 because it failed the cost/benefit test. The only flood reduction approach identified at that time, which met the cost-benefit criterion, was the acquisition and removal of 38 homes located low in the (5-year) floodplain. 10. Erosion and sediment: Cypress Creek is one of the few unchannelized streams left in Harris County."}, {"url": "http://www.swfwmd.state.fl.us/recreation/areas/cypresscreek.html", "passage_text": "About Cypress Creek Preserve. Purchased to provide flood protection and serve as a public water supply, Cypress Creek’s floodplain helps filter nutrients in runoff waters. Cypress Creek Well Field serves as an important source of water for the surrounding region and is managed by Tampa Bay Water (TBW). Cypress Creek is a tributary of the Hillsborough River."}]