[{"url": "http://www.urmc.rochester.edu/encyclopedia/content.aspx?ContentTypeID=90&ContentID=P02119", "passage_text": "A person can have normal chromosomes in number and structure, but still have a disease or condition caused by a mutation in one or more of the genes on the chromosomes. A single gene defect usually does not cause the chromosome structure or number to be abnormal."}, {"url": "http://biology.about.com/od/basicgenetics/ss/gene-mutation.htm", "passage_text": "Genes are segments of DNA located on chromosomes. A gene mutation is defined as an alteration in the sequence of nucleotides in DNA. This change can affect a single nucleotide pair or larger gene segments of a chromosome. DNA consists of a polymer of nucleotides joined together."}, {"url": "http://ghr.nlm.nih.gov/handbook/mutationsanddisorders/genemutation", "passage_text": "A gene mutation is a permanent alteration in the DNA sequence that makes up a gene, such that the sequence differs from what is found in most people. Mutations range in size; they can affect anywhere from a single DNA building block (base pair) to a large segment of a chromosome that includes multiple genes."}, {"url": "http://www.news-medical.net/health/Single-Gene-Genetic-Disorder.aspx", "passage_text": "Types of single gene disorders. The occurrence of a disease caused by a single gene mutation may occur in several main patterns or modes. These are grouped according to whether the trait is sex specific (generally X-linked) or not (autosomal). As a rule, single gene disorders (also known as Mendelian traits or diseases) are relatively uncommon."}, {"url": "http://www.embryology.ch/anglais/kchromaber/einzeln01.html", "passage_text": "Introduction. Quiz. If the changes in a genome are restricted to a single gene, a single-gene defect ensues. Usually this involves a point mutation and leads to an altered amino acid sequence in the proteins that are coded in this section of the DNA."}, {"url": "http://genetics.thetech.org/about-genetics/mutations-and-disease", "passage_text": "But the mutations we hear about most often are the ones that cause disease. Some well-known inherited genetic disorders include cystic fibrosis, sickle cell anemia, Tay-Sachs disease, phenylketonuria and color-blindness, among many others. All of these disorders are caused by the mutation of a single gene. Most inherited genetic diseases are recessive, which means that a person must inherit two copies of the mutated gene to inherit a disorder."}]