[{"url": "http://businessmajors.about.com/od/bschoolrankings/p/Executive-Mba.htm", "passage_text": "Although executive MBA programs can vary from school to school, there are some things that remain the same. To start with, executive MBA programs are typically designed for working professionals. They tend to be flexible and allow students to attend class in the evenings and on weekends. An executive MBA program is a lot like a regular MBA program. The main difference is that an executive MBA program is primarily designed to educate working executives, managers, entrepreneurs, and other business leaders."}, {"url": "http://www.ehow.com/facts_5985164_executive-mba_.html", "passage_text": "Focus of an Executive MBA. Because EMBA students are older and have specific career goals in mind, the curriculum is based on team learning, so students can draw on one another's experiences and knowledge. A traditional MBA's courses must be geared to students at all levels of experience, and is more general. A Master of Business Administration, or MBA, is a graduate level degree that focuses on management skills. An Executive MBA (EMBA) is geared for those who want to earn an MBA without quitting their day jobs. 1  What Is the Difference Between Executive & Professional MBA? 2  What Can You Do With an MBA in Finance?"}, {"url": "https://executivemba.wharton.upenn.edu/program-details/compare-wharton-programs/", "passage_text": "Transfer Policy. While academically the executive MBA and full-time MBA programs are the same, the delivery of the curriculum, the experience profile and near-term career aspirations of students, and the nature of the student experience are substantially different. "}, {"url": "http://www.kellogg.northwestern.edu/programs/executive-mba.aspx", "passage_text": "Financing & tuition. Learn more about what is included in the cost of tuition in the Executive MBA Program, research financing options and more. We offer scholarships to not-for-profit and government leaders. "}, {"url": "http://www.bi.edu/executive-education/master-programmes/executive-mba/overview/", "passage_text": "The BI Executive MBA offers three tracks, giving you the possibility to focus on global management, energy issues or the maritime offshore industry. The Executive MBA complemented my engineering background perfectly, and the vast experience and knowledge among my fellow students created a fantastic learning environment. The Executive MBA at BI Norwegian Business School is a programme for experienced business leaders with a hunger to grow professionally and personally in an international setting."}, {"url": "http://grad-schools.usnews.rankingsandreviews.com/best-graduate-schools/top-business-schools/executive-rankings", "passage_text": "Executive MBA. Ranked in 2015, part of Best Business Schools. Business leaders can earn an EMBA while still working full time. Courses often focus on leadership skills, teamwork and professional development. These are the top business schools for executive MBA programs. See online MBA rankings."}, {"url": "http://www.investopedia.com/terms/e/executive-mba.asp", "passage_text": "DEFINITION of 'Executive MBA-EMBA'. A Master of Business Administration program that specifically targets corporate executives and managers. BREAKING DOWN 'Executive MBA-EMBA'. EMBA programs are made up of a mix of classroom teaching on evenings and weekends, online tutorials and occasional full-day sessions. Career advancement and better prospects are primary motivators for executives to embark on this program"}, {"url": "http://businessmajors.about.com/od/bschoolrankings/p/Executive-Mba.htm", "passage_text": "An executive MBA, or EMBA, is a graduate level business degree. An executive MBA program is a lot like a regular MBA program. The main difference is that an executive MBA program is primarily designed to educate working executives, managers, entrepreneurs, and other business leaders. Read more about the differences between an MBA and executive MBA"}, {"url": "http://businessmajors.about.com/od/bschoolrankings/p/Executive-Mba.htm", "passage_text": "Executive MBA students are almost never at the beginning stages of their career. Students at the beginning level tend to be better suited to traditional MBA programs that cater to student of all ages and experience levels. An executive MBA program is a lot like a regular MBA program. The main difference is that an executive MBA program is primarily designed to educate working executives, managers, entrepreneurs, and other business leaders."}]