[{"url": "https://en.wikipedia.org/wiki/Reverse_osmosis", "passage_text": "Formally, reverse osmosis is the process of forcing a solvent from a region of high solute concentration through a semipermeable membrane to a region of low solute concentration by applying a pressure in excess of the osmotic pressure. The process of reverse osmosis can be used for the production of deionized water. Reverse osmosis process for water purification does not require thermal energy. Flow-through reverse osmosis systems can be regulated by high-pressure pumps."}, {"url": "http://puretecwater.com/what-is-reverse-osmosis.html", "passage_text": "Reverse Osmosis works by using a high pressure pump to increase the pressure on the salt side of the RO and force the water across the semi-permeable RO membrane, leaving almost all (around 95% to 99%) of dissolved salts behind in the reject stream. Reverse Osmosis is capable of removing up to 99%+ of the dissolved salts (ions), particles, colloids, organics, bacteria and pyrogens from the feed water (although an RO system should not be relied upon to remove 100% of bacteria and viruses). An RO membrane rejects contaminants based on their size and charge."}, {"url": "http://www.home-water-purifiers-and-filters.com/reverse-osmosis-filter.php", "passage_text": "A typical RO system is composed of an array of granular activated carbon (GAC) pre-filters, the reverse osmosis membrane, a storage tank, and a faucet to deliver the purified water to your countertop. Reverse osmosis systems vary in membrane quality, output capacity, and storage capacity. "}, {"url": "https://en.wikipedia.org/wiki/Reverse_osmosis", "passage_text": "Reverse osmosis (RO) is a water purification technology that uses a semipermeable membrane to remove larger particles from drinking water. In reverse osmosis, an applied pressure is used to overcome osmotic pressure, a colligative property, that is driven by chemical potential, a thermodynamic parameter. The process of reverse osmosis can be used for the production of deionized water. Reverse osmosis process for water purification does not require thermal energy. Flow-through reverse osmosis systems can be regulated by high-pressure pumps."}, {"url": "https://www.espwaterproducts.com/about-reverse-osmosis/", "passage_text": "Reverse Osmosis is a process in which dissolved inorganic solids (such as salts) are removed from a solution (such as water). This is accomplished by household water pressure pushing the tap water through a semi permeable membrane. 1 The valve has a tube that attaches to the inlet side of the RO pre filter. 2  This is the water source for the RO system. 3  Pre-Filter (s): Water from the cold water supply line enters the Reverse Osmosis Pre Filter first."}, {"url": "http://www.purewaterproducts.com/articles/what-does-ro-remove/", "passage_text": "Virtually anything you would want removed. A reverse osmosis (RO) unit, depending on the style, contains one, two or more activated carbon filters. On the EPA's list of regulated contaminants, filter carbon is the recommended best treatment for the vast majority. That's why Pure Water Products reverse osmosis units use the best carbon filters we can buy—in every case. Incredibly, a single MatriKX CTO+ cartridge (standard in most of our Black and White models) can remove the chlorine from 20,000 gallons of tap water!"}, {"url": "https://www.espwaterproducts.com/about-reverse-osmosis/", "passage_text": "1 This is the water source for the RO system. 2  Pre-Filter (s): Water from the cold water supply line enters the Reverse Osmosis Pre Filter first. 3  There may be more than one pre-filter used in a Reverse Osmosis system. 4  The most commonly used pre-filters are sediment filters. 1 The valve has a tube that attaches to the inlet side of the RO pre filter. 2  This is the water source for the RO system. 3"}, {"url": "http://waterandairworks.com/Reverse_Osmosis.html", "passage_text": "Reverse osmosis treatment generally removes a more diverse list of contaminants than other systems. RO can remove nitrates, sodium, and other dissolved inorganic and organic compounds. Common Questions Q.1: What is Reverse Osmosis (RO) A.1: Reverse Osmosis (RO) is the finest filtration available. The RO process works by separating contaminants from water by forcing the water through a semi-permeable membrane."}, {"url": "http://puretecwater.com/what-is-reverse-osmosis.html", "passage_text": "Reverse Osmosis is a technology that is used to remove a large majority of contaminants from water by pushing the water under pressure through a semi-permeable membrane. Reverse Osmosis is capable of removing up to 99%+ of the dissolved salts (ions), particles, colloids, organics, bacteria and pyrogens from the feed water (although an RO system should not be relied upon to remove 100% of bacteria and viruses). An RO membrane rejects contaminants based on their size and charge."}, {"url": "http://www.purewaterproducts.com/articles/what-does-ro-remove/", "passage_text": "In addition to its carbon filters, the reverse osmosis system sends the water through an extremely tight membrane that does some things carbon filtration alone cannot do. The accompanying “Nominal Rejection Characteristics” sheets show the typical rejection (removal) percentages of various water constituents. That's why Pure Water Products reverse osmosis units use the best carbon filters we can buy—in every case. Incredibly, a single MatriKX CTO+ cartridge (standard in most of our Black and White models) can remove the chlorine from 20,000 gallons of tap water!"}]