[{"url": "http://www.berenato.net/Labs/CalorimetryLabSpecificHeatsofMetals.pdf", "passage_text": "Calorimetry—Specific Heats of Metals In this experiment you will use a coffee-cup calorimeter to determine the heat capacity of a metal. A calorimeter is a device used to measure the heat released (or absorbed) by a physical or chemical process. "}, {"url": "http://www.saddleback.edu/faculty/jzoval/chem108_lab/lab_2_heat_capacity_lab/heat_capacity_lab_02_14_09.pdf", "passage_text": "Chemistry 108 lab Name_________________________ Lab #2: Coffee Cup Calorimetry INTRODUCTION In this experiment, you will determine the specific heat for an unknown metal. The metal sample will be heated to a high temperature (100 o C) then placed into a coffee cup calorimeter containing a known amount of water. "}, {"url": "http://www.kaffee.50webs.com/Science/labs/Chem/Lab-Calorimetry.html", "passage_text": "Heat Capacity of a Metal. A calorimeter is made using two nested styrofoam cups and filled with 175.0 g of water at an initial temperature of 25.0°C. A quantity of water is heated to 100.0°C and 25.0 g of aluminum is heated in the boiling water for five minutes."}, {"url": "https://www.scribd.com/doc/128382003/Calorimetry-Experiment-Lab-Report", "passage_text": "Styrofoam Cup Calorimetry Experiment Introduction. Calorimetry is a process of measuring the amount of heat involved in a chemical reaction or other process. In this experiment, I used thermometer to see if the chemicals is gaining or losing heat energy. Objectives. To find out the heat released or changed in a reaction. This process can be categorized as Exothermic reaction, because this releases energy during the process. Styrofoam Cup Calorimetry Experiment Data & Result: Initial temperature of HCl and NaOH Hydrocloric acid (HCl) Molarity Temperature Sodium Hydroxide Molarity Temperature 0.5 21 C° 0.5 15."}, {"url": "http://classroom.ldisd.net/users/0285/docs/calorimetry_lab.doc", "passage_text": "Overview: In this lab, you will get a chance to try to measure the H value for a physical reaction that occur in aqueous solution. You will use a styrofoam cup calorimeter and various reactants according to the instructions below. Safety: NaOH is a strong base. "}, {"url": "http://jan.ucc.nau.edu/~jkn/152A-Calorimetry.htm", "passage_text": "In this experiment, the calorimeter is defined as two nested styrofoam cups, the lid, magnetic stir bar, and the temperature probe tip, plus the 60.0 m L l of the reaction mixture (mainly water). This experiment has three primary objectives: 1. Find the heat capacity (Cp) of a calorimeter and contents (calibration). 2. Determine the D Hrxn, the enthalpy of reaction, for several different reactions, including the reaction of an unknown with a solution of HCl."}, {"url": "http://www.physicsclassroom.com/class/thermalP/Lesson-2/Calorimeters-and-Calorimetry", "passage_text": "A chemistry student dissolves 4.51 grams of sodium hydroxide in 100.0 mL of water at 19.5°C (in a calorimeter cup). As the sodium hydroxide dissolves, the temperature of the surrounding water increases to 31.7°C. Determine the heat of solution of the sodium hydroxide in J/g. This statement could be placed in equation form as. Q ice = - Q surroundings = -Q calorimeter. The role of the Styrofoam in a coffee cup calorimeter is that it reduces the amount of heat exchange between the water in the coffee cup and the surrounding air."}, {"url": "http://www.webassign.net/question_assets/ncsugenchem202labv1/lab_4/manual.html", "passage_text": "A calorimeter is composed of an insulated container, a thermometer, a mass of water, and the system to be studied. The use of an insulated container (Styrofoam cup in this experiment) allows us to assume that there is no heat transferred through the calorimeter walls. "}, {"url": "http://www.uccs.edu/Documents/chemistry/nsf/103%20Expt6V-Calorimetry.pdf", "passage_text": "6-1 Experiment 6 Coffee-cup Calorimetry Introduction: Chemical reactions involve the release or consumption of energy, usually in the form of heat. Heat is measured in the energy units, Joules (J), defined as 1 kg⋅m 2 /s 2. Another common heat unit is the calorie (cal). "}, {"url": "https://prezi.com/8k2oi31hj-re/calorimetry-report/", "passage_text": "100 grams (for the density of the liquid) +. 3.65 grams HCl = 103.65 grams for the solution Zn and HCl. Styrofoam Ccal= 154 J/ °C. Scientific Ccal= 68.8 J/°C Qcal=Ccal T A brief description of our experiment with Calorimetry Heat Capacity: Styrofoam Cup Calorimeter. Trial 1: 115. "}]