[{"url": "http://www.franklinvets.co.nz/Lifestyle/Sheep/Rearing+Lambs.html", "passage_text": "Most orphan lambs have been rescued out in the lambing paddock. It is not possible to know if the lamb has received adequate colostrum from its mother in its first 24 hours of life. Even if you are not familiar with the name, it is likely that you have or will encounter this condition if you are rearing lambs. It can cause up to 30% of reared lambs to die before weaning. Typically within 30 minutes of feeding warm milk, the 2-4 week old lamb will become bloated."}, {"url": "http://raisingorphanandbottlefedlambs.blogspot.com/2013/02/bloat-in-lambs.html", "passage_text": "The bloated stomach of the lamb can rupture killing the lamb. The other organs can also be crushed. Abdominal bloat in young lambs is clinically diagnosed by a dissension abdomen especially the right side. Bloat can also be caused due to a lack of colostrum and over feeding. Put a tube in the lambs belly via the nose or mouth. Make sure you don't put it into the lungs. To have the correct length of tubing measure from the head to just in front of the rear legs where they meet the belly. In less severe bloat this will release the gas."}, {"url": "http://www.franklinvets.co.nz/Lifestyle/Sheep/Rearing+Lambs.html", "passage_text": "The most proven method of prevention is feeding soured milk to lambs. Sour milk is made by adding acidophilus yoghurt to milk replacer and leaving it to convert for three days. . No lambs were lost from abomasal bloat when soured milk was fed to lambs. Even if you are not familiar with the name, it is likely that you have or will encounter this condition if you are rearing lambs. It can cause up to 30% of reared lambs to die before weaning. Typically within 30 minutes of feeding warm milk, the 2-4 week old lamb will become bloated."}, {"url": "http://www.npvet.co.nz/Information/LifestyleBlock/CareofOrphanLambs/tabid/2317/Default.aspx", "passage_text": "Care of Pet (Orphan) Lambs. 1) It is absolutely vital that the lamb has at least one feed of colostrum (milk from a ewe lambed within the last 24 hours) in its first 24 hours of life. Without this colostrum, the lamb has no immunity to diseases, and is unlikely to survive. Cow colostrum may be used as a last resort"}, {"url": "http://raisingorphanandbottlefedlambs.blogspot.com/2013/02/bloat-in-lambs.html", "passage_text": "Treatment. Early intervention is critical in the treatment of bloat. Early signs are a swollen belly and a miserable looking lamb. Do not allow the lamb to have access to any feed. Put a tube in the lambs belly via the nose or mouth. Make sure you don't put it into the lungs. To have the correct length of tubing measure from the head to just in front of the rear legs where they meet the belly. In less severe bloat this will release the gas."}, {"url": "http://www.greenspun.com/bboard/q-and-a-fetch-msg.tcl?msg_id=004fMz", "passage_text": "Here is another problem we are experiencing. We have an orphan bottle lamb that we got from a sheep farmer friend. He was doing just fine but all of a sudden he stopped eating and seems to be bloated. We have given him some B12 to encourage his appetite and gave him some propylene glycol."}, {"url": "http://www.franklinvets.co.nz/Lifestyle/Sheep/Rearing+Lambs.html", "passage_text": "Drenching is an important part of rearing lambs when they start grazing grass. Drench at about six weeks old and again at ten weeks with a combination drench such as First. This drench does not cover lice, which are usually treated soon after shearing with a pour-on or spray product. Even if you are not familiar with the name, it is likely that you have or will encounter this condition if you are rearing lambs. It can cause up to 30% of reared lambs to die before weaning. Typically within 30 minutes of feeding warm milk, the 2-4 week old lamb will become bloated."}]