[{"url": "http://www.excellent-proofreading-and-writing.com/scientific-paper-4.html", "passage_text": "The results section is just a presentation of the data. There should not be any discussion in the results section (that goes in the discussion section). The results need to be presented in enough detail for someone not familiar with the scientific paper to understand them."}, {"url": "https://explorable.com/writing-a-conclusion", "passage_text": "In the discussion, you assess how the results answer to this question and discuss its relevance to the existing knowledge in the field. When writing a conclusion, you should try to answer a few questions, as succinctly as possible."}, {"url": "http://www.korbedpsych.com/R19Ch5.html", "passage_text": "This section might be called Discussion or it might be called Summary of Findings. The purpose of this section is to highlight the major statistical findings from the results section and interpret them. First, restate the overall purpose of the study."}, {"url": "http://www.excellent-proofreading-and-writing.com/scientific-paper-4.html", "passage_text": "Often the conclusion will be in the final paragraph of the discussion but it can sometimes be in a separate section. This is the overall main point or points that you want your readers to remember. They should be clearly stated."}, {"url": "https://explorable.com/writing-a-conclusion", "passage_text": "This is a very quick synopsis of the results and discussion. Writing a conclusion involves summing up the paper and giving a very brief description of the results, although you should not go into too much detail about this. Anybody reading the conclusion has read the entire paper, so the conclusion merely acts as an aid to memory."}, {"url": "http://www.excellent-proofreading-and-writing.com/scientific-paper-4.html", "passage_text": "Discussion. In the discussion you should explain your results, how they relate to the literature and any implications they might have for future use. A good discussion will explain why your results and the whole paper is important. You'll show that your results can add new knowledge to your chosen area of work. In the discussion you should refer to the literature when explaining and discussing your results."}, {"url": "http://www.ehow.com/how_2062895_write-conclusion-discussion-section-lab.html", "passage_text": "Crucial aspects of a lab report are the discussion and conclusion. In the shorter version of a lab report, the discussion section is typically separated from the results section and serves as a conclusion as well."}]