[{"url": "https://aquariumprofessionals.com/article_algae.htm", "passage_text": "Like plants, all species of algae need light, water and nutrients to grow. Since an aquarium provides the water, we re left with two factors that you can control to prevent the rapid accumulation of algae. These are: the amount of light the aquarium receives; and the levels of nutrients dissolved in the water. "}, {"url": "http://freshaquarium.about.com/od/algae/a/attackalgae.htm", "passage_text": "1 Lights left on too long. 2  Aquarium in a location with direct sunlight. 3  Overfeeding the fish water changes. 4  Using water with high nutrients. 5  Reduce Lighting – Don't place the tank where there is direct sunlight, for even part of the day. 6  Sunlight can, and will, promote algae growth. 1 Overfeeding the fish water changes. 2  Using water with high nutrients. 3  Reduce Lighting – Don't place the tank where there is direct sunlight, for even part of the day. 4"}, {"url": "http://www.aquariumfish.net/information/green_water.htm", "passage_text": "Some types of algae float and multiply in the water. Other types of algae grow on objects such as the rocks, ornaments, gravel, plants, and the sheets of glass or plastic in your fish's home. All Algae is not Green. There is also black algae, brown algae, red algae, and several other color variations. More importantly there is also information about why algae is growing in your fish's home. Your fish's home might be an aquarium, a fish bowl, or a pond. The comments on this page apply to all three types of fish homes. The ad below links to this advertiser."}, {"url": "http://www.firsttankguide.net/algae.php", "passage_text": "1 Make sure that any additives you are using in the tank do not contain phosphates or Nitrates, there is enough phosphate in your tap water, and any fish in your tank should provide sufficient Nitrates. 2  Keep your tank population under control. 1 Make sure that the tank receives no direct sunlight. 2  Direct sunlight, even for a short time or only on part of the tank will encourage algae growth, especially where the light hits the tank. 3  Don't overfeed the fish."}, {"url": "http://www.thinkfish.co.uk/article/algae-and-how-to-kill-remove-and-control-algae-in-a-fish-tank", "passage_text": "Algae are basically a primitive plant or photosynthetic organism that does not have a vascular system (complex structure). It is impossible to eliminate algae from entering the aquarium; it will arrive through tap water, from the air, from fish, and from plants. The best method to prevent and remove algae in the aquarium is to use some natural algae-eating fish and shrimps. For small aquariums and/or with small fish, Dwarf Plecs (Peckoltia sp.), Otocinclus Catfish, and Japonica/Algae Shrimps (Japonica sp.) are best."}, {"url": "http://freshaquarium.about.com/od/algae/a/attackalgae.htm", "passage_text": "1 Clean It Up-If you see algae beginning to grow on the glass, rocks, or other hard surfaces of the tank, remove it. 2  Scrape the glass, remove rocks and scrub them, and vacuum the gravel when you perform water changes. 3  Keep Live Plants – Live plants will use many of the nutrients that algae thrive upon. 1 Overfeeding the fish water changes. 2  Using water with high nutrients. 3  Reduce Lighting – Don't place the tank where there is direct sunlight, for even part of the day. 4  Sunlight can, and will, promote algae growth."}, {"url": "http://www.fish.com/fish-articles/what-you-can-do-to-help-prevent-algae-growth/723/", "passage_text": "To cut down on excessive growth, keep in mind that light and nutrients in the water are the major causes of algae growth. There are several ways that you can keep the re-growth of algae in your aquarium under control. First of all, do not overfeed the fish. Food that isn't eaten eventually settles among the substrate and begins to break down to a form of detritus."}, {"url": "http://freshaquarium.about.com/od/algae/a/attackalgae.htm", "passage_text": "If an excess of any are available, algae will grow like wildfire, just like weeds growing in a garden. Obviously you can't do without water in your aquarium, but you can control the amount of light and nutrients are in the water. Here are the common reasons for algae overgrowth. 1  Lights left on too long. 2  Aquarium in a location with direct sunlight. 1 Overfeeding the fish water changes. 2  Using water with high nutrients. 3  Reduce Lighting – Don't place the tank where there is direct sunlight, for even part of the day. 4  Sunlight can, and will, promote algae growth."}, {"url": "http://www.firsttankguide.net/algae.php", "passage_text": "Some people do have good luck with algae eaters, but it can really be luck of the draw. Not all species of fish sold as algae eaters do eat algae, and some can't eat algae. Even the ones that do eat algae are really unlikely to eat enough algae to make a difference in the algae growth in your aquarium. Selling fish to eat algae is one of the common myths and misconceptions about fish and aquarium keeping in the pet trade. 1 Make sure that the tank receives no direct sunlight. 2  Direct sunlight, even for a short time or only on part of the tank will encourage algae growth, especially where the light hits the tank. 3  Don't overfeed the fish."}, {"url": "http://www.aquariumfish.net/information/warm_water_aquariums_p2.htm", "passage_text": "Page 2 about Warm Water Fish and Aquariums This page continues the discussion about how to keep Warm Water Fish in an aquarium with an aquarium heater and thermometer. On this page you can read about how to clean your Warm Water Aquarium and other important topics. Click here to go back to the first page of this discussion. [_advertising/_that_fish_place/display_ads/display_heaters_1/display_heaters_1.htm] 1. How to Clean your Warm Water Aquarium. Once each week clean the inside of your aquarium with a Scrubbing Pad. Use a Scrubbing Pad that is labeled for use in aquariums like the Jungle Algae Remover shown in the illustration to the right. Use your Scrubbing Pad to scrub the inside of your aquarium once a week"}]