[{"url": "https://en.wikipedia.org/wiki/List_of_Characters_in_The_Jetsons", "passage_text": "The Jetsons is an animated television comedy produced by Hanna-Barbera and first broadcast in prime-time on ABC as part of the 1962–63 United States network television schedule. Additional episodes were produced from 1985–1987, with the same cast of characters."}, {"url": "https://en.wikipedia.org/wiki/The_Jetsons", "passage_text": "The Jetson family (clockwise from upper left) — Rosie (robot), George, Jane, Judy, Elroy, and Astro the dog. Main article: List of The Jetsons characters. 1  George Jetson: age 40, is the main character and protagonist of the series."}, {"url": "https://en.wikipedia.org/wiki/List_of_Characters_in_The_Jetsons", "passage_text": "George J. Jetson is a fictional character and the 40-year-old head of the Jetson family. He is the husband of Jane Jetson and the father of teenage daughter Judy and elementary school aged son Elroy."}, {"url": "https://en.wikipedia.org/wiki/The_Jetsons", "passage_text": "The Jetsons is an American animated sitcom produced by Hanna-Barbera, originally airing in primetime from September 23, 1962, to March 17, 1963, then later in syndication, with new episodes in 1985 to 1987 as part of The Funtastic World of Hanna-Barbera block."}, {"url": "http://www.crazyabouttv.com/jetsons.html", "passage_text": "The Jetsons TV show was an animated kids TV series about the lives of the Jetson family who live with their dog Astro and housekeeper robot Rosie in a high rise home of the future ... complete with a parking garage for their spacecar."}, {"url": "https://en.wikipedia.org/wiki/List_of_Characters_in_The_Jetsons", "passage_text": "The Jetsons family: (left to right, top row) Rosie (the robot maid), George, Jane, and Judy; (bottom row) Astro (the dog), Elroy."}, {"url": "http://hanna-barbera.wikia.com/wiki/The_Jetsons", "passage_text": "The Jetsons is a prime-time animated sitcom that was produced by Hanna-Barbera for Screen Gems (and later Worldvision Enterprises). The original incarnation of the series aired Sunday nights on ABC from September 23, 1962, to March 3, 1963."}, {"url": "http://sharetv.com/shows/the_jetsons/characters", "passage_text": "489 Fans. - Add to My Shows. The Jetsons was a prime-time animated television series produced by Hanna-Barbera Productions, and aired on Sunday nights on ABC from September 23, 1962 to March 3, 1963."}, {"url": "https://en.wikipedia.org/wiki/List_of_Characters_in_The_Jetsons", "passage_text": "Rosie the maid is a humanoid robot fictional character in The Jetsons animated television series of the 1960s. She is the title family's maid and housekeeper. Jean Vander Pyl provided the voice for Rosie."}]