[{"url": "http://www.premierrad.com/ultrasound-abdominal", "passage_text": "Abdominal/Retroperitoneal Ultrasound. An Abdominal Ultrasound produces a picture of the organs and other structures in the upper abdomen, encompassing the liver, gallbladder, spleen, pancreas, aorta, both kidneys and the bladder, through the use of high frequency sound waves that are displayed in a real time image."}, {"url": "http://www.answers.com/Q/Which_organs_are_retroperitoneal", "passage_text": "Retroperitoneal organs are found behind the peritoneum, between it and the abdominal wall. These include the kidneys, adrenals, and pancreas."}, {"url": "http://ghr.nlm.nih.gov/condition/retroperitoneal-fibrosis", "passage_text": "Retroperitoneal fibrosis is a disorder in which inflammation and extensive scar tissue (fibrosis) occur in the back of the abdominal cavity, behind (retro-) the membrane that surrounds the organs of the digestive system (the peritoneum)."}, {"url": "http://www.healthline.com/health/retroperitoneal-inflammation", "passage_text": "Inflammation that affects the retroperitoneal space is a serious medical condition with a high mortality rate. However, early diagnosis and treatment improves the outlook for this condition. The retroperitoneal space is the space between the peritoneum and the posterior abdominal wall."}, {"url": "http://www.answers.com/Q/What_are_retroperitoneal_organs", "passage_text": "Is the anatomical space behind (retro) the abdominal cavity.Structures that lie behind the peritoneum are termed retroperitoneal.   Kidneys, Bladder, Pancreas, Vena C … ava, Aorta, parts of the Duodenum, portions of the Colon, Reproductive organs."}, {"url": "http://anatomyzone.com/tutorials/digestive/intraperitoneal-and-retroperitoneal-organs/", "passage_text": "Read more. The retroperitoneal organs are the kidneys at the back. You can see the kidneys here. And the adrenal glands which sit on top are retroperitoneal. We've got the head and the body of the pancreas, which are retroperitoneal (the tail is actually intraperitoneal)."}, {"url": "https://en.wikipedia.org/wiki/Retroperitoneal_space", "passage_text": "The retroperitoneal space (retroperitoneum) is the anatomical space (sometimes a potential space) in the abdominal cavity behind (retro) the peritoneum. It has no specific delineating anatomical structures. Organs are retroperitoneal if they have peritoneum on their anterior side only."}, {"url": "http://www.mananatomy.com/digestive-system/retroperitoneal-space", "passage_text": "Human Anatomy » Digestive System » Retroperitoneal Space. Retroperitoneal space is the anatomical space in the abdominal cavity behind the parietal peritoneum. It extends from the 12 th thoracic vertebra and 12 th rib above to the sacrum and iliac crest below."}]