[{"url": "http://www.thinkbabynames.com/meaning/1/Anwar", "passage_text": "Anwar /an-war/ [2 sylls.] as a boys' name (also used as girls' name Anwar) is of Arabic origin, and the meaning of Anwar is light. Made famous by Egyptian President Anwar Sadat. Kreatif forms: Anawar, Anwarrio, Arwar. Variations. Anwar is an uncommonly occurring first name for men but a very prominent surname for both adults and children (#14745 out of 150436, Top 10%). (2000 U.S. Census). Displayed below is the birth name popularity of Anwar for boys. Anwar has not been ranked in the list so f"}, {"url": "http://www.behindthename.com/name/anwar", "passage_text": "Means brighter, more luminous in Arabic. This name was borne by Egyptian president Anwar Sadat (1918-1981), who was assassinated three years after being awarded the Nobel Peace Prize."}, {"url": "http://www.ancestry.com/name-origin?surname=anwar", "passage_text": "Muslim (widespread throughout the Muslim world): from a personal name based on Arabic anwar ‘brighter’, an elative adjective derived from nur ‘light’. Anwar (with a long a) is the plural of nur (see Noor) and means ‘rays (of light)’. Source: Dictionary of American Family Names ©2013, Oxford University Press. Find out where people with the family name Anwar lived before coming to the United States. Using Ancestry, you can search through passenger arrival records, naturalization records, border crossings, emigration records, passport applications, and even convict transportation records."}, {"url": "http://what-does-my-name-mean.org/name/anwar/", "passage_text": "Meaning: Anwar (En-Wur) m.- Means brightest, as in light, brightest lightAnwaar (En-war) f.- Means many lights lights. Both are derived from the root word noor or nur which means light. anwaar is a girl's name but anwar is a boy's name. It is derived from the root word An-Nur which means light. anwar, when used as a girl's name means light, enlighted. Anwar if funny kind, sharing, smart, big heart and strong mine person. Anwar. Anwar (En-Wur) m.- Means brightest, as in light, brightest lightAnwaar (En-war) f.- Means many lights lights. Both are derived from the root word noor or nur which means light."}, {"url": "http://www.meaning-of-names.com/african-names/anwar.asp", "passage_text": "Meaning of Anwar. African name. In African, the name Anwar means-the brightest. Other origins for the name Anwar include-African, Welsh.The name Anwar is most often used as a boy name or male name. African Name Meaning-the brightest. Origin-Africa. Alternate Origins-Welsh. Global Star Registery-Name a star after someone special!"}, {"url": "http://www.ourbabynamer.com/meaning-of-Anwar.html", "passage_text": "Anwar is generally used as a boy's name. It consists of 5 letters and 2 syllables and is pronounced An-war. In the U.S. in 2014, it ranked 3352 in baby name popularity for boys with 32 occurrences. Less than 5 girls were given the name. View the Anwar Name Popularity Page to see how the popularity trend for Anwar has changed since 1880, or to compare the popularity of Anwar to other names. Variants of the name Anwar include Anwer. The name Anpaytoo is a form of Anwar."}, {"url": "http://www.sheknows.com/baby-names/name/anwar", "passage_text": "Arabic Meaning: The name Anwar is an Arabic baby name. In Arabic the meaning of the name Anwar is: Beams of light; shafts of light. Muslim Meaning: The name Anwar is a Muslim baby name. In Muslim the meaning of the name Anwar is: Beautiful. Disclosed. Welsh Meaning: The name Anwar is a Welsh baby name."}]