[{"url": "http://www.oxforddictionaries.com/it/definizione/inglese/aronia", "passage_text": "A plant of the genus Aronia in the rose family, especially (in gardening) a chokeberry. Frasi di esempio. 1  But with an eye on health-conscious customers he is mainly reintroducing old berries and fruits like elderberries, aronia (chokeberries), gooseberries and currants, all of which are extremely high in antioxidants. By continuing to use our website, you are agreeing to our use of cookies. You can change your cookie settings at any time."}, {"url": "http://www.oxforddictionaries.com/definition/english/aronia", "passage_text": "By continuing to use our website, you are agreeing to our use of cookies. You can change your cookie settings at any time. Example sentences. 1  But with an eye on health-conscious customers he is mainly reintroducing old berries and fruits like elderberries, aronia (chokeberries), gooseberries and currants, all of which are extremely high in antioxidants."}, {"url": "http://www.merriam-webster.com/dictionary/Aronia", "passage_text": "Definition of ARONIA. : a small genus of shrubs (family Rosaceae) comprising the chokeberries and having white or pink flowers in terminal compound cymes. ADVERTISEMENT. New Latin, from Greek arōnia medlar tree. Note that some information is displayed differently in the Unabridged. To access the complete Unabridged Dictionary, with an additional 300,000 words that aren't in our free dictionary, start a free trial."}, {"url": "http://www.oxforddictionaries.com/definition/english/aronia", "passage_text": "We use cookies to enhance your experience on our website. By continuing to use our website, you are agreeing to our use of cookies. You can change your cookie settings at any time. Find out more. Example sentences. 1  But with an eye on health-conscious customers he is mainly reintroducing old berries and fruits like elderberries, aronia (chokeberries), gooseberries and currants, all of which are extremely high in antioxidants."}, {"url": "http://dict.hinkhoj.com/words/meaning-of-ARONIA-in-hindi.html", "passage_text": "Follow HinKhoj Dictionary on FaceBook and Google.... Tags: Hindi meaning of Aronia, Aronia meaning in hindi, Aronia ka matalab hindi me, Aroniatranslation and definition in Hindi language. Information provided about Aronia: Aronia meaning in Hindi : Get detailed meaning of ARONIA in Hindi language.This page shows Aronia meaning in Hindi with Aronia definition,translation and usage.This page provides translation and definition of Aronia in Hindi language along with grammar, synonyms and antonyms. Answer of question : Aronia ka ...."}, {"url": "https://en.wikipedia.org/wiki/Aronia", "passage_text": "A fourth species, Aronia mitschurinii, that apparently originated in cultivation, is also known as Sorbaronia mitschurinii. Red chokeberry, Aronia arbutifolia (Photinia pyrifolia), grows to 2–4m tall, rarely up to 6 m and 1-2 m wide. Aronia flowers and leaves (Aronia melanocarpa). Black chokeberry, Aronia melanocarpa (Photinia melanocarpa), tends to be smaller, rarely exceeding 1 m tall and 3 m wide, and spreads readily by root sprouts."}, {"url": "http://www.extension.iastate.edu/news/2009/mar/110401.htm", "passage_text": "Aronia melanocarpa is a perennial, deciduous shrub, native to the eastern half of the United States. Its native range extends north into Canada and south into Georgia, and includes only Winneshiek County in Iowa. Aronia is cold hardy to at least USDA Zone 3 (-40 degrees Fahrenheit). "}, {"url": "https://en.wikipedia.org/wiki/Aronia", "passage_text": "Aronia is a genus of deciduous shrubs, the chokeberries, in the family Rosaceae, native to eastern North America and most commonly found in wet woods and swamps. The genus is usually considered to contain two or three species, one of which is naturalized in Europe. Aronia flowers and leaves (Aronia melanocarpa). Black chokeberry, Aronia melanocarpa (Photinia melanocarpa), tends to be smaller, rarely exceeding 1 m tall and 3 m wide, and spreads readily by root sprouts."}]