[{"url": "http://www.gowaterfalling.com/waterfalls/tews.shtml", "passage_text": "Tews Falls is in the Spencer Gorge/Webster's Falls Conservation Area. This is another of the many waterfalls found along the Niagara Escarpment, and is one of the highest. Tews Falls is the runner up for The Most Improved Falls of 2003. In July of 2002 it was a thin trickle, barely even worth a picture. But in June of 2003, it was a beauty. Tews Falls can be reached from Webster's falls via a 30 minute hike along the Bruce Trail, or by a 5 minute drive down Harvest Road to the Tews Falls parking area. See Webster Falls for directions. There is a view area at the top of the falls that can be easily reached from the parking area"}, {"url": "http://www.waterfalls.hamilton.ca/default.asp?waterfall=11", "passage_text": "Facilities: Parking (20 spaces), Bruce Trail, park, picnic table, washrooms. Other Attractions Nearby: Convenience store, Rock Chapel Sanctuary, Borer's Falls CA, Town of Dundas, Dundas Valley CA, Hermitage Ruins, RBG, Dundurn Castle, Hamilton Farmers' Market, Crooks Hollow CA, Christie Lake CA. Directions from Hwy 403: From Hwy 403 take the Hwy 6 N (Guelph) exit and travel approximately 3 km to Hwy 5 E. (Dundas St. E.). Turn left on Hwy 5 E. and then turn left onto Ofield Rd. S. Turn right onto Harvest Rd. and park at the Spencer Gorge / Webster’s Falls CA."}, {"url": "https://en.wikipedia.org/wiki/Tew%27s_Falls", "passage_text": "Tews Falls can be reached from Webster's falls via a 30 minute hike along the Bruce Trail, or by a 5 minute drive down Harvest Road to the Tews Falls parking area. From Toronto you can go West on Dundas Street (Highway #5) until you turn south on Brock Street (To Greensville), left on Harvest road. Located at the Spencer Gorge / Webster's Falls Conservation Area in Greensville, its source is Logie's Creek. It is a short walking distance away from Webster's Falls. Also known as Hopkin's Falls and Tunis's Falls. Best viewed in the springtime as it tends to dry up in the summer months."}, {"url": "http://www.world-of-waterfalls.com/canada-tews-falls.html", "passage_text": "It was rainy on the day after we visited Tews Falls, where we got this view back towards Hamilton City before leaving for Toronto. It was rainy on the day after we visited Tews Falls, where we got this view back towards Hamilton City before leaving for Toronto. We also could have come to the car park from Webster's Falls. See that page for directions for its waterfall. However, at the intersection of Harvest Rd and Short Rd, continue east on Harvest Rd for another 400m or so towards the Tews Falls car park on the right."}, {"url": "http://www.youtube.com/watch?v=2oKQZeXWSWA", "passage_text": "Please try again later. This is my hike to see the bottom of Tews Falls, as well as Lowers Tews. I hiked to the bottom of the both falls, which took just under an hour to complete (one way). 1  People & Blogs."}, {"url": "http://www.world-of-waterfalls.com/canada-tews-falls.html", "passage_text": "Explore the best of YOUR world one waterfall at a time! Spencer Gorge / Dundas / near Waterdown / Hamilton, Ontario, Canada. Rating: 3 Difficulty: 1. Tews Falls was a very attractive plunge waterfall dropping about 41m (said to be the tallest in Southern Ontario besides Niagara Falls). We also could have come to the car park from Webster's Falls. See that page for directions for its waterfall. However, at the intersection of Harvest Rd and Short Rd, continue east on Harvest Rd for another 400m or so towards the Tews Falls car park on the right."}, {"url": "http://www.bittenescapes.com/hikes/websters-tews-dundas-peak-hamilton", "passage_text": "Hiking. As one of the most popular waterfalls in Hamilton, Webster's Falls is a 22 m high classical curtain/plunge waterfall found in the Spencer Gorge/Webster's Falls Conservation Area. Noted for its panoramas, Webster's Falls offers beautiful views of the forested depths of the gorge below. Within the park, there are washroom facilities, picnic tables and sheltered areas at the top of Webster's Falls. The area is quite pretty with a cobblestone footbridge that crosses over Spencer Creek. You can take the nature trail to Dundas Peak, which provides spectacular views of Dundas and Hamilton"}, {"url": "https://en.wikipedia.org/wiki/Tew%27s_Falls", "passage_text": "Tew's Falls, is a 41 metre ribbon waterfall, only a few metres shorter than Niagara Falls, and is the tallest waterfall found in Hamilton, Ontario, Canada. Located at the Spencer Gorge / Webster's Falls Conservation Area in Greensville, its source is Logie's Creek. It is a short walking distance away from Webster's Falls. Also known as Hopkin's Falls and Tunis's Falls. Best viewed in the springtime as it tends to dry up in the summer months."}]