[{"url": "http://www.guitarlessons.com/guitar-lessons/beginner-lessons/strings-of-the-guitar/", "passage_text": "Learn how to read chord digrams here! If we use the thickest string of the guitar as a starting point, the names of the strings on the guitar would be E, A, D, G, B, and E. The thickest string, or low E string, is also referred to as the 6th string. The A string is the 5th string and so on."}, {"url": "http://www.cyberfretbass.com/beginner-bass-lessons/bass-guitar-notes/", "passage_text": "The first notes you want to get to know on the bass are the open strings. The 4th string is the lowest sound string (closest to the ceiling), and the 1st string is the highest sounding string (closest to the floor). 4th=E, 3rd=A, 2nd=D, 1st=G."}, {"url": "https://answers.yahoo.com/question/index?qid=20080313034119AAL9BZ7", "passage_text": "Report Abuse. When holding the guitar on your lap, (that is if your right handed)....the bottom string, the thinnest is the first string, E, and then the B, second, the G is called the third, the D is the fourth, the A is called the fifth, and the top, closest to your face is the bass E, the sixth string."}, {"url": "http://www.youtube.com/watch?v=rHDQNvTYdXo", "passage_text": "Tuning the D string on violin should produce a ringing tone on the top of the note. Learn more about how to tune a violin D string with tips from a violinist in this free music lesson video on violin tuning. Expert: Elizabeth Willis. Bio: Elizabeth Willis is a classically trained violinist and pianist."}, {"url": "http://www.guitarlessons.com/guitar-lessons/beginner-lessons/strings-of-the-guitar/", "passage_text": "The guitar is tuned in 4ths. The only two strings that are not a 4th apart are the G and B strings. The distance from the G to B strings is a Major 3rd. If you start on the low E string and count up four notes (E F G A) you would land on an A. The distance from the 6th string to the fifth string is a 4th."}, {"url": "http://www.guitarlessons.com/guitar-lessons/beginner-lessons/strings-of-the-guitar/", "passage_text": "If we use the thickest string of the guitar as a starting point, the names of the strings on the guitar would be E, A, D, G, B, and E. The thickest string, or low E string, is also referred to as the 6th string. The A string is the 5th string and so on."}]