[{"url": "https://en.wikipedia.org/wiki/Overweight", "passage_text": "The degree to which a person is overweight is generally described by body mass index (BMI). Overweight is defined as a BMI of 25 or more, thus it includes pre-obesity defined as a BMI between 25 and 30 and obesity as defined by a BMI of 30 or more. Pre obese and overweight however are often used interchangeably thus giving overweight a common definition of a BMI of between 25 -30."}, {"url": "http://www.nhs.uk/Conditions/Obesity/Pages/Introduction.aspx", "passage_text": "Introduction. Obesity is a term used to describe somebody who is very overweight, with a lot of body fat. It's a common problem, estimated to affect around one in every four adults and around one in every five children aged 10 to 11 in the UK. Defining obesity. There are many ways in which a person's health in relation to their weight can be classified, but the most widely used method is body mass index (BMI). BMI is a measure of whether you're a healthy weight for your height. You can use the BMI healthy weight calculator to work out your score."}, {"url": "http://www.who.int/mediacentre/factsheets/fs311/en/", "passage_text": "Body mass index (BMI) is a simple index of weight-for-height that is commonly used to classify overweight and obesity in adults. It is defined as a person's weight in kilograms divided by the square of his height in meters (kg/m2). The WHO definition is: 1  a BMI greater than or equal to 25 is overweight. 2  a BMI greater than or equal to 30 is obesity. 1 Of these over 600 million were obese. 2  39% of adults aged 18 years and over were overweight in 2014, and 13% were obese. 3  Most of the world's population live in countries where overweight and obesity kills more people than underweight. 4  42 million children under the age of 5 were overweight or obese in 2013."}, {"url": "http://theweightofthenation.hbo.com/themes/what-is-obesity", "passage_text": "Obesity Explained. 1  The terms overweight and obese describe weight ranges that are above what is medically accepted as healthy. 2  Being in either the overweight or obese weight ranges increases the likelihood of certain diseases and health problems. 3  Over one-third of U.S. adults (~36%) are obese. 1 The terms overweight and obese describe weight ranges that are above what is medically accepted as healthy. 2  Being in either the overweight or obese weight ranges increases the likelihood of certain diseases and health problems. 3  Over one-third of U.S. adults (~36%) are obese."}, {"url": "http://theweightofthenation.hbo.com/themes/what-is-obesity", "passage_text": "1 Weight and height are used to calculate a number called the body mass index (BMI). 2  For most people, BMI is a good estimate of body fatness. 3  A BMI of 25 to 29.9 is considered overweight. 4  A BMI of 30 or higher is considered obese. 1 The terms overweight and obese describe weight ranges that are above what is medically accepted as healthy. 2  Being in either the overweight or obese weight ranges increases the likelihood of certain diseases and health problems. 3  Over one-third of U.S. adults (~36%) are obese."}, {"url": "http://www.nhs.uk/Conditions/Obesity/Pages/Introduction.aspx", "passage_text": "Obesity is a term used to describe somebody who is very overweight, with a lot of body fat. Defining obesity. There are many ways in which a person's health in relation to their weight can be classified, but the most widely used method is body mass index (BMI). BMI is a measure of whether you're a healthy weight for your height. You can use the BMI healthy weight calculator to work out your score."}, {"url": "http://www.englishandculture.com/blog/bid/97938/How-to-Describe-a-Person-s-Appearance-in-English", "passage_text": "That person is obese : This phrase means that the person is extremely overweight by medical standards and that they are in poor health. He is a bit chubby: This term is sometimes used to describe babies and kids. He is extremely overweight: This is a more polite way to say that someone is fat. You should not say this person is fat especially not directly to the person. She is quite slim or she is slender: This is a polite way to say that someone is thin."}, {"url": "https://en.wikipedia.org/wiki/Obesity", "passage_text": "In Western countries, people are considered obese when their body mass index (BMI), a measurement obtained by dividing a person's weight by the square of the person's height, exceeds 7002294199500000000♠30 kg/m2, with the range 25- 7002294199500000000♠30 kg/m2 defined as overweight. "}, {"url": "http://www.englishandculture.com/blog/bid/97938/How-to-Describe-a-Person-s-Appearance-in-English", "passage_text": "This does not mean that they are extremely overweight. That person is obese: This phrase means that the person is extremely overweight by medical standards and that they are in poor health. He is a bit chubby: This term is sometimes used to describe babies and kids. You can say that a baby has chubby cheeks if his cheeks are fat. He is extremely overweight: This is a more polite way to say that someone is fat. You should not say this person is fat especially not directly to the person. She is quite slim or she is slender: This is a polite way to say that someone is thin."}]