[{"url": "http://www.alltrucking.com/faq/owner-operator-truck-driver-salary/", "passage_text": "A CDL Tanker driver getting $63,000 a year is making $100k less than an O/O and a trucker with a CDL A making $57,000 a year average is getting paid more than $106,000 less than an Owner Operator in the United States."}, {"url": "http://www.ehow.com/info_8468347_salary-truck-driver-owner-operator.html", "passage_text": "Some owner operators earn by the mile but pay for their own operating expenses. For example, Trucking School USA states that drivers average approximately $1.15 per mile. This translates to about $115,000 per year before paying taxes and the expenses of operating the truck."}, {"url": "http://www.truckdriverssalary.com/owner-operator-salary/", "passage_text": "Now the better question is how much do owner operators actually net? In reality, many owner operators will only take home $35,000-$50,000 per year with a 1st year average of $42,500. Of course, this will vary epending on how much they gross and their actual expenses."}, {"url": "http://www.alltrucking.com/faq/owner-operator-truck-driver-salary/", "passage_text": "As of November 19th, 2013 an Owner Operator had job listings with an average overall pay of $163,000 a year which is $100,000 a year more than every other single trucking position compared to. An O/O earns more than $100,000 more than a $63,000 a year CDL Hazardous Materials driver."}, {"url": "http://www.overdriveonline.com/record-year-for-owner-operator-income/", "passage_text": "Owner-operators operating in flatbed earned more than $60,000 in average net income (total revenue minus expenses) last year. Owner-operators, led by independents and flatbedders, had a record year for net income, according to averages from ATBS, the nation’s largest owner-operator financial services provider. Leased operators and independents together cleared an average $56,167 during 2014."}, {"url": "https://www.nonforceddispatch.com/owner-operator-pay/", "passage_text": "Landstar pays a percentage of the load revenue for each load you haul plus 100% of the fuel surcharge. Owner operator pay will vary depending on whether you haul with your own trailer or lease a trailer from Landstar. Below is an example of how to calculate load revenue with a company trailer."}, {"url": "http://www.payscale.com/research/US/Job=Truck_Owner_%2f_Operator/Salary", "passage_text": "In this occupation, salaries for the relatively untested average out to $72K, but folks in the five-to-10 year range enjoy a much heftier median of $101K. Truck Owners and Operators with one to two decades of relevant experience report an average salary of approximately $101K."}, {"url": "http://www.truckdriverssalary.com/owner-operator-salary/", "passage_text": "According to Indeed, owner operators earn an average salary of $141,000. That’s more than double the average salary of an OTR trucker. But again, this is the average gross salary and you should not stop there."}, {"url": "http://www.truckdriverssalary.com/owner-operator-salary/", "passage_text": "According to Indeed, owner operators earn an average salary of $141,000. That’s more than double the average salary of an OTR trucker. In reality, many owner operators will only take home $35,000-$50,000 per year with a 1st year average of $42,500."}]