[{"url": "http://environmentvictoria.org.au/sites/default/files/useruploads/Water4Rivers_Goulburn.pdf?phpMyAdmin=8%2CSW0pHXD5tewKNvRRFVgHetb%2Ca", "passage_text": "Page 2 Water for Rivers Goulburn edition Summer 2007/08 Where does all the water go? The Goulburn Broken catchment, which includes the Goulburn’s tributary – the Broken River – is part of the Murray Darling Basin and is the foundation of Victoria’s and the Basin’s water resources and economic prosperity. Right: The Goulburn River at Kevington. Stream condition in these upper reaches is generally good and the ﬂ ow regime near natural.Photo: Goulburn Broken Catchment Management AuthorityBelow: The Barred galaxias lives in mountain creeks in the upper Goulburn catchment."}, {"url": "http://www.g-mwater.com.au/water-resources/surface-water", "passage_text": "Regulated Systems. A regulated system is a system of streams, creeks and rivers that is controlled or ‘regulated' by water storages which allow the water to be released when it is required. Almost all of the Goulburn-Murray Water systems are regulated systems. Surface Water. Goulburn-Murray Water is responsible for all Victorian water ways and bodies in its region north of the Great Divide covering approximately 68,000 square kilometres. The surface water managed includes an extensive network of streams, creeks, rivers, lakes, weirs and reservoirs, and also irrigation canals."}, {"url": "https://en.wikipedia.org/wiki/Murray%E2%80%93Darling_basin", "passage_text": "It spans most of the states of New South Wales, Victoria, and the Australian Capital Territory, and parts of the states of Queensland (lower third) and South Australia (southeastern corner). The basin is 3,375 kilometres (2,097 mi) in length, with the Murray River being 2,530 km (1,570 mi) long. Total water flow in the Murray–Darling basin 1885 to the present has averaged around 24,000 gigalitres (24 km3; 19,000,000 acre·ft) per year. This is the lowest rate of the world's major river systems."}, {"url": "http://www.bom.gov.au/water/nwa/2010/mdb/physical.html", "passage_text": "1 Murray River, which forms the border of Victoria and New South Wales, and flows east to west for 2,375 km. 2  Darling River, which begins in northern New South Wales and flows 2,844 km (including its major tributaries – the Culgoa, Balonne and Condamine rivers) southwest to its junction with the Murray River at Wentworth. The MDB is defined in Section 18A of the Water Act 2007 (Cwlth) . It includes all water resources within or beneath the MDB, but does not include groundwater that forms part of the Great Artesian Basin (GAB)."}, {"url": "https://en.wikipedia.org/wiki/Murray%E2%80%93Darling_basin", "passage_text": "1 A number of small catchments in South Australia, of which the largest are the Angas River flowing through Strathalbyn and the Finniss River further west, are part of the Murray–Darling Basin. Total water flow in the Murray–Darling basin 1885 to the present has averaged around 24,000 gigalitres (24 km3; 19,000,000 acre·ft) per year. This is the lowest rate of the world's major river systems."}, {"url": "http://environmentvictoria.org.au/sites/default/files/useruploads/Water4Rivers_Goulburn.pdf?phpMyAdmin=8%2CSW0pHXD5tewKNvRRFVgHetb%2Ca", "passage_text": "The Goulburn Murray irrigation system was developed in the 1920s and its channel system extends over thousands of kilometers, reaching as far as Ouyen near Mildura. It’s an amazing feat of engineering providing water resources and livelihoods to communities spread across northern Victoria. Right: The Goulburn River at Kevington. Stream condition in these upper reaches is generally good and the ﬂ ow regime near natural.Photo: Goulburn Broken Catchment Management AuthorityBelow: The Barred galaxias lives in mountain creeks in the upper Goulburn catchment."}, {"url": "http://www.g-mwater.com.au/water-resources", "passage_text": "Water Resources. Goulburn-Murray Water is responsible for the management of 7 river basins and their associated water supply systems, north of the Great Divide covering approximately 68,000 square kilometres. Each river basin is composed of the catchment for one or more major rivers and their tributaries. The catchment of a water body (river, stream, dam, etc) is the area of natural and man-made landscape from which water flows into the water body."}, {"url": "http://www.catawbariverkeeper.org/about-the-catawba/catawba-wateree-facts/", "passage_text": "One of the major tributaries of the Catawba is the Linville River, which is pictured below as it flows through the Linville Gorge National Wilderness Area. The Wateree River meanders for approximately 80 miles to Lake Marion. Most of the major tributaries of the Catawba River (including the Linville River, the Johns River, Wilson Creek and the Little River are truly free flowing and many of them (including Wilson Creek) have challenging sections of whitewater."}, {"url": "https://en.wikipedia.org/wiki/Murray%E2%80%93Darling_basin", "passage_text": "The Murray–Darling basin is a large geographical area in the interior of southeastern Australia. Its name is derived from its two major rivers, the Murray River and the Darling River. The basin, which drains around one-seventh of the Australian land mass, is one of the most significant agricultural areas in Australia. Total water flow in the Murray–Darling basin 1885 to the present has averaged around 24,000 gigalitres (24 km3; 19,000,000 acre·ft) per year. This is the lowest rate of the world's major river systems."}]