[{"url": "http://www.lpn.com/state/california-lpn/", "passage_text": "Licensed Practical Nurses (LPN) in California earn an average of $24.01/hr and a yearly income of $49,940. Nurses working in metropolitan areas tend to earn higher salaries than in non-metropolitan parts of the state, although there is likely to be a relatively higher cost of living associated in those areas. "}, {"url": "http://money.usnews.com/careers/best-jobs/licensed-practical-and-licensed-vocational-nurse/salary", "passage_text": "The average salary of a licensed practical and licensed vocational nurse working in San Francisco is $62,330. In 2013, registered nurses had an average salary of $68,910, and nurse practitioners had an average salary of $95,070. However, some nursing positions earn less, including nursing aides, who made $26,020, and medical assistants, who took home $30,780 in 2013."}, {"url": "http://www.payscale.com/research/US/Job=Licensed_Vocational_Nurse_(LVN)/Hourly_Rate/b447bfda/Los-Angeles-CA", "passage_text": "(United States). The average rate for a Licensed Vocational Nurse (LVN) in Los Angeles, California is $20.44 per hour. A skill in Acute Care is associated with high pay for this job. Most people with this job move on to other positions after 20 years in this field. The average rate for a Licensed Vocational Nurse (LVN) in Los Angeles, California is $20.44 per hour. A skill in Acute Care is associated with high pay for this job"}, {"url": "http://money.usnews.com/careers/best-jobs/licensed-practical-and-licensed-vocational-nurse/salary", "passage_text": "The average salary of a licensed practical and licensed vocational nurse working in Sacramento, California is $58,090. In 2013, registered nurses had an average salary of $68,910, and nurse practitioners had an average salary of $95,070. However, some nursing positions earn less, including nursing aides, who made $26,020, and medical assistants, who took home $30,780 in 2013."}, {"url": "http://www.lvnprogramsincalifornia.net/lvn-salary-in-california/", "passage_text": "LVN Salary in California. If you’re thinking about becoming a Licensed Vocational Nurse, you’ll be interested to know that the average LVN salary in California is almost 10% higher than elsewhere in the United States according to www.BLS.gov. Location, Location, Location. If you are concerned that LVN salaries are too low in your part of California, you may want to consider relocating to one of the state’s metropolitan centers. On average, the closer you work to the Bay Area, Los Angeles, Sacramento and San Diego, the more money you will earn."}, {"url": "http://www.lvnprogramsincalifornia.net/lvn-salary-in-california/", "passage_text": "For example, BLS.gov data shows that LVNs in Salinas earn the highest average salary of anywhere in the country at $59,670 per year, just ahead of vocational nurses in the Bay Area (San Francisco, San Jose and Oakland in particular) who also average close to $60,000 annually. Location, Location, Location. If you are concerned that LVN salaries are too low in your part of California, you may want to consider relocating to one of the state’s metropolitan centers. On average, the closer you work to the Bay Area, Los Angeles, Sacramento and San Diego, the more money you will earn."}, {"url": "http://www.indeed.com/salary/q-Licensed-Vocational-Nurse-l-California.html", "passage_text": "Average Licensed Vocational Nurse salaries for job postings in California are 7% higher than average Licensed Vocational Nurse salaries for job postings nationwide. "}, {"url": "http://nursesalaryguide.net/licensed-practical-nurse-lpn-salary-lvn/", "passage_text": "The latest data from the Bureau of Labor Statistics shows that the average annual salary for a LPN or LVN working in the United States is $42,400. This works out at $20.30 per hour, $815 per week and $3,533 per month. Look at the table below to see how this compares with the national average wage. Find out how much a Licensed Practical Nurse (LPN) makes. This page will show you all of the data covering LPN salary information – remember a Licensed Vocational Nurse LVN salary is the same thing in Texas and California."}, {"url": "http://www.indeed.com/salary/q-LVN-l-California.html", "passage_text": "Average LVN salaries for job postings in California are 7% higher than average LVN salaries for job postings nationwide. "}]