[{"url": "http://medical-dictionary.thefreedictionary.com/sebaceous+nevus", "passage_text": "nevus comedo´nicus a rare epidermal nevus marked by one or more patches 2 to 5 cm or more in diameter, in which there are collections of large comedones or comedolike lesions. This condition is occasionally associated with other lesions such as ichthyosis, vascular nevi, and cataracts. 1. A circumscribed malformation of the skin, especially one that is colored by hyperpigmentation or increased vascularity; a nevus may be predominantly epidermal, adnexal, melanocytic, vascular, or mesodermal, or a compound overgrowth of these tissues."}, {"url": "https://en.wikipedia.org/wiki/Comedo", "passage_text": "A comedo is a clogged hair follicle (pore) in the skin. Keratin (skin debris) combines with oil to block the follicle. A comedo can be open (blackhead) or closed by skin (whitehead), and occur with or without acne. The word comedo comes from Latin to suggest the worm-like look of a blackhead that has been secreted. The plural of comedo is comedones. A comedo may be open to the air (blackhead) or closed by skin (whitehead). Being open to the air causes oxidization, which turns it black. Propionibacterium acnes is the suspected infectious agent in acne. It can proliferate in sebum and cause inflamed pustules (pimples) characteristic of acne."}, {"url": "http://medical-dictionary.thefreedictionary.com/sebaceous+nevus", "passage_text": "2. a type of hamartoma representing a circumscribed stable malformation of the skin and occasionally of the oral mucosa, which is not due to external causes; the excess (or deficiency) of tissue may involve epidermal, connective tissue, adnexal, nervous, or vascular elements. 1. A circumscribed malformation of the skin, especially one that is colored by hyperpigmentation or increased vascularity; a nevus may be predominantly epidermal, adnexal, melanocytic, vascular, or mesodermal, or a compound overgrowth of these tissues."}, {"url": "http://medical-dictionary.thefreedictionary.com/sebaceous+nevus", "passage_text": "nevus. pl. nevi [L.] a circumscribed stable malformation of the skin and occasionally of the oral mucosa, which is not due to external causes; the excess (or deficiency) of tissue may involve epidermal, connective tissue, adnexal, nervous, or vascular elements; called also mole. 1. A circumscribed malformation of the skin, especially one that is colored by hyperpigmentation or increased vascularity; a nevus may be predominantly epidermal, adnexal, melanocytic, vascular, or mesodermal, or a compound overgrowth of these tissues."}, {"url": "http://medical-dictionary.thefreedictionary.com/sebaceous+nevus", "passage_text": "nevus. a circumscribed stable malformation of the skin or sometimes the oral mucosa, which is not due to external causes; the excess (or deficiency) of tissue may involve epidermal, connective tissue, adnexal, nervous, or vascular elements. 1. A circumscribed malformation of the skin, especially one that is colored by hyperpigmentation or increased vascularity; a nevus may be predominantly epidermal, adnexal, melanocytic, vascular, or mesodermal, or a compound overgrowth of these tissues."}, {"url": "http://medical-dictionary.thefreedictionary.com/comedo+nevus", "passage_text": ", comedo nevus (nē'vŭs kom'ē-dō-nī'kŭs, kom'ĕ-dō). Congenital or childhood linear keratinous cystic invaginations of the epidermis, with failure of development of normal pilosebaceous follicles. "}, {"url": "http://dermis.net/dermisroot/en/21862/diagnose.htm", "passage_text": "definition. Rare developmental abnormality of the skin in which grouped hair follicles filled with horny plugs constitute a prominent feature. Groups of comedones in a linear or band-like distribution appear on any part of the body, with the face, neck, upper arm, chest, and abdomen as predilection sites. "}, {"url": "http://emedicine.medscape.com/article/1058654-overview", "passage_text": "Pathophysiology. Many consider nevus comedonicus to be a hamartoma deriving from a failure of the mesodermal part of the folliculosebaceous unit to develop properly, with subsequent abnormal differentiation of the epithelial portion. Why some nevus comedonicus patients present late in life is not known, although a genetic mosaicism has been proposed. While the majority of cases are sporadic, several families with this condition have been documented."}]