[{"url": "http://www.linguisticsgirl.com/the-noun-phrase-modifier-in-english-grammar/", "passage_text": "The five grammatical forms that can function as noun phrase modifiers in the English language are noun phrases, adjective phrases, prepositional phrases, verb phrases, and adjective clauses. References. Brinton, Laurel J. & Donna M. Brinton. 2010."}, {"url": "http://www.myenglishpages.com/site_php_files/grammar-lesson-noun-phrases.php", "passage_text": "Possible noun modifiers. A noun phrase may optionally contain noun modifiers. If these modifiers are placed before the noun they are called pre-modifiers. However, if they are placed after the noun, they are called post"}, {"url": "http://www.englishgrammar.org/adjective-phrase/", "passage_text": "A word group that has an adjective as its head is called an adjective phrase. Note that the adjective in this phrase may be accompanied by other words such as determiners, modifiers etc. Adjective phrases can go before a noun (attributive position). They can also go after a linking verb like be (predica"}, {"url": "http://www.linguisticsgirl.com/the-noun-phrase-modifier-in-english-grammar/", "passage_text": "The Noun Phrase Modifier in English Grammar. More Information: adjective clause, adjective phrase, grammatical function, noun phrase, noun phrase modifier, prepositional phrase, relative clause, verb phrase. Noun phrase modifiers are defined as words, phrases, and clauses that describe a noun, pronoun, or noun phrase. Although adjectives and adjective phrases most frequently function to describe nouns, five grammatical forms can perform the grammatical function of noun phrase modifier in the English language."}, {"url": "http://www.myenglishpages.com/site_php_files/grammar-lesson-noun-phrases.php", "passage_text": "(My house is a noun phrase which consists of the noun house and a modifier-the possessive adjective my). A noun phrase may optionally contain noun modifiers. If these modifiers are placed before the noun they are called pre-modifiers. However, if they are placed after the noun, they are called post"}, {"url": "http://www.linguisticsgirl.com/the-noun-phrase-modifier-in-english-grammar/", "passage_text": "The first grammatical form that can perform the grammatical function of noun phrase modifier is the noun phrase. Noun phrases are defined as phrases that consist of a noun including pronouns and any determinatives, modifiers, and complements such as adjectives, determiners, verbs, prepositions, and clauses."}, {"url": "http://www.merriam-webster.com/dictionary/noun%20phrase", "passage_text": ": a phrase formed by a noun and all its modifiers and determiners; broadly: any syntactic element (as a clause, clitic, pronoun, or zero element) with a noun's function (as the subject of a verb or the object of a verb or preposition) —abbreviation NP."}]