[{"url": "http://www.softschools.com/examples/grammar/linking_verbs_examples/63/", "passage_text": "Examples: feel taste smell look grow. To find a linking verb : 1) If the verb is a form of be (be, being, been, am, is, are, was, were), you have a linking verb. 2) For other verbs, if you can replace the verb with a form of be and the sentence makes sense, you have a linking verb. Examples with explanation: John. nice"}, {"url": "http://www.chompchomp.com/terms/linkingverb.htm", "passage_text": "Recognize a linking verb when you see one. Linking verbs do not express action. Instead, they connect the subject of the verb to additional information about the subject. Look at the examples below: Keila is a shopaholic. Ising isn't something that Keila can do. The following verbs are true linking verbs: any form of the verb be [ am, is, are, was, were, has been, are being, might have been, etc.], become, and seem. These true linking verbs are always linking verbs."}, {"url": "http://www.answers.com/Q/What_is_a_linking_verb", "passage_text": "A linking verb is a verb that connects or (links) a verb to a noun or an adjective. example: I was cold. was, is has been, smelled, looked, are all linking verbs. Linking verbs do not express action. Instead they connect the subject of the verb to additional information about the subject. ___. The key thing about a 'linking verb' is that it is followed by an adjective, not an adverb."}, {"url": "http://www.donnayoung.org/english/grammar/linking-verbs.htm", "passage_text": "Linking Verbs continued ... Many important verbs do not express action; some verbs can link a noun or an adjective to the subject. This type of verb is called a linking verb. The linking verb connection between the subject to the noun or adjective is something like an equal sign. She is tall. -- She = tall. In grammar books the linked noun or linked adjective is sometimes called a predicate noun or a predicate adjective. Linking Verbs-A List & is it Used as Action or Linking. Linking verbs are verbs that do not show action; instead, the linking verb renames or describes the subject. In this example sentence, . The kitten looked happy  the verb looked is used as"}, {"url": "http://www.merriam-webster.com/dictionary/linking%20verb", "passage_text": "linking verb. noun. Tweet. grammar: a verb (such as appear, be, become, feel, grow, or seem) that connects a subject with an adjective or noun that describes or identifies the subject. Full Definition of LINKING VERB. : a word or expression (as a form of be, become, feel, or seem) that links a subject with its predicate. See linking verb defined for English-language learners. See linking verb defined for kids. ADVERTISEMENT."}, {"url": "https://simple.wikipedia.org/wiki/Linking_verb", "passage_text": "From Wikipedia, the free encyclopedia. A linking verb is a verb that connects the subject of a sentence to the complement. It is sometimes called a copula or a copular verb. An example is the word is in the sentence The sky is blue. "}, {"url": "http://www.grammar-monster.com/glossary/linking_verbs.htm", "passage_text": "Search. A linking verb is a verb which connects a subject to its predicate without expressing an action. A linking verb is used to re-identify or describe its subject. The word, phrase, or clause which follows a linking verb to re-identify or describe the subject is called the subject complement. The most common linking verb is the verb to be."}]