[{"url": "http://www.howmuchisit.org/wedding-centerpieces-cost/", "passage_text": "1 According to the Bridal Association of America, the average total price for centerpiece today is in the $1,000 to $1,300 range. 2  For example, Wedding Mountain offers a variety of options for people looking for different wedding necessities."}, {"url": "http://www.projectwedding.com/forums/centerpieces-how-much", "passage_text": "We're doing all floral centerpieces, alternating tables w/ 6 tall ($150 ea.) and 6 short ($100 ea.) ones. Cost really depends on the type of flowers and how full you want your arrangements to be. The city you live in is also a factor. My Mom is taking care of this expense, so we're very grateful."}, {"url": "http://www.weddingstats.org/average-cost-of-wedding-centerpieces.html", "passage_text": "$985 (Hired vendor). In 2015, the average total cost of professionally designed wedding centerpieces is between $902 - $1,069. 1  The most popular method for creating DIY centerpieces is to order flowers in bulk and arrange them yourself."}, {"url": "http://weddings.costhelper.com/centerpiece.html", "passage_text": "1 As with other wedding flowers, centerpieces with fewer flowers and locally grown, in-season flowers are cheaper, while large centerpieces with exotic, shipped-in flowers cost more. 2  The average total cost for floral table centerpieces is $1,272, according to The Bridal Association of America."}, {"url": "http://www.weddingstats.org/average-cost-of-wedding-centerpieces.html", "passage_text": "$272 (Do-It-Yourself). in 2015, the average total cost of DIY wedding centerpieces is between $245 - $320. This cost is based on a couple opting to create their own centerpieces instead of hiring a professional florist or event designer."}, {"url": "http://www.howmuchisit.org/wedding-centerpieces-cost/", "passage_text": "1 On average, the typical centerpiece can cost anywhere from $4 for a simple do-it-yourself centerpiece to as much as $150+ for an elegant, customized centerpiece. 2  There are different kinds of centerpieces available and the price depends on the type of centerpiece that you will buy."}]