[{"url": "http://www.merriam-webster.com/dictionary/rove", "passage_text": "Definition of ROVE. intransitive verb. : to move aimlessly: roam. transitive verb. : to wander through or over. "}, {"url": "https://en.wikipedia.org/wiki/Roving", "passage_text": "These are drawn out, by hand or machine, and slightly twisted to form lengths suitable for spinning. These unspun strands of fibre are the rovings. Roving can also mean a roll of these strands, the strands in general (as a mass noun), or the process of creating them. Because it is carded, the fibres are less parallel than top (which is combed) and are not of uniform length. Carded rovings look fluffier than combed top, which looks smooth and has a high lustre. Roving is not to be confused with sliver as there is twist in roving. Pencil roving is a type of roving that has been drawn until it is the size of a fat pencil. It can be used by spinners with minimal drafting (withdrawing fibers from a clump)."}, {"url": "http://www.collinsdictionary.com/dictionary/english/roving", "passage_text": "adjective. 1  travelling around, rather than staying in a fixed place ⇒ ■ roving armed bandits, ⇒ ■ roving bands of delinquents, ⇒ ■ Left to raise themselves on the streets, these children form roving bands of delinquents. , ⇒ ■ 2  Attractions include free face painting, street performers, and roving musicians. adjective. 1  travelling around, rather than staying in a fixed place ⇒ ■ roving armed bandits, ⇒ ■ roving bands of delinquents, ⇒ ■ Left to raise themselves on the streets, these children form roving bands of delinquents. ( 2 Australian Rules football) playing as a rover ⇒ ■ a powerfully built roving forward."}, {"url": "http://www.audioenglish.org/dictionary/roving.htm", "passage_text": "Familiarity information: ROVING used as a noun is very rare. • ROVING (adjective). The adjective ROVING has 1 sense: 1. (of groups of people) tending to travel and change settlements frequently. Familiarity information: ROVING used as an adjective is very rare. "}, {"url": "https://en.wikipedia.org/wiki/Roving", "passage_text": "A roving is a long and narrow bundle of fiber. Rovings are produced during the process of making spun yarn from wool fleece, raw cotton, or other fibres. Roving is not to be confused with sliver as there is twist in roving. Pencil roving is a type of roving that has been drawn until it is the size of a fat pencil. It can be used by spinners with minimal drafting (withdrawing fibers from a clump)."}, {"url": "http://www.oxforddictionaries.com/definition/english/roving", "passage_text": "1 another term for rove. Example sentences. 1  The energy used to create the fibers-it starts with a plant, then the cords are removed, the material is dried, then rovings are produced-requires 60% less energy than glass. 2  Asphalt emulsion finds a more general use as a tackifier to hold rovings and straw in place. 1 The energy used to create the fibers-it starts with a plant, then the cords are removed, the material is dried, then rovings are produced-requires 60% less energy than glass."}, {"url": "http://www.definitions.net/definition/roving", "passage_text": "A roving is a long and narrow bundle of fibre. Rovings are produced during the process of making spun yarn from wool fleece, raw cotton, or other fibres. Their main use is as fibre prepared for spinning, but they may also be used for specialised kinds of knitting or other textile arts. After carding, the fibres lie roughly parallel in smooth bundles. Roving (noun). the operatin of forming the rove, or slightly twisted sliver or roll of wool or cotton, by means of a machine for the purpose, called a roving frame, or roving machine. Roving (noun). a roll or sliver of wool or cotton drawn out and slightly twisted; a rove. See 2d Rove, 2."}, {"url": "http://www.definitions.net/definition/roving", "passage_text": "Roving. of Rove. Roving (noun). the operatin of forming the rove, or slightly twisted sliver or roll of wool or cotton, by means of a machine for the purpose, called a roving frame, or roving machine. Roving (noun). a roll or sliver of wool or cotton drawn out and slightly twisted; a rove. See 2d Rove, 2."}, {"url": "http://www.collinsdictionary.com/dictionary/english/roving", "passage_text": "1 travelling around, rather than staying in a fixed place ⇒ ■ roving armed bandits, ⇒ ■ roving bands of delinquents, ⇒ ■ Left to raise themselves on the streets, these children form roving bands of delinquents. , ⇒ ■ 2  Attractions include free face painting, street performers, and roving musicians. adjective. 1  travelling around, rather than staying in a fixed place ⇒ ■ roving armed bandits, ⇒ ■ roving bands of delinquents, ⇒ ■ Left to raise themselves on the streets, these children form roving bands of delinquents. ( 2 Australian Rules football) playing as a rover ⇒ ■ a powerfully built roving forward."}]