[{"url": "http://www.answers.com/Q/Where_does_tubular_reabsorption_occur", "passage_text": "Within the nephron (the functional unit of the kidneys), filtration occurs in the glomerolus. The filtered fluid is called filtrate. Reabsorption of filtrate occurs in a … few places within the nephron, however, the majority of reabsorption takes place in the proximal convoluted tube. Reabsorption in a nephron occurs in the Loop of Henle Reabsorption has been addressed to substances which are absorbed back from the nerphrone back in to the blood(capillaries …). On other hand Secretion is the absorption of substances from blood"}, {"url": "http://www.ivyroses.com/HumanBody/Urinary/Urinary_System_Kidneys_Actions.php", "passage_text": "It is the tubular secretion of H + and NH 4 + from the blood into the tubular fluid (i.e. urine-which is then excreted from the body via the ureter, bladder, and urethra) that helps to keep blood pH at its normal level. The movement of these ions also helps to conserve sodium bicarbonate (NaHCO 3). The substances that are secreted into the tubular fluid (for removal from the body) include: 1  Potassium ions (K+), 2  Hydrogen ions (H+), 3  Ammonium ions (NH 4 4  +), creatinine, 5  urea, 6  some hormones, and. 7  some drugs (e.g. penicillin)."}, {"url": "https://au.answers.yahoo.com/question/index?qid=20120602205604AAqALtV", "passage_text": "Im really confused as to where in the nephron of the kidney each of the three steps of urine formation occur. the steps include: 1. glomerular filtration. 2. tubular reabsorption. 3.tubular secretion. Whereas reabsorption moves substances out of the tubules and into the blood, secretion moves substances out of the blood and into the tubules where they mix with the water and other wastes and are converted into urine. Hope this helped."}, {"url": "https://answers.yahoo.com/question/index?qid=20081207083800AAQPHnx", "passage_text": "Answers. Best Answer: The Renal Corpuscle, made up of the Bowman's Capsule and the Glomerulus (in the cortex) has a high blood pressure (from the glomerulus into the B.C.) that promotes filtration into the Proximal Convoluted Tubule (also in the cortex). Water is also reabsorbed here. The nephron then descends into the descending Loop of Henle (which enters the medulla and comes back out) where most of the water is reabsorbed, under the control of the hormone Vasopressin."}, {"url": "https://quizlet.com/19858730/40c-filtration-reabsorption-secretion-flash-cards/", "passage_text": "describe the process of secretion. waste within the blood of the peritubular capillaries and the vasa recta are transferred to the renal tubule in all areas of the nephron, the tubule cells then secrete the waste into the filtrate. where does tubular reabsorption and occur and what is being reabsorbed (LOPEZ SAID). peritubular capillaries and/or vasa recta (from nephron (renal tubules and collecting ducts) to blood), ions, glucose, sodium."}, {"url": "https://au.answers.yahoo.com/question/index?qid=20120602205604AAqALtV", "passage_text": "Im really confused as to where in the nephron of the kidney each of the three steps of urine formation occur the steps include: 1. glomerular filtration 2. tubular reabsorption 3.tubular secretion does glomerular filtration occur in the renal corpuscle, then the tubular reabsorption occur in the proximal... Whereas reabsorption moves substances out of the tubules and into the blood, secretion moves substances out of the blood and into the tubules where they mix with the water and other wastes and are converted into urine. Hope this helped."}, {"url": "https://en.wikipedia.org/wiki/Nephron", "passage_text": "Each nephron is composed of an initial filtering component (the  renal corpuscle ) and a tubule specialized for reabsorption and secretion (the renal tubule). The renal corpuscle filters out solutes from the blood, delivering water and small solutes to the renal tubule for modification. Cortical nephrons have their Loop of Henle in the renal medulla near its junction with the renal cortex, while the Loop of Henle of juxtamedullary nephrons is located deep in the renal medulla; they are called juxtamedullary because their renal corpuscle is located near the medulla (but still in the cortex)."}, {"url": "http://www.answers.com/Q/Where_does_tubular_secretion_mainly_occur", "passage_text": "After glomerular filtration, in which fluids from the blood pass into the glomerular capsule of the renal tubule, the filtrate is subject to tubular reabsorption and tubular secretion within the convoluted tubules and collecting ducts of the nephrons. "}, {"url": "https://au.answers.yahoo.com/question/index?qid=20120602205604AAqALtV", "passage_text": "Tubular secretions: It is the mechanism by which substances are removed from the blood and are directly added to the tubular fluids. Hydrogen ion, ammonium and drugs such as penicillin are some of the substances that move from the blood into the distal tubule of nephron. Secretions keep the blood from becoming acidic. Whereas reabsorption moves substances out of the tubules and into the blood, secretion moves substances out of the blood and into the tubules where they mix with the water and other wastes and are converted into urine. Hope this helped."}]