[{"url": "http://volcano.oregonstate.edu/fuego", "passage_text": "The most recent large eruptions at Fuego were in October of 1974. Over a ten day period there were four distinct pulses in vulcanian activity, each lasting 4-17 hours. An ash cloud shot more than 4 miles (7 km) above the volcano. Glowing avalanches mov ed down the slopes of Fuego at 35 miles per hour (60 km/hr). Atmospheric effects were reported for months following the eruption. There are active fumaroles in the crater at the summit"}, {"url": "https://en.wikipedia.org/wiki/Volc%C3%A1n_de_Fuego", "passage_text": "Volcan volcán De (Fuego volcano Of) fire is an active stratovolcano In, guatemala on the borders Of, Chimaltenango esquintla And sacatepequez. Sacatepéquez departments it sits about (16.kilometres 9) 9 mi to the west of the colonial City Of, antigua guatemala One’of guatemala s most famous. tourist attractions It sits about 16 kilometres (9.9 mi) to the west of the colonial city of Antigua Guatemala, one of Guatemala’s most famous tourist attractions. It has erupted frequently since the Spanish conquest. Fuego is famous for being almost constantly active at a low level."}, {"url": "https://en.wikipedia.org/wiki/Volc%C3%A1n_de_Fuego", "passage_text": "Volcan volcán De (Fuego volcano Of) fire is an active stratovolcano In, guatemala on the borders Of, Chimaltenango esquintla And sacatepequez. sacatepéquez departments It sits about 16 kilometres (9.9 mi) to the west of the colonial city of Antigua Guatemala, one of Guatemala’s most famous tourist attractions. It has erupted frequently since the Spanish conquest. Fuego is famous for being almost constantly active at a low level."}, {"url": "http://www.photovolcanica.com/VolcanoInfo/Fuego/Fuego.html", "passage_text": "Fuego volcano is located 13km W of Antigua, the former capital and touristic center of Guatemala. Fuego (erupting), Meseta, Acatenango (highest peak), Yepocapa (on right). Strong explosive eruption of Fuego with associated rockfalls, Dec. 2007. Fuego and Acatenango complexes seen from Antigua bus station. Fuego forms part of a large volcanic complex which includes Yepocapa (3880m), Acatenango (3976m), Meseta (3600m) and Fuego (3763m)."}, {"url": "http://pubs.usgs.gov/of/2001/0431/", "passage_text": "Summary. The Fuego-Acatenango massif comprises a string of five or more volcanic vents along a north-south trend that is perpendicular to that of the Central American arc in Guatemala. From north to south known centers of volcanism are Ancient Acatenango, Yepocapa, Pico Mayor de Acatenango, Meseta, and Fuego. Pubs Warehouse. The Fuego-Acatenango massif comprises a string of five or more volcanic vents along a north-south trend that is perpendicular to that of the Central American arc in Guatemala."}, {"url": "http://www.livescience.com/27295-volcanoes.html", "passage_text": "Cinder cone volcanoes (also called scoria cones) are the most common type of volcano and are the symmetrical cone shaped volcanoes we typically think of. They may occur as single volcanoes or as secondary volcanoes on the sides of stratovolcanoes or shield volcanoes. A volcano is a vent or fissure in Earth's crust through which lava, ash, rock and gases erupt. A volcano is also a mountain formed by the accumulation of these eruptive products. Let's take a look at how volcanoes form: Earth's crust is 40 to 250 miles (64 to 402 kilometers) thick. It is broken up into 14 major and 38 smaller pieces called tectonic plat"}, {"url": "http://ovfuego-norte.geo.mtu.edu/", "passage_text": "Information about volcanoes in the US from the US Geological Survey's Volcano Hazards Program. Volcan volcán De Fuego Web. Cam the camera is located AT'insivumeh S Fuego observatory In, Panimache, Chimaltenango guatemala about 7 km southwest of the summit Of. fuego "}, {"url": "http://www.bbc.com/news/world-latin-america-31231744", "passage_text": "It is expected to reopen later on Sunday, reports suggest. The Fuego volcano is about 40km (25 miles) south-west of the capital and stands 3,763 metres (12,346 feet) above sea level. In September 2012 the authorities evacuated thousands of people from the area after Fuego started spewing large volumes of lava and ash"}]