[{"url": "https://en.wikipedia.org/wiki/Air_pollution", "passage_text": "Air pollution from a fossil-fuel power station. Air pollution is the introduction of particulates, biological molecules, or other harmful materials into Earth's atmosphere, causing disease, death to humans, damage to other living organisms such as food crops, or the natural or built environment."}, {"url": "http://environment.about.com/od/smogfaq/f/smog_faq_five.htm", "passage_text": "Smog-forming pollutants come from many sources such as automobile exhaust, power plants, factories and many consumer products, including paint, hairspray, charcoal starter fluid, chemical solvents, and even plastic popcorn packaging. "}, {"url": "http://www.nytimes.com/2014/01/21/world/asia/china-also-exports-pollution-to-western-us-study-finds.html", "passage_text": "BEIJING — Filthy emissions from China’s export industries are carried across the Pacific Ocean and contribute to air pollution in the Western United States, according to a paper published Monday by a prominent American science journal. "}, {"url": "http://www.factmonster.com/ipka/A0004695.html", "passage_text": "That is why ozone is mostly found in the summer. Nitrogen oxides come from burning gasoline, coal, or other fossil fuels. There are many types of volatile organic compounds, and they come from sources ranging from factories to trees. Ozone near the ground can cause a number of health problems. Sulfur dioxide mostly comes from the burning of coal or oil in power plants. It also comes from factories that make chemicals, paper, or fuel. Like nitrogen dioxide, sulfur dioxide reacts in the atmosphere to form acid rain and particles."}, {"url": "http://www.infoplease.com/ipa/A0004695.html", "passage_text": "That is why ozone is mostly found in the summer. Nitrogen oxides come from burning gasoline, coal, or other fossil fuels. There are many types of volatile organic compounds, and they come from sources ranging from factories to trees. Ozone near the ground can cause a number of health problems. "}, {"url": "http://www.conserve-energy-future.com/causes-effects-solutions-of-air-pollution.php", "passage_text": "1. Burning of Fossil Fuels: Sulfur dioxide emitted from the combustion of fossil fuels like coal, petroleum and other factory combustibles is one the major cause of air pollution. Pollution emitting from vehicles including trucks, jeeps, cars, trains, airplanes cause immense amount of pollution. Primarily air pollutants can be caused by primary sources or secondary sources. The pollutants that are a direct result of the process can be called primary pollutants. A classic example of a primary pollutant would be the sulfur-dioxide emitted from factories."}, {"url": "http://thankyouocean.org/threats/water-pollution/", "passage_text": "Point Source Pollution. Pollution can come from point sources, or a single identifiable source, such as factories or wastewater treatment facilities. Factories, including oil refineries, and electronic manufacturers typically release one or more pollutants into water they discharge (called effluents). Mercury in Seafood. Ocean pollution can also come from airborne sources. Coal-fired power plants and chlorine factories release mercury into the air, which eventually settles into the ocean. Mercury is a neurotoxin that can cause damage to the brain and nervous system."}, {"url": "http://www.conserve-energy-future.com/causes-effects-solutions-of-air-pollution.php", "passage_text": "They emit harmful chemicals into the air and can also cause water pollution. 3. Exhaust from factories and industries: Manufacturing industries release large amount of carbon monoxide, hydrocarbons, organic compounds, and chemicals into the air thereby depleting the quality of air. Primarily air pollutants can be caused by primary sources or secondary sources. The pollutants that are a direct result of the process can be called primary pollutants. A classic example of a primary pollutant would be the sulfur-dioxide emitted from factories."}]