[{"url": "http://writedge.com/endorsing-checks-for-kids/", "passage_text": "It is acceptable when kids are not old enough to be able to write their own name for the parent to endorse the check for them. If you flip the check over and see the space to endorse a check, first clearly print your child’s name on the first line, then sign your name on the line directly below their name. After the check is properly endorsed in this fashion you can cash or deposit the check the way you would a check written out to your name. If your child is old enough to correctly add their signature to the check, they can sign their name on the endorsement line. Even if they can sign their name, this does not mean they can exchange the check for money if the bank requires identification or they don’t own a bank account to use to sign the check against."}, {"url": "http://www.wikihow.com/Endorse-a-Check", "passage_text": "Write on the grey lines in the endorsement area on the back of the check. On the first line, write the name of your business. 1  For example, write Jim's Hardware Store on the first line of the check. 2  Use this method when a check is made out not to you personally, but to your business. After this, write the name of the person you are transferring the check to on the next line. This step transfers the rights to the check's funds from you to the person you have chosen. 1  This step is like writing a brand new check to the person you assign the transfer to-they need to sign the check in order to cash it."}, {"url": "http://www.ehow.com/how_8007501_deposit-checks-made-out-children.html", "passage_text": "If he is not old enough to write, then write the word “by” and sign your name followed by “parent” or “guardian.” Some banks require you to sign your name and include “parent or guardian of [child’s name]” and then sign it again underneath your first endorsement. AlixKreil/iStock/Getty Images. Even in a world of direct deposits, electronic checks and pay-by-phone, many people still use checks for payments and to give money to others. If your child receives a check made out to him and he does not have a checking account, you can still deposit it into your account on his behalf."}, {"url": "http://writedge.com/endorse-check-minor-child/", "passage_text": "The need to endorse a check for a minor child is a situation most parents run into at some point. If your child receives a check, is not of age and/or has no identification card to use to cash the check at the bank his or herself, then he or she will need your assistance in order to gain access to the money. Option 1: If your child is too young to write his or her own name and the check is made out to your child, what you can do is clearly print your child’s name on the first line on the back of the check. On the second line sign your name directly below your child’s name"}, {"url": "http://writedge.com/endorsing-checks-for-kids/", "passage_text": "If your child receives a check made out to their name and is not in a position to cash the check on their own, there are a couple of different ways you an approach the situation and may also be dependent on the child’s age. If your child is old enough to correctly add their signature to the check, they can sign their name on the endorsement line. Even if they can sign their name, this does not mean they can exchange the check for money if the bank requires identification or they don’t own a bank account to use to sign the check against."}, {"url": "http://www.omninerd.com/articles/How_to_Deposit_Checks_Written_to_Children", "passage_text": "According to a friendly banker, a check made out to a minor can be deposited into a parent’s account. To accomplish this, the parent must endorse the check by: 1  signing the child’s name, 2  writing minor by, and then. 3  signing the parent’s name. How to Deposit Checks Written to Children. Being the wonderful relatives they are, my wife’s paternal grandparents recently sent a check to start our new son’s savings account. The pay to the order of field included my son’s name, as well as an appended (child).."}, {"url": "http://writedge.com/endorse-check-minor-child/", "passage_text": "If your child receives a check made out to him or her and cannot cash the check alone, then there are a few ways you can approach the situation. Keep in mind, no matter which option you choose, depending on individual bank policy, chances are you will need to cash the check at the same bank you hold a personal account. Option 1: If your child is too young to write his or her own name and the check is made out to your child, what you can do is clearly print your child’s name on the first line on the back of the check. On the second line sign your name directly below your child’s name"}, {"url": "http://www.ehow.com/how_8007501_deposit-checks-made-out-children.html", "passage_text": "Sign Your Name. On the back of the check, where you would normally endorse it, write the words, “For Deposit Only.” Underneath that, have your child print his name if he is able. Sign your name underneath your child’s. AlixKreil/iStock/Getty Images. Even in a world of direct deposits, electronic checks and pay-by-phone, many people still use checks for payments and to give money to others. If your child receives a check made out to him and he does not have a checking account, you can still deposit it into your account on his behalf."}]