[{"url": "http://www.livescience.com/26983-lymphatic-system.html", "passage_text": "View full size image. The lymphatic system is a network of tissues and organs that help rid the body of toxins, waste and other unwanted materials. The primary function of the lymphatic system is to transport lymph, a fluid containing infection-fighting white blood cells, throughout the body. The lymphatic system primarily consists of lymphatic vessels, which are similar to the circulatory system's veins and capillaries."}, {"url": "http://www2.estrellamountain.edu/faculty/farabee/biobk/BioBookIMMUN.html", "passage_text": "The lymphatic system is composed of lymph vessels, lymph nodes, and organs. The functions of this system include the absorbtion of excess fluid and its return to the blood stream, absorption of fat (in the villi of the small intestine) and the immune system function. "}, {"url": "http://www.lymphomation.org/lymphatic.htm", "passage_text": "Understanding the lymphatic system. The lymphatic system consists of organs, ducts, and nodes. It transports a watery clear fluid called lymph. This fluid distributes immune cells and other factors throughout the body. It also interacts with the blood circulatory system to drain fluid from cells and tissues. The major parts of the system are the bone marrow, spleen, thymus gland, lymph nodes, and the tonsils. Other organs, including the heart, lungs, intestines, liver, and skin also contain lymphatic tissue. gorhams.dk Lymphoma Is a disease in which malignant lymphocytes grow too fast or live too long."}, {"url": "https://en.wikipedia.org/wiki/Lymphatic_system", "passage_text": "The lymphatic system is part of the circulatory system and a vital part of the immune system, comprising a network of lymphatic vessels that carry a clear fluid called lymph (from Latin lympha meaning water) directionally towards the heart. One of the main functions of the lymph system is to provide an accessory return route to the blood for the surplus three litres. The other main function is that of defense in the immune system. Lymph is very similar to blood plasma: it contains lymphocytes and other white blood cells. It also contains waste products and debris of cells together with bacteria and protein"}, {"url": "http://biology.about.com/od/organsystems/ss/lymphatic-aystem.htm", "passage_text": "1 The thymus gland is the main organ of the lymphatic system. 2  Its primary function is to promote the development of specific cells of the immune system called T-lymphocytes. 3  Once mature, these cells leave the thymus and are transported via blood vessels to the lymph nodes and spleen. The lymphatic system plays a vital role in the proper functioning of the body. One of the major roles of this organ system is to drain excess fluid surrounding tissues and organs and return it to the blood. Returning lymph to the blood helps to maintain normal blood volume and pressure."}, {"url": "http://biology.about.com/od/organsystems/ss/lymphatic-aystem.htm", "passage_text": "1 The spleen is the largest organ of the lymphatic system. 2  Its primary function is to filter blood of damaged cells, cellular debris, and pathogens. 3  Like the thymus, the spleen houses and aids in the maturation of lymphocytes. 4  Lymphocytes destroy pathogens and dead cells in the blood. The lymphatic system plays a vital role in the proper functioning of the body. One of the major roles of this organ system is to drain excess fluid surrounding tissues and organs and return it to the blood. Returning lymph to the blood helps to maintain normal blood volume and pressure."}, {"url": "http://www.cancerresearchuk.org/about-cancer/what-is-cancer/body-systems-and-cancer/the-lymphatic-system-and-cancer", "passage_text": "What the lymphatic system is. The lymphatic system is a system of thin tubes and lymph nodes that run throughout the body. These tubes are called lymph vessels or lymphatic vessels. The lymph system is an important part of our immune system. It plays a role in fighting bacteria and other infections and destroying old or abnormal cells, such as cancer cells. You can read detailed information about the immune system and cancer"}, {"url": "http://www.cancerresearchuk.org/about-cancer/what-is-cancer/body-systems-and-cancer/the-lymphatic-system-and-cancer", "passage_text": "The lymphatic system. The diagram shows the lymph vessels, lymph nodes and the other organs that make up the lymphatic system. The lymphatic system is similar to the blood circulation. The lymph vessels branch through all parts of the body like the arteries and veins that carry blood. These tubes are called lymph vessels or lymphatic vessels. The lymph system is an important part of our immune system. It plays a role in fighting bacteria and other infections and destroying old or abnormal cells, such as cancer cells."}, {"url": "http://biology.about.com/od/organsystems/ss/lymphatic-aystem.htm", "passage_text": "1 Thymus. 2  The thymus gland is the main organ of the lymphatic system. 3  Its primary function is to promote the development of specific cells of the immune system called T-lymphocytes. 4  Once mature, these cells leave the thymus and are transported via blood vessels to the lymph nodes and spleen. The lymphatic system plays a vital role in the proper functioning of the body. One of the major roles of this organ system is to drain excess fluid surrounding tissues and organs and return it to the blood. Returning lymph to the blood helps to maintain normal blood volume and pressure."}]