[{"url": "http://www.orkin.com/ask-the-orkin-man/little-ants-in-my-bathroom/", "passage_text": "We have had problems with ants in the bathrooms, and we got rid of the nests that took up habitat under the tub area. But when we had the roof done the plywood was replaced and they found a nest. They sprayed and took out all of the wet wood and insulation. No wings. I did not see these ants on your list. ANSWER: What you have seen are probably pavement ants; they are common this time of year. Their nests are often found around houses, sometimes on or near sidewalks, patios or against the foundation."}, {"url": "http://www.ehow.com/how_4451488_get-rid-ants-bathroom.html", "passage_text": "Locate the entry point, which usually is a windowsill or vent leading to the exterior. Fill a spray bottle with equal amounts of white vinegar and water. Spray from the inside of your bathroom. If you can, spray outside where the ants come into the house. The odor of the vinegar destroys the attracting scent. Trace their tracks back to where the queen lives, and give it a good shot of vinegar as well. Do this several times. Tip. Pour a cup of vinegar down the bath or shower drain to neutralize the scent of hair and dilute the standing water. Let it sit for 30 minutes. Flush the drain with cold water."}, {"url": "http://www.orkin.com/ask-the-orkin-man/little-ants-in-my-bathroom/", "passage_text": "Question: I have been seeing little ants in my bathroom. They were in my bathroom this time of year last year too. There are tons of them, and I don’t know where they are coming from or why they are there. No wings. I did not see these ants on your list. ANSWER: What you have seen are probably pavement ants; they are common this time of year. Their nests are often found around houses, sometimes on or near sidewalks, patios or against the foundation."}, {"url": "http://homeimprovementstip.com/how-to-get-rid-of-ants-in-the-bathroom.html", "passage_text": "How to Get Rid of Ants in the Bathroom: Cleaning Thoroughly. The first way to get rid of the ants is to clean your bathroom thoroughly and regularly. You can scrub the tiles around the bathtub, sinks and toilet by using a bathroom floor cleaner or disinfectants. How to Get Rid of Ants in the Bathroom: Call a n Exterminator. The last but the most powerful way to get rid of ants in the bathroom is to call an ants exterminator. This is the last way you can use in case all of the ways above cannot bring you any successes."}, {"url": "http://housekeeping.wonderhowto.com/forum/get-rid-little-black-ants-your-bathroom-0161552/", "passage_text": "Knowing why these tiny black pests are attracted to your bathroom in the first place will help you to get rid of them. Basically it boils down to food, odors and moisture. Stagnate water and fermented human hair from your drains will attract many types of insects. Rather than using dangerous insecticides, I have found that essential oils are just as effective for getting rid of small black ants in your bathroom. There are a dozen essential oils that will get the job done, but I find a mixture of peppermint and tea tree oil to be the most powerful solution."}, {"url": "http://homeimprovementstip.com/how-to-get-rid-of-ants-in-the-bathroom.html", "passage_text": "How to Get Rid of Ants in the Bathroom: Spray. The next step you may have to do to get rid of the annoying troop is spraying an ant disinfectant to the drawers or cabineta€™cabinetâ s. Inside spray the disinfectant around the inside and floor as, well and make sure to open the€™bathrooma bathroomâ s door for around. one hour How to Get Rid of Ants in the Bathroom: Call a n Exterminator. The last but the most powerful way to get rid of ants in the bathroom is to call an ants exterminator. This is the last way you can use in case all of the ways above cannot bring you any successes."}, {"url": "http://housekeeping.wonderhowto.com/forum/get-rid-little-black-ants-your-bathroom-0161552/", "passage_text": "Getting rid of little black ants in your bathroom is not a fun job! Congratulations on achieving success naturally without putting you or your family in danger with toxic chemicals. If you found this article to be helpful, please do me a big favor and share it on your favorite social network. Rather than using dangerous insecticides, I have found that essential oils are just as effective for getting rid of small black ants in your bathroom. There are a dozen essential oils that will get the job done, but I find a mixture of peppermint and tea tree oil to be the most powerful solution."}, {"url": "http://homeimprovementstip.com/how-to-get-rid-of-ants-in-the-bathroom.html", "passage_text": "How to Get Rid of Ants in the Bathroom: Ant Bait. This can be usedÂ usedâ in case the annoying troop continues to cause problem to your. Bathroom you can spread the bait or trap on the bathroom floor so they cannot come in your bathroom. anymore How to Get Rid of Ants in the Bathroom: Call a n Exterminator. The last but the most powerful way to get rid of ants in the bathroom is to call an ants exterminator. This is the last way you can use in case all of the ways above cannot bring you any successes."}, {"url": "http://www.ehow.com/how_5350397_naturally-rid-ants-bathroom.html", "passage_text": "If the ant problem is in your bathroom, it may seem harder to resolve, as you might not easily find the nest. Pesticides can help you end the ant infestation, but they are also toxic to children, pets and the environment. For a safer solution, use natural ways to get rid of ants in your bathroom. Instructions. Remove food and water the ants could be ingesting. Dry the water on the sink, shower and tub with a towel. Put the toilet seat lid down. Close containers for lotions, conditioner, toothpaste and soaps. Remove bar soaps or place them in a closed decorative box."}]