[{"url": "http://www.bbc.co.uk/science/humanbody/body/factfiles/touch/touch.shtml", "passage_text": "Light touch and deep pressure. Other receptors are more complex. The Meissner's corpuscles, for example, are enclosed in a capsule of connective tissue. They react to light touch and are located in the skin of your palms, soles, lips, eyelids, external genitals and nipples. Some of them, however, are located further down. Receptors such as your Paccinian corpuscules sense pressure and vibration changes deep in your skin. Pain and temperature. Your skin receptors don't only respond to touch. They also register pain as well as warmth and cold. Your pain receptors are the most numerous."}, {"url": "https://en.wikipedia.org/wiki/Mechanoreceptor", "passage_text": "A mechanoreceptor is a sensory receptor that responds to mechanical pressure or distortion. Normally there are four main types in glabrous skin: Pacinian corpuscles, Meissner's corpuscles, Merkel's discs, and Ruffini endings. Lamellar corpuscles, or Pacinian corpuscles, are pressure receptors located in the skin and also in various internal organs. Each is connected to a sensory neuron. Because of its relatively large size, a single lamellar corpuscle can be isolated and its properties studied."}, {"url": "https://quizlet.com/11417988/chapter-5-the-integumentary-system-and-body-membranes-flash-cards/", "passage_text": "Name the four receptors of the skin (PMFK). Pacinian corpuscle is deep in the dermis and is capable of detecting pressure on the skin surface. -Meissner's corpuscle is located close to the surface of the skin and detects the sensation of light touch. -Free nerve endings respond to pain. "}, {"url": "http://www.wisegeek.org/what-are-skin-receptors.htm", "passage_text": "Skin receptors that detect temperature are called thermoreceptors. These receptors respond to temperatures directly applied to the skin, such as a burn or an ice cube, as well as overall environmental changes in temperature. Receptors that detect temperature are made up of free nerve endings on the skin and are called thermoreceptors. Pain receptors on the skin are also free nerve endings called nociceptors."}, {"url": "http://www.wisegeek.org/what-are-skin-receptors.htm", "passage_text": "Skin receptors, also called cutaneous receptors, are part of the somatosensory system. They detect pressure, temperature, and vibrations on or around the skin. Cutaneous mechanoreceptors respond to pressure sensations on the skin and include Merkel's corpuscles, Meissner's corpuscles, and bulboid corpuscles. Receptors that detect temperature are made up of free nerve endings on the skin and are called thermoreceptors. Pain receptors on the skin are also free nerve endings called nociceptors. Cutaneous mechanoreceptors are probably the first type of skin receptors that come to mind for most people"}, {"url": "http://education.med.nyu.edu/Histology/coursematerials/syllabus/Skin.html", "passage_text": "The sensory receptors in the skin, such as Meissner's and Pacinian corpuscles, as well as free nerve endings, are classified as general sensory receptors. 1 In slides 21 and 35 of the skin, sensory nerve endings are inside Pacinian and Meissner's corpuscles. 2  Pacinian or lamellar corpuscles, which are encapsulated receptors for deep pressure, are found in the dense connective tissue of the dermis below the epithelium in slide 21."}, {"url": "http://www.bbc.co.uk/science/humanbody/body/factfiles/touch/touch.shtml", "passage_text": "It's because of the Meissner's corpuscles that these areas of your body are particularly sensitive. Most of your touch receptors sit close to your skin's surface. Some of them, however, are located further down. Receptors such as your Paccinian corpuscules sense pressure and vibration changes deep in your skin. Pain and temperature. Your skin receptors don't only respond to touch. They also register pain as well as warmth and cold. Your pain receptors are the most numerous."}, {"url": "http://innvista.com/health/anatomy/other-sensory-receptors/", "passage_text": "1 Pacinian corpuscles are large receptors sensitive to deep pressure and to pulsing or high-frequency vibrations. 2  They are found in the skin, fingers, breasts, and external genitalia, as well as in joint capsules, mesenteries, the pancreas, and walls of the urinary bladder. 1 Pain (nociceptors): They are common in the superficial portions of the skin, in joint capsules, within the periostea of bones, around the walls of blood vessels, plus a few in deep tissues or most visceral organs. 2  These can produce fast pain (prickling) or slow pain (burning or aching)."}, {"url": "https://en.wikipedia.org/wiki/Cutaneous_receptor", "passage_text": "The cutaneous receptors are the types of sensory receptor found in the dermis or epidermis. They are a part of the somatosensory system. Cutaneous receptors include e.g. cutaneous mechanoreceptors, nociceptors (pain) and thermoreceptors (temperature). With the above-mentioned receptor types the skin can sense the modalities touch, pressure, vibration, temperature and pain. The modalities and their receptors are partly overlapping, and are innervated by different kinds of fiber types."}]