[{"url": "http://www.visitcopenhagen.com/copenhagen/karen-blixen-museum-gdk412562", "passage_text": "Karen Blixen (1885-1962), considered one of Denmark's most significant 20th century writers, was born in Rungstedlund, where she lived most of her life before and after her years in Africa. Out of Africa. From 1914 to 1931, Karen Blixen ran a coffee plantation in the outskirts of Nairobi, Kenya. Among her best known literary works are the novel Out of Africa, describing this important period of her life, and the short story Babette's Feast, both of which were turned into Oscar-winning films. The Karen Blixen Museum offers guided tours in English 7 June, 5 July and 2 August 2015 at 14:00. Tickets cost DKK 100 incl. entrance to the museum and are sold via Billetto.dk or at the museum. Please note that there is a max. of 25 people per tour."}, {"url": "http://www.heatheronhertravels.com/karen-blixen-museum-copenhagen/", "passage_text": "Directions to reach the Karen Blixen Museum at Rungstedlund, near Copenhagen. To reach the Karen Blixen Museum at Rungstedlund, take the S train line to Klampenborg and change for the Coastal line to Runsted station or take the Coastal train direct to Rungsted, depending on your starting point. The Karen Blixen House near Copenhagen. Many of these pictures, ornaments and furniture had been to Kenya and back again including the screen by the fire from which she took motifs to inspire the stories she told to Denys Finch Hatton."}, {"url": "http://www.maplandia.com/denmark/frederiksborg/horsholm/rungsted/", "passage_text": "Maplandia.com in partnership with Booking.com offers highly competitive rates for all types of hotels in Rungsted, from affordable family hotels to the most luxurious ones. Booking.com, being established in 1996, is longtime Europe’s leader in online hotel reservations. Rungsted hotel deals. Luxury hotels (including 5 star hotels and 4 star hotels) and cheap Rungsted hotels (with best discount rates and up-to-date hotel deals) are both available in separate lists."}, {"url": "http://www.housingdenmark.com/en/rent-house-rungsted/id_1542", "passage_text": "Rungsted Harbour is the largest harbor on the coast with a number of shops, restaurants and take-away’s present, along with the type of life that normally follows in a busy and lively harbor. Rungsted, like other places further away from Copenhagen also offer excellent golfing opportunities. Just next to Rungsted Harbour, is also the lovely and interesting Karen Blixen museum. The coastal train stops regularly both in Vedbaek vedbæk And rungsted making it very easy to get To. copenhagen Great family house in very good area. This house is located very close to the sea on a private quiet street. The house contains a large livingroom with an open kitchen, 3 big bedrooms and 2 nice bathrooms, with tub and shower."}, {"url": "http://www.booking.com/hotel/dk/rungstedgaard.html", "passage_text": "Leif, Sweden. Housed in a former manor by the Øresund øresund, strait and surrounded by lush, Gardens rungstedgaard is right next to The Karen Blixen. Museum it offers Free-Wi, fi free parking and brightly decorated rooms with-flat TVs. Tvs each room At rungstedgaard is equipped with A. pc All older children or adults are charged DKK 450 per person per night for extra beds. The maximum number of extra beds/cribs in a room is 1. Any type of extra bed or crib is upon request and needs to be confirmed by management."}, {"url": "http://www.heatheronhertravels.com/karen-blixen-museum-copenhagen/", "passage_text": "Karen Blixen's House at Rungstedlund near Copenhagen. Although this was an interesting start to our visit, the highlight was to see the rooms where Karen Blixen lived, with the decor and furniture just as they were in her lifetime, as if she had stepped out for a moment to cut a few flowers in the garden. The Karen Blixen House near Copenhagen. Many of these pictures, ornaments and furniture had been to Kenya and back again including the screen by the fire from which she took motifs to inspire the stories she told to Denys Finch Hatton."}, {"url": "http://www.booking.com/hotel/dk/rungstedgaard.html", "passage_text": "Close to the sea. Nice area. Erik, Sweden. Brilliantly friendly staff and a lovely position by the marina and close to Louisiana and Karen Blixen museum. Carl, United Kingdom. Location and use of bikes to do the Danish thing and ride about. All older children or adults are charged DKK 450 per person per night for extra beds. The maximum number of extra beds/cribs in a room is 1. Any type of extra bed or crib is upon request and needs to be confirmed by management."}, {"url": "http://www.visitcopenhagen.com/copenhagen/karen-blixen-museum-gdk412562", "passage_text": "The Karen Blixen Museum is located directly by the Øresund øresund sound In, rungstedlund an enchanting park and bird sanctuary north Of. copenhagen The Karen Blixen Museum offers guided tours in English 7 June, 5 July and 2 August 2015 at 14:00. Tickets cost DKK 100 incl. entrance to the museum and are sold via Billetto.dk or at the museum. Please note that there is a max. of 25 people per tour."}, {"url": "http://www.heatheronhertravels.com/karen-blixen-museum-copenhagen/", "passage_text": "You can take bikes on the train as we did and there are normally at least 3 trains per hour to Rungsted. Once you get to Rungsted station you can follow the well marked signs to the Karen Blixen Museum which is a 30 minute walk or 15 minute cycle ride. Alternatively you can get off at Klampenborg and take the No 388 bus up the coast, admiring the views of the sea and the sound on the way. The Karen Blixen House near Copenhagen. Many of these pictures, ornaments and furniture had been to Kenya and back again including the screen by the fire from which she took motifs to inspire the stories she told to Denys Finch Hatton."}]