[{"url": "https://en.wikipedia.org/wiki/Taupo_Volcano", "passage_text": "The Oruanui eruption of the Taupo Volcano was the world's largest known eruption in the past 70,000 years, with a Volcanic Explosivity Index of 8.he Taupo Volcano erupts rhyolite, a viscous magma, with a high silica content. If the magma does not contain much gas, rhyolite tends to just form a lava dome."}, {"url": "https://en.wikipedia.org/wiki/Taupo_Volcano", "passage_text": "The Taupo Volcano forms part of the Taupo Volcanic Zone, a region of volcanic activity that extends from Ruapehu in the South, through the Taupo and Rotorua regions, to White Island, in the Bay of Plenty. The Taupo Volcano erupts rhyolite, a viscous magma, with a high silica content. If the magma does not contain much gas, rhyolite tends to just form a lava dome."}, {"url": "http://volcano.oregonstate.edu/vwdocs/volc_images/australia/new_zealand/", "passage_text": "Lake Rotorua is near top right. Tectonic setting of the Taupo and Coromandel volcanic zones and the central volcanic region of New Zealand. The Taupo Volcanic Zone (grays) is the currently active volcanic arc (darker gray) and back-arc basin (lighter gray). The back-arc basin is opening at a rate of 1.4 cm/yr. Rhyolite centers are: 1. Rotorua, 2.late tectonic boundaries of the southwest Pacific. Volcanoes in New Zealand result from the subduction of the Pacific Plate under the Indian-Australian Plate. The trench and subduction zone continues northeast from the North Island to the Kermadec Islands, Tonga, and Samoa."}, {"url": "http://volcano.si.edu/world/volcano.cfm?vnum=0401-07=", "passage_text": "Lake Taupo fills a topographically indistinct, roughly 35-km-wide caldera that is the site of the most prolific rhyolitic volcano of the Taupo volcanic zone. The caldera was formed during two major explosive eruptions, the Oruanui eruption, roughly 22,600 years ago, and the Taupo eruption, about 1800 years ago."}, {"url": "https://en.wikipedia.org/wiki/Taupo_Volcanic_Zone", "passage_text": "Craters of the Moon geothermal area. The Taupo Volcanic Zone is a highly active volcanic V shaped area in the North Island of New Zealand that is spreading east-west at the rate of about 8mm per year. It is named after Lake Taupo, the flooded caldera of the largest volcano in the zone.he Taupo Volcanic Zone is approximately 350 kilometres (217 mi) long by 50 kilometres (31 mi) wide. Mount Ruapehu marks its southwestern end, while the submarine Whakatane volcano (85 kilometres (53 mi) beyond White Island) is considered its northeastern limit."}, {"url": "https://en.wikipedia.org/wiki/Taupo_Volcano", "passage_text": "Volcano, lake, and caldera locations in the Taupo Volcanic Zone. Lake Taupo, in the centre of New Zealand ’s North Island, is the caldera of a large rhyolitic volcano called the Taupo Volcano. This huge volcano has produced two of the world’s most violent eruptions in geologically recent times. The Taupo Volcano erupts rhyolite, a viscous magma, with a high silica content. If the magma does not contain much gas, rhyolite tends to just form a lava dome."}, {"url": "http://www.gns.cri.nz/Home/Learning/Science-Topics/Volcanoes/New-Zealand-Volcanoes", "passage_text": "New Zealand has a lot of active volcanoes and a high frequency of eruptions. There are three major types of volcano in New Zealand. Volcanic activity in New Zealand occurs in six areas, five in the North Island and one offshore in the Kermadec Islands. White Island 2013. Image from Julian Thomson. More images here."}, {"url": "http://volcano.si.edu/world/volcano.cfm?vnum=0401-07=", "passage_text": "Geological Summary. Taupo, the most active rhyolitic volcano of the Taupo volcanic zone, is a large, roughly 35-km-wide caldera with poorly defined margins. It is a type example of an inverse volcano that slopes inward towards the most recent vent location.ake Taupo fills a topographically indistinct, roughly 35-km-wide caldera that is the site of the most prolific rhyolitic volcano of the Taupo volcanic zone. The caldera was formed during two major explosive eruptions, the Oruanui eruption, roughly 22,600 years ago, and the Taupo eruption, about 1800 years ago."}]