[{"url": "http://www.cigna.com/healthwellness/hw/medical-topics/tonsillitis-ut1026", "passage_text": "Tonsillitis is usually caused by a virus. Bacteria can also cause tonsillitis. The most common bacterial cause of tonsillitis is group A beta-hemolytic streptococcus (GABHS), which also causes strep throat. Tonsillitis can also be caused by fungi or parasites. A person with tonsillitis caused by strep bacteria is contagious early on and, without treatment, can remain so for up to 2 weeks. Antibiotics shorten the contagious period, and an infected person is no longer contagious about 24 to 48 hours after beginning antibiotic therapy."}, {"url": "http://www.mayoclinic.org/diseases-conditions/tonsillitis/basics/causes/con-20023538", "passage_text": "Inflamed tonsils. Tonsillitis is most often caused by common viruses, but bacterial infections can also be the cause. The most common bacterium causing tonsillitis is Streptococcus pyogenes (group A streptococcus), the bacterium that causes strep throat. Other strains of strep and other bacteria also may cause tonsillitis. "}, {"url": "http://mytonsils.com/tonsilitis.aspx", "passage_text": "Tonsillitis. Infection of the tonsils leads to inflammation and swelling (tonsillitis), which can be very painful. Symptoms can include fever, persistent sore throat, redness of the tonsil area, yellow discharge on the tonsils and tender lymph nodes on both sides of the neck. Most often, tonsillitis is caused by viruses. Sometimes it is caused by bacteria, typically streptococcus, which is commonly referred to as strep throat. Doctors can treat strep throat with antibiotics such as penicillin. "}, {"url": "http://www.entlubbock.com/throat.php", "passage_text": "Tonsillitis is an inflammation of the tonsils. This condition is common in children and adults when the tonsils become swollen, red and painful and may be coated with a yellow or white substance. Most cases of tonsillitis are caused by a virus, although it is sometimes the result of the streptococcal bacteria. Tonsillitis and Strep symptoms are similar to those of a common cold and may include: sore throat, fever, difficulty swallowing and swollen lymph nodes."}, {"url": "http://www.webmd.boots.com/cold-and-flu/cold-guide/strep-throat-bacterial-tonsillitis", "passage_text": "Although, by definition, strep throat is caused by the Streptococcus pyogenes bacteria, other bacteria can occasionally invade the throat and cause similar symptoms. Other possible bacterial invaders include staphylococcus, neisseria and Haemophilus influenzae. "}, {"url": "http://www.cigna.com/healthwellness/hw/medical-topics/tonsillitis-ut1026", "passage_text": "Most often, tonsillitis is caused by a virus. Less often, it is caused by the same bacteria that cause strep throat. In rare cases, a fungus or a parasite can cause it. Tonsillitis is spread through the air in droplets when an infected person breathes, coughs, or sneezes. A person with tonsillitis caused by strep bacteria is contagious early on and, without treatment, can remain so for up to 2 weeks. Antibiotics shorten the contagious period, and an infected person is no longer contagious about 24 to 48 hours after beginning antibiotic therapy."}, {"url": "http://www.emedicinehealth.com/tonsillitis-health/article_em.htm", "passage_text": "Most often, tonsillitis is caused by a virus. Less often, it is caused by the same bacteria that cause strep throat. In rare cases, a fungus or a parasite can cause it. Tonsillitis is spread through the air in droplets when an infected person breathes, coughs, or sneezes. If your tonsillitis is caused by strep, you need treatment with antibiotics. Antibiotics can help prevent rare but serious problems caused by strep and can control the spread of infection. As a rule, doctors only advise surgery to remove tonsils (tonsillectomy) when there are serious problems with the tonsils."}, {"url": "http://www.webmd.com/oral-health/guide/tonsillitis-symptoms-causes-and-treatments", "passage_text": "Causes and Symptoms of Tonsillitis. Bacterial and viral infections can cause tonsillitis. A common cause is Streptococcus (strep) bacteria. Other common causes include: 1  Adenoviruses. 2  Influenza virus. 3  Epstein-Barr virus. 4  Parainfluenza viruses. 5  Enteroviruses. 6  Herpes simplex virus. "}, {"url": "http://www.healthgrades.com/conditions/strep-throat", "passage_text": "Healthgrades Editorial Staff. Strep throat is an infection of the throat caused by group A Streptococcus bacteria, which cause swelling and irritation (inflammation) of the throat and tonsils. Your thoat is the tube that connects your mouth to your esophagus and windpipe. "}, {"url": "https://en.wikipedia.org/wiki/Tonsilitis", "passage_text": "Tonsillitis (/ˌtɒnsɪˈlaɪtɪs/ TON-si-LEYE-tis) is inflammation of the tonsils most commonly caused by viral or bacterial infection. Symptoms may include sore throat and fever. When caused by a bacterium belonging to the group A streptococcus, it is typically referred to as strep throat. "}]