[{"url": "http://classroom.synonym.com/long-georgia-state-income-tax-refund-direct-deposit-23840.html", "passage_text": "If you elect to have your refund direct deposited, the refund should be deposited into your bank account within 24 hours of the return completing processing. The Georgia Department of Revenue can be reached by phone at 404-417-6760 or 1-877-423-6711."}, {"url": "http://www.efile.com/efile-georgia-income-tax-return-file-ga-state-taxes-forms-refund/", "passage_text": "If you efile a Georgia state tax return, your refund will generally be processed in 1-3 weeks. It may take 8-12 weeks to process your refund if you filed your Georgia return on paper. Check your official GA tax refund online. Georgia efile Error Codes View a list of all Georgia State efile Income Tax Return Error Reject Codes."}, {"url": "http://www.answers.com/Q/How_long_does_it_take_to_get_back_a_georgia_state_tax_return", "passage_text": "It takes about 6 to 8 weeks to get a Georgia state tax return sent to you."}, {"url": "http://dor.georgia.gov/refunds", "passage_text": "Check the status of your Georgia individual income tax refund. Processing of paper returns can take up to 8 weeks for returns filed before April 1 or 12 weeks for returns filed after April 1. Processing of electronically filed returns can take up to three weeks."}, {"url": "http://www.answers.com/Q/How_long_does_it_take_to_get_state_tax_refund_if_you_efile_and_have_it_direct_deposited_to_checking_account", "passage_text": "The length of time it takes to get a Louisiana State refund from an  e-filed return can vary. As of February 2014, the state stated  e-filed returns may take around 21 days … for processing."}, {"url": "http://www.answers.com/Q/How_long_does_it_take_to_get_state_tax_refund_if_you_efile_and_have_it_direct_deposited_to_checking_account", "passage_text": "1 About 4-5 business days. 2  I filed my State Tax Returns through TurboTax E-File. 3  Federal direct deposit takes about 8 days but state returns can vary from a week to over a month. 4  I'm a Massachusetts resident and it has been close to 30 days and i still have not received the direct deposit."}, {"url": "http://georgia.gov/popular-topic/getting-your-tax-refund", "passage_text": "1 If you file a paper return before April 1, your refund may take seven weeks to reach you. 2  If you file a paper return after April 1, expect to wait 10 weeks before your refund arrives."}, {"url": "http://dor.georgia.gov/refunds", "passage_text": "Refunds. Check the status of your Georgia individual income tax refund. Processing of paper returns can take up to 8 weeks for returns filed before April 1 or 12 weeks for returns filed after April 1. Processing of electronically filed returns can take up to three weeks."}]