[{"url": "http://www.healthcaresalaryworld.com/what-is-nurse-anesthetist-salary/", "passage_text": "Nurse Anesthetists (also known as Certified Registered Nurse Anesthetist or CRNA) are registered nurses who are specially trained in the use of anesthesia. They are trained in pain management, and provide help during surgery, trauma, childbirth, and illness, relieving discomfort of patients. How Much Does a Nurse Anesthetist Make. The average annual nurse anesthetist salary is $157,690. The average salary is calculated by adding all the wages within the occupation and dividing that value by the total number of employees. The lowest 10% of nurse anesthetist salaries are less than $106,010 annually."}, {"url": "http://www.healthcare-salaries.com/allied-health-professionals/crna-salary", "passage_text": "CRNA salary in USA. An average salary for a CRNA in the United States ranges from between $76,891 – $174,012 per year. An average yearly bonus of around $14,443 will be included and the yearly profit sharing ranges from between $24.16 – $19,866 per year. Conclusion about CRNA salary. According to the U.S. Bureau of Labor Statistics, the average hourly wage and annual mean salary earned by the CRNA is around $71.23 per hour and $148,160 per annum respectively. CRNA salary is one of the highest among other occupations on medical field."}, {"url": "http://www1.salary.com/Certified-Nurse-Anesthetist-(CRNA)-Salary.html", "passage_text": "How much does a certified nurse anesthetist (crna) make? Well to determine a certified nurse anesthetist (crna)'s pay you need to first decide what kind of a certified nurse anesthetist (crna) you are talking about. We have information on several certified nurse anesthetist (crna) jobs each with different pay ranges. Please select a specific certified nurse anesthetist (crna) job from the list below or search certified nurse anesthetist (crna) salaries. "}, {"url": "http://www.allnursingschools.com/nursing-careers/article/become-nurse-anesthetist/", "passage_text": "How to Become a Nurse Anesthetist. Learn how to become a nurse anesthetist with these 10 career tips. Nurse anesthetists administer anesthesia services in a wide range of health care facilities, from the hospital emergency room to the dentist's office. 1. Start with a bachelor's in nursing (BSN) and a registered nursing license (RN) . Many nurse anesthesia master's programs stipulate that applicants hold a BSN and an RN."}, {"url": "http://www.healthcare-salaries.com/allied-health-professionals/crna-salary", "passage_text": "CRNA salary. Certified registered nursing anesthetist’s salary (also known as CRNA salary) in the United States is around $154,390 per annum. The annual salary for the upper 10 percent CRNAs is around more than $183,999 per year, while the lower 10 percent of them earn less than $105,810 per year. Conclusion about CRNA salary. According to the U.S. Bureau of Labor Statistics, the average hourly wage and annual mean salary earned by the CRNA is around $71.23 per hour and $148,160 per annum respectively. CRNA salary is one of the highest among other occupations on medical field."}, {"url": "http://www.anesthesiazone.com/crna-information.aspx", "passage_text": "Training to Become a CRNA. Before becoming a certified registered nurse anesthetist, a nurse must have at least one year of experience in an acute care setting, such as an emergency room or critical care unit, and complete additional training in a large hospital setting. Nurse anesthetists are required to have a Bachelor's of Science degree in nursing or other appropriate undergraduate degree and a master's degree from one of the more than 100 graduate schools of nurse anesthesia."}, {"url": "http://www.healthcare-salaries.com/allied-health-professionals/crna-salary", "passage_text": "CRNA job description. Certified Registered nursing anesthetists or (CRNA), commonly referred to as nursing anesthetists, administer anesthesia to the patients during various surgical procedures in the OT. CRNA usually works in a variety of medical settings such as hospitals, clinics, and health care facilities. Conclusion about CRNA salary. According to the U.S. Bureau of Labor Statistics, the average hourly wage and annual mean salary earned by the CRNA is around $71.23 per hour and $148,160 per annum respectively. CRNA salary is one of the highest among other occupations on medical field."}, {"url": "http://www.anesthesiazone.com/crna-information.aspx", "passage_text": "Nurses were the first providers of anesthesia care and have continued to work in the field for more than 150 years. The designation of certified registered nurse anesthetist (CRNA) first came into existence in the late 1950s as a mode of providing advanced training to the specialty of anesthesia nursing. Nurse anesthetists are required to have a Bachelor's of Science degree in nursing or other appropriate undergraduate degree and a master's degree from one of the more than 100 graduate schools of nurse anesthesia."}, {"url": "http://www.anesthesiazone.com/crna-information.aspx", "passage_text": "Learn what it takes to be a certified registered nurse anesthetist. Find a general job description and information on the education and training needed to become a CRNA. Nurse anesthetists are required to have a Bachelor's of Science degree in nursing or other appropriate undergraduate degree and a master's degree from one of the more than 100 graduate schools of nurse anesthesia."}]