[{"url": "https://www.tsl.texas.gov/ref/abouttx/secession/reconstruction.html", "passage_text": "Chap. VI. An Act supplementary to an Act entitled An Act to provide for the more efficient Government of the Rebel States, passed March second, eighteen hundred and sixty-seven, and to facilitate Restoration [Passed over President Johnson's veto March 23, 1867]. CLIII-An Act to provide for the more efficient Government of the Rebel States [Passed over President Johnson's veto March 2, 1867]."}, {"url": "http://spartacus-educational.com/USASreconstruction.htm", "passage_text": "Congress passed the first Reconstruction Act on 2nd March, 1867. The South was now divided into five military districts, each under a major general. New elections were to be held in each state with freed male slaves being allowed to vote. "}, {"url": "http://government-programs.laws.com/reconstruction-act-of-1867", "passage_text": "Military Reconstruction Act: Following the passing of the Fourteenth Amendment, Congress took a decisive lead in establishing the course of Reconstruction. On March 2, 1867, Congress passed the first of four Military Reconstruction Acts. The First Military Reconstruction Act invalidated the government’s plan under Johnson."}, {"url": "http://www.sparknotes.com/history/american/reconstruction/section3.rhtml", "passage_text": "To further safeguard voting rights for former slaves, Republicans passed the Second Reconstruction Act, placing Union troops in charge of voter registration. Congress overrode two presidential vetoes from Johnson to pass the bills. Defiantly, Johnson ignored the act, fired Stanton in the summer of 1867 (while Congress was in recess), and replaced him with Union general Ulysses S. Grant. Afraid that Johnson would end Military Reconstruction in the South, Congress ordered him to reinstate Stanton when it reconvened in 1868."}, {"url": "http://www.infoplease.com/encyclopedia/history/reconstruction-the-reconstruction-acts.html", "passage_text": "On Mar. 2, 1867, Congress enacted the Reconstruction Act, which, supplemented later by three related acts, divided the South (except Tennessee) into five military districts in which the authority of the army commander was supreme. By Aug., 1868, six states (Arkansas, North Carolina, South Carolina, Louisiana, Alabama, and Florida) had been readmitted to the Union, having ratified the Fourteenth Amendment as required by the first Reconstruction Act."}, {"url": "http://historyengine.richmond.edu/episodes/view/1430", "passage_text": "The Second Reconstruction Act of March 23, 1867 supplemented the First Reconstruction Act. The First Reconstruction Act left the Southern States in confusion to whose role it was to reinforce the legislation. The Second Act answered this problem. It established and clarified that the military commanders held responsibility to register voters and hold elections in their territories."}, {"url": "http://historyengine.richmond.edu/episodes/view/1430", "passage_text": "Although the South regarded the First and Second Reconstruction Acts as embarrassments to the constitution, Northern radicals and moderates had compromised greatly to get them passed by the two thirds of support needed in Congress. The First Reconstruction Act left the Southern States in confusion to whose role it was to reinforce the legislation. The Second Act answered this problem. It established and clarified that the military commanders held responsibility to register voters and hold elections in their territories."}, {"url": "http://www.answers.com/Q/What_is_the_second_reconstruction_act", "passage_text": "A bill, passed by Radical Republicans in Congress in 1867, that treated Southern states as divided territories. Sometimes called the Military Reconstruction Act or the Reconst … ruction Act, the First Reconstruction Act divided the South into five districts, each governed by martial law. Second Reconstruction is a term, coined by historian C. Vann Woodward, that refers to the American Civil Rights Movement."}, {"url": "http://www.infoplease.com/encyclopedia/history/reconstruction-the-reconstruction-acts.html", "passage_text": "Under the terms of the Reconstruction Acts, new state constitutions were written in the South. By Aug., 1868, six states (Arkansas, North Carolina, South Carolina, Louisiana, Alabama, and Florida) had been readmitted to the Union, having ratified the Fourteenth Amendment as required by the first Reconstruction Act."}, {"url": "http://www.historycentral.com/documents/secondreconstruction.html", "passage_text": "Second Reconstruction Act [March 23, 1867]. An Act supplementary to an Act entitled An Act to provide for the more efficient Government of the Rebel States, passed. . . [March 2, I867] . . ., and to facilitate Restoration. Be it enacted. . ., That before."}]