[{"url": "http://www.ibuzzle.com/articles/incubation-period-for-a-cold.html", "passage_text": "The incubation period of a cold ranges between 2-4 days, depending upon the severity of the viral attack. In some cases, it can be as short as 10 hours of infection and as long as 5-7 days. Read the article to know the details. Thus, the average incubation period of common cold caused due to Rhinovirus infection in 2-4 days. During this period, the victim will experience runny nose, sneezing, sore throat and congestion in nasal passages. Rhinovirus infection is common among children and adult"}, {"url": "http://www.ehow.com/facts_5641686_incubation-period-common-cold_.html", "passage_text": "Incubation Period. According to the National Institute of Allergy and Infectious Diseases, the rhinovirus accounts for 30 percent to 50 percent of all cases of the common cold. It has a typical incubation period of 10 to 12 hours. In contrast, the influenza virus has an incubation period of one day to a week"}, {"url": "http://www.ibuzzle.com/articles/incubation-period-for-a-cold.html", "passage_text": "Common cold accompanied by fever is usually caused by influenza virus. The incubation period of influenza virus depends on the severity of the attack that can be as short as 1 day to a stretched period of 7 days. However, the approximate incubation period is in the range of 1-3 days when caused by influenza virus. Thus, the average incubation period of common cold caused due to Rhinovirus infection in 2-4 days. During this period, the victim will experience runny nose, sneezing, sore throat and congestion in nasal passages. Rhinovirus infection is common among children and adult"}, {"url": "http://www.healthguidance.org/entry/6125/1/Facts-about-the-Common-Cold-Incubation-Period.html", "passage_text": "The typical common cold incubation period is from two to five days, but symptoms can appear in as little as ten hours after the virus first enters the nose. The range of the common cold incubation period may be explained by the number of different viruses that can cause common cold symptoms. It is known that some viruses produce symptoms of disease more quickly than others and several hundred different viruses have been associated with the common cold. This makes it hard for scientists to determine an exact common cold incubation period, but in most diseases, there is only a range, not an exact figure. In clinical trials rhinoviruses were introduced directly into the nasal passages of volunteers and 95% of them became infected."}, {"url": "http://www.commoncold.org/understand.htm", "passage_text": "From the time a cold virus enters the nose, it takes 8-12 hours for the viral reproductive cycle to be completed and for new cold virus to be released in nasal secretions. (13) This interval is called the incubation period. Cold symptoms can also begin shortly after virus is first produced in the nose (10-12 hours). (13) The time from the beginning of the infection to the peak of symptoms is typically 36-72 hours. The symptoms of a common cold include sneezing, runny nose, nasal obstruction, sore or scratchy throat, cough, hoarseness, and mild general symptoms like headache, feverishness, chilliness, and not feeling well in general."}, {"url": "http://www.healthguidance.org/entry/6125/1/Facts-about-the-Common-Cold-Incubation-Period.html", "passage_text": "Another explanation for the wide range in the common cold incubation period is that some people never develop symptoms, even though an infection is present. This makes it hard for scientists to determine an exact common cold incubation period, but in most diseases, there is only a range, not an exact figure. In clinical trials rhinoviruses were introduced directly into the nasal passages of volunteers and 95% of them became infected."}, {"url": "http://www.ehow.com/facts_5641686_incubation-period-common-cold_.html", "passage_text": "Save. There are more than 200 different viruses that cause the common cold. The incubation period depends on the kind of viral infection; the average incubation period is two or three days. According to the National Institute of Allergy and Infectious Diseases, the rhinovirus accounts for 30 percent to 50 percent of all cases of the common cold. It has a typical incubation period of 10 to 12 hours."}, {"url": "http://www.wisegeekhealth.com/how-long-is-the-common-cold-incubation-period.htm", "passage_text": "A cold is an upper respiratory infection caused by a virus called rhinovirus. The common cold incubation period varies greatly from one person to the next. Symptoms can appear in just a few hours or as long as 10 days after exposure. The average incubation period is one to three days. The incubation period for a common cold depends on the kind of virus it's caused by. The incubation period is at least two days and up to a week or two weeks depending on the cause."}, {"url": "http://www.answers.com/Q/What_is_the_incubation_period_of_common_cold", "passage_text": "Confidence votes 40.4K. The incubation period of the common cold is typically 36 to 48 hours, but, in some cases, symptoms can arise within 12 hours, or slightly less, of catching the virus. The average incubation period of the common cold is estimated to be 3-5 days-the virus is spread via respiratory droplets (mucus, coughing, sneeezing)."}]