[{"url": "http://www.marthastewart.com/334168/basic-acorn-squash", "passage_text": "Directions. Preheat oven to 400 degrees. Place 2 whole acorn squash (about 2 pounds each) on a rimmed baking sheet; bake, turning occasionally, until very tender when pierced with the tip of a paring knife, about 1 hour."}, {"url": "http://www.cooks.com/recipe/4f6ok9lw/acorn-squash-microwave.html", "passage_text": "Bake squash whole in microwave oven for 4 minutes. Turn over and cook 4 more minutes. Cut squash in half and remove seeds. Fill each center with about a teaspoon of butter and 2 teaspoons brown sugar. Put back into oven and bake for another 3 minutes or until done."}, {"url": "http://www.ehow.com/how_5279994_cook-acorn-squash-microwave.html", "passage_text": "To cook whole acorn squash, place a single squash on a microwave-safe plate. Pierce the squash several times with the tines of a fork. Microwave on HIGH for 6 to 8 minutes for a 1 1/2-pound squash. Add an extra 2 minutes per 1/2 pound of squash. Rotate the squash halfway during cooking."}, {"url": "http://www.marthastewart.com/334168/basic-acorn-squash", "passage_text": "Cook's Notes. The squash can also be cooked in the microwave: Place whole squash on a paper towel microwave on high, turning occasionally, until very tender when pierced with the tip of a paring knife, 20 to 25 minutes."}, {"url": "http://www.ehow.com/how_5279994_cook-acorn-squash-microwave.html", "passage_text": "To cook cubed acorn squash, cut the squash in half, stem to tip, and scoop out the seeds and innards. Cut the halves in half, stem to tip, and then cut into 1- to 2-inch cubes. Place in a microwave-safe bowl, and cover with microwave-safe plastic wrap."}, {"url": "http://www.foodnetwork.com/recipes/microwave-squash-recipe.html", "passage_text": "Directions. To cook squash in the microwave, cut squash in 1/2, scoop out the seeds as if you were cleaning cantaloupe only it will be a little harder. Lay cut side down on a piece of microwave safe plastic wrap placed directly on microwave bottom or plate. Cook on high in 5 minute intervals until completely softened and cooked through, about 5 to 7 minutes for 1/2 an acorn squash."}, {"url": "http://www.cooks.com/rec/search/0,1-0,acorn_squash_microwave,FF.html", "passage_text": "1. ACORN SQUASH (Microwave). Bake squash whole in microwave oven for 4 ... teaspoon of butter and 2 teaspoons brown sugar. Put back into oven and bake for another 3 minutes or until done. 2. MICROWAVE ACORN SQUASH. 1 medium-sized acorn squash (other kinds can ... 4 1/2 minutes, rotate dish and cook 4 1/2 minutes more."}]