[{"url": "http://www.accountingtools.com/weighted-average-method", "passage_text": "Weighted Average Method Overview. The weighted average method is used to assign the average cost of production to a product. Weighted average costing is commonly used in situations where: 1  Inventory items are so intermingled that it is impossible to assign a specific cost to an individual unit. 2  The accounting system is not sufficiently sophisticated to track FIFO or LIFO inventory layers."}, {"url": "http://www.accountingformanagement.org/weighted-average-costing-method-of-inventory-valuation/", "passage_text": "Average costing method in periodic inventory system: When average costing method is used in a periodic inventory system, the cost of goods sold and the cost of ending inventory is computed using weighted average unit cost. Weighted average unit cost is computed using the following formula : Cost of goods sold: 2,500 units × $10.5118 = $26,280 Cost of ending inventory: 900 units × $10.5118 = $9,460. When average costing method is used in a perpetual inventory system, an average unit cost figure is computed each time a purchase is made."}, {"url": "http://accountingexplained.com/managerial/cost-systems/process-costing-fifo", "passage_text": "Example. Let us use the same example as in the article on process costing under weighted average method. Prepare a cost of production report for the packaging department of Company ABC for the month of December 2013 under FIFO method of process costing. Important information is reproduced here. FIFO method involves following steps, majority of which are the same as in weighted average method: 1  Preparing the quantity schedule: i.e. reconciling units in the beginning work in process, units added/started during the period, units transferred out and units in ending WIP."}, {"url": "http://www.accountingtools.com/weighted-average-method", "passage_text": "The ending inventory valuation is $45,112 (175 units × $257.78 weighted average cost), while the cost of goods sold valuation is $70,890 (275 units × $257.78 weighted average cost). The sum of these two amounts (less a rounding error) equals the $116,000 total actual cost of all purchases and beginning inventory. Weighted average costing is commonly used in situations where: 1  Inventory items are so intermingled that it is impossible to assign a specific cost to an individual unit. 2  The accounting system is not sufficiently sophisticated to track FIFO or LIFO inventory layers."}, {"url": "http://accountingexplained.com/managerial/cost-systems/process-costing-weighted-average", "passage_text": "Process Costing – Weighted Average Method. Process costing system is used for standardized production processes. Whenever a process cost sheet is prepared for a department, the department most likely has some unfinished units either in its beginning work in process, closing work in process or both. Unlike FIFO method, which assumes costs introduced first into a department are transferred out first, weighted average method does not assume any specific order. Process costing under weighted-average method involves the following steps:"}, {"url": "http://accountingexplained.com/managerial/cost-systems/process-costing-weighted-average", "passage_text": "There are two cost-flow assumptions: first-in-first-out (FIFO) and weighted average. In the weighted average method of process costing, the costs are averaged out and evenly applied to both units transferred out and units in closing work in process. Unlike FIFO method, which assumes costs introduced first into a department are transferred out first, weighted average method does not assume any specific order. Process costing under weighted-average method involves the following steps:"}, {"url": "http://www.accountingtools.com/weighted-average-method", "passage_text": "When using the weighted average method, divide the cost of goods available for sale by the number of units available for sale, which yields the weighted-average cost per unit. In this calculation, the cost of goods available for sale is the sum of beginning inventory and net purchases. Weighted average costing is commonly used in situations where: 1  Inventory items are so intermingled that it is impossible to assign a specific cost to an individual unit. 2  The accounting system is not sufficiently sophisticated to track FIFO or LIFO inventory layers."}, {"url": "http://www.accounting-basics-for-students.com/fifo-method.html", "passage_text": "Using the weighted average cost method, our closing inventory amounts to $1,059. This equates to a cost of $1.06 per lollypop ($1,059/1,000 lollypops). Oddly enough, the LIFO method is the preferred inventory valuation method in the United States but is disallowed in non-US countries. "}, {"url": "http://www.investopedia.com/ask/answers/09/weighted-average-fifo-lilo-accounting.asp", "passage_text": "By Chizoba Morah AAA |. A: The main difference between weighted average cost accounting, LIFO, and FIFO methods of accounting is the difference in which each method calculates inventory and cost of goods sold. The weighted average cost method uses the average of the costs of the goods to assign costs. In other words, weighted average uses the formula: Total cost of items in inventory available for sale divided by total number of units available for sale. In contrast, FIFO (first in, first out) accounting means that the costs assigned to goods are the costs for the first goods bought."}]