[{"url": "http://www.diffen.com/difference/Transcription_vs_Translation", "passage_text": "Transcription initiates with RNA polymerase binding to the promoter region in the DNA. The transcription factors and RNA polymerase binding to the promoter forms a transcription initiation complex. Transcription is the synthesis of RNA from a DNA template where the code in the DNA is converted into a complementary RNA code. Translation is the synthesis of a protein from an mRNA template where the code in the mRNA is converted into an amino acid sequence in a protein."}, {"url": "http://nar.oxfordjournals.org/content/33/3/838.full", "passage_text": "In the nucleus of eukaryotes, transcription is carried out by three different RNA polymerases, RNA polymerase I, II and III (Pol I, II and III) (1). Each of them is dedicated to the transcription of distinct sets of genes, but none is able to recognize its target promoters independently. "}, {"url": "http://www.diffen.com/difference/Transcription_vs_Translation", "passage_text": "Occurs when RNA polymerase protein binds to the promoter in DNA and forms a transcription initiation complex. Promoter directs the exact location for the initiation of transcription. Transcription is the synthesis of RNA from a DNA template where the code in the DNA is converted into a complementary RNA code. Translation is the synthesis of a protein from an mRNA template where the code in the mRNA is converted into an amino acid sequence in a protein."}, {"url": "http://jb.asm.org/content/180/12/3019.full", "passage_text": "Summary of RNA polymerase-promoter interactions. A promoter with consensus sequences for the −10 and −35 regions (boxed) is shown; the sequences of actual promoters deviate from those shown here. In general, the more closely a promoter resembles the one shown, the stronger (more active) the promoter will be. From studies of several promoters at low temperatures (10°C and below), the equilibrium constant (K 1) for the initial binding of RNA polymerase to form a closed complex has been estimated to be about 10 7 to 10 8 M −1 in buffer containing 0.1 M monovalent cation and 0.01 M MgCl 2."}, {"url": "https://en.wikipedia.org/wiki/RNA_polymerase_I", "passage_text": "From Wikipedia, the free encyclopedia. RNA polymerase 7 (also known as Pol I) is, in higher eukaryotes, the polymerase that only transcribes ribosomal RNA (but not 5S rRNA, which is synthesized by RNA polymerase III), a type of RNA that accounts for over 50% of the total RNA synthesized in a cell. Contents. The 5S ribosomal RNA is transcribed by Pol III. Because of the simplicity of Pol I transcription, it is the fastest-acting polymerase and contributes up to 60% of cellular transcription levels in exponentially growing cells."}, {"url": "https://en.wikibooks.org/wiki/Structural_Biochemistry/Transcription", "passage_text": "The function of a transcription factor is to bring RNA polymerase and the promoter together. It will bind to RNA polymerase and at the same time, associate with the DNA promoter. Transcription factors exist in both prokaryotes and eukaryotes. An example of a prokaryotic transcription factor is the Sigma Factor.. The sigma factor is involved in locating RNA polymerase to the correct location. The promoter region is where RNA polymerase binds to DNA to initiate transcription. Not all promoters will have the same sequence. Strong promoters will have a similar nucleotide sequence as a known consensus sequence. Weak promoters will have a different sequence."}, {"url": "http://www.nature.com/scitable/topicpage/RNA-Transcription-by-RNA-Polymerase-Prokaryotes-vs-961", "passage_text": "For example, researchers know that RNA pol II can bind to a DNA sequence within the promoter of many genes, known as the TATA box, to initiate transcription. Together with other common motifs (short recognition sequences in the DNA), these elements constitute the core promoter. "}, {"url": "http://openstudy.com/updates/4e3325530b8ba7b2da41a241", "passage_text": "You've already chosen the best response. RNA polymerase binds to a specific promoter-a DNA sequence that provides a recognition and attachment site for RNA polymerase to begin the process of gene transcription. The promoter is upstream from the transcription start site, so the promoter itself does not get transcribed. "}, {"url": "http://www.ncbi.nlm.nih.gov/books/NBK22085/", "passage_text": "Transcription by RNA polymerase. An RNA strand is synthesized in the 5′ → 3′ direction from a locally single stranded region of DNA. (After E. J. Gardner, M. J. Simmons, and D. P. Snustad, Principles of Genetics, (more...). Figure 10-7 shows the structure of RNA polymerase from E. coli. We can see that the enzyme consists of four different subunit types. The beta (β) subunit has a molecular weight of 150,000, beta prime (β′) 160,000, alpha (α) 40,000, and sigma (σ) 70,000."}, {"url": "https://en.wikipedia.org/wiki/RNA_polymerase", "passage_text": "Compare RNA-dependent RNA polymerase. RNA polymerase (RNAP or RNApol), also known as DNA-dependent RNA polymerase, is an enzyme that produces primary transcript RNA. In cells, RNAP is necessary for constructing RNA chains using DNA genes as templates, a process called transcription. RNA polymerase enzymes are essential to life and are found in all organisms and many viruses."}]