[{"url": "https://answers.yahoo.com/question/index?qid=20080427172049AAthuU4", "passage_text": "I heard that you shouldn't have milk with seafood products (not only fish but other seafood as well) because you would get food poisoning. One of my friend did, he got so sick and he rushed to the hospital and the doctors told him he's got food poisoning. Rating Newest Oldest. Best Answer: Well I was told as a young boy that, You can't eat, Fresh Lobster and drink whole milk with It. Somehow It will cause a type of poison that reacts In your stomach and can make you very sick. (Now this Is only what I've been told) But I've eaten all other fish with milk, And no reaction at all. Even Shrimp, Craw fish. And a lot of other shell fish as well. But I'm still a bit afraid to try the fresh Lobster & Milk"}, {"url": "http://www.answers.com/Q/Can_you_drink_milk_after_eating_fish", "passage_text": "You should not drink milk after eating fish of a few particular species in a few particular months. Because in their breeding season their body chemicals change and there is a … chemical present which reacts with milk and skin pigmentation problems do arise in human beings. "}, {"url": "http://skeptics.stackexchange.com/questions/6719/is-eating-fish-and-drinking-milk-at-the-same-time-linked-with-skin-disease", "passage_text": "1. I heard from several people that drinking milk or dairy products while eating fish can lead towards a special skin pigmentation disorders such as different skin color or bright spots on skin. I asked a dermatologist about it and she said it is preferred not to do so, as there are some cases reported. The skin disease particulars you mention above seems to be an elaboration from Hindu religion: In Pakistan, it is widely believed that if one drinks milk after eating fish (or other way around), you get skin disease. However this is not true. The skin disease (in which people's skin become white overtime) is a tropical skin disease and has nothing to do with simultaneous consumption of fish and milk"}, {"url": "http://www.themedicalquestions.com/Pregnant/can-you-eat-milk-fish-if-you-are-pregnant.html", "passage_text": "I eat fish, eggs, cheese and milk but no meat.I drink about 750 ml of milk and about 25 g of cheese every day. I don't eat fish daily but about150 g of fish once week. Also some legumes twicw or thrice a week. "}, {"url": "https://www.quora.com/Can-you-consume-fish-and-milk-together", "passage_text": "This is a common Indian myth that having milk products over chicken and fish will cause white patches on the skin. This was thought so in the olden days, but today, there is no scientific proof connecting skin color to the foods we eat. The most common reason to have skin patches is Leucoderma. Consider that there are thousands of tasty recipes in which fish are cooked with or in milk, have toppings that include milk in some form, and that many people world-wide have consumed milk with or immediately after fish for as long as several thousand years and in virtually all parts of the world."}, {"url": "https://au.answers.yahoo.com/question/index?qid=20091023070148AAnoVha", "passage_text": "There is no reason not to drink milk after eating fish, I often poach fish in milk and use the milk to make some parsley sauce. "}, {"url": "http://www.theglobepress.com/drinking-milk-with-fish-is-not-harmful/", "passage_text": "my skin is completely fine. so you can drink Milk with consuming fish without taking any tension. Would you believe it that there are even recipes which are made with Milk and fish together like Fish Baked in Coconut Milk Recipe. I also searched for information about it on the Internet and found that its nothing but a myth that taking Milk with fish can harm you in any way. Medically or scientifically no one is able to prove that consumption of milk and fish together can cause a disease."}, {"url": "http://www.nestle-family.com/nutrition-health/english/mythbusters_eating-fish-and-dairy-together-at-the-same-meal-is-toxic_43.aspx", "passage_text": "And you can find many recipes that incorporate both together, like baked fish with a cream-based sauce. Just make sure these foods are handled properly and safely before consumption, i.e the fish is fresh and cooked well, and the milk or dairy is consumed before their expiry date. "}]