[{"url": "https://answers.yahoo.com/question/index?qid=20090211203334AA4GP6X", "passage_text": "Your spay/neuter cost is a one time thing and depends largely on your vet. $150 would be a conservative estimate. License is around $20 to $30 a year. Shots I would guess around $60 a year. It depends on the kind of food you feed him but a 40 lb bag costs from $20 to $60 a bag. Treats also depend on what you give him. "}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20080711104923AAFW9iU", "passage_text": "You can expect to be spending $40 to $400 per month in the first year and $25 to $200 per month thereafter. If you buy the fancy food and toys, it will quickly run up your tab. But the bare minimum will neglect things like vet visits and important medication. The size of the dog doesn't make a huge difference in cost. A small dog costs mainly $300-$400 just buying them if they are purebred. If you have one already and it is due for it's shots that month the shots would cost around $200. This is not including heartworm pills, flea and tick medicine (collar, liquid), and rabbies shots."}, {"url": "http://dogs.about.com/od/becomingadogowner/a/costofdogs.htm", "passage_text": "As a good dog owner, you should do your best to be ready for life's little surprises. Emergencies, chronic illnesses, disasters and other unplanned expenses can amount to hundreds or even thousands of dollars per year. The cost of an emergency vet hospital visit can start around $500 and go up to $2000 or more. Learn your limits before you get a dog to help you make the right decisions. Financially providing for your dogs is a big part of being a responsible dog owner. The cost of owning a dog can be estimated at $700-3000 per year (see the chart at the bottom of this page). There are ways to save money depending on the choices you make. Contributing factors include your dog's size and age, the region in which you live, your own lifestyle, and your dog's individual needs"}, {"url": "http://www.peteducation.com/article.cfm?c=2+2106&aid=1543", "passage_text": "After all, we love our pets and we would not put a price on their health and happiness. The hard facts are that the cost of owning a dog is an extremely important consideration for a number of often overlooked reasons. The first concerns the purchase price of the dog. Many people balk at paying $500 to $1000 for a dog. They rationalize that they simply can not afford it and settle for a poorly bred $150 puppy instead. What a huge mistake. The cost of a guaranteed healthy, well-bred $1000 puppy is a fraction of what it will cost to own that dog for 12 years. A poorly bred dog with bad hips, allergies, and a not so bright disposition will end up costing you thousands more in medical bills not to mention hours of frustration and disappointment"}, {"url": "http://pets.thenest.com/monthly-cost-food-siberian-husky-9569.html", "passage_text": "The feeding recommendation for an adult Siberian husky is 1 ½ - 2 cans of wet food per day, based on a 12-oz can. Mid-range name brand dog food costs about $1.25 per can. At 2 cans per day, your cost would be $75 per month. Premium canned food costs on average $2.50 per can. Feeding your dog slightly less of the premium food, you'll need 1 to 1 1/2 cans per day. At $2.50 per can for 45 cans, the cost would be $112.50 per month. Premium or natural dog food can cost $60 to $70 for a 30 lb bag for brands such as Blue Buffalo, Eukanuba, and Wellness. Because dogs can eat slightly less when eating premium dog food, a husky would eat about 1 1/2 cups per day."}, {"url": "http://dogs.about.com/od/becomingadogowner/a/costofdogs.htm", "passage_text": "Routine veterinary care is a huge part of keeping your dog healthy. Plan on going to the vet for wellness checkups once or twice a year at a cost of at least $150-300 yearly. Annual blood work can add about $100-200. Learn your limits before you get a dog to help you make the right decisions. Financially providing for your dogs is a big part of being a responsible dog owner. The cost of owning a dog can be estimated at $700-3000 per year (see the chart at the bottom of this page). There are ways to save money depending on the choices you make. Contributing factors include your dog's size and age, the region in which you live, your own lifestyle, and your dog's individual needs"}, {"url": "http://pets.costhelper.com/dog-food.html", "passage_text": "1 Basic dry kibble, on average, costs between $100 and $250 per year for a 30-pound bag every month to two months. 2  Premium or holistic dry kibble, on average, costs between $200 and $400 per year for a thirty-pound bag every month to two months. 1 Treats can cost anywhere from $2 per bag for simple grain-based treats to $2 -plus each for handmade treats from a dog bakery. 2  HealthyPet.com has a guide to using treats in a healthy way. 3  The average dog owner spends $77 per year on vitamins, according to the American Pet Product Manufacturers Association."}, {"url": "http://pets.costhelper.com/dog-food.html", "passage_text": "Dog Food Cost. 1  Basic dry kibble, on average, costs between $100 and $250 per year for a 30-pound bag every month to two months. 1 Treats can cost anywhere from $2 per bag for simple grain-based treats to $2 -plus each for handmade treats from a dog bakery. 2  HealthyPet.com has a guide to using treats in a healthy way. 3  The average dog owner spends $77 per year on vitamins, according to the American Pet Product Manufacturers Association."}, {"url": "http://www.moneyunder30.com/the-true-cost-of-pet-ownership", "passage_text": "According to this report, the total first-year cost of owning a dog is $1,270 and for a cat it’s $1,070. As you can see, having a pet can cost you over $1,000 in the first year, and well over $500 each additional year. Depending on the food you buy and your actual medical expenses, the costs could be much higher. "}]