[{"url": "http://www.biographyonline.net/music/billie-holiday.html", "passage_text": "Billie Holiday (April 7, 1915 – July 17, 1959) was an American jazz singer and songwriter. Nicknamed Lady Day by her loyal friend and musical partner, Lester Young, Holiday was a seminal influence on jazz and pop singing. "}, {"url": "http://www.npr.org/2010/11/19/131451449/billie-holiday-emotional-power-through-song", "passage_text": "It was the first time I ever heard anybody sing without using any words.. Holiday's real vocal influence is Louis Pops Armstrong. She heard his Hot Five vocal numbers, and is clearly an Armstrong-inspired singer. Schaap has studied Armstrong's influence on Billie Holiday closely. He's been demonstrating how Holiday mimics Armstrong's phrasing on his radio shows at Columbia University's WKCR for some 30 years. You really have to hear it, is what you have to do, Schaap says."}, {"url": "http://articles.latimes.com/2000/mar/10/entertainment/ca-7254", "passage_text": "But it wasn't Holiday's way. A somewhat more intriguing picture of Holiday emerges in a new book, Strange Fruit: Billie Holiday, Cafe Society and an Early Cry for Civil Rights by David Margolick ($16.95, Running Press), scheduled for publication April 7, which would have been her 85th birthday. Holiday, with Nat King Cole, was inducted Monday as an Early Influence.. And that association, to make a further political reference, is reminiscent of the politicians who attempt to assure their own importance by wrapping themselves in the mantles of Washington, Lincoln, Roosevelt, etc."}, {"url": "http://articles.latimes.com/2000/mar/10/entertainment/ca-7254", "passage_text": "It actually happened. Holiday, with Nat King Cole, was inducted Monday as an Early Influence.. And that association, to make a further political reference, is reminiscent of the politicians who attempt to assure their own importance by wrapping themselves in the mantles of Washington, Lincoln, Roosevelt, etc."}, {"url": "http://www.nytimes.com/learning/general/onthisday/bday/0407.html", "passage_text": "BY THE NEW YORK TIMES. Billie Holiday, famed jazz singer, died yesterday in Metropolitan Hospital. Her age was 44. The immediate cause of death was given as congestion of the lungs complicated by heart failure. Miss Holiday had lived at 26 West Eighty-seventh Street. Miss Holiday took her professional name from her father, Clarence Holiday, a guitarist who played with Fletcher Henderson's band in the Nineteen Twenties and from one of the favorite movie actresses of her childhood, Billie Dove. She came to New York with her mother in 1928"}, {"url": "https://en.wikipedia.org/wiki/Billie_Holiday", "passage_text": "Eleanora Fagan (April 7, 1915 – July 17, 1959), professionally known as Billie Holiday, was an American jazz musician and singer-songwriter. By the late 1930s, Billie Holiday had toured with Count Basie and Artie Shaw, scored a string of radio and retail hits with Teddy Wilson, and became an established artist in the recording industry."}, {"url": "http://articles.latimes.com/2000/mar/10/entertainment/ca-7254", "passage_text": "But I suspect that Holiday's influence upon rock-era artists had a lot more to do with attitude than music--with some perception of her as an outsider rather than a fascination with who she was and what she was attempting to do as a jazz artist. Holiday, with Nat King Cole, was inducted Monday as an Early Influence.. And that association, to make a further political reference, is reminiscent of the politicians who attempt to assure their own importance by wrapping themselves in the mantles of Washington, Lincoln, Roosevelt, etc."}, {"url": "http://www.mtv.com/artists/billie-holiday/", "passage_text": "Billie Holiday's chaotic life reportedly began in Baltimore on April 7, 1915 (a few reports say 1912) when she was born Eleanora Fagan Gough. Her father, Clarence Holiday, was a teenaged jazz guitarist and banjo player later to play in Fletcher Henderson's Orchestra. By the digital age, virtually all of Holiday's recorded material had been reissued: by Columbia (nine volumes of The Quintessential Billie Holiday), Decca (The Complete Decca Recordings), and Verve (The Complete Billie Holiday on Verve 1945-1959)."}, {"url": "http://www.bet.com/topics/b/billie-holiday.html", "passage_text": "Singer Billie Holiday is recognized as one of the world's greatest jazz vocalists. She's known for classic recordings like Strange Fruit, Don't Explain, God Bless the Child and Lady Sings the Blues, many of which have been inducted into the Grammy Hall of Fame. Billie Holiday."}]