[{"url": "http://www.ftmguide.org/hormonebasics.html", "passage_text": "The sex hormones: testosterone, estrogen, and progesterone. The hormones commonly considered to be sex hormones in the body are testosterone, estrogen, and progesterone. Testosterone is often referred to as a male hormone, and estrogen and progesterone are often referred to as female hormones."}, {"url": "http://www.enotes.com/homework-help/what-hormones-what-do-they-do-394376", "passage_text": "Here are some things that hormones do for the body. Remember, though, they are only the messengers that start the cells into action. They go out into the body when told to by a higher power (the gland) and it's the cell that actually does the work. Various endocrine glands secrete hormones into the blood, which carries them throughout the body. When a hormone arrives at its target organ or tissue it causes certain actions to take place. Hormones may be grouped according to the functions they control."}, {"url": "http://ministryhealth.org/HC/Home/Spring2010/Yourthyroidisyourmetaboliccontrolcenter.nws", "passage_text": "Thyroid hormones control metabolism, growth, body temperature, muscle strength, appetite, and the health of your heart, brain, kidneys, and reproductive system. Thyroid cells are the only cells in the body that absorb iodine. "}, {"url": "http://www.hopkinsmedicine.org/healthlibrary/conditions/endocrinology/hormones_and_the_endocrine_system_85,P00402/", "passage_text": "The endocrine system uses hormones to control and coordinate your body's internal metabolism (or homeostasis) energy level, reproduction, growth and development, and response to injury, stress, and environmental factors. Consider the following hormones and their role in the workings of the endocrine system: Where the hormone is produced. Hormone(s) secreted. Hormone function. Adrenal glands. Aldosterone."}, {"url": "https://www.sharecare.com/health/endocrine-system/what-role-hormones-in-body", "passage_text": "When we think about hormones, those such as testosterone and estrogen likely first come to mind, but there’s so much more to our endocrine system than the sex hormones that command our reproductive cycle. Hormones are as much a part of our reproductive system as they are a part of our urinary, respiratory, cardiovascular, nervous, muscular, skeletal, immune, and digestive system. From The Mind-Beauty Connection: 9 Days to Less Stress, Gorgeous Skin, and a Whole New You by Amy Wechsler."}, {"url": "http://www.enotes.com/homework-help/what-hormones-what-do-they-do-394376", "passage_text": "Most hormones in the human body are produced by organs called ductless glands (endocrines). These include the two adrenal glands, the pituitary gland, the four parathyroid glands, the sex glands, and the thyroid gland. Various endocrine glands secrete hormones into the blood, which carries them throughout the body. When a hormone arrives at its target organ or tissue it causes certain actions to take place. Hormones may be grouped according to the functions they control."}, {"url": "http://www.hormone.org/hormones-and-health/what-do-hormones-do/what-does-the-thyroid-gland-do", "passage_text": "The thyroid (THY-royd) gland, a small butterfly-shaped gland in the front of your neck, makes thyroid hormones. Thyroid hormones travel from the thyroid gland through the blood to all parts of the body, where they do their work. Sometimes the thyroid gland makes too much thyroid hormone, which is called hyperthyroidism. Think of your body as a car and your thyroid as the engine. An overactive thyroid makes your body idle too fast."}, {"url": "http://www.hormone.org/hormones-and-health/what-do-hormones-do/what-does-the-thyroid-gland-do", "passage_text": "Having thyroid hormone levels that are too high (overactive thyroid gland). Sometimes the thyroid gland makes too much thyroid hormone, which is called hyperthyroidism. Think of your body as a car and your thyroid as the engine. An overactive thyroid makes your body idle too fast."}, {"url": "https://www.sharecare.com/health/endocrine-system/what-role-hormones-in-body", "passage_text": "Put simply, hormones are the body’s little messengers, which get produced in one part of the body, such as the thyroid, adrenal or pituitary gland, pass into the bloodstream or other body fluid, and go to distant organs and tissues where they act to modify structures and functions. Hormones are as much a part of our reproductive system as they are a part of our urinary, respiratory, cardiovascular, nervous, muscular, skeletal, immune, and digestive system. From The Mind-Beauty Connection: 9 Days to Less Stress, Gorgeous Skin, and a Whole New You by Amy Wechsler."}, {"url": "http://www.enotes.com/homework-help/what-hormones-what-do-they-do-394376", "passage_text": "These glands are also called 'ductless glands' meaning that the glands directly empty the hormones into the bloodstream. There are four types of hormones, namely, steroid, lipid, protein and amino acid hormones. Hormones control the various metabolic activities of the body. They help to provide the proper amount of energy and nutrition your body needs to function. Various endocrine glands secrete hormones into the blood, which carries them throughout the body. When a hormone arrives at its target organ or tissue it causes certain actions to take place. Hormones may be grouped according to the functions they control."}]