[{"url": "http://www.newsmax.com/FastFeatures/anemia-treatments-symptoms-cures/2011/06/23/id/401218/", "passage_text": "Sickle cell anemia, iron deficiency anemia, vitamin deficiency, and bone marrow and stem cell problems are associated with anemia as the result of decreased or faulty red blood cell production. Because there are either too few blood cells or blood cells are not functioning correctly, anemia can result."}, {"url": "http://health.usnews.com/health-news/health-wellness/articles/2013/04/13/understanding-anemia-types-symptoms-and-treatment", "passage_text": "Causes of the Common Types of Anemia. There are many types of anemia. • Iron-deficiency anemia is caused by a shortage of iron in the body. Your bone marrow needs iron to make hemoglobin, which is a protein molecule in the red blood cells."}, {"url": "http://my.clevelandclinic.org/health/diseases_conditions/hic_anemia", "passage_text": "Yes. Iron-deficiency anemia is just one type of anemia. Other types of anemia are caused by: 1  Diets lacking in vitamin B12 (or, the body is unable to use, or absorb B12). 2  Diets lacking in folic acid (or, the body is unable to use folic acid). 3  Inherited blood disorders."}, {"url": "https://www.healthtap.com/topics/how-many-different-types-of-anemia-are-there", "passage_text": "Many: There are many types. Anemia means that there is a decrease in the number of red blood cells. Probably the most common type relates to bleeding, e.g., from menstrual periods, rectal bleeding, trauma, etc."}, {"url": "http://www.newsmax.com/FastFeatures/anemia-treatments-symptoms-cures/2011/06/23/id/401218/", "passage_text": "Print |. A A. There are more than 400 types of anemia. These types of anemia are divided into three main groups, according to their cause. There is anemia caused by blood loss, by decreased or faulty red blood cell production, and by destruction of red blood cells. Anemia caused by blood loss is the result of chronic bleeding."}, {"url": "http://www.webmd.com/a-to-z-guides/understanding-anemia-basics", "passage_text": "You can prevent some types of anemia with a healthy diet. Foods containing iron include lean red meat, liver, fish, tofu, lentils and beans, dark green leafy vegetables, and dried fruits. Also eat foods with vitamin B12 and folic acid, such as eggs and dairy products, spinach, and bananas."}]