[{"url": "http://sociologyindex.com/matrilineal_societies.htm", "passage_text": "MATRILINEAL SOCIETIES are societies in which descent is traced through mothers rather than through fathers. In matrilineal societies, property is often passed from mothers to daughters and the custom of matrilocal residence may be practiced. Patrilineal Descent is traced through fathers rather than through mothers."}, {"url": "http://www.indianetzone.com/45/matrilineal_form_society.htm", "passage_text": "Matrilineal form of society is considered to be one of the significant features of Kerala. It is also known as Marumakkathayam. Matrilineal succession forms a part of the society of Kerala. The medieval Kerala society was shaped not only by caste, but by a parallel system of matrilineal and patrilineal form of inheritance."}, {"url": "http://www.indianetzone.com/51/tribal_society_northeast_india.htm", "passage_text": "Tribal Society of Northeast India consists of matrilineal, patrilineal and patri-matrilineal societies. These tribal societies are commonly headed by a leader who is chosen on the basis of ties of kinship. North-East India is inhabited by numerous tribes."}, {"url": "http://www.indianetzone.com/45/matrilineal_form_society.htm", "passage_text": "Matrilineal Form of Society is considered as one of the main trends of Kerala in which women members of the family have a greater say with regard to the inheritance of property. The Nair community of Kerala holds a place of importance because of its feature of matrilineal system."}, {"url": "http://www.businessinsider.com/mawlynnong-india-is-the-cleanest-village-in-asia-2015-2", "passage_text": "Allisha Azlan Mawlynnong, a village in India, is unlike most other villages on earth. The village is home to the Khasi tribe, a matrilineal society in which lineages and property are passed from mother to daughter, and women own most of the land."}, {"url": "https://nitawriter.wordpress.com/2008/03/19/meghalaya-and-kerala-status-of-women/", "passage_text": "Women in traditional matrilineal societies like Meghalaya in the north-east of India do not have matriarchy (as mentioned earlier). Take the political power. In the state legislature, there don’t seem to be any women at all. The 2 Lok Sabha MP’s from Meghalaya are men and so are the Rajya Sabha MP’s."}, {"url": "http://sociologyindex.com/matrilineal_societies.htm", "passage_text": "At the global level, the existence of matrilineal society is found among the tribes of African countries, in some part of Southeast Asia and among three groups of India. It is the Minangkabaus of West Sumatra, Indonesia, comprising the largest ethnic group in the world who follow a matrilineal system (Tanius, 1983)."}, {"url": "http://megartsculture.gov.in/herit_volI.htm", "passage_text": "Meghalaya.........The Matrilineal Society. By Minimon Laloo. Meghalaya lies in the extreme northeastern region of India. It is the only state in the entire northeast which is matrilineal and takes the identity solely from the mother."}]