[{"url": "http://www.mayoclinic.org/diseases-conditions/mental-illness/in-depth/mental-health/ART-20046477", "passage_text": "Steps to cope with stigma. Here are some ways you can deal with stigma: 1  Get treatment. 2  You may be reluctant to admit you need treatment. 3  Don't let the fear of being labeled with a mental illness prevent you from seeking help. Here are some ways you can deal with stigma: 1  Get treatment. 2  Don't let stigma create self-doubt and shame. 3  Don't isolate yourself. 4  Don't equate yourself with your illness. 5  Join a support group. 6  Get help at school. 7  Speak out against stigma."}, {"url": "https://www.psychologytoday.com/blog/why-we-worry/201308/mental-health-stigma", "passage_text": "In relation to social stigma, studies have suggested that stigmatising attitudes towards people with mental health problems are widespread and commonly held (Crisp, Gelder, Rix, Meltzer et al., 2000; Bryne, 1997; Heginbotham, 1998). In a survey of over 1700 adults in the UK, Crisp et al. As we have already described, people tend to hold these negative beliefs about mental health problems regardless of their age, regardless of what knowledge they have of mental health problems, and regardless of whether they know someone who has a mental health problem."}, {"url": "http://www.mayoclinic.org/diseases-conditions/mental-illness/in-depth/mental-health/ART-20046477", "passage_text": "1 Don't let the fear of being labeled with a mental illness prevent you from seeking help. 2  Treatment can provide relief by identifying what's wrong and reducing symptoms that interfere with your work and personal life. 3  Don't let stigma create self-doubt and shame. 4  Stigma doesn't just come from others. Here are some ways you can deal with stigma: 1  Get treatment. 2  Don't let stigma create self-doubt and shame. 3  Don't isolate yourself. 4  Don't equate yourself with your illness. 5  Join a support group. 6  Get help at school. 7  Speak out against stigma."}, {"url": "http://www.webmd.com/mental-health/mental-illness-stigma", "passage_text": "1 Remembering that you and your loved ones have choices: You can decide whom to tell about the mental illness -- just as you can with any other personal or private information -- and what to tell them. 2  Remembering that you are not alone: Many other people cope with similar situations. 1 Helping your loved one to feel good about him or herself is important. 2  Remaining active and surrounding yourself with supportive people: Social isolation can be a negative side effect of the stigma linked to mental illness."}, {"url": "http://www.mayoclinic.org/diseases-conditions/mental-illness/in-depth/mental-health/ART-20046477", "passage_text": "1 Get treatment. 2  You may be reluctant to admit you need treatment. 3  Don't let the fear of being labeled with a mental illness prevent you from seeking help. 4  Treatment can provide relief by identifying what's wrong and reducing symptoms that interfere with your work and personal life. Here are some ways you can deal with stigma: 1  Get treatment. 2  Don't let stigma create self-doubt and shame. 3  Don't isolate yourself. 4  Don't equate yourself with your illness. 5  Join a support group. 6  Get help at school. 7  Speak out against stigma."}, {"url": "http://ontario.cmha.ca/mental-health/mental-health-conditions/stigma-and-discrimination/", "passage_text": "The lives of people with mental health conditions are often plagued by stigma as well as discrimination. Stigma is a negative stereotype. Stigma is a reality for many people with a mental illness, and they report that how others judge them is one of their greatest barriers to a complete and satisfying life. Stigma differs from discrimination. Stigma is the negative stereotype and discrimination is the behaviour that results from this negative stereotype. Often, individuals with a mental illness are faced with multiple, intersecting layers of discrimination as a result of their mental illness and their identity."}, {"url": "http://www.mayoclinic.org/diseases-conditions/mental-illness/in-depth/mental-health/ART-20046477", "passage_text": "1 You may be reluctant to admit you need treatment. 2  Don't let the fear of being labeled with a mental illness prevent you from seeking help. 3  Treatment can provide relief by identifying what's wrong and reducing symptoms that interfere with your work and personal life. 4  Don't let stigma create self-doubt and shame. Here are some ways you can deal with stigma: 1  Get treatment. 2  Don't let stigma create self-doubt and shame. 3  Don't isolate yourself. 4  Don't equate yourself with your illness. 5  Join a support group. 6  Get help at school. 7  Speak out against stigma."}, {"url": "http://www.webmd.com/mental-health/mental-illness-stigma", "passage_text": "They both have symptoms of impulsiveness and mood swings. But they are different disorders and have different treatments. 1  Remembering that you and your loved ones have choices: You can decide whom to tell about the mental illness -- just as you can with any other personal or private information -- and what to tell them. 1 Helping your loved one to feel good about him or herself is important. 2  Remaining active and surrounding yourself with supportive people: Social isolation can be a negative side effect of the stigma linked to mental illness."}, {"url": "http://www.mentalhealth.wa.gov.au/mental_illness_and_health/mh_stigma.aspx", "passage_text": "Stigma is a mark of disgrace that sets a person apart. When a person is labelled by their illness they are seen as part of a stereotyped group. Negative attitudes create prejudice which leads to negative actions and discrimination. Stigma brings experiences and feelings of: 1  shame. 2  blame. 3  hopelessness. 4  distress. "}]