[{"url": "http://www.minerals.net/mineral/cinnabar.aspx", "passage_text": "Cinnabar is the chief mineral composed of the element mercury, and is a very important ore mineral. Though most Cinnabar is massive and uninteresting in habit, several localities produce phenomenal and strikingly colored red crystals that stand out with beautiful contrast on top of a white matrix. Cinnabar is occasionally associated with Native Mercury, in the form of small metallic blobs perched on top or within cavities of the Cinnabar. Since Cinnabar is composed from mercury which has various health hazards, it is recommended to wash hands after handling Cinnabar specimens."}, {"url": "https://en.wikipedia.org/wiki/Cinnabar", "passage_text": "Cinnabar has been used for its color since antiquity in the Near East, including as a rouge-type cosmetic, in the New World since the Olmec culture, and in China since as early as the Song dynasty, where it was used in coloring lacquerware. As the most common source of mercury in nature, cinnabar has been mined for centuries, even as far back as the Neolithic Age. During the Roman Empire it was mined both as a pigment, and for its mercury content. To produce liquid mercury (quicksilver), crushed cinnabar ore is roasted in rotary furnaces"}, {"url": "http://geology.com/minerals/cinnabar.shtml", "passage_text": "Cinnabar is trigonal, while metacinnabar is isometric. The two minerals should not be confused with one another because metacinnabar has a metallic gray color, a gray-to-black streak and a metallic-to-submetallic luster. Cinnabar is the only important ore of mercury. For thousands of years cinnabar has been mined and heated in a furnace. The mercury escapes as a vapor that can be condensed into liquid mercury. Because cinnabar is the only important ore of mercury, the demand for mercury has driven mining activity. Mercury has many uses, but its toxicity has reduced its use in any application where reasonable substitutes can be found."}, {"url": "https://en.wiktionary.org/wiki/cinnabar", "passage_text": "cinnabar ‎(usually uncountable, plural cinnabars). 1  A deep red mineral, mercuric sulfide, HgS; the principal ore of mercury; such ore used as the pigment vermilion. 2  A bright red colour tinted with orange. Noun [edit]. "}, {"url": "http://galleries.com/Cinnabar", "passage_text": "Chemistry: HgS, Mercury Sulfide Class: Sulfides and Sulfosalts Uses: primary ore of mercury, a pigment and as a minerals specimen. Specimens Cinnabar is a colorful mineral that adds a unique color to the mineral color palette. Its cinnamon to scarlet red color can be very attractive. Well shaped crystals are uncommon and the twinned crystals are considered classics among collectors"}, {"url": "http://geology.com/minerals/cinnabar.shtml", "passage_text": "Cinnabar is a toxic mercury sulfide mineral with a chemical composition of HgS. It is the only important ore of mercury. It has a bright red color that has caused people to use it as a pigment and carve it into jewelry and ornaments for thousands of years in many parts of the world. Because cinnabar is the only important ore of mercury, the demand for mercury has driven mining activity. Mercury has many uses, but its toxicity has reduced its use in any application where reasonable substitutes can be found."}, {"url": "http://www.merriam-webster.com/dictionary/cinnabar", "passage_text": "Definition of CINNABAR. 1. : artificial red mercuric sulfide used especially as a pigment. 2. : a red mineral consisting of native mercuric sulfide HgS that is the only important ore of mercury. 3. : a deep vivid red. — cin·na·bar·ine \\-bə-ˌrīn, -ˌbaer-ˌbär\\ in. Adjective see cinnabar defined for. KIDS. advertisement"}, {"url": "https://en.wikipedia.org/wiki/Cinnabar", "passage_text": "Associated modern precautions for use and handling of cinnabar arise from the toxicity of the mercury component, which was recognized as early as ancient Rome. As the most common source of mercury in nature, cinnabar has been mined for centuries, even as far back as the Neolithic Age. During the Roman Empire it was mined both as a pigment, and for its mercury content. To produce liquid mercury (quicksilver), crushed cinnabar ore is roasted in rotary furnaces"}, {"url": "http://www.minerals.net/mineral/cinnabar.aspx", "passage_text": "Cinnabar is the most common mercury mineral and is the chief ore of that metal. It is mined extensively for the production of mercury. Aesthetic crystals of Cinnabar, especially those from China, are very popular among mineral collectors. Cinnabar has been historically used as a vermilion pigment. Cinnabar is occasionally associated with Native Mercury, in the form of small metallic blobs perched on top or within cavities of the Cinnabar. Since Cinnabar is composed from mercury which has various health hazards, it is recommended to wash hands after handling Cinnabar specimens."}]