[{"url": "http://www.answers.com/Q/Is_a_gene_a_small_section_of_dna_or_chromosome", "passage_text": "The resulting bundle is called a chromosome. A Gene is a particular section of the chromosome's DNA string. There are many such sections on the DNA string-thus it contains (also calls 'codes') many genes-in humans between 500 and 4500 depending on what chromosome."}, {"url": "http://www.weegy.com/?ConversationId=932B7873", "passage_text": "Small sections of a DNA molecule that determine genetic traits are called. Gene: A section of a DNA molecule that carries instructions for the formation, functioning, and transmission of specific traits from one generation to another. Expert answered| tumbler10 |Points 60|."}, {"url": "http://education.seattlepi.com/small-parts-dna-code-trait-4457.html", "passage_text": "The genes are relatively short lengths of a chromosome, which is a mixture of DNA and proteins. For the cell to express a particular gene into a particular protein, it must first attach an enzyme complex to an appropriate spot on one of the organism’s chromosomes. That spot is called the promoter region. A nucleotide base -- a ringed molecule containing nitrogen -- hangs off each sugar group, and it’s the sequence of these bases that contains the genetic code for creating proteins. Only 2 percent of a person’s DNA codes for proteins."}, {"url": "http://education.seattlepi.com/small-parts-dna-code-trait-4457.html", "passage_text": "Deoxyribonucleic acid, or DNA, is a long molecule with a backbone consisting of alternating sugar and phosphate groups. A nucleotide base -- a ringed molecule containing nitrogen -- hangs off each sugar group, and it’s the sequence of these bases that contains the genetic code for creating proteins. Only 2 percent of a person’s DNA codes for proteins."}, {"url": "http://www.bbc.co.uk/schools/gcsebitesize/science/add_aqa_pre_2011/celldivision/celldivision1.shtml", "passage_text": "Chromosomes are made from DNA. Genes are short sections of DNA. Genetically identical cells are produced by a type of cell division called mitosis. In sexual reproduction, a male gamete fuses with a female gamete to produce a new cell. This is called fertilisation. Gametes are produced by a type of cell division called meiosis"}, {"url": "http://www.yourgenome.org/facts/what-is-a-gene", "passage_text": "Genes are small sections of DNA within the genome that code for proteins. They contain the instructions for our individual characteristics – like eye and hair colour. 1  A gene is a small section of DNA that contains the instructions for a specific molecule, usually a protein. 2  The purpose of genes is to store information. 1 In humans, alleles of particular genes come in pairs, one on each chromosome (we have 23 pairs of chromosomes). 2  If the alleles of a particular gene are the same, the organism is described as homozygous for that gene. 3  If they are different the organism is described as heter"}, {"url": "http://www.yourgenome.org/facts/what-is-a-gene", "passage_text": "1 A gene is a small section of DNA that contains the instructions for a specific molecule, usually a protein. 2  The purpose of genes is to store information. 3  Each gene contains the information required to build specific proteins needed in an organism. 1 In humans, alleles of particular genes come in pairs, one on each chromosome (we have 23 pairs of chromosomes). 2  If the alleles of a particular gene are the same, the organism is described as homozygous for that gene. 3  If they are different the organism is described as heter"}, {"url": "http://www.nature.com/scitable/definition/chromosome-chromosomes-eukaryotic-chromosome-eucariotic-chromosome-procariotic-6", "passage_text": "A chromosome is a single, long molecule of DNA. These highly organized structures store genetic information in living organisms. Small sections of the chromosome, called genes, code for the RNA and protein molecules required by an organism. In some organisms, like humans, chromosomes are linear, but in other organisms, like bacteria, chromosomes are typically circular."}, {"url": "http://www.answers.com/Q/What_are_small_sections_of_a_DNA_molecule_that_determine_genetic_traits_called", "passage_text": "Bases. There are 4 different bases (in DNA not RNA). They are Thymine, Adenine, Guanine and Cytosine. Thymine joins to Adenine and Guanine joins to Cytosine (connect by hydrogen bonds). Different base sequences = triplet codes and different triplet codes change tertiary structure of proteins and alleles change"}, {"url": "https://en.wikipedia.org/wiki/DNA", "passage_text": "Deoxyribonucleic acid (/diˌɒksiˌraɪbɵ.njuːˌkleɪ.ɨk ˈaesɪd/ ; ˈæSɪD) dna is a molecule that carries most of the genetic instructions used in the, development functioning and reproduction of all known living organisms and many. viruses The two DNA strands are known as polynucleotides since they are composed of simpler units called nucleotides. Each nucleotide is composed of a nitrogen-containing nucleobase —either cytosine (C), guanine (G), adenine (A), or thymine (T)—as well as a monosaccharide sugar called deoxyribose and a phosphate group."}]