[{"url": "http://babynames.allparenting.com/list/Irish_Baby_Names/Shea/details/", "passage_text": "Baby names meanings search results: The name Shea is a baby boy name. The name Shea comes from the Irish origin. In Irish The meaning of the name Shea is: Majestic. We are baseball fans and I was hoping for an Irish name. The Irish part came first, but after we came up with Shea, the fact it is (was) the Mets' park name made sense for us. We figure if she grows up to not like it, she can always go by Lynn."}, {"url": "http://www.thinkbabynames.com/meaning/0/Shea", "passage_text": "Shea is a somewhat popular first name for females (#2270 out of 4276, Top 53%) and an even more popular surname for both adults and children (#990 out of 150436, Top 1%). (2000 U.S. Census). Shown below is the baby name popularity of Shea for girls. Shea /shea/ [1 syll.] as a girls' name (also used as boys' name Shea) is pronounced shay. It is of Gaelic origin, and the meaning of Shea is admirable. Also possibly (Irish, Gaelic) from the fairy fort. Basketball player Shea Ralph"}, {"url": "http://www.meaning-of-names.com/irish-names/shea.asp", "passage_text": "Meaning of Shea. Irish name. In Irish, the name Shea means-fairy place.The name Shea originated as an Irish name. The name Shea is a unisex name and can be used for a boy or girl name (male or female). Irish Name Meaning-fairy place. Origin-Ireland."}, {"url": "http://www.babynamewizard.com/baby-name/boy/shea", "passage_text": "Origin of the name Shea: Borrowed from the Irish, Shay is a pet form of Shamus, the Irish form of James (supplanting, seizing by the heel). It is also bestowed as an independent given name. Var: Shea, Shey. From A World of Baby Names by Teresa Norman. "}, {"url": "https://en.wikipedia.org/wiki/O%27Shea", "passage_text": "O'Shea /oʊˈʃeɪ/ is a surname (an anglicized form of the Irish patronymic name O ó seaghdha SéAGHDHA Or), o ó se Sé originating In The kingdom Of Corcu, duibne in county kerry: 1  And Could'Refer To (alicia-o), Shea petersen. 2  1862 1923'Australian (suffragist) (brian o), Shea politician.  born 1944 irish politician O'Shea /oʊˈʃeɪ/ is a surname (an anglicized form of the Irish patronymic name O ó seaghdha SéAGHDHA Or), o ó se Sé originating In The kingdom Of Corcu, duibne in county kerry: and could refer to"}, {"url": "https://www.houseofnames.com/shea-family-crest", "passage_text": "Shea Early Origins. First found in County Kerry (Irish:Ciarra) part of the former County Desmond (14th-17th centuries), located in Southwestern Ireland, in Munster province, where they held a family seat from ancient times. "}, {"url": "http://irelandroots.com/shea.htm", "passage_text": "Irish Surname-Shea / O'Shea. In modern Irish this surname is usually O'Se sé and the anglicised version Is'O shea Or. Shea the name is derived from The gaelic 'word' seaghdha séaghdha which means hawklike. or stately In modern Irish this surname is usually O'Se sé and the anglicised version Is'O shea Or. shea"}, {"url": "http://findingmyirish.com/shea-family.html", "passage_text": "Shea Family. Few Irish Americans realize that most surnames are not, in fact, surnames in the same sense as English or other European names. Most Irish names are patronymic in origin, taking their form from the name of a common male ancestor. The Shea family name is derived from the O'Shea clan in one of these relatively smaller clans for which the identity of the ancestor is not widely known. The Gaelic equivalent of the Shea family name, or O'Shea, is O'Seaghdha, meaning fine and stately."}]