[{"url": "http://www.cdc.gov/parasites/dientamoeba/", "passage_text": "Dientamoeba fragilis is a parasite that lives in the large intestine of people. This protozoan parasite produces trophozoites; cysts have not been identified. The intestinal infection may be either asymptomatic or symptomatic."}, {"url": "http://www.cdc.gov/parasites/dientamoeba/faqs.html", "passage_text": "Many infected people do not have any symptoms. The most common symptoms are diarrhea and abdominal pain. Symptoms also can include loss of appetite, weight loss, nausea, and fatigue. The infection does not spread from the intestine to other parts of the body."}, {"url": "http://www.clinicaleducation.org/resources/reviews/dientamoeba-fragilis-is-it-really-a-problem/", "passage_text": "Dientamoeba fragilis (D. fragilis)is a trichomonad (a genus of anaerobic protists that are parasites of vertebrates) parasite found in the gastrointestinal tract of humans and implicated as a cause of gastrointestinal disease."}, {"url": "http://www.cdc.gov/parasites/dientamoeba/faqs.html", "passage_text": "Dientamoeba fragilis is a parasite that lives in the large intestine of people. Infection is common worldwide, including in the United States."}, {"url": "http://www.webmd.com/a-to-z-guides/dientamoeba-fragilis-infection", "passage_text": "Dientamoeba fragilis is a parasite that lives in the large intestine of humans. Infection is common worldwide, including in the U.S."}, {"url": "http://www.webmd.com/a-to-z-guides/dientamoeba-fragilis-infection", "passage_text": "Many people infected with dientamoeba fragilis do not have any symptoms. The most common symptoms are diarrhea, stomach pain, and stomach cramping. Loss of appetite and weight, nausea, and fatigue also are common. The infection does not spread from the intestines to other parts of the body."}, {"url": "http://emedicine.medscape.com/article/997239-overview", "passage_text": "Background. Dientamoeba fragilis is a nonflagellate trichomonad parasite and is one of the smaller parasites that can live in the human large intestine. Unlike most other intestinal protozoa, its life cycle has no cyst stage; thus, infection between humans occurs during the trophozoite stage."}]