[{"url": "http://www.dummies.com/how-to/content/important-cell-structures.html", "passage_text": "Glycocalyx: The glycocalyx, an extracellular polymer that surrounds the outside of the cell, is called the capsule when firmly attached; when loosely attached, it’s called a slime layer. The capsule protects bacteria from being phagocytosed (taken up) by immune cells. Here is a list of structures important to prokaryotic cells. Nucleoid: The nucleoid is the region in the cell where the tangled mass of genetic material, called the chromosome, is found. Unlike the nucleus of eukaryotic cells, the nucleoid does not have a membrane."}, {"url": "http://www.definitions.net/definition/glycocalyx", "passage_text": "Glycocalyx. Glycocalyx is a general term referring to extracellular polymeric material produced by some bacteria, epithelia and other cells. For instance, the slime on the outside of a fish is considered to be a glycocalyx. Most animal epithelial cells have a fuzzy coat called the glycocalyx on the external surface of its plasma membrane. This coating consists of several carbohydrate moieties of membrane glycolipids and glycoproteins, which serve as backbone molecules for support."}, {"url": "https://en.wikipedia.org/wiki/Glycocalyx", "passage_text": "Included in the glycocalyx are cell-adhesion molecules that enable cells to adhere to each other and guide the movement of cells during embryonic development. The glycocalyx plays a major role in regulation of endothelial vascular tissue, including the modulation of red blood cell volume in capillaries. The glycocalyx exists in bacteria as either a capsule or a slime layer. 6 points at the glycocalyx. The difference between a capsule and a slime layer is that in a capsule polysaccharides are firmly attached to the cell wall, while in a slime layer the glycoproteins are loosely attached to the cell wall."}, {"url": "http://www.encyclopedia.com/topic/Glycocalyx.aspx", "passage_text": "Glycocalyx. The glycocalyx is a carbohydrate-enriched coating that covers the outside of many eukaryotic cells and prokaryotic cells, particularly bacteria. When on eukaryotic cells the glycocalyx can be a factor used for the recognition of the cell. On bacterial cells, the glycocalyx provides a protective coat from host factors. The second function of a bacterial glycocalyx is to promote the adhesion of the bacteria to living and inert surfaces and the subsequent formation of adherent, glycocalyx-enclosed populations that are called biofilms."}, {"url": "http://www.microbiologytext.com/index.php?module=Book&func=displayarticle&art_id=67", "passage_text": "1 The outer surface of cells is often covered in a polysaccharide or protein material called glycocalyx. 2  Glycocalyx can be formed from protein, polysaccharides, polyalcohols or amino sugars. 3  Glycocalyx can function in attachment, protection from desiccation, and protection from attack by a hosts immune system. The general term for any network of polysaccharide or protein containing material extending outside of the cell is the glycocalyx. Many bacteria produce such a coating on the outside of their cell, and they come in two types: capsules and slime layers. The difference between the two is somewhat arbitrary."}, {"url": "https://en.wikipedia.org/wiki/Glycocalyx", "passage_text": "TEM micrograph of a B. subtilis bacterium, with the hair-like glycocalyx visible surrounding the cell membrane (scale bar = 200 nm). The glycocalyx is a glycoprotein-polysaccharide covering that surrounds the cell membranes of some bacteria, epithelia and other cells. Most animal epithelial cells have a fuzz-like coat on the external surface of their plasma membranes. The glycocalyx exists in bacteria as either a capsule or a slime layer. 6 points at the glycocalyx. The difference between a capsule and a slime layer is that in a capsule polysaccharides are firmly attached to the cell wall, while in a slime layer the glycoproteins are loosely attached to the cell wall."}, {"url": "http://www.encyclopedia.com/topic/Glycocalyx.aspx", "passage_text": "The glycocalyx is a carbohydrate-enriched coating that covers the outside of many eukaryotic cells and prokaryotic cells, particularly bacteria. The second function of a bacterial glycocalyx is to promote the adhesion of the bacteria to living and inert surfaces and the subsequent formation of adherent, glycocalyx-enclosed populations that are called biofilms."}, {"url": "http://www.encyclopedia.com/topic/Glycocalyx.aspx", "passage_text": "The glycocalyx of bacteria can assume several forms. If in a condensed form that is relatively tightly associated with the underlying cell wall, the glycocalyx is referred to as a capsule. A more loosely attached glycocalyx that can be removed from the cell more easily is referred to as a slime layer. The second function of a bacterial glycocalyx is to promote the adhesion of the bacteria to living and inert surfaces and the subsequent formation of adherent, glycocalyx-enclosed populations that are called biofilms."}]