[{"url": "http://www.webmd.boots.com/digestive-disorders/hernia-types", "passage_text": "For inguinal, femoral, umbilical, and incisional hernias, symptoms could include: 1  An obvious swelling beneath the skin of the abdomen or the groin; it may disappear when you lie down, and may be tender. 2  A heavy feeling in the abdomen that is sometimes accompanied by constipation or blood in the stool."}, {"url": "http://www.webmd.boots.com/digestive-disorders/hernia-types", "passage_text": "Hernia types. There are several different types of hernia : Inguinal hernia is the most common. This occurs when part of your bowel squeezes through your lower abdomen into the groin. Hiatus hernia is when part of your stomach pushes up into the chest through an opening in the diaphragm."}, {"url": "http://www.emedicinehealth.com/hernia/article_em.htm", "passage_text": "Different types of abdominal wall hernias include the following: 1  Inguinal (groin) hernia: Making up 75% of all abdominal wall hernias and occurring up to 25 times more often in men than women, these hernias are divided into two different types, direct and indirect."}, {"url": "http://www.webmd.com/digestive-disorders/understanding-hernia-basics", "passage_text": "A hernia occurs when an organ or fatty tissue squeezes through a weak spot in a surrounding muscle or connective tissue called fascia. The most common types of hernia are inguinal (inner groin), incisional (resulting from an incision), femoral (outer groin), umbilical (belly button), and hiatal (upper stomach). In an inguinal hernia, the intestine or the bladder protrudes through the abdominal wall or into the inguinal canal in the groin."}, {"url": "http://msa-herniacenter.com/hernia-types", "passage_text": "Types of Hernias. An abdominal wall hernia is a weakness or tear in the abdominal muscles that allows fatty tissue or an organ (such as the intestines) to protrude through the weak area. Although more common in men a hernia can develop in anyone-from a newborn baby to older adults."}, {"url": "http://www.webmd.com/digestive-disorders/tc/common-types-of-hernias-topic-overview", "passage_text": "A hernia is a bulge caused by tissue pushing through the wall of muscle that's holding it in. Most hernias are abdominal hernias. This means they happen in the belly and groin areas. You may have a hernia if you can feel a soft lump in your belly or groin or in a scar where you had surgery in the past."}, {"url": "http://www.medicinenet.com/hernia_overview/article.htm", "passage_text": "Hiatal hernias occur when part of the stomach slides through the opening in the diaphragm where the esophagus passes from the chest into the abdomen. A sliding hiatal hernia is the most common type and occurs when the lower esophagus and portions of the stomach slide through the diaphragm into the chest."}]