[{"url": "http://virtualweberbullet.com/brisket4.html", "passage_text": "1 Apply your favorite rub and refrigerate overnight. 2  Cook the brisket fat-side down at 325-375°F for 2 to 2-1/2 hours to an internal temperature of 170°F. 3  Wrap in foil fat-side up and cook another 2 to 2-1/2 hours until fork tender. This should keep the meat at a food-safe temperature of 140°F or higher for 2-3 hours. When ready to serve, position the brisket fat-side up (Photo 11) and separate the point section from the flat section along the fat seam. In Photo 12, the point is on the left, the flat is on the right."}, {"url": "http://www.bhg.com/recipes/how-to/cooking-basics/how-to-cook-brisket/", "passage_text": "Bake the Brisket. 1  Place a fat-trimmed 3- to 3-1/2-pound fresh beef brisket in a 13x9x2-inch baking pan. 2  Cover the pan with foil. 3  Bake in a 325 degrees F oven about 3 hours or until tender, turning once halfway through cooking time. Bake the Brisket. 1  Place a fat-trimmed 3- to 3-1/2-pound fresh beef brisket in a 13x9x2-inch baking pan. 2  Pour the cooking liquid over the meat. 3  Cover the pan with foil. 4  Bake in a 325 degrees F oven about 3 hours or until tender, turning once halfway through cooking time."}, {"url": "http://virtualweberbullet.com/brisket4.html", "passage_text": "1 Cook the brisket fat-side down at 325-375°F for 2 to 2-1/2 hours to an internal temperature of 170°F. 2  Wrap in foil fat-side up and cook another 2 to 2-1/2 hours until fork tender. 3  Rest in foil for 30 minutes before slicing. This should keep the meat at a food-safe temperature of 140°F or higher for 2-3 hours. When ready to serve, position the brisket fat-side up (Photo 11) and separate the point section from the flat section along the fat seam. In Photo 12, the point is on the left, the flat is on the right."}, {"url": "http://www.wikihow.com/Cook-a-Brisket-in-the-Oven", "passage_text": "1 Check the internal temperature of the brisket with a meat thermometer. 2  The temperature should be between 190 and 200 degrees Fahrenheit (88 to 93 degrees Celsius) when safe and tender enough to eat, and the meat should be easy to pull apart. The beef brisket should be roasted for roughly 1 hour per l lb (450 g) of meat. In this case, the brisket should cook for 3 to 4 hours. 1  Do not unwrap the brisket during the cooking process unless you are checking for doneness."}, {"url": "http://whatscookingamerica.net/Beef/Smoked-Brisket.htm", "passage_text": "Finish cooking the brisket: Turn up the temperature of the smoker grill to 180 degrees F. Pour 1 1/2 to 2 cups of apple cider or apple juice into the roasting pan until entire bottom of roasting pan is covered with the liquid. Insert the meat thermometer probe into the center of the brisket. Brisket is the meat of choice for barbecuing in the great state of Texas. In fact, it is considered the National Dish of Texas.. Brisket are a very tough piece of meat and difficult to eat unless it is cooked at a very low and slow temperature."}, {"url": "http://www.thesmokerking.com/page1a.html", "passage_text": "If you are cooking the brisket at a temperature between 225 and 250 degrees, pull it off the pit and put it in a cooler for 2 hours when the internal temp is 185. If you are cooking hot and fast (around 325 degrees F), which isn't discussed here, pull the brisket off the pit at 200 and put it in a cooler for 2 hours. Checking the Temperature While Smoking. To achieve the best results, I cook the beef brisket at 225 degrees for about 1 hour and 15 minutes per pound. The time per pound is strictly a guide and cooking times wil actually vary."}, {"url": "http://www.bhg.com/recipes/how-to/cooking-basics/how-to-cook-brisket/", "passage_text": "1 Place a fat-trimmed 3- to 3-1/2-pound fresh beef brisket in a 13x9x2-inch baking pan. 2  Pour the cooking liquid over the meat. 3  Cover the pan with foil. 4  Bake in a 325 degrees F oven about 3 hours or until tender, turning once halfway through cooking time. Bake the Brisket. 1  Place a fat-trimmed 3- to 3-1/2-pound fresh beef brisket in a 13x9x2-inch baking pan. 2  Pour the cooking liquid over the meat. 3  Cover the pan with foil. 4  Bake in a 325 degrees F oven about 3 hours or until tender, turning once halfway through cooking time."}, {"url": "http://whatscookingamerica.net/Beef/Smoked-Brisket.htm", "passage_text": "Smoking the Brisket: Preheat Smoker Grill to 170 degrees F. Cooking at a low temperature will make the wood smoke more. Place the brisket (in roasting pan) in the pre-heated smoker and close the smoker lid. Smoke the brisket for 1 hour for every pound of meat or smoke overnight. Brisket is the meat of choice for barbecuing in the great state of Texas. In fact, it is considered the National Dish of Texas.. Brisket are a very tough piece of meat and difficult to eat unless it is cooked at a very low and slow temperature."}, {"url": "http://www.foodnetwork.com/recipes/oklahoma-joes-smoked-brisket-flat-recipe.html", "passage_text": "Return the brisket to the grill (or smoker) The brisket is finished cooking when it is very tender and reaches an internal temperature of 190 degrees F, about another 1 to 2 hours. Let rest for 45 minutes, then unwrap and slice. Serve with BBQ sauce on the side. "}]