[{"url": "http://www.weegy.com/?ConversationId=4K2J2SOE", "passage_text": "User: What happened within a year of United States Navy Commodore Matthew Perry s arrival in Tokyo Bay in 1853? Japan and the United States fought for control of trade. The United States annexed the island of Hawaii. Perry negotiated a treaty that opened trade to the United States. Japan became a U.S. territory in Asia. Within a year of his arrival in Tokyo Bay in 1853: United States Navy Commodore Matthew Perry negotiated a treaty that opened trade to the United States.hat happened within a year of United States Navy Commodore Matthew Perry s arrival in Tokyo Bay in 1853? Japan and the United States fought for control of trade. The United States annexed the."}, {"url": "http://afe.easia.columbia.edu/special/japan_1750_perry.htm", "passage_text": "On July 8, 1853, Commodore Matthew Perry of the United States Navy, commanding a squadron of two steamers and two sailing vessels, sailed into Tokyo tôkyô harbor aboard the Frigate. susquehannalthough all three letters are addressed to the emperor, it was the shogun, shôgun the ruler Of, japan who received the. Letters Millard, fillmore-1800; 1874 Matthew, perry-1794  1858 letters From.U. S President Millard fillmore And.U. S Navy Commodore Matthew. C perry to The emperor Of (japan-1852). 1853"}, {"url": "https://en.wikipedia.org/wiki/Perry_Expedition", "passage_text": "The Perry Expedition was a diplomatic expedition to Bakumatsu period Japan, involving two separate trips, by warships of the United States Navy, which took place during 1853–54.he expedition was commanded by Commodore Matthew Calbraith Perry, under orders from American President Millard Fillmore. Perry’s primary goal was to force an end to Japan’s 220-year-old policy of isolation and to open Japanese ports to American trade, through the use of gunboat diplomacy if necessary."}, {"url": "http://www.baxleystamps.com/litho/perry_8vol.shtml", "passage_text": "The year 2003 will mark the 150th anniversary of United States Navy Commodore Matthew Perry's first visit to Japan in July 1853, having been instructed by his government to 'open up' Japan by putting in place a treaty of 'peace and amity' with the Japanese 'mikado' for the benefit of western trade and commerce."}, {"url": "https://quizlet.com/5680124/us-history-chapter-18-flash-cards/", "passage_text": "why did United states navy commodore george dewey lead and attack on ships in the manila bay during the spanish-american war. manila bay was ruled by spain and the ships belonged to the spanish."}, {"url": "https://en.wikipedia.org/wiki/Perry_Expedition", "passage_text": "1 Hawks, Francis. (1856). 2  Narrative of the Expedition of an American Squadron to the China Seas and Japan Performed in the Years 1852, 1853 and 1854 under the Command of Commodore M.C. 3  Perry, United States Navy, Washington: A.O.P.he expedition was commanded by Commodore Matthew Calbraith Perry, under orders from American President Millard Fillmore. Perry’s primary goal was to force an end to Japan’s 220-year-old policy of isolation and to open Japanese ports to American trade, through the use of gunboat diplomacy if necessary."}, {"url": "https://en.wikipedia.org/wiki/Matthew_C._Perry", "passage_text": "Matthew Calbraith Perry (April 10, 1794 – March 4, 1858) was a Commodore of the United States Navy and commanded a number of ships. Matthew C. Perry Elementary and High School can be found on Marine Corps Air Station, Iwakuni, Japan. 2  The U.S. Navy's Perry-class frigates (purchased in the 1970s and 1980s) were named after Perry's brother, Commodore Oliver Hazard Perry."}, {"url": "https://en.wikipedia.org/wiki/Perry_Expedition", "passage_text": "1 Narrative of the Expedition of an American Squadron to the China Seas and Japan Performed in the Years 1852, 1853 and 1854 under the Command of Commodore M.C. 2  Perry, United States Navy, Washington: A.O.P.he expedition was commanded by Commodore Matthew Calbraith Perry, under orders from American President Millard Fillmore. Perry’s primary goal was to force an end to Japan’s 220-year-old policy of isolation and to open Japanese ports to American trade, through the use of gunboat diplomacy if necessary."}, {"url": "http://afe.easia.columbia.edu/special/japan_1750_perry.htm", "passage_text": "Perry, on behalf of the U.S. government, forced Japan to enter into trade with the United States and demanded a treaty permitting trade and the opening of Japanese ports to U.S. merchant ships.lthough all three letters are addressed to the emperor, it was the shogun, shôgun the ruler Of, japan who received the. Letters Millard, fillmore-1800; 1874 Matthew, perry-1794  1858 letters From.U. S President Millard fillmore And.U. S Navy Commodore Matthew. C perry to The emperor Of (japan-1852). 1853"}, {"url": "http://www.answers.com/Q/What_happened_within_a_year_of_us_navy_commodore_matthew_perry_arrival_in_tokyo_bay_in_1853", "passage_text": "Commodore Matthew C. Perry was the Commodore of the U.S. Navy who compelled the opening of Japan to world trade in 1854, by forcing on the Japanese shogunate the treaty of Kan … agawa.13 people found this useful. Deb Answers.ecause of Perry's threats and show of force, Japan was pressured  to allow trade with the United States through the establishment of  a treaty called the Convention of Kana … gawa."}]