[{"url": "http://www.lawny.org/index.php/benefits-self-help-135/food-stamps-self-help-45/42-can-i-get-food-stamps", "passage_text": "If you are only applying for food stamps and not other help, you can fill out the shorter, food stamp only application. The food stamp only application is 6 pages long. The first 3 pages ask questions like who you are, who lives with you, what income and resources your household has, and what your living expenses are. Again, to see if you can get food stamps, you will need to file an application with your local DSS/HRA. If you live in Wayne County, and: 1. Would like to see if you may qualify for the Food Stamp Program, or. 2"}, {"url": "http://www.lawny.org/index.php/benefits-self-help-135/food-stamps-self-help-45/42-can-i-get-food-stamps", "passage_text": "In general, your household must meet income, and in some cases, resource guidelines in order to get food stamps. To receive food stamp benefits, you will have to apply for benefits. You can get an application at your local Department of Social Services (DSS). In New York City, you can apply for food stamps by visiting your local Human Resources Administration (HRA) office. Again, to see if you can get food stamps, you will need to file an application with your local DSS/HRA. If you live in Wayne County, and: 1. Would like to see if you may qualify for the Food Stamp Program, or. 2"}, {"url": "http://www.fns.usda.gov/snap/how-much-could-i-receive", "passage_text": "The net monthly income of the household is multiplied by .3, and the result is subtracted from the maximum allotment for the household size to find the household's allotment. This is because SNAP households are expected to spend about 30 percent of their resources on food. (October 1, 2015 through September 30, 2016). "}, {"url": "http://www.ehow.com/how_5954669_calculate-much-receive-food-stamps.html", "passage_text": "Shares & Saves. Save. To calculate how much you will receive in monthly SNAP benefits -- formerly called food stamps -- you will need to know the maximum amount of benefits allowable for your household size, the net monthly income of your household and how to apply the math. Maximum Monthly Allotments. What the food stamp program calls allotments are maximum monthly benefit amounts based on household size. For fiscal year 2015, in the 48 contiguous states and D.C., the maximum monthly allotments based on the number of household members are: 1  One person -- $194. 2  Two people -- $357. 3  Three people -- $511"}, {"url": "http://www.elcajoncollaborative.org/uploads/1/4/1/5/1415935/myths-working.pdf", "passage_text": "MYTH: You can’t get food stamps if you get unemployment.FACT: People who get unemployment may still qualify for food stamp benefits. MYTH: If you have too many assets, you can’t get food stamps. FACT: Your household may have up to $2000 in assets. But some assets like your home and car do not count. Getting food stamp benefits also depends on your household size, income and some expenses, like child support and housing and childcare costs."}, {"url": "http://www.fns.usda.gov/snap/eligibility", "passage_text": "Eligibility. To see if you might be eligible for Supplemental Nutrition Assistance Program (SNAP) benefits, visit our pre-screening tool. For households in the 48 Contiguous States and the District of Columbia October 1, 2015 through September 30, 2016. "}, {"url": "http://www.slate.com/blogs/moneybox/2014/08/05/how_much_walmart_gets_in_food_stamp_dollars_the_answer_may_be_forthcoming.html", "passage_text": "Last year we spent $76 billion in taxpayer money on food stamps, officially known as the Supplemental Nutrition Assistance Program, or SNAP. That money goes to about 47 million low-income Americans, who use it to buy food at more than 250,000 retail stores across the country. "}, {"url": "http://www.elcajoncollaborative.org/uploads/1/4/1/5/1415935/myths-working.pdf", "passage_text": "If you get food stamp benefits because of wrong information, then you have to pay them back. MYTH: Food stamps are not worth applying for since you only get $10. FACT: The amount of food stamp benefits depends on household size, income and certain expenses. A mother with two children who works full time at $7 per hour and pays $350 in rent could receive $180 in food stamps benefits per month. MYTH: If you have too many assets, you can’t get food stamps. FACT: Your household may have up to $2000 in assets. But some assets like your home and car do not count. Getting food stamp benefits also depends on your household size, income and some expenses, like child support and housing and childcare costs."}]