[{"url": "http://cshpsurgerycenter.net/", "passage_text": "Welcome to the CSHP Surgery Center! In August of 2010, after additional procedure space and remodeling was complete, this facility re-opened as the Colorado Springs Health Partners Ambulatory Surgery Center (CSHP ASC)."}, {"url": "http://www.cshp.ca/cshp2015/about/faq/index_e.asp", "passage_text": "Check out the CSHP 2015 Tool Kits which will facilitate and support efforts to implement or achieve Objectives 1.3, 3.1 and 4.7. There are several CSHP 2015 related posters which have been presented at CSHP conferences, showing you how others have achieved a CSHP 2015 objective. Visit the success stories web page today! You can also join the CSHP 2015 e-Forum to ask questions and share your results. Visit the CSHP 2015 blog (link coming soon!), CSHP 2015 twitter page (#cshp2015) and the CSHP Facebook page to share your success stories!"}, {"url": "http://www.cshp.ca/cshp2015/about/faq/index_e.asp", "passage_text": "The CSHP 2015 initiative is guided by the CSHP 2015 Steering Committee. There are also CSHP 2015 BRANCH CHAMPIONS. They promote, facilitate and coordinate CSHP 2015 activities and programs within your CSHP branch. Feel free to contact your CSHP 2015 Branch Champion (link coming soon). Visit the success stories web page today! You can also join the CSHP 2015 e-Forum to ask questions and share your results. Visit the CSHP 2015 blog (link coming soon!), CSHP 2015 twitter page (#cshp2015) and the CSHP Facebook page to share your success stories!"}, {"url": "https://www.facebook.com/yourCSHP", "passage_text": "CSHP has received a 2014 PATH Excellence in Patient Service Award! UnitedHealthcare presented us with this award based on clinical results that measure how well we deliver preventive care services to our Medicare Advantage patients. Thanks to our wonderful patients, and congrats to our team!"}, {"url": "http://www.cshpnetwork.com/page.asp?tid=72&name=About", "passage_text": "CSHP established it's network of providers by creating contractual arrangements with both primary care physicians (family medicine physicians; internal medicine physicians; and general internal medicine physicians) and specialists that meet the quality criteria and guidelines established by the organization. Employer groups have the ability to inform their broker, if applicable, that they would like a health care plan provided to their employees that includes the CSHP network of providers. The broker will then work with payors and carriers that will develop an insurance product around our comprehensive network."}, {"url": "http://www.cshp.ca/cshp2015/about/faq/index_e.asp", "passage_text": "Visit the CSHP 2015 What's Happening page to learn about current activities or campaigns. Visiting the CSHP 2015 monthly updates and the CSHP 2015 Resources section of the website will provide you with the most up-to-date information on current and future CSHP 2015 activities, tools and resources. Visit the success stories web page today! You can also join the CSHP 2015 e-Forum to ask questions and share your results. Visit the CSHP 2015 blog (link coming soon!), CSHP 2015 twitter page (#cshp2015) and the CSHP Facebook page to share your success stories!"}, {"url": "http://www.cshpnetwork.com/page.asp?tid=72&name=About", "passage_text": "CSHP has the privilege to be one of eight regional PPO's in Pennsylvania that make up Pennsylvania's Preferred Health Networks, PPHN. This allows CSHP to provide employer groups access to other comprehensive networks of providers throughout over 35 additional counties in Pennsylvania. Employer groups have the ability to inform their broker, if applicable, that they would like a health care plan provided to their employees that includes the CSHP network of providers. The broker will then work with payors and carriers that will develop an insurance product around our comprehensive network."}, {"url": "http://www.cshp.ca/cshp2015/about/faq/index_e.asp", "passage_text": "The CSHP 2015 Crosswalk provides evidence from the literature for the 36 objectives. It also identifies both national and international pharmacy initiatives which are similar and/or support the specific objective. Visit the success stories web page today! You can also join the CSHP 2015 e-Forum to ask questions and share your results. Visit the CSHP 2015 blog (link coming soon!), CSHP 2015 twitter page (#cshp2015) and the CSHP Facebook page to share your success stories!"}, {"url": "http://www.cshpnetwork.com/page.asp?tid=72&name=About", "passage_text": "Central Susquehanna Healthcare Providers (CSHP) is a Preferred Provider Organization (PPO) owned by Evangelical Community Hospital in Lewisburg, Pennsylvania. Employer groups have the ability to inform their broker, if applicable, that they would like a health care plan provided to their employees that includes the CSHP network of providers. The broker will then work with payors and carriers that will develop an insurance product around our comprehensive network."}]