[{"url": "http://www.bodybuilding.com/fun/issa23.htm", "passage_text": "Many ketogenic diet and MCT oil spokespeople say that MCT's energy sustaining powers can be explained as follows: when MCT oil is metabolized in the body, it behaves more like a carbohydrate than a fat. Remember that the fuel of preference for the body is carbohydrate."}, {"url": "http://www.vitacost.com/vitacost-mct-oil-from-coconut-oil-medium-chain-triglycerides-16-fl-oz-2", "passage_text": "Vitacost MCT (Medium Chain Triglycerides) is a versatile, natural oil that can be used for cooking, in salad dressings or in place of butter. Medium chain triglycerides (MCTs) are easily digested fatty acids found in coconut oil, palm oil and milk fat."}, {"url": "http://healthimpactnews.com/2014/mct-oil-vs-coconut-oil-the-truth-exposed/", "passage_text": "MCT oil, on the other hand, is not an oil found in nature, but is manufactured by machine to separate out the medium chain fatty acids from the rest of the oil. The fatty acids are extracted through an industrial process of “fractionation”."}, {"url": "http://mentalhealthdaily.com/2015/04/15/what-is-mct-oil-medium-chain-triglycerides/", "passage_text": "MCT oil is not naturally occurring, rather it is extracted from various sources (most commonly coconut and palm kernel oils) to be sold as a dietary supplement. This extraction process (called “fractionation”) involves separating specific medium-chain fatty acids from the rest of the oil."}, {"url": "http://mentalhealthdaily.com/2015/04/15/what-is-mct-oil-medium-chain-triglycerides/", "passage_text": "MCT oil supplements are man-made fats in that they are extracted from a source. Coconut oil and palm kernel oil are most commonly used for extraction simply due to the fact that they are the most cost-effective way of obtaining MCTs."}, {"url": "http://mentalhealthdaily.com/2015/04/15/what-is-mct-oil-medium-chain-triglycerides/", "passage_text": "(Medium Chain Triglycerides). MCT Oil is an oil that is comprised of medium-chain triglycerides (MCTs). These medium-chain fatty acids have a aliphatic tail ranging from 6 to 12 carbon atoms. Any chains of fatty acids with 6 or less carbon atoms are referred to as short-chain fatty acids (SCFAs)."}, {"url": "http://www.ehow.com/facts_5664953_mct-oil-used-for_.html", "passage_text": "How Mct Oil Works. Mct oil does not travel through the lymphatic system like other oils; it goes directly to the liver to be metabolized and released as energy. Mct oil acts like a carbohydrate (fuel for the body) to provide the necessary energy and calories, but not fat that can be stored by the body."}, {"url": "http://www.bodybuilding.com/fun/issa23.htm", "passage_text": "MCT simply stands for medium chain triglycerides, as opposed to long chain triglycerides (LCT), which are found in most foods. MCT is comprised of primarily caprylic and capric fatty acids, and is a light-yellow, odorless, translucent liquid at room temperature. MCT oil occurs naturally in coconut oil and other foods. Supplementation with MCT oil began as a fat source to help treat diseases such as cystic fibrosis, obesity, and fat malabsorption. It has also been used to add calories to infant, and certain other formulas."}]