[{"url": "http://www.cartalk.com/sites/default/files/features/detailing/images/tips.pdf", "passage_text": "Rinse your vehicle thoroughly. When you think you're done rinsing—that’s whenyou give it a final rinse!7. Use a different mitt to clean the tires and rims. Using a separate mitt for thewheels will reduce the chance that you’ll scratch the car’s paint with brake dustand dirt you pick up from the rims.8. Be very cautious when cleaning wheels, especially if you’re using a spray-onwheel cleaner. Your vehicle’s surface should be cool. If thecar’s hot, the soap suds will dry too quickly, staining the surface and requiringanother wash.2. Pre-soak your vehicle to remove heavy contaminants like boulders and squirrelremains.3. Use mild liquid soap and a car-wash mitt or sponge-- and don't skimp on thewater.4."}, {"url": "http://secondchancegarage.com/public/how-to-clean-a-paint-gun.cfm", "passage_text": "At that point, instead of cleaning it thoroughly, I set it aside and used a different gun. For this article I brought it out and decided to clean it, but the cleaning method was different than that of the other gun shown in a previous picture. Paint stripper comes in spray can form and liquid or gel that you brush on. I used both spray and liquid to clean this disaster. After all my years of painting, there is no excuse for it, other than occasional laziness. I know cleaning your paint gun is a necessary evil, and there are a few different methods for cleaning it. The first thing to remember is to clean it right away after each use."}, {"url": "http://store.carcareonline.com/washyourvehicle.aspx", "passage_text": "If your wheels are relatively dirty and you need to use a wheel cleaner, then clean the wheels before you wash the rest of the car, otherwise wash the wheels last. WHEELS: Most wheel cleaners work best on a dry wheel. You may use a wash mitt, wash pad, sponge or brush to wash your car. (A wash mitt is designed to be worn on or held in your hand and a wash pad is a soft material covering sewn over a sponge that you hold in your hand)."}, {"url": "http://www.wikihow.com/Get-Spray-Paint-off-a-Car", "passage_text": "1 For particularly thick spots of spray paint, try scraping the excess off with a sharp plastic edge (i.e. - Plastic ice scraper, plastic type Spackle tool, plastic spatula, etc.). 2  Do not try to scrape all the spray paint off—avoid making contact with your car’s finish. 3  Crisco! 4  It is the easiest method. 1 After you wipe the paint, check the rag to see if you can detect any paint residue. 2  While you’re at it, make sure the residue isn't the color of your car’s paint. 3  If your car windows also got tagged with spray paint, acetone and a razor blade should clear it up easily."}, {"url": "http://secondchancegarage.com/public/how-to-clean-a-paint-gun.cfm", "passage_text": "The cleaner, known as gun wash, is sprayed through the jets, much like water in a dishwasher. You can place the individual pieces of the gun directly on the jets for a faster cleaning. If you have access to a paint gun cleaning cabinet, this is the easiest method. You simply take the gun apart, place the pieces into the cabinet, and the jets spray cleaner at the parts until they are clean. It's kind of like a dishwasher for paint guns, but instead of spraying water, it sprays gun wash. After all my years of painting, there is no excuse for it, other than occasional laziness. I know cleaning your paint gun is a necessary evil, and there are a few different methods for cleaning it. The first thing to remember is to clean it right away after each use."}, {"url": "http://www.wikihow.com/Get-Spray-Paint-off-a-Car", "passage_text": "1. If paint spatter don't come off with soap and water, but can be scratched off with a fingernail, try spraying brake cleaner on a clean piece of cotton rag and another to wipe cleaner off car. Rub 'cleaner' rag over small sections at a time until removed. Wipe off cleaner. 1 After you wipe the paint, check the rag to see if you can detect any paint residue. 2  While you’re at it, make sure the residue isn't the color of your car’s paint. 3  If your car windows also got tagged with spray paint, acetone and a razor blade should clear it up easily."}]