[{"url": "http://evolution.berkeley.edu/evolibrary/article/evo_17", "passage_text": "1 Mutations are changes in the DNA. 2  A single mutation can have a large effect, but in many cases, evolutionary change is based on the accumulation of many mutations. 3  Gene flow is any movement of genes from one population to another and is an important source of genetic variation. Without genetic variation, some of the basic mechanisms of evolutionary change cannot operate. There are three primary sources of genetic variation, which we will learn more about: 1 "}, {"url": "http://evolution.berkeley.edu/evolibrary/article/evo_17", "passage_text": "1 A single mutation can have a large effect, but in many cases, evolutionary change is based on the accumulation of many mutations. 2  Gene flow is any movement of genes from one population to another and is an important source of genetic variation. 3  Sex can introduce new gene combinations into a population. Without genetic variation, some of the basic mechanisms of evolutionary change cannot operate. There are three primary sources of genetic variation, which we will learn more about: 1  Mutations are changes in the DNA."}, {"url": "https://en.wikipedia.org/wiki/Genetic_variation", "passage_text": "Genetic variation is a fact that a biological system – individual and population – is different over space. It is the base of the genetic variability of different biological systems in space. Genetic variation is based on the variation in alleles of genes in a gene pool. It occurs both within and among populations, supported by individual carriers of the variant genes. Genetic variation is brought about by random mutation, which is a permanent change in the chemical structure of a gene. Mutations are likely to be rare and most mutations are neutral or deleterious, but in some instances the new alleles can be favored by natural selection. Polyploidy is an example of chromosomal mutation. Polyploidy is a condition wherein organisms have three or more sets of genetic variation (3n or more)."}, {"url": "http://www.ghr.nlm.nih.gov/glossary=geneticvariation", "passage_text": "Genetic variation refers to diversity in gene frequencies. Genetic variation can refer to differences between individuals or to differences between populations. Mutation is the ultimate source of genetic variation, but mechanisms such as sexual reproduction and genetic drift contribute to it as well. "}, {"url": "http://www.answers.com/Q/How_do_mutations_lead_to_genetic_variation", "passage_text": "Mutations create changes in the genetic code. There are different types of mutations and vary in degree of harm or even benefit to the organism. If the mutation happens to be … beneficial to the organism, then it can be passed down to its offspring and thus this leads to genetic variation in the population. Mutations lead to genetic variation by producing random changes in an organism's"}, {"url": "http://evolution.berkeley.edu/evolibrary/article/evo_17", "passage_text": "Genetic variation. Without genetic variation, some of the basic mechanisms of evolutionary change cannot operate. There are three primary sources of genetic variation, which we will learn more about: 1  Mutations are changes in the DNA. 2  Gene flow is any movement of genes from one population to another and is an important source of genetic variation. 3  Sex can introduce new gene combinations into a popul"}, {"url": "https://en.wikipedia.org/wiki/Genetic_mutation", "passage_text": "Mutation can result in several different types of change in sequences. Mutations in genes can either have no effect, alter the product of a gene, or prevent the gene from functioning properly or completely. Mutations can also occur in nongenic regions. 1 A neutral mutation has no harmful or beneficial effect on the organism. 2  Such mutations occur at a steady rate, forming the basis for the molecular clock. 3  In the neutral theory of molecular evolution, neutral mutations provide genetic drift as the basis for most variation at the molecular level."}, {"url": "http://study.com/academy/lesson/genetic-variability-and-random-mutation.html", "passage_text": "Random mutations are a critical component of evolution because mutations create genetic variation within a population. If a mutation is harmful, it will likely be weeded out very quickly, because any change in the population that makes an organism less 'fit' will ultimately lead to its demise. Sometimes though, variations occur within a population because of random mutations, which are changes in the nucleotide sequence of DNA. Your DNA is like a set of instructions, and a mutation occurs when those instructions are changed."}, {"url": "http://ghr.nlm.nih.gov/handbook/mutationsanddisorders/genemutation", "passage_text": "A gene mutation is a permanent alteration in the DNA sequence that makes up a gene, such that the sequence differs from what is found in most people. Mutations range in size; they can affect anywhere from a single DNA building block (base pair) to a large segment of a chromosome that includes multiple genes. "}, {"url": "http://biomed.brown.edu/Courses/BIO48/4.Mutants.Link&Recomb.HTML", "passage_text": "148-150.). Mutation is an ongoing process. There are measurable mutation rates and that there can be a genetic variation for mutation rates; mutator strains of bacteria exist. Mutations in the replication or repair machinery of DNA can alter mutation rates. "}]