[{"url": "http://www.fragrantica.com/news/Guava-3317.html", "passage_text": "It is believed that Guava is native to southern Mexico or Central and tropical America. It is cultivated and distributed throughout all tropical regions in America and in the West Indies, Bermuda and southern Florida. It was adopted as a crop in Asia and in warm parts of Africa. "}, {"url": "http://www.answers.com/Q/What_does_a_guava_fruit_taste_like", "passage_text": "Guava paste taste like guava but much sweeter. It has the looks like carmel. And also as the consistency of soft carmel. It is very good if you like guava but, if you don't … like foods that are very sweet this one isn't for you. "}, {"url": "http://homeguides.sfgate.com/tell-guava-ripe-39151.html", "passage_text": "1 Place green guavas in a paper bag with a banana or apple for faster ripening. 2  A large crop of guavas can be kept for two to four weeks in a cool, moist environment -- temperature from 46 to 50 degrees Fahrenheit and humidity from 80 to 95 percent -- if picked when mature but still green. 1 Ripe guavas can be stored in the refrigerator for two days. 2  Guavas purchased or picked when green and hard continue to ripen when kept at room temperature. 3 "}, {"url": "https://en.wikipedia.org/wiki/Guava", "passage_text": "Guava leaves contain both carotenoids and polyphenols like (+)-gallocatechin and leucocyanidin. As some of these phytochemicals produce the fruit skin and flesh color, guavas that are red-orange tend to have more polyphenol and carotenoid content than yellow-green ones. In many countries, guava is eaten raw, typically cut into quarters or eaten like an apple, whereas in other countries it is eaten with a pinch of salt and pepper, cayenne powder or a mix of spices (masala) . It is known as the winter national fruit of Pakistan."}, {"url": "http://homeguides.sfgate.com/tell-guava-ripe-39151.html", "passage_text": "Smell the fruit. According to the California Rare Fruit Growers, the aroma of the guava changes when it is ripe becoming musky, sweet and penetrating, so you should be able to smell it without having to put the fruit up to your nose. 1 Ripe guavas can be stored in the refrigerator for two days. 2  Guavas purchased or picked when green and hard continue to ripen when kept at room temperature. 3  Place green guavas in a paper bag with a banana or apple for faster ripening."}, {"url": "http://www.chicagonow.com/new-abides/2014/02/you-should-try-a-guava-or-at-least-smell-one/", "passage_text": "I'm not sure if it's because we're eating these in February, but they smelled like a Hawaiian sunset. (Well, if a sunset could smell and I'm guessing on the Hawaii thing because I've never been there, but still.). I had read that guavas have a strong smell and anytime you read that, it seems like a warning. Not in this case. Keeping with our adventure of trying new foods, we decided to try guava today. I think I've had guava juice somehow or other in my life. I've never eaten an actual guava though before today. Honestly, the guavas at the grocery store looked a little suspect."}, {"url": "http://www.wikihow.com/Eat-Guava", "passage_text": "1. Wash your guavas. You should wash the entire guava, as the rinds are actually edible. Rinse the fruit with cold water in an effort to quell any bacterial growth. Pat your guavas dry with paper towels. 2. Place your guava on a cutting board. Using a knife, slice your guava in half."}, {"url": "https://en.wikipedia.org/wiki/Guava", "passage_text": "Psidium guajava (common guava, lemon guava) is a small tree in the Myrtle family (Myrtaceae), native to Mexico, Central America, and northern South America. Although related species may also be called guavas, they actually belong to other genera, such as the pineapple guava Acca sellowiana. In many countries, guava is eaten raw, typically cut into quarters or eaten like an apple, whereas in other countries it is eaten with a pinch of salt and pepper, cayenne powder or a mix of spices (masala) . It is known as the winter national fruit of Pakistan."}, {"url": "http://www.wikihow.com/Eat-Guava", "passage_text": "Smell before you select. A perfectly ripe guava is one that you can smell without even putting it to your nose. It should smell sweet and slightly musky. If you have eaten a guava before, look for guavas that smell like they taste. Wash your guavas. You should wash the entire guava, as the rinds are actually edible. Rinse the fruit with cold water in an effort to quell any bacterial growth. Pat your guavas dry with paper towels. 2. Place your guava on a cutting board. Using a knife, slice your guava in half."}, {"url": "http://flavorsofbrazil.blogspot.com/2011/07/fruits-of-brazil-guava-goiaba.html", "passage_text": "Guavas are strongly aromatic, sometimes alarmingly so. Like most aromas, the smell of ripe guavas is very difficult to describe-it's slightly sweet, very flowery, and heady-sometimes almost too much so. The smell of guavas can be overwhelming. There are many varieties of guava, some with yellow skin, some with green and some with pink. Some with whitish flesh and some with shocking pink flesh. Some round like and apple and some pear-shaped. What all guavas share is their taste, and even more so, their aroma."}]