[{"url": "https://en.wikipedia.org/wiki/Deforestation_of_the_Amazon_rainforest", "passage_text": "Deforestation of the Amazon rainforest can be attributed to many different factors. The rainforest is mainly seen as a resource for cattle pasture, valuable hardwoods, housing space, farming space (especially for soybeans), road works (such as highways and smaller roads) and medicines. In the nine years from 1991 to 2000, the area of Amazon rainforest cleared rose from 415,000 to 587,000 km 2 (160,000 to 227,000 sq mi), comparable to the total land area of Spain, Madagascar or Manitoba."}, {"url": "http://kanat.jsc.vsc.edu/student/callahan/mainpage.htm", "passage_text": "Countries with tropical rainforests, the country's land area, original forest cover, present forest cover, and the annual deforestation rate are illustrated in Figure 1. While examining Figure 1, it is important to compare the original forest cover with the present forest cover; the numbers are dreadfully surprising. Back to Table of Contents Causes: Figure 3. The major causes of tropical deforestation (Rainforest Alliance, 1999). Agriculture, the logging industry, fuelwood collection and cattle ranching directly consume the largest amounts of rainforest land throughout the world, respectively (Figure 3)."}, {"url": "https://en.wikipedia.org/wiki/Deforestation", "passage_text": "Deforestation occurs for many reasons: trees are cut down to be used or sold as fuel (sometimes in the form of charcoal) or timber, while cleared land is used as pasture for livestock, plantations of commodities and settlements. Deforestation, clearance or clearing is the removal of a forest or stand of trees where the land is thereafter converted to a non-forest use."}, {"url": "http://www.livescience.com/27692-deforestation.html", "passage_text": "Countries with significant deforestation include Brazil, Indonesia, Thailand, the Democratic Republic of Congo and other parts of Africa, and parts of Eastern Europe, according to GRID-Arendal, a United Nations Environment Program collaborating center. The country with the most deforestation is Indonesia. Loss of species: Seventy percent of the world’s plants and animals live in forests and are losing their habitats to deforestation, according to National Geographic. Loss of habitat can lead to species extinction."}, {"url": "http://kanat.jsc.vsc.edu/student/callahan/mainpage.htm", "passage_text": "Figure 1. Tropical rainforest deforestation rates (RAN, 1999). Most of the plant and animal life in Madagascar are the world's most endangered species. Slash-and-burn agriculture on poor soil, is the major reason for deforestation, which causes habitat destruction leading to species endangerment. Back to Table of Contents Causes: Figure 3. The major causes of tropical deforestation (Rainforest Alliance, 1999). Agriculture, the logging industry, fuelwood collection and cattle ranching directly consume the largest amounts of rainforest land throughout the world, respectively (Figure 3)."}, {"url": "http://earthobservatory.nasa.gov/Features/Deforestation/deforestation_update3.php", "passage_text": "In the Amazon, industrial-scale cattle ranching and soybean production for world markets are increasingly important causes of deforestation, and in Indonesia, the conversion of tropical forest to commercial palm tree plantations to produce bio-fuels for export is a major cause of deforestation on Borneo and Sumatra. The single biggest direct cause of tropical deforestation is conversion to cropland and pasture, mostly for subsistence, which is growing crops or raising livestock to meet daily needs. The conversion to agricultural land usually results from multiple direct factors."}, {"url": "https://en.wikipedia.org/wiki/Deforestation_of_the_Amazon_rainforest", "passage_text": "Furthermore, “as a result of deforestation, only 2.4 million square miles remain” of the original 6 million acres that once covered the earth (Rainforest Concern). Cattle ranching is responsible for 91% of the destruction in tropical rainforests, with over 136 million acres of land cleared for cattle grazing (PETA). In the nine years from 1991 to 2000, the area of Amazon rainforest cleared rose from 415,000 to 587,000 km 2 (160,000 to 227,000 sq mi), comparable to the total land area of Spain, Madagascar or Manitoba."}, {"url": "http://kids.mongabay.com/lesson_plans/lisa_algee/deforestation.html", "passage_text": "Answers to questions: 1. Deforestation refers to the cutting, clearing, and removal of rainforest or related ecosystems into less bio-diverse ecosystems such as pasture, cropland, or plantations. 2. Logging, mining, oil and gas extraction, cattle ranching, agriculture, and International, National, and Local reasons. "}, {"url": "http://kids.mongabay.com/elementary/501.html", "passage_text": "Humans are the main cause of rainforest destruction. We are cutting down rainforests for many reasons, including: Rainforests are also threatened by climate change ** , which is contributing to droughts in parts of the Amazon and Southeast Asia."}, {"url": "https://en.wikipedia.org/wiki/Deforestation_of_the_Amazon_rainforest", "passage_text": "The main causes of deforestation of the Amazon rainforest are human settlement and development of the land. In the nine years from 1991 to 2000, the area of Amazon rainforest cleared rose from 415,000 to 587,000 km 2 (160,000 to 227,000 sq mi), comparable to the total land area of Spain, Madagascar or Manitoba."}]