[{"url": "https://turbotax.intuit.com/tax-tools/tax-tips/Tax-Planning-and-Checklists/The-Gift-Tax/INF12036.html", "passage_text": "Updated for Tax Year 2014. OVERVIEW. If you give people a lot of money, you might have to pay a federal gift tax. But the IRS also allows you to give up to $14,000 in 2014 to any number of people without facing any gift taxes, and without the recipient owing any income tax on the gifts. In addition to the annual gift amount, your can give a total of up to $5.34 million starting in 2014 in your lifetime before you start owing the gift tax."}, {"url": "http://images.kw.com/docs/1/0/3/103530/1181995605133_Gift_of_Equity.doc", "passage_text": "A good rule of thumb in looking at if a gift tax is going to be paid is the following: each person is allowed to gift any other person $12,000 per year with out disclosure to the IRS. So for parents giving a gift of equity to a child, then each parent can gift $12,000 for a total of $24,000 to that child. Anything beyond that is taken from a $1,000,000 (one million dollar) gift tax exemption over the life of the giving individual. Example: You have a person buying his/her childhood home"}, {"url": "http://www.nolo.com/legal-encyclopedia/reduce-estate-tax-by-gifts-30095.html", "passage_text": "If you miss a year, you can't go back and claim that year's exemption amount. But if you spread a large gift over two or more years, you may escape gift tax complications. For instance, if you give your daughter $20,000 on December 17, $6,000 of it is taxable. You'll have to file a gift tax return (by April 15 of the next year), and you'll use up $6,000 of the total amount you can give away or leave free from estate tax. But if you give your daughter $10,000 in December and wait to hand over the other $10,000 until January 1, both gifts are tax-fre"}, {"url": "http://www.brokeroutpost.com/reference/37518.htm", "passage_text": "A good rule of thumb in looking at if a gift tax is going to be paid is the following: each person is allowed to gift any other person $12,000 per year with out disclosure to the IRS. So for parents giving a gift of equity to a child, then each parent can gift $12,000 for a total of $24,000 to that child. Anything beyond that is taken from a $1,000,000 (one million dollar) gift tax exemption over the life of the giving individual. Example: You have a person buying his/her childhood home. Therefore each parent can still give that child up to $999,987.00 in gifts over the rest of their lives. Usually gifting rules still apply on gifts of equity, meaning if the total gift of equity is less than 20% the borrower may still have to come up with a 5% down payment from their own resources."}, {"url": "http://www.mtgprofessor.com/A%20-%20Down%20Payment/how_can_i_take_advantage_of_an_equity_gift.htm", "passage_text": "Gift taxes should not be a problem. Taxable gifts are those to one recipient in excess of $12,000 per year. (Gift recipients never pay taxes on gifts). If you are married and have at least one child, each of your parents could gift each of the three of you $12,000 a year, or $72,000 in all, without it being taxable. If you are married but have no children, your parents can give you and your wife only $48,000 in non-taxable gifts in any one year. "}, {"url": "http://www.bankrate.com/finance/retirement/know-the-gift-tax-rules-1.aspx", "passage_text": "Because you have a $1 million gift tax lifetime exemption, the only taxable portion of your $1.5 million of gifts is $464,000 ($1,464,000 - $1 million). Scenario: You are financially well-off, maybe even wealthy. You would like to make some significant gifts to people you care about. Because you have a $1 million gift tax lifetime exemption, the only taxable portion of your $1.5 million of gifts is $464,000 ($1,464,000 - $1 million). Bankrate's community sharing policy. Bankrate's community sharing policy. Bankrate wants to hear from you and encourages thoughtful and constructive comments."}, {"url": "http://finance.zacks.com/giving-money-adult-children-1112.html", "passage_text": "If you give money or property to your children and don’t get something of equal value in return, the IRS calls it a gift, whether you designate it as a gift or not. Each year you can give your adult children some money without filing a gift tax return or otherwise reporting the gift to the IRS. This is the annual exclusion. For example, the 2012 annual exclusion was $13,000. If you give a gift of a future interest, you can’t claim it in your annual exclusion. You can give another $26,000 to your child’s spouse, if he’s married. You can pay tuition directly to a college or university for your children or grandchildren and claim educational exclusions. You can also pay medical expenses directly to a medical facility and exclude those expenses from your gift tax."}, {"url": "https://us.axa.com/plan/estate/gift-tax.html", "passage_text": "Remember that asset gifts are not limited to children. Generally you can also give adults up to $14,000 a year (as many as you like); and it can be in cash, investments, or property. Be sure to consult a qualified tax attorney for details. Keep in mind, however, that the IRS considers the value of the gift as the fair market value of the property at the time of transfer. "}, {"url": "https://www.irs.gov/uac/eight-tips-to-determine-if-your-gift-is-taxable", "passage_text": "1 For example, there is usually no tax if you make a gift to your spouse or to a charity. 2  If you make a gift to someone else, the gift tax usually does not apply until the value of the gifts you give that person exceeds the annual exclusion for the year. 3  For 2011 and 2012, the annual exclusion is $13,000. "}]