[{"url": "http://www.apta.org/PTACareers/RoleofaPTA/", "passage_text": "The physical therapist is responsible for the services provided by the PTA. Physical therapists (PTs) are health care professionals who examine each individual and develop a plan using treatment techniques to promote the ability to move, reduce pain, restore function, and prevent disability. The terms physical therapist assistant and physical therapy aide or technician are not synonymous. PTAs complete an intensive education culminating in an associate degree. Aides and technicians are on-the-job trained and not eligible to provide physical therapy by many payers, including Medicare."}, {"url": "http://www.apta.org/PTACareers/RoleofaPTA/", "passage_text": "Physical therapist assistants (PTAs) work as part of a team to provide physical therapy services under the direction and supervision of the physical therapist. The terms physical therapist assistant and physical therapy aide or technician are not synonymous. PTAs complete an intensive education culminating in an associate degree. Aides and technicians are on-the-job trained and not eligible to provide physical therapy by many payers, including Medicare."}, {"url": "http://www.bls.gov/ooh/Healthcare/Physical-therapist-assistants-and-aides.htm", "passage_text": "What Physical Therapist Assistants and Aides Do. Physical therapist assistants (sometimes called PTAs) and physical therapist aides work under the direction and supervision of physical therapists. They help patients who are recovering from injuries and illnesses regain movement and manage pain. Physical therapist assistants are involved in the direct care of patients. Physical therapist aides often do tasks that are indirectly related to patient care, such as cleaning and setting up the treatment area, moving patients, and performing clerical duties."}, {"url": "http://hiring.monster.com/hr/hr-best-practices/recruiting-hiring-advice/job-descriptions/physical-therapy-assistant-job-description.aspx", "passage_text": "Physical Therapy Assistant Job Description. This physical therapy assistant sample job description can assist in your creating a job application that will attract job candidates who are qualified for the job. Feel free to revise this job description to meet your specific job duties and job requirements. Promotes and maintains health by providing physical therapy services under the supervision of a physical therapist."}, {"url": "http://www.apta.org/PTACareers/RoleofaPTA/", "passage_text": "PTAs assist the physical therapist in the treatment of individuals of all ages, from newborns to the very oldest, who have medical problems or other health-related conditions that limit their abilities to move and perform functional activities in their daily lives. The terms physical therapist assistant and physical therapy aide or technician are not synonymous. PTAs complete an intensive education culminating in an associate degree. Aides and technicians are on-the-job trained and not eligible to provide physical therapy by many payers, including Medicare."}, {"url": "http://www.bls.gov/ooh/Healthcare/Physical-therapist-assistants-and-aides.htm", "passage_text": "Physical therapist aides work under the direct supervision of a physical therapist or physical therapist assistant. They usually are responsible for keeping the treatment area clean and organized, and preparing for each patient's therapy. They also help patients who need assistance moving to or from a treatment area. Physical therapist assistants are involved in the direct care of patients. Physical therapist aides often do tasks that are indirectly related to patient care, such as cleaning and setting up the treatment area, moving patients, and performing clerical duties."}, {"url": "http://www.apta.org/PTACareers/Overview/", "passage_text": "Physical Therapist Assistant (PTA) Careers Overview. Physical therapists and physical therapist assistants (PTAs) under the direction and supervision of a physical therapist are the only providers of physical therapy services. In many practice settings, physical therapists rely on the PTA to assure that all patients/clients have access to physical therapy services. "}, {"url": "http://www.snagajob.com/job-descriptions/physical-therapist-assistant/", "passage_text": "Physical therapist assistants work under licensed physical therapists (PTs) to help people with physical injuries or illnesses of to regain range of movement and control their pain. 1 Interpersonal Skills: Physical therapist assistants will be working one-on-one with patients every day. 2  They need to like working with people in close situations, be a good communicator and listener. 3  Stamina: Physical therapist assistants may have to lift clients, and spend much of their time on their feet."}]