[{"url": "https://www.harrisseeds.com/Storefront/s-125-pepper-seeds.aspx", "passage_text": "We offer pepper seeds and plants to suit everyone’s taste buds! Sweet, mild, hot, crisp, spicy, tangy — all these adjectives describe the versatile pepper. Rich in vitamin C, peppers add color and flavor to any recipe. Choose from Harris Seeds extensive offering of sweet bell peppers, hot peppers, specialty peppers and ornamental peppers. Whether you are a home gardener or grow for profit, you have plenty of pepper varieties to choose from. Untreated and organic pepper seeds are available. "}, {"url": "http://www.tesco.com/groceries/Product/Details/?id=280067550", "passage_text": "Description. Find us on Facebook under RoquitoPeppers for loads of fiery fun. With bags of Latino flare, the sweet and spicy flavour of Roquito® Chilli Pepper Pearls gives you a wonderful balance of taste and heat. Perfect on pizzas or adding a fiery kick to fajitas, subs, burgers or salsas. With this vibrant chilli pepper pearl the possibilities are endless.."}, {"url": "https://roquitoblog.wordpress.com/about/", "passage_text": "About. I’m sure you know about Roquito Peppers. If you like pizzas, or have ever eaten one in the UK, then its likely that that spicy little number that tickled your tastebuds was a Roquito Pepper. Although don’t confuse us with that horrible dry green thing that offended you – that was most likely a green jalepeno! The green jalepeno is everywhere, but really cannot compete with the flavour, crunch and aftertaste of a spicy little Roquito Pepper."}, {"url": "http://www.chilefoundry.com/2014/09/15/the-bay-tree-roquito-chilli-spice-sauce/", "passage_text": "Well it turns out that the Roquito chilli are a variety of Jalapeno that has been ripened to red (That is from the Roquito facebook page). Ingredients: Water, Roquito Chilli Pepper (25%)[Chilli Pepper, Water, Sugar, Vinegar], Cider Vinegar. I would be good to know a little more about the Roquito Chilli Pepper. I can find very little information on the Leathams and other web sites, it could just be a brand name that covers any number of chilli varieties, hopefully some one will let me know."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20130225062740AAPciSW", "passage_text": "Answers. Best Answer: Here's what I found for you About Roquito Peppers I’m sure you know about Roquito Peppers. If you like pizzas, or have ever eaten one in the UK, then its likely that that spicy little number that tickled your tastebuds was a Roquito Pepper. "}, {"url": "https://en.wikipedia.org/wiki/Rocoto", "passage_text": "Capsicum pubescens is a species of the genus Capsicum (pepper), known as rukutu, ruqutu (Quechua, hispanicized rocoto) and luqutu (Aymara, hispanicized locoto) and in Mexico known as the Manzano pepper which means apple for its apple-shaped fruit. The species name, pubescens, means hairy, which refers to the hairy leaves of this pepper. The hairiness of the leaves, along with the black seeds, distinguish this species from others. As they reach a relatively advanced age and the roots lignify quickly, sometimes they are called tree chili."}, {"url": "http://www.waitrose.com/shop/DisplayProductFlyout?productId=338071", "passage_text": "Product Summary. No artificial colours or preservatives.With bags of Latino flare, the sweet and spicy flavour of Roquito®Chilli Pepper Pearls gives you a wonderful balance of taste and heat. Perfect on pizzas or adding a fiery kick to fajitas, subs, burgers or salsas"}, {"url": "http://www.kgbanswers.co.uk/what-are-roquito-peppers/3073547", "passage_text": "Roquito Peppers is a brand of sweet chili peppers. They are produced by Leathams Plc, founded in 1980, and will be found in the delicatessen category where available. The heat of chili peppers is measured in Scoville heat units named after American chemist Wilbur Scoville."}, {"url": "http://www.leathams.com/content/doc/lib/679/Wholesale-Roquito-Flyer-small.pdf", "passage_text": "Additive free with no artificial colour, flavours or preservatives, Ideal for soups, pizzas, pastas, sandwiches, and salads to add a sweet, fiery kick. Roquito® drop pepper This versatile drop pepper is about the size of a garden pea with a hot and sweet kick that bursts through with each bite. "}]