[{"url": "https://answers.yahoo.com/question/index?qid=20090406132137AA0RR5I", "passage_text": "Is there a list of people who get SSSS on their boarding pass? On the basis of what is it assigned? Do some US citizens have this too or only foreigners? "}, {"url": "http://flyingwithfish.blogspot.com/2008/04/dreaded-ssss-on-your-boarding-pass_12.html", "passage_text": "A common misconception is that SSSS only exists in the United States. You can get SSSS on your boarding pass outside of the United States. I know quite a few people who have had SSSS come up on their boarding pass outside of the US. If you are planning on doing some harm to the worth and you see SSSS on your boarding card chances are you'll walk out of the airport, or go to your car and ditch whatever you were going to smuggle onto the plane. It is simply a show of force."}, {"url": "https://en.wikipedia.org/wiki/Staphylococcal_scalded_skin_syndrome", "passage_text": "Staphylococcal scalded skin syndrome, (SSSS), also known as Pemphigus neonatorum or Ritter's disease, or Localized bullous impetigo is a dermatological condition caused by Staphylococcus aureus. Ritter's Disease of the Newborn is the most severe form of SSSS with similar signs and symptoms. SSSS often includes a widespread painful erythroderma, often involving the face, diaper, and other intertriginous areas. Extensive areas of desquamation might be present."}, {"url": "http://www.ausbt.com.au/what-does-ssss-on-your-boarding-pass-mean", "passage_text": "'SSSS'. It's a seemingly random set of letters on the boarding pass for your domestic US flight, but it means you're in for an extra security screening by the TSA agents. Once you've been through those extra checks and have been cleared, a TSA officer will apply some distinctive markings to your boarding pass – in the photograph shown, this is the handwritten 'SSSS-10' and the three stars next to 'SSSS', although the markings change frequently and vary from airport to airport."}, {"url": "http://www.sexscience.org/", "passage_text": "The Society for the Scientific Study of Sexuality (SSSS) is an international organization dedicated to the advancement of knowledge about sexuality. It is the oldest organization of professionals interested in the study of sexuality in the United States. "}, {"url": "http://flyingwithfish.blogspot.com/2008/04/dreaded-ssss-on-your-boarding-pass_12.html", "passage_text": "When you are selected the computer has to base it's SSSS selection on travel patterns, such as last minute one-way bookings, as the computer cannot factor in a background check at the time the boarding pass is issued. I have read some very amusing posts online about how to avoid SSSS, such as asking for a new seat. If you are planning on doing some harm to the worth and you see SSSS on your boarding card chances are you'll walk out of the airport, or go to your car and ditch whatever you were going to smuggle onto the plane. It is simply a show of force."}, {"url": "http://www.hopkinsmedicine.org/healthlibrary/conditions/dermatology/staphylococcal_scalded_skin_syndrome_85,P00316/", "passage_text": "Staphylococcal Scalded Skin Syndrome. Staphylococcal scalded skin syndrome, also known as Ritter's disease, is a response to a toxin produced by a staphylococcal infection and is characterized by peeling skin. The disease mostly affects infants, young children, and individuals with a depressed immune system or renal insufficiency. "}, {"url": "http://flyingwithfish.blogspot.com/2008/04/dreaded-ssss-on-your-boarding-pass_12.html", "passage_text": "This does not work. A favourite way to avoid SSSS is to pay for an upgrade. Not only does this not remove the SSSS, but you have to consider if it is even worth it to pay for an upgrade to save 4 minutes at the security check point. Secondary screening is not that bad. If you are planning on doing some harm to the worth and you see SSSS on your boarding card chances are you'll walk out of the airport, or go to your car and ditch whatever you were going to smuggle onto the plane. It is simply a show of force."}, {"url": "http://travellingtheworld.boardingarea.com/2014/12/ssss-boarding-pass-mean/", "passage_text": "In my case, I was flying from Poland to Frankfurt and onward to Seattle and I was able to check-in all the way to Seattle but was only able to print/get my boarding pass at home for the European segment. In most cases, SSSS is random and it is just another way of protecting the people travelling. If you see that you have received SSSS, I’d suggest that you make sure to take off ALL of the metal on your body BEFORE going through security. And I mean everything. Place it in your bag so that the whole process will go smoother. "}]