[{"url": "https://en.wikipedia.org/wiki/Heterochromia", "passage_text": "1 Congenital Horner's syndrome – sometimes inherited, although usually acquired. 2  Waardenburg syndrome – a syndrome in which heterochromia is expressed as a bilateral iris hypochromia in some cases. 3  A Japanese review of 11 albino children with the disorder found that all had sectoral/partial heterochromia. It may be inherited, or caused by genetic mosaicism, chimerism, disease, or injury. Heterochromia of the eye (heterochromia iridis or heterochromia iridum; the common incorrect form heterochromia irid i um is not correct Latin) is of three kinds."}, {"url": "http://www.beautyzion.com/birthmarks/birthmark-in-eye-celebs-meaning/", "passage_text": "Birthmark in Eye Meaning. Birthmarks on the eye are pigmented marks that can occur on the front part of the eye, on the iris, under the retina and at the back of the eye too. When a person has a birthmark in the eye, it means that there is some kind of freckle similar to the one that appears on the skin. The only difference is that it is found in the eye as opposed to on the skin. Birthmarks in the eye are caused by the cells that produce the colored pigment, melanin, in the body."}, {"url": "http://medical-dictionary.thefreedictionary.com/Different+colored+eyes", "passage_text": "diversity of color in a part normally of one color. heterochromia iridis. difference in color of the iris in the two eyes, or in different areas in the same iris. May occur with extraocular pigmentary defects. See also walleye (3). diversity of color in a part normally of one color. heterochromia i´ridis difference in color of the iris in the two eyes, or in different areas in the same iris."}, {"url": "https://en.wikipedia.org/wiki/Heterochromia", "passage_text": "Heterochromia is a result of the relative excess or lack of melanin (a pigment). It may be inherited, or caused by genetic mosaicism, chimerism, disease, or injury. Heterochromia of the eye (heterochromia iridis or heterochromia iridum; the common incorrect form heterochromia irid i um is not correct Latin) is of three kinds. In complete heterochromia, one iris is a different color from the other"}, {"url": "http://www.azzrianvisions.com/2010/08/soulful-eyes.html", "passage_text": "There is a scientific name for a person having two different colors of eyes and it is heterochromia. If your eyes become darker or browner over the years then it is called hyperchromia, if they become lighter or bluer over the years then it is called hypochromia. People of all eye colors have been deeply spiritual and some plain out evil. However when a person has two different colors of eyes there can be meaning behind it. Lets look at some of the things that have been said about people with two different colors of eyes."}, {"url": "http://ezinearticles.com/?What-Is-Heterochromia?&id=6555718", "passage_text": "The answer is heterochromia iridum. Heterochromia is an eye condition which results in having different coloured eyes due to the lack of or excess of melanine pigment. There are two different kinds of it, one is called complete and the other is called partial or otherwise known as sectoral. The cause of heterochromia is due to the lack of or excess amount of melanine pigment. Melanine is a pigment which gives our skin, hair and eyes colour. If anything affects this melanine pigment from getting to the iris or how it is distributed their will be a change in colouration."}, {"url": "http://sphynxcatvp.nocturna.org/faq/most-ringaroundtheiris.html", "passage_text": "Heterochromia, Central The central zone of the iris (surrounding the pupil) is a different color from the rest of the iris. Often this different color is yellow, brown, orange, and is often (sometimes incorrectly) referred to as hazel if it coveres most of, or all of, the iris."}, {"url": "https://answers.yahoo.com/question/index?qid=20110712021143AAhZsLa", "passage_text": "The outer ring of an eye affected by central heterochromia is that iris's true color. In complete heterochromia, one iris is a different color from the other. In partial heterochromia or sectoral heterochromia, part of one iris is a different color from the rest. It may be inherited, or caused by genetic mosaicism, disease or injury. Central heterochromia is an eye condition where there are two colors in the same iris; the central (pupillary) zone of the iris is a different color than the mid-peripheral (ciliary) zone."}, {"url": "http://www.beautyzion.com/birthmarks/birthmark-in-eye-celebs-meaning/", "passage_text": "Sectoral Heterochromia birthmark is an eye condition in which one part of the iris has a different color from another part of the same iris. This happens when one part of the iris contains less pigment than the other part of the same iris. When a person has a birthmark in the eye, it means that there is some kind of freckle similar to the one that appears on the skin. The only difference is that it is found in the eye as opposed to on the skin. Birthmarks in the eye are caused by the cells that produce the colored pigment, melanin, in the body."}]