[{"url": "http://www.nhs.uk/Conditions/pregnancy-and-baby/Pages/resuscitating-a-baby.aspx", "passage_text": "How to resuscitate a child. Below is the full detailed cardiopulmonary resuscitation (CPR) sequence for infants and children. It's highly recommended that every parent goes to a first aid course as it makes this process much easier to understand and remember. In a life-threatening emergency, dial 999. If your child is coughing or is wheezy, call NHS 111 or your GP for advice."}, {"url": "http://www.resus.org.uk/pages/nls.pdf", "passage_text": "In July 2012 the process used by the Resuscitation Council (UK) to produce the 2010 Resuscitation Guidelines was accredited by the National Institute for Health and Clinical Excellence (NICE). The NICE Accreditation was based on the procedures and methodology used in the development of the 2010 Resuscitation Guidelines, as documented in the Resuscitation Council (UK) Guidelines Development Process Manual (2012)."}, {"url": "http://www.alsg.org/en/files/KCh82011.pdf", "passage_text": "During vaginal delivery some lung fluid, perhaps 35 ml in a term baby, is expelled by passage through the birth canal. In a healthy baby the first spontaneous breaths may generate a negative pressure of between – 30 cm H 2 O and –90 cm H 2 O which aerates the lungs for the first time. In a 3-kg baby up to 100 ml of fluid is cleared from the airways following the initial breaths, a. Replacement for Page 69 - 81 of the MOET Book (ILCOR Update January 2011) process aided by full inflation and prolonged high pressure on expiration, i.e. crying."}, {"url": "http://www.medscape.com/viewarticle/815384", "passage_text": "Researchers recently conducted a study to determine whether resuscitation teams were able to adhere to the recommended algorithm for newborn resuscitation. Video recordings were made of delivery room resuscitations of 194 high-risk neonates (gestational age 27-34 weeks; mean, 29 weeks) at 2 hospitals. Staff in these hospitals were trained to follow the NRP algorithms in the delivery room and were experienced in neonatal resuscitation. 1 of 3."}, {"url": "http://www.health.vic.gov.au/neonatalhandbook/procedures/resuscitation.htm", "passage_text": "1 Colour during labour the uncompromised infant has oxygen saturations of about 60% which after birth usually take 5-10 minutes to reach 90%. 2  The well newborn infant should then be able to maintain a central pink colour in room air. 3  Assessment of colour is a poor proxy for oxygenation. 1 Heart rate. 2  Colour during labour the uncompromised infant has oxygen saturations of about 60% which after birth usually take 5-10 minutes to reach 90%. 3"}, {"url": "http://www.who.int/maternal_child_adolescent/documents/basic_newborn_resuscitation/en/", "passage_text": "Overview. Globally, about one quarter of all neonatal deaths are caused by birth asphyxia. In this document, birth asphyxia is defined simply as the failure to initiate and sustain breathing at birth. Effective resuscitation at birth can prevent a large proportion of these deaths. As this document is over a decade old, a process to update the guidelines on basic newborn resuscitation was initiated in 2009. The objective of these updated WHO guidelines is to ensure that newborns in resource-limited settings who require resuscitation are effectively resuscitated."}, {"url": "http://www.medscape.com/viewarticle/760750_6", "passage_text": "Specifically, the NRP states that resuscitation should be withheld when the gestational age is less than 23 weeks, birth weight is less than 400 grams, anencephaly is present, or with a confirmed diagnosis of trisomy 13 or 18. For infants born at the borderline of viability, a difference of 2 weeks or 15% to 20% on weight could have a significant impact on the decision whether to initiate resuscitation."}, {"url": "https://en.wikipedia.org/wiki/Neonatal_Resuscitation_Program", "passage_text": "NRP Logo. The Neonatal Resuscitation Program (NRP) is an educational program in neonatal resuscitation that was developed and is maintained by the American Academy of Pediatrics. "}, {"url": "http://www.medscape.com/viewarticle/760750_6", "passage_text": "The Nuffield Council on Bioethics recommends that resuscitation and intensive care should not be provided to infants at a gestational age of less than or equal to 22 weeks unless the informed parent requests it and clinicians agree it is likely in the best interest of the infant. For infants born at the borderline of viability, a difference of 2 weeks or 15% to 20% on weight could have a significant impact on the decision whether to initiate resuscitation."}, {"url": "http://www.resus.org.uk/pages/nls.pdf", "passage_text": "The new Resuscitation Guidelines, to be published in October 2015, will be developed as documented in the Resuscitation Council (UK) Guidelines Development Process Manual (2015). Accreditation is valid for five years from March 2015. The NICE Accreditation was based on the procedures and methodology used in the development of the 2010 Resuscitation Guidelines, as documented in the Resuscitation Council (UK) Guidelines Development Process Manual (2012)."}]