[{"url": "http://classroom.synonym.com/many-states-use-caucus-rather-primary-10319.html", "passage_text": "A few states have developed mixed systems that use both caucuses and primaries to decide which candidate will receive their votes. In some states, the Democratic party holds a primary while the Republican party has a caucus."}, {"url": "http://www.diffen.com/difference/Caucus_vs_Primary", "passage_text": "The delegates of each state are awarded to one of the presidential candidates and the candidate with the most number of delegates on his/her side wins the nomination. Some states use a winner-take-all approach and award all their delegates to the winner of the caucus or primary in that state."}, {"url": "http://www.diffen.com/difference/Caucus_vs_Primary", "passage_text": "Some states allow only registered party members to vote; some allow party registrations on the same day; some are completely open to all residents of the state. States. States that use the caucus system are Alaska, Colorado, Hawaii, Kansas, Maine, Minnesota, Nevada, North Dakota, Wyoming and Iowa."}, {"url": "http://classroom.synonym.com/many-states-use-caucus-rather-primary-10319.html", "passage_text": "Each state's party members are represented by a number of delegates who vote at the convention. Fifteen U.S. states and territories use caucuses to select delegates for each party's convention, and four others use a mix of caucus and primary election."}, {"url": "http://www.diffen.com/difference/Caucus_vs_Primary", "passage_text": "The caucus format favors candidates who have a dedicated and organized following because a small band of devoted volunteers can exert an outsized influence in the open setting of a caucus. States choose whether they want to hold primaries or caucuses. Most states hold primaries but states like Iowa, Louisiana, Minnesota and Maine use the caucus system."}, {"url": "http://www.factcheck.org/2008/04/caucus-vs-primary/", "passage_text": "FULL ANSWER. Caucuses were once the most common way of choosing presidential nominees. Today, Alaska, Colorado, Hawaii, Kansas, Maine, Minnesota, Nevada, North Dakota, Wyoming and Iowa are the only states to rely solely on the caucus, according to the Federal Election Commission."}, {"url": "http://classroom.synonym.com/many-states-use-caucus-rather-primary-10319.html", "passage_text": "A few states, however, preferred the traditional caucus system to the more open primary election system. While states with primaries have higher levels of participation among registered voters than caucus states do, proponents of the caucus system argue this fulfills the U.S. Contstitution's intent."}, {"url": "http://www.nvsos.gov/index.aspx?page=1058", "passage_text": "Nevada has had varied experiences with presidential primary elections and caucuses over the years. The following provides a brief description of the selection of presidential candidates and electors since 1864, the year Nevada became a state."}]