[{"url": "http://biology.about.com/od/anatomy/ss/Coronary-Arteries.htm", "passage_text": "Coronary Arteries: Branches. 1  Right Coronary Artery-Supplies oxygenated blood to the walls of the ventricles and the right atrium. 2  Posterior Descending Artery-Supplies oxygenated blood to the inferior wall of the left ventricle and the inferior portion of the septum. The coronary arteries extend from the aorta to the heart walls supplying blood to the atria, ventricles, and septum of the heart. The coronary arteries supply oxygenated and nutrient filled blood to the heart muscle. There are two main coronary arteries: right coronary artery and left coronary artery."}, {"url": "http://www.urmc.rochester.edu/encyclopedia/content.aspx?ContentTypeID=85&ContentID=P00196", "passage_text": "The left main coronary artery supplies blood to the left side of the heart muscle (the left ventricle and left atrium). The left main coronary divides into branches: The left anterior descending artery, which branches off the left coronary artery and supplies blood to the front of the left side of the heart. The circumflex artery, which branches off the left coronary artery and encircles the heart muscle. This artery supplies blood to the outer side and back of the heart. Coronary arteries supply blood to the heart muscle. Like all other tissues in the body, the heart muscle needs oxygen-rich blood to function, and oxygen-depleted blood must be carried away. The coronary arteries run along the outside of the heart and have small branches that dive into the heart muscle to bring it blood."}, {"url": "http://www.hopkinsmedicine.org/healthlibrary/conditions/cardiovascular_diseases/anatomy_and_function_of_the_coronary_arteries_85,P00196/", "passage_text": "The two main coronary arteries are the left main and right coronary arteries. Left main coronary artery (LMCA). The left main coronary artery supplies blood to the left side of the heart muscle (the left ventricle and left atrium). The left main coronary divides into branches: The left anterior descending artery, which branches off the left coronary artery and supplies blood to the front of the left side of the heart. The circumflex artery, which branches off the left coronary artery and encircles the heart muscle. This artery supplies blood to the outer side and back of the heart. The right coronary artery supplies blood to the right ventricle, the right atrium, and the SA (sinoatrial) and AV (atrioventricular) nodes, which regular the heart rhythm. The right coronary artery divides into smaller branches, including the right posterior descending artery and the acute marginal artery."}, {"url": "http://www.texasheart.org/hic/anatomy/coroanat.cfm", "passage_text": "The right coronary artery supplies blood mainly to the right side of the heart. The right side of the heart is smaller because it pumps blood only to the lungs. The left coronary artery, which branches into the left anterior descending artery and the circumflex artery, supplies blood to the left side of the heart. The left side of the heart is larger and more muscular because it pumps blood to the rest of the body. The aorta (the main blood supplier to the body) branches off into two main coronary blood vessels (also called arteries). These coronary arteries branch off into smaller arteries, which supply oxygen-rich blood to the entire heart muscle."}, {"url": "https://www.sharecare.com/health/circulatory-system-health/how-coronary-arteries-blood-heart", "passage_text": "Your heart requires its own system of blood and oxygen, which is supplied through a network of vessels known as the coronary arteries. These vessels originate at the aorta and run across the surface of the heart. The right coronary artery supplies blood to the right side of the heart and to a portion of the back side. Two of the major vessels off the left main coronary artery are the left anterior descending (LAD) and the circumflex. The LAD provides blood and oxygen to the front of the heart and to the bulk of its muscle tissue, while the circumflex supplies the left wall and part of the back"}, {"url": "https://www.sharecare.com/health/circulatory-system-health/function-right-coronary-article", "passage_text": "The coronary arteries supply blood to the heart muscle itself. The right coronary artery is the major artery that supplies blood to the upper and lower chambers on the right side of the heart. There is also a left coronary artery. Watch this animation to learn more about these arteries. "}, {"url": "http://www.gwheartandvascular.org/education/anatomy-and-function-of-the-coronary-arteries/", "passage_text": "The two main coronary arteries are the left and right coronary arteries. The left coronary artery (LCA), which divides into the left anterior descending artery and the circumflex branch, supplies blood to the heart ventricles and left atrium. Additional arteries branch off the two main coronary arteries to supply the heart muscle with blood. These include the following: 1  circumflex artery (Cx). 2  The circumflex artery branches off the left coronary artery and encircles the heart muscle."}, {"url": "http://www.hopkinsmedicine.org/healthlibrary/conditions/cardiovascular_diseases/anatomy_and_function_of_the_coronary_arteries_85,P00196/", "passage_text": "Coronary arteries supply blood to the heart muscle. Like all other tissues in the body, the heart muscle needs oxygen-rich blood to function, and oxygen-depleted blood must be carried away. The coronary arteries run along the outside of the heart and have small branches that dive into the heart muscle to bring it blood. The right coronary artery supplies blood to the right ventricle, the right atrium, and the SA (sinoatrial) and AV (atrioventricular) nodes, which regular the heart rhythm. The right coronary artery divides into smaller branches, including the right posterior descending artery and the acute marginal artery."}, {"url": "http://my.clevelandclinic.org/services/heart/heart-blood-vessels/coronary-arteries", "passage_text": "The heart receives its own supply of blood from the coronary arteries. Two major coronary arteries branch off from the aorta near the point where the aorta and the left ventricle meet. These arteries and their branches supply all parts of the heart muscle with blood."}]