[{"url": "https://answers.yahoo.com/question/index?qid=20070220134027AAoU8ep", "passage_text": "The money that I saved on fuel costs paid for the car. I would only buy from a private owner if I was buying a used car and then I would take it to my own mechanic before I closed the deal. Private party owners usually sell there vehicles as is. If you buy it from an owner, you'll likely get the car cheaper, as you don't need to factor in the dealerships commission. The owner may be able to show you all the maintenance history, and you can get a feel about how they treated the car, problems it may have had. Someone · 9 years ago."}, {"url": "http://www.dmv.org/buy-sell/used-cars/dealer-vs-private-purchase.php", "passage_text": "Buying a Car from a Private Party. Buying a car from a private seller can sometimes place a little more leg-work on the buyer. You'll have to search through classified ads and car listing websites or find a seller through word-of-mouth from a friend or family member. Dealer Pros. Some of the pros of buying from a car dealership include: 1  Dealers must adhere to stringent operating/selling procedures. 2  This means you're less likely to be cheated or burdened with a lemon. 3  Dealers provide warranties on vehicles, often new or used."}, {"url": "http://www.jdpower.com/cars/articles/used-cars/pros-and-cons-buying-used-car-private-party-seller", "passage_text": "Buy a used vehicle from a dealer, and the dealer takes care of all the paperwork associated with the transfer of ownership, can help arrange financing if necessary, and can even buy your old car as a trade-in. Buy a used vehicle from a private party seller, and those details are the buyer's responsibility. Buying a used vehicle from a private party seller requires meetings with strangers to test-drive the vehicle, have the vehicle inspected, and to complete the transaction for the vehicle. The majority of the time, this is not a concern."}, {"url": "http://www.dmv.org/buy-sell/used-cars/dealer-vs-private-purchase.php", "passage_text": "Some of the cons that may come with buying a car from a dealer may include: 1  Higher prices and less room for negotiating. 2  Must deal with professional sales teams, reliant upon commissions. 3  It can be easy to get caught up in holiday specials, sales pitches, and signing incentives. Dealer Pros. Some of the pros of buying from a car dealership include: 1  Dealers must adhere to stringent operating/selling procedures. 2  This means you're less likely to be cheated or burdened with a lemon. 3  Dealers provide warranties on vehicles, often new or used."}, {"url": "http://www.dmv.org/buy-sell/used-cars/dealer-vs-private-purchase.php", "passage_text": "Whether you buy from a dealer or a private party, both require equal amounts of diligence on your behalf, including running vehicle history reports/VIN checks, comparing prices, working out financing, weighing car insurance costs, and inspecting and test driving the vehicle. Dealer Pros. Some of the pros of buying from a car dealership include: 1  Dealers must adhere to stringent operating/selling procedures. 2  This means you're less likely to be cheated or burdened with a lemon. 3  Dealers provide warranties on vehicles, often new or used."}, {"url": "http://www.autotrader.com/car-recall/buying-a-used-car-from-a-private-seller-better-price-206881", "passage_text": "When buying a used car from a private party, knowing that the seller is likely to be happy with an offer higher than the dealership's can help you save a significant amount of money compared to buying from a dealer. 2. Private parties may sell a vehicle because they need money for something else. Generally speaking, compared to buying a used car from a dealer, buying from an individual saves money in terms of purchase price and sales tax. There are many reasons for this, and the price savings is the primary advantage of going this route."}, {"url": "https://www.consumer.ftc.gov/articles/0055-buying-used-car", "passage_text": "Whether you buy a used car from a dealer or an individual: 1  Examine the car using an inspection checklist. 2  You can find checklists in magazines, books, and on websites that deal with used cars. 3  Test drive the car under varied road conditions — on hills, highways, and in stop-and-go traffic. Warranties. When you buy a used car from a dealer, get the original or a copy of the final Buyers Guide that was posted in the vehicle. The Guide must reflect any negotiated changes in warranty coverage. It also becomes part of your sales contract and overrides any contrary provisions."}, {"url": "http://www.dmv.org/buy-sell/used-cars/dealer-vs-private-purchase.php", "passage_text": "As you narrow down your car search, your options between buying from a car dealership or a private party will become more clear. On this page, you'll find a breakdown of some of the general pros and cons of each purchasing option. Dealer Pros. Some of the pros of buying from a car dealership include: 1  Dealers must adhere to stringent operating/selling procedures. 2  This means you're less likely to be cheated or burdened with a lemon. 3  Dealers provide warranties on vehicles, often new or used."}, {"url": "http://www.carfax.com/guides/buying-used/what-to-consider/1-owner-cars", "passage_text": "If you’re buying from a dealer, ask them about the car’s ownership history. Ask why the previous owner decided to sell, for proof that it is a one-owner vehicle and for a CARFAX report. If you’re buying from an individual, ask the same questions as you would a dealer and also for the seller’s address and phone number. "}, {"url": "http://www.jdpower.com/cars/articles/used-cars/pros-and-cons-buying-used-car-private-party-seller", "passage_text": "When buying a used vehicle, most consumers choose to purchase from a dealership or a private party seller. A private party seller is an individual just like you, someone who owns a vehicle that they need to sell, and who is likely selling the vehicle themselves in order to extract maximum value for it. Buying a used vehicle from a private party seller requires meetings with strangers to test-drive the vehicle, have the vehicle inspected, and to complete the transaction for the vehicle. The majority of the time, this is not a concern."}]