[{"url": "http://www.thefreedictionary.com/Inuit", "passage_text": "Inuit is inappropriate, however, when used in reference to speakers of Yupik, the Eskimoan language branch of southwest Alaska and the Siberian Arctic. See Usage Note at Eskimo. Noun. 1. Inuit-a member of a people inhabiting the Arctic (northern Canada or Greenland or Alaska or eastern Siberia); the Algonquians called them Eskimo (`eaters of raw flesh') but they call themselves the Inuit (`the people'). Eskimo, Esquimau."}, {"url": "https://www.uaf.edu/anlc/resources/inuit-eskimo/", "passage_text": "by Lawrence Kaplan. Related articles. Although the name Eskimo is commonly used in Alaska to refer to all Inuit and Yupik people of the world, this name is considered derogatory in many other places because it was given by non-Inuit people and was said to mean eater of raw meat.. However, the people of Canada and Greenland prefer other names. Inuit, meaning people, is used in most of Canada, and the language is called Inuktitut in eastern Canada although other local designations are used also."}, {"url": "http://www.thefreedictionary.com/Inuit", "passage_text": "Of or relating to the Inuit or the languages spoken by the Inuit. [Inuit, pl. of. , human being, Eskimo .]. Usage Note: The preferred term for the native peoples of the Canadian Arctic and Greenland is now Inuit, and the use of Eskimo in referring to these peoples is often considered offensive, especially in Canada. Noun. 1. Inuit-a member of a people inhabiting the Arctic (northern Canada or Greenland or Alaska or eastern Siberia); the Algonquians called them Eskimo (`eaters of raw flesh') but they call themselves the Inuit (`the people'). Eskimo, Esquimau."}, {"url": "https://en.wikipedia.org/wiki/Inuit", "passage_text": "The Inuit live throughout most of the Canadian Arctic and subarctic in the territory of Nunavut;  Nunavik  in the northern third of Quebec;  Nunatsiavut  and  NunatuKavut  in Labrador; and in various parts of the Northwest Territories, particularly around the Arctic Ocean. Inuit are the descendants of what anthropologists call the Thule culture, who emerged from western Alaska, after crossing from Siberia, around 1000 CE and spread eastwards across the Arctic. They displaced the related Dorset culture, the last major Paleo-Eskimo culture (in Inuktitut, called the Tuniit)."}, {"url": "http://www.answers.com/Q/What_does_inuit_mean", "passage_text": "Inuit (Inuktitut syllabics: ᐃᓄᐃᑦ, singular Inuk / ᐃᓄᒃ) is a general term for a group of culturally similar indigenous peoples inhabiting the Arctic coasts of Sib … eria, Alaska, the Northwest Territories, Nunavut, Quebec, Labrador and Greenland (see Eskimo). "}, {"url": "https://www.uaf.edu/anlc/resources/inuit-eskimo/", "passage_text": "Most Alaskans continue to accept the name Eskimo, particularly because Inuit refers only to the Inupiat of northern Alaska, the Inuit of Canada, and the Kalaallit of Greenland, and it is not a word in the Yupik languages of Alaska and Siberia. 1  Comparative Yupik and Inuit. However, the people of Canada and Greenland prefer other names. Inuit, meaning people, is used in most of Canada, and the language is called Inuktitut in eastern Canada although other local designations are used also."}, {"url": "http://www.definitions.net/definition/inuit", "passage_text": "Inuit. The Inuit are a group of culturally similar indigenous peoples inhabiting the Arctic regions of Greenland, Canada, the United States, and Russia. Inuit is a plural noun; the singular is Inuk. The Inuit languages are classified in the Eskimo-Aleut family"}, {"url": "https://in.answers.yahoo.com/question/index?qid=20061007023444AAneJOa", "passage_text": "The terms Eskimo and Inuit are frequently used interchangeably, however the term Inuit does not properly include the Alutiiq, Inupiaq, Sug'piak, and Yup'ik Eskimo populations of Alaska, or the Yupik population of Eastern Russia. “Inuit” refers to Arctic Native populations in Canada. Inuit, meaning people, is used in most of Canada, and the language is called Inuktitut in eastern Canada although other local designations are used also. The Inuit people of Greenland refer to themselves as Greenlanders or Kalaallit in their language, which they call Greenlandic or Kalaallisut.."}, {"url": "https://en.wikipedia.org/wiki/Inuit", "passage_text": "Inuit is not accepted as a term for the Yupik, and Eskimo is the only term that includes Yupik, Inupiat iñupiat And. Inuit, However aboriginal peoples In canada And greenland View eskimo as, pejorative And inuit has become more. common Inuit are the descendants of what anthropologists call the Thule culture, who emerged from western Alaska, after crossing from Siberia, around 1000 CE and spread eastwards across the Arctic. They displaced the related Dorset culture, the last major Paleo-Eskimo culture (in Inuktitut, called the Tuniit)."}, {"url": "https://in.answers.yahoo.com/question/index?qid=20061007023444AAneJOa", "passage_text": "Most Alaskans continue to accept the name Eskimo, particularly because Inuit refers only to the Inupiat of northern Alaska, the Inuit of Canada, and the Kalaallit of Greenland, and is not a word in the Yupik languages of Alaska and Siberia. Inuit, meaning people, is used in most of Canada, and the language is called Inuktitut in eastern Canada although other local designations are used also. The Inuit people of Greenland refer to themselves as Greenlanders or Kalaallit in their language, which they call Greenlandic or Kalaallisut.."}]