[{"url": "http://support.hp.com/us-en/document/c04092080", "passage_text": "Connecting devices to the computer. The computer has an HDMI-in port and an audio-out/audio-in jack on the left side of the monitor. Connecting to an HDMI device. Connect an HDMI device to your computer with an HDMI cable or a micro-HDMI to HDMI cable. Cables can be purchased at most stores that sell electronics."}, {"url": "http://support.hp.com/us-en/document/c01668603/", "passage_text": "My display does not have an HDMI connector. You can use a DVI-to-HDMI adapter with a DVI cable (or an HDMI cable). However, DVI does not carry an audio signal. To hear sound through the display, you must connect the computer Audio Line Out connector to the DVI Audio In connector on the monitor or TV. If you used a DVI-to-HDMI adapter to connect the display, DVI does not carry an audio signal. To hear sound through the display, you must connect the computer Audio Line Out connector to the DVI Audio In connector on the display. Also, do not select HDMI as the default audio device in Windows Vista."}, {"url": "http://www.ehow.com/how_8468392_hwo-use-ps3-hdmi-laptop.html", "passage_text": "Plug one end of the HDMI cable into the HDMI port on your PS3 and the other end of the HDMI cable into your laptop's HDMI port. If your laptop does not have an HDMI port, you will need to identify the video port of your laptop and purchase an adapter or video card that allows you to connect via HDMI. The most popular video ports on laptops are VGA, DVI, HDMI and composite S-Video."}, {"url": "http://support.xbox.com/en-US/xbox-360/accessories/hdmi-cable", "passage_text": "The audio adapter cable can be used with the HDMI cable. If both cables are plugged in, the Xbox 360 console transmits audio over the audio adapter and video over the HDMI cable. This gives you flexibility if you want to connect the HDMI port to your HDTV, and you want to route audio to a non-HDMI device. Description. The Xbox 360 HDMI Cable connects the Xbox 360 console to a high-definition TV that is equipped with an HDMI port. The HDMI cable can be used only on an Xbox 360 console that is equipped with an HDMI port. Note HDMI cables that are not produced by Microsoft will work with an HDMI-equipped Xbox 360 console."}, {"url": "http://www.wikihow.com/Connect-HDMI-Cables", "passage_text": "1 If your computer doesn't have an HDMI port, but has another output such as DVI or DisplayPort, you can purchase an adapter that will allow you to connect an HDMI cable. 2  If you are converting DVI to HDMI, you will need to use a separate cable for audio, as DVI does not transfer audio signal. HDMI ports are typically located on the back of the computer, though some laptops have them on the side. 1 "}, {"url": "http://www.bestbuy.com/site/Electronics-Promotions/Connect-Laptop-To-TV/pcmcat212600050003.c?id=pcmcat212600050003", "passage_text": "Again, a standard-definition TV likely won't support a DVI connection. If you want sound with a DVI connection, you will need a separate audio cable. Connect the audio cable from the headphones output of your laptop to the red and white audio input of your TV. Shop for DVI connections and adapters. "}, {"url": "http://en.community.dell.com/support-forums/peripherals/f/3532/t/19465613", "passage_text": "1 Install the video capture card on your laptop. 2  Connect the Xbox Audio/Video cables to the video capture card and plug in the power cable. 3  Turn on your laptop and your Xbox. 4  Install the software included with your capture card on your laptop. Hi, An HDMI cable can be used to connect the XBOX to the laptop. Please follow the steps below: 1. Turn off your Xbox 360. Close down any programs on your laptop. 2. Connect one end of the HDMI cable to the laptop and the other end to the Xbox. 3. Turn on your Xbox 360"}, {"url": "http://support.xbox.com/en-US/xbox-360/accessories/hdmi-cable", "passage_text": "Notes. 1  If you have an audio receiver that has optical audio input, connect your optical audio cable to the HDMI Audio Adapter (by using a TOSLINK connector). 2  The Xbox 360 S Console features a TOSLINK input jack on the back of the console. 3  In this case, you do not have to use the audio adapter for digital audio. Description. The Xbox 360 HDMI Cable connects the Xbox 360 console to a high-definition TV that is equipped with an HDMI port. The HDMI cable can be used only on an Xbox 360 console that is equipped with an HDMI port. Note HDMI cables that are not produced by Microsoft will work with an HDMI-equipped Xbox 360 console."}, {"url": "http://www.wikihow.com/Connect-HDMI-Cables", "passage_text": "1 If your TV does not support HDMI 1.4, you will need to use a separate audio cable to connect the TV to the receiver. 2  The best quality cable to use for this is a digital optical audio cable. 3  Connect the digital optical cable from the TV output to the receiver input. HDMI ports are typically located on the back of the computer, though some laptops have them on the side. 1  If your computer doesn't have an HDMI port, but has another output such as DVI or DisplayPort, you can purchase an adapter that will allow you to connect an HDMI cable."}]