[{"url": "https://en.wikipedia.org/wiki/Sociology", "passage_text": "Symbolic interaction; often associated with Interactionism, Phenomenological sociology, Dramaturgy, Interpretivism, is a sociological tradition that places emphasis on subjective meanings and the empirical unfolding of social processes, generally accessed through micro-analysis. Often grouped with urban and rural sociology is that of community sociology or the sociology of community. Taking various communities—including online communities—as the unit of analysis, community sociologists study the origin and effects of different associations of people."}, {"url": "https://en.wikipedia.org/wiki/Sociology", "passage_text": "Sociology is the scientific or academic study of social behavior, including its origins, development, organization, and institutions. It is a social science that uses various methods of empirical investigation and critical analysis to develop a body of knowledge about social order, social disorder and social change. Often grouped with urban and rural sociology is that of community sociology or the sociology of community. Taking various communities—including online communities—as the unit of analysis, community sociologists study the origin and effects of different associations of people."}, {"url": "http://www.yourdictionary.com/ramification", "passage_text": "ramification. Noun. (plural ramifications). ( 1 botany, anatomy) A branching-out, the act or result of developing branches; specifically the divergence of the stem and limbs of a plant into smaller ones, or of similar developments in blood vessels, anatomical structures etc."}, {"url": "http://www.chegg.com/homework-help/questions-and-answers/sociological-ramifications-political-decisions-driven-economic-considerations-united-state-q2826792", "passage_text": "home / study / questions and answers / social sciences / political science / what are the sociological ramifications of the ... "}, {"url": "http://dmc122011.delmar.edu/socsci/rlong/intro/goals.htm", "passage_text": "The American Sociological Association (2006) describes sociology as the study of social life, social change, and the social causes and consequences of human behavior. B. The Relationship between People and Structure. Within the vast field of sociology, the common denominator is people. Sociology explores the forces that influence people and help shape their lives Society shapes what we do, how we do it, and how we understand what others do (Univ. of Limerick 2007)."}, {"url": "http://www.chegg.com/homework-help/questions-and-answers/sociological-implications-modern-economy-workplace-environment-compare-contrast-meaning-ca-q2156197", "passage_text": "Sociological implications of the modern economy and the workplace environment. Compare and contrast the meaning of careers from the structural-functional analysis, the symbolic-interaction analysis, and the social conflict analysis. "}, {"url": "http://www.tutorsglobe.com/question/what-are-the-sociological-ramifications-5529012.aspx", "passage_text": "What are the sociological ramifications. Write an essay of 750-1,000 words describing the sociological implications of the modern economy and the workplace environment. Compare and contrast the meaning of careers from the perspective of structural-functional analysis, symbolic-interaction analysis, and social conflict analysis. How has change in technology altered the personal satisfaction of the employee in the workplace?"}, {"url": "http://www.yourdictionary.com/ramification", "passage_text": "LINK / CITE ADD TO WORD LIST. noun. The definition of a ramification is an effect that came from a specific action. An example of a ramification is having trouble getting a job after quitting college. Noun. (plural ramifications). ( 1 botany, anatomy) A branching-out, the act or result of developing branches; specifically the divergence of the stem and limbs of a plant into smaller ones, or of similar developments in blood vessels, anatomical structures etc."}, {"url": "http://www.yourdictionary.com/ramification", "passage_text": "ramification. 1  a ramifying or being ramified; specif., the arrangement of branches or offshoots, as on a plant. 2  the result of ramifying; specif., 3  a branch or offshoot. 4  a derived effect, consequence, or result: the ramifications of an act. Noun. (plural ramifications). ( 1 botany, anatomy) A branching-out, the act or result of developing branches; specifically the divergence of the stem and limbs of a plant into smaller ones, or of similar developments in blood vessels, anatomical structures etc."}, {"url": "https://en.wikipedia.org/wiki/Sociological_imagination", "passage_text": "The term sociological imaginations was coined by the American Sociologist C. Wright Mills in 1959 to describe the type of insight offered by the discipline of sociology. The term is used in introductory textbooks in sociology to explain the nature of sociology and its relevance in daily life. "}]