[{"url": "http://www.allaboutlawns.com/lawn-maintenance-care/aerating-and-thatch/how-do-i-dethatch.php", "passage_text": "1 In general, if your thatch does not exceed one inch, you can get away with dethatching manually or simply aerating your lawn instead. 2  If you decide to use a power dethatcher, there are a few things you should do first. 3  Before you begin, you should mow your lawn to about half of its normal mowing height. 1 In general, if your thatch does not exceed one inch, you can get away with dethatching manually or simply aerating your lawn instead. 2  One, Manually with a leaf rake (shown), garden rake, or thatching rake."}, {"url": "http://www.scotts.com/smg/goART3/Howto/how-to-dethatch-aerate-lawn/34000007", "passage_text": "For cool-season grasses, the best time to dethatch is late summer or early fall. That's when your grass is growing most vigorously. For warm-season grasses, dethatch in late spring or after the second mowing. Before dethatching, mow a little shorter than normal. "}, {"url": "http://www.gertens.com/learn/Fall/fall-lawn-care.htm", "passage_text": "Step 1. Mow Lawn Short Mow you grass to a height of 1.5 to 2 Step 2. Rake Area Thoroughly Use an overseeder rake or leaf rake taking care not to rip out existing grass. Step 3. Aerate & Dethatch Your Lawn Aerate stressed lawns to encourage good root development before the upcoming winter. "}, {"url": "http://www.allaboutlawns.com/lawn-maintenance-care/aerating-and-thatch/how-do-i-dethatch.php", "passage_text": "1 Once you are finished, be sure to remove all thatch and debris from your lawn. 2  Unlike aerating, dethatching is almost strictly for the removal of thatch and debris. 3  Removal can usually be done with a simple leaf rake. 4  Once your lawn is dethatched, it is usually a great time to fertilize your lawn and/or reseed it. 1 In general, if your thatch does not exceed one inch, you can get away with dethatching manually or simply aerating your lawn instead. 2  One, Manually with a leaf rake (shown), garden rake, or thatching rake."}, {"url": "http://homeguides.sfgate.com/fertilize-after-thatching-lawn-36828.html", "passage_text": "Seasons. Grass type and climate determine the best season to dethatch and fertilize your lawn. Ideally, you would dethatch, water and fertilize your warm season grass -- such as zoysia or St. Augustine -- in early spring, and your cool season turf -- such as Kentucky bluegrass and fescue -- in early fall. Unfortunately, the aforementioned perfect world caveats apply to timing as well as watering. Certain types of grasses, such as zoysia and fine fescue, tend to produce dense thatch faster than others -- and a long, hot, dry summer can turn an entire lawn of even the most drought-tolerant grass to thatch."}, {"url": "http://www.brinly.com/project-seed-and-fertilize-your-lawn.html", "passage_text": "Step 3: Aerate. If you’re considering aerating your lawn, this is a prime time to do so. Plug aerating before overseeding not only helps keep grass seed from washing away, but it also helps nutrients, water and oxygen find the existing root system. "}, {"url": "http://homeguides.sfgate.com/fertilize-after-thatching-lawn-36828.html", "passage_text": "Grass clippings return nitrogen from the end of the blades to the plant’s roots as they decompose on the ground. Unfortunately, when this dead layer, called thatch, gets too deep, it compacts to form a hard shell, capable of repelling water and blocking air, light and fertilizer. Dethatching gets this layer back to normal, but it can also stress your lawn. Certain types of grasses, such as zoysia and fine fescue, tend to produce dense thatch faster than others -- and a long, hot, dry summer can turn an entire lawn of even the most drought-tolerant grass to thatch."}, {"url": "http://home.howstuffworks.com/lawn-dethatching2.htm", "passage_text": "Dethatching can leave your lawn looking like a disaster area, especially if the blades dig into the soil. If your lawn produces a lot of thatch, dethatch annually, so that it's not such a big job. If the thatch is no more than a half-inch (1.27 centimeters) deep, you can probably get by with every other year. "}, {"url": "http://www.allaboutlawns.com/lawn-maintenance-care/aerating-and-thatch/when-should-i-dethatch.php", "passage_text": "It's not rocket science, but it will do. If you find that there is an excess of thatch in more than one place in your lawn (usually more the 1/2 inch), then it might be time to dethatch. If you find in excess of 1 inch of thatch in your lawn, then you might seriously consider dethatching soon. "}, {"url": "http://forums2.gardenweb.com/discussions/1497608/thatching-aerating", "passage_text": "I recently purchased the John Deere thatcherator to attach to my John Deere tractor. I am just not sure when the best time to thatch is or aerate the lawn. Also, do I seed and fertilize before or after. I know it is probably best to seed after. "}]