[{"url": "http://www.answers.com/Q/What_kind_of_noun_is_children", "passage_text": "A noun is a word for a person, place, or thing.    Kinds of Nouns:    Singular nouns  are words for one person, place, or thing.    Plural  nouns are wo … rds for more than one person, place, or thing. The noun kind, a singular, common, abstract noun is a word for a group of individuals or instances sharing common traits; a ca … tegory. The noun forms for the adjective kind are kindness and kindliness."}, {"url": "http://www.grammar-monster.com/lessons/nouns_different_types.htm", "passage_text": "As covered in the lesson nouns, nouns are naming words. There are several different kinds of nouns. This page describes the most common types. A common noun is the word used for a class of person, place or thing. A proper noun is the name of a person, place or thing (i.e., its own name). A proper noun always starts with a capital letter. For example: Read more about using capital letters for proprer nouns but not common nouns."}, {"url": "http://www.k12reader.com/term/proper-nouns/", "passage_text": "While a noun names a person, place, thing, or idea a proper noun gets more specific. It gives us the actual name of the person, place, thing, or idea. The actual names of people are proper nouns. So are the names of states, streets, rivers, oceans, countries, companies, institutions, churches, and more. "}, {"url": "http://teachersites.schoolworld.com/webpages/MMcCormick/files/grammar%20chapter%202%20nouns.pdf", "passage_text": "A noun is a word that names a person, place, thing, or idea. Examples include actor, building, ticket, and delight. A common noun is a general name for a person, place, thing, or idea. A propernoun is the name of a particular one. For example, theater is a common noun; Palace Theate r is a proper noun. "}, {"url": "http://www.answers.com/Q/What_kind_of_noun_is_children", "passage_text": "Yes, a possessive noun is a kind of noun; a possessive noun is a noun in the possessive case. Example: noun: tree possessive noun: the tree's leaves noun: Robert possessive n … oun: Robert's bicycle noun: story possessive noun: the story's end. + 1 other found this useful. Leonardo Amaya. Notyouraveragedummy ... The noun kind, a singular, common, abstract noun is a word for a group of individuals or instances sharing common traits; a ca … tegory. The noun forms for the adjective kind are kindness and kindliness."}, {"url": "http://www.answers.com/Q/What_kind_of_noun_is_children", "passage_text": "The word 'kind' is both an adjective and a noun. The noun kind, a singular, common, abstract noun is a word for a group of individuals or instances sharing common traits; a ca … tegory. The noun forms for the adjective kind are kindness and kindliness."}, {"url": "http://www.momswhothink.com/reading/list-of-nouns.html", "passage_text": "Possessive Nouns. A possessive noun is a noun that names who or what has something. The possessive form is used with nouns referring to people, groups of people, countries, and animals. It also refers to where someone works or plays or spends their time. Add an apostrophe and s ('s) to form the possessive of most singular nouns (ex. "}, {"url": "http://learnenglish.byexamples.com/nouns-types-of-nouns/", "passage_text": "Irregular Noun Other nouns form the plural irregularly. For example: man/men, child/children, foot/feet, mouse/mice, ox/oxen, sheep/sheep, person/people. Since there is no “s” at the ending of such plural nouns, you will have to add apostrophe “s” (‘s) to make it possessive. "}, {"url": "http://www.merriam-webster.com/dictionary/noun", "passage_text": "noun. noun \\ˈnau̇n\\. : a word or phrase that is the name of something (as a person, place, or thing) and that is used in a sentence especially as subject or object of a verb or as object of a preposition. Spanish Central: Spanish translation of noun. : a word that is the name of something (such as a person, animal, place, thing, quality, idea, or action) and is typically used in a sentence"}, {"url": "http://www.answers.com/Q/What_kind_of_noun_is_the_word_children", "passage_text": "A noun is a person, thing, or place. Children is a noun. Children  is a noun because it is a plural noun. Edit. Share to: Notyouraveragedummy ... The the noun 'kind' is an abstract noun as a word for  type or class; having similar characteristics.    The abstract noun form of the adjective 'kind' is kindness. 1 person found this useful."}]