[{"url": "http://ths.gardenweb.com/discussions/2251453/what-is-reasonable-labor-for-tile-installation", "passage_text": "I'm pretty sure the tile cost about $2-3/square foot although they didn't break it down. Thats seems really excessive for the labor portion. I'm going to talk to my builder and the tile store b/c that is well over our budget. My builder had allocated $10-12 square foot for labor and $2-3/square foot for tile. For example: In our basement bath-the cost to tile a 3x5 tub surround(about 78 sqaure feet) came in at $1818. I've chosen basic plain white 6 x 6 porcelain tile which I was told is pretty cheap. That is $23/sqaure feet."}, {"url": "http://rempros.com/tile_installation_prices.html", "passage_text": "All numbers in the charts are prices to install tile, apply grout and sealer if necessary excluding materials cost. If installer will buy thin-set or mortar as well as grout the price for installation will increase at $0.9 - $1.9 per square foot. All custom work will be estimated based on its complexity. But if it is a 700 ft 2 basement has to be tiled with the same porcelain tile, an installer typically offers much better deal on labor per square foot and will price the project at $2,800 - $3,100 or $4.0 - $4.4 per sq. ft. Design and layout will have significant impact on the tile installation prices."}, {"url": "http://www.homewyse.com/services/cost_to_install_wall_tile.html", "passage_text": "$15.22. Get an INSTANT estimate of the cost to Install Wall Tile! Our free calculator uses recent, trusted data to estimate costs for your Wall Tile Installation project. For a basic 120 square feet project in zip code 47474, the benchmark cost to Install Wall Tile ranges between $7.04 - $15.22 per square foot* . To estimate costs for your project: 1."}, {"url": "http://tile.promatcher.com/cost/", "passage_text": "$4.85 per square foot (labor only, tile provided by customer) (Range: $3.13 - $6.57). $7.53 per square foot (including labor and a mid-grade tile) (Range: $6.56 - $8.49). $3.18 per square foot (new sub-floor installation only) (Range: $2.07 - $4.28). $4.56 per square foot (new wall backing installation only) (Range: $2.86 - $6.25). $3.17 per square foot (tile removal only) (Range: $2.08 - $4.26). Free Estimates from Local Pros. $4.97 per square foot (including labor and a mid-grade tile) (Range: $4.49 - $5.44). $1.19 per square foot (labor only, tile provided by customer) (Range: $0.88 - $1.50). $0.58 per square foot (new subfloor installation only) (Range: $0.50 - $0.65)."}, {"url": "http://trianglegranite.com/how-much-does-it-cost-to-remodel-a-bathroom.php", "passage_text": "Remodeling Costs for a Small Bathroom. The cost for a typical small bathroom remodel will range from about $4,000 to $12,000 with the average cost being about $8,000. Let’s look at how the costs breakout starting with the most basic remodel including a new toilet, shower, vanity & sink and tile. "}, {"url": "http://www.homewyse.com/services/cost_to_install_bathroom_ceramic_tile.html", "passage_text": "Our free calculator uses recent, trusted data to estimate costs for your Bathroom Ceramic Tile Installation project. For a basic 120 square feet project in zip code 47474, the benchmark cost to Install Bathroom Ceramic Tile ranges between $10.41 - $15.13 per square foot* . To estimate costs for your project: 1. Set Project Zip Code Enter the Zip Code for the location where labor is hired and materials purchased"}, {"url": "http://tile.promatcher.com/cost/", "passage_text": "$22.50 per square foot (including labor and a mid-grade stone) (Range: $15.00 - $30.00). $6.00 per square foot (new sub-floor installation only) (Range: $4.00 - $8.00). $6.00 per square foot (new wall backing installation only) (Range: $4.00 - $8.00). $3.50 per square foot (tile removal only) (Range: $2.00 - $5.00). Free Estimates from Local Pros. $4.97 per square foot (including labor and a mid-grade tile) (Range: $4.49 - $5.44). $1.19 per square foot (labor only, tile provided by customer) (Range: $0.88 - $1.50). $0.58 per square foot (new subfloor installation only) (Range: $0.50 - $0.65)."}, {"url": "https://answers.yahoo.com/question/index?qid=20071028010145AAA1g5o", "passage_text": "This means the labor costs will be increased. But not %300. I work in a place where labor costs are much lower than in L A. However, the difference in my pricing is around $3 for floor and $4.50 to $5 for wall tile."}, {"url": "http://www.improvenet.com/r/costs-and-prices/bathroom-wall-tiling", "passage_text": "The Costs. Minimum cost of bathroom wall tiling: $2.50-$3.00 per square foot. Maximum cost of bathroom wall tiling: $7.00-$8.00 per square foot. When considering a bathroom wall tiling project, homeowners are often most concerned with the costs associated with the installation. "}, {"url": "http://rempros.com/tile_installation_prices.html", "passage_text": "Most contractors will charge small tile installation projects at higher rate. For example, price for the installation of 45 sq. ft. porcelain floor tile in a small hallway will be around $450 to $550, which makes it $11.25 - $12.30 per square foot. But if it is a 700 ft 2 basement has to be tiled with the same porcelain tile, an installer typically offers much better deal on labor per square foot and will price the project at $2,800 - $3,100 or $4.0 - $4.4 per sq. ft. Design and layout will have significant impact on the tile installation prices."}]