[{"url": "http://www.travelsignposts.com/Iceland/iceland-weather.php", "passage_text": "Average temperatures in July are about 12 degrees centigrade in Reykjavik; it is usually a bit warmer in the north and east of Iceland. Temperatures at Reykjavik reykjavík range from an average of°11 (c° 52) f In july -to°1 (c° 30) f In, january with an annual mean of about°5 (c°41). f ICELAND. Iceland's climate, in spite of the country's name, should not put you off travelling there, and in fact there are plenty of visitors at any time of the year."}, {"url": "http://www.travelsignposts.com/Iceland/iceland-weather.php", "passage_text": "Temperatures at Reykjavik reykjavík range from an average of°11 (c° 52) f In july -to°1 (c° 30) f In, january with an annual mean of about°5 (c°41). F considering the northerly location Of, iceland its climate is much milder than might be, expected especially in. winter ICELAND. Iceland's climate, in spite of the country's name, should not put you off travelling there, and in fact there are plenty of visitors at any time of the year."}, {"url": "http://www.travelsignposts.com/Iceland/iceland-weather.php", "passage_text": "When to travel to Iceland: weather and seasons. Iceland's climate, in spite of the country's name, should not put you off travelling there, and in fact there are plenty of visitors at any time of the year. It's true that Iceland is cold, but not as cold as you might expect. ICELAND"}, {"url": "https://en.wikipedia.org/wiki/Climate_of_Iceland", "passage_text": "The Icelandic winter is relatively mild for its latitude. The southerly lowlands of the island average around 0 °C (32 °F) in winter, while the Highlands of Iceland tend to average around −10 °C (14 °F). The lowest temperatures in the northern part of the island range from around −25 to −30 °C (−13 to −22 °F). The lowest temperature on record is −39.7 °C (−39.5 °F)"}, {"url": "http://www.iheartreykjavik.net/2014/04/what-to-wear-in-iceland-spring-summer/", "passage_text": "4 thoughts on “ What to wear in Iceland in Spring and Summer ”. Oh… this article made me think about going to Iceland in winter instead of summer. It seems to be „warmer“ 😉 But I guess for horseriding summer still is better – and there’s more daylight. This post really helps to decide what to pack. "}, {"url": "http://www.travelsignposts.com/Iceland/iceland-weather.php", "passage_text": "Iceland is not as chilly as it sounds, but it can become very cold in both summer and winter when the polar winds blow. Note that since the island is small, climatic changes are quick to set in; it's definitely best to go prepared for rapid turns in the weather, especially in late autumn and early spring. ICELAND. Iceland's climate, in spite of the country's name, should not put you off travelling there, and in fact there are plenty of visitors at any time of the year."}, {"url": "http://icelandreview.com/news/2015/08/01/coldest-july-record-some-parts-iceland", "passage_text": "Photo: Pall Páll. Stefansson stefánsson July in iceland was cold. This year the average temperature for the month in some spots was the lowest ever Recorded in july At any icelandic. weather station There, the average temperature was a frosty 1.59°C. “That is the lowest average temperature ever seen in July at an Icelandic weather station,” Trausti says—noting, however, that the station at Gagnheiði did not exist until the year 1993."}, {"url": "https://weatherspark.com/averages/27562/7/Reykjavik-Capital-Region-Iceland", "passage_text": "This report describes the typical weather at the Reykjavik Reykjavík (Airport, Reykjavik) reykjavík iceland weather station over the course of An. Average july it is based on the historical records from 1979. To 2012 earlier records are either unavailable. or unreliable Earlier records are either unavailable or unreliable. Reykjavik reykjavík has a humid subarctic continental climate with cool summers and no dry. Season the area within 25 mi of this station is covered by oceans and (seas39), % (shrublands34), % (forests19), % and (tundra4). %"}, {"url": "https://en.wikipedia.org/wiki/Climate_of_Iceland", "passage_text": "The climate of Iceland is cold oceanic (Koeppen köppen climate: Classification) cfc near the southern coastal area and tundra inland in the. Highlands the island lies in the path of The North Atlantic, current which makes its climate more temperate than would be expected for its latitude just south of The Arctic. circle The southerly lowlands of the island average around 0 °C (32 °F) in winter, while the Highlands of Iceland tend to average around −10 °C (14 °F). The lowest temperatures in the northern part of the island range from around −25 to −30 °C (−13 to −22 °F)."}]