[{"url": "https://en.wikipedia.org/wiki/Northam,_Western_Australia", "passage_text": "The town and hinterland of Northam are located in the Avon Valley-so named after the river the Avon River. It has been periodically flooded, and man-made banks protect the town from inundation. The Avon is a name commonly used by organisations, newspapers and sporting groups. The Northam Migrant Accommodation Centre closed in September 1951. It had been the first place of residence in Western Australia for approximately 15,000 immigrants from the Baltic states, Hungary, Poland, Czechoslovakia, Italy, Yugoslavia, Ukraine, Belarus and Bulgaria."}, {"url": "http://www.smh.com.au/articles/2005/02/17/1108500208602.html", "passage_text": "Northam. An interesting and important early wheatbelt settlement. Northam is located 150 m above sea level and 98 km east of Perth on the Great Eastern Highway and, like York, is one of the earliest settlements in the Central Wheatbelt area. "}, {"url": "http://www.maplandia.com/south-africa/northern-province/thabazimbi/northam/", "passage_text": "detailed map of Northam and near places. Welcome to the Northam google satellite map! This place is situated in Thabazimbi, Northern Province, South Africa, its geographical coordinates are 24° 57' 0 South, 27° 16' 0 East and its original name (with diacritics) is Northam. See Northam photos and images from satellite below, explore the aerial photographs of Northam in South Africa."}, {"url": "http://www.agoda.com/the-northam-all-suite-penang/hotel/penang-my.html", "passage_text": "&nbsp Hotel Description. The Northam All Suite Penang, located in Gurney Drive, is a popular choice for travelers. Situated only two and a half kilometers from the city center, guests are well located to enjoy the town's attractions and activities"}, {"url": "http://www.penang-hotels.com/thenortham/location.htm", "passage_text": "Location. Northam All Suite Hotel is the first all suite business hotel in Penang, Malaysia. The Hotel is located in close proximity to the central business and entertainment center of the city. Most of the main shopping areas are also located close by. Northam All Suite is just a walk away from the Gurney Drive beach resort area. 1  Distance from shopping area: 0.20 km. 2  Distance from shopping area: 6 minutes walk. 3  Northam All Suite Hotel is 20 km (Aprx 25 Minutes driving distance) from Penang International Airport"}, {"url": "http://www.northam.wa.gov.au/", "passage_text": "The Shire of Northam Administration Centre is located in the town of Northam, located 96km from Perth. Please contact our friendly staff for further information, by telephone on (08) 9622 6100, e-mail records@northam.wa.gov.au or visit the Council Offices at 395 Fitzgerald Street, Northam. "}, {"url": "http://www.uaoh.net/eGov/apps/locations/facilities.egov?view=detail&id=11", "passage_text": "The City of Upper Arlington owns and operates the Northam Park Tennis Courts, located in 22 acre Northam Park. The facility features: 1  12 Har-Tru courts, unique for municipal tennis courts and touted by many as the best soft-surface courts in Ohio.. 2  Four baseball diamonds. "}, {"url": "https://en.wikipedia.org/wiki/Northam,_Limpopo", "passage_text": "Northam is a town in the Waterberg District Municipality in the Limpopo province of South Africa, 54 km south of Thabazimbi. The town was proclaimed in 1946 by EHJ Fulls on the farm Leeukoppie, which belonged to H Herd, and was originally one of a number of farms allocated to British veterans of the Anglo-Boer war. "}, {"url": "http://www.hoteltravel.com/malaysia/penang/northam_all_suite.htm", "passage_text": "The Northam All Suite, Penang is strategically located in the heart of Penang's commercial and leisure district. The hotel offers easy access to the city's historical and cultural landmarks. The spacious suites, refined with homely earth tone finishings, Jacuzzi and modern amenities will pamper your every whim. "}, {"url": "https://en.wikipedia.org/wiki/Northam,_Western_Australia", "passage_text": "Northam /ˈnɔrðᵊm/ is a town in Western Australia, situated at the confluence of the Avon and Mortlock Rivers, about 97 kilometres (60 mi) north-east of Perth in the Avon Valley. At the 2011 census, Northam had a population of 6,580. Northam is the largest town in the Avon region. The Northam Migrant Accommodation Centre closed in September 1951. It had been the first place of residence in Western Australia for approximately 15,000 immigrants from the Baltic states, Hungary, Poland, Czechoslovakia, Italy, Yugoslavia, Ukraine, Belarus and Bulgaria."}]