[{"url": "http://www.awea.org/Resources/Content.aspx?ItemNumber=5547", "passage_text": "1 The Department of Energy finds that “ Among a large sample of wind projects installed in 2012, the capacity-weighted average installed cost stood at nearly $1,940/kW, down almost $200/kW from the reported average cost in 2011 and down almost $300/kW from the reported average cost in both 2009 and 2010 .” [3]. Recent improvements in turbine technology has reduced the cost of wind energy, allowing electricity consumers and utilities to lock in low, affordable electricity rates through 20 to 30 year contracts. GO TO: Cost of Wind Energy: PPA, Capital Cost, and Performance."}, {"url": "http://www.windustry.org/how_much_do_wind_turbines_cost", "passage_text": "Total costs for installing a commercial-scale wind turbine will vary significantly depending on the number of turbines ordered, cost of financing, when the turbine purchase agreement was executed, construction contracts, the location of the project, and other factors. Wind turbines have significant economies of scale. Smaller farm or residential scale turbines cost less overall, but are more expensive per kilowatt of energy producing capacity. Oftentimes there are tax and other incentives that can dramatically reduce the cost of a wind project."}, {"url": "http://www.local.gov.uk/home/-/journal_content/56/10180/3510194/ARTICLE", "passage_text": "The cost of a wind energy project will vary depending on the scale, site and installation requirements. Some typical figures for the installed cost for different scales of wind turbine are provided in the following table. Capital cost figures are approximate and include installation costs due to civil works. "}, {"url": "http://www.windustry.org/how_much_do_wind_turbines_cost", "passage_text": "The costs for a utility scale wind turbine range from about $1.3 million to $2.2 million per MW of nameplate capacity installed. Most of the commercial-scale turbines installed today are 2 MW in size and cost roughly $3-$4 million installed. Wind turbines have significant economies of scale. Smaller farm or residential scale turbines cost less overall, but are more expensive per kilowatt of energy producing capacity. Oftentimes there are tax and other incentives that can dramatically reduce the cost of a wind project."}, {"url": "http://www.windustry.org/how_much_do_wind_turbines_cost", "passage_text": "Home or Farm Scale Wind Turbines. Wind turbines under 100 kilowatts cost roughly $3,000 to $8,000 per kilowatt of capacity. A 10 kilowatt machine (the size needed to power a large home) might have an installed cost of $50,000-$80,000 (or more). Wind turbines have significant economies of scale. Smaller farm or residential scale turbines cost less overall, but are more expensive per kilowatt of energy producing capacity. Oftentimes there are tax and other incentives that can dramatically reduce the cost of a wind project."}, {"url": "http://www.awea.org/Resources/Content.aspx?ItemNumber=5547", "passage_text": "1 The cost of electricity can be reported in dollars per megawatt-hour ($/MWh) or cents per kilowatt-hour (c/kWh) as commonly seen on residential electricity bills. 2  For example, $50 per MWh = 5 cents per kWh. 3  An average U.S. home uses 11,000 kWh or 11 MWh each year. Recent improvements in turbine technology has reduced the cost of wind energy, allowing electricity consumers and utilities to lock in low, affordable electricity rates through 20 to 30 year contracts. GO TO: Cost of Wind Energy: PPA, Capital Cost, and Performance."}, {"url": "http://bergey.com/wind-school/residential-wind-energy-systems", "passage_text": "A 10 kW wind turbine costs approximately $48,000 – 65,000 to install. The equipment cost is about $40,000 (see 10 kW GridTek System) and the rest is shipping and installation. Towers without guy wires are more expensive than guyed towers. "}, {"url": "http://www.conserve-energy-future.com/WindEnergyCost.php", "passage_text": "The commercial wind turbine cost is about $1- $2 million a MW nameplate capacity installed and if you buy the same turbine in 2 MW, its cost would be about $2.8 million. The wind turbines for residence and farm are less expensive, when a KW energy production capacity applies to the rates. The 10 KW wind turbine price is about $28,000and 100 KW price is about $ 48,000. Small Turbine Cost. Some small units of 1KW to 2KW wind turbines are available in $800 upwards. They come along with a low starting up speed and supply optimum power in regular conditions. They are not for luxurious power utilised only for the average household. They could meet your power needs during the whole year."}, {"url": "http://www.awea.org/Resources/Content.aspx?ItemNumber=5547", "passage_text": "Capital costs: The cost of the wind turbine is the single largest cost component, and can make up 70% or more of the entire cost of a land-based wind project. The cost of installation, such as construction, makes up the remaining capital costs. Recent improvements in turbine technology has reduced the cost of wind energy, allowing electricity consumers and utilities to lock in low, affordable electricity rates through 20 to 30 year contracts. GO TO: Cost of Wind Energy: PPA, Capital Cost, and Performance."}, {"url": "http://www.cleanenergypipeline.com/Resources/CE/ResearchReports/Offshore%20Wind%20Project%20Cost%20Outlook.pdf", "passage_text": "This improvement will be driven by declining costs of wind farm installation, foundations and turbine The potential for cost reductions towers, which are expected to fall by 6.6%, 6.1% and 5.4% respectively in the next five years. In terms of the levelised cost of energy (LCOE), survey respondents expect offshore wind costs to decrease to £122.70 per MWh for projects that reach a FID in 2018 and £111 per MWh for projects that reach a FID in 2023, a 8% and 17% decrease respectively on the current cost (£133 per MWh)."}]