[{"url": "https://en.wikipedia.org/wiki/Agnatha", "passage_text": "From Wikipedia, the free encyclopedia. Agnatha (Greek, no jaws) is a superclass of jawless fish in the phylum Chordata, subphylum Vertebrata, consisting of both present (cyclostomes) and extinct (conodonts and ostracoderms) species. The group excludes all vertebrates with jaws, known as gnathostomes. The Agnatha are ectothermic or cold blooded, with a cartilaginous skeleton, and the heart contains 2 chambers."}, {"url": "https://en.wikipedia.org/wiki/Vertebrate", "passage_text": "Vertebrates include the jawless fish and the jawed vertebrates, which includes the cartilaginous fish (sharks and rays) and the bony fish. A bony fish clade known as the lobe-finned fishes is included with tetrapods, which are further divided into amphibians, reptiles, mammals, and birds. Hagfish do, however, possess a cranium. For this reason, the vertebrate subphylum is sometimes referred to as  Craniata  when discussing morphology. Molecular analysis since 1992 has suggested that the hagfish are most closely related to lampreys, and so also are vertebrates in a monophyletic sense."}, {"url": "http://www.sciencelearningspace.com/2011/09/jawless-fish/", "passage_text": "There are 57,739 species of vertebrates. The majority of these vertebrates can be classified as fish. This includes jawless species of fish and cartilaginous fishes. (Those are fish with skeletons made of cartilage, the same material that makes up your nose.). Fish are almost always ectothermic. There are about 100 species of jawless fish, which can be placed into one of two groups – the lampreys and the hagfish. Interestingly, although these fish do belong to the vertebrate subphylum, they do not technically have vertebrae."}, {"url": "https://en.wikipedia.org/wiki/Vertebrate", "passage_text": "The vertebrates traditionally include the hagfish, which do not have proper vertebrae, though their closest living relatives, the lampreys, do. Hagfish do, however, possess a cranium. For this reason, the vertebrate subphylum is sometimes referred to as  Craniata  when discussing morphology. Molecular analysis since 1992 has suggested that the hagfish are most closely related to lampreys, and so also are vertebrates in a monophyletic sense."}, {"url": "http://anthro.palomar.edu/animal/animal_4.htm", "passage_text": "Three of the vertebrate classes are fish. The most primitive of these is Agnatha. It consists of jawless fish that do not have scales. These are the lampreys and hagfish. Fish that have skeletons consisting of hard rubber-like cartilage rather than bone are members of the class Chondrichthyes. These are the sharks and rays."}, {"url": "http://animals.about.com/od/evolution/a/vertebrateevolu.htm", "passage_text": "Jawless Fish (Agnatha). The first vertebrates were the jawless fish. These fish-like animals had hard bony plates that covered their bodies and as their name implies, they did not have jaws. Additionally, these early fish did not have paired fins. By Laura Klappenbach. Vertebrates are a well-known group of animals that includes mammals, birds, reptiles, amphibians, and fish. The defining characteristic of vertebrates is their backbone, an anatomical feature that first appeared in the fossil record about 500 million years ago, during the Ordovician period."}, {"url": "https://en.wikipedia.org/wiki/Agnatha", "passage_text": "Hagfish are considered members of the subphylum Vertebrata, because they secondarily lost vertebrae; before this event was inferred from molecular and developmental data, the group Craniata was created by Linnaeus (and is still sometimes used as a strictly morphological descriptor) to reference hagfish plus vertebrates. The Agnatha are ectothermic or cold blooded, with a cartilaginous skeleton, and the heart contains 2 chambers."}, {"url": "http://www.sciencelearningspace.com/2011/09/jawless-fish/", "passage_text": "The group agnatha, also known as the jawless fish, make up one group of fishes. There are about 100 species of jawless fish, which can be placed into one of two groups – the lampreys and the hagfish. Interestingly, although these fish do belong to the vertebrate subphylum, they do not technically have vertebrae."}, {"url": "https://en.wikipedia.org/wiki/Agnatha", "passage_text": "Agnatha (Greek, no jaws) is a superclass of jawless fish in the phylum Chordata, subphylum Vertebrata, consisting of both present (cyclostomes) and extinct (conodonts and ostracoderms) species. The Agnatha are ectothermic or cold blooded, with a cartilaginous skeleton, and the heart contains 2 chambers."}]