[{"url": "http://culturalstudiesnow.blogspot.com/2011/11/abdul-janmuhamed-economy-of-manichean.html", "passage_text": "Abdul JanMuhamed / The Economy of Manichean Allegory: The function of Racial Difference in Colonial Literature – summary part 1 - 2. In The Economy of Manichean Allegory: The function of Racial Difference in Colonial Literature. JanMuhamed's central claim is that every writer from the former colonies which seeks to tell the story of his marginalized community to the cultural center will have a difficult task on his hands. The difficulty, JanMuhamed holds, is in locating the postcolonial subject in the center of a literary text."}, {"url": "http://rlwclarke.net/courses/LITS3303/2005-2006/12CJanMohamedEconomyofManicheanAllegory.pdf", "passage_text": "In descri bing the attributes and actions of the native, issues such as. intention, causality, extenuating circumstances, and so forth are completely. ignored; in the ‘imaginary’ colonialist realm, to say ‘native’ is automatically to. say ‘evil’ and to evoke immediately the economy of the manichean allegory. JanMohamed contends that colonialist literature is an. exploration and a representation of a world at the boundaries of ‘civilisation,’. a world that has no t yet b ee n do mestica ted by Eu ro pe an significatio n o r c odifie d. in detail by its ideology."}, {"url": "https://slt2013.wordpress.com/2013/02/06/the-economy-of-manichean-allegory-the-function-of-racial-difference-in-colonialist-literature-abdul-r-janmohamed/", "passage_text": "JanMohamed’s article was incredibly useful in solidifying the tropes used in colonial literature to justify exploitation of the European colonies by Europe. These tropes are what my authors are responding to and I can use them as points of entry into my poetry to explain why certain images or points needed to be made. The ultimate goal was to justify economic exploitation but what began as an ideology of “racial difference” turned into one of “moral and even metaphysical difference” (pg 80). Ultimately these economic motivations were transformed over time into what came to perceived as societal “truths”."}, {"url": "https://en.wikipedia.org/wiki/Manichaeism", "passage_text": "Manichaeism survived longer in the east than in the west, and it appears to have finally faded away after the 14th century in southern China contemporary to the decline in China of the Church of the East during the Ming Dynasty. In every language and region that Manichaeism spread to, these same deities reappear, whether it is in the original Syriac quoted by Theodore bar Konai, or the Latin terminology given by Saint Augustine from Mani's Epistola Fundamenti, or the Persian and Chinese translations found as Manichaeism spread eastward."}, {"url": "https://slt2013.wordpress.com/2013/02/06/the-economy-of-manichean-allegory-the-function-of-racial-difference-in-colonialist-literature-abdul-r-janmohamed/", "passage_text": "Images of the black African Fatou-Gaye were inconsistent: she was at times animalistic and repulsive and at other times regal and sensual. These varying images prove JanMohamed’s point of the utility of the Manichean Allegory. The ultimate goal was to justify economic exploitation but what began as an ideology of “racial difference” turned into one of “moral and even metaphysical difference” (pg 80). Ultimately these economic motivations were transformed over time into what came to perceived as societal “truths”."}, {"url": "https://en.wikipedia.org/wiki/Manichaeism", "passage_text": "216–276 AD) in the Sasanian Empire. Manichaeism taught an elaborate dualistic cosmology describing the struggle between a good, spiritual world of light, and an evil, material world of darkness. In every language and region that Manichaeism spread to, these same deities reappear, whether it is in the original Syriac quoted by Theodore bar Konai, or the Latin terminology given by Saint Augustine from Mani's Epistola Fundamenti, or the Persian and Chinese translations found as Manichaeism spread eastward."}, {"url": "https://slt2013.wordpress.com/2013/02/06/the-economy-of-manichean-allegory-the-function-of-racial-difference-in-colonialist-literature-abdul-r-janmohamed/", "passage_text": "His argument is a little different however, and he claims that in colonial literature the tropes themselves aren’t essential; in fact, they are contradictory and ambiguous. What is the constant is the presence of the Manichean allegory, which is what creates stereotypes (pg 87). This, I think, is true especially in the books that I read with the French Senior Major Seminar on the Second French Colonial Empire. The ultimate goal was to justify economic exploitation but what began as an ideology of “racial difference” turned into one of “moral and even metaphysical difference” (pg 80). Ultimately these economic motivations were transformed over time into what came to perceived as societal “truths”."}, {"url": "https://en.wikipedia.org/wiki/Manichaeism", "passage_text": "The founder of Manichaeism had employed Syriac (his own language) as his medium, but conveniently he had written at least one book in Middle Persian, and it is likely that he himself had arranged for the translation of some or all of his numerous writings from Syriac into Middle Persian. In every language and region that Manichaeism spread to, these same deities reappear, whether it is in the original Syriac quoted by Theodore bar Konai, or the Latin terminology given by Saint Augustine from Mani's Epistola Fundamenti, or the Persian and Chinese translations found as Manichaeism spread eastward."}, {"url": "http://rlwclarke.net/courses/LITS3303/2005-2006/12CJanMohamedEconomyofManicheanAllegory.pdf", "passage_text": "The “manic hean allegory” (80) is the“central trope” (80) of an entire colonialist “economy” (80) of representation that is based o n a trans formati on of racial diff eren ce in to moral and even met aphys ic aldifference. JanMohamed contends that colonialist literature is an. exploration and a representation of a world at the boundaries of ‘civilisation,’. a world that has no t yet b ee n do mestica ted by Eu ro pe an significatio n o r c odifie d. in detail by its ideology."}, {"url": "http://www.jstor.org/stable/1343462", "passage_text": "The novel does justice to the themes of a liberal's complicity with fascism, his subsequent sense of guilt, and, most important, the function of manichean polarity within the empire; it shows without any hesitation that the empire projects its own barbarism onto the Other beyond its borders. The lama feels that the whole phenomenal world is an illusion and that everyone is deceived by the shadow of appearance (K, p. 286), but Kipling is gently mocking him: he is entirely blind to the fact that his unique disciple is a spy and is using him to thwart the foreign agents."}]