[{"url": "http://arweb.sdsu.edu/es/admissions/costs.html", "passage_text": "*** Plan for additional expenses that will increase your cost of attendance. For undergraduates, we estimate the average annual cost of books and supplies to be $1,804, transportation to be $1,454, and personal expenses to be $1,392. If these amounts match your personal situation, then you would add them to the overall cost of attendance listed above."}, {"url": "http://www.collegecalc.org/colleges/california/san-diego-state-university/", "passage_text": "Annual Total Cost. The total list price for in-state California residents to go to San Diego State University is $23,373 for the 2014/2015 academic year. Out-of-state students who don't possess California residence can expect a one year cost of $34,533. San Diego State University tuition is $5,472 per year for in-state residents. This is 15% cheaper than the national average public four year tuition of $6,429."}, {"url": "http://go.sdsu.edu/student_affairs/financialaid/costofattendance.aspx", "passage_text": "Cost of Attendance (COA) is the estimated cost to attend SDSU during the 9-month academic year. While your individual costs may vary, the COA reflects a modest, adequate living allowance. Your individual circumstances, discretionary expenses, or spending styles may not be the same as the standard COA. Changes in mandatory systemwide fees will be made in accordance with the requirements of the Working Families Student Fee Transparency and Accountability Act (Sections 66028 - 66028.6 of the Education Code)."}, {"url": "http://go.sdsu.edu/student_affairs/financialaid/costofattendance.aspx", "passage_text": "Cost of Attendance. The California State University (CSU) makes every effort to keep student costs to a minimum. Fees listed in published schedules or student accounts may need to be increased when public funding is inadequate. Changes in mandatory systemwide fees will be made in accordance with the requirements of the Working Families Student Fee Transparency and Accountability Act (Sections 66028 - 66028.6 of the Education Code)."}, {"url": "http://go.sdsu.edu/student_affairs/financialaid/coatables.aspx", "passage_text": "Cost of Attendance Tables. The California State University (CSU) makes every effort to keep student costs to a minimum. Fees listed in published schedules or student accounts may need to be increased when public funding is inadequate. Official university tuition and fees can be found on the Student Account Services website. Amounts in the cost tables are shown are for full-time enrollment for the 9-month academic year. Less than full-time enrollment may change your award amount."}, {"url": "http://go.sdsu.edu/student_affairs/financialaid/costofattendance.aspx", "passage_text": "1 Cost of attendance (table layout): Review the estimated cost to attend SDSU for an academic year for undergraduate, out-of-state, graduate, and teaching credential students. Changes in mandatory systemwide fees will be made in accordance with the requirements of the Working Families Student Fee Transparency and Accountability Act (Sections 66028 - 66028.6 of the Education Code)."}, {"url": "http://arweb.sdsu.edu/es/admissions/costs.html", "passage_text": "** Nonresident tuition is based on 9 units each semester at $372 per unit. *** Plan for additional expenses that will increase your cost of attendance. For graduate students, we estimate the average annual cost of books and supplies to be $1,804; transportation to be $2,120, and personal expenses to be $1,392. If these amounts match your personal situation, then you would add them to the overall cost of attendance listed above. For undergraduates, we estimate the average annual cost of books and supplies to be $1,804, transportation to be $1,454"}, {"url": "http://bfa.sdsu.edu/fm/co/sfs/studentfees.html", "passage_text": "The CSU makes every effort to keep student costs to a minimum. Tuition and Fees listed in published schedules or student accounts may need to be increased when public funding is inadequate. Tuition and fees paid during a semester may include Basic Tuition, mandatory campus fees, Nonresident Tuition, Professional Program fees, Course fees and Parking fees. Other miscellaneous fees may be charged to a student during their time here at SDSU."}, {"url": "http://www.collegecalc.org/colleges/california/san-diego-state-university/", "passage_text": "Undergraduate Tuition. San Diego State University tuition is $5,472 per year for in-state residents. This is 15% cheaper than the national average public four year tuition of $6,429. The cost is $15,162 and 73% cheaper than the average California tuition of $20,634 for 4 year colleges. Tuition ranks 19th in California amongst 4 year colleges for affordability and is the 163rd most expensive 4 year college in the state. San Diego State University tuition is $5,472 per year for in-state residents. This is 15% cheaper than the national average public four year tuition of $6,429"}]