[{"url": "https://en.wikipedia.org/wiki/Progressive_Era", "passage_text": "The Progressive Era was a period of widespread social activism and political reform across the United States, from the 1890s to 1920s. The main objective of the Progressive movement was eliminating corruption in government. The movement primarily targeted political machines and their bosses. By taking down these corrupt representatives in office a further means of direct democracy would be established. As part of this tradition of maternal activism, the Progressive-era General Federation supported a range of causes from the pure food and drug administration to public health care for mothers and children to a ban on child labor, each of which looked to the state to help implement their vision of social justice."}, {"url": "http://www.georgiaencyclopedia.org/articles/history-archaeology/progressive-era", "passage_text": "The Progressive. Era refers to a period of varied reforms that took place throughout the United States over the first two decades of the twentieth century."}, {"url": "http://www.georgiaencyclopedia.org/articles/history-archaeology/progressive-era", "passage_text": "Progressive-era reform in Georgia was a modest but important first step in that direction. Progressivism was the first of several major reform movements, and it shared with those later efforts an agenda of social justice, expanded economic opportunity, efficiency in government, and moral reform. Era refers to a period of varied reforms that took place throughout the United States over the first two decades of the twentieth century."}, {"url": "https://en.wikipedia.org/wiki/Progressivism", "passage_text": "In America, progressivism began as a social movement in the late 19th and early 20th centuries and grew into a political movement, in what was known as the Progressive Era. American President Theodore Roosevelt of the US Republican Party and later the US Progressive Party declared that he always believed that wise progressivism and wise conservatism go hand in hand. American President Woodrow Wilson was also a member of the American progressive movement within the Democratic Party."}, {"url": "http://www.yourdictionary.com/progressive-movement", "passage_text": "Goals of the Progressive Movement. 1  To extinguish corruption in the government and its strong influence. 2  To have more people active in the political process. 3  To establish that the government has the obligation to ensure fair economic practices and to help solve social problems. 1 To establish that the government has the obligation to ensure fair economic practices and to help solve social problems. 2  To get rid of the political power of local bosses, get votes for women, establish income tax, and make changes in the way senators were put into office."}, {"url": "http://study.com/academy/lesson/the-muckrakers-of-the-progressive-era-definition-and-influence.html", "passage_text": "A spirit of reform marked the Progressive Era from around 1900 to 1917. It was in this spirit that muckrakers, who were influential journalists, worked to reveal injustices and oversights in society to Americans. Learn how muckrakers raised awareness of America's social, economic and political problems. In summary, during the Progressive Era, which lasted from around 1900 to 1917, muckraking journalists successfully exposed America's problems brought on by rapid industrialization and growth of cities."}, {"url": "https://en.wikipedia.org/wiki/Progressivism", "passage_text": "Progressivism became highly significant during the Age of Enlightenment in Europe, out of the belief that Europe was demonstrating that societies could progress in civility from barbaric conditions to civilization through strengthening the basis of empirical knowledge as the foundation of society. American President Theodore Roosevelt of the US Republican Party and later the US Progressive Party declared that he always believed that wise progressivism and wise conservatism go hand in hand. American President Woodrow Wilson was also a member of the American progressive movement within the Democratic Party."}, {"url": "http://www.yourdictionary.com/progressive-movement", "passage_text": "LINK / CITE ADD TO WORD LIST. noun. The definition of a progressive movement is a political force that wants reform in all levels of government, theology, education, industry, medicine, insurance, and finance. 1 To establish that the government has the obligation to ensure fair economic practices and to help solve social problems. 2  To get rid of the political power of local bosses, get votes for women, establish income tax, and make changes in the way senators were put into office."}, {"url": "http://study.com/academy/lesson/what-is-progressivism-definition-history-goals.html", "passage_text": "As an idea, Progressivism generally refers to the belief that government or people acting on its behalf can be used to address social problems, inequalities, or inequities facing the nation. As a political term, the Progressive Party was born in 1912 in light of this idea. The Progressive movement lost a great deal of momentum after World War I, but the impact of Progressivism was undeniable: 1  Political reform (initiative, referendum, recall installed in all but 3 states by 1917)."}, {"url": "https://en.wikipedia.org/wiki/Progressive_Era", "passage_text": "In the 1940s typically historians saw the Progressive Era as a prelude to the New Deal and dated it from 1901 (when Roosevelt became president) to the start of World War I in 1914 or 1917. As part of this tradition of maternal activism, the Progressive-era General Federation supported a range of causes from the pure food and drug administration to public health care for mothers and children to a ban on child labor, each of which looked to the state to help implement their vision of social justice."}]