[{"url": "http://yourbusiness.azcentral.com/6-strategic-business-objectives-6372.html", "passage_text": "Gross Margin Objectives. Similar to efficiency gains, many companies seek to maximize their gross margins. Instead of reducing any cost, gross margin reductions seek to re-engineer the basic process of producing or sourcing the product the company sells. Product Mix Objectives. Based on company positioning, companies set product objectives as well. For example, many companies try to move into high-margin businesses so that they can increase their net income."}, {"url": "http://smallbusiness.chron.com/purpose-strategic-objectives-78251.html", "passage_text": "Create Company Unity. Good strategic objectives -- that is, those that are specific, measurable and have a deadline attached -- unify the activities of everyone throughout a small business. To reach the rarified air of success, a business must use objectives as steps. BananaStock/BananaStock/Getty Images. At their broadest, strategic objectives serve an organization’s ambition. A company’s ambition is found in its mission and vision statements."}, {"url": "http://work911.com/planningmaster/faq/indexgoals.htm", "passage_text": "Understanding Strategic Goals, Objectives and Business Goals. In strategic planning all parts of the process are important, but perhaps the most important part involves developing your strategic, corporate goals, objectives and business goals. "}, {"url": "http://www.ehow.com/info_8599852_purpose-strategic-objectives.html", "passage_text": "Applying Strategic Plans. Strategic objectives provide a means to apply the strategic plans made by an organization, helping make reality out of what was before only plans. Strategic objectives put into motion the concepts and ideals contained in an organization’s mission statement. While the mission statement provides direction for an organization, strategic objectives provide a way to measure the organization’s progress toward realizing the ideals listed in the mission statement. Other People Are Reading."}, {"url": "http://www.idealist.org/info/Nonprofits/Mgmt2", "passage_text": "Strategic planning – the basic idea. From the Support Center for Nonprofit Management in San Francisco. (see note at end). Strategic planning can be used to determine mission, vision, values, goals, objectives, roles and responsibilities, timelines, etc. "}, {"url": "http://searchcio.techtarget.com/definition/strategic-planning", "passage_text": "BMC Numara Track-It! Strategic planning is a review and planning process that is undertaken to make thoughtful decisions about an organization’s future in order to ensure its success. You also agree that your personal information may be transferred and processed in the United States, and that you have read and agree to the Terms of Use and the Privacy Policy. Strategic planning involves clearly defining the organization's mission and an assessment of its current state and competitive landscape."}, {"url": "http://www.leoisaac.com/planning/strat027.htm", "passage_text": "Objectives. There is often much confusion between goals and objectives. Whereas as a goal is a description of a destination, an objective is a measure of the progress that is needed to get to the destination. The following table serves to illustrate the difference between goals and objectives."}, {"url": "http://www.businessdictionary.com/definition/strategic-planning.html", "passage_text": "strategic planning. A systematic process of envisioning a desired future, and translating this vision into broadly defined goals or objectives and a sequence of steps to achieve them. "}, {"url": "http://smallbusiness.chron.com/difference-between-strategic-operational-objectives-24572.html", "passage_text": "Important Differences. The most important difference between a strategic and an operational objective is its time frame; operational objectives are short-term goals, while strategic objectives are longer-term goals. "}]