[{"url": "http://animals.mom.me/long-duck-hatch-11266.html", "passage_text": "In an incubator, a duck egg loses 14 percent of its weight from water loss. The air cell in the egg enlarges to take up a third of the shell. The egg's weight and the size of its air cell are the main ways to tell if the egg is near the end of its incubation period. The incubation period varies by species and generally takes about a month. When the ducklings begin to crack through their shells at the end of the incubation period, they should all hatch within 24 to 48 hours. Some eggs may fail to hatch."}, {"url": "http://www.answers.com/Q/How_long_is_the_incubation_period_for_a_duck", "passage_text": "What temperature for duck egg incubation period?   99.5 degrees Fahrenheit (37.5 degrees Celsius) is optimum incubating temp. for duck eggs with the temp. being lowered by one degree to 98.5 in the last 3 days of incubat … ion (25-28th day). Lowest temp. It's 28 days for all domestic ducks except Muscovies, who are 35 days. Muscovies, at least, sit undisturbed for 24 hours when commencing the sit. If you have other duck eggs that you want to add to the Muscovy's clutch, wait a week and make sure the eggs are warm when you slip them under."}, {"url": "http://www.ehow.com/about_5074884_incubation-period-duck-eggs.html", "passage_text": "Expert Insight. Duck embryo development can be put on hold for about a week prior to incubation by keeping the eggs at 55-60 F (13-15 C). Embryo development does not begin until the egg is warmed to the correct temperature. The incubation period begins once the egg reaches the proper temperature of 99.5 F (37.5 C). 04-07-08 © Bimarto sasri. To incubate means to maintain a set temperature. Incubation of a duck egg is the time period between when the egg is warmed to the correct temperature after laying and when it hatches. Incubation is the period of development of the embryonic duck inside the egg."}, {"url": "http://www.moosemanorfarms.com/about-muscovy-ducks.html", "passage_text": "Since Muscovy are genetically disimilar to other domestic waterfowl, many folks believe that they're more of a goose than a duck. For instance, they eat grass, as do geese, have a similarly long egg incubation period of 35 days (compared with 28 days for ducks), and they don't quack. This is a good trait since they are quiet ducks. The male has a low breathy call, and the female a quiet trilling coo. Muscovy ducks are great mothers and do a good job raising their young. Muscovy take longer to hatch than other poultry... an egg takes 33 to 35 days to hatch. A chicken, for example, hatches in 21 days. Muscovy meat is one of the healthiest meats on the market today, being 98% or greater fat free."}, {"url": "http://www.duckhealth.com/hatcduck.html", "passage_text": "Natural Incubation. Duck eggs may be hatched naturally by placing them under a broody duck or even a broody chicken hen. Muscovy ducks are very good setters, capable of hatching 12-15 duck eggs. The nest box should be located in a clean dry shelter, bedded with suitable litter. Since duck eggs are larger than chicken eggs, setting trays must be designed to accommodate their larger size. Eggs from common ducks like Pekins require 28 days to hatch. Eggs from Muscovy ducks hatch in about 35 days after setting. When larger numbers of duck eggs are to be hatched, large commercial incubators (setters) and hatchers are normally used"}, {"url": "https://ahdc.vet.cornell.edu/Sects/duck/hatching.cfm", "passage_text": "Common duck eggs should lose about 14% of their weight at time of setting by 25 days. Natural Incubation. Duck eggs may be hatched naturally by placing them under a broody duck or even a broody chicken hen. Muscovy ducks are very good setters, capable of hatching 12-15 duck eggs. The nest box should be located in a clean dry shelter, bedded with suitable litter. "}, {"url": "http://www.backyardchickens.com/t/42774/incubating-muscovy-duck-eggs-questions", "passage_text": "They say 35-37 days for incubation, 99.5 degrees for temp, and 84-86% humidity (wet bulb?),stop turning eggs on day 31, temp during last 3 days of inc. 98.5 F, and humidity during last 3 days to be 90-94% for Muscovy Ducks. Hope you can get the humidity issue worked out. "}, {"url": "http://farmingfriends.com/incubating-muscovy-duck-eggs/", "passage_text": "Incubation Period. The incubation period for Muscovy duck eggs is 35-37 days. Incubation Temperature. The temperature in the incubator for Muscovy duck eggs is 99.5 degrees fahrenheit. Humidity Levels. The humidity level (wet bulb thermometer) for Muscovy duck eggs is 84-88 degrees fahrenheit. Final Day Of Egg Rotation. The final day of egg rotation for Muscovy duck eggs is day 31."}, {"url": "http://animals.mom.me/long-duck-hatch-11266.html", "passage_text": "The one exception is Muscovy ducks. These ducks have bumpy red faces and are white, black or a mix of white and black. This breed takes 35 days from the beginning of incubation to hatch. Muscovy hens can hatch 12 to 15 eggs, including eggs from other mothers added to her clutch. Domestic ducks are of two main types, the Muscovy and ducks breeds descended from mallards. The incubation period varies by species and generally takes about a month. When the ducklings begin to crack through their shells at the end of the incubation period, they should all hatch within 24 to 48 hours. Some eggs may fail to hatch."}]