[{"url": "https://en.wikipedia.org/wiki/Brown_rat", "passage_text": "One of the largest muroids, it is a brown or grey rodent with a body up to 25 cm (10 in) long, and a similar tail length; the male weighs on average 350 g (12 oz) and the female 250 g (9 oz). The brown rat can breed throughout the year if conditions are suitable, with a female producing up to five litters a year. The gestation period is only 21 days, and litters can number up to 14, although seven is common. They reach sexual maturity in about five weeks."}, {"url": "https://en.wikipedia.org/wiki/Rat", "passage_text": "The best-known rat species are the black rat (Rattus rattus) and the brown rat (Rattus norvegicus). The group is generally known as the Old World rats or true rats, and originated in Asia. Rats are bigger than most Old World mice, which are their relatives, but seldom weigh over 500 grams (1.1 lb) in the wild. Rats such as the bandicoot rat (Bandicota bengalensis) are murine rodents related to true rats, but are not members of the genus Rattus. Male rats are called bucks, unmated females are called does, pregnant or parent females are called dams, and infants are called kittens or pups."}, {"url": "http://a-z-animals.com/animals/rat/", "passage_text": "The two most common species of rat are the black rat and the brown rat. Both species of rat are found in all parts of the world. The rat is generally found in small, dark places and is thought to have originated in Asia before migrating across countries and being accidental passengers on human voyages. The rat is now one of the most widely spread and adaptable animals in the world. The most distinctive difference between rats and mice is their size. Rats tend to be much larger than mice and it is because of this that new rodent species that are discovered are easily classified as rats or mice. In the wild, rats are preyed upon by many different animals including snakes, wildcats and birds of prey."}, {"url": "https://en.wikipedia.org/wiki/Rat", "passage_text": "Rats are a common food item for snakes, both in the wild, and as pets. Adult rat snakes and ball pythons, for example, are fed a diet of mostly rats in captivity. Rats are readily available (live or frozen) to individual snake owners, as well as to pet shops and reptile zoos, from many suppliers. Rats such as the bandicoot rat (Bandicota bengalensis) are murine rodents related to true rats, but are not members of the genus Rattus. Male rats are called bucks, unmated females are called does, pregnant or parent females are called dams, and infants are called kittens or pups."}, {"url": "https://en.wikipedia.org/wiki/Brown_rat", "passage_text": "The brown rat, also referred to as common rat, street rat, sewer rat, Hanover rat, Norway rat, brown Norway rat, Norwegian rat, or wharf rat (Rattus norvegicus) is one of the best known and most common rats. The brown rat can breed throughout the year if conditions are suitable, with a female producing up to five litters a year. The gestation period is only 21 days, and litters can number up to 14, although seven is common. They reach sexual maturity in about five weeks."}, {"url": "http://www.yourdictionary.com/rat", "passage_text": "verb. A grey rat. A grey rat. The definition of a rat is a rodent with a lengthy tail, or is slang for a sneaky person. 1  An example of a rat is a roof rat. 2  An example of a rat is a person who plays mean tricks on his coworkers. (plural rats). ( 1 zoology) A medium-sized rodent belonging to the genus Rattus. ( 2 informal) A term indiscriminately applied to numerous members of several rodent families (e.g. voles and mice) having bodies longer than about 12 cm, or 5 inches. ( 3 informal) A person who is known for betrayal; a scoundrel; a quisling."}, {"url": "http://searchsecurity.techtarget.com/definition/RAT-remote-access-Trojan", "passage_text": "A remote access Trojan (RAT) is a malware program that includes a back door for administrative control over the target computer. RATs are usually downloaded invisibly with a user-requested program -- such as a game -- or sent as an email attachment. "}, {"url": "http://www.merriam-webster.com/dictionary/rat", "passage_text": "Full Definition of RAT. 1. a: any of numerous rodents (Rattus and related genera) differing from the related mice especially by considerably larger size b: any of various similar rodents. 2. : a contemptible person: as a: one who betrays or deserts friends or associates b: scab 3b c: informer 2. 3. Full Definition of RAT. intransitive verb. 1. : to betray, desert, or inform on one's associates —usually used with on. 2. : to catch or hunt rats. 3. : to work as a scab. "}, {"url": "https://en.wikipedia.org/wiki/Rat", "passage_text": "The term rat is also used in the names of other small mammals which are not true rats. Examples include the North American pack rats, a number of species loosely called kangaroo rats, and others. Rats such as the bandicoot rat (Bandicota bengalensis) are murine rodents related to true rats, but are not members of the genus Rattus. Male rats are called bucks, unmated females are called does, pregnant or parent females are called dams, and infants are called kittens or pups."}, {"url": "https://en.wikipedia.org/wiki/Rat", "passage_text": "Rat meat is a food that, while taboo in some cultures, is a dietary staple in others. Taboos include fears of disease or religious prohibition, but in many places, the high number of rats has led to their incorporation into the local diets. Rats such as the bandicoot rat (Bandicota bengalensis) are murine rodents related to true rats, but are not members of the genus Rattus. Male rats are called bucks, unmated females are called does, pregnant or parent females are called dams, and infants are called kittens or pups."}]