[{"url": "http://hotmath.com/hotmath_help/topics/areas-of-regular-polygons.html", "passage_text": "Apothem. The apothem of a regular polygon is a segment drawn the center of the polygon (that is, the center of the circle which circumscribes the polygon) to one side, such that it is perpendicular to the side. If a regular polygon has an area of A square units, a perimeter of P units, an apothem of a units, then the area is one-half the product of the perimeter and the apothem. Be careful with this formula, though: for a given apothem, there is only ONE POSSIBLE value of P."}, {"url": "http://www.vitutor.com/geometry/plane/apothem.html", "passage_text": "Apothems. The apothem of a regular polygon is the distance from the center to the midpoint of one of its sides. The apothem of a square is equal to half of the length of one side. "}, {"url": "http://mathopenref.com/apothem.html", "passage_text": "Apothem of a Regular Polygon. Definition: A line segment from the center of a regular polygon to the midpoint of a side. Try this Adjust the polygon below by dragging any orange dot, or alter the number of sides. Note the behavior of the apothem line shown in blue. The word apothem can refer to the line itself, or the length of that line. So you can correctly say 'draw the apothem' and 'the apothem is 4cm'. Each formula below shows how to find the length of the apothem of a regular polygon. Use the formula that uses the facts you are given to start."}, {"url": "http://www.mathsisfun.com/definitions/apothem.html", "passage_text": "more ... The distance from the center of a regular polygon to the midpoint of a side. (For a circle it is the distance from the center to the midpoint of a chord.). Regular Polygons-Properties."}, {"url": "http://mathopenref.com/apothem.html", "passage_text": "The apothem is also the radius of the incircle of the polygon. For a polygon of n sides, there are n possible apothems, all the same length of course. The word apothem can refer to the line itself, or the length of that line. So you can correctly say 'draw the apothem' and 'the apothem is 4cm'. Each formula below shows how to find the length of the apothem of a regular polygon. Use the formula that uses the facts you are given to start."}, {"url": "https://en.wikipedia.org/wiki/Apothem", "passage_text": "Apothem of a hexagon. The apothem of a regular polygon is a line segment from the center to the midpoint of one of its sides. Equivalently, it is the line drawn from the center of the polygon that is perpendicular to one of its sides. The word apothem can also refer to the length of that line segment. Because of this, all the apothems in a polygon will be congruent. For a regular pyramid, which is a pyramid whose base is a regular polygon, the apothem is the slant height of a lateral face; that is, the shortest distance from apex to base on a given face."}, {"url": "https://en.wikipedia.org/wiki/Apothem", "passage_text": "For an equilateral triangle, the apothem is equivalent to the line segment from the midpoint of a side to any of the triangle's centers, since an equilateral triangle's centers coincide as a consequence of the definition. Because of this, all the apothems in a polygon will be congruent. For a regular pyramid, which is a pyramid whose base is a regular polygon, the apothem is the slant height of a lateral face; that is, the shortest distance from apex to base on a given face."}, {"url": "http://mathworld.wolfram.com/Apothem.html", "passage_text": "Given a circle, the apothem is the perpendicular distance from the midpoint of a chord to the circle 's center. It is also equal to the radius minus the sagitta, For a regular polygon, the apothem simply is the distance from the center to a side, i.e., the inradius of the polygon. SEE ALSO: Chord, Circular Sector, Circular Segment, Inradius, Radius, Regular Polygon, Sagitta CITE THIS AS: Weisstein, Eric W. Apothem.. From MathWorld --A Wolfram Web Resource."}, {"url": "http://math.tutorvista.com/geometry/apothem.html", "passage_text": "Apothem is a line segment from the center of a regular polygon to the midpoint of a side. Its also defined as radius of the incircle of the polygon. For a regular polygon of n sides, there are n possible apothems of same length. If we assume a right angled triangle where the apothem is the adjacent side, half the side of the polygon to be the opposite side and line joining the centre of the polygon and vertex of the polygon to be the hypotenuse. Lets assume the angle formed by adjacent side and hypotenuse to be $\\theta$."}]