[{"url": "http://lotr.wikia.com/wiki/Peregrin_Took", "passage_text": "Biography. Pippin was born to Paladin Took II and Pearl Took on the spring of TA 2990 (SR 1390). He was the youngest of four children and had three older sisters, Pearl, Pimpernel, and Pervinca. His father's sister, Esmeralda Took, was the mother of Meriadoc Brandybuck, thus making Pippin and Merry first cousins. The Lord of the Rings film trilogy. In the Lord of the Rings film triloft, Pippin is played by Billy Boyd, who is the oldest of the actors portraying the four protagonist Hobbits (Elijah Wood, who plays Frodo, is the youngest). Pippin's foolish acts are mainly for comedic relief"}, {"url": "https://en.wikipedia.org/wiki/Pippin_(musical)", "passage_text": "They reveal that the boy who is to play the prince, named Pippin, is a new actor. Pippin talks to scholars of his dreams to find where he belongs ( Corner of the Sky ), and they happily applaud Pippin on his ambitious quest for an extraordinary life. Pippin is a Tony Award-winning musical with music and lyrics by Stephen Schwartz and a book by Roger O. Hirson. Bob Fosse, who directed the original Broadway production, also contributed to the libretto"}, {"url": "http://www.imdb.com/name/nm0101710/", "passage_text": "Actor | Soundtrack | Producer. Billy Boyd was born in 1968 in Glasgow, Scotland, to Mary and William Boyd. The talented young boy, inspired by Star Wars to try acting, got his first taste of it in his school's production of Oliver Twist when he was 10. Boyd's parents were extremely supportive, driving over two hours to get him to the performances, but sadly they passed away when... See full bio »."}, {"url": "http://www.allmusic.com/album/pippin-1972-original-broadway-cast-mw0000016674", "passage_text": "In the musical, Pippin (played by John Rubinstein) is a young man who is seeking meaning in life, not unlike the generation that came of age in the 1960s, of which Schwartz was a member, and not unlike the Jesus of Godspell. Following the success of his off-Broadway musical Godspell and his collaboration with Leonard Bernstein on Mass, songwriter Stephen Schwartz made his Broadway debut with Pippin, which he had actually begun writing in college."}, {"url": "https://en.wikipedia.org/wiki/Pippin_(musical)", "passage_text": "In 1981, a stage production of Pippin was videotaped for Canadian television. The stage production was directed by Kathryn Doby, Bob Fosse 's dance captain for the original Broadway production, and David Sheehan directed the video adaptation, with Roger O. Hirson in charge of the music. Pippin is a Tony Award-winning musical with music and lyrics by Stephen Schwartz and a book by Roger O. Hirson. Bob Fosse, who directed the original Broadway production, also contributed to the libretto"}, {"url": "https://en.wikipedia.org/wiki/Billy_Boyd_(actor)", "passage_text": "Billy Boyd (born 28 August 1968) is a Scottish actor and singer most widely known for playing the characters Peregrin Pippin Took in Peter Jackson 's epic film trilogy The Lord of the Rings (2001–2003), Barret Bonden in Master and Commander: The Far Side of the World (2003), and Glen in Seed of Chucky (2004). Early life [edit]. Boyd was born in Glasgow, Scotland to William and Mary Boyd, who both died a year apart when Boyd was in his early teens. He was brought up, along with his elder sister Margaret, by their grandmother. In 1984, at the age of 16, he appeared in local musical company Theatre Guild, Glasgow 's production of Hans Andersen"}]