[{"url": "http://www.accountingtools.com/questions-and-answers/total-cost-formula.html", "passage_text": "(Average fixed cost + Average variable cost) x Number of units = Total cost. For example, a company is incurring $10,000 of fixed costs to produce 1,000 units (for an average fixed cost per unit of $10), and its variable cost per unit is $3. At the 1,000-unit production level, the total cost of the production is:"}, {"url": "http://www.double-entry-bookkeeping.com/costing/fixed-cost-per-unit/", "passage_text": "Fixed Cost per Unit at 3,000 units. The fixed costs remain at £120,000 and the fixed cost per unit = 120,000 / 3,000 = £40 per unit. The total cost of a unit at this level of activity is £86 + £40 = £126. Operating at a markup on cost of 40% the selling price would need to be £126 x 140% = £176.40."}, {"url": "http://www.double-entry-bookkeeping.com/costing/fixed-cost-per-unit/", "passage_text": "Fixed cost per unit is calculated by dividing the total fixed costs of business by the number of units. A business has £86 per unit in variable costs and £120,000 per year in fixed costs. The business operates at a markup of 40%. What is the selling price when demand and production is 1,000 units and 3,000 units."}, {"url": "http://www.accountingtools.com/questions-and-answers/how-to-calculate-cost-per-unit.html", "passage_text": "The cost per unit is commonly derived when a company produces a large number of identical products. The cost is derived from the variable costs and fixed costs incurred by a production process, divided by the number of units produced."}, {"url": "http://www.accountingtools.com/questions-and-answers/how-to-calculate-cost-per-unit.html", "passage_text": "(Total fixed costs + Total variable costs) / Total units produced. The cost per unit should decline as the number of units produced increases, primarily because the total fixed costs will be spread over a larger number of units (subject to the step costing issue noted above). Thus, the cost per unit is not constant. For example, ABC Company has total variable costs of $50,000 and total fixed costs of $30,000 in May, which it incurred while producing 10,000 widgets. The cost per unit is: ($30,000 Fixed costs + $50,000 variable costs) / 10,000 units = $8 cost per unit."}]