[{"url": "http://disney.wikia.com/wiki/Kylo_Ren", "passage_text": "33,309 pages on this wiki. Kylo Ren is the primary antagonist of the upcoming film Star Wars Episode VII: The Force Awakens. He is a member of the First Order and the Knights of Ren, and wields a unique crossguard lightsaber that he constructed himself."}, {"url": "http://www.imdb.com/character/ch0496138/bio", "passage_text": "Kylo Ren is the primary antagonist in the upcoming film Star Wars Episode VII: The Force Awakens. Behind the Scenes Early iterations of Kylo Ren's character design portrayed him as a cyborg who had multiple cybernetic implants to replace parts of his face, arms, and overall body."}, {"url": "http://starwars.wikia.com/wiki/Kylo_Ren", "passage_text": "―Kylo Ren. The individual who came to be known as Kylo Ren was born some time after the Battle of Endor. As an adult, approximately thirty years later, he had become a follower of the dark side of the Force and a member of the Knights of Ren, taking on Ren as a surname."}, {"url": "http://www.ign.com/wikis/star-wars/Kylo_Ren", "passage_text": "Unknown. Kylo Ren is a male force user and an antagonist in Star Wars: Episode VII The Force Awakens. His Lightsaber bears a crossguard, appearing more like a broadsword. But due to seeing the prop of Kylo Rens saber at the Star Wars Anniversary. It has been said the saber may not be a Lightsaber but a Forcesaber."}, {"url": "http://starwars.wikia.com/wiki/Kylo_Ren", "passage_text": "―Kylo Ren — Listen (file info). Kylo Ren was the name assumed by a male member of the Knights of Ren and an ally of the First Order approximately thirty years after the Battle of Endor."}, {"url": "http://www.ign.com/wikis/star-wars/Kylo_Ren", "passage_text": "Kylo Ren is a male force user and an antagonist in Star Wars: Episode VII The Force Awakens. His Lightsaber bears a crossguard, appearing more like a broadsword. But due to seeing the prop of Kylo Rens saber at the Star Wars Anniversary. It has been said the saber may not be a Lightsaber but a Forcesaber."}]