[{"url": "http://medical-schools.startclass.com/l/187/Campbell-University-Jerry-M-Wallace-School-of-Osteopathic-Medicine", "passage_text": "Medical School Size. There are 162 students currently enrolled at Campbell University School of Osteopathic Medicine, which is roughly 71% less than the average for all Medical Schools. new students matriculated in the most recent first-year medical school class. Campbell University School of Osteopathic Medicine offers professional medical education for a Doctor of Osteopathic Medicine (DO) degree."}, {"url": "http://osteopathic.nova.edu/do/admissions/index.html", "passage_text": "1 Minimum cumulative and science GPA of 3.0. 2  Medical College Admission Test (MCAT) with scores no more than three years old prior to the date of matriculation (entering medical school). 3  For example, applicants wanting to matriculate in August 2016, must have taken the MCAT no later than August 2013. 1 Medical College Admission Test (MCAT) with scores no more than three years old prior to the date of matriculation (entering medical school). 2  For example, applicants wanting to matriculate in August 2016, must have taken the MCAT no later than August 2013."}, {"url": "http://medical-schools.startclass.com/l/187/Campbell-University-Jerry-M-Wallace-School-of-Osteopathic-Medicine", "passage_text": "Median Incoming GPA. Lower than Average GPA. The average GPA of students admitted to Campbell University School of Osteopathic Medicine is 3.2. If a school has a noticeably lower average admitted GPA compared to other schools, you should be vigilant in assessing the school's academic curriculum. Campbell University School of Osteopathic Medicine offers professional medical education for a Doctor of Osteopathic Medicine (DO) degree."}, {"url": "http://medical-schools.startclass.com/", "passage_text": "The average GPA of students admitted to Harvard Medical School is 3.93. It will undoubtedly be more difficult to gain admission into schools with high average admitted GPA scores. Be realistic in your expectations and apply to schools accordingly. This is 5% less than the average percentage of medical students receiving some form of financial aid at all medical schools. Student Loans. 539 medical students (76%) received and took out student loans to assist in paying tuition at Harvard Medical School."}, {"url": "http://medical-schools.startclass.com/l/187/Campbell-University-Jerry-M-Wallace-School-of-Osteopathic-Medicine", "passage_text": "Of the 162 medical students enrolled at Campbell University School of Osteopathic Medicine, 138 students (85%) received some type of financial aid. This is 2% less than the average percentage of medical students receiving some form of financial aid at all medical schools. Campbell University School of Osteopathic Medicine offers professional medical education for a Doctor of Osteopathic Medicine (DO) degree."}, {"url": "https://answers.yahoo.com/question/index?qid=20110803211359AADFmbp", "passage_text": "Do DO schools (Doctor of Osteopathic Medicine) prefer low MCAT scores? I've been filling out my med school applications over the summer and really want to go to a DO school. Most of the MD schools I'm applying to have average MCAT scores of 27-33, but the DO schools I'm applying to are really low, like 23-27. I've been told by many current DO's all about what... Report Abuse. DO Schools prefer higher MCAT scores, but they're mostly left with the applicants who can't make it into regular Medical Schools. About one-third of all students accepted into DO schools were rejected from regular MD"}, {"url": "http://www.usnews.com/education/blogs/medical-school-admissions-doctor/2014/12/16/5-qustions-answers-about-attending-osteopathic-medical-school", "passage_text": "Last year, nearly 16,500 applicants vied for 5,600 first year spots. But overall, students accepted to osteopathic medical schools have lower average MCAT scores and GPAs than their allopathic counterparts. Last year’s entering class, for example, had an average MCAT score of 26 and an overall GPA of 3.4. This compares with an average MCAT of 31 and overall GPA of 3.69 for allopathic students who matriculated last year. [Find out how to show commitment on a medical school application. More than half of osteopathic medical school graduates, who may continue their training in allopathic or osteopathic residency programs, practice in primary care fields, including family practice, internal medicine and pediatrics."}, {"url": "http://www.aacom.org/become-a-doctor/us-coms", "passage_text": "Information About the 2016 Application Cycle. The American Association of Colleges of Osteopathic Medicine (AACOM) represents the 31 accredited colleges of osteopathic medicine in the United States. These colleges are accredited to deliver instruction at 44 teaching locations in 29 states. Six of the colleges are publicly controlled, 25 are private institutions. "}]