[{"url": "http://solarnavigator.net/inventors/frank_whittle.htm", "passage_text": "Sir Frank J. Whittle experimented with and constructed turbo-jet engines in pre-World War II England. In 1929 he patented a turbo-jet engine and in 1937 proved to skeptical British Air Ministry officials that a jet powered aircraft was feasible. "}, {"url": "http://www.answers.com/Q/Who_invented_the_jet_engines", "passage_text": "Hans von … Ohain is considered the designer of the first operational turbojet engine. Frank Whittle was the first to register a patent for the turbojet engine in 1930. Hans von Ohain was granted a patent for his turbojet engine in 1936. However, Hans von Ohain's jet was the first to fly in 1939. Frank Whittle's jet first flew in in 1941."}, {"url": "https://en.wikipedia.org/wiki/Jet_engine", "passage_text": "Jet engines date back to the invention of the aeolipile before the first century AD. This device directed steam power through two nozzles to cause a sphere to spin rapidly on its axis. A jet engine is a reaction engine discharging a fast moving jet that generates thrust by jet propulsion in accordance with Newton's laws of motion."}, {"url": "http://www.answers.com/Q/When_was_the_jet_engine_invented", "passage_text": "Dr. Hans von Ohain and Sir Frank Whittle are both recognized as being the co-inventors of the jet engine. Each worked separately and knew nothing of the other's work. Hans von Ohain is considered the designer of the first operational turbojet engine. Frank Whittle was the first to register a patent for the turbojet engine in 1930. Hans von Ohain was granted a patent for his turbojet engine in 1936. However, Hans von Ohain's jet was the first to fly in 1939. Frank Whittle's jet first flew in in 1941. Hans von …"}, {"url": "http://www.innovateus.net/invention/jet-engine", "passage_text": "The jet engine was invented by a couple of engineers, Sir Frank Whittle who was a Royal. Air Force Pilot and Hans von Ohain who developed the turbojet engine in the 1930s. In 1791, a. patent was filed by John Barber in England for his stationary turbine. History of the Jet Engine. Jet engines can be dated back to the first century AD when the aeolipile was invented. Hans von Ohain's jet engine got patented in 1936 and flew in 1939.He later developed the axial flow engine, which is now the standard for gas turbine engines."}, {"url": "http://www.answers.com/Q/Who_invented_the_jet_engines", "passage_text": "The answer is debatable as the modern jet engine as we know it was in development by several parties around the world at the same time.... Popular references suggest the Englishman Sir Frank Whittle invented the engine as he was the first to patent his idea, yet the German Hans Vons Ohain developed the first to fly. Frank Whittle was the first to register a patent for the turbojet engine in 1930. Hans von Ohain was granted a patent for his turbojet engine in 1936. However, Hans von Ohain's jet was the first to fly in 1939. Frank Whittle's jet first flew in in 1941."}, {"url": "https://en.wikipedia.org/wiki/Frank_Whittle", "passage_text": "A patent was submitted by Maxime Guillaume in 1921 for a similar invention; however, this was technically unfeasible at the time. Whittle's jet engines were developed some years earlier than those of Germany's Dr. Hans von Ohain who was the designer of the first jet engine to be used to actually power an aircraft. "}, {"url": "https://answers.yahoo.com/question/index?qid=20071208033912AAMtfMO", "passage_text": "Hans von Ohain is considered the designer of the first operational turbojet engine. Frank Whittle was the first to register a patent for the turbojet engine in 1930. Hans von Ohain was granted a patent for his turbojet engine in 1936. However, Hans von Ohain's jet was the first to fly in 1939. Frank Whittle's jet first flew in in 1941. Source(s): http://inventors.about.com/library/inven... 1930 Applies for a patent for the jet engine concept - a reaction motor suitable for aircraft propulsion (granted April 1931). The idea is ignored by the Air Ministry. 1931-32 Test pilot on floatplanes and flying boats 1934 Flight Lieutenant Frank Whittle sent to Cambridge University as a mature student by the RAF."}, {"url": "http://www.innovateus.net/invention/jet-engine", "passage_text": "Sir Frank Whittle who was a Royal Air Force Pilot and Hans von Ohain who developed the turbo jet engine in the 1930s. History of the Jet Engine. Jet engines can be dated back to the first century AD when the aeolipile was invented. Hans von Ohain's jet engine got patented in 1936 and flew in 1939.He later developed the axial flow engine, which is now the standard for gas turbine engines."}]