[{"url": "http://www.answers.com/Q/What_does_a_pentagram_mean", "passage_text": "The significance of the pentagram - 5-pointed star-depends on the context. By far the most common meaning is American patriotism. There are no less than 50 five-pointed star … s on the American flag, and the star is displayed on countless government and military insignias. In these modern times, the pentagram has been most associated with NeoPagans and Wiccans. In most Wiccan and Pagan rituals, its symbolic meaning is derived from Ceremonial Magic and protection. The five are the four elements ruled by the spirit."}, {"url": "http://symboldictionary.net/?p=1893", "passage_text": "The five-pointed star or pentagram is one of the most potent, powerful, and persistent symbols in human history. It has been important to almost every ancient culture, from the Mayans of Latin America, to India, China, Greece, and Egypt. "}, {"url": "http://www.angelfire.com/id/robpurvis/pentagram.html", "passage_text": "The Pentagram is a symbol of a star encased in a circle. Always with 5 points (one pointing upward), each has its own meaning. The upward point of the star is representative of the spirit. The other four points all represent an element; earth, air, fire, and water. All these things contibutite to life and are a part of each of us. To wear a pentagram necklace or other form of jewelry, is to say you feel the connection with the elements and respect the earth."}, {"url": "http://www.paganspath.com/magik/pentacle.htm", "passage_text": "Pentagram ~. A five pointed star, encased by an outer circle. Adopted by the first pagan practioners, it is always seen with it's apex pointing upward toward the Divine. The Pentagram is an ancient symbol with many different meanings and representations. One of the original is that the four lower points represent the four aspects of the world; {earth, water, air, and fire} with the fifth top point representing the divine spirit. "}, {"url": "https://en.wikipedia.org/wiki/Pentagram", "passage_text": "The pentagram is the simplest regular star polygon. The pentagram contains ten points (the five points of the star, and the five vertices of the inner pentagon) and fifteen line segments. It is represented by the Schlaefli schläfli {symbol/5}. 2 The pentagram was used in ancient times as a Christian symbol for the five senses, or of the five wounds of Christ. A Christian use of the pentangle occurs in the 14th-century English poem Sir Gawain and the Green Knight, in which the symbol decorates the shield of the hero, Gawain."}, {"url": "http://www.gotquestions.org/pentagram-meaning.html", "passage_text": "Answer: The pentagram has been used as a religious symbol throughout the world from the beginning of recorded history. The most basic pentagram is simply a five-point star drawn with one continuous line broken into five line segments and with one point of the star facing up. Today, however, when we say “pentagram,” we usually mean “a five-point star with one or two circles drawn around it.” Sometimes such a symbol includes other small markings denoting a particular magick sigil (a symbol used in magic spells)."}, {"url": "http://spellsandmagic.com/pentagrams.html", "passage_text": "Pentagrams. The Pentagram means different things to different people. Some may argue as to what it represents, so if these words do not agree with you, do not get your panties in a knot. So here are several meanings of the pentagram and I am sure there are more that I have not covered. 1. The Pentagram means different things to different people. Some may argue as to what it represents, so if these words do not agree with you, do not get your panties in a knot"}, {"url": "https://en.wikipedia.org/wiki/Pentagram", "passage_text": "A pentagram (sometimes known as a pentalpha or pentangle or a star pentagon) is the shape of a five-pointed star drawn with five straight strokes. The word pentagram comes from the Greek word πεντάγραμμον (pentagrammon), from πέντε (pente), five + γραμμή (grammē), line. The word  pentacle  is sometimes used synonymously with pentagram. The word pentalpha is a learned modern (17th-century) revival of a post-classical Greek name of the shape. The pentagram was used in ancient times as a Christian symbol for the five senses, or of the five wounds of Christ. A Christian use of the pentangle occurs in the 14th-century English poem Sir Gawain and the Green Knight, in which the symbol decorates the shield of the hero, Gawain."}, {"url": "https://answers.yahoo.com/question/index?qid=20090306213359AAVdZ2M", "passage_text": "Relevance. Rating Newest Oldest. Best Answer: The Pentagram is a five pointed star, if it's a five pointed star within a circle then it's a Pentacle-not exactly the same thing although a lot of people confuse one with the other. This 'upside down' symbol is also used to represent the Baphomet the Goat Headed God, the points represent the head, ears and horns of Baphomet the goat headed god with the top two points the horns, the next two the ears and the single point downwards the long pointed goat face."}]