[{"url": "https://georgia.gov/agencies/georgia-house-representatives", "passage_text": "Georgia House of Representatives. With its 180 members from districts across the state, the House of Representatives is the larger of the two chambers of the General Assembly. Its members serve two-year terms and each January convene to set the state's annual operating budget and address state priorities from agricultural development to tax policy."}, {"url": "http://www.answers.com/Q/How_many_US_Representatives_does_Georgia_have", "passage_text": "The Georgia House of Representatives has 180 members. There are currently 180 members of this legislative body. Use the link below for more information. Georgia has 14 US repr … esentatives in Congress."}, {"url": "http://www.georgiaencyclopedia.org/articles/government-politics/georgia-general-assembly", "passage_text": "A form of representative government has existed in Georgia since January 1751. Its modern embodiment, known as the Georgia General Assembly, is one of the largest state legislatures in the nation. The General Assembly consists of two chambers, the House of Representatives and the senate."}, {"url": "https://www.govtrack.us/congress/members/GA", "passage_text": "The United States is divided into 435 congressional districts — 14 in Georgia — each with a population of about 710,000 individuals. Each district elects a representative to the House for a two-year term. Representatives are also called congressmen/congresswomen."}, {"url": "https://www.govtrack.us/congress/members/GA", "passage_text": "Georgia. Georgia is a U.S. state with two senators in the United States Senate and 14 representatives in the United States House of Representatives."}, {"url": "http://www.answers.com/Q/How_many_US_Representatives_does_Georgia_have", "passage_text": "There are 435 representatives in the House, compared to 100 senators in the Senate. This is the number reached when new seats were added in 1913, and the number was locked b … y the Reapportionment Act of 1929. From 1959 to 1963, there were temporarily 437 seats. There are 6 other non-voting delegates."}, {"url": "http://www.answers.com/Q/How_many_US_Representatives_does_Georgia_have", "passage_text": "Following the 2010 Census, Georgia has 14 US Representatives in the House (gained 1). * Georgia has 180 state representatives in the state legislature."}]