[{"url": "http://www.ehow.com/info_8675084_salary-chiropractic-office-manager.html", "passage_text": "Salary. According to 2010 data published by the U.S. Bureau of Labor Statistics, the national annual mean salary for a health service manager was $93,670. These individuals earned a national hourly mean wage of $45. Health service managers who were paid in the bottom 10th percentile for this profession earned a salary of $51,280, or an hourly wage of $24. Health service managers who were paid in the 90th percentile for this profession earned a salary of $144,880, or an hourly wage of $69"}, {"url": "http://work.chron.com/chiropractic-managers-salary-pay-scale-9753.html", "passage_text": "The BLS reported 100 general managers overseeing the day-to-day operations of chiropractic offices. These managers earned a six-figure average annual wage of $150,610, equal to $72.41 an hour. An operations manager who reached even the 25th percentile, or top quarter, of salaries exceeded $187,199 a year. The lowest-paid 10 percent, however, earned only $45,220 or less. The average salary for the chiropractic industry was 34 percent higher than the overall average for the profession, $114,490. Chiropractic offices employed 30 administrative services managers, according to the BLS, who were tasked with handling non-medical records and information. These managers averaged $91,680 in salary, or $44.08 an hour. The best-paid 25 percent could reach six figures in pay, at $127,180 or more."}, {"url": "http://www.simplyhired.com/salaries-k-chiropractic-office-manager-jobs.html", "passage_text": "Average Chiropractic Office Manager Salaries. The average salary for chiropractic office manager jobs is $54,000. Average chiropractic office manager salaries can vary greatly due to company, location, industry, experience and benefits. This salary was calculated using the average salary for all jobs with the term chiropractic office manager anywhere in the job listing. This free salary calculator uses salary data from millions of job listings indexed by Simply Hired's job search engine. The chiropractic office manager salary comparisons feature allows job seekers to get the information required to make important career decisions and negotiate salary ranges."}, {"url": "http://salarygenius.com/1/1/salary/chiropractic-office-manager-salary", "passage_text": "National Chiropractic Office Manager Salary Information. The average yearly salary for Chiropractic Office Manager is $33,150. If you are just beginning to work a new job as a Chiropractic Office Manager, you could expect a starting pay rate of $27,300 annually. As is true for most jobs and careers, you can expect your hourly pay rate or salary to increase as you gain experience and the longer you are employed with the same employer. The average Chiropractic Office Manager age in the United States is 38 years old. As it pertains to men vs women, 49% of Chiropractic Office Manager are male in the United States, and 51% of the Chiropractic Office Manager are female in the United States."}, {"url": "http://work.chron.com/chiropractic-managers-salary-pay-scale-9753.html", "passage_text": "The best-paid 10 percent earned six figures, at $114,930 or more, while the lowest-paid 10 percent earned $40,610 or less. The average salary for chiropractic office managers was 34 percent less than the overall average for the profession of medical office managers of $96,030. Chiropractic offices employed 30 administrative services managers, according to the BLS, who were tasked with handling non-medical records and information. These managers averaged $91,680 in salary, or $44.08 an hour. The best-paid 25 percent could reach six figures in pay, at $127,180 or more."}, {"url": "http://salarygenius.com/1/1/salary/chiropractic-office-manager-salary", "passage_text": "For more accurate salary details please enter your location above. The average yearly salary for Chiropractic Office Manager is $33,150. If you are just beginning to work a new job as a Chiropractic Office Manager, you could expect a starting pay rate of $27,300 annually. As is true for most jobs and careers, you can expect your hourly pay rate or salary to increase as you gain experience and the longer you are employed with the same employer. The average Chiropractic Office Manager age in the United States is 38 years old. As it pertains to men vs women, 49% of Chiropractic Office Manager are male in the United States, and 51% of the Chiropractic Office Manager are female in the United States."}, {"url": "http://work.chron.com/average-salary-chiropractor-pays-his-employees-5366.html", "passage_text": "Health Services Managers. Chiropractors paid their health services managers an average $34.49 per hour, or $71,740 a year, as of May 2011, according to the Bureau of Labor Statistics. Medical assistants in chiropractic offices averaged $12.71 per hour, or $26,430 per year, in 2011. They are not the same as physician assistants, who diagnose and treat patients under the supervision of doctors."}]