[{"url": "http://www.gsa.gov/portal/ext/public/site/FTR/file/Chapter302p004.html/category/21869/", "passage_text": "Your authorized en route travel days and per diem are determined as follows: The number of authorized travel days is the actual number of days used to complete the trip, but not to exceed an amount based on a minimum driving distance per day determined to be reasonable by your agency. Per diem for an established minimum driving distance per day is computed based on the lodgings-plus per diem system as described in §§301-11.100 through 301-11.102 of this title. Yes, you must establish a minimum driving distance not less than an average of 300 miles per day."}, {"url": "http://www.military.com/benefits/military-pay/military-travel-and-per-diem-rates.html", "passage_text": "The Per Diem Allowance. Each year the DoD Per Diem, Travel and Transportation Committee sets the Per Diem allowance. The Per Diem is specific to a given travel location and can range from a standard CONUS rate from $140 per day up to $702 per day for Out-of-CONUS rates. The Per Diem rate you will receive is based on a combination of the Maximum Lodging and the Meals and Incidental Expenses (M&IE) rates. The proportional meal rate (PMR)is based on the locality meal rate and the GOVT meal rate (GMR). The per diem ta bles on this website have the PMRs already computed. The examples below using the Standard CONUS M&IE rate of $46.00 and the Standard GMR of $11.85 show how to compute a PMR amount."}, {"url": "http://themilitarywallet.com/per-diem-rates/", "passage_text": "Travelers will receive 100% of the locality rate per diem for travel under 30 days. Long-term travel over 30 days, but less than 180 days will result in an authorized per diem rate of 75% of the locality per diem rate. TDY travel in excess of 180 days results in a rate of 55% of the locality per diem rate. Per Diem rates are given for specific locations. The rates range from $129 per day in the Continental US (CONUS), and up to $823 per day in Out of CONUS (or OCONUS) locations. Again, the total rate is split between your lodging and your Meals and Incidental Expenses"}, {"url": "http://www.military.com/spouse/military-relocation/pcs-moves/managing-relocation-costs.html", "passage_text": "50% of the rate. The total per diem reimbursement on your move is the sum of the allowable per diem for each family member. The following sample family includes the servicemember, spouse, a thirteen year-old child and a six-year-old child. Note: The standard per diem rate for the following example is assumed to be $100. To determine the number of days per diem, take the Official Government Mileage between duty stations and divide by 350. An additional day of travel is allowed if the remainder is 51 miles or more. The per diem rate is based on the current CONUS Standard Per Diem rate and varies by age."}, {"url": "http://www.defensetravel.dod.mil/site/faqpcs.cfm", "passage_text": "TQSE(AE) (Actual Subsistence Expenses): TQSE(AE) may be authorized NTE 120 days. : The rate within CONUS for the first 30 days is the Standard CONUS per diem rate NTE $140/day for the employee, $105 (75%) for each dependent age 12 or older, $70 (50%) for each dependent under age 12). : The rate in a non-foreign OCONUS location is based on the PDS per diem rates. Travel by Commercial Means: Per diem for the member is at the ‘Lodgings-Plus’ rate for the new PDS or the rate for the delay point if the member stops overnight. Dependent: Per diem is 75% of the member's applicable rate for each dependent age 12 or older, and 50% for each dependent under age 12."}, {"url": "http://www.militaryvaloan.com/blog/pcs-allowances/", "passage_text": "PCS Per Diem. A per diem allowance is a daily amount allotted for food and shelter while you travel to your new station. Per diem amounts are based upon a flat per-mile rate. The military expects you to travel 350 miles per day. You will be reimbursed for both mileage as well as meals and hotel expenses."}, {"url": "http://www.military.com/spouse/military-relocation/pcs-moves/managing-relocation-costs.html", "passage_text": "How is it figured? The military computes your per diem payment based on three factors-the number of travel days, the current CONUS standard per diem rate, and the ages of the travelers. The number of travel days is based on a standard 350 miles per day if you are traveling by Personally Owned Vehicle (POV). To determine the number of days per diem, take the Official Government Mileage between duty stations and divide by 350. An additional day of travel is allowed if the remainder is 51 miles or more. The per diem rate is based on the current CONUS Standard Per Diem rate and varies by age."}]