[{"url": "http://my.clevelandclinic.org/services/heart/heart-blood-vessels/heart-valves", "passage_text": "The heart has four valves-one for each chamber of the heart. The valves keep blood moving through the heart in the right direction. The mitral valve and tricuspid valve are located between the between the atria (upper heart chambers) and the ventricles (lower heart chambers). As the left ventricle begins to contract, the aortic valve is forced open. Blood is pumped out of the left ventricle through the aortic valve into the aorta. The aorta branches into many arteries and provides blood to the body. 4. Closed pulmonic and aortic valves. When the right ventricle finishes contracting and starts to relax, the pulmonic valve snaps shut"}, {"url": "http://www.innerbody.com/image/card01.html", "passage_text": "From the right ventricle, the blood is pumped through the pulmonary semilunar valve into the pulmonary trunk. The pulmonary trunk carries blood to the lungs where it releases carbon dioxide and absorbs oxygen. The blood in the lungs returns to the heart through the pulmonary veins. The left ventricle pumps blood through the aortic semilunar valve into the aorta. From the aorta, blood enters into systemic circulation throughout the body tissues until it returns to the heart via the vena cava and the cycle repeats."}, {"url": "http://www.answers.com/Q/Where_else_in_the_circulatory_system_are_valves_found", "passage_text": "You have the atrioventricular valves that are the valves separating each atrium from the ventricles. The right AV valve is the tricuspid valve, while the left AV valve is the … bicuspid/mitral valve. There are also two valves that lead from the heart to the pulmonary and aortic arteries. The valves in the … heart prevent the blood from flowing backwards from one chamber of the heart to the other. For example, the mitral valve provides outward flow to the body by preventing blood from the left ventricle from flowing back to the left atrium, where it came from."}, {"url": "https://en.wikipedia.org/wiki/Heart_valve", "passage_text": "A heart valve normally allows blood to flow in only one direction through the heart. The four valves commonly represented in a mammalian heart determine the pathway of blood flow through the heart. A heart valve opens or closes incumbent on differential blood pressure on each side. The four main valves in the heart are: 1 The two atrioventricular (AV) valves, the mitral valve (bicuspid valve), and the tricuspid valve, which are between the upper atria and the lower ventricles. 2  The two semilunar (SL) valves, the aortic valve and the pulmonary valve, which are in the arteries leaving the heart."}, {"url": "https://en.wikipedia.org/wiki/Heart_valve", "passage_text": "The mitral valve and the aortic valve are in the left heart; the tricuspid valve and the pulmonary valve are in the right heart. There are also the coronary sinus and the inferior vena cava valves. 1 The two atrioventricular (AV) valves, the mitral valve (bicuspid valve), and the tricuspid valve, which are between the upper atria and the lower ventricles. 2  The two semilunar (SL) valves, the aortic valve and the pulmonary valve, which are in the arteries leaving the heart."}, {"url": "http://www.medicinenet.com/heart_valve_disease/article.htm", "passage_text": "As the ventricles begin to contract, the pulmonic and aortic valves are forced open and blood is pumped out of the ventricles through the open valves into the pulmonary artery toward the lungs, the aorta, and the body. The four heart valves make sure that blood always flows freely in a forward direction and that there is no backward leakage. Blood flows from your right and left atria into your ventricles through the open mitral and tricuspid valves. When the ventricles are full, the mitral and tricuspid valves shut. This prevents blood from flowing backward into the atria while the ventricles contract (squeeze)"}]