[{"url": "http://connecticut.hometownlocator.com/ct/new-london/quaker-hill.cfm", "passage_text": "Quaker Hill (GNIS FID: 210039) is a populated place located in New London County at latitude 41.403 and longitude -72.106. The elevation is 30 feet. Quaker Hill appears on the Uncasville U.S. Geological Survey Map. New London County is in the Eastern Time Zone (UTC -5 hours). New London County: Cities & Towns | ZIP Codes | Schools | Features (airports, churches, hospitals, etc. "}, {"url": "http://www.trulia.com/for_rent/Quaker_Hill,CT/", "passage_text": "Or check out these popular homes. Average price per square foot for Quaker Hill CT was $134, a decrease of 3.6% compared to the same period last year. The median sales price for homes in Quaker Hill CT for Jul 15 to Oct 15 was $215,000 based on 11 home sales. Compared to the same period one year ago, the median home sales price decreased 4.4%, or $9,900, and the... 1 – 4 of 4 Apts. 1. Summary for Quaker Hill. Average price per square foot for Quaker Hill CT was $134, a decrease of 3.6% compared to the same period last year."}, {"url": "http://www.weichert.com/CT/Newlondon/Quaker_Hill/", "passage_text": "Weichert Realtors is one of the nation's leading providers of Quaker Hill, Connecticut real estate for sale and home ownership services. Contact Weichert today to buy or sell real estate in Quaker Hill, CT. "}, {"url": "https://en.wikipedia.org/wiki/Quaker_Hill,_Connecticut", "passage_text": "The village center is included in the Quaker Hill Historic District, a historic district that is listed on the National Register of Historic Places. The historic district is the area around Old Norwich Road, extending as far south as the village of Thames View and as far north as Route 32. In 1645, the area was meadows used as hayfields. The area became known as Quaker Hill by 1687 due to its association with the Rogerenes or Rogerene Quakers, a religious sect founded by a local farmer, John Rogers (1648–1721) at the house near Benham Avenue. The first house was built around 1740 by Benjamin Greene at Scotch Cap"}, {"url": "http://www.waterfordschools.org/domain/312", "passage_text": "Our school motto is: Quaker Hill says YES to Respect. The YES stands for: Respect Yourself, Respect Each Other, Respect Your School. Our students do an incredible job saying YES to respect and we are very proud of them. Quaker Hill School values parental partnership and support. Our school motto is: Quaker Hill says YES to Respect. The YES stands for: Respect Y ourself, Respect E ach Other, Respect Your S "}, {"url": "https://en.wikipedia.org/wiki/Quaker_Hill,_Connecticut", "passage_text": "Quaker Hill is the place name used for ZIP code 06375, which extends beyond Quaker Hill to encompass the entire northeastern portion of the town of Waterford, including Bartlett, Best View, Cohanzie, Harrisons and Thames View. In 1645, the area was meadows used as hayfields. The area became known as Quaker Hill by 1687 due to its association with the Rogerenes or Rogerene Quakers, a religious sect founded by a local farmer, John Rogers (1648–1721) at the house near Benham Avenue. The first house was built around 1740 by Benjamin Greene at Scotch Cap"}, {"url": "http://www.waterfordschools.org/domain/312", "passage_text": "Quaker Hill Elementary School285 Bloomingdale Road Quaker Hill, CT 06375 Phone: (860) 442-1095Fax: (860) 447-6267Nurse's Fax: (860) 444-4011Principal: Christopher DiscordiaSecretary: Amelia Santangelo Directions to Quaker Hill Elementary School Welcome to Quaker Hill School! Our school motto is: Quaker Hill says YES to Respect. The YES stands for: Respect Y ourself, Respect E ach Other, Respect Your S chool. Our students do an incredible job saying YES to respect and we are very proud of them. Quaker Hill School values parental partnership and support."}, {"url": "http://www.deansautorecyclingct.com/", "passage_text": "Dean's Auto Recycling is a used auto parts and recycling company in Quaker Hill with more than 20 years of experience. Dean's has been in the auto salvage business for the past 70 years. Our family owned and operated company takes immense pride in providing our customers with top quality second hand auto parts. Dean's Auto Recycling is the number one used auto parts dealer in the entire Quaker Hill area. If you are looking for quality used transmissions, radiators, tires or any other late model auto parts, drop by and see us today."}]