[{"url": "http://healthyeating.sfgate.com/functions-amylase-protease-lipase-digestive-enzymes-3325.html", "passage_text": "Although amylase, protease and lipase are the three main enzymes your body uses to digest food, many other specialized enzymes also help in the process. Cells that line your intestines make enzymes called maltase, sucrase and lactase, each able to convert a specific type of sugar into glucose. The main source of lipase in your digestive tract is your pancreas, which makes pancreatic lipase that acts in your small intestine. First, bile made in your liver and released into your intestine converts dietary fat into small fatty globules."}, {"url": "https://en.wikipedia.org/wiki/Lipase", "passage_text": "A lipase is an enzyme that catalyzes the hydrolysis of fats (lipids). Lipases are a subclass of the esterases. Lipases perform essential roles in the digestion, transport and processing of dietary lipids (e.g. triglycerides, fats, oils) in most, if not all, living organisms. Genes encoding lipases are even present in certain viruses."}, {"url": "http://www.answers.com/Q/What_is_the_function_of_lipases", "passage_text": "The function of lipase in the digestive system, is to break down fat so that it can be absorbed through villi into the different parts of the body. 3 people found this useful. Edit. Lipase is an enzyme that the body uses to break down fats in food so they can be absorbed in the intestines. Lipase is primarily produced in the pancreas but is also in the mo … uth and stomach."}, {"url": "http://ghr.nlm.nih.gov/gene/LPL", "passage_text": "The LPL gene provides instructions for making an enzyme called lipoprotein lipase. This enzyme is found primarily on the surface of cells that line tiny blood vessels (capillaries) within muscles and in fatty (adipose) tissue. "}, {"url": "http://healthyeating.sfgate.com/functions-amylase-protease-lipase-digestive-enzymes-3325.html", "passage_text": "Lipase. Lipase is an enzyme that breaks down dietary fats into smaller molecules called fatty acids and glycerol. A small amount of lipase, called gastric lipase, is made by cells in your stomach. This enzyme specifically digests butter fat in your food. The main source of lipase in your digestive tract is your pancreas, which makes pancreatic lipase that acts in your small intestine. First, bile made in your liver and released into your intestine converts dietary fat into small fatty globules."}, {"url": "https://en.wikipedia.org/wiki/Pancreatic_lipase", "passage_text": "Pancreatic lipase, also known as pancreatic triacylglycerol lipase, is secreted from the [pancreas], and is the primary [lipase](enzyme) that hydrolyzes (breaks down) dietary fat molecules in the human digestive system, converting triglyceride substrates found in ingested oils to monoglycerides and free fatty acids. "}, {"url": "http://macarthurscience.weebly.com/uploads/9/1/3/6/9136403/what_are_the_functions_of_amylase.pdf", "passage_text": "Lipase Lipase is an enzyme that breaks down dietary fats into smaller molecules called fatty acids and glycerol. A small amount of lipase, called gastric lipase, is made by cells in your stomach. This enzyme specifically digests butter fat in your food. The main source of lipase in your digestive tract is your pancreas, which makes pancreatic lipase that acts in your small intestine."}, {"url": "http://www.livestrong.com/article/410168-what-are-the-functions-of-lipase-enzymes/", "passage_text": "Lipases are a general class of enzymes that break down fat molecules. Fats, also called lipids, exist in many forms; different kinds of fats require different lipases to break them down. Your body uses lipases to digest fat and also depends on lipases to help move cholesterol in the body. One of the most familiar functions of lipase in the body is digestion of dietary fat. When you eat foods that contain fat, the fats pass through the stomach undigested into the small intestine, explains Dr. Lauralee Sherwood in her book Human Physiology.."}, {"url": "http://www.healthline.com/health/lipase-test", "passage_text": "Lipase is an enzyme made by the pancreas. When you eat, lipase is released into the digestive tract to aid in the breakdown of fats. Lipase also functions to increase cell permeability. Cell permeability allows vital nutrients and wastes to flow across the cell wall. The nutrients nourish the cell. "}, {"url": "https://en.wikipedia.org/wiki/Lipase", "passage_text": "For example, human pancreatic lipase (HPL), which is the main enzyme that breaks down dietary fats in the human digestive system, converts triglyceride substrates found in ingested oils to monoglycerides and two fatty acids. Lipases are a subclass of the esterases. Lipases perform essential roles in the digestion, transport and processing of dietary lipids (e.g. triglycerides, fats, oils) in most, if not all, living organisms. Genes encoding lipases are even present in certain viruses."}]