[{"url": "http://www.ebay.com/gds/Temperature-and-Water-requirements-for-Ferns-/10000000001233993/g.html", "passage_text": "If your fern has went into a rest period because of low temperatures reduce water. Until the temperature rises to 60 degrees or above. All the plant will need is enough water to prevent wilting of the fronds. Too much water during a full rest period will most likely rot the root of your fern. Virtually all ferns can tolerate temperatures down to about 50 degrees. As the temperature falls, growth will slow down, and it will cease alltogether at 50 degrees, but without impairing the health of the plant. The fern will simply take a rest until the temperature rises agai"}, {"url": "http://www.ehow.com/info_12317762_safe-temperature-outdoor-potted-ferns.html", "passage_text": "On the coldest end of the scale, hardy ferns can survive temperatures down to minus 50 degrees Fahrenheit. However, hardy ferns in USDA zones 2 through 6, tend to be semi-evergreen. In most cases, it is safe to leave many hardy ferns outdoors all winter long. A few, however, are only cold-hardy to USDA zones 6 or 7. In that case, they are only safe outdoors in temperatures as low as 5 degrees below zero Fahrenheit for USDA zone 6, and zero degrees Fahrenheit for USDA zone 7. "}, {"url": "http://www.uvm.edu/pss/ppp/articles/fernsin.html", "passage_text": "--Brake Ferns (Pteris)--several varieties are available, including some with variegated foliage; may be grown as a table fern or in a hanging basket; prefers diffused light and nighttime temperatures of 50 to 55 degrees F, 68 to 72 degrees F during the day. "}, {"url": "http://www.hort.purdue.edu/ext/HO-141.pdf", "passage_text": "Night-time temperatures should be on the cool side, below 60AF. Humidity Low humidity around the home, usually averaging 10 to 15 percent, can be a problem for many tropical indoor plants. Thirty percent humidity is about as low a level as a fern can tolerate. Forty to 50 percent humidity is a more desirable range. Symptoms of plant damage caused by low humidity include browning and drying of the tips of the leaves or fronds"}, {"url": "http://homeguides.sfgate.com/can-leave-boston-fern-outside-46-degrees-91138.html", "passage_text": "Because the roots of potted Boston ferns have less protection from the cold than plants in the ground, potted Boston ferns need to be brought indoors when night temperatures drop to 62 degrees, or they will be damaged by the cold. Boston ferns planted in the ground can survive temperatures as low as 30 degrees. Because Boston ferns are tropical plants, they cannot tolerate frosty temperatures. The best frond growth occurs when nightly temperatures do not drop below 65 degrees Fahrenheit."}, {"url": "http://www.wikihow.com/Care-for-Ferns", "passage_text": "Choose the right location. Ferns require lots of shade and ambient (rather than direct) sunlight. Place your plant near a north-facing window; east and west windows let in too much direct sunlight. You can put your fern next to a south-facing window if a north-facing window isn’t available. Keep the temperature constant. Most indoor species of ferns are tropical, although not all require tropical weather. Make sure that the temperature in your home (or at least the room in which the fern is kept) is near 70 °F (21 °C). The ferns can handle temperatures as low as 60, but they won’t thrive as well under low temperature conditions. When in doubt, turn the temperature up. 1  Consider placing your fern in a bathroom; the temperature and humidity are often higher as a result of showers and baths"}, {"url": "http://homeguides.sfgate.com/temperature-range-boston-ferns-74292.html", "passage_text": "Boston ferns die if exposed to lower temperatures. The best indoor temperature range for these voluptuous plants is between 68 and 78 F, notes Colorado State University Extension. Outdoors, the plants can take considerably higher temperatures as long as you grow them in shade and give them enough water. Boston ferns (Nephrolepis exaltata) aren't from Boston, but are native to Florida, Central America and other tropical areas. The plants became wildly popular during the Victorian era after a florist, F.C. Becker, began propagating them in 1894."}, {"url": "http://homeguides.sfgate.com/temperature-range-boston-ferns-74292.html", "passage_text": "In low humidity, Boston ferns turn yellow. Boston ferns (Nephrolepis exaltata) aren't from Boston, but are native to Florida, Central America and other tropical areas. The plants became wildly popular during the Victorian era after a florist, F.C. Becker, began propagating them in 1894."}]