[{"url": "http://www.webmd.com/baby/healthtool-ovulation-calculator", "passage_text": "This calculator helps you predict your most fertile days of the month. Menstrual periods vary from woman to woman and month to month. Use this calculator to help determine the timing of your ovulation and peak fertility. CAUTION: This tool cannot and should not be used to prevent pregnancy. 1  1."}, {"url": "http://www.thebump.com/calculators/ovulation", "passage_text": "Ovulation Calculator. Use our ovulation calculator to find your most fertile days and the best time to TTC! Enter the first day of your last menstrual period and your average cycle length. Your estimated ovulation date is dark green, and other top fertility times are light green. "}, {"url": "http://www.webmd.com/baby/healthtool-ovulation-calculator", "passage_text": "1 4. Know When You Ovulate: Chart your basal body temperature and your cervical mucus. 2  You might also use an over-the-counter ovulation predictor kit (OPK) to check for hormonal changes in your urine before ovulation. 3  5. 4  De-Stress: Try yoga, meditation, or long walks to reduce stress. Menstrual periods vary from woman to woman and month to month. Use this calculator to help determine the timing of your ovulation and peak fertility. CAUTION: This tool cannot and should not be used to prevent pregnancy. 1  1."}, {"url": "http://www.babycenter.in/ovulation-calculator", "passage_text": "Find out when you're likely to ovulate-and increase your chances of getting pregnant! Just tell us the first day of your last period and how long your cycle usually lasts (anywhere from 20 to 45 days). We'll tell you when you're most likely to be fertile over the next six months. NOTE: This tool provides approximate dates only and assumes a regular menstrual cycle. If your menstrual cycles are irregular, you may have trouble pinpointing your day of ovulation based on this calendar alone."}, {"url": "http://yourfertility.org.au/for-women/timing-and-conception", "passage_text": "1 Day one is the first day of the menstrual period and the last day is the day before the next period begins. 2  Ovulation happens about two weeks before the next expected period. 3  So if your average menstrual cycle is 28 days, you ovulate around day 14. 1 Work out the length of your average menstrual cycle. 2  Day one is the first day of the menstrual period and the last day is the day before the next period begins. 3  Ovulation happens about two weeks before the next expected period. 4  So if your average menstrual cycle is 28 days, you ovulate around day 14."}, {"url": "http://americanpregnancy.org/ovulation-calendar/", "passage_text": "Use the free ovulation calendar below as a guide to help you track your ovulation. Some people also refer to this as an ovulation calculator. For women who have a 28 to 32 day menstrual cycle, ovulation can take place between days 11 through 21. Remember this is just an average of days that ovulation could take place—every woman’s cycle is different. If you are trying to get pregnant, you should get a copy of the Essential Guide for Getting Pregnant."}, {"url": "http://www.babycenter.com/0_predicting-ovulation_484.bc", "passage_text": "When you ovulate (or release an egg from your ovary), that egg has a chance of getting fertilized. When that egg gets fertilized, you're pregnant! You're most fertile from two to three days before you ovulate through the day of ovulation. If you know when you'll ovulate, you can time sex accordingly and boost your chances of getting pregnant (or of preventing pregnancy, if that's what you're trying to do)."}, {"url": "http://www.wisegeekhealth.com/how-do-i-determine-my-ovulation-date.htm", "passage_text": "An ovulation calculator can help a woman to accurately understand her ovulation cycle. Most women ovulate about 14 days before the expected start of the next menstruation. Pregnancy can occur if sexual intercourse takes place two to four days before ovulation, and at least a day after ovulation. Recording body temperature daily may help a woman keep track of ovulation cycles. If you want to really be accurate about how to check your ovulation cycle you should download one of the apps on your smartphone that fine the ovulation date for you. These apps just ask you for details on your period and keep track of everything for you."}, {"url": "http://www.babycenter.com/ovulation-calculator", "passage_text": "Predicting ovulation. Learn how to know when you're ovulating, which days you're most fertile, how to use ovulation predictor kits, and more. What cervical mucus looks like through your cycle. When your cervical mucus looks a certain way, it's a signal that you've reached the most fertile time of your cycle. Find out w... Charting BBT and CM he... Ovulation chart: How to predict ovulation by charting your basal body temperature and cervical mucus. Charting your basal body temperature and cervical mucus can help you predict when you're fertile and have the best chance of ge..."}]