[{"url": "http://www.epicor.com/solutions/manufacturing-execution-system.aspx", "passage_text": "MES Software. Improve quality, reduce scrap, and boost product throughout with MES software from Epicor. A manufacturing execution system helps you improve capacity to make more parts or cut costs – to improve profitability. The Epicor MES automatically monitors machines and analyzes production and performance data 24x7. "}, {"url": "https://en.wikipedia.org/wiki/Manufacturing_execution_system", "passage_text": "MES may operate across multiple function areas, for example: management of product definitions across the product life-cycle, resource scheduling, order execution and dispatch, production analysis and downtime management for Overall Equipment Effectiveness (OEE), Product Quality, or materials track and trace. Industry groups such as MESA International-- Manufacturing Enterprise Solutions Association were created in the early 1990's in order to address the complexity, and advise on execution, of MES Systems."}, {"url": "http://www.workwisellc.com/what-is-mes/", "passage_text": "MES (manufacturing execution system) is the comprehensive system that controls all the activities occurring on the shop floor. A high quality MES will also provide the best tools for controlling the scheduling needs directly on the shop floor. The shop is a complex environment with a high level of variety. Your schedulers are therefore critical in finding key opportunities to improve your production results"}, {"url": "https://en.wikipedia.org/wiki/Manufacturing_execution_system", "passage_text": "Manufacturing execution systems (MES) are computerized systems used in manufacturing. MES track and document the transformation of raw materials through finished goods. MES can provide the right information at the right time and show the manufacturing decision maker how the current conditions on the plant floor can be optimized to improve production output.. Industry groups such as MESA International-- Manufacturing Enterprise Solutions Association were created in the early 1990's in order to address the complexity, and advise on execution, of MES Systems."}, {"url": "http://searchmanufacturingerp.techtarget.com/definition/manufacturing-execution-system-MES", "passage_text": "Ellucian. A manufacturing execution system (MES) is a control system for managing and monitoring work-in-process on a factory floor. An MES keeps track of all manufacturing information in real time, receiving up-to-the-minute data from robots, machine monitors and employees. Although manufacturing execution systems used to operate as self-contained systems, they are increasingly being integrated with enterprise resource planning (ERP) software suites. The goal of a manufacturing execution system is to improve productivity and reduce cycle-time, the total time to produce an order. By integrating an MES with ERP software, factory managers can be proactive about ensuring the delivery of quality products in a timely, cost-effective manner"}, {"url": "http://www.ibaset.com/wp-content/uploads/2014/09/wp-iBASEt-Paper-What-Is-MES-In-Complex-Discrete-Manufacturing.pdf", "passage_text": "What is MES in Complex Discrete Manufacturing © Copyright 2014 Page 27 of 28 2.9.4. Enterprise Continuous Improvement Management A formal methodology for implementing and tracking continuous improvement is an important part of the overall enterprise quality management system. What is MES in Complex Discrete Manufacturing © Copyright 2014 Page 20 of 28 2.6. Product and Parts Tracking and Genealogy Efficient production operations and just‐in‐time (JIT) practices are dependent upon availability of the proper parts, at the proper time, and at the proper location."}, {"url": "http://www.criticalmanufacturing.com/en/cmnavigo-mes/mes", "passage_text": "empowering operations. Manufacturing Execution System, or MES, is an information system that drives the execution of manufacturing operations. The main goal. of such systems is to achieve and to maintain high performance in a highly competitive and rapidly changing manufacturing environment"}]