[{"url": "http://www.answers.com/Q/What_is_a_normal_hemoglobin_for_a_woman", "passage_text": "The normal range of hemoglobin (also haemoglobin)  varies in men, women, and children.    The normal range of hemoglobin in male is 13.5 to 18gm/dl (gram per  decilit … er).    For female it is 12 to 16gm/dl (gram per deciliter).    In a children 11 to 16gm/dl (gram per deciliter).    And for a pregnant woman 11 to 12g/dl (gram per deciliter) is the  normal range of hemoglobin.    If the hemoglobin is below normal, this is called anemia. "}, {"url": "http://www.breastcancer.org/tips/fatigue/ask_expert/2001_03/question_18", "passage_text": "Answers-Russell Portenoy What is normal depends on the lab. Most women with hemoglobin above 14 or 14.5 would be considered to have a normal level. There are some new data to suggest that hemoglobin levels in the range of 10-12 are critically important in terms of the onset of fatigue."}, {"url": "http://www.answers.com/Q/What_is_the_normal_hemoglobin_range_for_adult_females", "passage_text": "The normal range of hemoglobin (also haemoglobin)  varies in men, women, and children.    The normal range of hemoglobin in male is 13.5 to 18gm/dl (gram per  decilit … er).    For female it is 12 to 16gm/dl (gram per deciliter).    In a children 11 to 16gm/dl (gram per deciliter).    And for a pregnant woman 11 to 12g/dl (gram per deciliter) is the  normal range of hemoglobin. Making the world better, one answer at a time. The normal range of hemoglobin in female is 12 to 16gm/dl (gram per deciliter). And for a pregnant woman 11 to 12g/dl (gram per deciliter) is the normal range of hemoglobin. Hemoglobin levels are often measured in grammes per decilitre (g/dl)"}, {"url": "http://www.medicinenet.com/hemoglobin/article.htm", "passage_text": "Hemoglobin is the protein molecule in red blood cells that carries oxygen from the lungs to the body's tissues and returns carbon dioxide from the tissues back to the lungs. Hemoglobin is made up of four protein molecules (globulin chains) that are connected together. "}, {"url": "http://answers.webmd.com/answers/1171291/what-are-normal-hemoglobin-values", "passage_text": "A. The hemoglobin level is expressed as the amount of hemoglobin in grams (gm) per deciliter (dL) of whole blood, a deciliter being 100 milliliters. The normal ranges for hemoglobin depend on the age and, beginning in adolescence, the gender of the person. The normal ranges are: 1  Newborns: 17-22 gm/dL"}, {"url": "https://www.blood.ca/en/blood/hemoglobin", "passage_text": "Normal hemoglobin levels are different in women and in men. In non-pregnant women, normal hemoglobin ranges from 120 g/L to 160 g/L. In men, normal hemoglobin levels range from 140 g/L to 180 g/L. Canadian Blood Services tests each donor’s hemoglobin at the clinic and requires a minimum of 125 g/L for donation."}, {"url": "http://www.mayoclinic.org/tests-procedures/hemoglobin-test/basics/results/PRC-20015022", "passage_text": "The normal range for hemoglobin is: 1  For men, 13.5 to 17.5 grams per deciliter. 2  For women, 12.0 to 15.5 grams per deciliter. If your hemoglobin level is lower than normal, you have anemia. There are many forms of anemia, each with different causes, which can include: 1  Iron deficiency. 2  Vitamin B-12 deficiency. 3  Folate deficiency. 4  Bleeding. 5  Cancers that affect the bone marrow, such as leukemia. 6  Kidney disease. 7  Liver disease."}, {"url": "http://www.mayoclinic.org/symptoms/low-hemoglobin/basics/definition/SYM-20050760", "passage_text": "A low hemoglobin count is generally defined as less than 13.5 grams of hemoglobin per deciliter (135 grams per liter) of blood for men and less than 12 grams per deciliter (120 grams per liter) for women. In children, the definition varies with age and sex. "}, {"url": "http://www.emedicinehealth.com/hemoglobin_levels/page3_em.htm", "passage_text": "Normal hemoglobin values are related to the person's age and sex. Normal values may vary slightly between test systems, and which groups of doctors have determined normal values for their group of patients; however, the value ranges are close (vary by about 0.5 g/dl) for almost every group. "}]