[{"url": "https://en.wikipedia.org/wiki/National_Grid_(Great_Britain)", "passage_text": "The first is owned and maintained by SP Energy Networks, a subsidiary of Scottish Power, and the other by SSE. However, National Grid plc remains the System Operator for the whole UK Grid. This article is about the power grid in Great Britain. For the UK Ordnance Survey National Grid for mapping co-ordinates in Great Britain, see Ordnance Survey National Grid. For the company, see National Grid plc."}, {"url": "http://www.fastcoexist.com/3042029/how-burlington-vermont-became-the-first-city-in-the-us-to-run-on-100-renewable-electricity", "passage_text": "When it flipped the switch on a new hydropower plant last fall, Burlington, Vermont, became the first city in the U.S. to run on 100% renewable electricity. It's been a long time coming, says Ken Nolan, manager of power resources for Burlington Electric Department. In the 1980s, the city retired a coal-burning plant, and decided to replace it with a biomass plant that runs on scrap wood from across the state. It's been closing in on 100% renewables ever since."}, {"url": "http://www.fastcoexist.com/3042029/how-burlington-vermont-became-the-first-city-in-the-us-to-run-on-100-renewable-electricity", "passage_text": "But when it flipped the switch on a new hydropower plant last fall, it became the first city in the U.S. to run on 100% renewable electricity. It's been a long time coming, says Ken Nolan, manager of power resources for Burlington Electric Department. In the 1980s, the city retired a coal-burning plant, and decided to replace it with a biomass plant that runs on scrap wood from across the state. It's been closing in on 100% renewables ever since."}, {"url": "http://www.fastcoexist.com/3042029/how-burlington-vermont-became-the-first-city-in-the-us-to-run-on-100-renewable-electricity", "passage_text": "One of the reasons the city can run on renewable energy is that it has also worked hard to help residents use less power overall. With an aggressive energy efficiency program, the city actually uses less energy now than it did in 1989. It's been a long time coming, says Ken Nolan, manager of power resources for Burlington Electric Department. In the 1980s, the city retired a coal-burning plant, and decided to replace it with a biomass plant that runs on scrap wood from across the state. It's been closing in on 100% renewables ever since."}, {"url": "http://www.sourcewatch.org/index.php/FirstEnergy", "passage_text": "This is a mine that will add 25 percent to the over all coal mining that we do in Montana, stated Montana Governor Brian Schweitzer at the mine's reopening. The Boich Group and FirstEnergy invested $400 million to reopen the mine, which will produce an estimated 12.5 million tons of annually by the end of 2010. Out of its total 14,819 MW of electric generating capacity in 2005 (1.39% of the U.S. total), FirstEnergy produces 54.0% from coal, 27.6% from nuclear, 8.6% from natural gas, 6.4% from hydroelectricity, and 3.4% from oil."}, {"url": "https://en.wikipedia.org/wiki/FirstEnergy", "passage_text": "1 In 1944, the Pennsylvania Power Company became a subsidiary of Ohio Edison, and is now one of the ten operating utilities. 2  In 1950, the Ohio Edison Company merged with the Ohio Public Service Company, which continued to operate under its new Ohio Edison name. In February 2010, Allegheny Energy announced plans to merge with FirstEnergy. The merger was approved by stockholders of both companies, the Federal Energy Regulatory Commission, and regulatory commissions in Virginia, West Virginia, Maryland, and Pennsylvania."}, {"url": "http://www.fossil.energy.gov/education/energylessons/coal/coal_history.html", "passage_text": "By 1875, coke (which is made from coal) replaced charcoal as the primary fuel for iron blast furnaces to make steel. The burning of coal to generate electricity is a relative newcomer in the long history of this fossil fuel. It was in the 1880s when coal was first used to generate electricity for homes and factories. Long after homes were being lighted by electricity produced by coal, many of them continued to have furnaces for heating and some had stoves for cooking that were fueled by coal."}, {"url": "https://en.wikipedia.org/wiki/FirstEnergy", "passage_text": "FirstEnergy was formed on November 7, 1997, when Ohio Edison acquired Centerior Energy and its subsidiaries for $1.6 billion in stock. The company was acquired with plans for a restructuring and layoffs to cut costs. In February 2010, Allegheny Energy announced plans to merge with FirstEnergy. The merger was approved by stockholders of both companies, the Federal Energy Regulatory Commission, and regulatory commissions in Virginia, West Virginia, Maryland, and Pennsylvania."}, {"url": "https://en.wikipedia.org/wiki/FirstEnergy", "passage_text": "Centerior Energy Corporation (formerly CX on the NYSE) was formed in 1986 from the merger of two old operating companies. Centerior was based in Independence, Ohio and existed as a publicly traded holding company for only ten years, until its merger with Ohio Edison formed FirstEnergy in 1997: In February 2010, Allegheny Energy announced plans to merge with FirstEnergy. The merger was approved by stockholders of both companies, the Federal Energy Regulatory Commission, and regulatory commissions in Virginia, West Virginia, Maryland, and Pennsylvania."}, {"url": "http://skyserver.sdss.org/dr1/en/proj/advanced/spectraltypes/energylevels.asp", "passage_text": "Electrons in a hydrogen atom must be in one of the allowed energy levels. If an electron is in the first energy level, it must have exactly -13.6 eV of energy. If it is in the second energy level, it must have -3.4 eV of energy. An electron in a hydrogen atom cannot have -9 eV, -8 eV or any other value in between. Let's say the electron wants to jump from the first energy level, n = 1, to the second energy level n = 2. The second energy level has higher energy than the first, so to move from n = 1 to n = 2, the electron needs to gain energy. It needs to gain (-3.4) - (-13.6) = 10.2 eV of energy to make it up to the second energy level"}]