[{"url": "https://www.rmiguides.com/vinson-massif", "passage_text": "Located only 660 nautical miles from the South Pole, Vinson Massif (16,067') is the highest peak in Antarctica and one of the renowned Seven Summits .. Expedition highlights include: 1  Scale the top of the bottom of the world - the highest mountain in Antarctica and one of the most remote mountains on earth. 1 Scale the top of the bottom of the world - the highest mountain in Antarctica and one of the most remote mountains on earth. 2  Fly across the Drake Passage and over the sprawling icy interior of Antarctica to reach Vinson Base Camp."}, {"url": "https://en.wikipedia.org/wiki/Vinson_Massif", "passage_text": "Vinson Massif (/ˈvɪnsən maeˈsiːf/) mæˈsiːf is a large mountain massif that is 21 (km 13) mi long and 13 (km.8 1) mi wide and lies within The Sentinel range of The Ellsworth. Mountains it overlooks The Ronne Ice shelf near the base of The Antarctic. peninsula The massif is located about 1,200 kilometres (750 mi) from the South Pole. Vinson Massif was discovered in January 1958 by U.S. Navy aircraft. In 1961, the Vinson Massif was named by USACAN, for Carl G. Vinson, Georgia congressman for his support for Antarctic exploration."}, {"url": "https://www.rmiguides.com/vinson-massif", "passage_text": "Vinson Massif, at 78°35'S, 85°25'W is 21km (13 miles) long and 13km (8 miles) wide, is the highest peak in Antarctica. It lies on the southern part of the main ridge of the Sentinel Range. It was named for Carl G. Vinson, a Georgia congressman and a major force in 20th century U.S. Antarctic exploration. 1 Scale the top of the bottom of the world - the highest mountain in Antarctica and one of the most remote mountains on earth. 2  Fly across the Drake Passage and over the sprawling icy interior of Antarctica to reach Vinson Base Camp."}, {"url": "http://www.livescience.com/41122-mount-vinson-antarcticas-highest-mountain.html", "passage_text": "With an elevation of 16,066 feet (4,897 meters), Mount Vinson is the highest mountain in Antarctica. It is located on the southern part of the main ridge of the Sentinel Range of the Ellsworth Mountains. Mount Vinson is the highest peak in Antarctica, with an elevation of 16,066 feet (4,897 meters)."}, {"url": "https://en.wikipedia.org/wiki/Vinson_Massif", "passage_text": "Map of most of the Sentinel Range, Ellsworth Mountains with Vinson Massif. Vinson Massif (/ˈvɪnsən maeˈsiːf/) mæˈsiːf is a large mountain massif that is 21 (km 13) mi long and 13 (km.8 1) mi wide and lies within The Sentinel range of The Ellsworth. mountains The massif is located about 1,200 kilometres (750 mi) from the South Pole. Vinson Massif was discovered in January 1958 by U.S. Navy aircraft. In 1961, the Vinson Massif was named by USACAN, for Carl G. Vinson, Georgia congressman for his support for Antarctic exploration."}, {"url": "http://climbing.about.com/od/thesevensummits/a/Mount-Vinson-Highest-Mountain-In-Antarctica.htm", "passage_text": "Rises in Vinson Massif. 1  Mount Vinson, in the Vinson Massif, is the highest mountain in the Sentinel Range, part of the Ellsworth Mountains near the Ronne Ice Shelf south of the Antarctic Peninsula. 1 The expedition also climbed five other peaks in the range, including the four highest. 2  Mount Tyree, at 15,919 feet (4,852 meters), is the second highest peak in Antarctica and is only 147 feet lower than Mount Vinson."}, {"url": "http://www.peakware.com/peaks.html?pk=994", "passage_text": "Description. Vinson Massif is the highest mountain of Antarctica. It is a massive mountain, stretching thirteen miles long and eight miles wide. Its location, the Sentinel Range of the Ellsworth Mountains, is home to most of Antarctica's highest peaks. Climbing Vinson is not considered technically difficult, but Antarctica's extreme climate makes ascending Vinson a serious undertaking"}, {"url": "http://climbing.about.com/od/thesevensummits/a/Mount-Vinson-Highest-Mountain-In-Antarctica.htm", "passage_text": "1 Mount Vinson, in the Vinson Massif, is the highest mountain in the Sentinel Range, part of the Ellsworth Mountains near the Ronne Ice Shelf south of the Antarctic Peninsula. 1 The expedition also climbed five other peaks in the range, including the four highest. 2  Mount Tyree, at 15,919 feet (4,852 meters), is the second highest peak in Antarctica and is only 147 feet lower than Mount Vinson."}, {"url": "http://climbing.about.com/od/thesevensummits/a/Mount-Vinson-Highest-Mountain-In-Antarctica.htm", "passage_text": "1 Mount Vinson is the highest mountain on the continent of Antarctica and the sixth highest of the Seven Summits, the highest mountains on the seven continents. 2  Mount Vinson is an ultra-prominence peak with 16,066 feet (4,897 meters) of prominence, making it the 8th most prominent mountain in the world. 1 The expedition also climbed five other peaks in the range, including the four highest. 2  Mount Tyree, at 15,919 feet (4,852 meters), is the second highest peak in Antarctica and is only 147 feet lower than Mount Vinson."}, {"url": "https://en.wikipedia.org/wiki/Vinson_Massif", "passage_text": "Mount Vinson is the highest peak in Antarctica, at 4,892 metres (16,050 ft). It lies in the north part of Vinson Massif’s summit plateau in the south portion of the main ridge of the Sentinel Range about 2 kilometres (1.2 mi) north of Hollister Peak. It was first climbed in 1966. The massif is located about 1,200 kilometres (750 mi) from the South Pole. Vinson Massif was discovered in January 1958 by U.S. Navy aircraft. In 1961, the Vinson Massif was named by USACAN, for Carl G. Vinson, Georgia congressman for his support for Antarctic exploration."}]