[{"url": "https://en.wikipedia.org/wiki/Social_Democratic_Party", "passage_text": "From Wikipedia, the free encyclopedia. This article is about parties whose literal names are the Social Democratic Party or something similar. For a broader list of parties considered to follow the principles of social democracy, see List of social democratic parties. The name Social Democratic Party or Social Democrats has been used by a large number of political parties in various countries around the world."}, {"url": "http://socialism.wikia.com/wiki/Social_Democracy", "passage_text": "76 pages on this wiki. Symbol of Socialist International and Social Democrats. Social Democracy is a political philosophy founded around Marx's time. Initially, social democracy referred to socialism but later came to mean a political philosophy favoring reform over revolution as a way to achieve socialism."}, {"url": "http://www.thefreedictionary.com/social+democracy", "passage_text": "Noun. 1. social democracy-the belief in a gradual transition from capitalism to socialism by democratic means. ideology, political orientation, political theory-an orientation that characterizes the thinking of a group or nation.1  Facebook.2  Twitter."}, {"url": "http://www.merriam-webster.com/dictionary/social%20democracy", "passage_text": "Full Definition of SOCIAL DEMOCRACY. 1. : a political movement advocating a gradual and peaceful transition from capitalism to socialism by democratic means.2. : a democratic welfare state that incorporates both capitalist and socialist practices. — social democrat noun."}, {"url": "http://www.oxforddictionaries.com/definition/english/social-democracy", "passage_text": "noun. A socialist system of government achieved by democratic means: there was a growth of social democracy through an extension of the rights of citizens. More example sentences. 1  On yet further occasions, she seems to represent a new intellectual phenomenon: militant social democracy."}, {"url": "http://www.youtube.com/watch?v=OvJ8YDma7Wk", "passage_text": "The Friedrich-Ebert-Stiftungs's Academy for Social Democracy explains: social democracy. This is Juliane. She is a politics student. Together with her flatmate, Marco, she is talking about social democracy. Marco only had a rough idea about it until now."}, {"url": "http://www.wisegeek.org/what-is-a-social-democracy.htm", "passage_text": "Adorable animal families that will make you aww. A social democracy is a government that uses democratic process but has several characteristics that resemble those of a socialist society. Social democrats typically are committed to acting for the common good."}, {"url": "https://en.wikipedia.org/wiki/Social_democracy", "passage_text": "Alternatively, social democracy is defined as a political ideology that advocates a peaceful, evolutionary transition of society from capitalism to socialism using established political processes. Contemporary social democracy emerged out of the socialist movement as a distinct political ideology in the post-war era."}, {"url": "http://rationalwiki.org/wiki/Social_democracy", "passage_text": "Social democracy is the idea that the state needs to provide security and equality for its people and should actively reorder society in a way that is conducive to such developments, but that such changes should be brought about gradually, legitimated by a democratically-elected majority."}]