[{"url": "http://www.answers.com/Q/What_is_the_difference_between_factory_and_plant", "passage_text": "Although the word 'plant' as several meanings, in this answer we will just deal with its use when referring to 'industrial' matters. But first we will consider 'factory'. A FACTORY is a building or buildings where something is manufactured, i.e. where manufacturing processes are carried out. (from Latin factor, 'maker') PLANT, in the industrial/manufacturing sense, has two meanings: The first recorded use of the word plant to mean 'the building for an industrial process', was in 1789. "}, {"url": "http://cityroom.blogs.nytimes.com/2011/03/22/triangle-fire-the-building-survives/", "passage_text": "The onetime Asch Building, whose top three floors were occupied by the Triangle Waist Company, is now the Brown Building of Science, where New York University students and scientists occupy laboratories devoted to biology and chemistry. Eric Michael Johnson for The New York Times The onetime Asch Building, once the site of the Triangle Waist Company, is now the Brown Building of Science, housing New York University laboratories devoted to biology and chemistry. Loading... 1  Previous Post Albany, 8:41 A.M."}, {"url": "https://en.wikipedia.org/wiki/The_Factory", "passage_text": "The Decker Building, second location of the Factory. The Factory was the name of Andy Warhol 's New York City studio, which had three different locations between 1962 and 1984. The original Factory was on the fifth floor at 231 East 47th Street, in Midtown Manhattan. The rent was one hundred dollars a year. In 1968, Warhol moved the Factory to the sixth floor of the Decker Building, 33 Union Square West, near Max's Kansas City, a club which Warhol and his entourage frequently visited. By the time Warhol had achieved a reputation, he was working day and night on his paintings."}, {"url": "http://www.enotes.com/homework-help/why-did-granger-propose-that-mirror-factory-first-21129", "passage_text": "(Answer #2). Come on now, we're going to go build a mirror factory first and put out nothing but mirrors for the next year and take a long look in them.. Granger suggests that building a mirror factory is the first thing that they do to rebuild a society because that was the biggest problem in Montag's society. People stopped looking at who they really were and just became whoever and whatever the society dictated. Firemen were firemen by virtue of their looks. "}, {"url": "http://www.understandconstruction.com/concrete-frame-structures.html", "passage_text": "Concrete frame structures are a very common-or perhaps the most common-type of modern building. As the name suggests, this type of building consists of a frame or skeleton of concrete. Horizontal members of this frame are called beams, and vertical members are called columns. "}, {"url": "http://www.thefreedictionary.com/factory", "passage_text": "factory. 1. 'factory'. A building where machines are used to make things is usually called a factory. I work in a cheese factory. He visited several factories which produce domestic electrical goods. 2. 'works'. A place where things are made or where an industrial process takes place can also be called a works. Manufacture refers to the process of making goods using machines. Manufacture is an uncountable noun. The chemical is used in the manufacture of plastics. 2. 'factory'. Don't use 'manufacture' to refer to a building where machines are used to make things."}, {"url": "https://en.wikipedia.org/wiki/Factory", "passage_text": "Volkswagen factory in Wolfsburg, Germany. A factory (previously manufactory) or manufacturing plant is an industrial site, usually consisting of buildings and machinery, or more commonly a complex having several buildings, where workers manufacture goods or operate machines processing one product into another. According to translations of Demosthenes and Herodotus, Naucratis was a, or the only, factory in the entirety of ancient Egypt. A source of 1983 (Hopkins), states the largest factory production in ancient times was of 120 slaves within 4th century BC Athens."}]