[{"url": "http://www.answers.com/Q/What_is_the_average_minor_league_baseball_players_salary", "passage_text": "Confidence votes 469. Minor League Baseball player contracts are handled by the Major League Baseball office. Here are the salary ranges: First contract season: $850/month maximum. After that, open to negotiation Alien Salary Rates: Different for aliens on visas--mandated by INS (Immigration). After the first year, there is no monthly maximum so the player could make more. All contracts are negotia … ted by the major league team. The minor league team is responsible for operational expenses but not for contract expenses."}, {"url": "http://www.si.com/mlb/2014/02/12/minor-league-baseball-players-lawsuit", "passage_text": "While the minimum salary in Major League Baseball is $500,000, many minor league players earn less than the federal poverty level, which is $11,490 for a single person and $23,550 for a family of four. Not all minor leaguers are poorly paid. The lawsuit portrays minor league players as members of the working poor, and that's backed up by data. Most earn between $3,000 and $7,500 for a five-month season. As a point of comparison, fast food workers typically earn between $15,000 and $18,000 a year, or about two or three times what minor league players make."}, {"url": "http://www.baseball-reference.com/bullpen/Minimum_salary", "passage_text": "The minimum salary is the lowest amount which a club can pay a player for a full season in the major leagues. Its amount is set in the Collective Bargaining Agreement. In the 2002 CBA, the minimum Major League Baseball salary was raised by 50% to $300,000. "}, {"url": "http://ftw.usatoday.com/2014/03/minor-leaguers-working-poor-lawsuit-mlb-bud-selig", "passage_text": "While the minimum salary in Major League Baseball is $500,000, many minor league players earn less than the federal poverty level, which is $11,490 for a single person and $23,550 for a family of four…. The three players suing baseball also stress that minor league salaries have effectively declined in recent decades. As a point of comparison, fast food workers typically earn between $15,000 and $18,000 a year, or about two or three times what minor league players make."}, {"url": "http://www.lineupforms.com/minor-league-baseball-salaries.html", "passage_text": "The last pick in the draft, which goes forty rounds, is slotted for a $10,000 signing bonus. This is the Minor League baseball pay scale for a player’s first three years, as of 2010. Level First Year Second Year Third Year. Rookie $1150 monthly $1200 monthly $1250 monthly. Short Season A $1150 monthly $1200 monthly $1250 monthly. Minor League Baseball Salaries. The average Major League Baseball salary a little over three million dollars. Good work if you can get it. Of course, few can get it. And before becoming a Major Leaguer a ballplayer has to make his way through the Minor Leagues where the pay scale isn’t as generous."}, {"url": "http://www.answers.com/Q/What_is_the_average_minor_league_baseball_players_salary", "passage_text": "The maximum a first year minor leaguer can make is $1,100 a month. After the first year, there is no monthly maximum so the player could make more. All contracts are negotia … ted by the major league team. The minor league team is responsible for operational expenses but not for contract expenses."}, {"url": "http://www.baseballamerica.com/minors/players-sue-for-better-salaries/", "passage_text": "That leaves minor league salaries typically ranging from $1,100 a month in short-season leagues to $2,150 a month for Triple-A, figues asserted in the lawsuit and confirmed by two major league front-office officials. One team official confirmed that first-year player salaries are set by the commissioner’s office. "}, {"url": "http://www.ehow.com/info_8129883_average-salary-minor-league-player.html", "passage_text": "The average salary for a Major League baseball player was set to hit $4.25 million in 2015, and that doesn't include the $100.50 per day in meal money on road trips. The maximum first-year player salary in the minor leagues is $1,100 per month, a figure regulated by Major League Baseball. After that, annual pay is up to negotiation between player and team. However, minor league players have little leverage in negotiation"}, {"url": "http://ftw.usatoday.com/2014/03/minor-leaguers-working-poor-lawsuit-mlb-bud-selig", "passage_text": "The lawsuit portrays minor league players as members of the working poor, and that’s backed up by data. Most earn between $3,000 and $7,500 for a five-month season. As a point of comparison, fast food workers typically earn between $15,000 and $18,000 a year, or about two or three times what minor league players make."}]