[{"url": "http://healthyeating.sfgate.com/carbohydrates-butternut-squash-carrots-1387.html", "passage_text": "Carbohydrates in Carrots. Most vegetables contain around 5 grams of carbohydrates, but carrots contain more. One cup of raw carrots contains a little over 12 grams of carbohydrates and 3 grams of fiber. If you consume 2,000 calories a day, 900 to 1100 of those calories should come from carbohydrates. There are four calories in a gram of carbohydrates, so a 2,000-calorie meal plan should include 225 to 275 grams of carbohydrates."}, {"url": "http://woman.thenest.com/carbs-fiber-cup-acorn-squash-11171.html", "passage_text": "Soluble fiber helps prevent surges in blood sugar after you eat carbohydrates. It also lowers levels of cholesterol. One cup of baked, cubed acorn squash has 9 grams of total fiber, or 36 percent of women’s recommended 25 grams of daily fiber. If you’re not used to eating that much fiber, add it to your diet gradually. Winter squashes keep well for at least one month in a cool, dry place, but don’t put them in your refrigerator for long-term storage. You'll get 115 calories and 2 grams of protein from 1 cup of baked, cubed acorn squash."}, {"url": "http://woman.thenest.com/carbs-fiber-cup-acorn-squash-11171.html", "passage_text": "One cup of baked, cubed acorn squash has 30 grams of total carbohydrates. The Food and Nutrition Board of the Institute of Medicine recommends that women should consume 130 grams of carbohydrates daily, so this serving supplies 23 percent of your total carbohydrates. Winter squashes keep well for at least one month in a cool, dry place, but don’t put them in your refrigerator for long-term storage. You'll get 115 calories and 2 grams of protein from 1 cup of baked, cubed acorn squash."}, {"url": "http://healthyeating.sfgate.com/carbohydrates-butternut-squash-carrots-1387.html", "passage_text": "The recommended dietary allowance for fiber is 30 to 38 grams for men and 21 to 25 grams for women. Butternut squash is considered a starchy vegetable because it is an excellent source of carbohydrates and fiber. One cup of cooked butternut squash contains 21.5 grams of carbohydrates and 6.6 grams of fiber. If you consume 2,000 calories a day, 900 to 1100 of those calories should come from carbohydrates. There are four calories in a gram of carbohydrates, so a 2,000-calorie meal plan should include 225 to 275 grams of carbohydrates."}, {"url": "http://www.livestrong.com/article/240393-list-of-vegetables-how-many-carbohydrates-they-contain/", "passage_text": "One medium carrot, one of the most common root vegetables, contains 6 grams of total carbohydrates and almost 2 grams of fiber. One small baked potato has 29 grams of carbs and 3 grams of fiber. Cooked onions contain 7 grams of carbohydrates and almost 2 grams of fiber in one cup. Similar vegetables contain the following amount of carbohydrates in one cup servings: almost 9 grams carbohydrates and 2.5 grams fiber in eggplant, about 2 grams carbohydrates and almost 2 grams fiber in pumpkin and 5 grams carbohydrates and 2 grams fiber in zucchini."}]