[{"url": "http://www.scrubly.com/blog/how-to-outlook/android-contacts-and-outlook-contacts-whats-the-difference/", "passage_text": "If the contacts you add to your Android phone are not showing up in Outlook after syncing, it could be that your default contact type is set to Phone or Gmail. To change the default Contact Type setting, follow the steps below. Start Contacts and make sure the Contacts tab is selected. 1  Always ask. 2  Phone. 3  SIM. "}, {"url": "http://www.androidheadlines.com/2013/02/android-how-to-addremove-contacts-from-the-people-app.html", "passage_text": "3. Tap on the Contact. 4. Tap the Menu button. 5. Tap the Delete option. 6. Tap “OK” on the confirmation dialog box. It’s just that easy to add and remove contacts in the new People app. Not to hard or different from earlier versions of the Contacts app in pre-Android 4.0 versions."}, {"url": "http://answers.microsoft.com/en-us/outlook_com/forum/opeople-ocontacts/managing-contacts-in-outlookcom-android-app/3cfaa2a3-cca3-4479-b7ff-784dec3c169f", "passage_text": "I am using Android 4 and I have installed the last release of Outlook app (april, 16th). It synchronizes the emails, contacts and calendar very well. When I want to add a new contact, my phone only show me the telephone contact and gmail contact but I cannot see the outlook contact account. To add or edit contacts from Android native apps the Microsoft account must be set up as Corporate and set to sync contacts. To add or edit all calendars in a Microsoft account from Android native apps the Outlook app must be installed and set to sync calendars."}, {"url": "http://winsupersite.com/article/windows-live/outlookcom-tip-configure-android-ios-143977", "passage_text": "But you can find your Outlook.com-based calendar information in Android’s Calendar app. Likewise, contacts are also accessible from the Android People and Phone apps for obvious reasons. Apple uses a centralized accounts mechanism in Settings, and since Outlook.com is a full Exchange ActiveSync (EAS) service, you can use the Exchange account type to configure this account. To do so, visit Settings and then Mail, Contacts, Calendars. Then, tap Add Account. In the Add Account screen, tap Microsoft Exchange. In this screen, enter your email address (whatever@outlook.com), username (whatever@outlook.com, same as the email address field), password, and a description (like “Outlook.com” or whatever). You can leave the domain field blank. Then, tap Next"}, {"url": "http://answers.microsoft.com/en-us/outlook_com/forum/oemail-oapps/now-i-cant-edit-contact-and-add-new-contact-to/679aab49-aa8d-4774-be2f-72f971b6fde0", "passage_text": "- Add/edit synced outlook.com contacts in the phone book on my Android phone by using the HTC built-in phone book. If I try to add new contacts in the phone, my only options are to add to my phone or to a Gmail account only. - I'm using Outlook.com app on my Android, HTC Incredible S. - No error. Note: If I click edit contact, the Edit option would appear for 2 seconds and disappear. Leaving me to view only. The way this works is when you choose to add a new contact from People (the address book that came with my android), you can choose to use the contact editor and then you can choose to create the contact under my outlook.com account. This works, but is not really elegant."}, {"url": "http://smallbusiness.chron.com/can-import-contacts-outlook-android-74184.html", "passage_text": "Syncing with Microsoft Exchange. Download the Outlook.com application from the Play Store. Tap “All Apps,” choose “Play Store” and search for “Outlook.” Tap the program name in the search results to view the download page. Add the program to your phone by tapping “Install,” and launch it by tapping “Open.”. Step 2. "}, {"url": "http://www.greenbot.com/article/2898738/outlook-for-android-adds-contact-sync-calendar-tweaks-and-speed.html", "passage_text": "Comments. Outlook for Android is getting more people-friendly with some tweaks to the contacts section in a version 1.1 update. The email app (finally) syncs up with your phone's address book and displays additional details about each person. You can now touch a contact to email or start a phone call with them. "}, {"url": "https://support.office.com/en-us/article/Troubleshooting-Outlook-for-iOS-and-Android-c6a5f598-3130-4675-a817-4ecf69cd4b7a", "passage_text": "I have contacts in Outlook Desktop that I can’t see in Outlook for iOS or Android. If you’ve added contacts locally in Outlook Desktop on your PC, such as those associated with a POP account, you can export them and sync them to your phone using an Outlook.com account. Select Outlook 2010 & Outlook 2013 on the next screen, and follow the instructions to copy your local contacts to the Outlook.com account from Outlook Desktop on your PC. After you import your contacts to Outlook.com, simply add your Outlook.com account to"}, {"url": "http://winsupersite.com/article/windows-live/outlookcom-tip-configure-android-ios-143977", "passage_text": "Android. To access your Outlook.com email on an Android-based smart phone or tablet, you’ll need Microsoft’s free Hotmail app, which is available both from Google Play and from Amazon’s AppStore for Android. So let's start with that. Apple uses a centralized accounts mechanism in Settings, and since Outlook.com is a full Exchange ActiveSync (EAS) service, you can use the Exchange account type to configure this account. To do so, visit Settings and then Mail, Contacts, Calendars. Then, tap Add Account. In the Add Account screen, tap Microsoft Exchange. In this screen, enter your email address (whatever@outlook.com), username (whatever@outlook.com, same as the email address field), password, and a description (like “Outlook.com” or whatever). You can leave the domain field blank. Then, tap Nex"}]