[{"url": "https://www.irs.gov/uac/tax-benefits-for-disabled-taxpayers", "passage_text": "1 Earned Income Tax Credit EITC is available to disabled taxpayers as well as to the parents of a child with a disability.If you retired on disability, taxable benefits you receive under your employer’s disability retirement plan are considered earned income until you reach minimum retirement age. 1 Standard Deduction Taxpayers who are legally blind may be entitled to a higher standard deduction on their tax return. 2  Gross Income Certain disability-related payments, Veterans Administration disability benefits, and Supplemental Security Income are excluded from gross income."}, {"url": "https://www.irs.gov/uac/tax-benefits-for-disabled-taxpayers", "passage_text": "For more information on tax credits and benefits available to disabled taxpayers, see Publication 3966, Living and Working with Disabilities or Publication 907, Tax Highlights for Persons with Disabilities, available on the IRS website at http://www.irs.gov or by calling 800-TAX-FORM (800-829-3676). 1 Standard Deduction Taxpayers who are legally blind may be entitled to a higher standard deduction on their tax return. 2  Gross Income Certain disability-related payments, Veterans Administration disability benefits, and Supplemental Security Income are excluded from gross income."}, {"url": "http://myarmybenefits.us.army.mil/Home/Benefit_Library/Federal_Benefits_Page/Federal_Taxes_on_Veterans_Disability_or_Military_Retirement_Pensions.html?serv=147", "passage_text": "Military retirement pay based on age or length of service is considered taxable income for Federal income taxes. However, military disability retirement pay and Veterans' benefits, including service-connected disability pension payments, may be partially or fully excluded from taxable income. Benefit Highlights: Military Retirement Pay. Military retirement pay based on age or length of service is taxable and must be included as income for Federal income taxes. The amount a Retiree pays to participate in the Survivors Benefit Plan (SBP) is"}, {"url": "http://www.parkertaxpublishing.com/public/Preparing_Return_Disabled_Veteran.html", "passage_text": "VA disability compensation is nontaxable to the veteran or survivor and is not reported on any tax forms. The veteran will receive a report showing any adjustments due to cost-of-living adjustments (COLA) or other changes affecting the monthly benefit during the year. Thus, for the 2012 tax year, the adjustment is $2,294 ($1,614 ($538 3) + $680 ($340 2)). (3) The adjustment is reported on the Other income line of Form 1040 as a negative number with the notation VA Disability Adjustment See Attachments included on the dotted line."}, {"url": "http://www.benefits.va.gov/COMPENSATION/types-disability.asp", "passage_text": "Disability Compensation. Disability compensation is a monthly tax-free benefit paid to Veterans who are at least 10% disabled because of injuries or diseases that were incurred in or aggravated during active duty, active duty for training, or inactive duty training. "}, {"url": "http://myarmybenefits.us.army.mil/Home/Benefit_Library/Federal_Benefits_Page/Federal_Taxes_on_Veterans_Disability_or_Military_Retirement_Pensions.html?serv=147", "passage_text": "Soldiers with service-connected disabilities may be eligible for Federal income tax exclusions of Veterans' benefits and disability pension payments. Benefit Highlights: Military Retirement Pay. Military retirement pay based on age or length of service is taxable and must be included as income for Federal income taxes. The amount a Retiree pays to participate in the Survivors Benefit Plan (SBP) is excluded from taxable income."}, {"url": "https://www.irs.gov/uac/tax-benefits-for-disabled-taxpayers", "passage_text": "Taxpayers with disabilities and parents of children with disabilities may qualify for a number of IRS tax credits and benefits. Listed below are seven tax credits and other benefits which are available if you or someone else listed on your federal tax return is disabled. 1 Standard Deduction Taxpayers who are legally blind may be entitled to a higher standard deduction on their tax return. 2  Gross Income Certain disability-related payments, Veterans Administration disability benefits, and Supplemental Security Income are excluded from gross income."}, {"url": "http://www.benefits.va.gov/COMPENSATION/types-compensation.asp", "passage_text": "Disability Compensation. A tax-free monetary benefit paid to Veterans with disabilities that are the result of a disease or injury incurred or aggravated during active military service. The benefit amount is graduated according to the degree of the Veteran's disability on a scale from 10 percent to 100 percent (in increments of 10 percent). Types of Compensation. VA disability compensation provides monthly benefits to Veterans in recognition of the effects of disabilities, diseases, or injuries"}, {"url": "http://www.military.com/benefits/veteran-benefits/veteran-disability-compensation.html", "passage_text": "Veteran Disability Compensation. If you are military veteran with a service-related disability you may qualify for over $3,300 in monthly benefits. These benefits are paid to veterans who have injuries or diseases that happened while on active duty, or were made worse by active military service. "}, {"url": "http://www.military.com/money/personal-finance/taxes/injured-veterans-receive-tax-benefits.html", "passage_text": "Through the Department of Veterans Affairs (VA), veterans can receive a wide range of benefits, such as those related to disability, pensions and severance pay. If you are a veteran, you may qualify for a number of benefits that may make a significant impact when it comes time to file your individual income tax return. The VA offers financial compensation in certain circumstances. "}]