[{"url": "http://matadornetwork.com/trips/27-of-the-deepest-canyons-you-can-explore-pics/", "passage_text": "9. The second largest canyon in the United States, the “Grand Canyon of Texas” is 120 miles long with depths up to 997 feet. Georgia O’Keefe often visited and painted the canyon when she taught at West Texas State Normal College."}, {"url": "http://webecoist.momtastic.com/2009/01/03/largest-deepest-canyons-gorges/", "passage_text": "The Yarlung Zangbo Grand Canyon in China has a length of approximately 150 miles and bends around Mount Namcha Barwa and through the eastern Himaylayan range. The Yarlung Trangpo River (the ‘purifier’) is now commonly called ‘Zangbo’ since it runs through the gorge."}, {"url": "http://www.cleveland.com/travel/index.ssf/2012/09/us_gorges_that_claim_to_be_the.html", "passage_text": "• Pine Creek Gorge, near Wellsboro in north-central Pennsylvania, stretches almost 50 miles long and is up to 1,000 feet deep. Known as the Grand Canyon of Pennsylvania, Pine Creek can be accessed via Leonard Harrison and Colton Point state parks."}, {"url": "http://10mosttoday.com/10-most-breathtaking-canyons-in-the-world/", "passage_text": "1. Grand Canyon, Arizona – The Grand Canyon is a steep-sided canyon carved by the Colorado River in Arizona, United States. The Grand Canyon is one of the world’s largest canyons, it is 277 miles (446 km) long, up to 18 miles (29 km) wide and attains a depth of over a mile (6,000 feet or 1,800 meters)."}, {"url": "http://www.roadstothefuture.com/New_River_Gorge_Br.html", "passage_text": "The US-19 New River Gorge Bridge was completed near Fayetteville, West Virginia on October 22, 1977, and this completed the last link in Appalachian Corridor L. This article relies mostly on other websites, and I'll post a series of links with excerpted information here."}, {"url": "http://webecoist.momtastic.com/2009/01/03/largest-deepest-canyons-gorges/", "passage_text": "The Grand Canyon is a gorge carved by the Colorado River and is contained in the Grand Canyon National Park in Arizona, one of the first national parks in the United States. According to scientific research the canyon was created by the Colorado River over a period of six million years."}, {"url": "http://10mosttoday.com/10-most-breathtaking-canyons-in-the-world/", "passage_text": "It is the second largest canyon in the world and the largest in Africa, as well as the second most visited tourist attraction in Namibia. It features a gigantic ravine, in total about 100 miles (160 km) long, up to 27 km wide and in places almost 550 metres deep. Fish River Canyon, Namibia (source wiki)."}]