[{"url": "http://monster.wikia.com/wiki/Dhampir", "passage_text": "Two Dampirs. A painting of a Dhampir. Dhampirs is the child of a Human and a Vampire. Dhampir powers are similar to vampires, but without the usual weaknesses. Dhampir are referred as any hybrid of one human and one vampire parent; they are half-breeds not vampirs themselves. "}, {"url": "http://vampireacademy.wikia.com/wiki/Dhampir", "passage_text": "Birth Edit. Dhampirs were originally born through the union of a Moroi and a human in the years before the Dark Ages. Through this union created a half-vampire and half-human. Today, they are born through a Moroi (male/female) and another Dhampir (male/female). Reproduction Edit. Both dhampirs (female dhampir and male dhampir) can't have any children. In Bloodlines it states that dhampirs can have children with humans, though it doesn't state what that child would be. This causes the Dhampir race to stay near the Moroi race so that they are able to reproduce with them."}, {"url": "http://unnaturalworld.wikia.com/wiki/Dhampir", "passage_text": "A Dhampir, also called a Daywalker, is the child of a vampire father and a human mother. They are basically Human/Vampire Hybrids. Dhampir have the powers of a vampire, as their powers are similar to those of vampires, but without all of the usual weaknesses. Dhampirs are adept at detecting, hunting, and killing vampires."}, {"url": "http://www.urbandictionary.com/define.php?term=Dhampir", "passage_text": "The offspring of a vampire and a human, a dhampir is generally portrayed as one with all or most powers of a vampire, with few to no disadvantages. This is sometimes reversed, depending on the context and writer. "}, {"url": "https://en.wikipedia.org/wiki/Dhampir", "passage_text": "A dhampir in Balkan folklore is a creature that is the result of a union between a vampire and a human. The term is sometimes spelled dhampyre, dhamphir, or dhampyr. Dhampir powers are similar to those of vampires, but without the usual weaknesses. In recent vampire fiction, dhampir refers to any hybrid of one human and one vampire parent. They are not vampires themselves, but a half-breed of both"}, {"url": "http://unnaturalworld.wikia.com/wiki/Dhampir", "passage_text": "Dhampir. Most believe that your kind are merely legends. It's rare to see a live Dhampir. Part vampire, part human. Mostly they die at birth. Generally they are exterminated. Dhampirs are rarely a product of a happy union between a vampire and a human. They are basically Human/Vampire Hybrids. Dhampir have the powers of a vampire, as their powers are similar to those of vampires, but without all of the usual weaknesses. Dhampirs are adept at detecting, hunting, and killing vampires."}, {"url": "http://whitewolf.wikia.com/wiki/Dhampir", "passage_text": "A dhampir is another name for a half-vampire , the product of a human and vampire parentage. Dhampir were originally thought of as an impossibility, but in the Final Nights, they not only came into being, but became disturbingly more common. "}, {"url": "http://www.pathfindercommunity.net/tyler-s-pathfinder-guides/race-of-pathfinder-an-optimization-guide/races-of-pathfinder-featured-races/dhampir", "passage_text": "Dhampir are the result of either an unlikely love between a vampire and a human or, well... something much more disturbing. Either way, they are generally beautiful in an unearthly way, and may look sickly and frail to some. "}]