[{"url": "http://www.brianmac.co.uk/predictrdee.htm", "passage_text": "Resting Daily Energy Expenditure. Using your weight, height and age it is possible to determine your resting daily energy expenditure (RDEE). This method was validated by Harris and Benedict (1919) using closed circuit spirometry. 1 (2013) Impact of insufficient sleep on total daily energy expenditure, food intake, and weight gain. 2  Proceedings of the National Academy of Sciences, 110 (14), p. 5695-5700. 3  JOHANNSEN, D. L. et al. ( 4 2010) Accuracy of armband monitors for measuring daily energy expenditure in healthy adults."}, {"url": "http://www.health-calc.com/diet/energy-expenditure-advanced", "passage_text": "This is a very precise metabolic calculator. It calculates your resting metabolic rate and your total energy consumption in calories or kilojoules. This can be a helpful tool for weight loss as it allows you to estimate the amount of calories that represents your energy balance. If you eat less than this, you will lose weight."}, {"url": "http://www.acefitness.org/certifiednewsarticle/2882/resting-metabolic-rate-best-ways-to-measure-it-and/", "passage_text": "The rate at which these processes occur is measured in calories per unit of time, and is most often given in calories per day. The term basal metabolic rate (BMR) is often confused and/or interchanged with RMR or resting energy expenditure (REE). "}, {"url": "http://www.calculatorpro.com/calculator/daily-energy-expenditure-calculator/", "passage_text": "The daily energy expenditure calculator exactly as you see it above is 100% free for you to use. If you want to customize the colors, size, and more to better fit your site, then pricing starts at just $29.99 for a one time purchase. Click the Customize button above to learn more! CALCULATORS: "}, {"url": "https://en.wikipedia.org/wiki/Basal_metabolic_rate", "passage_text": "Basal metabolic rate (BMR) is the minimal rate of energy expenditure per unit time by endothermic animals at rest. (McNab, B. K. 1997). On the Utility of Uniformity in the Definition of Basal Rate of Metabolism. Physiol. Zool. Vol.70; Metabolism refers to the processes that the body needs to function. "}, {"url": "https://en.wikipedia.org/wiki/Resting_energy_expenditure", "passage_text": "Resting energy expenditure, abbreviated as REE, is the amount of energy, usually expressed in kcal (food calories), required for a 24-hour period by the body during resting conditions. It is closely related to, but not identical to, basal metabolic rate. "}, {"url": "https://www.healthstatus.com/calculate/dee", "passage_text": "A new predictive equation for resting energy expenditure in healthy individuals. Am J Clin Nutr. 1990; 51: 241-247. Add the results of this calculation to the results of the Calories Burned calculator and you will know how many total calories you burn each day. "}, {"url": "http://www.health.harvard.edu/diet-and-weight-loss/exercise-and-weight-loss-the-importance-of-resting-energy-expenditure", "passage_text": "But it also boosts your resting energy expenditure — the rate at which you burn calories when the workout is over and you are resting. Resting energy expenditure remains elevated as long as you exercise at least three days a week on a regular basis. Because resting energy expenditure accounts for 60% to 75% of the calories you burn each day, any increase in resting energy expenditure is extremely important to your weight-loss effort. The kinds of vigorous activity that can stimulate your metabolism include walking briskly for two miles or riding a bike uphill. "}, {"url": "http://www.topendsports.com/testing/tests/bmr-equation.htm", "passage_text": "1 aim: to use formula to estimate metabolic rate at rest, and from that a daily energy expenditure. 2  equipment required: calculator, and scales for weight and tape measure for height. 3  procedure: See the procedures for height and weight. 4  Use the formula below to determine BMR, and daily energy expenditure. Described here are equations for estimating BMR-see also information about the direct measure of BMR and RMR. By multiplying BMR by an activity factor, you can determine how many calories are required each day to maintain body weight based on your daily activity level. 1  aim: to use formula to estimate metabolic rate at rest, and from that a"}]