[{"url": "http://www1.salary.com/OH/Occupational-Therapist-salary.html", "passage_text": "Within Ohio there is a lot of variation in Occupational Therapist salaries. These variations depend on on a wide range of factors from population to general competitiveness in the market. Plans and conducts individualized occupational therapy programs to help patients develop, regain, or maintain their ability to perform daily activities. Teaches patients skills/techniques and how to use adaptive equipment for participating in"}, {"url": "http://www.indeed.com/salary/q-Occupational-Therapy-Assistant-l-Ohio.html", "passage_text": "Average Occupational Therapy Assistant salaries for job postings in Ohio are 4% lower than average Occupational Therapy Assistant salaries for job postings nationwide. "}, {"url": "http://www.payscale.com/research/US/Job=Certified_Occupational_Therapy_Assistant_(COTA)/Hourly_Rate", "passage_text": "(United States). Certified Occupational Therapy Assistants in the United States pull down an average of $25.41 per hour. Lower pay rates hover around $18.94 per hour, and the higher rates verge on $34.14. This group's pay is mainly influenced by location, followed by the specific employer and tenure. The average Rehabilitation Director brings home $87K per year. Going from Certified Occupational Therapy Assistant to Occupational Therapist Assistant is the transition that occurs most often in this field, and the average paycheck for Occupational Therapist Assistants is $45K."}, {"url": "http://www1.salary.com/OH/Columbus/Occupational-Therapist-salary.html", "passage_text": "This chart describes the expected percentage of people who perform the job of Occupational Therapist in Columbus, OH that make less than that salary. For example 50% of the people who perform the job of Occupational Therapist in Columbus are expected to make less than the median. "}, {"url": "http://www.educationnews.org/career-index/occupational-therapy-schools-in-ohio/", "passage_text": "In Ohio, as the number of occupational therapy professionals is growing, the salaries earned by occupational therapy professionals are increasing. The mean salary for occupational therapy professionals in 2006 was $45,213 per year. And in 2010 the mean salary was $54,677 per year. This growth is mirrored by state trends for all professionals. There is a 109% pay differential between the highest paid occupational therapy professionals and those in the bottom 10% of the pay bracket. Thus, there is huge variation in pay, within the field of occupational therapy in Ohio."}, {"url": "http://salarybystate.org/tag/demand-for-occupational-therapist-2013", "passage_text": "Bureau of Labor Statistics information for states that an Occupational Therapist median salary in 2010 was $72,320 a year which is about $34.77 an hour. An occupational therapist typically requires a Master’s Degree in order to get this pay and a position in the job market. This will add around 36,400 jobs to the total occupational therapy job market from 2010 – 2020. Looking at the state by state salary information for Occupational Therapists you’ll see that the highest paying states pay as much as $100,000 year."}, {"url": "http://www.otcareerpath.com/aide/salary", "passage_text": "By April Johnson. The salaries of occupational therapy aides depend heavily on the employer, the state in which they are employed, and how much experience they have prior to starting the job. For those who have some experience, salaries may be a little higher. The Bureau of Labor and Statistics report for May 2014 shows the average annual salary for occupational therapy aides was $26,550. The top 10 percent earned about $44,220 annually, and the lowest 10 percent earned approximately $18,030 annually. "}, {"url": "http://www.payscale.com/research/US/Job=Occupational_Therapist_(OT)/Hourly_Rate", "passage_text": "(United States). Average Occupational Therapists in the United States make around $35.06 per hour. Earnings generally vary between $26.37 per hour and $46.17. While the particular city and the individual firm impact pay for this group, career length is the most influential factor. Among survey respondents, women are more common than men; 82 percent of Occupational Therapists are female."}, {"url": "http://www.indeed.com/salary/q-Occupational-Therapist-l-Ohio.html", "passage_text": "Average Occupational Therapist salaries for job postings in Ohio are 4% lower than average Occupational Therapist salaries for job postings nationwide. "}]