[{"url": "http://www.alliedhealthworld.com/ohio-ekg-tech-salary.html", "passage_text": "Ohio EKG Tech Salaries. In 2009, the average hourly wage for EKG technicians in Ohio was $22.91, and the median EKG technician salary in Ohio was about $47,650 per year. It is, however, important to keep in mind that starting salaries for recent EKG program graduates are likely to be slightly lower because of inexperience."}, {"url": "http://www.alliedhealthworld.com/ohio-ekg-tech-salary.html", "passage_text": "A recent study found that about 25% of all EKG techs in Ohio make nearly $59,000 a year, while the top earning EKG professionals are making in the neighborhood of $68,000 a year. So, even though you may not start out earning top dollar, you should not feel discouraged."}, {"url": "http://www.wikiprofessional.org/EKG_Technician_Salary", "passage_text": "Instead, they group EKG technicians into the category of cardiovascular technologists and technicians. For these workers, the median salary in 2012 was $52,070 per year. Those in the lowest 10 percent of the field made $27,830 or less. Those in the top 10 percent commanded a salary of $80,790 or higher."}, {"url": "http://www.healthcare-salaries.com/technicians/ekg-technician-salary", "passage_text": "The median hourly wage for an EKG technician ranges from between $24.6 – $26.73 per hour. An EKG technician employed in an academic field receives an average annual salary of about $50,430 and an hourly wage of about $24.24."}, {"url": "http://www.simplyhired.com/salaries-k-ekg-technician-l-cincinnati-oh-jobs.html", "passage_text": "The average salary for ekg technician jobs in Cincinnati, OH is $32,000. Average ekg technician salaries can vary greatly due to company, location, industry, experience and benefits. This salary was calculated using the average salary for all jobs with the term ekg technician anywhere in the job listing."}, {"url": "http://www.healthcare-salaries.com/technicians/ekg-technician-salary", "passage_text": "Certified EKG technician salary. An average hourly wage for a newly certified EKG technician in the United States ranges from between $9.73 – $17.51 per hour which gradually increases from $5.18 – $25.75 overtime. An average annual salary bonus of around $977 will be included and the total annual salary ranges from between $20,326 – $40,195."}]