[{"url": "http://www.justapinch.com/recipes/bread/other-bread/homemade-panko-bread-crumbs.html", "passage_text": "Push chunks of white bread through the shredding disk of the food processor to make coarse crumbs. 1. Spread the crumbs on a baking sheet and bake at 300 degrees until the crumbs are dry BUT NOT TOASTED, about 6 to 8 minutes. Shake the crumbs at least 2 times during the cooking process. Be careful not to let them brown !! 2. Immediately remove bread crumbs from oven and allow then to cool"}, {"url": "http://www.foodnetwork.com/recipes/alton-brown/homemade-italian-breadcrumbs-recipe.html", "passage_text": "Preheat the oven to 300 degrees F. Place all of the ingredients into a blender carafe, cover and pulse until coarse crumbs form, about 2 minutes. Spread the crumbs evenly on 2 half sheet pans and bake until the crumbs just begin to brown and are crisp, about 5 minutes. Cool the crumbs on the pans for 15 to 20 minutes, and then transfer to an airtight container and store at room temperature for up to 2 weeks. Recipe courtesy of Alton Brown, 2011."}, {"url": "http://www.food.com/recipe/homemade-panko-bread-crumbs-167729", "passage_text": "Directions. 1  Push chunks of white bread through the shredding disk of a food processor to make coarse crumbs. 2  Spread the crumbs on a baking sheet and bake at 300 F degrees until the crumbs are dry but not toasted, about 6 to 8 minutes. 3  Shake the sheet twice during baking. 1 Spread the crumbs on a baking sheet and bake at 300 F degrees until the crumbs are dry but not toasted, about 6 to 8 minutes. 2  Shake the sheet twice during baking. 3  Be careful not to let the crumbs brown!"}, {"url": "http://allrecipes.com/recipe/161123/fresh-panko/", "passage_text": "1 Push torn pieces of bread through the shredding disk of a food processor to make coarse crumbs. 2  Spread the crumbs on a baking sheet. 3  Bake in preheated oven until crumbs are dry but not toasted, 6 to 8 minutes. 1 Bake in preheated oven until crumbs are dry but not toasted, 6 to 8 minutes. 2  Shake the sheet twice during baking in order to evenly dry crumbs. 3  Remove from the oven and cool completely."}, {"url": "http://www.food.com/recipe/homemade-panko-bread-crumbs-167729", "passage_text": "1 Push chunks of white bread through the shredding disk of a food processor to make coarse crumbs. 2  Spread the crumbs on a baking sheet and bake at 300 F degrees until the crumbs are dry but not toasted, about 6 to 8 minutes. 3  Shake the sheet twice during baking. 1 Spread the crumbs on a baking sheet and bake at 300 F degrees until the crumbs are dry but not toasted, about 6 to 8 minutes. 2  Shake the sheet twice during baking. 3  Be careful not to let the crumbs brown!"}, {"url": "http://allrecipes.com/recipe/161123/fresh-panko/", "passage_text": "1 Spread the crumbs on a baking sheet. 2  Bake in preheated oven until crumbs are dry but not toasted, 6 to 8 minutes. 3  Shake the sheet twice during baking in order to evenly dry crumbs. 4  Remove from the oven and cool completely. 1 Bake in preheated oven until crumbs are dry but not toasted, 6 to 8 minutes. 2  Shake the sheet twice during baking in order to evenly dry crumbs. 3"}, {"url": "http://allrecipes.com/recipe/161123/fresh-panko/", "passage_text": "1 Preheat an oven to 300 degrees F (150 degrees C). 2  Push torn pieces of bread through the shredding disk of a food processor to make coarse crumbs. 3  Spread the crumbs on a baking sheet. 4  Bake in preheated oven until crumbs are dry but not toasted, 6 to 8 minutes. 1 Bake in preheated oven until crumbs are dry but not toasted, 6 to 8 minutes. 2  Shake the sheet twice during baking in order to evenly dry crumbs. 3  Remove from the oven and cool completely."}, {"url": "http://www.wikihow.com/Make-Panko-Bread-Crumbs", "passage_text": "Pan the bread crumbs. Spread them evenly on the baking sheets so that they will dry evenly in the oven and not burn. 5. Bake the bread crumbs. The goal here is to dry the bread crumbs, not to brown them. 1  Bake your panko bread crumbs for 4 minutes once the oven has reached the necessary temperature. 2  Shake the baking sheets to turn and shift the bread crumbs. 3  This will ensure that they dry evenly. 4  Bake the bread crumbs for another 4 minutes. The goal here is to dry the bread crumbs, not to brown them. 1  Bake your panko bread crumbs for 4 minutes once the oven has reached the necessary temperature. 2  Shake the baking sheets to turn and shift the bread crumbs. 3  Bake the bread crumbs for another 4 minutes. 4  6 Edit step."}, {"url": "http://allrecipes.com/recipe/161123/fresh-panko/", "passage_text": "Any white bread will do for making panko. An Asian chef swore that the best homemade panko came from Wonder Bread. The yield will vary according to how large you make your crumbs. Once cooled, crumbs may be stored in the freezer, in a resealable plastic bag for as long as several months. . 1 Bake in preheated oven until crumbs are dry but not toasted, 6 to 8 minutes. 2  Shake the sheet twice during baking in order to evenly dry crumbs. 3  Remove from the oven and cool completely."}]