[{"url": "http://www.simplestepsdental.com/SS/ihtSS/r.WSIHW000/st.32219/t.33417/pr.3.html", "passage_text": "Necrotizing Ulcerative Gingivitis (NUG). Necrotizing ulcerative gingivitis (NUG) is a condition affecting the gums that is caused by a bacterial infection. It is a form of periodontal (gum) disease. But unlike other forms, it typically develops quickly and causes moderate to severe pain. Necrotizing means that the condition destroys tissue. By your next visit, it is likely that the symptoms of NUG will have started to subside. Your dentist will clean the area more aggressively with a process called scaling and root planing. He or she will examine your other teeth to see if any are affected and will review your home-care instructions."}, {"url": "https://en.wikipedia.org/wiki/Acute_necrotizing_ulcerative_gingivitis", "passage_text": "Acute necrotizing ulcerative gingivitis (ANUG; colloquially known as trench mouth) is a common, non-contagious infection of the gums with sudden onset. The main features are painful, bleeding gums, and ulceration of inter-dental papillae (the sections of gum between adjacent teeth). The often severe gingival pain that characterizes ANUG distinguishes it from the more common chronic periodontitis which is rarely painful. ANUG is the acute presentation of necrotizing ulcerative gingivitis (NUG), which is the usual course the disease takes. If improperly treated or neglected, NUG may become chronic and/or recurrent"}, {"url": "https://en.wikipedia.org/wiki/Acute_necrotizing_ulcerative_gingivitis", "passage_text": "Acute necrotizing ulcerative gingivitis (ANUG) refers to the clinical onset of NUG. The word acute is used because usually the onset is sudden. Other forms of NUG may be chronic or recurrent. The often severe gingival pain that characterizes ANUG distinguishes it from the more common chronic periodontitis which is rarely painful. ANUG is the acute presentation of necrotizing ulcerative gingivitis (NUG), which is the usual course the disease takes. If improperly treated or neglected, NUG may become chronic and/"}, {"url": "http://dragonage.wikia.com/wiki/Nug", "passage_text": "1 In March, 2015, Heroes of Dragon Age introduced the epic Chocolate Nug, to celebrate Easter, as the top banner price during a PvP event. 2  Nugs seem to be related to Tuskets as Tuskets also drop Nugskin on kills. 3  Cole states that when nugs nuzzle a person's hand, it is its way of calling that person a friend. They can be prepared in a variety of ways such as nug pancakes and nug-gets. King Ansgar Aeducan adored nug-seared on a hot metal plate and finished in the oven—and dressed in a cream sauce flavoured with deep mushrooms."}, {"url": "http://www.urbandictionary.com/define.php?term=Nug", "passage_text": "2. nugs. cannabis bud that comes in nuggets of varying sizes. a sign of quality when it comes to bud; dank is almost always in this form, but nugs of mids are far less common. nugs of schwag are non-existent-- the closest thing to a schwag nug is dried-out shit from your ass."}, {"url": "http://www.marijuana.com/community/threads/nug.185845/", "passage_text": "it can get u pretty high. then theres nug. its light green and it will knock u on ur ass most of the time. hope tht helps. Mounty_Ninja said: ↑. what the hell is a nug i keep hearin people say it but i dunno what it means. im good on most other words its just this one i got trouble with. Click to expand... #9"}, {"url": "http://dragonage.wikia.com/wiki/Nug", "passage_text": "Dragon Age: Origins Edit. Nug tier progression in Heroes of Dragon Age. The Warden encounters nugs in the Commons, and may chase after lost ones to help out the Nug Wrangler Boermor. Additionally, a cute nug can be procured from the Idle Dwarf in Dust Town, which can be gifted to Leliana. She will then name it Schmooples. They can be prepared in a variety of ways such as nug pancakes and nug-gets. King Ansgar Aeducan adored nug-seared on a hot metal plate and finished in the oven—and dressed in a cream sauce flavoured with deep mushrooms."}]