[{"url": "http://acne.about.com/video/What-is-Cystic-Acne-.htm", "passage_text": "Cystic acne is the most severe form of acne and could require dermatological treatment to alleviate. In this health video from About.com, learn all about cystic acne and who can get it. Show transcript Hide transcript. Many times cystic acne can scar, so it's very important if you have cystic acne to see a dermatologist immediately. It's one of the forms of acne that cannot be treated with over-the-counter preparations because the acne really goes deep in the skin and it requires internal medication to treat it appropriately."}, {"url": "http://www.earthclinic.com/cures/cystic_acne.html", "passage_text": "Natural treatment options offer relief and treatment for cystic acne, considered the most severe form of acne. Cystic acne is characterized by inflamed breakouts that result in cysts formed under or on the skin. Also called nodulocystic acne, cystic acne is defined as deep, inflamed breakouts on the skin that involve the formation of cysts. Cysts typically feel like soft, fluid-filled lumps beneath the skin’s surface and are considered the most serious type of acne blemish."}, {"url": "http://acne.about.com/video/What-is-Cystic-Acne-.htm", "passage_text": "What is cystic acne? Cystic acne is a form of acne and it's the most severe form of acne. It's where you have large cysts or nodules that can occur anywhere on the face, the neck, the back, the chest and it can be very disturbing. Many times cystic acne can scar, so it's very important if you have cystic acne to see a dermatologist immediately. It's one of the forms of acne that cannot be treated with over-the-counter preparations because the acne really goes deep in the skin and it requires internal medication to treat it appropriately."}, {"url": "http://www.cysticacnehelp.com/what-is-cystic-acne/", "passage_text": "Cystic acne, or nodulocystic acne, is the most severe form of acne vulgaris. Deep, inflamed breakouts develop on the face and/or other areas of the body. The blemishes themselves can become large; some may measure up to several centimeters across. If you are suffering from a very painful pimple with a diameter of 5 mm or more, you probably have nodulocystic acne, also known as cystic acne. This type of acne forms deep within the skin and is one of the most severe forms"}, {"url": "http://www.medicalnewstoday.com/articles/103258.php", "passage_text": "Here are some key points about cystic acne. More detail and supporting information is in the body of this article. 1  Cystic acne is the most severe form of acne. 2  While acne is very common, cystic acne is relatively uncommon. 3  Cystic acne is. 4  caused by chocolate, nuts or greasy foods, nor by poor hygiene or masturbation. Acne, including cystic acne, is not caused by: 1  Chocolate, nuts, or greasy foods. 2  Most other dietary choices-research has found an association between intake of milk products and acne, as well as a high glycemic index diet and acne. 3  Poor hygiene or inadequate face washing. 4  Masturbation or sex"}, {"url": "http://www.medicinenet.com/image-collection/cystic_acne_picture/picture.htm", "passage_text": "Cystic acne is a type of abscess that is formed when oil ducts become clogged and infected. Cystic acne affects deeper skin tissue than the more superficial inflammation from common acne. Cystic acne is most common on the face and typically occurs in the teenage years. "}, {"url": "http://www.medicalnewstoday.com/articles/103258.php", "passage_text": "1 Cystic acne is the most severe form of acne. 2  While acne is very common, cystic acne is relatively uncommon. 3  Cystic acne is. 4  caused by chocolate, nuts or greasy foods, nor by poor hygiene or masturbation. Acne, including cystic acne, is not caused by: 1  Chocolate, nuts, or greasy foods. 2  Most other dietary choices-research has found an association between intake of milk products and acne, as well as a high glycemic index diet and acne. 3  Poor hygiene or inadequate face washing. 4  Masturbation or sex"}, {"url": "http://www.medicalnewstoday.com/articles/103258.php", "passage_text": "Cystic acne is a skin condition in which the pores in the skin become blocked, leading to infection and inflammation in some cases. The skin conditions mainly affects the face, but also often affects the upper trunk and upper arms. Acne, including cystic acne, is not caused by: 1  Chocolate, nuts, or greasy foods. 2  Most other dietary choices-research has found an association between intake of milk products and acne, as well as a high glycemic index diet and acne. 3  Poor hygiene or inadequate face washing. 4  Masturbation or sex"}]