[{"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=9709", "passage_text": "Posterior pituitary: The back portion of the pituitary, a small gland in the head called the master gland. The posterior pituitary secretes the hormone oxytocin which increases uterine contractions and antidiuretic hormone (ADH) which increases reabsorption of water by the tubules of the kidney."}, {"url": "http://www.hormone.org/diseases-and-conditions/pituitary/overview", "passage_text": "The following hormones are stored in the posterior (back part) of the pituitary gland: 1  Antidiuretic hormone (ADH) - ADH, also called vasopressin, regulates water balance in the body. 2  Oxytocin – Oxytocin causes milk to flow from the breasts in breastfeeding women, and may also help labor to progress."}, {"url": "https://www.nlm.nih.gov/medlineplus/ency/article/003702.htm", "passage_text": "Why the Test is Performed. ADH is a hormone that is produced in a part of the brain called the hypothalamus. It is then stored and released from the pituitary gland, a small gland at the base of the brain. ADH acts on the kidneys to control the amount of water excreted in the urine."}, {"url": "http://www.chw.org/medical-care/endocrine/endocrine-conditions/disorders-affecting-the-pituitary-gland/posterior-pituitary-disorders/", "passage_text": "Posterior pituitary disorders. The posterior (back) lobe of the pituitary gland releases ADH (antidiuretic hormone) and oxytocin (a hormone to contract the uterus during childbirth and stimulate milk production)."}, {"url": "https://labtestsonline.org/understanding/analytes/adh/tab/test", "passage_text": "Antidiuretic hormone, also called arginine vasopressin (AVP), is a hormone produced by the hypothalamus in the brain and stored in the posterior pituitary gland at the base of the brain. ADH helps regulate water balance in the body."}, {"url": "https://labtestsonline.org/understanding/analytes/adh/tab/sample", "passage_text": "ADH is produced by the hypothalamus in the brain and stored in the posterior pituitary gland at the base of the brain. ADH is normally released by the pituitary in response to sensors that detect an increase in blood osmolality (number of dissolved particles in the blood) or decrease in blood volume."}, {"url": "http://homepage.smc.edu/wissmann_paul/intranetstuff/dept/scienceLRC/wissmann_site/pituitary.htm", "passage_text": "The pituitary gland, or hypophysis, is about the size of a pea and sits in the small, bony cavity (sella turcica) at the base of the brain. The pituitary gland is divided into two sections: the anterior lobe (adenohypophysis) and the posterior lobe (neurohypophysis)."}, {"url": "http://www.cancer.org/cancer/pituitarytumors/detailedguide/pituitary-tumors-what-is-pituitary-tumor", "passage_text": "The posterior pituitary is where hormones made by the hypothalamus (vasopressin and oxytocin) are stored and released into the bloodstream. 1  Vasopressin (also called antidiuretic hormone, or ADH) causes the kidneys to keep water in the body and not lose it all in the urine."}, {"url": "http://www.hormone.org/diseases-and-conditions/pituitary/overview", "passage_text": "The following hormones are stored in the posterior (back part) of the pituitary gland: 1  Antidiuretic hormone (ADH) - ADH, also called vasopressin, regulates water balance in the body. 2  It conserves body water by reducing the amount of water lost in urine."}]