[{"url": "http://www.charmingsardinia.com/sardinia/is-molas-golf-club", "passage_text": "All the greatest champions of this sport have enjoyed the Is Molas Golf Club track for the Mediterranian macchia which surrounds it, and they still regard it as being one of the most stimulating and technically challenging golf courts in the Mediterranean area."}, {"url": "http://www.charmingsardinia.com/sardinia/hotel-is-molas-golf", "passage_text": "The Is Molas Golf Hotel Sardegna is one of the best golf destinations in Sardinia, in a very convenient location on the southern coast of Sardinia, as it is close to beautiful beaches and only 30 km away from Cagliari, the main city in Sardinia."}, {"url": "http://www.golfinsardinia.com/en/is-molas-golf-club.html", "passage_text": "Is Molas Golf Club. Is Molas Golf Club is the largest golf course in Sardinia and it is considered as one of the finest golf courses in Italy."}, {"url": "http://www.golfinsardinia.com/en/is-molas-golf-resort.html", "passage_text": "Is Molas Golf Club  is the most technical and spectacular golf course of the whole Mediterranean area as it was the first Golf Course in Sardinia and it’s tnow he biggest on the island with its 27 holes."}, {"url": "http://www.ismolasresort.com/", "passage_text": "Is Molas Resort. Massimiliano Fuksas, an exceptional contemporary architect, has designed a marvellous villa resort inspired by the ancient beauty of Sardinia."}, {"url": "http://www.charmingsardinia.com/sardinia/is-molas-golf-club", "passage_text": "Location. The Is Molas Golf Club is located only 30 km away from Cagliari on the south western coast of Sardinia. This area has a unique micro-climate on the island, which is due to the mountains in the surroundings, which keep the cold northern wind away, thus enabling visitors to play golf here all year round."}, {"url": "http://www.golfinsardinia.com/en/is-molas-golf-resort.html", "passage_text": "Position. Is Molas Resort is located nearby Pula, a lively town close to the south western coast of Sardinia, just 33 km from Cagliari."}, {"url": "http://www.charmingsardinia.com/sardinia/is-molas-golf-club", "passage_text": "Your online specialist of luxury and golf holidays in Sardinia presents Is Molas Golf Club a one of the best golf courses in southern Sardinia, book now your golf holiday here."}]