[{"url": "http://www.webmd.com/beauty/face/skin-nutrition", "passage_text": "What You Eat Matters. Eating plenty of fruits and vegetables rich in antioxidants is good for your whole body, including your skin. Antioxidants such as beta-carotene and vitamins C, E, and A can curb the damage caused by unstable molecules known as free radicals. These molecules can harm skin cells and cause signs of aging. The beauty of the skin is that you can affect it from both inside and out, says dermatologist Doris Day, MD, author of Forget the Facelift: Turn Back the Clock with a Revolutionary Program for Ageless Skin. Eating plenty of fruits and vegetables rich in antioxidants is good for your whole body, including your skin."}, {"url": "http://www.fitday.com/fitness-articles/nutrition/vitamins-minerals/4-essential-vitamins-for-great-skin.html", "passage_text": "Vitamin C also stimulates the production of collagen in your skin. Collagen is the protein responsible for making your skin supple. So if you wish to retain smooth and youthful skin then Vitamin C can help. Most fruits are good sources of Vitamin C so try to make fruits a staple addition to your everyday diet. So if you wish to keep lines, wrinkles, dull skin and other skin aging symptoms at bay then Vitamin A may can be of great help. Good sources of Vitamin A include eggs, leafy greens, milk, carrots, pumpkins, liver and more. 2. Vitamin E. Vitamin E is perhaps the most well-known vitamin that is essential for healthy skin. This is because Vitamin E is an effective antioxidant that helps fight free radicals in your body. Free radicals are caused by a number of factors such as smoking, pollution and sun exposure"}, {"url": "http://health.howstuffworks.com/skin-care/information/nutrition/best-vitamins-for-skin-health.htm", "passage_text": "Vitamin E helps fight the effects of sun damage on the skin, and it also helps keep skin smooth and prevent fine lines and wrinkles [source: Bouchez ]. That is why you'll find vitamin E in many anti-aging lotions, but you can also find it in foods like nuts, eggs and green vegetables [source: WebMD ]. Most of these vitamins can be found in a healthy diet or in supplement form. Vitamin A is necessary for skin maintenance and repair -- a healthy amount will show a reduction in fine lines and wrinkles, and it will help prevent acne and dry skin."}, {"url": "http://www.rd.com/health/beauty/5-vitamins-for-healthy-skin/", "passage_text": "1. Vitamin A. Necessary for the maintenance and repair of vital skin tissue, vitamin A is the key to healthy skin. If you’re deficient in vitamin A, your skin may take on a dry, flaky complexion. Get your daily recommended allowances of vitamin A through foods such as sweet potatoes, carrots, and dark, leafy vegetables. 2. Vitamin B Complex. Found in foods like oatmeal, rice, eggs, and bananas, vitamin B complex contains the nutrient, biotin, which forms the basis of nails, skin, and hair cells. Too little vitamin B complex in your diet can cause dermatitis or hair loss."}, {"url": "http://www.healthline.com/health/4-best-vitamins-for-skin", "passage_text": "Vitamins are essential. As vitamins are essential to your health and body functions, vitamin deficiencies can cause adverse effects on the skin. For example, a lack of vitamin C can cause scurvy. Getting the Right Vitamins. Taking care of your skin should be an essential part of your health regimen. It is, after all, your body's largest organ. Walking through your local supermarket, you’ll find aisles dedicated to skin care and beauty, from wrinkle creams to hydrating lotions."}, {"url": "http://health.howstuffworks.com/skin-care/information/nutrition/best-vitamins-for-skin-health.htm", "passage_text": "Vitamin C helps reduce the effects of sun damage on the skin, and it helps tissue repair itself. Vitamin C is found in citrus fruits and many vegetables, but you can also take an additional supplement to help your overall health -- vitamin C is thought to bolster the immune system [source: WebMD ]. Most of these vitamins can be found in a healthy diet or in supplement form. Vitamin A is necessary for skin maintenance and repair -- a healthy amount will show a reduction in fine lines and wrinkles, and it will help prevent acne and dry skin."}, {"url": "http://geritol.com/vitamin-faqs/what-are-the-best-vitamins-for-skin", "passage_text": "Certain vitamins and antioxidants may help improve the health and quality of your skin. Research has found that antioxidant vitamins A, C and E, as well as selenium, can help support and maintain healthy skin and may protect the skin against sun damage. 1 Vitamin A: Also known as retinol, is key for cell growth, and often used as a topical anti-aging treatment. 2  Vitamin C: Also known as ascorbic acid, is an antioxidant that helps tissue grow and repair itself. 3  Vitamin E: Helps the body regulate retinol levels, which is essential for healthy skin."}]