[{"url": "http://www.finaid.org/calculators/loanpayments.phtml", "passage_text": "Advertisement This Loan Payment Calculator computes an estimate of the size of your monthly loan payments and the annual salary required to manage them without too much financial difficulty. This loan calculator can be used with Federal education loans (Stafford, Perkins and PLUS) and most private student loans. Please enter the appropriate figure ($50 for Stafford Loans, $40 for Perkins Loans and $50 for PLUS Loans) in the minimum payment field. Enter a higher figure to see how much money you can save by paying off your debt faster. It will also show you how long it will take to pay off the loan at the higher monthly payment."}, {"url": "https://www.debt.org/students/how-to-pay-back-loans/", "passage_text": "Your minimum monthly payment is based on the type of loan, the amount you owe, the length of your repayment plan and your interest rate. You’ll typically have 10 to 25 years to repay federal loans entirely. Shorter lengths of time or larger loans will result in higher monthly payments. If you have this type of loan, check with your school to find out when you must begin repayment. The grace period on a private student loan depends on the lender and your loan contract. Most private student loans have a short grace period, but you must check with your lender to make sure. You may also choose to consolidate your student loans during the grace period"}, {"url": "http://www.studentfinance.direct.gov.uk/portal/page?_pageid=153,4680136&_dad=portal&_schema=PORTAL", "passage_text": "Student finance calculator Estimate your student loans, grants and bursaries If you're from England and are thinking of starting a new course at college or university in academic year 2015/16, this calculator will give you an estimate of the financial support you could receive. Estimate your student loans, grants and bursaries."}, {"url": "http://college.usatoday.com/2014/08/26/how-much-student-loan-debt-is-too-much-2/", "passage_text": "How to determine how much is too much. Mallory Bayers, a 2013 music business graduate from Full Sail University, accrued $85,000 in student loan debt. Her monthly loan payments started at $900, but she had them reduced to $55. According to a government data analysis by financial aid experts at Edvisors, the class of 2014 graduated with an average student loan debt of $33,000."}, {"url": "http://college.usatoday.com/2014/08/26/how-much-student-loan-debt-is-too-much-2/", "passage_text": "If you graduated from college this past spring, you’re part of the most indebted graduating class ever. According to a government data analysis by financial aid experts at Edvisors, the class of 2014 graduated with an average student loan debt of $33,000. As the Wall Street Journal points out, “Even after adjusting for inflation, that’s nearly double the amount borrowers had to pay back 20 years ago.”"}, {"url": "https://www.wellsfargo.com/student/calculators/budget", "passage_text": "How much you may need to borrow for college. Use this student loan calculator to determine how much you may need to borrow annually for college. "}, {"url": "http://abcnews.go.com/Business/student-loan-debt/story?id=19150985", "passage_text": "We asked how much student debt is okay, and how much is too much. One in five senior citizens and almost a quarter of adults between the ages of 35 to 49 agree that $20,000 to $50,000 in student loan debt is too much to borrow. Maybe that's because they are in the age range of folks in a position to hire young people. Maybe it's because college didn't used to cost so much. More than half of all student loans are now delinquent or in deferral, according to a recent study by TransUnion. Further, according to the latest report from the U.S. Department of Education, over 13 percent of graduates default on their loans within three years of leaving college."}, {"url": "https://www.studentloan.com/learn/how-much/", "passage_text": "If you need to borrow, compare federal and private student loans to find a loan that best fits your needs. When borrowing private student loans, we recommend you pursue certified student loans. A certified loan is one which your school verifies your eligibility for the loan amount. This helps you borrow only what you need. Non-certified loans may allow you to borrow more than you really need. To help you calculate the additional money you need to cover all of your college expenses, use our Student Loan Calculator. It estimates how much you’ll need to borrow to pay for college. And remember, maximize your financial aid options to help"}]