[{"url": "http://lifehacker.com/5957617/how-to-save-web-pages-for-offline-access-later", "passage_text": "Of course, you can always use a service like Pocket, Instapaper, or Readability to save articles for readable, offline viewing. But if you're just trying to save a specific web page in its entirety, these apps should help you make it through the down time without too much stress. Photo by Auremar (Shutterstock) . Just open up the app, type in the address of the page you want to save, and click the Save button in the address bar. You'll then be able to open it up when you don't have a connection."}, {"url": "http://dottech.org/166471/how-to-save-web-pages-for-offline-viewing-in-android-tip/", "passage_text": "1 After logging in, you can close the app. 2  Open your preferred mobile browser. 3  It’s up to you if you want to use Chrome, Firefox, Opera, etc. 4  Now, go ahead and load the page that you want to save for offline viewing (ex. 5  dotTech) . 6  Once the page is fully loaded, tap the “Share” option then tap “Read Later”. 1 On your Android smartphone or tablet, go to Play Store. 2  On Play Store, find an app called “ PaperSpan ” then download and install it on your tablet or smartphone. 3  After installing the app, launch it from your app drawer. 4  You will then be asked to log in or create a new account."}, {"url": "http://lifehacker.com/5957617/how-to-save-web-pages-for-offline-access-later", "passage_text": "To use it, just open it up and tap the plus sign to add a new page to your library. Not only will it save your page for offline viewing, but it'll also keep the page up to date when you do have a connection, download Flash objects, and save pages that your page links to. Just open up the app, type in the address of the page you want to save, and click the Save button in the address bar. You'll then be able to open it up when you don't have a connection."}, {"url": "http://www.quertime.com/article/how-to-save-and-view-websites-for-offline-reading-7-apps/", "passage_text": "It allows you to save entire web pages, including formatting and images, and read them offline on your iOS devices. Offline Browser. Offline Browser is an Android app you can use to download web pages for offline viewing. When you have Wi-Fi connection, you can download all the web pages you need to read during the day; then you can browse the content also when you have no WiFi connection."}, {"url": "http://dottech.org/166471/how-to-save-web-pages-for-offline-viewing-in-android-tip/", "passage_text": "1 Open your preferred mobile browser. 2  It’s up to you if you want to use Chrome, Firefox, Opera, etc. 3  Now, go ahead and load the page that you want to save for offline viewing (ex. 4  dotTech) . 5  Once the page is fully loaded, tap the “Share” option then tap “Read Later”. 1 On your Android smartphone or tablet, go to Play Store. 2  On Play Store, find an app called “ PaperSpan ” then download and install it on your tablet or smartphone. 3  After installing the app, launch it from your app drawer. 4  You will then be asked to log in or create a new account."}, {"url": "http://dottech.org/166471/how-to-save-web-pages-for-offline-viewing-in-android-tip/", "passage_text": "1 Now, go ahead and load the page that you want to save for offline viewing (ex. 2  dotTech) . 3  Once the page is fully loaded, tap the “Share” option then tap “Read Later”. 4  If you are using Chrome for Android, you can find the “Share” tool by pressing the menu button on the top-right corner of your mobile browser. 1 On your Android smartphone or tablet, go to Play Store. 2  On Play Store, find an app called “ PaperSpan ” then download and install it on your tablet or smartphone. 3  After installing the app, launch it from your app drawer. 4  You will then be asked to log in or create a new account."}, {"url": "http://androidwidgetcenter.com/articles/how-to-save-web-pages-on-android-to-view-them-later-offline/", "passage_text": "To save webpages on Android via Offline Browser, do as follows: 1. On Chrome browser, open the webpage you want to download the entire content. 2. Tap the 3dot icon and select the Share option. 3. Look for Offline Browser and tap it. 4. Provide the title for the page, mark on unmark the available options. 5. Since Pocket is a cross platform application, the syncing option gives you the option to view your saved files on both your Android device and your desktop browser. Read how to save webpage on Android via Pocket. 2. Offline Browser. As the name suggests, Offline Browser lets you download webpages for offline viewing."}, {"url": "https://support.microsoft.com/en-us/kb/196646", "passage_text": "Viewing Web pages Without Being Connected to the Internet. 1  Before you disconnect from the Internet, click Synchronize on the Tools menu. 2  When you want to work offline, click Work Offline on the File menu to add a check mark. 3  In your favorites list, click the offline Web page you want to view. To make an existing favorite Web page available for offline viewing, follow these steps in Internet Explorer: To disable offline viewing for a Web page, follow these steps in Internet Explorer: For a New Offline Web Page: You can customize the options for an offline Web page."}, {"url": "http://nexus5.wonderhowto.com/how-to/save-webpages-for-offline-viewing-chrome-for-android-0155106/", "passage_text": "How to Save Webpages for Offline Viewing. Just load your favorite website, then tap the three-dot menu button. In here, select Print —this may sound strange, but hear me out. By default, Save to Google Drive is selected, but let's change that. Tap the drop-down menu here, and select Save as PDF. You can then choose whether you want your website saved in Portrait or Landscape for later viewing. Next, just tap Save. Chrome will now ask where you want to save your PDF. From the side menu of the next screen, select Downloads. Apps like Pocket offer a nice way to do this, but for those of us who like to keep our installed apps to a minimum, there's already a way to save webpages for offline viewing built right in to your Nexus 5 or other Nexus device. The default web browser that came pre-installed on your Nexus 5 is Google's own Chrome. A wonderful mobile browser with many features, this app has a quick and easy way to save pages for later. You can even use Chrome to save webpages on other Android devices, not just Nexus one"}]