[{"url": "http://www.worldweatheronline.com/v2/weather.aspx?q=Ceduna,%20Australia", "passage_text": "It looks on Tuesday, 27 October the Ceduna weather is going to be sunny. The visibility is going to be around 10 km i.e. 6 miles and an atmospheric pressure of 1024 mb. The daytime temperature is going to reach 22 °c and the temperature is going to dip to 12 °c at night."}, {"url": "http://www.worldweatheronline.com/v2/weather.aspx?q=Ceduna,%20Australia", "passage_text": "Ceduna weather text for Fri 23 rd October. The weather is going to be sunny. The visibility is going to be around 10 km i.e. 6 miles and an atmospheric pressure of 1019 mb. The daytime temperature is going to reach 32 °c and the temperature is going to dip to 24 °c at night."}, {"url": "http://www.world-climates.com/city-climate-ceduna-australia-oceania/", "passage_text": "The best time to visit Ceduna will be when the average temperatures are at a comfortable level (between 20°C / 68.0°F and 30°C / 86.0°F on average) which is during months January, February and December."}, {"url": "http://www.worldweatheronline.com/v2/weather.aspx?q=Ceduna,%20Australia", "passage_text": "Ceduna weather text for Sat 24 th October. The weather is forecasted to be sunny with daytime temperature reaching 35 °c. Night time temperature are expected to be 17 °c .We expect around 1.2 mm of precipitation to fall. The visibility is going to be around 10 km i.e. 6 miles and an atmospheric pressure of 1013 mb."}, {"url": "http://www.weather2travel.com/climate-guides/australia/south-australia/ceduna.php", "passage_text": "The Ceduna, South Australia climate guide is perfect for planning your holiday. Monthly weather averages give the best indication of what the weather is usually like for every month of the year including figures for temperature, rainfall and sunshine."}, {"url": "http://www.worldweatheronline.com/v2/weather.aspx?q=Ceduna,%20Australia", "passage_text": "Our Ceduna weather forecaster is reporting Sunday 25 th October to be the wettest day in the coming week with around 0.40mm (or 0.0 inches) of rainfall. Make sure to carry an umbrella if you are out and about in Ceduna."}, {"url": "http://www.bom.gov.au/climate/dwo/IDCJDW5009.latest.shtml", "passage_text": "If you are after long-term averages relevant to Ceduna, South Australia, look at the tables for Ceduna AMO or Ceduna Post Office. Maps and tables of average conditions for locations across Australia are also available."}, {"url": "http://www.world-climates.com/city-climate-ceduna-australia-oceania/", "passage_text": "The warmest time of year in Ceduna is in January when it is 21.75°C / 71.2°F on average, but could get up to 28.5°C / 83.3°F maximum. On the other hand, the coldest time of year in Ceduna is in July when it is 11.5°C / 52.7°F on average, but could get down to 5.7°C / 52.7°F minimum."}]