[{"url": "http://www.uk-engage.org/2013/06/what-are-the-advantages-and-disadvantages-of-using-the-single-transferable-vote-stv-system/", "passage_text": "In a Single Transferable Voting system very few votes are wasted; unlike other voting systems, particularly First Past the Post, where the votes of all but the winning candidate are wasted. STV is arguably a much more representative and inclusive voting system as it gives voters more choice than any other system. The advantages and benefits of the Single Transferable Vote system. 1  Under STV fewer votes are ‘wasted’ In other words, fewer votes are cast for losing candidates, or unnecessarily cast for a run-away winner. 2  This means that most voters can identify a representative that they personally helped to elect"}, {"url": "https://en.wikipedia.org/wiki/Single_non-transferable_vote", "passage_text": "Single non-transferable vote or SNTV is an electoral system used in multi-member constituency elections. The potential for tactical voting in a single non-transferable vote system is large. Receiving only one vote, the rational voter must only vote for a candidate that has a chance of winning, but will not win by too great a margin, thus taking votes away from party colleagues."}, {"url": "https://en.wikipedia.org/wiki/Single_transferable_vote", "passage_text": "STV is the system of choice of groups such as the Proportional Representation Society of Australia (which calls it quota-preferential proportional representation), the Electoral Reform Society in the United Kingdom and FairVote in the USA (which calls it choice voting). STV systems primarily differ in how they transfer votes and the size of the quota used for determining winners. For this reason some have suggested that STV can be considered a family of voting systems rather than a single system. The Droop quota is the most commonly used quota."}, {"url": "http://esm.ubc.ca/BC05/PRSTV.pdf", "passage_text": "Fact sheet #11 Proportional representation by single transferable vote system Proportional representation by single transferable vote (PR-STV) Proportional representation by single transferable vote (PR-STV) is a distinctive variant of proportional representation systems. PR-STV systems ask voters to rank candidates on the ballot – which is called a preferential ballot. Voters’ choice is based on ranking candidates rather than on choosing a party, so voters can choose between candidates from the same party or vote for candidates from different parties."}, {"url": "http://news.stv.tv/politics/176335-stvs-guide-to-stv/", "passage_text": "The Single Transferable Vote system is a form of proportional representation which maintains local links between politicians and voters. Candidates stand for multi-member districts rather than single-member constituencies, with voters marking the candidates in order of preference. But what are the options? The Liberal Democrats first choice would be to adopt the Single Transferable Vote (STV) system as it is the purest form of proportional representation. STV is also backed by the Electoral Reform Society, however, there are other PR systems which are seen as returning equally fair results."}, {"url": "http://www.elections.org.nz/events/past-events-0/2011-referendum-voting-system/about-referendum-choices/stv-single-transferable", "passage_text": "STV-Single Transferable Vote. There are 120 Members of Parliament. Each electorate has more than one MP. This includes the Maori electorates. It is likely the 120 MPs would be divided between 24 and 30 electorates, each with 3 to 7 MPs. Each voter has a single vote that is transferable. Voters either rank the individual candidates – 1, 2, 3, etc – in the order they prefer from all the candidates, OR they may vote for the order of preference published in advance by the political party of their choice. "}, {"url": "https://in.answers.yahoo.com/question/index?qid=20080716053207AAEyCcM", "passage_text": "Best Answer: Single transferable vote (STV) is a preferential voting system designed to minimize wasted votes and provide proportional representation while ensuring that votes are explicitly for candidates rather than party lists. "}, {"url": "https://en.wikipedia.org/wiki/Single_transferable_vote", "passage_text": "When STV is used for single-winner elections, it is equivalent to the instant-runoff voting (alternative vote) method. To differentiate them, STV used for multi-winner elections is sometimes called proportional representation through the single transferable vote, or PR-STV. STV usually refers to the multi-winner version, as it does in this article. STV systems primarily differ in how they transfer votes and the size of the quota used for determining winners. For this reason some have suggested that STV can be considered a family of voting systems rather than a single system. The Droop quota is the most commonly used quota."}, {"url": "http://www.electoral-reform.org.uk/single-transferable-vote/", "passage_text": "The Single Transferable Vote (STV) is a form of proportional representation where you rank the candidates in constituencies that elect multiple MPs. • All elections in the Republic of Ireland, except elections for the presidency and by-elections which are both conducted using the Alternative Vote. • Assembly, European and local government elections in Northern Ireland. • Local elections in Scotland. • The Australian Senate."}]