[{"url": "http://www.collegefactual.com/colleges/chapman-university/paying-for-college/", "passage_text": "The overall cost for on-campus students to attend Chapman University in 2013-2014 was $59,459. To calculate future costs, we looked at the prior five years of data and determined that this cost increased an average of 3.1% each year. Most Expensive. Learn more about tuition and fees, room, board and other expenses and financial aid options at Chapman University. Total college costs include the estimated cost of tuition, fees, books, supplies, room, board and other living expenses for freshmen living on-campus."}, {"url": "http://www.collegefactual.com/colleges/chapman-university/paying-for-college/net-price/", "passage_text": "The average amount awarded was $23,955. When subtracted from the total cost to attend Chapman and live on campus, the average annual net price for these students was $35,504. "}, {"url": "http://college-tuition.startclass.com/l/297/Chapman-University", "passage_text": "Out of 5,266 total undergraduates enrolled in Chapman University, 83% of students received federal grant aid and 66% of students took federal student loan. 1  Grant Aid: 4,355 total undergraduates received on average $33,760 in grant aid. ( 2 83% of undergraduates). Out of 1,268 incoming freshmen who enrolled at Chapman University last year, 1,128 students received some type of financial aid package. 1  Grant Aid: 1,053 incoming freshmen received $23,955 on average"}, {"url": "http://colleges.startclass.com/l/304/Chapman-University", "passage_text": "Undergraduate Grant & Loan Aid. Out of 5,266 total undergraduates enrolled in Chapman University, 83% of students received federal grant aid and 66% of students took federal student loan. 1  Grant Aid: 4,355 total undergraduates received on average $33,760 in grant aid. Out of 1,268 incoming freshmen who enrolled at Chapman University last year, 1,128 students received some type of financial aid package. 1  Grant Aid: 1,053 incoming freshmen received $23,955 on average"}, {"url": "http://colleges.startclass.com/l/304/Chapman-University", "passage_text": "Out of the total $2.4M R&D budget, Chapman University invested $867,000 in Life Sciences (36.2% of the total fund). This is 98.5% less than an average research university's investment size in the field of Life Sciences $57,937,956. Out of 1,268 incoming freshmen who enrolled at Chapman University last year, 1,128 students received some type of financial aid package. 1  Grant Aid: 1,053 incoming freshmen received $23,955 on average in grant aid."}, {"url": "http://www.chapman.edu/law/financial-aid/estimated-cost-of-attendance.aspx", "passage_text": "Federal regulations require each school to develop an estimated cost of attendance. This figure is used in determining the amount of Federal aid a student is eligible for. At Chapman University Fowler School of Law, tuition is determined by the Board of Trustees and the Finance Committee. The cost of living allowance is based on student surveys, institutional costs, Bureau of Labor Statistics, and U.S. Department of Education guidelines. Aid is considered to be loans, grants, work assistance, fellowships, or scholarships. Students costs may vary and an increase in a student's Cost of Attendance (Budget) may be possible for special circumstances."}]