[{"url": "https://www.crunchbase.com/person/li-ka-shing", "passage_text": "Mr. Li Ka-shing is the richest person of East Asian descent in the world and the 11th richest person in the world with an estimated wealth of US$26 billion (as estimated by Forbes). His primary operating company is Hutchison Whampoa Limited."}, {"url": "http://www.scmp.com/news/hong-kong/article/1745236/cy-leung-pays-tribute-lee-kuan-yew-singaporeans-mourn-former-leaders", "passage_text": "Photo: Straits Times. Hong Kong’s richest man, Li Ka-shing, led tributes to Lee Kuan Yew as he described Singapore’s founding prime minister as a “dear friend” and “steadfast builder of a new nation committed to a true and ordered liberty”."}, {"url": "http://www.businessinsider.com/heres-how-li-ka-shing-became-the-richest-man-in-hong-kong-2015-6", "passage_text": "Follow Business Insider: Tyrone Siu/ Reuters. Hong Kong billionaire Li Ka-shing may no longer be the richest man in Asia, but with a current estimated net worth of $20.1 billion, his wealth is still nothing to sneeze at. Li Ka-shing has an incredible rags-to-riches story. He was forced to drop out of school as a child to support his family."}, {"url": "http://www.4-traders.com/business-leaders/Li-Ka-shing-17/biography/", "passage_text": "Richest man in Asia and eleventh global fortune according to Forbes in 2011, Li Ka-shing is the boss of conglomerates Hutchison Whampoa, Cheung Kong Holdings and Watson Group, the world leader in port management."}, {"url": "http://www.worldsrichpeople.com/li-ka-shing.html", "passage_text": "Li Ka Shing is an industrialist, investor and philanthropist from Hong Kong, China. He was born on 13 June 1928 in Guangdong, China. The Chinese business tycoon is one of the richest man in Asia and the eleventh richest person in the world according to Forbes with an estimated wealth of $USD 31 billion."}, {"url": "http://nextshark.com/li-ka-shing-8-life-lessons-from-the-richest-man-in-asia/", "passage_text": "This man’s name is Li Ka-Shing. Mr. Li is the richest man in Asia with a net worth of $28.8 billion. From high school dropout to self-made billionaire, Li came from very humble beginnings when he was growing up in China."}, {"url": "http://www.bornrich.com/li-ka-shing.html", "passage_text": "Li Ka shing net worth is estimated at $31.9 billion as of August 2015. Li Ka Shing is the richest person of East Asian descent and the eleventh richest person in the world with an estimated wealth of US$33.5 billion. He is one of the most powerful men in China and is based in Honk Kong."}, {"url": "http://www.cnbc.com/2014/04/29/25-li-ka-shig.html", "passage_text": "Li Ka-shing is Asia's richest man, with a fortune of $28.8 billion, according to Bloomberg estimates. His wealth and extensive philanthropy, and the scale of his Hong Kong-based commercial empire combine to make him widely considered the region's most powerful businessman."}]