[{"url": "https://answers.yahoo.com/question/index?qid=20120306133038AAcqFag", "passage_text": "a. making segregation illegal. b. opening the political process to more African Americans. c. eliminating poverty in the United States. d. giving African Americans a new sense of ethnic pride. 1 You can only upload files of type PNG, JPG, or JPEG. 2  You can only upload files of type 3GP, 3GPP, MP4, MOV, AVI, MPG, MPEG, or RM. 3  You can only upload photos smaller than 5 MB. 4  You can only upload videos smaller than 600MB."}, {"url": "http://www.proprofs.com/quiz-school/story.php?title=civil-rights-movement-exam_1", "passage_text": "A major turning point in the civil rights movement was marked by ____. A. The conversion of Malcolm X to orthodox Islam. B. The drifting apart of SNCC and SCLC. C. The assasination of Martin Luther King, Jr. D. The assassination of Robert Kennedy. 15. Use the following quotation from a Supreme Court decision to answer the following question. We conclude that in the field of public education the doctrine of separate but equal has no place. Separate educational facilities are inherently unequal.This quotation expresses the decision in the case of."}, {"url": "http://www.lessonsite.com/ArchivePages/HistoryOfTheWorld/Lesson31/Protests60s.htm", "passage_text": "Over time, however, the civil rights movement, the environmental movement, and, more controversially, the women s movement, did convert a majority of Americans to many of their views. All of the protest movements of the 1960s captured public attention and raised questions that were important to the nation. The civil rights movement, the women s movement, and the gay rights movement demanded that Americans consider equality for all citizens in the United States. The student movement probed the meaning of freedom in the United State"}, {"url": "http://www.lessonsite.com/ArchivePages/HistoryOfTheWorld/Lesson31/Protests60s.htm", "passage_text": "The major protest movements began with the civil rights movement during the 1950s and early 1960s. The civil rights movement fought to end long-standing political, social, economic, and legal practices that discriminated against black Americans. All of the protest movements of the 1960s captured public attention and raised questions that were important to the nation. The civil rights movement, the women s movement, and the gay rights movement demanded that Americans consider equality for all citizens in the United States."}, {"url": "http://www.georgiaencyclopedia.org/articles/history-archaeology/civil-rights-movement", "passage_text": "The Continuing Struggle for Civil Rights. The civil rights movement in the. American South was one of the most significant and successful social movements in the modern world. Black Georgians formed part of this southern movement for full civil rights and the wider national struggle for racial equality. In her book Praying for Sheetrock Melissa Fay Greene describes how in McIntosh County in the early 1970s, the epic of the civil rights movement was still a fabulous tale about distant places to the black people of McIntosh.."}, {"url": "https://en.wikipedia.org/wiki/Black_Power", "passage_text": "As a contemporary of and successor to the Civil Rights Movement, the Black Power movement created, what sociologist Herbert H. Haines refers to as a positive radical flank effect  on political affairs of the 1960s. Black Power expresses a range of political goals, from defense against racial oppression, to the establishment of social institutions and a self-sufficient economy. The earliest known usage of the term is found in a 1954 book by Richard Wright entitled Black Power."}, {"url": "http://www.georgiaencyclopedia.org/articles/history-archaeology/civil-rights-movement", "passage_text": "Although the southern civil rights movement first hit the national headlines in the 1950s and 1960s, the struggle for racial equality in America had begun long before. Indeed, resistance to institutionalized white supremacy dates back to the formal establishment of segregation in the late nineteenth century. In her book Praying for Sheetrock Melissa Fay Greene describes how in McIntosh County in the early 1970s, the epic of the civil rights movement was still a fabulous tale about distant places to the black people of McIntosh.."}, {"url": "http://www.weegy.com/?ConversationId=041C9EBE", "passage_text": "Question and answer. All of the following resulted from the civil rights movement except a. making segregation illegal. b. opening the political process to more African Americans. c. eliminating poverty in the United. States. d. giving African Americans a new sense of ethnic pride. "}, {"url": "http://www.weegy.com/?ConversationId=6EC5A93F", "passage_text": "Weegy: Which of the following was a result of the civil rights movement d. Thousands of African Americans could vote for the first time - - - User: All of the following resulted from the civil rights movement except a. making segregation illegal. b. opening the political process to more African Americans. c. eliminating poverty in the United. The federal government rebuilt the nation’s ghettos. b. De facto segregation ended in the North. c. Racism in the South came to an end. d. Thousands of African Americans could vote for the first time."}]