[{"url": "http://www.lessemf.com/schumann.html", "passage_text": "The Schumann Resonances are quasi-standing electromagnetic waves that exist in the Earth's 'electromagnetic' cavity (the space between the surface of the Earth and the Ionosphere). Like waves on a string, they are not present all the time, but have to be 'excited' to be observed. "}, {"url": "https://en.wikipedia.org/wiki/Schumann_resonances", "passage_text": "The Schumann resonances (SR) are a set of spectrum peaks in the extremely low frequency (ELF) portion of the Earth 's electromagnetic field spectrum. Schumann resonances are global electromagnetic resonances, excited by lightning discharges in the cavity formed by the Earth's surface and the ionosphere. This global electromagnetic resonance phenomenon is named after physicist Winfried Otto Schumann who predicted it mathematically in 1952. Schumann resonances occur because the space between the surface of the Earth and the conductive ionosphere acts as a closed waveguid"}, {"url": "http://magneticpulser.us/The_Schumann_Resonance_of_7_83.html", "passage_text": "The Discovery of Schumann Resonance. When we consider that the ionosphere surrounding our planet is electrically positive charged whilst the earth's surface carries a negative charge, we must conclude that this amounts to a prevailing electrical tension within the earth/ionosphere cavity. Although the existence of the Schumann Resonance is an established scientific fact, there are very few scientists who are aware of the importance of this frequency as a tuning fork for Life."}, {"url": "http://www.bibliotecapleyades.net/esp_ondas_shumman_06.htm", "passage_text": "The atmosphere is actually a weak conductor and if there were no sources of charge, it's existing electric charge would diffuse away in about 10 minutes. There is a 'cavity' defined by the surface of the Earth and the inner edge of the ionosphere 55 kilometers up. At any moment, the total charge residing in this cavity is 500,000 Coulombs. There is a vertical current flow between the ground and the ionosphere of 1 - 3 x 10-12 Amperes per square meter. The resistance of the atmosphere is 200 Ohms. The voltage potential is 200,000 Volts. The only things that could cause this is the shrinkage of the earth or an increase in the velocity of light. Neither has been observed and further, the SR that is under constant monitoring as well, is still stuck at 7.75 CPS as it was in the past. The earth is not shrinking."}, {"url": "http://altered-states.net/emf/schumann.htm", "passage_text": "The lowest-frequency (and highest-intensity) mode of the Schumann resonance is at a frequency of approximately 7.83 Hz. The Schumann Resonance's are quasi-standing electromagnetic waves that exist in the Earth's 'electromagnetic' cavity (the space between the surface of the Earth and the Ionosphere). Although the existence of the Schumann Resonance is an established scientific fact, there are very few scientists who are aware of the importance of this frequency as a tuning fork for Life."}, {"url": "http://ntrs.nasa.gov/archive/nasa/casi.ntrs.nasa.gov/20120000051.pdf", "passage_text": "The Q-factors for Schumann resonances are ~5 and provide estimates of wave propagation conditions in the cavity. Schumann resonances have been used to investigate multiple phenomena related to the surface-ionosphere cavity, namely electromagnetic sources, properties of the medium, and boundary conditions. The detection of Schumann resonances in the ionosphere calls for revisions to the existing models of extremely low frequency wave propagation in the surface-ionosphere cavity. Additionally, these measurements suggest new remote sensing capabilities for investigating atmospheric electricity at other planets."}, {"url": "http://altered-states.net/emf/schumann.htm", "passage_text": "Just as a tuning fork has natural frequencies for sound, the planet Earth has natural frequencies, called Schumann resonance's. Schumann resonance is due to the space between the surface of the Earth and the conductive ionosphere acting as a wave guide. Although the existence of the Schumann Resonance is an established scientific fact, there are very few scientists who are aware of the importance of this frequency as a tuning fork for Life."}, {"url": "https://earthpulse.net/schumann-resonance-brain-entrainment/", "passage_text": "Schumann resonance frequencies are a spectrum of naturally occurring electromagnetic signals, circulating in the electrically resonant cavity bounded by the Earth and the ionosphere. Schumann resonance has governed the ‘evolution’ or development of the stress-free operation of the principal human brain-wave signals. Those of animals too. It is widely accepted that Schumann’s resonance is created by lightening strikes as shown in the image courtesy of WikiPedia. Click image to go to the video."}, {"url": "http://image.gsfc.nasa.gov/poetry/ask/q768.html", "passage_text": "There is a 'cavity 'defined by the surface of the Earth and the inner edge of the ionosphere 55 kilometers up. At any moment, the total charge residing in this cavity is 500,000 Coulombs. There is a vertical current flow between the ground and the ionosphere of 1 - 3 x 10^-12 Amperes per square meter. "}]