[{"url": "http://www.destinationpackwood.com/", "passage_text": "Packwood is located 9 miles south of Mt. Rainier National Park and approximately 30 miles northeast of Mt. St. Helens National Monument. It is on Highway 12 in the northern part of Gifford Pinchot National Forest. The White Pass Ski area is 20 miles to the east."}, {"url": "http://www.gonorthwest.com/Washington/cascades/Packwood/Packwood.htm", "passage_text": "Packwood WA also attracts many tourists each summer for hiking, road biking, mountain biking, mountain climbing, boating, horseback riding, camping and fishing. Packwood Lake and High Rock Lookout are two local hiking destinations. Packwood is also on the Pacific Crest Trail system and borders Goat Rocks Wilderness."}, {"url": "http://packwoodwa.com/", "passage_text": "Packwood Packwood is surrounded by Gifford Pinchot National Forest. Its nestled between Mt Rainier, Mt Adams, Mt St Helens in beautiful Washington State. The Picturesque outdoors greets you in every direction. You can ski, golf, hike, fish, camp, hunt, snowmobile, ride horses, bike, fly, swim or boat."}, {"url": "http://www.gonorthwest.com/Washington/cascades/Packwood/Packwood.htm", "passage_text": "List with Go Northwest! Packwood is a mountain logging community in Washington State at an elevation of 1,290 feet on Highway 12 in Gifford Pinchot National Forest. The community is nine miles from Mt. Rainier National Park, 30 miles from Mt. St. Helens National Volcanic Monument, and 20 miles from White Pass Ski Area."}, {"url": "http://www.gonorthwest.com/Washington/cascades/Packwood/Packwood.htm", "passage_text": "It's an easy 2 to 3 hour drive to Packwood from Portland or Seattle. Take I-5 to Highway 12 exit 68. Take highway 12 east 64 miles to Packwood."}, {"url": "http://www.destinationpackwood.com/lodging_members.htm", "passage_text": "Elk Country Cabin is located in Packwood, WA, only 25 minutes from White Pass Ski Area, and 15 minutes from the Ohanapecosh entrance to Mount Rainier National Park. The cabin is situated on a .28 acre property, surrounded by mature pine trees on a quiet cul-de-sac."}]