[{"url": "http://www.microsoft.com/resources/documentation/windows/xp/all/proddocs/en-us/hyperterminal_top_node.mspx", "passage_text": "HyperTerminal is a program that you can use to connect to other computers, Telnet sites, bulletin board systems (BBSs), online services, and host computers, using either your modem or a null modem cable: "}, {"url": "https://technet.microsoft.com/en-us/library/bb457166.aspx", "passage_text": "Overview: Using HyperTerminal in a Managed Environment. In a managed environment, you might choose to disable HyperTerminal. With Windows XP Service Pack 2 (SP2), you can disable HyperTerminal in different ways: You can use Group Policy to prevent users from running Hypertrm.exe—that is, from starting HyperTerminal."}, {"url": "http://www.techrepublic.com/article/step-by-step-how-to-use-the-hyperterminal-tool-to-troubleshoot-modem-problems/", "passage_text": "The HyperTerminal tool, included with Windows 2000, allows you to communicate directly with your system's modem. Through HyperTerminal, you can reset the modem or issue configuration and diagnostic commands. Step-By-Step: How to use the HyperTerminal tool to troubleshoot modem problems. Learn to use the HyperTerminal tool, which is included with Windows 2000 and allows you to communicate with your modem. By Jim Boyce | March 20, 2002, 12:00 AM PST"}, {"url": "https://support.microsoft.com/en-us/kb/124890", "passage_text": "1 Start HyperTerminal (Hypertrm.exe). 2  Enter a name for the connection (for example, Test) in the Name box. 3  Click an icon for the connection in the Icon box, and then click OK. 4  In the Connect Using box, click Direct To Com X (where X is the port your modem is connected to) and then click OK. "}, {"url": "http://www.spamlaws.com/how-hyperterminal-works.html", "passage_text": "HyperTerminal is a program that is included with every version of the Microsoft Windows operating system and allows your PC to function as a computer terminal to connect with other systems remotely. HyperTerminal allows you PC to function as a terminal so you can connect to an intranet which is an internal network such as a library network or an Internet access server."}, {"url": "http://www.cisco.com/public/technotes/smbsa/en/us/general/hyperterm.pdf", "passage_text": "Note: The menu path to HyperTerminal may differ slightly on your PC.4. In the Connection Description window, enter a name for the connection and click OK. 5. In the Connect To window, select the communications port on your computer that you want to use to create the HyperTerminal connection. This port is COM1 or COM2 on many PCs. "}, {"url": "http://www.swtpc.com/mholley/HiTerm/HyperTerminal.htm", "passage_text": "How to use HyperTerminal. Terminal emulator programs written for DOS will not work under Windows 2000 or Windows XP. However Windows comes with a terminal emulator, HyperTerminal. When HyperTerminal starts you should see this dialog. Enter a name then press OK. You will then see this dialog. Select COM1 or COM2. (The port your cable in connected to.) Press OK. Select the desired baud rate. Press OK. The above screen shows 6800 SWTBUG."}, {"url": "http://searchenterprisedesktop.techtarget.com/definition/HyperTerminal", "passage_text": "HyperTerminal can be used to set up a dial-up connection to another computer through the internal modem using Telnet or to access a bulletin board service (BBS) in another computer. "}, {"url": "https://technet.microsoft.com/en-us/library/bb457166.aspx", "passage_text": "Benefits and Purposes of HyperTerminal. HyperTerminal is a program that you can use to connect to other computers, Telnet sites, bulletin board systems (BBSs), online services, and host computers. HyperTerminal connections are made using a modem, a null modem cable (used to emulate modem communication), or an Ethernet connection. In a managed environment, you might choose to disable HyperTerminal. With Windows XP Service Pack 2 (SP2), you can disable HyperTerminal in different ways: You can use Group Policy to prevent users from running Hypertrm.exe—that is, from starting"}]