[{"url": "http://www.breakingnewsenglish.com/1108/110823-gold_prices.html", "passage_text": "The price of gold went (1) ____________ the $1,900 per ounce mark for the first time ever on Monday. The record rise is because of growing (2) ____________ about a possible recession in the global economy. Price of gold hits all-time high. The price of gold went (1) past the $1,900 per ounce mark for the first time ever on Monday. The record rise is because of growing (2) concerns"}, {"url": "https://www.silverinstitute.org/site/silver-price/silver-price-history/2011-present/", "passage_text": "In 2012 robust global silver investor demand was the dominant driver of silver prices, accounting for almost a quarter of total silver demand. Averaging $31.15 per ounce, 2012 was the second highest price level on record, behind the average reached in 2011. While 2012 was a volatile year for most precious metals, globally, silver investment rose to a total of 252.7 million troy ounces (Moz). "}, {"url": "http://taxfreegold.co.uk/highestsilvepriceprevious.html", "passage_text": "The all-time high price in dollars for silver was hit on 18th January 1980 at $49.45 (£21.65) per troy ounce fuelled by Nelson Bunker Hunt's cornering of the market. After the all-time high of 1980, silver bullion prices declined somewhat erratically, to the lowest point reached on 25th February 1991, when it fixed at $3.5475 U.S per troy ounce, equivalent to 1.8325 sterling. Intraday prices on that day would almost certainly have included a few slightly lower figures."}, {"url": "http://www.zerohedge.com/news/2014-07-12/silver-150oz-possible-coming-months-due-tiny-size-physical-market", "passage_text": "Silver is priced at less than $22/oz today. The average nominal price of silver more than 34 year ago, in 1979 and 1980, was $21.80/oz and $16.39/oz respectively. In today's dollars and adjusted for inflation that would equate to an inflation adjusted average price of some $60/oz and $44/oz in 1979 and 1980. Silver has been one of the top performing markets in recent months. Silver has risen to $21.41/oz and is up more than 10.3% year to date. It is important to remember that silver rose to a recent nominal closing high $48.41/oz on April 28, 2011."}, {"url": "http://www.breakingnewsenglish.com/1108/110823-gold_prices.html", "passage_text": "The price of gold went past the $1,900 per ounce (1) ___ for the first time ever on Monday. The record rise is because of (2) ___ concerns about a possible recession in the global economy. Two main factors are (3) ___ fears of a worldwide economic slowdown  the faltering U.S. economy and the debt crisis in Europe. Price of gold hits all-time high. The price of gold went (1) past the $1,900 per ounce mark for the first time ever on Monday. The record rise is because of growing (2)"}, {"url": "http://www.zerohedge.com/news/2014-07-12/silver-150oz-possible-coming-months-due-tiny-size-physical-market", "passage_text": "Supply didn't increase significantly in the 1970s when silver rose more than 35 fold in price-from $1.40/oz in 1971 to a high of nearly $50/oz in 1980. Importantly, silver is a byproduct metal and some 80% of mined silver is a byproduct of base metals. Silver has been one of the top performing markets in recent months. Silver has risen to $21.41/oz and is up more than 10.3% year to date. It is important to remember that silver rose to a recent nominal closing high $48.41/oz on April 28, 2011."}, {"url": "http://investingnews.com/daily/resource-investing/precious-metals-investing/silver-investing/silver-survey-2013-2012-silver-price-second-highest-on-record/", "passage_text": "Add Comment. Thomson Reuters GFMS has completed the World Silver Survey 2013 for the Silver Institute. The report reveals that 2012 was a year during which silver supply continued to grow, silver investment demand remained strong and silver’s average price reached $31.15, the second highest on record. Though silver prices are expected to rise above current levels, GFMS expects a lower average price in 2013. Investors consumed about 253 Moz of silver in 2012, accounting for almost a quarter of total demand. That figure represents approximately $8 billion on a net basis, a figure that is substantially higher than the annual average of $1.2 billion over the 2001 to 2010 time frame, GFMS said."}, {"url": "http://www.zerohedge.com/news/2014-07-12/silver-150oz-possible-coming-months-due-tiny-size-physical-market", "passage_text": "The average price of silver in 2001 was $4.37/oz and 33 fold increase would result in silver rising to over $145/oz. While this price target may seem outlandish to some, it is worth remembering that silver's record high in 1980 adjusted for inflation (according to U.S. government inflation figures) was nearly $130/oz. Silver has been one of the top performing markets in recent months. Silver has risen to $21.41/oz and is up more than 10.3% year to date. It is important to remember that silver rose to a recent nominal closing high $48.41/oz on April 28, 2011."}, {"url": "http://taxfreegold.co.uk/highestsilvepriceprevious.html", "passage_text": "€N/A. Recent Low Silver Price. After the all-time high of 1980, silver bullion prices declined somewhat erratically, to the lowest point reached on 25th February 1991, when it fixed at $3.5475 U.S per troy ounce, equivalent to 1.8325 sterling. Intraday prices on that day would almost certainly have included a few slightly lower figures."}]