[{"url": "http://assamtoday.tripod.com/bihu1.htm", "passage_text": "Rongaali Bihu, the most important Bihu of all the three, is celebrated in the month of Bohaag (middle of April), the first month of the Assamese calendar and thus marks the advent of the Assamese New Year. T raditionally Bihu has been celebrated with Bihu dance and Bihu Geets in the village fields and courtyards, with groups of youths going from house to house, singing Bihu songs which is known as Husori."}, {"url": "http://www.festivalsofindia.in/Bihu/", "passage_text": "Bihu is the most important festivals of Assam, celebrated with fun and abundance by all Assamese people irrespective of caste, creed, religion, faith and belief. The breathtaking hills and valleys of Assam come alive with the sound of Bihu thrice a year. Bihu 2015 - April 15 (Wednesday). Bihu is the most important cultural festival of Assam. It is the only prime festival celebrated by the Assamese people with much joy and festivity. It is a festival that transcends all religious and class barriers bringing people together in a free and uninhabited manne"}, {"url": "http://www.webindia123.com/festival/april/bihu.htm", "passage_text": "Bohag Bihu which is celebrated in mid-April, the Magh Bihu which is held in mid-January and the Kati Bihu which is celebrated in mid-October. The three are connected with the spring, winter and autumn seasons respectively. The first day of Bohag Bihu is known as the 'Goru Bihu' and is reserved for cattle rites. "}, {"url": "http://www.mapsofindia.com/assam/society/bihu.html", "passage_text": "Other than this, in addition, Assam celebrates two more Bihus-Kongali Bihu, which is celebrated in September or October, and Bhogali Bihu, which is celebrated in January. All these three Bihus are related to farming. In fact, many other festivals are celebrated at the same time all around India. The Bihu Festival involves Bihu folk dance and songs. Bihu is said to be Assam's national festivals and are considered as a very improtant festival of Assam. The Bihus are celebrated by all the Assamese, irrespective of creed, caste, religion, belief and faith."}, {"url": "http://www.thegreenerpastures.com/festivals-of-assam", "passage_text": "Bihu Festival. Bihu is one of the most important festivals of Assam and is celebrated with fun and abundance by all Assamese people. The Assamese people celebrate this festival irrespective of caste, creed, religion, faith and belief. “Bihu” word originated from the language of the Dimasa people. This major festival is celebrated in three forms; Rongali Bihu/Bohag Bihu (in April); Magh Bihu/Bhogali Bihu (in January); Kati Bihu/Kongali Bihu (in October/ November). Spring-Festival or Rongali Bihu is the most colorful festival and is celebrated in mid-April. This festival is celebrated to earmark the beginning of an agricultural season. The people of Assam enjoy these festivals with traditional dancing and singing"}, {"url": "https://en.wikipedia.org/wiki/Bihu", "passage_text": "The Rongali Bihu or the Bohag Bihu is an important festival of Assam. The most important festivals of Assam are the Bihus, celebrated with fun in abundance by all Assamese people irrespective of caste, creed, and belief. The word Bihu is derived from the language of the Dimasa people. Bi means to ask and Shu means peace. Each Bihu coincides with a distinctive phase in the farming calendar. The most important and colourful of the three Bihu festival is the Spring festival Bohag Bihu or Rongali Bihu celebrated in the middle of April."}, {"url": "http://www.mapsofindia.com/assam/society/bihu.html", "passage_text": "The main Bihu Festival is grandly celebrated in Assam around mid-April. This festival is celebrated in the spring season with an intention to spread happiness all around. This also marks the arrival of seeding season. Bihu denotes three different festivals celebrated in Assam. The Bihu Festival involves Bihu folk dance and songs. Bihu is said to be Assam's national festivals and are considered as a very improtant festival of Assam. The Bihus are celebrated by all the Assamese, irrespective of creed, caste, religion, belief and faith."}, {"url": "http://www.festivalsofindia.in/Bihu/", "passage_text": "The Rongali Bihu is celebrated in the month of April (in the Assamese month of Bohag), the Kongali Bihu is celebrated in middle of October (in the Assamese month of Kati) and the Bhogali Bihu is celebrated in the month of January (in the Assamese month of Magh). Bihu 2015 - April 15 (Wednesday). Bihu is the most important cultural festival of Assam. It is the only prime festival celebrated by the Assamese people with much joy and festivity. It is a festival that transcends all religious and class barriers bringing people together in a free and uninhabited manner"}]