[{"url": "http://villains.wikia.com/wiki/Category:Tragic_Villain", "passage_text": "Most of these villains are not in full control of their actions/emotions and hence the reader/viewer can sympathize with them due to them not being evil by choice, but rather by them being (for the most part) a victim of circumstance. Characters who, although acting for primarily evil or selfish goals, are motivated by past traumas that make their reasons at least understandable."}, {"url": "http://hero.wikia.com/wiki/Category:Tragic_Heroes", "passage_text": "Category page. 19,221 pages on this wiki. The tragic heroes are part of a longstanding literary concept; these are characters with fatal flaw (like pride, for example) who is doomed to fail in search of their goals despite their best efforts or good intentions. "}, {"url": "http://www.thestudentroom.co.uk/showthread.php?t=746273", "passage_text": "(Original post by Dionysia) A tragic villain works opposite the tragic hero-someone who acts as the antagonist to provoke the fatal flaw of the hero, which eventually leads to the tragic conclusion or the tragic event. it does indeedy thnk u. (Original post by Dionysia)."}, {"url": "http://tvtropes.org/pmwiki/pmwiki.php/Main/TragicVillain", "passage_text": "— The X-Files, Musings of a Cigarette-Smoking Man. A particular Deconstruction of the villain, a Tragic Villain is completely aware of their evil but takes little pleasure from it. Rather, they feel compelled to engage in evil due to circumstances beyond their control. May also be a Tragic Monster; there is strong overlap. Highly sympathetic ones may be Anti-Villains and prime candidates for redemption, but also everything associated. Compare to Well-Intentioned Extremist, who commits evil actions in hopes of producing good results."}, {"url": "https://answers.yahoo.com/question/index?qid=20091018095059AAv5rnW", "passage_text": "What is a tragic villain-especially in the context of Shakespeare? Best Answer: A tragic villain is a character, usually an antogonist, that does not truly intend to be a villain. Source(s): http://en.wikipedia.org/wiki/tragic_vill... Pallidon · 6 years ago. Thumbs up."}, {"url": "http://tvtropes.org/pmwiki/pmwiki.php/Main/TragicVillain", "passage_text": "A common form of Tragic Villain is one who has his Heel Realization after crossing the Moral Event Horizon: he has no hope of redemption, so despite My Master, Right or Wrong, he continues to follow orders. May also be a Tragic Monster; there is strong overlap. Highly sympathetic ones may be Anti-Villains and prime candidates for redemption, but also everything associated. Compare to Well-Intentioned Extremist, who commits evil actions in hopes of producing good results."}, {"url": "https://en.wikipedia.org/wiki/Tragic_villain", "passage_text": "A villain (also known in film and literature as the  antagonist ,  baddie ,  bad guy ,  heavy  or  black hat ) is an  evil  character in a story, whether a historical narrative or, especially, a work of fiction. If a dragon acted as the villain, but was killed by the hero, another character (such as the dragon's sisters) might take on the role of the villain and pursue the hero. Two other characters could appear in roles that are villainous in the more general sense."}, {"url": "https://answers.yahoo.com/question/index?qid=20091018095059AAv5rnW", "passage_text": "Answers. Best Answer: A tragic villain is a character, usually an antogonist, that does not truly intend to be a villain. Source(s): http://en.wikipedia.org/wiki/tragic_vill... Pallidon · 6 years ago. Thumbs up"}, {"url": "http://www.thestudentroom.co.uk/showthread.php?t=746273", "passage_text": "Hope that helps =). it does indeedy thnk u. (Original post by Dionysia). A tragic villain works opposite the tragic hero-someone who acts as the antagonist to provoke the fatal flaw of the hero, which eventually leads to the tragic conclusion or the tragic event."}]