[{"url": "http://www.ssas.com/disability-medical-tests/musculoskeletal/range-of-motion-test/", "passage_text": "It should be recognized that the range of motion (ROM) of joints is not exactly the same among reporting authorities. For example, the reported normal flexion of the lumbar spine may vary between 80° and 100°. The value cited below is 90°, but 80° flexion should not interpreted as abnormal. The range of “normal” motion also decreases with age, particularly in the spine. "}, {"url": "http://www.livestrong.com/article/95456-normal-neck-range-motion/", "passage_text": "Neck Photo Credit Jacob Wackerhausen/iStock/Getty Images. Having normal range of motion in your neck is important for carrying out the activities of daily living. Neck movements include flexion, extension, bending and rotation. Soft tissue injuries and bony immobility can restrict your range of motion"}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/24573069", "passage_text": "STUDY DESIGN: Cohort study. OBJECTIVE: To generate normal values for active range of motion (ACROM) of the cervical spine in asymptomatic persons. SUMMARY OF BACKGROUND DATA: There is a lack of normal values for ACROM based on large groups and stratified for different age categories. METHODS: Four hundred asymptomatic persons were included, 100 for each decade of age from 20 years to 60 years and in each subgroup 50 males and 50 females. ACROM was measured with the cervical range of motion (CROM) device. Analysis of variance and the Scheffe scheffé post hoc test was used to investigate the differences OF acrom between the decades of. Age linear regression analysis was performed to examine the influence of age and sex ON. acrom"}, {"url": "http://www.livestrong.com/article/95456-normal-neck-range-motion/", "passage_text": "Flexion is the motion that allows you to bend your head toward your chest. In normal flexion, you can touch your chin to your chest. Beginning in a neutral position, an acceptable range of motion for flexion is 40 to 60 degrees. Having normal range of motion in your neck is important for carrying out the activities of daily living. Neck movements include flexion, extension, bending and rotation. Soft tissue injuries and bony immobility can restrict your range of motion"}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/20051924", "passage_text": "Normal functional range of motion of the cervical spine during 15 activities of daily living. Bible JE(1), Biswas D, Miller CP, Whang PG, Grauer JN. Author information: (1)Department of Orthopaedics and Rehabilitation, Yale University School of Medicine, New Haven, CT 06520-8071, USA. [PubMed-indexed for MEDLINE]. "}, {"url": "http://journals.lww.com/spinejournal/Abstract/2014/03010/Normal_Values_for_Cervical_Range_of_Motion.7.aspx", "passage_text": "Objective. To generate normal values for active range of motion (ACROM) of the cervical spine in asymptomatic persons. Summary of Background Data. There is a lack of normal values for ACROM based on large groups and stratified for different age categories. Cohort study. Objective. To generate normal values for active range of motion (ACROM) of the cervical spine in asymptomatic persons. Summary of Background Data. There is a lack of normal values for ACROM based on large groups and stratified for different age categories. Methods."}]