[{"url": "http://www.clinlabnavigator.com/human-chorionic-gonadotropin-pregnancy-test.html", "passage_text": "Last Update On: 2015-03-23. Human chorionic gonadotropin (hCG) is a glycoprotein secreted by the placenta during pregnancy that consists of an alpha and beta subunit. The alpha subunit is structurally similar to the alpha subunits of FSH, LH and TSH. The beta subunit is distinct for hCG. Current pregnancy tests is available that can test either serum or urine. Once a specimen is applied to the device, results are available in 3 minutes for urine and 5 minutes for serum. Sensitivity is 10 IU/mL for serum and 20 mIU/mL for urine. hCG concentrations reach 10 to 25 mIU/mL by 7 to10 days after conception."}, {"url": "http://www.pregnancylab.net/2011/01/the-many-faces-of-hcg.html", "passage_text": "1 During pregnancy, most of the hCG in the blood is intact hCG. 2  Nicked hCG (hCGn): Nicked hCG is made when a chemical bond in part of the beta subunit is broken. 1 The beta subunit is unique to just hCG (the other three hormones also have their own unique beta subunit). 2  A complete, intact hCG molecule is made when the alpha and beta subunits are attached to each other. 3 "}, {"url": "https://labtestsonline.org/understanding/analytes/hcg/tab/test", "passage_text": "Qualitative hCG testing detects the presence of hCG and is routinely used to screen for a pregnancy. This test may be performed by a laboratory, at a doctor's office, or at home using a home pregnancy test kit. The blood level of hcG in a woman with an ectopic pregnancy usually rises at a slower rate than normal. Typically, hCG levels double about every two days for the first four weeks of a normal pregnancy, then slow to every 31/2 days by six weeks."}, {"url": "http://www.webmd.com/baby/human-chorionic-gonadotropin-hcg", "passage_text": "Human Chorionic Gonadotropin (HCG). Guide. The human chorionic gonadotropin (hCG) test is done to check for the hormone hCG in blood or urine. Some hCG tests measure the exact amount and some just check to see if the hormone is present. HCG is made by the placenta during pregnancy. The hCG test can be used to see if a woman is pregnant or as part of a screening test for birth defects. "}, {"url": "http://www.babymed.com/hcg-numbers-in-early-pregnancy", "passage_text": "An hCG blood test with normally rising hCG numbers in pregnancy shows an intact pregnancy. Any hCG level wiith an hCG number in pregnancy over 25 mIU/ml is considered pregnant.. Keep in mind, however, that the normal miscarriage rate is very high at this point, still over 30%. hCG pregnancy hormone information on hCG numbers in early pregnancy and all the facts are presented here. Urine tests measure the urine HCG numbers in early pregnancy qualitatively, which means that the HPT results are either positive or negative while blood HCG numbers in pregnancy give a specific number in mIU/ml."}, {"url": "http://americanpregnancy.org/while-pregnant/hcg-levels/", "passage_text": "Human Chorionic Gonadotropin (hCG);The Pregnancy Hormone. The hormone human chorionic gonadotropin (better known as. ) is produced during pregnancy. It is made by cells formed in the placenta, which nourishes the egg after it has been fertilized and becomes attached to the uterine wall. Levels can first be detected by a blood test about 11 days after conception and about 12 – 14 days after conception by a urine test. 1 The results from an ultrasound after 5 -6 weeks gestation are much more accurate than using hCG numbers. 2  An hCG level of less than 5mIU/ml is considered negative for pregnancy, and anything above 25mIU/ml is considered positive for"}, {"url": "http://www.babymed.com/hcg-numbers-in-early-pregnancy", "passage_text": "Around the time of a mised period the hCG level and hCG numbers range between 50 mIU/ml and 80 mIU/ml. By this point, the normal miscarriage rate is down to 10% since the baby is clearly well implanted and churning out proper hormones. The rate of hCG numbers in early pregnancy should usually double every 2-3 days. hCG pregnancy hormone information on hCG numbers in early pregnancy and all the facts are presented here. Urine tests measure the urine HCG numbers in early pregnancy qualitatively, which means that the HPT results are either positive or negative while blood HCG numbers in pregnancy give a specific number in mIU/ml."}, {"url": "https://labtestsonline.org/understanding/analytes/pth/tab/test", "passage_text": "The so-called intact PTH is the most frequently ordered parathyroid hormone test. It is used to help diagnose the cause of a low or high calcium level and to help distinguish between parathyroid-related and non-parathyroid-related causes. "}, {"url": "http://www.clinlabnavigator.com/human-chorionic-gonadotropin-pregnancy-test.html", "passage_text": "In early pregnancy, trophoblast cells of the placenta secrete predominantly intact hCG. This molecule is broken down into several degradation products. The normal degradation pathway is: Non-nicked hCG-a à free alpha & subunit nicked free beta subunita subunità beta. core fragment Current pregnancy tests is available that can test either serum or urine. Once a specimen is applied to the device, results are available in 3 minutes for urine and 5 minutes for serum. Sensitivity is 10 IU/mL for serum and 20 mIU/mL for urine. hCG concentrations reach 10 to 25 mIU/mL by 7 to10 days after conception."}, {"url": "http://www.mayomedicallaboratories.com/interpretive-guide/?alpha=H&unit_code=80678", "passage_text": "Test 80678 : Human chorionic gonadotropin (hCG) is a glycoprotein hormone that consists of 2 subunits (alpha and beta chains), which are associated to comprise the intact hormone. Clinical Information Discusses physiology, pathophysiology, and general clinical aspects, as they relate to a laboratory test."}]