[{"url": "https://en.wikipedia.org/wiki/Hibachi", "passage_text": "The hibachi (Japanese: 火鉢, lit. fire bowl) is a traditional Japanese heating device. It consists of a round, cylindrical or a box-shaped open-topped container, made from or lined with a heatproof material and designed to hold burning charcoal. History [edit]. It is not known when the hibachi was first used in Japan. However, written records suggest that it was in use by the Heian period (794–1185 AD)."}, {"url": "https://en.wikipedia.org/wiki/Teppanyaki", "passage_text": "Modern teppanyaki grills are typically propane-heated flat surface grills and are widely used to cook food in front of guests at restaurants. Teppanyaki grills are commonly confused with the hibachi barbecue grill, which has a charcoal or gas flame and is made with an open grate design. Teppanyaki (鉄板焼き, teppan-yaki) is a style of Japanese cuisine that uses an iron griddle to cook food. The word teppanyaki is derived from teppan (鉄板), which means iron plate, and yaki (焼き), which means grilled, broiled, or pan-fried. In Japan, teppanyaki refers to dishes cooked using an iron plate, including steak, shrimp, okonomiyaki, yakisoba, and monjayaki"}, {"url": "http://www.food.com/recipe/japanese-steakhouse-hibachi-chicken-and-steak-with-vegtables-442394", "passage_text": "Directions. 1  Bring 2 1/2 cups water to a rolling boil. 2  Once boiling, add the 2 Cups rice and remove form heat, cover and simmer for 20 minutes. 3  Then remove cover and let stand 5 minutes for rice to absorb remaining water. "}, {"url": "http://www.ehow.com/facts_7596679_hibachi-restaurant.html", "passage_text": "Save. Hibachi is a style of Japanese cooking where foods are prepared over a hot open grill. Hibachi restaurants use this cooking technique and turn it into an interactive culinary experience for restaurant-goers. 1  Vegetables Used in Hibachi. 2  How to Eat at a Hibachi Restaurant. "}, {"url": "http://www.wisegeek.com/what-is-a-hibachi.htm", "passage_text": "These 10 facts about space will blow your mind. In the West, a hibachi is a small, portable grill inspired by the Japanese shichirin. In Japanese, a hibachi is actually a form of heater, traditionally used in the winter to warm a room. "}, {"url": "http://www.urbandictionary.com/define.php?term=hibachi", "passage_text": "20 Words related to hibachi. 1  gilbert arenas. 2  vodka. 3  aa. 4  carbon monoxide. 5  japanese. 6  own them. 7  quality shot. 8  suicide. 9  the black president. 10  the east coast assasin. 11  crazy delicious. 12  eating. 13  food. 14  hichizuki. 15  intrepid. 16  out. 17  scream. 18  teriyaki. 19  washington wizards. 20  yum. "}, {"url": "http://www.merriam-webster.com/dictionary/hibachi", "passage_text": "Full Definition of HIBACHI. : a charcoal brazier. See hibachi defined for English-language learners. See hibachi defined for kids. ADVERTISEMENT. "}, {"url": "http://www.thefreedictionary.com/hibachi", "passage_text": "Verb. 1. hibachi-cook over a hibachi grill. cookery, cooking, preparation-the act of preparing something (as food) by the application of heat; cooking can be a great art; people are needed who have experience in cookery; he left the preparation of meals to his wife. grill-cook over a grill; grill the sausages"}]