[{"url": "https://simple.wikipedia.org/wiki/French_Revolution", "passage_text": "Before 1789, France was ruled by the nobles and the church. The ideas of the Enlightenment were beginning to make the ordinary people want more power. They could see that the American Revolution had created a country in which people had power, instead of a king. The First Estate was the Clergy (the church) and made up 1% of the population. The Second Estate was the Nobility and also made up 1% of the population. The other nearly 98% of the population was in the Third Estate. Representatives of the people from all three estates together made up the Estates-General."}, {"url": "http://www.enotes.com/homework-help/who-were-clergy-noble-people-before-french-307892", "passage_text": "Among the other advantages held by the upper estates: 1  The First Estate (the clergy) were about 100,000 in number but owned roughly ten percent of all the land. 2  They did not pay tax, but did contribute a voluntary gift to the government. 1 The Clergy themselves collected a ten per cent tax from the Third Estate which the upper clergy (all nobility) used to maintain a lifestyle which many described as luxurious and extravagant. 2  The Second Estate (nobility) numbered about 400,000 and owned twenty five percent of the land."}, {"url": "http://www.heraldica.org/topics/france/noblesse.htm", "passage_text": "The French concept of nobility was very different from the English one. Whereas, in England, only a peerage bestows nobility on the holder, in France, nobility was a quality, a legal characteristic of the individual, which was held or acquired in specified ways, and which conferred specified rights and privileges. "}, {"url": "https://simple.wikipedia.org/wiki/French_Revolution", "passage_text": "The French Revolution was a revolution in France from 1789 to 1799. It led to the end of the monarchy. The Revolution ended when Napoleon Bonaparte took power in November 1799 and began his dictatorship. King Louis XVI was executed. The First Estate was the Clergy (the church) and made up 1% of the population. The Second Estate was the Nobility and also made up 1% of the population. The other nearly 98% of the population was in the Third Estate. Representatives of the people from all three estates together made up the Estates-General."}, {"url": "https://en.wikipedia.org/wiki/French_nobility", "passage_text": "The French nobility (French: la noblesse) was a privileged social class in France during the Middle Ages and the Early Modern period to the French Revolution in 1790. The nobility was revived in 1805 with limited rights as a titled elite class from the First Empire to the fall of the July Monarchy in 1848, when all privileges were abolished. Hereditary titles, without privileges, continued to be granted until the Second Empire fell in 1870, and survive among their descendants"}, {"url": "http://www.emersonkent.com/history_dictionary/taxation_in_pre_revolutionary_france.htm", "passage_text": "Taille (Property and Income Tax) The taille was an ancient tax, established in 1445, originally paid to a lord in exchange for his protection. Hence, clergy and nobility were exempt. This was a direct tax on the property and income of the unprivileged classes, collected by royal officials."}, {"url": "http://bigsiteofhistory.com/the-clergy-and-the-nobility-the-french-revolution/", "passage_text": "The Clergy and the Nobility | The French Revolution. by Marge Anderson 1 Comment. The first estate, the clergy, occupied a position of conspicuous importance in France. Though only .5 percent of the population, the clergy controlled about 15 percent of French lands. They performed many essential public functions—running schools, keeping records of vital statistics, and dispensing relief to the poor. Although less than 2 percent of the population, they held about 20 percent of the land. They had virtual exemption from taxation and monopolized army commissions and appointments to high ecclesiastical office. The French aristocracy, however, was not a single social unit but a series of differing groups."}, {"url": "https://en.wikipedia.org/wiki/French_nobility", "passage_text": "For the year 1789, French historian Francois François bluche gives a figure 140,000 140000 (9,000 9000 noble) families and states that about5 % of nobles could claim descent from feudal nobility before the 15th. Century with a total population of 28, million this would represent merely.05. % The nobility was revived in 1805 with limited rights as a titled elite class from the First Empire to the fall of the July Monarchy in 1848, when all privileges were abolished. Hereditary titles, without privileges, continued to be granted until the Second Empire fell in 1870, and survive among their descendants."}, {"url": "https://en.wikipedia.org/wiki/French_nobility", "passage_text": "For the year 1789, French historian Francois François bluche gives a figure 140,000 140000 (9,000 9000 noble) families and states that about5 % of nobles could claim descent from feudal nobility before the 15th. century The nobility was revived in 1805 with limited rights as a titled elite class from the First Empire to the fall of the July Monarchy in 1848, when all privileges were abolished. Hereditary titles, without privileges, continued to be granted until the Second Empire fell in 1870, and survive among their descendants."}]