[{"url": "https://www.gov.uk/keeping-your-pay-tax-records/overview", "passage_text": "How to keep your records. There are no rules on how you must keep records. You can keep them on paper, digitally or as part of a software program (like book-keeping software). can charge you a penalty if your records aren’t accurate, complete and readable."}, {"url": "https://www.gov.uk/self-employed-records/overview", "passage_text": "You’ll also need to keep records of your personal income. If you’re the nominated partner in a partnership, you must also keep records for the partnership. There are different rules on keeping records for limited companies."}, {"url": "http://www.bytestart.co.uk/how-long-keep-tax-records-for.html", "passage_text": "For personal taxpayers, you need to keep all your tax records for 22 months from the end of the tax period to which they relate. Sole Traders & Partnerships. If you are self-employed, and do not operate via a limited company, you must maintain the following records: 1."}, {"url": "http://www.smarta.com/advice/accounting-and-tax/vat/how-to-keep-vat-records", "passage_text": "If you are VAT-registered: 1  You have to record the VAT on all purchases and sales your business makes. 2  You also need to keep a VAT account, which shows how much VAT you owe HMRC, or vice versa. 3  You are responsible for making sure all records are accurate, complete and up-to-date."}, {"url": "http://www.howtostartmybusiness.co.uk/bookkeeping-and-accounts/what-records-do-i-need-to-keep-for-HMRC/", "passage_text": "You need to keep your records until 31 January 2018, five years later. But if HMRC send you, or you send back your tax return very late, you may need to keep your records for longer. You need to keep them until the later of: five years after the 31 January tax return deadline."}, {"url": "http://www.howtostartmybusiness.co.uk/bookkeeping-and-accounts/what-records-do-i-need-to-keep-for-HMRC/", "passage_text": "You must normally keep your business records for another five years after the online tax return deadline of 31 January, in case HMRC decides to check your return. The same date applies even if you’ve sent in a paper tax return."}, {"url": "http://www.contracteye.co.uk/contractor_tax_records.shtml", "passage_text": "However you decide to work as a contractor – via your own company, or an umbrella scheme – or if you’re a self-employed freelancer, you must keep your financial records safe for a number of years. Here we look at which tax-related paperwork you should keep in a safe place, and for how long."}, {"url": "http://www.contracteye.co.uk/contractor_tax_records.shtml", "passage_text": "For personal (self assessment) tax returns, you must keep all records for 22 months from the end of the tax year to which they relate."}]