[{"url": "http://nyuad.nyu.edu/en/admissions/financial-support/cost-of-attendance.html", "passage_text": "It includes tuition and fees, foreign travel for study integral to a student's academic program, room and board, health insurance, personal expenses, books, and many Campus Life activities. Annual adjustments to the costs and fees at NYU Abu Dhabi may be necessary. Regardless of the amount of the financial award, NYU Abu Dhabi financial support will apply first to tuition and fees, room and board, health insurance, personal expenses, books, and"}, {"url": "http://www.scps.nyu.edu/admissions/graduate/apply/financing-your-education/tuition-and-fees.html", "passage_text": "New York University requires that students in a degree-granting program maintain health insurance coverage. The annual cost of health insurance for the mandatory plan and for the optional plans can be found on the NYU Student Health Insurance website. Graduate Admissions-Tuition and Fees. Earning a graduate degree from the NYU School of Professional Studies is an investment in your future, one that will last a lifetime."}, {"url": "http://www.collegecalc.org/colleges/new-york/new-york-university/", "passage_text": "Annual Total Cost. The annual total list price cost to go to New York University was $64,022 for the 2014/2015 academic year. The cost is the same for all students regardless of New York residence status as there is no in-state discount. Tuition ranks 172nd in New York amongst 4 year colleges for affordability and is the 16th most expensive 4 year college in the state. Price does not vary by residence. The school charges an additional fees of $2,424 in addition to tuition bringing the total effective in-state tuition to $46,170."}, {"url": "http://nyuad.nyu.edu/en/admissions/financial-support/cost-of-attendance.html", "passage_text": "The budget below represents the estimated annual cost in US dollars of education for full-time undergraduate students at NYU Abu Dhabi. Regardless of the amount of the financial award, NYU Abu Dhabi financial support will apply first to tuition and fees, room and board, health insurance, personal expenses, books, and Campus Life activities."}, {"url": "http://www.collegecalc.org/colleges/new-york/new-york-university/", "passage_text": "Tuition for New York University is $43,746 for the 2014/2015 academic year. This is 73% more expensive than the national average private non-profit four year college tuition of $25,240. Tuition ranks 172nd in New York amongst 4 year colleges for affordability and is the 16th most expensive 4 year college in the state. Price does not vary by residence. The school charges an additional fees of $2,424 in addition to tuition bringing the total effective in-state tuition to $46,170."}, {"url": "http://www.collegecalc.org/colleges/new-york/new-york-university/", "passage_text": "The net out-of-pocket total cost you end up paying or financing though student loans is known as the net price. The reported New York University net price for in-state students $34,268* for the 2013/2014 academic year. This net price includes housing and meal expenses. Tuition ranks 172nd in New York amongst 4 year colleges for affordability and is the 16th most expensive 4 year college in the state. Price does not vary by residence. The school charges an additional fees of $2,424 in addition to tuition bringing the total effective in-state tuition to $46,170."}, {"url": "http://www.nyu.edu/global/visa-and-immigration/students-and-alumni/newly-admitted/before-you-arrive/estimated-expenses.html", "passage_text": "For the most updated and exact information on tuition and fees, visit the NYU Bursar's Office Website. The table below indicates the 2015-2016 full-time tuition of 24 credits (one academic year) plus service fees, estimated living expenses and health insurance. The total estimated expense plus any additional dependent expenses is what you must document for issuance of the I-20 or DS-2019. Full payment of tuition and fees is due upon registration for classes, which takes place in August/September for the fall semester and January for the spring semester. Anticipate that all costs related to study at NYU will increase approximately 5% for the 2016-2017 academic year and every subsequent year. This increase may be reflected on the I-20 or DS-2019 you receive and therefore may not match precisely the amounts listed below"}, {"url": "http://steinhardt.nyu.edu/graduate_admissions/tuition", "passage_text": "A student's educational expenses are assessed each semester and are based on the number of credits (also known as points) for which he or she registers. In addition to tuition, students also pay registration/ student service fees. The Board of Trustees of New York University reserves the right to alter the schedule of fees without notice."}, {"url": "http://www.collegecalc.org/colleges/new-york/new-york-university/", "passage_text": "The cost is $23,628 and 117% more expensive than the average New York tuition of $20,118 for 4 year colleges. Tuition ranks 172nd in New York amongst 4 year colleges for affordability and is the 16th most expensive 4 year college in the state. Price does not vary by residence. The school charges an additional fees of $2,424 in addition to tuition bringing the total effective in-state tuition to $46,170."}, {"url": "http://www.scps.nyu.edu/admissions/undergraduate/mcghee/apply/financing-your-education/tuition-and-fees.html", "passage_text": "New York University requires that students in a degree-granting program maintain health insurance coverage. The annual cost of health insurance for the mandatory plan and for the optional plans can be found on the NYU Student Health Insurance website. "}]