[{"url": "http://www.definitions.net/definition/reverse%20transcriptase", "passage_text": "Reverse transcriptase. Reverse transcriptase is an enzyme used to generate complementary DNA from an RNA template, a process termed reverse transcription. RT is needed for the replication of retroviruses, and RT inhibitors are widely used as antiretroviral drugs."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=5347", "passage_text": "Reverse transcriptase: An enzyme that permits DNA to be made, using RNA as the template. A retrovirus, such as the HIV virus, can propagate itself by converting its RNA into DNA with reverse transcriptase."}, {"url": "http://www.merriam-webster.com/dictionary/reverse%20transcriptase", "passage_text": "Medical Definition of REVERSE TRANSCRIPTASE. : a polymerase especially of retroviruses that catalyzes the formation of DNA using RNA as a template. ADVERTISEMENT. noun. : a polymerase especially of retroviruses that catalyzes the formation of DNA using RNA as a template. Britannica.com: Encyclopedia article about reverse transcriptase."}, {"url": "http://medical-dictionary.thefreedictionary.com/reverse+transcriptase", "passage_text": "an enzyme of RNA viruses that catalyzes the transcription of RNA to DNA, which is then incorporated into the genome of the host cell. This is the reverse of the usual mechanism for replication of genetic information; in the presence of this enzyme, it is the RNA that serves as the template for DNA copies."}, {"url": "http://www.merriam-webster.com/dictionary/reverse%20transcriptase", "passage_text": "First Known Use of REVERSE TRANSCRIPTASE. noun. : a polymerase especially of retroviruses that catalyzes the formation of DNA using RNA as a template. ADVERTISEMENT. noun. : a polymerase especially of retroviruses that catalyzes the formation of DNA using RNA as a template. Britannica.com: Encyclopedia article about reverse transcriptase."}, {"url": "http://www.biology-online.org/dictionary/Reverse_transcriptase", "passage_text": "Reverse transcriptase. Definition. noun. A DNA polymerase enzyme that catalyzes the process of reverse transcription. Supplement. Reverse transcriptase makes use of RNA molecule as a template for the synthesis of a complementary DNA strand. It is produced by HIV and other retroviruses in order for them to synthesize DNA from their viral RNA."}]