[{"url": "http://www.babynology.com/meaning-taranjeet-m81.html", "passage_text": "Loving female voice. Yes, this is a true and a known fact that babies love the sound and voice of a female and prefer the same over the voice of the male. This might be the reason why babies are more close to their age during infancy. A baby’s eyesight is sharper than his brain. A baby is able to see everything as an adult who has good eyesight, but since the processing of the brain is slow, they are not able to comprehend each and every thing clearly."}, {"url": "http://www.babynamesdirect.com/indian-baby-names/Girl/T/4", "passage_text": "Add a New Name. The purpose of this list is to help Indian Parents in choosing names for newborn baby. Most important Task is Giving a name to the Baby that would be parents usually do because the name is for life. The Name will be with the Baby through the rest of their Life. Remember! a Name isn't just for a Birth Day-it's for Life! Some People say that Names have a Significant Effect on the Babies Development and Personality. Whether you are the Mother or Father of a New Cute Baby, This List has been created to Help the parents and can be used to suggest from the list. We Have Collected a List of Modern Indian Baby Names with their Meaning."}, {"url": "https://en.wikipedia.org/wiki/MTV_Roadies_(season_9)", "passage_text": "MTV Roadies 9: Everything or Nothing is the ninth season of MTV Roadies, a reality television show aired on MTV India. The auditions started on 16 September from Pune following with Audition in Kolkata, Delhi, Chandhigarh and Hyderabad. Part of the season will take place in United States of America. MTV Roadies 9: Everything or Nothing was held halfway in India and the other half continued in US. However, the series's Finale was held in India."}, {"url": "http://www.answers.com/Q/What_is_the_meaning_of_taranjit_kaur", "passage_text": "Most Sikh women have Kaur as their middle name due to its definition to relation to Sikh history. In the year of 1699, the tenth Guru, Shri Guru Gobind Singh Ji, the founder o … f Sikhism had declared that everyone was equal. When Sikhism was being founded, equality was the bolded word. Clarification: The word Kaur means Princess. It is the middle name for all Sikh women and Singh is the Middle name for all Sikh men, which means Lion. Clarification Improved: … Kaur and Singh are the Last Names not middle Names."}, {"url": "http://www.thinkbabynames.com/meaning/1/Taran", "passage_text": "Taran /ta-ran/ [2 sylls.] as a boys' name (also used as girls' name Taran) is of Gaelic origin, and the meaning of Taran is thunder. Lloyd Alexander gave the name to his main character and heroine a series of children's books based on Gaelic mythology. Actor Taran Noah Smith. Kreatif forms: Talran, Tanan, Tyran. Taran is an unusual first name for males but a very prominent surname for both adults and children (#49965 out of 150436, Top 33%). (2000 U.S. Census). Displayed below is the baby name popularity of Taran for boys. Taran has yet to be ranked in the list so far"}, {"url": "https://www.kabalarians.com/cfm/name-meanings.cfm", "passage_text": "The more insight you have into the powerful influence of your name, the greater opportunity to enjoy the success you are capable of achieving. This web site will show you there is more to names and their meanings. Mind and thought have their origin in an abstract plane of conscious intelligence, which comes into manifest form through the symbols of language. The brain is not the source of the mind, but merely the physical instrument of the mind. A complete analysis of all the names you use is available through our Name Report service. Note: Changing your name or altering the spelling is a serious step. It will affect your personality, health, personal relations, and personal and business success."}, {"url": "http://www.babynology.com/meaning-taranjeet-m81.html", "passage_text": "When picking a baby name for your baby son or daughter, please conduct a reality check by looking up its meaning. This exercise should be conducted at two levels. First check the meaning of the name in your own language. A baby’s eyesight is sharper than his brain. A baby is able to see everything as an adult who has good eyesight, but since the processing of the brain is slow, they are not able to comprehend each and every thing clearly."}, {"url": "https://www.kabalarians.com/cfm/name-meanings.cfm", "passage_text": "Your first name is only one part of your analysis. A complete analysis of all the names you use is available through our Name Report service. Note: Changing your name or altering the spelling is a serious step. It will affect your personality, health, personal relations, and personal and business success."}, {"url": "https://www.kabalarians.com/cfm/name-meanings.cfm", "passage_text": "The hidden power of a name... Mind and thought have their origin in an abstract plane of conscious intelligence, which comes into manifest form through the symbols of language. The brain is not the source of the mind, but merely the physical instrument of the mind. A complete analysis of all the names you use is available through our Name Report service. Note: Changing your name or altering the spelling is a serious step. It will affect your personality, health, personal relations, and personal and business success."}]