[{"url": "https://en.wikipedia.org/wiki/Zebu", "passage_text": "The scientific name of zebu cattle was originally Bos indicus, but they are now more commonly classified within the species Bos taurus as Bos taurus indicus, together with taurine cattle (Bos taurus taurus) and the ancestor of both of them, the extinct aurochs (Bos taurus primigenius). Zebu are used as draught oxen, as dairy cattle and as beef cattle, as well as for by-products such as hides, dung for fuel and manure, and bone for knife handles and the like."}, {"url": "http://www.softschools.com/facts/animals/zebu_facts/441/", "passage_text": "Zebu Facts. Zebu is one of the oldest breeds of cattle in the world. There are 75 different species of zebu that differ from one another by size, color and type of habitat which they inhabit. Zebus are the only type of cattle that lives in tropical rainforests. They can be also found in open plains."}, {"url": "http://www.northrup.org/photos/zebu/", "passage_text": "Animal: Zebu Species: The scientific name for the Zebu is Bos Primigenius Indicus. There are about 75 different breeds of Zebu. Lifespan: The average lifespan of a Zebu is 12-16 years. Size & Weight: Zebus are very small for being cattle. They are about 3ft tall and weigh 300-440lbs. Habitat: Zebus are the only species of cattle that can inhabit tropical rainforests."}, {"url": "http://www.thecattlesite.com/breeds/beef/76/zebu/overview/", "passage_text": "Follow @thecattlesite. Zebu cattle originated in Southwest Asia and that their descendants were non-humped, they have evolved from three breeds of Indian cattle. The Guzerat, Nelore and the Gir had most influence over Zebu breeding. Zebu cattle are humped and belong to the Bos primigenius species of cattle. They were taken to Africa at an early date and within the last 100 years, have been exported to Brazil and the US"}, {"url": "http://a-z-animals.com/animals/zebu/", "passage_text": "Zebu. The zebu is a species of cattle that is native to the jungles of South Asia and the Zebu is the only cattle species that can easily adapt to life in the hot tropics. The zebu is also known as the humped cattle as the zebu has a very distinctive hump on its upper back, located behind the head and neck of the zebu. Today the zebu can also be found in Africa, as the zebu was transported there from Asia many years ago. The zebu has also been taken to South America from Africa, where zebu populations are continuously growing. The zebu is one of the smallest species of cattle in the world with adult zebus reaching a height of just over a meter."}, {"url": "http://animals.wikia.com/wiki/Zebu", "passage_text": "Zebu. 3,605 pages on this wiki. Zebu (Bos primigenius indicus or Bos indicus or Bos taurus indicus), sometimes known as humped cattle or Brahman cattle, are a type of domestic cattle originating in South Asia. They are characterised by a fatty hump on their shoulders, drooping ears and a large dewlap. Taxonomy Edit. The scientific name of zebu (or zebus) cattle was originally Bos indicus, but they are now more commonly classified within the species Bos primigenius, together with taurine cattle (Bos primigenius taurus) and the ancestor of both of them, the extinct aurochs (Bos primigenius)."}, {"url": "http://www.thecattlesite.com/breeds/beef/76/zebu/", "passage_text": "Zebu cattle originated in Southwest Asia and that their descendants were non-humped, they have evolved from three breeds of Indian cattle. The Guzerat, Nelore and the Gir had most influence over Zebu breeding. Zebu cattle are humped and belong to the Bos primigenius species of cattle. "}, {"url": "https://en.wikipedia.org/wiki/Zebu", "passage_text": "Zebu are used as draught oxen, as dairy cattle and as beef cattle, as well as for byproducts such as hides and dung for fuel and manure. In 1999, researchers at Texas A&M University successfully cloned a zebu. Zebu are used as draught oxen, as dairy cattle and as beef cattle, as well as for by-products such as hides, dung for fuel and manure, and bone for knife handles and the like."}]