[{"url": "http://healthresearchfunding.org/hyperlipidemia-icd-9-code/", "passage_text": "Hyperlipidemia Definition and Symptoms. Hyperlipidemia is when there is an abnormal amount of fat and lipids in the blood. Hyperlipidemia typically shows no symptoms and can only be detected by a blood test. Some symptoms that may occur in rare cases hyperlipidemia can cause heart attack or stroke. "}, {"url": "http://www.icd9data.com/2012/Volume1/240-279/270-279/272/272.4.htm", "passage_text": "1 Short description: Hyperlipidemia NEC/NOS. 2  ICD-9-CM 272.4 is a billable medical code that can be used to indicate a diagnosis on a reimbursement claim, however, 272.4 should only be used for claims with a date of service on or before September 30, 2015. 1 ICD-9-CM 272.4 is a billable medical code that can be used to indicate a diagnosis on a reimbursement claim, however, 272.4 should only be used for claims with a date of service on or before September 30, 2015. 2  For claims with a date of service on or after October 1, 2015, use an equivalent ICD-10-CM code (or codes)."}, {"url": "http://www.veydoostusea.blog.com/2014/03/29/hyperlipidemia-nec-nos-2724/", "passage_text": "Other and unspecified hyperlipidemia. Short description: Hyperlipidemia NEC/NOS. ICD-9-CM 272.4 is a billable medical code that can be used to specify a diagnosis on. what is hyperlipidemia nec nos – Ask. What Is Hyperlipidemia. CARDIOVASCULAR – Center To Advance Palliative. Comments are closed. Includes coding notes, ICD-9-CM conversion links, metadata, index back-references and DRG grouping. What Is Hyperlipidemia Nos. 2014 ICD-10-CM Diagnosis Code E78.2 :. NEC = not elsewhere classified."}, {"url": "https://en.wikipedia.org/wiki/Hyperlipidemia", "passage_text": "Hyperlipidemias are divided into primary and secondary subtypes. Primary hyperlipidemia is usually due to genetic causes (such as a mutation in a receptor protein), while secondary hyperlipidemia arises due to other underlying causes such as diabetes. Also, hyperlipidemia may be idiopathic, that is, without known cause. Hyperlipidemias are also classified according to which types of lipids are elevated, that is hypercholesterolemia, hypertriglyceridemia or both in combined hyperlipidemia."}, {"url": "http://www.veydoostusea.blog.com/2014/03/29/hyperlipidemia-nec-nos-2724/", "passage_text": "The medical condition known as hyperlipidemia is a disease that causes high blood cholesterol. The NEC is a medical term meaning Necrotizing Enterocolitis and NOS. Voetbal is een nationale sport in Nederland. In 1865 werd de eerste wedstrijd georganiseerd en tien jaar later werd de eerste echte club opgericht. Includes coding notes, ICD-9-CM conversion links, metadata, index back-references and DRG grouping. What Is Hyperlipidemia Nos. 2014 ICD-10-CM Diagnosis Code E78.2 :. NEC = not elsewhere classified."}, {"url": "http://www.ehow.com/about_5074501_hyperlipidemia.html", "passage_text": "Save. Hyperlipidemia is a medical condition that is characterized by excessive amounts of fatty substances such as cholesterol and triglycerides in the blood of an individual. Hyperlipidemia is often also known as hyperlipoproteinemia as fatty substances are often found attached to the proteins in the bloodstream. "}, {"url": "https://en.wikipedia.org/wiki/Hyperlipidemia", "passage_text": "Hyperlipidemia, hyperlipoproteinemia, or hyperlipidaemia (British English) involves abnormally elevated levels of any or all lipids and/or lipoproteins in the blood. It is the most common form of dyslipidemia (which includes any abnormal lipid levels). Also, hyperlipidemia may be idiopathic, that is, without known cause. Hyperlipidemias are also classified according to which types of lipids are elevated, that is hypercholesterolemia, hypertriglyceridemia or both in combined hyperlipidemia."}, {"url": "http://www.icd9data.com/2014/Volume1/240-279/270-279/272/272.4.htm", "passage_text": "1 Short description: Hyperlipidemia NEC/NOS. 2  ICD-9-CM 272.4 is a billable medical code that can be used to indicate a diagnosis on a reimbursement claim, however, 272.4 should only be used for claims with a date of service on or before September 30, 2015. 1 ICD-9-CM 272.4 is a billable medical code that can be used to indicate a diagnosis on a reimbursement claim, however, 272.4 should only be used for claims with a date of service on or before September 30, 2015. 2  For claims with a date of service on or after October 1, 2015, use an equivalent ICD-10-CM code (or codes)."}, {"url": "http://www.icd9data.com/2014/Volume1/240-279/270-279/272/272.4.htm", "passage_text": "Other and unspecified hyperlipidemia. 1  Non-Billable On/After Oct 1/2015. 2  Short description: Hyperlipidemia NEC/NOS. 3  ICD-9-CM 272.4 is a billable medical code that can be used to indicate a diagnosis on a reimbursement claim, however, 272.4 should only be used for claims with a date of service on or before September 30, 2015. 4  You are viewing the ... 1 ICD-9-CM 272.4 is a billable medical code that can be used to indicate a diagnosis on a reimbursement claim, however, 272.4 should only be used for claims with a date of service on or before September 30, 2015. 2  For claims with a date of service on or after October 1, 2015, use an equivalent ICD-10-CM code (or codes)."}]