[{"url": "http://www.telegraph.co.uk/news/health/pets-health/9353529/Carrots-are-bad-for-rabbits-RSPCA-says.html", "passage_text": "Rabbits do not naturally eat root vegetables, cereals or fruit, and iceberg lettuce can be dangerous. Carrots and apples are high in sugar and should be an occasional treat Photo: ALAMY. Carrots and apples are high in sugar and should be an occasional treat. The charity recommends giving rabbits good quality hay in daily bundles of about the rabbit's own size and allowing them to graze on growing grass, but not lawn clippings."}, {"url": "https://answers.yahoo.com/question/index?qid=1006052807630", "passage_text": "It is generally not a good idea to give a rabbit carrots or lettuce. If you do, give them in small amounts. Most people have been brainwashed by watching Bugs Bunny cartoons that carrots are good for rabbits. Greens and vegetables can give rabbits diahrrea, especially if given in large amounts. If a snack is going to be given to the rabbit, give it something like dry timothy hay. "}, {"url": "http://www.medindia.net/news/healthwatch/carrots-not-good-for-rabbits-says-rspca-104213-1.htm", "passage_text": "It is therefore widely assumed that carrots are among the most favorite bunny foods, but the Royal society for prevention of cruelty to animals (RSPCA) has warned that feeding rabbits with root vegetables put them at a risk for tooth decay and other health problems. In the wild, rabbits do not naturally feed on root vegetables, fruits, cereals or and iceberg lettuce. Some of these foods can prove to be dangerous. Carrots and apples have very high sugar content and therefore, must be given to the rabbits as occasional treat only."}, {"url": "https://malaysia.answers.yahoo.com/question/index?qid=20091202035156AALZyeZ", "passage_text": "Carrots are not bad for bunnies, nor are apples (provided you don't feed them the stems and seeds). Variety is important to a bunny, as is a high-quality hay (I personally use timothy-it's a bit more expensive, but nutritionally better than alfalfa). Best Answer: Carrots are good in proportion with other vegetables. As with any food, if given alone without any other vegetables the rabbit will be lacking in other vitamins and minerals. Carrots are good and contain essential vitamins. All vegetables contain natural sugars."}, {"url": "https://www.naturalrabbitfood.com/can-rabbits-eat-carrots/", "passage_text": "Rabbits love to eat carrots because they are sweet and full of sugar. However do not feed them too much because it can cause digestive problems. This occurs when too much undigested sugar or carbohydrates enter the ceacum at the end of the digestive tract. Rabbits love carrots and they are a great treat but don't feed them exclusively carrots because they are deficient in many protien and other nutrients. They are also a little too high in sugar and starch and can lead to digestive upset."}, {"url": "http://www.rspca.org.uk/adviceandwelfare/pets/rabbits/diet/myths", "passage_text": "Carrots shouldn’t be main sources of food. Rabbits don't naturally eat root vegetables/fruit. Carrots/fruit are high in sugar and should only be fed in small amounts as occasional treats. Rabbits need mainly hay and/or grass, some leafy greens and a small, measured amount of pellets. See rabbit meal planner. "}, {"url": "http://www.indianahrs.org/rabbit-care/greens-vegetables.aspx", "passage_text": "Download. Yes, they do! But carrots are more like a sugary treat for a rabbit (so are fruits), so they should be given in small quantities. They can upset a rabbit’s digestive system if given too much. A better way to think about giving a healthy variety of foods to your bunny is to feed a salad a day."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20060621041530AAVTvRO", "passage_text": "carrots are treats and should be given accordingly to your bunny. Carrots are high in sugar, therefore, you should be careful in how many carrots you allow your bunny each week. Contrary To Popular Belief, Carrots Are Only OK For Bunnies In Limited Quantities (Grapes Too!). The most essential part of a rabbit’s diet is unlimited hay. "}, {"url": "http://www.answers.com/Q/Are_carrots_healthy_for_rabbits", "passage_text": "Carrots are only healthy for rabbits in small amounts, as an occasional treat. The House Rabbit Society recommends no more than two tablespoons of treat food a day for a normal, healthy 6 pound rabbit. Carrots are not particularly healthy for rabbits (they only contain a small amount of cellulose, which is the most essential part of a rabbit's diet), but they aren't bad for it either. For their main source of food, timothy hay is best. See the related link below for more info about the rabbit diet, and helpful links! "}]