[{"url": "https://en.wikipedia.org/wiki/Primary_succession", "passage_text": "Primary succession on Rangitoto Island. Primary succession is one of two types of biological and ecological succession of plant life, occurring in an environment in which new substrate devoid of vegetation and other organisms usually lacking soil, such as a lava flow or area left from retreated glacier, is deposited. Primary succession begins on rock formations, such as volcanoes or mountains, or in a place with no organisms or soil. This creates conditions nearer optimum for vascular plant growth; pedogenesis or the formation of soil is the most important process."}, {"url": "http://www.wildernesscollege.com/ecosystem-succession.html", "passage_text": "Primary ecosystem succession is when a community first forms in a newly created or exposed area such as a sand dune or bare rock surface, lava flow, or a new lake created by flooding. In a sense, this is as if the community forms from a clean slate ecologically speaking. Fires are the major source of disturbance in this ecosystem. Fires come through in cycles of between 10 and 15 years or sometimes longer. The plants and animals here must be adapted to long periods of dryness and mild, winter time precipitation."}, {"url": "http://www.answers.com/Q/Which_is_a_primary_disturbance", "passage_text": "exists and is an alternate of. Merge this question into. Split and merge into it. Answer by Mayra03. Confidence votes 145. A landslide or volcanic eruption is a kind of primary disturbance. It causes a very drastic and sudden change in the landscape. Decomposition is not a disturbance of the ecosystem. This is because it is a natural process in harmony with the ecosystem rather than an outside force is interfering."}, {"url": "https://en.wikipedia.org/wiki/Primary_succession", "passage_text": "In other words, it is the gradual growth of an ecosystem over a longer period. In contrast, secondary succession occurs on substrate that previously supported vegetation before an ecological disturbance from smaller things like floods, hurricane's, tornadoes, and fires which destroyed the plant life. Primary succession begins on rock formations, such as volcanoes or mountains, or in a place with no organisms or soil. This creates conditions nearer optimum for vascular plant growth; pedogenesis or the formation of soil is the most important process."}, {"url": "http://www.nwf.org/Wildlife/Wildlife-Conservation/Disturbance.aspx", "passage_text": "A disturbance is any event that causes a disruption to the current state of an ecosystem. Disturbances can be localized – only impacting a small patch of land – or they can affect an entire forest or wetland. The results of a disturbance can be short-lived or long-term. "}, {"url": "http://www.merckmanuals.com/professional/endocrine-and-metabolic-disorders/acid-base-regulation-and-disorders/acid-base-disorders", "passage_text": "Classification. Primary acid-base disturbances are defined as metabolic or respiratory based on clinical context and whether the primary change in pH is due to an alteration in serum HCO 3 − or in P co 2. Metabolic acidosis is serum HCO 3 − 24 mEq/L. Acid-base disorders are classified as metabolic if the change in pH is primarily due to an alteration in serum HCO 3 − and respiratory if the change is primarily due to a change in P co 2 (increase or decrease in ventilation)."}, {"url": "http://www.rainforestjournal.com/differences-between-primary-and-secondary-rainforest/", "passage_text": "July 14, 2013 by JungleBoy | 5 Comments. Many people have no idea what is the meaning of a primary or secondary tropical rainforest, and assume all jungles everywhere are the same. In fact, the term “primary”, “old growth”, or “virgin” is bandied around far too freely, and in most cases, inaccurately. "}, {"url": "http://www.ctahr.hawaii.edu/LittonC/PDFs/480_DisturbandSucc.pdf", "passage_text": "2 • Disturbance – Mix of large, infrequent and small frequent events – A given disturbance is the result of numerous, interconnected factors – Natural disturbances are not “bad” – Disturbances characterized by type, size, severity, intensity, frequency, timing, etc. • Disturbance Regime Disturbances & Succession. "}, {"url": "http://www.wildernesscollege.com/ecosystem-succession.html", "passage_text": "Ecosystem succession, also called ecological succession, is the process through which a natural community of plants and animals changes after a disturbance. It is generally understood that ecological succession is a progressive movement towards the most stable community (also called a climax community). This kind of succession is the manner through which natural communities respond to disturbances and changes. Fires are the major source of disturbance in this ecosystem. Fires come through in cycles of between 10 and 15 years or sometimes longer. The plants and animals here must be adapted to long periods of dryness and mild, winter time precipitation."}]