[{"url": "http://www.disknet.com/indiana_biolab/b062.htm", "passage_text": "Make 6 identical plates and streak the same 8 bacteria on each plate then incubate each plate at a different temperature. Here are some suggested temperatures. 1  several days at 4 C. 2  2 days at 4 C; then 1 or 2 days at r.t. 3  two days at room temperture. 4  one or two days at 37 C. 5  24 hours at 55 C protect against drying and use twice the amount of agar to counter drying. 6  24 hours at 55 C; then 2 days at room temperature."}, {"url": "http://bionumbers.hms.harvard.edu/bionumber.aspx?&id=105003&ver=2", "passage_text": "Determination of the minimal temperature for growth of Escherichia coli. J Bacteriol. 1971 Feb105(2):683-4. Primary Source PubMed ID 4925195 Comments The minimal temperature for growth of Escherichia coli ML30 in glucose minimal medium is between 7.5 and 7.8 C. After transfer to subminimal temperature, growth occurs but is not sustained. Most bacteria, including E. coli and S. typhimurium, can grow over a range of approximately 40°C"}, {"url": "http://www.exptec.com/Expression%20Technologies/Bacteria%20growth%20media.htm", "passage_text": "The natural environment of E.coli cells is the lower intestine of a warm-blooded animal. Its optimal growth temperature is 37 C. The doubling time or generation time for most E.coli strains in a rich medium at 37 C is between 20 to 40 minutes. "}, {"url": "http://www.textbookofbacteriology.net/nutgro_5.html", "passage_text": "Growth rate vs temperature for five environmental classes of procaryotes. Most procaryotes will grow over a temperature range of about 30 degrees. The curves exhibit three cardinal points: minimum, optimum and maximum temperatures for growth. Hyperthermophilic Archaea. Temperature for growth (degrees C) Genus Minimum Optimum Maximum Optimum pH Sulfolobus 55 75-85 87 2-3 Desulfurococcus 60 85 93 6 Methanothermus 60 83 88 6-7 Pyrodictium 82 105 113 6 Methanopyrus 85 100 110 7 Figure 8."}, {"url": "http://www.disknet.com/indiana_biolab/b062.htm", "passage_text": "of Bacteria. Since bacteria grow in many environments from artic oceans to hot springs, it is not surprising that the optimum growth temperatures vary. Bacteria from the human gut grow well at body temperature (37 C) but bacteria from plants may be killed at that temperature. Here are some suggested temperatures. 1  several days at 4 C. 2  2 days at 4 C; then 1 or 2 days at r.t. 3  two days at room temperture. 4  one or two days at 37 C. 5  24 hours at 55 C protect against drying and use twice the amount of agar to counter drying. 6  24 hours at 55 C; then 2 days at room"}, {"url": "http://bionumbers.hms.harvard.edu/bionumber.aspx?&id=105003&ver=2", "passage_text": "ID105003 Property Minimum temperature for sustained growth of E. coli ML30 (and presumably other strains) Organism Bacteria Escherichia coli Range 7.5-7.8 Units °C Reference John L. Ingraham and Allen G. Marr, Effect of Temperature, Pressure, pH, and Osmotic Stress on Growth,Fig. 1 chapter 98, Neidhardt, et al. eds. Primary Source PubMed ID 4925195 Comments The minimal temperature for growth of Escherichia coli ML30 in glucose minimal medium is between 7.5 and 7.8 C. After transfer to subminimal temperature, growth occurs but is not sustained."}]