[{"url": "https://answers.yahoo.com/question/index?qid=20061020180805AAJYgnp", "passage_text": "Report Abuse. You really should not use human products on dogs. They make special shampoo specifically for dogs. I think some human shampoos are too harsh for dogs and they can get skin irratations from it. Baby shampoo may be the safest, but I would still opt for something made for dogs."}, {"url": "https://answers.yahoo.com/question/index?qid=20080709055715AACxilY", "passage_text": "Best Answer: It is really not okay to use human shampoo on your pooch. Their skin is very delicate and prone to irritation. The products in human shampoo can be harmful to a dogs skin. If you go to a pet store they have very good smelling shampoo for dogs, a little more costly but thats better than hurting your dog. No, it's really not ok to use human shampoo-it's much too harsh for dogs. Best to buy yourself a dog shampoo and bath only when absolutely necessary because bathing a dog strips all the oils out of his coat. walking lady · 7 years ago."}, {"url": "http://pets.stackexchange.com/questions/1938/can-i-use-human-shampoo-to-wash-a-dog", "passage_text": "In fact, many pet shampoos share that pH range with human shampoos. There are, however, good reasons to use a good pet shampoo on dogs: Shampoos formulated for canine hair are designed to clean well and are often geared toward specific jobs or coat types. Human shampoos are designed for daily or weekly use and may not clean a dirty dog well."}, {"url": "https://answers.yahoo.com/question/index?qid=20061020180805AAJYgnp", "passage_text": "Human shampoo is designed to really get out everything and even 'generic non harsh' can be harsh on a dog. Dog shampoo is designed to not dry out the skin. Dog shampoo also may come in formulas that better condition the coat. They make special shampoo specifically for dogs. I think some human shampoos are too harsh for dogs and they can get skin irratations from it. Baby shampoo may be the safest, but I would still opt for something made for dogs."}, {"url": "http://pets.stackexchange.com/questions/1938/can-i-use-human-shampoo-to-wash-a-dog", "passage_text": "Therefore, if a shampoo that is formulated for human skin is used on a dog, the dog's acid mantle will be disrupted, creating an environment where bacteria, parasites, and viruses can run rampant. the human shampoo products are formulated in the more acidic range, as expected. There are, however, good reasons to use a good pet shampoo on dogs: Shampoos formulated for canine hair are designed to clean well and are often geared toward specific jobs or coat types. Human shampoos are designed for daily or weekly use and may not clean a dirty dog well."}, {"url": "http://dogcare.dailypuppy.com/can-use-human-conditioner-dogs-2479.html", "passage_text": "Shampoo. Before you condition a dog's coat, thoroughly cleanse it by using a gentle shampoo made specifically for canines. Remember, dogs and human beings are not made the same, even if you feel as though your pet is your soul mate. Dogs do not have the same pH levels as humans. As with shampoo, it is important to use only doggie conditioners on your pet. The ASPCA warns pet owners that human grooming products, whether conditioner or bar soap, can lead to unpleasant skin irritation in dogs -- no, thank you. Don't take the unnecessary risk."}, {"url": "http://pets.stackexchange.com/questions/1938/can-i-use-human-shampoo-to-wash-a-dog", "passage_text": "The most common reason not to use human shampoo on a dog is that dogs have different pH levels than humans, as explained by petMD. The acid mantle can also be defined as the relative pH balance of the skin. There are, however, good reasons to use a good pet shampoo on dogs: Shampoos formulated for canine hair are designed to clean well and are often geared toward specific jobs or coat types. Human shampoos are designed for daily or weekly use and may not clean a dirty dog well."}, {"url": "http://pets.thenest.com/human-shampoo-bad-cats-6650.html", "passage_text": "Human Shampoo. Even if you're feeling lazy, don't ever use human shampoo to wash your cat's coat. Although people shampoo is not always toxic, it is formulated specifically for humans -- not cats. Cat skin doesn't have the same pH balance, and as a result, human shampoo can be very aggressive and drying on them"}, {"url": "https://answers.yahoo.com/question/index?qid=20080709055715AACxilY", "passage_text": "Report Abuse. The only human shampoo which would be okay to use on dogs is Mane & Tail, which is, actually, for horses. Other shampoos, such as herbal essences, bed head, etd etc, are not formulated for dogs and I would refrain from using them. No, it's really not ok to use human shampoo-it's much too harsh for dogs. Best to buy yourself a dog shampoo and bath only when absolutely necessary because bathing a dog strips all the oils out of his coat. walking lady · 7 years ago."}]