[{"url": "http://www.healthcare-salaries.com/physicians/plastic-surgeon-salary", "passage_text": "According to the Allied Physicians Salary Survey, an entry level plastic surgeon earns an annual salary of about $237,000 while a top earning plastic surgeon earns about $820,000 per year. According to Salary.com, an average salary for a reconstructive plastic surgeon is about $321,017 per year."}, {"url": "http://www.ehow.com/about_5531661_much-plastic-surgeon-earn-year.html", "passage_text": "According to MD Salaries, the national average for an established plastic surgeon is $300,000 dollars a year. However, plastic surgeons in California have an average of $4,000,000, due to the high population of actors, musicians and artists."}, {"url": "http://woman.thenest.com/much-money-plastic-surgeon-earn-year-4328.html", "passage_text": "Plastic surgeons can earn as much $500,000 a year. You may think plastic surgery is a relatively new practice, but it actually dates back to 600 B.C. India — at least the nose job does. According to ancient Sanskrit texts, a surgeon would cut skin from the cheek or forehead and stitch it in place of your schnoz."}, {"url": "http://www.ehow.com/info_8037455_much-plastic-surgeon-make-hour.html", "passage_text": "Average Pay. According to the ongoing Allied Physicians Salary Survey, plastic surgeons earn anywhere from $237,000 (entry-level) to $820,000 (top earners) per year. Additionally, Salary.com lists a median salary of $321,017 as of 2010 for reconstructive plastic surgeons."}, {"url": "http://woman.thenest.com/much-money-plastic-surgeon-earn-year-4328.html", "passage_text": "As of 2012, a plastic surgeon in a multispecialty practice averages $445,000 a year, according to Medscape. Those in a healthcare organization earn the next highest salary, averaging $285,000 a year. Plastic surgeons at single-specialty offices earn $284,000 a year, while those at a sole practice earn $280,000 a year. A plastic surgeon at a hospital, on the other hand, earns the least, with an average salary of just $15"}, {"url": "http://work.chron.com/potential-salary-plastic-surgeon-6625.html", "passage_text": "Regional Salaries. Plastic surgeons working in the Great Lake states were the most highly-compensated in 2011, earning median salaries of $339,500 a year, according to Medscape. Those working in the Mid-Atlantic states were close behind, with median annual pay of $335,000."}, {"url": "http://work.chron.com/potential-salary-plastic-surgeon-6625.html", "passage_text": "According to health care industry website Medscape, the median income for a plastic surgeon was $270,000 as of 2011. While 54 percent of plastic surgeons earned $300,000 or less per year, 30 percent reported annual incomes of between $300,000 and $500,000, and 16 percent made $500,000 or more per year."}]