[{"url": "https://en.wikipedia.org/wiki/Laser_rangefinder", "passage_text": "The laser beam is used to measure the distance to the first object on its path. Laser rangefinders are used extensively in 3-D object recognition, 3-D object modelling, and a wide variety of computer vision-related fields. The more powerful models of rangefinders measure distance up to 25 km and are normally installed either on a tripod or directly on a vehicle or gun platform. In the latter case the rangefinder module is integrated with on-board thermal, night vision and daytime observation equipment."}, {"url": "http://www.ehow.com/about_6332366_do-laser-distance-meters-work_.html", "passage_text": "Laser Entfernungsmesser image by Otmar Smit from Fotolia.com. A laser distance meter works by use measuring the time it takes a pulse of laser light to be reflected off a target and returned to the sender. Operating Principle. A laser distance meter emits a pulse of laser at a target. The pulse then reflects off the target and back to the sending device (in this case, a laser distance meter)."}, {"url": "https://www.rp-photonics.com/distance_measurements_with_lasers.html", "passage_text": "1 Triangulation is a geometric method, useful for distances in the range of ≈ 1 mm to many kilometers. 2  Time-of-flight measurements (or pulse measurements) are based on measuring the time of flight of a laser pulse from the measurement device to some target and back again. Laser Radar. A laser radar is a device which uses one of the distance measurement techniques as described above, and scans the direction of the distance measurement in two dimensions. This allows the acquisition of an image, or more precisely a depth profile of some object, as required e.g. in robotics."}, {"url": "http://www.lasertech.com/How-Lasers-Work.aspx", "passage_text": "The generated light energy has a wavelength of approximately 900 nanometers, with a beam divergence of 3 milliradians-equal to a beam width of roughly 0.3 m at 100 m or likewise, 3 ft at 1000 ft. Laser Technology products calculate distance by measuring the time of flight of very short pulses of infrared light. "}, {"url": "http://www.engineersupply.com/Laser-Measurers.aspx", "passage_text": "Laser Distance Measuring Tools, also known as Electronic Tape Measures, Laser Distance Finders or Digital Measuring Devices, offer true laser light (not sound) for the most accurate measuring. "}, {"url": "http://home.howstuffworks.com/laser-tape-measure.htm", "passage_text": "Some laser tape measures let you measure multiple distances and add them together automatically. Laser tape measures are normally quicker to use than conventional ones, and you avoid the inaccuracies that can be caused by a twisted or sagging tape measure. To use a laser tape measure, you place the device on one end of what you want to measure, and then aim the laser beam so that it hits an object at the other end. If there's no wall, pole or anything like that, you can put a target at the spot you want to measure up to"}, {"url": "http://www.tech-faq.com/laser-distance-measurement.html", "passage_text": "Laser Distance Measurement. For the past two decades, lasers have been used to measure distance without having to physically touch the area or things being measured. Laser measurement is capable of very precise and quick distance measurements. Lasers have been used in military targeting, criminal investigations, and sports. "}, {"url": "https://en.wikipedia.org/wiki/Laser_rangefinder", "passage_text": "A long range laser rangefinder is capable of measuring distance up to 20 km; mounted on a tripod with an angular mount. The resulting system also provides azimuth and elevation measurements. A laser rangefinder is a rangefinder which uses a laser beam to determine the distance to an object. The more powerful models of rangefinders measure distance up to 25 km and are normally installed either on a tripod or directly on a vehicle or gun platform. In the latter case the rangefinder module is integrated with on-board thermal, night vision and daytime observation equipment."}, {"url": "http://home.howstuffworks.com/laser-tape-measure.htm", "passage_text": "Laser tape measures are alternatives to traditional metal tape measures; they're used to calculate lengths, widths and heights of up to about 650 feet (198 meters). To use a laser tape measure, you place the device on one end of what you want to measure, and then aim the laser beam so that it hits an object at the other end. If there's no wall, pole or anything like that, you can put a target at the spot you want to measure up to"}]