[{"url": "http://www.jwsuretybonds.com/surety-bonds/contract-bonds/", "passage_text": "Licensing Requirements for Contractors. A contractor’s license bond is needed to get a license based on where you perform the work. The bond ensures you follow the rules and regulations of your license. Select the state(s) that you work in below to see the bonds you need to obtain. The owner of a job will often require a bond of their general contractors. If you’re a G.C. required by the owner to get contractor’s bonding, it is recommended that you in turn require bonds of your sub-contractors to guarantee their work performance and payment of all workers and suppliers."}, {"url": "http://www.cslb.ca.gov/Contractors/Maintain_License/Bond_Information/Bond_Requirements.aspx", "passage_text": "A Contractor's Bond is a requirement for the issuance of an active license, reactivation of a license, and for the maintanance of an actively renewed license (Business and Professions Code Section 7071.6). The bond must be written by a surety company licensed through the California Department of Insurance. The bond must be in the amount of $12,500. The business name and license number on the bond must correspond exactly with the business name and license number on the CSLB's records."}, {"url": "https://www.suretybonds.org/contract-bonds", "passage_text": "A bonded contractor is a contractor who is licensed and bonded as a contractor in the state that they are operating in, and who has obtained the relevant contractor bond or bonds for the project they are currently working on. - Performance bonds, which are a type of surety bond, are designed to guarantee that contractors complete a project or fulfill certain obligations. These bonds provide project owners with insurance in various forms against the failure of the contractor to fulfill certain duties."}, {"url": "http://www.cslb.ca.gov/Contractors/Maintain_License/Bond_Information/Bond_Requirements.aspx", "passage_text": "Bond of Qualifying Individual. In addition to a Contractor's Bond, a Bond of Qualifying Individual may be required for the issuance of an active license, reactivation of a license, and for the maintanance of an actively renewed license (Business and Professions Code Section 7071.9). The bond must be written by a surety company licensed through the California Department of Insurance. The bond must be in the amount of $12,500. The business name and license number on the bond must correspond exactly with the business name and license number on the CSLB's records."}, {"url": "https://www.bryantsuretybonds.com/contractor-license-bond", "passage_text": "A surety bond, in essence, is an agreement between three parties: the principal (your contractor business), the obligee (the entity requiring the bond, usually the state), and the surety (the bond provider). It acts as a guarantee that you will comply with all regulations imposed by your local authorities. Contractor License Bond Cost. The cost for your contractor license bond, or the bond premium, is usually between 1%-4% of the bond amount. For example, if you’re required to post a $10,000 contractor license bond, you might pay between $100 and $400."}, {"url": "http://www.cslb.ca.gov/Contractors/Maintain_License/Bond_Information/Bond_Requirements.aspx", "passage_text": "The disciplinary bond must be filed in addition to any other bond(s) required on an active contractor's license. The disciplinary bond cannot take the place of or be combined with any other bond(s). The Registrar will determine the bond amount, which is based on the seriousness of the violation(s). The bond must be written by a surety company licensed through the California Department of Insurance. The bond must be in the amount of $12,500. The business name and license number on the bond must correspond exactly with the business name and license number on the CSLB's records."}, {"url": "https://www.suretybonds.com/contractor-bonding.html", "passage_text": "A Guide to Contractor Bonding. SuretyBonds.com is legally licensed to issue contractor license bonds in every state. Whether you work construction in California, Oregon, Florida or Washington, we can bond you! This page is a guide to contractor license bonds. We can issue any contractor surety bond, even if an applicant is unsure of their state's bonding requirements. Construction professionals who are ready to begin the contractor bonding process can contact one of our many surety specialists in one of two ways. 1  Speak with a surety expert by calling 1 (800) 308-4358."}, {"url": "http://www.wisegeek.org/what-is-a-contractors-bond.htm", "passage_text": "The issuing agency of a contractor's bond pays out to the client if the contractor abandons a project. A contractor's bond is a financial assurance that a contractor will complete a job to a client's satisfaction. If a contractor fails to complete a job as expected, the agency that issued the bond will provide a pay out to compensate. Top 10 facts about the world. A contractor's bond is a financial assurance that a contractor will complete a job to a client's satisfaction. If a contractor fails to complete a job as expected, the agency that issued the bond will provide a pay out to compensate."}, {"url": "http://www.economybonds.com/contractors-license-bond/", "passage_text": "Contractor’s license bond rates are dependent on applicant credit. To get a firm price on California contractor license bonds please click the Get My Quote button. After you get your no obligation contractor’s bond quote, you will have the opportunity to purchase a contractor license bond immediately. "}]