[{"url": "http://www.concretenetwork.com/concrete-patio/cost.html", "passage_text": "A concrete patio costs less than patios made of stone, brick, or tile. The simple truth is that patios made of natural materials are usually higher priced and require more intensive labor to install. Some concrete contractors estimate that a stamped concrete patio costs one-third less than the cost of other materials. The lower price tag combined with the wide array of patterns and colors available are some of the main draws of choosing a concrete patio. Below is a breakdown of the average patio price."}, {"url": "http://www.homeimprovementpages.com.au/article/what_is_the_average_cost_of_a_concrete_patio", "passage_text": "Over time, a concrete patio is likely to crack. So when calculating the cost of your concrete patio, consider that you may have to repair or resurface it in the future. Resurfacing costs between $35 and $50 per square metre, on top of the cost of the new concrete."}, {"url": "http://www.improvenet.com/r/costs-and-prices/stamped-concrete-patio", "passage_text": "Cost of A Stamped Concrete Patio. The total cost of adding a stamped concrete patio to a home depends on the design chosen and any colors needed. A basic job with a simple design will cost around $8 to $12 per square foot, but that cost can increase for a more intricate design."}, {"url": "http://www.costowl.com/home-improvement/landscaping-stamped-concrete-patio.html", "passage_text": "1 Stamped concrete with multiple colors and patterns might cost $12 to $20 per square foot. 2  Elaborate designs, including borders, saw cuts, and hand-applied details, can cost $20 to $30 or more per square foot. 3  Resurfacing concrete costs less than stamping freshly-poured slab; budget $6 to $1"}, {"url": "http://www.improvenet.com/r/costs-and-prices/concrete-patios", "passage_text": "The overall cost of a concrete patio depends on the design and size of the patio. Prices usually start at around $6 per square foot up to $10 per square foot for a basic design without any colors or special designs. Adding colors or a pattern to the design can increase the price to $15 per square foot."}, {"url": "http://www.improvenet.com/r/costs-and-prices/concrete-patios", "passage_text": "The average price that homeowners pay for a concrete patio is around $2,800 to just over $4,000, but some homeowners report spending as little as $1,000 or as much as $6,500. A custom design typically costs more because those projects involve more work."}, {"url": "http://www.costowl.com/home-improvement/landscaping-stamped-concrete-patio.html", "passage_text": "Stamped Concrete Patio Average Costs. 1  Basic stamped concrete (one pattern and one color) might cost $8 to $12 per square foot. 2  Stamped concrete with multiple colors and patterns might cost $12 to $20"}, {"url": "http://www.homewyse.com/services/cost_to_install_stamped_concrete_patio.html", "passage_text": "Our free calculator uses recent, trusted data to estimate costs for your Stamped Concrete Patio Installation project. For a basic 120 square feet project in zip code 47474, the benchmark cost to Install a Stamped Concrete Patio ranges between $8.58 - $11.55 per square foot* . To estimate costs for your project: 1."}]