[{"url": "https://themeaningofthename.com/gina/", "passage_text": "History and Origin. Gina (occasional variants Geena, Gena, Jeana, Jeanna) is a feminine given name, in origin a hypocoristic form of names ending in-gina (by metanalysis of the latinate feminine suffix-ina), such as Luigina, Regina or Georgina, also of Virginia or Eugenia. It is more often used as a girl (female) name. People having the name Gina are in general originating from Austria, Belgium, Bulgaria, Dominican Republic, France, Italy, Netherlands, Romania, Sweden, Switzerland, United Kingdom, United States of America."}, {"url": "http://www.meaning-of-names.com/english-names/gina.asp", "passage_text": "Meaning of Gina. English name. In English, the name Gina means-A diminutive of Georgina, Virgina, Eugina, Regina, and other names ending in-gina. Often used as an independent name. Famous bearer: twentieth century Italian actress Gina Lollobrigida.. Other origins for the name Gina include-English, Italian, African-American.The name Gina is most often used as a girl name or female name. English Name Meaning-A diminutive of Georgina, Virgina, Eugina, Regina, and other names ending in-gina."}, {"url": "https://themeaningofthename.com/gina/", "passage_text": "Usage: Gina, of African origin, is a very popular first name. It is more often used as a girl (female) name. People having the name Gina are in general originating from Austria, Belgium, Bulgaria, Dominican Republic, France, Italy, Netherlands, Romania, Sweden, Switzerland, United Kingdom, United States of America."}, {"url": "http://www.babynamewizard.com/baby-name/girl/gina", "passage_text": "Origin of the name Gina: Originally a short form of Georgine (earthworker), Gina is also used as an independent given name. From A World of Baby Names by Teresa Norman. Comments and insights on the name Gina: | Edit. Gina can be short for Virginia, Regina, or Genevieve. It is also the Italian version of Jean.. Gina and Inga are anagrams of each other; they contain the same letters."}, {"url": "http://www.babynamespedia.com/meaning/Gina", "passage_text": "Gina is also an English, German, and Italian shortening of the name Regina (English, German, and Polish). Gina is also a Spanish diminutive of Virginia. See also the related form, the English Lagina. Gina is uncommon as a baby name for girls. At the height of its usage in 1967, 0.371% of baby girls were named Gina. Gina is also a Russian and Spanish shortening of the name Georgina (English, German, Russian, and Spanish) as well as a Russian and Spanish variant transcription of the name Georgia (English). Gina is also a variant transcription of the name Jean (English and Scottish)."}, {"url": "http://www.babynamewizard.com/baby-name/girl/gina", "passage_text": "Originally a short form of Georgine (earthworker), Gina is also used as an independent given name. Comments and insights on the name Gina: | Edit. Gina can be short for Virginia, Regina, or Genevieve. It is also the Italian version of Jean.. Gina and Inga are anagrams of each other; they contain the same letters."}, {"url": "http://www.thinkbabynames.com/meaning/0/Gina", "passage_text": "Gina /gi-na/ [2 sylls.] as a girls' name is pronounced GEE-nah. Short form of names ending in-gina, such as Georgina and Regina, or of Virginia. Also a feminine form of Gene, or a variant of Jean. Independent use dates from the 1920s. Actresses Gina Lollobrigida, Geena Davis, Gena Rowlands"}, {"url": "http://www.sheknows.com/baby-names/name/gina", "passage_text": "The name Gina is a Greek baby name. In Greek the meaning of the name Gina is: Well born. American Meaning: The name Gina is an American baby name. In American the meaning of the name Gina is: Well born. English Meaning: The name Gina is an English baby name. In English the meaning of the name Gina is: A, Virgina, Eugina, Regina, and other names ending in-gina. Often used as an independent name. Famous bearer: twentieth century Italian actress Gina Lollobrigida. "}, {"url": "http://www.behindthename.com/name/gina", "passage_text": "Meaning & History. Short form of GEORGINA, REGINA, LUIGINA, and other names ending in gina. It can also be used as a diminutive of VIRGINIA or EUGENIA. It was popularized in the 1950s by Italian actress Gina Lollobrigida (1927-), whose birth name was Luigina. Expand Name Links"}]