[{"url": "http://www.studymode.com/essays/Discuss-The-Physiology-Of-The-Three-1144736.html", "passage_text": "The three systems in our body that work together are cardiovascular, respiratory and digestive systems which supply energy to the cells of the body. I will be describing their role of energy in the body system also I am going to explain the physiology of the three named body systems in relation to energy metabolism. The respiratory allows the digestive tract to function and same for the digestive system. Also they both work together to provide energy to body cell. The metabolism is tied to the respiratory system because the system is responsible for providing oxygen in one’s body. Digestive System."}, {"url": "http://www.brianmac.co.uk/physiold.htm", "passage_text": "Digestive Organs. The digestive system is a group of organs (Buccal cavity (mouth), pharynx, oesophagus, stomach, liver, gall bladder, jejunum, ileum and colon) that breakdown the chemical components of food, with digestive juices, into tiny nutrients which can be absorbed to generate energy for the body. "}, {"url": "http://www.newhealthadvisor.com/The-Digestive-System-and-Body-Metabolism.html", "passage_text": "The digestive system is responsible for breaking down the food and drink we consume into usable substances and, transferring them into energy for our body; as well as for cell growth and repair. It consists of a network of organs working harmoniously to achieve the task. On top of harnessing the substances we consume, the digestive system is also responsible for excreting waste from the body. Metabolism is the process that your body uses to convert the food and drink that you consume into energy. The digestive system and body metabolism work together to ensure that your body is consistently and efficiently energized to carry out normal day-to-day tasks, as well as background bodily functions. "}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20080218041544AAtUcCY", "passage_text": "Rating Newest Oldest. Best Answer: 1 The digestive system is the group of organs that breaks down food so that the body can use it. Food must be broken down all the way to its individual molecules to be useable. This involves a number of steps, and different organs to do different parts of the job. 3 The digestive process begins in the mouth. There, the teeth and the muscles of the mouth begin the digestive process by breaking down the food into smaller bits. Saliva, produced by the salivary glands, begins to digest the food before it is even swallowed."}, {"url": "http://www.studymode.com/essays/Discuss-The-Physiology-Of-The-Three-1144736.html", "passage_text": "The digestive system is a group of organs that breakdown the chemical components of food, with fluid (digestive juices) into tiny nutrients which can be absorbed to generate energy. The mouth, pharynx, oesophagus, stomach, liver, gall, bladder, jejunum, ileum, and colon break down the food. The respiratory allows the digestive tract to function and same for the digestive system. Also they both work together to provide energy to body cell. The metabolism is tied to the respiratory system because the system is responsible for providing oxygen in one’s body. Digestive System."}, {"url": "https://prezi.com/kkg55daujtpj/digestive-system-and-metabolism/", "passage_text": "Ends at the ileocecal valve. A sphincter that controls flow of material from the ileum into the large instestine SMALL INTESTINE: Ileum Layers of the digestive system Section closest to stomach. About 10-12 inches in length. This is where the bile duct and pancreatic duct connect to small intestine. "}, {"url": "http://therazzline.net/article/digestion_metabolism.html", "passage_text": "The molecules of which foods are made are too large to pass through the lining of the digestive system. Digestion results in the formation of smaller molecules that are able to pass through that lining and enter the person's bloodstream. "}, {"url": "http://www.innerbody.com/image_digeov/card10-new2.html", "passage_text": "Weighing in at around 3 pounds, the liver is the body’s second largest organ; only the skin is larger and heavier. The liver performs many essential functions related to digestion, metabolism, immunity, and the storage of nutrients within the body. These functions make the liver a vital organ without which the tissues of the body would quickly die from lack of energy and nutrients."}, {"url": "http://www.markedbyteachers.com/as-and-a-level/healthcare/p4-explain-the-physiology-of-two-named-body-systems-in-relation-to-energy-metabolism-in-the-body.html", "passage_text": "In our bodyas, bodyâs there are specific proteins which controls the chemical reactions of. metabolism://http.kidshealth/org/teen_your/body_body/basics.metabolism Html, secondly the two body systems That i will write about in relation to energy metabolism: are the cardiovascular system and the digestive. system P4 explain the physiology of two named body systems in relation to energy metabolism ... The right and left atria receive the blood entering the heart. A wall called the intertribal septum divides the atria, and they're separated from the ventricles by the atrioventricular valves."}]