[{"url": "http://www.babynameworld.com/", "passage_text": "From Around The World. Baby names and baby name meanings from origins around the world. In each category search free lists of baby boy names, baby girl names, and popular / unique baby names along with their baby name origin and meanings. All our Baby Names are easy to navigate. "}, {"url": "http://pets.webmd.com/dogs/mange-dogs-canine-scabies", "passage_text": "Also known as canine scabies, sarcoptic mange is caused by mites that are oval-shaped, light-colored and microscopic. All dogs raised normally by their mothers possess demodectic mange mites (Demodex canis), which are transferred from mother to pup via cuddling during the first few days of life. Some mange mites are normal residents of your dog ’s skin and hair follicles, while others are not. All mites can cause mild to severe skin infections if they proliferate."}, {"url": "http://www.cat-health-guide.org/catmange.html", "passage_text": "Cat Mange. Cat Mange is a skin disorder caused by mites skin. It is uncommon in cats but can occur. Mites can cause a localize from of the condition that starts on the ear, face and neck. Left untreated it can spread throughout the body and become what is known as a generalized form of the condition. Types of Cat Mange. Rare forms of Mange in Cats. Demodectic mange: This type of mange causes hair loss and small red, inflamed patches of skin. It may be localized, meaning it is restricted to a small area of the body, or generalized, meaning that it covers a large portion of the body."}, {"url": "https://en.wikipedia.org/wiki/Mange", "passage_text": "(May 2011). Mange /ˈmeɪndʒ/ is a class of skin diseases caused by parasitic mites. Since mites also infect plants, birds, and reptiles, the term mange, suggesting poor condition of the hairy coat due to the infection, is sometimes reserved only for pathological mite-infestation of nonhuman mammals. Dogs with chronic sarcoptic mange are often in poor condition, and in both animals and humans, immune suppression from starvation or any other disease causes this type of mange to develop into a highly crusted form in which the burden of mites is far higher than in healthy specimens."}, {"url": "http://meaning-of-names.com/", "passage_text": "Name Meanings and History One of the things that all people and places have in common is (NAMES). Have you ever asked yourself, What does my name mean?. We are in the process of building many tools and resources to help make your studies easier. We invite you to contribute name meanings, ratings, comments, participate in our forums, or contribute facts and information to our growing community. Here is a great resource if you are looking for-Baby Names."}, {"url": "http://www.behindthename.com/name/emma", "passage_text": "Originally a short form of Germanic names that began with the element ermen meaning whole or universal. It was introduced to England by Emma of Normandy, who was the wife both of king Ethelred II (and by him the mother of Edward the Confessor) and later of king Canute. "}, {"url": "http://www.wikihow.com/Identify-Mange-on-Dogs", "passage_text": "Mange is a type of inflammatory skin disease caused by tiny parasitic mites on dogs. There are two basic types of mange, sarcoptic and demodectic, which have separate causes and symptoms. It is important to be able to identify the signs of each, and to understand the difference between them. "}, {"url": "http://meaning-of-names.com/", "passage_text": "Even if you are here just to browse, we hope that you will enjoy a unique spin on a fascinating study field. We offer name meanings for over 45,000 different baby names, surnames, and city names from all over the world. We are in the process of building many tools and resources to help make your studies easier. We invite you to contribute name meanings, ratings, comments, participate in our forums, or contribute facts and information to our growing community. Here is a great resource if you are looking for-Baby Names."}, {"url": "http://pets.webmd.com/dogs/mange-dogs-canine-scabies", "passage_text": "In this article. Mange is a skin disease caused by several species of tiny mites, common external parasites found in companion canines. Some mange mites are normal residents of your dog ’s skin and hair follicles, while others are not. All mites can cause mild to severe skin infections if they proliferate."}, {"url": "http://www.cat-health-guide.org/catmange.html", "passage_text": "Ear MItes (Otodectic Cynotis) : Ear mites are the most common form of mange in cats. The mites feed on scaling skin. This is a different condition from head manage and is caused by a different type of mite that does not burrow into the skin. Types of Cat Mange. Rare forms of Mange in Cats. Demodectic mange: This type of mange causes hair loss and small red, inflamed patches of skin. It may be localized, meaning it is restricted to a small area of the body, or generalized, meaning that it covers a large portion of the body."}]