[{"url": "http://www.dmv.org/insurance/how-to-cancel-an-auto-insurance-policy.php", "passage_text": "This can be the best option as long as you have the same car, don’t have any major changes in your life, and are satisfied with your current auto insurance company. If you experience a life change or you are unhappy with your insurance company, however, you may decide to cancel your policy. Car insurance is the easiest way to fulfill this requirement. If you cancel a policy without first putting a new car insurance policy in place, you can face: 1  Fines or penalties for driving uninsured. 2  Liability for all of the personal injury and property damages incurred in an accident you cause."}, {"url": "http://ask-a-lawyer.freeadvice.com/law-questions/if-i-cancel-an-insurance--47717.htm", "passage_text": "If I cancel an insurance policy do I still owe the insurance company any money if the premiums are paid up at the time that the policy is cancelled? IMPORTANT NOTICE: The Answer(s) provided above are for general information only. The attorney providing the answer was not serving as the attorney for the person submitting the question or in any attorney-client relationship with such person. Laws may vary from state to state, and sometimes change."}, {"url": "http://www.panterlaw.com/Auto-Accidents/Helpful-Hints/How-to-Cancel-Your-Car-Insurance-Correctly.shtml", "passage_text": "However, the policy doesn't say anything about automatically owing the insurance company for further coverage or needing to formally cancel your policy. Cancellation damages your record. If your insurance is canceled for any reason, it may hurt your insurance future. Take care, however, to look over the information that your agent or the company filled in, mistakes do happen. In addition, if you switch insurers and you fail to formally cancel your previous policy, you're going to have to prove to your former insurance company that you have new coverage."}, {"url": "https://answers.yahoo.com/question/index?qid=20071124112159AA7C1kJ", "passage_text": "You'll NEVER get all of your money back, and it depends on your company and the cancellation laws in your States as to what percentage of the un-earned premium will be returned. In fact, I have seen situations where you can cancel your policy and you might still OWE money to the insurance company. It would be best to call your agent and discuss the particulars with them."}, {"url": "http://ask-a-lawyer.freeadvice.com/law-questions/if-i-cancel-an-insurance--47717.htm", "passage_text": "Question Details: My insurance company says I can't cancel the policy until the renewal date on my snowmobiles unless they are sold or wrecked. They told me that even if I cancel they will continue to bill for remaining term of the policy. IMPORTANT NOTICE: The Answer(s) provided above are for general information only. The attorney providing the answer was not serving as the attorney for the person submitting the question or in any attorney-client relationship with such person. Laws may vary from state to state, and sometimes change."}, {"url": "http://www.dmv.org/insurance/how-to-cancel-an-auto-insurance-policy.php", "passage_text": "3. Ask for a refund if you have weeks or months left on the policy. This is especially likely if you are canceling your auto insurance for an unexpected reason, such as a death in the family. If there is time left on the policy and you already paid for the entire year, you may be entitled to a refund. Car insurance is the easiest way to fulfill this requirement. If you cancel a policy without first putting a new car insurance policy in place, you can face: 1  Fines or penalties for driving uninsured. 2  Liability for all of the personal injury and property damages incurred in an accident you cause."}, {"url": "http://www.panterlaw.com/Auto-Accidents/Helpful-Hints/How-to-Cancel-Your-Car-Insurance-Correctly.shtml", "passage_text": "First, the insurance company will send you a bill for your next premium payment. Second, when it doesn't hear from you, the insurance company is going to formally cancel your policy because you failed to pay your premiums on time---and that's going to go on your credit report. Take care, however, to look over the information that your agent or the company filled in, mistakes do happen. In addition, if you switch insurers and you fail to formally cancel your previous policy, you're going to have to prove to your former insurance company that you have new coverage."}, {"url": "http://www.insurance.com/auto-insurance/auto-insurance-basics/how-to-switch-car-insurance-companies.aspx", "passage_text": "But switching car insurance companies the right way is every bit as important. You don't want a gap between your policies that can come back to haunt you. You don't want your old insurance company to cancel your policy for nonpayment and report you to the state. And you want a refund of any premiums that may be due. 1  When to switch car insurance. 2  Be sure to get new car insurance first. 1 A request to cancel your policy, giving the policy number and effective date of cancellation. 2  A reason for the cancellation, such as I have bought a new policy or I have sold the insured vehicle.. 3  The name of your new insurance carrier and the policy number."}, {"url": "http://ask-a-lawyer.freeadvice.com/law-questions/if-i-cancel-an-insurance--47717.htm", "passage_text": "My insurance company says I can't cancel the policy until the renewal date on my snowmobiles unless they are sold or wrecked. IMPORTANT NOTICE: The Answer(s) provided above are for general information only. The attorney providing the answer was not serving as the attorney for the person submitting the question or in any attorney-client relationship with such person. Laws may vary from state to state, and sometimes change."}, {"url": "http://www.wikihow.com/Cancel-Life-Insurance", "passage_text": "You may no longer have the funds to pay for the policy. You may want to cash out the money that you have put into the policy, or you may want to cancel a policy with one company so that you can purchase a new policy with a different company. Try to keep the policy. If you want to cancel because of a temporary job loss or because your employer has stopped paying premiums, then consider if there is any way to continue making premium payments. You could pull money from other parts of your budget or get a part-time job. 1  Also talk with your insurance company."}]