[{"url": "http://www.ivyroses.com/Define/Vertebral_border_of_scapula", "passage_text": "The vertebral border of the scapula is also known as the medial border of the scapula, the  internal border of the scapula  and sometimes as the  base (of the scapula). The 3 borders of the scapula are 1  : the superior border of the scapula. 2  the medial border of the scapula (also known as the vertebral border of the scapula), and. 3  the axillary border of the scapula (also known as the lateral border of the scapula)."}, {"url": "https://en.wikipedia.org/wiki/Scapula", "passage_text": "In anatomy, the scapula (plural scapulae or scapulas) or shoulder blade, is the bone that connects the humerus (upper arm bone) with the clavicle (collar bone). Like their connected bones the scapulae are paired, with the scapula on the left side of the body being roughly a mirror image of the right scapula. "}, {"url": "http://www.ivyroses.com/Define/Medial_border_of_scapula", "passage_text": "The medial border (of the scapula) is a structural feature on the scapula bone (also known as the shoulder blade or shoulder bone). The medial border of the scapula is also known as the vertebral border of the scapula, the  internal border of the scapula  and sometimes as the  base (of the scapula). The scapula is a triangular bone. As its name suggests, the medial border of the scapula is the edge of the scapula bone located towards the middle of the body (as opposed to the lateral-right or left-aspects). It is also known as the vertebral border because it is the closest edge of the scapula bone to the vertebral column."}, {"url": "http://www.mananatomy.com/body-systems/skeletal-system/scapula-shoulder-blade", "passage_text": "Vertebral border: Vertebral (medial) border is the longest of the three borders of scapula. It stretches from the medial angle above to the inferior angle below. The vertebral border affords a narrow surface for the insertion of the levator scapulae, rhomboid minor and rhomboid major muscles. Body of the Scapula: The body of the bone has two surfaces, a dorsal and a costal. The former is divided into two fossae by an outstanding process of triangular form, called the spine of scapula. The attached border of this crosses the dorsal surface of the body obliquely in a direction laterally and slightly upwards."}, {"url": "http://www.ivyroses.com/Define/Vertebral_border_of_scapula", "passage_text": "As its name suggests, the vertebral border of the scapula is the closest edge of the scapula bone to the vertebral column. It is also the edge of the scapula bone located towards the middle of the body (as opposed to the lateral-right or left-aspects), hence it is also known as the ' medial border ' of the scapula. The 3 borders of the scapula are 1  : the superior border of the scapula. 2  the medial border of the scapula (also known as the vertebral border of the scapula), and. 3  the axillary border of the scapula (also known as the lateral border of the scapula)."}, {"url": "http://www.ivyroses.com/Define/Vertebral_border_of_scapula", "passage_text": "This section is about. Features on the scapula bone. The vertebral border (of the scapula) is a structural feature on the scapula bone (also known as the shoulder blade or shoulder bone). The 3 borders of the scapula are 1  : the superior border of the scapula. 2  the medial border of the scapula (also known as the vertebral border of the scapula), and. 3  the axillary border of the scapula (also known as the lateral border of the scapula)."}, {"url": "https://www.fgc.edu/wp-content/uploads/2011/12/palpation-of-bony-landmarks.pdf", "passage_text": "4. Medial (vertebral) border – The edge of the scapula closest to the vertebral column (about 2 inches from the spinous processes). The medial border runs in a superior-inferior direction. 5. Lateral (axillary) border – The lateral (or outer) edge of the scapula located between the inferior angle and the shoulder joint. "}, {"url": "http://www.ehealthstar.com/anatomy/shoulder-blade-scapula", "passage_text": "Scapula Anatomy. Picture 2. The right scapula from the front and back side. The shoulder blade is a flat bone with three angles –the upper (superior), bottom (inferior) and lateral (glenoid) angle– and three borders –the superior, lateral (axillary) and medial (vertebral) border (Picture 3) . They make joints with the upper arm bones (humerus) and collar bones (clavicle) but not with the ribs and spine. Shoulder blade (scapular) pain can be located over the large area of the upper back, though. Picture 1. Scapula location: on both sides of the upper back, under the muscles."}]