[{"url": "http://garages.about.com/od/buildingagarage/fl/How-to-Determine-the-Cost-Per-Square-Foot-of-a-Garage.htm", "passage_text": "Therefore, if you have an 800 square foot garage you actually need 8 square of shingles. Typically asphalt shingles are the least expensive to install at about $130 per square whereas a metal roof will have a longer warranty but will cost anywhere between $300 and $1,000 per square. The final thing you need to decide on when determining the cost per square foot of a garage is whether you want to finish the inside right away. Depending on the R-factor you choose, you'll need to add between $0.50 and $3.00 per square foot for insulation."}, {"url": "http://www.fixr.com/costs/build-detached-garage", "passage_text": "1 This translates to $86 per square foot; and. 2  Four car-Traditionally, the per square foot costs on larger structures will decrease, and it is safe to assume a $60 per square foot cost on the larger unit. 3  This translates to a total cost of $86,400. 1 The two car garage would have a total of 728 square feet for a cost of $700, and the four car garage would have a total of 1728 square feet at a cost of $1700 - both sets of prices are for materials only;"}, {"url": "http://www.fixr.com/costs/build-detached-garage", "passage_text": "1 Four car-Traditionally, the per square foot costs on larger structures will decrease, and it is safe to assume a $60 per square foot cost on the larger unit. 2  This translates to a total cost of $86,400. 1 The two car garage would have a total of 728 square feet for a cost of $700, and the four car garage would have a total of 1728 square feet at a cost of $1700 - both sets of prices are for materials only;"}, {"url": "http://www.homerenovationwi.com/how-much-will-it-cost-to-build-a-garage-on-my-property/", "passage_text": "The cost to build your garage is generally calculated by the square footage of the building along with any of the additional extras you might require. A good rough ballpark would be $40-$100 per square foot of construction. This would be a decent sized two car garage with a bit of room around the edges for shelving and storage. If we calculate out a rough finished cost of say $55 per square foot to construct the building you are looking at roughly $38,500 to build your very basic, bare bones garage."}, {"url": "http://homeguides.sfgate.com/garage-building-information-64563.html", "passage_text": "Depending on the grade of materials you use in the construction, a garage will cost, on average, $30 to $55 per square foot for materials and labor if you hire a contractor. A typical one-car garage requires about 240 square feet, and a two-car garage is usually about 380 square feet. "}, {"url": "http://www.behmdesign.com/garage-building-cost.aspx", "passage_text": "by Jay Behm-A very basic way to estimate the cost of building a detached garage is to simply apply a typical average per square foot construction of $30 to $40. That is for an average cost basis for having a contractor / builder build a basic one story garage for you on your property. If you are in an area with higher-than-average cost of living you can use $50 to $55. If there are complications or you prefer top quality materials and components the price can go up.So, generally speaking, a 24 ft.sq., two car, basic garage will cost in the range of $17,000 to $23,000."}, {"url": "http://www.rempros.com/costs/building_garage_prices.html", "passage_text": "How much does it cost to build a garage? Cost to build a new 2 car garage will vary from $30 to $41 per square foot for standard construction including labor cost and materials prices. "}, {"url": "http://home.costhelper.com/build-garage.html", "passage_text": "1 Upgrading the quality of materials can bump the cost to $55 a square foot, or $13,200 for a minimum single-car structure, $21,000 for a two-car garage and $47,000 or more for the dream version. "}, {"url": "http://www.fixr.com/costs/build-detached-garage", "passage_text": "For this discussion we will assess the costs of building detached a two-car as well as a four car garage. The measurements of the average two car model is 26'x26'or 676 square feet. The average square footage of a four car garage is 48'x30' or 1440 square feet. 1 The two car garage would have a total of 728 square feet for a cost of $700, and the four car garage would have a total of 1728 square feet at a cost of $1700 - both sets of prices are for materials only;"}, {"url": "http://www.fixr.com/costs/build-detached-garage", "passage_text": "For the building of the garages, the typical costs will include: 1  Two car-According to Hanley Wood and their Remodeling magazine, the cost to construct a standard two-car garage addition is $58,432. 2  This translates to $86 per square foot; and. 1 The two car garage would have a total of 728 square feet for a cost of $700, and the four car garage would have a total of 1728 square feet at a cost of $1700 - both sets of prices are for materials only;"}]