[{"url": "http://www.answers.com/Q/What_does_annual_salary_mean", "passage_text": "What is the annual salary of a mineralogist? The average annual salary for a mineralogist working in the US is  about $110,000. Salaries can range depending on experience, skill,  and hiring company, from $48,000--whic … h is a typical entry level  salary--to $135,000."}, {"url": "http://www.accountingweb.com/aa/auditing/annual-salaries-and-total-compensation-increase-for-ima-members", "passage_text": "Annual salaries for IMA members rebounded strongly in 2012, as evidenced by an increase of $3,624 over the 2011 annual salary – the largest year-over-year dollar and percentage increase in the report's history. The average total compensation for IMA members increased from $129,591 in 2011 to $135,654 in 2012."}, {"url": "http://www.ehow.com/info_7924015_total-annual-income-mean.html", "passage_text": "Most workers earn a salary or hourly rate, which is typically the largest part of a person's total income. For example a marketing manager may earn $80,000 per year in salary. Excluding any incentive payments, the $80,000 salary may represent 85 percent of the marketing manager's total annual income."}, {"url": "http://smallbusiness.chron.com/difference-between-annual-compensation-pay-20411.html", "passage_text": "What you earn for working over the course of a year is made up of a variety of components. Your annual wages or pay -- what you bring home before taxes in your paycheck -- and what you earn in total annual compensation are two very different things, particularly if your company provides significant benefits."}, {"url": "http://www.spo.state.nm.us/total-compensation.aspx", "passage_text": "The 2014 average base salary is $43,576 - 57.4% of total compensation. The remaining components (mandated benefits, insurance, and paid time off) are valued on average at $29,653 or 42.6% of total compensation-an. annual total compensation amount of $73,229."}, {"url": "http://www.calcxml.com/calculators/total-compensation", "passage_text": "Your employees may be surprised to find out how much is paid out in other benefits in addition to their salaries. The employer has both required and discretionary payments that it makes on behalf of the employee. Use this calculator to help illustrate the total compensation package for an employee."}, {"url": "http://smallbusiness.chron.com/difference-between-annual-compensation-pay-20411.html", "passage_text": "Annual Salary. People generally think first about their annual wages or salary when asked about earnings. For example, if you earn $45,000 per year, that's what you'll think of as your annual wages or salary. However, your wages or salary doesn't encompass all of your compensation, especially if you work full time and for a large, established company."}]