[{"url": "http://chemistry.about.com/od/lecturenoteslab1/a/Dna-Versus-Rna.htm", "passage_text": "1 DNA contains the sugar deoxyribose, while RNA contains the sugar ribose. 2  The only difference between ribose and deoxyribose is that ribose has one more-OH group than deoxyribose, which has-H attached to the second (2') carbon in the ring. DNA stands for deoxyribonucleic acid, while RNA is ribonucleic acid. Although DNA and RNA both carry genetic information, there are quite a few differences between them. This is a comparison of the differences between DNA versus RNA, including a quick summary and a detailed table of the differences."}, {"url": "http://www.answers.com/Q/How_is_DNA_different_from_RNA", "passage_text": "DNA is two stranded while RNA is usually one stranded. DNA uses a deoxyribose sugar while RNA uses a ribose sugar. DNA has the base thymine while RNA uses uracil in it's place … . RNA is catalytic, while DNA is only an information storage molecule. Three of the nitrogenous bases are the same for both RNA and DNA: guanine, adenine, and cytosine. Thymine, the fourth base pair found in DNA, is replaced by uracil in RNA. DNA has deoxyribose sugar while RNA has ribose sugar. The deoxyribose sugar has one less oxygen atom than the"}, {"url": "https://answers.yahoo.com/question/index?qid=20130523054333AADIUbz", "passage_text": "The sugar present in the molecules is the main difference between the DNA and RNA. So the correct potion is 4. The sugar present in RNA molecule is ribose and in DNA molecule it is deoxyribose. Deoxyribose is the same as ribose, except that the former has one more OH. Deoxyribose sugar is less reactive because of C-H bond and ribose sugar is more reactive because of C-OH bonds. Lola · 2 years ago."}, {"url": "https://answers.yahoo.com/question/index?qid=20061123191914AARnwAr", "passage_text": "RNA serves as the template for translation of genes into proteins, transferring amino acids to the ribosome to form proteins, and also translating the transcript into proteins. Comparison with DNA Unlike DNA, RNA is almost always a single-stranded molecule and has a much shorter chain of nucleotides. RNA contains ribose, rather than the deoxyribose found in DNA (there is a hydroxyl group attached to the pentose ring in the 2' position whereas RNA has two hydroxyl groups). RNA has ribose sugars where DNA has DeoxyRibose. both DNA and RNA have Citosine, Adenine, Guanine in RNA, other nitrogen base is are urasil in DNA, other nitrogen base is are thiamine. above are the most obvious differences."}, {"url": "https://answers.yahoo.com/question/index?qid=20061123191914AARnwAr", "passage_text": "Best Answer: RNA Ribonucleic acid (RNA) is a nucleic acid polymer consisting of nucleotide monomers. RNA nucleotides contain ribose rings and uracil unlike deoxyribonucleic acid (DNA), which contains deoxyribose and thymine. RNA has ribose sugars where DNA has DeoxyRibose. both DNA and RNA have Citosine, Adenine, Guanine in RNA, other nitrogen base is are urasil in DNA, other nitrogen base is are thiamine. above are the most obvious differences."}, {"url": "http://www.answers.com/Q/DNA_differs_from_RNA_in_that_DNA", "passage_text": "DNA is two stranded while RNA is usually one stranded. DNA uses a deoxyribose sugar while RNA uses a ribose sugar. DNA has the base thymine while RNA uses uracil in it's place. RNA is catalytic, while DNA is only an information storage molecule. In terms o … f their physical structure, DNA is a double helix, while RNA is a single strand. 4. DNA is found only inside of the nucleus because it is too big to pass through the nuclear pores. RNA passes through the nuclear envelope from the nucleus to the cytoplasm. 5."}, {"url": "http://www.ehow.com/how-does_4566205_dna-rna-differ.html", "passage_text": "DNA stands for deoxyribonucleic acid, while RNA stands for ribonucleic acid. DNA, thus, carries a deoxyribose sugar and RNA contains a ribose sugar. DNA is composed of several types of nitrogenous bases: adenine, thymine, cytosine and guanine. RNA contains nitrogenous bases similar to DNA, but does not contain thymine. It contains uracil instead."}, {"url": "https://answers.yahoo.com/question/index?qid=20061123191914AARnwAr", "passage_text": "main difference in the sugar molecule. RNA has ribose sugars where DNA has DeoxyRibose. both DNA and RNA have Citosine, Adenine, Guanine in RNA, other nitrogen base is are urasil in DNA, other nitrogen base is are thiamine. above are the most obvious differences. contact me if you want mor"}, {"url": "http://chemistry.about.com/od/lecturenoteslab1/a/Dna-Versus-Rna.htm", "passage_text": "1 DNA and RNA base pairing is slightly different, since DNA uses the bases adenine, thymine, cytosine, and guanine; RNA uses adenine, uracil, cytosine, and guanine. 2  Uracil differs from thymine in that it lacks a methyl group on its ring. DNA stands for deoxyribonucleic acid, while RNA is ribonucleic acid. Although DNA and RNA both carry genetic information, there are quite a few differences between them. This is a comparison of the differences between DNA versus RNA, including a quick summary and a detailed table of the differences."}, {"url": "https://answers.yahoo.com/question/index?qid=20130523054333AADIUbz", "passage_text": "DNA contain the deoxyribose sugar. Other differences may include; DNA is double stranded while RNA is single stranded DNA contain the base thymine while RNA contain the base Uracil in place of thymine. The sugar present in RNA molecule is ribose and in DNA molecule it is deoxyribose. Deoxyribose is the same as ribose, except that the former has one more OH. Deoxyribose sugar is less reactive because of C-H bond and ribose sugar is more reactive because of C-OH bonds. Lola · 2 years ago."}]