[{"url": "http://www.howmuchisit.org/renting-a-rv-cost/", "passage_text": "1 On average, renting an RV for an entire week can cost anywhere from $450 to $1,800 depending on the type of RV. 2  The main factors that are going to influence the price are going to include the local state taxes, the type of motorhome, the miles driven as well as the amount of days that it’s going to be rented. 1 For example, a standard Class-C RV that is 25′ can cost $840 to $3,200 per week or $120 to $171 per day. 2  Daily rates can fluctuate depending on the time of the season. 3  Summer months are going to cost more than the winter months. 4  A 33′ RV that is towed can cost $525 to $900 per night."}, {"url": "http://www.howmuchisit.org/renting-a-rv-cost/", "passage_text": "The cost of renting an RV is going to depend on the size of the RV, the features, the model, the company renting it out, as well as other factors. 1  On average, renting an RV for an entire week can cost anywhere from $450 to $1,800 depending on the type of RV. 1 For example, a standard Class-C RV that is 25′ can cost $840 to $3,200 per week or $120 to $171 per day. 2  Daily rates can fluctuate depending on the time of the season. 3  Summer months are going to cost more than the winter months. 4  A 33′ RV that is towed can cost $525 to $900 per night."}, {"url": "http://cars.costhelper.com/rv-rental.html", "passage_text": "1 The most common rental is a Class C motorhome, also called a mini-motorhome. 2  These are typically 20'-30' long, with a sleeping area over the driver's cab, and rent for $70-$150 or more a night, depending on size, season, location and amenities. 3  Mileage fees add 25 cents to 40 cents a mile. 1 If included with the RV, it can cost $50-$100 for a basic kitchen kit, or $15-$80 or more per person for a more complete package. 2  Some companies charge an extra $5-$50 a day for items such as a TV-DVD player, portable generator, bicycle rack, camp chairs or other extras."}, {"url": "http://cars.costhelper.com/rv-rental.html", "passage_text": "1 RV Northwest in Oregon offers a 19-foot lightweight travel trailer for $525-$745 a week and a toy hauler for $749-$896 a week. 2  Renting a pop-up camping trailer that can typically be towed behind an average family vehicle costs $50-$90 a night, or $350-$600 weekly. 1 If included with the RV, it can cost $50-$100 for a basic kitchen kit, or $15-$80 or more per person for a more complete package. 2  Some companies charge an extra $5-$50 a day for items such as a TV-DVD player, portable generator, bicycle rack, camp chairs or other extras."}, {"url": "https://www.cruiseamerica.com/rv-rentals/cost-of-renting-an-rv/", "passage_text": "Cost of Renting an RV. The cost of renting an RV can be surprisingly low if you are shopping in the right arena. While prices fluctuate based on the season, location and availability, you can always find a great deal from Cruise America RV Rental and Sales. By the time you add up all of the travel costs avoided by traveling in a motorhome, the cost of renting an RV becomes very affordable, let alone so much more comfortable. Also, when you rent an RV, you are no longer subject to everyone else's schedules."}, {"url": "http://gorving.ca/rv-rental-costs/", "passage_text": "RV Rental Costs. Typical RV rentals included Motorhomes, while you can also rent Travel Trailers if you have the proper vehicle to tow with. Motorhome Rentals. An average 25-foot class C motorhome, the most popular rented model, will cost about $1000-$1200/week. They usually come fully equipped with kitchen utensils, plates, glasses, cups, cooking pots, towels and bedding."}, {"url": "http://cars.costhelper.com/rv-rental.html", "passage_text": "1 Expect to fill out a rental application and pay a deposit of $200-$600 or more, with the full amount due when picking up the motorhome. 2  Some rental companies charge an additional $50-$100 if the RV is picked up on a weekend during peak season. 1 If included with the RV, it can cost $50-$100 for a basic kitchen kit, or $15-$80 or more per person for a more complete package. 2  Some companies charge an extra $5-$50 a day for items such as a TV-DVD player, portable generator, bicycle rack, camp chairs or other extras."}, {"url": "http://cars.costhelper.com/rv-rental.html", "passage_text": "1 Some rental companies charge an additional $50-$100 if the RV is picked up on a weekend during peak season. 2  Class As average about 8-10 miles per gallon, with a typical fuel tank holding 100-150 gallons. 3  At $2.50-$4 a gallon, a fill-up could cost $250-$600 and last 800-1,500 miles. 1 If included with the RV, it can cost $50-$100 for a basic kitchen kit, or $15-$80 or more per person for a more complete package. 2  Some companies charge an extra $5-$50 a day for items such as a TV-DVD player, portable generator, bicycle rack, camp chairs or other extras."}]