[{"url": "http://www.biology-online.org/dictionary/RNA_polymerase", "passage_text": "RNA polymerase. Rna polymerase (RNAP or RNApol) is an enzyme that is responsible for making rna from a dna template. In all cells RNAP is needed for constructing rna chains from a dna template, a process termed transcription. In scientific terms, RNAP is a nucleotidyl transferase that polymerizes ribonucleotides at the 3' end of an rna transcript. Rna polymerase enzymes are essential and are found in all organisms, cells, and many viruses."}, {"url": "https://simple.wikipedia.org/wiki/RNA_polymerase", "passage_text": "RNA polymerase (RNAP) in action. It is building a messenger RNA molecule from a DNA helix. Part of the enzyme was made transparent so the RNA and DNA can be seen. The magnesium ion (yellow) is located at the enzyme active site.RNA polymerase (RNAP) is the enzyme which does transcription . The 2006 Nobel Prize in Chemistry was awarded to Roger D. Kornberg for creating detailed molecular images of RNA polymerase during various stages of the transcription process."}, {"url": "http://www.nature.com/scitable/definition/RNA-polymerase-106", "passage_text": "As complex molecule composed of protein subunits, RNA polymerase controls the process of transcription, during which the information stored in a molecule of DNA is copied into a new molecule of messenger RNA. enzyme | transcription | polymerase chain reaction | DNA | RNA | DNA polymerase | replication | transcription factor | chromosome | phosphate backbone | nucleic acid | poly-A tail | primer | primase | TATA box | ATP | promoter | DNA sequencing | mRNA."}, {"url": "https://en.wikipedia.org/wiki/RNA_polymerase", "passage_text": "Compare RNA-dependent RNA polymerase. RNA polymerase (RNAP or RNApol), also known as DNA-dependent RNA polymerase, is an enzyme that produces primary transcript RNA. In cells, RNAP is necessary for constructing RNA chains using DNA genes as templates, a process called transcription. Each RNAP is transcribing an RNA strand, which can be seen branching off from the DNA. Begin indicates the 3' end of the DNA, where RNAP initiates transcription; End indicates the 5' end, where the longer RNA molecules are completely transcribed."}, {"url": "https://en.wikipedia.org/wiki/RNA_polymerase", "passage_text": "RNA polymerase enzymes are essential to life and are found in all organisms and many viruses.ach RNAP is transcribing an RNA strand, which can be seen branching off from the DNA. Begin indicates the 3' end of the DNA, where RNAP initiates transcription; End indicates the 5' end, where the longer RNA molecules are completely transcribed."}, {"url": "http://www.nature.com/scitable/definition/RNA-polymerase-106", "passage_text": "RNA polymerase is an enzyme that is responsible for copying a DNA sequence into an RNA sequence, duyring the process of transcription. enzyme | transcription | polymerase chain reaction | DNA | RNA | DNA polymerase | replication | transcription factor | chromosome | phosphate backbone | nucleic acid | poly-A tail | primer | primase | TATA box | ATP | promoter | DNA sequencing | mRNA."}, {"url": "http://www.nature.com/scitable/definition/RNA-polymerase-106", "passage_text": "RNA polymerases have been found in all species, but the number and composition of these proteins vary across taxa. For instance, bacteria contain a single type of RNA polymerase, while eukaryotes (multicellular organisms and yeasts) contain three distinct types. enzyme | transcription | polymerase chain reaction | DNA | RNA | DNA polymerase | replication | transcription factor | chromosome | phosphate backbone | nucleic acid | poly-A tail | primer | primase | TATA box | ATP | promoter | DNA sequencing | mRNA."}, {"url": "http://www.thefreedictionary.com/RNA+polymerase", "passage_text": "n. A polymerase that catalyzes the synthesis of a complementary strand of RNA from a DNA template, or, in some viruses, from an RNA template."}, {"url": "http://www.ncbi.nlm.nih.gov/books/NBK22085/", "passage_text": "RNA polymerase. In most prokaryotes, a single RNA polymerase species transcribes all types of RNA. Figure 10-7 shows the structure of RNA polymerase from E. coli. We can see that the enzyme consists of four different subunit types.nitiation of transcription. (a) RNA polymerase searches for a promoter site. (b) It recognizes a promoter site and binds tightly, forming a closed complex. (c) The holoenzyme unwinds a short stretch of DNA, forming an open complex."}]