[{"url": "http://courses.washington.edu/conj/motor/motorunit.htm", "passage_text": "A motor unit consists of one somatic efferent (motor) neuron and all of the muscle fibers (cells) that it innervates. In the figure to the right, two motor units are illustrated diagrammatically. Notice that after an efferent axon enters the muscle, it branches and forms synapses with a number of muscle fibers."}, {"url": "http://www.users.csbsju.edu/~mcampos/A&P/Muscle_physiology.html", "passage_text": "- muscles are innervated by motor neurons; the axon of each motor neuron branches profusely, each axon terminal innervating a single muscle fiber (conversely, each muscle fiber is only innervated by a single axon terminal)."}, {"url": "http://www.ask.com/science/many-motor-neurons-innervate-muscle-fiber-211d39ace6dce436", "passage_text": "A: Only one motor neuron innervates each individual muscle fiber, as the University of Washington explains. However, each motor neuron is connected to multiple muscle fibers within a bundle. This is termed a single motor unit."}, {"url": "http://www.ask.com/science/many-motor-neurons-innervate-muscle-fiber-211d39ace6dce436", "passage_text": "Quick Answer. Only one motor neuron innervates each individual muscle fiber, as the University of Washington explains. However, each motor neuron is connected to multiple muscle fibers within a bundle. This is termed a single motor unit."}, {"url": "http://neuroscience.uth.tmc.edu/s3/chapter01.html", "passage_text": "1 Each individual muscle fiber in a muscle is innervated by one, and only one, motor neuron (make sure you understand the difference between a muscle and a muscle fiber). 2  A single motor neuron, however, can innervate many muscle fibers."}, {"url": "https://en.wikipedia.org/wiki/Motor_unit", "passage_text": "All muscle fibers in a motor unit are of the same fiber type. When a motor unit is activated, all of its fibers contract. In vertebrates, the force of a muscle contraction is controlled by the number of activated motor units."}, {"url": "http://neuroscience.uth.tmc.edu/s3/chapter01.html", "passage_text": "1 Thus, there is a one-to-one relationship between a muscle and a motor neuron pool. 2  Each individual muscle fiber in a muscle is innervated by one, and only one, motor neuron (make sure you understand the difference between a muscle and a muscle fiber). 3  A single motor neuron, however, can innervate many muscle fibers."}, {"url": "http://neuroscience.uth.tmc.edu/s3/chapter01.html", "passage_text": "1 A single motor neuron, however, can innervate many muscle fibers. 2  The combination of an individual motor neuron and all of the muscle fibers that it innervates is called a motor unit. 3  The number of fibers innervated by a motor unit is called its innervation ratio."}]