[{"url": "https://en.wikipedia.org/wiki/Training_and_licensing_of_clinical_psychologists", "passage_text": "The training and licensing of clinical psychologists ranges from 4 year undergraduate degree plus a 4 to 6 year doctorate program. Most programs in the U.S. are PhD programs that have a strong focus on research and are typically housed in universities. There is stiff competition to gain acceptance into clinical psychology doctoral programs (acceptance rates of 2-5% are not uncommon). Clinical psychologists in the U.S. undergo many years of graduate training—usually 5 to 7 years post-Bachelors—in order to gain demonstrable competence and experience."}, {"url": "http://www.innerbody.com/careers-in-health/becoming-clinical-psychologist.html", "passage_text": "Most doctoral programs have internship requirements during which clinical psychology students gain firsthand knowledge of the field. Most students take five to seven years to complete the requirements for the PsyD or PhD degree with their internship and training opportunities. Licensing and/or Certifications. Practicing clinical psychologists must pass state-specific exams and meet the state licensing requirements. Education. Undergraduate degrees teach students the fundamentals of psychology, preparing students for clinical work through internships and volunteer opportunities. Even if your undergraduate major was not psychology, many graduate programs will accept students from a variety of academic disciplines."}, {"url": "http://www.bls.gov/ooh/life-physical-and-social-science/psychologists.htm", "passage_text": "Graduates with a master’s degree in psychology can work as industrial-organizational psychologists. When working under the supervision of a doctoral psychologist, master’s graduates can also work as psychological assistants in clinical, counseling, or research settings. Psychologists can complete a Ph.D. in psychology or a Doctor of Psychology (Psy.D.) degree. A Ph.D. in psychology is a research degree that culminates in a comprehensive exam and a dissertation based on original research."}, {"url": "http://study.com/what_are_the_education_requirements_for_becoming_a_psychologist.html", "passage_text": "Essential Information. Psychologists study the mental processes of humans (and sometimes animals) and offer assessments for treatment, counseling and medication. Becoming a psychologist requires significant education, especially at the graduate-level. In addition to theoretical and applied coursework, psychology students must accrue significant work experience. Depending on the program, students may be able to choose a concentration, such as clinical psychology. Source: *U.S. "}, {"url": "http://study.com/articles/Psychologist_Educational_Requirements.html", "passage_text": "Doctorate in Psychology. Most states require people who run their own practice to have a Ph.D. or Psy.D. Prospective psychologists interested in research may consider Doctor of Philosophy in Psychology programs, while Doctor of Psychology programs are best suited for the practice of psychology. Undergraduate Level. A bachelor's degree is the minimum requirement for work in the psychology field, and competition is keen for jobs at this level. The BLS says that individuals who hold a bachelor's degree can apply for a limited number of jobs with the federal government or work as assistants to psychologists."}, {"url": "http://coe.wayne.edu/tbf/educational-psychology/school-index.php", "passage_text": "Completion of the M.A. degree satisfies the State of Michigan Department of Education certification requirements for school psychologists and the State of Michigan Board of Psychology requirements for a limited license to practice psychology (LLP) in the community. The Wayne State University Educational Psychology Program Area offers a graduate program in School and Community Psychology. A minimum of 64 hours of graduate level coursework is required for program completion."}, {"url": "http://www.goodtherapy.org/become-a-therapist/education-requirements.html", "passage_text": "Undergraduate Studies. Before you begin formal training in graduate school to become a therapist, you will have to finish a bachelor's degree at a college or university. A major in a field such as psychology or social work can give you the strong background you will need to excel in graduate school. Master's Degree. Your master's degree is where you will get the specialized training you need to become a licensed therapist. You will likely take classes in interpersonal, group, family, and child psychology, as well as classes on ethics in therapy, psychological theories, research methods, and clinical best practices."}, {"url": "http://study.com/articles/Psychologist_Educational_Requirements.html", "passage_text": "Essential Information. Psychologists study the human mind and behavior to help patients overcome emotional or psychological difficulties. Becoming a psychologist requires obtaining a master's or doctoral degree. During this process, students may perform research, work supervised clinical rotations and teach classes. They may work in a variety of specialties, such as counseling, school or clinical psychology. Undergraduate Level. A bachelor's degree is the minimum requirement for work in the psychology field, and competition is keen for jobs at this level. The BLS says that individuals who hold a bachelor's degree can apply for a limited number of jobs with the federal government or work as assistants to psychologists."}]