[{"url": "http://www.magickal-musings.com/spirit_guides.htm", "passage_text": "Your Spirit Guide, unlike your Guardian Angel, comes & goes in your life. A Guardian Angel is with you from birth until death. A Spirit Guide, on the other hand, comes into your life when an issue arises that falls under a guide's field of expertise. So, Spirit Guides often come and go, changing as the situations in your life change, and as you change and grow, you attract new guides to you. Your Spirit Guide is always there to help you. Once you have established contact with your Spirit Guide you have established an important connection. As a result, be sure to play close attention to your dreams. You may wish to keep a recorder or journal next to your bed so you can note any details."}, {"url": "http://www.quantumbliss.com/583/contacting-your-spirit-guide-using-meditation/", "passage_text": "While various methods are being put forth for getting in touch with your spirit guide, one of the simplest, yet most effective, is to use meditation. When you meditate, and your conscious mind becomes relaxed and quiet, you are more open to receiving guidance from within. "}, {"url": "http://spiritualistresources.com/cgi-bin/articles/index.pl?read=276", "passage_text": "By: Abhishek Agarwal. Spirit guides are spiritual entities who can access the material world and provide wisdom, knowledge, and understanding to its inhabitants. Some people believe that spirit guides are in close communication with those who have psychic abilities. Others are sure that everybody on earth has a guide"}, {"url": "http://www.beliefnet.com/wellness/2010/09/contact-your-spirit-guides.aspx", "passage_text": "A spiritual teacher shows you how to commune with your higher nature for insights and wisdom. 1 2 3 4 next. Everyone is a channel for spirit guidance. We innately have the capacity to connect with the spiritual energies that surround us all the time. Before calling on your spirit guides and angels, set up your environment, including a comfortable seating arrangement. Have a glass of water within reach. Dim your lights, lower window blinds and/or close curtains. You may also choose to light incense and/or candles."}, {"url": "http://www.mindbodygreen.com/0-13085/befriend-your-spirit-guide-3-simple-steps.html", "passage_text": "1. Connect to your own spirit and soul's essence so that you can hear the whispers of your Spirit Guide. When you connect to your soul’s essence, you raise your vibration, and with a raised vibration it will be much easier for your Spirit Guide to make conscious contact with you. 3. Ask for his or her name. Demonstrate your faith, trust, and belief in the existence of your Spirit Guide by asking, in the form of a prayer, for his or her name. (Yes, they are male or female.)."}, {"url": "http://spiritualistresources.com/cgi-bin/articles/index.pl?read=276", "passage_text": "Some people claim that their guides appear to them in physical forms. You can get in touch with your guide in the following ways. * If you learn astral projection, you can easily meet your spirit guide. Astral projection enables you to consciously leave your physical body and travel over the astral realms. Spirit guides are spiritual entities who can access the material world and provide wisdom, knowledge, and understanding to its inhabitants. Some people believe that spirit guides are in close communication with those who have psychic abilities. Others are sure that everybody on earth has a guide"}, {"url": "http://ezinearticles.com/?Spirit-Guides---How-to-Get-in-Touch-With-Your-Spirit-Guide&id=3234021", "passage_text": "Some people claim that their guides appear to them in physical forms. You can get in touch with your guide in the following ways. * If you learn astral projection, you can easily meet your spirit guide. Astral projection enables you to consciously leave your physical body and travel over the astral realms. This is their spirit guide at work. How To Ask For Guidance. Once you learn how to communicate with your guide, you can get in touch with him/her at will or whenever you need answers to some burning life questions. You can also use dreams to get in touch with your guide. Simply go to sleep secure in the knowledge that you will dream a solution to your problems or an answer to your questions. You will wake up knowing the answer to your question or the solution to your proble"}, {"url": "http://www.micheleknight.com/articles/psychic/psychic-ability/meeting-your-spirit-guide/", "passage_text": "To find your spirit guide find a quiet space (this is a good one to do outside with your back to a tree but you can do it anywhere), visualise your heart like a flower in bud with the petals of truth and wisdom unfolding. "}]