[{"url": "http://www.rxlist.com/adcirca-drug/patient-images-side-effects.htm", "passage_text": "Tadalafil under the name of Cialis is used to treat erectile dysfunction (impotence) and symptoms of benign prostatic hypertrophy (enlarged prostate). Another brand of tadalafil is Adcirca, which is used to treat pulmonary arterial hypertension and improve exercise capacity in men and women. "}, {"url": "http://www.webmd.com/drugs/2/drug-77881/cialis-oral/details", "passage_text": "Uses. Tadalafil is used to treat male sexual function problems (impotence or erectile dysfunction-ED). In combination with sexual stimulation, tadalafil works by increasing blood flow to the penis to help a man get and keep an erection. Tadalafil is also used to treat the symptoms of an enlarged prostate (benign prostatic hyperplasia-BPH). It helps to relieve symptoms of BPH such as difficulty in beginning the flow of urine, weak stream, and the need to urinate frequently or urgently (including during the middle of the night)."}, {"url": "http://www.medicinenet.com/tadalafil/article.htm", "passage_text": "DRUG CLASS AND MECHANISM: Tadalafil is an oral drug that is used for treating impotence (the inability to attain or maintain a penile erection) and benign prostatic hyperplasia (BPH). It is in a class of drugs called phosphodiesterase-5 (PDE5) inhibitors that also includes sildenafil (Viagra) and vardenafil (Levitra). "}, {"url": "http://men.emedtv.com/tadalafil/generic-tadalafil.html", "passage_text": "Tadalafil (Cialis ®) is a prescription drug that is licensed for treating erectile dysfunction (ED). It is also approved for treating enlarged prostate symptoms. Tadalafil is manufactured by Eli Lilly and is currently protected by a patent that prevents a generic tadalafil from being manufactured. The first patent for tadalafil expires in 2016. It is expected that once tadalafil goes off patent, several companies will begin manufacturing a generic tadalafil drug."}, {"url": "https://en.wikipedia.org/wiki/Tadalafil", "passage_text": "On November 21, 2003 the FDA approved tadalafil (as Cialis) for sale in the United States as the third ED prescription drug pill (after sildenafil citrate (Viagra) and vardenafil Hydrochloride (Levitra)). Like sildenafil and vardenafil, tadalafil is recommended as an 'as needed' medication. The recommended tadalafil starting dose for most men is 10 mg, taken as needed before sexual activity (but not more than once daily). The dose may be increased to 20 mg or decreased to 5 mg, per its efficacy and the man's personal tolerance of the drug."}, {"url": "http://erectile-dysfunction.emedtv.com/cialis/generic-cialis.html", "passage_text": "Cialis ® (tadalafil) is a prescription medicine that is licensed for treating erectile dysfunction (ED). It is also approved for treating enlarged prostate symptoms. It is manufactured by Eli Lilly and is currently protected by a patent that prevents any generic Cialis from being manufactured. The first patent for Cialis expires in 2016. This is the earliest date that a generic form of Cialis could become available. However, other circumstances could extend the exclusivity period beyond 2016. This could include such things as other patents for specific Cialis uses or lawsuits."}, {"url": "https://en.wikipedia.org/wiki/Tadalafil", "passage_text": "The approved dose for pulmonary arterial hypertension is 40 mg (two 20-mg tablets) once daily. Tadalafil is also manufactured and sold under the name of Tadacip by the Indian pharmaceutical company Cipla in doses of 10 mg and 20 mg. The recommended tadalafil starting dose for most men is 10 mg, taken as needed before sexual activity (but not more than once daily). The dose may be increased to 20 mg or decreased to 5 mg, per its efficacy and the man's personal tolerance of the drug."}, {"url": "http://erectile-dysfunction.emedtv.com/cialis/generic-cialis.html", "passage_text": "No -- tadalafil is the active ingredient in Cialis, not a generic version of it. Although people often refer to a drug's active ingredient as its generic name, it is actually different than a generic version of it. The first patent for Cialis expires in 2016. This is the earliest date that a generic form of Cialis could become available. However, other circumstances could extend the exclusivity period beyond 2016. This could include such things as other patents for specific Cialis uses or lawsuits."}, {"url": "http://socgeografialisboa.pt/cialis-generic-online/", "passage_text": "Info about order cialis generic online in us generic generic cialis generic online levitra time of effectiveness pills 25 mg. Compare lavitra to india female how much tadalafil is in the 50 mg cialis pills for sale generic online cialis athina generic psychological cialis cheap online canada in buy. Tschechien viagra vs cialis online generic vs lavetra what doseage of should i use. What is the difference between 10 mg and 20mg plus viagra how long does it take daily propecia and alopecia areata to work. Vanzare online generic cialis taking and viagra at same time does really work online cialis generic 36 hour cost."}, {"url": "http://socgeografialisboa.pt/cialis-generic-online/", "passage_text": "Nasacort aq india pharmacies levitra generic or other viagra and its dangerous. Tschechien viagra vs cialis online generic vs lavetra what doseage of should i use. What is the difference between 10 mg and 20mg plus viagra how long does it take daily propecia and alopecia areata to work. Vanzare online generic cialis taking and viagra at same time does really work online cialis generic 36 hour cost."}]