[{"url": "http://www.dinkneshethiopiatour.com/3-Cultural/1Languages.htm", "passage_text": "Tigrigna and Amharigna (Amharic) are the modern Languages which are derived from Ge'ez. Amharic is the official national language of Ethiopia. English, Arabic, Italian and French are widely spoken by many Ethiopians. The Ethiopian Languages are divided into four major language groups. These are Semitic, Cushitic, Omotic, and Nilo-Saharan. Ge'ez is the ancient language, and was introduced as an official written language during the first Axumite kingdom when the Sabeans sought refuge in Axum The Axumite developed Ge'ez, a unique script derived from the Sabean alphabet, and it is still used by the Ethiopian Orthodox Tewahedo Church today."}, {"url": "http://www.omniglot.com/writing/amharic.htm", "passage_text": "Amharic is a Semitic language and the national language of Ethiopia (ኢትዮጵያ). The majority of the 25 million or so speakers of Amharic can be found in Ethiopia, but there are also speakers in a number of other countries, particularly Eritrea (ኤርትራ), Canada, the USA and Sweden. The name Amharic (ኣማርኛ - amarənna) amarəñña comes from the district Of (amhara) አማራ in Nortern, ethiopia which is thought to be the historic centre of the. language"}, {"url": "http://dictionary.abyssinica.com/amharic.aspx", "passage_text": "Amharic is rooted from the Ancient language Geez (Ge'ez). Geez was the official language of Ethiopia before Amharic. Although Geez is ceased to be spoken popularly sometime between 900 and 1200 AD, it continues as a language of Ethiopian Church. Since the 13th century Amharic has been the language of the court and the population in Highlands of Ethiopia. It is a native language for over 27 million people in Ethiopia. Amharic is also spoken by over 40,000 people in Israel. It is estimated that Amharic is the language of some 2.7 million emigrants outside Ethiopia. More than 62 million people can speak Amharic globally."}, {"url": "http://dictionary.abyssinica.com/amharic.aspx", "passage_text": "Amharic is the second-most spoken Semitic language in the world, after Arabic. Amharic has four dialectical variations spoken little different from the popular Amharic dialect. (Gojam, Gonder, Wollo, and Menz dialects). According to the 1994 census Amharic is the most commonly spoken language in Ethiopia. It is a native language for over 27 million people in Ethiopia. Amharic is also spoken by over 40,000 people in Israel. It is estimated that Amharic is the language of some 2.7 million emigrants outside Ethiopia. More than 62 million people can speak Amharic globally."}, {"url": "https://en.wikipedia.org/wiki/Amharic_language", "passage_text": "[amarɨɲːa]. ) is a Semitic language spoken in Ethiopia. It is the second-most spoken Semitic language in the world, after Arabic, and the official working language of the Federal Democratic Republic of Ethiopia. Amharic is also the official or working language of several of the states within the federal system. It has been the working language of government, the military, and the Ethiopian Orthodox Tewahedo Church throughout medieval and modern times. The 2007 census counted nearly 22 million native speakers in Ethiopia. Outside Ethiopia, Amharic is the language of some 2.7 million emigrants."}, {"url": "http://www.ethiopiantreasures.co.uk/pages/language.htm", "passage_text": "Ethiopia has 83 different languages with up to 200 different dialects spoken. The largest ethnic and linguistic groups are the Oromos, Amharas and Tigrayans. Ge'ez is the ancient language, and was introduced as an official written language during the first Aksumite kingdom when the Sabeans sought refuge in Aksum. English, Arabic, Italian and French are widely spoken by many Ethiopians. The Ethiopian languages are divided into four major language groups.These are Semitic, Cushitic, Omotic, and Nilo-Saharan."}, {"url": "https://en.wikipedia.org/wiki/Languages_of_Ethiopia", "passage_text": "The languages of Ethiopia refers to the various spoken forms of communication in Ethiopia. It includes the nation's official languages, as well as its minority and foreign languages. In terms of writing systems, Ethiopia's principal orthography is Ge'ez or Ethiopic. Employed as an abugida for several of the country's languages, it first came into usage in the 6th and 5th centuries BC as an abjad to transcribe the Semitic Ge'ez language."}, {"url": "http://aboutworldlanguages.com/amharic", "passage_text": "Amharic has close to 22 million first-language speakers and 4 million second-language speakers worldwide, of which slightly over 21.6 million live in Ethiopia (Ethnologue). It is related to Ge’ez, a liturgical language of the Ethiopian Orthodox Church. Amharic has been the language of the ruling class of Ethiopia since the end of the 13th century. In the early 17th century it became the lingua franca of Ethiopia, a multilingual country with 87 living languages"}, {"url": "http://aboutworldlanguages.com/amharic", "passage_text": "Amharic (amarənna, amarəñña), አማርኛ also known As, Abyssinian, Amarigna, Amarinya, Amhara, ethiopian belongs to The semitic branch of The-Afro asiatic language. family Amharic has been the language of the ruling class of Ethiopia since the end of the 13th century. In the early 17th century it became the lingua franca of Ethiopia, a multilingual country with 87 living languages (Ethnologue)."}, {"url": "http://aboutworldlanguages.com/amharic", "passage_text": "Amharic, with 22 million first-and 4 million second-language speakers, is the official working language of Ethiopia, along with English and Tigrinya. It is used in government, public media, national commerce, and in education up to the seventh grade. Amharic has been the language of the ruling class of Ethiopia since the end of the 13th century. In the early 17th century it became the lingua franca of Ethiopia, a multilingual country with 87 living languages (Ethnologue)."}]