[{"url": "http://www.apple.com/pr/library/2013/06/10Apple-Announces-iTunes-Radio.html", "passage_text": "When you tune into iTunes Radio on your iPhone®, iPad®, iPod touch®, Mac®, PC or Apple TV®, you’ll have access to stations inspired by the music you already listen to, Featured Stations curated by Apple and genre-focused stations that are personalized just for you. So iTunes Radio can use information about your entire music collection to make your stations even more personalized. iTunes Match costs $24.99 for a year. Apple designs Macs, the best personal computers in the world, along with OS X, iLife, iWork and professional software."}, {"url": "https://support.apple.com/kb/PH12332", "passage_text": "Connect to an Internet broadcast. If you know the exact URL of an Internet broadcast or audio file, iTunes can connect to it directly. Enter the full URL of the broadcast or file you want to listen to. For example: http://www.apple.com/itunes/sample.mp3. Tune in to Internet stations. Choose Music from the Library pop-up menu. Click Internet. To see the available stations, click the triangle next to the type of music you want to listen to. To tune in, double-click a station"}, {"url": "http://www.ehow.com/how_4440539_listen-radio-iphone.html", "passage_text": "ITunes Radio. Look for Apple's iTunes Radio in the Music app on your iPhone running iOS 8. The app features an ever-changing selection of featured stations such as ITunes Weekly Top 50, Pure Pop, Jazz Chill and Workouts to several music genres. These are Apple-curated lists and play continuously like traditional radio. IHeart Radio. With the iHeartRadio app, you have a service that is similar to iTunes Radio and Pandora in that you can create personalized stations. However, iHeart Radio features over 1,500 live radio stations. You can select your own area or search for stations across the country."}, {"url": "http://mp3.about.com/od/tutorials/ht/iTunes_Radio.htm", "passage_text": "Even though Apple's iTunes software is mainly used for purchasing music (iTunes Store), creating playlists, ripping CDs, syncing with the iPod, iPhone, or iPad, it also provides a huge pool of Internet radio stations (not to be confused with iRadio) that you can listen to for free. "}, {"url": "http://support.sprint.com/support/article/FAQs-about-iTunes-Radio-on-your-Apple-iPhone-6-Plus/WFAQ_542_GKB77586-dvc8320008prd", "passage_text": "1 You can listen to your favorite genre stations for free. 2  iTunes Radio learns what you like and adapts to play songs you enjoy. 3  The more you listen, the more it learns. 4  You can stream iTunes radio from your Apple iPhone 6 Plus or through iTunes on your computer. 1 iTunes Match is an optional pay-to-subscribe service through Apple. 2  Subscribers can listen to iTunes Radio ad-free. 3  It scans your media library for songs that you own which are also in the iTunes store. 4  If iTunes Match finds a matching song, it adds it to iCloud."}, {"url": "http://www.apple.com/pr/library/2013/06/10Apple-Announces-iTunes-Radio.html", "passage_text": "Radio Stations Tailored to You Based on the Music You Listen to on iTunes. Apple, the Apple logo, Mac, Mac OS, Macintosh, iTunes Store, iTunes, iPhone, iPad iPod touch, Apple TV, Siri, iTunes Match and iCloud are trademarks of Apple. Other company and product names may be trademarks of their respective owners. So iTunes Radio can use information about your entire music collection to make your stations even more personalized. iTunes Match costs $24.99 for a year. Apple designs Macs, the best personal computers in the world, along with OS X, iLife, iWork and professional software."}, {"url": "https://support.apple.com/en-us/HT204944", "passage_text": "Start listening to Apple Music Radio. To listen on your iPhone, iPad, iPod touch, open the Music app and tap the Radio tab at the bottom of the screen. You might be asked to sign in with your Apple ID. To listen on your Mac or PC, open iTunes. From the navigation bar at the top of iTunes, choose Radio. You might be asked to sign in with your Apple ID. Add songs from Apple Music Radio to your library. If you’re a member of Apple Music, you can add songs from Apple Music Radio to your library. 1  Tap the More Options icon to the right of the song, album, or playlist. 2  Tap Add to My Music."}]