[{"url": "http://dofoodsafely.health.vic.gov.au/topics/topic3/page3.php", "passage_text": "Food poisoning is most often caused by bacteria (germs) that have been able to multiply or form a toxin. These germs can be found in soil, on animals, on people and on the things people touch and use. "}, {"url": "http://www.marlerblog.com/e-coli-information/e-coli-bacteria-what-are-they-where-did-they-come-from-and-why-are-some-so-dangerous/", "passage_text": "The best-known and most notorious Stx-producing E. coli is E. coli O157:H7. It is important to remember that most kinds of E. coli bacteria do not cause disease in humans, indeed, some are beneficial, and some cause infections other than gastrointestinal infections, such urinary tract infections. Escherichia coli (E. coli) are members of a large group of bacterial germs that inhabit the intestinal tract of humans and other warm-blooded animals (mammals, birds). Newborns have a sterile alimentary tract, which within two days becomes colonized with E. coli. More than 700 serotypes of E. coli have been identified."}, {"url": "http://www.answers.com/Q/Where_does_bacteria_come_from", "passage_text": "Bacteria (plural of bacterium) are microscopic single-celled  organisms (prokaryotes) that reproduce by binary fission, i.e.  one cell splits into two, the two cells split i … nto four, etc., etc. One bacteria that is found in some … foods is salmonella.  Other sources of bacteria are contaminated swimming pools or rivers  in which a person can swim in. These are called waterborne  diseases."}, {"url": "http://www.hrwc.org/the-watershed/threats/bacteria/sources/", "passage_text": "The issue. Most pets that poop on the lawn are warm blooded mammals, which means that their excrement contains E. coli bacteria. During snowmelt or rainwater events, this bacteria is often washed into local streams and eventually finds its way to the Huron River. When bacteria levels are elevated, the river and tributaries become potentially unsafe for recreation, preventing uses such as canoeing, swimming, or fishing."}, {"url": "http://www.answers.com/Q/Where_does_bacteria_come_from", "passage_text": "Bacteria that make people sick come from different sources. A  person can ingest food or a beverage that has bacteria and make  them sick. One bacteria that is found in some … foods is salmonella.  Other sources of bacteria are contaminated swimming pools or rivers  in which a person can swim in. These are called waterborne  diseases."}, {"url": "http://www.marlerblog.com/e-coli-information/e-coli-bacteria-what-are-they-where-did-they-come-from-and-why-are-some-so-dangerous/", "passage_text": "Sources of E. coli Infections. E. coli O157:H7 bacteria and other pathogenic E. coli is believed to mostly live in the intestines of cattle (Elder, et al., 2000) but has also been found in the intestines of chickens, deer, sheep, and pigs. Escherichia coli (E. coli) are members of a large group of bacterial germs that inhabit the intestinal tract of humans and other warm-blooded animals (mammals, birds). Newborns have a sterile alimentary tract, which within two days becomes colonized with E. coli. More than 700 serotypes of E. coli have been identified."}, {"url": "http://www.answers.com/Q/Where_does_bacteria_come_from", "passage_text": "Bacteria can also cause infection in  humans.   Bacteria is a single celled orga … nisms, classified as Prokaryotes.  Like other organisms in the Earth, bacteria carry out motility,  reproduction, take nutrients, excretion at a cellular level. One bacteria that is found in some … foods is salmonella.  Other sources of bacteria are contaminated swimming pools or rivers  in which a person can swim in. These are called waterborne  diseases."}, {"url": "http://www.about-ecoli.com/ecoli_sources", "passage_text": "A 2003 study on the prevalence of E. coli O157:H7 in livestock at 29 county and three large state agricultural fairs in the United States found that E. coli O157:H7 could be isolated from 13.8% of beef cattle, 5.9% of dairy cattle, 3.6% of pigs, 5.2% of sheep, and 2.8% of goats. E. coli O157:H7 bacteria and other pathogenic E. coli mostly live in the intestines of cattle, but E. coli bacteria have also been found in the intestines of chickens, deer, sheep, and pigs. [1, 35]."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/9889982", "passage_text": "Koch AL. Bacteria in the modern taxonomic sense are one of the three Domains. They must have split from the other two after the bulk of the development of biochemistry and cell biology had taken place. Up to the time of the Last Universal Ancestor (LUA) the world had been monophyletic with little stable diversity. One arose from the consequences of cells accumulating substances from the environment, thus increasing their internal osmotic pressure. This resulted in two nearly simultaneous biological solutions: one (Bacteria) was the development of the external sacculus, i.e. the formation of a stress-bearing exoskeleton."}, {"url": "http://www.hrwc.org/the-watershed/threats/bacteria/sources/", "passage_text": "Bacteria can come from many different sources, including: Most pets that poop on the lawn are warm blooded mammals, which means that their excrement contains E. coli bacteria. During snowmelt or rainwater events, this bacteria is often washed into local streams and eventually finds its way to the Huron River. When bacteria levels are elevated, the river and tributaries become potentially unsafe for recreation, preventing uses such as canoeing, swimming, or fishing."}]