[{"url": "https://en.wikipedia.org/wiki/Dominance_(genetics)", "passage_text": "Incomplete dominance (also called partial dominance) occurs when the phenotype of the heterozygous phenotype is distinct from and often intermediate to the phenotypes of the homozygous phenotypes. For example, the snapdragon flower color is either homozygous for red or white. Complete dominance therefore means that the phenotype of the heterozygote is indistinguishable from that of the dominant homozygote. A classic example of dominance is the inheritance of seed shape (pea shape) in peas. Peas may be round (associated with allele R) or wrinkled (associated with allele r)."}, {"url": "http://www.merriam-webster.com/dictionary/dominance", "passage_text": "1. : the fact or state of being dominant: as a: dominant position especially in a social hierarchy b: the property of one of a pair of alleles or traits that suppresses expression of the other in the heterozygous condition c: the influence or control over ecological communities exerted by a dominant. 2. "}, {"url": "http://www.audioenglish.org/dictionary/dominance.htm", "passage_text": "The noun DOMINANCE has 4 senses: 1. superior development of one side of the body. 2. the state that exists when one person or group has power over another. 3. the organic phenomenon in which one of a pair of alleles present in a genotype is expressed in the phenotype and the other allele of the pair is not. 4. the power or right to give orders or make decisions. Familiarity information: DOMINANCE used as a noun is uncommon. Dictionary entry details."}, {"url": "http://www.biology-online.org/dictionary/Dominance", "passage_text": "(general) The state of being dominant; supremacy; for example in plants, apical dominance refers to the condition in which vertical growth supersedes lateral growth. (genetics) The property of a gene (or allele) when it suppresses the expression, or dominates the effects, of the recessive gene (or allele). "}, {"url": "https://en.wikipedia.org/wiki/Dominance_(ethology)", "passage_text": "Dominance in ethology is an individual's preferential access to resources over another.. Dominance in the context of biology and anthropology is the state of having high social status relative to one or more other individuals, who react submissively to dominant individuals. "}, {"url": "http://www.biology-online.org/dictionary/Dominant", "passage_text": "Definition. (genetics). (1) (Of, or pertaining to) An allele or a gene that is expressed in an organism ’s phenotype, masking the effect of the recessive allele or gene when present. (2) (Of, or pertaining to) An organism that expresses the dominant gene (or allele). (ecology) (Of, or pertaining to) An organism or group of organisms having the most considerable influence or control in its ecological community among other organism. "}, {"url": "http://medical-dictionary.thefreedictionary.com/dominance", "passage_text": "incomplete dominance failure of one gene to be completely dominant, heterozygotes showing a phenotype intermediate between the two parents. lateral dominance the preferential use, in voluntary motor acts, of ipsilateral members of the major paired organs of the body. dominance. 1. the supremacy, or superior manifestation, in a specific situation of one of two or more competitive or mutually antagonistic factors or animals. 2. in genetics, alleles which fully express their phenotype when present in the heterozygous state."}, {"url": "https://en.wikipedia.org/wiki/Dominance_(genetics)", "passage_text": "Also, an allele may be dominant for a particular aspect of phenotype but not for other aspects influenced by the same gene. Dominance differs from epistasis, a relationship in which an allele of one gene affects the expression of another allele at a different gene. Complete dominance therefore means that the phenotype of the heterozygote is indistinguishable from that of the dominant homozygote. A classic example of dominance is the inheritance of seed shape (pea shape) in peas. Peas may be round (associated with allele R) or wrinkled (associated with allele r)."}, {"url": "https://en.wikipedia.org/wiki/Dominance_(genetics)", "passage_text": "Dominance in genetics is a relationship between alleles of one gene, in which the effect on phenotype of one allele masks the contribution of a second allele at the same locus. The first allele is dominant and the second allele is recessive. For genes on an autosome (any chromosome other than a sex chromosome), the alleles and their associated traits are autosomal dominant or autosomal recessive. Dominance is a key concept in Mendelian inheritance and classical genetics. Complete dominance therefore means that the phenotype of the heterozygote is indistinguishable from that of the dominant homozygote. A classic example of dominance is the inheritance of seed shape (pea shape) in peas. Peas may be round (associated with allele R) or wrinkled (associated with allele r)."}]