[{"url": "http://www.answers.com/Q/What_is_the_average_dose_of_morphine_sulfate", "passage_text": "The average dose of morphine depends upon several factors. Is it IV or oral. Even orally, there are several forms of morphine (immediate or extended release, liquid or tablet, etc...). Because you are adding weight (sulfate) to morphine (base), the  weight of Morphine Sulfate will have less morphine (base) in it.    For example: 20mg of morphine sulfate has ~15mg of morphine (the  other 5mg are due to sulfate molecule and 5 water molecules). This  is called the base equivalency."}, {"url": "http://www.meddean.luc.edu/lumen/MedEd/MEDICINE/subint/floor/pain/pca.htm", "passage_text": "In general oral form of morphine is 3 times higher than the i.v form. 2/3rds of the total dose is given in a sustained release form for basal analgesia and 1/3rds as rescue medication for breakthrough pain. For example if the last 24-hour dose was 15 mg of morphine i.v, then oral morphine requirements would be 45 mg. "}, {"url": "http://www.druglib.com/druginfo/morphine/indications_dosage/", "passage_text": "Initiate treatment with morphine sulfate extended-release tablets with 15 mg tablets orally every 8 or 12 hours. The starting dose for patients, who are not opioid-tolerant, is morphine sulfate extended-release tablets 15 mg orally every 12 hours. INDICATIONS AND USAGE. Morphine sulfate extended-release tablets are indicated for the management of pain severe enough to require daily, around-the-clock, long-term opioid treatment and for which alternative treatment options are inadequate."}, {"url": "http://www.nhtsa.gov/people/injury/research/job185drugs/morphine.htm", "passage_text": "Effects: Depends heavily on the dose of morphine or heroin, the route of administration, and previous exposure. Following an intravenous dose of heroin, the user generally feels an intense surge of euphoria (“rush”) accompanied by a warm flushing of the skin, dry mouth, and heavy extremities. Recreationally, daily heroin doses of 5-1500 mg have been reported, with an average daily dose of 300-500 mg. Addicts may inject heroin 2-4 times per day. Depending on the demographic region, the street purity of heroin can range from 11-72% (average U.S. purity is ~38%)."}, {"url": "http://www.hospiceworld.org/book/morphine.htm", "passage_text": "It is usually best to titrate the dose using 4-hourly oral morphine. Once the patient is pain-controlled on a regular 4-hourly dose, then change to the equivalent dose of MS-Contin given every 12 hours. The total dose of MS-Contin over 24 hours is the same as the total dose of 4-hourly morphine. Some pains (visceral and soft tissue) respond well to morphine and some (bone, nerve and colic) do not. (see Pain). Oral morphine should usually be started in a dose of 5mg to 10mg every 4 hours when moderate analgesics are no longer effective."}, {"url": "https://answers.yahoo.com/question/index?qid=20100322142232AAA4osD", "passage_text": "Report Abuse. Morphine is morphine, but oral administration is subject to first pass metabolism, so the oral dosage is substantially higher than the parenteral dose. Average for analgesia in the emergency department is about 1.5 mg/kg body mass, but 10 mg in a shot is about equivalent to 60 mg in a pill. The difference here is that an oral dose enters the portal circulation, goes to the liver, and is mostly metabolized before it has a chance to get into the general circulation."}, {"url": "http://www.mayoclinic.org/drugs-supplements/morphine-oral-route/proper-use/DRG-20074216", "passage_text": "Morphine extended-release capsules or tablets work differently from the regular morphine oral solution or tablets, even at the same dose. Do not switch from one brand or form to the other unless your doctor tells you to. Measure the oral liquid with a marked measuring spoon, oral syringe, or medicine cup. The dose of this medicine will be different for different patients. Follow your doctor's orders or the directions on the label. The following information includes only the average doses of this medicine. If your dose is different, do not change it unless your doctor tells you to do so."}, {"url": "http://www.nhtsa.gov/people/injury/research/job185drugs/morphine.htm", "passage_text": "A usual adult oral dose of morphine is 60-120 mg daily in divided doses, or up to 400 mg daily in opioid tolerant patients. Recreationally, daily heroin doses of 5-1500 mg have been reported, with an average daily dose of 300-500 mg. Addicts may inject heroin 2-4 times per day. Depending on the demographic region, the street purity of heroin can range from 11-72% (average U.S. purity is ~38%)."}, {"url": "http://www.hospiceworld.org/book/morphine.htm", "passage_text": "Morphine is the strong opioid of choice. Some pains (visceral and soft tissue) respond well to morphine and some (bone, nerve and colic) do not. (see Pain). Oral morphine should usually be started in a dose of 5mg to 10mg every 4 hours when moderate analgesics are no longer effective."}]