[{"url": "http://www.theinstitutes.org/guide/designations/chartered-property-casualty-underwriter-cpcu", "passage_text": "Chartered Property Casualty Underwriter (CPCU®). Meet the changes and challenges of a demanding risk management and insurance marketplace with confidence and professionalism—earn the Chartered Property Casualty Underwriter (CPCU) designation."}, {"url": "http://www.ask.com/business-finance/cpcu-designation-ab725fe1acfbaa7f", "passage_text": "A: A CPCU (or Chartered Property Casualty Underwriter) designation is a credential earned by insurance professionals who complete a series of four foundation courses, one elective course and three courses in personal or commercial insurance. Eight national exams must be passed to receive the CPCU designation."}, {"url": "http://nh.iiaa.org/Education/CPCU_FAQ.pdf", "passage_text": "• Who should earn the CPCU designation? The Chartered Property Casualty Underwriter (CPCU) program is not just for underwriters. We recommend the CPCU for agents/brokers, agency principals, claim representatives, line of business managers and executives, insurance litigators, risk managers, as well as"}, {"url": "https://www.theinstitutes.org/program/chartered-property-casualty-underwriter-cpcu", "passage_text": "1 Matriculate with The Institutes by completing an online form and submitting a fee-- this registers you as a CPCU designation candidate and requires you to abide by the CPCU Code of Professional Conduct. 2  It is recommended that you matriculate as early as possible in your CPCU studies."}, {"url": "http://business.illinoisstate.edu/katie/student/designations/", "passage_text": "CPCU Course Waivers. You can earn two course waivers towards the CPCU designation through The Institutes. To qualify, students must earn a B or better as their final grade in approved coursework. More information and the online application for the waiver is available here."}, {"url": "http://www.ask.com/business-finance/cpcu-designation-ab725fe1acfbaa7f", "passage_text": "Quick Answer. A CPCU (or Chartered Property Casualty Underwriter) designation is a credential earned by insurance professionals who complete a series of four foundation courses, one elective course and three courses in personal or commercial insurance. Eight national exams must be passed to receive the CPCU designation."}, {"url": "https://www.theinstitutes.org/program/chartered-property-casualty-underwriter-cpcu", "passage_text": "Experience. To earn the CPCU designation, in addition to completing the education requirements, you must: 1  Matriculate with The Institutes by completing an online form and submitting a fee-- this registers you as a CPCU designation candidate and requires you to abide by the CPCU Code of Professional Conduct."}]