[{"url": "http://www.worldatlas.com/webimage/countrys/asia/th.htm", "passage_text": "After a military attack by Japan in 1941, Thailand aligned with Japan and passively declared war on Britain and the United States. At the end of World War II, following Japan's defeat, Thailand subsequently became a U.S. ally."}, {"url": "http://www.cid.harvard.edu/cidtrade/gov/thailandgov.html", "passage_text": "Thailand Summary. Introduction. The Kingdom of Thailand has been a WTO member since January 1995, and has made steady progress in recent years towards trade liberalization, as well as restructuring its public sector and strengthening its financial system."}, {"url": "https://en.wikivoyage.org/wiki/Thailand", "passage_text": "Thailand (ประเทศไทย), officially the Kingdom of Thailand (ราชอาณาจักรไทย) is a country in Southeast Asia with coasts on the Andaman Sea and the Gulf of Thailand. It borders Myanmar (Burma) to the northwest, Laos to the northeast, Cambodia to the southeast, and Malaysia to the south."}, {"url": "http://www.infoplease.com/encyclopedia/world/thailand.html", "passage_text": "Thailand (tĪˈlănd, –lənd) [ key ], Thai Prathet Thai [land of the free], officially Kingdom of Thailand, constitutional monarchy (2005 est. pop. 65,444,000), 198,455 sq mi (514,000 sq km), Southeast Asia."}, {"url": "http://www.wto.org/english/thewto_e/countries_e/thailand_e.htm", "passage_text": "Home | About WTO | News & events | Trade topics | WTO membership | Documents & resources | External relations. Contact us | Site map | A-Z | Search. espa ol fran ais. home the wto members thailand. MEMBER INFORMATION. Thailand and the WTO. This page gathers key information on Thailand's participation in the WTO. Thailand has been a WTO member since 1 January 1995 and a member of GATT since 20 November 1982."}, {"url": "http://www.plasticsnews.com/article/20130214/NEWS/130219946/thailand-well-positioned-to-be-a-global-bioplastics-hub", "passage_text": "Thailand today is extremely well-positioned to be one of those hubs.. Minnetonka, Minn.-based NatureWorks, which is 50 percent owned by Thailand's PTT Public Co. Ltd., is considering Thailand for the site of its second resin plant, after its current facility in Nebraska."}, {"url": "http://www.infoplease.com/encyclopedia/world/thailand.html", "passage_text": "Occupying a central position on the Southeast Asia peninsula, Thailand is bordered by Myanmar on the west and northwest, by Laos on the north and east (the Mekong River forms much of the line), by Cambodia on the southeast, and by the Gulf of Thailand and Malaysia on the south."}, {"url": "http://www.cid.harvard.edu/cidtrade/gov/thailandgov.html", "passage_text": "The United States, Thailand's largest trading partner (Thailand ranks 18th among U.S. trading partners), is currently in negotiations with the Thai government for a free-trade agreement that would expand market and investment access between the countries."}]