[{"url": "http://animals.nationalgeographic.com/animals/reptiles/black-mamba/", "passage_text": "Black mambas are fast, nervous, lethally venomous, and when threatened, highly aggressive. They have been blamed for numerous human deaths, and African myths exaggerate their capabilities to legendary proportions. For these reasons, the black mamba is widely considered the world’s deadliest snake."}, {"url": "http://www.venomoussnakes.net/blackmambasnake.htm", "passage_text": "The black mamba snake (Dendroaspis polylepis is the largest and deadliest snake in Africa. Many myths circulate with reference to the black mamba, but most are fictitious. One anecdote is that occasionally it decides to track people down throughout the woods."}, {"url": "http://www.livescience.com/43559-black-mamba.html", "passage_text": "The black mamba has quite a reputation. It is one of the world’s deadliest snakes. It is the fastest land snake in the world, and “the longest species of venomous snake in Africa and the second longest in the world,” said Sara Viernum, a herpetologist based in Madison, Wisconsin."}, {"url": "https://simple.wikipedia.org/wiki/Black_mamba", "passage_text": "The black mamba (Dendroaspis polylepis) belongs to the Elapidae family of snakes. It is the second largest venomous snake in the world. An adult black mamba can grow up to 14 feet (4.3 m) in length. The black mamba's skin is not actually black, it gets its name from the colour of the roof of its mouth. The black mamba lives in the south and the east of Africa. They can be found as far north as Eritrea, and as far west as Namibia, and all throughout South Africa."}, {"url": "http://www.youtube.com/watch?v=HHt0ZiaSXo4", "passage_text": "It has a wide range of known locations throughout Africa. The black mamba is native to Somalia, Ethiopia, Kenya, Botswana, Uganda, Zambia, Zimbabwe, Angola, Namibia, Malawi, Mozambique, South Africa and the Congo. They inhabit a wide variety of areas that include open savannahs, open woodlands, and rocky outcrops."}, {"url": "http://www.pbs.org/wnet/nature/black-mamba-video-full-episode/5348/", "passage_text": "Premiere date: November 7, 2009 | 0:53:10. The black mamba is one of Africa’s most dangerous and feared snakes. Most people would kill it on sight. But in the tiny country of Swaziland, one husband and wife team has taken a different approach to the mamba."}, {"url": "https://en.wikipedia.org/wiki/Black_mamba", "passage_text": "The black mamba (Dendroaspis polylepis) is a venomous snake endemic to sub-Saharan Africa. It takes its common name not from the colour of its scales, but from the interior of its mouth, which is inky-black."}]