[{"url": "http://www.thefreedictionary.com/Autosomal+chromosome", "passage_text": "autosome-any chromosome that is not a sex chromosome; appear in pairs in body cells but as single chromosomes in spermatozoa. somatic chromosome. chromosome-a threadlike strand of DNA in the cell nucleus that carries the genes in a linear order; humans have 22 chromosome pairs plus two sex chromosomes."}, {"url": "http://www.thefreedictionary.com/Autosomal+chromosome", "passage_text": "1. autosome-any chromosome that is not a sex chromosome; appear in pairs in body cells but as single chromosomes in spermatozoa. somatic chromosome. chromosome-a threadlike strand of DNA in the cell nucleus that carries the genes in a linear order; humans have 22 chromosome pairs plus two sex chromosomes. 1  Facebook."}, {"url": "http://www.audioenglish.org/dictionary/autosome.htm", "passage_text": "• AUTOSOME (noun). The noun AUTOSOME has 1 sense: 1. any chromosome that is not a sex chromosome; appear in pairs in body cells but as single chromosomes in spermatozoa. Familiarity information: AUTOSOME used as a noun is very rare."}, {"url": "http://www.isogg.org/wiki/Autosomal_DNA", "passage_text": "English. Autosomal DNA is a term used in genetic genealogy to describe DNA which is inherited from the autosomal chromosomes. An autosome is any of the numbered chromosomes, as opposed to the sex chromosomes. Humans have 22 pairs of autosomes and one pair of sex chromosomes (the X chromosome and the Y chromosome). Autosomes are numbered roughly in relation to their sizes. That is, Chromosome 1 has approximately 2,800 genes, while chromosome 22 has approximately 750 genes."}, {"url": "http://www.ghr.nlm.nih.gov/glossary=autosome", "passage_text": "An autosome is any of the numbered chromosomes, as opposed to the sex chromosomes. Humans have 22 pairs of autosomes and one pair of sex chromosomes (the X and Y). Autosomes are numbered roughly in relation to their sizes. That is, Chromosome 1 has approximately 2,800 genes, while chromosome 22 has approximately 750 genes."}]