[{"url": "http://cdn.intechweb.org/pdfs/21925.pdf", "passage_text": "378 2.4 The Synuclein family in Parkinson disease The SNCA gene is located on chromosome 4q21-22 and is associated with susceptibility to PD and DLB. Alpha-synclein has two paralogous genes, beta- (SNCB; MIM#602569) and gamma-synuclein (SNCG; MIM#602998) with which it shares a highly conserved N-terminal domain. After the detection of SNCA locus triplication, SNCA duplications were also reported in two families from France and Italy (Chartier-Harlin et al., 2004, Ibanez et al., 2004). Chartier-Harlin et al detected one duplication family among nine ADPD."}, {"url": "https://en.wikipedia.org/wiki/Alpha-synuclein", "passage_text": "Alpha-synuclein is a protein that is abundant in the human brain. Smaller amounts are found in the heart, muscles, and other tissues. In the brain, alpha-synuclein is found mainly at the tips of nerve cells (neurons) in specialized structures called presynaptic terminals. Alpha-synuclein is a synuclein protein of unknown function primarily found in neural tissue, making up as much as 1% of all proteins in the cytosol of brain cells. It is predominantly expressed in the neocortex, hippocampus, substantia nigra, thalamus, and cerebellum."}, {"url": "http://www.genecards.org/cgi-bin/carddisp.pl?gene=SNCA", "passage_text": "Alpha-synuclein is a member of the synuclein family, which also includes beta-and gamma-synuclein. Synucleins are abundantly expressed in the brain and alpha-and beta-synuclein inhibit phospholipase D2 selectively. SNCA may serve to integrate presynaptic signaling and membrane trafficking. MGI mutant phenotypes for SNCA: inferred from 6 alleles. 1  reproductive system phenotype. 2  skeleton phenotype. 3  mortality/aging. 4  endocrine/exocrine gland phenotype. 5  cellular phenotype. 6  cardiovascular system phenotype. 7  growth/size/body phenotype. 8  homeostasis/metabolis"}, {"url": "http://www.ncbi.nlm.nih.gov/gene/6622", "passage_text": "Alpha-synuclein is a member of the synuclein family, which also includes beta-and gamma-synuclein. Synucleins are abundantly expressed in the brain and alpha-and beta-synuclein inhibit phospholipase D2 selectively. SNCA may serve to integrate presynaptic signaling and membrane trafficking. 1 This is a review on two human amyloidogenic polypeptides, one associated with Parkinson's disease, alpha-synuclein (alpha-syn), and the other important for melanin synthesis, the repeat domain (RPT) from Pmel17.[Review]. 2  Our results do not support a role for common SNCA genetic variants in risk for essential tremor."}, {"url": "http://ghr.nlm.nih.gov/gene/SNCA", "passage_text": "The SNCA gene provides instructions for making a small protein called alpha-synuclein. Alpha-synuclein is abundant in the brain, and smaller amounts are found in the heart, muscles, and other tissues. Several common variations in the SNCA gene have been found to increase the risk of multiple system atrophy, a progressive brain disorder that affects movement and balance and disrupts the function of the autonomic nervous system."}, {"url": "http://ghr.nlm.nih.gov/gene/SNCA", "passage_text": "Researchers have identified mutations in the SNCA gene that may lead to a loss of intellectual functions (dementia). Two mutations cause a particular disorder known as dementia with Lewy bodies, in which dementia is associated with deposits of Lewy bodies in certain areas of the brain. Several common variations in the SNCA gene have been found to increase the risk of multiple system atrophy, a progressive brain disorder that affects movement and balance and disrupts the function of the autonomic nervous system."}, {"url": "http://ghr.nlm.nih.gov/gene/SNCA", "passage_text": "Parkinson disease-caused by mutations in the SNCA gene. At least 18 mutations in the SNCA gene have been found to cause Parkinson disease, a condition characterized by progressive problems with movement and balance. Several common variations in the SNCA gene have been found to increase the risk of multiple system atrophy, a progressive brain disorder that affects movement and balance and disrupts the function of the autonomic nervous system."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/25554495", "passage_text": "The groundbreaking discovery of mutations in the SNCA gene in a rare familial form of Parkinson's disease (PD) has revolutionized our basic understanding of the etiology of PD and other related disorders. "}, {"url": "http://ghr.nlm.nih.gov/gene/SNCA", "passage_text": "The SNCA gene belongs to a family of genes called PARK (Parkinson disease). A gene family is a group of genes that share important characteristics. Classifying individual genes into families helps researchers describe how genes are related to each other. Several common variations in the SNCA gene have been found to increase the risk of multiple system atrophy, a progressive brain disorder that affects movement and balance and disrupts the function of the autonomic nervous system."}]