[{"url": "http://www2.estrellamountain.edu/faculty/farabee/biobk/BioBooktransp.html", "passage_text": "Water, carbon dioxide, and oxygen are among the few simple molecules that can cross the cell membrane by diffusion (or a type of diffusion known as osmosis). Diffusion is one principle method of movement of substances within cells, as well as the method for essential small molecules to cross the cell membrane. "}, {"url": "https://en.wikipedia.org/wiki/Cell_membrane", "passage_text": "The cell membrane is selectively permeable to ions and organic molecules and controls the movement of substances in and out of cells. The basic function of the cell membrane is to protect the cell from its surroundings. Cell membranes are involved in a variety of cellular processes such as cell adhesion, ion conductivity and cell signalling and serve as the attachment surface for several extracellular structures, including the cell wall, glycocalyx, and intracellular cytoskeleton. Cell membranes can be artificially reassembled."}, {"url": "http://www.cholesterol-and-health.com/Cholesterol-Cell-Membrane.html", "passage_text": "Molecule for molecule, cholesterol can make up nearly half of the cell membrane. 1 Since it is smaller and weighs less than other molecules in the cell membrane, it makes up a lesser proportion of the cell membrane's mass, usually roughly 20 percent. 2. Cholesterol is also present in membranes of organelles inside the cells, although it usually makes up a smaller proportion of the membrane."}, {"url": "http://highered.mheducation.com/sites/9834092339/student_view0/chapter38/diffusion_through_cell_membranes.html", "passage_text": "Many molecules can pass freely across cellular membranes. Small molecules and nonpolar molecules are the ones that can move most easily across the lipid bilayer and enter the cell. Diffusion is the process that causes these molecules to move in or out of the cell. "}, {"url": "http://biology.about.com/od/cellanatomy/ss/cell-membrane.htm", "passage_text": "1 Transport proteins, such as globular proteins, transport molecules across cell membranes through facilitated diffusion. 2  Glycoproteins have a carbohydrate chain attached to them. 3  They are embedded in the cell membrane and help in cell to cell communications and molecule transport across the membrane. 1 The lipid bilayer is semi-permeable, allowing only certain molecules to diffuse across the membrane. 2  Cholesterol is another lipid component of animal cell membranes. 3  Cholesterol molecules are selectively dispersed between membrane phospholipids."}, {"url": "http://www.nature.com/scitable/topicpage/cell-membranes-14052567", "passage_text": "Figure 1: The lipid bilayer and the structure and composition of a glycerophospholipid molecule. (A) The plasma membrane of a cell is a bilayer of glycerophospholipid molecules. (B) A single glycerophospholipid molecule is composed of two major regions: a hydrophilic head (green) and hydrophobic tails (purple). (C) The subregions of a glycerophospholipid molecule; phosphatidylcholine is shown as an example. Enzymes in the membrane can do the same thing they do in the cytoplasm of a cell: transform a molecule into another form. Anchor proteins can physically link intracellular structures with extracellular structures."}, {"url": "http://study.com/academy/lesson/cell-membrane-functions-role-structure.html", "passage_text": "Phospholipids form the basic structure of a cell membrane, called the lipid bilayer. Scattered in the lipid bilayer are cholesterol molecules, which help to keep the membrane fluid consistent. Membrane proteins are important for transporting substances across the cell membrane. Phospholipids make up the basic structure of a cell membrane. A single phospholipid molecule has two different ends: a head and a tail. The head end contains a phosphate group and is hydrophilic. This means that it likes or is attracted to water molecules."}, {"url": "http://www.tiem.utk.edu/~gross/bioed/webmodules/diffusion.htm", "passage_text": "Simple passive diffusion occurs when small molecules pass through the lipid bilayer of a cell membrane. Facilitated diffusion depends on carrier proteins imbedded in the membrane to allow specific substances to pass through, that might not be able to diffuse through the cell membrane. Simple passive diffusion. "}, {"url": "https://en.wikipedia.org/wiki/Lipid_bilayer", "passage_text": "The lipid bilayer is a thin polar membrane made of two layers of lipid molecules. These membranes are flat sheets that form a continuous barrier around all cells. Phospholipids with certain head groups can alter the surface chemistry of a bilayer and can, for example, serve as signals as well as anchors for other molecules in the membranes of cells."}, {"url": "http://biologymad.com/cells/cellmembrane.htm", "passage_text": "Active Transport. Endocytosis and Exocytosis. The Structure of the Cell Membrane The cell membrane (or plasma membrane) surrounds all living cells, and is the cell's most important organelle. It controls how substances can move in and out of the cell and is responsible for many other properties of the cell as well. "}]