[{"url": "http://www.ehow.com/how_8772327_break-down-salary.html", "passage_text": "For example, if you worked eight hours per day and 220 days in the year, your total number of hours worked during the year would be 220 x 8 = 1,760.. Divide your annual salary figure by your total hours worked during the year to obtain an accurate measure of your hourly wage. For example, if your annual salary is $50,000 and your annual hours worked is 1,760, your hourly wage would be calculated as 50,000/1,760 = $28.40.. For example, out of a total of 260 available work days, you may only have worked 240 days or fewer after deducting vacation and holidays. Calculate the number of hours you worked during a 12-month period by multiplying the hours you worked per day by the number of days you worked during the year."}, {"url": "http://smallbusiness.chron.com/calculate-hourly-wages-semi-monthly-pay-period-10044.html", "passage_text": "A semi-monthly paying structure occurs when employees receive paychecks twice each month, often on the 15th and 30th days of each month. Calculate hourly wages from a semi-monthly pay period to break down earnings for your employees. Step 1. Multiply an employee's semi-monthly salary by two to find the employee's monthly salary. Then multiply the employee's monthly salary by 12 to find the annual salary. 1 Calculate overtime earnings, if applicable. 2  Multiply the employee's hourly wage by the overtime pay rate by the overtime hours worked. 3  For example, if the employee earning $23.07 per hour worked eight hours of overtime at time-and-a-half, multiply $23.07 x 1.5 = $34.61 x 8 = $276.84."}, {"url": "http://www.ehow.com/how_8772327_break-down-salary.html", "passage_text": "An annual salary gives you a dollar figure for the entire year but does not break down the amount into an hourly wage. For example, out of a total of 260 available work days, you may only have worked 240 days or fewer after deducting vacation and holidays. Calculate the number of hours you worked during a 12-month period by multiplying the hours you worked per day by the number of days you worked during the year."}, {"url": "http://en.allexperts.com/q/Employment-Law-924/2008/6/Break-salary.htm", "passage_text": "Question. I am being changed from salary exempt to hourly. The way they are breaking it down is: total salary, by 52 weeks, by a 50 hour per week. This decreases my current hourly rate based on 40 hours. However they are only allowing as to work 40 hours and not authorizing the additional 10 per week. This is not correct. It should be broken down by annual salary divided by 2080. If you are working 40 hours x 52 weeks it is 2080 hours per year. Hourly employees are calculated on 40 hour weeks and anything over 40 is overtime."}, {"url": "http://smallbusiness.chron.com/calculate-biweekly-salary-hourly-21255.html", "passage_text": "1 You may calculate biweekly gross by dividing annual salary by the number of days the salary is based on for the year and multiplying the result by 14 days. 2  For example, $52,000/365 days = $142.47 x 14 = $2,000. 3  Gross represents your entire salary before deductions. Divide biweekly gross by the number of days in the pay period to arrive at daily rate. For example, the biweekly gross is $2,000 and you work a standard 40-hour week; the daily rate is $200, the equivalent of $2,000/10 days. Related Reading: How to Calculate Hourly Rates for Bonuses."}, {"url": "http://smallbusiness.chron.com/calculate-biweekly-salary-hourly-21255.html", "passage_text": "Calculate biweekly gross by dividing annual salary by the number of pay periods in the year. A biweekly payroll usually has 26 annual pay periods. For example, if the annual salary is $52,000, the biweekly gross is $2,000. Step 2. Divide biweekly gross by the number of days in the pay period to arrive at daily rate. For example, the biweekly gross is $2,000 and you work a standard 40-hour week; the daily rate is $200, the equivalent of $2,000/10 days. Related Reading: How to Calculate Hourly Rates for Bonuses."}, {"url": "http://www.ehow.com/how_8772327_break-down-salary.html", "passage_text": "Comstock/Comstock/Getty Images. An annual salary gives you a dollar figure for the entire year but does not break down the amount into an hourly wage. This information can be used to arm you for an upcoming job review or to evaluate the merits of a job offer. For example, out of a total of 260 available work days, you may only have worked 240 days or fewer after deducting vacation and holidays. Calculate the number of hours you worked during a 12-month period by multiplying the hours you worked per day by the number of days you worked during the year."}, {"url": "http://www.simplyhired.com/salaries-k-breakdown-jobs.html", "passage_text": "Average Breakdown Salaries. The average salary for breakdown jobs is $57,000. Average breakdown salaries can vary greatly due to company, location, industry, experience and benefits. This salary was calculated using the average salary for all jobs with the term breakdown anywhere in the job listing."}, {"url": "http://www.ehow.com/how_5633540_easily-annual-salary-vice-versa.html", "passage_text": "A job with one week of unpaid leave, for example, will yield the equivalent of 2,040 hours a year while one with two weeks of unpaid leave will yield 2,000 paid hours. If you want to break an annual salary down to an hourly rate, reverse the process. For an hourly position with paid time off, divide the annual salary by 2,080 to get the gross hourly wage. Why 2,080? Most hourly jobs pay you for 2,080 hours of work a year, including paid vacation weeks. That is 52 weeks at 40 hours a week. So $10 an hour will translate into 10 x 2080 = $20,800 a year and $15 an hour will translate into $31,200 a year."}]