[{"url": "http://www.oxforddictionaries.com/definition/english/pizzle", "passage_text": "noun. The penis of an animal, especially a bull, formerly used for flogging people. Example sentences. 1  Each yob has a long stick with a hook on the end, with which they gently and rhythmically rub the bull's pizzles. 2  What she throws at him is a pizzle or penis. 1 Each yob has a long stick with a hook on the end, with which they gently and rhythmically rub the bull's pizzles. 2  What she throws at him is a pizzle or penis. 3  I've never eaten or even seen pizzles before."}, {"url": "http://medical-dictionary.thefreedictionary.com/pizzles", "passage_text": "1. prepuce. 2. penis. pizzle dropping. a farm procedure used in male sheep to reduce local wetting of the wool as a prevention against pizzle rot. The anterior attachment of the prepuce to the abdominal wall is severed. pizzle rot. see enzootic balanoposthitis."}, {"url": "http://www.bullysticks4dogs.com/", "passage_text": "A bully stick, or what it is also called, a beef pizzle, beef stick, pizzle stick, steer stick, is 100% bull penis. Bull penis is the only ingredient of bully sticks. The outcome is a 30-40 inches long hard brown stick which is then cut into pieces appropriate for dogs of all sizes. You can choose small bully sticks of 4'', large beef pizzles of 36'' and any length between."}, {"url": "http://www.doggybakery.org/the-benefits-of-bull-pizzle-treats/", "passage_text": "The transformation of the prized pizzle! Also known as beef stick, steer stick, bull pizzle, bully pizzle and beef pizzle, by any odd name, it is still 100% bull penis. This is the only ingredient in bully sticks. These treats are natural and safe and a rich source of both protein and taurine. Although bull pizzle treats are available from several brands, the typical nutritional value of these products is about the same. In terms of energy, this sticks are incredibly dense offering 9- 29 calories for every inch of meat. Yet, the good part is that almost 80% of the calorific intake comes from protein."}, {"url": "http://www.bullysticks4dogs.com/bully_sticks_made.htm", "passage_text": "The result is a 30-40 inches long very hard brown stick which is cut into pieces suitable for dogs of any size. Thus you can buy small bully sticks of 4'', large beef pizzles of 30 inches and any length between, such as 5'', 6'', 7'', 9'' and 12''. In the beginning of manufacturing process the bull's penis that is usually 23-25 inches long, is removed and cleaned. It is hung vertically for the fluids contained to fully drain. Without these fluids bully sticks are odor free."}, {"url": "https://en.wikipedia.org/wiki/Pizzle", "passage_text": "Pizzle is an old English word for penis, derived from Low German pesel or Flemish Dutch pezel, diminutive of pees, meaning 'sinew'. The word is used today to signify the penis of an animal, chiefly in Australia and New Zealand. See also: Deer penis, tiger penis and tiger penis soup. In addition to being used as a dog treat, pizzles are also eaten by humans for their health benefits such as being low in cholesterol and high in protein, hormones, vitamins and minerals such as calcium and magnesium."}, {"url": "http://misguidedmommy.com/blog/695/bull-pizzle", "passage_text": "Bull Pizzle. My dog is obsessed with these chewy things called bully sticks. One day at a local farmers market I saw some fresh made bully sticks and stopped to buy one. My asshole friend decided to ask me if I knew what they were. "}, {"url": "http://www.bullysticks4dogs.com/", "passage_text": "While processing, the bull's penis that is usually measures around 23-25 inches in length, is removed and cleaned. Manufactures of bully sticks hang the pizzles vertically to allow containing fluids to fully run out. Without these fluids the bully stick is odorless. The outcome is a 30-40 inches long hard brown stick which is then cut into pieces appropriate for dogs of all sizes. You can choose small bully sticks of 4'', large beef pizzles of 36'' and any length between."}, {"url": "http://medical-dictionary.thefreedictionary.com/pizzle", "passage_text": "2. penis. pizzle dropping. a farm procedure used in male sheep to reduce local wetting of the wool as a prevention against pizzle rot. The anterior attachment of the prepuce to the abdominal wall is severed. pizzle rot. 1. prepuce. 2. penis. pizzle dropping. a farm procedure used in male sheep to reduce local wetting of the wool as a prevention against pizzle rot. The anterior attachment of the prepuce to the abdominal wall is severed. pizzle rot. see enzootic balanoposthitis. pizzle stain."}]