[{"url": "http://www.health.ny.gov/environmental/radiological/potassium_iodide/information_for_the_public.htm", "passage_text": "2. Potassium iodide (KI) is a chemical compound that can be used to protect the thyroid gland from possible radiation injury caused by radioactive iodine (radioiodine). Some radiological emergencies may release large amounts of radioiodine to the environment. 1 Use of Potassium Iodide During Radiological Emergencies: Information for the Public is available in Portable Document Format (PDF, 22KB, 2pp.) - Print on legal size paper and fold into pamphlet."}, {"url": "https://en.wikipedia.org/wiki/Calcium_chloride", "passage_text": "The anhydrous form of calcium chloride may also be used for this purpose and can provide a measure of the moisture in concrete. Calcium chloride is used in swimming pool water as a pH buffer and to adjust the calcium hardness of the water. Calcium chloride can serve as a source of calcium ions in an aqueous solution, as calcium chloride is soluble in water. This property can be useful for displacing ions from solution. For example, phosphate is displaced from solution by calcium:"}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-851-POTASSIUM.aspx?activeIngredientId=851&activeIngredientName=POTASSIUM", "passage_text": "Potassium is a mineral that plays many critical roles in the body. Food sources of potassium include fruits (especially dried fruits), cereals, beans, milk, and vegetables. Potassium is used for treating and preventing low potassium levels. It is also used to treat high blood pressure and prevent stroke. "}, {"url": "http://www.chemicalland21.com/industrialchem/inorganic/CALCIUM%20IODIDE.htm", "passage_text": "PubChem Compound Summary-CALCIUM IODIDE. http://www.americanelements.com/ Calcium Iodide is generally immediately available in most volumes. High purity, submicron and nanopowder forms may be considered. Hydrate or anhydrous forms may be purchased. "}, {"url": "http://www.health.ny.gov/environmental/radiological/potassium_iodide/information_for_the_public.htm", "passage_text": "Use of Potassium Iodide During Radiological Emergencies: Information for the Public. 1  Use of Potassium Iodide During Radiological Emergencies: Information for the Public is available in Portable Document Format (PDF, 22KB, 2pp.) - Print on legal size paper and fold into pamphlet. 1 Use of Potassium Iodide During Radiological Emergencies: Information for the Public is available in Portable Document Format (PDF, 22KB, 2pp.) - Print on legal size paper and fold into pamphlet."}, {"url": "http://emergency.cdc.gov/radiation/ki.asp", "passage_text": "KI (potassium iodide) is a salt of stable (not radioactive) iodine that can help block radioactive iodine from being absorbed by the thyroid gland, thus protecting this gland from radiation injury. The thyroid gland is the part of the body that is most sensitive to radioactive iodine. Because KI contains so much stable iodine, the thyroid gland becomes “full” and cannot absorb any more iodine—either stable or radioactive—for the next 24 hours. KI (potassium iodide) may not give a person 100% protection against"}, {"url": "https://en.wikipedia.org/wiki/Calcium_iodide", "passage_text": "Calcium iodide (chemical formula CaI2) is the ionic compound of calcium and iodine. This colourless deliquescent solid is a salt that is highly soluble in water. Its properties are similar to those for related salts, such as calcium chloride. "}]