[{"url": "https://answers.yahoo.com/question/index?qid=20111025225707AAu3BXV", "passage_text": "Report Abuse. It doesn't-calcium carbonate is odourless. If you have a sample of calcium carbonate that smells like bad breath, then it most likely has some contamination in it. Source(s): Professional chemist since 1987. . "}, {"url": "https://en.wikipedia.org/wiki/Calcium_carbonate", "passage_text": "Calcium carbonate is the active ingredient in agricultural lime, and is created when calcium ions in hard water react with carbonate ions creating limescale. It is commonly used medicinally as a calcium supplement or as an antacid, but excessive consumption can be hazardous. Calcium carbonate will react with water that is saturated with carbon dioxide to form the soluble calcium bicarbonate."}, {"url": "http://gicare.com/medication/calcium-carbonate/", "passage_text": "Calcium carbonate is a good antacid but it also provides calcium, which is desirable. Adults need 1500 mg of calcium a day and post menopausal females even more. Unless you drink a quart of milk a day, you likely do not get enough calcium from your food. Following are some facts about antacids: "}, {"url": "https://en.wikipedia.org/wiki/Calcium_carbonate", "passage_text": "Calcium carbonate is a chemical compound with the formula Ca C O 3. It is formed by three main elements: carbon, oxygen and calcium. It is a common substance found in rocks in all parts of the world, and is the main component of shells of marine organisms, snails, coal balls, pearls, and eggshells. Calcium carbonate will react with water that is saturated with carbon dioxide to form the soluble calcium bicarbonate."}, {"url": "http://www.chemicool.com/elements/calcium.html", "passage_text": "People have used calcium’s compounds for thousands of years – in cement, for example. Limestone [calcium carbonate] was called calx by the Romans. The Romans heated calx, driving off carbon dioxide to leave calcium oxide. To make cement, all you have to do is mix calcium oxide with water. The Romans built vast amphitheaters and aqueducts using calcium oxide cement to bond stones together. (1). Despite the long history of calcium’s compounds, the element itself was not discovered until electricity was available for use in experiments. Calcium is used to remove oxygen, sulfur and carbon from alloys. Calcium from limestone is a vital component of Portland cement. Quicklime (CaO) is used in many applications in the chemical industry, such as treatment of drinking water – especially for water softening and arsenic removal, animal waste and wastewater."}, {"url": "http://www.answers.com/Q/What_does_calcium_carbonate_smell_like", "passage_text": "It is odourless. Food colouring that uses calcium carbonate as a filler may be scented, which is probably what you mean. It is the primary constituent of limestone, and freshly-broken limestone can have a distinctive, sharp smell, but that arises from organic compounds within the rock, not from the mineral itself. Ca(OH)2 is calcium hydroxide. CaCO3 is calcium carbonate. The compounds have different chemical properties and chemical formulas."}, {"url": "http://www.answers.com/Q/What_does_calcium_carbonate_smell_like", "passage_text": "No, calcium carbonate (CaCO3) is the calcium salt of carbonic acid (H2CO3). If a compound has the name of a metal in it (sodium, calcium, copper, etc) it is generally not an a … cid but a salt. A salt is formed when a metal ion or other positive ion takes the place of hydrogen in an acid. 2 people found this useful. Ca(OH)2 is calcium hydroxide. CaCO3 is calcium carbonate. The compounds have different chemical properties and chemical formulas."}]