[{"url": "http://sewing.about.com/od/sewingmachineindex/ss/windbobbin.htm", "passage_text": "1 Bobbin thread is a very lightweight thread. 2  Although it is called bobbin thread it is not the thread that is always used in the bobbin. 3  Bobbin thread is a lightweight thread for machine embroidery or machine basting. 4  For normal sewing, use the same thread that you use in the upper threading of the sewing machine. Threading the bobbin of a sewing machine, is not a difficult task if you take the thread through the necessary guides and tension controls so the thread on the bobbin is smoothly and evenly wound on the bobbin when you are finished."}, {"url": "http://sewing.about.com/od/sewingthread/qt/What-Is-Bobbin-Thread.htm", "passage_text": "Bobbin thread is a very lightweight thread. This very thin thread is most commonly used in the bobbin of a sewing machine, but it does have other uses in sewing. Although it is called bobbin thread it is not the thread that is always used in a bobbin. Most sewing will use the same thread in the upper threading and the bobbin of a sewing machine. When bobbin thread is used for machine basting, it is a more delicate thread than your regular sewing thread. It will not over power the fabric in any sense. As with any sewing thread, quality does make a difference."}, {"url": "http://www.ehow.com/how-does_5255358_sewing-machine-bobbin-work.html", "passage_text": "A bobbin is the thread holder that feeds the stitching underneath the fabric on a sewing machine. It can hold either the same color thread as the top stitch or a different color for fancy projects. Drop the bobbin in its holder if the machine has one, or straight into the shuttle, depending on the model. Feed the bobbin thread tip up through the plate and pull out a few inches. Once the machine needle on top has been threaded and proper tension settings are in place, sewing can begin."}, {"url": "http://www.ehow.com/how-does_5255358_sewing-machine-bobbin-work.html", "passage_text": "Pull the thread tip across and through the side of the empty bobbin with about 1/4 to 1/2 inch of thread fed through the bobbin's hole on top. Use a finger to hold the thread tip against the bobbin's top so it won't pull out as the bobbin is put on the receiving spindle. Drop the bobbin in its holder if the machine has one, or straight into the shuttle, depending on the model. Feed the bobbin thread tip up through the plate and pull out a few inches. Once the machine needle on top has been threaded and proper tension settings are in place, sewing can begin."}, {"url": "https://en.wikipedia.org/wiki/Bobbin", "passage_text": "A bobbin is a spindle or cylinder, with or without flanges, on which wire, yarn, thread or film is wound. Bobbins are typically found in sewing machines, cameras, and within electronic equipment. In non-electrical applications the bobbin is used for tidy storage without tangles. Bobbin lacemaking is a handcraft which requires the winding of yarn onto a temporary storage spindle made of wood, previously bone, often turned on a lathe. Many lace designs use dozens of bobbins at any one time. Exotic woods are extremely popular with contemporary lacemakers."}, {"url": "http://www.answers.com/Q/What_does_a_bobbin_winder_do", "passage_text": "A bobbin winder is the part of a sewing machine that takes the thread from a spool of thread and winds it on the bobbin. The sewing machine bobbin is a mini-spool of thread, m … ade of plastic or metal, that holds the thread that will be on the underneath portion of your fabric when you sew. "}, {"url": "http://sewing.about.com/od/sewingthread/qt/What-Is-Bobbin-Thread.htm", "passage_text": "Bobbin thread is a lightweight thread for machine embroidery or machine basting. When bobbin thread is used for machine embroidery, it allows the back of the embroidery design to be much less dense than the front of the design. This is especially helpful when you are embroidering lightweight fabric. When bobbin thread is used for machine basting, it is a more delicate thread than your regular sewing thread. It will not over power the fabric in any sense. As with any sewing thread, quality does make a difference."}, {"url": "http://www.answers.com/Q/What_does_the_bobbin_winder_do_on_a_sewing_machine", "passage_text": "The top thread comes from the spool of thread and the thread on the bottom side of your fabric comes from the bobbin. Instead of winding the thread on the bobbin by hand, long and tedious, the machine will wind it for you if you load it up correctly. Check your owner's manual for instructions. If you don't have a manual, do a google search for it by entering the name of your machine branch and the model # and it will probably find one. A bobbin winder is the part of a sewing machine that takes the thread from a spool of thread and winds it on the bobbin. The sewing machine bobbin is a mini-spool of thread, made of plastic or metal, that holds the thread that will be on the underneath portion of your fabric when you sew"}]