[{"url": "http://www.sanitarium.com.au/health-and-wellbeing/what-functions-do-bones-serve", "passage_text": "Bones serve some vital functions: 1  As a structural framework for tendons to attach to and provide support for soft tissue. 2  To protect internal organs from injury e.g. the ribs protect the heart and lungs. 1 The red bone marrow found in the connective tissue of certain bones is the site of blood cell production. 2  As an energy storage site in children. 3  Triglycerides which are a source of energy are stored in the yellow bone marrow."}, {"url": "http://www.ehow.com/how-does_5444146_structure-function-tendons.html", "passage_text": "Background. Tendons are a type of soft tissue that connects muscle tissue to bone, similar to the ligaments that connect bone to bone. They can be found throughout the body from the legs to the hands. They are composed almost entirely of collagen, a fibrous protein, and are often referred to as a collagenous tissue. "}, {"url": "http://www.rocketswag.com/medicine/anatomy/skeletal-system/What-Does-Tendons-Do-In-The-Skeletal-System.html", "passage_text": "The tendons serve such a similar purpose. By definition, a tendon (which is also known as sinew) is a tough fibrous connective tissue, which is like a band that connects a muscle to a bone. The tendon is built to withstand tension. These are similar to, but not to be confused with ligaments, which connect or join one bone to another. Tendons are an important feature of the skeletal system in the human body. They are very important in the sense that their functions are observed to be very strong, and many of the other parts of the system are dependent on the tendons to make sure that their functions are processed and performed properly."}, {"url": "http://www2.mbusd.org/staff/pware/labs/ChickenWingDissection.pdf", "passage_text": "Strands of tough connective tissue connect the skeletal muscles to bones. These strands of tissue are called tendon s. When a muscle that connects two bones gets shorter, the bones are pulled closer to each other. For example, tendons attach the biceps muscle to a bone in your shoulder and to a bone in your forearm. When the biceps muscle shortens, your forearm bends toward your shoulder."}, {"url": "http://sites.bsyse.wsu.edu/pitts/be120/Handouts/animal%20tssue%20descriptions%20and%20mechanical%20proprties.htm", "passage_text": "Ligaments and tendons are soft collagenous tissues. Ligaments connect bone to bone and tendons connect muscles to bone. Ligaments and tendons play a significant role in musculoskeletal biomechanics. They represent an important area of orthopaedic treatment for which many challenges for repair remain. "}, {"url": "http://www.answers.com/Q/What_is_the_function_of_tendon_sheath", "passage_text": "The function of a tendon is a type of soft tissue that connects muscle tissue to bones just like ligaments that connect two or more bones. The purpose of tendons is to transfe … r force between muscle and bone.This allows the joint movement that allows for everyday activities like walking or reaching. "}, {"url": "http://study.com/academy/lesson/what-is-a-tendon-anatomy-definition-quiz.html", "passage_text": "Let's review. The main function of a tendon is to connect skeletal muscles to bones. Tendons are a type of connective tissue, and the primary building blocks of tendons are collagen fibers. "}, {"url": "https://en.wikipedia.org/wiki/Tendon", "passage_text": "A tendon (or sinew) is a tough band of fibrous connective tissue that usually connects muscle to bone and is capable of withstanding tension. Tendons are similar to ligaments and fasciae; all three are made of collagen. Ligaments join one bone to another bone; fasciae connect muscles to other muscles. Tendons and muscles work together to move bones."}, {"url": "http://www.sanitarium.com.au/health-and-wellbeing/what-functions-do-bones-serve", "passage_text": "1 The tendons from muscles are attached to the skeleton so movement of the muscle results in movement of the bone and hence movement of the body. 2  As a storage depot for many vital minerals the body needs in everyday activities e.g. calcium. 3  To produce blood cells. 1 The red bone marrow found in the connective tissue of certain bones is the site of blood cell production. 2  As an energy storage site in children. 3  Triglycerides which are a source of energy are stored in the yellow bone marrow."}]