[{"url": "http://health.costhelper.com/psa-testing.html", "passage_text": "1 Saint Elizabeth Medical Center, in Lincoln, NE, charges $105 for a PSA test. 2  PSA tests are available for use at home, with blood samples mailed to a lab for analysis. 3  Home PSA tests cost $20-$50, and usually include pre-paid mailers for sending samples to a lab and the cost of the lab work. Increased levels of PSA are possible indications of prostate cancer or of an enlarged prostate. PSA levels higher than 4 ng/ml are generally considered cause for concern. The PSA test is a blood test that determines a man's PSA levels."}, {"url": "http://health.costhelper.com/psa-testing.html", "passage_text": "1 According to Health Care Blue Book, an online health cost estimator, a PSA typically costs $22 for patients without insurance, but might not include the price of an office visit which can cost an additional $25-$100. Increased levels of PSA are possible indications of prostate cancer or of an enlarged prostate. PSA levels higher than 4 ng/ml are generally considered cause for concern. The PSA test is a blood test that determines a man's PSA levels."}, {"url": "http://health.costhelper.com/prostate-cancer.html", "passage_text": "1 For patients covered by health insurance, out-of-pocket costs for a prostate cancer test typically consist of a doctor-visit copay and a laboratory copay of $0-$30 or more, depending on the plan. 2  For routine wellness screenings, some insurance plans consider the tests medically necessary only after a certain age. 1 And it can cost up to $6,000 or more for a prostate biopsy. 2  For example, several cancer centers in Michigan offer prostate exams for $15-$20. 3  Talbert Medical in California, charges about $60. 4  And Robert Gluck, M.D, a urologist in New York, charges $250 for an office visit that includes a digital prostate exam."}, {"url": "http://www.healthtestingcenters.com/psa-test.aspx", "passage_text": "Prostate Test (PSA). An annual PSA blood test is recommended for men beginning at age 50. However, men who are at high risk of prostate cancer should start screening at age 40. Prostate cancer is the most common cancer in men, second only to skin cancer. Prostate-specific antigen (PSA) is a protein produced by cells of the prostate gland. The PSA test measures the level of PSA in the blood. Prostate cancer or benign (non-cancerous) conditions can increase men’s PSA levels. As men age these can become more common."}, {"url": "http://health.costhelper.com/prostate-cancer.html", "passage_text": "Related articles: PSA Test, Blood Tests, Health Insurance. 1  For patients covered by health insurance, out-of-pocket costs for a prostate cancer test typically consist of a doctor-visit copay and a laboratory copay of $0-$30 or more, depending on the plan. 1 And it can cost up to $6,000 or more for a prostate biopsy. 2  For example, several cancer centers in Michigan offer prostate exams for $15-$20. 3  Talbert Medical in California, charges about $60. 4  And Robert Gluck, M.D, a urologist in New York, charges $250 for an office visit that includes a digital prostate exam."}, {"url": "http://health.costhelper.com/psa-testing.html", "passage_text": "1 The cost of an office visit to a physician might be added to the cost of a PSA test. 2  Expect an office visit to cost $25-$100. Increased levels of PSA are possible indications of prostate cancer or of an enlarged prostate. PSA levels higher than 4 ng/ml are generally considered cause for concern. The PSA test is a blood test that determines a man's PSA levels."}, {"url": "http://health.costhelper.com/psa-testing.html", "passage_text": "1 PSA tests are available for use at home, with blood samples mailed to a lab for analysis. 2  Home PSA tests cost $20-$50, and usually include pre-paid mailers for sending samples to a lab and the cost of the lab work. Increased levels of PSA are possible indications of prostate cancer or of an enlarged prostate. PSA levels higher than 4 ng/ml are generally considered cause for concern. The PSA test is a blood test that determines a man's PSA levels."}, {"url": "http://www.homehealthtesting.com/psa-test-p-36.html", "passage_text": "Prostate cancer can be cured-if diagnosed early! The PSA Screening Test combines the convenience of a home sample collection with the accuracy of a certified clinical laboratory determination. The home PSA Screening Test provides you with an accurate, convenient, and cost-effective way to measure your PSA blood level. Since the risk for prostate cancer increases with age, it is recommended that PSA testing be performed annually for all men once they reach 50 years of age. "}, {"url": "http://health.costhelper.com/prostate-cancer.html", "passage_text": "1 For patients not covered by health insurance, a prostate cancer test typically costs from less than $15-$250 for a digital rectal exam to detect any physical abnormalities in the prostate, depending on the provider and whether the exam is done on its own or as part of an office visit. 1 And it can cost up to $6,000 or more for a prostate biopsy. 2  For example, several cancer centers in Michigan offer prostate exams for $15-$20. 3  Talbert Medical in California, charges about $60. 4  And Robert Gluck, M.D, a urologist in New York, charges $250 for an office visit that includes a digital prostate exam."}]