[{"url": "https://en.wikipedia.org/wiki/Golgi_apparatus", "passage_text": "The Golgi apparatus (/ˈɡoʊldʒiː/), also known as the Golgi complex, Golgi body, or simply the Golgi, is an organelle found in most eukaryotic cells. It was identified in 1897 by the Italian physician Camillo Golgi and named after him in 1898.art of the cellular endomembrane system, the Golgi apparatus packages proteins into membrane-bound vesicles inside the cell before the vesicles are sent to their destination."}, {"url": "http://www.merriam-webster.com/dictionary/Golgi%20apparatus", "passage_text": "Golgi apparatus. noun. : a cytoplasmic organelle that consists of a stack of smooth membranous saccules and associated vesicles and that is active in the modification and transport of proteins—called also Golgi complex. Nglish: Translation of Golgi apparatus for Spanish speakers.edical Definition of GOLGI APPARATUS. : a cytoplasmic organelle that consists of a stack of smooth membranous saccules and associated vesicles and that is active in the modification and transport of proteins —called also Golgi complex — see cell illustration. See Golgi apparatus defined for kids. ADVERTISEMENT. Medical Definition of GOLGI APPARATUS"}, {"url": "http://hyperphysics.phy-astr.gsu.edu/hbase/Biology/golgi.html", "passage_text": "Golgi Apparatus. A major organelle in most eukaryotic cells is the structure of membrane-bound sacs called the Golgi apparatus (or Golgi body, Golgi complex, dictyosome). It acts to process and package the macromolecules such as proteins and lipids that are synthesized by the cell. It has been likened to the cell's post office. major function is the modifying, sorting and packaging of proteins for secretion. It is also involved in the transport of lipids around the cell, and the creation of lysosomes. The sacs or folds of the Golgi apparatus are called cisternae."}, {"url": "http://www.kidsbiology.com/biology_basics/cells_tissues_organs/cell_golgi_apparatus_13b.php", "passage_text": "The Golgi Apparatus is responsible for taking the proteins which were created by the ribosomes and making them bigger and better. Think of an assembly line where cars are made. The first worker creates a car frame. The next worker adds an engine, or seats, or other parts."}, {"url": "http://kids.britannica.com/comptons/art-53096/Golgi-complex", "passage_text": "cell: Golgi complex (Student Encyclopedia (Ages 11 and up)). Related Articles: The Golgi complex, or Golgi apparatus, is a membranous structure composed of stacks of thin sacs. Newly made proteins and lipids move from the RER and SER, respectively, to the Golgi complex. The materials are transported inside vesicles formed from the ER membrane. At the Golgi complex, the .."}, {"url": "http://kids.britannica.com/comptons/article-234336/cell", "passage_text": "The Golgi complex, or Golgi apparatus, is a membranous structure composed of stacks of thin sacs. Newly made proteins and lipids move from the RER and SER, respectively, to the Golgi complex. The Golgi complex, or Golgi apparatus, is a membranous structure composed of stacks of thin sacs. Newly made proteins and lipids move from the RER and SER, respectively, to the Golgi complex. The materials are transported inside vesicles formed from the ER membrane."}, {"url": "http://micro.magnet.fsu.edu/cells/golgi/golgiapparatus.html", "passage_text": "The Golgi Apparatus. The Golgi apparatus (GA), also called Golgi body or Golgi complex and found universally in both plant and animal cells, is typically comprised of a series of five to eight cup-shaped, membrane-covered sacs called cisternae that look something like a stack of deflated balloons.he Golgi apparatus is often considered the distribution and shipping department for the cell's chemical products. It modifies proteins and lipids (fats) that have been built in the endoplasmic reticulum and prepares them for export outside of the cell or for transport to other locations in the cell."}]