[{"url": "http://www.answers.com/Q/What_are_the_similarities_between_arteries_and_capillaries_and_veins", "passage_text": "Ariteries carry blood away from the heart. Veins carry blood back to the heart, also they have valves to prevent backflow of blood capillaries are the smallest of the blood ve … ssels that connect small arteries and small veins. 2 people found this useful. Structural similarities between artries and veins are 1) The walls of arteries and veins both contain collagen which makes them strong and durable. 2) They both contain elasti … c fibres which allow them to stretch and recoil."}, {"url": "http://www.answers.com/Q/What_are_the_similarities_between_arteries_and_capillaries_and_veins", "passage_text": "Arteries-carry blood away from the heart. (I like to think Arteries Away.) Veins-carry blood to the heart. Capillaries-connect veins and arteries. Arteries are the tubes o … r vessles which carry the blood away from the heart once the blood has been oxygenated by the lungs. Structural similarities between artries and veins are 1) The walls of arteries and veins both contain collagen which makes them strong and durable. 2) They both contain elasti … c fibres which allow them to stretch and recoil."}, {"url": "https://ca.answers.yahoo.com/question/index?qid=20091202191859AAe5llR", "passage_text": "Answers. Best Answer: Arteries carry oxygenated blood from the heart to the body. Veins collect oxygen-depleted blood from the body and bring it back to the heart and lungs. Capillaries are the smallest vessels. Blood flows from small arteries to capillaries to small veins. All exchange of nutrients occurs in-between capillaries & tissues. Veins & artieries just carry blood--nutrients do not enter or leave veins & arteries. Physically, arteries have thick muscular wal"}, {"url": "https://answers.yahoo.com/question/index?qid=20061211154354AAZEC9A", "passage_text": "All three are types of blood vessels. Arteries carry freshly-oxygenated blood away from the heart and supply it to organs and other parts of the body that need oxygen. Veins carry oxygen-depleted blood back to the heart. Capillaries are tiny blood vessels that branch off from arteries and veins, and that most closely interact with tissue to supply oxygen to them (or carry oxygen-depleted blood away from them). Mark H · 9 years ago."}, {"url": "http://education.seattlepi.com/structural-differences-between-veins-lymph-vessels-5193.html", "passage_text": "Veins are part of the closed circulatory system that takes deoxygenated blood from capillaries in tissues to venules, veins, the heart and then the lungs, where the blood is resupplied with oxygen and transferred to arteries, arterioles and then capillaries. "}, {"url": "http://www.answers.com/Q/What_are_the_similarities_between_arteries_and_capillaries_and_veins", "passage_text": "Veins carry blood back to the heart, also they have valves to prevent backflow of blood capillaries are the smallest of the blood ve … ssels that connect small arteries and small veins. Structural similarities between artries and veins are 1) The walls of arteries and veins both contain collagen which makes them strong and durable. 2) They both contain elasti … c fibres which allow them to stretch and recoil."}, {"url": "http://www.diffen.com/difference/Arteries_vs_Veins", "passage_text": "There are two types of blood vessels in the circulatory system of the body: arteries that carry oxygenated blood from the heart to various parts of the body and veins that carry blood towards the heart for purification. "}, {"url": "http://www.differencebetween.net/science/health/difference-between-veins-and-arteries/", "passage_text": "Veins and arteries are both types of blood vessels but arteries carry blood away from the heart to the rest of the body while veins carry blood to the heart from the rest of the body. All arteries except the pulmonary and umbilical arteries carry oxygenated blood while all veins carry deoxygenated blood. "}, {"url": "http://www.bbc.co.uk/bitesize/standard/biology/the_body_in_action/the_need_for_energy/revision/7/", "passage_text": "There are three main types of blood vessels: 1  arteries take blood away from the heart to the body organs and tissues. 2  capillaries are tiny, thin-walled vessels which form a network to take blood through the organsand tissues. 3  veins collect blood from the capillaries in the body and return the blood to the heart. 1 arteries take blood away from the heart to the body organs and tissues. 2  The artery wall is thick and muscular so it can withstand the high pressure of the blood being pumped directly from the heart. 3"}, {"url": "http://www.brighthubeducation.com/science-homework-help/123202-about-the-circulatory-system-arteries-veins-and-capillaries/", "passage_text": "The Circulatory System. Veins, arteries and capillaries are the three types of blood vessels in the circulatory system. The blood vessels carry blood, which contains antibodies, nutrients, oxygen, electrolytes and hormones, throughout the body to be used by the organs. Blood contains oxygen and nutrients the body needs to survive. The arteries, veins and capillaries are types of blood vessels that transport the vital blood throughout the body. Learn the differences between the types of blood vessels."}]