[{"url": "http://www.money.co.uk/guides/can-you-switch-mobile-contracts-mid-term.htm", "passage_text": "you're not happy with the level of signal or customer service. If you use a pay-as-you-go service then it is quite simple to switch as you are not tied into any agreement. However, if you have signed a contract with your mobile provider, you will find it a little trickier to get out of your contract early. If you want to cancel your contract mid-term, the first thing to do is contact your service provider and suss them out to see what their policy is on ending a"}, {"url": "http://ee.co.uk/help/accounts-billing-and-topping-up/upgrades/upgrading-your-pay-monthly-phone", "passage_text": "As an Orange plan holder you can easily find out if you’re eligible for an upgrade-all you need to do is log in to your account to check. You can also text UP to 150 to check your upgrade status. Note: You can upgrade to a new phone and plan if you’ve got less than 45 days to go until your contract renewal date. If your account has an outstanding debt on your phone plan you will not be eligible for an upgrade until the outstanding amount is settled"}, {"url": "http://eecomplaints.co.uk/how-to-leave-ee", "passage_text": "Simply DO NOT renew your contract with EE, T-Mobile UK or Orange UK and SHARE IT with others. 2. IF NO SERVICE AT HOME OR BUSINESS PREMISES. If you are locked into a shambolic EE, T-Mobile UK or Orange UK contract then you can get out by proving you have NO SERVICE available at your HOME or your BUSINESS premises. how to leave ee. So you have had enough of the dreadful services you receive from EE, T-Mobile UK or Orange UK and want to know how to leave them. Then your answer simply depends on whether or not you can make FULL USE of ALL THE SERVICES you paid to EE, T-Mobile UK or Orange UK without any major problems."}, {"url": "http://selfhelp.carphonewarehouse.com/SelfHelp/request.do?view()=c{d2b67a80-e650-11de-da00-000000000000}", "passage_text": "30 days before your contract end date. If you want to upgrade early and move to a different network to the one you're currently on, you're required to pay off the remainder of your current contract (what you agreed to pay each month, multiplied by how long you have left on it). Call 0800 049 6248^ for more information."}, {"url": "http://www.thisismoney.co.uk/money/bills/article-2556572/Your-rights-How-mobile-broadband-contracts.html", "passage_text": "If you have signed up to a contract which also includes an expensive bit of kit, such as a mobile phone contract with a top-of-the range smartphone, you might have to give this back, or you may be able to negotiate with your provider to buy it out. "}, {"url": "http://ee.co.uk/help/accounts-billing-and-topping-up/upgrades/upgrading-your-pay-monthly-phone", "passage_text": "You are not able to move to another price plan with a lower contract value during your contract. As a T-Mobile plan holder you can easily find out if you’re eligible for an upgrade. All you need to do is login to your account or text ‘UP’ to 150. You can also text UP to 150 to check your upgrade status. Note: You can upgrade to a new phone and plan if you’ve got less than 45 days to go until your contract renewal date."}, {"url": "https://business.carphonewarehouse.com/upgrades", "passage_text": "You get a new 24 month contract with your existing term ‘written-off’. However, the best advice is to delay the upgrade as long as possible so as to get the maximum contribution towards your new phone. Orange. From 2 nd March 2015 EE will no longer be offering Orange and T-Mobile plans. O2. O2 lines can be upgraded from month 18 and onwards (as long as they were bought through Carphone Warehouse Business). If you upgrade early you can get a new 24 month contract with your existing term ‘written-off’. However, the best advice is to delay the upgrade as long as possible so as to get the maximum contribution towards your new phone or flexible tech fund"}]