[{"url": "http://inspectapedia.com/septic/Septic_Drainfield_Size.php", "passage_text": "1 Septic drainfield trench spacing: The trenches are dug about 6 feet apart on center (center of pipe to center of next pipe) which allows, in good design, space for a set of replacement trenches to be placed between the original ones when the first set fails. 1 Septic drainfield gravel specification: typically, washed gravel, 3/4 to 2 1/2 (pretty big) gravel is placed for a depth of 12 under the drain line piping (septic drain tile in some references)."}, {"url": "http://inspectapedia.com/septic/Septic_Drainfield_Size.php", "passage_text": "1 Septic drainfield trench length: The maximum length of a trench is typically about 150 feet but we have found installations that were three times that length. 2  Some writers opine that the maximum septic trench line is 100 feet. 3  A realistic answer is, it depends-on site and soil conditions. 1 Septic drainfield gravel specification: typically, washed gravel, 3/4 to 2 1/2 (pretty big) gravel is placed for a depth of 12 under the drain line piping (septic drain tile in some references)."}, {"url": "http://inspectapedia.com/septic/Septic_Drainfield_Size.php", "passage_text": "The field is a series of trenches that may be up to 100-feet long and 1 foot to 3 feet in width, separated by six feet or more, depending on local requirements, and sometimes constructed leaving space between the original lines to install replacement leach lines when needed. - paraphrasing USDA. 1 Septic drainfield gravel specification: typically, washed gravel, 3/4 to 2 1/2 (pretty big) gravel is placed for a depth of 12 under the drain line piping (septic drain tile in some references)."}, {"url": "http://www.inspectapedia.com/septic/Septic_Tank_Depth.php", "passage_text": "1 the depth of soil backfill over the septic tank lid or septic tank riser lid, ranging from 0 (which means you should see it) to just a few inches (which means grass may be dead in this area) to 6-12 or even more. 1 and (plus). 2 "}, {"url": "http://home.howstuffworks.com/home-improvement/plumbing/sewer2.htm", "passage_text": "The following diagram shows an overhead view of a house, septic tank, distribution box and drain field: A typical drain field pipe is 4 inches (10 centimeters) in diameter and is buried in a trench that is 4 to 6 feet (about 1.5 m) deep and 2 feet (0.6 m) wide. The size of the drain field is determined by how well the ground absorbs water. In places where the ground is hard clay that absorbs water very slowly, the drain field has to be much bigger. A septic system is normally powered by nothing but gravity."}, {"url": "http://septic-system.securewwm.com/drainfield.htm", "passage_text": "Trench: Drain field trenches effectively treat liquid flowing from the septic tank. A drainfield trench is generally 18 to 36 inches wide and up to 100 feet long. The trench contains a perforated pipe in a bed of 3/4-inch to 2-inch diameter rock covered by natural or synthetic permeable fibers."}, {"url": "http://www.ehow.com/info_8575065_deep-should-septic-leach-field.html", "passage_text": "Designing a leach field involves spacing the perforated pipe for proper drainage. Trenches for the pipes contain gravel and may be as long as 100 feet. Each trench is 1-3 feet wide with 6 feet between each trench. Place the pipes in the leach field a minimum of 6 inches and most likely between 18 to 36 inches deep according to the Clemson Cooperative Extension. Each leach field requires an individual design as soil and water tables vary from state to state and within states"}, {"url": "http://www.clemson.edu/extension/hgic/plants/other/landscaping/hgic1726.html", "passage_text": "A typical septic drain field (see Figure 1), also known as a leach field, is a series of perforated pipes that are set in trenches and buried with aggregates (½- to 2½-inch gravel or ½- to 4-inch rubber chips) and soil. These drain lines are at a minimum depth of 6 inches and are typically 18 to 36 inches wide. The individual drain lines will usually be 8½ to 10 feet apart (see Figure 2). It is important to note here that each drain field system will vary from the next. "}, {"url": "http://www.ehow.com/how_5039124_build-septic-drain-field.html", "passage_text": "A drain field should not be placed in an area that has poor drainage. A septic drain field should be 10 feet from the home or any body of water, and 10 feet from gardens and edible plants. Dig the trenches. Each drain-field trench should be at least 3 to 4 feet wide and 3 to 4 feet deep. There should be at least 100 feet of drain field for a 1,000-gallon septic tank. This can be accomplished by making four trenches 25 feet long or two trenches 50 feet long"}]