[{"url": "http://definitions.uslegal.com/r/retainer/", "passage_text": "Retainer Law & Legal Definition. A retainer fee is the fee which detains an attorney for legal counsel. With this fee, the attorney is certain of the seriousness of your intentions and can take your case to heart. A retainer fee may be used to guarantee that a lawyer will be available to take a particular case and could mean that the lawyer would have to turn down other cases in order to remain available. A case retainer is a nonrefundable fee that a client pays to a law office as an inducement for legal work to be performed for the client. What this really means is that the client is offering additional money to entice the attorney to take the case."}, {"url": "http://legal-dictionary.thefreedictionary.com/Retainer", "passage_text": "n. the advance payment to an attorney for services to be performed, intended to insure that the lawyer will represent the client and that the lawyer will be paid at least that amount. Commonly in matters which will involve extensive work there will be a retainer agreement signed by the attorney and client. A right to retainer refers to the authority by which the executor or administrator of the estate of a deceased person reserves out of the assets an amount sufficient to pay any debt due to him from the deceased in priority to the other creditors whose debts are of equal degree."}, {"url": "http://www.legalmatch.com/law-library/article/what-is-a-retainer-fee.html", "passage_text": "A retainer fee is an advance payment that a client makes to his or her lawyer before the lawyer begins working on the case. It is similar to a down payment and allows the lawyer to draw funds for various fees as the case proceeds. "}, {"url": "http://biztaxlaw.about.com/od/glossaryr/g/retainer_retain.htm", "passage_text": "Definition: A retainer is a fee paid to an attorney or other professional in advance, for services. Often, retainers are paid monthly, based on an estimate of the amount of work to be done for the client each month. A retainer might work like this: You would pay your attorney $500 a month for legal services during that month."}, {"url": "https://www.law.cornell.edu/wex/retainer", "passage_text": "Definition. A fee that the client pays upfront to an attorney before the attorney has begun work for the client. There are three types of retainers, each with a different purpose: (1) A general retainer, which is a fee for a specific period of time rather than for a specific project. (3) A special retainer, which is a flat fee that the client pays for a specific case or project. Many states prohibit this form of retainer because it may prevent the client from discharging the attorney at any time during the representation."}, {"url": "http://www.investopedia.com/terms/r/retainer-fee.asp", "passage_text": "DEFINITION of 'Retainer Fee'. An upfront cost incurred by an individual in order to ensure the services of a consultant, freelancer, etc. A retainer fee is paid most commonly to individual third-parties who have been engaged by the payer to perform a service for them or on their behalf. These fees are almost always paid upfront and only ensure the commitment of the receiver, but does not guarantee an outcome or final product. Estate Planning. The most common form of retainer fees apply to lawyers, who in most cases require those seeking services to provide an upfront retainer fee, for example $500."}, {"url": "https://en.wikipedia.org/wiki/Retainer_agreement", "passage_text": "A retainer agreement is a work for hire contract. It falls between a one-time contract and full-time employment. Its distinguishing feature is that the employer pays in advance for work to be specified later. Additional contracts regarding the performance of this work may also apply. "}, {"url": "http://legal-dictionary.thefreedictionary.com/Retainer", "passage_text": "Retainer. A contract between attorney and client specifying the nature of the services to be rendered and the cost of the services. A right to retainer refers to the authority by which the executor or administrator of the estate of a deceased person reserves out of the assets an amount sufficient to pay any debt due to him from the deceased in priority to the other creditors whose debts are of equal degree."}]