[{"url": "http://www.herbs2000.com/homeopathy/opium.htm", "passage_text": "As aforementioned, the homeopathic medication opium was personally proved by the founder of this alternative stream of medicine Dr. Hahnemann way back in 1805. It is also interesting to note that the homeopathic remedy is administered to patients who may be demonstrating one of the two specific conditions or both."}, {"url": "http://www.homeremedycentral.com/en/homeopathic-remedies/homeopathy/opium.html", "passage_text": "Turning to opium as a homeopathic remedy may provide relief and therefore it is highly recommended as a homeopathic remedy for this condition. Constipation is usually associated with digestive disorders and opium can be of help with any related issues."}, {"url": "http://www.abchomeopathy.com/r.php/Op", "passage_text": "The following are the strongest indications of Opium for its use in homeopathy. Entries on a white background are from Boericke's Materia Medica, other entries are from a reversed Kent's repertory. Homeopathic remedies are not the same as herbal remedies."}, {"url": "http://www.herbs2000.com/homeopathy/opium.htm", "passage_text": "Considering that this homeopathic medication is prepared from a plant that is known to be a plant of extremes, opium is also likely to possess the attributes that may facilitate treating patients who may be suffering from any type of physical or mental health problems on any ends of the gamut of health problems."}, {"url": "http://www.opium.org/natural-opiates.html", "passage_text": "1 Opium. 2  Opium is one of the chief natural opiates. 3  It is still used commonly to this day, mostly as a recreational drug. 4  Throughout history, it was used as an anesthesia and remedy for nervous disorders, cancers, migraines, and all manner of things."}, {"url": "http://www.homeremedycentral.com/en/homeopathic-remedies/homeopathy/opium.html", "passage_text": "The opium poppy plant produces the seeds that form the basis of this homeopathic remedy. As with any other type of remedy in this realm, it is boiled down to a negligible amount and therefore poses no threat of potential addiction or any other health condition associated with the raw form."}, {"url": "http://www.herbs2000.com/homeopathy/opium.htm", "passage_text": "The opium poppy plants, whose seeds form the basis of the homeopathic remedy opium, are extensively cultivated all over Asia, Europe, North America and South America for their beautiful flowers. Besides growing this plant for its ornamental flowers, opium poppy plants are also cultivated for medicinal purposes."}, {"url": "http://www.homeremedycentral.com/en/homeopathic-remedies/homeopathy/opium.html", "passage_text": "Opium may be a very helpful homeopathic remedy to turn to in times of shock. In addition it also offers relief if a great injury is suffered within the body. Therefore, not only does it help with mental health issues, it also helps an individual cope with the emotions and reaction suffered from a state of shock."}, {"url": "http://www.herbs2000.com/homeopathy/opium.htm", "passage_text": "Papaver somniferum. The homeopathic remedy opium is prepared with the poppy or opium seeds and the effectiveness as well as the safety of this medication was substantiated by Dr. Samuel Hahnemann, the founder of the alternative stream of medicine known as homeopathy."}, {"url": "http://www.everydayhealth.com/drugs/opium", "passage_text": "Opium preparation is an opioid. An opioid is sometimes called a narcotic. Opium is derived from the seed pod of a poppy plant. It works by increasing smooth muscle tone and decreasing fluid secretions in the intestines. This slows the movement of bowel matter through"}]