[{"url": "http://jobsearch.about.com/od/coverlettersamples/a/coverrange.htm", "passage_text": "By Alison Doyle. Here is an example of a cover letter that lists salary requirements for a job. Also see below for more cover letter samples, and tips for emailing a cover letter and resume. Sample Cover Letter With a Salary Requirement / Range Listed. Your Name. Your Address."}, {"url": "http://www.popsugar.com/smart-living/How-Respond-When-Asked-Salary-Requirements-1745457", "passage_text": "You don't have a salary history to divulge, so you really are at a jumping-off point, and your salary will be based not only on what is a fair number but also on the other benefits offered. If asked for your requirements in a cover letter, write, My salary requirements are negotiable.."}, {"url": "http://jobsearch.about.com/od/coverlettersamples/a/coverrange.htm", "passage_text": "Include your contact information in your email signature, and don't list the employer contact information. Start your email message with the salutation. Here's an example of a formatted email cover letter. 1  How to Send an Email Cover Letter. 2  How to Apply for Jobs via Email. 3  Salutation Examples."}, {"url": "http://www.salisbury.edu/careerservices/Students/CoverLetters/Salary/default.html", "passage_text": "Salary requirements can be included in your cover letter with sentences such as My salary requirement is negotiable based upon the job responsibilities and the total compensation package. or My salary requirement is in the $25,000 - $35,000+ range.."}, {"url": "http://www.salisbury.edu/careerservices/Students/CoverLetters/Salary/default.html", "passage_text": "1 One option is to state that your salary requirements are negotiable based upon the position and the overall total compensation package, including benefits. 2  Another alternative is to include a range, based on the salary research you've done, i.e. my salary requirement is in the $30,000 - $40,000 range."}, {"url": "http://work.chron.com/write-salary-requirements-job-application-3380.html", "passage_text": "Step 2. Write either negotiable or open in the salary requirements box if you don't want to list a specific salary range. Avoiding the question is preferable, because once you give a salary range, the employer knows what type of salary you are expecting."}, {"url": "http://jobsearch.about.com/od/coverlettersamples/a/coverrange.htm", "passage_text": "My salary requirement is in the $70,000 - $80,000 range. Thank you for your consideration. Signature (hard copy letter). FirstName LastName. Sending an Email Cover Letter. If you're sending your cover letter via email, list your name and the job title in the subject line of the email message."}, {"url": "http://jobsearch.about.com/cs/salarywages/a/salaryrequire.htm", "passage_text": "One option is to state that your salary requirements are negotiable based upon the position and the overall total compensation package, including benefits. Another alternative is to include a range, based on the salary research you've done, i.e. my salary requirement is in the $35,000 - $45,000 range. Either way, note that your salary requirements are flexible."}]