[{"url": "http://www.hepatitis.va.gov/patient/hbv/vaccine-how-given.asp", "passage_text": "Babies born to mothers who are not infected with the hepatitis B virus should get the first shot within 1 to 2 months after birth, the second shot a month later, and the third shot 5 months after the second. You will NOT get hepatitis B from the vaccine. You will be protected for about 13 years. The combination vaccine is given as 3 injections over a 6-month period--an initial dose, followed by a second dose 1 month later, and a third dose"}, {"url": "https://en.wikipedia.org/wiki/Hepatitis_B_vaccine", "passage_text": "Hepatitis B vaccine is a vaccine for the prevention of hepatitis B, an infection caused by the hepatitis B virus (HBV) . The vaccine contains one of the viral envelope proteins, hepatitis B surface antigen (HBsAg). It is produced by yeast cells, into which the genetic code for HBsAg has been inserted. A course of two to three (2–3) vaccine injections is given, the second injection at least one month after the first dose and the third injection being administered six months after the first dose. The first and second dose offer complete protection."}, {"url": "http://www.hepatitis.va.gov/patient/hbv/vaccine-how-given.asp", "passage_text": "The vaccination for hepatitis B is given as 3 injections over a 6-month period--an initial dose, followed by a second dose 1 month later, and a third dose 5 months after the second. If you need hepatitis A vaccination in addition to hepatitis B, you can do these individually or as a combined vaccine that covers both. The combination vaccine is given as 3 injections over a 6-month period--an initial dose, followed by a second dose 1 month later, and a third dose 5 months after the second."}, {"url": "http://www.webmd.com/hepatitis/combination-vaccine-for-hepatitis-a-and-b", "passage_text": "Twinrix is a vaccine that provides active immunity against both the hepatitis A and hepatitis B viruses. It is given in a series of 3 injections on the same schedule as the hepatitis B vaccine: an initial dose followed by doses at 1 month and 6 months. It can also be given in 4 doses, with the initial dose followed by doses at 7 days, 21 to 30 days, and 12 months. How Well It Works. In clinical trials, 1 month after the last dose, 100% of people were immune to hepatitis A, while 99.7% were immune to hepatitis B. But in practice, immunity may not approach these levels. Hepatitis B vaccine usually does not provide immunity for more than 95% to 97% of people."}, {"url": "http://www.rxlist.com/engerix-b-drug/indications-dosage.htm", "passage_text": "Booster Vaccinations. Whenever administration of a booster dose is appropriate, the dose of ENGERIX-B is 0.5 mL for children 10 years of age and younger and 1 mL for persons 11 years of age and older. Studies have demonstrated a substantial increase in antibody titers after booster vaccination with ENGERIX-B. "}, {"url": "http://immunize.org/catg.d/p4110.pdf", "passage_text": "How many doses of hepatitis B vaccine will my baby receive? The basic series is 3 or 4 doses. The first dose should be given in the hospital (at birth), the second dose 1–2 months later, and the third dose at age 6 months or later. "}, {"url": "http://www.immunize.org/catg.d/p2081.pdf", "passage_text": "Note: For adult dialysis patients, the Engerix-B dose required is 40 µg/2.0 mL (use the adult 20 µg/1.0 mL formu-lation) on a schedule of 0, 1, 2, and 6 months. For Recombivax HB, a special formulation for dialysis patients is available. The dose is 40 µg/1.0 mL and it is given on a schedule of 0, 1, and 6 months.*Birth dose administered prior to discharge from the newborn nursery. † The schedule for administering hepatitis B vaccine is flexible and can vary"}, {"url": "http://www.cdc.gov/vaccines/hcp/vis/vis-statements/hep-b.html", "passage_text": "Adults getting hepatitis B vaccine should get 3 doses — with the second dose given 4 weeks after the first and the third dose 5 months after the second. Your doctor can tell you about other dosing schedules that might be used in certain circumstances. Top of Page. Some babies might get 4 doses, for example, if a combination vaccine containing hepatitis B is used. (This is a single shot containing several vaccines.) The extra dose is not harmful. 1  Anyone through 18 years of age who didn't get the vaccine when they were younger should also be vaccinated"}]