[{"url": "https://www.facebook.com/grootdrak", "passage_text": "Groot Drak played host to Hawks of Harrogate yesterday and for the first time this season we played on the oldest Turf Wicket strip in South Africa. The game was played in great friendly cricket spirit, The Hawks scored 139 in 35 overs-Groot Drak managed to chase down the score successfully in the 28th over. Double Wicket: this was one of the most competitive Double Wickets to date at Groot Drak! We even saw a match were -3 runs were defended. Paul Thawaites and Erickjan Hennin played the most consistent cricket winning 3 out of their 4 matches. The final came to a 2 ball thriller that was won by…."}, {"url": "http://www.sa-venues.com/attractionswc/groot-drakenstein.php", "passage_text": "You can visit the Groot Drakenstein Cultural Centre near the town of Simondium between Franschhoek and Paarl. It used to be a jail, but this does not deter groups from using it as a venue for workshops and programmes as it is particularly pretty, offers wonderful views, and can sleep over one hundred people. SA-Venues.com has been assisting travellers with their South Africa travel plans since 1999, and is the largest online travel guide for South Africa available in both English and German. SA-Venues.com © 1999-2015."}, {"url": "https://www.westerncape.gov.za/facility/cultural-centre-groot-drakenstein", "passage_text": "Groot Drakenstein Cultural Centre near Simondium is situated in the Berg River Valley between Franschoek and Paarl. The cultural centre is housed in an abandoned correctional facility. Various structural and other modifications over recent years have turned this former prison into a much more user-friendly facility. It is an ideal facility especially for winter time as the whole facility is protected against the elements. Almost all these facilities offer conference and accommodation facilities. Bookings are for groups of 40 (forty) or more and a deposit is applicable. Weekend bookings are for Fridays from 16:00 to Sunday at 14:00. The facilities are not available for only a part of the weekend, including Fridays."}, {"url": "http://grootdrak.co.za/index.html", "passage_text": "The Groot Drakenstein Games Club is a social club, whose aims and objectives are to promote the interest of sport and the spirit of true sportsmanship in the district of Groot Drakenstein. The beginnings of the club as we know it today. This piece of ground was leased to GDGC by H.E.V. Pickstone for the princely sum of 10 shillings per year for 50 years with an option to renew the lease at the end of the 50 years."}, {"url": "http://grootdrak.co.za/index.html", "passage_text": "Situated in the picturesque Groot Drakenstein Valley, on the R 45 between Paarl and Franschhoek it is surrounded by farmlands, with views from the club grounds extendimg over the orchards and vineyards to the majestic Groot Drakenstein mountain range, the Simonsberg mountain and the Wemmershoek mountain range. The beginnings of the club as we know it today. This piece of ground was leased to GDGC by H.E.V. Pickstone for the princely sum of 10 shillings per year for 50 years with an option to renew the lease at the end of the 50 years."}, {"url": "https://www.facebook.com/grootdrak", "passage_text": "On Wednesday 25 March 2015 Groot Drak had the pleasure of hosting CBC (from Australia) in the second official Golden Oldies 2015 game. After a pitch inspection the visiting team Skipper, Graham Doust, agreed to uphold the Groot Drak tradition and agreed to bat first on a well prepared pitch. Double Wicket: this was one of the most competitive Double Wickets to date at Groot Drak! We even saw a match were -3 runs were defended. Paul Thawaites and Erickjan Hennin played the most consistent cricket winning 3 out of their 4 matches. The final came to a 2 ball thriller that was won by…."}, {"url": "https://en.wikipedia.org/wiki/Drakenstein_Correctional_Centre", "passage_text": "From Wikipedia, the free encyclopedia. Drakenstein Correctional Centre (formerly Victor Verster Prison) is a low-security prison between Paarl and Franschhoek, on the R301 road 5 km from the R45 Huguenot Road, in the valley of the Dwars River in the Western Cape of South Africa. From there, Mandela was moved to the then Victor Verster Prison on 9 December 1988, where he lived in a private house inside the prison compound. Victor Verster, a farm prison, was often used as a stepping stone for releasing lower-risk political prisoners."}, {"url": "http://www.sa-venues.com/attractionswc/groot-drakenstein.php", "passage_text": "Some great historic Cape Dutch homesteads lie in this valley, including wine estates like Boschendal, Bien Donne, Meerlust, Solms-Delta and L'Ormarins. Essentially it describes a district that lies in the shadow of the Groot Drakenstein mountains. SA-Venues.com has been assisting travellers with their South Africa travel plans since 1999, and is the largest online travel guide for South Africa available in both English and German. SA-Venues.com © 1999-2015."}, {"url": "http://www.sa-venues.com/attractionswc/groot-drakenstein.php", "passage_text": "Western Cape Destinations Groot Drakenstein, Cape Winelands. The valley known as the Groot Drakenstein lies in the shadow of the mountains with the same name, on the back side of the Hottentots Holland Mountains, part way between Franschhoek and Paarl. SA-Venues.com has been assisting travellers with their South Africa travel plans since 1999, and is the largest online travel guide for South Africa available in both English and German. SA-Venues.com © 1999-2015."}, {"url": "https://en.wikipedia.org/wiki/Drakenstein", "passage_text": "The former located just to the east of Paarl being punctuated by the Huguenot Tunnel on the N1 highway and Du Toitskloof Pass (820m) as the R101 route. The latter is much taller and is located south of Franschhoek and Stellenbosch, with Victoria Peak (1590m) as its highest point. "}]