[{"url": "https://en.wikipedia.org/wiki/Fennec_fox", "passage_text": "Its name comes from the Arabic word فنك (fanak), which means fox, and the species name zerda comes from the Greek word xeros which means dry, referring to the fox's habitat. The fennec is the smallest species of canid in the world. Physically, the fennec lacks the musk glands of other fox species, and has only 32 chromosome pairs, while other fox species have between 35 and 39. The species also displays behaviors uncharacteristic of foxes, such as living in packs while most other fox species are solitary."}, {"url": "http://a-z-animals.com/animals/fennec-fox/", "passage_text": "The fennec fox is a small species of canine found in the dry, sandy regions of the African Sahara Desert. The fennec fox is most well known for it's large ears which can be half as long as the body of the fennec fox. The fennec fox is the smallest fox in the world, with fennec fox individuals ranging from 24 cm to 41 cm in length. "}, {"url": "http://animals.nationalgeographic.com/animals/mammals/fennec-fox/", "passage_text": "Size: Head and body, 9.5 to 16 in (24 to 41 cm); tail 7 to 12.2 in (18 to 31 cm). Weight: 2.2 to 3.3 lbs (1 to 1.5 kg). Size relative to a 6-ft (2-m) man: The fennec fox is the smallest of all the world's foxes, but its large ears, measuring 6 inches (15 centimeters), appear to be on loan from a bigger relative. Fennec foxes dwell in the sandy Sahara and elsewhere in North Africa."}, {"url": "https://en.wikipedia.org/wiki/Fennec_fox", "passage_text": "The fennec fox or fennec (Vulpes zerda) is a small nocturnal fox found in the Sahara of North Africa. Physically, the fennec lacks the musk glands of other fox species, and has only 32 chromosome pairs, while other fox species have between 35 and 39. The species also displays behaviors uncharacteristic of foxes, such as living in packs while most other fox species are solitary."}, {"url": "http://nationalzoo.si.edu/Animals/SmallMammals/fact-fennecfox.cfm", "passage_text": "Description. The fennec fox is the smallest fox in the world, weighing 2 to 3 pounds and the length is its body ranging from 9 to 16 inches. They have thick fur which keeps them warm during frigid cold nights in the desert as well as protects them from the heat of the day. "}, {"url": "http://www.itsnature.org/ground/mammals-land/fennec-fox/", "passage_text": "The Fennec Fox is one of the most beautiful of all desert animals. They are small canine animals, with tiny bodies that are only about a foot to a foot and a half long. Their most amazing feature is the ears. The Fennec Fox has ears that are about six inches long. They look huge in comparison to the rest of their heads. The large ears help them to track their prey animals as well as being useful to help them to lower their body heat. The Fennec Fox weighs only about three pounds when full grown. Between the toes of the Fennec Vox there is thick hair and it helps them to move very quickly and very silently through the sandy surfaces they live in. The Fennec Fox is native to the drier regions of North Africa, in the Sanai and the Arabian Peninsula."}, {"url": "http://www.foxesandfriends.com/fennecfox.htm", "passage_text": "The Fennec or 'desert fox' is a fitting name for this little one. Vulpes is the Latin name for 'fox' and is the genus name for 'true foxes.' Some believe Fennecs are related to the Chihuahua, but this is untrue. Dogs contain more chromosomes than foxes, which makes it impossible for them to breed. Some people believe the Chihuahua was a relative of the Fennec, but they are more closely related to the modern day dog than a fox. The lower number of chromosomes in foxes - 39 in dogs vs. 32 in the Fennec-makes it impossible for the two species to breed and produce hybrids."}, {"url": "http://fennecfoxes.net/fennec-diet-and-health/", "passage_text": "Azmira: Their food is very natural and well-balanced for a fennec. Mazuri Wild Feline: This is fairly high in taurine, which is good for your fennec. DO NOT feed them the omnivore feed from Mazuri unless they are getting all kinds of raw meats or insects along with it. A fennec is a canine, but their need to protein is as great or greater than a cat’s. If you feed a fennec an omnivore diet you will have all manner of health problems. Their bodies are not made for so much fiber. They cannot utilize it, and this shows in their stools."}, {"url": "http://animals.nationalgeographic.com/animals/mammals/fennec-fox/", "passage_text": "Fennec Fox Range. The fennec fox is the smallest of all the world's foxes, but its large ears, measuring 6 inches (15 centimeters), appear to be on loan from a bigger relative. Fennec foxes dwell in the sandy Sahara and elsewhere in North Africa. Weight: 2.2 to 3.3 lbs (1 to 1.5 kg). Size relative to a 6-ft (2-m) man:"}, {"url": "http://fennecfoxes.net/fennec-diet-and-health/", "passage_text": "A fennec’s diet in the wild is comprised of 90% animals/insects. They scavenge for the other 10%, and it’s mostly in roots that they find and dig up. Their diets usually consist of mostly protein from other animals and insects, with only an occasional bite of root or plant material. A fennec is a canine, but their need to protein is as great or greater than a cat’s. If you feed a fennec an omnivore diet you will have all manner of health problems. Their bodies are not made for so much fiber. They cannot utilize it, and this shows in their stools."}]