[{"url": "http://www.thefreedictionary.com/Jupiter", "passage_text": "Jupiter. n. 1. (Celestial Objects) the largest of the planets and the fifth from the sun. It has 16 satellites and is surrounded by a transient planar ring system consisting of dust particles."}, {"url": "https://en.wikipedia.org/wiki/Jupiter", "passage_text": "Jupiter is the fifth planet from the Sun and the largest in the Solar System. It is a giant planet with a mass one-thousandth that of the Sun, but two and a half times that of all the other planets in the Solar System combined. Jupiter is a gas giant, along with Saturn (Uranus and Neptune are ice giants). Jupiter was known to astronomers of ancient times. It is the largest of the four giant planets in the Solar System and hence its largest planet. It has a diameter of 142,984 km (88,846 mi) at its equator. The density of Jupiter, 1.326 g/cm 3, is the second highest of the giant planets, but lower than those of the four terrestrial planets."}, {"url": "http://www.thefreedictionary.com/Planet+Jupiter", "passage_text": "The fifth planet from the sun and the largest, with a diameter about 11 times that of Earth. It turns on its axis faster than any other planet in the solar system, taking less than ten hours to complete one rotation. See Table at solar system. See Note at planet. 1. (Celestial Objects) the largest of the planets and the fifth from the sun. It has 16 satellites and is surrounded by a transient planar ring system consisting of dust particles."}, {"url": "http://www.yourdictionary.com/jupiter", "passage_text": "1 (astronomy) The fifth and by far the largest planet in the Solar System, a gas giant, represented by the symbol ♃ in astronomy. 2  Jupiter is known for its Great Red Spot and many moons including the Galilean moons. ( 3 Roman mythology) The King of the Gods, also called Jove. Proper noun. ( 1 "}, {"url": "http://www.thefreedictionary.com/Planet+Jupiter", "passage_text": "Noun. 1. Jupiter-the largest planet and the 5th from the sun; has many satellites and is one of the brightest objects in the night sky. solar system-the sun with the celestial bodies that revolve around it in its gravitational field. 1. (Celestial Objects) the largest of the planets and the fifth from the sun. It has 16 satellites and is surrounded by a transient planar ring system consisting of dust particles."}, {"url": "http://www.thefreedictionary.com/Jupiter", "passage_text": "Jupiter-the largest planet and the 5th from the sun; has many satellites and is one of the brightest objects in the night sky. solar system-the sun with the celestial bodies that revolve around it in its gravitational field. 1. (Celestial Objects) the largest of the planets and the fifth from the sun. It has 16 satellites and is surrounded by a transient planar ring system consisting of dust particles."}, {"url": "http://www.definitions.net/definition/Jupiter", "passage_text": "Jupiter. Jupiter is the fifth planet from the Sun and the largest planet in the Solar System. It is a gas giant with mass one-thousandth that of the Sun but is two and a half times the mass of all the other planets in the Solar System combined. Jupiter is classified as a gas giant along with Saturn, Uranus and Neptune. Jupiter (noun). one of the planets, being the brightest except Venus, and the largest of them all, its mean diameter being about 85,000 miles. It revolves about the sun in 4,332.6 days, at a mean distance of 5.2028 from the sun, the earth's mean distance being taken as unity. Origin: [L., fr. Jovis pater."}, {"url": "http://www.merriam-webster.com/dictionary/Jupiter", "passage_text": "Definition of JUPITER. 1. : the chief Roman god, husband of Juno, and god of light, of the sky and weather, and of the state and its welfare and its laws — compare zeus. 2. : the largest of the planets and fifth in order from the sun — see planet table. See Jupiter defined for English-language learners."}, {"url": "http://www.yourdictionary.com/jupiter", "passage_text": "The Roman god Jupiter. The Roman god Jupiter. Atmospheric Gases-Ammonia and Ammonium HydrosulfideGases Underneath the Surface-Helium, Methane, Hydrogen and Ammonium Hydrosulfide. The definition of Jupiter is the largest planet in our solar system, or the supreme god in Roman mythology. Facts About Jupiter. Proper noun. ( 1 astronomy) The fifth and by far the largest planet in the Solar System, a gas giant, represented by the symbol ♃ in astronomy. 2  Jupiter is known for its Great Red Spot and many moons including the Galilean moons."}, {"url": "http://www.thefreedictionary.com/Jupiter", "passage_text": "The fifth planet from the sun and the largest, with a diameter about 11 times that of Earth. It turns on its axis faster than any other planet in the solar system, taking less than ten hours to complete one rotation. See Table at solar system. See Note at planet. 1. (Celestial Objects) the largest of the planets and the fifth from the sun. It has 16 satellites and is surrounded by a transient planar ring system consisting of dust particles."}]