[{"url": "https://wristsupportbraces.com/m-46-wrist-strain.aspx", "passage_text": "A wrist strain, is an injury to the muscles or tendons of the wrist in which the fibers tear as the result of being stretched beyond capacity, and are often the result of acute or direct injury but may be the consequence of repetitive motion. Wrist Strain Categories. • Inflammation of the tendon sheath. • Calcification of the tendon or muscle (visible on X-ray) – this is common in chronic wrist strain. Your doctor will perform a physical exam of the area to determine if your wrist is strained, and they may order X-rays to help them better diagnose and treat your injuries."}, {"url": "http://www.sportsinjuryclinic.net/sport-injuries/wrist-pain/wrist-strain", "passage_text": "Technically a strain is an injury to a muscle or tendon and is usually a small tear. Many people refer to any minor pain in the wrist as a strain, despite most cases being either ligament or tendon injuries. Wrist strain symptoms. Symptoms of a wrist strain include pain in the wrist which may develope gradually or suddenly. There may be a specific area which feels tender to touch and swelling may develop. Pain is likely to be reproduced when moving the wrist against resistance"}, {"url": "http://www.online-family-doctor.com/injuries/wrist-strain.html", "passage_text": "Wrist Strain. Injury to the muscles or tendons of the wrist. Muscles, tendons and attached bones comprise units. These units stabilize the wrist and allow its motion. A strain occurs at the weakest part of a unit. Strains are of 3 types: 1  Mild (Grade I)- Slightly pulled muscle without tearing of muscle or tendon fibers. 1 Tendons and muscles of the forearm. 2  Bones at the wrist, where the muscles and tendons attach. 3  Soft tissue surrounding the strain, including nerves, periosteum (covering to bone), blood vessels and lymph vessels."}, {"url": "http://www.sportsinjuryclinic.net/sport-injuries/wrist-pain/wrist-strain", "passage_text": "A wrist strain is a general term used to describe pain in the wrist. This may be due to a sudden force causing an acute injury, or due to overuse, causing a repetitive strain injury. Wrist strain symptoms. Symptoms of a wrist strain include pain in the wrist which may develope gradually or suddenly. There may be a specific area which feels tender to touch and swelling may develop. Pain is likely to be reproduced when moving the wrist against resistance"}, {"url": "http://www.sportsinjuryclinic.net/sport-injuries/wrist-pain/wrist-strain", "passage_text": "Strains and sprains. Technically a strain is an injury to a muscle or tendon and is usually a small tear. Many people refer to any minor pain in the wrist as a strain, despite most cases being either ligament or tendon injuries. Injury to a ligament which joins bone to bone should be referred to as a sprain. Wrist strain symptoms. Symptoms of a wrist strain include pain in the wrist which may develope gradually or suddenly. There may be a specific area which feels tender to touch and swelling may develop. Pain is likely to be reproduced when moving the wrist against resistance"}, {"url": "http://orthoinfo.aaos.org/topic.cfm?topic=A00111", "passage_text": "A strain is an injury to a muscle and/or tendons. Tendons are fibrous cords of tissue that attach muscles to the bone. Strains often occur in your foot, leg (typically the hamstring) or back. Similar to sprains, a strain may be a simple stretch in your muscle or tendon, or it may be a partial or complete tear in the muscle-and-tendon combination. Typical symptoms of a strain include pain, muscle spasm, muscle weakness, swelling, inflammation, and cramping. A sprain is a stretch and/or tear of a ligament, a strong band of connective tissue that connect the end of one bone with another. Ligaments stabilize and support the body's joints. For example, ligaments in the knee connect the thighbone with the shinbone, enabling people to walk and run."}, {"url": "http://www.niams.nih.gov/Health_Info/Sprains_Strains/default.asp", "passage_text": "A strain is an injury to either a muscle or a tendon (fibrous cords of tissue that connect muscle to bone). Depending on the severity of the injury, a strain may be a simple overstretch of the muscle or tendon, or it can result from a partial or complete tear. The knee is another common site for a sprain. A blow to the knee or a fall is often the cause; sudden twisting can also result in a sprain (see fig. 2). Sprains frequently occur at the wrist, typically when people fall and land on an outstretched hand. A sprain to the thumb is common in skiing and other sports."}, {"url": "http://www.webmd.com/fitness-exercise/wrist-sprain", "passage_text": "1 Ice your wrist to reduce pain and swelling. 2  Do it for 20-30 minutes every three to four hours for two to three days, or until the pain is gone. 3  Compress the wrist with a bandage. 4  Elevate your wrist above your heart, on a pillow or the back of a chair. as often as you can. 5  Take anti-inflammatory painkillers. 1 Rest your wrist for at least 48 hours. 2  Ice your wrist to reduce pain and swelling. 3  Do it for 20-30 minutes every three to four hours for two to three days, or until the pain is gone. 4  Compress the wrist with a bandage. 5  Elevate your wrist above your heart, on a pillow or the back of a chair. as often as you can"}]