[{"url": "http://cotswoldtourguide.com/", "passage_text": "The Cotswolds are an area of scenic countryside, two hours west of London – beautiful hills and valleys, pretty villages, small towns, ancient houses and cottages with traditional stone roofs and the famous dry stone walls. "}, {"url": "http://cotswolds.info/maps.shtml", "passage_text": "Map of the Cotswolds. Click on the major Cotswold towns for further information about the place. The Cotswolds Map generally takes up an area from Worcester due north to Bath due south, across to Oxford and then north to Stratford-upon-Avon. The region is delineated by the belt of rich limestone and of course by the beautiful cottages, fine buildings, and churches built of this material."}, {"url": "https://en.wikipedia.org/wiki/Cotswolds", "passage_text": "The hills give their name to the Cotswold local-government district in Gloucestershire, which administers a large part of the area. The highest point of the region is Cleeve Hill at 1,083 ft (330 m), just to the north of Cheltenham. The Cotswold Way is a long-distance footpath, just over 100 miles (161 km) long, running the length of the AONB, mainly on the edge of the Cotswold escarpment with views over the Severn Valley and the Vale of Evesham."}, {"url": "http://cotswolds.info/", "passage_text": "The Cotswolds-the Heart of England. ...where time has stood still for 300 years. The official Cotswolds.info website covering the whole of the Cotswolds and its surrounds is your online travel tour guide for discovering everything you need to know about visiting and touring the unique Cotswolds region of the UK. The unique region officially covers an area of 790 square miles in the upper part of the southwest region of England and is the country's largest officially designated ' Area of Outstanding Natural Beauty ' see our (Cotswolds Fact Sheet) ."}, {"url": "https://en.wikipedia.org/wiki/Cotswolds", "passage_text": "For the suburb of Toowoomba, Queensland, see Cotswold Hills, Queensland. The Cotswolds is an area in south central England containing the Cotswold Hills, a range of rolling hills which rise from the meadows of the upper Thames to an escarpment, known as the Cotswold Edge, above the Severn Valley and Evesham Vale. The Cotswold Way is a long-distance footpath, just over 100 miles (161 km) long, running the length of the AONB, mainly on the edge of the Cotswold escarpment with views over the Severn Valley and the Vale of Evesham."}, {"url": "https://www.ricksteves.com/europe/england/cotswolds", "passage_text": "Cotswolds. The Cotswold Hills, a 25-by-90-mile chunk of Gloucestershire, are dotted with enchanting villages. As with many fairy-tale regions of Europe, the present-day beauty of the Cotswolds was the result of an economic disaster: the collapse of the woolen industry. "}, {"url": "http://www.cotswolds.com/", "passage_text": "The Cotswolds area is one of England's favourite destinations; famous for hundreds of honey-colour limestone villages in a beautiful rural setting. In summer time, the Cotswolds offers fantastic walking and cycling, beautiful gardens, bustling farmers' markets and a delightful cafe culture. Take a look at the 2015 Cotswolds Visitor Guide to help you plan your holiday. The Cotswolds official guide is full of useful information, including a calendar of events, as well as where to stay and what to see at the wonderful attractions in the area."}, {"url": "http://www.the-cotswolds.org/top/english/intro.php", "passage_text": "The Cotswolds is an area of England about the size of greater Tokyo. Popular with both the English themselves and visitors from all over the world,the Cotswolds are well-known for gentle hillsides (wolds), sleepy villages and for being so typically English. "}, {"url": "http://www.picturesofengland.com/England/Gloucestershire/The_Cotswolds", "passage_text": "About The Cotswolds. The Cotswolds is one of the most charming and uniquely picturesque regions of England to visit. Famous for its gentle hillsides and rich golden limestone used to build its beautiful villages and towns (see below) the Cotswolds cannot fail to charm and inspire all those who visit the area. "}, {"url": "https://en.wikipedia.org/wiki/Cotswolds", "passage_text": "The Cotswolds are roughly 25 miles (40 km) across and 90 miles (145 km) long, stretching south-west from just south of Stratford-upon-Avon to just south of Bath. The Cotswold Way is a long-distance footpath, just over 100 miles (161 km) long, running the length of the AONB, mainly on the edge of the Cotswold escarpment with views over the Severn Valley and the Vale of Evesham."}]