[{"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMH0001396/", "passage_text": "About Hyperthyroidism. The thyroid gland is a part of the body's endocrine (hormone) system — which is made up of the glands that help regulate many of the body's different functions. An overactive thyroid produces too much of the thyroid hormone thyroxine, which causes some of these functions to speed up. Hyperthyroidism is the medical term for an overactive thyroid gland. Too little thyroxine reverses the process and slows down the body's functions. "}, {"url": "http://articles.latimes.com/2007/sep/24/health/he-closer24", "passage_text": "Potent physical or emotional stress can cause an overactive thyroid in those people who have the underlying genetic background, says Singer. Too much thyroid hormone speeds up metabolism. People lose weight, their heart beats rapidly, they have palpitations. It feels like you're amped up, says Singer. "}, {"url": "http://www.womenshealthnetwork.com/adrenal-fatigue-and-stress/could-stress-be-affecting-your-thyroid.aspx", "passage_text": "How stress can cause thyroid symptoms. Much of the medical literature looking at the effects of stress on the thyroid has focused on hyperthyroidism and a condition called Graves' disease. In general, Graves' is caused by an autoimmune response that prompts the thyroid to make too much thyroid hormone. You need just the right amount of cortisol for your thyroid to function optimally. Too much (from acute stress) or too little (as a result of continuous stress over time) can lead to problems. Imbalances along each axis can result in either overactive or underactive adrenal glands, as well as an underactive thyroid."}, {"url": "http://www.webmd.com/women/overactive-thyroid-hyperthyroidism", "passage_text": "Graves' disease. The most common cause of hyperthyroidism is an autoimmune condition called Graves' disease. The body's immune system creates an antibody that causes the gland to make an excessive amount of thyroid hormone. Graves' disease runs in families, and usually affects younger women. Thyroiditis. Thyroiditis is inflammation of the thyroid. A virus or problem with the immune system causes the gland to swell, leaking thyroid hormone into the bloodstream. There are several types of thyroiditis. 1  Subacute: A sudden, painful form of thyroiditis of unknown cause."}, {"url": "http://www.thyroid.com.au/overactive-thyroid/", "passage_text": "Other causes of an overactive thyroid can include inflammation of the thyroid due to viruses or bacterial infections. Also, postpartum hyperthyroidism affects women immediately after pregnancy. This is one of the most common postpartum health disorders, and it affects between ten and twenty percent of women. "}, {"url": "http://www.calmclinic.com/anxiety/causes/hyperthyroidism", "passage_text": "An overactive thyroid isn't always a problem. There are those with hyperthyroidism that show no symptoms, or show symptoms so minor that they never realize they have a thyroid problem. But in some cases, an overactive thyroid gland can lead to severe anxiety, possibly with panic attacks. Some people may develop anxiety not because their thyroid hormone is causing it, but because their thyroid hormone is causing other strange symptoms that lead to anxiety. Hyperthyroid causes many symptoms that can cause their own separate anxiety, such as: 1  Weight loss. 2  Heart palpitations. 3  Hair loss. 4  Fatigue"}, {"url": "http://www.livingwithanxiety.com/articles/anxiety/thyroid-and-anxiety", "passage_text": "Rather than causing anxiety, hypothyroidism often results in symptoms of depression. Hyperthyroidism, or an overactive thyroid, can cause symptoms like anxiety, nervousness, irritability, restlessness, sweating, and a rapid or irregular heartbeat. These symptoms are the result of overproduction of the hormone thyroxine, which speeds up your body's metabolism. If you’re suffering from anxiety, a test of the TSH level in your blood will indicate whether there is a problem with your thyroid function. A low TSH level indicates an overactive thyroid, a possible cause of anxiety."}, {"url": "http://www.nhs.uk/Conditions/Thyroid-over-active/Pages/Causes.aspx", "passage_text": "Causes of overactive thyroid. Overactive thyroid (hyperthyroidism) occurs when your thyroid gland produces too much of the thyroid hormones thyroxine or triiodothyronine. Overproduction of thyroid hormones can be caused by a number of conditions, which are outlined below."}]