[{"url": "http://www.nss.org/resources/library/spacepolicy/hawking.htm", "passage_text": "Stephen Hawking, the renowned British astrophysicist, speaks on Why We Should Go Into Space for NASA's 50th Anniversary lecture series at George Washington University, April 21, 2008. The human race has existed as a separate species for about 2 million years. Civilization began about 10,000 years ago, and the rate of development has been steadily increasing. If the human race is to continue for another million years, we will have to boldly go where no one has gone before. Thank you for listening."}, {"url": "https://en.wikipedia.org/wiki/Deep_Space_Exploration", "passage_text": "Deep space exploration (also deep-space exploration) is the term used for the exploration of deep space and which is usually described as being quite distant away from Earth, within or away from our solar system. At present the furthest space probe mankind has constructed and launched from Earth is Voyager 1, which was announced on December 5, 2011 to have reached the edge of the Solar System, and entered interstellar space on August 25, 2013."}, {"url": "http://www.nasa.gov/home/hqnews/2011/dec/HQ_11-415_2011_Year_in_Review.html", "passage_text": "The following are some of NASA's top stories for the past calendar year: NASA DECIDES ARCHITECTURE FOR FUTURE HUMAN DEEP SPACE EXPLORATION. NASA reached several milestones in developing a new U.S. space transportation system that will serve as the cornerstone for America's future human space exploration efforts. Those selected also will be among the first to pioneer a new generation of commercial launch vehicles and travel aboard a new heavy-lift rocket to distant destinations in deep space. Qualified individuals can apply to become an astronaut through the federal government's USAJobs.gov website."}, {"url": "http://www.nasa.gov/home/hqnews/2011/dec/HQ_11-415_2011_Year_in_Review.html", "passage_text": "NASA's Space Shuttle Program concluded in 2011 with three final missions to the International Space Station. Each mission carried supplies and equipment that will sustain the space station crews until NASA's new Commercial Resupply Service providers take over this role. Those selected also will be among the first to pioneer a new generation of commercial launch vehicles and travel aboard a new heavy-lift rocket to distant destinations in deep space. Qualified individuals can apply to become an astronaut through the federal government's USAJobs.gov website."}, {"url": "http://www.space.com/27883-nasa-orion-capsule-deep-space.html", "passage_text": "Getting people safely to and from destinations in deep space poses challenges that the engineers of NASA's last crewed spaceship, the now-retired space shuttle, never had to consider. (No space shuttle ever traveled beyond Earth orbit.). For example, if a problem develops aboard a spaceship in LEO, astronauts can theoretically be on the ground in less than an hour. But it would take days for a vehicle out by the moon or beyond to get home, said NASA Orion Program Manager Mark Geyer."}, {"url": "http://www.wired.com/2015/03/soon-humans-will-follow-robots-deep-space/", "passage_text": "And eventually, the two programs will reunify. NASA’s Deep Space Network was the communications link for the Apollo missions, and now connects a bunch of interplanetary robot spacecraft with home. “We wouldn’t have healthy robotic exploration without the human exploration program,” Bell says. "}, {"url": "http://www.space.com/27883-nasa-orion-capsule-deep-space.html", "passage_text": "View full size image. A spaceship built to carry humans is about to venture into deep space for the first time in more than four decades. NASA's Orion space capsule is scheduled to blast off on its first test flight Thursday (Dec. 4). For example, if a problem develops aboard a spaceship in LEO, astronauts can theoretically be on the ground in less than an hour. But it would take days for a vehicle out by the moon or beyond to get home, said NASA Orion Program Manager Mark Geyer."}, {"url": "http://www.nasa.gov/home/hqnews/2011/dec/HQ_11-415_2011_Year_in_Review.html", "passage_text": "In September, Bolden announced the design of a new Space Launch System -- a heavy-lift rocket that will take our astronauts farther into space than ever before, create high-quality jobs here at home, and provide the cornerstone for America's future human space exploration efforts. Those selected also will be among the first to pioneer a new generation of commercial launch vehicles and travel aboard a new heavy-lift rocket to distant destinations in deep space. Qualified individuals can apply to become an astronaut through the federal government's USAJobs.gov website."}, {"url": "http://www.space.com/27883-nasa-orion-capsule-deep-space.html", "passage_text": "On longer missions — to Mars, for example — astronauts will spend most of their transit time in a deep-space habitat attached to Orion; the capsule's chief job is to get astronauts into space and back home again.). For example, if a problem develops aboard a spaceship in LEO, astronauts can theoretically be on the ground in less than an hour. But it would take days for a vehicle out by the moon or beyond to get home, said NASA Orion Program Manager Mark Geyer."}, {"url": "http://www.popsci.com/article/technology/will-wormhole-travel-ever-be-possible", "passage_text": "Travel By Wormhole. jodipheonix via DeviantArt. As a curious species, humans have long dreamed of traveling to the farthest depths of space. That's the major theme of the upcoming science fiction epic Interstellar, which will take Matthew McConaughey and Anne Hathaway to the places we hope to one day reach ourselves. Except for that tiny hiccup called deep space travel. The universe is big. This plot device will be utilized yet again in Interstellar. In the film, a band of astronauts travel through a newly discovered wormhole connecting widely separated areas of space-time, in order to find a new world to call home. It sounds incredible, as if all our space travel fantasies can come true."}]