[{"url": "http://www.living-foods.com/articles/avocadoarticle.html", "passage_text": "Avocado is also known as the alligator pear because of the rough skin on some varieties. In the 17th and 18th centuries the fruit was also commonly known as butter pear. In tropical Central America, avocado trees have been growing wild for thousands of years, providing natives with a rich food. If you love fatty, creamy, hearty foods and want to avoid the cholesterol and toxicity of meat and dairy, anchor your diet with avocado! by David Klein dave@livingnutrition.com. From Living Nutrition Magazine vol. 11 http://www.livingnutrition.com Living Nutrition Publications."}, {"url": "http://whatscookingamerica.net/avacado.htm", "passage_text": "Wash your avocados first. Even though you will not use the skin, when you cut through the skin with a knife germs and bacteria can transfer onto the knife which can go through to the meat of the fruit and contaminate it. When the avocado is cut, the flesh turns brown because of oxidation. You can freeze mashed fresh, ripe avocados if you want to have an emergency supply of avocados on hand for guacamole. Now you can buy them in bulk and FREEZE them! So stock up on avocado when you see a sale at your grocery store. The texture of the avocado is the same as a fresh avocado once it thaws."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-890-AVOCADO.aspx?activeIngredientId=890&activeIngredientName=AVOCADO", "passage_text": "Avocado oil is applied directly to the skin to soothe and heal skin and to treat thickening (sclerosis) of the skin, gum infections (pyorrhea), and arthritis. Avocado oil is used in combination with vitamin B12 for a skin condition called psoriasis. Avocado is a tree. The fruit, a popular food, is a good source of potassium and vitamin D. The fruit, leaves, and seeds are used to make medicine. Avocado fruit is used to lower cholesterol levels, to increase sexual desire, and to stimulate menstrual flow. Some of the oils in avocado (chemists call these oils the “unsaponifiable fractions”) are used to treat osteoarthrit"}, {"url": "http://hemocode.com/wiki/Avocado-Intolerance", "passage_text": "In the case of an avocado intolerance, a person will be unable to properly digest, absorb or process avocado. Digestive avocado intolerance symptoms include bloating, excessive gas, stomach pain, cramping, stomach aches, diarrhea and a number of other symptoms. Avocado Intolerance. Avocado Intolerance Information. An avocado intolerance will cause a person to experience negative symptoms after eating avocados or foods that contain avocado. An avocado intolerance is different from an avocado allergy. With an allergy, a person will experience very severe symptoms shortly after consuming the offending food. These symptoms can be life-threatening for some people and in some situations. Food intolerance symptoms are not life-threatening"}, {"url": "http://www.huffingtonpost.com/2014/06/10/bloating_n_5439816.html", "passage_text": "It’s uncomfortable, gross and occasionally embarrassing, but bloating is something we all deal with at one point or another. Gassiness isn't just from gorging yourself at the last family meal. Bloating happens because your body can't break down gas, like it does the food you swallow. Sometimes even the digestive process itself creates gas right in your abdomen. If it's not released, air begins to build up in the stomach and intestines, which can make your belly feel like a balloon. Cabbage, broccoli, kale, apples and avocados have all been known to cause bloating. Eating too much salt can also cause water retention, which can leave you feeling puffy. Plus, downing lots of fiber -- especially from supplements -- without drinking enough water is a fast track to a gassy gut."}, {"url": "http://www.theglobeandmail.com/life/health-and-fitness/ask-a-health-expert/are-avocados-good-for-me/article7524624/", "passage_text": "A diet high in monounsaturated fat from avocados has been shown to lower LDL (bad) cholesterol and raise HDL (good) cholesterol. Monounsaturated fat can also help reduce inflammation in the body. There are other reasons why avocados are good for you. The answer. Avocados are a very nutritious food (they’re a fruit actually). It’s true they’re high in fat – 84 per cent of the calories (325) in an avocado come from fat (30 grams)."}, {"url": "http://www.living-foods.com/articles/avocadoarticle.html", "passage_text": "* The quantity of avocados that is healthful for you is a function of your taste preferences and digestion. Generally, one a day, three to six days per week is a good baseline. For best results, tune in to your bodys senses and observe your energy levels, digestion and elimination. If you love fatty, creamy, hearty foods and want to avoid the cholesterol and toxicity of meat and dairy, anchor your diet with avocado! by David Klein dave@livingnutrition.com. From Living Nutrition Magazine vol. 11 http://www.livingnutrition.com Living Nutrition Publications."}, {"url": "http://www.theglobeandmail.com/life/health-and-fitness/ask-a-health-expert/are-avocados-good-for-me/article7524624/", "passage_text": "And they also supply a little vitamin E to your diet. Avocados are also an exceptional source of fibre, which can cause digestive problems for some people. One avocado has 13.5 grams of fibre – half a day’s worth for women (and one-third of a day’s worth for men)! But everyone tolerates foods differently. The answer. Avocados are a very nutritious food (they’re a fruit actually). It’s true they’re high in fat – 84 per cent of the calories (325) in an avocado come from fat (30 grams)."}]