[{"url": "https://au.answers.yahoo.com/question/index?qid=20130324180834AAq83zi", "passage_text": "Best Answer: Some non-metals and their uses are listed below - 1] Oxygen is used for breathing. 2] Chlorine is used for purifying water. 3] Phosphorous is used in crackers. 4] Non-metals like nitrogen is used in fertilizers. 5] Graphite is used as a good conductor of electricity. 6] Pottassium"}, {"url": "http://www.nma.org/index.php/minerals-publications/40-common-minerals-and-their-uses", "passage_text": "A native element; antimony metal is extracted from stibnite ore and other minerals. Used as a hardening alloy for lead, especially storage batteries and cable sheaths; also used in bearing metal, type metal, solder, collapsible tubes and foil, sheet and pipes and semiconductor technology."}, {"url": "http://www.csun.edu/~jk323784/subjects/chemistry/notes/metal_prop.pdf", "passage_text": "1 Metals And Their Properties-Physical and Chemical All the things around us are made of 100 or so elements. These elements were classified by Lavoisier in to metals and non-metals by studying their properties. The metals and non-metals differ in"}, {"url": "http://www.castlemetalseurope.com/blog/ferrous-nonferrous-metals-uses/", "passage_text": "Ferrous Metals. The following are ferrous metals and the kind of uses to which they are usually put: 1  Mild Steel – Carbon content of 0.1 to 0.3% and Iron content of 99.7 – 99.9%. 2  Used for engineering purposes and in general, none specialised metal products. 3  Carbon steel – Carbon content of 0.6 to 1.4% and Iron content of 98.6 to 99.4 %."}, {"url": "http://www.nma.org/index.php/minerals-publications/40-common-minerals-and-their-uses", "passage_text": "The most abundant metal element in Earth's crust. Aluminum originates as an oxide called alumina. Bauxite ore is the main source of aluminum and must be imported from Jamaica, Guinea, Brazil, Guyana, etc. Used in transportation (automobiles), packaging, building/construction, electrical, machinery and other uses."}]