[{"url": "https://en.wikipedia.org/wiki/Neo-Babylonian_Empire", "passage_text": "The Neo-Babylonian Empire was a period of Mesopotamian history which began in 626 BC and ended in 539 BC. During the preceding three centuries, Babylonia had been ruled by their fellow Akkadian speakers and northern neighbours, Assyria."}, {"url": "http://www.ducksters.com/history/mesopotamia/babylonian_empire.php", "passage_text": "The Babylonians were the first to form an empire that would encompass all of Mesopotamia. Rise of the Babylonians and King Hammurabi. The city of Babylon had been a city-state in Mesopotamia for many years. After the fall of the Akkadian Empire, the city was taken over and settled by the Amorites. The city began its rise to power in 1792 BC when King Hammurabi took the throne."}, {"url": "http://www.bible-history.com/maps/maps/map_babylonian_empire_550_bc.html", "passage_text": "Map of the Babylonian Empire (550 B.C.) Map of the Empire of Babylon in 550 B.C. The Babylonians were also great traders as revealed through archaeology, and thousands of cuneiform tablets have been found telling of their complex trade networks. They traded with Lebanon, Egypt and Greece."}, {"url": "http://www.bible-history.com/maps/03-babylonian-empire.html", "passage_text": "The Babylonian Empire came to power in 625 after the fall of Assyria. Babylon continued its reign until 536 BC. During this period Babylon, located along the Euphrates River, was the metropolis of the East and called in the Bible the city of Gold."}, {"url": "http://www.bible-history.com/maps/03-babylonian-empire.html", "passage_text": "Study Tools. Timelines & Charts. This map reveals the Babylonian Empire in 580 BC under its greatest ruler Nebuchadnezzar II. The kings of the Neo-Babylonian Empire were Nabu-apla-usur, Nabu-kudurri-usur II (Nebuchadnezzar II), Amel-Marduk, Neriglissar, Laba i-Marduk, Nabonidus."}, {"url": "https://en.wikipedia.org/wiki/Neo-Babylonian_Empire", "passage_text": "In alliance with the Medes, Persians, Scythians and Cimmerians, they sacked the city of Nineveh in 612 BC, and the seat of empire was transferred to Babylonia for the first time since the death of Hammurabi in the mid 18th century BC."}, {"url": "http://www.livius.org/articles/place/babylonian-empire/", "passage_text": "Babylonian Empire. The Babylonian Empire was the most powerful state in the ancient world after the fall of the Assyrian empire (612 BCE). Its capital Babylon was beautifully adorned by king Nebuchadnezzar, who erected several famous buildings."}]