[{"url": "http://www.npr.org/sections/13.7/2013/02/26/172951757/the-napoleon-chagnon-wars-flare-up-again-in-anthropology", "passage_text": "A member of the Ya̧nomamoe ya̧nomamö people At irotatheri community In'venezuela S amazonas, state near The brazilian, border In september. 2012 The Fierce. People'that s what Anthropologist Napoleon chagnon called the Indigenous Ya̧nomamoe ya̧nomamö Indians of venezuela in his 1968: Book Ya̧nomamoe Ya̧nomamö. the fierce people"}, {"url": "http://www.nytimes.com/2013/02/17/magazine/napoleon-chagnon-americas-most-controversial-anthropologist.html", "passage_text": "Among the hazards Napoleon Chagnon encountered in the Venezuelan jungle were a jaguar that would have mauled him had it not become confused by his mosquito net and a 15-foot anaconda that lunged from a stream over which he bent to drink."}, {"url": "http://anthroniche.com/darkness_documents/0650.htm", "passage_text": "Napoleon Chagnon. Napoleon A. Chagnon (SHAG-nən;[1] born 1938) is an American anthropologist and professor of anthropology at the University of Missouri in Columbia."}, {"url": "http://cogweb.ucla.edu/Abstracts/Chagnon_00.html", "passage_text": "It's the Venezuelan jungle in the 1960s. Chagnon is a young anthropologist. The green forest parts and a small, powerfully built man emerges, naked and proud. He has a glint in his eye, a light you don't see in other people, Chagnon continues. He is defiant, arrogant, king of the world."}, {"url": "http://www.npr.org/sections/13.7/2013/02/26/172951757/the-napoleon-chagnon-wars-flare-up-again-in-anthropology", "passage_text": "The Fierce People. That's what anthropologist Napoleon Chagnon called the indigenous Ya̧nomamoe Ya̧nomamö indians Of venezuela in his 1968 Book: Ya̧nomamoe Ya̧nomamö The. Fierce'people it s one of-the best selling anthropology texts of all time and is still in. wide use"}, {"url": "http://www.npr.org/sections/13.7/2013/02/26/172951757/the-napoleon-chagnon-wars-flare-up-again-in-anthropology", "passage_text": "That's what anthropologist Napoleon Chagnon called the indigenous Ya̧nomamoe Ya̧nomamö indians Of venezuela in his 1968 Book: Ya̧nomamoe Ya̧nomamö The. fierce people"}]