[{"url": "http://www.answers.com/Q/Who_wrote_tiger_tiger_burning_bright", "passage_text": "It is performed by Survivor, with the song being written by request of Sly Stallone himelf. He wanted a boxing theme song, and, boy, did he get one! The correct answer t … o who wrote the song Eye of the Tiger is the band Survivor. The band members of Survivor include Frankie Sullivan and Jim Peterik."}, {"url": "http://www.youtube.com/watch?v=fXsiW7A--dY", "passage_text": "The Tyger is a poem by the English poet William Blake. It was published as part of his collection Songs of Experience in 1794 (see 1794 in poetry). It is one of Blake's best-known and most analyzed poems. The Cambridge Companion to William Blake (2003) calls it the most anthologized poem in English.[1]. Most modern anthologies have kept Blake's choice of the archaic spelling tyger."}, {"url": "https://en.wikipedia.org/wiki/The_Tyger", "passage_text": "The Tyger is the sister poem to . The Lamb  (from  Songs of Innocence ), a reflection of similar ideas from a different perspective (Blake's concept of contraries), with The Lamb bringing attention to innocence. In the fifth stanza, Blake wonders how the creator reacted to the Tyger, and who created the creature. Finally, the sixth restates the central question while raising the stakes; rather than merely question what/who could create the Tyger, the speaker wonders: who dares."}, {"url": "https://en.wikipedia.org/wiki/The_Tyger", "passage_text": "The Songs of Experience was published in 1794 as a follow up to Blake's 1789 Songs of Innocence. The two books were published together under the merged title Songs of Innocence and Experience, showing the Two Contrary States of the Human Soul: the author and printer, W. Blake featuring 54 plates. In the fifth stanza, Blake wonders how the creator reacted to the Tyger, and who created the creature. Finally, the sixth restates the central question while raising the stakes; rather than merely question what/who could create the Tyger, the speaker wonders: who dares."}, {"url": "http://www.answers.com/Q/Who_wrote_the_tiger_tiger_burning_bright_in_the_forests_of_the_night_poem", "passage_text": "The song Eye of the Tiger was written by Frankie Sullivan and Jim Peterik; members of the rock band Survivor in 1982. He wanted a boxing theme song, and, boy, did he get one! The correct answer t … o who wrote the song Eye of the Tiger is the band Survivor. The band members of Survivor include Frankie Sullivan and Jim Peterik."}, {"url": "http://www.answers.com/Q/Who_wrote_the_tiger_tiger_burning_bright_in_the_forests_of_the_night_poem", "passage_text": "Eye of the Tiger was written by Frankie Sullivan and Jim Peterik from the band Survivor at the request of Sylvester Stallone who needed a song for Rocky III because he could … n't get the permission to use Queen's Another One Bites the Dust. 2 people found this useful. He wanted a boxing theme song, and, boy, did he get one! The correct answer t … o who wrote the song Eye of the Tiger is the band Survivor. The band members of Survivor include Frankie Sullivan and Jim Peterik."}, {"url": "https://en.wikipedia.org/wiki/Talk:The_Tyger", "passage_text": "'Tiger! Tiger! Burning bright, / in the forests of the night.'. Blake wrote that. Apparently the tiger was on fire. Maybe his tail got struck by lightning or something. My take is that the fearful symmetry rhymes with Did he who made the lamb make thee, from the second-to-last stanza, bringing a bit more emphasis to that line. Haj Ross wrote a 45-page paper about the poem [1] where he goes on for a while about the impact of the lamb line."}, {"url": "http://www.answers.com/Q/Who_wrote_tiger_tiger_burning_bright", "passage_text": "Eye of the Tiger was written by Frankie Sullivan and Jim Peterik from the band Survivor at the request of Sylvester Stallone who needed a song for Rocky III because he could … n't get the permission to use Queen's Another One Bites the Dust. He wanted a boxing theme song, and, boy, did he get one! The correct answer t … o who wrote the song Eye of the Tiger is the band Survivor. The band members of Survivor include Frankie Sullivan and Jim Peterik."}, {"url": "https://en.wikipedia.org/wiki/The_Tyger", "passage_text": ". The Tyger  is a poem by the English poet William Blake published in 1794 as part of the Songs of Experience collection. Literary critic Alfred Kazin calls it the most famous of his poems, and The Cambridge Companion to William Blake says it is the most anthologized poem in English.. In the fifth stanza, Blake wonders how the creator reacted to the Tyger, and who created the creature. Finally, the sixth restates the central question while raising the stakes; rather than merely question what/who could create the Tyger, the speaker wonders: who dares."}]