[{"url": "http://www.rightdiagnosis.com/m/morphea/basics.htm", "passage_text": "1 Morphea: A term used to describe a variety of localized asymmetrical SKIN thickening that is similar to those of SYSTEMIC SCLERODERMA but without the disease features in the multiple internal organs and BLOOD VESSELS. 2  Lesions may be characterized as patches or plaques (morphea), bands (linear), or nodules. "}, {"url": "http://www.aboutkidshealth.ca/En/HealthAZ/ConditionsandDiseases/InflammatoryConditions/Pages/Morphea.aspx", "passage_text": "Morphea is a skin condition, also known as localized scleroderma, meaning hard skin.. The skin becomes thick and hard because it contains too much collagen and other proteins. Localized scleroderma must not be confused with systemic scleroderma. "}, {"url": "http://www.medicinenet.com/image-collection/morphea_early_picture/picture.htm", "passage_text": "Get the Latest health and medical information delivered direct to your inbox! Morphea is localized scleroderma confined to the skin. It most commonly affects the trunk but also occurs on the face and extremities. The four clinical variants include plaque-type morphea, generalized morphea, linear morphea (en coupe de sabre), and pansclerotic morphea of children (morphea profunda). "}, {"url": "http://misc.medscape.com/pi/android/medscapeapp/html/A1065782-business.html", "passage_text": "Morphea, also known as localized scleroderma, is a disorder characterized by excessive collagen deposition leading to thickening of the dermis, subcutaneous tissues, or both. "}, {"url": "http://emedicine.medscape.com/article/1065782-overview", "passage_text": "Morphea, also known as localized scleroderma, is a disorder characterized by excessive collagen deposition leading to thickening of the dermis, subcutaneous tissues, or both. "}, {"url": "http://www.utsouthwestern.edu/education/medical-school/departments/dermatology/research/morphea-registry/disease-faq.html", "passage_text": "Morphea, also known as localized scleroderma, is a condition which causes hardening and discoloration of the skin. It is thought to be isolated to the skin without internal organ involvement as seen in systemic sclerosis (commonly known as scleroderma). There is very little information about who are at highest risk for getting morphea as there are no known predictors for the disease. Data from our registry indicates that other autoimmune diseases are more common in patients with morphea and possibly their relatives as well."}, {"url": "http://www.aocd.org/?page=Morphea", "passage_text": "Morphea. Share |. Scleroderma comes in two main forms: systemic and localized. Scleroderma is a disease of unknown origin that affects the microvasculature and loose connective tissues of the body and is characterized by fibrosis and obliteration of vessels in the skin, lungs, gut, kidneys and heart. Generalized morphea is a severe form of the localized disease. Involvement of the skin is widespread with multiple plaques/lesions. The plaques may be larger than in the localized form but in the early stages they may be indistinguishable."}, {"url": "http://medical-dictionary.thefreedictionary.com/morphea", "passage_text": "morphea. a type of localized scleroderma in which connective tissue replaces the skin and sometimes subcutaneous tissues, with formation of ivory white or pink patches, bands, or lines that are sometimes bordered by a purple areola. "}]