[{"url": "http://www.answers.com/Q/What_does_the_ozone_layer_do", "passage_text": "More detail. The ozone layer is the product of very short wave Ultraviolet light (UV-B) breaking apart oxygen molecules. When ozone is formed, it serves to block energetic UV (UV-B) that other molecules don't, and acts to moderate day / night temperature swings a little bit. There is also ozone in the lower troposphere, but the ozone layer in the stratosphere contains helpful ozone that blocks much of the ultraviolet radi … ation. Without this layer, life on earth would be very difficult."}, {"url": "http://www.ozonelayer.noaa.gov/science/basics.htm", "passage_text": "Ozone is very rare in our atmosphere, averaging about three molecules of ozone for every 10 million air molecules. In spite of this small amount, ozone plays a vital role in the atmosphere. In the information below, we present the basics about this important component of the Earth's atmosphere. Without the filtering action of the ozone layer, more of the Sun's UV-B radiation would penetrate the atmosphere and would reach the Earth's surface. Many experimental studies of plants and animals and clinical studies of humans have shown the harmful effects of excessive exposure to UV-B radiation."}, {"url": "https://en.wikipedia.org/wiki/Ozone_layer", "passage_text": "Although the concentration of the ozone in the ozone layer is very small, it is vitally important to life because it absorbs biologically harmful ultraviolet (UV) radiation coming from the sun. Extremely short or vacuum UV (10–100 nm) is screened out by nitrogen. The ozone layer is mainly found in the lower portion of the stratosphere, from approximately 20 to 30 kilometres (12 to 19 mi) above Earth, though the thickness varies seasonally and geographically."}, {"url": "https://en.wikipedia.org/wiki/Ozone_layer", "passage_text": "The ozone layer contains less than 10 parts per million of ozone, while the average ozone concentration in Earth's atmosphere as a whole is only about 0.3 parts per million. The ozone layer is mainly found in the lower portion of the stratosphere, from approximately 20 to 30 kilometres (12 to 19 mi) above Earth, though the thickness varies seasonally and geographically."}, {"url": "http://www.weatherquestions.com/What_is_the_ozone_layer.htm", "passage_text": "The ozone layer is a deep layer in the stratosphere, encircling the Earth, that has large amounts of ozone in it. The layer shields the entire Earth from much of the harmful ultraviolet radiation that comes from the sun. The ozone layer became more widely appreciated by the public when it was realized that certain chemicals mankind manufactures, called chloroflurocarbons, find their way up into the stratosphere where, through a complex series of chemical reactions, they destroy some of the ozone."}, {"url": "http://www.factmonster.com/ipka/A0800624.html", "passage_text": "The Ozone Layer. The Earth's atmosphere is divided into several layers. The lowest region, the troposphere, extends from the Earth's surface up to about 10 kilometers (km) in altitude. The next layer, the stratosphere, continues from 10 km to about 50 km. Most atmospheric ozone is concentrated in a layer in the stratosphere, about 15–30 kilometers above the Earth's surface. Ozone is a molecule containing three oxygen atoms. It is blue in color and has a strong odor. Normal oxygen, which we breathe, has two oxygen atoms and is colorless and odorless."}, {"url": "http://www.ozonelayer.noaa.gov/science/basics.htm", "passage_text": "Where is ozone found in the atmosphere? Ozone is mainly found in two regions of the Earth's atmosphere. Most ozone (about 90%) resides in a layer that begins between 6 and 10 miles (10 and 17 kilometers) above the Earth's surface and extends up to about 30 miles (50 kilometers). This region of the atmosphere is called the stratosphere. Without the filtering action of the ozone layer, more of the Sun's UV-B radiation would penetrate the atmosphere and would reach the Earth's surface. Many experimental studies of plants and animals and clinical studies of humans have shown the harmful effects of excessive exposure to UV-B radiation."}, {"url": "http://www.answers.com/Q/What_does_the_ozone_layer_do", "passage_text": "Ozone absorbs UV-B, which would otherwise damage our DNA, and the DNA of all surface dwellers on Earth (including phytoplankton in the oceans). This absorption of UV-B or more energetic light breaks the ozone down into an oxygen molecule and a single oxygen atom. There is also ozone in the lower troposphere, but the ozone layer in the stratosphere contains helpful ozone that blocks much of the ultraviolet radi … ation. Without this layer, life on earth would be very difficult."}, {"url": "http://www.answers.com/Q/What_does_the_ozone_layer_do", "passage_text": "The ozone layer protects the Earth from ultraviolet (UV) rays from the sun, which are harmful to us. Without the ozone layer, the effects of global warming would happen at a m … uch faster rate, and UV can be harmful to many forms of life. There is also ozone in the lower troposphere, but the ozone layer in the stratosphere contains helpful ozone that blocks much of the ultraviolet radi … ation. Without this layer, life on earth would be very difficult."}, {"url": "http://www.factmonster.com/ipka/A0800624.html", "passage_text": "The ozone layer is a concentration of ozone molecules in the stratosphere. About 90% of the planet's ozone is in the ozone layer. The layer of the Earth's atmosphere that surrounds us is called the troposphere. The stratosphere, the next higher layer, extends about 10–50 kilometers above the Earth's surface. Most atmospheric ozone is concentrated in a layer in the stratosphere, about 15–30 kilometers above the Earth's surface. Ozone is a molecule containing three oxygen atoms. It is blue in color and has a strong odor. Normal oxygen, which we breathe, has two oxygen atoms and is colorless and odorless."}]