[{"url": "http://www.marineandreef.com/Best_Aquarium_Protein_Skimmers_100_to_300_Gallon_Tanks_s/371.htm", "passage_text": "The Reef Octopus Classic BH-1000 Protein Skimmer is a favorite hang-on back skimmer. Capable of filtering aquariums from 78 to 130 gallons, the Classic BH-1000 features an easy to install and operate design in which the pump is mounted outside the aquarium."}, {"url": "http://www.marineandreef.com/Best_Hang_On_Protein_Skimmers_Best_Hang_On_Back_Aquarium_s/372.htm", "passage_text": "The Reef Octopus Classic BH-1000 Protein Skimmer is a favorite hang-on back skimmer. Capable of filtering aquariums from 78 to 130 gallons, the Classic BH-1000 features an easy to install and operate design in which the pump is mounted outside the aquarium."}, {"url": "http://www.marinedepot.com/in-sump-protein-skimmer.html", "passage_text": "In Sump Protein Skimmers: Powerful filtration hidden inside your aquarium stand [Click here for more info.]. Aquarium protein skimmers are one of the most important devices you can use to maintain water quality in a saltwater aquarium."}, {"url": "http://successfulreefkeeping.com/learn/reef-tank-101/protein-skimmers/", "passage_text": "A protein skimmer is a piece of equipment used in aquariums, especially marine and reef tanks, to physically remove organic materials from the aquarium water."}, {"url": "http://www.marinedepot.com/protein-skimmer.html", "passage_text": "Protein Skimmers: The heart of a reef aquarium filtration system [Click here for more info.]. Aquarium protein skimmers are one of the most important devices you can use to maintain water quality in a saltwater aquarium. Protein skimming removes organic pollutants before they break down into nitrates and phosphates."}, {"url": "http://www.youtube.com/watch?v=xh0WbYIq9kM", "passage_text": "A protein skimmer (http://goo.gl/3nn0yF) is a key component to a marine aquarium’s filtration system. Throughout my years of reef keeping, I have learned that using a good quality protein skimmer can greatly improve your odds of success."}, {"url": "http://www.marinedepot.com/protein-skimmer.html", "passage_text": "Aquarium protein skimmers are available in a few different styles: including hang-on, in-sump and external/recirculating. Hang-on skimmers are designed to hang on the rim of your aquarium and do not require a sump for installation. In-sump protein skimmers are designed to be placed in your sump."}, {"url": "http://www.marineandreef.com/Best_Hang_On_Protein_Skimmers_Best_Hang_On_Back_Aquarium_s/372.htm", "passage_text": "The Reef Octopus Classic 100-HOB Protein Skimmer is a favorite hang-on back skimmer. Capable of filtering aquariums up to 75 gallons, the Classic 100-HOB features an easy to install and operate design in which the pump is mounted inside the aquarium."}]