[{"url": "http://www.surfermag.com/blogs/culture/the-surf-specific-college-degree/", "passage_text": "If you’re a high school surfer panicking about what to study in college, or if you’re the parent of one and you’re worried that your young shredder doesn’t have the academic commitment for a university degree, there may be hope for the both of you."}, {"url": "https://nationalcareersservice.direct.gov.uk/advice/planning/jobprofiles/Pages/horseridinginstructor.aspx", "passage_text": "As a horse riding instructor you would work with people of different ages, riding ability and experience, and teach them to ride horses. If you have patience and love working with horses, this could be the career for you. You’ll need to have great communication skills and be able to motivate riders of all abilities."}, {"url": "http://www.surfermag.com/blogs/culture/the-surf-specific-college-degree/", "passage_text": "The degree is like many others, what you make of it, I had a great time surfing almost every day but also studying hard and getting a first and then a good job. If you see it purely as a piece of paper to get a job with then yes I agree it will be a waste but as far as a life experience it was one of my favourites."}, {"url": "http://www.teachingdegree.org/types-of-teachers/higher-education/", "passage_text": "Master’s Degree in Higher Education. If you wish to teach beyond the high-school level, you will need at least a master’s degree. Many 2-year community colleges often hire instructors with only master’s degrees, as long as they have some teaching experience."}, {"url": "https://answers.yahoo.com/question/index?qid=20070926195627AANEGot", "passage_text": "If you are confused by anything, just ask your instructor why he wrote what he did (assuming he wrote the drum parts). After you begin to understand, try writing your own drum parts to the piece and see how you do. One more thing... You need to be able to rehearse a drumline."}, {"url": "http://work.chron.com/degree-need-online-instructor-community-college-9577.html", "passage_text": "These courses are required for most degree programs, and students often find it easier and cheaper to take them through a community college than at a four-year university. To teach general education courses online, most community colleges require a master’s degree with 18 graduate hours in the subject being taught."}, {"url": "https://answers.yahoo.com/question/index?qid=20070926195627AANEGot", "passage_text": "Best Answer: The good news for you is that, in order to be a drumline instructor, no formal education is technically required. Of course, that doesn't mean that you can just walk into a school and take over the drumline. While you don't need any formal education, the are things that will really help."}]