[{"url": "https://answers.yahoo.com/question/index?qid=20101105204841AAGgjnV", "passage_text": "he told me its possible that wel... show more i like this guy hes a virgo but he seems really emotionally detached... im starting to ownder if hes worth pursing hes nice but when i show emotion toward him and tell him i miss him he doesnt say anything or i get an answer 3 hours later."}, {"url": "http://www.zodiac-signs.org/virgo-zodiac-sign-traits/", "passage_text": "Typical characteristics and personality traits of Virgo. The Virgo astrology sign is a passive or an introvert birth sign due to its negative polarity. Therefore, the Virgo zodiac traits are emotional detachment, deviousness, excessive tidiness, loyalty, and civility. Virgos are normally eloquent with words and the languages, have good manners, and are quite sensitive to criticism. Moreover, a typical Virgo has an incredible eye for detail and precision."}, {"url": "http://zodiac-signs-astrology.com/zodiac-signs/virgo.htm", "passage_text": "A Virgo mind is a very powerful mind and they must have the proper attitude for their life to be happy and successful. Virgo needs to get in touch with their feelings, this is why they usually seem cold or detached. They are very prone of living in denial."}, {"url": "https://answers.yahoo.com/question/index?qid=20101105204841AAGgjnV", "passage_text": "It's up to you. Virgo men are very incognito with feelings. I'm a Virgo man and I have a hard time expressing my feelings. Be patient but let him know what you need too but try and do it without sounding emotionally demanding. iSAAC · 5 years ago."}, {"url": "http://www.astrologyzone.com/lifelove/matchmaker/virgo_gemini.html", "passage_text": "No matter how compatible you are -- and you two really are -- you could both feel shortchanged unless one of you takes the time to do this. Don't be too much of a realist, Virgo, nor too emotionally guarded! Allow your Gemini lover's playfulness to tickle your funny bone. Stop being so serious, too."}]