[{"url": "http://www.health.harvard.edu/staying-healthy/foods-that-fight-inflammation", "passage_text": "Include plenty of these anti-inflammatory foods in your diet: tomatoes. olive oil. green leafy vegetables, such as spinach, kale, and collards. nuts like almonds and walnuts. fatty fish like salmon, mackerel, tuna, and sardines. fruits such as strawberries, blueberries, cherries, and oranges."}, {"url": "http://www.health.harvard.edu/staying-healthy/foods-that-fight-inflammation", "passage_text": "Foods that combat inflammation. Include plenty of these anti-inflammatory foods in your diet: tomatoes. olive oil. green leafy vegetables, such as spinach, kale, and collards. nuts like almonds and walnuts. fatty fish like salmon, mackerel, tuna, and sardines. fruits such as strawberries, blueberries, cherries, and oranges."}, {"url": "http://www.huffingtonpost.com/2013/03/21/inflammatory-foods-worst-inflammation_n_2838643.html", "passage_text": "The foods we choose to eat -- or not to eat -- can also affect inflammation. Getting your fair share of fruits, vegetables, whole grains, lean meat and omega-3 fatty acids -- similar, yes, to the Mediterranean diet -- has been suggested to have anti-inflammatory effects."}, {"url": "http://www.healthline.com/health/rheumatoid-arthritis/foods-that-reduce-inflammation", "passage_text": "There's truth to the adage you are what you eat.. It's especially relevant when managing inflammation and reducing swelling in your joints. While some foods can make things worse, there are plenty of tasty anti-inflammatory foods that can ease swollen joints, finger pain, and even symptoms of rheumatoid arthritis."}, {"url": "http://www.sheknows.com/health-and-wellness/articles/803649/the-anti-inflammatory-diet-eating-foods-to-heal-your-body", "passage_text": "Lamphere recommends foods high in omega-3 fatty acids, such as wild salmon, sardines, herring, anchovies, flaxseed, hempseed and walnuts. In addition, other anti-inflammatory fats include extra-virgin olive oil, avocado oil, flaxseed oil, hempseed oil and walnut oil."}, {"url": "http://www.webmd.com/food-recipes/anti-inflammatory-diet-road-to-good-health?page=2", "passage_text": "Specifics vary from diet to diet, but in general anti-inflammatory diets suggest: 1  Eat plenty of fruits and vegetables. 2  Minimize saturated and trans fats. 3  Eat a good source of omega-3 fatty acids, such as fish or fish oil supplements and walnuts. 4  Watch your intake of refined carbohydrates such as pasta and white rice."}]