[{"url": "https://answers.yahoo.com/question/index?qid=20110723133318AACVgJC", "passage_text": "Answers. Best Answer: INSTANT POPULARITY Grant Wood’s American Gothic caused a stir in 1930 when it was exhibited for the first time at The Art Institute of Chicago and awarded a prize of 300 dollars. "}, {"url": "https://en.wikipedia.org/wiki/American_Gothic", "passage_text": "Wood's inspiration came from what is now known as the American Gothic House, and his decision to paint the house along with the kind of people I fancied should live in that house.. The painting shows a farmer standing beside a woman that has been interpreted to be either his wife or his daughter. "}, {"url": "http://www.npr.org/templates/story/story.php?storyId=4748148", "passage_text": "The Grant Wood painting American Gothic is a touchstone of American culture, depicting an upright Midwestern family on the farm. The story behind the painting is the subject of Thomas Hoving's book American Gothic: The Biography of Grant Wood's American Masterpiece. "}, {"url": "http://www.americangothichouse.net/about/the-painting/", "passage_text": "Although Wood had intended for some time to do a “portrait” of Midwestern “types,” it is known that the house in Eldon, Iowa inspired the painting Wood called American Gothic, because only the house is shown in surviving preliminary sketches for the painting. Wood’s free use of “reality” can also be seen by the addition of a barn and by creating a scene—a man and woman posed in front of the house—which never occurred. The models for the artwork never posed together when they were drawn prior to, or during the painting of American Gothic."}, {"url": "http://totallyhistory.com/american-gothic/", "passage_text": "American Gothic is a painting by American artist Grant Wood in 1930. Shown is a farmer and his spinster daughter in front of their house. The models on the painting were Wood’s sister, Nan, wearing a colonial print apron mimicking 19th century Americana, and Wood’s dentist, Dr. Byron McKeeby from Iowa. "}, {"url": "https://en.wikipedia.org/wiki/Grant_Wood", "passage_text": "Wood's best known work is his 1930 painting American Gothic, which is also one of the most famous paintings in American art, and one of the few images to reach the status of widely recognised cultural icon, comparable to Leonardo da Vinci 's Mona Lisa and Edvard Munch 's The Scream. "}, {"url": "http://www.pbs.org/wgbh/sisterwendy/works/ame.html", "passage_text": "Grant Wood's American Gothic has been part of the Art Institute of Chicago's Department of Modern and Contemporary Art since he debuted it there in 1930. The AIC's modern art collection is considered one of the best and most comprehensive in the world. The Art Institute of Chicago Grant Wood, American (1891-1942) 1930 Oil on beaverboard 29 1/4 x 24 5/8 in. (74.3 x 62.4 cm) Friends of American Art Collection Acquired in 1930."}, {"url": "http://www.artic.edu/aic/collections/artwork/6565", "passage_text": "American Art. Gallery 263. This familiar image was exhibited publicly for the first time at the Art Institute of Chicago, winning a three-hundred-dollar prize and instant fame for Grant Wood. The impetus for the painting came while Wood was visiting the small town of Eldon in his native Iowa. 32. Wanda M. Corn, The Birth of a National Icon: Grant Wood's American Gothic, The Art Institute of Chicago Centennial Lectures, Museum Studies 10 (Art Institute of Chicago/Contemporary Books, Inc., 1983), pp. 253-275, fig."}, {"url": "http://www.artic.edu/aic/collections/exhibitions/Modern/American-Gothic", "passage_text": "78 x 65.3 cm (30 3/4 x 25 3/4 in.). Signed and dated lower right on overalls: GRANT / WOOD / 1930. Friends of American Art Collection, 1930.934. Grant Wood’s American Gothic caused a stir in 1930 when it was exhibited for the first time at the Art Institute of Chicago and awarded a prize of 300 dollars. Newspapers across the country carried the story, and the painting of a farm couple posed before a white house brought the artist instant fame. "}, {"url": "http://www.americangothichouse.net/about/the-painting/", "passage_text": "The Painting. American Gothic, 1930 by Grant Wood. All rights reserved Wood Graham Beneficiaries/Licensed by VAGA, New York, NY. When viewing the painting, it is important to realize the extent to which Wood designed and conceptualized American Gothic. At first look, many believe American Gothic is a realistic painting, and in a sense this is true. Wood’s free use of “reality” can also be seen by the addition of a barn and by creating a scene—a man and woman posed in front of the house—which never occurred. The models for the artwork never posed together when they were drawn prior to, or during the painting of"}]