[{"url": "http://nutrition.jbpub.com/resources/animations.cfm?id=1&", "passage_text": "Segmentation is a muscular movement that occurs in the small intestine. The alternating forward and backward movements of segmentation further mix the partially digested food and digestive juices and bring this mixture (called chyme) into contact with the intestinal wall. "}, {"url": "http://www.biology.lifeeasy.org/468/compare-peristalsis-and-segmentation", "passage_text": "The functions of peristalsis and segmentation are different. Peristalsis-Propels the contents of the lumen onward, one way motion, moves food through a sphincter into the stomach, symmetrical contraction and relaxation of muscles, occurs in all parts of the GI. "}, {"url": "http://study.com/academy/lesson/movement-through-the-small-intestine-peristalsis-segmentation-pendular-movement.html", "passage_text": "Segmentation is a localized contraction of circular smooth muscles that constricts the intestine into segments. Pendular movements are alternating contraction and relaxation of the longitudinal muscles causing a portion of the small intestine to shorten and lengthen. To unlock this lesson you must be a Study.com Member. Peristalsis moves food along the small intestine, but we also see two other movements within the organ. While these two movements do not push the food along the tract like peristalsis, they do mix the chyme with the digestive juices and bring particles of food into contact with the wall where they can be absorbed."}, {"url": "http://study.com/academy/lesson/movement-through-the-small-intestine-peristalsis-segmentation-pendular-movement.html", "passage_text": "The small intestine is an important organ for digestion and absorption of nutrients. In this lesson you will learn about the enterogastric reflex. You will also learn how intestinal movements, such as peristalsis, segmentation, and pendular movement, improve digestion and absorption. Peristalsis moves food along the small intestine, but we also see two other movements within the organ. While these two movements do not push the food along the tract like peristalsis, they do mix the chyme with the digestive juices and bring particles of food into contact with the wall where they can be absorbed."}, {"url": "http://www.answers.com/Q/Define_segmentation_as_in_digestive_system", "passage_text": "The Digestion System is comprised of many organs in your body such as your stomach, mouth, esophagus, and your two intestines. The main functions of the digestive system is … to digest the foods you eat, absorbs those nutrients from the foods you eat, and disposes of the waste product (poop). The digestive system refers to the system from the mouth to the  bowels. It is the system that the body used to draw nutrients from  food and to eliminate waste. The digestive system is the path that the food taht you eat follows so that your body can get all of the nutrients out of it."}, {"url": "http://www.merriam-webster.com/dictionary/segmentation", "passage_text": "Medical Definition of SEGMENTATION. 1. : the act or process of dividing into segments; especially: the formation of many cells from a single cell (as in a developing egg). 2. : annular contraction of smooth muscle (as of the intestine) that seems to cut the part affected into segments—compare peristalsis. Full Definition of SEGMENTATION. : the process of dividing into segments; especially: the formation of many cells from a single cell (as in a developing egg). See segmentation defined for English-language learners. See segmentation defined for kids. ADVERTISEMENT."}, {"url": "http://www.answers.com/Q/Define_segmentation_as_in_digestive_system", "passage_text": "The two main types of digestion is chemical and physical digestion. Physical digestion is the physical breakdown of food, using your teeth, called mastication. Chemical digestion uses different fluids and chemicals in your body to break down the food further, such as pepsin and hydrochloric acid. The digestive system refers to the system from the mouth to the  bowels. It is the system that the body used to draw nutrients from  food and to eliminate waste. The digestive system is the path that the food taht you eat follows so that your body can get all of the nutrients out of it."}, {"url": "http://www.biology-online.org/dictionary/Segmentation", "passage_text": "Supplement. In zoology, segmentation refers to the division of a body part into segments. It may be homomeric segmentation in which the segments are more or less the same, or heteromeric segmentation wherein the segments differ from one another. Word origin: Latin segmentum + atio (process). Related term(s): 1  Segment. noun, plural: segmentation. (1) (embryology) Cleavage, i.e. the repeated division of a fertilized ovum forming blastomeres. (2) (zoology) The division of animal or plant body into repetitive segments; metamerism or the state of developing segments or a series of repeating parts."}, {"url": "http://pathwayofasandwich.weebly.com/segmentation.html", "passage_text": "1 As a result of segmentation; a process by which some physical digestion occurs in the small intestine, the chime sloshes back and forth between segments of the small intestine that form when bands of circular muscle briefly contract. 2  A helpful animation that outlines the process of peristalsis and segmentation. 1 This image illustrates the segmentation of the chyme that occurs within the small intestine of the digestive tract. 2  Segmentation is the process of mixing the food contents in the digestive tract to create a more uniform mixture throughout."}]