[{"url": "http://www.biology-online.org/dictionary/Cell_wall", "passage_text": "Cell wall. Definition. noun, plural: cell walls. A membrane of the cell that forms external to the cell membrane whose main role is to give cells rigidity, strength and protection against mechanical stress. It is found in cells of plants, bacteria, archaea, fungi, and algae. Animals and most protists do not have cell walls. "}, {"url": "http://dictionary.kids.net.au/word/cell_wall", "passage_text": "Dictionary. Definition of cell wall. a thin membrane around the cytoplasm of a cell; controls passage of substances in and out of the cellSimilar Words: cell membrane, cytomembrane, plasma membrane Part Meronyms: cell. Similar Words: cell membrane, cytomembrane, plasma membrane Part Meronyms: ce"}, {"url": "http://www.kidsbiology.com/biology_basics/cells_tissues_organs/cell_wall6.php", "passage_text": "What would happen if the cells in your body had cell walls? If an animal's body were made of plant cells, the animal would be very stiff and unable to move easily. Instead of cell walls, animals use other creative solutions to give them strength. For example, many animal's bodies are built on a structure of bones. The first cell structure we will explore is the cell wall. Found only in plant cells, the cell wall provides the cell with additional strength. Cell walls are thick walls built around the cell."}, {"url": "http://www.biology4kids.com/files/cell_main.html", "passage_text": "Plant cells are easier to identify because they have a protective structure called a cell wall made of cellulose. Plants have the wall; animals do not. Plants also have organelles such as the green chloroplast or large, water-filled vacuoles. Chloroplasts are the key structure in the process of photosynthesis. In larger organisms, the main purpose of a cell is to organize. Cells hold a variety of pieces and each cell type has a different purpose. By dividing responsibilities among different groups of cells, it is easier for an organism to survive and grow."}, {"url": "http://www.merriam-webster.com/dictionary/cell%20wall", "passage_text": "Definition of CELL WALL for Kids. : the firm outer nonliving layer that surrounds the cell membrane and encloses and supports the cells of most plants, bacteria, and fungi. noun. Definition of CELL WALL. : the usually rigid nonliving permeable wall that surrounds the plasma membrane and encloses and supports the cells of most plants, bacteria, fungi, and algae — see cell illustration. See cell wall defined for kids. ADVERTISEMENT."}, {"url": "http://www.kidsbiology.com/biology_basics/cells_tissues_organs/cell_membrane7.php", "passage_text": "Found in both plant and animal cells, the cell membrane is the outside wall of a cell. In plant cells, it is a second wall, and is found just inside the main cell wall. The cell membranes found in animal cells contain a chemical called cholesterol. This chemical makes the membrane harder. Plant cells do not need cholesterol because they have a cell wall, as a result, their cell membranes are softer."}, {"url": "http://dictionary.kids.net.au/word/cell_membrane", "passage_text": "Definition of cell membrane. a thin membrane around the cytoplasm of a cell; controls passage of substances in and out of the cellSimilar Words: cell wall, cytomembrane, plasma membrane Part Meronyms: cell. Similar Words: cell wall, cytomembrane, plasma membrane Part Meronyms: cell. "}, {"url": "http://www.biology4kids.com/files/cell_wall.html", "passage_text": "Cell walls made of cellulose are only found around plant cells and a few other organisms. Cellulose is a specialized sugar that is classified as a structural carbohydrate and not used for energy. If a plant cell is like a water balloon, the cell wall is like a cardboard box that protects the balloon. Fungi and some ptotozoa also have cell walls. They are not the same as the plant cell walls made of cellulose. The other walls might be made from proteins or a substance called chitin. Chitin is another structural carbohydrate."}, {"url": "http://www.merriam-webster.com/dictionary/cell%20wall", "passage_text": ": the firm outer nonliving layer that surrounds the cell membrane and encloses and supports the cells of most plants, bacteria, and fungi. Definition of CELL WALL. : the usually rigid nonliving permeable wall that surrounds the plasma membrane and encloses and supports the cells of most plants, bacteria, fungi, and algae — see cell illustration. See cell wall defined for kids. ADVERTISEMENT."}]