[{"url": "http://www.besthealthmag.ca/best-you/diabetes/8-signs-your-child-may-have-type-1-diabetes/", "passage_text": "By Lisa Bendall. Over 300,000 Canadians have type 1 diabetes, yet when your own child is diagnosed with this disease, it can come as a shock. “Most kids who get diabetes do not have another family member with it,” points out diabetes specialist Dr. Maureen Clement in Vernon, B.C. “Often, it’s just a bolt of lightning.”"}, {"url": "http://www.endocrineweb.com/conditions/type-1-diabetes/type-1-diabetes-symptoms", "passage_text": "If you notice any of these signs or symptoms, it’s possible that you have (or your child has) type 1 diabetes. A doctor can make that diagnosis by checking blood glucose levels. There are also signs of type 1 diabetes. Signs are different from symptoms in that they can be measured objectively; symptoms are experienced and reported by the patient. Signs of type 1 diabetes include:"}, {"url": "http://www.endocrineweb.com/conditions/type-1-diabetes/type-1-diabetes-symptoms", "passage_text": "Here’s why symptoms seem to develop suddenly: something triggers the development of type 1 diabetes (researchers think it’s a viral infection—read this article on what causes type 1 diabetes, and the body loses its ability to make insulin. There are also signs of type 1 diabetes. Signs are different from symptoms in that they can be measured objectively; symptoms are experienced and reported by the patient. Signs of type 1 diabetes include:"}, {"url": "http://www.diabetes.org/diabetes-basics/diagnosis/", "passage_text": "If your doctor determines that your blood glucose level is very high, or if you have classic symptoms of high blood glucose in addition to one positive test, your doctor may not require a second test to diagnose diabetes. "}, {"url": "http://www.endocrineweb.com/conditions/type-1-diabetes/type-1-diabetes-symptoms", "passage_text": "Continue ReadingType 1 Diabetes Causes. Type 1 diabetes develops gradually, but the symptoms may seem to come on suddenly. If you notice that you or your child have several of the symptoms listed below, make an appointment to see the doctor. There are also signs of type 1 diabetes. Signs are different from symptoms in that they can be measured objectively; symptoms are experienced and reported by the patient. Signs of type 1 diabetes include:"}, {"url": "http://www.mayoclinic.org/diseases-conditions/type-1-diabetes-in-children/basics/symptoms/CON-20029197", "passage_text": "Talk to your child's doctor if you notice any of the signs or symptoms of type 1 diabetes — increased thirst and frequent urination, extreme hunger, weight loss, blurred vision, or fatigue. 1  Definition. 2  Causes. When to see a doctor. "}, {"url": "http://ezinearticles.com/?How-Do-I-Know-If-My-Child-Has-Diabetes?&id=3173048", "passage_text": "1 1 2 1. When you look at a kid with diabetes, you can never tell if they have it, since they look pretty healthy on the outside. Early detection of diabetes helps to prevent fatal complications that occur for kids with diabetes. The disease brings about a high level of glucose in the blood. One of the causes of diabetes is the lack of insulin in the blood. Children with diabetes, have an abnormal pancreas. The pancreas is unable to produce enough insulin needed by the body and in some cases, not being able to produce any insulin at all."}, {"url": "http://www.besthealthmag.ca/best-you/diabetes/8-signs-your-child-may-have-type-1-diabetes/", "passage_text": "However, if you notice signs your child might have the disease, you can take action to prevent a serious complication called diabetic ketoacidosis (DKA) , in which the body runs out of insulin to process sugar and begins to break down fat instead. Over 300,000 Canadians have type 1 diabetes, yet when your own child is diagnosed with this disease, it can come as a shock. “Most kids who get diabetes do not have another family member with it,” points out diabetes specialist Dr. Maureen Clement in Vernon, B.C. “Often, it’s just a bolt of lightning.”"}]