[{"url": "http://www.whitegoodstradeassociation.org/index.php/for-public-mainmenu-43/how-long-should-it-last-", "passage_text": "We are often asked how long a washing machine, washer dryer, fridge freezer, dishwasher and so on should last and the simple answer to this question is that there is no set time that any product should last. It is proper to point out in the first instance that there is no guarantee of durability in law. "}, {"url": "https://answers.yahoo.com/question/index?qid=20080212224645AAi2Osf", "passage_text": "Report Abuse. i'm sure modern dishwashers don't last as long as they used too ..... i think you could expect a good ten years from it if you used it every day. Source(s): http://www.dishwasher-review.com/sears-k... I would say that the average large appliance should last anywhere from 10 to 20 years, but I would change in 10 so there wont be coast in fixing."}, {"url": "http://money.usnews.com/money/personal-finance/articles/2014/05/05/how-long-should-your-household-purchases-last", "passage_text": "The foundation and frame of your house should last a lifetime if they were properly built. And while the walls should also last the lifetime of the house, aluminum windows are only expected to hang around for 15 to 20 years. Wooden windows should last as long as 30 years. Your garage door opener won't have as lucky of a fate, however. Expect it to last 10 to 15 years"}, {"url": "http://homeguides.sfgate.com/long-should-dishwasher-last-average-91045.html", "passage_text": "Life Expectancy Numbers. The typical dishwasher can be expected to last between seven and 12 years, with the average working expectancy being nine to 10 years. Certain factors, such as cost, quality, brand, care, maintenance and frequency of usage, can affect the life expectancy of a dishwasher. While your particular model may last for a longer or shorter duration than the average expectancy, it is good to have an idea of the average time you can expect your appliance to last. This will give you an idea of when the dishwasher will need to be replaced and help you to budget accordingly"}, {"url": "http://blogs.hrblock.com/2013/10/21/the-life-expectancy-of-7-major-appliances/", "passage_text": "I’m wondering if manufacturers have taken such numbers into consideration and as a result take efforts to make sure your appliance does not last that long. Imagine no return customers for 10 to 15 years :/. The longest my major appliances have last with exception of my dishwasher and garbage disposal is 7-8 years. "}, {"url": "http://www.cbsnews.com/news/kitchen-appliances-how-long-do-they-last/", "passage_text": "A couple of years ago the NAHB, along with Bank of America, put out some research entitled the Study of Life Expectancy of Home Components. According to the results, the average lifespan for a modern dishwasher is just nine years. Although my Maytag was working well up until the accident, I purchased it back in 2001 and it appears to be bumping up against its expiration date. Fortunately, the contractor's insurance should cover the structural damage. But I still need to either fix my appliance -- which will cost me a couple hundred dollars -- or buy a new one, which could run as high as $900. (I know some models are less, but I want something that matches the stove.)."}, {"url": "http://www.shopyourway.com/questions/1081060", "passage_text": "Hi, That greatly depends on the brand and the built of the appliance. First of all the warranty claim will clue you up on how long it is supposed to last. Usually, 7-10 years is the lifespan of this appliance. I attached the link below."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20080805062551AAYkwuZ", "passage_text": "Best Answer: Hi! I've had my US Maytag dishwasher JetClean do well for almost 10 years. I think they're supposed to last anywhere from 8-15 years, more or less, depending on how much you use it, probably. I don't know about the pumps, sorry. If you suscribe to Consumer Reports, maybe they would have info on that. How long do the pumps usually last in Maytag’s and is this good value? I think she payed £600 new it’s in good condition apart from a few cracks on the lcd buttons and display."}]