[{"url": "http://www.petsandparasites.org/dog-owners/heartworms/", "passage_text": "Ask your veterinarian about heartworm prevention. Preventive treatment should begin at 6 or 8 weeks of age in puppies and after tests have been conducted in older dogs to determine if your dog has already been infected. An annual blood test should be run to confirm the dog continues to be negative for heartworms."}, {"url": "http://www.web-dvm.com/2012/08/14/when-should-my-puppy-start-heartworm-prevention/", "passage_text": "I like to start heartworm prevention at some point during the puppy series of vaccines (8-10 weeks of age). The puppies do not have to be tested first because the life cycle has not had time to develop. Past 6-7 months of age, the dog should be tested prior to starting heartworm prevention."}, {"url": "http://www.fda.gov/AnimalVeterinary/ResourcesforYou/AnimalHealthLiteracy/ucm188470.htm", "passage_text": "Inside a dog, a heartworm’s lifespan is five to seven years. Adult heartworms look like strands of cooked spaghetti, with males reaching about 4 to 6 inches in length and females reaching about 10 to 12 inches in length. The number of worms living inside an infected dog is called the worm burden."}, {"url": "http://www.petsandparasites.org/dog-owners/heartworms/", "passage_text": "Preventive treatment should begin at 6 or 8 weeks of age in puppies and after tests have been conducted in older dogs to determine if your dog has already been infected. If your dog does have heartworms, your veterinarian can advise you about treatment options."}, {"url": "http://pets.thenest.com/give-heartworm-meds-dog-4321.html", "passage_text": "Age. Puppies should begin getting heartworm treatment at around the time they are weaned, usually around 6 to 8 weeks. Consult your vet before starting a puppy on heartworm preventative treatment. Your veterinarian will need to test your puppy or dog for heartworms before beginning"}, {"url": "http://www.drsfostersmith.com/pic/article.cfm?aid=582", "passage_text": "When should I start my puppy or kitten on a heartworm prevention program? Some heartworm preventives can be given to puppies as young as 4 weeks of age, and kittens at 6 weeks of age. Consult with your veterinarian and consider the preventive you choose. Pay close attention to the medication's label and follow the manufacturer's guidelines."}, {"url": "http://www.petplace.com/article/dogs/dr-debras-faqs-and-posts/ask-dr-debra-common-questions/when-should-my-puppy-go-on-heartworm-prevention", "passage_text": "Most heartworm preventatives are given to puppies over 6 weeks of age and can be started anytime after that age. A blood test is required prior to starting heartworm prevention if the puppy is more than 6 months old."}]