[{"url": "http://www.simplyrecipes.com/recipes/how_to_make_perfect_hard_boiled_eggs/", "passage_text": "Heat the pot on high heat and bring the water to a full rolling boil. Adding a teaspoon of vinegar to the water may help keep egg whites from running out if an egg does crack while cooking. Also some people find adding 1/2 teaspoon of salt to the water helps prevent cracking as well as making the eggs easier to peel. If you need easy-to-peel eggs and you have fresh eggs, you might want to try steaming the eggs for 15 minutes. Pour an inch of water into a pot and insert a steamer basket.Bring to a boil."}, {"url": "http://www.momables.com/how-to-make-easy-to-peel-hard-boiled-eggs/", "passage_text": "1 Place the pan over high heat until it reaches a boil. 2  Turn off heat, cover and let it sit for 13 minutes. 3  After exactly 13 minutes, remove the eggs from the pan and place them in an ice-water bath and let them cool for five minutes. 4  Carefully crack the eggs shells (making sure the majority of the shell is cracked). 1 Turn off heat, cover and let it sit for 13 minutes. 2  After exactly 13 minutes, remove the eggs from the pan and place them in an ice-water bath and let them cool for five minutes. 3  Carefully crack the eggs shells (making sure the majority of the shell is cracked). 4  Gently begin removing the shells"}, {"url": "http://www.simplyrecipes.com/recipes/how_to_make_perfect_hard_boiled_eggs/", "passage_text": "If you are planning to make hard boiled eggs for Easter and want to make sure that the eggs are easy to peel, buy your eggs at least a week ahead of time (two weeks even better, they'll keep). If you need easy-to-peel eggs and you have fresh eggs, you might want to try steaming the eggs for 15 minutes. Pour an inch of water into a pot and insert a steamer basket.Bring to a boil. Place the eggs in the steamer basket, cover and steam for 15 minutes (more or less, check!"}, {"url": "http://www.ehow.com/how_4998747_boil-egg-perfectly-everytime.html", "passage_text": "1 Fill the pan with water, covering the eggs with roughly 1-inch of cold water. 2  Bring the eggs to a rolling boil over high heat. 3  Turn off the heat and cover the pan as soon as the water is boiling. 4  Remove the pan from the burner if you are using an electric stove. 5  Let your eggs sit for the required amount of time. "}, {"url": "http://www.marthastewart.com/354061/perfect-hard-boiled-eggs", "passage_text": "Directions. Place eggs in a large saucepan. Cover them with cool water by 1 inch. Slowly bring water to a boil over medium heat; when the water has reached a boil, cover and remove from heat. Let sit 12 minutes. Transfer eggs to a colander; place under cool running water to stop the cooking. Eggs can be peeled and served immediately."}, {"url": "http://www.thekitchn.com/how-to-boil-eggs-perfectly-every-time-cooking-lessons-from-the-kitchn-202415", "passage_text": "1 Put the eggs in a pan of cold water: Place 6 cold eggs in a saucepan and fill with cold water, covering the eggs by an inch. 2  Bring the water to a rolling boil: Set the pan over high heat and bring the water to a boil, uncovered. 3  The water should come to a full, rolling boil. 4  Turn off the heat and cover the pan. Instructions. 1  Put the eggs in a pan of cold water: Place 6 cold eggs in a saucepan and fill with cold water, covering the eggs by an inch. 2  Bring the water to a rolling boil: Set the pan over high heat and bring the water to a boil, uncovered. 3  The water should come to a full, rolling boil."}, {"url": "http://www.thedailymeal.com/cook/how-hard-boil-eggs-and-peel-them-perfectly-every-time", "passage_text": "First, place the cold eggs in a single layer in a pan with enough cold water to cover them by about 1 inch. Then, place the pan on the stove over high heat. Shutterstock. As soon as the water comes to a boil turn the heat off, cover the pan, and remove it from the heat. Allow the eggs to sit in the water until they are cooked; about 9 minutes for a medium egg, 12 minutes for a large egg, and 15 minutes for an extra-large egg. "}, {"url": "http://www.foodnetwork.com/recipes/emeril-lagasse/perfectly-boiled-eggs-recipe.html", "passage_text": "Directions. Place the eggs in a saucepan and cover with water. Season with a pinch of salt. Place the pan over medium heat and bring to a boil. Cook for 2 minutes. Remove from heat and cover with a lid. Allow the eggs to sit for 11 minutes. Drain and cool the eggs for 2 minutes in ice water. Drain and peel the eggs. "}]