[{"url": "https://en.wikipedia.org/wiki/Mike_(Breaking_Bad)", "passage_text": "Michael Mike Ehrmantraut is a fictional character in Breaking Bad and its prequel spin-off series Better Call Saul. He is portrayed in both series by Jonathan Banks. After Walt kills two dealers working for Gus, Mike sets out to find Jesse. He intimidates Saul into giving him information on Jesse's whereabouts, but Saul deftly slips him a fake address. The next day, Mike is suddenly told that he and Victor, another of Gus' henchmen, must kill Walt."}, {"url": "http://www.eonline.com/news/341131/breaking-bad-recap-all-mike-wants-is-to-die-in-peace", "passage_text": "Last week on Breaking Bad, we witnessed a bit of an exodus in terms of Walt's (Bryan Cranston) coworkers. After the dramatic train heist of two episodes ago—you know, the one that culminated with a very young boy getting shot in the head, Jesse (Aaron Paul) no longer wants to be in the game. Walt gets the bag for him, and the two of them meet in the desolate desert. They have an argument. Walt wants the names of everyone Mike used to pay off. Mike won't give them to him, and says the only way out is to flee town."}, {"url": "http://www.rollingstone.com/movies/lists/breaking-bad-bloodshed-walter-white-and-companys-10-best-kills-20130805/mike-ehrmantraut-season-5-episode-7-say-my-name-19691231", "passage_text": "Ursula Coyote/AMC. The murder of Mike, the grandfatherly fixer who reluctantly helped Walt set up his nascent drug empire, is a study in contradictions. It's Walt's single nastiest, most vindictive, most pointless kill – he shoots Mike in the gut because the man pissed him off, pretty much. "}, {"url": "http://breakingbad.wikia.com/wiki/Mike_Ehrmantraut", "passage_text": "Walt, who is there with Jesse offers an exchange. Walt, after demanding Mike's nine names is refused by Mike who shouts at Walt that all the disasters that have occurred since he killed Gus are his fault due his pride and ego; in a fit of rage Walt shoots him. Mike manages to escape only a few yards down a river bank because of his bullet wound."}, {"url": "http://breakingbad.wikia.com/wiki/Mike_Ehrmantraut", "passage_text": "Mike, Walt, and Jesse deal with Declan. Mike says goodbye to Jesse. Mike works with a lawyer, but the attempt to quit goes bad when his lawyer is caught putting money into his nine former co-workers boxes. His money is taken and as a last ditch effort Mike asks Saul to get his money he stashed in an airport car. Walt, after demanding Mike's nine names is refused by Mike who shouts at Walt that all the disasters that have occurred since he killed Gus are his fault due his pride and ego; in a fit of rage Walt shoots him. Mike manages to escape only a few yards down a river bank because of his bullet wound."}, {"url": "http://breakingbad.wikia.com/wiki/Mike_Ehrmantraut", "passage_text": "―Mike Ehrmantraut talking about his mistakes in the past. Michael Mike Ehrmantraut was a former crooked Philadelphia police officer who worked as the Head of Corporate Security at Los Pollos Hermanos, hit man, consigliere, enforcer and second-in-command in Gustavo Fring 's crystal meth operation. Walt, after demanding Mike's nine names is refused by Mike who shouts at Walt that all the disasters that have occurred since he killed Gus are his fault due his pride and ego; in a fit of rage Walt shoots him. Mike manages to escape only a few yards down a river bank because of his bullet wound."}, {"url": "http://www.cnn.com/2013/09/30/showbiz/breaking-bad-finale/index.html", "passage_text": "11 photos: Memorable moments from 'Breaking Bad'. Memorable moments from 'Breaking Bad' – In this dramatic Season 4 showdown, Gus takes Jesse and loyal henchman Mike Ehrmantraut (Jonathan Banks) to Mexico to meet with the vicious leader of a drug cartel. 11 photos: Memorable moments from 'Breaking Bad'. Memorable moments from 'Breaking Bad' – Walt's brother-in-law Hank (Dean Norris), a DEA agent, tracks down the RV that Walt and Jesse have been using as a meth lab, trapping Walt and Jesse, who are hiding inside."}, {"url": "http://www.huffingtonpost.com/maureen-ryan/breaking-bad-recap-walt_b_1832262.html", "passage_text": "Posted: 08/27/2012 1:41 am EDT Updated: 08/11/2013 7:19 pm EDT. AMC. Note: Do not read on unless you've seen Season 5, Episode 7 of AMC's Breaking Bad, entitled Say My Name.. It's bullsh*t every time! -- Jesse. We all knew that the partnership between Walt White and Mike Ehrmantraut was never going to work. "}, {"url": "https://en.wikipedia.org/wiki/Mike_(Breaking_Bad)", "passage_text": "Mike's first appearance in Breaking Bad isn't until the final episode of season 2. After Jesse Pinkman 's girlfriend Jane Margolis overdoses on heroin, Walter White calls Saul for advice; in response, Saul sends Mike to destroy all evidence that could link Jane to Walt or Jesse. After Walt kills two dealers working for Gus, Mike sets out to find Jesse. He intimidates Saul into giving him information on Jesse's whereabouts, but Saul deftly slips him a fake address. The next day, Mike is suddenly told that he and Victor, another of Gus' henchmen, must kill Walt."}]