[{"url": "http://www.ourbabynamer.com/meaning-of-Aimery.html", "passage_text": "Aimery in Nautical Flags. French names have similar origins to those of other old-world European nations. They are often derivations of place names or trade names, or have their basis in history, mythology, religion or nature. They may also be created name"}, {"url": "http://www.babynamespedia.com/meaning/Aimery", "passage_text": "[ 3 syll. ai-me-ry, aim-ery ] The baby boy name Aimery is pronounced EY-Meh-Riy- †. Aimery is of Germanic origin and it is used mainly in French. Aimery's meaning is 'king of work'. In addition, Aimery is a French form of the English Emery. Aimery is a widely used name; it has 23 forms. Forms include Aime, Aimerea, Aimeree, Aimerey, Aimeri, Aimeric, Aimerie, Aimoree, Aimorey, Aimori, Aimorie, Aimory, Ameree, Amerey, Ameri, Americ, Amerie, Amery, Aymerey, Aymeri, Aymeric, Aymerie, and Aymery. Aimery is not popular as a baby name for boys. It is not in the top 1000 names. Out of the group of boy names directly related to Aimery, Emery was the most frequently used in 2012"}, {"url": "http://www.thinkbabynames.com/meaning/1/Aimery", "passage_text": "Aimery /aim-ery/ [3 sylls.] as a boys' name is of Old German origin, and the meaning of Aimery is king of work. French name. Aimery is pronounced similarly to Aimory, Amery, Amory, Emery ▼ and Emmery. Other recommended similar baby names are Amer, Ammer, Amry and Aymer. These names tend to be more commonly used than Aimery."}, {"url": "http://www.thinkbabynames.com/meaning/1/Aimery", "passage_text": "Aimery is an uncommon first name for males. Aimery is also a unique last name for all people. (2000 U.S. Census). Presented below is the birth name popularity of Aimery for boys. Aimery has not been recorded in the list thus far. Aimery is pronounced similarly to Aimory, Amery, Amory, Emery ▼ and Emmery. Other recommended similar baby names are Amer, Ammer, Amry and Aymer. These names tend to be more commonly used than Aimery."}, {"url": "http://www.thinkbabynames.com/meaning/1/Amery", "passage_text": "Amery is an unusual given name for men but a somewhat prominent surname for both adults and children (#94227 out of 150436, Top 63%). (2000 U.S. Census). Amery /ame-ry/ [3 sylls.] as a boys' name is of Old German derivation, and Amery means brave power. Amery is an alternate spelling of Amory (Old German): transcription of Emery. Compare surname Amero"}, {"url": "http://www.ourbabynamer.com/meaning-of-Aimery.html", "passage_text": "It consists of 6 letters and 3 syllables and is pronounced Ai-me-ry. In the U.S. in 2014 less than 5 boys given the name. Less than 5 girls were given the name. View the Aimery Name Popularity Page to see how the popularity trend for Aimery has changed since 1880, or to compare the popularity of Aimery to other names. French names have similar origins to those of other old-world European nations. They are often derivations of place names or trade names, or have their basis in history, mythology, religion or nature."}, {"url": "http://www.thinkbabynames.com/meaning/1/Amery", "passage_text": "Amery is alike in pronunciation to Aimerey, Aimery, Amaury, Amerey, Amiri, Aymery and Omero. Other suggested similar baby names are Ameer, Ameir, Amer, Amir ▲ , Ammer, Amor, Amr, Avery ▲ and Aymer. Amery /ame-ry/ [3 sylls.] as a boys' name is of Old German derivation, and Amery means brave power. Amery is an alternate spelling of Amory (Old German): transcription of Emery. Compare surname Amero"}]