[{"url": "http://admissions.unt.edu/tuition-costs-aid", "passage_text": "Graduate Students. The average annual cost of attendance for a Texas resident living on campus and enrolled in 9 hours per semester is $19,800. For out-of-state students, the average annual cost of attendance is $26,826. For out-of-state students, the average annual cost of attendance is $34,526"}, {"url": "http://admissions.unt.edu/tuition-costs-aid", "passage_text": "Undergraduate Students. The average annual cost of attendance for a Texas resident living on campus and enrolled in 15 hours per semester is $22,826. For out-of-state students, the average annual cost of attendance is $34,526. The average annual cost of attendance for a Texas resident living on campus and enrolled in 9 hours per semester is $19,800. For out-of-state students, the average annual cost of attendance is $26,826."}, {"url": "http://financialaid.unt.edu/costs", "passage_text": "Tuition and Fees-The average cost of tuition and fees for a typical student is based on enrolling for 30 hours per year. The actual costs that a student incurs will vary depending on the student’s degree or certificate program. The pages below provide estimates on the average annual cost of attendance for undergraduates and graduates. The Texas Higher Education Coordinating Board website has a Net Price Calculator that provides a rough estimation of costs to attend a Texas institution. 1  2015-2016 Academic Year-Eagle Express (2016 Cohort)"}, {"url": "http://financialaid.unt.edu/costs", "passage_text": "College Costs. The University of North Texas has been named one of America's 100 Best College Buys for 14 consecutive years and offers the quality of a private university at an affordable cost. The pages below provide estimates on the average annual cost of attendance for undergraduates and graduates. The Texas Higher Education Coordinating Board website has a Net Price Calculator that provides a rough estimation of costs to attend a Texas institution. 1  2015-2016 Academic Year-Eagle Express (2016 Cohort)"}, {"url": "http://admissions.utexas.edu/tuition/cost-of-attendance", "passage_text": "Tuition & Fees. The average cost of tuition and fees based on 12 hours per semester enrollment for undergraduate students and nine hours for graduate students (fall or spring), or nine hours of enrollment for undergraduate students and three hours for graduate students (summer). Definition"}, {"url": "http://www.collegefactual.com/colleges/university-of-north-texas/paying-for-college/room-and-board/", "passage_text": "University of North Texas offers students combined housing and dining options. The on-campus cost for a typical student was $7,355 in 2013 - 2014. The following table outlines average expected costs at University of North Texas for both on-campus and off-campus housing, meals and other expenses. The Total Comes to $50,757. On-campus housing and dining at University of North Texas has changed an average of 2.9% for each of the past five years. If current growth trends in room, board and other expenses continue, we expect this year's incoming freshmen to pay $12,156 their first year of college."}, {"url": "http://www.collegecalc.org/colleges/texas/university-of-north-texas/", "passage_text": "University of North Texas tuition is $6,904 per year for in-state residents. This is 7% more expensive than the national average public four year tuition of $6,429. The cost is $7,656 and 53% cheaper than the average Texas tuition of $14,560 for 4 year colleges. Tuition ranks 37th in Texas amongst 4 year colleges for affordability and is the 72nd most expensive 4 year college in the state. If attending from out-of-state, the tuition is $15,592 which represents a 126% premium. Annual Total Cost. The total list price for in-state Texas residents to go to UNT is $18,106 for the 2014/2015 academic year. Out-of-state students who don't possess Texas residence can expect a one year cost of $26,794."}]