[{"url": "http://homeguides.sfgate.com/grant-deed-used-for-1548.html", "passage_text": "A grant deed is a written instrument used in California for guaranteeing to a buyer that the buyer will bear no responsibility for any future unforeseen claims or encumbrances that may be charged against the property, as long as the claim pre-dates the buyer's property closing. The strongest guarantee for a buyer is if the grant deed stipulates that the seller maintains responsibility for any future claims that date prior to the closing, even those that pre-date the seller's owning of the property."}, {"url": "https://www.deeds.com/grant-deed/", "passage_text": "A grant deed is a legal document that is used to transfer (convey) rights in real property from one entity or person (the grantor) to another (the grantee). A grant, or bargain and sale deed, contains no express warranties against encumbrances. "}, {"url": "http://www.investopedia.com/terms/g/grant-deed.asp", "passage_text": "For example, an interspousal transfer grant deed is used to transfer ownership of real property from one spouse to another (often during a divorce). This type of transfer does not cause the property's value to be reassessed for property tax purposes. However a grant deed is the most common type of deed. DEFINITION of 'Grant Deed'. A legal document used to transfer ownership of real property."}, {"url": "https://en.wikipedia.org/wiki/Grant_deed", "passage_text": "From Wikipedia, the free encyclopedia. A grant deed is used in some states and jurisdictions for the sale or other transfer of real property from one person or entity to another person or entity. Each party transferring an interest in the property, or grantor, is required to sign it. (January 2008). A grant deed is used in some states and jurisdictions for the sale or other transfer of real property from one person or entity to another person or entity."}, {"url": "http://www.ehow.com/facts_5042285_grant-deed.html", "passage_text": "Save. The most common type of deed used in the selling of property is a grant deed. The grant deed is recorded in the county courthouse after a real estate sale and the buyer gets the original. "}, {"url": "http://finance.zacks.com/assignment-deed-trust-vs-deed-grant-deed-6233.html", "passage_text": "Grant Deed. A grant deed is used to transfer real estate ownership from one person to another. The transfer of ownership can be for a full parcel of real estate or just a portion of the real estate. Grant deeds are most often used in real estate sales between an unrelated buyer and seller. To transfer ownership rights in real estate, a grant deed is commonly used. When a loan is obtained to purchase real estate, a deed of trust is often used to give the lender rights in the real estate to secure repayment of the loan."}, {"url": "http://homeguides.sfgate.com/grant-deed-california-6816.html", "passage_text": "Form. To be legally effective, a grant deed must include certain basic information, including the name of the new owner, the signature of the person conveying title and a legal description of the property being conveyed by the deed. The person conveying title is the grantor, and the new owner is the grantee. California law allows the use of three different types of deeds to convey title to real estate. A grant deed is the middle-level deed because it includes more guarantees of title than a quitclaim deed but few guarantees than a warranty deed. The grant deed is also sometimes known as the special"}, {"url": "http://homeguides.sfgate.com/grant-deed-california-6816.html", "passage_text": "Like a quitclaim or warranty deed, the main purpose of the grant deed is to transfer property title from one person to another, such as from a seller to a buyer. A grant deed is written evidence that you actually own your property. California law allows the use of three different types of deeds to convey title to real estate. A grant deed is the middle-level deed because it includes more guarantees of title than a quitclaim deed but few guarantees than a warranty deed. The grant deed is also sometimes known as the special"}]