[{"url": "http://www.remedyland.com/2012/10/vvi-pacemaker.html", "passage_text": "VVI pacemaker is a medical instrument that allows to heart muscle to work properly. In the surgical procedure, a specialist cardiologist, incorporating VVI pacemaker into the chest wall and VVI pacemaker with wires connect to heart in the right upper heart chamber or on the right ventricle. VVI pacemaker is not sufficient when the ventricles are not able to beat together in the cases of congestive cardiac failure and then dual chamber pacemaker is required. Possible problems during implementation of VVI pacemakers are: 1  collapsed lung. 2  infection. 3  pericarditis. 4  air embolism."}, {"url": "https://en.wikipedia.org/wiki/Artificial_pacemaker", "passage_text": "The primary purpose of a pacemaker is to maintain an adequate heart rate, either because the heart's natural pacemaker is not fast enough, or because there is a block in the heart's electrical conduction system. In the first half of the tracing, pacemaker stimuli at 60 beats per minute result in a wide QRS complex with a right bundle branch block pattern. Progressively weaker pacing stimuli are administered, which results in asystole in the second half of the tracing."}, {"url": "http://patient.info/doctor/Pacemakers-and-Pacing", "passage_text": "A pacemaker in VVI mode denotes that it paces and senses the ventricle and is inhibited by a sensed ventricular event. The DDD mode denotes that both chambers are capable of being sensed and paced. 1  Persisting symptomatic bradycardia. Dual-site atrial pacing. 1  Newer pacing systems have two atrial leads, one in the right atrial appendage and the other either in the coronary sinus or at the os of the coronary sinus. 2  The ventricular lead is in the right ventricle, either at the apex or at the outflow tract."}, {"url": "http://allnurses.com/cardiac-nursing/pacemaker-codes-help-678068.html", "passage_text": "the second letter of your pacemaker is always the site where the sensing takes place. a = atrial, v = ventricular, d = atrial and ventricular. the letter o (sometimes referred to as zero) means there is no sensing possibility in the pacemaker in the way it is set now. voo-this means the pacemaker paces in the ventricle (v)(most often the right ventricle) and doesn't sense anything (o) and as a result there is no action in the third letter either (o). this pacemaker mode means you get ventricular pacing regardless of the own rhythm of the patient"}, {"url": "https://en.wikipedia.org/wiki/Artificial_pacemaker", "passage_text": "When the pacemaker does not detect a heartbeat within a normal beat-to-beat time period, it will stimulate the ventricle of the heart with a short low voltage pulse. This sensing and stimulating activity continues on a beat by beat basis. In the first half of the tracing, pacemaker stimuli at 60 beats per minute result in a wide QRS complex with a right bundle branch block pattern. Progressively weaker pacing stimuli are administered, which results in asystole in the second half of the tracing."}, {"url": "https://en.wikipedia.org/wiki/Artificial_pacemaker", "passage_text": "Transvenous pacing, when used for temporary pacing, is an alternative to transcutaneous pacing. A pacemaker wire is placed into a vein, under sterile conditions, and then passed into either the right atrium or right ventricle. The pacing wire is then connected to an external pacemaker outside the body. In the first half of the tracing, pacemaker stimuli at 60 beats per minute result in a wide QRS complex with a right bundle branch block pattern. Progressively weaker pacing stimuli are administered, which results in asystole in the second half of the tracing."}, {"url": "http://www.icufaqs.org/Pacemakers.doc", "passage_text": "A pacemaker is an electronic device that provides an electrical signal to make the heart beat when it’s own, built-in pacemakers fail. The anatomical, built-in pacemakers provide what’s called the “intrinsic” rhythm, and they can be disrupted by various conditions – ischemia for example, or by an MI. Pacemakers can be either temporary or permanent. The temporary pacemakers that we see in the MICU are made up of a control box and one single output wire leading to the inner wall of the RV (thus called a ventricular wire, or “V-wire”), and provide simple rate control by pacing the ventricles."}, {"url": "http://www.remedyland.com/2012/10/vvi-pacemaker.html", "passage_text": "The role of VVI pacemaker is that in the event that a heart is slowing down, or stop, sends an electrical impulse to the right ventricle and activates the heart. Electrical impulses from the right ventricle passes to the left ventricle and thereby runs the blood flow. VVI pacemaker is not sufficient when the ventricles are not able to beat together in the cases of congestive cardiac failure and then dual chamber pacemaker is required. Possible problems during implementation of VVI pacemakers are: 1  collapsed lung. 2  infection. 3  pericarditis. 4  air embolism."}]