[{"url": "http://study.com/become_a_chiropractor.html", "passage_text": "A Doctor of Chiropractic degree is required to work as chiropractor. However, candidates usually must first complete at least 90 credits of undergraduate coursework. Some states do not require a bachelor's degree to become licensed as a chiropractor, so individuals should check with the state board they wish to practice in."}, {"url": "http://www.wikihow.com/Be-a-Chiropractor", "passage_text": "2. Get a bachelor's degree from a four-year institution. You will need to have completed at least three years of undergraduate education in order to apply to a doctor of chiropractic program. You should have at least 90 semester hours in both liberal arts and science courses like physics, chemistry, and biology."}, {"url": "http://spineguys.com/why_chiropractic/education.asp", "passage_text": "Chiropractic college programs are rigorous and thorough. To attend, applicants must have a minimum two years undergraduate study at a university. Their chiropractic college education lasts four years, meaning they graduate with at least six years of full-time university-level education."}, {"url": "http://www.bls.gov/ooh/Healthcare/Chiropractors.htm", "passage_text": "Chiropractors must earn a Doctor of Chiropractic (D.C.) degree and a state license. Doctor of Chiropractic programs typically take 4 years to complete and require at least 3 years of undergraduate college education for admission. Education. Prospective chiropractors are required to have a Doctor of Chiropractic (D.C.) degree—a postgraduate professional degree that typically takes 4 years to complete. In 2012, there were 15 Doctor of Chiropractic programs on 18 campuses accredited by The Council on Chiropractic"}, {"url": "http://healthcareers.about.com/od/healthcareerprofiles/a/Chiropractor.htm", "passage_text": "Chiropractors typically graduate from an accredited chiropractic school. They do not have an MD or DO degree from a medical school; instead they earn a D.C. (Doctor of Chiropractic) degree. Currently, chiropractic candidates are not required to have a bachelor's degree before entering chiropractic school. However, many students do complete a bachelor's program, and a minimum of 90 semester hours of undergraduate coursework is required for acceptance into a chiropractic program. The chiropractic course is typically a total of four years, but some programs vary in length."}, {"url": "http://learn.org/articles/Chiropractor_5_Steps_to_Becoming_a_Chiropractor.html", "passage_text": "You need a license in all U.S. states and the District of Columbia to practice as a chiropractor. To be eligible for licensure you have to complete at least two years of postsecondary education and four years of chiropractic training at an accredited school. While some schools may offer a 5-year program and others offer 3+3 programs that combine a bachelor's degree with a doctorate, most Doctor of Chiropractic degree programs last four years. You need at least 4,200 hours of clinical, lab and classroom study to earn such a degree."}, {"url": "http://learn.org/articles/Chiropractor_5_Steps_to_Becoming_a_Chiropractor.html", "passage_text": "An undergraduate degree may either be a 2-year associate's degree or a 4-year bachelor's degree. However, to qualify for a chiropractic doctoral program you need 90 or more undergraduate credits in general education and must also complete courses in organic and inorganic chemistry, physics and biology. While some schools may offer a 5-year program and others offer 3+3 programs that combine a bachelor's degree with a doctorate, most Doctor of Chiropractic degree programs last four years. You need at least 4,200 hours of clinical, lab and classroom study to earn such a degree."}, {"url": "http://chiropracticschools.com/resources/degrees-in-chiropractic", "passage_text": "Degrees in Chiropractic. To become a chiropractor, one must earn a degree from an accredited school and become licensed by the state in which they wish to practice. Many states also require continuing education credits for chiropractors to maintain licensure. Chiropractors earn the doctor of chiropractic degree, or DC. Programs generally last between three and five years and students almost always are required to have a bachelor degree with an emphasis on science courses."}, {"url": "http://www.bls.gov/ooh/Healthcare/Chiropractors.htm", "passage_text": "Chiropractors must get a Doctor of Chiropractic (D.C.) degree and a state license. Doctor of Chiropractic programs typically take 4 years to complete and require at least 3 years of undergraduate college education for admission. Education. Prospective chiropractors are required to have a Doctor of Chiropractic (D.C.) degree—a postgraduate professional degree that typically takes 4 years to complete. In 2012, there were 15 Doctor of Chiropractic programs on 18 campuses accredited by The Council on Chiropractic"}, {"url": "http://www.ehow.com/facts_7458646_degree-do-need-become-chiropractor_.html", "passage_text": "Candidates need to have studied English, humanities, chemistry, biology, physics and psychology to be accepted into an accredited Doctor of Chiropractic Degree program, or they would need to study these as part of the program if they have a college degree other than an Associate or Bachelor of Science. massage therapy at the spa image by MAXFX from Fotolia.com. A chiropractor diagnoses and treats patients with musculoskeletal health problems, such as problems with the spine, and understands how these health issues impact a person's overall well-being."}]