[{"url": "http://www.accuweather.com/en/weather-news/three-ways-your-body-battles-w/19490777", "passage_text": "A cold and wet environment is the most dangerous because this scenario causes the most heat to escape the body and makes it more difficult for the body to replace lost heat. Regardless of weather conditions, the body will first exert its three major defense mechanisms in order to battle the cold. Lower temperatures bring forth new hurdles for the human body to conquer. Similar to how the body reacts to heat during the summer months, the body naturally reacts and attempts to acclimate itself to cold."}, {"url": "http://www.etisurvival.com/chil.htm", "passage_text": "Conduction. Any time the body cones in contact with a substance of lower temperature, heat is lost by way of conduction. This is why immersion in water is a very dangerous situation. During extremely cold conditions, the conduction from skin to metal is rapid and serious. "}, {"url": "http://www.answers.com/Q/How_does_the_human_body_keep_itself_warm_in_cold_temperatures", "passage_text": "There are a few actions your body takes to keep itself warm when it's cold. First your body shivers. this vibrating produces heat. If the cold persists and becomes extreme enough, your body moves the blood to the center of your body to keep your vital organs warm. Your capillaries constrict to allow less blood flow and less heat loss. That's why your fingers and nose get cold"}, {"url": "http://www.detrick.army.mil/ih/ehCold.cfm", "passage_text": "1 Vasoconstriction is the tightening of blood vessels in the skin when it is exposed to cold. 2  The reduced skin blood flow conserves body heat, but, it can lead to discomfort, numbness, loss of dexterity in hands and fingers, and eventually cold injuries. 3  Cold triggers shivering. 1 The reduced skin blood flow conserves body heat, but, it can lead to discomfort, numbness, loss of dexterity in hands and fingers, and eventually cold injuries. 2  Cold triggers shivering. 3  Shivering increases internal heat production which helps to offset the heat being lost."}, {"url": "http://www.answers.com/Q/What_are_ways_the_body_cools_itself_in_hot_weather_and_heats_itself_in_cold_weather", "passage_text": "This is a bodies way of trying to produce movement which in turn generates blood flow and heat transfer. In warm weather, the opposite happens. Hairs lie down and the arteries and veins nearer the skin fill up thereby letting heat energy conduct radiate out of the body. The body has pours. These secret sweat which acts as a cooling agaent."}, {"url": "http://www.ccohs.ca/oshanswers/phys_agents/heat_health.html", "passage_text": "Convection is the process by which the body exchanges heat with the surrounding air. The body gains heat from hot air and loses heat to cold air which comes in contact with the skin. Convective heat exchange increases with increasing air speed and increased differences between air and skin temperature. Exposure to more heat can cause health problems and may affect performance. As the temperature or heat burden increases, people may feel: 1  Increased irritability. 2  Loss of concentration and ability to do mental tasks. 3  Loss of ability to do skilled tasks or heavy work."}, {"url": "http://www.manythings.org/voa/health/4044.html", "passage_text": "If several of these conditions are present at the same time, a person's body temperature may rise above safe limits. The person loses large amounts of body water and salt in perspiration. Perspiration is one of the body's defenses against heat. It is how the body releases water to cool the skin. Most people suffer only muscle pain as a result of heat stress. The pain is a warning that the body is becoming too hot. Experts say heat waves often become dangerous when the nighttime temperature does not drop much from the highest daytime temperature. This causes great stress on the human body. Doctors say people can do many things to protect themselves from the dangers of extreme heat. Stay out of the sun, if possible."}, {"url": "http://www.accuweather.com/en/weather-news/three-ways-your-body-battles-w/19490777", "passage_text": "Temperatures are set to drop this week as arctic air plunges across much of the United States. Lower temperatures bring forth new hurdles for the human body to conquer. Similar to how the body reacts to heat during the summer months, the body naturally reacts and attempts to acclimate itself to cold. The most important factor in effectively battling and surviving in the cold is the body's ability to maintain its internal core temperature around 98.6 degre"}, {"url": "http://www.answers.com/Q/What_are_ways_the_body_cools_itself_in_hot_weather_and_heats_itself_in_cold_weather", "passage_text": "In cold weather, the arteries and veins nearer the skin have less blood passing through them and the ones further into the body have more thereby retaining heat. The hairs on most parts of your body also stand up to trap a layer of air for insulation. The body when cold frequenly shivers. In warm weather, the opposite happens. Hairs lie down and the arteries and veins nearer the skin fill up thereby letting heat energy conduct radiate out of the body. The body has pours. These secret sweat which acts as a cooling agaent."}, {"url": "http://www.accuweather.com/en/weather-news/three-ways-your-body-battles-w/19490777", "passage_text": "When the Body Hits its Limit: In extreme cases, during prolonged exposure to the cold, the body will be unable to naturally conserve heat and maintain its internal core temperature. This is when more serious and potentially life-threatening injuries can set in such as frostbite and hypothermia. Lower temperatures bring forth new hurdles for the human body to conquer. Similar to how the body reacts to heat during the summer months, the body naturally reacts and attempts to acclimate itself to cold."}]