[{"url": "http://healthyeating.sfgate.com/many-calories-carbs-should-women-day-3900.html", "passage_text": "Sedentary women between the ages of 19 and 30 should consume between 1,800 and 2,000 calories per day. Carbohydrates should account for 810 to 1,300 of your calories each day. As there are 4 calories in 1 gram of carbohydrates, this amounts to 202.5 to 325 grams of carbohydrates per day. As carbohydrates should account for 900 to 1,430 of these calories, you should eat 225 to 357.5 grams of carbs each day. If you are between the ages of 31 and 50, these values decrease to 2,000 calories and between 225 and 325 grams of carbs every day."}, {"url": "http://getfit.jillianmichaels.com/recommended-calories-per-day-women-1315.html", "passage_text": "Weight Loss. The minimum a woman should consume daily is 1,200 calories, according to Medline Plus. One pound of fat equals about 3,500 calories. To lose one pound a week, a woman should reduce her calories or increase her physical activity by 500 calories a day. To lose two pounds a week, a deficit of 1,000 calories is needed"}, {"url": "http://nihseniorhealth.gov/eatingwellasyougetolder/knowhowmuchtoeat/01.html", "passage_text": "A woman over age 50 should consume about. 1  1,600 calories a day if her level of physical activity is low (only performs activities associated with typical day-to-day life)\\. 2  1,800 calories daily if she is moderately active (walks the equivalent of 1.5 to 3 miles a day at 3 to 4 miles per hour). A person who eats 2,000 calories per day should eat 6 ounces of grain foods daily. At least half (3 ounces) of the grain foods eaten should be whole grains. Approximately one ounce of grain foods counts as a serving."}, {"url": "http://healthyeating.sfgate.com/many-calories-carbs-should-women-day-3900.html", "passage_text": "Moderately active women between the ages of 19 and 30 should try to eat 2,000 to 2,200 calories per day. As carbohydrates should account for 900 to 1,430 of these calories, you should eat 225 to 357.5 grams of carbs each day. If you are between the ages of 31 and 50, these values decrease to 2,000 calories and between 225 and 325 grams of carbs every day."}, {"url": "http://www.answers.com/Q/How_many_calories_should_a_woman_consume_daily", "passage_text": "2. If you need to lose weight, start by eating 300 to 500 fewer calories per day and engage in cardio exercise. (The FDA recommends that women should consume 1500 to 2000 calories a day depending on whether they need to lose weight or maintain weight.). 3. If this does not work for weight loss, count carbohydrates rather than calories or count both carbohydrates and calories"}, {"url": "http://www.medicalnewstoday.com/articles/245588.php", "passage_text": "The number of calories you need to eat each day depends on several factors, including your age, size, height, sex, lifestyle, and overall general health. As an example, a physically active 6ft 2in male, aged 22 years, requires considerably more calories than a 5ft 2ins sedentary woman in her 70s. It has been discovered that even factors such as how you eat your food can influence how many calories get into your system. 1 The longer you chew your food, the more calories your body retains. 2  Recommended daily calorie intakes in the US are 2,700 for men and 2,200 for women. 3  Eating a big breakfast could help with weight reduction and maintenance."}, {"url": "http://healthyeating.sfgate.com/many-calories-carbs-should-women-day-3900.html", "passage_text": "Women between the ages of 31 and 50 need slightly less, requiring 2,200 calories and 247.5 and 357.5 grams of carbohydrates each day. After the age of 50, active women should eat between 2,000 and 2,200 calories and 225 to 357.5 grams of carbohydrates each day. As carbohydrates should account for 900 to 1,430 of these calories, you should eat 225 to 357.5 grams of carbs each day. If you are between the ages of 31 and 50, these values decrease to 2,000 calories and between 225 and 325 grams of carbs every day."}, {"url": "http://www.answers.com/Q/How_many_calories_should_a_woman_consume_daily", "passage_text": "You should eat around 1,500 calories a day and you'll lose about 1 pound a week.   Also, consider that for your height you are already at a health weight, so congratulation … s! You must be doing something right already. If you need to lose weight, start by eating 300 to 500 fewer calories per day and engage in cardio exercise. (The FDA recommends that women should consume 1500 to 2000 calories a day depending on whether they need to lose weight or maintain weight.). 3."}, {"url": "http://healthyeating.sfgate.com/many-calories-carbs-should-women-day-3900.html", "passage_text": "The number of calories that a woman should consume each day varies with her age and level of physical activity. Regardless of these differences, the 2010 Dietary Guidelines for Americans recommends that carbohydrates account for 45 to 65 percent of your total calories. As carbohydrates should account for 900 to 1,430 of these calories, you should eat 225 to 357.5 grams of carbs each day. If you are between the ages of 31 and 50, these values decrease to 2,000 calories and between 225 and 325 grams of carbs every day."}, {"url": "http://healthyeating.sfgate.com/many-grams-fat-should-eat-day-lose-weight-5597.html", "passage_text": "Percent of Calories. The number of fat grams you should eat to lose weight depends on your total calorie intake during your weight loss program. According to the Institute of Medicine, consuming between 20 and 35 percent of your total calories from fat is a healthy amount. Fat Recommendations. To calculate the grams of fat you should eat each day to facilitate weight loss while staying healthy, take 20 and 35 percent of your total calorie needs—as recommended by the Institute of Medicine-- and divide by nine, since fat provides nine calories per gram."}]