[{"url": "http://www.howmuchisit.org/lung-cancer-treatment-cost/", "passage_text": "1 On average, the costs of lung cancer treatment hover around $1,500 to $3,200 per month without insurance. 2  Patients who survive through the first year incur the costs of initial treatment of around $26,000 for the first three months or $35,000 for the whole year. 1 Patients who survive through the first year incur the costs of initial treatment of around $26,000 for the first three months or $35,000 for the whole year. 2  Lung cancer patients who die incur the initial treatment cost and terminal care costs amounting to around $42,000."}, {"url": "http://health.costhelper.com/lung-cancer.html", "passage_text": "Discounts: 1  According to a study published in the international journal Lung Cancer, the failure of initial treatment is associated with markedly increased costs. 2  Patients needing additional rounds of treatment had total costs of $120,650, compared to $45,953 for those receiving initial treatment only. 1 One study on the economic burden of lung cancer estimates that the overall costs, from diagnosis to a maximum of two years thereafter, to be about $46,000."}, {"url": "http://www.howmuchisit.org/lung-cancer-treatment-cost/", "passage_text": "1 Newer cancer treatments can also cost as much as $10,000 for a month. 2  In addition, co-pays are often higher for cancer prescription drugs than those for other types of treatment. 3  According to a study done in 2002, the average price for the treatment of lung cancer was $39,891. 1 Patients who survive through the first year incur the costs of initial treatment of around $26,000 for the first three months or $35,000 for the whole year. 2  Lung cancer patients who die incur the initial treatment cost and terminal care costs amounting to around $42,000."}, {"url": "http://www.howmuchisit.org/lung-cancer-treatment-cost/", "passage_text": "1 It will also vary by the stage and histologic type. 2  On average, the costs of lung cancer treatment hover around $1,500 to $3,200 per month without insurance. 3  Patients who survive through the first year incur the costs of initial treatment of around $26,000 for the first three months or $35,000 for the whole year. 1 Patients who survive through the first year incur the costs of initial treatment of around $26,000 for the first three months or $35,000 for the whole year. 2  Lung cancer patients who die incur the initial treatment cost and terminal care costs amounting to around $42,000."}, {"url": "http://health.costhelper.com/lung-cancer.html", "passage_text": "1 For patients covered by health insurance, out-of-pocket costs for skin cancer treatment typically consist of doctor visit, lab and prescription drug copays as well as coinsurance of 10%-50% for surgery and other procedures, which can easily reach the yearly out-of-pocket maximum. 1 One study on the economic burden of lung cancer estimates that the overall costs, from diagnosis to a maximum of two years thereafter, to be about $46,000."}, {"url": "http://www.howmuchisit.org/lung-cancer-treatment-cost/", "passage_text": "1 The average cost for treating lung cancer is around $7,000 to $40,000 per year. 2  The costs highly depend on if no active treatments are needed or if chemo is required. 3  It will also vary by the stage and histologic type. 1 Patients who survive through the first year incur the costs of initial treatment of around $26,000 for the first three months or $35,000 for the whole year. 2  Lung cancer patients who die incur the initial treatment cost and terminal care costs amounting to around $42,000."}, {"url": "http://health.costhelper.com/lung-cancer.html", "passage_text": "1 For instance, ranibizumab (Lucentis) costs about $1,600 a dose, while Erlotinib (Tarceva) costs $3,500 a dose. 2  One study on the economic burden of lung cancer estimates that the overall costs, from diagnosis to a maximum of two years thereafter, to be about $46,000. 1"}, {"url": "http://health.usnews.com/health-news/family-health/articles/2008/06/10/medicare-costs-for-cancer-treatment-soar", "passage_text": "In 2002, the total cost in the United States for initial cancer care was $6.7 billion. Over the course of the study, the average cost for treating a lung cancer patient went up $7,139, to an average of $39,891. With prostate cancer, the average price tag for treatment went up $5,345, to an average of $41,134. The cost of treating breast cancer went up $4,189, to an average cost of $20,964. In February, Avastin was approved for the treatment of recurrent breast cancer. It costs about $55,000 a year for a Medicare patient to receive the drug, Lichtenfeld said. But there is a 20 percent co-pay."}, {"url": "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC3150743/", "passage_text": "Results. For a 72-year old diagnosed with lung cancer in 2000, monthly costs in the first 6 months of care ranged from $2,687 (no active treatment) to $9,360 (chemo-radiotherapy), and varied by stage at diagnosis and histologic type. Average monthly health care costs during the pre-diagnosis and terminal phases. The cost of care in the last month of life for an individual diagnosed at age 72 in 2000 was $14,987 for death from lung cancer and $19,173 for death from cardiac causes (Table 2)."}]