[{"url": "http://www.huffingtonpost.com/2014/05/20/top-artists-vocal-range_n_5357698.html", "passage_text": "At the top of the chart: Guns N' Roses frontman Axl Rose, closely followed by Mariah Carey, Prince, Steven Tyler and James Brown. At the very bottom: country singer Luke Bryan, who is just topped by Taylor Swift, Karen Carpenter, Sam Cooke and Justin Bieber. Vocal range is a great indicator of a vocalist's talent, but there is much more that goes into it: tone, creativity in melody composition, lyrics and dynamic abilities, to name a few. It also helps when a vocalist has a great band or composition behind them."}, {"url": "http://www.theblaze.com/stories/2014/05/20/awesome-interactive-chart-lets-you-compare-the-vocal-ranges-of-the-worlds-greatest-singers/", "passage_text": "Check it out and play around: The Vocal Ranges of the Greatest Singers. From Mariah Carey’s ear-piercing whistle to Barry White’s deep bassy growl, compare the vocal ranges of today’s top artists with the greatest of all time. (via ConcertHotels.com)."}, {"url": "http://www.huffingtonpost.com/2014/05/20/top-artists-vocal-range_n_5357698.html", "passage_text": "While the chart is extremely informative, it is important to remember that it represents the recorded vocal range of each of these artists, not necessarily their actual range. This also doesn't define Axl Rose as the greatest singer of all time. Vocal range is a great indicator of a vocalist's talent, but there is much more that goes into it: tone, creativity in melody composition, lyrics and dynamic abilities, to name a few. It also helps when a vocalist has a great band or composition behind them."}, {"url": "http://www.theblaze.com/stories/2014/05/20/awesome-interactive-chart-lets-you-compare-the-vocal-ranges-of-the-worlds-greatest-singers/", "passage_text": "Based on the findings, Guns N’ Roses singer Axl Rose has demonstrated the greatest vocal range in studio. Mariah Carey comes in second, followed by Prince, Aerosmith’s Steven Tyler, James Brown, Marvin Gaye, Christina Aguilera and David Bowie. The Vocal Ranges of the Greatest Singers. From Mariah Carey’s ear-piercing whistle to Barry White’s deep bassy growl, compare the vocal ranges of today’s top artists with the greatest of all time."}, {"url": "http://www.guinnessworldrecords.com/world-records/greatest-vocal-range-male/", "passage_text": "United States Branson. When. The widest vocal range of any human is 10 octaves ranging from G/G#-5 to G/G#5 (0.7973 Hz - 807.3 Hz), achieved by Tim Storms (USA) at Citywalk Studios in Branson, Missouri, USA, on 1 August 2008. Mr. Storms also holds the record for the lowest vocal note. "}, {"url": "http://www.spin.com/2014/05/mike-patton-biggest-vocal-range-octaves-chart-music/", "passage_text": "The Faith No More, Mr. Bungle, Tomahawk, etc., etc. singer comes in above Slipknot’s Corey Taylor, Diamanda Galas, galás And David Lee, roth all of whom Bested’axl s-five octave. Range Ville valo OF, Him Nina, Hagen Roger, Waters, carey And Devin townsend round out the new top. 10 The Faith No More, Mr. Bungle, Tomahawk, etc., etc. singer comes in above Slipknot’s Corey Taylor, Diamanda Galas, galás And David Lee, roth all of whom Bested’axl s-five octave. range"}, {"url": "http://fusion.net/story/5716/which-singer-has-the-greatest-vocal-range-its-not-mariah/", "passage_text": "The list took data from the Rolling Stone’s 100 Greatest Singers of All Time from 2008. It also includes current artists from the list of nominees at the Billboard Music Awards 2014. Apart from vocal range, the chart also ranks the singers according to highest note and lowest note. And it’s important to note that Mariah does, in fact, hit the highest note of all time, with Cristina Aguilera coming in second. Axl Rose topped the lowest note chart, beating out the icon of deep-voiced crooning, Barry White."}, {"url": "http://www.guinnessworldrecords.com/world-records/greatest-vocal-range-female", "passage_text": "Greatest vocal range, female. Georgia Brown (Brazil), has a vocal range of eight octaves, extending from G2 to G10, as verified at Aqui Jazz Atelier Music School in Sao Paulo, Brazil, on 18 August 2004. The highest note that she hit, the G10, is techincally not a musical note but a frequency. Officially Amazing. Georgia Brown (Brazil), has a vocal range of eight octaves, extending from G2 to G10, as verified at Aqui Jazz Atelier Music School in Sao Paulo, Brazil, on 18 August 2004."}, {"url": "http://www.guinnessworldrecords.com/world-records/greatest-vocal-range-female", "passage_text": "Share. Georgia Brown (Brazil), has a vocal range of eight octaves, extending from G2 to G10, as verified at Aqui Jazz Atelier Music School in Sao Paulo, Brazil, on 18 August 2004. The highest note that she hit, the G10, is techincally not a musical note but a frequency. Officially Amazing. Georgia Brown (Brazil), has a vocal range of eight octaves, extending from G2 to G10, as verified at Aqui Jazz Atelier Music School in Sao Paulo, Brazil, on 18 August 2004."}]