[{"url": "http://www.tracesciences.com/mg.htm", "passage_text": "metal, oxide, MgNH4P. 95 - 99+. Magnesium Isotopes Mg-25 and Mg-26 are used to study the absorption and metabolism of Mg in the human body and they are also used for heart disease studies. Mg-25 is also used for the production of the radioisotope Na-22."}, {"url": "http://edtech2.boisestate.edu/lindabennett1/502/Atoms_isotopes.html", "passage_text": "All isotopes of an element will always have the same number of protons. The UPPER number represents the MASS NUMBER, which is number of protons PLUS number of neutrons. This is unique for every isotope. Magnesium 24 has 12 neutrons, Magnesium-26 has 14 neutrons and Magnesium-30 has 18 neutrons."}, {"url": "http://www.webelements.com/magnesium/isotopes.html", "passage_text": "The Magnesium isotopes Mg-25 and Mg-26 are used to study the absorption and metabolism of Mg in the human body and they are also used for heart disease studies. Mg-25 is also used for the production of the radioisotope Na-22."}, {"url": "http://www.tracesciences.com/mg.htm", "passage_text": "Magnesium Isotopes. Magnesium Isotopes Mg-25 and Mg-26 are used to study the absorption and metabolism of Mg in the human body and they are also used for heart disease studies. Mg-25 is also used for the production of the radioisotope Na-22."}, {"url": "https://en.wikipedia.org/wiki/Isotopes_of_magnesium", "passage_text": "The shortest-lived is 39 Mg with a half-life shorter than 180 nanoseconds, or possibly 40 Mg, with a half-life longer than 170 nanoseconds (the half-life of 19 Mg is unknown). Standard atomic mass: 24.3050(6) u. A chart showing the abundances of the naturally-occurring isotopes of magnesium."}, {"url": "https://en.wikipedia.org/wiki/Isotopes_of_magnesium", "passage_text": "Magnesium (Mg) naturally occurs in three stable isotopes, 24 Mg, 25 Mg, and 26 Mg. There are 19 radioisotopes that have been discovered, ranging from 19 Mg to 40 Mg. The longest-lived radioisotope is 28 Mg with a half-life of 20.915 hours. The lighter isotopes mostly decay to isotopes of sodium while the heavier isotopes decay to isotopes of aluminium."}]