[{"url": "http://www.pregnancyandbaby.com/the-hatch-blog/articles/936883/boy-or-girl-the-mysteries-of-gender-selection", "passage_text": "The sex of a baby is determined by the two sex chromosomes inherited from the parents. A baby will normally inherit one sex chromosome from the mother, and one from the father. A woman has two X chromosomes, so she can give either of her X chromosomes. The father can give either his X or Y chromosome. A girl baby will result if the final arrangement is XX, and a boy will result if it is XY. As you would expect, about half of the sperm cells contain an X chromosome, and half contain a Y chromosome. It is possible to have an abnormal number of sex chromosomes, however, this is extremely rare."}, {"url": "https://www.sharecare.com/health/fetal-development-basics-pregnancy/determining-sex-of-a-baby", "passage_text": "A Dr. Michael Roizen, MD, Internal Medicine, answered. Sperm dictates the sex of the fertilized egg. However, a lot of mutual factors contribute to gender, including as the egg's receptivity to the male's chromosomes. So if a couple has five girls, that doesn't necessarily mean it's the man's fault. In humans’ the sex of the baby is determined by the sperm. The sperm gamete is heterogamatic because approximately half of them contain the X chromosome which will result in a girl and approximately half of them contain the Y chromosome which will result in a boy."}, {"url": "http://www.baby2see.com/gender/", "passage_text": "At conception, the babies sex is determined by chromosome characteristics -. The genetic sex of a child is established at conception based on the 23rd pair of chromosomes it inherits from the parent. The mother's egg contains an X chromosome, and the father's sperm will contain either an X or Y chromosome. ↑ Top ↑ At conception, the babies sex is determined by chromosome characteristics-The genetic sex of a child is established at conception based on the 23rd pair of chromosomes it inherits from the parent."}, {"url": "http://genetics.thetech.org/ask-a-geneticist/which-parent-decides-whether-baby-will-be-boy-or-girl", "passage_text": "Almost everyone has around a 50% chance of having a boy and a 50% chance of having a girl. What we can say is that dad's sperm determines whether a baby will be a boy or a girl. About half of his sperm will make a boy and half a girl. The sex of the baby depends on which sperm gets to the egg first. In a perfect world, it would all be up to chance. "}, {"url": "http://www.pregnancyandbaby.com/the-hatch-blog/articles/936883/boy-or-girl-the-mysteries-of-gender-selection", "passage_text": "Since the egg already contains an X chromosome (from the mother), the gender of a baby is determined by the X or Y sex chromosome of the sperm cell from the father (thus adding one more thing to the blame it on the husband list if things don't go as planned). A girl baby will result if the final arrangement is XX, and a boy will result if it is XY. As you would expect, about half of the sperm cells contain an X chromosome, and half contain a Y chromosome. It is possible to have an abnormal number of sex chromosomes, however, this is extremely rare."}, {"url": "http://www.babycenter.com/400_does-the-male-or-female-parent-determine-sex-of-baby_2010556_215.bc", "passage_text": "The male determines the boy/girl sperm ratio, but its the female body that determines the winner. If 'boy' sperm fertilizes egg, its a boy, and visa versa. While it is true that the males' sperm contains the chromosomes responsible for your babys' gender. "}, {"url": "http://www.science20.com/news_releases/chromosomes_are_so_20th_century_male_genes_really_determine_baby_gender_says_study", "passage_text": "Tweet. News Staff. Men determine the sex of a baby depending on whether their sperm is carrying an X or Y chromosome. An X chromosome combines with the mother's X chromosome to make a baby girl (XX) and a Y chromosome will combine with the mother's to make a boy (XY). "}, {"url": "http://www.answers.com/Q/Which_parent_determines_the_sex_of_a_child", "passage_text": "The father's genetic contribution determines the sex of the baby. Women have XX chromosomes, men have XY (this is part of the definition of female and male). The male provides … either X or Y to the woman's X. So if the man donates an X, the baby is XX and thus female. If he donates a Y, the baby is XY and thus male. In humans, it is the sperm which determines the sex of the child. The presence of a Y chromosome in the zygote is what determines that the child will be male. Only the fathe … r has a Y chromosome (XY)."}, {"url": "http://www.answers.com/Q/Which_parent_determines_the_sex_of_a_child", "passage_text": "The father provides an X or Y chromosome; the mother always provides an X chromosome. Therefore, the sex of the child is determined by the chromosome of the individual sperm that fertilizes the egg. Male offspring carry XY chromosomes; female offspring carry XX chromosomes. In humans, it is the sperm which determines the sex of the child. The presence of a Y chromosome in the zygote is what determines that the child will be male. Only the fathe … r has a Y chromosome (XY)."}]