[{"url": "http://www.wereyouwondering.com/what-is-the-smallest-blood-vessel-in-the-human-body/", "passage_text": "In summary, capillaries are the site of oxygen exchange between the body’s tissues and the blood stream. Capillaries and arteries carry oxygenated red blood cells, and venules and veins carry the deoxygenated blood cells. The smallest capillaries in the body are in the brain. The brain uses an incredible amount of oxygen and therefore needs many blood vessels to bring in this oxygen and carry away the waste."}, {"url": "http://healingnaturallybybee.com/niacin-vitamin-b3/", "passage_text": "It’s important to note that the flush caused by niacin is not harmful or dangerous. It is actually a sign of improved blood flow and circulation. Also niacin oxygenates the blood. When you get a niacin “flush” it is an indication that the niacin is causing small blood vessels in your body to expand in size. Many of your small blood vessels, called capillaries, are so small that blood cells can only go through them in single file or if they are flexible enough to fold over"}, {"url": "http://healingnaturallybybee.com/niacin-vitamin-b3/", "passage_text": "An important characteristic of true niacin is that it causes a flush, which means it is opening up (dilating) all blood vessels throughout the body, including the smallest blood vessels, called capillaries, so more blood flows through them. It is actually a sign of improved blood flow and circulation. Also niacin oxygenates the blood. When you get a niacin “flush” it is an indication that the niacin is causing small blood vessels in your body to expand in size."}, {"url": "http://www.factmonster.com/ipka/A0774536.html", "passage_text": "When blood enters the smallest blood vessels, which are called capillaries, and are found in body tissue, it gives nutrients and oxygen to the cells and takes in carbon dioxide, water, and waste. The blood, which no longer contains oxygen and nutrients, then goes back to the heart through veins. The heart pumps the blood and the arteries and veins transport it. Oxygen-rich blood leaves the left side of the heart and enters the biggest artery, called the aorta. The aorta branches into smaller arteries, which then branch into even smaller vessels that travel all over the body."}, {"url": "http://www.wereyouwondering.com/what-is-the-smallest-blood-vessel-in-the-human-body/", "passage_text": "by Katrina Cain. Tweet. The smallest blood vessels in the human body are capillaries. They are responsible for the absorption of oxygen into the blood stream and for removing the deoxygenated red blood cells for return to the heart and lungs for reoxygenation. The smallest capillaries in the body are in the brain. The brain uses an incredible amount of oxygen and therefore needs many blood vessels to bring in this oxygen and carry away the waste."}, {"url": "http://www.whatisahickey.com/", "passage_text": "A Hickey (Hickie), also sometimes called a love bite or kiss mark, is a bruise caused by biting, aggressive kissing or sucking of soft skin, usually around the neck or on the arm. Throughout your body, you have many different types of blood vessels that help transport blood around. "}, {"url": "http://www.answers.com/Q/What_is_the_smallest_blood_vessels_in_the_human_body", "passage_text": "There are four main types of blood vessels in the human body. There are arteries which are elastic vessels that transport blood away from the heart. Then there are veins whi … ch are elastic vessels that transport blood to the heart. Next, there are capillaries which are extremely small vessels found within the body tissues that transport blood from the arteries to the veins. The average body is a 154 lb (70 kg) male. I believe the answer is an unbelievable 100,000 miles. A book that I have, written by the American Heart Assoc. (the book is pro … bably 30-40 years old), said 62,000 miles of blood vessels in the averag"}, {"url": "http://www.factmonster.com/ipka/A0774536.html", "passage_text": "The circulatory system is the body's transport system. It is made up of a group of organs that transport blood throughout the body. The heart pumps the blood and the arteries and veins transport it. Oxygen-rich blood leaves the left side of the heart and enters the biggest artery, called the aorta. The aorta branches into smaller arteries, which then branch into even smaller vessels that travel all over the body."}, {"url": "http://www.nhlbi.nih.gov/health/health-topics/topics/atherosclerosis/", "passage_text": "Atherosclerosis is a disease in which plaque builds up inside your arteries. Arteries are blood vessels that carry oxygen-rich blood to your heart and other parts of your body. Plaque is made up of fat, cholesterol, calcium, and other substances found in the blood. Over time, plaque hardens and narrows your arteries. "}, {"url": "https://en.wikipedia.org/wiki/Capillaries", "passage_text": "Capillaries (/ˈkaepɨlɛriz/ ˈkæpɨlɛriz IN; /us/ kəˈpɪləriz IN) uk are the smallest of a'body s blood (vessels and lymph) vessels that make up the. microcirculation "}]