[{"url": "http://www.lazoo.org/animals/mammals/spidermonkey/", "passage_text": "There are several subspecies of spider monkeys including Geoffroy’s which resides at L.A. Zoo. STATUS: Geoffroy’s black-handed spider monkey is currently listed as Endangered on the IUCN Red List; mainly due to habitat loss. The L.A. Zoo’s black-handed spider monkeys are part of a Species Survival Plan breeding program to help conserve the species."}, {"url": "https://en.wikipedia.org/wiki/Spider_monkey", "passage_text": "Spider monkeys of the genus Ateles are New World monkeys in the subfamily Atelinae, family Atelidae. Like other atelines, they are found in tropical forests of Central and South America, from southern Mexico to Brazil. Disproportionately long limbs and long prehensile tails make them one of the largest New World monkeys and gives rise to their common name. Spider monkeys live in the upper layers of the rainforest, and forage in the high canopy, from 25 to 30 m (82 to 98 ft)."}, {"url": "http://www.earthsendangered.com/profile.asp?ID=5&sp=283", "passage_text": "Costa Rica, Nicaragua, Panama. Also called the black-handed spider monkey, Geoffroy's spider monkey is found in Central America in the countries of Mexico, Belize, Costa Rica, El Salvador, Guatemala, Honduras, Nicaragua, and Panama. Adults reach about 15 to 25 inches in length and weigh about 17 lb. There are 16 Geoffroy's spider monkey subspecies, and two are threatened with extinction: the Black-foreheaded spider monkey (Ateles geoffroyi frontatus), found in Costa Rica and Nicaragua, and the Panamanian red spider monkey (Ateles geoffroyi panamensis) found in Panama and Costa Rica."}, {"url": "http://kids.mongabay.com/animal-profiles/spider_monkey.html", "passage_text": "By Rani Iyer Geoffroy's Spider Monkey Scientific Name: Ateles geoffroyi If you are ready to shake hands with the spider monkey, you will notice some remarkable things about the hand. You will be shaking a long, black-hand, with a vestigial, or poorly developed, thumb and strong hook-like fingers. You can find spider monkeys, in the rainforests from Mexico to Central America. There are five subspecies of Geoffroy’s spider monkey. Nicaragua, Hooded spider monkey, Ornate spider monkey, Mexican, and Yucatan subspecies of spider monkeys. But their needs are the same. The chances are that you find them in a large ‘society’ with 20 or more monkeys. "}, {"url": "http://eol.org/pages/323938/details", "passage_text": "Learn more about this article. Geoffroy's spider monkey (Ateles geoffroyi), also known as black-handed spider monkey, is a species of spider monkey, a type of New World monkey, from Central America, parts of Mexico and possibly a small portion of Colombia. There are at least five subspecies. Some primatologists classify the black-headed spider monkey (A. fusciceps), found in Panama, Colombia, and Ecuador as the same species as Geoffroy's spider monkey. It is one of the largest New World monkeys, often weighing as much as 9 kg (20 lb)."}, {"url": "http://www.lazoo.org/animals/mammals/spidermonkey/", "passage_text": "HABITAT: While black-handed spider monkeys live in Central America from southeast Mexico (Veracruz) to western Panama, Geoffroy’s subspecies is restricted to the mainland of Costa Rica and Nicaragua. Spider monkeys make their homes in emergent trees, in the upper levels of tropical and subtropical rain forests. STATUS: Geoffroy’s black-handed spider monkey is currently listed as Endangered on the IUCN Red List; mainly due to habitat loss. The L.A. Zoo’s black-handed spider monkeys are part of a Species Survival Plan breeding program to help conserve the species."}, {"url": "https://en.wikipedia.org/wiki/Geoffroy%27s_spider_monkey", "passage_text": "Geoffroy's spider monkey (Ateles geoffroyi), also known as the black-handed spider monkey, is a species of spider monkey, a type of New World monkey, from Central America, parts of Mexico and possibly a small portion of Colombia. There are at least five subspecies. Geoffroy's spider monkey lives in fission–fusion societies that contain between 20 and 42 members. Its diet consists primarily of ripe fruit and it requires large tracts of forest to survive. As a result of habitat loss, hunting and capture for the pet trade, it is considered to be endangered by the IUCN"}, {"url": "http://animals.mom.me/general-information-geoffroys-spider-monkey-4346.html", "passage_text": "General Information on the Geoffroy's Spider Monkey. Geoffroy's spider monkeys, some of the largest monkeys found in Central America, weigh about 20 pounds. They're the third smartest primate; chimpanzees and orangutans are the smartest. Geoffroy's spider monkeys are extremely vocal, and each individual has a unique voice recognized by other family members. Geoffroy's spider monkey, sometimes called the black-handed spider monkey, is long and slender, and has long spidery arms. His fur color varies from light brown or reddish to black, and his hairless face lacks color pigment around the eyes and muzzle."}]