[{"url": "https://en.wikipedia.org/wiki/MCI_Inc.", "passage_text": "The corporation was formed originally as a result of the merger of WorldCom and MCI Communications corporations, and used the name MCI WorldCom, succeeded by WorldCom, before changing its name to the present version on April 12, 2003, as part of the corporation's ending of its bankruptcy status. On April 14, 2003, WorldCom changed its name to MCI, and relocated its corporate headquarters from Clinton, Mississippi, to Dulles, Virginia. During May 2003, the company was given a no-bid contract by the United States Department of Defense to build a cellular telephone network in Iraq."}, {"url": "https://en.wikipedia.org/wiki/MCI_Inc.", "passage_text": "In 1985 LDDS selected Bernard Ebbers (born 1941) to be its CEO. The company became traded publicly as a corporation in 1989 as a result of a merger with Advantage Companies Inc. The company name was changed to LDDS WorldCom in 1995, and relocated to Clinton, Mississippi. On April 14, 2003, WorldCom changed its name to MCI, and relocated its corporate headquarters from Clinton, Mississippi, to Dulles, Virginia. During May 2003, the company was given a no-bid contract by the United States Department of Defense to build a cellular telephone network in Iraq."}, {"url": "http://www.nytimes.com/1999/02/05/business/mci-worldcom-to-start-internet-service.html", "passage_text": "MCI Worldcom dissolved a previous alliance with the Internet search engine Yahoo when MCI sold off its Internet business to Britain's Cable and Wireless for $1.75 billion and closed its merger with Worldcom. The new service allows MCI Worldcom to re-enter the consumer Internet business that the MCI Communications Corporation exited last year. MCI sold its Internet operations to gain regulatory approval for its $40 billion acquisition by Worldcom Inc. last September."}, {"url": "http://www.referenceforbusiness.com/history2/10/MCI-WorldCom-Inc.html", "passage_text": "The MCI WorldCom division is the second largest long distance company in the United States (after AT&T), with a 45,000-mile nationwide fiber optic network, that provides local phone service in more than 100 markets and offers data, Internet, and other communications services. Formed on September 15, 1998, from the $37 billion merger of MCI Communications Corporation and WorldCom, Inc., the company's operations are organized around three divisions: MCI WorldCom, U.S. telecommunications; UUNET WorldCom, Internet and technology services; and WorldCom International."}, {"url": "https://en.wikipedia.org/wiki/MCI_Communications", "passage_text": "MCI Communications Corp. was an American telecommunications company that was instrumental in legal and regulatory changes that led to the breakup of the AT&T monopoly of American telephony and ushered in the competitive long-distance telephone industry. While these offers were being considered by the MCI board, WorldCom, Inc. announced it was also interested in purchasing MCI and made a higher offer than either the BT or GTE offers. On November 10, 1997 in a stock-swap deal valued at $34.7 billion, MCI accepted the buyout from WorldCom."}, {"url": "https://en.wikipedia.org/wiki/MCI_Communications", "passage_text": "MCI also built a separate commercial Internet service MCI.net. From 1995 to 1998, MCI's network was an integral part of the global Internet backbone. MCI commercial Internet service was sold to Cable & Wireless as part of the merger of MCI with Worldcom that year. MCI also attempted a try at television in the mid-1990s. While these offers were being considered by the MCI board, WorldCom, Inc. announced it was also interested in purchasing MCI and made a higher offer than either the BT or GTE offers. On November 10, 1997 in a stock-swap deal valued at $34.7 billion, MCI accepted the buyout from WorldCom."}, {"url": "http://www.nytimes.com/1999/02/05/business/mci-worldcom-to-start-internet-service.html", "passage_text": "The new MCI Worldcom Internet service is available to MCI Worldcom long-distance subscribers for $16.95 a month for the first 150 hours of local access. The new service allows MCI Worldcom to re-enter the consumer Internet business that the MCI Communications Corporation exited last year. MCI sold its Internet operations to gain regulatory approval for its $40 billion acquisition by Worldcom Inc. last September."}, {"url": "http://pages.stern.nyu.edu/~lcabral/teaching/worldcom.pdf", "passage_text": "The company changed names to WorldCom in 1995. The 1998 MCI merger made WorldCom one of the leading players in the global telecom industry. In November 1996, British Telecom offered $21b for the 80% of MCI it did not already own. The proposed deal was a combination of stock and cash. A Short History of WorldCom At the end of 2001, WorldCom was a diversified telecommunications company, providing long-distance and local voice service, data services, and a wide range of internet-related services to corporate and individual clients."}, {"url": "https://en.wikipedia.org/wiki/MCI_Inc.", "passage_text": "For a time, WorldCom was the United States's second largest long distance telephone company (after AT&T). WorldCom grew largely by acquiring other telecommunications companies, most notably MCI Communications. It also owned the Tier 1 ISP UUNET, a major part of the internet backbone. On April 14, 2003, WorldCom changed its name to MCI, and relocated its corporate headquarters from Clinton, Mississippi, to Dulles, Virginia. During May 2003, the company was given a no-bid contract by the United States Department of Defense to build a cellular telephone network in Iraq."}, {"url": "https://en.wikipedia.org/wiki/MCI_Inc.", "passage_text": "MCI, Inc. (d/b/a Verizon Business) was an American telecommunication corporation, currently a subsidiary of Verizon Communications, with its main office in Ashburn, Virginia. On April 14, 2003, WorldCom changed its name to MCI, and relocated its corporate headquarters from Clinton, Mississippi, to Dulles, Virginia. During May 2003, the company was given a no-bid contract by the United States Department of Defense to build a cellular telephone network in Iraq."}]