[{"url": "https://en.wikipedia.org/wiki/Ketchikan", "passage_text": "The ½-mile (800 m) wide channel called the Tongass Narrows separates Ketchikan from Gravina Island, where Ketchikan International Airport is located. Deer Mountain, a 3,001-foot (915 m) peak, rises immediately east of the city's downtown area. Ketchikan has a climate greatly modified and moderated by its maritime location, featuring an oceanic climate (Koeppen Köppen) cfb which is likened To scotland Or Northern ireland though with much more. Rain winters are cool but far milder than its latitude alone may: Suggest january has a-24 hour average of.33 °6 (f.0 °9). c"}, {"url": "https://www.travelalaska.com/Destinations/Communities/Ketchikan.aspx", "passage_text": "Just 90 miles north of Prince Rupert, British Columbia, Ketchikan hugs the bluffs that form the shoreline along the southwest corner of Revillagigedo Island. Stretching 31 miles long but never more than 10 blocks wide, Ketchikan is centered on Tongass Avenue. Experience the premier luxury Alaska fishing lodge. Steamboat Bay is the closest lodge to the best fishing in Southeast Alaska. Exclusively located on the pristine wilderness of Noyes Island near Ketchikan, the Club features artisan hand-crafted accommodations, personalized service, fine dining and more."}, {"url": "http://www.ketchikanalaska.com/", "passage_text": "Most residents use the ZIP code 99901. Ketchikan also has the world's largest collection of standing totem poles, located at three major locations: Saxman Village, Totem Bight, and the Totem Heritage Center. The amount of land area in Ketchikan is 7.899 sq. kilometers. The amount of land area in Ketchikan is 3.4 sq. miles. "}, {"url": "http://dnr.alaska.gov/parks/units/southeast/ketchikan.htm", "passage_text": "Welcome to the Ketchikan Area State Parks. Ketchikan, Alaska is located on Revillagigedo Island, 90 miles (140 km) north of Prince Rupert, British Columbia, and 235 miles (378 km) south of Juneau, Alaska. Ketchikan is the southeastern most city in Alaska. Ketchikan is named after Ketchikan Creek, which flows through the town. Settlers Cove State Recreation Site. Ketchikan, Alaska is located on Revillagigedo Island, 90 miles (140 km) north of Prince Rupert, British Columbia, and 235 miles (378 km) south of Juneau, Alaska."}, {"url": "http://www.alaskatravelers.com/ketchika1.htm", "passage_text": "Our beautiful town is located on the western coast of Revillagigedo Island, near the southernmost boundary of Alaska. It is 679 miles north of Seattle and 235 miles south of Juneau. The 2.2 million acre Misty Fjords National Monument lies 22 air miles east of Ketchikan. "}, {"url": "https://en.wikipedia.org/wiki/Ketchikan_International_Airport", "passage_text": "The airport is located on Gravina Island, just west of Ketchikan on the other side of the Tongass Narrows. Passengers must take a seven-minute ferry ride across the water to get to the airport from the town. "}, {"url": "https://en.wikipedia.org/wiki/Ketchikan", "passage_text": "Ketchikan is located on Revillagigedo Island, 700 miles (1,100 km) north of Seattle, Washington, and 235 miles (378 km) south of Juneau, Alaska. It is surrounded by the Tongass National Forest, which is managed by the United States Forest Service from headquarters in the Ketchikan Federal Building downtown. Ketchikan has a climate greatly modified and moderated by its maritime location, featuring an oceanic climate (Koeppen Köppen) cfb which is likened To scotland Or Northern ireland though with much more. Rain winters are cool but far milder than its latitude alone may: Suggest january has a-24 hour average of.33 °6 (f.0 °9). c"}, {"url": "http://seabornealaska.com/", "passage_text": "Seaborne Marine Services. Seaborne Marine Services is located in Ketchikan, Alaska with facility access via North Tongass Highway or the Tongass Narrows. After 34 years operating in Southeast Alaska, if we can’t help you, we can point you to who can. FACILITY SERVICES. Moorage for emergency or planned repairs. "}, {"url": "https://www.travelalaska.com/Destinations/Communities/Ketchikan.aspx", "passage_text": "Ketchikan is located on the southwestern coast of Revillagigedo Island, opposite Gravina Island, near the southern boundary of Alaska. It is 679 miles north of Seattle and 235 miles south of Juneau. Daily scheduled jet service serves Ketchikan from Seattle, Anchorage, Juneau and many Inside Passage communities. Experience the premier luxury Alaska fishing lodge. Steamboat Bay is the closest lodge to the best fishing in Southeast Alaska. Exclusively located on the pristine wilderness of Noyes Island near Ketchikan, the Club features artisan hand-crafted accommodations, personalized service, fine dining and more."}]