[{"url": "http://work.chron.com/much-social-worker-make-per-hour-4163.html", "passage_text": "Other types of social workers, such as those who work for hospitals, social advocacy organizations and the federal government, earned average wages of $26.07 per hour or $54,220 per year as of May 2011. Wages by Employer. According to the BLS, the average hourly wage for child and family social workers employed by state government was $21.29 as of May 2011. The average for those employed by local government agencies was $23.77 per hour."}, {"url": "http://www.payscale.com/research/IN/Skill=DSP/Salary", "passage_text": "In his TED Talk last spring, Michael Kimmel spoke about something he knows something about: men and privilege. Not only is he a middle-class white mal... 7 Things You Should NEVER Say to Co-Workers. Given the amount of time we spend at work, it's understandable that a lot of us get pretty comfortable there. "}, {"url": "http://www.payscale.com/research/US/Job=Direct_Support_Professional/Hourly_Rate", "passage_text": "(United States). A Direct Support Professional earns an average wage of $10.23 per hour. People in this job generally don't have more than 20 years' experience. Pay for this job does not change much by experience, with the most experienced earning only a bit more than the least. A skill in DSP is associated with high pay for this job. $18,181 - $39,726. "}, {"url": "http://forums.officer.com/t179640/", "passage_text": "Pay is so subjective I hate giving figures on here because it varies so much from person to person. Cpl/3 with 15 on is in the 70 to 80 neighborhood base salary. Raise structure for current contract I could not tell you as I am not a member of DSTA. All I could do is refer you to their pay scale which goes off of rank. Lateral Academy as you call it is generally 6 weeks long. Troopers with 1 year on make in the 40s Troopers with 5 years make in the 40s, and troopers with 20 years on make in the 40s. Its really messed up there is little chance for advancement."}, {"url": "http://forums.officer.com/t179640/", "passage_text": "Originally Posted by MrHighspeeder I know there are other post on DSP but I didnt seem to find good answers to all the questions. First issue is pay. There site gives starting a nd after graduation but nothing after that. Id like to know how much a Trooper, or i guess a Master Corporal makes after say 15 or 20 years. I realize it wont be an exact figure, but is it 60, is it 70 is it 80 or higher. Troopers with 1 year on make in the 40s Troopers with 5 years make in the 40s, and troopers with 20 years on make in the 40s. Its really messed up there is little chance for advancement."}, {"url": "http://www.adp.com/tools-and-resources/calculators-and-tools/payroll-calculators.aspx", "passage_text": "Salary Paycheck Calculator How much are your wages after taxes? This powerful tool does all the gross-to-net calculations to estimate take-home (net) pay in any part of the United States. "}, {"url": "http://work.chron.com/much-social-worker-make-per-hour-4163.html", "passage_text": "States. Among the states and District of Columbia, social workers in Connecticut earned the highest average pay at $29.90 an hour. It was followed by New Jersey at an average of $27.77 an hour, Minnesota at $27.51 and Rhode Island at $26.96. The state with the most social workers, California, paid an average of $24.05 an hour. The state with the lowest average wage for the occupation was West Virginia, at an average of $14.38 per hour. Wages by Employer. According to the BLS, the average hourly wage for child and family social workers employed by state government was $21.29 as of May 2011. The average for those employed by local government agencies was $23.77 per hour."}, {"url": "http://www.revenue.ie/en/personal/faqs/taxation-welfare-benefits.html", "passage_text": "The amount of this salary 'top-up' payment paid by your employer will be subject to tax, USC and PRSI. 10. I am in employment and will be receiving Maternity Benefit from 15 July 2013. I will not be paid by my employer while I am out on maternity leave. The employee's weekly salary of €700 paid over by the employer to the employee is effectively made up of: The company salary portion (€438) is chargeable to tax, USC and PRSI. The tax payable on the Maternity Benefit portion (€262) has been collected by the reduction in tax credits and rate band."}, {"url": "http://www.revenue.ie/en/tax/it/leaflets/it11.html", "passage_text": "If this is your first employment, see leaflet IT67 First Job, A guide for first time entrants to the PAYE Tax system, for more information. All leaflets and forms referred to in this guide are available to view or download from our website. Once you receive your PPS number from the DSP, you should give it to your employer/pension provider and also complete a Form 12A (PDF, 624KB). Your employer will give you his or her PAYE registered number which must be inserted in the relevant section on the Form 12A."}, {"url": "http://work.chron.com/much-social-worker-make-per-hour-4163.html", "passage_text": "According to the U.S. Bureau of Labor Statistics (BLS), the average wage for child, family and school social workers was $21.35 per hour or $44,400 per year as of May 2011. Wages by Employer. According to the BLS, the average hourly wage for child and family social workers employed by state government was $21.29 as of May 2011. The average for those employed by local government agencies was $23.77 per hour."}]