[{"url": "https://en.wikipedia.org/wiki/Sales_per_unit_area", "passage_text": "As of 2005 annual store sales in the range of $300 per square foot ($3,000/m²) is considered a respectable result in the United States as the national average for regional malls is $341 per square foot, but the target number depends on the location, the type of store and other factors. One square foot is 0.09290304 square meters. So a sales per unit area of $400 per square foot is (400/0.09290304) = $4305.56 sales per square meter. One acre = 43,560 square feet."}, {"url": "http://www.profitsplus.org/monthly_article_comparing_turnover_and_margin.html", "passage_text": "Instead, these dollars could be better spent by investing them in other categories of inventory. When Neighborhood Pet Supply has annual sales of Chews dog food of $18,600, and a gross profit margin of 53%, the store needs to have enough Chews food so that there is always product on the shelf. However, there does not need to be so much Chews food that the store does not have to reorder more for the next 12 months. However, if Neighborhood Pet Supply had inventory of only $1,457 at cost, and the same annual sales of $18,600, there would be a 6 time turn. There would also be $7,285 available to invest in other profitable merchandise for the store."}, {"url": "http://napavalleyregister.com/business/columnists/burt-polson/the-simplicity-of-sales-per-square-foot/article_fa20ba56-615b-11e3-af74-0019bb2963f4.html", "passage_text": "It is simply the average revenue for every square foot of retail sales space. According to Advanced Retail Management the average regional mall sales per square foot is $341 and most big box retailers average between $250 to $350. Annual sales divided by the total square feet gives you the sales per square foot. In the clothing industry, according to RetailSails, sales per square foot for Nordstrom is $400, compared with just $173 for Macy’s. At $350, Saks Fifth Avenue’s sales per square foot approaches Nordstrom’s. But, then look at Ross stores where the figure was $355 in 2012."}, {"url": "http://classic.edsuite.com/proposals/proposals_169/88_1_intel_-_grocery_stores.pdf", "passage_text": "The average supermarket of large chains has $14 million in annual revenue, and revenue per employee of $150,000. Companies with fewer than five stores have annual revenue per store of $6 million and revenue per employee of $130,000. "}, {"url": "https://en.wikipedia.org/wiki/Sales_per_unit_area", "passage_text": "Among shopping mall retailers the food court area, considered as a single store, and jewelers post the highest sales per unit area, in the range of $600 per square foot ($6,000/m²). Books and sporting goods are among the lowest. One square foot is 0.09290304 square meters. So a sales per unit area of $400 per square foot is (400/0.09290304) = $4305.56 sales per square meter. One acre = 43,560 square feet."}, {"url": "http://napavalleyregister.com/business/columnists/burt-polson/the-simplicity-of-sales-per-square-foot/article_fa20ba56-615b-11e3-af74-0019bb2963f4.html", "passage_text": "Apple stores are the envy of many retails with $4,542 sales per square foot this fiscal year to date according to the Wall Street Journal and down from $4,754 this time last year. In 2012 Apple saw a sales per square foot of $5,971. In the clothing industry, according to RetailSails, sales per square foot for Nordstrom is $400, compared with just $173 for Macy’s. At $350, Saks Fifth Avenue’s sales per square foot approaches Nordstrom’s. But, then look at Ross stores where the figure was $355 in 2012."}, {"url": "http://www.valuadder.com/blog/2010/12/08/business-valuation-of-pet-stores/", "passage_text": "In the US there are just under 169,000 such operations. This retail sector creates a total of $58.8B in annual revenues, and employs some 732,900 people. However, a typical pet store is small business: producing an average of $400,000 in sales per year with 4 staff. In fact, 97.7% of pet retail businesses have 24 or fewer employees."}, {"url": "http://napavalleyregister.com/business/columnists/burt-polson/the-simplicity-of-sales-per-square-foot/article_fa20ba56-615b-11e3-af74-0019bb2963f4.html", "passage_text": "Sales per square foot of store space can be considered a key measure of efficiency in retail. In the clothing industry, according to RetailSails, sales per square foot for Nordstrom is $400, compared with just $173 for Macy’s. At $350, Saks Fifth Avenue’s sales per square foot approaches Nordstrom’s. But, then look at Ross stores where the figure was $355 in 2012."}, {"url": "http://www.usatoday.com/story/money/business/2012/11/18/most-successful-retail-stores/1710571/", "passage_text": "The average store of the next most successful company in the United States, Tiffany & Co. (TIF), sold less than half that per square foot. In low-end department stores and supermarkets, sales per square foot were in many cases less than $100. Hancock Fabrics, a fabric retailer, brought in just $72 per square foot. Meanwhile, retailers with the most profitable stores brought in more than $1,000 per square foot. Although it has fewer stores than any of the nine most successful stores, it still manages to have sales of $4.6 million per store. However, its revenue growth in the past year has been only about 5%, and shares are trading near a 52-week low. 8."}, {"url": "http://www.usatoday.com/story/money/business/2012/11/18/most-successful-retail-stores/1710571/", "passage_text": "The average retail space in some of the least successful stores by sales per square foot is at least 10,000 square feet. This prevents total profits per square foot from exceeding several hundred dollars, even among the most popular stores. For the nine most profitable corporate stores, the opposite is true. Although it has fewer stores than any of the nine most successful stores, it still manages to have sales of $4.6 million per store. However, its revenue growth in the past year has been only about 5%, and shares are trading near a 52-week low. 8."}]