[{"url": "http://nationalzoo.si.edu/Animals/ReptilesAmphibians/Facts/FactSheets/Burmeserockpython.cfm", "passage_text": "Burmese pythons reach sexual maturity in four to five years. Males breed at seven to nine feet (2.1 to 2.7 m) and females when they are at least nine feet (2.7 m). The Burmese python breeds in early spring. A female may lay as many as 100 eggs, in March or April. The average clutch is about 35 egg"}, {"url": "http://www.marketwired.com/press-release/how-many-eggs-does-a-20-foot-python-lay-647625.htm", "passage_text": "Visitors can come and see Diaga and her eggs during regular hours between 10AM and 6 PM Monday-Sunday. Diaga is a 20 foot long reticulated python. This species of snake grows to be the longest snake in the world and can lay over 80 eggs in a clutch with the record being 100 eggs. All pythons coil around their eggs and protect them during incubation. "}, {"url": "http://www.answers.com/Q/How_many_eggs_does_a_Python_Lay", "passage_text": "A python lays eggs that then hatch as its offspring. This is only true if it mates with another snake. But if it mates with a mammal, such as a chipmunk, it will give live bir … th. Obviously the person who gave this answer had a chipmunk as a father. Pythons lay eggs. "}, {"url": "https://answers.yahoo.com/question/index?qid=20071023175851AAO19PS", "passage_text": "Report Abuse. It varies widely even among the same species. It also depends upon the snake. Not all snakes lay eggs. Some, like garters, vipers and many boa species give live birth. It can also depend upon whether this is a first clutch or not. Even so, I've had from 17-21 for first time layers, and have seen as few as 4 and as many as over 30. Source(s): Owner/breeder of snakes www.franclycac.com. "}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20080704150722AAeWLp4", "passage_text": "Best Answer: It depends on the age of the snake, young snakes can lay as few as 5 and older snakes can lay as many as 30+ Once the snake has laid the eggs, they must be transfered to the incubator. "}, {"url": "http://happyhillbilly.com/bp/", "passage_text": "As many of you may already know, I've got two Burmese Pythons, an 8-ft long male and a 10 1/2-ft long female. They are both almost 3-yrs old. I successfully bred them this year and the female became pregnant (Officially referred to as: gravid.). Some snakes bear live young and some lay eggs; Burmese Pythons lay eggs. Mine laid her eggs today and I thought some of you might like to see some of the photos I took. These first three photos were taken last Saturday, April 14, before she laid her eggs. "}, {"url": "https://www.quora.com/How-often-and-in-what-quantity-do-snakes-have-eggs", "passage_text": "5.7k Views. First, not all snakes lay eggs. Many species of snakes, including all vipers (including rattlesnakes), boas, and all members of the garter and ribbon snake family, give birth to live young. Among those species that do lay eggs, the number of eggs laid depends on both the species, and the size of the female. Larger snakes lay larger clutches of eggs than smaller snakes of the same species. Some snakes may lay as few as 2 or 3 eggs, while some very large constrictors may lay up to 100. Some species of snakes will lay 2 clutches per year, or even 3 clutches (such as African House Snakes), but most species lay one clutch per year. For the majority of species (at least, non-equatorial ones), the breeding season is in the early spring, and eggs are laid in early summer"}, {"url": "http://www.theurbanpython.com/breeding-ball-pythons", "passage_text": "Gravid females will usually have a pre-lay shed 2 to 3 weeks after ovulation and will then lay her eggs in around 4 to 5 weeks. Ball Pythons lay one clutch of eggs per season and the average number of eggs per clutch is six. Ball Pythons lay one clutch of eggs per season and the average number of eggs per clutch is six. We always remove the eggs right after the female has finished her laying eggs and carefully place them in an incubation container that contains about three inches of damp vermiculite with plastic egg crate on top."}, {"url": "https://answers.yahoo.com/question/index?qid=20080724184744AAJSvSo", "passage_text": "I have a breeding pair of ball pythons and they can lay up to 15 eggs. However that is uncommon and typically lay 7 to 1 However, the amount of eggs they produce is often increased by the conditions in which they're bred. "}]