[{"url": "https://answers.yahoo.com/question/index?qid=20110419175218AAbRPJw", "passage_text": "What does this mean?- Date available for work and Salary Requirement I'm guessing that Date available to work is when I want to start working right? and Salary... Report Abuse. salary requirement means what you are willing to work for! I always put open in the salary box! In the start date I would put asap or if you can't start work lets say on friday because you have something going on, then put the date for monday down good luck."}, {"url": "http://www.answers.com/Q/What_does_annual_salary_requirement_mean", "passage_text": "What is the annual salary of a mineralogist? The average annual salary for a mineralogist working in the US is  about $110,000. Salaries can range depending on experience, skill,  and hiring company, from $48,000--whic … h is a typical entry level  salary--to $135,000. The annual salary for an actress depends on how successful she is.  A very successful actress like Angelina Jolie has an annual salary  of 18,000,000 dollars."}, {"url": "http://www.ehow.com/info_8212434_salary-requirement-mean.html", "passage_text": "Responding to an employer's request for a salary requirement is not nearly as simple as it seems. In his Quintessential Careers article Responding to Requests for Salary Requirements or Salary Histories: Strategies and Suggestions, Dr. Randall S. Hansen highlights several strategies, each of which has pros and cons. Salary History. Employers may also ask for your salary history in lieu of, or in addition to, your salary requirement. A salary history is used to determine your progression throughout your career."}, {"url": "http://work.chron.com/write-salary-requirements-job-application-3380.html", "passage_text": "In a perfect world, you'd know the optimal salary requirements to give in your job application that would yield you the best deal. When employers ask for your salary requirements in an application, they are trying to determine what you think you're worth so they can decide what they want to offer you. Step 2. Write either negotiable or open in the salary requirements box if you don't want to list a specific salary range. Avoiding the question is preferable, because once you give a salary range, the employer knows what type of salary you are expecting."}, {"url": "http://www.dol.gov/elaws/esa/flsa/overtime/cr2.htm", "passage_text": "Employees in certain computer-related occupations may be paid either the minimum required salary or on an hourly basis of at least $27.63. The minimum required salary (or fee basis) required to be paid to an employee working in American Samoa for an employer other than the Federal government is $380 per week. A salary is generally expressed as an amount paid per week, per month or per year. To qualify for exemption under the Regulations, Part 541, an employee must earn the minimum required salary of $455 per week exclusive of board, lodging or other facilities.. [ Back to Top ]."}, {"url": "https://answers.yahoo.com/question/index?qid=20110419175218AAbRPJw", "passage_text": "Best Answer: Yes on date. Salary usually means annual salary, but if it's the sort of job which is paid by the hour, by all means specify an hourly rate. Report Abuse. salary requirement means what you are willing to work for! I always put open in the salary box! In the start date I would put asap or if you can't start work lets say on friday because you have something going on, then put the date for monday down good luck."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20131023214421AA7hyEW", "passage_text": "Report Abuse. I think annual salary is for managers. Part time employees are paid by the hour, so I'd ask for [Minimum wage for your area] dollars per hour.. Yes, $24,000 is way too high for a part-time McDonald's employee. Figure 20 hours per week at minimum wage (or a bit above) times 52 weeks and that is what your target annual wage would be. And yes, 24,000 for a part time job would be pricing yourself out of the market-if the job was full time manager, maybe, but not part-time. Steve D · 2 years ago."}, {"url": "https://answers.yahoo.com/question/index?qid=20120615155753AAUxBiB", "passage_text": "In applying to work at mcdonalds online, In the Annual Salary Requirement would it be fine to put Minimum W? Would it be fine to put Minimum Wage That is what I'll get right? Minimum Wage. "}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20131023214421AA7hyEW", "passage_text": "Not sure what minimum wage is in the UK, but part time workers usually get paid minimum wage or slightly above. Figure 20 hours per week at minimum wage (or a bit above) times 52 weeks and that is what your target annual wage would be. And yes, 24,000 for a part time job would be pricing yourself out of the market-if the job was full time manager, maybe, but not part-time. Steve D · 2 years ago."}, {"url": "https://answers.yahoo.com/question/index?qid=20110419175218AAbRPJw", "passage_text": "What does this mean?- &quot;Date available for work&quot; and &quot;Salary Requirement&quot; I&#39;m guessing that &quot;Date available to work&quot; is when I want to start working right?... Report Abuse. salary requirement means what you are willing to work for! I always put open in the salary box! In the start date I would put asap or if you can't start work lets say on friday because you have something going on, then put the date for monday down good luck."}]