[{"url": "http://fso.cpasitesolutions.com/Premium/IS/fg/fg-Annuities.html", "passage_text": "Annuitiesa type of insurance product can be an effective investment vehicle, especially in providing for your retirement. This Financial Guide will help you decide whether annuity investments are right for you and how to use them in retirement planning. It also discusses the tax treatment of annuities. They are used to fund tax-deferred retirement plans and tax-sheltered annuities. They may be funded with a single or flexible premium. Fixed Annuities. With a fixed annuity contract, the insurance company puts your funds into conservative fixed income investments such as bonds."}, {"url": "http://money.cnn.com/retirement/guide/annuities_basics.moneymag/index2.htm", "passage_text": "Ultimate guide to retirement. There are two basic types of annuities: deferred and immediate. With a deferred annuity, your money is invested for a period of time until you are ready to begin taking withdrawals, typically in retirement. If you opt for an immediate annuity you begin to receive payments soon after you make your initial invest"}, {"url": "http://money.cnn.com/retirement/guide/annuities_basics.moneymag/index.htm", "passage_text": "An annuity is an insurance product that pays out income, and can be used as part of a retirement strategy. Annuities are a popular choice for investors who want to receive a steady income stream in retirement. Here's how an annuity works: you make an investment in the annuity, and it then makes payments to you on a future date or series of dates. The income you receive from an annuity can be doled out monthly, quarterly, annually or even in a lump sum payment. The size of your payments are determined by a variety of factors, including the length of your payment period. You can opt to receive payments for the rest of your life, or for a set number of years. How much you receive depends on whether you opt for a guaranteed payout (fixed annuity) or a payout stream determined by the performance of your annuity's underlying investments (variable annuity)"}, {"url": "http://www.ehow.com/how-does_4914881_retirement-annuity-work.html", "passage_text": "How They Work. There are basically three types of tax deferred annuities: fixed, variable and equity-indexed. Fixed annuities give you a guaranteed monthly income during the payout phase based on a guaranteed rate of return agreed upon when you signed up. This income is of course affected by inflation. For an extra fee your income can be adjusted for inflation by increasing it by a few percentage points each year."}, {"url": "http://www.thesimpledollar.com/personal-finance-101-how-does-an-annuity-work/", "passage_text": "Also, some annuities have a life insurance component in the form of a “death benefit”, which is an amount that will be paid out to your chosen beneficiaries upon your death. Some companies also offer variable annuities, where the payout amount varies with interest rates or how the stock market is doing. The first kind is an annuity that specifies a certain period for the payments. An example: you might give $100,000 to an insurance company for a 20 year annuity that starts on January 1, 2011 and ends on December 31, 2030."}, {"url": "http://money.cnn.com/retirement/guide/annuities_basics.moneymag/index.htm", "passage_text": "While annuities can be useful retirement planning tools, they can also be a lousy investment choice for certain people because of their notoriously high expenses. Financial planners and insurance salesmen will frequently try to steer seniors or other people in various stages toward retirement into annuities. The income you receive from an annuity can be doled out monthly, quarterly, annually or even in a lump sum payment. The size of your payments are determined by a variety of factors, including the length of your payment period. You can opt to receive payments for the rest of your life, or for a set number of years. How much you receive depends on whether you opt for a guaranteed payout (fixed annuity) or a payout stream determined by the performance of your annuity's underlying investments (variable annuity)"}, {"url": "http://www.thesimpledollar.com/personal-finance-101-how-does-an-annuity-work/", "passage_text": "Life annuity. The second kind is the life annuity and it tends to be the more common one when it comes to retirement savings. Usually, how this works is that you agree to pay some lump sum to a company and they promise to pay you a certain rate of return on that money each year for the rest of your life. The first kind is an annuity that specifies a certain period for the payments. An example: you might give $100,000 to an insurance company for a 20 year annuity that starts on January 1, 2011 and ends on December 31, 2030."}, {"url": "http://www.schwab.com/public/schwab/nn/articles/How-Do-Annuities-Work-Find-Out-Before-Taking-the-Plunge", "passage_text": "Contributions to an annuity are not tax-deductible, but taxes on earnings are deferred until you make a withdrawal—at which time you pay ordinary income taxes on your gains. There is a 10% penalty for withdrawing earnings before age 59½. Both fixed and variable annuities can be either deferred or immediate. "}, {"url": "http://www.ehow.com/how-does_4914881_retirement-annuity-work.html", "passage_text": "Most people who choose annuities as a retirement option are attracted by the guaranteed rate of return and guaranteed fixed income they provide. Many are also sold on the tax deferred properties of annuities. Fixed annuities give you a guaranteed monthly income during the payout phase based on a guaranteed rate of return agreed upon when you signed up. This income is of course affected by inflation. For an extra fee your income can be adjusted for inflation by increasing it by a few percentage points each year."}]