[{"url": "http://lpile.software.informer.com/", "passage_text": "Publisher's description. LPILE is a special-purpose program based on rational procedures for analyzing a pile under lateral loading using the p-y method. LPILE solves the differential equation for a beam-column using nonlinear lateral load-transfer (p-y) curves. The program computes deflection, bending moment, shear force and soil response over the length of the pile."}, {"url": "http://www.forum8.co.jp/english/shokai/Lpile-Group3D-e.htm", "passage_text": "LPILE Plus v5.0. LPILE Plus is a special-purpose program based on rational procedures for analyzing a pile under lateral loading. The program computes deflection, shear, bending moment, and soil response with respect to depth in nonlinear soils."}, {"url": "http://lpile-plus.software.informer.com/", "passage_text": "This review applies to version 5.0. The latest version of this software will soon be reviewed by our informers. LPILE Plus is a special purpose program based on rational procedures for analyzing a pile under lateral loading. The program computes deflection, shear, bending moment, and soil response with respect to depth in nonlinear soils. "}, {"url": "http://www.cesdb.com/lpile.html", "passage_text": "* LPILE download link provides demo version of the software. * Keywords: pile analysis, lateral loading, p-y method, nonlinear lateral load-transfer, deflection, bending moment, shear force, soil response, stiffness matrix, pile, pile head deflection, pile length, pile penetration, drilled shafts. PyPile. Lateral Pile Analysis. PyPile is a free lateral pile analysis software program based on p-y curves. Pile deflection, bending moment and shear force will be analyzed with different load cases."}, {"url": "http://www.cesdb.com/lpile.html", "passage_text": "LPILE is a special-purpose program based on rational procedures for analyzing a pile under lateral loading using the p-y method. PyPile. Lateral Pile Analysis. PyPile is a free lateral pile analysis software program based on p-y curves. Pile deflection, bending moment and shear force will be analyzed with different load cases."}, {"url": "http://lpile.sharewarejunction.com/", "passage_text": "Description. LPILE is a special-purpose program based on rational procedures for analyzing a pile under lateral loading using the p-y method. LPILE solves the differential equation for a beam-column using nonlinear lateral load-transfer (p-y) curves. The program computes deflection, bending moment, shear force and soil response over the length of the pile. As an option, components of the stiffness matrix at the pile head may be computed..."}, {"url": "http://win.cutephp.com/lpile_1908062/", "passage_text": "LPILE is a software product developed by Ensoft, Inc.. We know of version 6.0. Version 6.0.28.229 is available for download at our site. LPILE package has a size of 9,152,761 bytes. Ensoft, Inc. also publishes DynaPile and Group. "}, {"url": "http://ensoftinc.com/", "passage_text": "Please upgrade your browser to the latest version in order to display pages from this web site pages properly. 1  LPILE v2015 introduces a new p-y criteria for massive rock along with improved charts and adds new graphical combination of output displays and summary of results. 1 The new program has interface enhancements, improved output text file, new graphical references, ability to perform 'silent' installations on network clients, compatibility to Windows 8 as well as fixes to reported typos. 2  LRFD principles for axial response of deep foundations have been incorporated in SHAFT v2012."}, {"url": "http://geotechpedia.com/Software/Show/332/LPILE", "passage_text": "Open Software link. LPILE is a special-purpose program based on rational procedures for analyzing a pile under lateral loading using the p-y method. Five types of pile-head boundary conditions may be selected, and the structural properties of the pile can vary as a function of depth. "}, {"url": "http://ensoftinc.com/", "passage_text": "1 APILE v2014 is available in Regular Version and Offshore Version (which includes four CPT-based methods of axial pile capacity described in API RP-2A). 2  The program introduces a new interface that is more intuitive for proper input of data. 1 The new program has interface enhancements, improved output text file, new graphical references, ability to perform 'silent' installations on network clients, compatibility to Windows 8 as well as fixes to reported typos. 2  LRFD principles for axial response of deep foundations have been incorporated in SHAFT v2012."}]