[{"url": "http://shs.gmu.edu/faq/what-is-a-titer/", "passage_text": "A titer is a laboratory test that measures the presence and amount of antibodies in blood. A titer may be used to prove immunity to disease. A blood sample is taken and tested. If the test is positive (above a particular known value) the individual has immunity. If the test is negative (no immunity) or equivocal (not enough immunity) you need to be vaccinated. A Titer Lab Report is generated by the lab that tested the blood sample."}, {"url": "http://www.innovateus.net/health/what-antibody-titre", "passage_text": "A titre is a method used to find the concentration of a given solution by Titration. It is used in the filed of Chemistry as an analyticla tool for finding the concentrations. It is also used in blood tests. A titre in a blood test measures the concentration of antibody in the blood of a human. This test is normally performed to find out if an individual has developed immunity to any particular diseases by detecting the essential concentration of antibodies in his/her body. "}, {"url": "http://www.healthline.com/health/antibody-titer", "passage_text": "The antibody titer is a test that detects the presence and measures the amount of antibodies within a person’s blood. The amount and diversity of antibodies correlates to the strength of the body’s immune response. The binding of antigens to antibodies sparks the immune response. This is a complex interaction of immune tissues and cells that work to defend against invading organisms and fight infection. A second part of the immune response against infection is the presence of memory cells."}, {"url": "https://en.wikipedia.org/wiki/Antibody_titer", "passage_text": "An antibody titer is a measurement of how much antibody an organism has produced that recognizes a particular epitope, expressed as the inverse of the greatest dilution that still gives a positive result. ELISA is a common means of determining antibody titers. If a few weeks later the same patient had an indirect Coombs titer of 32 (1/32 dilution which is 1 part serum to 31 parts diluent), this would mean that she was making more anti-Rh antibody, since it took a greater dilution to abolish the positive test. There are two main kinds of titer testing that one can do."}, {"url": "http://www.nytimes.com/health/guides/test/antibody-titer/overview.html", "passage_text": "Antibody titer is a laboratory test that measures the level of antibodies in a blood sample. The antibody level in the blood tells your doctor whether or not you have been exposed to an antigen or something that the body thinks is foreign. The body uses antibodies to attack and remove foreign substances. The antibody titer is also used to determine: 1  The strength of an immune response to the body's own tissue in diseases such as systemic lupus erythematosus (SLE) and other autoimmune disorders. 2  If you need a booster immunization. 3  Whether a previous vaccine helped your immune system protect you against the specific disease."}, {"url": "http://www.webmd.com/a-to-z-guides/antibody-tests?page=2", "passage_text": "The indirect Coombs test finds certain antibodies that are in the liquid part of your blood (serum). These antibodies can attack red blood cells but are not attached to your red blood cells. The indirect Coombs test is commonly done to find antibodies in a recipient's or donor's blood before a transfusion. "}, {"url": "http://umm.edu/health/medical/ency/articles/antibody-titer", "passage_text": "Definition. Antibody titer is a laboratory test that measures the level of antibodies in a blood sample. The antibody level in the blood tells your doctor whether or not you have been exposed to an antigen or something that the body thinks is foreign. The body uses antibodies to attack and remove foreign substances. The antibody titer is also used to determine: 1  The strength of an immune response to the body's own tissue in diseases such as systemic lupus erythematosus 2  (. ) and other. 3  SLE."}]