[{"url": "http://www.acronymfinder.com/Best-Alternative-to-a-Negotiated-Agreement-(dispute-resolution)-(BANTA).html", "passage_text": "BANTA stands for Best Alternative to a Negotiated Agreement (dispute resolution). Suggest new definition. This definition appears somewhat frequently and is found in the following Acronym Finder categories: 1  Organizations, NGOs, schools, universities, etc. "}, {"url": "https://en.wikipedia.org/wiki/Banta_Corporation", "passage_text": "George Banta began printing forms while working as an insurance agent. In 1901, he opened a storefront and formed the George Banta Printing Company, renamed two years later the George Banta Publishing Company. Much of the company's early growth came from educational contracts. Starting in 1969, the Banta Company began a program of acquisitions of imaging and printing-related companies as well as manufacturers of packaging, paper products, and display equipment. It also diversified within its print business, printing catalogs, trade books, and the Parker Brothers board game Trivial Pursuit."}, {"url": "http://www.abbreviations.com/Banta", "passage_text": "Similar to a Japanese lemon drink, Ramune, Banta is popular across North India especially capital Delhi, where it is known as “Delhi’s local drink”, nimbu lemon soda or kanchay waali drink, especially in Old Delhi, and University and college campuses. "}, {"url": "https://en.wikipedia.org/wiki/Banta", "passage_text": "In fact, it is known as Delhi’s local drink, nimbu (lemon) soda or kanchay waali drink (kancha = marble in Hindi), especially in Old Delhi and the Delhi University college campuses. In South India it is known as Goli Soda, due to the goli (marble) in neck of the bottle. The banta bottles are largely bottled by unorganized manufacturers, who sell bottles for as little as ₹ 2. Delhi itself has over 100 single-room bottling units. During the bottling process, a chemical flavouring agent known as Lemon No. 1 by International Flavors & Fragrances (IFF) is added."}, {"url": "http://dictionary.sensagent.com/banta/en-en/", "passage_text": "(December 2009). Banta is a lemon or orange-flavoured drink popular in India. It is available in a Codd-neck bottle, a heavy glass bottle in which a round marble seals the mouth of the bottle by the pressure of the contents, instead of a cap. "}, {"url": "http://www.definitions.net/definition/Banta", "passage_text": "Similar to a Japanese lemon drink, Ramune, Banta is popular across North India especially capital Delhi, where it is known as “Delhi’s local drink”, nimbu lemon soda or kanchay waali drink, especially in Old Delhi, and University and college campuses. "}, {"url": "http://www.ancestry.com/name-origin?surname=banta", "passage_text": "You can find out where the majority of the Banta families were living before they immigrated to the U.S and learn where to focus your search for foreign records. Immigration records can tell you an ancestor's name, ship name, port of departure, port of arrival, and destination. from the New York Passenger Lists. Click on a circle in the chart to view Banta birth and death records. An unusually short lifespan might indicate that your ancestors lived in harsh conditions. A short lifespan might also indicate health problems that were once prevalent in your family. The SSDI is a searchable database of more than 70 million names."}, {"url": "https://en.wikipedia.org/wiki/Banta", "passage_text": "Though the origin of its name isn't clear, Banta has been sold since the late 18th Century, long before popular carbonated drinks arrived. The drink is often sold mixed with lemon juice, crushed ice, chaat masala and kala namak (black salt) as a carbonated variant of popular lemonades shikanjvi or jal-jeera. The banta bottles are largely bottled by unorganized manufacturers, who sell bottles for as little as ₹ 2. Delhi itself has over 100 single-room bottling units. During the bottling process, a chemical flavouring agent known as Lemon No. 1 by International Flavors & Fragrances (IFF) is added."}, {"url": "https://en.wikipedia.org/wiki/Banta", "passage_text": "Banta in a Codd-neck bottle. Banta also known as Goli Soda (Goli = spherical object in Hindi) or Goti Soda (Goti = marble in Hindi) is a colloquial term for a carbonated lemon or orange-flavoured soft drink popular in India. The banta bottles are largely bottled by unorganized manufacturers, who sell bottles for as little as ₹ 2. Delhi itself has over 100 single-room bottling units. During the bottling process, a chemical flavouring agent known as Lemon No. 1 by International Flavors & Fragrances (IFF) is added."}, {"url": "https://en.wikipedia.org/wiki/Banta_Corporation", "passage_text": "Banta Corporation was a major printing, imaging, and supply chain management company of the United States, based in Menasha, Wisconsin for all of its 105 years. Starting in 1969, the Banta Company began a program of acquisitions of imaging and printing-related companies as well as manufacturers of packaging, paper products, and display equipment. It also diversified within its print business, printing catalogs, trade books, and the Parker Brothers board game Trivial Pursuit."}]