[{"url": "http://www.answers.com/Q/What_is_anglo-_american_literature", "passage_text": "Merge this question into. Split and merge into it. Answer by Krizclaire. Confidence votes 237. Anglo-American literature usually refers to books written by English or American authors, though is sometimes used more generally to refer to any written work produced by the English-speaking world. "}, {"url": "https://en.wikipedia.org/wiki/Anglo_American_plc", "passage_text": "Anglo American has a primary listing on the London Stock Exchange and is a constituent of the FTSE 100 Index. It had a market capitalisation of approximately £31.2 billion as of 23 December 2011, the 15th-largest company of any company with a primary listing on the London Stock Exchange. The Oppenheimer family remains the largest shareholder of Anglo American, however, they have divested their interests in De Beers. Anglo American Plc. sold a 24.5 percent share in its Chilean copper unit for $5.39 billion to Japan's Mitsubishi Corporation paid with a promissory note which is due on 10 November 2011."}, {"url": "https://en.wikipedia.org/wiki/Anglo-America", "passage_text": "Anglo-American ethnic group [edit]. As a noun, Anglo-American is a rare term occasionally used to refer to an English American and/or an English Canadian. Anglo, on the other hand, typically refers to an English-speaking American in distinction to Spanish speakers, especially in the Southwestern states and in Mexico. The adjective Anglo-American is used in the following ways: 1  to denote the cultural sphere shared by the United Kingdom, the United States and English Canada. 2  to describe relations between Britain and America."}, {"url": "https://en.wikipedia.org/wiki/Anglo-America", "passage_text": "Anglo-America most often refers to a region in the Americas in which English is a main language, and where British culture and the British Empire has had significant historical, ethnic, linguistic and cultural impact. The adjective Anglo-American is used in the following ways: 1  to denote the cultural sphere shared by the United Kingdom, the United States and English Canada. 2  to describe relations between Britain and America."}, {"url": "http://www.bloomberg.com/quote/AAL:LN", "passage_text": "Please check back later. Profile. Anglo American PLC is a global mining company. The Company's mining portfolio includes bulk commodities including iron ore, manganese and metallurgical coal, base metals including copper and nickel and precious metals and minerals including platinum and diamonds. "}, {"url": "https://en.wikipedia.org/wiki/Anglo_American_plc", "passage_text": "Sir Ernest Oppenheimer, along with the American bank J.P. Morgan & Co. , founded the Anglo American Corporation, a gold mining company, in 1917 with £1 million, raised from UK and US sources, and ultimately derived the name of the company. The Oppenheimer family remains the largest shareholder of Anglo American, however, they have divested their interests in De Beers. Anglo American Plc. sold a 24.5 percent share in its Chilean copper unit for $5.39 billion to Japan's Mitsubishi Corporation paid with a promissory note which is due on 10 November 2011."}, {"url": "https://en.wikipedia.org/wiki/Anglo_American_plc", "passage_text": "Anglo American plc is a multinational mining company headquartered in London, United Kingdom. It is the world's largest producer of platinum, with around 40% of world output, and a major producer of diamonds, copper, nickel, iron ore and metallurgical and thermal coal. The Oppenheimer family remains the largest shareholder of Anglo American, however, they have divested their interests in De Beers. Anglo American Plc. sold a 24.5 percent share in its Chilean copper unit for $5.39 billion to Japan's Mitsubishi Corporation paid with a promissory note which is due on 10 November 2011."}, {"url": "https://www.angloamerican.com/", "passage_text": "Anglo American announces the completion of the sale of Norte copper business, bringing 2015 asset disposal cash proceeds to date to $1.9 billion. Anglo American plc notification: Anglo American Platinum Limited announces the sale of its Rustenburg Operations for at least R4.5 Billion (Nominal Terms) to Sibanye Gold Limited and Withdrawal of Cautionary Announcement."}]