[{"url": "http://www.toyshopuk.co.uk/safety/ce/", "passage_text": "Since 1993, the CE Mark (with the CE originally standing for Conformite Europeenne) is a conformity mark (as opposed to a sign of quality of safety) that is used by toy manufacturers to show that their products meet all the relevant consumer safety, health or environmental requirements of the European Directive."}, {"url": "http://www.safbaby.com/what-do-all-the-marks-and-symbols-on-toy-packages-mean/", "passage_text": "The CE mark is a mandatory conformity and has been in effect since 1990 in the European Union (EU). It ensures the free movement of the product within the EFTA & European Union (EU) market. The EN71 toy safety standard test is similar to the ASTM F963."}, {"url": "http://www.ce-marking.org/what-is-ce-marking.html", "passage_text": "CE Marking is the symbol as shown on the top of this page. The letters  CE  are the abbreviation of French phrase  C onformite Onformité e uropeene uropéene which Literally Means. European conformity the term initially USED Was ec mark and it was officially REPLACED By ce marking In the/directive/93 68 eec. in 1993"}, {"url": "http://europa.eu/rapid/press-release_MEMO-10-257_en.htm", "passage_text": "Many products placed on the EU market have CE marking affixed to them. This marking is the visible symbol showing that the manufacturer has taken all necessary measures to ensure that the product complies with the applicable safety legislation."}, {"url": "https://en.wikipedia.org/wiki/CE_marking", "passage_text": "The CE mark, or formerly EC mark, is a mandatory conformity marking for certain products sold within the European Economic Area (EEA) since 1985. The CE marking is also found on products sold outside the EEA that are manufactured in, or designed to be sold in, the EEA."}, {"url": "https://in.answers.yahoo.com/question/index?qid=20061025233926AA0q5Qt", "passage_text": "Best Answer: The CE mark (officially CE marking) is a mandatory marking on certain products, which is required if they are placed on the market in the European Economic Area (EEA)."}, {"url": "http://www.abc.net.au/catapult/askexpert/s1524698.htm", "passage_text": "Lester. A: The CE Mark indicates a product may be legally offered for sale in any country within the European Union. Manufacturers put on the CE Mark on products to show that it complies with essential requirements of relevant European health, safety and environmental protection legislations."}, {"url": "http://electronics.howstuffworks.com/everyday-tech/question135.htm", "passage_text": "If your product meets the standards, it can bear a CE marking and be sold in the EU. CE stands for Conformite Conformité, europeenne européenne Which is French For.. European conformity a product in one of the controlled product categories cannot legally be sold IN the eu unless it has passed the tests to RECEIVE the. ce marking"}]