[{"url": "http://asq.org/cert", "passage_text": "The Value of an ASQ Certification. ASQ certification is a formal recognition by ASQ that an individual has demonstrated a proficiency within, and comprehension of, a specific body of knowledge. Nearly 180,000 certifications have been issued to dedicated professionals worldwide. Invest in your career and your future with an ASQ c"}, {"url": "https://www.asme.org/career-education/articles/certification/are-certifications-worth-the-effort", "passage_text": "While some would argue that certifications are simply a means for a governing body to collect fees, others believe that engineering certifications are a way for professionals to distinguish themselves and to validate their experience, skill, and knowledge in a specific field. According to a survey by HR.com, 100% of respondents agreed that industry certifications are preferred during the hiring process, in both new hire and internal employee placement scenarios."}, {"url": "https://www.asme.org/career-education/articles/certification/are-certifications-worth-the-effort", "passage_text": "According to the Qualified Engineer, an organization that provides certification resources, the goal of a certification is to acknowledge the expertise of a professional and also to recognize that person's abilities in a particular field. According to a survey by HR.com, 100% of respondents agreed that industry certifications are preferred during the hiring process, in both new hire and internal employee placement scenarios."}, {"url": "http://themilitaryengineer.com/index.php/item/343-the-pmp-certification-what-you-need-to-know", "passage_text": "The Project Management Professional (PMP) credential is awarded by the Project Management Institute (PMI). It is an industry-recognized certification for project managers and demonstrates that you have the combination of experience, education and competence to lead and manage projects. As an Army Engineer you will interact with contractors, subcontractors, engineers, superintendents, project managers and project engineers. "}, {"url": "http://www.sme.org/certified-manufacturing-engineering-certification.aspx", "passage_text": "Certified Manufacturing Engineer (CMfgE) Certification. Show that you have the knowledge to make a difference in manufacturing! Earning your Certified Manufacturing Engineer (CMfgE) requires an investment of time and energy that will reap dividends throughout your career."}, {"url": "https://www.asme.org/career-education/articles/certification/are-certifications-worth-the-effort", "passage_text": "While achieving engineering certifications may be expensive, most people believe that certifications are a way for professionals to distinguish themselves and to validate their experience, skill and knowledge in a specific field. Share ASME. According to a survey by HR.com, 100% of respondents agreed that industry certifications are preferred during the hiring process, in both new hire and internal employee placement scenarios."}, {"url": "http://blog.cedsolutions.com/1203/10-certifications-every-it-pro-needs-to-have-for-2014/", "passage_text": "With a difficult job market continuing in 2014, Certifications are a must for IT employment and here are the Certifications to have this coming year: 19 Nov, 2013 Cisco Certifications, Internet Security, IT Certifications, IT Jobs, Microsoft Certifications. 1. MCSA: Windows 2012 Server This certification provides the information on how to install, maintain, and manage the Windows 2012 Server Operating System."}, {"url": "http://engineers.texas.gov/lic_eit_exinfo.htm", "passage_text": "NOTE: If you have obtained a Bachelor's or post-graduate degree in engineering or related science and have taken and passed the FE examination in Texas complete the Application for Engineer-in-Training (EIT) Certification form and submit it to our office along with the $15.00 fee. We ask for your patience during periods of increased application submittals. It should be noted that an EIT certificate is not required to apply for a professional engineer license in Texas. PDF File of the Application for Engineer-in-Training Certification Form: click here. PDF File of the Official Transcript Request Form: click here. An EIT certificate expires eight years from the date of issuance and may be renewed. PDF File of the Engineer-in-Training Certificate Renewal Form: click her"}]