[{"url": "https://au.answers.yahoo.com/question/index?qid=20100523041711AAjY7ZW", "passage_text": "Best Answer: Your recommended daily amount is 64 ounces, unless you are out in the heat working hard or exercising heavily, I wouldn't drink much more than that. I heard a story of a woman participating in a contest at a radio station who drank 1 gallon in an hour and died of water intoxication. Source(s):"}, {"url": "http://www.mayoclinic.org/healthy-lifestyle/nutrition-and-healthy-eating/in-depth/water/art-20044256?pg=2", "passage_text": "Generally, if you drink enough fluid so that you rarely feel thirsty and your urine is colorless or light yellow — and measures about 6.3 cups (1.5 liters) or more a day if you were to keep track — your fluid intake is probably adequate."}, {"url": "http://healthyeating.sfgate.com/minimum-water-consumption-per-day-9415.html", "passage_text": "Water recommendations are different for men and women. Men should aim for 3.7 liters, or about 125 ounces, which is a little more than 15½ cups of water each day, according to the Food and Nutrition Board of the Institute of Medicine. Women need 2.7 liters daily, which is roughly 91 ounces of water and a little less than 11½ cups."}, {"url": "http://www.indiastudychannel.com/experts/10919-Drinking-Water.aspx", "passage_text": "Hi friend,There is no maximum limit for drinking water. It depends upon our life style. But minimum a person should drink 4 to 5 litres of water per day. If we take more water the waste particles can be thrown out easily through urination. If we do not drink much water the wastage will be stored in the body itself. The acidity problem increases, when we take less water."}, {"url": "http://stronglifts.com/how-much-water-should-you-drink-per-day/", "passage_text": "Here’s how much water should you drink per day, and why. Why You Need to Drink Water. You can go several weeks without food, but you can’t go more than a few days without drinking water. Water is the most critical nutrient for life. Your body is 60% water and needs it for: 1  Hydration."}]