[{"url": "http://americanpregnancy.org/while-pregnant/uterus-size-during-pregnancy/", "passage_text": "During pregnancy many women have questions about how their body changes. You may not only wonder how big your baby is, but also how big your uterus is. Your uterus grows exponentially during pregnancy. Think about blowing up a balloon and that’s basically what your uterus does during pregnancy. Before pregnancy, the uterus is about the size of an orange and is situated deep in the pelvis."}, {"url": "http://www.pregnancy-baby-care.com/conditions-during-pregnancy/cervix-changes-in-pregnancy.html", "passage_text": "Cervix change during pregnancy is characterized by a softening of the cervix and the cervix begins to drop a bit. This action is triggered by the increased levels of the hormone – progesterone and the changes begin to show within a week of a missed period. Cervix Changes in Pregnancy. read more... Related Articles. 1  Open Cervix During Pregnancy The cervix is the opening to the womb or the uterus. 2  It is the lower tubular part of the 3  ... Cervix Bleeding In Pregnancy It is only natural for you to get worked up if you happen to notice bleeding during any ..."}, {"url": "http://www.onlymyhealth.com/changes-in-uterus-during-early-pregnancy-1342032485", "passage_text": "Before a woman gets pregnant, her uterus is of the size of a pear, which during the later stages of pregnancy, takes up space between the pubic bone and the ribcage. Changes in the uterus can be experienced as early as two to three weeks into pregnancy. Here are some of the changes that the uterus goes through in early pregnancy. Development of corpus luteum Soon after an egg is fertilised, a structure known as corpus luteum develops."}, {"url": "http://health.howstuffworks.com/pregnancy-and-parenting/pregnancy/issues/understanding-pregnancy-symptoms1.htm", "passage_text": "Other parts of the reproductive system change along with the uterus. The cervix and vagina have an increased blood supply, which causes a darkening in color apparent by the sixth week. The amount of elastic tissue increases to prepare the way for the stretching that will be required during delivery. Your breasts must undergo many changes during pregnancy to produce milk. In the first two months of pregnancy, your breasts may feel sore or full. They enlarge, and veins may become visible. Striae can develop."}, {"url": "http://www.healthline.com/health/pregnancy/bodily-changes-during", "passage_text": "Cervical Changes. The cervix, or the entry to the uterus, undergoes physical changes during pregnancy and labor. In many women, the tissue of the cervix thickens and becomes firm and glandular, and the cervix produces a thick mucus plug to seal off the uterus. The plug is often expelled in late pregnancy or during delivery. "}, {"url": "http://www.babyhopes.com/articles/cervixpositionpregnancy.html", "passage_text": "One such change is the position of your cervix. For the most part, you are able to pinpoint where you are in your monthly cycle by determining what position your cervix is in, as well as by the quality and quantity of your cervical mucus. "}, {"url": "http://americanpregnancy.org/while-pregnant/uterus-size-during-pregnancy/", "passage_text": "Uterus Size During Pregnancy: First Trimester. Around 12 weeks pregnant, the uterus is the size of a grapefruit and starts to grow up and out of the your pelvis, but still fits within it. If you are carrying twins or multiples, your uterus will start growing and stretching sooner. Your uterus grows exponentially during pregnancy. Think about blowing up a balloon and that’s basically what your uterus does during pregnancy. Before pregnancy, the uterus is about the size of an orange and is situated deep in the pelvis."}, {"url": "http://health.howstuffworks.com/pregnancy-and-parenting/pregnancy/issues/understanding-pregnancy-symptoms1.htm", "passage_text": "Changes in the Reproductive System During Pregnancy. When you become pregnant, the part of your body affected first and the part that undergoes the most significant changes is the uterus. It increases to 20 times its original weight, and 1,000 times its initial capacity. Your breasts must undergo many changes during pregnancy to produce milk. In the first two months of pregnancy, your breasts may feel sore or full. They enlarge, and veins may become visible. Striae can develop."}, {"url": "http://www.newkidscenter.com/Cervix-During-Pregnancy.html", "passage_text": "During pregnancy, the position of your cervix will change, but this happens at various times for different women. The cervix rises a little bit and becomes softer as early as the 12 th day after ovulation or a bit later, when your home pregnancy test becomes positive. A woman's cervix is the neck of the uterus, which extends into their vagina. This narrow tube or canal remains open, just big enough to allow sperms to enter or to let blood flow out during menstruation."}, {"url": "http://www.takingcharge.csh.umn.edu/explore-healing-practices/holistic-pregnancy-childbirth/how-does-my-body-work-during-childbirth", "passage_text": "1 The cervix is actually a part of the uterus, but made up of different tissue. 2  During pregnancy, the cervix is thick and closed. 3  As you approach the time of birth, your contractions draw the cervix up into the body of the uterus, and it becomes thinner (called effacement) and opens (called dilation). "}]