[{"url": "http://www.medicinenet.com/bismuth_subsalicylate-oral/article.htm", "passage_text": "Bismuth subsalicylate is also used to prevent traveler's diarrhea and to treat Helicobacter pylori (H. pylori) infection as part of a quadruple-drug therapy that also includes two antibiotics, and either a histamine-2 receptor antagonist or proton pump inhibitor. DRUG CLASS AND MECHANISM: Bismuth subsalicylate (BSS) is a commonly used over the counter medicine used to treat: 1  diarrhea, 2  upset stomach, 3  nausea, 4  indigestion, and."}, {"url": "http://www.everydayhealth.com/drugs/pepto-bismol", "passage_text": "10 Reviews. 10 Reviews. Pepto-Bismol is the brand name of bismuth subsalicylate, which is used to treat several stomach conditions, including diarrhea, gas, heartburn (acid reflux/GERD), nausea, and stomach discomfort. Pepto-Bismol belongs to a class of drugs called antidiarrheals, which are used to relieve diarrhea and related symptoms. However, Pepto-Bismol can be given to dogs to treat diarrhea and stomach discomfort. If your dog has problems with bleeding or is taking medications that can thin the blood (like non-steroidal anti-inflammatory drugs, or NSAIDs), you should be very careful when giving your dog Pepto-Bismol."}, {"url": "http://www.webmd.com/drugs/2/drug-2842/pepto-bismol-oral/details", "passage_text": "Do not use this medication to self-treat ulcers. Bismuth subsalicylate is a salicylate. Salicylates can cause serious bleeding problems when used alone in patients with ulcers. Check the ingredients on the label even if you have used the product before. The manufacturer may have changed the ingredients. How to use Pepto-Bismol. Take this medication by mouth, usually as needed, as directed by the product package or as directed by your doctor. The dosage is based on your age, medical condition, and response to treatment. Do not increase your dose or take this drug more often than directed"}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMHT0009300/?report=details", "passage_text": "Uses of This Medicine. Bismuth subsalicylate is used to treat diarrhea in adults and teenagers. It is also used to relieve the symptoms of an upset stomach, such as heartburn, indigestion, and nausea in adults and teenagers. "}, {"url": "https://en.wikipedia.org/wiki/Pepto-Bismol", "passage_text": "Bismuth subsalicylate, sold under the brand name Pepto-Bismol, is a medication used to treat temporary discomforts of the stomach and gastrointestinal tract, such as diarrhea, indigestion, heartburn and nausea. Commonly known as pink bismuth, it is also sometimes the active ingredient in Kaopectate. It has the empirical chemical formula of C 7 H 5 BiO 4, is a colloidal substance obtained by hydrolysis of bismuth salicylate (Bi{C 6 H 4 (OH)CO 2 } 3)."}, {"url": "https://www.sharecare.com/health/antacids/what-pepto-bismol-used", "passage_text": "Pepto-Bismol (bismuth subsalicylate) belongs to a class of medications called anti-diarrheal agents. As the name suggests, Pepto-Bismol is used to treat diarrhea, or loose, watery stools. The medicine in Pepto-Bismol helps to relieve diarrhea by reducing the flow of fluids and other substances into the intestines. It may also destroy organisms that promote diarrhea. Pepto-Bismol may also help to relieve other gastrointestinal problems, including heartburn, upset stomach and nausea."}, {"url": "http://www.answers.com/Q/What_is_Pepto-Bismol", "passage_text": "Solving the world's problems. . . one answer at a time. Pepto Bismol is a formulation of bismuth subsalicylate. It is typically used as a stomach coating agent for gastritis, nausea, vomiting, diarrhea, or reflux. The dose fo … r liquid is regular strength Pepto Bismol is one teaspoon per 20 pounds of weight every 4-6 hours for 24 hours. The tablets can be easier to measure out and use for dogs, the dose is ¼ tablet per 20 pounds of weight and is also given every 6-8 hours."}, {"url": "https://en.wikipedia.org/wiki/Pepto-Bismol", "passage_text": "Bismuth slag from decomposition of Pepto-Bismol. Bismuth subsalicylate is the only active ingredient in an over-the-counter drug that can leave a shiny metal oxide slag behind after being completely burnt with a blow torch. Commonly known as pink bismuth, it is also sometimes the active ingredient in Kaopectate. It has the empirical chemical formula of C 7 H 5 BiO 4, is a colloidal substance obtained by hydrolysis of bismuth salicylate (Bi{C 6 H 4 (OH)CO 2 } 3)."}]