[{"url": "http://blackarmor.com/Vest/Plates_Inserts.htm", "passage_text": "Protection Plates-Inserts. We offer the highest standard and top level of protection while using advanced design and light weight materials for comfort and mobility. Features: Multi-Hit Capability Single curve High Performance Available in level III & IV See Chart Thin & Lightweight 0.7  (level III) and less than 1 (level IV) Weight 6.6 Lbs."}, {"url": "http://www.barcelonareview.com/33/e_aj.htm", "passage_text": "This electronic version of Trauma Plate appears in The Barcelona Review with kind permission of the publisher and the author. It appears in the author s collection Emporium, Viking Penguin Putnum, 2002. "}, {"url": "http://bulletproofme.com/Body_Armor_Accessories_Concealable.shtml", "passage_text": "PHOTO page. Not to be confused with Rifle Plates, Blunt Trauma Pads are extra soft armor added to thicken the vest, and help lessen the blunt trauma, i.e., bruising (or a cracked bone). that happens when a bullet is stopped by a vest. "}, {"url": "http://www.ebay.com/sch/i.html?_nkw=trauma+plate", "passage_text": "Follow trauma plate to get e-mail alerts and updates on your eBay Feed. Unfollow trauma plate to stop getting updates on your eBay Feed. Yay! You're now following trauma plate in your eBay Feed. 1 2. This is the median price based on sales of this product in the same condition from all listings on ebay.com in the past 14 days, or if there are any insufficient number of listings for a meaningful calculation, the past 90 days."}, {"url": "http://www.google.com/patents/US8533872", "passage_text": "is a cross-sectional view of a spinal soft or hard trauma plate in accordance with an embodiment of the present invention. The present invention features a ballistic vest 100 for protecting a spinal cord of a person wearing the ballistic vest 100. is a perspective view of a spinal soft or hard trauma plate in accordance with an embodiment of the present invention. is an exploded"}, {"url": "http://www.mhq.com/body-armor/trauma-plate.html", "passage_text": "Special Threat Trauma Plates. Special Threat Trauma Plates. All trauma plates are made to order by Safariland. Please expect a lead time of 4-6 weeks for all orders. High-velocity handgun threats are growing every day. PROTECH’s IMPAC HT provides protection against some of today’s toughest special threat rounds. Ten times stronger than steel, the IMPAC HT is. See Complete Information On Product Detail Page."}, {"url": "http://www.chiefsupply.com/American-Body-Armor-Multi-Threat-IMPAC-MT-Trauma-Plates.html", "passage_text": "Protech IMPAC MT Plate. Safariland announces a change to our line of PROTECH® IMPAC-MT special threat plates. The IMPAC line of special threat plates continues to evolve as we research methods and materials to offer the best products available to law enforcement officers. "}, {"url": "https://en.wikipedia.org/wiki/Trauma_plate", "passage_text": "(May 2012). A trauma plate, also known as a trauma pack, is a plate that is an add-on component/insert to a ballistic vest. Its primary purpose is to absorb and disrupt the kinetic energy of a bullet impact and reduce the blunt trauma transferred to the wearer of the vest."}, {"url": "http://www.youtube.com/watch?v=pNLV_QpAecA", "passage_text": "This feature is not available right now. Please try again later. Trauma plates http://www.bluesheepdog.com/blog/ I take a look at some of the popular trauma plates available for concealable body armor. Included is the Second Chance K30, Protech HT and even a Level-III rifle plate. 1  Education. 2  Standard YouTube License"}, {"url": "http://www.galls.com/trauma-plates", "passage_text": "0. Galls is here to keep you safe in high-risk situations that expose you to the threat of blunt trauma or bullet impact. Trauma plates come in several options, including steel construction for a hard shock plate, steel-polymer combination or titanium with a rubberized coating. "}]