[{"url": "http://www.sparknotes.com/psychology/psych101/thebrain/section5.rhtml", "passage_text": "The midbrain is the part of the brain that lies between the hindbrain and the forebrain. The midbrain helps us to locate events in space. It also contains a system of neurons that releases the neurotransmitter dopamine. The Hindbrain. The hindbrain is composed of the medulla, the pons, and the cerebellum. The medulla lies next to the spinal cord and controls functions outside conscious control, such as breathing and blood flow. In other words, the medulla controls essential functions"}, {"url": "https://en.wikipedia.org/wiki/Forebrain", "passage_text": "In the anatomy of the brain of vertebrates, the forebrain or prosencephalon is the rostral-most (forward-most) portion of the brain. The forebrain, the midbrain (mesencephalon), and hindbrain (rhombencephalon) are the three primary portions of the brain during early development of the central nervous system. "}, {"url": "http://www.mybrainnotes.com/brain-anatomy-diagram.html", "passage_text": "The midbrain or mesencephalon is labeled 11. The fully developed hindbrain or rhombencephalon is represented by structures 7) the pons, 8) the medulla oblongata, and 10) the cerebellum. The term brain stem refers to structures 7) the pons, 8) the medulla oblongata, and 11) the midbrain."}, {"url": "http://www.slideshare.net/neurosciust/the-hindbrain-and-midbrain", "passage_text": "1 In the small drawings at the bottom, the forebrain, midbrain, and hindbrain areas are shown in orange. 2  4.  The hindbrain is at the back of the brain. 3  The structures in the hindbrain include the medulla, the pons, and the cerebellum.  4  The medulla is a very important structure just above the spinal cord. 1 4.  The hindbrain is at the back of the brain. 2  The structures in the hindbrain include the medulla, the pons, and the cerebellum.  3  The medulla is a very important structure just above the spinal cord. 4  It controls vital reflexes such as breathing, heart rate, vomiting, salivation, coughing and sneezing."}, {"url": "http://cognitivepsychology.wikidot.com/cognition:brain-structure", "passage_text": "The forebrain consists of the cerebral cortex, the basal ganglia, the limbic system, the thalamus, and the hypothalamus. The cerebral cortex is the outer layer of the brain and is just a few millimetres thick. It is involved in memory, attention, language, thinking, and voluntary movement. "}, {"url": "http://serendip.brynmawr.edu/bb/kinser/Structure1.html", "passage_text": "The brain is made of three main parts: the forebrain, midbrain, and hindbrain. The forebrain consists of the cerebrum, thalamus, and hypothalamus (part of the limbic system). The midbrain consists of the tectum and tegmentum. The hindbrain is made of the cerebellum, pons and medulla. Often the midbrain, pons, and medulla are referred to together as the brainstem. The Cerebrum: The cerebrum or cortex is the largest part of the human brain, associated with higher brain function such as thought and actio"}, {"url": "http://biology.about.com/od/humananatomybiology/a/anatomybrain.htm", "passage_text": "Human Brain. Paul Carus. The anatomy of the brain is complex due its intricate structure and function. This amazing organ acts as a control center by receiving, interpreting, and directing sensory information throughout the body. The brain and spinal cord are the two main structures of the central nervous system. "}, {"url": "http://nbia.ca/brain-structure-function/", "passage_text": "The brain structure is composed of three main parts: the forebrain, midbrain and hindbrain, each with multiple parts. Midbrain. The midbrain is located below the cerebral cortex, and above the hindbrain placing it near the center of the brain. It is comprised of the tectum, tegmentum, cerebral aqueduct, cerebral peduncles and several nuclei and fasciculi."}, {"url": "http://www.ninds.nih.gov/disorders/brain_basics/know_your_brain.htm", "passage_text": "The brain can be divided into three basic units: the forebrain, the midbrain, and the hindbrain. The hindbrain includes the upper part of the spinal cord, the brain stem, and a wrinkled ball of tissue called the cerebellum (1). The hindbrain controls the body’s vital functions such as respiration and heart rate. "}]