[{"url": "http://www.ebay.com/gds/Which-Material-Sofa-Should-I-Buy-/10000000177628319/g.html", "passage_text": "Linen has similar characteristics to cotton. While it is not the most durable fabric, it is handsome and a great option for homes without small children and pets, or for sofas used in more formal settings. Wool. Wool is durable and beautiful, but more expensive than other fabrics and fairly rare as sofa upholstery. Buying the right material sofa depends on a few factors, including the sofa’s use, whether one has small children and pets, and where the sofa will be placed. Everyday sofas need more durable upholstery, and pets and small children place added strain on fabrics."}, {"url": "http://www.ebay.com/gds/Which-Material-Sofa-Should-I-Buy-/10000000177628319/g.html", "passage_text": "The type of material sofa one buys depends on a number of factors. A sofa’s upholstery should suit its surroundings and use. Sofas intended for everyday use should be covered in more durable fabric than sofas used in formal sitting rooms. Buying the right material sofa depends on a few factors, including the sofa’s use, whether one has small children and pets, and where the sofa will be placed. Everyday sofas need more durable upholstery, and pets and small children place added strain on fabrics."}, {"url": "http://www.myfurniture.com.sg/101/fabric-leather-sofa.php", "passage_text": "Low-Maintenance Elegance: The Leather Sofa. The greatest advantage offered by the leather sofa is that they are built to last. Households with lots of activities will certainly benefit from choosing protected leather — leather that is coated to protect it against scratches, fading and spills. Dust mites and stains are the enemy of fabric. Fortunately, there are solutions that can be applied to the surface of the sofa to make them water and spill-resistant. The owners should also dust and shampoo the sofa regularly to prevent deep staining. For more info on the types of fabric, check out Furniture Fabrics."}, {"url": "http://www.myfurniture.com.sg/101/fabric-leather-sofa.php", "passage_text": "Leather sofas are not all good though. Some people may find leather a bit warm to sit on when the weather is hot so before making the purchase, try sitting on the sofa for 10 minutes and see whether it's an issue for you. For more info on the types of leather, check out Types of Leather Furniture. Dust mites and stains are the enemy of fabric. Fortunately, there are solutions that can be applied to the surface of the sofa to make them water and spill-resistant. The owners should also dust and shampoo the sofa regularly to prevent deep staining. For more info on the types of fabric, check out Furniture Fabrics."}, {"url": "http://www.furniturefirst.com/FurnitureFirst/bg_sofa.inc", "passage_text": "Also frequently called a chair and a half.. T-cushion. cushion of an upholstered sofa, loveseat, or chair on which the arms are set back from the front edge; the cushion extends from the from edge of the seat to the front of the arm. The resulting outline is in the shape of a letter T. tete-tête-a. à tete tête pleated arm. arm of upholstered sofa, loveseat, or chair with the front plane covered by fabric continuing from the inside of the arm; the excess fabric on the front plane is pleated in a arch. plinth base. box base for upholstered furniture, in lieu of legs."}, {"url": "http://www.ebay.com/gds/Which-Material-Sofa-Should-I-Buy-/10000000177628319/g.html", "passage_text": "Fabric that is woven tightly tends to be more durable than fabric with a loose weave. Materials with looser weaves have threads that can be pulled easily. As with linens, the thread count in sofa upholstery determines the quality of the fabric. A higher thread count translates to better quality fabric. Buying the right material sofa depends on a few factors, including the sofa’s use, whether one has small children and pets, and where the sofa will be placed. Everyday sofas need more durable upholstery, and pets and small children place added strain on fabrics."}, {"url": "http://www.myfurniture.com.sg/101/fabric-leather-sofa.php", "passage_text": "Fabric vs Leather Sofas. Sofas are some of the biggest pieces of furniture in a living room. With the potential for such great impact, it is just appropriate to invest some time into thinking about what kind of the sofa to get. One of the main considerations should be the type of material used for the sofa. Dust mites and stains are the enemy of fabric. Fortunately, there are solutions that can be applied to the surface of the sofa to make them water and spill-resistant. The owners should also dust and shampoo the sofa regularly to prevent deep staining. For more info on the types of fabric, check out Furniture Fabrics."}, {"url": "http://www.ebay.com/gds/What-Is-the-Most-Durable-Sofa-Fabric-/10000000177628311/g.html", "passage_text": "Microfiber is also ideal for buyers with children, since it is very easy to clean when compared to other types of sofa fabric. Since microfiber is water repellant, it handles spills well, keeping them on the surface rather than letting them seep into the sofa’s padding and potentially causing smells. Another way to search for sofas and sofa fabric on eBay is by clicking the Home, Outdoors & Decor category on the eBay homepage and then selecting Home & Garden. Next, click Furniture, then Sofas, Loveseats & Chaises, and then click the checkbox beside Sofa to see all of the applicable listings."}]