[{"url": "https://en.wikipedia.org/wiki/Federal_Government_of_the_United_States", "passage_text": "The government of the United States of America is the federal government of the republic of fifty states that constitute the United States, as well as one capital district, and several other territories. The government was formed in 1789, making the United States one of the world's first, if not the first, modern national constitutional republics. The United States government is based on the principle of federalism, in which power is shared between the federal government and state governments."}, {"url": "https://en.wikipedia.org/wiki/Politics_of_the_United_States", "passage_text": "The United States is a federal constitutional republic, in which the President of the United States (the head of state and head of government), Congress, and judiciary share powers reserved to the national government, and the federal government shares sovereignty with the state governments. "}, {"url": "http://www.answers.com/Q/What_kind_of_government_does_the_United_States_have", "passage_text": "The United Kingdom consists of England, Scotland, Wales and Northern Ireland. The United Kingdom has a Constitutional Monarchy and a parliamentary democracy We do not have a … president, the leader of our government is called the Prime Minister. Broken down further... Constitution-based: The Constitution of the United States of America acts as the highest and supreme law of the Union. Federal: The separate states are united by a central (federal) government. Republic: A form of government where the head of state or of the executive is not a monarch."}, {"url": "https://en.wikipedia.org/wiki/Federal_Government_of_the_United_States", "passage_text": "The full name of the republic is United States of America. No other name appears in the Constitution, and this is the name that appears on money, in treaties, and in legal cases to which it is a party (e.g. , Charles T. Schenck v. United States). The terms Government of the United States of America or United States Government are often used in official documents to represent the federal government as distinct from the states collectively. The government was formed in 1789, making the United States one of the world's first, if not the first, modern national constitutional republics. The United States government is based on the principle of federalism, in which power is shared between the federal government and state governments."}, {"url": "http://www.answers.com/Q/What_kind_of_government_does_the_US_have", "passage_text": "The United States is a federal republic, a federation of states with a republican form of government, i.e., a representative democracy, where the citizens elect their representatives for fixed terms of office. Ben Franklin was asked by a woman What type of government do we have? as he left the ratification of the Constitution. His reply was A Republic Ma'am ... if you can k … eep it!. Upon it's ratification, the Constitution of the United States of America established the United States as a Constitutional Republic."}, {"url": "http://libertarianviewpoint.com/blog/what-type-of-government-do-we-really-have/", "passage_text": "The United States, at one time, was a republic. We are today a republic in name only. Long gone are the days where the citizens were libertarian minded and held the government accountable. Not since the civil war have we seen those types of days. "}, {"url": "http://www.answers.com/Q/What_kind_of_government_does_the_United_States_have", "passage_text": "According to the CIA World Factbook the United States of America's government type is a Constitution-based federal republic with a strong democratic tradition. Broken down further... Constitution-based: The Constitution of the United States of America acts as the highest and supreme law of the Union. Federal: The separate states are united by a central (federal) government. Republic: A form of government where the head of state or of the executive is not a monarch."}, {"url": "http://www.answers.com/Q/What_kind_of_government_does_the_United_States_have", "passage_text": "The United States of America is a republic. A republic is a form of  government in which there are laws that limit the powers of  government.    The United States is … NOT a democracy. A democracy is where the  majority rules. Broken down further... Constitution-based: The Constitution of the United States of America acts as the highest and supreme law of the Union. Federal: The separate states are united by a central (federal) government. Republic: A form of government where the head of state or of the executive is not a monarch."}, {"url": "https://answers.yahoo.com/question/index?qid=20101112112700AAcdL4o", "passage_text": "Report Abuse. The United States of America's government is a democratic republic. A democratic republic is a form of government in which is a mixture if a democracy and republic. Source(s): My teacher and my textbook. Majlinda · 1 year ago. We the People in this Country can easily outrank the government in every way shape and form by using the 10th Amendment to the Constitution under the powers to the people provision."}]