[{"url": "http://www.thefreedictionary.com/macroscopic+anatomy", "passage_text": "Noun. 1. macroscopic anatomy-the study of the structure of the body and its parts without the use of a microscope. gross anatomy. anatomy, general anatomy-the branch of morphology that deals with the structure of animals. dental anatomy-the branch of gross anatomy concerning with the morphology of teeth. 1  Facebook. "}, {"url": "http://medical-dictionary.thefreedictionary.com/microscopic+anatomy", "passage_text": "gross anatomy. that dealing with structures visible with the unaided eye. Called also macroscopic anatomy. macroscopic anatomy. see gross anatomy (above). microscopic anatomy. anatomy revealed by microscopy; includes histology and cytology. morbid anatomy. anatomy of diseased tissues. gross anatomy (macroscopic anatomy) that dealing with structures visible with the unaided eye. microscopic anatomy histology. morbid anatomy (pathologic anatomy) anatomy of diseased tissues. radiologic anatomy x-ray anatomy."}, {"url": "https://www.kenhub.com/en/library/anatomy/the-uterus", "passage_text": "Macroscopic anatomy. The uterus (womb) is an about 8 cm long hollow organ in the female pelvis and lies dorsocranially on the bladder. "}, {"url": "http://www.thefreedictionary.com/microscopic+anatomy", "passage_text": "Noun. 1. microscopic anatomy-the study of microscopic structures of tissues and organs. anatomy, general anatomy-the branch of morphology that deals with the structure of animals. cytology-the branch of biology that studies the structure and function of cells. "}, {"url": "http://medical-dictionary.thefreedictionary.com/microscopic+anatomy", "passage_text": "microscopic anatomy, the study of the microscopic structure of the tissues and cells. Kinds of microscopic anatomy are cytology and histology. An obsolete term for histology or, as commonly used, histopathology. gross anatomy (macroscopic anatomy) that dealing with structures visible with the unaided eye. microscopic anatomy histology. morbid anatomy (pathologic anatomy) anatomy of diseased tissues. radiologic anatomy x-ray anatomy."}, {"url": "http://encyclopedia2.thefreedictionary.com/macroscopic+anatomy", "passage_text": "(ənăt`əmē) , branch of biology concerned with the study of body structure of various organisms, including humans. Comparative anatomy is concerned with the structural differences of plant and animal forms. "}, {"url": "http://www.audioenglish.org/dictionary/macroscopic_anatomy.htm", "passage_text": "• MACROSCOPIC ANATOMY (noun). The noun MACROSCOPIC ANATOMY has 1 sense: 1. the study of the structure of the body and its parts without the use of a microscope. Familiarity information: MACROSCOPIC ANATOMY used as a noun is very rare."}, {"url": "http://emedicine.medscape.com/article/1948775-overview", "passage_text": "Overview. The kidneys are paired retroperitoneal structures that are normally located between the transverse processes of T12-L3 vertebrae, with the left kidney typically somewhat more superior in position than the right. The upper poles are normally oriented more medially and posteriorly than the lower poles. "}, {"url": "http://medical-dictionary.thefreedictionary.com/macroscopic+anatomy", "passage_text": "gross anatomy (macroscopic anatomy) that dealing with structures visible with the unaided eye. microscopic anatomy histology. morbid anatomy (pathologic anatomy) anatomy of diseased tissues. radiologic anatomy x-ray anatomy. that dealing with structures visible with the unaided eye. Called also macroscopic anatomy. macroscopic anatomy. see gross anatomy (above). microscopic anatomy. anatomy revealed by microscopy; includes histology and cytology. morbid anatomy. anatomy of diseased tissues. Called also pathological anatomy."}]