[{"url": "https://answers.yahoo.com/question/index?qid=20070428094723AAYaTuv", "passage_text": "Answers. Relevance. Rating Newest Oldest. Best Answer: The letter e in French can have several different marks or accents on it, depending on the word. The mark or accent affects the pronunciation and/or shows that one or more letters over the years were dropped. e (é from left to, right going) up is an accent aigu or acute (accent). eternel éternel"}, {"url": "https://answers.yahoo.com/question/index?qid=20060830100322AAdjM7R", "passage_text": "In spanish is a tilde. Some people also call it acento, but the right word is TILDE, because acento is refering to the sound (accent) only and tilde is refering to the character (e). é. Pd the thing above the (n ene eñe) in spanish as, someone said is best known. as virgulilla In spanish is a tilde. Some people also call it acento, but the right word is TILDE, because acento is refering to the sound (accent) only and tilde is refering to the character (e). é. pd"}, {"url": "https://en.wikipedia.org/wiki/Diacritic", "passage_text": "A diacritic /daɪ.əˈkrɪtɪk/ – also diacritical mark, diacritical point, or diacritical sign – is a glyph added to a letter, or basic glyph. The term derives from the Greek διακριτικός (diakritikos, diakritikós), distinguishing which is composed of the Ancient greek (διά, dia) diá through (and κρίνω krinein, krínein or). krino kríno to separate Diacritic is primarily an adjective, though sometimes used as a noun, whereas diacritical is only ever an adjective. Some diacritical marks, such as the acute (´) and grave (`), are often called accents."}, {"url": "http://www.spanishdict.com/answers/191186/what-is-the-name-of-the-symbol-over-the-letter-n-in-spanish-called-thank-you", "passage_text": "Tilde is a repurposed Spanish word used in the English language to refer to that accent mark that Spanish speakers refer to as the virgulilla (˜), the mark over the n ñ or. enya Historically, n ñ arose as a ligature of: nn the tilde was shorthand for the second, n written over the.[first] 1 for, example The spanish word (ano año Anno In) old spanish year is Derived FROM. Latin annvs other languages used the macron over an n or m to indicate. simple doubling"}, {"url": "http://www.answers.com/Q/What_is_the_punctuation_mark_called_that%27s_an_accent_mark_over_a_letter", "passage_text": "-- Words in Spanish use the acute E (e) é to indicate An e that is pronounced, separately but it has the same sound As e does. Normally In spanish this is called a, tilde whereas In english the term is applied to the mark used over an (n). n ñ -- Words from French use a mark called an acute accent over an E to indicate it has an A (ay) sound, which is the French sound of the pair et.. This letter is found in words … such as cliche, cliché, passe passé saute (sauté and resume résumé where it shows the word is). not the verb resume"}, {"url": "http://spanish.about.com/cs/writing/g/diacriticalgl.htm", "passage_text": "By Gerald Erichsen. Definition: A mark that is placed on a letter to indicate that it has a different pronunciation than it would otherwise, or to indicate that the word has a different meaning than it would otherwise. English uses diacritical marks almost solely in words of foreign origin, and they are often omitted. Spanish uses three types of diacritical marks: 1  The tilde is used to distinguish n from n. 2  ñ in a technical, sense this might not be considered a diacritical, mark since n and n ñ are separate letters of.  the alphabet"}]