[{"url": "https://answers.yahoo.com/question/index?qid=20081117184033AAuh2oi", "passage_text": "Answers. Best Answer: RENAL VEIN = are veins that drain the kidney. They connect the kidney to the inferior vena cava (the large vein that carries de-oxygenated blood from the lower half of the body into the right atrium of the heart). RENAL ARTERY = supply the kidneys with blood. They carry a large portion of total blood flow to the kidneys. Up to a third of total cardiac output can pass through the renal arteries to be filtered by the kidneys. Arteries = has thick intermediate layers of elastic and mascular fibers."}, {"url": "http://www.healthline.com/human-body-maps/renal-veins", "passage_text": "Renal veins. There are two renal veins, a left and a right. They branch off the inferior vena cava and drain oxygen-depleted blood from the kidneys. As they enter the kidneys, each vein separates into two parts. The posterior veins assist in draining the back section of each kidney, while the anterior veins assist the front part. To simplify, the aorta carries blood to the kidneys while veins move the blood away. There are two notable diseases that involve the renal veins. If a clot (or thrombus) develops, this can cause renal vein thrombosis (RVT)."}, {"url": "https://en.wikipedia.org/wiki/Renal_artery", "passage_text": "From Wikipedia, the free encyclopedia. The renal arteries normally arise off the side of the abdominal aorta, immediately below the superior mesenteric artery, and supply the kidneys with blood. Each is directed across the crus of the diaphragm, so as to form nearly a right angle with the aorta. Due to the position of the aorta, the inferior vena cava, and the kidneys in the body, the right renal artery is normally longer than the left renal artery. 1  The right passes behind the inferior vena cava, the right renal vein, the head of the pancreas, and the descending part of the duodenum."}, {"url": "http://www.meritnation.com/ask-answer/question/where-does-oxygenated-blood-enter-the-kidneys/life-processes/5074111", "passage_text": "Renal arteries provides oxygenated blood to the kidneys. Renal arteries arise from the abdominal aorta and supply kidney with oxygenated blood. Posted by Ritika Goyal (MeritNation Expert) on 13/6/13. This conversation is already closed by Expert. "}, {"url": "http://www.answers.com/Q/What_do_renal_veins_and_arteries_do", "passage_text": "The renal vein consists of deoxygenated blood that has been filtered from the kidney to the venacava. The renal artery carries oxygenated blood that consists of waste products. The blood in the Renal Vein:   * Is low in oxygen.  * Returns to the heart.   The blood in the Renal Artery:   * Has high amounts of oxygen."}]