[{"url": "http://www.ducksters.com/science/chemistry/sulfur.php", "passage_text": "Sulfur is the second element in the sixteenth column of the periodic table. It is classified as a nonmetal. Sulfur atoms have 16 electrons and 16 protons with 6 valence electrons in the outer shell. Sulfur is the tenth most abundant element in the universe. Sulfur can take the form of over 30 different allotropes (crystal structures). This is the most allotropes of any element"}, {"url": "http://www.answers.com/Q/Is_sulfur_abundant_in_nature", "passage_text": "sulfur is roughly as abundant in the earth's crust as carbon. sulfur is abundant and widely distributed in nature, occurring in element for as yellow crystal, in the sulfide. "}, {"url": "http://hyperphysics.phy-astr.gsu.edu/hbase/tables/elabund.html", "passage_text": "The composition of the human body is seen to be distinctly different from the abundance of the elements in the Earth's crust. The elements upon which life is based are often summarized by the combination CHONPS, carbon, hydrogen, oxygen, nitrogen, phosphorous and sulfur. All others. 1.5. Given the abundance of oxygen and silicon in the crust, it should not be surprising that the most abundant minerals in the earth's crust are the silicates. Although the Earth's material must have had the same composition as the Sun originally, the present composition of the Sun is quite different."}, {"url": "http://www.mapsofworld.com/minerals/world-sulphur-producers.html", "passage_text": "Sulfur is an abundant, yellow-colored multivalent non-metal. It is found as a pure element in nature and also as sulfide and sulfate minerals. Sulfur had been known and used since a long time in ancient Greece, China, and Egypt. "}, {"url": "http://sulferandyou.tripod.com/id14.html", "passage_text": "Location of Sulfur. Where you can find sulfur. On this page you will be told where sulfur can be found on Earth, or in Space. Sulfur can be found in very wierd and odd places. One place sulfur can be found in is rotten eggs, yes very gross indeed. An unusual place it can be found in, is meteorites. "}, {"url": "http://enviroliteracy.org/air-climate-weather/biogeochemical-cycles/sulfur-cycle/", "passage_text": "Sulfur Cycle. Sulfur (S), the tenth most abundant element in the universe, is a brittle, yellow, tasteless, and odorless non-metallic element. It comprises many vitamins, proteins, and hormones that play critical roles in both climate and in the health of various ecosystems. Sulfur (S), the tenth most abundant element in the universe, is a brittle, yellow, tasteless, and odorless non-metallic element"}, {"url": "http://www.livescience.com/28939-sulfur.html", "passage_text": "If the stench is of rotten eggs, it might just be the fault of sulfur. This bright yellow element, known in the Bible as brimstone, is abundant in nature, and was used for a variety of purposes in ancient times. A nonmetal, sulfur is the 10th most abundant element in the universe, according to the Jefferson National Linear Accelerator Laboratory. Today, it's most common use is in the manufacture of sulfuric acid, which in turn goes into fertilizers, batteries and cleaners. It's also used to refine oil and in processing ores."}, {"url": "https://en.wikipedia.org/wiki/Sulfur", "passage_text": "Sulfur is an essential element for all life, but almost always in the form of organosulfur compounds or metal sulfides. Three amino acids (cysteine, cystine, and methionine) and two vitamins (biotin and thiamine) are organosulfur compounds. Elemental sulfur occurs naturally as the element (native sulfur), but most commonly occurs in combined forms as sulfide and sulfate minerals. Being abundant in native form, sulfur was known in ancient times, being mentioned for its uses in ancient India, ancient Greece, China, and Egypt."}, {"url": "https://en.wikipedia.org/wiki/Sulfur", "passage_text": "Sulfur or sulphur (see spelling differences) is a chemical element with symbol S and atomic number 16. It is an abundant, multivalent non-metal. Under normal conditions, sulfur atoms form cyclic octatomic molecules with chemical formula S 8. Elemental sulfur is a bright yellow crystalline solid at room temperature. Elemental sulfur occurs naturally as the element (native sulfur), but most commonly occurs in combined forms as sulfide and sulfate minerals. Being abundant in native form, sulfur was known in ancient times, being mentioned for its uses in ancient India, ancient Greece, China, and Egypt."}]