[{"url": "http://thelatinkitchen.com/r/recipe/puerto-rican-habichuelas-rosadas", "passage_text": "Cook over medium heat for 20 minutes. Add 1-cup water and continue cooking until tender, 25 to 40 minutes. In a skillet, heat oil, then add remaining ingredients, except potato, to make the sofrito. Turn down heat and simmer for 5 minutes. Add sofrito mixture and diced potato to beans. Turn on heat again to medium and cook additional 20 minutes or until mixture thickens and potatoes are fork-tender. "}, {"url": "http://www.puertoricodaytrips.com/habichuelas-recipe/", "passage_text": "This food is healthy, yet inexpensive and hardy. It is old-fashioned, down-home, country cooking. My favorite Puerto Rican dish is Arroz con Habichuelas, or rice and beans. The beans are actually a stew, with potatoes, squash, other veggies, some ham and, of course, beans. I eat this, served over rice, for a meal whenever I can find it. You may have to poke around in the ethnic aisle of your supermarket for some of the ingredients. This recipe will feed about 12 people as a side dish or 6 people as a main dish. Vegetarians can make this without the ham (and using vegetable stock instead of ham stock) and it still tastes great."}, {"url": "http://www.dominicancooking.com/979-habichuelas-con-dulce-sweet-creamed-beans.html", "passage_text": "1 Change the water and boil until soft in abundant water. 2  Put the beans (and the water in which they boiled) in a blender a puree. 3  Strain the beans to get rid of the skins and undissolved solids. 4  Pour the beans, coconut milk and half the milk into a pot and bring to a boil over medium heat. 1 Add the rest of the milk, sugar, raisins, cinnamon, cloves and sweet potatoes and boil for 10 minutes. 2  Stir regularly to avoid sticking. 3  Boil until it has reduced to about ¾ of the original volume-the cream of beans will get much thicker when chilled)."}, {"url": "http://healthyeating.sfgate.com/nutrition-habichuelas-con-dulce-2519.html", "passage_text": "Ingredients and Serving Suggestions. Habichuelas con dulce contains red kidney beans, raisins, butter, coconut milk, evaporated milk, sweet potato, salt, ground cinnamon and ground cloves. Go light on the salt to lower the sodium -- each teaspoon has 2,325 milligrams, which is more than a healthful daily limit. "}, {"url": "http://www.goya.com/english/recipes/habichuelas-guisadas", "passage_text": "Made with a handful of convenient signature GOYA products, this Habichuelas Guisadas recipe gets an extra boost of flavor from Goya Recaito, a savory mixture of cilantro, garlic, and onion. A delicious, easy stewed beans recipe that tastes like it s made in the islands! Ingredients. 2 tbsp. GOYA Olive Oil 1 small onion, finely chopped (about 1 cup) 1 jar (4 oz.) GOYA Fancy Red Pimientos, drained and finely chopped green bell pepper, finely chopped (about cup) 1 tsp. GOYA Minced Garlic, or 3 cloves garlic, finely chopped 1/2 cup GOYA Tomato Sauce 1 tbsp. GOYA Reca to 1 tsp."}, {"url": "http://www.dominicancooking.com/979-habichuelas-con-dulce-sweet-creamed-beans.html", "passage_text": "1 Pour the beans, coconut milk and half the milk into a pot and bring to a boil over medium heat. 2  Add the rest of the milk, sugar, raisins, cinnamon, cloves and sweet potatoes and boil for 10 minutes. 3  Stir regularly to avoid sticking. 1 Add the rest of the milk, sugar, raisins, cinnamon, cloves and sweet potatoes and boil for 10 minutes. 2  Stir regularly to avoid sticking. 3  Boil until it has reduced to about ¾ of the original volume-the cream of beans will get much thicker when chilled)."}, {"url": "http://allrecipes.com/recipe/52489/habichuelas-guisadas/", "passage_text": "1 Heat oil in a saucepan over low heat. 2  Add tomato sauce, sofrito, sazon, and pepper. 3  Cook, stirring for about 3 minutes. 4  Stir in beans, water, and salt. 5  Increase heat to medium, and cook for 15 minutes, or until sauce has thickened. 1 Add tomato sauce, sofrito, sazon, and pepper. 2  Cook, stirring for about 3 minutes. 3  Stir in beans, water, and salt. 4  Increase heat to medium, and cook for 15 minutes, or until sauce has thickened."}, {"url": "http://www.elagasse.com/hab_guisadas.html", "passage_text": "If using dry beans: a-Rinse the dry beans in a strainer or colander, and remove any small stones or damaged beans. b-If you have the time, simply soak the cup of dry beans in cold water overnight. c-If you are making the beans the same day, bring the beans to a boil for 2 minutes in 3 cups of water."}, {"url": "http://www.goya.com/english/recipes/habichuelas-con-dulce-sweet-dominican-beans", "passage_text": "In the Dominican Republic, Lent (called cuaresma) is not complete without a sweet bowl of Habichuelas con Dulce Dominican Sweet Cream of Beans. There, pureed red kidney beans are cooked with coconut milk and evaporated milk, sweetened with sugar and spiced with cloves and cinnamon to make a thick, creamy dessert. 1. In large bowl, add beans and enough water to cover beans by 3. Cover; soak 12 hours. Drain beans, reserving soaking liquid. Add enough water to soaking liquid to make 10 cups total; transfer to large, heavy pot set over medium-high heat. Bring water to boil."}]