[{"url": "http://study.com/academy/lesson/what-is-organizational-structure-of-management-types-examples-quiz.html", "passage_text": "Organizational Structure of Management. An organizational structure lays the foundation for how a company operates. It is a set of policies and rules that determines: 1  How an organization controls and delegates tasks and responsibilities. 2  How decisions are made and implemented throughout every part of an organization. "}, {"url": "http://smallbusiness.chron.com/different-types-organizational-structure-723.html", "passage_text": "Functional Structure. Functional structure is set up so that each portion of the organization is grouped according to its purpose. In this type of organization, for example, there may be a marketing department, a sales department and a production department. Different Types of Organizational Structure. Organizations are set up in specific ways to accomplish different goals, and the structure of an organization can help or hinder its progress toward accomplishing these goals."}, {"url": "http://www.slideshare.net/xenna_85/organizational-structure-26872255", "passage_text": "1 1. 2  ORGANIZATIONAL STRUCTURE Nursing 005 Mary Ann Adiong, RN, USRN-Masterand University of Bohol Graduate School & Professional Studies Department Tagbilaran City, Bohol, Philippines. 3  2. 4  OBJECTIVES: At the end of this report, the student should be able to: 1. Discuss the definition of organizational structure 2. "}, {"url": "http://www.businessdictionary.com/definition/organizational-structure.html", "passage_text": "Definition. The typically hierarchical arrangement of lines of authority, communications, rights and duties of an organization. Organizational structure determines how the roles, power and responsibilities are assigned, controlled, and coordinated, and how information flows between the different levels of management. "}, {"url": "http://smallbusiness.chron.com/meaning-organizational-structure-3803.html", "passage_text": "An organizational structure defines a hierarchy and where each job reports to. top of the chart image by Steve Johnson from Fotolia.com. Organizational structure is a system used to define a hierarchy within an organization. It identifies each job, its function and where it reports to within the organization."}, {"url": "http://www.dsperformancegroup.com/?submit=Infrastructure", "passage_text": "Organizational Infrastructure. Define, Analyze & Change. Infrastructure is how companies organize the people side of their business. It establishes roles, responsibilities, authority, focus, and control within the organization. "}, {"url": "http://www.investopedia.com/terms/o/organizational-structure.asp", "passage_text": "DEFINITION of 'Organizational Structure'. Explicit and implicit institutional rules and policies designed to provide a structure where various work roles and responsibilities are delegated, controlled and coordinated. Organizational structure also determines how information flows from level to level within the company. "}, {"url": "http://www.referenceforbusiness.com/management/Ob-Or/Organizational-Structure.html", "passage_text": "It is these decisions that determine the organizational structure. In an organization of any size or complexity, employees' responsibilities typically are defined by what they do, who they report to, and for managers, who reports to them. IN ORGANIZATIONAL STRUCTURE. Except for the matrix organization, all the structures described above focus on the vertical organization; that is, who reports to whom, who has responsibility and authority for what parts of the organization, and so on."}, {"url": "http://www.inc.com/encyclopedia/organizational-structure.html", "passage_text": "IMAGE: Advertisement. An organizational structure defines the scope of acceptable behavior within an organization, its lines of authority and accountability, and to some extent the organization's relationship with its external environment. "}]