[{"url": "http://missionscience.nasa.gov/ems/02_anatomy.html", "passage_text": "Electromagnetic waves are formed by the vibrations of electric and magnetic fields. These fields are perpendicular to one another in the direction the wave is traveling. Once formed, this energy travels at the speed of light until further interaction with matter. These changing fields form electromagnetic waves. Electromagnetic waves differ from mechanical waves in that they do not require a medium to propagate. This means that electromagnetic waves can travel not only through air and solid materials, but also through the vacuum of space."}, {"url": "http://www.answers.com/Q/What_are_electromagnetic_waves_made_of", "passage_text": "Electromagnetic waves are made up of particles called Photons. Electromagnetic waves carries by the small particles named  Photon . Electromagnetic waves are made of photon charges, E=hf=hc/r = zQ2c/r, where Q is the photon charge= 4/3 E-18 Coulombs = 8 1/3 Electrons=(13U,1d) Quark. an electric field and a magnetic field that are orthogonal to each other and oscillating at the same frequency. As the electric and magnetic fields move back and forth, they create the same waves being emitted from them. They waves are called electromagnetic waves/radiation. There are 7 classifications of these waves. Radiowaves, microwaves, infrared, visible light, ultraviolet light, X-rays, and gamma rays."}, {"url": "http://www.qrg.northwestern.edu/projects/vss/docs/thermal/3-what-makes-em-radiation.html", "passage_text": "Electromagnetic radiation is a form of energy. The light that we see is a type of electromagnetic radiation. However it is only a very small part of the entire electromagnetic spectrum. Sound, another form of energy, is not part of this spectrum. Electromagnetic radiation is different from sound in that it can travel in space and does not need a medium like air or water to travel through. Electromagnetic radiation is made when an atom absorbs energy. The absorbed energy causes one or more electrons to change their locale within the atom. When the electron returns to its original position, an electromagnetic wave is produced. "}, {"url": "http://physics.bu.edu/~duffy/py106/EMWaves.html", "passage_text": "Light is not the only example of an electromagnetic wave. Other electromagnetic waves include the microwaves you use to heat up leftovers for dinner, and the radio waves that are broadcast from radio stations. Properties of electromagnetic waves. Something interesting about light, and electromagnetic waves in general, is that no medium is required for the wave to travel through. Other waves, such as sound waves, can not travel through a vacuum. An electromagnetic wave is perfectly happy to do that."}, {"url": "https://en.wikipedia.org/wiki/Electromagnetic_radiation", "passage_text": "Electromagnetic radiation (EM radiation or EMR) is the radiant energy released by certain electromagnetic processes. Visible light is one type of electromagnetic radiation, other familiar forms are invisible electromagnetic radiations such as radio waves, infrared light and X rays. Electromagnetic waves are produced whenever charged particles are accelerated, and these waves can subsequently interact with any charged particles. EM waves carry energy, momentum and angular momentum away from their source particle and can impart those quantities to matter with which they interact."}, {"url": "https://en.wikipedia.org/wiki/Electromagnetic_radiation", "passage_text": "Classically, electromagnetic radiation consists of electromagnetic waves, which are synchronized oscillations of electric and magnetic fields that propagate at the speed of light through a vacuum. Electromagnetic waves are produced whenever charged particles are accelerated, and these waves can subsequently interact with any charged particles. EM waves carry energy, momentum and angular momentum away from their source particle and can impart those quantities to matter with which they interact."}, {"url": "https://en.wikipedia.org/wiki/Electromagnetic_radiation", "passage_text": "The electromagnetic waves that compose electromagnetic radiation can be imagined as a self-propagating transverse oscillating wave of electric and magnetic fields. Electromagnetic waves are produced whenever charged particles are accelerated, and these waves can subsequently interact with any charged particles. EM waves carry energy, momentum and angular momentum away from their source particle and can impart those quantities to matter with which they interact."}, {"url": "http://emwaves69.weebly.com/index.html", "passage_text": "Light, microwaves, x-rays, and TV and radio transmissions are all kinds of electromagnetic waves. Different waves are made by their wavelengths. Electric fields are created by differences in voltage, the higher the voltage, the stronger will be the resultant field. Electromagnetic fields are found everywhere in nature, but are invisible to the human eye. There are also many human-made electromagnetic fields. An example of a human-made electromagnetic wave are X-Rays. There are many other types of waves that you can see on this website."}, {"url": "http://www.answers.com/Q/What_are_electromagnetic_waves_made_of", "passage_text": "No. Electromagnetic waves are part of a spectrum of energy waves that include radio waves, infra red, visible light through to ultraviolet and microwaves and gamma radiation. … Ultrasound waves are high frequency (beyond human hearing range) that are generated by vibration of crystals. As the electric and magnetic fields move back and forth, they create the same waves being emitted from them. They waves are called electromagnetic waves/radiation. There are 7 classifications of these waves. Radiowaves, microwaves, infrared, visible light, ultraviolet light, X-rays, and gamma rays."}, {"url": "http://science.hq.nasa.gov/kids/imagers/ems/waves2.html", "passage_text": "The magnetic and electric fields of an electromagnetic wave are perpendicular to each other and to the direction of the wave. James Clerk Maxwell and Heinrich Hertz are two scientists who studied how electromagnetic waves are formed and how fast they travel. Electromagnetic waves are formed when an electric field (shown as blue arrows) couples with a magnetic field (shown as red arrows)."}]