[{"url": "http://www.saveur.com/gallery/Pear-Guide-10-Varieties-of-Pears", "passage_text": "Sampling ten varieties of fresh pears here at the SAVEUR office, the differences in flavor and texture were surprisingly clear; each has its own personality: biting into the sweet, bright Green Anjou is a completely different experience from the almost overwhelmingly floral Starkrimson."}, {"url": "http://typesofpears.net/", "passage_text": "Now that you know some of the benefits of pears in general, let’s take a look at some of the different types of pears. Anjou Pear. Anjou pears are typically available October through June. This is the type of pear that is commonly used for baking as they hold their flavor and texture even when cooked."}, {"url": "http://www.wisegeek.org/what-are-the-different-types-of-pears.htm", "passage_text": "There are over 5,000 pear varieties grown throughout the world, and distinctions are usually made between Asian, European and American cultivars. Asian pears are round, crunchy, and sweet fruit, quite different from what many tend to mean when we think of this word."}, {"url": "http://www.wisegeek.org/what-are-the-different-types-of-pears.htm", "passage_text": "Other names for the Asian pear include Japanese pear, Chinese pear, Taiwanese pear, Nashi pear, Oriental pear, Sand pear, salad pear, and Korean pear. They are also called apple pears because of their shape and because they have a crisp texture similar to apples. Most Asian pears that I see in the market in the US tend to be light brown in color and have white spots, and they usually come in a white, styrofoam-like mesh material. But, I think there are other types of Asian pears with a different shape and coloring."}, {"url": "http://localfoods.about.com/od/pears/ss/Pear-Varieties.htm", "passage_text": "Asian pears are super crunchy-more like crisp apples than other pears. They look more like apples than pears, too. While there are many varieties of Asian pears, the ones most commonly available in the U.S. are a very matte, tan color with a bit more texture and roughness to the skin than other apples or pears. Asian pears are great for eating raw, especially when sliced or diced into salads."}, {"url": "http://typesofpears.net/", "passage_text": "Bartlett pears are the types of pears most commonly used for canning. These pears are usually available from July to December. They can also be used in baking. Comice Pear. The comice pear is perfect to use in fruit displays as well as in salads. Like all the other types of pears, it is also wonderful eaten fresh."}]