[{"url": "https://answers.yahoo.com/question/index?qid=20080820070705AAHDUf8", "passage_text": "I have a 2000 Honda Accord that is leaking power steering fluid. We have located the leak to be coming from the pressure hose line. I honestly do not have to money to replace. A friend told me it might be possible to just seal the hose instead of replacing it."}, {"url": "http://www.simple-car-answers.com/Car-Power-Steering-Leak.html", "passage_text": "Another common area to find power steering fluid leaking is at a power steering line or pump seal, again, if the pump seal is leaking, it common practice to replace the entire pump instead of rebuilding it because of the special tools required to disassemble the pump."}, {"url": "http://www.carsdirect.com/car-repair/how-to-fix-a-power-steering-hose-leak", "passage_text": "There are 2 types of power steering hoses-a high pressure hose that carries the fluid from the pump to the rack and a low pressure hose that carries the fluid from the rack to the pump. You can probably identify a hose leak problem if you get a smell of burning oil under the hood of the car."}, {"url": "http://www.ehow.com/how_5025908_stop-power-steering-fluid-leaks.html", "passage_text": "Look on the hoses and gaskets to find from where the fluid could be leaking. Add power steering stop leak additive to your power steering fluid. Lucas Power Steering Stop Additive is 100 percent guaranteed to stop seal leaks. In older cars, the seals shrink, causing leaks."}, {"url": "http://lucasoil.com/products/problem-solvers-utility/lucas-power-steering-stop-leak", "passage_text": "It is 100% GUARANTEED to stop seal leaks in power steering units or your money back. Totally corrects rack and pinion problems. It is also totally effective in reducing slack, squeals and hard spots in worn rack and pinions. Your results will be immediate and long lasting."}, {"url": "https://answers.yahoo.com/question/index?qid=20100923201800AA9mmj3", "passage_text": "Usually the pump does not leak, so I would start by inspecting the high pressure hose and the rack to see if there is a leak in either. Jack the car up, and use jack stands to support it With the engine running, look at the ends of the steering rack to see if there is a leak."}, {"url": "http://www.simple-car-answers.com/Car-Power-Steering-Leak.html", "passage_text": "by Eddie Carrara. If you think you may have a car power steering leak, the first thing you should do is check the power steering fluid reservoir, if the fluid level in the reservoir is low, you just might have a leak in the power steering system."}, {"url": "http://www.brakeandfrontend.com/steering-racks-leak-diagnosis-repair/", "passage_text": "Now check the rack for leaks. If you see fluid dripping from the rack, the end seals are leaking and repairs are needed. If no leaks are found at the end seals, check the pinion input shaft seal and the hoses and pump. If a hose connection is leaking, you might be able to fix it by replacing the seals or O-rings."}]