[{"url": "http://www.cooks.com/rec/search/0,1-0,baked_venison_sausage,FF.html", "passage_text": "Mix meat and ... sauce over and bake at 325 to 350 degrees for about 1 hour and 15 minutes. Mix well, pour over meat mixture and bake as directed above. "}, {"url": "http://www.foodnetwork.com/recipes/emeril-lagasse/venison-stew-recipe.html", "passage_text": "In a large pot, over high heat, add the olive oil. In a mixing bowl, toss the venison with flour and Essence. When the oil is hot, sear the meat for 2 to 3 minutes, stirring occasionally. Add the onions and saute for 2 minutes. Add the celery and carrots. Season with salt and pepper. Saute for 2 minutes. Directions. "}, {"url": "http://motherhood.modernmom.com/baking-homemade-venison-sausage-casing-15164.html", "passage_text": "Put the sausages into the middle of the oven. Turn them over after 15 minutes. Continue cooking them for another 10 to 15 minutes, until they reach 160 F at center, as measured by an instant-read thermometer. Tip. 1  Try this sweet venison sausage preparation. 2  Melt two pats of butter in a large skillet over medium heat and stir in brown sugar and cinnamon to taste. 3  Lay large chunks of apple and pear in the pan and saute them for about 5 minutes."}, {"url": "https://answers.yahoo.com/question/index?qid=20080318142515AAQ2Kxh", "passage_text": "Relevance. Rating Newest Oldest. Best Answer: cooking deer sausage in the oven is nothing short of sausage heresy, you need to get a grill, some friends and a case of beer for proper deer sausage cookery. Then cook it till it is nice and brown and has a nice plump firm look to it, maybe 3-5 mins on each side, high heat. Report Abuse. you need to cook deer meat very slow not to fast so if your going to put it in the oven i would say around 325.f. for about 20 mins. liz_way · 8 years ago."}, {"url": "http://www.ehow.com/how_8220799_cook-deer-sausage.html", "passage_text": "Place the venison sausage links on a rack, allowing at least an inch between links, to account for swelling as they bake. Allow the venison sausages to cool for five minutes prior to consumption. Fry the venison sausage links in a pan instead of baking them if you want to eat them with less cooking time. Preheat the oven to either 140 or 280 degrees Fahrenheit, depending on how much time you have to cook the venison links -- or if you want to slow roast them. According to the Easy Cooking Guide, if the oven is set at 140 degrees Fahrenheit, the venison will take up to eight hours to cook."}, {"url": "http://motherhood.modernmom.com/baking-homemade-venison-sausage-casing-15164.html", "passage_text": "1 Try this sweet venison sausage preparation. 2  Melt two pats of butter in a large skillet over medium heat and stir in brown sugar and cinnamon to taste. 3  Lay large chunks of apple and pear in the pan and saute them for about 5 minutes. Tip. 1  Try this sweet venison sausage preparation. 2  Melt two pats of butter in a large skillet over medium heat and stir in brown sugar and cinnamon to taste. 3  Lay large chunks of apple and pear in the pan and saute them for about 5 minutes."}, {"url": "http://www.wikihow.com/Cook-Venison-(Deer-Meat)", "passage_text": "Cover and roast at 325 F for about 3 hours. Set the meat on the bed of vegetables and cover tightly with tin foil. Place into the oven and bake for around three hours, basting periodically with the juices from the bottom of the pan. If you're using a meat thermometer, you can remove the venison when it's reached an internal temperature between 130 F and 150 F, depending on how done you like your meat. 1 A good cast-iron skillet is the perfect way to cook a venison steak on the stove. 2  Heat the pan on medium-high heat, and add a tablespoon or two of olive oil before cooking. 3  The pan needs to be hot before adding the meat, to get the right sear on the outside. 4  Wait until the oil is just about to smoke to add the steak."}, {"url": "http://www.answers.com/Q/How_long_do_you_cook_raw_deer_sausage_in_the_oven", "passage_text": "Making the world better, one answer at a time. Slow method is 325 F for about 45 minutes to an hour turning links once or twice during the process. Or if you prefer faster cooking, 425 F for 17-19 minutes turning once or twice as well. Do not pierce sausages or they will lose their flavourable juices during baking! "}]