[{"url": "http://nickelodeon.wikia.com/wiki/The_Ren_%26_Stimpy_Show", "passage_text": "Throughout its run, The Ren & Stimpy Show was controversial for its off-color humor, black comedy, toilet humor, sexual innuendo, and violence, all of which contributed to the production staff's altercations with Nickelodeon's Standards and Practices department. 1 The Announcer Salesman: The Announcer Salesman serves as the multi-purpose loudmouth in the Ren and Stimpy show. 2  Sometimes, he is a salesman. 3  Other times, he is a narrator, an announcer, a dog show judge, a real estate agent, etc."}, {"url": "http://www.dragoart.com/tuts/2945/1/1/how-to-draw-stimpy-from-ren-and-stimpy.htm", "passage_text": "Stimpy is a red colored fat cat with a huge blue colored nose. He is mentally not all there and from the remarks, actions, and personality, I would say that he is definitely carrying an I.Q. of at least sixty five. Nevertheless, I love Stimpy just the same. "}, {"url": "http://renandstimpy.wikia.com/wiki/Stimpy", "passage_text": "Stimpson Stimpy. J. Cat is a 3-year old fat, dimwitted, and rotund red and white Manx cat with a brain that's the size of a peanut. He has a big, blue nose, dark blue eyes which can only be seen in close ups, flat feet, no tail, human-style buttocks, and a pair of white gloves. Afterward he would do nothing or just drool. In one episode Stimpy got tired of Ren's bullying and started to grow up, which made Ren scared in a way. In Nurse Stimpy, when Ren became ill, Stimpy became a nurse (hence Nurse Stimpy) and took care of him."}, {"url": "http://fastdecals.com/shop/comic-cartoon-decals/ren-and-stimpy-decals/", "passage_text": "Each Ren and Stimpy design can be made in any width and are measured LEFT TO RIGHT. Your Ren and Stimpy decal can be made in any color found on the color chart See the color chart for details. The white in the image is just a background color. Your Ren and Stimpy decal will not have a background; all Ren and Stimpy Decals are die-cut around the shape of the design. You may also choose to have a Shadow, Outline or Contour in an additional color. Click here for additional information."}, {"url": "https://en.wikipedia.org/wiki/The_Ren_and_Stimpy_Show", "passage_text": "The Ren & Stimpy Show, often simply referred to as Ren & Stimpy, is an American animated television series created by John Kricfalusi for Nickelodeon. The series follows the adventures of titular characters Ren, an emotionally unstable chihuahua, and Stimpy, a good-natured, dimwitted cat. Production of the series's pilot episode began around April 1989, after Kricfalusi pitched and sold The Ren & Stimpy Show to Nickelodeon. The pilot was produced by Kricfalusi's animation company, Spuemcoe, spümcø and screened at film festivals for several months before the show was announced In'nickelodeon s 1991-line. up"}, {"url": "https://en.wikipedia.org/wiki/Stimpy", "passage_text": "(Redirected from Stimpy). Ren and Stimpy, created by John Kricfalusi, are the titular characters in the American animated television series The Ren & Stimpy Show. Kricfalusi created the characters during his stay in Sheridan College and they first appeared on film in the pilot episode Big House Blues. Ren is a scrawny, violently psychotic chihuahua, and Stimpy is a fat, stupid cat. They are often at odds with each other on the show, though they do share moments of closeness together"}, {"url": "https://en.wikipedia.org/wiki/The_Ren_and_Stimpy_Show", "passage_text": "Ren & Stimpy premiered on August 11, 1991 as one of the original three Nicktoons, along with Rugrats and Doug. Throughout its run, the show was controversial for its off-color humor, sexual innuendo, and violence which were rare for television animation of that time. Production of the series's pilot episode began around April 1989, after Kricfalusi pitched and sold The Ren & Stimpy Show to Nickelodeon. The pilot was produced by Kricfalusi's animation company, Spuemcoe, spümcø and screened at film festivals for several months before the show was announced In'nickelodeon s 1991-line. up"}, {"url": "http://nickelodeon.wikia.com/wiki/The_Ren_%26_Stimpy_Show", "passage_text": "August 11, 1991 - November 14, 1996. IMDb. The Ren & Stimpy Show, often simply called Ren & Stimpy, is animated television series created by Canadian animator John Kricfalusi for Nickelodeon. The series focuses on the titular characters-Ren Hoeek, höek a psychotic, chihuahua And Stimpson. J, cat a-good, natured dimwitted. cat 1 The Announcer Salesman: The Announcer Salesman serves as the multi-purpose loudmouth in the Ren and Stimpy show. 2  Sometimes, he is a salesman. 3  Other times, he is a narrator, an announcer, a dog show judge, a real estate agent, etc."}, {"url": "https://en.wikipedia.org/wiki/Stimpy", "passage_text": "Stimpson Stimpy. J. Cat is a red and white, rotund cat with a blue nose, purple eyelids, no tail, hands with gloves that have fingernails, human-style buttocks, flat feet, and a brain the size of a peanut. Ren is a scrawny, violently psychotic chihuahua, and Stimpy is a fat, stupid cat. They are often at odds with each other on the show, though they do share moments of closeness together"}]