[{"url": "http://www.sfcdcp.org/hepatitisa.html", "passage_text": "Hepatitis A is a contagious liver infection caused by the hepatitis A virus (HAV). In the USA, hepatitis A infections have declined by 90% since the hepatitis A vaccine first became available in 1995. 1 Hepatitis A infection can be prevented by getting vaccine or immune globulin soon after coming into contact with the virus. 2  Persons who have recently been exposed to HAV should get immune globulin or vaccine as soon as possible, but not more than 2 weeks after the last exposure."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMH0001324/", "passage_text": "Acute hepatitis B is a short-term infection with the hepatitis B virus. Symptoms usually last several weeks but they can last up to 6 months. The infection sometimes clears up because your body is able to fight off the infection and get rid of the virus. Chronic hepatitis B is a long-lasting infection with the hepatitis B virus. Chronic hepatitis B occurs when the body can't get rid of the hepatitis B virus. Children, especially infants, are more likely to get chronic hepatitis B, which usually has no symptoms until signs of liver damage appear."}, {"url": "http://www.webmd.com/hepatitis/hepa-guide/understanding-hepatitis-treatment", "passage_text": "Viral hepatitis, such as hepatitis C (HCV), hepatitis B (HBV) and hepatitis A (HAV), is diagnosed by your symptoms, a physical exam, and blood tests. Someties imaging studies such as a sonogram or CAT scan and a liver biopsy are also used. "}, {"url": "http://www.cdc.gov/hepatitis/HAV/aFAQ.htm", "passage_text": "Hepatitis A is a contagious liver disease that results from infection with the Hepatitis A virus. It can range in severity from a mild illness lasting a few weeks to a severe illness lasting several months. People who have ever had a serious allergic reaction to the Hepatitis A vaccine or who are known to be allergic to any part of the Hepatitis A vaccine should not receive the vaccine. Tell your doctor if you have any severe allergies."}, {"url": "http://www.hepatitis.va.gov/patient/basics/liver-single-page.asp", "passage_text": "The damage to the liver can come from viruses, such as the hepatitis C virus, over-the-counter drugs, and prescription and street drugs. If your VA doctor starts you on a certain medication, he or she may need to monitor your blood chemistries to make sure the medication is not causing further harm to your liver. 1 If you have hepatitis C, you should also be tested for hepatitis B. The test can tell if you have ever been exposed to hepatitis B. If you are not already immune to hepatitis B, you should get vaccina"}, {"url": "http://www.cdc.gov/hepatitis/HAV/aFAQ.htm", "passage_text": "If you were recently exposed to Hepatitis A virus and have not been vaccinated against Hepatitis A, you might benefit from an injection of either immune globulin or Hepatitis A vaccine. However, the vaccine or immune globulin must be given within the first 2 weeks after exposure to be effective. People who have ever had a serious allergic reaction to the Hepatitis A vaccine or who are known to be allergic to any part of the Hepatitis A vaccine should not receive the vaccine. Tell your doctor if you have any severe allergies."}, {"url": "http://www.cdc.gov/hepatitis/HAV/aFAQ.htm", "passage_text": "1 Hepatitis A can be spread by eating or drinking food or water contaminated with the virus. ( 2 This can include frozen or undercooked food.) This is more likely to occur in countries where Hepatitis A is common and in areas where there are poor sanitary conditions or poor personal hygiene. People who have ever had a serious allergic reaction to the Hepatitis A vaccine or who are known to be allergic to any part of the Hepatitis A vaccine should not receive the vaccine. Tell your doctor if you have any severe allergies."}, {"url": "http://healthvermont.gov/prevent/hepatitis_b/index.aspx", "passage_text": "What is Hepatitis B. Hepatitis B is a virus that can cause liver cancer and can be prevented through a vaccine. Hepatitis B can cause short-term (acute) or long-term (chronic) infection in the liver. Chronic infection can lead to scarring of the liver, also known as cirrhosis, or can lead to liver cancer. Approximately 1.25 million people in the United States have chronic hepatitis B infection. The presence of these antibodies can tell your doctor or healthcare provider if you have been exposed to hepatitis B, if you have a chronic infection, or if you have previously received the hepatitis B vaccine."}, {"url": "http://www.cdc.gov/hepatitis/HAV/aFAQ.htm", "passage_text": "No. Once you recover from Hepatitis A, you develop antibodies that protect you from the virus for life. An antibody is a substance found in the blood that the body produces in response to a virus. Antibodies protect the body from disease by attaching to the virus and destroying it. People who have ever had a serious allergic reaction to the Hepatitis A vaccine or who are known to be allergic to any part of the Hepatitis A vaccine should not receive the vaccine. Tell your doctor if you have any severe allergies."}]