[{"url": "http://home.costhelper.com/landscape-design.html", "passage_text": "How much does cost? 1  Depending on the size and location of the project, it can cost anywhere from $300-$2,500 to have a landscape designer create a detailed plan for your property. Related articles: Sprinkler System, Deck, Sod. 1  Depending on the size and location of the project, it can cost anywhere from $300-$2,500 to have a landscape designer create a detailed plan for your property."}, {"url": "http://www.improvenet.com/a/how-much-does-landscaping-cost", "passage_text": "Like all landscaping projects, the average price to install sod depends on the size of your land and your climate. However, as our sod installation cost estimator dictates, homeowners can expect to pay $1,072 for such a project. This could be grass in the backyard, a few bushes and even a tree or two. Nevertheless, we have to start with the basics. According to our landscaping installation cost estimator, the average price to install landscaping is $3,538. This assumes no foundation has been laid and includes both the front and backyard. If you want to help your landscaper and save some dough, you must keep a few things in mind"}, {"url": "http://home.costhelper.com/landscape-design.html", "passage_text": "Landscape Design Cost. 1  Depending on the size and location of the project, it can cost anywhere from $300-$2,500 to have a landscape designer create a detailed plan for your property. Related articles: Sprinkler System, Deck, Sod. 1  Depending on the size and location of the project, it can cost anywhere from $300-$2,500 to have a landscape designer create a detailed plan for your property."}, {"url": "http://www.onlinegardendesign.com.au/landscaping-articles/how-much-does-landscaping-cost/", "passage_text": "Here is a rough outline of landscaping costs. Landscaping can cost anywhere from $20 an hour for minor work to $350 or more per hour for large and elaborate landscaping jobs.There are some big variables in the cost of landscaping works. According to landscaping professionals, if you’re starting from scratch, expect your landscaping to cost somewhere between 5 and 10 percent of the value of your home. If the landscaping job is not too complex, such as lawns and gardens on a level block, it will be closer to 5 percent."}, {"url": "http://www.homewyse.com/services/cost_to_grade_landscaping.html", "passage_text": "$0.88. Get an INSTANT estimate of the cost to Grade Landscaping! Our free calculator uses recent, trusted data to estimate costs for your Landscape Grading project. For a basic 500 square feet project in zip code 47474, the benchmark cost to Grade Landscaping ranges between $0.49 - $0.88 per square foot* . To estimate costs for your project: 1. Set Project Zip Code Enter the Zip Code for the location where labor is hired and materials purchased. "}, {"url": "http://www.landscapingnetwork.com/backyard-ideas/cost.html", "passage_text": "$9 - $15 per linear foot. A $25,000 budget is fairly common for sprucing up an existing backyard. The rule of thumb is to spend 10% of your home’s value on your yard and the average home price in the U.S. is roughly $220k-$270k. "}, {"url": "http://www.improvenet.com/r/costs-and-prices/landscape-designer-cost", "passage_text": "Average Costs. Nationally, the average price paid to a landscape designer is about $5,200. The range for most homeowners is between $4,200 and $6,200, but keep in mind that fees can vary considerably. The most in-depth projects may cost more than $10,000 to plan due to the significant number of variables at play."}, {"url": "http://www.landscapingnetwork.com/landscape-design/cost.html", "passage_text": "Pay-as-you-go Landscaping. Sustainable Landscape Rebates. A landscaping project can cost anywhere from $5,000 to over $100,000. When deciding on a budget keep in mind that investing in professional landscaping will greatly add to the value of your home. A general rule of thumb is to spend 10% of your home's value on landscaping. So, if you have a $400,000 house then a landscaping budget of $40,000 is appropriate."}]