[{"url": "http://www.answers.com/Q/What_is_the_Latin_translation_for_the_word_priceless", "passage_text": "What is the Latin translation for the word sport in Latin? The generally accepted word for 'sport' was the same as for 'game' and 'school'. Sum in casā (ablative), I am in the house.. Or, since Latin verbs usually come at the end of a sentence, In casam ambulō, and In casā sum.."}, {"url": "http://www.sheknows.com/baby-names/name/antonia", "passage_text": "The name Antonia is a Spanish baby name. In Spanish the meaning of the name Antonia is: Beyond praise. English Meaning: The name Antonia is an English baby name. In English the meaning of the name Antonia is: Highly praiseworthy. From a Roman clan name. In the 17th century, the spelling Anthony was associated with the Greek anthos meaning flower. Latin Meaning: The name Antonia is a Latin baby name. In Latin the meaning of the name Antonia is: Praiseworthy. Feminine of Anthony. "}, {"url": "https://answers.yahoo.com/question/index?qid=20080313184217AAZt4Mh", "passage_text": "Report Abuse. It is a fanciful notion. Everything has a price. However, the word means that something is so rare and wonderful as to be incomparable with anything that is in even the up-market price range. As an example, Picassos, Rembrandts and other masterpieces are astronomically expensive, but not priceless"}, {"url": "http://www.answers.com/Q/What_is_the_Latin_translation_for_the_word_priceless", "passage_text": "This can also mean 'on'. Note that the preposition in in Latin can be paired with and object of the preposition … in either the accusative OR ablative case. When used with an accusative case noun, the meaning is into, when used with an ablative case, the meaning is in. Example: Ambulō in casam (accusative), I walk into the house.. Sum in casā (ablative), I am in the house.. Or, since Latin verbs usually come at the end of a sentence, In casam ambulō, and In casā sum.."}, {"url": "http://www.babynology.com/meaning-anthony-m39.html", "passage_text": "From Greek origin its meaning is a€˜â flourishing or highly€™ praiseworthya praiseworthyâ From A roman clan name in the, 17th century The spelling anthony was associated With the greek anthos. meaning flower Anthony is from Latin origin, Clan name of the Romans, possibly meaning a€˜â beyond, price, invaluable, praiseworthy€™. flourishinga flourishingâ"}, {"url": "http://www.babynology.com/meaning-anthony-m39.html", "passage_text": "Name is derived from the Latin Antonius, which means “Priceless” and “of inestimable worth” . Anthony also appears in following countries/origins/languages: American, African, Australian, Chinese, Danish. Anthony is from Latin origin, Clan name of the Romans, possibly meaning a€˜â beyond, price, invaluable, praiseworthy€™. flourishinga flourishingâ"}, {"url": "http://www.babynology.com/meaning-anthony-m39.html", "passage_text": "Anthony is from Latin origin, Clan name of the Romans, possibly meaning a€˜â beyond, price, invaluable, praiseworthy€™. Flourishinga Flourishingâ, mark anthony the general who Ruled The roman empire Jointly with augustus for a. short time Anthony is from Latin origin, Clan name of the Romans, possibly meaning a€˜â beyond, price, invaluable, praiseworthy€™. flourishinga flourishingâ"}, {"url": "http://www.babynology.com/meaning-anthony-m39.html", "passage_text": "From Greek origin its meaning is a€˜â flourishing or highly€™ praiseworthya praiseworthyâ From A roman clan name in the, 17th century The spelling anthony was associated With the greek anthos. Meaning flower anthony also a Name, in basque its meaning€˜is a â he€™. adds or pricelessa pricelessâ Anthony is from Latin origin, Clan name of the Romans, possibly meaning a€˜â beyond, price, invaluable, praiseworthy€™. flourishinga flourishingâ"}]