[{"url": "http://www.instructables.com/id/How-to-Cook-and-Clean-a-Fresh-Dungeness-Crab/", "passage_text": "If you live on the Pacific coast, this is necessary information! Dungeness crabs are a fantastically tasty treat, as well as a lean, healthy, delicious holiday tradition. This Instructable will teach you how to cook and clean your own fresh Dungeness crab at home. "}, {"url": "http://www.turntablekitchen.com/recipes/how-to-cook-live-crab-at-home-paired-with-harissa-lemon-garlic-butter/", "passage_text": "4. While the crabs are cooking, prepare an ice bath by filling a large bowl with cold water and ice. Allow each crab to cook for approximately 15 minutes (once they float to the top, give them an extra 2-3 minutes). Once they are done, drop them briefly into the ice bath to stop the cooking process. 5."}, {"url": "http://blog.williams-sonoma.com/how-to-boil-fresh-crab/", "passage_text": "Cover the pot, turn the heat to medium-high, and bring just to a boil. When the water reaches a full boil, turn off the heat, leaving the lid on the pot. Let the crabs steep. Let blue crabs steep in the hot water for about 10 minutes. Larger Dungeness crabs need about 15 minutes. Using long tongs, lift the crabs from the water, turning them this way and that over the pot to drain away any water, and then transfer to a cutting board. Boiled Fresh Crab. Tip. This method also works for cooking lobsters: Cover the lobsters by 2 inches of cool water and add 1 1/2 tsp. salt per quart of water. Let small ones steep for 10 minutes; larger ones, 15."}, {"url": "http://wdfw.wa.gov/fishing/shellfish/crab/clean_prepare.html", "passage_text": "1. Cook it, then clean it. The easiest way to prepare your crab for eating is to cook it first and then clean it. Here’s how to proceed: Use about ¼ cup of salt per gallon of fresh water and bring to a boil. Immerse the whole crab and again bring the water to boiling. Boil for about 18-20 minutes. 1 Use about ¼ cup of salt per gallon of fresh water and bring to a boil. 2  Immerse the whole crab and again bring the water to boiling. 3  Boil for about 18-20 minutes. 4  Remove the crab from the pot and rinse under cool water to stop the cooking process and cool the shell for handling."}, {"url": "http://wdfw.wa.gov/fishing/shellfish/crab/clean_prepare.html", "passage_text": "The easiest way to prepare your crab for eating is to cook it first and then clean it. 1  Use about ¼ cup of salt per gallon of fresh water and bring to a boil. 2  Immerse the whole crab and again bring the water to boiling. 3  Boil for about 18-20 minutes. 1 Use about ¼ cup of salt per gallon of fresh water and bring to a boil. 2  Immerse the whole crab and again bring the water to boiling. 3  Boil for about 18-20 minutes. 4  Remove the crab from the pot and rinse under cool water to stop the cooking process and cool the shell for handling."}, {"url": "http://localfoods.about.com/od/crab/qt/How-To-Cook-Crab.htm", "passage_text": "Bring the water back to a boil and cook until the crabs start to float. Depending on the size of the crabs, this will happen in 10 to 15 minutes or so. Use tongs to remove the crabs and set them out until cool enough to handle. Bring an inch of salt water to a boil in a large pot. Put the crabs in a steamer basket or insert, or simply pile them into the pot and let the bottom crab or two boil slightly and act as a platform for the other crabs to steam. Cook 10 to 20 minutes, depending on the size of the crabs. Remove the steamer or pull the crabs out of the pot with tongs. However you cook the crabs, let them sit until cool enough to handle before you clean and serve them"}, {"url": "https://www.fishforthought.co.uk/Crabs.htm", "passage_text": "Cooking the Crab is the easy bit. 1. Using the largest saucepan/fish kettle you have, half fill with fresh water and add plenty of salt. We use half a cup to a gallon of water (150g to 4.5 litres) and bring to a vigorous boil. 2. Drop the crab in and bring back to the boil. 3. When the water comes back to the boil, start timing."}, {"url": "http://www.affordable-cape-cod-vacations.com/cooking-blue-crab.html", "passage_text": "Here's my tried-and-true method for cooking blue crab: 1  Put an inch or two of water into a big, sturdy pot. 2  Cover the pot, put it on the stove or over a hot campfire, and bring the water to a rolling boil. 3  When the water is boiling, drop your crabs into the pot. 4  Be sure not to pack them in too tightly. Here's my tried-and-true method for cooking blue crab: 1  Put an inch or two of water into a big, sturdy pot. 2  When the water is boiling, drop your crabs into the pot. 3  Put the lid back on the pot, and continue to boil on high heat for about 10 minutes. 4  Lift the lid and check on your crabs."}, {"url": "http://localfoods.about.com/od/crab/ss/How-To-Clean-Crab.htm", "passage_text": "To Boil: Bring a large pot of water to a boil. Add enough salt so it tastes as salty as the ocean. Add any spices or herbs you like (Old Bay has plenty of adherents, for example). Add the crabs and simmer until they are cooked through, 10 to 15 minutes depending on the size of the crabs. To Steam: Bring about an inch of salted water to boil in the bottom of a large pot. Set a steamer basket in the pot and the crabs in the basket or, if you have a lot of crabs, simply pile them in. Cover the pot and steam until the crabs are cooked through, 10 minutes for small blue crabs and 15 for larger Dungeness and up to 20 minutes for even bigger crabs. See more about How to Cook Crabs here."}]