[{"url": "http://www.memrise.com/course/265019/jeju-korean-dialectlanguage/", "passage_text": "Jeju 제주 Korean Dialect/Language The Jeju language, is a dialect of the Korean language, spoken on Jeju Island located in the Southern Most part of South Korea. It is currently listed as an endangered dialect and I'm trying my part to keep it's study alive. Currently in the making process. "}, {"url": "http://www.unesco.org/new/en/culture/themes/endangered-languages/news/dynamic-content-single-view-news/news/concerted_efforts_for_the_revitalization_of_jeju_language/", "passage_text": "The Framework for the preservation of Jeju language was revised and the superintendent of the Education Bureau was given the task of promoting Jeju in school education, through the introduction of several projects including a training programme for teachers and an oratory speech contest. The Jeju Island representatives of the Division of Cultural Affairs welcomed the inclusion of Jeju in the Interactive Atlas of the World’s Languages in Danger, and by the first encouraging results concerning the revitalization and the prominence given to this language."}, {"url": "https://en.wikipedia.org/wiki/Jeju_dialect", "passage_text": "The name is transcribed Jeju in Revised Romanization and Cheju in McCune-Reischauer. In Korean, it is known as 제주 방언 (濟州方言) Jeju bang-eon or 제주 사투리 Jeju saturi Jeju dialect, as 제주어 (濟州語) Jejueo Jeju language, or as 제주말 Jejumal Jeju speech. Although many South Koreans, including those who speak Jeju, consider it a dialect of the Korean language, it can be considered a separate language because it is nearly mutually unintelligible with Korean dialects of the mainland. It has been recognized as a distinct language locally and by UNESCO."}, {"url": "https://www.justlanded.com/english/South-Korea/South-Korea-Guide/Language/South-Korean-Language", "passage_text": "Several dialects are spoken in South Korea: The Seoul dialect (서울말), or Gyeonggi is spoken in Gyeonggi, Incheon, Seoul (South Korea), and Kaesŏng (North Korea). It is the basis of the standard language. The Yeongseo dialects (영서 방언) are spoken in the Yeongseo region of Gangwon Province in South Korea. The Chungcheong dialects (충청 방언) are the dialects of the Chungcheong (Hoseo) region of South Korea, including the city of Daejeon."}, {"url": "http://korea.wikia.com/wiki/Jeju-do", "passage_text": "358 pages on this wiki. Jeju is the smallest province of South Korea, situated on its largest island. Jeju is located in the Korea Strait, southwest of Jeollanam-do Province, which it was a part of until it became a separate province in 1946. Its capital is Jeju City. After the defeat of the Japanese, Jeju became an official part of the new Republic of Korea. In an incident known as the Cheju April 3rd Massacre, 20,000 Jeju Islanders were killed. The cause of this event is still disputed. Jeju was then a part of Jeolla until 1946, when it became a province of its own."}, {"url": "http://www.jejuweekly.com/news/articleView.html?idxno=1605", "passage_text": "With UNESCO’s inclusion of the Jeju dialect in the Atlas of the World’s Endangered Languages, the province’s Cultural Policy Division is fighting an uphill battle to keep the island’s language alive. The Jeju Language Contest is held every year as a way to preserve the language. The organization made the following statement: “It is a critically endangered language spoken by no more than 10,000 people on Jeju Island in the Republic of Korea. Its intergenerational transmission has been disrupted, as it is spoken fluently today only by people who are more than 70 years old.”."}, {"url": "https://en.wikipedia.org/wiki/Jeju_dialect", "passage_text": "Jeju (Cheju) is a Koreanic language spoken in Jeju Province in South Korea. It differs greatly from the Korean dialects of the mainland. Although many South Koreans, including those who speak Jeju, consider it a dialect of the Korean language, it can be considered a separate language because it is nearly mutually unintelligible with Korean dialects of the mainland. It has been recognized as a distinct language locally and by UNESCO."}, {"url": "https://www.justlanded.com/english/South-Korea/South-Korea-Guide/Language/South-Korean-Language", "passage_text": "The Jeju dialect (제주 방언) is spoken on the Jeju Island, off the southwest coast of South Korea, and is sometimes considered a separate Korean language. It is the basis of the standard language. The Yeongseo dialects (영서 방언) are spoken in the Yeongseo region of Gangwon Province in South Korea. The Chungcheong dialects (충청 방언) are the dialects of the Chungcheong (Hoseo) region of South Korea, including the city of Daejeon."}, {"url": "https://en.wikipedia.org/wiki/Jeju_dialect", "passage_text": "Name [edit]. The name is transcribed Jeju in Revised Romanization and Cheju in McCune-Reischauer. In Korean, it is known as 제주 방언 (濟州方言) Jeju bang-eon or 제주 사투리 Jeju saturi Jeju dialect, as 제주어 (濟州語) Jejueo Jeju language, or as 제주말 Jejumal Jeju speech. The last covers both language and dialect. Although many South Koreans, including those who speak Jeju, consider it a dialect of the Korean language, it can be considered a separate language because it is nearly mutually unintelligible with Korean dialects of the mainland. It has been recognized as a distinct language locally and by UNESCO."}]