[{"url": "https://en.wikipedia.org/wiki/List_of_actors_who_have_played_the_Doctor", "passage_text": "Since the beginning of the British science fiction television series Doctor Who in 1963, many actors have played the title character of The Doctor on television and in various BBC-licensed spin-offs on television, stage, radio, film, audio plays and webcasts. Episode 4. William Hartnell also played the Doctor in An Unearthly Child, also known as 'The Pilot Episode'. This was the first attempt at the first episode of the original series, filmed in September 1963, and first released on The Hartnell Years VHS in 1990."}, {"url": "http://mash.wikia.com/wiki/Oliver_Harmon_%22Spearchucker%22_Jones", "passage_text": "Oliver Harmon Spearchucker Jones. 860 pages on this wiki. Oliver Harmon Spearchucker Jones was a surgeon who appears in the MASH novel by Richard Hooker, the MASH movie and also in the M*A*S*H television series. He was portrayed by Fred Williamson in the movie and by Timothy Brown, who also played the part of corpsman Corporal Judson in the film"}, {"url": "http://www.nytimes.com/1996/03/13/nyregion/vince-edwards-67-the-doctor-in-the-hit-tv-series-ben-casey.html", "passage_text": "N.Y. Vince Edwards, who played a handsome, brooding neurosurgeon in the 1960's television series Ben Casey, died on Monday at the University of California Medical Center in Los Angeles. He was 67. The cause was pancreatic cancer, The Associated Press reported. In 1988, he played Ben Casey in the syndicated television movie The Return of Ben Casey.. In the 1960's, he recorded six record albums. In addition to his brother, he is survived by his wife, Janet, and three daughters, Angela, Nicole and Devera."}, {"url": "http://mentalfloss.com/article/29966/11-actors-who-have-played-doctor", "passage_text": "He was born to a large family, and all four of the McGann boys went into acting. He played a series of roles on television before landing one of the two title roles in Withnail and I, playing Peter Marwood, the I of the title who is never named in the movie itself. "}, {"url": "https://en.wikipedia.org/wiki/Monroe_(TV_series)", "passage_text": "Monroe is a British medical drama television series created and written by Peter Bowker and produced by Mammoth Screen for the ITV network. The six-part series was commissioned by ITV as one of a number of replacements for its long-running police drama series The Bill, which was cancelled in 2010. Filming on Monroe began in Leeds in September 2010, with production based in the old Leeds Girls' High School in Headingley."}, {"url": "http://www.hollywoodreporter.com/news/chad-everett-medical-center-dies-353771", "passage_text": "The actor also appeared in The Singing Nun, Mulholland Drive and Murder, She Wrote during a four-decade career. Chad Everett, who played a young, sensitive surgeon for seven seasons on the 1970s CBS drama Medical Center, died Tuesday of lung cancer at his home in Los Angeles. He was 75. "}, {"url": "http://www.nytimes.com/1996/03/13/nyregion/vince-edwards-67-the-doctor-in-the-hit-tv-series-ben-casey.html", "passage_text": "/ Region. Vince Edwards, who played a handsome, brooding neurosurgeon in the 1960's television series Ben Casey, died on Monday at the University of California Medical Center in Los Angeles. He was 67. The cause was pancreatic cancer, The Associated Press reported. In 1988, he played Ben Casey in the syndicated television movie The Return of Ben Casey.. In the 1960's, he recorded six record albums. In addition to his brother, he is survived by his wife, Janet, and three daughters, Angela, Nicole and Devera."}, {"url": "https://en.wikipedia.org/wiki/Monroe_(TV_series)", "passage_text": "The series follows a neurosurgeon named Gabriel Monroe, played by James Nesbitt. The six-part series was commissioned by ITV as one of a number of replacements for its long-running police drama series The Bill, which was cancelled in 2010. Filming on Monroe began in Leeds in September 2010, with production based in the old Leeds Girls' High School in Headingley. The first episode was broadcast on ITV on 10 March 2011 to strong ratings. A second series followed in 2012"}, {"url": "https://en.wikipedia.org/wiki/James_Nesbitt", "passage_text": "James Nesbitt (born 15 January 1965) is an actor, presenter and comedian from Northern Ireland. Born in Ballymena, County Antrim, Nesbitt grew up in the nearby village of Broughshane, before moving to Coleraine, County Londonderry. "}]