[{"url": "http://ogame.wikia.com/wiki/Deuterium", "passage_text": "Deutsch. Deuterium (also known as heavy hydrogen, or heavy water) is a hydrogen atom with an additional neutron and is very well suited as fuel for ships because of the high energy yield and easy ignition of the Deuterium-Deuterium and Deuterium-Tritium fusion reactions. Francais. Français. Deutsch (deuterium also known as heavy, hydrogen or heavy) water is a hydrogen atom with an additional neutron and is very well suited as fuel for ships because of the high energy yield and easy ignition of The-Deuterium deuterium And-Deuterium tritium fusion. reactions"}, {"url": "https://en.wikipedia.org/wiki/Tritium", "passage_text": "Tritium is also produced in heavy water-moderated reactors whenever a deuterium nucleus captures a neutron. This reaction has a quite small absorption cross section, making heavy water a good neutron moderator, and relatively little tritium is produced. Tritium is produced in nuclear reactors by neutron activation of lithium-6. This is possible with neutrons of any energy, and is an exothermic reaction yielding 4.8 MeV. In comparison, the fusion of deuterium with tritium releases about 17.6 MeV of energy."}, {"url": "http://www.fusionforenergy.europa.eu/understandingfusion/", "passage_text": "The fusion reaction that is easiest to accomplish is the reaction between two hydrogen isotopes: deuterium, extracted from water and tritium, produced during the fusion reaction through contact with lithium. When deuterium and tritium nuclei fuse, they form a helium nucleus, a neutron and a lot of energy. "}, {"url": "https://en.wikipedia.org/wiki/Deuterium", "passage_text": "Deuterium (symbol D or 2H, also known as heavy hydrogen) is one of two stable isotopes of hydrogen. The nucleus of deuterium, called a deuteron, contains one proton and one neutron, whereas the far more common hydrogen isotope, protium, has no neutron in the nucleus. Deuterium has a natural abundance in Earth's oceans of about one atom in 7003642000000000000♠6420 of hydrogen. Deuterium occurs in trace amounts naturally as deuterium gas, written 2H 2 or D 2, but most natural occurrence in the universe is bonded with a typical 1H atom, a gas called hydrogen deuteride (HD or 1H 2H)."}, {"url": "https://en.wikipedia.org/wiki/Heavy_water", "passage_text": "Heavy water was first produced in 1932, a few months after the discovery of deuterium. With the discovery of nuclear fission in late 1938, and the need for a neutron moderator that captured few neutrons, heavy water became a component of early nuclear energy research. This means that 1 in 6,400 hydrogen atoms is deuterium, which is 1 part in 3,200 by weight (hydrogen weight). The HDO may be separated from regular water by distillation or electrolysis and also by various chemical exchange processes, all of which exploit a kinetic isotope effect."}, {"url": "http://www.rtftechnologies.org/physics/deuterium-electrolysis.htm", "passage_text": "Heavy water electrolysis assembly for producing deuterium on demand for the fusion reactor. This electrolyzer produces deuterium by electrolyzing heavy water. Heavy water is electrolyzed in the centrifuge tube where it is split into oxygen at the exterior platinum anode and deuterium at the central platinum cathode. The cathode is located inside a glass tube which contains the produced deuterium gas. "}, {"url": "http://ogame.wikia.com/wiki/Deuterium", "passage_text": "The amount of deuterium produced by a Deuterium Synthesizer per hour can be calculated with this formula: **for more accurate calculations use 1.101 instead of 1.1 in this formula*****. In version 1.0 of OGame (the re-design) this formula has been changed and now looks like this: Francais. Français. Deutsch (deuterium also known as heavy, hydrogen or heavy) water is a hydrogen atom with an additional neutron and is very well suited as fuel for ships because of the high energy yield and easy ignition of The-Deuterium deuterium And-Deuterium tritium fusion. reactions"}, {"url": "https://en.wikipedia.org/wiki/Heavy_water", "passage_text": "Heavy water (deuterium oxide (2H 2O) or D 2O) is a form of water that contains a larger than normal amount of the hydrogen isotope deuterium (2H or D, also known as heavy hydrogen), rather than the common hydrogen-1 isotope (1H or H, also called protium) that makes up most of the hydrogen in regular water. This means that 1 in 6,400 hydrogen atoms is deuterium, which is 1 part in 3,200 by weight (hydrogen weight). The HDO may be separated from regular water by distillation or electrolysis and also by various chemical exchange processes, all of which exploit a kinetic isotope effect."}, {"url": "https://en.wikipedia.org/wiki/Tritium", "passage_text": "Tritium was first produced in 1934 from deuterium, another isotope of hydrogen, by Ernest Rutherford, working with Mark Oliphant and Paul Harteck. Rutherford was unable to isolate the tritium, a job that was left to Luis Alvarez and Robert Cornog, who correctly deduced that the substance was radioactive. Tritium is produced in nuclear reactors by neutron activation of lithium-6. This is possible with neutrons of any energy, and is an exothermic reaction yielding 4.8 MeV. In comparison, the fusion of deuterium with tritium releases about 17.6 MeV of energy."}, {"url": "http://fas.org/nuke/intro/nuke/heavy.htm", "passage_text": "Heavy water, D 2 O, is water in which both hydrogen atoms have been replaced with deuterium, the isotope of hydrogen containing one proton and one neutron. It is present naturally in water, but in only small amounts, less than 1 part in 5,000. Finally, the resulting deuterium is reacted with oxygen to form heavy water. No nuclear transformations occur. The production of heavy water in significant amounts requires a technical infrastructure, but one which has similarities to ammonia production, alcohol distillation, and other common industrial processes."}]