[{"url": "http://www.computerhope.com/jargon/c/cpu.htm", "passage_text": "As you can see in the above picture, the CPU chip is usually in the shape of a square or rectangle and has one notched corner to help place the chip properly into the CPU socket. On the bottom of the chip are hundreds of connector pins that plug into each of the corresponding holes in the socket. Tip: The CPU is often referred to as the brain of the computer. However, it is more appropriate to refer to software as the brain and the CPU as a very efficient calculator. Note: Many new computer users may improperly call their computer and sometimes their monitor the CPU."}, {"url": "http://www.webopedia.com/TERM/C/CPU.html", "passage_text": "CPU (pronounced as separate letters) is the abbreviation for central processing unit. Sometimes referred to simply as the central processor, but more commonly called processor, the CPU is the brains of the computer where most calculations take place. In terms of computing power, the CPU is the most important element of a computer system. On personal computers and small workstations, the CPU is housed in a single chip called a microprocessor. Since the 1970's the microprocessor class of CPUs has almost completely overtaken all other CPU implementations. The CPU itself is an internal component of the computer."}, {"url": "http://study.com/academy/lesson/central-processing-unit-cpu-parts-definition-function.html", "passage_text": "The central processing unit (CPU) is the brain of your computer. It handles all the instructions you give your computer, and the faster it does this, the better. Learn about how a CPU processes instructions and how computer engineers are continuously coming up with ways to make it go faster. In summary, a CPU is the brain of a computer, processing all the instructions you give it. A CPU has various components to receive the instructions, process them, and then transform them into signals to activate other parts of the computer."}, {"url": "http://www.newegg.com/CPUs-Processors/Category/ID-34", "passage_text": "CPUs/Processors. CPU (is also known as Central Processing Unit or Processor) is the most important component of a computer. CPU/Processor is used to explain computer instructions and process software data in computer. CPU/Processor can be divided into desktop processors, server processors, and mobile p"}, {"url": "https://en.wikipedia.org/wiki/CPU", "passage_text": "Bottom side of an Intel 80486DX2. A central processing unit (CPU) is the electronic circuitry within a computer that carries out the instructions of a computer program by performing the basic arithmetic, logical, control and input/output (I/O) operations specified by the instructions. Traditionally, the term CPU refers to a processor, more specifically to its processing unit and control unit (CU), distinguishing these core elements of a computer from external components such as main memory and I/O circuitry."}, {"url": "http://pcsupport.about.com/od/componentprofiles/p/p_cpu.htm", "passage_text": "The Central Processing Unit (CPU) is responsible for interpreting and executing most of the commands from the computer's hardware and software. The CPU could be considered the brains of the computer. "}, {"url": "http://whatis.techtarget.com/definition/CPU-central-processing-unit", "passage_text": "Part of the Microprocessors glossary: CPU (central processing unit) is an older term for processor and microprocessor, the central unit in a computer containing the logic circuitry that performs the instructions of a computer's programs. "}, {"url": "http://techterms.com/definition/cpu", "passage_text": "Stands for Central Processing Unit.. The CPU is the primary component of a computer that processes instructions. It runs the operating system and applications, constantly receiving input from the user or active software programs. A CPU with two processing cores is called a dual-core CPU and models with four cores are called quad-core CPUs. High-end CPUs may have six (hexa-core) or even eight (octo-core) processors."}, {"url": "http://www.answers.com/Q/What_is_a_CPU", "passage_text": "CPU (Central Processing Unit) The CPU, also called the processor or microprocessor, is the most important component in a PC. The CPU receives data input by the user, processes … information and executes commands. In a PC, the CPU is housed in a single chip called a microprocessor. The CPU (Central Processing Unit) is just what the name suggests. It is the main brain (do NOT use that term, it is nowhere near a brain) of your computer. All the managemen … t tasks (registers, memory, graphics, etc.) rout through your CPU."}]