[{"url": "https://answers.yahoo.com/question/index?qid=20060926165404AAVoBgW", "passage_text": "Procedures can be performed at a fraction of the amount you would spend on the same procedure in the US or Europe. For example, the average surgeon's fee for eyelid surgery in the U.S. is $2,500 and in the Philippines, a qualified surgeon will charge only $600 to $1,500. For liposuction, surgeon's fees in the U.S. average $2,000 per area. In the Philippines, it is around $800 for the first area and $500 for succeeding areas. Anesthesiologist's fees and facility costs are also much lower"}, {"url": "http://www.philippineplasticsurgeon.com/rhinoplasty-philippines/", "passage_text": "Rhinoplasty is a plastic surgery procedure that re-shapes the outside of the nose to provide better balance with the rest of the face. It involves correcting deformities be removing, re-arranging or re-shaping the bone and cartilage. # of rhinoplasty procedures done on patients ages 20-29 — 78,051. # of rhinoplasty procedures done on patients ages 30-39 — 63,850. # of rhinoplasty procedures done on patients ages ≥40 — 55,204. Source: The American Board of Plastic Surgery."}, {"url": "http://www.whatclinic.com/cosmetic-plastic-surgery/philippines/rhinoplasty", "passage_text": "Bookings available for Rhinoplasty Show Times. Rhinoplasty. Rhinoplasty or a nose job is a surgical procedure that corrects and reconstructs the form, restores function, and aesthetically improves the nose -- where abnormalities may be caused by trauma, a congenital defect, or a failed previous surgery. Looking for Rhinoplasty? Choose from 210 Rhinoplasty Clinics in Philippines and compare prices, patient reviews, and availability. Find the Best Price for Rhinoplasty in Philippines. Compare how much Rhinoplasty cost at all 210 clinics and save money on your treatment"}, {"url": "http://cosmeticsurgeryphil.com/rhinoplasty.htm", "passage_text": "Rhinoplasty, or plastic surgery of the nose, is one of the most popular cosmetic surgery procedures. The nose occupies the prominent central area of the face, and thus determines to a major extent whether the face is considered attractive or not. You should be at least 14 or 15 years old for girls and a little later for boys because it is best to have rhinoplasty after you've completed your growth spurt. Having the surgery should be something you want and not something other people want for you."}, {"url": "https://answers.yahoo.com/question/index?qid=20060926165404AAVoBgW", "passage_text": "The cost depends on the nature of surgery. It is hard to answer your question with monetary value because you did not include the type of surgery that you want. For example, a nose lift is about Php 30,000. Philippines is cheaper than other countries. For liposuction, surgeon's fees in the U.S. average $2,000 per area. In the Philippines, it is around $800 for the first area and $500 for succeeding areas."}, {"url": "http://www.cosmeticsurgeryphil.com/prices.htm", "passage_text": "Oftentimes, patients choose their surgeon on the basis of price. Cosmetic surgery is very affordable in the Philippines and costs are much lower when compared to the United States and other countries. To avoid unsatisfactory results, it is best to choose a surgeon who has completed an accredited residency training program in plastic and reconstructive surgery. He should have extensive experience in the procedure you will undergo."}, {"url": "http://www.denznet.com/beauty/rhinoplasty-nose-lift-without-surgery-rhinoplasty-cost-philippines/", "passage_text": "They want to have that pointed nose just like Americans. It’s a good thing that in the Philippines, they offer rhinoplasty or nose lift without surgery. Rhinoplasty or nose lift without surgery is a non surgical way to improve the shape of your nose. It uses injectables like botox cosmetic or hyaluronic acid to contour the nose without undergoing any surgery. It’s faster and you can see the result just after 15 minutes"}, {"url": "http://www.whatclinic.com/cosmetic-plastic-surgery/philippines/rhinoplasty", "passage_text": "Filters cached at 2015/10/14 15:17:10. We have all the information you need about public and private plastic surgery clinics that provide rhinoplasty in Philippines. Compare all the plastic surgery clinics and contact the plastic surgeon in Philippines who's right for you. Looking for Rhinoplasty? Choose from 210 Rhinoplasty Clinics in Philippines and compare prices, patient reviews, and availability. Find the Best Price for Rhinoplasty in Philippines. Compare how much Rhinoplasty cost at all 210 clinics and save money on your treatment"}, {"url": "http://www.cosmeticsurgeryphil.com/prices.htm", "passage_text": "However, since the success of your surgery is largely dependent on your choice of surgeon, cost should not be your main consideration for your decision to undergo cosmetic surgery in the Philippines. In the Philippines, any licensed medical doctor can perform cosmetic surgery. To avoid unsatisfactory results, it is best to choose a surgeon who has completed an accredited residency training program in plastic and reconstructive surgery. He should have extensive experience in the procedure you will undergo."}]