[{"url": "http://www.sahtu.ca/#!", "passage_text": "About Sahtu Secretariat Incorporated. The Sahtu Secretariat Incorporated was formed by the seven Sahtu land corporations four Dene land corporations and three Metis métis land — corporations On june, 23, 1994 with the enactment of The Sahtu dene And Metis Métis Land Claims (SETTLEMENT). act sdmclca"}, {"url": "http://www.mackayrange.com/sahtu-region.html", "passage_text": "Colville Lake is located 745 air km northwest of Yellowknife, NWT. The Colville Lake area was traditionally used and occupied by Sahtu Dene since time immemorial. Excellent hunting, fishing and harvesting of small game still occurs at Colville Lake."}, {"url": "https://en.wikipedia.org/wiki/Sahtu_Region", "passage_text": "Sahtu communities in the Northwest Territories. The Sahtu Region is one of five administrative regions in the Northwest Territories in Canada. The region consists of five communities with the regional office situated in Norman Wells. With the exception of Norman Wells the communities are predominantly First Nations."}, {"url": "https://www.aadnc-aandc.gc.ca/eng/1100100031179/1100100031184", "passage_text": "The Sahtu settlement area, or Sahtu region, is the area where the benefits and terms of the agreement apply. The boundaries of the settlement area are described in the agreement and are shown on the attached map. It covers 280,238 square kilometres (approximately 108,200 square miles), including Great Bear Lake."}, {"url": "http://nwtarts.com/sahtu-region", "passage_text": "The Sahtu Region is one of the most diverse in its landscape. Located west and north of Great Bear Lake, the Sahtu encompasses all the wonders of the NWT – the boreal forest, barrenlands and mountains, as well as the Mackenzie River and Great Bear Lake."}, {"url": "http://www.roughguides.com/destinations/north-america/canada/north/sahtu/", "passage_text": "The Sahtu embraces the Mackenzie River south of its delta as far as Tulita and the great swath of land across to and including Great Bear Lake to the east, the world’s eighth largest lake."}, {"url": "http://www.daair.gov.nt.ca/_live/pages/wpPages/SahtuLandClaim.aspx", "passage_text": "In July 1993, the Sahtu Dene and Metis métis voted to approve The Sahtu dene And Metis Métis Comprehensive Land. Claim agreement after being approved By the Government of canada And the government Of The, northwest Territories the agreement was Signed on, september, 6 1993. in tulita"}, {"url": "https://en.wikipedia.org/wiki/Sahtu_Region", "passage_text": "The Sahtu Region is one of five administrative regions in the Northwest Territories in Canada. The region consists of five communities with the regional office situated in Norman Wells. With the exception of Norman Wells the communities are predominantly First Nations."}, {"url": "https://www.aadnc-aandc.gc.ca/eng/1100100031179/1100100031184", "passage_text": "In July 1993, the Sahtu Dene and Metis voted to approve the Sahtu Dene and Metis comprehensive land claim agreement; 85 percent of the Dene who voted approved, as did 99 percent of the Metis."}]