[{"url": "http://faculty.ccbcmd.edu/courses/bio141/lecguide/takehome/genetics/protsyn/transcription/transcription.html", "passage_text": "A gene (def) is a segment of DNA that codes for a functional product (mRNA, tRNA, or rRNA). Since the vast majority of genes are transcribed into mRNA and mRNA is subsequently translated into polypeptides or proteins, most genes code for protein synthesis. "}, {"url": "http://homepages.rpi.edu/~bellos/transcription.htm", "passage_text": "(2) Elongation of the mRNA chain. (3) Termination of the mRNA chain. The piece of mRNA that results from the direct transcription of the DNA that encodes a gene is called the primary transcript and it undergoes modification, sometimes quite extensively, before it can translate its message into protein. The class of enzymes that synthesize RNAs are known as RNA polymerases. "}, {"url": "http://hyperphysics.phy-astr.gsu.edu/hbase/Organic/transcription.html", "passage_text": "In the mRNA, Uracil is substituted for thymine as the base complementary to adenine. Since the other strand of the DNA has bases complementary to the template strand, the mRNA has the same sequence of bases at the upper strand of DNA shown above (with U substituted for T) , which is called the coding strand. The RNA to which the information is transcribed is messenger RNA (mRNA). The process associated with RNA polymerase is to unwind the DNA and build a strand of mRNA by placing on the growing mRNA molecule the base complementary to that on the template strand of the DNA."}, {"url": "http://faculty.ccbcmd.edu/courses/bio141/lecguide/unit7/genetics/protsyn/transcription/transcription.html", "passage_text": "DNA is divided into functional units called genes. A gene (def) is a segment of DNA that codes for a functional product (mRNA, tRNA, or rRNA). Since the vast majority of genes are transcribed into mRNA and mRNA is subsequently translated into polypeptides or proteins, most genes code for protein synthesis. 1. During protein synthesis, the order of nucleotide bases along a gene gets transcribed into a complementary strand of mRNA which is then translated by tRNA into the correct order of amino acids for that polypeptide or protein. 2."}, {"url": "http://hyperphysics.phy-astr.gsu.edu/hbase/Organic/transcription.html", "passage_text": "The DNA contains the master plan for the creation of the proteins and other molecules and systems of the cell, but the carrying out of the plan involves transfer of the relevant information to RNA in a process called transcription. The RNA to which the information is transcribed is messenger RNA (mRNA). The process associated with RNA polymerase is to unwind the DNA and build a strand of mRNA by placing on the growing mRNA molecule the base complementary to that on the template strand of the DNA."}, {"url": "http://www.nature.com/scitable/topicpage/Translation-DNA-to-mRNA-to-Protein-393", "passage_text": "During transcription, the enzyme RNA polymerase (green) uses DNA as a template to produce a pre-mRNA transcript (pink). The pre-mRNA is processed to form a mature mRNA molecule that can be translated to build the protein molecule (polypeptide) encoded by the original gene. The resulting mRNA is a single-stranded copy of the gene, which next must be translated into a protein molecule. During translation, which is the second major step in gene expression, the mRNA is read according to the genetic code, which relates the DNA sequence to the amino acid sequence in proteins (Figure 2)."}, {"url": "http://classes.midlandstech.edu/carterp/Courses/bio225/chap08/lecture3.htm", "passage_text": "During transcription, the enzyme RNA polymerase synthesizes a strand of messenger RNA (mRNA) using one strand of the gene as a template. mRNA is synthesized using nucleotides that contain the bases A, C, G, and U (instead of T), which pair with the complementary bases of the DNA template strand. In viruses that use RNA as their genetic material RNA that can be directly translated by ribosomes is referred to as + strand or sense strand. A nucleic acid strand that is complementary to a + strand is-strand, or antisense."}, {"url": "https://en.wikipedia.org/wiki/Transcription_(genetics)", "passage_text": "Transcription is the first step of gene expression, in which a particular segment of DNA is copied into RNA (mRNA) by the enzyme RNA polymerase. Only one of the two DNA strands serve as a template for transcription. The antisense strand of DNA is read by RNA polymerase from the 3' end to the 5' end during transcription (3' → 5')."}, {"url": "https://www.translate.com/portuguese/2-a-segment-of-dna-that-is-artificially-created-from-two-or-more-organisms-through-use-of-dna-e/15307746", "passage_text": "English. 2) A segment of DNA that is artificially created from two or more organisms, through use of DNA enzymes in a laboratory is called A) a clone. B) a vector. C) plasmid DNA. D) recombinant DNA. "}, {"url": "https://en.wikipedia.org/wiki/Transcription_(genetics)", "passage_text": "In eukaryotes, a core promoter sequence in the DNA must be present for RNA polymerase to initiate transcription. Promoters are regions of DNA that promote transcription-in eukaryotes, they are found at -30, -75, and -90 base pairs upstream from the transcription start site (abbreviated to TSS). Only one of the two DNA strands serve as a template for transcription. The antisense strand of DNA is read by RNA polymerase from the 3' end to the 5' end during transcription (3' → 5')."}]