[{"url": "http://www.anxietycentre.com/anxiety-symptoms/short-term-memory-impairment.shtml", "passage_text": "It will subside when you reduce your stress and give your body ample time to calm down. As your body's stress returns to a healthy level, symptoms of stress subside, including the short-term memory impairment and concentration problems anxiety symptoms. Therefore, this symptom needn't be a cause for concern. "}, {"url": "http://www.34-menopause-symptoms.com/difficulty-concentrating/articles/how-to-recognize-a-lack-of-concentration-due-to-menopause.htm", "passage_text": "The common signs of a lack of concentration can be difficult to recognize at first because of the nature of the problem. It may help to reflect on what is causing your decreased productivity and inability to communicate your ideas from day to day. "}, {"url": "http://ezinearticles.com/?5-Causes-of-Memory-Loss-and-Lack-of-Concentration&id=6577262", "passage_text": "High blood pressure is one of the physical health problems that can cause memory loss. High blood pressure can eventually cause heart disease or stroke. Heart disease and stroke make it harder to remember things and they are lack of concentration causes. 2. Physical Health Problems. High blood pressure is one of the physical health problems that can cause memory loss. High blood pressure can eventually cause heart disease or stroke. Heart disease and stroke make it harder to remember things and they are lack of concentration causes. Diabetes is a chronic health problem."}, {"url": "http://naturopathconnect.com/articles/brain-fog-causes/", "passage_text": "1 As a result, adrenal fatigue syndrome can cause brain fog symptoms due to the body’s inability to handle stress effectively. 2  Insomnia / sleep deprivation – Sleep is crucial for optimal brain function. 3  Lack of adequate sleep can affect mood, cause depression, anxiety, and clouded thinking. Brain fog may be the result of: 1  Adrenal fatigue syndrome – The adrenal glands fail to produce key hormones that effectively regulate the body’s stress response. 2 "}, {"url": "http://naturopathconnect.com/articles/brain-fog-causes/", "passage_text": "1 Lack of adequate sleep can affect mood, cause depression, anxiety, and clouded thinking. 2  Chronic fatigue syndrome (CFS) – Chronic fatigue syndrome is known for its overwhelming fatigue. 3  CFS affects concentration, short-term memory and disrupts healthy sleep patterns. Brain fog may be the result of: 1  Adrenal fatigue syndrome – The adrenal glands fail to produce key hormones that effectively regulate the body’s stress response. 2  As a result, adrenal fatigue syndrome can cause brain fog symptoms due to the body’s inability to handle stress effectively."}, {"url": "http://ezinearticles.com/?5-Causes-of-Memory-Loss-and-Lack-of-Concentration&id=6577262", "passage_text": "Temporary memory loss may be caused by an infection or another illness. Illnesses of any kind can be lack of concentration causes, because the ill person is too distracted by the symptoms or by worry to pay close attention. 2. Physical Health Problems. High blood pressure is one of the physical health problems that can cause memory loss. High blood pressure can eventually cause heart disease or stroke. Heart disease and stroke make it harder to remember things and they are lack of concentration causes. Diabetes is a chronic health problem."}, {"url": "http://www.healthgrades.com/symptoms/concentration-difficulty", "passage_text": "Concentration difficulty is a decreased ability to focus your thoughts on something. Concentration difficulties can be related to difficulty staying awake, impulsiveness, intrusive thoughts or concerns, overactivity, or inattention. They can be caused by medical, cognitive or psychological problems or may be related to sleep disorders or medications, alcohol or drugs."}, {"url": "http://ezinearticles.com/?5-Causes-of-Memory-Loss-and-Lack-of-Concentration&id=6577262", "passage_text": "The five causes of memory loss not related to a head injury or brain trauma are exposure to toxins, chronic physical health problems, mental health problems, aging and nutritional deficiencies. Those five things are also lack of concentration causes. Each of the five is covered in some detail below. 2. Physical Health Problems. High blood pressure is one of the physical health problems that can cause memory loss. High blood pressure can eventually cause heart disease or stroke. Heart disease and stroke make it harder to remember things and they are lack of concentration causes. Diabetes is a chronic health problem."}, {"url": "http://www.medicinenet.com/difficulty_concentrating/symptoms.htm", "passage_text": "Difficulty concentrating is a normal and periodic occurrence for most people. Tiredness and emotional stress can cause concentration problems in most people. Hormonal changes, such as those experienced during menopause or pregnancy, can also affect how we think and concentrate. Concentration problems, when present to an excessive degree, are also characteristic of certain physical and psychological conditions."}]