[{"url": "http://neuroscience.uth.tmc.edu/s4/chapter11.html", "passage_text": "11.1 Blood-brain Barrier Maintains the Constancy of the Brain's Internal Environment. The blood-brain barrier (BBB) protects the neural tissue from variations in blood composition and toxins. Elsewhere in the body the extracellular concentrations of hormones, amino acids and potassium undergo frequent fluctuations, especially after meals, exercise or stressful times. All areas of the brain do not have a blood-brain barrier. The structures located at strategic positions in the midline of the ventricular system and lack the BBB are collectively referred to as circumventricular organs (CVOs)."}, {"url": "http://www.wisegeekhealth.com/what-is-the-blood-brain-barrier.htm", "passage_text": "The blood-brain barrier (BBB) is a protective barrier which is designed to keep the environment in the brain as stable as possible. It prevents many dangerous substances from entering the brain, protecting the brain from an assortment of potential risks, ranging from infection to elevated levels of hormones in the body. "}, {"url": "https://en.wikipedia.org/wiki/Blood%E2%80%93brain_barrier", "passage_text": "The blood–brain barrier (BBB) is a highly selective permeability barrier that separates the circulating blood from the brain extracellular fluid (BECF) in the central nervous system (CNS). The blood–brain barrier is formed by brain endothelial cells, which are connected by tight junctions with an extremely high electrical resistivity of at least 0.1 ω⋅m."}, {"url": "http://www.els.net/WileyCDA/ElsArticle/refId-a0000023.html", "passage_text": "The barrier function of the blood–brain barrier is due to: (1) tight junctions that restrict movement of substances between the endothelial cells, (2) specific transport proteins that determine which substances can cross the barrier transcellularly and (3) enzymes that may degrade or alter substances prior to passage. Figure 1. The blood–brain barrier consists of endothelial cells lining brain capillaries. These cells are connected by tight junctions, which separate the plasmalemma into luminal (blood‐facing) and abluminal (brain‐facing) plasma membrane domains."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/15207256", "passage_text": "The blood-brain barrier (BBB) is a diffusion barrier, which impedes influx of most compounds from blood to brain. Three cellular elements of the brain microvasculature compose the BBB-endothelial cells, astrocyte end-feet, and pericytes (PCs). Tight junctions (TJs), present between the cerebral endothelial cells, form a diffusion barrier, which selectively excludes most blood-borne substances from entering the brain."}, {"url": "http://www.els.net/WileyCDA/ElsArticle/refId-a0000023.html", "passage_text": "Abstract. The blood–brain barrier consists of endothelial cells lining brain capillaries. It serves to restrict and control the movement of substances between the general circulation and brain extracellular fluid. Figure 1. The blood–brain barrier consists of endothelial cells lining brain capillaries. These cells are connected by tight junctions, which separate the plasmalemma into luminal (blood‐facing) and abluminal (brain‐facing) plasma membrane domains."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/19664713", "passage_text": "Cells at three key interfaces form barriers between the blood and the CNS: the blood-brain barrier (BBB), blood-CSF barrier and the arachnoid barrier. The BBB at the level of brain microvessel endothelium is the major site of blood-CNS exchange. "}, {"url": "http://bloodbrainbarrier.jhu.edu/", "passage_text": "About. The blood brain barrier (BBB) is a dynamic interface that separates the brain from the circulatory system and protects the central nervous system (CNS) from potentially harmful chemicals while regulating transport of essential molecules and maintaining a stable environment. "}, {"url": "https://en.wikipedia.org/wiki/Blood%E2%80%93brain_barrier", "passage_text": "The blood–brain barrier occurs along all capillaries and consists of tight junctions around the capillaries that do not exist in normal circulation. The blood–brain barrier is formed by brain endothelial cells, which are connected by tight junctions with an extremely high electrical resistivity of at least 0.1 ω⋅m."}, {"url": "https://en.wikipedia.org/wiki/Blood%E2%80%93brain_barrier", "passage_text": "The blood–brain barrier allows the passage of water, some gases, and lipid-soluble molecules by passive diffusion, as well as the selective transport of molecules such as glucose and amino acids that are crucial to neural function. The blood–brain barrier is formed by brain endothelial cells, which are connected by tight junctions with an extremely high electrical resistivity of at least 0.1 ω⋅m."}]