[{"url": "http://www.themedicalquestions.com/Med/how-long-does-it-take-for-a-little-toe-to-heel-when-broken.html", "passage_text": "http://www.chacha.com/question/how-long-does-it-take-for-a-little-toe-to-heel-when-broken. A pinky toe fracture in a normal person takes about 6 weeks to heal. The pain will be gone for the most part in 2-3 weeks, however. Health related question in topics Medicine Treatment .We found some answers as below for this question How long does it take for a little toe to heel when broken,you can compare them. A pinky toe fracture in a normal person takes about 6 weeks to heal. The pain will be gone for the most part in 2-3 weeks, however."}, {"url": "http://www.wikihow.com/Heal-a-Broken-Toe", "passage_text": "2. Wear a splint. After a reduction of your broken toe, a splint is often put in place to support and protect the toe while it heals properly. Alternatively, you may have to wear a supportive compression boot, but either way, you'll likely need the use of crutches over the short term (2 weeks or so). Get a cast. If more than one toe is broken or other bones of the forefoot are injured (such as the metatarsals), then your doctor might apply a plaster or fiberglass cast to your entire foot."}, {"url": "http://www.themedicalquestions.com/Med/how-long-does-it-take-for-a-little-toe-to-heel-when-broken.html", "passage_text": "How long does it take for a little toe to heel when broken. A pinky toe fracture in a normal person takes about 6 weeks to heal. The pain will be gone for the most part in 2-3 weeks, however. Health related question in topics Medicine Treatment .We found some answers as below for this question How long does it take for a little toe to heel when broken,you can compare them. A pinky toe fracture in a normal person takes about 6 weeks to heal. The pain will be gone for the most part in 2-3 weeks, however."}, {"url": "http://kimfoot.com/toe-fracture/", "passage_text": "Treatment for a toe fracture depends on the injury’s location and severity. The doctor may need to put the fracture back into place and in a splint or cast. If there is an open wound near the injured toe, it can necessitate a tetanus shot and antibiotic medication. Broken toes usually take about six weeks to heal. Of the 26 b ones in the foot, 19 are toe bones (phalanges) and the long bones in the midfoot (metatarsal bones). So, chances are good that w hen one of the bones breaks in a foot, it will be a toe. A toe fracture is a break in a toe bone. Each toe is actually made up of several bones, and one or more of them may be fractured (broken) after an injury to the foot or toes"}, {"url": "http://www.wikihow.com/Heal-a-Broken-Toe", "passage_text": "1 Following surgery, and especially with the help of a cast, severely broken toes take 6-8 weeks to heal, depending on the location and extent of the injury. 2  After such a long time in a cast, your foot may need some rehabilitation as described below. Get a cast. If more than one toe is broken or other bones of the forefoot are injured (such as the metatarsals), then your doctor might apply a plaster or fiberglass cast to your entire foot."}, {"url": "http://www.mayoclinic.org/diseases-conditions/broken-toe/basics/definition/con-20034500", "passage_text": "In most cases, a broken toe can be immobilized by taping it to a neighboring toe. But if the fracture is severe — particularly if it involves your big toe — you may need a cast or even surgery to ensure that your broken toe heals properly. Most broken toes heal well, usually within four to six weeks. Less commonly, depending on the precise location and severity of the injury, a broken toe may become infected or be more vulnerable to osteoarthritis in the future. 1  Symptoms."}, {"url": "https://www.sharecare.com/health/broken-bones/how-long-broken-toe-heal", "passage_text": "A Dr. Bradley Dunlap, MD, Orthopedic Surgery, answered on behalf of NorthShore University HealthSystem. How long it takes to heal a broken pinky toe depends on where the break is located. Fractures of the small toe of the foot (not the metatarsal bone in the foot) tend to heal on their own if you modify your activities. "}]