[{"url": "https://en.wikipedia.org/wiki/Skeletal_striated_muscle", "passage_text": "Skeletal muscle is a form of striated muscle tissue which is under the voluntary control of the somatic nervous system. It is one of three major muscle types, the others being cardiac muscle and smooth muscle. Most skeletal muscles are attached to bones by bundles of collagen fibers known as tendons. The myofibrils are composed of actin and myosin filaments, repeated in units called sarcomeres, the basic functional units of the muscle fiber. The sarcomere is responsible for the striated appearance of skeletal muscle, and forms the basic machinery necessary for muscle contraction."}, {"url": "http://www.answers.com/Q/Why_are_skeletal_muscle_striated", "passage_text": "Lines/banding in the muscles-only in cardiac and skeletal muscles striated muscle is referring to skeletal and cardiac muscle. Cardiac muscle is branching with intercalated … disks that help to identify it and it is uninucleate. Skeletal muscle has obvious striations and has long cylindrical multinucleate cells. "}, {"url": "http://www.mhhe.com/biosci/ap/histology_mh/strimusc.html", "passage_text": "Remember, striations across cells indicate you are viewing cardiac or skeletal muscle. Differentiation of these two types involves other structural features. We will examine these now! Skeletal muscle is the most abundant muscle type in the body. The A and I bands repeat along the length of the muscle fibers to create the striations visible under the light microscope. 1  Sarcomeres repeat along skeletal and cardiac fibers. 2  Components between adjacent Z-lines comprise the sarcomere. 3  Sarcomeres are considered the functional units of striated muscles."}, {"url": "http://www.mhhe.com/biosci/ap/histology_mh/strimusc.html", "passage_text": "Striations are a key attribute to identify skeletal and cardiac muscle types. Although striations are usually visible in most sections of these muscle types, it can sometimes take a little adjustment of the microscope lighting to see them clearly. The A and I bands repeat along the length of the muscle fibers to create the striations visible under the light microscope. 1  Sarcomeres repeat along skeletal and cardiac fibers. 2  Components between adjacent Z-lines comprise the sarcomere. 3  Sarcomeres are considered the functional units of striated muscles."}, {"url": "https://en.wikipedia.org/wiki/Striated_muscle", "passage_text": "Striated muscle tissue is muscle tissue that has repeating sarcomeres, in contrast with smooth muscle tissue. Specifically, striated muscles are: 1  Pharyngeal muscle (embryologically different from skeletal muscle). 2  Cardiac muscle (heart muscle). 3  Skeletal muscle. Contractions in striated muscles are voluntary, except for the heart muscle, in which contractions are involuntary. Cardiac muscle is often treated separately from the other striated muscles, as it has somewhat different characteristics. A sarcomere is the functional unit of striated muscles."}, {"url": "http://www.answers.com/Q/What_makes_muscle_cells_look_striated", "passage_text": "Lines/banding in the muscles-only in cardiac and skeletal muscles striated muscle is referring to skeletal and cardiac muscle. Cardiac muscle is branching with intercalated … disks that help to identify it and it is uninucleate. Skeletal muscle has obvious striations and has long cylindrical multinucleate cells. "}, {"url": "https://en.wikipedia.org/wiki/Skeletal_striated_muscle", "passage_text": "Skeletal muscle is made up of individual muscle cells or myocytes, known as muscle fibers. They are formed from the fusion of developmental myoblasts (a type of embryonic progenitor cell that gives rise to a muscle cell) in a process known as myogenesis. Muscle fibres are cylindrical, and multinucleated. The myofibrils are composed of actin and myosin filaments, repeated in units called sarcomeres, the basic functional units of the muscle fiber. The sarcomere is responsible for the striated appearance of skeletal muscle, and forms the basic machinery necessary for muscle contraction."}, {"url": "http://www.innerbody.com/image/musc01.html", "passage_text": "When viewed under the microscope, skeletal muscle cells appear to have a striped, or striated, pattern of light and dark regions. These stripes are caused by the regular arrangement of actin and myosin proteins within the cells into structures known as myofibrils. Within muscle tissue are three distinct groups of tissues: skeletal muscle, cardiac muscle, and smooth muscle. Each of these tissue groups is made of specialized cells that give the tissue its unique properties."}, {"url": "http://www.mhhe.com/biosci/ap/histology_mh/strimusc.html", "passage_text": "In contrast to smooth muscle, cardiac and skeletal muscle types possess an internal ultrastructure of highly organized contractile myofilaments. Actin and myosin myofilaments are stacked and overlapped in regular repeating arrays to form sarcomeres. The A and I bands repeat along the length of the muscle fibers to create the striations visible under the light microscope. 1  Sarcomeres repeat along skeletal and cardiac fibers. 2  Components between adjacent Z-lines comprise the sarcomere. 3  Sarcomeres are considered the functional units of striated muscles."}]