[{"url": "http://www.indeed.com/salary/Young-Life.html", "passage_text": "average young life salaries for job postings nationwide are 1 % lower than average salaries for all job postings nationwide "}, {"url": "http://nces.ed.gov/fastfacts/display.asp?id=77", "passage_text": "For example, in 2013 median earnings for young adults with a bachelor's degree were $48,500, compared with $23,900 for those without a high school credential, $30,000 for those with a high school credential, and $37,500 for those with an associate's degree. In 2013, some 65 percent of young adults ages 25-34 who were in the labor force worked full time, year round (i.e., worked 35 or more hours per week for 50 or more weeks per year). The percentage of young adults working full time, year round was generally higher for those with higher levels of educational attainment."}, {"url": "http://www.salarylist.com/company/Young-Life-Salary.htm", "passage_text": "Young Life Salary. Young Life average salary is $-, median salary is $- with a salary range from $- to $-. Young Life salaries are collected from government agencies and companies. Each salary is associated with a real job position. Young Life salary statistics is not exclusive and is for reference onl"}, {"url": "http://www.salarylist.com/company/Ernst-Young/Senior-Manager-Salary.htm", "passage_text": "Ernst & Young Senior Manager average salary is $115,877, median salary is $107,307 with a salary range from $60,000 to $200,000. Ernst & Young Senior Manager salaries are collected from government agencies and companies. Each salary is associated with a real job position. Ernst & Young Senior Manager salary statistics is not exclusive and is for reference only. Ernst & Young Senior Manager salary is full-time annual starting salary. Intern, contractor and hourly pay scale vary from regular exempt employee. Compensation depends on work experience, job location, bonus, benefits and other factors."}, {"url": "http://nces.ed.gov/fastfacts/display.asp?id=77", "passage_text": "Question: What is the average income for young adults? Response: In 2013, some 65 percent of young adults ages 25-34 who were in the labor force worked full time, year round (i.e., worked 35 or more hours per week for 50 or more weeks per year). The percentage of young adults working full time, year round was generally higher for those with higher levels of educational attainment."}, {"url": "http://www.usnews.com/news/articles/2014/02/11/study-income-gap-between-young-college-and-high-school-grads-widens", "passage_text": "It’s not just that earnings are improving for college graduates, says one of the report’s authors, it’s that life for high school-only graduates has gotten tougher. Indeed, median annual earnings for full-time working 25- to 32-year-olds with bachelor's degrees grew by nearly $6,700 to $45,500 from 1965 to 2013. During that same time, median annual earnings for high school graduates in that same age group fell by nearly $3,400 to $28,000.[ALSO: Twice as Many College Grads in Minimum Wage Jobs as 5 Years Ago]And those numbers are only among those working full-time."}, {"url": "http://www.simplyhired.com/salaries-k-young-life-jobs.html", "passage_text": "The average salary for young life jobs is $51,000. Average young life salaries can vary greatly due to company, location, industry, experience and benefits. This salary was calculated using the average salary for all jobs with the term young life anywhere in the job listing. Related Jobs Mid-level Life Sciences Attorney with corporate experience BCG Attorney Search-Philadelphia, PA Life Skills Teaching Spedjobs.com-Farmington, NM Administrative Assistant IV-Young Customer Nordstrom-Seattle, WA Seeking Energetic And Knowledgeable Male Tutor To Work With Middle School Young Man In Math."}, {"url": "http://www.simplyhired.com/salaries-k-young-life-jobs.html", "passage_text": "Young Life Salary Information. This free salary calculator uses salary data from millions of job listings indexed by Simply Hired's job search engine. The young life salary comparisons feature allows job seekers to get the information required to make important career decisions and negotiate salary ranges. For additional young life salary information, we recommend visiting Payscale.com. Related Jobs Mid-level Life Sciences Attorney with corporate experience BCG Attorney Search-Philadelphia, PA Life Skills Teaching Spedjobs.com-Farmington, NM Administrative Assistant IV-Young Customer Nordstrom-Seattle, WA Seeking Energetic And Knowledgeable Male Tutor To Work With Middle School Young Man In Math."}, {"url": "http://study.com/articles/Average_Salary_With_A_Bachelors_Degree.html", "passage_text": "Show me popular schools. The National Center for Education Statistics (NCES) reported that the median (not average) salary for young adults with a bachelor's degree was $46,900 in 2012. PayScale.com conducted a survey on the best college bachelor's degrees according to salary in 2013-2014 based off of 129 different bachelor's degrees. Employees who took the survey were graduates from U.S. schools, full-time employees in the U.S. and possessed just a bachelor's degree."}]