[{"url": "http://britishfood.about.com/od/introtobritishfood/a/roastbeef.htm", "passage_text": "3. Cooking Temperature. There are varying opinions about what the perfect temperature to cook a roast beef but in my experience starting the beef in a very hot oven 425F/220C/Gas 7 for the first 30 mins then lower the temperature to 375F/190C/Gas5 for the remaining cooking time then .... "}, {"url": "http://www.recipetips.com/kitchen-tips/t--372/roasting-beef.asp", "passage_text": "1 Cook the roast for about 10 to 15 minutes and then turn it over in the pan. 2  Continue to cook it for another 10 to 15 minutes for every pound. 3  Remove the tenderloin from the oven when the internal temperature of the meat reaches 140°F, as indicated on a meat thermometer inserted into the center of the roast. Place the beef on a rack in a shallow roasting pan with the fat side up. Do not cover the roast and do not add any liquid (liquid is used for braising, not roasting). Allow the beef to roast at 450°F for 45 minutes and then begin checking the internal temperature of the meat with a meat thermometer."}, {"url": "http://www.recipetips.com/kitchen-tips/t--372/roasting-beef.asp", "passage_text": "When roasting beef it is important to select the proper cut of roast beef to produce moist and tender meat when the roast beef is cooked to the desired doneness. Using the proper beef cooking times and temperatures is critical to the end results. Place the beef on a rack in a shallow roasting pan with the fat side up. Do not cover the roast and do not add any liquid (liquid is used for braising, not roasting). Allow the beef to roast at 450°F for 45 minutes and then begin checking the internal temperature of the meat with a meat thermometer."}, {"url": "http://www.cooks.com/rec/search/0,1-0,roast_beef_cooking_temperature,FF.html", "passage_text": "Start at 2:00 ... 375 degrees. Place roast in oven and cook 1 hour. Turn ... 300 degrees. The temperatures given are for sea level cooking. For high ... way, the roast beef will be a ... and perfect every time. over medium-high heat. Cook roast until evenly ... per pound. Check temperature with instant-read thermometer; ... serving platter; reserve cooking liquid. Cover roast ... Note: A boneless beef rib eye roast ... and the green onion."}, {"url": "http://www.recipetips.com/kitchen-tips/t--372/roasting-beef.asp", "passage_text": "Roasting is a dry heat cooking method that is often used for large, tender beef cuts. The best cuts for roasting are obtained from the loin and the rib. In order to properly roast a cut of beef, it should be placed on a rack in a roasting pan that is not too deep and cooked, uncovered, in a preheated oven. Place the beef on a rack in a shallow roasting pan with the fat side up. Do not cover the roast and do not add any liquid (liquid is used for braising, not roasting). Allow the beef to roast at 450°F for 45 minutes and then begin checking the internal temperature of the meat with a meat thermometer."}, {"url": "http://www.recipetips.com/kitchen-tips/t--1542/roast-beef-cook-time.asp", "passage_text": "The oven temperature used to cook a beef roast is usually set somewhere between 300 degrees and 450 degrees Fahrenheit. The recommended cooking temperature for your roast is usually determined by the type of beef cut that you plan to roast. There are even a few beef roasts, especially some of the tougher roasts from the round or chuck, that are best when cooked with high heat at the start (to sear the outside of the meat and seal in the juices) and then cooked at a lower temperature to finish the roast."}, {"url": "http://whatscookingamerica.net/Information/MeatTemperatureChart.htm", "passage_text": "Beef-Lamb-Veal Roasts-Steaks-Chops. For roasts of lamb, beef, or veal: place the thermometer midway inside the roast away from bone. Residual Heat or Carry-Over Cooking: Remember, the steak will continue to cook as it sets. The temperature will rise 5 degrees F. to 10 degrees F. internal temperature. Internal Temperature Cooking Chart Beef-Pork-Poultry-Fish and Seafood-Baked Goods copyright 2004 by Linda Stradley-United States Copyright TX 5-900-517- All rights reserved. This web site may not be reproduced in whole or in part without permission and appropriate credit given."}, {"url": "http://ochef.com/343.htm", "passage_text": "How long and at what temperature should I cook a beef roast in the oven? Roasting is a great cooking method for a large, tender cut of beef  such as a rib or sirloin roast. Sirloin-tip, rump, rolled-rump, eye-of-round or top-round roasts will also benefit from this cooking method if they are graded prime or choice. Cooking at a constant oven temperature of 300°F (160°C), a 5- to 8-lb standing rib roast will take 17-19 minutes per pound for rare, 20-22 for medium rare, 23-25 minutes for medium, and 27-30 minutes for well done."}, {"url": "http://www.recipetips.com/kitchen-tips/t--372/roasting-beef.asp", "passage_text": "A beef roast cooked to medium-rare should have an internal temperature of 145°F - 150ºF after the resting period, and a roast cooked to medium should have an internal temperature of 150°F to 160ºF. (See the note below). See Beef Doneness for more information on proper cooking temperatures. Place the beef on a rack in a shallow roasting pan with the fat side up. Do not cover the roast and do not add any liquid (liquid is used for braising, not roasting). Allow the beef to roast at 450°F for 45 minutes and then begin checking the internal temperature of the meat with a meat thermometer."}, {"url": "http://www.recipetips.com/kitchen-tips/t--1542/roast-beef-cook-time.asp", "passage_text": "The proper beef roast cook times and the correct beef cooking oven temperatures are extremely important. The optimum flavor and tenderness of various beef roasts can be consistently achieved when care is taken to follow the recommended time and temperature guidelines for cooking beef roasts. There are even a few beef roasts, especially some of the tougher roasts from the round or chuck, that are best when cooked with high heat at the start (to sear the outside of the meat and seal in the juices) and then cooked at a lower temperature to finish the roast."}]