[{"url": "https://en.wikipedia.org/wiki/Berlin_Crisis_of_1961", "passage_text": "From Wikipedia, the free encyclopedia. The Berlin Crisis of 1961 (4 June – 9 November 1961) was the last major politico-military European incident of the Cold War about the occupational status of the German capital city, Berlin, and of post–World War II Germany. The four powers governing Berlin (Soviet Union, United States, United Kingdom, and France) had agreed at the 1945 Potsdam Conference that Allied personnel could move freely in any sector of Berlin."}, {"url": "http://www.ducksters.com/history/cold_war/berlin_wall.php", "passage_text": "The Berlin Wall was built by the communist government of East Berlin 1961. The wall separated East Berlin and West Berlin. It was built in order to prevent people from fleeing East Berlin. "}, {"url": "https://en.wikipedia.org/wiki/Berlin_Crisis_of_1961", "passage_text": "After the Soviet occupation of Eastern Europe at the end of World War II, some of those living in the newly acquired areas of the Eastern Bloc aspired to independence and wanted the Soviets to leave. Between 1945 and 1950, over 15 million people emigrated from Soviet-occupied eastern European countries to the West. The four powers governing Berlin (Soviet Union, United States, United Kingdom, and France) had agreed at the 1945 Potsdam Conference that Allied personnel could move freely in any sector of Berlin."}, {"url": "http://www.weknowtheanswer.com/q/why-did-the-berlin-blockade-happen", "passage_text": "The Western allies had began moving towards consolidating their occupation zones in Western Germany into a single independent German state. The USSR, which had been invaded twice by Germany, did not want Germany reunited. The Berlin Airlift and the creation of NATO put an end to the blockade. Positive: 52 %. Answer #3 | 20/06 2015 20:42. The Soviet Union controlled all of East Germany except West Berlin, and they wanted that too. The first heightening of Cold War tensions occurred in 1948 when the Soviets imposed a partial blockade of Berlin ... of the blockade Stalin did not ... Read more. Positive: 6 %. The Berlin Airlift."}, {"url": "http://www.answers.com/Q/Why_was_there_a_crisis_in_berlin_in_1948_-_1949", "passage_text": "The Berlin Crisis of 1961 began with the Soviet Union building a  wall between East and West Berlin. The Soviets shut off access to  West Berlin. The Allies responded with t … he Berlin Airlift and the  crisis was resolved. Berlin was right in the middle of East Germany, which was controlled by the Soviet Union and its allies. The Soviets wanted to take over West Berlin, so that they'd have the whole city. They cut off all roads in and out of West Berlin to keep supplies from going in to the inhabitants and force a surrender."}, {"url": "http://www.coldwar.org/articles/40s/berlin_blockade.asp", "passage_text": "The Berlin Blockade. The first heightening of Cold War tensions occurred in 1948 when the Soviets imposed a partial blockade of Berlin in April, and then a full blockade in June. Back to the 1940s. The first heightening of Cold War tensions occurred in 1948 when the Soviets imposed a partial blockade of Berlin in April, and then a full blockade in June."}, {"url": "https://en.wikipedia.org/wiki/Berlin_Blockade", "passage_text": "The Berlin Blockade (1 April 1948 – 12 May 1949) was one of the first major international crises of the Cold War. During the multinational occupation of post–World War II Germany, the Soviet Union blocked the Western Allies ' railway, road, and canal access to the sectors of Berlin under Western control. By the spring of 1949, the airlift was clearly succeeding, and by April it was delivering more cargo than had previously been transported into the city by rail. On 12 May 1949, the USSR lifted the blockade of West Berlin."}, {"url": "https://en.wikipedia.org/wiki/Berlin_Crisis_of_1961", "passage_text": "The USSR provoked the Berlin Crisis with an ultimatum demanding the withdrawal of Western armed forces from West Berlin —culminating in the city's de facto partition with the East German erection of the Berlin Wall. The four powers governing Berlin (Soviet Union, United States, United Kingdom, and France) had agreed at the 1945 Potsdam Conference that Allied personnel could move freely in any sector of Berlin."}, {"url": "http://www.answers.com/Q/Why_was_there_a_crisis_in_berlin_in_1948_-_1949", "passage_text": "The US and its allies got West Berlin; The Soviet Union and its allies got East Berlin. Berlin was right in the middle of East Germany, which was controlled by the Soviet Union and its allies. The Soviets wanted to take over West Berlin, so that they'd have the whole city. They cut off all roads in and out of West Berlin to keep supplies from going in to the inhabitants and force a surrender."}]