[{"url": "https://en.wikipedia.org/wiki/Janjaweed", "passage_text": "The Janjaweed (Arabic : janjawīd of unclear etymology but ostensibly formed from the local dialectal Arabic words for man or spirit, gun and  horse ; also transliterated Janjawid) are a militia that operate in Darfur, western Sudan, and eastern Chad. The majority of Darfur's Arabs, the Baggara confederation, began their presence in the war over grazing territory, and remain involved. In 1999–2000, faced with threats of insurgencies in Western and Northern Darfur, Khartoum 's security armed the Janjaweed forces."}, {"url": "http://www.answers.com/Q/Why_did_the_Darfur_genocide_start", "passage_text": "- http://en.wiktionary.org/wiki/genocide The Islamic controlled government, located in East and North Sudan, started the genocide as an ethnic cleansing of the Darfur region in West Sudan. They hire militia groups known as the Janjaweed to attack villages, rape, kill and loot. I have hire in quotations because the government is not paying them, their reward is what they are able to steal. The Darfurians are now being forced out of their lands and into neighboring Chad. The Islamic controlled government, located in East Sudan, started the G"}, {"url": "http://worldwithoutgenocide.org/genocides-and-conflicts/darfur-genocide", "passage_text": "Sudan is the largest country in Africa. Located in Northeastern Africa, it borders the Red Sea and falls between Egypt, Chad, Uganda, as well as six other countries. The capitol, Khartoum, is in the Northeastern part of the country. Darfur is a region in Western Sudan that encompasses an area roughly the size of Spain. The on-going conflict in Darfur, Sudan was declared “genocide” by United States Secretary of State Colin Powell on September 9, 2004, in testimony before the Senate Foreign Relations Committee. On February 18, 2006, President George W. Bush called for the number of international troops in Darfur to be doubled."}, {"url": "http://senweb.lr.k12.nj.us/Library/class%20projects/Stapleford/Darfur45/Janjaweed.htm", "passage_text": "The Janjaweed are people descended from ancient nomads and camel herders who moved to the Darfur region of Sudan from Chad. They are of Arab decent unlike the rest of the people from Darfur who are Christian. The Christians are referred to as Africans. Darfur has been Arab since the 13th century. The Africans and the Arabs would always have clashes most of the clashes being in the 1970s and 80s. "}, {"url": "http://www.answers.com/Q/Why_did_the_Darfur_genocide_start", "passage_text": "Answer by KELiiKA. Confidence votes 17. The Islamic controlled government, located in East Sudan, started the Genocide as an ethnic cleansing of the Darfur region in West Sudan. They hire militia groups known as the Janjaweed to attack villages, rape, kill and loot. I have hire in quotations because the government is not paying them, their reward is what they are able to steal. The Darfurians are now being forced out of their lands and into neighboring Chad"}, {"url": "https://en.wikipedia.org/wiki/Janjaweed", "passage_text": "By October 2007, only the United States' government had declared the Janjaweed killings in Darfur to be genocide, since they had killed an estimated 200,000–400,000 civilians over the previous three years. The UN Security Council called for the Janjaweed to be disarmed. The majority of Darfur's Arabs, the Baggara confederation, began their presence in the war over grazing territory, and remain involved. In 1999–2000, faced with threats of insurgencies in Western and Northern Darfur, Khartoum 's security armed the Janjaweed forces."}, {"url": "http://www.telegraph.co.uk/news/worldnews/africaandindianocean/sudan/2403635/Sudanese-government-backed-Darfur-attacks-says-Janjaweed-commander.html", "passage_text": "A high-ranking commander who armed and led Janjaweed militiamen in attacks on hundreds of villages in Darfur has come forward to claim that he did so at the behest of the Sudanese government. Rebels in East Chad to where many refugees have fled from Darfur Photo: REUTERS. By Nick Meo. 10:22PM BST 12 Jul 2008. "}, {"url": "http://worldwithoutgenocide.org/genocides-and-conflicts/darfur-genocide", "passage_text": "Darfur Genocide. The “Darfur Genocide” refers to the current mass slaughter and rape of Darfuri men, women and children in Western Sudan. The killings began in 2003 and continue still today, as the first genocide in the 21st century. The on-going conflict in Darfur, Sudan was declared “genocide” by United States Secretary of State Colin Powell on September 9, 2004, in testimony before the Senate Foreign Relations Committee. On February 18, 2006, President George W. Bush called for the number of international troops in Darfur to be doubled."}, {"url": "http://www.answers.com/Q/Who_were_the_Janjaweed_attacking_in_the_Genocide_of_Darfur", "passage_text": "- http://en.wiktionary.org/wiki/genocide The Islamic controlled government, located in East and North Sudan, started the genocide as an ethnic cleansing of the Darfur region in West Sudan. They hire militia groups known as the Janjaweed to attack villages, rape, kill and loot. They hire militia groups known as t … he Janjaweed to attack villages, rape, kill and loot. I have hire in quotations because the government is not paying them, their reward is what they are able to steal."}, {"url": "https://en.wikipedia.org/wiki/Janjaweed", "passage_text": "Throughout the 1990s, the Janjaweed were Arab partisans, tolerated by the Sudan Government, who pursued local agendas of controlling land. The majority of Darfur's Arabs, the Baggara confederation, began their presence in the war over grazing territory, and remain involved. In 1999–2000, faced with threats of insurgencies in Western and Northern Darfur, Khartoum 's security armed the Janjaweed forces."}]