[{"url": "http://www.growfromseeds.com/?p=705", "passage_text": "I bought some organic broccoli, cauliflower, cabbage and brussels sprouts seeds that were more expensive than the non-organic seeds of the same type. There was also about 50% less seeds than the non-organic ones. Best answer:"}, {"url": "http://sustainablog.org/2011/02/organic-seeds-heirloom-hybrid/", "passage_text": "Whether or not the seeds you purchase are organic means only one thing: that the original seed-producing plant was grown according to organic standards. If you plant a seed that is not certified organic, your resulting plant will still be organic if you yourself do not use synthetic fertilizers or other chemicals."}, {"url": "http://www.blogher.com/theres-no-such-thing-gmo-popcorn-and-other-things-you-should-know", "passage_text": "GMOs can be in anything and no one has to tell you. On the other hand, marketers can slap a no GMO label on something and charge you more when the reality is there is no such thing as a GMO variety of that product. A great example of this is popcorn."}, {"url": "http://www.growfromseeds.com/?p=705", "passage_text": "Organic means carbon based. There is no such thing as non-organic seeds. You might consider sand and rocks as organic seeds. Marketers use the term “organic” to draw in customers but it is a gimmick."}, {"url": "http://www.blogher.com/theres-no-such-thing-gmo-popcorn-and-other-things-you-should-know", "passage_text": "You will hear people say that due to pollination, air pollution, or the intervention of the Alien Overlords (OK. I made that last one up. But people get a little extremist at times) there is no such thing as organic food any more."}, {"url": "http://www.growfromseeds.com/?p=705", "passage_text": "Organic means it is living or once lived. All seed are organic. Seeds only pass on the genes of the plant not how it was grown. For that matter, organic over-priced food is a scam."}, {"url": "http://sustainableseedco.com/corn/", "passage_text": "Heirloom corn hates the cold. There are a few corn varieties that you can put in the soil when its below 65 degrees, but not many. If you want to get a jump start on corn then plant in the greenhouse and transplant corn to the garden later when ALL DANGER OF FROST IS PAST."}]