[{"url": "https://en.wikipedia.org/wiki/Globe_Theatre", "passage_text": "The Globe Theatre was a theatre in London associated with William Shakespeare. It was built in 1599 by Shakespeare's playing company, the Lord Chamberlain's Men, on land owned by Thomas Brend and inherited by his son, Nicholas Brend and grandson Sir Matthew Brend, and was destroyed by fire on 29 June 1613."}, {"url": "https://en.wikipedia.org/wiki/Globe_Theatre", "passage_text": "A second Globe Theatre was built on the same site by June 1614 and closed in 1642. A modern reconstruction of the Globe, named  Shakespeare's Globe , opened in 1997 approximately 750 feet (230 m) from the site of the original theatre. It was built in 1599 by Shakespeare's playing company, the Lord Chamberlain's Men, on land owned by Thomas Brend and inherited by his son, Nicholas Brend and grandson Sir Matthew Brend, and was destroyed by fire on 29 June 1613."}, {"url": "https://answers.yahoo.com/question/index?qid=20120603143306AAwllZC", "passage_text": "Answers. Best Answer: The Globe was built in 1599 using timber from an earlier theatre, (The Theatre, which had been built by Richard Burbage's father, James Burbage, in Shoreditch in 1576). Peter Street (carpenter)"}, {"url": "http://www.shakespeare-online.com/theatre/globe.html", "passage_text": "The lease for the land on which the Globe stood was co-owned by Burbage and his brother Robert, and by a group of five actors -- Will Kempe, Augustine Phillips, John Heminge, Thomas Pope, and William Shakespeare. Much of Shakespeare's wealth came from his holdings in the Globe. On June 29, 1613, during a performance of Henry VIII, a misfired canon ball set the Globe's thatched roof on fire and the whole theatre was consumed. Swift reconstruction did take place and the Globe reopened to the public within a year, with the addition of a tiled roof."}, {"url": "http://www.shakespeare-online.com/theatre/globe.html", "passage_text": "The Globe Theatre was constructed in 1599, out of timber taken from the Theatre. It stood next to the Rose, on the south side of the Thames, and was the most elaborate and attractive theatre yet built. The Globe was designed and constructed for the Chamberlain's Men by Cuthbert Burbage, son of the Theatre's creator, James Burbage. On June 29, 1613, during a performance of Henry VIII, a misfired canon ball set the Globe's thatched roof on fire and the whole theatre was consumed. Swift reconstruction did take place and the Globe reopened to the public within a year, with the addition of a tiled roof."}, {"url": "http://www.answers.com/Q/Where_did_timbers_to_build_the_globe_come_from", "passage_text": "The Globe theatre was built in 1599 by the Lord Chamberlain's Men, of which Shakespeare worked for. It was later burnt to the ground by the Great Fire of London in 1666. In 16 … 14, the Globe theatre was rebuilt and was closed in 1642. Because it was demolished, a modern version was constructed in 1997 named Shakespeare's Globe. Shakespeare was not involved in the building of any of them, although he did invest in the first one. It was built by a man called Street. 1. Shakespeare did not built the Globe Theatre. A man called Peter Street built it. Shakespeare was not a carpenter. 2. Shakespeare did not put up all of the money to build t … he Globe. He did not even put up most of the money to build it."}, {"url": "https://en.wikipedia.org/wiki/Globe_Theatre", "passage_text": "The Globe was built in 1599 using timber from an earlier theatre, The Theatre, which had been built by Richard Burbage's father, James Burbage, in Shoreditch in 1576. The Burbages originally had a 21-year lease of the site on which The Theatre was built but owned the building outright. It was built in 1599 by Shakespeare's playing company, the Lord Chamberlain's Men, on land owned by Thomas Brend and inherited by his son, Nicholas Brend and grandson Sir Matthew Brend, and was destroyed by fire on 29 June 1613."}, {"url": "http://www2.springfield.k12.il.us/schools/springfield/eliz/Globe.html", "passage_text": "The Globe Theatre was an early English theatre in London where most of William Shakespeare's plays were first presented. It was built in 1599 by two brothers, Richard and Cuthbert Burbage, who owned its predecessor, The Theatre. In 1644, 30 years after it was rebuilt, the Globe was torn down. In September 1999, a reconstructed Globe Theatre will officially open in London, 500 years after the first plays were performed in the original theatre. The late Sam Wanamaker, an American actor, was responsible for the Globe's modern reconstruction."}, {"url": "https://www.playshakespeare.com/study/elizabethan-theatres/2189-the-globe-theatre", "passage_text": "The Globe was built in 1599 using timber from an earlier theatre, The Theatre, that had been built by Richard Burbage's father, James Burbage, in Shoreditch in 1576. The Burbages originally had a 20-year lease of the site on which the Theatre was built. The original Globe was an Elizabethan theatre which opened in Autumn 1599 in Southwark, on the south bank of the Thames, in an area now known as Bankside. It was one of several major theatres that were located in the area, the others being the Swan, the Rose and The Hope."}]