[{"url": "http://www.acne.org/whatisacne.html", "passage_text": "Human skin, especially on the face, neck, back, and chest is covered in hundreds of thousands of microscopic hair follicles, often called pores. For reasons no one completely understands, these follicles sometimes overproduce cells and become blocked."}, {"url": "http://www.acne.org/", "passage_text": "Acne occurs when the pores of your skin become clogged, most often on the face, neck, back, and chest. No one knows exactly why this happens, but we do know that testosterone plays a part, as does heredity. 1-5. Once a pore becomes clogged, it traps skin oil inside."}, {"url": "http://www.medicalnewstoday.com/articles/107146.php", "passage_text": "Acne, medically known as Acne Vulgaris, is a skin disease that involves the oil glands at the base of hair follicles. It commonly occurs during puberty when the sebaceous (oil) glands come to life-the glands are stimulated by male hormones produced by the adrenal glands of both males and females."}, {"url": "https://www.nlm.nih.gov/medlineplus/acne.html", "passage_text": "Summary. Acne is a common skin disease that causes pimples. Pimples form when hair follicles under your skin clog up. Most pimples form on the face, neck, back, chest, and shoulders. Anyone can get acne, but it is common in teenagers and young adults."}, {"url": "http://www.medicalnewstoday.com/articles/107146.php", "passage_text": "Acne, medically known as Acne Vulgaris, is a skin disease that involves the oil glands at the base of hair follicles. In humans, pimples tend to appear on the face, back, chest, shoulders and neck."}, {"url": "http://www.webmd.com/skin-problems-and-treatments/guide/understanding-acne-basics", "passage_text": "Acne lesions are most common on the face, but they can also occur on the neck, chest, back, shoulders, and upper arms. Contrary to popular belief, acne isn't caused by a harmful diet, poor hygiene, or an uncontrolled sex drive. The simple truth is that heredity and hormones are behind most forms of acne."}, {"url": "http://www.niams.nih.gov/Health%5FInfo/Acne/", "passage_text": "Acne is a disorder resulting from the action of hormones and other substances on the skin’s oil glands (sebaceous glands) and hair follicles. These factors lead to plugged pores and outbreaks of lesions commonly called pimples or zits. Acne lesions usually occur on the face, neck, back, chest, and shoulders."}, {"url": "http://thescienceofacne.com/what-is-acne/", "passage_text": "Acne (Acne vulgaris) is a difficult to treat and often debilitating disease that affects the skin, usually the face. In most cases, acne is an infection of the sebaceous gland and/or the hair follicle. This infection is often accompanied by varying degrees of inflammation, which present as more severe acne symptoms."}]