[{"url": "http://work.chron.com/years-education-become-neurologist-12039.html", "passage_text": "The first step along the path to becoming a neurologist is to earn your bachelor’s degree. Medical schools do not have a finite list of acceptable degrees, but admissions officers typically prefer applicants who major in a relevant field. Biology, physics and chemistry are possible choices for an undergraduate major. A neurologist is a physician who specializes in the human nervous system. Neurologists treat a variety of problems, including spinal cord injuries and diseases such as epilepsy. If you want to become a neurologist, be prepared to complete an extensive education"}, {"url": "http://www.wikiprofessional.org/Neurologist", "passage_text": "It typically takes about 12 years to become a neurologist. 4 years are spent as an undergraduate working toward a bachelor's degree, and then another 4 years are spent in medical school. After medical school, graduates will then undertake a one year internship, followed by a 3 year residency program. How To Become A Neurologist. The process to become a neurologist is lengthy. First, one must complete a bachelor's degree. Before graduating with their bachelor's degree, students will need to take the Medical College Admission Test (MCAT) and apply to"}, {"url": "http://collegemouse.com/jobs/how-to-become-a-neurologist.html", "passage_text": "Neurology is a medical discipline that focuses on the study and treatment of conditions related to the nervous system. A neurologist is a medical physician that specializes in neurology and has received intense training on examining, diagnosing, and treating a variety of neurological conditions. After medical school prospective neurologists complete internships in a related area and residency training in neurology. Some neurologists complete additional fellowship training to specialize in a specific area."}, {"url": "http://www.answers.com/Q/What_degree_do_you_need_to_be_a_neurologist", "passage_text": "to be a smart person. A: To be a neurologist, you need to have a medical degree such as a Doctor of Osteopathic Medicine (D.O.), Bachelor of Medicine/Bachelor of Surgery (MBChB or MBBS), or a Doctor of Medicine (M.D.) and many years of specialization during your residency. "}, {"url": "http://study.com/articles/Become_a_Neurologist_Step-by-Step_Career_Guide.html", "passage_text": "Step 2: Complete a Medical School Program. Aspiring neurologists are required to earn a Doctor of Medicine degree by attending medical school. Most medical school programs last four years, with the first two years typically covering the basics of human anatomy and physiology. Courses may also delve into nutrition, immunology and ethics. Neurologists are physicians and surgeons who treat patients with nervous system disorders, including problems with the brain, spinal cord, and peripheral nerves."}, {"url": "http://study.com/articles/Become_a_Neurologist_Step-by-Step_Career_Guide.html", "passage_text": "Earning a bachelor's degree is the first step toward becoming a neurologist. There is no specific major required for undergraduate study; however, aspiring neurologists may benefit from concentrating their studies in biological sciences, chemistry, physics or pre-med to meet admission requirements for medical school. Neurologists are physicians and surgeons who treat patients with nervous system disorders, including problems with the brain, spinal cord, and peripheral nerves."}, {"url": "http://www.answers.com/Q/What_college_degree_do_you_need_to_become_a_neurologist", "passage_text": "Confidence votes 2.3K. A neurologist is a medical physician (D.O. or M.D.) who has trained in the diagnosis and treatment of nervous system disorders, including diseases of the brain, spinal cord, nerves, and muscles. What you need is to get an undergraduate bachelors degree so that you can get into medical school, and then earn … a medical degree such as a Doctor of Osteopathic Medicine (D.O.) degree, a Bachelor of Medicine/Bachelor of Surgery (MBBS) degree, or a Doctor of Medicine (M.D.) degree."}, {"url": "http://www.answers.com/Q/What_college_degree_do_you_need_to_become_a_neurologist", "passage_text": "to be a smart person A: To be a neurologist, you need to have a medical degree such as a Doctor of Osteopathic Medicine (D.O.), Bachelor of Medicine/Bachelor of Surgery (MBC … hB or MBBS), or a Doctor of Medicine (M.D.) and many years of specialization during your residency. What you need is to get an undergraduate bachelors degree so that you can get into medical school, and then earn … a medical degree such as a Doctor of Osteopathic Medicine (D.O.) degree, a Bachelor of Medicine/Bachelor of Surgery (MBBS) degree, or a Doctor of Medicine (M.D.) degree."}, {"url": "http://collegemouse.com/jobs/how-to-become-a-neurologist.html", "passage_text": "To become a neurologist, you must complete an undergraduate degree, medical degree, and internship and residency training. Medical school provides intensive classroom and laboratory instruction as well as a variety of clinical rotations. After medical school prospective neurologists complete internships in a related area and residency training in neurology. Some neurologists complete additional fellowship training to specialize in a specific area."}]