[{"url": "http://www.sqas.org/", "passage_text": "SQAS (Safety & Quality Assessment System) is a system to evaluate the quality, safety, security and environmental performance of Logistics Service Providers and Chemical Distributors in a uniform manner by single standardised assessments carried out by independent assessors using a standard questionnaire. "}, {"url": "http://dqs-elsalvador.com/sqas.html", "passage_text": "An SQAS assessment does not represent a certification; its objective is to evaluate the quality of a safety, health, environmental or quality management system on the basis of demonstrated facts. The SQAS – ROAD – Questionnaire is a way to evaluate security, health, environmental and quality aspects. A total of 443 questions add up to a maximum of 557 points. The evaluation covers six major subjects:"}, {"url": "http://dqs-elsalvador.com/sqas.html", "passage_text": "SQAS (Safety & Quality Assessment System) is a system to evaluate the quality, safety, security and environmental performance of Logistics Service Providers (LSP's) and Chemical Distributors in a uniform manner by single standardised assessments carried out by independent assessors using a standard questionnaire. The SQAS – ROAD – Questionnaire is a way to evaluate security, health, environmental and quality aspects. A total of 443 questions add up to a maximum of 557 points. The evaluation covers six major subjects:"}, {"url": "http://www.cefic.org/Industry-support/Responsible-Care-tools-SMEs/Transport-Logistics/Safety-and-Quality-Assessment-System-SQAS/", "passage_text": "SQAS is a standardised assessment to evaluate the quality, safety, security and environmental performance of logistics service providers and chemical distributors centrally managed by Cefic. An SQAS assessment offers a detailed factual and objective report, which each chemical company needs to evaluate according to its own requirements. It shows the LSP the areas for improvement and offers a guideline towards these improvements."}, {"url": "http://www.cefic.org/Industry-support/Transport--logistics/SQAS2/", "passage_text": "SQAS Transport Service is a scheme that evaluates the quality, safety, security and environmental standards and performance of road transport companies, freight forwarders and intermodal service providers. CDI-T is a scheme that evaluates the quality, safety, security and environmental standards and performance of bulk liquid chemical storage terminals."}, {"url": "http://www.neshfreight.co.za/sqas-function.html", "passage_text": "SQAS (Safety and Quality Assessment System) is a system that is used to evaluate various areas of performance of Logistics Service Providers and Chemical Distributors; ensuring that these companies operate within safety, quality, security and environmental parameters. The SQAS assessments are compiled by independent assessors, who compile the results into a factual report that the Logistic Service Provider or Chemical Distributor can use for evaluation of their own company."}, {"url": "http://www.sqas.org/introduction.php", "passage_text": "SQAS (Safety & Quality Assessment System) is a system to evaluate the quality, safety, security and environmental performance of Logistics Service Providers (LSP's) and Chemical Distributors in a uniform manner by single standardised assessments carried out by independent assessors using a standard questionnaire. Cefic has developed five specific SQAS questionnaires for the different types of LSP active in land logistics and one for chemical distribution, in close co-operation with the involved partner companies and their associations."}, {"url": "http://www.sqas.co.za/what-sqas/", "passage_text": "Background Info. SQAS (Safety & Quality Assessment System) is a system to evaluate the quality, safety, security and environmental performance of Logistics Service Providers in a uniform manner by single standardised assessments carried out by independent assessors using a standard questionnaire. The SQAS Assessors. The assessments are done by professional auditors who are trained and accredited by SAATCA for each type of assessment. They are also closely monitored by CAIA to ensure a continuous high and uniform quality of work across South Africa."}, {"url": "http://dqs-elsalvador.com/sqas.html", "passage_text": "The system is based on four pillars: A common questionnaire for each category of companies The accreditation of assessors The electronic database of assessment reports The Service Group ======= SQAS SQAS-Safety and Quality Assessment System Product information ... The SQAS – ROAD – Questionnaire is a way to evaluate security, health, environmental and quality aspects. A total of 443 questions add up to a maximum of 557 points. The evaluation covers six major subjects:"}, {"url": "http://www.cefic.org/Industry-support/Transport--logistics/SQAS2/", "passage_text": "A growing number of chemical companies use Cefic’s Safety and Quality Assessment Systems (SQAS) for evaluating the safety, security, quality and environmental standards of their logistics service providers. CDI-T is a scheme that evaluates the quality, safety, security and environmental standards and performance of bulk liquid chemical storage terminals."}]