[{"url": "http://www.differencebetween.com/difference-between-salary-and-vs-hourly/", "passage_text": "Key Difference – Salary vs Hourly. Salary and hourly wage are two different systems used by employers for remunerating an employee between which some differences can be identified. While salary is the more commonly use term used for remuneration from a job, hourly wages are also given in many professions. While salaried people can be fired easily by their employers, hourly employees need to be given in writing and are difficult to be fired. This highlights that there is a clear difference between salary and hourly. Now let us summarize the difference between the two compensation systems as follows."}, {"url": "http://www.answers.com/Q/What_is_the_difference_between_a_salary_and_a_wage", "passage_text": "A wage is better because you get paid for how many hours you work, while, with a salary, you get a set amount of payment. An example of a job that gets a salary is a teacher. It doesn't matter how much homework they grade over weekends and vacations, they get the same amount of money. A salary is a fixed amount of pay per week or month (usually paid semi-monthly). A yearly pay is known as an annual amount or annual pay. Minimum wage as of July 15, 2009, is $7.25 per hour. Salary is paid notwithstanding the amount of hours to usually Management employees."}, {"url": "http://www.csls.ca/notes/Note2009-2.pdf", "passage_text": "First, despite an average increase of 0.33 per cent in median real hourly wage in the United States, the gap between real wages and labour productivity annual growth was larger in the United States (1.40 percentage points) than in Canada (1.26 percentage points) between 1980 and 2005. Summary Table 1 provides the key results for Canada and the United States. In the U.S. non-farm business sector, real median hourly wages rose at an average annual rate of 0.33 per cent between 1980 and 2005, while labour productivity increased at an average annual rate of 1.73 per cent over the same period."}, {"url": "http://www.accountingtools.com/questions-and-answers/what-is-the-difference-between-salary-and-wages.html", "passage_text": "A person who receives wages is also entitled to overtime pay of 1.5x his normal rate of pay if he works more than 40 hours per week. There is also a difference between salary and wages in regard to the speed of payment. If a person is paid wages and there is a gap between the last day worked for which he is paid and his pay date, that gap is paid in his next paycheck. This gap does not exist for a salaried worker, since he is paid through the pay date."}, {"url": "https://answers.yahoo.com/question/index?qid=1006050908493", "passage_text": "· just now. Report Abuse. Salary is when you get paid no matter how much time you spend at work where as hourly, you get paid for every hour you work and overtime parameters apply to it. Most folks prefer hourly because they make more money and they don't spend 16 hours a day at work, 7 days a week. No matter how many hours you put in. 40 hours per month or 200 hours per month you still only get $1,000.00. Hourly you get paid a set wage for EACH hour you work.Usually you will get overtime for those hours over 40 per week when you are hourly....BUT not on salary.!"}, {"url": "http://www.accountingtools.com/questions-and-answers/what-is-the-difference-between-salary-and-wages.html", "passage_text": "The essential difference between a salary and wages is that a salaried person is paid a fixed amount per pay period and a wage earner is paid by the hour. Someone who is paid a salary is paid a fixed amount in each pay period, with the total of these fixed payments over a full year summing to the amount of the salary. This person is considered to be an exempt employee. There is no linkage between the amount paid and the number of hours worked. If a person is paid wages and there is a gap between the last day worked for which he is paid and his pay date, that gap is paid in his next paycheck. This gap does not exist for a salaried worker, since he is paid through the pay date."}, {"url": "http://smallbusiness.chron.com/difference-between-compensation-stategy-hourly-salaried-employees-retail-industry-38368.html", "passage_text": "Employers developing a compensation strategy with hourly pay in mind may be banking on the fact that they can get the quality and quantity of work that they need done within a prescribed time frame. Employers who adopt hourly pay plans may avoid scheduling employees beyond 40 hours per week due to legal work limits. Definitions. Putting together a retail industry pay plan requires that the employer first have strong grasp of the differences between salaried and employees paid hourly. Employees paid on an hourly basis receive a wage for each hour of work they perform."}, {"url": "http://www.differencebetween.com/difference-between-salary-and-vs-hourly/", "passage_text": "If you have an option of choosing between a salary and an hourly wage system, you can decide based upon how time-consuming the job is. If there are a number of hours, it is better if you accept the hourly system. There is another advantage that the hourly system has over salary system. While salaried people can be fired easily by their employers, hourly employees need to be given in writing and are difficult to be fired. This highlights that there is a clear difference between salary and hourly. Now let us summarize the difference between the two compensation systems as follows."}, {"url": "https://answers.yahoo.com/question/index?qid=1006050908493", "passage_text": "Salary is the remuneration you get for a month's work, and is generally constant, irrespective of the number of holidays, Sundays etc. This is usually fixed for a person for the job. But hourly rate is only for the actual hours worked, and is usually prorata to the hours worked. No matter how many hours you put in. 40 hours per month or 200 hours per month you still only get $1,000.00. Hourly you get paid a set wage for EACH hour you work.Usually you will get overtime for those hours over 40 per week when you are hourly....BUT not on salary.!"}]