[{"url": "http://extension.psu.edu/animals/poultry/topics/general-educational-material/incubation/incubation-period-of-other-species", "passage_text": "Incubation Period of Other Species. One of the miracles of nature is the transformation of the egg into the chick. In a brief three weeks of incubation, a fully developed chick grows from a single cell and emerges from a seemingly lifeless egg. Not every avian eggs hatch in 21 days. See the chart below for incubation periods for other fowl. The duckbill platypus is the only mammal that lays eggs and they have an incubation period of 12 days. Never incubate the eggs of wild birds; these chicks will not live without their mother's care if they do hatch. Incubation Periods (species and days required to hatch)"}, {"url": "http://chickscope.beckman.uiuc.edu/resources/egg_to_chick/procedures.html", "passage_text": "PREPARING THE EGGS FOR INCUBATION. Eggs must be turned while in the incubator, so before you put in the eggs mark them with a pencil so you can tell when they have been properly turned. An excellent method is to put an X on one side of the egg and an 0 on the opposite side. If the eggs were chilled or you ran into operational difficulties during the incubation period, the hatch may be delayed. Chicks that hatch beyond the 22nd day are usually not healthy, vigorous ones. When most of the eggs are hatched, lower the temperature to approximately 95 F (35 C)."}, {"url": "http://animaldiversity.org/accounts/Junco_hyemalis/", "passage_text": "The female lays 3 to 6 white or pale green eggs spotted with brown. The eggs are usually ovate and slightly glossy. Average egg size is about 0.8 inches (19 mm). The incubation period lasts 12 to 13 days; incubation is usually done by the females. Chicks leave the nest 9 to 13 days after hatching. After leaving the nest, the young remain at least partially dependent on their parents for about 3 weeks. Most dark-eyed juncos begin breeding at at 1 year"}, {"url": "http://txtbba.tamu.edu/species-accounts/dark-eyed-junco/", "passage_text": "The female lays 3-5, slightly glossy, pale bluish-white to white eggs (see Harrison [1979] for a photo of markings). The incubation period is 12-13 days and nestlings fledge 9-12 days after hatching and feed themselves 2 weeks after leaving the nest. Two successful clutches may be raised in one season. Rates of parasitism by Brown-headed Cowbirds (Molothrus ater) vary widely (Harrison 1979, Nolan et al. 2002)."}, {"url": "http://chickscope.beckman.uiuc.edu/resources/egg_to_chick/procedures.html", "passage_text": "Chicks will start to pip the shell around the 19th day. All chicks which are going to hatch should be out of their shells by the 21st day. If the eggs were chilled or you ran into operational difficulties during the incubation period, the hatch may be delayed. Chicks that hatch beyond the 22nd day are usually not healthy, vigorous ones. When most of the eggs are hatched, lower the temperature to approximately 95 F (35 C)."}, {"url": "http://www.backyardchickens.com/a/how-to-incubate-hatch-eggs-just-21-days-from-egg-to-chicken", "passage_text": "Related tutorials: How-To #2: The First 60 Days. General Hints. First things first-eggs should hatch in 21 days, though some may hatch a day or 2 early and some a day or 2 late, after the incubation period began. Turning. Turning is essential during the first 14 days of incubation and should be continued until 3 days prior to the eggs expected hatch day. If hand turning, always turn the eggs an uneven number of times a day, so the eggs do not spent two nights in a row in the same position."}, {"url": "http://www.biokids.umich.edu/critters/Junco_hyemalis/", "passage_text": "Dark-eyed juncos are small birds that are 12.5 to 16.5 cm long. They weigh about 19 g and have a wingspan of about 23.5 cm. They have a dark gray head, back and breast and a very white belly. Their tails are dark gray on the middle feathers and white on the outside feathers. The eggs are usually slightly glossy and about 19 mm long. The female incubates the eggs for 12 to 13 days. The chicks are helpless when they hatch, but they are able to leave the nest after 9 to 13 days. The parents feed the chicks while they are in the nest and for about 3 weeks after they have left the nest."}, {"url": "http://web.stanford.edu/group/stanfordbirds/text/essays/Incubation_Time.html", "passage_text": "Incubation time is roughly correlated with the weight of the egg. The eggs of small songbirds generally hatch in about 11 days; those of the Royal Albatross in about 80 days. More information on incubation, based on careful, long-term observations of nests, is needed for most species of North American birds. Since, in general, birds do not begin incubating until the clutch is complete, incubation time is defined as the period from the laying of the last egg of the clutch until that egg hatches (or, if individual eggs can't be identified, from the last egg laid to the first egg hatched)."}, {"url": "https://en.wikipedia.org/wiki/Egg_incubation", "passage_text": "In perhaps the best known example, the platypus, the eggs develop in utero for about 28 days, with only about 10 days of external incubation (in contrast to a chicken egg, which spends about one day in tract and 21 days externally). After laying her eggs, the female curls around them. "}]