[{"url": "http://oceanservice.noaa.gov/facts/datum.html", "passage_text": "The vertical datum is similarly realized through a collection of specific points on the Earth with known heights either above or below a nationally defined reference surface (e.g., mean sea level). Geodetic vertical datums are generally used to express land elevations. However, water level datums are a slightly different vertical datum, and are used as a reference level to which bathymetric soundings are referenced for nautical charts."}, {"url": "http://geography.about.com/od/geographyintern/a/datums.htm", "passage_text": "By Amanda Briney, Geography Intern. A geodetic datum is the tool used to define the shape and size of the earth, as well as the reference point for the various coordinate systems used in mapping the earth. Throughout time, hundreds of different datums have been used-each one changing with the earth views of the times."}, {"url": "http://wiki.gis.com/wiki/index.php/Datum_(geodesy)", "passage_text": "Horizontal datums are used for describing a point on the earth 's surface, in latitude and longitude or another coordinate system. Vertical datums measure elevations or depths. In engineering and drafting, a datum is a reference point, surface, or axis on an object against which measurements are made."}, {"url": "http://wiki.gis.com/wiki/index.php/Datum_(geodesy)", "passage_text": "In surveying and geodesy, a datum is a set of reference points on the earth's surface against which position measurements are made, and (often) an associated model of the shape of the earth (reference ellipsoid) to define a geographic coordinate system."}, {"url": "http://vdatum.noaa.gov/docs/datums.html", "passage_text": "1 A geodetic datum is a set of constants specifying the coordinate system used for geodetic control. 2  A geodetic datum is as defined above, together with the coordinate system and the set of all points and lines whose coordinates, lengths, and directions have been determined by measurement and calculation."}, {"url": "http://oceanservice.noaa.gov/facts/datum.html", "passage_text": "A geodetic datum is an abstract coordinate system with a reference surface (such as sea level) that serves to provide known locations to begin surveys and create maps. In this way, datums act similar to starting points when you give someone directions."}]