[{"url": "http://smallbusiness.chron.com/hr-business-partner-model-3878.html", "passage_text": "Management buy-in may also be a challenge, as the traditional role of human resources is extended to that of an overseer of the entire business in the business-partner model. Related Reading: Global HR-Related Issues in Business Settings."}, {"url": "http://www.ehow.com/about_6511465_meaning-strategic-partner_.html", "passage_text": "In a strategic alliance or partnership, each business remains separate from the partner. Therefore, the profits generated by one partner's business activities remain its own. The premise is that each partner recognizes increased business, revenue or profit as a result of the partnership."}, {"url": "http://smallbusiness.chron.com/hr-business-partner-model-3878.html", "passage_text": "In the HR business partner model, the human resource department participates in strategic planning to help the business meet present and future goals."}, {"url": "http://www.hrzone.com/hr-glossary/what-is-an-hr-business-partner", "passage_text": "HR Business Partner definition. HR business partners are HR professionals who work closely with an organisation’s senior leaders in order to develop an HR agenda that closely supports the overall aims of the organisation."}, {"url": "http://www.ehow.com/about_6511465_meaning-strategic-partner_.html", "passage_text": "A strategic partnership is an agreement between two distinct business entities to share expertise, resources or competencies for mutual benefit. Typically, you seek out a strategic partnership to fill a gap in your own strengths or to create a synergy that increases your profit potential."}, {"url": "http://www.ey.com/GL/en/Services/Advisory/Managing-performance-through-famine-and-feast---2-cfo-as-business-partner", "passage_text": "The CFO's strategic role as business partner. CFOs must demonstrate that the Finance function is equipped to manage performance through periods of growth, stagnation and contraction."}, {"url": "http://www.strategic-human-resource.com/hr-as-strategic-partner.html", "passage_text": "Some people refer to HR as business partner. In the context of strategic human resource management, the HR function and activities are intended to ensure the organization's financial success. As partners your HR people and employees in the various areas of the organization's operations must not get in the others' way."}]