[{"url": "http://www.answers.com/Q/What_is_received_commission", "passage_text": "Confidence votes 254. commission is a system of payment when you are successful in exchanging goods of services. so if you sell an product, you will get a certain percentage of the profit or an agreed amount. this is to encourage people to try and sell more, because how much you make is parallel to how much you sell. Phil Smith is a car salesman last week his total sales amounted to 276500.00 and he received 1382.50 in commission what is his rate of commission?"}, {"url": "http://money.howstuffworks.com/business/getting-a-job/calculate-your-draw-on-sales-commissions2.htm", "passage_text": "Calculating taxes on sales commissions is relatively simple: The draw and the commission are taxed together as ordinary income. For example, say you earned a $25,000 draw and an additional $50,000 in commission. Total compensation for the year is $75,000, and taxes must be paid at the appropriate income rate. Calculating Taxes on Sales Commissions. If you'll be receiving a draw on a sales commission, it's very important to understand its pros and cons, how the amount of the draw is calculated, and how taxes are computed."}, {"url": "http://www.accountingtools.com/commission-expense-accounting", "passage_text": "Commission Expense Accounting. A commission is a fee that a business pays to a salesperson in exchange for his or her services in either facilitating, supervising, or completing a sale. The commission may be based on a flat fee arrangement, or (more commonly) as a percentage of the revenue generated. Under the cash basis of accounting, you should record a commission when you pay it, so there is a credit to the cash account and a debit to the commission expense account. You can classify the commission expense as part of the cost of goods sold, since it directly relates to the sale of goods or services."}, {"url": "http://www.investopedia.com/terms/c/commission.asp", "passage_text": "BREAKING DOWN 'Commission'. The brokerage with the lowest commissions is not necessarily the best one. Discount brokerages offer no advice, which can prove to be troublesome for many rookie investors. On the other hand, full-service brokerages offer a more personalized service, but commissions are much higher. However, when commission is charged there is the potential for a conflict of interest to develop between brokerages and their clients."}, {"url": "http://www.letslearnaccounting.com/commission-received", "passage_text": "Commission Receivable Account. Credit:- Commission Received Account. The commission received will be shown in income side of profit and loss account since it is a revenue income. Note:- Commission receivable account will be shown in assets side of balance sheet. RELATED TERMS: 1  Learn Accounting, Free Accounting Tips. 2  General Accounting Terms. "}, {"url": "http://www.accountingtools.com/commission-expense-accounting", "passage_text": "If the person receiving the commission is not an employee, then that person considers the commission to be revenue, and may pay taxes if there is a resulting profit. Example of a Commission Expense. Fred Smith sells a $1,000 widget for ABC International. Under the cash basis of accounting, you should record a commission when you pay it, so there is a credit to the cash account and a debit to the commission expense account. You can classify the commission expense as part of the cost of goods sold, since it directly relates to the sale of goods or services."}, {"url": "https://en.wikipedia.org/wiki/Commission_%28remuneration%29", "passage_text": "The payment of commission as sales people. Payments often will be calculated on the basis of a percentage of the goods sold. This is a way for firms to solve the principal–agent problem, by attempting to realign employees' interests with those of the firm. "}, {"url": "http://www.investopedia.com/terms/c/commission.asp", "passage_text": "DEFINITION of 'Commission'. A service charge assessed by a broker or investment advisor in return for providing investment advice and/or handling the purchase or sale of a security. Most major, full-service brokerages derive most of their profits from charging commissions on client transactions. On the other hand, full-service brokerages offer a more personalized service, but commissions are much higher. However, when commission is charged there is the potential for a conflict of interest to develop between brokerages and their clients."}]