[{"url": "http://www.wellhall.org.uk/butterflies.php", "passage_text": "It has two broods in a year, the first is on the wing in May and June and the second in August. This butterfly has white uppersides to its wings and it's only the males that have orange-tipped forewings; females have small black tips. The orange tips warn predators that this butterfly is highly distasteful. The red admiral is a common species; some over-winter here but others fly long distances from the continent. The small white, which along with the slightly larger, large white is what is commonly known as the cabbage white. Jason has captured the first butterfly sighting of the year in the Pleasaunce."}, {"url": "http://www.learnaboutbutterflies.com/Enemies%20of%20Butterflies.htm", "passage_text": "Predators of caterpillars Butterfly and moth larvae are taken in huge numbers by predators. A study of predation on Pieris rapae estimated that 52% and 63% of 1st / 2nd instar larvae were eaten in 2 consecutive years by invertebrate predators including Carabid beetles, Hemipteran bugs, wasps, mites and spiders. Hunting spider Pisaura mirabilis Adrian Hoskins Male hunting spiders Pisaura mirabilis attack butterflies that settle on low herbage. They wrap their victims tightly in silk and present them to the female spider as a courtship gift."}, {"url": "http://www.learnaboutbutterflies.com/Enemies%20of%20Butterflies.htm", "passage_text": "Home. Birds and other vertebrate predators rely primarily on sight to locate prey, so butterflies and moths have evolved numerous visually mediated means to avoid attack. These include passive defence mechanisms e.g. camouflage, disguise, mimicry, warning colouration and transparency. Hunting spider Pisaura mirabilis Adrian Hoskins Male hunting spiders Pisaura mirabilis attack butterflies that settle on low herbage. They wrap their victims tightly in silk and present them to the female spider as a courtship gift."}, {"url": "https://en.wikipedia.org/wiki/Owl_butterfly", "passage_text": "An owl butterfly is a butterfly, in the genus Caligo, known for their huge eyespots, which resemble owls' eyes. They are found in the rainforests and secondary forests of Mexico, Central, and South America. Research of Stevens et al. (2008), however, suggests that eye-spots are not a form of mimicry and do not deter predators because they look like eyes. Rather the conspicuous contrast in the patterns on the wings deter predators."}, {"url": "http://www.uknature.co.uk/butterflies/P.tithonus-info.html", "passage_text": "The Gatekeeper, sometimes called the Hedge Brown, is a common butterfly in the United Kingdom. As indicated by its common name, the gatekeeper butterfly prefers the habitat of meadow margins and hedges and field gates are often in such locations. "}, {"url": "http://www.wildlifetrust.org.uk/cheshire/documents/butterfy_id.pdf", "passage_text": "Activity Sheet: Identify Butterflies Brightly Coloured Butterflies These are the easiest butterflies; look closely, they all have different colours and patterns Peacock The eyespots on the wings are distinc-tive; they may confuse predators. A com-mon garden butterfly. The caterpillars feed on stinging nettles. It looks very like the gatekeeper, but it is larger and the orange patches on the wings are smaller Gatekeeper Often found alongside sunny hedges. It has bright orange patches and 2 tiny white spots within the black patch on the fore-wing. Garden Tiger This is not a butterfly but a moth, which is active by day."}, {"url": "http://www.ukbutterflies.co.uk/species.php?species=atalanta", "passage_text": "The Red Admiral is a frequent visitor to gardens throughout the British Isles and one of our most well-known butterflies. This butterfly is unmistakable, with the velvety black wings intersected by striking red bands. "}, {"url": "http://butterfly-conservation.org/files/gardening-for-butterflies_final_a5-version10_with-join1.pdf", "passage_text": "Meadow Brown 50-55mm Because the Meadow Brown caterpillar feedson many different grasses, this species canbe found in many places. Green-veined White 50mm There are four white butterflies in Britain, and none of them are called the Cabbage White. Gatekeeper 40-47mm The Gatekeeper gets its name becauseit likes to live in hedgerows, so it isoften spotted around gates. Comma 55-50mm The Comma’s name comes from the commashaped marking on the underside of its wing."}, {"url": "https://en.wikipedia.org/wiki/Owl_butterfly", "passage_text": "Owl butterflies are very large, 65–200 mm (2.6–7.9 in), and fly only a few meters at a time, so avian predators have little difficulty in following them to their settling place. Research of Stevens et al. (2008), however, suggests that eye-spots are not a form of mimicry and do not deter predators because they look like eyes. Rather the conspicuous contrast in the patterns on the wings deter predators."}]