[{"url": "http://www.huffingtonpost.com/zach-cutler/press-release-tips_b_2120630.html", "passage_text": "While the format for a press release is basic, the content of the release should be anything but. Follow these eight tips to write a great press release that will make your company look professional, accessible and attractive to writers looking for stories. 1. Grab attention with a good headline."}, {"url": "http://www.jimcollins.com/article_topics/articles/good-to-great.html", "passage_text": "In fact, leaders of companies that go from good to great start not with where but with who. They start by getting the right people on the bus, the wrong people off the bus, and the right people in the right seats."}, {"url": "http://www.barnesandnoble.com/w/good-to-great-jim-collins/1100019879", "passage_text": "When the dust cleared and the good-to-great companies were identified, the author and his researchers found distinct patterns of behavior in those who led each company and the people who followed them-patterns that concerned disciplined people, thought and action."}, {"url": "http://www.wisegeek.org/what-is-the-hedgehog-concept.htm", "passage_text": "The hedgehog concept is a corporate leadership strategy outlined in Jim Collins’ 2001 book, Good to Great."}, {"url": "http://www.amazon.com/Good-To-Great-James-Collins/dp/185686863X", "passage_text": "Neither Good Nor Great. Format: Hardcover. This book by Jim Collins is one of the most successful books to be found in the Business section of your local megabookstore, and given how it purports to tell you how to take a merely good company and make it great, it's not difficult to see why that might be so."}, {"url": "https://en.wikipedia.org/wiki/Good_to_Great", "passage_text": "Good to Great. From Wikipedia, the free encyclopedia. Good to Great: Why Some Companies Make the Leap... and Others Don't is a management book by James C. Collins that aims to describe how companies transition from being average companies to great companies and how companies can fail to make the transition."}, {"url": "https://en.wikipedia.org/wiki/Good_to_Great", "passage_text": "Greatness is defined as financial performance several multiples better than the market average over a sustained period. Collins finds the main factor for achieving the transition to be a narrow focusing of the company’s resources on their field of competence. The book was a massive bestseller, selling four million copies and going far beyond the traditional audience of business books."}]