[{"url": "http://history1900s.about.com/od/1920s/p/prohibition.htm", "passage_text": "The Volstead Act. While it was the 18th Amendment that established Prohibition, it was the Volstead Act (passed on October 28, 1919) that clarified the law. The Volstead Act stated that beer, wine, or other intoxicating malt or vinous liquors meant any beverage that was more than 0.5% alcohol by volume. Prohibition was a period of nearly fourteen years of U.S. history in which the manufacture, sale, and transportation of liquor was made illegal. It led to the first and only time an Amendment to the U.S. Constitution was repealed. Dates: 1920 -- 1933. Also Known As: Noble Experiment."}, {"url": "http://www.history.com/this-day-in-history/prohibition-ends", "passage_text": "A+E Networks. The 21st Amendment to the U.S. Constitution is ratified, repealing the 18th Amendment and bringing an end to the era of national prohibition of alcohol in America. At 5:32 p.m. EST, Utah became the 36th state to ratify the amendment, achieving the requisite three-fourths majority of states’ approval. In the meantime, Congress passed the Volstead Act on October 28, 1919, over President Woodrow Wilson’s veto. The Volstead Act provided for the enforcement of Prohibition, including the creation of a special Prohibition unit of the Treasury Department."}, {"url": "http://www.history.com/topics/prohibition", "passage_text": "Ratified on January 29, 1919, the 18th Amendment went into effect a year later, by which time no fewer than 33 states had already enacted their own prohibition legislation. In October 1919, Congress passed the National Prohibition Act, which provided guidelines for the federal enforcement of Prohibition. Championed by Representative Andrew Volstead of Mississippi, the chairman of the House Judiciary Committee, the legislation was more commonly known as the Volstead Act."}, {"url": "http://www.umich.edu/~eng217/student_projects/nkazmers/prohibition1.html", "passage_text": "The illegalization of alcohol (consumption and manufacture) was passed into law at a national level in 1919 and enacted in 1920. Often historians regard Prohibition as the culmination, perhaps the over-extension, of the efforts at social change which thrived during the era. "}, {"url": "https://en.wikipedia.org/wiki/Prohibition_in_the_United_States", "passage_text": "Prohibition in the United States was a nationwide constitutional ban on the sale, production, importation, and transportation of alcoholic beverages that remained in place from 1920 to 1933. Prohibition was mandated under the Eighteenth Amendment to the United States Constitution. Enabling legislation, known as the Volstead Act, set down the rules for enforcing the ban and defined the types of alcoholic beverages that were prohibited. For example, religious uses of wine were allowed."}, {"url": "http://www.liquorlaws.net/prohibition.html", "passage_text": "This amendment gave states the right to regulate or ban the sale of liquor. However, even after the 21st Amendment was passed, several states still enforced prohibition laws, and Mississippi was the last state to repeal prohibition laws in 1966. Even today, there are several counties or townships where alcohol may not be sold, though it may be consumed privately. During this period, from 1919 to 1933, the manufacture, sale and transportation of alcohol were banned across the United States due to the Eighteenth Amendment to the Constitution. Though Prohibition did not begin until 1919, its roots were planted in the 1840s."}, {"url": "http://www.history.com/topics/prohibition", "passage_text": "Introduction. The ratification of the 18th Amendment to the U.S. Constitution–which banned the manufacture, transportation and sale of intoxicating liquors–ushered in a period in American history known as Prohibition. In October 1919, Congress passed the National Prohibition Act, which provided guidelines for the federal enforcement of Prohibition. Championed by Representative Andrew Volstead of Mississippi, the chairman of the House Judiciary Committee, the legislation was more commonly known as the Volstead Act."}, {"url": "http://www.history.com/this-day-in-history/prohibition-ends", "passage_text": "In 1933, the 21st Amendment to the Constitution was passed and ratified, ending national Prohibition. After the repeal of the 18th Amendment, some states continued Prohibition by maintaining statewide temperance laws. In the meantime, Congress passed the Volstead Act on October 28, 1919, over President Woodrow Wilson’s veto. The Volstead Act provided for the enforcement of Prohibition, including the creation of a special Prohibition unit of the Treasury Department."}]