[{"url": "https://en.wikipedia.org/wiki/Cultural_depictions_of_turtles", "passage_text": "As a result of its role as a slow, peaceful creature in culture, the turtle can be misconceived as a sedentary animal; however, many types of turtle, especially sea turtles, frequently migrate over large distances in oceans. There is also a small carving of the turtle which is described as a 'tiny god'. A rhyme is recited by the characters, See the TURTLE of enormous girth, on his shell he holds the Earth.. This rhyme and the turtle also show up in King's novel It, where the turtle represents the opposition to the terror that is It."}, {"url": "https://en.wikipedia.org/wiki/Cultural_depictions_of_turtles", "passage_text": "Turtles are frequently depicted in popular culture as easygoing, patient, and wise creatures. Due to their long lifespan, slow movement, sturdiness, and wrinkled appearance, they are an emblem of longevity and stability in many cultures around the world. Turtles are regularly incorporated into human culture, with painters, photographers, poets, songwriters, and sculptors using them as subjects. There is also a small carving of the turtle which is described as a 'tiny god'. A rhyme is recited by the characters, See the TURTLE of enormous girth, on his shell he holds the Earth.. This rhyme and the turtle also show up in King's novel It, where the turtle represents the opposition to the terror that is It."}, {"url": "https://www.aboriginalartonline.com/culture/symbols.php", "passage_text": "The base or floor of any Aboriginal design or painting is the preparation of the earth, or the ancestor being's involvement with the earth. Amongst the artists of the Central and Western Desert art movement of the last 30 years, Johnny Warangkula was the first to use dotting as the background for his paintings. Some of the symbols used are: Symbols used in Papunya Central Desert art-Based on information from Papunya Tula by Geoffrey Bardon. While the most commonly used symbols are relatively simple, they can be used in elaborate combinations to tell more complex stories."}, {"url": "http://www.symbols.com/native/", "passage_text": "Turtle Symbol. The turtle is a sacred figure in Native American symbolism as it represents Mother Earth. The meaning of the Turtle symbol signifies good health and long life. "}, {"url": "http://www.universeofsymbolism.com/turtle-symbolism.html", "passage_text": "Symbolic Meaning of Turtle ... Sea Turtle is a very ancient soul living in the seas, land turtles make their home the deserts and the forests. Turtle spirit animal gracefully teaches us the art of adapting to new surroundings and environments. Turtle Symbolism... by Presley Love The mystical messages and symbols of the ancient and legendary Turtle totem animal... gifts of finding inner wisdom, the magic of intuition, symbolic meaning of vast journeys and the gift of long life."}, {"url": "https://simple.wikipedia.org/wiki/Aboriginal_art", "passage_text": "Symbols are used in aboriginal art, to show different things. While the meaning of these symbols are often shared, they can change meaning within the same piece, and they can be different between different groups. Aboriginal art is a language in itself, communicating through beautiful patterns. Aboriginal art is art made by indigenous Australian people. It includes work made in many different ways including painting on leaves, wood carving, rock carving, sculpting, ceremonial clothing and sand painting."}, {"url": "http://www.aboriginalartstore.com.au/aboriginal-art-culture/aboriginal-symbols-glossary/aboriginal-symbols-and-their-meanings/", "passage_text": "Aboriginal symbols are an essential part of a long artistic tradition in Australian Aboriginal Art and remain the visual form to retain and record significant information. Contemporary Australian Aboriginal paintings from the Central and Western Desert art regions in Central Australia are rich in aboriginal symbols. Generally the symbols used by Aboriginal Artists are a variation of lines, circles or dots."}, {"url": "https://www.aboriginalartonline.com/culture/symbols.php", "passage_text": "Dots are one of the conventional symbols widely used and for many non-Aboriginal people these are what give Central and Western Desert art its distinctive character. Dots may represent many things-including stars, sparks or burnt ground. Some of the symbols used are: Symbols used in Papunya Central Desert art-Based on information from Papunya Tula by Geoffrey Bardon. While the most commonly used symbols are relatively simple, they can be used in elaborate combinations to tell more complex stories."}, {"url": "https://www.aboriginalartonline.com/culture/symbols.php", "passage_text": "Aboriginal Art and use of Symbols. Traditional symbols are an essential part of much contemporary Aboriginal art. Our online galleries offer a wide range of art works using traditional and contemporary imagery and symbols. Aboriginal peoples have long artistic traditions within which they use conventional designs and symbols. Some of the symbols used are: Symbols used in Papunya Central Desert art-Based on information from Papunya Tula by Geoffrey Bardon. While the most commonly used symbols are relatively simple, they can be used in elaborate combinations to tell more complex stories."}, {"url": "http://www.turtletanks.org/native-american-turtle.html", "passage_text": "It’s been embedded in several stories and among several tribes. The Native American turtle and its various meanings are still very much alive today, especially in art. The Native American turtle has a lot of meanings. The turtle, a water animal, is a symbol for strength, fertility and perseverance. It was considered a power fetish animal. The Native American turtle was a symbol of truth as well. It is believed that knowing the truth means understanding and staying loyal to all the fundamental laws of the Creator. It is believed that the Grandmother Turtle was present when the Creator gave man the 7 sacred laws."}]