[{"url": "http://www.raising-rabbits.com/feeding-baby-rabbits.html", "passage_text": "Feeding Baby Rabbits. Feeding baby rabbits falls mostly to the mother rabbit for the first 3 weeks of the bunny’s life. Between 3 weeks and around 6 weeks old, the baby rabbits need less and less of mom, and more and more pellets and hay"}, {"url": "https://answers.yahoo.com/question/index?qid=20060819175456AAunSI7", "passage_text": "Report Abuse. Kitten milk replacer is what is recommended for baby bunnies. You can put it in a small bottle for it. Both the milk and the bottle can be found at most pet stores and vet offices. "}, {"url": "https://answers.yahoo.com/question/index?qid=20080621105952AA5VfEg", "passage_text": "Best Answer: No... no puppy formula for rabbits, and no cow's milk either. If you don't have kitten milk replacer try goat's milk. At two weeks you can begin introducing normal foods as well (hay, pellets, fresh greens & veggies). http://www.rabbit.org/faq/sections/orpha"}, {"url": "http://www.answers.com/Q/What_milk_supplement_for_baby_rabbit", "passage_text": "Cow milk and baby formula are not safe for baby bunnies. Some people recommend goat milk if … KMR isn't available. Caring for a baby bunny orphans can be very, very tricky, and it's best done by a professional or someone with a lot of experience. If a baby rabbit has been orphaned and needs to be hand-raised, you can use KMR (Kitten Milk Replacer) if the rabbit is domestic, or goat's milk if the rabbit is wild. But it's very difficult to hand-raise rabbits, and if you aren't experienced doing this the rabbit has a very low chance of survival."}, {"url": "http://www.ehow.com/how_5717316_feed-wild-baby-bunnies-milk.html", "passage_text": "Prepare a baby rabbit formula. Kitten Milk Replacer (KMR) can be bought at pet stores and is appropriate for use on baby rabbits as long as it is mixed with 1 tbsp of heavy cream. Mixing a pinch of acidophilus (found at vitamin stores) will also help with their chance of survival. It is imperative that you only feed the rabbits once or twice per day. Overfeeding is the leading cause of baby rabbit death by humans. In one day, a newborn rabbit should only get 5 ml, a 1 week old should get 10 to 15 ml, a 2 week old should get 16 to 26 ml, and a 3 week old should get 27 to 30 ml."}, {"url": "http://www.mybunny.org/info/caring-for-newborn-baby-rabbits/", "passage_text": "WHAT TO FEED THE BABIES. Baby rabbits should be fed Kitten Milk Replacer (KMR) or goat milk, which you can buy at pet stores, or sometimes even a local veterinarian’s office. Because rabbit milk is the most caloric of all mammals, we add in one tablespoon of 100% heavy whipping cream (no sugar) to each can of KMR"}, {"url": "http://www.petrabbitinfo.com/babyrabbits.html", "passage_text": "Never give a rabbit cow’s milk. If the baby is old enough, 3 weeks old, then water and timothy and alfalfa hays are best. No carrots or fruits until they are older. The best baby formula is 75% Zoologic Milk Matrix 30-55, 25% Zoologic Milk Matrix 42-25 or a good alternative is Esbilac Goat’s milk formula. Baby Rabbits-. If your rabbit has babies (kits), the first thing you should do is to remove the male rabbit from the cage. The male rabbit may not hurt the baby rabbits, but he can and may impregnate the momma bunny and any female bunnies as soon as they mature."}]