[{"url": "http://www.vq-scan.com/", "passage_text": "Typically, the V/Q scan is done to test for the presence of blood clots or other abnormalities in ventilation and circulation in the lung area. It is also commonly used in the presentation of chronic obstructive pulmonary disease (COPD) or pneumonia. With the perfusion scan, the table is movable and is placed directly beneath the scanner. The scanner will take snapshots of the way blood flows through your lungs and find the radioactive particles. The ventilation scan tends to be described as the scarier of the two scans. This is for two reasons."}, {"url": "https://en.wikipedia.org/wiki/Ventilation/perfusion_scan", "passage_text": "From Wikipedia, the free encyclopedia. A ventilation/perfusion lung scan, also called a V/Q lung scan, is a type of medical imaging using scintigraphy and medical isotopes to evaluate the circulation of air and blood within a patient's lungs, in order to determine the ventilation/perfusion ratio. The ventilation and perfusion phases of a V/Q lung scan are performed together and may include a chest x-ray for comparison or to look for other causes of lung disease. A defect in the perfusion images requires a mismatched ventilation defect to indicate pulmonary embolism."}, {"url": "http://www.vq-scan.com/", "passage_text": "Ventilation / perfusion lung scan. Ventilation/perfusion lung scans, also known as a V/Q scan, is used to examine the circulation of air and blood within a patient’s lungs. With the perfusion scan, the table is movable and is placed directly beneath the scanner. The scanner will take snapshots of the way blood flows through your lungs and find the radioactive particles. The ventilation scan tends to be described as the scarier of the two scans. This is for two reasons."}, {"url": "http://www.vq-scan.com/", "passage_text": "The scan requires the use of two nuclear tests. This means that two medical isotopes are used to detect the flow of breathing (ventilation) and blood circulation (perfusion) in the lungs. With the perfusion scan, the table is movable and is placed directly beneath the scanner. The scanner will take snapshots of the way blood flows through your lungs and find the radioactive particles. The ventilation scan tends to be described as the scarier of the two scans. This is for two reasons."}, {"url": "http://www.insideradiology.com.au/pages/view.php?T_id=65", "passage_text": "A ventilation–perfusion (VQ) scan is a nuclear medicine scan that uses radioactive material (radiopharmaceutical) to examine airflow (ventilation) and blood flow (perfusion) in the lungs. The aim of the scan is to look for evidence of any blood clot in the lungs, called pulmonary embolism (PE). A VQ scan is carried out in two parts. In the first part, radioactive material is breathed in and pictures or images are taken to look at the airflow"}, {"url": "http://www.insideradiology.com.au/pages/view.php?T_id=65&ref_info", "passage_text": "14. A ventilation–perfusion (VQ) scan evaluates the airflow (ventilation) and blood flow (perfusion) in the lungs. They are used in several clinical settings for: 1  the diagnosis of a suspected pulmonary embolus; and. 2  the assessment of regional lung function"}, {"url": "http://www.medic8.com/lung-disorders/ventilation-perfusion-scan.htm", "passage_text": "Lung Ventilation/Perfusion Scan. A lung ventilation/perfusion test, commonly referred to as a VQ test, is carried out to test the function of the lungs. The test measures the blood and airflow in the lungs and is most commonly used if a doctor suspects that a patient has suffered a pulmonary embolism. "}, {"url": "http://www.insideradiology.com.au/pages/view.php?T_id=65", "passage_text": "1. A ventilation–perfusion (VQ) scan is a nuclear medicine scan that uses radioactive material (radiopharmaceutical) to examine airflow (ventilation) and blood flow (perfusion) in the lungs. The aim of the scan is to look for evidence of any blood clot in the lungs, called pulmonary embolism (PE). A VQ scan is carried out in two parts. In the first part, radioactive material is breathed in and pictures or images are taken to look at the airflow in the lungs. In the second part, a different radioactive material is injected into a vein in the arm, and more images taken to see the blood flow"}, {"url": "http://www.nhlbi.nih.gov/health/health-topics/topics/lvq/", "passage_text": "A lung ventilation/perfusion scan, or VQ scan, is a test that measures air and blood flow in your lungs. A VQ scan most often is used to help diagnose or rule out a pulmonary embolism (PULL-mun-ary EM-bo-lizm), or PE. A VQ scan involves two types of scans: ventilation and perfusion. The ventilation scan shows where air flows in your lungs. The perfusion scan shows where blood flows in your lungs. Both scans use radioisotopes (a low-risk radioactive substance)."}]