[{"url": "http://www.bom.gov.au/tsunami/info/faq.shtml", "passage_text": "The name Tsunami, from the Japanese words tsu meaning harbour and nami meaning wave, is now used internationally to describe a series of waves travelling across the ocean. These waves have extremely long wavelengths, up to hundreds of kilometres between wave crests in the deep ocean."}, {"url": "http://www.redcross.org/prepare/disaster/tsunami", "passage_text": "Tsunamis are a series of large ocean waves generated by major earthquakes beneath the ocean floor or major landslides into the ocean. When the waves enter shallow water, they may rise to several feet or, in rare cases, tens of feet, striking the coast with devastating force."}, {"url": "http://environment.nationalgeographic.com/environment/natural-disasters/tsunami-profile/", "passage_text": "Tsunamis may also be caused by underwater landslides or volcanic eruptions. They may even be launched, as they frequently were in Earth’s ancient past, by the impact of a large meteorite plunging into an ocean. Tsunamis race across the sea at up to 500 miles (805 kilometers) an hour—about as fast as a jet airplane."}, {"url": "http://environment.nationalgeographic.com/environment/natural-disasters/tsunami-profile/", "passage_text": "A tsunami is a series of ocean waves that sends surges of water, sometimes reaching heights of over 100 feet (30.5 meters), onto land. These walls of water can cause widespread destruction when they crash ashore."}, {"url": "http://news.nationalgeographic.com/news/2007/04/070402-tsunami.html", "passage_text": "A tsunami is not a single wave but a series of waves, also known as a wave train. The first wave in a tsunami is not necessarily the most destructive. Tsunamis are not tidal waves.  Tsunami waves can be very long (as much as 60 miles, or 100 kilometers) and be as far as one hour apart."}, {"url": "http://oceanservice.noaa.gov/facts/tsunami.html", "passage_text": "Tsunamis are giant waves caused by earthquakes or volcanic eruptions under the sea. Out in the depths of the ocean, tsunami waves do not dramatically increase in height. But as the waves travel inland, they build up to higher and higher heights as the depth of the ocean decreases."}, {"url": "http://news.nationalgeographic.com/news/2007/04/070402-tsunami.html", "passage_text": "A tsunami is a series of great sea waves caused by an underwater earthquake, landslide, or volcanic eruption. More rarely, a tsunami can be generated by a giant meteor impact with the ocean."}, {"url": "http://oceanservice.noaa.gov/facts/tsunami.html", "passage_text": "A tsunami is a series of waves caused by earthquakes or undersea volcanic eruptions. On Nov. 18, 1929, a magnitude 7.4 Mw earthquake occurred. south of Newfoundland along the southern edge of the Grand Banks, Canada. This illustration, called a Tsunami Time Travel Map, shows the arrival times of tsunami waves."}, {"url": "http://www.ga.gov.au/scientific-topics/hazards/tsunami/basics/causes", "passage_text": "Tsunami are waves caused by sudden movement of the ocean due to earthquakes, landslides on the sea floor, land slumping into the ocean, large volcanic eruptions or meteorite impact in the ocean."}]