[{"url": "http://www.5icall.net/2012/04/09/skype-calls-cost/", "passage_text": "They only vary depending on where you are calling to. The person you call does not get charged any fees by Skype. However, in some countries (for example, the US) people pay for both incoming and outgoing calls on their mobile phones. How much does Skype calls cost. Posted on April 9, 2012 by Freecall — No Comments ↓. The price of a call varies depending on where you want to call, and whether you choose to pay as you go using Skype Credit, or buy a calling subscription. You can check the pay as you go call rates on the rates page of our website"}, {"url": "http://www.voipsupply.com/how-much-does-skype-cost", "passage_text": "Knowing what your costs are before signing on to use any services is a great idea. This is especially true with Skype as there a lot of misconceptions that exist about how much Skype costs. That’s because Skype is not your traditional voice service. 1 There are generally (2) plans available for Skype for Business: $2/mo. per user with an annual committment, or $5.50/mo. per user with an annual committment. 2  Additional licenses may be required in order to access all of the features of Skype for Business."}, {"url": "http://www.answers.com/Q/How_much_does_Skype_cost", "passage_text": "The average price of a Skype cam is $132 to $170. However, if you are willing to buy an off-brand cam the prices are much cheaper and ultimately range from $10 to $200 dollars … (and may still include an attached microphone). 4 people found this useful. "}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20080212232117AAq1aoK", "passage_text": "It is also free if you are calling from Skype user to Skype user (Computer to Computer over the internet). The only time you have to pay money is if you want to call a land line or a cellphone (a fixed line). Then you just buy some credits and use them up as you make your calls. "}, {"url": "http://www.voipsupply.com/how-much-does-skype-cost", "passage_text": "Through Skype you can purchase a number of low cost calling plans to make calls within certain geographies or worldwide. For example Skype offers an unlimited monthly calling plan (including a Skype number) to US and Canada for just $2.95 per month. This makes Skype affordable for just about anyone. 1 There are generally (2) plans available for Skype for Business: $2/mo. per user with an annual committment, or $5.50/mo. per user with an annual committment. 2  Additional licenses may be required in order to access all of the features of Skype for Business."}, {"url": "https://www.quora.com/How-much-data-does-Skype-use-per-minute", "passage_text": "1 Skype-to-Skype: 50kbps or around 3MB for one minute of calling. 2  Calls to landlines or mobile numbers: 6-20 kbps or around 1MB for one minute of calling. 3  Video calls between two mobile devices: 500kbps. 4  Video calls between a mobile device and a computer: 600kbps. Here are examples of some typical Skype data usage: https://support.skype.com /en-us/... 1 "}, {"url": "http://smallbusiness.chron.com/charged-making-calls-skype-64787.html", "passage_text": "You must have Skype credit on your account to call a cell phone. It costs 2.3 cents per minute to make a phone call to anywhere in the continental United States or Hawaii, in addition to a 4.9 cent connection fee. Alaska costs more at 6 cents per minute plus the connection fee. International costs for calls and text messages vary by country. For example, calls to Ukraine cost 13.7 cents per minute, while text messages are 6.6 cents per message."}, {"url": "https://support.skype.com/en/faq/FA1214/how-much-does-it-cost-to-call-mobiles-and-landlines-from-skype", "passage_text": "The call rate is also displayed in the call window once the other person picks up the call: Remember, our call rates are the same no matter where you are calling from. They only vary depending on where you are calling to. The person you call does not get charged any fees by Skype. However, in some countries (for example, the US) people pay for both incoming and outgoing calls on their mobile phones. You can check the pay as you go call rates on the rates page of our website. Just type the country you want to call into the search box, or if you want to see rates to all countries, click See all rates. You can also check the rate per minute before you make a call from Skype. Just click the Call phones tab to open it, and click on the flag icon and select the country you want to call from the drop-down list"}]