[{"url": "http://babynamescountry.com/meanings/Aphrodite.html", "passage_text": "Meaning: The Greek name Aphrodite means-Derived from the Greek word aphroa, which means foam.. In mythology, the goddess of love and beauty. Rating: Add This Name to my Favorite List. "}, {"url": "http://www.sheknows.com/baby-names/name/aphrodite", "passage_text": "Greek Meaning: The name Aphrodite is a Greek baby name. In Greek the meaning of the name Aphrodite is: Goddess of love. SoulUrge Number: 3. Expression Number: 6. People with this name have a deep inner desire to create and express themselves, often in public speaking, acting, writing or singing."}, {"url": "http://www.behindthename.com/name/aphrodite", "passage_text": "Meaning unknown, possibly of Phoenician origin. Aphrodite was the Greek goddess of love, equal to the Roman goddess Venus. She was the wife of Hephaestus and the mother of Eros, and she was often associated with the myrtle tree and doves. The Greeks connected her name with αφρος (aphros) foam, resulting in the story that she was born from the foam of the sea."}, {"url": "http://www.ancient-origins.net/myths-legends/intriguing-origins-aphrodite-002170", "passage_text": "Aphrodite is the Greek goddess of love, sex, and beauty. In one of the most famous images of the goddess, we see her emerge from the sea, a reference to her origin story. In this older of the two stories of Aphrodite’s birth, she emerges from the sea a grown woman. This story was handed down to us by Hesiod, one of the earliest Greek poets. He explains that Aphrodite’s name comes from the Greek word aphros, meaning “foam,” which could refer to the sea foam or to Uranos’ semen. This myth is etiological, with Aphrodite’s birth from foam explaining the origin of her name."}, {"url": "https://en.wikipedia.org/wiki/Aphrodite", "passage_text": "Aphrodite (/aefrəˈdaɪti/ æfrəˈdaɪti-af-Rə-dy; Tee: GREEK) ἀφροδίτη is The greek goddess of, love, beauty, pleasure and. Procreation Her roman equivalent is the Goddess. Venus she is identified with the Planet. venus Aphrodite (/aefrəˈdaɪti/ æfrəˈdaɪti-af-Rə-dy; Tee: GREEK) ἀφροδίτη is The greek goddess of, love, beauty, pleasure and. Procreation Her roman equivalent is the Goddess. Venus she is identified with the Planet. Venus as with many Ancient greek, deities there is more than one story about her. origins"}, {"url": "http://www.thinkbabynames.com/meaning/0/Aphrodite", "passage_text": "Aphrodite /aph-rod-ite/ [4 sylls.] as a girls' name is of Greek origin, and the meaning of Aphrodite is foam. Name of the Greek goddess of love, known to the Romans as Venus. She was said to have been born on the sea foam. Related girl names: Cypris and Cytherea. Kreatif forms: Aphrodime, Aphrodine, Aphroditi. "}, {"url": "http://www.meaning-of-names.com/greek-names/aphrodite.asp", "passage_text": "Meaning of Aphrodite. Greek name. In Greek, the name Aphrodite means-goddess of love.The name Aphrodite originated as an Greek name. The name Aphrodite is most often used as a girl name or female name. Greek Name Meaning-goddess of love. Origin-Greece. Global Star Registery-Name a star after someone special! "}]