[{"url": "http://techalltop.blogspot.com/2014/05/internet-explorer-10-for-android-apk-free-download.html", "passage_text": "Internet Explorer 10 for Android is the most popular and most downloaded browser on Google play store. Internet Explorer 10 for Android works best on both 2G and 3G Connection. It is the best Lite web browser on Play store with Windows 8 tile icons system. Features."}, {"url": "http://techalltop.blogspot.com/2014/05/internet-explorer-10-for-android-apk-free-download.html", "passage_text": "Fazeel Baig applications for android. Internet Explorer 10 for Android is the most popular and most downloaded browser on Google play store. Internet Explorer 10 for Android works best on both 2G and 3G Connection. It is the best Lite web browser on Play store with Windows 8 tile icons system. Features."}, {"url": "http://features.en.softonic.com/whats-the-best-browser-for-android-phones", "passage_text": "Your Android's default browser is fine, but if it's your only option, you could be missing out. Granted, it's fast and functional, but it's not the easiest way to look at the web on your phone, and it lacks the features of some of the other browsers that are available."}, {"url": "http://forums.androidcentral.com/general-help-how/135641-internet-explorer-android.html", "passage_text": "Re: Internet Explorer for Android. JB58, you can tether a Windows computer to the phone (USB, Bluetooth or wifi) and use IE on the computer."}, {"url": "http://answers.microsoft.com/en-us/ie/forum/ie8-windows_other/can-i-run-internet-explorer-on-an-android-tablet/05abfa4c-056c-4633-8ae1-6cfb8bb8fd75", "passage_text": "CD. Hi, Internet Explorer cannot be installed on Android tablet. You may use the browser pre-installed with the tablet to access internet. You may check the Android market website for available browsers. https://market.android.com/ There are some learning sites which are written to only work with Internet Explorer, which people are trying to learn from on non-Windows devices."}]