[{"url": "http://www.healthaliciousness.com/articles/pizza-lowest-calories-cholesterol.php", "passage_text": "Pizza calories range from 123 to 368 calories per slice, and 3-11% of the daily value(DV) of cholesterol per slice. If you are trying to decide what kind of pizza to get then good rules are to choose thin crust over thick crust, vegetable toppings over meat toppings, and hold the extra cheese."}, {"url": "http://www.livestrong.com/article/360764-the-nutrition-in-a-thin-crust-cheese-pizza/", "passage_text": "Pizza is among the top sources of calories in the typical American diet. A slice of thin crust cheese pizza, or one-eighth of a 14-inch pizza, contains 230 calories and 24 grams of carbohydrates. A slice of thin crust pepperoni pizza has 261 calories and 23 grams of carbohydrates. For comparison, a slice of cheese pizza with regular crust has 285 calories and 36"}, {"url": "http://www.healthfitnessexperts.com/calories-in-pizza/", "passage_text": "An average slice of thin crust cheese pizza is about 217 calories, while an average slice of regular cheese pizza is about 278 calories — that’s 28 percent more calories. So thin crust is usually your best bet if you are counting calories."}, {"url": "http://www.howmanyarethere.us/how-many-calories-in-a-slice-of-pizza/", "passage_text": "Avoid deep dish pizzas and pizzas that have a large dough. 1 slice of a 12 inch pizza. 1 slice = 1/8 of a pizza (regular or original crust). 1  On average, a slice of cheese pizza has about 200 calories. 2  On average, a slice of pepperoni pizza has about 21"}, {"url": "http://www.livestrong.com/article/360764-the-nutrition-in-a-thin-crust-cheese-pizza/", "passage_text": "Calories and Carbohydrates. Pizza is among the top sources of calories in the typical American diet. A slice of thin crust cheese pizza, or one-eighth of a 14-inch pizza, contains 230 calories and 24 grams of carbohydrates. A slice of thin crust pepperoni pizza has 261 calories and 23 grams of carbohydrates. For comparison, a slice of cheese pizza with regular crust has 285 calories and 36"}]