[{"url": "http://www.bls.gov/bls/blswage.htm", "passage_text": "Wage Data by Metropolitan Area. 1  For pay-setting purposes. 2  Data include information on the level of difficulty and complexity of work. 3  For 375 metropolitan statistical areas (MSAs), 34 metropolitan divisions, and over 170 nonmetropolitan areas. Wage Data by Metropolitan Area. 1  For pay-setting purposes. 2  For 375 metropolitan statistical areas (MSAs), 34 metropolitan divisions, and over 170 nonmetropolitan areas. 3  For major "}, {"url": "http://www1.salary.com/ND/Bismarck/Licensed-Practical-Nurse-salary.html", "passage_text": "This chart describes the expected percentage of people who perform the job of Licensed Practical Nurse in Bismarck, ND that make less than that salary. For example 50% of the people who perform the job of Licensed Practical Nurse in Bismarck are expected to make less than the median. The salary for someone with the job title Licensed Practical Nurse in Bismarck, ND varies depending on a number of factors."}, {"url": "http://www.englishforum.ch/employment/203225-bank-international-settlements-bis-salary.html", "passage_text": "Re: Bank for International Settlements BIS-Salary. BIS is indeed a good earner and you do somehow avoid tax AFAIK. Either the role or the tax exemption lasts for one or two years though.... Re: Bank for International Settlements BIS-Salary. It's tax free because it's not 'in' Switzerland. The buildings are, technically, in foreign territory. As a consequence I've heard that some people face even more complicated issues about what permit is granted. It's also run by the most evil people on the planet.."}, {"url": "http://www1.salary.com/Business-Intelligence-Specialist-salary.html", "passage_text": "This chart describes the expected percentage of people who perform the job of Business Intelligence Specialist that make less than that salary. For example 50% of the people who perform the job of Business Intelligence Specialist are expected to make less than the median. Source: HR Reported data as of October 2015. The annual salary for someone with the job title Business Intelligence Specialist may vary depending on a number of factors including industry, company size, location, years of experience and level of education."}, {"url": "http://www.bis.org/careers/", "passage_text": "Supporting global monetary & financial stability. Join us at the Bank for International Settlements. The Bank for International Settlements is an international organisation which fosters international monetary and financial cooperation via wide-ranging banking, economic research and policy coordination activities. Whether you join our 600-strong team as a banker, economist, a member of our General Secretariat or in Risk Control, Internal Audit, Compliance, Operational Risk or the Legal Service, you will work alongside colleagues from 50 countries and play a valuable part in supporting the global financial system."}, {"url": "http://www.englishforum.ch/employment/203225-bank-international-settlements-bis-salary.html", "passage_text": "Bank for International Settlements BIS-Salary. Hello Good People of english forum. I am in a bit of a bind and need some advice. The issue is I have the opportunity to work at the bank for international settlements as a senior policy analyst. The problem is I have no idea about Basel nor salary expectations. Re: Bank for International Settlements BIS-Salary. It's tax free because it's not 'in' Switzerland. The buildings are, technically, in foreign territory. As a consequence I've heard that some people face even more complicated issues about what permit is granted. It's also run by the most evil people on the planet.."}, {"url": "http://www.bls.gov/oes/current/oes_nat.htm", "passage_text": "(4) Wages for some occupations that do not generally work year-round, full time, are reported either as hourly wages or annual salaries depending on how they are typically paid. (5) This wage is equal to or greater than $90.00 per hour or $187,199 per year. May 2014 National Occupational Employment and Wage Estimates. $19.67. (2) Annual wages have been calculated by multiplying the hourly mean wage by a year-round, full-time hours figure of 2,080 hours; for those occupations where there is not an hourly mean wage published, the annual wage has been directly calculated from the reported survey data."}, {"url": "http://www.englishforum.ch/employment/203225-bank-international-settlements-bis-salary.html", "passage_text": "Thanked 40 Times in 32 Posts. Re: Bank for International Settlements BIS-Salary. You'll have access to this incredible restaurant for employees only-- we were brought there by friends who worked there-- can't remember the name but the good is fantastic and better prices than restaurants in the city. Re: Bank for International Settlements BIS-Salary. It's tax free because it's not 'in' Switzerland. The buildings are, technically, in foreign territory. As a consequence I've heard that some people face even more complicated issues about what permit is granted. It's also run by the most evil people on the planet.."}, {"url": "http://www1.salary.com/Business-Intelligence-Specialist-salary.html", "passage_text": "For example the median expected annual pay for a typical Business Intelligence Specialist in the United States is $105,552, so 50% of the people who perform the job of Business Intelligence Specialist in the United States are expected to make less than $105,552. Source: HR Reported data as of October 2015. The annual salary for someone with the job title Business Intelligence Specialist may vary depending on a number of factors including industry, company size, location, years of experience and level of education."}]