[{"url": "http://learn.org/articles/Special_Effects_Technician_Salary_and_Career_FAQs.html", "passage_text": "Special Effects Technician: Career and Salary Facts. Research what it takes to become a special effects technician. Learn about job duties, training and salary potential to find out if this is the career for you. Schools offering Animation degrees can also be found in these popular choices. "}, {"url": "http://work.chron.com/salary-special-effects-technician-make-22822.html", "passage_text": "In 2013, high and low salaries for special effects technicians varied between $15,000 and $19,000 in all U.S. regions. In the West region, they earned the highest salaries of $52,000 in California and the lowest of $33,000 in Hawaii, according to Indeed. A special effects technician earning $50,000 in Columbus, Ohio would need to earn $73,532 in Los Angeles to maintain the same living standards. The same technician would need to make $121,151 in Manhattan."}, {"url": "http://work.chron.com/salary-special-effects-technician-make-22822.html", "passage_text": "For example, multimedia artists and animators, who may work with special effects technicians, earned the highest salaries of $84,410 in the motion picture industry in 2012, according to the BLS. This bests the industry average of $69,560 by almost $15,000. A special effects technician earning $50,000 in Columbus, Ohio would need to earn $73,532 in Los Angeles to maintain the same living standards. The same technician would need to make $121,151 in Manhattan."}, {"url": "http://www.academicinvest.com/arts-careers/fine-arts-careers/how-to-become-a-special-effects-technician", "passage_text": "A special effects technician who works on a high budget feature film may earn substantially more than a special effects technician who is working as an assistant on a television program. The following salary includes 'special effects technicians' as part of the larger employment group 'multimedia artists and animators'. 1  Multi-media artists and animators earned an average of $58,510 per year in the United States in 2010. The level of formal education required to become a special effects technician varies from employer to employer, and client to client. While formal education is not typically necessary to break into the industry, a specific set of skills related to the desired area of specialty within special effects is a requirement."}, {"url": "http://study.com/articles/Salary_and_Career_Info_for_a_Visual_Effects_Technician.html", "passage_text": "The U.S. Bureau of Labor Statistics (BLS) places visual effects technicians under the category of multimedia artists (www.bls.gov). According to the BLS, multimedia artists and animators earned an annual median salary of $64,470 in May 2013. Most visual effects technicians work in the motion picture and video industry. Multimedia artists in this industry earned an annual average salary of $84,610 in May 2013, according to the BLS. Location significantly affects salary. For example, multimedia artists and animators working in California made an average annual salary of $88,150 in May 2013, compared to those working in New Mexico, who earned $70,310"}, {"url": "http://educhoices.org/articles/Special_Effects_Technician_Average_Salary_of_a_Special_Effects_Technician.html", "passage_text": "Special Effects Technician: Average Salary of a Special Effects Technician. Published Sep 17, 2009. Special effects can be an exciting, and sometimes dangerous, career. While earning potential and career mobility may not be great, special effect technicians have an exciting and creative job. Read on to find out more information about special effect technician careers, job outlook and average salaries."}, {"url": "http://www.indeed.com/salary/q-Special-Effects-Technician-l-Los-Angeles,-CA.html", "passage_text": "Average Special Effects Technician salaries for job postings in Los Angeles, CA are 7% higher than average Special Effects Technician salaries for job postings nationwide. "}, {"url": "http://work.chron.com/salary-special-effects-technician-make-22822.html", "passage_text": "The U.S. Bureau of Labor Statistics reported an average annual salary of $69,560 for multimedia artists and animators as of May 2012, who perform similar duties to special effects technicians. But special effects technicians overall earned average salaries of $48,000 annually in 2013, according to the job site Indeed. A special effects technician earning $50,000 in Columbus, Ohio would need to earn $73,532 in Los Angeles to maintain the same living standards. The same technician would need to make $121,151 in Manhattan."}, {"url": "http://study.com/articles/Special_Effects_Technician_Occupational_Outlook_and_Career_Summary.html", "passage_text": "Wages for special effects technicians vary depending on job title and experience. In 2013, multimedia artists and animators earned a mean annual salary of $72,400, followed by theatrical and performance makeup artists with a mean income of $66,330 and sound engineering technicians at $56,610, according to BLS figures. Learn about the education and preparation needed to become a special effects technician. Get a quick view of the job duties as well as details about career outlook to find out if this is the career for you."}]