[{"url": "http://www.improvenet.com/r/costs-and-prices/fireplace-repairs", "passage_text": "The Average Fireplace Repair Cost. The average cost of a fireplace is $934. The final project cost will depend on the extent of the damage to the fireplace and chimney as well as whether or not there was a fire that spread into the adjacent walls."}, {"url": "http://askthechimneysweep.com/2010/07/chimney-liner-installation-cost/", "passage_text": "Chimney liner cost can be surprising. There are a variety of factors that play into how much a chimney reline with installation costs, including your area of the country, but on average the cost to have your chimney professionally relined runs anywhere from $2,500 to $5,000."}, {"url": "http://www.homeadvisor.com/cost/heating-and-cooling/repair-a-fireplace-or-woodstove/", "passage_text": "The average national cost of woodstove and fireplace repair is $432, with most homeowners spending between $167 and $739. This data is based on actual project costs as reported by HomeAdvisor members. Many people are choosing to heat their homes with wood, due to the increase in cost of natural gas and oil."}, {"url": "http://www.justinspectchimney.com/justinspect_flue.html", "passage_text": "Cost of Repair. The cost to re-line a chimney can be very expensive! Repair costs generally range from about $2000.00 to $4500.00 per flue or more! In a Real Estate transaction, you may have the opportunity to negotiate defects that are disclosed as part of the inspection process. Consultation with your Attorney is advised to discuss all details."}, {"url": "http://www.howmuchisit.org/chimney-repair-cost/", "passage_text": "1 The cost of chimney repair will really depend on the type of repair required. 2  For instance, a cracked chimney usually costs around $1,000 to repair since it will have to be rebuilt. 3  The issue becomes worse if the cracks are left untreated."}, {"url": "http://www.familyhandyman.com/masonry/chimney-maintenance/view-all", "passage_text": "A cracked chimney crown or spalling bricks can easily cost $1,000 to repair. And, if left untreated, the damage can accelerate quickly, and cost you upward of $3,000. It doesn't have to be that way. By simply sealing the bricks and the crown and adding a chimney cap, you'll greatly extend your chimney's life."}]