[{"url": "https://www.health.ny.gov/diseases/conditions/diabetes/diagnosing_diabetes.htm", "passage_text": "1 A fasting blood glucose level of 126 mg/dl or higher means a person has diabetes. 2  With the OGTT test, a person's blood glucose level is measured after fasting and then 2 hours after drinking a glucose-rich beverage. 3  If the 2-hour blood glucose level is between 140 and 199 mg/dl, the person has pre-diabetes."}, {"url": "http://www.health.harvard.edu/heart-health/tests-your-doctor-may-order-to-determine-whether-you-have-heart-disease", "passage_text": "These noninvasive tests also help assess the risk of heart attack. Positive results may require further testing or an invasive procedure. If you are at high risk for heart disease or have a symptom such as shortness of breath or discomfort in your chest, your doctor may order certain heart tests. But there's more to testing than simply finding out if you have heart disease."}, {"url": "http://www.livestrong.com/article/332633-the-advantages-of-a-healthy-body-composition/", "passage_text": "An unhealthy body composition -- caused by excessively high or low body fat -- dramatically increases your risk for weight-related health issues such as diabetes and heart disease, as stated by the American Council on Exercise."}, {"url": "http://www.nhlbi.nih.gov/health/health-topics/topics/obe/diagnosis", "passage_text": "The most common way to find out whether you're overweight or obese is to figure out your body mass index (BMI). BMI is an estimate of body fat, and it's a good gauge of your risk for diseases that occur with more body fat. BMI is calculated from your height and weight."}, {"url": "http://www.livestrong.com/article/332633-the-advantages-of-a-healthy-body-composition/", "passage_text": "Body composition standards vary among individuals. According to Heyward, the average body fat percentage for an 18- to 35-year-old man equals 13 percent, while the average for a woman of the same age is 28 percent."}, {"url": "https://www.health.ny.gov/diseases/conditions/diabetes/diagnosing_diabetes.htm", "passage_text": "1 With the OGTT test, a person's blood glucose level is measured after fasting and then 2 hours after drinking a glucose-rich beverage. 2  If the 2-hour blood glucose level is between 140 and 199 mg/dl, the person has pre-diabetes. 3  If the 2-hour blood glucose level is at 200 mg/dl or higher, the person has diabetes."}, {"url": "http://www.livestrong.com/article/332633-the-advantages-of-a-healthy-body-composition/", "passage_text": "Lean mass is superior to fat mass and should be maintained through healthy food choices and regular exercise. You can improve body composition losing fat, increasing lean muscle or a combination of both. For example, weight training adds both muscle mass and bone density."}]