[{"url": "http://www.answers.com/Q/Who_founded_Walmart", "passage_text": "Sam Walton went into the retail business in 1945, and by the time Wal-Mart first opened in 1962 he owned a chain of 15 variety stores in Arkansas, Missouri and Oklahoma. Walton's savvy marketing skills and attention to detail led to Wal-Mart's expansion throughout the United States."}, {"url": "http://www.answers.com/Q/Where_was_walmart_founded", "passage_text": "Sam Walton w … ent into the retail business in 1945, and by the time Wal-Mart first opened in 1962 he owned a chain of 15 variety stores in Arkansas, Missouri and Oklahoma. Walton's savvy marketing skills and attention to detail led to Wal-Mart's expansion throughout the United States."}, {"url": "http://www.answers.com/Q/Who_founded_Walmart", "passage_text": "By 2001 there were more than 4,500 Wal-Mart stores worldwide. The founder of Wal-Mart is Sam Walton. Sam Walton, with his brother Bud Walton, founded Wal-Mart, the chain of discount variety stores that in the 1990s became the world's largest retailer."}, {"url": "https://en.wikipedia.org/wiki/Wal-Mart", "passage_text": "Walmart /ˈwɔːlmɑrt/ , is an American multinational retail corporation that operates a chain of discount department stores and warehouse stores. Headquartered in Bentonville, Arkansas, United States, the company was founded by Sam Walton in 1962 and incorporated on October 31, 1969. It has over 11,000 stores in 28 countries, under a total of 65 banners. The company operates under the Walmart name in the United States and Canada."}, {"url": "http://www.answers.com/Q/Where_was_walmart_founded", "passage_text": "Sam Walton went into the retail business in 1945, and by the time Wal-Mart first opened in 1962 he owned a chain of 15 variety stores in Arkansas, Missouri and Oklahoma. Walton's savvy marketing skills and attention to detail led to Wal-Mart's expansion throughout the United States."}, {"url": "http://corporateofficehq.com/walmart-corporate-office/", "passage_text": "WalMart History. Wal-Mart Stores Inc., usually just called WalMart, was founded by Sam Walton in 1962. Walton opened a WalMart Discount City store in Rogers, Arkansas. By 1967, the chain had 24 locations across Arkansas. In 1968, stores were opened in Missouri and Oklahoma."}]