[{"url": "http://www.ancient.eu/Seleucid_Empire/", "passage_text": "The Seleucid Empire was the Persian kingdom of the Macedonian dynasty of the Seleucids, whose rule began with the collapse of Alexander 's empire and faded away between Roman and Parthian growth of power in the 1st century BCE. Antiochos III's death marked the end of the Seleucid Empire as a great power. The kingdom fell once more into dynastic struggles, and the eastern provinces were gradually lost due to rebellions and Parthian expansion."}, {"url": "http://totalwar.wikia.com/wiki/Seleucid_Empire", "passage_text": "The Seleucid Empire's main ambition was to preserve the original territory conquered by Alexander the Great during his lifetime. The emblem of the Seleucid Empire as seen in Rome: Total War. The Seleucid Empire are one of the playable factions in Rome: Total War. They can be played by successfully completing either a long or short campaign with any of the Roman factions, by destroying them in the Imperial Campaign"}, {"url": "http://www.iranicaonline.org/articles/seleucid-empire", "passage_text": "The Seleucid state grew from the Babylonian satrapy given to Seleucus after the death of Alexander the Great in 323 BCE. Babylonia, where Seleucus founded Seleucia on the Tigris as one of his capitals, remained a core region of the empire until the Parthians (see ARSACIDS) finally drove out the Seleucids around 141. From the reign of Antiochus I onwards, the history of the Seleucid dynasty was dominated by a relentless enmity with the Ptolemies, the family who controlled Egypt and maintained a naval empire in the eastern Mediterranean and the Red Sea."}, {"url": "http://www.mapsofworld.com/world-ancient-history/seleucid-empire-map.html", "passage_text": "In 301 BC, he conquered Syria, followed by Anatolia in 281 BC. The Seleucid Empire was essentially Greek-Macedonian, and Seleucus conquests did much to spread Hellenistic culture across Europe, Asia Minor, and in parts of Asia. In 281 BC, Seleucus I was murdered, and his son, Antiochus I, succeeded him. Seleucid Empire Map. The Seleucid Empire, established in around 312 BC, was a Greek empire founded by Seleucus I. Seleucus I was a Greek general who fought with Alexander in his conquests. After Alexander's death in 323 BC, Seleucus I became the vassal satrap of Babylon"}, {"url": "http://totalwar.wikia.com/wiki/Seleucid_Empire", "passage_text": "The Seleucid Empire was a Hellenistic empire, one of the surviving portions of Alexander the Great's original empire. When Alexander's empire was divided among his greatest generals, Seleucus took the eastern Fertile Crescent and captured Syria soon after, founding the new Seleucid Empire. The emblem of the Seleucid Empire as seen in Rome: Total War. The Seleucid Empire are one of the playable factions"}, {"url": "http://www.iranicaonline.org/articles/seleucid-empire", "passage_text": "SELEUCID EMPIRE, founded in 312/311 BCE by Seleucus I Nicator, formerly a general in the army of Alexander the Great. Adopting the titles “King of Asia” and “Great King,” the Macedonian rulers of the Seleucid dynasty laid claim to the territory of the former Achaemenid empire during the Hellenistic period. From the reign of Antiochus I onwards, the history of the Seleucid dynasty was dominated by a relentless enmity with the Ptolemies, the family who controlled Egypt and maintained a naval empire in the eastern Mediterranean and the Red Sea."}, {"url": "http://www.newworldencyclopedia.org/entry/Seleucid_Empire", "passage_text": "Territories of the Seleucid Empire (in Blue). The Seleucid Empire (312 - 60. ) was a Hellenistic successor state of Alexander the Great 's dominion, which at its height included central Anatolia, the Levant, Mesopotamia, Persia, Turkmenistan, Pamir, and the Indus valley. "}, {"url": "http://www.ancient.eu/Seleucid_Empire/", "passage_text": "The Seleucid Empire began when Seleucos I, one of Alexander the Great 's former favorite companions, was given the satrapy of Babylon in the second division of the empire in 321 BCE. Antiochos III's death marked the end of the Seleucid Empire as a great power. The kingdom fell once more into dynastic struggles, and the eastern provinces were gradually lost due to rebellions and Parthian expansion."}, {"url": "https://en.wikipedia.org/wiki/Seleucid_Empire", "passage_text": "The Seleucid Empire was a major center of Hellenistic culture that maintained the preeminence of Greek customs where a Greek political elite dominated, mostly in the urban areas. The Greek population of the cities who formed the dominant elite were reinforced by immigration from Greece. The Seleucid Empire in 200 BC (before expansion into Anatolia and Greece). A revival would begin when Seleucus II's younger son, Antiochus III the Great, took the throne in 223 BC."}]