[{"url": "http://www.thefreedictionary.com/Transverse+wave", "passage_text": "A wave in which the particles of the wave's medium move at right angles to the direction of wave movement. For instance, in an ocean wave, the molecules of water move up and down as the wave passes on its way toward shore. See more at wave. Compare longitudinal wave. "}, {"url": "http://www.acs.psu.edu/drussell/Demos/waves/wavemotion.html", "passage_text": "Mechanical Waves are waves which propagate through a material medium (solid, liquid, or gas) at a wave speed which depends on the elastic and inertial properties of that medium. There are two basic types of wave motion for mechanical waves: longitudinal waves and transverse waves. "}, {"url": "https://en.wikipedia.org/wiki/Transverse_wave", "passage_text": "A light wave is an example of a transverse wave. Propagation of a transverse spherical wave in a 2d grid (empirical model). A transverse wave is a moving wave that consists of oscillations occurring perpendicular (or right angled) to the direction of energy transfer. If a transverse wave is moving in the positive x-direction, its oscillations are in up and down directions that lie in the y–z plane. Light is an example of a transverse wave. With regard to transverse waves in matter, the displacement of the medium is perpendicular to the direction of propagation of the wave. A ripple in a pond and a wave on a string are easily visualized as transverse waves"}, {"url": "http://hyperphysics.phy-astr.gsu.edu/hbase/Sound/tralon.html", "passage_text": "Transverse Waves. For transverse waves the displacement of the medium is perpendicular to the direction of propagation of the wave. A ripple on a pond and a wave on a string are easily visualized transverse w"}, {"url": "http://www.definitions.net/definition/transverse%20wave", "passage_text": "Transverse wave. A transverse wave is a moving wave that consists of oscillations occurring perpendicular to the direction of energy transfer. If a transverse wave is moving in the positive x-direction, its oscillations are in up and down directions that lie in the y–z plane. Light is an example of a transverse wave. For transverse waves in matter the displacement of the medium is perpendicular to the direction of propagation of the wave. A ripple in a pond and a wave on a string are easily visualized as transverse waves."}, {"url": "http://www.merriam-webster.com/dictionary/transverse%20wave", "passage_text": "Definition of TRANSVERSE WAVE. : a wave in which the vibrating element moves in a direction perpendicular to the direction of advance of the wave. See transverse wave defined for kids. ADVERTISEMENT"}, {"url": "http://study.com/academy/lesson/transverse-longitudinal-waves-definition-examples.html", "passage_text": "Transverse waves include waves on a string, electromagnetic waves, and seismic S waves. These are waves in which the particles in the medium move in a direction perpendicular to the path of the wave. Transverse waves travel well in solids, but not in fluids like liquid or gas. Longitudinal Waves. But not all waves are transverse waves. Sometimes, the wave medium oscillates parallel to the wave's direction. In these cases, the wave is called a longitudinal wave. Longitudinal waves are a bit challenging to imagine, so let's use a slinky for reference."}]