[{"url": "http://www.sparknotes.com/biology/microorganisms/protista/section2.rhtml", "passage_text": "page 1 of 2. Protozoa are the animal-like protists. These unicellular eukaryotes lack cell walls. They are heterotrophic and feed on other microorganisms or on organic particles. "}, {"url": "http://douglasdrenkow.com/theworldoflife/systematics/protists.htm", "passage_text": "Often bearing external filaments, the cells of some protists, such as certain amoebas, are shelled, often beautifully so. These shells sometimes cement living cells together as colonies, and the shells of dead protists often accumulate on the ocean floor as a thick ooze. Slime molds are essentially macroscopic amoebas. ENVIRONMENTS. Protists, in general, live in salt-or fresh-water, in soil, or in the bodies of other animals. Most slime molds live in the shade, as on rocks, leaves, or rotting tree trunks. Most euglenids live in freshwater."}, {"url": "http://douglasdrenkow.com/theworldoflife/systematics/protists.htm", "passage_text": "Although some protists (such as certain red, brown, or green algae) are multicellular and macroscopic, most protists are unicellular and microscopic, traditionally classed as either protozoans (primitive animals) or algae (primitive plants). ENVIRONMENTS. Protists, in general, live in salt-or fresh-water, in soil, or in the bodies of other animals. Most slime molds live in the shade, as on rocks, leaves, or rotting tree trunks. Most euglenids live in freshwater."}, {"url": "https://en.wikipedia.org/wiki/Protist", "passage_text": "Other protists include pathogenic species such as the kinetoplastid Trypanosoma brucei, which causes sleeping sickness and species of the apicomplexan Plasmodium which cause malaria. Some protists, sometimes called ambiregnal protists, have been considered to be both protozoa and algae or fungi (e.g., slime molds and flagellated algae), and names for these have been published under either or both of the ICN and the ICZN."}, {"url": "http://www.tulane.edu/~bfleury/diversity/labguide/mossfern.html", "passage_text": "Primitive bryophytes like mosses and liverworts are so small that they can rely on diffusion to move water in and out of the plant. Mosses have a few strands of water conducting tissue in their central stem, but nothing like the large and well organized network of tubes in tracheophytes, or tube plants. As we pass from mosses to ferns, we see a gradual transition from primitive to modern traits. There are two major trends you should focus on in today's lab. The first is a transition in life cycles, the second is a change in basic internal structure."}, {"url": "https://sg.answers.yahoo.com/question/index?qid=20071003131551AAZzgf7", "passage_text": "Best Answer: They are primitive in the sense of being simple in organization and advanced in terms of protoplasmic organelles like cilia and flagella. 1 You can only upload files of type PNG, JPG or JPEG. 2  You can only upload files of type 3GP, 3GPP, MP4, MOV, AVI, MPG, MPEG or RM. 3  You can only upload photos smaller than 5 MB. 4  You can only upload videos smaller than 600 MB. 5  You can only upload a photo (png, jpg, jpeg) or video (3gp, 3gpp, mp4, mov, avi, mpg, mpeg, rm)."}, {"url": "https://en.wikipedia.org/wiki/Protist", "passage_text": "Protists live in almost any environment that contains liquid water. Many protists, such as algae, are photosynthetic and are vital primary producers in ecosystems, particularly in the ocean as part of the plankton. Some protists, sometimes called ambiregnal protists, have been considered to be both protozoa and algae or fungi (e.g., slime molds and flagellated algae), and names for these have been published under either or both of the ICN and the ICZN."}, {"url": "http://www.tulane.edu/~bfleury/diversity/labguide/mossfern.html", "passage_text": "First, all plants undergo an alternation of generations, between a haploid gametophyte stage and a diploid sporophyte stage. In the most primitive plants, like mosses, the gametophyte is dominant (i.e. it's big and green). In higher plants like ferns and fern allies, the sporophyte stage is dominant. As we pass from mosses to ferns, we see a gradual transition from primitive to modern traits. There are two major trends you should focus on in today's lab. The first is a transition in life cycles, the second is a change in basic internal structure."}, {"url": "https://sg.answers.yahoo.com/question/index?qid=20071003131551AAZzgf7", "passage_text": "In what sense are protist primitive & in what sense are they advanced? 1 You can only upload files of type PNG, JPG or JPEG. 2  You can only upload files of type 3GP, 3GPP, MP4, MOV, AVI, MPG, MPEG or RM. 3  You can only upload photos smaller than 5 MB. 4  You can only upload videos smaller than 600 MB. 5  You can only upload a photo (png, jpg, jpeg) or video (3gp, 3gpp, mp4, mov, avi, mpg, mpeg, rm)."}]