[{"url": "http://emedicine.medscape.com/article/1899456-overview", "passage_text": "The proximal row is found at the level of the distal wrist crease and includes the scaphoid, lunate, triquetrum, and pisiform. The second row of carpal bones, the distal row, is made up of the trapezium, trapezoid, capitate, and hamate; the distal row articulates with the bases of the 5 metacarpal bones. It is actually a collection of multiple bones and joints. The bones comprising the wrist include the distal ends of the radius and ulna, 8 carpal bones, and the proximal portions of the 5 metacarpal bones (see the images below). Bones of the wrist, palmar view. Bones of the wrist, enlarged view."}, {"url": "http://www.mccc.edu/%7Ebehrensb/documents/StructureFunctionofthewristbjb.pdf", "passage_text": "Myology of the Wrist Flexor Carpi Ulnaris Origin Medial epicondyle of the humerus-common flexor tendon and posterior border of the middle 1/3 of the ulnaInsertion Base of the 5 th metacarpal and pisiform-palmar aspectInnervation Ulnar n.Action Wrist flexion, ulnar deviation“tidbit” What’s in a name?Common origin? Myology of the Wrist Palmaris Longus Origin Medial epicondyle of the humerus-common flexortendonInsertion Transverse carpal ligament and the palmar fasciaInnervation Median n. Action Wrist flexion“tidbit” Approximately 10% of the population will NOT have this muscle."}, {"url": "https://en.wikipedia.org/wiki/Wrist", "passage_text": "In the hand proper a total of 13 bones form part of the wrist: eight carpal bones — scaphoid, lunate, triquetral, pisiform, trapezium, trapezoid, capitate, and hamate — and five metacarpal bones —the first, second, third, fourth, and fifth metacarpal bones. The distal radioulnar joint is a pivot joint located between the bones of the forearm, the radius and ulna. Formed by the head of ulna and the ulnar notch of radius, this joint is separated from the radiocarpal joint by an articular disk lying between the radius and the styloid process of ulna."}, {"url": "http://teachmeanatomy.info/upper-limb/joints/wrist-joint/", "passage_text": "The wrist joint is formed by: 1  Distally – The proximal row of the carpal bones (except the pisiform). 2  Proximally – The distal end of the radius, and the articular disk (see below). Ligaments: There are four ligaments of note in the wrist joint, one for each side of the joint. 1  Palmar radiocarpal – It is found on the palmar (anterior) side of the hand. 2  It passes from the radius to both rows of carpal bones."}, {"url": "http://www.innerbody.com/image/skel13.html", "passage_text": "These bones also form the flexible wrist joint with the proximal row of the carpals.... Click to read more below. The bones of the hand and wrist provide the body with support and flexibility to manipulate objects in many different ways. Each hand contains 27 distinct bones that give the hand an incredible range and precision of motion. "}, {"url": "http://www.mccc.edu/%7Ebehrensb/documents/StructureFunctionofthewristbjb.pdf", "passage_text": "Myology of the Wrist Extensor Carpi Ulnaris Origin Lateral epicondyle of the humerus-commonextensor tendon and posterior border of the middle 1/3 of the ulnaInsertion Base of the 5 th metacarpal-dorsal surfaceInnervation Radial n.Action Wrist extension, ulnar deviation“tidbit” What’s in a name?Common origin? Myology of the Wrist Palmaris Longus Origin Medial epicondyle of the humerus-common flexortendonInsertion Transverse carpal ligament and the palmar fasciaInnervation Median n. Action Wrist flexion“tidbit” Approximately 10% of the population will NOT have this muscle."}, {"url": "http://emedicine.medscape.com/article/1899456-overview", "passage_text": "The wrist is a complex joint that bridges the hand to the forearm. It is actually a collection of multiple bones and joints. The bones comprising the wrist include the distal ends of the radius and ulna, 8 carpal bones, and the proximal portions of the 5 metacarpal bones (see the images below). Bones of the wrist, palmar view. Bones of the wrist, enlarged view."}, {"url": "http://emedicine.medscape.com/article/1899456-overview", "passage_text": "Ligaments of the wrist, dorsal view. Volar carpal ligaments. The joints of the wrist are surrounded by a fibrous capsule and are held together by an array of ligaments that provide carpal stability by linking the bones both dorsally and volarly (see the following images). It is actually a collection of multiple bones and joints. The bones comprising the wrist include the distal ends of the radius and ulna, 8 carpal bones, and the proximal portions of the 5 metacarpal bones (see the images below). Bones of the wrist, palmar view. Bones of the wrist, enlarged view."}, {"url": "https://en.wikipedia.org/wiki/Wrist", "passage_text": "As a consequence of these various definitions, fractures to the carpal bones are referred to as carpal fractures, while fractures such as distal radius fracture are often considered fractures to the wrist. The distal radioulnar joint is a pivot joint located between the bones of the forearm, the radius and ulna. Formed by the head of ulna and the ulnar notch of radius, this joint is separated from the radiocarpal joint by an articular disk lying between the radius and the styloid process of ulna."}]