[{"url": "http://www.macmillandictionary.com/thesaurus-category/british/words-used-to-describe-someone-s-personality", "passage_text": "Free thesaurus definition of words used to describe someone s personality from the Macmillan English Dictionary-a free English dictionary online with thesaurus and with pronunciation from Macmillan Publishers Limited. "}, {"url": "http://english.stackexchange.com/questions/22251/is-there-a-word-to-describe-a-person-who-likes-chaos", "passage_text": "I can't seem to think of a word to describe the type of person who would act in this way. I hope this question is clear. EDIT: Below gbutters sums up nicely: What I wonder is if there is a word for a generally good-natured person who just likes some good old-fashioned chaos. It seems like any person that thrives on chaos would have to have some extra baggage. I am wondering if there is a word to describe a person who likes chaos"}, {"url": "http://www.esolcourses.com/content/exercises/grammar/adjectives/personality/more-words-for-describing-personality.html", "passage_text": "ambitious-an adjective used to describe a person who is keen to get on in life. Example sentence: Tushar is very ambitious. He is hoping to be promoted soon. anxious-someone who worries a lot. Example sentence: My boyfriend is very affectionate. aggressive (a negative adjective) - someone who is physically or verbally threatening towards other people. Example sentence: I don't like aggressive people. I like people who are relaxed and calm."}, {"url": "http://www.macmillandictionary.com/thesaurus-category/british/words-used-to-describe-someone-who-works-hard", "passage_text": "The Macmillan Dictionary blog explores English as it is spoken around the world today. Free thesaurus definition of words used to describe someone who works hard from the Macmillan English Dictionary-a free English dictionary online with thesaurus and with pronunciation from Macmillan Publishers Limited. Words used to describe someone who works hard-synonyms or related words."}, {"url": "http://writeshop.com/how-to-describe-a-person-descriptive-words/", "passage_text": "How to describe a person | Using descriptive words. In The Prince and the Pauper, Mark Twain paints a word picture of King Henry VIII using descriptive language: "}, {"url": "http://www.buzzle.com/articles/words-to-describe-a-person.html", "passage_text": "As mentioned before, the above lists are not comprehensive and there are many other words that can be used to describe a person's positive or negative character, behavior, way of thinking, etc. These attributes are often highlighted to summarize an individual's personality or most striking trait. Below is an alphabetical list of words that can be used to describe a person in terms of his/her qualities and the impression he/she has left on you. Note, however, that the individual lists are not in alphabetical order. Deliverance from Descriptive Dilemma"}, {"url": "http://www.esolcourses.com/content/exercises/grammar/adjectives/personality/more-words-for-describing-personality.html", "passage_text": "affectionate-an affectionate person is someone who is very loving. Example sentence: My boyfriend is very affectionate. aggressive (a negative adjective) - someone who is physically or verbally threatening towards other people. Example sentence: I don't like aggressive people. I like people who are relaxed and calm. ambitious-an adjective used to describe a person who is keen to get on in life. Example sentence: Tushar is very ambitious. He is hoping to be promoted soon. anxious-someone who worries a lot. Example sentences: Trish is a very anxious person"}, {"url": "http://www.esolcourses.com/content/exercises/grammar/adjectives/personality/words-for-describing-personality.html", "passage_text": "Here is a list of English words that are used to describe someone's personality. brave-someone who isn't afraid of danger. Example sentence: Mario is a coastguard. He is very brave. His job is to rescue people. chatty-someone who talks a lot. Example sentence: Maria is a very chatty person. mean - 1) Someone who is a nasty person. 2) Someone who doesn't like spending money. Example sentence: Phillip is very mean. He never pays for his share of things. moody-adjective used to describe someone who behaves differently every time you meet them. Example sentence: Nina is very moody."}]