[{"url": "http://medical-dictionary.thefreedictionary.com/Diffusion+tensor+imaging", "passage_text": "The analysis included state-of-the-art magnetic resonance imaging (MRI), susceptibility weighted imaging (SWI), (DTI) along with comprehensive neuropsychological and neurological examinations, interviews, blood tests and APOE (apolipoprotein E) genotyping."}, {"url": "http://medical-dictionary.thefreedictionary.com/DTI", "passage_text": "Diffusion tensor imaging (DTI). A refinement of magnetic resonance imaging that allows the doctor to measure the flow of water and track the pathways of white matter in the brain. DTI is able to detect abnormalities in the brain that do not show up on standard MRI scans."}, {"url": "http://medical-dictionary.thefreedictionary.com/Diffusion+tensor+imaging", "passage_text": "Mori and Tournier explain a type of diffusion magnetic resonance imaging (MRI) that is based on tensor calculation, called. , which can be used to obtain quantitative parameters to describe diffusion anisotropy and fiber orientation in the brain."}, {"url": "http://www.thefreedictionary.com/Diffusion+tensor+imaging", "passage_text": "The analysis included state-of-the-art magnetic resonance imaging (MRI), susceptibility weighted imaging (SWI), (DTI) along with comprehensive neuropsychological and neurological examinations, interviews, blood tests and APOE (apolipoprotein E) genotyping. Chronic brain damage not as prevalent in NFL players as believed by Asian News International."}, {"url": "http://medical-dictionary.thefreedictionary.com/Diffusion+tensor+imaging", "passage_text": "Diffusion tensor imaging (DTI). A refinement of magnetic resonance imaging that allows the doctor to measure the flow of water and track the pathways of white matter in the brain. DTI is able to detect abnormalities in the brain that do not show up on standard MRI scans. Mentioned in: Magnetic Resonance Imaging."}, {"url": "http://www.acronymfinder.com/Science-and-Medicine/DTI.html", "passage_text": "The World's most comprehensive professionally edited abbreviations and acronyms database. All trademarks/service marks referenced on this site are properties of their respective owners. The Acronym Finder is ©1988-2015, Acronym Finder, All Rights Reserved."}]