[{"url": "http://math6.wiki.lovett.org/file/view/mixed+numbers+and+improper+fractions.pdf", "passage_text": "23_4 Step 2: Multiply the denominator by the whole number and then add the numerator.Step 3: Put the resulting number over the original denominator to produce the improper fraction. Changing Mixed Numbers to Improper Fractions denominator x whole number + numerator 4 x 2 + 3 = 1111__ 4."}, {"url": "http://www.answers.com/Q/How_do_you_change_a_mixed_number_to_a_decimal", "passage_text": "In order to change a mixed number to a decimal, you must first make it an improper fraction. To do this, you multiply the whole number by the denominator, then you add the numerator. You take this number and put it on top of the original denominator."}, {"url": "http://www.answers.com/Q/How_do_you_change_a_mixed_number_to_a_decimal", "passage_text": "To convert a mixed number to an improper fraction, multiply the denominator by the whole number, add that total to the numerator and put the whole th … ing over the original denominator. To convert an improper fraction to a decimal, divide the denominator into the numerator."}, {"url": "http://www.wikihow.com/Turn-an-Improper-Fraction-Into-a-Mixed-Number", "passage_text": "An improper fraction is a fraction with a larger top than bottom, like 5 / 2. Mixed numbers are a whole number and a fraction together, like 2 1 / 2. It's usually easier to imagine 2 1 / 2 pizzas than five halves of a pizza, so it's useful to be able to switch between them."}, {"url": "http://math.wikia.com/wiki/Fraction", "passage_text": "Likewise, you can convert an improper fraction into a mixed number by following another 3 rules: 1  Divide the numerator by the denominator. 2  The quotient (without the remainder) becomes the whole number part of the mixed number. 3  The new denominator is the same as the denominator of the improper fraction."}, {"url": "https://en.wikipedia.org/wiki/Fraction_(mathematics)", "passage_text": "Similarly, an improper fraction can be converted to a mixed number as follows: 1  Divide the numerator by the denominator. 2  In the example, , divide 11 by 4. 11 ÷ 4 = 2 with remainder 3. 3  The quotient (without the remainder) becomes the whole number part of the mixed number."}, {"url": "http://math6.wiki.lovett.org/file/view/mixed+numbers+and+improper+fractions.pdf", "passage_text": "November 13, 2008 Change the improper fractions to mixed numbers.Step 1: Write the improper fraction.Step 2: Divide the numerator by the denominator.Step 3: The quotient becomes the whole number and the remainder is put over"}, {"url": "http://www.mathgoodies.com/lessons/fractions/fractions_to_mixed.html", "passage_text": "The answer to the question is: Only an improper fraction greater than 1 can be written to a mixed number. Summary: We can convert an improper fraction greater than one to a mixed number through long division of its numerator and denominator."}, {"url": "http://math.wikia.com/wiki/Fraction", "passage_text": "1 The quotient (without the remainder) becomes the whole number part of the mixed number. 2  The remainder becomes the numerator of the fractional part. 3  In the example, 4 is the whole number part and 4 is the numerator of the fractional part. 4  The new denominator is the same as the denominator of the improper fraction."}, {"url": "http://math.wikia.com/wiki/Fraction", "passage_text": "You can convert a mixed number (a, surprisingly, mixed fraction — is a mixed number) into an improper fraction (a fraction in which the numerator is larger than the denominator) by doing three things: 1  Multiply the whole number (the) by the denominator (the other) of the fractional part."}]