[{"url": "http://www.youtube.com/watch?v=DBiIh3AZNtc", "passage_text": "Part of the series: Horse Training. Hooking up a horse harness involves placing the breast collar, saddle, breeching and bridle on the horse, and then looping the cart shafts into the harness lines. Attach a harnessed horse to a cart with tips from a professional horse trainer in this free video on horse tack."}, {"url": "http://www.shipshewanaharness.com/", "passage_text": "Draft Horse Harnesses-Shipshewana Harness & Supplies offers a complete line of Draft horse harnesses and we carry the exclusive line of SHOWTIME brand shipping boots, horse blankets, hock sweats, show halters, decorations and much more. Shop with confidence."}, {"url": "https://en.wikipedia.org/wiki/Horse_harness", "passage_text": "There are two main categories of horse harness, breaststrap or breastcollar design and the collar and hames design. For light work, such as horse show competition where light carts are used, a harness needs only a breastcollar."}, {"url": "http://www.mydrafthorse.com/cfwebstore/index.cfm?fuseaction=product.display&Product_ID=301", "passage_text": "Aluminum-Cast Iron-Brass: Harness or tack hooks are great for hanging up harness, bridles or any tack. Keep the tack room organized and picked up. Aluminum Harness Hooks: Light weight but strong and a choice of Bright or Black. Available in 10.5 sizeCast Iron: Perfect for hanging up that heavy harness and harness parts. These are high quality from a extra clean casting."}, {"url": "http://www.wikihow.com/Harness-a-Horse", "passage_text": "1 The breeching is the harness's braking system and has a wide strap that lays across the horse's hindquarters and smaller straps the lay across the croup. 2  Hold back straps attach to rings on the shaft of the cart. 3  The breeching also has a stuffed crupper that goes underneath the horse's tail."}, {"url": "http://www.wikihow.com/Harness-a-Horse", "passage_text": "1 It has rein guides and a girth that wraps around the horse's belly to hold it in place. 2  Also on the saddle are shaft tugs to hold the shafts of the cart. 3  The breast collar is a flat piece of leather attached to the traces. 4  It lays flat against the horse's chest and allows the horse to pull the carriage or implement."}]