[{"url": "https://uk.answers.yahoo.com/question/index?qid=20090513085956AA4GEPr", "passage_text": "RE: What temperature should i cook salmon in foil in a fan oven and for how long? I&#39;m cooking salmon in a fan oven wrapped in foil with some seasoning and olive oil. I was think the temp should be around 180-200 for 15-20 minutes???"}, {"url": "http://www.livestrong.com/article/431859-how-to-bake-salmon-in-the-oven-with-foil/", "passage_text": "Drizzle 1 to 2 tbsp. of olive oil on top of the salmon while in the foil. Season as you like with salt, pepper, basil, oregano, garlic or your favorite spices. You can also bake vegetables such as onions, squash and tomatoes inside the foil with the salmon for a richer flavor."}, {"url": "http://www.bhg.com/recipes/fish/basics/how-to-bake-salmon/", "passage_text": "Bake Until Opaque and Flaky. Preheat the oven to 450 degrees F for fillets or 350 degrees F for a dressed fish. You can bake the fillets at a lower temperature, if desired, but remember to increase the cooking time. Bake salmon fillets or steaks, uncovered, for 4 to 6 minutes per 1/2-inch thickness."}, {"url": "http://thehousingforum.com/how-long-to-bake-salmon-in-the-oven/", "passage_text": "When baking a tail wrapped in foil, use 375° as the heat setting and bake the fish for 20-22 minutes. ● Salmon Steak. Steaks of course are much thicker than a fillet. For each 1″ of thickness, figure on 10 minutes of baking time. Steaks should be baked uncovered at exactly 400°."}, {"url": "http://www.foodnetwork.com/recipes/giada-de-laurentiis/salmon-baked-in-foil-recipe.html", "passage_text": "Preheat the oven to 400 degrees F. Sprinkle salmon with 2 teaspoons olive oil, salt, and pepper. Stir the tomatoes, shallots, 2 tablespoons of oil, lemon juice, oregano, thyme, salt and pepper in a medium bowl to blend. Place a salmon fillet, oiled side down, atop a sheet of foil. Wrap the ends of the foil to form a spiral shape."}, {"url": "http://thehousingforum.com/how-long-to-bake-salmon-in-the-oven/", "passage_text": "For a fillet that is about 1″ thickness, bake the fish at 400° for about 10-12 minutes. When using a foil wrap, the fillet should be baked at 375° for about 15-20 minutes. ● Tail Fillet. The tail tip is the thinnest fillet and often the most tender. When seeking a cut of Salmon other than a steak, this will often be the best choice. Bake the tail at 415° for optimal results."}]