[{"url": "http://home.costhelper.com/carpeting.html", "passage_text": "Related articles: Hardwood Floors, Vinyl Flooring, Home Addition. 1  Prices range from $2 a square foot for the most inexpensive carpeting, including some self-adhesive carpet tiles, to as much as $100 a square yard for high-end or custom project. 1 Installers may also charge an extra $1-$2 a square yard to move furniture, another $1-$2/square yard for removing the existing carpeting; $1-$2/square yard for disposing of the old carpet; and $1-$2 extra for installing berber (loose loop) style products. 2  There are also extra fees for steps and oddly-shaped rooms."}, {"url": "http://home.costhelper.com/carpeting.html", "passage_text": "1 Prices range from $2 a square foot for the most inexpensive carpeting, including some self-adhesive carpet tiles, to as much as $100 a square yard for high-end or custom project. 2  Decent carpeting and padding can usually be installed for $19-$38 a square yard, or $300-$600 for a 12x12-foot room. 1 Installers may also charge an extra $1-$2 a square yard to move furniture, another $1-$2/square yard for removing the existing carpeting; $1-$2/square yard for disposing of the old carpet; and $1-$2 extra for installing berber (loose loop) style products. 2  There are also extra fees for steps and oddly-shaped rooms."}, {"url": "http://homewyse.com/services/cost_to_install_carpet.html", "passage_text": "Our free calculator uses recent, trusted data to estimate costs for your Carpet Installation project. For a basic 250 square feet project in zip code 47474, the benchmark cost to Install Carpet ranges between $3.74 - $4.83 per square foot* . To estimate costs for your project: 1. Set Project Zip Code Enter the Zip Code for the location where labor is hired and materials purchased. "}, {"url": "http://www.fixr.com/costs/carpet-installation", "passage_text": "1 Selecting the carpet-carpeting can cost as little as $2 per square foot, or as high as $100 per square yard, but the average carpet and pad will cost between $30 and $40 per square yard-for a total of around $995 for the carpeting alone. "}, {"url": "http://home.costhelper.com/carpet-cleaning.html", "passage_text": "1 In-house area rug cleaning is charged by the square foot and varies with rug type. 2  Wool costs around $1-$1.50 per sq. ft., or $168-252 for a 12x14 foot rug, while synthetics average .75 cents per sq. ft., or $126 for a 12x14 foot. 1 Stain removal varies according to type and size of stain, but can run an additional .10 cents per square foot, or $30 for 300-square feet of cleaning space. 2  Deodorizing averages .05 cents per square foot, or $15 for 300-square feet of cleaning area."}, {"url": "https://answers.yahoo.com/question/index?qid=20071201222808AAujDBJ", "passage_text": "Report Abuse. It all depends on the quality of the carpet you buy. It can range from $3 to 30 per square foot. If you rent, chances are there is pretty cheap carpet in there and I wouldn't pay more than $4-5 per square ft for replacement carpet. Chances are you can find it for less. "}, {"url": "http://www.homeadvisor.com/cost/cleaning-services/clean-carpeting/", "passage_text": "Professional carpet cleaning costs vary depending on the size of the area, the cleaning method, the carpet type, and whether stain removal is required. For example, you can expect to pay more for a wool carpet than for berber. On average, homeowners report paying $174 and most spend between $120 and $236. "}, {"url": "https://answers.yahoo.com/question/index?qid=20090112104153AAjB7aD", "passage_text": "Now he put in a 9# pad, which is a very good pad for residential carpet ,(5 1/2 # minumum required) so you can save a bit and go to a lower poundage pad and still carry the carpet warranty. Your choice there. Now if the 1 st gent put in a berber, thats just about the rt poundage for a berber(8 # required). GL. We just did 4 bedrooms and closets (800 sq/ft) with 9 lb pad and mid grade carpet for $2500 installed. In your case I'm guessing $5000 because of the stairs. We use Quality One Carpet."}, {"url": "http://home.costhelper.com/carpeting.html", "passage_text": "1 Decent carpeting and padding can usually be installed for $19-$38 a square yard, or $300-$600 for a 12x12-foot room. 2  If it's not included, add, $2.50-$6 a square yard for padding. 3  Be skeptical of prices that include free padding, because good padding increases the life span of your carpet; ask about upgrades. 1 Installers may also charge an extra $1-$2 a square yard to move furniture, another $1-$2/square yard for removing the existing carpeting; $1-$2/square yard for disposing of the old carpet; and $1-$2 extra for installing berber (loose loop) style products. 2  There are also extra fees for steps and oddly-shaped rooms."}]