[{"url": "https://en.wikipedia.org/wiki/Virtuoso", "passage_text": "A virtuoso (from Italian virtuoso [virtuˈoːso] or [virˈtwoːzo] , virtuous, Late Latin virtuosus, Latin virtus, virtue, excellence, skill, or manliness) is an individual who possesses outstanding technical ability in a particular art or field. Examples of well known Virtuosi over time. Top Row-From left: Franz Liszt, Frederic Chopin, Niccolo Niccolò, Paganini Georges Cziffra Middle-Row from: Left Sergei, Rachmaninoff Antonio, Vivaldi-Yo Yo, Ma-Charles Valentin Alkan Bottom-Row from: Left Krystian, Zimerman Arthur, Rubinstein Jorge, Bolet Valentina. lisitsa"}, {"url": "https://en.wikipedia.org/wiki/Virtuoso", "passage_text": "This word also refers to a person who has cultivated appreciation of artistic excellence, either as a connoisseur or collector. Virtuoso's plural form is either virtuosi or the Anglicisation, virtuosos, and the feminine forms are virtuosa and virtuose. Examples of well known Virtuosi over time. Top Row-From left: Franz Liszt, Frederic Chopin, Niccolo Niccolò, Paganini Georges Cziffra Middle-Row from: Left Sergei, Rachmaninoff Antonio, Vivaldi-Yo Yo, Ma-Charles Valentin Alkan Bottom-Row from: Left Krystian, Zimerman Arthur, Rubinstein Jorge, Bolet Valentina. lisitsa"}, {"url": "http://dictionary.cambridge.org/dictionary/english/virtuoso", "passage_text": "virtuoso noun [C]. › a ​person who is ​extremely skilled at something, ​especially at ​playing an ​instrument or ​performing: Famous ​mainly for his ​wonderful ​voice, Cole was also a virtuoso on the ​piano. › a ​person who is ​extremely ​skilled at something, ​especially at ​playing an ​instrument or ​performing: Famous ​mainly for his ​wonderful ​voice, Cole Porter was also a virtuoso on the ​piano. uk /ˌvɜː.tjuˈəʊ.səʊ/ us /ˌvɝː.tʃuˈoʊ.soʊ/."}, {"url": "http://www.answers.com/Q/What_is_Virtuoso", "passage_text": "What is a virtuoso violinist? The word virtuoso (from latin virtuosus) is an Italian word meaning in English an individual who possesses outstanding excellence in any specified field.    Thus virt … uoso violinist simply means somebody who is a performer of outstanding excellence on the violin such as the great Paganini. A virtuoso is a person that is highly skilled in music or another artistic form. Which means that a piano virtuoso is a person that is highly skilled in playing the piano spec … ifically."}, {"url": "https://en.wikipedia.org/wiki/Virtuoso", "passage_text": "The Italian term virtuoso was also once commonly used to describe the group of emerging ballistic experts, engineers, artillerists, and specialists in mechanics and dynamics that arose during the late 17th century in response to the spreading use of gunpowder in Europe. Examples of well known Virtuosi over time. Top Row-From left: Franz Liszt, Frederic Chopin, Niccolo Niccolò, Paganini Georges Cziffra Middle-Row from: Left Sergei, Rachmaninoff Antonio, Vivaldi-Yo Yo, Ma-Charles Valentin Alkan Bottom-Row from: Left Krystian, Zimerman Arthur, Rubinstein Jorge, Bolet Valentina. lisitsa"}, {"url": "https://en.wikipedia.org/wiki/Virtuoso_Universal_Server", "passage_text": "Virtuoso Universal Server is a middleware and database engine hybrid that combines the functionality of a traditional RDBMS, ORDBMS, virtual database, RDF, XML, free-text, web application server and file server functionality in a single system. 1 NOT NULL – Within the definition of a table, Virtuoso allows data to contain a NULL value. 2  This NULL value is not really a value at all and is considered an absence of value."}, {"url": "http://blog.virtuoso.com/faq/", "passage_text": "Thanks for visiting! Virtuoso is a by-invitation-only network of more than 9,800 luxury travel advisors in North and South America, the Caribbean, Asia-Pacific and Europe. The advisors work for more than 375 independent travel agencies in 31 countries, and have more than 1.2 million affluent leisure travelers as clients. The hallmark of Virtuoso is fostering close relationships among member agencies, preferred travel suppliers and affluent travelers. More than 1,700 luxury travel providers, including hotels, cruise lines, airlines, tour operators and government tourism boards, are part of the network."}, {"url": "http://www.thetravelagentinc.com/about-the-travel-agent/what-is-virtuoso/", "passage_text": "Being the client of a Virtuoso Advisor means not only will your journey be customized to your every desire by the foremost experts in travel... You’ll be recognized as one of the most prestigious guests in the world. With all the privileged access, perks, and service that implies. "}, {"url": "http://www.merriam-webster.com/dictionary/virtuoso", "passage_text": "Full Definition of VIRTUOSO. 1. : an experimenter or investigator especially in the arts and sciences: savant. 2. : one skilled in or having a taste for the fine arts. 3. : one who excels in the technique of an art; especially: a highly skilled musical performer (as on the violin). 4. "}]