[{"url": "http://www.medicalproductsdirect.com/oxygentanks.html", "passage_text": "Oxygen tanks are used in hospitals, facilities and homes to deliver needed oxygen to a patient. We carry a large selection of oxygen tanks for sale including small M4, M6, M7 and M9 oxygen tanks, portable D and E sized oxygen tanks as well as larger M60 and M cylinder oxygen tanks. What is an."}, {"url": "http://www.inogen.com/resources/oxygen-concentrators/oxygen-tanks-safety/", "passage_text": "Using Oxygen Tanks in Medical Therapy. Oxygen therapy, the term used to describe oxygen that doctors prescribe, requires a medical oxygen tank and an appropriate breathing device."}, {"url": "http://www.inogen.com/resources/oxygen-concentrators/oxygen-tanks-safety/", "passage_text": "A mask is then placed on the individual’s face over the mouth and nose. A nasal cannula is placed directly in the nostrils. Although oxygen tanks are the containers that hold pressurized oxygen, they are used in several different settings and situations. The proper use of a medical oxygen tank and its dimensions will vary based on the tank a doctor determines is most appropriate."}, {"url": "http://www.inogen.com/resources/oxygen-concentrators/oxygen-tanks-safety/", "passage_text": "Oxygen tanks are a type of storage system that holds oxygen or liquid oxygen in a pressurized container. The size and appearance of an oxygen tank can vary depending on the purpose of the container, where it is used and the mobility requirements."}, {"url": "https://en.wikipedia.org/wiki/Oxygen_tank", "passage_text": "From Wikipedia, the free encyclopedia. An oxygen tank is an oxygen storage vessel for oxygen, which is either held under pressure in gas cylinders or as liquid oxygen in a cryogenic storage tank. Oxygen tanks are used to store gas for: 1  industrial processes including the manufacture of steel and monel. 2  oxyacetylene welding equipment, glass lampworking torches, and some gas cutting torches. 3  use as the liquid rocket propellants for rocket engines. 4  medical breathing gas at medical facilities and at home."}]