[{"url": "http://paradiseintheworld.com/formentera-spain/", "passage_text": "Formentera is the second smallest inhabited island of the Spanish Autonomous Community of the Balearic Islands and a municipality."}, {"url": "http://www.tourist-destinations.com/2011/06/formentera-spain.html", "passage_text": "Let us be your guide to the natural, simple beauty of Formentera island, use our photos, maps to show you where are the most beautiful villages, places worth to visit like Es Pujols or the Ferry harbor La Savina, amazing beaches with white sand and blue water and wonderful countryside."}, {"url": "http://www.booking.com/region/es/formentera.html", "passage_text": "The smallest of the main Balearic Islands, Formentera is more laid back and generally less touristy than its bigger neighbors. It doesn’t have an airport, so most arrivals are by ferry from Ibiza Town or Denia on the Costa Blanca."}, {"url": "https://en.wikipedia.org/wiki/Formentera", "passage_text": "[formenˈteɾa]) is the smaller and more southerly island of the Pityusic Islands group (comprising Ibiza and Formentera, as well as various small islets), which belongs to the Balearic Islands autonomous community (Spain)."}, {"url": "http://www.formentera.es/en/the-island", "passage_text": "Formentera is known as the last Mediterranean paradise because it has been able to combine tourism with environmental protection. The struggle of various generations of Formenterans has made possible the conservation of an island whose beaches, transparent waters and climate make it a little jewel in Mare Nostrum."}, {"url": "http://wikitravel.org/en/Formentera", "passage_text": "Formentera is the smallest and most southerly of the Balearic Islands of Spain. With a population of just over 7000 and no airport, Formentera is usually quieter than its neighbor Ibiza. However, in the peak season of July-August, it draws huge numbers of tourists. The overwhelming majority are Italian and the Italian language is heard more often than any other."}, {"url": "https://en.wikipedia.org/wiki/Formentera", "passage_text": "Formentera comprises one municipality, also called Formentera, and has a population of 9,962 (as at 1 January 2010). Its land area is 83.24 square kilometres (32.1 sq mi). It is subdivided into several civil parishes (parequios), themselves subdivided into vendas (vendes véndes In). catalan"}, {"url": "http://wikitravel.org/en/Formentera", "passage_text": "Understand [edit]. With a population of just over 7000 and no airport, Formentera is usually quieter than its neighbor Ibiza. However, in the peak season of July-August, it draws huge numbers of tourists. The overwhelming majority are Italian and the Italian language is heard more often than any other."}]