[{"url": "http://blogs.egusd.net/eettalfonso/2011/05/24/25-describe-comparecontrast-xylemphloem-veinsarteries/", "passage_text": "The veins and arteries have a few differences from the xylem and phloem. The xylem and phloem carry water and nutrients throughout a plant while the veins and arteries carry blood in a body. The xylem and phloem transport things up and down and veins and arteries carry blood to and from the heart."}, {"url": "http://www.answers.com/Q/What_is_the_function_of_the_vein_in_plants", "passage_text": "Confidence votes 37. To carry water and nutrients (sugars) to the / throughout the plant's system.. not only does it do that but it also carries the products of photosynthesis which is glucose and other carbohydrates.There are two types of vessels in the vein one forms xylem the other forms phloem :)."}, {"url": "http://www.answers.com/Q/What_is_the_definition_of_a_plant_vein", "passage_text": "To carry water and nutrients (sugars) to the / throughout the plant's system.. not only does it do that but it also carries the products of photosynthesis which is glucose and … other carbohydrates.There are two types of vessels in the vein one forms xylem the other forms phloem :)."}, {"url": "http://www.answers.com/Q/What_is_the_definition_of_a_plant_vein", "passage_text": "a vein that carries material in or out of a leaf. there are two parts, phloem and xylem which bring material in and out. xylem bring water and minerals up to the leaf, while the phloem is taking the unwanted and bring it out of the leaf to the stem where it can bring the unwanted stuff out of the flower."}, {"url": "http://www.ehow.com/about_6624563_plant-vein_.html", "passage_text": "Just as animals have vessels that carry materials throughout their bodies, plants have veins for the transportation of nutrients, including water. Plant veins are also sturdy enough to act as a support system and keep leaves open for photosynthesis -- the process through which plants make food. Plants have a vascular system throughout their roots and stems, but the system's veins are most visible in leaves."}, {"url": "http://blogs.egusd.net/eettalfonso/2011/05/24/25-describe-comparecontrast-xylemphloem-veinsarteries/", "passage_text": "The xylem & phloem & the veins and arteries both carry nutrients and minerals from the plant and animals. Like the xylem moves water and minerals up from the roots. Some of the water is stored in the vacuoles as water moves up the plant."}]