[{"url": "http://www.thespicehouse.com/spices-by-category/peppercorns", "passage_text": "Pink peppercorns and Sichuan peppercorns are not true peppercorns. Pink peppercorns are soft, fragile berries with a sweet-sharp flavor. Sichaun pepper is the berry of the mountain ash tree, with a pungent, cold flavor instead of the usual heat of a peppercorn. We offer three varieties of whole black peppercorns, as well as white, green and pink corns. Green peppercorns are young when they are picked and dehydrated or preserved, with a resulting mild flavor. The black peppercorns are left on the vine to fully mature and develop a stronger flavor profile."}, {"url": "http://www.tarladalal.com/glossary-peppercorns-584i", "passage_text": "Black pepper, green pepper and white peppercorns are actually the same fruit (Piper nigrum); the difference in their color is a reflection of varying stages of development and processing methods. spiciness of black pepper is due to the chemical piperine. The original meaning of Peppercorn is the fruit of Black pepper.Black pepper comes from the pepper plant, a smooth woody vine that can grow up to 33 feet in hot and humid tropical climates. They begin to bear small white clustered flowers after 3 to 4 years and develop into berries known as peppercorns."}, {"url": "https://en.wikipedia.org/wiki/Black_pepper", "passage_text": "Dried ground pepper has been used since antiquity for both its flavour and as a traditional medicine. Black pepper is the world's most traded spice. It is one of the most common spices added to European cuisine and its descendants. Peppercorns, and the ground pepper derived from them, may be described simply as pepper, or more precisely as black pepper (cooked and dried unripe fruit), green pepper (dried unripe fruit) and white pepper (ripe fruit seeds)."}, {"url": "https://en.wikipedia.org/wiki/Black_pepper", "passage_text": "Black pepper (Piper nigrum) is a flowering vine in the family Piperaceae, cultivated for its fruit, which is usually dried and used as a spice and seasoning. When dried, the fruit is known as a peppercorn. Peppercorns, and the ground pepper derived from them, may be described simply as pepper, or more precisely as black pepper (cooked and dried unripe fruit), green pepper (dried unripe fruit) and white pepper (ripe fruit seeds)."}, {"url": "http://www.wisegeek.com/what-are-peppercorns.htm", "passage_text": "Peppercorns are the dried fruit of the piper nigrum or pepper vine, which is native to Southern India. Though occasionally fresh varieties are used in Asian cuisine, we normally use dried ones in the west. Peppercorns were historically used to treat toothaches, among other conditions. Peppercorns are dried and used as a seasoning, commonly found in peppermills, among other types of peppercorns. Peppercorns are"}, {"url": "http://www.answers.com/Q/What_are_peppercorns", "passage_text": "Peppercorns are black peppers in tiny bit pieces. Its usually dried and used as spice and seasonings. Also Black pepper (peppercorns) is the world's most traded spice. Peppercorns are the fruit of Piper nigrum, an evergreen climbing vine native to the jungles of India's Malabar Coast. As demand for pepper grew, cultivation spread. India cont … inues to be a major producer but the Indonesian islands and Malaysia also make great contributions to world trade. 10 people found this useful."}, {"url": "https://en.wikipedia.org/wiki/Black_pepper", "passage_text": "Peppercorns (dried black pepper) are, by monetary value, the most widely traded spice in the world, accounting for 20 percent of all spice imports in 2002. The price of pepper can be volatile, and this figure fluctuates a great deal year to year; for example, pepper made up 39 percent of all spice imports in 1998. Peppercorns, and the ground pepper derived from them, may be described simply as pepper, or more precisely as black pepper (cooked and dried unripe fruit), green pepper (dried unripe fruit) and white pepper (ripe fruit seeds)."}, {"url": "http://www.wisegeek.com/what-are-peppercorns.htm", "passage_text": "Black peppercorns are picked from unripe or green pepper fruit. They are dried for a few days to produce the familiar tiny wrinkly black fruit. Peppercorns contain a seed, and this is the portion of the fruit that produces white peppercorns. Peppercorns were historically used to treat toothaches, among other conditions. Peppercorns are dried and used as a seasoning, commonly found in peppermills, among other types of peppercorns. Peppercorns are native to Southern India."}, {"url": "http://www.thespicehouse.com/spices-by-category/peppercorns", "passage_text": "White, black and green peppercorns all come from the same vine. They grow in clusters (like grapes), and are harvested in various stages of growth. Green peppercorns are young when they are picked and dehydrated or preserved, with a resulting mild flavor. The black peppercorns are left on the vine to fully mature and develop a stronger flavor profile."}]