[{"url": "https://en.wikipedia.org/wiki/Sannyasa", "passage_text": "Sannyasa is a form of asceticism, is marked by renunciation of material desires and prejudices, represented by a state of disinterest and detachment from material life, and has the purpose of spending one's life in peaceful, love-inspired, simple spiritual life. Sannyasa is traditionally conceptualized for men or women in late years of their life, but young brahmacharis have had the choice to skip householder and retirement stage, renounce worldly and materialistic pursuits and dedicate their lives to spiritual pursuits (moksha)."}, {"url": "http://www.hindupedia.com/en/Sanyasi_Vyavastha", "passage_text": "Sanyasa ashrama is one of the four stages of man's life. However a sanyasi is technically outside the social fold. He is outside social divisions or categories, and its rules. He does not have any social bond as such, though he can raise his meal through accepting alms and by attending people's houses as a guest."}, {"url": "http://www.collinsdictionary.com/dictionary/english/sanyasi", "passage_text": "1 a variant of sannyasi. 2  a Brahman who having attained the fourth and last stage of life as a beggar will not be reborn, but will instead be absorbed into the Universal Soul Also called: renunciate. Definitions. 1"}, {"url": "https://en.wikipedia.org/wiki/Sannyasa", "passage_text": "Sannyasa (saṁnyāsa) is the life stage of renunciation within the Hindu philosophy of four age-based life stages known as ashramas, with the first three being Brahmacharya (bachelor student), Grihastha (householder) and Vanaprastha (forest dweller, retired). Sannyasa is traditionally conceptualized for men or women in late years of their life, but young brahmacharis have had the choice to skip householder and retirement stage, renounce worldly and materialistic pursuits and dedicate their lives to spiritual pursuits (moksha)."}, {"url": "https://in.answers.yahoo.com/question/index?qid=20080710232242AA5FkL5", "passage_text": "Best Answer: Sadhu and Sannyasi! Sadhu in Sanskrit, basically means; to cut or one who cuts... The one by whose instruction or direction one can be cut free from samsara, the cycle of repeated birth and death. A sadhu can be in any order of life. A sannyasi for the first few years of his sannyasa life will carry a sannyasa danda or staff. According to the type of staff he carries you can tell which line or school of philosophy he hails from. Mayavadi sannyasis carry a single rod, known as an eka danda."}, {"url": "http://www.wordreference.com/definition/sanyasi", "passage_text": "sannyasi, sanyasi /sʌnˈjɑːsɪ/sannyasin /sʌnˈjɑːsɪn/ n a Brahman who having attained the fourth and last stage of life as a beggar will not be reborn, but will instead be absorbed into the Universal SoulAlso called: renunciate Etymology: from Hindi: abandoning, from Sanskrit samnyāsin. "}, {"url": "http://www.thefreedictionary.com/sanyasi", "passage_text": "Noun. 1. sanyasi-a Hindu religious mendicant. sannyasi, sannyasin. Hindoo, Hindu-a person who adheres to Hinduism. "}, {"url": "https://en.wikipedia.org/wiki/Sannyasa", "passage_text": "Sannyasa has historically been a stage of renunciation, ahimsa (non-violence) peaceful and simple life and spiritual pursuit in Indian traditions. However, this has not always been the case. Sannyasa is traditionally conceptualized for men or women in late years of their life, but young brahmacharis have had the choice to skip householder and retirement stage, renounce worldly and materialistic pursuits and dedicate their lives to spiritual pursuits (moksha)."}, {"url": "https://in.answers.yahoo.com/question/index?qid=20080710232242AA5FkL5", "passage_text": "A sannyasi has to be given initiation into sannyasa order by another sannyasi, who then becomes his sannyasa guru. Sannyasi's are given the title, Swami or Goswami, which means, one who has controlled the senses. A sannyasi is generally considered a sadhu and offered great respect. A sannyasi for the first few years of his sannyasa life will carry a sannyasa danda or staff. According to the type of staff he carries you can tell which line or school of philosophy he hails from. Mayavadi sannyasis carry a single rod, known as an eka danda."}]