[{"url": "http://www.biography.com/people/tennessee-williams-9532952", "passage_text": "Early Years. Playwright Tennessee Williams was born Thomas Lanier Williams on March 26, 1911, in Columbus, Mississippi, the second of Cornelius and Edwina Williams' three children. After college, he moved to New Orleans, a city that would inspire much of his writing. On March 31, 1945, his play, The Glass Menagerie, opened on Broadway and two years later A Streetcar Named Desire earned Williams his first Pulitzer Prize."}, {"url": "https://en.wikipedia.org/wiki/Tennessee_Williams", "passage_text": "Thomas Lanier  Tennessee  Williams III (March 26, 1911 – February 25, 1983) was an American playwright and author of many stage classics. Along with Eugene O'Neill and Arthur Miller he is considered among the three foremost playwrights in 20th century American drama. His drama A Streetcar Named Desire is often numbered on the short list of the finest American plays of the 20th century alongside Long Day's Journey into Night and Death of a Salesman. Much of Williams' most acclaimed work was adapted for the cinema. He also wrote short stories, poetry, essays and a volume of memoirs."}, {"url": "http://www.sparknotes.com/lit/streetcar/context.html", "passage_text": "Plot Overview. Tennessee Williams was born Thomas Lanier Williams III in Columbus, Mississippi, in 1911. His friends began calling him Tennessee in college, in honor of his Southern accent and his father’s home state. "}, {"url": "http://www.notablebiographies.com/We-Z/Williams-Tennessee.html", "passage_text": "Tennessee Williams Biography. Born: March 26, 1914 Columbus, Mississippi Died: February 25, 1983 New York, New York. American dramatist, playwright, and writer. Tennessee Williams, dramatist and fiction writer, was one of America's major mid-twentieth-century playwrights. He is best known for his powerful plays, A Streetcar Named Desire and Cat on a Hot Tin Roof."}, {"url": "http://www.biography.com/people/tennessee-williams-9532952", "passage_text": "Synopsis. Playwright Tennessee Williams was born on March 26, 1911, in Columbus, Mississippi. After college, he moved to New Orleans, a city that would inspire much of his writing. On March 31, 1945, his play, The Glass Menagerie, opened on Broadway and two years later A Streetcar Named Desire earned Williams his first Pulitzer Prize."}, {"url": "http://www.imagi-nation.com/moonstruck/clsc9.htm", "passage_text": "Tennessee Williams Thomas Lanier Williams was born on March 26, 1911 in Columbus, Mississippi. The second of three children, his family life was full of tension. His parents, a shoe salesman and the daughter of a minister, often engaged in violent arguments that frightened his sister Rose."}, {"url": "http://www.astro.com/astro-databank/Williams%2C_Tennessee", "passage_text": "Williams literary output numbers more than 70 plays, 15 screenplays, five books of prose and two books of poems. Tennessee Williams was born Thomas Lanier Williams III in an Episcopal rectory in Columbus, Mississippi, where his mother’s father was rector. He was one of three children. His sister, Rose, was two years older, and his brother, Dakin, eight years younger. "}, {"url": "http://www.shmoop.com/tennessee-williams/timeline.html", "passage_text": "Tennessee Williams Born. Thomas Lanier Williams—later known as Tennessee—is born in Columbus, Mississippi. He is the second child of Cornelius Williams and Edwina Dakin Williams, both descendants of well-to-do Southern families. "}, {"url": "http://www.notablebiographies.com/We-Z/Williams-Tennessee.html", "passage_text": "Becoming Tennessee. Tennessee Williams was born Thomas Lanier Williams in Columbus, Mississippi, on March 26, 1914, the second of three children of Cornelius and Edwina Williams. His father, a traveling salesman, was rarely home and for many years the family lived with his mother's parents. Tennessee Williams, dramatist and fiction writer, was one of America's major mid-twentieth-century playwrights. He is best known for his powerful plays, A Streetcar Named Desire and Cat on a Hot Tin Roof."}]