[{"url": "http://www.ehow.com/info_8165887_oven-cooking-times-baked-chicken.html", "passage_text": "Baked Chicken Pieces. If you want chicken to cook faster, cut it into pieces and arrange them in a shallow baking dish. Place the chicken into an oven preheated to 375 degrees Fahrenheit. Bake legs, thighs and wings for 35 to 45 minutes and bone-in breasts 30 to 40 minutes, depending on the size of the pieces. Bake boneless breasts for 20 to 30 minutes, cutlets or tenderloins for 15 to 20 minutes and boneless thighs 25 to 35 minutes at 375 degrees Fahrenheit. Victor Holguin/Demand Media."}, {"url": "http://www.food.com/recipe/baked-chicken-thighs-196990", "passage_text": "1 Place the chicken in a 9 X 13 baking dish and bake for 45 minutes-Note: if you use the legs with the thigh connected, use more time to cook. 1 On a plate, combine crumbs, cheese, parsley, salt and pepper. 2  Dip chicken in butter/mustard and then pat crumbs on the chicken. 3  Place the chicken in a 9 X 13 baking dish and bake for 45 minutes-Note: if you use the legs with the thigh connected, use more time to cook."}, {"url": "http://www.wikihow.com/Bake-Chicken-Legs", "passage_text": "7. Remove the chicken from the oven and pour the honey mixture over the pieces. Put the chicken back into the oven and bake for another 35 minutes, or until the chicken skin looks crisp and brown. 1  Chicken is done when it has reached an internal temperature of 180 degrees. 2  Use a meat thermometer to check the temperature. Baking, or roasting, chicken legs results in juicy, flavorful meat and crispy skin. Preparing them is as simple as tossing the legs with your favorite flavor combinations and popping them in the oven at a fairly high heat. Read on for three ways to make chicken legs: honey baked, spicy hot, and rosemary garlic."}, {"url": "http://www.wikihow.com/Bake-Chicken-Legs", "passage_text": "Bake the chicken. Put the chicken in the oven and set a timer for 30 minutes. Check the chicken after 30 minutes. It should be ready when the skin is crispy and golden brown, or when the internal temperature has reached 180 degrees. Use a meat thermometer to check the temperature. Baking, or roasting, chicken legs results in juicy, flavorful meat and crispy skin. Preparing them is as simple as tossing the legs with your favorite flavor combinations and popping them in the oven at a fairly high heat. Read on for three ways to make chicken legs: honey baked, spicy hot, and rosemary garlic."}, {"url": "http://www.simplyrecipes.com/recipes/classic_baked_chicken/", "passage_text": "Then lower the heat to 350°F (175°C) and bake for and additional 10-30 minutes more until the juices run clear (not pink) when poked with a sharp knife or the internal temperature of the chicken breasts is 165°F (74°C) and of the thighs is 170°F (77°C). Arrange the chicken pieces in the pan so that all the pieces are skin-side up, and the largest pieces (the breasts) are in the center of the pan. Don't crowd the pan; allow room between the pieces. 3 Bake in the oven for 30 minutes at 400°F (205°C)."}, {"url": "https://answers.yahoo.com/question/index?qid=20060622170808AAzYXDm", "passage_text": "Answers. Relevance. Rating Newest Oldest. Best Answer: If the legs and thighs are separated, cook at 350 degrees for 25 to 30 minutes or until the juices run clear, or they read an internal temp of 160 degrees with a thermometer. If they are together, add about 10 minutes."}, {"url": "http://www.bhg.com/recipes/how-to/cooking-basics/how-to-oven-bake-chicken-legs/", "passage_text": "Baking the Chicken: Preheat the oven to 400°F. Bake the chicken, uncovered, for 35 to 40 minutes or until the chicken is no longer pink inside. You can bake the chicken legs in a 375°F. oven, if desired. Increase the baking time to 45 to 50 minutes. Tip: An accurate way to check chicken doneness is to insert an instant-read thermometer into the thigh, avoiding the bone. It should read 180°F when the chicken is done."}, {"url": "http://www.food.com/recipe/baked-chicken-thighs-196990", "passage_text": "1 Dip chicken in butter/mustard and then pat crumbs on the chicken. 2  Place the chicken in a 9 X 13 baking dish and bake for 45 minutes-Note: if you use the legs with the thigh connected, use more time to cook. 1 On a plate, combine crumbs, cheese, parsley, salt and pepper. 2  Dip chicken in butter/mustard and then pat crumbs on the chicken. 3  Place the chicken in a 9 X 13 baking dish and bake for 45 minutes-Note: if you use the legs with the thigh connected, use more time to cook."}, {"url": "http://www.simplyrecipes.com/recipes/classic_baked_chicken/", "passage_text": "Pat the chicken pieces dry with a paper towel. Sprinkle all sides with salt. Let the chicken pieces sit for 15 to 20 minutes to take the chill off. 2 Preheat your oven to 400°F (205°C). Pat the chicken pieces dry with a paper towel. Rub olive oil over the chicken pieces and on the bottom of the roasting pan. Sprinkle the chicken pieces all over with black pepper and a little more salt. Arrange the chicken pieces in the pan so that all the pieces are skin-side up, and the largest pieces (the breasts) are in the center of the pan. Don't crowd the pan; allow room between the pieces. 3 Bake in the oven for 30 minutes at"}]