[{"url": "https://en.wikipedia.org/wiki/Dartington_Crystal", "passage_text": "Dartington Crystal underwent another Management Buy Out in April 2006, safeguarding many skilled jobs in the area. Dartington Crystal bought Scottish-based Caithness Glass out of receivership in October 2006 and also owns Royal Brierley Crystal which is based in the West Midlands. The business underwent a management buyout in 1994 from BTR, who had previously acquired the Rockware Group and Dartington Hall Trust sold their remaining stake in the business. The business was later acquired by US giftware giant Enesco in 2004, following the company briefly going into administration."}, {"url": "http://kidsloverocks.com/html/where_to_find_rocks.html", "passage_text": "Pyrite is a highly sought after by rock collectors for it’s shiny golden crystal structures. Pyrite makes an impressive display piece and it is one of the more common minerals that can be found. You can find Pyrite throughout the United States including California, Colorado, North Carolina, and Washington. As you saw in the section on What to Collect, there are hundreds of different types of rocks which can be collected. As a guide to your rock collection, we have showcased 48 gemstone and mineral specimens."}, {"url": "http://www.dartington.co.uk/", "passage_text": "We have been handcrafting our range of English crystal products in our factory in Devon since 1967 - the only major crystal factory in the UK. "}, {"url": "http://www.lotstodo.co.uk/attractions/art-heritage/dartington-crystal", "passage_text": "There is so much to offer at Dartington Crystal in Great Torrington. A fantastic visitor attraction, with something for all of the family... Take in the Factory Experience & Visitor Centre where you can see and hear the fascinating story of over 40 years of history with Dartington. there is something for everyone. To complete your visit, relax and unwind with a cup of fresh coffee and something tempting from the great choice of cakes and snacks on offer in our Pavilion Cafe. Kids Go Free and Parking is Free."}, {"url": "http://www.nytimes.com/1985/12/08/travel/shopper-s-world-sparkling-crystal-from-dartington.html", "passage_text": "Search 1,000+ destinations. To buy Dartington Glass, the only clear crystal manufactured in England, you can go to Tiffany's in New York or to Crate and Barrel stores in Massachusetts. (Sharon, the only Dartington design currently carried by Tiffany's, costs $42.50 a stem in the New York store, and may chosen in water goblets or stemware for claret, white wine and sherry.) Whimsy often seems to take over when Dartington's pieces are named."}, {"url": "http://www.nytimes.com/1985/12/08/travel/shopper-s-world-sparkling-crystal-from-dartington.html", "passage_text": "By LESLIE MANDEL-VINEY; Leslie Mandel-Viney, an American who lives in London, writes about the arts and travel. To buy Dartington Glass, the only clear crystal manufactured in England, you can go to Tiffany's in New York or to Crate and Barrel stores in Massachusetts. (Sharon, the only Dartington design currently carried by Tiffany's, costs $42.50 a stem in the New York store, and may chosen in water goblets or stemware for claret, white wine and sherry.) Whimsy often seems to take over when Dartington's pieces are named."}, {"url": "http://www.nytimes.com/1985/12/08/travel/shopper-s-world-sparkling-crystal-from-dartington.html", "passage_text": "SHOPPER'S WORLD. To buy Dartington Glass, the only clear crystal manufactured in England, you can go to Tiffany's in New York or to Crate and Barrel stores in Massachusetts. (Sharon, the only Dartington design currently carried by Tiffany's, costs $42.50 a stem in the New York store, and may chosen in water goblets or stemware for claret, white wine and sherry.) Whimsy often seems to take over when Dartington's pieces are named."}, {"url": "https://en.wikipedia.org/wiki/Dartington_Crystal", "passage_text": "Based in Torrington in north Devon, England, Dartington Crystal manufactures crystal glassware using traditional Swedish glass blowing techniques. Many of their ranges continue to be hand crafted in their North Devon factory and Dartington Crystal is now one of only a few crystal brands still producing in the UK. The business underwent a management buyout in 1994 from BTR, who had previously acquired the Rockware Group and Dartington Hall Trust sold their remaining stake in the business. The business was later acquired by US giftware giant Enesco in 2004, following the company briefly going into administration."}, {"url": "http://porreda.com/acatalog/porreda_engraved_glassware_personalised_glassware_Dartington_Crystal.html", "passage_text": "We can personalise these Dartington Crystal to your specification, for special occasions or events, you might want to have that event information added to the Dartington Crystal. You can convey your thanks for their loyalty and business with promotional crystal and glassware. Promotional crystal and glassware make excellent executive gifts. Porreda has a huge range of"}, {"url": "http://www.lotstodo.co.uk/attractions/art-heritage/dartington-crystal", "passage_text": "The Glass Shop offers a huge selection of first and second quality crystal & glass at bargain prices, you will also find products from the other Dartington Brands-Caithness Glass, Royal Brierley, John Beswick & Top Choice. there is something for everyone. To complete your visit, relax and unwind with a cup of fresh coffee and something tempting from the great choice of cakes and snacks on offer in our Pavilion Cafe. Kids Go Free and Parking is Free."}]