[{"url": "http://www.exchangerate.com/currency-information/the_currency_exchange_rate_used_for_guatemala_is_the_quetzal.html", "passage_text": "| Post | View. The quetzal (local pronunciation: [keˈtsal]; code: GTQ) is the currency of Guatemala. It is named after the national bird of Guatemala, the Resplendent Quetzal. In ancient Mayan culture, the quetzal bird's tail feathers were used as currency. It is divided into 100 cents, called centavos in legal Spanish or lenes in Guatemalan slang."}, {"url": "http://www1.american.edu/TED/quetzal.htm", "passage_text": "1 The Resplendent Quetzal, the brilliant bird found in the cloud forests of Central America, was sacred to the Mayans and figures prominently in their artwork and legends. 2  Today the Quetzal is the national bird of Guatemala, and name to the Guatemalan currency."}, {"url": "http://www.bornfreeusa.org/weblog_canada.php?p=3512&more=1", "passage_text": "This brings me to the second reason: It is a historical icon of liberty. Quetzals were revered by the Maya. Killing a quetzal was forbidden, so the tail feathers used by the Maya were collected or plucked (ouch!) from live birds who were then released."}, {"url": "http://www.doyouknowthisstamp.com/Stamps/Guatemala%20Quetzal%20(Long-tailed%20Trogon)", "passage_text": "When full adults, the Quetzals are largely solitary birds, even separating from their mate but reunite the following spring. They feed on fruits, berries, wild avocados, insects, small frogs and lizards. Guatemala’s Bird Currency In ancient Mayan culture, the Quetzal bird's tail feathers were used as currency. In modern Guatemala, the Quetzals are also known as the Guatemalan currency. Coins were issued in denominations of 1, 5, and 10 centavos, and ¼, ½ and 1 Quetzal. 100 centavos is equal to one Quetzal."}, {"url": "http://www.thejunglestore.com/Quetzals", "passage_text": "- The Resplendent Quetzal was sacred to the Mayans. To them it symbolized freedom and wealth. Their feathers were used as money, but killing Quetzals was forbidden. - Male Resplendent quetzals do not begin to grow their long tail plumes for three years."}]