[{"url": "http://www.theonequestion.com/lifepurposebooks/", "passage_text": "Books on Purpose. This is a collection of carefully selected books that will help you on your way to self-discovery. Next to each book there’s a short summary of what it’s about. Click on any book to get the full info. Now Discover Your Strengths. It is a book that helps you to identify your natural talents and teaches you to focus on what you can do best and ignore your weaknesses."}, {"url": "https://en.wikipedia.org/wiki/Book_burning", "passage_text": "In other cases, such as the Nazi book burnings, other copies of the destroyed books survive-but still, the instance of book burning becomes emblematic of a harsh and oppressive regime which is seeking to censor or silence an aspect of a nation's culture. "}, {"url": "http://answers.wikia.com/wiki/What_is_the_purpose_of_a_book_appendix", "passage_text": "The appendix is supplemental content that is added near the end of a book. The content in the appendix is seen as additional reference information that supports main material within the book. Categories 1  : Answered questions. 2  Books. The appendix is supplemental content that is added near the end of a book. The content in the appendix is seen as additional reference information that supports main material within the book. Categories :"}, {"url": "http://www.lotsofessays.com/viewpaper/1688390.html", "passage_text": "What is the purpose of a book? This is a complex question, for books have no purpose that is analogous to that of a plow or a needle. Books do many things, and also nothing at all in a practical sense-except perhaps to weight down papers and keep them from flying away. Books may serve one purpose for the writer and another for the reader-or rather one purpose for the writer and another purpose for each of the different readers who come to the text. This is not to say that the book is entirely unsuccessful: Some elements of it do work well, including the fact that this story is told in some measure as an epic story, a form of storytelling that is probably as old as humanity itself and that crosses cultural as well as historical bou..."}, {"url": "https://www.psychologytoday.com/blog/book-smart/201311/the-purpose-reading-seeking-the-why", "passage_text": "[3] The purpose of this blog is to talk about all things reading; the many things that need to be in place for children to learn to read, as well as the benefits that come about when children read to learn. Thank you for accompanying me on this journey! [1] Hume, D. (1955). "}, {"url": "http://thepicturebookteachersedition.blogspot.com/2012/03/importance-of-authors-purpose.html", "passage_text": "Author's purpose is simply the reason why the author wrote the story/book/article/blog post, etc. Four of the most common reasons for writing are: 1. to persuade, text type persuasive. 2. to inform, text type expository. The Importance of Author's Purpose. Here are 3 posters with the above questions to help guide students to the correct purpose.There is a link at the bottom of the post that will take you to my TpT store to download. If you are going to keep track of a group of books using a chart like the one below would be good. I always thought author's purpose was easy and kind of a waste of teaching time. We would just quickly skim over the purpose and never got into why's or how's of the purpose"}, {"url": "https://en.wikipedia.org/wiki/E-book_reader", "passage_text": "For other uses, see E-reader (disambiguation) . A third generation Kindle. A BEBook e-reader. An e-reader, also called an e-book reader or e-book device, is a mobile electronic device that is designed primarily for the purpose of reading digital e-books and periodicals. The reason given for this alarmingly precipitous decline is the rise of more general purpose tablets that provide e-book reading apps along with many other abilities in a similar form factor. In 2013, ABI Research claimed that the decline in the e-reader market was due to the aging of the customer base."}, {"url": "http://www.rachellegardner.com/the-purpose-of-books/", "passage_text": "I know for ME… books serve a purpose of both entertainment and escape. Instead of watching a movie… I'll sit down with a good book and let the movie play in my head. Yet other times, when everything seems overwhelming, I grab a book, shut my door, and just get a way for a while. If we are made in God's image, our books and stories' are made in the image of God's Word. So books, all books, are verbal extensions of the author's relationship to the Maker. That relationship may be vibrant, healthy and joyful and made whole by Christ. It may be broken, sinful and corrupting"}]