[{"url": "http://www.answers.com/Q/What_is_the_difference_between_genome_and_DNA", "passage_text": "The difference between DNA and a chromosome has to deal with an intermediary-genes. DNA is deoxyribonucleic acid, which is a nucleic acid. It is made up of four bases-adenin … e, cytosine, guanine and thymine. When these four bases are arranged in a segment, it is called a gene. Although DNA makes up the genome on an organism, what separates the two is the fact that genomes can be made up of either DNA or RNA. Due to this fact, DNA is merely a medium in which a genome can be made up with."}, {"url": "http://www.answers.com/Q/What_is_the_difference_between_genome_and_DNA", "passage_text": "In biology, the genome of an organism is the entire hereditary information that can be encoded by DNA, or for many different types of virus RNA. It is deoxyribonucleic acid (DNA) that contains the genetic instructions of organisms for development and functions. Although DNA makes up the genome on an organism, what separates the two is the fact that genomes can be made up of either DNA or RNA. Due to this fact, DNA is merely a medium in which a genome can be made up with."}, {"url": "http://humanorigins.si.edu/evidence/genetics", "passage_text": "A comparison of the entire genome, however, indicates that segments of DNA have also been deleted, duplicated over and over, or inserted from one part of the genome into another. When these differences are counted, there is an additional 4 to 5% distinction between the human and chimpanzee genomes. DNA is thus especially important in the study of evolution. The amount of difference in DNA is a test of the difference between one species and another – and thus how closely or distantly related they are."}, {"url": "http://www.answers.com/Q/What_is_the_difference_between_genome_and_DNA", "passage_text": "Also the genome contains the non-coding sequences and genes of the DNA itself. Although DNA makes up the genome on an organism, what separates the two is the fact that genomes can be made up of either DNA or RNA. Due to this fact, DNA is merely a medium in which a genome can be made up with."}, {"url": "https://answers.yahoo.com/question/index?qid=20080930213705AA7c2mw", "passage_text": "Genome is the full set of all chromosomes in an organism. Chromosome is coiled up DNA. Chromatin is are fibers consisting of DNA, RNA, and protein that coil up during cell replication to form chromosomes. Kinda already answered the what makes up what question. "}, {"url": "http://www.differencebetween.com/difference-between-gene-and-vs-genome/", "passage_text": "Gene and genome, both terms are associated with DNA and both terms are defined by using DNA molecule. DNA is the basic unit of heredity which is mainly found on chromosomes within the nucleus of cells or within other organelles. Usually these characteristics are encoded in the DNA (deoxyribonucleic acid) molecules present in their cells. Gene properties and genome properties vary widely from one species to another."}, {"url": "http://www.differencebetween.com/difference-between-gene-and-vs-dna/", "passage_text": "Gene vs DNA. The terms “DNA” and ‘gene’ are related, but they are not the same. There are some certain differences between these two terms but both are used in genetics very often. Both genes and DNA are considered as the genetic materials of many organisms and contain heredity information in almost all the organisms on Earth. Number of genes depends on the DNA number in a particular cell and the numbers vary widely among organisms. Therefore, a gene or set of genes determines the differences between individuals within a species as well as differences between species. Human genome consists of over 20,000 genes, and certain genes of humans are also found in other animals and even in certain plants"}, {"url": "http://www.differencebetween.com/difference-between-gene-and-vs-genome/", "passage_text": "• Gene is a segment or a portion of DNA molecule while genome is the total DNA content in a cell. • Genes code for proteins. Genome itself cannot code for proteins as it contains almost all the DNA. Since the gene is only a portion of a DNA molecule, that part is enough to code for proteins. Usually these characteristics are encoded in the DNA (deoxyribonucleic acid) molecules present in their cells. Gene properties and genome properties vary widely from one species to another."}, {"url": "http://www.genomenewsnetwork.org/resources/whats_a_genome/Chp1_4_1.shtml", "passage_text": "DNA. DNA is the molecule that is the hereditary material in all living cells. Genes are made of DNA, and so is the genome itself. A gene consists of enough DNA to code for one protein, and a genome is simply the sum total of an organism's DNA. DNA is long and skinny, capable of contorting like a circus performer when it winds into chromosomes."}]