[{"url": "https://www.nlm.nih.gov/medlineplus/ency/article/000026.htm", "passage_text": "1 This kind of radiation usually does not cause tissue damage. 2  Ionizing radiation is radiation that produces immediate chemical effects on human tissue. 3  X-rays, gamma rays, and particle bombardment (neutron beam, electron beam, protons, mesons, and others) give off ionizing radiation."}, {"url": "http://www.nationalbreastcancer.org/breast-cancer-radiation-therapy", "passage_text": "Radiation therapy (also called radiotherapy) uses high-energy rays to kill cancer cells. It affects cells only in the part of the body that is treated with the radiation."}, {"url": "https://www.nlm.nih.gov/medlineplus/ency/article/000026.htm", "passage_text": "Radiation sickness is illness and symptoms resulting from excessive exposure to ionizing radiation. There are two basic types of radiation: ionizing and nonionizing. 1  Nonionizing radiation comes in the form of light, radio waves, microwaves and radar."}, {"url": "http://www.nationalbreastcancer.org/breast-cancer-radiation-therapy", "passage_text": "Most radiation therapy is administered by a radiation oncologist at a radiation center and usually begins three to four weeks after surgery. The radiation is used to destroy undetectable cancer cells and reduce the risk of cancer recurring in the affected breast."}, {"url": "https://www.health.ny.gov/publications/4402/", "passage_text": "Radiation that can produce ions when it interacts with matter is called ionizing radiation. Ions are the charged particles that are produced when electrons are removed from their positions in the atoms. Alpha particles, beta particles, x-rays and gamma rays are forms of"}, {"url": "http://www.nrc.gov/about-nrc/radiation/health-effects/radiation-basics.html", "passage_text": "Radiation Basics. Radiation is energy given off by matter in the form of rays or high-speed particles. All matter is composed of atoms. Atoms are made up of various parts; the nucleus contains minute particles called protons and neutrons, and the atom's outer shell contains other particles called electrons."}, {"url": "http://www.atomicarchive.com/Effects/effects15.shtml", "passage_text": "Certain body parts are more specifically affected by exposure to different types of radiation sources. Several factors are involved in determining the potential health effects of exposure to radiation."}, {"url": "http://www.cancer.org/treatment/treatmentsandsideeffects/treatmenttypes/radiation/radiationtherapy-whatitishowithelps/radiation-therapy-what-it-is-side-effects", "passage_text": "Or if you get radiation to your chest, you might have a cough or sore throat. Most side effects go away in time. But there are ways to help you feel better. If you have bad side effects, the doctor may stop your treatments for a while, change the schedule, or change the type of treatment you are getting."}, {"url": "http://www.nationalbreastcancer.org/breast-cancer-radiation-therapy", "passage_text": "Note: There are special situations in which radiation is used for women with metastatic breast cancer experiencing painful bone metastasis. This section however focused on the use of radiation for adjuvant therapy (treatment given after the main treatment to lower the chance of breast cancer returning)."}]