[{"url": "http://southamericanfood.about.com/od/maincourses/r/beefanticuchos.htm", "passage_text": "The most traditional Peruvian anticuchos are made with beef heart, but they can also be made with chicken (anticuchos de pollo) or steak. Anticuchos are seasoned with garlic, vinegar, cumin, and aji panca, a mild red chile pepper with a smoky flavor common in Peruvian cooking. You can often find dried aji panca or jarred aji panca paste in specialty stores or Latin food markets. Anticuchos are best if they are marinated overnight."}, {"url": "http://www.myrecipes.com/recipe/anticuchos-peruvian-beef-kebabs", "passage_text": "Preparation. To prepare the beef, combine first 7 ingredients in a large bowl; toss well. Cover and chill 3 hours. To prepare fiery rub, combine 1 teaspoon paprika, 1 teaspoon salt, 1/2 teaspoon pepper, turmeric, and parsley. Prepare grill. Remove beef from bowl, discarding marinade. Thread beef onto each of 6 (10-inch) skewers."}, {"url": "http://perudelights.com/anticuchos-cows-heart-kebabs-flavor-on-a-stick/", "passage_text": "They all grew up watching anticucheras-the women who cook and sell anticuchos on the streets-surrounded by big clouds of smoke and a bunch of customers ready to be delighted by these meaty morsels, plain boiled potatoes, boiled fresh corn, and several aji ají. sauces 1 Cut in squares of 1 ½ inch by side. 2  In a bowl, combine aji ají panca, paste, garlic, vinegar, oregano, oil, salt and. 3  Cumin add the heart, cubes and marinate for at least three. 4  Hours make a brush with fresh corn, husks to baste the. "}, {"url": "https://illapuperu.wordpress.com/2010/08/27/what-does-anticucho-mean/", "passage_text": "Linguists argue that it comes from the Quechua word antic-uchu, a name given by ancient Peruvians to a very hot soup, prepared with a special pepper from the jungle. What we know for sure is that Anticuchos are a popular and delicious dish originated in Peru, and consisting of small pieces of grilled skewered meat. If you are in Peru you can find Anticuchos on street-carts and street food stalls (anticucheras). "}, {"url": "http://southamericanfood.about.com/od/maincourses/r/anticuchopollo.htm", "passage_text": "In Peru this seasoning is traditional for making grilled beef heart (regular anticuchos). It's wonderful for steaks too. Serve anticuchos de pollo with rice and grilled corn on the cob. This dish is made with aji panca, a mild red chile pepper with a smoky flavor common in Peruvian cooking. "}, {"url": "https://en.wikipedia.org/wiki/Anticuchos", "passage_text": "Anticuchos (singular anticucho, Quechua for Cut Stew Meat) are popular and inexpensive dishes that originated in Peru in the pre-Columbian era; other Andean states, such as Chile and Bolivia, adopted the recipe. The modern dish was adapted during the colonial era between the 16th and 19th centuries. According to the text file from the National Library in Lima (Peru), it is believed that the term comes from the Quechua antikuchu (anti : 'Andes' + kuchu : 'court' or uchu : 'porridge, mix'). The writer Erika Fetzer mentions that according to tradition, anticuchos were prepared with meat and flame."}, {"url": "http://perudelights.com/anticuchos-cows-heart-kebabs-flavor-on-a-stick/", "passage_text": "To obtain the best anticuchos the meat should be perfectly cleaned, cut and seasoned. It needs to marinate in a mixture of aji ají, (panca which adds not only heat but that smoky and earthy flavor of dried chili pepper as), well, garlic, cumin, vinegar salt and. pepper 1 Cut in squares of 1 ½ inch by side. 2  In a bowl, combine aji ají panca, paste, garlic, vinegar, oregano, oil, salt and. 3  Cumin add the heart, cubes and marinate for at least three. 4  Hours make a brush with fresh corn, husks to baste the. "}, {"url": "https://en.wikipedia.org/wiki/Anticuchos", "passage_text": "Anticuchos can be traced as far back as the 16th century, when they were first encountered by the Spanish conquistadors. It was at this time that European ingredients such as garlic were added, and beef began to replace the traditional llama that was used at the time of the Inca Empire. According to the text file from the National Library in Lima (Peru), it is believed that the term comes from the Quechua antikuchu (anti : 'Andes' + kuchu : 'court' or uchu : 'porridge, mix'). The writer Erika Fetzer mentions that according to tradition, anticuchos were prepared with meat and flame."}, {"url": "https://en.wikipedia.org/wiki/Anticuchos", "passage_text": "Anticuchos can be found on street-carts and street food stalls (anticucheras). The meat may be marinated in vinegar and spices (such as cumin, aji ají pepper and). Garlic while anticuchos can be made of any type of, meat the most popular are made of beef (heart anticuchos de). corazon corazón According to the text file from the National Library in Lima (Peru), it is believed that the term comes from the Quechua antikuchu (anti : 'Andes' + kuchu : 'court' or uchu : 'porridge, mix'). The writer Erika Fetzer mentions that according to tradition, anticuchos were prepared with meat and flame."}, {"url": "https://en.wikipedia.org/wiki/Anticuchos", "passage_text": "Anticuchos are, usually not the main course of a meal, but rather an accompaniment to grilled meats along with other side dishes such as choripanes, potatoes, sausages and salads. Variants include smaller sticks of wood; those 15 cm or less are called meat skewers.. Anticuchos are part of traditional Peruvian cuisine. According to the text file from the National Library in Lima (Peru), it is believed that the term comes from the Quechua antikuchu (anti : 'Andes' + kuchu : 'court' or uchu : 'porridge, mix'). The writer Erika Fetzer mentions that according to tradition, anticuchos were prepared with meat and flame."}]