[{"url": "http://travel.nationalgeographic.com/travel/countries/nigeria-facts/", "passage_text": "The population is as diverse as it is large, with some 250 ethnic groups. Nigeria's three largest ethnic groups are: Hausa-Fulani (29 percent of the population), Yoruba (21 percent) and Igbo, or Ibo (18 percent). "}, {"url": "http://www.pbs.org/newshour/updates/africa-jan-june07-ethnic_04-05/", "passage_text": "The largest of the major ethnic groups, Hausa and Fulani have been politically dominant since Nigeria’s independence from Britain in 1960. Islam is a key component of their ethnic identity and continues to inform their role in modern Nigerian society and politics. Igbo. The Igbo, the main ethnic group in southeastern Nigeria, has represented some of the staunchest opponents of Sharia law. In many northern Hausa-Fulani-dominated states, minority populations of Igbo claim to have been unfairly targeted by laws that do not pertain to their faith."}, {"url": "http://www.pbs.org/newshour/updates/africa-jan-june07-ethnic_04-05/", "passage_text": "Yoruba. The Yoruba are one of Nigeria’s most urban ethnic groups. Historically, their culture centered on densely populated city-states each controlled by an oba, or king. Yoruba now form the majority in Lagos, the second most populous city in Africa. Igbo. The Igbo, the main ethnic group in southeastern Nigeria, has represented some of the staunchest opponents of Sharia law. In many northern Hausa-Fulani-dominated states, minority populations of Igbo claim to have been unfairly targeted by laws that do not pertain to their faith."}, {"url": "http://www.countriesquest.com/africa/nigeria/the_people_of_nigeria/ethnicity.htm", "passage_text": "The People of Nigeria, Ethnicity. Nigeria s three largest ethnic groups, the Hausa Fulani, Yoruba, and Igbo, represent 71 percent of the population (although as in most of Africa, ethnic labels are often imprecise, obscuring differences within groups and similarities among groups). The remaining 300-plus ethnic groups account for the final one-fifth of the population. The Hausa, concentrated in the far north and in the Republic of Niger, are the largest of Nigeria s ethnic nations. Most Hausa are Muslims engaged in agriculture, commerce, and small-scale industry. While most live in smaller towns and villages, others occupy several larger indigenous cities"}, {"url": "http://nigerianostalgia.tumblr.com/post/63489648891/ethnicity-in-nigeria", "passage_text": "Ethnicity is one of the keys to understanding Nigeria’s pluralistic society. It distinguishes groupings of peoples who for historical reasons have come to be seen as distinctive–by themselves and others–on the basis of locational origins and a series of other cultural markers. "}, {"url": "http://countrystudies.us/nigeria/37.htm", "passage_text": "Nigeria Table of Contents. Ethnicity is one of the keys to understanding Nigeria's pluralistic society. It distinguishes groupings of peoples who for historical reasons have come to be seen as distinctive--by themselves and others--on the basis of locational origins and a series of other cultural markers. "}, {"url": "http://www.pbs.org/newshour/updates/africa-jan-june07-ethnic_04-05/", "passage_text": "Hausa-Fulani. Muslim Hausa and Fulani are the predominant ethnic groups in Nigeria’s northern region. Though the groups originated in different parts of West Africa, religion, intermarriage and adoption of the Hausa language by the Fulani have unified the groups over time. Igbo. The Igbo, the main ethnic group in southeastern Nigeria, has represented some of the staunchest opponents of Sharia law. In many northern Hausa-Fulani-dominated states, minority populations of Igbo claim to have been unfairly targeted by laws that do not pertain to their faith."}, {"url": "https://en.wikipedia.org/wiki/Demographics_of_Nigeria", "passage_text": "This article is about the demographic features of the population of Nigeria, including population density, ethnicity, education level, health of the populace, economic status, religious affiliations and other aspects of the population. The most numerous ethnic groups in the northern two-thirds of the country are the Hausa and the Fulbe/Fulani, the overwhelming majority of whom are Muslim. Other major ethnic groups of the north are the Nupe, Tiv, and Kanuri."}, {"url": "https://en.wikipedia.org/wiki/Nigeria", "passage_text": "The Federal Republic of Nigeria, commonly referred to as Nigeria /naɪˈdʒɪəriə/ , is a federal constitutional republic in West Africa, bordering Benin in the west, Chad and Cameroon in the east, and Niger in the north. Its coast in the south lies on the Gulf of Guinea in the Atlantic Ocean. Nigeria is often referred to as the Giant of Africa, owing to its large population and economy. With approximately 174 million inhabitants, Nigeria is the most populous country in Africa and the seventh most populous country in the world."}]