[{"url": "http://www.travelmath.com/drive-distance/from/Waco,+TX/to/Richardson,+TX", "passage_text": "Map of driving directions from Waco, TX to Richardson, TX. Click here to show map. Drag the line on the map to calculate the driving distance for a different route. If you want to verify these driving directions or look for another possible route, you can try. Google Maps, Bing Maps, or MapQuest. It ends in Richardson, Texas. If you are planning a road trip, you might also want to calculate the total driving time from Waco, TX to Richardson, TX so you can see when you'll arrive at your destination."}, {"url": "https://en.wikipedia.org/wiki/Richardson,_TX", "passage_text": "Richardson is a city in Dallas and Collin counties in the State of Texas. As of the 2010 census, the city had a total population of 99,223. In 2014 the population was estimated to be 108,617. In 2009, Business Week's annual report on the Best Places to Raise Kids, ranked Richardson in 2nd place in Texas. Richardson was the first North Texas city recognized as a best workplace for commuters by the United States Environmental Protection Agency and the United States Department of Transportation in 2004."}, {"url": "http://www.distance-cities.com/distance-dallas-tx-to-waco-tx", "passage_text": "Distance from Dallas, TX to Waco, TX. There are miles from Dallas to Waco and miles by car. Dallas and Waco are far apart (by car). This is the best Dallas, TX-Waco, TX route. Distance to cities nearby Waco, TX. 1  Distance from Waco, TX to Beverly Hills, TX. 2  Distance from Waco, TX to Bellmead, TX. 3  Distance from Waco, TX to Axtell, TX. 4  Distance from Waco, TX to Aquilla, TX. 5  Distance from Waco, TX to Abbott, TX. 6  Distance from Dallas"}, {"url": "https://en.wikipedia.org/wiki/Waco,_TX", "passage_text": "Waco /ˈweɪkoʊ/ is a city which is the county seat of McLennan County, Texas, United States. It is situated along the Brazos River and I-35, halfway between Dallas and Austin. The city had a 2010 population of 124,805, making it the 22nd-most populous city in the state. The US Census 2014 population estimate is 130,194. In 1964, the Texas Department of Public Safety designated Waco as the site for the state-designated official museum of the legendary Texas Rangers law enforcement agency founded in 1823."}, {"url": "http://www.travelmath.com/drive-distance/from/Waco,+TX/to/Richardson,+TX", "passage_text": "The total driving distance from Waco, TX to Richardson, TX is 111 miles or 179 kilometers. Your trip begins in Waco, Texas. It ends in Richardson, Texas. If you are planning a road trip, you might also want to calculate the total driving time from Waco, TX to Richardson, TX so you can see when you'll arrive at your destination."}, {"url": "http://www.travelmath.com/drive-distance/from/Richardson,+TX/to/Waco,+TX", "passage_text": "Driving distance from Richardson, TX to Waco, TX. The total driving distance from Richardson, TX to Waco, TX is 110 miles or 177 kilometers. Your trip begins in Richardson, Texas. It ends in Waco, Texas. If you are planning a road trip, you might also want to calculate the total driving time from Richardson, TX to Waco, TX so you can see when you'll arrive at your destination. "}, {"url": "https://en.wikipedia.org/wiki/Waco,_TX", "passage_text": "The Waco Metropolitan Statistical Area consists of McLennan and Falls Counties, which had a 2010 population of 234,906. Falls County was added to the Waco MSA in 2013. The US Census 2014 population estimate for the Waco MSA is 260,430. In 1964, the Texas Department of Public Safety designated Waco as the site for the state-designated official museum of the legendary Texas Rangers law enforcement agency founded in 1823."}, {"url": "https://en.wikipedia.org/wiki/Waco,_TX", "passage_text": "The Texas Tenth Court of Appeals is located in the McLennan County Courthouse in Waco. The Waco Fire Department operates 14 fire stations throughout the city. The Texas Department of Criminal Justice operates the Waco Parole Office in Waco. In 1964, the Texas Department of Public Safety designated Waco as the site for the state-designated official museum of the legendary Texas Rangers law enforcement agency founded in 1823."}, {"url": "https://en.wikipedia.org/wiki/Richardson,_TX", "passage_text": "In 2006, Richardson was ranked as the 15th best place to live in the United States by Money magazine. This ranked Richardson the 3rd best place to live in Texas. In 2007, the Morgan Quitno 14th Annual America's Safest and Most Dangerous Cities Awards pronounced Richardson the 69th safest city in America. In the same study Richardson ranked the 5th safest city in Texas. In 2008, Richardson was ranked as the 18th best place to live in the United States by Money magazine. This ranked Richardson the 4th best place to live in Texas. In 2009, Business Week's annual report on the Best Places to Raise Kids, ranked Richardson in 2nd place in Texas. Richardson was the first North Texas city recognized as a best workplace for commuters by the United States Environmental Protection Agency and the United States Department of Transportation in 2004."}]