[{"url": "http://english.stackexchange.com/questions/29254/whats-the-difference-between-requester-and-requestor", "passage_text": "COCA for requester/requestor indicates that requester is used for people and requestor is used in technical senses like a part of a program. A google ngram for requester/requestor shows that requester is also a bit more common. With one exception [1] I don't think there is a nuanced difference here but rather multiple formations of the same concept. As you noted, requester is more common than requestor"}, {"url": "http://www.thefreedictionary.com/requesters", "passage_text": "request. Request can be a noun or a verb. 1. used as a noun. When someone asks for something to be done or provided, you can say that they make a request. My friend made a polite request. The Minister had granted the request. You say that someone makes a request for something. He agreed to my request for help. 2. a. the act or an instance of requesting, esp in the form of a written statement; petition or solicitation: a request for a song. b. (as modifier): a request programme. 3. at the request of in accordance with the specific demand or wish of (someone)."}, {"url": "http://www.yourdictionary.com/requestor", "passage_text": "The definition of a requestor is someone who asks for something. An example of a requestor is a child who asks his mother if she will order pizza for dinner. Words near requestor in the dictionary. 1  requestion. 2  requestioned. 3  requestioning. 4  requestions. 5  requestor. 6  requestors. 7  requestress. 8  requests. 9  requests-for-admission. 10  requests-for-production."}, {"url": "http://www.yourdictionary.com/requester", "passage_text": "Public Private. noun. Requester is defined as the person who asks for something or who makes a request. An example of a requester is a person who asked the library to order a book for him. "}, {"url": "http://baptisthealth.net/en/physicians/documents/faculty%20forms/2013%20revised%20forms/w9%20form.pdf", "passage_text": "Certify that you are not subject to backup withholding, or. Note. If a requester gives you a form other than Form W-9 to request your TIN, you must use the requester’s form if it is substantially similar to this Form W-9. Definition of a U.S. person. For federal tax purposes, you are considered a U.S. person if you are:"}, {"url": "http://docs.oracle.com/cd/E39583_01/fscm92pbr0/eng/fscm/fspr/task_DefiningRequesters-9f10bc.html", "passage_text": "Page Name. Definition Name. Navigation. Usage. Requester Setup. REQUESTOR_TBL. select Set Up Financials/Supply Chain, then select Product Related, then select Procurement Options, then select Purchasing, then select Requester Setup, then select Requester Setup. Establish default information for requesters. Defining Requesters. To define requesters, use the Requester Setup component (REQUESTOR_TBL). Use the REQUESTOR_TBL_CI component interface to load data into the tables for these components. This section discusses how to establish requesters and defaults."}, {"url": "http://english.stackexchange.com/questions/29254/whats-the-difference-between-requester-and-requestor", "passage_text": "Both are in dictionaries. I've heard people insist requester is correct for a person who requests something, and that requestor is wrong there, leaving me to wonder how it is used. Requestor happens to be marked as an error in my browser's spellchecker. With one exception [1] I don't think there is a nuanced difference here but rather multiple formations of the same concept. As you noted, requester is more common than requesto"}]