[{"url": "http://work.chron.com/much-pediatric-nurse-make-per-hour-10830.html", "passage_text": "Average Nursing Pay in the United States. According to the Bureau of Labor Statistics, registered nurses earned an average of $33.23 per hour across all specialties as of May 2011, and a mean annual income of about $69,110. However, the practice area of a nurse can have a large impact on expected salary."}, {"url": "http://www.healthcare-salaries.com/nursing/pediatric-nurse-practitioner-salary", "passage_text": "The hourly rate for Pediatric Nurse Practitioner depends on number of years of experience. Pediatric Nurse Practitionerswith 1 to 4 years of work experience take home a national average hourly pay of around $39.38. Those with 5 to 9 years of experience receive a national hourly pay of around $39.57."}, {"url": "http://www.healthcare-salaries.com/nursing/pediatric-nurse-salary", "passage_text": "Average Pediatric Nurse Salary. According to Payscale, the average median wage of Pediatric Nurse in the United States is from between $31,311 to $81,840 per year while the hourly average earning is from between $31,311 – $81,840."}, {"url": "http://www.healthcare-salaries.com/nursing/pediatric-nurse-practitioner-salary", "passage_text": "Average pediatric nurse practitioner salary. A Pediatric Nurse Practitioner in the United States gets to collect an average income from between $59,352 to $109,355 per year. A Pediatric Nurse Practitioner can earn up to around $120,000 per annum including profit sharing and benefits/perks."}, {"url": "http://www.nursingexperts.com/how-much-does-a-pediatric-nurse-make/", "passage_text": "What is the average pediatric nurse salary. In the United States the average nursing pay for pediatric nurses according to the data released by the Bureau of Labor Statistics is $31 per hour which results to about $48,000 a year."}, {"url": "http://www.healthcare-salaries.com/nursing/pediatric-nurse-salary", "passage_text": "A newly practicing pediatric nurse in the US receives a beginning yearly salary of around $31,311 but as he/she gains experience, he/she can anticipate a yearly income of up to $81,840. The national hourly rate for Pediatric Nurse is from between $15.53 to $35.81 with an average overtime pay of $6.93 to $54.59 per hour."}, {"url": "http://www.healthcare-salaries.com/nursing/pediatric-nurse-practitioner-salary", "passage_text": "Pediatric Nurse Practitioner’s average income (pediatric nurse practitioner salary) in the United States is from between $59,352 to $109,355 per year. The national median hourly rate for all Pediatric Nurse Practitioners is $41.14."}]