[{"url": "https://answers.yahoo.com/question/index?qid=20080411142946AA5RVuO", "passage_text": "I always cook my steaks-especially my rib eye steaks in the oven. I set the temperature to 400º and place my steaks on a metal tray. I season them with black pepper and garlic powder. Then I cook them for 10 minutes on the first side, turn them over and cook them 10 minutes on the second side."}, {"url": "http://ourbestbites.com/2011/08/how-to-grill-the-perfect-steak/", "passage_text": "2. Let steaks sit at room temperature for about 10-15 minutes while your grill is pre-heating. Trim fat off around edge of steak and season liberally with kosher salt and fresh cracked pepper on both sides. 3. Heat your grill to a very hot temperature."}, {"url": "http://www.howaboutbarbeque.com/temperature.html", "passage_text": "You will have to calculate this time into your cooking equation. One of the most popular cooking techniques for that steak is to sear it on the grill right at the beginning, at a high grill temperature. In my experience, the colder that steak is, the less effective that sear is going to be."}, {"url": "http://www.chowhound.com/recipes/basic-grilled-rib-eye-22586", "passage_text": "Instructions. 1  1 Remove the steak from the refrigerator and let it come to room temperature, about 30 to 45 minutes. 2  2 Heat a gas or charcoal grill to high (about 450°F to 550°F) and rub the grates with a towel dipped in vegetable oil. 3  Meanwhile, season the steak on all sides with salt and pepper."}, {"url": "https://answers.yahoo.com/question/index?qid=20080411142946AA5RVuO", "passage_text": "Report Abuse. I always cook my steaks-especially my rib eye steaks in the oven. I set the temperature to 400º and place my steaks on a metal tray. I season them with black pepper and garlic powder. Then I cook them for 10 minutes on the first side, turn them over and cook them 10 minutes on the second side."}, {"url": "http://www.grillingcompanion.com/recipe/grilled_ribeye_steak/", "passage_text": "Continue to grill with the lid open for about 4 - 6 minutes. Flip the steaks over onto the other side, still over the hottest part of the grill. Grill the rib eye steaks for an additional 4 - 6 minutes on the other side, lid open, for a medium-rare delicious steak."}, {"url": "http://www.answers.com/Q/At_what_temperature_should_you_cook_a_steak_on_the_George_Foreman_grill", "passage_text": "A 1 inch boneless rib eye, tenderloin, or top loin steak should be cooked for 6-8 minutes on the George Foreman Grill (covered) at 350 degrees F to 375 degrees F for medium rare. If you are cooking uncovered it should be 8-11 minutes."}, {"url": "http://www.chowhound.com/recipes/basic-grilled-rib-eye-22586", "passage_text": "1 1 Remove the steak from the refrigerator and let it come to room temperature, about 30 to 45 minutes. 2  2 Heat a gas or charcoal grill to high (about 450°F to 550°F) and rub the grates with a towel dipped in vegetable oil. 3  Meanwhile, season the steak on all sides with salt and pepper."}]