[{"url": "http://www.answers.com/Q/How_many_seconds_long_was_the_longest_vocal_note_ever_held", "passage_text": "World record for longest note held on guitar? Trey Anastasio (guitarist for the band Phish) held a note for roughly 2 minutes 52 seconds during the song Harry Hood on 11/16/96, from 4:56 to 7:48. Well I don't know how the world's longest time, but I held my urine for 18 hours with the reward of $150 from my older brother! I don't know if that answers your question, but … I certainly am unduly positive that that's the longest I'VE ever heard... 3 people found this useful. Answered."}, {"url": "http://www.funtrivia.com/askft/Question46792.html", "passage_text": "The average individual singer, if properly trained, should be able to hold a note for as long as ten or fifteen seconds, depending on where the note is in the singer's register. The longest note I've ever held on record was a low D, in a piece which I wrote and sang. The longest note in the repertoire is a high pedal point sung at the climax of Beethoven's 9th symphony. This note usually lasts about 15 seconds, but given that it is a choral part, singers can easily split it up without making it sound split up."}, {"url": "http://www.guinnessworldrecords.com/world-records/longest-continuous-vocal-note/", "passage_text": "The longest continual vocal note was held for 1 min 43 sec, by Richard Fink IV (USA), at GFI Studios, Webster, New York, USA on 8 September 2009. The note held was Bb. "}, {"url": "http://www.funtrivia.com/askft/Question46792.html", "passage_text": "Bill Withers wins it on another site for Lovely Day, ergo the pun. Longest Note Held In A Hit. This record is held by Morten Harket, lead singer with group A-Ha. In Summer Moved On (no. 33, June 2000) he holds a vocal note for 20.2 seconds. The longest note in the repertoire is a high pedal point sung at the climax of Beethoven's 9th symphony. This note usually lasts about 15 seconds, but given that it is a choral part, singers can easily split it up without making it sound split up."}, {"url": "http://www.answers.com/Q/How_long_is_the_longest_note_ever_held", "passage_text": "What was the longest note held on a saxophone? Kenny G played an E-flat for 45 minutes and 47 seconds in J&R Music World in New York City setting a new world record for longest held note on a saxophone. Well I don't know how the world's longest time, but I held my urine for 18 hours with the reward of $150 from my older brother! I don't know if that answers your question, but … I certainly am unduly positive that that's the longest I'VE ever heard... 3 people found this useful."}, {"url": "http://www.funtrivia.com/askft/Question101376.html", "passage_text": "Longest Note Held In A Hit -- This record is held by Morten Harket, lead singer with group A-Ha. In Summer Moved On (no. 33, June 2000) he holds a vocal note for 20.2 seconds. http://www.everyhit.com/record7.html. http://en.wikipedia.org/wiki/Morten_Harket. Usher -- The sexy, suave singer says he would like to break another Guinness World Record by holding the longest note ever."}, {"url": "http://boards.straightdope.com/sdmb/archive/index.php/t-497935.html", "passage_text": "12-17-2008, 11:31 AM. My husband insists that Bill Withers holds the world's record for longest sustained note on a pop song for his a lovely daaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaay in the song of the same name (Lovely Day). He offers no proof. He just knows. 12-17-2008, 11:47 AM. My husband insists that Bill Withers holds the world's record for longest sustained note on a pop song for his a lovely daaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaay in the song of the same name (Lovely Day)."}, {"url": "http://www.funtrivia.com/askft/Question46792.html", "passage_text": "What was the longest note held on a record by a singer? What was the longest note held on a record by a singer? The longest note in the repertoire is a high pedal point sung at the climax of Beethoven's 9th symphony. This note usually lasts about 15 seconds, but given that it is a choral part, singers can easily split it up without making it sound split up."}]