[{"url": "http://serc.carleton.edu/eslabs/carbon/6a.html", "passage_text": "2 molecules to calcium carbonate (CaCO 3) molecules. Now, take a big breath and then exhale. Describe how carbon atoms from the CO2 you exhaled could end up in the shells of a shell-building organism such as a lobster or clam. Part A: The Ocean Carbon Cycle. Oceans have a large capacity to absorb CO 2, thus reducing the amount of CO 2 in the atmosphere and bringing carbon atoms into the ocean system. Many CO 2 molecules that diffuse into ocean sea surface waters diffuse back to the atmosphere in very short time scales."}, {"url": "http://www.answers.com/Q/How_many_oxygen_atoms_are_present_in_a_molecule_of_calcium_carbonate", "passage_text": "The three elements are Calcium (C); Carbon (Ca); and oxygen (O).   Atomic numbers:   Calcium is 20.   Carbon is 6.   Oxygen is 8.   There's one carbon atom … , one calcium atom, and three oxygen atoms. A molecule of fructose contains 6 carbon atoms, 6 oxygen atoms, and 12 hydrogen atoms."}, {"url": "http://www.wisegeek.org/what-is-calcium-carbonate.htm", "passage_text": "Calcium carbonate is an important chemical compound made up of one atom of calcium bonded to one atom of carbon and three atoms of oxygen. Its molecular formula is CaCO 3. "}, {"url": "http://kidneystones.uchicago.edu/calcium-binding-by-citrate/", "passage_text": "The hydrogen atoms are necessary because every carbon atom makes four bonds. After that, is the third carbon which is very occupied. It has an oxygen which is itself bound to a hydrogen – a hydroxyl molecule, really 2/3 of a water molecule – and another carbon bound to two oxygens, one of which has a negative charge. The calcium citrate crystal is built up out of repeating units, each of which is a pair of citrate molecules linked by a calcium atom. This ‘di-citrate’ unit has three calcium atoms in it, one in the center, which is unique, and one at each end which mirror each other."}, {"url": "http://wiredcosmos.com/2014/05/28/atoms-ions-and-molecules-whats-the-difference/", "passage_text": "So, in a regular Calcium atom, there are 20 protons, 20 neutrons and 20 electrons. The electrons orbit around the nucleus and have a negative charge. An isotope is a version of the element with a different number of neutrons. When the number of protons differs from the number of electrons, you have an ionic charge. A Calcium atom with 20 protons and 18 electrons has a charge of 2+ because it has 2 extra protons, which have a positive charge. A charged atom is called an ion. When the charge is positive, it is called an cation."}, {"url": "http://www.answers.com/Q/What_is_calcium_carbon_oxygen", "passage_text": "There is no compound CaCO. Since carbon and oxygen are non-metals, the only compounds they are likely to form with calcium are ionic compounds. So that would require making an anion out of carbon and oxygen. The only polyatomic anion that you can get from carbon and oxygen is carbonate, CO32-. So the calcium carbon oxygen that you might be referring to is calcium carbonate, CaCO3."}, {"url": "https://en.wikipedia.org/wiki/Calcium_carbonate", "passage_text": "Calcium carbonate is a chemical compound with the formula Ca C O 3. It is formed by three main elements: carbon, oxygen and calcium. It is a common substance found in rocks in all parts of the world, and is the main component of shells of marine organisms, snails, coal balls, pearls, and eggshells. Calcium carbonate is the active ingredient in agricultural lime, and is created when calcium ions in hard water react with carbonate ions creating limescale. It is commonly used medicinally as a calcium supplement or as an antacid, but excessive consumption can be hazardous."}, {"url": "http://kidneystones.uchicago.edu/calcium-binding-by-citrate/", "passage_text": "Citrate has two ways to bind calcium. A single molecule can bind one calcium atom. Two citrate molecules together can bind one calcium atom. So the ratio is 1.5 calcium atoms per molecule of citrate (3 atoms/2 citrate molecules). The calcium citrate crystal is built up out of repeating units, each of which is a pair of citrate molecules linked by a calcium atom. This ‘di-citrate’ unit has three calcium atoms in it, one in the center, which is unique, and one at each end which mirror each other."}, {"url": "http://www.answers.com/Q/What_is_calcium_carbon_oxygen", "passage_text": "The formula for calcium carbonate, CaCO3, indicates that one molecule consists of a calcium atom, a carbon atom, and three oxygen atoms. So that would require making an anion out of carbon and oxygen. The only polyatomic anion that you can get from carbon and oxygen is carbonate, CO32-. So the calcium carbon oxygen that you might be referring to is calcium carbonate, CaCO3."}]