[{"url": "http://nortontooby.com/topics/domestic_violence", "passage_text": "A conviction of any one of a family of “domestic violence” offenses will trigger deportation, but not inadmissibility. [1] This ground requires a conviction, so all defenses against a disposition being considered a conviction would apply to prevent removal. See § 22.12, infra; Chapter 7, supra."}, {"url": "http://nortontooby.com/topics/domestic_violence", "passage_text": "Solutions in Domestic Violence Cases. Immigration lawyers must learn the rules so they can argue in immigration court that a given conviction is not an aggravated felony, and so avoid the aggravated felony immigration consequences. These arguments are given in Safe Havens §§ 7.147-7.157 (2005)."}, {"url": "http://blog.mikebakerlaw.com/2007/09/domestic-battery-conviction-illinois.html", "passage_text": "Felony aggravated domestic battery is a crime involving moral turpitude (CIMT), an aggravated felony (only if one year of jail or more is actually imposed), and constitutes a domestic violence ground for deportation."}, {"url": "http://asianjournal.com/immigration/immigration-consequences-of-domestic-violence-convictions/", "passage_text": "A criminal conviction for domestic violence might affect an alien’s eligibility for immigration relief or benefit. This conviction might qualify as a ground for inadmissibility under crime involving moral turpitude (CIMT). It might also qualify as a ground for deportability under aggravated felony or domestic violence. Grounds for inadmissibility disqualify an alien who is trying to enter the US from getting a visa or admission. Grounds for deportability make an alien who has already been admitted into the US susceptible to removal."}, {"url": "http://www.ilrc.org/files/documents/9_violence_dv_child_abuse_2014_final.pdf", "passage_text": "To avoid the aggravated felony consequence, counsel must obtain a sentence of 364 days or less for any single count of a crime of violence. For instructions on how to accept more than a year in jail while taking 364 days or less on any single count for immigration purposes, see § N.4 Sentences."}, {"url": "http://www.nolo.com/legal-encyclopedia/is-immigrant-convicted-domestic-violence-deportable.html", "passage_text": "Domestic Violence May Also Lead to Deportability as an “Aggravated Felony”. Yet another portion of Section 237 of the I.N.A. states that an immigrant can be deported for having been convicted of an aggravated felony at any time after being admitted to the United States."}, {"url": "http://www.nolo.com/legal-encyclopedia/is-immigrant-convicted-domestic-violence-deportable.html", "passage_text": "Some crimes of domestic violence may, depending on their facts and circumstances, be considered aggravated felonies. That’s because the definition of aggravated felony found in Section 101(a)(43) of the I.N.A. includes crimes of violence punished by at least one year in prison."}, {"url": "http://www.ilrc.org/files/documents/n.9-domestic_violence_child_abuse.pdf", "passage_text": "To avoid the aggravated felony consequence, counsel must obtain a sentence of 364 days or less for any single count of a crime of violence. For instructions on how to accept more than a year in jail while taking 364 days or less on any single count for immigration purposes, see § N.4 Sentences."}]