[{"url": "http://michaelbluejay.com/house/figurepayment.html", "passage_text": "For the down payment, enter the largest that you're able to afford. To show how much the interest rate and the down payment affect the monthly payment, here are some examples of monthly payments on a $180,000 home with a 30-year mortgage: 1  4% interest, 20% down: $987/month. 2  4% interest, 5% down: $1230/month. 3  8% interest, 20% down: $1357/month."}, {"url": "https://answers.yahoo.com/question/index?qid=20100722130836AAtuEBE", "passage_text": "You can expect to pay probably another $250 or so a month for property taxes and insurance, so that would be a total monthly payment of $733.14. I have no clue what property taxes and homeowner's insurance would be in your area so that payment could change drastically if taxes and insurance cost more there. Source(s):"}, {"url": "http://www.nolo.com/legal-encyclopedia/how-much-does-owning-home-really-cost.html", "passage_text": "For one thing, you’ll probably take out a loan to buy your house, which means your immediate upfront cost will be the down payment (traditionally 20%, or $40,000 on a $200,000 purchase) plus closing costs and fees."}, {"url": "http://www.nolo.com/legal-encyclopedia/how-much-does-owning-home-really-cost.html", "passage_text": "When people think of how much it will cost to buy a home, they tend to think of the purchase price. And no wonder: With median home prices in the U.S. at well over $200,000 (in 2015), the list price is a number that would grab anyone’s attention."}, {"url": "http://michaelbluejay.com/house/figurepayment.html", "passage_text": "That's $3600/year together, or $300/month. So your total monthly mortgage payment is $1320 ($1020 from what we figured earlier, plus $300 for taxes and insurance.). One more thing: If you put less than 20% down, you'll probably have to pay for Private Mortgage Insurance (PMI)."}, {"url": "https://www.moneyadviceservice.org.uk/en/articles/estimate-your-overall-buying-and-moving-costs", "passage_text": "Deposit. This is the amount you put towards the cost of the property when you buy your home. On average, you need at least 5% to 20% of the purchase price (for example: £10,000 to £ 40,000 when buying a £200,000 home). Help to Buy and other housing schemes only require a 5% deposit."}]