[{"url": "http://www.everydayfamily.com/how-much-should-you-pay-your-child-for-chores/", "passage_text": "Tags: activities, chores, discipline, experience, kids, money, money saving, preschooler. A good rule of thumb is to pay your child $1 for each year of their age, per week."}, {"url": "http://luke1428.com/how-much-we-pay-our-kids-for-chores/", "passage_text": "How Much to Pay Chores. The question of how much to pay is a tough one. I’ve heard many say the going rate is $1 per task. To me, that rate seems like a good starting point, especially for the young ones. However, as ours aged and the tasks became more challenging, we increased the amount, as you will see below."}, {"url": "http://www.everydayfamily.com/how-much-should-you-pay-your-child-for-chores/", "passage_text": "If you decide you do want to pay your child for completing chores, how much is acceptable? Money Crashers suggests that a good rule of thumb is to pay your child $1 for each year of their age, per week. For example, a 5-year-old who completes all of his chores would make $5 that week."}, {"url": "http://www.moneycrashers.com/allowance-kids-chores/", "passage_text": "This is the most common type of allowance. Kids are expected to do certain chores around the house in exchange for money. This is often a set amount of money for a list of chores that must be done each week. The benefits are that the child sees a direct correlation between effort and the money he or she receives."}, {"url": "http://www.moneycrashers.com/allowance-kids-chores/", "passage_text": "If a straight $5 or $10 per week (or even per month) makes more sense to you than paying a dollar per year of age, then pay what works for you. The point is to teach your kids money management and the value of money."}, {"url": "http://www.huffingtonpost.com/women-co/teens-chores-what-are-they-worth_b_3659820.html", "passage_text": "Some parents pay kids for chores via a weekly allowance, or on a chore-by-chore basis. They reason that adult labor is rewarded with a weekly paycheck, so a child's work should be compensated, too. These wages instill a work ethic and teach money management, a skill we all need to be successful adults."}, {"url": "http://www.everydayfamily.com/how-much-should-you-pay-your-child-for-chores/", "passage_text": "If you would rather base your child’s rate on the chores themselves, consider setting a dollar amount for each chore based on its difficulty. For example, picking up any items on the floor in the living room may be a one-dollar chore, and washing the car might be a five-dollar chore."}]