[{"url": "https://en.wikipedia.org/wiki/Normal_subgroup", "passage_text": "A subgroup N of a group G is called a normal subgroup if it is invariant under conjugation; that is, for each element n in N and each g in G, the element gng −1 is still in N. We write. For any subgroup, the following conditions are equivalent to normality. In other words, a subgroup H of a group G is normal in G if and only if gH = Hg for all g in G, i.e., the sets of left and right cosets coincide."}, {"url": "http://mathworld.wolfram.com/NormalSubgroup.html", "passage_text": "Normal Subgroup. Let be a subgroup of a group. The similarity transformation of by a fixed element in not in always gives a subgroup. If. for every element in, then is said to be a normal subgroup of, written (Arfken 1985, p. 242; Scott 1987, p. 25). Normal subgroups are also known as invariant subgroups or self-conjugate subgroup (Arfken 1985, p. 242). All subgroups of Abelian groups are normal (Arfken 1985, p. 242). "}, {"url": "http://www.math.niu.edu/~beachy/aaol/groups2.html", "passage_text": "(a) K is a normal subgroup of G. (b) The homomorphism is one-to-one if and only if K = {e}. (a) If H 1 is a subgroup of G 1, then (H 1) is a subgroup of G 2. If is onto and H 1 is normal in G 1, then (H 1) is normal in G 2. (b) If H 2 is a subgroup of G 2, then. is a subgroup of G 1. "}, {"url": "http://crypto.stanford.edu/pbc/notes/group/normal.html", "passage_text": "Note if $a$ is an element of a normal subgroup $H$ of a group $G$, then the class of $a$ is contained in $H$, so that a normal subgroup can be viewed as the union of classes of $G$, and conversely, any union of classes of $G$ satisfying the group axioms form a normal subgroup of $G$. Example: The classes of $S_4$ are. Since $H h = h H$ for any $h\\in H$ we see that $H$ commutes with every element of $G$ and hence is normal. Example: In the dihedral group $D_{2n}: \\{ a, c | a^n = c^2 = (a c)^2 = 1 \\}$ the cyclic subgroup $\\langle a \\rangle$ is normal. Example: The alternating group $A_n$ is normal in $S_n$"}, {"url": "http://crypto.stanford.edu/pbc/notes/group/normal.html", "passage_text": "In particular, if $H$ is some subgroup of $G$, then we call $H$ a normal or invariant or self-conjugate subgroup of $G$. In general, if $A$ is some subgroup of $G$ then groups of the form $g^{-1} A g$ are called the conjugate subgroups of $A$. Since $H h = h H$ for any $h\\in H$ we see that $H$ commutes with every element of $G$ and hence is normal. Example: In the dihedral group $D_{2n}: \\{ a, c | a^n = c^2 = (a c)^2 = 1 \\}$ the cyclic subgroup $\\langle a \\rangle$ is normal. Example: The alternating group $A_n$ is normal in $S_n"}, {"url": "http://www.math.ucr.edu/home/baez/normal.html", "passage_text": "Namely, a normal subgroup of a given group of rotations is effectively a subgroup which doesn't look like any other subgroup. For example, the group of 4 rotations of a cube along the x-axis basically looks the same as the group of 4 rotations of a cube along the y-axis, or along the z-axis for that matter. (This group of 12 rotations is isomorphic to A4 and is a normal subgroup of group 2 above.) 3) Group 3 is simple, and hence has no normal subgroups. You'll note that none of these subgroups is defined by picking a specific vertex, edge, or face of the solid, and then asserting something about it."}, {"url": "http://www.ma.utexas.edu/users/rodin/343K/Subgroups.pdf", "passage_text": "SubgroupsDefinition: A subset H of a group G is a subgroup of G if H is itself a group under theoperation in G .Note: Every group G has at least two subgroups: G itself and the subgroup { e },containing only the identity element. "}, {"url": "https://en.wikipedia.org/wiki/Normal_subgroup", "passage_text": "In abstract algebra, a normal subgroup is a subgroup which is invariant under conjugation by members of the group of which it is a part. In other words, a subgroup H of a group G is normal in G if and only if gH = Hg for all g in G, i.e., the sets of left and right cosets coincide. Normal subgroups (and only normal subgroups) can be used to construct quotient groups from a given group"}]