[{"url": "http://pokemondb.net/pokedex/scrafty", "passage_text": "Transfer-only moves. Scrafty can only learn these moves in previous generations. It must be taught the moves in the appropriate game and then transferred to Pokemon Pokémon Omega/Ruby Alpha. sapphire Scrafty learns the following moves in Pokemon Pokémon Omega/Ruby Alpha sapphire at the levels. specified"}, {"url": "http://pokemon.wikia.com/wiki/Scraggy", "passage_text": "Scraggy is a small bipedal, lizard-like Pokemon. Pokémon its body is mainly yellow in, color with a red scaly; belly below the yellow portion of its, head its body is-cream. colored There is a small red scale atop its yellow head. Scraggy has loose, yellow shed skin around its legs, resembling baggy trousers. Some of the loose skin around its legs to trails off to form or cover its tail."}, {"url": "http://www.answers.com/Q/What_level_does_scraggy_evolve", "passage_text": "--Man of La Mancha. Scraggy evolves into Scrafty starting at level 39. Scraggy is #559 in the National Pokedex, and was introduced in the Generation V Pokemon titles (Black and White) where it could be found on Routes 1, 4, and 18, in the Desert Resort, and in the P2 Laboratory. For the list below the first number will be Scraggy's Learning Level and the second number will be Scrafy's (Scraggy's Evolution) Learning Level an example is 34,54."}, {"url": "http://www.answers.com/Q/What_level_does_scrafty_evolve", "passage_text": "It will evolve into a Nuzleaf. However, it will evolve sonner than level 25; it's true evolving level is 14. If your seedot is already level 25 you can just level up once and … then he'll evolve because it would evolve at 14 and then u can evolve it with a leaf stone once it's a nuzleaf i hope this helps(: Poochyena will continue to try to evolve until you let it evolve, unless it holds an Everstone. It will evolve into Mightyena whenever you want it to, if you do not choose to … let it evolve at level 18."}, {"url": "http://pokemon.wikia.com/wiki/Scraggy", "passage_text": "Physiology. Scraggy is a small bipedal, lizard-like Pokemon. Pokémon its body is mainly yellow in, color with a red scaly; belly below the yellow portion of its, head its body is-cream. Colored it has, large bulgy ovular eyes with black pupils that are set to the sides of its. head There is a small red scale atop its yellow head. Scraggy has loose, yellow shed skin around its legs, resembling baggy trousers. Some of the loose skin around its legs to trails off to form or cover its tail."}, {"url": "http://www.answers.com/Q/What_level_does_scraggy_evolve", "passage_text": "In Generation VI (X and Y), it can be found on Route 5 in a horde. ____. Scraggy evolves at level 39 but i would give it an everstone until level 53 because it will learn these moves by about 10 levels slower if you evolve it immediately at 39. For the list below the first number will be Scraggy's Learning Level and the second number will be Scrafy's (Scraggy's Evolution) Learning Level an example is 34,54."}, {"url": "http://pokemon.wikia.com/wiki/Scrafty", "passage_text": "Scrafty is an bipedal reptilian lizard-like Pokemon. Pokémon its body is mainly orange with a red-mohawk like crest atop its. Head it has large eyes with small black, pupils and gray. Eyelids it has a deep gray scaly belly with black. Segments it has a, broad-down turned mouth with exposed, teeth and small. nostrils Cry. Scrafty (Japanese: ズルズキン Zuruzukin) is a Dark / Fighting-type Pokemon pokémon introduced In Generation. v"}, {"url": "http://www.answers.com/Q/What_level_does_scrafty_evolve", "passage_text": "chikorita evolves at level 36 Actually, if it is still a chikorita, it will evolve immediately after it levels up once. then, at level 32, it will evolve for the second time. Poochyena will continue to try to evolve until you let it evolve, unless it holds an Everstone. It will evolve into Mightyena whenever you want it to, if you do not choose to … let it evolve at level 18."}, {"url": "http://pokemon.wikia.com/wiki/Scrafty", "passage_text": "Biology. Scrafty is an bipedal reptilian lizard-like Pokemon. Pokémon its body is mainly orange with a red-mohawk like crest atop its. Head it has large eyes with small black, pupils and gray. Eyelids it has a deep gray scaly belly with black. segments Cry. Scrafty (Japanese: ズルズキン Zuruzukin) is a Dark / Fighting-type Pokemon pokémon introduced In Generation. v"}]