[{"url": "http://www.glutenfreegigi.com/questionable-quninoa-perfect-plant-protein-or-poison/", "passage_text": "Removing saponins from quinoa by rinsing prior to cooking also removes the bitter taste, caused by saponins on the outer seed coat layer of quinoa. Now, just as there are a variety of glycosides, there are also several different varieties of saponins, each with slightly different properties. Of course, there are also instances where the repellent effects of saponins in quinoa are used. Perhaps the best example of this is the product Heads Up Plant Protectant, categorized by the US Environmental Protection Agency as a biopesticide, approved primarily as a treatment on potato seed pieces."}, {"url": "http://quinoabenefits.org/are-the-saponins-on-quinoa-dangerous/", "passage_text": "Here is some other information for you. Quinoa Saponins (Chenopodium Quinoa Willd). “Quinoa” is a Bolivian Cereal and the Saponins is a natural protector of the grain. They consist of a polycyclic aglycone that is either a choline steroid or triterpenoid attached via C3 and an ether bond to a sugar side chain. The aglycone is referred to as the sapogenin and steroid saponins are called saraponins. Quinoa Plants – Saponins. Saponins are bitter and reduce the palatability of livestock feeds. However if they have a triterpenoid aglycone they may instead have a licorice taste as glucuronic acid replaces sugar in triterpenoids."}, {"url": "http://www.hort.purdue.edu/newcrop/proceedings1993/V2-222.html", "passage_text": "Many landraces of quinoa contain saponin in the seedcoat. Saponins function as antinutrients and are frequently associated with plant lipids. They are not normally absorbed from the gut and have been shown to induce small intestinal damage or reduce intestinal absorption of nutrients (Jenkins 1988). Quinoa saponin is a known hemolytic when mixed with blood cells. In South America, saponin removed from quinoa is used as a detergent for clothing, washing and as an antiseptic to promote healing of skin injuries (D. Cusack pers. commun.; E. Ballon pers. commun.)"}, {"url": "http://www.epicurious.com/expert-advice/does-quinoa-need-to-be-rinsed-article", "passage_text": "Rinsing the quinoa gets rid of the saponin and thus its bitter flavor—great. But rinsing quinoa is also annoying. It also makes toasting your quinoa impossible—unless you want to wait hours and hours for your quinoa to dry. Rather, the quinoa has undergone an abrasion process that removes the saponin. The clean quinoa does comes with a nutritional cost, though. The abrasion process shaves off a bit of the beneficial bran layer and germ from each kernel, Speck says."}, {"url": "http://www.glutenfreegigi.com/questionable-quninoa-perfect-plant-protein-or-poison/", "passage_text": "Common dietary sources of saponins are legumes like soybeans, chickpeas, mung beans, peanuts, kidney beans and lentils. Saponins are also found in oats, leeks, garlic, asparagus, certain teas, spinach and of course, quinoa. Of course, there are also instances where the repellent effects of saponins in quinoa are used. Perhaps the best example of this is the product Heads Up Plant Protectant, categorized by the US Environmental Protection Agency as a biopesticide, approved primarily as a treatment on potato seed pieces."}, {"url": "https://answers.yahoo.com/question/index?qid=20100926153608AAMx9o6", "passage_text": "Saponins in quinoa happen as a powdery coating in the seed. This powdery coating has to be removed before cooking. if not then your quinoa will taste bitter. Some processing plants remove the saponin better than others. Some brands therefore have better washed quinoa than others. "}, {"url": "http://ccbolgroup.com/saponinsquinoa.html", "passage_text": "Quinoa Saponins (Chenopodium Quinoa Willd). “Quinoa” is a Bolivian Cereal and the Saponins is a natural protector of the grain. They consist of a polycyclic aglycone that is either a choline steroid or triterpenoid attached via C3 and an ether bond to a sugar side chain. Quinoa Plants-Saponins. Quinoa Plants-Saponins. Quinoa grain under a microscope. Quinoa Plants-Saponins. Saponin content. In its natural state quinoa has a coating of bitter-tasting saponins, making it essentially unpalatable."}, {"url": "http://www.google.com/patents/US6355249", "passage_text": "Patents. A process for commercial extraction of saponins from quinoa, and optionally for the formation of corresponding sapogenins. The saponin extraction process comprises contacting a saponin-containing part of a quinoa plant with an aqueous alcohol solution containing an alcohol selected from the group consisting... The saponin fraction in a 50% w/v ethanolic extract of quinoa bran can be successfully concentrated and purified directly by passage over a membrane with a molecular weight cut-off of 300. Quinoa bran (25 g) was extracted with 50% v/v ethanol (1.25 L) for 4 hours and filtered to yield 1.21 L of extract."}, {"url": "https://en.wikipedia.org/wiki/Quinoa", "passage_text": "Quinoa (/ˈkiːnoʊ.ə/ , from Quechua kinwa or kinuwa) is a species of the goosefoot genus (Chenopodium quinoa), a grain crop grown primarily for its edible seeds. It is a pseudocereal, similar in some respects to buckwheat, rather than a true cereal, as it is not a member of the true grass family. The toxicity category rating of quinoa saponins treats them as mild eye and respiratory irritants and as a low gastrointestinal irritant. The saponin is a toxic glycoside, a main contributor to its hemolytic effects when combined directly with blood cells."}]