[{"url": "https://answers.yahoo.com/question/index?qid=20080722094640AAPXUZh", "passage_text": "Answers. Best Answer: A The outer membrane would be from the host's engulfing the proto-symbiont in a food vacuole. The inner membrane would belong to the ur-cell that became a mutualist mitochondria eventually.http://serialendosymbiosis.blogspot.com/... http://www.mitochondrial.net/showabstrac... "}, {"url": "http://www.origin-of-mitochondria.net/?p=179", "passage_text": "1 They are bounded by a double membrane: the outer thought to be derived from the engulfing vesicle and the inner from bacterial plasma membrane. 2  Some enzymes and inner membrane transport systems resemble prokaryotic plasma membrane systems. 3  Mitochondrial division resembles bacterial binary fission. (1999) list the following: 1  Mitochondria resemble bacteria in size and morphology. 2  They are bounded by a double membrane: the outer thought to be derived from the engulfing vesicle and the inner from bacterial plasma membrane. 3  Some enzymes and inner membrane transport systems resemble prokaryotic plasma membrane systems. 4  Mitochondrial division ...."}, {"url": "https://en.wikipedia.org/wiki/Vesicle_(biology_and_chemistry)", "passage_text": "The membrane enclosing the vesicle is also a lamellar phase, similar to that of the plasma membrane, and vesicles can fuse with the plasma membrane to release their contents outside of the cell. Vesicles can also fuse with other organelles within the cell. Vesicles perform a variety of functions. "}, {"url": "https://en.wikipedia.org/wiki/Cell_membrane", "passage_text": "4. Exocytosis: Just as material can be brought into the cell by invagination and formation of a vesicle, the membrane of a vesicle can be fused with the plasma membrane, extruding its contents to the surrounding medium. The deformation then pinches off from the membrane on the inside of the cell, creating a vesicle containing the captured substance. Endocytosis is a pathway for internalizing solid particles (cell eating or phagocytosis), small molecules and ions (cell drinking or pinocytosis), and macromolecules."}, {"url": "http://www.origin-of-mitochondria.net/?p=179", "passage_text": "(1999) list the following: Mitochondria resemble bacteria in size and morphology. They are bounded by a double membrane: the outer thought to be derived from the engulfing vesicle and the inner from bacterial plasma membrane. Some enzymes and inner membrane transport systems resemble prokaryotic plasma membrane systems. (1999) list the following: 1  Mitochondria resemble bacteria in size and morphology. 2  They are bounded by a double membrane: the outer thought to be derived from the engulfing vesicle and the inner from bacterial plasma membrane. 3  Some enzymes and inner membrane transport systems resemble prokaryotic plasma membrane systems. 4  Mitochondrial division ...."}, {"url": "https://en.wikipedia.org/wiki/Mitochondrial_membrane", "passage_text": "Disruption of the outer membrane permits proteins in the intermembrane space to leak into the cytosol, leading to certain cell death. The mitochondrial outer membrane can associate with the endoplasmic reticulum (ER) membrane, in a structure called MAM (mitochondria-associated ER-membrane). The matrix is the space enclosed by the inner membrane. It contains about 2/3 of the total protein in a mitochondrion. The matrix is important in the production of ATP with the aid of the ATP synthase contained in"}, {"url": "http://www.origin-of-mitochondria.net/?p=179", "passage_text": "1 Mitochondria resemble bacteria in size and morphology. 2  They are bounded by a double membrane: the outer thought to be derived from the engulfing vesicle and the inner from bacterial plasma membrane. 3  Some enzymes and inner membrane transport systems resemble prokaryotic plasma membrane systems. (1999) list the following: 1  Mitochondria resemble bacteria in size and morphology. 2  They are bounded by a double membrane: the outer thought to be derived from the engulfing vesicle and the inner from bacterial plasma membrane. 3  Some enzymes and inner membrane transport systems resemble prokaryotic plasma membrane systems. 4  Mitochondrial division ...."}, {"url": "https://en.wikipedia.org/wiki/Mitochondrial_membrane", "passage_text": "The mitochondrion (plural mitochondria) is a double membrane-bound organelle found in most eukaryotic cells. The word mitochondrion comes from the Greek μίτος, mitos, i.e. thread, and χονδρίον, chondrion, i.e. granule or grain-like. Mitochondria range from 0.5 to 1.0 μm in diameter. The matrix is the space enclosed by the inner membrane. It contains about 2/3 of the total protein in a mitochondrion. The matrix is important in the production of ATP with the aid of the ATP synthase contained in"}, {"url": "http://mhhe.com/biosci/ap/holeessentials/student/olc/graphics/hole06ehap_s/other/chap03outline.doc", "passage_text": "3.17-3.18). In endocytosis, molecules that are too large to be transported by other means are engulfed by an invagination of the cell membrane and carried into the cell surrounded by a vesicle. Exocytosis is the reverse of endocytosis. "}]