[{"url": "http://answers.webmd.com/answers/2018835/what-causes-an-inflamed-pancreas", "passage_text": "An inflamed pancreas is called pancreatitis. It almost always leads to upper abdominal pain. Other symptoms include nausea, vomiting and loss of appetite. Doctors group pancreatitis in two major categories: 1  Acute – Inflammation of the pancreas comes on rather quickly, within several hours to a couple days."}, {"url": "http://www.webmd.com/digestive-disorders/enlarged-pancreas-causes-symptoms-and-treatments", "passage_text": "1 Pancreatitis occurs when digestive enzymes become active inside the pancreas, attacking and damaging its tissues. 2  This can cause an enlarged pancreas. 3  Acute pancreatitis is inflammation that occurs suddenly in the pancreas. 4  It can be very serious, even life-threatening."}, {"url": "http://www.bupa.co.uk/health-information/directory/p/pancreatitis", "passage_text": "Read more Close. Pancreatitis is inflammation of the pancreas. There are two types of pancreatitis: acute – when the pancreas is inflamed and causes short-term illness – and chronic – when the pancreas is irreversibly damaged and causes ongoing, long-term illness or bouts of acute symptoms."}, {"url": "http://my.clevelandclinic.org/health/diseases_conditions/hic_Pancreatitis", "passage_text": "Acute pancreatitis is a sudden inflammation of the pancreas that occurs over a short period of time. In more than 80 percent of the cases, acute pancreatitis is caused by bile duct stones or heavy alcohol use. Other causes include medications and very rarely, infections, trauma, metabolic disorders, and surgery."}, {"url": "http://www.mayoclinic.org/diseases-conditions/pancreatitis/basics/causes/con-20028421", "passage_text": "This causes the enzymes to irritate the cells of your pancreas, causing inflammation and the signs and symptoms associated with pancreatitis. With repeated bouts of acute pancreatitis, damage to the pancreas can occur and lead to chronic pancreatitis. Scar tissue may form in the pancreas, causing loss of function."}, {"url": "http://www.pancreasproblems.org/inflamed_pancreas/inflamed_pancreas.html", "passage_text": "The most common causes behind an inflamed pancreas are prolonged alcohol abuse and gallstones. Some hereditary disorders can cause pancreatitis, as can certain medications and viruses. When pancreatitis is caused by medication and viruses, it is usually an acute attack and rarely long-lived."}, {"url": "http://www.webmd.com/digestive-disorders/enlarged-pancreas-causes-symptoms-and-treatments", "passage_text": "But other causes of an enlarged pancreas may include the following: 1  Pancreatitis occurs when digestive enzymes become active inside the pancreas, attacking and damaging its tissues. 2  This can cause an enlarged pancreas. 3  Acute pancreatitis is inflammation that occurs suddenly in the pancreas."}, {"url": "http://www.healtharticles101.com/top-10-causes-of-inflamed-pancreas/", "passage_text": "Alcohol abuse and hereditary factors greatly contribute to a chronic form of inflamed pancreas. Patients with chronic inflamed pancreas have advanced scarring of the gland and pancreas passages and impaired ability to digest foods. Diet for chronic pancreatitis is a major component of all treatment strategies."}, {"url": "http://www.healtharticles101.com/top-10-causes-of-inflamed-pancreas/", "passage_text": "Home » Endocrinology » Pancreas Problems ». Pancreas plays a vital role in the digestive system of the body by producing digestive enzymes and hormones necessary for processing foods so the body can absorb all the nutrients from it. Inflamed pancreas can manifest itself in two forms, acute and chronic."}, {"url": "http://www.healthgrades.com/symptoms/pancreas-symptoms", "passage_text": "Pancreatitis, or inflammation of the pancreas, is the most common cause of pancreas symptoms. Common causes of pancreatitis include gallstones that form in the nearby gallbladder and travel to the pancreas via the common bile duct; long-term, heavy alcohol use; and certain conditions such as cystic fibrosis."}]