[{"url": "http://www.medicinenet.com/pertussis/page3.htm", "passage_text": "The incubation period, or the time frame in which symptoms develop, is longer than that for the common cold and most upper respiratory infections. Typically, signs and symptoms develop within seven to 10 days of exposure to pertussis, but they may not appear for up to three weeks after the initial infection. "}, {"url": "http://diseases.emedtv.com/whooping-cough/whooping-cough-symptoms.html", "passage_text": "The period between the time of infection and when symptoms of whooping cough appear is called the incubation period. The whooping cough incubation period is commonly 7 to 10 days, with a general range of 4 to 21 days; rarely, the incubation period may be as long as 42 days. Once whooping cough symptoms begin, there are generally three stages of the illness"}, {"url": "http://www.mckinley.illinois.edu/Handouts/pertussis_whooping_cough.html", "passage_text": "Pertussis starts as a mild, upper respiratory infection (a cold) - including sneezing, runny nose, fever and occasional cough. Within 10-14 days, the cough becomes more severe. Thick sputum may be present. These symptoms may persist for one to two months, occurring frequently at night. Pertussis can occur at any age. Severe illness is more common in young children that have not been immunized. Adults with pertussis have milder symptoms. A diagnosis of pertussis should be considered for adults with persistent cough, to ensure they do not pass on the infection."}, {"url": "http://www.cdc.gov/vaccines/pubs/pinkbook/downloads/pert.pdf", "passage_text": "Pertussis 261 16 Pertussis, or whooping cough, is an acute infectious disease caused by the bacterium Bordetella pertussis. Outbreaks of pertussis were first described in the 16th century, and the organism was first isolated in 1906. Communicability Pertussis is highly communicable, as evidenced by secondary attack rates of 80% among susceptible household contacts. Persons with pertussis are most infectious during the catarrhal period and the first 2 weeks after cough onset (i.e., approximately 21 days)."}, {"url": "http://diseases.emedtv.com/whooping-cough/contagious-period-for-whooping-cough.html", "passage_text": "The whooping cough incubation period is the time between becoming infected with the bacteria that cause this illness (Bordetella pertussis) and developing symptoms. The incubation period is commonly 7 to 10 days, but it can range from 4 to 21 days and, in rare cases, may be as long as 42 days. Whooping Cough Disease. Because the first whooping cough symptoms, which typically develop during the first week or so of the illness, are similar to the common cold, parents can help protect young infants by minimizing their exposure to people who have cold symptoms or an illness with coughing."}, {"url": "http://www.cdc.gov/pertussis/about/signs-symptoms.html", "passage_text": "Espanol: Español signos y. Sintomas (síntomas pertussis) whooping cough can cause serious illness, in, babies, children teens. And adults symptoms of pertussis usually develop within 5 to 10 days after, being exposed but sometimes not for as long as. 3 weeks The coughing fits can go on for up to 10 weeks or more. In China, pertussis is known as the 100 day cough.. However, the whoop is often not there for people who have milder (less serious) disease. The infection is generally milder in teens and adults, especially those who have been vaccinated."}, {"url": "http://diseases.emedtv.com/whooping-cough/contagious-period-for-whooping-cough.html", "passage_text": "A person with whooping cough is contagious as long as they have symptoms; however, infected people are more likely to transmit the bacteria that cause the illness during the first three weeks of symptoms. Because the first whooping cough symptoms, which typically develop during the first week or so of the illness, are similar to the common cold, parents can help protect young infants by minimizing their exposure to people who have cold symptoms or an illness with coughing."}, {"url": "http://www.cdc.gov/vaccines/pubs/pinkbook/downloads/pert.pdf", "passage_text": "Until recently it was thought that B. pertussis did not invade the tissues. However, recent studies have shown the bacteria to be present in alveolar macrophages. Clinical Features The incubation period of pertussis is commonly 7–10 days, with a range of 4–21 days, and rarely may be as long as 42 days. The clinical course of the illness is divided into three stages. Communicability Pertussis is highly communicable, as evidenced by secondary attack rates of 80% among susceptible household contacts. Persons with pertussis are most infectious during the catarrhal period and the first 2 weeks after cough onset (i.e., approximately 21 days)."}, {"url": "http://diseases.emedtv.com/whooping-cough/contagious-period-for-whooping-cough.html", "passage_text": "Whooping cough (pertussis) is a highly contagious infection. A person is most likely to transmit the bacteria that cause this illness when he or she is experiencing symptoms, especially during the first three weeks of symptoms. Because the first whooping cough symptoms, which typically develop during the first week or so of the illness, are similar to the common cold, parents can help protect young infants by minimizing their exposure to people who have cold symptoms or an illness with coughing."}, {"url": "http://www.mckinley.illinois.edu/Handouts/pertussis_whooping_cough.html", "passage_text": "Pertussis, or whooping cough, is a highly contagious disease involving the respiratory tract. It is caused by a bacterium, Bordetella pertussis, which is found in the mouth, nose and throat of an infected person. Pertussis can occur at any age. Severe illness is more common in young children that have not been immunized. Adults with pertussis have milder symptoms. A diagnosis of pertussis should be considered for adults with persistent cough, to ensure they do not pass on the infection."}]