[{"url": "http://my.clevelandclinic.org/services/heart/disorders/pericarditis", "passage_text": "Pericardial Effusion. When an excess of fluid builds up in the space between the pericardium, it can cause a condition known as pericardial effusion. Rapid fluid accumulation in the pericardium can cause cardiac tamponade, a severe compression of the heart that impairs its ability to function. Cardiac tamponade resulting from a pericardial effusion can be life-threatening and is a medical emergency requiring emergent drainage of the fluid with a catheter. The Pericardium. The pericardium is a thin, two-layered, fluid-filled sac that covers the outer surface of the heart. It shields the heart from infection or malignancy and contains the heart in the chest wall."}, {"url": "https://en.wikipedia.org/wiki/Cardiac_tamponade", "passage_text": "Cardiac tamponade, also known as pericardial tamponade, is an acute type of pericardial effusion in which fluid, pus, blood, clots, or gas accumulates in the pericardium (the sac in which the heart is enclosed), resulting in slow or rapid compression of the heart. Cardiac tamponade is pressure on the heart muscle which occurs when the pericardial space fills up with fluid faster than the pericardial sac can stretch."}, {"url": "http://emedicine.medscape.com/article/157325-overview", "passage_text": "Background. Pericardial effusion is the presence of an abnormal amount of and/or an abnormal character to fluid in the pericardial space. It can be caused by a variety of local and systemic disorders, or it may be idiopathic. (See Etiology.)."}, {"url": "http://www.webmd.com/heart-disease/guide/pericardial-effusion", "passage_text": "Causes of Pericardial Effusion. Most pericardial effusions are caused by inflammation of the pericardium, a condition called pericarditis. As the pericardium becomes inflamed, extra fluid is produced, leading to a pericardial effusion. Viral infections are one of the main causes of pericarditis and pericardial effusions. When a pericardial effusion is caused by pericarditis, the main symptom is chest pain. The chest pain may be made worse by deep breathing and lessened by leaning forward. When pericarditis is causing a pericardial effusion, other symptoms may include: 1  Fever. 2  Fatigue. 3  Muscle aches. 4  Shortness of breath."}, {"url": "http://www.webmd.com/heart-disease/guide/pericardial-effusion", "passage_text": "In people with a pericardial effusion that's not due to pericarditis, there are often no symptoms. Large, serious pericardial effusions may cause symptoms including: 1  Shortness of breath. 2  Palpitations (sensation that the heart is pounding or beating fast). 3  Light-headedness or passing out. 4  Cool, clammy skin. When a pericardial effusion is caused by pericarditis, the main symptom is chest pain. The chest pain may be made worse by deep breathing and lessened by leaning forward. When pericarditis is causing a pericardial effusion, other symptoms may include: 1  Fever. 2  Fatigue. 3  Muscle aches. 4"}, {"url": "http://www.webmd.com/heart-disease/guide/pericardial-effusion", "passage_text": "A pericardial effusion is an abnormal amount of fluid between the heart and the pericardium, which is the sac surrounding the heart. Pericardial effusions are associated with many different medical conditions. When a pericardial effusion is caused by pericarditis, the main symptom is chest pain. The chest pain may be made worse by deep breathing and lessened by leaning forward. When pericarditis is causing a pericardial effusion, other symptoms may include: 1  Fever. 2  Fatigue. 3  Muscle aches. 4  Shortness of breath."}, {"url": "http://emedicine.medscape.com/article/157325-overview", "passage_text": "Pericardial effusion is the presence of an abnormal amount of fluid and/or an abnormal character to fluid in the pericardial space. It can be caused by a variety of local and systemic disorders, or it may be idiopathic. See the image below. Pericardial effusion is the presence of an abnormal amount of and/or an abnormal character to fluid in the pericardial space. It can be caused by a variety of local and systemic disorders, or it may be idiopathic. (See Etiology.)."}, {"url": "https://en.wikipedia.org/wiki/Pericardial_effusion", "passage_text": "Pericardial effusion (fluid around the heart) is an abnormal accumulation of fluid in the pericardial cavity. Because of the limited amount of space in the pericardial cavity, fluid accumulation leads to an increased intrapericardial pressure which can negatively affect heart function. A pericardial effusion with enough pressure to adversely affect heart function is called cardiac tamponade. The so-called water-bottle heart is a radiographic sign of pericardial effusion, in which the cardiopericardial silhouette is enlarged and assumes the shape of a flask or water bottle. It can be associated with dullness to percussion over the left subscapular area due to compression of the left lung base."}]