[{"url": "https://en.wikipedia.org/wiki/Color", "passage_text": "It includes the perception of color by the human eye and brain, the origin of color in materials, color theory in art, and the physics of electromagnetic radiation in the visible range (that is, what we commonly refer to simply as light). Color, or colour (see spelling differences) is the visual perceptual property corresponding in humans to the categories called red, blue, yellow, etc. Color derives from the spectrum of light (distribution of light power versus wavelength) interacting in the eye with the spectral sensitivities of the light receptors"}, {"url": "http://www.wisegeekhealth.com/what-is-color-perception.htm", "passage_text": "I think one great thing about this difference in our ability to see color as humans is the fact that it allows for artist to see colors in different ways and expressed them to other people. The differences in human perception of color mean that we can all appreciate different parts of the visual world in different ways. While there is obviously similarities in the tones that we see as humans, many factors go into our finite definition of color tones in the visual world. I color perception is akin to the ability to be able to discern notes and ranges in the audible sound spectrum. just as some people are tone deaf there are people who do not have the ability to perceive color very well."}, {"url": "http://www.wisegeekhealth.com/what-is-color-perception.htm", "passage_text": "The differences in eye color perception from individual to individual means that we must take into account what colors are used for certain types of documentation or road signs. Most humans are capable of perceiving the color red and therefore it is one of the eye-catching colors used in very important signs. I color perception is akin to the ability to be able to discern notes and ranges in the audible sound spectrum. just as some people are tone deaf there are people who do not have the ability to perceive color very well."}, {"url": "https://en.wikipedia.org/wiki/Color_vision", "passage_text": "Color vision is the ability of an organism or machine to distinguish objects based on the wavelengths (or frequencies) of the light they reflect, emit, or transmit. A physical color is a combination of pure spectral colors (in the visible range). Since there are, in principle, infinitely many distinct spectral colors, the set of all physical colors may be thought of as an infinite-dimensional vector space, in fact a Hilbert space. We call this space H color."}, {"url": "http://micro.magnet.fsu.edu/primer/lightandcolor/humanvisionintro.html", "passage_text": "Human stereo color vision is a very complex process that is not completely understood, despite hundreds of years of intense study and modeling. Vision involves the nearly simultaneous interaction of the two eyes and the brain through a network of neurons, receptors, and other specialized cells. In the lower layers of the cortex, the information from each eye is maintained as columnar ocular dominance stripes. As the visual signals are transmitted to the upper layers of the cortex, information from the two eyes is merged and binocular vision is formed."}, {"url": "http://hyperphysics.phy-astr.gsu.edu/hbase/vision/colper.html", "passage_text": "Color Perception. The properties of color which are inherently distinguishable by the human eye are hue, saturation, and brightness. While we know that the spectral colors can be one-to-one correlated with light wavelength, the perception of light with multiple wavelengths is more complicated. It is found that many different combinations of light wavelengths can produce the same perception of color. This can be put in perspective with the CIE chromaticity diagram. The white or achromatic point E can also be achieved with many different mixtures of light, e.g. with complementary colors."}, {"url": "https://en.wikipedia.org/wiki/Color_vision", "passage_text": "Colors can be measured and quantified in various ways; indeed, a person's perception of colors is a subjective process whereby the brain responds to the stimuli that are produced when incoming light reacts with the several types of cone cells in the eye. A physical color is a combination of pure spectral colors (in the visible range). Since there are, in principle, infinitely many distinct spectral colors, the set of all physical colors may be thought of as an infinite-dimensional vector space, in fact a Hilbert space. We call this space H color."}, {"url": "http://www.wisegeekhealth.com/what-is-color-perception.htm", "passage_text": "Example of like color perception importance is in the ability to accurately determine what color matches another color. Because this ability is built into the human brain we often overlook it as a daily conscious task. I color perception is akin to the ability to be able to discern notes and ranges in the audible sound spectrum. just as some people are tone deaf there are people who do not have the ability to perceive color very well."}, {"url": "http://www.cambridgeincolour.com/tutorials/color-perception.htm", "passage_text": "TUTORIALS: COLOR PERCEPTION. Color can only exist when three components are present: a viewer, an object, and light. Although pure white light is perceived as colorless, it actually contains all colors in the visible spectrum. "}]