[{"url": "http://www.doorandwindow.com/windows/styles/bow/bow-window-prices.php", "passage_text": "For the best cost-efficiency during installation, the replacement bow windows should be the same size, or smaller, than the existing windows. If the bow windows are larger you'll need to pay an additional $300 to $600 to alter the window opening to accept the new bow windows. Standard Bow Window - $1,400 to $1,600. While the number of windows can vary, a typical standard bow window will have four or five windows mulled together. The central window usually does not open, but the terminal windows may. The panes might be standard glass or low-E glass."}, {"url": "http://runescape.wikia.com/wiki/Zaryte_bow", "passage_text": "The Zaryte bow is an enchanted Zarosian bow that requires 80 Ranged to wield. Released on 10 January 2011, it is dropped by Nex, the Zarosian leader of the Ancient Prison in the God Wars Dungeon, as well as the four nihil in The Pit of Freneskae. After firing 60,000 shots, the zaryte bow degrades and requires repair before it can be used again. Bob the Smith in Lumbridge can repair the bow at a price of 20,000 coins per percent of charge or two million coins for a full repair, thus pricing each arrow/shot at approximately 33 coins (if using Bob for repairs)."}, {"url": "http://replacementwindowsadvisor.com/bay-and-bow-windows-how-much-are-they/", "passage_text": "The average cost for fiberglass bay and bow windows is $2500 to $3200. The cost of installation is going to vary based on how the window is going in, is there a window there already, does it involve a roof,etc… I fair range to figure is $1000 to $3000 for installation alone. Wood is one of the more popular choices of materials because of its durability and strength. The average cost for wood bay and bow windows is $2000 to $2600. Fiberglass is one of the newer materials that are available and the cost is a bit higher for this type of bay or bow window."}, {"url": "http://www.doorandwindow.com/windows/styles/bow/bow-window-prices.php", "passage_text": "This makes if difficult to list standard bow window prices and costs. The prices listed here are meant as guidelines only. They are current as of September, 2010. Economy Bow Window - $800 to $1,200. This basic bow window will typically have three or four non-opening casement windows mulled together. These are typically wooden framed with a limited selection of colors and features. Standard Bow Window - $1,400 to $1,600. While the number of windows can vary, a typical standard bow window will have four or five windows mulled together. The central window usually does not open, but the terminal windows may. The panes might be standard glass or low-E glass."}, {"url": "http://replacementwindowsadvisor.com/bay-and-bow-windows-how-much-are-they/", "passage_text": "Bow windows are great because they offer a bit more dimension and a unique look for any home. The average cost of a typical bow window is pretty much the same as bay windows or even slightly more $1400 to $3200. When choosing the material for your bay or bow windows you will find that vinyl bay and bow windows are quite affordable with the average price ranging from $1200 to $1800. Wood is one of the more popular choices of materials because of its durability and strength. The average cost for wood bay and bow windows is $2000 to $2600. Fiberglass is one of the newer materials that are available and the cost is a bit higher for this type of bay or bow window."}, {"url": "http://www.howmuchisit.org/archery-lessons-cost/", "passage_text": "1 An archery camp which lasts one week can cost anywhere from $100 to $225. 2  While some camps are designed for children, there are camps for adults as well. 3  These classes will be held five to seven days of the week and each lesson will last one hour. 1 While some ranges will include the bow for the rookie class, they may require that you purchase a bow set after the first lesson. 2  Most bows will cost anywhere from $50 to $200. 3  The costs will depend on the size, poundage and brand."}, {"url": "http://www.doorandwindow.com/windows/styles/bow/bow-window-prices.php", "passage_text": "Because bow window costs and prices will vary depending on the exact details of the windows you install, you need to make sure you know how the options you pick will affect the final cost of your bow window installation project. There are many sizes and options available for bow windows. Standard Bow Window - $1,400 to $1,600. While the number of windows can vary, a typical standard bow window will have four or five windows mulled together. The central window usually does not open, but the terminal windows may. The panes might be standard glass or low-E glass."}, {"url": "http://runescape.wikia.com/wiki/Zaryte_bow", "passage_text": "Because its components only cost 369,328, as opposed to the zaryte bow's 31,952,880, this crossbow is typically the best choice for players who meet the requirements and do not have a lot of money. (The actual forging of the crossbow, it should be noted, is not considered to be easy). After firing 60,000 shots, the zaryte bow degrades and requires repair before it can be used again. Bob the Smith in Lumbridge can repair the bow at a price of 20,000 coins per percent of charge or two million coins for a full repair, thus pricing each arrow/shot at approximately 33 coins (if using Bob for repairs)."}, {"url": "http://www.howmuchisit.org/archery-lessons-cost/", "passage_text": "1 Most bows will cost anywhere from $50 to $200. 2  The costs will depend on the size, poundage and brand. 3  Rentals are often available for $10 to $20. 4  If you are going to purchase a bow, additional safety accessories such as a stabilizer bar, sight, sling and arm guard are all recommended. 1 While some ranges will include the bow for the rookie class, they may require that you purchase a bow set after the first lesson. 2  Most bows will cost anywhere from $50 to $200. 3"}]