[{"url": "https://en.wikipedia.org/wiki/Biogas", "passage_text": "Biogas can be produced by anaerobic digestion with anaerobic bacteria, which digest material inside a closed system, or fermentation of biodegradable materials. Biogas is primarily methane (CH 4) and carbon dioxide (CO 2) and may have small amounts of hydrogen sulfide (H 2S), moisture and siloxanes. Biogas can be compressed, the same way natural gas is compressed to CNG, and used to power motor vehicles. In the UK, for example, biogas is estimated to have the potential to replace around 17% of vehicle fuel."}, {"url": "https://www.americanbiogascouncil.org/biogas_questions.asp", "passage_text": "What is Biogas? Biogas is the type of gas that is produced in an anaerobic digester. Biogas is mostly made of methane and carbon dioxide plus small amounts of some other gases. Biogas generally contains 55%-75% methane and 44%-24% carbon dioxide, with the other gases making up 1% or less of the mixture. Since biogas is made from organic material, it is sometimes also called renewable natural gas.."}, {"url": "http://biogas.ifas.ufl.edu/FAQ.asp", "passage_text": "Methane is the principal gas in biogas. Methane is also the main component in natural gas, a fossil fuel. Biogas can be used to replace natural gas in many applications including: cooking, heating, steam production, electrical generation, vehicular fuel, and as a pipeline gas. Biogas is principally a mixture of methane (CH 4) and carbon dioxide (CO 2) along with other trace gases. Biogas can be collected from landfills, covered lagoons, or enclosed tanks called anaerobic digesters."}, {"url": "https://en.wikipedia.org/wiki/Biogas", "passage_text": "Biogas is produced as landfill gas (LFG), which is produced by the breakdown of biodegradable waste inside a landfill due to chemical reactions and microbes, or as digested gas, produced inside an anaerobic digester. A biogas plant is the name often given to an anaerobic digester that treats farm wastes or energy crops. Biogas can be compressed, the same way natural gas is compressed to CNG, and used to power motor vehicles. In the UK, for example, biogas is estimated to have the potential to replace around 17% of vehicle fuel."}, {"url": "https://en.wikipedia.org/wiki/Biogas", "passage_text": "Biogas typically refers to a mixture of different gases produced by the breakdown of organic matter in the absence of oxygen. Biogas can be compressed, the same way natural gas is compressed to CNG, and used to power motor vehicles. In the UK, for example, biogas is estimated to have the potential to replace around 17% of vehicle fuel."}, {"url": "http://biogas.ifas.ufl.edu/FAQ.asp", "passage_text": "Biogas can be made at home or at a business from food waste, yard and grass trimmings, and some organic solid wastes. However, efficient use of biogas is more readily accomplished at larger scales. A typical home might cook for an hour per day on biogas from home waste sources. Biogas is principally a mixture of methane (CH 4) and carbon dioxide (CO 2) along with other trace gases. Biogas can be collected from landfills, covered lagoons, or enclosed tanks called anaerobic digesters."}, {"url": "http://www.bbc.co.uk/schools/gcsebitesize/science/triple_aqa/humans_and_environment/biofuels/revision/4/", "passage_text": "Biogas. Biogas is a biofuel produced from the anaerobic fermentation of carbohydrates in plant material or waste (eg food peelings or manure) by [bacterium: A type of single-celled microorganism.] bacteria. Biogas can be produced on a small scale in a biogas generator/digester, which can be made of simple materials. The carbohydrate-containing materials are fed in, and a range of bacteria anaerobically ferment the carbohydrate into biogas."}, {"url": "https://en.wikipedia.org/wiki/Biogas", "passage_text": "Biogas can be produced from raw materials such as agricultural waste, manure, municipal waste, plant material, sewage, green waste or food waste. It is a renewable energy source and in many cases exerts a very small carbon footprint. Biogas can be compressed, the same way natural gas is compressed to CNG, and used to power motor vehicles. In the UK, for example, biogas is estimated to have the potential to replace around 17% of vehicle fuel."}, {"url": "http://biogas.ifas.ufl.edu/FAQ.asp", "passage_text": "Biogas is commonly made from animal manure, sludge settled from wastewater, and at landfills containing organic wastes. However, biogas can also be made from almost any feedstock containing organic compounds, both wastes and biomass (energy crops). Carbohydrates, proteins and lipids are all readily converted to biogas. Biogas is principally a mixture of methane (CH 4) and carbon dioxide (CO 2) along with other trace gases. Biogas can be collected from landfills, covered lagoons, or enclosed tanks called anaerobic digesters."}, {"url": "http://www.greenworld365.com/what-is-biogas-and-whats-it-good-for/", "passage_text": "Biogas is made from organic matter. It’s produced by the natural fermentation process using materials such as: 1  farm waste (manure), 2  plant matter, 3  sewage, 4  biomass. "}]