[{"url": "http://www.cbsnews.com/news/pentatonix-on-new-ep-releases-pitch-perfect-2-and-the-future/", "passage_text": "The members of Pentatonix have been spending a lot of time together lately. Not only do some of the a cappella group's five members now live under the same roof, but they've also been hard at work on not one -- but two -- new EPs. The first fall release, PTX Vol."}, {"url": "http://www.last.fm/music/Pentatonix", "passage_text": "Pentatonix (often abbreviated as PTX) is an American a cappella group of five vocalists originating from Arlington, Texas. The members are Scott Hoying (baritone lead/harmony), Kirstie Maldonado (mezzo-soprano lead/harmony), Mitch Grassi (counter-tenor lead/harmony), Kevin Olusola (percussion), and Avi Kaplan (bass)."}, {"url": "https://en.wikipedia.org/wiki/Pentatonix", "passage_text": "The members in this group are Avi Kaplan, Scott Hoying, Kirstin Maldonado, Kevin Olusola, and Mitch Grassi. Their work, which is mostly in the pop style, consists of covers of existing songs, sometimes in the form of medleys, along with original material."}, {"url": "http://ptxofficial.tumblr.com/bio", "passage_text": "Pentatonix, a 5-member acapella group, began with three friends Kirstie Maldonado, Mitch Grassi, and Scott Hoying at Martin High School in Arlington, TX. Hearing of a local radio show hosting a competition to meet the cast of Glee, they arranged a trio version of “Telephone” and sent it in."}, {"url": "https://en.wikipedia.org/wiki/Pentatonix", "passage_text": "Pentatonix began with three friends who grew up together and were schoolmates at Martin High School in Arlington, Texas: Kirstin Kirstie Maldonado (born May 16, 1992), Mitch Grassi (born July 24, 1992), and Scott Hoying (born September 17, 1991)."}, {"url": "http://ptxofficial.tumblr.com/bio", "passage_text": "Bio. Pentatonix. Pentatonix, a 5-member acapella group, began with three friends Kirstie Maldonado, Mitch Grassi, and Scott Hoying at Martin High School in Arlington, TX. Hearing of a local radio show hosting a competition to meet the cast of Glee, they arranged a trio version of “Telephone” and sent it in."}, {"url": "http://www.casa.org/content/brief-interview-scott-hoying-pentatonix", "passage_text": "Pentatonix is one of sixteen groups competing on season three of the Sing-Off on NBC. Group members include: Mitch Grassi, Scott Hoying, Avi Kaplan, Kirstin Maldonado and Kevin Olusola. They will make their debut Monday, September 26 on the Season Premiere: Part 2."}]