[{"url": "http://www.mytaxattorney.com/_blog/Tax_Blog/post/Can-the-IRS-Seize-my-Assets/?news=Can_the_IRS_Seize_my_Assets", "passage_text": "During an IRS Seizure of Assets the value of the property would be $400,000. Due to the fact that there is a mortgage of $450,000, there is no equity and an IRS Seizure of Assets would not take place. An IRS Seizure of Assets cannot take place when there is no equity in a property."}, {"url": "http://www.mytaxattorney.com/_blog/Tax_Blog/post/Can-the-IRS-Seize-my-Assets/?news=Can_the_IRS_Seize_my_Assets", "passage_text": "If you have failed to pay your taxes, the IRS cannot garnish your wages. IRS Seizure of Assets is however uncommon. Only in extreme cases will the IRS Seize your assets. IRS Seizure of Assets is normally time consuming and not a very cost effective means of obtaining unpaid taxes."}, {"url": "http://www.mytaxattorney.com/_blog/Tax_Blog/post/Can-the-IRS-Seize-my-Assets/?news=Can_the_IRS_Seize_my_Assets", "passage_text": "If your home is worth $500,000 and you have a mortgage of $150,000 an IRS Seizure of Assets will likely take place. However, Congress has made laws that make is nearly impossible for the IRS to seize your primary residence thus IRS Seizure of Assets needs to be done on other assets."}, {"url": "http://www.mytaxattorney.com/Seizure-of-assets.htm", "passage_text": "How Assets are Seized: Before the IRS seizes your assets as a last resort, they will first file a tax lien on your property, which stakes claim and gives the IRS priority over other creditors. The IRS can impose a wage garnishment, which deducts part of your earnings to pay your taxes automatically."}, {"url": "http://www.taxdebthelp.com/tax-problems/tax-levy/irs-seizure", "passage_text": "The Internal Revenue Service (IRS) has broad powers to seize the property of a taxpayer who has neglected, failed, or refused to pay tax obligations as they became due. This legal seizure of a taxpayer’s property or assets to satisfy a tax debt by the IRS is referred to as a levy."}, {"url": "http://www.mytaxattorney.com/Seizure-of-assets.htm", "passage_text": "Before the IRS seizes your assets as a last resort, they will first file a tax lien on your property, which stakes claim and gives the IRS priority over other creditors. The IRS can impose a wage garnishment, which deducts part of your earnings to pay your taxes automatically."}, {"url": "http://www.taxfreedominstitute.com/tax-levies-and-llcs.html", "passage_text": "Likewise, if a shareholder of, say IBM, owes money to the IRS, the IRS cannot seize any of the corporation’s income or assets to satisfy that debt. The IRS can seize the shareholder’s stock and sell it. Also, the IRS can stand in the shareholder’s shoes vis-a-à vis his right to a share OF’ibm s profit. distribution"}, {"url": "http://www.taxationlawfirms.com/legal-advice/tax/protecting-assets/when-the-irs-begin-seize-assets-can-avoided", "passage_text": "The IRS does not want to levy your property, as it costs the IRS money to forcibly seize and then sell your assets. To avoid an IRS levy, consider: 1  Filing all returns and communicating with the IRS to work out a payment plan. 2  The IRS wants to get paid, and you can arrange an installment agreement with them."}]