[{"url": "http://www.answers.com/Q/Are_platypuses_poisonous", "passage_text": "Platypuses are not poisonous at all, but adult males have venomous spurs on their ankles. Female platypuses do not have venom, but they are born with spurs. These spurs fall o … ff by the time the young female is about a year old. 5 people found this useful."}, {"url": "http://animals.nationalgeographic.com/animals/mammals/platypus/", "passage_text": "The platypus is among nature's most unlikely animals. In fact, the first scientists to examine a specimen believed they were the victims of a hoax. The animal is best described as a hodgepodge of more familiar species: the duck (bill and webbed feet), beaver (tail), and otter (body and fur). Males are also venomous."}, {"url": "http://www.answers.com/Q/Are_platypuses_poisonous", "passage_text": "Only adult male platypuses are venomous. Male platypuses have a venomous spur on each of their hind legs, through which they can deliver a venom strong enough to kill a small … dog, and to cause almost paralysing agony to an adult human."}, {"url": "http://poisonousnature.biodiversityexhibition.com/en/card/duck-billed-platypus", "passage_text": "The platypus is classified among egg-laying mammals-monotremes. Male platypuses have a poison apparatus on their hind legs. There are poison glands in the thighs and a hollow spur near the heel. The sting is not dangerous to humans, but is extremely painful and causes rapid swelling in the stung area."}, {"url": "http://www.answers.com/Q/Are_platypuses_poisonous", "passage_text": "No. Adult male platypuses have venomous spurs on their ankles, which is different to being poisonous. Poison is ingested; venom is injected or administered by another simila … r method. Apart from several species of shrews and the Cuban solenodon, platypuses are the only venomous mammals."}, {"url": "http://www.answers.com/Q/Are_platypuses_poisonous", "passage_text": "as my interests are far and wide. Platypuses do not have a poisonous bite, but adult males have venomous spurs on their ankles. Apart from several species of shrews and the Cuban solenodon, platypuses are the only venomous mammals."}, {"url": "https://en.wikipedia.org/wiki/Platypus_venom", "passage_text": "Males have a pair of spurs on their hind limbs which secrete venom that is only seasonally active to breeding season, supporting the theory that the use of venom is for competition of mates only, not protection."}, {"url": "http://www.answers.com/Q/Is_a_platypus_dangerous", "passage_text": "It is one of the few venomous  mammals; the male Platypus has a spur on the hind foot which  delivers a poison capable of killing a small dog or causing severe  pain to humans-pain which can last for months. The unique  features of the platypus make it an important subject in the study  of biology."}]