[{"url": "http://www.accountingtools.com/cash-budget", "passage_text": "Cash Budget. Cash Budget Definition. The cash budget contains an itemization of the projected sources and uses of cash in a future period. This budget is used to ascertain whether company operations and other activities will provide a sufficient amount of cash to meet projected cash requirements."}, {"url": "http://www.investopedia.com/terms/l/liquidity.asp", "passage_text": "DEFINITION of 'Liquidity'. Liquidity describes the degree to which an asset or security can be quickly bought or sold in the market without affecting the asset's price. "}, {"url": "http://www.businessdictionary.com/definition/liquidity.html", "passage_text": "liquidity. 1.A measure of the extent to which a person or organization has cash to meet immediate and short-term obligations, or assets that can be quickly converted to do this. Definitions (3). 1.A measure of the extent to which a person or organization has cash to meet immediate and short-term obligations, or assets that can be quickly converted to do this. 2. Accounting: The ability of current assets to meet current liabilities. 3."}, {"url": "http://accountingdetails.com/financial_statement_analysis_accounting_ratios.htm", "passage_text": "Accounting Ratios | Financial Ratios: Learning Objectives: Define and explain the term accounting ratios. What are advantages and limitations of using accounting or financial ratios. How financial ratios are classified. Ratios simply means one number expressed in terms of another."}, {"url": "http://www.investorwords.com/8661/order_of_liquidity.html", "passage_text": "Use order of liquidity in a sentence. “ They reviewed their order of liquidity to determine their assets on hand and what it would take to liquidate them for a project. "}, {"url": "http://financial-dictionary.thefreedictionary.com/liquidity", "passage_text": "liquidity. A large position in cash or in assets that are easily convertible to cash. High liquidity produces flexibility for a firm or an investor in a low-risk position, but it also tends to decrease profitability. Liquidity. If you can convert an asset to cash easily and quickly, with little or no loss of value, the asset has liquidity. For example, you can typically redeem shares in a money market mutual fund at $1 a share."}, {"url": "http://www.myaccountingcourse.com/accounting-dictionary/liquidity", "passage_text": "Liquidity. Liquidity refers to the availability of cash or cash equivalents to meet short-term operating needs. In other words, liquidity is the amount of liquid assets that are available to pay expenses and debts as they become due. Obviously, the most liquid asset of all is cash."}, {"url": "http://www.accountingtools.com/liquidity-definition", "passage_text": "Liquidity. Definition: Liquidity is the ability of an entity to pay its liabilities in a timely manner, as they come due for payment under their original payment terms. "}]