[{"url": "http://www.grillingcompanion.com/recipe/how-to-grill-hamburgers/", "passage_text": "This is a sure sign that the meat is cooking through in the middle, which pushes the juices to the top. Flip the burgers over and grill for 1 - 2 minutes shorter than the time it took to start seeing the juices (about 3 - 4 minutes should do the trick for medium, but again, it depends on the grill). If you are making cheeseburgers, now is the time to slap the cheese on and close the lid just long enough to melt the cheese. Remove the burgers from the grill and let them sit for about 5 minutes while you toast a few buns on the grill! That's it, that's all you have to do to cook the perfect hamburgers on a grill."}, {"url": "http://www.grillingcompanion.com/recipe/how-to-grill-hamburgers/", "passage_text": "1 The real answer varies, based on the grill and the thickness of the hamburger, but one thing that does hold true is only flip once! 2  We'll answer the how long question in a bit, your meat will tell you when if you know what to look for. 3  But for now, resist the temptation to keep flipping, please! If you are making cheeseburgers, now is the time to slap the cheese on and close the lid just long enough to melt the cheese. Remove the burgers from the grill and let them sit for about 5 minutes while you toast a few buns on the grill! That's it, that's all you have to do to cook the perfect hamburgers on a grill."}, {"url": "http://www.addictedtogrilling.com/grilling-tips/how-grill-hamburgers", "passage_text": "Step #6: Flip your burgers then grill to an internal temperature of 135-150° F – about another 5 minutes. This will give you nice, juicy, hamburgers with just a hint of pink in the middle. If you experience flare-ups, follow the suggestions in step 5. Step #1: Prepare your grill for cooking over direct heat at 450-650 °F (high heat) – you'll be grilling your burgers at high heat right above the coals or gas burner."}, {"url": "http://www.bbqrecipesecrets.com/temperature.html", "passage_text": "Controlling the temperature of your grill is a challenge for even the most experiencing BBQ chef. Most men will grunt and tell you the hotter the better, but the truth is that temperature matters. Here's some tips on how to tell what temperature your grill is, and info on the ideal for different types of meat. Seafood should be cooked over medium heat. Direct heat is best at first to sear the surfaces, and then move it to indirect heat to finish cooking. Depending on the thickness of the meat, seafood should be cooked over a medium temperature grill for 3-6 minutes per side."}, {"url": "http://americanfood.about.com/video/How-to-Grill-a-Hamburger.htm", "passage_text": "After about 5 or 6 minutes it should be time to flip the burgers. This time may vary a little based on the temperature of your grill and the size of your burgers. A good sign is that you should start seeing juices collecting on the top of the burgers. "}, {"url": "http://www.thekitchn.com/how-to-grill-really-juicy-burgers-cooking-lessons-from-the-kitchn-51194", "passage_text": "1. Heat the Grill: Warm your grill to high heat, about 450°F or until you can hold your hand an inch over the grate for only one second. If cooking on a charcoal grill, arrange coals to create a high heat and a low heat cooking zone. 2. Prepare the Ground Beef: While the grill is warming, prepare the burgers. Gently pat the ground beef into a log roughly 2 feet long on a clean baking sheet. "}, {"url": "http://www.livestrong.com/article/454937-how-to-grill-burgers-at-the-proper-temperature/", "passage_text": "Step 4. Cook and flip the burgers. Cooking times vary based on the thickness of the burgers, temperature of the meat and grill temperature. For example, a 4-oz. burger takes about 5 minutes per side, while an 8-oz. burger takes about 14 minutes per side. In fact, it may be that 0.1 to 1 percent of commercial ground hamburger contains enough E. coli -- bacteria that can cause illness -- to make a child sick. To destroy all of the bacteria, you must grill the burgers to a specific interna"}, {"url": "http://www.fsis.usda.gov/wps/portal/fsis/topics/food-safety-education/get-answers/food-safety-fact-sheets/meat-preparation/ground-beef-and-food-safety/ct_index", "passage_text": "How should they be reheated? If ground beef is refrigerated promptly after cooking (within 2 hours; 1 hour if the temperature is above 90 °F), it can be safely refrigerated for about 3 or 4 days. If frozen, it should keep its quality for about 4 months. "}, {"url": "https://answers.yahoo.com/question/index?qid=20070522152055AAT14Ad", "passage_text": "Best Answer: depends on how you like yours cooked. internal temps (instant read thermometer)before resting (take off grill): very rare 115-120F rare 120-130F Med Rare 130-135F med 135-150F med well 150-165F well 165F+ the meat will continue to cook (about another 5 degrees) after removing from the grill. Report Abuse. all hamburgers and ground meat must be cooked to in internal temperature of 155 degrees. during the grinding process the meat might have come into contact with bacteria. the most common for ground meat is ecoli which comes from feces."}]