[{"url": "http://www.answers.com/Q/The_thickness_of_the_upper_mantle", "passage_text": "The thickness of the Earth's mantle is about 2900 km and it's upper boundary is about 100km deep. There is a really cool cutaway drawing available by using the Wikipedia link. "}, {"url": "http://virtualuppermantle.info/Default.htm", "passage_text": "The upper boundary that separates the upper mantle of the Earth's crust is defined by sudden increase in seismic velocity (which was first noted by Andrija Mohorovichich in 1909) - it is the Moho discontinuity (Moho). Moho is located at a depth of 5 to 70 kilometers from the Earth's surface. Earth's upper mantle is a highly viscous layer, with a capacity up to 600 kilometers, which lies between the crust and lower mantle of the Earth."}, {"url": "http://virtualuppermantle.info/Default.htm", "passage_text": "The lower boundary separating the upper and lower mantle-is a transitional zone. The transition zone is located in the depth interval 400 - 650 kilometers from the Earth's surface. The transition zone is an area of great complexity; it physically separates the upper and lower mantle. Earth's upper mantle is a highly viscous layer, with a capacity up to 600 kilometers, which lies between the crust and lower mantle of the Earth."}, {"url": "http://study.com/academy/lesson/upper-mantle-definition-facts-temperature-composition.html", "passage_text": "The thickness of the upper mantle is between 200 and 250 miles. The entire mantle is about 1800 miles thick, which means the lower mantle makes up the bulk of this part of the Earth. The temperature of the mantle near the crust ranges from 900 to 1600 degrees Fahrenheit. It gets hotter at greater depths."}, {"url": "http://loki.stockton.edu/~hozikm/geol/Courses/The%20Earth/Content%20Web%20Pages/Kim/mantle.htm", "passage_text": "The upper mantle contains 10.3 % of the Earth's mass. The upper mantle contains 15.3% of the mantle-crust mass. Olivine (Mg, Fe) and pyroxene (Mg, Fe) have been the primary minerals found in this way. Part of the upper mantle called the asthenosphere. It thins to a few kilometers at ocean spreading centres, thickens to about 100 -150 km under the older parts of ocean basins and is up to 250 - 300 km thick under continental shield areas. "}, {"url": "http://www.kids-earth-science.com/the-earths-mantle.html", "passage_text": "Lower mantle. The transition zone between the upper and lower mantle is at a depth of about 220 km. Inge Lehmann was the first to observe evidence of this boundary. The lower mantle reaches a depth of 2,890 km. where it transitions into the Earth's outer core. The mantle is 2,890 km (1,800 mi) thick. It is 85% of the Earth's volume and encloses the liquid core. The mantle is divided into the upper and l"}, {"url": "https://en.wikipedia.org/wiki/Mantle_(geology)", "passage_text": "Two main zones are distinguished in the upper mantle: the inner asthenosphere composed of plastic flowing rock of varying thickness, on average about 200 km (120 mi) thick, and the lowermost part of the lithosphere composed of rigid rock about 50 to 120 km (31 to 75 mi) thick. The interior of Earth, similar to the other terrestrial planets, is chemically divided into layers. The mantle is a layer between the crust and the outer core. Earth's mantle is a silicate rocky shell with an average thickness of 2,886 kilometres (1,793 mi). The mantle makes up about 84% of Earth's volume. It is predominantly solid but in geological time it behaves as a very viscous fluid"}, {"url": "http://www.answers.com/Q/Thickness_of_upper_mantle", "passage_text": "The thickness of the Earth's mantle is about 2900 km and it's upper boundary is about 100km deep. There is a really cool cutaway drawing available by using the Wikipedia link. …. + 53 others found this useful. Making the world better, one answer at a time. The thickness of upper mantle discontinuities (at depths around 410 km and 660 km) provides a critical clue to our understanding of deep earth."}]