[{"url": "http://www.bayarealyme.org/about-lyme/what-causes-lyme-disease/", "passage_text": "Borrelia Burgdorferi. Lyme disease is an infection caused by several strains of the bacteria Borrelia burgdorferi (Bb) . The bacteria is transmitted to humans through the bite of an infected tick. These ticks can also transmit other diseases and infect pets and livestock. The tick that transmits Lyme is so small you may not notice it"}, {"url": "https://en.wikipedia.org/wiki/Borrelia", "passage_text": "Borrelia is a genus of bacteria of the spirochete phylum. It causes borreliosis, a zoonotic, vector-borne disease transmitted primarily by ticks and some by lice, depending on the species. The 36 known species of Borrelia are named after the French biologist Amedee Amédée. borrel Of the 36 known species of Borrelia, 12 are known to cause Lyme disease or borreliosis and are transmitted by ticks. The major Borrelia species causing Lyme disease are Borrelia burgdorferi, Borrelia afzelii, and Borrelia garinii."}, {"url": "http://www.bayarealyme.org/about-lyme/what-causes-lyme-disease/borrelia-burgdorferi/", "passage_text": "Borrelia Burgdorferi. Lyme disease is caused by a number of different strains and species of Borrelia bacteria, generally Borrelia burgdorferi in the United States and Borrelia afzelii and Borrelia garinii in Europe. Depending on the strain of Borrelia, the bacteria will be more or less likely to spread through the bloodstream to distant sites in the body (Wormser, Brisson, Liveris et. al., 2008). When it does spread, it can cause arthritic, neurological, cardiovascular and other symptoms."}, {"url": "http://www.urmc.rochester.edu/encyclopedia/content.aspx?ContentTypeID=167&ContentID=borrelia_antibody_lyme", "passage_text": "This test measures the level of Borrelia antibodies in your blood. Borrelia burgdorferi bacteria cause Lyme disease. The bacteria are spread to humans through the bite of an infected tick. If not treated, Lyme disease can cause meningitis, or an infection of the tissues covering the brain and spinal cord. "}, {"url": "https://en.wikipedia.org/wiki/Borrelia_burgdorferi", "passage_text": "Borrelia burgdorferi is a bacterial species of the spirochete class of the genus Borrelia. B. burgdorferi exists in North America and Europe and is the predominant causative agent of Lyme disease. Borrelia species are considered diderm (double-membrane) bacteria rather than Gram positive or negative."}, {"url": "https://microbewiki.kenyon.edu/index.php/Borrelia_burgdorferi_and_Lyme_Disease", "passage_text": "The disease is caused by three species of bacteria all belonging to Borrelia-Borrelia burgdorferi, Borrelia afzelii, and Borrelia garinii. Borrelia burgdorferi is the main cause of Lyme disease in North America, where the other two species affect Europe[1, 2]. [ https://link http://campother.blogspot.com/2012/02/memo-borrelia-are-not-gram-negative.html. The pathogenic bacterium Borrelia burgdorferi is the spirochete that causes Lyme disease. These spirochetes have distinctive characteristics that allow them to cause chronic infection and remain in an infected human."}, {"url": "http://www.melisa.org/metals-disease/diseases/borrelialyme-disease/", "passage_text": "Lyme disease is a bacterial infection caused by a spirochete, a type of bacteria, called Borrelia burgdorferi, which is passed to the patient by a tick bite. Lyme disease, also called active lyme borreliosis, has many symptoms, but skin disorders, arthritis and various neurological symptoms may be present. "}, {"url": "http://healthinfo.spectrumhealth.org/Library/TestsProcedures/167,borrelia_antibody_lyme", "passage_text": "This test measures the level of Borrelia antibodies in your blood. Borrelia burgdorferi bacteria cause Lyme disease. The bacteria are spread to humans through the bite of an infected tick. If not treated, Lyme disease can cause meningitis, or an infection of the tissues covering the brain and spinal cord. "}, {"url": "http://web.mst.edu/~microbio/BIO221_2007/B_vincentii.htm", "passage_text": "Borrelia vincentii is an organism that exists normally in the human mouth in low concentrations and safe proportions. It is an anaerobic spirochete that is also Gram-negative. When allowed to grow past regular conditions many adverse effects can occur causing much pain and discomfort to the mouth and throat. "}, {"url": "http://www.urmc.rochester.edu/encyclopedia/content.aspx?ContentTypeID=167&ContentID=borrelia_antibody_lyme_csf", "passage_text": "This test looks for Borrelia antibodies in your cerebrospinal fluid (CSF). Borrelia burgdorferi bacteria cause Lyme disease. The bacteria are spread to humans through the bite of an infected tick. If not treated, Lyme disease can cause meningitis, or an infection of the tissues covering the brain and spinal cord. "}]