[{"url": "http://www.ancestry.com/name-origin?surname=halcon", "passage_text": "You can see how Halcon families moved over time by selecting different Census years. Census records can tell you little-known facts about your ancestors such as birthplace, occupation and value of personal estate. Find out where people with the family name Halcon lived before coming to the United States. Using Ancestry, you can search through passenger arrival records, naturalization records, border crossings, emigration records, passport applications, and even convict transportation records. Halcon census records. Census records can offer a lot of little known facts about your Halcon ancestors, such as occupation. Occupation can tell you about your ancestors' social status and economic status."}, {"url": "http://genealogy.about.com/od/surnames_m/", "passage_text": "MAJEWSKI-Surname Meaning | Origin for the Surname Majewski Genealogy. Share. Learn the meaning and origin of the last name Maldonado, plus find genealogy and family trees for the Maldonado surname. MARSHALL-Surname Meaning | Origin for the Surname Marshall Genealogy. Share. Learn the meaning and origin of the last name Martin, plus find genealogy and family trees for the Martin surname."}, {"url": "http://genealogy.about.com/od/surnames_m/", "passage_text": "MILNE-Surname Meaning | Origin for the Surname Milne Genealogy. Share. Learn the meaning and origin of the last name Mitchell, plus find genealogy and family trees for the Mitchell surname. MARSHALL-Surname Meaning | Origin for the Surname Marshall Genealogy. Share. Learn the meaning and origin of the last name Martin, plus find genealogy and family trees for the Martin surname."}, {"url": "http://genealogy.about.com/od/surname_meaning/p/taylor.htm", "passage_text": "TAYLOR Surname Meaning & Origin: An English occupational name for a tailor, from Old French tailleur for tailor which comes from the Latin taliare, meaning to cut.. Taylor is among the most commonly found surnames, due to its popularity as a medieval occupation. Surname Origin: English."}, {"url": "http://genealogy.about.com/od/surnames_m/", "passage_text": "METZ-Surname Meaning | Origin for the Surname Metz Genealogy. Share. Learn the meaning and origin of the last name Meyer, plus find genealogy and family trees for the Meyer surname. MARSHALL-Surname Meaning | Origin for the Surname Marshall Genealogy. Share. Learn the meaning and origin of the last name Martin, plus find genealogy and family trees for the Martin surname."}, {"url": "http://www.searchforancestors.com/surnames/origin/", "passage_text": "Surnames usually originated from one of the five following sources: (although the same surname may have multiple meanings from different sources in different places). 1  From the first name of father used with either a suffix or prefix (which differ from country to country) to identify the person as son of. 2  Examples: What does my surname mean?. If you have ever asked this question and wondered about the origin of your last name, you will find your surname may answer one of the questions of where your ancestors lived, or what they did for a living, or what was their personality like, or how they looked many hundreds of years ago."}, {"url": "http://www.ancestry.com/name-origin?surname=halcon", "passage_text": "An unusually short lifespan might indicate that your ancestors lived in harsh conditions. A short lifespan might also indicate health problems that were once prevalent in your family. The SSDI is a searchable database of more than 70 million names. You can find birthdates, death dates, addresses and more. Halcon census records. Census records can offer a lot of little known facts about your Halcon ancestors, such as occupation. Occupation can tell you about your ancestors' social status and economic status."}, {"url": "http://genealogy.about.com/od/surnames_m/", "passage_text": "MICHEL-Surname Meaning | Origin for the Surname Michel Genealogy. Share. Learn the meaning and origin of the last name Miller, plus find genealogy and family trees for the Miller surname. MARSHALL-Surname Meaning | Origin for the Surname Marshall Genealogy. Share. Learn the meaning and origin of the last name Martin, plus find genealogy and family trees for the Martin surname."}]