[{"url": "http://iom.nationalacademies.org/Reports/2002/Dietary-Reference-Intakes-for-Energy-Carbohydrate-Fiber-Fat-Fatty-Acids-Cholesterol-Protein-and-Amino-Acids.aspx", "passage_text": "1 Adults should get 45 percent to 65 percent of their calories from carbohydrates, 20 percent to 35 percent from fat, and 10 to 35 percent from protein. 2  Acceptable ranges for children are similar to those for adults, except that infants and younger children need a slightly higher proportion of fat (25 -40 percent)."}, {"url": "http://www.livestrong.com/article/294874-what-percentage-of-your-total-calories-per-day-should-come-from-protein/", "passage_text": "Calories. You should get between 10 and 35 percent of your total calories from protein. For a person on a 2,000-calorie diet, that means consuming 50 to 175 grams of protein per day."}, {"url": "http://healthyeating.sfgate.com/recommended-amount-percent-carbohydrates-per-day-7287.html", "passage_text": "Grams of Carbs. Determine the number of grams of carbs you need each day by calculating 45 to 65 percent of your total calorie intake, and dividing by 4. For example, if you eat a 2,000-calorie diet, shoot for 225 to 325 grams of carbs per day; and if you eat 2,500 calories a day, aim for 281 to 406 grams of carbs."}, {"url": "http://healthyeating.sfgate.com/recommended-amount-percent-carbohydrates-per-day-7287.html", "passage_text": "Percent of Calories. According to the Institute of Medicine, children and adults should consume 45 to 65 percent of their calorie intake as carbohydrates, and at least 130 grams of carbs per day."}, {"url": "http://healthyeating.sfgate.com/recommended-grams-nutrients-per-day-healthy-weight-loss-6294.html", "passage_text": "If you consume 50 percent of your energy intake from carbs and 20 percent from protein, aim to eat 30 percent of your calories from fat, which is equivalent to 40 grams when following a 1,200-calorie weight loss diet and 53 grams of fat when consuming 1,600 calories per day."}, {"url": "http://www1.msjc.edu/hs/nutr100/energy_macro_need.html", "passage_text": "45-65% of total calories from carbohydrates); the average fat gram need for women (1) is 40-65 grams and 65-95 grams for men (2) (assuming approx. 20-35% of total calories from fats); protein intake should be approximately 50-100 grams for women (1) and approximately 60-150 grams for men (2) Fiber Calculator."}, {"url": "http://thescienceofeating.com/food-combining-how-it-works/calories-fat-carbs-protein-per-day/", "passage_text": "As a general rule, between 10 percent and 15 percent of your total calories should come from protein. So, if you consume 2,000 calories per day, at least 200 should come from protein, or about 50 grams. You should try to eat around one gram of protein per one kilogram of body weight, or around 0.4 grams per pound. An easier way to figure this out in your head is to take your weight, divide it in half, and subtract 10."}]