[{"url": "http://www.ohbabynames.com/meaning/name/baylee/564", "passage_text": "Popularity of the Name Baylee. As mentioned above, Bailey is considered a unisex name in the U.S. but Baylee is a spelling variation that has only appeared on the female naming charts (although Backstreet Boy Brian Littrell used the Baylee spelling for his son). The other location-based origin comes from the town of Bailey in Lancashire, which gets its name from the Old English words “bēg” (berry) and “lēah” (wood, clearing). The surnames in the forms of Baylly and Baylegh have both been around since medieval times. It’s not clear when the name was adopted as a personal name."}, {"url": "https://en.wikipedia.org/wiki/Bailey_(given_name)", "passage_text": "Bailey is a given name taken from an English surname meaning  bailiff . The name is in use for both boys and girls in the United States. Bailey was the 666th most popular name for American boys born in 2007 and the 83rd most popular name for American girls. "}, {"url": "http://www.ourbabynamer.com/meaning-of-Bailey.html", "passage_text": "English names generally consist of a given name, middle name and family name. Many English speaking countries have fairly flexible naming laws. This allows the multicultural families that live in these countries to merge the naming conventions of their faiths or previous nationalities with their current homeland. "}, {"url": "http://www.thinkbabynames.com/meaning/0/Baylee", "passage_text": "Baylee /bay-lee/ [2 sylls.] as a girls' name (also used less generally as boys' name Baylee) is of Old English origin, and the meaning of Baylee is berry clearing; bailiff; city fortification. Baylee is an alternate spelling of Bailey (Old English): occupational name. Compare last name Baley. Baylee is an uncommonly occurring first name for women. Baylee is also an uncommon last name for all people. (2000 U.S. Census). Shown below is the baby name popularity of Baylee for girls. Baylee entered the list in 1995 and reached its peak rank of #296 in the U.S. in the year 1997, and is presently at #361."}, {"url": "http://www.ourbabynamer.com/meaning-of-Baylee.html", "passage_text": "English names generally consist of a given name, middle name and family name. Many English speaking countries have fairly flexible naming laws. This allows the multicultural families that live in these countries to merge the naming conventions of their faiths or previous nationalities with their current homeland. It ranked 7073 in popular baby names for boys with 11 occurrences. View the Baylee Name Popularity Page to see how the popularity trend for Baylee has changed since 1880, or to compare the popularity of Baylee to other names. Baylee is a variant spelling of Bailey."}, {"url": "http://www.ohbabynames.com/meaning/name/baylee/564", "passage_text": "Etymology & Historical Origin-Baylee. Baylee is an Americanized respelling of Bailey. Bailey is the transferred use of an English surname, derived from either an occupational name or a location. From an occupational perspective, Bailey comes from the Middle English word “baill” which indicated a steward or an administrative official (i.e., a bailiff or an officer of the court). The other location-based origin comes from the town of Bailey in Lancashire, which gets its name from the Old English words “bēg” (berry) and “lēah” (wood, clearing). The surnames in the forms of Baylly and Baylegh have both been around since medieval times. It’s not clear when the name was adopted as a personal name."}, {"url": "http://www.meaning-of-names.com/english-names/baylee.asp", "passage_text": "Meaning of Baylee. English name. In English, the name Baylee means-bailiff. Other origins for the name Baylee include-English, French.The name Baylee is a unisex name and can be used for a boy or girl name (male or female). English Name Meaning-bailiff. "}, {"url": "http://www.behindthename.com/names/usage/english/2", "passage_text": "BARCLAY m Scottish, English (Rare). From a Scottish surname which was likely derived from the English place name Berkeley, meaning birch wood in Old English. BARNABAS m German, English (Rare), Biblical, Biblical Latin, Biblical Greek. Greek form of an Aramaic name ... From the name Bricius, which was probably a Latinized form of a Gaulish name meaning speckled ... [more]. BRIDGER m English (Modern). From an English surname which originally indicated a person who lived near or worked on a bridge."}, {"url": "http://www.ourbabynamer.com/meaning-of-Baylee.html", "passage_text": "Baylee is generally used as a girl's name. It consists of 6 letters and 2 syllables and is pronounced Bay-lee. In the U.S. in 2014, it ranked 361 in baby name popularity for girls with 896 occurrences. It ranked 7073 in popular baby names for boys with 11 occurrences. View the Baylee Name Popularity Page to see how the popularity trend for Baylee has changed since 1880, or to compare the popularity of Baylee to other names. Baylee is a variant spelling of Bailey."}]