[{"url": "https://en.wikipedia.org/wiki/Pat_Conroy", "passage_text": "In 1986, Conroy published what is arguably his most acclaimed and well-known novel, The Prince of Tides. The book tells the story of Tom Wingo, an unemployed South Carolina teacher who goes to New York City to help his sister, Savannah, a poet who has attempted suicide, to come to terms with their past."}, {"url": "http://www.patconroy.com/the-prince-of-tides.php", "passage_text": "The Atlanta Journal. A literary gem…The Prince of Tides is in the best tradition of novel writing. It is an engrossing story of unforgettable characters…. Its description of rural South Carolina and the effect of that ambiance on those who live there is masterful."}, {"url": "https://en.wikipedia.org/wiki/The_Prince_of_Tides", "passage_text": "The Prince of Tides. From Wikipedia, the free encyclopedia. The Prince of Tides is a 1991 romantic drama film based on the 1986 novel of the same name by Pat Conroy; the film stars Barbra Streisand and Nick Nolte. It tells the story of the narrator's struggle to overcome the psychological damage inflicted by his dysfunctional childhood in South Carolina."}, {"url": "http://www.rogerebert.com/reviews/prince-of-tides-1991", "passage_text": "Her son hates her, but cannot free himself of her. The Prince of Tides is based on a novel by Pat Conroy, who also wrote The Lords of Discipline, another novel in which the lives of young men are scarred by the weaknesses of their elders."}, {"url": "https://en.wikiquote.org/wiki/The_Prince_of_Tides", "passage_text": "The Prince of Tides is a 1991 American drama film based on the 1986 novel of the same name by Pat Conroy and starring Barbra Streisand and Nick Nolte. It tells the story of the narrator's struggle to overcome the psychological damage inflicted by his dysfunctional childhood in South Carolina."}, {"url": "http://www.patconroy.com/the-prince-of-tides.php", "passage_text": "A seductive narrative, told with bravado, flourishes, portentous foreshadowing, sardonic humor and eloquent turns of phrase...For sheer storytelling finesse, Conroy will have few rivals.. Publishers Weekly. With The Prince of Tides, it is Pat Conroy who has made the language sing and bleed at the same time."}, {"url": "https://en.wikipedia.org/wiki/Pat_Conroy", "passage_text": "Pat Conroy (born October 26, 1945) is a New York Times bestselling author who has written several acclaimed novels and memoirs. Two of his novels, The Prince of Tides and The Great Santini, were made into Oscar-nominated films. He is recognized as a leading figure of late-20th century Southern literature."}]