[{"url": "http://news.morningstar.com/classroom2/course.asp?docId=5399&page=1", "passage_text": "Why Insure Municipal Bonds? A municipal bond is an obligation of debt issued by states and city and local governments to raise money for the public funding of projects and services such as schools and housing. Municipal bond insurance is an insurance policy on the bond and is underwritten by a private insurance company. Insurance provides investors with the security that no matter what happens to the finances of the government that issues the bond, the bond's interest and principal payments will be made. "}, {"url": "https://en.wikipedia.org/wiki/Surety_bond", "passage_text": "A surety bond or surety is a promise by a surety or guarantor to pay one party (the obligee) a certain amount if a second party (the principal) fails to meet some obligation, such as fulfilling the terms of a contract. Through a surety bond, the surety agrees to uphold — for the benefit of the obligee — the contractual promises (obligations) made by the principal if the principal fails to uphold its promises to the obligee."}, {"url": "https://en.wikipedia.org/wiki/Bond_insurance", "passage_text": "Bond insurance is a form of credit enhancement that generally results in the rating of the insured security being the higher of (i) the claims-paying rating of the insurer and (ii) the rating the bond would have without insurance (also known as the “underlying” or “shadow” rating). It can also be a function of the interest savings realized by an issuer from employing bond insurance or the increased value of the security realized by an owner who purchased bond insurance."}, {"url": "https://en.wikipedia.org/wiki/Bond_insurance", "passage_text": "Bond insurance (also known as financial guaranty insurance) is a type of insurance whereby an insurance company guarantees scheduled payments of interest and principal on a bond or other security in the event of a payment default by the issuer of the bond or security. It can also be a function of the interest savings realized by an issuer from employing bond insurance or the increased value of the security realized by an owner who purchased bond insurance."}, {"url": "http://www.munibondadvisor.com/BondInsurance.htm", "passage_text": "Issuers that meet certain credit criteria can purchase municipal bond insurance policies from private companies. The insurance guarantees the payment of principal and interest on a bond issue if the issuer defaults. Historically, bond insurance is purchased through a one time payment of a premium at the time of the bond closing. (Depending on the issue BAM may have both upfront and annual premiums.) Not all issues qualify for insurance."}, {"url": "http://www.investopedia.com/terms/i/insurancebond.asp", "passage_text": "DEFINITION of 'Insurance Bond'. An investment instrument that is offered by life insurance companies. The investment is provided in the form of a single premium life insurance policy. These bonds are often used as investments in the U.K. and other countries. Also known as an investment bond. BREAKING DOWN 'Insurance Bond'. Insurance bonds are very simple investments that allow investors to save for the long term. Investors who hold their bonds for more than 10 years without making any withdrawals in that time are able to receive their earnings tax free."}, {"url": "http://www.investopedia.com/terms/b/bond-insurance.asp", "passage_text": "AAA |. A type of insurance policy that a bond issuer purchases that guarantees the repayment of the principal and all associated interest payments to the bondholders in the event of default. Bond issuers buy insurance to enhance their credit rating to 'AAA' in order to reduce the amount of interest that it needs to pay. BREAKING DOWN 'Bond Insurance'. Once bond insurance has been purchased, the issuer's bond rating will no longer be applicable and instead, the bond insurer's credit rating will be applied to the bond instead. By design, bondholders should not encounter too much disruption if the issuer of a bond in their portfolio goes into default"}, {"url": "https://en.wikipedia.org/wiki/Bond_insurance", "passage_text": "The premium requested for insurance on a bond is a measure of the perceived risk of failure of the issuer. It can also be a function of the interest savings realized by an issuer from employing bond insurance or the increased value of the security realized by an owner who purchased bond insurance."}, {"url": "http://www.investopedia.com/terms/b/bond-insurance.asp", "passage_text": "DEFINITION of 'Bond Insurance'. A type of insurance policy that a bond issuer purchases that guarantees the repayment of the principal and all associated interest payments to the bondholders in the event of default. Bond issuers buy insurance to enhance their credit rating to 'AAA' in order to reduce the amount of interest that it needs to pay. BREAKING DOWN 'Bond Insurance'. Once bond insurance has been purchased, the issuer's bond rating will no longer be applicable and instead, the bond insurer's credit rating will be applied to the bond instead. By design, bondholders should not encounter too much disruption if the issuer of a bond in their portfolio goes into default"}]