[{"url": "http://wildfoodsandmedicines.com/salal/", "passage_text": "Gaultheria shallon. Identifying Salal: Salal is an evergreen shrub that grows in lush thickets in both evergreen forests and in sunny areas where there is moisture and good drainage. Plants grow to 5 feet tall. Leaves are thick, dark green on top and waxy. Salal, a backdrop in Northwest woodlands, is so common that many people barely notice it. Its shiny deep-green leaves remain beautiful all year. Stems are long-lasting when cut and are a valued addition to floral arrangements."}, {"url": "https://simple.wikipedia.org/wiki/Salal", "passage_text": "Salal is the common English name of a plant in the family Ericaceae. The Lewis and Clark Expedition found it in North America. The expedition took place from 1804 to 1806. "}, {"url": "http://www.gardenguides.com/taxonomy/salal-gaultheria-shallon/", "passage_text": "Submit. The Salal (Shallon) is generally described as a perennial subshrub or shrub. This is native to the U.S. (United States) has its most active growth period in the spring and summer and fall. Comments. Submit. The Salal (Shallon) is generally described as a perennial subshrub or shrub. This is native to the U.S. (United States) has its most active growth period in the spring and summer and fall. The Salal (Shallon) has green foliage and inconspicuous white flowers, with an abuncance of conspicuous purple fruits or seeds."}, {"url": "http://portlandnursery.com/plants/natives/gaultheria.shtml", "passage_text": "GAULTHERIA SHALLON: Salal. Our native Salal is so common and adaptable to our region that it tends to be overlooked if not totally ignored by the gardener; but it definitely deserves a second look: It is a lush shrub, growing typically 3-6 feet tall, forming thickets (good bird habitat) in shade or partial shade."}, {"url": "https://en.wikipedia.org/wiki/Gaultheria_shallon", "passage_text": "Gaultheria shallon is a leathery-leaved shrub in the heather family (Ericaceae), native to western North America. In English, it is known as salal, shallon, or simply gaultheria in Britain. "}, {"url": "http://www.thegardenhelper.com/salal.html", "passage_text": "Normally, the only pruning that Salal needs is to remove dead wood or to cut back an overgrown plant in the spring. Salal berries are edible and are often used to make jellies. Salal Plants are native to most of the west coast, from southern California to British Columbia. They are excellent plants for woodland settings, as companion plants for Rhododendrons, Azaleas and hardy Ferns. Salal (Gaultheria shallon) is hardy in USDA zones 5-9"}, {"url": "http://www.wisegeek.com/what-is-salal.htm", "passage_text": "Salal, also commonly called Gaultheria shallon Pursh or Oregon wintergreen, is a berry-producing shrub native to North America. It is specifically found in California, Alaska, and across the Pacific Northwest. It grows best in climates that are warm and moist, but can survive in dry climates as well. Historically, salal has been used to treat heartburn. Salal leaves have been used to treat insect bites. Some people believe that salal can be used to fight tuberculosis, although there is no definitive proof of this claim. The leaves of the salal plants has been used for the treatment of ulcers."}, {"url": "http://www.merriam-webster.com/dictionary/salal", "passage_text": "Definition of SALAL. : a small evergreen shrub (Gaultheria shallon) of the heath family found on the Pacific coast of North America and bearing edible grape-sized dark purple berries. ADVERTISEMENT"}]