[{"url": "http://www.sheknows.com/baby-names/name/adrianna", "passage_text": "French Meaning: The name Adrianna is a French baby name. In French the meaning of the name Adrianna is: From Adria, the Adriatic sea region. Also means dark. American Meaning: The name Adrianna is an American baby name. In American the meaning of the name Adrianna is: From Adria, the Adriatic sea region. Also means dark. "}, {"url": "http://www.sheknows.com/baby-names/name/adriana", "passage_text": "American Meaning: The name Adriana is an American baby name. In American the meaning of the name Adriana is: Dark. Latin Meaning: The name Adriana is a Latin baby name. In Latin the meaning of the name Adriana is: from the Latin Hadrianus meaning of Adria, or of the Adriatic. Also means dark. Shakespearean Meaning: The name Adriana is a Shakespearean baby name. "}, {"url": "http://www.ourbabynamer.com/meaning-of-Adrianna.html", "passage_text": "Adrianna is a form of the name Adrian. Adrianna is a variant spelling of Adrienne. Adrianna has the diminutive (nickname) Adrie. Adrianna falls into the place name category. Adrianna is generally used as a girl's name. It consists of 8 letters and 4 syllables and is pronounced A-dri-a-nna. In the U.S. in 2014, it ranked 252 in baby name popularity for girls with 1272 occurrences."}, {"url": "http://www.urbandictionary.com/define.php?term=adrianna", "passage_text": "Adrianna. Is the name of a very sexy and attractive young woman. Originally from Italian, meaning dark or rich, this girl is usually of hispanic descent. She has deep brown eyes, long black hair and her alluring personality makes everyone want to become her friend. "}, {"url": "http://babynames.allparenting.com/list/French_Baby_Names/Adrianna/details/", "passage_text": "Baby names meanings search results: The name Adrianna is a baby girl name. The name Adrianna comes from the French origin. In French The meaning of the name Adrianna is: From Adria, the Adriatic sea region. Also means dark"}, {"url": "https://answers.yahoo.com/question/index?qid=20100123014800AA3y7sV", "passage_text": "Adrianna has its origins in the Latin language. It is used largely in the English and Polish languages. Adrianna is a variant of Adriana (Czech, English, German, Italian, Polish, Portuguese, Romanian, Slavic, and Spanish). Adrianna is popular as a baby girl name, and it is also viewed as trendy. Source(s): http://www.babynamespedia.com/meaning/Ad..."}, {"url": "http://www.meaning-of-names.com/greek-names/adrianna.asp", "passage_text": "Greek name. In Greek, the name Adrianna means-Wealthy.. Other origins for the name Adrianna include-Greek, French, French.The name Adrianna is most often used as a girl name or female name. Greek Name Meaning-Wealthy. Origin-Greek. "}, {"url": "http://www.thenamemeaning.com/adrianna/", "passage_text": "Search comprehensively and find the name meaning of Adrianna and its name origin or of any other name in our database. Also note the spelling and the pronunciation of the name Adrianna and check the initials of the name with your last name to discover how it looks and sounds. "}, {"url": "http://www.thinkbabynames.com/meaning/0/Adrianna", "passage_text": "Adrianna /adri-an-na/ [4 sylls.] as a name for girls. Adrianna's name origin is Latin, and Adrianna means from Hadria. Adrianna is a variant transcription of Adrienne (Latin): French feminine transcription of Adrian. Adriano is a conventional surname. Kreatif forms: Adrianau, Adrianla, Adriannaau. "}, {"url": "http://www.answers.com/Q/What_does_the_name_Adrianna_mean", "passage_text": "Adrianna is a Latin name, meaning Person from Hadria (a place in northern Italy). it means loving cares for others. Adrianna is actually #17 on the best name list of 2009 so far. "}]