[{"url": "http://www.carsdirect.com/car-repair/3-symptoms-of-a-bad-radiator-water-pump", "passage_text": "Regardless of how meticulously you maintain a vehicle, the radiator water pump will eventually fail. This engine component is responsible for continuously pumping coolant throughout the cooling system. It is subjected to extreme temperatures, and because it is attached to the engine, spins at very high revolutions."}, {"url": "http://www.autos.com/car-maintenance/3-common-radiator-problems-and-how-to-avoid-them", "passage_text": "Check if the auxiliary fans are working and check coolant hoses for possible leaks. A greenish or bluish fluid leak could mean a broken or worn out hose. If no leak is evident check the coolant level in the coolant reservoir. DO NOT OPEN the engine radiator cap. Fill the reservoir with water or coolant when necessary."}, {"url": "http://www.ehow.com/list_7686812_symptoms-radiator-going-bad.html", "passage_text": "Because the function of the radiator is to disperse heat from the car’s liquid coolant and then return the coolant to the engine, the fluid must flow through the radiator and usually collects in the radiator reservoir. If the radiator fails or if it becomes cracked, the coolant may begin to leak out."}, {"url": "http://www.ford-trucks.com/forums/1125570-what-are-signs-of-a-bad-radiator.html", "passage_text": "The bottom hose will be cooler than the top. The hot coolant comes out of the engine through the top hose, then goes through the radiator where it cools down. Then the coolant goes through the lower radiator hose back to the engine to repeat the cycle. Sounds like your cooling system is okay. With a thermostat the engine will warm up in only a few minutes of running."}, {"url": "http://www.supras.com/06/techcenter/display.php?QID=22", "passage_text": "You'll see occasional bubbles (and in some cases, large burps) of air in the radiator. Keep adding coolant slowly (don't add much more than to cover the radiator core until the bubbling slows down. As you reach the 20 minute mark, you should see a steady stream of coolant without bubbles and burps."}, {"url": "http://www.ford-trucks.com/forums/1125570-what-are-signs-of-a-bad-radiator.html", "passage_text": "Posts: 10,783. The bottom hose will be cooler than the top. The hot coolant comes out of the engine through the top hose, then goes through the radiator where it cools down. Then the coolant goes through the lower radiator hose back to the engine to repeat the cycle. Sounds like your cooling system is okay. With a thermostat the engine will warm up in only a few minutes of running."}, {"url": "http://www.autoupkeep.com/QAcooling.htm", "passage_text": "A: A bad radiator pressure cap could be causing the car to overheat. By keeping pressure on the cooling system, the pressure cap increases the boiling point of the antifreeze. If the pressure cap is not working properly, the engine could overheat."}, {"url": "http://bumpertobumperradio.com/latest-news/item/235-symptoms-of-a-car-with-a-bad-radiator-cooling-system", "passage_text": "The key parts of the cooling system remove the heat from the engine and automatic transmission and dispel it to the air outside. The water pump circulates coolant through the engine. The coolant absorbs heat and returns it to the radiator where heat is dissipated."}]