[{"url": "http://www.tennessean.com/story/entertainment/music/2015/01/09/elvis-presleys-first-record-happiness-auctions/21497915/", "passage_text": "Lorisa Hilburn, right, and relative Dianna Brookins, left, smile after an acetate recording of “My Happiness,” the first song Elvis Presley ever recorded, was auctioned for a$300,000 on Thursday, Jan. 8, 2015, in Memphis."}, {"url": "http://www.csmonitor.com/The-Culture/Music/2015/0109/Elvis-Presley-record-My-Happiness-sells-for-300-000-at-auction", "passage_text": "An acetate recording of the ballad My Happiness, the first song Elvis Presley ever recorded, sold at auction Thursday night for $300,000. An undisclosed Internet buyer placed the winning bid at Graceland, the museum and tourist attraction that was Presley's former home."}, {"url": "http://www.people.com/article/elvis-presley-first-recording-my-happiness", "passage_text": "The 39-year-old turned out to be the anonymous bidder who paid $300,000 for the one-of-a-kind recording of My Happiness at an auction this January at Graceland, Presley's Memphis home."}, {"url": "http://www.sltrib.com/entertainment/2034638-155/elvis-presleys-first-record-my-happiness", "passage_text": "Memphis, Tenn. • In 1953, Elvis Presley walked into Sun Records in Memphis and recorded the song My Happiness.. He was only 18. For $4, Presley was able to leave the studio with an acetate copy of the 78 RPM record, meant as a gift for his mother, Gladys."}, {"url": "http://www.csmonitor.com/The-Culture/Music/2015/0109/Elvis-Presley-record-My-Happiness-sells-for-300-000-at-auction", "passage_text": "This acetate recording of 'My Happiness,' (front record) the first song Elvis Presley ever recorded, was auctioned for a total price of $300,000 on Jan. 8, 2015 in Memphis, Tenn. Adrian Sainz/AP. View Caption. An acetate recording of the ballad My Happiness, the first song Elvis Presley ever recorded, sold at auction Thursday night for $300,000. An undisclosed Internet buyer placed the winning bid at Graceland, the museum and tourist attraction that was Presley's former home."}, {"url": "http://www.tennessean.com/story/entertainment/music/2015/01/09/elvis-presleys-first-record-happiness-auctions/21497915/", "passage_text": "MEMPHIS – An acetate recording of the ballad “My Happiness,” the first song Elvis Presley ever recorded, sold at auction Thursday night for $300,000. An undisclosed Internet buyer placed the winning bid at Graceland, the museum and tourist attraction that was Presley’s former home."}, {"url": "http://www.rollingstone.com/music/news/elvis-presleys-first-recording-headed-to-graceland-auction-20141114", "passage_text": "Elvis Presley 's first recording – an acetate disc cut at Sun Records studio Memphis Recording Service on July 18th, 1953 – is headed to an auction that will take place at Graceland, the late singer's famed Memphis estate, on January 8th, the date that would have been his 80th birthday."}]