[{"url": "http://www.elvispresleynews.com/ElvisArmyDays/", "passage_text": "On 25 March Elvis reported for induction at Memphis Draft Board. He was accompanied by his parents and friend Lamar Fike. After being sworn in Elvis became Private Presley 53310761. With his fellow draftees he boarded an army bus for Fort Hood, Texas for basic training. Two events during his army stint would change Elvis life forever. His father Vernon like Elvis would both meet their future wives. Dee Stanley a divorcee with three sons & Joseph Beaulieu’s 14-year daughter Priscilla Ann Beaulieu was only 14 years old, in 1959, when she met Elvis in Germany while he was in the army."}, {"url": "http://entertainment.howstuffworks.com/elvis-presley-biography19.htm", "passage_text": "Elvis Presley's Life in the Military. On leave for two weeks at the start of June 1958, Elvis spent time with family and friends. He also recorded several new tracks in Nashville to help satisfy RCA's need for new material while he was out of commission. The time Elvis spent in the army was a whirlwind of activity. See the next section to learn more about what Elvis did on leave, and to read about the end of Elvis' military career. 1  Elvis Presley. 2  Elvis Presley Pictures. 3  Elvis Presley Quotes"}, {"url": "http://www.elvis.com.au/presley/elvisandtheusarmy.shtml", "passage_text": "Elvis completed his 18-month stint in Germany and arrived back in the U.S. in March of 1960. At Fort Dix, New Jersey he was honorably discharged from active duty on March 5, 1960. He received his mustering-out check of $109.54 and Elvis Presley, Sergeant E-5 returned to home the life and career he had left behind. On January 4, 1957 Elvis reported to Kennedy Veterans Hospital in Memphis for an army pre-induction physical. On January 8, 1957, his twenty second birthday, the Memphis Draft Board held a press conference and announced Elvis would be classified 1A and would probably be drafted sometime that year."}, {"url": "http://www.history.army.mil/faq/elvis.htm", "passage_text": "Return to CMH Online Last updated 3 October 2003. Elvis Aron Presley entered the United States Army at Memphis, Tennessee, on March 24, 1958, and then spent three days at the Fort Chaffee, Arkansas, Reception Station. He left active duty at Fort Dix, New Jersey, on March 5, 1960, and received his discharge from the Army Reserve on March 23, 1964. During his active military career Mr. Presley served as a member of two different armor battalions. Between March 28 and September 17, 1958, he belonged to Company A, 2d Medium Tank Battalion, 37th Armor, stationed at Fort Hood, Texas. During this assignment he completed basic and advanced military training."}, {"url": "https://en.wikipedia.org/wiki/Elvis_Presley%27s_Army_career", "passage_text": "Elvis Aaron Presley served in the United States Army between March 1958 and March 1960. At the time of his draft he was one of the most well-known names in the world of entertainment. Before entering the U.S. Army, Presley had caused national outrage with his sexually charged performances and rock and roll music. After his release from military service, Presley found a new fan base among an older age group, thanks in part to his army career and releases of ballads over rock and roll songs."}, {"url": "https://en.wikipedia.org/wiki/Elvis_Presley%27s_Army_career", "passage_text": "On January 4, 1957, Presley attended Kennedy Veterans Hospital in Memphis for a pre-induction army medical. On January 8, Presley's twenty-second birthday, he was declared 1-A by the Memphis Draft Board; physically fit and likely to be drafted some time in the next eight months. After his release from military service, Presley found a new fan base among an older age group, thanks in part to his army career and releases of ballads over rock and roll songs."}, {"url": "http://mashable.com/2014/10/05/pvt-elvis-presley-in-his-underwear/", "passage_text": "This was a very significant period in Elvis' life. While away in Germany, his mother died, and he met 14-year-old Priscilla Beaulieu, later to become his wife, Priscilla Presley. It was also the first and only time he left North America. Elvis in newly issued Army fatigues & jacket. "}, {"url": "http://www.elvis.com.au/presley/elvisandtheusarmy.shtml", "passage_text": "When he returned to Texas, Elvis was assigned to the Third Armored 'Spearhead' Division, whose motto was 'Victory or Death'. His unit was stationed in Friedberg, Germany. His troop train left Fort Hood for the Brooklyn Army Terminal where, on September 22, 1958, Elvis boarded the U.S.S. Randall and sailed for Germany. Upon arrival he was assigned to the Ray Kaserne barracks. On January 4, 1957 Elvis reported to Kennedy Veterans Hospital in Memphis for an army pre-induction physical. On January 8, 1957, his twenty second birthday, the Memphis Draft Board held a press conference and announced Elvis would be classified 1A and would probably be drafted sometime that year."}]