[{"url": "https://en.wikipedia.org/wiki/Inorganic_compound", "passage_text": "Inorganic compounds can be defined as any compound that is not organic. Some simple compounds which contain carbon are usually considered inorganic. These include carbon monoxide, carbon dioxide, carbonates, cyanides, cyanates, carbides, and thiocyanates. An inorganic compound is a compound that is considered not  organic . Inorganic compounds are traditionally viewed as being synthesized by the agency of geological systems. In contrast, organic compounds are found in biological systems. The distinction between inorganic and organic compounds is not always clear"}, {"url": "https://en.wikipedia.org/wiki/Total_inorganic_carbon", "passage_text": "The total inorganic carbon (C T, or TIC) or dissolved inorganic carbon (DIC) is the sum of inorganic carbon species in a solution. The inorganic carbon species include carbon dioxide, carbonic acid, bicarbonate anion, and carbonate. It is customary to express carbon dioxide and carbonic acid simultaneously as CO 2 * . C T is a key parameter when making measurements related to the pH of natural aqueous systems, and carbon dioxide flux estimates"}, {"url": "http://www.answers.com/Q/Why_do_you_classify_carbon_dioxide_as_inorganic", "passage_text": "You can say carbon is the main thing here. Compounds of carbon [except oxides, ca … rbonates, bicarbonates] are termed as organic. Water does not contain a carbon atom. So it is inorganic. Carbon dioxide is considered by chemists as inorganic, along with carbon monoxide, carbonates and bicarbonates. Nature has not distinguished compounds into inorganic and organic compounds that clearly. These compounds of carbon are just assumed to be inorganic. Also there is that one thing about carbon being covalently bonded with hydrogen in organic compounds. Due to that criteria carbon dioxide is considered inorganic. But actually there is no clear reason. 1 person found this useful. 1  The Five Major Parts of the Brain At its most basic, the brain controls the body."}, {"url": "http://chemistry.stackexchange.com/questions/22195/is-carbon-dioxide-organic-or-inorganic", "passage_text": "In general, ionic and simple molecular compounds that contain carbon are not called organic, partly for historical reasons, but also partly because the category organic is more than just a name-it describes an entire set of bond types, reaction patterns, naming rules, and structure types. The organic/inorganic terminology is mostly very simple: covalent compounds containing carbon are organic. The only fuzzy area is around very simple molecules like $\\ce{CO2}$ where the distinction doesn't matter much. So we would not normally think of diamond or silicon carbide as organic."}, {"url": "http://chemistry.stackexchange.com/questions/8457/why-co2-is-not-organic", "passage_text": "up vote 7 down vote. Carbon dioxide is neither organic nor inorganic, it's just carbon dioxide. This distinction is nothing but a convention to separate things between the textbooks and professors. Carbon dioxide forms carbonic acid in water and the usual salts. This was/is reason to think of it as inorganic. Carbon monoxide, carbon dioxide, phosgene, carbonic acid are inorganic. Ethylene carbonate, vinylene carbonate, oxalic acid, formic acid, dichloroacetylene are organic. Aluminum carbide, $\\ce{Al4C3}$, is inorganic (hydrolyzes to methane)."}, {"url": "http://www.youtube.com/watch?v=nZFqqET1GHk", "passage_text": "This video explains the difference between organic and inorganic compound with examples. Carbon dioxide is a carbon containing compound, but considered as inorganic why? For more. http://www.biologyexams4u.com/2011/10... 1  Education. "}, {"url": "https://answers.yahoo.com/question/index?qid=20070909193738AAmOEPb", "passage_text": "Report Abuse. Anything which contains carbon is not organic. The bond of the elements with carbon decides whether it shall be treated as organic or inorganic. Noemally there are two subdivisions of carbon chemistry-alliphatic(valency bond) or aromatic(hexagonal ring structure benzine based). "}, {"url": "http://www.answers.com/Q/Why_carbon_dioxide_considered_as_inorganic_compound", "passage_text": "an organic compound is a compound which must contain hydrogen and carbon but carbon dioxide consists of carbon only so it is considered as a inorganic compound. These compounds of carbon are just assumed to be inorganic. Also there is that one thing about carbon being covalently bonded with hydrogen in organic compounds. Due to that criteria carbon dioxide is considered inorganic. But actually there is no clear reason."}, {"url": "http://www.answers.com/Q/Why_carbon_dioxide_considered_as_inorganic_compound", "passage_text": "You can say carbon is the main thing here. Compounds of carbon [except oxides, ca … rbonates, bicarbonates] are termed as organic. Water does not contain a carbon atom. So it is inorganic. Carbon dioxide is considered by chemists as inorganic, along with carbon monoxide, carbonates and bicarbonates. Nature has not distinguished compounds into inorganic and organic compounds that clearly. These compounds of carbon are just assumed to be inorganic. Also there is that one thing about carbon being covalently bonded with hydrogen in organic compounds. Due to that criteria carbon dioxide is considered inorganic. But actually there is no clear reason."}]