[{"url": "http://www.howardluksmd.com/education/common-injuries/cartilage-defects/", "passage_text": "Here are two pictures obtained during an arthroscopy where a fiber-optic camera is placed in the knee to view everything. In the. This is a chronic defect in the cartilage. upper picture you can see the cartilage literally peeling off of the bone beneath it. This is an acute or fresh defect. We also have cartilage on the end of the thigh bone or femur, and cartilage that covers the top of the shin bone or tibia. This cartilage is known as articular cartilage — and damage to the articular cartilage is the focus of this section."}, {"url": "http://www.myorthodoc.com/patient-education/your-knee/what-is-an-articular-cartilage-defect-and-how-is-it-treated/", "passage_text": "Articular cartilage defects are common conditions affecting the knee. Articular cartilage resists wear quite well, but time and wear can eventually take their toll. When the joint surface extensively breaks down, the condition is known as degenerative arthritis or osteoarthrosis (OA). 1 An MRI with injected joint contrast is the best study to visualize these defects. 2  Chondromalacia (localized wear and tear) Softening or fissuring of the articular cartilage usually a consequence of cumulative injury or degenerative joint disease."}, {"url": "http://www.porcpotlas.hu/en/porchiany.html", "passage_text": "Focal defect of the cartilage. Defect of the articular cartilage due to any inflammation, injury or trauma causing partial or full thickness cartilage defect in a well defined focal area. These changes in the articular cartilage usually develop as a result of a major trauma and may affect almost any joint in the body. "}, {"url": "http://www.medscape.com/viewarticle/408519", "passage_text": "Abstract. The successful treatment of focal full-thickness articular defects of the knee has continued to present a formidable challenge, and no traditional treatment method has provided consistent acceptable, long-term clinical results. Although the etiology of full-thickness chondral defects in the knee is not well-defined and the clinical course is unpredictable, it appears that articular cartilage lesions (ACL) are often associated with pain and limited mobility followed by degenerative changes typical of osteoarthritis."}, {"url": "http://www.howardluksmd.com/education/common-injuries/cartilage-defects/", "passage_text": "Types of Cartilage: In the human knee there are two forms of cartilage. We have the two cushions, each of which we call a meniscus. We also have cartilage on the end of the thigh bone or femur, and cartilage that covers the top of the shin bone or tibia. This cartilage is known as articular cartilage — and damage to the articular cartilage is the focus of this section."}, {"url": "http://drmillett.com/chondral-knee-injuries-articular-cartilage-damage/", "passage_text": "Request a Consultation. A chondral knee injury is the result of articular cartilage damage within the knee. Articular cartilage is a specific connective tissue covering joint surfaces. Viewed by the naked eye, it has a glistening, white appearance. "}, {"url": "http://www.shouldersandknees.com/articular-cartilage-defect.html", "passage_text": "Damage to the joint surface of the knee is extremely common. The surface of the knee is covered with cartilage – called the articular cartilage. Damage to the articular cartilage can be associated with a traumatic injury such as a motor vehicle accident or athletic injuries but even more commonly occurs spontaneously without associated traumatic causes. In these instances the symptoms can sometimes be confused with those of arthritis."}, {"url": "http://www.howardluksmd.com/education/common-injuries/cartilage-defects/", "passage_text": "Cartilage “Tears” vs Cartilage “Defects” : If you have been diagnosed with a “cartilage tear” your physician was probably referring to a meniscus tea r. If your physician says you have a hole or defect in your cartilage, they are likely referring to the “articular” cartilage layer which we have on the ends of the bone. Articular cartilage is typically 1/8-1/4″ thick in an adult knee. We also have cartilage on the end of the thigh bone or femur, and cartilage that covers the top of the shin bone or tibia. This cartilage is known as articular cartilage — and damage to the articular cartilage is the focus of this section."}, {"url": "http://www.dartmouth-hitchcock.org/ortho/articular_cartilage_injury.html", "passage_text": "This term is used to describe damage to a type of cartilage in the knee. The ends of the three bones in the knee joint are covered with what is know as articular cartilage, a tough, elastic material that helps absorb shock and allows the knee joint to move smoothly."}, {"url": "https://en.wikipedia.org/wiki/Articular_cartilage_damage", "passage_text": "Articular cartilage damage in the knee may be found on its own but it will more often be found in conjunction with injuries to ligaments and menisci. People with previous surgical interventions face more chances of articular cartilage damage due to altered mechanics of the joint. "}]