[{"url": "http://www.ehow.com/how-does_4964328_how-long-do-lice-live.html", "passage_text": "Head lice only survive on human blood. Without a human hosts, most lice will only live for a maximum of 48 hours. This is why sealing clothes and toys after infection in a plastic bag is a great way to get rid of lice. Lice on a human host can survive two or three weeks. However, living lice lay eggs."}, {"url": "http://www.teclabsinc.com/questions/head-lice/how-long-can-lice-live-without-a-host/", "passage_text": "Answer. Lice can only live for about 36 hours after being dislodged from your head. You shouldn't need any pesticides for your furniture or carpet. A good vacuuming and bagging any pillows for 10 days that cannot be washed should take care of any that are not on the head. "}, {"url": "https://www.hellolife.net/head-lice/b/how-long-can-head-lice-live-off-the-human-host/", "passage_text": "Lice cannot jump or fly, they can only crawl. When scratching the head, they can be flung, causing the appearance of jumping. Head lice can only live for 24 hours when away from a human host. They cannot live in pillows, sofas, or any other surface for any longer than a 24 hour window. All lice do not die immediately after lice treatment. "}, {"url": "http://www.healthline.com/health/lice/how-long-do-lice-live", "passage_text": "Nymphs and fully mature adults can survive for only about a day without a food source. Adult lice can’t live past 24 hours or so on non-human surfaces such as carpets, hardwood flooring, clothing, furniture, sports helmets, headphones, or hair accessories. As long as there’s a food source readily available, an adult louse can live for as long as 30 days on a human. However, this short lifespan is perpetuated by the constant laying of eggs. Female lice lay up to six eggs each day."}, {"url": "http://www.idph.state.il.us/public/hb/hblice.htm", "passage_text": "How long do head lice live? The life span of an adult louse on a host ranges up to 30 days. During this time, the female head louse can deposit about 90 eggs. After incubating for seven to 10 days, the nits hatch and, after another 10 days, mature into adult head lice and the cycle begins again. Off the host, adult head lice can live about two to four days at 74 degrees Fahrenheit (F) and one to two days at 86 degrees. Nits will remain alive off the host for up to 10 days; they will not hatch at or below room temperature (68 degrees F)"}, {"url": "http://entnemdept.ufl.edu/creatures/urban/human_lice.htm", "passage_text": "Head lice and pubic lice are highly dependent upon human body warmth and will die if separated from their host for 24 hours. Body lice are hardier since they live on clothing and can survive if separated from human contact for up to a week without feeding. Figure 2. Body lice, Pediculus humanus humanus Linnaeus. "}, {"url": "http://www.healthline.com/health/lice/how-long-do-lice-live", "passage_text": "Life Span Without Food. Nits, or lice eggs, can’t live without a human host. They need the warmth of the scalp for incubation purposes before they hatch. Once they’ve hatched, they need the nourishment they get from human blood. Nits that are dislodged from a hair shaft will most likely die before they hatch. As long as there’s a food source readily available, an adult louse can live for as long as 30 days on a human. However, this short lifespan is perpetuated by the constant laying of eggs. Female lice lay up to six eggs each day."}, {"url": "http://www.cdc.gov/parasites/lice/head/biology.html", "passage_text": "Females are usually larger than males and can lay up to 8 nits per day. Adult lice can live up to 30 days on a person’s head. To live, adult lice need to feed on blood several times daily. Without blood meals, the louse will die within 1 to 2 days off the host. Life cycle image and information courtesy of DPDx. "}, {"url": "http://www.ehow.com/how-does_4964328_how-long-do-lice-live.html", "passage_text": "Body lice can live anywhere there is hair on the body. Body lice are much hardier than other types of lice and can live up to 10 days without a human host. On a human host they can survive for up to three weeks, laying up to 88 eggs during their lifetime on their host. Without a human hosts, most lice will only live for a maximum of 48 hours. This is why sealing clothes and toys after infection in a plastic bag is a great way to get rid of lice. Lice on a human host can survive two or three weeks. However, living lice lay eggs."}]