[{"url": "http://www.thehungryexcavator.com/2013/12/sizzling-pork-sisig-recipe.html", "passage_text": "The Internet tells me that Sisig means to snack on something sour but my understanding of this dish is that it's pork parts (head, cheek, liver, belly, etc etc) that's been braised in vinegar before being grilled, diced and served on a sizzling hot plate."}, {"url": "http://www.cookingchanneltv.com/recipes/sizzling-pork-sisig.html", "passage_text": "Directions. For the braised pork: Combine the soy sauce, vinegar, salt, sugar, peppercorns, garlic, pig ear, jowl, snout and tongue in a large stockpot and add enough water to completely cover the pork. Simmer on low heat until the pork is soft but not completely tender, 1 hour 30 minutes."}, {"url": "http://www.foodandwine.com/recipes/pork-belly-sisig", "passage_text": "1 Make the sisig Meanwhile, in a large bowl, combine the celery leaves with the shallots, scallions, vinegar, calamansi juice, cilantro, chiles, garlic, 1 1/2 teaspoons of salt and 2 teaspoons of pepper and toss well. 2  Let marinate at room temperature for at least 1 hour."}, {"url": "http://panlasangpinoy.com/2014/10/13/pork-sisig/", "passage_text": "Originally, pork sisig is composed of chopped pigs face (snout included) and ears with a generous amounts of chicken liver. Hundreds of sisig variations are available today ranging from the original pigs face (maskara) ingredient to a more healthy seafood concoction such as squid, tuna, milkfish (bangus), and mussels."}, {"url": "http://www.foodandwine.com/recipes/pork-belly-sisig", "passage_text": "1 Remove the pan from the oven and let rest for 30 minutes. 2  Make the sisig Meanwhile, in a large bowl, combine the celery leaves with the shallots, scallions, vinegar, calamansi juice, cilantro, chiles, garlic, 1 1/2 teaspoons of salt and 2 teaspoons of pepper and toss well."}, {"url": "http://panlasangpinoy.com/2014/10/13/pork-sisig/", "passage_text": "Pork Sisig is a popular appetizer that originated from the culinary capital of the Philippines: Pampanga. This delicious dish can also be categorized as a main dish. Pork Sisig was invented by the late Lucia Cunanan. She is popularly know as Aling Lucing – the sisig queen."}, {"url": "http://www.youtube.com/watch?v=dx-dixcCv6g", "passage_text": "Sisig is a Kapampangan term originated from Pampanga a province located at the northern part of the Philippines, Sisig also refers to Sizzling sisig, a Filipino dish made from parts of pig's head and liver, usually seasoned with (mayonnaise), calamansi and chili peppers."}]