[{"url": "http://www.cisco.com/c/en/us/support/docs/optical/synchronous-optical-network-sonet/13567-sonet-tech-tips.html", "passage_text": "SONET defines optical signals and a synchronous frame structure for multiplexed digital traffic. It is a set of standards that define the rates and formats for optical networks specified in ANSI T1.105, ANSI T1.106, and ANSI T1.117. Both SONET and SDH are based on a structure that has a basic frame format and speed. The frame format used by SONET is the Synchronous Transport Signal (STS), with STS-1 as the base-level signal at 51.84 Mbps."}, {"url": "http://www.ee.columbia.edu/~bbathula/courses/HPCN/chap04_part-2.pdf", "passage_text": "Synchronous Digital Hierarchy (SDH) Definition Synchronous digital hierarchy (SDH) and synchronous optical network (SONET) refer to a group of fiber-optic transmission rates that can transport digital signals with different capacities. "}, {"url": "http://www.gta.ufrj.br/seminarios/semin2004_1/sonet/files/sonet.pdf", "passage_text": "Regenerator-Device that restores a degraded digital signal for continued transmission; also called arepeater. SDH (Synchronous Digital Hierarchy) - The ITU-T-defined world standard of transmissionwhose base transmission level is 52 Mbps (STM-0) and is equivalent to SONET's STS-1 or OC-1transmission rate. Synchronous Digital Hierarchy is a world standard, and as such, SONETcan be considered a subset of SDH.Transmission standards in the United States, Canada, Korea, Taiwan, and Hong Kong (ANSI) and therest of the world (ITU-T, formerly CCITT) evolved from different basic-rate signals in thenon-synchronous hierarchy."}, {"url": "http://networking.ringofsaturn.com/Protocols/sonet.php", "passage_text": "The SONET/SDH Digital Hierarchy. The basic foundation of SONET consists of groups of DS-0 signals (64Kbits/sec) that are multiplexed to create a 51.84Mbit/sec signal, which is also known as STS-1 (Synchronous Transport Signal). STS-1 is an electrical signal rate that corresponds to the Optical Carrier line rate of OC-1, SONET's building block"}, {"url": "http://www.webopedia.com/TERM/S/SONET.html", "passage_text": "Short for Synchronous Optical Network, a standard for connecting fiber-optic transmission systems. SONET was proposed by Bellcore in the middle 1980s and is now an ANSI standard. SONET defines interface standards at the physical layer of the OSI seven-layer model. The standard defines a hierarchy of interface rates that allow data streams at different rates to be multiplexed. SONET establishes Optical Carrier (OC) levels from 51.8 Mbps (OC-1) to 9.95 Gbps (OC-192)."}, {"url": "http://www.zytrax.com/tech/data_rates.htm", "passage_text": "The signal hierarchy defines the levels of multiplexing, that is, the first level of the hierarchy multiplexes (combines) a number of DS0s into a single digital signal (with a DSx designator) which is then placed on a carrier (with a T-x designator). The North American signal hierarchy was created by the old US 'Bell system' (AT&T) in the early 1960's and was the world's first digital voice system. It is based on multiples of the DS0 signal with a little bit of overhead to show its age."}, {"url": "https://en.wikipedia.org/wiki/Sonnet", "passage_text": "The term sonnet is derived from the Italian word sonetto (from Old Provencal provençal sonet a little, poem from son, song From latin sonus a). Sound by the thirteenth century it signified a poem of fourteen lines that follows a strict rhyme scheme and specific. structure The structure of a typical Italian sonnet of the time included two parts that together formed a compact form of argument. First, the octave (two quatrains), forms the proposition, which describes a problem, or question, followed by a sestet (two tercets), which proposes a resolution."}, {"url": "http://www.cisco.com/c/en/us/support/docs/optical/synchronous-optical-network-sonet/13567-sonet-tech-tips.html", "passage_text": "Both SONET and SDH have a hierarchy of signaling speeds. Multiple lower-level signals can be multiplexed to form higher-level signals. For example, three STS-1 signals can be multiplexed together to form an STS-3 signal, and four STM-1 signals multiplexed together to form an STM-4 signal. Both SONET and SDH are based on a structure that has a basic frame format and speed. The frame format used by SONET is the Synchronous Transport Signal (STS), with STS-1 as the base-level signal at 51.84 Mbps."}, {"url": "https://en.wikipedia.org/wiki/Synchronous_optical_networking", "passage_text": "SONET and SDH have a limited number of architectures defined. These architectures allow for efficient bandwidth usage as well as protection (i.e. the ability to transmit traffic even when part of the network has failed), and are fundamental to the worldwide deployment of SONET and SDH for moving digital traffic. The basic unit of framing in SDH is a STM-1 (Synchronous Transport Module, level 1), which operates at 155.520 megabits per second (Mbit/s). SONET refers to this basic unit as an STS-3c (Synchronous Transport Signal 3, concatenated)."}]