[{"url": "http://www.realhistoryww.com/world_history/ancient/Meso_America.htm", "passage_text": "The Aztec. The last of the great MesoAmerican cultures were the Aztec, they were a Nahuatl-speaking people, who in the 15th and early 16th centuries, ruled a large empire in what is now central and southern Mexico. Then there were the Toltecs, who dominated much of central Mexico around 1200 A.D. Their language “Nahuatl”, was also spoken by the Aztecs. They were a militaristic nomadic people, and they or their ancestors may have sacked the city of Teotihuacan in 750 A.D."}, {"url": "http://www.historyworld.net/wrldhis/PlainTextHistories.asp?historyid=aa12", "passage_text": "The Aztecs are a tribe, according to their own legends, from Aztlan somewhere in the north of modern Mexico. From this place, which they leave in about the 12th century AD, there derives the name Aztecs by which they are known to western historians. "}, {"url": "http://www.differencebetween.com/difference-between-aztecs-and-vs-incas/", "passage_text": "More about Aztecs. The people from Aztec were from certain ethnic groups of central Mexico, especially the groups who spoke the Nahuatl language who dominated large portions of Mesoamerica in the 14th, 15th and 16th centuries. Aztecs and Incas are two of the great civilizations of South America. Though, both these civilizations are Pre-European in their origin, it is the Native American people who have marvelous accomplishments in the history. Both of the civilizations have got their differences as they have evolved differently. Though Incas are known as a peaceful civilization, they too took part in sacrificial ceremonies and such. However, when compared with Aztecs, Incas were certainly peaceful. That is because Aztecs were very violent, and they are well known for their tribal methods of ruling"}, {"url": "https://en.wikipedia.org/wiki/Aztec", "passage_text": "The Aztec /ˈaeztɛk/ ˈæztɛk people were certain ethnic groups of Central, mexico particularly those groups who spoke The nahuatl language and who dominated large parts Of mesoamerica from the 14th to 16th. centuries From the 13th century, the Valley of Mexico was the heart of Aztec civilization: here the capital of the Aztec Triple Alliance, the city of Tenochtitlan, was built upon raised islets in Lake Texcoco."}, {"url": "http://www.realhistoryww.com/world_history/ancient/Misc/Americas/Aztec_history.htm", "passage_text": "The Aztec are so called from Aztlan (“Aztlán White”), land an allusion to their place of, origin probably in Northern. Mexico they were also called The, tenochca from an eponymous, Ancestor, tenoch and The, mexica probably From (Metzliapan Metzliapán), moon lake the mystical Name For. lake texcoco The most important official of Tenochtitlan government is often called The Aztec Emperor. The Nahuatl title, Huey Tlatoani (plural huey tlatoque), translates roughly as Great Speaker; the tlatoque (speakers) were an upper class."}, {"url": "http://www.crystalinks.com/azteculture.html", "passage_text": "Precolumbian Aztec society was the highly complex and stratified society that developed among the Aztecs of central Mexico in the centuries prior to the Spanish conquest of Mexico, and which were built on the cultural foundations of the larger region of Mesoamerica. The capital city of the Aztec empire was Tenochtitlan, now the site of modern-day Mexico City. Built on a series of islets in Lake Texcoco, the city plan was based on a symmetrical layout that was divided into four city sections called campans. The city was interlaced with canals which were useful for transportation."}, {"url": "http://www.realhistoryww.com/world_history/ancient/Misc/Americas/Aztec_history.htm", "passage_text": "The origin of the Aztec people is uncertain, but elements of their own tradition suggest that they were a tribe of hunters and gatherers on the northern Mexican plateau before their appearance in Mesoamerica in perhaps the 12th century. The most important official of Tenochtitlan government is often called The Aztec Emperor. The Nahuatl title, Huey Tlatoani (plural huey tlatoque), translates roughly as Great Speaker; the tlatoque (speakers) were an upper class."}, {"url": "http://www.mexicolore.co.uk/aztecs/ask-experts/did-the-aztecs-begin-life-as-a-peaceful-tribe", "passage_text": "(Click on image to enlarge). The Aztec migrants from Aztlan were not peaceful. When they left their homeland at Aztlan, they actually constituted a large group of different tribes who, according to many sources, did not get along. The Codex Boturini contains a scene [see pic] showing them splitting up due to some kind of discord among them. "}, {"url": "http://www.realhistoryww.com/world_history/ancient/Misc/Americas/Aztec_history.htm", "passage_text": "Aztec History. The Aztec were a Nahuatl-speaking people who in the 15th and early 16th centuries ruled a large empire in what is now central and southern Mexico. The Aztec are so called from Aztlan (“Aztlán White”), land an allusion to their place of, origin probably in Northern. mexico The most important official of Tenochtitlan government is often called The Aztec Emperor. The Nahuatl title, Huey Tlatoani (plural huey tlatoque), translates roughly as Great Speaker; the tlatoque (speakers) were an upper class."}]