[{"url": "https://answers.yahoo.com/question/index?qid=20090418145335AAGQRKW", "passage_text": "Rating Newest Oldest. Best Answer: Annual salary is what you make in a year: $50,000 would equal $961.54 a week. you would take 50,000 and divide by 52, that tells the weekly salary of an employee. FYI, Salary individuals typically means they make a set amount regardless of hours worked it a week. $1000. a week salary would be $52,000 annual salary. The employee could work 40 hrs, 50 hrs, or even 30 hrs a week and they still make that $1000 week."}, {"url": "http://www.wikihow.com/Calculate-Annual-Salary", "passage_text": "Their annual salary is divided by the number of pay periods per year to calculate the amount of gross pay for each pay check. This is also know as an exempt employee. If you are a salaried employee, you were likely told your total annual salary when you were hired. 3. Multiply to calculate your annual salary if you work a fixed number of hours per week. Multiply your hourly salary by the number of hours you work per week to calculate your weekly salary. Multiply this figure by 52, the number of weeks per year, to work out your annual salary. 1  For instance, if you work 40 hours per week and you earn $19 per hour, calculate your weekly salary with the equation 40 x $19 = $760"}, {"url": "http://smallbusiness.chron.com/differences-between-base-pay-annual-pay-26051.html", "passage_text": "Instead, your annual pay is the amount of money that you actually make throughout the course of the year. If you are paid on an hourly basis and your hourly rate of pay is $10 per hour, that computes to a base rate of pay of about $20,800 per year. However, if you work a significant amount of overtime throughout the year, your annual pay might be substantially more, perhaps $25,000 per year."}, {"url": "http://www.ehow.com/info_8219451_annual-salary.html", "passage_text": "The main difference between an annual salary and an hourly wage is that a person must work to get paid when he is getting an hourly wage. For instance, a person working 40 hours one week and 20 hours the next will get paid for 60 hours of work when on an hourly wage. If a person gets an annual salary, he will get the same set payment every other week despite working less during the second week. In other words, a salaried person will get the same salary for working 20 hours and 40 hours. However, workers paid salries are often expected to work set hours and overtime when required."}, {"url": "http://www.answers.com/Q/What_does_annual_salary_mean", "passage_text": "What is the annual salary of a mineralogist? The average annual salary for a mineralogist working in the US is  about $110,000. Salaries can range depending on experience, skill,  and hiring company, from $48,000--whic … h is a typical entry level  salary--to $135,000. The average salary that is achieved by aquaculturists is something to ponder upon. But if you want the answer than I can give it to you. They earn appx. $21.63 an hour and w … ork about 8-10 hours a day 6 days a week."}, {"url": "http://work.chron.com/gross-pay-vs-annual-salary-2998.html", "passage_text": "While the annual salary represents a floor for an employee's wages, gross pay can exceed that level. For instance, if an employee is paid an annual salary of $23,000 per year, but he is eligible for, and works, $5,000 worth of overtime, his gross pay will be $28,000 -- more than his salary. But while every employee who is paid earns gross pay, not every employee earns a salary"}, {"url": "https://en.wikipedia.org/wiki/Salary", "passage_text": "Salary is a fixed amount of money or compensation paid to an employee by an employer in return for work performed. A salary is a form of periodic payment from an employer to an employee, which may be specified in an employment contract."}, {"url": "http://www.free-online-calculator-use.com/annual-salary-calculator.html", "passage_text": "Hourly Wage: Enter your hourly wage. Number of paid hours per week: Average number of hours you are paid for each work week. Number of days you work per week. Average number of days you work during each week: Annual Salary: This is what your hourly pay translates into per year, (HOURLY PAY X HOURS PER WEEK X 52.14). Monthly: This is what your hourly pay translates into per month (YEARLY ÷ 12)."}, {"url": "http://www.answers.com/Q/What_does_annual_salary_mean", "passage_text": "Your annual salary is the amount that you will get paid in a year assuming you work the entire … year at that salary. For example, if you are paid semi-monthly (such as US military pay, 1st and 15th of each month), and your annual salary is $24,000, your gross paycheck (before taxes) will be $2,000. The average salary that is achieved by aquaculturists is something to ponder upon. But if you want the answer than I can give it to you. They earn appx. $21.63 an hour and w … ork about 8-10 hours a day 6 days a week."}]