[{"url": "https://en.wikipedia.org/wiki/Economy_of_Canada", "passage_text": "Canada is unusual among developed countries in the importance of the primary sector, with the logging and oil industries being two of Canada's most important. Canada also has a sizable manufacturing sector, based in Central Canada, with the automobile industry and aircraft industry being especially important. With the exception of a few small island nations in the Caribbean, Canada is the only major parliamentary democracy in the western hemisphere. As a result, Canada has developed its own social and political institutions, distinct from most other countries in the world."}, {"url": "http://www.tradingeconomics.com/canada/gdp-growth", "passage_text": "Canada's economy is diversified and highly developed. The foundation of Canadian economy is foreign trade and the United States is by far the nation's largest trade partner. Foreign trade is responsible for about 45 percent of the nation's gross domestic product (GDP). Canada is one of the few developed nations that is a net exporter of energy. This page provides-Canada GDP Growth Rate-actual values, historical data, forecast, chart, statistics, economic calendar and news"}, {"url": "https://en.wikipedia.org/wiki/List_of_Canadian_provinces_and_territories_by_gross_domestic_product", "passage_text": "This article lists Canadian provinces and territories by gross domestic product (GDP) . As of 2013, Canada has a total GDP of USD$ 1.83 trillion, ranking 11th worldwide. While Canada’s ten provinces and three territories exhibit high GDPs, there is wide variation among them. A table of Canadian provinces and territories by descending GDP (at current price and expenditure-based); all figures are from Statistics Canada. Map of Canadian provinces and territories by consolidated GDP (PPP) in 2006, in million C$."}, {"url": "http://www.tradingeconomics.com/canada/gdp-growth", "passage_text": "The Gross Domestic Product (GDP) in Canada contracted 0.10 percent in the second quarter of 2015 over the previous quarter, following a downwardly revised 0.2 percent contraction in the first three months of the year and below market expectations. The foundation of Canadian economy is foreign trade and the United States is by far the nation's largest trade partner. Foreign trade is responsible for about 45 percent of the nation's gross domestic product (GDP). Canada is one of the few developed nations that is a net exporter of energy."}, {"url": "https://en.wikipedia.org/wiki/Economy_of_Canada", "passage_text": "Canada has the 11th (nominal) or 14th-largest (PPP) economy in the world (measured in US dollars at market exchange rates), is one of the world's wealthiest nations, and is a member of the Organisation for Economic Co-operation and Development (OECD) and Group of Seven (G7). With the exception of a few small island nations in the Caribbean, Canada is the only major parliamentary democracy in the western hemisphere. As a result, Canada has developed its own social and political institutions, distinct from most other countries in the world."}, {"url": "https://en.wikipedia.org/wiki/Economy_of_Canada", "passage_text": "As of 2010, manufacturing accounts for 13% of Canada's GDP, a relative decline of more than 2% of GDP since 2005. Central Canada is home to branch plants to all the major American and Japanese automobile makers and many parts factories owned by Canadian firms such as Magna International and Linamar Corporation. With the exception of a few small island nations in the Caribbean, Canada is the only major parliamentary democracy in the western hemisphere. As a result, Canada has developed its own social and political institutions, distinct from most other countries in the world."}, {"url": "http://www.tradingeconomics.com/canada/gdp", "passage_text": "USD Billion. Yearly. The gross domestic product (GDP) measures of national income and output for a given country's economy. The gross domestic product (GDP) is equal to the total expenditures for all final goods and services produced within the country in a stipulated period of time. This page provides-Canada GDP-actual values, historical data, forecast, chart, statistics, economic calendar and news"}, {"url": "https://en.wikipedia.org/wiki/Economy_of_Canada", "passage_text": "Machinery, equipment, automotive products and other manufactures accounted for a further 38% of exports in 2009. In 2009, exports accounted for approximately 30% of Canada's GDP. The United States is by far its largest trading partner, accounting for about 73% of exports and 63% of imports as of 2009. With the exception of a few small island nations in the Caribbean, Canada is the only major parliamentary democracy in the western hemisphere. As a result, Canada has developed its own social and political institutions, distinct from most other countries in the world."}, {"url": "http://www.ccq.ca/", "passage_text": "Economy of Canada. Canada is one of the wealthiest states of the world, the gross domestic product (GDP) of Canada is about 1432,140 Billion. US dollars, so the state is GDP rank 14 worldwide. In purchasing power parity, Canada is up to 1265.838 billion dollars in 13th place. Canada is considered a social market economy, but the economic margin for maneuver is very large, in the “Index of Economic Freedom,” of the Heritage Foundation Canada will be rated higher than most western European countries and slightly lower than the USA."}, {"url": "http://www.economywatch.com/world_economy/canada/", "passage_text": "Canada has the 11th largest economy as ranked by nominal gross domestic product (GDP), and the 20th largest GDP per capita based on purchasing power parity (PPP). Canada is unique among developed nations due to the importance of its primary sector, with logging and oil being two of Canada's most important industries. Canada also has a sizable manufacturing sector, which largely focuses on the automobile and aircraft industry."}]