[{"url": "http://tradingmarkets.com/recent/calculating_covered_call_profits_-_not_as_easy_as_it_sounds-754753.html", "passage_text": "If you include dividends earned in your option position rate of return, the position earned: ($420 / $5,816 = 7.2%) + 0.9% = 8.1%. Including dividends is a debatable decision. The primary argument against it is that dividends are related to stock ownership and not to covered call writing. For example, you purchase 100 shares of stock for a total price of $5,130. Current value is $5,816. You decide to use the current value of stock as the basis for calculating covered call profits."}, {"url": "http://www.optionsprofitcalculator.com/calculator/covered-call.html", "passage_text": "Covered Call Calculator. The covered call involves writing a call option contract while holding an equivalent number of shares of the underlying stock. It is also commonly referred to as a buy-write if the stock and options are purchased at the same time. "}, {"url": "http://www.theoptionsguide.com/covered-call-writing.aspx", "passage_text": "Limited Profit Potential. In addition to the premium received for writing the call, the OTM covered call strategy's profit also includes a paper gain if the underlying stock price rises, up to the strike price of the call option sold. The formula for calculating maximum profit is given below: Potential losses for this strategy can be very large and occurs when the price of the underlying security falls. However, this risk is no different from that which the typical stockowner is exposed to. In fact, the covered call writer's loss is cushioned slightly by the premiums received for writing the calls."}, {"url": "http://www.theoptionsguide.com/covered-call-writing.aspx", "passage_text": "Sell 1 Call. Using the covered call option strategy, the investor gets to earn a premium writing calls while at the same time appreciate all benefits of underlying stock ownership, such as dividends and voting rights, unless he is assigned an exercise notice on the written call and is obligated to sell his shares. Potential losses for this strategy can be very large and occurs when the price of the underlying security falls. However, this risk is no different from that which the typical stockowner is exposed to. In fact, the covered call writer's loss is cushioned slightly by the premiums received for writing the calls."}, {"url": "http://futuresoptionsetc.com/2011/04/covered-call-option-profit-loss.html", "passage_text": "Although the Maximum loss is higher than the maximum profit, but still both loss and profit in Covered Call Option Position are LIMITED. That's why it is known as the COVERED call, rather than a naked call option. 4) Similarly, there is a BREAK EVEN point for Covered Call Option Position. 1) if the price of the underlying goes below $20, then he will start making a linear loss. The Maximum Loss will be of $20, when the underlying stock price goes to ZERO i.e. the company goes bankrupt. MAXIMUM Loss in a Covered Call Option Position = Buy Price of Stock-Premium Received from Short C"}, {"url": "http://www.theoptionsguide.com/covered-call-writing.aspx", "passage_text": "This is a covered call strategy where the moderately bullish investor sells out-of-the-money calls against a holding of the underlying shares. The OTM covered call is a popular strategy as the investor gets to collect premium while being able to enjoy capital gains (albeit limited) if the underlying stock rallies. Potential losses for this strategy can be very large and occurs when the price of the underlying security falls. However, this risk is no different from that which the typical stockowner is exposed to. In fact, the covered call writer's loss is cushioned slightly by the premiums received for writing the calls."}, {"url": "http://www.optionseducation.org/strategies_advanced_concepts/strategies/covered_call.html?prt=mx", "passage_text": "This strategy consists of writing a call that is covered by an equivalent long stock position. It provides a small hedge on the stock and allows an investor to earn premium income, in return for temporarily forfeiting much of the stock's upside potential. The maximum loss is limited but substantial. The worst that can happen is for the stock to become worthless. In that case, the investor will have lost the entire value of the stock. However, that loss will be reduced somewhat by the premium income from selling the call option."}, {"url": "https://www.tradeking.com/education/options/5-tips-for-writing-covered-calls", "passage_text": "A “ covered call ” is an income-producing strategy where you sell, or “write”, call options against shares of stock you already own. Typically, you’ll sell one contract for every 100 shares of stock. In exchange for selling the call options, you collect an option premium. An example of a covered call in action. Imagine you already own 100 shares of XYZ. You bought them for $25 each, plus the commission of $4.95, and now XYZ is trading at $50 - but it doesn’t seem likely to rise much in the short-term."}, {"url": "http://help.questrade.com/how-to/iq-web/stock-and-option-quotes/options/option-strategies/covered-call/", "passage_text": "When you sell a call option, you are obligated to sell the stock you already own at the strike price if the buyer exercises the call option. You own 100 shares of ABC stock valued at $45. In the short term (less than 30 days) you expect the stock price to rise slightly to a maximum value of $48. You sell a $50 call option on ABC stock that expires in 30 days, which earns you an option premium valued at $100 (1.00 option premium x 100 shares = $100). This means that the buyer of the call option has the right to purchase the stock at a $50 strike price before the 30-day expiration date. "}, {"url": "http://www.theoptionsguide.com/covered-call-writing.aspx", "passage_text": "Example. An options trader purchases 100 shares of XYZ stock trading at $50 in June and writes a JUL 55 out-of-the-money call for $2. So he pays $5000 for the 100 shares of XYZ and receives $200 for writing the call option giving a total investment of $4800. On expiration date, the stock had rallied to $57. Potential losses for this strategy can be very large and occurs when the price of the underlying security falls. However, this risk is no different from that which the typical stockowner is exposed to. In fact, the covered call writer's loss is cushioned slightly by the premiums received for writing the calls."}]