[{"url": "http://www.rxlist.com/halcion-drug/overdosage-contraindications.htm", "passage_text": "The oral LD50 in mice is greater than 1,000 mg/kg and in rats is greater than 5,000 mg/kg. HALCION Tablets are contraindicated in patients with known hypersensitivity to this drug or other benzodiazepines."}, {"url": "http://www.cigna.com/healthwellness/hw/medications/triazolam-d00397a1", "passage_text": "Triazolam is a benzodiazepine (ben-zoe-dye-AZE-eh-peen) similar to Valium. Triazolam affects chemicals in the brain that may become unbalanced and cause sleep problems (insomnia). Triazolam is used to treat insomnia (trouble falling or staying asleep)."}, {"url": "http://www.urmc.rochester.edu/encyclopedia/content.aspx?ContentTypeID=167&ContentID=benzodiazepine_urine", "passage_text": "This is a urine test to screen for a class of drugs called benzodiazepines. Benzodiazepines are central nervous system depressants. They are used to sedate patients, help them sleep, prevent seizures, ease anxiety, and relax muscle spasms."}, {"url": "http://www.drbrianhoffman.com/dental-information/frequently-asked-questions/what-is-halcion", "passage_text": "Halcion (triazolam) is a sedative benzodiazepine medication with retrograde amnesic qualities. Halcion has a rather short half-life, about 4-hours, which makes it very good medicine for a dental environment, as most dental procedures are completed well within the lifespan of this medication."}, {"url": "http://www.drbrianhoffman.com/dental-information/frequently-asked-questions/what-is-halcion", "passage_text": "Halcion Tablets contain triazolam, a triazolobenzodiazepine hypnotic agent. Triazolam is a white crystalline powder, soluble in alcohol and poorly soluble in water. It has a molecular weight of 343.21. The chemical name for triazolam is 8-chloro-6-(o-chlorophenyl)-1-methyl-4H-s-triazolo-[4,3-α] [1,4] benzodiazepine."}, {"url": "http://www.urmc.rochester.edu/encyclopedia/content.aspx?ContentTypeID=167&ContentID=benzodiazepine_urine", "passage_text": "Overdoses of fast-acting benzodiazepines like triazolam (Halcion) are more likely to cause breathing problems and even death. A drug called flumazenil (Romazicon) may be used as an antidote to the sedative effects of benzodiazepines."}, {"url": "http://www.drbrianhoffman.com/dental-information/frequently-asked-questions/what-is-halcion", "passage_text": "If you are prescribed Halcion for your dental visit(s), it is important to know a few things: you will need a driver to, and from, your appointment. We will not receive you for your appointment if you drive yourself, or arrive in a taxi/cab. You must have a driver than you know and trust, preferably a family member."}, {"url": "http://www.urmc.rochester.edu/encyclopedia/content.aspx?ContentTypeID=167&ContentID=benzodiazepine_urine", "passage_text": "Alprazolam (Xanax), clonazepam (Klonopin), temazepam (Restoril), and triazolam (Halcion) may not be detected in many of the common tests. Many benzodiazepine tests can find whether the drug is present, but can't give the amount."}, {"url": "http://www.drbrianhoffman.com/dental-information/frequently-asked-questions/what-is-halcion", "passage_text": "Halcion should be taken 1-hour prior to your dental procedure, if prescribed to you by Dr. Hoffman. You may also request the use of Halcion for dental procedures. Dr. Hoffman will review the medication with you and recommend, or not recommend, its use based on your personal health history and medication review."}]