[{"url": "http://theelderinsider.com/home-care-4-54.html", "passage_text": "Why am I paying $25 an hour (or more) for my home health aide when I could pay them $12 an hour. This is a very common, justified question. After reading the information provided below, you may find that the cost of a reputable private pay agency is well worth the extra money. The average charge for a Home Health Aide in Massachusetts from a professional homecare agency is approximately $20 to $27 an hour."}, {"url": "http://theelderinsider.com/home-care-4-54.html", "passage_text": "Hourly Wage: A Certified Home Health Aide’s average starting wage in Massachusetts is $10 – $12/hour. As high as $15/hour for specialty skilled, experienced. Matching Taxes: On top of the hourly pay, the agency is required to pay payroll taxes. This is a very common, justified question. After reading the information provided below, you may find that the cost of a reputable private pay agency is well worth the extra money. The average charge for a Home Health Aide in Massachusetts from a professional homecare agency is approximately $20 to $27 an hour."}, {"url": "http://www.health.state.mn.us/divs/hpsc/dap/maxcharge.pdf", "passage_text": ".pdfThe following summary is for general information only. State and federal laws and regulations can impact whether or not (and how much) a health care provider can charge for copies of patient records. Talk with the provider who has the patient records and explain your situation and what records are sought. "}, {"url": "http://www.care.com/senior-care-how-much-to-charge-for-senior-care-p1145-q7427.html", "passage_text": "According to AARP, the average pay rate for home care services for adults in 2008 was $19 an hour for home care aides, versus $38 an hour for Medicare-certified health aides. These rates, however, varied depending on hours of the day that care was provided, as well as region of the country. If you work for an agency or institution, they will set your pay rate, but if you work independently, you will need to assess how much to charge. For home care aides, rates vary significantly according to: 1  geographical location."}, {"url": "http://www.care.com/senior-care-how-much-to-charge-for-senior-care-p1145-q7427.html", "passage_text": "I have to charge $30/hour with a 4-hour minimum, then offer a $5/hour discount if the client is in my city, and another $5/hour discount for visits of 8 hours or more in one day. If you work for an agency or institution, they will set your pay rate, but if you work independently, you will need to assess how much to charge. For home care aides, rates vary significantly according to: 1  geographical location."}, {"url": "http://www.nolo.com/legal-encyclopedia/business-services-charge-how-much-30158.html", "passage_text": "Independent contractors (ICs) can charge for their services in a variety of ways, such as a fixed amount for an entire project, an hourly fee, or a sales commission. No matter how you bill clients, however, you first need to figure out how much to charge -- even if you charge a fixed fee for the whole project. "}, {"url": "http://www.ehow.com/info_7749441_much-day-care-workers-earn.html", "passage_text": "The annual income home day care workers earned per child in 2009 ranged from $3,500 to $11,900, depending on location, according to the National Association of Child Care Resource and Referral Agencies. That comes to an estimated $17,500 to $59,500 for providers caring for five children, for example. The average home day care income per child in most states ranges from $4,000 to $8,000. Providers in New York are the only other home-based child care workers who earn a five-digit average per infant."}, {"url": "http://www.ehow.com/info_7749441_much-day-care-workers-earn.html", "passage_text": "As a family child care provider, you have the flexibility of setting your own rates, fees and hours, explains the National Association for Family Child Care. Although you determine how much you charge clients for child care, your rates need to be competitive for your region. The average home day care income per child in most states ranges from $4,000 to $8,000. Providers in New York are the only other home-based child care workers who earn a five-digit average per infant."}, {"url": "http://www.care.com/senior-care-how-much-to-charge-for-senior-care-p1145-q7427.html", "passage_text": "Licensed nurses who treat a senior at home generally charge between $50 and $100 a visit. One senior hospitalized in Manhattan paid $5,000 for three days of 24-hour private nursing care, averaging approximately $70 an hour. If you work for an agency or institution, they will set your pay rate, but if you work independently, you will need to assess how much to charge. For home care aides, rates vary significantly according to: 1  geographical location."}]