[{"url": "http://www.siliconindia.com/education-mca-news/Application-Forms-for-various-MCA-Entrance-Exams--sno-703.html", "passage_text": "Application Forms for various MCA Entrance Exams. An MCA entrance examination is conducted by institutes in India for candidates planning to pursue MCA courses. The applications for the entrance exam can be submitted online or offline in the prescribed Application Form only."}, {"url": "http://www.slideshare.net/svprakasha/xbrl-filing-in-mca-21-for-chartered-accountants", "passage_text": "1 Attach instance document to the Form 23AC-XBRL and Form 23ACA-XBRL There shall be a separate set of Form 23AC-XBRL and Form 23ACA-XBRL available on the MCA portal for filing in XBRL form. 2  First fill up the Form 23AC-XBRL and Form 23ACA-XBRL."}, {"url": "http://yourfinancebook.com/how-to-file-form-adt1-with-roc/", "passage_text": "Before filing form ADT1, you need to check the company’s status. If the company is in inactive status then form ADT1 cannot be filed. After having all these information and documents please follow below steps to file form ADT1. 1  Download form ADT1 from MCA site. 2  Please do not download from any other website as those forms may not be the recent updated one."}, {"url": "http://taxguru.in/company-law/file-financial-statements-xbrl-form.html", "passage_text": "Step 5: Attach instance document to the Form 23AC and Form 23ACA. There shall be a separate set of Form 23AC and Form 23ACA available on the MCA portal for filing in XBRL form. First fill up"}, {"url": "http://www.casahuja.com/2014/06/filing-of-form-dpt-4-with-mca-by-30th.html", "passage_text": "Form DPT-4 giving details of deposits due as on the commencement of the Act i.e. 1st April, 2014 along with details of deposits and interest due but not paid, due but not claimed and deposits not due for repayment."}, {"url": "http://www.casahuja.com/2014/06/filing-of-form-dpt-4-with-mca-by-30th.html", "passage_text": "Section 74 (1) (a) stipulates the requirement to file Form DPT- 4 viz. Statement regarding deposit existing on the commencement of Act, 2013, within a period of 3 months from commencement (1.04.2014) or from the date on which such payments are due."}, {"url": "http://yourfinancebook.com/how-to-file-form-adt1-with-roc/", "passage_text": "1 Download form ADT1 from MCA site. 2  Please do not download from any other website as those forms may not be the recent updated one. 3  Always download the form from MCA21 site. 4  Fill up all those details as asked for in the form. 5  If you have collected above information then it will be easier for you to fill the form."}, {"url": "http://www.siliconindia.com/education-mca-news/Application-Forms-for-various-MCA-Entrance-Exams--sno-703.html", "passage_text": "How to fill the MCA Entrance Application Forms: The Application Forms can be filled up in two forms, which is Online and Offline. The candidates filling up the application form online must take the DD prior to the submission."}]