[{"url": "https://en.wikipedia.org/wiki/Olga_(name)", "passage_text": "The male equivalent is Oleg (Олeг). Name days (St. Olga of Kiev): Bulgaria, Poland, Czech Republic, Greece and France – July 11, Slovakia – July 23, Russia – July 24, Hungary – July 27. It is used in Russia (ольга), Ukraine (ольга, transliterated Ol'ha), Belarus (вольга, transliterated Vol'ha), Bulgaria (олга transliterated Ólga), ólga, poland The Faroe, islands The Czech, Republic (GREECE, Ólgha), Olgha, ólgha, Finland, Hungary (Romania), Serbia, olga Iceland And. latin america"}, {"url": "http://www.imdb.com/name/nm1385871/", "passage_text": "Official Photos ». Olga Kurylenko, a Ukrainian-born actress and model, went from sharing a cramped flat with her aunt, uncle, grandparents and cousin to starring as a Bond girl opposite Daniel Craig. She was born Olga Konstantinovna Kurylenko on November 14, 1979, in Berdyansk, Ukraine, Soviet Union. Her mother, Marina Alyabysheva, divorced her father, Konstantin ..."}, {"url": "http://www.thinkbabynames.com/meaning/0/Olga", "passage_text": "Olga /ol-ga/ [2 sylls.] as a girls' name is pronounced OL-gah. It is of Old Norse and Scandinavian origin, and the meaning of Olga is blessed, holy; successful. The Russian form of Helga. Popular in the Russian imperial family. Olga is a very prominent first name for females (#277 out of 4276, Top 6%) and a slightly less prominent surname for both adults and children (#118954 out of 150436, Top 79%). (2000 U.S. Census)."}, {"url": "http://www.urbandictionary.com/define.php?term=olga", "passage_text": "Olga is female name popular in Eastern Europe and Latin America. Name originates from Scandinavian  Helga . To Kievan Russ (Ukraine now) was brought with invited Scandinavian Princes around 500-600 AD. But became popular around introduction of Christianity around 900 AD. Olga. Scandinavian name meaning light or holly, was popular in Europe early 20th century, still very common in Slavic countries like Russia, Ukraine, Belarus. Latin countries adopted this name also, most likely after watching Russian movies like Doctor Zhivago."}, {"url": "http://www.sheknows.com/baby-names/name/olga", "passage_text": "American Meaning: The name Olga is an American baby name. In American the meaning of the name Olga is: Holy. Scandinavian Meaning: The name Olga is a Scandinavian baby name. In Scandinavian the meaning of the name Olga is: Blessed. The name Olga is a Norse baby name. In Norse the meaning of the name Olga is: Holy. Russian Meaning: The name Olga is a Russian baby name. In Russian the meaning of the name Olga is: Holy. Swedish Meaning: The name Olga is a Swedish baby name. In Swedish the meaning of the name Olga is: Holy"}, {"url": "https://en.wikipedia.org/wiki/Olga_(name)", "passage_text": "Olga is an Eastern Slavic female given name, derived from Old Norse name Helga. It is used in Russia (ольга), Ukraine (ольга, transliterated Ol'ha), Belarus (вольга, transliterated Vol'ha), Bulgaria (олга transliterated Ólga), ólga, poland The Faroe, islands The Czech, Republic (GREECE, Ólgha), Olgha, ólgha, Finland, Hungary (Romania), Serbia, olga Iceland And. latin america"}, {"url": "http://www.behindthename.com/name/olga", "passage_text": "Russian form of HELGA. The Varangians brought it from Scandinavia to Russia. The 10th-century Saint Olga was the wife of Igor I, Grand Prince of Kievan Rus (a state based around the city of Kiev). Following his death she ruled as regent for her son for 18 years. After she was baptized in Constantinople she attempted to convert her subjects to Christianity."}, {"url": "http://www.imdb.com/name/nm1385871/bio", "passage_text": "Mini Bio (1). Olga Kurylenko, a Ukrainian-born actress and model, went from sharing a cramped flat with her aunt, uncle, grandparents and cousin to starring as a Bond girl opposite Daniel Craig. She was born Olga Konstantinovna Kurylenko on November 14, 1979, in Berdyansk, Ukraine, Soviet Union. In 1999 Olga married French photographer Cedric Van Mol, but divorced him 3-1/2 years later. One day Olga presented herself to an acting agency. Eventually she swapped the catwalk for the movie screen, and her acting career took off."}]