[{"url": "http://en.wikivet.net/Heart_Structure_-_Anatomy_%26_Physiology", "passage_text": "The pericardium is the membrane that surrounds and protects the heart. It is composed of two layers separated by a narrow cavity. The inner layer is firmly attached to the heart wall and is known as the visceral layer or epicardium. "}, {"url": "http://www.answers.com/Q/What_membrane_surrounds_the_heart", "passage_text": "The double-layered membrane surrounding the heart is called the  pericardium. The pericardium is a thick,  membranous sac that secretes a lubricating liquid. There is a thin …  inner layer that sits directly on and is attached to the surface of  the heart, called the epicardium. Making the world better, one answer at a time. The membrane surrounding the heart is called the pericardium. It is a double-walled sac that protects the heart and helps hold it in place. The visceral pericardium is the layer on the side of the heart, and the parietal pericardium is the outer layer"}, {"url": "http://medical-dictionary.thefreedictionary.com/pericardial+sac", "passage_text": "The fibroserous sac enclosing the heart and the roots of the great vessels, consisting of two layers: the visceral layer or epicardium, immediately surrounding the heart; and the outer parietal layer, which forms the sac and is lined with a serous membrane. Also called heart sac, theca cordis. The pericardium is the thin, sac-like membrane that surrounds the heart. It has two layers: the serous pericardium and the fibrous pericardium. Mentioned in: Coccidioidomycosis, Pericardiocentesis, Pericarditis, Thoracic Surgery. fibroserous, double-layered membrane surrounding"}, {"url": "https://quizlet.com/9515943/chapter-20-the-cardiovascular-system-flash-cards/", "passage_text": "is a double-layered membrane that surrounds and protects the Heart; also called Pericardial Sac (closed sac that surrounds the heart). The Pericardium consists of two layers: the Fibrous Pericardium and the Serous Pericardium. Epicardium. is the inner layer of the Serous Pericardium that is the smooth membrane covering the heart's surface (outer surface). Also called the Visceral Pericardium or the Visceral Layer of the Serous Pericardium.. It is a thin serous membrane that constitutes the smooth, outer surface of the heart."}, {"url": "http://www.answers.com/Q/What_is_the_membranes_that_surround_the_heart_called", "passage_text": "The membrane that protects the heart is called the pericardium. It has two layers: - the visceral pericardium (the inner layer which touches the heart) - the parietal pericar … dium (the outer layer which touches other organs). 1 person found this useful. Confidence votes 345. The pericardium is in the thoracic cavity and partially surrounds the heart. The heart is also supported by parietal and visceral pericardium. These all are serous membranes. Serous membranes secrete a watery fluid that lubricates and helps minimize friction between organs and membranes"}, {"url": "http://medical-dictionary.thefreedictionary.com/pericardial+sac", "passage_text": "It is a closed sac having two layers: the visceral layer (epicardium), immediately surrounding the heart, and the outer parietal layer, forming the sac, composed of strong fibrous tissue, the fibrous pericardium, lined with a serous membrane, the serous pericardium. Synonym(s): heart sac, theca cordis. [L. fr. The pericardium is the thin, sac-like membrane that surrounds the heart. It has two layers: the serous pericardium and the fibrous pericardium. Mentioned in: Coccidioidomycosis, Pericardiocentesis, Pericarditis, Thoracic Surgery. fibroserous, double-layered membrane surrounding"}]