[{"url": "http://www.ducksters.com/science/physics/asteroids.php", "passage_text": "The majority of asteroids orbit the Sun in a ring called the asteroid belt. The asteroid belt is located between the planets Mars and Jupiter. You can think of it as a belt between the rocky planets and the gas planets. These asteroids are called Near-Earth asteroids and they have orbits that cause them to pass close to the Earth. It is estimated that an asteroid larger than 10 feet across strikes the Earth around once a year."}, {"url": "http://www.kidsastronomy.com/asteroid.htm", "passage_text": "No picture currently available Ceres For many years Ceres was thought to be the biggest asteroid in the Solar System. It is about 600 miles wide and contains about 25% of the mass of all the asteroids combined. However, in the summer of 2001 scientists discovered an even bigger asteroid orbiting the Sun near Pluto. Due to their smaller size, asteroids do not have enough gravity to pull themselves into the shape of a ball. Astronomers group asteroids into different categories based on the way they reflect sunlight. The asteroid belt is divided into an inner belt and an outer belt."}, {"url": "http://easyscienceforkids.com/asteroid-belt-facts-video-for-kids/", "passage_text": "You will find out what the major differences asteroids have with planets, how many asteroids exist in our solar system and what an asteroid belt is. The video will also talk about how even though there are hundreds of thousands of asteroids in the solar system, their combined mass are only equal to the mass of the moon. Find out more fun facts about asteroids with this What Is Video for kids. Your kid will find out a lot from enjoying this Asteroid Belt facts for kids video and easily test all your children’s curiosity about Asteroid Belt Facts."}, {"url": "http://science.nationalgeographic.com/science/space/solar-system/asteroids-comets-article/", "passage_text": "Asteroid Belt. Asteroids are essentially chunks of rock that measure in size from a few feet to several miles in diameter. (Small asteroids are called meteoroids.) The largest asteroid, Ceres, is about 590 miles (950 kilometers) wide. Like most asteroids, it lies in the asteroid belt between Mars and Jupiter. Many astronomers believe the belt is primordial material that never glommed into a planet because of Jupiter's gravitational pull. Today, most asteroids orbit the sun in a tightly packed belt located between Mars and Jupiter. Comets are relegated to either a cloud or belt on the solar system fringe. Gravitational tugs, orbital collisions, and interstellar jostles occasionally perturb an asteroid or comet onto a wayward path."}, {"url": "http://www.sciencekids.co.nz/sciencefacts/space/asteroids.html", "passage_text": "Asteroid Facts for Kids. Check out these fun asteroid facts for kids. Enjoy a range of interesting facts about the Solar System’s asteroid belt, the impact of potential asteroid collisions with Earth, theories that suggest an asteroid led to the extinction of the dinosaurs and much more. Asteroids are also known as planetoids or minor planets. Asteroids vary greatly in size, some feature diameters as small as ten metres while others stretch out over hundreds of kilometres. Note that objects under ten metres in diameter are generally regarded as meteoroids."}, {"url": "http://coolcosmos.ipac.caltech.edu/ask/185-What-is-the-asteroid-belt-", "passage_text": "The asteroid belt is a region of space between the orbits of Mars and Jupiter where most of the asteroids in our Solar System are found orbiting the Sun. The asteroids in the asteroid belt come in a variety of sizes. Some are very small (less than a mile across), while others are quite large. The largest asteroid is called Ceres. It is about one-quarter the size of our moon. It is a dwarf planet. 1  Javascript must be enabled to use Cool Cosmos. 2  Learn how."}, {"url": "http://space-facts.com/asteroids/", "passage_text": "1 Some asteroids have moons of their own! 2  Most asteroids orbit the Sun in the Asteroid Belt, which lies between Mars and Jupiter. 3  Asteroids are also referred to as minor planets or planetoids. "}, {"url": "http://www.kidsastronomy.com/asteroid.htm", "passage_text": "What are asteroids? An asteroid is a large rock in outer space. Some, like Ceres, can be very large, while others are as small as a grain of sand. Due to their smaller size, asteroids do not have enough gravity to pull themselves into the shape of a ball. Astronomers group asteroids into different categories based on the way they reflect sunlight. The asteroid belt is divided into an inner belt and an outer belt."}, {"url": "http://www.ducksters.com/science/physics/asteroids.php", "passage_text": "Yes, not only could an asteroid hit Earth, but many asteroids have already struck Earth. These asteroids are called Near-Earth asteroids and they have orbits that cause them to pass close to the Earth. It is estimated that an asteroid larger than 10 feet across strikes the Earth around once a year."}, {"url": "http://www.ducksters.com/science/physics/asteroids.php", "passage_text": "An asteroid is a chunk of rock and metal in outer space that is in orbit around the Sun. Asteroids vary in size from just a few feet across to hundreds of miles in diameter. Most asteroids are not round, but are lumpy and shaped like a potato. As they orbit the Sun, they tumble and spin. These asteroids are called Near-Earth asteroids and they have orbits that cause them to pass close to the Earth. It is estimated that an asteroid larger than 10 feet across strikes the Earth around once a year."}]