[{"url": "http://www.sigmaaldrich.com/life-science/biochemicals/biochemical-products.html?TablePage=14837959", "passage_text": "Antibacterial action generally falls within one of four mechanisms, three of which involve the inhibition or regulation of enzymes involved in cell wall biosynthesis, nucleic acid metabolism and repair, or protein synthesis, respectively. The fourth mechanism involves the disruption of membrane structure."}, {"url": "https://en.wikipedia.org/wiki/Erythromycin", "passage_text": "Erythromycin is an antibiotic useful for the treatment of a number of bacterial infections. This includes respiratory tract infections, skin infections, chlamydia infections, and syphilis. It may also be used during pregnancy to prevent Group B streptococcal infection in the newborn."}, {"url": "http://webmedia.unmc.edu/medicine/scholar/antibioticmechanismsA.ppt", "passage_text": "FQ RESISTANCE Changes in gyrase and topoisomerase Increased efflux RIFAMPIN MECHANISMS OF ACTION OF ANTIBIOTICS BACTERIOSTATIC AGENTS Sulfonamides Drugs inhibiting protein synthesis except aminoglycosides (macrolides, chloramphenicol, tetracyclines etc)."}, {"url": "https://answers.yahoo.com/question/index?qid=20061128232638AA2ZUH7", "passage_text": "Erythromycin mimics the effect of the gastrointestinal polypeptide motilin on gastrointestinal motility. This action is probably due to agonism at the motilin receptors. Motilin receptors are found mainly in the gastric antrum and proximal duodenum."}, {"url": "https://answers.yahoo.com/question/index?qid=20061128232638AA2ZUH7", "passage_text": "Although erythromycin is active against many microbes, its clinical applications are relatively few Mechanism of Action: Erythromycin binds to the 50 S ribosomal subunit, inhibiting bacterial protein synthesis."}, {"url": "https://answers.yahoo.com/question/index?qid=20061128232638AA2ZUH7", "passage_text": "Activity of erythromycin against gram-positive organisms generally is greater than against gram-negative organisms due to its superior penetration into gram-positive organisms."}, {"url": "http://pharmacologycorner.com/protein-synthesis-inhibitors-macrolides-mechanism-of-action-animation-classification-of-agents/", "passage_text": "“Macrolides mechanism of action (MOA) The macrolides bind irreversibly to a site on the 50S subunit of the bacterial ribosome, thus inhibiting the translocation steps of protein synthesis. They may also interfere at other steps, such as transpeptidation."}]