[{"url": "http://mathworld.wolfram.com/TriangleCentroid.html", "passage_text": "Triangle Centroid. The geometric centroid (center of mass) of the polygon vertices of a triangle is the point (sometimes also denoted) which is also the intersection of the triangle's three triangle medians (Johnson 1929, p. 249; Wells 1991, p. 150). The point is therefore sometimes called the median point. "}, {"url": "http://www.mathsisfun.com/geometry/centroid.html", "passage_text": "Centroid. The center of mass. If we cut a shape out of a piece of card it would balance perfectly on its centroid. Another way to think about it is the average position of all the points of an object."}, {"url": "http://jwilson.coe.uga.edu/EMAT6680Su09/Park/As4dspark/As4dspark.html", "passage_text": "A centroid of a triangle is the point where the three medians of the triangle meet. A median of a triangle is a line segment from one vertex to the mid point on the opposite side of the triangle. The centroid is also called the center of gravity of the triangle. "}, {"url": "http://www.virtualnerd.com/geometry/triangle-relationships/medians-altitudes/centroid-find-segment-lengths", "passage_text": "Note: When you're given the centroid of a triangle and a few measurements of that triangle, you can use that information to find missing measurements in the triangle! This tutorial shows you how it's done. "}, {"url": "http://www.demonstrations.wolfram.com/TheCentroidOfATriangleDividesEachMedianInTheRatio12/", "passage_text": "The Centroid of a Triangle Divides Each Median in the Ratio 1:2. A median is the line from a midpoint of a side to the opposite vertex. The medians meet in the centroid, which is the center of mass of the triangle. "}, {"url": "https://en.wikipedia.org/wiki/Median_(geometry)", "passage_text": "The triangle medians and the centroid. In geometry, a median of a triangle is a line segment joining a vertex to the midpoint of the opposing side. Every triangle has exactly three medians, one from each vertex, and they all intersect each other at the triangle's centroid. "}, {"url": "http://www.basic-mathematics.com/centroid-of-a-triangle.html", "passage_text": "The centroid of a triangle is the point where the three medians of a triangle meet or intersect An illustration of the centroid is shown below. In the above graph, we call each line (in blue) a median of the triangle. "}, {"url": "http://www.icoachmath.com/math_dictionary/Centroid.html", "passage_text": "Definition of Centroid. Centroid of a triangle is the point of intersection of all its three medians. The centre of mass of a uniform object is also called as Centroid. Ques: Find the coordinates of the centroid of △XYZ with X (- 4, 2), Y (0, 5), and Z (3, - 1)."}, {"url": "http://www.mathwarehouse.com/geometry/triangles/triangle-concurrency-points/centroid-of-triangle.php", "passage_text": "Definition. of the Centroid of a Triangle. The Centroid is a point of concurrency of the triangle. It is the point where all 3 medians intersect and is often described as the triangle's center of gravity or as the barycent. 1  It is formed by the intersection of the medians."}, {"url": "http://math.tutorvista.com/geometry/centroid.html", "passage_text": "Below are following properties of the centroid: A median of a triangle is a line segment joining a vertex and the midpoint of the opposite side. The three medians $m_a$, $m_b$, and $m_c$, intersect in a single point, G, the triangle's centroid. Below is centroid formulas for some geometric figures: A trapezoid is a quadrilateral with two sides parallel. The centroid of a triangle is the point where the triangle's medians intersect. The centroid is always inside the triangle. In the case of an equilateral triangle, incenter, circumcenter, centroid and orthocentre occur at the same point."}]