[{"url": "http://www.answers.com/Q/How_much_does_a_police_officer_get_paid", "passage_text": "Most cops are poorly paid, small town cop $17,000 to $23,000 a year big city cops $25,000 to $35,000 a year, First responder and medical trainning help The median expected salary for a typical Police Patrol Officer in the United States is $46,191. It varies by department and rank and can be anywhere between $24,000 to $75,000+. The average is around $52,000. Around 50,000 a year. A United States police officer in a large southern east coast city would on average have a starting pay of about $2,800.00 per month, or $33,600.00 per year."}, {"url": "http://www.access2knowledge.org/jobs-education/how-much-do-police-officers-make/", "passage_text": "How much does a police officer make? According to the U.S. Bureau of Labor Statistics, the 632,000 police and law enforcement officers employed in the United States earn an annual mean police officer salary of $57,770, which is equivalent to an average hourly wage of $27.78. Police officers employed for the federal government make considerably less than average at $52,620 each year, but those that work for the state government make $62,810. The top-paying states are New Jersey and California, where police officers earn $84,930 and $84,320 respectively."}, {"url": "http://learn.org/articles/How_Much_Does_a_Police_Officer_Make.html", "passage_text": "Salary by Industry. According to May 2012 BLS figures, the top paying industry for police and sheriff's patrol officers was state governments, which paid a mean hourly wage of $30.20 and an annual mean income $62,810. Local governments paid the second highest average wages of $27.73 hourly and $57,670 annually. The U.S. Bureau of Labor Statistics (BLS) reported that police and sheriff patrol officers had a mean hourly salary of $27.78 in May 2012 (www.bls.gov). This translates to a mean yearly income of $57,770. The top 10% of workers in this occupation made upwards of $42.94 or more an hour."}, {"url": "http://www.answers.com/Q/How_much_money_does_a_police_officer_earn", "passage_text": "Most cops are poorly paid, small town cop $17,000 to $23,000 a year big city cops $25,000 to $35,000 a year, First responder and medical training help The median expected salary for a typical Police Patrol Officer in the United States is $46,191. In the SF Bay Area police officers and Deputy Sheriff's can easily earn $100,000 or more per year. Many departmental starting salaries in the SF Bay Area are $30-38 per hour. Other parts of the country pay siginificantly less, however their costs of living are also much less."}, {"url": "http://work.chron.com/much-money-average-police-highway-patrol-officer-make-6598.html", "passage_text": "Pay by Employer. The average salary for local police officers was $56,160 a year as of 2011. Police officers employed by the federal government earned less, averaging $51,690 a year. State police and highway patrol officers reported the highest earnings, with an average of $60,650 a year. Average and Median Earnings. As of 2011, police and highway patrol officers earned an average of $27.05 an hour and $56,260 a year. Half of all police and highway patrol officers made between $19.77 and $33.65 an hour and between $41,110 and $69,990 a year, according to the Bureau of Labor Statistics."}, {"url": "http://work.chron.com/much-money-police-officer-make-weekly-7363.html", "passage_text": "Wages by Region. Police officers in the Northeast and West reported some of the highest average earnings in the U.S. in 2011. New Jersey ranked first, with an average annual salary of $81,970, or about $1,576 a week. California was second, where officers earned an average of $1,515 a week. The lowest-paid police officers were in the South. Mississippi recorded the lowest average pay, $31,060, or about $597 a week."}, {"url": "http://www.lawenforcement.com/article/5735952-How-much-does-a-law-enforcement-officer-make/", "passage_text": "State pay averages $54,000 and local government pays an average of $56,000. Law enforcement officer pay for patrol police ranges from $30,000 to $80,000. The average salary for this position is $51,000. Federal government pay for this job is an average of $46,000; state government comes in at $57,000; and local governments pay an average of $51,000. "}, {"url": "http://work.chron.com/much-money-police-officer-make-weekly-7363.html", "passage_text": "Police officers reported an average yearly salary of $56,260, or $27.05 an hour, as of 2011, according to the Bureau of Labor Statistics. This works out to average weekly pay of about $1,082. Their median salary was $54,230, or about $1,043 a week. State police reported the highest earnings in 2011, averaging $60,650, or about $1,166 a week. By comparison, police officers employed by local governments reported an average of $1,080 a week, and federal police officers earned an average of $994 a week. California was second, where officers earned an average of $1,515 a week. The lowest-paid police officers were in the South. Mississippi recorded the lowest average pay, $31,060, or about $597 a week."}]