[{"url": "http://www.aocd.org/?page=PseudofolliculitisB", "passage_text": "Share |. Pseudofolliculitis barbae (razor bumps) is a common condition of the beard area occurring in up to 60% African American men and other people with curly hair. The problem results when highly curved hairs grow back into the skin causing inflammation and a foreign body reaction. Over time, this can cause keloidal scarring which looks like hard bumps of the beard area and neck. Shaving sharpens the ends of the hairs like a spear. The hairs then curve back into the skin causing pseudofolliculitis barbae. A 100% effective treatment is to let the beard grow. Once the hairs get to be a certain length they will not grow back into the ski"}, {"url": "http://www.tendskin.com/tendskin.html", "passage_text": "Razor Bumps (pseudofolliculitis barbae, pronounced soo-doe-fol-li-cu-li'-tis): Razor bumps are created when the growing beard hairs exit the skin, curl over, and burrow into the adjacent skin, resulting in an unsightly bump. No other product in the world can do all that Tend Skin® Liquid does, especially when it comes to ingrown hairs and razor bumps (Pseudofolliculitis barbae, PFB)."}, {"url": "http://www.mayoclinic.org/diseases-conditions/folliculitis/basics/definition/CON-20025909", "passage_text": "Folliculitis. Folliculitis is a common skin condition in which hair follicles become inflamed. It's usually caused by a bacterial or fungal infection. At first it may look like small red bumps or white-headed pimples around hair follicles — the tiny pockets from which each hair grows. The infection can spread and turn into nonhealing, crusty sores. The condition isn't life-threatening, but it can be itchy, sore and embarrassing. Severe infections can cause permanent hair loss and scarring. If you have a mild case, it'll likely clear in a few days with basic self-care measures. For more serious or recurring folliculitis, you may need to see a doctor."}, {"url": "http://www.tendskin.com/tendskin.html", "passage_text": "Occurrence varies with nationality. Ingrown Hairs Ingrown hairs form when hairs, growing back after shaving, waxing, electrolysis, or other hair removal method, and fail to grow out of the skin. The hairs curl over inside the follicles under the skin (just like the razor bump hairs curl above the skin). By curling, then creates and unsightly bump. No other product in the world can do all that Tend Skin® Liquid does, especially when it comes to ingrown hairs and razor bumps (Pseudofolliculitis barbae, PFB)."}, {"url": "http://www.experts123.com/q/what-is-pseudofolliculitis-barbae-pfb.html", "passage_text": "PFB primarily affects men and women of African American and Hispanic origin who have tightly curled hair and who shave closely on a regular basis or tweeze hairs frequently, although any individual with curly hair may be affected. It is rather rare and usually far less severe in Caucasian males. PFB may also be seen in women of all races who wax or shave the axillary (pertaining to the armpit) and pubic area (this is known as pseudofolliculitis pubis, a similar condition ... "}, {"url": "http://www.youtube.com/watch?v=sgG6P74-tMg", "passage_text": "Please try again later. http://bit.ly/1arnTW9 ◄ Pseudofolliculitis Barbae treatment — Finding the right information about Pseudofolliculitis Barbae treatment & symptoms, is crucial to managing Pseudofolliculitis Barbae. Learn more about the best current treatment for you. ► http://bit.ly/1arnTW9. Website: http://www.MainMD.com. Provides valuable health information, tools for managing your health, and support to those who seek information. You can trust that our content is timely and credible."}, {"url": "http://www.youtube.com/watch?v=yCjZ-WbRV1c", "passage_text": "Learn how to say words in English correctly with Emma Saying free pronunciation tutorials. Over 140,000 words were already uploaded... Check them out! Visit my homepage: http://www.emmasaying.com ~. Care to show your support? "}]