[{"url": "https://prezi.com/l1_zman2a5fn/how-much-sugar-is-really-in-the-soda/", "passage_text": "out how much sugar is really in a 2 liter soda and to compare it to the amount that the manufacturer indicates on the label. Independent Variable-Brand of soda. Dependent variable-amount of sugar in soda. 1. I remove the carbon dioxide from the soda. 2. I create my sugar solutions. 3. "}, {"url": "http://www.dailymail.co.uk/news/article-2574326/How-drinking-just-one-Coke-day-sugar-latest-World-Health-Organization-warning.html", "passage_text": "Sugar has about 4 calories per gram, or 15 calories per teaspoon. Under the 5 percent guideline, a person who takes in 2000 calories a day would limit sugar to 25 grams. A 12-ounce can of Coca-Cola has 35 grams of sugar, which is 10 grams over the allowance. One Oreo cookie has 4.5 grams, meaning you could eat only five and a half in one day. The guidelines will apply to sugars that have been added to food, or are present in honey, syrups and fruit juices. "}, {"url": "http://www.sugarstacks.com/beverages.htm", "passage_text": "It's hard to believe anyone could drink that much soda. 40% more caffeine than Coke, and 15% more sugar. About the same amount of sugar as soda. Same percentage of sugar, just in a smaller can. Everyone knows that soda is packed with sugar. We stacked up the sugar in some average sized bottles, plus 7-Eleven's super-sized line of Gulp beverages. Most people add at least some ice to their fountain drinks. We figured in enough ice to account for 15% of the cup's volume"}, {"url": "http://healthyeating.sfgate.com/much-sugar-really-soda-4922.html", "passage_text": "Grape and orange-flavored sodas contain between 42 and 45 grams of sugar, which is a little more than 10 teaspoons. Keep in mind that if you drink a 16-ounce or 20-ounce bottle of soda, your intake of sugar will be much higher. The amount of sugar in a soda depends on what type you're drinking, but all soda should be limited in your diet to prevent you from consuming too much of the sweet stuff. Excess sugar in your diet can contribute to tooth decay, weight gain and certain illnesses and diseases."}, {"url": "http://healthyeating.sfgate.com/much-sugar-really-soda-4922.html", "passage_text": "Sugar in Soda. A serving of soda is equal to 12 ounces. Lemon-lime soda contains 37.6 grams of added sugar per serving, and ginger ale contains 31.8 grams, each of which is equal to about 9 1/2 teaspoons of sugar. Cola has 38.9 grams of added sugar per serving, and pepper-type soda varieties contain 38.2 grams. Cola and pepper-type sodas have about 9 3/4 teaspoons of sugar. Root beer contains 39.2 grams of sugar per serving, which is almost 10 teaspoons of sugar. The amount of sugar in a soda depends on what type you're drinking, but all soda should be limited in your diet to prevent you from consuming too much of the sweet stuff. Excess sugar in your diet can contribute to tooth decay, weight gain and certain illnesses and diseases."}, {"url": "http://onecanofsoda.com/", "passage_text": "So how much sugar is in a bottle of soda? Well, most bottles of soda are 20 ounces. 20 ounces has 69 grams, divide by 4, and it means there's 17-and-one-quarter sugar packets in a 20 oz soda bottle. A medium soda cup from McDonalds holds 21 ounces. Maybe they use sugar cubes. 1 sugar packet = 1 sugar cube. So how much sugar is in a packet, or cube? Not every sugar packet is the same size, but almost all of the sugar packets you'll see in the United States contain 4 grams of sugar. And those 4 grams of sugar have 15 calories. That means there's 10 packets of sugar in a can of soda. And at 15 calories per packet, that means that all 150 calories are from the sugar"}, {"url": "http://marshallbrain.com/science/sugar-in-soda.htm", "passage_text": "How much sugar in soda? By Marshall Brain http://youtube.com/watch?v=F10EyGwd57M http://video.google.com/videoplay?docid=-2156528875761294002 In the video, we looked at a can of soda and we measured out how much sugar there is in the can. For example, the can of soda in the video contained 39 grams of sugar. "}]