[{"url": "https://www.moviestudiozen.com/free-tutorials/dvd-architect-studio-50/493-how-to-compress-a-long-video-onto-a-dvd", "passage_text": "Many people record programs off the TV or save videos from YouTube and would like to store them on a DVD. If you attempt to fit anything longer than 60 minutes of video onto a DVD, you will soon discover that this can be a frustrating and wasteful task when you work out how many discs you will need. If you have never made a DVD with Movie Studio Platinum, Vegas Pro or DVD Architect, it might be a good idea that you read/watch some more basic tutorials first on how to create DVDs with DVD Architect or just follow along when you watch the video tutorial on this page."}, {"url": "http://www.bleepingcomputer.com/tutorials/write-a-cd-dvd-image-or-iso/", "passage_text": "Once you click on the Burn disc image option, the Windows Disc Image Burner will open. Select the drive that corresponds to your DVD writer and make sure there a blank DVD or CD inserted into the drive. Once you are ready to start burning the selected ISO image, click on the Burn button. A CD/DVD image is a file that contains all the information necessary to make an exact duplicate, or clone, of a CD or DVD. Images are created by software that writes every bit of information contained on a CD or DVD into a file on your computer."}, {"url": "https://www.moviestudiozen.com/free-tutorials/dvd-architect-studio-50/493-how-to-compress-a-long-video-onto-a-dvd", "passage_text": "4. Use the Bit Rate Calculator to get custom bit rates, so you can render a Video for DVD to a very precise file size that fill fit perfectly onto a single disc. 4. Use Render As to create a new video with custom bit rates. 5. If you have never made a DVD with Movie Studio Platinum, Vegas Pro or DVD Architect, it might be a good idea that you read/watch some more basic tutorials first on how to create DVDs with DVD Architect or just follow along when you watch the video tutorial on this page."}, {"url": "http://www.howtogeek.com/howto/32323/how-to-make-your-own-dvds-from-almost-any-video-file/", "passage_text": "You can also convert and burn video files directly to DVD right from Windows DVD Maker which is included in Vista and Windows 7. However you might need to install the correct codec for it to work. Open the Start Menu \\ All Programs \\ Windows DVD Maker. Then you can move the files around and change the order of them. Go into Project Settings and select Burning. Then check Burn project to disc and give it a label. For best results it’s a good idea to burn at a slower sped and check Verify disc after burning. It also includes some default menu types you can choose from."}, {"url": "https://answers.yahoo.com/question/index?qid=20100518051116AAQ2hN4", "passage_text": "· just now. Report Abuse. I recommend you try TOP Video to DVD Converter I used, it can burn any video to DVD easily and fast, because it can help you convert your one or multiple video files to DVD format and burn them to one DVD movie. Plus, I can also carry them with you and watch them anytime anywhere only with a computer or a DVD player. Report Abuse. Total Video2Dvd can help you convert avi to dvd simply and directly, work on home dvd player support 8 hours video to a single dvd, 1. click New project, add video files, than click OK 2. click DVD menu, preview dvd menu 3. click Output, click Convert and Burn start burn DVD."}, {"url": "http://www.dvd-creator-converter.com/tutorials/how-to-compress-videos-to-dvd.html", "passage_text": "For other settings, you can make DVD menu, edit videos, etc. After that, you can click on Burn tab, insert your recordable DVD disc into your DVD drive and burn the movies onto DVD disc. Once the burning is done, put the DVD disc into your DVD player and watch it on your TV. Have fun. 2. Another option is to use a program to compress/shrink the file to fit a DVD disc. This might affect the quality a bit. 3. One more option for large single file, you can split it up and burn them onto two or more DVD discs."}, {"url": "http://www.ehow.com/how_6030711_burn-video-that_s-big-dvd.html", "passage_text": "Click on the Fit to DVD button on the DVD-burning program's main screen. Eject the disc tray of the DVD drive. Put the blank recordable DVD onto the disc tray. Close the disc tray. Click on the Burn button on the DVD-burning program's main screen. Wait as the digital video file is compressed so that it can fit on the DVD. Wait as the compressed digital video file is burned onto the DVD. "}, {"url": "http://www.ehow.com/how_5859519_fit-movie-dvd_r.html", "passage_text": "Select the Backup tab in DVD Shrink and specify whether you'd like to burn to DVD or save to your hard drive. In most cases, the file size is now small enough to fit on a DVD. Insert the blank DVD disc into your CD drive and select the Burn command on your DVD burning software. If you're using DVD Shrink, select the burn command from the drop-down tab under Backup."}]