[{"url": "http://www.tundraanimals.net/tundraanimals/snowyowl.html", "passage_text": "Notes. Snowy Owls are known by other names including the Great White Owl, Ghost Owl, Ermine Owl and Arctic Owl. Snowy Owls, like other owls, will often eat their prey whole, and will then regurgitate the indigestible parts in the form of a pellet. "}, {"url": "http://www.biokids.umich.edu/critters/Nyctea_scandiaca/", "passage_text": "Snowy owls are the largest bird species in the arctic. They are 63 to 73 cm long and have an average wingspan of 170 cm. Females are larger and heavier than the males. Females weigh 1550 to 1600 grams, and males weigh 1450 to 1500 grams. Snowy owls are white with brown spots and bars. However, in years when there is very little food, snowy owls do not try to breed. Snowy owls usually lay one clutch of eggs each year. However, if their eggs or chicks die early in the breeding season, a breeding pair may lay another clutch of eggs."}, {"url": "https://en.wikipedia.org/wiki/Snowy_Owl", "passage_text": "The snowy owl (Bubo scandiacus) is a large, white owl of the typical owl family. Snowy owls are native to Arctic regions in North America and Eurasia. Younger snowy owls start with darker plumage, which turns lighter as they get older. Males are almost all white, while females have more flecks of gray plumage. This yellow-eyed, black-beaked white bird is easily recognizable. It is 52–71 cm (20–28 in) long, with a 125–150 cm (49–59 in) wingspan. Also, these owls can weigh anywhere from 1.6 to 3 kg (3.5 to 6.6 lb). It is one of the largest species of owl and, in North America, is on average the heaviest owl species."}, {"url": "http://www.defenders.org/northern-spotted-owl/basic-facts", "passage_text": "As a result of declining habitat, there are fewer than 100 pairs of Northern spotted owls in British Columbia, Canada, 1,200 pairs in Oregon, 560 pairs in northern California and 500 pairs in the state of Washington. Although it is often considered to be a medium-sized owl, the northern spotted owl ranks among the largest in North America. The northern spotted owl is dark-to-chestnut brown in color and sports round or oval white spots on its head, neck, back and under parts. Its flight feathers are also dark brown and barred with light brown or white"}, {"url": "http://www.ehow.com/about_6694605_natural-habitat-owls.html", "passage_text": "The many species of owls found in North America occupy quite a range of natural habitats. Owls, depending upon their species, live from the cold tundra of the far northern portions of the continent to the hot and arid southwest deserts. "}, {"url": "http://www.defenders.org/snowy-owl/basic-facts", "passage_text": "Snowy owls swallow their prey, such as lemmings, whole! In North America, snowy owls are found during the breeding season from the western Aleutians in Alaska to northeastern Manitoba (Churchill), northern Quebec and northern Labrador in Canada. Snowy owls mainly eat mammals, ranging from small rodents to large hares. They are also known to eat birds ranging in size from small songbirds to medium-sized geese and lemmings. An adult owl may eat around three to five lemmings each day (1,600 per year)."}, {"url": "http://www.biokids.umich.edu/critters/Nyctea_scandiaca/", "passage_text": "Snowy owls affect the populations of animals that they eat. For example, one owl may kill more than 1,600 lemmings in one year. Snowy owls also compete with many other species for lemmings and other prey. However, in years when there is very little food, snowy owls do not try to breed. Snowy owls usually lay one clutch of eggs each year. However, if their eggs or chicks die early in the breeding season, a breeding pair may lay another clutch of eggs."}, {"url": "http://www.defenders.org/snowy-owl/basic-facts", "passage_text": "The snowy owl is also known as the Arctic owl or the Great White owl. Only females incubate the eggs. The male provides the female and young with food. The young owls begin to leave the nest around 25-26 days after hatching. They are not able to fly well until at least 50 days of age. Snowy owls mainly eat mammals, ranging from small rodents to large hares. They are also known to eat birds ranging in size from small songbirds to medium-sized geese and lemmings. An adult owl may eat around three to five lemmings each day (1,600 per year)."}]