[{"url": "http://www.linfo.org/command_line_interface.html", "passage_text": "Command Line Interface Definition. A command line interface (CLI) is a type of human-computer interface (i.e., a way for humans to interact with computers) that relies solely on textual input and output."}, {"url": "http://searchwindowsserver.techtarget.com/definition/command-line-interface-CLI", "passage_text": "Assyst. vs. BMC Numara Track-It! A CLI (command line interface) is a user interface to a computer's operating system or an application in which the user responds to a visual prompt by typing in a command on a specified line, receives a response back from the system, and then enters another command, and so forth. "}, {"url": "http://www.file.info/windows/cli_exe.html", "passage_text": "The cli.exe process is also known as CLI Application (Command Line Interface) or, as the case may be, ATI Catalyst Control Center and is a part of ATI Catalyst Control Center or, as the case may be, Catalyst Control Centre. This software is produced by ATI Technologies (www.ati.com). Cli.exe is found in a subdirectory of C:\\Program Files - e.g. C:\\Program Files\\ATI Technologies\\ATI.ACE\\ . Frequently occurring are file sizes such as 45,056 bytes (84% of all these files), 32,768 bytes as well as 5 other variants. The cli file is not part of the Windows operating system."}, {"url": "http://www.vmware.com/support/developer/vcli/", "passage_text": "The vSphere Command-Line Interface (vSphere CLI) command set allows you to run common system administration commands against ESXi systems from any machine with network access to those systems. "}, {"url": "http://www.file.info/windows/cli_exe.html", "passage_text": "An obsolete or defective version of cli.exe can cause problems for your computer that can range from slowness to error messages such as these: 1  CLI Application has stopped working. 2  Windows is checking for a solution to the problem... ( 3 Windows 8, 7, Vista). 4  CLI Application has stopped working. Cli.exe is found in a subdirectory of C:\\Program Files - e.g. C:\\Program Files\\ATI Technologies\\ATI.ACE\\ . Frequently occurring are file sizes such as 45,056 bytes (84% of all these files), 32,768 bytes as well as 5 other variants. The cli file is not part of the Windows operating system."}, {"url": "https://en.wikipedia.org/wiki/Common_Language_Infrastructure", "passage_text": "The Common Language Infrastructure (CLI) is an open specification developed by Microsoft and standardized by ISO and ECMA that describes executable code and a runtime environment that allow multiple high-level languages to be used on different computer platforms without being rewritten for specific architectures. "}, {"url": "http://www.cisco.com/c/en/us/td/docs/ios/12_2/configfun/command/reference/ffun_r/frf001.html", "passage_text": "Usage Guidelines. The exit command is used in the Cisco IOS CLI to exit from the current command mode to the next highest command mode in the CLI mode hierarchy. For example, use the exit command in global configuration mode to return to privileged EXEC mode. This chapter describes the commands used to enter and exit the various Cisco IOS configuration command modes. It provides a description of help features, command-line interface (CLI) navigation commands, and the command history feature."}, {"url": "http://www.file.info/windows/cli_exe.html", "passage_text": "What you should know about cli.exe CLI Application. cli.exe is not a Windows system file and is known to frequently cause computer problems. Cli.exe is found in a subdirectory of C:\\Program Files - e.g. C:\\Program Files\\ATI Technologies\\ATI.ACE\\ . Frequently occurring are file sizes such as 45,056 bytes (84% of all these files), 32,768 bytes as well as 5 other variants. The cli file is not part of the Windows operating system."}, {"url": "https://en.wikipedia.org/wiki/Command-line_interface", "passage_text": "Alternatives to the command line include, but are not limited to text user interface menus (see IBM AIX SMIT for example), keyboard shortcuts, and various other desktop metaphors centered on the pointer (usually controlled with a mouse). In RISC OS, the command prompt is a * symbol, and thus (OS)CLI commands are often referred to as star commands. It is also possible to access the same commands from other command lines (such as the BBC BASIC command line), by preceding the command with a * ."}, {"url": "https://en.wikipedia.org/wiki/Command-line_interface", "passage_text": "The CLI was the primary means of interaction with most computer systems until the introduction of the video display terminal in the mid-1960s, and continued to be used throughout the 1970s and 1980s on OpenVMS, Unix systems and personal computer systems including MS-DOS, CP/M and Apple DOS. In RISC OS, the command prompt is a * symbol, and thus (OS)CLI commands are often referred to as star commands. It is also possible to access the same commands from other command lines (such as the BBC BASIC command line), by preceding the command with a * ."}]