[{"url": "http://www.youtube.com/watch?v=uElOjvonJC0", "passage_text": "Learn how to scan from the control panel of your HP printer when the printer is connected to a wireless network. These instructions are applicable to wireless-connected: HP Photosmart Plus e-All-in-One B210 series, HP Officejet Pro 8500A (A910a-z) series, "}, {"url": "http://www.wikihow.com/Scan-a-Document-Wirelessly-to-Your-Computer-with-an-HP-Deskjet-5525", "passage_text": "4. Adjust settings. On the right panel, after you’ve chosen a scan shortcut, you can further adjust your settings: 1  Select scan size —Define how large the scanned document or photo is. 2  You can choose from the Entire Scan Area, a Letter, an A4, and other various dimensions. 3  Select output type —Define the output file’s color. "}, {"url": "http://www.ehow.com/how_5754316_scan-documents-mac.html", "passage_text": "Set up the scanner. Plug in the scanner to a power outlet or power strip. Connect the scanner to your Mac computer. Most scanners connect to computers using a standard USB 2.0 connection. Upon connection, your Mac should recognize the scanner and automatically sync it with the drivers and software. Ready the scanner. Insert a document into the scanner. Most scanners require the document to be placed face-down, with the top of the document facing toward the left. Position the document on the scanner according to your scanner's specifications. Close the lid. Scan the document. This can be done in one of two ways. Most scanners have a scan button. If the scanner you are using does not have a scan button, or the scan button is not working, you can scan the document from the computer. Open the software that you installed for your device and click Scan.. Import the document"}, {"url": "http://www.epson.com/cgi-bin/Store/support/supDetail.jsp?infoType=FAQ&oid=227222&foid=242704", "passage_text": "1 To scan to your PC, you first need to select how you connected your product to your computer: 2  If your product is connected directly to your computer with a USB cable, select USB Connection. 3  If your product is connected to your computer over a network, select the computer name from the list. "}, {"url": "http://www.wikihow.com/Scan-on-a-Mac", "passage_text": "Part 1 of 3: Connecting Your Scanner. 1. Plug in your multifunction printer or scanner. Connect it to your Mac with a USB cable that attaches from the printer’s port to the back or side of your Mac. 1  Alternatively, you can use a wireless-enabled printer or scanner through your local Wi-Fi connection. 1 Use Image Capture. 2  If you are using devices in a network, you can easily choose from cameras, shared devices and devices dedicated to your Mac. 3  Use the scanner’s icon. 4  Once the device is installed you can place it on your dock."}, {"url": "http://scanners.fcpa.fujitsu.com/scansnapit/scansnap-ix500.php", "passage_text": "The ScanSnap iX500 in addition to being able to wirelessly scan to a PC or Mac also supports wireless scanning to mobiles and tablets including iOS, Android* and Kindle devices. In conjunction with the ScanSnap Connect Application** users can initiate the scanning process from the scanner or mobile. "}, {"url": "http://www.fujitsu.com/downloads/COMP/fcpa/scanners/ix500_datasheet.pdf", "passage_text": "Wi-Fi or USB connectivity to a computer Break free from USB and place ScanSnap just about anywhere in the room with Wi-Fi connectivity to a PC or Mac.* * May require latest online updates. Requires use of an existing wireless router. "}, {"url": "http://www.fujitsu.com/us/Images/ScanSnap_iX500_datasheet.pdf", "passage_text": "Wi-Fi or USB connectivity to a computer Break free from USB and place ScanSnap just about anywhere in the room with Wi-Fi connectivity to a PC or Mac.* * May require latest online updates. Requires use of an existing wireless router. Only one computer can be registered for Wi-Fi connection. "}, {"url": "https://support.apple.com/en-us/HT204790", "passage_text": "1 Place the item(s) you would like to scan on the scanner bed. 2  Open Image Capture by clicking Launchpad in the Dock and typing Image Capture in the search field. 3  OS X Mountain Lion: If your scanner has a document feeder, you can check Use Document Feeder to scan via the feeder instead of the flatbed. 1 OS X Mountain Lion: If your scanner has a document feeder, you can check Use Document Feeder to scan via the feeder instead of the flatbed. 2  OS X Lion and earlier: If your scanner supports different modes, you will see a Mode: pop-up menu in Image Capture."}, {"url": "http://www.ehow.com/how_7420479_scan-documents-wirelessly.html", "passage_text": "Instructions. Click Start, select All Programs, then click Windows Fax and Scan.. Click Scan at the bottom of the window, then select New Scan.. Check the Scanner to which you are connected. Click Change if you have multiple scanners, then double click your wireless scanner. Click Profile, then select a profile depending on your document. "}]