[{"url": "http://coteychemical.com/products/liquiddescaler.php", "passage_text": "Use LIQUID DESCALER to: 1  remove biofilm produced by slime-forming bacteria, such as that produced by iron-oxidizing and sulfate-reducing bacteria. 2  act as an excellent chelating agent (tie up) on iron sulfates and iron chlorides. 3  dissolve carbonate, sulfate, magnesium and iron deposits (mineral deposits). How to use LIQUID DESCALER: Descale equipment in water wells by using to 5 to 10 gallons per 100 gallons of water inside casing. (See table for calculation). LIQUID DESCALER should remain in the well for 24-36 hours and should be agitated every few hours."}, {"url": "http://www.watersoftenercritic.com/eddy-electronic-descaler-review/", "passage_text": "If you have don e a little research into the types of water softeners on the market at the moment, you would have come across the Eddy Electronic Water Descaler, which is said to be a great alternative to a water softener system-it basically does the same thing as a traditional water softener, but in a different way. If you want to learn a little more about about how magnetic water softeners work, check this page out. The Eddy descaler is a very popular item in the world of water softening, but there are mixed reviews-lots of lovers, but plenty of haters."}, {"url": "http://www.apexengineeringproducts.com/products/rydlymehome/", "passage_text": "RYDLYME the World's Leading Biodegradable Descaler! Get RYD of water scale, lime scale and other mineral deposits! RYDLYME biodegradable descaler is specifically designed to dissolve the toughest water scale, limescale, mud and rust deposits from virtually any piece of water-based equipment. This innovative water scale remover is non-toxic, non-hazardous and biodegradable making it safe for personnel, equipment and our environment."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20080130024229AAJhGgV", "passage_text": "(Soft water is pure water.) This builds up over time and eventually the water flow is blocked off and the item no longer functions correctly. A water descaler dissolves the calcium or magnesium which has built up. The calcium or magnesium is absorbed from the ground into the water supply so whether you have hard or soft water is dependant on the ground where you live. Scale is the solid layer that is deposited on the surfaces inside pipes, boilers, heaters etc. Chemically, scale is combination of water insoluble salts of Calcium and Magnesium-CaCO3 (limescale) and MgCO3."}, {"url": "http://www.freedrinkingwater.com/water_quality/quality1/50-08-water-filter-differ-from-descaler-conditioner-softener.htm", "passage_text": "This is different from a water filter system, in that filters will generally remove bacteria (in some cases), suspended particles (sand, sediment, etc.) and specific chemicals, depending on the filter media. Most filter systems do not remove dissolved solids, such as those that cause hardness. Water filter systems are primarily concerned with trapping bacteria or solids which could produce bacterial conditions in those who drink from it."}, {"url": "http://www.freedrinkingwater.com/water_quality/quality1/50-08-water-filter-differ-from-descaler-conditioner-softener.htm", "passage_text": "Newer pressure filtration systems capable of nanofiltration and reverse osmosis filtration will remove salts, and reduce hardness. A descaler does not remove dissolved solids; it attempts to prevent the solids from being deposited inside pipes, on fixtures, etc. The word conditioner is very vague and is commonly used in reference to lime scale prevention. Most filter systems do not remove dissolved solids, such as those that cause hardness. Water filter systems are primarily concerned with trapping bacteria or solids which could produce bacterial conditions in those who drink from it."}, {"url": "http://www.apexengineeringproducts.com/products/rydlymehome/", "passage_text": "Whether you are descaling heat exchangers, chillers, condensers, pumps, cooling towers, boilers, tubes, pipes or any equipment that comes in contact with water, RYDLYME is the descaler of choice. Fortified with wetting and penetrating agents to dissolve deposits into solution, RYDLYME is fast and cost-effective. RYDLYME biodegradable descaler is specifically designed to dissolve the toughest water scale, limescale, mud and rust deposits from virtually any piece of water-based equipment."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20080130024229AAJhGgV", "passage_text": "Best Answer: Water de-scaler is a group of compound(s) which remove inhibits the scale formation. Scale is the solid layer that is deposited on the surfaces inside pipes, boilers, heaters etc. Chemically, scale is combination of water insoluble salts of Calcium and Magnesium-CaCO3 (limescale) and MgCO3. Chemical de-scaler reacts with these to form soluble salts which are then washed away to remove the 'clogging'"}, {"url": "http://cleanwateramerica.com/city-water-saltless-water-softeners-or-descaler/", "passage_text": "Saltless or salt free water softeners are better known as Descalers and are used for City Water only. A Descaler doesn’t actually soften the water, so there is no slick soft water feel, but it does keep the dissolved scale minerals from being deposited on the inside of pipes, dishwashers, and washing machines. However, all have proven to be ineffective. The Scale Stop Descaler system has achieved a 99.6% effectiveness rating, which is far more effective than any other softener alternative. It has been tested and proven successful for over six years in homes and businesses."}, {"url": "https://en.wikipedia.org/wiki/Descaling_agent", "passage_text": "A descaling agent or chemical descaler is a chemical substance used to remove limescale from metal surfaces in contact with hot water, such as in boilers, water heaters, and kettles. "}]