[{"url": "http://www.biology-online.org/dictionary/Transcription_unit", "passage_text": "Transcription unit. Definition. noun. A stretch of DNA being transcribed into an RNA molecule. Supplement. Transcription units are mapped by kinetic studies of rRNA synthesis. It can also be visualized by electron microscopy. "}, {"url": "http://medical-dictionary.thefreedictionary.com/transcription+unit", "passage_text": "transcription-control region. the cis-acting DNA sequences regulating transcription of a specific gene. transcription factor (TF). a general term for any protein, other than RNA polymerase, required to initiate or regulate transcription in eukaryotic cells. General TFs are involved in the formation of the transcription-preinitiation complexes near the start site and are required for transcription of all genes; specific TFs stimulate (activators) or inhibit (suppressors) transcription of particular genes by binding to their regulatory sequences. nested set transcription.1. the transfer of information. 2. the synthesis of RNA using a DNA template catalyzed by an RNA polymerase; the base sequences of the RNA and the DNA template are complementary."}, {"url": "http://www.thefreedictionary.com/transcription+unit", "passage_text": "2. transcription - (genetics) the organic process whereby the DNA sequence in a gene is copied into mRNA; the process whereby a base sequence of messenger RNA is synthesized on a template of complementary DNA. genetic science, genetics-the branch of biology that studies heredity and variation in organisms."}, {"url": "http://www.nature.com/scitable/definition/transcription-unit-260", "passage_text": "transcription unit. Sequence of nucleotides in DNA that codes for a single RNA molecule, along with the sequences necessary for its transcription; normally contains a promoter, an RNA-coding sequence, and a terminator. © 2005 by W. H. Freeman and Company. All rights reserved. Pierce, B. Genetics: A conceptual approach. 2nd Edition. "}, {"url": "http://medical-dictionary.thefreedictionary.com/order+transcription", "passage_text": "order transcription, a nursing intervention from the Nursing Interventions Classification (NIC) defined as transferring information from order sheets to the nursing patient care planning and documentation system. See also Nursing Interventions Classification. 1  Facebook. 2  Twitter. transcription. 1. the transfer of information. 2. the synthesis of RNA using a DNA template catalyzed by an RNA polymerase; the base sequences of the RNA and the DNA template are complementary."}, {"url": "http://en.mimi.hu/biology/transcription_unit.html", "passage_text": "Transcription unit. transcription unit. A region in DNA, bounded by an initiation (start) site and termination site, that is trans cribed into a single primary transcript. Transcription Unit. A region of DNA that trans cribes a single primary transcript. Related ... transcription unit s can be mapped by kinetic studies of rNA synthesis and in some instances directly visualised by electron microscopy. Please contribute to this project, if you have more information about this term feel free to edit this page ..."}]