[{"url": "http://biologyfunfacts.weebly.com/cell-organelles.html", "passage_text": "Nucleus. The nucleus is one of the most important organelles in a cell. It is often the largest organelle in animal cells, but this is not always the case. Nuclei contain the genetic material called DNA that is responsible for controlling and directing all cell activities."}, {"url": "http://www.biology-online.org/dictionary/Cell_organelle", "passage_text": "Cell organelle. Definition. noun, plural: cell organelles. A membrane-bound compartment or structure in a cell that performs a special function. Supplement. A eukaryotic cell contains many organelles, for example, the nucleus, endoplasmic reticulum, golgi apparatus, mitochondria, and chloroplast (plastid)."}, {"url": "http://www.biology-online.org/dictionary/Organelle", "passage_text": "A eukaryotic cell contains many organelles, for example, the nucleus, endoplasmic reticulum, golgi apparatus, mitochondria, and chloroplast (plastid). However, not all these organelles are found in only one cell or in an organism. The chloroplast, for instance, is abundant in plant cells but not in animal cells."}, {"url": "http://www.ehow.com/info_8733502_organelle-cell.html", "passage_text": "Found This Helpful. Jupiterimages/Photos.com/Getty Images. An organelle is any part of a cell having a specialized function. Organelles are located within the cytoplasm, or the area between the cell wall and the nucleus. Organelles maintain the integral activities within the cell. Without these vital structures, the cell loses its ability to function and eventually dies."}, {"url": "http://www.ehow.com/info_8733502_organelle-cell.html", "passage_text": "An organelle is any part of a cell having a specialized function. Organelles are located within the cytoplasm, or the area between the cell wall and the nucleus. Organelles maintain the integral activities within the cell. Without these vital structures, the cell loses its ability to function and eventually dies."}]