[{"url": "http://www.blueplanetbiomes.org/deciduous_plant_page.htm", "passage_text": "American Beech Common Names: beech, carolina beech, gray beech, red beech, ridge beech, stone beech, white beech, winter beech.Genus: FagusSpecies: grandifolia. The American Beech tree grows in the southern and eastern parts of the United States. It grows in deciduous forests all over Maine and northern Massachusetts. It grows best in deep, rich, moist, well-drained soils. The American beech is a tall and wide tree. "}, {"url": "http://www.blueplanetbiomes.org/deciduous_forest.htm", "passage_text": "Northeast Asian Deciduous Forest. Deciduous forests can be found in the eastern half of North America, and the middle of Europe. There are many deciduous forests in Asia. Some of the major areas that they are in are southwest Russia, Japan, and eastern China. South America has two big areas of deciduous forests in southern Chile and Middle East coast of Paraguay. There are deciduous forests located in New Zealand, and southeastern Australia also. The average annual temperature in a deciduous forest is 50° F. The average rainfall is 30 to 60 inches a year."}, {"url": "http://www.answers.com/Q/What_are_scavengers_in_a_temperate_deciduous_forest", "passage_text": "1 Food Chain of the Eastern Deciduous Forest Animals The eastern deciduous forest of North America is found near the eastern part of the United States, and trails off in Southern Ontario, Canada. 1 Temperate forest environmental issues stem from the fact that…. 2 "}, {"url": "https://en.wikipedia.org/wiki/Deciduous_forest", "passage_text": "Two distinctive types of deciduous forest are found growing around the world. Temperate deciduous forest biomes are plant communities distributed in North and South America, Asia, Southern slopes of the Himalayas, Europe and for cultivation purposes in Oceania. In botany and horticulture, deciduous plants, including trees, shrubs and herbaceous perennials, are those that lose all of their leaves for part of the year. This process is called abscission. In some cases leaf loss coincides with winter — namely in temperate or polar climates."}, {"url": "http://www.blueplanetbiomes.org/deciduous_forest.htm", "passage_text": "The deciduous forests are located in the temperate zone above the tropical forests and below the coniferous forests. Most of Europe, the eastern half of North America, parts of Japan and Asia were once covered with large deciduous forests. South America has two big areas of deciduous forests in southern Chile and Middle East coast of Paraguay. There are deciduous forests located in New Zealand, and southeastern Australia also. The average annual temperature in a deciduous forest is 50° F. The average rainfall is 30 to 60 inches a year."}, {"url": "http://www.edurite.com/kbase/deciduous-forest-decomposers", "passage_text": "A temperate deciduous forest, more precisely termed temperate broadleaf forest or temperate broadleaved forest, is a biome found in the eastern and western United States, Canada, central Mexico, southern South America, Europe, West Asia, China, Japan, North Korea, South Korea and parts of Russia. The temperate deciduous broadleaf forest (TDBF) is composed of broad-leaf angiosperm trees like the oaks, maples, and beeches familiar to many Americans and Europeans. The forests exist best in moderate climates that are neither too hot nor too cold and neither too wet nor too dry."}, {"url": "http://soils4teachers.org/forest", "passage_text": "Even though these types of forests are very different, their soil characteristics are very similar. Boreal forests are the evergreen forests that are far to the north, and transition into the tundras. There are also evergreen temperate forests, which are mixes of coniferous and deciduous plants. Forest soils are formed under conditions that are not too wet, or too dry. The soils in temperate forests depend on the type of forests. The temperature ranges from high (like Florida) to very low (Northern Canada/Siberia). Where parent materials are sandy, evergreen vegetation tends to dominate the landscape."}, {"url": "http://www.answers.com/Q/What_are_scavengers_in_a_temperate_deciduous_forest", "passage_text": "temperate Deciduous Forest are important because it is homes to millions of animals. the temperate decidcuos forest is home to more animals than any other biome. and because t … he deciduous forests are important to the earth atmosphere. 1 Temperate forest environmental issues stem from the fact that…. 2  Food Chain of the Eastern Deciduous Forest Animals The eastern deciduous forest of North America is found near the eastern part of the United States, and trails off in Southern Ontario, Canada."}, {"url": "http://kids.nceas.ucsb.edu/biomes/temperateforest.html", "passage_text": "LOCATION: Most temperate, deciduous (leaf-shedding) forests are located in the eastern United States, Canada, Europe, China, Japan, and parts of Russia. Deciduous forests are broken up into five zones. The firstzone is the tree stratum zone. The average temperature in temperate deciduous forests is 50°F (10°C). Summers are mild, and average about 70°F (21°C), while winter temperatures are often well below freezing. PLANTS: Trees and plants in deciduous forests have special adaptations to survive in this biome."}, {"url": "http://www.answers.com/Q/What_are_scavengers_in_a_temperate_deciduous_forest", "passage_text": "The Temperate Deciduous Forest has many trees, such as the Maple, Elm, Brasswood, and more. It also has a diverse amount of flowers (mostly springtime) and animals. The animal … s include Black Bears, Foxes, Squirrels, etc. 1 Temperate forest environmental issues stem from the fact that…. 2  Food Chain of the Eastern Deciduous Forest Animals The eastern deciduous forest of North America is found near the eastern part of the United States, and trails off in Southern Ontario, Canada."}]