[{"url": "http://study.com/articles/Business_Systems_Analyst_Job_Description_and_Requirements.html", "passage_text": "Business systems analysts can also be referred to as computer systems analysts. The U.S. Bureau of Labor Statistics (BLS) reports computer systems analysts are expected to be in high demand over the 2012-2022 decade, with faster-than-average employment growth of 25%."}, {"url": "http://www.rasmussen.edu/degrees/business/blog/a-business-systems-analyst-what-is-that/", "passage_text": "As a business systems analyst, it will be your job to evaluate a company’s procedures and systems in order to develop insights into how to make changes to assist the business in operating more efficiently. Understanding how the processes of each department within an organization affect business output is critical."}, {"url": "http://www.floridatechonline.com/resources/computer-information-systems/application-systems-analyst-career-and-salary-profile/", "passage_text": "Most application systems analysts focus on a specific type of system, such as business, accounting and financial, or scientific and engineering. The type and size of these application systems will vary according to the industry and organization."}, {"url": "http://study.com/articles/Business_Systems_Analyst_Job_Description_and_Requirements.html", "passage_text": "Learn about the education and preparation needed to become a business systems analyst. Get a quick view of the requirements as well as details about degree programs, job duties and required experience to find out if this is the career for you. View 10 Popular Schools »."}, {"url": "http://www.floridatechonline.com/resources/computer-information-systems/application-systems-analyst-career-and-salary-profile/", "passage_text": "The best job opportunities generally go to application systems analysts with a bachelor’s degree as well as in-depth knowledge of systems development and integration for new technologies, like wireless Internet and personal mobile computing."}, {"url": "http://study.com/articles/Systems_Analyst_Job_Description_and_Employment_Info_for_a_System_Analyst.html", "passage_text": "Systems Analyst: Job Description & Employment Info. Learn about the type of work that a systems analyst performs. Find out what education and skills are required, and check the employment outlook and salary to decide if this is the right career for you."}, {"url": "http://www.floridatechonline.com/resources/computer-information-systems/application-systems-analyst-career-and-salary-profile/", "passage_text": "An application systems analyst career can begin with earning a bachelor’s degree in computer information systems. Coursework usually includes statistics, introduction to Internet applications, continuous quality management, survey of software systems, and systems analysis and design."}, {"url": "http://www.villanovau.com/resources/business-analysis/business-analyst-job-description/", "passage_text": "The business analyst’s primary objective is helping businesses implement technology solutions in a cost-effective way by determining the requirements of a projec t or program, and communicating them clearly to stakeholders, facilitators and partners."}, {"url": "http://study.com/articles/Systems_Analyst_Job_Description_and_Employment_Info_for_a_System_Analyst.html", "passage_text": "Career Definition. There are specific types of systems analysts such as systems architects or systems designers but a systems analyst generally works in the computer department of a company providing the research and information necessary to maintain an up-to-date computer system."}]