[{"url": "http://www.zales.com/jewelry101/index.jsp?page=gemstones_DrusyQuartz", "passage_text": "DRUSY QUARTZ. Drusy is a gemstone with a natural surface texture much like fine sugar crystals. Formed by a phenomena of micro-crystalline facets millions of years ago, drusy is the result of dissolved silica carried by ground water deposited in the porous areas of quartz. "}, {"url": "http://www.qwhatis.com/what-is-drusy/", "passage_text": "Drusy or druzy refers to the fine crystal coating that can commonly be found in various gemstones and jewelry pieces. Geologically, the term “druse” is used when there are fine crystals that cover certain rocks or form at the core or near the veins. From the term “druse”, any rock coated with fine crystals or jewelry piece that resemble the same is called druzy or drusy. The fine layer of crystals that form in various rocks are secondary to years of exposure to various natural elements like gases that get trapped within them."}, {"url": "http://www.ebay.com/gds/What-is-Druzy-Quartz-Gemstone-Where-It-Found-/10000000019755573/g.html", "passage_text": "Please sign in to vote on this Guide. Druzy Quartz (also spelt as Drusy or Druse) is a thin layer of quartz crystals covering the surface of a host stone. One good example of Druzy is the crystals filled inside the cavity of a geode. It is well known that amethyst or citrine get the source of their color from this quartz crystal but usually Druzy Quartz takes the host stone's color which is seen through it as in chrysocolla or uvarovite garnet."}, {"url": "http://www.qwhatis.com/what-is-drusy/", "passage_text": "Drusy quartz are said to be the most commonly found crystal-coated stones. These rock or stone pieces are formed with the help of silica and water. With the mineral’s natural tendency to react with other substances, crystal quartz is then formed from the inside of rocks or more commonly as coating on the outside. From the term “druse”, any rock coated with fine crystals or jewelry piece that resemble the same is called druzy or drusy. The fine layer of crystals that form in various rocks are secondary to years of exposure to various natural elements like gases that get trapped within them."}, {"url": "http://www.mineralszone.com/gemstones/druzy-quartz.html", "passage_text": "• Zircon. Druzy Quartz (also spelt as Drusy or Druse) is a thin layer of quartz crystals covering the surface of a host stone. One good example of Druzy is the crystals filled inside the cavity of a geode. The term Druzy refers to the tiny crystal which is formed within of on another stone in a large number. When the ground water that carries dissolved silica is forced to to get filled into a porous area of rock, rapid cooling occurs and it causes the formation of minute crystals."}, {"url": "http://www.leaderpage.com/cms_upload_docs/About-Flat-Drusy-Quartz-Natural-agate-Druzy-Gemstones-Titanium-Coated-With-Small-Shiny-Grains-for-Je-4.pdf", "passage_text": "Drusy, druse, druzy, drusies ‐ different spellings, but they all mean tiny quartz. crystals that form within or on the surface of other stones. When ground water carrying dissolved silica is forced into a porous area of the rock, rapid cooling often occurs, causing the formation of tiny crystals on the surfaces or in. "}, {"url": "http://www.ehow.com/about_5031843_drusy-quartz.html", "passage_text": "Drusy (or druzy) is a geological term applied to quartz that forms a layer of closely spaced, small crystals that line a surface or cavity of another kind of rock. Save. GreenSeason/iStock/Getty Images. Drusy (or druzy) is a geological term applied to quartz that forms a layer of closely spaced, small crystals that line a surface or cavity of another kind of rock. Drusy quartz, silicon dioxide, is most commonly clear or whitish, and can resemble glittering sugar or snow crystals."}, {"url": "http://www.drusy-quartz.com/what-is-drusy-quartz/", "passage_text": "Druzy Quartz is the glittering effect of small even crystals over a mineral. Sparkles and glittering effect makes it eye-dazzling and classy. Druzy is 100% natural quartz stone that comes with an agate (quartz) as base and a top thin layer of crystalline quartz. Different types of minerals are found as drusies. "}, {"url": "http://www.ebay.com/gds/What-is-Druzy-Quartz-Gemstone-Where-It-Found-/10000000019755573/g.html", "passage_text": "The term Druzy refers to the tiny crystal which is formed within of on another stone in a large number. When the ground water that carries dissolved silica is forced to to get filled into a porous area of rock, rapid cooling occurs and it causes the formation of minute crystals. One good example of Druzy is the crystals filled inside the cavity of a geode. It is well known that amethyst or citrine get the source of their color from this quartz crystal but usually Druzy Quartz takes the host stone's color which is seen through it as in chrysocolla or uvarovite garnet."}]