[{"url": "http://www.ehow.com/about_7513171_charge-off-account-mean.html", "passage_text": "A charge off account is a tax and accounting maneuver done by a creditor. It means that they are reporting the debt as a loss on their income taxes so that they may claim it as a deduction from their income. A charged off debt does not mean that the creditor can't try to collect the debt in the future."}, {"url": "http://www.answers.com/Q/What_does_charged_off_account_mean", "passage_text": "When a credit account has been charged off, that means that the original creditor, i.e. a bank or financier, has given up on collecting the money to you, so they sell the debt to a debt collection company for so much on the dollar."}, {"url": "http://www.shamrockfinancial.com/secrets-settling-credit-collections-charge-offs/", "passage_text": "Charge-offs can stay on your credit report for seven years from the date it was charged off. Therefore, it could stay on your report for 7- 7.5 years or more! That’s a long time for negative information to remain on your reports. Just because it says Charge-Off does not mean the debt is forgiven by the creditor."}, {"url": "http://www.adllawaz.com/what-is-a-charge-off/", "passage_text": "A charge-off means your account is delinquent and the credit card company is viewing it as a business loss. In other words, they’ve figured out that you aren’t going to be paying them anytime soon and it’s sort of an in-house shuffle of your account to a different status or department."}, {"url": "http://credit.about.com/od/creditrepair/a/repairchargeoff.htm", "passage_text": "Once a charge-off is on your credit report, it will remain there for seven years from the date it was charged off. In total, the account remains on your credit report for seven and a half years. That's a long time to have such a negative entry on your credit report."}, {"url": "http://www.badcredit.org/what-does-it-mean-when-your-account-is-charged-off/", "passage_text": "When an account is charged off, it does not mean the loan has been cancelled by the creditor. What this financial term actually means is the loan has been marked on the bank’s books as noncollectable and has been recorded as a loss. However, it still exists and has value to"}, {"url": "https://answers.yahoo.com/question/index?qid=20110528132635AAF3GWC", "passage_text": "Report Abuse. It's an accounting term that means that your creditor wrote the debt off as noncollectable. It does not mean that they can no longer try to collect, they can. A charge off is a disaster for your credit rating and when it occurs, there's no undoing the damage. A charge off stays on your credit report for 7 years from the original date of default, even if you pay the debt back in full."}]