[{"url": "http://www.abpischools.org.uk/page/modules/infectiousdiseases_immunity/immunity2.cfm?coSiteNavigation_allTopic=1", "passage_text": "Antibody. Protein that is produced by lymphocytes (white blood cells) and that attaches to a specific antigen. Antigen. Molecule on the surface of a pathogen that identifies it as a foreign invader to the immune system. Bacteria. Single-celled organism. Has a cell wall, cell membrane, cytoplasm. Lymphocyte. A type of white blood cell that make antibodies to fight off infections. Pathogen. A micro-organism that causes disease. Phagocyte. Phagocytes are the white blood cells that protect the body by ingesting harmful foreign particles, bacteria, and dead or dying cells."}, {"url": "http://www.abpischools.org.uk/page/modules/infectiousdiseases_immunity/immunity2.cfm?coSiteNavigation_allTopic=1", "passage_text": "The white blood cells then produce antibodies to match the shape of the antigens. The antigens on the surface of pathogenic cells are different from those on the surface of your own cells. This enables your immune system to distinguish pathogens from cells that are part of your body. Lymphocyte. A type of white blood cell that make antibodies to fight off infections. Pathogen. A micro-organism that causes disease. Phagocyte. Phagocytes are the white blood cells that protect the body by ingesting harmful foreign particles, bacteria, and dead or dying cells."}, {"url": "http://biology.about.com/od/bloodcells/fl/Macrophages.htm", "passage_text": "Macrophages develop from white blood cells called monocytes. Monocytes are the largest type of white blood cell. They have a large, single nucleus that is often kidney-shaped. Monocytes are produced in bone marrow and circulate in the blood anywhere from one to three days. "}, {"url": "http://www.niams.nih.gov/health_info/Psoriasis/psoriasis_ff.asp", "passage_text": "Psoriasis begins in the immune system, mainly with a type of white blood cell called a T cell. T cells help protect the body against infection and disease. With psoriasis, T cells are put into action by mistake. They become so active that they set off other immune responses. "}, {"url": "http://www.merckvetmanual.com/pethealth/dog_disorders_and_diseases/immune_disorders_of_dogs/immune_system_responses_in_dogs.html", "passage_text": "The immune system then attacks that cell. Some white blood cells (B cells) recognize invaders, or antigens, directly. When a B cell recognizes and attaches to the antigen, it produces antibodies, which coat the surface of the virus or bacteria to stop it from multiplying or infecting other cells. This process is called neutralization. Other white blood cells (T cells) need help from cells that first ingest the invader and break it into fragments. The fragments are then presented to the T cells so that they can recognize and destroy them. These helper cells are called antigen presenting cells."}, {"url": "http://www2.estrellamountain.edu/faculty/farabee/biobk/BioBookIMMUN.html", "passage_text": "Bone marrow contains tissue that produces lymphocytes. B-lymphocytes (B-cells) mature in the bone marrow. T-lymphocytes (T-cells) mature in the thymus gland. Other blood cells such as monocytes and leukocytes are produced in the bone marrow. "}, {"url": "https://en.wikipedia.org/wiki/White_blood_cell", "passage_text": "For the album by the band The White Stripes, see White Blood Cells (album) . White blood cells (WBCs), also called leukocytes or leucocytes, are the cells of the immune system that are involved in protecting the body against both infectious disease and foreign invaders. All leukocytes are produced and derived from a multipotent cell in the bone marrow known as a hematopoietic stem cell. "}, {"url": "http://www.nationalmssociety.org/What-is-MS/Definition-of-MS/T-cells", "passage_text": "Overview. Immune function is helped by two kinds of white blood cells. The “B cells” (so-called because they develop in bone marrow) produce antibodies. The “T cells” (so-called because they develop in a small organ called the thymus gland) are responsible for a variety of other immune responses. These responses include:"}, {"url": "http://www.nobelprize.org/educational/medicine/immunity/immune-detail.html", "passage_text": "The receptors match only one specific antigen. White blood cells called lymphocytes originate in the bone marrow but migrate to parts of the lymphatic system such as the lymph nodes, spleen, and thymus. There are two main types of lymphatic cells, T cells and B cells. Once activated, helper T cells start to divide and to produce proteins that activate B and T cells as well as other immune cells. The killer T cell is specialized in attacking cells of the body infected by viruses and sometimes also by bacteria. It can also attack cancer cells."}, {"url": "https://en.wikipedia.org/wiki/Phagocyte", "passage_text": "This material is then displayed to other cells of the immune system. Some phagocytes then travel to the body's lymph nodes and display the material to white blood cells called lymphocytes. This process is important in building immunity, and many pathogens have evolved methods to evade attacks by phagocytes. "}]