[{"url": "https://labtestsonline.org/understanding/analytes/ferritin/tab/faq", "passage_text": "My iron level is normal, but my ferritin level is low. The development of iron deficiency anemia is a gradual process. If your body is not taking in enough iron, your body first uses the iron that is stored in tissues (i.e., ferritin) and blood levels of ferritin will begin to decrease."}, {"url": "http://www.medicinenet.com/ferritin_blood_test/page3.htm", "passage_text": "Low levels of ferritin are seen in iron deficiency. Without enough iron, the body cannot produce sufficient levels of hemoglobin, a component of red blood cells that allows them to carry oxygen. Iron deficiency anemia is the result. Mild anemia may not produce symptoms at all. More serious cases of anemia can produce symptoms such as: 1  shortness of breath,"}, {"url": "http://www.webmd.com/a-to-z-guides/ferritin?page=2", "passage_text": "Results. A ferritin blood test checks the amount of ferritin in the blood. Ferritin is a protein in the body that binds to iron; most of the iron stored in the body is bound to ferritin. The amount of ferritin found in the blood is the same amount that is in the body"}, {"url": "http://www.urmc.rochester.edu/encyclopedia/content.aspx?ContentTypeID=167&ContentID=ferritin_blood", "passage_text": "Ferritin is a protein that stores iron. Red blood cells need iron to form normally and carry oxygen around your body. Other parts of your body, such as your liver, bone marrow, and muscles, also need iron. Low levels of ferritin lead to iron-deficiency anemia. This means you have too few red blood cells."}, {"url": "http://www.webmd.com/a-to-z-guides/ferritin?page=2", "passage_text": "Low values. Low ferritin levels often mean an iron deficiency is present. This can be caused by long-term (chronic) blood loss from heavy menstrual bleeding, pregnancy, not enough iron in the diet, or bleeding inside the intestinal tract (from ulcers, colon polyps, colon cancer, hemorrhoids, or other conditions). A ferritin blood test checks the amount of ferritin in the blood. Ferritin is a protein in the body that binds to iron; most of the iron stored in the body is bound to ferritin."}, {"url": "http://www.healthline.com/health/ferritin", "passage_text": "A lower-than-normal ferritin level can indicate that you have an iron deficiency, which can happen when you don’t consume enough iron in your daily diet. Another condition that affects iron levels is anemia, which is when you don’t have enough red blood cells for iron to attach to. "}, {"url": "http://www.livestrong.com/article/97353-causes-low-ferritin/", "passage_text": "Spinach contains iron but it is not easily absorbed by the body. Ferritin is a protein that stores extra iron until the body needs it. The amount of ferritin in your blood reflects the amount of iron in your body; low ferritin levels indicate that you have low iron."}, {"url": "http://www.webmd.com/a-to-z-guides/ferritin", "passage_text": "Guide. A ferritin blood test checks the amount of ferritin in the blood. Ferritin is a protein in the body that binds to iron; most of the iron stored in the body is bound to ferritin. Ferritin is found in the liver, spleen, skeletal muscles, and bone marrow. Only a small amount of ferritin is found in the blood. The amount of ferritin in the blood shows how much iron is stored in your body. "}, {"url": "http://newsnetwork.mayoclinic.org/discussion/low-iron-stores-can-lead-to-anemia-not-addresses", "passage_text": "When a person's iron stores are low, as in your case, that condition is known as iron deficiency. If the body uses up all the iron stored in ferritin, then it can't make hemoglobin. A low level of hemoglobin is anemia. When your blood test showed low iron stores, that meant the amount of ferritin in your blood was low. Low ferritin puts you at risk for developing iron deficiency anemia. "}, {"url": "http://www.mayoclinic.org/tests-procedures/ferritin-test/basics/definition/PRC-20014449", "passage_text": "Definition. A ferritin test measures the amount of ferritin in your blood. Ferritin is a blood cell protein that contains iron. A ferritin test helps your doctor understand how much iron your body is storing. If a ferritin test reveals that your blood ferritin level is lower than normal, it indicates your body's iron stores are low and you have iron deficiency. If a ferritin test shows higher than normal levels, it could indicate that you have a condition that causes your body to store too much"}]