[{"url": "http://www.howmuchisit.org/how-much-does-day-care-cost/", "passage_text": "1 The cost of daycare can vary greatly from state to state and city to city. 2  Generally speaking, the busier the area, the more expensive the daycare rates will be. 3  According to babycenter, day care costs can average anywhere between $250 and $1200 per month. 4  The average national monthly cost of child care is $611. 1 According to babycenter, day care costs can average anywhere between $250 and $1200 per month. 2  The average national monthly cost of child care is $611. 3  Larger chains such as Kindercare may cost more than a local daycare center."}, {"url": "http://work.chron.com/much-daycare-workers-paid-7508.html", "passage_text": "The salaries of daycare workers depend on their job title and duties. The largest segment of the daycare industry belonged to the 359,740 child care workers who earned a mean $9.40 per hour or $19,560 per year. This was as of May 2011, according to the Bureau of Labor Statistics. Child Care Workers. The largest segment of the daycare industry belonged to the 359,740 child care workers who earned a mean $9.40 per hour or $19,560 per year. This was as of May 2011, according to the Bureau of Labor Statistics."}, {"url": "http://www.mamapedia.com/article/how-much-should-you-pay-for-an-at-home-child-care", "passage_text": "The price for home daycare really various. I have my own home daycare in Stfd. & I have found that certain towns are higher than others. For a full-time infant or toddler you should expect to pay at least $175 = $225 per week. I have always paid my caretakers from $10-$15/hr depending on experience and how many children I've had. Make sure this woman is infant CPR certified for your childs sake and that her home is babyproofed well. For one child $10, 2 children $12, and 3 children $13-15/per hour. Good luck."}, {"url": "http://www.babycenter.com/0_how-much-youll-spend-on-childcare_1199776.bc", "passage_text": "The average cost of center-based daycare in the United States is $11,666 per year ($972 a month), but prices range from $3,582 to $18,773 a year ($300 to $1,564 monthly), according to the National Association of Child Care Resource & Referral Agencies (NACCRRA). And daycare – whether in a center or in someone's home – could cost double or triple per month in a relatively expensive city compared to a cheaper area. Your best bet is to check with friends and caregivers near you to determine the going rate for the type of childcare you prefer."}, {"url": "http://www.howmuchisit.org/how-much-does-dog-daycare-cost/", "passage_text": "1 Most dog daycares offer half day care, usually 4-5 hours, or full daycare, usually 8-10 hours. 2  Part time daycare will cost between $10-$25 per day, which transfers to a cost of $50-$125 per week and $200-$525 per month. 1 Part time daycare will cost between $10-$25 per day, which transfers to a cost of $50-$125 per week and $200-$525 per month. 2  Full time daycare can cost between $15-$40 per day, transferring to $75-$200 per week and $300-$800 per month. 3  Most daycares, however, give discounts for full time dogs"}, {"url": "http://www.mamapedia.com/article/how-much-should-you-pay-for-an-at-home-child-care", "passage_text": "I run a home daycare in WIlkes Barre and I normally charge $110 per week fulltime (up to 45 hours per week) or $75 per week for part-time (25 hours or less per week). I also give the parents a good deal if they have more than one child 10% off per extra child. I have always paid my caretakers from $10-$15/hr depending on experience and how many children I've had. Make sure this woman is infant CPR certified for your childs sake and that her home is babyproofed well. For one child $10, 2 children $12, and 3 children $13-15/per hour. Good luck."}, {"url": "http://www.babycenter.com/0_how-much-youll-spend-on-childcare_1199776.bc", "passage_text": "Costs for daycare for preschool-age children are generally lower, averaging $8,800 a year ($733 a month). Depending on where you live, you'll pay anywhere from $4,460 to $13,185 a year ($371 to $1,100 a month). And daycare – whether in a center or in someone's home – could cost double or triple per month in a relatively expensive city compared to a cheaper area. Your best bet is to check with friends and caregivers near you to determine the going rate for the type of childcare you prefer."}, {"url": "http://www.ycnanny.com/how_much_does_a_nanny_cost.html", "passage_text": "Assuming full-time day care for a 2 year old child on weekdays, according to Runzheimer International, the U.S. national average cost for full-time day care is $611 a month. Large cities such as San Francisco and New York are much more expensive, with average daycare costs of a little more than $1,000 a month. "}]