[{"url": "http://www.ncbi.nlm.nih.gov/books/NBK21724/", "passage_text": "This type of enzyme, which converts chemical energy into mechanical energy, is called a mechanochemical enzyme or, colloquially, a motor protein. Myosin is the motor, actin filaments are the tracks along which myosin moves, and ATP is the fuel that powers movement. Myosins are motor proteins that interact with actin filaments and couple hydrolysis of ATP to conformational changes that result in the movement of myosin and an actin filament relative to each other. Genomic analysis has revealed 13 different myosins."}, {"url": "https://en.wikibooks.org/wiki/Structural_Biochemistry/Protein_function/Myosin", "passage_text": "Skeletal muscles are responsible for voluntary movement. Skeletal muscles contain many muscle fibers and these muscle fibers are actually made up of myofibrils, bundles of thick myosin filaments and thin actin filaments. Myosins are a large super-family of motor proteins that move along actin filaments, while hydrolyzing ATP to forms of mechanical energy that can be used for a variety of functions such as muscle movement and contraction."}, {"url": "https://en.wikibooks.org/wiki/Structural_Biochemistry/Protein_function/Myosin", "passage_text": "As this overlap occurs, myosin filaments are binding to the actin filaments, allowing myosin to function as the driving motor of filament sliding. This relative movement between myosin and actin is what results in muscle contraction. The molecular basis for muscle action and contraction is explained in the next section. Myosins are a large super-family of motor proteins that move along actin filaments, while hydrolyzing ATP to forms of mechanical energy that can be used for a variety of functions such as muscle movement and contraction."}, {"url": "https://en.wikipedia.org/wiki/Myofibril", "passage_text": "In striated muscle, such as skeletal and cardiac muscle, the actin and myosin filaments each have a specific and constant length on the order of a few micrometers, far less than the length of the elongated muscle cell (a few millimeters in the case of human skeletal muscle cells). These proteins are organized into thick and thin filaments called myofilaments, which repeat along the length of the myofibril in sections called sarcomeres. Muscles contract by sliding the thick (myosin) and thin (actin) filaments along each other."}, {"url": "http://www1.imperial.ac.uk/nhli/molecular/musclebio/introduction/", "passage_text": "Muscle proteins: So far we considered actin and myosin. However muscle is more complex and contains a vast array of structural and other proteins. The actin filaments in skeletal and cardiac muscles contain troponin and tropomyosin to control calcium activation and calcium sensitivity. The sliding of the filaments is the result of interactions between myosin molecules in the thick filaments and binding sites on the actin filaments. The myosin molecules have a region which extends away from the backbone of the filaments and binds to"}, {"url": "http://medcell.med.yale.edu/lectures/muscle.php", "passage_text": "Myosin filaments are assemblies of muscle myosin (a type II myosin). Muscle myosin contains an extremely long coiled coil domain at its C-terminus that allows it to assemble into filaments. Myosin filaments extend from the center (M-line) of the sarcomere toward each Z-disk. All utilize myosin and actin filaments to generate force that leads to cell contraction. In all three muscle types cytosolic calcium triggers, though the underlying mechanism is different between smooth muscle and skeletal/cardiac. In skeletal and cardiac muscle, actin and myosin filaments are organized into sarcomeres that function as the fundamental unit of contraction"}, {"url": "http://study.com/academy/lesson/muscle-contraction-actin-and-myocin-bonding.html", "passage_text": "Troponin is a protein that helps hold tropomyosin in place on the actin filament. For a muscle contraction to occur, troponin and tropomyosin must be moved to reveal the myosin-binding sites. Calcium triggers movement of these proteins. When calcium binds to troponin, the shape of the troponin molecule changes. Actin Molecules and Thin Filaments. Actin is a spherical protein that forms, among other things, the thin filament in muscle cells. Thin filaments are composed of two long chains of these actin molecules that are twisted around one another. Each actin molecule has a myosin-binding site where a myosin head can bind."}, {"url": "https://en.wikipedia.org/wiki/Sarcomere", "passage_text": "Two of the important proteins are myosin, which forms the thick filament, and actin, which forms the thin filament. Myosin has a long, fibrous tail and a globular head, which binds to actin. The myosin head also binds to ATP, which is the source of energy for muscle movement. Myosin can only bind to actin when the binding sites on actin are exposed by calcium ions. Actin molecules are bound to the Z line, which forms the borders of the sarcomere. Other bands appear when the sarcomere is relaxed."}]