[{"url": "https://en.wikipedia.org/wiki/Tympanoplasty", "passage_text": "Tympanoplasty is the surgical operation performed for the reconstruction of the eardrum (tympanic membrane) and/or the small bones of the middle ear (ossicles). Contents. Tympanoplasty can be performed through the ear canal (trascanal approach), through an incision in the ear (endaural approach) or through an incision behind the ear (postauricular approach). A graft may be taken to reconstruct the tympanic membrane."}, {"url": "http://www.dallasear.com/services-tympanoplasty.html", "passage_text": "Tympanoplasty may also be performed when exploration of the middle ear is undertaken. In this procedure, the eardrum is lifted and the middle ear cavity is examined. There may be scarring or a skin cyst within the middle ear cavity that is removed using this approach. Tympanoplasty surgery is either performed completely through the ear canal or through an incision behind the ear. An operating microscope and micro-instrumentation are used for all parts of the surgery."}, {"url": "https://en.wikipedia.org/wiki/Tympanoplasty", "passage_text": "1 Type 1 involves repair of the tympanic membrane alone, when the middle ear is normal. 2  A type 1 tympanoplasty is synonymous to myringoplasty. 3  Type 2 involves repair of the tympanic membrane and middle ear in spite of slight defects in the middle ear ossicles. Tympanoplasty can be performed through the ear canal (trascanal approach), through an incision in the ear (endaural approach) or through an incision behind the ear (postauricular approach). A graft may be taken to reconstruct the tympanic membrane."}, {"url": "http://emedicine.medscape.com/article/2051819-overview", "passage_text": "Background. Tympanoplasty is a surgical technique to repair a defect in the tympanic membrane with the placement of a graft, either medial or lateral to the tympanic membrane annulus. The goal of this surgical procedure is not only to close the perforation but also to improve hearing. Tympanoplasty is a safe and effective outpatient procedure used to both eradicate disease from the middle ear and restore hearing and middle ear function."}, {"url": "https://en.wikipedia.org/wiki/Myringoplasty", "passage_text": "Myringoplasty is the closure of the perforation of pars tensa of the tympanic membrane. When myringoplasty is combined with ossicular reconstruction, it is called tympanoplasty. The operation is performed with the patient supine and face turned to one side. "}, {"url": "http://www.surgeryencyclopedia.com/St-Wr/Tympanoplasty.html", "passage_text": "Tympanoplasty, also called eardrum repair, refers to surgery performed to reconstruct a perforated tympanic membrane (eardrum) or the small bones of the middle ear. Eardrum perforation may result from chronic infection or, less commonly, from trauma to the eardrum. The purpose of tympanoplasty is to repair the perforated eardrum, and sometimes the middle ear bones (ossicles) that consist of the incus, malleus, and stapes. Tympanic membrane grafting may be required. If needed, grafts are usually taken from a vein or fascia (muscle sheath) tissue on the lobe of the ear"}, {"url": "http://medical-dictionary.thefreedictionary.com/tympanoplasty", "passage_text": "tympanoplasty. plastic reconstruction of the bones of the middle ear, with establishment of ossicular continuity from the tympanic membrane to the oval window. This surgical procedure is performed when chronic infection or tumor has led to destruction of the ossicles, of the pars petrosa of the temporal bone, or both. tympanoplasty. 1. Tympanic membrane engraftment, using various materials including canal skin, fascia, and homografts–eg, dura, periosteum, knee cartilage, ossicles and ossicular replacement with hydroxyapatite prostheses."}, {"url": "http://www.earassociates.com/services-tympanoplasty-san-jose-ca.html", "passage_text": "Tympanoplasty. This is a basic surgery performed by ear surgeons to repair a hole in the eardrum. There are several different types of tympanoplasty and the exact one is chosen based on patient age, cause of the hole, location and size of the hole and if previous surgery has been attempted. The ear lobe is frozen, a small amount of fat is removed, the eardrum is irritated and the fat is placed through the hole. This procedure takes about 15 minutes to perform. The earlobe is sutured. Medial Tympanoplasty This is performed in the operating room under local or general anesthesia."}, {"url": "http://www.dallasear.com/services-tympanoplasty.html", "passage_text": "Tympanoplasty. Tympanoplasty is a procedure performed for reconstruction of the eardrum and/or the small bones (ossicles) of the middle ear. Tympanoplasty can be performed entirely through the ear canal or may require an incision behind the ear. Surgery that includes the mastoid bone behind the ear is known as a tympanomastoidectomy. Tympanoplasty surgery is either performed completely through the ear canal or through an incision behind the ear. An operating microscope and micro-instrumentation are used for all parts of the surgery."}]