[{"url": "http://fitness.costhelper.com/weightlifting.html", "passage_text": "1 Cast iron sets are the least expensive, while solid steel discs with chrome handles are more costly and comfortable, though no better for conditioning. 2  The average cost of dumbbell sets, which usually include weight discs, handles and racks, is $85 to $500 for a 50-pound range or less."}, {"url": "http://fitness.costhelper.com/weightlifting.html", "passage_text": "1 The average cost of dumbbell sets, which usually include weight discs, handles and racks, is $85 to $500 for a 50-pound range or less. 2  For lightweight lifters, IronCompany.com sells six vinyl-covered cast iron dumbbells in 3-, 5- and 8-pound sets for $85."}, {"url": "http://fitness.costhelper.com/weightlifting.html", "passage_text": "1 Full barbell sets, including discs, bars and some times the racks, range from $1,400 to $2,000. 2  MegaFitness sells a set of 10 Dura-Bar fixed weights with curled bars ranging from 20 to 110 pounds for $1,630."}, {"url": "http://www.building-muscle101.com/weight-lifting-equipment.html", "passage_text": "The prices range from $29.95 for a 5' standard barbell to $49.95 for a 7' barbell. I would recommend that you use this type of barbell for your home training weight lifting equipment unless you plan on lifting some serious weight. The standard barbell is not as heavy and bulky as the Olympic bars and is more balanced."}, {"url": "http://fitness.costhelper.com/weightlifting.html", "passage_text": "1 The company sells 300-pound set of Cemco weight plates for $529 and a selection of bars for less than. 2  Large racks cost between $300 and $700 at IronCompany.com."}, {"url": "http://www.walmart.com/cp/sports-fitness-equipment/4134", "passage_text": "With exercise and fitness equipment, you can work out in the comfort of your home and reach your fitness goals without having to go to the gym. To maintain a well-rounded fitness regimen, shop for a combination of cardio and resistance-training equipment."}, {"url": "http://www.building-muscle101.com/weight-lifting-equipment.html", "passage_text": "Barbells. Barbells are a type of weight lifting equipment that come in a variety of shapes and sizes. Barbells are usually 4' to 7' long and can weight anywhere from 20 pounds to 45 pounds. Weights are attached to the ends of the bar to provide resistance which both arms are used to lift the weight."}]