[{"url": "https://en.wikipedia.org/wiki/Intersubjectivity", "passage_text": "Intersubjectivity also helps to constitute objectivity: in the experience of the world as available not only to oneself, but also to the Other, there is a bridge between the personal and the shared, the self and the Others. Intersubjectivity is considered crucial not only at the relational level but also at the epistemological and even metaphysical levels. For example, intersubjectivity is postulated as playing a role in establishing the truth of propositions, and constituting the so-called objectivity of objects."}, {"url": "http://sociologyindex.com/intersubjectivity.htm", "passage_text": "Intersubjectivity. Intersubjectivity is shared understanding that helps us relate one situation to another. Sociologists who reject the assumption of the objective nature of social reality and focus on the subjective experience of actors have to avoid the fallacy of reducing the world only to personal experience."}, {"url": "http://www.center4familydevelop.com/Intersubjectivity.pdf", "passage_text": "The intersubjective sharing of experience is a concept that has significant power for understanding relationships, interactions, and treatment (in this article I use the term treatment to refer to psychotherapy and therapeutic parenting). Intersubjectivity is a process that occurs within all relationships at all times. "}, {"url": "http://dictionary.sensagent.com/Intersubjectivity/en-en/", "passage_text": "Intersubjectivity is a key term used in philosophy, psychology, sociology, and anthropology to conceptualize the psychological relation between people. It is usually used in contrast to solipsistic individual experience, emphasizing our inherently social being. 1 First, in its weakest sense intersubjectivity refers to agreement. 2  There is intersubjectivity between people if they agree on a given set of meanings or a definition of the situation. 3  For example, Thomas Scheff defines intersubjectivity as the sharing of subjective states by two or more individuals."}, {"url": "https://en.wikipedia.org/wiki/Intersubjectivity", "passage_text": "Intersubjectivity is a term used in philosophy, psychology, sociology, and anthropology to represent the psychological relation between people. It is usually used in contrast to solipsistic individual experience, emphasizing our inherently social being. Intersubjectivity is considered crucial not only at the relational level but also at the epistemological and even metaphysical levels. For example, intersubjectivity is postulated as playing a role in establishing the truth of propositions, and constituting the so-called objectivity of objects."}, {"url": "http://psychology.wikia.com/wiki/Intersubjectivity", "passage_text": "In philosophy Edit. Intersubjectivity is a major topic in philosophy. The duality of self and other has long been contemplated by philosophers, and what it means to have an intersubjective experience, and what sort of lessons can be drawn from them. The term is used in three ways. 1  Firstly, in its weakest sense it is used to refer to agreement. 2  There is said to be intersubjectivity between people if they agree on a given set of meanings or definition of the situation."}, {"url": "https://en.wikipedia.org/wiki/Intersubjectivity", "passage_text": "In its weakest sense, intersubjectivity refers to agreement. There is intersubjectivity between people if they agree on a given set of meanings or a definition of the situation. Similarly, Thomas Scheff defines intersubjectivity as the sharing of subjective states by two or more individuals.. Intersubjectivity is considered crucial not only at the relational level but also at the epistemological and even metaphysical levels. For example, intersubjectivity is postulated as playing a role in establishing the truth of propositions, and constituting the so-called objectivity of objects."}, {"url": "http://psychology.wikia.com/wiki/Intersubjectivity", "passage_text": "Intersubjectivity is something which is shared by two or more subjects. Intersubjectivity is The sharing of subjective states by two or more individuals.. (Scheff 2006). It refers to shared emotion (attunement), shared attention, and share intention. The term is used in three ways. 1  Firstly, in its weakest sense it is used to refer to agreement. 2  There is said to be intersubjectivity between people if they agree on a given set of meanings or definition of the situation."}, {"url": "http://dictionary.sensagent.com/Intersubjectivity/en-en/", "passage_text": "Intersubjectivity is a major topic in philosophy. The duality of self and other has long been contemplated by philosophers, and what it means to have an intersubjective experience, and what sort of lessons can be drawn from them. 1 First, in its weakest sense intersubjectivity refers to agreement. 2  There is intersubjectivity between people if they agree on a given set of meanings or a definition of the situation. 3  For example, Thomas Scheff defines intersubjectivity as the sharing of subjective states by two or more individuals."}]