[{"url": "http://www.thefreedictionary.com/Corridors", "passage_text": "1. corridor-an enclosed passageway; rooms usually open onto it. gallery-a covered corridor (especially one extending along the wall of a building and supported with arches or columns). hall, hallway-an interior passage or corridor onto which rooms open; the elevators were at the end of the hall. n. 1. (Architecture) a hallway or passage connecting parts of a building. 2. (Physical Geography) a strip of land or airspace along the route of a road or river: the M1 corridor."}, {"url": "http://www.definitions.net/definition/corridor", "passage_text": "Corridor. The Corridor is a Via Rail passenger train service area in the Canadian provinces of Quebec and Ontario. Corridor is used by Via to refer to all Via inter-city passenger trains which start and end within the geographic region known as the Quebec City-Windsor Corridor."}, {"url": "http://www.oregon.gov/ODOT/TS/docs/Roadway/What_is_a_Safety_Corridor.pdf", "passage_text": "Designation as a safety corridor comes as a result of a request from a Legislator, a neighborhood group, and organization, family or individual. This is followed by an in-depth look at crash statistics to determine if the problem being reported is an isolated incident or a longstanding pattern. These may be signed as Safety Corridors or Truck Safety Corridors. In the case of Truck Safety Corridors, the incidence of commercial vehicle involvement is high, due to either truck or other vehicle error."}, {"url": "http://www.tmr.qld.gov.au/~/media/communityandenvironment/Development%20assessments/Road%20Corridor%20Permit/Road_corridor_permit_information_sheet.pdf", "passage_text": "• Where damage is caused to the road corridor and is not rectified by the applicant on request, the. department may rectify the damage and seek reimbursement of the costs. Permit holders must not. interfere with existing drainage, signage, road markers or anything else within the road system. "}, {"url": "http://www.gjcity.org/24RoadCorridorDesignStandardsAndGuidelines.aspx", "passage_text": "24 Road Corridor Design Standards and Guidelines City of Grand Junction Page 47 Guidelines 1. Buildings should be designed to meet site and context design objectives, such asproviding edges or enclosure to streets and open space, creating linkages andgateways, as well as framing or terminating views.2. Section 1: INTRODUCTION Background and Intent The 24 Road Corridor Design Standards and Guidelines (“Standards and Guidelines”)are intended to provide guidance and criteria for the planning, design and implementationof public and private improvements in the 24 Road Corridor."}, {"url": "http://www.gjcity.org/24RoadCorridorDesignStandardsAndGuidelines.aspx", "passage_text": "24 Road Corridor Design Standards and Guidelines City of Grand Junction Page 41 Section 4: LANDSCAPE DEVELOPMENT Introduction Landscape improvements are of primary importance to the establishment of the designcharacter of the 24 Road Corridor. Section 1: INTRODUCTION Background and Intent The 24 Road Corridor Design Standards and Guidelines (“Standards and Guidelines”)are intended to provide guidance and criteria for the planning, design and implementationof public and private improvements in"}, {"url": "http://www.thefreedictionary.com/corridor", "passage_text": "corridor. n. 1. (Architecture) a hallway or passage connecting parts of a building. 2. (Physical Geography) a strip of land or airspace along the route of a road or river: the M1 corridor."}, {"url": "http://www.gjcity.org/24RoadCorridorDesignStandardsAndGuidelines.aspx", "passage_text": "24 Road Corridor Design Standards and Guidelines City of Grand Junction Page 38 Pedestrian and Bicycle Circulation Purpose The purpose of the Pedestrian and Bicycle Circulation Standards and Guidelines is topromote free and safe movement of pedestrians and bicyclists through the 24 RoadCorridor. Section 1: INTRODUCTION Background and Intent The 24 Road Corridor Design Standards and Guidelines (“Standards and Guidelines”)are intended to provide guidance and criteria for the planning, design and implementationof public and private improvements in the 24 Road Corridor."}, {"url": "https://en.wikipedia.org/wiki/Wildlife_corridor", "passage_text": "From Wikipedia, the free encyclopedia. A wildlife corridor, habitat corridor, or green corridor is an area of habitat connecting wildlife populations separated by human activities or structures (such as roads, development, or logging). For example, many cases of birds and butterflies successfully using corridors have been observed. Less successful stories have come out of mammals such as deer. How effective a corridor is may simply rely on what species it is directed towards (Tewskbury 2002)."}, {"url": "http://www.thefreedictionary.com/corridor", "passage_text": "1. corridor-an enclosed passageway; rooms usually open onto it. gallery-a covered corridor (especially one extending along the wall of a building and supported with arches or columns). hall, hallway-an interior passage or corridor onto which rooms open; the elevators were at the end of the hall. 1. (Architecture) a hallway or passage connecting parts of a building. 2. (Physical Geography) a strip of land or airspace along the route of a road or river: the M1 corridor."}]