[{"url": "http://davisac.com/blog/what-should-your-thermostat-be-set-at-in-summer-and-winter", "passage_text": "Setting your thermostat during the summer. Generally, our bodies are most comfortable when the air inside of our home is within a degree of two of a steady 75 degrees F during the hot, summer months. This temperature setting, however, is only necessary when your house is occupied during waking hours. When you’re awake and at home during the colder months of the year, your furnace will keep you comfortably warm at about 68 degrees. Just as during the summer, you can save money on your heating bills by lowering your thermostat a few degrees at eight-hour intervals – either while you’re at work or are asleep."}, {"url": "http://alifeofproductivity.com/temperature-productivity/", "passage_text": "1 70-72ºF (21-22ºC) is the temperature range that will make you the most productive. 2  Any temperature above 73º decreases your productivity. 3  At 86º and above, your productivity drops to about 90% of what it was before, a 10% decrease. 4  Any temperature below 68º also decreases your productivity. Here’s what the research shows: 1 "}, {"url": "http://www.answers.com/Q/What_should_the_thermostat_temperature_be_in_the_winter_and_summer", "passage_text": "On average, the summer temperature in London is 68 degrees  Fahrenheit (20 degrees Celsius) and in winter the temperature is 32  degrees Fahrenheit (0 degrees Celsius). By turning your thermostat back 10 to 15 degrees F for eight hours, you can save about 5 to 15 percent a year on your heating bill-a savings of as much as 1 percent for each degree if the setback period is eight hours long."}, {"url": "http://wcrz.com/at-what-temperature-do-you-set-your-thermostat-in-summer-survey/", "passage_text": "Where you set your thermostat can have a significant impact on your wallet. Experts say you can save up to three percent on your energy bill for each degree above 72 you set your thermostat. That’s a savings of 18% if you can dial up from 72 to 78 degrees. Raise the thermostat to 85 degrees when no one is home"}, {"url": "http://energy.gov/energysaver/articles/what-temperature-do-you-set-your-thermostat-summer", "passage_text": "Addthis. You can save 5%–15% on your cooling bills by raising the temperature setting on your thermostat when you are away and don't need cooling. Only lower the setting to 78°F when you are home and need cooling. A programmable thermostat can make it easy to adjust the temperature on a regular schedule. "}, {"url": "http://wcrz.com/at-what-temperature-do-you-set-your-thermostat-in-summer-survey/", "passage_text": "So where do you set your thermostat in summer months? We’ve learned to live with 78 degrees, because it takes the edge off, and still presents quite a contrast when the outside temperature is above 90 degrees. Experts say you can save up to three percent on your energy bill for each degree above 72 you set your thermostat. That’s a savings of 18% if you can dial up from 72 to 78 degrees."}, {"url": "http://www.dailymail.co.uk/news/article-2547754/Its-cold-outside-hotter-summer-homes-Average-thermostat-set-toasty-23C-cranking-bills.html", "passage_text": "It's cold outside, but hotter than summer in our homes: Average thermostat is set at a toasty 23C and is cranking up bills. 1  One in 20 people has the thermostat turned up to 30C (86F). 2  18 per cent of those polled said they leave their heating on day and night. 3  Repair firm warns hothousing is hitting our pockets severely. It is still coat and scarf weather outside but indoors we are enjoying the height of summer. Research shows that the average household thermostat is set at 23C (73F) – a degree or two warmer than a typical summer’s day in the south of England. Some 36 per cent of people keep the gas dial at 25C (77F) and one in 20 has it turned right up to 30C (86F). How turning up the thermostat raises your gas bill"}, {"url": "http://phoenix.about.com/od/weather/tp/Inside-Home-Temperatures.htm", "passage_text": "A few years ago I opened up a discussion, inviting locals to share the temperature at which they keep their home in the summer. I asked for the average temperature in Phoenix area house on a summer day when it is 100+ degrees outside, and you are at home. "}, {"url": "http://www.bounceenergy.com/blog/2013/07/home-temperature-air-conditioner-summer/", "passage_text": "An 80°F day with 90% humidity has a “heat index” of 86°F. When everyone is home, secretly set your thermostat to 81°F for few hours. See how your family reacts. Over the next few days for the same period of time, drop the temperature 2°F until you reach 71°F. Chances are that your family will be generally comfortable between 73°F and 79°F when they are active"}]