[{"url": "http://www.livestrong.com/article/302683-ketones-and-weight-loss/", "passage_text": "Ketones are a substance the body produces as a byproduct of fat metabolism, according to the Joslin Diabetes Center. When you are trying to lose weight, your body will use glucose buildup in your fat stores in order to obtain energy from your food, resulting in weight loss. In addition to being produced while weight loss occurs, ketones also are a sign of diabetes. This is because ketones also are present when the body is not able to use insulin to break down sugars in your body. This occurrence can be dangerous to your health because the ketones can spill into the urine"}, {"url": "http://www.joslin.org/info/ketone_testing_what_you_need_to_know.html", "passage_text": "There are situations when you might have ketones without the blood glucose being too high. Positive ketones are not a problem when blood glucose levels are within range and you are trying to lose weight. It is a problem if blood glucose levels are high and left untreated. You can test to see if your body is making any ketones by doing a simple urine test. There are several products available for ketone testing and they can be purchased, without a prescription, at your pharmacy. The test result can be negative, or show small, moderate, or large quantities of ketones."}, {"url": "http://www.joslin.org/info/ketone_testing_what_you_need_to_know.html", "passage_text": "Ketones are produced when the body burns fat for energy or fuel. They are also produced when you lose weight or if there is not enough insulin to help your body use sugar for energy. Without enough insulin, glucose builds up in the blood. Since the body is unable to use glucose for energy, it breaks down fat instead. When this occurs, ketones form in the blood and spill into the urine. These ketones can make you very sick. You can test to see if your body is making any ketones by doing a simple urine test. There are several products available for ketone testing and they can be purchased, without a prescription, at your pharmacy. The test result can be negative, or show small, moderate, or large quantities of ketones."}, {"url": "http://www.huffingtonpost.com/becky-hand/raspberry-ketones_b_2727943.html", "passage_text": "When you hear raspberry ketone claims such as slicing up fat molecules, burning fat easier, or weight-loss miracle, change the channel. There is no evidence to back up these claims. There has been no testing to determine safety or dosage amounts. Read the fine print. Before you jump on the raspberry ketone bandwagon, there are a few things you should know about this over-priced, proclaimed weight-loss miracle in a bottle."}, {"url": "http://www.webmd.com/diet/raspberry-ketones-uses-risks", "passage_text": "Maybe you've heard the claim that raspberry ketone supplements can melt away fat and prevent weight gain -- even if your diet is high in fat. Without scientific evidence, no one can say what dosage of raspberry ketone supplements, if any, might be safe to take. Talk to your doctor about any supplements you're thinking about taking, and any concerns you have about your weight or weight loss."}, {"url": "http://www.livestrong.com/article/302683-ketones-and-weight-loss/", "passage_text": "When you lose weight, your body gives off substances known as ketones. These ketones can be secreted in the urine and serve as an indicator you are losing weight -- in addition to the decreasing numbers on the scale. However, ketones' presence also can indicate a more harmful condition. In addition to being produced while weight loss occurs, ketones also are a sign of diabetes. This is because ketones also are present when the body is not able to use insulin to break down sugars in your body. This occurrence can be dangerous to your health because the ketones can spill into the urine"}, {"url": "http://www.diabetesselfmanagement.com/managing-diabetes/blood-glucose-management/getting-to-know-ketones/", "passage_text": "For most people, the ketones that form as a normal product of fat burning and weight loss are nothing to be concerned about because they are simply burned for energy by the body, and any excess are passed out of the body in the urine. If you are losing weight, you may have a small amount of ketones in your urine. This is OK for people with Type 2 diabetes, as long as their blood glucose level is in a normal range, but people with Type 1 diabetes should check with their doctor."}, {"url": "http://www.diabetesselfmanagement.com/managing-diabetes/blood-glucose-management/getting-to-know-ketones/", "passage_text": "Ketones are only by-products of the metabolism of fat and are markers that show that you are burning fat. They have no active role in burning fat or weight loss. In fact, ketone levels in people who are on low-carbohydrate diets are just barely above baseline, indicating they have no role in producing weight loss. If you are losing weight, you may have a small amount of ketones in your urine. This is OK for people with Type 2 diabetes, as long as their blood glucose level is in a normal range, but people with Type 1 diabetes should check with their doctor."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-1262-RASPBERRY%20KETONE.aspx?activeIngredientId=1262&activeIngredientName=RASPBERRY%20KETONE", "passage_text": "Raspberry ketone is a chemical from red raspberries that is thought to help for weight loss. Some research in animals or in test tubes shows that it might increase some measures of metabolism. It might also affect a hormone in the body called adiponectin. It is most commonly used for weight loss and obesity. It is also used to increase lean body mass. Some people apply raspberry ketone to the scalp to improve hair growth. Raspberry ketone is also used in foods, cosmetics, and other manufacturing as a fragrance or flavoring agent."}]