[{"url": "http://www.babycentre.co.uk/a6155/your-age-and-fertility", "passage_text": "The decline in male fertility is more gradual for men than women. The decline in male fertility can affect the health of the children they may go on to have (Utting and Bewley 2011) . The chart below shows your chances of getting pregnant according to your age. The chart is only a guide. It shows average figures for women in the best of health (Khatamee and Rosenthal 2002) . Most women will be able to conceive naturally and give birth to a healthy baby if they get pregnant at 35 years old. After 35 years, the proportion of women who experience infertility, miscarriage or a problem with their baby increases."}, {"url": "http://yourfertility.org.au/for-women/age/", "passage_text": "1 Starting at about age 32, a woman’s chances of conceiving decrease gradually but significantly. 2  From age 35, the fertility decline speeds up. 3  By age 40, fertility has fallen by half. 4  At 30, the chance of conceiving per cycle is about 20%. 5  At 40 it’s around 5%. Chances of getting pregnant without IVF. 1  Starting at about age 32, a woman’s chances of conceiving decrease gradually but significantly. 2  From age 35, the fertility decline speeds up. 3  By age 40, fertility has fallen by half. 4  At 30, the chance of conceiving per cycle is about 20%."}, {"url": "http://www.babyhopes.com/articles/best-age-to-get-pregnant.html", "passage_text": "Getting Pregnant during a Woman’s 20s. The optimum age for fertility for women begins at the age of 18 but according to Parenting.com, a woman is at her most fertile during her early 20s and there is the lowest risk of miscarriage (9.5% between ages 20 and 24 and 10% between ages 25 and 29). Fertility starts to drop at age 30 and seriously declines after age 38. The chances of having a miscarriage between ages 30 and 34 rises to 11.7 percent and after turning 35 a woman has an 18 percent risk of miscarrying."}, {"url": "http://www.babyhopes.com/articles/best-age-to-get-pregnant.html", "passage_text": "Conceiving during a Woman’s 30s. Fertility starts to drop at age 30 and seriously declines after age 38. The chances of having a miscarriage between ages 30 and 34 rises to 11.7 percent and after turning 35 a woman has an 18 percent risk of miscarrying."}, {"url": "http://yourfertility.org.au/for-women/age/", "passage_text": "The truth: Age is the most important factor affecting a woman’s chance to conceive and have a healthy child. As women age their fertility declines. A woman’s fertility starts to decline in her early 30s, with the decline speeding up after 35. At 40 a woman only has a 5% chance of becoming pregnant in any month. This is because a woman is born with all the eggs she is going to have in her lifetime. Chances of getting pregnant without IVF. 1  Starting at about age 32, a woman’s chances of conceiving decrease gradually but significantly. 2  From age 35, the fertility decline speeds up. 3  By age 40, fertility has fallen by half. 4  At 30, the chance of conceiving per cycle is about 20%."}, {"url": "http://www.babycentre.co.uk/a6155/your-age-and-fertility", "passage_text": "Fertility starts to decline for women from about the age of 30, dropping down more steeply from the age of 35 (CKS 2007, NCCWCH 2013:65) . As women grow older the likelihood of getting pregnant falls while the likelihood of infertility rises. Most women will be able to conceive naturally and give birth to a healthy baby if they get pregnant at 35 years old. After 35 years, the proportion of women who experience infertility, miscarriage or a problem with their baby increases."}, {"url": "http://www.gallup.com/poll/165770/americans-ideal-age-women-first-child.aspx", "passage_text": "1 Blacks' and Hispanics' views on women's ideal age skew younger than whites'. 2  Majorities of U.S. whites, blacks, and Hispanics believe the ideal time for a woman to have her first child is by age 25. 3  However, the proportion saying so is greater among blacks (67%) and Hispanics (68%) than among whites (56%). "}, {"url": "http://www.parenting.com/article/pregnancy-at-20-30-40", "passage_text": "Risks to your baby. The miscarriage rate is 10 percent, only slightly higher than for women five years younger. At age 25, your chances of delivering a baby with Down syndrome are 1 in 1,250, and there's a 1 in 476 chance of having a baby with any chromosomal abnormality. The chance of chromosomal abnormalities increases sharply. At age 45, there's a 1 in 30 chance of delivering an infant with Down syndrome and a 1 in 21 chance of having a baby with any chromosomal abnormality. In a 49-year-old those risks rise to 1 in 11 and 1 in 8, respectively."}]