[{"url": "http://forums.imore.com/ipad/279682-why-does-my-ipad-take-so-long-charge.html", "passage_text": "My iPad mini first gen takes about 8 hours to charge, but I can get about 15 hours of use out of it. You'll sacrifice charge time for battery life (Usually). Sent from my iPad using iMore Forums I have an iPad mini first gen and it takes about 3.5 hours to charge. I'm using the 12 W charger."}, {"url": "http://nerdr.com/tag/ipad-mini-retina-how-long-to-charge/", "passage_text": "Total ipad mini retina battery charge time is 3 hours and 15 minutes. There are three important points I think are worth discussing here. The total time taken, the 80% charge drop and the double 97%. The total time to charge the iPad mini of 3 hours 15 minutes is faster than the time it takes to charge an ipad 3."}, {"url": "http://store.apple.com/us/question/answers/product/HE110ZM/A/how-long-does-it-take-to-fully-charge-the-mophie/QDH7AXUAU4F4Y7TUA", "passage_text": "This will differ depending on the charger you use. Since the device has a 12 Ah battery if you charge it with a 1 Amp charger it will take 12 hours to charge. Similarly if you charge it with a 2.1 Amp charger it will take just under 6 hours to charge. This is assuming a 100% charging efficiency."}, {"url": "https://discussions.apple.com/docs/DOC-3511", "passage_text": "If it takes your iPad charger 5 hours to charge up your iPad with the iPhone charger it will take 10 hours to charge it because it is about 1/2 the watts and amps."}, {"url": "http://ipadpilotnews.com/2014/01/charging-your-ipad-tips-air-mini/", "passage_text": "It will take around 4-6 hours to charge a completely drained iPad battery, depending on the model. A couple notes here: 1  You can still charge an iPad with a 1 amp USB power adapter, but it will take longer than 5 hours to fully charge. 2  The iPad’s 2 amp charger is still safe to use with your other USB devices (iPhone, iPod, etc.) and will not damage them."}, {"url": "http://ipadpilotnews.com/2014/01/charging-your-ipad-tips-air-mini/", "passage_text": "1 You can still charge an iPad with a 1 amp USB power adapter, but it will take longer than 5 hours to fully charge. 2  The iPad’s 2 amp charger is still safe to use with your other USB devices (iPhone, iPod, etc.) and will not damage them. 3  You can’t overcharge them."}, {"url": "http://www.apple.com/shop/question/answers/readonly/how-long-does-it-take-to-charge-your-ipad-from-empty/QDFXHYJ27XCK999C9", "passage_text": "Depends on the iPad. Our office has four of them and they all take a different amount of time to charge. We have one that charges in 4.5 hours but the others take 6, 6.5, and 8. 1  Answered by Debi T from Ogden."}]