[{"url": "https://support.vonage.com/app/answers/detail/a_id/843/~/vonage-residential-fax-line", "passage_text": "Vonage Residential Fax Line. You can use any fax-capable machine to send and receive faxes on a dedicated Vonage Fax Line. To add a fax line to your Vonage account, you must maintain at least one Vonage voice line for making and receiving calls. 1 Sign in to your Vonage Online Account. 2  Go to the Summary tab and select Order Add-Ons. 3  Click Add a Fax Line. 4  Choose an adapter and an available port and click Next. 5  Choose a plan for your fax line and click Next. 6  Select a state, area code and city for the telephone number and click Next"}, {"url": "https://support.vonage.com/app/answers/detail/a_id/10292/~/troubleshoot-fax-line---quick-steps", "passage_text": "Most issues with your Fax Line can be resolved by checking your setup and optimizing your settings. 1  Ensure the phone cord is connected directly from the Vonage adapter to your fax machine (do not use a splitter or wall outlet). 1 If your fax machine has ports marked Data and Phone, connect the Vonage adapter to the port marked Data. 2  To optimize your fax settings for Vonage, refer to your fax machine’s user guide to make these adjustments: 3  Turn off Error Correction Mode (ECM). 4  Adjust Fax Speed to the lowest setting."}, {"url": "https://support.vonage.com/app/answers/detail/a_id/10292/~/troubleshoot-fax-line---quick-steps", "passage_text": "1 If your fax machine has ports marked Line and Ext, connect the Vonage adapter to the port marked Line. 2  If your fax machine has ports marked Data and Phone, connect the Vonage adapter to the port marked Data. 1 If your fax machine has ports marked Data and Phone, connect the Vonage adapter to the port marked Data. 2  To optimize your fax settings for Vonage, refer to your fax machine’s user guide to make these adjustments: 3  Turn off Error Correction Mode (ECM). 4  Adjust Fax Speed to the lowest setting."}, {"url": "http://www.vonage.com/personal/features/fax-lines", "passage_text": "Yes, you can send and receive occasional faxes on your Vonage voice line. Simply connect your phone line to your fax machine. However, voice lines are not optimized for fax service so, for frequent faxing, a dedicated fax line is highly recommended."}, {"url": "https://support.vonage.com/app/answers/detail/a_id/10292/~/troubleshoot-fax-line---quick-steps", "passage_text": "1 Ensure the phone cord is connected directly from the Vonage adapter to your fax machine (do not use a splitter or wall outlet). 2  Make certain the correct phone port on the fax machine is connected to the Vonage adapter. 3  If your fax machine has ports marked Line and Ext, connect the Vonage adapter to the port marked Line. 1 If your fax machine has ports marked Data and Phone, connect the Vonage adapter to the port marked Data. 2  To optimize your fax settings for Vonage, refer to your fax machine’s user guide to make these adjustments: 3  Turn off Error Correction Mode (ECM). 4  Adjust Fax Speed to the lowest setting."}, {"url": "http://www.vonage.com/personal/features/fax-lines", "passage_text": "Add a dedicated VoIP fax line to your Vonage service and free up your home phone. Simply connect your phone line to your fax machine. However, voice lines are not optimized for fax service so, for frequent faxing, a dedicated fax line is highly recommended."}, {"url": "http://yourbusiness.azcentral.com/use-fax-machine-regular-vonage-line-11581.html", "passage_text": "Step 1. Disconnect the phone line currently connected to your telephone. Leave the other end of the line connected to your Vonage adapter. Step 2. Connect the phone line that you just unplugged into the fax machine port marked with the word “Line” or a telephone icon. Step 3. Press the “Power” button on the fax machine to turn it on. Place the documents you want to fax in the machine's feeder. Step 4. Enter the phone number to which you want to fax the documents, and then press the “Send” key to use your Vonage line to initiate the fax. Step 5. Wait for the fax to complete"}, {"url": "https://support.vonage.com/app/answers/detail/a_id/843/~/vonage-residential-fax-line", "passage_text": "Add a Fax Line. 1  Sign in to your Vonage Online Account. 2  Go to the Summary tab and select Order Add-Ons. 3  Click Add a Fax Line. 4  Choose an adapter and an available port and click Next. 5  Choose a plan for your fax line and click Next. 6  Select a state, area code and city for the telephone number and click Next. 1 Sign in to your Vonage Online Account. 2  Go to the Summary tab and select Order Add-Ons. 3  Click Add a Fax Line. 4  Choose an adapter and an available port and click Next. 5  Choose a plan for your fax line and click Next."}]