[{"url": "https://en.wikipedia.org/wiki/Electrical_conduit", "passage_text": "Electrical conduit and bus duct in a building at Texaco Nanticoke refinery in Nanticoke, Ontario, 1980s. An electrical conduit is a tube used to protect and route electrical wiring in a building or nonbuilding structure. Electrical conduit may be made of metal, plastic, fiber, or fired clay. Most conduit is rigid, but flexible conduit is used for some purposes. Conduit is generally installed by electricians at the site of installation of electrical equipment."}, {"url": "http://www.homedepot.com/c/best_conduit_choices_from_plastic_pvc_to_metallic_HT_BG_EL", "passage_text": "Prewired conduit, or armored cable, offers an all-in-one solution with the wires already run through the flexible conduit. Generally made of PVC, rigid nonmetallic conduit is a good choice for outdoor residential applications, such as wiring landscape lighting or burying cables. PVC doesn’t rust and the pieces are glued together with PVC cement making connections watertight. To learn more about conduit fittings, see our Fittings Buying Guide. Flexible metallic conduit bends and twists easily, allowing turns at corners without the use of separate elbow joints. It is often used where rigid conduit is difficult to install or to connect permanently wired appliances, such as a water heater."}, {"url": "http://www.homedepot.com/c/best_conduit_choices_from_plastic_pvc_to_metallic_HT_BG_EL", "passage_text": "Rigid metallic conduit is most often used in commercial applications, but it can be a smart choice for straight runs of wire or cable through an attic, garage, basement or crawlspace, as it protects against nicks, punctures or cuts to wiring, including nicks made by animals that may chew on exposed wiring. To learn more about conduit fittings, see our Fittings Buying Guide. Flexible metallic conduit bends and twists easily, allowing turns at corners without the use of separate elbow joints. It is often used where rigid conduit is difficult to install or to connect permanently wired appliances, such as a water heater."}, {"url": "http://construction.about.com/od/Materials/a/Common-Types-Of-Electrical-Conduit.htm", "passage_text": "Conduits: Electrical Metallic Tubing (EMT). Another example of rigid electrical conduit is the EMT, also known as Electrical Metallic Tubing. An EMT conduit is made of steel; in some cases aluminum is also used, cheaper than a galvanized rigid conduit and lighter than a GR conduit. Conduits: Aluminum Conduits. An aluminum conduit is a rigid conduit commonly used in commercial and industrial applications. Aluminum conduits are used to prevent corrosion and are the preferred conduit used in areas where large amounts of water and corrosion-prone areas."}, {"url": "http://www.homedepot.com/c/best_conduit_choices_from_plastic_pvc_to_metallic_HT_BG_EL", "passage_text": "Conduit comes in both rigid and flexible forms and is made from a variety of materials for use in different applications. In homes, conduit is most often used for protecting outdoor or exposed wires or cables, such as those in an unfinished basement or garage. To learn more about conduit fittings, see our Fittings Buying Guide. Flexible metallic conduit bends and twists easily, allowing turns at corners without the use of separate elbow joints. It is often used where rigid conduit is difficult to install or to connect permanently wired appliances, such as a water heater."}, {"url": "http://construction.about.com/od/Materials/a/Common-Types-Of-Electrical-Conduit.htm", "passage_text": "A conduit made form galvanized steel tubing is commonly referred as a rigid conduit. The thickness of a galvanized rigid conduit protects the electrical wiring from being hit and allows it to be threaded. Galvanized rigid conduits are used by electricians in commercial and industrial applications. Conduits: Aluminum Conduits. An aluminum conduit is a rigid conduit commonly used in commercial and industrial applications. Aluminum conduits are used to prevent corrosion and are the preferred conduit used in areas where large amounts of water and corrosion-prone areas."}, {"url": "https://en.wikipedia.org/wiki/Electrical_conduit", "passage_text": "Rigid metal conduit (RMC) is a thick-walled threaded tubing, usually made of coated steel, stainless steel or aluminum. Galvanized rigid conduit (GRC) is galvanized steel tubing, with a tubing wall that is thick enough to allow it to be threaded. Its common applications are in commercial and industrial construction. Most conduit is rigid, but flexible conduit is used for some purposes. Conduit is generally installed by electricians at the site of installation of electrical equipment."}, {"url": "http://ecmweb.com/content/basics-steel-conduit", "passage_text": "Three basic types of steel conduit are in use today: rigid metal conduit, intermediate metal conduit, and electrical metallic tubing. Let's take a closer look at the features of each type. Rigid metal conduit — RMC (ferrous metal) . RMC is a listed threaded metal raceway of circular cross section with a coupling, which can be either a standard straight tapped conduit coupling or the integral type (Photo 1)."}, {"url": "http://ecmweb.com/content/basics-steel-conduit", "passage_text": "In addition to standard RMC, IMC, and EMT, PVC-coated steel conduit (PVC) is also available in one of three types. Couplings are supplied separately. Primary PVC coating over bare steel, which is a listed rigid conduit for environmentally suitable locations. A PVC coating over listed galvanized steel conduit. Let's take a closer look at the features of each type. Rigid metal conduit — RMC (ferrous metal) . RMC is a listed threaded metal raceway of circular cross section with a coupling, which can be either a standard straight tapped conduit coupling or the integral type (Photo 1)."}]