[{"url": "https://www.nationwidebarcode.com/are-upc-a-and-ean-13-the-same/", "passage_text": "Before you buy a barcode, we have written this tutorial to help you understand the differences between UPC Barcodes and EAN Barcodes. Below are both an EAN barcode and a UPC Barcode. The EAN contains a 13 digit number and the UPC contains a 12 digit number. EAN = 0012345678905. UPC = (0)012345678905 or 012345678905. The GS1, the original source for barcodes has created the confusion between UPC (Universal Product Codes) and EAN (European Article Numbers also called International Article Numbers). "}, {"url": "http://www.gs1.org/barcodes/ean-upc", "passage_text": "EAN/UPC barcodes. Instantly-recognisable, EAN/UPC barcodes are printed on virtually every consumer product in the world. They are the longest-established and most widely-used of all GS1 barcodes. The EAN/UPC barcode family has transformed the world of retail"}, {"url": "https://en.wikipedia.org/wiki/International_Article_Number_%28EAN%29", "passage_text": "The weight for a specific position in the EAN code is either 3 or 1, which alternate so that the final data digit has a weight of 3 (and thus the check digit has a weight of 1); the same algorithm is used in other GTINs and the Serial Shipping Container Code (SSCC). 1 The GS1 Prefix, the first three digits, usually identifying the national GS1 Member Organization to which the manufacturer is registered (not necessarily where the product is actually made). 2  When the EAN-13 symbol encodes a conversion of an ISBN, the GS1 Prefix will be either 978 or 979."}, {"url": "http://www.ean-search.org/", "passage_text": "Search for EAN, UPC, ISBN or product names. Examples: 5099750442227, iPad XML API for applications or mass queries available. EAN, or EAN13, stands for European Article Number. It is an extension of the UPC codes and you'll find them as barcodes on most everyday products. Sometimes the barcode is also called GTIN or GTIN13 (Global Trade Identifier). The EAN includes the country of origin, the manufacturer and a product number. In addition to that it includes a checksum"}, {"url": "https://en.wikipedia.org/wiki/Universal_Product_Code", "passage_text": "The Universal Product Code (UPC) is a barcode symbology (i.e., a specific type of barcode) that is widely used in the United States, Canada, the United Kingdom, Australia, New Zealand, and in other countries for tracking trade items in stores. Along with the related EAN barcode, the UPC is the barcode mainly used for scanning of trade items at the point of sale, per GS1 specifications. UPC data structures are a component of GTINs (Global Trade Item Numbers)."}, {"url": "http://www.adams1.com/upccode.html", "passage_text": "UPC version A is the basic version of UPC and is usually the version seen on grocery store items. The symbology is used to encode the 10 digit Universal Product Code. An eleventh digit indicates the type of product, and a twelfth digit is a modulo check digit. The first digit is a product type code. This is followed by 10 information carrying digits. The twelfth digit is a modulo check sum, and this is followed by a variable number of digits. There is a good explanation of the UPC Shipping Container Symbol (SCS) at the Infinity Graphics site."}, {"url": "http://www.posright.com/new/What_EAN13_barcode", "passage_text": "EAN is the abbreviation of European Article Numbering. EAN-13 is a relatively common general terminal product barcode protocols and standards, mainly used in supermarkets and other retail. The left one number call prefix, in the EAN-13 commodity barcode the prefix is said by barcode character, and the prfix is not included in the data symbols in the left."}, {"url": "https://en.wikipedia.org/wiki/International_Article_Number_%28EAN%29", "passage_text": "The less commonly used EAN-8 barcodes are used also for marking retail goods; however, they are usually reserved for smaller items, for example confectionery. 2-digit (EAN 2) and 5-digit (EAN 5) supplemental barcodes may be added for a total of 14 or 17 data digits. 1 The GS1 Prefix, the first three digits, usually identifying the national GS1 Member Organization to which the manufacturer is registered (not necessarily where the product is actually made). 2  When the EAN-13 symbol encodes a conversion of an ISBN, the GS1 Prefix will be either 978 or 979."}]