[{"url": "http://www.cytochemistry.net/cell-biology/cilia.htm", "passage_text": "Cilia and flagella are organized from centrioles that move to the cell periphery. These are called basal bodies and are shown in this electron micrograph (bb). Note the numerous cilia projecting from the cell membrane (cm). Basal bodies control the direction of movement of the cilia. This can be shown experimentally. Centrioles control the direction of cilia or flagella movement. Paramecium have parallel rows of cilia all aligned so that they will beat in the same direction."}, {"url": "http://learn.genetics.utah.edu/content/cells/vesicles/", "passage_text": "A vesicle forms when the membrane bulges out and pinches off. It travels to its destination then merges with another membrane to release its cargo. In this way proteins and other large molecules are transported without ever having to cross a membrane. Some vesicles form with the help of coat proteins. Geometrically arranged coat proteins on the surface of the membrane help the vesicle to bud off."}, {"url": "https://en.wikipedia.org/wiki/Dynein", "passage_text": "Dynein is a motor protein (also called molecular motor or motor molecule) in cells which converts the chemical energy contained in ATP into the mechanical energy of movement. Dyneins can be divided into two groups: cytoplasmic dyneins and axonemal dyneins, which are also called ciliary or flagellar dyneins. 1  axonemal. 2  heavy chain: DNAH1, DNAH2, DNAH3, DNAH5, DNAH6, DNAH7, DNAH8, DNAH9, DNAH10, DNAH11, DNAH12, DNAH13, DNAH14, DNAH17. 3  intermediate chain: DNAI1, DNAI2"}, {"url": "https://en.wikipedia.org/wiki/Kinesin", "passage_text": "Most kinesins walk towards the positive end of a microtubule, which, in most cells, entails transporting cargo such as protein and membrane components from the centre of the cell towards the periphery. This form of transport is known as anterograde transport. Thus they transport cargo from the periphery of the cell towards the centre, for example from the terminal boutons of a neuronal axon to the cell body (soma). This is known as retrograde transport. Cin8, a member of the Kinesin-5 family, has the novel ability to switch directionality."}, {"url": "https://en.wikipedia.org/wiki/Dynein", "passage_text": "Dynein transports various cellular cargo by walking along cytoskeletal microtubules towards the minus-end of the microtubule, which is usually oriented towards the cell center. Thus, they are called minus-end directed motors.. This form of transport is known as retrograde transport. Dyneins can be divided into two groups: cytoplasmic dyneins and axonemal dyneins, which are also called ciliary or flagellar dyneins. 1  axonemal. 2  heavy chain: DNAH1, DNAH2, DNAH3, DNAH5, DNAH6, DNAH7, DNAH8, DNAH9, DNAH10, DNAH11, DNAH12, DNAH13, DNAH14, DNAH17. 3  intermediate chain: DNAI1, DNAI2"}, {"url": "https://en.wikipedia.org/wiki/Kinesin", "passage_text": "A kinesin is a protein belonging to a class of motor proteins found in eukaryotic cells. Kinesins move along microtubule (MT) filaments, and are powered by the hydrolysis of adenosine triphosphate (ATP) (thus kinesins are ATPases). Thus they transport cargo from the periphery of the cell towards the centre, for example from the terminal boutons of a neuronal axon to the cell body (soma). This is known as retrograde transport. Cin8, a member of the Kinesin-5 family, has the novel ability to switch directionality."}, {"url": "https://en.wikipedia.org/wiki/Kinesin", "passage_text": "A different type of motor protein known as dyneins, move towards the minus end of the microtubule. Thus they transport cargo from the periphery of the cell towards the centre, for example from the terminal boutons of a neuronal axon to the cell body (soma). This is known as retrograde transport. Cin8, a member of the Kinesin-5 family, has the novel ability to switch directionality."}, {"url": "http://www.cytochemistry.net/cell-biology/cilia.htm", "passage_text": "They are motile and designed either to move the cell itself or to move substances over or around the cell. The primary purpose of cilia in mammalian cells is to move fluid, mucous, or cells over their surface. Cilia and flagella have the same internal structure. The major difference is in their length. Cilia and flagella move because of the interactions of a set of microtubules inside. Note the numerous cilia projecting from the cell membrane (cm). Basal bodies control the direction of movement of the cilia. This can be shown experimentally. Centrioles control the direction of cilia or flagella movement. Paramecium have parallel rows of cilia all aligned so that they will beat in the same direction."}, {"url": "https://en.wikipedia.org/wiki/Kinesin", "passage_text": "Motor proteins travel in a specific direction along a microtubule. This is because the microtubule is polar and the heads only bind to the microtubule in one orientation, while ATP binding gives each step its direction through a process known as neck linker zippering. Thus they transport cargo from the periphery of the cell towards the centre, for example from the terminal boutons of a neuronal axon to the cell body (soma). This is known as retrograde transport. Cin8, a member of the Kinesin-5 family, has the novel ability to switch directionality."}]