[{"url": "http://electronics.howstuffworks.com/gadgets/high-tech-gadgets/nightvision2.htm", "passage_text": "Thermal Imaging. Here's how thermal imaging works: 1  A special lens focuses the infrared light emitted by all of the objects in view. 2  The focused light is scanned by a phased array of infrared-detector elements. 3  The detector elements create a very detailed temperature pattern called a thermogram."}, {"url": "http://www.cnet.com/news/heat-seaker-thermal-imaging-camera-for-the-masses/#!", "passage_text": "tumblr. Seek Thermal's $199 camera can help find energy leaks, or spot a person hiding in the bushes. Seek Thermal. If you want to try to find a water leak behind a wall, a person hidden in the bushes at night, or identify passengers with a fever passing through a checkpoint, thermal imaging is the technology for you."}, {"url": "http://whatis.techtarget.com/definition/thermal-imaging", "passage_text": "Part of the Electronics glossary: Thermal imaging is a method of improving visibility of objects in a dark environment by detecting the objects' infrared radiation and creating an image based on that information. Thermal imaging, near-infrared illumination, low-light imaging and are the three most commonly used night vision technologies."}, {"url": "http://whatis.techtarget.com/definition/thermal-imaging", "passage_text": "A thermal imager (also known as a thermal camera) is essentially a heat sensor that is capable of detecting tiny differences in temperature. The device collects the infrared radiation from objects in the scene and creates an electronic image based on information about the temperature differences."}, {"url": "http://www.axis.com/us/en/products/thermal-cameras", "passage_text": "A thermal camera is less sensitive to problems with light conditions, such as shadows, backlight, darkness and even camouflaged objects; and delivers images that allow operators to detect and act on suspicious activity – 24 hours a day, seven days a week."}, {"url": "http://www.slideshare.net/carltrom/what-is-a-thermal-imaging-camera", "passage_text": "1 4. What It Is Made Of The thermal imaging camera is constructed using certain heat and water-resistant materials. 2  These make it withstand rugged conditions and even fire hazards. 3  The camera comprises of an optical system, a detector, an amplifier and a signal processing device. 4  Completing it, is a wide display as well."}, {"url": "http://whatis.techtarget.com/definition/thermal-imaging", "passage_text": "Here's a brief explanation of how thermal imaging works: All objects emit infrared energy (heat) as a function of their temperature. The infrared energy emitted by an object is known as its heat signature. In general, the hotter an object is, the more radiation it emits."}]