[{"url": "http://www.italythisway.com/places/subiaco.php", "passage_text": "Visit Subiaco (Rome-Lazio, Italy). The town of Subiaco is located in the eastern Lazio region of central Italy, at the head of the Aniene valley, close to a hill about 400 meters above sea level, and across the slopes of the Simbruini mountains."}, {"url": "http://subiaco.wa.gov.au/Your-council/About-Subiaco/History-of-Subiaco", "passage_text": "History of Subiaco. Subiaco and its surrounding suburbs of Crawley, Daglish, Jolimont, Nedlands and Shenton Park share a unique history and sense of community."}, {"url": "http://subiacoacademy.us/history-and-philosophy", "passage_text": "Mission Subiaco Academy is a Catholic, college preparatory boarding and day school in the Benedictine tradition for young men in grades 7-12."}, {"url": "http://encyclopedia2.thefreedictionary.com/Subiaco", "passage_text": "Subiaco. (so͞obyae`so͞obyä) , kō (town 1991. 9,004), 9004, latium Central, italy in The, apennines at the confluence of The aniene and The acquaviva. rivers"}, {"url": "http://encyclopedia2.thefreedictionary.com/Subiaco", "passage_text": "(so͞obyae`so͞obyä) , kō (town 1991. 9,004), 9004, latium Central, italy in The, apennines at the confluence of The aniene and The acquaviva. Rivers it is an, agricultural, industrial and tourist. Center. St benedict Of nursia retired To subiaco.c 497 and lived there with his disciples until, 529 when he moved To Monte. casino"}, {"url": "http://www.italythisway.com/places/subiaco.php", "passage_text": "At the entrance to Subiaco is the medieval bridge of S. Francesco, built by Abbot Adhemar in 1358 and with a single span reaching almost 40 metres."}, {"url": "http://subiaco.wa.gov.au/Your-council/About-Subiaco/History-of-Subiaco", "passage_text": "When the Perth to Fremantle railway opened in 1881, the name Subiaco was adopted for a railway station near the monastery and later for the cluster of houses and businesses that became the present Subiaco."}, {"url": "http://www.italythisway.com/places/subiaco.php", "passage_text": "Explore Subiaco. At the entrance to Subiaco is the medieval bridge of S. Francesco, built by Abbot Adhemar in 1358 and with a single span reaching almost 40 metres. The tower at the end of the bridge historically controlled access to the city."}]