[{"url": "https://en.wikipedia.org/wiki/Tizer", "passage_text": "In 2004, Tizer aired a campaign depicting a red chameleon remaining the same colour despite a number of different coloured backgrounds-the campaign's slogan was No, we're not changing colour.. The television adverts ended with Ed the Head appearing from the bottle and saying Tizer, it's a red thing. 'Tizer Ice' was launched in the late 1990s. The drink included menthol, giving it the sensation of tasting cold, even at room temperature. Later branded Ice by Tizer, the product did not sell well and was removed from sale."}, {"url": "http://www.agbarr.co.uk/our-brands/tizer/", "passage_text": "Brand facts. Tizer's name originally comes from the phrase 'Tizer the Appetizer'. It was launched in 1924 by Fred and Tom Pickup of Manchester when it was known as 'Pickup's Appetizer'. "}, {"url": "https://en.wikipedia.org/wiki/Tizer", "passage_text": "In 2003, Tizer decided to sell other-flavoured versions of Tizer, such as Purple and Green versions. There was also a brief fruitz variation of Tizer in 2004. From 1996 to 2007, Tizer was stylised as T!zer. In 2007 they stopped using Ed the Head mascot. 'Tizer Ice' was launched in the late 1990s. The drink included menthol, giving it the sensation of tasting cold, even at room temperature. Later branded Ice by Tizer, the product did not sell well and was removed from sale."}, {"url": "http://www.youtube.com/watch?v=IxRsg1ncmSs", "passage_text": "Tizer. From Wikipedia, the free encyclopedia. http://en.wikipedia.org/wiki/Tizer. Tizer is a red-coloured soft drink sold in the United Kingdom. The name originally comes from the phrase 'Tizer the Appetizer'. It was launched in 1924 by Fred Pickup of Manchester when it was known as 'Pickup's Appetizer'. Please try again later. Welcome to Thirsty Thursdays, this is a new series where I taste test and review drinks that you ask me to, so leave a suggestion about a drink you love or a drink you know exists but can't get it in your area."}, {"url": "http://forums.digitalspy.co.uk/showthread.php?p=7868778", "passage_text": "Your descriptions aren't like any Tizer, Irn Bru or Dr Pepper drinks I've ever had... Tizer and Dr Pepper are quality, Irn Bru is icky though. Quote: Originally Posted by Eye2006. Tizer is Cherryade.It is a cherry flavoured syrup mixed in with carbonated water and given the name of Tizer. Irn bru is rich in iron and caffeine.It is also cherryade but it branded according to Company. Posts: 15,040. Irn Bru is okay, Dr. Pepper is great and Tizer is fantastic! I also used to like Cream Soda, but I can't seem to find any of these (except Dr. Pepper) in a diet version-especially the Cream Soda, which is really annoying!"}, {"url": "https://en.wikipedia.org/wiki/Irn-Bru", "passage_text": "Irn-Bru's advertising slogans used to be 'Scotland's other National Drink', referring to whisky, and 'Made in Scotland from girders ', a reference to the rusty colour of the drink; though the closest one can come to substantiating this claim is the 0.002% ammonium ferric citrate listed in the ingredients. Irn-Bru is also sold in reusable 750 ml glass bottles which, like other Barr's drinks, may be returned to the manufacturer in exchange for the 30 pence deposit paid. This scheme is widely available in shops across Scotland."}, {"url": "https://en.wikipedia.org/wiki/Tizer", "passage_text": "Tizer is a red-coloured soft drink sold in the United Kingdom. The name originally comes from the phrase 'Tizer the Appetizer'. It was launched in 1924 by Fred and Tom Pickup of Manchester when it was known as 'Pickup's Appetizer'. 'Tizer Ice' was launched in the late 1990s. The drink included menthol, giving it the sensation of tasting cold, even at room temperature. Later branded Ice by Tizer, the product did not sell well and was removed from sale."}, {"url": "http://www.dizzyfrinks.com/tizer/", "passage_text": "Johnny. Tizer from the early 2000’s and was ended in 2006 was a beautiful unique tasting drink. Me and my pals were so excited as they started bringing out different colour versions of the drink, including purple which tasted incredible. Tizer was a dominant force in the pop/soda world. But then they changed it to the tizer we have nowadays. It now tastes disgusting and leaves a horrible feeling in your throat. I’m 18, I’ve still got along time ahead of me to see the old tizer maybe return one day. It was my favourite pop of all time."}, {"url": "http://www.dizzyfrinks.com/tizer/", "passage_text": "You have rated this. About the Drink. Tizer is a red fizzy drink made by Barr (the makers of Irn Bru) from Scotland. The drink was first made in 1924 by Fred Pickup of Manchester when it was known as ‘Pickup’s Appetizer’ and was eventually sold to Irn Bru in 1972 for £2.5 million. But then they changed it to the tizer we have nowadays. It now tastes disgusting and leaves a horrible feeling in your throat. I’m 18, I’ve still got along time ahead of me to see the old tizer maybe return one day. It was my favourite pop of all time."}]