[{"url": "http://www.slrphotographyguide.com/camera/nikon-digital-slr/focus-modes.shtml", "passage_text": "Learning when to use AF-C, AF-S and AF-A focus modes. 1  Set the focus mode to AF-C, then photograph a moving object. 2  Now set the camera's focus mode to AF-S and photograph a stationary object. 3  For the third exercise, change the focus mode to AF-A and photograph both a moving and stationary subject. This is also the default camera focus mode, unless you change the setting to AF-C or AF-S. MF is the manual focus mode. It's unclear why this focus mode is included, because nowadays there is usually an option to switch between auto and manual focus on the side of the actual lens."}, {"url": "http://photo.stackexchange.com/questions/14432/what-do-the-af-a-af-c-and-af-s-autofocus-settings-mean", "passage_text": "This link explains it well. Paraphrasing the article: 1  AF-C (AF-continuous or servo mode) is used for photographing moving subjects. 2  AF-S means single shot and is used for subject that is stationary. AF-A is where the camera decides whether the subject is moving or not and tries to alternate between the servo and single shot mode accordingly. add a comment |. up vote 5 down vote. There is another important difference between AF-S and AF-C. With AF-S, you cannot take a shot without focus being locked (green light being on). With AF-C you will take a shot anytime the shutter release is pressed."}, {"url": "http://cameras.about.com/od/Advanced-Camera-Modes/a/understanding_autofocus_modes.htm", "passage_text": "AI Focus / AF-A. This mode combines both the above-mentioned autofocus modes. In AI Focus (Canon) or AF-A (Nikon), the camera remains in Single Shot mode unless the subject moves, in which case it automatically switches to Continuous mode. The camera will emit a soft beep once the subject is focused. "}, {"url": "http://www.slrphotographyguide.com/camera/nikon-digital-slr/focus-modes.shtml", "passage_text": "AF-A is where the camera selects and goes between the last two modes. If it thinks the subject you are photographing is stationary, then it will automatically use AF-S focus mode. If it picks up that the subject you're photographing is a moving subject, then it will automatically use AF-C focus mode. This is also the default camera focus mode, unless you change the setting to AF-C or AF-S. MF is the manual focus mode. It's unclear why this focus mode is included, because nowadays there is usually an option to switch between auto and manual focus on the side of the actual lens."}, {"url": "http://imaging.nikon.com/lineup/dslr/basics/16/03.htm", "passage_text": "In continuous-servo AF (AF-C), the camera will continue to focus if the shutter-release button is kept pressed halfway after the camera focuses. Because the camera continues to focus up to the moment the shutter-release button is pressed all the way down, this mode is a good choice for subjects that are in motion. AF-C: No Focus Lock. If you change the composition after focusing in AF-C mode, the camera will refocus on the object that is now in the focus point, making it impossible to lock focus using the shutter-release button."}, {"url": "http://photo.stackexchange.com/questions/15665/what-are-the-af-a-af-c-and-af-s-autofocus-modes-and-how-and-when-should-i-use", "passage_text": "AF-S is AF 'single'- your camera will focus on a fixed object when you press the AF button and will remain focused on that point for as long as you hold the button down. This is best for static subjects. AF-C is AF 'continuous' - the camera will focus on whatever is in the relevant AF points (depending on how you have your AF coverage set up) and will attempt to keep the subject in focus wherever it moves, whether that's towards/away from the camera or laterally. AF-A is AF 'auto' and automatically switches between the two AF modes depending on what the subject is doing. This requires less effort on the part of the photographer, but you are relying on the camera guessing correctly what you are focussing on, and may result in unexpected focus."}, {"url": "http://www.slrphotographyguide.com/camera/nikon-digital-slr/focus-modes.shtml", "passage_text": "What is the difference between AF-A, AF-S, AF-C and MF focus modes on Nikon camera's. When you set your camera lens to AF (auto focus), digital SLR cameras offer the photographer a choice between interchangeable modes. Auto focus modes can vary between different digital camera brands. This is also the default camera focus mode, unless you change the setting to AF-C or AF-S. MF is the manual focus mode. It's unclear why this focus mode is included, because nowadays there is usually an option to switch between auto and manual focus on the side of the actual lens."}, {"url": "http://www.pentaxforums.com/forums/6-pentax-dslr-discussion/82990-pentax-k-x-focus-confirmation-af-s-af-c-not-af.html", "passage_text": "AF-C is continuous, when you focus on an object, holding it (half-)pressed, it will continue to try to keep whatever is in the focus areas in focus, whether you move or the subject moves, or you move the focus area to another subject. AF-S is single, when you focus on one object and hold it (half-)pressed, it will keep the focus where it locked. This includes any movement of you/camera, and the movement of the subject. This is used for recomposing (once you lock focus, you can rotate the camera and the object will stay in focus)."}, {"url": "http://photo.stackexchange.com/questions/14432/what-do-the-af-a-af-c-and-af-s-autofocus-settings-mean", "passage_text": "up vote 16 down vote accepted. AF-C (AF-continuous or servo mode) is used for photographing moving subjects. AF-S means single shot and is used for subject that is stationary. AF-A is where the camera decides whether the subject is moving or not and tries to alternate between the servo and single shot mode accordingly. add a comment |. up vote 5 down vote. There is another important difference between AF-S and AF-C. With AF-S, you cannot take a shot without focus being locked (green light being on). With AF-C you will take a shot anytime the shutter release is pressed."}]