[{"url": "https://en.wikipedia.org/wiki/Oil_shale_geology", "passage_text": "Most oil shale deposits were formed during Middle Cambrian, Early and Middle Ordovician, Late Devonian, Late Jurassic, and Paleogene times through burial by sedimentary loading on top of the algal swamp deposits, resulting in conversion of the organic matter to kerogen by diagenetic processes. Large lake oil shale basins are typically found in areas of block faulting or crustal warping due to mountain building. Deposits such as the Green River may be as much as 2,000 feet (610 m) and yield up to 40 gallons of oil for each ton (166 l/t) of shale."}, {"url": "http://www.answers.com/Q/The_thickest_sedimentary_deposits_are_found", "passage_text": "The crust is foundunder the continents the crust is between 32 and 70 km thick the crust is made up of loose rocks and soil under the rocks and soil the crust is solid rock we … live on the crust. 4 people found this useful. Answered. In Sedimentary Rock. "}, {"url": "https://en.wikipedia.org/wiki/Sedimentary_exhalative_deposits", "passage_text": "From Wikipedia, the free encyclopedia. Sedimentary exhalative deposits (SedEx deposits) are ore deposits which are interpreted to have been formed by release of ore-bearing hydrothermal fluids into a water reservoir (usually the ocean), resulting in the precipitation of stratiform ore. Metals such as lead and copper and zinc are found in a trace amount in all sediments. These metals are bound weakly to the hydrous clay minerals on the edges of the crystals and are held by weak bonds with hydroxyl groups."}, {"url": "http://core.ecu.edu/geology/woods/SEASEDS.htm", "passage_text": "These particles accumulate on the ocean floor and may eventualy be consolidated to form the soft sedimentary rock called chalk. B. The thickest accumulations of sediments in the world are in the oceans. All but 8% of the world's sediment is in the ocean in piles up to 9 km thick. The thickest accumulation are on the continental slopes and rises. E. Besides their origin, sediments also differ as to texture (Texture-the size, shape and sorting of grains in the sediment), color, and composition. We will also talk about these aspects of marine sediments and finish up with a discussion of the distribution of sediments in the sea. II."}, {"url": "http://ostseis.anl.gov/guide/oilshale/", "passage_text": "Location of the Green River Formation Oil Shale and Its Main Basins. While oil shale is found in many places worldwide, by far the largest deposits in the world are found in the United States in the Green River Formation, which covers portions of Colorado, Utah, and Wyoming. More than 70% of the total oil shale acreage in the Green River Formation, including the richest and thickest oil shale deposits, is under federally owned and managed lands."}, {"url": "https://quizlet.com/10288882/geology-chapter-6-flash-cards/", "passage_text": "The thickest sequences of sedimentary rocks are typically found in _. a. the oceans, beside the mid-ocean ridges b. the interior of the largest continents c. sedimentary basins, broad depressions that catch sediment d. mountain belts, broad areas where rock and sediment are uplifted. c. sedimentary basins. "}, {"url": "http://www.answers.com/Q/Where_are_the_thickest_sedimentary_deposits_found_at", "passage_text": "The crust is foundunder the continents the crust is between 32 and 70 km thick the crust is made up of loose rocks and soil under the rocks and soil the crust is solid rock we … live on the crust. 4 people found this useful. Answered. "}, {"url": "http://people.ku.edu/~stalder/KS-loess.html", "passage_text": "Some of the finest and thickest soils in the world are formed in the upper part of thick deposits of loess. As wind moves the small particles only, a soil that develops is free from boulder and pebbles. Loess deposits are built up by successive dust storms (not unlike the dust storms of the 1930's). Silt and Siltstone. Silt is a common sedimentary rock composed of tiny particles smaller that sand size yet larger than clay size (1/16 - 1/256 mm). It is found in stream deposits, lake beds and most commonly, in Kansas, as loess."}, {"url": "http://ostseis.anl.gov/guide/oilshale/", "passage_text": "Oil shale. The term oil shale generally refers to any sedimentary rock that contains solid bituminous materials (called kerogen) that are released as petroleum-like liquids when the rock is heated in the chemical process of pyrolysis. More than 70% of the total oil shale acreage in the Green River Formation, including the richest and thickest oil shale deposits, is under federally owned and managed lands."}]