[{"url": "http://www.emedicinehealth.com/cyanide_poisoning/article_em.htm", "passage_text": "1 Photography, chemical research, synthetic plastics, metal processing, and electroplating industries use cyanide. 2  Plants containing cyanide include apricot pits and a type of potato called cassava. 3  Fortunately, only chronic or massive ingestion of any of these plants or pits can lead to serious cyanide poisoning. 1 One of the side effects of laetrile is cyanide poisoning. 2  The FDA has not approved laetrile as a cancer treatment in the United States. 3  The drug is also made and used as a cancer treatment in Mexico under the name laetrile/amygdalin.. 4  Certain chemicals, after ingestion, can be converted by the body into cyanide."}, {"url": "https://en.wikipedia.org/wiki/Cyanide", "passage_text": "In inorganic cyanides, such as sodium cyanide, NaCN, this group is present as the negatively charged polyatomic cyanide ion (CN −); these compounds, which are regarded as salts of hydrocyanic acid, are highly toxic. The cyanide ion is isoelectronic with carbon monoxide and with molecular nitrogen. Most cyanides are highly toxic. Organic cyanides are usually called nitriles; in these, the CN group is linked by a covalent bond to a carbon-containing group, such as methyl (CH 3) in methyl cyanide (acetonitrile)."}, {"url": "http://www.emedicinehealth.com/cyanide_poisoning/page2_em.htm", "passage_text": "Patient Comments Read 2 Comments Share Your Story. Cyanide poisoning can be difficult to detect. The effects of cyanide ingestion are very similar to the effects of suffocation; because cyanide stops the cells of the body from being able to use oxygen, which all cells need to survive. The symptoms of cyanide poisoning are similar to those experienced when hiking or climbing at high altitudes. 1  General weakness, confusion, bizarre behavior, excessive sleepiness, coma, shortness of breath, headache, dizziness, and seizures can all present with cyanide poisoning. 1 General weakness, confusion, bizarre behavior, excessive sleepiness, coma, shortness of breath, headache, dizziness, and seizures can all present with cyanide poisoning. 2  Typically, an acute ingestion will have a dramatic, rapid onset, immediately affecting the heart and causing sudden collapse."}, {"url": "http://emedicine.medscape.com/article/814287-overview", "passage_text": "Background. Cyanide toxicity is generally considered to be a rare form of poisoning. However, cyanide exposure occurs relatively frequently in patients with smoke inhalation from residential or industrial fires. "}, {"url": "https://en.wikipedia.org/wiki/Cyanide_poisoning", "passage_text": "Cyanide poisoning occurs when a living organism is exposed to a compound that produces cyanide ions (CN −) when dissolved in water. Common poisonous cyanide compounds include hydrogen cyanide gas and the crystalline solids potassium cyanide and sodium cyanide. If cyanide is inhaled it causes a coma with seizures, apnea, and cardiac arrest, with death following in a matter of seconds. At lower doses, loss of consciousness may be preceded by general weakness, giddiness, headaches, vertigo, confusion, and perceived difficulty in breathing."}, {"url": "https://en.wikipedia.org/wiki/Cyanide_poisoning", "passage_text": "Cyanide poisoning is a form of histotoxic hypoxia because the cells of an organism are unable to use oxygen, primarily through the inhibition of cytochrome c oxidase. If cyanide is inhaled it causes a coma with seizures, apnea, and cardiac arrest, with death following in a matter of seconds. At lower doses, loss of consciousness may be preceded by general weakness, giddiness, headaches, vertigo, confusion, and perceived difficulty in breathing."}, {"url": "http://www.emedicinehealth.com/cyanide_poisoning/article_em.htm", "passage_text": "Common sources of cyanide poisoning include: 1  Fires: Smoke inhalation during the burning of common substances such as rubber, plastic, and silk can create cyanide fumes. 2  Photography, chemical research, synthetic plastics, metal processing, and electroplating industries use cyanide. 1 One of the side effects of laetrile is cyanide poisoning. 2  The FDA has not approved laetrile as a cancer treatment in the United States. 3  The drug is also made and used as a cancer treatment in Mexico under the name laetrile/amygdalin.. 4  Certain chemicals, after ingestion, can be converted by the body into cyanide."}, {"url": "http://chemsee.com/poison-detection/poison-detection-resources/cyanide-poisoning/", "passage_text": "The main symptoms of acute poisoning by cyanides are due to the interference of cyanide in the assimilation and distribution of oxygen in the body. Whether the cyanide source is HCN or ingestion of food containing a water soluble cyanide such as potassium or sodium salt, the poisoning mechanism is the same. The cyanide ions react irreversibly with the iron, in particular with the iron in the cytochrome c oxidase and hemoglobin."}, {"url": "http://medical-dictionary.thefreedictionary.com/cyanide+poisoning", "passage_text": "cyanide poisoning poisoning by cyanide or one of its compounds; most cyanide compounds are deadly poisons. Characteristics include nausea without vomiting, dizziness, convulsions, opisthotonos, and death from respiratory paralysis. Treatment varies according to the nature of the poison. cyanide poisoning. Poisoning caused by any of several cyanide-containing compounds, very potent blockers of cellular oxygenation. They inhibit respiration by blocking oxidative phosphorylation at the cellular level."}, {"url": "http://medical-dictionary.thefreedictionary.com/cyanide+poisoning", "passage_text": "poisoning resulting from the ingestion or inhalation of cyanide from such substances as bitter almond oil, wild cherry syrup, prussic acid, hydrocyanic acid, or potassium or sodium cyanide. Characterized by tachycardia, drowsiness, seizures, headache, apnea, and cardiac arrest, it may cause death within 1 to 15 minutes. cyanide poisoning. Poisoning caused by any of several cyanide-containing compounds, very potent blockers of cellular oxygenation. They inhibit respiration by blocking oxidative phosphorylation at the cellular level."}]