[{"url": "http://bbq.about.com/od/smokers/ss/barbecue-Smokers.htm", "passage_text": "Box smokers (also known as vault smokers, cabinet smokers, block smokers) are basically a box with a heat source in the bottom and cooking chamber on the top. Because the heat source is directly below, like in a vertical water smoker, the heat is conserved. The Brinkmann, for instance, retails for around $85USD. At the top range of the vertical water, smokers is the Weber Smokey Mountain Cooker (referred to online as the WSM). Available in two sizes, 18.5 inch for around $350USD and the largest of the vertical water smokers, the 22.5 inch which sells around $500USD."}, {"url": "http://www.smoking-meat.com/wood-smoker", "passage_text": "The Best Alternative – A Wood Smoker. A wood smoker is and will forever be the best way to smoke food. There is a bit of a learning curve if you are used to using a charcoal, gas or electric smoker but the results are worth the time and effort you put into learning this fine art. "}, {"url": "http://medical-dictionary.thefreedictionary.com/Smoking", "passage_text": "Smoking is the inhalation of the smoke of burning tobacco encased in cigarettes, pipes, and cigars. Casual smoking is the act of smoking only occasionally, usually in a social situation or to relieve stress. A smoking habit is a physical addiction to tobacco products. Many health experts now regard habitual smoking as a psychological addiction, too, and one with serious health consequences. In pipe and cigar smoking, however, there is some danger to the heart because of the nicotine that is absorbed by the mouth. There is also the possibility of cancer of the lips, tongue, and mouth. Statistically, there is no question that nonsmokers are far less subject to the diseases that affect smokers."}, {"url": "http://bbq.about.com/od/smokers/f/f062804c.htm", "passage_text": "Regardless of the fuel the job of a smoker and the person who tends it is to maintain a stable smoking temperature some where around 225 degrees F. Their must also be smoke. The traditional smokers burn wood to create both heat and smoke and cook your food. Electric smokers need to have wood added to a heated chamber to produce smoke. Technically any piece of cooking equipment that can hold a low temperature for several hours and create smoke is a smoker. A smoker is a piece of cooking equipment for making barbecue. Now there are lots of different kinds of smoker from small electric units to large smoker rigs big enough to feed an army, literally. Smokers are powered by a wide variety of fuels from electricity, propane or natural gas, wood, charcoal, and pellets."}, {"url": "http://onepiece.wikia.com/wiki/Smoker", "passage_text": "Appearance Edit. Smoker is a muscular white-haired (light blue-green in the pre-timeskip anime) man, with a distinct trait of always being seen smoking two cigars at once. He wears a large thick white and blue specialist marine jacket which he keeps open, with greenish fur lining the neck, wrists and hem. Smoker the White Hunter is a Marine officer stationed at the G-5 base. He was first introduced as a captain (大佐, Taisa) in Loguetown, where he made it his mission to capture Luffy, and was later promoted to the rank of commodore (准将, Junshō) , due to the events in Alabasta."}, {"url": "http://bbq.about.com/od/smokers/ss/barbecue-Smokers.htm", "passage_text": "A vertical offset smoker (commonly called an offset) is a two part smoker. The main cooking chamber is typically a long grated, metal barrel or box with a long lift door and a smokestack. Attached to one end of the cooking chamber is the firebox which has a top or side access door and an adjustable vent. The Brinkmann, for instance, retails for around $85USD. At the top range of the vertical water, smokers is the Weber Smokey Mountain Cooker (referred to online as the WSM). Available in two sizes, 18.5 inch for around $350USD and the largest of the vertical water smokers, the 22.5 inch which sells around $500USD."}, {"url": "http://smoking.ygoy.com/what-is-smoking/", "passage_text": "Smoking refers to the inhalation and exhalation of fumes from burning tobacco in cigars, cigarettes and pipes. Historically, smoking as a practice, was followed by natives of the Western Hemisphere, in religious rituals and for medicinal purposes. It has a history starting from the late 1500s. "}, {"url": "https://en.wikipedia.org/wiki/Bee_smoker", "passage_text": "A bee smoker (usually called simply a smoker) is a device used in beekeeping to calm honey bees. It is designed to generate smoke from the smouldering of various fuels, hence the name. A bee smoker with protective wire grid. Smokers have been used in beekeeping for millennia, beginning perhaps with just a smouldering stick or a simple pan for burning. Beekeepers also used various bellows as originally employed by smiths or other workers."}, {"url": "http://bbq.about.com/od/smokers/ss/barbecue-Smokers.htm", "passage_text": "Typically gas or electric, this type of box smoker is nothing more than a burner or heating element inside a metal box that you can put meat in with wood chips held over the heat to smolder. A little breeze or a light rain and these smokers lose heat. The Brinkmann, for instance, retails for around $85USD. At the top range of the vertical water, smokers is the Weber Smokey Mountain Cooker (referred to online as the WSM). Available in two sizes, 18.5 inch for around $350USD and the largest of the vertical water smokers, the 22.5 inch which sells around $500USD."}, {"url": "http://bbq.about.com/od/smokers/f/f062804c.htm", "passage_text": "Answer: A smoker is an apparatus for cooking at low temperatures in a controlled, smoky environment for the smoking of food. A smoker is a piece of cooking equipment for making barbecue. Now there are lots of different kinds of smoker from small electric units to large smoker rigs big enough to feed an army, literally. Smokers are powered by a wide variety of fuels from electricity, propane or natural gas, wood, charcoal, and pellets."}]