[{"url": "http://www.babycenter.com/0_baby-milestone-rolling-over_6504.bc", "passage_text": "What to do if your baby doesn't roll over. If your baby hasn't figured out how to flip one way or the other by the time he's about 6 months old, and hasn't moved on to sit and try to scoot and crawl instead, bring it up the next time you talk to his doctor. When do babies roll over? Your baby may be able to kick himself over, from his tummy to his back, as early as age 4 months. It may take him until he's about 5 or 6 months to flip from back to front, though, because he needs stronger neck and arm muscles for that maneuver."}, {"url": "https://ph.answers.yahoo.com/question/index?qid=20080203205514AA1i1JA", "passage_text": "My daughter will be 20 months on the 11th and she is not following directions too much but I can see that she is understanding a little, but just recently. I ask her something, like bring me the book, then i get her, the book, and put it down. I make a big deal when i get what I asked for. "}, {"url": "http://www.babycenter.com/0_developmental-milestones-understanding-words-behavior-and-co_6575.bc", "passage_text": "By the time she's 7 months old, she'll respond to her own name, and by 8 to 12 months she'll understand simple directives such as No or Don't touch.. Around 24 months, she'll be able to talk to you in two-or three-word phrases. By 18 months, your baby should be able to understand and use some words. (In general he'll understand a word before he's able to say it himself.) And he'll be able to follow your directions, even if they involve two separate actions – for example, Pick up those building blocks and put them in the toy chest.."}, {"url": "http://www.cdc.gov/ncbddd/hearingloss/facts.html", "passage_text": "All babies should have a hearing screening no later than 1 month of age. Most babies have their hearing screened while still in the hospital. If a baby does not pass a hearing screening, it's very important to get a full hearing test as soon as possible, but no later than 3 months of age. Even if a child has passed a hearing screening before, it is important to look out for the following signs. 1  Does not startle at loud noises. 2  Does not turn to the source of a sound after 6 months of age. 3  Does not say single words, such as “dada” or “mama” by 1 year of age."}, {"url": "http://www.aoa.org/patients-and-public/good-vision-throughout-life/childrens-vision/infant-vision-birth-to-24-months-of-age", "passage_text": "1 At around 9 months of age, babies begin to pull themselves up to a standing position. 2  By 10 months of age, a baby should be able to grasp objects with thumb and forefinger. 3  By twelve months of age, most babies will be crawling and trying to walk. Birth to four months. Up to about 3 months of age, babies' eyes do not focus on objects more than 8 to 10 inches from their faces. 1  At birth, babies' vision is abuzz with all kinds of visual stimulation."}, {"url": "http://www.parents.com/toddlers-preschoolers/development/language/language-development-milestones-ages-1-to-4/", "passage_text": "Age 2. This age is the magic number for knowing if a child is on track with speech or is a late talker. Around this period, your growing toddler should be able to: Expand vocabulary. By 24 months, your child should be using about 50 words regularly, such as more, juice, and Grandma. The year between 12 and 24 months is the most exciting year in terms of language development, Dr. Briggs says. "}, {"url": "http://www.babycentre.co.uk/a6575/developmental-milestones-your-babys-understanding", "passage_text": "But he's a fast learner. Your baby started listening to your voice in the womb (uterus), and will recognise it after birth (deCasper and Fifer 1980, Kisilevsky et al 2003) . Once born, your baby begins tuning in to your voice and speech patterns to work out what you're saying. When your baby reaches nine months old, he will recognise and respond to his own name (ICAN 2011, Sheridan 2008) . When your baby is about 12 months to 15 months old he'll understand simple requests, such as stop, give it to daddy, or come here (ICAN 2011) ."}, {"url": "http://www.chop.edu/conditions-diseases/sudden-infant-death-syndrome-sids", "passage_text": "SIDS is the sudden and unexplained death of an infant under 1 year of age. SIDS is sometimes called crib death because the death occurs when a baby is sleeping in a crib. It is one of the leading causes of death in babies from 1 month to 1 year of age, occurring most often between 2 and 4 months of age. "}, {"url": "http://www.scholastic.com/teachers/article/ages-stages-learning-follow-directions", "passage_text": "By 24 months, most toddlers can follow two-and three-step directions. Ellen understands when her teacher says: Please get the doll and blanket and put them in your cubby.. In reality, however, it's best to expect toddlers to respond to your request only 50% of the time at most! By age three, preschoolers have a receptive or understood vocabulary of a little over 1,000 words, to which they add at least 50 more words each month. But children this age are still learning how to listen and pay attention to what they hear."}, {"url": "http://www.aoa.org/patients-and-public/good-vision-throughout-life/childrens-vision/infant-vision-birth-to-24-months-of-age", "passage_text": "Nine to twelve months. By the age of nine to twelve months, babies should be using their eyes and hands together. 1  At around 9 months of age, babies begin to pull themselves up to a standing position. 2  By 10 months of age, a baby should be able to grasp objects with thumb and forefinger. Birth to four months. Up to about 3 months of age, babies' eyes do not focus on objects more than 8 to 10 inches from their faces. 1  At birth, babies' vision is abuzz with all kinds of visual stimulation."}]