[{"url": "http://www.indeed.com/q-System-Operator-Nerc-jobs.html", "passage_text": "Transmission System Operator. Must attain NERC Transmission Operator Certification within six months of hire and complete mandatory NERC yearly training requirements and Continuing Education... 10 days ago-save job-email-more..."}, {"url": "http://www.nerc.com/pa/Train/SysOpCert/Pages/default.aspx", "passage_text": "In support of NERC’s mission, the System Operator Certification Program’s promotes reliability of the North American bulk power system by ensuring that employers have a workforce of system operators that meet minimum qualifications."}, {"url": "http://www.simplyhired.com/salaries-k-system-operator-nerc-certified-jobs.html", "passage_text": "The average salary for system operator nerc certified jobs is $72,000. Average system operator nerc certified salaries can vary greatly due to company, location, industry, experience and benefits."}, {"url": "http://www.payscale.com/research/US/Job=Power_System_Operator/Salary", "passage_text": "The average salary for a Power System Operator is $79,950 per year. A skill in NERC CIP Compliance is associated with high pay for this job."}, {"url": "http://www.ok.gov/opm/HR_and_Employee_Services/Job_Family_Descriptors/Q000_-_Power_Generation/Q30_-_POWER_GENERATION_SYSTEM_OPERATOR.html", "passage_text": "The Power Generation System Operator job family has four levels that are distinguished based on obtaining NERC certification, the complexity of the work assigned and the scope of responsibility for supervision of system operators."}, {"url": "http://www.nerc.com/pa/Train/SysOpCert/Pages/default.aspx", "passage_text": "NERC maintains the required credentials for over 6,000 system operators working in system control centers across North America. NERC’s system operator certification exam tests specific knowledge of job skills and Reliability Standards. It also prepares operators to handle the bulk power system during normal and emergency operations. Certification is maintained by completing NERC‐approved continuing education program courses and activities."}, {"url": "http://www.simplyhired.com/salaries-k-system-operator-nerc-certified-jobs.html", "passage_text": "The system operator nerc certified salary comparisons feature allows job seekers to get the information required to make important career decisions and negotiate salary ranges. For additional system operator nerc certified salary information, we recommend visiting Payscale.com."}]