[{"url": "http://kb.winzip.com/kb/entry/109/", "passage_text": "WinZip's advanced encryption (FIPS-197 certified) uses the Rijndael cryptographic algorithm which, in 2001, was specified by the National Institute of Standards and Technology (NIST) in Federal Information Processing Standards (FIPS) Publication 197 as the Advanced Encryption Standard (AES). Views: 82707. WinZip applications support 128- and 256-bit key AES encryption, which provides much greater cryptographic security than the traditional Zip 2.0 encryption method used in earlier versions of WinZip."}, {"url": "https://en.wikipedia.org/wiki/Advanced_Encryption_Standard", "passage_text": "AES is included in the ISO/IEC 18033-3 standard. AES is available in many different encryption packages, and is the first publicly accessible and open cipher approved by the National Security Agency (NSA) for top secret information when used in an NSA approved cryptographic module (see Security of AES, below). Rijndael is a family of ciphers with different key and block sizes. For AES, NIST selected three members of the Rijndael family, each with a block size of 128 bits, but three different key lengths: 128, 192 and 256 bits. AES has been adopted by the U.S. government and is now used worldwide. It supersedes the Data Encryption Standard (DES), which was published in 1977. The algorithm described by AES is a symmetric-key algorithm, meaning the same key is used for both encrypting and decrypting the data"}, {"url": "http://www.jscape.com/blog/aes-encryption", "passage_text": "The size of each block is usually measured in bits. AES, for example, is 128 bits long. Meaning, AES will operate on 128 bits of plaintext to produce 128 bits of ciphertext. Like almost all modern encryption algorithms, AES requires the use of keys during the encryption and decryption processes. AES supports three keys with different lengths: 128-bit, 192-bit, and 256-bit keys."}, {"url": "http://www.wisegeek.com/what-is-aes-encryption.htm", "passage_text": "Advanced Encryption Standard (AES) is a symmetric key cipher technique used to secure and encrypt operating systems, hard drives, networking systems, files, e-mails, and other similar data. In cryptography, AES consist of three block ciphers taken from a larger collection published originally as Rijndael. AES encryption is used around the world to secure some of the most protected systems for both governmental groups and business. AES encryption is even used by individuals to protect private computers and networking systems. It is now the standard set by the US government and individuals worldwide."}, {"url": "http://www.webopedia.com/TERM/A/AES.html", "passage_text": "(1) Short for Advanced Encryption Standard, a symmetric 128- bit block data encryption technique developed by Belgian cryptographers Joan Daemen and Vincent Rijmen. The U.S government adopted the algorithm as its encryption technique in October 2000, replacing the DES encryption it used. "}, {"url": "https://en.wikipedia.org/wiki/AES/EBU", "passage_text": "AES3 (also known as AES/EBU) is a standard for the exchange of digital audio signals between professional audio devices. AES3 was jointly developed by the Audio Engineering Society (AES) and the European Broadcasting Union (EBU). "}, {"url": "https://www.aacb.com/2015/06/15/vehicle-aes-what-you-need-to-know/", "passage_text": "The Automated Export System (AES) is the system used by U.S. exporters to electronically declare their international exports, known as Electronic Export Information (EEI), to the Census Bureau to help compile U.S. export and trade statistics. The export process begins when the exporter decides to export merchandise. "}, {"url": "http://searchsecurity.techtarget.com/definition/Advanced-Encryption-Standard", "passage_text": "The Advanced Encryption Standard or AES is a symmetric block cipher used by the U.S. government to protect classified information and is implemented in software and hardware throughout the world to encrypt sensitive data. Download this guide to become a Web App Security superhero. AES is more secure than its predecessors -- DES and 3DES -- as the algorithm is stronger and uses longer key lengths. It also enables faster encryption than DES and 3DES, making it ideal for software applications, firmware and hardware that require either low-latency or high throughput, such as firewalls and routers."}]