[{"url": "http://www.entnet.org/content/what-otolaryngologist", "passage_text": "Otolaryngology (pronounced oh/toe/lair/in/goll/oh/jee) is the oldest medical specialty in the United States. Otolaryngologists are physicians trained in the medical and surgical management and treatment of patients with diseases and disorders of the ear, nose, throat (ENT), and related structures of the head and neck. They are commonly referred to as ENT physicians."}, {"url": "http://www.entnet.org/content/what-otolaryngologist", "passage_text": "To qualify for certification by the American Board of Otolaryngology, an applicant must first complete college (four years), medical school (four years), and at least five years of specialty training. Next, the physician must pass the American Board of Otolaryngology examination. Otolaryngologists are physicians trained in the medical and surgical management and treatment of patients with diseases and disorders of the ear, nose, throat (ENT), and related structures of the head and neck. They are commonly referred to as ENT physicians."}, {"url": "http://study.com/requirements_to_become_a_doctor.html", "passage_text": "Show me popular schools. The requirements for becoming a doctor in the U.S. may vary by specialty. In general, doctors complete a 4-year undergraduate degree program, spend four years in medical school and then complete 3-7 years of residency training, before they are eligible for medical licensing. Source: *U.S."}, {"url": "http://www1.salary.com/Physician-Otolaryngology-salary.html", "passage_text": "For example the median expected annual pay for a typical Physician-Otolaryngology in the United States is $339,312, so 50% of the people who perform the job of Physician-Otolaryngology in the United States are expected to make less than $339,312. Source: HR Reported data as of October 2015. 1  Salary. "}, {"url": "http://www.healthcare-salaries.com/physicians/otolaryngologist-salary-ent", "passage_text": "Based on the type of employer, an average annual salary for an otolaryngologist employed in a private practice receives from $185,947 to $305,209; in hospital earns from $99,158 to $300,028; and in a school receives from $152,605 to $343,922 per year. The yearly salary for top 10 percent of otolaryngologists is more than $398,855 per year whereas the bottom 10 percent of them received around less than $223,237 per year. Read more about otolaryngologist salary."}, {"url": "http://mdsalaries.com/2011/08/29/ent-physician-salary/", "passage_text": "Training. To become an ENT doctor, you need to complete 5 years of residency training after medical school. The first year focuses on breaking you into the surgical residency experience and allows you to do rotations in various fields. Afterwards, you will have four years of specific training in otolaryngology. "}, {"url": "http://www.healthcare-salaries.com/physicians/otolaryngologist-salary-ent", "passage_text": "The median expected salary for an average otolaryngologist in the United States is around $315,170 per annum. According to the United States payscale, an otolaryngologist earns an average annual salary ranging from between $102,556 – $369,872 per year. In addition, a yearly bonus of about rom $55,752 will be credited to his or her account. The yearly salary for top 10 percent of otolaryngologists is more than $398,855 per year whereas the bottom 10 percent of them received around less than $223,237 per year. Read more about otolaryngologist salary."}, {"url": "http://www.ehow.com/info_12037351_much-ear-nose-throat-doctor-make.html", "passage_text": "Experience. The years of experience working as an ENT doctor greatly affects how much you can expect to earn on an annual basis. According to the 2003 salary survey from Allied Physicians, a doctor who specializes in otolaryngology will make an average of $194,000 per year during her first two years of employment. Those who specialized in pediatric otolaryngology reported an annual mean of $250,279. ENT doctors who taught as a professor in a medical school setting earned a mean of $295,400."}, {"url": "http://www.ehow.com/how_7565872_become-otolaryngologist.html", "passage_text": "An otolaryngologist or ENT is a physician who specializes in treating the ear, nose and throat. According to the Bureau of Labor Statistics, the number of open jobs for physicians and surgeons will increase 22 percent from 2008 to 2018. Board certification in otolaryngology is determined by the American Board of Otolaryngology. The board requires at least one year of general surgical training and a four-year ENT residency in order to qualify for the examinations. Both an oral and written exam are required."}]