[{"url": "http://www.themedicalquestions.com/illness/how-long-does-it-take-for-mri-results-to-come-back.html", "passage_text": "The Radiologist reads the images the same day. A typed report may take 2-3 days, then they have to mail it to your doctor. If he is in a hurry, he can ask for a wet reading an old term from when X-rays came out of the developer ..."}, {"url": "http://www.nhs.uk/Conditions/MRI-scan/Pages/How-is-it-performed.aspx", "passage_text": "How an MRI scan is performed. A magnetic resonance imaging (MRI) scan is a painless procedure that lasts 15 to 90 minutes, depending on the size of the area being scanned and the number of images being taken."}, {"url": "http://www.webmd.com/brain/magnetic-resonance-imaging-mri-of-the-head", "passage_text": "Magnetic resonance imaging (MRI) is a test that uses a magnetic field and pulses of radio wave energy to take pictures of the head. In many cases, MRI gives information that can't be seen on an X-ray, ultrasound, or computed tomography (CT) scan."}, {"url": "http://www.themedicalquestions.com/Med/how-long-does-a-mri-take.html", "passage_text": "The scan will take 30 to 90 minutes. Preparation and sedation take an additional 60 minutes. The length of time depends upon the part of the body being scanned. https://www.med.virginia.edu/internet/radiology/pediatrics/pediatrics-mri-scan.cfm. A really long time, maybe half an hour, that you can't move you head."}, {"url": "https://www.zocdoc.com/answers/7996/how-long-will-it-take-to-get-the-results-of-an-mri-brain-scan", "passage_text": "The turnaround time for an MRI scan depends on the radiologists' schedule. At many medical centers, the radiologist may interpret the scan and write a report on the order of several hours to one day. From that point, it is up to the physician who ordered the MRI scan to share the results with the patient."}, {"url": "http://www.themedicalquestions.com/illness/how-long-does-it-take-for-mri-results-to-come-back.html", "passage_text": "How long will depend on why you are having the scan and where you have it done. Ask at the time/place the MRI is performed. [ Source: http://www.chacha.com/question/how-long-does-it-take-for-mri-results-to-come-back ]. More Answers to  How long does it take for MRI results to come back ."}, {"url": "http://www.howlongdoes.com/health/how-long-does-it-take-to-get-mri-results/", "passage_text": "Also, how long does it take to get MRI results depends upon that in which kind of a hospital or at what time, the test has been taken for the MRI scan."}, {"url": "https://www.zocdoc.com/answers/7996/how-long-will-it-take-to-get-the-results-of-an-mri-brain-scan", "passage_text": "Depending on the reason the scan was ordered, the physician may want for you to make an office appointment to review the results in person. You should speak with the physician who is ordering the MRI of your brain to determine how he or she will share the results with you, for example over the phone or"}, {"url": "http://www.howlongdoes.com/health/how-long-does-it-take-to-get-mri-results/", "passage_text": "How long does it take to get MRI results depends upon the fact that which part of a body is being tested or scanned through an MRI. However, the images of an MRI or the result of an MRI scan becomes available within an hour of the test or MRI scan."}]