[{"url": "http://www.ehow.com/info_8688501_prison-psychologist-salary.html", "passage_text": "National Salary. Simply Hired provides an average salary of $57,000 per year for all prison psychologists as of 2011. The Bureau of Labor Statistics, or BLS, shows that the average annual salary for all counseling psychologists, including prison psychologists, was $72,540 as of 2010."}, {"url": "http://work.chron.com/psychologists-prisons-make-lot-23005.html", "passage_text": "Prison psychologists make much more than the average wage of $45,790 for all occupations in the U.S. in 2012, according to a survey by the Bureau of Labor Statistics."}, {"url": "http://work.chron.com/salary-corrections-psychologist-30207.html", "passage_text": "BLS did not offer prison-specific wages for psychologists, but it did show that psychologists who work for the government have a salary that's higher than the national average. Psychologists in general had a median wage of $69,280 a year as of 2012, according to BLS."}, {"url": "http://work.chron.com/salary-corrections-psychologist-30207.html", "passage_text": "The salary for a corrections psychologist depends on whether or not the employee has a doctorate degree, how much experience he has and where the prison is located. According to the Bureau of Labor Statistics, psychologists who work for the federal government made an average wage of $88,080 in 2013."}, {"url": "http://work.chron.com/psychologists-prisons-make-lot-23005.html", "passage_text": "For example, psychologists working in federal prisons in 2013 were employed as either a grade 11 or grade 12 employee. The salary range of a grade 11 employee was $62,019 to $77,103 and has 10 steps."}, {"url": "http://www.ehow.com/info_8688501_prison-psychologist-salary.html", "passage_text": "Simply Hired provides salary figures for prison psychologists by state as of 2011. Prison psychologists in New York earned an average of $67,000 per year and those in California had average salaries of $65,000 per year. Prison psychologists in Illinois had average salaries of $60,000 a year and the average annual income for prison psychologists in Texas was $53,000. Pennsylvania's prison psychologists had an average salary of $5"}, {"url": "http://work.chron.com/salary-corrections-psychologist-30207.html", "passage_text": "In federal prisons, clinical psychologists are hired to counsel inmates and provide mental health therapy. The salary is assigned according to a federal pay scale, with options at GS-11 through GS-12, which ranges from $57,982 to $90,344 a year."}, {"url": "http://work.chron.com/psychologists-prisons-make-lot-23005.html", "passage_text": "As of June 2013, there are no estimates from the BLS for psychologists in California, though according to a 2012 report by the Orange County Register on the wages of state prison workers, 242 psychologists working in California states averaged more than $200,000."}]