[{"url": "http://www.ancestry.ca/name-origin?surname=gan", "passage_text": "Gan Name Meaning. Chinese: although the character for Gan is the same as that in the name of the western province Gansu, the two sources of the surname are not related to that of the province. One source of the surname is Gan Pan, a senior minister to the Shang dynasty king Wu Ding (1324–1266 bc). The other source is a town named Gan in Shaanxi province that was granted to a descendant of Wu Wang (who established the Zhou dynasty in 1122 bc)."}, {"url": "http://genealogy.familyeducation.com/surname-origin/gan", "passage_text": "1 Chinese: although the character for Gan is the same as that in the name of the western province Gansu, the two sources of the surname are not related to that of the province. 2  One source of the surname is Gan Pan, a senior minister to the Shang dynasty king Wu Ding (1324–1266 bc). 1 The other source is a town named Gan in Shaanxi province that was granted to a descendant of Wu Wang (who established the Zhou dynasty in 1122 bc). 2  The grantee’s descendants adopted the place name as their surname."}, {"url": "http://www.ancestry.com/name-origin?surname=gan", "passage_text": "Gan Name Meaning. Chinese: although the character for Gan is the same as that in the name of the western province Gansu, the two sources of the surname are not related to that of the province. One source of the surname is Gan Pan, a senior minister to the Shang dynasty king Wu Ding (1324–1266 bc). You can find out where the majority of the Gan families were living before they immigrated to the U.S and learn where to focus your search for foreign records. Immigration records can tell you an ancestor's name, ship name, port of departure, port of arrival, and destination."}, {"url": "http://www.genealogytoday.com/surname/finder.mv?Surname=Gan", "passage_text": "Origins of the Gan Surname. It is quite possible for two people with the Gan last name to have been given that surname for entirely different reasons. Discovering the country from which your Gan ancestors originated can often yield additional clues for the meaning of the surname. Keep in mind that it was not unusual for a last name to be altered as an ancestor entered a new country. Web: Countries of Origin for the Gan last name. Web: The Wikipedia Gan Surname pag"}, {"url": "http://genealogy.familyeducation.com/surname-origin/gan", "passage_text": "Last name origins & meanings: 1  Chinese: although the character for Gan is the same as that in the name of the western province Gansu, the two sources of the surname are not related to that of the province. 2  One source of the surname is Gan Pan, a senior minister to the Shang dynasty king Wu Ding (1324–1266 bc). 1 The other source is a town named Gan in Shaanxi province that was granted to a descendant of Wu Wang (who established the Zhou dynasty in 1122 bc). 2  The grantee’s descendants adopted the place name as their surname."}, {"url": "http://www.surnameweb.org/Gan/surname-origin.htm", "passage_text": "Origin of Gan, Meaning of Gan. Origin: Ganow is a variant of Gano which was changed from Gaigneau, de Champuallins, de Chateaumorand France, about 1610 in the USA. Gan Immigration to the US by Year You can find out when most of the Gan families immigrated to the United States. You can focus your search to immigration records dating from that era. Name History and Origin for Gan Naming patterns can help you learn more about your family s cultural and ethnic background."}, {"url": "http://www.surnameweb.org/Gan/surname-origin.htm", "passage_text": "Origin of Gan, Meaning of Gan. Origin: I know that the surname came from Denmark, by way of Barbados in the early 1860's. I would be interested in finding the Danish roots of the name. Gan Immigration to the US by Year You can find out when most of the Gan families immigrated to the United States. You can focus your search to immigration records dating from that era. Name History and Origin for Gan Naming patterns can help you learn more about your family s cultural and ethnic background."}, {"url": "http://genealogy.familyeducation.com/surname-origin/gan", "passage_text": "Last name origins & meanings: 1  Chinese: although the character for Gan is the same as that in the name of the western province Gansu, the two sources of the surname are not related to that of the province. 2  Hispanic (Filipino): unexplained. 1 The other source is a town named Gan in Shaanxi province that was granted to a descendant of Wu Wang (who established the Zhou dynasty in 1122 bc). 2  The grantee’s descendants adopted the place name as their surname."}]