[{"url": "http://www.rightdiagnosis.com/r/rheumatoid_arthritis/intro.htm", "passage_text": "Rheumatoid arthritis is an ongoing, progressive disease that affects the joints of the body with episodes of painful inflammation. Rheumatoid arthritis also affects other organs of the body and can result in the destruction of joints, disability, and in severe cases, life threatening complications."}, {"url": "http://www.healthline.com/health-slideshow/psoriatic-arthritis-prognosis-life-expectancy", "passage_text": "While the prognosis for people with psoriatic arthritis is good, the disease can affect life expectancy, as well as quality of life. The National Psoriasis Foundation (NPF) suggests taking steps to manage pain and improve your general wellness."}, {"url": "https://www.psoriasis.org/about-psoriasis/types/erythrodermic", "passage_text": "Erythrodermic [eh-REETH-ro-der-mik] psoriasis is a particularly inflammatory form of psoriasis that often affects most of the body surface. It may occur in association with von Zumbusch pustular psoriasis."}, {"url": "http://www.uveitis.org/docs/dm/psoriatic_arthritis.pdf", "passage_text": "PSORIATIC ARTHRITIS Chryssanthie Kafkala, M.D. INTRODUCTION: Psoriatic arthritis is a disease with generally good prognosis. Both ocular and systemic involvement is usually benign, however, the following case is about a patient, who is disabled due to his severe joint and ocular symptoms."}, {"url": "https://www.sharecare.com/health/psoriasis-skin/is-psoriasis-life-threatening", "passage_text": "A Honor Society of Nursing (STTI) answered. Psoriasis may be uncomfortable at times, but it is not a life-threatening condition. Most people diagnosed with psoriasis learn how to manage the condition using a treatment plan prescribed by their doctor."}, {"url": "http://www.healthline.com/health-slideshow/psoriatic-arthritis-prognosis-life-expectancy", "passage_text": "Other research found that patients with both psoriasis and psoriatic arthritis may have more difficulty functioning than those with psoriasis alone. The review showed that people who suffer from psoriasis experience a significantly lower quality of life than those who have other chronic conditions."}, {"url": "http://www.healthline.com/health-slideshow/psoriatic-arthritis-prognosis-life-expectancy", "passage_text": "Psoriatic arthritis is not life-threatening. It affects your joints. At the same time, there is no known cure for the condition. Some research has suggested that people with psoriatic arthritis have a slightly shorter life expectancy than the general population."}, {"url": "http://www.healthline.com/health/psoriatic-arthritis", "passage_text": "Psoriatic arthritis (PsA) is a type of arthritis that occurs in people with psoriasis. Psoriasis is a skin disease where itchy, scaly red patches appear on the skin and scalp. According to The National Psoriasis Foundation (NPF), about two percent of the United States population has"}, {"url": "http://www.healthline.com/health-slideshow/psoriatic-arthritis-prognosis-life-expectancy", "passage_text": "In most cases, the joint pain and inflammation caused by psoriatic arthritis responds well to treatment. You can manage your condition through medications and lifestyle changes. You may need to take stronger medication or a combination of drugs to ease symptoms and prevent future damage to joints in more serious cases."}]