[{"url": "http://medical-dictionary.thefreedictionary.com/adenoidectomy", "passage_text": "adenoidectomy. surgical excision of the adenoids. The operation is usually performed in conjunction with tonsillectomy since both the adenoids and palatine tonsils tend to become enlarged after repeated infections of the throat. "}, {"url": "http://www.healthline.com/health/adenoid-removal", "passage_text": "Adenoid removal, also called adenoidectomy, is a common surgery used to remove the adenoids. The adenoids are glands located in the roof of the mouth, behind the soft palate where the nose connects to the throat. The adenoids produce antibodies (white blood cells) that help fight infections. Typically, the adenoids shrink during adolescence and may disappear by adulthood."}, {"url": "https://en.wikipedia.org/wiki/Adenoidectomy", "passage_text": "Adenoidectomy is not often performed under one year of age as adenoid function is part of the body's immune system but its contribution to this decreases progressively beyond this age. The surgery is less commonly performed in adults in whom adenoids are considered vestigial and purposeless. It is most often done on an outpatient basis under general anesthesia. Post-operative pain is generally minimal and reduced by icy or cold foods."}, {"url": "http://www.medicalnewstoday.com/articles/232398.php", "passage_text": "Knowledge center. Adenoids, also known as pharyngeal tonsil, or nasopharyngeal tonsil are located at the back of the throat, above the tonsils-they are small lumps of tissue. They form part of the immune system of babies and young children; they protect the body from harmful bacteria and viruses, they fight off infection. Unlike the tonsils, which can be seen if you open your mouth and look into the mirror, adenoids can only be seen when the doctor uses a light and a small mirror, or a flexible telescope. Adenoids trap germs when they enter the body."}, {"url": "http://www.surgeryencyclopedia.com/A-Ce/Adenoidectomy.html", "passage_text": "The purpose of an adenoidectomy is thus to remove infected adenoids. Since they are often associated with infected tonsils, they are often removed as part of a combined operation that also removes the tonsils, called a T&A (tonsillectomy and adenoidectomy). Demographics information is difficult to provide because adenoidectomy is routinely performed in an outpatient setting, for which demographic data are not well recorded. Good information is available from the 1970s and 1980s when the surgery was performed in an inpatient setting."}, {"url": "http://medical-dictionary.thefreedictionary.com/Tonsillectomy+and+Adenoidectomy", "passage_text": "Definition. Tonsillectomy and adenoidectomy (T & A) are surgical procedures to remove the tonsils from the back of the mouth or adenoids from the back of the nasal cavity—both are are part of the lymphatic system, which is responsible for fighting infection. Tonsillectomy and adenoidectomy are surgical procedures performed to remove the tonsils or adenoids. The tonsils are removed in cases where they are a source of recurrent infection or have developed an abscess. Both operations are typically performed on children. The illustration above shows a tonsillectomy in progress."}, {"url": "http://www.nhs.uk/Conditions/Adenoids-and-adenoidectomy/Pages/Introduction.aspx", "passage_text": "Introduction. An adenoidectomy is a quick operation to remove the adenoids – small lumps of tissue at the back of the nose, behind the palate. "}, {"url": "https://en.wikipedia.org/wiki/Adenoidectomy", "passage_text": "Adenoidectomy surgical removal of the adenoids for reasons which include impaired breathing through the nose, chronic infections, or recurrent earaches. The surgery is less commonly performed in adults in whom adenoids are considered vestigial and purposeless. It is most often done on an outpatient basis under general anesthesia. Post-operative pain is generally minimal and reduced by icy or cold foods."}, {"url": "http://www.healthgrades.com/procedures/adenoidectomy", "passage_text": "An adenoidectomy is the surgical removal of the adenoids. The adenoids are glands located in the throat behind the nose. They are not visible through the mouth. The adenoids fight infection, but they can become infected and enlarged themselves. "}]