[{"url": "http://www.midwestgardentips.com/tree_roses.html", "passage_text": "Best roses for standards. Literally any rose can be grafted to a standard to create a tree. Traditional tea roses, grandiflora and floribunda roses, and shrub roses create a more formal structure with a rounded head. Climbing roses grafted to a standard create a waterfall effect. Creeping groundcover roses create an elegant weeping effect"}, {"url": "http://www.midwestgardentips.com/tree_roses.html", "passage_text": "Tree roses, more properly known as rose standards, are an elegant addition to any garden or landscape. Rose standards are not a class of rose, but rather a way of growing roses. A rose bush, creeping, or climbing rose is grafted to a trunk giving the appearance of a tree. Literally any rose can be grafted to a standard to create a tree. Traditional tea roses, grandiflora and floribunda roses, and shrub roses create a more formal structure with a rounded head. Climbing roses grafted to a standard create a waterfall effect. Creeping groundcover roses create an elegant weeping effect"}, {"url": "http://www.gardenguides.com/126753-types-rose-trees.html", "passage_text": "The rose tree or rose standard is an eye-catching horticultural contrivance. According to Rose Magazine, rose trees consist of at least three parts grafted together: a hardy rose rootstock, a rose cane to serve as the trunk and a showy hybrid rose on the top. "}, {"url": "http://homeguides.sfgate.com/plant-standard-rose-59644.html", "passage_text": "Standard roses make a great centerpiece for small gardens. Standard rose plants are hybrid roses that grow from a singular trunk, like a tree. They are grafted onto the trunk and the trunk is grafted onto a root stock, forming the standard. Most standard trunks are about 32 to 36 inches long. Stake the standard rose with a 2-by-2-inch wooden stake that is 12 inches longer than the height of the tree. Insert the stake 12 inches into the ground about 1 inch from the trunk, using a sledge hammer."}, {"url": "http://homeguides.sfgate.com/standard-rose-tree-77193.html", "passage_text": "A standard rose (Rosa spp.) or tree rose is created by grafting a long stem onto hardy rootstock then grafting a rose bush on top of the stem. Any type of rose bush can be used but they are especially popular with Old English and David Austin hybrid roses. How a Tree Rose is Created. To create a tree rose a rootstock and stem are chosen. Dr. Huey is most commonly used on the West Coast; multiflora on the East Coast."}, {"url": "http://www.rosemagazine.com/articles04/tree_roses/", "passage_text": "Tree Roses are more properly called Rose Standards a term believed to come from Victorian Europe when such techniques were commonly used in the rose gardens of nobles. (Miniature rose standards may be grafted onto shorter canes of about 24 inches. These are sometimes marketed as patio tree roses.). A graft is made to a rootstock at the bottom of the central cane. Another graft is made at the top of the cane to form the hybrid."}, {"url": "http://homeguides.sfgate.com/standard-rose-tree-77193.html", "passage_text": "Origin of Standard Roses. Tree roses were developed in the late 18th century in Europe, probably Germany. By the early 19th century there were several nurseries in Germany that specialized in providing the root and stem stock for standard roses. How a Tree Rose is Created. To create a tree rose a rootstock and stem are chosen. Dr. Huey is most commonly used on the West Coast; multiflora on the East Coast."}, {"url": "http://www.youtube.com/watch?v=O6cLzfaP2z8", "passage_text": "Jeff demonstrates how to plant our stem grafted standard roses with great tips for best results from these terrific plants. Roses are a classic and a popular choice for many gardens for their beauty and fragrance. Our standard roses are grafted onto stems of around 80cm with three or more strong branches. The effect is compact bushy heads on tall stems for a terrific display of roses with a manageable habit."}, {"url": "http://www.gardeningknowhow.com/ornamental/flowers/roses/learn-more-about-tree-roses.htm", "passage_text": "A hardy rootstock such as Dr. Huey is trained up to provide the “tree trunk” for the tree rose. A rose bush of the desired variety is grafted to the top of the cane. The David Austin tree roses are created using Dr. Huey rootstock with three of the desired rose bush buds grafted onto each three foot cane stem. The 24-inch tall tree roses have two rose bushes grafted to the top of the cane and the 36-inch tree roses have four grafts at the top making for an awesome display. Many miniature rose bushes that would typically be grown on their own root systems are available as grafted tree roses as well."}]