[{"url": "http://nationalblueribbonschools.ed.gov/", "passage_text": "U.S. Secretary of Education Arne Duncan has recognized 335 schools as National Blue Ribbon Schools for 2015. The award is based on a school’s overall academic excellence or progress in closing achievement gaps among student subgroups. National Blue Ribbon Schools demonstrate that all students can achieve to high levels. In his video message, Secretary Duncan applauded the 2015 schools: This honor recognizes your students’ accomplishments and the hard work and dedication that went into their success."}, {"url": "https://en.wikipedia.org/wiki/Blue_ribbon", "passage_text": "A blue ribbon won at a convention. In some fair competitions in the U.S., particularly 4-H and FFA livestock and horticultural events, blue ribbons may be awarded to any project or exhibit which meets or exceeds all of a competition's judging criteria. 1 A blue ribbon is also the ribbon used for awareness for the disease of neurofibromatosis. 2  A blue ribbon is also the ribbon used for awareness for the autoimmune disease of Sjoegren'sjögren s. 3  Syndrome-anti smoke.  campaigns"}, {"url": "https://en.wikipedia.org/wiki/Blue_ribbon", "passage_text": "1 For fallen police officers. 2  In the US, a blue ribbon is a symbol for remembrance for fallen members of local police services. 3  The ribbons are displayed by the survivors of fallen police officers and are very symbolic of the COPS organization, Concerns Of Police Survivors. 1 A blue ribbon is also the ribbon used for awareness for the disease of neurofibromatosis. 2  A blue ribbon is also the ribbon used for awareness for the autoimmune disease of Sjoegren'sjögren s. 3  Syndrome-anti smoke.  campaigns"}, {"url": "https://en.wikipedia.org/wiki/Blue_ribbon", "passage_text": "1 A blue ribbon is also used for awareness of bullying, while in the city of Belleville, Ontario, the blue ribbon is used in the Violence Awareness and Random Acts of Kindness campaign. 1 A blue ribbon is also the ribbon used for awareness for the disease of neurofibromatosis. 2  A blue ribbon is also the ribbon used for awareness for the autoimmune disease of Sjoegren'sjögren s. 3  Syndrome-anti smoke.  campaigns"}, {"url": "https://en.wikipedia.org/wiki/Pabst_Blue_Ribbon", "passage_text": "Pabst Blue Ribbon. Pabst Blue Ribbon is a beer sold by Pabst Brewing Company, established in Milwaukee, Wisconsin in 1844 and currently based in Los Angeles. On November 13, 2014, Pabst announced that it had completed its sale to Blue Ribbon Intermediate Holdings, LLC. Blue Ribbon is a partnership between American beer entrepreneur Eugene Kashper and TSG Consumer Partners, a San Francisco–based private equity firm. "}, {"url": "https://en.wikipedia.org/wiki/Blue_ribbon", "passage_text": "The blue ribbon is a symbol of high quality. The association comes from The Blue Riband, a prize awarded for the fastest crossing of the Atlantic Ocean by passenger liners and, prior to that from Cordon Bleu, which referred to the blue ribbon worn by a particular order of knights. 1 A blue ribbon is also the ribbon used for awareness for the disease of neurofibromatosis. 2  A blue ribbon is also the ribbon used for awareness for the autoimmune disease of Sjoegren'sjögren s. 3  Syndrome-anti smoke.  campaigns"}, {"url": "https://answers.yahoo.com/question/index?qid=20070815220145AAqniu6", "passage_text": "The blue color of the ribbon symbolizes the color of bruises. -In the U.S., a baby blue ribbon is the symbol of prostate cancer awareness. -In Victoria, Australia, the blue ribbon is the symbol of remembrance for police officers killed in the line of duty. "}, {"url": "http://www.thefreedictionary.com/blue+ribbon", "passage_text": "blue ribbon. n. 1. (Historical Terms) (in Britain) a badge of blue silk worn by members of the Order of the Garter. 2. a badge awarded as the first prize in a competition. 3. n. 1. An award made from a blue ribbon given to a competitor who finishes in first place. 2. An award or honor given for excellence."}, {"url": "http://www2.ed.gov/nationalblueribbonschools", "passage_text": "Logo Use. The National Blue Ribbon Schools Program recognizes public and private elementary, middle, and high schools based on their overall academic excellence or their progress in closing achievement gaps among student subgroups. The National Blue Ribbon School award affirms the hard work of students, educators, families, and communities in creating safe and welcoming schools where students master challenging content."}]