[{"url": "http://www.wikihow.com/Calculate-the-Cost-of-Driving", "passage_text": "2. Divide vehicle operation costs, $293.83 per month in our hypothetical scenario, by the distance you drive per month, 750 miles (1,207 km) in our example, to calculate the cost per mile. The cost per mile for this hypothetical driver and vehicle is 39.17 cents per mile or 24 cents per kilometer. 5. Divide the number of miles or kilometers you drove by the number of gallons or liters it took to refill your tank. For example, if you drove 300 miles (482.8 km) and burned 15 gallons (56.78 liters) of gasoline, your vehicle got about 20 miles per gallon (8.5 km per liter)."}, {"url": "http://www.fao.org/docrep/t0579e/t0579e06.htm", "passage_text": "The unit cost of road construction in dollars per kilometer is the sum of the subunit costs of the road construction activities. 4.2 Surveying. Surveying and staking costs vary considerably depending on type and size of the job, access, terrain, and job location. One method of estimating production is to estimate the number of stakes which can be set per hour and the number of stakes which must be set per kilometer."}, {"url": "http://www.caa.ca/wp-content/uploads/2012/06/CAA_Driving_Cost_English_2013_web.pdf", "passage_text": "The average tire wear and tire cost per kilometer is about 1.86 cents for theCivic LX, 1.98 cents for the Toyota Camry and 2.56 cents for the Chevrolet Equinox.A new set of tires can cost up to $968.96 (this is an average cost using Civic, Camryand Equinox tires). Winter tires are mandatory in Quebec. Forexample, if it costs you $50.00 to refuel and you drove 500 kilometres since yourlast fill-up, your gas cost per kilometre is 10 cents. Maintenance: Proper maintenance affects the life of your vehicle, your fuel economyand your safety. Avoiding repairs and maintenance will cost you in the form of extradepreciation."}, {"url": "http://www.fao.org/docrep/t0579e/t0579e06.htm", "passage_text": "The surveying production rate in km per hour is equal to the number of stakes the crew sets per hour divided by the number of stakes required per km. Example: A survey crew is setting 300 stakes per km at a rate of 15 stakes per hour. The cost of a survey crew including transport is $10 per hr. 4.2 Surveying. Surveying and staking costs vary considerably depending on type and size of the job, access, terrain, and job location. One method of estimating production is to estimate the number of stakes which can be set per hour and the number of stakes which must be set per kilometer."}, {"url": "http://www.wikihow.com/Calculate-the-Cost-of-Driving", "passage_text": "Divide vehicle operation costs, $293.83 per month in our hypothetical scenario, by the distance you drive per month, 750 miles (1,207 km) in our example, to calculate the cost per mile. 5. Divide the number of miles or kilometers you drove by the number of gallons or liters it took to refill your tank. For example, if you drove 300 miles (482.8 km) and burned 15 gallons (56.78 liters) of gasoline, your vehicle got about 20 miles per gallon (8.5 km per liter)."}, {"url": "http://www.wikihow.com/Calculate-the-Cost-of-Driving", "passage_text": "Multiply the total amount of fuel per month you burn by the cost of a gallon or liter of gasoline to get your monthly fuel costs. If gas costs $4 per gallon ($1.05 per liter), you spend $128 per month on fuel, or 17 cents per mile (10 cents per km). 5. Divide the number of miles or kilometers you drove by the number of gallons or liters it took to refill your tank. For example, if you drove 300 miles (482.8 km) and burned 15 gallons (56.78 liters) of gasoline, your vehicle got about 20 miles per gallon (8.5 km per liter)."}, {"url": "http://www.wikihow.com/Calculate-the-Cost-of-Driving", "passage_text": "(If your car has 30,000 miles [48,280 km] and is 40 months old, you drive about 750 miles [1,207 km] per month.) In this hypothetical example, divide 750 (1,207 km) by 20 gallons (75.7 liters) to get the number of gallons or liters you burn per month: 37.5 gallons (142 liters). 5. Divide the number of miles or kilometers you drove by the number of gallons or liters it took to refill your tank. For example, if you drove 300 miles (482.8 km) and burned 15 gallons (56.78 liters) of gasoline, your vehicle got about 20 miles per gallon (8.5 km per liter)."}, {"url": "http://www.fao.org/docrep/t0579e/t0579e06.htm", "passage_text": "4.1 Introduction. The unit cost of road construction in dollars per kilometer is the sum of the subunit costs of the road construction activities. Road construction unit costs are estimated by dividing the machine rates by the production rates for the various activities involved in road construction. 4.2 Surveying. Surveying and staking costs vary considerably depending on type and size of the job, access, terrain, and job location. One method of estimating production is to estimate the number of stakes which can be set per hour and the number of stakes which must be set per kilometer."}, {"url": "http://www.worldbank.org/transport/roads/c&m_docs/kmcosts.pdf", "passage_text": "The Information • The objective is to create a database ofactual maintenance, rehabilitation andconstruction work costs per km.• Information from World Bank completedhighways projects, from 1995 to 1999, wasreviewed.• Information was collected from 40 countries• 93 work costs per km were found orestimated. "}]