[{"url": "https://en.wikipedia.org/wiki/Precambrian", "passage_text": "It is not known when life originated, but carbon in 3.8 billion year old rocks from islands off western Greenland may be of organic origin. Well-preserved bacteria older than 3.46 billion years have been found in Western Australia. Probable fossils 100 million years older have been found in the same area. There is a fairly solid record of bacterial life throughout the remainder of the Precambrian. Relatively little is known about the Precambrian, despite it making up roughly seven-eighths of the Earth's history, and what is known has largely been discovered from the 1960s onwards."}, {"url": "http://creationresearch.org/crsq/articles/36/36_3/plantfossils.html", "passage_text": "Conclusion. A variety of Precambrian plant fossils have been documented in rocks as ancient as the Archean (Figure 2). Presently, any specifics about the kind of plants from which these fossilized remains were derived cannot be ascertained. Abstract. Within the global uniformitarian stratigraphic timescale, plant fossils have been found in Precambrian strata dated to approximately 3.5 billion years in age. Evolutionists have not successfully explained when or how life formed to produce these ancient and wide-spread plant fossils."}, {"url": "http://www.australia.gov.au/about-australia/australian-story/australias-fossil-past", "passage_text": "Photograph courtesy of the Australian Heritage Council. A fossil is the impression of a living organism that has been preserved. Fossils are preserved in substances such as sediments, coal, tar, oil, amber, or frozen in ice. There are three main types of fossils: body, trace and chemical. As well as body fossils, which are actual skeletal remains, there are impressions of soft animals, plants and footprints which have been left as mud hardened."}, {"url": "http://creation.com/creationist-geology-precambrian", "passage_text": "Microscopic fossils and traces of fossils are found throughout Australian Precambrian rocks, and new finds of fossil soft–bodied animals are regularly being made. In the USA, Canada, Mexico, China, Russia, Africa and India the story is the same. The main reason more fossils are not found in the so–called Precambrian rocks is that many of these rocks have been altered, particularly by burial and tectonic pressure, and temperature (that is, they have been metamorphosed), and so the contained fossils have been destroyed."}, {"url": "http://www.ucmp.berkeley.edu/precambrian/archean_hadean.php", "passage_text": "Our oldest fossils date to roughly 3.5 billion years ago, and consist of bacteria microfossils. In fact, all life during the more than one billion years of the Archean was bacterial. The Archean coast was home to mounded colonies of photosynthetic bacteria called stromatolites. Stromatolites have been found as fossils in early Archean rocks of South Africa and western Australia. "}, {"url": "http://creationresearch.org/crsq/articles/36/36_3/plantfossils.html", "passage_text": "These fossils force uniformitarians to deal with the sudden appearance of life in Earths supposed very distant past. These plant fossils have been found in Precambrian rocks across the globe (Cooper, Jago, MacKinnon, Shergold, and Vidal, 1982; Glaessner, 1979; Hofmann and Schopf, 1983; Iltchenko, 1972). Abstract. Within the global uniformitarian stratigraphic timescale, plant fossils have been found in Precambrian strata dated to approximately 3.5 billion years in age. Evolutionists have not successfully explained when or how life formed to produce these ancient and wide-spread plant fossils."}, {"url": "http://www.uky.edu/KGS/fossils/fourgroups.htm", "passage_text": "Single-celled life forms have been the most abundant life forms on earth since life began. Because most of these single-celled beings are soft and decay easily, their fossils are very rare. However, some forms that lived in the sea secreted shells, and fossils of these microscopic shells can be found in Kentucky. "}]