[{"url": "https://en.wikipedia.org/wiki/Starling", "passage_text": "Starlings are small to medium-sized passerine birds in the family Sturnidae. The name Sturnidae comes from the Latin word for starling, sturnus. Many Asian species, particularly the larger ones, are called mynas, and many African species are known as glossy starlings because of their iridescent plumage. The shortest-bodied species is Kenrick's starling (Poeoptera kenricki), at 15 centimetres (6 in), but the lightest-weight species is Abbott's starling (Poeoptera femoralis), which is 34 grams (1.2 oz). The largest starling, going on standard measurements and perhaps weight, is the Nias hill myna (Gracula robusta)."}, {"url": "https://answers.yahoo.com/question/index?qid=20100524192305AArqlE2", "passage_text": "This Site Might Help You. RE: What is the symbolism or meaning of the bird breed starling? I know that there are extensive ideas about the symbolism of animals from the Celtics to the Native Americans, Pagans, and beyond. What have you heard is the meaning or symbolism of the Starling? "}, {"url": "http://www.definitions.net/definition/starling", "passage_text": "Wiktionary (0.00 / 0 votes) Rate this definition: starling (Noun). A gregarious passerine bird, of the family Sturnidae, having dark, iridescent plumage. starling (Noun). A structure of pilings that protects the piers of a bridge. Starling (ProperNoun). from a nickname for a gregarious person. Starling (ProperNoun). Starlings are small to medium-sized passerine birds in the family Sturnidae. The name Sturnidae comes from the Latin word for starling, sturnus. Many Asian species, particularly the larger ones, are called mynas, and many African species are known as glossy starlings because of their"}, {"url": "http://www.thinkbabynames.com/meaning/1/Sterling", "passage_text": "Sterling /ster-ling/ [2 sylls.] as a boys' name is pronounced STER-ling. It is of English origin, and the meaning of Sterling is genuine, of high quality. The word derives from an Old English term meaning little star. Also variant of a name meaning easterner given to pre-medieval refiners of silver. Familiar as a given name in the 1950s-1960s due to actor Sterling Hayden. Race-car driver Stirling Moss; sports commentator Sterling Sharpe"}, {"url": "http://www.thefreedictionary.com/starling", "passage_text": "starling. n. 1. (Animals) any gregarious passerine songbird of the Old World family Sturnidae, esp Sturnus vulgaris, which has a blackish plumage and a short tail. [Old English staerlinc, stærlinc from staer (stær starling Related to) + -icelandic-stari line ]. ling 1"}, {"url": "http://www.definitions.net/definition/starling", "passage_text": "Starling (noun). any passerine bird belonging to Sturnus and allied genera. The European starling (Sturnus vulgaris) is dark brown or greenish black, with a metallic gloss, and spotted with yellowish white. It is a sociable bird, and builds about houses, old towers, etc. Called also stare, and starred. Starlings are small to medium-sized passerine birds in the family Sturnidae. The name Sturnidae comes from the Latin word for starling, sturnus. Many Asian species, particularly the larger ones, are called mynas, and many African species are known as glossy starlings because of their iridescent plumage."}, {"url": "https://en.wikipedia.org/wiki/Common_starling", "passage_text": "The common starling (Sturnus vulgaris), also known as the European starling, or in the British Isles just the starling, is a medium-sized passerine bird in the starling family, Sturnidae. The common starling has about a dozen subspecies breeding in open habitats across its native range in temperate Europe and western Asia, and it has been introduced to Australia, New Zealand, Canada, United States, Mexico, Peru, Argentina, the Falkland Islands, Brazil, Chile, Uruguay, South Africa and Fiji."}, {"url": "http://www.merriam-webster.com/dictionary/starling", "passage_text": "Full Definition of STARLING. : any of a family (Sturnidae, especially genus Sturnus) of usually dark gregarious oscine birds; especially: a dark brown or in summer glossy greenish-black European bird (S. vulgaris) naturalized nearly worldwide and often considered a pest. See starling defined for English-language learners. : a dark brown or black bird that is common in Europe and the U.S"}, {"url": "http://www.audioenglish.org/dictionary/starling.htm", "passage_text": "Meaning: Gregarious birds native to the Old World. Classified under: Nouns denoting animals. Hypernyms (starling is a kind of...): oscine; oscine bird (passerine bird having specialized vocal apparatus). Hyponyms (each of the following is a kind of starling): common starling; Sturnus vulgaris (gregarious bird having plumage with dark metallic gloss; builds nests around dwellings and other structures; naturalized worldwide)."}]