[{"url": "http://www.vetstreet.com/care/coronavirus-in-dogs", "passage_text": "Overview. Coronavirus infection is a highly contagious infection of dogs that primarily attacks the intestinal tract. The disease is spread from dog to dog through contact with feces. After coronavirus has been transmitted to a dog, the incubation (development) period of the disease can be as short as one to four days. A vaccine is available to prevent canine coronavirus infection. Coronavirus vaccine is not a core vaccine, but it may sometimes be included in combination vaccines for other, more serious diseases, such as infections with canine distemper virus, canine parvovirus, and canine adenovirus type 2."}, {"url": "http://www.petmd.com/dog/conditions/digestive/c_dg_canine_coronavirus_infection", "passage_text": "A canine coronavirus infection (CCV) is a highly contagious intestinal disease that can be found in dogs all around the world. This particular virus is specific to dogs, both wild and domestic. This intestinal disease is caused by the canine coronavirus, which is closely related to the feline enteric coronavirus (FIP), an intestinal virus that affects cats. The most common source of a CCV infection is exposure to feces from an infected dog."}, {"url": "http://www.vetinfo.com/diagnosis-canine-coronavirus.html", "passage_text": "The incubation period for canine coronavirus is 1 to 3 days. However, this highly-contagious disease can be spread via the feces of infected dogs for 6 to 9 days, and sometimes for as long as 6 months. Coronavirus Is Highly Contagious. Coronavirus is highly contagious with no direct contact with an affected dog necessary. Infection can be transmitted by ingestion of material contaminated by dog feces by either smelling or licking a contaminated surface."}, {"url": "http://health.howstuffworks.com/diseases-conditions/respiratory/corona-virus.htm", "passage_text": "Some corona viruses affect the digestive system. The virus has a crown-like projection on its surface, which is how it got its name. There are many different species of the virus. Human corona virus was discovered in 1965 and accounts for 10 percent to 30 percent of common colds. It affects all age groups and is most common during the winter and early spring."}, {"url": "https://www.avma.org/public/PetCare/Pages/Canine-Respiratory-Coronavirus-FAQs.aspx", "passage_text": "A: Canine respiratory coronavirus (CRCoV) is a group 2 coronavirus. It is genetically related to the bovine coronavirus (which can cause respiratory infections in cattle) and the human coronavirus that causes the common cold in people. 1,2 CRCoV is NOT related to the group 1 enteric coronavirus that can cause diarrhea in dogs."}, {"url": "https://en.wikipedia.org/wiki/Canine_coronavirus", "passage_text": "Canine coronavirus is a virus of the family Coronaviridae that causes a highly contagious intestinal disease worldwide in dogs. It was discovered in 1971 in Germany during an outbreak in sentry dogs. The disease is highly contagious and is spread through the feces of infected dogs, who usually shed the virus for six to nine days, but sometimes for six months following infection. Symptoms include diarrhea, vomiting, and anorexia. Diagnosis is through detection of virus particles in the feces."}, {"url": "http://www.cdc.gov/sars/about/faq.html", "passage_text": "The time between exposure to SARS-CoV and the onset of symptoms is called the incubation period.. The incubation period for SARS is typically 2 to 7 days, although in some cases it may be as long as 10 days. In a very small proportion of cases, incubation periods of up to 14 days have been reported."}, {"url": "https://en.wikipedia.org/wiki/Canine_coronavirus", "passage_text": "The incubation period is one to three days. The disease is highly contagious and is spread through the feces of infected dogs, who usually shed the virus for six to nine days, but sometimes for six months following infection. Symptoms include diarrhea, vomiting, and anorexia. Diagnosis is through detection of virus particles in the feces."}]