[{"url": "http://www.fabaworld.org/careers-in-behavior-analysis/", "passage_text": "Behavior analysts typically supervise Board Certified Associate Behavior Analysts™ who have a bachelor’s degree with coursework in applied behavior analysis and extensive supervised experience in a particuar area of practice."}, {"url": "http://study.com/articles/Behavior_Analyst_Job_Description_and_Education_Requirements.html", "passage_text": "Certification. Employers may require that behavior analysts be certified or eligible for certification. The Behavior Analyst Certification Board (BACB) offers two kinds of certification for behavior analysts-Board Certified Assistant Behavior Analyst (BCaBA) and Board Certified Behavior Analyst (BCBA) (www.bacb.com)."}, {"url": "http://study.com/articles/Behavior_Analyst_Job_Description_and_Education_Requirements.html", "passage_text": "Buyer Behavior Analyst: Job Description & Requirements. Behavior analysis is a research-intensive field that follows market trends and the latest in industrial and private purchasing...."}, {"url": "http://behavioranalysis.uc.edu/news-resources/behavior-analysis-resource-center/behavior-analyst-certification/", "passage_text": "The Behavior Analyst Certification Board (BACB) created the Board Certified Behavior Analyst (BCBA) and Board Certified Assistant Behavior Analyst (BCaBA) credentials to meet the “professional credentialing needs identified by behavior analysts, governments, and consumers of behavior analysis services.” (BACB)."}, {"url": "http://classroom.synonym.com/kind-education-need-behavioral-consultant-3033.html", "passage_text": "Behavioral consultants are specialists in applied behavior analysis who provide support, education and training to people with mental retardation or developmental disabilities, also referred to as MR/DD."}, {"url": "http://bacb.com/bcba/", "passage_text": "The Board Certified Behavior Analyst ® (BCBA ®) is a graduate-level certification in behavior analysis. Professionals who are certified at the BCBA level are independent practitioners who provide behavior-analytic services."}, {"url": "http://study.com/articles/Behavior_Analyst_Job_Description_and_Education_Requirements.html", "passage_text": "Behavior Analyst: Job Description and Education Requirements. Learn about the education and preparation needed to become a behavior analyst. Get a quick view of the requirements as well as details about degree programs, job duties and professional certifications to find out if this is the career for you. View 10 Popular Schools »."}, {"url": "http://study.com/articles/Behavior_Analyst_Job_Description_and_Education_Requirements.html", "passage_text": "The BCaBA credential is conferred on applicants who have earned at least a bachelor's degree in behavior analysis or a related field, such as education, psychology or medicine, have completed 135 hours of behavior analysis coursework and fulfilled certain experience requirements."}, {"url": "http://behavioranalysis.uc.edu/news-resources/behavior-analysis-resource-center/behavior-analyst-certification/", "passage_text": "For students who hold a bachelor’s degree in a related field, completing UC’s online Master of Education in Foundations in Behavior Analysis program fulfills both the coursework and degree requirements needed to sit for the Board Certified Behavior Analyst (BCBA) exam."}]