[{"url": "http://www.minerals.net/mineral/quartz.aspx", "passage_text": "Quartz is one of the most well-known minerals on earth. It occurs in basically all mineral environment s, and is the important constituent of many rock s. Quartz is also the most varied of all minerals, occurring in all different forms, habits, and colors. There are more variety names given to Quartz than any other mineral. - The blue variety of Quartz, which is very uncommon in nature and rarely in crystal form. Most Blue Quartz is what is popularly known as Aqua Aura, essentially clear Rock Crystal synthetically irradiated with gold to form a deep sky blue color."}, {"url": "https://en.wikipedia.org/wiki/Sandstone", "passage_text": "Sandstone (sometimes known as arenite) is a clastic sedimentary rock composed mainly of sand-sized minerals or rock grains. Most sandstone is composed of quartz and/or feldspar because these are the most common minerals in the Earth's crust. Like sand, sandstone may be any color, but the most common colors are: tan, brown, yellow, red, grey, pink, white, and black. "}, {"url": "http://www.tulane.edu/~sanelson/eens212/sandst%26cong.htm", "passage_text": "Milky quartz, polycrystalline quartz grains, and quartz with undulatory extinction are less stable in the sedimentary environment than monocrystalline non-undulatory quartz. Thus, a sandstone consisting of monocrystalline quartz that does not show undulatory extinction is mineralogically the most mature. 1  Feldspar. 1 Although feldspars are the most common minerals in igneous and metamorphic rocks, feldspars are less stable than quartz at conditions near the Earth's surface. 2  Thus feldspars make up only 10-15% of all sandstones. 3  Feldspars in sandstones consist of the following:"}, {"url": "https://en.wikipedia.org/wiki/Quartz", "passage_text": "Amethyst is a popular form of quartz that ranges from a bright to dark or dull purple color. The world's largest deposits of amethysts can be found in Brazil, Mexico, Uruguay, Russia, France, Namibia and Morocco. Sometimes amethyst and citrine are found growing in the same crystal. It is then referred to as ametrine. "}, {"url": "http://geology.com/minerals/quartz.shtml", "passage_text": "It is silicon dioxide (SiO 2). It is the most abundant mineral found at Earth's surface and its unique properties make it one of the most useful natural substances. Quartz is the most abundant and widely distributed mineral found at Earth's surface. It is present and plentiful in all parts of the world. It forms at all temperatures."}, {"url": "http://www.mineralseducationcoalition.org/minerals/quartz", "passage_text": "Quartz is a very common mineral in the Earth’s crust. Chemically, quartz is silica, or silicon dioxide, SiO2. It is found in most types of rocks: igneous, metamorphic and sedimentary. Quartz is rather hard, 7 on the Moh’s hardness scale, and has a glassy (vitreous) luster. When a crystal is broken, the fracture surface is curved, like a shell. This is referred to as conchoidal fracture; glass fractures in the same way."}, {"url": "http://www.mineralseducationcoalition.org/minerals/quartz", "passage_text": "As a mineral name, quartz refers to a specific chemical compound (silicon dioxide, or silica, SiO2), having a specific crystalline form (hexagonal). There are other forms of silica which are either non-crystalline, or of a different crystalline form than quartz. It is found in most types of rocks: igneous, metamorphic and sedimentary. Quartz is rather hard, 7 on the Moh’s hardness scale, and has a glassy (vitreous) luster. When a crystal is broken, the fracture surface is curved, like a shell. This is referred to as conchoidal fracture; glass fractures in the same way."}, {"url": "http://www.mindat.org/min-3337.html", "passage_text": "Isostructural with: Berlinite. Quartz is the most common mineral found on the surface of the Earth. A significant component of many igneous, metamorphic and sedimentary rocks, this natural form of silicon dioxide is found in an impressive range of varieties and colours"}, {"url": "http://www.tulane.edu/~sanelson/eens212/sandst%26cong.htm", "passage_text": "1 Feldspar. 2  Although feldspars are the most common minerals in igneous and metamorphic rocks, feldspars are less stable than quartz at conditions near the Earth's surface. 3  Thus feldspars make up only 10-15% of all sandstones. 1 Although feldspars are the most common minerals in igneous and metamorphic rocks, feldspars are less stable than quartz at conditions near the Earth's surface. 2  Thus feldspars make up only 10-15% of all sandstones. 3  Feldspars in sandstones consist of the following:"}]