[{"url": "http://www.cooks.com/rec/search/0,1-0,pork_roast-minutes_per_pound,FF.html", "passage_text": "Results 1 - 10 of 45 for pork roast-minutes per pound. Result Page: 1 &nbsp 2 &nbsp 3 &nbsp 4 &nbsp 5 &nbsp Next. 1. ROAST TURKEY. Roast turkey is a ... of lean salt pork may be placed ... increasing oven temperature to 425 F.) Fresh or thawed turkey, conventional oven, lowest oven rack. 10. SPRING PORK ROAST. Place fully thawed roast on rack in ... to 30 minutes per pound or until internal ... roast with glaze several times during the last 45 minutes of roasting."}, {"url": "http://www.ibreatheimhungry.com/2012/08/easy-roasted-pork-shoulder-3.html", "passage_text": "1 Place in a large roasting pan skin side up. 2  Roast in a preheated 500 degree (F) oven for 20 minutes. 3  Reduce heat to 300 degrees and roast for an additional 30 minutes per pound. 4  Total cooking time for an 8lb roast should be about 4hrs and 20 minutes. 5  Remove the pork roast from the oven and let rest for 30 minutes. 1 Roast in a preheated 500 degree (F) oven for 20 minutes. 2  Reduce heat to 300 degrees and roast for an additional 30 minutes per pound. 3  Total cooking time for an 8lb roast should be about 4hrs and 20 minutes. 4"}, {"url": "http://www.theshould.com/how-many-minutes-per-pound-should-i-cook-a-pork-loin.html", "passage_text": "If you’re cooking pork loin, it should be 30 minutes per pound. The temperature should be around 350 F. It is also cooked when the thermometer goes up to 155 to 165 F. The internal temperature is more important than the oven temperature itself. Browning and Other Pre Cooking Preparations. The 30 minutes per pound rule gives you a good approximate of the cooking time. But if it reaches 155 F at resting time, it can be considered done. The internal temperature mustn’t go over 170 F. At 170 F, the roast might become too dry."}, {"url": "http://www.porkbeinspired.com/recipes/boneless-pork-loin-roast-with-herbed-pepper-rub/", "passage_text": "Place roast in a shallow pan and roast in a 350 degrees F. oven for 1 hour (20 minutes per pound), until internal temperature on a meat thermometer reads 145 degrees F. Remove roast from oven; let rest about 10 minutes before slicing to serve. Serves 6-8, with leftovers. Nutritional values for 12 servings. "}, {"url": "http://busycooks.about.com/od/startwithseries/a/porktenderloin.htm", "passage_text": "Each tenderloin usually weighs about 1 to 1-1/4 pounds. Pork is cooked in minutes per pound. So roast a tenderloin at 425 degrees F for 15-20 minutes per pound and grill it over medium coals for 15-25 minutes per pound. The internal temperature should be a minimum of 145 degrees F (the USDA lowered the safe temperature for pork in the summer of 2011)"}, {"url": "http://allrecipes.com/recipe/16415/pork-tenderloin/", "passage_text": "1 Preheat oven to 325 degrees F (165 degrees C). 2  Bake in the preheated oven for 25 minutes per pound, or until the internal temperature reaches 145 degrees F (63 degrees C). 3  Baste the pork occasionally while cooking. 4  Meanwhile, heat the apple jelly in a small saucepan over medium heat. 1 Coat the loin well, cover and refrigerate overnight. 2  Preheat oven to 325 degrees F (165 degrees C). 3  Bake in the preheated oven for 25 minutes per pound, or until the internal temperature reaches 145 degrees F (63 degrees C). 4"}, {"url": "http://www.cooks.com/rec/search/0,1-21,pork_roast-minutes_per_pound,FE.html", "passage_text": "Results 21 - 30 of 45 for pork roast-minutes per pound. Result Page: Previous 1 &nbsp 2 &nbsp 3 &nbsp 4 &nbsp 5 &nbsp Next. 21. PORK LOIN ROAST WITH BROWN SUGAR GLAZE. Season a 5 to 6 pound boneless pork loin roast with salt and ... to 40 minutes per pound) for roasting. ... ingredients. Brush glaze on meat during cooking. "}, {"url": "http://www.ibreatheimhungry.com/2012/08/easy-roasted-pork-shoulder-3.html", "passage_text": "1 Reduce heat to 300 degrees and roast for an additional 30 minutes per pound. 2  Total cooking time for an 8lb roast should be about 4hrs and 20 minutes. 3  Remove the pork roast from the oven and let rest for 30 minutes. 1 Roast in a preheated 500 degree (F) oven for 20 minutes. 2  Reduce heat to 300 degrees and roast for an additional 30 minutes per pound. 3  Total cooking time for an 8lb roast should be about 4hrs and 20 minutes. 4"}]