[{"url": "http://www.studymode.com/subjects/psychological-analysis-of-the-movie-sybil-page1.html", "passage_text": "Sybil. Psychology April 20, 2011 SYBIL The movie Sybil depicts the life of Shirley Ardell Mason, a woman suffering from dissociative identity disorder as a result of the physical, emotional and psychological trauma she suffered as a child. Class Paper 11/18/13 SYBIL Sybil (originally created in 1976, and remade in 2007) told a story of a girl who was suffering from Dissociative Identity Disorder (also referred to as Multiple Personality Disorder). “Dissociative Identity Disorder (DID) is a severe condition in which two or more distinct..."}, {"url": "http://psychcentral.com/blog/archives/2011/10/24/was-sybil-faking-multiple-personalities/", "passage_text": "Sybil is one of the most popularly known individuals who had multiple personality disorder, largely because of a book published in the 1970s that detailed her experience and that of her psychiatrist in trying to help treat her. NPR has the story, and describes how Shirley Mason — Sybil’s real name — came to have multiple personality disorder: Shirley Mason, the real Sybil, grew up in the Midwest in a strict Seventh-day Adventist family. As a young woman she was emotionally unstable, and she decided to seek psychiatric help."}, {"url": "http://www.npr.org/2011/10/20/141514464/real-sybil-admits-multiple-personalities-were-fake", "passage_text": "Shirley Mason was the psychiatric patient whose life was portrayed in the 1973 book Sybil. The book and subsequent film caused an enormous spike in reported cases of multiple personality disorder. Mason later admitted she had faked her multiple personalities. When Sybil first came out in 1973, not only did it shoot to the top of the best-seller lists — it manufactured a psychiatric phenomenon. The book was billed as the true story of a woman who suffered from multiple personality disorder."}, {"url": "http://www.studymode.com/subjects/psychological-analysis-of-the-movie-sybil-page1.html", "passage_text": "Child Abuse. Running header: Sybil: Shirley Mason's Sixteen personalities Sybil: Shirley Mason's Sixteen Personalities Abstract  Sybil  is the true story of a woman named Shirley Mason; whose life was documented in a movie and a book. Shirley was treated for Dissociative Identity Disorder, which was earlier... Class Paper 11/18/13 SYBIL Sybil (originally created in 1976, and remade in 2007) told a story of a girl who was suffering from Dissociative Identity Disorder (also referred to as Multiple Personality Disorder). “Dissociative Identity Disorder (DID) is a severe condition in which two or more distinct..."}, {"url": "http://psychology.wikia.com/wiki/Sybil_(book)", "passage_text": "Clinical: Approaches · Group therapy · Techniques · Types of problem · Areas of specialism · Taxonomies · Therapeutic issues · Modes of delivery · Model translation project · Personal experiences ·. Sybil is a book written by Flora Rheta Schreiber in 1973 about a woman named Shirley Ardell Mason. Mason was born on January 25, 1923 in Dodge Center, Minnesota. Her story is the most famous case of Multiple Personality Disorder on record. A movie was also made in 1976 based on the book, starring Sally Field in the title role and Joanne Woodward as her therapist, Dr. Cornelia B. Wilbur. "}, {"url": "https://en.wikipedia.org/wiki/Sybil_(1976_film)", "passage_text": "Wilbur goes in search of Sybil's father, who mentions that Sybil's mother Hattie was diagnosed with paranoid schizophrenia, but denies that she ever abused Sybil. Wilbur also seeks out Sybil's pediatrician. Sybil is a 1976 American drama film that originally aired as a made-for-television miniseries. It is based on the book of the same name."}, {"url": "https://en.wikipedia.org/wiki/Sybil_(book)", "passage_text": "This article is about the non-fiction book about Shirley Ardell Mason 's treatment for dissociative identity disorder. For the novel by Benjamin Disraeli, see Sybil (novel) . Sybil is a 1973 book by Flora Rheta Schreiber about the treatment of Sybil Dorsett (a pseudonym for Shirley Ardell Mason) for dissociative identity disorder (then referred to as multiple personality disorder) by her psychoanalyst, Cornelia B. Wilbur. Mason is given the pseudonym Sybil by her therapist to protect her privacy. Originally in treatment for social anxiety and memory loss, after extended therapy involving amobarbital and hypnosis interviews, Sybil manifests sixteen personalities."}, {"url": "https://en.wikipedia.org/wiki/Sybil_(1976_film)", "passage_text": "Dr. Wilbur hypnotizes Sybil to introduce her to the other personalities. Sybil, who has always been frightened of Peggy, meets her at last and is surprised that she is only a little girl. Sybil embraces a weeping Peggy. Sybil is a 1976 American drama film that originally aired as a made-for-television miniseries. It is based on the book of the same name."}, {"url": "https://psy317melissalim.wordpress.com/2012/03/26/sybil-1976/", "passage_text": "Sybil (1976). Posted by Melissa on March 26, 2012 · 1 Comment. Sybil was filmed based on a true story about a woman who suffered from dissociative identify disorder (DID) that is deeply rooted from her childhood abuse."}]