[{"url": "https://en.wikipedia.org/wiki/VF_Corporation", "passage_text": "On October 3, 2005, Lee brand jeans, sold by the VF Corporation, was seeking another agency after parting ways with Fallon Worldwide in Minneapolis, part of the Publicis Groupe. VF Corporation, which opened their first VF Outlet factory store in 1970, was one of the earliest outlet operations, and opened their first outlet center in the country, in Reading, Pennsylvania."}, {"url": "http://sustainability.vfc.com/planet/water/water-reduction-recycling-and-reuse/", "passage_text": "VF’s facility in Acanceh, Mexico, produces 30 million pairs of jeans every year. The Yucatan Peninsula has very little surface water, so VF and the residents of Acanceh rely on aquifers to meet our freshwater needs. Our owned facilities are dedicated to ensuring that all water used not only meets local standards, but also often exceeds them. In some cases, the water we discharge is cleaner than the water we bring into the production process."}, {"url": "http://sustainability.vfc.com/products/materials/", "passage_text": "Taking a Look at the Environmental Impacts of Materials in Our Products. Procuring and processing the materials we use in our products is traditionally a resource-intensive procedure. Growing cotton uses a substantial amount of water. Tanning leather often generates large amounts of waste. We are embarking on the process of identifying the most commonly used materials in order to better understand our potential points of leverage and to set targets for more sustainable materials. A number of our brands are industry leaders in their responsible use of key materials such as cotton down and leather."}, {"url": "https://en.wikipedia.org/wiki/VF_Corporation", "passage_text": "On July 26, 2007, VF Corporation announced the purchase of 7 for all Mankind and lucy Activewear for a combined $885 million. Eric C. Wiseman became President, CEO, and Chairman in 2008. In 2011, VF Corporation announced its intention to purchase Timberland for $2.2 billion. The deal closed in September 2011. On December 21, 2012, VF Imagewear was awarded a multi-million dollar contract to provide uniforms and insignia for Customs and Border Protection officers. VF Corporation, which opened their first VF Outlet factory store in 1970, was one of the earliest outlet operations, and opened their first outlet center in the country, in Reading, Pennsylvania."}, {"url": "http://sustainability.vfc.com/products/materials/", "passage_text": "In 2013, VF reached its goal of having 1 percent of total cotton used (2,000 tons) qualified as sustainable, meaning it’s harvested as organic, fair-trade or other sustainability initiative. For 2015, we have set a new goal of 3 percent (6,000 tons). We are embarking on the process of identifying the most commonly used materials in order to better understand our potential points of leverage and to set targets for more sustainable materials. A number of our brands are industry leaders in their responsible use of key materials such as cotton down and leather."}, {"url": "http://www.vfc.com/about", "passage_text": "Our strategy begins with a passion for our products and a deep understanding of our consumers. We call it the Art and Science of apparel. "}, {"url": "https://en.wikipedia.org/wiki/VF_Corporation", "passage_text": "VF Corporation is a global apparel and footwear company founded in 1899 and headquartered in Greensboro, North Carolina. VF Corporation, which opened their first VF Outlet factory store in 1970, was one of the earliest outlet operations, and opened their first outlet center in the country, in Reading, Pennsylvania."}, {"url": "https://en.wikipedia.org/wiki/VF", "passage_text": "Vf or VF may stand for: In companies, organizations, groups 1  : VF Corporation, a clothing company. 2  Valuair, an airline based in Singapore, IATA code VF. 3  Vodafone, a UK-based mobile/cell phone network."}, {"url": "http://sustainability.vfc.com/planet/water/water-reduction-recycling-and-reuse/", "passage_text": "While the Mexican government has increased its environmental standards and enforcement, VF is going well beyond legal requirements in Acanceh. Our processes are nearly 100 percent non-consumptive, meaning nearly all of the water we use is returned to the watershed. Our owned facilities are dedicated to ensuring that all water used not only meets local standards, but also often exceeds them. In some cases, the water we discharge is cleaner than the water we bring into the production process."}]