[{"url": "http://food-answers.co.uk/questions/how-long-do-cooked-sweet-potatoes-last-in-the-refrigerator-770729.html", "passage_text": "Oranges can last in the refrigerator, in the crisper drawer, for about 2 to 4 weeks. The quality of oranges is good until mold starts to form. Oranges can be kept at room temperature for about a... Brierley Babetah answered on 5/12/2014. How long meat lasts in the refrigerator depends on what kind of meat it is. For the most part two days is the general rule. Any longer than two days the can start to get slimy feeling and/or a bit of... (more)"}, {"url": "http://www.wikihow.com/Store-Sweet-Potatoes", "passage_text": "Cure the sweet potatoes for 1 to 2 weeks. Keep the roots in a room or other location that reaches between 75 and 80 degrees Fahrenheit (24 and 27 degrees Celsius) with relative humidity of 90 to 95 percent. 1  The sweet potatoes need to cure for at least 7 days, but they can be kept there for as many as 14 days. 1 You need to cook the sweet potatoes before you can freeze them, as raw sweet potatoes tend to break down and lose both flavor and nutrients in the freezer. 2  Boiling is the preferred method of cooking sweet potatoes for freezer storage. 3  The boiling process should take about 20 minutes for a standard-size sweet potato."}, {"url": "http://www.alwaysorderdessert.com/2011/09/how-to-shop-and-store-sweet-potatoes.html", "passage_text": "Cooked sweet potatoes can be frozen for up to a year if packed in a sealed and air-tight container. Cooked sweet potatoes will also keep well in the refrigerator for about one week. If purchased fresh and stored properly, raw sweet potatoes should last about 10 to 14 days. Do not store raw sweet potatoes in the refrigerator as the cold will negatively affect the taste and texture. If kept on the counter, make sure to keep them in a darker part of the counter away from direct sunlight or fluctuations in temperature."}, {"url": "https://answers.yahoo.com/question/index?qid=20080528112130AAAVrVv", "passage_text": "If you mean good, as in tasting, probably only up to 3 days. If you mean safe to eat, I'd say 7-10 days. If you baked the potato in the oven, covered with aluminum foil, you should promptly remove the foil from the potato. Never store the potato in the foil in the refrigerator. I would reheat the potato in the microwave. The oven will dry out the potato as it will take too long for the potato to heat up. Susan D · 7 years ago. "}, {"url": "http://food-answers.co.uk/questions/how-long-do-cooked-sweet-potatoes-last-in-the-refrigerator-770729.html", "passage_text": "Freeze for later use or store the sweet potatoes in the refrigerator for 7 to 10 days. ... Cooking time will vary, depending on the number of sweet potatoes. ... Dip can be made as long as a day in advance, covered and refrigerated. ... Brierley Babetah answered on 5/12/2014. How long meat lasts in the refrigerator depends on what kind of meat it is. For the most part two days is the general rule. Any longer than two days the can start to get slimy feeling and/or a bit of... (more)"}, {"url": "http://www.eatbydate.com/vegetables/fresh-vegetables/how-long-do-sweet-potatoes-or-yams-last/", "passage_text": "1 Peel, cut and boil your sweet potatoes until soft. 2  Combine 1/2C brown sugar, 1/4C coconut, 1/4C finely chopped pecans, 3T melted butter and a dash of cinnamon and layer this mixture on top of the smashed sweet potatoes in a buttered casserole dish. 3  Bake at 350°F for about 30 minutes. 1 Make sweet potato fries. 2  Peel & cut the sweet potatoes then mix with a little olive oil and a sprinkle of any or all of these: sugar, salt, cinnamon, nutmeg or pumpkin pie spice. 3  Place on lightly sprayed pan in a hot 450°F oven for about 20 minutes. 4  Peel, cut and boil your sweet potatoes until soft"}, {"url": "http://www.eatbydate.com/vegetables/fresh-vegetables/how-long-do-sweet-potatoes-or-yams-last/", "passage_text": "1 Peel & cut the sweet potatoes then mix with a little olive oil and a sprinkle of any or all of these: sugar, salt, cinnamon, nutmeg or pumpkin pie spice. 2  Place on lightly sprayed pan in a hot 450°F oven for about 20 minutes. 1 Make sweet potato fries. 2  Peel & cut the sweet potatoes then mix with a little olive oil and a sprinkle of any or all of these: sugar, salt, cinnamon, nutmeg or pumpkin pie spice. 3  Place on lightly sprayed pan in a hot 450°F oven for about 20 minutes. 4  Peel, cut and boil your sweet potatoes until soft"}, {"url": "http://www.foodista.com/question/DWZ3XTRT/how-long-do-cooked-sweet-potatoes-last-in-the-refrigerator", "passage_text": "Freeze for later use or store the sweet potatoes in the refrigerator for 7 to 10 days. ... Cooking time will vary, depending on the number of sweet potatoes. ... Dip can be made as long as a day in advance, covered and refrigerated. ... "}]