[{"url": "http://enhs.umn.edu/current/5103_spring2003/mercury/merccharacter.html", "passage_text": "Elemental mercury is a heavy, silver-white liquid metal that can be found at trace levels in many minerals with greater concentrations in fossil fuels. There are three forms of mercury in the environment: elemental, inorganic, and organic mercury. All forms of mercury are toxic. www.epa.state.oh.us/opp/ pq/fall98/merc498.html. Elemental mercury occurs naturally in three valence states: elemental (Hg0), monovalent-mercurous (Hg1+), and the divalent mercuric (Hg2+). Elemental mercury is the most stable form and is only slightly water-soluble"}, {"url": "http://chemistry.about.com/od/mercury/a/10-Mercury-Facts.htm", "passage_text": "1 Mercury is a very rare element in the Earth's crust. 2  It accounts for only about only 0.08 parts per million (ppm). 3  Mercury generally is not allowed on aircraft because it combines so readily with aluminum, a metal that is common on aircraft. 1 The modern element symbol for mercury is Hg, which is the symbol for another name for mercury: hydrargyrum. 2  Hydrargyrum comes from Greek words for water-silver (hydr-means water, argyros means silver). 3  Mercury is a very rare element in the Earth's crust. 4"}, {"url": "http://www.chemicool.com/elements/mercury.html", "passage_text": "Harmful effects: Mercury and most of its compounds are highly toxic. The pure metal is absorbed easily by inhalation, ingestion or through the skin. It is also a chronic pollutant and mercury concentrates in animal/fish tissues in increasing amounts up the food chain. It is the only common metal that is liquid at room temperature. Mercury evaporates slowly at room temperature. Others metals that are liquid near room temperature are gallium, francium and cesium. The metal is relatively stable in dry air, but in moist air tarnishes slowly to form a gray oxide coating."}, {"url": "https://en.wikipedia.org/wiki/Mercury_%28element%29", "passage_text": "Mercury occurs in deposits throughout the world mostly as cinnabar (mercuric sulfide). The red pigment vermilion, a pure form of mercuric sulfide, is mostly obtained by reaction of mercury (produced by reduction from cinnabar) with sulfur. Mercury(II) oxide, the main oxide of mercury, arises when the metal is exposed to air for long periods at elevated temperatures. It reverts to the elements upon heating near 400 °C, as was demonstrated by Joseph Priestley in an early synthesis of pure oxygen."}, {"url": "http://www.chemistryexplained.com/elements/L-P/Mercury.html", "passage_text": "Overview. Mercury is a transition metal. A transition metal is one of the elements found between Groups 2 (IIA) and 13 (IIIA) on the periodic table. The periodic table is a chart that shows how chemical elements are related to one another. Mercury has long been known as quicksilver, because it is a silver liquid. Mercury is the only liquid metal. In fact, there is only one other liquid element, bromine. Bromine is a non-metal. Mercury can be frozen (changed into a solid) at a temperature of –38.85°C (–37.93°F). It can be changed into a gas (boiled) at 365.6°C (690.1°F). Its density is 13.59 grams per cubic centimeter."}, {"url": "http://www.buzzle.com/articles/mercury-element-facts.html", "passage_text": "Here are some facts about the physical properties of mercury. ► ► Mercury is a silvery-white metal, with a shining appearance. It is highly reflective, and moves at the slightest touch. ► ► The unique physical properties of the element is a result of the two electrons in its outermost shell. "}, {"url": "http://www.rsc.org/periodic-table/element/80/mercury", "passage_text": "Elements and Periodic Table History. Cinnabar (aka vermilion, mercury sulfide, HgS), was used as a bright red pigment by the Palaeolithic painters of 30,000 years ago to decorate caves in Spain and France. Mercury easily forms alloys, called amalgams, with other metals such as gold, silver and tin. The ease with which it amalgamates with gold made it useful in recovering gold from its ores. Mercury amalgams were also used in dental fillings."}, {"url": "http://www.dartmouth.edu/~toxmetal/mercury/history.html", "passage_text": "Speed and mobility were characteristics of the Roman god, Mercury, who served as a messenger to all the other gods and shared his name with the planet nearest the sun. The symbol for the planet was used by the alchemists to identify mercury before it was given its more modern chemical notation. "}, {"url": "https://en.wikipedia.org/wiki/Mercury_%28element%29", "passage_text": "A heavy, silvery d-block element, mercury is the only metallic element that is liquid at standard conditions for temperature and pressure; the only other element that is liquid under these conditions is bromine, though metals such as caesium, gallium, and rubidium melt just above room temperature. Mercury(II) oxide, the main oxide of mercury, arises when the metal is exposed to air for long periods at elevated temperatures. It reverts to the elements upon heating near 400 °C, as was demonstrated by Joseph Priestley in an early synthesis of pure oxygen."}]