[{"url": "http://www.samueladams.com/craft-beers", "passage_text": "That vision and unwavering commitment to quality was rewarded though, just six weeks after Jim started the business, Samuel Adams Boston Lager was named Best Beer in America award at the Great American Beer Festival. "}, {"url": "https://en.wikipedia.org/wiki/Samuel_Adams_(beer)", "passage_text": "Samuel Adams is the brand name for beers produced by the Boston Beer Company (NYSE: SAM) and its associated contract brewers. In March 1985, the beer was re-introduced as Samuel Adams Boston Lager, at the re-creation of the first battle of the American Revolution on Patriot's Day."}, {"url": "http://www.fool.com/investing/general/2013/03/24/is-boston-beer-one-of-the-best-companies-in-americ.aspx", "passage_text": "In 1984, Jim Koch gave up a consulting career to brew beer in his kitchen from an old family recipe. He named his beer Samuel Adams, and the Boston Beer Company was born. From that first batch in the kitchen, Boston Beer has grown to become a $1.8 billion company. The popularity of Sam Adams was a big factor in the emergence of small, high-quality craft breweries in recent decades. Boston Beer is undoubtedly a cool place to work, what with the company's entrepreneurial culture and focus on hip craft beers. The Boston Globe also recognized Boston Beer as having the region's greatest perk: Employees get to take home two cases of their favorite Boston Beer offering every month."}, {"url": "http://www.forbes.com/companies/boston-beer/", "passage_text": "The company's products are marketed through the brand names, including Samuel Adams, Sam Adams Light, Twisted Tea and HardCore. Boston Beer was founded by C. James Koch in 1984 and is headquartered in Boston, MA. "}, {"url": "https://en.wikipedia.org/wiki/Samuel_Adams_(beer)", "passage_text": "The Samuel Adams brand began in 1984 with Samuel Adams Lager, a 4.8% abv amber or Vienna lager. Jim Koch, the sixth-generation, first-born son to follow in his family's brewing footsteps, brewed his first batch of the beer in his kitchen, using the original family recipe for Louis Koch Lager. In March 1985, the beer was re-introduced as Samuel Adams Boston Lager, at the re-creation of the first battle of the American Revolution on Patriot's Day."}, {"url": "http://marketrealist.com/2013/12/boston-beer-company-introduction-better-beer-business/", "passage_text": "Boston Beer Company Inc. (SAM) is the largest craft brewer in the United States, having sold ~2.7 million barrels of proprietary core brand products and brewed or packaged approximately 19,000 barrels under contract (“non-core brands”) for third parties in 2012. Boston Beer’s positioning. Unlike Anheuser-Busch Inbev and MillerCoors LLC—a joint venture between SABMiller (SBMRY) and Molson Coors Brewing Company (TAP)—Boston Beer Company primarily positions itself in the “Better Beer” category of the beer industry—about 22% of U.S. beer consumption by volume."}, {"url": "http://www.marketwatch.com/investing/stock/SAM/profile", "passage_text": "The company's products are marketed through the brand names, including Samuel Adams, Sam Adams Light, Twisted Tea and HardCore. Boston Beer was founded by C. James Koch in 1984 and is headquartered in Boston, MA. Company Description. Boston Beer Co., Inc. engages in the business of producing and selling alcoholic beverages. It produces malt beverages and hard cider products at company-owned breweries and under contract arrangements at other brewery locations."}, {"url": "https://en.wikipedia.org/wiki/Boston_Beer_Company", "passage_text": "The Samuel Adams brand began in 1984 with Samuel Adams Lager, a 4.8% abv amber or Vienna lager. Jim Koch, the sixth-generation, first-born son to follow in his family's brewing footsteps, brewed his first batch of the beer in his kitchen, using the original family recipe for Louis Koch Lager. Samuel Adams is the brand name for beers produced by the Boston Beer Company (NYSE: SAM) and its associated contract brewers."}, {"url": "http://www.bostonbeer.com/", "passage_text": "The Boston Beer Company began in 1984 with a generations-old family recipe that Founder and Brewer Jim Koch uncovered in his father’s attic and brought to life in his kitchen. Today, at Boston Beer, we brew more than 60 styles of Samuel Adams beer. We relentlessly pursue the development of new styles and the perfection of classic beers by searching the world for the finest ingredients."}]