[{"url": "https://en.wikipedia.org/wiki/Currency_future", "passage_text": "Typically, one of the currencies is the US dollar. The price of a future is then in terms of US dollars per unit of other currency. This can be different from the standard way of quoting in the spot foreign exchange markets. The trade unit of each contract is then a certain amount of other currency, for instance €125,000."}, {"url": "http://www.easy-forex.com/int/futurestrading/", "passage_text": "Futures trading in the Forex market is buying or selling a currency pair on a date in the future for a price that has been agreed before the trade. The date for closing the deal is called the delivery date. On this date, final settlement is made and the deal is completed. - In option trading, you can decide if you want to buy or sell when the time arrives. You are able to decide against completing the deal if that is what you choose. - In futures trading, you have already agreed to make the deal in the future. You cannot withdraw."}, {"url": "http://www.easy-forex.com/int/futurestrading/", "passage_text": "Futures trading is different from option trading. - In option trading, you can decide if you want to buy or sell when the time arrives. You are able to decide against completing the deal if that is what you choose. - In futures trading, you have already agreed to make the deal in the future. You cannot withdraw."}, {"url": "http://www.investopedia.com/terms/c/currencyfuture.asp", "passage_text": "With currency futures, the price is determined when the contract is signed, just as it is in the forex market, only and the currency pair is exchanged on the delivery date, which is usually some time in the distant future. A transferable futures contract that specifies the price at which a currency can be bought or sold at a future date. Currency future contracts allow investors to hedge against foreign exchange risk."}, {"url": "http://www.babypips.com/school/preschool/why-trade-forex/forex-vs-futures.html", "passage_text": "Liquidity. In the forex market, $5.3 trillion is traded daily, making it the largest and most liquid market in the world. This market can absorb trading volume and transaction sizes that dwarf the capacity of any other market. The futures market trades a puny $30 billion per day. "}, {"url": "https://en.wikipedia.org/wiki/Currency_future", "passage_text": "From Wikipedia, the free encyclopedia. A currency future, also FX future or foreign exchange future, is a futures contract to exchange one currency for another at a specified date in the future at a price (exchange rate) that is fixed on the purchase date; see Foreign exchange derivative. The price of a future is then in terms of US dollars per unit of other currency. This can be different from the standard way of quoting in the spot foreign exchange markets. The trade unit of each contract is then a certain amount of other currency, for instance €125,000."}, {"url": "http://4x-dynamicautotrader.com/forex.asp", "passage_text": "Forex or Foreign Exchange is the largest capital market in the world, where currencies of all nations and countries are freely traded by the world's largest banks, institutional investors, investment speculators, but more importantly -- also by people like you and me. Unlike the stock market, the Forex market is open non-stop, 24 hours a day, 5 days a week, and consequently its size and volume of trades literally dwarfs the size of the stock market."}, {"url": "http://www.fxcm.com/", "passage_text": "Forex is the market where all the world's currencies trade. The forex market is the largest, most liquid market in the world with an average daily trading volume exceeding $1.9 trillion. "}, {"url": "http://www.investopedia.com/university/forexmarket/forex1.asp", "passage_text": "The need to exchange currencies is the primary reason why the forex market is the largest, most liquid financial market in the world. It dwarfs other markets in size, even the stock market, with an average traded value of around U.S. $2,000 billion per day. When people refer to the forex market, they usually are referring to the spot market. The forwards and futures markets tend to be more popular with companies that need to hedge their foreign exchange risks out to a specific date in the future."}, {"url": "https://en.wikipedia.org/wiki/Foreign_exchange_market", "passage_text": "The foreign exchange market (forex, FX, or currency market) is a global decentralized market for the trading of currencies. This includes all aspects of buying, selling and exchanging currencies at current or determined prices. Individual retail speculative traders constitute a growing segment of this market with the advent of retail foreign exchange trading, both in size and importance. Currently, they participate indirectly through brokers or banks."}]