[{"url": "https://en.wikipedia.org/wiki/Dextroamphetamine", "passage_text": "Dextroamphetamine is used to treat attention deficit hyperactivity disorder (ADHD) and narcolepsy (a sleep disorder), and is sometimes prescribed off-label for its past medical indications, such as depression, obesity, and nasal congestion. Dextroamphetamine is the more active dextrorotatory, or right-handed, enantiomer of the amphetamine molecule. Pharmaceutical dextroamphetamine sulfate is available as both a brand name and generic drug in a variety of dosage forms."}, {"url": "https://www.patientslikeme.com/treatments/show/11926-damphetamine-salt-combo-side-effects-and-efficacy?brand=t", "passage_text": "Amphetamine and dextroamphetamine is used to treat narcolepsy and attention deficit hyperactivity disorder (ADHD). Amphetamine and dextroamphetamine may also be used for other purposes not listed in this medication guide. Do not use this medication if you are allergic to amphetamine and dextroamphetamine, or if you have hardened arteries (arteriosclerosis), heart disease, moderate to severe high blood pressure (hypertension), overactive thyroid, glaucoma, severe anxiety or agitation, or a history of drug or alcohol addiction."}, {"url": "https://www.patientslikeme.com/treatments/show/11926-damphetamine-salt-combo-side-effects-and-efficacy?brand=t", "passage_text": "Generic Name: Amphetamine-Dextroamphetamine. D-amphetamine Salt Combo is a combination of dextroamphetamine and amphetamine, stimulants used for Attention-deficit/hyperactivity disorder (ADHD) and for narcolepsy. Do not use this medication if you are allergic to amphetamine and dextroamphetamine, or if you have hardened arteries (arteriosclerosis), heart disease, moderate to severe high blood pressure (hypertension), overactive thyroid, glaucoma, severe anxiety or agitation, or a history of drug or alcohol addiction."}, {"url": "http://www.medicinenet.com/amphetamine_and_dextroamphetamine/article.htm", "passage_text": "DRUG CLASS AND MECHANISM: Adderall contains amphetamine salts (amphetamine and dextroamphetamine) and is used for treating attention-deficit hyperactivity disorder (ADHD) and narcolepsy. Amphetamines stimulate the brain by increasing the level of neurotransmitters, dopamine and norepinephrine, in the brain. "}, {"url": "http://sleep.emedtv.com/dextroamphetamine/dextroamphetamine.html", "passage_text": "Potential side effects include loss of appetite, restlessness, and dry mouth. Dextroamphetamine sulfate (Dexedrine ®) is a prescription medication that is used for the treatment of attention deficit hyperactivity disorder (ADHD). It is also used to treat narcolepsy. The medication comes in two forms: tablets and extended-release capsules"}, {"url": "http://amphetamines.com/types/dextroamphetamine/", "passage_text": "Dextroamphetamine is a psychostimulant drug that is approved by the Food and Drug Administration for the treatment of Attention deficit-hyperactivity disorder (ADHD) and narcolepsy. The drug is available as a generic drug called Dextroamphetamine or under various brand names such as Dexedrine or Dextrostat. The dextroamphetamine salts constitute about 75% of the ADHD drug known as Adderall and is the active metabolite of the drug lisdexamfetamine also known by the brand name Vyvanse."}, {"url": "http://adhd.emedtv.com/dexedrine/dexedrine.html", "passage_text": "Dexedrine is often prescribed to treat attention deficit hyperactivity disorder and narcolepsy. Advertisement. Dexedrine ® (dextroamphetamine sulfate) is a prescription medication that is used for the treatment of attention deficit hyperactivity disorder (ADHD). It is also used to treat narcolepsy. Although the medication is a stimulant, it can cause a calming effect when used in the proper doses to treat ADHD"}, {"url": "http://sleep.emedtv.com/dextroamphetamine/dextroamphetamine.html", "passage_text": "Dextroamphetamine is commonly prescribed to treat children and teenagers with attention deficit hyperactivity disorder. Dextroamphetamine sulfate (Dexedrine ®) is a prescription medication that is used for the treatment of attention deficit hyperactivity disorder (ADHD). It is also used to treat narcolepsy. The medication comes in two forms: tablets and extended-release capsules"}, {"url": "http://www.mayoclinic.org/drugs-supplements/dextroamphetamine-oral-route/description/DRG-20071795", "passage_text": "Dextroamphetamine is used to treat attention-deficit hyperactivity disorder (ADHD) and narcolepsy (uncontrollable desire for sleep or a sudden attack of deep sleep). It belongs to the group of medicines called central nervous system (CNS) stimulants. "}]