[{"url": "http://www.rjseo.com/Bankruptcy-Blog/2014/May/How-Long-do-I-have-to-Wait-to-File-Bankruptcy-Ag.aspx", "passage_text": "Chapter 13 Bankruptcy-If you have received a discharge in a previous Chapter 7 Bankruptcy, then you must wait 4 years from the date you filed your previous Chapter 7 Bankruptcy to file and a receive a discharge in a Chapter 13 Bankruptcy. You can file for bankruptcy twice or even three times, even if you have received a discharge. The key is that you will often have to wait a certain period after you have filed and have received a discharge, to file for bankruptcy again and get a full"}, {"url": "http://www.alllaw.com/articles/nolo/bankruptcy/file-income-taxes-before-after-bankruptcy.html", "passage_text": "If you are planning to file for Chapter 7 bankruptcy, when you file your taxes can make a big difference in whether you get to keep your refund. In general, whether you can keep your tax refund in Chapter 7 bankruptcy depends on: 1  the amount of your refund. 2  your bankruptcy exemptions, and. 3  when you file your case. "}, {"url": "http://www.nolo.com/legal-encyclopedia/file-bankruptcy-or-wait-29955.html", "passage_text": "You may have property that you would lose in a Chapter 7 bankruptcy if you file now, but that you could keep if you wait -- or at least have time to sell and use the proceeds. For example: 1  Assume you are expecting a tax refund of $4,000. If You Anticipate Having New Debts Soon. It's a good idea to hold off on filing for bankruptcy if you foresee other significant expenses in the near future. As a general rule, Chapter 7 bankruptcy only erases debts you have as of your filing date."}, {"url": "http://www.thebankruptcysite.org/resources/bankruptcy/bankruptcy-planning/timing-your-bankruptcy-fil", "passage_text": "When you file bankruptcy, you must complete a means test. The bankruptcy means test is a form that uses your income over the past six months to determine a number of important issues, such as whether you qualify for Chapter 7, how long your Chapter 13 plan must be and how much you must pay into the Chapter 13 plan. She should wait at least 90 days before filing bankruptcy or the credit card company will try to make the debt nondischargeable. Example. Gary needs cash, so he takes cash advances from his credit card-he takes one advance of $500 and then another advance the following week of $900."}, {"url": "http://www.nolo.com/legal-encyclopedia/i-just-put-big-charges-credit-card-should-i-wait-file-bankruptcy.html", "passage_text": "Charges for luxury items within 90 days of bankruptcy. If you charge more than $650 on a single credit card for luxury goods or services within the 90-day period prior to filing your bankruptcy, those charges are presumed to be nondischargeable. If you put large charges on your credit card shortly before filing for bankruptcy, your credit card company may argue that the charges should not be wiped out by your bankruptcy discharge."}, {"url": "http://www.nolo.com/legal-encyclopedia/file-bankruptcy-or-wait-29955.html", "passage_text": "If you wait two months to file, your six-month average gross income will drop from $8,000 to less than $5,900 a month, which will bring you into eligibility for Chapter 7 bankruptcy in most states. If You Anticipate Having New Debts Soon. It's a good idea to hold off on filing for bankruptcy if you foresee other significant expenses in the near future. As a general rule, Chapter 7 bankruptcy only erases debts you have as of your filing date."}, {"url": "http://www.nolo.com/legal-encyclopedia/file-bankruptcy-or-wait-29955.html", "passage_text": "1 If you wait a few months to file, the property could sufficiently depreciate in value to fall within a property exemption. 2  For instance, say you own a car worth $6,000 but your state exemption laws allow you to keep a car with a value only up to $5,500. If You Anticipate Having New Debts Soon. It's a good idea to hold off on filing for bankruptcy if you foresee other significant expenses in the near future. As a general rule, Chapter 7 bankruptcy only erases debts you have as of your filing date."}, {"url": "http://bankruptcy.justia.com/articles/should-i-file-bankruptcy-now-or-wait-82", "passage_text": "You may have property that you would lose in a Chapter 7 bankruptcy if you file now, but that you could keep if you wait -- or at least have time to sell and use the proceeds. For example: 1  Assume you are expecting a tax refund of $4,000. "}, {"url": "http://www.bankruptcylawnetwork.com/2-4-6-8-how-long-must-i-wait-to-file-bankruptcy/", "passage_text": "The Six Year Rule. You must wait 6 years between the filing of a previous Chapter 12 or 13 case and a new Chapter 7 case. Unlike the previous sections this is important because you don’t file a Chapter 7 unless you are looking for a discharge. Now as with everything Congress does, there are exceptions. You must wait 8 years between Chapter 7 cases. The previous rule was six years, but has been extended to 8 years in 2005. However, this may be the time to consider a Chapter 13 as there are many hidden benefits to a budget plan than you might think."}, {"url": "http://www.rjseo.com/Bankruptcy-Blog/2014/May/How-Long-do-I-have-to-Wait-to-File-Bankruptcy-Ag.aspx", "passage_text": "AFTER YOU HAVE RECEIVED DISCHARGE IN CHAPTER 13 BANKRUPTCY. Chapter 7 Bankruptcy-If you have received a discharge in a previous Chapter 13 Bankruptcy, then you must wait 6 years from the date of filing your Chapter 13 bankruptcy to receive a full discharge. You can file for bankruptcy twice or even three times, even if you have received a discharge. The key is that you will often have to wait a certain period after you have filed and have received a discharge, to file for bankruptcy again and get"}]