[{"url": "https://answers.yahoo.com/question/index?qid=20090618043941AAZGmDf", "passage_text": "Best Answer: It depends on the type of tumor, grade, location and size of the tumor(s). Meningiomas typically are slow growing and need about 15-20 years to grow to any size before they start causing problems (headaches ususally being the first). How long can some one go with a brain tumor without knowing b4 they die? yeah just wondering how long u could go if u had brain tumor, and u didn't get it checked."}, {"url": "https://answers.yahoo.com/question/index?qid=20090618043941AAZGmDf", "passage_text": "So no one knows how long you can live with a brain tumor. They start out small and may be very slow growing and the person doesn't even know it until it get bigger and starts causing problem. If you know you have a tumor and don't do anything about it, you will suffer terrible pain. How long can some one go with a brain tumor without knowing b4 they die? yeah just wondering how long u could go if u had brain tumor, and u didn't get it checked."}, {"url": "http://abc30.com/health/brain-tumor-cath-glioblastoma-gps/898088/", "passage_text": "The survival rate for a type of brain cancer called glioblastoma is about 10 percent over a five year period. By Margot Kim. The survival rate for a type of brain cancer called glioblastoma is about 10 percent over a five year period. External beam radiation treatment has always been challenging because the beams must pass through healthy tissue. Now, a new method of increasing radiation to the tumor is showing promise."}, {"url": "http://www.rocketswag.com/anatomy/cancer/Brain-Tumor-Early-Symptoms.html", "passage_text": "Brain tumor symptoms primarily depend on size of the tumor and the location of the tumor. However, the most common symptoms include seizures, epilepsy, fatigue, bowel irregularities, recurring headache, nausea and vomiting. Brain tumor can be described as an abnormal and uncontrolled division of cells resulting in the formation of intracranial tumors in the brain or other parts such as cranial nerves, skull, pituitary gland, pineal gland and cranial nerves. Brain tumors are either benign or might undergo metastasis."}, {"url": "http://www.cancer-forums.net/how-long-can-a-stage-iv-brain-tumour-go-undetected-before-it-kills-you-t114372.html", "passage_text": "For one there is no stage IV brain cancer. Two, brain cancer does not spread to other parts of the body. A stage IV brain tumor means it came from somewhere else in the body. A grade IV brain tumor means it is a brain primary. How long someone has cancer before it is diagnosed varies from person to person and the kind of cancer they have as does the time from diagnosis to death. People don’t drop dead from cancer and not know they have it"}, {"url": "http://www.cancer-forums.net/how-many-years-can-someone-go-with-having-cancer-undetected-t3148.html", "passage_text": "It depends on the tumor how long it takes to notice symptoms. That is why it is so important to go for your screenings! This is a tough question. We don't always know how long cancer tumors have been developing. However, how long these take to appear really depends on the type of cancer. For example, some types of lymphoma grow really fast (in a few months), but others take years to spread."}, {"url": "http://www.rocketswag.com/anatomy/cancer/Brain-Tumor-Early-Symptoms.html", "passage_text": "Brain tumors are one of the leading causes of cancer deaths in the world. Brain tumors can go undetected for several years. However, brain tumor symptoms usually surface only when the tumor swells abnormally, thus damaging the surrounding tissue. Symptoms can also arise due to formation of hydrocephalus where the flow of cerebrospinal fluid is blocked. Brain tumor can be described as an abnormal and uncontrolled division of cells resulting in the formation of intracranial tumors in the brain or other parts such as cranial nerves, skull, pituitary gland, pineal gland and cranial nerves. Brain tumors are either benign or might undergo metastasis."}, {"url": "http://www.cancer-forums.net/how-many-years-can-someone-go-with-having-cancer-undetected-t3148.html", "passage_text": "Breast cancer takes about 2 years before it is large enough to be seen on mammogram, so it could take 3-4 years before a lump is felt depending on the location. I’m not sure how long one can have lymphoma before symptoms occur, but it will often respond to antibiotics and appear to be an infection at first. However, how long these take to appear really depends on the type of cancer. For example, some types of lymphoma grow really fast (in a few months), but others take years to spread."}, {"url": "http://www.cancer-forums.net/how-many-years-can-someone-go-with-having-cancer-undetected-t3148.html", "passage_text": "Depending on the size of the tumor or how fast it grows. Normally, there are no outward symptoms of breast cancer nor pain. doing self exams around 40 yrs old or starting at 35 is normal. Mammograms usually depend on family history. If you have a strong history, the Dr will recommend a mammogram starting at age 35. However, how long these take to appear really depends on the type of cancer. For example, some types of lymphoma grow really fast (in a few months), but others take years to spread."}, {"url": "https://answers.yahoo.com/question/index?qid=20090618043941AAZGmDf", "passage_text": "RE: how long can some one go with a brain tumor without knowing b4 they die? yeah just wondering how long u could go if u had brain tumor, and u didn&#39;t get it checked. How long can some one go with a brain tumor without knowing b4 they die? yeah just wondering how long u could go if u had brain tumor, and u didn'"}]