[{"url": "http://www.glaucoma.org/gleams/high-eye-pressure-and-glaucoma.php", "passage_text": "Glaucoma is a multi-factorial, complex eye disease with specific characteristics such as optic nerve damage and visual field loss. While increased pressure inside the eye (called intraocular pressure or IOP) is usually present, even patients with normal range IOP can develop glaucoma. When the IOP is higher than normal but the person does not show signs of glaucoma, this is referred to as ocular hypertension. High eye pressure alone does not cause glaucoma. However, it is a significant risk factor."}, {"url": "http://www.webmd.com/eye-health/occular-hypertension?print=true", "passage_text": "The term ocular hypertension usually refers to any situation in which the pressure inside the eye, called intraocular pressure, is higher than normal. Eye pressure is measured in millimeters of mercury (mm Hg). Normal eye pressure ranges from 10-21 mm Hg. Ocular hypertension is an eye pressure of greater than 21 mm Hg. "}, {"url": "http://www.ophthobook.com/questions/question-whats-a-normal-eye-pressure", "passage_text": "Glaucoma is usually high pressure inside the eye that damages the optic nerve and can result in permanent vision loss. Normal-tension glaucoma (also called low-tension glaucoma) is a unique condition in which optic nerve damage and vision loss have occurred despite a normal pressure inside the eye. "}, {"url": "http://www.emedicinehealth.com/glaucoma_faqs/page9_em.htm", "passage_text": "Eye pressure is measured in millimeters of mercury (mm Hg). Normal eye pressure ranges from 10 to 21 mm Hg. When a person's pressure is higher than 21 mm Hg, they are at an increased risk for developing glaucoma. Some people can tolerate pressures slightly higher than normal without developing glaucoma"}, {"url": "http://www.emedicinehealth.com/ocular_hypertension/article_em.htm", "passage_text": "The term ocular hypertension usually refers to any situation in which the pressure inside the eye, called intraocular pressure, is higher than normal. Eye pressure is measured in millimeters of mercury (mm Hg). Normal eye pressure ranges from 10-21 mm Hg. "}, {"url": "http://www.glaucoma.org/gleams/high-eye-pressure-and-glaucoma.php", "passage_text": "Measuring Eye Pressure. Eye pressure is measured in millimeters of mercury (mm Hg). Normal eye pressure ranges from 12-22 mm Hg, and eye pressure of greater than 22 mm Hg is considered higher than normal. When the IOP is higher than normal but the person does not show signs of glaucoma, this is referred to as ocular hypertension. High eye pressure alone does not cause glaucoma. However, it is a significant risk factor."}, {"url": "https://nei.nih.gov/glaucoma/content/english/know2", "passage_text": "Not necessarily. Increased eye pressure means you are at risk for glaucoma, but does not mean you have the disease. A person has glaucoma only if the optic nerve is damaged. If you have increased eye pressure but no damage to the optic nerve, you do not have glaucoma. However, you are at risk"}, {"url": "https://en.wikipedia.org/wiki/Intraocular_pressure", "passage_text": "Intraocular pressure (IOP) is the fluid pressure inside the eye. Tonometry is the method eye care professionals use to determine this. IOP is an important aspect in the evaluation of patients at risk from glaucoma. Most tonometers are calibrated to measure pressure in millimeters of mercury (mmHg). Intraocular pressure is mainly determined by the coupling of the production of aqueous humor and the drainage of aqueous humor mainly through the trabecular meshwork located in the anterior chamber angle."}, {"url": "http://www.glaucoma.org/q-a/what-is-considered-normal-pressure.php", "passage_text": "Normal intraocular pressures average between 12-22 mm Hg. The “mm Hg” refers to millimeters of mercury, which is a scale for recording the eye pressure. Eye pressure can vary hourly, daily and weekly. Many factors can affect the up and down changes in a person's intraocular pressure. "}]