[{"url": "http://www.babycenter.com/0_the-chicken-pox-vaccine_1725.bc", "passage_text": "Varicella is a live-attenuated vaccine. This means it's a live virus that's been weakened so that it's unlikely to cause the disease. Instead, the virus will replicate in the cells of the body and cause the body to produce an immune response, which should protect against a real chicken pox infection. 1 Chicken pox can be serious and even deadly. 2  Before the vaccine, chicken pox caused an average of 10,600 hospitalizations and 100 to 150 deaths a year in the United States. 3  Complications included pneumonia and severe skin infections, and most deaths occurred in previously healthy people."}, {"url": "https://en.wikipedia.org/wiki/Varicella_vaccine", "passage_text": "The chickenpox vaccine was developed in 1995. The varicella vaccine is marketed as Varivax in the U.S. by Merck and globally as Varilrix by GlaxoSmithKline. It is on the World Health Organization's List of Essential Medicines, a list of the most important medication needed in a basic health system"}, {"url": "http://www.nhs.uk/conditions/vaccinations/pages/chickenpox-vaccine.aspx", "passage_text": "The vaccine is given as two separate injections, usually into the upper arm, four to eight weeks apart. The chickenpox (varicella) vaccine protects against the varicella zoster virus that causes chickenpox. The chickenpox vaccine is not part of the routine childhood vaccination schedule. How the chickenpox vaccine works. The chickenpox vaccine is a live vaccine and contains a small amount of weakened varicella zoster virus. The vaccine causes your immune system to produce antibodies that will help protect against"}, {"url": "http://www.webmd.com/children/vaccines/chickenpox-varicella-vaccine", "passage_text": "Although the virus in the chickenpox vaccine is generally incapable of causing a disease, it still stimulates a response from the body's immune system. That response is what gives someone who's had a shot for chickenpox immunity or protection from the illness. Before the varicella vaccine was licensed in the U.S. in 1995, there were approximately 100 deaths and more than 11,000 hospitalizations a year from chickenpox. The risk of serious, life-threatening complications is greatest among infants, adults, and people with weakened immune system"}, {"url": "http://www.cdc.gov/vaccines/pubs/pinkbook/varicella.html", "passage_text": "Exposure to a person with either primary varicella (chickenpox) or herpes zoster does not cause zoster in the exposed person. Herpes zoster vaccine has no role in the postexposure management of either chickenpox or zoster and should not be used for this purpose. Varicella is an acute infectious disease caused by varicella zoster virus (VZV). The recurrent infection (herpes zoster, also known as shingles) has been recognized since ancient times. Primary varicella infection (chickenpox) was not reliably distinguished from smallpox until the end of the 19th century."}, {"url": "https://en.wikipedia.org/wiki/Varicella_vaccine", "passage_text": "Another vaccine that is known as zoster vaccine is simply a larger-than-normal dose of the same vaccine used against chickenpox, and is used in older adults to reduce the risk of shingles (also called herpes zoster) and postherpetic neuralgia, which are caused by the same virus. The varicella vaccine is marketed as Varivax in the U.S. by Merck and globally as Varilrix by GlaxoSmithKline."}, {"url": "https://en.wikipedia.org/wiki/Varicella_vaccine", "passage_text": "The varicella vaccine is a live (attenuated) virus administered to protect against the viral disease commonly known as chickenpox caused by the varicella zoster virus (VZV). The varicella vaccine is marketed as Varivax in the U.S. by Merck and globally as Varilrix by GlaxoSmithKline."}, {"url": "http://www.immunize.org/askexperts/experts_var.asp", "passage_text": "No. Serologic testing for varicella should be considered only for women who do not have evidence of immunity (reliable history of chickenpox or documented vaccination). Once a person has been found to be seropositive, it is not necessary to test again in the future. "}, {"url": "http://www.webmd.com/children/vaccines/chickenpox-varicella-vaccine", "passage_text": "The chickenpox vaccine is a shot that can protect nearly anyone who receives the vaccine from catching chickenpox. It's also called the varicella vaccine, because chickenpox is caused by the varicella-zoster virus. The vaccine is made from a live but weakened, or attenuated, virus. Before the varicella vaccine was licensed in the U.S. in 1995, there were approximately 100 deaths and more than 11,000 hospitalizations a year from chickenpox. The risk of serious, life-threatening complications is greatest among infants, adults, and people with weakened immune system"}]