[{"url": "http://science.nationalgeographic.com/science/archaeology/lost-city-petra/", "passage_text": "Petra, Jordan Photos. See a classic gallery of images from Petra, one of the seven wonders of the world, which is now at risk as more and more tourists flock to Jordan's ancient city of stone. Located amid rugged desert canyons and mountains in what is now the southwestern corner of the Hashemite Kingdom of Jordan, Petra was once a thriving trading center and the capital of the Nabataean empire between 400 B.C. and A.D. 106."}, {"url": "http://eilat-petra.com/where-is-petra/", "passage_text": "Where is Petra. The ancient city of Petra is in the Hashamite Kingdom of Jordan – the country of Jordan – in the Middle East. Jordan is bordered by Saudi Arabia, Syria, Iraq and to the west Jordan shares a border with Israel. Petra is in the southwest corner of Jordan about 80-100km east of the Israeli border and the Dead Sea which the two countries share. Petra is in the Jordanian region or governorate of Ma’an which lies east of Amman, Jordan’s capital city. Petra is situated on the side of Mount Hor which forms part of the eastern side of Wadi Araba a valley between the Gulf of Aqaba and the Dead Sea."}, {"url": "http://www.allaboutarchaeology.org/petra.htm", "passage_text": "Petra, also known by the ancient name of Rekem, is identified as the capitol of the ancient Nabataean people. They were an ancient Semitic, people of southern Jordan, Canaan, and the northern part of Arabia. Petra lies about 4 hours south of today s modern city of Amman, Jordan. "}, {"url": "https://en.wikipedia.org/wiki/Petra", "passage_text": "Petra (Arabic: البترا, Al-Batrāʾ; Ancient Greek: πέτρα) is a historical and archaeological city in the southern Jordanian governorate of Ma'an that is famous for its rock-cut architecture and water conduit system. Another name for Petra is the Rose City due to the color of the stone out of which it is carved. Established possibly as early as 312 BC as the capital city of the Nabataeans, it is a symbol of Jordan, as well as Jordan's most-visited tourist attraction. In ancient times, Petra might have been approached from the south on a track leading across the plain of Petra, around Jabal Haroun (Aaron's Mountain), where the Tomb of Aaron, said to be the burial-place of Aaron, brother of Moses, is located."}, {"url": "http://wikitravel.org/en/Petra", "passage_text": "Petra, the fabled rose red city, half as old as time, is a well known ancient Nabataean city in the south of Jordan. Due to its breathtaking grandeur and fabulous ruins, Petra was recognized as a World Heritage Site by UNESCO in 1985. "}, {"url": "http://www.tour-petra.com/tag/airport/", "passage_text": "Petra is located in the Edom mountains of south-western Jordan, 160 miles (257km) south-southwest from the capital of Amman, and about 50 miles (80km) north-northeast of Aqaba. Petra site it’s open daily from 6 AM till 6 PM The closest airports are Eilat (Israel) and Amman (Jordan). "}, {"url": "http://science.nationalgeographic.com/science/archaeology/lost-city-petra/", "passage_text": "In 1985, the Petra Archaeological Park was declared a UNESCO World Heritage site, and in 2007 it was named one of the new seven wonders of the world. Indiana Jones Location. Several scenes from the Hollywood blockbuster Indiana Jones and the Last Crusade were filmed in Petra. Located amid rugged desert canyons and mountains in what is now the southwestern corner of the Hashemite Kingdom of Jordan, Petra was once a thriving trading center and the capital of the Nabataean empire between 400 B.C. and A.D. 106."}, {"url": "http://www.livescience.com/23168-petra.html", "passage_text": "Located about 115 miles (185 km) southwest of Amman, Jordan, Petra was an ancient city that was literally carved into red desert cliffs. Its ornate ancient architecture and natural beauty attract people from all over the world. "}, {"url": "http://www.closestairportto.com/city/jordan/petra/", "passage_text": "The closest airport is Ovda International Airport (VDA). Distance from Ovda International Airport to Petra is 67,4 kilometers (41,9 miles). Ovda International Airport is located approximately 42,6 kilometers (26,5 miles) north of Eilat and about 46,6 kilometers (28,9 miles) north of Aqaba. Ovda International Airport IATA code is VDA. "}]