[{"url": "http://www.thefreedictionary.com/transduction", "passage_text": "Noun. 1. transduction - (genetics) the process of transfering genetic material from one cell to another by a plasmid or bacteriophage. genetic science, genetics-the branch of biology that studies heredity and variation in organisms. biological process, organic process-a process occurring in living organisms. transduction. n. 1. (Genetics) genetics the transfer by a bacteriophage of genetic material from one bacterium to another. [C17: from Latin transductiō, variant of trāductiō a leading along, from trādūcere to lead over; see traduce]."}, {"url": "http://www.audioenglish.org/dictionary/transduction.htm", "passage_text": "• TRANSDUCTION (noun). The noun TRANSDUCTION has 2 senses: 1. (genetics) the process of transfering genetic material from one cell to another by a plasmid or bacteriophage. 2. the process whereby a transducer accepts energy in one form and gives back related energy in a different form. Familiarity information: TRANSDUCTION used as a noun is rare. Dictionary entry details."}, {"url": "http://www.merriam-webster.com/dictionary/transduction", "passage_text": "Medical Definition of TRANSDUCTION. 1. : the action or process of converting something and especially energy or a message into another form. 2. : the transfer of genetic material from one organism (as a bacterium) to another by a genetic vector and especially a bacteriophage—compare transformation 2. Definition of TRANSDUCTION. : the action or process of transducing; especially: the transfer of genetic material from one microorganism to another by a viral agent (as a bacteriophage). — trans·duc·tant \\-tənt\\ noun. — trans·duc·tion·al \\-shnəl, -shə-nəl\\ adjective. ADVERTISEMENT."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=11936", "passage_text": "Signal transduction: A basic process in molecular cell biology involving the conversion of a signal from outside the cell to a functional change within the cell. "}, {"url": "https://en.wikipedia.org/wiki/Transduction_%28genetics%29", "passage_text": "Transduction. Transduction is the process by which DNA is transferred from one bacterium to another by a virus. It also refers to the process whereby foreign DNA is introduced into another cell via a viral vector. Generalized transduction is the process by which any bacterial gene may be transferred to another bacterium via a bacteriophage, and typically carries only bacterial DNA and no viral DNA. In essence, this is the packaging of bacterial DNA into a viral envelope."}, {"url": "http://www.bio-medicine.org/biology-dictionary/Transduction/", "passage_text": "This is a common tool... Transduction (biophysics) is the conveyance of energy from a donor electron to a ... Transduction (cybernetics) is a process or mechanism that converts signals from ... In biology, signal transduction refers to any process by which a cell converts ... File:Signal transduction publications graph.jpeg ..."}, {"url": "https://en.wikipedia.org/wiki/Transduction_%28genetics%29", "passage_text": "More generally, transduction is the process by which genetic material, e.g. DNA or siRNA, is inserted into a cell by a virus. Common techniques in molecular biology are the use of viral vectors (including bacteriophages), electroporation, or chemical reagents that increase cell permeability. Generalized transduction is the process by which any bacterial gene may be transferred to another bacterium via a bacteriophage, and typically carries only bacterial DNA and no viral DNA. In essence, this is the packaging of bacterial DNA into a viral envelope."}]