[{"url": "http://www.ctvnews.ca/canada/pipeline-primer-what-you-need-to-know-about-northern-gateway-1.1872482", "passage_text": "The federal government has announced a conditional approval of the Northern Gateway pipeline, which would link the Alberta oilsands to a port on the B.C. coast. Here's a brief primer on what you need to know about the pipeline. What: The Northern Gateway pipeline is a proposed 1,200 kilometre twin pipeline that would carry bitumen from the oilsands in Alberta to Kitimat, B.C. "}, {"url": "http://www.gatewayfacts.ca/about-the-project/project-overview/", "passage_text": "The $6.5 billion Northern Gateway Pipeline will provide access to new markets in the Pacific Rim. More than that, the pipeline will be a model of world-class safety and environmental standards. The pipeline’s route. A twin pipeline will run 1,177 km from Northern Alberta, through Northern British Columbia, to the deep-water port of Kitimat B.C. at the head of the Douglas Channel."}, {"url": "http://www.energybc.ca/issues/northerngateway.html", "passage_text": "The Northern Gateway project is a major petroleum pipeline project proposed by Enbridge Inc. to transport crude oil from Alberta's oil sands to a tanker port in Kitimat where it can be exported. "}, {"url": "https://en.wikipedia.org/wiki/Enbridge_Northern_Gateway_Pipelines", "passage_text": "The Enbridge Northern Gateway Pipelines is a project to build a twin pipeline from Bruderheim, Alberta to Kitimat, British Columbia. The eastbound pipeline would import natural gas condensate and the westbound pipeline would export diluted bitumen from the Athabasca oil sands to the marine terminal in Kitimat for transportation to the Asian markets by oil tankers."}, {"url": "http://www.enbridge.com/NorthernGatewayProject.aspx", "passage_text": "Northern Gateway Project. The Enbridge Northern Gateway Project involves a new twin pipeline system running from near Edmonton, Alberta, to a new marine terminal in Kitimat, British Columbia to export petroleum and import condensate. This multi-billion dollar project represents an exciting opportunity for northern BC and Alberta. "}, {"url": "https://en.wikipedia.org/wiki/Enbridge_Northern_Gateway_Pipelines", "passage_text": "Enbridge Northern Gateway submitted its project application to the National Energy Board on May 27, 2010. The eight-volume regulatory application will be assessed by a Joint Review Panel (JRP) established by the Canadian Environmental Assessment Agency (CEAA) and the National Energy Board (NEB). The eastbound pipeline would import natural gas condensate and the westbound pipeline would export diluted bitumen from the Athabasca oil sands to the marine terminal in Kitimat for transportation to the Asian markets by oil tankers."}, {"url": "http://www.steelheadsociety.org/sites/default/files/Enbridge%20Northern%20Gateway%20Pipeline%20Project%20Brief%20-%20SSBC.pdf", "passage_text": "Enbridge Northern Gateway Pipeline Project The Enbridge Northern Gateway project consists of two parallel pipelines between an inland terminal at Bruderheim, Alberta and a marine terminal near Kitimat, BC, each with a length of 1,177 kilometers (731 mi). "}, {"url": "http://www.cbc.ca/news/canada/northern-gateway-pipeline-project-6-things-to-know-1.2469561", "passage_text": "A protester holds a sign shaped like a whale during a November demonstration against the Enbridge Northern Gateway pipeline in Vancouver. An independent three-member panel from the National Energy Board is set to hand down its final report today on the project. (The Canadian Press). An independent three-member panel is set to hand down its final report today on the Enbridge Northern Gateway Project, a decision that will include recommendations to the federal government on whether the project should be approved."}, {"url": "http://globalnews.ca/news/1398896/northern-gateway-pipeline-project-where-is-support-strongest/", "passage_text": "Story continues below. READ MORE: Facts and figures on the Northern Gateway pipeline. Public opinion isn’t inconsequential: 2015 is a federal election year, which means the pipeline could be top of mind for many voters as they fill out their ballots. Various polls suggest Stephen Harper’s government has the most to lose in B.C. "}]