[{"url": "http://oilypedia.com/where-does-palm-oil-come-from-all-about-palm-oil-production/", "passage_text": "Palm oil is extracted from the pulp of the oil palm fruit. The plantations are located in South America, New Guinea, Ghana, Indonesia and Malaysia. Oil palm is extremely productive and gives much greater yield than other crops, like sunflower or rapeseed. In addition, the prices for this oil are relatively low as the labor cost is low as well. Deforestation caused by palm oil. Since the demand for palm oil is really high, more and more plantations are needed and therefore it requires more land. This problem is especially serious in Indonesia and Malaysia. For example, there has been a major tropical forest cleaning in Indonesian national parks."}, {"url": "http://www.wwf.org.au/our_work/saving_the_natural_world/forests/palm_oil/", "passage_text": "Palm oil is an edible vegetable oil, high in saturated fats, derived from the fruit of the oil palm tree. The palm fruit yields two distinct oils – palm oil and palm kernel oil. Palm oil is extracted from the pulp of the fruit, is edible and used primarily in food products."}, {"url": "https://en.wikipedia.org/wiki/Palm_oil", "passage_text": "Palm oil is naturally reddish in color because of a high beta-carotene content. It is not to be confused with palm kernel oil derived from the kernel of the same fruit, or coconut oil derived from the kernel of the coconut palm (Cocos nucifera). Along with coconut oil, palm oil is one of the few highly saturated vegetable fats and is semi-solid at room temperature. Like most plant-based products, palm oil contains very little cholesterol. Palm oil is a common cooking ingredient in the tropical belt of Africa, Southeast Asia and parts of Brazil."}, {"url": "http://oilypedia.com/where-does-palm-oil-come-from-all-about-palm-oil-production/", "passage_text": "There is a huge variety of products that contain palm oil and it’s hard to imagine our routine without them. Where does palm oil come from? The awareness has been recently rising concerning the question of palm oil and sustainability and the impact that the production of palm oil has on the environment. Deforestation caused by palm oil. Since the demand for palm oil is really high, more and more plantations are needed and therefore it requires more land. This problem is especially serious in Indonesia and Malaysia. For example, there has been a major tropical forest cleaning in Indonesian national parks."}, {"url": "https://en.wikipedia.org/wiki/Palm_oil", "passage_text": "The differences are in color (raw palm kernel oil lacks carotenoids and is not red), and in saturated fat content: Palm mesocarp oil is 41% saturated, while palm kernel oil and coconut oil are 81% and 86% saturated respectively. Along with coconut oil, palm oil is one of the few highly saturated vegetable fats and is semi-solid at room temperature. Like most plant-based products, palm oil contains very little cholesterol. Palm oil is a common cooking ingredient in the tropical belt of Africa, Southeast Asia and parts of Brazil."}, {"url": "http://www.answers.com/Q/Where_does_palm_oil_come_from", "passage_text": "Confidence votes 259K. Palm oil comes from the fruit of palm trees. It is a type of edible plant oil that is used as a cooking ingredient in tropical countries, like Brazil, for example. Palm kernel comes from the oil palm tree. It's an edible seed and  can produce palm kernel oil that comes from the kernel. The outer  part of the seed can make palm oil. 3 people found this useful."}, {"url": "http://www.tropicaltraditions.com/red_palm_oil.htm", "passage_text": "Tropical Traditions Virgin Palm Oil comes from West Africa, NOT South East Asia. Palm oil is native to the tropical areas of Africa, where it grows wild. It is a traditional oil used for more than 5000 years in African countries, where small-scale family farms flourish. Palm oil comes from a tropical palm tree (elaeis guineensis-NOT the same as coconut palm trees), which is native to the tropical areas of Africa, where it grows wild."}, {"url": "https://answers.yahoo.com/question/index?qid=1005121904401", "passage_text": "Answers. Best Answer: Palm oil is NOT Coconut oil. It comes from the fruit (oil from the kernal of the fruit is called Palm Kernal Oil) of the Oil Palm (Elaeis guineensis and Elaeis oleifera). Palm oil is one of the few vegetable oils high in saturated fat (coconut is another, possibly expliaining the confusion of the previous poster). "}]