[{"url": "http://wiki-fitness.com/isometric-exercises-shoulders-for-workout/", "passage_text": "Isometric Exercise #1: Isometric flexion. This is a good exercise for people recovering from shoulder injuries and trying to build strength in the muscle. 1  Stand just a few inches away from a wall and just push your hands towards the wall."}, {"url": "http://healthyliving.azcentral.com/muscles-produce-shoulder-flexion-4708.html", "passage_text": "The long head of the biceps muscle assists other muscles with shoulder flexion. It is located in the front of the upper arm and attaches to the glenoid fossa, or socket part of the shoulder joint. The long head of the biceps muscle is innervated by the musculocutaneous nerve."}, {"url": "http://www.fallenrogue.com/shape-your-shoulders-with-these-six-isometric-exercises/", "passage_text": "Doing isometric shoulder exercises can help alleviate shoulder pains by strengthening the muscles of the shoulders. WHAT IS AN ISOMETRIC SHOULDER EXERCISE. Isometric exercise is a form of exercise in which you execute an isometric muscle contraction."}, {"url": "http://wiki-fitness.com/isometric-exercises-shoulders-for-workout/", "passage_text": "Isometric Exercise #5: Isometric shoulder presses. This is a great exercise to strengthen the rotator cuffs which are the most common part to get injured. 1  Hold the dumbbells in each hand and position your arms at 90 degrees. 2  Start pressing with one of the arms, keeping the other arm static."}, {"url": "http://www.fallenrogue.com/shape-your-shoulders-with-these-six-isometric-exercises/", "passage_text": "Isometric Shoulder Flexion – Doing this exercise will target the muscles on the front of the shoulders. Stand and face a wall, placing your feet hip-width apart. Put your arms straight at your sides. Pull in your abdominal muscles while you push the walls with your hands. Keep your body still and resist any movement."}, {"url": "http://www.sportsinjuryclinic.net/rehabilitation-exercises/shoulder-exercises/isometric-shoulder-exercises", "passage_text": "Isometric shoulder flexion. The arm is moved slightly in front of the body, with the fist touching a wall in front. The athlete tries to list the arm upwards against the resistance of the wall. Hold for 5-10 seconds. Isometric extension. The athlete stands with their back to a wall and the arm just behind them."}]