[{"url": "https://au.answers.yahoo.com/question/index?qid=20080203203615AAnNtpE", "passage_text": "Lat: through the course of a year; annually. Anything (e.g., interest, wages, rent) which is calculated per annum is calculated on the basis of a year in time; sometimes a per annum rate will be fixed at 1/360th instead of 1/365th per day. Regards, Rick. rick c · 8 years ago. Thumbs up."}, {"url": "http://www.thefreedictionary.com/per+annum", "passage_text": "1. per annum-by the year; every year (usually with reference to a sum of money paid or received); he earned $100,000 per annum; we issue six volumes per annum. p.a. , per year, annually, each year. "}, {"url": "http://work.chron.com/pro-rata-salary-mean-22237.html", "passage_text": "For example, this may happen to a teacher who works on a part-time basis for a college or university. Assume a full-time teacher makes $48,000 per year, based on a 40-hour work week, and does the same work you do. If you work 20 hours per week, your annual pro rata salary would be half of $48,000, or $24,000. Calculation. To arrive at your pro rata salary, you must know what the job pays on a full-time basis, what your employer views as full-time hours, the number of weeks you will be working during the year and your required work hours per week."}, {"url": "http://www.merriam-webster.com/dictionary/per%20annum", "passage_text": "Full Definition of PER ANNUM. : in or for each year. "}, {"url": "http://smallbusiness.chron.com/loan-interest-rate-payable-per-annum-25907.html", "passage_text": "Per Annum. When interest is stated as per annum, it means the interest will accrue ever year. Per annum is Latin for each year.. If the interest is non-compounding, the same amount of interest will accrue each year. For example, if a borrower takes out a $100 loan at 5 percent interest per annum and takes five years to repay the loan, the interest due at the end of those five years will be $25. Related Reading: The Allowable Interest Rate on Promissory Notes. For example, if a loan agreement states that interest on a $100 loan is a flat 5 percent, then when the borrower repays the lender, the borrower will owe the lender the original $100, plus $5 as an interest payment."}, {"url": "http://work.chron.com/gross-pay-vs-annual-salary-2998.html", "passage_text": "While the annual salary represents a floor for an employee's wages, gross pay can exceed that level. For instance, if an employee is paid an annual salary of $23,000 per year, but he is eligible for, and works, $5,000 worth of overtime, his gross pay will be $28,000 -- more than his salary. But while every employee who is paid earns gross pay, not every employee earns a salary. Defining Gross Pay. An employee's gross pay is the amount of his wages before any deductions, including taxes and benefits. Gross pay may be determined by the amount an employee works, as in hourly pay, or at a set rate, as in a weekly salary."}, {"url": "http://smallbusiness.chron.com/loan-interest-rate-payable-per-annum-25907.html", "passage_text": "When a loan agreement states the interest rate per annum, this simply means the annual interest rate on the loan. On a company's balance financial statements, interest payable per annum would refer to the amount of money the company owes each year on a loan. For example, if a loan agreement states that interest on a $100 loan is a flat 5 percent, then when the borrower repays the lender, the borrower will owe the lender the original $100, plus $5 as an interest payment."}, {"url": "http://work.chron.com/gross-pay-vs-annual-salary-2998.html", "passage_text": "Gross pay may also include pay above and beyond a set salary, such as overtime. For instance, a worker who earns $10 an hour and works 2,732 hours in a year is paid $27,320 in gross pay over the year. Defining Gross Pay. An employee's gross pay is the amount of his wages before any deductions, including taxes and benefits. Gross pay may be determined by the amount an employee works, as in hourly pay, or at a set rate, as in a weekly salary."}]