[{"url": "http://www.aapos.org/terms/conditions/12", "passage_text": "In X-linked inheritance, the gene for albinism is located on an X chromosome. Females have two X chromosomes, while males have one X chromosome and one Y chromosome. X-linked ocular albinism appears almost exclusively in males. The gene for it is passed from mothers (who carry it without developing the condition) to their sons."}, {"url": "https://www.dnalc.org/view/15932-What-is-Albinism-.html", "passage_text": "The enzyme produced by the TYR gene, called tyrosinase, is required for the synthesis of melanin pigment. A mutation in the TYR gene causes the most common form of albinism. People with albinism have either a partial or complete lack of pigment, or coloring, in their eyes, skin or hair. Keywords: melanin pigment,what is albinism,chromosome 11,mutation,synthesis."}, {"url": "http://www.aapos.org/terms/conditions/12", "passage_text": "For most types of albinism, both parents must carry an albinism gene to have a child with albinism. Parents may have normal pigmentation but still carry the gene. When both parents carry the gene, and neither parent has albinism, there is a one-in-four chance at each pregnancy that the baby will be born"}, {"url": "http://www.humanillnesses.com/original/A-As/Albinism.html", "passage_text": "1 Type 1 albinism: This form of albinism is characterized by almost no pigmentation and is caused by a defect in a gene for an enzyme * that makes pigment. 2  Type 2 albinism: People with Type 2 albinism usually have some pigmentation; this type is caused by a defect in a gene called the P gene."}, {"url": "http://www.mayoclinic.org/diseases-conditions/albinism/basics/causes/CON-20029935", "passage_text": "Albinism is caused by a mutation in one of several genes. Each of these genes provides instructions for making one of several proteins involved in the production of melanin. Melanin is produced by cells called melanocytes, which are found in your skin and eyes."}, {"url": "http://www.answers.com/Q/Is_a_chromosome_effected_by_albinism", "passage_text": "Albinism is caused by genetic mutations that affect the production of a pigment called melanin. There is a cell called the melanocyte that is responsible for giving skin, hair … , and eyes pigmentation."}]