[{"url": "http://www.computermajors.com/it-articles/computer-science-salary-averages.aspx", "passage_text": "The average starting salary for computer science bachelor’s graduates by occupation were as follows: 1  Information security analysts - $55,1000. 2  Compute programers - $61,7000. 3  Software developers - $69,000."}, {"url": "http://www.computersciencedegreehub.com/faq/average-salary-computer-science-degree/", "passage_text": "The starting salary for computer science students is slightly lower than it was a few years ago, with stats showing a 2.5% drop from 2012 levels. However, the figure is well above average for college graduates."}, {"url": "http://www.collegefactual.com/majors/computer-information-sciences/computer-science/rankings/highest-paid-grads/", "passage_text": "Highest Paid Computer Science Grads. Computer Science has an average starting salary of $53,834 and an average mid-career income of $94,530. Depending on the school you graduate from, it can vary by as much as $81,049. Look through the list below, and choose wisely."}, {"url": "http://www.computermajors.com/it-articles/computer-science-salary-averages.aspx", "passage_text": "For 2013, of the top 10 paid majors, the only non-engineering majors in the list were computer-related: 1  Computer Science came in fourth on the list with an average starting salary of $64,700. 2  Management Information Systems/Business ranked nine on the list with an average starting salary of $60,700."}, {"url": "http://www.computermajors.com/it-articles/computer-science-salary-averages.aspx", "passage_text": "Compared to humanities and social sciences graduates, who the NACE stated as receiving a starting salary of $37,791, computer science majors earned a 71% higher starting salary on average, which amounts to more than a $26,909 difference."}, {"url": "http://www.computersciencedegreehub.com/faq/average-salary-computer-science-degree/", "passage_text": "Average Starting Salary. The average starting salary for a computer science student is $58,000. This salary will different depending on which state you are living in. For example, computer science students in New York or New Jersey are likely to earn more than students who will look for jobs in Texas or North Carolina."}, {"url": "http://www.computermajors.com/it-articles/computer-science-salary-averages.aspx", "passage_text": "Furthermore, the #1 top paying position for master’s degree graduates in 2013 went to computer science degree holders who landed jobs as computer and information systems managers, with a starting salary of $92,400."}]