[{"url": "http://dccomicsextendeduniverse.wikia.com/wiki/Bruce_Wayne", "passage_text": "Early Life. Bruce was born to Thomas Wayne and his wife Martha in their stately home Wayne Manor on the outskirts of Gotham City. Bruce watches his parents killed. In 1981, Bruce's life changed forever. "}, {"url": "http://batman.wikia.com/wiki/Batman", "passage_text": "Batman's origin is first presented in Detective Comics #33 in November 1939, and is later fleshed out in Batman #47. As these comics state, Bruce Wayne is born to Dr. Thomas Wayne and his wife Martha, two very wealthy and charitable Gotham City socialites. ―Bob Kane. Batman is a superhero co-created by artist Bob Kane and writer Bill Finger and published by DC Comics. The character made his first appearance in Detective Comics #27 (May, 1939). Batman is the secret identity of Bruce Wayne."}, {"url": "http://arkhamcity.wikia.com/wiki/Bruce_Wayne", "passage_text": "742 pages on this wiki. Born into the wealthy Wayne family, Bruce Wayne had an idyllic childhood, although he was given a strong sense of justice by his moralistic and philanthropic parents, Thomas and Martha Wayne."}, {"url": "http://www.answers.com/Q/When_was_bruce_wayne_born", "passage_text": "Answered by The Community. Making the world better, one answer at a time. Bruce Wayne was born in 1915 to a life of wealth and privilege afforded by his socialite parents, Dr. Thomas Wayne and his wife Martha. Bruce Wayne is 35 years old   It has been said that Bruce Wayne first became Batman when he was  around age 25."}, {"url": "http://batman.wikia.com/wiki/Batman", "passage_text": "The central fixed event in the Batman stories is the character's origin story. As a little boy, Bruce Wayne is shocked to see his parents, the physician Dr. Thomas Wayne and his wife Martha Wayne, being murdered by a mugger in front of his very eyes. This drives him to fight crime in Gotham City as Batman. ―Bob Kane. Batman is a superhero co-created by artist Bob Kane and writer Bill Finger and published by DC Comics. The character made his first appearance in Detective Comics #27 (May, 1939). Batman is the secret identity of Bruce Wayne."}, {"url": "https://answers.yahoo.com/question/index?qid=20100309124740AAAXkxD", "passage_text": "Report Abuse. Bruce Wayne was born in 1915 to a life of wealth and privilege afforded by his socialite parents, Dr. Thomas Wayne and his wife Martha. This would change when young Bruce was returning home with his parents after attending a movie one late evening. Bruce Wayne was born in 1915 to a life of wealth and privilege afforded by his socialite parents, Dr. Thomas Wayne and his wife Martha"}, {"url": "http://batman.wikia.com/wiki/Batman_(The_Batman)", "passage_text": "History. Bruce Wayne was born a child of wealth and privilege to Thomas and Martha Wayne of Gotham City. As the Waynes' only son, Bruce was the sole heir to the family fortune as well as his father's business Wayne Industries. When Bruce was a young boy, his parents were brutally gunned down by a mugger, leaving Bruce an orphan. "}, {"url": "https://en.wikipedia.org/wiki/Bruce_Tuckman", "passage_text": "Bruce Wayne Tuckman (born 1938) has carried out research into the theory of group dynamics. In 1965, he published one of his theories called  Tuckman's stages of group development . In 1977, he added a fifth stage named Adjourning. "}]