[{"url": "http://www.universetoday.com/37481/days-of-the-planets/", "passage_text": "A day on Venus is 243 Earth days. Venus’ day is actually longer than its year. It only takes 224.7 Earth days for the planet to orbit the Sun. We measure a day on Earth as a period of 24 hours, but it actually takes the planet 23 hours 56 minutes and 4 seconds to rotate on its axis. Some astronomers believe that we will never know how long a day on Saturn is. A day on Uranus only takes 17 hours 14 minutes and 24 seconds. Since the planet has such an extreme axial tilt (97.8°), it actually rotates on its side. A day on Neptune lasts 16 hours 6 minutes and 36 seconds in Earth time."}, {"url": "http://www.space.com/18584-dwarf-planets-solar-system-infographic.html", "passage_text": "Eris has the orbit that is most highly inclined of all the dwarf planets, tilted nearly 47 degrees from the plane of the planets’ orbits. A day on Eris takes 25.9 hours. Eris has one moon, Dysnomia. Pluto, discovered in 1930, orbits the sun at an average of 39.5 times the Earth’s distance. Its diameter is 1,430 miles (2,302 km). Pluto takes 247.9 Earth years to orbit the sun, and its day is 6.39 times as long as Earth’s. "}, {"url": "http://www.answers.com/Q/How_long_is_one_day_on_Pluto_in_earth_hours", "passage_text": "One day on Pluto (one rotation around its axis) is roughly 6.4 Earth days. A year (one orbit around the Sun) is about 248.09 Earth years. See related link for more infor … mation. Pluto's sidereal rotation period is 6 days, 9 hours, 17 minutes, and 36 seconds. 48 people found this useful. One year on Pluto (the time it takes Pluto to revolve around the Sun) is 248 Earth years, or about 90471 Earth days long. Answer: Due to its orbit, one Pultonian year is abou … t 248 years on Earth."}, {"url": "http://www.spaceplace.nasa.gov/days/en/", "passage_text": "We can write a paragraph about how long days last on other planets. On Mercury a day lasts 1,408 hours, and on Venus it lasts 5,832 hours. On Earth and Mars it’s very similar. Earth takes 24 hours to complete one spin, and Mars takes 25 hours. The gas giants rotate really fast. Jupiter takes just 10 hours to complete one rotation. "}, {"url": "http://www.planetsforkids.org/news/how-long-is-a-day-on-other-planets/", "passage_text": "How long is a day on other planets. by Colm Byrne on January 3, 2013. When we think of a day on Earth we measure it in a period of 24 hours, actually it takes 23 hours and 56 minutes and 4 seconds to rotate on it’s axis. So, if we measure a day on each planet compared to Earth it kind of makes it easier. Some of the planets rotate and spin slow and some rotate and spin fast so you can see a big difference as they orbit the Sun in our solar system. Mercury - 58 days and 15 hours. Venus – 243 Earth days. Earth – 23 hours and 56 minutes."}, {"url": "http://www.universetoday.com/14314/how-long-is-a-day-on-pluto/", "passage_text": "by Fraser Cain on May 15, 2008. Pluto takes 6 days and 9 hours to complete one rotation, so this is how long a day is on Pluto. You can also look through these books from Amazon.com if you want more information about Pluto. One interesting note is that Pluto’s moon Charon is tidally locked around Pluto. This means that Charon takes 6 days and 9 hours to orbit around Pluto – the same amount of time it takes for a day on Pluto. This means that Charon is always at the same place in the sky when seen from Pluto. You would have the same view from Charon as well"}, {"url": "https://answers.yahoo.com/question/index?qid=20080121001933AAFMKzU", "passage_text": "Report Abuse. A day for a planet is defined as the period of rotation: how long it takes the planet to revolve around it's own axis (not around the sun, that's a year). Mars days and Earth days are similar, with Earth having a 24 hour day & Mars having a 24.6 hour day, about 36 minutes longer than Earths. Best Answer: Mercury is the planet closest to the Sun in our Solar System. It has a long daytime (which lasts 58.65 Earth days or almost an entire Mercurian year, which is 88 days long) Venus rotates VERY slowly. Each day on Venus takes 243 Earth days. A year on Venus takes 224.7 Earth day"}]