[{"url": "https://en.wikipedia.org/wiki/Budgerigar", "passage_text": "The budgerigar (Melopsittacus undulatus) /ˈbʌdʒərɨɡɑr/ , also known as common pet parakeet or shell parakeet and informally nicknamed the budgie, is a small, long-tailed, seed-eating parrot. Budgerigars are popular pets around the world due to their small size, low cost, and ability to mimic human speech. The origin of the budgerigar's name is unclear. The species was first recorded in 1805, and today is the third most popular pet in the world, after the domesticated dog and cat. The budgerigar is closely related to the lories and the fig parrots. They are one of the parakeet species, a non-taxonomical term that refers to any of a number of small parrots with long, flat and tapered tails. In both captivity and the wild, budgerigars breed opportunistically and in pairs"}, {"url": "https://en.wikipedia.org/wiki/Monk_parakeet", "passage_text": "Female pet monk parakeet. The nominate subspecies of this parakeet is 29 cm (11 in) long on average, with a 48 cm (19 in) wingspan, and weighs 100 g (3.5 oz). Females tend to be 10–20% smaller, but can only be reliably sexed by DNA or feather testing. It has bright-green upperparts. The monk parakeet (Myiopsitta monachus), also known as the quaker parrot, is a small, bright-green parrot with a greyish breast and greenish-yellow abdomen."}, {"url": "http://redshed.co.uk/blog/budgie-facts/", "passage_text": "Knowing Budgies. Budgerigars are the world’s most popular species of pet bird, for good reason. These cute, little parrots make lovely pets, and are usually friendly and easy to train. They are also known as “ parakeets “. The domesticated budgerigars that you might find in a person’s home were originally bred from wild budgerigars (Melopsittacus undulatus)."}, {"url": "http://www.budgerigar.com/", "passage_text": "Even though budgerigars are typically called parakeets, especially in the United States, they are just one of over 100 species commonly referred to as parakeets, a widely diverse class of tiny, slender parrots spread out over more than a dozen genera in the subfamily Psittacinae of the family Psittacidae. Budgerigars or parakeets have been bred in captivity since the 1850s. Certain budgies are bred for show, and they are often referred to as English or show budgies. Show budgerigars can be up to twice as large as their counterparts in the wild, and their heads are exceptionally puffy and fluffy."}, {"url": "http://www.birdchannel.com/budgerigars-parakeets.aspx", "passage_text": "The budgie is also sometimes referred to as the American budgie, American budgerigar or American parakeet (the standard 6-inch size bird that is similar in size to its wild counterpart) or English budgie, English budgerigar or English parakeet, which is noticeable larger than a standard, wild-type budgie. Find out the meaning behind the word budgerigar as well as why they are called parakeets. Laura Doering. Tweet. The budgie, which is a shortened version of the name budgerigar, is a small, colorful parrot often seen at pet stores. The budgie is also referred to as a budgerigar, parakeet, ’keet, or shell parakeet"}, {"url": "http://birds.about.com/od/breedsofbirds/f/keetsandbudgies.htm", "passage_text": "Answer: The truth is that Parakeets and Budgies are actually one in the same. The birds that we commonly call Parakeets in the USA are known as Budgerigars or Budgies to the rest of the world. While some may claim that Parakeets and Budgies are not the same, taxonomy makes no difference between the two. They come in a sea of beautiful color mutations, and selective breeding has given types like the English Budgie a distinctive look that's all their own. Check out this informative Profile on Parakeets and Budgies to find out more about whether or not they are the right species for you."}, {"url": "http://www.superpetusa.com/pet-birds/choosing-the-right-bird/parakeet.htm", "passage_text": "Parakeets, also known as “Budgerigars” or “Budgies,” are one of the most popular pet birds in the U.S. It’s easy to see why! They are curious, loving, and enjoy every member of the family. Parakeets are easy to care for, and some can even learn to speak! However they are best known for being excellent whistlers. Parakeets are small parrots that are active and love daily time out of their cage to play with people. Affordable and loaded with personality, Parakeets are highly recommended for first-time bird owners."}, {"url": "http://www.birdchannel.com/bird-magazines/popular-birds/budgies.aspx", "passage_text": "This depends on the age of the budgie, whether the bird was hand-raised or parent-raised and its experiences with humans so far in its life,” said Ohio’s Chrys Meatyard, who has raised budgies for 18 years and is a bird expert at www.allexperts.com. 102 | Budgies From The Beginning Here’s a historical look at the development of the world’s most popular pet bird. By Eric Peake. The budgie, also known by many in the United States as the parakeet, is without a doubt the most popular pet in the world."}]