[{"url": "http://hyperphysics.phy-astr.gsu.edu/hbase/Organic/sugar.html", "passage_text": "Glucose is a carbohydrate, and is the most important simple sugar in human metabolism. Glucose is called a simple sugar or a monosaccharide because it is one of the smallest units which has the characteristics of this class of carbohydrates."}, {"url": "http://www.bbc.co.uk/schools/gcsebitesize/science/add_aqa/photosynthesis/photosynthesisrev4.shtml", "passage_text": "Plants and algae store glucose as insoluble products. These include: 1  Starch [starch: A type of carbohydrate. 2  Plants can turn the glucose produced in photosynthesis into starch for storage, and turn it back into glucose when it is needed for respiration."}, {"url": "https://www.scribd.com/doc/20872349/Starch-and-Glycogen", "passage_text": "Glycogen is the analogue of starch, a less branched glucose polymer in plants, and is commonly referred to as animal starch, having a similar structure to amylopectin. Glycogen is found in the form of granules in the cytosol in many cell types, and plays an important role in the glucose cycle."}, {"url": "http://www.bbc.co.uk/schools/gcsebitesize/science/add_aqa/photosynthesis/photosynthesisrev4.shtml", "passage_text": "1 Starch [starch: A type of carbohydrate. 2  Plants can turn the glucose produced in photosynthesis into starch for storage, and turn it back into glucose when it is needed for respiration."}, {"url": "http://www.answers.com/Q/Why_is_starch_a_good_energy_storage_molecule", "passage_text": "Starch is insoluble in water and so can be used as a storage device for glucose; plants convert the spare glucose into starch then store it. . 4 people found this useful. Edit."}, {"url": "https://dlc.dcccd.edu/biology1-3/carbohydrates", "passage_text": "Plants synthesize two types of polysaccharides, starch and cellulose. The glycosidic bonds between glucose units in plant starch are similar to those in animal glycogen. Accordingly, starch molecules are structurally similar, forming compact coils, and play a similar role in energy storage for plants."}, {"url": "http://www.answers.com/Q/Why_are_starch_and_glycogen_considered_storage_polysaccharides", "passage_text": "Starch and glycogen are both ways of storing glucose, the energy source for most cells. Starch and glycogen are both polymers of glucose, produced by repeated condensation reactions between glucose molecules. When the glucose is needed, they can be broken down by hydrolysis reactions to release the glucose."}]