[{"url": "http://docs.oracle.com/cd/E41948_01/fscm92pbh1/eng/fscm/fspf/concept_UnderstandingPeopleSoftChartFields-9f14fc.html", "passage_text": "In addition to this basic categorization of a transaction amount using the account ChartField, you can simultaneously record the same transaction by product, project, investment portfolio, policy, endowment, fund, service, or any number of categories by using other ChartFields with appropriate values. Note: PeopleSoft recommends that you not use special characters and embedded blanks in ChartField values. Use the generally accepted alphanumeric characters and the underscore. In general avoid special characters such as apostrophes and do not include embedded blanks when defining"}, {"url": "http://www.fa.ufl.edu/departments/general-accounting/chartfields/", "passage_text": "A ChartField is a data field that stores accounting information, affects budget and is used for internal and external reporting. All accounting systems consist of codes used to identify transactions and to track financial activity. ChartFields are the codes in myUFL used to identify these financial functions. ChartFields identify received and expended funds and insure compliance with the contributor of those funds. This is done with a series of ChartFields called a ChartField combination."}, {"url": "http://docs.oracle.com/cd/E51433_01/fscm92pbr2/eng/fscm/fspf/concept_UnderstandingChartFieldSecurity-368000.html", "passage_text": "When ChartField Security is not required (that is, components used to reconcile transaction data), you can exclude the components from ChartField Security. You can secure ChartFields in any of the following ways: Secure transactions from component search lists. The ChartField Security feature allows you to: Enable or disable ChartField Security based on a product. Enable or disable ChartField Security based on a component. Enable or disable ChartField Security by user ID, role, or permission list."}, {"url": "http://docs.oracle.com/cd/E51433_01/fscm92pbr2/eng/fscm/fspf/concept_UnderstandingChartFieldSecurity-368000.html", "passage_text": "ChartField Security allows you to configure data access security specific to a user's role in the organization. ChartField Security is designed to work in conjunction with other security features, such as Business Unit and Ledger Security. The ChartField Security feature allows you to: Enable or disable ChartField Security based on a product. Enable or disable ChartField Security based on a component. Enable or disable ChartField Security by user ID, role, or permission list."}, {"url": "http://www.finance.umich.edu/finops/accounting/chartfields", "passage_text": "Chartfield requests can be made using the forms available at this link. Chartfields are the building blocks of the University of Michigan's financial reporting structure. The following Chartfield elements provide a common framework for internal and external financial reporting and analysis."}, {"url": "http://docs.oracle.com/cd/E41948_01/fscm92pbh1/eng/fscm/fspf/concept_UnderstandingPeopleSoftChartFields-9f14fc.html", "passage_text": "accounts. In PeopleSoft applications, this is termed the alternate account ChartField (ALTACCT). You link alternate account ChartField values with account ChartField values. When you enter values for the account ChartField, the system enters the associated alternate account value. Note: PeopleSoft recommends that you not use special characters and embedded blanks in ChartField values. Use the generally accepted alphanumeric characters and the underscore. In general avoid special characters such as apostrophes and do not include embedded blanks when defining"}, {"url": "https://www.cusys.edu/controller/fin-system-values.html", "passage_text": "A program is required to be used if project is not used. The program ChartField is used with general, auxiliary, gift, renewal and replacement, retirement of indebtedness, investment in plant, and agency funds. Both program and project may be used to reflect matching/cost sharing. Phase-the third (from the top) project level at which you can budget and record project activity. Activity-the lowest budgeting and reporting level for a project. Sub-Classification-This ChartField is totally optional. It is used to capture department-defined needs."}, {"url": "https://assist-erp.osu.edu/Intro/WebHelp/Financials_System/Understanding_the_ChartField.htm", "passage_text": "The ChartField is comprised of a sequence of numbers or codes that specify how financial transactions are tracked. It represents how the university gathers, stores, combines, and uses financial information in the course of its operations. The ChartField is the core accounting structure of the university. The ChartField impacts each part of the OSU administrative systems: Human Resources, Budgeting, General Ledger, Procurement, and Grants."}, {"url": "http://hr.ufl.edu/learn-grow/just-in-time-training/myufl-toolkits/chartfields/chartfields-faq/", "passage_text": "What is the purpose of a ChartField? A ChartField entry tracks financial transaction data, affects Commitment Control (KK) balances, and is used in reporting, such as Departmental reports, UF’s financial statements, sponsored project reports, etc. ChartFields are the tools of the University accounting system. "}, {"url": "http://docs.oracle.com/cd/E51433_01/fscm92pbr2/eng/fscm/fspf/concept_UnderstandingChartFieldSecurity-368000.html", "passage_text": "The major difference is that, unlike other security features delivered in the PeopleSoft products, ChartField Security allows you to choose the ChartFields by which you want to configure access and configure rules specific to one or more products. The ChartField Security feature allows you to: Enable or disable ChartField Security based on a product. Enable or disable ChartField Security based on a component. Enable or disable ChartField Security by user ID, role, or permission list."}]