[{"url": "http://www.healthline.com/health/anticholinergics", "passage_text": "The drugs help to block involuntary movements of the muscles associated with these diseases. They also balance the production of dopamine and acetylcholine in the body. Anticholinergics can also be used to treat certain types of toxic poisoning, and are sometimes used as an aid to anesthesia. Anticholinergics are only available with a doctor’s prescription. Anticholinergics are used to treat a variety of conditions. These include: 1  gastrointestinal disorders, such as diarrhea, overactive bladder, and incontinence. 2  asthma. 3  chronic obstructive pulmonary disease (COPD). 4  insomnia. 5  dizziness and motion sickness."}, {"url": "http://livertox.nih.gov/Anticholinergic_Agents.htm", "passage_text": "Anticholinergics are agents that decrease or block the actions of acetylcholine on its parasympathetic nervous system receptors on smooth muscle cells, glands and the central nervous system. Specific anticholinergic agents in clinical use are listed below with common brand name(s), year of approval in the United States, and major use (G=gastrointestinal, N=nausea and motion sickness, R=respiratory, U=urological)."}, {"url": "https://en.wikipedia.org/wiki/Anticholinergic", "passage_text": "An anticholinergic agent is a substance that blocks the neurotransmitter acetylcholine in the central and the peripheral nervous system. Anticholinergics inhibit parasympathetic nerve impulses by selectively blocking the binding of the neurotransmitter acetylcholine to its receptor in nerve cells. Anticholinergic drugs are used to treat a variety of conditions: 1  Gastrointestinal disorders (e.g., gastritis, diarrhea, pylorospasm, diverticulitis, ulcerative colitis, nausea, and vomiting). 2  Genitourinary disorders (e.g., cystitis, urethritis, and prostatitis). 3  Respiratory disorders (e.g., asthma, chronic bronchitis, and chronic obstructive 4  .... S"}, {"url": "https://en.wikipedia.org/wiki/Anticholinergic", "passage_text": "Medical uses [edit]. Anticholinergic drugs are used to treat a variety of conditions: 1  Gastrointestinal disorders (e.g., gastritis, diarrhea, pylorospasm, diverticulitis, ulcerative colitis, nausea, and vomiting). 2  Genitourinary disorders (e.g., cystitis, urethritis, and prostatitis). 3  Respiratory disorders (e.g., asthma, chronic bronchitis, and chronic obstructive 4  .... S"}, {"url": "http://www.thoracic.org/copd-guidelines/for-patients/what-kind-of-medications-are-there-for-copd/what-are-anticholinergic-medications.php", "passage_text": "What are short-and long-acting anticholinergics? Short-acting anticholinergic medications work in about 15 minutes and last for 6-8 hours. Some providers do not consider these drugs as reliever medication because they take longer to work than beta-agonist drugs. While the beta-agonists affect the bronchioles (small airways), anticholinergics affect the muscles around the bronchi (large airways). When the lungs are irritated, these bands of muscle can tighten, making the bronchi narrower."}, {"url": "http://memory.ucsf.edu/ftd/medical/treatment/avoid/multiple", "passage_text": "Anticholinergics decrease acetylcholine activity to balance out the production of dopamine and acetylcholine. They are used to treat incontinence, depression and sleep disorders. Medications with strong anticholinergic effects, such as antihistamines that cause drowsiness, are well known for causing acute cognitive impairment in individuals with dementia and may cause confusion and hallucinations. "}, {"url": "http://www.healthline.com/health/anticholinergics", "passage_text": "Anticholinergics are a class of drugs that block the action of the neurotransmitter acetylcholine in the brain. They are used to treat diseases like asthma, incontinence, gastrointestinal cramps, and muscular spasms. Anticholinergics are used to treat a variety of conditions. These include: 1  gastrointestinal disorders, such as diarrhea, overactive bladder, and incontinence. 2  asthma. 3  chronic obstructive pulmonary disease (COPD). 4  insomnia. 5  dizziness and motion sickness."}, {"url": "http://medical-dictionary.thefreedictionary.com/Anticholinergic+agents", "passage_text": "anticholinergic (an´tīkō´linur´jik) , n (parasympatholytic, cholinolytic), a drug that acts to inhibit the effects of the neurohormone acetylcholine or to inhibit its cholinergic neuroeffects. A cholinergic blocking agent. 2 an anti-cholinergic agent that functions by competing with the neurotransmitter acetylcholine for its receptor sites at synaptic junctions."}]