[{"url": "http://www.gardenweb.com/discussions/2800607/woolly-lavender", "passage_text": "Woolly Lavender Lavandula Lanata Boiss is my problem!!! I have bought it, plant it, it has grown up very much, only it doesn't look like it should be eg. http://www.mountainvalleygrowers.com/lavlantana.htm. "}, {"url": "http://www.accentsforhomeandgarden.com/catalog_i7475890.html?catId=292138", "passage_text": "Lavender Woolly. Lavender lanata Woolly...a tender perennial herb with fragrant purple flowers on white woolly leaves. "}, {"url": "http://www.mountainvalleygrowers.com/lavendercareandtips.htm", "passage_text": "Grappenhall Lavender is a tall, long-leaved Lavender with a slender bloom and a medium purple flower. Because the leaves are longer this plant has the energy to grow quickly and in larger proportions. Hidcote Giant Lavender has dark purple flowers that are close together. It is a striking plant in the landscape. Vera Lavender or Lavender Vera is thought to be the true English Lavender. Also called True Lavender or Fine Lavender, the best quality oil comes from plants grown at altitudes between 2500 and 4500 feet on the sides of mountains in central Europe."}, {"url": "http://everything-lavender.com/woolly-lavender.html", "passage_text": "This is a lovely late blooming Lavender variety with lovely fuzzy silver white foliage and purple flowers.Lanata refers to the long leaf hairs that covers the foliage. Also known as Spanish Mountain Lavender it grows on dry, rocky slopes of Spain. This Lavender is a beautiful addition to the garden when planted alongside darker foliage plants. Lavandula lanata is a tender perennial and is hardy in US Zones 8-11. Forms a nice 3 foot mound with dense foliage. The fine hairs that cover the leaves is a natural adaptation to living in dry climate conditions. Never intentionally soak the foliage in the evenings but water at the base of the plant. Plant allowing room for plenty of air circulation around the foliage to help prevent and discourage fungal rot diseases. www.rbge.org.uk/.../ july-garden-highlights The flowers are a rich dark purple and are set atop long stems."}, {"url": "http://www.missouribotanicalgarden.org/gardens-gardening/your-garden/help-for-the-home-gardener/advice-tips-resources/visual-guides/long-blooming-perennials.aspx", "passage_text": "Russian sage is a woody-based perennial of the mint family which typically grows 2-4' (less frequently to 5') tall and features attractive finely-dissected gray-green leaves and whorls of light blue flowers. Long summer bloom period. Perennial Plant Association Plant of the Year (1995). "}, {"url": "http://www.mountainvalleygrowers.com/lavendercareandtips.htm", "passage_text": "The variation in fragrance, size, color, texture, and flower heads among the Lavenders in this group make it a truly exciting group of plants. Spanish Lavender, with its dark purple, pineapple-shaped flower heads and dark green leaves, looks great planted with Orchid Rockrose and Golden Garden Sage. It grows low and wide and may layer its stems, allowing one plant to cover a lot of ground. Spanish Lavender is sometimes referred to as French Lavender. Vera Lavender or Lavender Vera is thought to be the true English Lavender. Also called True Lavender or Fine Lavender, the best quality oil comes from plants grown at altitudes between 2500 and 4500 feet on the sides of mountains in central Europe."}, {"url": "http://www.nj.com/homegarden/garden/index.ssf/2008/11/perennial_lavenders_lend_fragr.html", "passage_text": "-- Maria F. A. Lavender (Lavandula) is a wonderful perennial that adds fragrance to any garden or landscape bed. All lavenders are perennial, but there are differences -- in fragrance, growth, bloom time and winter hardiness -- among species and hybrids. There is such diversity within the lavender family that it is possible to have continuous bloom throughout the growing season, from spring to fall. Types of lavenders. Lavenders can be grouped into the categories of non-English, English and lavandins. In the non-English group, there are Spanish lavender, yellow lavender, sweet lavender, French lavender, woolly lavender and their hybrids. Sweet lavender, with its beautiful fragrance, is a common plant of the old-fashioned garden, blooming from July through September"}, {"url": "http://home.howstuffworks.com/define-lavender.htm", "passage_text": "Related species: Lavandula stoechas is the classic lavender of Greece and Rome. It has bolder flowers of red-purple. Scientific name: Lavandula angustifolia. 1  Perennial Flowers. 2  Fill your garden with beautiful perennial flowers. 3  They are organized by height, soil type, sunlight, and color. 4  Perennials. Lavender is an aromatic herb originally hailing from the Mediterranean. The genus name, meaning to wash, alludes to the ancient custom of scenting bathwater with oil of lavender or a few lavender flowers. These perennials tend to be shrubby, usually with square stems and narrow evergreen leaves that are white and woolly when young"}]