[{"url": "http://www.bbc.co.uk/schools/gcsebitesize/science/add_ocr_gateway/radiation/treatmentrev1.shtml", "passage_text": "X-rays and gamma rays. X-rays and gamma rays are used in medicine. They are electromagnetic waves and part of the electromagnetic spectrum. X-rays and gamma rays have some other features in common. This machine allows the energy and intensity of the x-rays to be controlled. Gamma rays, on the other hand, are given out by radioactive materials. This process is totally random and so cannot be controlled as easily as x-rays. Page: 1  1."}, {"url": "http://science.hq.nasa.gov/kids/imagers/ems/gamma.html", "passage_text": "Gamma-rays have the smallest wavelengths and the most energy of any other wave in the electromagnetic spectrum. These waves are generated by radioactive atoms and in nuclear explosions. Gamma-rays can kill living cells, a fact which medicine uses to its advantage, using gamma-rays to kill cancerous cells. Gamma-rays travel to us across vast distances of the universe, only to be absorbed by the Earth's atmosphere."}, {"url": "http://science.hq.nasa.gov/kids/imagers/ems/xrays.html", "passage_text": "As the wavelengths of light decrease, they increase in energy. X-rays have smaller wavelengths and therefore higher energy than ultraviolet waves. We usually talk about X-rays in terms of their energy rather than wavelength. This is partially because X-rays have very small wavelengths. It is also because X-ray light tends to act more like a particle than a wave. "}, {"url": "http://missionscience.nasa.gov/ems/01_intro.html", "passage_text": "Gamma rays, x-rays, and some ultraviolet waves are ionizing, meaning these waves have such a high energy that they can knock electrons out of atoms. Exposure to these high-energy waves can alter atoms and molecules and cause damage to cells in organic matter. Electromagnetic energy travels in waves and spans a broad spectrum from very long radio waves to very short gamma rays. The human eye can only detect only a small portion of this spectrum called visible light. A radio detects a different portion of the spectrum, and an x-ray machine uses yet another portion."}, {"url": "http://www.livescience.com/50215-gamma-rays.html", "passage_text": "View full size image. Gamma-rays are a form of electromagnetic radiation, as are radio waves, infrared radiation, ultraviolet radiation, X-rays and microwaves. Gamma-rays can be used to treat cancer, and gamma-ray bursts are studied by astronomers. Electromagnetic (EM) radiation is transmitted in waves or particles at different wavelengths and frequencies."}, {"url": "http://www.rerf.or.jp/general/whatis_e/index.html", "passage_text": "E.g.: alpha rays, beta rays (from radioactive materials), heavy particle radiation (used in treating cancer). X rays and gamma rays are short wavelength electromagnetic waves (with properties equivalent to light). All the various waves shown below are electromagnetic waves and related to light. Electromagnetic waves (radiation) = flow of energy transmitted through space (Sohei Kondo). When radiation's wavelength is shorter than the wavelength of ultraviolet light (with increased energy), it can pass through the human body (as is the case with X rays and gamma rays)."}, {"url": "http://science.hq.nasa.gov/kids/imagers/ems/gamma.html", "passage_text": "Gamma-rays are the most energetic form of light and are produced by the hottest regions of the universe. They are also produced by such violent events as supernova explosions or the destruction of atoms, and by less dramatic events, such as the decay of radioactive material in space. These waves are generated by radioactive atoms and in nuclear explosions. Gamma-rays can kill living cells, a fact which medicine uses to its advantage, using gamma-rays to kill cancerous cells. Gamma-rays travel to us across vast distances of the universe, only to be absorbed by the Earth's atmosphere."}, {"url": "http://www.livescience.com/32344-what-are-x-rays.html", "passage_text": "X-rays are a form of electromagnetic radiation, as are radio waves, infrared radiation, visible light, ultraviolet radiation and microwaves. X-rays are also used in treating cancer and in exploring the cosmos. Electromagnetic radiation is transmitted in waves or particles at different wavelengths and frequencies. This broad range of wavelengths is known as the electromagnetic spectrum."}, {"url": "https://en.wikipedia.org/wiki/Gamma_radiation", "passage_text": "Gamma rays, X-rays, visible light, and radio waves are all forms of electromagnetic radiation. The only difference is the frequency and hence the energy of those photons. Gamma rays are generally the most energetic of these, although a broad overlap with X-ray energies occurs. Gamma rays typically have frequencies above 10 exahertz 19 Hz), and therefore have energies above 100 keV and wavelengths less than 10 picometers (10 −12 meter), which is less than the diameter of an atom. However, this is not a hard and fast definition, but rather only a rule-of-thumb description for natural processes."}]