[{"url": "http://study.com/what_education_is_required_of_a_computer_engineer.html", "passage_text": "Generally, a bachelor's degree is the minimum education required of a computer engineer. Career Overview. Computer engineers might work with software, hardware or applications and system development. They work to fulfill user needs based on usability, function and logic."}, {"url": "http://www.answers.com/Q/What_type_of_degrees_do_computer_engineers_need", "passage_text": "Education and training. Most employers prefer applicants who have at least a bachelor's degree and broad knowledge of, and experience with, a variety of computer systems and technologies. The usual college major for applications software engineers is computer science or software engineering. Systems software engineers often study computer science or computer information systems. Graduate degrees are preferred for some of the more complex jobs. Computer software engineers also need skills related to the industry in which they work. Engineers working for a bank, for example, should have some expertise in finance so that they understand banks' computer needs."}, {"url": "https://en.wikipedia.org/wiki/Computer_engineering", "passage_text": "Most entry-level computer engineering jobs require at least a bachelor's degree in computer engineering. Sometimes a degree in electronic engineering is accepted, due to the similarity of the two fields. Computer engineering is a discipline that integrates several fields of electrical engineering and computer science required to develop computer hardware and software."}, {"url": "http://www.studentscholarships.org/careers_salary/128/education/computer_engineers_except_software_engineers_and_designers.php", "passage_text": "1. You need a university degree in computer engineering, electrical/electronics engineering, engineering physics or computer science. 2. You may also need a master's degree or doctorate in a related engineering field. 3. You need a licence from a provincial/territorial association of professional engineers to approve engineering drawings/reports and to practise as a professional engineer (P. Eng.)."}, {"url": "http://www.learnhowtobecome.org/computer-engineer/", "passage_text": "Becoming a computer engineer requires an extensive college education that can take from four to seven years to complete. In the first two years of a bachelor’s degree program, students typically finish computer engineering prerequisites and general education courses. The last two years focus on foundational classes in computer science, electrical engineering and mathematics."}, {"url": "http://www.bls.gov/ooh/architecture-and-engineering/computer-hardware-engineers.htm", "passage_text": "Education. Most entry-level computer hardware engineers have a bachelor’s degree in computer engineering, although a degree in electrical engineering or computer science generally is acceptable. A computer engineering major is similar to electrical engineering but with a heavy emphasis on computer science curriculum. Computer hardware engineers research, design, develop, and test computer systems and components such as processors, circuit boards, memory devices, networks, and routers. By creating new directions in computer hardware, these engineers create rapid advances in computer technology."}, {"url": "http://www.collegequest.com/how-to-become-a-software-engineer.aspx", "passage_text": "Aspiring software engineers usually major in computer science, computer information systems, software engineering or mathematics. Some students take programming and software engineering classes to supplement a degree in another field, such as accounting, business or finance. "}, {"url": "http://study.com/what_education_is_required_of_a_computer_engineer.html", "passage_text": "Most employers require students to hold a bachelor's degree in computer science, computer programming, computer engineering, computer information systems, electrical engineering or a similar computer-related field. Career Overview. Computer engineers might work with software, hardware or applications and system development. They work to fulfill user needs based on usability, function and logic."}, {"url": "http://www.answers.com/Q/What_type_of_degrees_do_computer_engineers_need", "passage_text": "In 2006, more than 68 percent of computer programmers had a bachelor's degree or higher, but as the level of education and training required by employers continues to rise, this proportion is expected to increase. Computer software engineers also need skills related to the industry in which they work. Engineers working for a bank, for example, should have some expertise in finance so that they understand banks' computer needs."}, {"url": "http://www.studentscholarships.org/careers_salary/7/education/software_engineers_and_designers.php", "passage_text": "1. A bachelor's degree, usually in computer science, computer systems engineering, software engineering or mathematics or completion of a college program in computer science is usually required. 2. A master's or doctoral degree in a related discipline may be required. "}]