[{"url": "http://www.thefreedictionary.com/laser", "passage_text": "Such light is called coherent. Lasers produce coherent light through a process called stimulated emission. The laser contains a chamber in which atoms of a medium such as a synthetic ruby rod or a gas are excited to a high energy level. A device that emits a very narrow and intense beam of light or other radiation. The light is generated by exciting the atoms of a medium, such as a crystal, gas, or liquid. The color of laser light depends on the level to which the atoms of the medium become excited."}, {"url": "http://www.northropgrumman.com/Capabilities/LaserOverview/Pages/WhatIsALaser.aspx", "passage_text": "A laser, short for Light Amplification by Stimulated Emission of Radiation, is a very intense, highly directional beam of light. Solid State Lasers. Solid-state lasers (SSLs) use a crystalline or glass material doped with an ion, which is the lasing species. These lasers use flashlamps or diodes to pump the ions to excited levels, which then emit radiation. The first laser, a ruby laser, is an SSL."}, {"url": "http://whatis.techtarget.com/definition/laser", "passage_text": "The acronym laser stands for light amplification by stimulated emission of radiation.. Lasers work as a result of resonant effects. The output of a laser is a coherent electromagnetic field. In a coherent beam of electromagnetic energy, all the waves have the same frequency and phase."}, {"url": "http://science.howstuffworks.com/laser.htm", "passage_text": "­But lasers play a pivotal role in our everyday lives, too. The fact is, they show up in an amazing range of products and technologies. You'll find them in everything from CD players to dental drills to high-speed metal cutting mac­hines to measuring systems. Tattoo removal, hair replacement, eye surgery -- they all use lasers."}, {"url": "http://www.northropgrumman.com/Capabilities/LaserOverview/Pages/WhatIsALaser.aspx", "passage_text": "A laser is commonly produced by exciting the atoms or molecules in a material in a very controlled manner until they emit photons, or packets of light, in a very organized or coherent fashion. Solid State Lasers. Solid-state lasers (SSLs) use a crystalline or glass material doped with an ion, which is the lasing species. These lasers use flashlamps or diodes to pump the ions to excited levels, which then emit radiation. The first laser, a ruby laser, is an SSL."}, {"url": "https://en.wikipedia.org/wiki/Laser", "passage_text": "The beam in the cavity and the output beam of the laser, when travelling in free space (or a homogeneous medium) rather than waveguides (as in an optical fiber laser), can be approximated as a Gaussian beam in most lasers; such beams exhibit the minimum divergence for a given diameter. A laser consists of a gain medium, a mechanism to energize it, and something to provide optical feedback. The gain medium is a material with properties that allow it to amplify light by way of stimulated emission. Light of a specific wavelength that passes through the gain medium is amplified (increases in power)."}, {"url": "http://www.spaceplace.nasa.gov/laser/en/", "passage_text": "No, not in light sabers! For one thing, lasers can be used in a device called a spectrometer. A spectrometer uses light to identify the chemical composition of matter. For example, as light passes through a gas, the gas soaks up certain colors, or wavelengths, of light. Different gases absorb different wavelengths. First, the light from a laser contains exactly one color or wavelength rather than a lot of different wavelengths. Scientists say that laser light is  monochromatic , meaning of one color. Flash is required to view this animation. Second, all the wavelengths are in phase."}, {"url": "http://www.spaceplace.nasa.gov/laser/en/", "passage_text": "Doctors use lasers to do delicate surgery, such as eye surgery. Lasers carry TV and telephone signals over special cables. Metal workers use lasers to cut and weld metal into everything from street light poles to cars. Workers in clothing factories use lasers to cut through hundreds of layers of fabric at once. First, the light from a laser contains exactly one color or wavelength rather than a lot of different wavelengths. Scientists say that laser light is  monochromatic , meaning of one color. Flash is required to view this animation. Second, all the wavelengths are in phase."}, {"url": "http://www.spaceplace.nasa.gov/laser/en/", "passage_text": "Because the laser light is monochromatic, coherent, and collimated, all of its energy is focused to produce a small point of intense power. This focused power makes laser light useful for cutting and welding. It also makes it possible to control laser light very precisely and make it do all kinds of useful things. First, the light from a laser contains exactly one color or wavelength rather than a lot of different wavelengths. Scientists say that laser light is  monochromatic , meaning of one color. Flash is required to view this animation. Second, all the wavelengths are in phase."}, {"url": "http://whatis.techtarget.com/definition/laser", "passage_text": "In a basic laser, a chamber called a cavity is designed to internally reflect infrared (IR), visible-light, or ultraviolet (UV) waves so they reinforce each other. The cavity can contain gases, liquids, or solids. The choice of cavity material determines the wavelength of the output. Lasers work as a result of resonant effects. The output of a laser is a coherent electromagnetic field. In a coherent beam of electromagnetic energy, all the waves have the same frequency and phase."}]