[{"url": "http://www.sheknows.com/baby-names/name/grace", "passage_text": "In Latin the meaning of the name Grace is: Grace. American Meaning: The name Grace is an American baby name. In American the meaning of the name Grace is: Grace. English Meaning: The name Grace is an English baby name. In English the meaning of the name Grace is: From the word 'grace', derived from the Latin 'gratia', meaning God's favor. Famous bearer: American actress Grace Kelly became Princess Grace of Monaco. "}, {"url": "http://www.babynamespedia.com/meaning/Grace", "passage_text": "[ syll. gra-ce, gr-ace ] The baby girl name Grace is pronounced as GR-Z †. Grace is used predominantly in the English and French languages, and its origin is Latin. Gratia (Latin) is an original form of Grace. The name is from the English word 'grace', which is from the Latin 'gratia' (meaning charm, grace). The name was borne in Roman mythology by the three daughters of Zeus, who were called the Graces. Among Christians, the meaning of the name is associated with the 'grace of God'"}, {"url": "http://www.ourbabynamer.com/meaning-of-Grace.html", "passage_text": "Grace is generally used as a girl's name. It consists of 5 letters and 1 syllable and is pronounced Grace. In the U.S. in 2014, it ranked 21 in baby name popularity for girls with 7554 occurrences. It ranked 6729 in popular baby names for boys with 12 occurrences. Last year this name was ranked as one of the top 1000 most popular names within its gender. Keep in mind how popular a name is. Your child may feel that they fit in more with a more popular name. On the other hand, they may feel more special if their name is less popular and more uniquely their own."}, {"url": "http://www.babynamewizard.com/baby-name/girl/grace", "passage_text": "Origin of the name Grace: Inspired by grace (eloquence or beauty of form, kindness, mercy, favor), which is derived from the Latin gratia (favor, thanks). The name was made popular by 17th-century Puritans, who bestowed it in reference to God's favor and love toward mankind. From A World of Baby Names by Teresa Norman."}, {"url": "http://www.thenamemeaning.com/grace/", "passage_text": "Additional information: Grace is a feminine English name derived from the Latin gratia, meaning ‘gracious’. Originally a virtue name created by the Puritans, the name Grace has a lot more modernity than names such as Clemency and Illumination – other more modern virtue names are Faith, Verity, and Amity. To Christians, grace means free salvation from God."}, {"url": "http://www.answers.com/Q/What_does_the_name_Grace_mean", "passage_text": "That is a lovely name. The name Olivia is Latin and means olive tree. A feminine name that is highly popular. Also the name of a character in Shakespeare's Twelfth Night The … name Grace is English. Initially the name had nothing to do with the physical grace, but was more to do with divine favour. The Puritans therefore favoured it and it subsequently became very vogue in America at the turn of the century"}, {"url": "http://www.babynames.com/name/Grace", "passage_text": "About the name Grace. The meaning of the name Grace: Charm. The origin of the name Grace: Latin. Alternate spellings: Gracia. People who like the name Grace also like: Ava, Olivia, Emma, Sophia, Charlotte, Isabella, Ella. Noah, Liam, Ethan, Benjamin, Jacob, Jack, Jackson. Notes: Grace is a name with Latin origins. The meaning of the name Grace is charm. It was first created as a reference to the “grace of God.” Alternate spellings of the name Grace include Grace, Grayse, Gracia, and Graciella. Common nicknames of the name Grace include Gracie, Gray,and Gigi. Famous Graces include actress Grace Kelly, Princess of Monaco. "}, {"url": "http://www.thinkbabynames.com/meaning/0/Grace", "passage_text": "Grace /gra-ce/ [1 syll.] as a girls' name is pronounced grayce. It is of Latin origin, and the meaning of Grace is favor; blessing . A virtue name referring to God 's grace. Greek mythology: the Three Graces were goddesses of nature: Aglaia (brillance), Thalia (flowering), and Euphrosyne (joy). Grace is a very popular first name for women (#114 out of 4276, Top 3%) and also a very popular surname for both adults and children (#1200 out of 150436, Top 1%). (2000 U.S. Census). Presented below is the baby name popularity of Grace for girls"}]