[{"url": "http://www.healthcare-salaries.com/physicians/neurosurgeon-salary", "passage_text": "An average yearly salary range for a neurosurgeon in US is about $219,770 while an average hourly wage is about $90 per hour. In addition, a neurosurgeon with good work experience receives a salary ranging from between $500,000 – $700,000 per annum according to a Jackson and Coker salary survey. Conclusion about neurosurgeon salary. Based on medical experience, a neurosurgeon having 1 to 2 years of work experience earns about $ 68,000 while those with more than 10 years of work experience receive around $ 838,199 per annum. 1  Share on Facebook. 2  Share on Twitter."}, {"url": "http://www.healthcare-salaries.com/physicians/neurosurgeon-salary", "passage_text": "An average salary for a neurosurgeon based in Canada ranges from between 154,073 CAD – 293,432 CAD per annum while an average hourly wage ranges from between 88.04 CAD – 171.19 CAD per hour. A median salary for a neurosurgeon averages to about 254,344 CAD per annum while a median wage is about 145 CAD per hour. A highest paid neurosurgeon receives over $294,000 CAD while a lowest paid neurosurgeon earns about $154,000 CAD per annum. Conclusion about neurosurgeon salary. Based on medical experience, a neurosurgeon having 1 to 2 years of work experience earns about $ 68,000 while those with more than 10 years of work experience receive around $ 838,199 per annum. 1  Share on Facebook. 2  Share on Twitter."}, {"url": "http://www.healthcareworkersalary.com/physicians/neurosurgeon-salary/", "passage_text": "In the United Kingdom, a neurosurgeon should expect to earn an annual average salary of about £85,000. The median salary is about £102,000 per year. The salary varies based on age and experience of the surgeon and range from £64,000 entry salary to about £100,000+ per annum. A neurosurgeon with less than 5 years of experience on the job should expect to earn about $ 412,000 per year on average. For neurosurgeons with 9 to 18 years working experience, they can expect an average neurosurgeon salary of about $500"}, {"url": "http://www.brighthub.com/science/medical/articles/69003.aspx", "passage_text": "Highest Paid Physician. The salary a neurosurgeon commands in the U.S. can range between $350,000 to $850,000, with an average income of 568,000 dollars per year. These figures may or may not reflect bonuses. Neurosurgeons are the highest paid physicians and make hundreds of thousands more than most doctors including general surgeons. "}, {"url": "http://www.healthcareworkersalary.com/physicians/neurosurgeon-salary/", "passage_text": "In the United States, a high paid neurosurgeon should expect to earn a salary ranging from $580,000 to $800,000+ per year. A neurosurgeon with less than 5 years of experience on the job should expect to earn about $ 412,000 per year on average. For neurosurgeons with 9 to 18 years working experience, they can expect an average neurosurgeon salary of about $500,000 per year."}, {"url": "http://www.healthcaresalaryonline.com/neurosurgeon-salary.html", "passage_text": "The average wage for a neurosurgeon in Australia is $280,000 AUD per year. This approximately $135 per hour. The highest posted salary is over $329,000 AUD per annum. The average neurosurgeon salary is $173 per hour. The lowest 10% earn $49 per hour and those in the upper 10% earn more than $336 per hour. The hourly rate is subject to a number of factors including actual hours per week worked, number of surgeries performed, and what the billing rate is for services and surgery"}, {"url": "http://www.healthcare-salaries.com/physicians/neurosurgeon-salary", "passage_text": "An average yearly salary for a neurosurgeon with less than 5 years of work experience is about $411,038 while a neurosurgeon with work experience ranging from between 10 to 19 years receives an annual salary of about $501,276. Conclusion about neurosurgeon salary. Based on medical experience, a neurosurgeon having 1 to 2 years of work experience earns about $ 68,000 while those with more than 10 years of work experience receive around $ 838,199 per annum. 1  Share on Facebook. 2  Share on Twitter."}, {"url": "http://www.neurosurgeonsalarylife.com/", "passage_text": "For example the top paying industry in which to work as a neurosurgeon is for a speciality hospital where the average pay is $240,000 per year, followed by the offices of physicians where the salary stands at $238,000 per year. All of these financial incentive schemes take the basic pay of a neurosurgeon in the United States to between $100,000 and $780,00 per year. Hourly Payment Rates. On average a neurosurgeon in America is earning $175.00 per hour. This may be the national average for the job but there are many neurosurgeons that make much less, for example those at the lower end of the salary scale are only earning at the rate of $50.00 per hou"}]