[{"url": "http://www.auntyflo.com/dream-dictionary/bonfire", "passage_text": "You are here. Home › Dream › Bonfire. A bonfire in a dream symbolizes festivals and indicates that you have a commitment to others. This dream also demonstrates the importance of treating other people with respect, so that you do not get burnt. In addition, the bonfire dream highlights that you have passion for a hobby which will allow you financial freedom and contentment. In your dream you may have... 1  A bonfire. 2  You are lighting a bonfire."}, {"url": "http://www.definitions.net/definition/bonfire", "passage_text": "A bonfire is a controlled outdoor fire used for informal disposal of burnable waste material or as part of a celebration. Celebratory bonfires are typically designed to burn quickly and may be very large. Wiktionary (0.00 / 0 votes) Rate this definition: bonfire (Noun). A fire in which bones were burned. bonfire (Noun). A fire to burn unwanted or disreputable items or people: proscribed books, heretics etc. bonfire (Noun). A large, controlled outdoor fire, as a signal or to celebrate something"}, {"url": "http://www.thefreedictionary.com/bonfire", "passage_text": "Noun. 1. bonfire-a large outdoor fire that is lighted as a signal or in celebration. balefire. fire-the event of something burning (often destructive); they lost everything in the fire. (for rubbish) → feu m (de jardin) Bonfire Night n (British) → 5 novembre m (commemoration commémoration de la tentative manquee Manquée De guy fawkes de faire Sauter, le parlement). en 1605"}, {"url": "http://www.oxforddictionaries.com/definition/english/bonfire", "passage_text": "Origin. Late Middle English: from bone + fire. The term originally denoted a large open-air fire on which bones were burnt (sometimes as part of a celebration), also one for burning heretics or proscribed literature. Dr Johnson accepted the mistaken idea that the word came from French bon 'good'. A large open-air fire used for burning rubbish or as part of a celebration: the smell of burning leaves from a garden bonfire figurative yet again, events had made a bonfire of her plans. More example sentences."}, {"url": "http://www.answers.com/Q/What_is_the_origin_of_the_word_bonfire", "passage_text": "Bonfire has its origin in the 1550s and used to refer to a wood  fire that was used to burn bones. It is a historical reference to  the Medieval practice of burning the de … ad and the convicted. Laary C. "}, {"url": "https://en.wikipedia.org/wiki/Bonfire", "passage_text": "A bonfire is a large but controlled outdoor fire, used either for informal disposal of burnable waste material or as part of a celebration. The name bonfire is derived from the fact that bonfires were originally fires in which bones were burned. As many other traditions in Scandinavia, St. Hans is believed to have a pagan origin, the celebration of mid summer's eve. In Sweden Walpurgis Night is celebrated on 30 April which includes the burning of a bonfire. In Finland, Midsummer Eve is celebrated with large bonfires."}, {"url": "http://www.merriam-webster.com/dictionary/bonfire", "passage_text": "Full Definition of BONFIRE. : a large fire built in the open air. See bonfire defined for English-language learners. See bonfire defined for kids. "}, {"url": "https://en.wikipedia.org/wiki/Bonfire", "passage_text": "Bonfire traditions of early spring, lit on the Sunday following Ash Wednesday (Funkensonntag), are widespread throughout the Alemannic German speaking regions of Europe and in parts of France. The burning of winter in effigy at the Sechselaeuten sechseläuten In (zuerich zürich introduced) in 1902 is inspired By this. alemannic tradition As many other traditions in Scandinavia, St. Hans is believed to have a pagan origin, the celebration of mid summer's eve. In Sweden Walpurgis Night is celebrated on 30 April which includes the burning of a bonfire. In Finland, Midsummer Eve is celebrated with large bonfires."}, {"url": "http://www.homemakerscorner.com/didknow2.htm", "passage_text": "Did you know that the term bonfire is not a good name to use for a large fire? The general agreement seems to be that the origin of the word bonfire was from bonefire, a fire in which bones were burnt. According to the Arcade Dictionary of Word Origins A bonfire was originally a fire in which bones were burned. So, we conclude that bonfire is probably not a word that should be used by Christians to describe a large fire. Big fire or camp fire seems like a good alternative. :-) mev From the web: A bonfire or balefire is a large controlled outdoor fire made from bales of straw or wood."}]