[{"url": "http://www.ncbi.nlm.nih.gov/pubmed/12661761", "passage_text": "The possible mechanism of action of ciclopirox olamine in the yeast Saccharomyces cerevisiae."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/12661761", "passage_text": "Ciclopirox olamine is a synthetic antifungal agent with a high affinity for trivalent metal cations. Ciclopirox olamine can be used to synchronize mammalian cells, but its mechanism of action is not understood well. In this study, we investigated the effect of ciclopirox olamine in yeast cells and used a genetic approach to identify potential ciclopirox olamine targets in yeast."}, {"url": "https://en.wikipedia.org/wiki/Ciclopirox", "passage_text": "Ciclopirox is a considered a hydroxypyrimidine antifungal agent (Paddock Laboratories, Inc., Oct. 2009). In addition to other formulations, ciclopirox is used in lacquers for topical treatment of onychomycosis (fungal infections of the nails)."}, {"url": "https://en.wikipedia.org/wiki/Ciclopirox", "passage_text": "In contrast to the azoles and other antimycotic drugs, the mechanism of action of ciclopirox is poorly understood. However, loss of function of certain catalase and peroxidase enzymes has been implicated as the mechanism of action, as well as various other components of cellular metabolism."}, {"url": "http://www.rxlist.com/penlac-drug/clinical-pharmacology.htm", "passage_text": "One in vitro study suggested that ciclopirox acts by chelation of polyvalent cations (Fe +3 or Al +3) resulting in the inhibition of the metal-dependent enzymes that are responsible for the degradation of peroxides within the fungal cell. The clinical significance of this observation is not known."}, {"url": "http://www.drugs.com/pro/ciclopirox.html", "passage_text": "Mechanism of Action. Ciclopirox is a hydroxypyridone antifungal agent that acts by chelation of polyvalent cations (Fe 3+ or A1 3+), resulting in the inhibition of the metal-dependent enzymes that are responsible for the degradation of peroxides within the fungal cell."}, {"url": "http://valeant.com/Portals/25/Pdf/PI/loproxshampoo-PI.pdf", "passage_text": "Ciclopirox acts by chelation of polyvalent cations (Fe 3+ or Al 3+), resulting in the inhibition of the metal-dependent enzymes that are responsible for the degradation of peroxides within the fungal cell. 12.2 Pharmacodynamics The pharmacodynamics of LOPROX Shampoo are unknown."}, {"url": "https://en.wikipedia.org/wiki/Ciclopirox", "passage_text": "Ciclopirox olamine (used in preparations called Batrafen, Loprox, Rejuvenail, Mycoster, Penlac and Stieprox) is a synthetic antifungal agent for topical dermatologic treatment of superficial mycoses. It is most useful against Tinea versicolor."}]