[{"url": "http://study.com/academy/lesson/transport-proteins-definition-types-function-examples.html", "passage_text": "Transport Proteins Act as Doors into a Cell. Your cells are constantly shipping and receiving different types of molecules, similar to how a post office handles various letters and packages. Each cell has a plasma membrane, or filter, that helps regulate what goes in and out of the cell."}, {"url": "http://www.encyclopedia.com/topic/Transport_Protein.aspx", "passage_text": "Transport Protein. There are two different types of transport proteins: those that carry molecules to distant locations (within a cell or an organism), and those that serve as gateways, carrying molecules across otherwise impermeable membranes."}, {"url": "http://en.mimi.hu/biology/transport_protein.html", "passage_text": "Transport protein s are also used in active transport. The proteins bind to the larger molecule needed within the cell and guide it into the cell, moving particles against the concentration gradient."}, {"url": "http://study.com/academy/lesson/transport-proteins-definition-types-function-examples.html", "passage_text": "In the cell, channel proteins are responsible for bringing in ions and other small molecules. Each channel protein can only bring in a specific molecule. For example, a calcium channel can only be used to transport calcium in and out of the cell."}, {"url": "http://www.nature.com/scitable/content/transport-proteins-in-the-cell-membrane-14704938", "passage_text": "Close. Transport proteins in the cell membrane. A plasma membrane is permeable to specific molecules that a cell needs. Transport proteins in the cell membrane allow for selective passage of specific molecules from the external environment."}, {"url": "http://www.answers.com/Q/What_do_transport_proteins_do", "passage_text": "Transport proteins help move (or transport) large molecules that aren't able to pass through a cell's membrane, through said cell membrane through means of diffusion."}, {"url": "http://study.com/academy/lesson/transport-proteins-definition-types-function-examples.html", "passage_text": "Transport proteins function in both active and passive transport to move molecules across the plasma membrane. Two main groups of transport proteins can be found within the plasma membrane and each helps water-loving molecules pas"}]