[{"url": "http://repairpal.com/estimator/ac-evaporator-replacement-cost", "passage_text": "Parts: $301 - $436. The average cost for an ac evaporator replacement is between $787 to $1050. Labor costs are estimated between $486 to $614 while parts are priced between $301 to $436. Get a personalized estimate based on your location and specific car. Estimate does not include taxes and fees. "}, {"url": "http://www.howmuchisit.org/evaporator-coil-cost/", "passage_text": "1 You can also get a quote or estimate of the evaporator coil replacement from the company that installed your HVAC system. 2  Also, it is a good practice to get bids from multiple contractors to check on the average price for the unit and the installation costs. 1 As we all know, there are different types of air conditioner units. 2  Not to mention that the units differ in tons per unit as well. 3  However, the average price of evaporator coils is $200 to $500 according to CentralAirconditionerPrice.com."}, {"url": "http://www.howmuchisit.org/evaporator-coil-cost/", "passage_text": "1 Installation fee. 2  This includes taking out the old evaporator coil and installing the new one. 3  Most technicians charge anywhere from $800 to $1,500 for the service. 4  According to CentralAirconditionerPrice.com, the cost for the said service with installation can be between $650 and $1,200. 1 As we all know, there are different types of air conditioner units. 2  Not to mention that the units differ in tons per unit as well. 3  However, the average price of evaporator coils is $200 to $500 according to CentralAirconditionerPrice.com."}, {"url": "http://answers.angieslist.com/How-replace-evaporator-coil-central-AC-q103219.aspx", "passage_text": "I am wondering what a rough estimate would be for replacing an evaporator coil in a central AC unit that is under warranty. We just had this repair done and it came in at over $1200, which seems very high considering the labor rate is only $100 and it took 3 hours to fix. Except for some brands that price their coils way up there - $1000 plus just for the element-I can't see $1000 labor and freon handling cost for a normal coil replacement, so sounds quite high to me."}, {"url": "http://texags.com/forums/61/topics/2065181", "passage_text": "My evaporator coil in the attic has sprung a leak and the tech that came to check it out is recommending replacement. Evidently the part is under warranty but the repair quote is still $1150 - 10 pounds of R-22 at $32/lb, $800 in labor (two guys at $80 each an hour x 5 hours), plus misc materials. "}, {"url": "http://answers.angieslist.com/How-replace-evaporator-coil-central-AC-q103219.aspx", "passage_text": "Related Questions. 1  evaporator coil gone in central ac should I just replace the AC. 2  What is the cost to replace an air conditioner coil. 3  in Charlotte NC the repair for our a/c includes an evaporator coil at $2500. 4  Home AC evaporator problem. Except for some brands that price their coils way up there - $1000 plus just for the element-I can't see $1000 labor and freon handling cost for a normal coil replacement, so sounds quite high to me."}, {"url": "http://www.howmuchisit.org/evaporator-coil-cost/", "passage_text": "1 The cost of an evaporator coil can vary depending on the various sizes and types that you select. 2  A Goodman/Dayton Evaporator Coil Horizontal 2 Ton 24,000 BTU Wide Cabinet #725, for example, is said to cost $389 according to ACdirect.com. 1 As we all know, there are different types of air conditioner units. 2  Not to mention that the units differ in tons per unit as well. 3  However, the average price of evaporator coils is $200 to $500 according to CentralAirconditionerPrice.com."}, {"url": "http://www.dslreports.com/forum/r28211712-Cost-of-Replacing-an-Evaporator-Coil", "passage_text": "So I got a quote to replace the evaporator coil with a 3 ton trane 4TXF-H, new supply plenum, transition, access door, secondary pan and float switch, primary drain run, liquid line drier, vacuum and charge for $2150. "}, {"url": "http://www.qualitysmith.com/request/articles/articles-cooling/evaporator-coil/", "passage_text": "You can’t repair a condenser coil and a compressor is extremely expensive to replace — it’s generally not worth it unless it’s covered under warranty. However, if your air conditioner stops running due to an evaporator coil, replacement is usually in the 100s of dollars, making it an affordable and wise decision. The part itself usually runs between $250 to $550 wholesale, with the low-end based on a 2-ton air conditioner and the high-end based on a 5-ton air conditioner. Add a few hundred for labor and it comes to anywhere between $500 to $900 for replacement."}, {"url": "http://www.qualitysmith.com/request/articles/articles-cooling/evaporator-coil/", "passage_text": "COST TO REPAIR AN EVAPORATOR COIL. Evaporator coil replacement depends largely upon the size of your air conditioner. The part itself usually runs between $250 to $550 wholesale, with the low-end based on a 2-ton air conditioner and the high-end based on a 5-ton air conditioner. Add a few hundred for labor and it comes to anywhere between $500 to $900 for replacement."}]