[{"url": "http://www.pathpedia.com/education/eatlas/histology/lymph_node/Images.aspx?8", "passage_text": "[LYMPH NODE, NORMAL HISTOLOGY]. Lymph nodes are small lymphoid organs distributed throughout the body at specific locations and connected to other nearby nodes by lymphatic vessels carrying lymph fluid. A node consists of two main regions cortex (long left arrow) and medullar (arrowhead). The blood vessels and efferent lymphatic channel pass through hilum (bottom arrow). The primary function of lymph node is to respond to non-self antigens and generate antigen-specific soluble antibodies from mature plasma cells. "}, {"url": "http://www.answers.com/Q/What_is_the_indented_region_where_the_blood_vessels_and_nerves_join_a_lymph_node", "passage_text": "A typical lymph node is surrounded by a connective tissue capsule separated by spaces called lymph sinuses. Several afferent vessels carry lymph into the nodes and enter the e … fferent vessels to carry lymph away from the nodes. Because there are more afferent than efferent vessels, the passage of lymph through the sinuses are slowed down, allowing time for the cleansing process. 17 people found this useful. A lymph vessel. They are similar in function to blood vessels. However the lymph is moved along the vessel by muscle contractions rather than by the heart pumping. 1 person"}, {"url": "http://en.wikivet.net/Lymphatic_Vessels_-_Anatomy_%26_Physiology", "passage_text": "Tissue fluid is collected by the afferent lymphatic vessels which drain into the lymph node where trapping of foreign material occurs to prevent spread around the body. The filtered lymph leaves the lymph node via the efferent lymphatic vessel. The smaller vessels generally travel with blood vessels and nerves. Valves in the vessels prevent back flow and keep the flow of lymph unidirectional. As there is no central pump the movement of lymph is largely dependant on skeletal muscular activity."}, {"url": "http://study.com/academy/lesson/lymph-nodes-anatomy-location-quiz.html", "passage_text": "The lymph node is covered by a tough capsule, which is penetrated in multiple places by lymphatic vessels. The lymphatic vessels attached to the outer rim of a lymph node (the side opposite the hilum) are called afferent lymphatic vessels. The lymphatic vessels emerging from the hilum are called efferent lymphatic vessels. Each lymph node possesses many afferent vessels, but usually only one or two efferent vessels. The lymph flowing into a lymph node carries with it the bacteria, viruses, cancer cells, debris, and other potentially dangerous agents that have filtered into the lymphatic vessels from your bloodstream and tissues. Lymph enters a lymph node through an afferent lymphatic vessel."}, {"url": "http://study.com/academy/lesson/lymph-nodes-anatomy-location-quiz.html", "passage_text": "Throughout the lymph node's interior are a series of street-like channels called sinuses that help guide the flow of lymph from the afferent lymphatic vessels, through the cortex and medulla, and finally to the efferent lymphatic vessels at the hilum. The lymph flowing into a lymph node carries with it the bacteria, viruses, cancer cells, debris, and other potentially dangerous agents that have filtered into the lymphatic vessels from your bloodstream and tissues. Lymph enters a lymph node through an afferent lymphatic vessel."}, {"url": "http://www.studystack.com/flashcard-83857", "passage_text": "To move the current card to one of the three colored boxes, click on the box. You may also press the UP ARROW key to move the card to the Know box, the DOWN ARROW key to move the card to the Don't know box, or the RIGHT ARROW key to move the card to the Remaining box. You may also click on the card displayed in any of the three boxes to bring that card back to the center. The structure of a lymph node can be described as being divided into compartments that contain masses of lymphocytes and macrophages, afferent vessels circulating lymph into the node on its convex surface, & efferent vessels circulating lymph out of the. node at its hilum."}, {"url": "http://www.histology.leeds.ac.uk/lymphoid/lymphnodes.php", "passage_text": "Most of the lymphocytes enter the lymph nodes via blood vessels, and about 10% enter through the lymph. The structure of the post-capillary venule, in the deep cortex (paracortex) is unusual in that it is not lined by simple squamous epithelium, but by a simple cuboidal epithelium. "}, {"url": "http://en.wikivet.net/Lymphatic_Vessels_-_Anatomy_%26_Physiology", "passage_text": "The capillaries feed into larger vessels called lympathic vessels and these have smooth muscle their walls and they pass through lymph nodes. These vessels eventually feed into two large ducts, the thoracic and the tracheal, which empty into the jugular veins. The smaller vessels generally travel with blood vessels and nerves. Valves in the vessels prevent back flow and keep the flow of lymph unidirectional. As there is no central pump the movement of lymph is largely dependant on skeletal muscular activity."}, {"url": "http://www.freezingblue.com/flashcards/print_preview.cgi?cardsetID=17045", "passage_text": "cervical region. lymph nodes in the underarm region receive lymph from vessels that drain the upper limbs, the wall of the thorax, the mammary glands and the upper wall of the abdomen. axillary region."}, {"url": "http://training.seer.cancer.gov/anatomy/lymphatic/components/nodes.html", "passage_text": "These areas are the inguinal nodes in the groin, the axillary nodes in the armpit, and the cervical nodes in the neck. The typical lymph node is surrounded by a connective tissue capsule and divided into compartments called lymph nodules. They are widely distributed throughout the body along the lymphatic pathways where they filter the lymph before it is returned to the blood. Lymph nodes are not present in the central nervous system."}]