[{"url": "https://en.wikipedia.org/wiki/Wonderlic_test", "passage_text": "It consists of 50 multiple choice questions to be answered in 12 minutes. The test was developed by Eldon F. Wonderlic. The score is calculated as the number of correct answers given in the allotted time. A score of 20 is intended to indicate average intelligence (corresponding to an intelligence quotient of 100). Wonderlic, Inc. claims a score of at least 10 points suggests a person is literate. The Wonderlic test, as a vocational and intelligence test, falls under the field of Industrial and Organizational Psychology. As a personnel test the Wonderlic is used to gauge an applicant's job potential, educational potential, and training potential."}, {"url": "http://www.wonderlic.com/assessments/skills/advanced-skills-test", "passage_text": "Go beyond basic skills! Based on the Occupational Information Network (O*NET) and Common Core State Standards, the new Wonderlic Advanced Skills Test (WAST) measures the language and mathematics skills needed to enter jobs that require “some” to “extensive” preparation, or to enter two-or four-year college programs. Assessing current employees before they enter a training program is vital to their success and your bottom line. The diagnostics provided in the report pinpoint specific areas for improvement, so no time or money is wasted."}, {"url": "http://www.personality-and-aptitude-career-tests.com/wonderlic-test-scores.html", "passage_text": "Like an IQ test, the Wonderlic test scores are based on a minimum, maximum, and average range. For instance, if you score a 24 on a Wonderlic test, you are considered to be of average intelligence. The maximum anyone can score on a Wonderlic test is 50, and a score of 10 generally means that a person is barely literate. As you can see, scores vary widely based on an average score for a given job field. Employers sometimes use Wonderlic test scores as a type of personality test, to screen prospective employees before employment."}, {"url": "http://www.wonderlic.com/assessments/skills/basic-skills-test", "passage_text": "The Wonderlic Basic Skills Test (WBST) is a short-form measure of basic verbal and quantitative skills that is designed to assess work-readiness for entry-level jobs. By selecting individuals who have the ability to handle the requirements of the job or program, training time and turnover can be reduced. This basic skills test is useful for positions where job duties include mathematical calculations, written skills or oral communication skills."}, {"url": "https://en.wikipedia.org/wiki/Wonderlic_test", "passage_text": "The Wonderlic Cognitive Ability Test (formerly known as the Wonderlic Personnel Test) is a popular group intelligence test used to assess the aptitude of prospective employees for learning and problem-solving in a range of occupations. The Wonderlic test, as a vocational and intelligence test, falls under the field of Industrial and Organizational Psychology. As a personnel test the Wonderlic is used to gauge an applicant's job potential, educational potential, and training potential."}, {"url": "http://harvardsportsanalysis.org/2014/04/wondering-about-the-wonderlic-does-it-predict-quarterback-performance/", "passage_text": "Charlie Wonderlic Jr., President of Wonderlic Inc., claims that a score of 10 and above suggests literacy, while the average score of 20 is comparable to a middling 100 IQ score. During the game, players must adjust to constantly shifting dynamics. And no position is as cerebral as quarterback. To determine whether the Wonderlic has any effect on QB performance, we examined the test results and NFL performance of 50 quarterbacks dating back to 2007."}, {"url": "http://www.academia.edu/4186022/Personnel_Problems_How_Useful_is_the_Wonderlic_Personnel_Test", "passage_text": "The test that stood out to me was the Wonderlic Personnel Test. Realistically, a personnel test should PERSONNEL PROBLEMS: HOW USEFUL 13 be brief and, yet, also relatively accurate, since decisions often have to be made quickly in business. After all, in the business world, time is money. However, he did provide information about the Wonderlic Personnel Test-Revised (WPT-R), which was released in 2007 (Kaplan & Saccuzzo, p. 500), stating that 427 companies and 36,543 test-takers participated in its development (B. Wells, personal communication, November 5, 2012)."}, {"url": "http://www.personality-and-aptitude-career-tests.com/wonderlic-personnel-test.html", "passage_text": "Short IQ Test. The Wonderlic Personal Test is a short IQ test as well. It is comprised of merely 50 questions. Some psychologists view it a shorter version of main intelligence quotient tests. The free Wonderlic Personnel test samples are even shorter. However, wonderlic personnel test has set score of 21 for average people. Quick IQ Test. Wonderlic personal test is a time limited session which you are required to complete within 12 minutes."}, {"url": "https://en.wikipedia.org/wiki/Wonderlic_test", "passage_text": "The types of questions that have appeared in the oldest versions of the Wonderlic test include: analogies, analysis of geometric figures, arithmetic, direction following, disarranged sentences, judgment, logic, proverb matching, similarities, and word definitions. The Wonderlic test, as a vocational and intelligence test, falls under the field of Industrial and Organizational Psychology. As a personnel test the Wonderlic is used to gauge an applicant's job potential, educational potential, and training potential."}]