[{"url": "http://www.sportsmd.com/wrist-hand-injuries/sprained-wrist/", "passage_text": "Sprains are an injury to a ligament. Ligaments hold bone to bone and provide stability in a joint. Because of the large numbers of ligaments located in the wrist, it is possible for an athlete to injure multiple ligaments during a significant injury. Sprains are classified depending on the severity of the injury from mild (1st degree sprain), moderate (2nd degree sprain), to severe (3rd degree sprain)."}, {"url": "http://www.sportsmd.com/wrist-hand-injuries/sprained-wrist/", "passage_text": "A sprained wrist is a fairly common injury seen in athletes because it usually is a result of a fall on an outstretched hand. Because of the large numbers of ligaments located in the wrist, it is possible for an athlete to injure multiple ligaments during a significant injury. Sprains are classified depending on the severity of the injury from mild (1st degree sprain), moderate (2nd degree sprain), to severe (3rd degree sprain)."}, {"url": "http://www.sportsinjuryclinic.net/sport-injuries/wrist-pain/wrist-sprain", "passage_text": "Symptoms of a wrist sprain vary depending on the extent of the injury and the location of the sprain. Sudden pain in the wrist will be felt at the time of injury and in more severe wrist sprains a tearing or popping feeling may be felt. A wrist sprain is quite a common injury, which usually occurs after a fall onto an outstretched hand. Other accidents or impacts can cause a sprained wrist, although it usually involves the wrist being bent either forwards or back. A sprained wrist doesn't usually occur as an overuse injury."}, {"url": "http://orthoinfo.aaos.org/topic.cfm?topic=A00023", "passage_text": "A wrist sprain is a common injury. There are many ligaments in the wrist that can be stretched or torn, resulting in a sprain. This occurs when the wrist is bent forcefully, such as in a fall onto an outstretched hand. 1 Grade 1. 2  These mild sprains occur when the ligaments are stretched, but not torn. 3  Grade 2. 4  These moderate sprains occur when the ligaments are partially torn. 5  Grade 2 sprains may involve some loss of function. 6  Grade 3. 7  These severe sprains occur when the ligament is completely torn."}, {"url": "http://www.webmd.com/fitness-exercise/wrist-sprain", "passage_text": "1 Ice your wrist to reduce pain and swelling. 2  Do it for 20-30 minutes every three to four hours for two to three days, or until the pain is gone. 3  Compress the wrist with a bandage. 4  Elevate your wrist above your heart, on a pillow or the back of a chair. as often as you can. To speed the healing, you can: 1  Rest your wrist for at least 48 hours. 2  Ice your wrist to reduce pain and swelling. 3  Do it for 20-30 minutes every three to four hours for two to three days, or until the pain is gone. 4  Compress the wrist with a bandage"}, {"url": "http://www.sportsinjuryclinic.net/sport-injuries/wrist-pain/wrist-sprain", "passage_text": "Wrist sprains can vary in severity. A mild or grade 1 wrist sprain may involve the ligament being stretched. Moderate or grade 2 injuries are partial tears of a ligament and severe grade 3 injuries are full ruptures of one or more ligaments. Grade 3 injuries may also involve an avulsion fracture where a fragment of bone is pulled off with the ligament. A wrist sprain is quite a common injury, which usually occurs after a fall onto an outstretched hand. Other accidents or impacts can cause a sprained wrist, although it usually involves the wrist being bent either forwards or back. A sprained wrist doesn't usually occur as an overuse injury."}, {"url": "http://www.webmd.com/fitness-exercise/wrist-sprain", "passage_text": "1 Rest your wrist for at least 48 hours. 2  Ice your wrist to reduce pain and swelling. 3  Do it for 20-30 minutes every three to four hours for two to three days, or until the pain is gone. 4  Compress the wrist with a bandage. 5  Elevate your wrist above your heart, on a pillow or the back of a chair. as often as you can. To speed the healing, you can: 1  Rest your wrist for at least 48 hours. 2  Ice your wrist to reduce pain and swelling. 3  Do it for 20-30 minutes every three to four hours for two to three days, or until the pain is gone. 4  Compress the wrist with a bandage"}, {"url": "http://www.assh.org/handcare/hand-arm-injuries/wrist-sprains", "passage_text": "DESCRIPTION. A sprain is an injury to a ligament. Ligaments are the connective tissues that connect bones to bones; they could be thought of as tape that holds the bones together at a joint (see Figure 1). The most common ligament to be injured in the wrist is the scapho-lunate ligament (see Figure 2). It is the ligament between two of the small bones in the wrist, the scaphoid bone and the lunate bone. There are many other ligaments in the wrist, but they are less frequently injured. Sprains can have a wide range of severity; minor sprains may have minimal stretch of the ligaments, and more severe sprains may represent complete tears of the ligament(s)."}, {"url": "http://www.webmd.com/fitness-exercise/wrist-sprain", "passage_text": "A wrist sprain is a common injury for all sorts of athletes. All it takes is a momentary loss of balance. As you slip, you automatically stick your hand out to break your fall. But once your hand hits the ground, the force of impact bends it back toward your forearm. To speed the healing, you can: 1  Rest your wrist for at least 48 hours. 2  Ice your wrist to reduce pain and swelling. 3  Do it for 20-30 minutes every three to four hours for two to three days, or until the pain is gone. 4  Compress the wrist with a bandage"}]