[{"url": "http://www.webmd.com/heart-disease/features/5-heart-rate-myths-debunked?page=2", "passage_text": "4. Myth: If my heart rate is normal, my blood pressure is fine. Sometimes your heart rate and your blood pressure go hand in hand. For example, when you exercise, or get angry or scared, they both go up. But they're not always linked. If your heart rate is normal, your blood pressure may not be. It could be too high or too low, and you may not realize it. Even if your heart rate seems fine, get your blood pressure checked regularly."}, {"url": "http://www.heart.org/HEARTORG/Conditions/HighBloodPressure/AboutHighBloodPressure/Blood-Pressure-vs-Heart-Rate_UCM_301804_Article.jsp", "passage_text": "1 Measuring pulse rate does not indicate high or low blood pressure. 2  For people with high blood pressure, there's no substitute for measuring blood pressure. 3  A rising heart rate does not cause your blood pressure to increase at the same rate. 1 A rising heart rate does not cause your blood pressure to increase at the same rate. 2  Even though your heart is beating more times a minute, healthy blood vessels dilate (get larger) to allow more blood to flow through more easily. 3  When you exercise, your heart speeds up so the blood can reach your muscles."}, {"url": "http://chemocare.com/chemotherapy/side-effects/rapid-heart-beat.aspx", "passage_text": "A rapid or fast heartbeat is when your heart is beating faster than normal. A normal heart rate is 60 to 100 beats per minute. Tachycardia is considered a heart rate of greater than 100 beats per minute. If you are exercising, or performing any kind of activity, your heart will normally beat faster. This allows your heart to pump blood through out your body, to provide oxygen to the tissues."}, {"url": "http://symptomchecker.webmd.com/multiple-symptoms?symptoms=low-blood-pressure%7Crapid-heart-rate-(pulse)&symptomids=405%7C184&locations=66%7C14", "passage_text": "Low blood pressure and Rapid heart rate (pulse). WebMD Symptom Checker helps you find the most common medical conditions indicated by the symptoms low blood pressure and rapid heart rate (pulse) including Low blood pressure (hypotension), Dehydration (Children), and Panic attack. There are 36 conditions associated with low blood pressure and rapid heart rate (pulse). The links below will provide you with more detailed information on these medical conditions from the WebMD Symptom Checker and help provide a better understanding of causes and treatment of these related conditions."}, {"url": "http://www.heart.org/HEARTORG/Conditions/Arrhythmia/AboutArrhythmia/Tachycardia-Fast-Heart-Rate_UCM_302018_Article.jsp", "passage_text": "Tachycardia = Too fast. A heart rate of more than 100 beats per minute (BPM) in adults is called tachycardia. What's too fast for you may depend on your age and physical condition. Atrial or Supraventricular Tachycardia (SVT). Atrial or Supraventricular tachycardia (SVT) is a fast heart rate that starts in the upper chambers of the heart. Some forms are called paroxysmal atrial tachycardia (PAT) or paroxysmal supraventricular tachycardia (PSVT)."}, {"url": "https://answers.yahoo.com/question/index?qid=20080601183132AAsAyto", "passage_text": "My heart rate tends to run a little high-upwards of 100-110 bpm, while my blood pressure is a bit low.. usually around 90/60. I understand that this can be related, with the low blood pressure causing the increase in heart rate, but my question was... the usual problem with a high heart rate is the increased... "}, {"url": "http://www.ehow.com/facts_5549012_normal-pressure-high-pulse-rate.html", "passage_text": "Function. Blood pressure and pulse rate are both measures of heart function, but they measure different things. Blood pressure is the force of the blood as it moves through the arteries, and pulse rate is the number of times your heart beats each minute. Misconceptions. When your pulse rate rises, your blood pressure doesn't rise with it. Even though your heart is beating faster due to activity, stress or a health issue, the force of the pumping blood isn't affected."}, {"url": "http://www.livescience.com/42081-normal-heart-rate.html", "passage_text": "High blood pressure vs. high heart rate. Some people confuse high blood pressure with a high heart rate. Blood pressure is the measurement of the force of the blood against the walls of arteries, while pulse rate is the number of times your heart beats per minute. "}, {"url": "http://www.heart.org/HEARTORG/Conditions/HighBloodPressure/AboutHighBloodPressure/Blood-Pressure-vs-Heart-Rate_UCM_301804_Article.jsp", "passage_text": "Here are some more things to know about the correlation between blood pressure and heart rate. 1  There is no good correlation between pulse rate and blood pressure. 2  Measuring pulse rate does not indicate high or low blood pressure. 1 A rising heart rate does not cause your blood pressure to increase at the same rate. 2  Even though your heart is beating more times a minute, healthy blood vessels dilate (get larger) to allow more blood to flow through more easily. 3  When you exercise, your heart speeds up so the blood can reach your muscles."}, {"url": "http://www.livescience.com/42219-blood-pressure.html", "passage_text": "The bottom number, called the diastolic pressure, is the measurement as the heart relaxes between beats. Normal blood pressure is a systolic pressure of less than 120 millimeters of mercury (mm Hg) and a diastolic pressure of less than 80 mm Hg, or 120/80 mm Hg, according to the American Heart Association (AHA). Having a blood pressure greater than 140/90 mm Hg is considered high blood pressure or hypertension. "}]