[{"url": "http://www.hopkinsmedicine.org/healthlibrary/conditions/endocrinology/hormones_and_the_endocrine_system_85,P00402/", "passage_text": "Affects growth and development; stimulates protein production; affects fat distribution. Pituitary gland. Luteinizing hormone (LH) and follicle-stimulating hormone (FSH). Controls production of sex hormones (estrogen in women and testosterone in men) and the production of eggs in women and sperm in men. Consider the following hormones and their role in the workings of the endocrine system: Where the hormone is produced. Hormone(s) secreted. Hormone function. Adrenal glands. Aldosterone. Regulates salt, water balance, and blood pressure. Adrenal glands. Corticosteroid."}, {"url": "http://www.abpischools.org.uk/page/modules/homeostasis_kidneys/kidneys6.cfm", "passage_text": "The hypothalamus sends a message to the pituitary gland which releases ADH. This travels in the blood to your kidneys and affects the tubules so more water is reabsorbed into your blood. As a result you make a smaller volume of more concentrated urine. Hormones are made in glands which then release them into your bloodstream. They are carried around the body in your blood to their target organs. Hormones regulate the functions of many of your organs and cells, including the amount of water which is reabsorbed by your kidneys."}, {"url": "http://www.hopkinsmedicine.org/healthlibrary/conditions/endocrinology/hormones_and_the_endocrine_system_85,P00402/", "passage_text": "The endocrine system uses hormones to control and coordinate your body's internal metabolism (or homeostasis) energy level, reproduction, growth and development, and response to injury, stress, and environmental factors. Consider the following hormones and their role in the workings of the endocrine system: Where the hormone is produced. Hormone(s) secreted. Hormone function. Adrenal glands. Aldosterone. Regulates salt, water balance, and blood pressure. Adrenal glands. Corticosteroid."}, {"url": "http://raypeat.com/articles/articles/growth-hormone.shtml", "passage_text": "The osmoregulatory problem--keeping water under control--is centrally involved in stress. In mammals, the kidneys and bowel are the main regulators of water balance. GH is a stress hormone. Its effects can be produced osmotically, for example inducing milk production and cartilage growth, by osmotic (dilution) shock. "}, {"url": "https://answers.yahoo.com/question/index?qid=20100508034215AA3QwPL", "passage_text": "Best Answer: In the kidneys, we secrete water and waste into tubules to eventually be released as urine. But before it becomes urine, we need to reabsorb some of the water from the tubules back into our bodies and blood. Its a balance-too much water in the body is bad and too little is bad as well. Damage to the pituitary gland can prevent the secretion of the hormone ADH. Explain how this affects osmoregulation by the kidney (4 marks). Update: please explain i don't understand wiki's complicated vocab. Follow."}, {"url": "http://www.cancerindex.org/medterm/medtm12.htm", "passage_text": "Hormones. are secreted from the glands of the endocrine system, they are specific in that each hormone causes a response in a specific target organ or group of cells, rather than on the body as a whole. Exocrine hormones are secreted via a duct into the blood and usually effect a distant organ or tissue. The Anterior Lobe of the pituitary plays the 'master' role secreting six major hormones that affect most of the body, including the other Endocrine glands: 1  ACTH (Adrenocorticotrophic hormone) stimulates the adrenal glands to secrete its hormones."}, {"url": "http://www.people.vcu.edu/~elmiles/hormones/KidneyHormones_print.html", "passage_text": "ADH (Antidiuretic Hormone). The brain and kidneys regulate the amount of water excreted by the body. When the blood volume is low, the concentration of solutes in the blood is high. When the hypothalamus senses this low blood volume and increased serum osmolality it synthesizes ADH, a small peptide molecule. ADH (continued). Increased blood volume prevents the release of ADH. As a result, the kidneys retain less water, which dilutes the urine and increases urine output. As fluid leaves the body, blood volume decreases and serum osmolality increases"}, {"url": "http://www.hopkinsmedicine.org/healthlibrary/conditions/endocrinology/hormones_and_the_endocrine_system_85,P00402/", "passage_text": "Pituitary gland. Antidiuretic hormone (vasopressin). Affects water retention in kidneys; controls blood pressure. Pituitary gland. Adrenocorticotropic hormone (ACTH). Controls production of sex hormones (estrogen in women and testosterone in men) and the production of eggs in women and sperm in men. Consider the following hormones and their role in the workings of the endocrine system: Where the hormone is produced. Hormone(s) secreted. Hormone function. Adrenal glands. Aldosterone. Regulates salt, water balance, and blood pressure. Adrenal glands. Corticosteroid."}, {"url": "http://www.vivo.colostate.edu/hbooks/pathphys/endocrine/hypopit/overview.html", "passage_text": "The pituitary gland is often portrayed as the master gland of the body. Such praise is justified in the sense that the anterior and posterior pituitary secrete a battery of hormones that collectively influence all cells and affect virtually all physiologic processes. The pituitary gland may be king, but the power behind the throne is clearly the hypothalamus. As alluded to in the last section, some of the neurons within the hypothalamus-neurosecretory neurons-secrete hormones that strictly control secretion of hormones from the anterior pituitar"}]