[{"url": "https://answers.yahoo.com/question/index?qid=20080908152301AA1FseJ", "passage_text": "How much muscle you lose depends on a lot of things, but especially your diet and exercise. Keep protein levels high (at least one gram per pound of body weight), and try to keep cardio sessions short. I would try to do two 15 minute sessions. Splitting it will cause you to lose less muscle. I want to maintain my size and still lose fat, so how much cardio should I be doing? At the moment I do 20 minutes hard, someone told me to do just 10 but I don't know, was wondering that the yahoo answers community thought about this. Thanks."}, {"url": "https://www.sharecare.com/health/exercise-weight-loss/how-much-cardio-should-i-do-to-lose-weight", "passage_text": "Start by attempting to do at least 10 minutes of cardio every day. You could walk around the neighborhood at a moderate pace, climb the stairs in your home, or jump on the stationary bike at your local gym. Gradually increase your duration from 10 minutes per day to 15 minutes, then to 20 minutes, and so on. Beginners should start with about 3 non-consecutive days of cardio and work their way up to more frequent sessions. The general guidelines to lose weight are four or more days a week of at least 30 minutes. Keep in mind that doing too much cardio is a no-no as well and can actually backfire."}, {"url": "http://www.aworkoutroutine.com/how-much-cardio/", "passage_text": "So one person might need to do 600 calories worth of cardio 3 times per week. Maybe 5 times per week. Maybe 325 calories worth 4 times per week. Maybe dozens of other amounts dozens of other frequencies. You should do the exact amount necessary to accomplish the goal you’re doing this cardio for in the first place, but not so much that it has a negative impact on any other goals you may also have (assuming of course other goals exist beyond the goal the cardio is being done for)."}, {"url": "http://healthyliving.azcentral.com/much-cardio-day-lose-belly-fat-18146.html", "passage_text": "A pound of fat contains roughly 3,500 calories, so a 500-calorie-a-day deficit will cause you to lose about 1 pound each week. You can achieve this by eating 250 fewer calories than usual -- provided your weight is steady on your current diet -- while burning about 250 extra calories per day with cardio. Cardiovascular exercise is the most efficient way to burn calories -- and the more calories you burn, the faster fat will vanish from your whole body, including your stomach. However, you won't be able to target your belly for fat loss no matter how much you work out because spot reduction doesn't exist."}, {"url": "http://www.aworkoutroutine.com/how-much-cardio/", "passage_text": "1 Consume 2000 calories per day and do no cardio whatsoever. 2  Consume 2500 calories per day and do an amount of cardio that allows them to burn 500 additional calories thus ending up at the same 2000 they need to be at. You should do the exact amount necessary to accomplish the goal you’re doing this cardio for in the first place, but not so much that it has a negative impact on any other goals you may also have (assuming of course other goals exist beyond the goal the cardio is being done for)."}, {"url": "http://www.coachcalorie.com/how-much-cardio-to-lose-weight/", "passage_text": "Determining Your Cardio Requirements. Now that you know if you should be doing cardio or not, let’s briefly cover how much cardio you should do to lose weight. I recommend that you do the least amount that is necessary to reach both your exercise goals AND your body composition goals. "}, {"url": "https://www.sharecare.com/health/exercise-weight-loss/how-much-cardio-should-i-do-to-lose-weight", "passage_text": "Cardio is not the only thing that will help you lose weight. You also have weight training and proper meal planning to help you out as well. Cardio is only one part of the puzzle to help you lose weight. Remember to lose 1 pound of fat you must burn 3500 calories or have your deficit at 500 calories per day. How much cardio you want to do is up to you and your body. You want to start out by doing what the body can handle at first and then build from there. Beginners should start with about 3 non-consecutive days of cardio and work their way up to more frequent sessions. The general guidelines to lose weight are four or more days a week of at least 30 minutes. Keep in mind that doing too much cardio is a no-no as well and can actually backfire."}, {"url": "http://healthyliving.azcentral.com/much-cardio-day-lose-belly-fat-18146.html", "passage_text": "If you're new to exercise, work up to 60 minutes per day, five days per week of moderate cardio such as brisk walking, dancing or biking at a leisurely speed. Walking at 3.5 mph, a 160-pound person burns about 314 calories per hour, while the same person burns about 292 calories per hour cycling around 10 mph. Cardiovascular exercise is the most efficient way to burn calories -- and the more calories you burn, the faster fat will vanish from your whole body, including your stomach. However, you won't be able to target your belly for fat loss no matter how much you work out because spot reduction doesn't exist."}, {"url": "http://www.bodybuilding.com/fun/fat-loss-fouls-4-cardio-mistakes.html", "passage_text": "A tip: If you have to do an hour or more of cardio per day just to burn off the extra calories you consumed, the answer is to look at your diet. You can spend all day on the treadmill and never outrun your bad choices. "}, {"url": "http://www.aworkoutroutine.com/how-much-cardio/", "passage_text": "To make this happen, our example person can: 1  Consume 2000 calories per day and do no cardio whatsoever. 2  Consume 2500 calories per day and do an amount of cardio that allows them to burn 500 additional calories thus ending up at the same 2000 they need to be at. You should do the exact amount necessary to accomplish the goal you’re doing this cardio for in the first place, but not so much that it has a negative impact on any other goals you may also have (assuming of course other goals exist beyond the goal the cardio is being done for)."}]