[{"url": "http://www.bvhealthsystem.org/upload/docs/Lab/Blood%20Culture%20Collection%20Procedure.pdf", "passage_text": "Collection Container: VersaTRECK blood culture collection bottles, anaerobic (red label) and aerobic (blue/silver Label). Select a site for venipuncture. Cleanse the venipuncture site with 70% alcohol followed by 2% iodine tincture. Clean the area in a circular motion, starting from the inside working outward. "}, {"url": "http://www.tdlpathology.com/test-information/sample-taking-instructions/microbiology/blood-cultures", "passage_text": "1 Collect between 10 and 20 ml of blood from the patient. 2  Inoculate the two blood culture bottles with equal amounts. 3  The aerobic bottle (blue top) must always be inoculated first to avoid the release of air from the syringe into the anaerobic bottle. The multiplication of microorganisms in positive cultures generates CO2. As this increases the sensor in the bottle turns to a lighter colour. By measuring reflected light the BacT/ALERT 3D monitors and detects colour changes in the sensor."}, {"url": "http://lifeinthefastlane.com/ccc/blood-culture-bottles/", "passage_text": "DESCRIPTION Types of blood culture bottles and blood volumes required: 1  Yellow top – paediatric aerobic (0.5–4 mL blood). 2  Green top – adult aerobic (5–10 mL blood). 3  Orange top – anaerobic (5–10 mL blood). 4  Black top – mycobacteria (5–10 mL blood). 5  Silver top – mycoplasma (3–5 mL blood). "}, {"url": "http://pathology.bsuh.nhs.uk/pathology/MicrobiologyInfection/Specimensandrequests/Takingbloodcultures/tabid/169/Default.aspx", "passage_text": "Bottle type Colour Blood volume Indication for use Aerobic (Standard/10 Aerobic/F) Blue 8 - 10 mL All routine blood cultures Anaerobic (Standard Anaerobic/F) Yellow 5 - 7 mL Add one anaerobic bottle to each aerobic bottle in suspected endocarditis and PUO. The medical microbiologists will contact the relevant clinican in the event of any blood culture growing a significant organism; there is no need to telephone the laboratory to chase results. References Taking blood cultures: A summary of best practice."}, {"url": "http://www.geisingermedicallabs.com/MicroApp/anaerobic_culture_collection.shtml", "passage_text": "1 The anaerobic specimen collector protects anaerobic bacteria from exposure to toxic amounts of oxygen until the specimen is inoculated on appropriate medium in an anaerobic environment. 2  Use the Anaerobic Transport Media for collection and transportation of anaerobic specimens for up to 72 hours. "}, {"url": "http://www.fairview.org/fv/groups/intranet/documents/labprocedures/s_087248.pdf", "passage_text": "The activated charcoal in the new bottles results in the media being a black color. Blood Culture Collection Components: Proper filling of BacT bottles • To ensure accurate and optimal filling of each BacT blood culture bottle, it is important to place hash marks on the bottle prior to collection to identify: 1. Blood collection process for blood cultures: Optimal blood collection volume for Adult patients • Adults: 8-10mL blood per bottle (Green/Aerobe and Orange/Anaerobic bottle) • Do not overfill blood culture bottle(s)."}, {"url": "http://www.surgeryencyclopedia.com/A-Ce/Anaerobic-Bacteria-Culture.html", "passage_text": "An anaerobic bacteria culture is a method used to grow anaerobes from a clinical specimen. Obligate anaerobes are bacteria that can live only in the absence of oxygen. Obligate anaerobes are destroyed when exposed to the atmosphere for as briefly as 10 minutes. Some anaerobes are tolerant to small amounts of oxygen."}, {"url": "http://www.mysynergylab.com/resources/microbiology_quick_guides/blood_cultures_-_aerobic_anaerobic.aspx", "passage_text": "Blood Cultures-Aerobic & Anaerobic. Blood cultures are drawn into special bottles that contain a special medium that will support the growth and allow the detection of micro-organisms that prefer oxygen (aerobes) or that thrive in a reduced-oxygen environment (anaerobes). Multiple samples are usually collected."}, {"url": "http://www.fairview.org/fv/groups/intranet/documents/labprocedures/s_087248.pdf", "passage_text": "Blood collection process for blood cultures: Order of draw for BacT bottles • If blood is collected using syringe system, transfer blood by attaching syringe to multi-sample transfer set. Insert blood culture bottle(s)/tube(s) and allow vacuum to fill. • Assure that air is never transferred into the anaerobic bottle: – Avoid air bubbles from a syringe during sample transfer to bottle– Avoid air from butterfly tubing with holder by filling the aerobic bottle before the anaerobic bottle. Blood collection process for blood cultures: Optimal blood collection volume for Adult patients • Adults: 8-10mL blood per bottle (Green/Aerobe and Orange/Anaerobic bottle) • Do not overfill blood culture bottle(s)."}, {"url": "http://pathology.bsuh.nhs.uk/pathology/MicrobiologyInfection/Specimensandrequests/Takingbloodcultures/tabid/169/Default.aspx", "passage_text": "The taking of blood cultures to detect bacteraemia is an important medical investigation affecting the diagnosis and treatment of our patients. Their value will be maximised by taking the cultures for the appropriate indications and with the correct technique in order to reduce the risk of contamination. The medical microbiologists will contact the relevant clinican in the event of any blood culture growing a significant organism; there is no need to telephone the laboratory to chase results. References Taking blood cultures: A summary of best practice."}]