[{"url": "http://www.webmd.com/a-to-z-guides/connective-tissue-disease", "passage_text": "Inherited Disorders of Connective Tissue. Some connective tissue diseases -- often called heritable disorders of connective tissue (HDCTs) -- are the result of changes in certain genes. Many of these are quite rare. Following are some of the more common ones. Ehlers-Danlos syndrome (EDS). Connective tissue disease refers to a group of disorders involving the protein-rich tissue that supports organs and other parts of the body. Examples of connective tissue are fat, bone, and cartilage."}, {"url": "http://www.medicinenet.com/connective_tissue_disease/article.htm", "passage_text": "Connective tissue diseases are actually a group of medical diseases. A connective tissue disease is any disease that has the connective tissues of the body as a primary target of pathology. The connective tissues are the structural portions of our body that essentially hold the cells of the body together. The specific causes of most connective tissue diseases are not known. However, there are genetic patterns that are considered to increase the risk for developing connective tissue diseases."}, {"url": "http://www.mayoclinic.org/diseases-conditions/mixed-connective-tissue-disease/basics/definition/CON-20026515", "passage_text": "Definition. Mixed connective tissue disease has signs and symptoms of a combination of disorders — primarily lupus, scleroderma and polymyositis. For this reason, mixed connective tissue disease is sometimes referred to as an overlap disease. In mixed connective tissue disease, the symptoms of the separate diseases usually don't appear all at once. Instead, they tend to occur in sequence over a number of years, which can make diagnosis more complicated. Early signs and symptoms often involve the hand"}, {"url": "http://www.ghr.nlm.nih.gov/conditionCategory/bones-muscles-and-connective-tissues", "passage_text": "Connective tissue is a broad term for supportive tissues that provide the body’s framework. Connective tissues include bones, muscles, cartilage, and tendons. There are a number of disorders that are caused by defects in genes important for the formation and function of connective tissue. 1  2q37 deletion syndrome. "}, {"url": "http://my.clevelandclinic.org/health/diseases_conditions/hic-connective-tissue-diseases", "passage_text": "A connective tissue disease is any disease that affects the parts of the body that connect the structures of the body together. Connective tissues are made up of two proteins: collagen and elastin. Collagen is a protein found in the tendons, ligaments, skin, cornea, cartilage, bone, and blood vessels. Elastin is a stretchy protein that resembles a rubber band and is the major component of ligaments and skin. When a patient has a connective tissue disease, the collagen and elastin are inflamed."}, {"url": "http://www.medicinenet.com/connective_tissue_disease/article.htm", "passage_text": "Many connective tissue diseases feature abnormal immune system activity with inflammation in tissues as a result of an immune system that is directed against one's own body tissues (autoimmunity). Diseases in which inflammation or weakness of collagen tends to occur are also referred to as collagen diseases. The specific causes of most connective tissue diseases are not known. However, there are genetic patterns that are considered to increase the risk for developing connective tissue diseases."}]