[{"url": "http://media.autospec.com/za/gundle/pdf/co-ex_brochure.pdf", "passage_text": "Co-extruded 3 Layer Films. Multi-layer co-extrusion has the following advantages:• It has a cross-linking effect between the different layers, which gives the sheeting added strength."}, {"url": "http://www.tappi.org/content/events/07europlace/papers/07europl48.pdf", "passage_text": "The examination demonstrated that films formulated with metallocene LLDPE imparted significantly better sealing properties compared with other polymers, resulting in significant improvements in packaging line speed."}, {"url": "http://www.tappi.org/content/events/07europlace/papers/07europl48.pdf", "passage_text": "Hence, we believe that a C6-mLLDPE / HDPE co-extruded sealant film structure would have significant advantages for this end-use compared to competitive formulations based on C8-(m)LLDPE / HDPE blends, in that it would provide stiffness and deliver at the same time better hot-tack than C8-LLDPE / HDPE formulations."}, {"url": "http://www.glenroy.com/tools/faq", "passage_text": "If you aren’t sure what flexible packaging structure you need, we have an experienced team of packaging engineers that can assist with structure suggestions and provide resources such as product/package compatibility testing."}, {"url": "http://www.glenroy.com/tools/faq", "passage_text": "Converting is simply changing something into a different form. In the case of flexible packaging, converting would be the process of utilizing films, foils and resins and through the process of lamination, forming them into a multilayer structure."}, {"url": "http://www.mbadeck.net/our-product-line-up/1512-2/", "passage_text": "Trex is the perennial category leader with a 51% market share. Trex has adapted their traditional composite core to be co-extruded with a polymer wrap for durability. Trex also has a line of cellular PVC decking. Trex’s composite core is made up of recycled wood and plastic components."}, {"url": "http://www.glenroy.com/tools/faq", "passage_text": "I'd like to know what packaging film structure is being used for a competitor's product in the marketplace in order to identify potential materials to use in my own packaging. Glenroy’s packaging engineers can reverse engineer a supplied package and offer a structure suggestion based on the results."}, {"url": "http://www.vishakhapolyfab.com/blownfilm.shtml", "passage_text": "They are usually multi-layer in nature as they have various layers of barrier material Evoh or polyamide When it comes to manufacturing of sophisticated 9, 7, 5 layer co-extruded film structures for the barrier packaging markets, Vishakha certainly has an edge over the rest."}, {"url": "http://www.glenroy.com/tools/faq", "passage_text": "The actual process of extrusion coating involves extruding resin from a slot die at temperatures up to 610°F/320°C directly onto the moving web, which is then passed through a nip consisting of a rubber covered pressure roller and a chrome plated cooling roll."}]