[{"url": "http://www.matchcollege.com/public-colleges/tennessee-technological-university", "passage_text": "More information from the admissions office can be found here. The cost of undergraduate tuition is different for in-state and nonresidents. In-state residents pay around $7,000 and out-of-state residents pay $22,000 annually. Student housing is available on-campus for students. The yearly cost of housing is around $4,300."}, {"url": "http://colleges.usnews.rankingsandreviews.com/best-colleges/tennessee-tech-3523", "passage_text": "Tennessee Technological University is a public institution that was founded in 1915. It has a total undergraduate enrollment of 10,314, its setting is rural, and the campus size is 235 acres. It utilizes a semester-based academic calendar. Tennessee Technological University's ranking in the 2016 edition of Best Colleges is Regional Universities (South), 35. Its in-state tuition and fees are $8,300 (2015-16); out-of-state tuition and fees are $24,500 (2015-16). The student-faculty ratio at Tennessee Technological University is 20:1, and the school has 40.4 percent of its classes with fewer than 20 students."}, {"url": "http://www.collegefactual.com/colleges/tennessee-technological-university/paying-for-college/tuition-and-fees/", "passage_text": "Future Full-Time Tuition and Fees. Tuition for out-of-state students attending Tennessee Technological University increased at an average annual rate of 6.0% over the past 5 years. Over that same period, fees grew by 6.1%. Based on this, we estimate the cost of tuition and fees for 2014 - 2015 will total $23,386. Tuition and Fees Discounted Based On Residency. Full-time undergraduate students that do not reside in Tennessee paid $22,063 in tuition and fees for the 2013 - 2014 school year prior to adjustments for financial need. Of this amount, $20,808 was the cost of tuition and $1,255 the cost of fees."}, {"url": "https://www.tntech.edu/admissions/undergraduates/tuition/", "passage_text": "These costs for in-state students taking 15 or more credit hours per semester and are comprised of the direct annual costs of attending Tennessee Tech University. Some courses may require additional fees. For a detailed list of expenses, please visit the Bursar's Office (Business Office) tuition and fees page. "}, {"url": "http://www.collegecalc.org/colleges/tennessee/tennessee-technological-university/", "passage_text": "Tennessee Technological University tuition is $6,168 per year for in-state residents. This is 4% cheaper than the national average public four year tuition of $6,429. 90% of Tennessee Technological University students received grant aid in 2013/2014. The average total aid amount was $7,746. 36 percent of students received aid in the form of Pell Grants from the U.S. Federal Government. The average Pell Grant awarded for 2013/2014 was $4,153."}, {"url": "http://www.collegecalc.org/colleges/tennessee/tennessee-technological-university/", "passage_text": "Undergraduate Tuition. Tennessee Technological University tuition is $6,168 per year for in-state residents. This is 4% cheaper than the national average public four year tuition of $6,429. The cost is $11,140 and 64% cheaper than the average Tennessee tuition of $17,308 for 4 year colleges. Tuition ranks 3rd in Tennessee amongst 4 year colleges for affordability and is the 65th most expensive 4 year college in the state. 90% of Tennessee Technological University students received grant aid in 2013/2014. The average total aid amount was $7,746. 36 percent of students received aid in the form of Pell Grants from the U.S. Federal Government. The average Pell Grant awarded for 2013/2014 was $4,153."}, {"url": "http://www.collegecalc.org/colleges/tennessee/tennessee-technological-university/", "passage_text": "The total list price for in-state Tennessee residents to go to Tennessee Tech is $18,279 for the 2014/2015 academic year. Out-of-state students who don't possess Tennessee residence can expect a one year cost of $33,279. 90% of Tennessee Technological University students received grant aid in 2013/2014. The average total aid amount was $7,746. 36 percent of students received aid in the form of Pell Grants from the U.S. Federal Government. The average Pell Grant awarded for 2013/2014 was $4,153."}, {"url": "http://www.cappex.com/colleges/Tennessee-Technological-University/tuition-and-costs", "passage_text": "Historical Tuition and Fees, with Projected Future Amounts. Future projections are based on past four years' data averaging 7.09% annual change in in-state tuition and fees and 6.32% change in out-of-state tuition and fees. Amounts shown are estimates only and not guaranteed. $4,383 Annual Institutional Aid"}]