[{"url": "http://www.rxlist.com/fetzima-drug/indications-dosage.htm", "passage_text": "The recommended dose range for FETZIMA is 40 mg to 120 mg once daily, with or without food. FETZIMA should be initiated at 20 mg once daily for 2 days and then increased to 40 mg once daily. Based on efficacy and tolerability, FETZIMA may then be increased in increments of 40 mg at intervals of 2 or more days. The maximum recommended dose is 120 mg once daily. FETZIMA should be taken at approximately the same time each day. FETZIMA should be swallowed whole. Do not open, chew or crush the capsule."}, {"url": "http://www.medicationdaily.com/fetzima/info/dosage-and-administration", "passage_text": "2.1 General Instruction for Use. The recommended dose range for FETZIMA is 40 mg to 120 mg once daily, with or without food. FETZIMA should be initiated at 20 mg once daily for 2 days and then increased to 40 mg once daily. Based on efficacy and tolerability, FETZIMA may then be increased in increments of 40 mg at intervals of 2 or more days. The maximum recommended dose is 120 mg once daily. FETZIMA should be taken at approximately the same time each day. FETZIMA should be swallowed whole."}, {"url": "http://www.rxlist.com/fetzima-drug/indications-dosage.htm", "passage_text": "The dose of FETZIMA should not exceed 80 mg once daily when used with strong CYP3A4 inhibitors (e.g. ketoconazole, clarithromycin, ritonavir) [see DRUG INTERACTIONS ]. FETZIMA (levomilnacipran) is available as 20 mg, 40 mg, 80 mg and 120 mg extended-release capsules. The maximum recommended dose is 120 mg once daily. FETZIMA should be taken at approximately the same time each day. FETZIMA should be swallowed whole. Do not open, chew or crush the capsule."}, {"url": "http://www.fetzimahcp.com/recommended-dosing", "passage_text": "1 daily for 2 days and then increased to 40 mg. 2  once daily 1. 3  Based on efficacy and tolerability, the. 4  dose may be increased in increments. 5  of 40 mg at intervals of 2 or more days 1. 6  The maximum recommended dose of FETZIMA is 120 mg/day 1. 7  FETZIMA should be taken at approximately. 8  the same time each day. 1 of 40 mg at intervals of 2 or more days 1. 2  The maximum recommended dose of FETZIMA is 120 mg/day 1. 3  FETZIMA should be taken at approximately. 4  the same time each day. 5  FETZIMA should be swallowed whole."}, {"url": "http://www.pharmacytimes.com/publications/issue/2014/January2014/Fetzima-by-Forest-Laboratories-and-Pierre-Fabre-Laboratories", "passage_text": "1. Dosage and Administration. The recommended dose of Fetzima is 40 to 120 mg once daily. It should be initiated as 20 mg once daily for 2 days and then increased to 40 mg once daily, with subsequent increases in 40-mg increments every 2 days or more based on efficacy and tolerability. "}, {"url": "http://depression.emedtv.com/fetzima/fetzima-dosage.html", "passage_text": "Fetzima Dose for People With Kidney Disease. People with moderate kidney disease should generally not receive more than 80 mg of Fetzima a day. For people with severe kidney disease, the maximum recommended dosage is 40 mg a day. This drug is not recommended for use in people with end-stage kidney d"}, {"url": "http://www.medilexicon.com/drugs/fetzima.php", "passage_text": "Fetzima (levomilnacipran) is an extended release selective norepinephrine and serotonin reuptake inhibitor. Fetzima is specifically indicated for the treatment of Major Depressive Disorder. Fetzima is supplied as a capsule for oral administration. The recommended dose is 40 mg to 120 mg once daily with or without food. Initiate dose at 20 mg once daily for 2 days and then increase to 40 mg once daily. The dose should be increased in increments of 40 mg at intervals of 2 or more days. The maximum recommended dose is 120 mg once daily. The capsules should be swallowed whole. "}, {"url": "http://www.fetzimahcp.com/recommended-dosing", "passage_text": "Capsules shown are not actual size. 1  The recommended therapeutic dose range. 2  for FETZIMA ® is 40 mg to 120 mg once daily with or without food 1. 3  FETZIMA should be initiated at 20 mg once. 4  daily for 2 days and then increased to 40 mg. 5  once daily 1. 6  Based on efficacy and tolerability, the. 1 of 40 mg at intervals of 2 or more days 1. 2  The maximum recommended dose of FETZIMA is 120 mg/day 1. 3  FETZIMA should be taken at approximately. 4  the same time each day. 5  FETZIMA should be swallowed whole."}, {"url": "http://www.healthyplace.com/other-info/psychiatric-medications/fetzima-levomilnacipran-full-prescribing-information/", "passage_text": "The recommended dose range for Fetzima is 40 mg to 120 mg once daily, with or without food. Fetzima should be initiated at 20 mg once daily for 2 days and then increased to 40 mg once daily. Based on efficacy and tolerability, Fetzima may then be increased in increments of 40 mg at intervals of 2 or more days. The maximum recommended dose is 120 mg once daily. "}, {"url": "http://pi.actavis.com/data_stream.asp?product_group=1903&p=pi&language=E", "passage_text": "FETZIMA should be initiated at 20 mg once daily for 2 days and then increased to 40 mg once daily. Based on efficacy and tolerability, FETZIMA may then be increased in increments of 40 mg at intervals of 2 or more days. The maximum recommended dose is 120 mg once daily. Instruct patients if they miss a dose, to take the missed dose as soon as they remember. • The maximum recommended dose is 120 mg once daily (2.1). • Take capsules whole; do not open, chew or crush (2.1) • Renal Impairment: Do not exceed 80 mg once daily for moderate impairment. Do not exceed 40 mg once daily for severe renal impairment (2.3)."}]