[{"url": "http://garden.lovetoknow.com/wiki/What_is_Fertilizer_Made_Of", "passage_text": "Most inorganic fertilizers for the home garden contain a balanced ratio of nitrogen, phosphorus and potash (potassium) expressed as a ratio of 10-10-10 or 20-20-20. Others may have slightly more phosphorus to encourage blooming, such as a 5-10-5 fertilizer. Organic Fertilizers. Organic fertilizers are made from plant material. Many consider them superior to inorganic fertilizers to condition the soil and improve the health of plants. Common organic fertilizers include: 1  Compost: Compost is made from decomposed plants. 2  Grass clippings, leaves raked from the lawn, apple peels, and any discard uncooked fruit or vegetable peels or cores can be added to a compost pile. 3  Some people add shredded newspaper, tea bags and coffee grounds"}, {"url": "https://en.wikipedia.org/wiki/Fertilizer", "passage_text": "Potash is a mixture of potassium minerals used to make potassium (chemical symbol: K) fertilizers. Potash is soluble in water, so the main effort in producing this nutrient from the ore involves some purification steps; e.g., to remove sodium chloride (NaCl), i.e. common salt. All nitrogen fertilizers are made from ammonia (NH 3), which is sometimes injected into the ground directly. The ammonia is produced by the Haber-Bosch process. In this energy-intensive process, natural gas (CH 4) supplies the hydrogen and the nitrogen (N 2) is derived from the air."}, {"url": "http://www.merriam-webster.com/dictionary/fertilizer", "passage_text": "fertilizer. noun fer·til·iz·er \\-ˌlī-zər\\. Tweet. : a substance (such as manure or a special chemical) that is added to soil to help the growth of plants. : one that fertilizes; specifically: a substance (as manure or a chemical mixture) used to make soil more fertile. See fertilizer defined for English-language learners."}, {"url": "http://garden.lovetoknow.com/wiki/What_is_Fertilizer_Made_Of", "passage_text": "As a gardener it's important to know what is fertilizer made of and how it affects your plants. Fertilizers may be made from organic materials or from chemicals. Both can work equally well in the garden. Organic Fertilizers. Organic fertilizers are made from plant material. Many consider them superior to inorganic fertilizers to condition the soil and improve the health of plants. Common organic fertilizers include: 1  Compost: Compost is made from decomposed plants. 2  Grass clippings, leaves raked from the lawn, apple peels, and any discard uncooked fruit or vegetable peels or cores can be added to a compost pile. 3  Some people add shredded newspaper, tea bags and coffee grounds"}, {"url": "http://www.homedepot.com/c/what_is_best_lawn_fertilizer_for_garden_HT_BG_OD", "passage_text": "For example, a common type of all-purpose fertilizer is often referred to as 10-10-10. If you purchase a 50 pound bag, 5 pounds (or 10 percent) would be nitrogen, 5 pounds would be phosphorous and 5 pounds are potassium. Or you can use granular organic fertilizers. They’re made up of grains such as ground corn, alfalfa, cottonseed or soy as well as blood and feather meal. The primary advantage of organic fertilizers is their slow release of nitrogen and other fertilizer elements. That means a lower chance of leeching or burning."}, {"url": "http://whyzz.com/what-is-fertilizer", "passage_text": "Inorganic fertilizer is usually made from chemical processes that put some of a plant’s favorite nutrients like potassium, nitrogen, and phosphorus into the fertilizer product. Many people debate the use of fertilizer. Some people believe that inorganic fertilizers are unnatural, and they prefer the use of organic products. Fertilizers are often referred to as “organic” or “inorganic.” Organic fertilizers are usually made from natural things like compost, which is made up of naturally decaying food scraps and other natural wastes."}, {"url": "https://en.wikipedia.org/wiki/Fertilizer", "passage_text": "A fertilizer or fertiliser (in British English) is any material of natural or synthetic origin (other than liming materials) that is applied to soils or to plant tissues (usually leaves) to supply one or more plant nutrients essential to the growth of plants. All nitrogen fertilizers are made from ammonia (NH 3), which is sometimes injected into the ground directly. The ammonia is produced by the Haber-Bosch process. In this energy-intensive process, natural gas (CH 4) supplies the hydrogen and the nitrogen (N 2) is derived from the air."}, {"url": "http://home.howstuffworks.com/question181.htm", "passage_text": "So 12-8-10 fertilizer has 12-percent nitrogen, 8-percent phosphorous and 10-percent potassium. In a 100-pound bag, therefore, 12 pounds is nitrogen, 8 pounds is phosphorous and 10 pounds is potassium. The other 70 pounds is known as ballast and has no value to the plants. 1 Nitrogen, phosphorus, potassium (a.k.a. potash) - The three macronutrients and the three elements you find in most packaged fertilizers. 2  Sulfur, calcium, and magnesium-Secondary nutrients. 3  Boron, cobalt, copper, iron, manganese, molybdenum and zinc-Micronutrients."}, {"url": "http://home.howstuffworks.com/question181.htm", "passage_text": "In the case of nitrogen, the recycling of nitrogen from dead to living plants is often the only source of nitrogen in the soil. To make plants grow faster, what you need to do is supply the elements that the plants need in readily available forms. That is the goal of fertilizer. Most fertilizers supply just nitrogen, phosphorus and potassium because the other chemicals are needed in much lower quantities and are generally available in most soils. Nitrogen, phosphorus and potassium availability is the big limit to growth. 1 Nitrogen, phosphorus, potassium (a.k.a. potash) - The three macronutrients and the three elements you find in most packaged fertilizers. 2  Sulfur, calcium, and magnesium-Secondary nutrients. 3  Boron, cobalt, copper, iron, manganese, molybdenum and zinc-Micronutrients."}]