[{"url": "http://www.surgeryencyclopedia.com/La-Pa/Lithotripsy.html", "passage_text": "Lithotripsy is the use of high-energy shock waves to fragment and disintegrate kidney stones. The shock wave, created by using a high-voltage spark or an electromagnetic impulse outside of the body, is focused on the stone. The shock wave shatters the stone, allowing the fragments to pass through the urinary system. Description. Lithotripsy uses the technique of focused shock waves to fragment a stone in the kidney or the ureter. The affected person is placed in a tub of water or in contact with a water-filled cushion."}, {"url": "http://medical-dictionary.thefreedictionary.com/Percutaneous+Ultrasonic+Lithotripsy", "passage_text": "Description. Lithotripsy uses the technique of focused shock waves to fragment a stone in the kidney or the ureter. The patient is placed in a tub of water or in contact with a water-filled cushion, and a shock wave is created which is focused on the stone. The wave shatters and fragments the stone."}, {"url": "https://en.wikipedia.org/wiki/Arthroscopy", "passage_text": "For the medical journal, see Arthroscopy (journal) . Arthroscopy (also called arthroscopic surgery) is a minimally invasive surgical procedure on a joint in which an examination and sometimes treatment of damage is performed using an arthroscope, an endoscope that is inserted into the joint through a small incision. "}, {"url": "http://www.healthline.com/health/lithotripsy", "passage_text": "Overview. Lithotripsy is a medical procedure used to treat kidney stones. It may also be used to treat stones in other organs, such as the gall bladder or the liver. Kidney stones are collections of solid minerals that sometimes form in the kidneys. Healthy kidneys do not have these stone-like formations. Most stones pass out of the body naturally during urination."}, {"url": "https://en.wikipedia.org/wiki/Extracorporeal_shock_wave_lithotripsy", "passage_text": "Extracorporeal shock wave lithotripsy (ESWL) is a non-invasive treatment of kidney stones (urinary calculosis) and biliary calculi (stones in the gallbladder or in the liver) using an acoustic pulse. It is also reported to be used for salivary stones. and pancreatic stones [1]. "}, {"url": "http://medical-dictionary.thefreedictionary.com/Percutaneous+Ultrasonic+Lithotripsy", "passage_text": "Definition. Lithotripsy is the use of high-energy shock waves to fragment and disintegrate kidney stones. The shock wave, created by using a high-voltage spark or an electromagnetic impulse, is focused on the stone. This shock wave shatters the stone and this allows the fragments to pass through the urinary system. Lithotripsy uses the technique of focused shock waves to fragment a stone in the kidney or the ureter. The patient is placed in a tub of water or in contact with a water-filled cushion, and a shock wave is created which is focused on the stone. The wave shatters and fragments the stone."}, {"url": "http://www.webmd.com/kidney-stones/extracorporeal-shock-wave-lithotripsy-eswl-for-kidney-stones", "passage_text": "ESWL may be used on a person who has a kidney stone that is causing pain or blocking the urine flow. Stones that are between 4 mm (0.16 in.) and 2 cm (0.8 in.) in diameter are most likely to be treated with ESWL. ESWL may work best for kidney stones in the kidney or in the part of the ureter close to the kidney. Your surgeon may try to push the stone back into the kidney with a small instrument (ureteroscope) and then use ESWL. ESWL is usually not used if you: 1  Are pregnant. Extracorporeal shock wave lithotripsy (ESWL) uses shock waves to break a kidney stone into small pieces that can more easily travel through the urinary tract and pass from the body. See a picture of ESWL. 1  You lie on a water-filled cushion, and the surgeon uses X-rays or ultrasound tests to precisely locate the stone."}]