[{"url": "http://pantoprazolesodium.net/", "passage_text": "Protonix Tablets. Pantoprazole sodium is a prescription drug that is most commonly used to remedy situations where there is an excess of stomach acid. It is therefore classified as a proton-pump inhibitor; highly potent drugs that have the primary function of reducing gastric acid production for long durations. It is usually sold under the brand name Protonix, which comes in two forms."}, {"url": "http://www.cvs.com/drug/pantoprazole-sodium", "passage_text": "Pantoprazole may not work well with all medicines that you take. Make sure to tell your doctor about all the medicines you take. If you are not sure of all the medicines you take, ask your pharmacist for a list of these medicines. Pantoprazole is a type of a prescription medicine called a proton pump inhibitor. Pantoprazole reduces the amount of acid that your stomach makes. "}, {"url": "http://www.everydayhealth.com/drugs/pantoprazole", "passage_text": "6 Reviews. Pantoprazole is a prescription drug used as a short-term treatment for gastroesophageal reflux disease (GERD). It's part of a class of medications known as proton-pump inhibitors (PPIs) and is marketed under the brand name Protonix. "}, {"url": "http://www.webmd.com/drugs/2/drug-17633/pantoprazole-oral/details", "passage_text": "Uses. Pantoprazole is used to treat certain stomach and esophagus problems (such as acid reflux). It works by decreasing the amount of acid your stomach makes. This medication relieves symptoms such as heartburn, difficulty swallowing, and persistent cough. How to use pantoprazole. Read the Medication Guide provided by your pharmacist before you start taking pantoprazole and each time you get a refill. If you have any questions, ask your doctor or pharmacist. Take this medication by mouth as directed by your doctor, usually once daily."}, {"url": "https://en.wikipedia.org/wiki/Pantoprazole", "passage_text": "Pantoprazole is a proton pump inhibitor drug that inhibits gastric acid secretion. It was first marketed under the brand name Protonix. "}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMHT0011580/?report=details", "passage_text": "Uses of This Medicine. Pantoprazole is used to treat certain conditions in which there is too much acid in the stomach. It is used to treat erosive esophagitis or heartburn caused by gastroesophageal reflux disease (GERD), a condition where the acid in the stomach washes back up into the esophagus. This medicine may also be used to treat Zollinger Ellison syndrome, a condition where the stomach produces too much acid. Pantoprazole is a proton pump inhibitor (PPI). It works by decreasing the amount of acid produced by the stomach. This medicine is available only with your doctor's prescription"}, {"url": "http://www.rxlist.com/protonix-drug.htm", "passage_text": "Stop using pantoprazole and call your doctor at once if you have symptoms of low magnesium such as: 1  fast or uneven heart rate; 2  jerking muscle movements; 3  feeling jittery; 4  diarrhea that is watery or bloody; 5  muscle cramps, muscle weakness or limp feeling; 6  cough or choking feeling; or. "}, {"url": "http://pantoprazolesodium.net/", "passage_text": "Gastroesophageal Reflux Disease (GERD) and Zollinger-Ellison Syndrome are the two main conditions that it is used to treat. GERD is a disease where stomach acid is forced or pushed inside the esophagus. This causes erosive esophagitis (aka very discomforting heartburn) that calls for medication. It is therefore classified as a proton-pump inhibitor; highly potent drugs that have the primary function of reducing gastric acid production for long durations. It is usually sold under the brand name Protonix, which comes in two forms."}]