[{"url": "http://solstation.com/stars/4planets.htm", "passage_text": "1 The four innermost planets in the Solar System (Mercury, Venus, Earth, and Mars) are sometimes called the terrestrial planets because of their proximity to Earth (Terra in Latin) and their similarity as compact solid bodies with rocky surfaces. The core accretion model describes how the rocky inner planets formed from Sol's protoplanetary disk. The larger terrestrial planets, Earth and Venus, probably needed tens of millions of years to grow to their current size through collisions with large planetary embryos of 1,000 to 5,000 kilometers (620 to 3,100 miles)."}, {"url": "http://kids.nineplanets.org/general.htm", "passage_text": "ROCKY PLANETS (Mercury-Venus-Earth-Mars-Pluto). The rocky planets are mostly made up of rock and metal. These planets are very heavy and move slowly. They also do not have rings and very few moons. GAS PLANETS (Jupiter-Saturn-Uranus-Neptune). The gas planets are mostly made up of gases (hydrogen and helium)."}, {"url": "http://www.answers.com/Q/Which_planets_are_rocky_and_which_planets_are_gaseous", "passage_text": "The four innermost planets in our solar system, Mercury, Venus, Earth, and Mars, are considered rocky, or terrestrial planets, because they are made mostly of metals and carbo … n and silicon compounds (rock). The first four planets (Mercury, Venus, Mars, and Earth) are called the inner planets which are closer to the sun and stripped of their light gasses by the sun's solar winds."}, {"url": "http://www.answers.com/Q/Which_planets_are_rocky_and_which_planets_are_gaseous", "passage_text": "Confidence votes 41. The Rocky Planets are: The Gaseous Planets are: The first four planets (Mercury, Venus, Mars, and Earth) are called the inner planets which are closer to the sun and stripped of their light gasses by the sun's solar winds. The solar winds then carry the debris (elements) to where the winds tend to die down which is right near Jupiter."}, {"url": "http://hubblesite.org/reference_desk/faq/all.php.cat=solarsystem", "passage_text": "Mercury, Venus, Earth and Mars are called rocky or terrestrial planets. They are similar to Earth in composition. Heat from the Sun evaporated lightweight elements like hydrogen and helium into interplanetary space. Mostly rock and metal was left in this zone and clumped together to form the inner rocky planets. "}, {"url": "http://encyclopedia2.thefreedictionary.com/Rocky+planet", "passage_text": "terrestrial planet. the earth or a planet that resembles the earth in its physical characteristics. The terrestrial planets in the solar system are the earth earth,in geology and astronomy, 3rd planet of the solar system and the 5th largest, the only planet definitely known to support life. Gravitational forces have molded the earth, like all celestial bodies, into a spherical shape...... Also found in: Dictionary/thesaurus, Wikipedia. the earth or a planet that resembles the earth in its physical characteristics. The terrestrial planets in the solar system are the earth earth,in geology and astronomy, 3rd planet of the solar system and the 5th largest, the only planet definitely known to support life."}, {"url": "https://en.wikipedia.org/wiki/Terrestrial_planet", "passage_text": "A terrestrial planet, telluric planet or rocky planet is a planet that is composed primarily of silicate rocks or metals. Within the Solar System, the terrestrial planets are the inner planets closest to the Sun, i.e. Mercury, Venus, Earth, and Mars. Mercury in the Solar System has a metallic core equal to 60–70% of its planetary mass. Iron planets are believed to form in the high-temperature regions close to a star, like Mercury, and if the protoplanetary disk is rich in iron. Coreless planet."}, {"url": "http://www.answers.com/Q/What_are_rocky_planets", "passage_text": "Mars is a rocky planet. The rocky planets are Mercury, Venus, Earth and Mars. Dwarf planets like Pluto may contain rock, but also presumably much ice. The four innermost planets in our solar system, Mercury, Venus, Earth, and Mars, are considered rocky, or terrestrial planets, because they are made mostly of metals and carbo … n and silicon compounds (rock). 1 person found this useful."}, {"url": "http://www.answers.com/Q/What_are_rocky_planets", "passage_text": "The Rocky Planets are: MercuryVenusEarthMarsPluto (considered to be rocky most of the time) The Gaseous Planets are: JupiterSaturnUranusNeptune The first four planets (Mercu … ry, Venus, Mars, and Earth) are called the inner planets which are closer to the sun and stripped of their light gasses by the sun's solar winds. The four innermost planets in our solar system, Mercury, Venus, Earth, and Mars, are considered rocky, or terrestrial planets, because they are made mostly of metals and carbo … n and silicon compounds (rock). 1 person found this useful."}]