[{"url": "http://www.anzac-france.com/anzac/history/the_meaning_of_anzac", "passage_text": "The meaning of ANZAC. Anzac is the acronym for Australian and New Zealand Army Corps. It was a World War 1 army corps of the Mediterranean Expeditionary Force that was formed in Egypt in 1915 ... The Australian and New Zealand Army Corps was a World War 1 army corps of the Mediterranean Expeditionary Force that was formed in Egypt in 1915 and operated during the Battle of Gallipoli."}, {"url": "http://www.army.gov.au/Our-history/Traditions/ANZAC-Day", "passage_text": "'ANZAC' stands for Australian and New Zealand Army Corps. On the 25th of April 1915, Australian and New Zealand soldiers formed part of the allied expedition that set out to capture the Gallipoli peninsula."}, {"url": "http://kidslearningtogether.global2.vic.edu.au/2012/04/24/anzac-day-25th-april/", "passage_text": "ANZAC Day is important to remember because many people died in World War 1 (by Louisa, Atara and Aine). On the 25th April, 1915 the soldiers in the Australian and New Zealand Army Corps landed on Gallipoli. During this time over 8,000 Australian soldiers were killed fighting for our freedom."}, {"url": "https://en.wikipedia.org/wiki/Anzac_Day", "passage_text": "Anzac Day /ˈaenzaek/ ˈænzæk is a national day of remembrance In australia And New zealand that broadly commemorates All australians And New zealanders who served and died in all, wars, conflicts and peacekeeping operations and the contribution and suffering of all those who have.. served"}, {"url": "http://www.definitions.net/definition/Anzac%20Day", "passage_text": "Anzac Day. Anzac Day is a national day of remembrance in Australia and New Zealand that broadly commemorates all Australians and New Zealanders who served and died in all wars, conflicts, and peacekeeping operations and the contribution and suffering of all those who have served.."}, {"url": "http://www.definitions.net/definition/Anzac%20Day", "passage_text": "April 25th, a public holiday in Australia and New Zealand honouring the war dead from those countries. ANZAC Day (ProperNoun). 25th April, a public holiday in Australia and New Zealand to commemorate the sacrifices made by members of the Australian and New Zealand Army Corps. Origin: ANZAC + day."}, {"url": "http://www.australia.gov.au/about-australia/australian-story/anzac-day", "passage_text": "On 25 April every year, Australians commemorate ANZAC Day. It commemorates the landing of Australian and New Zealand troops at Gallipoli on 25 April 1915. The date, 25 April, was officially named ANZAC Day in 1916. ANZAC stands for Australian and New Zealand Army Corps."}, {"url": "http://www.definitions.net/definition/Anzac%20Day", "passage_text": "Originally 25 April every year was to honour the members of the Australian and New Zealand Army Corps who fought at Gallipoli in the Ottoman Empire during World War I. Anzac Day is also observed in the Cook Islands, Niue, Pitcairn Islands, and Tonga."}, {"url": "https://en.wikipedia.org/wiki/Anzac_Day", "passage_text": "Observed on 25 April each year, Anzac Day was originally to honour the members of the Australian and New Zealand Army Corps (ANZAC) who fought at Gallipoli against the Ottoman Empire during World War I."}]