[{"url": "http://www.vivo.colostate.edu/hbooks/pathphys/digestion/pregastric/salivary.html", "passage_text": "Salivary Glands and Saliva. Saliva is produced in and secreted from salivary glands. The basic secretory units of salivary glands are clusters of cells called an acini. These cells secrete a fluid that contains water, electrolytes, mucus and enzymes, all of which flow out of the acinus into collecting ducts. Most animals have three major pairs of salivary glands that differ in the type of secretion they produce: 1  parotid glands produce a serous, watery secretion. 2  submaxillary (mandibular) glands produce a mixed serous and mucous"}, {"url": "http://www.livestrong.com/article/83617-saliva-made/", "passage_text": "Saliva helps moisten food and also starts the digestive process. Saliva is produced by the salivary glands. The Colorado State Pathophysiology Department notes that most animals (including humans) have three different pairs of salivary glands. The parotid glands are located in the cheeks. "}, {"url": "https://en.wikipedia.org/wiki/Saliva", "passage_text": "Saliva is a watery substance located in the mouths of animals, secreted by the salivary glands. Human saliva is 99.5% water, while the other 0.5% consists of electrolytes, mucus, glycoproteins, enzymes, antibacterial, and bacteria compounds such as secretory IgA and lysozyme. The enzymes found in saliva are essential in beginning the process of digestion of dietary starches and fats. There is much debate about the amount of saliva that is produced in a healthy person per day; estimates range from 0.75 to 1.5 litres per day while it is generally accepted that during sleep the amount drops to almost zero."}, {"url": "http://www.answers.com/Q/Where_is_saliva_produced", "passage_text": "Saliva is produced from the salivary glands.The basic unit in the salivary glands are clusters of cells called acini.These cells create a fluid that contains water,Electrolyte … s, my as and enzymes all of which flow out From the acinus into the collecting ducts. 1 person found this useful. Answered. In Cows and Cattle. "}, {"url": "https://en.wikipedia.org/wiki/Salivary_gland", "passage_text": "The salivary glands in mammals are exocrine glands, glands with ducts, that produce saliva. They also secrete amylase, an enzyme that breaks down starch into maltose. "}, {"url": "http://biology.about.com/od/humananatomybiology/ss/salivary-glands-and-saliva.htm", "passage_text": "Salivary Glands and Saliva. 1  parotid glands-produce a serous, watery secretion. 2  submaxillary (mandibular) glands-produce a mixed serous and mucous secretion. 3  sublingual glands-secrete a saliva that is predominantly mucous in character. 4  serous cells, which secrete a watery fluid, essentially devoid of mucus. 1 submaxillary (mandibular) glands-produce a mixed serous and mucous secretion. 2  sublingual glands-secrete a saliva that is predominantly mucous in character. 3"}, {"url": "https://en.wikipedia.org/wiki/Saliva", "passage_text": "Produced in salivary glands, human saliva is 99.5% water, but it contains many important substances, including electrolytes, mucus, antibacterial compounds and various enzymes. It is a fluid containing: There is much debate about the amount of saliva that is produced in a healthy person per day; estimates range from 0.75 to 1.5 litres per day while it is generally accepted that during sleep the amount drops to almost zero."}]