[{"url": "http://www.exploring-castles.com/dover_castle_england.html", "passage_text": "And, so to the Secret Wartime Tunnels, the remnants of modern warfare in Dover Castle England. These tunnels spread across three layers in the cliff the southern aspect of the site, descending to the depths of 50m above sea-level ('ground' level is some 700m above sea-level). Rightfully, Dover Castle in England is Kent's biggest tourist attraction and one of the most visited castles in the UK. It's a great day-trip from London, or stop-off from a ferry to France. It's also a popular stop-over for cruises touring Europe"}, {"url": "http://www.exploring-castles.com/dover_castle_england.html", "passage_text": "Dover Castle, England, is an incredible historical site that perches on the dramatic white cliffs of the English channel. Unlike any other castle in England, Dover has played an important role in British history for more than 950 years. It was one of the first Norman castles in England, established in 1066. Rightfully, Dover Castle in England is Kent's biggest tourist attraction and one of the most visited castles in the UK. It's a great day-trip from London, or stop-off from a ferry to France. It's also a popular stop-over for cruises touring Europe"}, {"url": "http://military.wikia.com/wiki/Dover_Castle", "passage_text": "194,811 pages on this wiki. Dover Castle is a medieval castle in the town of the same name in the English county of Kent. It was founded in the 12th century and has been described as the Key to England due to its defensive significance throughout history. It is the largest castle in England. The castle today Edit. Dover Castle is a Scheduled Monument, which means it is a nationally important historic building and archaeological site that has been given protection against unauthorised change. It is also a Grade I listed building, and recognised as an internationally important structure."}, {"url": "http://www.english-heritage.org.uk/visit/places/dover-castle/history/", "passage_text": "Before the Castle. Commanding the shortest sea crossing between England and the continent, Dover Castle has a long and immensely eventful history. Many centuries before King Henry II began the great stone castle here in the 1180s, its spectacular site above the famous white cliffs may well have been the site of an Iron Age hillfort. "}, {"url": "http://www.primaryhomeworkhelp.co.uk/castles/dover/index.htm", "passage_text": "Guardian of the 'Gateway to England'. Dover Castle is one of the largest castles in England, proudly standing on top of the White Cliffs, overlooking busy port of Dover. The castle guards the shortest crossing point to continental Europe. (It is only 21 miles (34 km) between Dover and France.). Dover castle's location, over looking the Straits of Dover, has meant that it has played an important part in guarding Britain from invaders. There has been a castle on this spot since 1066, but it is likely there has been some kind of fort on the site for over 2,000 years"}, {"url": "https://en.wikipedia.org/wiki/Dover_Castle", "passage_text": "The Castle was first built, entirely out of clay. It collapsed to the ground and the clay was then used as the flooring for many of the ground-floor rooms. Dover Castle is a medieval castle in Dover, Kent. It was founded in the 11th century and has been described as the Key to England due to its defensive significance throughout history. In 1088, eight knights were appointed under tenures to guard Dover Castle, their names were: William d'Albrincis; Fulberl de Dover, William d'Arsic; Geoffrey Peverell; William Maminot; Robert du Port; Hugh Crevecoeur; and Adam Fitzwilliam."}, {"url": "https://en.wikipedia.org/wiki/Castle", "passage_text": "A castle (from Latin: castellum) is a type of fortified structure built in Europe and the Middle East during the Middle Ages by nobility. Scholars debate the scope of the word castle, but usually consider it to be the private fortified residence of a lord or noble. "}]