[{"url": "http://www.businessdictionary.com/definition/iceberg-principle.html", "passage_text": "Definition. Observation that in many (if not most) cases only a very small amount (the 'tip') of information is available or visible about a situation or phenomenon, whereas the 'real' information or bulk of data is either unavailable or hidden."}, {"url": "https://en.wikipedia.org/wiki/Iceberg_Theory", "passage_text": "Of his iceberg theory, she claims, it is also a glacier waterfall, infused with movement by his multi-focal aesthetic. Furthermore, she believes that Hemingway's iceberg theory demanded that the reader feel the whole story and that the reader is meant to fill the gaps left by his omissions with their feelings. Hemingway believed the deeper meaning of a story should not be evident on the surface, but should shine through implicitly. Critics such as Jackson Benson claim that the iceberg theory, along with Hemingway's distinctive clarity of style, functioned to distance himself from the characters he created."}, {"url": "https://en.wikipedia.org/wiki/Iceberg_Theory", "passage_text": "Furthermore, Baker explains that in the writing style of the iceberg theory the hard facts float above water, while the supporting structure, complete with symbolism, operates out of sight. Iceberg theory is also referred to as the theory of omission. Hemingway believed the deeper meaning of a story should not be evident on the surface, but should shine through implicitly. Critics such as Jackson Benson claim that the iceberg theory, along with Hemingway's distinctive clarity of style, functioned to distance himself from the characters he created."}, {"url": "http://mhspsychology.blogspot.com/2005/12/freuds-iceberg-theory.html", "passage_text": "Freud’s Iceberg Theory. Sigmund Freud, founder of Psychoanalysis, had theory commonly referred to as the iceberg theory in which he proposed to split the human into three levels of consciousness. He said that every human had an unconscious, a preconscious, and a conscious level to their minds. "}, {"url": "https://en.wikipedia.org/wiki/Iceberg_Theory", "passage_text": "The Iceberg Theory (also known as the theory of omission) is the writing style of American writer Ernest Hemingway. As a young journalist, Hemingway had to focus his newspaper reports on immediate events, with very little context or interpretation. Hemingway believed the deeper meaning of a story should not be evident on the surface, but should shine through implicitly. Critics such as Jackson Benson claim that the iceberg theory, along with Hemingway's distinctive clarity of style, functioned to distance himself from the characters he created."}, {"url": "http://www.studymode.com/essays/Iceberg-Theory-1891028.html", "passage_text": "Iceberg Theory Essay. Period 3. Hemingway is known to write by the “principle of the iceberg” which is a method that keeps the reader constantly intrigued or alert by leaving things open for their interpretation because almost everything he says has a deeper or double meaning. ...The Iceberg Theory (also known as the “ theory of omission”) is a..."}, {"url": "http://www.wilderdom.com/personality/L8-3TopographyMindIceberg.html", "passage_text": "Iceberg metaphor for the mind s layout: We can use the metaphor of an iceberg to help us in understanding Freud's topographical theory. Only 10% of an iceberg is visible (conscious) whereas the other 90% is beneath the water (preconscious and unconscious)."}, {"url": "http://dictionary.sensagent.com/iceberg%20theory/en-en/", "passage_text": "Iceberg Theory. Ernest Hemingway as photographed for 1940 edition of For Whom the Bell Tolls. The Iceberg Theory (also known as the theory of omission) is a term used to describe the writing style of American writer Ernest Hemingway. Hemingway is best known for works such as The Sun Also Rises, A Farewell to Arms, and The Old Man and the Sea. Critics claim his iceberg theory, or theory of omission, in combination with his distinctive clarity of writing, functioned as a means to distance himself from the characters he created."}, {"url": "http://www.enotes.com/homework-help/what-hemingway-trying-say-his-iceburg-theory-122433", "passage_text": "--Hemingway, Death in the Afternoon. Ernest Hemingway's Iceberg Theory deals with the basic principle that less is more.. Instead of stating the obvious, Hemingway attempts to use dialog and subtext to convey his themes. In revision, cutting becomes more important than adding material. Needless repetition and irrelevant information should be avoided"}, {"url": "http://dictionary.sensagent.com/iceberg%20theory/en-en/", "passage_text": "Hemingway's iceberg theory highlights the symbolic implications of art. He makes use of physical action to provide an interpretation of the nature of man's existence. Critics claim his iceberg theory, or theory of omission, in combination with his distinctive clarity of writing, functioned as a means to distance himself from the characters he created."}]