[{"url": "http://www.answers.com/Q/Where_did_the_Inca_live", "passage_text": "In Incas. The Incas lived in Peru, spreading from what is now Chile to Quito(what is now Equador),  nearly as big as the roman empire. Also they're national language was Quechua   … Ke-chew-ah The Incas ruled a great empire in South America-but only for a short time."}, {"url": "http://www.answers.com/Q/Where_did_the_Inca_live", "passage_text": "The vast empire of the Incas stretched from southern Columbia through much of Ecuador, Peru, Bolivia, Argentina and Chile. Descendants still live in these same regions today."}, {"url": "http://www.livescience.com/41346-the-incas-history-of-andean-empire.html", "passage_text": "The Inca Empire was a vast empire that flourished in the Andean region of South America from the early 15th century A.D. up until its conquest by the Spanish in the 1530s. Even after the conquest, Inca leaders continued to resist the Spaniards up until 1572 when its last city, Vilcabamba, was captured."}, {"url": "http://www.localhistories.org/inca.html", "passage_text": "In about 1300 the Incas founded their capital city of Cuzco. They were only a small tribe but they came to rule a vast empire including most of Peru and parts of Chile, Ecuador, Bolivia and northwest Argentina."}, {"url": "http://www.smithlifescience.com/8-3Incas.htm", "passage_text": "Cities The capital city of the Inca empire was Cuzco. Machu Picchu is located in the Andes mountains was built between 1460 and 1470. It was constantly being remodeled. Builders, attendants, planters, priests, artisans, worked on the palace."}, {"url": "https://en.wikibooks.org/wiki/Wikijunior:Ancient_Civilizations/Incas", "passage_text": "The Inca lived in the Andes Mountains in South America. Their range stretched from southern Chile through Argentina, Bolivia, Peru and Ecuador and into southern Colombia. The Inca were very warlike and often attacked their neighbors to take their land."}, {"url": "http://www.answers.com/Q/Where_did_the_Inca_live", "passage_text": "The Incas were a pre-Columbian tribe that lived on the Andes  mountains and spoke Quechua. The civilization had its capital in  Cuzco, Peru.   They were an ancient peo … ple, but had been subject to the regional  powers during the entire history of South American urban cultures."}, {"url": "http://www.ducksters.com/history/inca/cuzco.php", "passage_text": "Cuzco was the capital and birthplace of the Inca Empire. The emperor, or Sapa Inca, lived in a palace in Cuzco. His top leaders and closest advisors also lived there."}]