[{"url": "http://www.home-cost.com/construction-cost-per-sf.html", "passage_text": "Simply enter a zip code or select a state below for the state's average home construction cost per square foot and the average new square foot size for homes sold in that state. Then just click Submit for your results! The challenge with using cost per square foot as a way to budget a home is that cost per square foot excludes* the following factors: 1  Excludes land cost, site development costs such as drives, utilities, clearing, decks, patios, landscape or any fees or permitting costs. 2  Excludes excavation. 3  Excludes basement costs."}, {"url": "http://homewyse.com/services/cost_to_install_concrete_pad.html", "passage_text": "Get an INSTANT estimate of the cost to Install a Concrete Pad! Our free calculator uses recent, trusted data to estimate costs for your Concrete Pad Installation project. For a basic 120 square feet project in zip code 47474, the benchmark cost to Install a Concrete Pad ranges between $4.64 - $6.36 per square foot* . To estimate costs for your project: 1. Set Project Zip Code Enter the Zip Code for the location where labor is hired and materials purchased. 2. "}, {"url": "http://www.homewyse.com/services/cost_to_frame_interior_wall.html", "passage_text": "Get an INSTANT estimate of the cost to Frame an Interior Wall! Our free calculator uses recent, trusted data to estimate costs for your Interior Wall Framing project. For a basic 125 square feet project in zip code 47474, the benchmark cost to Frame an Interior Wall ranges between $3.03 - $3.74 per square foot* . To estimate costs for your project: 1. Set Project Zip Code Enter the Zip Code for the location where labor is hired and materials purchased. 2."}, {"url": "http://building-cost.net/City_g.ASP", "passage_text": "Pick the nearest Zip area where this house is built. The three digits beside each city name identify the first three digits of the Zip code for each area. For convenience, one representative city is identified in each Zip area or range of Zip areas. Check the Zip area where this house is built. "}, {"url": "http://www.home-cost.com/construction-cost-per-sf.html", "passage_text": "With Resi-Cost you no longer have to guess your home's cost using rules of thumb like construction cost per square foot. Resi-Cost provides you an economical, simple, fast and accurate way to budget your home's design, built in your specific location with your material selections. The challenge with using cost per square foot as a way to budget a home is that cost per square foot excludes* the following factors: 1  Excludes land cost, site development costs such as drives, utilities, clearing, decks, patios, landscape or any fees or permitting costs. 2  Excludes excavation. 3  Excludes basement costs."}, {"url": "http://www.fixr.com/costs/build-condominium", "passage_text": "1 This sort of building, however, would not come in at a simple cost of $85 per square foot due simply to the excessive amount of construction required on the interior. 2  A two-story unit of wooden construction with two condominiums would run roughly $484,500 in total costs. "}, {"url": "https://www.choiceroofcontractors.com/commercial-roof-replacement-cost/", "passage_text": "It came out to an average of 200 leaks per year or 5.2 leaks on each building annually. In terms of 2006 dollars, the average roof replacement cost came out to $269 per square meter over 9 years, or $4.5 million spent on replacement of 16,900 square meters over a 9-year stretch. "}, {"url": "http://www.buildingsguide.com/faq/what-average-commercial-building-cost-square-foot", "passage_text": "An average commercial steel building costs between $16 and $20 per square foot, including building package (I-Beams, purlins, girts etc.) , delivery, foundation and the cost of construction. Since many retail & commercial buildings require additional finishing like insulation or facade façade, customization the cost may rise to$ 30 or$ 40 per square (FOOT). Sf insulating a commercial steel building is a necessary expense but is also a very good. investment"}, {"url": "http://www.b4ubuild.com/faq/faq_0002.shtml", "passage_text": "Home prices of $55, $66, $72, $80, $84, $92, $110, $118, and $328 per square foot combine to produce an average of $112 per square foot, which is probably a reasonable figure for many areas of the country. However, the difference between the lowest figure and the highest is very substantial. "}, {"url": "http://www.trulia.com/voices/q_Average+Price+Per+Square+Foot+By+Zip+Code/", "passage_text": "What is the average price per square foot for new construction on my lot in the Lexington SC 29072 zip code? ... "}]