[{"url": "http://budgeting.thenest.com/bullish-mean-stock-trading-25354.html", "passage_text": "Saying you are bullish indicates you have confidence that a stock is going to rise in price. Indicating you are bearish signals the opposite: you believe the stock price is going to go down. Bullish and bearish are two of the most commonly used trading terms. You can use these terms to sum up the current traits of the stock market or provide an opinion on the future prospects of the stock market."}, {"url": "http://www.etoro.com/blog/markets/22112012/the-meaning-of-bearish-and-bullish/", "passage_text": "This post is not investment advice. CFD trading bears risk to your capital. The terms bullish and bearish are often used to describe the conditions in the market or the sentiment of investors. They are very important terms and are used in nearly all types of trading, from currencies to stocks. Traders can take advantage of both bullish and bearish markets if they have sufficient knowledge of the market conditions that are associated with these cycles. On the other hand, investors with bullish sentiment wait until prices are low before entering the market with the hope that prices will increase and they will then trade their stocks to make a profit. Traders can generate profits in both bearish and bullish market cycles."}, {"url": "http://financial-dictionary.thefreedictionary.com/bullish", "passage_text": "Bullish. Describing an indicator that prices are likely to rise. A simple example of a bullish indicator is a large number of margin transactions, which means investors are buying and generally leads to higher prices. See also: Bearish. "}, {"url": "http://www.investopedia.com/study-guide/series-4/introduction/bullish-vs-bearish/", "passage_text": "Investors who believe that a stock price will increase over time are said to be bullish. Investors who buy calls are bullish on the underlying stock. That is, they believe that the stock price will rise and have paid for the right to purchase the stock at a specific price known as the exercise price or strike price. An investor who has sold puts is also considered to be bullish on the stock."}, {"url": "http://www.etoro.com/blog/markets/22112012/the-meaning-of-bearish-and-bullish/", "passage_text": "The terms bullish and bearish are often used to describe the conditions in the market or the sentiment of investors. On the other hand, investors with bullish sentiment wait until prices are low before entering the market with the hope that prices will increase and they will then trade their stocks to make a profit. Traders can generate profits in both bearish and bullish market cycles."}, {"url": "https://in.answers.yahoo.com/question/index?qid=20071002105520AAd4uMt", "passage_text": "Best Answer: Bullish market:A financial market of a certain group of securities in which prices are rising or are expected to rise. The term bull market is most often used in respect to the stock market, but really can be applied to anything that is traded, such as bonds, currencies, commodities, etc. Bear Market: A market condition in which the prices of securities are falling or are expected to fall."}, {"url": "http://www.investopedia.com/study-guide/series-4/introduction/bullish-vs-bearish/", "passage_text": "Bearish. Investors who believe that a stock price will decline are said to be bearish. The seller of a call has an obligation to sell the stock to the purchaser at a specified price and believes that the stock price will fall and is therefore bearish. That is, they believe that the stock price will rise and have paid for the right to purchase the stock at a specific price known as the exercise price or strike price. An investor who has sold puts is also considered to be bullish on the stock."}, {"url": "http://www.answers.com/Q/What_does_bearish_mean_in_the_stock_market", "passage_text": "1 The terms bullish and bearish are used to describe stock market trends. 2  A bearish market refers to a downward trend in the stock market which is characterized by falling share prices coupled with widespread pessimism as investors go on a selling spree to cut losses, which further fuels the negative sentiment. 1 Being bearish indicates negative sentiment regarding an asset, such as stocks. 2  Typically this indicates a perception that the value of the underlying asset (such as the common stock) will reduce in value over a given time frame. 3  Being bullish indicates positive sentiment regarding an asset."}, {"url": "http://budgeting.thenest.com/bullish-mean-stock-trading-25354.html", "passage_text": "The bull and bear symbolize contrasting market conditions. Stock traders and investors often use jargon, such as bullish or bearish, to express a financial viewpoint. Understanding trading jargon allows you to communicate with other traders and comprehend news stories and analysis pieces. Bullish and bearish are two of the most commonly used trading terms. You can use these terms to sum up the current traits of the stock market or provide an opinion on the future prospects of the stock market."}]