[{"url": "http://www.costowl.com/insurance/insurance-general-liability-contractors-cost.html", "passage_text": "If you’re sued, general liability insurance will cover the cost of your damages or settlement fees and attorney fees up to the policy maximum. So, if you buy a $1 million policy and the settlement is $1.5 million, you’ll be on the hook for the remaining $500,000. However, general liability insurance is still affordable. Most contractors pay from $700 to $1,200 per year for general liability insurance. The payments are usually structured as a down payment of several hundred dollars and monthly payments spread out over nine or ten months."}, {"url": "http://costowl.com/home-improvement/home-hire-general-contractor-cost.html", "passage_text": "It will cost $300 to $400 per day to hire a general contractor. Many times, a general contractor will also be a carpenter and do a lot of the work that needs to be done. That is a great help and cost savings to the project. Whether a general contractor will do work on a project depends on their skills and the outlook of the job. If your general contractor does not do any labor he may want 10% to 20% of the cost of the project. If he does the carpentry he will want 45% to 65% of the money paid to contractors on the project. "}, {"url": "http://www.acmehowto.com/contractor/how-much.php", "passage_text": "G eneral contractors are project overseers and they typically bring together the people needed to complete a job. They hire each sub-contractor and add a mark-up percentage to the sub-contractor's cost. Many general contractors also have their own crew of laborers, for which they charge an hourly rate. Typically the contractor' s crew will be general carpentry trades people, some who may have more specialized skills. Exactly how a general contractor charges for a project depends on the type of contract you agree to. There are three common types of cost contracts, fixed price, time & materials and cost plus a fee. Each contract type has pros and cons for both the consumer and for the contractor"}, {"url": "http://work.chron.com/average-salary-general-contractor-6862.html", "passage_text": "Basics. General contractors earned a mean $45.14 per hour, or $93,900 per year, as of May 2011, according to the Bureau of Labor Statistics. The lowest-paid 10 percent of contractors received less than $24.35 per hour, or $50,650 per year, while the best-paid 10 percent made $71.67 per hour, or $149,070 per year. Industries. In 2011, nonresidential building construction provided almost a quarter of the 195,000 jobs for contractors, with average salaries at $45.41 per hour, or $94,450 per year. Building equipment contractors contained 14 percent of the positions at a mean $46.52 per hour, or $96,750 per year."}, {"url": "http://www.insureon.com/insureonu/costs/general-liability", "passage_text": "Here's the big-picture overview: the average annual cost for small business General Liability Insurance, regardless of policy limits, was just $575.16 (less than $50 per month), with a median price of $425. Most small businesses owners (almost 60 percent) paid between $400 and $600. Another 23.5 percent pay between $200 and $400, meaning that 80 percent of our customers pay $600 or less per year for coverage. The average cost of a $1M / $2M GL policy is just $576.08 per year, and the median is $425."}, {"url": "http://www.kaycircle.com/k-What-is-the-Average-Cost-of-a-General-Contractor-Average-General-Contractor-Price", "passage_text": "The contractor charges a certain percentage over what the sub-contractors charge. Due to the contractors’ knowledge of his laborers and the business, he can save you money by dealing with the sub-contractors. A contractor typically costs roughly 5% to 25% of the total project cost. The average ranges from 10% to 15%. "}, {"url": "http://www.payscale.com/research/US/Job=General_Contractor/Hourly_Rate", "passage_text": "(United States). The average wage for a General Contractor is $29.74 per hour. Experience has a moderate effect on pay for this job. Skills that are associated with high pay for this job are Sales, Contractor Management, Construction Estimating, and Project Management. "}, {"url": "http://www.acmehowto.com/contractor/how-much.php", "passage_text": "So, how much does a contractor cost, anywhere from 5% to 25% of the total project cost, with the average ranging 10-15%. Typically the contractor' s crew will be general carpentry trades people, some who may have more specialized skills. Exactly how a general contractor charges for a project depends on the type of contract you agree to. There are three common types of cost contracts, fixed price, time & materials and cost plus a fee."}]