[{"url": "http://be-a.co.za/hairdresser/", "passage_text": "Alternatively you can work for a salary at a hairdresser’s salon. This means you work set hours for a set wage and you have the opportunity to earn commission on top. Generally speaking a commission is granted for every haircut you do. Another option is to be self employed as an independent worker. Become a Hairdresser. Many people choose to become hairdressers because they like to meet people and they have a natural interest in hair and different styles. If you think this career might suit you, let’s find out how you can become a hairdresser and enjoy a rewarding and exciting career."}, {"url": "http://www.careerigniter.com/questions/how-much-does-hairdressing-school-cost/", "passage_text": "The cost of tuition for in-district students is $276 per credit hour while for out-of-district students, it is $456 per credit hour. Non-residents pay $762 per credit hour for tuition cost. At Toni & Guy Hairdressing Academy, the cost of tuition for an 11-month beauty school program is $15,000. The cosmetology certificate program at Remington College costs from $19,900 to $24,000 depending on the campus where it is taken. Books and supplies are included in this quote but not housing and food. Certificate programs lasting only nine months is going to be cheaper compared to associate degree programs that last for a couple of years. On the average, the yearly cost of tuition, fees, supplies, books, housing and food for an associate’s degree in cosmetology can range from around $10,000 to over $12,000."}, {"url": "http://work.chron.com/much-apprentice-hairdresser-paid-25384.html", "passage_text": "Apprentice hairdressers usually earn more in New York and California, because living costs are higher in those states. An apprentice hairdresser earning $15,000 in Kansas City, Kan., would need to make $33,018 in New York City to maintain her living standard, according to CNN Money's cost of living calculator. In 2013, average incomes for apprentice hairdressers varied somewhat in all four U.S. regions. In the West, they earned the highest incomes of $15,000 in California and the lowest of $9,000 in Hawaii, according to Indeed."}, {"url": "http://www.beautyschoolsdirectory.com/faq/hair-stylist.php", "passage_text": "The length of the hairdresser training program depends on how many hours your state requires to be allowed to sit for the board exams (the national average is around 1500 hours), and whether you plan to attend the school full-time or part-time. Most students complete the full cosmetology program in 12 to 24 months. The cost to attend a hairstyling school depends on several different factors. One of the most important factors is location. Hair design schools in large metropolitan areas like New York City and Los Angeles may cost more than schools in smaller metros further from the coasts or rural areas."}, {"url": "http://money.usnews.com/careers/best-jobs/hairdresser/salary", "passage_text": "Salary Outlook. Hairdressers aren’t typically salaried employees. The majority are self-employed and many work part time. The BLS reports the median hourly wage for hairdressers in 2013 was $11.12, which translates to $23,140 a year. In 2013, hairdressers had an average salary of $27,530, which is comparable to the average salaries of janitors ($25,140) and taxi drivers ($25,200). Other jobs where the workers earn tips, such as bartender ($21,770), waiter and waitress ($20,880) and nail technician ($21,790), are usually lower-paying."}, {"url": "http://hairstyle-blog.com/how-to-become-a-hairdresser.html", "passage_text": "You’ve always enjoyed doing your own hair and your friend’s hair, so why not make it a career? So where do you begin the search on how to become a hairdresser? The options are endless in the schools available, the cost and the curriculum they use. The cost of school can range anywhere from $7,000 to $20,000. At all beauty schools, you receive the state required hours of education that varies from state to state. The difference in cost usually is in the beauty school kits, the cosmetology course books offered and extra tools they use. Hairdressing is an art and you have to pay your dues to make the big bucks. A clientele is not handed to you; you earn it with your skills. Continuing education is the key to success and passion for the industry is a must in how to become a great hairdresser!"}, {"url": "http://www.beautyschoolsdirectory.com/faq/hair-stylist.php", "passage_text": "Students can expect to learn how to cut, color, and style both men's and women's hair. Students who attend a comprehensive cosmetology school also receive lessons in skin care, makeup, and nail care in addition to the hairstylist training. It's not just about learning to do hair, though. The cost to attend a hairstyling school depends on several different factors. One of the most important factors is location. Hair design schools in large metropolitan areas like New York City and Los Angeles may cost more than schools in smaller metros further from the coasts or rural areas."}, {"url": "http://www.beautyschoolsdirectory.com/faq/hair-stylist.php", "passage_text": "Each state has a different number of hours they require to get licensed, so higher hour requirements mean longer programs which can affect the price. According to our survey of more than 55 cosmetology schools, the average cost of hair school in a comprehensive cosmetology program is between $10,000 and $20,000. The cost to attend a hairstyling school depends on several different factors. One of the most important factors is location. Hair design schools in large metropolitan areas like New York City and Los Angeles may cost more than schools in smaller metros further from the coasts or rural areas."}, {"url": "http://www.answers.com/Q/How_much_is_tuition_to_become_a_hairdresser", "passage_text": "Tip your hairdresser well, 20% or more of your total bill is common. For example, if your haircut cost $50, tip them $10 for a total of $60. In the US, most service industry … workers are tipped 15-20%. 7 people found this useful. "}, {"url": "http://education.costhelper.com/hairstylist-training.html", "passage_text": "1 Hair stylists must be licensed, and fees for a license vary by state. 2  Typically, fees are less than $100. 3  Renewals are required every one to two years, and are also typically under $100. 4  State exams are typically part of the licensing requirements. 1 Typically, fees are less than $100. 2  Renewals are required every one to two years, and are also typically under $100. 3  State exams are typically part of the licensing requirements. 4  State exam requirements and costs"}]