[{"url": "https://en.wikipedia.org/wiki/Yakitori", "passage_text": "Yakitori (焼き鳥, やきとり, ヤキトリ) , grilled chicken, is a Japanese type of skewered chicken. The preparation of Yakitori involves skewering the meat with kushi (串, くし), a type of skewer typically made of steel, bamboo, or similar materials. Afterwards, they are grilled over a charcoal fire. Yakitori-ki are small electrical appliances which use a heating element similar to that of a broiler or toaster to cook the food placed on top. In order to facilitate even cooking, the meat is cut into small, roughly uniform shapes and then skewered with kushi; after which the yakitori are seasoned and cooked."}, {"url": "http://www.definitions.net/definition/yakitori", "passage_text": "Yakitori. Yakitori, grilled chicken, is commonly a Japanese type of skewered chicken. The term yakitori can also refer to skewered food in general. Kushiyaki, is a formal term that encompasses both poultry and non-poultry items, skewered and grilled. Wiktionary (0.00 / 0 votes) Rate this definition: yakitori (Noun). A Japanese shishkabob-type dish made with small pieces of chicken, fish, vegetables or beef which have been marinated in soy sauce and then cooked on skewers. Origin: From 焼き鳥 (やきとり), from 焼き ‘grilled, toasted’ + 鳥 ‘bird’."}, {"url": "http://recipes.howstuffworks.com/japanese-yakitori-recipe.htm", "passage_text": "Yakitori is the name for grilled chicken kabobs in Japan. These are especially pretty when prepared accordion-style on skewers. The vegetables are woven between ribbons of chicken, and everything is brushed with a gingery marinade. "}, {"url": "http://www.yakitorirestaurant.com/whats-yakitori", "passage_text": "“Yakitori” literally means “Grilled Bird” and traditionally consisted only of various parts of a chicken but modern usage in Japan refers to any sort of chicken, beef, pork, seafood, and vegetables on skewers called “Kushi” grilled on a charcoal BBQ grill. Yakitori Jinbei grills with the world’s finest white charcoal called “Binchotan”, made from Holm, Nara, or Kunugi oak. Binchotan is a traditional Japanese charcoal that has been in use for around 400 years."}, {"url": "http://www.wisegeek.com/what-is-yakitori.htm", "passage_text": "Much like other types of barbecue, yakitori is made with a distinct sauce. The sauce is called tare sauce and is made with soy sauce, sugar, sake, and mirin. Sake and mirin are both kinds of Japanese rice wine but differ in terms of their alcohol content. Japan has a lot of small food stalls and yakitori is one of the more popular foods you can pick up. If you don't want to spend a lot to give it a whirl, dropping into a 7-11 can work too. 7-11s in Japan carry a pretty big selection of cooked meats and various instant meals."}, {"url": "http://www.shinsengumigroup.com/en/dining-guide/yakitori.php", "passage_text": "Yakitori is every edible part of the chicken that is cut into bite size pieces, then skewered with bamboo sticks and charboiled with radiant heat from charcoaled wood. Besides chicken, you will also see on our menu that we serve skewered beef, pork, various vegetables and seafood which we also refer to as yakitori. "}, {"url": "http://www.yakitorirestaurant.com/whats-yakitori", "passage_text": "Yakitori consists of chicken, vegetables and seafood on bamboo skewers with either salt or our own homemade soy sauce, and requires a very delicate control of charcoal heat and seasoning. Yakitori Jinbei grills with the world’s finest white charcoal called “Binchotan”, made from Holm, Nara, or Kunugi oak. Binchotan is a traditional Japanese charcoal that has been in use for around 400 years."}, {"url": "http://www.wisegeek.com/what-is-yakitori.htm", "passage_text": "Yakitori is the Japanese version of shish kebab. In particular, it is a skewered chicken dish that is cooked over a barbecue. The chicken is cut up into bite-sized pieces, skewered on metal or bamboo rods, and cooked over a flaming bed of charcoal. Japan has a lot of small food stalls and yakitori is one of the more popular foods you can pick up. If you don't want to spend a lot to give it a whirl, dropping into a 7-11 can work too. 7-11s in Japan carry a pretty big selection of cooked meats and various instant meals."}]