[{"url": "http://www.answers.com/Q/What_is_polartec_fabric", "passage_text": "Polartec is a registered trademark for a special fabric treatment. Here is a direct quote from their website:  Polartec® fabric technologies are performance features that can be designed into or applied to existing fabrics. Bedsheets are generally made from pima cotton. When quilting through pima cotton, it is very difficult to needle this fabric. This is the main reason NOT to use bedsheets to back quilts. A looser weave fabric can be an even bigger problem, since you may only be catching 1 or 2 thread when you hand quilt."}, {"url": "http://www.nordstromsupplier.com/NPG/PDFs/Product%20Integrity/Labeling%20Requirements/Textile%20Fiber%20Labeling.pdf", "passage_text": "Example: 100% TENCEL ® LYOCELL If using a trade name, it is important that you have legal documentation that the product is manufactured by the company with the registered trademark. Otherwise, you violate the trademark and legal action can be taken against your company. These documents and their contents may not be duplicated or disclosed to any other party without express authorization of Nordstrom, Inc. Page 1 of 5 1 The U.S. Federal Trade Commission (FTC) regulates the Textile Fiber Products Identification and Wool Products Labeling Acts."}, {"url": "http://www.madehow.com/Volume-4/Polyester-Fleece.html", "passage_text": "Polyester fleece is a remarkably comfortable and adaptable fabric, and will doubtless find many new uses. The future of recycled PET polyester seems to lie in making the recycling process more economically efficient, and in making finer-diameter yarns. It is a two-sided pile material, meaning that both the front and back surface of the fabric sprouts a layer of cut fibers, similar to corduroy or velvet. Polyester fleece is an extremely durable fabric that not only holds in warmth but resists moisture and dries quickly."}, {"url": "http://www.hoovers.com/industry-facts.textile-manufacturing.1407.html", "passage_text": "Yarns and thread are used to produce fabrics that are woven or knit, finish fabrics by dyeing or coating them, and make fabrics into simple finished consumer products like rugs, carpets, curtains, linens, and textile bags. Excerpt from Textile Manufacturing Report. Companies in this industry operate mills that produce textiles and textile products from natural and synthetic materials."}, {"url": "http://www.madehow.com/Volume-4/Polyester-Fleece.html", "passage_text": "Background. Polyester fleece is a soft, fuzzy fabric used for sweaters, sweat shirts, jackets, mittens, hats, blankets, and in any other applications where a warm, wool-like material is needed. It is a two-sided pile material, meaning that both the front and back surface of the fabric sprouts a layer of cut fibers, similar to corduroy or velvet. Polyester fleece is an extremely durable fabric that not only holds in warmth but resists moisture and dries quickly."}, {"url": "http://www.madehow.com/Volume-4/Polyester-Fleece.html", "passage_text": "Raw Materials. The raw material for polyester fleece is polyester, which is made from two petroleum products: terephthalic acid and ethylene glycol. Some or all of the polyester yarn may be recycled from soda bottles. It is a two-sided pile material, meaning that both the front and back surface of the fabric sprouts a layer of cut fibers, similar to corduroy or velvet. Polyester fleece is an extremely durable fabric that not only holds in warmth but resists moisture and dries quickly."}, {"url": "http://www.lairdtech.com/products/category/854", "passage_text": "PolarTEC™ Series. The PolarTEC™ Series is a porch-style thermoelectric module (TEM). The hot side ceramic has an extended edge, which allows for a strong lead attachment to accommodate the wiring of multiple TEMs into an array. This product line is available in 4, 6 and 8 Amp configurations and is ideal for high volume production. Assembled with Bismuth Telluride semiconductor material and thermally conductive Aluminum Oxide ceramics, the PolarTEC™ Series is designed for higher current and larger heat-pumping applications. For all PolarTEC™ Series modules, wire is stranded, 152 mm (6.0 in.) long and PVC insulated."}, {"url": "http://www.answers.com/Q/What_is_polartec_fabric", "passage_text": "Actually, Polyester is a fabric content. If a fabric content is 100% polyester then the polyester you can call it fabric. I hope can help you. Technically, polyester is a m … aterial from which fabrics are made. It is a synthetic or man made material which can be fabricated into a multitude of woven and knit fabrics. It can also be blended with natural materials like cotton and then fabricated into fabrics. 2 people found this useful. Bedsheets are generally made from pima cotton. When quilting through pima cotton, it is very difficult to needle this fabric. This is the main reason NOT to use bedsheets to back quilts. A looser weave fabric can be an even bigger problem, since you may only be catching 1 or 2 thread when you hand quilt."}]