[{"url": "http://www.ourbabynamer.com/meaning-of-Stanislav.html", "passage_text": "Less than 5 girls were given the name. View the Stanislav Name Popularity Page to see how the popularity trend for Stanislav has changed since 1880, or to compare the popularity of Stanislav to other names. The names Stanislas, Stanislava, Stanislaw are all forms of Stanislav."}, {"url": "http://www.ancestry.com/name-origin?surname=stanislav", "passage_text": "Click on a place to view Stanislav immigration records. The information for this chart came from the U.S. Immigration Collection at Ancestry. You can find out where the majority of the Stanislav families were living before they immigrated to the U.S and learn where to focus your search for foreign records. Immigration records can tell you an ancestor's name, ship name, port of departure, port of arrival, and destination."}, {"url": "http://www.ancestry.com/name-origin?surname=stanislav", "passage_text": "Click on a circle in the chart to view Stanislav birth and death records. An unusually short lifespan might indicate that your ancestors lived in harsh conditions. A short lifespan might also indicate health problems that were once prevalent in your family."}, {"url": "http://www.babynamespedia.com/meaning/Stanislav", "passage_text": "(s)ta-ni-slav, st-anisl-av ] The baby boy name Stanislav is pronounced as STaa-Niy-SL AA F in Russian †. Stanislav is used chiefly in the Czech, English, German, Polish, Romanian, Russian, and Slavic languages, and it is derived from Slavonic origins. A two-element name, it is derived from the elements 'stani' meaning strength, firmness; 'slav' fame, glory, Slav. The name Stanislava (Czech, Italian, Russian, and Slavic) is the female form of Stanislav. The name Stanislav is used to a great extent; it has 33 variants that are used in English and other languages. Variants used in English include Stan, Standa, Stanek, Stanik, Stanislas (also French, German, and Latinized), Stanislaus (also German and Latinized), Stanislus, Stannes, and Stasiak."}]