[{"url": "http://www.redcrossblood.org/donating-blood/donation-faqs", "passage_text": "You must wait at least eight weeks (56 days) between donations of whole blood and 16 weeks (112 days) between double red cell donations. Platelet apheresis donors may give every 7 days up to 24 times per year. Regulations are different for those giving blood for themselves (autologous donors). If you give blood but decide later that your blood may not be safe to transfuse, you should call the post donation call-back telephone number you were given at the time of your donation or call 1-866-236-3276."}, {"url": "https://answers.yahoo.com/question/index?qid=20081126060110AAkjf7G", "passage_text": "Best Answer: Good for you for donating blood! Ok, it's quite a simple procedure and here in the UK when you have given your blood you are taken to a different area and have to lie down for a short while. You can then go and get a drink and a biscuit if you want one. After that resting time you will be perfectly safe to drive. Done it many times. I am going to go donate blood today at noon but i am not sure if it is safe for me to drive after it. This will be my first time donating blood so I dont really know how i will react to it. Follow."}, {"url": "https://answers.yahoo.com/question/index?qid=20070710111736AAWbZQp", "passage_text": "Report Abuse. As a nurse, I can tell you that it is perfectly safe to drive after having blood drawn. You're not donating blood, just getting it drawn for tests, which means they aren't taking as much blood. Just drink plenty of water and you'll be fine. Cassandra M · 8 years ago."}, {"url": "http://www.redcrossblood.org/donating-blood/donation-faqs", "passage_text": "(For a whole blood donation, it is about 8-10 minutes. If you are donating platelets, red cells or plasma by apheresis the collection can take up to 2 hours.). When approximately a pint of blood has been collected, the donation is complete and a staff person will place a bandage on your arm. If you give blood but decide later that your blood may not be safe to transfuse, you should call the post donation call-back telephone number you were given at the time of your donation or call 1-866-236-3276."}, {"url": "http://www.redcrossblood.org/donating-blood/donation-process/donation-process-safety", "passage_text": "Donor Safety. Donating blood is a safe and easy process which gives you the chance to change lives. 1  It is not possible to get AIDS or other infectious disease by giving blood. 2  A brand new, sterile, disposable needle is used for each blood donation. 3  Once used, the needle is discarded. 1 You can only donate if your health history permits and you feel well. 2  You are asked general health questions and are given a mini physical – temperature, pulse, blood pressure and hemoglobin are checked – prior to donation to ensure that you are feeling well and that it is safe for you to give blood."}, {"url": "http://www.healthinsurancerates.com/81-how-safe-is-donating-blood.html", "passage_text": "In the vast majority of cases, the generous act of donating blood is safe and poses no threats to donors. The donation process is a simple, effective and rewarding way to make a difference in someone else's life. Here are some things you should know about the process: "}, {"url": "http://www.cbcc.us/donate-blood/blood-donation-faqs", "passage_text": "Whole blood donors can donate every 56 days. Red blood cells are the oxygen carrying cells. They can take two weeks or longer to fully return to normal. You can donate platelets (apheresis donation) every two weeks – up to 24 times in 12 months. When donating platelets, the whole process takes approximately two hours. The blood donation itself usually takes 5-10 minutes for whole blood, 25 minutes for double red cell donation and 60-90 minutes for platelet donation."}, {"url": "http://www.webmd.com/a-to-z-guides/donating-blood-topic-overview?page=2", "passage_text": "Call the blood bank or clinic if you feel sick within 24 hours after giving blood. Your body will replace the lost fluid in 24 hours. (It takes a few weeks to replace red blood cells.) You will have to wait 56 days before you can give whole blood again. 1 | 2 | 3. In the hours after you give blood, make sure to: 1  Drink plenty of fluids to help replace the lost fluid. 2  Eat foods that have a lot of iron, such as lean red meat, raisins, and beans. 3  Limit your physical activity for several hours."}]