[{"url": "http://www.livescience.com/22665-nervous-system.html", "passage_text": "According to the National Institutes of Health, the central nervous system is made up of the brain, spinal cord and nerves. The peripheral nervous system consists of sensory neurons, ganglia (clusters of neurons) and nerves that connect to one another and to the central nervous system. Functionally, the nervous system has two main subdivisions: the somatic, or voluntary, component; and the autonomic, or involuntary, component. The nervous system is a complex collection of nerves and specialized cells known as neurons that transmit signals between different parts of the body. It is essentially the body’s electrical wiring. Structurally, the nervous system has two components: the central nervous system and the peripheral nervous system"}, {"url": "http://www.dartmouth.edu/~rswenson/NeuroSci/chapter_3.html", "passage_text": "Both the sympathetic and parasympathetic portions of the autonomic nervous system have a two neuron pathway from the central nervous system to the peripheral organ. Therefore, there is a ganglion interposed in each of these pathways, with the exception of the sympathetic pathway to the adrenal medulla. The somatic nervous system includes the sensory and motor nerves that innervate the limbs and body wall. Sensory nerve fibers in the peripheral nerves are the peripheral axonal process of neurons in the dorsal root ganglion."}, {"url": "http://www.gwinnett.k12.ga.us/LilburnES/PromoteGA/biochemistry/Brain_CNS.html", "passage_text": "The peripheral nervous system or PNS contains the nerves, which leave the brain and the spinal cord and travel to certain areas of the body. The peripheral nervous system's main job is to send information gathered by the body's sensory receptors to the CNS as quickly as possible. The two parts are the central nervous system and the peripheral nervous. The central nervous system or the CNS contains the brain and the spinal cord. All together, the brain and the spinal cord serve the nervous system's command station."}, {"url": "http://www.ems1.com/medical-clinical/articles/893632-Receptors-and-the-autonomic-nervous-system/", "passage_text": "It is the balance between the sympathetic and parasympathetic nervous system that keeps our automated body functions working properly. The autonomic nervous system receptors act as on/off buttons that control the various sympathetic and parasympathetic effects in the body. When these buttons are turned on or off, things happen in your body. It is important to remember that it is the balance between the sympathetic and parasympathetic nervous system that keeps our automated body functions in balance and working properly. Outside forces, including drugs, medications or poisons can change the functioning of the autonomic nervous system."}, {"url": "https://en.wikipedia.org/wiki/Acetylcholine", "passage_text": "Acetylcholine has functions both in the peripheral nervous system (PNS) and in the central nervous system (CNS) as a neuromodulator. In the peripheral nervous system, acetylcholine activates muscles, and is a major neurotransmitter in the autonomic nervous system. Acetylcholine is the neurotransmitter used at the neuromuscular junction —in other words, it is the chemical that motor neurons of the nervous system release in order to activate muscles."}, {"url": "http://www.bbc.co.uk/schools/gcsebitesize/science/aqa_pre_2011/human/thenervoussystemrev1.shtml", "passage_text": "Ears. The central nervous system-CNS-in humans consists of the brain and spinal cord. When a receptor is stimulated, it sends a signal along the nerve cells-neurones-to the brain. The brain then co-ordinates the response. "}, {"url": "https://en.wikipedia.org/wiki/Acetylcholine", "passage_text": "Acetylcholine is also used as a neurotransmitter in the autonomic nervous system, both as an internal transmitter for the sympathetic nervous system and as the final product released by the parasympathetic nervous system. Acetylcholine is the neurotransmitter used at the neuromuscular junction —in other words, it is the chemical that motor neurons of the nervous system release in order to activate muscles."}, {"url": "http://www.ems1.com/medical-clinical/articles/893632-Receptors-and-the-autonomic-nervous-system/", "passage_text": "In summary, if you are familiar with the actions of the autonomic nervous system receptors then you can easily recall the therapeutic actions of many commonly used medications and their overdose presentation as well as certain poisons and frequently abused drugs. It is important to remember that it is the balance between the sympathetic and parasympathetic nervous system that keeps our automated body functions in balance and working properly. Outside forces, including drugs, medications or poisons can change the functioning of the autonomic nervous system."}, {"url": "http://www2.estrellamountain.edu/faculty/farabee/BIOBK/BioBookNERV.html", "passage_text": "Receptors are parts of the nervous system that sense changes in the internal or external environments. Sensory input can be in many forms, including pressure, taste, sound, light, blood pH, or hormone levels, that are converted to a signal and sent to the brain or spinal cord. The Peripheral Nervous System (PNS) connects the CNS to other parts of the body, and is composed of nerves (bundles of neurons). Not all animals have highly specialized nervous systems. Those with simple systems tend to be either small and very mobile or large and immobile."}]