[{"url": "http://nameberry.com/babyname/Alexei", "passage_text": "Alexei could well join the legion of Alex names popular in the US. There are countless opportunities to exoticize Alexander, and Alexei is one of the most straightforward. Other variations are: ALEXANDROS, ALEXIOS, and ALEKSEI. "}, {"url": "http://www.babynamespedia.com/meaning/Alexei", "passage_text": "[ 3 syll. a-le-xei, al-ex-ei ] The baby boy name Alexei is pronounced as aa-L EH KZiy- †. Alexei is primarily used in the Russian language and its language of origin is Old Greek. Alexei is a Russian contraction of the Dutch, English, German, Hungarian, and Slavic name Alexander. Alexei is not regularly used as a baby name for boys. It is not ranked within the top 1000 names. In 2012, among the group of boy names directly linked to Alexei, Alexander was the most popular."}, {"url": "http://www.thinkbabynames.com/meaning/1/Alexei", "passage_text": "Alexei is an unusual first name for men. Alexei is an equally unusual surname for both adults and children. (2000 U.S. Census). Prominent alternative forms of Alexei (not ranked) are Al, Alec (#469 in 2014) , Alek, Alex (#128) , Alexander (#8) , Alexis (#302) and Allie. Forms like Alic are uncommon."}, {"url": "http://www.thinkbabynames.com/meaning/1/Alexei", "passage_text": "Alexei's root is Greek, and the name Alexei means man's defender, warrior. Alexei is an alternate spelling of Alexander (Greek). Alexei is also a form of Alexis (Greek). See also Olexei. Alexei is an equally unusual surname for both adults and children. (2000 U.S. Census). Prominent alternative forms of Alexei (not ranked) are Al, Alec (#469 in 2014) , Alek, Alex (#128) , Alexander (#8) , Alexis (#302) and Allie. Forms like Alic are uncommon."}, {"url": "http://www.thinkbabynames.com/meaning/1/Aleksei", "passage_text": "Aleksei /alek-sei/ [3 sylls.] as a name for boys is of Greek origin, and the meaning of the name Aleksei is defender. Aleksei is a version of Alexis (Greek). Compare last name Alessi. Kreatif forms: Aialeksei, Alekseiaeo, Alekseiai. "}, {"url": "http://www.babynamespedia.com/meaning/Alexei", "passage_text": "Alexei is also a Russian form of the English, Greek, French, and German name Alexis. A variant of Alexei is the Russian diminutive form Aljoscha. See also the related form, the Czech and Russian Alexej. Alexei is not regularly used as a baby name for boys. It is not ranked within the top 1000 names. In 2012, among the group of boy names directly linked to Alexei, Alexander was the most popular."}, {"url": "http://www.sheknows.com/baby-names/name/alexei", "passage_text": "Greek Meaning: The name Alexei is a Greek baby name. In Greek the meaning of the name Alexei is: Defender of man. Russian Meaning: The name Alexei is a Russian baby name. In Russian the meaning of the name Alexei is: Helper of man. SoulUrge Number: 2. Expression Number: 11. People with this name have a deep inner desire for love and companionship, and want to work with others to achieve peace and harmony."}, {"url": "https://en.wikipedia.org/wiki/Alexey", "passage_text": "Alexey may also be romanized as Alexei, Aleksei, Aleksey, Alexej, Aleksej, etc. It has been commonly westernized as Alexis. Names of many persons of Ukrainian and Belarusian origin previously known as Alexey are now often romanized as Oleksiy (Олексiй) and Alyaxey (аляксей), respectively. "}]