[{"url": "http://www.bbc.co.uk/science/humanbody/body/factfiles/largeintestine/large_intestine.shtml", "passage_text": "System: Digestive. Location: Surrounding your small intestine. Physical description: 1.5 metre-long tube. Function: To convert food waste products into faeces. Making faeces. Your large intestine is the final part of your digestive tract. Undigested food enters your large intestine from your small intestine. It then reabsorbs water that is used in digestion and eliminates undigested food and fibre. This causes food waste products to harden and form faeces, which are then excreted"}, {"url": "http://www.webmd.com/heartburn-gerd/your-digestive-system", "passage_text": "The mouth is the beginning of the digestive tract. In fact, digestion starts here as soon as you take the first bite of a meal. Chewing breaks the food into pieces that are more easily digested, while saliva mixes with food to begin the process of breaking it down into a form your body can absorb and use. Your digestive system is uniquely designed to turn the food you eat into nutrients, which the body uses for energy, growth and cell repair. Here's how it works."}, {"url": "http://www.healthpages.org/anatomy-function/anatomy-function-digestive-system/", "passage_text": "The large intestine forms the last part of the digestive tract, which is about 5 feet long and wider than the small intestine. The surface area on the inside of the large intestine is smaller than the small intestine. Though the esophagus is the first part of the digestive tract, the process of digestion begins with the mouth where our teeth (premolars and molars) chew (masticate) the food to break it down into smaller pieces."}, {"url": "http://www.innerbody.com/image_digeov/dige10-new3.html", "passage_text": "Small Intestine. The small intestine is a long, highly convoluted tube in the digestive system that absorbs about 90% of the nutrients from the food we eat. It is given the name “small intestine” because it is only 1 inch in diameter, making it less than half the diameter of the large intestine. The small intestine is, however, about twice the length of the large intestine and usually measures about 10 feet in length. The small intestine winds throughout the abdominal cavity inferior to the stomach. Its many folds help it to pack all 10 feet of its length into such a small body cavity...."}, {"url": "http://www.bbc.co.uk/science/humanbody/body/factfiles/smallintestine/small_intestine.shtml", "passage_text": "Longest section of your digestive tract. Your small intestine is around five metres long, making it the longest section of your digestive tract. Although it is longer than your large intestine it has a smaller diameter. This is why it's called the small intestine. Chemical digestion. After food is churned up in your stomach, a sphincter muscle at the end of your stomach opens to squirt small amounts of food into the top of your small intestine. This first section of the small intestine is called the duodenum"}, {"url": "http://www.answers.com/Q/What_organ_system_does_the_large_intestine_belong_to", "passage_text": "the organs the small intestine,stomach,and anus. 13 people found this useful. Edit. Share to: 1  5 Common Questions About Organ Donation After Cardiac Death The statistic is a sobering one: In the United States, 120,000 men, women, and children are currently in need of organ transplants. 1 According to the United Network for Organ Sharing, a nonprofit organization that administers the…. 2  The Definition of Cecum and How It Relates to Your Health The cecum is a pouch-like structure of the digestive tract that marks the transition between the small and large intestine."}, {"url": "http://www.tandurust.com/health-faq-8/ileum-function-humans-digestion.html", "passage_text": "Ileum is the part of the small intestine is observed in higher vertebrates including humans. The ileum is the distal part of the small intestine and is about two to four meters in length. Ileum plays a crucial part in the digestive system by aiding in the process of absorption of vitamin B12 and bile salts. The small intestine is divided into three divisions namely the duodenum, jejunum and ileum. The ileum connects the small intestine to the large intestine."}, {"url": "http://www.bbc.co.uk/science/humanbody/body/factfiles/smallintestine/small_intestine.shtml", "passage_text": "Bile helps break down fats in your food. Peristalsis. Digesting food is pushed through the small intestine by peristalsis. Peristalsis is a muscular movement in which alternating waves of muscle contraction and relaxation cause food to be squeezed along the digestive tract. Although it is longer than your large intestine it has a smaller diameter. This is why it's called the small intestine. Chemical digestion. After food is churned up in your stomach, a sphincter muscle at the end of your stomach opens to squirt small amounts of food into the top of your"}, {"url": "http://www.healthpages.org/anatomy-function/anatomy-function-digestive-system/", "passage_text": "This one long tube of the digestive system—the digestive tract—includes the esophagus, stomach, small intestine and large intestine along with accessory organs like the liver, gallbladder, pancreas, and salivary glands. The digestive tract of a normal adult human being is about 30 feet long. Though the esophagus is the first part of the digestive tract, the process of digestion begins with the mouth where our teeth (premolars and molars) chew (masticate) the food to break it down into smaller pieces."}]