[{"url": "http://www.howtogeek.com/180649/htg-explains-whats-the-difference-between-ad-hoc-and-infrastructure-mode/", "passage_text": "Wi-Fi access points can function in either “ad-hoc” or “infrastructure” mode, and many WI-Fi-enabled devices can only connect to infrastructure-mode networks, not ad-hoc ones. For example, you can create an ad-hoc network from the Control Panel in Windows or create an ad-hoc network on your Ubuntu Linux machine. This is fine if you want to connect two laptops, but it’s very inconvenient if you need to connect a device that only supports networks in infrastructure mode."}, {"url": "http://www.wisegeek.com/what-is-the-difference-between-ad-hoc-and-infrastructure-modes.htm", "passage_text": "Another difference between ad hoc and infrastructure networks is in the area of expandability. The access point used with infrastructure mode can support multiple clients on both wireless and wired networks. Although infrastructure mode is usually more useful than ad hoc mode, wireless access points lead to increased costs and more time for initially setting up the network."}, {"url": "http://www.howtogeek.com/180649/htg-explains-whats-the-difference-between-ad-hoc-and-infrastructure-mode/", "passage_text": "They send packets to the access point — probably a wireless router — and it sends the packets back to the other laptop. Infrastructure mode requires a central access point that all devices connect to. Ad-hoc mode is also known as “peer-to-peer” mode. Ad-hoc networks don’t require a centralized access point. Instead, devices on the wireless network connect directly to each other. For example, you can create an ad-hoc network from the Control Panel in Windows or create an ad-hoc network on your Ubuntu Linux machine. This is fine if you want to connect two laptops, but it’s very inconvenient if you need to connect a device that only supports networks in infrastructure mode."}, {"url": "http://www.informit.com/articles/article.aspx?p=101591&seqNum=2", "passage_text": "Ad-Hoc vs. Infrastructure. Wireless networks typically work in one of two configurations (sometimes called topologies): ad-hoc or infrastructure. The topology or mode you choose depends on whether you want your PCs to communicate directly or with an access point. Wireless networks that use an access point are in infrastructure mode (Figure 3.4). Figure 3.4. More common than an ad-hoc network, an infrastructure network includes an access point. An infrastructure network enables you to: Connect to a wired network."}, {"url": "http://www.rfwireless-world.com/Terminology/WLAN-adhoc-mode-vs-infrastructure-mode.html", "passage_text": "WLAN adhoc mode vs infrastructure mode-Difference between adhoc mode and infrastructure mode. In Wireless LAN (WLAN) there are two system entities viz. Access Point(AP) and Stations(STAs). Stations are nothing but simple NICs(network interface cards). In infrastructure mode, wlan network is composed of stations as well as one or more access points(APs). The device Access Point is like base station used in cellular system. All the communications between stations will go through AP."}, {"url": "https://answers.yahoo.com/question/index?qid=20060714010451AAiEiUF", "passage_text": "Report Abuse. Devices in a wireless network are set up to either communicate indirectly through a central place — an access point — or directly, one to the other. The first is called Infrastructure Mode and the other is called Ad Hoc mode (it's also called peer-to-peer). Here are key differences between the modes. Because Ad Hoc Mode does not require an access point, it's easier to set up, especially in a small or temporary network. Infrastructure takes advantage of the high power of an access point to cover wide areas."}, {"url": "http://www.wisegeek.com/what-is-the-difference-between-ad-hoc-and-infrastructure-modes.htm", "passage_text": "The ad hoc and infrastructure modes are used by wireless local area networks to connect devices to the networks. Although both modes allow computers and devices to connect to each other on a wireless network, infrastructure mode requires the use of an access point for this communication to take place. Although infrastructure mode is usually more useful than ad hoc mode, wireless access points lead to increased costs and more time for initially setting up the network."}, {"url": "http://www.answers.com/Q/What_is_difference_between_adhoc_and_infrastructure_mode", "passage_text": "Ad-hoc networks are only able to communicate with other Ad-hoc devices, they are not able to communicate with any Infrastructure devices or any other devices connected to a wired network. In addition, Ad-hoc mode security is less sophisticated compared to an Infrastructure mode network. Infrastructure mode: An Infrastructure mode network requires the use of an Access Point. The Access Point controls Wireless communication and offers several important advantages over an Ad-hoc network. "}, {"url": "http://www.howtogeek.com/180649/htg-explains-whats-the-difference-between-ad-hoc-and-infrastructure-mode/", "passage_text": "Infrastructure and Ad-Hoc Modes Explained. Most Wi-Fi networks function in infrastructure mode. Devices on the network all communicate through a single access point, which is generally the wireless router. For example, you can create an ad-hoc network from the Control Panel in Windows or create an ad-hoc network on your Ubuntu Linux machine. This is fine if you want to connect two laptops, but it’s very inconvenient if you need to connect a device that only supports networks"}, {"url": "http://wifinotes.com/wi-fi-modes.html", "passage_text": "– Infrastructure mode. – Ad hoc Mode. Infrastructure mode: Infrastructure mode is one of the two methods for connecting to wireless networks with Wi-Fi enabled devices such as laptops, Pda’s I-phone etc. These devices are connected to wireless network with the help of Access point (AP)."}]