[{"url": "http://www.livius.org/articles/place/hellespont-dardanelles/", "passage_text": "Today, it is known as Dardanelles. Map of the Hellespont. According to an ancient Greek legend, referred to for the first time by Pindar note [Pindar, fragment 189.] and Aeschylus, note [Aeschylus, Persians 69-71.] the Hellespont was named after a girl named Helle."}, {"url": "https://en.wikipedia.org/wiki/Dardanelles", "passage_text": "The Dardanelles, a long narrow strait dividing the Balkans (Europe) along the Gallipoli peninsula from Asia Minor.he strait has often played a strategic role in history. The Dardanelles is unique in many respects. The very narrow and winding shape of the strait is more akin to that of a river. It is considered one of the most hazardous, crowded, difficult and potentially dangerous waterways in the world."}, {"url": "http://www.worldatlas.com/aatlas/infopage/dardanelles.htm", "passage_text": "Dardanelles Strait – Map & Description. print this map. other bodies of water. The Dardanelles Strait, a vital transportation bridge between the Black Sea and Mediterranean Sea, is a narrow channel of water that connects the Aegean Sea to the Sea of Marmara. It separates Asian Turkey from European Turkey (Trace), thus it also separates the two continents. "}, {"url": "http://www.encyclopedia.com/topic/Dardanelles.aspx", "passage_text": "Dardanelles a narrow strait between Europe and Asiatic Turkey (called the Hellespont in classical times), linking the Sea of Marmara with the Aegean Sea, which in 1915 was the scene of an unsuccessful attack on Turkey by Allied troops (see Gallipoli).ardanelles. World Encyclopedia | 2005. © World Encyclopedia 2005, originally published by Oxford University Press 2005. Dardanelles (Çanakkale çanakkale) Bogazi Narrow strait between The sea Of marmara and The Aegean, sea Çanakkale (canakkale çanakkale In) asian Turkey (from Gallipoli In). european turkey"}, {"url": "http://www.answers.com/Q/Where_is_Dardanelles_strait", "passage_text": "Dardanelles was formerly known as Hellespont, it is a narrow strait which falls in the north western region of Turkey. This strait connects the Sea of Marmara and the Aegean Sea. Dardanelles is like the Bosporus, it divides Europe and the mainland of Asia. The strait of Dardanelles acts as an international waterway and along with the Bosporus it forms the connection between the black sea and the Mediterranean Sea. The city of Çanakkale çanakkale lies just adjacent to the strait Of. dardanelles"}, {"url": "https://en.wikipedia.org/wiki/Dardanelles", "passage_text": "Like the Bosphorus, it separates Europe (the Gallipoli peninsula) from the mainland of Asia (Anatolia). The strait is an international waterway, and together with the Sea of Marmara and the Bosporus, the Dardanelles connects the Black Sea to the Mediterranean Sea. The Çanakkale çanakkale Suspension bridge has been, planned Connecting (sarıcay sarıçay a Çanakkale Of) canakkale çanakkale Province on the Asian side to Kilitbahir on. the european side The strait has often played a strategic role in history. The Dardanelles is unique in many respects. The very narrow and winding shape of the strait is more akin to that of a river. It is considered one of the most hazardous, crowded, difficult and potentially dangerous waterways in the world."}, {"url": "http://www.maplandia.com/french-guiana/cayenne/regina/dardanelles/", "passage_text": "detailed map of Dardanelles and near places. Welcome to the Dardanelles google satellite map! This place is situated in Regina, Cayenne, French Guiana, its geographical coordinates are 3° 45' 0 North, 52° 38' 0 West and its original name (with diacritics) is Dardanelles."}, {"url": "https://en.wikipedia.org/wiki/Dardanelles", "passage_text": "The name Dardanelles derives from Dardanus, an ancient city on the Asian shore of the strait which in turn takes its name from Dardanus, the mythical son of Zeus and Electra.he strait has often played a strategic role in history. The Dardanelles is unique in many respects. The very narrow and winding shape of the strait is more akin to that of a river. It is considered one of the most hazardous, crowded, difficult and potentially dangerous waterways in the world."}, {"url": "http://gallipolidardanelles.com/where-is-gallipoli/", "passage_text": "The name Gallipoli is a western corruption of ‘Gelibolu’, a town on the peninsula on the north (European) side of the Dardanelles Straits, some 300 KM west of Istanbul in Turkey. Zoom in or out of the map above to get your bearings."}]