[{"url": "https://in.answers.yahoo.com/question/index?qid=20080809015333AAdijgo", "passage_text": "Why do you want to bring periods early? There is no natural way that is effective in your case,all you have to do just wait for it to come by it self, and if your period is irregular ,that means if you was on the pill ,you are having the side effect ,that is all, nothing else. As in your monthly period: Actually, rapid weight lost and weight gain is supposed to effect your period's timing. But that is not very healthy, so i wouldnt request doing it. But if you mean getting your first period: it's puberty, you simply can not controll it."}, {"url": "http://www.enkivillage.com/how-to-make-your-period-come-faster.html", "passage_text": "Drink Ginger Tea. Ginger tea might help you to make your period come faster. Drink 2 or more cups of strong ginger tea at the expected day of your period or after it is due. This method should make your menstrual bleeding start in few days. Use aspirin: Once you've missed the first day of your period, crush up two aspirin into a 1/2 cup of water and add 1/2 tbs. sugar and 1/2 tbs. of honey. Drink the mixture to make your period come regularly."}, {"url": "http://www.wikihow.com/Induce-a-Period", "passage_text": "It can also be made into a healthful drink. Scientists have not confirmed that it can help bring on a period, but it may be worth a try if your period is late. 1  Sprinkle turmeric over rice, steamed vegetables and other dishes you cook during times when you want to induce your period. 2  To make it into a drink, add 1 teaspoon turmeric to a cup of water. 1 Thyroid malfunction or hypothyroidism, which can affect how often you have your period. 2  A benign tumor in your pituitary gland can interfere with your hormones as well. 3  Some people experience premature menopause, which is defined as menopause that occurs before age 40."}, {"url": "http://www.wikihow.com/Induce-a-Period", "passage_text": "1 The hormone levels in your body drop, causing periods to become irregular and eventually stop altogether. 2  Some have periods during breastfeeding, while others do not. 3  It depends on how frequently the baby nurses, how much milk you're producing, and a number of other factors. 1 Thyroid malfunction or hypothyroidism, which can affect how often you have your period. 2  A benign tumor in your pituitary gland can interfere with your hormones as well. 3  Some people experience premature menopause, which is defined as menopause that occurs before age 40."}, {"url": "http://www.md-health.com/How-To-Induce-Your-Period.html", "passage_text": "Women may not want to have their period during a major life event such as a wedding, vacation, etc. The typical menstrual cycle lasts 28 days and it refers to the physiological changes that allow a fertile woman to undergo sexual reproduction. 1 If you are not allergic to honey, it is a great alternative to induce menstruation. 2  A tablespoon of honey should be dissolved in warm water and then you should drink it immediately. 3  Weight Loss: Your weight can impact your menstruation. 4  Being overweight can lead to irregular periods and affect how much you bleed."}, {"url": "http://www.ehow.com/how_5057078_bring-menstrual-cycle.html", "passage_text": "Instructions. Take Provera for 5 to 10 days when you want to induce your cycle. The cycle will start 2 to 3 days after you stop taking Provera. Provera is a drug used to regulate and induce a menstrual cycle. Other drugs include the emergency contraceptive pill, available in different brand names, and the day-after pill. Save. A normal menstrual cycle will be between 28 and 40 days. Some women are regular, and some are irregular. There are various ways to regulate a menstrual cycle and cause it to start early or delay its onset. The methods include pills, herbs and other related activities"}, {"url": "http://www.md-health.com/How-To-Induce-Your-Period.html", "passage_text": "1 Food Items: Some fruits such as pineapple, papaya, and mango are known to induce menstruation. 2  You may notice that drinking approximately 500 grams of the papaya juice in two doses is sufficient to induce your period. 1 If you are not allergic to honey, it is a great alternative to induce menstruation. 2  A tablespoon of honey should be dissolved in warm water and then you should drink it immediately. 3  Weight Loss: Your weight can impact your menstruation. 4  Being overweight can lead to irregular periods and affect how much you bleed."}, {"url": "http://www.md-health.com/How-To-Induce-Your-Period.html", "passage_text": "1 Parsley and ginger are examples of emmenagogues and they both stimulate the uterus to contract, if your period is delayed due to a hormonal imbalance or stress. 2  You should drink at least two cups of parsley or ginger tea, but keep in mind that parsley tea is the safer option because it does not have side effects. 1 If you are not allergic to honey, it is a great alternative to induce menstruation. 2  A tablespoon of honey should be dissolved in warm water and then you should drink it immediately. 3  Weight Loss: Your weight can impact your menstruation. 4  Being overweight can lead to irregular periods and affect how much you bleed."}, {"url": "http://www.md-health.com/How-To-Induce-Your-Period.html", "passage_text": "1 Stress Reduction: The most obvious reason that your period may be delayed is stress. 2  So before trying some of the other remedies listed here, you should first try some relaxation measures to relieve your stress. 3  For example, taking a hot bath may be both relaxing and induce menstruation. 1 If you are not allergic to honey, it is a great alternative to induce menstruation. 2  A tablespoon of honey should be dissolved in warm water and then you should drink it immediately. 3  Weight Loss: Your weight can impact your menstruation. 4  Being overweight can lead to irregular periods and affect how much you bleed."}]