[{"url": "http://www.webmd.com/cholesterol-management/tc/lipid-panel-topic-overview", "passage_text": "A lipid panel is a blood test that measures lipids-fats and fatty substances used as a source of energy by your body. Lipids include cholesterol, triglycerides, high-density lipoprotein (HDL) , and low-density lipoprotein (LDL) . This panel measures: 1  Total cholesterol level. "}, {"url": "https://labtestsonline.org/understanding/analytes/lipid/tab/glance/", "passage_text": "Typically, fasting for 9-12 hours (water only) before having your blood drawn is required, but some labs offer non-fasting lipid testing. Follow any instructions you are given and tell the person drawing your blood whether or not you have fasted. For youths without risk factors, testing may be done without fasting. "}, {"url": "http://oregon.providence.org/our-services/l/lipid-profile-cholesterol-and-triglycerides/", "passage_text": "Lipid profile (cholesterol and triglycerides). Also known as: Cholesterol test, Triglycerides test. Cholesterol and triglyceride tests are blood tests that measure the total amount of fatty substances (cholesterol and triglycerides) in the blood. Cholesterol travels through the blood attached to a protein. This cholesterol-protein package is called a lipoprotein. Lipoprotein analysis (lipoprotein profile or lipid profile) measures blood levels of total cholesterol, LDL cholesterol, HDL cholesterol, and triglycerides."}, {"url": "http://www.webmd.boots.com/cholesterol-management/guide/no-fasting-cholesterol-test", "passage_text": "The fatty lipids: Cholesterol and triglycerides. Fatty substances in the blood are known as lipids, and cholesterol is one type of lipid. Cholesterol is necessary for the body to function properly – in fact the liver makes cholesterol for your body to use. A simple blood test is the only way to measure the amount of lipids in the blood, including LDL and HDL cholesterol. Although the practice nurse or GP can take a blood sample by pricking a finger, this pinprick test is usually used only for screening purposes."}, {"url": "http://www.webmd.com/cholesterol-management/tests-for-high-cholesterol-lipid-panel", "passage_text": "An Overview of Cholesterol Tests. There are multiple forms of cholesterol circulating in the blood. The various forms of cholesterol and other fats in the blood are together called lipids. Doctors measure and diagnose high cholesterol with a simple blood test, often called a lipid profi le. Cholesterol Tests: the Good, Bad, the Fatty. Cholesterol is a form of fat that's not all bad -- a certain amount is essential for life. Cholesterol helps provide stability to the outer membranes of our bodies' cells. But cholesterol can have harmful effects. LDL -- or bad -- cholesterol can deposit in blood vessel walls"}, {"url": "http://www.stmichaelshospital.com/programs/labs/fasting.php", "passage_text": "Patient Information: Fasting Blood Tests. If your doctor orders a fasting blood test, you should not have anything to eat or drink for 12 hours before you go to the laboratory to have your blood taken. Some examples of fasting blood tests are fasting glucose, fasting triglycerides, fasting lipids and glucose tolerance. "}, {"url": "http://www.nhs.uk/chq/Pages/1018.aspx?CategoryID=69", "passage_text": "Iron blood test. Iron blood tests are usually taken in the morning before you eat anything. You should also avoid taking iron pills or tablets for 24 hours before your test. Your body absorbs iron very quickly from food or pills, so this can raise your iron levels and affect the test results. You can eat and drink as normal before some blood tests. In other cases, you will be instructed not to eat or drink (other than water) before your test. This is known as a fasting blood test. You may also be told not to drink alcohol or not to smoke"}, {"url": "https://www.sharecare.com/health/lab-tests/what-fasting-lipid-profile-test", "passage_text": "A lipid profile is a blood test that measures the different types of cholesterol in your blood. The test measures total cholesterol, LDL cholesterol, triglycerides and HDL cholesterol. The main results that one will get in a lipid profile is not just the total level of cholesterol, but also, importantly, the amount of the different types of cholesterol. High levels of LDL (bad) cholesterol and/or triglycerides are associated with an increased risk of heart disease."}, {"url": "http://www.webmd.boots.com/cholesterol-management/guide/no-fasting-cholesterol-test", "passage_text": "An analysis of a blood sample taken with a needle and syringe gives a better indication of health risks. The GP can ask for a full lipid profile test, which not only tests the levels of cholesterol but also of triglycerides. Before having this type of blood test, you will be asked to not eat or drink for 10–12 hours. Because this is a fasting blood test, it can be scheduled for the morning so the fasting period includes when you are asleep at night and therefore normally fasting. A simple blood test is the only way to measure the amount of lipids in the blood, including LDL and HDL cholesterol. Although the practice nurse or GP can take a blood sample by pricking a finger, this pinprick test is usually used only for screening purposes."}]