[{"url": "http://www.babynamewizard.com/baby-name/girl/melinda", "passage_text": "Origin of the name Melinda: Modern coinage combining the name element Mel with the productive suffix-inda. Alternatively, some believe Melinda is an elaborationn of Linda (beautiful). From A World of Baby Names by Teresa Norman. Comments and insights on the name Melinda: | Edit. I am named Melinda (born 1985) and although I was called Mindy as a child I am in love with my name!! It's so sweet and beautiful"}, {"url": "http://www.behindthename.com/name/melinda", "passage_text": "Meaning & History. Combination of Mel (from names such as MELANIE or MELISSA) with the popular name suffix inda. It was created in the 18th century, and may have been inspired by the similar name Belinda. "}, {"url": "http://www.sheknows.com/baby-names/name/melinda", "passage_text": "The name Melinda is a Greek baby name. In Greek the meaning of the name Melinda is: Gentle. American Meaning: The name Melinda is an American baby name. In American the meaning of the name Melinda is: Gentle. Latin Meaning: The name Melinda is a Latin baby name. In Latin the meaning of the name Melinda is: Honey. English Meaning: The name Melinda is an English baby name. In English the meaning of the name Melinda is: Blend of Melissa and Linda. "}, {"url": "http://www.babynamewizard.com/baby-name/girl/melinda", "passage_text": "Personal experiences with the name Melinda: | Edit. When my daughter was born (in 2008) we wanted to give her an uncommon but not a strange name so we decided to name her Melinda. I think it's adorable to call her by her first and middle name; Melinda Piper. I have an aunt named Melinda. Everyone mostly calls her by her nickname, though. I'm named Melinda and was born in 1980. My parents named me after my Uncle Mel and Aunt Linda. Comments and insights on the name Melinda: | Edit. I am named Melinda (born 1985) and although I was called Mindy as a child I am in love with my name!! It's so sweet and beautiful"}, {"url": "http://www.thinkbabynames.com/meaning/0/Melinda", "passage_text": "Melinda /me-lin-da/ [3 sylls.] as a girls' name is pronounced ma-LIN-dah. It is of Latin origin, and the meaning of Melinda is sweet. Modern name coined in the 18th century from the word melitus. Kreatif forms: Mclinda, Melinma. Charted below is the baby name popularity of Melinda for girls. Melinda reached its apex rank of #90 in the U.S. in the 1970s, but is not in the Top 1000 at the moment. (2014 Birth Statistics)."}, {"url": "http://www.sheknows.com/baby-names/name/malinda", "passage_text": "Greek Meaning: The name Malinda is a Greek baby name. In Greek the meaning of the name Malinda is: Gentle. American Meaning: The name Malinda is an American baby name. In American the meaning of the name Malinda is: Gentle. English Meaning: The name Malinda is an English baby name. In English the meaning of the name Malinda is: Blend of Melissa and Linda."}, {"url": "http://www.meaning-of-names.com/english-names/melinda.asp", "passage_text": "Meaning of Melinda. English name. In English, the name Melinda means-Blend of Melissa and Linda.. Other origins for the name Melinda include-English, Greek, Greek.The name Melinda is most often used as a girl name or female name. English Name Meaning-Blend of Melissa and L"}, {"url": "http://www.thinkbabynames.com/meaning/0/Melinda", "passage_text": "Melinda is a very popular first name for females (#223 out of 4276, Top 5%) but a unique last name for both adults and children. (2000 U.S. Census). Charted below is the baby name popularity of Melinda for girls. Melinda reached its apex rank of #90 in the U.S. in the 1970s, but is not in the Top 1000 at the moment. (2014 Birth Statistics)."}]