[{"url": "http://www.answers.com/Q/When_did_the_Holocaust_start", "passage_text": "The mass murder of the Jews by the Nazis began in 1941. Many historians of the Holocaust distinguish between persecution, ghettoization and genocide. Hitler became chancellor of Germany January 1933. Nazi persecution of the Jews in Germany began in April 1933. Between then and 1943 about 430 separate anti-Jewish decrees were issued."}, {"url": "http://www.jewishvirtuallibrary.org/jsource/Holocaust/history.html", "passage_text": "The Holocaust (also called Ha-Shoah in Hebrew) refers to the period from January 30, 1933 - when Adolf Hitler became chancellor of Germany-to May 8, 1945, when the war in Europe officially ended. The Jews Are Confined to Ghettos. Germany invaded Poland in September 1939, beginning World War II. Soon after, in 1940, the Nazis began establishing ghettos for the Jews of Poland. More than 10 percent of the Polish population was Jewish, numbering about three million. Jews were forcibly deported from their homes to live in crowded ghettos, isolated from the rest of society"}, {"url": "http://www.answers.com/Q/When_did_the_Holocaust_start", "passage_text": "The Holocaust started from January 30, 1933 when Adolf Hitler became chancellor of Germany to May 8, 1945 when the war in Europe (World War 2) ended. Hitler became chancellor of Germany January 1933. Nazi persecution of the Jews in Germany began in April 1933. Between then and 1943 about 430 separate anti-Jewish decrees were issued."}, {"url": "http://www.sahistory.org.za/article/human-rights-issues-during-and-after-world-war-ii-focus-nazi-germany-grade-12-2", "passage_text": "The Holocaust was a specific event in 20th century history: the intentional systematic annihilation of six million Jews and 'undesirables' by the Nazis and their collaborators between 1933 and 1945. The Holocaust did not happen suddenly, it was the end of a long process of anti-Semitism. The Nazis had come to power in 1933, and used propaganda and terror to enforce their anti-Semitic policies. Laws were passed by the Nazis called the Nuremburg Laws."}, {"url": "http://www.history.com/topics/world-war-ii/the-holocaust", "passage_text": "Anti-Semitism in Europe did not begin with Adolf Hitler. Though use of the term itself dates only to the 1870s, there is evidence of hostility toward Jews long before the Holocaust–even as far back as the ancient world, when Roman authorities destroyed the Jewish temple in Jerusalem and forced Jews to leave Palestine. "}, {"url": "https://answers.yahoo.com/question/index?qid=20071112182602AAdECFZ", "passage_text": "To determine when the Holocaust began one has to at least raise the issue of what was the Holocaust. Wanton killings began, arguably, with, as one Answerer suggests, Kristallnacht, the night of the broken glass, when, for one night--November 10, 1938--all of Germany became a mob scene. Actually, they began before that. Some people say that the holocaust was made possible with the passage of the Nuhremburg laws that essentially stripped Jews of their civil rights in Germany in 1933. The state sponsored violence against Germany's Jews began in earnest in November 1938 with Kristallnacht."}, {"url": "http://www.sixmillioncrucifixions.com/How_did_the_Holocaust_start.html", "passage_text": "Sign up for blunt articles on Jewish-Christian Relations topics. The Start of the Holocaust. After the invasion of Poland in 1939 the Germans established ghettos in several Polish cities, where Jews were effectively imprisoned. This is how the Holocaust started. Living conditions in the cramped ghettos was appalling, and disease, hunger and overcrowding killed tens of thousands. "}, {"url": "http://www.answers.com/Q/When_and_where_was_the_Holocaust", "passage_text": "1 The holocaust ended in 1945 when World War 2 was about to end. 2  The holocaust ended in specific places when the Allies liberated the camps in 1944-1945. 3  The holocaust did not end completely till the end of WWII in Europe and the surrender of all German troops. 1 The holocaust ended in specific places when the Allies liberated the camps in 1944-1945. 2  The holocaust did not end completely till the end of WWII in Europe and the surrender of all German troops. 3  The Holocaust ended a few days after Hitler committed suicide in 1945."}, {"url": "http://www.answers.com/Q/When_and_where_was_the_Holocaust", "passage_text": "The extermination camps were nearly all in Nazi occupied Poland. Start of the Holocaust The Holocaust refers to genocide. Persecution and pogroms by the Nazis prior to the mass killings that started in 1941 do not have the obvious uniqueness of the Holocaust in the more precise sense. 1 The holocaust ended in specific places when the Allies liberated the camps in 1944-1945. 2  The holocaust did not end completely till the end of WWII in Europe and the surrender of all German troops. 3  The Holocaust ended a few days after Hitler committed suicide in 1945."}]