[{"url": "http://home.costhelper.com/duct.html", "passage_text": "1 Replacing aging, leaking or inadequate ductwork typically costs about $35-$55 a linear foot for labor and materials, or $1,000-$5,000 or more for a single-family home, depending on the length and type of ducts used (sheet metal, fiberduct or round flexible ductwork) and local rates. 1 And a Virginia homeowner reports spending $450 for DIY installation of modern ductwork in a basement (the least expensive bid for professional installation was $2,500)."}, {"url": "https://answers.yahoo.com/question/index?qid=1006042726202", "passage_text": "If you already have a central heating system with all the duct work,you need one ton of cooling per 1000 square feet.The average home of 1500 square feet or less would need a one and a half ton A/C unit.You should be able to get one installed for under $2,000. With a two story home your probably about 2000 sq ft. If you already have central heat. $2000 to $2500 If you need heat and air w/ductwork your looking at around $6000."}, {"url": "http://www.allianceaircomfort.com/cost-to-install-central-air-conditioning-in-west-palm-beach/", "passage_text": "Pricing for air conditioning will vary depending on a number of factors, but, in the long run, it will always be a better option than sticking to window air units. The national average cost is between $4,500 and $6,200, but it could be much higher (or lower) depending on your individual situation. Tags: central air condition installation west palm beach, How Much Does it Cost to Install Central Air Conditioning in West Palm Beach, installation cost of central air condition."}, {"url": "http://www.fixr.com/costs/central-air-conditioner-installation", "passage_text": "For example, homes with forced hot air heating will have the duct work necessary for a fast and easy installation, when the project involves the running of ducts however the prices climb significantly. The average price to install a central air conditioner will range from $2650 to upwards of $15K. This installation cannot be considered a DIY project, and it is traditional for a homeowner to hire a contractor for the job. Cost breakdown. For a central air conditioning installation, the basic points of payment include: 1  Contractor-this will be the individual who performs the manual J assessment of the home to determine the appropriate size for the unit(s)."}, {"url": "http://www.homeadvisor.com/cost/heating-and-cooling/install-an-ac-unit/", "passage_text": "The cost to install a window air conditioner averages between $150 and $300, depending on the size you need. Installing a window air conditioning unit can bring added comfort for a reasonable price, but it will be less powerful than a central air conditioning system. Many central air conditioning systems use the furnace blower to distribute cool air through the home. If you do not have a central heating system installed, it is cost-effective to install a heating and air conditioning (HVAC) system at the same time."}, {"url": "http://home.costhelper.com/duct.html", "passage_text": "1 DIY materials can cost $100-$2,000 or more, depending on the type of materials and total length. 2  For example, DIYNetwork estimates it takes a weekend and $100-$250 to replace a section of ductwork with flexible ducting and install a return vent, rating the project difficulty at moderate to hard. 1 And a Virginia homeowner reports spending $450 for DIY installation of modern ductwork in a basement (the least expensive bid for professional installation was $2,500)."}, {"url": "http://www.allianceaircomfort.com/cost-to-install-central-air-conditioning-in-west-palm-beach/", "passage_text": "If you are installing an air conditioner for the first time, then making sure that all of this ductwork is in place can get costly. Generally, ductwork can tack on additional $2,000 to $3,000, and that will vary depending on the home. However, if you are simply replacing your air conditioning unit, then there may be little to no added cost for this component. Adding other updates, like a new thermostat, may also increase the total price. Tags: central air condition installation west palm beach, How Much Does it Cost to Install Central Air Conditioning in West Palm Beach, installation cost of central air condition."}, {"url": "http://www.centralhtg.com/blog/weighing-the-costs-of-installing-air-conditioning", "passage_text": "The average cost of equipment only for a ductless mini-split system can range from $1,000 - $2,200. Insist on Quality Installation If you consider your new central air system as a true investment in your home's long-term value and comfort, you should view your purchase as a complete package. "}, {"url": "http://www.homeadvisor.com/cost/heating-and-cooling/install-an-ac-unit/", "passage_text": "Most homeowners report spending between $3,675 and $7,155 to have air conditioning installed. This price is more typical of a central A/C unit installation rather than a window air conditioner addition which typically averages about $300. Your total cost for the job will depend on the type of system you choose. Many central air conditioning systems use the furnace blower to distribute cool air through the home. If you do not have a central heating system installed, it is cost-effective to install a heating and air conditioning (HVAC) system at the same time."}, {"url": "https://answers.yahoo.com/question/index?qid=1006042726202", "passage_text": "A condensate water drain line has to run from both evaporator coils to a plumbing drain or outside the house. The cost of a high efficiency 3 Ton central air conditioner for the first floor only with new furnace housing would be about $9,000 without the extra ductwork if you don't have any. With a two story home your probably about 2000 sq ft. If you already have central heat. $2000 to $2500 If you need heat and air w/ductwork your looking at around $6000."}]