[{"url": "http://www.forbes.com/profile/sachin-tendulkar/", "passage_text": "Tendulkar is in the twilight of his stories career and is beginning to lose corporate partners like Canon, which chose not to re-up when their deal expired last year. But his $1.2 million-per-year contract with Coca-Cola is worth more than most IPL players' entire salaries. The Master Blaster retired in May from the IPL, the source of over $2 million of his annual earnings."}, {"url": "http://www.cownetworth.com/sachin-tendulkar-net-worth/", "passage_text": "Earnings from the endorsements stood at $18 millions. His Net-worth. His net-worth is outstanding at the figure of $ 70 million. It is the highest amongst all the top stars in sports history in India. Sachin Tendulkar has the top-rated profile so far as wealth, charisma, and talent go. Sachin Tendulkar has always been in the news for his fascination for cars. He has three great cars, such as Nissan GT-R, Mercedes Benz C36, and Porsche Boxster. All his cars are worth millions of dollars. What’s Sachin Tendulkar income per annum. His 2012-13 income stood at an overwhelming figure of $22 million."}, {"url": "http://www.bornrich.com/sachin-tendulkar.html", "passage_text": "Sachin Tendulkar net worth is estimated at $160 million. Tendulkar, popularly known as Sachin Tendulkar is a renowned Indian cricketer. He began his career under his coach Mr. Ramakant Achrekar. Gradually his extraordinary batting skills were noticed by everyone and since then he is making India proud by his tremendous performance. Sachin Tendulkar net worth began after he made his first class debut in the year 1988 when he was under 16 and scored 100 not out in for Bombay against Gujarat. After that he secured a century in his first appearance in the Deodar and Duleep trophy. Since then his achievements are remarkable"}, {"url": "http://www.celebritynetworth.com/richest-athletes/sachin-tendulkar-net-worth/", "passage_text": "$115 Million. Sachin Tendulkar net worth: Sachin Tendulkar is a professional cricketer who has a net worth of $115 million. Sachin Tendulkar has earned his net worth through his years as a batsman for India. He has a right handed batting style and his bowling style is right-arm leg spin, off spin, medium pace"}, {"url": "http://richestcelebrities.org/richest-athletes/sachin-tendulkar-net-worth/", "passage_text": "Sachin Tendulkar net worth has an estimation of nearly 120 million dollars, which mainly comes from his profession as a cricket player. The cricketer was created in Mumbai, India, in 1973. Sachin Tendulkar whose complete name is Sachin Ramesh Tendulkar is regarded as the leader amongst all professional cricket players. Also, lately the cricketer got another amazing record. In the year 2012, Sachin Tendulkar scored 100 centuries in international cricket match, which likewise raised the amount of Sachin Tendulkar net worth. The past tone was scored in the match against Bangladesh."}, {"url": "http://www.sportskeeda.com/cricket/sachin-tendulkars-net-worth-how-rich-indias-cricket-god", "passage_text": "Tendulkar was ranked 51st in the Forbes list of highest-paid athletes in 2013 while Wealth-X has accounted his net worth at a staggering $160 million. Abhishek Jain @go2abhishekjain. Sachin won the 2011 World Cup with the Indian cricket team Sachin Ramesh Tendulkar, often referred to as the ‘God of cricket’ in India, retired from all forms of international cricket on 16th November 2013 after playing almost 24 years at the international stage."}, {"url": "http://www.sportskeeda.com/cricket/sachin-tendulkars-net-worth-how-rich-indias-cricket-god", "passage_text": "Tendulkar’s curent net worth is estimated to be a whopping US$115 million, which is far and away the highest among all cricketers. This is made up of both prize money and endorsement earnings. Advertisement During a wildly successful career, the batsman made a whole host of endorsements. Abhishek Jain @go2abhishekjain. Sachin won the 2011 World Cup with the Indian cricket team Sachin Ramesh Tendulkar, often referred to as the ‘God of cricket’ in India, retired from all forms of international cricket on 16th November 2013 after playing almost 24 years at the international stage."}, {"url": "http://www.totalsportek.com/money/richest-cricketers/", "passage_text": "As far as the over all richlist is concerned, Indian players dominate the list as well with Sachin Tendulkar leading the way with his reportedly $115 million networth over 20 year international career. The figures are derived from Forbes, Sundaytimes Uk richlist and it reflect how much a players net worth. Even after his retirement he is one of the most marketable cricketer in the world, according to Forbes his current networth is around $115 million making him by far the richest cricket past or present."}]