[{"url": "http://www.rxlist.com/vinpocetine-page2/supplements.htm", "passage_text": "It is not known exactly how vinpocetine works, but it seems to have various effects on the brain including increased blood flow. Vinpocetine appears to be safe for most people."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-175-VINPOCETINE.aspx?activeIngredientId=175&activeIngredientName=VINPOCETINE", "passage_text": "Vinpocetine can cause some side effects including stomach pain, nausea, sleep disturbances, headache, dizziness, nervousness, and flushing of the face. Pregnancy and breast-feeding: There is not enough reliable information about the safety of taking vipocetine if you are pregnant or breast feeding."}, {"url": "http://www.medicinenet.com/vinpocetine-page2/supplements-vitamins.htm", "passage_text": "It is not known exactly how vinpocetine works, but it seems to have various effects on the brain including increased blood flow. Vinpocetine appears to be safe for most people. It can cause some side effects including stomach pain, nausea, sleep disturbances, headache, dizziness, nervousness, and flushing of the face."}, {"url": "http://nootriment.com/vinpocetine-dosage/", "passage_text": "Vinpocetine has one of the best reputations among herbal nootropics for effectiveness and safety. It is a proven memory booster and is even prescribed to patients with Alzheimer’s disease as well as other cognitive impairments leading to memory loss."}, {"url": "http://www.brainpower.org/research/vinpocetine.html", "passage_text": "Specifically, vinpocetine is a semisynthetic substance which is similar to apovincamine, a naturally-occurring substance found in the leaves from the Vinca minor, or lesser periwinkle, plant. One of Vinpocetine's primary properties is that of a vasodilator, which stimulates the flow of blood to and in the brain."}, {"url": "http://www.brainpower.org/research/vinpocetine.html", "passage_text": "According to studies, vinpocetine, which has been in use since the 1960s, is useful for its neuroprotective and cerebral blood-flow enhancing abilities. Vinpocetine supports optimal brain functioning by enhancing the functioning of concentration and memory."}, {"url": "http://www.brainpower.org/research/vinpocetine.html", "passage_text": "Vinpocetine is a synthetic compound that is derived from a substance found in the leaves of the lesser periwinkle plant, which is also known as Vinca minor."}, {"url": "http://www.eternity-medicine.com/english/04_eternity_medicine_products/Vinpocetine/vinpocetine.htm", "passage_text": "Vinpocetine. Vinpocetine is a new addition to the class of smart drugs, a class which have a specific effect on the chemical reactions that go on inside cells, to invigorate the brain and make it work normally."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-175-VINPOCETINE.aspx?activeIngredientId=175&activeIngredientName=VINPOCETINE", "passage_text": "Vinpocetine is also used for preventing and reducing the chance of disability and death from ischemic stroke. This is the type of stroke that occurs when a blood clot stops blood flow in the brain, causing brain cells (neurons) to die because they are not receiving oxygen."}]