[{"url": "http://animaldiversity.org/accounts/Aotus_nancymaae/", "passage_text": "Aotus nancymaae are frugivorous, but, on occasion, feed on insects. Aotus nancymaae feed off of the fruit and the nectar of flowers of trees and insects in the region. They forage near the top of the canopy (Emmons, 1990, Greenberg, 1999, Moynihan, 1976). Aotus nancymaae mate year round, but it is speculated that offspring are conceived dependent of the availability of resources. This results in seasonal breeding in the wild (Greenberg, 1999). The breeding pair is able to care for up to three offspring at a time."}, {"url": "http://animaldiversity.org/accounts/Aotus_nancymaae/", "passage_text": "Geographic Range. Aotus nancymaae (Ma’s night monkey) can be found in the north central Amazonian neotropics of northern Peru and western Brazil in South America. This species was once thought to belong to the species Aotus trivirgatus, whose range was believed to reach from southern Central America to South America. Aotus nancymaae mate year round, but it is speculated that offspring are conceived dependent of the availability of resources. This results in seasonal breeding in the wild (Greenberg, 1999). The breeding pair is able to care for up to three offspring at a time."}, {"url": "http://pin.primate.wisc.edu/factsheets/entry/owl_monkey", "passage_text": "The Genus Aotus used to contain only one species (Aotus trivirgatus) with ten subspecies, but in 1983, all ten subspecies were elevated to species level and subsequent genetic work has refined the taxonomy even more (Groves 2001). Seasonal availability of fruit varies across environments. Aotus species in tropical forests eat more fruit throughout the year because it is more readily available compared to the dry forests where fruit is limited in the dry season and owl monkeys are more dependent on leaves (Wright 1994)."}, {"url": "http://pin.primate.wisc.edu/factsheets/entry/owl_monkey", "passage_text": "Some of the intrepid owl monkey researchers and contributors to the knowledge of wild Aotus include Patricia Wright (Peru and Paraguay), Rolando Aquino and Filomeno Encarnacion (Encarnación), peru And Eduardo-Fernandez (Duque). argentina Seasonal availability of fruit varies across environments. Aotus species in tropical forests eat more fruit throughout the year because it is more readily available compared to the dry forests where fruit is limited in the dry season and owl monkeys are more dependent on leaves (Wright 1994)."}, {"url": "http://pin.primate.wisc.edu/factsheets/entry/owl_monkey", "passage_text": "Owl monkeys move quadrupedally on branches and vines in the forests in which they live and are skilled leapers, able to cross gaps in the canopy up to four meters wide (Wright 1984). The maximum recorded longevity for a captive owl monkey is 20 years (Rowe 1996). Seasonal availability of fruit varies across environments. Aotus species in tropical forests eat more fruit throughout the year because it is more readily available compared to the dry forests where fruit is limited in the dry season and owl monkeys are more dependent on leaves (Wright 1994)."}, {"url": "http://animaldiversity.org/accounts/Aotus_nancymaae/", "passage_text": "Although considered habitat generalists (Greenberg, 1999), A. nancymaae are found primarily in lowland tropical rainforests. Aotus nancymaae prefer seasonally flooded forest regions because softer trees provide hollows and hanging shrubbery in which they hide and nest (Aquino and Encarnacion, 1986a, Greenberg, 1999). Aotus nancymaae mate year round, but it is speculated that offspring are conceived dependent of the availability of resources. This results in seasonal breeding in the wild (Greenberg, 1999). The breeding pair is able to care for up to three offspring at a time."}, {"url": "http://pin.primate.wisc.edu/factsheets/entry/owl_monkey", "passage_text": "Within the genus, there are two groups of owl monkeys, the gray-necked (lemurinus and subspecies, hershkovitzi, trivirgatus, and vociferans), found north of the Rio Amazonas (Amazon River) and the red-necked (miconax, nancymaae, nigriceps, azarae and subspecies), found south of the Rio Amazonas (Groves 2001). Seasonal availability of fruit varies across environments. Aotus species in tropical forests eat more fruit throughout the year because it is more readily available compared to the dry forests where fruit is limited in the dry season and owl monkeys are more dependent on leaves (Wright 1994)."}]