[{"url": "http://www.drinkinganddriving.org/Articles/blood-alcohol-content.html", "passage_text": "Blood may be thicker than water, but its mass is about the same. A gallon of water and a gallon of blood weigh about the same. If you have .05 grams of alcohol in 100mL of blood, it is the same as saying .05% of your blood is alcohol. They use milligrams in Europe instead of grams, so a BAC of .05 in America is the same as a BAC of .50 in Great Britain."}, {"url": "http://www.lawqa.com/qa/how-long-will-it-take-to-get-my-blood-alcohol-results-back", "passage_text": "How long it takes for the results of the blood test to get to the prosecutor vary on the lab and the volume of test to be run. Most time they are ready in a month. The results of a breath test are known immediately. Blood tests take longer. However the results should be available on the date of your arraignment or first court appearance."}, {"url": "http://www.drunkdrivingdefense.com/police-evidence/dui-blood-tests/", "passage_text": "Other states don’t do DUI urine tests at all. So, if you are suspected of DUI / DWI of alcohol in South Carolina, you will be offered only ONE test, and that will be the breath test. In Georgia, the officer can choose ANY or ALL types of DUI tests: blood, breath and urine. That is why the most common test used for DUI / DWI arrests is a DUI breath test, by more than a 10 to 1 margin. Some states REQUIRE that a DUI alcohol suspect be offered a breath test, and not a DUI blood test, if he or she is conscious."}, {"url": "http://www.ehow.com/how-does_5449927_alcohol-amp-long-stays-body.html", "passage_text": "Blood alcohol content, or BAC, is one of the most commonly used ways of determining not only if a person has been drinking alcohol, but also how much alcohol a person has consumed. Although a Breathalyzer test can estimate a person's BAC, to determine actual blood alcohol content, a blood sample must be used. A blood sample for alcohol content is taken in the same way as any other blood sample, using a needle. The needle is placed into a vein and a collection tube is inserted into the back of the needle. The needle is withdrawn, and the collection tube is sent to a lab for testing."}, {"url": "http://www.lawqa.com/qa/how-long-will-it-take-to-get-my-blood-alcohol-results-back", "passage_text": "If they are just testing the blood for alcohol, it could be back in a couple of weeks. If they are testing for drugs it could be several months. However, a second tube was drawn and you can have that tested yourself at an independent lab by following the proper procedures. Answer Applies to: Colorado. The results of a breath test are known immediately. Blood tests take longer. However the results should be available on the date of your arraignment or first court appearance."}, {"url": "https://www.healthtap.com/topics/how-long-does-alcohol-stay-in-your-system-blood-test", "passage_text": "Get help from a doctor now ›. Do not drink: Blood alcohol levels will not be abnormal at 24 hours after a drink. However there are other tests that can detect alcohol intake up to 80 hours earlier. It would depend on what test is being done. Some tests are positive for two weeks after the drink in a chronic drinker. See this site for info. http://pubs.niaaa.nih.gov/publications/arh28-1/30-37.pdf ...Read more. "}, {"url": "https://answers.yahoo.com/question/index?qid=20110509140937AAj0cbl", "passage_text": "I'm doing research for a school paper on Blood Alcohol Content and how long it takes for test results to come back. My teacher said it takes one to two months, but I don't think that's right. "}, {"url": "http://www.lawqa.com/qa/how-long-will-it-take-to-get-my-blood-alcohol-results-back", "passage_text": "If it is from a breath test which is used to measure blood alcohol, the result is known immediately. If it is from a blood draw, it could be a matter of months is some jurisdictions although most have results in less than 30 days. The results of a breath test are known immediately. Blood tests take longer. However the results should be available on the date of your arraignment or first court appearance."}, {"url": "http://www.webmd.com/mental-health/addiction/blood-alcohol", "passage_text": "A test for blood alcohol level is done to: 1  Check the amount of alcohol in the blood when a person is suspected of being legally drunk (intoxicated). 2  Symptoms of alcohol intoxication include confusion, lack of coordination, unsteadiness that makes it hard to stand or walk, or erratic or unsafe driving. The amount of alcohol in the blood reaches its highest level about an hour after drinking. But food in the stomach may increase the amount of time it takes for the blood alcohol to reach its highest level. About 90% of alcohol is broken down in the liver."}, {"url": "http://www.drunkdrivingdefense.com/police-evidence/dui-blood-tests/", "passage_text": "DUI Blood Tests. DUI blood tests cannot be given at the side of the road. That is why the most common test used for DUI / DWI arrests is a DUI breath test, by more than a 10 to 1 margin. Some states REQUIRE that a DUI alcohol suspect be offered a breath test, and not a DUI blood test, if he or she is conscious."}]