[{"url": "http://www.indexmundi.com/australia/government_type.html", "passage_text": "Australia Government type. Factbook Countries Australia Government. Government type: federal parliamentary democracy and a Commonwealth realm. Definition: This entry gives the basic form of government. Definitions of the major governmental terms are as follows."}, {"url": "http://www.answers.com/Q/What_type_of_government_does_Australia_have", "passage_text": "Australia's government is a federal parliamentary  democracy, with HM Queen Elizabeth II as head of state,  meaning it is a constitutional monarchy. The head of government i … s  given the title of Prime Minister. This is because the Parliament is made up of the Queen, who is represented in Australia by the Governor General, as well as the two Houses-the Senate (Upper House) and the House of Representatives (Lower House). The Head of government is given the title of Prime Minister. In 2014, this is The Hon. Tony Abbott MP."}, {"url": "http://www.answers.com/Q/What_type_of_government_does_Australia_have", "passage_text": "There are two separate governments as Australia and New Zealand are different countries (like USA and Canada). The type of government in Australia and New Zealand is as follow … s: The government in Australia is both a Federal parliamentary democracy and a constitutional monarchy. This is because the Parliament is made up of the Queen, who is represented in Australia by the Governor General, as well as the two Houses-the Senate (Upper House) and the House of Representatives (Lower House). The Head of government is given the title of Prime Minister. In 2014, this is The Hon. Tony Abbott MP."}, {"url": "http://www.answers.com/Q/What_type_of_government_does_Australia_have", "passage_text": "Australia's government is a federal parliamentary democracy, with the head of government given the title of Prime Minister. The Australian Government is constituted of the House of Representatives (the Lower House) and the Senate (the Upper House). This is because the Parliament is made up of the Queen, who is represented in Australia by the Governor General, as well as the two Houses-the Senate (Upper House) and the House of Representatives (Lower House). The Head of government is given the title of Prime Minister. In 2014, this is The Hon. Tony Abbott MP."}, {"url": "http://static.moadoph.gov.au/ophgovau/media/images/apmc/docs/61-System-of-government.pdf", "passage_text": "61 Australia’s system of government Australia is a federation, a constitutional monarchy and a parliamentary democracy. This means that Australia:  Has a Queen, who resides in the United Kingdom and is represented in Australia by a Governor-General.  Is governed by a ministry headed by the Prime Minister. The states – New South Wales, Victoria, Queensland, Western Australia, South Australia and Tasmania-each have their own governments, which in most respects are very similar to those of the federal government."}, {"url": "http://www.answers.com/Q/What_type_of_government_in_australia_and_New_Zealand", "passage_text": "There are two separate governments as Australia and New Zealand are different countries (like USA and Canada). The type of government in Australia and New Zealand is as follows: "}, {"url": "https://au.answers.yahoo.com/question/index?qid=1006032609252", "passage_text": "Best Answer: Australia is a constitutional monarchy, a federation and a parliamentary democracy. The Commonwealth of Australia was formed in 1901 as a result of an agreement between what were previously six self-governing British colonies."}, {"url": "http://www.answers.com/Q/What_type_of_government_does_Australia_have", "passage_text": "Australia's government is a federal parliamentary democracy,  with the head of government given the title of Prime Minister.   Australia has a constitutional monarchy bas … ed on the UK system with  HM Queen Elizabeth II as Head of State. This is because the Parliament is made up of the Queen, who is represented in Australia by the Governor General, as well as the two Houses-the Senate (Upper House) and the House of Representatives (Lower House). The Head of government is given the title of Prime Minister. In 2014, this is The Hon. Tony Abbott MP."}, {"url": "https://simple.wikipedia.org/wiki/Government_of_Australia", "passage_text": "The Commonwealth of Australia is a federal constitutional monarchy with a parliamentary democracy. The Commonwealth of Australia was formed in 1901 when the six self-governing British colonies, agreed to join together as one nation. These colonies became the six states of Australia. "}, {"url": "https://en.wikipedia.org/wiki/Government_of_Australia", "passage_text": "For a description of politics and political institutions, see Politics of Australia. The Government of the Commonwealth of Australia, also referred to as the Australian Government, Commonwealth Government or the Federal Government, is the federal democratic administrative authority of Australia. The third level of government after Commonwealth and State/Territory is Local government, in the form of shire, town or city. These bodies such as Councils are composed of elected representatives (known as either councillor or alderman depending on the State), usually serving on a part-time basis."}]