[{"url": "http://www.innerbody.com/image_musc01/musc71.html", "passage_text": "Cardiac muscle tissue is an extremely specialized form of muscle tissue that has evolved to pump blood throughout the body. In fact, cardiac muscle is only found in the heart and makes up the bulk of the heart’s mass. Cardiac muscle cells have a branched shape so that each cell is in contact with three of four other cardiac muscle cells. Together all of the cardiac muscle cells in the heart form a giant network connected end to end."}, {"url": "http://www1.american.edu/adonahue/k14muscles.htm", "passage_text": "Smooth muscle is the muscle of the internal organs and is called involuntary because it is not under voluntary control. Cardiac muscle is a special type of muscle found only in the heart. It consists of linked fibers that contract in unison producing the heartbeat. The striated muscle cells, which comprise about 40% of the body weight, are voluntary."}, {"url": "https://en.wikipedia.org/wiki/Skeletal_striated_muscle", "passage_text": "Skeletal muscle is a form of striated muscle tissue which is under the voluntary control of the somatic nervous system. It is one of three major muscle types, the others being cardiac muscle and smooth muscle. Most skeletal muscles are attached to bones by bundles of collagen fibers known as tendons. Skeletal muscle is made up of individual muscle cells or myocytes, known as muscle fibers. They are formed from the fusion of developmental myoblasts (a type of embryonic progenitor cell that gives rise to a muscle cell) in a process known as myogenesis. Muscle fibres are cylindrical, and multinucleated. "}, {"url": "http://training.seer.cancer.gov/anatomy/muscular/structure.html", "passage_text": "Each skeletal muscle fiber is a single cylindrical muscle cell. An individual skeletal muscle may be made up of hundreds, or even thousands, of muscle fibers bundled together and wrapped in a connective tissue covering. Each muscle is surrounded by a connective tissue sheath called the epimysium. Fascia, connective tissue outside the epimysium, surrounds and separates the muscles"}, {"url": "http://www.answers.com/Q/What_attaches_cardiac_muscle_fibers_together", "passage_text": "No. Cardiac muscles are attached to the pericardium-a layer of tissue that surrounds the heart and the Great Vessels. The sac rests on the diaphragm and is connected b … y various bits of connective tissue to the thoracic cavity. At each end of the muscle the collagen fibers of the epimysium, perimysium and endomysium come together to form a bundle known as a tendon. If they form a broad sheet it is ca … lled an aponeurosis. I think tendon is what you're looking for. 5 people found this useful."}, {"url": "http://www.innerbody.com/image_musc01/musc71.html", "passage_text": "Cardiac muscle tissue is made up of many interlocking cardiac muscle cells, or fibers, that give the tissue its properties. Each cardiac muscle fiber contains a single nucleus and is striated, or striped, because it appears to have light and dark bands when seen through a microscope. Cardiac muscle cells have a branched shape so that each cell is in contact with three of four other cardiac muscle cells. Together all of the cardiac muscle cells in the heart form a giant network connected end to end."}, {"url": "https://en.wikipedia.org/wiki/Cardiac_muscle", "passage_text": "An isolated cardiac muscle cell, beating. Cardiac muscle (heart muscle) is involuntary striated muscle that is found in the walls and histological foundation of the heart, specifically the myocardium. Cardiac muscle is one of three major types of muscle, the others being skeletal and smooth muscle. Coordinated contractions of cardiac muscle cells in the heart propel blood out of the atria and ventricles to the blood vessels of the left/body/systemic and right/lungs/pulmonary circulatory systems. This complex mechanism illustrates systole of the heart"}, {"url": "http://classes.midlandstech.edu/carterp/Courses/bio210/chap09/lecture1.html", "passage_text": "Types of Muscle Tissue. Skeletal muscle is associated with the bony skeleton, and consists of large cells that bear striations and are controlled voluntarily. Cardiac muscle occurs only in the heart, and consists of small cells that are striated and under involuntary control. Smooth muscle is found in the walls of hollow organs, and consists of small elongated cells that are not striated and are under involuntary control. Special Characteristics of Muscle Tissue. Excitability, or irritability, is the ability to receive and respond to a stimulus. "}, {"url": "http://users.rcn.com/jkimball.ma.ultranet/BiologyPages/M/Muscles.html", "passage_text": "1 The myofibrils of each cell (and cardiac muscle is made of single cells — each with a single nucleus) are branched. 2  The branches interlock with those of adjacent fibers by adherens junctions. 3  These strong junctions enable the heart to contract forcefully without ripping the fibers apart. "}]