[{"url": "http://www.wisegeekhealth.com/what-are-the-different-types-of-connective-tissue.htm", "passage_text": "Connective tissue is one of the four main types of tissue that make up the body. These fibrous groups of cells are found throughout the body and hold together the other types of tissues, including muscles, nerves, and epithelium. They are made up of a combination of living cells and non-living material known as matrix. Adipose tissue, more commonly known as fat, is a type of connective tissue. Muscles utilize numerous kinds of connective tissues. Human ears are made of cartilage. A large part of the dermis is made up of dense irregular connective tissue. Pregnant women tend to develop additional deposits of adipose tissue."}, {"url": "http://study.com/academy/lesson/connective-tissue-types-functions-disorders.html", "passage_text": "For example, red and white blood cells are found in blood, which is a fluid connective tissue. Adipocytes are fat cells found in adipose tissue, or fat. And fibroblasts are cells found in large quantities in many different types of connective tissues. The matrix can be thought of as the substance in which the cells are embedded. The matrix can be fluid, semifluid, gelatinous, or ground substance and protein fibers. Bones are a fourth example of connective tissue. Bones are made up of different types of connective tissue, including bone tissue and marrow. Bone tissue is either spongy or compact depending on the organization of the cells and matrix."}, {"url": "http://study.com/academy/lesson/connective-tissue-types-functions-disorders.html", "passage_text": "Areolar and reticular tissue are types of loose connective tissue that provide support, as well as fill up unused spaces in the body. Blood, a fluid connective tissue, provides a transport system within our body for oxygen and other important substances. Bones are a fourth example of connective tissue. Bones are made up of different types of connective tissue, including bone tissue and marrow. Bone tissue is either spongy or compact depending on the organization of the cells and matrix."}, {"url": "http://www.wisegeekhealth.com/what-are-the-different-types-of-connective-tissue.htm", "passage_text": "Dense connective tissue, or collagen, has a much more closely woven matrix than loose connective tissue. The two varieties of this type are called regular and irregular. Tendons and ligaments are considered regular types, with the collagen fibers running parallel to each other to form the structure. Adipose tissue, more commonly known as fat, is a type of connective tissue. Muscles utilize numerous kinds of connective tissues. Human ears are made of cartilage. A large part of the dermis is made up of dense irregular connective tissue. Pregnant women tend to develop additional deposits of adipose tissue."}, {"url": "http://study.com/academy/lesson/connective-tissue.html", "passage_text": "In fact, many connective tissues are mostly composed of extracellular material. In the human body, extracellular matrix can be anything from bone, or cartilage, or blood plasma, or even a mix of extracellular proteins and fibers. Connective tissues are a diverse group of tissues that serve several different functions. "}, {"url": "http://www.wisegeekhealth.com/what-are-the-different-types-of-connective-tissue.htm", "passage_text": "Another of the types of connective tissue is blood. This fluid tissue is made up of a liquid plasma base which supports additional types of cells, including red and white blood cells. Blood is the main method by which nutrients, waste, and hormones are transported around the body. Adipose tissue, more commonly known as fat, is a type of connective tissue. Muscles utilize numerous kinds of connective tissues. Human ears are made of cartilage. A large part of the dermis is made up of dense irregular connective tissue. Pregnant women tend to develop additional deposits of adipose tissue."}, {"url": "https://en.wikipedia.org/wiki/Connective_tissue", "passage_text": "All connective tissue apart from blood and lymph consists of three main components: fibers (elastic and collagenous fibers), ground substance and cells. (Not all authorities include blood or lymph as connective tissue.) Blood and lymph lack the fiber component. All are immersed in the body water. Connective tissue (blue) is seen supporting the epithelium (purple). Connective tissue (CT) is one of the four types of biological tissue that support, connect, or separate different types of tissues and organs in the body. The other three types are epithelial, muscle, and nervous tissue. Connective tissue is found in between other tissues everywhere in the body, including the nervous system. In the central nervous system the outer membranes, the meninges, that cover the brain and spinal cord are composed of connective tissue"}]