[{"url": "http://www.ehow.com/facts_7244740_average-cost-tv-repair.html", "passage_text": "TV repair costs will vary by location and the type of repair shop you contract to do the repairs. The size and type of TV you have will also factor in, with TVs 42” and up triggering the first price bump. There may be additional charges for plasma or LCD or LED models, but this is unusual."}, {"url": "http://www.ehow.com/facts_7244740_average-cost-tv-repair.html", "passage_text": "Average Repair Costs. The Best Buy website has a list of repairs for flat screen TVs based on the national average as of June 2014: Panel - $1250; Main System Board - $350; Power Supply - $275; Control Board - $350; Cooling Fans - $335; Speakers $335, and Inputs - $335."}, {"url": "https://answers.yahoo.com/question/index?qid=20120910142247AAtmDtv", "passage_text": "Best Answer: You are not going to find a replacement screen for your tv. Manufacturer does not repair the screen even if it is under the factory warranty, they will just send you another tv. It would not be cost effective in repairing than just buying a new tv. Toshiba is not a very reliable tv."}, {"url": "http://answers.angieslist.com/how-repair-cracked-screen-flat-q37051.aspx", "passage_text": "In most cases it is cheaper to purchase a new television rather than repair the screen-unfortunaly some screens go for a price much higher than the iniital cost of ownership! Source: http://www.atlantarepairtv.com. Answered 1 year ago by lfender6445. Report It."}, {"url": "http://www.howmuchisit.org/tv-screen-replacement-cost/", "passage_text": "1 If the cost of a TV screen replacement or repair is at least 50% of the cost of a new television, it is sensible to buy a new TV instead. 2  Before deciding to go with a repair company, find out first if the TV screen can be replaced and the cost that goes with it."}, {"url": "http://www.answers.com/Q/How_much_would_it_cost_to_replace_a_cracked_lcd_screen", "passage_text": "Most laptop screens will cost between $80 and $150 and then to have it installed in anywhere between $100 and $200 dollars. One is looking at a total of between $180 and $400 … to have the laptop screen replaced."}, {"url": "http://www.howmuchisit.org/tv-screen-replacement-cost/", "passage_text": "Tips to know: 1  If the cost of a TV screen replacement or repair is at least 50% of the cost of a new television, it is sensible to buy a new TV instead. 2  Before deciding to go with a repair company, find out first if the TV screen can be replaced and the cost that goes with it."}, {"url": "http://www.howmuchisit.org/tv-screen-replacement-cost/", "passage_text": "1 Typically, the average repair is going to range anywhere from as little as $99 to as much as $400 to replace a TV screen. 2  Color TV monitors less than 28″ should cost less than $300, while a plasma TV can cost upwards of $500. 3  Stereo & Video Repair Company, for example, offers a range of TV services for different units."}]