[{"url": "http://allrecipes.com/recipe/235151/crispy-and-tender-baked-chicken-thighs/", "passage_text": "Ready In. 1  Preheat oven to 350 degrees F (175 degrees C). 2  Arrange chicken thighs on prepared baking sheet. 3  Combine garlic salt, onion salt, oregano, thyme, paprika, and pepper together in a small container with a lid. 4  Bake chicken in the preheated oven until skin is crispy, thighs are no longer pink at the bone, and the juices run clear, about 1 ..."}, {"url": "http://allrecipes.com/recipe/235151/crispy-and-tender-baked-chicken-thighs/", "passage_text": "1 Sprinkle spice mixture liberally over chicken thighs. 2  Bake chicken in the preheated oven until skin is crispy, thighs are no longer pink at the bone, and the juices run clear, about 1 hour. 3  An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C)."}, {"url": "http://thefrugalchef.com/2011/03/how-to-bake-chicken-thighs/", "passage_text": "Preheat your oven to 375 degrees. Place the chicken thighs in a pan. Season with salt, pepper and cumin. Add the cilantro, garlic and scallions. Drizzle with the juices. Place chicken into oven and bake for about 25 to 35 minutes – until completely cooked through (an inserted thermometer should read 170 degrees)."}, {"url": "http://www.marthastewart.com/340992/roasted-chicken-thighs", "passage_text": "Directions. In a bowl, toss chicken thighs with olive oil and lemon juice; season with salt and pepper and marinate 1 hour (or up to a day). Preheat oven to 375 degrees. Roast chicken, skin side down, in an oiled roasting pan, 20 to 25 minutes; flip and roast 10 more minutes. Watch: How to Gauge When Meat Is Cooked."}, {"url": "http://www.thekitchn.com/how-to-cook-boneless-skinless-chicken-thighs-in-the-oven-180140", "passage_text": "Just lay the chicken inside. Bake for 20 minutes or until the chicken has an internal temperature of 165°F. Boneless, skinless thighs cook quickly. Check after 20 minutes, and if they are not quite up to temperature, put back in the oven and continue cooking and checking the temperature in 5-minute increments."}, {"url": "http://allrecipes.com/recipe/235151/crispy-and-tender-baked-chicken-thighs/", "passage_text": "1 Bake chicken in the preheated oven until skin is crispy, thighs are no longer pink at the bone, and the juices run clear, about 1 hour. 2  An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C)."}]