[{"url": "http://www.ehow.com/facts_5858227_bovine-collagen_.html", "passage_text": "Not Straight From The Cow. Research into the use of bovine collagen began in the 1970s. Since then, beauty industry researchers developed a system of extracting the collagen from cow skin and purifying and sterilizing the substance before it is processed into a liquid form for distribution. Most Popular Uses. Bovine collagen therapy is generally used to fill in skin depressions resulting from scars, injury or the lines we all acquire in the aging process. Most often, bovine collagen is used for frown and worry lines as well as crow's feet and deep smile lines."}, {"url": "http://www.docshop.com/education/dermatology/injectables/collagen", "passage_text": "Collagen is a natural protein found in bone, cartilage, skin, and tendons; there are 27 different types of naturally occurring collagens in the body. Certain collagens found in skin tissue are essential for skin strength and elasticity. "}, {"url": "http://www.medicalnewstoday.com/articles/262881.php", "passage_text": "Knowledge center. Collagen is the most abundant protein in the human body and is the substance that holds the whole body together. It is found in the bones, muscles, skin and tendons, where it forms a scaffold to provide strength and structure.1,2"}, {"url": "http://www.medicalnewstoday.com/articles/262881.php", "passage_text": "1 Collagen is most commonly found within the body in the skin, bones and connective tissues. 2  The word collagen is derived from the Greek kolla, meaning glue. 3  Collagen gives the skin its strength and structure, and also plays a role in the replacement of dead skin cells. Collagen is the most abundant protein in the human body and is the substance that holds the whole body together."}, {"url": "http://www.wisegeek.com/what-is-bovine-collagen.htm", "passage_text": "Bovine collagen is a naturally occurring protein that is found in the skin, bones, and muscles of cows. This collagen is so similar to human collagen that many people in the beauty industry have embraced its use as a cost-effective way to treat wrinkles and fine lines. Collagen is a protein in the human body that makes hair shiny. While a collagen deficiency may cause premature aging of the skin, too much collagen may cause the skin to harden. Collagen injections can only be administered by a surgeon."}, {"url": "https://en.wikipedia.org/wiki/Collagen", "passage_text": "Collagen, in the form of elongated fibrils, is mostly found in fibrous tissues such as tendons, ligaments and skin. It is also abundant in corneas, cartilage, bones, blood vessels, the gut, intervertebral discs and the dentin in teeth. In muscle tissue, it serves as a major component of the endomysium. Collagen /ˈkɒlədʒɨn/ is the main structural protein in the extracellular space in the various connective tissues in animals. As the main component of connective tissue, it is the most abundant protein in mammals, making up from 25% to 35% of the whole-body protein content."}, {"url": "http://www.ehow.com/facts_5858227_bovine-collagen_.html", "passage_text": "As its name implies, bovine collagen comes from cows. More specificially, it is a naturally-occuring substance found in the skin, muscle, bones and tendons of cows. Most Popular Uses. Bovine collagen therapy is generally used to fill in skin depressions resulting from scars, injury or the lines we all acquire in the aging process. Most often, bovine collagen is used for frown and worry lines as well as crow's feet and deep smile lines."}, {"url": "http://www.livestrong.com/article/77943-hydrolyzed-collagen/", "passage_text": "Hydrolyzed collagen is collagen that is derived from bovine bone and cartilage. Usually, the bone is crushed, ground, defatted, soaked in acid to remove the calcium, soaked again to break the collagen bonds and then dehydrated. "}]