[{"url": "http://repairpal.com/estimator/engine-coolant-temperature-sensor-replacement-cost", "passage_text": "When replacing the engine coolant temperature sensor, always use a factory part, clean all the connections, and ensure that the entire cooling system is in good working order with fresh, clean coolant. An engine coolant temperature sensor code is not always caused by a defective sensor. It can be triggered by a defective thermostat, defective wiring, rusty coolant, or by a plugged or restricted radiator."}, {"url": "http://www.howmuchisit.org/coolant-temp-sensor-cost/", "passage_text": "1 At AutoPartsWarehouse.com, coolant temperature sensors cost less than $4 to $150 and up, depending on specifications. 2  When replacing a coolant temperature sensor through professional service, the cost is in the range of $110 to $165. When the sensor becomes faulty due to age, wiring faults, and loose or corroded connectors, cold driveability and emission problems arise, often resulting to replacement of the sensor. 1 "}, {"url": "http://www.howmuchisit.org/coolant-temp-sensor-cost/", "passage_text": "The coolant temperature sensor, or also known as engine coolant temperature sensor, is a device in an internal combustion engine that monitors the temperature of the engine coolant. Often called the master sensor, the coolant temperature sensor affects the operation of the overall engine management system. When the sensor becomes faulty due to age, wiring faults, and loose or corroded connectors, cold driveability and emission problems arise, often resulting to replacement of the sensor. 1  At AutoPartsWarehouse.com, coolant temperature sensors cost less than $4 to $150 and up, depending on specifications."}, {"url": "http://repairpal.com/estimator/engine-coolant-temperature-sensor-replacement-cost", "passage_text": "Parts: $31 - $55. The average cost for an engine coolant temperature sensor replacement is between $119 to $168. Labor costs are estimated between $88 to $113 while parts are priced between $31 to $55. Get a personalized estimate based on your location and specific car. Estimate does not include taxes and fees. An engine coolant temperature sensor code is not always caused by a defective sensor. It can be triggered by a defective thermostat, defective wiring, rusty coolant, or by a plugged or restricted radiator."}, {"url": "https://answers.yahoo.com/question/index?qid=20070920143840AAgKOl4", "passage_text": "How much would it cost to fix the engine coolant temperature sensor on a 2001 ford explorer? I recently took my explorer (2001 xlt, 4door) in for a smog test and I failed the test. Answers. Best Answer: If you have the 4.0. it has a plastic thermostat housing and if you get it out, there's a good chance the threads will come with it. You may have to replace the whole thing, your looking at $300-$400 dollars at the dealer.."}, {"url": "http://www.howmuchisit.org/coolant-temp-sensor-cost/", "passage_text": "1 If you prefer to have a professional mechanic or technician replace the coolant temperature sensor, ask auto repair shops in your area to find the most reasonable and affordable rates. 2  Also, ask your family and friends for recommendations. 3  Try doing the job on your own. 4  Replacing this part is said to be an easy job. When the sensor becomes faulty due to age, wiring faults, and loose or corroded connectors, cold driveability and emission problems arise, often resulting to replacement of the sensor. 1  At AutoPartsWarehouse.com, coolant temperature sensors cost less than $4 to $150 and up, depending on specifications."}, {"url": "http://www.audiworld.com/tech/eng47.shtml", "passage_text": "Before then, it was a myth that the coolant temp sensor is a PITA to replace yourself and you should let the dealer charge you $200+ to do it. All it will cost you is $25 for parts and about 3-5 mins of your time. Okay, so here's how to do it. Locate the sensor first. "}]