[{"url": "http://legal-dictionary.thefreedictionary.com/Battery", "passage_text": "Battery is concerned with the right to have one's body left alone by others. Battery is both a tort and a crime. Its essential element, harmful or offensive contact, is the same in both areas of the law. The main distinction between the two categories lies in the penalty imposed. A defendant sued for a tort is civilly liable to the plaintiff for damages. n. the actual intentional striking of someone, with intent to harm, or in a rude and insolent manner even if the injury is slight. Negligent or careless unintentional contact is not battery no matter how great the harm. Battery is a crime and also the basis for a lawsuit as a civil wrong if there is damage."}, {"url": "http://criminal.laws.com/battery", "passage_text": "Battery is a criminal offense which involves unlawful physical contact. Based on the United States legal system, criminal battery, or simply battery, is the use of force against another individual which directly results in offensive or harmful contact. At the common law level, battery is regarded as a misdemeanor. In these instances, the prosecutor must prove three distinct elements beyond a reasonable doubt to successfully convict the alleged perpetrator. As stated earlier, battery may take on two separate forms: misdemeanor battery and felony battery"}, {"url": "http://www.computerhope.com/jargon/b/battery.htm", "passage_text": "You are here: Dictionary B-Definitions. A battery is a hardware component that supplies power to a device, enabling that device to work without a power cord."}, {"url": "http://inventors.about.com/od/bstartinventions/ss/How-A-Battery-Works.htm", "passage_text": "Definition of a Battery. Photo Credit: ose Luis Pelaez/ The Image Bank/ Getty Images. A battery, which is actually an electric cell, is a device that produces electricity from a chemical reaction. Strictly speaking, a battery consists of two or more cells connected in series or parallel, but the term is generally used for a single cell. A cell consists of a negative electrode; an electrolyte, which conducts ions; a separator, also an ion conductor; and a positive electrode."}, {"url": "http://www.merriam-webster.com/dictionary/battery", "passage_text": "Full Definition of BATTERY. 1. a: the act of battering or beating b: an offensive touching or use of force on a person without the person's consent — compare assault 2a. 2. [Middle French batterie, from battre to beat] a: a grouping of artillery pieces for tactical purposes b: the guns of a warship. "}, {"url": "http://www.computerhope.com/jargon/b/battery.htm", "passage_text": "Battery. A battery is a hardware component that supplies power to a device, enabling that device to work without a power cord. Batteries are often capable of powering a laptop computer for several hours depending on how much power it requires"}, {"url": "http://www.husseinandwebber.com/crimes/violent-crimes/simple-battery/", "passage_text": "The crime of Simple Battery or Misdemeanor Battery is defined under Section 784.03, Florida Statutes. In Florida, the term battery means: 1  Any actual and intentional touching or striking of another person against that person’s will (non-consensual), or. 2  The intentional causing of bodily harm to another person. Under Florida law, Simple Battery (Misdemeanor Battery) is a first degree misdemeanor, with penalties of up to one year in jail or 12 months probation, and a $1,000 fine. Battery is a highly defendable charge, and an attorney is critical to avoiding the harsh consequences of a conviction."}, {"url": "https://en.wikipedia.org/wiki/Battery_(crime)", "passage_text": "Battery was defined at common law as any unlawful touching of the person of another by the aggressor himself, or by a substance put in motion by him.. In most cases, battery is now governed by statutes, and its severity is determined by the law of the specific jurisdiction."}, {"url": "https://en.wikipedia.org/wiki/Battery_(crime)", "passage_text": "Battery is a criminal offense involving unlawful physical contact, distinct from assault which is the act of creating apprehension of such contact. In the United States, criminal battery, or simply battery, is the use of force against another, resulting in harmful, offensive or sexual contact. In most cases, battery is now governed by statutes, and its severity is determined by the law of the specific jurisdiction."}]