[{"url": "http://www.merriam-webster.com/dictionary/budget", "passage_text": ": an amount of money available for spending that is based on a plan for how it will be spent. : a plan used to decide the amount of money that can be spent and how it will be spent. : an official statement from a government about how much it plans to spend during a particular period of time and how it will pay for the expenses."}, {"url": "http://smallbusiness.chron.com/difference-between-strategic-plan-budget-22969.html", "passage_text": "A business needs to have both a strategic plan and a budget. The strategic plan lays out the direction and goals of the business and guidelines for actions to achieve those goals, while the budget looks at the money needed to support achieving those goals. Budgeting is only one part of the strategic planning process. Many approaches to strategic planning are available. One approach is to start with a strategic analysis of where the organization is now, including its strengths and weaknesses and the economic, social, political and technical environment in which the business operates."}, {"url": "http://www.mymoneycoach.ca/budgeting/what-is-a-budget-planning-forecasting", "passage_text": "Expense Tracker. Budgeting Video Series. Once you create your first budget, begin to use it and get a good feel for how it can keep your finances on track, you may want to map out your spending plan or budget for 6 months to a year down the road."}, {"url": "https://en.wikipedia.org/wiki/Budget", "passage_text": "A budget (derived from old French word bougette, purse) is a quantified financial plan for a forthcoming accounting period. The budget of a government is a summary or plan of the intended revenues and expenditures of that government. There are three types of government budget: the operating or current budget, the capital or investment budget, and the cash or cash flow budget."}, {"url": "http://www.whitehouse.gov/omb/budget", "passage_text": "The President's 2016 Budget is designed to bring middle class economics into the 21st Century. This Budget shows what we can do if we invest in America's future and commit to an economy that rewards hard work, generates rising incomes, and allows everyone to share in the prosperity of a growing America. "}, {"url": "http://www.mymoneycoach.ca/budgeting/what-is-a-budget-planning-forecasting", "passage_text": "Budgeting is the process of creating a plan to spend your money. This spending plan is called a budget. Creating this spending plan allows you to determine in advance whether you will have enough money to do the things you need to do or would like to do. Budgeting is simply balancing your expenses with your income. If they don't balance and you spend more than you make, you will have a problem. Budgeting Video Series. Once you create your first budget, begin to use it and get a good feel for how it can keep your finances on track, you may want to map out your spending plan or budget for 6 months to a year down the road."}, {"url": "http://www.ehow.com/info_7969843_definition-strategic-budget.html", "passage_text": "The concept behind strategic budgeting is that spending is purposeful, and that's why tying spending to a strategic plan's objectives makes sense. If an organization revises its long-term plan, it can adjust its budget document for the next year accordingly. Performance Monitoring. Another advantage of the strategic budget comes later, in the implementation phase of the budget. Called budgetary control or performance monitoring, this is the phase in which the organization considers how each program area spends compared with its budget allocation."}, {"url": "http://personalfinance.duke.edu/manage-your-finances/budget/overview", "passage_text": "When you actually see the breakdown of your expenses, you may be surprised by what you find; this process is essential to fully grasping how things can add up. Creating a budget will decrease your stress levels because, with a budget, there are no surprises. "}, {"url": "https://en.wikipedia.org/wiki/Budget", "passage_text": "A budget is a quantitative expression of a plan for a defined period of time. It may include planned sales volumes and revenues, resource quantities, costs and expenses, assets, liabilities and cash flows. It expresses strategic plans of business units, organizations, activities or events in measurable terms. The budget of a government is a summary or plan of the intended revenues and expenditures of that government. There are three types of government budget: the operating or current budget, the capital or investment budget, and the cash or cash flow budget."}, {"url": "http://moneyfor20s.about.com/od/budgeting/", "passage_text": "Budgeting is essential to managing your money. Learn key strategies and systems to truly take control of your money. You can find everything from basic budgeting to tips to make your budget work most effectively for you."}]