[{"url": "http://www.xilinx.com/support/answers/8393.html", "passage_text": "BSC is short for BASIC. It is a numerical value used to describe the theoretical exact size, shape or location of a feature or datum target. It is the basis on which permissible variations are established by tolerances on other dimensions, in notes, or by feature control symbols. "}, {"url": "https://en.wikipedia.org/wiki/Bachelor_of_Science", "passage_text": "Whether a student of a particular subject is awarded a Bachelor of Science degree or a Bachelor of Arts degree can vary between universities. For example, an economics degree may be given as a Bachelor of Arts (B.A.) by one university but as a B.Sc. by another, and some universities offer the choice of either. The first university to admit a student to the degree of Bachelor of Science was the University of London in 1860."}, {"url": "https://en.wikipedia.org/wiki/Honours_degree", "passage_text": "In Canada it is abbreviated either BA hon. or BSc hon.. Very rarely is the term used for the master's degree; for example, the four-year undergraduate degree at Ancient Scottish universities is abbreviated MA (Hons). Many universities and colleges offer both honours and non-honours bachelor's degree variation. "}, {"url": "http://electronics.stackexchange.com/questions/37643/what-does-bsc-sq-mean", "passage_text": "BSC means Basic Spacing Between Centers. This is often used if the reference lines don't refer to a physical point or edge, like in the case of the pins: the reference is in the middle of the pin, instead of one of the edges. Thus 7.00 BSC is equivalent to 7mm, with the spacing measured between centers (not really the centers of anything in the specific example of one side being 7mm between centers). share | improve this answer."}, {"url": "http://www.definitions.net/definition/bachelor%20of%20science", "passage_text": "A Bachelor of Science is an undergraduate academic degree awarded for completed courses that generally last three to five years. Whether a subject is considered a science or an art, can vary between universities. "}, {"url": "http://electronics.stackexchange.com/questions/37643/what-does-bsc-sq-mean", "passage_text": "BSC SQ = BSC square, i.e. in both X and Y dimensions. The abbreviation BSC is misused in the case of the package outline, and overall dimensions, as they are specified by physical edges which can be measured. Thus 7.00 BSC is equivalent to 7mm, with the spacing measured between centers (not really the centers of anything in the specific example of one side being 7mm between centers). share | improve this answer."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20061127051543AAcfZva", "passage_text": "Report Abuse. Nobody will win your debate, because what (Hons) means has varied not only from country to country, but from time to time. In Scotland around 1960, an Ordinary or General degree (MA or BSc) took three years and a combination of five or more subjects. Two subjects had to be studied for two years, and the rest for one. An Honours degree took four years, and four subjects. Hi, not sure what country you are based in, but if you're part of the EU, then BSC (Hons) is part of a 10-tier referencing system that all learning institutions in the EU adher to. The (Hons) part is in no way related to your grade. You can still earn an honours Hons degree, or simpley a pas"}, {"url": "https://en.wikipedia.org/wiki/Bachelor_of_Science", "passage_text": "B.S. redirects here. For other uses of BS, see BS. A Bachelor of Science (B.S. , BS, B.Sc. , BSc or Bc. ; less commonly, S.B. , SB, or Sc.B. from the Latin Scientiae Scientiæ) baccalaureus or A Science degree is an undergraduate academic degree awarded for completed courses that generally last three to five. years The first university to admit a student to the degree of Bachelor of Science was the University of London in 1860."}, {"url": "http://www.medstudent.org/threads/bsc-hons-what-does-that-hons-mean.26120/", "passage_text": "Ordinary. Honours (Hons). An ordinary degree means you pass or you don't. You don't fail a degree, you just don't get it if you don't pass. They'll be a pass mark (say 40%) if you get above it you go the degree... the BA for example. There is no high pass, mid pass or low pass, no A*, A, B, C etc. You pass or you don't get it."}]