[{"url": "http://www.biography.com/people/milton-hershey-9337133", "passage_text": "Synopsis. Milton Hershey was born on September 13, 1857, in Derry Township, Pennsylvania, although some sources say he was born in Derry Church, Pennsylvania. Following an incomplete rural school education, Hershey was apprenticed at age 15. Early Years. Entrepreneur Milton Snavely Hershey was born on September 13, 1857, in Derry Township, Pennsylvania. He was the only surviving child of Veronica Fanny Snavely and Henry Hershey."}, {"url": "http://www.hersheyhistory.org/library-archives/hershey/54-milton-snavely-hershey", "passage_text": "by Millie Landis Coyle. Milton Snavely Hershey was born on September 13, 1857 to Fannie Snavely and Henry Hershey. He was born on the Hershey family homestead which was built in 1826 in Derry Church, Pennsylvania by his grandparents, Isaac and Anna Hershey. Milton's only sibling, Serina, was born in 1862. His mother, Fanny Snavely, was the daughter of Bishop Abraham Snavely, a highly respected figure of the Reformed Mennonite Church and considered well-to-do. Fanny Hershey raised Milton in the tradition of her strict Mennonite faith."}, {"url": "http://www.ducksters.com/biography/entrepreneurs/milton_hershey.php", "passage_text": "Milton Snavely Hershey was born on September 13, 1857 in the small town of Derry, Pennsylvania. He only had one sibling, a sister named Serina who sadly died from Scarlet fever when Milton was nine years old. "}, {"url": "https://en.wikipedia.org/wiki/Milton_S._Hershey", "passage_text": "Milton Snavely Hershey (September 13, 1857 – October 13, 1945) was an American confectioner, philanthropist, and founder of The Hershey Chocolate Company and the  company town  of Hershey, Pennsylvania. Milton S. Hershey was born on September 13, 1857 to Henry and Veronica Fanny Snavely Hershey. His family were members of Pennsylvania's Mennonite community. His ancestors were Swiss and German and had settled in Pennsylvania in the early 1700s. He grew up speaking Pennsylvania Dutch."}, {"url": "http://www.answers.com/Q/Where_was_Milton_Hershey_born", "passage_text": "Milton S. Hershey was born in Derry Township, Pennsylvania, United States. 80 million hershey kisses are made each day. Facts about Milton Hershey include that he was born on September  13, 1857. Before he founded the Hershey Company he started the …  Lancaster Caramel Company. He is 88 years old."}, {"url": "http://www.answers.com/Q/When_was_Milton_Hershey_born", "passage_text": "Making the world better, one answer at a time. Milton S. Hershey was born September 13, 1857 in Derry Church, Pennsylvania which later became Hershey, Pennsylvania. He died October 13, 1945 in Hershey, Pennsylvania. Facts about Milton Hershey include that he was born on September  13, 1857. Before he founded the Hershey Company he started the …  Lancaster Caramel Company. He is 88 years old."}, {"url": "http://www.answers.com/Q/Where_was_Milton_Hershey_born", "passage_text": "Milton S. Hershey was born September 13, 1857 in Derry Church, Pennsylvania which later became Hershey, Pennsylvania. He died October 13, 1945 in Hershey, Pennsylvania. 80 million hershey kisses are made each day. Facts about Milton Hershey include that he was born on September  13, 1857. Before he founded the Hershey Company he started the …  Lancaster Caramel Company. He is 88 years old."}, {"url": "http://www.hersheypa.com/about_hershey/our_proud_history/about_milton_hershey.php", "passage_text": "Life of Milton S. Hershey. Born September 13, 1857 on a farm near Derry Church, a small Pennsylvania community, Milton Hershey was the only surviving child of Fannie and Henry Hershey. His mother raised him in the strict discipline of the Mennonite faith. Frequent family moves interrupted his schooling and left him with a limited education. Since his death in 1945 at age 88, Milton Hershey's legacy has thrived with a constantly changing world. Today, Milton Hershey School, the institution he and his wife founded, nurtures more than 2,000 financially needy boys and girls in grades K-12."}]