[{"url": "http://www.answers.com/Q/How_much_does_a_granite_countertop_weigh", "passage_text": "Most granite countertops are close to 1-3/16 in thickness, however, raising the total weight per lineal foot to roughly 33.25 pounds. A 3/4 thick slab would weigh roughly 21 pounds per lineal foot. At a rough average density for granite of 2.7 g/cm 3 the weight of a 1 thick slab of granite countertop with a front to back depth of two feet would be 28"}, {"url": "http://www.concretenetwork.com/concrete/countertops/thickness_and_weight_of_countertops.htm", "passage_text": "Weight A 1 ½ inch thick countertop made of standard concrete has an approximate weight of 18.75 pounds per square foot. (Granite is approximately 18 pounds per square foot.) Standard cabinetry will typically support this weight because it’s distributed over a large area. "}, {"url": "http://www.kompareit.com/homeandgarden/countertops-granite-vs-corian.html", "passage_text": "Granite countertops usually cost about $50 to $100 per square foot, including installation. If you have 30 square feet of counter space-which is fairly standard-the total cost would be $1,500 to $3,000. "}, {"url": "https://blog.udemy.com/quartz-vs-granite-countertops/", "passage_text": "Quartz has historically been more expensive than granite, but times have changed, technology has improved and now the discussion is not so cut-and-dry. Quartz generally runs from about $65-$100 per square foot installed. So your average quartz countertop of, say, 40 square feet will run from $2,600-$4,000. "}, {"url": "http://www.ehow.com/facts_5858366_quartz-vs_-granite-countertop-weight.html", "passage_text": "Weight. Thickness of a quartz or granite countertop is the biggest contributor to its overall weight. A 3/4-inch slab of granite weighs around 12 to 13 lbs. per square foot. 1 1/4-inch granite slabs weigh around 18 to 19 lbs. per square foot. Depending on thickness, quartz countertops can weigh up to 30 lbs. per square foo"}, {"url": "http://www.granitecountertopscostguide.com/", "passage_text": "Average Cost and What Should Be Included. Granite tiles typically cost around $4 to $19 per square foot or $120 to $570 for 30 square feet of counter space. DIY kits that contain the tiles and backsplashes necessary are available for around $100-200 for each section (eg. 24 inch wide corner piece). There are a number of factors and options that can affect the final price of a countertop installation. The stone itself can cost anywhere from as low as $30 to over $100 per square foot. First of all, it depends on the color, pattern and rarity of the granite you choose."}, {"url": "http://www.hgtv.com/remodel/kitchen-remodel/granite-countertop-prices", "passage_text": "The cost of a granite countertop will, of course, depend on the size of your surface area. However, the average granite countertop will cost approximately $50 to $100 per square foot. In addition to the size, the cost will also depend on how thick you want the slab to be. "}, {"url": "http://www.marble-granites.com/resource-center/stone-selection/granite-countertops.aspx", "passage_text": "ANSWER: The weight of granite depends on its density. The average 3/4 thick granite weighs 13 pounds per square foot, 1 1/4 thick granite weighs around 18 to 20 pounds per square foot, and 2 thick granite weighs about 30 pounds per square foot. The darker stones are usually heavier than the lighter stones. QUESTION: How thick is a granite countertop?"}, {"url": "http://www.concrete-countertops.org/weight.html", "passage_text": "Concrete Countertop Weight. The weight of a concrete countertop has a lot of bearing on how it is built and how it will be installed. A standard 1.5” thick concrete countertop has an approximate weight of 18.75 pounds per square foot. In comparison, granite is approximately 18 pounds per square foot. Lightweight countertop mixes are available to help reduce the restrictions found in design and installation with heavy countertops. "}]