[{"url": "http://www.chop.edu/treatments/cholecystostomy", "passage_text": "The gallbladder is a small sac-like structure under the liver. It stores bile that is secreted into the intestines to help digest fats. The gallbladder can become obstructed or infected. Treatment usually includes antibiotics and, if necessary, surgical removal. However, sometimes surgery is not an option because the patient is too sick or for other reasons. The procedure is considered low risk. However, potential complications include: 1  bleeding. 2  infection. 3  injury to the gallbladder. 4  bile leak (biloma). 5  puncture of the lung (very rare). 6  allergic reaction to X-ray dye (contrast reaction). 7  right shoulder pain (radiating from the liver)."}, {"url": "http://study.com/academy/lesson/the-gallbladder-liver-function-role-in-digestion.html", "passage_text": "It is defined as a small sac-shaped organ that stores and concentrates bile. Your gallbladder lies beneath your liver. When there is no food in the small intestine, bile-that was initially made by the liver-backs up into the gallbladder to be stored. Bile is produced by the liver and stored in the gallbladder. In this lesson, you will learn about bile and its role in the breakdown of dietary fats. You will also learn how the hormones secretin and cholecystokinin help regulate these organs."}, {"url": "https://www.advancedsurgeryofidaho.com/gallbladder", "passage_text": "The gallbladder is a small sac like structure attached to the under surface of the liver, located in the right upper quadrant of the abdomen. When bile mixes with food, it emulsifies fats and certain vitamins such as A, D, E, and K aiding in absorption. If the gallbladder has concentrated the bile too much, stones can form. This is a condition called cholelithiasis. Most gallstones are asymptomatic, but about ten percent of people will develop symptoms."}, {"url": "https://www.advancedsurgeryofidaho.com/gallbladder", "passage_text": "About the Gallbladder. The gallbladder is a small sac like structure attached to the under surface of the liver, located in the right upper quadrant of the abdomen. The purpose of the gallbladder is to store and concentrate bile. When bile mixes with food, it emulsifies fats and certain vitamins such as A, D, E, and K aiding in absorption. If the gallbladder has concentrated the bile too much, stones can form. This is a condition called cholelithiasis. Most gallstones are asymptomatic, but about ten percent of people will develop symptoms."}, {"url": "http://study.com/academy/lesson/the-gallbladder-liver-function-role-in-digestion.html", "passage_text": "Bile enters the duodenum when dietary fats are present. If any bile remains after the fat has been digested, it is taken back up by the gallbladder. The gallbladder is a small sac-shaped organ that stores and concentrates bile. The common bile duct is a common duct that carries bile from the liver and the gallbladder to the duodenum. If this duct is blocked, it can cause the yellowish-colored bile to back up and enter the bloodstream. This can lead to a yellowing of the skin and the whites of the eyes, known as jaundice. Bile is produced by the liver and stored in the gallbladder. In this lesson, you will learn about bile and its role in the breakdown of dietary fats. You will also learn how the hormones secretin and cholecystokinin help regulate these organs."}, {"url": "https://www.advancedsurgeryofidaho.com/gallbladder", "passage_text": "Bile is a green liquid made by the liver composed of water, cholesterol, salts and lecithin. Bile assists in the breakdown and absorption of fats from food. When you eat, especially when you eat fatty foods, the gallbladder is stimulated to contract and empty its contents into the intestine. When bile mixes with food, it emulsifies fats and certain vitamins such as A, D, E, and K aiding in absorption. If the gallbladder has concentrated the bile too much, stones can form. This is a condition called cholelithiasis. Most gallstones are asymptomatic, but about ten percent of people will develop symptoms."}, {"url": "http://www.e-missions.net/cybersurgeons/?/dig_teacher/", "passage_text": "It stores bile produced by the liver until it is secreted directly into the first section of the small intestine. Pancreas. The pancreas has three important functions that help the digestive system change food into a form that can be used by the cells. "}, {"url": "http://www.answers.com/Q/Which_organ_stores_bile", "passage_text": "The gallbladder releases bile into the duodenum, part of the small intestine, to aid in the digestion of fats. Bile emulsifies the fats, or breaks them into smaller particles, to assist in their digestion. If the bile salts crystallize, you get gallstones. The gallbladder will release bile only under the influence of cholecystokinin."}, {"url": "https://quizlet.com/30152987/mt-11-flash-cards/", "passage_text": "pyloric sphincter; The pyloric sphincter is a ring of muscle that controls the passage of food from the lower part of the stomach, called the pylorus, into the duodenum. Food is allowed to pass into the small intestine only when it is chemically ready and only in small amounts at one time. The word part that completes the medical term meaning condition of stones in the common bile duct, _______/o/lith/iasis, is: choledoch; The condition (-iasis) of stones (lith/) in the common bile duct (choledoch/o) is called choledocholithiasis."}, {"url": "http://www.answers.com/Q/Which_organ_stores_bile", "passage_text": "The gallbladder is the sac-like structure under the liver that stores about 30-50 ml of bile. The liver produces bile, and the gallbladder stores it. From there it is excreted, travels down the bile duct, where it passes through the pancreas, which produces lipase (which does break down fat), before it goes into your small intestine. Bile emulsifies the fats, or breaks them into smaller particles, to assist in their digestion. If the bile salts crystallize, you get gallstones. The gallbladder will release bile only under the influence of cholecystokinin."}]