[{"url": "http://abcnews.go.com/Technology/wet-phone-dry-phone-waterproof/story?id=16699380", "passage_text": "The next step might seem a bit crazy, but get a bowl and fill it up with rice. Yep, regular rice from the supermarket. Bury your phone in the bowl and keep it in there for 12 to 24 hours. Rice absorbs moisture and has long been used as a wet-gadget-saving measure. Open the bag, drop your phone in for 24 hours, and the phone might just come out working again. The bag did work with an old BlackBerry, but we didn't have an extra iPhone for a test. According to the company, the bag soaks up water 700 percent better than rice."}, {"url": "http://www.ehow.com/how_5043830_dry-cell-phone-out-rice.html", "passage_text": "Don't dump your phone in rice as soon as you get it wet. If your phone is on, turn it off immediately. Do not try to turn it on, no matter how badly you want to, as this might fry internal components. If you use a case, take it off. Remove any power cords, earphones or other attachments. Using rice to soak up moisture is not a quick process and there is no fixed time for how long you should leave your phone to dry out. Wait at least 24 hours -- longer if you can stand it."}, {"url": "http://www.wikihow.com/Save-a-Wet-Cell-Phone", "passage_text": "1 SIM cards survive water damage well, but getting it out immediately makes good sense. 2  Pat it dry and set it aside to dry out until you reconnect your phone to your cell network again. ( 3 If your phone does not have a SIM card, skip this step). 1 Try removing all the cell phone parts, and then put into dry rice. 2  It is possible to purchase commercial wet cell phone emergency kits. 3  It's probably best to buy one just in case as you can waste valuable time going to the store to buy one."}, {"url": "http://www.wired.com/2014/02/thats-deal-wet-phone", "passage_text": "Many folks swear by stuffing your phone in a bag of dry rice, and letting it sit for 24 to 36 hours or more. This is cheap, easy, and can be done in a pinch. But this method could have some negatives: If the rice absorbs the water well, you may be left with a mushy rice mess stuck in its creases and I/O ports. "}, {"url": "http://www.wikihow.com/Save-a-Wet-Cell-Phone", "passage_text": "1 Get rid of battery and put in bag of rice for 24 hours. 2  If your phone has been subjected to salt water crystallizing, gently tap the board and the chips with a plastic object (the back of a small screwdriver for example). 3  The vibration of the taps will set some of the foreign objects free and they will fall out. 1 Try removing all the cell phone parts, and then put into dry rice. 2  It is possible to purchase commercial wet cell phone emergency kits. 3  It's probably best to buy one just in case as you can waste valuable time going to the store to buy one."}, {"url": "http://www.ehow.com/how_5043830_dry-cell-phone-out-rice.html", "passage_text": "Next comes the hard part -- waiting. Using rice to soak up moisture is not a quick process and there is no fixed time for how long you should leave your phone to dry out. Wait at least 24 hours -- longer if you can stand it. Your cell may show intermittent signs of life after a few hours if you couldn't turn it off"}, {"url": "https://answers.yahoo.com/question/index?qid=20090719153049AAOzRaJ", "passage_text": "Report Abuse. Dont give up lol, I put my phone in rice for 3 days and it didnt turn on and I put it back in the rice and just left it there. So I got a new phone since I thought it was just gone. I forgot that I left my damaged phone for about 2 weeks in rice and curiously started messing with it and it turned on!!"}, {"url": "http://www.answers.com/Q/How_long_do_you_keep_a_wet_phone_in_rice_to_fix_it", "passage_text": "the rice dries up all of the water that soaked your phone. Just let it sit in a ziplock bag for 48-72 hours and it should work You need to try Silica Gel Packets to dry out … your phone. There are many web-sites with good articles that explain how to dry a wet cell phone, iPods, or any electronics. You need to place your cell phone in a zip lock bag with Silica Gel Packets."}, {"url": "http://www.answers.com/Q/How_long_do_you_keep_a_cell_phone_in_rice", "passage_text": "Share to: Usually, you should keep a cell phone for around three to four years. Some of the new, high-tech cell phones do not last as long as the older ones. Depending on how old your c … ell phone is, you should either keep it for 2-4 years (newer ones) or 3-5 years (older ones). "}]