[{"url": "http://www.aboutkidshealth.ca/En/HealthAZ/Drugs/Pages/Cyclosporine.aspx", "passage_text": "Cyclosporine is a medicine called an immunosuppressant. An immunosuppressant lowers the body's natural immunity. It is used to prevent rejection of transplanted organs, such as the kidney, heart, and liver. 1 Do not give grapefruit or grapefruit juice while your child is taking cyclosporine. 2  If needed, you may mix cyclosporine in a glass container (not plastic or paper) with a drink recommended by your doctor or pharmacist. 3  Use the same drink each time. 4  Stir well and have your child drink it right away."}, {"url": "https://www.psoriasis.org/about-psoriasis/treatments/systemics/cyclosporine", "passage_text": "Cyclosporine is an immunosuppressive drug that was first used to help prevent rejection in organ transplant patients. In 1997, the Food and Drug Administration (FDA) approved Neoral for adults with severe psoriasis and otherwise normal immune systems. Cyclosporine can provide rapid relief from symptoms. You may see some improvement in symptoms after two weeks of treatment, particularly with stronger doses. However, it may take from three to four months to reach optimal control. Extended use of cyclosporine by transplant patients is well-established."}, {"url": "http://www.medicinenet.com/cyclosporine-oral_capsule/article.htm", "passage_text": "WARNING: Cyclosporine is a drug that reduces the body's ability to fight illness/disease (an immunosuppressant), leaving patients vulnerable to infection or other problems (including cancers such as lymphoma). Using other drugs that treat organ transplant rejection along with this drug may increase these tendencies. "}, {"url": "http://www.aboutkidshealth.ca/En/HealthAZ/Drugs/Pages/Cyclosporine.aspx", "passage_text": "Your child needs to take the medicine called cyclosporine (say: SYE-kloe-spor-een). This information sheet explains what cyclosporine does, how to give it, and what side effects or problems your child may have when he or she takes this medicine. 1 Do not give grapefruit or grapefruit juice while your child is taking cyclosporine. 2  If needed, you may mix cyclosporine in a glass container (not plastic or paper) with a drink recommended by your doctor or pharmacist. 3  Use the same drink each time. 4  Stir well and have your child drink it right away."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMHT0009777/?report=details", "passage_text": "Cyclosporine is used together with other medicines to prevent the body from rejecting a transplanted organ (eg, kidney, liver, or heart). It belongs to a group of medicines known as immunosuppressive agents. Cyclosporine is also used to treat severe rheumatoid arthritis in patients who have failed treatment with methotrexate. This medicine is also used to treat adults with severe plaque psoriasis after other treatments (eg, PUVA, retinoids, methotrexate) failed. Cyclosporine is a very strong medicine. It can cause side effects that can be very serious, such as kidney problems. It may also decrease the body's ability to fight infections. You and your doctor should talk about the benefits of this medicine as well as the risks of using it"}, {"url": "http://www.petmd.com/pet-medication/cyclosporine-atopica", "passage_text": "Precautions. Cyclosporine is contraindicated for use in dogs with a history of neoplasia. Cyclosporine (Atopica) is a potent systemic immunosuppressant that may cause the susceptibility to infection and the development of neoplasia. Gastrointestinal problems and gingival hyperplasia may occur at the initial recommended dose. "}, {"url": "https://labtestsonline.org/understanding/analytes/cyclosporine/tab/test", "passage_text": "Tests for cyclosporine are used to measure the amount of this drug in the blood to determine whether cyclosporine concentrations have reached therapeutic levels and are not in a toxic range. Cyclosporine is a drug that diminishes the body's immune response. In addition, cyclosporine blood levels can be affected by other medications a person may be taking. It is important for health practitioners to be are aware of what medications and supplements their patients are taking and to be notified of changes in diet or health status that may affect cyclosporine concentrations."}, {"url": "http://www.mayoclinic.org/drugs-supplements/cyclosporine-intravenous-route/description/DRG-20067296", "passage_text": "Cyclosporine works by suppressing the immune system to prevent the white blood cells from trying to get rid of the transplanted organ. Cyclosporine is a very strong medicine. It can cause side effects that can be very serious, such as high blood pressure, kidney problems, or liver problems. It may also decrease the body's ability to fight infections. You and your doctor should talk about the benefits this medicine will do as well as the risks of using it. Cyclosporine injection is given together with a steroid medicine to prevent the body from rejecting a transplanted organ (e.g., kidney, liver, or heart). It belongs to a group of medicines known as immunosuppressive agents."}, {"url": "https://en.wikipedia.org/wiki/Ciclosporin", "passage_text": "For other types of cyclosporin, see Cyclosporins. Ciclosporin (INN / BAN) (pronounced /ˌsaɪkləˈspɔrɪn/); cyclosporine (USAN); cyclosporin (former BAN); or ciclosporin A, cyclosporine A, or cyclosporin A (often shortened to CsA) is an immunosuppressant drug widely used in organ transplantation to prevent rejection. "}]