[{"url": "http://www.lowes.com/projects/lawn-and-garden/fertilize-your-lawn/project", "passage_text": "Do a Soil Test. Determine the pH of your soil. The pH level is a measure of the alkalinity or acidity of a substance. The pH of your soil is important because it determines the ability of the grass to use the ingredients in the fertilizer. Your soil test will determine which fertilizer is best for you."}, {"url": "http://www.scotts.com/smg/goART3/Howto/when-to-feed-lawn/33500008", "passage_text": "When to Feed Your Lawn. The most important thing you can do for your lawn is to feed it. A well-fed lawn is healthier, which means it has a better root system to combat heat, cold, drought, mowing, foot traffic and other stresses."}, {"url": "http://www.homedepot.com/c/what_is_best_lawn_fertilizer_for_garden_HT_BG_OD", "passage_text": "Avoid using weed and feed if you plan to reseed your lawn in the same season. As a general rule, you can apply weed and feed in the spring and overseed in the fall and be safe. Summer is hard on lawns. The heat, drought, insects and increased traffic can really take their toll on your lawn during the summer months."}, {"url": "http://www.sunnyfortuna.com/gardening/lawn/grass-feeding.htm", "passage_text": "When, What and How To Feed The best time to fertilize lawns in the North is autumn; additional feeding can be done in spring and early summer. In the South, feed regularly, beginning in spring and continuing through autumn. The best fertilizers for lawns are complete ones with lots of nitrogen in them."}, {"url": "http://www.dummies.com/how-to/content/when-to-fertilize-your-lawn.html", "passage_text": "If you’re not up for the higher-maintenance lawn (that is, frequent mowing), fertilizing once in spring and once in fall for cool-season grasses, and once in early summer and once in late summer for warm-season grasses, gives you a pretty nice lawn."}, {"url": "http://www.dummies.com/how-to/content/when-to-fertilize-your-lawn.html", "passage_text": "When and how often you should apply fertilizer to your lawn depends on the type of grass you grow. Grasses need nitrogen and other nutrients during their seasons of active growth, and they grow best with an even supply. Fertilize grasses when it’s naturally dormant, and you’re wasting fertilizer."}, {"url": "http://www.diynetwork.com/how-to/outdoors/landscaping/14-tips-for-fertilizing-your-lawn-pictures", "passage_text": "Fertilization. Fertilize your lawn properly, and you’ll be on your way to a healthy, dense stand of turf that maintains a deep green color and gives weeds a run for their money. Nitrogen is every lawn’s most important ingredient, and each type of grass demands different amounts to display peak growth and performance."}]