[{"url": "https://en.wikipedia.org/wiki/Behaviorism", "passage_text": "Not to be confused with Behavioralism. Behaviorism (or behaviourism) is an approach to psychology that focuses on an individual's behavior. It combines elements of philosophy, methodology, and psychological theory. Behaviorism is a psychological movement that can be contrasted with philosophy of mind. The basic premise of radical behaviorism is that the study of behavior should be a natural science, such as chemistry or physics, without any reference to hypothetical inner states of organisms as causes for their behavior."}, {"url": "http://www.alleydog.com/glossary/definition.php?term=Cognitive%20Learning%20Theory", "passage_text": "Cognitive Learning Theory is a broad theory that explains thinking and differing mental processes and how they are influenced by internal and external factors in order to produce learning in individuals. "}, {"url": "https://www.psychologytoday.com/basics/social-learning-theory", "passage_text": "Social learning theory combines cognitive learning theory (which posits that learning is influenced by psychological factors) and behavioral learning theory (which assumes that learning is based on responses to environmental stimuli). "}, {"url": "http://allpsych.com/psychology101/learning/", "passage_text": "Introduction to Learning Theory and Behavioral Psychology. Learning can be defined as the process leading to relatively permanent behavioral change or potential behavioral change. In other words, as we learn, we alter the way we perceive our environment, the way we interpret the incoming stimuli, and therefore the way we interact, or behave"}, {"url": "https://en.wikipedia.org/wiki/Learning_theory_(education)", "passage_text": "Educators who embrace cognitive theory believe that the definition of learning as a change in behavior is too narrow and prefer to study the learner rather than their environment and in particular the complexities of human memory. Cognitive, emotional, and environmental influences, as well as prior experience, all play a part in how understanding, or a world view, is acquired or changed and knowledge and skills retained. Behaviorists look at learning as an aspect of conditioning and will advocate a system of rewards and targets in education."}, {"url": "http://psychologydictionary.org/social-learning-theory/", "passage_text": "a view that learning is mainly due to our social interactions with others. Behaviour is assumed to be developed and regulated (a) by external stimulus events, such as the influence of other individuals. SOCIAL LEARNING THEORY: The social learning theory says that learning is done in social situations.. "}, {"url": "https://explorable.com/cognitive-learning-theory", "passage_text": "In addition, Social Cognitive Theory states that new experiences are to be evaluated by the learner by means of analyzing his past experiences with the same determinants. Learning, therefore, is a result of a thorough evaluation of the present experience versus the past. Cognitive Learning Theory implies that the different processes concerning learning can be explained by analyzing the mental processes first. It posits that with effective cognitive processes, learning is easier and new information can be stored in the memory for a long time."}, {"url": "https://en.wikipedia.org/wiki/Learning_theory_(education)", "passage_text": "Learning theories are conceptual frameworks describing how information is absorbed, processed, and retained during learning. Cognitive, emotional, and environmental influences, as well as prior experience, all play a part in how understanding, or a world view, is acquired or changed and knowledge and skills retained. Behaviorists look at learning as an aspect of conditioning and will advocate a system of rewards and targets in education."}, {"url": "http://study.com/academy/lesson/associative-learning-definition-theory-examples.html", "passage_text": "Associative learning is a form of conditioning, a theory that states behavior can be modified or learned based on a stimulus and a response. This means that behavior can be learned or unlearned based on the response it generates. for Teachers for Schools for Companies. Associative learning is a theory that states that ideas reinforce each other and can be linked to one another. This lesson will explain the theory of associative learning as well as provide some practical, real-life examples of this type of learning."}]