[{"url": "http://www.cancer.org/treatment/understandingyourdiagnosis/understandingyourpathologyreport/colonpathology/colon-polyps-sessile-or-traditional-serrated-adenomas", "passage_text": "A polyp is a projection (growth) of tissue from the inner lining of the colon into the lumen (hollow center) of the colon. Different types of polyps look different under the microscope. Polyps are benign (non-cancerous) growths, but cancer can start in some types of polyps. "}, {"url": "http://adasp.org/FAQs/01-colon.html", "passage_text": "There are two major growth patterns: tubular and villous. Because many adenomas have a mixture of both growth patterns, some polyps may be called tubulovillous adenomas. Most adenomas that are small (less than ½ inch) and have a tubular growth pattern. Larger adenomas may have a villous growth pattern. Larger adenomas are more often found to have cancers developing in them. "}, {"url": "https://en.wikipedia.org/wiki/Adenoma", "passage_text": "Adenoma is a benign tumor of glandular tissue, such as the mucosa of stomach, small intestine, and colon, in which tumor cells form glands or gland like structures. In hollow organs (digestive tract), the adenoma grows into the lumen-adenomatous polyp or polypoid adenoma. An adenoma (from Greek αδένας, adeno- , gland + -ώμα, -oma, tumor) (/ˌaedɨˈnoʊmə/ ; ˌædɨˈnoʊmə plural adenomas or /adenomata/) ˌaedɨˈnoʊmɨtə ˌædɨˈnoʊmɨtə is a benign tumor of epithelial tissue with, glandular origin, glandular characteristics. or both"}, {"url": "http://www.tandurust.com/digestive-problems/tubular-adenoma-polyp-treatment.html", "passage_text": "Tubular Adenomas account to 75% of all types of colon polyps. While colon polyps are a very common condition, especially among the elderly population, adenoma polyps are associated with a risk of turning malignant and increase the risk of development of colon cancer. A tubular adenoma polyp is a tube like structure which comprises of 75% of the epithelium and is arranged in a tubular fashion. Though this type of polyp is at the lowest risk of turning malignant; however its risk of turning malignant increases as the size of the polyp increases."}, {"url": "https://en.wikipedia.org/wiki/Colorectal_polyp", "passage_text": "Neoplastic polyps of the bowel are often benign hence called adenomas. An adenoma is tumor glandular tissue, that has not (yet) gained the properties of a cancer. The common adenomas of the colon (colorectal adenoma) are the tubular, tubulovillous, villous, and sessile serrated (SSA). As is evident from their name, sessile serrated and traditional serrated adenomas (TSAs) have a serrated appearance and can be difficult to distinguish microscopically from hyperplastic polyps. A colorectal polyp is a polyp (fleshy growth) occurring on the lining of the colon or rectum. Untreated colorectal polyps can develop into colorectal cancer."}, {"url": "http://library.med.utah.edu/WebPath/GIHTML/GI066.html", "passage_text": "A small adenomatous polyp (tubular adenoma) is seen here. This lesion is called a tubular adenoma because of the rounded nature of the neoplastic glands that form it. It has smooth surfaces and is discreet. Such lesions are common in adults. Small ones are virtually always benign."}, {"url": "http://www.mayoclinic.org/diseases-conditions/colon-polyps/basics/definition/con-20031957", "passage_text": "A colon polyp is a small clump of cells that forms on the lining of the colon. Most colon polyps are harmless. But over time, some colon polyps can develop into colon cancer, which is often fatal when found in its later stages. Anyone can develop colon polyps. "}]