[{"url": "http://www.answers.com/Q/When_did_voodoo_originate", "passage_text": "Vodun (a.k.a. Vodoun, Voudou, Voodoo, Sevi Lwa) is commonly called Voodoo by the public, especially Hollywood. The name is traceable to an African word for spirit. Vodun's c … an be directly traced to the West African Yoruba people who lived in 18th and 19th century Dahomey. Voodoo/Voudo/Voodu is very real and is practiced by thousands of people the world over. It originated in Africa, and with the diaspora of black slaves throughout the Americas … , it's strongest concentrations can be found in Louisiana (US), Cuba, Haiti, and Brazil. It is a faith as real as any other."}, {"url": "https://en.wikipedia.org/wiki/Dahomey", "passage_text": "Dahomey developed on the Abomey Plateau amongst the Fon people in the early 17th century and became a regional power in the 18th century by conquering key cities on the Atlantic coast. The King of Dahomey (Ahosu in the Fon language) was the sovereign power of the kingdom. All of the kings were claimed to be part of the Alladaxonou dynasty, claiming descent from the royal family in Allada. Much of the succession rules and administrative structures were created early by Houegbadja, Akaba, and Agaja."}, {"url": "http://www.historyfiles.co.uk/KingListsAfrica/AfricaDahomey.htm", "passage_text": "AD 17th Century - 1894. Situated in western Africa, the kingdom of Dahomey (or Abomey in its earliest years) was formed by a mixture of various local ethnic groups on the Abomey plain. Modern Dahomey / Benin. AD 1960 - Present Day. The kingdom of Dahomey in West Africa was ended by French colonial occupation in 1894, after they took control during the Dahomey War of 1892-1894. The state was granted autonomy as the republic of Dahomey in 1958, followed by full independence in 1960."}, {"url": "https://answers.yahoo.com/question/index?qid=20080909071335AAY0xar", "passage_text": "Most slaves from Africa came from the west coast of Africa (common known as West Africa) from the area where Senegal is all the way down the curve of the coast to the Gulf of Guinea where Nigeria and Cameroon are. The area known as the slave coast is from present day Togo, Benin (formerly Dahomey) to Nigeria. But, slaves also come from other areas including Ghana, Senegal, Gambia, etc. Note, this is just to say that these areas were the last African ports the slaves were in before being shipped to the new world."}, {"url": "http://www.univie.ac.at/Anglistik/webprojects/LiveMiss/Voodoo/chap1.htm", "passage_text": "1.1. Voodoo from Africa to the West Indies. Voodoo originated in the West Indies country of Haiti during the French Colonial Period, and it is still widely practiced in Haiti today. The foundations of Voodoo are the tribal religions of West Africa, brought to Haiti by slaves in the seventeenth century. Voodoo came to the Americas a little over 250 years ago. The raids on the 'African Slave Coast' began about 1720 and thousand of Africans were sold into the West Indies, and also directly to New Orleans. Life for slaves in Louisiana under French and Spanish rule was full of misery and pain."}, {"url": "https://en.wikipedia.org/wiki/Dahomey", "passage_text": "For much of the 18th and 19th centuries, the Kingdom of Dahomey was a key regional state, eventually ending tributary status to the Oyo Empire. The King of Dahomey (Ahosu in the Fon language) was the sovereign power of the kingdom. All of the kings were claimed to be part of the Alladaxonou dynasty, claiming descent from the royal family in Allada. Much of the succession rules and administrative structures were created early by Houegbadja, Akaba, and Agaja."}, {"url": "http://www.nigerianmuse.com/20090829095954zg/nigeria-watch/the-benin-empire-and-slave-trade-a-history-lesson-in-5-minutes-compiled-by-bolaji-aluko/", "passage_text": "Benin Empire, A House Divided: 1100 – 1299. The first kingdom of Benin is believed to have developed in the 12th or 13th century. It was located in present-day southern Nigeria, east of the Yoruba land and west of the Niger River. The inhabitants of Benin spoke a group of closely related languages known as Edo. "}, {"url": "http://www.historyfiles.co.uk/KingListsAfrica/AfricaDahomey.htm", "passage_text": "Dahomey bore no relation to the Benin empire. It was the kingdom of the Fon people, one of the groups which formed the modern Benin state. When the Nubians conquered Mero at the start of the sixth century BC, some of the Mero fled west and ended up establishing themselves in what is now Nigeria and Benin. Modern Dahomey / Benin. AD 1960 - Present Day. The kingdom of Dahomey in West Africa was ended by French colonial occupation in 1894, after they took control during the Dahomey War of 1892-1894. The state was granted autonomy as the republic of Dahomey in 1958, followed by full independence in 1960."}, {"url": "https://en.wikipedia.org/wiki/Dahomey", "passage_text": "The relations between Dahomey and other countries was complex and heavily impacted by the Gold trade. The Oyo empire engaged in regular warfare with the kingdom of Dahomey and Dahomey was a tributary to Oyo from 1732 until 1823. The King of Dahomey (Ahosu in the Fon language) was the sovereign power of the kingdom. All of the kings were claimed to be part of the Alladaxonou dynasty, claiming descent from the royal family in Allada. Much of the succession rules and administrative structures were created early by Houegbadja, Akaba, and Agaja."}, {"url": "http://www.univie.ac.at/Anglistik/webprojects/LiveMiss/Voodoo/chap1.htm", "passage_text": "They were mainly captured from the kingdom of Dahomey, which occupied parts of today's Togo, Benin and Nigeria. The word 'Voodoo' derives from the word 'vodu' in the Fon language of Dahomey, which means 'spirit', 'god'. Haiti was isolated during much of its history, therefore allowing Voodoo to develop with its own unique traditions, beliefs and gods. Voodoo came to the Americas a little over 250 years ago. The raids on the 'African Slave Coast' began about 1720 and thousand of Africans were sold into the West Indies, and also directly to New Orleans. Life for slaves in Louisiana under French and Spanish rule was full of misery and pain."}]