[{"url": "http://www.cowboyway.com/HowTo/HomemadeHoofConditioner.htm", "passage_text": "Coconut Oil As A Hoof Conditioner......Our Conclusion. We liked coconut oil as a hoof conditioner. In our extreme drought conditions it reduced the brittleness of our horse's hooves without over-softening them. It is also an ingredient in some commercially available hoof dressings, such as Hoofmaker (which is a brand we didn't try, by the way). Below: Partially melted coconut oil in a clear container. Recipe #2: A mixture of two parts coconut oil, one part glycerin, and one part aloe vera gel."}, {"url": "http://www.worldsbesthoofoil.com/faq.html", "passage_text": "1 Oil the entire front of the hoof. 2  A hoof similar to the photo testimonials, or where a horse is under heavy daily stress (working horses, all areas) it is best for both the top and the bottom of the hoof to be oiled. All ingredients are 100% pure and they include, Neatsfoot (Geniune), Wood/Stockholm Tar (NOT Petrochemical or Compound) , Saligari Oil, Eucalyptus Oil and it is the combinations of several special species that formulate the Worlds Best Hoof Oil. We DO NOT use fillers and we do not dilute any of the oils/ingredients."}, {"url": "https://ca.answers.yahoo.com/question/index?qid=20110929182730AAfwT2Z", "passage_text": "You do need hoof oil to paint on inside and outside the horse's hoof to maintain flexibility and prevent them drying out and cracking and splitting, and also to maintain the frogs and prevent them from becoming waterlogged in damp conditions. It is a necessity for good hoof maintenance. Hoof oil moisturizes the hooves, giving them their natural flex back and helps prevent cracking and chipping. Hoof oil is not a replacement for proper diet and nutrition which is what could be causing the problems with the horse's feet."}, {"url": "https://ca.answers.yahoo.com/question/index?qid=20110929182730AAfwT2Z", "passage_text": "Best Answer: Hoof Oil or Conditioner as I call it is like lotion to your skin. It helps moisten and the 'repair' the hooves. Like if you keep your horse in a dry pasture, putting it on once or twice a week could help keep the hooves moist and crack-resistant. Hoof oil moisturizes the hooves, giving them their natural flex back and helps prevent cracking and chipping. Hoof oil is not a replacement for proper diet and nutrition which is what could be causing the problems with the horse's feet."}, {"url": "http://www.cowboyway.com/HowTo/HomemadeHoofConditioner.htm", "passage_text": "This is one of the horse's hooves before we started applying coconut oil as a hoof conditioner. Notice the cracks, particularly around the nail holes. In addition, notice the dry, cracked appearance of the coronary band at the top of the photo. His comments took us completely by surprise. It is also an ingredient in some commercially available hoof dressings, such as Hoofmaker (which is a brand we didn't try, by the way). Below: Partially melted coconut oil in a clear container. Recipe #2: A mixture of two parts coconut oil, one part glycerin, and one part aloe vera gel."}, {"url": "https://ca.answers.yahoo.com/question/index?qid=20110929182730AAfwT2Z", "passage_text": "Hoof oil is generally a moisturiser for horses. It works to prevent cracks and help the hoof wall stay in tact and healthy in general. Even if oyur new pony's hoofs are in very good condition, it's still a good idea to use it to keep them healthy. Hoof oil moisturizes the hooves, giving them their natural flex back and helps prevent cracking and chipping. Hoof oil is not a replacement for proper diet and nutrition which is what could be causing the problems with the horse's feet."}, {"url": "http://www.wikihow.com/Make-Hoof-Oil", "passage_text": "How to Make Hoof Oil. Hoof oil holds a very important place within the horse's grooming routine. It is used to moisturise, as well as to harden the hoof to prevent breakage. "}, {"url": "https://en.wikipedia.org/wiki/Neatsfoot_oil", "passage_text": "Neatsfoot oil is a yellow oil rendered and purified from the shin bones and feet (but not the hooves) of cattle. Neat in the oil's name comes from an old English word for cattle. Neatsfoot oil is used as a conditioning, softening and preservative agent for leather. In the 18th century, it was also used medicinally as a topical application for dry scaly skin conditions."}, {"url": "https://ca.answers.yahoo.com/question/index?qid=20110929182730AAfwT2Z", "passage_text": "Report Abuse. Hoof oil/conditioner is used to maintain the moisture in the hooves, and it also blocks things like mud that suck moisture out. Moist, healthy hooves are less likely to chip and crack than dry, brittle hooves. Hoof oil moisturizes the hooves, giving them their natural flex back and helps prevent cracking and chipping. Hoof oil is not a replacement for proper diet and nutrition which is what could be causing the problems with the horse's feet."}]