[{"url": "http://www.neoperceptions.com/snakesandfrogs.com/scra/snakes/brat.htm", "passage_text": "Such black specimens formerly known as Black Rat Snakes and given a subspecies name of obsoleta In most of pennisula Florida, the adult Eastern Rat Snake is very differently patterned and colored. They have a yellow dorsal background color with four dark stripes running the length of the body."}, {"url": "http://nationalzoo.si.edu/Animals/ReptilesAmphibians/Facts/FactSheets/Blackratsnake.cfm", "passage_text": "The black rat snake, as the name implies, is completely black except for a white chin. Hatchlings of the black rat snake have a pale grey background with black blotches along the back."}, {"url": "http://nationalzoo.si.edu/Animals/ReptilesAmphibians/Facts/FactSheets/Blackratsnake.cfm", "passage_text": "Taxonomy. The common rat snake is medium-sized, averaging 42 to 72 inches (106.7 to 183 cm) in length. At the widest point of the snake's body, its average diameter is 1.5 inches (3.8 cm). The rat snake is covered with keeled scales, and has a powerful slender body with a wedge-shaped head."}, {"url": "http://myfwc.com/wildlifehabitats/imperiled/profiles/reptiles/red-rat-snake/", "passage_text": "Physical Description. The red rat snake is the best climbing species of snake in Florida (Tallahassee Museum, n.d.). Its average length ranges from 30-48 inches (76.2-121.92 centimeters), but it can grow up to 72 inches (182.9 centimeters)."}, {"url": "http://www.virginiaherpetologicalsociety.com/reptiles/snakes/eastern-ratsnake/blackrat_snake.php", "passage_text": "PHYSICAL DESCRIPTION: This species is plain, shiny black, at times showing traces of a spotted pattern when the skin is distended. The light areas are chiefly confined to the skin between the scales, and may be white, yellow, orange, or red."}, {"url": "http://nationalzoo.si.edu/Animals/ReptilesAmphibians/Facts/FactSheets/Blackratsnake.cfm", "passage_text": "The black rat snake is the most widely distributed common rat snake with a range from New England south through Georgia and west across the northern parts of Alabama, Mississippi, and Louisiana, and north through Oklahoma to southern Wisconsin."}, {"url": "http://nationalzoo.si.edu/Animals/ReptilesAmphibians/Facts/FactSheets/Blackratsnake.cfm", "passage_text": "Description: The black rat snake, as the name implies, is completely black except for a white chin. Hatchlings of the black rat snake have a pale grey background with black blotches along the back. As the snake matures, the color becomes darker until the snake reaches its adult phase."}, {"url": "http://srelherp.uga.edu/snakes/elaobs.htm", "passage_text": "Habitat use by black rat snakes (Elaphe obsoleta obsoleta) in fragmented forests. Ecology 82: 2882-2896. Note: Genetic studies have led some experts to consider the North American species of rat snake to be in the genus Pantherophis and to suggest that some of the subspecies represent distinct species."}]