[{"url": "http://biology.tutorvista.com/cell/unicellular-and-multicellular-organisms.html", "passage_text": "Organisms that consist of more than one cell are known as multicellular organisms. Multicellular organisms are made up of more than one cell. These cells identify and attach to each other to form a multicellular organism. Most of the multicellular organisms are visible to the naked eye. T hey are made up of a single cell. O rganisms like the amoeba, P aramecium are single-celled organisms, they are the oldest forms of life, they existed about 3.8 million years ago. Bacteria, a rchaea, protozoa, unicellular algae and un i cellular fungi are the main groups of un"}, {"url": "https://en.wikipedia.org/wiki/Composition_of_the_human_body", "passage_text": "Almost 99% of the mass of the human body is made up of six elements: oxygen, carbon, hydrogen, nitrogen, calcium, and phosphorus. Only about 0.85% is composed of another five elements: potassium, sulfur, sodium, chlorine, and magnesium. All are necessary to life. "}, {"url": "http://www.austincc.edu/biocr/1406/labm/ex4/prelab_4_4.htm", "passage_text": "Prokaryotic organisms are usually unicellular, but a few form simple colonies. Unicellular means an organism is composed of a single cell. Colonial means an organism is composed of attached cells, but the cells are mostly similar in structure and function. If separated from the colony, each cell can usually survive on its own and grow into a new colony."}, {"url": "https://quizlet.com/1252241/the-6-kingdoms-classification-flash-cards/", "passage_text": "Plant Kingdom. The Plant Kingdom is made up of organisms that can perform photosynthesis to make food. Characteristics of the Plant Kingdom: multicellular, eukaryotic, autotrophic, and mostly green in color. "}, {"url": "http://www.austincc.edu/biocr/1406/labm/ex4/prelab_4_4.htm", "passage_text": "Although generally not visible to the naked eye, organisms composed of prokaryotic cells still dominate the earth. Their collective mass is at least 10 times greater than the mass of all eukaryotes combined. Organisms composed of prokaryotic cells are classified into 2 main groups: archaea and bacteria. Archaea most closely resemble the first primitive cells on our planet. Unicellular means an organism is composed of a single cell. Colonial means an organism is composed of attached cells, but the cells are mostly similar in structure and function. If separated from the colony, each cell can usually survive on its own and grow into a new colony."}, {"url": "http://eschooltoday.com/science/characteristics-of-living-organisms/all-living-organisms-are-made-up-of-cells.html", "passage_text": "Living organisms are made up of cells The first characteristic of a living thing is that, they are made up of cells. A cell is the basic building block of all organisms. Here is an illustration of an animal and a plant cell. Some microorganisms are made up of only one cell, whiles other bigger organisms such as an ant or a lion are made up of millions of different cells. Unicellular organism: An organism with only one cell is called a unicellular organism. Unicellular organisms can be complex too, even though they are simply a one-cell organism. They include bacteria, yeast, amoeba and paramecia. Multicellular organism: These are organisms that are made up of more than one cell"}, {"url": "http://biology.tutorvista.com/cell/unicellular-and-multicellular-organisms.html", "passage_text": "Cells are the building blocks of life. All living organisms are made up of cells. The cells were discovered by Robert Hooke in 1665. In the human body there are about 100 trillion to 1014 cells. T hey are made up of a single cell. O rganisms like the amoeba, P aramecium are single-celled organisms, they are the oldest forms of life, they existed about 3.8 million years ago. Bacteria, a rchaea, protozoa, unicellular algae and un i cellular fungi are the main groups of unicellular organisms."}, {"url": "https://en.wikipedia.org/wiki/Organism", "passage_text": "All known types of organisms are capable of some degree of response to stimuli, reproduction, growth and development and homeostasis. An organism consists of one or more cells; when it has one cell is a unicellular organism; and when it has more than one it is known as a multicellular organism. "}, {"url": "http://water.usgs.gov/edu/propertyyou.html", "passage_text": "Naturally, I'm going to concentrate on water here. Water is of major importance to all living things; in some organisms, up to 90% of their body weight comes from water. Up to 60% of the human adult body is water. According to H.H. Mitchell, Journal of Biological Chemistry 158, the brain and heart are composed of 73% water, and the lungs are about 83% water. "}]