[{"url": "http://www.northwestmvcd.org/Northwestmvcd/Mosquito_Fish.html", "passage_text": "The gestation period of the female mosquito fish is approximately 24 days, and the fry will reach maturity in 4-6 weeks. On average each female will produce 3-4 broods of 50-100 fry over the course of a summer. The life span of a mosquito fish varies from 1-2 years under natural conditions."}, {"url": "http://www.happy-goldfish.com/blog/breeding-goldfish/", "passage_text": "Depending on the water temperature, the goldfish eggs will hatch between 5 and 7 days later (warmer water for shorter incubation period). When the fry first emerge, they are still attached to and feeding from their yolk sacs."}, {"url": "http://www.answers.com/Q/What_is_the_gestation_period_of_a_goldfish", "passage_text": "Gestation for a whitetailed deer is about 6 and 1/2 months or 200 days. Does can mate in their first year but usually not untill the second year. Does usually give birth to on … ly one fawn the first time. The second time around the doe can have twins-triplets and in rare occasions quintuplets."}, {"url": "http://www.answers.com/Q/How_long_is_the_incubation_period_of_a_goldfish", "passage_text": "Answer by PixelatedE. Confidence votes 29. If you keep the water temperature at a steady 70 degrees Fahrenheit, the incubation period for a goldfish is about five days. If the water temperature is kept at around 65 degrees Fahrenheit, the incubation period is about seven days."}, {"url": "http://www.happy-goldfish.com/blog/breeding-goldfish/", "passage_text": "Preparation should start before the onset of winter – about four months before spawning takes place in the spring – in order to bring about the optimum conditions for goldfish breeding. Firstly, make sure the goldfish are mature enough to breed. Any goldfish under 8cm (4″) is probably not ready for breeding."}, {"url": "http://www.answers.com/Q/How_long_is_the_incubation_period_of_a_goldfish", "passage_text": "If you keep the water temperature at a steady 70 degrees Fahrenheit, the incubation period for a goldfish is about five days."}, {"url": "http://www.answers.com/Q/What_is_the_gestation_period_of_a_goldfish", "passage_text": "The gestation period is a scientific term for the length of time, from conception to birth, an embryo turned fetus remains in the womb of its mother."}]