[{"url": "http://medical-dictionary.thefreedictionary.com/Plasmapheresis", "passage_text": "Plasmapheresis is used to remove antibodies from the bloodstream, thereby preventing them from attacking their targets. It does not directly affect the immune system's ability to make more antibodies, and therefore may only offer temporary benefit. "}, {"url": "http://emedicine.medscape.com/article/1895577-overview", "passage_text": "Background. Plasmapheresis is a term used to refer to a broad range of procedures in which extracorporeal separation of blood components results in a filtered plasma product. The filtering of plasma from whole blood can be accomplished via centrifugation or semipermeable membranes. Plasmapheresis is currently used as a therapeutic modality in a wide array of conditions. Generally, plasmapheresis is used when a substance in the plasma, such as immunoglobulin, is acutely toxic and can be efficiently removed."}, {"url": "http://www.healthline.com/health/plasmapheresis", "passage_text": "Plasmapheresis is a process in which the liquid in the blood, or plasma, is separated from the cells. In sick people, plasma can contain antibodies that attack the immune system. A machine removes the affected plasma and replaces it with good plasma, or a plasma substitute. This is also known as plasma exchange. The process is similar to kidney dialysis. Plasmapheresis also can refer to the plasma donation process, where the plasma is removed and cells are returned to the body. Plasmapheresis can be used to treat a variety of autoimmune disorders, including myasthenia gravis, Guillain-Barre syndrome, and Lambert-Eaton. It can also be used to treat multiple sclerosis"}, {"url": "https://en.wikipedia.org/wiki/Plasmapheresis", "passage_text": "Plasmapheresis (from the Greek πλάσμα—plasma, something molded, and ἀφαίρεσις—aphairesis, taking away) is the removal, treatment, and return of (components of) blood plasma from blood circulation. It is thus an extracorporeal therapy (a medical procedure performed outside the body). During plasmapheresis, blood (which consists of blood cells and a clear liquid called plasma) is initially taken out of the body through a needle or previously implanted catheter. Plasma is then removed from the blood by a cell separator."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=4937", "passage_text": "Plasmapheresis: A procedure in which whole blood is taken from a person and separated into plasma and blood cells; the plasma is removed and replaced with another solution, such as saline solution, albumin, or specially prepared donor plasma; and the reconstituted solution is then returned to the patient. Plasmapheresis is used in the treatment of many different conditions, including autoimmune disorders. When the plasma is removed, it takes with it the antibodies that have been developed against self-tissue in an attempt to reduce the attack on the patient's own body."}, {"url": "http://www.primehealthchannel.com/plasmapheresis.html", "passage_text": "Plasmapheresis Machine. It is the machine used to carry out this procedure. The plasma of a person can be removed with the aid of this equipment. The machine uses a device known as a Cell Separator that divides plasma from the fluid part of the human blood. Plasmapheresis Treatments. Plasmapheresis is used for effective cure of certain conditions on a temporary basis. These disorders include: 1  Myasthenia Gravis – It is an autoimmune disease that results in weakness of the muscles."}, {"url": "http://www.webmd.com/multiple-sclerosis/guide/plasma-exchange-ms", "passage_text": "Font Size. A. A. A. Plasma exchange, also known as plasmapheresis, is a way to clean your blood. It works sort of like kidney dialysis. During the treatment, plasma -- the liquid part of your blood -- gets replaced with plasma from a donor or with a plasma substitute. "}, {"url": "http://health.howstuffworks.com/medicine/modern-treatments/plasmapheresis.htm", "passage_text": "When a patient undergoes plasmapheresis procedure, plasma, the fluid part of the blood, is removed from blood cells by a cell separator. The separator spins blood at a rapid speed to separate blood cells from the plasma, or it passes the blood through a membrane with pores so tiny that only plasma can fit through. "}, {"url": "http://biomed.brown.edu/Courses/BI108/BI108_2008_Groups/group06/pages/GeneralFAQ.html", "passage_text": "Plasmapheresis is a term used to describe multiple forms of extracorporeal plasma separation. Plasma is the fluid portion of the blood, and it carries proteins and other substances around the body. Plasmapheresis is able to separate blood cells from plasma, and therein lies the potential for its therapeutic use. Plasmapheresis is mostly used to treat autoimmune diseases, but can also be used as a therapy for other diseases in which abnormal types or quantities of other substances (proteins, cholesterol, etc.) are circulating in the plasma."}]