[{"url": "http://www.wikihow.com/Know-Which-Fish-to-Put-Together-in-a-Tank", "passage_text": "Steps. 1. Most freshwater community fish can be together such as tetras, danios, guppies, mollies, platies, rasboras, corys, swordtails, with angelfish, and Dwarf cichlids (not African cichlids). Fortunately, they all eat the same food, such as any tropical flakes or pellets. Frozen bloodworms and mini shrimp are good as well"}, {"url": "http://www.fish-tank-guide.com/fish/mollies.html", "passage_text": "To keep your mollies happy, you want to put them in a fish tank that has a minimum of 15 gallons of water. Be sure there is a quarter of inch of gravel on the bottom and you have a good heater that can keep the water between 70 to 82°F. Just like other livebearers, Mollies will do best if you put a tablespoon of aquarium salt for every 5 gallons of water. Mollies are unique in that they can actually live in fresh water or salt water but adding little but of salt to freshwater aquarium will help them as many as other types of breeds."}, {"url": "http://aboutangelfish.com/what-fish-can-you-put-with-angelfish-in-a-community-tank/", "passage_text": "Angelfish should be kept in groups of four in a tank big enough for that many and other species. It should also be tall to accommodate an angelfish height. The different scalare varieties, such as the veil, marble, or gold, and different species, such as the altum angelfish, are compatible in a large tank. Silver dollars are a schooling fish that can be kept with angelfish. They are silver round shaped fish. They are mostly vegetarian. As with all fish, some can be aggressive and nippy. Danios. Danios are active fish that swim in schools. They are easy to keep."}, {"url": "http://www.wikihow.com/Find-Compatible-Tank-Mates-for-Guppies", "passage_text": "You have to make sure that the fish you get for them aren't too big-you would not want to put in, for example, angelfish, because these can quite easily eat guppies as well as nip guppies' beautiful, long, flowing fins. 1  This is another concept you have to consider when selecting tank mates for guppies. "}, {"url": "http://www.myaquariumclub.com/what-fish-will-get-a-long-with-my-angel-fish-and-mollies-10987817.html", "passage_text": "A lot of fish will fit with this combination. Avoid aggressive species or fish that will fit in the angelfish mouth or that can eat the mollies. Bottom feeders like corydora catfish, bristlenose plecos, and some loaches are good choices. Also, some species of larger tetra can also work. Just be sure not to overcrowd your aquarium. Since Angel fish grow big, I would avoid other livebearing fish like guppies, platies and swordtails (all of which CAN go with mollies if you so choice to keep them this way). Do not get tetras like Megham said, they will be lunch."}, {"url": "http://www.tropicalfishkeeping.com/freshwater-tropical-fish/mollies-guppies-tetras-angelfish-one-30-a-4066/", "passage_text": "If they will eat my other fish ..I dont want to get the Angel Fish eventhough I have my heart set on it. 2) How many of each (mollies, guppies, tetras and angel fish) do you recommend I can keep in a 30 gl tank. I was thinking of 4 mollies, 2 guppies, 6 tetras and 2 angel fish. 3) I have read that mollies and guppies reproduce profusely and I wouldnt know what to do with the extra fish. "}, {"url": "https://au.answers.yahoo.com/question/index?qid=20080821061204AAFaLxY", "passage_text": "The guppies, platies, and mollies will do wonderful in a 30 gallon tank. You can get 5 more fish. Ask your pet store to! You can but a pair of discus in the tank. They will work out wonderful to. You can also put 5 more smaller fish in this tank. "}, {"url": "https://answers.yahoo.com/question/index?qid=20090808070903AAuwL1y", "passage_text": "They prefer very soft, acidic water. Mollies and Angels can live together, but other livebearers such as platies and swordtails will work better with Angelfish. I once kept four Mollies in a tank especially suited to the needs of Angels, but I added aquarium salt for the Mollies. The poor mollies didn't do well. You can keep them together, but not in a tank especially tailored for one species or the other. As for temperament, they work beautifully"}]