[{"url": "http://www.babynames.com/name/LOGAN", "passage_text": "About the name Logan. The meaning of the name Logan: From The Hollow. The origin of the name Logan: Irish. People who like the name Logan also like: Liam, Noah, Ethan, Landon, Lucas, Owen, Jackson. Olivia, Ava, Emma, Chloe, Sophia, Isabella, Charlotte. Notes: Logan is a name with Irish origins. The meaning of the name Logan is from the hollow. Common nicknames for Logan include Loag and Lo. Famous Logan’s include athletes Logan Bailly, Logan Coutre, Logan Kensing, and Logan Mankins. Logan Clendening was a medical author. Logan Pearsall Smith is another author"}, {"url": "http://www.ourbabynamer.com/meaning-of-Logan.html", "passage_text": "What does Logan mean, popularity, numerology and more. The name Logan is of Scottish origin. The meaning of Logan is little hollow. It is also of Irish origin, where its meaning is meadow and English origin, where its meaning is hollow, lowland."}, {"url": "http://www.babynamespedia.com/meaning/Logan/f", "passage_text": "Logan's language of origin is Celtic. It is predominantly used in English and Scottish. The first name is derived from the Scottish family name, which is from a Scottish place name so called in Ayrshire; the place name is from the Gaelic lagan. The first name is used largely in Scotland. See Logan for more information. Forms of Logan include the name Logane, the name Logann, the English Loganne, the name Logen, the name Loghan, the name Logun, the name Logyn, and the name Logynn. Logan is a rather popular baby girl name. The name increased in popularity from the 1980s up to the 1990s; prior to that, it was of only sporadic use. Its usage peaked modestly in 1996 with 0.057% of baby girls being named Logan. It was #257 in rank then."}, {"url": "http://www.sheknows.com/baby-names/name/logan", "passage_text": "Scottish Meaning: The name Logan is a Scottish baby name. In Scottish the meaning of the name Logan is: Finnian's servant. American Meaning: The name Logan is an American baby name. In American the meaning of the name Logan is: Finnian's servant. Gaelic Meaning: The name Logan is a Gaelic baby name. In Gaelic the meaning of the name Logan is: From the hollow."}, {"url": "https://en.wikipedia.org/wiki/Logan_(given_name)", "passage_text": "The given name Logan is derived from the Scottish surname Logan, which is in turn derived from a place name. The likely origin of this surname is a place located near Auchinleck, in Ayrshire. The place name is derived from the Gaelic lagan, which is a diminutive of lag, which in turn means hollow. "}, {"url": "http://www.names.org/n/logan/about", "passage_text": "The name Logan is of Irish origin, and it means From the hollow . It's a name commonly given to both boys and girls. Logan Lerman is an actor with the most prominent portion of his career being from 2 to present. "}, {"url": "http://www.thinkbabynames.com/meaning/0/Logan", "passage_text": "Logan is a somewhat popular first name for females (#3553 out of 4276, Top 83%) and an even more popular last name for both adults and children (#465 out of 150436, Top 1%). (2000 U.S. Census). Charted below is the baby name popularity of Logan for girls. "}, {"url": "http://www.thinkbabynames.com/meaning/1/Logan", "passage_text": "Logan is a very prominent first name for men (#523 out of 1220, Top 43%) and also a very prominent last name for both adults and children (#465 out of 150436, Top 1%). (2000 U.S. Census). Displayed below is the birth name popularity of Logan for boys. Logan /lo-gan/ [2 sylls.] as a boys' name (also used less commonly as girls' name Logan) is pronounced LOH-gan. It is of Gaelic origin, and the meaning of Logan is hollow. From the word lag. In Chinese, the name means little hollow. Author Logan Pearsall Smith; playwright/director Joshua Logan."}]