[{"url": "http://study.com/academy/lesson/what-is-business-law-definition-overview.html", "passage_text": "Definition of Business Law. Business law encompasses all of the laws that dictate how to form and run a business. This includes all of the laws that govern how to start, buy, manage and close or sell any type of business. Business laws establish the rules that all businesses should follow."}, {"url": "http://www.youtube.com/watch?v=ZM2RVbAlihc", "passage_text": "A formal contract is a contract that is legally binding due to the particular form or mode of expression. All other contracts are considered informal contracts. Contracts are governed by Contract Law which is and sub-category of Common Law."}, {"url": "http://definitions.uslegal.com/b/business/", "passage_text": "Business law encompasses the law governing contracts, sales, commercial paper, agency and employment law, business organizations, property, and bailments. Other popular areas include insurance, wills and estate planning, and consumer and creditor protection. Business law may include issues such as starting, selling ,or buying a small business, managing a business, dealing with employees, or dealing with contracts, among others."}, {"url": "http://legal-dictionary.thefreedictionary.com/Business+law", "passage_text": "Consequently, there is pressure on business schools to provide. courses to accounting students which go beyond basic legal principles and which should adequately prepare students for careers in the accounting field. The relevance of business law education for future accountants: a New ..."}, {"url": "http://legal-dictionary.thefreedictionary.com/Business+law", "passage_text": "Although the UCC controls most aspects of domestic commercial law, the Common Law of contracts, as well as other state laws, still applies to some types of transactions that arise in business, such as contracts for services. International Law is likewise an important component of this area."}, {"url": "http://legal-dictionary.thefreedictionary.com/Business+law", "passage_text": "The term commercial law describes a wide body of laws that govern business transactions. The Uniform Commercial Code (UCC), which has been adopted in part by every state in the United States, is the primary authority that governs commercial"}]