[{"url": "http://www.answers.com/Q/What_is_the_chemical_formula_for_milk", "passage_text": "Confidence votes 88. Milk does not have a chemical formula. Milk is an emulsion or colloid of butter-fat molecules within a water-based fluid. These particles are made of phospholipids and proteins. There are too many components in milk for it to have a basic chemical formula so it is just a very complex mixture. "}, {"url": "http://www.madehow.com/Volume-4/Milk.html", "passage_text": "The average composition of cow's milk is 87.2% water, 3.7% milk fat, 3.5% protein, 4.9% lactose, and 0.7% ash. This composition varies from cow to cow and breed to breed. For example, Jersey cows have an average of 85.6% water and 5.15% milk fat. "}, {"url": "http://www.milkfacts.info/Milk%20Composition/Milk%20Composition%20Page.htm", "passage_text": "Milk Composition. The Milk Composition section describes the chemical and physical properties and effects of pasteurization on the compounds in milk. A brief overview of the variation in milk composition is provided below as an introduction to this section. Topics covered are: 1  Carbohydrate (Lactose). 2  Fat. 3  Protein. 4  Vitamins and Minerals."}, {"url": "http://www.milkfacts.info/Milk%20Composition/Milk%20Composition%20Page.htm", "passage_text": "In general, the gross composition of cow's milk in the U.S. is 87.7% water, 4.9% lactose (carbohydrate), 3.4% fat, 3.3% protein, and 0.7% minerals (referred to as ash). Milk composition varies depending on the species (cow, goat, sheep), breed (Holstein, Jersey), the animal's feed, and the stage of lactation. The Milk Composition section describes the chemical and physical properties and effects of pasteurization on the compounds in milk. A brief overview of the variation in milk composition is provided below as an introduction to this section. Topics covered are: 1  Carbohydrate (Lactose). 2  Fat. 3  Protein. 4  Vitamins and Minerals."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/392766", "passage_text": "Mature human milk is made up of 3%-5% fat, 0.8%-0.0% protein, 6.9%-7.2% carbohydrate calculated as lactose, and 0.2% mineral constituents expressed as ash. The energy content is 60-75 kcal/100ml. Protein content is considerably higher and carbohydrate content lower in colostrum than in mature milk. The composition of human milk. Jenness R. Mature human milk contains 3%--5% fat, 0.8%--0.9% protein, 6.9%--7.2% carbohydrate calculated as lactose, and 0.2% mineral constituents expressed as ash. Its energy content is 60--75 kcal/100 ml."}, {"url": "http://www.answers.com/Q/What_elements_are_in_milk", "passage_text": "The major elements of milk are Hydrogen (H), Oxygen (O) [milk is mostly water H2O] the minerals in milk which make it a good food for growing mammals include Calcium (Ca) and Phosphorus (P). Milk also contains the elements Magnesium (Mg), Iron (Fe), Molybdenum (Mo), Manganese(Mn), Copper (Cu), Carbon (C). "}, {"url": "https://en.wikipedia.org/wiki/Lactose", "passage_text": "From Wikipedia, the free encyclopedia. Lactose is a disaccharide sugar derived from galactose and glucose that is found in milk. Lactose makes up around 2–8% of milk (by weight), although the amount varies among species and individuals, and milk with a reduced amount of lactose also exists. It is extracted from sweet or sour whey. The name comes from lac or lactis, the Latin word for milk, plus the-ose ending used to name sugars."}, {"url": "http://www.gwinnett.k12.ga.us/LilburnES/PromoteGA/food/cheese_chemicalmakeup.html", "passage_text": "Whey is a watery fluid that forms along with curd when milk coagulates. It contains the dissolvable constituents of milk and is a 5% solution of lactose in water. "}, {"url": "https://en.wikipedia.org/wiki/Milk", "passage_text": "Milk is a white liquid produced by the mammary glands of mammals. It is the primary source of nutrition for young mammals before they are able to digest other types of food. Early-lactation milk contains colostrum, which carries the mother's antibodies to its young and can reduce the risk of many diseases. Milk contains many other nutrients and the carbohydrate lactose"}, {"url": "http://americanpregnancy.org/first-year-of-life/whats-in-breastmilk/", "passage_text": "Fats. Human milk also contains fats that are essential for the health of your baby. It is necessary for brain development, absorption of fat-soluble vitamins, and is a primary calorie source. Long chain fatty acids are needed for brain, retina, and nervous system development. "}]