[{"url": "http://www.eyepedia.co.uk/eyes-vision/eye-anatomy/internal-eye/choroid/", "passage_text": "Function. The choroid lies between the retina and the sclera. It is the posterior portion of the uveal tract and is a high-flow vascular tissue that provides nourishment for the back of the eye. In addition, there are pigment cells within the choroid that absorb stray light and so it helps to lessen glare within the eye. The choroid is an extremely vascular layer, with a plexus of blood vessels that reduce in size from its outermost to innermost borders. Blood passes into the choroid from arteries that connect behind the eye around the insertion of the optic nerve."}, {"url": "https://en.wikipedia.org/wiki/Choroid", "passage_text": "The choroid, also known as the choroidea or choroid coat, is the vascular layer of the eye, containing connective tissue, and lying between the retina and the sclera. The choroid provides oxygen and nourishment to the outer layers of the retina. Along with the ciliary body and iris, the choroid forms the uveal tract. The structure of the choroid is generally divided into four layers (classified in order of furthest away from the retina to closest): 1  Haller's layer-outermost layer of the choroid consisting of larger diameter blood vessels; 2  Sattler's layer-layer of medium diameter blood vessels;"}, {"url": "http://teaching.pharmacy.umn.edu/courses/eyeAP/Eye_Anatomy/CoatsoftheEye/Choroid.htm", "passage_text": "Choroid. The posterior portion of the uveal tract is represented by the, a vascular membrane that separates the fibrous layer from the retina. The choroid receives its blood supply from the central retinal artery that emerges from the back of the eye. The choroid provides all eye layers with 90% of their blood supply. The blood vessels, embedded in a meshwork of connective tissue, supply the fibrous layer and much of the retina with nutrients."}, {"url": "https://en.wikipedia.org/wiki/Choroid_plexus", "passage_text": "The choroid plexus (CP) (from Greek khorion membrane enclosing the fetus, afterbirth; plexus: Mod.L., lit. braid, network) is a plexus of cells that produces the cerebrospinal fluid in the ventricles of the brain. There is also choroid plexus in the fourth ventricle, in the section closest to the bottom half of the cerebellum. The choroid plexus consists of many capillaries, separated from the ventricles by choroid epithelial cells. Fluid filters through these cells from blood to become cerebrospinal fluid."}, {"url": "https://en.wikipedia.org/wiki/Choroid_plexus", "passage_text": "There are four choroid plexuses in the brain, one in each of the ventricles. The CP consists of a layer of cuboidal epithelial cells surrounding a core of capillaries and loose connective tissue. There is also choroid plexus in the fourth ventricle, in the section closest to the bottom half of the cerebellum. The choroid plexus consists of many capillaries, separated from the ventricles by choroid epithelial cells. Fluid filters through these cells from blood to become cerebrospinal fluid."}, {"url": "http://www.answers.com/Q/What_is_the_function_of_the_choroid", "passage_text": "That is a horrible answer with no truth to it at all. The choroid is a layer of the eye deep to the retina and superficial to the sc … lera. It provides oxygen and nutrients to the retina through its extensive network of capillaries. The retina itself does not have a huge vascular supply, because the vessels would interfere with the formation of the image in the eye."}, {"url": "http://www.wisegeekhealth.com/what-is-the-choroid.htm", "passage_text": "Technically, the choroid is the vascular part of the human eye that includes the connective tissue. Its main purpose is to send oxygen and other nutrients to the retina. Within this section of the eye, there are four different layers. The choroid is located between the sclera, the white part of the eye, and the retina. In most cases, eye disease can be cured if found quickly enough."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=9890", "passage_text": "Choroid: In the eye, a thin vascular layer between the sclera and the retina. The choroid supplies blood to the retina and conducts arteries and nerves to other structures in the eye. "}]