[{"url": "https://answers.yahoo.com/question/index?qid=20100602021913AABryAY", "passage_text": "Best Answer: Open the Contacts section, then Add to put the name in your Address Book.. Type in the e-mail address of your friend, with the name and nickname you want to show. Once you send that person an e-mail (use your name as part of the Subject heading so it won't be deleted as Spam), that person will have your address and you can exchange e-mails."}, {"url": "http://www.facebook.com/help/friends", "passage_text": "To suggest a friend to someone: 1  Click Friends at the top of your friend's profile. 2  Click Suggest Friends. 3  To find a particular friend, you can type their name in the field or scroll through your complete friends list. 4  Click Suggest Friend next to a friend's name to send a suggestion. To cancel a friend request you've sent: 1  Click at the top of any Facebook page. 2  Click Find Friends. 3  Click View Sent Requests. 4  Hover over Friend Request Sent next to the request you'd like to cancel and select Cancel Request."}, {"url": "http://www.ehow.com/how_2031197_add-friends-facebook.html", "passage_text": "You will see a list of your current friends with a few quick details about them. Click on either the Friend Finder tab or the Search Your Address Book link to import your contacts. Both will take your to a short form asking for your external email address and password. Enter your email address and password in the proper form fields. "}, {"url": "http://www.facebook.com/help/260198140710950/", "passage_text": "Search for friends. You can search for your friends by typing their names or email addresses in the search bar. Learn more about adding friends. Import your contacts. You can import your list of contacts from other places (ex: your email account, your phone) and we'll find your friends for you. "}, {"url": "http://www.facebook.com/help/friends", "passage_text": "You can add friends by importing your contacts. You can also add friends from their profiles: 1  Enter your friend's name or email in the search bar at the top of any Facebook page. 2  Select their name to go to their profile. 3  Click the Add Friend button. 4  You might not see this button on some people's profiles, depending on their privacy settings. To cancel a friend request you've sent: 1  Click at the top of any Facebook page. 2  Click Find Friends. 3  Click View Sent Requests. 4  Hover over Friend Request Sent next to the request you'd like to cancel and select Cancel Request."}, {"url": "http://support2.constantcontact.com/articles/FAQ/1543", "passage_text": "1 Click the Customize Your Forward Email to a Friend Form link. 2  On the Form Text is selected, you can: 3  Edit the Page Title-Rename the words at the top of the Forward to a Friend form. 4  Add Your Logo-If your logo is on your website, copy and paste your logo's URL. Customize the Pop-up Form. To customize and brand the form that displays to contacts who forward your email: 1 "}, {"url": "http://www.wikihow.com/Add-Friends-on-Facebook", "passage_text": "1. Find the person you want to add. You can use the search bar at the top of the Facebook page to search for anyone that uses Facebook by name or email address. Click on the result to load that person’s timeline. 1  You can also navigate to a person’s timeline by clicking on their name in a post. 1 When you click the Add Friend button, it will change to the Friend Request Sent button. 2  Clicking on this button will open a menu of actions you can take, such as canceling the friend request or suggesting more friends to your new friend. 3  4 Edit step."}, {"url": "https://www.verizon.com/support/residential/internet/highspeed/email/setup+and+use/questionsone/121982.htm", "passage_text": "How do I add new contacts to my address book? To add a sender or senders to your contacts list, do the following: From the toolbar, mouse over CONTACTS and open the drop-down menu Select Contacts Enter name, email, phone, address, IM, or any personal information you would like to record Select Save. "}, {"url": "http://support2.constantcontact.com/articles/FAQ/2155", "passage_text": "1 Choose how you want to add your contacts from the drop-down. 2  Type in one contact-Type in your contacts and any details that you'd like to store with us. 3  Type in or paste contacts-Copy email addresses and paste them in your account or add a handful of contacts and details manually. 1 Click Add Contacts. 2  Choose how you want to add your contacts from the drop-down. 3"}, {"url": "http://support2.constantcontact.com/articles/FAQ/2155", "passage_text": "1 Click Contacts. 2  Click Add Contacts. 3  Choose how you want to add your contacts from the drop-down. 4  Type in one contact-Type in your contacts and any details that you'd like to store with us. 5  Type in or paste contacts-Copy email addresses and paste them in your account or add a handful of contacts and details manually. 1 Click Add Contacts. 2  Choose how you want to add your contacts from the drop-down. 3"}]