[{"url": "http://www.algebra-class.com/factoring-in-algebra.html", "passage_text": "Factoring in Algebra can be accomplished in many different ways. When it comes to polynomials, each situation is different based on the make-up of the polynomial. In our last lesson, we learned how to factor by using the greatest common factor. However, some polynomials have no greatest common factor other than 1."}, {"url": "http://www.mathsisfun.com/algebra/factoring.html", "passage_text": "Factoring (called  Factorising  in the UK) is the process of finding the factors : Factoring: Finding what to multiply together to get an expression. It is like splitting an expression into a multiplication of simpler expressions."}, {"url": "http://www.mathsisfun.com/algebra/polynomials.html", "passage_text": "(Yes, even 5 is a polynomial, one term is allowed, and it can even be just a constant!). And these are not polynomials. 1  3xy-2 is not, because the exponent is -2 (exponents can only be 0,1,2,...). 2  2/(x+2) is not, because dividing by a variable is not allowed. 3  1/x is not either."}, {"url": "http://www.mathwarehouse.com/algebra/factor/how-to-factor-trinomials-step-by-step.php", "passage_text": "Examples of Quadratic Trinomials: Non-Examples of Quadratic Trinomials: A trinomial is a polynomial with 3 terms.. This page will focus on quadratic trinomials. The degree of a quadratic trinomial must be '2'. In other words, there must be an exponent of '2' and that exponent must be the greatest exponent."}, {"url": "http://www.themathpage.com/alg/factoring-trinomials.htm", "passage_text": "Problem 3. Factor these trinomials. a) 2 x 2 − 7 x + 5 = (2x − 5)(x − 1). b) 2 x 2 − 11 x + 5 = (2x − 1)(x − 5). c) 3 x 2 + x − 10 = (3x − 5)(x + 2). d) 2 x 2 − x − 3 = (2x − 3)(x + 1). e) 5 x 2 − 13 x + 6 = (5x − 3)(x − 2). f) 5 x 2 − 17 x + 6 = (5x − 2)(x − 3). g) 2 x 2 + 5 x − 3 = (2x − 1)(x + 3)."}, {"url": "http://algebrahelp.com/lessons/factoring/trinomial/", "passage_text": "Factoring A Trinomial Lessons. This lesson explains how to factor trinomials. The process presented is essentially the opposite of the FOIL Method, which is a process used to multiply two binomials. Make sure you understand the FOIL Method lesson first."}, {"url": "http://www.algebra-class.com/polynomials.html", "passage_text": "Polynomials. Welcome to the Algebra 1 Polynomials Unit! This unit is a brief introduction to the world of Polynomials. We will add, subtract, multiply, and even start factoring polynomials. Click on the lesson below that interests you, or follow the lessons in order for a complete study of the unit."}]