[{"url": "http://www.eurekalert.org/pub_releases/2008-08/pn-amv082608.php", "passage_text": "About VYVANSE®. Vyvanse is indicated for the treatment of ADHD. Efficacy based on two controlled trials in children aged 6 to 12 and one controlled trial in adults. Tell the doctor about any heart conditions, including structural abnormalities, that you, your child, or a family member, may have. VYVANSE Has Nationwide Formulary Coverage. Since the availability of VYVANSE a year ago to treat children with ADHD, VYVANSE has achieved a U.S. market share of more than 8 percent based on weekly branded prescription volume, with an average second quarter 2008 market share of 7.4 percent."}, {"url": "http://www.rxlist.com/vyvanse-drug/indications-dosage.htm", "passage_text": "Dosage For Treatment Of ADHD. The recommended starting dose is 30 mg once daily in the morning in patients ages 6 and above. Dosage may be adjusted in increments of 10 mg or 20 mg at approximately weekly intervals up to maximum dose of 70 mg/day. Patients may be maintained on their optimal dose [see Clinical Studies ]. VYVANSE may be administered in one of the following ways: 1  Swallow VYVANSE capsules whole, or. 2  Open capsules, empty and mix the entire contents with yogurt, water, or orange juice. 3  If the contents of the capsule include any compacted powder, a spoon may be used to break apart the powder."}, {"url": "http://www.rxlist.com/vyvanse-drug/indications-dosage.htm", "passage_text": "The recommended starting dose is 30 mg/day to be titrated in increments of 20 mg at approximately weekly intervals to achieve the recommended target dose of 50 to 70 mg/day. The maximum dose is 70 mg/day [see Clinical Studies ]. Discontinue VYVANSE if binge eating does not improve. VYVANSE may be administered in one of the following ways: 1  Swallow VYVANSE capsules whole, or. 2  Open capsules, empty and mix the entire contents with yogurt, water, or orange juice. 3  If the contents of the capsule include any compacted powder, a spoon may be used to break apart the powder."}, {"url": "http://adhd.emedtv.com/vyvanse/vyvanse-dosage.html", "passage_text": "If necessary, the Vyvanse dosage can be increased until the ADHD symptoms are under control, up to a maximum dose of 70 mg once daily in the morning. Vyvanse Dosing for ADHD. The recommended starting Vyvanse dose for treating ADHD in adults, adolescents, and children age 6 to 12 years old is Vyvanse 30 mg once daily in the morning."}, {"url": "http://www.everydayhealth.com/drugs/vyvanse", "passage_text": "Vyvanse (Lisdexamfetamine) Dosage. Vyvanse comes in capsules of 10 milligrams (mg), 20 mg, 30 mg, 40 mg, 50 mg, 60 mg, and 70 mg. A typical starting dose for adults is 30 mg every morning. Your doctor will monitor your results every week or so and may adjust your dose by 10 to 20 mg, depending on your response to it. Vyvanse is the brand name of the prescription drug lisdexamfetamine dimesylate. Vyvanse is used to treat attention deficit hyperactivity disorder (ADHD) in children and adults and binge-eating disorder (BED) in adults."}, {"url": "http://www.rxlist.com/vyvanse-drug/indications-dosage.htm", "passage_text": "Take VYVANSE by mouth in the morning with or without food; avoid afternoon doses because of the potential for insomnia. VYVANSE may be administered in one of the following ways: 1  Swallow VYVANSE capsules whole, or. 2  Open capsules, empty and mix the entire contents with yogurt, water, or orange juice. 3  If the contents of the capsule include any compacted powder, a spoon may be used to break apart the powder."}, {"url": "http://www.md-health.com/Vyvanse.html", "passage_text": "Vyvanse Side Effects. The most common side effects of vyvanse include decreased appetite, found in 39 percent of patients, insomnia in 27 percent, dry mouth in up to 26 percent, stomach or abdominal pain in 12 percent, headaches in up to 12 percent and irritability in up to 10 percent of patients. Vyvanse is the brand name for the drug lisdexamfetamine. This capsule will be taken orally once a day, typically first thing in the morning. You should not take vyvanse with food to ensure that it absorbs properly into your system."}, {"url": "http://adhd.emedtv.com/vyvanse/vyvanse-70-mg-capsules.html", "passage_text": "The usual recommended starting Vyvanse dosage is 30 mg once daily in the morning. If your ADHD symptoms are not controlled with this dose, your healthcare provider may choose to increase your dosage as necessary. The 70 mg capsules are the highest recommended dosage for the treatment of ADHD. "}]