[{"url": "http://www.grownyc.org/recycling/whyrecycle", "passage_text": "Recycling reduces pollution. Burning garbage or throwing waste into landfills produces byproducts that pollute the environment. Runoff from landfills and metals like mercury find their way into streams, rivers and oceans, fish, and eventually into human beings, harming our health. It takes less energy to create new items from recycled materials than it does to create new products from raw materials. Mining minerals and milling trees into lumber requires vast amounts of energy."}, {"url": "http://thegogreenblog.com/is-recycling-good-for-the-environment/", "passage_text": "Recycling has always been encouraged as a way to help the environment, but it also has its downfalls. One problem that many people focus on with recycling are the emissions from the increasing amount of trucks used to pick up recycling. However, this is not an established problem. Another issue of recycling is the amount of energy used. Wood products, petroleum and aluminum all require a lot of energy to refine and reuse, which is why consumption should be reduced. However, when aluminum is bought it is better to recycle it than throw it away."}, {"url": "http://www.calrecycle.ca.gov/Publications/Documents/Economics%5C41004002.pdf", "passage_text": "Q. How is recycling good for the environment? A. Each year recycling:• Saves enough energy to power 1.4 million California homes.• Reduces water pollution by 27,047 tons. • Saves 14 million trees. A large, growing part of that sector is recycling and recycling-related businesses. The ability to bring new life to used materials has become more than just good environmental stewardship; it has become big business."}, {"url": "http://www.conserve-energy-future.com/Importance_of_Recycling.php", "passage_text": "Recycling is important in today’s world if we want to leave this planet for our future generations. It is good for the environment, since we are making new products from the old products which are of no use to us. Recycling begins at home. If you are not throwing away any of your old product and instead utilizing it for something new then you are actually recycling."}, {"url": "http://www.socrra.org/recycling_top10.shtml", "passage_text": "1 Good for the Environment: Recycling requires far less energy, uses fewer natural resources, and keeps waste from piling up in landfills. 2  Reduces Waste: The average American discards seven and half pounds of garbage every day. 3  Most of this garbage goes into landfills, where it is compacted and buried. Top 10 Reasons to Recycle. 1  Good for the Environment: Recycling requires far less energy, uses fewer natural resources, and keeps waste from piling up in landfills."}, {"url": "http://science.howstuffworks.com/environmental/green-science/recycling-impact-community.htm", "passage_text": "Lots of people consider recycling to be kind of a no-brainer, something we all should do. It’s good for the environment, it re-uses materials rather than creates new ones, it reduces landfills -- the list goes on and on. But one major benefit that people often overlook is the impact recycling programs can have on a community. For one thing, recycling programs encourage people to (you guessed it) recycle. "}, {"url": "http://www.socrra.org/recycling_top10.shtml", "passage_text": "Reduce, Reuse, Recycle! 1  Good for the Environment: Recycling requires far less energy, uses fewer natural resources, and keeps waste from piling up in landfills. Top 10 Reasons to Recycle. 1  Good for the Environment: Recycling requires far less energy, uses fewer natural resources, and keeps waste from piling up in landfills."}, {"url": "http://www.grownyc.org/recycling/whyrecycle", "passage_text": "Recycling is good for the environment. It takes less energy to create new items from recycled materials than it does to create new products from raw materials. Mining minerals and milling trees into lumber requires vast amounts of energy."}, {"url": "http://www.knowswhy.com/why-is-recycling-good-for-the-environment/", "passage_text": "Importance of Recycling: The importance of recycling can be understood from the following applications and their advantages: 1  Recycling is the basic component of the circular development model. 2  Recycling aims that no wastes shall be used for land-filling or burnt. 3  Recycling can overcome the bad effects of industrial and greenhouse gasses. 4  The advantages associated with ... "}]