[{"url": "http://www1.agric.gov.ab.ca/$department/deptdocs.nsf/all/pou3651", "passage_text": "For every additional 45 grams in body weight at 18 weeks of age, the egg size increases 0.5 grams. In addition, underweight pullets usually do not have the skeletal frame necessary to maintain good egg shell quality after 40 weeks of age. Underweight pullets tend to be underweight as layers."}, {"url": "http://www.gov.mb.ca/agriculture/livestock/production/poultry/egg-size-and-your-small-flock-of-laying-hens.html", "passage_text": "1 Hen body weight is the key to increased egg size. 2  Bigger hens produce larger eggs than smaller hens and bigger breeders produce larger eggs than smaller breeders. 3  For modern White Leghorns, rearing pullets that weigh at least 1.35 kg (3.0 lbs.) at the start of egg production will increase both hen weight an"}, {"url": "http://articles.submityourarticle.com/increasing-egg-production-from-backyard-chickens-198155", "passage_text": "In terms of numbers, 4-5 hens will supply 2-4 eggs daily. Young females (pullets) start producing eggs when around 5 to 7 months of age, but expect the early eggs to be on the small side. A small flock of 6 to 8 chickens can provide a family of four with plenty of eggs and an occasional fresh chicken dinner."}, {"url": "http://www.gov.mb.ca/agriculture/livestock/production/poultry/egg-size-and-your-small-flock-of-laying-hens.html", "passage_text": "No laying hen, however, can meet the ideal standard of laying a Large egg everyday. All hens start egg production laying Pee Wee or Small eggs and gradually increase to a mature egg grade size of Medium, Large or bigger. In modern breeds, most hens are laying Large, Extra Large or Jumbo eggs by 40 weeks of age."}, {"url": "http://www.chickenkeepingsecrets.com/keeping-chickens/identifying-the-age-chickens/", "passage_text": "Most breeds start laying between 5 and 6 months of age. The eggs are wonky for a little while; you may get eggs that have no shell or have a very soft shell. The eggs usually start out small and slowly increase in size. The frequency will also be unpredictable."}, {"url": "http://edis.ifas.ufl.edu/ps029", "passage_text": "The laying cycle of a chicken flock usually covers a span of about 12 months. Egg production begins when the birds reach about 18-22 weeks of age, depending on the breed and season. Flock production rises sharply and reaches a peak of about 90%, 6-8 weeks later. Production then gradually declines to about 65% after 12 months of lay. A typical production curve for a laying flock, showing changes in the level of egg production and in egg weight, over time, is given in Figure 1."}]