[{"url": "http://www.rxlist.com/tylenol-codeine-drug/indications-dosage.htm", "passage_text": "15 mg to 60 mg. 360 mg. Acetaminophen. 300 mg to 1000 mg. 4000 mg. Doses may be repeated up to every 4 hours. The prescriber must determine the number of tablets per dose, and the maximum number of tablets per 24 hours, based upon the above dosage guidance. This information should be conveyed in the prescription"}, {"url": "http://emedicine.medscape.com/article/820200-overview", "passage_text": "Maximum acetaminophen dosages. Historically, the maximum daily adult dose of acetaminophen is 4 g, with a recommended dosage of 352-650 mg every 4-6 hours or 1 g every 6 hours. In 2012, dosage recommendations changed the maximum daily dose for adults to 3 g, with no more than 650 mg every 6 hours, as needed. Toxic acetaminophen dosages. In adults, an acute ingestion of more than 150 mg/kg or 12 g of acetaminophen is considered a toxic dose and poses a high risk of liver damage. In children, acute ingestion of 250 mg/kg or more poses significant risk for acetaminophen-induced hepatotoxicity."}, {"url": "http://www.rxlist.com/tylenol-drug/indications-dosage.htm", "passage_text": "b. For adults and children 12 years of age and older, the recommended dose of acetaminophen is 650 to 1000 mg every 4 to 6 hours as needed, not to exceed 4000 mg in 24 hours (Table 2). For extended-release acetaminophen, the dose is 1300 mg every 8 hours as needed, not to exceed 3900 mg in 24 hours. Some adult products (Extra Strength TYLENOL (acetaminophen) , TYLENOL (acetaminophen) Arthritis Extended Relief Formula) are not intended for use in children under 12 years of age. For children under 12 years of age, the recommended dose of acetaminophen is 10 to 15 mg/kg every 4 to 6 hours, 47 not to exceed five doses (50-75 mg/kg) in 24 hours (Table 3)."}, {"url": "http://www.fda.gov/Drugs/DrugSafety/InformationbyDrugClass/ucm165107.htm", "passage_text": "Acetaminophen is an active ingredient in hundreds of over-the-counter (OTC) and prescription medicines. It relieves pain and fever. And, it is also combined with other active ingredients in medicines that treat allergy, cough, colds, flu, and sleeplessness. "}, {"url": "https://en.wikipedia.org/wiki/Paracetamol", "passage_text": "The common adult dose is 500 mg to 1000 mg. The recommended maximum daily dose, for adults, is 4000 mg. In recommended doses, paracetamol is generally safe for children and infants, as well as for adults, although rare cases of acute liver injury have been linked to amounts lower than 2500 mg per day. Paracetamol, also known as acetaminophen or APAP, is a widely used over-the-counter pain medication and medication to reduce fever."}, {"url": "http://www.getreliefresponsibly.com/acetaminophen-dosage/adults", "passage_text": "Acetaminophen Dosage for Adults. Today, there are more than 600 medicines that contain acetaminophen: TYLENOL®, NyQuil®, Percocet®, and Vicodin®, to name just a few. Many people don’t realize that taking more than one medicine with acetaminophen at the same time could harm their liver"}, {"url": "http://www.mayoclinic.org/drugs-supplements/hydrocodone-and-acetaminophen-oral-route/proper-use/DRG-20074089", "passage_text": "1 For oral dosage form (7.5 mg per 325 mg tablets): 2  Adults—. 3  Lortab®: One tablet every 4 to 6 hours as needed. 4  Your doctor may increase your dose as needed. 5  However, the dose is usually not more than 6 tablets per day. 6  Generic: Dose depends on the strength of the tablet and must be determined by your doctor. 1 Your doctor may increase your dose as needed. 2  However, the dose is usually not more than 60 mL (12 teaspoonfuls) per day. 3  Children 7 to 9 years of age and weighing 23 to 31 kg—7.5 mL (1 and 1/2 teaspoonfuls)"}]