[{"url": "http://www.hse.ie/eng/services/Publications/corporate/ultrasounddiagnosisofearlypregnancymiscarriage.pdf", "passage_text": "A repeat scan in 7 to 10 days should clarify whether the pregnancy is healthy or not. 2) It is also possible that the pregnancy is not growing as it should and the bleeding may be a sign of an impending miscarriage."}, {"url": "http://www.hse.ie/eng/services/Publications/corporate/ultrasounddiagnosisofearlypregnancymiscarriage.pdf", "passage_text": "CLINICAL PRACTICE GUIDELINE ULTRASOUND DIAGNOSIS OF EARLY PREGNANCY MISCARRIAGE 16 A 2.3 Patient Information Leaflet Miscarriage – What Happens Next? The loss of a pregnancy can be a sad and distressing experience but it is not uncommon. It is estimated that up to 20% of pregnancies ends in a miscarriage."}, {"url": "http://www.glowm.com/section_view/heading/The%20Diagnosis%20of%20Pregnancy/item/93", "passage_text": "Fetal cardiac activity can be seen by 6 menstrual weeks’ gestation, and the fetal brain can be seen by 8 weeks. The crown–rump length can be used accurately to assess gestational age within 4 days up to approximately 12 weeks. Implantation, or the process by which the embryo comes in contact with, adheres to, and penetrates the endometrium, is necessary prior to the diagnosis of pregnancy."}, {"url": "http://www.nhs.uk/news/2015/09September/Pages/Doctors-should-wait-longer-before-diagnosing-miscarriage.aspx", "passage_text": "Doctors are being advised to wait longer before they diagnose a miscarriage, The Guardian reports. A new study has found evidence to suggest that women should be given a second ultrasound scan, two weeks after the first, to confirm the diagnosis."}, {"url": "http://www.hse.ie/eng/services/Publications/corporate/ultrasounddiagnosisofearlypregnancymiscarriage.pdf", "passage_text": "CLINICAL PRACTICE GUIDELINE ULTRASOUND DIAGNOSIS OF EARLY PREGNANCY MISCARRIAGE 18 A 2.5 Information on miscarriage A miscarriage is a common event. It is an experience, however, that affects each woman and her partner differently."}, {"url": "http://americanpregnancy.org/prenatal-testing/ultrasound/", "passage_text": "Ultrasound dating of conception is not reliable for determining paternity because the ultrasound can be off by at least 5-7 days in early pregnancy. You may have an ultrasound between 18 to 20 weeks to evaluate dates, a multiples pregnancy, placenta location or complications."}, {"url": "http://americanpregnancy.org/pregnancy-complications/early-fetal-development/", "passage_text": "Hormones. The hCG levels will peak at about 8-12 weeks of pregnancy and then will decline, remaining at lower levels throughout the remainder of the pregnancy. If the levels are questionable, an ultrasound scan should be used to diagnose the pregnancy outcome."}, {"url": "http://www.womensdocs.com/lib/pdf/First_Trimester/Ultrasound_in_Pregnancy.pdf", "passage_text": "• Presence of more than one baby. • Age of the fetus: The size of the fetus, measured using ultrasound, helps health care providers estimate the due date. This is most accurate in the first half of pregnancy. • Certain birth defects: Ultrasound can be used to diagnose certain birth defects such as spina bifida."}]