[{"url": "http://history-world.org/sumerian_language.htm", "passage_text": "During this time the Sumerians lost their political identity, and Sumerian gradually disappeared as a spoken language. It did, however, continue to be written to the very end of the use of cuneiform writing. This is the last stage of the Sumerian language, called Post-Sumerian. In the early stages of the Post-Sumerian period the use of written Sumerian is extensively attested in legal and administrative texts, as well as in royal inscriptions, which are often bilingual, in Sumerian and Babylonian. "}, {"url": "http://www.omniglot.com/writing/sumerian.htm", "passage_text": "Sumerian was spoken in Sumer in southern Mesopotamia (part of modern Iraq) from perhaps the 4th millennium BC until about 2,000 BC, when it was replaced by Akkadian as a spoken language, though continued to be used in writing for religious, artistic and scholarly purposes until about the 1st century AD. Sumerian cuneiform is the earliest known writing system. Its origins can be traced back to about 8,000 BC and it developed from the pictographs and other symbols used to represent trade goods and livestock on clay tablets."}, {"url": "http://www.answers.com/Q/What_was_the_sumerians_written_language_called", "passage_text": "The Sumerians spoke a language we now call Sumerian, but which they themselves referred to as eme-ĝir. The word eme means tongue, and ĝir has been variously translated as p … rincely or simply native. The Sumerian language is a language isolate, which means that it is not related to any other known language. It can be described linguistically as an agglutinative language with ergative/absolutive case alignment (see related links for definitions). 11 people found this useful."}, {"url": "http://www.ancient.eu/sumer/", "passage_text": "Sumer was the southernmost region of ancient Mesopotamia (modern-day Iraq and Kuwait) which is generally considered the cradle of civilization. The name comes from Akkadian, the language of the north of Mesopotamia, and means “land of the civilized kings”. "}, {"url": "https://www.khanacademy.org/humanities/ancient-art-civilizations/ancient-near-east1/sumerian/a/the-sumerians-and-mesopotamia", "passage_text": "Menu dropdown. To log in and use all the features of Khan Academy, please enable JavaScript in your browser. The ancient Sumerians, the black-headed ones, lived in the southern part of what is now Iraq. The heartland of Sumer lay between the Euphrates and Tigris rivers, in what the Greeks later called Mesopotamia. "}, {"url": "http://www.omniglot.com/writing/sumerian.htm", "passage_text": "Sumerian is not related to any other known language so is classified as a language isolate. Sumerian cuneiform is the earliest known writing system. Its origins can be traced back to about 8,000 BC and it developed from the pictographs and other symbols used to represent trade goods and livestock on clay tablets."}, {"url": "https://en.wikipedia.org/wiki/Sumerian_language", "passage_text": "Sumerian (𒅴𒂠 EME.G̃IR15  native tongue ) is the language of ancient Sumer and a language isolate which was spoken in northern Mesopotamia (modern Iraq). During the 3rd millennium BC, a very intimate cultural symbiosis developed between the Sumerians and the Akkadians, which included widespread bilingualism. Archaic Sumerian is the earliest stage of inscriptions with linguistic content, beginning with the Jemdet Nasr (Uruk III) period from about the 31st to 30th centuries BC. It succeeds the proto-literate period, which spans roughly the 35th to 30th centuries."}, {"url": "https://en.wikipedia.org/wiki/Sumerian_language", "passage_text": "The Sumerian language is one of the earliest known written languages. The proto-literate period of Sumerian writing spans c. 3,300 to 3,000 BC. In this period, records are purely logographic, with no linguistic or phonological content. The oldest document of the proto-literate period is the Kish tablet. Archaic Sumerian is the earliest stage of inscriptions with linguistic content, beginning with the Jemdet Nasr (Uruk III) period from about the 31st to 30th centuries BC. It succeeds the proto-literate period, which spans roughly the 35th to 30th centuries."}, {"url": "http://www.halexandria.org/dward183.htm", "passage_text": "Sumerian. The Sumerian speaking people settled in the land they called Sumer, in a region of the Fertile Crescent that lay along the southern portions of the valley of the Euphrates and Tigris Rivers."}]