[{"url": "https://www.wyzant.com/resources/lessons/science/chemistry/electron_configuration", "passage_text": "Each electron can either have a +1/2 spin or a -1/2 spin, which indicates its direction of motion. There is never a 0 spin. When filling orbitals, electrons spin in pairs, one + and one -. The electrons with an up (+) spin fill first, and the electrons with a down (-) spin fill second."}, {"url": "http://chemistry.about.com/od/chemistryglossary/a/electrondef.htm", "passage_text": "Electron Definition: An electron is a negatively charged component of an atom. Electrons exist outside of and surrounding the atom nucleus. Each electron carries one unit of negative charge and has a very small mass as compared with that of a neutron or proton. By Anne Marie Helmenstine, Ph.D."}, {"url": "http://www.ivyroses.com/Chemistry/GCSE/What-is-an-electron.php", "passage_text": "1 The number of electrons in an atom is the same as the number of protons in the atom. 2  That is because atoms are charge neutral, and protons have a charge of +1 while electrons have a charge of -1 so there must be the same number of each in order for the whole atom to be charge neutral."}, {"url": "http://chemistry.about.com/od/chemistryglossary/g/valence-electron-definition.htm", "passage_text": "Share. By Todd Helmenstine. Valence Electron Definition: A valence electron is an electron that is the most likely to be involved in a chemical reaction. They are typically the electrons with the highest value of the principle quantum number, n."}, {"url": "http://chemistry.about.com/od/chemistryglossary/a/electrondef.htm", "passage_text": "Share. Electron Definition: An electron is a negatively charged component of an atom. Electrons exist outside of and surrounding the atom nucleus. Each electron carries one unit of negative charge and has a very small mass as compared with that of a neutron or proton. By Anne Marie Helmenstine, Ph.D."}, {"url": "http://www.ivyroses.com/Chemistry/GCSE/What-is-an-electron.php", "passage_text": "An electron is a subatomic particle that has a negative charge of -1 and is located in the volume of atoms around the nucleus (so not in the nucleus itself) Electrons have no known components or substructure and are therefore generally considered to be elementary particles. 1  Electrons exist in the volume of atoms that surrounds the nucleus (see the diagram of an atom, on the right) and. 2  in the. 3  of atoms-which is where the protons and neutrons are located."}, {"url": "http://antoine.frostburg.edu/chem/senese/101/electrons/glossary.shtml", "passage_text": "A single electron occupying an orbital. valence electron. Electrons that can be actively involved in chemical change; usually electrons in the shell with the highest value of n. For example, sodium's ground state electron configuration is 1s 2 2s 2 2p 6 3s 1; the 3s electron is the only valence electron in the atom."}]