[{"url": "http://forums.usms.org/showthread.php?11239-How-much-do-Pro-swimmers-make", "passage_text": "As I understand, Phelps can make around $10,000 for an appearance at corporate events, swim expo's, etc. I also remember that a company (might have been Visa) was offering $1,000,000 bonus if he get Spitz's record of gold medals-naturally in addition to the already large endorcement deal. I have heard (with no data though) that Phelps is in 7 figures. But that includes Speedo, Visa, and a few others. My guess is most of the pros are like Vendt. They can make a reasonable living."}, {"url": "http://fortune.com/2012/05/29/rich-sport-u-s-olympic-swimmers-float-on-cash/", "passage_text": "For professional swimmers, this means both lucrative sponsorship and a deep-pocketed support organization — USA Swimming raises about $100 million a year, from its nearly 300,000 members’ registration fees, taking a share of about a sixth of that money for its own revenue. "}, {"url": "http://www.answers.com/Q/How_much_money_do_Olympic_swimmers_make_a_year", "passage_text": "South Dakota had the lowest teacher salary at $34,039. 50,000 a year for first 5 years then ranges up to 65,000 How much money a teacher can make depends on their experience,  where they teach, and the state in which they teach. … it depends on how many years they have been teaching. The average of a first year teacher is $43,000   The American Federation of Teachers issues a Teacher Salary Trends report each year to survey the pay levels of U.S. educators."}, {"url": "http://www.allaboutcareers.com/careers/job-profile/swimmer", "passage_text": "Salary & benefits. Professional swimmers do not earn a salary: they make money through sponsorship, endorsements and prize money. Some world-record breaking swimmers, such as Michael Phelps, earn millions of pounds through endorsements, although this is very rare. In fact, very few people are able to make a living purely through swimming"}, {"url": "https://answers.yahoo.com/question/index?qid=20061128110214AAfyX0O", "passage_text": "International level swimmers earn money through sponsorships (i.e., Speedo pays them for wearing Speedo gear and gives them free gear), endorsements (i.e., representing Speedo at events and on tv) and for doing advertisements (i.e. being on the Wheaties box and being in commericals). Professional swimmers are the kind of people who train for the olympics. I m no sure how much professional swimmers earn but its probably the money from sponsorships. Natascia · 6 months ago."}, {"url": "http://www.kaycircle.com/How-much-does-a-Professional-Swimmer-make-per-Year-Average-Annual-Pro-Olympic-Swimmer-Salary-Range", "passage_text": "Recently, swimming has been climbing the ranks of the Olympic games, earning increasingly higher positions of prominence in the eyes of the spectators. Ever wonder what sort of salary these swimmers make? The average annual pay for a professional swimmer is $27,000. The range in salary lies between $17,000 and $97,000. Salary is tied to skill as well as sponsorship. "}, {"url": "http://forums.usms.org/showthread.php?11239-How-much-do-Pro-swimmers-make", "passage_text": "Greetings I was reading the thread on the age of male swimmers and the mention of the pro status made me wonder how much these men and women actually make. I have heard (with no data though) that Phelps is in 7 figures. But that includes Speedo, Visa, and a few others. My guess is most of the pros are like Vendt. They can make a reasonable living."}, {"url": "http://www.moneyunder30.com/how-much-do-olympic-athletes-earn-unless-youre-michael-phelps-not-enough", "passage_text": "And, in addition to regular sponsorships, the swimwear outfit paid Phelps $1 million for breaking the 1972 record for seven gold medals in a single Olympics. He used the money to start a charity. All U.S. athletes can also earn a “medal bonus” from the U.S. Olympic committee for each medal won. The Committee pays American medal winners $25,000 for gold, $15,000 for silver, and $10,000 for bronze medals. Some countries, though not all, pay athletes similar medal bonuses. "}, {"url": "https://answers.yahoo.com/question/index?qid=20061128110214AAfyX0O", "passage_text": "There is such thing as a competitive swimmer, i am one myself. Professional swimmers are the kind of people who train for the olympics. I m no sure how much professional swimmers earn but its probably the money from sponsorships. Natascia · 6 months ago."}, {"url": "http://www.usaswimming.org/DesktopDefault.aspx?TabId=1502", "passage_text": "USA Swimming is made up of 400,000 swimmers. From big to small, fast to not-so-fast, the world of swimming is a fun, competitive, healthy world. From the 8-year-old working toward their first swim meet to the 22-year-old heroes on the blocks at the Olympic Games, USA Swimming athletes come in all shapes and sizes."}]