[{"url": "http://www.healthcare-salaries.com/nursing/nurse-practitioner-salary", "passage_text": "The nurse practitioner salary in the US ranges between $67,416 and $110,485. According to PayScale, the salary of nurse practitioner with less than a year’s experience is from $57,252 to $97,978, while one with a year to four years of experience is paid a salary ranging between $61,809 and $97,609. Nurse practitioner’s salary (shortly known as NP salary) is the United States is ranging from $81,310 to $103,310 per year. A nurse practitioner is a registered nurse who has already attained a master’s or a doctoral."}, {"url": "http://work.chron.com/much-nurse-practitioner-paid-per-hour-6193.html", "passage_text": "A nurse practitioner with less than five years of experience earned an average of $40.84, while a nurse practitioner with 20 years or more of experience earned $42.56. Male nurse practitioners earned considerably more, at $48.23 an hour. Region and Work Setting. The average hourly wage in the West in 2012 was $44.88 based on a standard 40-hour work week, according to The Clinical Advisor. Nurse practitioners in the Northeast averaged $44.93 an hour, those in the South averaged $42,68 and those in the Midwest earned an average of $41.14 an hour."}, {"url": "http://www.collegeatlas.org/nurse-salaries.html", "passage_text": "Nurses with 10 to 19 years of neonatal nursing experience earn high annual salaries, averaging between $80,901 and $104,313 per year. The most experienced neonatal nurse practitioners, 20 or more years of work experience, on average earn more than $111,000 per year. As of 2011, the average median nursing salary for those specializing in hospice care exceeded $65,000 per year. Hospice nurses providing home care with salaries in the upper 10th percentile earn more than $77,000 per year. Hospice nurses practicing in New York City earn the highest salaries, averaging $77,810 annually."}, {"url": "http://www.collegeatlas.org/nurse-salaries.html", "passage_text": "Nurse practitioners are among the highest paid of all nursing professionals. Annual salaries for nurse practitioners increase as they gain relevant work experience. In 2010, median annual salaries for nurse practitioners with one year or less of experience was between $59,369 and $75,812 per year. Once they acquired at least five years of experience nurse practitioners earned between $70,898 and $88,435 annually. As of 2011, the average median nursing salary for those specializing in hospice care exceeded $65,000 per year. Hospice nurses providing home care with salaries in the upper 10th percentile earn more than $77,000 per year. Hospice nurses practicing in New York City earn the highest salaries, averaging $77,810 annually."}, {"url": "http://www.hospitaljobsinc.com/how-much-does-a-nurse-practitioner-make/", "passage_text": "For nurse anesthetists, the annual median salary is $158,900 or $76.40 per hour. A nurse practitioner can expect an average annual salary of $97,990 or $47.11 dollars per hour as stated above. Nurse midwives earn an average annual salary of $97,700 or around $46.97 dollars per hour. According to the Bureau of Labor Statistics (BLS), the median annual salary for a nurse practitioner was around $97,990 or about $47.11 dollars per hour in 2014."}, {"url": "http://www.nursepractitionerssalaries.com/", "passage_text": "An oncology nurse practitioner has a salary whose average annual value is between $70,000 (for less than one year of experience) and $100,000 (for more than 20 years of practice). The dermatology nurse practitioner salary is, on average, around $100,000 per year. The average salary of the orthopedic nurse practitioner is, in the US, around $80,000 per annum. The geriatric nurse practitioner’s salary is also very high: about $95,000 per year, on average. The pediatric nurse practitioner pay offered in the United States is, on average, of about $90,000 per year. The mean annual wage of the neonatal NP is between $70,000 and $90,000. The ob/gyn (obstetrics/gynecology) nurse practitioners can earn, in the US, a mean yearly wage between $60,000 and $120,000"}, {"url": "http://work.chron.com/much-nurse-practitioner-paid-per-hour-6193.html", "passage_text": "Nurse Practitioner Salaries. Salaries for nurse practitioners can vary widely, depending on factors such as the specialty or location. Job postings on Indeed.com show the annual income of a nurse practitioner as of June 2012 ranged from $52,000 to $122,000. If the nurse practitioner worked a standard 40-hour week, those salaries would translate to $58.65 and $25.00 an hour, respectively. The average nurse practitioner salary as of June 2012 was $95,000, or $45.67 an hour, according to Indeed.com. Region and Work Setting. The average hourly wage in the West in 2012 was $44.88 based on a standard 40-hour work week, according to The Clinical Advisor. Nurse practitioners in the Northeast averaged $44.93 an hour, those in the South averaged $42,68 and those in the Midwest earned an average of $41.14 an hour."}, {"url": "http://www.healthcare-salaries.com/nursing/nurse-practitioner-salary", "passage_text": "Based on the type of employer, the nurse practitioner’s salary in a hospital ranges between $63,199 and $108,333. Those working in state and local government earn between $55,000 and $111,711 annually. Nurse practitioners employed by federal government make between $67,686 and $130,893 per year. Nurse practitioner’s salary (shortly known as NP salary) is the United States is ranging from $81,310 to $103,310 per year. A nurse practitioner is a registered nurse who has already attained a master’s or a doctoral."}, {"url": "http://www.nursepractitionerschools.com/faq/how-much-does-np-make", "passage_text": "Starting Salary for Nurse Practitioners. The BLS lists the nurse practitioner salary in the lowest 10 percent as being $66,960, still well above the nationwide average. At the other end, in the highest 10 percent, the nurse practitioner salary can reach as high as $126,250, which equates to pay of $60.69 an hour."}]