[{"url": "https://en.wikipedia.org/wiki/B%C3%ADo_B%C3%ADo_Region", "passage_text": "According to data from the 2002 census, the Region of the Bio Bío, bio 1,861,562 with, 1861562 inhabitants is the second most populous Region, of chile After The metropolitan Region. of santiago In connection with the 1992 census, reflecting a total population of 1,734,305 inhabitants, there was a population growth of 7.3% in 10 years (1992–2002), the second lowest nationally, after the Region Magallanes and Chilean Antarctica."}, {"url": "https://en.wikipedia.org/wiki/Santiago_Metropolitan_Region", "passage_text": "Santiago Metropolitan Region or simply Metropolitan Region (Spanish: Region Región metropolitana De) santiago is one Of 'chile s 15-first order administrative. Divisions it is the'country s only landlocked administrative region and contains the'nation s, Capital. santiago Metropolitana is Chile's only landlocked region and lies in the Intermediate Depression valley between the Chilean Coast Range and the Andes mountains."}, {"url": "http://www.populationlabs.com/Chile_Population.asp", "passage_text": "Most Populated Cities Chile. The above Chile Population Map displays top ten populated cities of Chile. Below is the list of most populated cities in Chile. 1 The map also plots and displays the top 10 most populated cities in Chile as per their rank. 2  Please note that the ranks of the most populated cities in Chile are as per the population data of cities in Chile available with us. 3  It might be different with current population."}, {"url": "http://worldpopulationreview.com/countries/chile-population/", "passage_text": "Santiago, the capital, is the largest city. The city/urban population is 308,000, but the Santiago Metropolitan Region has more than 6 million inhabitants, representing the most populated and most densely populated region in Chile. The official 2012 estimate placed Chile's population at 17.4 million. Chile's population is estimated to have grown in 2013 to 17,643,916, and in 2015 to 17.9 million, which makes it the 61st most populous country on earth."}, {"url": "http://worldpopulationreview.com/countries/chile-population/", "passage_text": "Much of the population of Chile is concentrated in the Santiago Metropolis, which is also the most densely populated region. The city of Santiago has 8,470 people per square kilometer (21,925/square mile). The official 2012 estimate placed Chile's population at 17.4 million. Chile's population is estimated to have grown in 2013 to 17,643,916, and in 2015 to 17.9 million, which makes it the 61st most populous country on earth."}, {"url": "http://worldpopulationreview.com/countries/chile-population/", "passage_text": "Chile is now the 61st most populous country, and the 6th most populous country in South America (after Brazil, Colombia, Argentina, Peru and Venezuela), with an estimated 2015 population of 17.9 million. The official 2012 estimate placed Chile's population at 17.4 million. Chile's population is estimated to have grown in 2013 to 17,643,916, and in 2015 to 17.9 million, which makes it the 61st most populous country on earth."}, {"url": "https://en.wikipedia.org/wiki/B%C3%ADo_B%C3%ADo_Region", "passage_text": "With regard to the Province of Arauco, the most populated cities are: Curanilahue with 30.126 inhabitants, Lebu, the provincial capital, with 20.838 inhabitants, with 19.839 inhabitants Canete, Arauco with 16.291 inhabitants, and Los Alamos with 13035 inhabitants. In connection with the 1992 census, reflecting a total population of 1,734,305 inhabitants, there was a population growth of 7.3% in 10 years (1992–2002), the second lowest nationally, after the Region Magallanes and Chilean Antarctica."}, {"url": "https://en.wikipedia.org/wiki/Santiago_Metropolitan_Region", "passage_text": "Santiago Metropolitan Region or simply Metropolitan Region (Spanish: Region Región metropolitana De) santiago is one Of 'chile s 15-first order administrative. divisions Metropolitana is Chile's only landlocked region and lies in the Intermediate Depression valley between the Chilean Coast Range and the Andes mountains."}, {"url": "http://www.answers.com/Q/What_is_the_most_populated_region_in_Chile", "passage_text": "Which region in Georgia is the most populated? In the Republic of Georgia the greatest population is located in  and around the capital city of Tbilisi (2012 population: 1 473 551.  2000 people/square kilometer)."}]