[{"url": "http://www.theweedblog.com/the-difference-between-indica-and-sativa-marijuana-plants/", "passage_text": "Sativa and Indica are the two major types of cannabis plants which can mix together to create hybrid strains. Each strain has its own range of effects on the body and mind resulting in a wide range of medicinal benefits. Indica plants typically grow short and wide, compared to Sativa plants which grow tall and thin. Indica plants are better suited for indoor growing because of their short growth and sativa plants are better suited for outdoor growing because some strains can reach over 25 ft. in height. You can see in the photos above Sativa plants tend to be significantly large while Indica plants are shorter and wider. Indicas are very effective for overall pain relief and is often used to treat insomnia for many people."}, {"url": "http://www.theweedblog.com/the-difference-between-indica-and-sativa-marijuana-plants/", "passage_text": "Image of a Sativa and Indica cannabis plant side-by-side (Sativa plant on the left, Indica plant in the middle, the mostly benign Ruderalis on the left): image via mmj-guide.com. You can see in the photos above Sativa plants tend to be significantly large while Indica plants are shorter and wider. Indicas are very effective for overall pain relief and is often used to treat insomnia for many people."}, {"url": "http://grow-marijuana.com/sativa", "passage_text": "Sativa. Sativa strains are characterised by their tall, rangy plant structure and their long-finger like fan leaves. Sativa strains have been known to reach the soaring heights of 25ft (7.5m) when grown outdoors however they generally grow to around 8ft (2.5m) as a norm. Sativa strains take slightly longer to mature than indica strains and produce higher levels of THC and lower levels of CBD. This provides growers with a different option in terms of taste and high with sativa weed providing an uplifting, energetic, often cerebral high."}, {"url": "http://www.buydutchseeds.com/knowledgebase/What_does_Indica_Ruderalis_and_Sativa_mean.html", "passage_text": "Sativa. These are marijuana plants that are described as lanky and wide. The shape of a sativa plant is similar to that of a Christmas tree. Compared to indica, the sativa plant varieties usually have higher THC but lower CBD properties. As a result they provide a cerebral effect producing an energetic buzz, which makes you sociable, happy and trippy. Ruderalis. The ruderalis are cannabis plants that are stocky and short. This type of marijuana plant usually grows in Central Asia and in Europe. The ruderalis varieties do not depend on the light cycles during their flowering period. This is why the strains that are autoflowering contain ruderalis genes"}, {"url": "https://en.wikipedia.org/wiki/Cannabis_sativa", "passage_text": "Cannabis sativa is an annual herbaceous plant in the Cannabis genus, a species of the Cannabaceae family. People have cultivated Cannabis sativa throughout recorded history as a source of industrial fibre, seed oil, food, recreation, religious and spiritual moods, and medicine. Each part of the plant is harvested differently, depending on the purpose of its use. The species was first classified by Carolus Linnaeus in 1753."}, {"url": "http://www.audioenglish.org/dictionary/cannabis_sativa.htm", "passage_text": "• CANNABIS SATIVA (noun). The noun CANNABIS SATIVA has 1 sense: 1. a strong-smelling plant from whose dried leaves a number of euphoriant and hallucinogenic drugs are prepared. Familiarity information: CANNABIS SATIVA used as a noun is very rare."}, {"url": "http://www.urbandictionary.com/define.php?term=sativa", "passage_text": "A Sativa is a type of marijuana/plant that will typically produce a euphoric, energetic, cerebral high. and is very hard to grow indoors. Sativa. A type of marijuana plant that usually presents the best end results. Sativa plants are the females. They are identified by their longer thiner more pointy leaves. The sativa or female is the plant that will usually produce the best bud. It is seedless and exceptional."}, {"url": "http://patientsmarijuana.org/Sativa_or_Indica.html", "passage_text": "Leaving us with 2 main cannabis strains and that is Sativa and Indica. Sativa Sativas and Indicas are very different, like night and day. They are tall, thin plants, with much narrower leaves and grow a lighter green in color. They grow very quickly and can reach heights of 20 feet in a single season. "}, {"url": "https://en.wikipedia.org/wiki/Sativa", "passage_text": "Sativum, Sativus, and Sativa are Latin botanical adjectives meaning cultivated, used to designate certain seed-grown domestic crops. Sativa (ending in-a) is the feminine form of the adjective, but masculine (-us) and neuter (-um) endings are also used to agree with the gender of the nouns they modify. For example, the masculine Crocus sativus and neuter Pisum sativum."}, {"url": "http://www.themedicalquestions.com/drug/what-does-the-strain-of-marijuana-sativa-do-to-you.html", "passage_text": "What does the strain of marijuana sativa do to you. They give a feeling of optimism and well-being, as well as providing a good measure of pain relief for certain symptoms. But aside from that, a sativa high makes you feel much more active then a Indica high. It can normally be felt in the head and around the eyes and makes your mind wonder. Indica mostly just knocks you on your @ss, when the high hits you it spreads throughout your body and you get sensations all throughout your body."}]