[{"url": "https://en.wikipedia.org/wiki/Psychedelic_drug", "passage_text": "The term psychedelic is derived from the Greek words ψυχή (psyche, soul, mind) and δηλείν (delein, to manifest), hence soul-manifesting, the implication being that psychedelics can access the soul and develop unused potentials of the human mind. A psychedelic substance is a psychoactive drug whose primary action is to alter cognition and perception, typically by agonising serotonin receptors."}, {"url": "https://quizlet.com/11829879/drug-final-quiz-6-flash-cards/", "passage_text": "Reload the page to try again! Press Cmd-0 to reset your zoom. Press Ctrl-0 to reset your zoom. It looks like your browser might be zoomed in or out. Your browser needs to be zoomed to a normal size to record audio. by the beginning of the 20th century a greater % of Americans were dependent on opioids that at any time before or since. opium smoking and medical use of injuected pure morphine were important contributors to this along with patent medicines containing opium extract or morphine"}, {"url": "https://www.psychologytoday.com/conditions/hallucinogens", "passage_text": "LSD is the abbreviation of the German words for lysergic acid diethylamide. It is the drug most commonly identified with the term hallucinogen and the most widely used in this class of drugs. It is considered the typical hallucinogen, and the characteristics of its action and effects apply to other hallucinogens. All LSD manufactured in this country is intended for illegal use, since LSD has no accepted medical use in the United States. Users of LSD typically feel some something within 30 to 90 minutes of ingestion, and the effects may last as long as 12 hours. Users refer to LSD hallucinogenic experiences as trips and to the negative ones as bad trips.. Most LSD trips include both pleasant and unpleasant aspects."}, {"url": "http://www.quibblo.com/quiz/a71oOk7/Narcotics-hallucinogens-and-marijuana", "passage_text": "Users Also Took. 1  Do you think Marijuana should be... 2  Do you think people use drugs to... 3  Country With The Best Marijuana. 4  Should Marijuana Be Legalized? 5  do you smoke marijuana or have s... 6  do you like marijuana. 7  Should Marijuana be legalized fo... 8  Drug use questionnaire. 9  Do you smoke marijuana. 10  Which One Would You Pick? "}, {"url": "https://www.psychologytoday.com/conditions/hallucinogens", "passage_text": "From LSD to PCP to Ketamine, hallucinogens are widely used and abused drugs that produce profound disturbances in the user's perception of reality. There are naturally occurring hallucinogens as well, including peyote and psilocybin, better known as magic mushrooms. Users of LSD typically feel some something within 30 to 90 minutes of ingestion, and the effects may last as long as 12 hours. Users refer to LSD hallucinogenic experiences as trips and to the negative ones as bad trips.. Most LSD trips include both pleasant and unpleasant aspects."}, {"url": "http://www.answers.com/Q/Which_is_not_a_hallucinogen_Heroin_or_mescaline_or_pcp", "passage_text": "exists and is an alternate of. Merge this question into. Split and merge into it. Answer by Jwilde222. Confidence votes 5.7K. Of heroin, mescaline, and PCP, heroin is not a hallucinogen. Heroin is an opioid derived from morphine. Mostly, NO. Heroin is psychoactive (which merely means it is neurologically active)--but it is not a hallucinogen nor a stimulant. It is a semi-synthetic opiate (meaning it sp … ecifically acts on mu-opioid receptors in the brain). This action in the brain causes central nervous system depression."}, {"url": "https://en.wikipedia.org/wiki/Mescaline", "passage_text": "Europeans noted use of peyote in Native American religious ceremonies upon early contact, notably by the Huichols in Mexico. Other mescaline-containing cacti such as the San Pedro have a long history of use in South America, from Peru to Ecuador. In traditional peyote preparations, the top of the cactus is cut at ground level, leaving the large tap roots to grow new heads. These heads are then dried to make disc-shaped buttons. Mescaline is legal only for certain religious groups (such as the Native American Church) and in scientific and medical research. In 1990, the Supreme Court ruled that the state of Oregon could bar the use of mescaline in Native American religious ceremonies."}, {"url": "http://www.intheknowzone.com/test-your-knowledge-25.html", "passage_text": "Overdoses occur very rarely – about 5% of users ever overdose. Most heroin users are extremely worried and cautious about heroin overdose. 80% of users inject with a partner, yet 80% of overdose victims found by paramedics are found alone. It is rare for people who overdose on heroin to also have been using other drugs. "}]