[{"url": "http://www.indiatimes.com/health/tips-tricks/weight-loss-foods-how-chickpeas-help-weight-loss-239787.html", "passage_text": "A healthy meal plan that helps weight loss is incomplete without chickpeas and their healthy weight loss benefits. Add them to salads, curries, vegetables, just about anything can use these wonderful energy powerhouses. Read on to understand just why chickpeas are good for weight loss."}, {"url": "http://www.naturalfoodbenefits.com/display.asp?CAT=2&ID=86", "passage_text": "1 Protein for Vegetarians: Chickpeas are a good source of protein. 2  Combined with a whole grain such as whole-wheat protein, they provide amount of protein comparable to that of meat or dairy foods without the high calories or saturated fats."}, {"url": "http://www.livestrong.com/article/412908-are-chickpeas-good-for-weight-loss/", "passage_text": "Photo Credit mathieu boivin/iStock/Getty Images. Chickpeas are a nutrient-rich food, providing high amounts of protein, fiber, iron, potassium, manganese, copper, zinc, phosphorus, magnesium, folate, vitamin B-6 and thiamine, making them a healthy addition to any diet."}, {"url": "http://healthyeating.sfgate.com/chickpeas-good-weight-loss-3268.html", "passage_text": "The dietary fiber in chickpeas supports weight loss by making you feel full. Their soluble fiber absorbs water, fills the stomach and sends signals to the brain that you’re full. The total fiber content in chickpeas also improves satiety by increasing levels of a hormone called cholecystokinin."}, {"url": "http://healthyeating.sfgate.com/chickpeas-good-weight-loss-3268.html", "passage_text": "Chickpeas support weight loss with nutrition and fiber. Chickpeas, or garbanzo beans, deserve more attention. Often limited to nothing more than a second thought as they’re tossed onto a salad, chickpeas can be used in a variety of ways, where they add a low-fat boost of nutrition that supports healthy weight loss."}, {"url": "http://www.webmd.com/diet/hummus-recipe-and-benefits", "passage_text": "Chickpeas, hummus’s main ingredient, give you protein, good-for-you carbs, and fiber. Like other members of the legume family, they routinely top lists of the world’s healthiest foods. Eating more plant foods is good for you. People who make that a habit are less likely to get certain diseases."}, {"url": "http://healthyeating.sfgate.com/chickpeas-good-weight-loss-3268.html", "passage_text": "Serving Tips. Chickpeas are the main ingredient in hummus, where they’re mixed with tahini, garlic, lemon juice, olive oil and paprika to create a dip. Chickpeas match well with flavorings such as garlic, onion, cumin, chili powder, mint, red pepper flakes and paprika."}]