[{"url": "http://www.crystalvaults.com/crystal-encyclopedia/rose-quartz", "passage_text": "Called the Heart Stone, Rose Quartz may have been used as a love token as early as 600 B.C. and is still an important talisman of relationships. It is quite effective in attracting new love, romance and intimacy, or in developing a closer bond with family or friends. A silicon dioxide crystal, Rose Quartz is one of the most common varieties of the Quartz family. It is found in abundance around the world and occurs only in massive form, with no crystal faces, edges or terminations. It is hazy to translucent, and is usually found in the cores of granite pegmatite"}, {"url": "http://gemstonemeanings.us/rose-quartz-meaning/", "passage_text": "Rose Quartz meaning are love, calming, gentleness.This stone symbolize couple relation. It also know as pink quartz.The pink color of this crystal will give you the ability to gain love in any situation. "}, {"url": "http://www.crystalvaults.com/crystal-encyclopedia/rose-quartz", "passage_text": "Rose Quartz. The fair and lovely Rose Quartz, with its gentle pink essence, is a stone of the heart, a Crystal of Unconditional Love. It carries a soft feminine energy of compassion and peace, tenderness and healing, nourishment and comfort. A silicon dioxide crystal, Rose Quartz is one of the most common varieties of the Quartz family. It is found in abundance around the world and occurs only in massive form, with no crystal faces, edges or terminations. It is hazy to translucent, and is usually found in the cores of granite pegmatites"}, {"url": "http://meanings.crystalsandjewelry.com/rose-quartz", "passage_text": "Rose quartz is a very happy and loving stone. In the psychic and spiritual realms, rose quartz is often used to attract love, for love spells and charms. It is also used to ease the process of transition in dying to make the transition gentle and surrounded by the unconditional love of the Divine. Rose quartz can also be helpful for dream recall and dream work. Rose quartz is used to raise self-esteem and a strong sense of self-worth. Its loving energies teach us to apply this love to ourselves and thereby find ourselves more worthy."}, {"url": "http://www.rosequartzmeaning.com/", "passage_text": "Rose Quartz Meaning. Rose quartz is known as love gemstone. Its pink color signifies its meaning. It is all about ‘love’ in different forms like a love that is transcendental, love for the self, passionate love, love for the family, amorous love or universal love. "}, {"url": "http://www.healing-crystals-for-you.com/rose-quartz-crystal.html", "passage_text": "A Powerful Love Stone. Rose Quartz is a pink quartz crystal whose meaning is about love, as it is a stone that epitomizes the vibration of love. This may be why this stone is symbolic of the energy of love, peace and calming energy. You can do crystal healing using Rose quartz crystals, as they will heal you on both a physical and emotional level. This lovely stone will resonate out the love energy into its surrounds, as all quartz varieties are profound amplifiers of energy."}, {"url": "http://meanings.crystalsandjewelry.com/rose-quartz", "passage_text": "Learn about the crystal meanings and metaphysical and healing properties lore of pink rose quartz, a stone of love and more. Rose quartz can also be helpful for dream recall and dream work. Rose quartz is used to raise self-esteem and a strong sense of self-worth. Its loving energies teach us to apply this love to ourselves and thereby find ourselves more worthy."}, {"url": "http://rosequartzmeaning.org/", "passage_text": "The rose quartz meaning is love. It is often referred to as the stone of universal love. Rose quartz crystals are known to bring trust and harmony into people’s relationships and can help balance people’s emotions. A Rose Quartz Gemstone. The rose quartz gemstone meaning is all about loving yourself and feeling an increase in self-worth and self-esteem. This allows the user to release negative energy and negative thoughts. Because of these properties, rose quartz is often used in crystal therapy to treat depression."}, {"url": "https://crystal-cure.com/rosequartz.html", "passage_text": "Your marriage can have more sparkle and fire when you keep a rose quartz under your pillow. You will look younger too. Rose quartz is known as the love stone. It helps the user feel a strong sense of self-worth, therefore being worth love. Rose quartz is the stone of universal love. It is also the stone of love in marriage. When worn in jewelry the wearer feels a sense of self-worth. "}]