[{"url": "https://www.law.cornell.edu/wex/minimum_wage", "passage_text": "The national minimum wage was created by Congress under the Fair Labor Standards Act (FLSA) in 1938. Congress enacted this legislation under its Constitutional grant of authority to regulate interstate commerce. The current federal minimum wage is $6.55 per hour. The laws consist primarily of federal and state statutes. When an employee is subject to both the state and federal minimum wage laws, the employee is entitled to the higher of the two minimum wages."}, {"url": "http://www.minimum-wage.org/history.asp", "passage_text": "The FLSA introduced sweeping regulations to protect American workers from being exploited, and created a mandatory federal minimum wage of 25 cents an hour in order to maintain a minimum standard of living necessary for health, efficiency and general well-being, without substantially curtailing employment. History of the United States' Minimum Wage. The minimum wage is a cornerstone of the United States' labor system, and has been a cutting-edge labor law topic among employers and workers alike for decades. However, the United States hasn't always had a minimum wage. Before the minimum wage was introduced during the Great Depression of the 1930s, there was no national minimum wage, or indeed any legislation to protect workers from exploitation"}, {"url": "https://www.law.cornell.edu/wex/minimum_wage", "passage_text": "The Minimum Wage: An Overview. Minimum wage laws establish a base level of pay that employers are required to pay certain covered employees. The current federal minimum wage is $6.55 per hour. The laws consist primarily of federal and state statutes. When an employee is subject to both the state and federal minimum wage laws, the employee is entitled to the higher of the two minimum wages."}, {"url": "https://en.wikipedia.org/wiki/Minimum_wage_in_the_United_States", "passage_text": "The Congressional Budget Office (CBO) estimated in 2014 that raising the minimum wage to $10.10 and indexing it to inflation would increase the wages of 16.5 million workers in 2016, while raising it to $9.00 without indexing would affect 7.6 million. "}, {"url": "https://en.wikipedia.org/wiki/Minimum_wage", "passage_text": "If a higher minimum wage increases the wage rates of unskilled workers above the level that would be established by market forces, the quantity of unskilled workers employed will fall. The minimum wage will price the services of the least productive (and therefore lowest-wage) workers out of the market. …The direct results of minimum wage legislation are clearly mixed. Some workers, most likely those whose previous wages were closest to the minimum, will enjoy higher wages. A minimum wage is the lowest remuneration that employers may legally pay to workers. Equivalently, it is the price floor below which workers may not sell their labor. Although minimum wage laws are in effect in many jurisdictions, differences of opinion exist about the benefits and drawbacks of a minimum wage"}, {"url": "http://www.minimum-wage.org/history.asp", "passage_text": "Early attempts by labor unions to create a mandatory minimum wage were ruled unconstitutional by the U.S. Supreme Court on the grounds that they restricted the worker's right to set the price for his own labor. History of the United States' Minimum Wage. The minimum wage is a cornerstone of the United States' labor system, and has been a cutting-edge labor law topic among employers and workers alike for decades. However, the United States hasn't always had a minimum wage. Before the minimum wage was introduced during the Great Depression of the 1930s, there was no national minimum wage, or indeed any legislation to protect workers from exploitation"}, {"url": "http://famm.org/Repository/Files/Chart%20Fed%20MMs%20by%20Number%20Passed%20Per%20Yr%208.6.12.pdf", "passage_text": "This graph depicts the number of times federal mandatory minimum sentences were created, increased, or expanded by Congress each year between 1987 and 2012. As of August 2012, there were 201 such new sentences or increases or expansions of existing sentences. (2) any time Congress subsequently increased the length of an existing mandatory minimum or rewrote a statute and included the. mandatory minimum sentence again (e.g., the redrafting of 18 U.S.C. § 924 in 1998),"}, {"url": "https://answers.yahoo.com/question/index?qid=20111023204136AAiOw21", "passage_text": "The minimum wage was created to assure that low skilled workers will never get a first job, and for politicians to look like they care about the poor. Inflation comes from the Federal Reserve though. They create money out of thin air, loan it to banks, and the dollars lose value as they circulate into the economy. "}]