[{"url": "http://travel.usnews.com/Grand_Canyon_AZ/", "passage_text": "Grand Canyon West. Grand Canyon West (located on the southern side of the Colorado River) is managed by the Hualapai tribe. The Hualapai Indian Reservation is located on the southern side of the Colorado River, and lies outside the boundary and jurisdiction of the NPS. — are located on the popular South Rim. Because the Grand Canyon is a national park, be aware that there is an entrance fee. For private vehicles, the fee is $25 per vehicle. You can also enter on foot, by bicycle, by motorcycle or by free shuttle from nearby Tusayan and pay a $12 entrance fee per person."}, {"url": "https://en.wikipedia.org/wiki/Grand_Canyon", "passage_text": "It is contained within and managed by Grand Canyon National Park, the Kaibab National Forest, Grand Canyon-Parashant National Monument, the Hualapai Tribal Nation, the Havasupai people and the Navajo Nation. For thousands of years, the area has been continuously inhabited by Native Americans who built settlements within the canyon and its many caves. The Pueblo people considered the Grand Canyon (Ongtupqa in the Hopi language) a holy site, and made pilgrimages to it."}, {"url": "http://www.livescience.com/27489-grand-canyon.html", "passage_text": "The Grand Canyon is indeed a very big hole in the ground. It is 277 miles (446 km) long, up to 18 miles (29 km) wide and more than a mile (6,000 feet / 1,800 meters) deep. It is the result of constant erosion by the Colorado River over millions of years. Grand Canyon Skywalk. One popular attraction is the Grand Canyon Skywalk, a horseshoe-shaped glass walkway that is 4,000 feet (1,220 meters) above the canyon floor in the Grand Canyon West area of the main canyon."}, {"url": "http://grandcanyon.com/", "passage_text": "Grand Canyon Lodging. Lodging on the South Rim of the Grand Canyon is highly sought after. It can be difficult to book your accommodations during the peak of season. We recommend that you call Xanterra Parks and Resorts early to determine availability at 1-888-297-2757. After spending time looking into the Grand Canyon...one can only long to get to the bottom of the Canyon. A unique blend of 3 tours is now available to you in the Canyon River Adventure tour. Fly over the Grand Canyon, Horseshoe Bend, and Lake Powell. Take a 4 Wheel drive tour to Antelope Canyon."}, {"url": "http://grand-canyon-park.org/general-information/", "passage_text": "Grand Canyon Information. The Grand Canyon, located in the state of Arizona, is considered by some to be one of the seven wonders of the world, due to its sensational decorative colors and majestic natural beauty. It measures 18 miles wide (29 km), 277 miles (446 km) long, and a mile (1.6 km) deep. The area is encompassed by over one million acres. (or over 1,900 square miles) To put it into perspective, the island of Manhattan which is nearly 34 Square miles would be able to fit in the Grand Canyon Park nearly 58 times."}, {"url": "https://en.wikipedia.org/wiki/Grand_Canyon", "passage_text": "The Grand Canyon is 277 miles (446 km) long, up to 18 miles (29 km) wide and attains a depth of over a mile (6,093 feet or 1,857 meters). For thousands of years, the area has been continuously inhabited by Native Americans who built settlements within the canyon and its many caves. The Pueblo people considered the Grand Canyon (Ongtupqa in the Hopi language) a holy site, and made pilgrimages to it."}, {"url": "http://www.history.com/topics/grand-canyon", "passage_text": "Introduction. Located in northern Arizona, the Grand Canyon is known throughout the world for its size and colorful landscape. Measuring over 270 miles long, up to 18 miles wide and a mile deep, the canyon’s walls contain rock layers that reveal a timeline of Earth’s history. "}, {"url": "http://grandcanyon.com/", "passage_text": "The Grand Canyon Skywalk is one of the newest attractions to appear on the Grand Canyon landscape for visitors. It is located at Grand Canyon West on the Hualapai Nation. Most visitor's will approach the Grand Canyon Skywalk from Las Vegas, Nevada and Kingman, Arizona as it is at the western reaches of the Canyon. After spending time looking into the Grand Canyon...one can only long to get to the bottom of the Canyon. A unique blend of 3 tours is now available to you in the Canyon River Adventure tour. Fly over the Grand Canyon, Horseshoe Bend, and Lake Powell. Take a 4 Wheel drive tour to Antelope Canyon."}, {"url": "http://www.pbs.org/nationalparks/parks/grand-canyon/", "passage_text": "Tourist at Bright Angel Point, Grand Canyon National Park, circa 1919. The Grand Canyon is the biggest canyon on earth: 277 miles long, 10 miles wide, and a mile deep. It contains some of the oldest exposed rock on earth, Precambrian Vishnu schist, formed 1.7 billion years ago. "}, {"url": "http://grandcanyon.com/", "passage_text": "The hotels at the Grand Canyon are located just 7 miles from the South Rim in Tusayan, Arizona. These hotels have pools and restaurants you won't find in the Grand Canyon Lodges. Each Grand Canyon hotel is just yards from Big E's restaurant and dinner show and the Grand Canyon IMAX theater. After spending time looking into the Grand Canyon...one can only long to get to the bottom of the Canyon. A unique blend of 3 tours is now available to you in the Canyon River Adventure tour. Fly over the Grand Canyon, Horseshoe Bend, and Lake Powell. Take a 4 Wheel drive tour to Antelope Canyon."}]