[{"url": "http://www.military.com/benefits/military-pay/military-travel-and-per-diem-rates.html", "passage_text": "The proportional meal rate (PMR)is based on the locality meal rate and the GOVT meal rate (GMR). The per diem ta bles on this website have the PMRs already computed. The examples below using the Standard CONUS M&IE rate of $46.00 and the Standard GMR of $11.85 show how to compute a PMR amount. The $46.00 consists of $41.00 for meals and $5.00 for incidental expenses."}, {"url": "http://www.adopt.org/financing-adoption", "passage_text": "MILITARY REIMBURSEMENTS. The military provides active-duty personnel a reimbursement for most one-time adoption costs, up to $2,000 per child. The maximum amount available in a given year is $5,000, even if both parents are in the military. Reimbursement is made after the adoption is finalized. "}, {"url": "http://www.nacac.org/adoptionsubsidy/stateprofiles/indiana.html", "passage_text": "4. What is the maximum basic monthly adoption assistance maintenance payment in Indiana? Effective January 1, 2010, the maximum adoption assistance payment is $16.88 per day (75 percent of the standard foster care per diem of $22.50). 5. To be eligible for reimbursement of up to $1,500 per child, parents must complete an Indiana Adoption Program application, be determined eligible for special needs, and enter into an agreement for payment of nonrecurring adoption expenses prior to the finalization of the adoption."}, {"url": "http://www.nacac.org/adoptionsubsidy/provincialprofiles/manitoba.html", "passage_text": "For on-going assistance (per diems) the amount is calculated based on family income and size. The maximum is half the daily maintenance rate for foster care. For example, as of January 1, 2008 a child under 10 in the southern part of the province would qualify for $11.94 maximum per day. Age 11 and over it increases to $14.59 per day. Northern rates are higher. The adoptive parents submit an income statement and based on this, the per diem rate may change. For special services such as counselling, the service provider must submit a progress report at six months. We also request feedback from the adoptive parents at this time. 17."}, {"url": "http://www.gsa.gov/portal/content/104208", "passage_text": "1 If the city or county you are looking for is not listed on the GSA per diem rate page, then the standard CONUS rate of $89 for lodging and $51 for meals applies. 1 To look up the county, visit www.naco.org. 2 "}, {"url": "http://manuals.sp.chfs.ky.gov/chapter%2012/24/Pages/1224PerDiemRates(Including%20Specialized%20Foster%20Care).aspx", "passage_text": "1 This per diem rate is payable for a maximum of thirty (30) days with no extensions. 2  Housing expenses, food-related expenses, and school expenses are included in the per diem rate. 3  The child's routine hair care is included in the per diem rate, at an average of $12 per month. 1 When a child remains in a resource home less than thirty (30) days, the rate amount for per diem, clothing, incidentals, and allowance is prorated for the number of days the child was in the home."}, {"url": "http://www.14news.com/story/15297438/foster-care", "passage_text": "On Friday, Indiana Department of Child Services released a new foster care per diem rate schedule. The reimbursements become effective January 1, 2012. With the new rates, the needs of the child and their age, rather than the licensing level of the foster home, will determine the rate at which foster parents are reimbursed. Back in 2009, DCS announced that they planned to drop the amount foster parents got daily per child from $25 to $22.50."}, {"url": "http://manuals.sp.chfs.ky.gov/chapter%2012/24/Pages/1224PerDiemRates(Including%20Specialized%20Foster%20Care).aspx", "passage_text": "1 An emergency shelter resource home is reimbursed the specified per diem rate in the above table only for a child whose needs are temporary in nature as described in SOP 12.18.2 Emergency Shelter Home, and the resource parents have met all requirements of an emergency shelter resource home. 1 When a child remains in a resource home less than thirty (30) days, the rate amount for per diem, clothing, incidentals, and allowance is prorated for the number of days the child was in the home."}, {"url": "https://www.irs.gov/pub/irs-regs/per_diem_faq_%26_a_v1.pdf", "passage_text": "What is the federal per diem rate for my area?Publication 1542, Per Diem Rates provides the rates for all continental U.S. areas.Return to top 3. What does per diem cover? There is a per diem rate for combined lodging and meal costs, and a per diem rate for meal costs alone. An employer mayuse either per diem method for reimbursing employee travel expenses. A self-employed person can only use per diem forthe meal costs.Return to top 4."}, {"url": "http://www.military.com/benefits/military-pay/military-travel-and-per-diem-rates.html", "passage_text": "The Per Diem Allowance. Each year the DoD Per Diem, Travel and Transportation Committee sets the Per Diem allowance. The Per Diem is specific to a given travel location and can range from a standard CONUS rate from $140 per day up to $702 per day for Out-of-CONUS rates. The per diem ta bles on this website have the PMRs already computed. The examples below using the Standard CONUS M&IE rate of $46.00 and the Standard GMR of $11.85 show how to compute a PMR amount. The $46.00 consists of $41.00 for meals and $5.00 for incidental expenses."}]