[{"url": "http://www.answers.com/Q/Functions_of_nucleolus", "passage_text": "The nucleolus functions to produce ribosomes.   It controls what goes on in the cell. It also does cellular reproduction. ribosomes to store immature chromosomes and as a … control center of the cell. It's where ribosomes are made. it is often refered to as the brain of the cell as it controlls what goes on. it is also used for cellular reproduction,the nucleolus is that they disappear during cell reproduction."}, {"url": "http://study.com/academy/lesson/what-is-a-nucleolus-definition-function-quiz.html", "passage_text": "It is not surrounded by a membrane but sits in the nucleus. The nucleolus makes ribosomal subunits from proteins and ribosomal RNA, also known as rRNA. It then sends the subunits out to the rest of the cell where they combine into complete ribosomes. Let's review. The nucleolus is a round body located inside the nucleus of a eukaryotic cell. It's intimately tied to protein production through the process of making ribosomes. A larger nucleolus means faster ribosome production."}, {"url": "http://www.els.net/WileyCDA/ElsArticle/refId-a0005975.html", "passage_text": "The nucleolus is the nuclear subdomain that assembles ribosomal subunits in eukaryotic cells. The nucleolar organiser regions of chromosomes, which contain the genes for pre‐ribosomal ribonucleic acid (rRNA), serve as the foundation for nucleolar structure. Key Concepts. 1  The nucleolus, whose primary function is to assemble ribosomes, is the largest structure in the cell nucleus. 2  The nucleolus organiser regions of chromosomes, which harbour the genes for pre‐rRNA, are the foundation for the nucleolus."}, {"url": "https://en.wikipedia.org/wiki/Nucleolus", "passage_text": "The talk page may contain suggestions. (October 2012). The nucleolus is contained within the cell nucleus. The nucleolus (/nuːˈkliːɵləs/ ; plural nucleoli /nuːˈkliːɵlaɪ/) is the largest structure in the nucleus of eukaryotic cells, where it primarily serves as the site of ribosome synthesis and assembly. Until 1964 little was known about the function of the nucleolus, even though it could be easily seen through microscopy and was recognized as part of the nucleus."}, {"url": "http://www.answers.com/Q/What_is_the_nucleoli's_function", "passage_text": "Confidence votes 15. nucleoli form ribosomes. The ribosomes are known to produce or manufacture proteins and therefore, nucleolus plays an indirect role in protein synthesis. Out of the total production of RNA that takes place in the cells, nucleolus is involved in 50% of the RNA synthesis. This functionality of nucleolus is attributed to hundreds of r-gen"}, {"url": "http://micro.magnet.fsu.edu/cells/nucleus/nucleolus.html", "passage_text": "The Nucleolus. The nucleolus is a prominent sub-nuclear structure that is not bound by a membrane and resides within the nuclear matrix. Though known to exist since the eighteenth century, the primary function of the nucleolus was not discovered until the 1960s. It is now been determined that nucleoli manufacture the subunits that combine to form ribosomes, the cell's protein-producing factorie"}, {"url": "http://www.els.net/WileyCDA/ElsArticle/refId-a0005975.html", "passage_text": "1 The nucleolus, whose primary function is to assemble ribosomes, is the largest structure in the cell nucleus. 2  The nucleolus organiser regions of chromosomes, which harbour the genes for pre‐rRNA, are the foundation for the nucleolus. Key Concepts. 1 "}, {"url": "http://www.biology-online.org/dictionary/Nucleolus", "passage_text": "Nucleolus. Definition. noun, plural: nucleoli. The round granular structure within the nucleus of a cell, and composed of protein and RNA. Supplement. Nucleolus is involved with ribosomal RNA synthesis and formation of ribosomes in eukaryotes. Word origin: New Latin, from Latin, diminutive of nucleus, kernel."}, {"url": "http://www.plant-biology.com/Nucleolus-Function.php", "passage_text": "Nucleolus Function. The nucleolus (nucleoli, plural) is one of the most important components of the cell nucleus, and is far the most easily recognized substructure in the nucleus of eukaryotic cells. It can easily be determined by phase contrast microscopy and with the use of different dyes. "}]