[{"url": "http://www.livestrong.com/article/362037-does-alcohol-raise-triglycerides/", "passage_text": "Triglycerides are simply excess calories stored in the body to provide energy for cell functioning. Elevated triglyceride levels greater than 150 mg/dL can contribute to the hardening of the artery walls, which in turn can increase your risk for heart disease and stroke."}, {"url": "http://www.reducetriglycerides.com/alcohol_beer_wine_template.htm", "passage_text": "Some people have increased susceptibility to developing raised triglycerides in response to alcohol. So if you do not require insulin, or are not diabetic, and consume alcohol regularly, you may be able to lower your elevated triglycerides just by avoiding alcohol. The liver can detoxify about one ounce of alcohol (distilled spirits) per hour, which is about 1 serving of an alcoholic beferage (equivalent to 12 ounces of beer or 4 ounces of wine). In the meantime, however, glucose tends to be further processed into triglycerides which raises their blood levels."}, {"url": "http://www.mayoclinic.org/diseases-conditions/high-blood-cholesterol/in-depth/triglycerides/ART-20048186?pg=2", "passage_text": "1 Alcohol is high in calories and sugar and has a particularly potent effect on triglycerides. 2  Even small amounts of alcohol can raise triglyceride levels. 3  Exercise regularly. 4  Aim for at least 30 minutes of physical activity on most or all days of the week. 1 Substitute fish high in omega-3 fatty acids — such as mackerel and salmon — for red meat. 2  Limit how much alcohol you drink. 3  Alcohol is high in calories and sugar and has a particularly potent effect on triglycerides. 4  Even small amounts of alcohol can raise triglyceride levels"}, {"url": "http://www.reducetriglycerides.com/alcohol_beer_wine_template.htm", "passage_text": "If you have elevated triglycerides and consume alcohol-a reduced intake or not drinking alcohol at all is strongly advised. Just one drink can increase triglycerides in susceptible people. Alcohol is a source of excess calories which are being turned into fat (usually, triglycerides), so the fat levels in your blood go up. But that is only part of the story. The liver can detoxify about one ounce of alcohol (distilled spirits) per hour, which is about 1 serving of an alcoholic beferage (equivalent to 12 ounces of beer or 4 ounces of wine). In the meantime, however, glucose tends to be further processed into triglycerides which raises their blood levels."}, {"url": "http://www.livestrong.com/article/362037-does-alcohol-raise-triglycerides/", "passage_text": "Excess drinking can raise triglycerides in addition to raising your blood pressure and providing you with extra calories. You don't need to be a big drinker to see its effects, according to the American Heart Association, as even small amounts of alcohol can cause large changes in your triglyceride levels. Elevated triglyceride levels greater than 150 mg/dL can contribute to the hardening of the artery walls, which in turn can increase your risk for heart disease and stroke."}, {"url": "http://www.healtharticles101.com/triglycerides-and-alcohol-consumption-are-they-related/", "passage_text": "High levels of triglycerides and alcohol consumption are commonly found together. Even an occasional drink can cause your triglyceride levels to rise noticeably. This is the reason that any triglycerides diet eliminates alcohol completely. This includes red wine, which does offer health benefits for other diet plans. Studies have shown that drinking red wine can raise the triglycerides in your blood the same as beer or whiskey and should be avoided if your levels are borderline or high. Some studies have shown that alcohol consumption also slows down the rate that your body breaks down fat, including triglycerides"}, {"url": "http://www.livestrong.com/article/362037-does-alcohol-raise-triglycerides/", "passage_text": "Recommended Intake. If you drink alcoholic beverages and have high triglycerides, alcohol reduction can go along way toward bringing these levels back to normal. For best results, the Cleveland Clinic recommends limiting your intake to just 5 oz. per day or to cut it out of your diet completely. Elevated triglyceride levels greater than 150 mg/dL can contribute to the hardening of the artery walls, which in turn can increase your risk for heart disease and stroke."}, {"url": "http://my.clevelandclinic.org/services/heart/prevention/risk-factors/cholesterol/triglycerides", "passage_text": "Alcoholic beverages can significantly raise triglyceride levels. Beer, wine, spirits, mixed drinks, wine coolers and coffee drinks containing alcohol are all examples. Men should not have more than 2 drinks per day. Women should have no more than one drink per day. If you have high triglycerides and low HDL or high LDL levels, you may need to take medication along with making lifestyle changes. If your triglyceride levels are in the very high range (over 500 mg/dL) you are at risk to develop other medical problems, so you will most likely need to take medication."}]