[{"url": "https://malaysia.answers.yahoo.com/question/index?qid=20080127165114AAcE51R", "passage_text": "Best Answer: Pepperoni is a spicy Italian-American variety of dry salami usually made of pork, beef, and sometimes goat, turkey, or fish. "}, {"url": "https://answers.yahoo.com/question/index?qid=20070528134917AAx5rvN", "passage_text": "Rating Newest Oldest. Best Answer: Pepperoni is a spicy Italian-American variety of dry salami usually made of pork, beef and sometimes fish.[citation needed] Pepperoni is often used on pizza, and sometimes it is used on sub sandwiches. Pepperoni is a descendant of the spicy salamis of Southern Italy, such as salsiccia Napoletana piccante, a spicy dry sausage from Naples. Pepperoni is frequently used as a pizza topping in American-style pizzerias. It is the most popular pizza topping in North America.[citation needed]. Source(s): wikipedia."}, {"url": "http://howisitmade.org/how-is-pepperoni-made/", "passage_text": "Pepperoni is one of the most popular American-style pizza topping. It is actually a spicy Italian dry sausage in solid sticks. It is usually made from cured meat of beef and pork. Sometimes, poultry can be added for less expensive versions. Pepperoni meant for pizza topping can be one inch in diameter while those typically used in Italian submarine sandwiches is usually twice the size. "}, {"url": "https://en.wikipedia.org/wiki/Pepperoni", "passage_text": "Pepperoni is usually made from a mixture of pork and beef. Turkey is also commonly used as a substitute, but the use of poultry in pepperoni must be appropriately labeled in the United States. In the Caribbean Islands and other parts of the world, donkey and horse meat are common ingredients. The term pepperoni is a corruption of peperoni, the plural of peperone, the Italian word for bell pepper. The first use of pepperoni to refer to a sausage dates to 1919."}, {"url": "https://answers.yahoo.com/question/index?qid=20080103161859AAB7HE7", "passage_text": "· just now. Report Abuse. Pepperoni is a spicy Italian-American variety of dry salami usually made of pork, beef, and sometimes goat, turkey, and fish. It is a descendant of the spicy salamis of Southern Italy, such as salsiccia Napoletana piccante, a spicy dry sausage from Naples. PennySavior2002 · 8 years ago. "}, {"url": "https://en.wikipedia.org/wiki/Pepperoni", "passage_text": "Pepperoni, also known as pepperoni sausage, is an American variety of salami, usually made from cured pork and beef mixed together. Pepperoni is characteristically soft, slightly smoky, and bright red in color. The term pepperoni is a corruption of peperoni, the plural of peperone, the Italian word for bell pepper. The first use of pepperoni to refer to a sausage dates to 1919."}, {"url": "https://en.wikipedia.org/wiki/Pepperoni", "passage_text": "Thinly sliced pepperoni is a popular pizza topping in American-style pizzerias and is used as filling in the West Virginia pepperoni roll. It is also used to make some varieties of submarine sandwiches. The term pepperoni is a corruption of peperoni, the plural of peperone, the Italian word for bell pepper. The first use of pepperoni to refer to a sausage dates to 1919."}, {"url": "http://ijab.blogspot.com/2006/06/what-is-pepperoni.html", "passage_text": "Pepperoni is, ...a spicy Italian-American variety of dry salami made of pork and beef. Pepperoni is a descendant of the spicy salamis of Southern Italy.. So it's a mixture of two kinds of meat. Pepperoni is made of...ground up animal parts! Pork, beef and poultry all ground up together and formed into thin, small, round circles of processed heaven! What's better yet, it's not even the good parts of the animals! It beaks and noses and hooves!"}]