[{"url": "http://www.hopkinsmedicine.org/healthlibrary/conditions/non-traumatic_emergencies/food_poisoning_85,P00839/", "passage_text": "Several different kinds of bacteria can cause food poisoning. Some of the common bacteria include the following: Salmonella and Campylobacter. Normally found in warm-blooded animals, such as poultry and reptiles, also may be present in raw meat, poultry, eggs, or unpasteurized dairy products. Clostridium perfringens. May be present in raw meat, poultry, eggs, or unpasteurized dairy products, as well as in vegetables and crops that come into contact with soil."}, {"url": "http://culinaryarts.about.com/od/chickenturkeymore/a/chickensafety_2.htm", "passage_text": "Bacteria in Raw Chicken & Poultry. 1  Salmonella Enteritidis may be found in the intestinal tracts of livestock, poultry, dogs, cats and other warm-blooded animals. 2  This strain is only one of about 2,000 kinds of Salmonella bacteria; it is often associated with poultry and shell eggs. 1"}, {"url": "http://www.fau.edu/divdept/envhs/Foodsafety/FS6.htm", "passage_text": "n. Causes of Food-borne Illnesses. Salmonella. Bacteria found widespread in raw meats such as poultry, seafood, and eggs. Symptoms include nausea, vomiting, abdominal cramps, diarrhea, fever, and headache. Illness lasts 2 days or longer depending on host factors. Arthritic symptoms may follow 3-4 weeks after onset of acute symptoms. "}, {"url": "http://www.cbsnews.com/news/food-poisoning-from-bacteria-found-in-raw-milk-poultry-and-shellfish-on-the-rise/", "passage_text": "NEW YORK A bacteria found in raw milk and poultry and another found in shellfish has been linked to higher rates of food poisonings. Cases of Campylobacter, which can thrive in raw milk and poultry, grew by 14 percent over the last five years, a government study found. Health officials said it's not clear why Campylobacter cases have increased, or which food or foods was the source of most of the added illnesse"}, {"url": "http://healthvermont.gov/prevent/salmonella/Salmonella.aspx", "passage_text": "Salmonella is commonly found in raw food products that come from animals, such as eggs, egg products, meat, meat products, unpasteurized milk, or other unpasteurized dairy products. "}, {"url": "http://www.accepta.com/environmental-water-wastewater-knowledge/pathogen-control-knowledge/297-food-poisoning-bacteria-salmonella-listeria-e-coli-0157-campylobacter", "passage_text": "Salmonella. Salmonella is the second most common cause of food poisoning after campylobacter. It has been found in unpasteurised milk, eggs and raw egg products, meat and poultry. It can survive if food is not cooked properly. Salmonella can grow in food. If a small number of bacteria are present in a food, they will multiply unless it is chilled. This short paper in our series covering food poisoning bacteria examines how various bacterium causes food poisoning, paying closer attention to five of the most common bacteria; Salmonella, Listeria, E.coli 0157, Campylobacter and Clostridium perfringens."}, {"url": "http://www.foodsafetywatch.org/factsheets/salmonella/", "passage_text": "Food animals can become infected with Salmonella from feed and from the environment, so that many foods of animal origin, such as meat, poultry, eggs and raw milk can become contaminated. Salmonella may also contaminate fresh produce via contact with infected animals or other environmental sources. "}, {"url": "http://www.infoplease.com/ipa/A0762206.html", "passage_text": "Found: intestinal tract and feces of animals; Salmonella enteritidis in raw eggs. Transmission: raw or undercooked eggs, poultry, and meat; raw milk and dairy products; seafood. Symptoms: stomach pain, diarrhea, nausea, chills, fever, and headache usually appear 6 to 48 hours after eating; may last 1 to 2 days. 1. Bacteria may be present on products when you purchase them. Raw meat, poultry, seafood, and eggs are not sterile. Neither is produce such as lettuce, tomatoes, sprouts, and melons. 2. Foods, including safely cooked, ready-to-eat foods, can become cross-contaminated with bacteria introduced on raw products, meat juices, or other contaminated products, or by poor personal hygiene"}, {"url": "http://www.infoplease.com/ipa/A0762206.html", "passage_text": "Found: intestinal tracts of humans and animals, milk, soil, leaf vegetables, and processed foods; can grow slowly at refrigerator temperatures. Transmission: soft cheese, raw milk, improperly processed ice cream, raw leafy vegetables, meat, and poultry. Illness caused by bacteria that do not produce toxin. 1. Bacteria may be present on products when you purchase them. Raw meat, poultry, seafood, and eggs are not sterile. Neither is produce such as lettuce, tomatoes, sprouts, and melons. 2. Foods, including safely cooked, ready-to-eat foods, can become cross-contaminated with bacteria introduced on raw products, meat juices, or other contaminated products, or by poor personal hygiene"}]