[{"url": "http://enhs.umn.edu/current/5103/gm/harmful.html", "passage_text": "Harmful Effects of the Agent. Genetically modified organisms (GMOs) are a broad group of plants, animals, and bacteria that are engineered for a wide variety of applications ranging from agricultural production to scientific research. However, there are several types of potential health effects that could result from the insertion of a novel gene into an organism. Health effects of primary concern to safety assessors are production of new allergens, increased toxicity, decreased nutrition, and antibiotic resistance (Bernstein et al., 2003)."}, {"url": "http://bodyecology.com/articles/must-avoid-foods-linking-gmo-to-toxicity-and-disease", "passage_text": "GMOs (Genetically Modified Organisms) have been found to: 1  Generate intestinal damage. 2  Create food allergies, a sign of immune system dysfunction. 3  Change reproductive function in both men and women, including sterility. 4  Lead to increased infant mortality. Non-GMO and organic food are essential to the Body Ecology Diet. Choosing food that is non-GMO falls right in line with the Body Ecology principles of healing."}, {"url": "http://www.naturalnews.com/037867_GMO_Morgellons_disease_mysterious_fibers.html", "passage_text": "Both are composed of cellulose, have 'helical coil type tendencies' (a genetically manipulated trait), autofluoresce (also seen in genetic manipulation) and contain DNA of genetically modified bacteria. Whether caused by unknown variables, GM food or clothing, Morgellons disease is a devastating modern affliction. Considering the rise of the disease parallels the introduction and infiltration of GMOs into the textile industry along with the food supply, it is not worth the risk to consume or wear anything that is genetically modified."}, {"url": "http://bodyecology.com/articles/must-avoid-foods-linking-gmo-to-toxicity-and-disease", "passage_text": "The herbicide tolerant variety is designed to survive high doses of toxic weed killers. Such toxic weed killers are themselves linked to a string of health disorders like birth defects, cancer, and hormone disruption. When used on highly resistant crops, some of these toxins end up in our food. Other GM foods are designed to produce their own insecticide in each and every cell. An example of this is BT-toxin. BT-toxin is an insecticide that breaks open the stomachs of insects in order to kill them. Non-GMO and organic food are essential to the Body Ecology Diet. Choosing food that is non-GMO falls right in line with the Body Ecology principles of healing."}, {"url": "http://www.naturalnews.com/037867_GMO_Morgellons_disease_mysterious_fibers.html", "passage_text": "Dr. Rima Laibow, medical director for the Natural Solutions Foundation, suspects Morgellons is caused by genetically modified organisms. After studying the skin fibers, it was discovered that they contain DNA of both fungus and bacterium used extensively in GMOs. Considering the rise of the disease parallels the introduction and infiltration of GMOs into the textile industry along with the food supply, it is not worth the risk to consume or wear anything that is genetically modified."}, {"url": "http://naturalrevolution.org/health-risks-of-gmos/", "passage_text": "GMOs may make you allergic to non-GM foods. 1  GM soy drastically reduces digestive enzymes in mice. 2  Mice fed Bt-toxin started having immune reactions to formerly harmless foods. 3  Mice fed experimental GM peas also started reacting to a range of other foods. GM soy and allergic reactions. 1  Soy allergies skyrocketed by 50% in the UK, soon after GM soy was introduced. [ 2 8]. 3  A skin prick allergy test shows that some people react to GM soy, but not to wild natural soy.[9]. 4  Cooked GM soy contains as much as 7-times the amount of a known soy allergen."}, {"url": "http://gmo.wikidot.com/general-types-of-gmos", "passage_text": "Many genetically modified plants are currently used in agriculture. These plants fall can be divided into different categories based on the type of advantage conveyed by the modification. Insect resistance is a highly desirable trait for agriculture. Damage to crops from pests lowers yields and increases the cost of production. Pesticides are commonly used to protect plants by killing the insects."}, {"url": "https://en.wikipedia.org/wiki/Genetically_modified_organism", "passage_text": "A genetically modified organism (GMO), also known as a transgenic organism, is any organism whose genetic material has been altered using genetic engineering techniques (i.e. genetically engineered organism). While some genetically modified plants are developed by the introduction of a gene originating from distant, sexually incompatible species into the host genome, cisgenic plants contain genes that have been isolated either directly from the host species or from sexually compatible species."}]