[{"url": "http://bigcatrescue.org/cheetah-facts/", "passage_text": "The Cheetah is the fastest land animal, reaching a top speed of 70 mph! The Cheetah however can only run for short sprints of up to 300 yards. These sprints will usually last for 20 seconds, but rarely ever reach a full minute. Non-retractable claws and tough pads on their feet closely resemble that of a dog."}, {"url": "http://a-z-animals.com/animals/cheetah/", "passage_text": "Today, the Cheetah has been listed by the IUCN as a species that is Vulnerable from extinction in it's natural environment in the near future. Habitat loss along with the increase of natural parks that are home to a large number of competing predators has led to drastic declines in the world's Cheetah population."}, {"url": "http://bigcatswildcats.com/cheetah/", "passage_text": "The cheetah is a big cat that lives in Africa and Asia. The name comes from the Sanskrit word citrakayah. ”Citra” means variegated – displaying different spots and streaks, and “kaya” is a Sanskrit word for body. They are listed as Vulnerable on the IUCN Red List of Threatened Species."}, {"url": "http://a-z-animals.com/animals/cheetah/", "passage_text": "Cheetah Classification and Evolution The Cheetah is a large and powerful feline that was once found throughout Africa and Asia and even in parts of Europe."}, {"url": "http://a-z-animals.com/animals/cheetah/", "passage_text": "The adult Cheetah is a dominant predator in it's environment and is therefore not seen as prey (more as competition) by other large predators."}, {"url": "http://tolweb.org/treehouses/?treehouse_id=4830", "passage_text": "In comparison, the cheetah is able to accelerate from 0-60 miles per hour almost one second faster than a Lamborghini Gallardo (3.95 seconds). This makes the cheetah the fastest land animal. Cheetahs are carnivourous animals that prey on gazelles, impala, hares, and even larger animals such as zebra and wildebeests."}, {"url": "http://animals.nationalgeographic.com/animals/mammals/cheetah/", "passage_text": "The cheetah is the world's fastest land mammal. With acceleration that would leave most automobiles in the dust, a cheetah can go from 0 to 60 miles (96 kilometers) an hour in only three seconds."}, {"url": "http://animalstime.com/cheetah-facts-kids-cheetah-habitat-diet/", "passage_text": "The cheetah (Acinonyx jubatus) is a feline that is endemic to Africa with some of the species are also found in the Middle East. These animals are the extant members of genus Acinonyx. Without any doubt, cheetah is the fastest living animal on earth and covers a vast distance of about 500 metres (1,600 feet). Cheetahs are considered to be endangered animals in that only 12,400 species are left in more than 20 different African countries."}]