[{"url": "http://www.sheknows.com/baby-names/name/joss", "passage_text": "German Meaning: The name Joss is a German baby name. In German the meaning of the name Joss is: One of the Goths'. Introduced into Britam as a masculine name during the Norman Conquest, Jocelyn was adopted as a feminine first name in the early 20th century. Hebrew Meaning: The name Joss is a Hebrew baby name. In Hebrew the meaning of the name Joss is: Abbreviation of Joshua 'Jehovah is salvation"}, {"url": "http://www.thinkbabynames.com/meaning/1/Joss", "passage_text": "Joss is an uncommonly occurring given name for men but a very prominent last name for all people (#30229 out of 150436, Top 20%). (2000 U.S. Census). Below is a charted analysis of the usage of Joss and associated names. Popular alternative forms of Joss (unlisted) are Giuseppe, Jodie, Jody, Joey (#686 in 2014) , Jose (#76) , Josef, Joseph (#20) , Josephus, Joshua (#25) , Josue (#269) , Yousef (#766) and Yusuf (#589) ."}, {"url": "http://www.ourbabynamer.com/meaning-of-Joss.html", "passage_text": "Joss is generally used as a girl's name. It consists of 4 letters and 1 syllable and is pronounced Joss. In the U.S. in 2014, it ranked 6790 in baby name popularity for girls with 18 occurrences. It ranked 4583 in popular baby names for boys with 21 occurrences. Then just follow the diagram below. Just for fun, see the name Joss in Hieroglyphics, learn about ancient Egyptian Hieroglyphics and write a Hieroglyphic message. Learn about nautical flags and see your name or message written in nautical flags, on the Joss in Nautical Flags page."}, {"url": "http://www.thenamemeaning.com/joss/", "passage_text": "Search comprehensively and find the name meaning of Joss and its name origin or of any other name in our database. Also note the spelling and the pronunciation of the name Joss and check the initials of the name with your last name to discover how it looks and sounds. It has same or different meanings in other countries and languages. The different meanings of the name Joss are: 1  Hebrew meaning: God is salvation. 2  Latin meaning: The merry one From the name Jocelin Also used as an independent name."}, {"url": "http://www.thenamemeaning.com/joss/", "passage_text": "Joss Name Meaning. The meaning of Joss has more than one different etymologies. It has same or different meanings in other countries and languages. The different meanings of the name Joss are: 1  Hebrew meaning: God is salvation. 2  Latin meaning: The merry one From the name Jocelin Also used as an independent name. 3  Spanish meaning: Derivative: Form of Joshua"}, {"url": "http://www.surnamedb.com/Surname/Joss", "passage_text": "This interesting surname is of Norman-French origins, and derives from an Old French personal name Gosse, itself a shortened nickname form of Gocelin. The true origination is probably the Germanic Gozzo, of the pre 7th Century, itself a personal name derived from got meaning god, or more likely good. "}, {"url": "http://www.babynamespedia.com/meaning/Joss/m", "passage_text": "Joss is used predominantly in the English language, and its origin is Old French, Hebrew, and Breton. Joss is a diminutive form of the name Jocelyn (English). Joss is also a variant (English) of the name Joseph (English, French, and German). Joss is also a variant of the name Joshua (English). Joss is also a variant of the name Joyce (English). Joss is not regularly used as a baby name for boys. It is not listed in the top 1000 names. In 2012, out of the group of boy names directly linked to Joss, Joshua was the most commonly used."}, {"url": "http://www.ourbabynamer.com/meaning-of-Joss.html", "passage_text": "What does Joss mean, popularity, numerology and more. The name Joss is of German origin. The meaning of Joss is member of the gaut tribe. It is also of Latin origin, where its meaning is cheerful. Then just follow the diagram below. Just for fun, see the name Joss in Hieroglyphics, learn about ancient Egyptian Hieroglyphics and write a Hieroglyphic message. Learn about nautical flags and see your name or message written in nautical flags, on the Joss in Nautical Flags page."}, {"url": "http://www.thinkbabynames.com/meaning/1/Joss", "passage_text": "Joss /joss/ [1 syll.] as a boys' name (also used as girls' name Joss) is of Old German origin, and the meaning of Joss is a member of the Germanic tribe, the Gauts. English name that is a nickname of Jocelyn, which used to be a masculine name. Also possibly a variant of Joseph. Actor Joss Ackland. Below is a charted analysis of the usage of Joss and associated names. Popular alternative forms of Joss (unlisted) are Giuseppe, Jodie, Jody, Joey (#686 in 2014) , Jose (#76) , Josef, Joseph (#20) , Josephus, Joshua (#25) , Josue (#269) , Yousef (#766) and Yusuf (#589) ."}]