[{"url": "http://www.holiday-weather.com/orlando/averages/", "passage_text": "Orlando: Annual Weather Averages. July is the hottest month in Orlando with an average temperature of 28°C (82°F) and the coldest is January at 15°C (59°F) with the most daily sunshine hours at 11 in June. The wettest month is July with an average of 196mm of rain. "}, {"url": "http://traveltips.usatoday.com/average-march-weather-disney-world-orlando-florida-54462.html", "passage_text": "The average temperature in the Orlando area in March is 65 degrees Fahrenheit, with an average high of 79 and an average low of 56. March is typically rainy in the Disney area. Average rainfall for March is 3.5 inches, with an average of eight days of rainfall during the month."}, {"url": "http://www.visitorlando.com/plan-your-trip/weather/", "passage_text": "Orlando Weather. One of Orlando's biggest draws is the year-round sunny, mild weather. In keeping with the Sunshine State, Central Florida maintains a comfortable average annual temperature of 72 degrees and a mostly dry climate from October to May. "}, {"url": "http://www.holiday-weather.com/orlando/averages/march/", "passage_text": "Averages for Orlando in March. Weather low-down. In March, things start to warm up a notch as Spring arrives in Orlando. The temperatures are considerably higher than those in February, and your chances of cooler weather are dramatically reduced. The average daytime temperatures in March reach a blissful 25°C, that's about 78°F, whereas the average minimum temperatures drop down to 12°C, or 54°F. You can expect 9 hours of sunshine per day on average, but you might get... Read more"}, {"url": "http://traveltips.usatoday.com/average-march-weather-disney-world-orlando-florida-54462.html", "passage_text": "Temperatures. The average temperature in the Orlando area in March is 65 degrees Fahrenheit, with an average high of 79 and an average low of 56. Although there is obviously variance, visitors to Disney World will generally find mild temperatures in March. The average daily humidity is 69 percent, falling to 50 percent in the afternoons. Keep in mind that humidity effects the real-feel of the temperature, making warm air feel warmer and cool air feel cooler. March is typically rainy in the Disney area. Average rainfall for March is 3.5 inches, with an average of eight days of rainfall during the month."}, {"url": "https://weatherspark.com/averages/30841/3/Orlando-Florida-United-States", "passage_text": "Location. This report describes the typical weather at the Orlando International Airport (Orlando, Florida, United States) weather station over the course of an average March. It is based on the historical records from 1974 to 2012. Earlier records are either unavailable or unreliable. "}, {"url": "http://www.currentresults.com/Weather/Florida/Places/orlando-weather-in-march.php", "passage_text": "In most years, Orlando averages a daily maximum temperature for March that's between 75 and 81 degrees Fahrenheit (24 to 27 degrees Celsius). The minimum temperature usually falls between 53 and 59 °F (12 to 15 °C). The days at Orlando warm steadily during March. Sunlight in March at Orlando lasts for 12 hours and 1 minute a day on average. The shortest day of the month is the 1st with 11 hours and 35 minutes of daylight. By the end of the month, the days have lengthened to 12:27 from sunrise to sunset."}, {"url": "http://www.currentresults.com/Weather/Florida/Places/orlando-weather-in-march.php", "passage_text": "The temperature rises most days in March to over 70 °F (21 °C) in Orlando. March temperatures above 90 °F (32 °C) happen here once every few years. The thermometer dips to 50 °F (10 °C) or below on an average of 7 nights. Occasionally March does get as cold as 40 °F (4 °C). Sunlight in March at Orlando lasts for 12 hours and 1 minute a day on average. The shortest day of the month is the 1st with 11 hours and 35 minutes of daylight. By the end of the month, the days have lengthened to 12:27 from sunrise to sunset."}, {"url": "https://weatherspark.com/averages/31163/3/Orlando-Florida-United-States", "passage_text": "This report describes the typical weather at the Orlando Executive Airport (Orlando, Florida, United States) weather station over the course of an average March. It is based on the historical records from 1989 to 2012. Earlier records are either unavailable or unreliable. "}]