[{"url": "https://in.answers.yahoo.com/question/index?qid=20070905103046AAR3s1P", "passage_text": "For example, if your cycle is 28 days long and your luteal phase is 12 days long, the ovulation will occur on day 16 of your cycle (28-12=16). Ovulation Calendar uses this formula to calculate your time of ovulation."}, {"url": "https://www.huggies.com.au/conception/ovulation/calculator/cycle/luteal-phase", "passage_text": "Luteal Phase. This is the phase of your menstrual cycle which begins after you have ovulated and lasts until either pregnancy occurs or the breakdown of the corpus luteum has begun. The typical length for a luteal phase is 10 – 16 days, though most commonly it lasts for around 14 days."}, {"url": "http://www.ovulation-calendar.com/hlp-d04-luteal-phase.html", "passage_text": "The luteal phase, also referred to as 'days past ovulation' or 'DPO', is the part of the cycle that starts at ovulation and ends the day before your next period. It usually lasts about 14 days and does not vary by more than a day in each person."}, {"url": "http://mymonthlycycles.com/lutealcalc.jsp", "passage_text": "The luteal phase is the third and final phase of the menstrual cycle, following ovulation. Also referred as as DPO (days past ovulation), its length is the number of days between ovulation up to the day before the start of your next period. A normal luteal phase is considered to be between 10 and 16 days."}, {"url": "http://www.menstruation-info-with-doc.com/luteal-phase-length.html", "passage_text": "The luteal phase is simply the length of the luteal phase, the phase of the menstrual cycle between ovulation and menstruation. It. is sometimes called the Days Post Ovulation(DPO) by some women. Practically, the luteal phase length(LPL) is the number of days from the. day after ovulation to the day before menses. The normal range is. usually 12 to 16 days, with an average of 14 days."}, {"url": "http://www.thefertilityrealm.com/luteal-phase.html", "passage_text": "The luteal phase is the second half of your menstrual cycle. It starts the day after ovulation and ends the day before you get your menstruation period. The length is usually consistent each cycle. The average luteal phase length is typically 14 days long. But normal ranges are from 10 to 16 days in length. If it is shorter than 10 days then you may have a luteal phase defect."}]