[{"url": "http://feeco.com/agglomerate-material/", "passage_text": "What is Agglomeration. Agglomeration is a process that allows materials to collect in a mass, such as a pellet or granule. It can either increase or decrease the porosity or density of a material. There are two basic methods of agglomeration: pressure and non-pressure."}, {"url": "http://www.merriam-webster.com/dictionary/agglomeration", "passage_text": "Full Definition of AGGLOMERATION. 1. : the action or process of collecting in a mass. 2. — ag·glom·er·a·tive \\-ˈglae-ˈglä-mə-ˌrā\\ tiv. adjective"}, {"url": "http://www.definitions.net/definition/urban%20agglomeration", "passage_text": "The term agglomeration is also linked to conurbation, which is a more specific term for large urban clusters where the built-up zones of influence of distinct cities or towns are connected by continuous built-up development, even in different regions, states or countries,."}, {"url": "http://www.powderbulksolids.com/article/what-agglomeration", "passage_text": "Agglomeration also changes the bulk characteristics of particulate solids—usually for the better. Larger particles have less dust, exhibit improved flow behavior, and feature reduced sticking tendencies. Storage, handling, and feeding of materials with large particles are less risky, even for difficult materials."}, {"url": "http://www.powderbulksolids.com/article/what-agglomeration", "passage_text": "Agglomeration, the sticking of particles to one another or to solid surfaces, is a natural phenomenon. For powders and bulk solids, agglomeration can be unwanted, resulting in uncontrolled buildup, caking, bridging, or lumping."}, {"url": "http://www.sciencedirect.com/science/article/pii/B9780080449104001310", "passage_text": "In the context of economic geography, agglomeration may refer to a concentration in space of some entity, or the process by which such a spatial formation is created."}, {"url": "http://www.powderbulksolids.com/article/what-agglomeration", "passage_text": "Size enlargement through agglomeration is one of the four unit operations of mechanical process engineering (powder and bulk solids technologies). It involves combining particles to create products with new particle sizes."}, {"url": "http://www.youtube.com/watch?v=ow8WikGIfnc", "passage_text": "Agglomeration connects multiple particles together with bridges that allow water to flow between particles to enhance solubility and create a high performance powder product."}, {"url": "http://www.audioenglish.org/dictionary/agglomeration.htm", "passage_text": "The noun AGGLOMERATION has 2 senses: 1. a jumbled collection or mass. 2. the act of collecting in a mass; the act of agglomerating. Familiarity information: AGGLOMERATION used as a noun is rare."}]