[{"url": "http://www.wikihow.com/Grow-Sweet-Onions", "passage_text": "6. Plant the onions in the soil differently, depending if you are using seeds, seedlings or sets. 1  If you are growing sweet onions from seeds, plant each seed 3/8 of an inch (1 cm) deep and 1/2 inch (1.3 cm) apart. 2  When you plant rows, make sure they are 15 inches (38 cm) apart. 1 Rows should remain separated by 15 inches (38 cm). 2  If you are planting sweet onions from sets, plant them 3 inches (7.6 cm) apart, and rows at 15 inches (38 cm) apart. 3  Plant them shallowly, with the roots into the ground, and the bulb only about 1/4 inch (0.6 cm) into the ground."}, {"url": "http://www.gardenguides.com/116210-plant-walla-walla-onion-sets.html", "passage_text": "Overview. The mild taste of the Walla Walla onion can add a sweet flavor to any dish or meal where it can be used raw for the best taste. You'll want to plant Walla Walla onion sets as soon after you purchase them as possible so they don't start to go bad before they get in the ground. After planting you should start to see new growth within a few weeks and have onions ready for harvest in 115 days"}, {"url": "http://www.gardenguides.com/116210-plant-walla-walla-onion-sets.html", "passage_text": "Break up the ground where you will be planting your onions so the soil is loose. Spread four inches of compost or a well-rotted manure over the soil and use the shovel to turn the soil and mix the compost in. Drag a hand trowel or garden hoe through the soil to create a shallow trench only one inch deep. The mild taste of the Walla Walla onion can add a sweet flavor to any dish or meal where it can be used raw for the best taste."}, {"url": "http://homeguides.sfgate.com/plant-walla-walla-onion-sets-40633.html", "passage_text": "Sets are immature onions. Walla Walla onions are sweet white onions that are mild enough to eat raw. The sets, which are small bulbs, mature in about 56 days, producing a flattish tan-skinned onion. Space the rows 12 to 24 inches apart. Place a Walla Walla onion set in the row every 3 to 4 inches. Cover the sets with soil, but do not firm the soil over the top of the sets. This can compact the soil and make it difficult for the onion sprout to break through the soil"}, {"url": "http://www.wikihow.com/Grow-Sweet-Onions", "passage_text": "1 If you are growing sweet onions from seeds, plant each seed 3/8 of an inch (1 cm) deep and 1/2 inch (1.3 cm) apart. 2  When you plant rows, make sure they are 15 inches (38 cm) apart. 3  Once they become seedlings, you will want to thin your onions until they are 3 inches (7.6 cm) apart. 1 Rows should remain separated by 15 inches (38 cm). 2  If you are planting sweet onions from sets, plant them 3 inches (7.6 cm) apart, and rows at 15 inches (38 cm) apart. 3  Plant them shallowly, with the roots into the ground, and the bulb only about 1/4 inch (0.6 cm) into the ground."}, {"url": "http://homeguides.sfgate.com/grow-walla-walla-onions-containers-68225.html", "passage_text": "Place the Walla Walla bulb sets on the soil 3 to 6 inches apart, depending on the desired size of the bulbs. Place the sets 1 inch apart if some of the onions are planned for green onions. Sprinkle enough soil on top of the onion sets to cover the bulbs. Leave the tips showing above the soil. They are considered a long day onion variety, which means they need 14 to 15 hours of daylight to form bulbs. Walla Walla onions are suitable for container growing, which allows the plants to be moved in and out of shelter. Onions in containers grow well in areas that are not normally used for gardening."}, {"url": "http://homeguides.sfgate.com/plant-walla-walla-onion-sets-40633.html", "passage_text": "Walla Walla onions planted from sets mature earlier than other varieties of onions and can be harvested when the sweet onion bulbs are full sized and the tops fall over. Plant the sets in the spring as soon as the soil has dried enough not to stick to your gardening tools. Space the rows 12 to 24 inches apart. Place a Walla Walla onion set in the row every 3 to 4 inches. Cover the sets with soil, but do not firm the soil over the top of the sets. This can compact the soil and make it difficult for the onion sprout to break through the soil"}, {"url": "http://homeguides.sfgate.com/grow-walla-walla-onions-containers-68225.html", "passage_text": "Walla Walla onion sets resemble miniature onions. Walla Walla onions (Allium cepa “Walla Walla”) produce sweet mild-flavored bulbs reaching 2 to 4 inches in diameter with stalks growing up to 36 inches high. They are considered a long day onion variety, which means they need 14 to 15 hours of daylight to form bulbs. Walla Walla onions are suitable for container growing, which allows the plants to be moved in and out of shelter. Onions in containers grow well in areas that are not normally used for gardening."}]