[{"url": "http://www.boardmanclark.com/reading-room/pay-and-absence-concerns-for-exempt-employees/", "passage_text": "For example, if an employee who normally works 40 hours per week uses four hours of unpaid leave under the Family and Medical Leave Act, the employer could deduct 10 percent of the employee’s normal salary that week. Fee Basis. Administrative and professional employees may be paid on a fee basis, rather than on a salary basis. An employee will be considered to be paid on a “fee basis” within the meaning of these regulations if the employee is paid an agreed sum for a single job regardless of the time required for its completion."}, {"url": "http://www.healthcare-salaries.com/physicians/pediatrician-salary", "passage_text": "The minimum salary a pediatrician can earn, in New Zealand, is $ 1,042 on a monthly basis. The maximum salary a pediatrician can earn in New Zealand is $ 90,000 on a monthly basis. On aggregate, the median salary paid to pediatricians in New Zealand is $ 5,400 on a monthly basis. The maximum salary a pediatrician earns is also ZAR 40,000 on a monthly basis. Thus on average the pay scale for a pediatrician with a master’s degree in South Africa is ZAR 40,000 per month. Subsequently, that translates to approximately ZAR 480,000 per year"}, {"url": "http://www.inc.com/suzanne-lucas/the-employment-law-you-are-probably-breaking.html", "passage_text": "If an employee is subject to this law (non-exempt), when they reach more than 40 hours in a given work week, they have to be paid at time and a half for any additional hours. If they are not subject to the law (exempt), they aren't eligible for overtime, but there are other rules that come with, like no docking pay. This means that no matter how much it annoys you, if you have an exempt employee who takes off two hours early to do anything--doctor's appointment, soccer tournament, just plain bored and wanted to go home--you cannot dock her pay. It's helpful to think of this in terms of a touch the wall rule."}, {"url": "http://money.usnews.com/money/blogs/outside-voices-careers/2012/05/24/how-to-move-from-hourly-employee-to-salaried-worker", "passage_text": "Typically, a move from hourly to salaried work comes with a promotion and additional responsibility. As long as you're up for the extra work, there's no reason not to take the raise. But realize that if you work more than 40 hours in a week (which many salaried workers do), you won't get any extra money. Even if you don't get a promotion, you may get other perks that make the move from hourly to salary worth the trouble."}, {"url": "http://www.answers.com/Q/FAQ/2148", "passage_text": "From the U.S. Department of Labor: According to the U.S. Bureau of Labor Statistics the estimated mean annual wage for Pharmacy Technicians as of May 2008 is, $28,500. This would amount to $13.70 per hour. The middle 50 percent earned between $10.95 and $15.88. "}, {"url": "http://www.boardmanclark.com/reading-room/pay-and-absence-concerns-for-exempt-employees/", "passage_text": "of salary required for exemption under these regulations, the amount. paid to the employee will be tested by determining the time worked. on the job and whether the fee payment is at a rate that would amount. to at least $455 per week if the employee worked 40 hours. Fee Basis. Administrative and professional employees may be paid on a fee basis, rather than on a salary basis. An employee will be considered to be paid on a “fee basis” within the meaning of these regulations if the employee is paid an agreed sum for a single job regardless of the time required for its completion."}, {"url": "http://www.healthcaresalaryonline.com/pediatrician-salary.html", "passage_text": "The average salary is $74.00 per hour. The lowest 10% earn $42 per hour and those in the upper 10% earn more than $96 per hour. Annually. On an annual basis the average wage is $153,920 The lowest 10% earn less than $88,000 per year while the upper 10% earn more than $199,000 per year. These salaries are calculated as a mean or median wage. Lowest and Highest Salary. Private Practice vs. Employment. Pediatricians in private practice earn a median salary of approximately $154,000 per year. The highest reported salary was over $222,000 per year and the lowest was $85,000."}, {"url": "http://www.healthcare-salaries.com/physicians/pediatrician-salary", "passage_text": "The overall median salary for a typical pediatrician in the United States is about $171,467 per year while an average hourly wage is about $40.76 per hour. The maximum salary a pediatrician earns is also ZAR 40,000 on a monthly basis. Thus on average the pay scale for a pediatrician with a master’s degree in South Africa is ZAR 40,000 per month. Subsequently, that translates to approximately ZAR 480,000 per yea"}, {"url": "http://www.healthcare-salaries.com/physicians/pediatrician-salary", "passage_text": "Conclusion about pediatrician salary. An average salary for a highest paid pediatrician is around more than $200,000 per year while a lowest paid pediatrician receives a much lesser salary of about $85,000 per annum. The maximum salary a pediatrician earns is also ZAR 40,000 on a monthly basis. Thus on average the pay scale for a pediatrician with a master’s degree in South Africa is ZAR 40,000 per month. Subsequently, that translates to approximately ZAR 480,000 per year"}]