[{"url": "https://www.healthtap.com/topics/diffuse-increased-echogenicity-of-the-liver", "passage_text": "Get help from a doctor now ›. Explanation: The term diffusely increased echogenicity of the liver is most commonly used in the ultrasound report to indicate that there is diffusely increased fat content in the liver, also called steatosis."}, {"url": "http://mariomcloughlin.8m.com/fattyliver.htm", "passage_text": "The difference between the thickness of preabdominal fat of patients with increased hepatic echogenicity in reference to a control group. 4. The reports that have related increased hepatic echogenicity with fatty liver and not with hepatic fibrosis (1,2). 5."}, {"url": "http://www.gastro.net.au/diseases/fattyliver.html", "passage_text": "Other names: hepatic steatosis or steatohepatitis. Fatty liver is one of the most common liver diseases in Western countries. In this condition fat accumulates in liver cells (hepatocytes), causing cell enlargement (fatty liver or steatosis) and sometimes damage to the cell (steatohepatitis)."}, {"url": "http://www.justanswer.com/medical/27yfv-does-mean-liver-diffusely-increased-echogenicity.html", "passage_text": "I read your question. Echogenicity is the ability to create an echo, i.e. return a signal in ultrasound examinations. Increased echogenicity of the liver usually means that there is fatty infiltration in parts of the liver. In certain causes a focal area of increased echogenicity would indicate a discrete mass. However, in your case, a diffuse increase would mean a fatty liver."}, {"url": "http://radiopaedia.org/articles/generalised-increase-in-hepatic-echogenicity", "passage_text": "Causes of generalised increased liver echogenicity includes: 1  diffuse fatty infiltration. 2  cirrhosis: can be coarsened as well. 3  chronic hepatitis 3: can be coarsened as well. 4  diffuse infiltration or deposition. 5  malignant process."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/12236486", "passage_text": "Increased liver echogenicity at ultrasound examination reflects degree of steatosis but not of fibrosis in asymptomatic patients with mild/moderate abnormalities of liver transaminases. Mathiesen UL(1), Franzen FRANZéN, Le Aselius, H Resjoe, Resjö M, Jacobsson L, Foberg U, Fryden Frydén. a bodemar g"}]