[{"url": "http://abcnews.go.com/GMA/OnCall/women-fertility-falls-lose-90-percent-eggs-30/story?id=9693015", "passage_text": "Women who have more pregnancies are fertile for longer, and some women are born with more eggs than others, she said. The more eggs with which a woman is born, the longer she will be fertile and more time she will have until the onset of menopause. The study published by the University of St. Andrews and Edinburgh University in Scotland found that women have lost 90 percent of their eggs by the time they are 30 years old, and only have about 3 percent remaining by the time they are 40. null."}, {"url": "https://answers.yahoo.com/question/index?qid=20071215170445AAgI58z", "passage_text": "A baby girl is born with egg cells (oocytes) in her ovaries. Between 16 and 20 weeks of pregnancy, the ovaries of a female fetus contain 6 to 7 million oocytes. Most of the oocytes gradually waste away, leaving about 1 to 2 million present at birth. None develop after birth. At puberty, only about 300,000—more than enough for a lifetime of fertility—remain"}, {"url": "http://www.infertile.com/beating-biological/", "passage_text": "Remember, women are born with all the eggs they are ever going to have, and they don’t make any new eggs during their lifetime. Women are born with approximately two million eggs in their ovaries, but about eleven thousand of them die every month prior to puberty. As a teenager, a woman has only three hundred thousand to four hundred thousand remaining eggs, and from that point on, approximately one thousand eggs are destined to die each month. "}, {"url": "http://www.webmd.com/sex-relationships/guide/your-guide-female-reproductive-system?page=4", "passage_text": "The vast majority of the eggs within the ovaries steadily die, until they are depleted at menopause. At birth, there are approximately 1 million to 2 million eggs; by the time of puberty, only about 300,000 remain. Of these, only about 500 will be ovulated during a woman's reproductive lifetime. "}, {"url": "http://www.cledp.com/donate-eggs/how-many-egg-are-you-born-with.html", "passage_text": "A new born baby girl is born with egg cell (oocytes) in her ovaries. Between 16 and 20 weeks of pregnancy, the ovaries of a female fetus contain 6 to 7 million oocytes. Most of the oocytes gradually waste away, leaving about 1 to 2 million present at birth. "}, {"url": "https://answers.yahoo.com/question/index?qid=20070919155220AAhBS4K", "passage_text": "At birth, each woman has about 1,000,000 eggs available for fertilization. Only a small minority of these eggs will have the proper quality for fertilization. Egg Quantity as You Age As you age, the number of eggs in your ovaries begins to decrease. A woman of 40 typically has lower egg quality than a woman of 20. This is not to say that your eggs are of poor quality just because you're aging. Many younger women have poor quality eggs while some older women have very high quality eggs. On average however, egg quality does decline with ag"}, {"url": "http://www.sialis.org/eggnumbers.htm", "passage_text": "The number of eggs a female bird will lay before her clutch is complete depends on several factors: 1  Species: For example, an Eastern Bluebird may lay 4-7 eggs. ( 2 Four or five is most common.) A Black-capped Chickadee typically lays 6-8 per clutch, with as many as 13 reported. "}, {"url": "http://www.nytimes.com/2013/02/01/booming/womens-eggs-diminish-with-age.html", "passage_text": "When girls are born, they have about two million eggs in their ovaries, nestled in fluid-filled cavities called follicles. That may sound like a lot, but consider that months earlier, when they were still in utero, they may have had as many as six or seven million eggs. For all the eggs a woman begins with, in the end only about 400 will go through ovulation. While men produce sperm throughout their lives, over time the number of eggs declines, and they disappear with increasing frequency the decade or so before menopause."}]