[{"url": "http://www.restaurant.org/News-Research/News/Sustainability-a-key-ingredient-to-cutting-food-co", "passage_text": "Roughly three-quarters of all restaurant operators reported food costs as a challenge last year, and among those: 1  78 percent of casual-dining restaurants increased food waste tracking; 2  74 percent of fine-dining operators did the same; as did. 3  70 percent of quick-service operators; Among those, 67 percent of fine-dining establishments, 49 percent of family-dining operators, and 46 percent of casual-dining restaurants incorporated more local sourcing into the menu mix. Purchase the 2015 Restaurant Industry Forecast here."}, {"url": "http://www.restaurant.org/News-Research/Research/Operations-Report", "passage_text": "Median income before taxes for fullservice restaurants was 4.1 percent of total sales in operations where the average check is under $15; 5 percent for restaurants with an average check of $15 to $24.99; and 4.5 percent for fullservice operations with average checks of $25 and over. "}, {"url": "http://www.wikihow.com/Calculate-Food-Cost", "passage_text": "Find out your potential food cost. To calculate your potential food cost, multiply the total cost by 100, then divide that number by your total sales. In our example, we would complete the following equation: ($3,000 X 100) ÷ $8,000 = 37.5. Our potential food cost is 37.5% of our budget."}, {"url": "http://www.starchefs.com/cook/business-tips/how-to-calculate-food-cost", "passage_text": "That number is divided by your sales and a percentage of sales is calculated for the cost. So when we say you have a food cost of 40% that means you spent .40 for every dollar you took in sales. Example. Your data: $10,000 beginning inventory, $2,000 in purchases, $10,500 ending inventory, $5,000 in sales."}, {"url": "http://www.fastcasual.com/articles/fast-casual-heats-up-restaurant-industry-with-11-percent-growth/", "passage_text": "The rest of the top 20 was dominated by fast casual concepts as well, with some casual, quick-service and pizza concepts sprinkled throughout. They include: 1  Del Frisco's Grill, 83.9 percent in sales; 120 percent in units; 2  Twin Peaks, 68.4 percent; 64.3 percent; Top 50 dominated by fast casual. The 50 fastest growing chains in the Technomic Top 500 were led by better burger concept BurgerFi, which increased U.S. systemwide sales by 178 percent, to $44.5M, and unit count by 175 percent, to 33 units."}, {"url": "http://smallbusiness.chron.com/average-profit-margin-restaurant-13477.html", "passage_text": "Full-Service Restaurants. Full-service restaurants at all levels spent about 32 percent of each dollar on the cost of food and beverages, 33 percent on salaries and wages, and from 5 percent to 6 percent on restaurant occupancy costs. Profit margins, however, varied according to the cost of the average check per person. Those with checks under $15 showed a profit of 3 percent. Those with checks from $15 to $24.99 boasted the highest profit margin at 3.5 percent. Finally, those with checks of $25 and over had the lowest profits, at 1.8 percent"}, {"url": "http://smallbusiness.chron.com/common-food-labor-cost-percentages-14700.html", "passage_text": "How Food and Labor Costs are Calculated. Food and labor costs are calculated as a percentage of the total volume of sales. If a restaurant does $20,000 per week and the total cost of food and beverages is $7,000 for that week, then the food cost is considered 35 percent. If, at the same restaurant, labor (including payroll taxes and benefits) equal $5,000 for the week, then the labor cost is 25 percent. Total prime costs are 60 percent in this example. Related Reading: How to Control Cost of Food & Labor in a Restaurant Service. Food costs (including beverages) for the restaurant industry run typically from the 25 percent to 38 percent range, depending upon the style of restaurant and the mix of sales. In order to make money in the restaurant business, prime costs should generally be in the 60 percent to 65 percent range."}, {"url": "http://www.fastcasual.com/articles/fast-casual-heats-up-restaurant-industry-with-11-percent-growth/", "passage_text": "The honeymoon phase seems far from over for the fast casual segment, judging by Technomic's newly released 2014 Top 500 Chain Restaurants report. According to the market research firm, the segment grew sales by 11 percent in 2013, and unit count by nearly 8 percent. The largest fast casual concepts — Panera, Chipotle and Panda Express — each generated strong sales gains as well, of 12, 17 and 11 percent, respectively. Technomic's report said drivers of fast casual's growth include better-than-quick-service food, ambiance and fresh, made for you appeal. Top 50 dominated by fast casual. The 50 fastest growing chains in the Technomic Top 500 were led by better burger concept BurgerFi, which increased U.S. systemwide sales by 178 percent, to $44.5M, and unit count by 175 percent, to 33 units."}]