[{"url": "http://www.cod.edu/people/faculty/fancher/cellstructure.htm", "passage_text": "There are also three kinds of structures found in plant cells and not in animal cells. 1  cells have. ; 2  animal cells do not. 3  As noted in the description of the prokaryotic cell wall, the cell must also have a plasma membrane. 4  Plant cells have cell walls in addition to plasma membranes, not instead of plasma membranes. 1 The. 2  for a eukaryotic cell is the same kind of structure, and has the same function as the plasma membrane of a prokaryotic cell. ( 3 ER) is a system of membrane-enclosed channels which ramifies throughout the cytoplasm of the cell. 4  It comes in two types--smooth and rough."}, {"url": "http://www.cod.edu/people/faculty/fancher/cellstructure.htm", "passage_text": "Eukaryotic cells, while very similar in function to prokaryotic cells, are much larger and more complex. They are typically characterized by the presense of a prominent, more or less central nucleus. Viewed through a light microscope, this nucleus is by far the most striking visible feature of the cell. 1 The. 2  for a eukaryotic cell is the same kind of structure, and has the same function as the plasma membrane of a prokaryotic cell. ( 3 ER) is a system of membrane-enclosed channels which ramifies throughout the cytoplasm of the cell. 4  It comes in two types--smooth and rough."}, {"url": "http://www.nature.com/scitable/topicpage/what-is-a-cell-14023083", "passage_text": "If the DNA within a cell is not separated from the cytoplasm, then that cell is a prokaryote. All known prokaryotes, such as bacteria and archaea, are single cells. In contrast, if the DNA is partitioned off in its own membrane-bound room called the nucleus, then that cell is a eukaryote. Cells can vary between 1 micrometer (μm) and hundreds of micrometers in diameter. Within a cell, a DNA double helix is approximately 10 nanometers (nm) wide, whereas the cellular organelle called a nucleus that encloses this DNA can be approximately 1000 times bigger (about 10 μm)."}, {"url": "http://www.cod.edu/people/faculty/fancher/cellstructure.htm", "passage_text": "1 , which is quite different from the peptidoglycan of prokaryotic cell walls. 2  The primary function of the cell wall is support, and inconjunction with the central vacuole, to create turgor (stiffness) in plant structures like leaves. 3  Plant cells contain a specialized vacuole called the. . 1 The. 2  for a eukaryotic cell is the same kind of structure, and has the same function as the plasma membrane of a prokaryotic cell. ( 3 ER) is a system of membrane-enclosed channels which ramifies throughout the cytoplasm of the cell. 4  It comes in two types--smooth and rough."}, {"url": "http://www.nature.com/scitable/topicpage/what-is-a-cell-14023083", "passage_text": "That's because all cells are surrounded by a structure called the cell membrane — which, much like the walls of a house, serves as a clear boundary between the cell's internal and external environments. The cell membrane is sometimes also referred to as the plasma membrane. Cells can vary between 1 micrometer (μm) and hundreds of micrometers in diameter. Within a cell, a DNA double helix is approximately 10 nanometers (nm) wide, whereas the cellular organelle called a nucleus that encloses this DNA can be approximately 1000 times bigger (about 10 μm)."}, {"url": "http://micro.magnet.fsu.edu/cells/animalcell.html", "passage_text": "Animal Cell Structure Animal cells are typical of the eukaryotic cell, enclosed by a plasma membrane and containing a membrane-bound nucleus and organelles. Unlike the eukaryotic cells of plants and fungi, animal cells do not have a cell wall."}, {"url": "http://www.biology4kids.com/files/cell_main.html", "passage_text": "Plant cells are easier to identify because they have a protective structure called a cell wall made of cellulose. Plants have the wall; animals do not. Plants also have organelles such as the green chloroplast or large, water-filled vacuoles. Chloroplasts are the key structure in the process of photosynthesis. There are smaller pieces that make up cells such as macromolecules and organelles. A protein is an example of a macromolecule while a mitochondrion is an example of an organelle. Cells can also connect to form larger structures."}, {"url": "https://en.wikipedia.org/wiki/Cell_(biology)", "passage_text": "The cell (from Latin cella, meaning small room) is the basic structural, functional, and biological unit of all known living organisms. Cells are the smallest unit of life that can replicate independently, and are often called the building blocks of life. The study of cells is called cell biology. Cells consist of cytoplasm enclosed within a membrane, which contains many biomolecules such as proteins and nucleic acids."}, {"url": "http://www.cod.edu/people/faculty/fancher/cellstructure.htm", "passage_text": "1 , which is very different from the plasma membrane. 2  Cells with cell walls also have plasma membranes; the wall can't perform the diffusion barrier tasks of the plasma membrane. 3  One of the primary functions of the cell wall is physical support. 4  Some kinds of bacterial cell walls also have other functions. 1 The. 2  for a eukaryotic cell is the same kind of structure, and has the same function as the plasma membrane of a prokaryotic cell. ( 3 ER) is a system of membrane-enclosed channels which ramifies throughout the cytoplasm of the cell. 4  It comes in two types--smooth and rough."}]