[{"url": "http://guardianlv.com/2013/09/legal-safe-opioid-for-pain-relief/", "passage_text": "Opioids are perhaps the oldest drug known to man. The opium poppy has been used for pain relief since before recorded history. Most opioids are either illegal or restricted by prescriptions only because they have been found to be highly addictive. However, there is a legal, safe opioid found extremely effective for pain relief that can be purchased over-the-counter. "}, {"url": "http://thurstontogether.org/drugFacts/opioids.html", "passage_text": "Heroin is a semi-synthetic opioid, derived from morphine, that is illegal in the United States and highly addictive. It is used as both a painkiller and a recreational drug for its euphoric, “body-high” effects and has an extremely high potential for abuse. Codeine: Codeine is a natural opiate, though it can also be synthesized from morphine. It is less potent than morphine, and like all opioids has the potential for physical and psychological addiction, though milder than morphine or heroin. It is prescribed to treat cough, diarrhea and pain."}, {"url": "http://www.samhsa.gov/atod/opioids", "passage_text": "Opioids. Get the facts on the misuse and abuse of prescription opioids such as hydrocodone, oxycodone, morphine, and codeine, and the illegal opioid, heroin. Opioids are a class of drugs chemically similar to alkaloids found in opium poppies. Historically they have been used as painkillers, but they also have great potential for misuse. Repeated use of opioids greatly increases the risk of developing an opioid use disorder. The use of illegal opiate drugs such as heroin and the misuse of legally available pain relievers such as oxycodone and hydrocodone can have serious negative health effects."}, {"url": "https://en.wikipedia.org/wiki/Opioid", "passage_text": "Opioid like compounds found in natural opium latex are classified as opiates, not opioids. In 2013 between 28 and 38 million people used opioids recreationally (0.6% to 0.8% of the global population between the ages of 15 and 65). Many of the alkaloids and other derivatives of the opium poppy are not opioids or narcotics; the best example is the smooth-muscle relaxant papaverine. Noscapine is a marginal case as it does have CNS effects but not necessarily similar to morphine, and it is probably in a category all its own."}, {"url": "https://en.wikipedia.org/wiki/Opioid", "passage_text": "Although the term opiate is often used as a synonym for opioid, the term opiate is properly limited to the natural alkaloids found in the resin of the Papaver somniferum (opium poppy), while opioid refers to synthetic substances. Many of the alkaloids and other derivatives of the opium poppy are not opioids or narcotics; the best example is the smooth-muscle relaxant papaverine. Noscapine is a marginal case as it does have CNS effects but not necessarily similar to morphine, and it is probably in a category all its own."}, {"url": "http://www.camh.ca/en/hospital/health_information/a_z_mental_health_and_addiction_information/oxycontin/Pages/opioids_dyk.aspx", "passage_text": "Opioids are a family of drugs that have morphine-like effects. The primary medical use for prescription opioids is to relieve pain. Other medical uses include control of coughs and diarrhea, and the treatment of addiction to other opioids. Federal laws regulate the possession and distribution of all opioids. Use of prescription opioids is legal only when they are prescribed by a licensed medical practitioner, and are used by the person to whom they are prescribed."}, {"url": "https://en.wikipedia.org/wiki/Opioid", "passage_text": "Opioids are substances that act on the nervous system in a similar way to opiates such as morphine and codeine. In a medical context the term usually indicates medications that are artificially made rather than extracted from opium. Many of the alkaloids and other derivatives of the opium poppy are not opioids or narcotics; the best example is the smooth-muscle relaxant papaverine. Noscapine is a marginal case as it does have CNS effects but not necessarily similar to morphine, and it is probably in a category all its own."}, {"url": "http://www.narcotics.com/opioids/", "passage_text": "Opioid drugs belong to the opiates class of drugs. Opiates are derived from the opium plant, grown in various regions, some of which include Afghanistan, Thailand, Mexico, Northern India, Hungary, Turkey, Laos, Burma and Colombia. Opioids are synthetic formulations of the original plant material."}, {"url": "http://www.narcotics.com/opioids/opioids-list/", "passage_text": "Opioids List. Codeine: An analgesic drug that comes from morphine, used in many cough syrups and mild pain relievers and not as powerful as morphine. Morphine: Considered a narcotic drug that is analgesic and powerful; morphine is used in many hospitals and is the main source in powerful pain killers. Most of the medicines prescribed for pain relief are opioids. Oxycodone: Pain reliever that comes in an oral tablet that is used to treat moderate to severe pain all day long. Oxycodone is also known as Oxycontin and Roxicodone. Opioids should only be taken as prescribed by a doctor because of the addictive natures of the drugs and the high dependency that comes with them. People who abuse opioids have a high risk of health problems and can overdose on the drug causing a fatality to occur or causing a coma state to occur."}]