[{"url": "http://www.biology-online.org/dictionary/Rough_endoplasmic_reticulum", "passage_text": "Rough endoplasmic reticulum. Definition. noun. (cell biology). An endoplasmic reticulum (ER), a eukaryotic organelle made up of a system of membranous tubes and sacs, that is studded with ribosomes on its surface giving it a rough appearance under the microscope (hence its name). Supplement."}, {"url": "http://www.biology4kids.com/files/cell_er.html", "passage_text": "Another organelle in the cell is the endoplasmic reticulum (ER). While the function of the nucleus is to act as the cell brain, the ER functions as a manufacturing and packaging system. It works closely with the Golgi apparatus, ribososmes, mRNA, and tRNA. "}, {"url": "https://en.wikipedia.org/wiki/Endoplasmic_reticulum", "passage_text": "The general structure of the endoplasmic reticulum is a network of membranes called cisternae. These sac-like structures are held together by the cytoskeleton. The phospholipid membrane encloses a space, the cisternal space (or lumen), which is continuous with the perinuclear space but separate from the cytosol. 1 Nucleus 2 Nuclear pore 3 Rough endoplasmic reticulum (RER) 4 Smooth endoplasmic reticulum (SER) 5 Ribosome on the rough ER 6 Proteins that are transported 7 Transport vesicle 8 Golgi apparatus 9 Cis face of the Golgi apparatus 10 Trans face of the Golgi apparatus 11 Cisternae of the Golgi apparatus."}, {"url": "http://bscb.org/learning-resources/softcell-e-learning/endoplasmic-reticulum-rough-and-smooth/", "passage_text": "Ribosomes on the rough endoplasmic reticulum are called ‘membrane bound’ and are responsible for the assembly of many proteins. This process is called translation. Certain cells of the pancreas and digestive tract produce a high volume of protein as enzymes. There are two types of endoplasmic reticulum: rough endoplasmic reticulum (rough ER) and smooth endoplasmic reticulum (smooth ER). Both types are present in plant and animal cells. The two types of ER are separate entities and are not joined together."}, {"url": "https://en.wikipedia.org/wiki/Endoplasmic_reticulum", "passage_text": "There are two types of endoplasmic reticulum, rough and smooth. The outer (cytosolic) face of the rough endoplasmic reticulum is studded with ribosomes that are the sites of protein synthesis. The rough endoplasmic reticulum is especially prominent in cells such as hepatocytes. 1 Nucleus 2 Nuclear pore 3 Rough endoplasmic reticulum (RER) 4 Smooth endoplasmic reticulum (SER) 5 Ribosome on the rough ER 6 Proteins that are transported 7 Transport vesicle 8 Golgi apparatus 9 Cis face of the Golgi apparatus 10 Trans face of the Golgi apparatus 11 Cisternae of the Golgi apparatus."}, {"url": "http://study.com/academy/lesson/rough-endoplasmic-reticulum-definition-structure-functions.html", "passage_text": "There are two types of endoplasmic reticulum: smooth and rough. Rough endoplasmic reticulum is a form of endoplasmic reticulum that is studded with ribosomes. Since it has ribosomes stuck all over it, it has a bumpy appearance and is therefore called rough endoplasmic reticulum. The membranes that make up the rough endoplasmic reticulum are composed of lipids just like the membrane that surrounds the entire cell itself. The surface of rough endoplasmic reticulum is dotted with other organelles known as ribosomes. Ribosomes are cellular organelles composed of two subunits that produce proteins."}, {"url": "http://www.answers.com/Q/What_is_Rough_Endoplasmic_Reticulum", "passage_text": "Rough endoplasmic reticulum is a cell organelle that helps in protein synthesis as well as packaging of materials into lysosomes and secretory activities of cell. Rough endoplasmic reticulum is so called because its outer surface  is studded with ribosomes. These ribosomes serve as the sites for  the translation of RNA into proteins. … The primary function of the  rough endoplasmic reticulum is protein synthesis."}, {"url": "https://en.wikipedia.org/wiki/Endoplasmic_reticulum", "passage_text": "The surface of the rough endoplasmic reticulum (often abbreviated RER or Rough ER) (also called ergastoplasm) is studded with protein-manufacturing ribosomes giving it a rough appearance (hence its name). The binding site of the ribosome on the rough endoplasmic reticulum is the translocon. 1 Nucleus 2 Nuclear pore 3 Rough endoplasmic reticulum (RER) 4 Smooth endoplasmic reticulum (SER) 5 Ribosome on the rough ER 6 Proteins that are transported 7 Transport vesicle 8 Golgi apparatus 9 Cis face of the Golgi apparatus 10 Trans face of the Golgi apparatus 11 Cisternae of the Golgi apparatus."}, {"url": "http://biology.about.com/od/cellanatomy/ss/endoplasmic-reticulum.htm", "passage_text": "The endoplasmic reticulum is a network of tubules and flattened sacs that serve a variety of functions in the cell. There are two regions of the ER that differ in both structure and function. One region is called rough ER because it has ribosomes attached to the cytoplasmic side of the membrane. The other region is called smooth ER because it lacks attached ribosomes. Typically, the smooth ER is a tubule network and the rough ER is a series of flattened sacs. The space inside of the ER is called the lumen."}, {"url": "http://micro.magnet.fsu.edu/cells/endoplasmicreticulum/endoplasmicreticulum.html", "passage_text": "The surface of rough endoplasmic reticulum is covered with ribosomes, giving it a bumpy appearance when viewed through the microscope. This type of endoplasmic reticulum is involved mainly with the production and processing of proteins that will be exported, or secreted, from the cell. The Endoplasmic Reticulum The endoplasmic reticulum (ER) is a network of flattened sacs and branching tubules that extends throughout the cytoplasm in plant and animal cells."}]