[{"url": "http://www.askthecatdoctor.com/cat-ringworm.html", "passage_text": "Usually the hair loss in cats that is caused by ringworm will be found on the face or head area, around the ears or neck, paws (especially in the nail beds or folds of skin between toes), and/or tail base. Sometimes, if the infection is bad enough, the areas can develop boils that ooze, but this is rare."}, {"url": "https://oregonvma.org/care-health/zoonotic-diseases-dogs", "passage_text": "Ringworm. Ringworm is not a worm, but a skin and scalp disease caused by fungus. Ringworm usually makes a bald patch of scaly skin or a ring-shaped rash that is reddish and may be itchy. The rash can be dry and scaly or wet and crusty. Ringworm is transmitted by direct contact with an infected animal's skin or hair."}, {"url": "http://vetmedicine.about.com/od/zoonotic/a/CW-Ringworm.htm", "passage_text": "Ringworm is not, as the name suggests, a disease caused by a worm. It is instead a fungal infection of the skin. It is also known as dermatophytosis. Ringworm is contagious and very easily passed from one individual to another."}, {"url": "http://www.webmd.com/skin-problems-and-treatments/ss/slideshow-ringworm", "passage_text": "Ringworm is an example of a zoonotic disease (transmitted from animals to humans). Cats are among the most commonly affected animals. If a cat has ringworm, a person in the house often gets the infection. Dogs, cows, goats, pigs, and horses can also spread ringworm to humans."}, {"url": "http://www.organicvet.co.uk/Cattleweb/disease/ring/ring1.htm", "passage_text": "Ringworm is a fungal infection of the keratin in the skin and hair. Dermatophytes include Trichophytonand Microsporum spp. In cattle, T. verrusosumis of primary importance (Silveira et al., 2003). Cattle and sheep are commonly affected, but other species, including man and horse, can be infected."}, {"url": "http://adelaidevet.com.au/pet-library/zoonoses-healthy-pets-healthy-people", "passage_text": "Zoonotic diseases are those that can be passed from animals to people (like ringworm) and include diseases that infect both people and pets (like giardia). Our pets provide us with many benefits including comfort and companionship."}, {"url": "http://www.cdc.gov/fungal/diseases/ringworm/index.html", "passage_text": "Ringworm is a common skin infection that is caused by a fungus. It’s called “ringworm” because it can cause a circular rash (shaped like a ring) that is usually red and itchy. Anyone can get ringworm. The fungi that cause this infection can live on skin, surfaces, and on household items such as clothing, towels, and bedding."}, {"url": "http://www.organicvet.co.uk/Cattleweb/disease/ring/ring1.htm", "passage_text": "Thus, ringworm is a potential zoonotic disease. Clinical signs are often seen in the winter during the housed period. In cattle, the infection is usually seen in calves and young stock, where the lesions are mainly seen around the eyes, on the ears and on the back."}]