[{"url": "http://www.answers.com/Q/How_long_does_it_take_to_drive_from_Toronto_to_Calgary_through_Canada", "passage_text": "Answer   Depending on the route one takes and how long you drive each day, the answer can vary. As a rough estimate, the trip takes 3 to 5 days.   Be aware that the be … low information does not include stops for fuel, food, rest, etc. Nor does it take into account road or weather conditions. The driving time would be approximately 3 hours if you were to drive non-stop in … good driving conditions. (The driving time does not take into consideration conditions such as weather, road work and rush hour traffic in urban areas.). 11 people found this useful."}, {"url": "http://www.travelmath.com/driving-time/from/Toronto,+Canada/to/Calgary,+Canada", "passage_text": "How long is the drive from Toronto, Canada to Calgary, Canada? The total driving time is 33 hours, 8 minutes. Your trip begins in Toronto, Canada. It ends in Calgary, Canada. If you're planning a road trip, you might be interested in seeing the total driving distance from Toronto, Canada to Calgary, Canada."}, {"url": "http://www.travelmath.com/flying-time/from/Toronto,+Canada/to/Calgary,+Canada", "passage_text": "Flying time from Toronto, Canada to Calgary, Canada. The total flight duration from Toronto, Canada to Calgary, Canada is 3 hours, 53 minutes. This assumes an average flight speed for a commercial airliner of 500 mph, which is equivalent to 805 km/h or 434 knots. It also adds an extra 30 minutes for take-off and landing. Your exact time may vary depending on wind speeds. The calculation of flight time is based on the straight line flight distance from Toronto, Canada to Calgary, Canada (as the crow flies), which is about 1,688 miles or 2 716 kilometers."}, {"url": "http://www.whygocanada.com/getting-from-calgary-to-toronto.html", "passage_text": "Driving from Toronto to Calgary. You can rent a car and drive the 3300 km (or 3400 km) between Toronto and Calgary. Both available routes pass through the USA, so make sure to ask the car rental agency weather you are allowed to take the car over the border. The shortest route is via US-2 W and takes 1 day and 13 hours. Although Toronto is served by three airports, the one handling flights to Calgary is Toronto Pearson International Airport (YYZ) , located about 23 km from the city center. It is the busiest airport in Canada and hub for Air Canada, Air Canada Express, Air Transat, CanJet, Sunwing Airlines and WestJet."}, {"url": "http://www.answers.com/Q/How_long_does_it_take_to_drive_from_Toronto_to_Calgary_through_Canada", "passage_text": "How long does it take to drive from Fresno Calif to Toronto Canada? The driving distance between Fresno, CA and Toronto, ON, Canada is approximately 2600 miles. The driving time would be approximately 42 hours if you were to travel non-stop in … good driving conditions. The driving time would be approximately 3 hours if you were to drive non-stop in … good driving conditions. (The driving time does not take into consideration conditions such as weather, road work and rush hour traffic in urban areas.). 11 people found this useful."}, {"url": "http://www.travelmath.com/driving-time/from/Toronto,+Canada/to/Calgary,+Canada", "passage_text": "More trip calculations. 1  driving distance from Toronto, Canada to Calgary, Canada. 2  cost to drive from Toronto, Canada to Calgary, Canada. 3  reverse driving time from Calgary, Canada to Toronto, Canada. 4  halfway between Toronto, Canada and Calgary, Canada. 5  places to stop from Toronto, Canada to Calgary, Canada. Your trip begins in Toronto, Canada. It ends in Calgary, Canada. If you're planning a road trip, you might be interested in seeing the total driving distance from Toronto, Canada to Calgary, Canada."}, {"url": "http://www.travelmath.com/driving-time/from/Toronto,+Canada/to/Calgary,+Canada", "passage_text": "You can also calculate the cost to drive from Toronto, Canada to Calgary, Canada based on current local gas prices and an estimate of your car's best gas mileage. If you're meeting a friend, you might be interested in finding the city that is halfway between Toronto, Canada and Calgary, Canada. Your trip begins in Toronto, Canada. It ends in Calgary, Canada. If you're planning a road trip, you might be interested in seeing the total driving distance from Toronto, Canada to Calgary, Canada."}]