[{"url": "http://www.everydayhealth.com/arthritis/inflammatory-arthritis/enteropathic-arthritis.aspx", "passage_text": "Weighing the Pros and Cons of Joint Replacement. Back pain or swollen joints that occur in someone with an ongoing inflammatory bowel disease may indicate enteropathic arthritis, a type of arthritis that occurs in people who have ulcerative colitis or Crohn's disease. “When people get that kind of inflammation, [some] will [also] develop inflammation in the spine and other joints.”. Enteropathic Arthritis: Causes. Why people with inflammatory bowel disease develop arthritis is not completely understood. Nevertheless, researchers do have a few theories."}, {"url": "http://www.patienteducationcenter.org/articles/what-enteropathic-arthritis/", "passage_text": "Enteropathic arthritis develops in approximately 9% to 20% of people with ulcerative colitis or Crohn’s disease, which are types of inflammatory bowel disease. These disorders cause episodes of abdominal pain, diarrhea, and weight loss. Physicians treat enteropathic arthritis with medications similar to those used in rheumatoid arthritis, including NSAIDs, sulfasalazine, methotrexate, and anti-TNF medications (see “Medications for rheumatoid arthritis”)."}, {"url": "http://www.everydayhealth.com/rheumatic-diseases/diagnosing-enteropathic-arthritis.aspx", "passage_text": "6 Foods That Cause Pain. Enteropathic arthritis describes joint inflammation that occurs in association with inflammatory bowel disorders such as Crohn's disease and ulcerative colitis. Enteropathic arthritis is diagnosed largely based on symptoms, but your doctor may also order tests to confirm the diagnosis. 1 Inflammation of the sacroiliac joint, called sacroiliitis, is particularly suggestive of enteropathic arthritis. 2  Synovial fluid aspiration. 3  If you have swollen, painful joints, your doctor may use a small needle to extract a sample of fluid in order to rule out other causes of inflammation such as gout or an infection."}, {"url": "http://arthritis.emedtv.com/enteropathic-arthritis/enteropathic-arthritis.html", "passage_text": "Drugs that may be used to treat other symptoms include corticosteroids, immunosuppressive medicines, and TNF inhibitors. Enteropathic arthritis is a form of arthritis (joint inflammation) associated with inflammatory bowel diseases (IBDs) -- the two most common being Crohn's disease and ulcerative colitis. Most of these people will develop arthritis within the knees, hips, ankles, elbows, or wrists. These are known as peripheral joints. About 5 percent will develop the condition in the spine. Males and females are equally likely to develop enteropathic arthritis. It is more common in teenagers and young adults."}, {"url": "http://arthritis.emedtv.com/enteropathic-arthritis/enteropathic-arthritis.html", "passage_text": "Up to 20 percent of people with Crohn's disease or ulcerative colitis will develop enteropathic arthritis. Most of these people will develop arthritis within the knees, hips, ankles, elbows, or wrists. These are known as peripheral joints. About 5 percent will develop the condition in the spine. Males and females are equally likely to develop enteropathic arthritis. It is more common in teenagers and young adults."}, {"url": "http://www.healthguideinfo.com/other-types-arthritis/p112520/", "passage_text": "Here we will provide a detailed overview of this type of arthritis. slide 1 of 6. Enteropathic arthritis is a type of arthritis that affects the joints and the spine that commonly occurs in conditions, such as Crohn's disease, inflammatory bowel disease and ulcerative colitis. This type of arthritis is classified as a spondylarthropathy. "}, {"url": "http://www.patienteducationcenter.org/articles/what-enteropathic-arthritis/", "passage_text": "When arthritis develops in people with ulcerative colitis or Crohn’s disease, it usually affects multiple joints in the arms and legs. About 20% of people with enteropathic arthritis have sacroiliitis, an inflammation of the sacroiliac joints in the lowest region of the back. Physicians treat enteropathic arthritis with medications similar to those used in rheumatoid arthritis, including NSAIDs, sulfasalazine, methotrexate, and anti-TNF medications (see “Medications for rheumatoid arthritis”)."}, {"url": "http://arthritis.emedtv.com/enteropathic-arthritis/enteropathic-arthritis.html", "passage_text": "Often, joints such as the knees, ankles, elbows, and wrists are affected. Enteropathic arthritis is a form of arthritis (joint inflammation) associated with inflammatory bowel diseases (IBDs) -- the two most common being Crohn's disease and ulcerative colitis. Most of these people will develop arthritis within the knees, hips, ankles, elbows, or wrists. These are known as peripheral joints. About 5 percent will develop the condition in the spine. Males and females are equally likely to develop enteropathic arthritis. It is more common in teenagers and young adults."}, {"url": "http://rheuminfo.com/diseases/enteropathic-arthritis/what-is-it", "passage_text": "Diseases Enteropathic Arthritis. Enteropathic arthritis is a type of arthritis associated with inflammatory bowel diseases (IBD) such as ulcerative colitis or Crohn’s disease. It usually affects the joints of the lower limbs and the spine. It can also cause debilitating body aches similar to a disease called fibromyalgia. Enteropathic arthritis belongs to a group of arthritic diseases known as spondyloarthropathies. Other diseases in this family include ankylosing spondylitis, psoriatic arthritis, and reactive arthritis"}, {"url": "http://www.patienteducationcenter.org/articles/what-enteropathic-arthritis/", "passage_text": "Symptoms of enteropathic arthritis. 1  Arthritis in several joints, especially the knees, ankles, elbows, and wrists, and sometimes in the spine, hips, or shoulders. 2  Worsening of symptoms during flare-ups of inflammatory bowel disease. Physicians treat enteropathic arthritis with medications similar to those used in rheumatoid arthritis, including NSAIDs, sulfasalazine, methotrexate, and anti-TNF medications (see “Medications for rheumatoid arthritis”)."}]