[{"url": "http://climate-and-freshwater.info/climate_change/", "passage_text": "Increased water temperature will also lead to a change in food-web structure with higher winter survival of fish due to reduced ice-cover, and a general switch from dominance of zooplankton and aquatic macrophytes to fish and phytoplankton."}, {"url": "http://www.climate-and-freshwater.info/", "passage_text": "The purpose of the website is to provide information on climate change and freshwater related issues to water managers, scientists and the general public. The information presented in the website stems mainly from REFRESH output, but not exclusively so."}, {"url": "http://climate-and-freshwater.info/climate_change/", "passage_text": "Climate change Overview. Since the last ice age, around 11,000 years ago, the Earth s climate has remained relatively stable, with global temperatures averaging at about 14 C. However, in the last century climate has started to change rapidly as the Earth's temperature has increased by approximately 0.7°C."}, {"url": "http://climate-and-freshwater.info/climate_change/", "passage_text": "There are many factors that can cause a warming of our climate; for example, more energy from the sun, large natural events such as El Nino or an increased greenhouse effect. Scientists have ruled out the sun and natural variations in our climate as the major causes of the recent warming."}, {"url": "http://www.climatehotmap.org/global-warming-effects/lakes-and-rivers.html", "passage_text": "Climate change is already beginning to affect plants and animals that live in freshwater lakes and rivers, altering their habitat and bringing life-threatening stress and disease."}, {"url": "http://climate-and-freshwater.info/climate_change/", "passage_text": "The ecological response of freshwater ecosystems to climate change needs to allow for interactions between climate change and the many stressors already affecting rivers, lakes and wetlands."}, {"url": "http://www.davidsuzuki.org/issues/climate-change/science/impacts/water-impacts/", "passage_text": "Water impacts. Climate change will seriously affect water resources around the world. Changing water levels, temperatures and flow will in turn affect food supply, health, industry, transportation and ecosystem integrity. Ontario's quarter-million lakes and countless rivers and streams hold about one-third of the world's freshwater."}, {"url": "http://www.gracelinks.org/2380/the-impact-of-climate-change-on-water-resources", "passage_text": "The relationship between water, energy, agriculture and climate is a significant one. More and more, that relationship is falling out of balance jeopardizing food, water and energy security. Climate change is a phenomenon we can no longer deny as its effects have become increasingly evident worldwide."}]