[{"url": "http://www.lions.org/tiger.html", "passage_text": "At that time, the tiger has instead become tagged with the scientific name Panthera tigris. Note that Panthera as a word could be Oriental in origin and may even be traced back to various ancient words such as pantera (Latin), pantere (French) and panther, which is Ancient Greek. Tigers. Tigers belong to the largest of the cat species. They can reach the length of 3.3 meters or 11 feet and can get as heavy as 306 kilograms or 670 pounds, while also gifted with enough bounding energy to catch their prey."}, {"url": "http://www.whozoo.org/students/deechh/bengal.htm", "passage_text": "Click here to see the normal color for Bengal tigers Bengal tiger from www.PDImages.com Name: Bengal Tiger (white) Scientific name: Panthera tigris Range: Asia.(India subcontinent) Habitat: Dense Forest and Lush Grasslands Status: Endangered Species Diet in the wild: water buffalo,goat,deer,wild boar. "}, {"url": "http://www.answers.com/Q/What_is_the_scientific_name_for_tiger", "passage_text": "The scientific name for a tiger is Panthera Tigris. Different breeds have an extra word at the end. Ex. Bengal Tiger is Panthera tigris tigris. Ex. Siberian Tiger is Panthera tigris altaica. Panthera Tigris is the scientific name of a general tiger, I don't know the scientific name of a Maltese Tiger. It is said that the Maltese Tiger is not a type of tiger but ju … st a coloration morph. Look on Wikipedia for more about the Maltese. + 4 others found this useful."}, {"url": "https://en.wikipedia.org/wiki/Tigers", "passage_text": "The tiger (Panthera tigris) is the largest cat species, reaching a total body length of up to 3.38 m (11.1 ft) over curves and exceptionally weighing up to 388.7 kg (857 lb) in the wild. Its most recognisable feature is a pattern of dark vertical stripes on reddish-orange fur with a lighter underside. The specific epithet, tigris, as well as the common name, tiger, come from the Middle English tigre and the Old English tigras (a plural word), both used for the animal. These derive from the Old French tigre, itself a derivative of the Latin word tigris and the Greek word tigris."}, {"url": "http://superbeefy.com/how-did-the-tiger-get-its-name-what-does-it-mean-in-greek-and-where-do-they-live/", "passage_text": "The tiger’s scientific name, Panthera tigris, is usually assumed to come from the Greek words pan-, meaning “all”, and theron, meaning “beast”, but this is likely a myth from folk etymology. A group of tigers is called a “streak” or an “ambush”, although it is a rare sight. The Bengal tiger is the most numerous tiger subspecies and the largest is the Siberian tiger. The word “tiger” comes from the Greek word “tigris”, which probably originated from a Persian word meaning “arrow”. The English word “Tigress” was first documented in 1611."}, {"url": "http://www.tigers.org.za/white-tigers.html", "passage_text": "White Tigers. In contrast to what some believe, the White Tiger is neither a subspecies in its own right, nor an albino form of a ‘normal’ tiger. Rather, it is simply a rare form of Bengal Tiger that possesses a specific gene, giving it a lighter appearance. As expected, the White Tiger is far lighter in its colouring than the more common Bengal Tiger. The majority of its coat is a light cream colour, with very light brown or grey stripes. Males can be anywhere between eight and 10.2 feet (that is, between 2.4 and 3.1 metres) in length, from head to tail."}, {"url": "http://www.tigers.org.za/white-tigers.html", "passage_text": "Their blue eyes, rose-pink noses and light brown stripes make these tigers stand out from their rust-coloured peers. The scientific name of the White Tiger is Panthera tigris, since it is merely a different coloured version of the Bengal subspecies. As expected, the White Tiger is far lighter in its colouring than the more common Bengal Tiger. The majority of its coat is a light cream colour, with very light brown or grey stripes. Males can be anywhere between eight and 10.2 feet (that is, between 2.4 and 3.1 metres) in length, from head to tail."}, {"url": "http://a-z-animals.com/animals/bengal-tiger/", "passage_text": "The Bengal tiger is considered to be the second largest species of tiger, although recent reports suggest that the Bengal tiger is on average, larger than the Siberian tiger. The Bengal tiger has a yellow or light orange coat, with black or dark brown stripes and a white belly. The white tiger is a Bengal tiger that has mutated genes, meaning that it is white in colour with black stripes. Black tigers are known to have black fur with lighter coloured stripes but are even rarer than the white"}]