[{"url": "https://en.wikipedia.org/wiki/Beemans_gum", "passage_text": "Fin de siecle Siècle'beeman s. Ad beemans (gum Originally'beeman S, gum see image at) right is a chewing gum invented By ohio Physician. Dr Edward. E beeman in the late 19th. century The gum is prominently featured in major movies The Right Stuff, Hot Shots! , The Rocketeer, and Indiana Jones and the Kingdom of the Crystal Skull, used in the latter for character Mutt Williams (Shia Labeouf) in Indy home scene."}, {"url": "http://www.oldtimecandy.com/discontinued/beemans-gum", "passage_text": "Beemans Gum History. Beemans gum is a chewing gum invented by Ohio physician Dr. Edward E. Beeman in the late 19th century. Beeman originally marketed the gum, which is made of pepsin powder and chicle, as an aid to digestion. As far as we know pepsin has not been an ingredient for many years. For other great options check out our Gum page ➝. Beemans gum is a chewing gum made famous by pioneering test pilot Chuck Yeager who chewed it before every flight for good luck. The manufacturer, Cadbury Adams, used to make a single batch every 2 to 3"}, {"url": "http://www.candyfavorites.com/beemans-chewing-gum", "passage_text": "Our business at CandyFavorites is classic candy, and Beemans Chewing Gum is an old-time classic if ever there was one! Few chewing gums on the planet have the unique history that Beemans does. Beemans Chewing Gum was invented in Ohio by a physician named Dr. Edward E. Beeman in the late 19th century and is one of the oldest gums still in existence. We have Beemans Gum here, but don't wait because you just never know when the next shortage will come. Do not go the rest of your life without trying this long-standing candy favorite. Please note that in December 2013, we received notice from the manufacturer that Beeman's Gum is being PERMANENTLY DISCONTINUED."}, {"url": "http://www.oldtimecandy.com/discontinued/beemans-gum", "passage_text": "We are disappointed too. For other great options check out our Gum page ➝. Beemans gum is a chewing gum made famous by pioneering test pilot Chuck Yeager who chewed it before every flight for good luck. The manufacturer, Cadbury Adams, used to make a single batch every 2 to 3 years"}, {"url": "http://www.wisegeek.com/what-is-clove-gum.htm", "passage_text": "In addition to Clove and Black Jack® gum, Cadbury Adams makes Beemans® gum, which has a minty flavor, in limited amounts as well. Beemans® was invented by a physician from Ohio in the late 1800s. "}, {"url": "https://en.wikipedia.org/wiki/Beemans_gum", "passage_text": "Beemans gum (originally Beeman's Gum, see image at right) is a chewing gum invented by Ohio physician Dr. Edward E. Beeman in the late 19th century. The gum is prominently featured in major movies The Right Stuff, Hot Shots! , The Rocketeer, and Indiana Jones and the Kingdom of the Crystal Skull, used in the latter for character Mutt Williams (Shia Labeouf) in Indy home scene."}, {"url": "http://www.blaircandy.com/beemansgum20ct.html", "passage_text": "A refreshing chewing gum classic, many of us remember slipping a piece of Beemans gum from the glossy paper pack in our mom s pocketbook! That fantastic flavor you remember hasn t changed, and we re excited to offer Beemans gum for an everyday low price. Relive the past and face the future with fresh breath! "}]