[{"url": "http://loweryourspending.com/average-cost-for-food-per-month-for-one-person.html", "passage_text": "For females, the average cost for food per month for one person is about two hundred eighty-three dollars ($283). For males, the average cost for food per month for one person is closer to three hundred twenty dollars ($320). You can view the raw data at USDA. If you want to perform your own calculations, remember that the data shown is for individuals in a four-person family."}, {"url": "http://loweryourspending.com/average-food-cost-per-month-for-1-person.html", "passage_text": "Answer: According to the United States Department of Agriculture, Center for Nutrition Policy and Promotion, the average food cost per month for 1 person in the United States is approximately three hundred one dollars ($301.00) for all categories combined. For females, the average food cost per month for 1 person is $283.28 For males, the average food cost per month for 1 person is $319.28. You can view the raw data at USDA. If you want to perform your own calculations, remember that the data shown is for individuals in a four-person family"}, {"url": "http://grannysvitalvittles.com/real-food-economics-101-real-food-vs-average-food-budgets/", "passage_text": "To answer that question we need to know just how much do people spend on food on average on both an average diet and a real food diet. According to the USDA the average family of four is spending somewhere between $544 to $1235 per month for food eaten at home. That’s a huge range! They break it down into 4 plans: Thrifty, low-cost, moderate, and liberal. I found a few thrifty’s, a lot of low-cost or moderates, and no one who admits to spending the liberal plan :-). So for the sake of argument I’ll assume that the moderate plan is pretty average. The moderate plan for a family of four with small children is $855 per month. That is $7 a day for each person."}, {"url": "http://loweryourspending.com/average-cost-for-food-per-month-for-one-person.html", "passage_text": "According to the United States Department of Agriculture, Center for Nutrition Policy and Promotion, the average cost for food per month for one person in the United States is slightly over three hundred dollars ($300). For males, the average cost for food per month for one person is closer to three hundred twenty dollars ($320). You can view the raw data at USDA. If you want to perform your own calculations, remember that the data shown is for individuals in a four-person family."}, {"url": "http://loweryourspending.com/average-food-cost-per-month-for-1-person.html", "passage_text": "The average food cost per month for 1 person varied from a low of $196.08 for a single female in the 51 - 70 age group on a thrifty plan to $447.84 for a single male in the 19 - 50 age group on a liberal plan. For females, the average food cost per month for 1 person is $283.28 For males, the average food cost per month for 1 person is $319.28. You can view the raw data at USDA. If you want to perform your own calculations, remember that the data shown is for individuals in a four-person family"}, {"url": "http://loweryourspending.com/average-food-cost-per-month-for-1-person.html", "passage_text": "For those two states, the average food cost per month for 1 person is $249.06 for Alaska and $365.52 for Hawaii. Note that each of these are for the thrifty plan, which is the only one published by the USDA for those two states. For females, the average food cost per month for 1 person is $283.28 For males, the average food cost per month for 1 person is $319.28. You can view the raw data at USDA. If you want to perform your own calculations, remember that the data shown is for individuals in a four-person family"}, {"url": "http://grannysvitalvittles.com/real-food-economics-101-real-food-vs-average-food-budgets/", "passage_text": "So, just $5 per day each. That’s $2 less per person per day than the average USDA food budget. For a family of 4 that is $600 per month, with some families coming in a lot lower. The average USDA monthly food budget for that same family is $840. I found a few thrifty’s, a lot of low-cost or moderates, and no one who admits to spending the liberal plan :-). So for the sake of argument I’ll assume that the moderate plan is pretty average. The moderate plan for a family of four with small children is $855 per month. That is $7 a day for each person."}, {"url": "http://loweryourspending.com/average-cost-for-food-per-month-for-one-person.html", "passage_text": "This average cost for food per month for one person was derived by taking an average of the estimated cost for food per month for a single male and single female in two age groups (19 - 50 and 51 - 70) and four different food-cost plans (thrifty to liberal), as shown in the chart below. For males, the average cost for food per month for one person is closer to three hundred twenty dollars ($320). You can view the raw data at USDA. If you want to perform your own calculations, remember that the data shown is for individuals in a four-person family."}, {"url": "http://www.answers.com/Q/What_is_the_average_cost_of_food_for_a_family_of_4_per_week", "passage_text": "Food Spending. The USDA calculates average food costs at four different consumption levels: thrifty, low-cost, moderate-cost, and liberal. They assume that all meals and snacks are eaten at home, which lowers the cost. In June 2010, the thrifty plan for a family of 4 per week was $134.50. Low-cost = $175.10 Moderate cost = $219.10 Liberal cost = $265.90. In mud hut villages, in average, people use only 30 $/month for food. The average American family of four spends amount $100-200 a week on groceries. Though my family has personally spent up to $600 an week on groceries when splurging, on heavy meals, large amount of meat, sodas and snacks."}]