[{"url": "https://en.wikipedia.org/wiki/Graphtec_Corporation", "passage_text": "Graphtec Corporation (TYO: 6968), formerly Watanabe Instruments, is a company for computer input and output devices in Japan. It has subsidiaries in the USA, Europe and Australia. Graphtec was established in 1949; their first plotter was released in 1961. "}, {"url": "http://www.signsupply.com/Hardware/Graphtec/ce-6000.asp", "passage_text": "Plotter $3395 Call (800) 967-3929 or click here to get an e-mail with your price.... Includes Free Stand. CE-6000-120 48. Plotter $3395 Call (800) 967-3929 or click here to get an e-mail with your price.... With a 25 pin RS-232C or the High Speed USB 2.0 control interface, the CE6000 is compatible with legacy computer systems as well as the latest PCs available now and for several years to come. CE-6000-60 24 Plotter $1745 Call (800) 967-3929 or click here to get an e-mail with your price.... Includes Free Stand. CE-6000-60 24 Plotter $1745 Call (800) 967-3929 or click here to get an e-mail with your price.... Includes Free Stand"}, {"url": "http://www.graphtecamerica.com/graphtec-america-products-cutting-plotters-fc8600-series-high-performance-2", "passage_text": "Graphtec’s next generation ARMS system adjusts for several types of potential print distortions, allowing for accurate contour cutting of pre-printed images and decals. New Features of the New ARMS. 1  Optical Sensor for Auto Alignment. 2  Sensitivity adjustment for registration mark detection on various media and colors. With the world’s fastest throughput performance and superb accuracy, the new FC8600 series accommodates the most demanding cutting and plotting projects and provides users with the versatility needed for a wide variety of applications."}, {"url": "http://www.plotters.com/equipment2/graphtec-cutting-plotters", "passage_text": "Graphtec Cutting Plotters. Graphtec cutting plotters are designed to meet the demanding requirements of design professionals in packaging design, vinyl sign graphics, garment and apparel, automotive aftermarket styling, automotive protection, monument builders and manufacturing design related industries. "}, {"url": "http://www.graphtecamerica.com/graphtec-america-products-cutting-plotters-fc8600-series-high-performance-2", "passage_text": "PERF CUT ENABLED high performance cutters finish the job! With its included perf cut enabled custom tool settings—you have the ability to perforate cut all the way through your pre printed vinyl media for pop-out full-color stickers and decals without damaging your blade or cutting plotter machine. With the world’s fastest throughput performance and superb accuracy, the new FC8600 series accommodates the most demanding cutting and plotting projects and provides users with the versatility needed for a wide variety of applications."}, {"url": "http://www.uscutter.com/Graphtec-8600-Series-Vinyl-Cutter", "passage_text": "The all new, high-performing Graphtec FC8600 Vinyl Cutter series cutting plotter is an industry leader for sign makers, graphic artists, auto-aftermarket professionals, countertop installers and other related users. *2 When operated with Graphtec specified media and conditions. *3 The CB15UA cutter blade and a reinforced backing sheet must be used when cutting high-intensity reflective film. *4 HP-GLTM is a registered trademark of Hewlett-Packard Company."}, {"url": "http://www.graphtecamerica.com/", "passage_text": "Welcome. Established in 1949, Graphtec’s corporate philosophy emphasizes the pride every member takes in the company’s products. The pride comes through at all stages, from preliminary planning and design to final delivery. "}, {"url": "http://www.ebay.com/sch/i.html?_nkw=graphtec+plotter", "passage_text": "Related: graphtec vinyl cutter roland plotter summa plotter solvent printer roland vinyl cutter large format printer roland printer roland versacamm gerber plotter. Follow graphtec plotter to get e-mail alerts and updates on your eBay Feed. Unfollow graphtec plotter to stop getting updates on your eBay Feed. Yay! You're now following graphtec plotter i"}, {"url": "http://www.graphtecamericastore.com/push-pinch-roller-replacement-621352000/", "passage_text": "Genuine Graphtec replacement part. Push/Pinch Roller for FC and CE roll feed cutting plotters. PDF Instruction for replacement download here: http://graphtecamericastore.com/content/pdfs/Pinch-Push_Roller_Replacement_Instructs.pdf. ~ 1 15mm diameter (including rubber wheel)"}]