[{"url": "http://www.nature.com/scitable/definition/dihybrid-cross-dihybrid-303", "passage_text": "RRYY x rryy. Organisms in this initial cross are called the parental, or P generation. The offspring of the RRYY x rryy cross, which is called the F1 generation, were all heterozygous plants with round, yellow seeds and the genotype RrYy. Next, Mendel crossed two plants from the F1 generation. This step is the dihybrid cross, and it is represented as:"}, {"url": "https://en.wikipedia.org/wiki/Dihybrid_cross", "passage_text": "An example of a dihybrid crosses of two pea varieties that differ in seed color and form. Dihybrid cross is a cross between two pure lines (varieties, strains) that differ in two observed traits. In Mendelian sense, between the alleles of both these loci there is a relationship of complete dominance-recessive. For example: RRYY/rryy parents result in F 1 offspring that are heterozygous for both R and Y (RrYy). The rules of meiosis, as they apply to the dihybrid, are codified in Mendel's first law and Mendel's second law, which are also called the Law of Segregation and the Law of Independent Assortment, respectively"}, {"url": "http://www.nature.com/scitable/definition/dihybrid-cross-dihybrid-303", "passage_text": "dihybrid cross. A dihybrid cross describes a mating experiment between two organisms that are identically hybrid for two traits. A hybrid organism is one that is heterozygous, which means that is carries two different alleles at a particular genetic position, or locus. The offspring of the RRYY x rryy cross, which is called the F1 generation, were all heterozygous plants with round, yellow seeds and the genotype RrYy. Next, Mendel crossed two plants from the F1 generation. This step is the dihybrid cross, and it is represented as:"}, {"url": "https://en.wikipedia.org/wiki/Monohybrid_cross", "passage_text": "A monohybrid cross is a mating between two individuals with different alleles at one genetic locus of interest. The character(s) being studied in a monohybrid cross are governed by two or multiple alleles for a single locus. "}, {"url": "http://www.differencebetween.net/science/nature/difference-between-monohybrid-and-dihybrid-cross/", "passage_text": "Summary: 1.A monohybrid cross is a cross between first-generation offspring of parents who differ in one trait while a dihybrid cross is a cross between first-generation offspring of parents who differ in two traits. To study how genes work and how certain traits are inherited from the parents and grandparents, there are two types of breeding methods used; the monohybrid and dihybrid cross. The only difference between monohybrid and dihybrid crosses is the number of traits being looked into."}, {"url": "http://www.differencebetween.net/science/nature/difference-between-monohybrid-and-dihybrid-cross/", "passage_text": "A monohybrid cross is when the offspring of homozygous parents that only differ on a single trait are bred to come up with the second generation. On the other hand, a dihybrid cross is pretty similar to a monohybrid cross except that the parents of the first generation differ in two traits. An example of a monohybrid cross would be crossing two animals whose parents are large and small. To study how genes work and how certain traits are inherited from the parents and grandparents, there are two types of breeding methods used; the monohybrid and dihybrid cross. The only difference between monohybrid and dihybrid crosses is the number of traits being looked into."}, {"url": "http://study.com/academy/lesson/dihybrid-cross-definition-example-quiz.html", "passage_text": "(For example, one phenotype of a pea plant is having purple flowers.) A dihybrid cross is a cross between two individuals that are both heterozygous for two different genes. A hybrid is just the offspring produced when two genetically different parents are crossed. Even though the parents of a dihybrid cross have the same genotype and phenotype, their offspring could show any one of 9 different genotypes and 4 different phenotypes. The phenotypic ratio of offspring produced from a dihybrid cross is 9:3:3:1. To unlock this lesson you must be a Study.com Member."}]