[{"url": "http://articles.chicagotribune.com/2014-01-07/features/ct-madeira-or-marsala-in-recipe-20140107_1_goat-cheese-wild-mushrooms-marsala", "passage_text": "Both Madeira and Marsala are fortified – as is sherry – so that means the wine gets a shot of brandy or some other alcohol to bolster its overall alcohol content. Spicer's recipe from her cookbook may be found below. Goat cheese croutons with wild mushrooms and Madeira cream. 2.Make the Madeira cream. In a small saucepan, simmer the shallots in Madeira until the liquid is reduced to ¼ cup. Add the cream, bring to a boil, then lower the heat and simmer 5-10 minutes, until the cream thickens slightly. Set aside. 3.Remove the tough stems from the mushrooms and discard."}, {"url": "http://winefolly.com/review/marsala-wine/", "passage_text": "Marsala wine is a fortified wine from Sicily. It’s commonly used for cooking to create rich caramelized sauces. There are two styles of Marsala to know for cooking and they are dry vs. sweet, but Marsala is so much more than a cooking wine! It can be made dry and fine enough for sipping, like Sherry or Madeira. Right now Marsala is undervalued. We hope to bring you up to speed on this unique wine that has some striking taste similarities to Madeira wine"}, {"url": "http://www.copykat.com/2015/03/11/cheesecake-factory-chicken-madeira/", "passage_text": "It reminds me a little of Chicken Marsala, but the Madeira wine has a much more full bodied flavor. I love that this recipe is served with mashed potatoes, you won’t want any of that gravy to go to waste. This recipe’s key ingredient is Madeira wine. I love these fortified wines like Madeira, Sherry, or even Marsala. "}, {"url": "http://theepicentre.com/drink/fortified-wine-sherry-port-madeira-marsala/", "passage_text": "Fortified Wine – Sherry, Port, Madeira & Marsala. When planning a menu, it seems the selection of an appropriate drink match is often restricted to red or white wines. Marsala is a fortified dessert wine from the hot plains western Sicily and one we know best for its contribution to the famous veal sauce or to the dessert Zabaglione."}, {"url": "http://www.foodsubs.com/Aperitif.html", "passage_text": "Marsala Notes: This popular Sicilian fortified wine is Italy's answer to sherry and Madeira. It's mostly used as a cooking wine and is a key ingredient in many Italian dishes, including zabaglione, tiramisu, and veal scaloppini. Marsalas are graded according to their sweetness and age. fortified wine Notes: These are wines that have been fortified with brandy and sometimes flavored with herbs, roots, peels, and spices. The most popular examples are sherry, Madeira, Marsala, port, and vermouth. Fortified wines are often used in cooking, or they're served as aperitifs apéritifs or dessert. wines"}, {"url": "http://winefolly.com/review/marsala-wine/", "passage_text": "Dry Marsala. MARSALA SUBSTITUTE: The best substitute for Marsala wine is Madeira because of the similar taste profile. If you can’t find Madeira either, you might try simmering 1 part brandy with 2 parts white wine, brown sugar and a touch of salt. There are two styles of Marsala to know for cooking and they are dry vs. sweet, but Marsala is so much more than a cooking wine! It can be made dry and fine enough for sipping, like Sherry or Madeira."}, {"url": "http://community.tasteofhome.com/community_forums/f/30/p/850894/7300241.aspx", "passage_text": "I've recently come across different chicken recipes that call for either madeira wine or marsala wine. Just wondering what the difference in taste is between the two wines. I am not a wine expert, but if I remember right, Madiera is Portugese and Marsala is from Marsala, Italy. I think they call them both fortified wine, whatever that means...Madiera is heated or cooked somehow before bottling~maybe even before aging.."}, {"url": "https://en.wikipedia.org/wiki/Madeira_wine", "passage_text": "Madeira is a fortified Portuguese wine made in the Madeira Islands. Madeira is produced in a variety of styles ranging from dry wines which can be consumed on their own as an aperitif, to sweet wines more usually consumed with dessert. Cheaper versions are often flavoured with salt and pepper for use in cooking. "}, {"url": "http://wine.about.com/od/fortifiedwines/a/Marsalawine.htm", "passage_text": "Like its other fortified cousins-Port, Sherry and Madeira, Marsala is a higher alcohol fortified wine (usually around 17- 20%) that is available in both sweet or dry variations. "}]