[{"url": "https://en.wikipedia.org/wiki/Algerian_War", "passage_text": "In 1834, Algeria became a French military colony and, in 1848, was declared by the constitution of 1848 to be an integral part of France and divided into three French departments (Algiers, Oran and Constantine). Both Muslim and European Algerians took part in World War I, fighting for France. Algerian Muslims served as tirailleurs (such regiments were created as early as 1842) and spahis; and French settlers as Zouaves or Chasseurs d'Afrique."}, {"url": "http://www.history.com/this-day-in-history/vietnam-independence-proclaimed", "passage_text": "Ho Chi Minh died on September 2, 1969, 25 years after declaring Vietnam’s independence from France and nearly six years before his forces succeeded in reuniting North and South Vietnam under communist rule. In the late 1950s, Ho Chi Minh organized a communist guerrilla movement in the South, called the Viet Cong. North Vietnam and the Viet Cong successfully opposed a series of ineffectual U.S.-backed South Vietnam regimes and beginning in 1964 withstood a decade-long military intervention by the United States."}, {"url": "http://www.answers.com/Q/How_did_Algeria_gain_its_independence", "passage_text": "By fighting the colonial power, France, in an extremely bitter war fought in two stages between 1954 and 1962. In 1962 just over a million French settlers fled (or were expelled) and many Algerians who had worked with the French were tortured and/or lynched ... The French granted Algeria's independence on July 3rd, 1962. However because it would have been Algeria's 132nd anniversary on July 5th, Algeria decided to make their official … independence day JULY 5TH, 1962."}, {"url": "https://en.wikipedia.org/wiki/Angolan_War_of_Independence", "passage_text": "It was a guerrilla war in which the Portuguese Armed Forces waged a counter-insurgency campaign against armed groups mostly dispersed across sparsely populated areas of the vast Angolan countryside. On 10 November the Portuguese left Angola. Cuban-MPLA forces defeated South African-FNLA forces, maintaining control over Luanda. On 11 November Neto declared the independence of the People's Republic of Angola."}, {"url": "https://en.wikipedia.org/wiki/Angolan_War_of_Independence", "passage_text": "From Wikipedia, the free encyclopedia. The Angolan War of Independence (1961–1974) began as an uprising against forced cotton cultivation, and became a multi-faction struggle for the control of Portugal's Overseas Province of Angola among three nationalist movements and a separatist movement. On 10 November the Portuguese left Angola. Cuban-MPLA forces defeated South African-FNLA forces, maintaining control over Luanda. On 11 November Neto declared the independence of the People's Republic of Angola."}, {"url": "http://www.answers.com/Q/How_did_Algeria_gain_its_independence", "passage_text": "(For political reasons was filmed in Algeria and Italy. The film was immediately banned in France). The war was singularly vicious and led to the collapse of the Fourth Republic in France; it also brought Charles de Gaulle back to power. Originally, it was assumed that he would keep Algeria for France. In 1961, when he announced plans for Algerian independence, there was an attempt by some units of French Army to march on Paris and remove him! The whole saga has left scars in France. The French granted Algeria's independence on July 3rd, 1962. However because it would have been Algeria's 132nd anniversary on July 5th, Algeria decided to make their official … independence day JULY 5TH, 1962."}, {"url": "http://www.globalsecurity.org/military/world/war/algeria.htm", "passage_text": "Algerian National Liberation (1954-1962). The Algerian war for independence began in 1954 and ended in 1962 when French President Charles De Gaulle pronounced Algeria an independent country on July 3. This war was one of the many wars for independence which occurred during the 1950s and 1960s. "}, {"url": "http://courses.wcupa.edu/jones/his312/lectures/algeria.htm", "passage_text": "The French finally withdrew in June 1962 and Algeria declared its independence on 5 July 1962. France and Algeria had no diplomatic relations until 1965, and it took ten more years before a French head-of-state, Valerie Giscard-d'Estaing, visited Algeria in 1975. Allouache is an Algerian filmmaker and his book is an adaptation of the screenplay for his film, which covers an episode in Algerian history in the late 1980s. By that time, armed resistance had begun against the successors to the government won independence."}, {"url": "https://en.wikipedia.org/wiki/Angolan_War_of_Independence", "passage_text": "This war formally came to an end in January 1975 when the Portuguese government, the National Union for the Total Independence of Angola (UNITA), the Popular Movement for the Liberation of Angola (MPLA), and the National Liberation Front of Angola (FNLA) signed the Alvor Agreement. On 10 November the Portuguese left Angola. Cuban-MPLA forces defeated South African-FNLA forces, maintaining control over Luanda. On 11 November Neto declared the independence of the People's Republic of Angola."}]