[{"url": "http://www.ehalal.org/muslim-halal-food/what-is-halal-fish-gelatin", "passage_text": "Halal Gelatin. Gelatin is a derived water soluble protein made by controlled hydrolytic conversion of collagen, the protein constituent of white fibrous connective tissue from animals. Gelatin is obtained from one of the following: 1  Beef bones and calf skin (Gelatin type B) or. 2  Skin, hide splits and trimming of pork (Haram Gelatin type A). 3  Gelatin is also obtained from fish. 4  It is expensive than pork and beef and also provide little unpleasant smell to the Halal food product"}, {"url": "https://en.wikipedia.org/wiki/Gelatin", "passage_text": "Gelatin is a mixture of peptides and proteins produced by partial hydrolysis of collagen extracted from the skin, bones, and connective tissues of animals such as domesticated cattle, chicken, pigs, horses and fish. On a commercial scale, gelatin is made from by-products of the meat and leather industry. Recently, fish by-products have also been considered because they eliminate some of the religious obstacles surrounding gelatin consumption. Gelatin is derived from pork skins, pork, horses, and cattle bones, or split cattle hides."}, {"url": "http://madinavitamins.com/halal/omega-3-fish-oil/", "passage_text": "Help prevent cancer. Colon, breast, and prostate cancers have all been correlated with low intakes of omega-3’s. Our halal omega 3 fish oil (with fish gelatin) contains both docosahexaenoic acid (DHA) and eicosapentaenoic acid (EPA). Omega-3 fatty acids are very important in preventing and managing heart disease. All of our products, including our halal omega 3 fish oil are 100% certified halal and guaranteed to follow ISA (Islamic Services of America) guidelines."}, {"url": "http://www.ehalal.org/muslim-halal-food/what-is-halal-fish-gelatin", "passage_text": "1 Skin, hide splits and trimming of pork (Haram Gelatin type A). 2  Gelatin is also obtained from fish. 3  It is expensive than pork and beef and also provide little unpleasant smell to the Halal food products. Gelatin is obtained from one of the following: 1  Beef bones and calf skin (Gelatin type B) or. 2  Skin, hide splits and trimming of pork (Haram Gelatin type A). 3"}, {"url": "http://www.fitgelatins.com/", "passage_text": "Kosher Fish Gelatin. Food Industry Technology (FIT) is the largest and oldest mainstream kosher gelatin distributor in North America. Family owned and operated since 1987, FIT began in order to fill the need of major manufacturers seeking a kosher replacement to standard gelatin. We at FIT are continuously developing new ways to reduce the cost of kosher gelatin as we are committed to supply our customers with the highest quality and lowest cost kosher gelatins in the industry. To serve our customers better, orders received by 5 PM are shipped out the next business day."}, {"url": "http://halalgelatine.com/", "passage_text": "The following products are definitely Halal: 1  Milk (from cows, sheep, camels, and goats). 2  Honey. 3  Fish. 4  Plants which are not intoxicant. 5  Fresh or naturally frozen vegetables. 6  Fresh or dried fruits. 7  Legumes & nuts like peanuts, cashew nuts, hazel nuts, walnuts, etc. 8  Grains such as wheat, rice, rye, barley, oat, etc. The opposite of Halal is Haram, which means unlawful or prohibited. Halal and Haram are in fact universal terms that apply to all facets of life. As far as food is concerned, the Qur'an makes it clear as to what is Halal and Haram, read it here verses in the Al-Qur'an."}, {"url": "https://en.wikipedia.org/wiki/Gelatin", "passage_text": "For example, Jewish kosher and Islamic Halal customs require gelatin from sources other than pigs, like cows and/or fish and from animals slaughtered ritually. Roma people are cautious of gelatin products that may have been made from horses, as their culture forbids the consumption of horses. On a commercial scale, gelatin is made from by-products of the meat and leather industry. Recently, fish by-products have also been considered because they eliminate some of the religious obstacles surrounding gelatin consumption. Gelatin is derived from pork skins, pork, horses, and cattle bones, or split cattle hides."}, {"url": "http://www.muftisays.com/qa/question/3281/is-fish-gelatine-halal-.html", "passage_text": "Assalamu Alaikum Warahmatullahi Wabarakatuh. Fish Gelatine is an excellent Halaal substitute. Two carrions are made Halaal for us; Fish and locust. (Mishkaat vol.2 pg.361). All fish are Halaal regardless of scales or not. "}, {"url": "http://madinavitamins.com/halal/fish-oil-omega-3/", "passage_text": "Our Halal Fish Oil Omega 3 (with bovine gelatin) contains both docosahexaenoic acid (DHA) and eicosapentaenoic acid (EPA). Omega-3 fatty acids are very important in preventing and managing heart disease. "}]