[{"url": "https://www.cirm.ca.gov/our-progress/awards/repair-and-regeneration-nephron", "passage_text": "Progress Report: Kidney function is essential for removing the wastes that result from normal cell function and maintaining water and salt balance in our internal tissues. These actions are carried out by roughly a million nephrons within the kidney that filter all the body’s blood roughly once every 1-2 hours. Animal studies indicate that the kidney is unable to make new nephrons: the full complement of nephrons for live are established prior to birth. However, the damaged nephron has a limited capacity to restore activity through the regeneration of missing cells by their surviving neighbors."}, {"url": "https://en.wikipedia.org/wiki/Nephron", "passage_text": "The two general classes of nephrons are cortical nephrons and juxtamedullary nephrons, both of which are classified according to the length of their associated Loop of Henle and location of their renal corpuscle. The majority of nephrons are cortical. Cortical nephrons have a shorter loop of Henle compared to juxtamedullary nephrons. The longer loop of Henle in juxtamedullary nephrons create a hyperosmolar gradient that allows for the creation of concentrated urine."}, {"url": "http://health.howstuffworks.com/human-body/systems/kidney-urinary/kidney1.htm", "passage_text": "In each kidney, there are one million of these structures, called nephrons. The nephron is the basic unit of the kidney. It's a long, thin tube that is closed at one end, has two twisted regions interspaced with a long hairpin loop, ends in a long straight portion and is surrounded by capillaries. Each part of the nephron has different types of cells with different properties -- this is important in understanding how the kidney regulates the composition of the blood. The nephron has a unique blood supply compared to other organs: 1  Afferent arteriole-connects the renal artery with the glomerular"}, {"url": "http://schools-wikipedia.org/wp/n/Nephron.htm", "passage_text": "Each nephron is composed of an initial filtering component (the  renal corpuscle) and a tubule specialized for reabsorption and secretion (the renal tubule). The renal corpuscle filters out large solutes from the blood, delivering water and small solutes to the renal tubule for modification. Composed of a glomerulus and Bowman's capsule, the renal corpuscle (or Malpighian corpuscle) is the beginning of the nephron. It is the nephron's initial filtering component."}, {"url": "http://www.pathwaymedicine.org/nephron-histology", "passage_text": "Overview. 1  The nephron is a long, winding tubule that extends from the Bowman's Capsule and ends in the renal papillae. 2  The nephron possesses a simple epithelium lined by a single layer of cells which can generically be referred to as tubular epithelial cells. 1 As one traverses along the nephron, the morphology and functionality of the tubular epithelial cells changes, thus defining functional segments which are involved in resorption and secretion of different sets of molecules. 2  Here we only provide a brief histological description of the segments of the nephron"}, {"url": "https://www.cirm.ca.gov/our-progress/awards/repair-and-regeneration-nephron", "passage_text": "Kidney function is essential for removing the wastes that result from normal cell function and maintaining water and salt balance in our internal tissues. These actions are carried out by roughly a million nephrons within the kidney that filter all the body’s blood roughly once every 1-2hours. Animal studies indicate that the kidney is unable to make new nephrons: the full complement of nephrons for live are established prior to birth. However, the damaged nephron has a limited capacity to restore activity through the regeneration of missing cells by their surviving neighbors."}, {"url": "https://en.wikipedia.org/wiki/Nephron", "passage_text": "Composed of a glomerulus and the Bowman's capsule, the renal corpuscle (or Malpighian corpuscle) is the beginning of the nephron. It is the nephron's initial filtering component. The glomerulus is a capillary tuft that receives its blood supply from an afferent arteriole of the renal circulation. The majority of nephrons are cortical. Cortical nephrons have a shorter loop of Henle compared to juxtamedullary nephrons. The longer loop of Henle in juxtamedullary nephrons create a hyperosmolar gradient that allows for the creation of concentrated urine."}, {"url": "http://ocw.tufts.edu/data/33/498083.pdf", "passage_text": "Structure of the Kidney The structure of the kidney, and the nephron in particular, is uniquely designed to accomplish the functions outlined above. Sodium, water, electrolyte, and H + ion handling, as well as hormone production, are performed by specific tubular segments that are suited to each task. "}]