[{"url": "http://www.eesi.org/topics/fossil-fuels/description", "passage_text": "Fossil fuels, including coal, oil and natural gas, are currently the world's primary energy source. Formed from organic material over the course of millions of years, fossil fuels have fueled U.S. and global economic development over the past century. "}, {"url": "http://instituteforenergyresearch.org/topics/encyclopedia/fossil-fuels/", "passage_text": "Fossil fuels—coal, petroleum oil, and natural gas — are concentrated organic compounds found in the Earth’s crust. Fossil fuels make modern life possible. Tweet Facebook. The Institute for Energy Research conducts in-depth economic and policy research on energy and environmental issues. Coal was the first of the fossil fuels to go into widespread use, displacing low-energy firewood as the leading source of fuel in the US, and triggering the country’s industrialization in the second half of the 19th century."}, {"url": "http://www.eschooltoday.com/energy/non-renewable-energy/what-is-non-renewable-energy.html", "passage_text": "Air, water and land pollution are all consequences of using fossil fuels. In the pages that follow, we shall take a look at what each source of non-renewable energy is made of, and how they are used. Note that not all non-renewable energy comes from fossil fuels. There is also uranium, which is not a fossil fuel. Energy exists freely in nature. Some of them exist infinitely (never run out, called RENEWABLE), the rest have finite amounts (they took millions of years to form, and will run out one day, called NON-RENEWABLE). Non-renewable energy is energy from fossil fuels (coal, crude oil, natural gas) and uranium. Fossil fuels are mainly made up of Carbon. It is believed that fossil fuels were formed over 300 million years ago, when the earth was a lot different in its landscape. It had swampy forests and very shallow seas"}, {"url": "http://www.answers.com/Q/Where_are_the_fossil_fuels_located_in_the_US", "passage_text": "Confidence votes 713. The most common fossil fuel we refer to is oil which is found in Texas, Oklahoma and Alaska in the largest amounts although various other states also have shown significant deposits. "}, {"url": "http://instituteforenergyresearch.org/topics/encyclopedia/fossil-fuels/", "passage_text": "Below these studies is an in-depth overview of fossil fuels. Fossil fuels —coal, petroleum (oil), and natural gas — are concentrated organic compounds found in the Earth’s crust. They are created from the remains of plants and animals that lived millions of years ago in the form of concentrated biomass. Coal was the first of the fossil fuels to go into widespread use, displacing low-energy firewood as the leading source of fuel in the US, and triggering the country’s industrialization in the second half of the 19th century."}, {"url": "http://www.energyquest.ca.gov/story/chapter08.html", "passage_text": "Where Fossil Fuels Come From. There are three major forms of fossil fuels: coal, oil and natural gas. All three were formed many hundreds of millions of years ago before the time of the dinosaurs – hence the name fossil fuels. The age they were formed is called the Carboniferous Period. It was part of the Paleozoic Era"}, {"url": "http://www.answers.com/Q/Where_are_fossil_fuels_found", "passage_text": "Fossil fuels, such as coil, oil, and natural gas, are normally found underground, where they have formed within layers of sedimentary rock. In some cases, oil, coal, or tar de … posits have been uncovered or exist relatively close to the surface. + 7 others found this useful. Andy Beirsack. "}, {"url": "https://en.wikipedia.org/wiki/Fossil_fuel", "passage_text": "Fossil fuels are fuels formed by natural processes such as anaerobic decomposition of buried dead organisms. The age of the organisms and their resulting fossil fuels is typically millions of years, and sometimes exceeds 650 million years. Fossil fuels contain high percentages of carbon and include coal, petroleum and natural gas. Other more commonly used derivatives of fossil fuels include kerosene and propane. Natural gas deposits are also the main source of the element helium. Heavy crude oil, which is much more viscous than conventional crude oil, and tar sands, where bitumen is found mixed with sand and clay, are becoming more important as sources of fossil fuel."}, {"url": "http://geography.about.com/od/economic-geography/a/Fossil-Fuels.htm", "passage_text": "By Ping Zhou. Fossil fuels are non-renewable resources created by the anaerobic decomposition of buried dead organisms. They include petroleum, natural gas, and coal. Fossil fuels serve as the dominant source of energy for humanity, powering over four-fifths of the world's utilities. "}]