[{"url": "http://www.improvenet.com/r/costs-and-prices/stair-repair-cost", "passage_text": "The national average for professional stair and railing repair is $750, so that is a good place to start budgeting. Larger projects can run as high as $1,400, and smaller fixes may cost as little as $200. Unfortunately, even well-constructed stairs are susceptible to damage over time. Use this guide to get a better idea of the cost of stair repair, what kind of problems can occur and what to expect once the professionals arrive."}, {"url": "http://askthehandyman.net/remodeling/cost-to-repair-and-reinforce-brick-and-concrete-steps/", "passage_text": "Submitted by: rivera.orly – Elizabeth, NJ USA. What would be the labor cost to repair-reinforce outside stair steps that will be filled in with concrete. Needs new railings. its 5 steps per stairs and 3 stairs in total. I need to know how much would the labor cost be for 1 man to do all. "}, {"url": "http://www.homeadvisor.com/cost/stairs-and-railings/", "passage_text": "These are not things that you have to live with. One cost factor to consider which will always affect the cost of a stair and railing installation and repair is the complexity of the layout of the stairs. Stairs and railings are not only part of the aesthetic and decorative aspects of your home, but they pose a safety concern as well. Stair railings are for more than just decoration; they provide stability for those traveling up and down"}, {"url": "http://www.homeadvisor.com/cost/stairs-and-railings/", "passage_text": "Stair & Railing Cost Guides. Building new stairs and railings, or updating existing ones can be a very important home improvement tasks. Stairs and railings are not only part of the aesthetic and decorative aspects of your home, but they pose a safety concern as well. Stair railings are for more than just decoration; they provide stability for those traveling up and down the stairs."}, {"url": "http://www.homewyse.com/services/cost_to_install_slate_patio.html", "passage_text": "Our free calculator uses recent, trusted data to estimate costs for your Slate Patio Installation project. For a basic 120 square feet project in zip code 47474, the benchmark cost to Install a Slate Patio ranges between $15.17 - $22.34 per square foot* . To estimate costs for your project: 1"}, {"url": "http://www.homeadvisor.com/cost/stairs-and-railings/", "passage_text": "If you have a broken stair, it may not just be the part that you step on-it could be any piece that is a part of the staircase. Your professional will be able to take a look and provide an accurate estimate of what it will take to safely fix your broken stair. Stairs and railings are not only part of the aesthetic and decorative aspects of your home, but they pose a safety concern as well. Stair railings are for more than just decoration; they provide stability for those traveling up and down the stairs."}, {"url": "http://www.homeadvisor.com/cost/stairs-and-railings/", "passage_text": "Railings. Railing cost will be affected by intricacy of the design of the railings and baluster, number of posts, type of material, type of mount, curve, etc. Regardless, if you hire a professional carpenter to fix or install your stair railings, you can be sure that you and your family are safe. Stairs and railings are not only part of the aesthetic and decorative aspects of your home, but they pose a safety concern as well. Stair railings are for more than just decoration; they provide stability for those traveling up and down the stairs."}, {"url": "http://www.homeadvisor.com/cost/stairs-and-railings/repair-stairs-or-railings/", "passage_text": "NEXT STEP. Find out how much your project will cost. Provide a few details about your project and receive competitive quotes from local pros. Stairs and railings are for more than just decoration. After years of use, steps can break or get loose. The railing may feel wobbly or just seem slightly loose when force is placed on it. You might have that one squeaky wooden stair announcing your presence to the world. "}, {"url": "http://www.a1concrete.com/concrete-steps-repairs", "passage_text": "Concrete Steps Repair. Uneven concrete steps can be unsightly and can pose a danger to your family, neighbors, and visiting friends. Sunken concrete steps can now easily be transformed into safe, stable stairs that all your neighbors will be envious of. Most jobs can be completed in a day, and our price will leave you smiling. If your concrete patio or porch has become uneven or unlevel, there are various concrete step repair methods that can be very effective alternatives to the expense of tearing out and replacing your concrete steps."}]