[{"url": "https://answers.yahoo.com/question/index?qid=20071201160230AAQQKMp", "passage_text": "Figure about 8 oz. or 1/2 pound for starters and maybe 1 pound per person depending on the person eating and other dishes you're serving with it. I always plan 3/4 to 1 pound per person (my generosity) 'cause when people eat prime rib they eat lots. Todays going price for 1/2 prime rib on the bone (3-4 bones) is $11.99 in Tracy, Ca at the butchers Costco wants $8.99 a pound. Source(s): David H · 8 years ago. Thumbs up"}, {"url": "http://www.costcoinsider.com/costco-prime-rib-roast-2014/", "passage_text": "Costco Prime Rib Roast 2014. One of the hottest Christmas items at Costco every year is the Prime Rib roast. There are not a lot of stores you can buy a full bone-in prime rib and Costco is one of them. They usually go on sale about two weeks before Christmas, and the tag says the shelf life is 5 days. The weekend before Christmas is the ideal time to buy it if you plan to make a roast for Christmas Eve or Christmas day. The cheapest prime rib I saw for sale was around $85, which was a little under 8 pounds. If you’d like to see the cooking instructions click the image below. Also, be on the lookout for discounted prime rib right after Christmas. I’ve seen it as low as $3.99/lb as the expiration dates get close."}, {"url": "http://www.costcoinsider.com/costco-prime-rib-roast-2014/", "passage_text": "There are two choices for the seasoned prime rib roast. There is USDA Choice and USDA Prime. The prime has a higher cost because it is the highest grade of beef, known for it’s marbling and tenderness, due to using younger cows. The prime sells for $16.99 per pound and the choice sells for $11.49 per pound. The cheapest prime rib I saw for sale was around $85, which was a little under 8 pounds. If you’d like to see the cooking instructions click the image below. Also, be on the lookout for discounted prime rib right after Christmas. I’ve seen it as low as $3.99/lb as the expiration dates get close."}, {"url": "http://www.kansascitysteaks.com/Prime-Rib.3.htm", "passage_text": "Roast in 375 degree oven until meat thermometer registers 130 degrees (approximately 1 to 1 hours) for medium-rare or 140 degrees (approximately 1 to 2 hours) for medium. Cover roast with aluminum foil tent and allow to stand 15 to 20 minutes. "}, {"url": "http://www.howmuchisit.org/how-much-does-prime-rib-cost/", "passage_text": "1 Prepared prime rib from meat companies online can cost upwards of $20 to $30 per pound. 2  These types of meals are generally already prepared, spiced and ready to be placed on the grill or in the oven. 3  For instance, the Kansas City Steak Company puts up their Prime rib roasts for sale at QVC.com. 1 At the local grocery store, prime rib is usually going to range anywhere from $7 to as much as $17 per pound. 2  Generally, the price per pound can drop by almost 30% during the holidays."}, {"url": "http://www.simplyrecipes.com/recipes/prime_rib/", "passage_text": "Most “prime ribs” we get from market are actually USDA Choice quality.[1] If you want USDA Prime prime rib, which has more fat marbling throughout the meat, and which can easily cost 50% more per pound, you will likely need to special order it from your butcher. Updated recipe from the archives. 4 Place the roast fat side up and rib bones down in a roasting pan. Insert a meat thermometer into the thickest part of the roast, making sure that the thermometer isn't touching a bone. 5 After browning the roast at a 500°F temperature in the oven for 15 minutes, reduce the oven temperature to 325°F."}, {"url": "http://www.costcoinsider.com/costco-prime-rib-roast/", "passage_text": "As for the “Prime” designation, this is only given to less than 2 percent of all beef in the U.S. The signature of this meat is that it’s young and with the best marbling. Choice Prime Rib Tag. Prices start at $9.99/lb for the Choice Seasoned Prime Rib (bone-in) and $16.99 for Prime Seasoned Prime Rib (bone-in). If you can wait and are fast on your feet, you can buy these cuts after Christmas and New Years for about $3.99/lb. "}, {"url": "http://www.howmuchisit.org/how-much-does-prime-rib-cost/", "passage_text": "1 The price of their prime rib roast range from $62 up to $170, with weights between 3.5 pounds to 6 pounds per roast prime rib. 2  A boneless Prime Rib Roast from Figis.com costs $89.99 for three pounds. 3  According to another source, a hand-rubbed Prime Rib from Normthompson.com is good for 6-8 servings. 1 At the local grocery store, prime rib is usually going to range anywhere from $7 to as much as $17 per pound. 2  Generally, the price per pound can drop by almost 30% during the holidays."}, {"url": "http://www.howmuchisit.org/how-much-does-prime-rib-cost/", "passage_text": "1 A boneless Prime Rib Roast from Figis.com costs $89.99 for three pounds. 2  According to another source, a hand-rubbed Prime Rib from Normthompson.com is good for 6-8 servings. 3  Four pounds of the boneless rib eye hand-rubbed prime rib costs $160. 1 At the local grocery store, prime rib is usually going to range anywhere from $7 to as much as $17 per pound. 2  Generally, the price per pound can drop by almost 30% during the holidays."}]