[{"url": "http://www.netprolive.com/hardware.php", "passage_text": "The first mouse. The first computer mouse was invented in 1963 by Douglas Engelbart at the Stanford Research Institute and was presented during a live public demonstration on December 9, 1968. This was the public debut of the computer"}, {"url": "http://royal.pingdom.com/2008/11/28/the-history-of-pc-hardware-in-pictures/", "passage_text": "The trackball was actually invented 11 years BEFORE the mouse, in 1952. It was invented by Tom Cranston and Fred Longstaff as part of a computerized battlefield information system called DATAR, initiated by the Canadian Navy. The IBM Personal Computer was introduced in 1981 as the IBM 5150. The platform became so pervasive in the 80s that although the term “personal computer” had been in use since the early 70s, a PC became synonymous with an IBM PC-compatible computer."}, {"url": "https://en.wikipedia.org/wiki/History_of_computing_hardware", "passage_text": "The history of computing hardware covers the developments from early simple devices to aid calculation to modern day computers. Before the 20th century, most calculations were done by humans. The art of mechanical analog computing reached its zenith with the differential analyzer, built by H. L. Hazen and Vannevar Bush at MIT starting in 1927, which built on the mechanical integrators of James Thomson and the torque amplifiers invented by H. W. Nieman."}, {"url": "http://royal.pingdom.com/2008/11/28/the-history-of-pc-hardware-in-pictures/", "passage_text": "The first computer mouse. The first computer mouse was invented in 1963 by Douglas Engelbart at the Stanford Research Institute. (He is also one of the inventors of hypertext.) The first mouse used two wheels positioned at a 90-degree angle to each other to keep track of the movement (see picture below). The IBM Personal Computer was introduced in 1981 as the IBM 5150. The platform became so pervasive in the 80s that although the term “personal computer” had been in use since the early 70s, a PC became synonymous with an IBM PC-compatible computer."}, {"url": "http://inventors.about.com/library/blcoindex.htm", "passage_text": "Who invented the computer? is not a question with a simple answer. The real answer is that many inventors contributed to the history of computers and that a computer is a complex piece of machinery made up of many parts, each of which can be considered a separate invention."}, {"url": "http://wifinotes.com/computer-hardware-components/history-of-computer-hardware.html", "passage_text": "For example first portable computer weighed about 25kg. History of Associated Hardware. With the development in computers, the hardware of the Pc was also improved. The first mouse was invented by Douglas Engelbart in 1963. it was a relatively instable device which was set at a 90 degrees angle. This mouse had no ball. If we go through the history of the hardware, 70% contribution in this field can be contributed to the IBM. Another important invention of this company was floppy Disks. Floppy disks were invented in 1970 and they were used till 1990’s however today there use is history."}, {"url": "https://en.wikipedia.org/wiki/History_of_computing_hardware", "passage_text": "In 1941, Zuse followed his earlier machine up with the Z3, the world's first working electromechanical programmable, fully automatic digital computer. The Z3 was built with 2000 relays, implementing a 22 bit word length that operated at a clock frequency of about 5–10 Hz. The art of mechanical analog computing reached its zenith with the differential analyzer, built by H. L. Hazen and Vannevar Bush at MIT starting in 1927, which built on the mechanical integrators of James Thomson and the torque amplifiers invented by H. W. Nieman."}, {"url": "http://www.biztechmagazine.com/article/2012/06/fathers-technology-10-men-who-invented-and-innovated-tech", "passage_text": "After his famous demo in 1968, Engelbart remained at the Stanford Research Institute till 1977, when NLS and the Augmentation Research Center (ARC) were sold to a company that was ultimately acquired by McDonnell Douglas. In honor of Father’s Day, and as a companion piece to our 10 Mothers of Technology, we’ve compiled a list of 10 men who have helped shape IT with their inventions."}, {"url": "http://royal.pingdom.com/2008/11/28/the-history-of-pc-hardware-in-pictures/", "passage_text": "The IBM Model 350 Disk File was the first hard disk drive and was part of the IBM 305 RAMAC computer that IBM started delivering in 1956 (mainly intended for business accounting). It had 50 24-inch discs that together could store about 4.4 MB of data. The IBM Personal Computer was introduced in 1981 as the IBM 5150. The platform became so pervasive in the 80s that although the term “personal computer” had been in use since the early 70s, a PC became synonymous with an IBM PC-compatible computer."}]