[{"url": "http://pages.ebay.com/help/pay/track-paypal.html", "passage_text": "When a buyer sends you a payment through PayPal, the money is usually available in your PayPal account right away. However, in some cases, the payment might be pending for a few days, or it might be held by PayPal for up to 21 days."}, {"url": "http://www.paypalsucks.com/newforums/chitchat/154811-how-do-i-get-my-money-paypal-my-bank-account.html", "passage_text": "You can transfer money directly into your linked bank account, use your PayPal Debit MasterCard, or have us mail you a check. Bank transfer. The most popular way to withdraw money from your PayPal account is to transfer the money directly into your bank account."}, {"url": "http://www.ehow.com/how_4498618_money-paypal.html", "passage_text": "Instructions. Use your PayPal account to make online purchases. Most websites that sell items online accept PayPal as a form of payment. This is a great option if you use the money that you make online to make purchases on the Internet."}, {"url": "http://www.paypalsucks.com/newforums/chitchat/154811-how-do-i-get-my-money-paypal-my-bank-account.html", "passage_text": "If you don't want to transfer money to your bank account, you can request a check. Log in to your PayPal account, click Withdraw at the top of the page and select Request a check. Customers in the U.S. should receive checks within 1-2 weeks."}, {"url": "http://www.ehow.com/how_4498618_money-paypal.html", "passage_text": "Once money is deposited into PayPal accounts, users have instant access to it. Instruct PayPal to transfer the money electronically to your bank account. You can request the transfer at any time. The transfer occurs within 5 to 7 days -- frequently less -- from the day that you request it. Once in your bank account, you use the money as you see fit."}, {"url": "http://www.ehow.com/how_4498618_money-paypal.html", "passage_text": "Request a debit card to access your money. The PayPal debit card is linked directly to the money in your account, similar to a debit card that is attached to your personal checking account."}, {"url": "http://www.paypalsucks.com/newforums/chitchat/154811-how-do-i-get-my-money-paypal-my-bank-account.html", "passage_text": "You can either do a direct transfer from the Paypal website. You can also take the money out in cash from the Paypal debit card and take it to your bank and deposit it. Or you can request a check from Paypal and deposit that into your bank account when it arrives in the mail."}]