[{"url": "http://dna-in-a-human-cell.wikispaces.com/", "passage_text": "1 Estimated total number of nucleotide pairs in a human cell: 6 x 10^9. 2  The average size of a human cell is 10 micrometers. 3  The average size of the nucleus in a human cell is 5 micrometers. 4  1 angstrom equals 0.0000000001 meters. 5  10 billion angstroms equals 1 meter."}, {"url": "http://hypertextbook.com/facts/1998/StevenChen.shtml", "passage_text": "On the average, a single human chromosome consists of DNA molecule that is about 2 inches long.. 2.3 m. The chromosomes in the nucleus of a cell contain all the information a cell needs to carry on its life processes."}, {"url": "http://dna-in-a-human-cell.wikispaces.com/", "passage_text": "1 Average number of nucleotide pairs in a single human DNA molecule: 1.5 x 10^8. 2  Estimated total number of nucleotide pairs in a human cell: 6 x 10^9. 3  The average size of a human cell is 10 micrometers. 4  The average size of the nucleus in a human cell is 5"}, {"url": "https://www.sharecare.com/health/genetics-genetic-disorders/how-much-dna-human-body", "passage_text": "Each cell in the human body contains about 2 meters of DNA that's packed into a tiny nucleus that's only about 5 micrometers in diameter. That's the rough equivalent of stuffing 2,000 miles of sewing thread into a space the size of a tennis ball."}, {"url": "https://in.answers.yahoo.com/question/index?qid=20061007124624AARIH4N", "passage_text": "Just like any other cell: Exactly one set of DNA. In a human, that means 23 chromosome pairs. The DNA copies itself whenever a cell divides into two. The exception would be sex cells: Sperm cells and eggs, each of which contain only half of the DNA structure, and become complete when a sperm cell enters an egg."}, {"url": "http://www.answers.com/Q/How_much_dna_is_in_a_human_cell", "passage_text": "Humans have 23 pairs of chromosomes, and just over 3 billion base pairs. Each cell in the human body has about 2m of DNA (if it were stretched out). This means that an average … human's DNA would be 2 * 1011 km long! This length is 500,000 times the distance to the moon (4 * 105 km)."}, {"url": "http://dna-in-a-human-cell.wikispaces.com/", "passage_text": "1 Length of one nucleotide pair in a DNA helix: 3.4 angstroms. 2  Average number of nucleotide pairs in a single human DNA molecule: 1.5 x 10^8. 3  Estimated total number of nucleotide pairs in a human cell: 6 x 10^9. 4  The average size of a human cell is 10 micrometers."}]