[{"url": "http://emedicine.medscape.com/article/276624-overview", "passage_text": "Background. Basal cell carcinoma (BCC) is the most common skin cancer in humans, yet it accounts for less than 0.1% of patient deaths due to cancer. Basal cell skin cancer tumors typically appear on sun-exposed skin, are slow growing, and rarely metastasize (0.028-0.55%)."}, {"url": "http://www.cancer.gov/publications/patient-education/skin.pdf", "passage_text": "About This Booklet This National Cancer Institute (NCI) booklet is forpeople diagnosed with the most common types of skin cancer :*• Melanoma • Basal cell skin cancer • Squamous cell skin cancerSkin cancer is the most common type of cancer inthe United States."}, {"url": "http://www.cedars-sinai.edu/Patients/Health-Conditions/Melanoma-Skin-Cancer-Treatment.aspx", "passage_text": "Skin cancer is the most common of all cancers. Between 40 to 50% of all cancer cases diagnosed every year are skin cancer. There are two main types of skin cancer: malignant melanoma and nonmelanoma skin cancer. Nonmelanoma Skin Cancer-The the most common types are basal cell carcinoma and squamous cell carcinoma. Basal cell carcinoma forms in the thin, upper layer of the skin (epidermis). It is usually found on the sun-exposed areas of the body, such as the neck and head. About 75% of all skin cancers are of this type."}, {"url": "http://www.cancer.gov/publications/patient-education/skin.pdf", "passage_text": "Forexample, the face is the most common place to findbasal cell skin cancer.In people with fair skin, basal cell skin cancer is themost common type of skin cancer.• Squamous cell skin cancer: Squamous cell skincancer begins in squamous cells."}, {"url": "http://www.dermnetnz.org/lesions/basal-cell-carcinoma.html", "passage_text": "Basal cell carcinoma. Basal cell carcinoma is also known as BCC, rodent ulcer and basalioma. It is a form of keratinocytic or non-melanoma skin cancer. Basal cell carcinoma is the most common type of cancer in humans and is particularly prevalent in the Australia and New Zealand. BCC is very rarely a threat to life."}, {"url": "http://www.cancer.gov/types/skin/patient/skin-treatment-pdq", "passage_text": "The most common types are basal cell carcinoma and squamous cell carcinoma, which are nonmelanoma skin cancers. Nonmelanoma skin cancers rarely spread to other parts of the body. Melanoma is the rarest form of skin cancer. It is more likely to invade nearby tissues and"}, {"url": "https://www.nlm.nih.gov/medlineplus/skincancer.html", "passage_text": "Skin cancer is the most common form of cancer in the United States. The two most common types are basal cell cancer and squamous cell cancer. They usually form on the head, face, neck, hands, and arms. Another type of skin cancer, melanoma, is more dangerous but less common."}]