[{"url": "http://home.costhelper.com/kitchen-cabinets.html", "passage_text": "1 Stock cabinets come pre-made in specific styles, shapes and finishes. 2  A lot depends on the size and shape of your kitchen and the total linear feet of cabinets needed. 3  Basic cabinets (top and bottom) for a 10x12-foot kitchen start at $4,000-$5,000 and up, not including installation and countertops. 1 Cabinets custom-made in a particular design or to fit in a specific layout can cost as much as four times stock prices, or $16,000-$20,000 and up, uninstalled and without"}, {"url": "http://homewyse.com/services/cost_to_install_kitchen_cabinets.html", "passage_text": "For a basic 6 cabinets project in zip code 47474, the benchmark cost to Install Kitchen Cabinets ranges between $228.12 - $366.99 per cabinet. To estimate costs for your project: 1. Set Project Zip Code Enter the Zip Code for the location where labor is hired and materials purchased. 2. Get an INSTANT estimate of the cost to Install Kitchen Cabinets! Our free calculator uses recent, trusted data to estimate costs for your Kitchen Cabinet Installation project."}, {"url": "http://www.improvenet.com/r/costs-and-prices/cabinet-installation-cost-estimator", "passage_text": "A general rule of thumb is to determine how many linear feet require cabinetry in the kitchen, and then multiply that number by $100 for basic cabinets, $200 for mid-range cabinets and $300 for upscale cabinets. The kitchen serves as the heart of the home in many ways, and some of the biggest items visible within the kitchen are the cabinets. The cost of cabinet installation is certainly not set in stone, but this cost guide can better prepare homeowners for some of the most common expenses associated with the project."}, {"url": "http://www.rempros.com/kitchen_cabinets_installation_prices.html", "passage_text": "Cost to install kitchen cabinets varies from $40 to $110 per cabinet and actual prices will be determined by a number of factors. Kitchen cabinets installation cost comparison chart (prices per cabinet installed). Type of kitchen cabinets. Average cost of installation. On average total price for stock kitchen cabinets installation in 12’ x 12’ kitchen will vary from $1,300 to $1,700. Expect to spend 80% - 105% more for installation of high end custom cabinets. In the total cost will be included installation of wood fillers, moldings, toe kicks, refrigerator and dishwasher wood panels."}, {"url": "http://www.homeadvisor.com/cost/cabinets-and-countertops/install-cabinets/", "passage_text": "On average, cabinet installation costs $4,656, with most homeowners spending between $2,068 and $7,255. This data is based on actual project costs as reported by HomeAdvisor members. Cabinets help define the personality of your kitchen and bathrooms. In fact, they're some of the first parts to look dated. "}, {"url": "http://homewyse.com/services/cost_to_install_cabinets.html", "passage_text": "Get an INSTANT estimate of the cost to Install Cabinets! Our free calculator uses recent, trusted data to estimate costs for your Cabinet Installation project. For a basic 1 cabinet project in zip code 47474, the benchmark cost to Install Cabinets ranges between $133.60 - $237.55 per cabinet. To estimate costs for your project: 1. Set Project Zip Code Enter the Zip Code for the location where labor is hired and materials purchased. 2"}, {"url": "http://www.rempros.com/kitchen_cabinets_installation_prices.html", "passage_text": "Some even minor imperfections during the installation of high end cabinets are unacceptable. Depending on level of customization a contractor can charge $2,500 - $3,700 for labor alone to install custom cabinets and stylish crow molding in a 300 ft 2 kitchen with an island. On average total price for stock kitchen cabinets installation in 12’ x 12’ kitchen will vary from $1,300 to $1,700. Expect to spend 80% - 105% more for installation of high end custom cabinets. In the total cost will be included installation of wood fillers, moldings, toe kicks, refrigerator and dishwasher wood panels."}]