[{"url": "http://www.heritageplace.com/AQHATransfer.pdf", "passage_text": "❑ Transfer fee for current AQHA or AQHYA Member ................................. $15 ❑ Transfer fee for nonmember who wishes to become a 12-month AQHA Member...... .................................................................. $55Say Goodbye to Renewal Notices-Have your membership and/or Journal subscription automatically renewed on the credit card you’ve provided. $20 Dues payments may be deductible by members as an ordinary and necessary business expense; however, contributions or gifts to the American Quarter Horse Asso-ciation are not deductible as charitable contributions for federal income tax purposes."}, {"url": "http://services2.aqha.com/iphonedev/www/sections/sectionII/rules/222.html", "passage_text": "If, for any reason, you do not want to become a member of AQHA, please indicate that in writing when submitting work to be completed, and all transactions will be completed at the nonmember fees indicated. $35. N/A. (p) For complex transactions, AQHA may charge reimbursement fees for legal expense or for extra time of employees expended to complete the requested transaction minimum fee of $100.00 plus AQHA's current hourly rate for excess hours or expense. *Does not include overnight return delivery service."}, {"url": "http://aqhamembers.org/onlinereg_out.cfm", "passage_text": "The information you are requesting is for AQHA members only. Please login to the Member Services area using your member ID and PIN to register your foals online. Here is a quick list of the information you will need to register your foals online. 1  Date foaled. "}, {"url": "http://www.asha.org/members/", "passage_text": "Renew Now. With a membership roster boasting more than 182,000 CSD professionals, ASHA is your link to audiologists, speech-language pathologists, and speech/language/hearing scientists. "}, {"url": "http://www.heritageplace.com/AQHATransfer.pdf", "passage_text": "If you do not wish to enroll in the auto renewal program, check here : ¡ ❑ ¡ Transfer fee for nonmember who wishes to become a 12-month AQHYA (Youth) Member.......................................... $20 Dues payments may be deductible by members as an ordinary and necessary business expense; however, contributions or gifts to the American Quarter Horse Asso-ciation are not deductible as charitable contributions for federal income tax purposes."}, {"url": "http://www.adha.org/membership", "passage_text": "By joining ADHA, you become part of an organization committed to defining what it means to be a champion for oral health. Backed by the collective power of thousands of dental hygienists across the country, you’ll be supported and empowered to do your best work. "}, {"url": "https://www.facebook.com/aqha1", "passage_text": "American Quarter Horse Association. 14 hrs ·. Point ranges identify the levels that exhibitors and horses are eligible for when competing at AQHA shows. Owners and exhibitors can view the 2016 point ranges and compare their show record for an approximation of the levels they will be eligible for in the next show season. The online level verification system, which allows exhibitors and horse owners to look up their class-by-class level eligibility, will be updated toward the end of 2015. AQHA: View Level Point Ranges for 2016Point ranges for the 2016 AQHA class levels are available online.aqha.com."}, {"url": "http://www.howmuchisit.org/aqha-membership-cost/", "passage_text": "1 To sign up and be an AQHA member, there are membership fees which vary depending upon the type of membership. 2  A general membership fee is $40 for a year, $80 for three years or $750 for a life membership. 3  An AQHA amateur membership costs $50 for a year and $100 for three years. 1 A general membership fee is $40 for a year, $80 for three years or $750 for a life membership. 2  An AQHA amateur membership costs $50 for a year and $100 for three years. 3  A youth membership will cost $15 for a year, $35 for three years or $50 for life youth membership."}, {"url": "http://www.howmuchisit.org/aqha-membership-cost/", "passage_text": "1 An AQHA amateur membership costs $50 for a year and $100 for three years. 2  A youth membership will cost $15 for a year, $35 for three years or $50 for life youth membership. 3  To learn more about pricing and what the membership can offer you, refer to aqha.com. 1 A general membership fee is $40 for a year, $80 for three years or $750 for a life membership. 2  An AQHA amateur membership costs $50 for a year and $100 for three years. 3  A youth membership will cost $15 for a year, $35 for three years or $50 for life youth membership."}]