[{"url": "http://www.sportsknowhow.com/basketball/dimensions/nba-basketball-court-dimensions.html", "passage_text": "The Professional NBA and (WNBA) Court is 94 feet long and 50 feet wide. Note: WNBA Basketball Court Dimensions are the same in every respect as the NBA. The Foul Line: For all courts including the NBA, the “foul line” distance is 15 feet from the foul line to the front of the backboard. “The key” (sometimes called “the lane”) for an NBA/Professional court is 16 feet wide. Regulation courts have the backboard extending out 4 feet over the baseline into the key. A 6 foot arc (half circle) extends from the foul line away from the basket to complete the key."}, {"url": "https://en.wikipedia.org/wiki/Basketball_court", "passage_text": "Basketball courts come in different sizes and colors. In the NBA, the court is 94 feet (29 m) by 50 feet (15 m). Under International Basketball Federation (FIBA) rules, the court is minutely smaller, measuring exactly 28 metres (92 ft) by 15 metres (49 ft). A high school court is slightly smaller, at 84 feet (26 m) by 50 feet (15 m). In amateur basketball, court sizes vary widely. The baskets are always 10 feet (3.0 m) above the floor (except possibly in youth competition)."}, {"url": "https://www.basketball-goals.com/basketball%20court%20dimensions.htm", "passage_text": "Basketball Court Dimensions. Basketball court dimensions are as follows: #1 NBA/NCAA-regulation basketball court dimension is 94' long by 50' wide. #2 High School basketball court dimension measure 84' long by 50' wide. #3 Jr. High School basketball court dimension measure 74' long and 42' wide. Click here for a diagram layout of basketball court dimensions."}, {"url": "http://www.dimensionsinfo.com/basketball-court-dimensions/", "passage_text": "NBA Basketball Court Dimensions. As an independent basketball organization, the NBA has its very own basketball court dimensions. In terms of length, the court is set at 94 feet. When it comes to width, it is supposed to have a measurement of 50 feet. The restraining circle’s diameter is 4 feet. The center circle’s diameter is 12 feet. The dimensions of a basketball court are different under the rules of FIBA, which basically stands for Federation Internationale de Basketball. When it comes to the distance of the 3-point line, the sides are 20.5 feet away from the middle of the basket."}, {"url": "http://www.nba.com/magic/basketball-court-dimensions", "passage_text": "Basketball Court Dimensions. Basketball court dimensions are more than a matter of painted lines and mathematics. There is a symmetry to the court, an elegance of lines and boundaries that determine not only the physical structure of a game, but the rules and philosophies behind one of America’s most popular games. Basketball court dimensions have symmetry and simplicity. The court is divided in half, with boundary lines marking the sidelines and the end lines. The mid-court line features a center circle where the opening tip takes place at the beginning of the game."}, {"url": "http://www.conceptdraw.com/How-To-Guide/basketball-court-dimensions", "passage_text": "Try It Free. “The basketball court is the playing surface, consisting of a rectangular floor with tiles at either end. Basketball courts come in different shapes and sizes and colors. In the NBA, the court is 94 feet by 50 ft (28.65m by 15.24m). Under International Basketball Federation (FIBA) rules, the court is minutely smaller, measuring exactly 28 m by 15 m (91'10.4 by 49'2.6). A high school court is slightly smaller, at 84' by 50' and some elementary schools have courts measuring 74' x 42'. "}, {"url": "http://www.my-youth-basketball-player.com/basketball-court-size.html", "passage_text": "NCAA, NBA, WNBA, & FIBA. Compare the basketball court size and dimensions used in the NBA, WNBA, NCAA, and FIBA. Find free basketball court diagrams for each level of competition. The standard hoops court is a rectangle 94 feet by 50 feet. However, check out the table below to see how the court dimensions compare for: "}, {"url": "http://www.my-youth-basketball-player.com/basketball-court-dimensions.html", "passage_text": "Nowadays, the standard basketball court dimensions are a rectangle 94 feet by 50 feet; however, high school basketball courts are a bit shorter, and the courts for junior high and youth leagues are even smaller. "}, {"url": "https://www.basketball-goals.com/basketball-court-dimensions.htm", "passage_text": "Basketball court dimensions are as follows: #1 NBA/NCAA-regulation basketball court dimension is 94' long by 50' wide. #2 High School basketball court dimension measure 84' long by 50' wide. #3 Jr. High School basketball court dimension measure 74' long and 42' wide. Click here for a diagram layout of basketball court dimensions. Click here to learn how to draw a three point line. A key basketball court dimension for installation purposes is the distance from the baseline to the face of the backboard."}]