[{"url": "http://www.ulm.edu/~stringer/restorationpark/pollution/examples.htm", "passage_text": "Examples of Nonpoint Source Pollution Nonpoint source pollution originates from a wide variety of sources. The examples given below are not an exhaustive list; more examples can be found on the Louisiana Nonpoint Source Pollution Program web site. Erosion-prone areas deposit excess amounts of sediment into nearby receiving water, which can cause aesthetic, recreational, biological, physical, and chemical degradation."}, {"url": "http://www.answers.com/Q/Example_of_point_source_pollution", "passage_text": "An examples of point source pollution is a Industry plant releasing chemicals into the air/water or and overflow of water from a sewage pipe that the waste discharges into the water. Point-Source Pollution is pollution that comes from a specific site. Nonpoint-Source Pollution is pollution that comes from many sources rather than from a single specific sit … e; an example is pollution that reaches a body of water from streets and storm sewers."}, {"url": "http://www.kean.edu/~fosborne/resources/ex12j.htm", "passage_text": "Point source pollution results when the contaminants come from a single location. Examples of point source pollution in the air, water and soil are given below. Air. A certain factory is producing chemicals. As part of the manufacturing process, certain poisonous chemicals and toxic gases result, such as benzene. 1 After individual lists are prepared, the class prepares a list of all of the pollutants and types of pollution that they have identified. 2  The items in the class list are sorted as to whether they are examples of point source pollution or non-point-source pollution."}, {"url": "http://oceanservice.noaa.gov/education/kits/pollution/03pointsource.html", "passage_text": "The U.S. Environmental Protection Agency (EPA) defines point source pollution as “any single identifiable source of pollution from which pollutants are discharged, such as a pipe, ditch, ship or factory smokestack” (Hill, 1997). Factories and sewage treatment plants are two common types of point sources. "}, {"url": "http://soils.ifas.ufl.edu/campuswaterquality/sources/", "passage_text": "Point Source Pollution. Point source pollution is defined by the U.S. Environmental Protection Agency (EPA) as “any single identifiable source of pollution from which pollutants are discharged, such as a pipe...”. Examples of point sources include: 1  discharges from wastewater treatment plants; 2  operational wastes from industries; and. "}, {"url": "http://www.kean.edu/~fosborne/resources/ex12j.htm", "passage_text": "Summary. All of these examples illustrate sources of pollution and contamination in the environment. If the origin of the pollution can be traced to a single point, it is called point source pollution. If the pollutants are entering the environment in a widespread fashion, or the pollution is of a general nature and cannot be traced to a single source, it is said to be non-point-source pollution. 1 After individual lists are prepared, the class prepares a list of all of the pollutants and types of pollution that they have identified. 2  The items in the class list are sorted as to whether they are examples of point source pollution or non-point-source pollution."}, {"url": "http://www.shorelandmanagement.org/quick/nps.html", "passage_text": "It may be hard to recognize and is often hard to control. It is pollution or runoff that comes from diffuse sources, rather than from a point source like the end of a discharge pipe. Nonpoint source pollution runs off the land and can affect lakes rivers, wetlands, groundwater, and drinking water supplies."}, {"url": "https://en.wikipedia.org/wiki/Nonpoint_source_pollution", "passage_text": "Non-point source (NPS) pollution refers to both water and air pollution from diffuse sources. Non-point source water pollution affects a water body from sources such as polluted runoff from agricultural areas draining into a river, or wind-borne debris blowing out to sea. Non-point source air pollution affects air quality from sources such as smokestacks or car tailpipes. Although these pollutants have originated from a point source, the long-range transport ability and multiple sources of the pollutant make it a non-point source of pollution. Non-point source pollution can be contrasted with point source pollution, where discharges occur to a body of water or into the atmosphere at a single location."}, {"url": "http://www.epa.vic.gov.au/your-environment/water/protecting-victorias-waters/point-and-nonpoint-sources-of-water-pollution", "passage_text": "A point source is a single, identifiable source of pollution (Wikipedia), such as a pipe or a drain. Industrial wastes are commonly discharged to rivers and the sea in this way. "}]