[{"url": "http://www.celebritynetworth.com/richest-businessmen/richest-billionaires/james-dyson-net-worth/", "passage_text": "$4.6 Billion. James Dyson net worth: James Dyson is an industrial designer from England and has a net worth of $4.6 billion dollars. Born in Cromer, Norfolk, England, James Dyson attended the Royal College of Art, where he majored in furniture and interior design, and then shifted his focus to engineering."}, {"url": "https://answers.yahoo.com/question/index?qid=20081202122115AAB8aGA", "passage_text": "So, me and the wife are in the market for a new vacuum. We have 2 dogs, 2 cats, and a kid. The Dyson animal seems like the best vacuum hands down, but for $550 is it worth it?"}, {"url": "http://www.cnet.com/news/is-dysons-digital-slim-cordless-vac-worth-the-money/#!", "passage_text": "In the case of the Dyson DC35 Digital Slim, you're looking at $299 for a cordless vacuum. That's a lot of dough, but the Slim, which is shaped more like a cleaning weapon than an appliance, has a dash of Dyson's usual innovative, fancy-sounding technology."}, {"url": "https://answers.yahoo.com/question/index?qid=20060820232538AAPbNIZ", "passage_text": "the dyson animal is an amazing machine; it is simply the best vacuum i have ever used. we have two cats and THICK pile carpet, and the dyson works like magic. Its expensive, but in my opinion well worth it. the animal also features an integral wand that extends at least 12-15 ft and makes stairs and baseboards a breeze."}, {"url": "http://content.time.com/time/health/article/0,8599,1931455,00.html", "passage_text": "Dyson Inc.'s new bladeless electric fan resembles anything but a fan. The company calls it an air multiplier.. To the average sci-fi enthusiast, it looks like a miniature replica of a stargate  but alas, this gadget does not create a wormhole that teleports people to distant worlds."}, {"url": "http://www.vacuumjudge.com/dyson-vacuums/", "passage_text": "Dyson is a trusted name in the vacuum cleaner industry, and if you are in the market to purchase a new machine, it is well worth looking at a Dyson model cleaner for that purchase."}, {"url": "http://www.therichest.com/celebnetworth/celebrity-business/tech-billionaire/james-dyson-net-worth/", "passage_text": "James Dyson has an estimated net worth of $2.7 billion. Taking an existing product and making it better is another path to success. James Dyson was frustrated by his vacuum cleaner losing suction as it filled up, so made a better version. As no one would buy his design, he set up his own factory to make and sell it."}]