[{"url": "https://en.wikipedia.org/wiki/Royal_Air_Force", "passage_text": "Today the Royal Air Force maintains an operational fleet of various types of aircraft, described by the RAF as being leading-edge in terms of technology. For much of the Cold War the primary role of the RAF was the defence of Western Europe against potential attack by the Soviet Union, with many squadrons based in West Germany. With the decline of the British Empire, global operations were scaled back, and RAF Far East Air Force was disbanded on 31 October 1971."}, {"url": "http://pcsupport.about.com/od/fileextensions/f/raf-file.htm", "passage_text": "A file with the RAF file extension is a Fuji Raw Image file. Other types of files may also use the RAF file extension. If you know of any additional file formats that use the .RAF extension, please let me know so I can update this information. The easiest way to open a RAF file is to double-click on it and let your PC decide which default application should open the file."}, {"url": "http://www.shouldiremoveit.com/RAF-12660-program.aspx", "passage_text": "RAF files contain all the information necessary to make an image as sharpening level, contrast and saturation settings, color temperature … and they are all stored in so called header file. Also RAF file contain technical characteristics of Fuji camera. "}, {"url": "https://en.wikipedia.org/wiki/C-Raf", "passage_text": "The c-Raf protein is part of the ERK1/2 pathway as a MAP kinase kinase kinase (MAP3K) that functions downstream of the Ras subfamily of membrane associated GTPases. C-Raf is a member of the Raf kinase family of serine/threonine-specific protein kinases, from the TKL (Tyrosine-kinase-like) group of kinases. The structure of this kinase domain is well-known from both c-Raf and B-Raf. It is highly similar to other Raf kinases and KSR proteins, and distinctly similar to some other MAP3 kinases, such as the Mixed Lineage Kinase (MLK) family. Together they comprise the Tyrosine Kinase Like (TKL) group of protein kinases."}, {"url": "https://en.wikipedia.org/wiki/Royal_Air_Force", "passage_text": "The Royal Air Force (RAF) is the United Kingdom's aerial warfare force. Formed toward the end of the First World War on 1 April 1918, it is the oldest independent air force in the world. Following victory over the Central Powers in 1918 the RAF emerged as, at the time, the largest air force in the world. For much of the Cold War the primary role of the RAF was the defence of Western Europe against potential attack by the Soviet Union, with many squadrons based in West Germany. With the decline of the British Empire, global operations were scaled back, and RAF Far East Air Force was disbanded on 31 October 1971."}, {"url": "http://www.coolutils.com/Formats/RAF", "passage_text": "RAF is just one member of the whole bunch of raw formats known for today, such as CR2 (Canon), ERF (Epson), MEF (Mamiya), MOS (Leaf), PEF (Pentax), ORF (Olympus), etc. There is no uniform standard for raw formats, because they are all proprietary and therefore cannot be fitted to a fixed pattern. RAF files also contain technical characteristics of the camera (metadata). Both image sensor data and metadata are saved to the card and are ready for further processing by photographers. Compared to JPEG images, RAF images have a much wider color gamut, and are characterized by maximum proximity to the real picture."}, {"url": "http://www.coolutils.com/Formats/RAF", "passage_text": "RAF is a digital image format used in Fuji digital cameras. Unlike JPEG or TIFF, RAF files cannot be printed or used by photo editors, because they have not passed any processing yet. RAF files also contain technical characteristics of the camera (metadata). Both image sensor data and metadata are saved to the card and are ready for further processing by photographers. Compared to JPEG images, RAF images have a much wider color gamut, and are characterized by maximum proximity to the real picture."}, {"url": "http://pcsupport.about.com/od/fileextensions/f/raf-file.htm", "passage_text": "How To Open a RAF File. The easiest way to open a RAF file is to double-click on it and let your PC decide which default application should open the file. If no program opens the RAF file then you probably don't have an application installed that can view and/or edit RAF files"}, {"url": "https://en.wikipedia.org/wiki/C-Raf", "passage_text": "RAF proto-oncogene serine/threonine-protein kinase also known as proto-oncogene c-RAF or simply c-Raf or even Raf-1 is an enzyme that in humans is encoded by the RAF1 gene. The structure of this kinase domain is well-known from both c-Raf and B-Raf. It is highly similar to other Raf kinases and KSR proteins, and distinctly similar to some other MAP3 kinases, such as the Mixed Lineage Kinase (MLK) family. Together they comprise the Tyrosine Kinase Like (TKL) group of protein kinases."}, {"url": "https://en.wikipedia.org/wiki/C-Raf", "passage_text": "The first Raf gene, v-Raf was found in 1983. It was isolated from the murine retrovirus bearing the number 3611. It was soon demonstrated to be capable to transform rodent fibroblasts to cancerous cell lines, so this gene was given the name Virus-induced Rapidly Accelerated Fibrosarcoma (V-RAF). The structure of this kinase domain is well-known from both c-Raf and B-Raf. It is highly similar to other Raf kinases and KSR proteins, and distinctly similar to some other MAP3 kinases, such as the Mixed Lineage Kinase (MLK) family. Together they comprise the Tyrosine Kinase Like (TKL) group of protein kinases."}]