[{"url": "https://answers.yahoo.com/question/index?qid=20070815111553AAfGqCB", "passage_text": "Sherbet is still served following circumcision ceremonies or a childbirth to increase lactation of the mother. Sherbet in the United Kingdom is a kind of fizzy powder made from bicarbonate of soda, tartaric acid, sugar etc and usually cream soda or fruit flavoured."}, {"url": "http://www.cooksinfo.com/sherbet-candy", "passage_text": "Newsletter sign up. In the United Kingdom, the word Sherbet means a candy powder that is both sweet and tart at the same time. The powder also fizzes when it comes into contact with water, such as the moisture in your mouth."}, {"url": "http://www.wikihow.com/Make-Sherbet", "passage_text": "Sherbet is a sweet, icy treat made with fruit juice and milk. Orange sherbet is the classic flavor, but you can make it with any citrus or berry fruit. Sherbet is easy to make if you have an ice cream maker, and the flavor possibilities are endless."}, {"url": "https://answers.yahoo.com/question/index?qid=20070815111553AAfGqCB", "passage_text": "Best Answer: Sherbet in the United Kingdom is a kind of fizzy powder made from bicarbonate of soda, tartaric acid, sugar etc and usually cream soda or fruit flavoured. The acid-carbonate reaction occurs upon presence of moisture (juice/saliva)."}, {"url": "http://www.thefreedictionary.com/Soda+powder", "passage_text": "1. also sher·bert (-burt′) Bûrt a frozen dessert made mainly of fruit juice or fruit, puree purée usually with sugar and milk. or. Cream 2 Chiefly british a-usually fruit flavored, effervescent powder eaten as candy or made into. a. drink 3 Also Sherbert australian an, alcoholic beverage. especially beer"}, {"url": "http://www.thefreedictionary.com/sherbet", "passage_text": "1. also sher·bert (-burt′) Bûrt a frozen dessert made mainly of fruit juice or fruit, puree purée usually with sugar and milk. or. Cream 2 Chiefly british a-usually fruit flavored, effervescent powder eaten as candy or made into. a. drink 3 Also Sherbert australian an, alcoholic beverage. especially beer"}]