[{"url": "https://simple.wikipedia.org/wiki/Saffron", "passage_text": "Saffron (pronounced /ˈsaefrən/, /ˈsæfrən/) (ˈsaefrɒn: زَعْفَرَان) persian زعفران is a spice made from the stigma of the flower of the. Saffron plant the spice is used in cooking as a seasoning and as a. food colouring"}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-844-SAFFRON.aspx?activeIngredientId=844&activeIngredientName=SAFFRON", "passage_text": "Saffron is a plant. The dried stigmas (thread-like parts of the flower) are used to make saffron spice. It can take 75,000 saffron blossoms to produce a single pound of saffron spice. Saffron is largely cultivated and harvested by hand."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-844-SAFFRON.aspx?activeIngredientId=844&activeIngredientName=SAFFRON", "passage_text": "Saffron is POSSIBLY SAFE for most people when taken by mouth as a medicine for up to 6 weeks. Some possible side effects include dry mouth, anxiety, dizziness, drowsiness, nausea, change in appetite, and headache. Allergic reactions can occur in some people. Taking large amounts of saffron by mouth is POSSIBLY UNSAFE."}, {"url": "http://www.herbwisdom.com/herb-saffron.html", "passage_text": "Saffron is the most expensive spice in the world! It is produced from the saffron crocus flower (Crocus sativus). It is actually the dried stigmas (which are the insides of a flower that catch pollen) and has a deep auburn colour and sweet flavour. The stigmas can only be picked by hand as machines are not delicate enough."}, {"url": "http://www.medicinenet.com/saffron-page2/supplements-vitamins.htm", "passage_text": "Ingesting large amounts of saffron can cause poisoning including yellow appearance of the skin, eyes, and mucous membranes; vomiting; dizziness; bloody diarrhea; bleeding from the nose, lips, and eyelids; numbness; and other serious side effects. Do not take saffron if: 1  smaller. 2  medium."}]