[{"url": "https://en.wikipedia.org/wiki/Planking_(fad)", "passage_text": "Planking (or the Lying Down Game) is an activity consisting of lying face down—sometimes in an unusual or incongruous location. Both hands must touch the sides of the body. Some players compete to find the most unusual and original location in which to play. Planking can include lying flat on a flat surface, or holding the body flat while it is supported in only some regions, with other parts of the body suspended."}, {"url": "https://en.wikipedia.org/wiki/Plank_%28exercise%29", "passage_text": "The most common plank is the front plank which is held in a push-up position with the body's weight borne on forearms, elbows, and toes. Many variations exist such as the side plank and the reverse plank. The plank is commonly practiced in pilates and yoga, and by those training for boxing and other sports. The plank strengthens the abdominals, back, and shoulders. Muscles involved in the front plank include: 1  Primary muscles: erector spinae, rectus abdominis (abs), and transverse abdominus. Muscles involved in the side plank include: 1  Primary: transversus abdominis muscle, gluteus medius and gluteus minimus muscles (abductors), the adductor muscles of the hip, and the external, and internal obliques. 2  Secondary: gluteus maximus (glutes), quadriceps (quads), and hamstrings."}, {"url": "http://www.health.com/health/gallery/0,,20813896,00.html", "passage_text": "Shore up your core. The plank is one of the best exercises you can do for your core because it builds isometric strength to help sculpt your waistline and improve your posture. And depending on the type of plank you try, you can also engage your back, arms, shoulders, glutes, and hamstrings. Win! Whether you can hold a plank for 20 seconds or two minutes, you’ll love these fresh variations on the standard move. Bonus: 16 of them don’t require a single piece of equipment."}, {"url": "http://www.wikihow.com/Perform-the-Plank-Exercise", "passage_text": "1 Slowly lift one foot at a time off the ground for a single leg plank. 2  Slowly reach one arm out in front of you, then return it to the floor for a single arm plank. 3  Repeat with the other arm and continue to alternate. 4  Make sure your hips remain stable and don’t rock from side to side. Inhale and return to plank pose. After you’ve held side plank for 3-5 breaths, inhale and roll yourself back into plank pose, kumbhakasana. Stay here for a breath or two to give yourself a rest before performing side plank on your left side."}, {"url": "http://www.wikihow.com/Perform-the-Plank-Exercise", "passage_text": "Plank pose, which is called kumbhakasana in Sanskrit, is one of the most foundational poses, or asanas, in yoga. Plank is often done as part of the sun salutation sequence, or as part of a vinyasa in a yoga flow sequence. There are two variations of plank pose: kumbhakasana (full plank) and vasisthasana (side plank). You can do either as a stand-alone exercise to build core, arm, and back strength as well as improve your posture. Inhale and return to plank pose. After you’ve held side plank for 3-5 breaths, inhale and roll yourself back into plank pose, kumbhakasana. Stay here for a breath or two to give yourself a rest before performing side plank on your left side."}, {"url": "http://www.merriam-webster.com/dictionary/plank", "passage_text": "Full Definition of PLANK. 1. a: a heavy thick board; especially: one 2 to 4 inches (5 to 10 centimeters) thick and at least 8 inches (20 centimeters) wide b: an object made of a plank or planking c: planking. 2. a: an article in the platform of a political party b: a principal item of a policy or program. "}, {"url": "http://30dayfitnesschallenges.com/30-day-plank-challenge/", "passage_text": "The 30 day plank challenge only has 1 exercise which you have to do each day, and the time spent doing the exercise slowly increases day by day to help you build up your core body muscle strength gradually, ensuring you are able to complete the final day of the challenge easily. 30 DAY PLANK CHALLENGE. Take up this 30 day plank challenge this month and tone up and boost your core muscles to the max. The plank challenge is our most popular 30 day fitness challenge and has been taken by over 800,000 people over the past 12 months, so why not give it ago for yourself"}, {"url": "http://30dayfitnesschallenges.com/how-to-do-a-plank/", "passage_text": "BENEFITS. Plank helps you to build strength in your core, upper and lower body so its a good full body work out. You do not need any equipment to perform this exercise all you need is a bit of space, and it really helps improve flexibility by stretching muscles and will improve posture if performed regularly. HOW TO DO A PLANK. 1  Start by getting into a press up position. 2  Bend your elbows and rest your weight ono your forearms and not on your hands. 3  Your body should form a straight line from shoulders to ankles. 4  Engage your core by sucking your belly button into your spine."}, {"url": "http://www.youtube.com/watch?v=kiA9j-dR0oM", "passage_text": "Please try again later. http://www.FatLossToGo.com Learn how to do the best abs exercise, the Plank. The plank is the best abs exercise but needs to be done correctly in order to get a strong core and be an effective core exercise. 1  Howto & Style. "}]