[{"url": "http://www.homewyse.com/services/cost_to_insulate_your_home.html", "passage_text": "Get an INSTANT estimate of the cost to Insulate Your Home! Our free calculator uses recent, trusted data to estimate costs for your Home Insulation project. For a basic 500 square feet project in zip code 47474, the benchmark cost to Insulate Your Home ranges between $0.63 - $1.43 per square foot* . To estimate costs for your project: 1. Set Project Zip Code Enter the Zip Code for the location where labor is hired and materials purchased"}, {"url": "http://www.homewyse.com/services/cost_to_install_batt_floor_insulation.html", "passage_text": "Our free calculator uses recent, trusted data to estimate costs for your Batt Floor Insulation Installation project. For a basic 125 square feet project in zip code 47474, the benchmark cost to Install Batt Floor Insulation ranges between $1.28 - $2.47 per square foot* . To estimate costs for your project: 1. Set Project Zip Code Enter the Zip Code for the location where labor is hired and materials purchased"}, {"url": "http://www.homeadvisor.com/cost/insulation/", "passage_text": "If your crawlspace is well-ventilated, insulating it with batting is ideal and often works best. Cost estimates vary greatly depending on the size of your crawl space, from a $3 for one roll to a $300 for larger spaces. 1 There is little learning curve involved with the application, and a DIY job will cost you about $500. 2  Calling in the pros, on the other hand, will run you about $1,500 to $2,000 for an average 1500 square foot home."}, {"url": "http://www.homeadvisor.com/cost/insulation/", "passage_text": "1 Cost: The average cost per square foot is between $0.64 - $1.19. 2  So, for a 500 square foot area, your estimate will vary between $145 to $200, if you do it yourself. 3  For a professional job, add between $150 to $300 for labor, and you're looking at around $300 to $500 for 6 hours of work. 1 There is little learning curve involved with the application, and a DIY job will cost you about $500. 2  Calling in the pros, on the other hand, will run you about $1,500 to $2,000 for an average 1500 square foot home."}, {"url": "http://www.which.co.uk/energy/creating-an-energy-saving-home/guides/floor-insulation/", "passage_text": "Properly insulating your floor will not only warm your feet, it will also help you to save money. Insulating your floor and skirting boards can save as much as £80 a year and, if you can install it yourself, pay for itself in about two years through savings on your heating bills. "}, {"url": "http://www.superhomes.org.uk/resources/insulate-a-floor/", "passage_text": "Insulating a solid floor is a lot more trouble and expensive than insulating a timber floor. Typically, the former has a payback of between 8 or 10 years or more, but the payback period for suspended timber floor insulation is between 3 and 5 years. How to insulate a concrete floor. If a floor is being excavated and replaced, this is a perfect opportunity to improve the standard of insulation. A U-value of 0.2W/m 2 K can be achieved for a typical semi-detached dwelling using around 100mm of air-based insulation and careful detailing."}, {"url": "http://www.energy.gov/energysaver/where-insulate-home", "passage_text": "Also insulate (4A) any portion of the floor in a room that is cantilevered beyond the exterior wall below; (4B) slab floors built directly on the ground; (4C) as an alternative to floor insulation, foundation walls of unvented crawl spaces. (4D) Extend insulation into joist space to reduce air flows. Where to Insulate in a Home. Examples of where to insulate. 1. In unfinished attic spaces, insulate between and over the floor joists to seal off living spaces below. If the air distribution is in the attic space, then consider insulating the rafters to move the distribution into the conditioned space."}, {"url": "http://homeguides.sfgate.com/insulate-existing-floors-6945.html", "passage_text": "3. Multiply the total inches of insulation by 3.2 to estimate the existing R-value of your floor. If you have 2 inches of insulation, your floor has an R-value of 6.4. Most homes require at least R-13, though homes in cold areas can benefit from more insulation"}, {"url": "http://home.costhelper.com/insulation.html", "passage_text": "1 A rough estimate for hiring someone to blow insulation into a flat roof, cathedral ceiling or wall cavities is $2-$3.50 a square foot, or $1,000-$3,500 for filling 1,000 square feet of empty wall or roof space. 1 There are a lot of variables that impact the total cost, but a rough estimate for having a contractor insulate an open attic to modern standards is $0.50-$2.25 a square foot depending on local climate and the desired R-value of the materials."}, {"url": "http://articles.chicagotribune.com/2012-11-23/classified/sns-201211131700--tms--askbildrctnab-a20121123-20121123_1_fuel-savings-rigid-foam-insulation", "passage_text": "--Debbie S., Manchester, Tenn. DEAR DEBBIE: Insulating the floor in your home will definitely make you more comfortable. Once you repay yourself in energy savings for the cost of installing the insulation, you'll really start to save money on your fuel bills. Before we discuss insulation products, let's talk about saving money."}]