[{"url": "http://www.rightline.net/education/buybacks.html", "passage_text": "When a corporation buys its own stock on the open stock market, it is considered a stock buyback and the shares purchased are re-titled treasury stock.. Before examining some of the potential benefits and pitfalls of a stock buyback, let's first review a couple of terms that will be used in this discussion:"}, {"url": "http://www.luptonfawcett.com/services-for-business/corporate/private-companies/related-articles/buyback-of-shares/", "passage_text": "Buyback of shares is a convenient way for a company to return cash to shareholders. Under a share buyback the company acquires shares in itself from existing shareholders. The shares are then (generally) cancelled and the issued share capital of the company is reduced accordingly."}, {"url": "http://www.fool.com/investing/general/2014/10/20/does-cbss-6-billion-stock-buyback-make-sense.aspx", "passage_text": "One buyer who is getting in on the stock at these low prices is CBS itself. CBS has bought back a significant number of shares in the last three years, and that buyback spree is accelerating now. The company doubled its buyback authorization to $6 billion in August."}, {"url": "http://www.investopedia.com/terms/s/sharerepurchase.asp", "passage_text": "DEFINITION of 'Share Repurchase'. A program by which a company buys back its own shares from the marketplace, reducing the number of outstanding shares. Share repurchase is usually an indication that the company's management thinks the shares are undervalued."}, {"url": "http://www.investopedia.com/terms/b/buyback.asp", "passage_text": "A buyback allows companies to invest in themselves. By reducing the number of shares outstanding on the market, buybacks increase the proportion of shares a company owns. Buybacks can be carried out in two ways: 1."}, {"url": "http://finance.yahoo.com/news/cbs-extends-share-buyback-5-183649068.html", "passage_text": "More From Zacks.com. CBS Corporation (CBS) extended its current share repurchase authorization to a total of $6 billion as the company enhanced the share repurchase program by an additional $5.1 billion. Since the inception of the share repurchase plan in Jan 2011, the company bought back $3.75 billion worth of shares. Alongside, CBS Corporation announced a quarterly dividend of 12 cents a share to be paid on Oct 1, 2013, to shareholders of record as of Sep 10."}]