[{"url": "http://www.extension.umn.edu/garden/yard-garden/flowers/tuberous-begonias/", "passage_text": "Choose a site for tuberous begonias that is somewhat protected from wind, where the soil is well-drained, and plants will be shaded during most of the day. Early morning and late afternoon sun will not harm them; they need good indirect or dappled light at other times."}, {"url": "http://www.begonias.org/Articles/EasyGrowTuberou%20Begonias.htm", "passage_text": "It's Easy to Grow Tuberous Begonias. SOIL PREPARATION: Tuberous begonias can survive in many types of soils. The most important factor to be considered in preparing any soil for begonia is PERFECT DRAINAGE."}, {"url": "http://www.calbegonias.com/growing-begonias/", "passage_text": "Depending on environmental conditions, begonias will bloom in 12 to 20 weeks after planting. Warmer soil temperatures may have the most influence on advancing growth and ultimately time to bloom. Our recommendations on how many tubers to plant in a pot."}, {"url": "http://www.extension.umn.edu/garden/yard-garden/flowers/tuberous-begonias/", "passage_text": "Tuberous begonias are popular for their beautiful flowers which come in a variety of colors and forms. Red, orange, yellow, white, salmon and pink blooms may be single or double; they may be plain, ruffled or toothed; their petals may have margins, crests or blotches of contrasting color."}, {"url": "http://www.thegardenhelper.com/reiger.html", "passage_text": "Ideal growing temperatures for Begonias grown indoors are 65° to 70° F. during the day and 50° to 65° at night. As is the case with any house plants, always avoid hot and cold drafts! Begonias should be grown in partial sun or light shade and planted in a sandy soil mix that contains added peat moss and compost."}, {"url": "http://www.calbegonias.com/growing-begonias/", "passage_text": "3.) Place the tubers hollow side up with the top just below the surface. Keep the soil moist but do not over-water before growth appears. 4.) Temperature of 72º F is ideal but slightly higher or lower temperatures are ok. In 2-3 weeks, after the sprouts emerge, be sure to provide ample light."}, {"url": "http://www.pwfourstar.com/sites/default/files/culture-guides-2015/annuals/Tuberous%20Begonia.pdf", "passage_text": "LIGHT/LIGHTING Tuberous Begonias require long days of 12 hours or more for proper growth. If exposed to short days (less than 12 hours) tubers can form and plants will go dormant. If crops are planted before April 1st, 14-hour daylength extension or night interruption lighting should be provided in most areas."}, {"url": "http://www.calbegonias.com/growing-begonias/", "passage_text": "In areas with hot summer temperatures it is best to have them well established before hot weather arrives. Tubers may be planted indoors about 8 weeks before transplanting outdoors. 1.) Fill a flat box or small pot with potting soil at least 2 ½ inches deep."}, {"url": "http://www.begonias.org/Articles/EasyGrowTuberou%20Begonias.htm", "passage_text": "A temperature of 60-70 degrees is ideal. The flat should not be watered again until the surface of the soil begins to show dryness. As the plants develop, they will need water more often and in increasing amounts. It is important to keep the tubers in the flat until the roots are well developed."}]