[{"url": "https://en.wikipedia.org/wiki/Copper(II)_sulfate", "passage_text": "Copper sulfate is produced industrially by treating copper metal with hot concentrated sulfuric acid or its oxides with dilute sulfuric acid. For laboratory use, copper sulfate is usually purchased. Copper sulfate is also used to test blood for anemia. The blood is tested by dropping it into a solution of copper sulfate of known specific gravity – blood which contains sufficient hemoglobin sinks rapidly due to its density, whereas blood which does not sink or sinks slowly has insufficient amount of hemoglobin."}, {"url": "http://www.buzzle.com/articles/copper-sulfate-uses.html", "passage_text": "Copper sulfate, also known as 'blue stone' or 'blue vitriol', is a chemical compound that is used in a wide range of industries. The basic chemical formula of blue vitriol is 'CuSO 4 ', but the salt exists as a series of different compounds, depending on the degree of hydration. When the blue crystals of copper sulfate are heated in an open flame, they get dehydrated and turn grayish white. Uses. Copper sulfate is a versatile chemical compound having a wide range of applications in agriculture, as well as pharmaceutical and chemical"}, {"url": "http://www.buzzle.com/articles/copper-sulfate-uses.html", "passage_text": "Apart from the above uses of copper sulfate, this compound is also used in preparation of wood preservatives to protect timber from wood worms. It is also utilized as a mordant in dyeing, and as a reagent in tanning process. When the blue crystals of copper sulfate are heated in an open flame, they get dehydrated and turn grayish white. Uses. Copper sulfate is a versatile chemical compound having a wide range of applications in agriculture, as well as pharmaceutical and chemical industries."}, {"url": "https://en.wikipedia.org/wiki/Copper(II)_sulfate", "passage_text": "Commercial copper sulfate is usually about 98% pure copper sulfate, and may contain traces of water. Anhydrous Copper sulfate is 39.81 percent copper and 60.19 percent sulfate by mass, and in its blue, hydrous form, it is 25.47% copper, 38.47% sulfate (12.82% sulfur) and 36.06% water by mass. Copper sulfate is also used to test blood for anemia. The blood is tested by dropping it into a solution of copper sulfate of known specific gravity – blood which contains sufficient hemoglobin sinks rapidly due to its density, whereas blood which does not sink or sinks slowly has insufficient amount of hemoglobin."}, {"url": "https://en.wikipedia.org/wiki/Copper(II)_sulfate", "passage_text": "The anhydrous form is a pale green or gray-white powder, whereas the pentahydrate (CuSO 4 ·5H 2 O), the most commonly encountered salt, is bright blue. Copper (II) sulfate exothermically dissolves in water to give the aquo complex [Cu(H 2 O) 6 ] 2+ , which has octahedral molecular geometry and is paramagnetic. Copper sulfate is also used to test blood for anemia. The blood is tested by dropping it into a solution of copper sulfate of known specific gravity – blood which contains sufficient hemoglobin sinks rapidly due to its density, whereas blood which does not sink or sinks slowly has insufficient amount of hemoglobin."}, {"url": "http://www.disabled-world.com/medical/alternative/homeremedies/bluestone.php", "passage_text": "Copper Sulphate is a widely used chemical compound comprised of Copper, Sulphur and Oxygen whose formula is CuSO4. Crystals of Copper Sulphate are often bright blue and the substance was known once as Blue Vitriol or Bluestone. Copper sulfate was used in the past as an emetic, (An agent that induces vomiting). 1 (You can swim right away). 2  Copper sulfate pentahydrate is a fungicide. 3  However, some fungi are capable of adapting to elevated levels of copper ions. 4  Mixed with lime it is called Bordeaux mixture and used to control fungus on grapes, melons, and other berries."}, {"url": "http://porwal.net/coppersulphate.htm", "passage_text": "It is Sulphonation of Copper. It is generally available in 5H2O (Crystal) form, though anhydrous is also available. Copper sulphate, blue stone, blue vitriol are all common names for pentahydrated cupric sulphate, which is the best known and the most widely used of the copper salts. "}, {"url": "https://en.wikipedia.org/wiki/Copper(II)_sulfate", "passage_text": "Copper (II) sulfate, also known as cupric sulfate or copper sulphate, is the inorganic compound with the chemical formula Cu SO4. Copper sulfate is also used to test blood for anemia. The blood is tested by dropping it into a solution of copper sulfate of known specific gravity – blood which contains sufficient hemoglobin sinks rapidly due to its density, whereas blood which does not sink or sinks slowly has insufficient amount of hemoglobin."}, {"url": "http://copperalliance.org.uk/copper-and-its-alloys/compounds/uses-of-copper-sulphate", "passage_text": "Uses of Copper Sulphate. Copper sulphate, blue stone, blue vitriol are all common names for pentahydrated cupric sulphate, CuSO 4 5H 2 O, which is the best known and the most widely used of the copper salts. Indeed it is often the starting raw material for the production of many of the other copper salts. Copper sulphate is a very versatile chemical with as extensive a range of uses in industry as it has in agriculture. Its principal employment is in agriculture, and, up to a generation or so ago, about its only uses in industry were as a mordant for dyeing and for electroplating."}, {"url": "https://edis.ifas.ufl.edu/fa008", "passage_text": "Copper comes in several forms which can be used in water. The cheapest and most commonly used form is copper sulfate, which is available either as a crystal or a powder (often known as Bluestone or Blue powder). Copper sulfate is water soluble, and dissolves fairly easily when mixed with water. Several companies market copper in liquid and crystal forms."}]