[{"url": "http://www.englishleap.com/vocabulary/capitalism-meaning", "passage_text": "CAPITALISM. MEANING: (n.) A system of economy where private individuals or corporations control the production and distribution of capital goods and the price of the goods are determined by competition in a free market. EXAMPLE SENTENCES: 1  Most countries in Eastern Europe are moving towards free-market capitalism"}, {"url": "http://www.investinganswers.com/financial-dictionary/economics/capitalism-1337/", "passage_text": "Capitalism is often considered the antithesis of Socialism -- an economic and political system where the ownership of capital (the means of production) is commonly owned. How it works/Example: Under capitalism, prices and wages are determined by the forces of supply and demand. Members of a capitalist economy are driven to obtain the maximum amount of utility (benefit or  profit ) at the least cost."}, {"url": "http://study.com/academy/lesson/what-is-capitalism-definition-examples.html", "passage_text": "Capitalism is an economic system in which the means of production of goods or services are privately owned and operated for a profit. The structure of the system allows owners and individuals to engage in whatever business they wish and does not restrict the amount of money each person is allowed to make. Definition of Capitalism. There are many different types of economic systems that regulate how people operate and profit from business, including capitalism, communism, and socialism. This lesson focuses on capitalism. Capitalism is an economic system in which the means of production of goods or services are privately owned and operated for a profit. In capitalism, individuals are given the freedom to operate their business as they want and manage their own incom"}, {"url": "http://www.investinganswers.com/financial-dictionary/economics/capitalism-1337/", "passage_text": "Capitalism is an economic and social system in which participants privately own the means of production -- called capital. Free market competition, not a central government or regulating body, dictates production levels and prices. How it works/Example: Under capitalism, prices and wages are determined by the forces of supply and demand. Members of a capitalist economy are driven to obtain the maximum amount of utility (benefit or  profit ) at the least cost."}, {"url": "http://www.merriam-webster.com/dictionary/capitalism", "passage_text": "Full Definition of CAPITALISM. : an economic system characterized by private or corporate ownership of capital goods, by investments that are determined by private decision, and by prices, production, and the distribution of goods that are determined mainly by competition in a free market. "}, {"url": "http://examples.yourdictionary.com/examples-of-capitalism.html", "passage_text": "Capitalism is an economic system in which the means of production and distribution are privately or corporately owned and the operations are funded by profits. While many would argue that there are no examples of true capitalism, some examples of countries employing capitalism include: 1  United States. 2  Canada. 3  United Kingdom. 4  Australia. 5  New Zealand. 6  Austria. 7  Ireland. 8  Sweden. 9  Switzerland."}, {"url": "https://en.wikipedia.org/wiki/Capitalism", "passage_text": "Capitalism is an economic system in which trade, industry, and the means of production are privately owned and operated via profit and loss calculation (price signals) through the price system. "}, {"url": "http://www.yourdictionary.com/capitalism", "passage_text": "noun. The definition of capitalism is an economic system in which the means of production and distribution are privately or corporately owned and the operations are funded by profits. An example of capitalism is the prison system in the United States being operated by private companies. An economic system in which the means of production and distribution are owned and controlled mostly by private individuals and businesses for profit, thus what is produced and the quantities thereof are determined by consumer demand and competition."}]