[{"url": "http://www.thinkbabynames.com/meaning/0/Eira", "passage_text": "Eira /eira/ [2 sylls.] as a girls' name is of Welsh origin, and the meaning of Eira is snow. Modern coinage from the word eira. In the Scandinavian language, it is a variant of Eir. A pretty name for a winter baby. Eira is an uncommon first name for females and an equally rare surname for all people. (2000 U.S. Census). Shown below is the baby name popularity of Eira for girls"}, {"url": "http://www.babynamespedia.com/meaning/Eira", "passage_text": "Tweet. Eira is used predominantly in English, Finnish, and Welsh, and its origin is Welsh. It is derived literally from the word 'eira' which is of the meaning snow. Eira's language of origin is Old Norse and it is predominantly used in the Scandinavian language. The first name is derived from the name of the Norse goddess of medicine. [ 2 syll. ei-ra, eir-a ] The baby girl name Eira is pronounced as-AY-Raa-or-OY Raa †. Eir, Eyr, and Eyra are variations of Eira. See also the related form, Gweneira (Welsh). Eira is a rarely used baby name for girls. It is not listed in the top 1000 names. Baby names that sound like Eira include Eari, Aaraa, Ara, Arah, Ari, Arie, Arwa, Arya, Aura, Aure, Aurear, Aureare, Auri, Aurie, Aurore, Aury, Iyar, Ora, Orah, and Ore"}, {"url": "http://www.thenamemeaning.com/eira/", "passage_text": "Search comprehensively and find the name meaning of Eira and its name origin or of any other name in our database. Also note the spelling and the pronunciation of the name Eira and check the initials of the name with your last name to discover how it looks and sounds. Popularity of the Name Eira. This name is not popular in the US, according to Social Security Administration, as there are no popularity data for the name. This doesn't mean that the name Eira is not popular in other countries all over the world. The name might be popular in other countries, in different languages, or even in a different alphabet, as we use the characters from the Latin alphabet to display the data"}, {"url": "http://www.babynology.com/meaning-eira-f71.html", "passage_text": "Eira mane Snow. Eira was the the goddess of healing in the pre-christian religion of Scandinavian countries. Eira a Scandinavian place name from the Norse Goddess Eir, the Goddess of medecine and healing. By Norse tradition, only women practiced the healing arts. "}, {"url": "http://www.thenamemeaning.com/eira/", "passage_text": "The meaning of Eira has more than one different etymologies. It has same or different meanings in other countries and languages. The different meanings of the name Eira are: 1  Welsh meaning: Snow. 2  Norse meaning: Help; mercy. Popularity of the Name Eira. This name is not popular in the US, according to Social Security Administration, as there are no popularity data for the name. This doesn't mean that the name Eira is not popular in other countries all over the world. The name might be popular in other countries, in different languages, or even in a different alphabet, as we use the characters from the Latin alphabet to display the data"}, {"url": "http://www.meaning-of-names.com/irish-names/eira.asp", "passage_text": "Meaning of Eira. Irish name. In Irish, the name Eira means-snow. Other origins for the name Eira include-Irish, Welsh.The name Eira is most often used as a girl name or female name. Irish Name Meaning-snow."}]