[{"url": "http://www.ehow.com/info_8518894_life-expectancy-apple-tree.html", "passage_text": "While the Bramley apple tree has been known to live for 200 years, the average lifespan of the apple tree is closer to 100 years, with between 30 and 40 of those years being fruitful. Crabapple trees live between 30 and 50 years. The longevity of the apple tree is determined by the rootstock, and this also governs how early it bears fruit and its overall size."}, {"url": "http://www.walterreeves.com/gardening-q-and-a/crabapple-tree-lifespan/", "passage_text": "It’s hard to say how long a crabapple will live but I do know that if you keep the roots moist and cool with mulch and also keep leaves on the tree as long as possible each growing season, your tree will have the best chance for a long life."}, {"url": "http://www.ehow.com/info_8518894_life-expectancy-apple-tree.html", "passage_text": "NA/AbleStock.com/Getty Images. While the Bramley apple tree has been known to live for 200 years, the average lifespan of the apple tree is closer to 100 years, with between 30 and 40 of those years being fruitful. Crabapple trees live between 30 and 50 years. The longevity of the apple tree is determined by the rootstock, and this also governs how early it bears fruit and its overall size."}, {"url": "http://www.gardenguides.com/131272-lifespan-flowering-crabapple-trees.html", "passage_text": "Lifespan. Crabapple trees have a lifespan of 30 to 70 years, depending on individual climate, care and disease conditions. Grafted onto standard apple rootstock they give abundant fruit for 30 years or more."}, {"url": "http://www.gardenguides.com/105492-lifespan-flowering-crabapple-tree.html", "passage_text": "The crabapple tree is considered a long-living deciduous fruit tree. Trees that live past 40 years begin to show a decline in flowering, fruit production and new growth. A few crabapples have been noted to live up to 70 years."}, {"url": "http://www.gardenguides.com/105492-lifespan-flowering-crabapple-tree.html", "passage_text": "Ornamental crabapple trees (Malus) range from 10 to 25 feet in height with a spread from 15 to 25 feet. Spring flowers are abundant and often quite fragrant. Flower colors are pink, purple, red and white. The trees produce small, edible fruits."}, {"url": "http://www.walterreeves.com/qa_display.phtml?qaID=1090", "passage_text": "It's hard to say how long a crabapple will live but I do know that if you keep the roots moist and cool with mulch and also keep leaves on the tree as long as possible each growing season, your tree will have the best chance for a long life."}]