[{"url": "http://www.gameogre.com/reviewdirectory/reviews/Gemstone_IV.php", "passage_text": "Comment: is a multiplayer text-based online role-playing game (often known as a MUD) produced by Simutronics. Players control characters in a High Fantasy game world named Elanthia. The first playable version of the game was known as GemStone II and was launched in April 1988 on GEnie.[1]. Want to know what other gamers are saying about an online game that you are interested in? Good because this is where gamers can give their opinions about different types of games such as Online RPGs, MMORPGs, Online Shooters, and Free Games."}, {"url": "http://www.rerolled.org/showthread.php?2159-GemStone-IV-Old-School-MMO-MUD", "passage_text": "GemStone IV-Old School MMO MUD. So I stumbled across a blog post of a guy who was reminiscing about days he was playing in old MUDs and got my thinking to revisit the world of Elanthia, a la Gemstone by Simutronics. Happy to see the game is still running, and has been updated to now run as GemStone IV. 338. Tuconets. 8. I played Gemstone III back in the day too, I was an Empath. First real online game I ever played and it was awesome! Now, not sure I have the attention span and intelligence to play something without bright colors and flashy goblins swinging clubs at me, but it's certainly a good MUD game."}, {"url": "http://www.play.net/gs4/", "passage_text": "The Merchant Consortium of Greater Elanith invites you to join in celebrating this year's Ebon Gate event in the Feywrot Mire, located within the Miasmic Verge, an area with a long history couched in legend and lore, where there is much to discover and explore. "}, {"url": "http://www.gameogre.com/reviewdirectory/reviews/Gemstone_IV.php", "passage_text": "If you don't want to leave a review, simply click on the link or the screenshot on a game's review page to go to its website. Signing up is free and allows you to review games, post in the forums, and submit games for review. Want to know what other gamers are saying about an online game that you are interested in? Good because this is where gamers can give their opinions about different types of games such as Online RPGs, MMORPGs, Online Shooters, and Free Games."}, {"url": "http://gsguide.wikia.com/wiki/Main_Page", "passage_text": "GSGuide has been thriving on the new wikia setup. Check out some of the new pages like the DMC 2013 Prize List, some new Platinum Profiles or download the latest Platinum Lich Maps ! If you have any questions or suggestions, feel free to poke me in the game, or send me an email at admin@gsguide.net. -Caithris. "}, {"url": "https://en.wikipedia.org/wiki/GemStone_IV", "passage_text": "GemStone IV is a multiplayer text-based online role-playing video game (often known as a MUD) produced by Simutronics. Players control characters in a High Fantasy game world named Elanthia. The first playable version of the game was known as GemStone ][ and was launched in April 1988 on GEnie. It was one of the first MMORPGs and is one of the longest running online games still active. GemStone IV is a text-based game built on Simutronics' proprietary engine, the IFE (Interactive Fiction Engine). This engine is capable of changing nearly any aspect of the game on the fly which allows updates without the necessity for downtime, a problem of many graphical RPGs"}]