[{"url": "http://users.rcn.com/jkimball.ma.ultranet/BiologyPages/L/Lymphatic.html", "passage_text": "Like blood in the veins, contraction of skeletal muscles compresses the collecting vessels and squeezes the fluid — now called lymph — along. Again, like the return of blood in the veins, the lymph can flow only in one direction because of valves in the vessels. 1  the entire left side of the body, 2  the digestive tract and. "}, {"url": "https://en.wikipedia.org/wiki/Lymph", "passage_text": "Lymph is the fluid that circulates throughout the lymphatic system. The lymph is formed when the interstitial fluid (the fluid which lies in the interstices of all body tissues) is collected through lymph capillaries. It is then transported through lymph vessels to lymph nodes before emptying ultimately into the right or the left subclavian vein, where it mixes back with blood. Lymph may pick up bacteria and bring them to lymph nodes where they are destroyed. Metastatic cancer cells can also be transported via lymph. Lymph also transports fats from the digestive system."}, {"url": "http://clt.astate.edu/mgilmore/lymph.htm", "passage_text": "The lymphatic organs are the red bone marrow, the thymus gland, lymph nodes, lymph nodules, and the spleen. Lymph nodes: On its way back to the blood, lymph is filtered through lymph nodes, that are located in clusters along the pathway of the lymphatic vessels. Lymph capillaries merge to form lymphatic vessels, which carry lymph into and out of structures called lymph nodes and finally back to the vascular system. Like blood capillaries, lymphatic capillaries are made of a single layer of squamous epithelial cells."}, {"url": "http://emedicine.medscape.com/article/1899053-overview", "passage_text": "The lymphatic system parallels the cardiovascular system (see the images below). The lymphatic system is unique, in that it is a 1-way system that returns lymph fluid via vessels to the cardiovascular system for eventual elimination of toxic byproducts by end organs, such as the kidney, liver, colon, skin, and lungs. Lymph nodes and vessels, anterior view. After maturation, they enter the blood and go to other lymphatic organs, where they help provide defense. Structurally, the thymus is similar to the spleen and lymph nodes, with numerous lobules and cortical and medullary elements."}, {"url": "http://emedicine.medscape.com/article/1899053-overview", "passage_text": "Lymph contains nutrients, oxygen, and hormones, as well as toxins and cellular waste products generated by the cells. As the interstitial fluid accumulates, it is picked up and removed by lymphatic vessels that pass through lymph nodes, which return the fluid to the venous system. After maturation, they enter the blood and go to other lymphatic organs, where they help provide defense. Structurally, the thymus is similar to the spleen and lymph nodes, with numerous lobules and cortical and medullary elements."}, {"url": "https://en.wikipedia.org/wiki/Lymph", "passage_text": "Since the lymph is derived from the interstitial fluid, its composition continually changes as the blood and the surrounding cells continually exchange substances with the interstitial fluid. Lymph returns proteins and excess interstitial fluid to the bloodstream. Lymph may pick up bacteria and bring them to lymph nodes where they are destroyed. Metastatic cancer cells can also be transported via lymph. Lymph also transports fats from the digestive system."}, {"url": "http://biology.about.com/od/anatomy/ss/lymphatic-vessels.htm", "passage_text": "It is here that lymph re-enters blood circulation. Returning lymph to the blood helps to maintain normal blood volume and pressure. It also prevents edema, the excess accumulation of fluid around tissues. Large lymphatic vessels are composed of three layers. Lymph is first taken up by lymphatic capillaries and flows to lymphatic vessels. Lymphatic vessels direct lymph to lymph nodes and along to lymphatic trunks. Lymphatic trunks drain into one of two lymphatic ducts, which return lymph to the blood via the subclavian veins."}, {"url": "http://www.livescience.com/26983-lymphatic-system.html", "passage_text": "View full size image. The lymphatic system is a network of tissues and organs that help rid the body of toxins, waste and other unwanted materials. The primary function of the lymphatic system is to transport lymph, a fluid containing infection-fighting white blood cells, throughout the body. The lymphatic system primarily consists of lymphatic vessels, which are similar to the circulatory system's veins and capillaries. "}, {"url": "http://biology.about.com/od/anatomy/ss/lymphatic-vessels.htm", "passage_text": "Lymphatic ducts return lymph to the blood circulation by draining lymph into the subclavian veins in the neck. The thoracic duct is responsible for draining lymph from the left side of the body and from all regions below the chest. Lymph is first taken up by lymphatic capillaries and flows to lymphatic vessels. Lymphatic vessels direct lymph to lymph nodes and along to lymphatic trunks. Lymphatic trunks drain into one of two lymphatic ducts, which return lymph to the blood via the subclavian veins."}, {"url": "http://training.seer.cancer.gov/anatomy/lymphatic/components/nodes.html", "passage_text": "Lymph nodes are small bean-shaped structures that are usually less than 2.5 cm in length. They are widely distributed throughout the body along the lymphatic pathways where they filter the lymph before it is returned to the blood. Lymph nodes are not present in the central nervous system. There are three superficial regions on each side of the body where lymph nodes tend to cluster. "}]