[{"url": "http://www.webmd.com/women/guide/5-common-symptoms-of-a-yeast-infection", "passage_text": "Vulvar and vaginal itching is the most common sign of a yeast infection. Often, it is severe and nearly constant. The discomfort and itching can spread from the vaginal opening to the labia and anus. Because yeast infection symptoms can affect the vagina and surrounding tissue (called the vulva), a yeast infection is technically called vulvovaginal candidiasis, or VVC. Vaginal burning, soreness, redness, and inflammation of the vulva and labia are common, and may include swelling"}, {"url": "http://www.mayoclinic.org/diseases-conditions/yeast-infection/basics/causes/CON-20035129", "passage_text": "The fungus candida causes a vaginal yeast infection. Your vagina naturally contains a balanced mix of yeast, including candida, and bacteria. Lactobacillus bacteria produce acid, which prevents yeast overgrowth. That balance can be disrupted and lead to a yeast infection. Too much yeast in your vagina causes vaginal itching, burning and other classic signs and symptoms of a yeast infection. Overgrowth of yeast can result from: 1  Antibiotic use, which decreases lactobacillus bacteria in your vagina and changes the pH of your vagina. 2  Pregnancy. 3  Uncontrolled diabetes. 4  Impaired immune system."}, {"url": "https://www.consumerhealthdigest.com/female-sexual-health/frequently-asked-questions/does-yeast-infection-cause-burning-and-itching-after-sexual-intercourse.html", "passage_text": "When the bacteria becomes overgrown, a yeast infection can occur in the vaginal area, and the most common causes of the infection are usually attributed to antibiotics or wearing tight, form fitting clothing that does not allow for air flow. In some severe cases of a yeast infection, the vulva can become swollen and even painful if the condition is left untreated. Another common and often worrisome symptom for women is that sex can become painful due to the vaginal dryness that the infection can cause."}, {"url": "http://www.webmd.com/women/guide/yeast-infection-or-something-else", "passage_text": "Yeast infection symptoms -- such as vaginal itching, burning, and occasional vaginal discharge -- can also be caused by sexually transmitted diseases and other vaginal infections. "}, {"url": "http://www.yeastinfection.org/how-to-cure-that-constant-itching/", "passage_text": "In many cases, the cause will be found to be a Candida yeast infection. The vaginal area is a key area of a woman’s body to be affected to a yeast infection, and one of the most common symptoms of a vaginal yeast infection is persistent and uncomfortable itching. "}, {"url": "http://www.mayoclinic.org/diseases-conditions/yeast-infection/basics/causes/CON-20035129", "passage_text": "Candida albicans is the most common type of fungus to cause yeast infections. Sometimes, other types of candida fungus are to blame. Common treatments usually cure a Candida albicans infection. Yeast infections caused by other types of candida fungus can be more difficult to treat, and need more aggressive therapies. Too much yeast in your vagina causes vaginal itching, burning and other classic signs and symptoms of a yeast infection. Overgrowth of yeast can result from: 1  Antibiotic use, which decreases lactobacillus bacteria in your vagina and changes the pH of your vagina. 2  Pregnancy. 3  Uncontrolled diabetes. 4  Impaired immune system."}, {"url": "http://www.uptodate.com/contents/vaginal-yeast-infection-beyond-the-basics", "passage_text": "SUMMARY. ● Vaginal yeast infections are a common problem in women. ● Itching is the most common symptom of a vaginal yeast infection. Women may also note pain with urination, soreness or irritation, pain with intercourse, or reddened and swollen vulvar and vaginal tissues. It is often not possible to know if itching is caused by yeast or other causes. (See 'Self-diagnosis' below.). VAGINAL YEAST INFECTION CAUSE. The fungus that causes yeast infections (named Candida) normally lives in the gastrointestinal tract and sometimes the vagina."}, {"url": "http://www.womenshealth.gov/publications/our-publications/fact-sheet/vaginal-yeast-infections.html", "passage_text": "A vaginal yeast infection is an infection of the vagina that causes itching and burning of the vulva, the area around the vagina. Vaginal yeast infections are caused by an overgrowth of the fungus Candida. Vaginal yeast infection. Most women will get a vaginal yeast infection at some point in their life. Symptoms of vaginal yeast infections include burning, itching, and thick, white discharge. Yeast infections are easy to treat, but it is important to see your doctor or nurse if you think you have an infection. Yeast infection symptoms are similar to other vaginal infections and sexually transmitted infections (STIs)"}]