[{"url": "https://www.muscleforlife.com/build-muscle-lose-fat/", "passage_text": "When you want to build muscle while losing fat, you want to train for muscle growth and diet for fat loss. That is, you want to do what works best for muscle growth in the gym and what works best for fat loss in the kitchen. In terms of diet, that simply means a moderately aggressive calorie deficit. Mike, in this article you say some people can cut fat and burn muscle at the same time. But in this article https://www.muscleforlife.com /the-best-way-to-gain-muscle-not-fat/ you say if you have more than 15% BF you should cut first and it’s not really possible to do both. Sorry for the confusion."}, {"url": "http://www.sgfitness.com/site/1388195/", "passage_text": "You are actually gaining weight when you are building muscles because your muscle is heavier than fat and the more muscle mass you gain, the more weight you are putting on. I assume that you want to lose body fat weight while building muscles at the same time. Yes, you are burning plenty of calories (from fat and glycogen or carbs) when you are training intensively. However, there is a paradox. To lose fat, you must eat less calories than you burn for energy. How to lose body weight and get bigger well defined muscles-Be a handsome muscular hunk or beach babe now! Cheat Your Way Thin-Learn how to trick your body to burn fat naturally while you enjoy your favorite food by Women's Fitness Expert Panel and Men's Fitness Training Advisory Team, Joel Marion, NSCA-CPT."}, {"url": "https://www.muscleforlife.com/build-muscle-lose-fat/", "passage_text": "So to lose fat and gain muscle you have to get fat, now what if someone wanted to build muscle and burn fat but they’re already fat that’s my situation I’m 6’2 240lbs. Not get fat, no, but check this out: http://www.muscleforlife.com/build-muscle-lose-fat/. I’m 19 years old, 6’1 and i have 171 lbs. Mike, in this article you say some people can cut fat and burn muscle at the same time. But in this article https://www.muscleforlife.com /the-best-way-to-gain-muscle-not-fat/ you say if you have more than 15% BF you should cut first and it’s not really possible to do both. Sorry for the confusion."}, {"url": "http://www.webmd.com/men/features/eat-to-lose-weight", "passage_text": "Bonci says the goal with eating protein is to optimize performance and build lean muscle mass. Ideally, you want to get in a serving of protein both before and after a workout, she says. When you eat your protein, don't take it solo. You've got to have some carbohydrates, Livingstone says. "}, {"url": "http://www.fitday.com/fitness-articles/fitness/body-building/how-to-gain-muscle-lose-weight-naturally.html", "passage_text": "Eating small portions more frequently is also required to gain muscle and lose weight. This keeps the body full and reduces dips in blood sugar. It also keeps the body burning fat and keeps it out of starvation mode. The goals should be one small meal, of mostly protein and some good carbs, every 2 to 3 hours. How to Gain Muscle / Lose Weight Naturally. Many people strive to gain muscle and lose weight naturally. This process does not need to be as difficult as it seems. With proper diet, changes in training, and increased metabolism, anyone can build muscle mass and reduce body fat fast. Changes in Diet."}, {"url": "http://www.wikihow.com/Lose-Weight-and-Gain-Muscle", "passage_text": "1. Make cardio part of your routine. Cardiovascular exercise is integral to losing weight as it helps you burn fat and increase your heart rate, thereby strengthening it. A strong, healthy heart effectively pumps oxygen throughout the body, and to your muscles, aiding in strengthening and toning. Tips. 1  Keep your exercises and your meals fresh. 2  Rest is as important as exercise. 3  Work out with a friend-especially when training with weights. 4  It's always recommended to speak with a physician before drastically altering your diet or doing any strenuous new activities. 5  Don't rest too long between sets."}, {"url": "http://www.wikihow.com/Lose-Weight-and-Gain-Muscle", "passage_text": "Three Methods: Diet Cardiovascular Exercise Weight Training. In order to lose weight and build muscle you have to focus on three key elements: diet, cardiovascular exercise, and strength training. It will require hard work and determination, but the results will be worth it! Here are some tips on how you can start getting the body you want. Tips. 1  Keep your exercises and your meals fresh. 2  Rest is as important as exercise. 3  Work out with a friend-especially when training with weights. 4  It's always recommended to speak with a physician before drastically altering your diet or doing any strenuous new activities. 5  Don't rest too long between sets."}, {"url": "http://www.fitday.com/fitness-articles/fitness/body-building/how-to-gain-muscle-lose-weight-naturally.html", "passage_text": "Cardio. Cardio routine should be specialized to gain muscle and lose weight. Weight baring exercises, such as walking, running and hiking, will work the muscles in the appropriate way. Also, interval training and circuit training will increase calorie burn, burn body fat and build muscle mass. How to Gain Muscle / Lose Weight Naturally. Many people strive to gain muscle and lose weight naturally. This process does not need to be as difficult as it seems. With proper diet, changes in training, and increased metabolism, anyone can build muscle mass and reduce body fat fast. Changes in Diet."}, {"url": "http://www.gymjp.com/", "passage_text": "With a little intelligent bodybuilding training, you CAN build muscle mass and gain weight fast. Whether you choose to follow the weight gain plan of someone who has successfully gone before you (check the top program reviews) or design a program yourself, this site CAN help you achieve your muscle building goals. This site is a FREE guide to gaining weight and building muscle for... 1  The Hardgainers. 2  The Too Skinny Ectomorphs. 3  The Genetically Unblessed Majority. 4  Those Desperate to Gain Muscle."}]