[{"url": "http://www.cdc.gov/nchs/fastats/leading-causes-of-death.htm", "passage_text": "Number of deaths for leading causes of death. 1  Heart disease: 611,105. 2  Cancer: 584,881. 3  Chronic lower respiratory diseases: 149,205. 4  Accidents (unintentional injuries): 130,557. 5  Stroke (cerebrovascular diseases): 128,978."}, {"url": "http://www.suicide.org/college-student-suicide.html", "passage_text": "College Student Suicide Suicide is the second leading cause of death for college students. And the number one cause of suicide for college student suicides (and all suicides) is untreated depression."}, {"url": "http://www.nationalbreastcancer.org/breast-cancer-facts", "passage_text": "1 Breast cancer is the second leading cause of death among women. 2  Each year it is estimated that over 220,000 women in the United States will be diagnosed with breast cancer and more than 40,000 will die."}, {"url": "http://www.medicalnewstoday.com/articles/282929.php", "passage_text": "Heart disease is the leading cause of death for both men and women in the US and also the leading cause of death worldwide. More than half of the deaths that occur as a result of heart disease are in men. Heart disease is the leading cause of death in the US with around 611,105 deaths each year."}, {"url": "http://www.cancer.org/cancer/breastcancer/detailedguide/breast-cancer-key-statistics", "passage_text": "Breast cancer is the second leading cause of cancer death in women, exceeded only by lung cancer. The chance that breast cancer will be responsible for a woman's death is about 1 in 36 (about 3%). Death rates from breast cancer have been declining since about 1989, with larger decreases in women younger than 50."}, {"url": "http://jasonfoundation.com/prp/facts/youth-suicide-statistics/", "passage_text": "1 Suicide is the SECOND leading cause of death for college-age youth and ages 12-18. ( 2 2013 CDC WISQARS). 3  More teenagers and young adults die from suicide than from cancer, heart disease, AIDS, birth defects, stroke, pneumonia, influenza, and chronic lung disease, COMBINED."}, {"url": "http://www.save.org/index.cfm?fuseaction=home.viewPage&page_id=705D5DF4-055B-F1EC-3F66462866FCB4E6", "passage_text": "In 2013, there were 41,149 deaths by suicide in the United States. Suicide is the 10th leading cause of death; homicide ranks 16th. It is the second leading cause of death for 15 - 24 year olds. Click on the chart to the right which shows the Ten Leading Causes of Death in the U.S. in 2013."}, {"url": "http://www.who.int/mediacentre/factsheets/fs310/en/", "passage_text": "The 10 leading causes of death in the world, 2000 and 2012. Ischaemic heart disease, stroke, lower respiratory infections and chronic obstructive lung disease have remained the top major killers during the past decade."}]