[{"url": "http://ddcatalog.homestead.com/RibbonAwareness.html", "passage_text": "Awareness Ribbon's are a great way to show support and bring public attention to a specific Cause. Each Color Ribbon has a meaning which is connected to it. Most colors have several meanings although some are more commonly known than others. Teal Ribbon-This color is a symbol for ovarian, cervical, and uterine cancers as well as substance abuse, sexual assault, PTSD, Myasthenia Gravis and polycystic ovarian syndrome, syringomylia, Tourette Syndrome, usher syndrome, spina bifida (can be trimmed in blue)."}, {"url": "http://www.trinitylondon.com/awareness-ribbon-meanings.asp", "passage_text": "Meaning: The light blue awareness ribbon is a symbol of childhood cancer (alternative color: pink), prostate cancer, Trisomy 18, and scleroderma. Meaning: The teal awareness ribbon is a symbol for ovarian, cervical, and uterine cancers as well as sexual assault, polycystic ovarian syndrome, and tsunami victims. Meaning: The gray awareness ribbon is a symbol of diabetes, asthma, and brain cancer. Meaning: The silver awareness is a symbol for children with disabilities, Parkinson's disease, and mental illnesses such as severe depression, bipolar disorder, schizophrenia, and anxiety disorders."}, {"url": "http://awarenessribbongifts.com/awareness-ribbon-colors/", "passage_text": "Awareness Ribbon Colors and Their Meanings. The meaning of Awareness Ribbons are based on their color or color combination. Many illnesses and causes use the awareness ribbon as their symbols of support or awareness, so there is often more than one cause for each color ribbon. "}, {"url": "http://ddcatalog.homestead.com/RibbonAwareness.html", "passage_text": "Gray Ribbon-This color is a symbol of diabetes, brain cancer and 'Borderline Personality Disorder (BPD)'. Green Ribbon-This color is commonly associated with tissue/organ donation, liver cancer, gall bladder/bile duct cancer. It is also associated with chronic Lyme disease, childhood depression, depression, cerebral palsy, missing children, glaucoma, environmental concerns, and worker and driving safety. Teal Ribbon-This color is a symbol for ovarian, cervical, and uterine cancers as well as substance abuse, sexual assault, PTSD, Myasthenia Gravis and polycystic ovarian syndrome, syringomylia, Tourette Syndrome, usher syndrome, spina bifida (can be trimmed in blue)."}, {"url": "http://www.choosehope.com/category/by-cancer-color-cancer-type", "passage_text": "1 The sheet you are about to download ( Cancer Awareness Ribbon Colors Cancer Color Wheel Calendar of Cancer Awareness Months ) is the copyrighted material of Choose Hope, Inc.  2 Choose Hope and the Choose Hope logo are registered trademarks of Choose Hope, Inc. 3  This is a license. 4  It is nonexclusive and revocable. We have them in 30 acknowledged cancer awareness colors. Choose your Cancer/Color below and check out the wide variety of cancer awareness merchandise for each category."}, {"url": "http://ddcatalog.homestead.com/RibbonAwareness.html", "passage_text": "Violet Ribbon-The violet ribbon color represents Hodgkin's Lymphoma and Testicular Cancer. White Ribbon-This color is a symbol of innocence, victims of terrorism, peace, right to life, diabetes, alzheimers, and retinal blastoma. Teal Ribbon-This color is a symbol for ovarian, cervical, and uterine cancers as well as substance abuse, sexual assault, PTSD, Myasthenia Gravis and polycystic ovarian syndrome, syringomylia, Tourette Syndrome, usher syndrome, spina bifida (can be trimmed in blue)."}, {"url": "http://www.choosehope.com/category/colon-cancer-dark-blue", "passage_text": "A Dark Blue Ribbon brings awareness to Colon Cancer. Support friends, family and Colon Cancer awareness with Dark Blue Ribbons, Jewelry, T-shirts, Magnets, Caps and much more. Find great items for benefits, fundraisers, or giveaways. We offer Group and Pricing on many of our popular products. Don't forget that March is Colon Cancer Awareness Month!"}, {"url": "http://www.trinitylondon.com/awareness-ribbon-meanings.asp", "passage_text": "Meaning: We've all seen the yellow awareness ribbon used as a symbol to show support for our troops, but it is also a symbol for MIA/POW, suicide prevention, adoptive parents, amber alerts, bladder cancer, spina bifida, endometriosis, and a general symbol for hope. Meaning: The gray awareness ribbon is a symbol of diabetes, asthma, and brain cancer. Meaning: The silver awareness is a symbol for children with disabilities, Parkinson's disease, and mental illnesses such as severe depression, bipolar disorder, schizophrenia, and anxiety disorders."}, {"url": "http://www.trinitylondon.com/awareness-ribbon-meanings.asp", "passage_text": "Meaning: The black awareness ribbon is a symbol of mourning, melanoma, and gang prevention. Meaning: The brown awareness ribbon is an anti-tobacco symbol as well as a symbol of colon cancer (alternative ribbon color: blue), and colorectal cancer (alternative ribbon color: blue). Meaning: The gray awareness ribbon is a symbol of diabetes, asthma, and brain cancer. Meaning: The silver awareness is a symbol for children with disabilities, Parkinson's disease, and mental illnesses such as severe depression, bipolar disorder, schizophrenia, and anxiety disorders."}]