[{"url": "http://earthlife.net/prokaryotes/disease.html", "passage_text": "Bacteria cause disease. Most of these bacteria, like those listed below make their presence felt immediately and may or may not result in death. Some people though, can be infected with a bacterium that normally causes a disease and not show any harmful effects at all, people like this are called carriers. The pathogenicity of invasive bacteria, or their ability to cause disease is generally the result of toxins. Substances produced by the bacterial cell, sometimes simply as a by-produce of its normal metabolism, which interact negatively with our body, by interfering with the normal functioning."}, {"url": "http://www.livestrong.com/article/73209-list-common-pathogenic-bacteria-affect/", "passage_text": "Staphylococcus. The group of bacteria known as staphylococcus, particularly Staphylococcus aureus, are one of the most common causes of human disease. Most staphylococci colonize the skin and mucous membranes of people without disease. When bacteria is on the human body in the absence of disease, it is called a colonizer. However, people can get infected from pathogenic bacteria from food, water, abrasions and other wounds and even from colonizing bacteria if it gets into a normally sterile part of the body."}, {"url": "http://www.livestrong.com/article/73209-list-common-pathogenic-bacteria-affect/", "passage_text": "Like staphylococci, there are many species of streptococci found normally in the human body. Certain strains of streptococci cause some of the most serious diseases in humans. Streptococcus pyogenes (strep group A) is the main cause of bacterial pharyngitis (strep throat) in people. Untreated strep throat can lead to serious sequelae like rheumatic fever (heart valves) and glomerulonephritis (kidneys). When bacteria is on the human body in the absence of disease, it is called a colonizer. However, people can get infected from pathogenic bacteria from food, water, abrasions and other wounds and even from colonizing bacteria if it gets into a normally sterile part of the body."}, {"url": "http://www.cdc.gov/HAI/organisms/organisms.html", "passage_text": "Methicillin-resistant Staphylococcus aureus (MRSA) is a type of staph bacteria that is resistant to certain antibiotics called beta-lactams. These antibiotics include methicillin and other more common antibiotics such as oxacillin, penicillin, and amoxicillin. In the community, most MRSA infections are skin infections. While there are many types or “species” of Acinetobacter and all can cause human disease, Acinetobacter baumannii [asz−in−ee−ée–toe−back ter–bō–maa–nee] ie accounts for about80 % of reported. Infections acinetobacter infections rarely occur outside of healthcare. settings"}, {"url": "http://www.cdc.gov/HAI/organisms/organisms.html", "passage_text": "Increasingly, Klebsiella bacteria have developed antimicrobial resistance, most recently to the class of antibiotics known as carbapenems. Klebsiella bacteria are normally found in the human intestines (where they do not cause disease). They are also found in human stool (feces). In healthcare settings, Klebsiella infections commonly occur among sick patients who are receiving treatment for other conditions. While there are many types or “species” of Acinetobacter and all can cause human disease, Acinetobacter baumannii [asz−in−ee−ée–toe−back ter–bō–maa–nee] ie accounts for about80 % of reported. Infections acinetobacter infections rarely occur outside of healthcare. settings"}, {"url": "http://www.humanillnesses.com/original/At-Ca/Bacterial-Infections.html", "passage_text": "Bacterial infections are illnesses that occur when harmful forms of bacteria multiply inside the body. They range from mild to severe. Although they include such deadly diseases as plague, tuberculosis, and cholera, these and many other bacterial infections can be prevented by good sanitation or cured by antibiotics. In the human body, bacteria help keep the digestive tract working properly. Like viruses, however, bacteria can cause hundreds of illnesses. Some bacterial infections are common in childhood, such as strep throat and ear infections. Others cause major diseases, such as tuberculosis, plague, syphilis, and cholera."}, {"url": "http://www.livestrong.com/article/112166-list-bacterial-diseases/", "passage_text": "Bacteria live on your skin, in your intestine and in many other body locations. The overwhelming majority of bacteria do not cause disease. However, disease-causing species cause a range of human bacterial illnesses that range from mild to potentially life-threatening. The most severe type of bacterial skin infection is necrotizing fasciitis, commonly known as flesh-eating bacteria disease. With this life-threatening infection, the skin and deep underlying tissues are not eaten by the bacteria."}, {"url": "http://www.healthgrades.com/conditions/bacterial-diseases", "passage_text": "Harmful bacteria may also emit toxins that damage the body. Common pathogenic bacteria and the types of bacterial diseases they cause include: Escherichia coli and Salmonella cause food poisoning. Helicobacter pylori cause gastritis and ulcers. Neisseria gonorrhoeae causes the sexually transmitted disease gonorrhea. Neisseria meningitidis causes meningitis. "}]