[{"url": "http://cellar.com/spirit_type/11/armagnac", "passage_text": "Sort by: Name Price. Armagnac is the idiosyncratic style of Brandy made in the Gascony region in South West France. Although made from the same grape varieties as its better know and nearby relative Cognac, Armagnac is a distinctly different spirit. "}, {"url": "http://www.charlesnealselections.com/armagnac/", "passage_text": "Gers, Landes, & Lot-et-Garonne. Armagnac is a grape brandy from the Gascony region of southwestern France. Its closest relative is Cognac, another grape brandy from an appellation located about 100 miles north of Armagnac. Armagnac is made from distilled wine, and grapes are the first factor that gives it an original personality. Even though there are nine permitted varietals in Armagnac, four grapes are commonly used: 1  Folle Blanche. 2  Ugni Blanc. 3  Colombard."}, {"url": "https://en.wikipedia.org/wiki/Armagnac_%28brandy%29", "passage_text": "Armagnac is the oldest brandy distilled in France, and in the past was consumed for its therapeutic benefits. In the 14th century, Prior Vital Du Four, a Cardinal, claimed it had 40 virtues: It makes disappear redness and burning of the eyes, and stops them from tearing; it cures hepatitis, sober consumption adhering. It is distilled from wine usually made from a blend of grapes including Baco 22A, Colombard, Folle blanche and Ugni blanc, traditionally using column stills rather than the pot stills used in the production of Cognac."}, {"url": "http://www.wine-searcher.com/regions-armagnac", "passage_text": "Armagnac Brandy. Armagnac is a highly aromatic brandy from the Gascony region of far south-western France. Armagnac was France's first brandy and is said to date back more than 700 years, to the early 15th Century. If accurate, this makes Armagnac the oldest distilled spirit produced anywhere in Europe. Despite its long history, Armagnac is often confused with (and compared with) its more famous cousin Cognac."}, {"url": "http://www.bbr.com/Categories/Spirits/Armagnac/c/armagnac", "passage_text": "Armagnac. Learn more about Armagnac. Armagnac is a distinctive style of French brandy (grape distillate) produced in the region of the same name in the heart of Gascogny. The officially demarcated area for the production of Armagnac encompasses three districts which lie in the departements départements Of, Gers landes And-lot-Et. garonne "}, {"url": "http://loujanbasarmagnac.com/guide.html", "passage_text": "Armagnac is France’s oldest and finest brandy. A distilled grape brandy, it is a favorite of connoisseurs the world over due to its intense aromas, rich complex flavors and tremendous length. All Armagnac is produced in the Gascony region France, an area that is known for superb classic French gastronomy. "}, {"url": "http://www.wine-searcher.com/regions-bas+armagnac", "passage_text": "Bas Armagnac Brandy. The Armagnac provincial coat of arms. Bas Armagnac lies on the western side of the Armagnac region of France and is famed for producing some of the best examples of this distinctively styled brandy. (Copyright material, Wine-Searcher.)"}, {"url": "http://www.ebay.com/gds/What-is-Armagnac-is-it-different-to-Cognac-/10000000002380739/g.html", "passage_text": "Armagnac, the region of France, has given its name to its distinctive kind of brandy or eau de vie, made of the same grapes as Cognac and undergoing the same aging in oak barrels, but with column still distillation. Armagnac production is overseen by a Bureau National Interprofessionel de l'Armagnac (BNIA). "}, {"url": "http://www.differencebetween.info/difference-between-cognac-and-armagnac", "passage_text": "Armagnac is a type of brandy that is produced in the in the Armagnac region in Gascony, southwest France. Cognac and Armagnac often confuse people that are not alcohol enthusiasts. They are often confused to the same thing as they are both brandy. True they are similar in nature and both are different types of brandy. "}, {"url": "https://en.wikipedia.org/wiki/Bas-Armagnac", "passage_text": "A 1972 bottle of Bas-Armagnac brandy. Bas-Armagnac is one of the three plantation areas in the Armagnac area where grapes for the distillation of the Armagnac eau-de-vie can be cultivated. It extends over the Landes and Gers departments and represents 57% of the vineyards. "}]