[{"url": "https://www.sharecare.com/health/vitamins-supplements/how-water-soluble-vitamins-absorbed", "passage_text": "A Dr. Dariush Mozaffarian, MD, Internal Medicine, answered. Water-soluble vitamins are packed into the watery portions of the foods you eat. They are absorbed directly into the bloodstream as food is broken down during digestion or as a supplement dissolves. Because much of your body consists of water, many of the water-soluble vitamins circulate easily in your body. (One exception is vitamin B6, which is mostly stored in muscle tissue.) Your kidneys continuously regulate levels of water-soluble vitamins, shunting excesses out of the body in your urine."}, {"url": "http://www.livestrong.com/article/519221-which-nutrients-are-absorbed-directly-into-the-bloodstream/", "passage_text": "Most B Vitamins. B vitamins are a group of water-soluble vitamins that includes thiamin, riboflavin, niacin, pantothenic acid, folate, vitamin B-6, vitamin B-12 and biotin. These vitamins help your body transform the food you eat into energy. Vitamin C in red peppers is absorbed into your bloodstream in the small intestines. Photo Credit Design Pics/Design Pics/Getty Images. Most of the nutrients in the food you eat -- such as protein, fats, carbohydrates and fat-soluble vitamins -- need to undergo some amount of digestion before they can be absorbed."}, {"url": "https://www.sharecare.com/health/vitamins-supplements/how-water-soluble-vitamins-absorbed", "passage_text": "Water-soluble vitamins are found in many foods we eat, such as cereal grains, meat, poultry, eggs, fish, milk, legumes, citrus fruits and fresh vegetables. The B vitamins and vitamin C are absorbed along with water in the small intestine and then circulate through the blood. Because much of your body consists of water, many of the water-soluble vitamins circulate easily in your body. (One exception is vitamin B6, which is mostly stored in muscle tissue.) Your kidneys continuously regulate levels of water-soluble vitamins, shunting excesses out of the body in your urine."}, {"url": "http://www.livestrong.com/article/519221-which-nutrients-are-absorbed-directly-into-the-bloodstream/", "passage_text": "For the most part, the B vitamins are absorbed directly into the bloodstream in your stomach or small intestines. The exception is vitamin B-12, which must be bound to something called intrinsic factor for absorption. Vitamin C in red peppers is absorbed into your bloodstream in the small intestines. Photo Credit Design Pics/Design Pics/Getty Images. Most of the nutrients in the food you eat -- such as protein, fats, carbohydrates and fat-soluble vitamins -- need to undergo some amount of digestion before they can be absorbed."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=10736", "passage_text": "Doctor's Answer: Vitamins are classified as either fat soluble (vitamins A, D, E and K) or water soluble (vitamins B and C). This difference between the two groups is very important. It determines how each vitamin acts within the body. The fat soluble vitamins are soluble in lipids (fats). These vitamins are usually absorbed in fat globules (called chylomicrons) that travel through the lymphatic system of the small intestines and into the general blood circulation within the body. 1 The difference (if any) between vitamins that are water soluble and those that are not -- There is a big difference between the water soluble vitamins and the fat soluble vitamins and this is absolutely a critical distinction.  2 Specifically Vitamin E -- Vitamin E is a fat soluble vitamin."}, {"url": "http://www.ifafitness.com/book/vitamins.htm", "passage_text": "Vitamins require no digestion and are absorbed directly into the blood stream. The thirteen vitamins identified are divided into two groups, fat-soluble and water-soluble. The fat-soluble vitamins, which include A, D, E, and K are stored in the liver and in body fat. "}, {"url": "http://health.howstuffworks.com/human-body/systems/digestive/digestive-system5.htm", "passage_text": "1 The water-soluble vitamins (B vitamins and vitamin C) are absorbed easily along with the water in the small intestine, where they then travel through the body via the blood vessels. 2  Fat-soluble vitamins (vitamins A, D, and K) are absorbed just like the fat mentioned above. 1 Once absorbed, however, they are stored for long periods of time in cells called lipocytes. 2  Water-soluble vitamins don't stay in your body for long -- extra amounts of these are usually eliminated in a quick trip to the bathroom."}, {"url": "http://www.livestrong.com/article/519221-which-nutrients-are-absorbed-directly-into-the-bloodstream/", "passage_text": "Vitamin C. Vitamin C is also a water-soluble vitamin that is absorbed directly into your bloodstream in your small intestines after it has been freed from food. Vitamin C is essential for good health and plays a number of important roles in your body. Vitamin C in red peppers is absorbed into your bloodstream in the small intestines. Photo Credit Design Pics/Design Pics/Getty Images. Most of the nutrients in the food you eat -- such as protein, fats, carbohydrates and fat-soluble vitamins -- need to undergo some amount of digestion before they can be absorbed."}]