[{"url": "https://answers.yahoo.com/question/index?qid=20071016074346AA7h0LN", "passage_text": "Rating Newest Oldest. Best Answer: Stress Test is used to evaluate heart function, a stress test requires that a patient exercises on a treadmill while his or her heart rate, breathing, blood pressure, electrocardiogram (ECG), and feeling of well being are monitored. "}, {"url": "http://www.heartandstroke.com/site/c.ikIQLcMWJtE/b.3484101/k.35D/Heart_disease__Exercise_electrocardiogram__Stress_test.htm", "passage_text": "Exercise electrocardiogram (Stress test). An exercise electrocardiogram (ECG) records your heart's response to the stress of exercise. An exercise ECG measures your heart's electrical activity, blood pressure and heart rate while you exercise, usually by walking on a treadmill. "}, {"url": "http://www.webmd.com/heart-disease/guide/stress-test", "passage_text": "A. A. A. A stress test can be used to test for heart disease. Stress tests are tests performed by a doctor and/or trained technician to determine the amount of stress that your heart can manage before developing either an abnormal rhythm or evidence of ischemia (not enough blood flow to the heart muscle). The most commonly performed stress test is the exercise stress test. The exercise stress test -- also called a stress test, exercise electrocardiogram, treadmill test, graded exercise test, or stress ECG -- is used to provide information about how the heart responds to exertion."}, {"url": "http://www.mayoclinic.org/tests-procedures/nuclear-stress-test/basics/definition/PRC-20012978", "passage_text": "Definition. A nuclear stress test measures blood flow to your heart at rest and while your heart is working harder as a result of exertion or medication. The test provides images that can show areas of low blood flow through the heart and damaged heart muscle. "}, {"url": "https://en.wikipedia.org/wiki/Cardiac_stress_test", "passage_text": "The cardiac stress test is done with heart stimulation, either by exercise on a treadmill, pedalling a stationary exercise bicycle ergometer, or with intravenous pharmacological stimulation, with the patient connected to an electrocardiogram (ECG). Cardiac stress tests compare the coronary circulation while the patient is at rest with the same patient's circulation during maximum physical exertion, showing any abnormal blood flow to the myocardium (heart muscle tissue)."}, {"url": "http://www.medicalhealthtests.com/askquestion/72/what-does-a-stress-test-consist-of-and-what-are-th.html", "passage_text": "During the test the patient's various symptoms and blood pressure response is repeatedly checked. When using the ECG and the blood pressure monitoring by itself the test is called a cardiac stress test or an exercise stress test. Besides these, the test is also called as an exercise treadmill test or an exercise tolerance test or a stress test or an exercise ECG test. When it is compared to the blood flow that occurs during rest, the stress test reflects the imbalances of the blood flow to the individual's heart in particular the left ventricular muscle tissue. This is the part of the individual's heart that helps perform the largest amount of the work in pumping blood."}, {"url": "http://www.mayoclinic.org/tests-procedures/stress-test/basics/definition/PRC-20019801", "passage_text": "An exercise stress test usually involves walking on a treadmill or riding a stationary bike while your heart rhythm, blood pressure and breathing are monitored. Your doctor may recommend an exercise stress test if he or she suspects you have coronary artery disease or an irregular heart rhythm (arrhythmia). A stress test, also called an exercise stress test, gathers information about how your heart works during physical activity. Because exercise makes your heart pump harder and faster than usual, an exercise stress test can reveal problems within your heart that might not be noticeable otherwise."}, {"url": "https://www.sharecare.com/health/circulatory-system-health/what-heart-stress-test-involve", "passage_text": "For more information visit https://naturalmedicines.therapeuticresearch.com/. The heart rate stress test involves exercising while the heart's activity is monitored by an electrocardiogram (ECG). Small, circular pads called electrodes are painlessly placed on the body. The electrodes monitor the electrical activity of the heart and report this data to a machine through a cord"}]