[{"url": "http://study.com/academy/lesson/polysaccharide-definition-examples-quiz.html", "passage_text": "As mentioned, polysaccharides can be used for energy storage. Typically, storage takes the form of starch in both plants and animals. A starch is a chain of glucose molecules that usually takes a linear form. In plants the common storage starch is amylose; in animals the common storage starch is glycogen."}, {"url": "http://www.enotes.com/homework-help/name-3-polysaccharides-314436", "passage_text": "Polysaccharides form when monosaccharides or disaccharides attach in chains. They are carbohydrate structures and generally heterogeneous. They are common in plants and are used as food and energy storage by most animals. The most prominent example of a polysaccharide is Starch, which is composed of glucose."}, {"url": "http://www.nutrientsreview.com/carbs/polysaccharides.html", "passage_text": "Storage polysaccharides are a storage form of energy, for example cellulose in plants and glycogen in animals and humans. Structural polysaccharides give structure to plants; examples include cellulose in plants and chitin in the shells of crustaceans."}, {"url": "http://www.answers.com/Q/What_are_examples_of_polysaccharide", "passage_text": "A polysaccharide is a type of sugar composed of a long chain of  monosaccharides. Examples are cellulose, starch, glycogen, and  chitin. 1 person found this useful."}, {"url": "https://en.wikipedia.org/wiki/Polysaccharide", "passage_text": "Examples include storage polysaccharides such as starch and glycogen, and structural polysaccharides such as cellulose and chitin. Polysaccharides are often quite heterogeneous, containing slight modifications of the repeating unit."}, {"url": "http://www.biocab.org/Polysaccharides.html", "passage_text": "Polysaccharides are polymers of monosaccharides. Polysaccharides are formed by three or more monosaccharides, for example Amylose (starch), Amylopectin, Glycogen (animal storage polymer), Cellulose, etc. AMYLOSE AND AMYLOPECTIN. Amylose, or starch, is a helical chain of Glucose monomers, which are bonded by glycosidic linkages (Alfa linkages 1 - 4)."}, {"url": "http://www.answers.com/Q/What_is_an_example_of_a_polysaccharide", "passage_text": "1 Storage polysaccharides; for example, starch and glycogen. 2  Structural polysaccharides; for example, cellulose, chitin, and pectin. 3  Acidic polysaccharides that contain carboxyl, phosphate and/or sulfuric ester groups. 4  Bacterial capsular polysaccharides produced by pathogenic bacteria in the form of thick mucus."}, {"url": "http://www.answers.com/Q/What_is_an_example_of_a_polysaccharide", "passage_text": "There are several kinds of polysaccharides: 1  Storage polysaccharides; for example, starch and glycogen. 2  Structural polysaccharides; for example, cellulose, chitin, and pectin. 3  Acidic polysaccharides that contain carboxyl, phosphate and/or sulfuric ester groups."}]