[{"url": "http://work.alberta.ca/documents/WHS-PUB-SH013.pdf", "passage_text": "The permit is handed back to the issuer at the end of the shift or when the work is completed. In a triplicate permit system, the third copy is used by the safety department to audit the. work to see if the requirements of the permit are being met. Example of a safe work permit checklist. A sa."}, {"url": "http://www.hse.gov.uk/humanfactors/topics/ptw.htm", "passage_text": "Instructions or procedures are adequate for most work activities, but some require extra care. A ‘permit to work’ is a more formal system stating exactly what work is to be done and when, and which parts are safe. A responsible person should assess the work and check safety at each stage. The people doing the job sign the permit to show that they understand the risks and precautions necessary."}, {"url": "http://work.alberta.ca/documents/WHS-PUB-SH013.pdf", "passage_text": "A safe work permit is document that identifies the work to be done, the. hazard(s) involved, and the precautions to be taken. It ensures that all. hazards and precautions have been considered before work begins. Safe work permits should always be used when work is performed by. an outside agency or employer."}, {"url": "http://www.brookes.ac.uk/services/hr/health_safety/permit_to_work/procedure.html", "passage_text": "Purpose of permits to work. Permits to work are a formal management system used to control high risk activities. These enable an assessment of risks to be made and to specify control measures which will be put in place in order to minimise the risk."}, {"url": "http://antarisconsulting.com/docs/guides/unit_igc1/Permit%20to%20work%20systems%20indg98.pdf", "passage_text": "2 WHAT ARE PERMITS-TO-WORK? A permit-to-work system is a formal written system used tocontrol certain types of work that are potentially hazardous. A permit-to-work is a document which specifies the work to bedone and the precautions to be taken."}, {"url": "http://www.elcosh.org/document/56/d000483/Safe%2BWork%2BPermits.html?show_text=1", "passage_text": "The company requires evaluation of very hazardous, nonroutine jobs for which there are no Safe Job Procedures or approved Job Safety Plans. Certain jobs always require that a Safe Work Permit be issued by a qualified individual."}, {"url": "http://work.alberta.ca/documents/WHS-PUB-SH013.pdf", "passage_text": "The type of safe work permit required is determined by the nature of the work to be performed and the hazards that must be controlled or eliminated. The range of activities and locations makes it impossible for a single type of permit to be suitable for all situations."}]