[{"url": "http://www.babynamespedia.com/meaning/Savita/m", "passage_text": "[ 3 syll. sa-vi-ta, sav-ita ] The baby boy name Savita is also used as a girl name. Its pronunciation is SaaViy-Taa- †. Savita is largely used in the Indian language and its origin is Sanskrit. The name's meaning is impeller. Savita is not regularly used as a baby name for boys. It is not listed in the top 1000 names. Baby names that sound like Savita include Sabiti, Safwat (Arabic), Shabat, Shabatt, Shabbat, Shabbatt, Speed, Speedee, Speedie, Speedy, Spud (English), Swift, Swifte, Swiftea, Swiftee, Swiftey, Swifti, Swiftie, Swifty, and Swyft."}, {"url": "http://indiachildnames.com/name.aspx?name=Savita", "passage_text": "Name Savita is associated to God/Goddess Surya (Sun). Find qualities of Aquarius (Kumbh) or Find Numerology, Lucky number, lucky days, lucky color, Auspicious stones for Savita or Find Chinese zodiac sign or Birthstone for your birthday or Find compatibility of Kumbh (Aquarius) with other zodiac signs. Similar sounding names: Sevati, Svati, Savit, Sovit, Sevita, Sveta."}, {"url": "http://www.ourbabynamer.com/meaning-of-Savita.html", "passage_text": "Savita in Nautical Flags. Indian names or Hindu names are listed in Our Baby Namer under Indian, Hindi and Sanskrit. Other names which may be used my Muslim Indians would be listed under Arabic or Iranian names. Indian names generally contain a given name followed by some number of secondary names. Secondary names are often patronyms, names derived from the father, grandfather or other paternal ancestor, village names, occupation names, or names of gods. In the U.S. in 2014 less than 5 girls were given the name. Less than 5 boys were given the name. View the Savita Name Popularity Page to see how the popularity trend for Savita has changed since 1880, or to compare the popularity of Savita to other names."}, {"url": "https://en.wikipedia.org/wiki/Savita_Bhabhi", "passage_text": "The character named Savita is depicted as an attractive, promiscuous housewife who is ignored by her husband (Ashok) and engages in sexual adventures. The suffix bhabhi (sister-in-law) is commonly attached to first names of Indian housewives. Savita bhabhi's character shown in first episode. Savita Bhabhi is an Indian pornographic cartoon character and has earned a recognition as India's first porn star."}, {"url": "http://astrobix.com/name/meaning/Savita", "passage_text": "Meaning of Indian name: Savita. Meaning of the name Savita is 'Sun'. Savita is a name of Hindu / Indian origin, and is commonly used for females. The name number for Savita is '9'. Click here to get the numerological analysis for the name 'Savita"}, {"url": "http://www.urbandictionary.com/define.php?term=savita", "passage_text": "savita. savita is someone is hardworking, and precious. she is someone who is not a failure, but a victory to many people. she is someone who you can love in less than a second or milisecond. she is osmeone that you'dbe hapy to live with anytime. she is someone whom is caring, prosperous and beautiful. she is someone with taste of good food and good mind."}, {"url": "http://www.babynamespedia.com/meaning/Savita/f", "passage_text": "[ 3 syll. sa-vi-ta, sav-ita ] The baby girl name Savita is also used as a boy name. It is pronounced SaaViy-Taa- †. Savita is of Sanskrit origin and it is used mainly in Indian. The name Savita means 'impeller'. Savita is not often used as a baby girl name. It is not in the top 1000 names. Baby names that sound like Savita include Sapata, Sevatee, Sevatey, Sevati, Sevatie, Sevatti, Sevaty, Cocheta, Sevate, Sevde (Turkish), Sevtee, Sevtey, Sevti, Sevtie, Sevty, Shafti, and Sveta (Russian). "}, {"url": "http://www.ourbabynamer.com/meaning-of-Savita.html", "passage_text": "Then just follow the diagram below. Just for fun, see the name Savita in Hieroglyphics, learn about ancient Egyptian Hieroglyphics and write a Hieroglyphic message. Learn about nautical flags and see your name or message written in nautical flags, on the Savita in Nautical Flags page. In the U.S. in 2014 less than 5 girls were given the name. Less than 5 boys were given the name. View the Savita Name Popularity Page to see how the popularity trend for Savita has changed since 1880, or to compare the popularity of Savita to other names."}, {"url": "http://indiachildnames.com/name.aspx?name=Savita", "passage_text": "ਸਵਿਤਾ; સવિતા; ஸவிதா; సవితా; സവിതാ; ಸವಿತಾ; স঵িতা. Name Savita generally means Sun, is of Indian origin, Name Savita is a Unisex name, which means both Boy and Girl can have this name. Person with name Savita are mainly Hindu by religion. Find qualities of Aquarius (Kumbh) or Find Numerology, Lucky number, lucky days, lucky color, Auspicious stones for Savita or Find Chinese zodiac sign or Birthstone for your birthday or Find compatibility of Kumbh (Aquarius) with other zodiac signs. Similar sounding names: Sevati, Svati, Savit, Sovit, Sevita, Sveta."}]