[{"url": "http://www.bbc.co.uk/schools/gcsebitesize/science/add_ocr_pre_2011/wave_model/lightandsoundrev1.shtml", "passage_text": "Light travels as transverse waves and can travel through a vacuum. Sound travels as longitudinal waves and needs to travel through a solid, liquid or gas: it cannot travel through a vacuum. Light and sound can be reflected and refracted, just like water waves."}, {"url": "http://www.bbc.co.uk/schools/gcsebitesize/science/ocr_gateway_pre_2011/energy_home/5_light1.shtml", "passage_text": "All types of electromagnetic radiation, including visible light, are transverse waves waves. In transverse waves the vibrations are at right angles to the direction of travel, as seen in the animation below of a wave sent down a piece of string. The hand moves up and down, as does each part of the string. But the wave moves along from left to right"}, {"url": "http://www.factmonster.com/dk/encyclopedia/light.html", "passage_text": "The hotter an object gets, the more photons it gives out. Light travels as a wave. But unlike sound waves or water waves, it does not need any matter or material to carry its energy along. This means that light can travel through a vacuum—a completely airless space. (Sound, on the other hand, must travel through a solid, a liquid, or a gas.) Nothing travels faster than light energy."}, {"url": "https://en.wikipedia.org/wiki/Wave", "passage_text": "An electromagnetic wave consists of two waves that are oscillations of the electric and magnetic fields. An electromagnetic wave travels in a direction that is at right angles to the oscillation direction of both fields. In the 19th century, James Clerk Maxwell showed that, in vacuum, the electric and magnetic fields satisfy the wave equation both with speed equal to that of the speed of light."}, {"url": "http://www.factmonster.com/dk/encyclopedia/light.html", "passage_text": "Light waves travel out from their source in straight lines called rays. Rays do not curve around corners, so when they hit an opaque object (one that does not allow light to pass through it), they are blocked from reaching the other side of that object. We see a dark shadow in the area from which light is blocked. But unlike sound waves or water waves, it does not need any matter or material to carry its energy along. This means that light can travel through a vacuum—a completely airless space. (Sound, on the other hand, must travel through a solid, a liquid, or a gas.) Nothing travels faster than light energy."}, {"url": "http://www.answers.com/Q/What_direction_do_light_waves_travel", "passage_text": "A light wave consists of energy in the form of an electric filed and a magnetic field. The electric and magnetic fields vibrate at right angles (that is, at angles which measure 90 degrees) to the direction in which the light wave is moving. Light has both the electric field and the magnetic field. This is because unlike other types of waves, such as sound waves, water wave … s, etc., light waves do not need a medium to travel through."}, {"url": "https://en.wikipedia.org/wiki/Longitudinal_wave", "passage_text": "Longitudinal wave. From Wikipedia, the free encyclopedia. Longitudinal waves, also known as l-waves, are waves in which the displacement of the medium is in the same direction as, or the opposite direction to, the direction of travel of the wave."}, {"url": "http://www.answers.com/Q/What_direction_do_light_waves_travel", "passage_text": "The electric and magnetic field vibrate perpendicular to the direction in which the light wave propagates (and perpendicular among themselves). Light is thus a transverse wave … . Light waves are a little more complicated than other waves, such as sound waves, water waves, etc. This is because unlike other types of waves, such as sound waves, water wave … s, etc., light waves do not need a medium to travel through. Light waves can travel through a vacuum"}, {"url": "http://www.physicsclassroom.com/class/sound/Lesson-1/Sound-as-a-Longitudinal-Wave", "passage_text": "For a sound wave traveling through air, the vibrations of the particles are best described as longitudinal. Longitudinal waves are waves in which the motion of the individual particles of the medium is in a direction that is parallel to the direction of energy transport."}, {"url": "http://www.bbc.co.uk/schools/gcsebitesize/science/add_ocr_pre_2011/wave_model/lightandsoundrev1.shtml", "passage_text": "Transverse transverse waves: Waves in which the vibrations happen at right-angles to the direction of travel. Light travels as transverse waves. Longitudinal longitudinal waves: Waves in which the vibrations happen in the same direction as the direction of travel. Sound waves are longitudinal waves. Can they travel through a vacuum vacuum: A volume that contains no matter-space is almost a vacuum. Sound travels as longitudinal waves and needs to travel through a solid, liquid or gas: it cannot travel through a vacuum. Light and sound can be reflected and refracted, just like water waves."}]