[{"url": "http://www.medicalook.com/human_anatomy/organs/Parasympathetic_division.html", "passage_text": "http://www.medicalook.com. SEARCH. The craniosacral division and parasympathetic division are one in the same. The term was deemed due to the production of preganglionic neurons origination in the brain as well as in the 2nd through 4th sacral sections of the spinal column. "}, {"url": "http://www.mananatomy.com/basic-anatomy/parasympathetic-nervous-system", "passage_text": "Parasympathetic nervous system is one of the two main divisions of the autonomic nervous system. It is responsible specifically for stimulation of activities that occur when the body is at rest. The main goal of this system is to conserve the resources of the body so that they can last longer. "}, {"url": "http://medical-dictionary.thefreedictionary.com/parasympathetic", "passage_text": "1 parasympathetic craniocaudal division of the autonomic nervous system. 2  parasympathetic craniocaudal division of the autonomic nervous system. 3  parasympathetic craniocaudal division of the autonomic nervous system. 4  Parasympathetic division. 5  Parasympathetic division. 1 parasympathetic cholinergic vasodilator fibers. 2  parasympathetic craniocaudal division of the autonomic nervous system. 3  parasympathetic craniocaudal division of the autonomic nervous system. 4  parasympathetic craniocaudal division of the autonomic nervous system."}, {"url": "http://www.thefreedictionary.com/parasympathetic+nervous+system", "passage_text": "1 Parasympathetic nervous systems. 2  Parasympathetic nervous systems. 3  Parasympathetic nervous systems. 4  parasympathetic nose. 5  parasympathetic nose. 6  parasympathetic nose. 7  parasympathetic outflow. 8  parasympathetic outflow. 9  parasympathetic outflow. 10  parasympathetic part of autonomic division of nervous system. Noun. 1. parasympathetic nervous system-originates in the brain stem and lower part of the spinal cord; opposes physiological effects of the sympathetic nervous system: stimulates digestive secretions; slows the heart; constricts the pupils; dilates blood vessels. parasympathetic."}, {"url": "http://medical-dictionary.thefreedictionary.com/Parasympathetic+division", "passage_text": "Parasympathetic nervous system. The division of the autonomic (involuntary or unwilled) nervous system that slows heart rate, increases digestive and gland activity, and relaxes the sphincter muscles that close off body organs. parasympathetic nervous system. n. The part of the autonomic nervous system originating in the brainstem and the lower part of the spinal cord that, in general, inhibits or opposes the physiological effects of the sympathetic nervous system, as in tending to stimulate digestive secretions or slow the heart."}, {"url": "http://www.thefreedictionary.com/Parasympathetic+division", "passage_text": "Noun. 1. parasympathetic nervous system-originates in the brain stem and lower part of the spinal cord; opposes physiological effects of the sympathetic nervous system: stimulates digestive secretions; slows the heart; constricts the pupils; dilates blood vessels. parasympathetic. "}, {"url": "http://medicalterms.info/anatomy/Parasympathetic-Division/", "passage_text": "Human anatomy Autonomic Nervous System Parasympathetic Division. The parasympathetic division is one of the divisions of the autonomic nervous system that is concerned with digestion, urination and defecation. "}]