[{"url": "https://answers.yahoo.com/question/index?qid=20090811225733AA0zZ4k", "passage_text": "My fila mastiff will be 5 months on the 31st of this month, and weighs around 60-65 lbs and the vet said it is a good weight. She told me that she would like to see them gain a pound a day if that helps you any. courtney · 6 years ago. Thumbs up. "}, {"url": "https://answers.yahoo.com/question/index?qid=20071203090039AAw4g4M", "passage_text": "Next. my male english mastiff is 5.8 months old, and we're guessing he's 80-85 lbs. (he hasn't been to the vet's in a couple weeks, but he's steadily gained 5lbs/wk since he was 20 lbs.) i'm not trying to judge whether mine is overweight or underweight or wrong or anything, because... show more my male english mastiff is 5.8 months old, and we're guessing he's 80-85 lbs."}, {"url": "http://www.dogbreedinfo.com/mastiff.htm", "passage_text": "That is the only way your relationship with your dog can be a complete success. Height, Weight Height: Males from 30 inches (76 cm) Females from 27 inches (69 cm) Weight: Males about 160 pounds (72 kg) Females about 150 pounds (68 kg) One of the heaviest breeds, a male Mastiff can exceed 200 pounds. Health Problems Beware of hip dysplasia. The Old English Mastiff is a massive dog. The Mastiff has a large, heavy, square head with a well-marked stop between the eyes. The muzzle should be half the length of the skull."}, {"url": "https://en.wikipedia.org/wiki/English_Mastiff", "passage_text": "The greatest weight ever recorded for a dog, 343 pounds (156 kg), was that of an English Mastiff from England named Aicama Zorba of La Susa, although claims of larger dogs exist. The lineage of modern dogs can be traced back to the early 19th century, the modern type was stabilised in the 1880s and refined since. Following a period of sharp decline, the Mastiff has increased its worldwide popularity."}, {"url": "http://www.dogguide.net/blog/2007/11/ask-the-dog-guide-mastiff-weight-and-height/", "passage_text": "Males at minimum usually 30 inches and females 27 inches. At a year, giant breeds are still putting on muscle mass and have not reached their full weight. They may even appear to be a bit thin as they have yet to fill out. The average full grown weight for a female would be around 150 lbs and a male is about 180 lbs. Your dog should weigh a bit less than that as he or she has yet to reach his adult weight. Like I said, the genetic variation of the line will have a lot more to say about these numbers than I do"}, {"url": "http://kiokeemastiffscom.blogspot.com/2008/03/how-much-should-my-mastiff-puppydog.html", "passage_text": "We are Breeders of the true Mastiff, sometimes referred to as the English Mastiff or the Old English Mastiff. Please do not confuse us with the American Mastiff, which is a cross between the Mastiff and the Anatolian Shepherd. The AKC recognizes Mastiffs and does not recognize the American Mastiff. "}, {"url": "https://en.wikipedia.org/wiki/English_Mastiff", "passage_text": "Due to the breed's large size, puppies may potentially be smothered or crushed by the mother during nursing. A whelping box, along with careful monitoring can prevent such accidents. The average lifespan of the Mastiff is about 7 years although it's not uncommon for some to live to 10–11 years. The lineage of modern dogs can be traced back to the early 19th century, the modern type was stabilised in the 1880s and refined since. Following a period of sharp decline, the Mastiff has increased its worldwide popularity."}, {"url": "http://www.mastiffweb.com/size.htm", "passage_text": "BIG-BIGGER-BIGGEST! Welcome to a page dedicated to one subject only: SIZE! The English Mastiff is the heaviest dog breed in the world. Mighty Murphy from England weighed 159 kilos! Normal weight of a fully grown male Mastiff is between 80-100 kilos (about 180-220 lbs.), but this varies quite a lot within the breed. Compared to other breeds that often are considered big, the Mastiff is incomparable. "}]