[{"url": "http://www.ew.com/article/2013/06/08/sam-cat-premiere-icarly-victorious-spin-off", "passage_text": "The worlds of popular Nickelodeon shows iCarly and Victorious first met in summer 2011 on a special three-part episode called “iParty with Victorious.” But in that crossover, there were two key characters who never got to meet – iCarly ’s Sam Puckett and Victorious ’ Cat Valentine."}, {"url": "http://samandcat.wikia.com/wiki/Ariana_Grande", "passage_text": "2010–present: Victorious, and other projects. Grande played the character Cat Valentine on the Nickelodeon television show Victorious, which premiered in March 2010. Grande was also featured in Dream Magazine as the cover girl for the August 2011 issue. In 2011, Ariana voiced an animated fairy, Princess Diaspro, on the Nickelodeon series, Winx Club."}, {"url": "http://samandcat.wikia.com/wiki/Ariana_Grande", "passage_text": "Ariana Grande-Butera is an American singer, actress and dancer. In Sam & Cat, she reprises her role as Cat Valentine, a role she originally played in Victorious."}, {"url": "http://www.usmagazine.com/celebrity-news/news/ariana-grande-i-was-so-unhappy-filming-nickelodeons-victorious-2013256", "passage_text": "After starring in a series of stage musicals, from 2010 to 2013, the 19-year-old Boca Raton, Fla., native played Cat Valentine on the tween show Victorious alongside Victoria Justice, Avan Jogia and Leon Thomas III."}, {"url": "http://victorious.wikia.com/wiki/Ariana_Grande", "passage_text": "Ariana Grande-Butera (born June 26th, 1993) is an American actress and singer who is known for playing Cat Valentine on the Nickelodeon TV series, Victorious and Sam & Cat. She has appeared in some iCarly segments."}, {"url": "http://www.tv.com/people/ariana-grande/", "passage_text": "She also starred as Cat Valentine on the TV show Victorious. Her first released single on…more} DUPipeline_QISnippet_MetaDescription_Snippet_v1: {},{36|36|21|Ariana Grande biography, pictures, credits,quotes and more... She was born and raised in Boca Raton, Florida."}, {"url": "http://www.imdb.com/name/nm3812858/", "passage_text": "She was born in Boca Raton, Florida, to Joan Grande and Edward Butera, both of whom are of Italian descent. After growing up in Florida, She moved to Los Angeles when she received the role of Cat Valentine in Nickelodeon's Victorious (2010), along with Victoria Justice and Elizabeth Gillies. Ariana's older ..."}]