[{"url": "http://www.pharmtech.com/residual-solvent-analysis-pharmaceuticals-0", "passage_text": "1 2 3. Next. Residual solvents in pharmaceuticals, commonly known as organic volatile impurities (OVIs), are chemicals that are either used or produced during the manufacture of active pharmaceutical ingredients (APIs), excipients and drug products. "}, {"url": "http://www.fda.gov/downloads/AboutFDA/CentersOffices/CenterforDrugEvaluationandResearch/ucm119607.pdf", "passage_text": "• All Class 2 solvents “likely to be present”, • Whether Class 3 solvents are “likely to be present” and the identity of all Class 3. solvents present at greater than 0.5%, and. • All other solvents “likely to be present”, as applicable. manufacturer’s statement is acceptable. “Likely to be present” refers to the solvents used. or produced in the final manufacturing step and to solvents that are used or produced in. earlier manufacturing steps and not removed consistently by a validated process."}, {"url": "http://www.answers.com/Q/What_are_residual_solvents", "passage_text": "where the solute disolves. + 1 other found this useful. Roxelle Mercado. Edit. Share to: 1  Chemical Solvent: Definition and Facts A solvent is a liquid used to break down, or dissolve, a substance which is retained in a liquid without a chemical change; the resultant liquid is a solution. 2  Essential Tips for Generating Residual Income If you are like everyone else, you probably dream of being able to sit back and make money .."}, {"url": "http://sclabs.com/services/services-residual-solvent-testing.html", "passage_text": "Residual Solvent Testing. SC Labs has developed a Residual Solvent Test (RST) to identify the presence of harmful solvents, impurities, and/or other added odorants and chemicals present in super-concentrated forms of Cannabis. "}, {"url": "http://www.authorstream.com/Presentation/bharatrbh-436885-residual-solvent/", "passage_text": "RS Limits for DP/DS/Excipients : 15 Class – 1 Solvent – General Requirements Class – 1 Solvent (To be Avoided): All Class – 1 Solvents likely to be present in drug product components should be identifeid and quantified. 7 Residual Solvent Classes Other Residual Solvents The residual solvents listed in Table 4 may also be of interest manufactures of drug substances, excipients, or drug products, However, no adequate toxicology data on which to base a PDE was found."}, {"url": "https://www.polymersolutions.com/applications/residual-solvent-analysis/", "passage_text": "About Residual Solvent Analysis. Residual solvent analysis is performed through Headspace Gas Chromatography/Mass Spectrometry (Headspace GC/MS) analysis. This technique quantifies volatile solvents in a polymer matrix. A sample is placed in a closed sampling vessel and heated using a known temperature profile. "}, {"url": "http://www.fda.gov/downloads/AboutFDA/CentersOffices/CenterforDrugEvaluationandResearch/ucm119607.pdf", "passage_text": "It is preferred that the excipient manufacturer’s statement regarding residual solvents is. included in the excipient manufacturer’s COA, although a separate excipient. manufacturer’s statement is acceptable. “Likely to be present” refers to the solvents used. or produced in the final manufacturing step and to solvents that are used or produced in. earlier manufacturing steps and not removed consistently by a validated process."}, {"url": "http://www.quantexlabs.com/services/residual-solvents", "passage_text": "Residual Solvents. Organic Residual Impurities, which are commonly referred to as residual solvents, are trace level chemical residues in drug substances that are used in, or are the by-products of manufacturing. These may also form later on during the packaging process or in storage."}, {"url": "http://www.authorstream.com/Presentation/bharatrbh-436885-residual-solvent/", "passage_text": "Slide 1: 2 What is Residual Solvent “Residual solvents in pharmaceutical are defined as organic volatile chemicals that are used or produced in the manufacture of drug substances or Excipients, or in the preparation of drug products”. 7 Residual Solvent Classes Other Residual Solvents The residual solvents listed in Table 4 may also be of interest manufactures of drug substances, excipients, or drug products, However, no adequate toxicology data on which to base a PDE was found."}, {"url": "http://www.authorstream.com/Presentation/bharatrbh-436885-residual-solvent/", "passage_text": "What is Residual Solvent : 3 Why Residual Solvent needed To make Safety of the patient; recommends use of less toxic solvents. Testing is to be performed only for solvents “likely to be present”. Used or produced in the final manufacturing step. 7 Residual Solvent Classes Other Residual Solvents The residual solvents listed in Table 4 may also be of interest manufactures of drug substances, excipients, or drug products, However, no adequate toxicology data on which to base a PDE was found."}]