[{"url": "http://www.childsworld.ca.gov/PG1302.htm", "passage_text": "Adoptive parents may qualify for a federal tax credit for certain expenses paid to adopt an eligible child with special needs and a state tax credit for adopting a child who was in the custody of a California public child welfare agency. The fee for the cost of the investigation of an Independent Adoption petition for a family with a completed, approved pre-placement evaluation is $1,550. The pre-placement evaluation must meet the requirements of Family Code Section 8811.5."}, {"url": "http://money.usnews.com/money/personal-finance/articles/2014/10/02/the-cost-of-adoption", "passage_text": "If you have a lot of discussions with the birth father, that's going to be more expensive.. Charges for adoption consultants like Witt also vary. Her pricing is tiered, but if one were to use her throughout the entire adoption process, the cost could be almost $3,000. But like a real estate or travel agent, an adoption consultant may save you money in the long run. It costs a lot to raise a child: According to the U.S. Department of Agriculture, an average middle-aged couple whose baby was born last year can expect to spend over $245,000 to raise the child, not including paying for college. If you're planning to adopt, you may end up spending an extra $40,000. The Child Welfare Information Gateway, a U.S. government-funded adoption information service, estimates that the average U.S. adoption costs $8,000 to $40,000. If you're adopting a child from another country, the range is $15,000 to $30,000"}, {"url": "https://en.wikipedia.org/wiki/Adoption_in_California", "passage_text": "To perform the home study, provide counseling and take the birth parent's relinquishment, the fee can range from $5,000 to $35,000. Like independent adoption, the birth mother may have expenses for the adoptive parents to provide. "}, {"url": "https://www.ohiobar.org/ForPublic/Resources/LawYouCanUse/Pages/LawYouCanUse-165.aspx", "passage_text": "If the birth parents are working through an adoption agency, they should be aware that the agency's attorney represents the agency and not the birth parent. It is wise for birth parents to have a separate and independent attorney who can represent them and review the papers before the signing. If it's an agency adoption, the birth parent may sign the papers at the agency office. It may be more prudent, however, to go through the court where a judge or magistrate is available to answer any legal questions the birth parent may have before the papers are signed."}, {"url": "http://family.findlaw.com/adoption/consent-to-adoption-what-biological-parents-need-to-know.html", "passage_text": "This article focuses on laws and procedures governing biological parents' consent to adoption. See Birth Parent Rights, Who May Place a Child for Adoption? and Adoption Laws for more details. Consent to Adoption: The Process. In most states, consent for an adoption occurs with a notarized, written statement or an appearance before a judge. Some states also require that birth parents receive counseling, be provided with an explanation of their rights, or be given access to an attorney."}, {"url": "http://www.childsworld.ca.gov/PG1302.htm", "passage_text": "In an agency adoption, a public or licensed private adoption agency or a CDSS adoptions regional or field office places the child for adoption. The birth parent's parental rights are terminated either by court order or by the filing of a relinquishment. The fee for the cost of the investigation of an Independent Adoption petition for a family with a completed, approved pre-placement evaluation is $1,550. The pre-placement evaluation must meet the requirements of Family Code Section 8811.5."}, {"url": "http://www.hearttoheartadopt.com/adoptive-parents/common-questions/how-much-does-it-cost-to-adopt/", "passage_text": "This is the fee that you pay to Heart to Heart Adoptions. These fees cover the birth mother expenses and the agency expenses. A percentage of fees could be at risk if placement doesn’t occur, which means that if you adopt through another agency, your fees are refunded. These fees may range from $24,000 to $36,000. "}, {"url": "http://www.americanadoptions.com/pregnant/cost-of-adoption-for-pregnant-women", "passage_text": "A List of Free Adoption Services. If you are facing an unplanned pregnancy and considering adoption, you may be wondering how much it costs to place your child for adoption. At American Adoptions, 100 percent of a birth mother’s expenses are paid for by the adoptive family, including: "}, {"url": "https://www.childwelfare.gov/pubpdfs/s_costs.pdf", "passage_text": "$5,000 to $40,000 Private adoption costs vary widely according the type of agency used and, sometimes, the individual adoption circumstances. It is important for prospective parents to fully understand what is included in private agency, adoption facilitator, and attorney fees. In the case of public agency adoptions, home study fees may be minimal ($500) or completely waived, although parents may incur fees for medical or psychological evaluations that could be required. With other types of adoption, a private agency adoption facilitator may charge $1,000 to $3,000 for the home study."}]