[{"url": "https://en.wikipedia.org/wiki/Resting_energy_expenditure", "passage_text": "Resting energy expenditure, abbreviated as REE, is the amount of energy, usually expressed in kcal (food calories), required for a 24-hour period by the body during resting conditions. It is closely related to, but not identical to, basal metabolic rate."}, {"url": "http://www.ehow.com/video_7630089_calculate-calories-per-day.html", "passage_text": "When you calculate your resting energy expenditure, you find out how many calories your body uses per day in its metabolic functions. Learn how to determine this number in this free video on nutritional calculations. Part of the Video Series: Nutritional Calculations. 1  How to Count Calories Eaten."}, {"url": "http://www.topendsports.com/testing/tests/bmr-equation.htm", "passage_text": "By multiplying BMR by an activity factor, you can determine how many calories are required each day to maintain body weight based on your daily activity level. 1  aim: to use formula to estimate metabolic rate at rest, and from that a daily energy expenditure."}, {"url": "http://www.ehow.com/video_7630089_calculate-calories-per-day.html", "passage_text": "5. Cancel. When you calculate your resting energy expenditure, you find out how many calories your body uses per day in its metabolic functions. Learn how to determine this number in this free video on nutritional calculations. Part of the Video Series: Nutritional Calculations. 1  How to Count Calories Eaten."}, {"url": "http://www.topendsports.com/testing/tests/bmr-equation.htm", "passage_text": "1 aim: to use formula to estimate metabolic rate at rest, and from that a daily energy expenditure. 2  equipment required: calculator, and scales for weight and tape measure for height. 3  procedure: See the procedures for height and weight. 4  Use the formula below to determine BMR, and"}, {"url": "http://www.health-calc.com/diet/energy-expenditure-advanced", "passage_text": "It calculates your resting metabolic rate and your total energy consumption in calories or kilojoules. This can be a helpful tool for weight loss as it allows you to estimate the amount of calories that represents your energy balance. If you eat less than this, you will lose weight."}, {"url": "http://triathlete-europe.competitor.com/2011/05/18/how-to-calculate-your-energy-expenditure", "passage_text": "Total energy expenditure = energy expenditure value of activity x duration of activity in minutes x your body weight in pounds. For example, suppose you weigh 150 lbs and you run at a pace of 7 minutes per mile for 30 minutes. The energy expenditure value of running at 7 minutes per mile is 0.10 cal/lb/min."}]