[{"url": "http://www.newsworks.org/index.php/local/philadelphia/55896-pennsylvania-to-replace-graterford-prison-with-new-400-million-facility", "passage_text": "Construction has begun on a new state correctional facility in Pennsylvania that will replace the aging Graterford prison in Skippack Township."}, {"url": "http://prisonhandbook.com/9675/sci-graterford-pennsylvania/", "passage_text": "State Correctional Institution – Graterford is a state correctional facility in the Pennsylvania state prison system. This guide gives you about anything related to State Correctional Institution – Graterford such as the following: How to locate an inmate here."}, {"url": "http://articles.mcall.com/keyword/graterford-state-prison", "passage_text": "Montgomery County Charged -- Cameron Ritchie, 24, inmate at Graterford State Prison; Feb. 17 with aggravated assault, simple assault and harassment stemming from alleged Nov. 11 fight with corrections officer; Ritchie hit officer Rasheen Irby in face, cutting Irby's lip, state police at Skippack said."}, {"url": "https://www.inmateaid.com/prisons/state-correctional-institution-sci-graterford-pa", "passage_text": "State Correctional Institution-SCI Graterford PA is a state prison. This facility is operated by the state of Pennsylvania and is used to house and rehabilitate criminals."}, {"url": "https://www.inmateaid.com/prisons/state-correctional-institution-sci-graterford-pa", "passage_text": "State Prison. State Correctional Institution-SCI Graterford PA is classed as a medium security facility. It has a strengthened perimeter fence and electronic detection systems to ensure inmates stay within the facility."}, {"url": "http://prisonhandbook.com/9675/sci-graterford-pennsylvania/", "passage_text": "Visiting an inmate here. The address and phone number at State Correctional Institution – Graterford Mailing or sending money to an inmate at State Correctional Institution – Graterford."}, {"url": "http://www.portal.state.pa.us/portal/server.pt/community/hide_graterford/11366", "passage_text": "Log in to your personalized Portal account. If you are a citizen and have an existing account, enter your Username and Password. If you are a Commonwealth Employee, or other individual with specialized credentials, please insert the appropriate domain name in front of your username (example: domainname\\username)."}, {"url": "http://resistance.wikia.com/wiki/Graterford_Prison", "passage_text": "Joseph Capelli fighting off Grims in the arena at Graterford Prison. Graterford Prison is a prison located in Skippack, Pennsylvania, a suburb of Philadelphia."}, {"url": "http://articles.philly.com/2013-06-02/news/39692959_1_michael-wenerowicz-new-prison-state-prison", "passage_text": "Eighty-four years after Pennsylvania built the State Correctional Institution at Graterford to house thousands of the offenders crowding Philadelphia's old Eastern State Penitentiary, contractors are tearing into the red slopes of the former Mennonite farms in Skippack Township to build a $400 million replacement."}]