[{"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=16640", "passage_text": "Sclera: The tough white outer coat over the eyeball that covers approximately the posterior five-sixths of its surface. The sclera is continuous in the front of the eye with the cornea and in the back of the eye with the external sheath of the optic nerve. The word sclera is from the Greek skleros = hard. The plural is sclerae."}, {"url": "http://www.healthline.com/human-body-maps/sclera", "passage_text": "Sclera. The sclera is the part of the eye commonly known as the “white.” It forms the supporting wall of the eyeball, and is continuous with the clear cornea. The sclera is covered by the conjunctiva, a clear mucus membrane that helps lubricate the eye. It is thickest in the area surrounding the optic nerve. The sclera is made up of three divisions: the episclera, loose connective tissue, immediately beneath the conjunctiva; sclera proper, the dense white tissue that gives the area its color; and the lamina fusca, the innermost zone made up of elastic fibers."}, {"url": "https://en.wikipedia.org/wiki/Red_eye_(medicine)", "passage_text": "A red eye is a non-specific term to describe an eye that appears red due to illness or injury. The term usually refers to injection and prominence of the superficial blood vessels of the conjunctiva, or sclera, which may be caused by disorders of these or adjacent structures. "}, {"url": "https://en.wikipedia.org/wiki/Sclera", "passage_text": "The sclera (from the Greek skleros, meaning hard), also known as the white of the eye, is the opaque, fibrous, protective, outer layer of the eye containing collagen and elastic fiber. The thickness of the sclera varies from 1mm at the posterior pole to 0.3 mm just behind the rectus muscle insertions. The sclera's blood vessels are mainly on the surface. Along with the vessels of the conjunctiva (which is a thin layer covering the sclera), those in the episclera render the inflamed eye bright red."}, {"url": "http://anthonyt.wikispaces.com/describe+the+anatomy+and+function+of+the+human+eye,+including+the+-cornea.sclera.choroid.retina.iris.lens.aqueous+and+vitreous+humor.ciliary+body.optic+nerve*", "passage_text": "Sclera-is the white part of the eye, it contains elastic fibres. It is located on the outer layer of the eye it protects the eye from getting damaged by dust. Choroid-is made of many blood vessels which is known as the blood vessel of the eye, it is located between the retina and the sclera. It provides oxygen to the outer layers of the retina. Retina-is important to the eye as it is a sensitive tissue which is located in the inner surface of the eye. "}, {"url": "https://en.wikipedia.org/wiki/Sclera", "passage_text": "In humans the whole sclera is white, contrasting with the coloured iris, but in other mammals the visible part of the sclera matches the colour of the iris, so the white part does not normally show. In the development of the embryo, the sclera is derived from the neural crest. In children, it is thinner and shows some of the underlying pigment, appearing slightly blue. The thickness of the sclera varies from 1mm at the posterior pole to 0.3 mm just behind the rectus muscle insertions. The sclera's blood vessels are mainly on the surface. Along with the vessels of the conjunctiva (which is a thin layer covering the sclera), those in the episclera render the inflamed eye bright red."}, {"url": "http://medical-dictionary.thefreedictionary.com/sclera", "passage_text": "sclera. the tough, white outer coat of the eyeball, covering approximately the posterior five-sixths of its surface, continuous anteriorly with the cornea and posteriorly with the external sheath of the optic nerve. adj., adj scle´ral. The sclera and other eye structures. blue sclera abnormal blueness of the sclera; it is a prominent feature of osteogenesis imperfecta and is also seen in certain other conditions. (See Atlas 1, Part B.). , pl."}]