[{"url": "http://www.webmd.com/women/picture-of-the-thyroid", "passage_text": "All rights reserved. The thyroid is a butterfly-shaped gland that sits low on the front of the neck. Your thyroid lies below your Adam’s apple, along the front of the windpipe. The thyroid has two side lobes, connected by a bridge (isthmus) in the middle. "}, {"url": "http://endocrinediseases.org/thyroid/thyroid_background.shtml", "passage_text": "The thyroid gland is one of the body's most important endocrine organs. It is located in the neck just below the thyroid cartilage (Adam's apple) and cricoid cartilage. Although its size can vary, based on each individual's size and iodine intake, the thyroid generally weighs approximately 15-20 grams (1/2 - 3/4 oz). The veins draining the thyroid gland tend to run along with the arteries. An additional major vein draining directly into the internal jugular vein is the middle thyroid vein. (Figure 1) The lymphatic drainage from the thyroid gland is to lymph nodes located near the trachea and esophagus."}, {"url": "http://endocrinediseases.org/parathyroid/parathyroid_where.shtml", "passage_text": "The parathyroid glands are usually located in the neck behind the thyroid gland, although there are exceptions. While the baby is developing inside the mother's womb, the four parathyroids travel from the head area down to the lower neck, and usually end up near the thyroid gland. "}, {"url": "http://www.yourhormones.info/glands/thyroid_gland.aspx", "passage_text": "The thyroid gland is located at the front of the neck just below the Adam's apple (larynx). It is butterfly-shaped and consists of two lobes located either side of the windpipe (trachea). A normal thyroid gland is not usually outwardly visible or able to be felt if finger pressure is applied to the neck. "}, {"url": "http://www.thyroidawareness.com/neck-check", "passage_text": "The thyroid gland is a small, butterfly-shaped gland located in the lower front of the neck, above the collarbones, and below the voice box (larynx). Your thyroid gland makes hormones that help control the function of many of your body’s organs, including your heart, brain, liver, kidneys, and skin. "}, {"url": "http://www.medicinenet.com/image-collection/thyroid_picture/picture.htm", "passage_text": "The thyroid is a butterfly-shaped gland located in the front of the neck just below the Adams apple. The gland wraps around the windpipe (trachea) and has a shape that is similar to a butterfly formed by two wings (lobes) and attached by a middle part (isthmus). "}, {"url": "http://www.webmd.com/women/tc/thyroid-hormones-topic-overview", "passage_text": "The pituitary gland and the thyroid gland work together. The pituitary gland (located near the base of the brain) makes, stores, and releases thyroid-stimulating hormone (TSH). When TSH is secreted by the pituitary gland, it causes the thyroid gland to release more T3 and T4. Thyroid hormones are made by the thyroid gland. The thyroid gland makes and releases two thyroid hormones: thyroxine (T4) and triiodothyronine (T3). Thyroid hormones affect every cell and all the organs of the body. Too much thyroid hormone speeds things up and too little thyroid hormone slows things down."}, {"url": "http://www.innerbody.com/image/endo04.html", "passage_text": "The thyroid gland is a butterfly-shaped organ made of mostly glandular tissue and located in the base of the neck.... Click to read more below. The thyroid gland and parathyroid glands are a group of endocrine glands located in the base of the neck. These glands play a vital role in maintaining the body’s homeostasis by producing hormones that regulate the body’s metabolism and free calcium levels. "}, {"url": "http://www.endocrineweb.com/conditions/thyroid/how-your-thyroid-works", "passage_text": "Your thyroid gland is a small gland, normally weighing less than one ounce, located in the front of the neck. It is made up of two halves, called lobes, that lie along the windpipe (trachea) and are joined together by a narrow band of thyroid tissue, known as the isthmus. The function of the thyroid gland is to take iodine, found in many foods, and convert it into thyroid hormones: thyroxine (T4) and triiodothyronine (T3). Thyroid cells are the only cells in the body which can absorb iodine. These cells combine iodine and the amino acid tyrosine to make T3 and T4."}, {"url": "https://en.wikipedia.org/wiki/Thyroid", "passage_text": "The thyroid gland, or simply the thyroid /ˈθaɪrɔɪd/ , is one of the largest endocrine glands in the body, and consists of two connected lobes. It is found in the neck, below the laryngeal prominence (Adam's apple). The thyroid gland is found in all vertebrates. In fish, it is usually located below the gills and is not always divided into distinct lobes. However, in some teleosts, patches of thyroid tissue are found elsewhere in the body, associated with the kidneys, spleen, heart, or eyes."}]