[{"url": "https://support.office.com/en-us/article/Create-and-edit-a-distribution-list-B49118B6-C881-44E4-AEB2-DFFF0C9B0333", "passage_text": "The distribution list is saved in your Contacts folder under the name that you give it. Create a distribution list by copying names from an e-mail message. In the message that you want to copy the names from, select the names in the To or Cc box. Right-click your selection, and then click Copy on the shortcut menu. Add an address that is not in a contacts folder or an address book. On the Distribution List tab, click Add New. Type the information for the e-mail address, and then click OK. Delete a name. Click the name, and then click Remove."}, {"url": "http://agsci.psu.edu/it/how-to/create-and-use-distribution-list-in-outlook", "passage_text": "1 Open Outlook. 2  Create a new message. 3  Click To. 4  From the Name list, select the distribution list you want. 5  Or if needed, click To and then choose Contacts under the Address Book drop-down list. 6  From the Name list, select the distribution list you want. 7  Ex: Educators List. 8  Click To. 9  Click OK. 1 From the Name list, select the distribution list you want. 2  Or if needed, click To and then choose Contacts under the Address Book drop-down list. 3  From the Name list, select the distribution list you want. 4  Ex: Educators List. 5  Click To. 6  Click OK. 7  Enter a subject and enter your message text."}, {"url": "https://support.microsoft.com/en-us/kb/284292", "passage_text": "1 On the Tools menu, click Address Book to open your Address Book. 2  In the Show Names from the list, click Contacts. 3  On the File menu, click New Entry, or click the New Entry button on the toolbar. 4  Under Select the entry type, click New Distribution List. 5  Under Put this Entry, click In The Contacts. Outlook 2003 and Outlook 2007. 1  In the Name box, type the name of your new distribution list. 2  Click the Select Members button to add members from any of your Address Book entries or Contacts. 3  Click Save And Close to save the new distribution list"}, {"url": "https://support.microsoft.com/en-us/kb/284292", "passage_text": "Outlook 2003 and Outlook 2007. 1  On the Tools menu, click Address Book to open your Address Book. 2  In the Show Names from the list, click Contacts. 3  On the File menu, click New Entry, or click the New Entry button on the toolbar. 4  Under Select the entry type, click New Distribution List. Outlook 2003 and Outlook 2007. 1  In the Name box, type the name of your new distribution list. 2  Click the Select Members button to add members from any of your Address Book entries or Contacts. 3  Click Save And Close to save the new distribution l"}, {"url": "https://support.office.com/en-us/article/Create-and-edit-a-distribution-list-B49118B6-C881-44E4-AEB2-DFFF0C9B0333", "passage_text": "Do one of the following: Create a distribution list by using names in the Address Book. On the File menu, point to New, and then click Distribution List. In the Name box, type the name of your distribution list. (For example, Political Friends.). On the Distribution List tab, click Select Members. Add an address that is not in a contacts folder or an address book. On the Distribution List tab, click Add New. Type the information for the e-mail address, and then click OK. Delete a name. Click the name, and then click Remove."}, {"url": "http://agsci.psu.edu/it/how-to/create-and-use-distribution-list-in-outlook", "passage_text": "1 Create a new message. 2  Click To. 3  From the Name list, select the distribution list you want. 4  Or if needed, click To and then choose Contacts under the Address Book drop-down list. 5  From the Name list, select the distribution list you want. 6  Ex: Educators List. 7  Click To. 1 From the Name list, select the distribution list you want. 2  Or if needed, click To and then choose Contacts under the Address Book drop-down list. 3  From the Name list, select the distribution list you want. 4  Ex: Educators List. 5  Click To. 6  Click OK. 7  Enter a subject and enter your message text."}, {"url": "https://support.microsoft.com/en-us/kb/284292", "passage_text": "1 Click the list below Address Book, and then select Contacts. 2  On the File menu, click New Entry. 3  Under Select the entry type, click New Contact Group. 4  Under Put this Entry, click In The Contacts. 5  This selection determines where your new distribution list is saved. 6  This is the default location. 7  Click OK. Outlook 2003 and Outlook 2007. 1  In the Name box, type the name of your new distribution list. 2  Click the Select Members button to add members from any of your Address Book entries or Contacts. 3  Click Save And Close to save the new distribution list"}, {"url": "https://support.office.com/en-us/article/Create-and-edit-a-distribution-list-B49118B6-C881-44E4-AEB2-DFFF0C9B0333", "passage_text": "When you receive a distribution list from someone else, you can save it to your Contacts. Open the message that contains the distribution list. In the header of the message, right-click the distribution list, and then click Add to Outlook Contacts on the shortcut menu. Add an address that is not in a contacts folder or an address book. On the Distribution List tab, click Add New. Type the information for the e-mail address, and then click OK. Delete a name. Click the name, and then click Remove."}]