[{"url": "http://www.antimicrobe.org/b82.asp", "passage_text": "Endocarditis caused by Bacillus organisms is a well-recognized complication of intravenous drug abuse (34, 39, 40). Rarely, it has been isolated from patients with underlying valvular disease (35). Since B. cereus is the most common isolate, empirical use of penicillin is usually not effective."}, {"url": "http://www.antimicrobe.org/b82.asp", "passage_text": "Serious infections caused by Bacillus species include ocular infections, endocarditis, bacteremia and septicemia, pneumonia, meningitis, musculoskeletal infections (40), and infections associated with injuries from motor vehicle accidents associated with road trauma (44) and gunshot injuries (23)."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/23592829", "passage_text": "Foodborne disease outbreaks caused by Bacillus cereus, Clostridium perfringens, and Staphylococcus aureus--United States, 1998-2008. Bennett SD(1), Walsh KA, Gould LH. Author information: (1)Centers for Disease Control and Prevention, 1600 Clifton Rd, MS C-09, Atlanta, GA 30333, USA. iyk3@cdc.gov. From 1998 to 2008, 1229 foodborne outbreaks caused by Bacillus cereus, Clostridium perfringens, and Staphylococcus aureus were reported in the United States; 39% were reported with a confirmed etiology."}, {"url": "http://www.healthknowledge.org.uk/public-health-textbook/disease-causation-diagnostic/2b-epidemiology-diseases-phs/infectious-diseases/bacillus-cereus", "passage_text": "Bacillus cereus food poisoning is a gastrointestinal intoxication caused by toxins produced by the Bacillus cereus bacterium. Two enterotoxins have been identified 1. Common clinical features. Characterised by sudden onset of nausea, abdominal pain and vomiting or by colic and diarrhoea 2."}, {"url": "http://food.unl.edu/bacillus-cereus", "passage_text": "The Disease: The Disease: Bacillus cereus can cause two distinct types of illnesses: 1) a diarrheal illness with an incubation time of approximately 10 to 16 hours, and 2) an emetic (vomiting) illness with an incubation time of one to six hours."}, {"url": "http://antimicrobe.org/new/b82.asp", "passage_text": "The clinical spectrum of infections caused by Bacillus spp. include self-limited food poisoning, localized infections related to trauma (e.g. ocular infections), deep seated soft tissue infections, and systemic infections (e.g. meningitis, endocarditis, osteomyelitis, and bacteremia)."}, {"url": "http://www.antimicrobe.org/b82.asp", "passage_text": "The clinical spectrum of infections caused by Bacillus spp. include self limited food poisoning, localized infections related to trauma (e.g. ocular infections), deep seated soft tissue infections, and systemic infections (e.g. meningitis, endocarditis, osteomyelitis, and bacteremia)."}]