[{"url": "http://pets.thenest.com/dogs-need-parvo-vaccine-5461.html", "passage_text": "Timing. Different veterinarians have different protocols about the timing of vaccinations. Most veterinarians recommend that a puppy receive his first parvovirus vaccination when he is 8 weeks old. The second vaccination is given in three to four weeks, about age 11 to 12 weeks. A third vaccination is given in three to four more weeks, about age 14 to 15 weeks. "}, {"url": "https://answers.yahoo.com/question/index?qid=20080625200630AAU4SVP", "passage_text": "puppies get combination vaccines. 6 to 7 weeks of age: Give first combination vaccine. (Distemper, Hepatitis, Parvovirus, Parainfluenza, Coronavirus) 9 weeks of age: Give second combination vaccine. 12 weeks of age: Give the third combination injection and possibly a LYME Vaccine inoculation. "}, {"url": "http://pets.webmd.com/dogs/parvo-parvovirus-dogs?page=2", "passage_text": "In this article. Generally, the first vaccine is given at 6-8 weeks of age and a booster is given at four-week intervals until the puppy is 16-20 weeks of age, and then again at one year of age. A puppy’s vaccination program is not complete before four months of age. Older dogs who have not received full puppy vaccination series may be susceptible to parvovirus and should also receive at least one immunization."}, {"url": "http://www.peteducation.com/article.cfm?c=2+2115&aid=960", "passage_text": "Consult with your veterinarian to determine which vaccinations your puppy should receive, and how often. Drs. Foster and Smith prefer to vaccinate puppies with a combination vaccine at six weeks of age initially, with boosters given every three weeks until the puppy is about sixteen weeks of age. We feel that this schedule will help protect the widest range of dogs"}, {"url": "http://www.answers.com/Q/When_should_puppies_get_there_parvo_shots", "passage_text": "A puppy has to be 6 weeks old to get a parvo shot and is needed every 3-4 weeks until they are 16 weeks old. After the puppy series they should be given once a year when they … turn a year old. + 24 others found this useful. DustinandKatie Ayers. Usually this means getting BOOSTER shots at a later date. For example, a puppy could get a combination vaccine at 12 weeks of age, and boosters at 16 and 20 weeks of age. The puppy might also get it's first rabies vaccine at 12 weeks of age, and a booster shot a whole year later."}, {"url": "http://www.answers.com/Q/Age_for_parvo_shots_for_dogs", "passage_text": "Yes, it is possible. The vaccine against parvovirus is not considered completely effective in a puppy until two weeks after the last shot is given; since the last shot is gene … rally given when the puppy is 16 weeks old, the puppy can usually be considered protected by the time it is 18 weeks old. I believe the current UC Davis recommendation is that puppy gets its first Parvo vaccine at 8 weeks of age, with a booster at 12 weeks and 16 weeks, however your Vet will know the protocol most effectively used in your area."}, {"url": "http://www.vetstreet.com/care/parvovirus-vaccine-for-dogs", "passage_text": "1 Initial adult vaccination (and for puppies older than 16 weeks of age) ideally consists of two vaccines three to four weeks apart, though one vaccine is considered protective. 2  All dogs should receive one vaccine one year after the final puppy vaccination. 1 Puppies should receive a minimum of three vaccinations between 6 and 16 weeks old, no more frequently than every three to four weeks with the final dose at 14 to 16 weeks."}, {"url": "http://animalfoundation.com/8-tips-to-prevent-parvovirus-in-your-dog-or-puppy/", "passage_text": "Keep your dog healthy and parvo-free with these 8 tips: Make sure your dog is properly vaccinated. Puppies should receive their first vaccines at 6-8 weeks of age; boosters should be administered at three-week intervals until the puppy is 16 weeks of age, and then again at one year of age. Previously vaccinated adult dogs need boosters every year."}, {"url": "http://www.vetinfo.com/parvo-shots-for-puppies.html", "passage_text": "Parvo in Puppies. Parvo is a highly contagious and dangerous disease. It can be easily transmitted from dog to dog through feces and vomit. The parvovirus is very resistant and can survive in the environment for up to 6 weeks. Humans can also become carriers for the parvovirus, although they are not affected by it"}]