[{"url": "http://home.costhelper.com/ductless-air-conditioner.html", "passage_text": "1 Expect to pay $2,000-$5,000 to install a complete ductless mini-split air conditioning system in a 800-1,000-square foot home, or $5,000-$7,000 for a 2,000-square-foot house."}, {"url": "http://www.howmuchisit.org/ductless-air-conditioning-cost/", "passage_text": "1 According to the U.S. Department of Energy, the cost of a mini split air conditioning system is about $1,500 to $2,000 per ton (12,000 Btu per hour) of cooling capacity. 2  On average, installation of a ductless air conditioning system is going to cost anywhere from $2,000 to $5,000."}, {"url": "http://www.howmuchisit.org/ductless-air-conditioning-cost/", "passage_text": "1 According to the RemodelingExpense.com cost estimator, a basic ductless air conditioning system installation costs $1,400 to $1,600, with a total average cost per unit of $1,500. 2  A better type of work can cost $1,800.00 to $1,975.00, or a total average cost per unit of $1,887.50."}, {"url": "http://www.howmuchisit.org/ductless-air-conditioning-cost/", "passage_text": "1 On average, installation of a ductless air conditioning system is going to cost anywhere from $2,000 to $5,000. 2  Most units alone are going to be within the $900 to $1,700 range. 3  The costs depend on the tons, the size of the home, and the brand."}, {"url": "http://www.improvenet.com/r/costs-and-prices/mini-split-air-conditioning", "passage_text": "The Costs. The average cost to install a mini-split air conditioning system is $1,900. The maximum average cost to install a mini-split air conditioning system is $2,100. The minimum average reported cost for mini split-air conditioner installation is $1,700. Continue reading to see more cost considerations for all mini-split air conditioning systems."}, {"url": "http://www.homewyse.com/costs/cost_of_mini_split_air_conditioning_systems.html", "passage_text": "1 The homewyse Mini Split Air Conditioning System cost estimates do not include costs for new installation of, repairs to, or relocation of existing ducting, electrical connection, fuel supply line and exhaust vent systems. 2  Costs associated with permit acquisition and sign off are not included."}]