[{"url": "http://www.innovateus.net/health/what-homologous-recombination", "passage_text": "Image Credit: Main Image: Homologous recombination is a type of genetic recombination in which nucleotide (molecules which are joined make the structural units of RNA and DNA) sequences are exchanged between two similar or identical molecules of DNA."}, {"url": "https://en.wikipedia.org/wiki/Homologous_recombination", "passage_text": "Homologous recombination is a type of genetic recombination in which nucleotide sequences are exchanged between two similar or identical molecules of DNA. It is most widely used by cells to accurately repair harmful breaks that occur on both strands of DNA, known as double-strand breaks."}, {"url": "https://answers.yahoo.com/question/index?qid=20090428172612AA2jQtm", "passage_text": "Best Answer: Homologous recombination, also known as general recombination, is a type of genetic recombination in which genetic material is exchanged between two similar or identical strands of DNA. The process involves several steps of physical breaking and rejoining of DNA."}, {"url": "http://www.answers.com/Q/What_is_Homologous_recombination", "passage_text": "Homologous recombination is the process of genetic exchange that occurs between any two molecules of DNA that share a region (or regions) of homologous DNA sequences. This form of recombination occurs frequently while sister chromatids are paired during reduction division of meiosis."}, {"url": "https://en.wikipedia.org/wiki/Homologous_recombination", "passage_text": "Homologous recombination also produces new combinations of DNA sequences during meiosis, the process by which eukaryotes make gamete cells, like sperm and egg cells in animals."}, {"url": "http://www.nature.com/subjects/homologous-recombination", "passage_text": "Definition. Homologous recombination is the exchange of DNA strands of similar or identical nucleotide sequence. It can be used to direct error-free repair of double-strand DNA breaks and generates sequence variation in gametes during meiosis."}]