[{"url": "http://www.nature.com/scitable/definition/DNA-polymerase-DNAP-1", "passage_text": "DNA polymerase (DNAP) is a type of enzyme that is responsible for forming new copies of DNA, in the form of nucleic acid molecules. Nucleic acids are polymers, which are large molecules made up of smaller, repeating units that are chemically connected to one another."}, {"url": "https://en.wikibooks.org/wiki/Structural_Biochemistry/Enzyme_Regulation/Phosphorylation", "passage_text": "Phosphorylation is an effective way of regulating proteins. About 30% of proteins in eukaryotic cells are phosphorylated. The enzymes that are responsible for these reactions are known as protein kinases. There are about 100 homologous protein kinases in yeast and 500 in human beings."}, {"url": "http://www.fastbleep.com/biology-notes/40/116/1183", "passage_text": "What are coenzymes. Enzymes are protein catalysts that are responsible for lowering the energy barrier of many biological reactions. They function by reducing the activation energy of the reactions that they catalyse which allows the metabolic reaction to occur faster and at physiological temperatures."}, {"url": "http://www.nature.com/scitable/definition/DNA-polymerase-DNAP-1", "passage_text": "DNA polymerase / DNAP. DNA polymerase (DNAP) is a type of enzyme that is responsible for forming new copies of DNA, in the form of nucleic acid molecules. Nucleic acids are polymers, which are large molecules made up of smaller, repeating units that are chemically connected to one another."}, {"url": "http://www.fastbleep.com/biology-notes/40/116/1183", "passage_text": "Alcohol dehydrogenase. Alcohol dehydrogenase (ADH) is an enzyme which uses NAD+ as a coenzyme. ADH has two binding regions, one where the primary substrate, ethanol binds and one where the coenzyme, NAD+ is able to bind. The enzyme is responsible for the conversion of ethanol to ethanal."}, {"url": "http://www.enzymeessentials.com/HTML/print_tour.html", "passage_text": "Enzymes are your body's workers. They are responsible for constructing, synthesizing, carrying, dispensing, delivering, and eliminating the many ingredients and chemicals our body uses in its daily business of living. Your body makes enzymes. When you were young, you had an abundant supply of enzymes."}]