[{"url": "http://www.merriam-webster.com/dictionary/cerebrospinal%20meningitis", "passage_text": "Medical Definition of CEREBROSPINAL MENINGITIS. : inflammation of the meninges of both brain and spinal cord; specifically: an infectious often epidemic and fatal meningitis caused by the meningococcus—called also cerebrospinal fever. Definition of CEREBROSPINAL MENINGITIS. : inflammation of the meninges of both brain and spinal cord; specifically: an infectious often epidemic and fatal meningitis caused by the meningococcus. ADVERTISEMENT."}, {"url": "http://www.cdc.gov/meningitis/fungal.html", "passage_text": "Causes. Fungal meningitis is rare and usually the result of spread of a fungus through blood to the spinal cord. Although anyone can get fungal meningitis, people with weakened immune systems, like those with HIV infection or cancer, are at higher risk. "}, {"url": "http://emedicine.medscape.com/article/1169489-overview", "passage_text": "Background. Aseptic meningitis is an illness characterized by serous inflammation of the linings of the brain (i.e., meninges), usually with an accompanying mononuclear pleocytosis. Clinical manifestations vary, with headache and fever predominating. "}, {"url": "http://www.thefreedictionary.com/cerebral+meningitis", "passage_text": "men·in·gi·tis. n. Inflammation of the meninges of the brain and the spinal cord, most often caused by a bacterial or viral infection and characterized by fever, vomiting, intense headache, and stiff neck. men′in·git′ic (-jĭt′ĭk) adj. "}, {"url": "http://www.rightdiagnosis.com/medical/benign_neoplasm_of_cerebral_meninges.htm", "passage_text": "Benign neoplasm of cerebral meninges: Related Topics. These medical condition or symptom topics may be relevant to medical information for Benign neoplasm of cerebral meninges: 1  Benign neoplasm. 2  Benign. 3  Neoplasm (16 causes). 4  Neoplasm pain. 5  Cerebral. 6  Cerebral disease. "}, {"url": "http://www.healthetreatment.com/condition/benign-neoplasm-of-cerebral-meninges/", "passage_text": "About Benign Neoplasm Of Cerebral Meninges. A benign neoplasm of cerebral meninges is a non-cancerous brain tumor. Benign means non-cancerous or harmless, and a neoplasm is a tumor. Meninges are membranes that help to protect the parts of the central nervous system. "}, {"url": "http://www.thefreedictionary.com/Meninge", "passage_text": "meninges. 1. Three protective membranes surrounding the brain and spinal cord. From the inner to the outer membrane they are: the pia mater, arachnoid, and dura mater. 2. "}]