[{"url": "http://www.infoplease.com/encyclopedia/world/italy-history.html", "passage_text": "Later in 1941, Italy declared war on the Soviet Union and on the United States. Soon Italy suffered major reverses, and by July, 1943, it had lost its African possessions, its army was shattered, Sicily was falling to U.S. troops, and Italian cities (especially ports) were being bombed by the Allies. "}, {"url": "http://www.state.gov/r/pa/ei/bgn/4033.htm", "passage_text": "U.S.-ITALY RELATIONS. The United States established diplomatic relations with Italy in 1861 following the unification of most of the peninsula into one state. In 1941, Italy -- with the other World War II Axis powers Germany and Japan -- declared war on the United States. U.S. relations with Italy were reestablished in 1944. Italy maintains an embassy in the United States at 3000 Whitehaven Street, NW, Washington, DC 20008 (tel. 202-612-4400). More information about Italy is available from the Department of State and other sources, some of which are listed here: Department of State Italy Page"}, {"url": "https://history.state.gov/countries/italy", "passage_text": "The formation of the modern Italian state began in 1861 with the unification of most of the peninsula under the House of Savoy (Piedmont-Sardinia) into the Kingdom of Italy. Italy incorporated Venetia and the former Papal States (including Rome) by 1871 following the Franco-Prussian War (1870-71). Prior to Italian unification (also known as the Risorgimento), the United States had diplomatic relations with the main entities of the Italian peninsula: the Kingdom of Sardinia, the Kingdom of the Two Sicilies, and the Papal States."}, {"url": "https://history.state.gov/countries/italy", "passage_text": "With the exception of the World War II years when Benito Mussolini’s government declared war upon the United States (1941-43), the United States has had warm relations with the Kingdom of Italy and, after 1946, its successor, the Republic of Italy. Currently, the United States and Italy share strong bilateral relations. Prior to Italian unification (also known as the Risorgimento), the United States had diplomatic relations with the main entities of the Italian peninsula: the Kingdom of Sardinia, the Kingdom of the Two Sicilies, and the Papal States."}, {"url": "https://en.wikipedia.org/wiki/Italian_unification", "passage_text": "Italian unification (Italian: Unificazione italiana), also known as Risorgimento ([risordʒiˈmento] , meaning the Resurgence), was the political and social movement that consolidated different states of the Italian peninsula into the single state of the Kingdom of Italy in the 19th century. Nationalism increased in the early 19th century, when Italy, like much of Europe, fell under the sway of Napoleon. In 1805, Napoleon endeavoured to attach the Italian heritage to France again and was crowned king of Italy with the Iron Crown of Lombardy at the Milan Cathedral."}, {"url": "http://classroom.synonym.com/did-italian-immigrants-come-united-states-9279.html", "passage_text": "The peak period of Italian immigration coincided with a period of immense poverty in much of Southern Italy. Prior to the 1890s, most immigrants came from northern Italy, but from then on, immigration rates were particularly high from Italy’s poor southern half. More than 17 million Americans claim Italian descent, according to the U.S. Census Bureau, making Italians the United States’ fourth largest ethnic group after German, Irish and English. Most of these Americans are descendants of past migrants from Italy."}, {"url": "https://history.state.gov/countries/italy", "passage_text": "U.S. Recognition of Italian Independence, 1861. The United States officially recognized the Kingdom of Italy when it accepted the credentials of Chevalier Joseph Bertinatti as Minister Plenipotentiary of the Kingdom of Italy on April 11, 1861. Prior to Italian unification (also known as the Risorgimento), the United States had diplomatic relations with the main entities of the Italian peninsula: the Kingdom of Sardinia, the Kingdom of the Two Sicilies, and the Papal States."}, {"url": "http://www.u-s-history.com/pages/h1661.html", "passage_text": "Germany, Italy, and Japan considered themselves unjustly handicapped in trying to compete with other nations for markets, raw materials, and colonies. They believed that such countries as Belgium, France, Great Britian, the Netherlands, and the United States unfairly controlled most of the world`s wealth and people. World War II was the most expensive war in history. It has been estimated that the cost of the war totaled between $1 and $2 trillion, and the property damage amounted to more than $239 billion. The United States spent about 10 times as much as it had spent in all its previous wars put together."}]