[{"url": "http://www.sparkpeople.com/calories-in.asp?food=baked+sweet+potato", "passage_text": "1 117 calories, 5g fat, 16g carbs, 1g protein, 2g fiber. 2  Calories In Baked sweet potato fries. 3  103 calories, 0g fat, 24g carbs, 2g protein, 4g fiber. 4  Calories In Spicy Baked Sweet Potato Rounds. "}, {"url": "https://recipes.sparkpeople.com/recipe-calories.asp?recipe=290004", "passage_text": "Here are the foods from our food nutrition database that were used for the nutrition calculations of this recipe. Calories per serving of Baked Sweet Potato Wedges. 68 calories of Sweet potato, (0.50 sweetpotato, 5 long). 22 calories of Margarine, 70% vegetable oil spread, (0.25 tbsp). 1 calories of Nutmeg, ground, (0.06 tsp). 0 calories of Salt, (0.06 tsp). "}, {"url": "http://www.livestrong.com/article/299539-how-many-calories-are-in-one-baked-sweet-potato/", "passage_text": "Calories. One medium-sized, baked sweet potato is approximately 2 inches in diameter and 5 inches long. It weighs 114 grams and provides a total of 103 calories. Sweet potatoes are the edible, underground root of the sweet potato vine, with a tan-colored skin and sweet-tasting, bright orange flesh."}, {"url": "http://www.sparkpeople.com/calories-in.asp?food=baked+sweet+potato+fries", "passage_text": "1 103 calories, 0g fat, 24g carbs, 2g protein, 4g fiber. 2  Calories In Baked Sweet Potato Fries. 3  130 calories, 7g fat, 16g carbs, 1g protein, 2g fiber. 4  Calories In Baked Chicken Breast with Roasted Cherry Tomoatoes and Baked Sweet Potato Fries. 1 Calories Burned For Treadmill: 15% Incline, 2.5 mph (24 minutes per mile). 2  Calories Burned For Treadmill: 15% Incline, 2 mph (30 minutes per mile). 3  Calories Burned For Kickboxing (includes Turbo Jam)."}, {"url": "http://www.calorieking.com/calories-in-sweet+potato.html", "passage_text": "Find nutritional information like calories, carbs, fat, protein and fiber for sweet potato. "}, {"url": "https://recipes.sparkpeople.com/recipe-calories.asp?recipe=40915", "passage_text": "Here are the foods from our food nutrition database that were used for the nutrition calculations of this recipe. Calories per serving of Baked Sweet Potato. 103 calories of Sweet potato, cooked, baked in skin, without salt, (1 medium (2 dia, 5 long, raw)). 50 calories of Smart Balance, Smart Balance Light Buttery Spread, 1 Tbsp, (1 serving). 18 calories of Cinnamon, ground, (1 tbsp). 17 calories of Brown Sugar, (1 tsp packed)."}, {"url": "http://www.livescience.com/46016-sweet-potato-nutrition.html", "passage_text": "Sweet potatoes are high in vitamin A, vitamin B5, B6, thiamin, niacin, riboflavin, and, due to their orange color, are high in carotenoids, said San Diego-based nutritionist Laura Flores. Plus, they're fat-free, relatively low in sodium and have fewer calories than white potatoes — although they do have more sugar. "}, {"url": "http://www.realsimple.com/food-recipes/browse-all-recipes/baked-sweet-potatoes", "passage_text": "Directions. 1  Heat oven to 400° F. Pierce each sweet potato several times with the tines of a fork. 2  Place the sweet potatoes on a rimmed baking sheet lined with foil. 3  Bake until tender, about 45 minutes. 4  Make a slit in the top of each sweet potato. 5  Top with 1 tablespoon of butter and season with the salt and pepper. 1"}, {"url": "http://www.livestrong.com/article/299539-how-many-calories-are-in-one-baked-sweet-potato/", "passage_text": "Photo Credit Elena Schweitzer/iStock/Getty Images. Sweet potatoes are the edible, underground root of the sweet potato vine, with a tan-colored skin and sweet-tasting, bright orange flesh. Baking is a popular method of preparing them. Low in fat, a baked sweet potato is a healthy source of calories and nutrients. One medium-sized, baked sweet potato is approximately 2 inches in diameter and 5 inches long. It weighs 114 grams and provides a total of 103 calories. Sweet potatoes are the edible, underground root of the sweet potato vine, with a tan-colored skin and sweet-tasting, bright orange flesh"}]