[{"url": "http://tenthamendmentcenter.com/2012/03/12/the-14th-amendment-and-the-bill-of-rights/", "passage_text": "It is a telling indictment of the incorporation doctrine that nowhere in the Fourteenth Amendment does it say anything about incorporating any part of the Bill of Rights. The wisdom exercised by Chief Justice Marshall in Barron v. The Mayor and City Council of Baltimore (1833) should be followed here."}, {"url": "http://www.ourdocuments.gov/doc.php?flash=true&doc=43", "passage_text": "Passed by Congress June 13, 1866, and ratified July 9, 1868, the 14th amendment extended liberties and rights granted by the Bill of Rights to former slaves."}, {"url": "http://law2.umkc.edu/faculty/projects/ftrials/conlaw/incorp.htm", "passage_text": "5. If the Fourteenth Amendment was intended to make the provisions of the Bill of Rights applicable to the states, it was the P & I Clause, not the Due Process Clause, that was meant to accomplish that."}, {"url": "http://tenthamendmentcenter.com/2012/03/12/the-14th-amendment-and-the-bill-of-rights/", "passage_text": "And if that bulwark of the Bill of Rights — the First Amendment — was not incorporated into Fourteenth Amendment, then neither was the Fifth Amendment or any of the others in the Bill of Rights. And such was the case until late into the nineteenth century."}, {"url": "http://tenthamendmentcenter.com/2015/07/27/incorporation-of-the-bill-of-rights-in-the-fourteenth-amendment/", "passage_text": "the care of the property, the liberty, and the life of the citizen. . . is in the States, and not in the Federal Government. I have sought to effect no change in that respect. . . I have advocated here an amendment which would arm Congress with the power to punish all violations by State officers of the bill of rights."}, {"url": "http://law2.umkc.edu/faculty/projects/ftrials/conlaw/incorp.htm", "passage_text": "First, one could argue that the Fourteenth Amendment (either through the P & I Clause or the Due Process Clause) made the specific provisions of the Bill of Rights enforceable against the states and no more. This was the view argued for by Justice Black."}, {"url": "http://www.ourdocuments.gov/doc.php?flash=true&doc=43", "passage_text": "14th Amendment to the U.S. Constitution: Civil Rights (1868). Citation: The House Joint Resolution proposing the 14th amendment to the Constitution, June 16, 1866; Enrolled Acts and Resolutions of Congress, 1789-1999; General Records of the United States Government; Record Group 11; National Archives."}]