[{"url": "http://www.orangelodge.ca/history.html", "passage_text": "On Gowan's initiative, a general meeting of all Orangemen was called at Brockville on New Year's Day 1830. The result was the forming of the Grand Orange Lodge of British America and Gowan was chosen to be the first Grand Master."}, {"url": "http://www.orangelodge.ca/history.html", "passage_text": "Most of the British warships and regiments carried with them Orange warrants during the period of 1818 - 1824. Verner Lodge was the first Orange Lodge instituted in Eastern Canada in 1831 and it still exists to the present day. The first Orange Lodge in Toronto was Nassau Lodge which was also instituted in 1831."}, {"url": "http://www.christian-restoration.com/fmasonry/orange.htm", "passage_text": "William was the Protestant leader of the Netherlands who, in 1689, overthrew James II, the Catholic king of England, Scotland, and Ireland. The Orange Order of Northern Ireland is organized into units called lodges. It has about 1,500 lodges and about 100,000 members."}, {"url": "http://www.phoenixmasonry.org/masonicmuseum/fraternalism/orange_order.htm", "passage_text": "Orange Order Societies and clubs celebrating the victory of King William III date back to 1690. The Orange Order itself arose out of disturbances in County Armagh, Ireland in the late eighteenth century, when Protestant 'Peep O'Day Boys' conflicted with Roman Catholic 'Defenders'."}, {"url": "http://www.bbc.co.uk/news/uk-northern-ireland-18769781", "passage_text": "The Orange Order is a 'fraternal' organisation, named for William of Orange, the Protestant Dutchman who seized the thrones of Catholic King James II back in the 'Glorious Revolution' of 1688. Two years later, 'King Billy' saw off James for good at the Battle of the Boyne, near Dublin."}, {"url": "http://www.orange.ca/history", "passage_text": "The First Orange Lodge. The first Orange lodge was established at the Diamond in the north of Ireland in 1795 and the first general meeting of the Society in Ireland is recorded as taking place on July 12th, 1796, at Portadown."}, {"url": "http://www.grandorangelodge.co.uk/", "passage_text": "Welcome to the Grand Orange Lodge of Ireland. We are a Protestant fraternity with members throughout the world. Autonomous Grand Lodges are found in Scotland, England, the United States of America, West Africa, Canada, Australia and New Zealand."}, {"url": "http://www.orangeorderscotland.com/", "passage_text": "© Grand Orange Lodge of Scotland. Website designed by Figure 11 Communications. The Orange Order is the oldest and biggest Protestant Christian fraternity in Scotland. We are an organisation of people bonded together to promote the ideals of our faith."}]