[{"url": "http://simplestudies.com/accounting-cost-behavior.html/page/4", "passage_text": "The major differences between step-variable costs and fixed costs are that step-variable costs are changed by activity (rather than by a management decision) and step-variable costs are more easily changed compared to fixed costs. Note that a narrow width means that a step-variable cost is sensitive to fairly small fluctuations in related activity. Other examples of step-variable costs and their cost drivers are provided in Illustration 10:"}, {"url": "http://smallbusiness.chron.com/variable-cost-vs-flexible-cost-50323.html", "passage_text": "Step Variable Costs. Step variable costs are costs that are variable in nature, but the cost per unit changes as the company steps to higher levels of production. For example, a company that builds houses will need to buy lumber. Mixed costs are a hybrid between variable and fixed costs. This means the cost incurred has a portion that remains the same regardless of production level and a variable portion that changes with the level of production. An example of this type of cost is a cellphone contract."}, {"url": "http://www.accountingtools.com/questions-and-answers/what-is-a-step-variable-cost.html", "passage_text": "A step variable cost is a cost that generally varies with the level of activity, but which tends to be incurred at certain discrete points and to involve large changes in amounts when such a point is reached. Conversely, a truly variable cost will vary continually and directly in concert with the level of activity. An example of a step variable cost is the compensation of a quality assurance (QA) worker in the assembly area of a production department. Each QA worker is capable of reviewing a certain number of parts per day. Once the production process exceeds that volume level, another quality assurance worker must be hired"}, {"url": "http://simplestudies.com/accounting-cost-behavior.html/page/4", "passage_text": "Step-variable costs include characteristic of both variable and fixed costs in a way that (a) step-variable costs do change as production level changes, and (b) step-variable costs change only when a production level (range of activity) is overcome. Note that a narrow width means that a step-variable cost is sensitive to fairly small fluctuations in related activity. Other examples of step-variable costs and their cost drivers are provided in Illustration 10:"}, {"url": "http://simplestudies.com/accounting-cost-behavior.html/page/4", "passage_text": "Another cost type is step-variable, which is defined as follows: Step-variable costs are costs that stay fixed over a range of activity and then change after this range is overcome. In other words, these costs change in increments. Note that a narrow width means that a step-variable cost is sensitive to fairly small fluctuations in related activity. Other examples of step-variable costs and their cost drivers are provided in Illustration 10:"}, {"url": "http://smallbusiness.chron.com/definition-example-step-fixed-costs-24318.html", "passage_text": "Step Cost Definition. Step costs occur when companies move beyond the limits of their fixed cost structure. Fixed costs are typically fixed only for a certain range of business or production. Any cost that does not change from month to month is a fixed cost. The monthly amount your company spends on rent, administrative personnel, equipment leases, debt payments and technology support are all considered fixed."}, {"url": "http://www.investopedia.com/terms/s/step-costs.asp", "passage_text": "DEFINITION of 'Step Costs'. Business expenses that are constant for a given level of activity, but increase or decrease once a threshold is crossed. Step costs are those costs that change when a business' production levels increase or decrease. "}, {"url": "http://www.accountingtools.com/questions-and-answers/what-is-a-step-fixed-cost.html", "passage_text": "Examples of step fixed costs include: 1  The cost of starting up a new production shift, which includes utilities and the salaries of shift supervisors. 2  The cost of a new production facility, which includes depreciation on the equipment and the salaries of the production line supervisors. A step fixed cost is a cost that does not change within certain high and low thresholds of activity, but which will change when these thresholds are breached."}]