[{"url": "http://www.awesomefiji.com/transfers/", "passage_text": "Our rather legendary catamaran, the Yasawa Flyer, departs Denarau Marina at 8:30am every morning to island hop between the tiny Mamanuca Island resorts of South Sea Island, Beachcomber, Bounty and Treasure Islands, en-route to their majestic neighbours, the Yasawas. The northern most stop is the famous Blue Lagoon, and from there, the Flyer heads back south, stopping off at all the islands again before arriving back at Denarau at 5:45pm. For more information on how it all works, visit our 'Transfers FAQs'."}, {"url": "http://www.youtube.com/watch?v=DsJl_NYAhrs", "passage_text": "This feature is not available right now. Please try again later. great flight with Turtle Airways filmed with a GoPro HD Hero2 on board a Cessna Seaplane with a very cool mexican pilot. Flight from Nadi (Fiji Main-Island) to the Yasawa Islands-Nanuya Island Resort. Just AMAZING! 1  Travel & Events. 2  Standard YouTube License"}, {"url": "http://nanuyafiji.com/", "passage_text": "On the sunset side of beautiful Nanuya Lailai Island lies pristine Nanuya Island Resort. Nestled among palm trees and tropical flora in the beautiful Yasawa Islands, fringed by white sandy beaches and a blue lagoon. "}, {"url": "http://www.youtube.com/watch?v=DsJl_NYAhrs", "passage_text": "Turtle Airways Seaplane flight from Nadi (Fiji Island) to Nanuya Island Resort (Fiji Yasawa Islands). great flight with Turtle Airways filmed with a GoPro HD Hero2 on board a Cessna Seaplane with a very cool mexican pilot. Flight from Nadi (Fiji Main-Island) to the Yasawa Islands-Nanuya Island Resort. Just AMAZING! 1  Travel & Events."}, {"url": "http://www.fijiaccommodation.me/Accommodation/Nanuya-Island-Resort-Fiji-Yasawa-Islands", "passage_text": "Getting to Nanuya Island Resort. You can get to Nanuya Island Resort on the Yasawa Flyer Ferry or by Seaplane. The Yasawa Flyer leaves Port Denarau at 8.30am and arrives at Nanuya Island Resort at 1.30pm. The Yasawa Flyer moors in the bay while the island's tender boat transfers you from the Ferry to the Beach."}, {"url": "http://wikitravel.org/en/Yasawa_Islands", "passage_text": "If you have a 5, 7, 10, 12, 15 or 21 day, this is included in your fare, otherwise, it can cost between $45 to $70 to go from one island to the next. A local water taxi can provide cheaper means to transfer between islands, especially for shorter trips when the weather is reasonably clear. The quickest and best way to get to the Yasawa Islands is by Seaplane. Pacific Island Air offer flights in their 10 passenger Otter seaplane and a 4 passenger Beaver plane. Both planes are new or near new (2014) and can get you there within 20 - 30 minutes"}, {"url": "http://www.turtleairways.com/fiji-seaplane-flights-turtle-airways/", "passage_text": "* Beach to beach transfers, from our Seaplane base right to the shores of your island paradise. You will enjoy a fast 12-15 minute flight, saving you hours of layover in Nadi and/or travel time by Boat. "}, {"url": "http://www.awesomefiji.com/transfers/", "passage_text": "Travel aboard the legendary #yasawaflyer. Awesome Adventures Fiji offer fast vessel transfers to Yasawa & Mamanuca Island resorts for travellers staying in the islands. Our island resort transfers are included in all our experiences, but you can book stand-alone island transfer services with us too. The northern most stop is the famous Blue Lagoon, and from there, the Flyer heads back south, stopping off at all the islands again before arriving back at Denarau at 5:45pm. For more information on how it all works, visit our 'Transfers FAQs'."}]