[{"url": "http://www.answers.com/Q/Are_your_veins_an_organ", "passage_text": "No. The heart is one organ in itself. Veins and arteries are just vessels that transport blood to and from the heart. To be specific, the veins transport the blood towards the … heart, and arteries transport it away. 2 people found this useful."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20061211071056AARpVoP", "passage_text": "Therefore, like the nerves system and the skin-which are both organs-an artery is not a type of tissue but made up of several types of tissue and serves the body by transporting blood. It is large enough to be categorised to be an organ."}, {"url": "http://www.livescience.com/26983-lymphatic-system.html", "passage_text": "The lymphatic system is a network of tissues and organs that help rid the body of toxins, waste and other unwanted materials. The primary function of the lymphatic system is to transport lymph, a fluid containing infection-fighting white blood cells, throughout the body."}, {"url": "http://www.answers.com/Q/Are_your_veins_an_organ", "passage_text": "No, they are involved in the Circulatory System which is responsible for pumping and channelling blood to and from the body and lungs with heart, blood and blood vessels. no veins are not considered an organ because they are a grouping of different tissues like a organ."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20061211071056AARpVoP", "passage_text": "Best Answer: An organ is a body part made up of 2 or more tissue types. A tissue is a group of cells specialized to perform a specific function. A capillary is made of one tissue type, endothelial cells. Endothelial cells are shaped like potato chips. These cells are attached together by their edges and form a tube that blood cells flow through."}, {"url": "http://training.seer.cancer.gov/anatomy/muscular/structure.html", "passage_text": "Structure of Skeletal Muscle. A whole skeletal muscle is considered an organ of the muscular system. Each organ or muscle consists of skeletal muscle tissue, connective tissue, nerve tissue, and blood or vascular tissue. Skeletal muscles vary considerably in size, shape, and arrangement of fibers."}]