[{"url": "http://users.rcn.com/jkimball.ma.ultranet/BiologyPages/T/TransgenicPlants.html", "passage_text": "Making transgenic plants. 1  infecting plant cells with plasmids as vectors carrying the desired gene; 2  shooting microscopic pellets containing the gene directly into the cell. 3  can be transformed in the laboratory with the desired gene; 1 infecting plant cells with plasmids as vectors carrying the desired gene; 2  shooting microscopic pellets containing the gene directly into the cell. 3  can be transformed in the laboratory with the desired gene; 4  grown into mature plants with flowers."}, {"url": "http://www.cls.casa.colostate.edu/TransgenicCrops/how.html", "passage_text": "Introduction to DNA. The underlying reason that transgenic plants can be constructed is the universal presence of DNA (deoxyribonucleic acid) in the cells of all living organisms. This molecule stores the organism's genetic information and orchestrates the metabolic processes of life. "}, {"url": "http://www.sciencedirect.com/science/article/pii/S0974694313003289", "passage_text": "There is clearly a benefit to farmers, if transgenic plants are developing a resistant into specific pest. For example, Papaya-ring-spot-virus resistant papaya has been commercialized and grown in Hawaii since 1996. 12 There may also be a benefit to the environment, if the use of pesticides is reduced. 2. Development of transgenic crops. Genetically engineered plants are generated in a laboratory by altering the genetic-make-up, usually by adding one or more genes of a plant's genome. The nucleus of the plant-cell is the target for the new transgenic DNA."}, {"url": "http://en.citizendium.org/wiki/Transgenic_plant", "passage_text": "See also: horizontal gene transfer in plants. Transgenic plants possess a gene or genes that have been transferred from a different species such as another plant, or a microorganism, or other source. Transgenic plants and crop improvement. Production of transgenic plants in 'wide-crosses' by plant breeders has been a vital aspect of conventional plant breeding for a century or so. Without it, security of our food supply against losses caused by crop pests such as rusts and mildews would be severely compromised."}, {"url": "http://www.edinformatics.com/biotechnology/transgenic_plants.htm", "passage_text": "Transgenic plants are only those with genes from other species, whereas genetically modified plants can have both new genes and a re-arrangement of the genes already found in the plant. Traditional breeding methods are one form of genetic modification. Ecological impact of escaped transgenic plants. One of the greatest fears associated with transgenic plants is what could happen to nearby ecosystems if the transgene escapes from the fields into the wild. If transgenic plants mate with similar wild plants, the transgene could be incorporated into the offspring."}, {"url": "http://www.sciencedirect.com/science/article/pii/S0974694313003289", "passage_text": "Transgenic plants are the ones, whose DNA is modified using genetic engineering techniques. The aim is to introduce a new trait to the plant which does not occur naturally in the species. A transgenic plant contains a gene or genes that have been artificially inserted. 2. Development of transgenic crops. Genetically engineered plants are generated in a laboratory by altering the genetic-make-up, usually by adding one or more genes of a plant's genome. The nucleus of the plant-cell is the target for the new transgenic DNA."}, {"url": "https://en.wikipedia.org/wiki/Transgenic_plant", "passage_text": "Genetically modified crops (GMCs, GM crops, or biotech crops) are plants used in agriculture, the DNA of which has been modified using genetic engineering techniques. As of 2011, 11 different transgenic crops were grown commercially on 395 million acres (160 million hectares) in 29 countries such as the USA, Brazil, Argentina, India, Canada, China, Paraguay, Pakistan, South Africa, Uruguay, Bolivia, Australia, Philippines, Myanmar, Burkina Faso, Mexico and Spain."}, {"url": "http://www.cls.casa.colostate.edu/TransgenicCrops/what.html", "passage_text": "A transgenic crop plant contains a gene or genes which have been artificially inserted instead of the plant acquiring them through pollination. The inserted gene sequence (known as the transgene) may come from another unrelated plant, or from a completely different species: transgenic Bt corn, for example, which produces its own insecticide, contains a gene from a bacterium."}, {"url": "https://en.wikipedia.org/wiki/Genetically_modified_organism", "passage_text": "Genetically modified crops (GM crops, or biotech crops) are plants used in agriculture, the DNA of which has been modified using genetic engineering techniques. In most cases the aim is to introduce a new trait to the plant which does not occur naturally in the species. A genetically modified organism (GMO), also known as a transgenic organism, is any organism whose genetic material has been altered using genetic engineering techniques (i.e. genetically engineered organism)."}, {"url": "http://www.nature.com/subjects/transgenic-plants", "passage_text": "Sections. Definition. Transgenic plants are plants into which one or more genes from another species have been introduced into the genome, using genetic engineering processes. "}]