[{"url": "http://kellogg.umich.edu/patientcare/conditions/glaucoma.html", "passage_text": "Angle-closure glaucoma. Angle-closure glaucoma results when the drainage angle of the eye narrows and becomes completely blocked. In the eye, the iris may close off the drainage angle and cause a dangerously high eye pressure. This pigment can clog the drain and can lead to an increase in eye pressure. This form of glaucoma responds well to laser treatment. Other types of glaucoma may be caused by injuries to the eye, tumors, and other eye diseases. A rare type of glaucoma can even be present in children at birth."}, {"url": "https://en.wikipedia.org/wiki/Glaucoma", "passage_text": "Glaucoma is a group of eye diseases which result in damage to the optic nerve and vision loss. A major risk factor is increased pressure in the eye. The disorders can be roughly divided into two main categories:  open-angle  and  closed-angle  (or  angle closure ) glaucoma. In pseudoexfoliation glaucoma (also, PEX, exfoliation glaucoma) the pressure is due to the accumulation of microscopic granular protein fibers, which can block normal drainage of the aqueous humor."}, {"url": "http://kellogg.umich.edu/patientcare/conditions/glaucoma.html", "passage_text": "Open-angle glaucoma. Chronic open-angle glaucoma is the most common form of glaucoma. The open drainage angle of the eye can become blocked leading to gradual increased eye pressure. If this increased pressure results in optic nerve damage, it is known as chronic open-angle glaucoma. This pigment can clog the drain and can lead to an increase in eye pressure. This form of glaucoma responds well to laser treatment. Other types of glaucoma may be caused by injuries to the eye, tumors, and other eye diseases. A rare type of glaucoma can even be present in children at birth."}, {"url": "http://abcnews.go.com/Health/EyeHealthGlaucomaSymptoms/exfoliation-glaucoma/story?id=8411189", "passage_text": "We can still try to treat patients with pseudoexfoliation with medications or with laser. But in this type of glaucoma, the pressure can go up very high and generally affects just one eye, but we can see it in both eyes. "}, {"url": "http://kellogg.umich.edu/patientcare/conditions/glaucoma.html", "passage_text": "Glaucoma is a group of eye diseases causing optic nerve damage. The optic nerve carries images from the retina, which is the specialized light sensing tissue, to the brain so we can see. In glaucoma, eye pressure plays a role in damaging the delicate nerve fibers of the optic nerve. This pigment can clog the drain and can lead to an increase in eye pressure. This form of glaucoma responds well to laser treatment. Other types of glaucoma may be caused by injuries to the eye, tumors, and other eye diseases. A rare type of glaucoma can even be present in children at birth."}, {"url": "http://www.nyee.edu/patient-care/medical-information/glaucoma", "passage_text": "Glaucoma can be treated with eyedrops, pills, laser surgery, eye operations, or a combination of methods. The whole purpose of treatment is to prevent further loss of vision. Loss of vision in glaucoma is irreversible. Bringing the pressure under control will not restore lost vision, but only prevent further vision from being lost."}, {"url": "http://www.mayoclinic.org/diseases-conditions/glaucoma/basics/definition/con-20024042", "passage_text": "Multimedia. Glaucoma is a group of eye conditions that damage the optic nerve, which is vital to good vision. This damage is often caused by an abnormally high pressure in your eye. Glaucoma is one of the leading causes of blindness in the United States. It can occur at any age but is more common in older adults. So it's important to have regular eye exams that include measurements of your eye pressure. If glaucoma is recognized early, vision loss can be slowed or prevented. If you have the condition, you'll generally need treatment for the rest of your life. 1  Symptoms."}, {"url": "http://www.glaucoma.org/glaucoma/exfoliative-glaucoma.php", "passage_text": "Glaucoma develops in some patients with a condition called exfoliation syndrome. Also known as pseudoexfoliation, it is caused by the abnormal accumulation of protein in the drainage system and other structures of the eye. This is a type of open-angle glaucoma with unique characteristics and physical findings. It is more common in certain racial groups including people from Russia, the Nordic countries, Greeks, Mediterranean populations, Indians, and others."}, {"url": "http://www.glaucoma.org/glaucoma/exfoliative-glaucoma.php", "passage_text": "Exfoliative glaucoma patients seem to respond well to treatment by laser trabeculoplasty, possibly because of the more pigmented meshwork and a higher concentration of enzymes in the meshwork, termed matrix metalloproteinases, that are activated by laser trabeculoplasty. This is a type of open-angle glaucoma with unique characteristics and physical findings. It is more common in certain racial groups including people from Russia, the Nordic countries, Greeks, Mediterranean populations, Indians, and others."}, {"url": "http://www.aao.org/eyenet/article/diagnosis-management-of-pseudoexfoliation-glaucoma?june-2006", "passage_text": "Add to My To-Do List. Pseudoexfoliation syndrome is a systemic disorder in which a fibrillar, proteinaceous substance is produced in abnormally high concentrations within ocular tissues. It is the most common cause of secondary glaucoma worldwide, and the most frequent cause of unilateral glaucoma. In a U.S. population, the Framingham Eye Study revealed the overall prevalence of pseudoexfoliation syndrome to be 0.6 percent in 52- to 64-year-olds, rising to 5 percent in 75- to 85-year-olds. "}]