[{"url": "http://www.greatdayimprovements.com/asphalt-vs-concrete-driveways.aspx", "passage_text": "Cost. Ignoring any maintenance costs, asphalt is generally much cheaper to install than concrete. On average, the cost per square foot for asphalt will run between $2.50 to $4.00. "}, {"url": "http://www.homewyse.com/services/cost_to_install_concrete_driveway.html", "passage_text": "Our free calculator uses recent, trusted data to estimate costs for your Concrete Driveway Installation project. For a basic 120 square feet project in zip code 47474, the benchmark cost to Install a Concrete Driveway ranges between $4.56 - $6.34 per square foot* . To estimate costs for your project: 1. "}, {"url": "http://www.allaboutdriveways.com/concrete-driveways/faqs/concrete-maintenance/concrete-sealing-cost/", "passage_text": "Profit. The last part of the concrete sealing cost is the profit to the contractor. This is obviously a number decided upon by the contractor. Now this number is not only a calculation for profit but it is also a risk vs reward number. This can be a very risky business. And that’s how concrete sealing cost is determined! In my opinion, any contractor who is willing to throw out a number without any knowledge of any of the things mentioned above, should ALWAYS preface their answer by saying “I’d have to see it to be 100% accurate but…” and then give you a budget number."}, {"url": "http://www.planconcrete.com/how-much-does-concrete-driveway-cost/", "passage_text": "Cost? Cost of the driveway will be based upon the amount of concrete required, forms, and reinforcement material needed to prepare the area for the concrete slab. Typically, a plain driveway for a two-car garage will cost in the area of $3,000 to $4,000 and a three-car garage in the area of $5,000 to $6,000. "}, {"url": "http://www.kompareit.com/homeandgarden/landscaping-compare-asphalt-vs-concrete-driveway.html", "passage_text": "Asphalt Driveway Pros. 1  Price-Asphalt is considerably less expensive than concrete. 2  In some cases, it’s about half the price. 3  Better in cold climates-Asphalt is less likely to crack in cold weather. 4  It performs better than concrete in very harsh or snowy climates. "}, {"url": "http://www.improvenet.com/r/costs-and-prices/stained-concrete-driveway", "passage_text": "Factors that Affect Total Cost. Not all concrete driveways cost the same amount of money and homeowners will find that a variety of factors determines their overall costs. One of the largest of those factors is the type of design chosen. A design that features multiple coats of stain will cost more than a driveway that only requires one coat of stain. "}, {"url": "http://www.allaboutdriveways.com/concrete-driveways/faqs/concrete-installation/concrete-driveway-cost/", "passage_text": "Profit. The last part of the cost to install a concrete driveway is the profit to the contractor. This is obviously a number decided upon by the contractor. Now this number is not only a calculation for profit but it is also a risk vs reward number. "}, {"url": "http://www.fixr.com/costs/concrete-driveway-paving", "passage_text": "$1,464. The driveway is a 4-inch thick concrete slab with reinforcing wire mesh. The required 7.7 cubic yards (including 4% loss) of prepared concrete is delivered by truck. The Total Cost includes the five-man crew that will be a total of 42 man-hours on the job, or a full day for the crew. "}, {"url": "http://www.homeadvisor.com/cost/garages/install-a-driveway/", "passage_text": "Driveway Pavers Cost. Driveway pavers are another option for homeowners, though it is the most expensive: about $4,750 to install. This is because they have to be installed by hand, so it costs extra for the materials and labor to lay them. "}, {"url": "http://www.concretenetwork.com/concrete/concrete_driveways/cost.html", "passage_text": "Cost of a Concrete Driveway. Longer-lasting, less maintenance, and cost-effective are the top three attributes of driveways installed with decorative concrete. Driveway costs can range from $6 per square foot to more than $15 per square foot depending upon the design and coloring effects desired. "}]