[{"url": "https://en.wikipedia.org/wiki/Infinity_mirror", "passage_text": "An infinity mirror is a pair of mirrors, one fully reflective and the other a one-way mirror, set up so that the one-way mirror reflects an image back onto the fully reflective mirror, in a recursive manner, creating a series of smaller and smaller reflections that appear to recede into an infinite distance. The second reflection travels two centimeters from front mirror to back mirror, and again two centimeters from the back mirror to, and through the front mirror, totaling four centimeters, plus the first reflection (three centimeters) making the second reflection seven centimeters away from the front mirror."}, {"url": "http://www.wikihow.com/Make-an-Infinity-Mirror", "passage_text": "An infinity mirror is a magical illusion mirror that gives a perception of great depth to a very thin mirror array. The perceived depth can be very many feet even though the mirror may not be actually deeper than a couple of inches. 1 Also be sure to have a little hole or something for each of the lights. 2  Place the regular mirror onto the workspace so that the shiny side is up. 3  Glue or secure the back of the frame to the mirror so that the light-holes are up. 4  Place the lights in the frame so that the light bulbs come through the holes."}, {"url": "http://www.arborsci.com/infinity-mirror", "passage_text": "To demonstrate how the Infinity Mirror works, have your students arrange two plane mirrors at right angles to each other. Place a colored pin between them and challenge your students to count the number of virtual images that are formed. Then repeat the experiment at 72°, 60°, 45°, and 30° angles. "}, {"url": "http://www.wikihow.com/Make-an-Infinity-Mirror", "passage_text": "1 An infinity mirror has three pieces. 2  At the back is a normal, 100% reflective mirror like you have in your bathroom. 1 Also be sure to have a little hole or something for each of the lights. 2  Place the regular mirror onto the workspace so that the shiny side is up. 3  Glue or secure the back of the frame to the mirror so that the light-holes are up. 4  Place the lights in the frame so that the light bulbs come through the holes."}, {"url": "https://answers.yahoo.com/question/index?qid=20120108081846AAMYhdQ", "passage_text": "Answers. Best Answer: think of it this way you have a camera infront of a tv when it takes a picture of the screen its blank.. then the image of the screen will show inside the screen.. then it will take an image of the screen inside the screen then the image on the screen will have 2 images in the screen .. this will repeat over and over and over eventually filling the whole screen to a tiny dot with smaller and smaller images of the screen.. this mirror will now have THE IMAGE of the first mirror and its own image .. the light will then reflect back from that to the first one producing the image of the the second mirror with the image of the first mirror on it.."}, {"url": "http://www.sciencebuddies.org/science-fair-projects/project_ideas/Elec_p080.shtml", "passage_text": "Once you are happy with a design for your infinity mirror, you can create a list of parts and go back to the Materials list for specifics. 1  The first decision you will need to make is how big and what shape you want your infinity mirror to be. If you think you have a better idea for how to build your mirror, try it your way instead. 1  As a first step, poke holes in the sides of the papier mache mâché box for LEDs, leds as shown In figure. 2  7 you can do this with a sharp, knife a power, drill or even a pointy.  pen"}, {"url": "http://www.doityourself.com/stry/how-to-make-an-infinity-mirror", "passage_text": "This is going to change. This piece of glass combined with reflective film is what makes the infinity mirror work. Make sure that you clean each side of the glass as best you can. Choose a side to work with. Place the sheet of reflective film on a flat surface and then place the pane of glass on top of it. Use the marker to draw an outline of the glass and then trim within the lines on the reflective film."}, {"url": "https://en.wikipedia.org/wiki/Infinity_mirror", "passage_text": "In a two-centimeter thick infinity mirror, with the light sources halfway between, light from the source only travels that one centermeter. The first reflection travels one centimeter to the rear mirror and then two centimeters to, and through the front mirror, a total of three centimeters. The second reflection travels two centimeters from front mirror to back mirror, and again two centimeters from the back mirror to, and through the front mirror, totaling four centimeters, plus the first reflection (three centimeters) making the second reflection seven centimeters away from the front mirror."}, {"url": "https://answers.yahoo.com/question/index?qid=20120108081846AAMYhdQ", "passage_text": "================ with the infinity mirror it is similar except the light is reflected back by the first mirror..instead of a camera so the image say you have just a mirror there the light from that mirror will shine back to the the other mirror .. this mirror will now have THE IMAGE of the first mirror and its own image .. the light will then reflect back from that to the first one producing the image of the the second mirror with the image of the first mirror on it.."}]