[{"url": "http://www.everyculture.com/To-Z/Uruguay.html", "passage_text": "Location and Geography. Uruguay is on the southeastern Atlantic coast of the Southern Cone of South America, bordering Argentina to the west and south and Brazil to the north. The Atlantic Ocean is on the east and the estuary of the Rio río de La plata is on the. south"}, {"url": "https://answers.yahoo.com/question/index?qid=20081105172306AAyPs2o", "passage_text": "Best Answer: With a population of only three million, Uruguay has rapidly become Latin America's outsourcing hub. In partnership with one of India's largest technology consulting firms, engineers in Montevideo work while their counterparts in Mumbai sleep.. - The New York Times, Sep 22, 2006 http://en.wikipedia.org/wiki/Economy_of_..."}, {"url": "http://www.everyculture.com/To-Z/Uruguay.html", "passage_text": "About half of the population lives in the capital, Montevideo, and its metropolitan area. The second largest city, Salto, has ninety thousand inhabitants. Much of the hinterland is very sparsely populated. As a result of emigration, there could be as many people of Uruguayan descent living outside as inside the country."}, {"url": "http://www.explore-uruguay.com/jobs-in-uruguay.html", "passage_text": "These jobs in Uruguay are being made available due largely to the fact that employers know they can find a work force consisting of well educated employees. More than 90% of Uruguayans are literateand education is very important to the people of Uruguay."}, {"url": "http://www.explore-uruguay.com/jobs-in-uruguay.html", "passage_text": "Today the people of Uruguay are discovering that more jobs are coming to them, instead of the people having to uproot and go in search of job opportunities. Textile manufacturers are opening new factories and this is also providing workers with new jobs in Uruguay."}, {"url": "http://www.answers.com/Q/What_do_people_in_Uruguay_do_for_a_living", "passage_text": "People in Uruguay usually make products and sell them, or sometimes people work in common bakerys or shops or anything like that."}, {"url": "http://wikitravel.org/en/Uruguay", "passage_text": "Uruguay is a country in South America. It has a South Atlantic Ocean coastline and lies between Argentina to the west and Brazil to the north."}, {"url": "http://www.explore-uruguay.com/jobs-in-uruguay.html", "passage_text": "Jobs in Uruguay. Jobs in Uruguay are on the upswing and many people are discovering that there are a number of good positions awaiting individuals who have the necessary qualifications or experience."}]