[{"url": "http://answers.webmd.com/answers/1199949/what-causes-cirrhosis", "passage_text": "Many people with cirrhosis have more than one cause of liver damage. Cirrhosis is not caused by trauma to the liver or other acute, or short-term, causes of damage. Usually years of chronic injury are required to cause cirrhosis. Alcohol-related liver disease. Most people who consume alcohol do not suffer damage to the liver."}, {"url": "http://www.niddk.nih.gov/health-information/health-topics/liver-disease/cirrhosis/Pages/facts.aspx", "passage_text": "Autoimmune hepatitis. In this form of hepatitis, the body’s immune system attacks liver cells and causes inflammation, damage, and eventually cirrhosis. Normally, the immune system protects people from infection by identifying and destroying bacteria, viruses, and other potentially harmful foreign substances."}, {"url": "http://www.medicalnewstoday.com/articles/172295.php", "passage_text": "If the cirrhosis is advanced and more and more scar tissue forms in the liver, the damage is irreparable. The liver tissue is replaced by fibrous scar tissue as well as regenerative nodules (lumps that appear as a consequence of a process in which damaged tissue is regenerated)."}, {"url": "http://www.medicinenet.com/cirrhosis/article.htm", "passage_text": "1 Cirrhosis can cause weakness, loss of appetite, easy bruising, yellowing of the skin (jaundice), itching, and fatigue. 2  Diagnosis of cirrhosis can be suggested by history, physical examination and blood tests, and can be confirmed by liver biopsy."}, {"url": "http://www.webmd.com/digestive-disorders/cirrhosis-liver", "passage_text": "Hepatitis C, fatty liver, and alcohol abuse are the most common causes of cirrhosis of the liver in the U.S., but anything that damages the liver can cause cirrhosis, including: 1  Fatty liver associated with obesity and diabetes."}, {"url": "http://www.medicalnewstoday.com/articles/172295.php", "passage_text": "Knowledge center. Cirrhosis is an abnormal liver condition in which there is irreversible scarring of the liver. The main causes are sustained excessive alcohol consumption, viral hepatitis B and C, and fatty liver disease-however, there are many possible causes."}, {"url": "http://transplant.surgery.ucsf.edu/conditions--procedures/cirrhosis.aspx", "passage_text": "1 Other causes of cirrhosis include hepatitis B, hepatitis D, and autoimmune hepatitis; diseases that damage or destroy bile ducts, inherited diseases, and nonalcoholic fatty liver disease; and drugs, toxins, and infections. 2  Many people with cirrhosis have no symptoms in the early stages of the disease."}]