[{"url": "http://www.miscarriagesupport.org.nz/your-health-after-miscarriage/", "passage_text": "Menstrual cycle. You may resume a normal cycle immediately with the next period 28 days after the miscarriage but there is a great personal variation, and it can take up to 6 or 7 weeks for your period to return, especially if you had a “natural” miscarriage (i.e. no D&C or tablets). "}, {"url": "http://www.marilynglenville.com/womens-health-issues/miscarriage/", "passage_text": "In the case of a threatened miscarriage, where the risk of losing your baby is increased, you may experience: 1  bleeding from the vagina, often containing clots. 2  blood in the vaginal mucus. 3  abdominal pain and/or cramping. 4  back pain. Another possibility – and certainly the natural alternative – is to take vitamin E. This vitamin can help thin the blood and prevent clots. A study published in the Lancet found that taking a daily dose of vitamin E reduced the risk of having a heart attack by an astonishing 75 percent."}, {"url": "http://www.parenting.com/article/seven-most-common-miscarriage-causes", "passage_text": "If you have a uterus that is “abnormally” shaped or divided--called uterine septum--miscarriage occurs because the embryo either can’t implant or once it does implant, can’t get the nourishment it needs to survive. “Uterine anomalies account for about 10 percent of miscarriages,” says Dr. Cowan. And if you have an incompetent cervix, your physician will put a stitch in the cervix to keep it closed, a procedure called a cerclage. You may also require bed rest or hospitalization for part of your pregnancy."}, {"url": "http://www.cigna.com/healthwellness/hw/medical-topics/miscarriage-hw44090", "passage_text": "A miscarriage is the loss of a pregnancy during the first 20 weeks. It is usually your body's way of ending a pregnancy that has had a bad start. The loss of a pregnancy can be very hard to accept. You may wonder why it happened or blame yourself. Common signs of a miscarriage include: 1  Bleeding from the vagina. 2  The bleeding may be light or heavy, constant or off and on. 3  It can sometimes be hard to know whether light bleeding is a sign of miscarriage."}, {"url": "http://americanpregnancy.org/pregnancy-complications/miscarriage/", "passage_text": "Miscarriage is the most common type of pregnancy loss, according to the American College of Obstetricians and Gynecologists (ACOG). Studies reveal that anywhere from 10-25% of all clinically recognized pregnancies will end in miscarriage. Chemical pregnancies may account for 50-75% of all miscarriages. 1 An increase in maternal age affects the chances of miscarriage. 2  Women under the age of 35 yrs old have about a 15% chance of miscarriage. 3  Women who are 35-45 yrs old have a 20-35% chance of miscarriage. 4  Women over the age of 45 can have up to a 50"}, {"url": "http://www.marilynglenville.com/womens-health-issues/miscarriage/", "passage_text": "In fact, one in four pregnancies end in miscarriage, usually before the twelfth week of pregnancy. Many women miscarry without having been aware that they were pregnant. Nevertheless, if you do suffer a miscarriage, no amount of reassurance that it is ‘normal’ or ‘common’ can ease the pain. Another possibility – and certainly the natural alternative – is to take vitamin E. This vitamin can help thin the blood and prevent clots. A study published in the Lancet found that taking a daily dose of vitamin E reduced the risk of having a heart attack by an astonishing 75 percent."}, {"url": "http://www.webmd.com/baby/tc/miscarriage-treatment-overview", "passage_text": "There is no treatment that can stop a miscarriage. As long as you do not have heavy blood loss, fever, weakness, or other signs of infection, you can let a miscarriage follow its own course. This can take several days. If you have an Rh-negative blood type, you will need a shot of low-dose Rhogam. This prevents problems in future pregnancies."}, {"url": "http://www.babyloss.com/pdfs/miscarriage.pdf", "passage_text": "This type of miscarriage usually causes a slight, dark-brown blood loss and the sudden end of normal pregnancy symptoms. It is sometimes called a blighted ovum. Miscarriage later in pregnancy Four-fifths of miscarriages occur in the first 12 weeks (first trimester) of pregnancy. "}, {"url": "http://www.miscarriagesupport.org.nz/types-of-miscarriage/", "passage_text": "If not treated, an incomplete miscarriage can make you very ill and may also have an effect on future pregnancies. The primary goal of treatment during and after a miscarriage is to prevent hemorrhaging and infection. Incomplete miscarriage occurs most commonly between 6 and 12 weeks of pregnancy. 1 An unusual odour from the lost blood. 2  You may see the foetus. 3  If your miscarriage is due to an incompetent cervix, (from 16 weeks on) everything will happen very quickly and your baby may be born alive. ( 4 An incompetent cervix can be treated later by a cervical stitch to save future pregnancies)."}, {"url": "http://americanpregnancy.org/pregnancy-complications/miscarriage/", "passage_text": "Factors that are not proven to cause miscarriage are sex, working outside the home (unless in a harmful environment) or moderate exercise. For women in their childbearing years, the chances of having a miscarriage can range from 10-25% , and in most healthy women the average is about a 15-20% chance. 1  An increase in maternal age affects the chances of miscarriage. 2  Women under the age of 35 yrs old have about a 15% chance of miscarriage. 1 An increase in maternal age affects the chances of miscarriage. 2  Women under the age of 35 yrs old have about a 15% chance of miscarriage. 3  Women who are 35-45 yrs old have a 20-35% chance of miscarriage. 4  Women over the age of 45 can have up to a 50"}]