[{"url": "http://ra.rx.uga.edu/program_info/clinical_trials_certificate/tuition.php", "passage_text": "Example 1: If a student registers for a three-credit hour class, the cost is estimated at (includes both in-state and out-of-state students): 1  $2,160 - Tuition. 2  $45 - Student Activities Fee. 3  $114 - Technology Fee. 4  $24 - ConnectUGA Fee."}, {"url": "http://www.bursar.uga.edu/Tuition_Fees_2014_2015_Fall.pdf", "passage_text": "For information on housing please visit their website at http://housing.uga.edu/ . For information on food services please visit their website at http://www.uga.edu/foodservice/ University of Georgia Fee Policy http://www.bursar.uga.edu/fee_ policy_fall_2014.pdf."}, {"url": "http://ra.rx.uga.edu/program_info/clinical_trials_certificate/tuition.php", "passage_text": "It is a per credit hour charge. Each student is required to pay the student activities fee; the technology fee; the ConnectUGA fee; the institutional fee; as well as the green fee. These fees cannot be waived and are subject to change. : www.bursar.uga.edu/tuition.html."}, {"url": "http://www.collegecalc.org/colleges/georgia/georgia-state-university/", "passage_text": "Undergraduate Tuition. Georgia State University tuition is $6,490 per year for in-state residents. This is 1% more expensive than the national average public four year tuition of $6,429. The cost is $6,783 and 51% cheaper than the average Georgia tuition of $13,273 for 4 year colleges. Tuition ranks 25th in Georgia amongst 4 year colleges for affordability and is the 50th most expensive 4 year college in the state. If attending from out-of-state, the tuition is $21,058 which represents a 224% premium."}, {"url": "http://www.reg.uga.edu/faqs/tuitionAndFees", "passage_text": "Students can pay their tuition and fees online via their student account. Graduate assistants can use the payroll deduction payment option to pay tuition and fees only. Please refer to the detailed information listed at http://www.bursar.uga.edu/instructions.html."}, {"url": "http://summer.uga.edu/", "passage_text": "The full summer school schedule may be found at www.reg.uga.edu/calendars ». Students are charged per credit hour up to 14 hours; any credit accumulation of 15 hours or more will be charged a flat tuition rate of $4,682 (in-state). The credit hour rate for undergraduate students (in-state) is $312. For complete information on graduate tuition and fees, as well as out-of-state tuition and undergraduate costs, go to www.bursar.uga.edu/tuition."}]