[{"url": "http://chemocare.com/chemotherapy/side-effects/hypocalcemia-low-calcium.aspx", "passage_text": "1 If you have long-standing low blood calcium levels, you may notice no symptoms of hypocalcemia. 2  If you have an acute or sudden drop in your blood calcium level, you may notice more twitching. 3  You may notice, with mildly lowered blood calcium levels, numbness and tingling of your fingers and toes. Calcium is important for healthy bones and teeth, as well as for normal muscle and nerve function. Normal blood calcium levels are maintained through the actions of parathyroid hormone (PTH), your kidneys and intestines. If your blood test results show hypocalcemia, your doctor may check your albumin level as well."}, {"url": "http://chemocare.com/chemotherapy/side-effects/hypocalcemia-low-calcium.aspx", "passage_text": "Hypocalcemia is an electrolyte imbalance and is indicated by a low level of calcium in the blood. The normal adult value for calcium is 4.5-5.5 mEq/L. Calcium is important for healthy bones and teeth, as well as for normal muscle and nerve function. Normal blood calcium levels are maintained through the actions of parathyroid hormone (PTH), your kidneys and intestines. If your blood test results show hypocalcemia, your doctor may check your albumin level as well."}, {"url": "http://www.cancerresearchuk.org/about-cancer/coping-with-cancer/coping-physically/calcium/low-calcium-levels", "passage_text": "Hypocalcaemia (pronounced high-po-kal-seem-ee-ah) means a low calcium level in the blood. It is rare in people with cancer. It can be a temporary side effect of some cancer treatment drugs, such as cisplatin and doxorubicin. The main cause of low calcium levels is having the parathyroid glands in your neck removed. This may be necessary for some types of cancer in the neck area. Or it can occur if the parathyroid glands are damaged during thyroid gland surgery."}, {"url": "http://www.webmd.com/a-to-z-guides/calcium-ca-in-blood", "passage_text": "1 After a kidney transplant. 2  To see if your symptoms may be caused by a very low calcium level in the blood. 3  Such symptoms may include muscle cramps, spasms, and twitching and tingling in the fingers and around the mouth. 4  To see if your symptoms may be caused by a very high calcium level in the blood. They also control the amount of calcium you absorb from food and the amount passed from the body in urine. The blood levels of phosphate are closely linked to calcium levels and they work in opposite ways: As blood calcium levels get high, phosphate levels get low, and the opposite is also true."}, {"url": "http://www.webmd.com/a-to-z-guides/calcium-ca-in-blood", "passage_text": "When blood calcium levels get low (hypocalcemia), the bones release calcium to bring it back to a good blood level. When blood calcium levels get high (hypercalcemia), the extra calcium is stored in the bones or passed out of the body in urine and stool. The amount of calcium in the body depends on the amount of: They also control the amount of calcium you absorb from food and the amount passed from the body in urine. The blood levels of phosphate are closely linked to calcium levels and they work in opposite ways: As blood calcium levels get high, phosphate levels get low, and the opposite is also true."}, {"url": "http://www.webmd.com/a-to-z-guides/calcium-ca-in-blood", "passage_text": "1 To see if your symptoms may be caused by a very low calcium level in the blood. 2  Such symptoms may include muscle cramps, spasms, and twitching and tingling in the fingers and around the mouth. 3  To see if your symptoms may be caused by a very high calcium level in the blood. They also control the amount of calcium you absorb from food and the amount passed from the body in urine. The blood levels of phosphate are closely linked to calcium levels and they work in opposite ways: As blood calcium levels get high, phosphate levels get low, and the opposite is also true."}, {"url": "http://www.merckmanuals.com/home/hormonal-and-metabolic-disorders/electrolyte-balance/hypocalcemia-low-level-of-calcium-in-the-blood", "passage_text": "The calcium level in blood can be moderately low without causing any symptoms. If levels of calcium are low for long periods, people may develop dry scaly skin, brittle nails, and coarse hair. Muscle cramps involving the back and legs are common. In hypocalcemia, the calcium level in blood is too low. A low calcium level may result from a problem with the parathyroid glands, as well as from diet, kidney disorders, or certain drugs."}, {"url": "http://www.webmd.com/a-to-z-guides/calcium-ca-in-blood?page=3", "passage_text": "1 Low blood levels of calcium may be caused by low levels of protein (albumin) in the blood, because about half of all calcium in the blood is attached to albumin. 2  For this reason, an ionized calcium level (which is not attached to albumin) and a blood albumin level may also be measured. Low values. Low values of calcium may be caused by: 1  A low level of the blood protein albumin (hypoalbuminemia). 2  Hypoparathyroidism. 3  High levels of phosphate in the blood, which can be caused by kidney failure, laxative use, and other things."}, {"url": "https://labtestsonline.org/understanding/analytes/calcium/tab/test", "passage_text": "Low total calcium (hypocalcemia). The most common cause of low total calcium is: 1  Low blood protein levels, especially a low level of albumin, which can result from liver disease or malnutrition, both of which may result from alcoholism or other illnesses. 2  Low albumin is also very common in people who are acutely ill"}]