[{"url": "http://www.schoolphysics.co.uk/age14-16/Mechanics/Motion/text/Parachutes_/index.html", "passage_text": "A brief history of parachutes. The first parachute was designed in 1514 by Leonardo da Vinci in Italy, but it was never used. The first man to make and use one was the Frenchman Andre Garnerin who jumped from a balloon over Paris in 1797."}, {"url": "https://en.wikipedia.org/wiki/Parachute", "passage_text": "Round parachutes are purely a drag device (that is, unlike the ram-air types, they provide no lift) and are used in military, emergency and cargo applications. These have large dome-shaped canopies made from a single layer of triangular cloth gores. Wing loading of parachutes is measured similarly to that of aircraft, comparing exit weight to area of parachute fabric. Typical wing loading for students, accuracy competitors, and BASE jumpers is less than one 5 kg per square meter – often 0.3 kilograms per square meter or less."}, {"url": "https://en.wikipedia.org/wiki/Parachute", "passage_text": "A parachute is a device used to slow the motion of an object through an atmosphere by creating drag, or in the case of ram-air parachutes, aerodynamic lift. Parachutes are usually made out of light, strong cloth, originally silk, now most commonly nylon. Depending on the situation, parachutes are used with a variety of loads, including people, food, equipment, space capsules, and bombs. Wing loading of parachutes is measured similarly to that of aircraft, comparing exit weight to area of parachute fabric. Typical wing loading for students, accuracy competitors, and BASE jumpers is less than one 5 kg per square meter – often 0.3 kilograms per square meter or less."}, {"url": "http://www.madehow.com/Volume-5/Parachute.html", "passage_text": "A parachute is a device used to slow the movement of a person or object as it falls or moves through the air. In addition to the fabric canopy, a parachute designed to be used by a person must be equipped with a harness that is worn by the user. Attached to the harness is a container that holds the canopy; often this is a back-pack, but it can also extend low enough for the user to sit on it."}, {"url": "http://www.madehow.com/Volume-5/Parachute.html", "passage_text": "There are two basic types of parachutes. One is a dome canopy made of fabric in a shape that ranges from a hemisphere to a cone; the canopy traps air inside its envelope, creating a region of high pressure that retards movement in the direction opposite the entering air flow. In addition to the fabric canopy, a parachute designed to be used by a person must be equipped with a harness that is worn by the user. Attached to the harness is a container that holds the canopy; often this is a back-pack, but it can also extend low enough for the user to sit on it."}, {"url": "http://www.investopedia.com/terms/g/goldenparachute.asp", "passage_text": "Golden parachutes are contracts given to key executives and can be used as a type of antitakeover measure taken by a firm to discourage an unwanted takeover attempt. Benefits include items such as stock options, cash bonuses, generous severance pay or any combination of these benefits. Golden parachute clauses can be used to define the lucrative benefits that an employee would receive in the event he or she is terminated; however, the term often relates to terminations that result from a takeover or merger."}, {"url": "http://www.investopedia.com/terms/g/goldenparachute.asp", "passage_text": "DEFINITION of 'Golden Parachute'. Substantial benefits given to a top executive (or top executives) in the event that the company is taken over by another firm and the executive is terminated as a result of the merger or takeover. Golden parachute clauses can be used to define the lucrative benefits that an employee would receive in the event he or she is terminated; however, the term often relates to terminations that result from a takeover or merger."}, {"url": "http://adventure.howstuffworks.com/outdoor-activities/running/training/running-parachutes.htm", "passage_text": "In fact, your local track may actually be an ideal venue. Running or speed parachutes are gaining popularity with a host of athletes. The nylon parachutes attach to a harness around your waist or your chest and then expand as you speed up. As the chute expands, it creates drag, forcing you to work harder which, in turn, builds overall strength. Runners using parachutes create wind resistance even on a day when it isn't windy at all"}, {"url": "http://www.schoolphysics.co.uk/age14-16/Mechanics/Motion/text/Parachutes_/index.html", "passage_text": "Parachutes can be guided by letting some of the air spill out of the front or back of the parachute. There is also a hole in the middle to allow the parachute to fall vertically. Parachutes can be circular, the traditional shape, or rectangular the shape used for some military and stunt use. The first parachute was designed in 1514 by Leonardo da Vinci in Italy, but it was never used. The first man to make and use one was the Frenchman Andre Garnerin who jumped from a balloon over Paris in 1797."}, {"url": "http://www.ehow.com/list_7450870_parachutes-used-today_.html", "passage_text": "Airplanes. Believe it or not, some airplanes use parachutes as well. For some, the function is a lot like a drag racer. This is ideal for areas with limited runways, such as an aircraft carrier's deck. There also are some aircraft that use a parachute recovery system to protect them from crashes. Space Travel. Parachutes don't have much use in a vacuum because they require air to actually function; yet, the Apollo capsule was equipped with one. NASA uses parachutes for a similar reason that some airplanes do, for recovery."}]