[{"url": "http://sse.com/whatwedo/ourprojectsandassets/renewables/hunterston/", "passage_text": "Project information. The Hunterston Offshore Wind Turbine Test facility will be the UK’s first onshore test site for offshore wind turbines and will be an extension of SSE’s Glasgow based Centre of Engineering Excellence for Renewable Energy (CEERE). The development of the Hunterston test site has also been supported by invaluable funding from UK government departments – Department of Energy and Climate Change and Department of Business, Innovation and Skills. This funding forms part of the Efficient Offshore Wind Programme."}, {"url": "http://sse.com/beingresponsible/responsiblecommunitymember/localcommunityfunds/hunterston/", "passage_text": "Hunterston. SSE is constructing an offshore wind turbine test facility at Hunterston in North Ayrshire. The facility will be Scotland’s first offshore wind turbine test site and will be an extension of SSE's Glasgow-based Centre of Engineering Excellence for Renewable Energy (CEERE). The Hunterston Community Fund will provide £50,000 per year to community and charitable projects for the 5 year lifespan of the project. Groups in Cumbrae and Largs should apply directly through SSE. Please see below for the application form and guidelines. Applications in the Fairlie area should be made directly to the Fairlie Community Trust."}, {"url": "http://renews.biz/62815/first-power-for-sse-at-hunterston/", "passage_text": "Energy Minister Greg Barker said: “SSE Renewable’s test site for offshore wind turbines is an exciting and innovative project that will help the country take another step towards delivering £110bn investment into our energy sector while helping to support local jobs.”. Image: SSE. Siemens Wind Power managing director for offshore in the UK Clark MacFarlane added: “We are delighted with the news of first power for our 6MW turbine at Hunterston. This is another important milestone for our next generation wind turbine technology.”."}, {"url": "http://www.scottish-enterprise.com/~/media/se/resources/documents/ghi/hunterston%20offshore%20turbine%20test%20site%20technical%20summary.pdf", "passage_text": "The test facility is located on the redundant marine construction yard in Hunterston, North Ayrshire The site has been jointly developed by Scottish and Southern Energy (SSE) and Scottish Enterprise (SE). The site is currently in construction and will be operational by the end of 2013. Site Facilities The site will include a secure site operations building. This will include a secure SCADA room with dedicated access for the SE test berth operatives. In addition, site offices and welfare facilities will be available."}, {"url": "http://sse.com/whatwedo/ourprojectsandassets/renewables/hunterston/", "passage_text": "The project, the UK’s first onshore test site for offshore turbines, was consented in February 2012. The facility will be an extension of SSE's Glasgow-based Centre of Excellence for Renewable Energy (CEERE). Construction began in March 2013 with RJ McLeod as the appointed Principal Contractor. The development of the Hunterston test site has also been supported by invaluable funding from UK government departments – Department of Energy and Climate Change and Department of Business, Innovation and Skills. This funding forms part of the Efficient Offshore Wind Programme."}, {"url": "http://www.east-ayrshire.gov.uk/Resources/PDF/H/Hunterston-off-site-emergency-plan-redacted-version.pdf", "passage_text": "Off-Site Nuclear Emergency On receipt of advice of an Off-Site Nuclear Emergency at Hunterston “B” Nuclear Power Station or Hunterston “A” Decommissioning Site from the Police, Network Rail Control will activate the relevant section of the Network Rail Emergency Plan. The normal roles and responsibilities of the Police encompass the protection of life and property. In responding to an incident at Hunterston “B” Nuclear Power Station and Hunterston “A” Decommissioning Site, the Police responsibilities can be summarised as follows: 1."}, {"url": "http://www.scottish-enterprise.com/~/media/se/resources/documents/ghi/hunterston%20offshore%20turbine%20test%20site%20technical%20summary.pdf", "passage_text": "The test berth has a maximum export capacity of 8 MW and a Power Purchase Agreement with SSE for all energy generated. Site Facilities The site will include a secure site operations building. This will include a secure SCADA room with dedicated access for the SE test berth operatives. In addition, site offices and welfare facilities will be available. Access to the site The site has a dedicated quayside access for direct sea deliveries of turbine components"}, {"url": "http://www.bbc.co.uk/news/uk-scotland-glasgow-west-12937177", "passage_text": "Image caption The Hunterston site could test up to three prototype offshore turbines. Power firm Scottish and Southern Energy (SSE) has announced plans to develop an offshore wind turbine testing facility in North Ayrshire. The Perth-based group wants to set up a facility at Clydeport's Hunterston site to test up to three prototypes for the next generation of offshore turbines. The proposed new facility, which has the backing of economic development agency Scottish Enterprise, will be an extension of SSE's Glasgow-based Centre of Engineering Excellence for Renewable Energy."}, {"url": "http://www.scottish-enterprise.com/~/media/se/resources/documents/ghi/hunterston%20offshore%20turbine%20test%20site%20technical%20summary.pdf", "passage_text": "Hunterston Offshore Wind Turbine Test Facility Test berth available at a state of the art test facility for offshore wind turbines The Hunterston site is a dedicated facility for testing next generation offshore wind turbines. Site Facilities The site will include a secure site operations building. This will include a secure SCADA room with dedicated access for the SE test berth operatives. In addition, site offices and welfare facilities will be available."}]