[{"url": "http://www.archives.gov/exhibits/charters/constitution_amendments_11-27.html", "passage_text": "This article shall be inoperative unless it shall have been ratified as an amendment to the Constitution by the legislatures of three-fourths of the several States within seven years from the date of its submission to the States by the Congress. Passed by Congress June 16, 1960. Ratified March 29, 1961. Section 1. This article shall be inoperative unless it shall have been ratified as an amendment to the Constitution by conventions in the several States, as provided in the Constitution, within seven years from the date of the submission hereof to the States by the Congress. Passed by Congress March 21, 1947."}, {"url": "http://constitution.laws.com/american-history/constitution/constitutional-amendments/21st-amendment", "passage_text": "The 21st Amendment was ratified on December 5th, 1933 and was the only Amendment to be ratified by state ratifying conventions rather by state legislature, which would mark the prohibition repeal. "}, {"url": "http://www.answers.com/Q/What_is_the_only_amendment_to_be_ratified_and_repealed", "passage_text": "921,608 Contributions. The only constitutional amendment that has been repealed is the  18th amendment. The 18th amendment was ratified on January 16, 1919  and established the prohibition of alco … hol, making the production,  transport and sale of alcohol illegal. "}, {"url": "https://en.wikipedia.org/wiki/Twenty-first_Amendment_to_the_United_States_Constitution", "passage_text": "Section 3. This article shall be inoperative unless it shall have been ratified as an amendment to the Constitution by conventions in the several States, as provided in the Constitution, within seven years from the date of the submission hereof to the States by the Congress. It is also the only amendment that was approved for the explicit purpose of repealing a previously existing amendment to the Constitution. The Twenty-first Amendment ending national prohibition became officially effective on December 15, though people started drinking openly before that date."}, {"url": "http://law2.umkc.edu/faculty/projects/ftrials/conlaw/articleV.htm", "passage_text": "This first method of amendment is the only one used to date. Second, the Constitution might be amended by a Convention called for this purpose by two-thirds of the state legislatures, if the Convention's proposed amendments are later ratified by three-fourths of the state legislatures. "}, {"url": "http://www.answers.com/Q/Which_amendment_to_the_Constitution_was_later_repealed_by_another_amendment", "passage_text": "The only amendment to the US Constitution to be repealed was the 18th Amendment. It was repealed by the 21st Amendment. The 18th Amendment, known as Prohibition, prohibited the manufacture and sale of alcohol. "}, {"url": "https://en.wikipedia.org/wiki/Twenty-first_Amendment_to_the_United_States_Constitution", "passage_text": "Amendment XXI in the National Archives. The Twenty-first Amendment (Amendment XXI) to the United States Constitution repealed the Eighteenth Amendment to the United States Constitution, which had mandated nationwide Prohibition on alcohol on January 17, 1920. The Twenty-first Amendment was ratified on December 5, 1933. It is also the only amendment that was approved for the explicit purpose of repealing a previously existing amendment to the Constitution. The Twenty-first Amendment ending national prohibition became officially effective on December 15, though people started drinking openly before that date."}, {"url": "http://www.constitutionfacts.com/us-constitution-amendments/proposed-amendments/", "passage_text": "An amendment may be proposed by a two-thirds vote of the House of Representatives and the Senate or a national convention called by Congress at the request of 2/3 of the state legislatures. The latter procedure has never been used. The amendment may then be ratified by 3/4 of the state legislatures (38 states) or special conventions called in 3/4 of the states. The 21st amendment was the only one to be adopted in this way. However, it is the power of Congress to decide which method of ratification will be used"}, {"url": "http://www.ushistory.org/documents/amendments.htm", "passage_text": "Section 3. This article shall be inoperative unless it shall have been ratified as an amendment to the Constitution by the legislatures of the several States, as provided in the Constitution, within seven years from the date of the submission hereof to the States by the Congress. January 16, 1919. "}]