[{"url": "http://www.enotes.com/homework-help/how-did-siam-modern-day-thailand-manage-avoid-138177", "passage_text": "(Answer #1). Of all the countries in Southeast Asia, Siam (or Thailand) was the only one to avoid being colonized by a European power. The British colonized Burma, the French colonized Indochina, but Siam remained independent."}, {"url": "http://www.answers.com/Q/Why_was_Ethiopia_able_to_avoid_colonization", "passage_text": "Ethiopia was never colonized. Italy attempted to colonize Ethiopia, but us Ethiopians fought back! Ethiopia beat Italy and did NOT get colonized, EVER. Ethiopia is the only country in Africa that has never gotten colonized by another country. The reason Ethiopia was never colonized was because under a centralized governmen … t by Menelik the II, Ethiopians had attained guns and had a well organized military and went to battle in a structured way."}, {"url": "http://www.city-data.com/forum/africa/1598486-how-ethiopia-able-avoid-colonization.html", "passage_text": "It had its own dynasty that can be traced back to King Solomon. Ethiopia, was not known to be a poor country by any means back in history (there is also a long history between Ethiopians, Jews, Indians, Chinese, and the French as well as Armenia (etc), a lot of Armenians left their country for Ethiopia). I'm not sure the history of Eritrea vs Ethiopia, but I'd imagine it had something to do with Italy building that city, and people later dividing into two countries, possibly for some related reasons. Quote: Originally Posted by Joy74. Were the Europeans simply not interested, or did they try and fail."}, {"url": "http://www.answers.com/Q/Why_was_Thailand_never_colonized_by_foreign_Powers", "passage_text": "Ethiopia and Liberia are the only African countries that were never colonized. It's true that the American Colonization Society BOUGHT land in Liberia to settle free slaves bu … t there was no white rule. Thailand is the only one country in South East Asia that had not been colonized by any Europeans. This is why Thailand prides itself on being the only country in S … outheast Asia, which was not colonized by the European powers."}, {"url": "http://www.answers.com/Q/Why_was_Ethiopia_able_to_avoid_colonization", "passage_text": "Ethiopia was never colonized by ANY European country. Italy tried twice to colonize Ethiopia. The reason Ethiopia was never colonized was because under a centralized governmen … t by Menelik the II, Ethiopians had attained guns and had a well organized military and went to battle in a structured way."}, {"url": "https://en.wikipedia.org/wiki/Scramble_for_Africa", "passage_text": "It is also called the Partition of Africa and the Conquest of Africa. In 1870, only 10 percent of Africa was under European control; by 1914 it had increased to 90 percent of the continent, with only Abyssinia (Ethiopia) and Liberia still being independent. The only colony the United States had claim to was Liberia which was established by the American Colonization Society on January 7, 1822. The Berlin Conference of 1884, which regulated European colonization and trade in Africa, is usually referred to as the starting point of the Conquest of Africa."}, {"url": "http://imperialism-period5.wikispaces.com/Italy+and+Africa", "passage_text": "Italy was able to take Somaliland, but Menelik II, the ruler of Ethiopia, was able to hold them off. Menelik II had u This is a close up of Eritrea, Ethiopia, and Somalia in Eastern Africa nited the formerly fragmented Ethiopia, and had looked to modernize it. Italy attempted to invade the kingdom of Ethiopia in 1896, but King Menelik II had previously hired European officers to train the Ethiopian military, and Ethiopia became the first African nation to successfully resist colonization (Ellis 624)."}, {"url": "http://www.answers.com/Q/Why_was_Ethiopia_able_to_avoid_colonization", "passage_text": "Ethiopia is one of the only countries to have never lost its Independence. Other than the brief period when the Italians invaded, Ethiopia was never colonized. The reason that … the British didn't take over the country after ww1 was that Ethiopia was a member of the League of Nations. The reason Ethiopia was never colonized was because under a centralized governmen … t by Menelik the II, Ethiopians had attained guns and had a well organized military and went to battle in a structured way."}, {"url": "http://www2.sunysuffolk.edu/westn/imperialism.html", "passage_text": "The only remaining areas of Africa not colonized by the end of the century were Ethiopia in the horn of Africa and Liberia on the Atlantic coast. Another aspect of European expansion in the last half of the 19th century involved the emigration of large numbers of Europeans to other parts of the world. "}]