[{"url": "http://www.columbiascrealestatesales.com/", "passage_text": "Columbia SC Real Estate Market. The Columbia SC real estate market and Columbia Property prices offer a range to suit anyone's real estate needs. Average Columbia SC homes for sale can range from $125,000 to $275,000 depending on the area. Irmo Real Estate offers lake front homes for sale on Lake Murray. Historic downtown Columbia SC homes might be more your style of city living. like stylish one of a kind homes for sale in Shandon, Elmwood Park, Forest Hills or Heathwood."}, {"url": "http://www.sciway.net/city/columbia.html", "passage_text": "Columbia is located in the center of South Carolina at the junctions of Interstates 20, 26 and 77. It is South Carolina's most populated city, the state capital, the county seat of Richland County, the home of the University of South Carolina 's main campus, and the site of the South Carolina State Fair each October. A small part of Columbia also extends into Lexington County. Here is a map of the Columbia area. Columbia was settled by Europeans in the early 1700s and chosen to be the site of the new South Carolina state capital in 1786. It was chartered as a town in 1805 and as a city in 1854. Columbia was named for Christopher Columbus, and it was South Carolina's first planned city (wide streets arranged in a grid pattern) and the second planned city in the United States (Savannah was the first). Despite this, Columbia did not have a single paved street until Main Street was surfaced in 1908."}, {"url": "http://columbiasouthcarolina.com/", "passage_text": "Today, the Columbia Metropolitan Area is home to over 200 years of history, beautiful Lake Murray, the University of South Carolina, the Army's largest training base at Fort Jackson, numerous festivals and recreational opportunities. Hello and Welcome from Mel Coker... I'm ready to help you with your real estate needs in the Midlands of South Carolina -- Columbia, Lexington, Fort Jackson, Irmo, Chapin, Lake Murray."}, {"url": "https://en.wikipedia.org/wiki/Columbia,_South_Carolina", "passage_text": "Columbia is home to the University of South Carolina, the state's flagship and largest university, and is also the site of Fort Jackson, the largest United States Army installation for Basic Combat Training. Columbia is also combined with the Orangeburg and Newberry micropolitan areas to form the Columbia–Orangeburg-Newberry Combined Statistical Area, which has 928,368 people according to the 2013 Census estimates and is the second-largest CSA in South Carolina."}, {"url": "https://en.wikipedia.org/wiki/Columbia,_South_Carolina", "passage_text": "The name Columbia was a poetic term used for the United States, originating from the name of Christopher Columbus. The city is located approximately 13 miles (21 km) northwest of the geographic center of South Carolina, and is the primary city of the Midlands region of the state. Columbia is also combined with the Orangeburg and Newberry micropolitan areas to form the Columbia–Orangeburg-Newberry Combined Statistical Area, which has 928,368 people according to the 2013 Census estimates and is the second-largest CSA in South Carolina."}, {"url": "http://columbiasouthcarolina.com/", "passage_text": "Comments? Please send them to: coker@columbiasouthcarolina.com A website by Mel Coker Columbia, South Carolina Information | Columbia SC Mel Coker, Realtor-RE/MAX Real Estate Consultants Columbia-Lexington-Irmo-Chapin-Northeast Columbia-Lake Murray-Columbia SC schools. Hello and Welcome from Mel Coker... I'm ready to help you with your real estate needs in the Midlands of South Carolina -- Columbia, Lexington, Fort Jackson, Irmo, Chapin, Lake Murray."}, {"url": "http://www.columbiacvb.com/things-to-do/attractions/", "passage_text": "Attractions in Columbia, SC. Columbia, South Carolina area attractions are easy to find lying at the confluence of three rivers just downstream from a 50,000-acre recreational lake. South Carolina State House. The South Carolina State House overlooks downtown Columbia, SC’s Main Street and is a must-see on any trip. The copper Greek Revival dome and Corinthian columns adorn the structure, while six stars mark where Union cannonballs struck the building during the Civil War."}, {"url": "https://en.wikipedia.org/wiki/Columbia,_South_Carolina", "passage_text": "Columbia is the capital of and largest city in the U.S. state of South Carolina, with a population of 129,272 as of the 2010 United States Census. Columbia is also combined with the Orangeburg and Newberry micropolitan areas to form the Columbia–Orangeburg-Newberry Combined Statistical Area, which has 928,368 people according to the 2013 Census estimates and is the second-largest CSA in South Carolina."}, {"url": "http://www.columbiascrealestatesales.com/", "passage_text": "We serve Columbia SC, Lake Murray, Lexington, Irmo and Northeast Columbia areas. We provide immediate full time assistance, honesty and flexibility. Rest assured we can help you with any Columbia SC real estate need from first time home buyers, a lake front home on Lake Murray or quiet subdivision in Irmo. Irmo Real Estate offers lake front homes for sale on Lake Murray. Historic downtown Columbia SC homes might be more your style of city living. like stylish one of a kind homes for sale in Shandon, Elmwood Park, Forest Hills or Heathwood."}]