[{"url": "http://www.jwsuretybonds.com/info/videos/general/what-are-surety-bonds.htm", "passage_text": "Surety Bond Definition: A guarantee made by an insurance carrier (bonding company backing the bond) that is a hybrid of insurance and credit. It is a form of insurance to the obligee (party requiring the bond protection), as they are the beneficiary that can file a claim if the bond's promise is not met. What your bond guarantees is dependent on the bond type and the bond form’s language. While it is extremely important to understand what your bond is guaranteeing, it is beyond the scope of this article. There are thousands of different bond forms for a variety of bond types required throughout the country."}, {"url": "http://www.businessdictionary.com/definition/surety.html", "passage_text": "surety. 1. Person or firm (such as a bank, bonding company, insurance company) that agrees to be primarily liable for the conduct, obligation, or performance of another. If you don't have a good enough credit score for the loan look for a surety to get on your side so the bank will loan you. 7 people found this helpful. The surety was in place to assuage our stress about entering into the mildly risky business dealing."}, {"url": "https://en.wikipedia.org/wiki/Surety", "passage_text": "(November 2010). In finance, a surety, surety bond or guaranty involves a promise by one party to assume responsibility for the debt obligation of a borrower if that borrower defaults. The person or company providing this promise is also known as a surety or as a guarantor. The surety transaction will typically involve a producer; in the United States the National Association of Surety Bond Producers (NASBP) is a trade association which represents this group."}, {"url": "https://www.suretybonds.com/what-is-a-surety-bond.html", "passage_text": "Definition: sur•e•ty bond. A surety bond is a contractual agreement between a project owner or business guaranteeing that the project will be completed or business regulations will be followed. or Request your FREE Surety Bond Quote online now. "}, {"url": "http://www.jwsuretybonds.com/info/videos/general/what-are-surety-bonds.htm", "passage_text": "A Surety Definition Everyone Can Understand. The simplest way to define surety bond is insurance for them, paid and backed by you. Surety bonds are an insurance policy for the party requiring the bonds, called the obligee. In most instances, the obligee is a government agency and the bond is in place to protect the government and its citizens. What your bond guarantees is dependent on the bond type and the bond form’s language. While it is extremely important to understand what your bond is guaranteeing, it is beyond the scope of this article. There are thousands of different bond forms for a variety of bond types required throughout the country."}, {"url": "https://www.suretybonds.org/faqs", "passage_text": "While there are many varieties, a surety bond is essentially an agreement between three parties–a principal, an obligee and a surety –assuring them all that something will happen. In general, surety bonds protect consumers and hiring parties, also known as the obligees, from fraud, abuse and penalties. "}, {"url": "http://www.merriam-webster.com/dictionary/surety", "passage_text": "Full Definition of SURETY. 1. : the state of being sure: as a: sure knowledge: certainty b: confidence in manner or behavior: assurance. 2. a: a formal engagement (as a pledge) given for the fulfillment of an undertaking: guarantee b: a basis of confidence or security. law: money that you give as a guarantee that you will do what you are legally required to do (such as to appear in court). law: someone who agrees to be legally responsible if another person fails to pay a debt or to perform a duty."}, {"url": "http://www.definitions.net/definition/surety", "passage_text": "Surety. A surety, surety bond or guaranty, in finance, is a promise by one party to assume responsibility for the debt obligation of a borrower if that borrower defaults. The person or company that provides this promise, is also known as a surety or guarantor. A surety, surety bond or guaranty, in finance, is a promise by one party to assume responsibility for the debt obligation of a borrower if that borrower defaults"}]