[{"url": "https://answers.yahoo.com/question/index?qid=20100723114828AAAiuoQ", "passage_text": "Best Answer: By information it means that in the DNA, there is information in their for the blue prints of proteins. The information is in DNA by means of the nucleotides A, T, G, and C which can be read by other proteins to and transcribed into mRNA which is then translated into functioning proteins."}, {"url": "http://science.howstuffworks.com/life/cellular-microscopic/dna4.htm", "passage_text": "­DNA carr­ies all of the information for your physical characteristics, which are essentially determined by proteins. So, DNA contains the instructions for making a protein. In DNA, each protein is encoded by a gene (a specific sequence of DNA nucleotides that specify how a single protein is to be made)."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20090315093145AAJu88E", "passage_text": "DNA is the 'blueprint' to create, maintain and then reproduce the species in which it is carried. The genetic code is the order of four bases adenine, cytosine, guanine and thymine. Usually these are converted into another molecule similar to DNA called messenger RNA by a process called transcription."}, {"url": "http://www.answers.com/Q/What_type_of_information_does_DNA_carry", "passage_text": "A nucleus of a cell contains chromosomes that carry genetic  information. Chromosomes are made from long, coiled molecules of  DNA. A gene is a shorter region of DNA that ca … rries the genetic  code for a particular characteristic."}, {"url": "http://www.nature.com/scitable/topicpage/ribosomes-transcription-and-translation-14120660", "passage_text": "In most multicellular organisms, every cell carries the same DNA, but this genetic information is used in varying ways by different types of cells. In other words, what a cell does within an organism dictates which of its genes are expressed."}, {"url": "http://www.answers.com/Q/Does_DNA_carry_the_genetic_material", "passage_text": "A nucleus of a cell contains chromosomes that carry genetic  information. Chromosomes are made from long, coiled molecules of  DNA. A gene is a shorter region of DNA that ca … rries the genetic  code for a particular characteristic."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20090315093145AAJu88E", "passage_text": "The code is carried by the mRNA to the nucleus where it is then read and turned into protein chain in a process called translation. On the whole, then DNA carries the information to produce proteins."}, {"url": "http://www.bbc.co.uk/schools/gcsebitesize/science/ocr_gateway_pre_2011/ourselves/6_gene_control1.shtml", "passage_text": "The nucleus of a cell contains chromosomes, which carry genetic information in a long molecule called DNA. Genes are regions of DNA that carry the code to control a particular cell activity or the production of a particular protein."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20090315093145AAJu88E", "passage_text": "Report Abuse. It does carry hereditary information via the chromosomes. Genes to be translated into proteins that make you the way you are. DNA also contains a bunch of junk, called pseudogenes in eukaryotes."}, {"url": "http://science.howstuffworks.com/life/cellular-microscopic/dna4.htm", "passage_text": "The particular sequence of amino acids in the chain is what makes one protein different from another. This sequence is encoded in the DNA where one gene encodes for one protein. The genetic code consists of 3-base words or codons that specify particular amino acids."}]