[{"url": "https://en.wikipedia.org/wiki/Ebers_Papyrus", "passage_text": "The Ebers Papyrus is written in hieratic Egyptian writing and preserves for us the most voluminous record of ancient Egyptian medicine known. The papyrus was written in about 1500 BC, but it is believed to have been copied from earlier texts. The Ebers Papyrus is a 110-page scroll, which is about 20 meters long."}, {"url": "http://medical-dictionary.thefreedictionary.com/Ebers+papyrus", "passage_text": "Ebers papyrus-Egyptian papyrus from the 16th century B.C., which covered many aspects of medicine, including diabetes mellitus, trachoma, different forms of arthritis; many remedies were discussed as well. "}, {"url": "https://simple.wikipedia.org/wiki/Ebers_papyrus", "passage_text": "The Ebers Papyrus (c. 1550 BC) is an ancient Egyptian medical treatise. It covers both practical and magical advice. There are over 700 different drugs described in the papyrus. Some are useful such as opium for pain. Other things in the papyrus can seem ridiculous. "}, {"url": "http://toxipedia.org/display/toxipedia/Ebers+Papyrus", "passage_text": "Overview. The Ebers Papyrus (approximately 1500 BCE), one of the two oldest maintained medical documents, preserved for us most extensive record of Egyptian medical history. In it, the Egyptians show a degree of knowledge of the workings of the human body, its structure, the job of the heart and blood vessels"}, {"url": "http://www.crystalinks.com/egyptmedicine.html", "passage_text": "The Ebers Papyrus, also known as Papyrus Ebers, is an Egyptian medical papyrus dating to circa 1550 BC. Among the oldest and most important medical papyri of ancient Egypt, it was purchased at Luxor, (Thebes) in the winter of 1873 74 by Georg Ebers. The Edwin Smith Papyrus dates to Dynasties 16-17 of the Second Intermediate Period. Egypt was ruled from Thebes during this time and the papyrus is likely to have originated from there. Edwin Smith purchased in Luxor, Egypt in 1862, from an Egyptian dealer named Mustafa Agha."}, {"url": "http://sghshistoryofmedicine.wikispaces.com/The+Ebers+papyrus", "passage_text": "Ebers Papyrus. Ebers papyrus is considered the most important medicinal papyrus of ancient Egypt contributing to today’s western medicine and giving a broader knowledge as to how medicine was used in the Ancient World. "}, {"url": "https://en.wikipedia.org/wiki/Ebers_Papyrus", "passage_text": "The Ebers Papyrus, also known as Papyrus Ebers, is an Egyptian medical papyrus of herbal knowledge dating to c. 1550 BC. The papyrus was written in about 1500 BC, but it is believed to have been copied from earlier texts. The Ebers Papyrus is a 110-page scroll, which is about 20 meters long."}, {"url": "http://www.newworldencyclopedia.org/p/index.php?title=Ebers_Papyrus", "passage_text": "Ebers Papyrus treatment for cancer: recounting a  tumor against the god Xenus, it recommends do thou nothing there against. Ebers Papyrus is a preserved medical document from ancient Egypt, traced to about 1550. Longer and more complete than the Edwin Smith Papyrus, and about as old (the Edwin Smith Papyrus is dated to about 1600. ), it is a collection of diverse medical texts that offers the most complete record of Egyptian medicine. The Ebers Papyrus is written in hieratic Egyptian writing, which is somewhat like a cursive form of hieroglyphics (Carpenter et al. 1998). The text has some 877 section headings (rubrics) in red ink and intervening text in black"}, {"url": "https://en.wikipedia.org/wiki/Ebers_Papyrus", "passage_text": "The Ebers Papyrus (c. 1550 BC) from Ancient Egypt. The Ebers Papyrus, also known as Papyrus Ebers, is an Egyptian medical papyrus of herbal knowledge dating to c. 1550 BC. Among the oldest and most important medical papyri of ancient Egypt, it was purchased at Luxor (Thebes) in the winter of 1873–74 by Georg Ebers. It is currently kept at the library of the University of Leipzig, in Germany. The papyrus was written in about 1500 BC, but it is believed to have been copied from earlier texts. The Ebers Papyrus is a 110-page scroll, which is about 20 meters long."}]