[{"url": "http://www.misscathie.com/2012/01/cashmere-the-quest-for-clean/", "passage_text": "Gently squeeze out any excess water. Do not wring the garment. Put the garment into a wash bag or pillow case and spin out any remaining excess water using the spin cycle on your washing machine. You can also place the sweater flat on a clean dry towel and roll it up, applying pressure to squeeze out any excess water. To dry, place the sweater flat on another clean, dry towel, pulling the garment into shape. When dry, pick off any pills or yarn balls. Gently steam the garment to shape. Steam through the sweater to lift the top surface – do not directly iron and press the sweater, which could scorch the surface. To be safe, use a clean damp cloth over the sweater when you steam. Leave in an airy place to dry and cool."}, {"url": "http://www.howmuchisit.org/dry-cleaning-cost/", "passage_text": "1 Through most dry cleaning services, dry cleaning prices are going to vary because the cost really depends on what needs to be dry cleaned. 2  For instance, a bed comforter is going to cost a lot more than a shirt. With dry cleaning, the process begins with the pre-treatment of stains and dirt using a specific cleaning agent. Then, the garments are loaded into a machine to remove embedded dirt. Once the dirt is removed, the clothes are drained using a centrifugal force until no residual solvent odor can be traced in the garments."}, {"url": "http://www.answers.com/Q/How_much_does_it_cost_to_dry_clean_a_sweater", "passage_text": "How much does it cost to dry clean a leather jacket? Well, it depends on the amount of leather and material of the jacket. I took mine with leather arms, and it cost me $45; it can vary from $40 and up, hope this gives you an id … ea. still kind of expensive..   Next time try going to a laundromat and washing and drying it. Industry experts recommend washing as opposed to dry cleaning. Dry cleaning can damage the down and leave chemicals in the comforter."}, {"url": "http://www.drycleanerssecret.com/products/comparison.htm", "passage_text": "Men's Dress Shirts. At an average cost of $1.50, the Dry Cleaner is ideal for men's button down dress shirts. In fact, the shirts are not dry cleaned, but are instead washed, then pressed and starched. Speaking of pressing, you may think that you will have to iron all of your clothes if you dry clean them at home, but that isn t so. Stains. Your neighborhood dry cleaner is the stain remover expert for your dry cleanable clothing, and even he can t remove everything. So take your set-in stains and ground-in cuff and collar soil to the dry cleaner to remove, but for fresh stains less than the size of a dime, use DRY CLEANER S SECRET."}, {"url": "http://www.answers.com/Q/How_much_does_it_cost_to_dry_clean_a_sweater_in_bay_area", "passage_text": "I just took 2 queen sized down comforters to a green dry cleaners-and it cost $75 for the both of them! I was surprised how expensive it was, I think that if you just go to … a regular dry cleaner it would probably cost $25-$30 a blanket... still kind of expensive..   Next time try going to a laundromat and washing and drying it."}, {"url": "http://thegreenbacksgal.com/spring-cleaning-wash-your-wool-sweaters/", "passage_text": "I am suggesting you hand wash your wool or cashmere sweaters. I know they have a “Dry Clean” only tag on them. But, if the first material listed on your sweater is either “wool” or “cashmere” be assured they can be safely hand washed. I put a little soap directly on it and just gently try to work it off. Drain the water and refill the sink with the same cool temperature water. Squeeze the sweater to get the soap out. Repeat as often as necessary."}, {"url": "http://www.yelp.com/topic/philadelphia-what-is-a-good-price-for-dry-cleaning-in-philadelphia", "passage_text": "I was just thinking about it, and thinking of the dry cleaner I recently reviewed, and I have absolutely no sense of what is the going rate for dry cleaning. Generally, I get shirts done once a week, sweaters every 3 wears, and pants every 3 weeks (3-4 wears), and occasionally a suit every 2 months or so. I'd say I average about $35 a trip for 6 shirts, 4 pairs of pants and a sweater. Is that reasonable? I've been paying it because I don't know any better"}, {"url": "http://www.answers.com/Q/How_much_does_it_cost_to_dry_clean_a_sweater", "passage_text": "I just took 2 queen sized down comforters to a green dry cleaners-and it cost $75 for the both of them! I was surprised how expensive it was, I think that if you just go to … a regular dry cleaner it would probably cost $25-$30 a blanket... still kind of expensive..   Next time try going to a laundromat and washing and drying it. Industry experts recommend washing as opposed to dry cleaning. Dry cleaning can damage the down and leave chemicals in the comforter."}, {"url": "http://drycleanersatlanta.com/2013/05/how-much-should-you-pay-for-dry-cleaning/", "passage_text": "Average Dry Cleaning Prices. On average, dry cleaning can cost anywhere from $1 to $5 per shirt and up. In most cases, this will depend on where the dry cleaners is located, if they are busy with other orders to fulfill and if they iron your apparel in addition to cleaning them. Dry cleaning costs can vary from one location to the next and may also depend on exactly what you’re having cleaned that day. Recently, you may even see dry cleaners offering outstanding deals due to drastic decreases in the number of people who opt to have their clothes dry cleaned on a regular basis."}, {"url": "http://www.answers.com/Q/How_much_does_it_cost_to_dry_clean_a_sweater_in_bay_area", "passage_text": "How much does it cost to dry clean a leather jacket? Well, it depends on the amount of leather and material of the jacket. I took mine with leather arms, and it cost me $45; it can vary from $40 and up, hope this gives you an id … ea. I was surprised how expensive it was, I think that if you just go to … a regular dry cleaner it would probably cost $25-$30 a blanket... still kind of expensive..   Next time try going to a laundromat and washing and drying it."}]