[{"url": "http://www.everydayhealth.com/digestive-health/diarrhea-treatment.aspx", "passage_text": "It's also important to remember that diarrhea treatments for adults, especially medication, may not be the same for children with diarrhea, so always check with your pediatrician before giving your children any medication. If you do have diarrhea, here are three ways you can ease your discomfort."}, {"url": "http://www.wikihow.com/Cure-Diarrhea", "passage_text": "Drink water and other fluids to restore vitamins and minerals. When you have diarrhea, your body sheds fluids that contain necessary vitamins and minerals. It is important to get those minerals back in fluids, especially water and sports drinks. 1  Combatting dehydration is your primary medical concern with diarrhea."}, {"url": "http://www.wikihow.com/Cure-Diarrhea", "passage_text": "Though effective as a base to help treat diarrhea, the BRAT diet is not a well-balanced diet. Saltine crackers, boiled potatoes, clear soups, skinless baked chicken, cooked carrots, and other somewhat bland food choices can also help while you’re still experiencing an upset stomach. 1  Some people may also try yogurt."}, {"url": "http://www.wikihow.com/Cure-Diarrhea", "passage_text": "Diarrhea is not a condition: it is a symptom of another health issue, such as an infection or a virus. It can also be a reaction to food allergies, medications, protozoans (10%-15% of cases), viruses (50%-70% of cases), or bacteria (15%-20% of cases) in food or water."}, {"url": "http://www.everydayhealth.com/digestive-health/diarrhea-treatment.aspx", "passage_text": "If loose stools are a problem, then you may want to avoid these foods. If you suspect your diarrhea is caused by a certain food, try an elimination diet. Cut the suspected food from your diet until you can determine whether or not it is a problem. If it's not the problem, feel free to keep eating that food."}, {"url": "https://healthychildren.org/English/health-issues/conditions/abdominal/Pages/Diarrhea.aspx", "passage_text": "Most children with mild diarrhea can continue to eat a normal diet including formula or milk. Breastfeeding can continue. If your baby seems bloated or gassy after drinking cow's milk or formula, call your pediatrician to discuss a temporary change in diet. Special fluids for mild illness are not usually necessary."}, {"url": "http://www.top10homeremedies.com/how-to/how-to-get-rid-of-diarrhea.html", "passage_text": "1 You can also drink ginger tea two to three times a day to cure diarrhea. 2  Slice one small piece of ginger and add them to one cup of water. 3  Boil the water for a few minutes, strain it and add some honey before drinking it. 4  If fresh ginger is not available, you can use powdered ginger from your spice rack."}]