[{"url": "http://www.answers.com/Q/What_is_measured_using_a_calorimeter", "passage_text": "a device for measuring changes in thermal energy A calorimeter is a device used for calorimetry, the science of measuring the heat of chemical reactions or physical changes … as well as heat capacity. The word calorimeter is derived from the Latin word calore, meaning heat. A calorimeter is a device used to measure the heat levels produced by chemical reactions. Bomb calorimeters are heavy-duty devices to withstand greater levels of heat combust … ion and pressure. Bomb calorimeters are used in many industries such as the oil and gas industry or food industry. 1 person found this useful."}, {"url": "http://www.dartmouth.edu/~chemlab/techniques/calorimeter.html", "passage_text": "Calorimetry. Calorimetry is used to determine the heat released or absorbed in a chemical reaction. The calorimeters shown here can determine the heat of a solution reaction at constant (atmospheric) pressure. The calorimeter is a double styrofoam cup fitted with a plastic top in which there is a hole for a thermometer"}, {"url": "https://en.wikipedia.org/wiki/Calorimetry", "passage_text": "Calorimetry is the science or act of measuring changes in state variables of a body for the purpose of deriving the heat transfer associated with changes of its state due for example to chemical reactions, physical changes, or phase transitions under specified constraints. Calorimetry is performed with a calorimeter. Heat generated by living organisms may also be measured by direct calorimetry, in which the entire organism is placed inside the calorimeter for the measurement. A widely used modern instrument is the differential scanning calorimeter, a device which allows thermal data to be obtained on small amounts of material."}, {"url": "http://hyperphysics.phy-astr.gsu.edu/hbase/thermo/calor.html", "passage_text": "Calorimetry. Calorimetry is the measurement of the quantity of heat exchanged. For example, if the energy from an exothermic chemical reaction is absorbed in a container of water, the change in temperature of the water provides a measure of the amount of heat added."}, {"url": "http://www.answers.com/Q/What_is_measured_using_a_calorimeter", "passage_text": "1 A calorimeter is an object used for calorimetry, or the process of measuring the heat of chemical reactions or physical changes as well as heat capacity. A calorimeter is a device used to measure the heat levels produced by chemical reactions. Bomb calorimeters are heavy-duty devices to withstand greater levels of heat combust … ion and pressure. Bomb calorimeters are used in many industries such as the oil and gas industry or food industry. 1 person found this useful."}, {"url": "http://www.answers.com/Q/What_is_measured_using_a_calorimeter", "passage_text": "1 Heat is measured using calorimeter. 2  A calorimeter is an object used for calorimetry, or the process of measuring the heat of chemical reactions or physical changes as well as heat capacity. A calorimeter is a device used to measure the heat levels produced by chemical reactions. Bomb calorimeters are heavy-duty devices to withstand greater levels of heat combust … ion and pressure. Bomb calorimeters are used in many industries such as the oil and gas industry or food industry. 1 person found this useful."}, {"url": "https://en.wikipedia.org/wiki/Calorimeter", "passage_text": "A calorimeter is an object used for calorimetry, or the process of measuring the heat of chemical reactions or physical changes as well as heat capacity. Differential scanning calorimeters, isothermal microcalorimeters, titration calorimeters and accelerated rate calorimeters are among the most common types. The measurement of heat using a simple calorimeter, like the coffee cup calorimeter, is an example of constant-pressure calorimetry, since the pressure (atmospheric pressure) remains constant during the process. Constant-pressure calorimetry is used in determining the changes in enthalpy occurring in solution"}]