[{"url": "http://www.ehow.com/about_5176015_causes-knee-numbness.html", "passage_text": "Dislocated Kneecap. A dislocated kneecap can cause numbness in the knee. This condition occurs when the kneecap slides or moves out of its place. When a kneecap becomes dislocated it most often moves toward to outside of the leg. This condition is most often caused by an injury or a sudden change of direction while running. Tendinitis can cause numbness in the knee. This condition occurs when the tendon becomes inflamed, swollen or irritated. A tendon is a fibrous structure, also referred to as soft tissue, that connects muscles to bones. Tendinitis is most often caused by aging, trauma or overuse."}, {"url": "http://www.steadyhealth.com/medical-answers/what-causes-numbness-on-the-side-of-your-knee", "passage_text": "Back Problems. Back problems may be the cause of knee numbness and pain. The nerve fibers supplying the knee come from the lumbar region (L5) of the spinal cord in your lower back. They can get pinched by any problem in your vertebral column including trauma, disk prolapse or spinal stenosis. Dislocated Kneecap. Dislocated kneecaps can also cause nerve injury, resulting in numbness and pain around the knee. Kneecaps can be dislocated due to trauma or sudden pressure on the knee, which is common in activities that misuse the knee joint like running, jogging and jumping."}, {"url": "http://www.healthgrades.com/symptoms/leg-numbness", "passage_text": "Leg numbness is an abnormal condition in which you feel a loss of sensation in the legs. You can have numbness of one (unilateral) or both (bilateral leg numbness) legs. Numbness in the legs may also extend to your toes. Leg numbness is usually due to a lack of blood supply to an area or nerve damage. Leg numbness can also result from infection, inflammation, trauma, and other abnormal processes."}, {"url": "http://www.rightdiagnosis.com/sym/knee_numb.htm", "passage_text": "The following medical conditions are some of the possible causes of Knee numb. There are likely to be other possible causes, so ask your doctor about your symptoms. 1  Diabetes mellitus. 2  Peripheral neuropathy. 3  Raynaud's disease. 4  Peripheral vascular disease. 5  Buerger's disease. "}, {"url": "https://www.zocdoc.com/answers/6396/why-causes-the-pain-numbness-in-my-left-leg-from-my-thigh-to-my-knee", "passage_text": "Why causes the pain/numbness in my left leg from my thigh to my knee? I am a 25 year old female, 5'4 and 145 pounds. "}, {"url": "https://www.healthtap.com/topics/knee-pain-causing-foot-numbness", "passage_text": "4. Get help from a doctor now ›. Swelling: Swelling of the knee especially in the back of the knee can put pressure on the nerve and create numbness down the leg and foot. This is often seen with a bakers cyst of the knee. What could be causing pain in legs and arms, , knee pain, and numbness in two toes on left foot. 6. Get help from a doctor now ›. Neuropathy: makes one more susceptible to focal nerve compression."}, {"url": "http://www.mayoclinic.org/symptoms/numbness/basics/causes/sym-20050938", "passage_text": "Causes. Numbness is usually caused by damage, irritation or compression of several nerves or a single branch of a nerve, most often situated in the periphery of your body. Diseases affecting the peripheral nerves, such as diabetes, also can cause numbness. "}, {"url": "http://www.rightdiagnosis.com/symptoms/knee_numb/causes.htm", "passage_text": "The following medical conditions are some of the possible causes of Knee numb. There are likely to be other possible causes, so ask your doctor about your symptoms. 1  Diabetes mellitus. 2  Peripheral neuropathy. 3  Raynaud's disease. 4  Peripheral vascular disease. 5  Buerger's disease. 6  Varicose veins. "}, {"url": "http://www.webmd.com/pain-management/knee-pain/knee-problems-and-injuries-check-your-symptoms", "passage_text": "Knee Problems and Injuries-Check Your Symptoms. Call 911 if a bone is poking through the skin. Call a doctor if: 1  The hurt limb or joint looks odd, is a strange shape, or is out of its normal position. 2  The skin over the site of an injury is broken. "}]