[{"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=7907", "passage_text": "Periosteum: A dense membrane composed of fibrous connective tissue that closely wraps all bone except that of the articulating surfaces in joints, which is covered by a synovial membrane. "}, {"url": "http://medical-dictionary.thefreedictionary.com/periosteum", "passage_text": "a thick, fibrous vascular membrane covering the bones, except at their extremities. It consists of an outer layer of collagenous tissue containing a few fat cells and an inner layer of fine elastic fibers. Periosteum is permeated with the nerves and blood vessels that innervate and nourish underlying bone. The membrane is thick and markedly vascular over young bones but thinner and less vascular in later life. Bones that lose periosteum through injury or disease usually scale or die."}, {"url": "http://www.answers.com/Q/What_is_the_function_of_the_periosteum", "passage_text": "Periosteum is a membrane that lines the outer surface of all bones, except at the joints of long bones. Endosteum lines the inner surface of all bones. Periosteum connsists of … dense irregular connective tissue. Periosteum is divided into an outer fibrous layer and inner cambium layer (or osteogenic layer). Periosteum is attached to bone by strong collagenous fibers called Sharpey's fibres, which extend to the outer circumferential and interstitial lamellae. It also provides an attachment for muscles and tendons. This is a part of the attachment from the muscles to the tendons."}, {"url": "http://www.innerbody.com/image_skel09/skel01.html", "passage_text": "Full Periosteum Description. Periosteum consists of an outer fibrous connective tissue layer and an inner osteogenic layer. The fibrous layer is made of dense irregular connective tissue containing many strong collagen fibers and fibroblast cells. Physiology. The fibrous layer of the periosteum plays a vital role in connecting bones to the rest of the body. The collagen fibers of the periosteum not only wrap the entire bone, but also merge with the collagen fibers of the ligaments, joint capsules, and tendons that connect to the bone."}, {"url": "http://www.innerbody.com/image_skel09/skel01.html", "passage_text": "Periosteum is the thin yet tough outermost layer of bones. Its many collagen fibers support the bone and firmly connect it to the surrounding structures. Osteogenic cells in the periosteum play a vital role in the growth and repair of bony tissue. Physiology. The fibrous layer of the periosteum plays a vital role in connecting bones to the rest of the body. The collagen fibers of the periosteum not only wrap the entire bone, but also merge with the collagen fibers of the ligaments, joint capsules, and tendons that connect to the bone."}, {"url": "http://www.merriam-webster.com/dictionary/periosteum", "passage_text": "Definition of PERIOSTEUM. : the membrane of connective tissue that closely invests all bones except at the articular surfaces. See periosteum defined for kids. "}, {"url": "https://en.wikipedia.org/wiki/Periosteum", "passage_text": "Periosteum consists of dense irregular connective tissue. Periosteum is divided into an outer fibrous layer and inner cambium layer (or osteogenic layer). The fibrous layer contains fibroblasts, while the cambium layer contains progenitor cells that develop into osteoblasts. "}, {"url": "http://www.answers.com/Q/What_is_Periosteum", "passage_text": "Periosteum is a membrane that lines the outer surface of all bones, except at the joints of long bones. Endosteum lines the inner surface of all bones. Periosteum connsists of dense irregular connective tissue. Periosteum is divided into an outer fibrous layer and inner cambium layer (or osteogenic layer). The fibrous layer contains fibroblasts, while the cambium layer contains progenitor cells that develop into osteoblasts. "}, {"url": "http://study.com/academy/lesson/periosteum-of-bone-definition-function.html", "passage_text": "1 The fibrous periosteum is the outer layer furthest away from the bone. 2  The cells in this layers are densely packed, and it contains lymphatics, blood vessels and nerve endings. 3  The osteogenic periosteum is the inner layer that lies right on top of the bone. This connective tissue is made up of two different layers: 1  The fibrous periosteum is the outer layer furthest away from the bone. 2"}, {"url": "http://medical-dictionary.thefreedictionary.com/periosteum", "passage_text": "periosteum. a specialized connective tissue covering all bones of the body, and possessing bone-forming potentialities. It is made up of an outer tough fibrous layer and a deeper more succulent osteogenic layer. Periosteum also serves as a point of attachment for certain muscles, tendons and ligaments. Periosteum is permeated with the nerves and blood vessels that innervate and nourish underlying bone. The membrane is thick and markedly vascular over young bones but thinner and less vascular in later life. Bones that lose periosteum through injury or disease usually scale or die."}]