[{"url": "https://www.sciencebasedmedicine.org/what-is-traditional-chinese-medicine/", "passage_text": "Traditional Chinese medicine (TCM) has a history of thousands of years. It is formed by summarizing the precious experience of understanding life, maintaining health, and fighting diseases accumulated in daily life, production and medical practice."}, {"url": "http://abcnews.go.com/Health/AlternativeMedicine/traditional-chinese-medicine-benefitsrisks-chinese-medicine-effective/story?id=9411843", "passage_text": "Answer: Traditional Chinese medicine, also known as TCM, includes a range of traditional practices originating in China more than 5,000 years ago. It is based on a philosophy of Taoism. The view of the human body according to TCM paradigm is very different from what in Western medicine we understand."}, {"url": "http://www.takingcharge.csh.umn.edu/explore-healing-practices/traditional-chinese-medicine", "passage_text": "In the west, we tend to think of medicine as a way of dealing with illness and disease. In contrast, Traditional Chinese Medicine (TCM) focuses on achieving health and wellbeing through the cultivation of harmony within our lives."}, {"url": "http://www.takingcharge.csh.umn.edu/explore-healing-practices/herbal-therapies", "passage_text": "Herbal therapy, next to dietary therapy, is perhaps the most widely used Traditional Chinese Medicine (TCM) treatment modality. TCM relies on herbal therapies both for the treatment of illness and in the optimization of health and prevention of disease."}, {"url": "https://nccih.nih.gov/health/whatiscam/chinesemed.htm", "passage_text": "Introduction. Traditional Chinese medicine (TCM) originated in ancient China and has evolved over thousands of years. TCM practitioners use herbal medicines and various mind and body practices, such as. and. , to treat or prevent health problems. In the United States, people use TCM primarily as a. ."}, {"url": "http://www.tcmworld.org/what-is-tcm/", "passage_text": "A Pathway to the Life You Want. TCM, or Traditional Chinese Medicine, is a profound pathway to create the life you truly want to live, the life you were born to live. It’s a timeless bridge that can initiate and support change and growth in any and every life dimension: physical, mental, emotional, and spiritual."}]