[{"url": "http://www.answers.com/Q/Where_is_Gallipoli", "passage_text": "Gallipoli is found in the European part of Turkey with the Aegan Sea to the west. Winston Churchill explained it as The soft underbelly of Europe. Gallipoli is located in the Eastern part of Turkey, with the Aegean sea to the West and the Darndenelle straits to the East."}, {"url": "http://www.wemakemaps.com/Gallipoli.3176366/", "passage_text": "Where is Gallipoli located. Here you can see location and online maps of the town Gallipoli, Apulia, Italy. If necessary, scale the map, or choose a map from another provider (currently there are five available, from Google, Microsoft (Bing), Nokia (Ovi), Yandex, and Openmap)."}, {"url": "http://www.anzac.com/battle_of_gallipoli.html", "passage_text": "Battle of Gallipoli was a combat between the Central powers and Allied Powers and during this battle Gallipoli peninsula became the center of bloody war. Central powers were Germany, Ottoman Empire (modern Turkey), Hungary, Bulgaria; Allied Powers were Russia, France, Australia, USA, United Kingdom and Germany."}, {"url": "http://www.answers.com/Q/Where_is_Gallipoli_located", "passage_text": "Winston Churchill explained it as … The soft underbelly of Europe.   Gallipoli is located in the Eastern part of Turkey, with the Aegean sea to the West and the Darndenelle straits to the East."}, {"url": "http://www.anzac.com/battle_of_gallipoli.html", "passage_text": "Battle of Gallipoli. Gallipoli is a peninsula which is located in northwest coast of Turkey between Gulf of Saros and Dardanelles. This battle took place in the year 1915 and it was fought during World War I (1914-1918)."}, {"url": "https://en.wikipedia.org/wiki/Gallipoli", "passage_text": "A view of the Dardanelles from a ship. The Gallipoli peninsula (/ɡəˈlɪpɵli/ ; Turkish: Gelibolu Yarımadası; Greek: καλλίπολη) is located in Turkish Thrace (or East Thrace), the European part of Turkey, with the Aegean Sea to the west and the Dardanelles strait to the east."}, {"url": "http://gallipoliandtheanzacspiritww1.weebly.com/where-is-gallipoli-and-what-is-there.html", "passage_text": "Gallipoli is located in the Eastern part of Turkey. Gallipoli is a rocky, scrub-covered area with small amounts of water. The hills are steep-sided and are cut into deep gulleys and ravines. At the southernmost tip are a number of small sandy beaches, and there are some small stretches of beach on the Western side too."}]