[{"url": "http://www.merckmanuals.com/professional/dermatologic-disorders/approach-to-the-dermatologic-patient/description-of-skin-lesions", "passage_text": "An extensive language has been developed to standardize the description of skin lesions, including. Lesion type (sometimes called primary morphology). Lesion configuration (sometimes called secondary morphology). Texture. Distribution. Color. Rash is a general term for a temporary skin eruption. Plaques are palpable lesions 10 mm in diameter that are elevated or depressed compared to the skin surface. Plaques may be flat topped or rounded. Lesions of psoriasis and granuloma annulare commonly form plaques. Nodules are firm papules or lesions that extend into the dermis or subcutaneous tissue."}, {"url": "https://en.wikipedia.org/wiki/Induration", "passage_text": "1 Ulcer – An ulcer is a discontinuity of the skin exhibiting complete loss of the epidermis and often portions of the dermis and even subcutaneous fat. 2  Fissure – A fissure is a crack in the skin that is usually narrow but deep. 1 Erosion – An erosion is a discontinuity of the skin exhibiting incomplete loss of the epidermis, a lesion that is moist, circumscribed, and usually depressed. 2 "}, {"url": "http://www.aafp.org/afp/2010/0115/p167.html", "passage_text": "Family physicians commonly diagnose and manage penile cutaneous lesions. Noninfectious lesions may be classified as inflammatory and papulosquamous (e.g., psoriasis, lichen sclerosus, angiokeratomas, lichen nitidus, lichen planus), or as neoplastic (e.g., carcinoma in situ, invasive squamous cell carcinoma). The clinical presentation and appearance of the lesions guide the diagnosi"}, {"url": "http://www.merckmanuals.com/professional/dermatologic-disorders/approach-to-the-dermatologic-patient/description-of-skin-lesions", "passage_text": "Configuration is the shape of single lesions and the arrangement of clusters of lesions. Linear lesions take on the shape of a straight line and are suggestive of some forms of contact dermatitis, linear epidermal nevi, and lichen striatus. Annular lesions are rings with central clearing. Plaques are palpable lesions 10 mm in diameter that are elevated or depressed compared to the skin surface. Plaques may be flat topped or rounded. Lesions of psoriasis and granuloma annulare commonly form plaques. Nodules are firm papules or lesions that extend into the dermis or subcutaneous tissue."}, {"url": "https://en.wikipedia.org/wiki/Induration", "passage_text": "See also: List of cutaneous conditions. A cutaneous condition is any medical condition that affects the integumentary system — the organ system that encloses the body and includes skin, hair, nails, and related muscle and glands. The major function of this system is as a barrier against the external environment. 1 Erosion – An erosion is a discontinuity of the skin exhibiting incomplete loss of the epidermis, a lesion that is moist, circumscribed, and usually depressed. 2  Ulcer – An ulcer is a discontinuity of the skin exhibiting complete loss of the epidermis and often portions of the dermis and even subcutaneous fat."}, {"url": "http://www.merckmanuals.com/professional/dermatologic-disorders/approach-to-the-dermatologic-patient/description-of-skin-lesions", "passage_text": "Lesion Type (Primary Morphology). Macules are flat, nonpalpable lesions usually 10 mm in diameter. Macules represent a change in color and are not raised or depressed compared to the skin surface. A patch is a large macule. Plaques are palpable lesions 10 mm in diameter that are elevated or depressed compared to the skin surface. Plaques may be flat topped or rounded. Lesions of psoriasis and granuloma annulare commonly form plaques. Nodules are firm papules or lesions that extend into the dermis or subcutaneous tissue."}, {"url": "http://www.medscape.com/viewarticle/502689", "passage_text": "26-year-old African-American woman. Indurated skin and subcutaneous lesions on her abdomen and thighs. End-stage renal disease (ESRD) requiring peritoneal dialysis. History of thrombosis of her subclavian and internal jugular veins and pulmonary embolism after dialysis catheter placement. Indurated skin and subcutaneous lesions on her abdomen and thighs (Figure 1 and 2). (Enlarge Image). Patient's right lower extremity showing areas of coumadin-induced skin necrosis. (Enlarge Image). Closer view of the same area shown in Figure 1 illustrating indurated skin lesions with sloughing. Table 1"}, {"url": "http://www.clinicaladvisor.com/derm-dx-erythematous-indurated-lesions-on-the-face-and-extremities/slideshow/215/", "passage_text": "A patient presents with erythematous, indurated lesions on the face and extremities that are ulcerated and discharging pus accompanied by low-grade fever, chest pain, cough and hemoptysis. "}]