[{"url": "https://answers.yahoo.com/question/index?qid=20070318142153AASl0Q8", "passage_text": "i dont know about flower pots but i know of a chalk you can buy in an orange box that has chinese writing on it and ants cant stand it. my friends house use to have ants really bad and they would draw a line across the counter and the ants would flee fast. I don,t know about a plant but I had a problem with ants in everything and tried everything till some one told me to try orth max for ground moles now i don,t have any ants anywhere its for lawns and works great for a long time."}, {"url": "http://www.gardenguides.com/94272-outdoor-plants-repel-carpenter-ants.html", "passage_text": "Tansy. Tansy (Tanacetum vulgare) repels a variety of pests, including ants, mosquitoes, Japanese beetles, striped cucumber beetles, flies, Colorado potato beetles, moths, mice, flea beetles, cabbage worms and squash bugs. Tansy is a perennial that is hardy to USDA Zone 4. Mint. Both peppermint (Mentha --- piperita) and Spearmint (Mentha spicata) are good at repelling ants as well as moths, flies, mice, fleas and aphids. Mint is also said to improve the flavor of plants in the cabbage family--which includes broccoli, Brussels sprouts, kale, cauliflower---when planted next to it."}, {"url": "http://www.doityourself.com/stry/how-to-deter-ants-from-the-garden", "passage_text": "There are options to cut down on ants in the garden that don't put your health at risk. Herbs Ants Hate. There are a number of herbs that naturally repel ants. By planting these herbs in your garden, you can cut down the presence of ants. Plant them around the areas you specifically want to protect, or near doors and windows to keep them from entering your home. There are a few flowers that are known to deter ants from their area. One of the best known is the marigold. Plant a few of these around the borders of your garden or near plants you want really well protected. Marigolds have the advantage of minimal expansion."}, {"url": "http://homeguides.sfgate.com/outdoor-plants-repel-ants-44423.html", "passage_text": "Ants nest in soil near their food source. Ants are useful predators that feed on termites, caterpillars and fleas. In the yard and garden, however, ants give refuge to destructive honeydew-producing insects, including whiteflies, mealybugs and aphids. Protect your property from these pests by growing outdoor plants that repel ants. Grow mint, tansy, common yarrow and garlic in your yard and alongside your foundation to stop ants from invading your home. Their scent can repel ants or disguise the odors that attract them. "}, {"url": "http://bouldercommunitygardens.ning.com/profiles/blogs/16-common-items-to-get-rid-of", "passage_text": "They hate the smell. Oranges. Get rid of the ants in your garden, on your patio, and along the foundation of your home. In a blender, make a smooth puree of a few orange peels in 1 cup warm water. Slowly pour the solution over and into anthills to send the little pests packing."}, {"url": "http://serendipityandspice.com/8-plants-to-repel-bugs-insects-and/", "passage_text": "I hope you’ll also choose to follow along through Facebook and subscribe to the Weekly Email Newsletter as I work to survive life with a toddler. Bugs, bees, ants, wasps, mice, etc…..they’re called pests for a reason! Here’s a list of 8 plants to repel pests naturally. With 2 kids under 5 I don’t like using chemicals around the house but these plants repel pests so I don’t have to! "}, {"url": "http://www.doityourself.com/stry/how-to-deter-ants-from-the-garden", "passage_text": "Ants Hate Marigolds. There are a few flowers that are known to deter ants from their area. One of the best known is the marigold. Plant a few of these around the borders of your garden or near plants you want really well protected. Marigolds have the advantage of minimal expansion."}, {"url": "http://www.greenlifestylechanges.com/getting-the-ants-out-naturally/", "passage_text": "Plant mint around your house. Ants hate mint. Mint grows like a crazy weed, and most people like the smell. I moved some mint sprigs to near my back door and near where I’d seen lots of ants. Mint is a weed and will grow in any teeny-tiny little patch of space, so you don’t really need a yard, just a little bit of dirt. Many websites talk about different ways of handling ants depending on what kind of ants you have. I’ve found that over the course of the year different types of ants wander in and out of my house and I don’t really want any of them around, so I’ve looked for general, keep them all out, solutions."}, {"url": "http://www.gardenguides.com/91450-outdoor-plants-repel-ants.html", "passage_text": "Comments. Submit. Several plants boast ant-repelling reputations. Grow them near vulnerable plants or next to your home's foundations and doorways to discourage garden ants from becoming indoor pests. Harvested and dried, these plants scare off ants when sprinkled indoors or in the garden. Use rue at a garden's border to keep ants from entering, or near a home's vulnerable entry points. Alternatively, plant them near roses, raspberries and fruit trees to prevent ants from farming aphids and other predatory insects."}]