[{"url": "http://www.fao.org/docrep/006/Y5013E/y5013e08.htm", "passage_text": "The thermal resistance (R-value) is the reciprocal of l (1/l) and is used for calculating the thermal resistance of any material or composite material. The R-value can be defined in simple terms as the resistance that any specific material offers to the heat flow. Figure 5.1 shows the thermal conductivities of R-11, dry air, water vapour and ice within an insulation material and illustrates the significant increase in thermal conductivity that can occur if air/gas is replaced by water vapour in the insulation."}, {"url": "http://dponline.org/weblog/2011/02/17/why-i-love-damart-but-wont-order-it-again/", "passage_text": "For years this was the only thermal underwear I’d wear. I had several sets and was careful to not put them in the dryer after a couple of mistakes. See — Thermolactyl — the name Damart has given to its wonder-material shrinks in the dryer. A lot. So much that a woman’s top will fit a toddler if put in the dryer. I did this a couple times, but quickly learned to wash my Damart items separately so I would not mistakenly toss one in the dryer."}, {"url": "http://freakyfrugalite.com/damart-thermolactyl-vs-old-man-winter/", "passage_text": "Reviews. That isn’t the name of a new Godzilla movie, as cool as it would be. :grinny: Thermolactyl is a fiber, for a type of ladies and mens thermal underwear. Today, I am reminded of Damart’s thermolactyl on Upstate New York’s traditionally coldest day of the year. My oldest son just informed me that he’s outgrown his long johns (AGAIN). I just found out that I can order Damart clothing ONLINE! Woohoo!! My sons love thermolactyl and Damart makes the BEST thermal underwear ever. Thermolactyl is very “cool” stuff. For many years, we had a Damart outlet factory nearby and we used to get the most AMAZING clothing."}, {"url": "http://www.damart.co.uk/about", "passage_text": "Request a catalogue. A French company, founded in 1953 by three brothers famous for developing and patenting Thermolactyl, a unique man-made fibre now renowned for its ability to provide warmth without lots of bulky layers. Today Damartex consists of 9 individual brands including Damart, Damart Sport, Happy D, Jours Heureux, Afibel, La Maison du Jersey, Delaby, Sedagyl and Cooper and we strive to deliver unrivalled quality, value and, most of all, excellent customer service."}, {"url": "https://en.wikipedia.org/wiki/Damart", "passage_text": "Damart is the most well known brand of a company, now called Damartex, which originated in France in 1953. It was founded by the Despature brothers and primarily manufactured thermal clothing using Thermolactyl fibre. Today the Damartex group employs around 4,000 people worldwide, with around 650 of these in the UK. In 1976, Damart went public being listed on the Paris Stock Exchange. In 2002, Damart entered into partnership with the Breast Cancer Campaign and has since raised £82,000 for breast cancer awareness through sales of its limited edition pink vest."}, {"url": "http://dponline.org/weblog/2011/02/17/why-i-love-damart-but-wont-order-it-again/", "passage_text": "In fact I’m about to order some things for my daughter — so disregard the negativity below and order away. It is really good stuff; just don’t toss it in the dryer. Note to anyone here because of an Internet search for Damart or Thermolactyl (which seems to be a lot of you): See — Thermolactyl — the name Damart has given to its wonder-material shrinks in the dryer. A lot. So much that a woman’s top will fit a toddler if put in the dryer. I did this a couple times, but quickly learned to wash my Damart items separately so I would not mistakenly toss one"}, {"url": "http://pennineranger.blogspot.com/2014/01/damart-thermolactyl-base-layer.html", "passage_text": "Indeed, I've driven past Damart's iconic chimney in Bingley many times on my way to and from the Dales and like me, Damart are celebrating their 60'th year. The product I was sent to review is a thermal top, a crew necked, long sleeved base layer made from Thermolactyl, a polyester based fabric. It is rated Grade 4 on the manufacturer's warmth scale, for use between -15C to -5C. Style and colour. In fact it's just about a perfect fit on me. My only gripe is that the sleeves are just a little on the short side. Laying the two products one on the other, the Damart appears about 1.5 to 2cms narrower in the body but is 1cm longer."}, {"url": "https://en.wikipedia.org/wiki/Damart", "passage_text": "Damart is a French company which specialises in clothing. Established in 1953 the brand became a household name in France and the UK. Although the brand specialises in a material called Thermolactyl, known for its insulation qualities, the label has expanded to include fashion items for the senior's market. In 2002, Damart entered into partnership with the Breast Cancer Campaign and has since raised £82,000 for breast cancer awareness through sales of its limited edition pink vest."}, {"url": "http://www.damartusa.com/F-10092-t_shirts-hwr-m/P-244301-sleeveless-thermal-vest", "passage_text": "Classic Thermolactyl. Cleverly designed interlocking stitches which create tiny air pockets, which trap air, locking cold out and heat in. Flexible and hardwearing, without side seams. Sleeveless vest in soft Interlock. Machine washable. 85% Thermolactyl Chlorofibre, 15% Acrylic. "}]