[{"url": "http://money.cnn.com/2014/08/18/pf/child-cost/index.html", "passage_text": "To raise a child born in 2013 to the age of 18, it will cost a middle-income couple just over $245,000, according to newly released estimates from the U.S. Department of Agriculture. That's up $4,260, or almost 2%, from the year before. Estimates can vary widely depending on where you live and how much you earn. Related: 'The most surprising cost of raising my kid'. Child care, in particular, is a huge burden -- often costing as much as the family home. In 2012, center-based care for one infant was greater than median rent payments in nearly half of the states, according to Child Care Aware of America's most recent report."}, {"url": "http://www.cbsnews.com/news/bringing-up-baby-is-a-costly-proposition/", "passage_text": "According to this latest report, a middle-income family with a child born last year can expect to spend about $245,340 -- or $304,480, if you toss in a projected average inflation rate of 2.4 percent per year -- on housing, food, education, childcare and other expenses by the time that child reaches 18 years of age. The average cost of housing for a child up to age 18 is $87,840 for a middle-income family in the urban West, compared to $66,240 in the urban South, and $70,200 in the urban Midwest, he added."}, {"url": "http://www.huffingtonpost.com/2014/08/18/cost-of-raising-a-child_n_5688179.html", "passage_text": "The estimate is 1.8 percent higher than the previous year. That equates to roughly $12,800 - $14,970 per child per year for a two-parent family with a median annual income between $61,530 and $106,540. The annual cost can vary based on factors like the child's age, the number of children in the family and the family's income and location. Back then, a middle-income family could have expected to spend $25,230 ($198,560 in 2013 dollars) to raise a child until the age of 18, according to the new report, which also notes that [h]ealth care expenses for a child have doubled as a percentage of total child-rearing costs during that time.."}, {"url": "http://www.nbcnews.com/business/personal-finance/having-kid-itll-now-cost-you-much-raise-child-n183056", "passage_text": "advertisement. $245,340. That's the magic number for how much it will cost a middle-income American family, on average, to raise a child born in 2013 until he or she becomes an adult. And families living in the Northeast will be taking on a greater burden, according to a report out Monday. As in the past, families in the urban Northeast will spend more than families in the urban South and rural parts of the U.S., or roughly $282,480. When adjusting for projected inflation, the report found that a child born last year could cost a middle-income family an average of about $304,480."}, {"url": "https://en.wikipedia.org/wiki/Cost_of_raising_a_child", "passage_text": "$94,100 {5228 avg x 18yrs} is the total basic cost of raising a child from birth in 2013 to age 18. The tax exemption per child is $3900 in 2013 which is also based on the basic cost of raising a child. Plus there is a child tax credit up to $1000 for each child. The cost of raising a child varies from country to country. The cost of raising a child is different from the Average Spending on a child (USDA chart below) which is influenced by income. The USDA charts are based on a birth in 2011."}, {"url": "http://www.huffingtonpost.com/2014/08/18/cost-of-raising-a-child_n_5688179.html", "passage_text": "The average cost of raising a child born in 2013 up until age 18 for a middle-income family in the U.S. is approximately $245,340 (or $304,480, adjusted for projected inflation), according to the latest annual Cost of Raising A Child report from the U.S. Department of Agriculture. Back then, a middle-income family could have expected to spend $25,230 ($198,560 in 2013 dollars) to raise a child until the age of 18, according to the new report, which also notes that [h]ealth care expenses for a child have doubled as a percentage of total child-rearing costs during that time.."}, {"url": "http://www.usda.gov/wps/portal/usda/usdahome?contentid=2013/08/0160.xml", "passage_text": "For the year 2012, annual child-rearing expenses per child for a middle-income, two-parent family ranged from $12,600 to $14,700, depending on the age of the child. In 1960, the first year the report was issued, a middle-income family could have expected to spend $25,230 ($195,690 in 2012 dollars) to raise a child through age 17. Housing was the largest expense on a child both then and now. Health care expenses for a child doubled as a percentage of total child-rearing costs."}, {"url": "http://money.cnn.com/2013/08/14/pf/cost-children/index.html", "passage_text": "From day care to the monthly grocery bill, the cost of raising a child is climbing at a rate that many families can't keep up with. It will cost an estimated $241,080 for a middle-income couple to raise a child born last year for 18 years, according to a U.S. Department of Agriculture report released Wednesday. That's up almost 3% from 2011 and doesn't even include the cost of college. At the same time, wages aren't keeping up. The biggest price tag is for families in the urban Northeast earning $105,360 or more. They will spend $446,100, much more than the national average, according to the report. Meanwhile, families earning less than $61,590 a year in rural areas will spend the least, at $143,160."}]