[{"url": "http://www.secondchancegarage.com/public/history-of-automotive-brakes-1.cfm", "passage_text": "Mechanical Drum Brakes. The first, or among the first, to wrap a cable around a drum anchored to the vehicle's chassis—the basic idea for drum brakes—was Gottlieb Daimler, in 1899. Wilhelm Maybach, designer of the first Mercedes, utilized rudimentary, mechanical drum brakes in 1901."}, {"url": "http://www.motorera.com/history/hist07.htm", "passage_text": "This is ironic, because the spot-type disc brake is an American invention. In 1898, Elmer Ambrose Sperry of Cleveland designed an electric car having front-wheel disc brakes. He made a large disc integral with the hub on each wheel."}, {"url": "http://carsafetyphysics.weebly.com/history-of-brakes.html", "passage_text": "Over the years many different types of brakes have been used on many different types of vehicles. The main types of brakes were wooden block brakes, drum brakes and disc brakes. One of the earliest brakes invented was the wooden block brake, which was used on horse drawn carriages for many years. This type of brake consisted of a long handle, which acted as a lever to make braking easier, attached to a block of wood. This handle ended near the driver's seat."}, {"url": "http://www.motorera.com/history/hist07.htm", "passage_text": "A major test of brake systems took place in 1902 on an unpaved road in New York City called Riverside Drive. Ransom E. Olds had arranged to test a new brake system against the tire brake of a four-horse coach and the internal drum brake of a Victoria horseless carriage."}, {"url": "http://carsafetyphysics.weebly.com/history-of-brakes.html", "passage_text": "This type of brake is called the disc brake and is often used in combination with drum brakes and anti-lock braking system (ABS). The disc brake consists of a set of brake pads and pistons. When the driver applies the brakes, the pistons activate, squeezing the brake pads together on either side of the wheel."}, {"url": "http://www.google.com/patents/US6573830", "passage_text": "Patents. The progressive vehicle brake light system of the invention consists of a brake sensor arranged to sense the travel of a brake pedal and a brake light display arranged to illuminate or extinguish in sequence or progressively in response to the travel of the brake pedal. A microcontroller is provided..."}]