[{"url": "https://en.wikipedia.org/wiki/Teddy_bear", "passage_text": "Developed apparently simultaneously by toymakers Morris Michtom in the US and Richard Steiff in Germany in the early years of the 20th century, and named after President Theodore Teddy Roosevelt, the teddy bear became an iconic children's toy, celebrated in story, song, and film. Since the creation of the first teddy bears which sought to imitate the form of real bear cubs, teddies have greatly varied in form, style and material. They have become collector's items, with older and rarer teddies appearing at public auctions."}, {"url": "http://www.history.com/this-day-in-history/first-teddy-bear-goes-on-sale", "passage_text": "A+E Networks. On this day in 1903, toy store owner and inventor Morris Michtom places two stuffed bears in his shop window, advertising them as Teddy bears. Michtom had earlier petitioned President Theodore Roosevelt for permission to use his nickname, Teddy. "}, {"url": "https://en.wikipedia.org/wiki/Teddy_bear", "passage_text": "Teddy bear early 1900s in the Smithsonian Museum of Natural History. Assumed to be manufactured by Benjamin Michton, son of the founder of Ideal Toy Company in 1903. Owned by Theodore Roosevelt's grandson, Kermit Roosevelt. Morris Michtom saw the drawing of Roosevelt and was inspired to create a teddy bear. He created a tiny soft bear cub and put it in the shop window with a sign Teddy's bear, after sending a bear to Roosevelt and receiving permission to use his name. The toys were an immediate success and Michtom founded the Ideal Novelty and Toy Co. Since the creation of the first teddy bears which sought to imitate the form of real bear cubs, teddies have greatly varied in form, style and material. They have become collector's items, with older and rarer teddies appearing at public auctions."}, {"url": "http://www.answers.com/Q/When_did_the_teddy_bear_get_invented", "passage_text": "The Teddy Bear was invented in 1902 of November by Morris and Rose michtom at their candy shop. The teddy bear is named after Teddy Roosevelt. Morris Michtom created the toy after being inspired by a cartoon depicting the President showing sympathy to a bear that was tie … d up. The cartoon was modeled after a real hunting where a black bear was caught and tied up for President Roosevelt to shoot."}, {"url": "http://www.answers.com/Q/Who_invented_the_teddy_bear", "passage_text": "OK, here is the real and absolute answer. Theodore Roosevelt did not INVENT the Teddy Bear Morris Midton did. Roosevelt inspired to make the Teddy Bear. In fact, his very own nickname was Teddy because back when he was president, he went hunting one day (I think he was on a horse using a rifle) and saw a bear. Then, he aimed his fully loaded rifle (if he was using a rifle that was fully loaded) directly at the bear. Theodore (Teddy) Roosevelt, the 26th president of the United States, is the person responsible for giving the teddy bear his name. On November 14, 1902, Roosevelt was helping … settle a border dispute between Mississippi and Louisiana."}, {"url": "http://wanttoknowit.com/who-invented-the-teddy-bear/", "passage_text": "Another claim for the invention of the teddy bear comes from Germany. It was reported that the Steiff firm made a stuffed bear from designs by Richard Steiff in 1903. Reportedly, 3000 were ordered to be shipped to the United States, but the existence of this shipment is still disputed. Teddy bears are soft stuffed toy that are designed to look like a bear. They are popular gifts to show affection, collected by teddy bear enthusiasts and are also much loved by children all around the world. It is estimated that the retail sales for teddy bears in 2011 will top $1.5 billion."}, {"url": "http://www.theodoreroosevelt.org/site/c.elKSIdOWIiJ8H/b.8684621/k.6632/Real_Teddy_Bear_Story.htm", "passage_text": "The Teddy Bear tie came when a Brooklyn, NY candy shop owner, Morris Michtom, saw Clifford Berryman’s original cartoon of Roosevelt and the bear and had an idea. He put in his shop window two stuffed toy bears his wife had made. Michtom asked permission from President Roosevelt to call these toy bears Teddy's bears. "}, {"url": "http://www.ideafinder.com/history/inventions/teddybear.htm", "passage_text": "The Invention of the Teddy Bear by Margarete Steiff The result, the first toy bear, made of finest mohair and with jointed arms, legs and head, was exhibited at the Leipzig Fair in 1903. www.teddybear.org/e_gesch.htm) The Vienna Teddy Bear Museum Opened online in 1996. Morris Michtom, owner of a Brooklyn toy store, was inspired by the cartoon to make a stuffed bear cub. Intending it only as a display, he placed the stuffed bear in his toy store window, and next to it placed a copy of the cartoon from the newspaper. To Michtoms surprise, he was besieged by customers eager to buy."}, {"url": "http://wanttoknowit.com/who-invented-the-teddy-bear/", "passage_text": "The story behind the invention of the teddy bear is quite interesting. The idea for creating this stuffed toy came from a famous moment in the life of President Theodore Roosevelt, who was known by the nickname “teddy”. In 1902 some of the president’s attendants hunted a black bear with hounds. Teddy bears are soft stuffed toy that are designed to look like a bear. They are popular gifts to show affection, collected by teddy bear enthusiasts and are also much loved by children all around the world. It is estimated that the retail sales for teddy bears in 2011 will top $1.5 billion."}, {"url": "http://inventors.about.com/od/tstartinventions/a/Teddy_Bear.htm", "passage_text": "Morris Michtom made the first official toy bear called the teddy bear. Michtom owned a small novelty and candy store in Brooklyn, New York. His wife Rose was making toy bears for sale in their store. Michtom sent Roosevelt a bear and asked permission to use the teddy bear name. Roosevelt said yes. "}]