[{"url": "http://www.ttbh.org/Documents/BudgetCutsCommunity.pdf", "passage_text": "The average per day cost of community‐based services is $12 for adults and $13 for children, as compared to $401 for a State Hospital bed, $137 for a jail bed for an inmate with mental illness, and $986 for an emergency room visit. The national average length of stay in jail is 80 days for the mentally impaired offender compared with 20 days for the general jail inmate. 24 The cost of an average jail stay for an inmate with mental illness is $10,960."}, {"url": "http://piperreport.com/blog/2011/06/25/hospitalizations-for-mental-health-and-substance-abuse-disorders-costs-length-of-stay-patient-mix-and-payor-mix/", "passage_text": "For SA stays, the average cost in the highest cost state ($6,600) was more than twice that in the lowest cost state ($2,900). MHSA Length of Stay: Hospital lengths of stay for mental health or substance abuse disorders also vary considerably, especially for mental health-related admissions. Nationwide, the MH average length of stay is 8.0 days. At a state level, the average MH length of stay ranges widely, from 4.0 to 14.0 days."}, {"url": "http://www.hcup-us.ahrq.gov/reports/statbriefs/sb62.jsp", "passage_text": "1 Average length of stay for hospitalizations principally for mental health was greater than for all stays (8.2 days versus 4.6 days, respectively). 2  Mood disorders and schizophrenia were the most common reasons for mental health hospital stays—responsible for 82 percent of all mental health hospitalizations. Additionally, anxiety disorders were noted in 1.3 million stays, or 19 percent of stays with MH as a secondary condition. Hospital stays for mental health, by payer. In 2006, government payers were billed for more than 60 percent of all MH discharges (figure 2)."}, {"url": "http://www.consumerhealthratings.com/index.php?action=showSubCats&cat_id=346", "passage_text": "Average price for a Mental health hospitalization was $15,400 in 2006, according to Statistical Brief #62. Typical stay in the hospital was 8.2 days, with almost half (49.3%) admitted through the Emergency Department / ER. Published by the federal government agency AHRQ, October 2008. NIH estimates 9.5% of the adult US population suffers from depression. Actual average cost in 2005 was estimated to be $4500 for a hospital stay for a principal diagnosis of depression, which was about 6.6 days long. (Hospital prices and charges would have been higher.) Nearly half of the stays were for people ages 18 to 44"}, {"url": "http://www.hcup-us.ahrq.gov/reports/statbriefs/sb117.pdf", "passage_text": "The average cost of a MH stay ranged from a low of $2,900 to a high of $13,300; the average cost of a SA stay ranged from $2,900 to $6,600. In most states, the average cost per MH and SA stay was close to the nationwide average ($5,700 for MH stays and $4,600 for SA stays). expensive than non-MHSA stays ($5,700 per MH stay; $4,600 per SA stay; $9,300 per non-MHSA stay). Hospital costs for MH and SA stays generally were lower than other medical or surgical conditions. because high-technology equipment and procedures are not typically employed in treating MHSA. disorders."}, {"url": "http://piperreport.com/blog/2011/06/25/hospitalizations-for-mental-health-and-substance-abuse-disorders-costs-length-of-stay-patient-mix-and-payor-mix/", "passage_text": "Wide Variation by State: The average cost of inpatient hospital stays for mental health or substance abuse disorders vary widely from state to state. The average cost of a MH stay in the highest cost state ($13,300) was four times that in the lowest cost state ($2,900). MHSA Length of Stay: Hospital lengths of stay for mental health or substance abuse disorders also vary considerably, especially for mental health-related admissions. Nationwide, the MH average length of stay is 8.0 days. At a state level, the average MH length of stay ranges widely, from 4.0 to 14.0 days."}, {"url": "http://piperreport.com/blog/2011/06/25/hospitalizations-for-mental-health-and-substance-abuse-disorders-costs-length-of-stay-patient-mix-and-payor-mix/", "passage_text": "MHSA hospital stays cost $9.7 billion in 2008 or 2.7 percent of all inpatient community hospital costs. Average Cost for Hospital Stay: MH and SA hospitalizations are, on average, less expensive than non-MHSA stays: 1  $5,700 per MH stay. 2  $4,600 per SA stay. MHSA Length of Stay: Hospital lengths of stay for mental health or substance abuse disorders also vary considerably, especially for mental health-related admissions. Nationwide, the MH average length of stay is 8.0 days. At a state level, the average MH length of stay ranges widely, from 4.0 to 14.0 days."}, {"url": "http://www.consumerhealthratings.com/index.php?action=showSubCats&cat_id=346", "passage_text": "Drug Abuse Hospitalization-Average Costs (AHRQ). Statistical Brief #39 shows average true cost for hospital stays for drug abuse (excluding alcohol rehab centers) was $7600 (2005 data) with average length of stay of 5.9 days. Most patients (57%) were male, with average age of 41 years. NIH estimates 9.5% of the adult US population suffers from depression. Actual average cost in 2005 was estimated to be $4500 for a hospital stay for a principal diagnosis of depression, which was about 6.6 days long. (Hospital prices and charges would have been higher.) Nearly half of the stays were for people ages 18 to 44"}, {"url": "http://www.hcup-us.ahrq.gov/reports/statbriefs/sb62.jsp", "passage_text": "Characteristics of stays principally for MH conditions differed from overall hospital stays (table 1). For example, the average length of stay for MH hospitalizations was greater than for all stays (8.2 days versus 4.6 days, respectively). Hospital charges for MH hospitalizations were about $3,300 less per day than overall hospital charges ($1,900 per day for MH stays compared to about $5,200 per day for all stays). Additionally, anxiety disorders were noted in 1.3 million stays, or 19 percent of stays with MH as a secondary condition. Hospital stays for mental health, by payer. In 2006, government payers were billed for more than 60 percent of all MH discharges (figure 2)."}]