[{"url": "http://www.healthline.com/health/chest-x-ray", "passage_text": "An X-ray is an imaging test that uses small amounts of radiation to produce pictures of the organs, tissues, and bones of the body. When focused on the chest, it can help spot abnormalities or diseases of the airways, blood vessels, bones, heart, and lungs. "}, {"url": "http://www.mayoclinic.org/tests-procedures/chest-x-rays/basics/why-its-done/prc-20013074", "passage_text": "Why it's done. Chest X-rays are a common type of exam. A chest X-ray is often among the first procedures you'll undergo if your doctor suspects you have heart or lung disease. It can also be used to check how you are responding to treatment. A chest X-ray can reveal many things inside your body, including: 1  The condition of your lungs. "}, {"url": "http://www.cancerresearchuk.org/about-cancer/type/lung-cancer/diagnosis/lung-cancer-tests", "passage_text": "You will usually be asked to go for a chest X-ray to check for anything that looks abnormal in your lungs. You may have some routine blood tests. Your GP may also ask you to give some samples of phlegm. They may send them to the hospital for you or may ask you to take them to the hospital. "}, {"url": "http://www.emedicinehealth.com/chest_x-ray-health/article_em.htm", "passage_text": "Test Overview. A chest X-ray is a picture of the chest that shows your heart, lungs, airway, blood vessels, and lymph nodes. A chest X-ray also shows the bones of your spine and chest, including your breastbone, your ribs, your collarbone, and the upper part of your spine. A chest X-ray is the most common imaging test or X-ray used to find problems inside the chest. A chest X-ray is a picture of the chest to see your heart, lungs, airway, blood vessels, and lymph nodes. A chest X-ray also shows the bones of your"}, {"url": "http://www.emedicinehealth.com/chest_x-ray/article_em.htm", "passage_text": "Chest X-ray Test Overview. A chest X-ray test is a very common non-invasive radiology test that produces an image of the chest and the internal organs. To produce a chest X-ray test, the chest is briefly exposed to radiation from an X-ray machine and an image is produced on a film or into a digital computer. "}, {"url": "http://www.webmd.com/heart-disease/chest-x-ray", "passage_text": "Chest X-Ray. Guide. A chest X-ray is a picture of the chest that shows your heart, lungs, airway, blood vessels, and lymph nodes. A chest X-ray also shows the bones of your spine and chest, including your breastbone, your ribs, your collarbone, and the upper part of your spine. A chest X-ray is the most common imaging test or X-ray used to find problems inside the chest. A chest X-ray can help find some problems with the organs and structures inside the chest. Usually two pictures are taken, one from the back of the chest and another from the sid"}, {"url": "http://www.nhlbi.nih.gov/health/health-topics/topics/cxray/", "passage_text": "A chest x ray is a painless, noninvasive test that creates pictures of the structures inside your chest, such as your heart, lungs, and blood vessels. Noninvasive means that no surgery is done and no instruments are inserted into your body. A chest x ray takes pictures of the inside of your chest. The different tissues in your chest absorb different amounts of radiation. Your ribs and spine are bony and absorb radiation well."}, {"url": "http://www.radiologyinfo.org/en/info.cfm?PG=chestrad", "passage_text": "The chest x-ray is performed to evaluate the lungs, heart and chest wall. A chest x-ray is typically the first imaging test used to help diagnose symptoms such as: 1  shortness of breath. 2  a bad or persistent cough. 3  chest pain or injury. 4  fever."}, {"url": "http://www.cancer.org/cancer/lungcancer-non-smallcell/moreinformation/lungcancerpreventionandearlydetection/lung-cancer-prevention-and-early-detection-exams-and-tests", "passage_text": "If you have symptoms that might be due to lung cancer, this is often the first test your doctor will do to look for any masses or spots on the lungs. Plain x-rays of your chest can be done at imaging centers, hospitals, and even in some doctors’ offices. "}, {"url": "http://www.radiologyinfo.org/en/info.cfm?PG=chestrad", "passage_text": "The chest x-ray is the most commonly performed diagnostic x-ray examination. A chest x-ray produces images of the heart, lungs, airways, blood vessels and the bones of the spine and chest. An x-ray (radiograph) is a noninvasive medical test that helps physicians diagnose and treat medical conditions. A chest x-ray is typically the first imaging test used to help diagnose symptoms such as: 1  shortness of breath. 2  a bad or persistent cough. 3  chest pain or injury. 4  fever."}]