[{"url": "http://www.biology-online.org/dictionary/Dna_ligase", "passage_text": "Dna ligase. Dna ligase. (Science: enzyme molecular biology) enzyme involved in dna replication. The dna ligase of E. Coli seals nicks in one strand of double stranded dna, a reaction required for linking precursor fragments during discontinuous synthesis on the lagging strand."}, {"url": "http://medical-dictionary.thefreedictionary.com/DNA+ligase", "passage_text": "ligase. any of a class of enzymes that catalyze the joining together of two molecules coupled with the breakdown of a pyrophosphate bond in ATP or a similar triphosphate. DNA ligase either of two enzymes that join two double-helical molecules of DNA together to make a longer DNA molecule. ligase chain reaction a type of DNA amplification that uses DNA ligase to link chains and amplify the template containing the sequence in question"}, {"url": "http://www.encyclopedia.com/doc/1O6-DNAligase.html", "passage_text": "A Dictionary of Biology | 2004 | 343 words. © A Dictionary of Biology 2004, originally published by Oxford University Press 2004. DNA ligase An enzyme that is able to join together two portions of DNA and therefore plays an important role in DNA repair. "}, {"url": "https://en.wikipedia.org/wiki/DNA_ligase", "passage_text": "In molecular biology, DNA ligase is a specific type of enzyme, a ligase, (EC 6.5.1.1) that facilitates the joining of DNA strands together by catalyzing the formation of a phosphodiester bond. 1 DNA ligase III: complexes with DNA repair protein XRCC1 to aid in sealing DNA during the process of nucleotide excision repair and recombinant fragments. 2  Of the all known mammalian DNA ligases, only Lig III has been found to be present in mitochondria. 3  DNA ligase IV: complexes with XRCC4."}, {"url": "http://medical-dictionary.thefreedictionary.com/DNA+ligase", "passage_text": "a collection of cloned DNA molecules from a genome. DNA ligase. an enzyme that seals nicks in the DNA helix, joins Okazaki fragments together during DNA replication and is essential in recombinant DNA technology for DNA cloning. any of a class of enzymes that catalyze the joining together of two molecules coupled with the breakdown of a pyrophosphate bond in ATP or a similar triphosphate. DNA ligase either of two enzymes that join two double-helical molecules of DNA together to make a longer DNA molecule."}, {"url": "http://study.com/academy/lesson/dna-ligase-definition-role-quiz.html", "passage_text": "DNA Ligase Defined. DNA ligase is an enzyme that has a very critical role in the process of DNA replication and DNA repair. There are two different things going on when DNA is replicated. Let's revisit this process very briefly. DNA ligase adds on nucleotides in the usual 5' to 3' direction along the DNA strand. In addition to bridging gaps during the process of DNA replication, DNA ligase also works to do the same thing during DNA repair. When DNA is repaired, a portion of the DNA where the error or damage occurred is removed."}, {"url": "http://medical-dictionary.thefreedictionary.com/DNA+ligase", "passage_text": "DNA ligase, an enzyme that can repair breaks in a strand of deoxyribonucleic acid (DNA) by synthesizing a bond between adjoining nucleotides. Under some circumstances the enzyme can join together loose ends of DNA strands, and in some cases it can repair breaks in ribonucleic acid (RNA). It serves as a catalyst. any of a class of enzymes that catalyze the joining together of two molecules coupled with the breakdown of a pyrophosphate bond in ATP or a similar triphosphate. DNA ligase either of two enzymes that join two double-helical molecules of DNA together to make a longer DNA molecule."}, {"url": "http://en.mimi.hu/biology/dna_ligase.html", "passage_text": "DNA ligase (pdb-molecule of the month): DNA ligase reconnects DNA strand s when they are broken. It uses a cofactor molecule (shown in red) for power and a special lysine amino acid (shown in magenta) to perform the re action.DNA ligase. The enzyme that joins the 5' and 3' ends of poly nucleotide chains by the formation of a phosphodiester bond between them. DNA ligase In recombinant DNA technology, an enzyme that seals together two DNA fragments from different sources to form a recombinant DNA molecule.DNA polymerase In DNA replication, the enzyme that links the complement ary nucleotide s together to form the newly synthesized strand."}, {"url": "http://medical-dictionary.thefreedictionary.com/Dna+ligases", "passage_text": "DNA ligase, an enzyme that can repair breaks in a strand of deoxyribonucleic acid (DNA) by synthesizing a bond between adjoining nucleotides. Under some circumstances the enzyme can join together loose ends of DNA strands, and in some cases it can repair breaks in ribonucleic acid (RNA). It serves as a catalyst. DNA ligase either of two enzymes that join two double-helical molecules of DNA together to make a longer DNA molecule. ligase chain reaction a type of DNA amplification that uses DNA ligase to link chains and amplify the template containing the sequence in question."}]