[{"url": "http://plato.stanford.edu/entries/hermeneutics/", "passage_text": "With the emergence of German romanticism and idealism the status of hermeneutics changes. Hermeneutics turns philosophical. It is no longer conceived as a methodological or didactic aid for other disciplines, but turns to the conditions of possibility for symbolic communication as such. The term hermeneutics covers both the first order art and the second order theory of understanding and interpretation of linguistic and non-linguistic expressions. As a theory of interpretation, the hermeneutic tradition stretches all the way back to ancient Greek philosophy. In the course of the Middle Ages and the Renaissance, hermeneutics emerges as a crucial branch of Biblical studies. Later on, it comes to include the study of ancient and classic cultures"}, {"url": "http://www.iep.utm.edu/gadamer/", "passage_text": "Hans-Georg Gadamer (1900—2002). Hans-Georg Gadamer was a leading Continental philosopher of the twentieth century. His importance lies in his development of hermeneutic philosophy. Hermeneutics, “the art of interpretation,” originated in biblical and legal fields and was later extended to all texts. The eagerness to conceive of the dialogical impetus of hermeneutics as a possible resource for resolving certain contemporary social and political crises in our world is found in much of the secondary literature on Gadamer."}, {"url": "http://plato.stanford.edu/entries/gadamer/", "passage_text": "Hans-Georg Gadamer is the decisive figure in the development of twentieth century hermeneutics—almost certainly eclipsing, in terms of influence and reputation, the other leading figures, including Paul Ricoeur, and also Gianni Vattimo (Vattimo was himself one of Gadamer's students). 1 Risser, James, 1997, Hermeneutics and the Voice of the Other: Re-Reading Gadamer's Philosophical Hermeneutics, Albany, NY: SUNY Press. 2  Rorty, Richard, 1979, Philosophy and the Mirror of Nature, Princeton: Princeton University Press."}, {"url": "https://en.wikipedia.org/wiki/Hans-Georg_Gadamer", "passage_text": "In addition to his work in hermeneutics, Gadamer is also well known for a long list of publications on Greek philosophy. Indeed, while Truth and Method became central to his later career, much of Gadamer's early life centered around studying Greek thinkers, Plato and Aristotle specifically. Gadamer's philosophical project, as explained in Truth and Method, was to elaborate on the concept of  philosophical hermeneutics , which Heidegger initiated but never dealt with at length."}, {"url": "http://facta.junis.ni.ac.rs/pas/pas200201/pas200201-02.pdf", "passage_text": "Gadamer's Hermeneutics as Practical Philosophy 615 Before focusing on the mentioned problems, it is necessary to draw one's attention to adilemma and critique of Gadamer's hermeneutics. Starting from Heideggers definition of being astime, and understanding as the mode of being or Dasein, Gadamer comes to an insightthat the historical character of every understanding is a principle of"}, {"url": "http://facta.junis.ni.ac.rs/pas/pas200201/pas200201-02.pdf", "passage_text": "Gadamer's Hermeneutics as Practical Philosophy 611 Every situation is characterized by a certain horizon. Husserl used to play with thisnotion in the final phase of his work, but always meant it as something that restricts ourview on the environment. Starting from Heideggers definition of being astime, and understanding as the mode of being or Dasein, Gadamer comes to an insightthat the historical character of every understanding is a principle of hermeneutics."}, {"url": "http://www.iep.utm.edu/gadamer/", "passage_text": "In other words, the importance of the terms, “prejudice” and “tradition,” for Gadamer’s hermeneutics lies in the way they indicate the active nature of understanding that produces something new. Tradition hands down certain interests, prejudices, questions, and problems, that incite knowledge. The eagerness to conceive of the dialogical impetus of hermeneutics as a possible resource for resolving certain contemporary social and political crises in our world is found in much of the secondary literature on Gadamer."}, {"url": "https://en.wikipedia.org/wiki/Hermeneutics", "passage_text": "Hermeneutic consistency refers to the analysis of texts to achieve a coherent explanation of them. Philosophical hermeneutics refers primarily to the theory of knowledge initiated by Martin Heidegger and developed by Hans-Georg Gadamer in his Truth and Method (1960). Biblical hermeneutics is the study of the principles of interpretation of the Bible. While Jewish and Christian biblical hermeneutics have some overlap, they have distinctly different interpretive traditions."}, {"url": "https://en.wikipedia.org/wiki/Hermeneutics", "passage_text": "Hermeneutics is derived from the Greek word ἑρμηνεύω (hermeneuō, translate, interpret), from ἑρμηνεύς (hermeneus, translator, interpreter), of uncertain etymology (R. S. P. Beekes has suggested a Pre-Greek origin). Biblical hermeneutics is the study of the principles of interpretation of the Bible. While Jewish and Christian biblical hermeneutics have some overlap, they have distinctly different interpretive traditions."}]