[{"url": "http://www.highcliffvets.com/index.php/our-practice/careers/becoming-a-veterinary-nurse", "passage_text": "To become a Veterinary Nurse: 1  You must be 17 years or older. 2  Employed at a Veterinary Nurse Approved Centre (VNAC) or at an RCVS registered Training Practice (TP). 3  For up-to-date details of practices please consult the Royal College of Veterinary Surgeons website: www.rcvs.org.uk. 1 Gain GCSE's or take one-year course on Pre-Veterinary Nursing, whilst working in a veterinary practice. 2  Exams are then taken at the end of first year and your first part of your portfolio needs to be assessed. 3  Stage 2."}, {"url": "http://www.rcvs.org.uk/education/i-want-to-be-a-veterinary-nurse/", "passage_text": "Veterinary nursing is the supportive care of animals receiving treatment within a veterinary practice. A veterinary nurse works as a member of the veterinary team, providing expert nursing care for sick animals. Veterinary nurses also play a significant role in educating owners on maintaining the health of their pets. The RCVS Certificate in Veterinary Nursing is also awarded to all graduates of courses accredited by us. It should be noted that candidates for veterinary nurse training must satisfy the entry requirements of their chosen university."}, {"url": "http://www.highcliffvets.com/index.php/our-practice/careers/becoming-a-veterinary-nurse", "passage_text": "1 You must be 17 years or older. 2  Employed at a Veterinary Nurse Approved Centre (VNAC) or at an RCVS registered Training Practice (TP). 3  For up-to-date details of practices please consult the Royal College of Veterinary Surgeons website: www.rcvs.org.uk. 1 Gain GCSE's or take one-year course on Pre-Veterinary Nursing, whilst working in a veterinary practice. 2  Exams are then taken at the end of first year and your first part of your portfolio needs to be assessed. 3  Stage 2."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20080829061415AAe2vvq", "passage_text": "For this scheme, you must be employed as a trainee in a RCVS-registered veterinary nurse training practice or study through a RCVS-approved course in veterinary nursing. You need five GCSEs/S grades (A-C/1-3), including English, maths and a science subject or equivalent entry qualifications. "}, {"url": "https://nationalcareersservice.direct.gov.uk/advice/planning/jobprofiles/Pages/veterinarynurse.aspx", "passage_text": "Entry requirements. You can qualify as a veterinary nurse through work-based training or by completing a higher education course. Both of these routes allow you to register as a veterinary nurse with the Royal College of Veterinary Surgeons (RCVS). Both of these options lead to the Level 3 Diploma in Veterinary Nursing qualification. To enrol on an apprenticeship, you'll need to find work as a trainee with an approved veterinary training practice before you can start."}, {"url": "https://www.bluecross.org.uk/how-become-veterinary-nurse", "passage_text": "The current veterinary nursing qualification is the Royal College of Veterinary Surgeon’s (RCVS) level three diploma in veterinary nursing. It can be done on either a full time basis or apprenticeship-style alongside a job in a veterinary practice. It takes between two and three years to qualify. Qualifying as a veterinary nurse. To qualify as a veterinary nurse you must: Be enrolled as a student veterinary nurse with the RCVS. Attend college-based study for a minimum of 22 weeks over the period of training before exams are sat – usually two years. The college must be approved by the RCVS"}, {"url": "http://work.chron.com/become-veterinary-nurse-11324.html", "passage_text": "As a veterinary nurse, you are responsible for helping licensed veterinarians treat and care for animals, including those that are sick and injured. According to the United States Bureau of Labor Statistics, the demand for veterinary nurses is expected to increase by 52 percent between the years 2010 and 2020. Ensure that you meet the minimum age requirement. In many states, you must be at least 18 years of age or older to become a veterinary nurse."}, {"url": "http://vetnurse.com.au/qualifications.html", "passage_text": "Qualified Veterinary Nurse. This nationally recognised qualification is available to any student already employed as a Vet Nurse for a minimum of 15 hours per week. You’ll learn at the highest level, covering all the major aspects of veterinary nursing over a two-year program. "}, {"url": "http://www.rcvs.org.uk/education/i-want-to-be-a-veterinary-nurse/", "passage_text": "The Level 3 Diploma in Veterinary Nursing is a vocational qualification designed to prepare veterinary nurses for professional registration on the Royal College of Veterinary Surgeons’ Register of Veterinary Nurses. The RCVS Certificate in Veterinary Nursing is also awarded to all graduates of courses accredited by us. It should be noted that candidates for veterinary nurse training must satisfy the entry requirements of their chosen university."}]