[{"url": "http://www.adaa.org/finding-help/treatment/medication", "passage_text": "Medication. Medication treatment of anxiety is generally safe and effective and is often used in conjunction with therapy. Medication may be a short-term or long-term treatment option, depending on severity of symptoms, other medical conditions, and other individual circumstances."}, {"url": "http://www.healthboards.com/healthcenter/anxiety/most-commonly-prescribed-anxiety-medications.html", "passage_text": "Most Commonly Prescribed Anxiety Medications. Psychotherapy is recommended for treatment of anxiety, but when psychotherapy alone is not sufficient to quell the worry, racing heart, shaking and other symptoms of anxiety disorder, then medication can be effective."}, {"url": "http://www.mayoclinic.org/diseases-conditions/social-anxiety-disorder/basics/treatment/con-20032524", "passage_text": "First choices in medications. Several types of medications are used to treat social anxiety disorder. However, selective serotonin reuptake inhibitors (SSRIs) are often the first type of medication tried for persistent symptoms of social anxiety. Your doctor may prescribe Paroxetine (Paxil) or Sertraline (Zoloft)."}, {"url": "http://www.takingcharge.csh.umn.edu/manage-health-conditions/anxiety-depression/what-about-prescription-medication-and-treatments-anxiet", "passage_text": "Medicines used to treat anxiety disorder may be especially helpful for people whose anxiety is interfering with daily functioning. The medications most often used to treat anxiety are: 1  Benzodiazepines. 2  These medications are sometimes referred to as tranquilizers, because they may leave you feeling calm and relaxed."}, {"url": "http://www.mayoclinic.org/diseases-conditions/social-anxiety-disorder/basics/treatment/con-20032524", "passage_text": "Other medications. Your doctor or mental health provider may also prescribe other medications for symptoms of social anxiety, such as: 1  Other antidepressants. 2  You may have to try several different antidepressants to find one that's the most effective for you with the fewest side effects. 3  Anti-anxiety"}, {"url": "http://www.rxlist.com/anxiety_medications/drugs-condition.htm", "passage_text": "Anxiety medications include multiple types of drugs that are used to treat the symptoms of anxiety disorders. The three most commonly prescribed types of anxiety medication are antidepressants, anti-anxiety medications (also known as anxiolytics), and beta-blockers. Antidepressants and anxiolytic medications work primarily by affecting the balance of certain chemicals in the brain known as neurotransmitters."}, {"url": "http://www.panic-and-agoraphobia.com/list-of-anxiety-medications.html", "passage_text": "Below is a list of anxiety medications commonly prescribed for anxiety disorders and panic attacks. If you are have anxiety and panic problems, you may be feeling desperate. We totally get this and feel for you! Anxiety and depression can negatively impact your life and make you feel helpless and hopeless."}]