[{"url": "http://www.evolvehairreplacement.com/hair_articles/drinking_water_and_hair_loss.html", "passage_text": "Something that is often overlooked is the effect of water and dehydration on hair loss. Each hair shaft is made up of 1/4 water and when you don't drink enough, it causes your hair to become weak. Water also helps to flush your body of toxins which could be a major contributor to"}, {"url": "http://www.mayoclinic.org/diseases-conditions/dehydration/basics/causes/CON-20030056", "passage_text": "Other dehydration causes include: 1  Diarrhea, vomiting. 2  Severe, acute diarrhea — that is, diarrhea that comes on suddenly and violently — can cause a tremendous loss of water and electrolytes in a short amount of time. 3  If you have vomiting along with diarrhea, you lose even more fluids and minerals."}, {"url": "https://answers.yahoo.com/question/index?qid=20111212025606AAomdlL", "passage_text": "While hair is growing, it is also falling out. People experience hair loss in two different ways; shedding and breakage. Hair sheds from the roots and it breaks off anywhere along the hair strand. Dehydration can cause shedding and breakage, which can affect the length and thickness of the hair."}, {"url": "https://answers.yahoo.com/question/index?qid=20111212025606AAomdlL", "passage_text": "Water also clears the body from pollutants, which also cause hair loss. Without proper hydration, hair and skin show evidence of dryness that can only be restored by drinking water. When a person is suffering from dehydration, hardly any of their water supply is getting to their hair."}, {"url": "http://www.ehow.com/about_5052377_can-dehydration-cause-hair-loss.html", "passage_text": "Hair Problems from Dehydration. Hair loss is just one of the things that can result from dehydration. Experts believe that drinking the recommended amount of water can help other hair and scalp issues, such as hair thinning and dandruff."}, {"url": "http://www.ehow.com/about_5052377_can-dehydration-cause-hair-loss.html", "passage_text": "About Hair Loss. To completely understand how dehydration causes hair loss, you must understand how hair loss happens. The integumentary system is constantly growing, and hair has a six-year life span. While hair is growing, it is also falling out. People experience hair loss in two different ways; shedding and breakage."}]