[{"url": "http://formulas.tutorvista.com/physics/efficiency-formula.html", "passage_text": "Efficiency is defined as the ratio of useful work done to the heat or energy absorbed by the particular system. It is denoted by $\\eta$. Efficiency formula is used to calculate the efficiency for any given input. It is unit less and is expressed in percentage. Efficiency Formula. Efficiency formula in terms of Work is given by. Efficiency formula in terms of Energy is given by. Efficiency generally refers to how far we are getting the particular outcome for the given input with as much less wastage as possible."}, {"url": "http://www.softschools.com/formulas/physics/efficiency_formula/29/", "passage_text": "Efficiency Formula. Efficiency Formula. Efficiency is a measure of how much work or energy is conserved in a process. In many processes, work or energy is lost, for example as waste heat or vibration. The efficiency is the energy output, divided by the energy input, and expressed as a percentage. A perfect process would have an efficiency of 100%. η = efficiency (Greek letter eta). W out = the work or energy produced by a process"}, {"url": "http://www.leydenscience.org/physics/work/effic.htm", "passage_text": "Calculating Efficiency of Simple Machines. Efficiency is a measure of how much more work must be put into a machine than you get out of the machine. In the real world, the efficiency of a machinewill always be less than 100%. This means that a machine will never do work for you. If there was no friction, the best you could hope for is an efficiency of 100% meaning work in = work out. We can calculate efficiency by comparing work out to work in.Look below for an example. Efficiency = Work input / Work output x 100%. or we can calculate effiency by comparing TMA to AMA."}, {"url": "http://www.answers.com/Q/How_do_you_calculate_machine_efficiency", "passage_text": "Machine Efficiency= Work done by a machine on a load divided by work done on a machine by an effort force. multiply that by 100%. Work(J)=force(N)multiplied by Distance(m). The answer above is correct but not much use for a practical situation such as a motor driving a pump or a compressor being driven by a turbine. "}, {"url": "http://www.accountingtools.com/questions-and-answers/what-is-the-formula-for-calculating-efficiency.html", "passage_text": "The efficiency equation is a comparison of the work output from an operation to the work input to that same operation. The amount of work could refer to time, effort, capacity, or more tangible items. A high level of efficiency implies a minimal amount of wasted time, effort, capacity, materials, and so forth. This can translate into a high level of profitability in a business. The efficiency formula is: (Work output / Work input) x 100%. The work output in this definition is considered to be the useful amount of work output-that is, all scrap, spoilage, and waste is excluded from the numerator. The efficiency formula can be used in a variety of areas, such as to examine the efficiency of motors and in quantifying energy utilization"}, {"url": "http://van.physics.illinois.edu/qa/listing.php?id=354", "passage_text": "For example, if you put 100 Joules of energy into a machine, and got 50 Joules back out (and the other 50 Joules was wasted by the machine), you would have 50% efficiency. You can calculate percent efficiency by taking how much energy you got out, dividing it by how much you started with, and multiplying by 100%. My physics teacher wants us to calculate the efficiency of out catapults. she gave us a formula, but it doesn't work. The mass of the tennis ball we are launching is 57g, and the horizontal distance it traveled is 16 meters. The length of the arm is .6 meters (2 feet)."}]