[{"url": "http://health.howstuffworks.com/skin-care/problems/medical/periungual-warts2.htm", "passage_text": "Not all periungual warts respond the same to treatment, and multiple applications of a product -- or many visits to a dermatologist -- may be required to finally remove the abnormal skin growth. For more information on periungual warts, follow the links on the next page. Treating Periungual Warts. There are many ways to treat periungual warts. In some cases, they will disappear on their own, but if the growth is painful, unsightly or spreading, there are a few options for removal. It's possible to begin treating the wart by applying salicylic acid or one of several over-the-counter wart removers"}, {"url": "http://www.healthcentre.org.uk/cosmetic-treatments/wart-periungual-warts-treatment.html", "passage_text": "Periungual warts have a characteristic rough appearance, with irregular borders and what is often described as a cauliflower like look. These warts can form rather large lesions, which can become quite painful as the wart continues to grow and affect the natural growth of your nail. These warts are small growths the start off fairly smooth before assuming the characteristically rough texture of other warts. The extent of growth that periungual warts can achieve is what makes them distinct from other types of wart."}, {"url": "http://www.healthcentre.org.uk/cosmetic-treatments/wart-periungual-warts-treatment.html", "passage_text": "If you notice a periungual wart is advisable to seek or begin treatment as soon as you can to avoid the growth having an effect on your nail plate. Some warts can be under the nail plate, which poses a more difficult challenge in terms of treatment. These warts are small growths the start off fairly smooth before assuming the characteristically rough texture of other warts. The extent of growth that periungual warts can achieve is what makes them distinct from other types of wart."}, {"url": "http://www.wartsresource.com/periungual-warts", "passage_text": "Periungual warts can appear around the nails or even under the nails. These warts can produce considerable pain as they enlarge. If periungual warts are not treated they can cause the fingernails or toenails to detach from the nail beds. The loss of a nail can expose the nail bed to injury and possibly infection. There are over 100 different strains of HPV identified. The specific strain of HPV that is present will determine what kind of warts will appear. Periungual warts are just one type of the wart family."}, {"url": "http://ctfootcare.blogspot.com/2013/02/what-are-periungual-warts.html", "passage_text": "The Periungual wart is one of the warts that is caused by HPV. A Periungual wart is an abnormal growth that starts out the size of a pinhead. In the beginning they are. difficult to notice and are so smooth people don't often notice them. The Human Papilloma Virus has over 100 identified strains, some of which are warts. The HPV causes warts which are named for where they appear on the body and what they look like. People with healthy and strong immune systems aren't prone to warts, but those with a compromised or low immune system do."}, {"url": "http://ocwartstreatment.com/periungual-warts", "passage_text": "Periungual warts are a type of wart caused by the Human Papilloma Virus. Periungual warts appear under or near toenails and fingernails. They start out small, about the size of pinhead but can grow larger and affect nail growth. Periungual Warts are easily identified because of their location near the fingernails and toenails. Periungual warts may look like rough bumps with uneven borders. Periungual warts may also take on a cauliflower like appearance."}, {"url": "https://en.wikipedia.org/wiki/Periungual_wart", "passage_text": "Periungual warts are warts that cluster around the fingernail or toenail. They appear as thickened, fissured cauliflower-like skin around the nail plate. Periungual warts often cause loss of the cuticle and paronychia. Nail biting increases susceptibility to these warts. Warts of this kind often cause damage to the nail either by lifting the nail from the skin or causing the nail to partially detach. If they extend under the nail, then the patient may suffer pain as a result. Sometimes periungual wart infections resemble the changes that are found in onychomycosis"}, {"url": "http://ocwartstreatment.com/periungual-warts", "passage_text": "Periungual warts are normally caused by the human papilloma virus (HPV). The virus enters the body through breaks in the skin such as cuts and abrasions. Periungual Warts are easily identified because of their location near the fingernails and toenails. Periungual warts may look like rough bumps with uneven borders. Periungual warts may also take on a cauliflower like appearance."}, {"url": "http://www.wartsresource.com/periungual-warts", "passage_text": "Periungual Warts. There are over 100 different strains of HPV identified. The specific strain of HPV that is present will determine what kind of warts will appear. Periungual warts are just one type of the wart family. 1"}]