[{"url": "http://www.roofingcostcalculator.com/prices/asphalt-roof-costs.html", "passage_text": "Asphalt Roof Costs. Asphalt roof costs range from $2.50 to $6 per square foot fully installed. Asphalt shingled roofs are either a composite organic shingle or the lighter woven fiberglass option. This is one of the least are expensive roofing options, significantly less than concrete and clay tiles for instance. "}, {"url": "http://home.costhelper.com/asphalt-shingle-roof.html", "passage_text": "1 Having a roofing contractor remove (and dispose of) old roofing materials, then install asphalt shingles runs about $1-$4 a square foot, or a total of $1,700-$8,400 for a typical ranch-style home (1,700-2,100 square foot, gently sloping roof). 1 Do-it-yourself materials run around $680-$3,700 for a typical one-story ranch-style home with a 1,700-2,100-square-foot, gently-sloping roof. 2  Standard gray asphalt shingles in a three-tab rectangle are the least expensive; expect to pay more for higher-end colors and styles."}, {"url": "http://costowl.com/home-improvement/roof-asphalt-shingle-cost.html", "passage_text": "1 High end architectural shingles, however, could run as much as $6 to $8 per square foot installed ($9,000 to $12,000). 2  Removing and disposing of your existing roof could cost an additional $1 to $4 per square foot to the total asphalt shingle roofing cost. Asphalt Shingle Roof Average Costs. The actual cost of an asphalt shingle roof may vary depending on the materials used, your location, the complexity of the installation (i.e. roof slope and home height), and other factors. 1  3-Tab asphalt shingles cost $1.50 to $3.50 per square foot."}, {"url": "http://www.roofery.com/shingles/pricing.html", "passage_text": "Installation Costs. Stuge says the cost of installation varies not only by the type of material but by the pitch or slant in the roof as well. With asphalt shingles for example, installation costs could range from $25 per square foot for a flat roof up to $50 per square foot for a high pitched roof. A square of shingles covers 100 square feet. Pricing is quoted by the bundle or by the square, and there are typically 3 bundles per square for standard 3-tab asphalt shingles. (Heaver shingles may be divided into 4 or 5 bundles per square.)."}, {"url": "http://costowl.com/home-improvement/roof-asphalt-shingle-cost.html", "passage_text": "1 3-Tab asphalt shingles cost $1.50 to $3.50 per square foot. 2  For an average-sized (1,500 square foot roof), the total cost might be $2,250 to $5,250. 3  Architectural asphalt roof shingles cost, on average, cost around 20 to 40 percent more than 3-Tab shingles, or $2.50 to $5.00 per square foot installed ($3,750 to $7,500). Asphalt Shingle Roof Average Costs. The actual cost of an asphalt shingle roof may vary depending on the materials used, your location, the complexity of the installation (i.e. roof slope and home height), and other factors. 1  3-Tab asphalt shingles cost $1.50 to $3.50 per square foot."}, {"url": "http://www.answers.com/Q/What_is_the_average_cost_per_square_foot_to_install_roof", "passage_text": "It depends on the type of roof. A single story low pitch asphalt shingle roof will cost around $40 - $80 per square (100 sq. ft.) to tear off and $75 - $100 per square to install new shingles. If the plywood sheathing underneath is damaged, it will cost extra, up to $50 per sheet replaced. The installed cost and materials for this type of roof typically are between $4.00 to $6.00 per square foot. Both of these roofs are available in many colors and long term warranties.   Bret Lyon   Lyon Metal Roofing and Supply   blyon@lyonroofing.com   wesellmetalroofing.com."}, {"url": "http://costowl.com/home-improvement/roof-asphalt-shingle-cost.html", "passage_text": "1 Architectural asphalt roof shingles cost, on average, cost around 20 to 40 percent more than 3-Tab shingles, or $2.50 to $5.00 per square foot installed ($3,750 to $7,500). 2  High end architectural shingles, however, could run as much as $6 to $8 per square foot installed ($9,000 to $12,000). Asphalt Shingle Roof Average Costs. The actual cost of an asphalt shingle roof may vary depending on the materials used, your location, the complexity of the installation (i.e. roof slope and home height), and other factors. 1  3-Tab asphalt shingles cost $1.50 to $3.50 per square foot."}, {"url": "http://www.roofcalc.org/roof-installation-prices/", "passage_text": "Underlayment and accessories cost another $40-50 / square. Dump fees can range from $30-100 per ton (2000 lbs.) depending on where you live. 1 square of 1 layer of shingles weighs ~ 250 lbs., or 8 squares per ton. a 15 sq. roof is about 2 tons for one layer to be removed. A typical dumpster rental fee is $350 with 2-3 tons of debris allotment. Read our complete Asphalt Roofing Shingles Prices Guide here. Labor cost: If a typical roof installer gets $15/hr, and a foreman gets $20/hr, and you need say 6 guys to rip and install a 15 square roof in one day, that gives you 5 guys * $15/hr * 8 hours = $600."}, {"url": "http://www.costowl.com/home-improvement/roof-shingles-certainteed-cost.html", "passage_text": "1 CertainTeed Traditional roofing shingles cost approximately $2 to $4 per square foot installed. 2  For a roof with 2,000 square feet, that s a total cost of $4,000 to $8,000. "}]