[{"url": "http://www.physics.ohio-state.edu/~kagan/phy367/P367_articles/HydroElectric/hydroelectric.html", "passage_text": "Hydro-electric power plants convert the kinetic energy contained in falling water into electricity. The energy in flowing water is ultimately derived from the sun, and is therefore constantly being renewed. Energy contained in sunlight evaporates water from the oceans and deposits it on land in the form of rain. Hydro-electric Power Plants. Hydro-electric power plants capture the energy released by water falling through a vertical distance, and transform this energy into useful electricity. In general, falling water is channelled through a turbine which converts the water's energy into mechanical power."}, {"url": "http://www.c2es.org/technology/factsheet/hydropower", "passage_text": "Quick Facts. 1  Hydropower is a renewable, efficient, and reliable source of energy that does not directly emit greenhouse gases or other air pollutants, and that can be scheduled to produce power as needed, depending on water availability. Hydropower, or hydroelectricity, is electricity generated by the force of moving water in the penstock [8] of a hydropower unit. Turbines are used to capture the kinetic energy of water by converting it to electricity as the falling water spins the turbine."}, {"url": "http://www.hydro.org/why-hydro/reliable/", "passage_text": "Hydropower is a proven renewable energy resource generated and used in all regions of the U.S. for over a century, today providing approximately 30 million homes with affordable power. Pumped storage, a type of hydropower technology, can actually help store the electricity generated by other power sources like solar, wind, and nuclear for later use. The technology stores energy in the form of water in an upper reservoir, pumped from a second reservoir at a lower elevation."}, {"url": "http://www.hydro.org/why-hydro/", "passage_text": "Hydropower is the nation’s most available, reliable, affordable and sustainable energy source. Requiring only the power of moving water – rivers, streams and ocean tides– hydropower is also domestic and sustainable. Hydropower has been a reliable source of power in the United States for over 100 years. That proven reliability benefits the national electric grid in a number of ways, from supporting other renewable energy sources to stabilizing the network to storing electricity for later use."}, {"url": "https://tva.gov/Energy/Our-Power-System/Hydroelectric", "passage_text": "Hydroelectric power is the most clean, reliable, efficient and economical of all renewable energy sources. And thanks to the Tennessee River system, we have plenty of it in our region. "}, {"url": "http://water.usgs.gov/edu/wuhy.html", "passage_text": "1 Hydropower is the most important and widely-used renewable source of energy. 2  Hydropower represents 19% of total electricity production. 3  China is the largest producer of hydroelectricity, followed by Canada, Brazil, and the United States (Source: Energy Information Administration). Although most energy in the United States is produced by fossil-fuel and nuclear power plants, hydroelectricity is still important to the Nation, as about 7 percent of total power is produced by hydroelectric plants."}, {"url": "https://canadahydro.ca/facts/", "passage_text": "Canadian Hydropower. Electricity that is clean, renewable and reliable. Hydropower offers a sustainable and affordable source of electricity. It converts waterpower into electricity at a more than 90% efficiency rate, without consuming or depleting water. Converting up to 95% of available energy into electricity, hydropower is the most efficient source of electrical energy. By comparison, the best fossil fuel power plants operate at approximately 60% efficiency."}, {"url": "http://www.physics.ohio-state.edu/~kagan/phy367/P367_articles/HydroElectric/hydroelectric.html", "passage_text": "Hydro power is currently the world's largest renewable source of electricity, accounting for 6% of worldwide energy supply or about 15% of the world's electricity. In Canada, hydroelectric power is abundant and supplies 60% of our electrical needs. Hydro-electric Power Plants. Hydro-electric power plants capture the energy released by water falling through a vertical distance, and transform this energy into useful electricity. In general, falling water is channelled through a turbine which converts the water's energy into mechanical power."}, {"url": "http://www.c2es.org/technology/factsheet/hydropower", "passage_text": "1 Hydropower is a renewable, efficient, and reliable source of energy that does not directly emit greenhouse gases or other air pollutants, and that can be scheduled to produce power as needed, depending on water availability. 2  There are about 78,000 megawatts of hydropower generation capacity in the United States. [ 3 1]. Hydropower, or hydroelectricity, is electricity generated by the force of moving water in the penstock [8] of a hydropower unit. Turbines are used to capture the kinetic energy of water by converting it to electricity as the falling water spins the turbine."}, {"url": "http://www.kids.esdb.bg/hydro.html", "passage_text": "Hydro energy. Hydropower is a clean, renewable and reliable energy source which converts kinetic energy from falling water into electricity, without consuming more water than is produced by nature. Quite simply the oldest method by which renewable energy has been harnessed by the human race. "}]