[{"url": "http://www.ourdocuments.gov/doc.php?flash=true&doc=47", "passage_text": "(on Archives.gov). The Chinese Exclusion Act was approved on May 6, 1882. It was the first significant law restricting immigration into the United States. In the spring of 1882, the Chinese Exclusion Act was passed by Congress and signed by President Chester A. Arthur. This act provided an absolute 10-year moratorium on Chinese labor immigration"}, {"url": "http://www.bu.edu/hr/policies/federal-and-state-laws/immigration-reform-and-control-act-irca/", "passage_text": "Immigration Reform and Control Act (IRCA). When Congress passed and the president signed into law the Immigration Reform and Control Act of 1986, the result was the first major revision of America’s immigration laws in decades. "}, {"url": "https://en.wikipedia.org/wiki/History_of_laws_concerning_immigration_and_naturalization_in_the_United_States", "passage_text": "The act excluded Chinese laborers from immigrating to the United States for ten years and was the first immigration law passed by Congress. Laborers in the United States and laborers with work visas received a certificate of residency and were allowed to travel in and out of the United States. A literacy requirement was added in the Immigration Act of 1917. In 1921 the United States Congress passed the Emergency Quota Act, which established national immigration quotas. The quotas were based on the number of foreign-born residents of each nationality who were living in the United States as of the 1910 census."}, {"url": "https://en.wikipedia.org/wiki/List_of_United_States_immigration_legislation", "passage_text": "1 The Page Act of 1875 was the first act restricting immigration. 2  The Immigration Act of 1882 imposed a 50 cent head tax to fund immigration officials. 3  The Chinese Exclusion Act (1882) allowed the U.S. to suspend Chinese immigration, a ban that was intended to last 10 years. 1 The Immigration Act of 1882 imposed a 50 cent head tax to fund immigration officials. 2"}, {"url": "http://www.fairus.org/facts/us_laws", "passage_text": "Congress enacted the first significant federal legislation relating specifically to immigration. Among its provisions, it: (1) established the continuing reporting of immigration to the United States; and (2) set specific sustenance rules for passengers of ships leaving U.S. ports for Europe. Illegal Immigration and the IRCA of 1986. Immigration legislation focusing on illegal immigration was considered and passed by the 99th Congress, and enacted as the Immigration Reform and Control Act (IRCA) of 1986 P.L. 99-603 (November 6, 1986; 100 Stat."}, {"url": "http://www.eugenicsarchive.org/html/eugenics/essay9text.html", "passage_text": "Paul Lombardo, University of Virginia. Congress passed America's first naturalization law in 1790. It limited the privilege of US citizenship to free white persons.. About a century later, immigration laws began to restrict who could enter the country."}, {"url": "http://memory.loc.gov/ammem/awhhtml/awlaw3/immigration.html", "passage_text": "The Immigration Act of 1875 was the first immigration law that excluded groups of people from the United States—and women were part of that exclusion. "}, {"url": "http://www.infoplease.com/us/immigration/legislation-timeline.html", "passage_text": "U.S. The Naturalization Act of 1790, the country's first naturalization statute, says that unindentured white males must live in the U.S. for two years before becoming citizens. The Naturalization Act of 1790 is amended and extends the residency requirement to five years. "}, {"url": "http://ocp.hul.harvard.edu/immigration/exclusion.html", "passage_text": "The Chinese Exclusion Act was the first major law restricting immigration to the United States. It was enacted in response to economic fears, especially on the West Coast, where native-born Americans attributed unemployment and declining wages to Chinese workers whom they also viewed as racially inferior. "}]