[{"url": "http://goflorida.about.com/od/floridaweathe1/qt/Destin-Weather.htm", "passage_text": "Destin, located in Northwest Florida's Panhandle, has an overall average high temperature of 78° and an average low of 54°. The highest recorded temperature in Destin was 107° in 1980 and the lowest recorded temperature was a very 4° in 1985. On average Destin's warmest month is July and January is the average coolest month. The maximum average rainfall usually falls in July."}, {"url": "http://www.currentresults.com/Weather/Florida/Places/destin-temperatures-by-month-average.php", "passage_text": "The numbers here tell you how hot and cold the weather usually is in Destin, Florida during each month of the year. The average high and low temperatures are listed below monthly and annually for the city, in both degrees Fahrenheit and Celsius. Maximums and minimums are only part of the temperature picture."}, {"url": "http://www.areavibes.com/destin-fl/weather/", "passage_text": "The highest average temperature in Destin is July at 82.9 degrees. The coldest average temperature in Destin is January at 55 degrees. The most monthly precipitation in Destin occurs in August with 5.8 inches. The Destin weather information is based on the average of the previous 3-7 years of data. Loading..."}, {"url": "https://weatherspark.com/averages/30093/Destin-Florida-United-States", "passage_text": "This report describes the typical weather at the Destin-Fort Walton Beach Airport (Destin, Florida, United States) weather station over the course of an average year. It is based on the historical records from 1998 to 2012. Earlier records are either unavailable or unreliable."}, {"url": "http://www.areavibes.com/destin-fl/weather/", "passage_text": "5.5. The highest average temperature in Destin is July at 82.9 degrees. The coldest average temperature in Destin is January at 55 degrees. The most monthly precipitation in Destin occurs in August with 5.8 inches. The Destin weather information is based on the average of the previous 3-7 years of data. Loading..."}]