[{"url": "http://richestcelebrities.org/richest-rappers/snoop-dogg-net-worth/", "passage_text": "Snoop Dogg net worth: Snoop Dogg net worth is about $120 Million and it was place his name among the most affluent hip hop artists on the planet. Does that amount of money cease because sum? "}, {"url": "http://www.access2knowledge.org/business-finance/snoop-dogg-net-worth/", "passage_text": "Snoop Dogg Net Worth. According to Forbes, the 2013 new worth of Snoop Dogg was $130 million. Snoop is a great businessman – he made $10 million more in 2013 alone. Snoop Dogg Earnings: 1  Online music distribution site. 2  Syndication of his television show. 3  Skullcandy headphones. "}, {"url": "http://celebritypost.net/snoop-dogg-net-worth/", "passage_text": "Marital Life Of Snoop Dogg. Snoop Dogg wife is his real sweetheart. Snoop married to Shante Taylor on June 12, 1997. Shante had been with Snoop since long even nobody knows how much is Snoop Dogg worth. The couple got married at The Ritz Carlton Hotel in Marina Del Rey, California. The couple was dressed in all white. American rapper, marijuana activist, record producer, entertainer and actor, Calvin Cordozar also well know as Snoop Dogg net worth is about $135 million. The celeb followed the footsteps of his colleagues of West Coast like Ice Cube and Ice – T while adding acting to his repertoire in the decade of 90."}, {"url": "http://www.celebritynetworth.com/list/top-50-richest-rappers/", "passage_text": "P Diddy Net Worth. $730 Million. P Diddy net worth: P Diddy is a rapper, actor, record producer, and men's fashion designer who has a net worth of $730 million dollars. "}, {"url": "http://www.answers.com/Q/What_is_Snoop_Dogg's_net_worth", "passage_text": "Something like 200 million dollars. No, Snoop Dogg is worth well over 250 million dollars. He is always reinventing himself and collaboating with young Artists, and he's one of the original rappers. 2.5 billion dollars.... "}, {"url": "http://www.celebritynetworth.com/richest-celebrities/richest-rappers/snoop-dogg-net-worth/", "passage_text": "$135 Million. Snoop Dogg net worth: Snoop Dogg is a West Coast based rapper, actor and media mogul who has a net worth of $135 million. Snoop Dogg is one of the wealthiest and most successful rappers to come out of the 1990s rap scene, and one of the few still recording today. "}, {"url": "http://www.youtube.com/watch?v=9A7ofSm7a90", "passage_text": "Publisert 16. feb. 2015. Rapper Snoop Dogg was born Calvin Cordozar Broadus, Jr. on October 20, 1971, in Long Beach, California. He began rapping as early as sixth grade, although his career was waylaid after high school when he spent time in prison for possession of cocaine. "}, {"url": "http://www.therichest.com/celebnetworth/celeb/rappers/snoop-dogg-net-worth/", "passage_text": "About Snoop Dogg. American rapper, record producer, marijuana activist, actor and entertainer, Calvin Cordozar “Snoop Dogg” Broadus, Jr., has an estimated net worth of $143 million in 2015."}, {"url": "http://www.therichest.com/celebnetworth/celeb/rappers/snoop-dogg-net-worth/", "passage_text": "Earnings & Financial Data. The below financial data is gathered and compiled by TheRichest analysts team to give you a better understanding of Snoop Dogg's net worth by breaking down the most relevant financial events such as yearly salaries, contracts, earn outs, endorsements, stock ownership and much more. American rapper, record producer, marijuana activist, actor and entertainer, Calvin Cordozar “Snoop Dogg” Broadus, Jr., has an estimated net worth of $143 million in 2015."}, {"url": "http://worthly.com/richest/celebrities/rappers/snoop-dogg-net-worth/", "passage_text": "By Norty on Feb 26, 2014Aug 9, 2015 Posted in: Rappers. Snoop Dogg, also known as Snoop Doggy Dogg and Snoop Lion, is an American rapper, song-writer, and actor with an estimated net worth of $120 million. He also uses his famous Snoop Dogg name on a malt liquor of his own, footlong hot dogs, Dogg Board Company, and a variety of clothing lines. Snoop is currently working on his last album under the Snoop Dogg moniker."}]