[{"url": "http://www.rabbit.org/care/newborn.html", "passage_text": "House Rabbit Society volunteers get countless calls from well-meaning people who find orphans or abandoned baby rabbits behind the shed or in a nearby field. Unknowingly they break up families and separate mother rabbits from their babies in an effort to save them."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20100416101554AAjbHuO", "passage_text": "Rabbit mothers only tend to their babies when it is time to feed them. Wild rabbits will only visit a nest once or twice a day for only 5 minutes to feed-this is their way of not bringing attention to the nest and to protect it from predators. Baby wild rabbits leave the nest much sooner than domesticated rabbits."}, {"url": "http://www.answers.com/Q/How_do_rabbits_care_for_their_young", "passage_text": "Answer   No, mother rabbits will continue to care for their babies even if you touch them. They will lick the sent off of them to protect them from preditors and t … hen continue nursing them for about a week after they are born. 2 people found this useful."}, {"url": "http://www.ntrs.org/baby-cottontail-information.html", "passage_text": "1 Mother rabbits only nurse their babies for approximately 5 minutes twice a day. 2  The mothers return to the nest once or twice a day in the evening or at night letting the babies appear abandoned and orphaned so as not to call attention to the nest for predators."}, {"url": "http://www.wabbitwiki.com/wiki/Wild_Rabbits", "passage_text": "Rabbits return to feed their young only once or twice a day for a few minutes, usually at night. Just because the babies have been by themselves for 5 minutes does not mean that they have been abandoned. The mother is typically gone from the nest to eat and draw attention away from the nest."}, {"url": "http://www.answers.com/Q/How_do_rabbits_care_for_their_young", "passage_text": "If you have a young rabbit how do you tell if its a dwarf rabbit?   You can try to evaluate it's final size by looking at his/her ears. The longest they are, the biggest the rabbit will be when adult. A dwarf-sized rabbit, when young, sh … ould have ears about 5 cm (2 inches) long or shorter.   The only real way to know if they are dwarf is by testing it's genome, because the term dwarf rabbit relates in fact to a gene called Dw, that dictates it's small size."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20100416101554AAjbHuO", "passage_text": "Rating Newest Oldest. Best Answer: They will stop drinking milk from her around 3-4 weeks which is when they should start to eat regular rabbit pellets. If they do not stop by then don't worry, the mom will make them stop. A rabbit will only take care of her young 1-2 times per day, in the morning and, or evening. This is because in the wild if they went and into their hole every couple hours to feed them predators would find out where the nest is."}]