[{"url": "http://www.theunusualfacts.com/2012/08/armadillo-lizard.html", "passage_text": "It is also known as the Typical Girdled Lizard, Armadillo Girdled Lizard, Golden Armadillo Lizard, and Armadillo Spiny-tailed Lizard. The nostrils of the Armadillo Lizard are formed into the little tubes. This tubes help the Armadillo Lizards smell for food or predators."}, {"url": "http://animaldiversity.org/accounts/Cordylus_cataphractus/", "passage_text": "Cordylus cataphractus (armadillo lizard or armadillo girdled lizard) is found along the west coast of South Africa, from the Orange River in the north (Little Namaqualand, Northern Cape Province) to the Piketberg Mountains in the south, and as far inland as Matjiesfontein in the western Karoo Basin."}, {"url": "http://www.blueplanetbiomes.org/desert_animal_page.htm", "passage_text": "The Armadillo Lizard is a prey animal. It is preyed upon by bigger and stronger predators, such as humans, etc. The Armadillo Lizard's armor is most usefull against many birds, mammals, and other reptiles. The Armadillo Lizard is not an endangered species although it does have a lot of enemies to protect itself from."}, {"url": "http://www.blueplanetbiomes.org/desert_animal_page.htm", "passage_text": "The nostrils of the Armadillo Lizard are formed into little tubes. The tubes help the Armadillo Lizards smell for food or predators. A ground dwelling lizard, it is active in the daytime and feeds on a wide variety of insects, as well as on spiders and other invertebrates. The head of the Armadillo Lizard is narrow in shape."}, {"url": "http://www.blueplanetbiomes.org/armadillo_lizard.htm", "passage_text": "The tubes help the Armadillo Lizards smell for food or predators. A ground dwelling lizard, it is active in the daytime and feeds on a wide variety of insects, as well as on spiders and other invertebrates. The head of the Armadillo Lizard is narrow in shape."}, {"url": "http://www.blueplanetbiomes.org/armadillo_lizard.htm", "passage_text": "The Armadillo Lizard is a prey animal. It is preyed upon by bigger and stronger predators, such as humans, etc. The Armadillo Lizard's armor is most usefull against many birds, mammals, and other reptiles. The Armadillo Lizard is not an endangered species although it does have a lot of enemies to protect itself from."}, {"url": "http://animals.mom.me/armadillo-lizards-adaptations-8216.html", "passage_text": "Armadillo lizards (Cordylus cataphractus) -- sometimes also known as armadillo girdled lizards -- are found along South Africa's west coast from Orange River to the Piketberg Mountains. Their body usually measures between 2 and 4 inches long, with a tail of roughly the same length again."}]