[{"url": "http://www.learnmindpower.com/using_mindpower/eliminating_negative_thinking/", "passage_text": "1 Change the negative thought into a positive one. 2  For example, if you are worried and focusing on what could go wrong in a situation, change your thoughts to what could go right. 3  The mind can only think one thought at a time; so changing the negative into a positive eliminates the negative."}, {"url": "http://www.calmclinic.com/anxiety/symptoms/bad-thoughts", "passage_text": "Bad Thoughts Create More Bad Thoughts. It's also important to realize that the more you have these thoughts and the more you try to fight them, the more likely they are to occur. Many people with negative thinking find that when they try as hard as they can to fight their thoughts, they seem to have them more."}, {"url": "http://www.outofstress.com/stop-unwanted-thoughts/", "passage_text": "Negative thoughts are harmless unless they are fed with your belief and attention. To get rid of unwanted thoughts, one has to cripple them by depriving them of attention, allowing the silent force of your consciousness to dissolve the energy of these thoughts."}, {"url": "http://www.spring.org.uk/2012/10/setting-free-the-bears.php", "passage_text": "Repressing thoughts doesn’t work so here are 8 ways to get rid of negative thoughts. It’s one of the irritations of having a mind that sometimes it’s hard to get rid of negative thoughts. It could be a mistake at work, money worries or perhaps a nameless fear."}, {"url": "http://tinybuddha.com/blog/3-reasons-to-stop-worrying-about-your-negative-thoughts/", "passage_text": "And that’s the good news—negative thoughts are a normal part of human functioning. This means you don’t have to worry about the fact that you’re having them in the first place. No matter how gnarly they get, it’s all pretty normal."}, {"url": "http://tinybuddha.com/blog/3-reasons-to-stop-worrying-about-your-negative-thoughts/", "passage_text": "All of your thoughts and perceptions are filtered through your unique belief system, and it’s this filter that causes negative thoughts. The negativity is in the filter. When you try to “heal” and “grow,” what you’re trying to do is change the filter; you’re trying to change your belief system."}, {"url": "http://www.lifeoptimizer.org/2006/10/15/get-rid-of-negative-thoughts-in-two-steps/", "passage_text": "It’s useless to try to fill your mind with positive thoughts if you still carry all those negative thoughts with you. Throw them away first and then you’ll be ready to fill your mind with positive thoughts. Of course, the hardest part is step 1. We must initiate to flee."}]