[{"url": "http://work.chron.com/air-force-reserve-officer-pay-scale-11760.html", "passage_text": "Members of the U.S. Air Force Reserve handle around 20 percent of the Air Force's daily missions and up to 65 percent of its aeromedical missions. There were more than 16,000 U.S. Air Force Reserve officers in 2012. They typically serve one weekend per month and two weeks per year. A U.S. Air Force officer's drill pay is based on pay grade. For example, a U.S. Air Force Reserve officer with the pay grade of O-1 with more than six years service earned $474.48 for a weekend. A reserve officer with the pay grade of O-3 and the same time in service earned $702.92, and an officer with the pay grade of O-5 made $840.40 for a weekend"}, {"url": "http://todaysmilitary.com/videos/becoming-an-air-force-reserve-flight-nurse", "passage_text": "Lt. Col. Monsita Faley, a flight nurse, explains her decision to join the Air Force Reserve and attend nursing school. Flight nurses receive specialized training so they can help with aeromedical evacuations and care for patients in flight. "}, {"url": "https://www.afrotc.com/careers/benefits", "passage_text": "As a lieutenant straight out of college, you will make about $34,000 a year in basic pay. As an officer, your pay depends on your rank and time in service. If you’re a doctor or pilot, there are some special pay considerations and bonuses. In four years, you can be making $47,000–$55,000 as a captain. "}, {"url": "http://work.chron.com/much-tech-sergeant-air-force-make-30628.html", "passage_text": "As of 2014, technical sergeants with two or less years of service earn an annual salary of $27,814. The salary increases to $30,604 after two years of service, $31,954 after three years of service and $33,268 after four years of service. After that, technical sergeants earn minimal salary increases every two years -- at six, eight, 10, 12, 14, and 16 years of service. The U.S. Air Force categorizes enlisted soldiers in ranks from E-1, a basic airman, up to the highest rank of E-9, a chief master sergeant. A technical sergeant is a mid-level soldier or rank of E-6. This rank is responsible for performing highly complex and technical duties along with supervising subordinate soldiers."}, {"url": "http://www.answers.com/Q/How_much_does_a_military_nurse_make_a_year", "passage_text": "But lets say you are a civilian nurse with 10 years of experience. The military will give you 1/2 credit for this time, and give you 5 years toward pay. This will make you come in as a 0-3 or a Captain. A CPT (O-3) makes between $60-70K a year. A MAJ (O-4) makes about $80-90K a year. If you are fairly recently out of school you will come in as a 0-1 or 2nd Lt. The military will pay for unpaid school tuition up to $36,000. On average a 2LT (O-1) with under 2yrs of service makes about $35-40K a year."}, {"url": "http://work.chron.com/air-force-reserve-officer-pay-scale-11760.html", "passage_text": "A U.S. Air Force officer's drill pay is based in part on years of service. For example, the pay for a standard, four-drill weekend for an officer with the pay grade of O-1 with less than two years of service was $377.12 as of the 2012 fiscal year. A U.S. Air Force officer's drill pay is based on pay grade. For example, a U.S. Air Force Reserve officer with the pay grade of O-1 with more than six years service earned $474.48 for a weekend. A reserve officer with the pay grade of O-3 and the same time in service earned $702.92, and an officer with the pay grade of O-5 made $840.40 for a weekend"}, {"url": "http://www.goarmy.com/amedd/nurse/benefits.html", "passage_text": "As a nursing professional serving on the U.S. Army Reserve health care team, you may be eligible for up to $50,000 to repay your nursing school loans. This program provides up to $20,000 for two consecutive years, plus $10,000 for a third year. "}, {"url": "https://answers.yahoo.com/question/index?qid=20100502125527AAeqb7o", "passage_text": "Rating Newest Oldest. You have to have a bachelors degree in nursing and you start as a Second Lieutenant with zero years for pay. (Do not use pay grades to refer to people, it is not polite. Use their rank.) So look at the 2010 pay chart for the lowest pay for an O1. That will be your monthly pay. How much does a nurse get paid in the Air Force? Update: I don't know anything about the rankings, so the pay tables don't really help.. All it says is E1, E2, E3, E4, etc."}]