[{"url": "http://www.answers.com/Q/What_is_the_difference_between_thinset_and_mastic", "passage_text": "Thinset is cement-based. It hardens due to a chemical reaction in the cement when moisture is drawn out of it and into the tile backing and cement-type underlayment (if used). This wicking action causes the thinset to heat up and harden quickly. Thinset generally provides a stronger bond than mastic."}, {"url": "http://tiletools.com/mastic-vs-thinset-which-should-i-use/", "passage_text": "Thin-set mortar is like Portland Cement, only thinner. It’s a mixture of cement, finely graded sand, and a water-retention compound that allows the cement to properly hydrate. You’ll find thin-set sold with the words “thin set cement”, “thin-set mortar”, “dryset mortar”, and “drybond mortar”."}, {"url": "http://tiletools.com/mastic-vs-thinset-which-should-i-use/", "passage_text": "Although thin-set is not waterproof, it is isn’t water soluble. When moisture is present, it will not return to a liquefied state as mastic would. Another advantage is that it’s inorganic and thus is not a food source for mold growth. Now on with the battle of Mastic vs. Thinset!"}, {"url": "http://www.answers.com/Q/What_is_the_difference_between_mastic_and_thinset", "passage_text": "Thinset is cement-based. It hardens due to a chemical reaction in the cement when moisture is drawn out of it and into the tile backing and cement-type underlayment (if used). … This wicking action causes the thinset to heat up and harden quickly. Thinset generally provides a stronger bond than mastic."}, {"url": "http://www.answers.com/Q/What_is_the_difference_between_mastic_and_thinset", "passage_text": "Making the world better, one answer at a time. Mastic come pre mixed which thinset come in a bag that you have to mix with a mixer mastic is not good for your wet areas meaning showers or on the floor."}, {"url": "http://www.homeconstructionimprovement.com/kitchen-backsplash-mastic-vs-thinset/", "passage_text": "1 The advantage of mastic compared to thinset is the setting time and “stickiness” which helps make tile installation much quicker and easier. 2  The downfall of mastic is the fact that it’s not appropriate in situations with water (bathrooms and floors)."}, {"url": "http://www.answers.com/Q/What_is_the_difference_between_thinset_and_mastic", "passage_text": "The mastic tile adhesive is an organically based mortar that is commonly used in the laying of ceramic tiles. This adhesive is made from the resin of the mastic tree and is available as a thin liquid, a paste, or a glue. Some common construction adhesives are a form of mastic resin."}, {"url": "http://www.homeconstructionimprovement.com/kitchen-backsplash-mastic-vs-thinset/", "passage_text": "1 Mastic is a non-cementitious material that exhibits some pros and cons compared to thinset. 2  The advantage of mastic compared to thinset is the setting time and “stickiness” which helps make tile installation much quicker and easier."}]