[{"url": "http://www.oxfordpunting.co.uk/row-boat-hire", "passage_text": "Boat Hire Terms: Boat hire is subject to our boat hire Terms & Conditions. Boats returned more than 5 minutes after the hour will incur an extra 15 minutes hire cost-and then a further 15 minutes charge, 20 minutes after the hour and so on. Hen parties Hen Parties."}, {"url": "http://www.oxfordpunting.co.uk/row-boat-hire", "passage_text": "Rowing is fun and relaxing and a great way to spend a sunny afternoon on the river. You can hire the row boat for an hour or if you want to make a day of it, just stay on the river as long as you like, simply returning the row boat to the boathouse at least half an hour before sunset."}, {"url": "http://www.oldbank-hotel.co.uk/on-the-river/", "passage_text": "MAGDALEN BRIDGE BOATHOUSE. Situated underneath Magdalen College Tower, at the lower end of Oxford’s world famous high street you will find Magdalen Bridge Boathouse. Here you can hire traditionally crafted punts, rowing boats and pedaloes or even spoil yourself by hiring a Chauffeured boat."}, {"url": "http://www.oxfordpunting.co.uk/", "passage_text": "Boathouse-Now Open For New 2015 Season. Visit Oxford's Magdalen Bridge Boathouse to hire a traditional Oxford punt, rowing boat or pedalo and enjoy cruising along Oxford's stunning River Cherwell. Situated underneath Magdalen College Tower, at the lower end of Oxford's world famous high street you will find Magdalen Bridge Boathouse."}, {"url": "http://www.abingdonbridgemarine.co.uk/", "passage_text": "Oxford boat hire-River Cruises & River Trips. Abingdon Bridge Marine Ltd is a family firm that is a wholly owned subsidiary of Salter Brothers Ltd who has provided first-class hospitality on the Royal River Thames for over 150 years (est. 1858)."}, {"url": "http://www.hobbsofhenley.com/rowing-boats", "passage_text": "Rowing boat hire at Henley. Our fibre glass skiff (rowing boats) are the most basic and simple way to discover the Thames at Henley, even if it does mean some physical work. Work off that big lunch with a leisurely afternoon row on the river."}, {"url": "http://www.oxfordrivercruises.com/", "passage_text": "Cruising the tranquil Thames in Oxford offers a taste of a slower life, where cares drift away with the gentle flow of the water and life’s pleasures can be enjoyed to their utmost. Our sightseeing river tours, boat trips and private hire cruises take in stunning scenery on the River Thames in and around Oxford."}]