[{"url": "http://www.webmd.com/drugs/2/drug-11757/cephalexin-oral/details", "passage_text": "This medication is used to treat a wide variety of bacterial infections. This medication is known as a cephalosporin antibiotic. It works by stopping the growth of bacteria. Before taking cephalexin, tell your doctor or pharmacist if you are allergic to it; or to penicillins or other cephalosporins (such as cefpodoxime); or if you have any other allergies. This product may contain inactive ingredients, which can cause allergic reactions or other problems."}, {"url": "http://www.petrescuerx.com/index.cfm/product/27_51/cephalexin.cfm", "passage_text": "Keftab®. General Description: An oral cephalosporin antibiotic used to treat many common bacterial infections in dogs and cats (ex. urinary tract, skin and soft tissue, bone and respiratory tract infections). Cephalexin may be given with meals. Cephalexin is available in capsules, tablets or as an oral suspension. "}, {"url": "http://www.webmd.com/drugs/2/drug-11757/cephalexin-oral/details", "passage_text": "Uses. This medication is used to treat a wide variety of bacterial infections. This medication is known as a cephalosporin antibiotic. It works by stopping the growth of bacteria. This medication will not work for viral infections (such as common cold, flu). Before taking cephalexin, tell your doctor or pharmacist if you are allergic to it; or to penicillins or other cephalosporins (such as cefpodoxime); or if you have any other allergies. This product may contain inactive ingredients, which can cause allergic reactions or other problems."}, {"url": "http://www.everydayhealth.com/drugs/cephalexin", "passage_text": "12 Reviews. Cephalexin, an antibiotic in the cephalosporin family, is used to treat infections caused by bacteria. Cephalexin is prescribed to treat respiratory tract, middle ear, skin, bone, and urinary tract infections (UTI). It's also used to prevent infections caused by streptococcal bacteria, including prevention of rheumatic fever. Cephalexin isn't recommended for sinus infections. Cephalexin and other cephalosporin antibiotics are broad-spectrum antibiotics, meaning they're used to treat a wide range of infections caused by many different bacteria."}, {"url": "http://www.mayoclinic.org/drugs-supplements/cephalexin-oral-route/precautions/DRG-20073325", "passage_text": "If your symptoms do not improve within a few days, or if they become worse, check with your doctor. Cephalexin may cause diarrhea, and in some cases it can be severe. Do not take any medicine or give medicine to your child to treat diarrhea without first checking with your doctor. Diarrhea medicines may make the diarrhea worse or make it last longer. "}, {"url": "http://antibiotics.emedtv.com/keflex/keflex-and-diarrhea.html", "passage_text": "Keflex ® (cephalexin) can cause several side effects, including diarrhea. Keflex has been extensively studied in clinical trials, and this was one of the most common side effects of the drug in both adults and children. (Click Keflex Side Effects for a more in-depth look at diarrhea and Keflex. This article also discusses the clinical studies that have been done on this medication, including a detailed list of common and potentially serious side effects.)."}, {"url": "http://www.petmd.com/dog/conditions/digestive/c_dg_diarrhea_antibiotic_responsive", "passage_text": "Antibiotic-Responsive Diarrhea in Dogs. Veterinarians find it controversial to give antibiotics to treat diarrhea, but when antibiotics do resolve diarrhea, veterinarians speculate that the cause of this kind of diarrhea was from a small intestinal bacterial overgrowth."}, {"url": "http://www.1800petmeds.com/Cephalexin-prod10050.html", "passage_text": "Cephalexin is a broad-spectrum antibiotic available as capsules or suspension used to treat bacterial infections of the skin, urinary tract, respiratory tract, bones, and joints. Cephalexin requires a prescription from your veterinarian. Symptoms may begin to improve before the infection is completely treated. What is Cephalexin: Cephalexin is an antibiotic belonging to a class of drugs called cephalosporins that fight bacteria in the body. Cephalexin can be used to treat infections such as bronchitis as well as ear, skin, and urinary tract infections. Cephalexin may also be used for purposes other than those listed"}, {"url": "http://www.vetinfo.com/cephalexin-for-dogs.html", "passage_text": "Cephalexin must be prescribed by a veterinarian, and is used for the treatment of a wide array of bacterial infections in the body. Cephalexin causes bacteria in the body to die by preventing them from forming cell walls and protective barriers. In general, Cephalexin is a very safe and effective way to treat bacterial infections in your pet, but certain animals may experience the following symptoms when taking the antibiotic: 1  Vomiting. 2  Mild diarrhea. 3  Nausea. 4  Loss of appetite. 5  Lack of energy."}]