[{"url": "http://www.trulia.com/voices/Home_Buying/For_first_time_home_buyers_how_long_does_it_take_-374950", "passage_text": "How long it takes to find the home depends on your market inventory and your personal preference. The average client of mine finds a home in as little as one week to 4 weeks. From that period when we find the home and go under contract you are looking at another 30 to 45 days to close in most cases."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20060805102954AAVKZjw", "passage_text": "I have just moved, we had two houses in our chain and it took three months and it took three months the time before as well. It is worth the wait, though! Just make sure you are in frequent contact with solicitor and the agents for your vendor."}, {"url": "https://au.answers.yahoo.com/question/index?qid=20060922041946AAplO3u", "passage_text": "Best Answer: It only takes me 4-5 days to do the actual packing. The trick is to get organized. Make sure all your filing cabinets, closets and drawers are cleaned out, cleared of junk (take it to a charity or have a garage sale) and ready to pack."}, {"url": "http://www.cluttoncox.co.uk/site/blog/conveyancingblog/how_long_to_move_house.html", "passage_text": "Where you are buying and selling at the same time then the length of time it takes you to move will inevitably be longer than just a sale or purchase. Assuming there are 2 to 3 people in the chain (and no-one changes their minds for whatever reason and pulls out) then a reasonable time frame would be 8-12 weeks."}, {"url": "https://au.answers.yahoo.com/question/index?qid=20060922041946AAplO3u", "passage_text": "Normally, alone, it takes about 2 weeks because of all the knick-knacks and small stuff. But if you're tied up for time, its sometimes better to have a professional mover do it-they can pack up an average 5 bedroom house in 24 hours."}, {"url": "http://www.trulia.com/voices/Home_Buying/For_first_time_home_buyers_how_long_does_it_take_-374950", "passage_text": "When you get 75 days out from your move in date, I would start actively touring the homes in the price range and area you like. In our area, if you start sooner those homes will be gone before you are ready to write a contract. From writing a contract to possession it is 30 to 45 days."}, {"url": "http://www.trulia.com/voices/Foreclosure/How_long_to_do_you_have_if_your_house_is_going_to_-452744", "passage_text": "An average foreclosure can take anywhere from 6 months to 1 year. If the state has a redemption period (time given for the homeowner to purchase back the home), you can stay in the house even longer. Pre-Foreclosure Stage: According to Michigan law, you are in default when a payment is 30 days late."}, {"url": "https://au.answers.yahoo.com/question/index?qid=20060922041946AAplO3u", "passage_text": "Report Abuse. It took me a week to pack up a four bedroom house (wrapping up breakables and putting everything in boxes marked with the rooms they would go in the new place) and the movers took one day to put it in the truck."}, {"url": "http://www.trulia.com/voices/Foreclosure/How_long_to_do_you_have_if_your_house_is_going_to_-452744", "passage_text": "During that time, you are still the owner of the house and can continue to live there. Att the end of the redemption period you will be contacted by the bank to move out. If you have not moved out at the end of the six months, the bank will serve you with a notice of eviction. And your foreclosure will be complete."}]