[{"url": "http://www.merriam-webster.com/dictionary/diamondback%20terrapin", "passage_text": "Definition of DIAMONDBACK TERRAPIN. : any of several terrapins (genus Malaclemys) formerly widely distributed in salt marshes along the Atlantic and Gulf coasts but now much restricted. See diamondback terrapin defined for kids. ADVERTISEMENT. Britannica.com: Encyclopedia article about diamondback terrapin"}, {"url": "http://www.merriam-webster.com/dictionary/terrapin", "passage_text": "Full Definition of TERRAPIN. : any of various aquatic turtles (family Emydidae); especially: diamondback terrapin. See terrapin defined for English-language learners. See terrapin defined for kids. ADVERTISEMENT. 15 ENTRIES FOUND: 1  terrapin. 2  terrapin scale. 3  Alabama terrapin. 4  Amazon terrapin. 5  chicken terrapin. 6  crescent terrapin. 7  diamondback terrapin. 8  geographic terrapin. 9  Mobile terrapin. 10  Pacific terrapin. 11  red-bellied terrapin. 12  salt-marsh terrapin. 13  yellow-bellied terrapin. 14  map turtle. 15  wood tortoise."}, {"url": "http://www.oxforddictionaries.com/definition/english/terrapin", "passage_text": "1 The northern diamondback terrapin, red fox, snapping turtle, raccoon, rabbit, skunk, opossum and blue crab, all animals that do well living close to people, have adapted nicely to the rapid changes of the Meadowlands. Example sentences. ‘ 1 There will be a demonstration on reptiles like snakes, terrapins, skinks and tortoises, that will look at how they adapt to the environment,’ says zoo educationist Imelda Matlala. 2  However, instead, they found a fresh water terrapin, a turtle-like creature normally kept as a pet."}, {"url": "http://www.thefreedictionary.com/terrapin", "passage_text": "At the enunciation of the aspirate, Fuddy-Duddy, the incapable terrapin, came to a dead halt, and before the vowel had died away up the ravine had folded up all his eight legs and lain down in the dusty road, regardless of the effect upon his derned skin. If you dined with the Lovell Mingotts you got canvas-back and terrapin and vintage wines; at Adeline Archer's you could talk about Alpine scenery and The Marble Faun; and luckily the Archer Madeira had gone round the Cape."}, {"url": "https://en.wikipedia.org/wiki/Terrapin", "passage_text": "A terrapin is one of several small species of turtle living in fresh or brackish water. Terrapins do not form a taxonomic unit, and may not be very closely related, although many belong to the families Geoemydidae and Emydidae. A distinction between turtle and terrapin does not exist in other European languages. The name terrapin is derived from the Algonquian word torope, used for Malaclemys terrapin. In the UK red-eared sliders are known as red-eared terrapins. A Terrapin crossing sign and a highway barrier designed for crossing at the end of the F.J. Torras causeway at St. Simons Island, Georgia, USA (2015)."}, {"url": "http://www.definitions.net/definition/terrapin", "passage_text": "Terrapin. A terrapin is a turtle living in fresh or brackish water. Terrapin is an Algonquian word for turtle. In the UK red-eared sliders are known as red-eared terrapins. "}, {"url": "http://www.thefreedictionary.com/terrapin", "passage_text": "[1665–75, Amer. ; earlier torope *to·rəpe·w variety of turtle]. turtle, tortoise, terrapin-Turtle is applied to those living in water and tortoise to those that live on land, while terrapins live in fresh water; turtle and tortoise may come from the Latin root tort, with reference to the animals' twisted feet. See also related terms for tortoise. If you dined with the Lovell Mingotts you got canvas-back and terrapin and vintage wines; at Adeline Archer's you could talk about Alpine scenery and The Marble Faun; and luckily the Archer Madeira had gone round the Cape."}, {"url": "http://www.oxforddictionaries.com/definition/english/terrapin", "passage_text": "1 However, instead, they found a fresh water terrapin, a turtle-like creature normally kept as a pet. 2  Following the success of the Teenage Mutant Ninja Turtles film in the late 1980s, thousands of children bought turtles and terrapins. Example sentences. ‘ 1 There will be a demonstration on reptiles like snakes, terrapins, skinks and tortoises, that will look at how they adapt to the environment,’ says zoo educationist Imelda Matlala. 2 "}]