[{"url": "http://yourbusiness.azcentral.com/salaried-exempt-vs-salaried-nonexempt-10153.html", "passage_text": "Work Hours. Whereas salaried exempt employees are not paid according to hours worked, salaried nonexempt employees are paid that way. Unless a permissible deduction applies, salaried exempt employees must receive their full salary regardless of the number of days or hours worked."}, {"url": "http://yourbusiness.azcentral.com/salaried-exempt-vs-salaried-nonexempt-10153.html", "passage_text": "If a salaried exempt employee works more than 40 hours per week, you do not have to pay him overtime. You may, however, give him additional compensation such as a bonus or extra time off. You must pay salaried nonexempt employees overtime at 1.5 times their regular pay rate if they work more than 40 hours for the week."}, {"url": "http://employment.findlaw.com/wages-and-benefits/exempt-employees-vs-nonexempt-employees.html", "passage_text": "Nonexempt Employees. A nonexempt employee must be paid the minimum wage and overtime pay for any time worked beyond 40 hours in a given week. Under FLSA rules, nonexempt employees are entitled to time and one-half of their regular pay rate for each hour of overtime."}, {"url": "http://smallbusiness.chron.com/salaried-exempt-vs-salaried-nonexempt-24213.html", "passage_text": "The overtime rate for salaried nonexempt employees is the same as hourly, nonexempt employees: 1 1/2 times the hourly rate. Therefore, the paralegal with a 40-hour workweek would earn $42.54 for every hour that exceeds 40 hours in a week."}, {"url": "http://smallbusiness.chron.com/salaried-exempt-vs-salaried-nonexempt-24213.html", "passage_text": "Salaried nonexempt employees receive a salary rate for a fixed number of hours. However, when they exceed the fixed number of hours and work more than 40 hours in a week, they receive overtime compensation. The basis of the calculation of their overtime compensation is the equivalent hourly rate the employee earns."}, {"url": "http://yourbusiness.azcentral.com/salaried-exempt-vs-salaried-nonexempt-10153.html", "passage_text": "Salary Amount. Under the FLSA, salaried exempt employees must receive a minimum salary of $455 per week, as of the date of publication. Salaried nonexempt employees must receive no less than the federal minimum hourly wage of $7.25. The state may have a different minimum wage requirement."}]