[{"url": "http://kids.mongabay.com/elementary/002.html", "passage_text": "Interviews. Rainforests are found in the tropics, the region between the Tropic of Cancer and the Tropic of Capricorn, just above and below the Equator. In this tropic zone the sun is very strong and shines about the same amount of time every day all year long, keeping the climate warm and relatively stable. "}, {"url": "http://kids.nceas.ucsb.edu/biomes/rainforest.html", "passage_text": "LOCATION: There are two types of rainforest biomes: temperate and tropical rainforests. Temperate rainforests are found along coasts in temperate regions. The largest temperate rainforests are on the Pacific coast in North America, stretching from Alaska to Oregon. Other temperate rainforests are found along the coast of Chile, the United Kingdom, Norway, Japan, New Zealand, and S. Australia."}, {"url": "http://www.blueplanetbiomes.org/rainforest.htm", "passage_text": "Where the Rainforests Are Found The tropical rain forest can be found in three major geographical areas around the world. Central America in the Amazon river basin. Africa-Zaire basin, with a small area in West Africa; also eastern Madagascar. Plants Animals Climate Southeast Asian Rainforests The tropical rain forest is a forest of tall trees in a region of year-round warmth. An average of 50 to 260 inches (125 to 660 cm.) of rain falls yearly. Rain forests belong to the tropical wet climate group."}, {"url": "http://www.blueplanetbiomes.org/rainforest.htm", "passage_text": "Southeast Asian Rainforests. The tropical rain forest is a forest of tall trees in a region of year-round warmth. An average of 50 to 260 inches (125 to 660 cm.) of rain falls yearly. Rain forests belong to the tropical wet climate group. Plants Animals Climate Southeast Asian Rainforests"}, {"url": "http://www.brighthub.com/environment/science-environmental/articles/76207.aspx", "passage_text": "The rainforests are diverse tropical eco-regions along the equator. Explore what rain forests are, where are rainforests found, a description of some of the well recognized ones, and even the names of all rainforests. The Amazon Rainforest is a moist broadleaf forest that covers most of the Amazon Basin of South America (approximately 8,235,430km). The Amazon represents over half of the planet’s remaining rainforest and is the largest and most species rich rainforest in the world."}, {"url": "https://en.wikipedia.org/wiki/Tropical_rainforest", "passage_text": "Tropical rainforests can be characterized in two words: hot and wet. Mean monthly temperatures exceed 18 °C (64 °F) during all months of the year. Average annual rainfall is no less than 168 cm (66 in) and can exceed 1,000 cm (390 in) although it typically lies between 175 cm (69 in) and 200 cm (79 in). Most tropical rainforests are located around and near the equator, therefore having what is called an equatorial climate characterized by three major climatic parameters: temperature, rainfall, and dry season intensity."}, {"url": "http://www.geography.learnontheinternet.co.uk/topics/rainforest.html", "passage_text": "Rainforests receive 160 to 400 inches (400-1000 cm) of rain each year. The largest rainforests are in Brazil (South America), Zaire (Africa) and Indonesia (South East Asia). Other tropical rainforest places are in Hawaii and the islands of the Pacific & Caribbean. "}, {"url": "http://www.cotf.edu/ete/modules/msese/earthsysflr/rforest.html", "passage_text": "Tropical Rainforest The tropical rainforest is a hot, moist biome found near Earth's equator. The world's largest tropical rainforests are in South America, Africa, and Southeast Asia. Tropical rainforests receive from 60 to 160 inches of precipitation that is fairly evenly distributed throughout the year."}, {"url": "http://www.mbgnet.net/sets/rforest/where.htm", "passage_text": "Tropical rainforests are located near the equator. Fifty seven percent of all tropical rainforests are found in Latin America. One third of the world's tropical rainforests are in Brazil. Other tropical rainforests are located in Southeast Asia and the Pacific Islands (25% of the world's tropical rainforests) and West Africa (18%). Temperate rainforests are found along some coasts in temperate zones. The largest temperate rainforests are found on the Pacific coast of North America. "}, {"url": "http://kids.nceas.ucsb.edu/biomes/rainforest.html", "passage_text": "Tropical rainforests can be found around the world: In Central and South America; in Western Africa, eastern Madagascar, and the Zaire basin; and in Indo-Malaysia along the west coast of India, Assam, Southeast Asia, New Guinea, and Queensland, Australia. Temperate rainforests are found along coasts in temperate regions. The largest temperate rainforests are on the Pacific coast in North America, stretching from Alaska to Oregon. Other temperate rainforests are found along the coast of Chile, the United Kingdom, Norway, Japan, New Zealand, and S."}]