[{"url": "http://animals.about.com/od/primates/p/primates.htm", "passage_text": "Primates are a group of mammals that includes lemurs, galagos, lorises, pottos, monkeys and apes. Primates are subdivided into two groups, the Strepsirhini and the Haplorhini. The Strepsirhini include lemurs, galagos, lorises and pottos. The Haplorhini include tarsiers, apes and monkeys. Evolution: Primates are a relatively young group of mammals. The earliest known primates belong to the genus Altiatlasius."}, {"url": "http://www.merriam-webster.com/dictionary/primate", "passage_text": "Definition of PRIMATE for Kids. : any of a group of mammals that includes humans together with the apes and monkeys and a few related forms. "}, {"url": "https://en.wikipedia.org/wiki/Primate", "passage_text": "A primate (/ˈpraɪmeɪt/ PRY-mayt) is a mammal of the order Primates (/praɪˈmeɪtiːz/ pry-MAY-teez; Latin : prime, first rank). In taxonomy, primates include two distinct lineages, strepsirrhines and haplorhines. Considered generalist mammals, primates exhibit a wide range of characteristics. Some primates (including some great apes and baboons) are primarily terrestrial rather than arboreal, but all species possess adaptations for climbing trees."}, {"url": "http://www.thefreedictionary.com/primate", "passage_text": "pri·mate. n. 1. (prī′māt′) Any of various mammals of the order Primates, which consists of the lemurs, lorises, tarsiers, New World monkeys, Old World monkeys, and apes including humans, and is characterized by nails on the hands and feet, a short snout, and a large brain. 2. A bishop of highest rank in a province or country"}, {"url": "https://en.wikipedia.org/wiki/Primate", "passage_text": "Primates are characterized by large brains relative to other mammals, as well as an increased reliance on stereoscopic vision at the expense of smell, the dominant sensory system in most mammals. These features are more developed in monkeys and apes and noticeably less so in lorises and lemurs. Considered generalist mammals, primates exhibit a wide range of characteristics. Some primates (including some great apes and baboons) are primarily terrestrial rather than arboreal, but all species possess adaptations for climbing trees."}, {"url": "http://encyclopedia2.thefreedictionary.com/Non-human+primate", "passage_text": "primate. member of the mammalian order Primates, which includes humans, apes ape,any primate of the subfamily Hominoidea, with the possible exception of humans. The small apes, the gibbon and the siamang, and the orangutan, one of the great apes, are found in SE Asia...... , monkeys monkey,any of a large and varied group of mammals of the primate order. The term monkey includes all primates that do not belong to the categories human, ape, or prosimian; however, monkeys do have certain common features...... Click the link for more information. , and prosimians, or lower primates"}, {"url": "http://kids.britannica.com/elementary/article-390079/Primate", "passage_text": "The primates are a group of mammals that includes some of the most intelligent animals. The major kinds of primates are humans, apes, monkeys, tarsiers, lemurs, and lorises. There are more than 300 species, or types, of primate. These different types have many physical features in common. For this reason scientists believe that they may share a common ancestor. "}]