[{"url": "http://www.cancer.org/cancer/adrenalcorticalcancer/overviewguide/adrenal-cortical-cancer-overview-what-is-adrenal-cancer", "passage_text": "The adrenals are small glands that sit above each of the kidneys, as shown in the picture below. The kidneys are found deep inside the upper part of the belly (abdomen). The adrenal gland has 2 parts. The outer part, called the cortex, is where adrenal cortical tumors start. The cortex makes certain hormones for the body. These hormones are called steroids. The inner part of the adrenal gland, called the medulla, is really part of the nervous system. Nervous system hormones are made in the medulla. Tumors of the adrenal medulla are not covered here."}, {"url": "http://www.surgery.usc.edu/divisions/tumor/PancreasDiseases/web%20pages/Endocrine%20tumors/adrenal/adrenal%20tumors.html", "passage_text": "The adrenal cortex also produces a hormone called aldosterone that is involved in regulating the amount of salt and water in your body. The inner part of the adrenal gland is called the adrenal medulla. The adrenal medulla produces hormones called catecholamines such as adrenaline and noradrenaline. Catecholamines play a role in the response to acute or sudden severe stress, for example during life threatening event. "}, {"url": "http://www.cancer.ca/en/cancer-information/cancer-type/adrenal-gland/adrenal-gland-cancer/?region=bc", "passage_text": "Adrenal gland cancer is a malignant tumour that starts in the cells of the adrenal gland. Malignant means that it can spread, or metastasize, to other parts of the body. You have 2 adrenal glands. There is one above each kidney, and the kidneys are deep inside the upper part of the abdomen. It is the most common cancerous tumour of the adrenal gland. Tumours can also start in the medulla of the adrenal gland. When chromaffin cells in the medulla become abnormal, they can lead to a tumour called pheochromocytoma. Most pheochromocytomas are non-cancerous, but some are likely to become cancerous."}, {"url": "http://www.healthline.com/health/adrenal-cancer", "passage_text": "Overview. Adrenal cancers occur when abnormal cells form in or travel to the adrenal glands. There are two adrenal glands, one located above each kidney. Adrenal cancer usually occurs in the outermost layer of the glands, which is called the adrenal cortex. It usually appears as a tumor"}, {"url": "http://www.cancer.org/cancer/adrenalcorticalcancer/detailedguide/adrenal-cortical-cancer-what-is-adrenal-cortical-cancer", "passage_text": "The type of cancer that develops in the cortex of the adrenal gland is called adrenal cortical carcinoma. It is also known as adrenocortical cancer (or carcinoma) or just adrenal cancer. In this document, the term adrenal cancer is used to mean cancer that starts in the adrenal cortex. The outer part, called the cortex, is where most tumors develop. The function of the cortex is to make certain hormones for the body. These hormones all have a similar chemical structure and are called steroids. They include: 1  Cortisol causes changes in metabolism that help the body to handle stress."}, {"url": "http://www.cancer.ca/en/cancer-information/cancer-type/adrenal-gland/adrenal-gland-cancer/?region=bc", "passage_text": "Sometimes cells in the adrenal cortex change and become cancerous. This type of cancer is called adrenocortical carcinoma. It is the most common cancerous tumour of the adrenal gland. Tumours can also start in the medulla of the adrenal gland. When chromaffin cells in the medulla become abnormal, they can lead to a tumour called pheochromocytoma. Most pheochromocytomas are non-cancerous, but some are likely to become cancerous."}, {"url": "http://www.endocrineweb.com/conditions/adrenal-cancer/diseases-adrenal-cortex-adrenal-cancer", "passage_text": "Adrenocortical carcinoma is a rare tumor afflicting only one or two persons per one million population. It usually occurs in adults, and the median age at diagnosis is 44 years. Although potentially curable at early stages, only 30% of these malignancies are confined to the adrenal gland at the time of diagnosis. 1 Since the vast majority of these cancers make too much hormone (cortisol, testosterone, estrogen, aldosterone, etc.), this is an obvious place to start. 2  Keep in mind, however, that most non-cancerous tumors of the adrenal glands (benign adenomas and hyperplasia) will also secrete too much hormones."}, {"url": "http://www.cancercenter.com/adrenal-cancer/learning/", "passage_text": "Adrenal cancer is a rare form of cancer that develops in the adrenal glands, which are located on top of the kidneys. The small glands are comprised of two separately functioning parts: the cortex (outer layer of the gland) and the medulla (the inner area of the gland). "}, {"url": "http://www.rightdiagnosis.com/a/adrenal_cancer/basics.htm", "passage_text": "A rare cancer of the adrenal glands. The usually aggressive cancer causes overproduction of adrenal hormones. This cancer usually occurs ... more 1  ». Adrenal Cancer: A malignant cancer that develops in the adrenal gland. A rare cancer of the adrenal glands. The usually aggressive cancer causes overproduction of adrenal hormones. This cancer usually occurs ... more »."}]