[{"url": "http://openstudy.com/updates/4ef138b0e4b0dc507db67c2b", "passage_text": "2. KINGDOM ARCHAEBACTERIA: They are unicellular prokaryotes with distinctive cell membranes as well as biochemical and genetic properties that differ from all other kinds of life. Many Archaebacteria live in harsh environments."}, {"url": "http://openstudy.com/updates/4ef138b0e4b0dc507db67c2b", "passage_text": "KINGDOM PROTISTA: These organisms are placed here more because of what they are not than what they are. Kingdom Protista contains all Eukaryotes that are NOT Plants, Animal, or Fungi, more than 50,000 species in all. Kingdom Protista includes unicellular and a few simple multicellular Eukaryotes."}, {"url": "http://www.austincc.edu/biocr/1406/labm/ex4/prelab_4_4.htm", "passage_text": "Prokaryotic organisms are usually unicellular, but a few form simple colonies. Unicellular means an organism is composed of a single cell. Colonial means an organism is composed of attached cells, but the cells are mostly similar in structure and function."}, {"url": "http://www.whatisnearfieldcommunication.com/the-animal-kingdom.html", "passage_text": "Kingdom Animalia. The kingdom Animalia consists of multicellular, eukaryotic organisms. The eukaryotic cells that make up these individuals have a membrane-bound nucleus and other membrane-bound organelles. Animal cells differ from those of plants and fungi because animal cells do not contain a cell wall."}, {"url": "https://quizlet.com/1252241/the-6-kingdoms-classification-flash-cards/", "passage_text": "The Protist Kingdom consists of mostly unicellular organisms that can have characteristics similar to plants, animals or fungi. Characteristics of Protists: mostly unicellular, few multicellular, eukaryotic, can be heterotrophic or autotrophic. Ex: algae, Paramecium, kelp (multicellular).   ."}, {"url": "http://www.answers.com/Q/Which_kingdom_contains_mostly_unicellular_eukaryotic_organism", "passage_text": "Protista. However, not all members of the kingdom protista are unicellular. Some may be multicellular, or may even live in colonies. Some members of fungi are also unicellular … , such as yeast."}, {"url": "http://www.austincc.edu/biocr/1406/labm/ex4/prelab_4_4.htm", "passage_text": "Organisms composed of eukaryotic cells are divided into 4 main groups: 1  Protista are mostly unicellular or colonial eukaryotes. 2  They may be either photosynthetic autotrophs or heterotrophs. 3  This is a very diverse group that is actually composed of multiple kingdoms."}, {"url": "https://quizlet.com/1252241/the-6-kingdoms-classification-flash-cards/", "passage_text": "Protist Kingdom. The Protist Kingdom consists of mostly unicellular organisms that can have characteristics similar to plants, animals or fungi. Characteristics of Protists: mostly unicellular, few multicellular, eukaryotic, can be heterotrophic or autotrophic. Ex: algae, Paramecium, kelp (multicellular).   ."}]