[{"url": "https://8salembodysystems.wikispaces.com/Excretory+System", "passage_text": "The first step of the excretory system is the kidneys filtering wastes out of the bloodstream as the blood goes through them. Then clean blood goes on to the rest of the body. The wastes then travel through the ureters to the urinary bladder."}, {"url": "http://www.answers.com/Q/What_is_the_excretory_system", "passage_text": "Excretion is the casting off of waste products. The excretory system is the system in the body that collects waste produced by the cells and removes the waste from the body."}, {"url": "http://www.ck12.org/user:YXJtc3Ryb25nLmVyaWNAZ21haWwuY29t/section/The-Excretory-System/", "passage_text": "1 The organs of the excretory system remove wastes. 2  They also maintain the proper levels of water, salts, and nutrients in the body. 3  The lungs, skin, kidneys, and large intestine are all organs in the excretory system. 4  The urinary system is made up of the kidneys, the ureters, the bladder, and the urethra."}, {"url": "http://www.ck12.org/user:YXJtc3Ryb25nLmVyaWNAZ21haWwuY29t/section/The-Excretory-System/", "passage_text": "1 The lungs, skin, kidneys, and large intestine are all organs in the excretory system. 2  The urinary system is made up of the kidneys, the ureters, the bladder, and the urethra. 3  The filtering parts of the kidneys are the nephrons. 4  Water and waste molecules move out of the blood capillaries and into"}, {"url": "http://www.wisegeekhealth.com/what-is-the-excretory-system.htm", "passage_text": "The excretory system is a system within the body that consists of several organs that remove waste products as well as dangerous substances from the body. This is primarily to make sure that the body’s systems remain in homeostatic conditions."}, {"url": "http://www.wisegeekhealth.com/what-is-the-excretory-system.htm", "passage_text": "The excretory system is a collection of organs that work in unison to remove waste and other harmful products from the body. Health problems associated with the excretory system can include kidney stones. Nephrons, which are found in the kidneys, play a vital part in the excretory process."}, {"url": "http://www.scienceclarified.com/El-Ex/Excretory-System.html", "passage_text": "The excretory system is a system of organs that removes waste products from the body. When cells in the body break down proteins (large molecules that are essential to the structure and functioning of all living cells), they produce wastes such as urea (a chemical compound of carbon, hydrogen, nitrogen, and oxygen)."}, {"url": "https://8salembodysystems.wikispaces.com/Excretory+System", "passage_text": "The Excretory system is the system the body uses to get rid of all its wastes, and involves the lungs to remove carbon dioxide from the body, the large intestine where solid wastes pass through, and the kidneys which removes a lot of the liquid waste."}, {"url": "http://www.med-health.net/Diseases-Of-The-Excretory-System.html", "passage_text": "Disposal of liquid waste from human body is done by the excretory system. The system consisting of two kidneys, two ureters, one urinary bladder, and one urethra performs the work of collecting, storing and removing all the liquid waste products from the body."}]