[{"url": "http://stretchforsuccess.blogspot.com/2012/01/what-is-fascial-stretch-therapy.html", "passage_text": "Fascial Stretch Therapy is a unique system of therapy that dramatically improves your flexibility by lengthening your fascia. Tension in the tissue and around the joints is released to restore and improve range of movement, often relieving pain from past injuries. This therapy was created by former professional ballet dancer Ann & her husband, Physiotherapist, Chris Frederick of the Stretch To Win Institute in Arizona. Fascia is the connective tissue that surrounds & all structures of the body."}, {"url": "http://spiritualityhealth.com/Michael-Pineault-Explains-Fascial-Stretch-Therapy", "passage_text": "Michael Pineault: “One of the things that attracted me to Fascial Stretch Therapy when I first learned of it is the fact that it can treat or help alleviate a range of physical disorders, like joint dysfunctions and chronic headaches and pinched nerves. Gone are the days when stretching involved simply touching one’s toes or doing a standing calf stretch or statically stretching one’s quadriceps."}, {"url": "http://www.stretch-works.com/", "passage_text": "Stretch Therapy. You might not have heard of Fascial Stretch Therapy, but it is a revolutionary training program that can help to Build Muscles and help Maintain a Healthy Body. Fascial Stretch Therapy is a fantastic way to Rehabilitate your body. "}, {"url": "http://coachdebbieruns.com/10-benefits-of-fascial-stretch-therapy/", "passage_text": "Enter Fascial Stretch Therapy (or FST), a type of stretching that targets not only the muscles, but the fascia, the connective tissue that surrounds muscles, bones, and joints. I will be studying and preparing for the class that I’m taking in August. My information comes from my experience as a client, as well as from the Stretch to Win website, and the book, Stretch to Win, which is written by Ann Frederick and Christopher Frederick, the developers of Fascial Stretch Therapy."}, {"url": "http://www.primalfitmiami.com/services/stretch-therapy-miami/", "passage_text": "Primal Fit Miami in South Florida has achieved a Fascial Stretch Therapy Level 2 Certification from Ann and Chris Frederick of The Stretch to Win Institute. Benefits of Stretch Therapy. When you use FST, you become more mobile, less restricted and thoroughly stretched out prior to exercising or running. "}, {"url": "http://coachdebbieruns.com/10-benefits-of-fascial-stretch-therapy/", "passage_text": "By contrast, a Fascial Stretch Therapist will evaluate their client, looking for imbalances, as well as the source of those imbalances. Then using breath to help with movement, the therapist will first warm up the joints and muscles with undulating stretching to maximize blood flow. I will be studying and preparing for the class that I’m taking in August. My information comes from my experience as a client, as well as from the Stretch to Win website, and the book, Stretch to Win, which is written by Ann Frederick and Christopher Frederick, the developers of Fascial Stretch Therapy."}, {"url": "http://spiritualityhealth.com/Michael-Pineault-Explains-Fascial-Stretch-Therapy", "passage_text": "Fascial Stretch Therapy, therefore, focuses on stretching or derestricting the fascia and joint capsules so as to attain improved flexibility, strength and athletic performance, as well as to achieve pain relief. Gone are the days when stretching involved simply touching one’s toes or doing a standing calf stretch or statically stretching one’s quadriceps."}, {"url": "http://www.handsonyou.ca/services/fascial-stretch-therapy/", "passage_text": "Fascia is a network of layered connective tissue that surrounds muscles, bones and joints. A joint capsule is also a connective tissue structure that surrounds joints and is involved in optimizing the mechanical function of the joint as well as gives it nutrients. **Permission has been granted by the Stretch To Win Institute to use the trademark Fascial Stretch Therapy (TM) or FST(TM) as long as certification is maintained in good standing. For more information about FST(TM) please visit www.stretchtowin.com.**."}, {"url": "http://stretchmoves.com/", "passage_text": "It is a complete movement based therapy of stretching and lengthening the bodies connective tissue, also know as fascia. It is a thorough movement based system of stretching and lengthening the bodies connective tissue, fascia. With the specific protocol for every joint and muscle in the body, this technique maximizes your body’s ability to regain lost flexibility, joint space and most importantly full body mobility. Learn More."}, {"url": "http://stretchforsuccess.blogspot.com/2012/01/what-is-fascial-stretch-therapy.html", "passage_text": "Fascial Stretch Therapy is a unique system of therapy and training that dramatically improves your flexibility by lengthening your fascia. This therapy was created by former professional ballet dancer Ann & her husband, Physiotherapist, Chris Frederick of the Stretch To Win Institute in Arizona. Fascia is the connective tissue that surrounds & all structures of the body."}]