[{"url": "https://en.wikipedia.org/wiki/Invertebrate", "passage_text": "The word invertebrate comes from the form of the Latin word vertebra. Vertebra means a joint in general, and sometimes specifically a joint from the spinal column of a vertebrate. In turn the jointed aspect of vertebra derived from the concept of turning, expressed in the root verto or vorto, to turn. This includes all animals apart from the subphylum Vertebrata. Familiar examples of invertebrates include insects, crabs, lobsters and their kin, snails, clams, octopuses and their kin, starfish, sea-urchins and their kin, and worms. The majority of animal species are invertebrates. One estimate puts the figure at 97%."}, {"url": "http://www.thefreedictionary.com/invertebrate", "passage_text": "1. invertebrate-lacking a backbone or spinal column; worms are an example of invertebrate animals. spineless. zoological science, zoology-the branch of biology that studies animals. vertebrate-having a backbone or spinal column; fishes and amphibians and reptiles and birds and mammals are verbetrate animals. 1. invertebrate-any animal lacking a backbone or notochord; the term is not used as a scientific classification. animal, animate being, beast, creature, fauna, brute-a living organism characterized by voluntary movement."}, {"url": "http://www.ento.csiro.au/education/what_invertebrates.html", "passage_text": "The animal kingdom is informally divided into two groups, the vertebrates and invertebrates. Invertebrates are a group of animals that have no backbone, unlike animals such as reptiles, amphibians, fish, birds and mammals who all have a backbone. "}, {"url": "http://www.merriam-webster.com/dictionary/invertebrate", "passage_text": "Definition of INVERTEBRATE. 1. : lacking a spinal column; also: of, relating to, or concerned with invertebrate animals. 2. : lacking in strength or vitality: weak. — invertebrate noun. See invertebrate defined for kids. ADVERTISEMENT. "}, {"url": "http://eol.org/info/443", "passage_text": "In fact, 95% of the 1.4 million known animal species are invertebrates, and among invertebrates, arthropods (insects, crustaceans, spiders and relatives) are by far the most diverse group with more than 1.2 million living species. "}, {"url": "http://www.diffen.com/difference/Invertebrate_vs_Vertebrate", "passage_text": "Animals can be classified into two main groups: vertebrates and invertebrates. The main difference between vertebrates and invertebrates is that invertebrates, like insects and flatworms, do not have a backbone or a spinal column. Examples of vertebrates include humans, birds, and snakes. "}, {"url": "http://www.nwf.org/Wildlife/Wildlife-Library/Invertebrates.aspx", "passage_text": "To identify an animal as an invertebrate, it should have these characteristics: 1  Invertebrates have no backbone! 2  Any animal that doesn't have a spine is an invertebrate. 3  Invertebrates are cold-blooded. 4  They cannot regulate their own body temperature. "}, {"url": "http://www.biologicaldiversity.org/species/invertebrates/", "passage_text": "To group all invertebrates together is an immodest proposal, since the definition of invertebrate is any animal without a spinal column — no less than 97 percent of all animal species on Earth. "}, {"url": "http://www.thefreedictionary.com/invertebrate", "passage_text": "1. Lacking a backbone or spinal column; not vertebrate. 2. Of or relating to invertebrates: invertebrate zoology. n. An animal, such as an insect or mollusk, that lacks a backbone or spinal column. 1. invertebrate-any animal lacking a backbone or notochord; the term is not used as a scientific classification. animal, animate being, beast, creature, fauna, brute-a living organism characterized by voluntary movement."}, {"url": "http://kids.britannica.com/elementary/article-437406/Invertebrate", "passage_text": "An invertebrate is an animal without a backbone. (An animal with a backbone is called a vertebrate.) Invertebrates live in every part of the world. In fact, most of the animals on Earth are invertebrates. Invertebrates come in all different shapes and sizes. Some can be seen only through a microscope. Sponges, flatworms, jellyfish, sea. Encyclopaedia Encyclopædia, Britannica. Inc an invertebrate is an animal without a. (Backbone an animal with a backbone is called a.) Vertebrate invertebrates live in every part of the. world"}]