[{"url": "http://www.drlwilson.com/ARTICLES/SUPERPHOSPHATES.htm", "passage_text": "Today, almost all crops are fertilized with what are called superphosphate fertilizers or N-P-K fertilization methods. This applies to organically grown food as well as conventionally raised produce, sadly. "}, {"url": "http://www.wisegeek.com/what-is-a-superphosphate-fertilizer.htm", "passage_text": "Single superphosphate is the mildest grade, and contains between 16 and 20 percent phosphate. It is typically available in a liquid or a dry formula, both of which are used with the same efficiency by plants. It is also known as normal superphosphate fertilizer. All three types of superphosphate are usually made with a naturally occurring substance called rock phosphate. While this can be applied as a fertilizer in its raw form, putting it through the chemical reactions to create other types of fertilizer has been found to make it more effective."}, {"url": "http://www.ipni.net/publication/nss.nsf/beagle?OpenAgent&d=NSS-14&f=NSS-14%20Triple%20Superphosphate.pdf", "passage_text": "Triple Superphosphate Triple superphosphate (TSP) was one of the first high analysis P fertilizers that became widely used in the 20th cen-tury. Technically, it is known as calcium dihydrogen phosphate and as monocalcium phosphate, [Ca(H 2 PO 4) 2 .H 2 O]. "}, {"url": "http://www.wisegeek.com/what-is-a-superphosphate-fertilizer.htm", "passage_text": "When applied to the soil, a superphosphate fertilizer raises the amount of phosphorus available to plants. Regardless of type of plant, all require a healthy amount of phosphorus in order to survive. This nutrient is present in every cell of the plant, and is vital in maintaining the strength of the cell structure. All three types of superphosphate are usually made with a naturally occurring substance called rock phosphate. While this can be applied as a fertilizer in its raw form, putting it through the chemical reactions to create other types of fertilizer has been found to make it more effective."}, {"url": "http://encyclopedia2.thefreedictionary.com/superphosphate", "passage_text": "Superphosphate. the most widely used mineral phosphorus fertilizer. The phosphorus in superphosphate is usually in the form of monocalcium phosphate and free phosphoric acid. The fertilizer contains gypsum and other admixtures, such as iron and aluminum phosphates, silica, and fluorine compounds. Superphosphate is used in all soils as a basic presowing fertilizer; it may be applied at the time of sowing, in which case granular superphosphate is the best type, or for top dressing. It is especially effective in alkaline and neutral soils."}, {"url": "http://www.wisegeek.com/what-is-a-superphosphate-fertilizer.htm", "passage_text": "Superphosphate fertilizers have a high content of the nutrient phosphate. One of the three nutrients essential to healthy plant growth, phosphate can be applied in a high concentration with a superphosphate fertilizer to plants ranging from houseplants to agricultural crops. Several different types of this fertilizer have been created for different needs. All three types of superphosphate are usually made with a naturally occurring substance called rock phosphate. While this can be applied as a fertilizer in its raw form, putting it through the chemical reactions to create other types of fertilizer has been found to make it more effective."}, {"url": "http://ccmaknowledgebase.vic.gov.au/shkb/brown_book/12_Superphosphate.htm", "passage_text": "1 Superphosphate is a fertiliser produced by the action of concentrated sulphuric acid on powdered phosphate rock. 2  Phosphorus (P) is frequently a limiting nutrient to the growth of pasture. 3  Generally, soils in Australia are depleted in phosphorus due to weathering and erosion. 1 Superphosphate (8.8% P) - This is produced by treating rock phosphate with sulphuric acid, and is the most commonly used phosphorus fertiliser. 2  Also used are double superphosphate (17.1% P), triple superphosphate (20.7% P), mono-ammonium phosphate (MAP,21.9% P), or di-ammonium phosphate (DAP, 20%P)."}, {"url": "http://www.teara.govt.nz/en/superphosphate/page-4", "passage_text": "There are alternatives to superphosphate as a source of phosphorus for crops and pastures. Superphosphate is not used on organic farms because it is a manufactured (chemical) fertiliser. Organic farmers use unmodified rock phosphates that will react with the natural acids in the soil to release phosphorus. Superphosphate has been a reliable and cost-effective fertiliser in New Zealand since 1882, especially on sheep and dairy farms. Once it was known that superphosphate was widely suitable for New Zealand pastures, suppliers struggled to meet the demand."}]