[{"url": "https://www.kabbage.com/", "passage_text": "Working capital at your fingertips. Kabbage helps small businesses get the funding they need to grow. Kabbage is A+ rated by the Better Business Bureau and has provided more online small business loans than anyone in the industry! “ Kabbage financing resembles a line of credit — customers only pay for what they use ”. Go to Kabbage Blog. Kabbage can approve you in minutes when we are able to automatically obtain your business data and instantly verify your bank account. In some situations errors may occur during the sign up process, or we may need to send micro-deposits to confirm your bank account for security purposes."}, {"url": "https://en.wikipedia.org/wiki/Kabbage", "passage_text": "History [edit]. Kabbage, Inc. was established in 2009 by Rob Frohwein, Marc Gorlin, and Kathryn Petralia. The financial services data and technology platform based out of Atlanta, Georgia, publicly launched and began making its first loans in May 2011. In October 2015, Kabbage completed a Series E funding round of $135 million led by Reverence Capital Partners. Holland’s ING, Spain’s Santander (via InnoVentures, Santander's venture capital arm); and Canada’s Scotiabank also participated in the round. This latest funding values the company at over $1 billion."}, {"url": "https://www.kabbage.com/", "passage_text": "Kabbage Mobile. You’re on the go. And now, so is your Kabbage business line of credit. With our new mobile app, it's easier than ever to get financing when you need it. The Kabbage mobile app lets you take loans, pay your bill and view your transaction history from your phone. Go to Kabbage Blog. Kabbage can approve you in minutes when we are able to automatically obtain your business data and instantly verify your bank account. In some situations errors may occur during the sign up process, or we may need to send micro-deposits to confirm your bank account for security purposes."}, {"url": "http://www.reviewopedia.com/kabbage-com-reviews", "passage_text": "About Kabbage.com. Kabbage.com can provide the working capital to help your e-commerce business grow. They offer fast and flexible funding without the typical process used to obtain a tradition bank loan. This is an unsecured loan and there is no collateral required. On Kabbage.com you can also take more than one advance at a time. To obtain funding you must first meet the initial requirements; you must have been in business for at least one year and you must have at least $1000.00 in monthly sales."}, {"url": "http://fitsmallbusiness.com/kabbage-reviews/", "passage_text": "In addition to small business loans, Kabbage offers personal loans through its sister service, Karrot Personal Loans. These are unsecured personal loans of $5,000-$35,000 with an origination fee and monthly payments for either 36 or 60 months based on your credit history. "}, {"url": "https://en.wikipedia.org/wiki/Kabbage", "passage_text": "Kabbage, Inc. is an online financing technology and data company based in Atlanta, Georgia. The company provides funding directly to small businesses and consumers through an automated lending platform. In October 2015, Kabbage completed a Series E funding round of $135 million led by Reverence Capital Partners. Holland’s ING, Spain’s Santander (via InnoVentures, Santander's venture capital arm); and Canada’s Scotiabank also participated in the round. This latest funding values the company at over $1 billion."}, {"url": "https://www.creditkarma.com/reviews/personal-loan/single/id/kabbage-small-business-loans", "passage_text": "Company Overview. Kabbage is an online financing corporation that provides working capital to small businesses. The online application process only takes minutes, making it quick and convenient. Loan amounts range from $500-$50,000 with 24 hour access to your funds. Founded in 2009, Kabbage is based in Atlanta, Georgia, with offices now in San Francisco as well as the United Kingdom. Kabbage was named a Red Herring 100 North American Winner as well as one of the Top 10 most innovative Companies in Finances. Read their BBB's reviews. It's every expensive and each month you are paying back interest and part of capital back to Kabbage. The fees I received was at a very expensive rate of 31.4%, and they told me it's low. They extended my loan period from 6 months to 12 months."}, {"url": "http://www.buzzfile.com/business/Kabbage,-Inc.-855-278-7084", "passage_text": "Kabbage is located in Atlanta, Georgia. This organization primarily operates in the Short-term Business Credit Institutions, except Agricultural business / industry within the Nondepository Credit Institutions sector. This organization has been operating for approximately 6 years. Kabbage is estimated to generate $12.3 million in annual revenues, and employs approximately 90 people at this single location. Kabbage has approximately 90 employees at this location. The website (URL) for Kabbage is www.kabbage.com. The phone number for Kabbage is (855) 278-7084. Marc Gorlin is the Chairman at Kabbage. You can contact Marc at (855) 278-7084. Kabbage is located at 730 Peachtree St NE, Atlanta, GA 30308."}, {"url": "https://www.kabbage.com/", "passage_text": "Kabbage gives you the security of working capital whenever you need it. Draw against your line of credit, as often as once a day, for anything you need to grow your business. Unlike traditional lenders, we approve small business loans by looking at real-life data, not just a credit score. Go to Kabbage Blog. Kabbage can approve you in minutes when we are able to automatically obtain your business data and instantly verify your bank account. In some situations errors may occur during the sign up process, or we may need to send micro-deposits to confirm your bank account for security purposes."}, {"url": "https://en.wikipedia.org/wiki/Kabbage", "passage_text": "In September 2014, Kabbage, Inc. leveraged the same technology and data platform to launch its second brand, Karrot personal loans In that same month, Kabbage began lending $2 million per day to small businesses. In October 2015, Kabbage completed a Series E funding round of $135 million led by Reverence Capital Partners. Holland’s ING, Spain’s Santander (via InnoVentures, Santander's venture capital arm); and Canada’s Scotiabank also participated in the round. This latest funding values the company at over $1 billion."}]