[{"url": "http://www.aquahabitat.com/techfaqs.html", "passage_text": "Here are some numbers you can use for your pond or lake project. To move or excavate dirt to build or dig a pond, you can expect to pay roughly $2.50 per cubic yard of material dug out of the pond. Figure $1.50 - 3.50 per yard of material depending on the difficulty of excavation and costs specific to local market conditions. A pond is very much more than a hole in the ground that collects water. After calculating a rough pond excavation budget, now double the pond construction budget due to the cost of dredging and re-digging the pond in ten to twenty years or sooner due to a poor pond design."}, {"url": "http://www.gardenmyths.com/pond-pumps-filters/", "passage_text": "But this is not usually a problem in a man-made garden pond. If your pond water is green with algae it is probably healthy. You might not like the look – that is a different matter. In Japan, garden ponds are treasured and it is common to buy a dye to color the pond water. The use of the word ‘natural’ here refers to the pond filtration system, not the esthetic look of the pond. I’ll deal with esthetics in a future post on how to build ponds. In a natural pond the water, soil, plants, and animals all live in harmony. No one comes along to clean the pond or to aerate it."}, {"url": "http://www.ehow.com/how_8697374_make-manmade-pond.html", "passage_text": "Measure the pond outline to determine how much liner you will need. To do this, determine how deep you want your pond to be and double this number: for example, double a 4-foot pond to 8 feet. Then add the width and the amount of the doubled depth, plus 2 feet for overlap, and do the same for the height. The resulting numbers will be the size liner you need. Remove the grass from the pond area using a flat shovel, going about 6 inches outside of the perimeter you drew. Dig out the pond, going approximately 2 inches below the depth you need for your pond to make room for settlement. Remove any roots or sharp stones from the hole, as these can damage your liner."}, {"url": "http://www.livingthecountrylife.com/homes-acreages/ponds/understand-how-to-maintain-your-ponds-ecosystem/", "passage_text": "Wildlife is a large part of the pleasure of a pond. A large body of still water attracts quail, rabbits, raccoons, turtles, songbirds, ducks, and deer. You can increase wildlife populations by providing plenty of cover in the form of grasses, trees, and shrubs, especially those that bear small fruits. Create an underwater shelter. As long as you fish regularly in your pond, You can get a pretty good idea of the health and fish population, says Stratford Kay, aquatic specialist at North Carolina State University. To help fish breed and survive, create an underwater shelter in your pond."}, {"url": "https://en.wikipedia.org/wiki/Pond", "passage_text": "Researchers for the British charity Pond Conservation have defined a pond to be 'a man-made or natural waterbody which is between 1 m 2 and 20,000 m 2 in area (2 ha or ~5 acres), which holds water for four months of the year or more.' Other European biologists have set the upper size limit at 5 ha (12 acres). "}, {"url": "http://www.gardenmyths.com/pond-pumps-filters/", "passage_text": "A man-made pond made with a pond liner has no soil – so one source of micro-organisms is missing, especially if you keep cleaning the pond liner. Most ponds have few stones and few plants reducing the number of micro-organisms even further. The use of the word ‘natural’ here refers to the pond filtration system, not the esthetic look of the pond. I’ll deal with esthetics in a future post on how to build ponds. In a natural pond the water, soil, plants, and animals all live in harmony. No one comes along to clean the pond or to aerate it."}, {"url": "http://www.livingthecountrylife.com/homes-acreages/ponds/understand-how-to-maintain-your-ponds-ecosystem/", "passage_text": "There is no single right way to manage a pond and no one wrong way.. The key, says Norland, is to decide what you want out of a pond and how to get it. If repairing that sagging outbuilding or building a patio is taking up all your time, it's perfectly OK just to let the pond go and let it do whatever it wants. Create an underwater shelter. As long as you fish regularly in your pond, You can get a pretty good idea of the health and fish population, says Stratford Kay, aquatic specialist at North Carolina State University. To help fish breed and survive, create an underwater shelter in your pond."}, {"url": "http://www.aquahabitat.com/techfaqs.html", "passage_text": "For instance, a one acre pond that averages ten feet deep will have a volume of 16,133 cubic yards. If you only need to excavate one-tenth of this to build a low dam, your excavation expense could drop from the $30,000 per acre range to the $8,000 range. A pond is very much more than a hole in the ground that collects water. After calculating a rough pond excavation budget, now double the pond construction budget due to the cost of dredging and re-digging the pond in ten to twenty years or sooner due to a poor pond design."}, {"url": "http://www.aquahabitat.com/techfaqs.html", "passage_text": "If your water supply is not contributing to the lake or pond and you are losing on the order of 15-17 inches (arid climate) or 7-9 inches (temperate climate) of water per month during summer, you may not need to even think about resealing the pond. A pond is very much more than a hole in the ground that collects water. After calculating a rough pond excavation budget, now double the pond construction budget due to the cost of dredging and re-digging the pond in ten to twenty years or sooner due to a poor pond design."}]