[{"url": "https://www.facebook.com/larrybirkheadofficial", "passage_text": "Anna Nicole Smith's daughter Dannielynn and ex-boyfriend Larry Birkhead to star in E! specialAnna Nicole Smith's daughter Dannielynn and ex-boyfriend Larry Birkhead to star in E! special."}, {"url": "http://www.eonline.com/news/603309/patti-stanger-talks-setting-up-anna-nicole-smith-s-ex-larry-birkhead-on-millionaire-matchmaker-watch-now", "passage_text": "Anna Nicole Smith 's ex Larry Birkhead is looking for love. The 41-year-old, who is the father and caretaker of his and Anna Nicole's daughter Danielynn Birkhead, finally wants to start dating again after being single since Anna Nicole's death eight years ago."}, {"url": "http://www.hollywoodtake.com/larry-birkhead-dating-daughter-dannielynn-ready-her-father-date-anna-nicole-smiths-64386", "passage_text": "Photo: Reuters. Larry Birkhead is looking for love after Anna Nicole Smith and turned to Patti Stanger for dating help in the latest episode of 'Millionaire Matchmaker'. Larry Birkhead is dating again thanks to Millionaire Matchmaker guru Patti Stanger. After Anna Nicole Smith's death, Birkhead fought for his daughter, Dannielynn. And since then his main focus has been parenting. But he's finally ready to get out there again."}, {"url": "http://radaronline.com/exclusives/2014/12/larry-birkhead-millionaire-matchmaker-anna-nicole-smith/", "passage_text": "Larry Birkhead is comfortable the late Anna Nicole Smith, mother of his 8-year-old daughter Dannielynn, would be supportive of his efforts to dive back into the dating pool on the upcoming season of Bravo’s Millionaire Matchmaker."}, {"url": "http://www.inquisitr.com/1663276/millionaire-matchmaker-patti-tells-larry-birkhead-to-ditch-anna-nicole-shrine/", "passage_text": "The Millionaire Matchmaker Season 8 premiere had Patti Stanger working hard to make a match for photographer Larry Birkhead, who is famous for his battle for paternal rights for his daughter Dannielynn after her mother, Anna Nicole Smith, died in 2007. How hot is @larrybirkhead single dads are the best kept secret."}, {"url": "http://www.bustle.com/articles/52205-is-larry-birkhead-still-dating-his-match-from-millionaire-matchmaker-we-examine-the-evidence", "passage_text": "According to Stanger, Birkhead took Smith's death extremely hard — the matchmaker stated that Birkhead felt like [Smith] died mad at him. He was madly in love with her and he wouldn't give her up. He had a shrine in his house to her.. Now the top lady in Birkhead's life is their daughter, Dannielynn."}, {"url": "http://www.dailymail.co.uk/tvshowbiz/article-2641774/Anna-Nicole-Smiths-ex-Larry-Birkhead-reveals-daughter-Dannielynn-wants-substitute-mother-episode-Celebrity-Wife-Swap.html", "passage_text": "He's been a single parent to daughter Dannielynn following the untimely death of Anna Nicole Smith back in 2007. But Larry Birkhead may finally be ready to start dating again-at his seven-year-old urging."}]