[{"url": "https://en.wikipedia.org/wiki/Christiaan_Barnard", "passage_text": "Christiaan Neethling Barnard (8 November 1922 – 2 September 2001) was a South African cardiac surgeon who performed the world's first successful human-to-human heart transplant. Following the first successful kidney transplant in 1953, in the United States, Barnard performed the second kidney transplant in South Africa in October 1967, the first being done in Johannesburg the previous year."}, {"url": "https://en.wikipedia.org/wiki/Christiaan_Barnard", "passage_text": "He performed the world's first human heart transplant operation on 3 December 1967, in an operation assisted by his brother, Marius Barnard; the operation lasted nine hours and used a team of thirty people. Following the first successful kidney transplant in 1953, in the United States, Barnard performed the second kidney transplant in South Africa in October 1967, the first being done in Johannesburg the previous year."}, {"url": "http://www.healthguideinfo.com/surgical-heart-procedures/p66115/", "passage_text": "The First Open Heart Surgery Performed on a Human. The first open heart surgery conducted on a human patient occurred on September 2, 1952. Two surgeons from the University of Minnesota, Dr. Walton Lillehei and Dr. John Lewis, performed the procedure on a fiver-year-old girl with a hole in her heart. The first open heart surgery occurred in the early 1950s after a series of advancements were made in the research of heart problems. Prior to this time, most surgeons could not properly work on the organ and patients were relegated to living with or dying from heart problems. slide 1 of 4."}, {"url": "http://www.history.com/this-day-in-history/first-human-heart-transplant", "passage_text": "American surgeon Norman Shumway achieved the first successful heart transplant, in a dog, at Stanford University in California in 1958. After Washkansky’s surgery, he was given drugs to suppress his immune system and keep his body from rejecting the heart. A+E Networks. On December 3, 1967, 53-year-old Lewis Washkansky receives the first human heart transplant at Groote Schuur Hospital in Cape Town, South Africa."}, {"url": "https://en.wikipedia.org/wiki/Cardiac_surgery", "passage_text": "Nazih Zuhdi performed the first total intentional hemo-dilution open heart surgery on Terry Gene Nix, age 7, on February 25, 1960, at Mercy Hospital, Oklahoma City, OK. The operation was a success; however, Nix died three years later in 1963. "}, {"url": "http://www.answers.com/Q/Who_performed_first_open_heart_surgery", "passage_text": "The first successful open heart surgery was performed on July 9, 1893, when Dr. Daniel Hale Williams opened the chest of a man and repaired the pericardium (sac surrounding th … e heart) which had been damaged by a knife stabbing. The patient recovered after 51 days and lived for another 50 years. Michael Dugan. The first open heart surgery was not performed by Vivien Thomas and Alfred Blalock (in 1944), as mentioned in the previous post. In 1902 Dr. Luther Leonidas Hill performed the … first open heart surgery in the Western Hemisphere by suturing a stab wound in a young boy's heart."}, {"url": "http://www.huffingtonpost.com/2012/07/09/daniel-hale-williams-perf_n_1659949.html", "passage_text": "YouTube. In 1893, exactly 119 years ago Monday, Chicago surgeon Daniel Hale Williams performed the first successful open-heart surgery, in what would become both a significant medical advancement, and a huge step in the fight for equality, since Williams was one of the nation's few black cardiologists at the time. Dr. Hale Williams, back in 1893, had performed the first cardiac operation in the United States, and possibly the world as far as records show, Dr. Jonathan O. Nwiloh, a cardiothoracic surgeon, told TMW Media."}, {"url": "https://en.wikipedia.org/wiki/Christiaan_Barnard", "passage_text": "Barnard performed ten orthotopic transplants (1967–1973). He was also the first to perform a heterotopic heart transplant, an operation that he devised. Forty-nine consecutive heterotopic heart transplants were performed in Cape Town between 1975 and 1984. Following the first successful kidney transplant in 1953, in the United States, Barnard performed the second kidney transplant in South Africa in October 1967, the first being done in Johannesburg the previous year."}]