[{"url": "https://en.wikipedia.org/wiki/Mouthwash", "passage_text": "Mouthwash, mouth rinse, oral rinse or mouth bath, is a liquid which is held in the mouth passively or swilled around the mouth by contraction of the perioral muscles and/or movement of the head, and may be gargled, where the head is tilted back and the liquid bubbled at the back of the mouth. Chlorhexidine mouthwash alone is unable to prevent plaque, so it is not a substitute for regular toothbrushing and flossing. In the short term, if toothbrushing is impossible due to pain, as may occur in primary herpetic gingivostomatitis, chlorhexidine is used as temporary substitute for other oral hygiene measures."}, {"url": "https://en.wikipedia.org/wiki/Mouthwash", "passage_text": "Chlorhexidine digluconate is a chemical antiseptic and is used in a 0.12-0.2% solution as a mouthwash. It has significant anti-plaque action, but also some anti-fungal action. It is especially effective against Gram-negative rods. Chlorhexidine mouthwash alone is unable to prevent plaque, so it is not a substitute for regular toothbrushing and flossing. In the short term, if toothbrushing is impossible due to pain, as may occur in primary herpetic gingivostomatitis, chlorhexidine is used as temporary substitute for other oral hygiene measures."}, {"url": "https://en.wikipedia.org/wiki/Mouthwash", "passage_text": "The most common use of mouthwash is commercial antiseptics, which are used at home as part of an oral hygiene routine. Some manufacturers of mouthwash state that antiseptic and anti-plaque mouth rinse kill the bacterial plaque that causes cavities, gingivitis, and bad breath. Anti-cavity mouth rinse uses fluoride to protect against tooth decay. Chlorhexidine mouthwash alone is unable to prevent plaque, so it is not a substitute for regular toothbrushing and flossing. In the short term, if toothbrushing is impossible due to pain, as may occur in primary herpetic gingivostomatitis, chlorhexidine is used as temporary substitute for other oral hygiene measures."}, {"url": "http://www.wisebread.com/19-money-saving-uses-for-mouthwash", "passage_text": "Clean Cuts and Scrapes. Remember, mouthwash was first used as a surgical antiseptic before people figured out its mouth-washing properties. Apply some mouthwash to your boo-boo, dry, and dress it with a bandage as necessary. Laundry Sanitizer. In the same way that mouthwash removes bacteria from your mouth, you can remove it from your laundry as well. Add one cup to the regular cycle of a full load of laundry (make sure the mouthwash is sugar-free and alcohol-based)."}, {"url": "http://www.wisegeek.com/what-is-the-history-of-listerinereg.htm", "passage_text": "Listerine was used to disinfect wounds in World War I. Listerine mouthwash can be used to reduce oral bacteria that can lead to gum disease, tooth infections and tooth loss. Listerine has been used to treat sore throats. Listerine® was promoted as a cold remedy for decades. Listerine came to be used exclusively as a mouthwash during the 1970s. Bad breath was not a major consumer concern until Listerine(R) started advertising its product as a bad breath treatment in the 1920s. It was not until the 1920s that Listerine was marketed as a treatment for bad breath"}, {"url": "https://en.wikipedia.org/wiki/Listerine", "passage_text": "Listerine is a brand of antiseptic mouthwash product. It is promoted with the slogan Kills germs that cause bad breath. Named after Joseph Lister, 1st Baron Lister, a pioneer of antiseptic surgery, Listerine was actually developed in 1879 by Joseph Lawrence, a chemist in St. Louis, Missouri."}, {"url": "http://www.mayoclinic.org/tests-procedures/chemotherapy/expert-answers/magic-mouthwash/FAQ-20058071", "passage_text": "Magic mouthwash is the term given to a solution used to treat mouth sores (oral mucositis) caused by some forms of chemotherapy and radiation therapy. Oral mucositis can be extremely painful and can result in an inability to eat, speak or swallow. Magic mouthwash provides some relief. "}, {"url": "https://en.wikipedia.org/wiki/Listerine", "passage_text": "The Listerine brand name is also used in toothpaste, Listerine Whitening rinse, Listerine Fluoride rinse (Listerine Tooth Defense), Listerine SmartRinse (children's fluoride rinse), PocketPaks, and PocketMist. In September 2007, Listerine began selling its own brand of self-dissolving teeth whitening strips. Named after Joseph Lister, 1st Baron Lister, a pioneer of antiseptic surgery, Listerine was actually developed in 1879 by Joseph Lawrence, a chemist in St. Louis, Missouri."}, {"url": "http://www.wisebread.com/19-money-saving-uses-for-mouthwash", "passage_text": "Mouthwash is useful for so much more than just rinsing plaque away! When it was first invented, it hailed as a surgical antiseptic, and as such it has unique properties that can save you lots of money. Laundry Sanitizer. In the same way that mouthwash removes bacteria from your mouth, you can remove it from your laundry as well. Add one cup to the regular cycle of a full load of laundry (make sure the mouthwash is sugar-free and alcohol-based)."}, {"url": "http://www.madehow.com/Volume-6/Mouthwash.html", "passage_text": "Mouthwash is a liquid oral product designed to freshen breath. Certain varieties may also kill bacteria and/or whiten teeth. Mouthwashes are made by combining the appropriate raw materials in large, stainless steel tanks and then filling the product into individual packages. "}]