[{"url": "https://labtestsonline.org/understanding/analytes/rbc/tab/test", "passage_text": "While an RBC count can be used to detect a problem with red blood cell production and/or lifespan, it cannot determine the underlying cause. In addition to the full CBC, some other tests may be performed at the same time or as follow up to help establish a diagnosis. Examples include: 1  Blood smear. 2  Reticulocyte count."}, {"url": "http://www.funtrivia.com/askft/Question95782.html", "passage_text": "A red blood cell is sometimes simply referred to as a red cell. It is also called an erythrocyte or, rarely today, a red blood corpuscle. Red cells contain hemoglobin and it is the hemoglobin which permits them to transport oxygen (and carbon dioxide). Hemoglobin, aside from being a transport molecule, is a pigment. It gives the cell its red color (and name)."}, {"url": "http://www.answers.com/Q/What_is_the_scientific_name_for_red_blood_Cells", "passage_text": "Answer by Betaclamp. Confidence votes 20.9K. Erythrocytes; abbreviated RBC's. The scientific name for red blood cells is Erythrocytes. {I'm 13 and I know this}: Red blood cells = Erythrocytes; White blood cells = Leukocytes; Platelets = Thrombocytes; and. Plasma = Plasma-there are several types."}, {"url": "https://labtestsonline.org/understanding/analytes/rbc/tab/test", "passage_text": "A red blood cell (RBC) count is typically ordered as part of a complete blood count (CBC) and may be used as part of a health checkup to screen for a variety of conditions."}, {"url": "https://labtestsonline.org/understanding/analytes/rbc/tab/test", "passage_text": "Since an RBC count is performed as part of a complete blood count (CBC) , results from other components are taken into consideration. A rise or drop in the RBC count must be interpreted in conjunction with other parameters, such as hemoglobin, hematocrit, reticulocyte count, and/or red blood cell indices."}, {"url": "https://labtestsonline.org/understanding/analytes/rbc/tab/test", "passage_text": "An RBC count is ordered as a part of the complete blood count (CBC) , often as part of a routine physical or as part of a pre-surgical workup. When someone has signs and symptoms suggesting a disease that might affect red blood cell production, a CBC that includes the RBC count may help make a diagnosis."}, {"url": "http://www.healthline.com/health/rbc-count", "passage_text": "A red blood cell count is a blood test that your doctor uses to find out how many red blood cells (RBCs) you have in your blood. It is also called an erythrocyte count. The test is important because RBCs contain hemoglobin, which carries oxygen to your body’s tissues."}]