[{"url": "http://blog.taxjar.com/state-sales-tax-phone-numbers/", "passage_text": "Connecticut Phone Number: 860-297-5962 Press 5 for Representative, 2 for Sales Tax, finally 3 for more options to get someone for your specific problem. Florida Phone Number: 1-800-352-3671 Press 1 for English then 0 for Representative (hidden option). Here we go: press 3 for Sales Tax, 2 for Registered Sales Tax Questions, 3 for Sales Tax, 1 for Sales Tax (yes, again), 4 for Other Questions, then finally enter your account info. Minnesota Phone Number: 651-296-6181."}, {"url": "http://blog.taxjar.com/state-sales-tax-phone-numbers/", "passage_text": "This is a number specific for sales tax division number, so you can listen to all the various options or just hit 4 for “All Other Calls.”. Maryland Phone Number: 1-800-638-2937. Press 1 for English then 5 for Business. Here we go: press 3 for Sales Tax, 2 for Registered Sales Tax Questions, 3 for Sales Tax, 1 for Sales Tax (yes, again), 4 for Other Questions, then finally enter your account info. Minnesota Phone Number: 651-296-6181."}, {"url": "http://www.co.dutchess.ny.us/CountyGov/Departments/Finance/FNsalestax.htm", "passage_text": "The County sales tax is collected by the State of New York. The current sales tax effective June 1, 2005 is 8.125% which is distributed as follows: County - 3.75%. State - 4.0%. MTA - 0.375%. If you want a sales tax identification number in New York, you need to apply for it from the New York State Department of Taxation and Finance. The Business Tax Information Center can be reached by calling 1-800-972-1233. "}, {"url": "http://www3.dps.ny.gov/W/PSCWeb.nsf/All/72BA9EC4CC879AFA85257687006F3AB8", "passage_text": "City school taxes are allowable up to 3%. An additional 0.375% MTA Tax Surcharge applies in the New York Metropolitan area and may be bundled with the State or Local Sales Tax. Calls to entertainment and information services, such as those dialed using 500, 700, 800 or 900 telephone numbers, are taxed at an additional 5%. c. What it is applied to: All intrastate services, including all surcharges, except the E911 charge. d. Statutory Authority: New York State Tax Law, § 1101 et seq. "}, {"url": "https://gethuman.com/phone-number/New-York-State-Department-of-Taxation-and-Finance", "passage_text": "What to know before you dial. Press 1, then 3 then 4. This phone number is popular with other New York State Department of Taxation and Finance customers, but be sure to follow the 5 steps further down. 6 mins average hold time. call Mon-Fri 8:30am-4:30pm EST. #1 of 1 New York State Department of Taxation and Finance phone numbers"}, {"url": "http://www.tax.ny.gov/bus/st/stidx.htm", "passage_text": "Sales and use tax. Sales tax applies to retail sales of certain tangible personal property and services. Use tax applies if you buy tangible personal property and services outside the state and use it within New York State. Video: NYS Sales T"}, {"url": "http://www.online-tax-id-number.org/memdocs/state-sales-tax-applications/New-York-State-Resale-Certificate-Application-Registration.htm", "passage_text": "Purchases for Resale. You are able to purchase items withoutpaying state sales tax. When you buy an item for resale, you purchase the item without paying state sales tax. Items must be for resale or qualified business use. If you purchase an item from a wholesale organization, or even another retailer, and are reselling the item, in most situations, you will be exempt from paying state sales tax. "}, {"url": "http://www.ny.gov/services/register-sales-tax", "passage_text": "1 Tax preparer information: (address, phone number, and preparer's federal EIN) if your business uses a preparer to complete sales tax returns. 2  Business contacts' and responsible persons' information: You will need the following detailed information for each business contact: 3  Name. WYSIWYG. Apply for a Sales Tax Certificate of Authority, which gives you the right to collect tax on your taxable sales and issue and accept most New York State sales tax exemption certificates."}, {"url": "http://blog.taxjar.com/state-sales-tax-phone-numbers/", "passage_text": "Press 4 for Agent then 1 for Sales Tax. Washington Phone Number: 1-800-647-7706. Press 1 for Touch Tone, 0 for Tax Specialist, 7 for Other, then finally 0 to bypass the Tax ID option. Washington DC Phone Number: 202-727-4829. Press 6 for business tax, press 4 for business taxes. Here we go: press 3 for Sales Tax, 2 for Registered Sales Tax Questions, 3 for Sales Tax, 1 for Sales Tax (yes, again), 4 for Other Questions, then finally enter your account info. Minnesota Phone Number: 651-296-6181."}]