[{"url": "http://www.ask.com/science/four-types-organic-compounds-9f692d54a551d43f", "passage_text": "Quick Answer. The four types of organic compounds are carbohydrates, lipids, proteins and nucleic acids. Organic molecules contain the elements carbon and hydrogen, and they are found and made in living things."}, {"url": "http://www.ask.com/science/four-types-organic-compounds-9f692d54a551d43f", "passage_text": "A: The four types of organic compounds are carbohydrates, lipids, proteins and nucleic acids. Organic molecules contain the elements carbon and hydrogen, and they are found and made in living things."}, {"url": "http://www.answers.com/Q/What_are_the_four_types_of_organic_molecules", "passage_text": "1. . Carbohydrates: Carbohydrates are organic compounds made of  carbon, hydrogen, and oxygen atoms. Carbs are made of  monosacharrides (single sugars) linked together. Thei … r function is  to provide a key source of energy for cells. An example is starch,  made of many linked glucose molecules."}, {"url": "http://www.scienceprofonline.com/chemistry/what-is-organic-chemistry-carbohydrates-proteins-lipids-nucleic-acids.html", "passage_text": "The feature that distinguishes an organic from inorganic molecule is that organic molecules contain carbon-hydrogen bonds, whereas inorganic molecules do not. The four major classes of organic molecules include carbohydrates, proteins, lipids and nucleic acids .​."}, {"url": "http://faculty.fmcc.suny.edu/mcdarby/Molecules&CellsBook/05-Organic-Molecules.htm", "passage_text": "The first class of molecules are called carbohydrates. The simplest type of these, monosaccharide simple sugars, have a basic formula: for every carbon atom, there are two hydrogens and one oxygen, or one water for each carbon."}, {"url": "http://chemistry.about.com/od/organiccompounds/ss/Types-of-Organic-Compounds.htm", "passage_text": "There are 4 main types or classes of organic compounds that are found in all living things. These are carbohydrates, lipids, proteins, and nucleic acids. In addition, there are other organic compounds that may be found in or produced by some organisms. All organic compounds contain carbon, usually bonded to hydrogen."}]