[{"url": "http://www.livestrong.com/article/412001-does-wheat-cause-bloating/", "passage_text": "Wheat field Photo Credit florin1961/iStock/Getty Images. Feeling bloated is a common experience after eating, often due to overeating, eating too fast or consuming certain foods and drinks, such as carbonated sodas. Wheat also causes bloating in some individuals, the reasons often varying from person to person. If you find that bloating occurs consistently after eating wheat, consult a qualified health practitioner to determine the cause."}, {"url": "http://www.livestrong.com/article/412001-does-wheat-cause-bloating/", "passage_text": "Gluten Sensitivity. Gluten is a generic name for proteins found in whole wheat, barley and rye. Some people have a hard time processing gluten in their digestive system, which can lead to symptoms of bloating, diarrhea, cramping, abdominal pain and constipation. Wheat also causes bloating in some individuals, the reasons often varying from person to person. If you find that bloating occurs consistently after eating wheat, consult a qualified health practitioner to determine the cause."}, {"url": "http://www.webmd.com/digestive-disorders/diarrhea-10/bloated-bloating", "passage_text": "1 Whole grains, recommended for their many health benefits, can sometimes cause bloating and gas problems. 2  One reason whole grains are so healthy is their high fiber content. 3  But fiber is an indigestible carbohydrate. 4  Abruptly increasing the amount of fiber you eat can cause gas, bloating, and constipation. "}, {"url": "http://www.upmc.com/patients-visitors/education/gastro/Pages/irritable-bowel-syndrome-diet.aspx", "passage_text": "1 The foods that have the most fiber are grains (especially bran), whole-grain breads and cereals, fruits, and vegetables. 2  Foods high in soluble fibers (like oats, peas, and beans) have been shown to ease both constipation and diarrhea. 3  Read food labels. Irritable Bowel Syndrome Diet. Irritable bowel syndrome (IBS) is a common disorder of the intestines. It can cause cramping, stomach pain, gas, bloating, and changes in bowel habits. Some people with IBS have constipation (difficult or infrequent bowel movements). Others have diarrhea (frequent, loose stools)"}, {"url": "http://healthyeating.sfgate.com/relieve-bloating-caused-much-fiber-4848.html", "passage_text": "Try a different source of fiber. Vegetables, fruits, wheat and oat bran are common fiber-rich foods, but eating too much of these foods together may cause bloating. For example, eat oatmeal without fruit for breakfast or have fruit but not whole-wheat toast or oatmeal"}, {"url": "http://www.answers.com/Q/Does_bread_cause_bloating", "passage_text": "Most bloating medicines work by providing your body with enzymes that help digest the sugars in carbohydrates. A lack of these digestive enzymes can cause problems for people, causing indigestion, gas, and bloating. Doctors believe that bloating is usually the result of an intestinal disorder, such as irritable bowel syndrome (IBS). And don't over eat, overeating is a common cause of bloating. Refined carbohydrates, such as bread, pasta, potatoes and rice, are common causes of bloating. These foods break down into sugar quickly, and sugar, when worked on by acids, ferments and creates gas."}, {"url": "http://www.bloatingtips.co.uk/blog/2013/06/does-bread-cause-bloating.html", "passage_text": "Bread is often associated with bloating. There are also many other causes of bloating. One of the reasons that bread can be a problem for many people is due to the gluten content in some types of flour including wheat and rye (which is commonly used in most generic types of bread). "}, {"url": "http://www.pureinsideout.com/foods-that-cause-bloating.html", "passage_text": "However, the list of foods below commonly causes bloating in many people. Raffinose-a sugar found in beans, cabbage, Brussels sprouts, broccoli, asparagus, other vegetables and whole grains. Eaten raw, these foods cause more bloating than when they are cooked. Lactose-a natural sugar found mainly in milk and milk products, such as cheese, cream, yoghurt and ice cream"}]