[{"url": "https://en.wikipedia.org/wiki/Bighorn_sheep", "passage_text": "Ovis canadensis is one of three species of mountain sheep in North America and Siberia; the other two species being Ovis dalli, which includes Dall sheep and Stone's sheep, and the Siberian snow sheep Ovis nivicola. For other uses, see Big Horn (disambiguation) . The bighorn sheep (Ovis canadensis) is a species of sheep native to North America named for its large horns. These horns can weigh up to 30 lb (14 kg), while the sheep themselves weigh up to 300 lb (140 kg)."}, {"url": "http://bioweb.uwlax.edu/bio203/s2007/white_dere/adaptations.htm", "passage_text": "Adaptations. Throughout history, bighorn sheep have lived through many different environments, and yet, still continue to thrive. From the years of the Westward Expansion to life in 2007, bighorn sheep adapt to their environment by adapting to us. Some of their physical features include: 1  Bighorn sheep know their terrain. 2  Rocky Mountain bighorns do not migrate during the winter months like many animals. 3  Instead they tough it out, reducing the number of predators they encounter"}, {"url": "https://en.wikipedia.org/wiki/Desert_bighorn_sheep", "passage_text": "Desert bighorn sheep (Ovis canadensis nelsoni) is a subspecies of bighorn sheep (Ovis canadensis) , that is native to the deserts of the Southwestern United States and Northwestern Mexico. The trinomial of this species commemorates the American naturalist Edward William Nelson (1855–1934). The desert bighorn has become well adapted to living in the desert heat and cold and, unlike most mammals, their body temperature can safely fluctuate several degrees. During the heat of the day, they often rest in the shade of trees and caves."}, {"url": "http://animals.nationalgeographic.com/animals/mammals/rocky-mountain-bighorn-sheep/", "passage_text": "A Rocky Mountain bighorn ram's horns can weigh 30 pounds (14 kilograms)—more than all the bones in his body combined. Females (ewes) also have horns, but they are of smaller size. Rocky Mountain bighorns inhabit the mountains from Canada south to New Mexico. Bighorn males, called rams, are famous for their large, curled horns. These impressive growths are a symbol of status and a weapon used in epic battles across the Rocky Mountains."}]