[{"url": "https://support.office.com/en-us/article/Move-or-resize-a-chart-F9D6087B-1D7B-4A72-8D81-1D0788EA783F", "passage_text": "This displays the chart tools, adding the Design, Layout, and Format tabs. On the Design tab, in the Location group, click Move Chart. Do one of the following: To move the chart to a new worksheet, click New sheet, and then in the New sheet box, type a name for the worksheet. To move the chart as an object in another worksheet, click Object in, and then in the Object in box, select the worksheet in which you want to place the chart."}, {"url": "http://en.allexperts.com/q/Excel-1059/2009/6/fix-sized-charts.htm", "passage_text": "A: Select the chart, then click the dialog box launcher in the Chart Tools / Format / Size group to display the Size And Properties dialog box. Use the controls in the Properties tab to change the move and size properties. "}, {"url": "https://support.office.com/en-us/article/Move-or-resize-a-chart-F9D6087B-1D7B-4A72-8D81-1D0788EA783F", "passage_text": "To resize a chart, do one of the following: To change the size manually, click the chart, and then drag the sizing handles to the size that you want. To use specific height and width measurements, on the Format tab, in the Size group, enter the size in the Shape Height and Shape Width box. To change the size and scaling of the chart, on the Format tab, in the Size group, click the Dialog Box Launcher next to Size, and then do the following: Do one of the following: To move the chart to a new worksheet, click New sheet, and then in the New sheet box, type a name for the worksheet. To move the chart as an object in another worksheet, click Object in, and then in the Object in box, select the worksheet in which you want to place the chart."}, {"url": "http://yourbusiness.azcentral.com/lock-position-chart-excel-7777.html", "passage_text": "If you insert a chart in a spreadsheet and you then insert additional data, the position of the chart changes. This is because the chart is set to move and size with the cells in your document. To lock the position of the chart, you need to edit its properties. Click the Don't move or size with cells radio button to lock the position of the chart, and then click Close to close the Format Chart Area window. Step 5. Press Ctrl-S to save the latest version of the spreadsheet."}, {"url": "http://www.techrepublic.com/blog/microsoft-office/quick-tip-apply-a-uniform-size-to-all-charts-on-an-excel-sheet/", "passage_text": "In Excel 2003, right-click the chart and choose Format Object. To assign the same size dimensions to all of the charts at the same time, do the following: 1  Select all of the charts by holding down the [Shift] key as you click each chart to create a multiple selection. To run the macro, return to Excel and select the sheet with the charts you want to resize. Click the Develop tab and then choose Macros in the Code group. Choose ResizeCharts() and click Run."}, {"url": "https://support.office.com/en-us/article/change-the-column-width-and-row-height-72f5e3cc-994d-43e8-ae58-9774a0905f46", "passage_text": "To change the default column width for a worksheet, click its sheet tab. To change the default column width for the entire workbook, right-click a sheet tab, and then click Select All Sheets on the shortcut menu. On the Home tab, in the Cells group, click Format. Under Cell Size, click Default Width. In the Default column width box, type a new measurement."}, {"url": "http://www.techrepublic.com/blog/microsoft-office/quick-tip-apply-a-uniform-size-to-all-charts-on-an-excel-sheet/", "passage_text": "1 Select all of the charts by holding down the [Shift] key as you click each chart to create a multiple selection. 2  Click the contextual Format tab. 3  In Excel 2003, right-click the selection, and choose Format Object. 4  Enter the appropriate dimension values using the Shape Height and Shape Width options in the Size group. To run the macro, return to Excel and select the sheet with the charts you want to resize. Click the Develop tab and then choose Macros in the Code group. Choose ResizeCharts() and click Run."}, {"url": "http://www.techrepublic.com/blog/microsoft-office/quick-tip-apply-a-uniform-size-to-all-charts-on-an-excel-sheet/", "passage_text": "1 Click the contextual Format tab. 2  In Excel 2003, right-click the selection, and choose Format Object. 3  Enter the appropriate dimension values using the Shape Height and Shape Width options in the Size group. To run the macro, return to Excel and select the sheet with the charts you want to resize. Click the Develop tab and then choose Macros in the Code group. Choose ResizeCharts() and click Run."}, {"url": "http://yourbusiness.azcentral.com/lock-position-chart-excel-7777.html", "passage_text": "Step 3. Click Properties in the left pane to view the properties of the chart in the right pane. Step 4. Click the Don't move or size with cells radio button to lock the position of the chart, and then click Close to close the Format Chart Area window. Step 5. Press Ctrl-S to save the latest version of the spreadsheet."}]