[{"url": "http://www.lkabminerals.com/en/Minerals/Aluminium-Trihydrate/", "passage_text": "Aluminium trihydrate, also known as aluminium trihydroxide or alumina trihydrate, is derived from bauxite ore. This natural ore is refined to a fine white powder via the Bayer process. After washing and drying it is used as the feedstock for a wide range of alumina chemicals. Aluminium trihydrate decomposes when exposed to heat yielding aluminium oxide and water; decomposition starts at 180 o C and is endothermic with a heat change of -1050J/g."}, {"url": "https://en.wikipedia.org/wiki/Sodium_acetate", "passage_text": "A hand warmer containing a supersaturated solution of sodium acetate which releases heat upon crystallization. Sodium acetate is also used in heating pads, hand warmers, and hot ice. Sodium acetate trihydrate crystals melt at 136.4 °F/58 °C (to 137.12 °F/58.4 °C), dissolving in their water of crystallization. When they are heated past the melting point and subsequently allowed to cool, the aqueous solution becomes supersaturated. "}, {"url": "http://www.aluminahydrate.com/aluminium-trihydrate.html", "passage_text": "We formulate and export a wide range of Aluminium Trihydrate. Aluminium Trihydrate are available in different uncoated and coated grades, with average particle size varying from 2 microns to 10 microns as per application. Aluminium Trihydrate is a common primary ingredient present in most solid surface material and accounts for as much as 70% of the total product. Synonyms. Aluminium Trihydrate are also known as Hydrate Alumina, Alumina Hydrate, Aluminium Tri Hydroxide, ATH, Aluminium Hydrate and Aluminium Hydroxid"}, {"url": "http://medical-dictionary.thefreedictionary.com/amoxicillin+trihydrate", "passage_text": "250 mg,Capsule Amoxycillin Trihydrate 500 mg,Tablet Amoxicillin D T 125 mg,Tablet or Capsule Cephelexin 500mgc. Supply of Capsule Amoxicillin 250 mg,Capsule Amoxicillin 500 ... by Mena Report. One layer of each tablet contains immediate-release. equivalent to 562. "}, {"url": "http://www.yourdictionary.com/trihydrate", "passage_text": "noun. The definition of a trihydrate is a chemical compound that has three molecules of water in it. An example of a trihydrate is the anti-infection drug amoxicillin trihydrate. a chemical compound containing three molecules of water. tri- + hydrate. Origin of trihydrate."}, {"url": "https://en.wikipedia.org/wiki/Alumina_trihydrate", "passage_text": "From Wikipedia, the free encyclopedia. (Redirected from Alumina trihydrate). Aluminium hydroxide, Al(OH) 3, is found in nature as the mineral gibbsite (also known as hydrargillite) and its three much rarer polymorphs: bayerite, doyleite and nordstrandite. Closely related are aluminium oxide hydroxide, AlO(OH), and aluminium oxide (or alumina), Al 2 O 3."}, {"url": "http://www.lkabminerals.com/en/Minerals/Aluminium-Trihydrate/", "passage_text": "Aluminum Trihydrate special properties. Aluminium trihydrate decomposes when exposed to heat yielding aluminium oxide and water; decomposition starts at 180 o C and is endothermic with a heat change of -1050J/g. A total loss of 34.7% of the original weight is seen"}, {"url": "http://www.thefreedictionary.com/trihydrate", "passage_text": "trihydrate. n. 1. (Chemistry) chem a substance that contains three molecules of water. 1  Facebook. 2  Twitter. "}, {"url": "http://www.merriam-webster.com/medical/trihydrate", "passage_text": "Medical Definition of TRIHYDRATE. : a chemical compound with three molecules of water. What made you want to look up trihydrate? "}, {"url": "http://www.hubermaterials.com/userfiles/files/PFDocs/Huber's%20Alumina%20Trihydrate%20(ATH)%20A%20Versatile%20Pigment%20for%20Coatings,%20Inks,%20Adhesives,%20Caulks%20and%20Sealants%20Applications.pdf", "passage_text": "Huber’s Alumina Trihydrate (ATH) Alumina trihydrate (ATH) is often associated with its role as a non-halogen flame retardant and smoke suppressant, and for good reason, as ATH is the largest selling fire retardant additive in the world. "}]