[{"url": "http://www.differencebetween.info/difference-between-sympathetic-and-parasympathetic", "passage_text": "Both the sympathetic nervous system (SNS) and parasympathetic nervous system (PSNS, or occasionally PNS) are part of the autonomic nervous system (ANS or visceral nervous system or involuntary nervous system). The sympathetic nervous system is one of the three parts of the ANS. The main purpose of the SNS is to activate the response of the body during stressful situations, including the fight-or-flight mechanism of the body. It is also responsible for regulating many homeostatic mechanisms in the body"}, {"url": "http://www.diffen.com/difference/Parasympathetic_nervous_system_vs_Sympathetic_nervous_system", "passage_text": "The parasympathetic nervous system (PNS) controls homeostasis and the body at rest and is responsible for the body's rest and digest function. The sympathetic nervous system (SNS) controls the body's responses to a perceived threat and is responsible for the fight or flight response. The parasympathetic nervous system is part of the autonomic nervous system. It originates in the spinal cord and the medulla and controls homeostasis, or the maintenance of the body's systems. The parasympathetic nervous system controls the rest and digest functions of the body"}, {"url": "http://www.differencebetween.com/difference-between-sympathetic-and-vs-parasympathetic-nervous-system/", "passage_text": "Thus, the fibers of parasympathetic efferent neurons are referred to as craniosacral outflow. Acetylcholine is the neurotransmitter at the terminal synapses in this nervous system. This system is responsible to maintain the activities such as “rest-and – digest” or “feed-and-breed” that occur when body is at rest. There are two divisions in the autonomic nervous system; i.e. sympathetic nervous system and parasympathetic nervous system. Both systems usually act on the same organ and generate the same action potentials, yet their functions are different and oppose each other. Sympathetic Nervous System."}, {"url": "http://www.answers.com/Q/What_are_the_differences_between_the_parasympathetic_nervous_system_and_the_sympathetic_nervous_system", "passage_text": "The parasympathetic nervous system is also referred to as rest and digest and it regulates our cardiac muscle, smooth muscle and glandular tissues. Main difference is that the parasympathetic nervous system maintains homeostasis, whereas the sympathetic nervous system manages the fight-or-flight response. "}, {"url": "http://www.diffen.com/difference/Parasympathetic_nervous_system_vs_Sympathetic_nervous_system", "passage_text": "The parasympathetic nervous system is one of the two main divisions of the autonomic nervous system (ANS). Its general function is to control homeostasis and the body's rest-and-digest response. The sympathetic nervous system (SNS) is one of two main divisions of the autonomic nervous system (ANS). Its general action is to mobilize the body's fight-or-flight response. Function. Control the body's response while at rest. The parasympathetic nervous system is part of the autonomic nervous system. It originates in the spinal cord and the medulla and controls homeostasis, or the maintenance of the body's systems. The parasympathetic nervous system controls the rest and digest functions of the body"}, {"url": "http://www.differencebetween.info/difference-between-sympathetic-and-parasympathetic", "passage_text": "The parasympathetic nervous system is one of the three parts of the ANS. It is responsible for stimulation of rest-and-digest or feed and breed activities that occur when the body is at rest. These activities include sexual arousal, salivation, tearing up, urination, digestion, and defecation. The sympathetic nervous system is one of the three parts of the ANS. The main purpose of the SNS is to activate the response of the body during stressful situations, including the fight-or-flight mechanism of the body. It is also responsible for regulating many homeostatic mechanisms in the body"}, {"url": "https://answers.yahoo.com/question/index?qid=20081021210707AAffFVx", "passage_text": "Relevance. Rating Newest Oldest. Best Answer: The sympathetic and parasympathetic nervous systems are part of the autonomic nervous system that controls the body functions that you don't have to think about, like digestion and heart rate, to keep the body's functions in balance. The sympathetic system is responsible for the 'flight or fight' response (increased heartbeat, sense of excitement, nervousness, anxiety). The parasympathetic system is responsible for the opposite-where youre in a calm and relaxed mode."}, {"url": "http://www.differencebetween.net/science/difference-between-sympathetic-and-parasympathetic/", "passage_text": "The sympathetic nervous system is one of the components of the autonomic nervous system. The nerves from the sympathetic system originate from the vertebral column commencing at the first segment of the thoracic region of the spinal column and extending up to the second or third lumbar region. The latter division is composed of the spinal cord and the brain itself. The former is further subdivided into the autonomic and somatic nervous systems. The autonomic nervous system is as well divided into the parasympathetic and sympathe"}]