[{"url": "http://syndicategroup.net/", "passage_text": "Syndicate Group. Syndicate Group is a global leader providing specialist and secure print products. Syndicate is ISO 9001:2008 Certified and has more than 25 years of experience in manufacturing niche printed paper products across diverse industries. The company has direct presence in India,UAE, UK and Netherlands. "}, {"url": "http://www.investopedia.com/terms/s/syndicate.asp", "passage_text": "DEFINITION of 'Syndicate'. A professional financial services group formed temporarily for the purpose of handling a large transaction that would be hard or impossible for the entities involved to handle individually. Syndication allows companies to pool their resources and share risks. Next Up. For example, an underwriting syndicate is a group of investment banks that works together to issue new stock to the public. The bank that takes the lead in this endeavor is called the syndicate manager."}, {"url": "https://en.wikipedia.org/wiki/Syndicate", "passage_text": "Look up syndicate in Wiktionary, the free dictionary. A syndicate is a self-organizing group of individuals, companies, corporations or entities formed to transact some specific business, to pursue or promote a shared interest. The Merriam Webster Dictionary defines syndicate as a group of people or businesses that work together. This may be a council or body or association of people or an association of concerns, officially authorized to undertake a duty or negotiate business with an office or jurisdiction."}, {"url": "http://www.investopedia.com/terms/u/underwriter-syndicate.asp", "passage_text": "DEFINITION of 'Underwriter Syndicate'. A temporary group of investment banks and broker-dealers who come together to sell new offerings of equity or debt securities to investors. The underwriter syndicate is formed and led by the lead underwriter for a security issue. An underwriter syndicate is usually formed when an issue is too large for a single firm to handle. The syndicate is compensated by the underwriting spread, which is the difference between the price paid to the issuer and the price received from investors and other broker-dealers. Also referred to as an underwriting group, banking syndicate and investment banking syndicate"}, {"url": "http://www.investorwords.com/411/banking_syndicate.html", "passage_text": "A banking syndicate is not a permanent entity, but forms specifically to handle a deal that might be too difficult or too risky for a single underwriter or borrower to handle. also called underwriting group or purchase group or banking syndicate or investment banking syndicate or distributing syndicate. 2. "}, {"url": "http://financial-dictionary.thefreedictionary.com/Syndicate", "passage_text": "Syndicate. When a group of investment banks works together to underwrite and distribute a new security issue, they are acting as a syndicate. Syndicates are temporary, forming to purchase the securities from the issuer and dissolving once the issue is distributed."}, {"url": "http://www.answers.com/Q/What_is_a_syndicate", "passage_text": "A Syndicate is a Group of People's or a Company ;) Answer: Syndicate comes from the French word syndicat which means trade union (syndic meaning administrator), from the Latin word syndicus which in turn comes from the Greek word (syndikos) which means caretaker of an issue, compare to ombudsman or representative. "}, {"url": "https://en.wikipedia.org/wiki/Syndicate", "passage_text": "In finance, a bank syndicate, often referred to simply as a syndicate, is a group of banks lending a usually large amount of money for a specific purpose and to one single borrower. The Merriam Webster Dictionary defines syndicate as a group of people or businesses that work together. This may be a council or body or association of people or an association of concerns, officially authorized to undertake a duty or negotiate business with an office or jurisdiction."}, {"url": "http://www.investopedia.com/terms/s/syndicate.asp", "passage_text": "There are several different types of syndicates, including underwriting syndicates, banking syndicates and insurance syndicates. For example, an underwriting syndicate is a group of investment banks that works together to issue new stock to the public. The bank that takes the lead in this endeavor is called the syndicate manager."}, {"url": "http://www.investorwords.com/4848/syndicate.html", "passage_text": "1. A group of investment banks which jointly underwrite and distribute a new security offering. also called underwriting group or purchase group or banking syndicate or investment banking syndicate or distributing syndicate. 2. Definitions (2). 1. A group of investment banks which jointly underwrite and distribute a new security offering. also called underwriting group or purchase group or banking syndicate or investment banking syndicate or distributing syndicate. 2. A group of investors who act together when investing in a company."}]