[{"url": "http://www.qstockinventory.com/blog/what-is-mrp/", "passage_text": "Material Requirements Planning, or MRP in short, is a scheduling, inventory control system and production planning control system that is used to maintain manufacturing processes."}, {"url": "http://mrpsystem.com/", "passage_text": "MRP System is an integral part of any business, whether it is a small proprietorship or a conglomerate. MRP System allows a company to concentrate on what it does best by balancing the business’ production aspect and controlling inventories. MRP or Materials and Resources Planning allows any company to scale with ease."}, {"url": "http://www.askdeb.com/inventory-management/mrp-inventory-management/", "passage_text": "Material Requirement Planning (or MRP) is an inventory system that is computer based and used to manage the manufacturing process. It is designed to assist in the scheduling and filling of orders for raw materials that are manufactured into finished products."}, {"url": "http://www.inc.com/encyclopedia/material-requirements-planning-mrp.html", "passage_text": "Related Terms: Enterprise Resource Planning; Inventory Control Systems. Material requirements planning (MRP) is a computer-based inventory management system designed to assist production managers in scheduling and placing orders for items of dependent demand."}, {"url": "http://searchmanufacturingerp.techtarget.com/definition/Material-requirements-planning-MRP", "passage_text": "Material requirements planning (MRP) is a production planning and inventory control system. An MRP integrates data from production schedules with that from inventory and the bill of materials (BOM) to calculate purchasing and shipping schedules for the parts or components required to build a product."}, {"url": "http://searchmanufacturingerp.techtarget.com/definition/Material-requirements-planning-MRP", "passage_text": "Stich Labs. Material requirements planning (MRP) is a production planning and inventory control system. An MRP integrates data from production schedules with that from inventory and the bill of materials (BOM) to calculate purchasing and shipping schedules for the parts or components required to build a product."}, {"url": "http://www.inc.com/encyclopedia/material-requirements-planning-mrp.html", "passage_text": "The first MRP systems of inventory management evolved in the 1940s and 1950s. They used mainframe computers to explode information from a bill of materials for a certain finished product into a production and purchasing plan for components."}]