[{"url": "http://wps.aw.com/bc_johnson_humanbio_6/176/45111/11548602.cw/index.html", "passage_text": "receptors for both lipid-soluble and lipid-insoluble hormones are found within the cell and usually within the nucleus. receptors for lipid-soluble hormones are on or in the cell membrane, whereas receptors for lipid-insoluble hormones are inside the cell."}, {"url": "http://www.interactivephysiology.com/login/endodemo/misc/assignmentfiles/endocrine/Action_of_Hormones.pdf", "passage_text": "Page 7.Lipid-soluble Hormones The lipid-soluble hormones are steroids and TH. Receptors are located inside cells, typically inside the nucleus. Each receptor has a site that binds to the hormone and a site that binds to DNA. The DNA site is covered by a chaperone molecule when no hormone is present."}, {"url": "https://en.wikipedia.org/wiki/Hormone_receptor", "passage_text": "Receptors for peptide hormones tend to be found on the plasma membrane of cells, whereas receptors for lipid-soluble hormones are usually found within the cytoplasm. Upon hormone binding, the receptor can initiate multiple signaling pathways which ultimately lead to changes in the behaviour of the target cells."}, {"url": "http://wps.aw.com/bc_johnson_humanbio_6/176/45111/11548602.cw/index.html", "passage_text": "When considering receptors for hormone molecules, we can say that, in general, ________. receptors for lipid-soluble hormones are inside the cell, whereas receptors for lipid-insoluble hormones are on or in the cell membrane. receptors for both lipid-soluble and lipid-insoluble hormones are found in or o"}, {"url": "http://www.interactivephysiology.com/login/endodemo/misc/assignmentfiles/endocrine/Action_of_Hormones.pdf", "passage_text": "Receptors for lipid-soluble hormones are found in the cytoplasm or the nucleus. Receptors will down-regulate and decrease sensitivity when there is prolonged exposureto high levels of a hormone. Receptors have the ability to up-regulate and increase sensitivity in response to sustainedlow"}, {"url": "https://wikis.engrade.com/kcaendocrine", "passage_text": "Water soluble hormones bind to receptors on the outside of the cell membrane causing the the actions of the cAMP second messenger. This in turn causes activation or inhibition of cellular activities. Lipid soluble hormones are the steroids and TH."}, {"url": "http://www.ncbi.nlm.nih.gov/books/NBK21517/", "passage_text": "Many lipid-soluble hormones diffuse across the plasma membrane and interact with receptors in the cytosol or nucleus. The resulting hormone-receptor complexes bind to transcription-control regions in DNA thereby affecting expression of specific genes (see Figure 20-2a)."}, {"url": "http://wps.aw.com/bc_johnson_humanbio_6/176/45111/11548602.cw/index.html", "passage_text": "receptors for both lipid-soluble and lipid-insoluble hormones are about equally distributed within the cell and as parts of the cell membrane. When a hormone binds to a receptor, the resulting molecule is called a(n) ________. hormone-steroidal complex."}]