[{"url": "http://www.dol.wa.gov/driverslicense/renewoutofstate.html", "passage_text": "Renew for 6 years by mail — Effective August 11, 2014, your license will be renewed for 6 years instead of 5 years. Note: Any application received after August 9, 2014 will be renewed as a 6 year license. If you don’t include the correct amount we’ll return it for re-submittal with the correct amount."}, {"url": "http://www.dmv.org/articles/license-renewal-grace-periods-how-much-time-do-you-really-have/", "passage_text": "Yet, Louisiana drivers have only a 10-day grace period in which to renew an expired license before a $15 delinquent fee kicks in. Before it’s actually time to renew your license, check your state’s license renewal requirements for information on grace periods; if you need further assistance, contact your DMV."}, {"url": "http://www.ct.gov/dmv/cwp/view.asp?A=805&Q=244744", "passage_text": "If DMV does not have your image on file, you will be required to present two (2) forms of identification from the primary or secondary list of acceptable forms of identification. NOTE: A $25 late fee will be charged for the renewal of an expired driver's license."}, {"url": "http://www.oregon.gov/ODOT/DMV/pages/driverid/licenserenew.aspx", "passage_text": "You can renew your driver license up to fourteen months before the expiration date and one year after the expiration date (unless you qualify for a military exemption). If your license is expired over one year and you do not qualify for the military exemption you will have to apply for an original driver license."}, {"url": "http://www.dds.ga.gov/drivers/DLdata.aspx?con=1743062603&ty=dl", "passage_text": "However, if your Georgia driver's license has been expired for two years or more; and you do not hold a valid out-of-state license, you must pass the following tests to obtain a Class C license: 1  Road sign test; 2  Road rules test; 3  Actual driving test;"}, {"url": "http://dps.sd.gov/licensing/driver_licensing/faqs.aspx", "passage_text": "Your driver license is valid for 5 years and will expire on your birthday or 30 days after your birthday if you are turning 21. You may renew the license anytime up to 180 days before it expires (unless you are turning 21, in which case you must wait until your 21st birthday)."}, {"url": "http://dor.mo.gov/faq/drivers/general.php", "passage_text": "If you are within six months of the expiration date on your driver license, you may apply for an early renewal. If not, the transaction would be processed as a duplicate with the same expiration date as your current driver license."}, {"url": "http://www.nh.gov/safety/divisions/dmv/driver-licensing/apply/renew.htm", "passage_text": "If your license expires, you can not legally drive until you renew it. The requirements for renewing an expired license will depend on how long it has been expired: 1  Expired for less than one year, renew as usual at any DMV office (if you are a Non-US Citizen, please visit Renew a Driver License for Non-US Citizens."}, {"url": "http://www.ct.gov/dmv/cwp/view.asp?A=805&Q=244744", "passage_text": "The fee for a six-year renewal of a non-commercial driver's license is $72.00. If your Connecticut Driver's License has been expired more than two years, you will be required to complete all testing requirements again. Please see Obtaining a License for the First Time for detailed information regarding testing."}]