[{"url": "http://www.ehow.com/how_8753673_download-multiple-files-using-idm.html", "passage_text": "Instructions. Open the IDM program on an Internet-connected computer. Click the Add URL button in the top navigation bar. An input box opens. Type the URL to the first file to download and click OK.. The file displays in the File window in the first position."}, {"url": "http://everydaylife.globalpost.com/download-multiple-files-using-idm-30721.html", "passage_text": "The Internet Download Manager application replaces your browser’s file download function, so that when you click on a download link, IDM launches automatically. To add multiple files to your IDM queue, drag and drop the download URLs into the Drop Target window. Alternatively, select multiple URLs in a document or application, and then use the right-click context menu to add the files to the queue. Once the files are in the queue, you can either start the downloads immediately or schedule them to download later using the Scheduler. Step 1."}, {"url": "https://www.internetdownloadmanager.com/support/using_idm/using_idm.html", "passage_text": "Click on Tell a Friend button to tell your friends about Internet Download Manager! You can add a new file to download with Add URL button. You can either enter new URL in the text box or select URL from existing ones."}, {"url": "http://www.ehow.com/how_8753673_download-multiple-files-using-idm.html", "passage_text": "Save. IDM is an acronym for the Internet Download Manager. The Internet Download Manager is a shareware program for Windows that is obtained from shareware sites such as.Downloads.CNET.com or Softpedia.com, or from the InternetDownloadManager.com site. The shareware version of the product is a 30-day trial version."}, {"url": "https://www.siteground.com/tutorials/cpanel/file_manager.htm", "passage_text": "How to upload files in File Manager: Step 1 Navigate to the folder where you want to upload your files. Step 2 Click on the Upload icon. Step 3 Click on the Browse button next to one of the top fields. Step 4 Search for and double-click on the first file to upload."}, {"url": "http://everydaylife.globalpost.com/download-multiple-files-using-idm-30721.html", "passage_text": "Click and drag a download URL to the Drop Target window, and then drop the URL into the window. The IDM Download dialog box opens. Step 4. Click the Browse button in the IDM Download dialog box to select the location where the downloaded file will be saved. Navigate to the location, and then click “OK.”. Step 5. Click the “Start Download” button to immediately start the download, or click “Download Later” to schedule the download for later."}]