[{"url": "http://www.answers.com/Q/What_is_a_user_name_in_facebook", "passage_text": "Go to your profile tab, the name that is popping beside your profile picture is regarded as Facebook user name. Click on it, and at the bottom you'll see 'Apps and … Websites' , 'Block List' and 'Controlling how you share'. Make sure you click on 'Block List' when you do, you'll see a list of people who you've blocked. Next to their name, you'll see something saying 'remove from list'."}, {"url": "https://en-gb.facebook.com/help/211813265517027", "passage_text": "Your Username or User ID can be used to access information about you through Facebook. For example, if someone has your username, they can type “facebook.com/” plus your username into their browser and see your public information, as well as anything else they're in the audience for. Similarly, someone with your Username or User ID can access information about you through our APIs, such as our Graph API. We use this information to help people find you and to organize your information internally. We use your username to create a custom link (a Facebook URL, such as www.facebook.com/username) to your profile that you can give out to people or post on external websites. Though Usernames are not the same as your name or Page name, they are typically variations on your name"}, {"url": "https://www.facebook.com/help/121237621291199/", "passage_text": "You'll need to be an admin to set a username for your Page. Keep in mind that after you set your Page's username, you can only change it once. To set a username for your Page: 1  Go to facebook.com/username. 2  Below Create your Facebook web address, select your Page from the dropdown menu. 3  Type a username and click Check Availability. 4  If the username is available, click Confirm"}, {"url": "http://www.wikihow.com/Register-a-Facebook-Username", "passage_text": "Tips. 1  You can change or modify your Facebook username at any time by repeating the steps above, depending on availability. 2  Facebook usernames were originally permanent as well, so keep in mind the current policy allowing modifications is subject to change. Tips. 1  You can change or modify your Facebook username at any time by repeating the steps above, depending on availability. 2  If the username you'd like is already taken or otherwise unavailable, try a variation of the name. 3  Facebook usernames are first come, first serve. 4  Usernames are not case sensitive."}, {"url": "https://www.facebook.com/help/211813265517027/", "passage_text": "Your Username or User ID can be used to access information about you through Facebook. For example, if someone has your username, they can type “facebook.com/” plus your username into their browser and see your public information, as well as anything else they're in the audience for. We use this information to help people find you and to organize your information internally. We use your username to create a custom link (a Facebook URL, such as www.facebook.com/username) to your profile that you can give out to people or post on external websites."}, {"url": "https://www.facebook.com/help/211813265517027/", "passage_text": "Usernames and User IDs are part of your Public profile. We use this information to help people find you and to organize your information internally. We use your username to create a custom link (a Facebook URL, such as www.facebook.com/username) to your profile that you can give out to people or post on external websites. Though Usernames are not the same as your name or Page name, they are typically variations on your name. For example, someone named Jane Doe might choose jane.doe for her username so her friends can visit her profile by going to www.facebook.com/jane.doe. Learn how to customize your profile usernam"}, {"url": "https://xenforo.com/help/facebook-user-id/", "passage_text": "How to Find the ID of a Facebook User. Facebook User Name: The Facebook Admin IDs setting in XenForo requires that you enter the Facebook user ID(s) of the designated administrators for that page within the Open Graph. Finding the Facebook user ID of a person (even yourself) can be a little challenging, but once you know where to look it's very simple. Facebook gives users the ability to select a unique username or 'vanity URL' for their member profile. Users With a Username. Facebook hides the ID of these users, and there are all sorts of crazy ways documented on the Internet describing ways to find their user ID, but there is only one proper method. To find the user ID of a named user, you must query the Open Graph."}, {"url": "http://www.wikihow.com/Register-a-Facebook-Username", "passage_text": "How to Register a Facebook Username. Registering a username on Facebook can help friends and other people more easily identify your profile. A Facebook username is an optionally personalized URL you can create within a few simple steps. This article will show you how. Tips. 1  You can change or modify your Facebook username at any time by repeating the steps above, depending on availability. 2  If the username you'd like is already taken or otherwise unavailable, try a variation of the name. 3  Facebook usernames are first come, first serve. 4  Usernames are not case sensitive."}]