[{"url": "http://www.healthline.com/health/lumbar-mri-scan", "passage_text": "Why a Lumbar MRI Is Done. Your doctor will use an MRI to better diagnose or treat problems with your spine. Your condition could be caused by injury-related pain, disease, infection, or other factors. Your doctor might order a lumbar MRI if you have the following symptoms: 1  back pain accompanied by fever. 2  birth defects affecting the spine. 3  injury to the lower spine. 4  persistent or severe lower back pain. 5  multiple sclerosis. 6  problems with your bladder."}, {"url": "http://www.webmd.com/brain/magnetic-resonance-imaging-mri-of-the-spine", "passage_text": "Why It Is Done. An MRI of the spine is done to: 1  Find problems of the spinal discs, such as a ruptured disc. 2  The test may also show if a disc is pressing on a nerve, causing symptoms such as sciatica. 3  Find areas of the spine where the canal is abnormally narrowed (spinal stenosis) and may need surgery. In some cases, a contrast material may be used during the MRI to show certain parts of the body more clearly. The MRI can find changes in the spine and in other tissues. It also can find problems such as infection or a tumor."}, {"url": "http://www.lni.wa.gov/ClaimsIns/Files/OMD/MedTreat/Imaging/LBchecklist.pdf", "passage_text": "Other methods rated lower: MRI without contrast (rating=6) as contrast is often necessary, myelography and postmyelography CT (rating = 5, x-ray (rating = 5)-flex/extension may be useful, NUC Tc-99m bone scan with SPECT (rating=5)-helps detect and localize pseudoarthrosis, x-ray myelography (rating = 2). IV. MRI is preferred over myelography and postmyelography CT, but may be indicated if MRI is nondiagnostic. In some circumstances (facet arthropathy, stress fracture and spondylolysis) NUC Tc-99m bone scan with SPECT may be useful."}, {"url": "http://www.radiologyinfo.org/en/info.cfm?pg=spinemr", "passage_text": "Magnetic resonance imaging (MRI) of the spine uses radio waves, a magnetic field and a computer to produce detailed pictures of the spine and surrounding tissues that are clearer and more detailed than other imaging methods. 1 MRI enables the discovery of abnormalities that might be obscured by bone with other imaging methods. 2  The contrast material used in MRI exams is less likely to produce an allergic reaction than the iodine-based contrast materials used for conventional x-rays and CT scanning."}, {"url": "http://www.healthline.com/health/lumbar-mri-scan", "passage_text": "An MRI uses magnets and radio waves to capture images inside your body without making a surgical incision. The scan allows your doctor to see the soft tissue of the body, like muscles and organs, in addition to your bones. An MRI can be performed on any part of your body. Your doctor might order a lumbar MRI if you have the following symptoms: 1  back pain accompanied by fever. 2  birth defects affecting the spine. 3  injury to the lower spine. 4  persistent or severe lower back pain. 5  multiple sclerosis. 6  problems with your bladder."}, {"url": "http://www.webmd.com/brain/magnetic-resonance-imaging-mri-of-the-spine", "passage_text": "An MRI is a test that uses a magnetic field and pulses of radio wave energy to make pictures of the spine. In many cases, an MRI gives different information than an X-ray, an ultrasound, or a CT scan. An MRI also may show problems that cannot be seen with other imaging tests. In some cases, a contrast material may be used during the MRI to show certain parts of the body more clearly. The MRI can find changes in the spine and in other tissues. It also can find problems such as infection or a tumor."}, {"url": "http://www.radiax.com/LinkClick.aspx?fileticket=_rYp-f_Wrj0=", "passage_text": "MRI contraindicated: CT with contrast lumBaR sPiNe Indication Preferred Study Trauma CT lumbar spine without contrast. Acute neurologic deficit and CT negative: MRI without contrastPain, degenerative changes, radiculopathy, sciaticaMRI lumbar spine without contrast. Prior surgery: MRI without and with contrast. MRI for occult fractureMasses X-ray first for bony lesions. Otherwise MRI without and with contrastInfection MRI without and with contrastGeneral pain, muscle injury, rheumatologic diseasesMRI without contrast FiNGeR (aRea FROm mcP jOiNT TO disTal TiP) Indication Preferred Study Trauma, surgical hardware X-ray first."}, {"url": "http://www.lni.wa.gov/ClaimsIns/Files/OMD/MedTreat/Imaging/LBchecklist.pdf", "passage_text": "CT without contrast may be useful if MRI is not available or contraindicated. MRI with and without contrast may be indicated if noncontrast MRI is nondiagnostic or indeterminate. MRI is preferred over myelography and postmyelography CT, but may be indicated if MRI is nondiagnostic. In some circumstances (facet arthropathy, stress fracture and spondylolysis) NUC Tc-99m bone scan with SPECT may be useful."}, {"url": "http://www.webmd.com/brain/magnetic-resonance-imaging-mri-of-the-spine", "passage_text": "MRI can look at the spine in the neck (cervical), upper back (thoracic), or lower back (lumbosacral). The entire spine can be seen in one series of pictures to find a tumor. More detailed pictures of one area, such as the lumbar spine, may be taken. MRI may be used to check low back problems. In some cases, a contrast material may be used during the MRI to show certain parts of the body more clearly. The MRI can find changes in the spine and in other tissues. It also can find problems such as infection or a tumor."}]