[{"url": "http://www.webmd.boots.com/skin-problems-and-treatments/guide/moles-freckles-skin-tags", "passage_text": "Moles, freckles and skin tags. Moles, freckles and skin tags are growths and marks on the skin that are not usually a cause for concern. However, if a mole is getting bigger over time, or if it is uneven, itchy or bleeding, get it looked at by a doctor."}, {"url": "http://answers.webmd.com/answers/1174894/how-can-i-tell-if-a", "passage_text": "Other skin growths that may look similar to a skin tag but are not tags include moles (dermal nevus), nerve and fiber-type moles (neurofibromas), warts and barnacles or Rice Krispies (seborrheic keratosis). Warts tend to be rougher, with a warty irregular surface whereas skin tags are usually smooth."}, {"url": "http://www.wisegeek.com/how-do-i-tell-if-a-bump-is-a-wart-or-skin-tag.htm", "passage_text": "You can tell if a bump is a wart or skin tag based on its shape, color, size, and texture. Skin tags are usually narrow and hang off the skin's normal surface on a stalk, and they are also often quite similar in color to the surrounding skin."}, {"url": "http://www.medicalnewstoday.com/articles/67317.php", "passage_text": "A skin tag, also known as an acrochordon, cutaneous papilloma, cutaneous tag, fibroepithelial polyp, fibroma molluscum, fibroma pendulum, papilloma colli, soft fibroma, and Templeton skin tag, is a small tag of skin which may have a peduncle (stalk) - they look like a small piece of soft, hanging skin."}, {"url": "http://www.medicalnewstoday.com/articles/67317.php", "passage_text": "A skin tag is also known as acrochordon, cutaneous papilloma, cutaneous tag, fibroepithelial polyp, fibroma molluscum, fibroma pendulum, papilloma colli, soft fibroma, and Templeton skin tag. On the next page we look at the options for removing and treating skin tags."}, {"url": "http://www.medicinenet.com/skin_tag/article.htm", "passage_text": "1 Skin tags tend to occur on the eyelids, neck, armpits, groin folds, and under breasts. 2  One person may have anywhere from one to over 100 skin tags. 3  Almost everyone will develop a skin tag at some point in their life. 4  Middle-aged, obese adults are most prone to skin tags. 5  Obesity is associated with"}, {"url": "https://www.amoils.com/treatment/moles/moles-vs-skin-tags.html", "passage_text": "Some skin tags have a stalk or peduncle. The most common place for skin tags is the eyelids and around the eye, but they can also appear under the arms, on the neck and on your back. If there is one skin tag, then are often many others. Skin tags can bleed because they have their own blood supply."}]