[{"url": "http://www.konsyl.com/what-is-psyllium-s/1833.htm", "passage_text": "Psyllium fiber comes from the outer coating, or husk of the psyllium plant's seeds. It is not wheat, and is therefore gluten free. The psyllium husk is a natural source of soluble fiber, similar to fiber found in grains such as oats and barley. *The amount of soluble fiber in psyllium is nearly 5X higher than that of oat bran. 100 grams of psyllium = 50 grams of soluble fiber. 100 grams of oat bran = 5 grams of soluble fiber"}, {"url": "http://medical-dictionary.thefreedictionary.com/husk", "passage_text": "husk. an outer covering or shell, as of some fruits and seeds. psyllium husk the cleaned, dried seed coat from the seeds of Plantago species; used as a bulk-forming laxative. (husk) an outer covering or shell, as of some fruits and seeds. "}, {"url": "https://en.wikipedia.org/wiki/Husk", "passage_text": "Husk (or hull) in botany is the outer shell or coating of a seed. It often refers to the leafy outer covering of an ear of maize (corn) as it grows on the plant. Literally, a husk or hull includes the protective outer covering of a seed, fruit or vegetable. It can also refer to the exuvia of bugs or small animals left behind after moulting. In cooking, hull can also refer to other waste parts of fruits and vegetables, notably the cap or sepal of a strawberry"}, {"url": "https://en.wikipedia.org/wiki/Husk", "passage_text": "The husk of a legume and some similar fruits is called a pod. Plantago-seed mucilage is often referred to as husk, or psyllium husk. Crop plants of several species have been selected that have hulless seeds, including pumpkins, oats, and barley. Literally, a husk or hull includes the protective outer covering of a seed, fruit or vegetable. It can also refer to the exuvia of bugs or small animals left behind after moulting."}, {"url": "https://en.wikipedia.org/wiki/Psyllium_seed_husks", "passage_text": "Psyllium seed husks, also known as ispaghula, isabgol, or psyllium, are portions of the seeds of the plant Plantago ovata, (genus Plantago), a native of India, Bangladesh and Pakistan. They are hygroscopic, which allows them to expand and become mucilaginous. Psyllium seed husk are indigestible and are a source of soluble dietary fiber. They are used to relieve constipation, irritable bowel syndrome, and diarrhea. They are also used as a regular dietary supplement to improve and maintain regular GI transit"}, {"url": "http://www.merriam-webster.com/dictionary/husk", "passage_text": "Full Definition of HUSK. 1. a: a usually dry or membranous outer covering (as a pod or one composed of bracts) of various seeds and fruits (as barley and corn) : hull; also: one of the constituent parts b: a carob pod. 2. a: an outer layer: shell b: an emptied shell: remnant c: a supporting framework"}, {"url": "http://www.healthline.com/health/psyllium-health-benefits", "passage_text": "Psyllium is a form of fiber made from the Plantago ovata plant, specifically from the husks of the plant’s seed. It sometimes goes by the name ispaghula. It’s most commonly known as a laxative. Psyllium provides more benefits to your body than decreasing the amount of time you spend in the bathroom. "}, {"url": "https://glutenfreegirl.com/2012/07/what-is-psyllium-husk/", "passage_text": "Well, here you are. Just a few notes for you. Psyllium is sold as whole psyllium husks and psyllium powder. In my experience, the whole husks are the most effective. However, if you only have access to psyllium powder, then use that in equal volume as the husks in the recipe. You don’t need psyllium for all gluten-free baked goods. "}, {"url": "http://umm.edu/health/medical/altmed/supplement/psyllium", "passage_text": "Psyllium is a soluble fiber used primarily as a gentle bulk-forming laxative in products such as Metamucil. It comes from a shrub-like herb called Plantago ovata that grows worldwide but is most common in India. Each plant can produce up to 15,000 tiny, gel-coated seeds, from which psyllium husk is derived. "}]