[{"url": "http://www.coverall.com/franchise-opportunities/", "passage_text": "Coverall's company mission is to promote economic growth and independence for a diverse group of business owners by providing franchise ownership opportunities.. We work with our Coverall Franchise Owners to be recognized as the worldwide leading brand in the commercial cleaning industry. 1  Ranked #79 among Dun & Bradstreet AllBusiness. 2  AllStar Franchises Top 300 Ranking. 3  Coverall ranked #2 Overall Best for Vets Franchise. 4  in 2011 by Military Times Edge Magazine."}, {"url": "http://www.franchise.co.nz/sector_pages/cleaning-franchise", "passage_text": "The cost of buying into a franchise ranges from under $5000 to over $1 million. What matters is not how much you have to spend, but how much you – and your new business – can afford. That may mean arranging finance. Cleaning Franchises in NZ. Cleaning franchises are one of the most popular ways to get into business. They require only a low investment, and you can often operate a cleaning franchise part-time while you are getting it established."}, {"url": "http://www.franchise.co.nz/franchise-opportunities/38-crestclean", "passage_text": "What's the best franchise for you? The cost of buying into a franchise ranges from under $5000 to over $1 million. What matters is not how much you have to spend, but how much you – and your new business – can afford. That may mean arranging finance. If you are looking for a simple business opportunity with low risk and a high profit margin then Crest’s cleaning franchise opportunities tick every box. Join our family of over 500 franchises happily servicing more than 3000 customers Nationwide."}, {"url": "http://www.franchise.co.nz/sector_pages/cleaning-franchise", "passage_text": "Mr Green Auckland Commercial Cleaning has new franchise opportunities in the Auckland area. We’re looking for hard working professional people and in return we offer a minimum guaranteed weekly income of $1,000 incl GST, full training, and business support. Call now for more information. www.mrgreenauckland.co.nz. Cleaning Franchises in NZ. Cleaning franchises are one of the most popular ways to get into business. They require only a low investment, and you can often operate a cleaning franchise part-time while you are getting it established."}, {"url": "http://www.trademe.co.nz/business-farming-industry/businesses-for-sale/services/cleaning", "passage_text": "Closing on Wednesday, 28 Oct Asking price $39,000 Auckland Clean Planet-Commercial Cleaning Franchise Business ready to Start now Closing on Tuesday, 3 Nov Asking price $18,000 Auckland Crewcare Commercial Cleaning Franchise Finance Available Closing on Monday, 26 Oct Asking price $32,200. Closing on Tuesday, 27 Oct Asking price $29,000 Canterbury Ashburton Dry Cleaners Closes in 3 months Price on application Bay of Plenty Frogs House Washing Franchise For Sale NZ Wide $10,000 deposit and we will finance the rest."}, {"url": "http://www.franchise.co.nz/franchise-opportunities/38-crestclean", "passage_text": "If you are looking for a simple business opportunity with low risk and a high profit margin then CrestClean’s commercial cleaning franchise opportunities tick every box. Cleaning is one of the most secure businesses to be in. Commercial cleaning in New Zealand is a $1 billion per year industry. Since 1996 CrestClean has been industry leaders; today we clean for over 3000 customers nationwide. If you are looking for a simple business opportunity with low risk and a high profit margin then Crest’s cleaning franchise opportunities tick every box. Join our family of over 500 franchises happily servicing more than 3000 customers Nationwide."}, {"url": "http://chemdryfranchise.co.za/financial/", "passage_text": "The options in this regard are set out as follows. As with most franchise systems, there is an initial fee payable which is a once-off fee of R 48,500,00 (Fourty Eight Thousand Five Hundred Rand) plus Vat for a Major Centre or R 38,500,00 (Thirty Eight Thousand Five Hundred Rand) plus Vat for Minor Centres. "}, {"url": "https://www.tidedrycleaners.com/webpages/Franchising.aspx", "passage_text": "Tide Dry Cleaners is a blend of innovation and service that's changing the dry cleaning experience for good. Now is a great time to get in on a ground-floor opportunity with a growing brand! We look forward to hearing from you soon and assisting you in navigating the franchise qualification process. "}, {"url": "http://www.trademe.co.nz/business-farming-industry/businesses-for-sale/services/cleaning", "passage_text": "Closing on Friday, 23 Oct Asking price $24,000 Wellington Jani-King Cleaning Franchise In Wellington Join the Global Leader in Commercial Cleaning Closing on Tuesday, 20 Oct Asking price $34,000. Bay of Plenty. Frogs Mobile Auto valet Franchise For Sale NZ Wide. $10,000 deposit and we will finance the rest. Closing on Tuesday, 27 Oct Asking price $29,000 Canterbury Ashburton Dry Cleaners Closes in 3 months Price on application Bay of Plenty Frogs House Washing Franchise For Sale NZ Wide"}]