[{"url": "http://www.babycenter.com/0_how-much-youll-spend-on-childcare_1199776.bc", "passage_text": "The average cost of center-based daycare in the United States is $11,666 per year ($972 a month), but prices range from $3,582 to $18,773 a year ($300 to $1,564 monthly), according to the National Association of Child Care Resource & Referral Agencies (NACCRRA). The least expensive states for preschool-age care in a childcare center, with costs ranging from less than $4,000 a year ($333 a month) to around $7,000 a year are Mississippi, Kentucky, Louisiana, Kansas, Missouri, Oklahoma, Idaho, West Virginia, South Carolina, and Alabama."}, {"url": "http://globalnews.ca/news/1662778/childcare-costs-highest-in-parts-of-b-c-ontario-least-in-quebec-study/", "passage_text": "Once again, parents in Toronto paid the highest toddler childcare rates in the country, at an average of $1,324 a month, followed by those who live in Vancouver, Burnaby, B.C., London, Ont, Brampton, Ont., and Mississauga, Ont., with fees just over $1,000 a month. When it came to infant care, it found that fees for children under 18 months were the most expensive. Torontonians paid the highest amount to put an infant into daycare at an average of $1,676 a month."}, {"url": "http://children.costhelper.com/child-day-care.html", "passage_text": "1 Assuming full-time day care for a 2 year old child on weekdays, according to Runzheimer International, the U.S. national average cost for full-time day care is $611 a month. 2  Large cities such as Boston and New York are most expensive, with average daycare costs of a little more than $1,000 a month. Child's Age: 2. This cost is for only 3 days a week-Full time is roughly $1000 a month. This is twice as much as any other day care in the area, but when we went to the other ones and went to this one, there is no comparison. SCDS regularly has 3 QUALIFIED teachers for 9-10 kids in a classroom."}, {"url": "http://www.theglobeandmail.com/life/parenting/daycare-least-affordable-in-brampton-ont-most-affordable-in-gatineau-que-study/article21518236/", "passage_text": "The study released by the Canadian Centre for Policy Alternatives found Torontonians paid the highest amount to put an infant into daycare, at an average of $1,676 a month. Those in St. John’s paid the second-highest amount at $1,394 a month. Quebeckers paid the lowest fees in the country due to province-wide government subsidies that cap daycare costs at $7.30 a day per child. In Gatineau, Laval, Montreal, Longueuil and Quebec City, child care costs parents $152 a month. "}, {"url": "http://www.theglobeandmail.com/globe-investor/personal-finance/household-finances/the-real-parent-trap-daycare-costs/article15031582/", "passage_text": "In a separate study, monthly average costs for infants range from $1,152 in Ontario to $631 in Manitoba. Quebec, the outlier, averages $152. Imagine two spouses who both have incomes in the higher five-digit range and an average tax rate of 25 per cent. "}, {"url": "http://children.costhelper.com/child-day-care.html", "passage_text": "1 Large cities such as Boston and New York are most expensive, with average daycare costs of a little more than $1,000 a month. 2  Contacting two KinderCares in the San Jose area about infant day care, we received quotes of $300-$330 a week, plus annual fees. Child's Age: 2. This cost is for only 3 days a week-Full time is roughly $1000 a month. This is twice as much as any other day care in the area, but when we went to the other ones and went to this one, there is no comparison. SCDS regularly has 3 QUALIFIED teachers for 9-10 kids in a classroom."}, {"url": "http://globalnews.ca/news/1662778/childcare-costs-highest-in-parts-of-b-c-ontario-least-in-quebec-study/", "passage_text": "The most affordable cities for infant daycare were Gatineau, Laval, Montreal, Longueuil and Quebec City, where it costs parents $152 a month. The second most affordable city for infant childcare was Winnipeg, with an average monthly cost of $651, also due to a province-wide cap on fees. Map credit: Leo Kavanagh, Global News. The study found that, in general, there were more available daycare spots as children got older. When it came to infant care, it found that fees for children under 18 months were the most expensive. Torontonians paid the highest amount to put an infant into daycare at an average of $1,676 a month."}, {"url": "http://www.godaycare.com/child-care-cost/ontario", "passage_text": "FIELD DEFINITIONS. The average child care cost in Ontario comes from the information gathered from the input of users of this site. PLEASE NOTE: although we take into account responses from multiple users to calculate the cost of child care average, we do not verify the daycare rates provided. Spot. Full time (monthly rate) or Part-time (daily rate) spot. AVG. Cost ($). Average cost of child care for that daycare type, age category and spot. Entries. Number of submissions used to calculate the average childcare cost for the row."}, {"url": "http://pets.costhelper.com/dog-daycare.html", "passage_text": "1 For a half-day -- usually five hours of playtime, where the owner chooses a convenient time slot -- dog daycare typically costs between $6 and $25. 2  For a full day -- usually from about 7 a.m. to 6 p.m. -- dog daycare typically costs between $12 and $38. "}]