[{"url": "http://www.biography.com/people/napoleon-9420291", "passage_text": "Considered one of the world's greatest military leaders, Napoleon Bonaparte was born on August 15, 1769, in Ajaccio, Corsica, France. He was the fourth, and second surviving, child of Carlo Buonaparte, a lawyer, and his wife, Letizia Ramolino. Napoleon. Napoleon-Mini Biography (TV-PG; 3:35) Napoleon Bonaparte was born in 1769 in France. He revolutionized military organization and training, sponsored Napoleonic Code, reorganized education and established the long-lived Concordat with the papacy."}, {"url": "http://europeanhistory.about.com/od/bonapartenapoleon/a/bionapoleon.htm", "passage_text": "Napoleon was born in Ajaccio, Corsica, on August 15th 1769 to Carlo Buonaparte, a lawyer and political opportunist, and his wife, Marie-Letizia. The Buonaparte 's were a wealthy family from the Corsican nobility, although when compared to the great aristocracies of France Napoleon's kin were poor and pretentious. "}, {"url": "https://en.wikipedia.org/wiki/Napoleon", "passage_text": "Napoleon was born on 15 August 1769, to Carlo Maria di Buonaparte and Maria Letizia Ramolino, in his family's ancestral home Casa Buonaparte in Ajaccio, the capital of the island of Corsica. He was their fourth child and third son. This was a year after the island was transferred to France by the Republic of Genoa. Napoleon was born in Corsica to a relatively modest family of noble Tuscan ancestry. Serving in the French army, Napoleon supported the Revolution from the outset in 1789 and tried to spread its ideals to Corsica, but was banished from the island in 1793."}, {"url": "http://www.history.com/topics/napoleon", "passage_text": "Napoleon’s Education and Early Military Career. Napoleon Bonaparte was born on August 15, 1769, in Ajaccio, on the Mediterranean island of Corsica. He was the second of eight surviving children born to Carlo Buonaparte (1746-1785), a lawyer, and Letizia Romalino Buonaparte (1750-1836). Introduction. Napoleon Bonaparte (1769-1821), also known as Napoleon I, was a French military leader and emperor who conquered much of Europe in the early 19th century."}, {"url": "http://www.pbs.org/empires/napoleon/n_myth/youth/page_1.html", "passage_text": "No doubt because I see no place for myself in this world.. Napoleon Bonaparte was born the 15th of August, 1769 on Corsica, just three months after the island had been defeated by the French. He would spend his childhood hating France, the nation he would one day rule. I was born when [Corsica] was perishing. "}, {"url": "http://www.lucidcafe.com/library/95aug/napoleon.html", "passage_text": "Related Websites. Napoleon Bonaparte was born on August 15, 1769 in Ajaccio on the Mediterranean island of Corsica, the son of Carlo and Letizia Bonaparte. Through his military exploits and his ruthless efficiency, Napoleon rose from obscurity to become Napoleon I, Empereur des Francais (Emperor of the French). "}, {"url": "http://www.notablebiographies.com/Mo-Ni/Napoleon-Bonaparte.html", "passage_text": "Early years. Napoleon Bonaparte was born Napoleon Buonaparte on August 15, 1769, in the Corsican city of Ajaccio. He was the fourth of eleven children of Carlo Buonaparte and Letizia Romolino. His father, a member of a noble Italian family, remained on good terms with the French when they took over control of Corsica. Napoleon Bonaparte Biography. Born: August 15, 1769 Ajaccio, Corsica Died: May 5, 1821 Island of St. Helena. French dictator. Napoleon Bonaparte, French emperor, was one of the greatest military leaders in history."}, {"url": "https://answers.yahoo.com/question/index?qid=20061114021417AA7IKcU", "passage_text": "Report Abuse. He was born Napoleone di Buonaparte (in Corsican, Nabolione or Nabulione) in the town of Ajaccio on Corsica, France, on 15 August 1769, only one year after the island was transferred to France by the Republic of Genoa. He later adopted the more French-sounding Napoleon Napoléon. bonaparte"}]