[{"url": "http://www.healthline.com/health/mineral-deficiency", "passage_text": "Minerals are specific kinds of nutrients that the body needs in order to function properly. A mineral deficiency occurs when the body doesn’t obtain the required amount of a mineral. To stay healthy, the body requires different amounts of each mineral. The symptoms of a mineral deficiency depend upon which nutrient the body lacks. They include: 1  constipation, bloating, or abdominal pain. 2  decreased immune system. 3  diarrhea. 4  irregular heart beat. 5  loss of appetite. 6  muscle cramping. 7  nausea and vomiting. 8  numbness or tingling in the extremities."}, {"url": "http://www.healthy-vitamin-choice.com/deficiencies.html", "passage_text": "Vitamin & Mineral Deficiencies. Marginal vitamin and mineral deficiencies are likely to be the cause for minor symptoms such as headaches, difficulty in sleeping or skin problems. Skin problems-Vitamins A and B-complex, Biotin and copper. The vitamin and mineral deficiencies may only lead to minor problems initially but they can lead to dangerous problems over time if ignored."}, {"url": "http://www.drlaurendeville.com/articles/vitamins-minerals-symptoms-deficiency/", "passage_text": "1 Dermatitis (inflamed skin): related to deficiency in Vitamins B2, B3, B6, C, E, A, zinc, and biotin. 2  Follicular Hyperkeratosis (plugged pores on the backs of the arms): Vitamin A deficiency. 3  Seborrheic Dermatitis (flaky, oily skin): could be a biotin deficiency. 4  Eczema: potentially Vitamin B2 or Vitamin E deficiency. A nutrient is a catch-all term for any substance that provides the building blocks for replenishment of an organism (so it includes vitamins, minerals, essential fatty acids, essential amino acids, and also macronutrients, such as carbs, protein, and fats)."}, {"url": "http://www.healthline.com/health/mineral-deficiency", "passage_text": "Severe calcium deficiency is usually caused by medical problems or treatments, such as medications (like diuretics), surgery to remove the stomach, or kidney failure. Symptoms of a severe deficiency include cramping of the muscles, numbness, tingling in the fingers, fatigue, poor appetite, and irregular heart rhythms. The symptoms of a mineral deficiency depend upon which nutrient the body lacks. They include: 1  constipation, bloating, or abdominal pain. 2  decreased immune system. 3  diarrhea. 4  irregular heart beat. 5  loss of appetite. 6  muscle cramping. 7  nausea and vomiting. 8  numbness or tingling in the extremities."}, {"url": "http://health.usnews.com/health-news/health-wellness/articles/2015/09/08/is-a-vitamin-or-mineral-deficiency-making-you-tired", "passage_text": "The type of fatigue matters, too, in pinpointing if or how a vitamin or mineral deficiency may contribute. While iron, for example, might cause an overall feeling of tiredness, a lack of potassium and magnesium can contribute to muscle aches and cause a person to feel sore and weak, Stoler says. All of them can be corrected by giving supplements of the missing minerals or the missing vitamins, he says, or through dietary changes. More serious problems than just the fatigue can develop from these vitamin and mineral deficiencies, Komaroff says."}, {"url": "http://www.mayoclinic.org/diseases-conditions/vitamin-deficiency-anemia/basics/causes/con-20019550", "passage_text": "Causes. Vitamin deficiency anemia occurs when your body doesn't have enough of the vitamins needed to produce adequate numbers of healthy red blood cells. Red blood cells carry oxygen from your lungs throughout your body. If your diet is lacking in certain vitamins, vitamin deficiency anemia can develop. 1 Vitamin C deficiency anemia. 2  Vitamin C deficiency can develop if you don't get enough vitamin C from the foods you eat. 3  Vitamin C deficiency is also possible if something impairs your ability to absorb vitamin C from food. 4  For instance, smoking impairs your body's ability to absorb vitamin C."}, {"url": "http://www.mayoclinic.org/diseases-conditions/vitamin-deficiency-anemia/basics/causes/con-20019550", "passage_text": "Causes of vitamin deficiency anemias, also known as megaloblastic anemias, include: Folate deficiency anemia. Folate, also known as vitamin B-9, is a nutrient found mainly in fruits and leafy green vegetables. A diet consistently lacking in these foods can lead to a deficiency. 1 Vitamin C deficiency anemia. 2  Vitamin C deficiency can develop if you don't get enough vitamin C from the foods you eat. 3  Vitamin C deficiency is also possible if something impairs your ability to absorb vitamin C from food. 4  For instance, smoking impairs your body's ability to absorb vitamin C."}, {"url": "http://www.healthy-vitamin-choice.com/deficiencies.html", "passage_text": "Home / About Vitamins / Deficiencies. Marginal vitamin and mineral deficiencies are likely to be the cause for minor symptoms such as headaches, difficulty in sleeping or skin problems. Skin problems-Vitamins A and B-complex, Biotin and copper. The vitamin and mineral deficiencies may only lead to minor problems initially but they can lead to dangerous problems over time if ignored."}]