[{"url": "http://www.fool.com/retirement/general/2015/01/17/the-average-american-gets-social-security-compare.aspx", "passage_text": "Out of that amount, more than 42.5 million Social Security recipients get retirement benefits, and with the government making about $55 billion in monthly payments, that amounts to an average of $1,290 per month for every person getting Social Security benefits on a retired worker's work record. The decision that plays the biggest role in how much you get, though, is the age when you claim Social Security. More than half of retirees take Social Security benefits right at age 62, when they first become eligible."}, {"url": "http://www.nolo.com/legal-encyclopedia/how-much-social-security-disability-ssdi-benefits-can-you-get.html", "passage_text": "How much your Social Security disability benefit will be is based on your covered earnings -- the wages that you paid Social Security taxes on -- prior to becoming disabled. (Social Security Disability Insurance (SSDI) is the federal insurance program that provides benefits to qualified workers who can no longer work. Average Indexed Monthly Earnings. First, the SSA will determine your AIME. To do this, the SSA will adjust, or index, your lifetime earnings to account for the increase in general wages that happened during the years you worked. This is done to make sure that the payments you get in the future mirror this rise."}, {"url": "http://www.mademan.com/mm/how-do-they-determine-social-security-retirement-benefit.html", "passage_text": "So, as you near or reach age 62, and begin to apply for your benefits, the Social Security Administration will use a number of factors to determine how much you will draw. The first thing they figure out is exactly how many years you earned money. This is considered a base figure. Figuring Social Security retirement benefits is a very complicated procedure, and the steps set out above only give a small part of it. The best thing you can do is make sure your earnings figures are accurate."}, {"url": "http://www.nolo.com/legal-encyclopedia/how-much-social-security-disability-ssdi-benefits-can-you-get.html", "passage_text": "To give you an idea of what you might receive, for 2015, the average SSDI benefit amount is $1,165 per month, but you can receive anywhere up to $2,663. If you're interested in how Social Security calculates your AIME and PIA, here's how. Average Indexed Monthly Earnings. First, the SSA will determine your AIME. To do this, the SSA will adjust, or index, your lifetime earnings to account for the increase in general wages that happened during the years you worked. This is done to make sure that the payments you get in the future mirror this rise."}, {"url": "http://www.kiplinger.com/article/retirement/T051-C001-S003-how-much-social-security-will-you-get-in-retiremen.html", "passage_text": "You generally need to work for 10 years to qualify for benefits (unless you’re receiving benefits through a spouse -- see How Spouses Can Maximize Social Security Benefits for more information). The maximum earnings that count toward your benefit are $118,500 in 2015. "}, {"url": "http://www.disabilitybenefitscenter.org/how-to/how-to-determine-how-much-money-you-will-receive-from-social-security-disability", "passage_text": "If you are wondering how much money you are eligible to receive through Social Security Disability benefits, the following information can help you understand the ways of determining your monthly disability benefit amount may be. Each year the Social Security Administration sends a Social Security Statement that lets you know how much money you would be entitled to if you became disabled at the time the statement was prepared. This statement is the most accurate way to estimate your monthly disability benefit amount."}, {"url": "http://www.disabilitysecrets.com/how-much-in-ssd.html", "passage_text": "Share on Google Plus. If you are eligible for Social Security Disability Insurance (SSDI, or sometimes just SSD) benefits, the amount you receive each month will be based on your average lifetime earnings before your disability began. It is not based on how severe your disability is or how much income you have. Most SSDI recipients receive between $700 and $1,700 per month (the average for 2015 is $1,165). However, if you are receiving disability payments from other sources, as discussed below, your payment may be reduced. "}, {"url": "http://www.investopedia.com/articles/retirement/08/calculate-social-security.asp", "passage_text": "If you are a typical U.S. worker nearing retirement, you have been shoveling money into the Social Security system through payroll or self-employment taxes for decades. It's possible that you and your employer together have contributed more than $200,000 into the system on your behalf over time. "}, {"url": "http://www.disabilitybenefitscenter.org/how-to/how-to-determine-how-much-money-you-will-receive-from-social-security-disability", "passage_text": "Determining Your Benefits. How much money you receive in Social Security Disability benefits each month will depend on a variety of factors including which disability benefits you are eligible for (SSI or SSDI) and how much money you earned and paid into the Social Security system. Each year the Social Security Administration sends a Social Security Statement that lets you know how much money you would be entitled to if you became disabled at the time the statement was prepared. This statement is the most accurate way to estimate your monthly disability benefit amount."}, {"url": "http://www.alllaw.com/articles/nolo/disability/collecting-payments.html", "passage_text": "Social Security applies a formula to your average lifetime earnings to calculate the amount of your monthly check. The average SSD payment is currently $1,165. The highest dollar amount you can receive from SSD monthly in 2015 is $2,663. "}]