[{"url": "http://www.homeadvisor.com/cost/garages/build-a-garage/", "passage_text": "Find out how much your project will cost. Provide a few details about your project and receive competitive quotes from local pros. The average national cost to build a garage is $23,573, with most homeowners spending between $14,621 and $32,525. When it comes to building a garage, a lot of factors come into play, which mimic other large-scale building projects."}, {"url": "http://www.doityourself.com/stry/cost-of-building-a-detached-garage-vs-attached-garage", "passage_text": "Building a detached garage can cost, on average, $1,500 more. If you add electrical and ventilation, the price jumps $13,000 and $15,000, respectively. If you do this project yourself the cost of materials is averaged out to about $4,000 regardless of whether you are building a detached garage or an attached one."}, {"url": "http://www.reliableremodeler.com/ask/how-much-does-it-cost-to-build-a-one-car-garage/", "passage_text": "Stephen G. ~ Reading, PA. Stephen, although the cost to build your one-car garage will vary depending on the details of the structure's design and the specific building materials used, you can expect to spend between $45 and $60 per sq.ft. on a new garage."}, {"url": "http://home.costhelper.com/build-garage.html", "passage_text": "1 Upgrading the quality of materials can bump the cost to $55 a square foot, or $13,200 for a minimum single-car structure, $21,000 for a two-car garage and $47,000 or more for the dream version."}, {"url": "http://www.behmdesign.com/garage-building-cost.aspx", "passage_text": "If you are in an area with higher-than-average cost of living you can use $50 to $55. If there are complications or you prefer top quality materials and components the price can go up.So, generally speaking, a 24 ft.sq., two car, basic garage will cost in the range of $17,000 to $23,000."}, {"url": "http://www.behmdesign.com/garage-building-cost.aspx", "passage_text": "by Jay Behm-A very basic way to estimate the cost of building a detached garage is to simply apply a typical average per square foot construction of $30 to $40. That is for an average cost basis for having a contractor / builder build a basic one story garage for you on your property."}, {"url": "http://www.fixr.com/costs/build-attached-garage", "passage_text": "1 According to author Stu Silverman the average cost of adding a garage begins at roughly $7,500, and for a two-car garage the average costs will go much higher. 2  This sort of structure will average at $27,040. 3  The resale value of this update would hold at $21,635, or a nearly 81% return on investment."}]