[{"url": "http://study.com/articles/Associate_Degree_in_Mathematics_Program_Information.html", "passage_text": "An associate degree program in mathematics can also be a springboard for a bachelor's degree program in actuarial science, an academic major that combines the study of business and mathematics. Essential Information. An associate degree program in mathematics is typically a 2-year transfer program for students who plan to go on to pursue a bachelor's degree in such majors as actuarial science, engineering or accounting. Typically, only a high school diploma or equivalent is required for admission."}, {"url": "http://www.brighthub.com/education/college/articles/91029.aspx", "passage_text": "And of course, there is always the option to use the associate's degree as a jumping off point for a bachelor's degree from a four-year college or university. So, the question of what to do with an Associates in Science Degree is rather moot. slide 5 of 5. The Associates in Science, depending on the major, can be used as a terminal degree, meaning the student does not plan to pursue a higher degree, or it can be used as the base for a four-year degree. This makes the Associate in Science degree the most flexible of the two-year degree options."}, {"url": "http://www.excite.com/education/science-math/associate", "passage_text": "Employment Opportunities. The graduates of an associate degree in math can pursue a number of rewarding jobs in different settings. Employment opportunities are available for individuals with a proficiency in numbers in various fields such as engineering, computer science and software development. Continuing Education. Once you complete an associate degree in math, you can continue to add to your knowledge and skills in this field by enrolling in a bachelor's degree in math with concentration areas such as statistics and computer science."}, {"url": "http://www.brighthub.com/education/college/articles/91029.aspx", "passage_text": "An Associates in Science degree is a two-year degree that focuses on math and science as its core curriculum. The A.S. degree differs from a Associates of Arts or Associates of Applied Science. The Associates in Science, depending on the major, can be used as a terminal degree, meaning the student does not plan to pursue a higher degree, or it can be used as the base for a four-year degree. This makes the Associate in Science degree the most flexible of the two-year degree options."}, {"url": "http://www.excite.com/education/science-math/associate", "passage_text": "A: An associate degree in math and science will help you understand the field at a primary level. You can prepare for entry level and assistant level jobs with this qualification. However, it is recommended that you should further pursue high education at bachelor level to prepare for more high paying careers. Continuing Education. Once you complete an associate degree in math, you can continue to add to your knowledge and skills in this field by enrolling in a bachelor's degree in math with concentration areas such as statistics and computer science."}, {"url": "http://work.chron.com/careers-associate-arts-degree-mathematics-16652.html", "passage_text": "A two-year associate degree in math equips you with problem-solving skills that employers find attractive in many fields. The key to finding employment is to emphasize the way the degree enhances your other skills, interests and experience. Good math skills are crucial to accounting and finance clerks, and your degree makes it more likely you'll be hired before people with just a high school diploma. You can be an accounts payable or receivables clerk or work as an assistant to a certified public accountant."}, {"url": "http://www.excite.com/education/science-math/associate", "passage_text": "A: The Associate in Science and Math degree program has dedicated course on Introduction to Accounting. This course usually is worth 2 credits in total. It is designed to provide students with strong understanding of the basic concepts of making financial statements. Continuing Education. Once you complete an associate degree in math, you can continue to add to your knowledge and skills in this field by enrolling in a bachelor's degree in math with concentration areas such as statistics and computer science."}, {"url": "https://answers.yahoo.com/question/index?qid=20100210090325AAgeZKk", "passage_text": "My school-and all schools in the area, actually-do not offer such of a degree. The closest is an associates in math education... which is more like an associates in childhood education, except with an emphasis in mathematics and a deemphasis in education. It doesnt qualify you to do any math field, nor does it qualify you to teach any field. "}]