[{"url": "http://memory-beta.wikia.com/wiki/Lieutenant_Commander", "passage_text": "In the Romulan Star Navy, the rank of subcommander (Romulan language erei'riov) is roughly equivalent to a Starfleet lieutenant commander, although Romulan subcommanders are often first officers and fill other positions with standings approximate of Starfleet commanders. (TOS novel: The Romulan Way; TOS episode : ."}, {"url": "http://military.wikia.com/wiki/Lieutenant_Commander", "passage_text": "194,816 pages on this wiki. Lieutenant Commander (also hyphenated Lieutenant-Commander; pronounced L'tenant in the Royal Navy, Irish and Commonwealth navies) is a commissioned officer rank in many navies."}, {"url": "http://military.wikia.com/wiki/Commander", "passage_text": "Since the British Royal Air Force 's middle-ranking officers' designations are modelled after the Royal Navy 's, the term wing commander is used as a rank and is equivalent to a lieutenant colonel in the army or commander in the navy."}, {"url": "http://military.wikia.com/wiki/Lieutenant_Commander", "passage_text": "A Lieutenant-Commander's sleeve/shoulder insignia. The insignia worn by a Royal Navy Lieutenant-Commander (Lt Cdr) is two medium gold braid stripes with one thin gold stripe running in between, placed upon a navy blue/black background. The top stripe has the ubiquitous loop used in all RN officer rank insignia."}, {"url": "http://military.wikia.com/wiki/Commander", "passage_text": "A commander in the Royal Navy is above the rank of lieutenant-commander, below the rank of captain, and is equivalent in rank to a lieutenant colonel in the army. A commander may command a frigate, destroyer, submarine, aviation squadron or shore installation, or may serve on a staff."}, {"url": "http://work.chron.com/rank-commander-army-18544.html", "passage_text": "Another way to look at the term is that the rank of commander in the Navy or Coast Guard is the equivalent of a lieutenant colonel in the Army. These field-grade Army officers command a battalion, a fighting or support force numbering between 300 and 1,000 men and women."}, {"url": "https://en.wikipedia.org/wiki/Lieutenant_commander_%28United_States%29", "passage_text": "Lieutenant commander (LCDR) is a mid-ranking officer rank in the United States Navy, the United States Coast Guard, the United States Public Health Service Commissioned Corps, and the National Oceanic and Atmospheric Administration Commissioned Officer Corps, with the pay grade of O-4 and NATO rank code OF-3."}, {"url": "http://military.wikia.com/wiki/Lieutenant_Commander", "passage_text": "The rank is superior to a Lieutenant and subordinate to a Commander. The corresponding rank in most armies (armed services) and air forces is Major, and in the Royal Air Force and other Commonwealth air forces is Squadron Leader."}]