[{"url": "http://brainly.com/question/321019", "passage_text": "The meaning of the word 'visible' is 'can be seen with eyes', and that's the labelgiven to the part of the electromagnetic spectrum that can be seen with eyes.It doesn't include infrared or ultraviolet radiation, because those cannot be seen with eyes. Only the 'visible' wavelengths can. 1  Comments (0). 2  Report. "}, {"url": "https://en.wikipedia.org/wiki/Visible_spectrum", "passage_text": "White light is dispersed by a prism into the colors of the visible spectrum. The visible spectrum is the portion of the electromagnetic spectrum that is visible to the human eye. Electromagnetic radiation in this range of wavelengths is called visible light or simply light. A typical human eye will respond to wavelengths from about 390 to 700 nm. In terms of frequency, this corresponds to a band in the vicinity of 430–770 THz."}, {"url": "http://www.energeticsynthesis.com/index.php/library/science-of-ascension/2211-visible-light-spectrum", "passage_text": "Details. Category: Science of Ascension. The visible spectrum is the portion of the electromagnetic spectrum that is visible to (can be detected by) the human eye. Electromagnetic radiation in this range of wavelengths is called visible light or simply light"}, {"url": "http://www.answers.com/Q/What_portion_of_the_electromagnetic_spectrum_can_human_eyes_detect", "passage_text": "It is our eyes that are capable of detecting a portion of the electromagnetic (EM) spectrum called visible light, or the optical spectrum. We describe the different frequencie … s by color, with red being the lowest of the frequencies we can see. "}, {"url": "http://www.greenfacts.org/glossary/def/electromagnetic-spectrum.htm", "passage_text": "Visible light – also known as the visible spectrum – is the portion of the electromagnetic spectrum that human eyes can detect. "}, {"url": "http://missionscience.nasa.gov/ems/01_intro.html", "passage_text": "You depend on this energy every hour of every day. Without it, the world you know could not exist. Electromagnetic energy travels in waves and spans a broad spectrum from very long radio waves to very short gamma rays. The human eye can only detect only a small portion of this spectrum called visible light. A radio detects a different portion of the spectrum, and an x-ray machine uses yet another portion. "}, {"url": "http://cmb.physics.wisc.edu/pub/tutorial/spectrum.html", "passage_text": "The electromagnetic spectrum is a map of all the types of light that we can identify. It separates all the types of light by wavelength because that directly relates to how energetic the wave is. More energetic waves have shorter wavelengths while less energetic waves have longer wavelengths. Not all light is in the visible spectrum, which is the light you can see. There are many kinds of electromagnetic waves that you can't see. Just look at the spectrum below. When we talk about a light detector, we are referring to any instrument that detects electromagnetic radiation."}, {"url": "http://www.answers.com/Q/Which_portion_of_the_electromagnetic_spectrum_can_human_eyes_detect", "passage_text": "Share to: It is our eyes that are capable of detecting a portion of the electromagnetic (EM) spectrum called visible light, or the optical spectrum. We describe the different frequencie … s by color, with red being the lowest of the frequencies we can see."}]