[{"url": "https://simple.wikipedia.org/wiki/Insulator_(electricity)", "passage_text": "An electrical insulator is a material that will not easily conduct an electric current. Typical materials used to make insulators include rubber, plastic and glass. In transformers and electric motors, varnish is used. Insulating gases such as Sulfur hexafluoride are used in some switches. "}, {"url": "http://www.innovateus.net/science/what-insulator", "passage_text": "An insulator is a material or method that restricts the transfer of either heat or electricity. Insulators are used to protect us from the dangerous effects of electricity flowing through conductors. Insulators are materials that have just the opposite effect on the flow of electrons. They do not let electrons flow very easily from one atom to another"}, {"url": "https://en.wikipedia.org/wiki/Insulator_(electricity)", "passage_text": "An insulating material used in bulk to wrap electrical cables or other equipment is called insulation. The term insulator is also used more specifically to refer to insulating supports used to attach electric power distribution or transmission lines to utility poles and transmission towers. A perfect insulator does not exist, because even insulators contain small numbers of mobile charges (charge carriers) which can carry current. In addition, all insulators become electrically conductive when a sufficiently large voltage is applied that the electric field tears electrons away from the atoms."}, {"url": "http://hyperphysics.phy-astr.gsu.edu/hbase/electric/conins.html", "passage_text": "Conductors and Insulators. In a conductor, electric current can flow freely, in an insulator it cannot. Metals such as copper typify conductors, while most non-metallic solids are said to be good insulators, having extremely high resistance to the flow of charge through them. "}, {"url": "https://en.wikipedia.org/wiki/Insulator", "passage_text": "1 Insulator (electricity) , a substance that resists electricity. 2  Insulator (genetics) , an element in the genetic code. 3  Thermal insulation, a material used to resist the flow of heat. 4  Building insulation, a material used in building construction to prevent heat loss. Insulator may refer to: 1  Insulator (electricity) , a substance that resists electricity. 2  Insulator (genetics) , an element in the genetic code. 3  Thermal insulation, a material used to resist the flow of heat."}, {"url": "http://www.thefreedictionary.com/insulator", "passage_text": "insulator. n. 1. (General Physics) any material or device that insulates, esp a material with a very low electrical conductivity or thermal conductivity or something made of such a material. (ˈɪn səˌleɪ tər, ˈɪns yə-). n. "}, {"url": "http://www.merriam-webster.com/dictionary/insulator", "passage_text": ": one that insulates: as a: a material that is a poor conductor (as of electricity or heat) — compare semiconductor b: a device made of an electrical insulating material and used for separating or supporting conductors. See insulator defined for English-language learners. See insulator defined for kids. ADVERTISEMENT. Definition of INSULATOR for Kids. : a material (as rubber or glass) that is a poor conductor of electricity, heat, or sound."}, {"url": "http://www.wisegeek.com/what-is-an-insulator.htm", "passage_text": "An insulator is a material or method that restricts the transfer of either heat or electricity. In the case of heat, thermal insulators work by reducing the rate heat can travel through a space. Generally, they use specific materials and will keep heat-carrying matter from moving. The first sense of an insulator is the thermal sense. A thermal insulator helps keep an object at the same temperature, whether hot or cold. It typically works by addressing either conduction or convection, which are two modes of heat transfer."}]