[{"url": "http://www.ehow.com/about_5064058_signs-symptoms-blocked-fallopian-tubes.html", "passage_text": "Abdominal pain can also be caused by unrelated conditions, and it is not always (or even often) associated with blocked fallopian tubes. Still, the condition could be considered as a possibility for women who experience constant abdominal pain along with infertility or other symptoms of a blocked tube. Since pain from the condition is rare, and not all women notice or experience infertility, it is not uncommon for women with blocked tubes to go several years without knowing about their conditions. It is possible that millions of women actually have blocked fallopian tubes that are undiagnosed."}, {"url": "http://www.answers.com/Q/What_are_symptoms_when_fallopian_tubes_are_blocked", "passage_text": "The irregular menstrual cycles is one of the sign of the blocked fallopian tubes. However,some of the causes of blocked fallopian tubes might lead to hints of a problem. For example, endometriosis and pelvic inflammatory disease may cause painful menstruation and painful sexual intercourse. Pain is not the main symptom of blocked fallopian tube.  The fallopian tubes carry mature eggs from the  ovaries to the uterus in healthy women. For a woman, at least one  … of these tubes must remain open in order to get pregnant."}, {"url": "http://planbwellness.com/signs-symptoms-blocked-fallopian-tubes/", "passage_text": "Women who are not trying to conceive may be completely unaware of their blocked fallopian tubes, since infertility is often the only symptom. Since a blockage in the fallopian tubes can prevent sperm and eggs from traveling freely, they may be unable to join and create a zygote. Abdominal pain can also be caused by unrelated conditions, and it is not always (or even often) associated with blocked fallopian tubes. Still, the condition could be considered as a possibility for women who experience constant abdominal pain along with infertility or other symptoms of a blocked tube."}, {"url": "http://www.ehow.com/about_5064058_signs-symptoms-blocked-fallopian-tubes.html", "passage_text": "Fallopian tubes can be blocked because of scarring caused by injury or infection, but the underlying cause of the condition is sometimes unknown. Although common, blocked fallopian tubes are rarely a cause for serious concern. Since pain from the condition is rare, and not all women notice or experience infertility, it is not uncommon for women with blocked tubes to go several years without knowing about their conditions. It is possible that millions of women actually have blocked fallopian tubes that are undiagnosed."}, {"url": "http://www.webmd.com/women/endometriosis/endometriosis-and-fallopian-tube-problems?page=2", "passage_text": "Sometimes, the tubes may be blocked or they may be scarred as a result of disease or infection. When an egg is released from one of the ovaries, it travels through one of the fallopian tubes, which are narrow ducts that connect the ovaries to the uterus. To determine whether your fallopian tubes are blocked, your doctor may suggest a laparoscopy or a hysterosalpingogram (HSG). In an HSG test, liquid dye is inserted by catheter through the vagina (cervix) into the uterus. Then, X-rays are taken to see if there is a blockage or if the dye flows freely into the abdomen."}, {"url": "http://www.buzzle.com/articles/blocked-fallopian-tubes-symptoms.html", "passage_text": "Fallopian tubes are a part of the female reproductive system which join the ovaries to the uterus. They are 10-12 centimeters in length, and are present on the either sides of the uterus. Their main function is to transport the egg from the ovary to the uterus. Hydrosalpinx is caused when watery fluid or pus gets filled up in the fallopian tubes resulting in blockage. Sometimes, blockage may also occur if thw tubes get filled with blood. Signs and Symptoms of Blocked Fallopian Tubes. Unfortunately, the symptoms are not very prominent and hence, are not easily identified. Some women do not experience any symptoms at all"}, {"url": "http://global.fuyanpills.com/DT/Tubal_Conditions/2013/0326/427.html", "passage_text": "On the other hand, abdominal pain is a symptom of hydrosalpinx. In addition, infertility is a sign that can be caused by blocked fallopian tube. As there is a blockage in the fallopian tubes, the egg cannot reach the uterus and hence, cannot be fertilized. Therefore, pregnancy in not possible in case of women if both the fallopian tubes are blocked. Fallopian tubes are a part of the female reproductive system which join the ovaries to the uterus. Their main function is to transport the egg from the ovary to the uterus. Sometimes, due to specific reasons the fallopian tubes get obstructed which prevents the egg from traveling in"}, {"url": "http://www.ehow.com/about_5064058_signs-symptoms-blocked-fallopian-tubes.html", "passage_text": "Surprisingly, many women with blocked fallopian tubes never experience any noticeable symptoms. Since pain from the condition is rare, and not all women notice or experience infertility, it is not uncommon for women with blocked tubes to go several years without knowing about their conditions. It is possible that millions of women actually have blocked fallopian tubes that are undiagnosed."}, {"url": "http://www.conceiveeasy.com/get-pregnant/when-blocked-fallopian-tubes-are-the-cause-of-infertility/", "passage_text": "One of the major causes of infertility is fallopian tube obstruction. The fallopian tubes are the uterine tubes where fertilization occurs. When they are blocked, the sperm and the egg cannot meet, thus, the egg cannot be fertilized. In fact, blocking the fallopian tubes is sometimes used as a contraceptive method."}]