[{"url": "http://webspace.ship.edu/cgboer/theneuron.html", "passage_text": "A typical neuron has all the parts that any cell would have, and a few specialized structures that set it apart. The main portion of the cell is called the soma or cell body. It contains the nucleus, which in turn contains the genetic material in the form of chromosomes. Neurons have a large number of extensions called dendrites. They often look likes branches or spikes extending out from the cell body. A clump of neuron cell bodies, for example, is called a ganglion (plural: ganglia) or a nucleus (plural: nuclei). A fiber made up of many axons is called a nerve. In the brain and spinal cord, areas that are mostly axons are called white matter, and it is possible to differentiate pathways or tracts of these axons."}, {"url": "http://users.rcn.com/jkimball.ma.ultranet/BiologyPages/N/Neurons.html", "passage_text": "Link to CNS. The cell bodies of the sensory neurons leading to the spinal cord are located in clusters, the dorsal root ganglia (DRG), next to the spinal cord. Their axon extends in both directions: a peripheral axon to receptors at the periphery and a central axon passing into the spinal cord. "}, {"url": "https://en.wikipedia.org/wiki/Accumbens_nucleus", "passage_text": "Major inputs to the nucleus accumbens include the prefrontal cortex, basolateral amygdala, and dopaminergic neurons located in the ventral tegmental area (VTA), which connect via the mesolimbic pathway. Thus the nucleus accumbens is often described as one part of a cortico-striato-thalamo-cortical loop. Location: The nucleus accumbens core is part of the ventral striatum, located within the basal ganglia. Cell types: The core of the NAcc is made up mainly of medium spiny neurons containing mainly D1-type or D2-type dopamine receptors."}, {"url": "https://quizlet.com/3464224/neuron-part-flash-cards/", "passage_text": "nucleus. located in the cell body; an oval shaped membrane-bond structure found in the body of the neuron; contains the nucleolus and chromosomes which are necessary for the coded production of proteins within the cell."}, {"url": "http://www.answers.com/Q/Where_is_the_nucleus_of_a_neuron_located", "passage_text": "The nucleus of a neuron is the organelle found inside the soma (cell body) that contains the genetic material (DNA). 3 people found this useful. Edit. Share to: 1  Biology 101: The Nucleus and Its Responsibilities The nucleus of a cell is like the heart and brain of a cell rolled in to one. 1 The Core of Life: The Cell Nucleus The atomic nucleus at the heart of the atom, with its easily visualized relationship to protons and neutrons, is known to many. 2  The nucleus of a cell, however, as studied in 3  …. The Five Major Parts of the Brain At its most basic, the brain controls the body."}, {"url": "https://en.wikipedia.org/wiki/Neuron", "passage_text": "A neuron (/ˈnjʊərɒn/ NYEWR-on or /ˈnʊərɒn/ NEWR-on; also known as a neurone or nerve cell) is an electrically excitable cell that processes and transmits information through electrical and chemical signals. These signals between neurons occur via synapses, specialized connections with other cells. At the majority of synapses, signals are sent from the axon of one neuron to a dendrite of another. There are, however, many exceptions to these rules: neurons that lack dendrites, neurons that have no axon, synapses that connect an axon to another axon or a dendrite to another dendrite, etc."}, {"url": "http://www.answers.com/Q/Where_is_the_nucleus_of_a_neuron_located", "passage_text": "The nucleus of the neuron is located in the soma (cell body). 1 The Core of Life: The Cell Nucleus The atomic nucleus at the heart of the atom, with its easily visualized relationship to protons and neutrons, is known to many. 2  The nucleus of a cell, however, as studied in 3  …. The Five Major Parts of the Brain At its most basic, the brain controls the body."}, {"url": "http://wps.aw.com/bc_campbell_essentials_4_oa/144/36968/9463974.cw/content/index.html", "passage_text": "Neurons store neurotransmitter molecules in vesicles located within _____. the cell body. myelin. the synaptic cleft. dendrites. synaptic terminals. The _____ is the region of the eye where photoreceptors are most highly concentrated. lens. fovea. optic nerve. "}, {"url": "https://en.wikipedia.org/wiki/Neuron", "passage_text": "A typical neuron consists of a cell body (soma), dendrites, and an axon. The term neurite is used to describe either a dendrite or an axon, particularly in its undifferentiated stage. At the majority of synapses, signals are sent from the axon of one neuron to a dendrite of another. There are, however, many exceptions to these rules: neurons that lack dendrites, neurons that have no axon, synapses that connect an axon to another axon or a dendrite to another dendrite, etc."}, {"url": "http://medical-dictionary.thefreedictionary.com/nucleus", "passage_text": "Meynert's nucleus a group of neurons in the basal forebrain that has wide projections to the neocortex and is rich in acetylcholine and choline acetyltransferase; it undergoes degeneration in paralysis agitans and Alzheimer's disease. oculomotor nucleus This is the nucleus of the oculomotor nerve (third cranial nerve). It is a complex mass of cells located in the midbrain at the level of the superior colliculus and beneath the cerebral aqueduct (of Sylvius) which connects the third and fourth ventricles. It is divided into several subnuclei."}]