[{"url": "https://en.wikipedia.org/wiki/Emancipation_Proclamation", "passage_text": "The Emancipation Proclamation was a presidential proclamation and executive order issued by President Abraham Lincoln on January 1, 1863. In a single stroke, it changed the federal legal status of more than 3 million enslaved persons in the designated areas of the South from slave to free.. The Emancipation Proclamation also allowed for the enrollment of freed slaves into the United States military. During the war nearly 200,000 blacks, most of them ex-slaves, joined the Union Army. Their contributions gave the North additional manpower that was significant in winning the war."}, {"url": "https://en.wikipedia.org/wiki/Emancipation_Proclamation", "passage_text": "The Proclamation was issued in two parts. The first part, issued on September 22, 1862, was a preliminary announcement outlining the intent of the second part, which officially went into effect 100 days later on January 1, 1863, during the second year of the Civil War. The Emancipation Proclamation also allowed for the enrollment of freed slaves into the United States military. During the war nearly 200,000 blacks, most of them ex-slaves, joined the Union Army. Their contributions gave the North additional manpower that was significant in winning the war."}, {"url": "http://www.let.rug.nl/usa/presidents/abraham-lincoln/the-emancipation-proclamation-1863.php", "passage_text": "Although the Emancipation Proclamation did not end slavery in America--this was achieved by the passage of the 13TH Amendment to the Constitution on Dec. 18, 1865--it did make that accomplishment a basic war goal and a virtual certainty. DOUGLAS T. MILLER. But the proclamation did show Americans-- and the world--that the civil war was now being fought to end slavery. Lincoln had been reluctant to come to this position. A believer in white supremacy, he initially viewed the war only in terms of preserving the Union."}, {"url": "http://www.archives.gov/exhibits/featured_documents/emancipation_proclamation/", "passage_text": "Although the Emancipation Proclamation did not end slavery in the nation, it captured the hearts and imagination of millions of Americans and fundamentally transformed the character of the war. After January 1, 1863, every advance of federal troops expanded the domain of freedom. The original of the Emancipation Proclamation of January 1, 1863, is in the National Archives in Washington, DC. With the text covering five pages the document was originally tied with narrow red and blue ribbons, which were attached to the signature page by a wafered impression of the seal of the United States."}, {"url": "http://www.archives.gov/exhibits/featured_documents/emancipation_proclamation/", "passage_text": "The Emancipation Proclamation. President Abraham Lincoln issued the Emancipation Proclamation on January 1, 1863, as the nation approached its third year of bloody civil war. The proclamation declared that all persons held as slaves within the rebellious states are, and henceforward shall be free.. The original of the Emancipation Proclamation of January 1, 1863, is in the National Archives in Washington, DC. With the text covering five pages the document was originally tied with narrow red and blue ribbons, which were attached to the signature page by a wafered impression of the seal of the United States."}, {"url": "http://www.answers.com/Q/What_did_the_Emancipation_Proclamation_do", "passage_text": "FREED SOUTHERN SLAVES. Abraham Lincoln issued the proclamation (first announcing it on Sept. 22, 1862, and putting it into effect on January 1, 1863), declaring slaves free in all areas then in rebellion against the Union. The Proclamation also authorized the Union armies to recruit these freed slaves to fight. A large number joined the Union Army and made a major contribution to the war effort during the final two years of the war. A claim that it freed no one (see below) is inaccurate."}, {"url": "https://en.wikipedia.org/wiki/Emancipation_Proclamation", "passage_text": "On September 22, 1862, Lincoln had issued a preliminary proclamation warning that he would order the emancipation of all slaves in any state that did not end its rebellion against the Union by January 1, 1863. The Emancipation Proclamation also allowed for the enrollment of freed slaves into the United States military. During the war nearly 200,000 blacks, most of them ex-slaves, joined the Union Army. Their contributions gave the North additional manpower that was significant in winning the war."}, {"url": "http://www.civilwar.org/education/history/primarysources/emancipation.html", "passage_text": "The following document is the Emancipation Proclamation, made by President Lincoln on September 22, 1862. The Emancipation Proclamation granted freedom to the slaves in the Confederate States if the States did not return to the Union by January 1, 1863. In addition, under this proclamation, freedom would only come to the slaves if the Union won the war"}, {"url": "http://www.answers.com/Q/What_did_the_Emancipation_Proclamation_do", "passage_text": "Critics also ignore the fact that Lincoln & Congress were, even before the Emancipation Proclamation working on Constitutional methods to end slavery throughout the nation. Lincoln, already in 1861, had begun to urge border Union slave states to vote an end to slavery themselves (which some eventually did). The Proclamation also authorized the Union armies to recruit these freed slaves to fight. A large number joined the Union Army and made a major contribution to the war effort during the final two years of the war. A claim that it freed no one (see below) is inaccurate."}, {"url": "http://www.historynet.com/emancipation-proclamation", "passage_text": "Read the transcript of the Emancipation Proclamation. See emancipation proclamation text. Emancipation Proclamation summary: The Emancipation Proclamation was issued by President Abraham Lincoln on January 1, 1863, as the country entered the third year of the Civil War. "}]