[{"url": "http://www.huffingtonpost.com/2014/03/27/medical-marijuana-crime-study_n_5044397.html", "passage_text": "Legalizing medical marijuana causes no increase in crime, according to a new study. In fact, legalized medical pot may reduce some violent crime, including homicide, University of Texas at Dallas researchers wrote in a journal article published this week."}, {"url": "http://www.msnbc.com/all/does-marijuana-lower-the-crime-rate", "passage_text": "“The central finding gleaned from the present study was that MML (medical marijuana legalization) is not predictive of higher crime rates and may be related to reductions in rates of homicide and assault."}, {"url": "http://www.webmd.com/pain-management/news/20140326/medical-marijuanas-legalization-doesnt-raise-crime-rates-study", "passage_text": "WEDNESDAY, March 26, 2014 (HealthDay News) -- Legalization of medical marijuana does not lead to increased crime, and may even be tied to lower rates of offenses such as assault and murder, a new study suggests."}, {"url": "http://www.ksl.com/?nid=148&sid=29478930", "passage_text": "In Denver, where marijuana was recently legalized, data shows that violent and property crimes have decreased over the three months of legalization, according to data from the Denver Police Department 2014 crime statistics and maps website."}, {"url": "http://www.universityherald.com/articles/8495/20140331/medical-marijuana-legalization-may-reduce-crime.htm", "passage_text": "Researchers from the University of Texas, Dallas contend that legalizing medical marijuana may reduce some violent crime, including homicide. They suggest that crime rates, particularly certain violent crimes, actually decrease in areas with legal medical marijuana."}, {"url": "http://www.debate.org/opinions/would-legalizing-marijuana-reduce-crime", "passage_text": "The definition of crime changes... Certainly legalization would reduce crime. The very fact that millions of Americans in prisons, or being charged would no longer fall into the category of 'criminals' would immediately change the statistics."}, {"url": "http://www.webmd.com/pain-management/news/20140326/medical-marijuanas-legalization-doesnt-raise-crime-rates-study", "passage_text": "The main finding is that we found no increase in crime rates resulting from medical marijuana legalization, Morris said. In fact, we found some evidence of decreasing rates of some types of violent crime -- namely homicide and assault.."}, {"url": "http://www.ksl.com/?nid=148&sid=29478930", "passage_text": "SALT LAKE CITY Legalizing marijuana may decrease the amount of crime, according to new studies recently released. In a study published in PLOS ONE, researchers focused on the crime rates of Part I crimes, which consists of homicide, rape, robbery, burglary, larceny and auto theft, in relation to marijuana use. Researchers found that marijuana did not increase violent crimes. We believe that medical marijuana legalization poses no threat of increased violent crime, Robert Morris, the study's lead author, said to the Huffington Post."}]