[{"url": "http://scienceline.ucsb.edu/getkey.php?key=1960", "passage_text": "Answer 1: Volcanos are most commonly found at subduction zone boundaries. This is where the thinner oceanic plates get pulled under the thicker continental plates. As the plates go deeper, they melt and form pockets of magma which can cause mountains to be built and as the hot magma rises, it erupts out of volcanos."}, {"url": "http://www.ga.gov.au/scientific-topics/hazards/volcano/basics/where", "passage_text": "Map showing Earth's plate boundaries. Active volcanoes generally occur close to the major tectonic plate boundaries. Many are located along the Earth's plate boundaries. Active volcanoes are rare in Australia because there are no plate boundaries on this continent. However, there are two active volcanoes located 4000 kilometres south west of Perth on the Australian territories, Heard Island and the nearby McDonald Islands. "}, {"url": "http://scienceline.ucsb.edu/getkey.php?key=1960", "passage_text": "Volcanoes occur along both divergent sea-floor-spreading plate boundaries and convergent subduction boundaries, but the volcanoes are very different in character between them (the divergent plate boundaries having fissure flow eruptions and the convergent plate boundaries making strata volcanoes). Volcanos are most commonly found at subduction zone boundaries. This is where the thinner oceanic plates get pulled under the thicker continental plates. As the plates go deeper, they melt and form pockets of magma which can cause mountains to be built and as the hot magma rises, it erupts out of volcanos."}, {"url": "http://www.answers.com/Q/Why_do_volcanoes_and_earthquakes_occur_on_the_plate_boundaries", "passage_text": "Most earthquakes occur on plate boundaries for a variety of reasons. When plates in the earth's crust move, they scrape or bump each other on the edges and boundaries. Therefo … re, the movements of the plates are more likely to be felt along the edges, where all of the activity takes place. Volcanoes usually occur along the boundaries of tectonic plates but they can also occur far from any boundary, over a 'hot spot'. The Hawaiian Islands are a string of volcanoe … s that formed as the Pacific Plate slowly moved over a hot spot. The hot spot is still active and the plate is still moving"}, {"url": "http://www.visionlearning.com/en/library/Earth-Science/6/Plates-Plate-Boundaries-and-Driving-Forces/66", "passage_text": "Also similar to earthquakes, different kinds of volcanoes occur along different types of plate boundaries. Most of the volcanic eruptions that make the news, such as the 1980 Mount St. Helens eruption, take place near subduction zones. This type of volcano is represented by green triangles in Figure 2. Plate boundaries. These observations about the distribution of earthquakes and volcanoes helped geologists define the processes that occur at spreading ridges and subduction zones. In addition, they helped scientists recognize that there are other"}, {"url": "https://en.wikipedia.org/wiki/Plate_boundaries", "passage_text": "Where the plates meet, their relative motion determines the type of boundary: convergent, divergent, or transform. Earthquakes, volcanic activity, mountain-building, and oceanic trench formation occur along these plate boundaries. The lateral relative movement of the plates typically ranges from zero to 100 mm annually. "}, {"url": "http://scienceline.ucsb.edu/getkey.php?key=1960", "passage_text": "Volcanism occurs regularly at two of the three types of plate Boundaries. The most volcanism occurs at diverging plate boundary where plates separate. Volcanoes also form at converging plate boundaries where one plate dives beneath the other at subduction zones. Volcanos are most commonly found at subduction zone boundaries. This is where the thinner oceanic plates get pulled under the thicker continental plates. As the plates go deeper, they melt and form pockets of magma which can cause mountains to be built and as the hot magma rises, it erupts out of volcanos."}, {"url": "http://www.bbc.co.uk/science/earth/surface_and_interior/plate_boundary", "passage_text": "Plates move away from one another at divergent boundaries. This happens at mid-ocean ridges. Plates move towards one another at convergent boundaries; one plate is forced below another in a process called subduction. Earthquakes and composite volcanoes are common at this type of boundary. Plates move past on another at transform boundaries. The most famous example of this type of boundary is the San Andreas Fault in California. Image: Cutaway artwork showing different types of plate boundary and hotspot"}, {"url": "http://www.answers.com/Q/Why_do_volcanoes_and_earthquakes_occur_on_the_plate_boundaries", "passage_text": "Volcanoes are created in subduction zones because of the melting of oceanic crust as it enters the mantle. Earthquakes occur in plate boundaries because of the release of built up stress between the rocks constituting each plate, as they snap into a new position relative to each other, or fracture. Volcanoes usually occur along the boundaries of tectonic plates but they can also occur far from any boundary, over a 'hot spot'. The Hawaiian Islands are a string of volcanoe … s that formed as the Pacific Plate slowly moved over a hot spot. The hot spot is still active and the plate is still moving"}]