[{"url": "https://jr.brainpop.com/science/land/landforms/", "passage_text": "What is a landform? A landform is a natural formation or area of land, such as a continent. In this movie, you'll explore flat areas of land, such as plains and prairies. You’ll learn about raised areas of land, such as hills, mountains, and plateaus, and lower areas of land, such as canyons and valleys. You’ll also explore landforms near water, such as bays, coasts, islands, and peninsulas."}, {"url": "http://www.thefreedictionary.com/landform", "passage_text": "Any recognizable, naturally formed feature on the Earth's surface. Landforms have a characteristic shape and can include such large features as plains, plateaus, mountains, and valleys, as well as smaller features such as hills, eskers, and canyons. A distinctive natural configuration of the land surface. (lănd′form′). Fôrm any, recognizable naturally formed feature on The'earth s. Surface landforms have a characteristic shape and can include such large features as, plains, plateaus, mountains and, valleys as well as smaller features such as, hills, eskers and. canyons"}, {"url": "http://www.kidsgeo.com/geology-for-kids/0031-what-are-landforms.php", "passage_text": "A landform is any natural formation of rock and dirt, found on Earth. A landform can be as large as a mountain range, or as small as a hill. It can be as large as a continent, or as small as a pond. Geologists study how landforms are created, and how they interact with one another. .menuItem { font-family: verdana; font-size: 10pt; color: #990000; text-decoration: none; }."}, {"url": "https://en.wikipedia.org/wiki/Landform", "passage_text": "Landform elements are parts of a high-order landforms that can be further identified and systematically given a cohesive definition such as hill-tops, shoulders, saddles, foreslopes and backslopes. Some generic landform elements including: pits, peaks, channels, ridges, passes, pools and plains. Terrain (or relief) is the third or vertical dimension of land surface. Topography is the study of terrain, although the word is often used as a synonym for relief itself."}, {"url": "http://www.answers.com/Q/What_is_a_landform", "passage_text": "In other words, the Earth's surface is made up of different types of landforms. Landforms are any geological feature, such as a mountain or valley. any land feature that froms the earth's surface, mountains, valleys, plains. There are many kinds of landforms. They can be locations, such as islands; terrain, such as mountains or valleys; or those having specific qualities caused by climate, such as deserts, swamps, and glaciers."}, {"url": "http://schooltutoring.com/help/earth-sciences-types-of-landforms/", "passage_text": "These natural physical features on the earth’s surface called as landforms. Landforms are defined as the natural physical features found on the surface of the earth created as a result of various forces of nature such as wind, water, ice, and movement of tectonic plates. Some landforms are created in a matter of few hours, while others take millions of years to appear."}, {"url": "http://www.edu.pe.ca/southernkings/landforms.htm", "passage_text": "Landforms are natural features of the landscape, natural physical features of the earth's surface, for example, valleys, plateaus, mountains, plains, hills, loess, or glaciers. 1  Valleys. "}, {"url": "https://en.wikipedia.org/wiki/Landform", "passage_text": "A landform is a natural feature of the Earth's surface. Landforms together make up a given terrain, and their arrangement on the landscape or the study of same is known as topography. Some generic landform elements including: pits, peaks, channels, ridges, passes, pools and plains. Terrain (or relief) is the third or vertical dimension of land surface. Topography is the study of terrain, although the word is often used as a synonym for relief itself."}, {"url": "https://en.wikipedia.org/wiki/Landform", "passage_text": "Typical landforms include hills, mountains, plateaus, canyons, valleys, as well as shoreline features such as bays, peninsulas, and seas, including submerged features such as mid-ocean ridges, volcanoes, and the great ocean basins. Some generic landform elements including: pits, peaks, channels, ridges, passes, pools and plains. Terrain (or relief) is the third or vertical dimension of land surface. Topography is the study of terrain, although the word is often used as a synonym for relief itself."}]