[{"url": "http://www.getbrandwise.com/branding-blog/bid/18617/What-are-marketing-demographics", "passage_text": "Here is a definition of Demographics. (from Wikipedia): Demographics or demographic data refers to selected population characteristics as used in government, marketing or opinion research, or the demographic profiles used in such research."}, {"url": "http://www.investopedia.com/terms/d/demographics.asp", "passage_text": "DEFINITION of 'Demographics'. Studies of a population based on factors such as age, race, sex, economic status, level of education, income level and employment, among others. Demographics is the study and categorization of people based on factors such as income level, education, gender, race, age, and employment."}, {"url": "https://en.wikipedia.org/wiki/Demographic_profile", "passage_text": "A demographic or demographic profile is a term used in marketing and broadcasting, to describe a demographic grouping or a market segment. A good way to figure out the intended demographic of a television show, TV channel, or magazine is to study the ads that accompany it. For example, in the United States the television program The Price Is Right most frequently airs from 11 a.m. to Noon."}, {"url": "http://www.wisegeek.com/what-is-a-demographic-profile.htm", "passage_text": "These 10 facts about space will blow your mind. A demographic profile is a business tool that identifies several characteristics when companies attempt to define a market segment. Common characteristics in the profile include age, sex, income, household size and education. A demographic profile is by no means an accurate or end-all piece of information from a marketing standpoint. Companies must be sure to ask the right questions first in order to identify the specifics that matter most to the business."}, {"url": "http://www.wisegeek.com/what-is-a-demographic-profile.htm", "passage_text": "A demographic profile might include the types of social activities enjoyed by a group. A demographic profile may be used to determine that a particular age group is more likely to purchase a certain make or model of car. View slideshow of images above. Watch the Did-You-Know slideshow. A demographic profile is by no means an accurate or end-all piece of information from a marketing standpoint. Companies must be sure to ask the right questions first in order to identify the specifics that matter most to the business."}, {"url": "https://answers.yahoo.com/question/index?qid=20080620193046AAULB8z", "passage_text": "3. Advertising toys & sugary cereals during children's cartoon shows. +++++++++++++++++++++++++++++++++++ A demographic or demographic profile is a term used in marketing and broadcasting, to describe a demographic grouping or a market segment. "}, {"url": "https://en.wikipedia.org/wiki/Demographic_profile", "passage_text": "A demographic profile can be used to determine when and where advertising should be placed so as to achieve maximum results. A good way to figure out the intended demographic of a television show, TV channel, or magazine is to study the ads that accompany it. For example, in the United States the television program The Price Is Right most frequently airs from 11 a.m. to Noon."}, {"url": "http://www.thefreedictionary.com/demographic", "passage_text": "Noun. 1. demographic-a statistic characterizing human populations (or segments of human populations broken down by age or sex or income etc.). statistics-a branch of applied mathematics concerned with the collection and interpretation of quantitative data and the use of probability theory to estimate population parameters"}, {"url": "http://www.wisegeek.com/what-is-a-demographic-profile.htm", "passage_text": "A demographic profile is a business tool that identifies several characteristics when companies attempt to define a market segment. It is important to understand the target audience and their buying habits before developing a retail marketing strategy. A demographic profile is by no means an accurate or end-all piece of information from a marketing standpoint. Companies must be sure to ask the right questions first in order to identify the specifics that matter most to the business."}]