[{"url": "http://health.utah.gov/upp/faqs.htm", "passage_text": "As of July 1, 2008 approval for UPP is also considered a qualifying event for applicants to enroll in their employer-sponsored health insurance plan at any time. Applicants do not have to wait for the annual open-enrollment to enroll, if approved for UPP. For more information call 1-888-222-2542 or click here. • Pay your monthly premiums. • If you qualify for UPP, you will need to provide proof you have enrolled and show how much you pay in premiums. • Then, UPP will reimburse you up to $150 per adult and up to $120 per child every month to share in the cost of your monthly premiums. A check will be mailed to you each month."}, {"url": "http://health.utah.gov/upp/faqs.htm", "passage_text": "UPP (Utah's Premium Partnership for Health Insurance) helps make health insurance more affordable for working individuals and families who do not currently have health insurance. UPP (pronounced ‘up’) helps you pay your monthly health insurance premiums through your employer’s health insurance plan. • Pay your monthly premiums. • If you qualify for UPP, you will need to provide proof you have enrolled and show how much you pay in premiums. • Then, UPP will reimburse you up to $150 per adult and up to $120 per child every month to share in the cost of your monthly premiums. A check will be mailed to you each month."}, {"url": "http://health.utah.gov/upp/whatisupp.htm", "passage_text": "UPP (pronounced “up”) is a program of the Utah Department of Health. UPP helps make health insurance more affordable for working individuals and families. UPP (Utah's Premium Partnership for Health Insurance) helps make health insurance more affordable for individuals and families who do not currently have health insurance. UPP (pronounced ‘up’) helps you pay your monthly health insurance premiums through your employer’s health insurance plan."}, {"url": "http://medical-dictionary.thefreedictionary.com/Upp", "passage_text": "urethral pressure profile (UPP) a record of the resistance of the urethra to fluid flow, measured as variations in urethral pressure. A liquid or gas is pumped into the bladder with a catheter in place and the catheter is slowly withdrawn while measurements are taken of the pressure at various points in the urethra. "}, {"url": "http://www.abbreviations.com/UPP", "passage_text": "Upp. Upp was a British rock-jazz fusion band, active in the 1970s. The group was originally going to be called 3 UPP, and consisted of Stephen Amazing, Andy Clark and Jim Copley. David Bunce joined on guitar for the second album"}, {"url": "http://www.cnet.com/news/what-is-upp-or-why-do-tvs-cost-the-same-at-every-store/", "passage_text": "UPP, or Unilateral Pricing Policy, is a way for TV manufacturers to force retailers to keep manufacturer-specified pricing. As in no crazy discounts to move stock, no doorbuster deals, and no (let's be honest here) price competition. The price is the price is the price. Though the beauty of this deal is that with UPP, TV companies aren't allowed to pressure specific pricing, only imply a threat if the pricing isn't followed. An explicit threat would be price fixing, an implicit threat is UPP. Hazzah! Except, it's not quite that simple."}, {"url": "http://www.upp.com/careers", "passage_text": "At Upp Technology, you’re more than just a resume. Résumé’we ve been matching great people with great companies since. 1985 attain THE it consulting job of your dreams With Upp’technology s careful selection process to find the perfect complement for your skills and. aspirations Attain the IT consulting job of your dreams with Upp Technology’s careful selection process to find the perfect complement for your skills and aspirations. We provide the challenges to keep you motivated and the incentives that allow you to focus on what's important."}]