[{"url": "https://en.wikipedia.org/wiki/Greek_people", "passage_text": "Until the early 20th century, Greeks were distributed between the Greek peninsula, the western coast of Asia Minor, the Black Sea coast, Cappadocia in central Anatolia, Egypt, the Balkans, Cyprus, and Constantinople. Most Greeks are Christians, belonging to the Greek Orthodox Church. During the first centuries after Jesus Christ, the New Testament was originally written in Koine Greek, which remains the liturgical language of the Greek Orthodox Church, and most of the early Christians and Church Fathers were Greek-speaking."}, {"url": "http://historylink101.com/2/greece2/trojan_war.htm", "passage_text": "For the first nine years of the war, the Greeks attacked the surrounding cities and outlying areas to cut off the food supply from Troy. The city of Troy itself had huge walls which were built with the help of the gods. It was not until the tenth year that the Greeks attacked the city of Troy itself. The war was not going well for the Greeks at this point. The Greeks learned from a captive Trojan prophet that four things had to happen if they were to conquer Troy. 1) Achilles’ son Neoptolemus, who the Greeks had abandon on an island several years earlier, had to join the fight."}, {"url": "http://www.arwhead.com/Greeks/", "passage_text": "The ancient Greeks (mainly the Athenians) were a unique people. They believed that individuals should be free as long as they acted within the laws of Greece. This allowed them the opportunity to excel in any direction they chose. Individuality, as the Greeks viewed it, was the basis of their society. This form of government was used at a meeting place which the Greeks called the Assembly. Here the citizens of Athens met monthly and discussed the affairs of state. There were no decisions made by government without first asking"}, {"url": "https://en.wikipedia.org/wiki/Greek_people", "passage_text": "The Greeks or Hellenes (Greek: έλληνες [ˈelines]) are an ethnic group native to Greece, Cyprus, Albania, Anatolia, Southern Italy, and other regions. They also form a significant diaspora, with Greek communities established around the world. Most Greeks are Christians, belonging to the Greek Orthodox Church. During the first centuries after Jesus Christ, the New Testament was originally written in Koine Greek, which remains the liturgical language of the Greek Orthodox Church, and most of the early Christians and Church Fathers were Greek-speaking."}, {"url": "https://en.wikipedia.org/wiki/Greek_people", "passage_text": "The history of the Greek people is closely associated with the history of Greece, Cyprus, Constantinople, Asia Minor and the Black Sea. During the Ottoman rule of Greece, a number of Greek enclaves around the Mediterranean were cut off from the core, notably in Southern Italy, the Caucasus, Syria and Egypt. Most Greeks are Christians, belonging to the Greek Orthodox Church. During the first centuries after Jesus Christ, the New Testament was originally written in Koine Greek, which remains the liturgical language of the Greek Orthodox Church, and most of the early Christians and Church Fathers were Greek-speaking."}, {"url": "https://simple.wikipedia.org/wiki/Ancient_Greece", "passage_text": "It was the civilization of Greece from the Archaic, period of the 8th/6th centuries BC to 146 BC. The period ended with the Roman conquest of Greece in the Battle of Corinth. For most of this time the Greeks did not have a single government or ruler. There were a number of city states, each with its own constitution. "}, {"url": "https://en.wikipedia.org/wiki/Religion_in_ancient_Greece", "passage_text": "Ancient Greek theology was polytheistic, based on the assumption that there were many gods and goddesses. There was a hierarchy of deities, with Zeus, the king of the gods, having a level of control over all the others, although he was not omnipotent. Some deities had dominion over certain aspects of nature. The religious practices of the Greeks extended beyond mainland Greece, to the islands and coasts of Ionia in Asia Minor, to Magna Graecia (Sicily and southern Italy), and to scattered Greek colonies in the Western Mediterranean, such as Massalia (Marseille)."}, {"url": "https://en.wikipedia.org/wiki/Trojan_War", "passage_text": "In Greek mythology, the Trojan War was waged against the city of Troy by the Achaeans (Greeks) after Paris of Troy took Helen from her husband Menelaus, king of Sparta. According to Greek mythology, Zeus had become king of the gods by overthrowing his father Cronus; Cronus in turn had overthrown his father Uranus. Zeus was not faithful to his wife and sister Hera, and had many relationships from which many children were born."}, {"url": "http://www.bbc.co.uk/schools/primaryhistory/ancient_greeks/greek_world/", "passage_text": "After the Minoans came the Myceneans. They were soldiers from mainland Greece, and were the Greeks who fought Troy in the 1200s BC. After the Mycenean age ended, about 1100 BC, Greece entered a Dark Age. This lasted until the 800s BC when the Greeks set off by sea to explore and set up colonies. The Olympic Games begun in 776 BC. The Greeks called themselves Hellenes, and their land was Hellas. The name Greece comes from the Romans. The name 'Hellenes' came from a legendary hero named Hellen (a man, and not the same as Helen of Troy). Some Greek philosophers did not mind shocking people or being laughed at."}]