[{"url": "http://www.livestrong.com/article/441686-how-many-carbs-should-i-eat-to-prevent-ketosis/", "passage_text": "But low-carb diets can vary greatly in their strictness. Some advise just cutting out refined and starchy carbs, while others limit carb intake to an average of 20 grams per day. While the former is fairly safe, the latter is controversial. One of these is ketosis -- a state in which levels of compounds called ketones increase in your body. Ketosis can have undesirable side effects, so you should know how many carbs you need to eat to prevent it from occurring. Talk to your doctor before beginning a low-carb diet."}, {"url": "http://www.marksdailyapple.com/forum/thread6755.html", "passage_text": "On Mark's carbohydrate curve, it states that 0g-50g would put you in ketosis/fat burning but it really depends on the individual. 20g sounds good to me-- I usually do about 10g-30g myself per day. I am consuming sufficient protein (i.e. 150 g/day at a weight of 165), maintaining the workouts and rest regime yet finding that after the initial loss of some fat I have certainly plateued. This leaves me rather confused as to how low must I get my carb intake to get the last bit of tenacious fat off."}, {"url": "http://www.answers.com/Q/How_many_grams_of_carbohydrate_per_day_are_recommended_to_prevent_ketosis_in_healthy_individuals", "passage_text": "What is minimum number of grams of carbohydrate you need per day to avoid ketosis? I knew someone that lost 130lbs on a Protein-Only diet in 1994; in eight months he had a little soda each day, (approx. 15g carbs). It varies per individual but a healthy individual can prevent ketosis with 100 to 120 grams of carbohydrates."}, {"url": "http://ketodietapp.com/Blog/post/2013/11/21/How-Many-Carbs-per-Day-on-Low-Carb-Ketogenic-Diet", "passage_text": "While in ketosis, your body effectively uses fat for fuel. In general, the daily intake of net carbs required to enter ketosis could vary from 20 to 100 grams per day (and very rarely over 100 grams per day). Most people, who have experienced ketosis, claim to have reached that state at about 20-50 grams of net carbs per day. I'd suggest you start at 20-30 grams and see how you can adjust it for your needs"}, {"url": "http://kickincarbclutter.blogspot.com/2015/01/how-to-get-into-ketosis-in-less-than-3.html", "passage_text": "Ordinarily, on a typical keto diet, it takes 3 to 5 days to enter into the state of ketosis, depending on how many carbohydrates per day you were eating before you started restricting carbs. But there are much faster methods. Most low-carb diet plans come with strict rules and guidelines. A keto diet plan is no different. Ketogenic diets suggest you limit your carbohydrate intake to no more than 20-net carbs per day. However, if you eat less than 20-net carbs and bump up your activity level, you'll get into ketosis faster."}, {"url": "http://www.ruled.me/guide-keto-diet/", "passage_text": "For a normal person that is starting a ketogenic diet, eating 25-40g of net carbs a day, the total adaptation process will take about 2 weeks. My advice is to cut your carbs to fewer than 15g to ensure that you are well on your way into ketosis within 1 week. "}, {"url": "http://ketodietapp.com/Blog/post/2013/11/21/How-Many-Carbs-per-Day-on-Low-Carb-Ketogenic-Diet", "passage_text": "Start from a low level of net carbs to ensure you quickly enter ketosis (~ 20 grams of net carbs per day). When you detect ketosis after about 2-3 days, start adding net carbs (about 5 grams each week) until you detect a very low-level or no ketones (using Ketostix or blood ketone meter). This is usually the most reliable and quickest way to discover your net carbs limit. In general, the daily intake of net carbs required to enter ketosis could vary from 20 to 100 grams per day (and very rarely over 100 grams per day). Most people, who have experienced ketosis, claim to have reached that state at about 20-50 grams of net carbs per day."}, {"url": "http://ketodietapp.com/Blog/post/2014/05/20/All-You-Need-to-Know-About-Protein-on-a-Low-Carb-Ketogenic-Diet", "passage_text": "My carbs are normally less than 40 grams per day and sometimes as low as 20 grams. I am 6'3, 235 lbs and headed for 215-220 lbs (I'm losing about 2 1/2 lbs per week with little effort). According to my scales, I'm at 18.5% body fat. I walk/run almost daily doing a lot of hills - 100+ floors per day. "}, {"url": "http://www.marksdailyapple.com/forum/thread6755.html", "passage_text": "How many carbs for ketosis. As the title suggests, I would like to know how many carbs one would heave to eat to get into ketosis. I've been getting around 20, almost exclusively from eggs, bacon, almonds, and a bit of lemon on my chicken. I am consuming sufficient protein (i.e. 150 g/day at a weight of 165), maintaining the workouts and rest regime yet finding that after the initial loss of some fat I have certainly plateued. This leaves me rather confused as to how low must I get my carb intake to get the last bit of tenacious fat off."}, {"url": "http://www.marksdailyapple.com/forum/thread6755.html", "passage_text": "FWIW. 20g of net carbs is the magic Atkins number that he uses to get people into ketosis during the Induction phase. Given his experience with patients, I'd think 20g of carbs would certainly get you there. I am consuming sufficient protein (i.e. 150 g/day at a weight of 165), maintaining the workouts and rest regime yet finding that after the initial loss of some fat I have certainly plateued. This leaves me rather confused as to how low must I get my carb intake to get the last bit of tenacious fat off."}]