[{"url": "http://www.rainforest-alliance.org/kids/species-profiles/kapok-tree", "passage_text": "Kapok Tree (Ceiba pentandra). A giant in the rainforests, the kapok tree can reach up to 200 feet in height, sometimes growing as much as 13 feet per year. Due to its extreme height, the kapok, or ceiba tree, towers over the other rainforest vegetation. The trunk can expand to nine or 10 feet in diameter. In the nooks and grooves of this huge plant live a diverse number of species including frogs, birds and bromeliads."}, {"url": "http://www.answers.com/Q/What_is_the_kapok_trees_lifespan", "passage_text": "Why is the kapok tree important? this tree can grow to 150 feet or more, with a diameter of 9 feet, the wood is pinkish and many animals and birds can live in its canopy."}, {"url": "http://www.blueplanetbiomes.org/kapok.htm", "passage_text": "Many plants and animals grow and live in the branches of the kapok tree. Birds nest in it, and mammals use the huge branches as highways. Frogs breed in the pools of water that collect in the bromeliads."}, {"url": "http://www.rainforest-alliance.org/kids/species-profiles/kapok-tree", "passage_text": "Botany: A giant in the rainforests, the kapok tree can reach up to 200 feet in height, sometimes growing as much as 13 feet per year. Due to its extreme height, the kapok, or ceiba tree, towers over the other rainforest vegetation. The trunk can expand to nine or 10 feet in diameter. In the nooks and grooves of this huge plant live a diverse number of species including frogs, birds and bromeliads."}, {"url": "http://www.zoo.org/page.aspx?pid=1954", "passage_text": "Kapok trees are also grown on plantations in southeast Asia. Ceiba pentandra can reach heights of 200 feet (60 m), may grow 13 feet (4 m) a year and can live as long as 200 years. They have wide buttresses at their base and large, flat crowns on top."}, {"url": "http://www.answers.com/Q/How_Does_A_Kapok_Tree_Survive", "passage_text": "Why is the kapok tree important? this tree can grow to 150 feet or more, with a diameter of 9 feet, the wood is pinkish and many animals and birds can live in its canopy."}, {"url": "http://www.blueplanetbiomes.org/kapok.htm", "passage_text": "The Kapok tree is an emergent tree of the tropical rainforests, and is often described as majestic. It can grow to a height of 150 feet or more, towering over other trees in the rainforest."}]