[{"url": "https://uk.answers.yahoo.com/question/index?qid=20100113034324AAfqW0q", "passage_text": "Report Abuse. Car Alloy wheels are made from Aluminium Alloy, which is a blend of principally Aluminium and Silicon with various other trace elements added to give the correct mixture for strength without being too brittle."}, {"url": "http://www.explainthatstuff.com/alloys.html", "passage_text": "You might see the word alloy described as a mixture of metals, but that's a little bit misleading because some alloys contain only one metal and it's mixed in with other substances that are nonmetals (cast iron, for example, is an alloy made of just one metal, iron, mixed with one nonmetal, carbon)."}, {"url": "http://www.techeblog.com/index.php/tech-gadget/how-its-made-alloy-wheels", "passage_text": "If you've always wondered how alloy wheels were made, then check out this interesting tour of the Ray's Engineering factory in Japan. Video after the jump. Aluminium alloys or aluminum alloys are alloys of aluminium, often with copper, zinc, manganese, silicon, or magnesium."}, {"url": "http://www.ebay.com/gds/What-Are-the-Benefits-of-Alloy-Wheels-/10000000177404818/g.html", "passage_text": "While steel wheels are acceptable for use on everyday roads, some drivers prefer the better alternative. Alloy wheels refer to any wheels made from a combination of aluminum and small traces of other metals. Aluminum combined with these other metals creates a supremely strong and lightweight wheel. Alloy wheels are also favored for their aesthetic appeal, and they tend to increase the overall value of the car."}, {"url": "http://www.answers.com/Q/What_is_alloy_made_of", "passage_text": "For example, automobile wheels made of analuminium alloy are commonly referred to as simply alloy wheels, although in point of fact steels and most other metals in practical use are also alloysThe use of alloys by humans started with the use of meteoric iron, a naturally occurring alloy ofnickel and iron."}, {"url": "http://www.techeblog.com/index.php/tech-gadget/how-its-made-alloy-wheels", "passage_text": "How it's Made: Alloy Wheels. If you've always wondered how alloy wheels were made, then check out this interesting tour of the Ray's Engineering factory in Japan. Video after the jump. Aluminium alloys or aluminum alloys are alloys of aluminium, often with copper, zinc, manganese, silicon, or magnesium."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20100113034324AAfqW0q", "passage_text": "Hello car alloys are made of cast ALUMINIUM a lower quality ALUMINIUM than say your double glazed windows are made from. Any acid, salt, or irritants-including wheel cleaning solution-tend to corrode the alloy."}]