[{"url": "https://labtestsonline.org/understanding/analytes/tsh/tab/test", "passage_text": "Other thyroid tests that may be ordered include a free T3 test and thyroid antibodies (if autoimmune-related thyroid disease is suspected). Sometimes TSH, free T4 and free T3 are ordered together as a thyroid panel. TSH testing is used to: 1  Diagnose a thyroid disorder in a person with symptoms. 2  Screen newborns for an underactive thyroid."}, {"url": "http://www.stopthethyroidmadness.com/lab-values/", "passage_text": "FREE T3: T3 is the active thyroid hormone. Free in front of the T3 means you are measuring what is available and unbound. Those on an optimal amount of desiccated thyroid, with no lingering hypothyroid symptoms and in the presence of healthy adrenals, tend to have a free T3 towards the upper part of the range. 1 Dosing solely by the TSH and the total T4, or using the outdated Thyroid Panel. 2  Prescribing anti-depressants in lieu of evaluating and treating the free T3. 3  Telling thyroid patients that desiccated natural thyroid is unreliable, inconsistent, dangerous or outdated."}, {"url": "http://www.stat.unc.edu/visitors/temp/Health/Thyroid/htthyroid-test.htm", "passage_text": "1 Find out your thyroid test results from your doctor's office. 2  If you can, get a hard copy printout for your own review and home medical files. 3  If normal or reference ranges are not indicated on the lab results, ask your doctor's office to tell you what these ranges are. If you want to have a better idea of what your thyroid tests mean, here is some information that can help. Difficulty Level: Easy Time Required: 5 minutes. Here's How: 1  Find out your thyroid test results from your doctor's office."}, {"url": "http://www.everydayhealth.com/hs/healthy-living-with-hypothyroidism/understanding-test-results/", "passage_text": "If your TSH is higher than 4.0 mU/L on repeat tests, you probably have hypothyroidism. Your doctor may also order a T4 test. Most of the T4 in your blood attaches to a protein, and when it does, it can’t get into your cells. Only T4 that is unattached or “free” can get into your cells to go to work. A blood test can measure how much free T4 is available. Hypothyroidism Tests: A Measure of Treatment Success. Hypothyroidism is treated with daily medication. Taking synthetic thyroid hormone medication can bring your T4 and TSH levels back to their normal ranges"}, {"url": "http://www.webmd.com/women/thyroid-hormone-tests", "passage_text": "Thyroid hormone tests are done to: 1  Find out what is causing an abnormal thyroid-stimulating hormone (TSH) test. 2  Check how well treatment of thyroid disease is working. 3  Screen newborns to find out if the thyroid gland function is normal. Why It Is Done. Thyroid hormone tests are done to: 1  Find out what is causing an abnormal thyroid-stimulating hormone (TSH) test. 2  For more information, see the topic Thyroid-Stimulating Hormone (TSH) . 3  This is the most common reason for thyroid hormone tests. 4  Check how well treatment of thyroid disease is working"}, {"url": "http://www.webmd.com/women/thyroid-stimulating-hormone-tsh", "passage_text": "Thyroid-Stimulating Hormone (TSH). Guide. A thyroid-stimulating hormone (TSH) blood test is used to check for thyroid gland problems. TSH is produced when the hypothalamus releases a substance called thyrotropin-releasing hormone (TRH). TRH then triggers the pituitary gland to release TSH. TSH causes the thyroid gland to make two hormones: triiodothyronine (T3) and thyroxine (T4). T3 and T4 help control your body's metabolism. Triiodothyronine (T3) and thyroxine (T4) are needed for normal growth of the brain, especially during the first 3 years of life. How To Prepare. Tell your doctor if you have had any tests in which you were given radioactive materials or had X-rays that used iodine dye within the last 4 to 6 weeks. Your test results may not be correct if you have had iodine contrast material before having a thyroid-stimulating hormone (TSH) test. 1 | 2 | 3 | 4."}, {"url": "http://www.stopthethyroidmadness.com/lab-values/", "passage_text": "Second, if you have Hashimoto’s, you lab results can swing between hypo and hyper, & your lab test may be representing the middle of the swing. The best way to use the TSH lab test is in diagnosing a pituitary problem, not a thyroid problem. A very low TSH with a low free T3 gives away a pituitary issue. VITAMIN D test: (25-hydroxy vitamin D) measures the level of the hormone vitamin “D”, which plays a role in your immune system and other important actions. 1 Dosing solely by the TSH and the total T4, or using the outdated Thyroid Panel. 2  Prescribing anti-depressants in lieu of evaluating and treating the free T3. 3  Telling thyroid patients that desiccated natural thyroid is unreliable, inconsistent, dangerous or outdated."}, {"url": "http://www.stat.unc.edu/visitors/temp/Health/Thyroid/htthyroid-test.htm", "passage_text": "1 If the TSH level is above normal, your doctor may determine that you are hypothyroid (underactive thyroid.). 2  If your doctor ran a test called Total T4 or Total Thyroxine, normal range is approximately 4.5 to 12.5. 3  If you had a low reading, and a high TSH, your doctor might consider that indicative of hypothyroidism. If you want to have a better idea of what your thyroid tests mean, here is some information that can help. Difficulty Level: Easy Time Required: 5 minutes. Here's How: 1  Find out your thyroid test results from your doctor's office. 2  If you can, get a hard copy printout for your own review and home medical files. 3  If normal or reference ranges are not indicated on the lab results, ask your doctor's office to tell you what these ranges are"}]