[{"url": "http://allrecipes.com/recipe/238987/paleo-cauliflower-rice/", "passage_text": "1 Heat olive oil in a skillet over medium heat; add cauliflower 'rice', salt, and pepper. 2  Cover skillet and cook until heated through, 3 to 5 minutes. 3  Remove lid and fluff 'rice' with a fork. 1 Place cauliflower chunks in a food processor and pulse until broken down into rice-size pieces. 2  Heat olive oil in a skillet over medium heat; add cauliflower 'rice', salt, and pepper. 3  Cover skillet and cook until heated through, 3 to 5 minutes. 4"}, {"url": "http://www.onegoodthingbyjillee.com/2014/03/3-ways-to-make-cauliflower-rice.html", "passage_text": "How To Make Cauliflower Rice. Start by cutting the stem off the cauliflower and then chop the crown into smaller pieces. Next, you can either use a blender/food processor or a cheese grater to “rice” the cauliflower. Put your cauliflower in a microwave safe dish and cover. Microwave for 2-3 minutes. This ended up being my least favorite method. The microwave steams the cauliflower and it ends up tasting exactly like tiny little pieces of steamed"}, {"url": "http://detoxinista.com/2012/01/the-secret-to-perfect-cauliflower-pizza-crust/", "passage_text": "1 To make the cauliflower rice, pulse batches of raw cauliflower florets in a food processor, until a rice-like texture is achieved. 2  Fill a large pot with about an inch of water, and bring it to a boil. 3  Add the rice and cover; let it cook for about 4-5 minutes. 4  Drain into a fine-mesh strainer. 1 Preheat your oven to 400F. 2  To make the cauliflower rice, pulse batches of raw cauliflower florets in a food processor, until a rice-like texture is achieved. 3  Fill a large pot with about an inch of water, and bring it to a boil. 4  Add the rice and cover; let it cook for about 4-5 minutes. 5"}, {"url": "http://ohmyveggies.com/how-to-make-cauliflower-rice/", "passage_text": "Season with salt and pepper to taste. Depending on the plans you have for your cauliflower rice, you can add some chopped onion or minced garlic to the oil before adding the cauliflower, or stir in chopped herbs or fresh lime juice after the rice is done cooking. Cauliflower isn’t just for rice! You can make cauliflower into a pizza crust, use it instead of chicken in Buffalo wings, and even make it into a creamy alfredo sauce. We’ve got a round-up of 20 secret-ingredient cauliflower recipes with lots of additional ideas."}, {"url": "http://www.thekitchn.com/how-to-make-cauliflower-rice-couscous-cooking-lessons-from-the-kitchn-203344", "passage_text": "Cooking cauliflower couscous: Cooking makes the cauliflower more tender and rice-like. Warm a tablespoon of olive oil or butter in a large skillet over medium heat. Stir in the couscous and sprinkle with a little salt. Cover the skillet and cook for 5 to 8 minutes, until the couscous is as tender as you like. Raw cauliflower couscous can be used like cooked grains in salads like tabbouleh or any of these hearty lunch salads. Quickly cooked in a little butter or olive oil on the stove top, the couscous becomes softer and more tender. It can be served just like rice as a side dish for curry, stir-fry, or beans."}, {"url": "http://minimalistbaker.com/how-to-make-cauliflower-rice/", "passage_text": "1 Once you have your cauliflower rice, it's easy to cook! 2  Simply saute sauté in a large skillet over medium heat in 1 tbsp. 3  Oil cover with a lid so the cauliflower steams and becomes more.  tender Simply saute sauté in a large skillet over medium heat in 1 tbsp. Oil use a lid to cover so the cauliflower steams and becomes more. Tender cook for a total of-5 8, minutes stirring, occasionally then season as (desired such as with soy sauce or salt and). pepper"}, {"url": "http://www.bbcgoodfood.com/howto/guide/whats-best-way-cook-cauliflower-rice", "passage_text": "Once the cauliflower is prepared, you can store it until you’re ready to use. If you’re following a calorie-controlled diet, divide the cauliflower rice into 100g portions, which contain just 25 calories each, and stash in the fridge for up to three days, or in the freezer for two months. The ‘rice’ can be microwaved from frozen, or defrosted before stir-frying or microwaving. We tested three different ways to cook cauliflower rice, to discover our favourite. Make sure you season with salt after cooking, if you season before the rice can become waterlogged and soggy. Microwaving. By far the easiest way to cook your cauliflower rice, and as you don’t need to add any fat, the healthiest too. Microwave fresh cauliflower rice in a heatproof bowl, covered with cling film, for three minutes on High"}, {"url": "http://bigredkitchen.com/2012/05/the-fastest-way-to-rice-cauliflower-video/", "passage_text": "I eat cauliflower often, especially cauliflower “rice”. It makes a tasty paleo side dish in lieu of rice. I have tried many ways to “rice” cauliflower, from chopping it by hand, placing it in the food processor, or grating it, with all of them proving to be a pain in the bum. Also my video showing you how to make Stir-fried Cauliflower Rice. Then for some Tex-Mex, try my Cilantro-Lime Cauliflower Rice. My blender is a vitamix-prep (Himself likes smoothies), but you can use a regular blender working in smaller batches which is still faster than a hand grater and loss of fingernails-ouch."}]