[{"url": "http://www.rigzone.com/jobs/Oil-Rig-RZ?oc=t", "passage_text": "SUBSCRIBE. An Oil Rig, known also as an oil platform or offshore platform, is a large structure capable of drilling wells and extracting natural oil and gas. Most Oil Rigs have the capability to store both the natural gas and oil plus the workforce that extracts it, with both being shipped to and from the rig by air and sea. Oil Rigs can be fixed to the ocean floor, floating or consist of an artificial island."}, {"url": "http://www.theweedblog.com/how-to-properly-clean-your-dab-rig/", "passage_text": "So now you know how to PROPERLY clean your oil rig. And by the way, My rig has a honey comb in the lower of the three chambers and I have no problems getting this rig brand new clean looking in under 30 minutes with clean reclaim that I can use with less repercussion on my lungs. no one likes you. "}, {"url": "http://www.youtube.com/watch?v=7rOXEF4iFvA", "passage_text": "Cottonmouth Smoke Shop shows you how to use an Oil Rig! The oil bubblers featured in this video are from Sasquatch Glass and Hard Times Glass. [1120 Davie Street in Vancouver BC, Canada]. 1  People & Blogs. "}, {"url": "http://www.rigzone.com/jobs/Oil-Rig-RZ?oc=t", "passage_text": "Oil Rig Jobs. An Oil Rig, known also as an oil platform or offshore platform, is a large structure capable of drilling wells and extracting natural oil and gas. Most Oil Rigs have the capability to store both the natural gas and oil plus the workforce that extracts it, with both being shipped to and from the rig by air and sea. Oil Rigs can be fixed to the ocean floor, floating or consist of an artificial island."}, {"url": "http://www.wikihow.com/Work-on-an-Oil-Rig", "passage_text": "The new rigs they build require workers to man them. Jobs on oil rigs are physically demanding and work conditions are often dangerous, but oil rig workers earn good salaries, often gain promotions, and can work in locations throughout the world. If you want to learn how to work on an oil rig, follow these guidelines. 1 Shifts: Most oil rig crews, both onshore and offshore, work grueling 12-hour shifts. 2  Rotations vary, but most companies keep crews on site for 2 weeks and then give workers 2 weeks off. 3  Labor: Entry-level jobs are physically taxing. 4  Most involve moving supplies and heavy equipment, like drill pipes."}, {"url": "http://www.wikihow.com/Become-an-Oil-Rig-Worker", "passage_text": "As well as earning a wage, most offshore oil rig workers are provided food and board and some travel expenses. Getting your first job on an oil rig may be the toughest part of the process, because oil rig managers value experience. Find out how to become an oil rig worker. 1 You are a non-smoker, and you can abstain from alcohol during your long 14 to 21 day shifts. 2  You are willing and able to take on the unusual schedule of an oil rig worker. 3  You should be open to working nights, and you should be able to work many days on end without weekend breaks."}, {"url": "https://en.wikipedia.org/wiki/Oil_platform", "passage_text": "An oil platform, offshore platform, or (colloquially) oil rig is a large structure with facilities to drill wells, to extract and process oil and natural gas, or to temporarily store product until it can be brought to shore for refining and marketing. "}, {"url": "https://en.wikipedia.org/wiki/Drilling_rig", "passage_text": "A drilling rig is a machine that creates holes in the earth sub-surface. Drilling rigs can be massive structures housing equipment used to drill water wells, oil wells, or natural gas extraction wells, or they can be small enough to be moved manually by one person and are called augers. Direct push drilling rigs use hydraulic cylinders and a hydraulic hammer in advancing a hollow core sampler to gather soil and groundwater samples. The speed and depth of penetration is largely dependent on the soil type, the size of the sampler, and the weight and power of the rig."}, {"url": "https://en.wikipedia.org/wiki/Drilling_rig", "passage_text": "Larger rigs are capable of drilling through thousands of metres of the Earth 's crust, using large  mud pumps  to circulate drilling mud (slurry) through the drill bit and up the casing annulus, for cooling and removing the cuttings while a well is drilled. Hoists in the rig can lift hundreds of tons of pipe. Direct push drilling rigs use hydraulic cylinders and a hydraulic hammer in advancing a hollow core sampler to gather soil and groundwater samples. The speed and depth of penetration is largely dependent on the soil type, the size of the sampler, and the weight and power of the rig."}, {"url": "http://www.wikihow.com/Work-on-an-Oil-Rig", "passage_text": "Decide what oil rig job is best for you. An oil rig is a place where you really can work hard to get ahead. Most crane operators, shift supervisors and other skilled workers started out in entry-level positions. They set themselves apart by pursuing advanced oil rig training and accepting additional assignments. 1 Shifts: Most oil rig crews, both onshore and offshore, work grueling 12-hour shifts. 2  Rotations vary, but most companies keep crews on site for 2 weeks and then give workers 2 weeks off. 3  Labor: Entry-level jobs are physically taxing. 4  Most involve moving supplies and heavy equipment, like drill pipes."}]