[{"url": "https://answers.yahoo.com/question/index?qid=20120426011947AAEroIa", "passage_text": "What exercises to do at the gym or at home, to straighten my posture, and have my shoulders and chest at the same level, if you understand what I mean. I think the exercises are related to both shoulders and chest. Please answer... show more My shoulders are like most men's shoulders, a little pushed to the front. · just now. Report Abuse. Pull ups, chin ups, and any exercise involving a rowing motion, where you pull your arms back. Basically the forward lean comes from you doing exercises where you push your arms out."}, {"url": "http://www.wikihow.com/Straighten-Your-Back", "passage_text": "1 If your ears line up with the front of your chest, you need to pull your head back. 2  Shoulders, arms, and hands: Your arms and hands should fall on the side of your body. 3  If so, your shoulders are exhibiting good posture. 1 Many people tend to lean their head forward. 2  If your ears line up with the front of your chest, you need to pull your head back. 3  Shoulders, arms, and hands: Your arms and hands should fall on the side of your body. 4  If so, your shoulders are exhibiting good posture."}, {"url": "http://www.ehow.com/video_12300892_use-yoga-strap-straighten-shoulders-back.html", "passage_text": "How to use a yoga strap to straighten the shoulders and the back. So, for the first set of exercises that we’ll do here with the yoga strap is, holding the strap above the head with some tension on the strap, raise one arm up and the other arm down, but don’t let the chest turn. And then, you bring the arms back. 5. Cancel. Using a yoga strap to straighten the shoulders and the back requires you to hold the strap above your head with some tension. Find out how to use a yoga strap to straighten the shoulders and the back with help from an experienced yoga professional in this free video clip."}, {"url": "http://www.livestrong.com/article/108599-exercises-straighten-back-make/", "passage_text": "Overview. You can do exercises to help you straighten your back and improve your posture several times a day. This will help counter the hunched posture that can result from working in front of a computer or at a desk all day. These exercises help strengthen your weak muscles and improve postural awareness"}, {"url": "http://www.wikihow.com/Improve-Your-Posture", "passage_text": "1 Exercise One. 2  Square your posture, head upright, so that your ears are aligned over your shoulders. 3  Raise both arms straight out, alongside your ears, palms up. 4  Bend forearms in and back, toward shoulders, in an effort to touch your shoulder blades with your fingertips. 1 As with standing posture, keep your shoulders straight and squared, your head is upright, and your neck, back, and heels are all aligned. 2  Keep both feet on the ground or footrest (if your legs don't reach all the way to the ground). 3  Adjust your chair and your position so that your arms are flexed, not straight out"}, {"url": "http://www.wikihow.com/Straighten-Your-Back", "passage_text": "1 Head and neck: Make sure that your head extends straight up from your shoulders. 2  Many people tend to lean their head forward. 3  If your ears line up with the front of your chest, you need to pull your head back. 4  Shoulders, arms, and hands: Your arms and hands should fall on the side of your body. 1 Many people tend to lean their head forward. 2  If your ears line up with the front of your chest, you need to pull your head back. 3  Shoulders, arms, and hands: Your arms and hands should fall on the side of your body. 4  If so, your shoulders are exhibiting good posture."}]