[{"url": "http://www.womenshealth.gov/publications/our-publications/fact-sheet/graves-disease.html", "passage_text": "Graves' disease is an autoimmune disease that affects the thyroid. The thyroid is a small gland in the front of the neck. It makes hormones called T3 and T4 that regulate how the body uses energy. Thyroid hormone levels are controlled by the pituitary, which is a pea-sized gland in the brain."}, {"url": "http://www.mayoclinic.org/diseases-conditions/graves-disease/basics/definition/CON-20025811", "passage_text": "Graves' disease is an immune system disorder that results in the overproduction of thyroid hormones (hyperthyroidism). Although a number of disorders may result in hyperthyroidism, Graves' disease is a common cause."}, {"url": "http://www.montefiore.org/hyperthyroidism-and-graves-disease", "passage_text": "Hyperthyroidism, or an overactive thyroid gland, is typically diagnosed after the development of symptoms that can include weight loss, increased heart rate or palpitations, nervousness, difficulty sleeping, fatigue, intolerance to heat, warm skin, sweating or bulging of the eyes with Graves disease."}, {"url": "http://www.montefiore.org/hyperthyroidism-and-graves-disease", "passage_text": "Graves Disease. Graves disease is an autoimmune disorder of the thyroid gland in which patients develop antibodies to a receptor on the thyroid gland that then cause the gland to continuously overproduce thyroid hormone. Over time the thyroid gland enlarges and patients will develop a thyroid goiter."}, {"url": "http://www.womenshealth.gov/publications/our-publications/fact-sheet/graves-disease.html", "passage_text": "Most people with Graves' disease have symptoms that are bothersome. If you have symptoms of Graves' disease, your doctor will do an exam and order one or more tests. Tests used to help find out if you have Graves' disease include: 1  Thyroid function tests."}, {"url": "http://www.mayoclinic.org/diseases-conditions/graves-disease/basics/symptoms/con-20025811", "passage_text": "Common signs and symptoms of Graves' disease include: 1  Anxiety and irritability. 2  A fine tremor of your hands or fingers. 3  Heat sensitivity and an increase in perspiration or warm, moist skin. 4  Weight loss, despite normal eating habits. 5  Enlargement of your thyroid gland (goiter). 6  Change in menstrual cycles."}, {"url": "http://www.endocrineweb.com/conditions/graves-disease/graves-disease-symptoms", "passage_text": "There are numerous symptoms of Graves’ disease—an autoimmune disorder that causes the thyroid gland to over-produce thyroid hormone, which is known as hyperthyroidism. Graves’ disease is the most common cause of hyperthyroidism, so some Graves’ disease symptoms are the same as hyperthyroidism symptoms. However, people with Graves’ disease may also have other symptoms not related to hyperthyroidism. It can be a challenge to detect Graves’ disease early on."}]