[{"url": "http://support.hostgator.com/articles/hosting-guide/what-is-the-difference-between-domains-vs-hosting-vs-website", "passage_text": "When a site visitor enters your domain name into a browser, the domain is then translated into your server IP address, then the server sends that user your site files, which their browser represents to them as a typical web-page.You can see that, without each of these 3 elements, you won't really have a web-site. The web-hosting or server is much like the space that you rent out to have your business in. It's merely the space itself. It does not include furnishings like shelves for your products, just as the web-hosting account doesn't include a site for you to sell your products."}, {"url": "https://en.wikipedia.org/wiki/Domain_name", "passage_text": "A domain name is an identification string that defines a realm of administrative autonomy, authority or control within the Internet. Domain names are formed by the rules and procedures of the Domain Name System (DNS). Any name registered in the DNS is a domain name. Domain names can also be thought of as a location where certain information or activities can be found. Domain names are used in various networking contexts and application-specific naming and addressing purposes."}, {"url": "http://netforbeginners.about.com/od/d/f/domain_name.htm", "passage_text": "Answer: Domain Name System, or DNS, is the most recognized system for assigning addresses to Internet web servers (aka Internet hosts). Somewhat like international phone numbers, the domain name system helps to give every Internet server a memorable and easy-to-spell address. "}, {"url": "https://en.wikipedia.org/wiki/Domain_name", "passage_text": "In general, a domain name represents an Internet Protocol (IP) resource, such as a personal computer used to access the Internet, a server computer hosting a web site, or the web site itself or any other service communicated via the Internet. In 2014, the number of active domains reached 271 million. Any name registered in the DNS is a domain name. Domain names can also be thought of as a location where certain information or activities can be found. Domain names are used in various networking contexts and application-specific naming and addressing purposes."}, {"url": "https://www.midphase.com/website-hosting/what-is-web-hosting.php", "passage_text": "The domain name is essentially your company’s Internet address; the same way your company’s street address is used to find your offices, a domain name is used to find your website. Considering this, pick a domain name that’s memorable and relevant! Since domains are so simple, buying them is too. Using our domain registration services, you can get a domain for just $9.49/year! Our website builder and web hosting packages include a free domain name, and makes it easier to link the domain name and the website together. The website builder includes a free domain name and a web hosting account that is setup automatically. The website builder solution has the following advantages and disadvantages: 1  Easiest way to get online – With no additional learning required and hundreds of included templates, you’ll be online in no time."}, {"url": "http://www.brickmarketing.com/define-website-domain.htm", "passage_text": "A website domain, sometimes just called a domain, has different related meanings. Most commonly, a website domain is the name of the website or URL, and is sometimes called the host name. The host name is a more memorable name to stand in for the numeric, and hard to remember, IP address of a website. This allows the website visitors to find and return to a web page more easily. Every website domain also ends in what is called a top-level domain, which is a two or three letter reference that has something to do either with the country of origin, such as .us for the United States, or with the type of web page it is, such as the very popular .com for commercial web pages."}, {"url": "http://support.hostgator.com/articles/hosting-guide/what-is-the-difference-between-domains-vs-hosting-vs-website", "passage_text": "When you have a site visitor, they use your domain name to view your website. As simple as it seems, there is a process that occurs from the time that the site visitor types in your domain and presses enter. The web-hosting or server is much like the space that you rent out to have your business in. It's merely the space itself. It does not include furnishings like shelves for your products, just as the web-hosting account doesn't include a site for you to sell your products."}, {"url": "http://www.webopedia.com/TERM/D/domain_name.html", "passage_text": "Domain names are used to identify one or more IP addresses. For example, the domain name microsoft.com represents about a dozen IP addresses. Domain names are used in URLs to identify particular Web pages. For example, in the URL http://www.pcwebopedia.com/index.html, the domain name is pcwebopedia.com. Every domain name has a suffix that indicates which top level domain (TLD) it belongs to. There are only a limited number of such domains. For example: Because the Internet is based on IP addresses, not domain names, every Web server requires a Domain Name System (DNS) server to translate domain names into"}, {"url": "https://en.wikipedia.org/wiki/Domain_name", "passage_text": "A fictitious domain name is a domain name used in a work of fiction or popular culture to refer to a domain that does not actually exist, often with invalid or unofficial top-level domains such as  .web , a usage exactly analogous to the dummy 555 telephone number prefix used in film and other media. Any name registered in the DNS is a domain name. Domain names can also be thought of as a location where certain information or activities can be found. Domain names are used in various networking contexts and application-specific naming and addressing purposes."}]