[{"url": "http://materialstesting.co.uk/wras.htm", "passage_text": "WRAS approval covers all plumbing systems, water fittings, and equipment that is supplied with water from the public water supply, typically between the boundary of a property and the point of discharge. The approval system can be split into 2 sections: 1. WRAS Material Approval. This applies to non-metallic materials and components such as rubber sheet material or plastic pipe connectors. These must undergo testing only for their effects on water quality (BS 6920). 2. WRAS Product Approval. This applies to complete products such as valves, boilers and showers which must undergo water quality testing (BS 6920) of their non-metallic component parts in addition to mechanical testing."}, {"url": "https://www.wras.co.uk/approvals/what_is_a_wras_approval/", "passage_text": "WRAS Approval is the easiest way to demonstrate compliance as it is granted directly by representatives of the water suppliers and is therefore accepted by every water supplier in the UK. "}, {"url": "http://services.kiwa.co.uk/testing-products-appliances-components/potable-water-products-testing/wras-water-regulations-advisory-scheme-testing", "passage_text": "Kiwa Watertec is the UK's main WRAS Approvals company. We conduct water product and component testing for manufacturers and distributors. The Water Supply (Water Fittings) Regulations 1999 are enforced by the water supply companies, and to assist with this enforcement, the Scheme works to: 1  Promote consistent interpretation of the Regulations."}, {"url": "https://en.wikipedia.org/wiki/Water_Regulations_Advisory_Scheme", "passage_text": "The first is the WRAS company itself which is a ' for profit ' company owned by the various water suppliers within the UK; the second is used as shorthand for 'meeting the Water Regulations of 1999' (which is not in fact the case) and thirdly, it is used for approved plumbing fittings. The Water Regulations 1999 are enforced as stated above by the UK water supply companies (who essentially act as appointed/authorised enforcement for the UK Government) and this is the fundamental legal requirement."}, {"url": "http://www.flushking.co.uk/what-is-wras-approved", "passage_text": "WRAS Approval is the best way to demonstrate compliance as it is granted directly by representatives of the water suppliers and is therefore accepted by every water supplier in the UK. WRAS Fitting Approval: Whole products such as valves, boilers & showers undergo mechanical and water quality testing. This type of approval demonstrates full compliance with requirements of the regulations and byelaws, provided the fitting is installed according to any conditions given with the approval."}, {"url": "https://en.wikipedia.org/wiki/Water_Regulations_Advisory_Scheme", "passage_text": "WRAS approved product mark. The Water Regulations Advisory Scheme (WRAS) is a conformance mark that demonstrates that an item complies with high standards set out by water regulations promulgated in 1999 in the United Kingdom. The WRAS term has become a 'shorthand' within the UK covering three separate areas. The Water Regulations 1999 are enforced as stated above by the UK water supply companies (who essentially act as appointed/authorised enforcement for the UK Government) and this is the fundamental legal requirement."}, {"url": "http://www.wrcnsf.com/WRC/wrasinfo.php", "passage_text": "When submitting your WRAS approval applications, it is important that the WRAS approvals within your application are all in date on the day which the approval is grated for your product and because of this we recommend that all applications have at least 6 months left on the WRAS approval numbers. The WRAS approval numbers are in the format YYMMXXX with the YY & MM representing the Year & Month the approval was granted with XXX being the individual number issued for that approval. So if a component had the approval number 0405000 then the approval would expire in May 2009."}, {"url": "http://www.wrcnsf.com/WRC/wrasinfo.php", "passage_text": "WRAS Approval Numbers. If you are submitting a product for WRAS approval and you are using WRAS approval numbers for the components which make up your product it is not always clear what information is required with each approval number. The WRAS approval numbers are in the format YYMMXXX with the YY & MM representing the Year & Month the approval was granted with XXX being the individual number issued for that approval. So if a component had the approval number 0405000 then the approval would expire in May 2009."}, {"url": "https://www.wras.co.uk/approval.asp", "passage_text": "About WRAS. The purpose of WRAS is to contribute to the protection of public health by preventing contamination of public water supplies and encouraging the efficient use of water by promoting and facilitating compliance with the Water Supply (Water Fittings) Regulations and Scottish Water Byelaws. Read more. .. "}]