[{"url": "https://en.wikipedia.org/wiki/Gulf_of_Mexico", "passage_text": "It is bounded on the northeast, north, and northwest by the Gulf Coast of the United States, on the southwest and south by Mexico, and on the southeast by Cuba. The Gulf of Mexico formed approximately 300 million years ago as a result of plate tectonics. The Gulf's basin is roughly oval and is approximately 810 nautical miles (1,500 km) wide and floored by sedimentary rocks and recent sediments."}, {"url": "http://www.gulfbase.org/facts.php", "passage_text": "The Gulf is bordered by the United States to the north (Florida, Alabama, Mississippi, Louisiana, Texas), six Mexican states to the west (Quintana Roo, Tamaulipas, Veracruz, Tabasco, Campeche, Yucatan), and the island of Cuba to the southeast. "}, {"url": "http://www.offshore-technology.com/projects/julia-field-gulf-mexico/", "passage_text": "Julia oil field is located in the Gulf of Mexico, 200 miles south of New Orleans, Louisiana, US. The offshore field is owned 50% by Statoil and 50% by the operator, Exxon Mobil. The first phase of the field's development was sanctioned in May 2013 with a capital investment of $4bn. "}, {"url": "http://www.answers.com/Q/Where_is_the_Gulf_of_Mexico_located_on_a_map", "passage_text": "The Gulf of Mexico is that body of water contained by Florida, Alabama, Mississipi, Louisiana, Texas, Mexico and part of Cuba. Minor edit? Find the United States, and go south to Texas. Mexico is south of the United States, bordering Texas, New Mexico, Arizona and California. Mexico's neighboring countries are … the United States Of America to the north, and Guatemala and Belize to the south."}, {"url": "http://www.answers.com/Q/Where_is_the_gulf_of_Mexico_located", "passage_text": "Gulf of Mexico is an ocean basin in North America. It has to its  Northeast, North and Northwest the coastal area of USA and to its  Southwest and South it has Mexico. To it … s Southeast is Cuba.  American states of Texas, Mississippi Louisiana, Florida and  Alabama border the gulf. The Gulf of Mexico is that body of water contained by Florida, Alabama, Mississipi, Louisiana, Texas, Mexico and part of Cuba."}, {"url": "http://www.answers.com/Q/Where_is_the_Gulf_of_Mexico_located_on_a_map", "passage_text": "Gulf of Mexico is an ocean basin in North America. It has to its  Northeast, North and Northwest the coastal area of USA and to its  Southwest and South it has Mexico. To it … s Southeast is Cuba.  American states of Texas, Mississippi Louisiana, Florida and  Alabama border the gulf. Find the United States, and go south to Texas. Mexico is south of the United States, bordering Texas, New Mexico, Arizona and California. Mexico's neighboring countries are … the United States Of America to the north, and Guatemala and Belize to the south."}, {"url": "http://geography.about.com/od/unitedstatesofamerica/tp/gulfstates.htm", "passage_text": "5. Texas (map) is a state located on the Gulf of Mexico and it is the second largest of the contiguous states based on both area and population. The area of Texas is 268,820 square miles (696,241 sq km) and the state's 2009 population was 24,782,302. Florida is a state in the southeastern United States that is bordered by Alabama and Georgia to the north and the Gulf of Mexico the the south and east. It is a peninsula that is surrounded by water on three sides (map) and it has a 2009 population of 18,537,969."}, {"url": "http://www.worldatlas.com/aatlas/infopage/gulfofmexico.htm", "passage_text": "Gulf of Mexico-Map & Details. print this map. other bodies of water. The Gulf of Mexico covers a surface area of 579,153 sq miles (1.5 million sq km), and is measured 994 miles (1,600 km) west to east, and 559 miles (900 km) north to south. "}, {"url": "http://geography.about.com/od/unitedstatesofamerica/tp/gulfstates.htm", "passage_text": "3. Louisiana (map) is located between the Gulf of Mexico states of Texas and Mississippi and is south of Arkansas. It has an area of 43,562 square miles (112,826 sq km) and a 2005 population estimate (prior to Hurricane Katrina) of 4,523,628. Florida is a state in the southeastern United States that is bordered by Alabama and Georgia to the north and the Gulf of Mexico the the south and east. It is a peninsula that is surrounded by water on three sides (map) and it has a 2009 population of 18,537,969."}, {"url": "http://www.nationsencyclopedia.com/economies/Americas/Mexico.html", "passage_text": "Mexico is a country located in North America and is bordered by the United States to the north, Belize and Guatemala to its south, the Gulf of Mexico to its east and the North Pacific Ocean to its west. The country's total area is 1,972,550 square kilometers (761,601 square miles), or nearly 3 times the size of Texas. "}]