[{"url": "http://www.californiaherps.com/identification/lizardsid/elgaria.id.html", "passage_text": "Alligator lizards are found in almost any natural habitat in California (except most of the deserts and very high elevations.) They can be fairly large in size. Active during daylight, they are frequently seen moving on the ground, and occasionally up in bushes. Northern and Southern Alligator lizards are very similar in appearance, but observing the color of the eye and the position of the dark stripes on the belly can help you differentiate them. Check the range, also. There are no Northern Alligator lizards in much of Southern California."}, {"url": "http://www.bioexpedition.com/lizard-habitat-and-distribution/", "passage_text": "When it comes to Lizard habitat and Distribution it is extremely diverse.Antarcticais the only location in the world where there isn’t some species of Lizard. They do need warmer climates when possible as they are cold blooded. However, when it is cooler they are able to slow down their body functions and to survive. When it comes to Lizards in captivity is important to identify the type of habitat that they would normally be associated with in the wild. Keeping their environment warm enough is crucial. However, a heat light should only be on one side of their cage or aquarium."}, {"url": "http://www.californiaherps.com/identification/lizardsid/elgaria.id.html", "passage_text": "Three species of Alligator Lizards can be found in California: The Southern Alligator Lizard-Elgaria multicarinata (found throughout the state). The Northern Alligator Lizard-Elgaria coerulea (found only from the Monterey Bay north, and in the Sierra Nevada.). Northern and Southern Alligator lizards are very similar in appearance, but observing the color of the eye and the position of the dark stripes on the belly can help you differentiate them. Check the range, also. There are no Northern Alligator lizards in much of Southern California."}, {"url": "http://animalstime.com/lizard-facts-for-kids-fun-facts-about-lizards-for-kids/", "passage_text": "1 Lizards for the most part live a solitary life but smaller species are often found in colonies. 2  Some species are nocturnal such as geckos. 3  Lizards mostly hibernate in the cold days of winter. 4  They range in sizes from few centimeters to few meters. "}, {"url": "https://en.wikipedia.org/wiki/Alligator", "passage_text": "An average adult American alligator's weight and length is 360 kg (790 lb) and 4.0 m (13.1 ft), but they sometimes grow to 4.4 m (14 ft) long and weigh over 450 kg (990 lb). The largest ever recorded, found in Louisiana, measured 5.84 m (19.2 ft). The Chinese alligator is smaller, rarely exceeding 2.1 m (6.9 ft) in length. In addition, it weighs considerably less, with males rarely over 45 kg. No average lifespan for an alligator has been measured."}, {"url": "http://www.dfw.state.or.us/species/reptiles/index.asp", "passage_text": "The Southern Alligator lizard is found in a variety of habitats from grassland and chaparral to oak woodlands and edges of open coniferous forests, as well as riparian zones and moist canyon bottoms. It requires thickets, brush heaps, downed logs, or rock piles for cover. "}, {"url": "https://en.wikipedia.org/wiki/Alligator", "passage_text": "An alligator is a crocodilian in the genus Alligator of the family Alligatoridae. The two living species are the American alligator (A. mississippiensis) and the Chinese alligator (A. sinensis). In addition, several extinct species of alligator are known from fossil remains. The largest ever recorded, found in Louisiana, measured 5.84 m (19.2 ft). The Chinese alligator is smaller, rarely exceeding 2.1 m (6.9 ft) in length. In addition, it weighs considerably less, with males rarely over 45 kg. No average lifespan for an alligator has been measured."}, {"url": "http://tracker.cci.fsu.edu/alligator/about/where/", "passage_text": "American alligators are most commonly found in the southeastern United States, such as Florida, Louisiana, Alabama, Georgia, South Carolina, Mississippi, and Texas. Florida and Louisiana have the largest populations of alligators in America, with each inhabited by around 1.5 million alligators. The only other species of alligator, the Alligator sinensis, is found in China and is a much smaller version of the American alligator. The United States is the only country in the world where alligators and crocodiles live side by side. "}, {"url": "http://www.californiaherps.com/identification/lizardsid/elgaria.id.html", "passage_text": "They are also often found underneath debris, beach driftwood, and near human settlements. Alligator lizards do not typically bask in the sun out in the open or on top of a rock like many other lizard species. They seem to prefer sunny spots with some cover nearby. Northern and Southern Alligator lizards are very similar in appearance, but observing the color of the eye and the position of the dark stripes on the belly can help you differentiate them. Check the range, also. There are no Northern Alligator lizards in much of Southern California."}, {"url": "http://creagrus.home.montereybay.com/CAalligatorlizards.html", "passage_text": "Three alligator lizards inhabit California, and two of them are widespread: Southern Alligator Lizard Elgaria multicarinata (above; photo taken in Monterey Co.) and Northern Alligator Lizard E. coerulea (right; from Del Norte Co.). "}]