[{"url": "http://foodfacts.mercola.com/fenugreek.html", "passage_text": "The tender leaves and shoots can be added to salad greens, and the extract is used for marinades as well as imitation vanilla, butterscotch, rum, and maple syrup flavoring. Ground to a fine powder, fenugreek seeds are a favorite ingredient in Indian curries, but can add tasty pizzazz to any bland dish. Fenugreek is one of the oldest cultivated medicinal plants native to southern Europe and Asia. The name itself has an exotic ring, and it should, as widely traveled as it is."}, {"url": "http://www.homeremediesweb.com/fenugreek_health_benefits.php", "passage_text": "Fenugreek (also known as Greek Hay and Fenigreek), is an herb that is commonly found growing in the Mediterranean region of the world. While the seeds and leaves are primarily used as a culinary spice, it is also used to treat a variety of health problems in Egypt, Greece, Italy, and South Asia. Fenugreek seeds have been found to contain protein, vitamin C, niacin, potassium, and diosgenin (which is a compound that has properties similar to estrogen)."}, {"url": "http://www.webmd.com/vitamins-and-supplements/fenugreek", "passage_text": "In this article. Fenugreek is a plant that's used as a seasoning in the Middle East, Egypt, and India. As a supplement, fenugreek seeds are used as a treatment for diabetes and high cholesterol. "}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-733-FENUGREEK.aspx?activeIngredientId=733&activeIngredientName=FENUGREEK", "passage_text": "Fenugreek is used for kidney ailments, a vitamin deficiency disease called beriberi, mouth ulcers, boils, bronchitis, infection of the tissues beneath the surface of the skin (cellulitis), tuberculosis, chronic coughs, chapped lips, baldness, cancer, and lowering blood sugar in people with diabetes. In foods, fenugreek is included as an ingredient in spice blends. It is also used as a flavoring agent in imitation maple syrup, foods, beverages, and tobacco. In manufacturing, fenugreek extracts are used in soaps and cosmetics. Fenugreek leaves are eaten in India as a vegetable"}, {"url": "https://en.wikipedia.org/wiki/Fenugreek", "passage_text": "Fenugreek is used as an herb (dried or fresh leaves), spice (seeds), and vegetable (fresh leaves, sprouts, and microgreens). Sotolon is the chemical responsible for fenugreek's distinctive sweet smell. Major fenugreek-producing countries are Afghanistan, Pakistan, India, Iran, Nepal, Bangladesh, Argentina, Egypt, France, Spain, Turkey, and Morocco. The largest producer is India, where the major producing states are Rajasthan, Gujarat, Uttarakhand, Uttar Pradesh, Madhya Pradesh, Maharashtra, Haryana, and Punjab."}, {"url": "http://www.nutrition-and-you.com/fenugreek-seeds.html", "passage_text": "Fenugreek seeds nutrition facts. Fenugreek seeds are tiny, bitter, dicotyledonous seeds of herb fenugreek. Toasted gently, they exhibit strongly aromatic and pungent flavor. Traditionally, fenugreeks have been found use to cure digestive problems and to improve breast milk secretion in the nursing mothers. Non-starch polysaccharides (NSP) constitute major portion of this fiber content in the fenugreek seeds. Some important NSP's include saponins, hemicellulose, mucilage, tannin, and pectin. These compounds help lower blood LDL-cholesterol levels by inhibiting bile salts re-absorption in the colon."}, {"url": "http://www.thehealthsite.com/diseases-conditions/15-health-benefits-of-methi/", "passage_text": "Read this in Hindi. Methi or fenugreek seeds and leaves form an important ingredient in Indian households. It is used in almost every Indian preparation be it dal, paratha or curry. But what you might not know is that methi or fenugreek is a rich reservoir of medicinal properties that imparts many health benefits. "}, {"url": "https://en.wikipedia.org/wiki/Fenugreek", "passage_text": "Fenugreek (/ˈfɛnjʉɡriːk/ ; Trigonella foenum-graecum) is an annual plant in the family Fabaceae, with leaves consisting of three small obovate to oblong leaflets. It is cultivated worldwide as a semiarid crop, and its seeds are a common ingredient in dishes from the Indian subcontinent. Major fenugreek-producing countries are Afghanistan, Pakistan, India, Iran, Nepal, Bangladesh, Argentina, Egypt, France, Spain, Turkey, and Morocco. The largest producer is India, where the major producing states are Rajasthan, Gujarat, Uttarakhand, Uttar Pradesh, Madhya Pradesh, Maharashtra, Haryana, and Punjab."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-733-FENUGREEK.aspx?activeIngredientId=733&activeIngredientName=FENUGREEK", "passage_text": "Fenugreek is used for many conditions, but so far, there isn’t enough scientific evidence to determine whether or not it is effective for any of them. Fenugreek is used for digestive problems such as loss of appetite, upset stomach, constipation, and inflammation of the stomach (gastritis). In foods, fenugreek is included as an ingredient in spice blends. It is also used as a flavoring agent in imitation maple syrup, foods, beverages, and tobacco. In manufacturing, fenugreek extracts are used in soaps and cosmetics. Fenugreek leaves are eaten in India as a vegetable"}]