[{"url": "http://www.wisegeek.org/what-is-chop-suey.htm", "passage_text": "Chop suey is a classic Chinese-American stir fry vegetable dish. Meat, poultry or fish is often added or it may be vegetarian. The name chop suey refers to pieces of different foods and is the English translation of the Mandarin tsa-sui, and the Cantonese tsap seui. The exact origin of this dish is widely disputed. @donasmrs-- Chop suey means in pieces.. There are different stories about how chop suey originated. But one thing is for sure-- it's American. There is no such thing as chop suey in China. Whether the dish was made up by an American or a Chinese, it was certainly made for the American palate."}, {"url": "http://www.differencebetween.net/object/comparisons-of-food-items/difference-between-chop-suey-and-chow-mein/", "passage_text": "5. There is only one type of Chop Suey but it can be made with different ingredients like pork, beef, or chicken meat and different kinds of vegetables, while Chow Mein is prepared in two different ways, either steamed (steamed Chow Mein) or fried (crispy or Hong Kong style Chow Mein). 1. Chop Suey is a stir fry made with various vegetables, meat, and spices while Chow Mein is a stir fry made with noodles, meat, vegetables, and spices. 2. Chop Suey originated in southern China while Chow Mein originated in northern China. 3. Chop Suey is served with rice while Chow Mein is made with noodles."}, {"url": "http://howto.yellow.co.nz/food-drink/cooking-and-baking/chop-suey-recipe/", "passage_text": "Basically, the dish of chop suey is a collection of stir fried vegetables with a little meat, served on plain rice. Because many different combinations of vegetables can be used, chop suey is a great dish to experiment with. In addition, it works just as well with chicken, beef or pork. Chop Suey Recipe, 3.7 out of 5 based on 10 ratings. Chop suey is one of the most popular and widely recognised examples of Chinese cuisine. You’ll find it on the menu of almost every Chinese restaurant or take-away in New Zealand."}, {"url": "http://www.differencebetween.net/object/comparisons-of-food-items/difference-between-chop-suey-and-chow-mein/", "passage_text": "Chop Suey. Chop Suey is a stir fry made with vegetables, meat, seafood, and gravy. How it was developed has many versions. One is that it was that it started in the State of California, in the United States in the mid 1800s by Cantonese immigrants. 1. Chop Suey is a stir fry made with various vegetables, meat, and spices while Chow Mein is a stir fry made with noodles, meat, vegetables, and spices. 2. Chop Suey originated in southern China while Chow Mein originated in northern China. 3. Chop Suey is served with rice while Chow Mein is made with noodles."}, {"url": "https://en.wikipedia.org/wiki/Chop_suey", "passage_text": "It is typically served with rice but can become the Chinese-American form of chow mein with the addition of stir-fried noodles. Chop suey has become a prominent part of American Chinese cuisine, Filipino cuisine, Canadian Chinese cuisine, German Chinese cuisine, Indian Chinese cuisine, and Polynesian cuisine. In Indonesian Chinese cuisine it is known as cap cai (雜菜, mixed vegetables) and mainly consists of vegetables. The long list of colorful and conflicting stories about the origin of chop suey is, in the words of the food historian Alan Davidson, “a prime example of culinary mythology” and typical of popular foods."}, {"url": "http://www.wisegeek.org/what-is-chop-suey.htm", "passage_text": "Bean sprouts, bamboo shoots and/or water chestnuts are usually a part of chop suey. Mushrooms, onions, cabbage, celery, and bell peppers are other vegetables that may be used in the dish. Pork or beef are the most common of the meats used. Shrimp or chicken chop suey is also popular, and vegetarian versions are common. @donasmrs-- Chop suey means in pieces.. There are different stories about how chop suey originated. But one thing is for sure-- it's American. There is no such thing as chop suey in China. Whether the dish was made up by an American or a Chinese, it was certainly made for the American palate."}, {"url": "https://en.wikipedia.org/wiki/Chop_Suey!_%28song%29", "passage_text": "Chop Suey!  is the first single from Armenian-American alternative metal band System of a Down 's second album Toxicity. The single was released in August 2001 and earned the band its first Grammy nomination in 2002 for Best Metal Performance. Chop Suey! was a moderate success on the charts around the world. In Australia, after hitting No. 3 on the Triple J Hottest 100 of 2001, with virtually no airplay on commercial radio, it debuted and peaked at No. 14 in February 2002. It is System of a Down's highest charting single in Australia."}, {"url": "http://chinesefood.about.com/od/recipesbymeal/a/chow-mein.htm", "passage_text": "Both are stir-fries; while chop suey consists of vegetables and meat with a gravy, chow mein is a fried noodle dish. Chow mein noodles are normally made with wheat flour, egg and water – the noodles can be softer or crisper, depending on how long they are fried. "}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20111110132410AAGGGui", "passage_text": "Report Abuse. Chop suey is a Chinese dish consisting of meat (often chicken, fish, beef, shrimp or pork) and eggs, cooked quickly with vegetables such as bean sprouts, cabbage, and celery, in a starch-thickened sauce. Best Answer: Chop suey is actually mixed cut up vegetable (celery, carrots, sweet pea, water chestnut, and what ever vegetables the restaurant wants to add) it is usually sauted with chicken, and in white sauce. Chop suey is actually an American dish. It was made in a Chinese restaurant for Americans"}]