[{"url": "http://www.livestrong.com/article/256907-how-to-tell-if-your-body-is-acidic-or-alkaline/", "passage_text": "Your body's acidity or alkalinity may be a symptom of an underlying illness. You can find out if your body is acidic or alkaline by measuring its pH. The pH scale ranges from 0, which is very acidic, to 14, which is very basic. Pure water has a pH of 7, which is completely neutral. A healthy pH is neutral or slightly alkaline at approximately 7.0 to 7.2. Testing the pH of your urine will reveal the presence of any unusual acidity or alkalinity, which may indicate that your kidneys are working hard to neutralize your blood."}, {"url": "http://www.canceractive.com/cancer-active-page-link.aspx?n=2733", "passage_text": "*NB. pH is a measure of the acidity or alkalinity of a liquid. You can test your saliva or your urine to see how acid or alkaline you are. The measurement of pH is from zero (acid) to 14 (alkaline) and ideally water is 7.0 to 7.2 and the human body 7.2 to 7.4. The acidity or alkalinity is almost entirely due to the various dissolved salts in the liquid."}, {"url": "http://thealkalinediet.org/is-your-body-acidic", "passage_text": "When the alkaline levels in your body drop and excess acid can no longer be neutralized or eliminated, they linger and cause health problems. When your body is acidic, little or no alkaline is around to properly get rid of the acid that infiltrates your tissues, joints and organs – and acidosis takes place."}, {"url": "http://www.wikihow.com/Correct-High-Acid-pH-With-High-Alkali-Foods", "passage_text": "Maintaining the correct pH balance in your body is very important to overall health. If your body's pH is highly acidic most of the time, you can increase your risk for a variety of diseases. A pH balance of 0 to 6 is acid, a pH balance of 7 is neutral, and a pH balance of 8 to 14 is alkaline."}, {"url": "http://www.collective-evolution.com/2015/09/10/signs-your-body-is-too-acidic-how-to-correct-it/", "passage_text": "Acidic bodies are unhealthy bodies. When the body is overly acidic, it creates an unwanted environment where illness, bacteria, and yeast thrive. It also takes minerals from vital organs and bones to neutralize the acid and remove it from the body."}]