[{"url": "http://www.answers.com/Q/Is_zooplankton_a_consumer_or_producer", "passage_text": "A Producer is Animals are called consumers. This is because they  cannot make their own food, so they need toconsume (eat) plants  and/or animals. A Consumer is     …    are 3 groups of consumers. (Click on any to learn  more!)  /    Animals that eat only plants.  /    Animals that eat only animals. Zooplankton are both primary and secondary consumers. If they eat algae or cyanobacteria they will be primary consumers. If they eat other zooplankton then they would be secon … "}, {"url": "https://en.wikipedia.org/wiki/Zooplankton", "passage_text": "Zooplankton is a categorization spanning a range of organism sizes including small protozoans and large metazoans. It includes holoplanktonic organisms whose complete life cycle lies within the plankton, as well as meroplanktonic organisms that spend part of their lives in the plankton before graduating to either the nekton or a sessile, benthic existence."}, {"url": "http://www.answers.com/Q/What_type_of_consumer_is_a_zooplankton", "passage_text": "The type of consumers there are is primary consumers. They feed on plants. Secondary consumers is the next one. They feed on primary consumers. The last one are tertiary consu … mers. They feed on the secondary consumers. Everybody depends on the plants or producers. Zooplankton are both primary and secondary consumers. If they eat algae or cyanobacteria they will be primary consumers. If they eat other zooplankton then they would be secon … dary consumers. Just as people may eat plants thus making them primary or eat meat making them secondary."}, {"url": "https://en.wikipedia.org/wiki/Plankton", "passage_text": "Plankton (singular plankter) are a diverse group of organisms that live in the water column of large bodies of water and that cannot swim against a current. They provide a crucial source of food to many large aquatic organisms, such as fish and whales. "}, {"url": "http://www.miseagrant.umich.edu/lessons/lessons/by-broad-concept/life-science/food-chains-and-webs/", "passage_text": "Herbivores, such as ducks, small fish and many species of zooplankton (animal plankton) eat plants. Carnivores (meat eaters) eat other animals and can be small (e.g., frog) or large (e.g., lake trout). Omnivores are animals (including humans) that eat both plants and animals. Each is an important part of the food chain. 1 Secondary Consumers Secondary consumers make up the third level of the food chain. 2  Secondary consumers feed on smaller, plant-eating animals (primary consumers). 3  Examples of secondary consumers include bluegill, small fish, crayfish and frogs. 4  Top Predators Top predators are at the top"}, {"url": "http://marinebio.org/oceans/zooplankton/index.aspx", "passage_text": "Bioluminescent Noctiluca scintillans (a dinoflagellate). Plankton is composed of the phytoplankton (the plants of the sea) and zooplankton (zoh-plankton) which are typically the tiny animals found near the surface in aquatic environments. Like phytoplankton, zooplankton are usually weak swimmers and usually just drift along with the currents"}, {"url": "http://www.encyclopedia.com/topic/Zooplankton.aspx", "passage_text": "Most zooplankton are secondary consumers, that is, they are herbivores that graze on phytoplankton, or on unicellular or colonial algae suspended in the water column. The productivity of the zooplankton community is ultimately limited by the productivity of the small algae upon which they feed. "}, {"url": "http://www.answers.com/Q/Is_zooplankton_a_consumer_or_producer", "passage_text": "Yes, zooplankton is a primary consumer. This is because they feed  on the producers in their area and are fed on by the secondary  consumers. Zooplankton are both primary and secondary consumers. If they eat algae or cyanobacteria they will be primary consumers. If they eat other zooplankton then they would be secon … "}, {"url": "https://en.wikipedia.org/wiki/Zooplankton", "passage_text": "Plankton are organisms drifting in oceans, seas, and bodies of fresh water. The word zooplankton is derived from the Greek zoon (ζῴον), meaning animal, and planktos (πλαγκτός), meaning wanderer or drifter. Individual zooplankton are usually microscopic, but some (such as jellyfish) are larger and visible with the naked eye. It includes holoplanktonic organisms whose complete life cycle lies within the plankton, as well as meroplanktonic organisms that spend part of their lives in the plankton before graduating to either the nekton or a sessile, benthic existence."}]