[{"url": "http://www.yourtango.com/experts/yourtango-experts/21-telltale-signs-your-husband-having-affair-expert", "passage_text": "Infidelity can be tough to detect. These signs make it simple. Every woman in a relationship worries about infidelity, but unless he stumbles in late at night smelling like cheap perfume, it can be tough to tell whether your man is having an affair. Thankfully, our experts are here to help."}, {"url": "http://signscheating.com/suspect/affairs-at-work/", "passage_text": "It’s not a game anymore, it’s real life, and they likely won’t risk mentioning this person’s name to you. The only exception is when the person your spouse is having an affair with their boss. Normally, if you were suspecting anything, it would probably work. You would simply forgets about this person that they use to talk about. However, I’m telling you not to forget. affairs at work, affairs in the workplace, cheating at work, cheating in the workplace, infidelity at work, office affair, signs of cheating in the workplace."}, {"url": "http://www.marriagemax.com/blog/how-to-tell-if-your-wife-is-having-an-emotional-affair", "passage_text": "After using the program, we were able to work on our marriage from home. I finally understood my original question, “how to tell if your wife is having an emotional affair.” My wife and I now set boundaries, and we were able to work on our marriage in a healthy way. Listening to Advice. My friends kept saying to me “You need to know how to tell if your wife is having an emotional affair.” At first I thought that they were crazy but then I realized that they were right. I needed that answer. Right away I spoke to my wife about what I was feeling"}, {"url": "http://www.yourtango.com/experts/yourtango-experts/21-telltale-signs-your-husband-having-affair-expert", "passage_text": "If your partner is suddenly spending a lot of time with a colleague, co-worker, friend or even an acquaintance, particularly if that person is of the opposite sex, you may want to learn more about this relationship and the possibility that there may be an affair going on. —Michael Howard. These signs make it simple. Every woman in a relationship worries about infidelity, but unless he stumbles in late at night smelling like cheap perfume, it can be tough to tell whether your man is having an affair. Thankfully, our experts are here to help."}, {"url": "http://www.answers.com/Q/What_do_you_do_when_two_married_coworkers_are_having_an_affair", "passage_text": "What do you do if your wife had an affair with your coworker?   Though this experience is painful, you need to make a decision on whether this breaks the relationship for you. If it's cool with you to have an open relationship, expre … ss this to your wife. Otherwise, it's best to see that she has made her choices which compromised your relationship."}, {"url": "http://www.answers.com/Q/What_do_you_do_when_two_married_coworkers_are_having_an_affair", "passage_text": "And now here is the big scenario the married man who you are having the affair with will continue the story of how his life is over. If he do tell you, why don't you tell him to divorce his wife so the two of you can be together. And I will bet you he will start changing. Though this experience is painful, you need to make a decision on whether this breaks the relationship for you. If it's cool with you to have an open relationship, expre … ss this to your wife. Otherwise, it's best to see that she has made her choices which compromised your relationship."}, {"url": "http://www.webmd.com/sex-relationships/features/affair-you-dont-know-youre-having", "passage_text": "I anticipated my regular interactions with John in a way that was all too consuming. And it was John — not my husband — who was beginning to fill a key emotional need in my life. I was, in fact, unknowingly cheating on my husband; I was having an emotional affair. "}, {"url": "http://www.womansday.com/relationships/dating-marriage/advice/a1586/11-signs-that-he-might-be-having-an-affair-107288/", "passage_text": "Just remember, while one of these signs does not a cheater make, if you've witnessed a few, it's time to have a talk. Even if he's not having an affair, addressing issues in your relationship early on can prevent future infidelity, advises Manette. Meanwhile, if out of nowhere your partner accuses you of cheating, it may be because he's been unfaithful. Once a man sees how easy it is for him to become involved in an outside relationship, he begins to view his partner under the same moral microscope."}, {"url": "http://www.cosmopolitan.com/sex-love/news/a15616/first-time-cheating/", "passage_text": "Lots of times you don't even know how it happened.. Stopping an emotional affair has a lot to do with setting boundaries, Trombetti says. Make sure you discuss your boyfriend or spouse issues only with your romantic partner. Resist the urge to trash talk your spouse, and be sure to keep your spouse's secrets."}]