[{"url": "http://www.usclimatedata.com/climate/terlingua/texas/united-states/ustx2692", "passage_text": "Climate data for terlingua, Longitude: -103.595, Latitude: 29.3486. Average weather Terlingua, TX - 79852 - 1981-2010 normals. Jan: January, Feb: February, Mar: March, Apr: April, May: May, Jun: June, Jul: July, Aug: August, Sep: September, Oct: October, Nov: November, Dec: December. "}, {"url": "http://www.meoweather.com/history/United%20States/na/29.3213889/-103.6155556/Terlingua.html", "passage_text": "Weather history for Terlingua, Texas, United States. Weather in Terlingua today. Weather history in other popular US cities: New York, Los Angeles, Chicago, Houston, Philadelphia, Phoenix, San Diego."}, {"url": "http://www.bestplaces.net/climate/city/texas/terlingua", "passage_text": "Terlingua, Texas, gets 14 inches of rain per year. The US average is 37. Snowfall is 2 inches. The average US city gets 25 inches of snow per year. The number of days with any measurable precipitation is 48. On average, there are 245 sunny days per year in Terlingua, Texas. The July high is around 93 degrees. The January low is 34. Our comfort index, which is based on humidity during the hot months, is a 45 out of 100, where higher is more comfortable. "}, {"url": "http://www.accuweather.com/en/us/terlingua-tx/79852/weather-forecast/341053", "passage_text": "News-October 15, 2015; 5:02 AM ET. An effort is underway to fill a radar hole in Charlotte, North Carolina, and similarly populated areas in the United States to better detect and protect the public from severe weather. News-October 15, 2015; 7:16 AM ET. Since the first indication that a powerful El Nino was set to develop, there has been significant speculation about what impacts it would have within the United States."}, {"url": "http://forecast.weather.gov/MapClick.php?site=MAF&textField1=29.32&textField2=-103.62&e=1", "passage_text": "Showers and thunderstorms likely. Some storms could be severe, with heavy rain. Mostly cloudy, with a low around 64. East wind 5 to 10 mph. Chance of precipitation is 70%. A slow moving storm system will bring heavy rainfall and the potential for flash flooding from central Texas through Oklahoma on Thursday."}, {"url": "http://www.usa.com/terlingua-tx-weather.htm", "passage_text": "15.55 mph. U.S. 16.93 mph. * The temperature, snow fall, and precipitation information on this page were calculated from the historical data of 18,000+ U.S weather stations for the period of time from 1980 to 2010. They were calculated based on the average temperate and duration of the hot and cold days for the area. Please note, the actual heating cost and cooling cost are also dependent on other factors specific to individual residences such as the size of the house, the insulation condition, and the equipment efficiency, etc."}, {"url": "http://www.usa.com/terlingua-tx-weather.htm", "passage_text": "The average temperature of Terlingua is 66.97°F, which is about the same as the Texas average temperature of 65.97°F and is much higher than the national average temperature of 54.45°F. They were calculated based on the average temperate and duration of the hot and cold days for the area. Please note, the actual heating cost and cooling cost are also dependent on other factors specific to individual residences such as the size of the house, the insulation condition, and the equipment efficiency, etc."}, {"url": "http://www.intellicast.com/Local/Weather.aspx?location=USTX1345", "passage_text": "Winds NNE at 5 to 10 mph. Chance of rain 40%. Evening: Partly cloudy in the evening followed by scattered thunderstorms after midnight. Low 62F. Winds NNE at 5 to 10 mph. Chance of rain 50%."}, {"url": "http://forecast.weather.gov/zipcity.php?inputstring=Terlingua,TX", "passage_text": "A 50 percent chance of showers and thunderstorms. Some of the storms could produce heavy rainfall. Mostly cloudy, with a low around 59. Southeast wind 5 to 10 mph becoming northeast after midnight. Historic rainfall starting to taper off across Carolinas, threat of river flooding continues. The historic rainfall that has produced catastrophic flooding across the Carolinas is slowly beginning to taper off."}]