[{"url": "http://www.food.com/recipe/lime-jelly-166272", "passage_text": "Directions. 1  Grate the peel of 5 of the limes; set aside. 2  Squeeze enough juice from 6 to 8 of the limes to measure 3/4 cup; pour juice into medium bowl. 3  Add lime peel and water; mix well. 4  Place three layers of damp cheesecloth over a"}, {"url": "http://www.cooksinfo.com/lime-chemical", "passage_text": "But, it's important to understand the different types of lime (the chemical): in particular, the distinction between Calcium Oxide and Calcium Hydroxide is very important. Some food writers mix these up, giving out potentially dangerous information. Calcium Oxide is very dangerous; never use it."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-548-LIME.aspx?activeIngredientId=548&activeIngredientName=LIME", "passage_text": "Lime is a citrus fruit. The juice, fruit, peel, and oil are used to make medicine. Oil pressed from the crushed fruit is known as “distilled lime oil.” Oil pressed from the unripe peel is known as “expressed lime oil.”. Lime juice is used for severe diarrhea (dysentery)."}, {"url": "http://www.recipetips.com/kitchen-tips/t--963/all-about-limes.asp", "passage_text": "Often referred to as the true lime, the key lime is smaller and rounder lime than the more common Persian lime. It is yellowish green in color, has a more acidic flavor than the Tahitian varieties of limes, and is known mostly for its use in key lime pie."}, {"url": "http://www.cooksinfo.com/lime-chemical", "passage_text": "The chemical lime in the form of Calcium Hydroxide (aka Edible Lime, Hydrated Lime, CaH2O2) is used in some food processing, and has been for millennia. Lime (in the form of Calcium Hydroxide) is used in South America in processing corn. Corn is soaked in water to which Calcium Hydroxide has been added."}, {"url": "http://www.recipetips.com/kitchen-tips/t--963/all-about-limes.asp", "passage_text": "Juicing Limes. Lime juice can be used in place of lemon juice in most recipes but because their acidic level is higher they will provide a slightly sharper taste. Limes can be used to enhance the flavor of many dishes. It can be added to both sweet and savory dishes to provide a fresh flavor."}, {"url": "http://lime.org/lime-basics/uses-of-lime/", "passage_text": "Lime's Myriad Uses. Lime is the versatile mineral. Various forms of lime are used in environmental, metallurgical, construction, and chemical/industrial applications, and more. The fastest growing use of lime is in environmental applications, where lime is used to comply with air, drinking water, wastewater, and solid waste regulations."}, {"url": "http://www.food.com/recipe/lime-jelly-166272", "passage_text": "1 Squeeze enough juice from 6 to 8 of the limes to measure 3/4 cup; pour juice into medium bowl. 2  Add lime peel and water; mix well. 3  Place three layers of damp cheesecloth over a medium bowl. 4  Pour juice mixture into cheesecloth."}]