[{"url": "http://floridasimmental.com/index.html", "passage_text": "Florida Simmental Association Scholarship Application 2014 FSA Cattleman of the Year Award Nomination Form A History of the Simmental Breed The Simmental is among the oldest and most widely distributed of all breeds of cattle in the world."}, {"url": "http://www.americancattlemen.com/articles/simmental-breed", "passage_text": "In 1976 Simmental cattle were shipped to the Peoples' Republic of China. The breed is known by a variety of names, including Fleckvieh in Germany, Austria and Switzerland as well as many other European countries.Pie Rouge, Montbeliard, and Abondance in France; and Pezzata Rossa in Italy."}, {"url": "http://texassimmentalsimbrah.com/breedinfo.html", "passage_text": "The Simmental breed is one of the oldest and most widely distributed breeds of cattle in the world. The original herdbook for registrations was established in Switzerland in 1893, and the breed now makes up over half the population of cattle in that country."}, {"url": "http://www.cattleforsale.org/simmental/simmental-cattle/", "passage_text": "The Simmental breed cattle has been known worldwide in several countries by a variety of names such as “Fleckvieh” in Germany, Switzerland, and Austria which has also led to the World Simmental Federation also being referred to as the World Simmental Fleckvieh Federation."}, {"url": "http://www.ansi.okstate.edu/breeds/cattle/simmental/", "passage_text": "Breeds of Livestock-Simmental Cattle. A History of the Simmental Breed The Simmental is among the oldest and most widely distributed of all breeds of cattle in the world."}, {"url": "http://www.thecattlesite.com/breeds/beef/17/simmental/", "passage_text": "Early records indicate that Simmental cattle were the result of a cross between large German cattle and a smaller breed indigenous to Switzerland. The name Simmental is derived from the name of the area where the cattle were first bred-the Simme Valley which is situated in the Berner Oberland in"}, {"url": "http://www.thecattlesite.com/breeds/beef/17/simmental/overview/", "passage_text": "Simmental is a breed of cattle whose history dates back to the Middle Ages. Early records indicate that Simmental cattle were the result of a cross between large German cattle and a smaller breed indigenous to Switzerland. The name Simmental is derived from the name of the area where the cattle were first bred-the Simme Valley, which is situated in the Berner Oberland in"}, {"url": "http://deercreeksimmental.com/simmental/", "passage_text": "Simmental ranks as the number one continental breed in almost every trait according to the USDA Meat Animal Research Center (USDA MARC). That is why they cross so well with Angus, the number one British breed. Simmental are a dual purpose breed known for above average growth, muscling, lean meat yield and milk."}, {"url": "http://www.cattleforsale.org/simmental/simmental-cattle/", "passage_text": "As one of the oldest known breeds, the Simmental breed cattle is also one of the most widely distributed breeds of cattle in the world today."}]