[{"url": "http://www.slate.com/blogs/outward/2015/03/24/genderqueer_what_does_it_mean_and_where_does_it_come_from.html", "passage_text": "Genderqueer, along with the somewhat newer and less politicized term nonbinary, are umbrella terms intended to encompass individuals who feel that terms like man and woman or male and female are insufficient to describe the way they feel about their gender and/or the way they outwardly present it."}, {"url": "http://genderqueerid.com/post/49662415616/what-does-it-mean-to-be-genderqueer-by-marilyn", "passage_text": "Genderqueer is a term that has been used to describe non-normative gender identity or presentation, whatever that may mean in the given society where the term is utilized. Genderqueer has been used by people to describe themselves in one or more of the following ways: they may be both man and woman,"}, {"url": "https://en.wikipedia.org/wiki/Genderqueer", "passage_text": "Genderqueer (GQ; alternatively non-binary) is a catch-all category for gender identities that are not exclusively masculine or feminine —identities which are thus outside of the gender binary and cisnormativity."}, {"url": "http://www.urbandictionary.com/define.php?term=genderqueer", "passage_text": "Genderqueer people are people whose gender is not exclusively male or female. A similar term is nonbinary. While genderqueer could be an identity of itself, some common genders that fall under the genderqueer umbrella are: agender, bigender, genderfluid, androgyne, ambigender, and neutrois."}, {"url": "http://gayteens.about.com/od/glbtbasicsforteens/p/genderqueer.htm", "passage_text": "Overview: Genderqueer refers to people who do not adhere to strictly male or female identities and roles. A genderqueer person often chooses to present as neither clearly male, nor clearly female, but rather as a gender-free individual, whose identity may shift and change over time. Some genderqueer people are. 1  transgender."}, {"url": "http://www.definitions.net/definition/genderqueer", "passage_text": "genderqueer (Noun). Someone who is genderqueer. genderqueer (Adjective). Of a person who identifies as (has a gender identity which is) neither male nor female, but outside of the gender binary and/or spectrum."}, {"url": "http://www.urbandictionary.com/define.php?term=genderqueer", "passage_text": "Genderqueer is most commonly used to describe a person who feels that his/her gender identity does not fit into the socially constructed norms associated with his/her biological sex. Genderqueer is an identity that falls anywhere between man/boy/male and woman/girl/female on the spectrum of gender identities."}]