[{"url": "https://en.wikipedia.org/wiki/Seasonal", "passage_text": "The same is true of the southern hemisphere in November, December, and January. It is the tilt of the Earth that causes the Sun to be higher in the sky during the summer months which increases the solar flux. However, due to seasonal lag, June, July, and August are the hottest months in the northern hemisphere and December, January, and February are the hottest months in the southern hemisphere. Regardless of the time of year, the northern and southern hemispheres always experience opposite seasons. This is because during summer or winter, one part of the planet is more directly exposed to the rays of the Sun (see Fig. 1) than the other, and this exposure alternates as the Earth revolves in its orbit."}, {"url": "http://www.ecology.com/2011/09/10/tilting-earth-shaping-seasons/", "passage_text": "Hurtling through space at an average speed of 18.4 miles per second (30km per second), Earth is constantly changing its position with the sun. Not only is the Earth orbiting around the sun, but it also rotating on its axis at 1,070 miles per hour (1,722 km per hour), the speed at the equator. Source: NOAA. When the North Pole tilts most toward the sun, the Northern Hemisphere experiences summer. This occurs when the Earth is farthest away from the sun, and begins around June 21-22. Astronomers refer to the arrival of this event as the Summer Solstice in the Northern Hemisphere."}, {"url": "http://www.timeanddate.com/astronomy/perihelion-aphelion-solstice.html", "passage_text": "The Earth is closest to the Sun, or at the Perihelion, about two weeks after the December Solstice, when it is winter in the Northern Hemisphere. Conversely, the Earth is farthest away from the Sun, at the Aphelion point, two weeks after the June Solstice, when the Northern Hemisphere is enjoying warm summer months. Perihelion in Seattle, Washington, U.S.A. is on. Saturday, January 2, 2016 at 2:49 PM PST (Change city)."}, {"url": "http://www.answers.com/Q/Earth_is_at_perihelion_during_what_season", "passage_text": "Earth is closest to the Sun early in January-Winter for the Northern Hemisphere, and Summer for the Southern Hemisphere. Edit. Closest to the sun. At perihelion, Earth it is 91 million miles (147 million km.) from the Sun. At aphelion, it is 95 million miles (152 million km.) from the Sun. The diffe … rence is only about 4 million miles (5 million km.), which, for all practical purposes, is a perfectly circular orbit."}, {"url": "http://www.answers.com/Q/Earth_is_at_perihelion_during_what_season", "passage_text": "For one, the orbital velocity of the Earth slows down as it reaches its aphelion. It also has an effect on the climate. … Due to the point in its orbit the Earth climate is made cooler and warmer in the Northern and Summer Hemisphere creating milder or more severe seasons. Closest to the sun. At perihelion, Earth it is 91 million miles (147 million km.) from the Sun. At aphelion, it is 95 million miles (152 million km.) from the Sun. The diffe … rence is only about 4 million miles (5 million km.), which, for all practical purposes, is a perfectly circular orbit."}, {"url": "https://answers.yahoo.com/question/index?qid=20100327083710AA3rnvv", "passage_text": "during the Northern Hemisphere's winter .During which season in the Northern Hemisphere is Earth's orbital velocity greatest? 1.- winter 2.- spring 3.- summer 4.- fall. "}, {"url": "https://en.wikipedia.org/wiki/Seasonal", "passage_text": "In fact, Earth reaches perihelion (the point in its orbit closest to the Sun) in January, and it reaches aphelion (farthest point from the Sun) in July, so the slight contribution of orbital eccentricity opposes the temperature trends of the seasons in the northern hemisphere. Regardless of the time of year, the northern and southern hemispheres always experience opposite seasons. This is because during summer or winter, one part of the planet is more directly exposed to the rays of the Sun (see Fig. 1) than the other, and this exposure alternates as the Earth revolves in its orbit."}, {"url": "http://www.answers.com/Q/When_is_the_earths_orbital_velocity_the_fastest", "passage_text": "This is because the Earth is closest to the Sun during the Northern Hemisphere winter and according to Kepler's … Law of Areas (and the conservation of angular momentum), planets move the fastest at perihelion and slowest at aphelion. 4 people found this useful. Earth's speed varies … a bit because its orbit is slightly eccentric, but that's why we say mean orbital velocity. One can calculate this value by knowing two facts: 1. The earth is approximately 150 million km from the sun (mean distance) and travels approximately in a circular orbit 2."}, {"url": "http://www.timeanddate.com/astronomy/perihelion-aphelion-solstice.html", "passage_text": "The Earth is closest to the Sun or at its Perihelion two weeks after the December solstice and farthest from the Sun or Aphelion, two weeks after the June Solstice. In 2015, the Earth will reach its Perihelion at 22:49 UTC on January 2, 2016. Conversely, the Earth is farthest away from the Sun, at the Aphelion point, two weeks after the June Solstice, when the Northern Hemisphere is enjoying warm summer months. Perihelion in Seattle, Washington, U.S.A. is on. Saturday, January 2, 2016 at 2:49 PM PST (Change city)."}, {"url": "http://www.timeanddate.com/astronomy/perihelion-aphelion-solstice.html", "passage_text": "The Earth is farthest from the Sun on its orbit when it is summer in the Northern Hemisphere. This is almost two weeks after the 2015 December Solstice. The Earth will reach its Aphelion at 4:25 PM on July 4, 2016. This is just over two weeks after the June Solstice. Conversely, the Earth is farthest away from the Sun, at the Aphelion point, two weeks after the June Solstice, when the Northern Hemisphere is enjoying warm summer months. Perihelion in Seattle, Washington, U.S.A. is on. Saturday, January 2, 2016 at 2:49 PM PST (Change city)."}]