[{"url": "http://learning.hccs.edu/faculty/roman.alvarez/psyc2301/neuron-action-potential/understanding-the-transmission-of-nerve-impulses-pdf-file", "passage_text": "After the impulse has traveled through the neuron, the action potential is over, and the cell membrane returns Understanding the Transmission of Nerve Impulses-For Dummies Page 2 of 4http://www.dummies.com/how-to/content/understanding-the-transmission-of-nerve-impuls..."}, {"url": "http://www.biology-online.org/dictionary/Nerve_impulse", "passage_text": "Nerve impulse. Definition. noun. (1) The movement of action potential along a nerve fiber in response to a stimulus (such as touch, pain, heat or cold). (2) The relaying of a coded signal that travels along a nerve cell membrane to an effector, such as muscle, gland or another nerve cell. Supplement. A nerve impulse is the relaying of a coded signal from a nerve cell to an effector (a muscle cell, a gland cell or another nerve cell) in response to a stimulus. It is the means by which a nerve cell communicates with another cell."}, {"url": "http://www.dummies.com/how-to/content/understanding-the-transmission-of-nerve-impulses.html", "passage_text": "Transmission of a nerve impulse: Resting potential and action potential. Like the gaps between the Schwann cells on an insulated axon, a gap called a synapse or synaptic cleft separates the axon of one neuron and the dendrites of the next neuron."}, {"url": "http://www.merriam-webster.com/dictionary/nerve%20impulse", "passage_text": "Medical Definition of NERVE IMPULSE. : the progressive physicochemical change in the membrane of a nerve fiber that follows stimulation and serves to transmit a record of sensation from a receptor or an instruction to act to an effector—called also nervous impulse."}, {"url": "http://psychologydictionary.org/nerve-impulse/", "passage_text": "begins as a small depolarization which is carried as a wave of depolarization across the membrane of the neuron, in the form of an action potential. NERVE IMPULSE: Communications are transmitted by the nervous system as nerve impulses.. No related posts."}, {"url": "http://learning.hccs.edu/faculty/roman.alvarez/psyc2301/neuron-action-potential/understanding-the-transmission-of-nerve-impulses-pdf-file", "passage_text": "Transmission of a nerve impulse: Resting potential and action potential. Like the gaps between the Schwann cells on an insulated axon, a gap called a synapse or synaptic cleft separates the axon of one neuron and the dendrites of the next neuron."}, {"url": "http://www.merriam-webster.com/dictionary/nerve%20impulse", "passage_text": "Definition of NERVE IMPULSE. : the progressive physicochemical change in the membrane of a nerve fiber that follows stimulation and serves to transmit a record of sensation from a receptor or an instruction to act to an effector —called also nervous impulse."}]