[{"url": "https://au.answers.yahoo.com/question/index?qid=20061021204831AAzqm5X", "passage_text": "Relevance. Rating Newest Oldest. Best Answer: thymus gland THYMUS GLAND [thymus gland] , mass of glandular tissue located in the neck or chest of most vertebrate animals. In humans, the thymus is a soft, flattened, pinkish-gray organ located in the upper chest under the breastbone. Submit. · just now. Report Abuse. In human anatomy, the thymus is an organ located in the upper anterior portion of the chest cavity. The thymus plays an important role in the development of the immune system in early life, and its cells form a part of the body's normal immune system."}, {"url": "https://answers.yahoo.com/question/index?qid=1006041825848", "passage_text": "Report Abuse. The thymus gland is located in the upper thorax behind the sternum, but below the thyroid gland. It has two lobes, each divided into lobules by a partitian called a septum or wall. Each lobule consists of a densely packed outer cortex and a paler center, called the medulla"}, {"url": "https://au.answers.yahoo.com/question/index?qid=20070607041432AA531ZX", "passage_text": "Rating Newest Oldest. Best Answer: The thymus gland is a form of lymphoid tissue that is very prominent on infants. As the child grows older, more lymphoid tissues all over the body will develop and so the need for the thymus gland decreases and so it wld decrease in size and will no longer be visible on chest x-rays. The thymus is an organ that starts off at about 15 grams at birth, continues to grow, and then involutes, or atrophies. What this means for your son is that his thymus could be a normal size for a 6 month old, it's just that the radiologist saw the shadow on the chest x-ray and commented. You're on the right track."}, {"url": "https://in.answers.yahoo.com/question/index?qid=20130123075625AABBOH0", "passage_text": "Answers. Best Answer: One can live without a thymus gland in a sterile environment. Otherwise one cannot live without a thymus gland since there would be no way one can produce antibodies to fight off bacteria, fungi, viruses, etc. The thymus is the main gland that produces the most antibodies. You can lead a very normal life without a Thymus gland. If removed in adulthood, other organs (such as bones) take on the production of T-cells for immunity. T-cells have a very long life and can support immunity requirements throughout a normal life span. "}, {"url": "https://answers.yahoo.com/question/index?qid=1006041825848", "passage_text": "Rating Newest Oldest. Best Answer: Thymus: A lymphoid organ situated in the center of the upper chest just behind the sternum (breastbone). It is in the thymus that lymphocytes mature, multiply, and become T cells. (That is why they are called T cells. The thymus gland is located in the upper thorax behind the sternum, but below the thyroid gland. It has two lobes, each divided into lobules by a partitian called a septum or wall. Each lobule consists of a densely packed outer cortex and a paler center, called the medulla"}, {"url": "http://www.thymic.org/?page_id=22", "passage_text": "Thymic cancer is a cancer of the thymus gland or thymic tissue. The thymus gland is in the upper part of the mediastinum (chest) behind the sternum and extending upwards into the root of the neck. It is a small organ (reaching its maximum weight of about 1 ounce during puberty) that slowly decreases in size during adulthood and is gradually replaced by fat tissue."}, {"url": "http://www.wisegeek.org/what-is-the-thymus-gland.htm", "passage_text": "The thymus gland is an organ in the upper chest cavity that processes lymphocytes, a type of white blood cell that fights infections in the body. This organ is part of both the lymphatic system, which makes up a major part of the immune system, and the endocrine system, which includes all glands that produce hormones. The thymus gland is most important to children and young adults as it programs white blood cells to attack antigens. Different types of white blood cells programmed within the thymus gland. Chest pain may indicate a tumor of the thymus gland. The thymus is located just below the throat, behind the sternum."}]