[{"url": "http://www.ourbabynamer.com/meaning-of-Kendi.html", "passage_text": "Kendi is used as both a boys and girls name. It consists of 5 letters and 2 syllables and is pronounced Ken-di. In the U.S. in 2014, it ranked 11363 in baby name popularity for girls with 9 occurrences. Less than 5 boys were given the name. Traditional African names often reflect the order, time, or season of the child's birth. For example born on a given day or at a certain time, first born or second born. The name may also represent circumstances, for example, born while father was away."}, {"url": "http://www.babynamespedia.com/meaning/Kendy/m", "passage_text": "Baby names that sound like Kendy include Kendea, Kendee, Kendi, Kendie, Kamod, Kanid, Kante, Kantoo, Kantu, Kantue, Kanyd, Kazemde, Kendey, Kenet, Keneth (English), Kennard (English), Kenneith, Kennet (Scandinavian), Kenneth (English, Gaelic, and Scottish), and Kennit. ken-dy, ke-ndy ] The baby boy name Kendy is also used as a girl name. Its pronunciation is K EH NDiy †. The origin of Kendy is the African language. Kendy is a variant of the name Kendi. Kendy is not regularly used as a baby name for boys. It is not listed in the top 1000 names"}, {"url": "http://www.babynamespedia.com/meaning/Kendi/m", "passage_text": "[ syll. ken-di, ke-ndi ] The baby boy name Kendi is also used as a girl name. It is pronounced as K EH NDiy †. Kendi is derived from African origins. The name's meaning is one who is much loved. Kendea, Kendee, Kendey, Kendie, and Kendy are variants of Kendi. Kendi is not regularly used as a baby name for boys. It is not listed in the top 1000 names. Baby names that sound like Kendi include Kendea, Kendee, Kendie, Kendy, Kamod, Kanid, Kante, Kantoo, Kantu, Kantue, Kanyd, Kazemde, Kendey, Kenet, Keneth (English), Kennard (English), Kenneith, Kennet (Scandinavian), Kenneth (English, Gaelic, and Scottish), and Kennit."}, {"url": "http://www.babynamespedia.com/meaning/Kendy/m", "passage_text": "[ syll. ken-dy, ke-ndy ] The baby boy name Kendy is also used as a girl name. Its pronunciation is K EH NDiy †. The origin of Kendy is the African language. Kendy is a variant of the name Kendi. Kendy is not regularly used as a baby name for boys. It is not listed in the top 1000 names"}, {"url": "http://www.meaning-of-names.com/african-names/kendi.asp", "passage_text": "African name. In African, the name Kendi means-the loved one.The name Kendi originated as an African name. The name Kendi is a unisex name and can be used for a boy or girl name (male or female). African Name Meaning-the loved one. Origin-Africa. "}, {"url": "http://www.thinkbabynames.com/meaning/0/Kandi", "passage_text": "Kandi /kan-di/ [2 sylls.] as a name for girls. Kandi's name origins are English and Latin, and the name Kandi means sweet; clarity, whiteness. Kandi is an alternate form of Candy (English): from the French word sucre candi. Kandi is also a variant of Kandace (Latin)"}, {"url": "http://www.ourbabynamer.com/meaning-of-Kendi.html", "passage_text": "Then just follow the diagram below. Just for fun, see the name Kendi in Hieroglyphics, learn about ancient Egyptian Hieroglyphics and write a Hieroglyphic message. Learn about nautical flags and see your name or message written in nautical flags, on the Kendi in Nautical Flags page. Traditional African names often reflect the order, time, or season of the child's birth. For example born on a given day or at a certain time, first born or second born. The name may also represent circumstances, for example, born while father was away."}]