[{"url": "http://greekfood.about.com/od/dessertspastriessweets/r/kataifi.htm", "passage_text": "A look into the middle of a piece of kataifi. © Jim Stanfield. In Greek: καταϊφι, pronounced kah-tah-EE-fee. The first time I made rolled kataifi, Kataïfi i bought a huge bag of fresh dough and ended up with a kitchen filled with scattered shredded dough and about three pieces of the actual. pastry "}, {"url": "http://www.mygreekdish.com/recipe/greek-ekmek-kataifi-recipe-custard-and-whipped-cream-pastry-with-syrup/", "passage_text": "Ekmek kataifi is an all-weather Greek dessert made with layers of kataifi dough baked until crispy and golden, bathed in lemon scented syrup, topped with creamy thick custard and whipped cream and garnished with cinnamon and pistachios…Yummy! 1 In the meantime prepare the custard for the ekmek kataifi (steps 2-4). 2  Add in a large bowl the egg yolks with half the sugar (100g) and whisk until fluffy. 3  Add 3-4 tbsps of the milk and the corn starch and whisk again until the corn starch has dissolved."}, {"url": "http://cooking.stackexchange.com/questions/20635/is-it-possible-to-make-kataifi-dough-by-yourself-or-starting-from-filo-dough", "passage_text": "Kataifi is not shredded, it is spun. You need a hot metal wheel for that. It is made from a batter which is thrown on the wheel, and because the wheel is spun, it bakes on the wheel in threads. You need not only the instruments (this wheel), but also quite a bit of experience to throw it in even threads. "}, {"url": "http://www.ultimate-guide-to-greek-food.com/kataifi.html", "passage_text": "Kataifi. Kataifi, along with Baklava is one of the most popular and delicious Greek Desserts. It is made with a special type of pastry called kataifi or kadaifi. The pastry is like angel hair pasta and when rolled up resembles shredded wheat. It is often referred to as shredded wheat dessert. When the kataifi are cooked, remove from the oven, leaving them in the baking tray. Pour all the syrup over the pastry rolls. Sprinkle with the chopped pistachio nuts. Leave to stand, covered for a couple of hours for the flavours to infuse and to soak up the sweet syrup."}, {"url": "http://beforeitsnews.com/cooking-and-recipes/2015/01/kataifi-shrimp-2469368.html", "passage_text": "Kataifi pastry is that shredded wheat looking pastry that you will often find beside the phyllo packages in the freezer at the market. It’s mostly used for sweets but recently, I’ve seen it made into nests for savory dishes or jumbo shrimp wrapped in kataifi. 1 Cut off approx. a handful of the frozen kataifi from the package (re-seal and place back in freezer) and pull apart and crumble with your hands. 2  You should have enough to fill 1 cup. 3  Spread the kataifi out on a tray and allow to dry for 30 minutes."}, {"url": "http://www.mygreekdish.com/recipe/homemade-kataifi-recipe/", "passage_text": "Kataifi is a delicious dessert which like baklava is very popular among Greek, Turkish and Middle Eastern nations. An amazing dessert made with roughly chopped walnuts (and sometimes other nuts), scented with ground clove and cinnamon, wrapped into buttered cripsy kataifi dough and bathed in lemon scented syrup.. Working with kataifi dough – Tips. It is very important to defrost overnight the kataifi dough from the freezer. To do that, the key is to leave defrost in the fridge and not at room temperature, in order to prevent it from getting soaked with water."}, {"url": "http://www.wisegeek.org/what-is-kataifi.htm", "passage_text": "Kataifi is a popular Middle Eastern pastry made with a special form of shredded phyllo dough that is also called kataifi. Most forms are sweets, typically with nuts and honey which make them flavorful, crunchy, and very sweet. Honey is a common ingredient in kataifi. Almonds, which are sometimes included in kataifi. Garlic, which is used in making savory kataifi. Walnuts are a common ingredient in kataifi. Cloves are typically used to make the syrup that goes into kataifi."}, {"url": "http://www.wisegeek.org/what-is-kataifi.htm", "passage_text": "Many Middle Eastern bakeries stock kataifi, and it is also possible to make pastries with it at home, for cooks with steady hands and patience. The dough used to make kataifi is a form of phyllo dough, a very thin dough made with wheat and water. However, this dough is shredded into very thin strips, rather than being sold in large sheets. Honey is a common ingredient in kataifi. Almonds, which are sometimes included in kataifi. Garlic, which is used in making savory kataifi. Walnuts are a common ingredient in kataifi. Cloves are typically used to make the syrup that goes into kataifi."}]