[{"url": "http://www.answers.com/Q/When_did_the_Vietnam_War_start_and_end", "passage_text": "It started in 1954 (the same year the Algerian War for Independence from France began) and ended in 1975. It went on longer in Vietnam until the North Vietnamese took over South Vietnam and made the entire country communist governed. The arrival of combat troops is considered by some the start of the war, although American military advisers had been in Vietnam for over 10 years. Here is more input and answers from others: ---. 1  For the US, the start date would have to be around July of 1961."}, {"url": "http://www.answers.com/Q/How_did_the_Vietnam_War_start", "passage_text": "The Vietnam war officially started in 1965, but civil unrest began when communist Ho Chi Minh secretly returned to Vietnam after a 30-year exile in 1941. After the end of WWII … in 1945, France was trying to gain back power in its colonies, including Vietnam. Confidence votes 36. 1  The Vietnam war started because American president Eisenhower did not want communism to spread throughout the world and eventually to America. 2  The basic answer is that the U.S. was asked by France, via NATO, to keep the communists from taking over the French Territory."}, {"url": "http://www.whenguide.com/when-did-the-vietnam-war-start.html", "passage_text": "Knowing when did the Vietnam War start is very important to enhance our understanding on world history. It is considered as one of the most popular wars of all times because many countries aside from North Vietnam and South Vietnam fought against each other at this war. The war started due to the interest of North Vietnam to have control over South Vietnam, Cambodia as well as Laos. Because of conflicting interests, many countries supported the resistance of South Vietnam such as the United States as well as some of the members of the Southeast Asia Treaty Organization."}, {"url": "http://wanttoknowit.com/when-did-the-vietnam-war-start-and-end/", "passage_text": "The Vietnam War began on November 1st, 1955. It was a war that was fought in Vietnam, Cambodia and Laos. The communist forces wanted to expand their territory to include these countries. The Vietnam War ended with the fall of Saigon on April 30th 1975. The Viet Cong gained control of this city which had been the South Vietnamese Political base. Thousands of U.S. diplomatic, military, and civilian personnel were evacuated via helicopter."}, {"url": "http://commentary.historyguy.com/2012/05/vietnam-war-begin/295", "passage_text": "Historians and citizens still debate when the Vietnam War for Americans truly began. While President Obama, (and hence, the U.S. Government), is claiming that the American portion of the war officially began May 30, 1962, which is when the first Vietnam Service Ribbon was issued (this date is questionable. Further research is needed)."}, {"url": "http://www.answers.com/Q/When_did_the_Vietnam_War_start_and_end", "passage_text": "From the communist perspective, the Vietnam War against the US has now officially started. 4. December 11, 1961 -- US aircraft carrier Core arrives in Saigon with 65 helicopters and 4000 air and ground crewmen assigned to operate them for the North Vietnamese Army. The arrival of combat troops is considered by some the start of the war, although American military advisers had been in Vietnam for over 10 years. Here is more input and answers from others: ---. 1  For the US, the start date would have to be around July of 1961."}, {"url": "http://wanttoknowit.com/when-did-the-vietnam-war-start-and-end/", "passage_text": "When Did the Vietnam War Start and End. 04 Mar, 2011 when did 0. The Vietnam War was a sad and unnecessary time in the history of a number of countries including South Vietnam, the United States of America, Australia, New Zealand, South Korea, Philippines, Thailand, and Laos. The Vietnam War ended with the fall of Saigon on April 30th 1975. The Viet Cong gained control of this city which had been the South Vietnamese Political base. Thousands of U.S. diplomatic, military, and civilian personnel were evacuated via helicopter."}, {"url": "http://www.answers.com/Q/When_did_the_Vietnam_War_start_and_end", "passage_text": "1 After the French defeat in 1954 the communists agreed to a partitioned country. 2  The US. sent advisers to Vietnam in late 1959 and early 1960 under President Kennedy. 3  It escalated from this point on until the US. withdrew in 1973. 4  Vietnam was at war from 1945 until 1973. The arrival of combat troops is considered by some the start of the war, although American military advisers had been in Vietnam for over 10 years. Here is more input and answers from others: ---. 1  For the US, the start date would have to be around July of 1961."}, {"url": "http://www.answers.com/Q/When_did_the_Vietnam_War_start_and_end", "passage_text": "1 The US. sent advisers to Vietnam in late 1959 and early 1960 under President Kennedy. 2  It escalated from this point on until the US. withdrew in 1973. 3  Vietnam was at war from 1945 until 1973. The arrival of combat troops is considered by some the start of the war, although American military advisers had been in Vietnam for over 10 years. Here is more input and answers from others: ---. 1  For the US, the start date would have to be around July of 1961."}, {"url": "https://en.wikipedia.org/wiki/Vietnam_War", "passage_text": "This war followed the First Indochina War (1946–54) and was fought between North Vietnam —supported by the Soviet Union, China and other communist allies—and the government of South Vietnam —supported by the United States, Philippines and other anti-communist allies. The capture of Saigon by the North Vietnamese Army in April 1975 marked the end of the war, and North and South Vietnam were reunified the following year. The war exacted a huge human cost in terms of fatalities (see Vietnam War casualties)."}]