[{"url": "http://www.greenpeace.org/international/en/about/", "passage_text": "Greenpeace is an independent global campaigning organisation that acts to change attitudes and behaviour, to protect and conserve the environment and to promote peace by: Greenpeace is present in more than 55 countries across Europe, the Americas, Asia, Africa and the Pacific. To maintain its independence, Greenpeace does not accept donations from governments or corporations but relies on contributions from individual supporters and foundation grants."}, {"url": "https://en.wikipedia.org/wiki/Greenpeace", "passage_text": "Greenpeace states its goal is to ensure the ability of the Earth to nurture life in all its diversity  and focuses its campaigning on worldwide issues such as climate change, deforestation, overfishing, commercial whaling, genetic engineering, and anti-nuclear issues. Greenpeace argues that because of Arctic oil drilling, an oil spill could hurt vulnerable ecosystems. It is because the drilling project in the Hoop area of the Barents Sea is too close to the sea ice and to Bear Island 175 kilometers (110 miles) away."}, {"url": "http://www.wisegeek.com/what-is-greenpeace.htm", "passage_text": "Greenpeace was formed in 1971 to protest the proliferation of nuclear testing. Since that time, it has become a major force in the fight for conservation of natural resources and the protection of animal species. The organization is now an international group, with regional offices in 48 countries. "}, {"url": "https://simple.wikipedia.org/wiki/Greenpeace", "passage_text": "Greenpeace is an international non-governmental organisation working for the protection and conservation of the environment. It was set up in Vancouver, Canada in 1971 and now has regional and national offices in 46 countries. Greenpeace is an independent global campaigning organization that acts to change attitudes and behaviour, to protect and conserve the environment and to promote peace by: Catalysing an energy revolution to address the number one threat facing our planet: climate change."}, {"url": "https://en.wikipedia.org/wiki/Greenpeace", "passage_text": "Greenpeace is an independent global campaigning organization that acts to change attitudes and behaviour, to protect and conserve the environment and to promote peace by: Catalysing an energy revolution to address the number one threat facing our planet: climate change. Greenpeace argues that because of Arctic oil drilling, an oil spill could hurt vulnerable ecosystems. It is because the drilling project in the Hoop area of the Barents Sea is too close to the sea ice and to Bear Island 175 kilometers (110 miles) away."}, {"url": "https://www.activistfacts.com/organizations/131-greenpeace/", "passage_text": "Greenpeace is the largest environmental organization in the world, with an international membership of over 3 million and offices in over 40 countries. Greenpeace’s unwarranted mistrust of chemicals is nearly as old as the group itself. After mounting two largely successful campaigns against nuclear proliferation and whaling, Greenpeace turned its attention to what it saw as the next most clear and present danger: the chemical element chlorine."}, {"url": "http://www.greenpeace.org/international/en/about/", "passage_text": "It needs change. It needs action. Greenpeace is an independent global campaigning organisation that acts to change attitudes and behaviour, to protect and conserve the environment and to promote peace by: 1  Catalysing an energy revolution to address the number one threat facing our planet: climate change. Greenpeace is present in more than 55 countries across Europe, the Americas, Asia, Africa and the Pacific. To maintain its independence, Greenpeace does not accept donations from governments or corporations but relies on contributions from individual supporters and foundation grants."}, {"url": "https://en.wikipedia.org/wiki/Greenpeace", "passage_text": "Greenpeace is a non-governmental environmental organization with offices in over forty countries and with an international coordinating body in Amsterdam, the Netherlands. Greenpeace argues that because of Arctic oil drilling, an oil spill could hurt vulnerable ecosystems. It is because the drilling project in the Hoop area of the Barents Sea is too close to the sea ice and to Bear Island 175 kilometers (110 miles) away."}, {"url": "http://www.encyclopedia.com/topic/Greenpeace.aspx", "passage_text": "Greenpeace. Greenpeace is the largest environmental organization in the world with 2.8 million supporters worldwide and national as well as regional offices in forty-one countries across Europe, the Americas, Asia, and the Pacific. It is a nonprofit organization founded in 1971 and based in Amsterdam, the Netherlands. "}, {"url": "http://www.greenpeace.org/usa/what-we-do/", "passage_text": "Greenpeace is the largest independent, direct action environmental organization in the world. We're powered by people like you. A Papuan traditional dancer poses in front of the Greenpeace Rainbow Warrior in Jayapura, Papua, Indoneisa. © Paul Hilton / Greenpeace. We defend the natural world and promote peace by investigating, exposing and confronting environmental abuse, championing environmentally responsible solutions, and advocating for the rights and well-being of all people."}]