[{"url": "http://diseasespictures.com/calcaneal-spur/", "passage_text": "Calcaneal Spur. by admin Leave a Comment. Calcaneal spur is also called as heel spur. It is located on the heel bone and it develops due to repeated deposits of calcium on the bone spur (osteophyte) of the heels. Generally it does not cause any problem to the person, but when the calcium deposits exceed certain level, it can cause complications."}, {"url": "https://en.wikipedia.org/wiki/Calcaneal_spur", "passage_text": "A calcaneal spur (or heel spur) is a small osteophyte (bone spur) located on the calcaneus (heel bone). Calcaneal spurs are typically detected by a radiological examination (X-ray). When a foot bone is exposed to constant stress, calcium deposits build up on the bottom of the heel bone. A posterior calcaneal spur develops on the back of the heel at the insertion of the Achilles tendon. An inferior calcaneal spur consists of a calcification of the calcaneus, which lies superior to the plantar fascia at the insertion of the plantar fascia. A posterior calcaneal spur is often large and palpable through the skin and may need to be removed as part of the treatment of insertional Achilles tendonitis"}, {"url": "http://www.knie-muenchen.de/english/calcaneal_spur.html", "passage_text": "A special form of chronic achilles tendon pain is the posterior calcaneal spur, often referred to as Haglund exostosis. In this case there is an enlargement of the posterior calcaneum, which results in a fraying of the achilles tendon on the calcaneum. "}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=7095", "passage_text": "Calcaneal spur: A bony spur, also known as a heel spur, that projects from the back or underside of the heel bone (the calcaneus) and that may make walking painful. "}, {"url": "http://diseasespictures.com/calcaneal-spur/", "passage_text": "Two types of spur exists namely the inferior calcaneal spur which develops on the inferior part of calcaneus in response to plantar fasciitis and posterior calcaneal spur which is seen on the back portion of the heel at Achilles tendon. It is located on the heel bone and it develops due to repeated deposits of calcium on the bone spur (osteophyte) of the heels. Generally it does not cause any problem to the person, but when the calcium deposits exceed certain level, it can cause complications."}, {"url": "http://www.wisegeekhealth.com/what-is-a-calcaneal-spur.htm", "passage_text": "Top 10 amazing movie makeup transformations. A calcaneal spur is a bony spike formation which develops on the heel of the foot in response to chronic pressure or traumatic injuries. They may also be known as traction exostosis, heel spurs, or calcaneus spurs. Post 1. The calcaneal spur or heel spur is a bony formation under the heel close to the insertion of the plantar fascia. This happens because of too much tensile stress in the plantar fascia and/or a lack of shock absorption under the heel."}]