[{"url": "http://www.webmd.com/vitamins-and-supplements/garcinia-cambogia-weight-loss", "passage_text": "Garcinia cambogia, a tropical fruit also known as the Malabar tamarind, is a popular weight-loss supplement. People say it blocks your body's ability to make fat and it puts the brakes on your appetite. It could help keep blood sugar and cholesterol levels in check, too. Type 2 Diabetes and High Cholesterol. Garcinia cambogia may make it easier for your body to use glucose, the sugar your cells need for energy. Mice that got garcinia cambogia in one study had lower insulin levels than mice that didn't."}, {"url": "https://www.garciniahealth.com/", "passage_text": "Healthy Living Garcinia is the most exciting dieting product of the year! A completely natural weight loss formula, it promises to efficiently burn fat faster. It, simply put, is the best way to lose weight without all the sweating and starvation. It eliminates all the calorie counting and struggle with the scale. Healthy Living Garcinia is the product that's guaranteed to do the job. Healthy Living Garcinia was engineered by a team of scientists and researchers familiar with the difficulties of burning fat and losing weight. Healthy Living Garcinia eliminates a greater amount of fat without exercise and less caloric intake"}, {"url": "http://www.healthline.com/health/garcinia-cambogia-weight-loss", "passage_text": "Garcinia cambogia is a citrus fruit that grows in Southeast Asia. An extract from the fruit rind, hydroxycitric acid (HCA), has historically been used for cooking, but it’s also been used for weight loss and to lower cholesterol. You can buy garcinia cambogia online or at most health and supplement stores, in pill form or as a powder. Sometimes, it’s also included as an ingredient in snack bars. Typical doses are between 250 and 1,000 mg each day. An older study found that garcinia cambogia was not much more effective for weight loss than a placebo (fake pill). A more recent review of studies on HCA found that there isn’t enough evidence to show that it is safe and effective for long-term use."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-818-GARCINIA.aspx?activeIngredientId=818&activeIngredientName=GARCINIA", "passage_text": "1 The effect of garcinia on weight loss is not clear. 2  Some research shows that taking garcinia fruit rind extract doesn't seem to decrease fat breakdown or energy expenditure in overweight people. 3  However, other research suggests that it might improve weight loss. 4  Treating worms and parasites. The appropriate dose of garcinia depends on several factors such as the user's age, health, and several other conditions. At this time, there is not enough scientific information to determine an appropriate range of doses for garcinia."}, {"url": "http://idealbite.com/do-not-try-garcinia-cambogia-hca-until-you-read-the-facts-about-it-now/", "passage_text": "Recently, Dr. Oz called Garcinia Cambogia (HCA) the “Holy Grail of Weight Loss”- you’d better believe that it is worth taking a look at! Dr. Chen called Garcinia Cambogia Extract a “Dual Action Fat Buster” that suppresses appetite and prevents fat from being made. First, make sure that the supplement is clearly marked as HCA, or Garcinia Cambogia and that it contains at least fifty percent hydroxycitric acid. Next, make sure that the product mentions that it has potassium and calcium in the supplement, which can really help maintain your metabolism level."}, {"url": "https://www.vita-web.com/shop/garcinia-cambogia/", "passage_text": "The garcinia cambogia plant has been used as an herb added to foods in Indonesia for hundreds of years. It is believed to be an appetite suppressant and a fat blocker. Our Garcinia product is an all natural, safe, and effective weight loss supplement. Vita-Web’s Garcinia Cambogia is produced in a Food and Drug Administration (FDA) approved facility in the U.S.A. that is also certified Good Manufacturing Practices (cGMP). Our strict standards mean you get a safe, quality product at a great price."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-818-GARCINIA.aspx?activeIngredientId=818&activeIngredientName=GARCINIA", "passage_text": "GARCINIA Dosing. The appropriate dose of garcinia depends on several factors such as the user's age, health, and several other conditions. At this time, there is not enough scientific information to determine an appropriate range of doses for garcinia."}, {"url": "https://www.garciniahealth.com/", "passage_text": "With all these benefits, there's no fighting that Healthy Living Garcinia is the perfect solution! 100% Pure Garcinia Cambogia-Contains absolutely no fillers, binders or artificial ingredients. Contains 60% Hydroxycitric Acid (HCA) - HCA is the key ingredient to weight loss. It, simply put, is the best way to lose weight without all the sweating and starvation. It eliminates all the calorie counting and struggle with the scale. Healthy Living Garcinia is the product that's guaranteed to do the job. Healthy Living Garcinia was engineered by a team of scientists and researchers familiar with the difficulties of burning fat and losing weight. Healthy Living Garcinia eliminates a greater amount of fat without exercise and less caloric intake"}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-818-GARCINIA.aspx?activeIngredientId=818&activeIngredientName=GARCINIA", "passage_text": "1 Weight loss. 2  The effect of garcinia on weight loss is not clear. 3  Some research shows that taking garcinia fruit rind extract doesn't seem to decrease fat breakdown or energy expenditure in overweight people. 4  However, other research suggests that it might improve weight loss. 5  Treating worms and parasites. The appropriate dose of garcinia depends on several factors such as the user's age, health, and several other conditions. At this time, there is not enough scientific information to determine an appropriate range of doses for garcinia."}]