[{"url": "http://www.sheknows.com/baby-names/name/emilia", "passage_text": "Spanish Meaning: The name Emilia is a Spanish baby name. In Spanish the meaning of the name Emilia is: Flattering. Latin Meaning: The name Emilia is a Latin baby name. In Latin the meaning of the name Emilia is: Industrious; striving. Shakespearean Meaning: The name Emilia is a Shakespearean baby name. In Shakespearean the meaning of the name Emilia is: The Winter's Tale' A lady attending on the Queen."}, {"url": "http://www.thenamemeaning.com/emelia/", "passage_text": "Search comprehensively and find the name meaning of Emelia and its name origin or of any other name in our database. Also note the spelling and the pronunciation of the name Emelia and check the initials of the name with your last name to discover how it looks and sounds. "}, {"url": "http://www.thinkbabynames.com/meaning/0/Emelia", "passage_text": "Emelia /eme-lia/ [4 sylls.] as a name for girls. Emelia's root is Latin, and the name Emelia means rival; laborious; eager. Emelia is a version of Emily (Latin): feminine of Emil. Omelia is a popular last name. Kreatif forms: Emeeal, Emeel, Emeliaei. "}, {"url": "http://www.ohbabynames.com/meaning/name/emelia/1065", "passage_text": "See Amelia’s name page for more detail. Emelia developed as an alternate spelling of Amelia. Most etymologists agree that Amelia and Emelia are more related to Amalia (meaning “work, industrious”) rather than Aemilia (from the Latin meaning “rival”) which gave us the names Emilia, Emilie and Emily. You should consider if you prefer the “industrious” meaning or the “rival” one. It’s the difference between Emelia and Emilia. Popularity of the Girl Name Emelia. You need Adobe Flash Player 6 (or above) to view the charts."}, {"url": "http://www.thinkbabynames.com/meaning/0/Amelia", "passage_text": "It is of Latin and Old German origin, and the meaning of Amelia is rival, eager work. Blend of two medieval names: the Latin Emilia (see Emily) and the Latin German Amalia, meaning work. An 18th-century Princess Amelia brought the name to Britain. "}, {"url": "http://www.behindthename.com/name/amelia", "passage_text": "Meaning & History. Variant of AMALIA, though it is sometimes confused with EMILIA, which has a different origin. The name became popular in England after the German House of Hanover came to the British throne in the 18th century-it was borne by daughters of George II and George III. "}, {"url": "http://www.babynames.com/name/Emilia", "passage_text": "Notes: Emilia is a name with Latin origins. The meaning of the name Emilia is to strive, to excel, or to rival. Emilia originally comes from the name Aemilia. Common variations of the name include Amelia, Emelia, Emily, Amilya, Emiliana, and Amilia. Common nicknames include Emma, Em, Emmy, Mia, Millie, and Mellie."}, {"url": "http://www.sheknows.com/baby-names/name/emelia", "passage_text": "Latin Meaning: The name Emelia is a Latin baby name. In Latin the meaning of the name Emelia is: Industrious; striving. American Meaning: The name Emelia is an American baby name. In American the meaning of the name Emelia is: Industrious; striving."}]