[{"url": "http://symptomstreatment.org/parietal-lobe-function/", "passage_text": "The structure of parietal lobe can be segregated into 3 different parts: 1  The Central Sulcus: The central sulcus divides the parietal lobe from the frontal lobe. 2  The Parieto-Occipital Sulcus: It divides the parietal and occipital lobes and. 3  The Lateral Sulcus: It separates parietal from the temporal lobe."}, {"url": "http://study.com/academy/lesson/parietal-lobe-definition-functions-quiz.html", "passage_text": "The brain is divided into several lobes. These lobes are anatomical regions that are marked by specific boundary points and are associated with certain processes that they influence or completely control. The parietal lobe is located above the occipital lobe of the brain and behind the frontal lobe (see video)."}, {"url": "http://brainmadesimple.com/parietal-lobe.html", "passage_text": "Location: Upper, back part of the cortexFunction: Processes sensory information that had to do with taste, temperature, and touch. The parietal lobe carries out some very specific functions. As a part of the cortex, it has a lot of responsibilities and has to be able to process sensory information within seconds. The parietal lobe is where information such as taste, temperature and touch are integrated, or processed."}, {"url": "http://serendip.brynmawr.edu/exchange/brains/definitions/def-parlobe", "passage_text": "Definition-Parietal Lobe. Parietal Lobe-located behind the frontal cortex (and central sulcus); involved in perception of stimuli related to touch, pressure, temperature, and pain."}, {"url": "http://medical-dictionary.thefreedictionary.com/parietal+lobe", "passage_text": "one of the lobes of the liver. occipital lobe. the most posterior portion of the cerebral hemisphere, forming a small part of its dorsolateral surface. parietal lobe. the upper central portion of the gray matter of the cerebral hemisphere, between the frontal and occipital lobes, and above the temporal lobe."}, {"url": "http://medical-dictionary.thefreedictionary.com/parietal+lobe", "passage_text": "parietal lobe. n. The middle portion of each cerebral hemisphere, separated from the frontal lobe by the central sulcus, from the temporal lobe by the lateral sulcus, and from the occipital lobe only partially by the parieto-occipital sulcus on its medial aspect."}, {"url": "http://study.com/academy/lesson/parietal-lobe-definition-functions-quiz.html", "passage_text": "Functions of the Parietal Lobe. The parietal lobe functions in processing sensory information from the various parts of the body. It is heavily related to the sense of touch and involved in the manipulation of objects, as well as in detecting the orientation and numbers of objects encountered."}, {"url": "http://study.com/academy/lesson/parietal-lobe-definition-functions-quiz.html", "passage_text": "Let's review. The brain is divided into lobes. The parietal lobe is at the back of the brain and is divided into two hemispheres. It functions in processing sensory information regarding the location of parts of the body as well as interpreting visual information and processing language and mathematics."}]