[{"url": "http://allaboutalgae.com/faq-history/", "passage_text": "Algae yields are so high because they are among the most efficient organisms on the planet. Some strains are able to double in size in 24 hours, and can carry 40-70 percent of their mass as oil. There are many different methods. In one technique, massive quantities of algae are grown and then harvested. The oils are extracted from the harvest and then refined into biodiesel, gasoline, or even jet fuel."}, {"url": "http://www.biofuelsdigest.com/bdigest/2014/02/25/the-10-hottest-trends-in-algae/", "passage_text": "The renovated plant opened in April 2011. Right now, the plant can produce 20 tons of algae per 11-day campaign — a capacity of roughly 1800 tons per year at current productivity. 1800 tons of algae would have a theoretical maximum, at this stage, of a theoretical maximum of 176 tons of DHA production. Hybrid platforms. Overall, it’s Reliance’s third algae investment. A Credit Suisse report on the company, (see page eight of the report, downloadable here), revealed last year that Reliance has invested a total of $116 million (Rs6.2 billion). $93.5 million (Rs5.0 billion) in Algenol and 22.5 million (Rs1.2 billion) in Aurora Algae."}, {"url": "http://www.businessalabama.com/Business-Alabama/October-2014/Algae-Green-Plastics/", "passage_text": "Algent’s Butch Wilson harvests algae from a catfish pond using a mobile machine developed by parent company Algix. Plastics are essential in modern industry, but their downsides are hard to ignore. According to the U.S. Environmental Protection Agency, 32 million tons of plastic were discarded in 2012. This waste ends up in landfills and waterways, where it is expected to stay for a very long time. An algae treatment plant in Marion Junction is the first to yield what will become a 200 million-pound-per-year stream of bioplastic resins."}, {"url": "http://allaboutalgae.com/benefits/", "passage_text": "Algae store energy in the form of oils and carbohydrates, which, combined with their high productivity, means they can produce from 2,000 to as many as 5,000 gallons of biofuels per acre per year. Benefits. Algae are emerging to be one of the most promising long-term, sustainable sources of biomass and oils for fuel, food, feed, and other co-products. What makes them so attractive are the large number and wide variety of benefits associated with how and where they grow."}, {"url": "http://allaboutalgae.com/faq-history/", "passage_text": "The generally accepted range of how much fuel can be produced from acre of algae is 2,000-5,000 gallons of fuel per acre per year. Many researchers believe this already impressive potential can be increased. There are many different methods. In one technique, massive quantities of algae are grown and then harvested. The oils are extracted from the harvest and then refined into biodiesel, gasoline, or even jet fuel."}, {"url": "https://en.wikipedia.org/wiki/Algae_fuel", "passage_text": "In February 2010, the Defense Advanced Research Projects Agency announced that the U.S. military was about to begin large-scale oil production from algal ponds into jet fuel. After extraction at a cost of $2 per gallon, the oil will be refined at less than $3 a gallon. First, algae is not used as a primary food source for humans, meaning that it can be used solely for fuel and there would be little impact in the food industry. Second, many of the waste-product extracts produced during the processing of algae for biofuel can be used as a sufficient animal feed."}, {"url": "http://www.popularmechanics.com/science/energy/a5705/algae-to-plastic/", "passage_text": "It takes roughly a pound and a half of dried, pressed algae to make a pound of the algal portion of the plastic, he says. Production for next year could be anywhere between 1 million and 5 million pounds, largely hinging on supply. "}]