[{"url": "http://www.huffingtonpost.com/amanda-greene/artichokes-bake-boil-steam_b_3158427.html", "passage_text": "STEAM. In a large pot, bring several inches of water to a boil. Put artichoke in a steamer basket and suspend over the boiling water. Cover and reduce heat to a simmer. Steam for about 25 minutes. The artichoke is done when a knife inserted into the base meets no resistance, much like a baked potato."}, {"url": "http://www.wikihow.com/Steam-Artichokes", "passage_text": "4. Cook 25 to 35 minutes. Steam the artichokes until you can pierce the artichoke hearts with the tip of a paring knife and easily pull the inner leaves out with your fingers or a pair of tongs. "}, {"url": "http://moroccanfood.about.com/od/soupsandappetizers/r/steamed_artichokes.htm", "passage_text": "Place the artichokes in a steamer basket over the boiling water and cover the pot. Steam the artichokes until tender – up to an hour with a conventional pot, or 20 to 30 minutes with a pressure cooker. Exactly how long will depend on the size of the artichokes."}, {"url": "http://www.oceanmist.com/artichokes/steam-artichoke-2/", "passage_text": "Prep Time: 5 mins Cook Time: 40 Minutes. First, place a steaming basket in a large pot and fill the pot with water until it reaches just under the basket. Place one layer of rinsed and trimmed Artichokes into the steaming basket with Artichoke stems facing up; cover with lid. On high heat, bring the water in the steaming pot to a boil. Steam Artichokes until they are tender. Cooking time can vary, depending on the size of the Artichokes. A good approximation is 30 minutes for a Medium-sized Artichoke or 45 minutes for a Jumbo-sized Artichoke. "}, {"url": "http://www.chowhound.com/recipes/basic-steamed-artichokes-28693", "passage_text": "Instructions. 1  1 Fill a medium saucepan with an inch of water and season it with a few pinches of salt. 2  2 Meanwhile, trim the artichokes. 3  3 Place the artichokes stem-end up in the steamer basket, cover, and steam for 20 minutes. Instructions. 1  1 Fill a medium saucepan with an inch of water and season it with a few pinches of salt. 2  Insert a steamer basket; if the water comes up through the holes of the basket, pour a little out. 3  Cover the pan and bring the water to a boil over high heat, then reduce the heat to low and let the water simmer."}, {"url": "http://www.simplyrecipes.com/recipes/how_to_cook_and_eat_an_artichoke/", "passage_text": "Cover. Bring to a boil and reduce heat to simmer. Cook for 25 to 45 minutes or until the outer leaves can easily be pulled off. Note: artichokes can also be cooked in a pressure cooker (about 15-20 minutes cooking time). Cooking time depends on how large the artichoke is, the larger, the longer it takes to cook. "}, {"url": "http://www.wikihow.com/Cook-Artichokes", "passage_text": "Steam your artichokes for less cooking time and to preserve more of their nutrients. 1  Place a couple inches (4 cm) of water into a pot to boil with a steaming basket on top. 2  Drop the artichokes into the pot once the water begins to boil and steam for 15 to 20 minutes. 3  Drain artichokes with the stem up before serving. 1 Place a couple inches (4 cm) of water into a pot to boil with a steaming basket on top. 2  Add some lemon juice and salt to flavor the water if you prefer. 3  Drop the artichokes into the pot once the water begins to boil and steam for 15 to 20 minutes. 4"}, {"url": "http://www.chowhound.com/recipes/basic-steamed-artichokes-28693", "passage_text": "1 3 Place the artichokes stem-end up in the steamer basket, cover, and steam for 20 minutes. 2  Check for doneness by pulling off an outer leaf from each and poking the base of the stems with a sharp knife—if the leaves come off easily and the knife slips easily into the base, the artichokes are ready. Instructions. 1  1 Fill a medium saucepan with an inch of water and season it with a few pinches of salt. 2  Insert a steamer basket; if the water comes up through the holes of the basket, pour a little out. 3  Cover the pan and bring the water to a boil over high heat, then reduce the heat to low and let the water simmer."}, {"url": "http://www.oceanmist.com/artichokes/preparing-ocean-mist-farms-baby-artichokes/", "passage_text": "Steaming: Arrange Baby Artichokes in a steamer insert or basket in a pot deep enough to keep the Baby Artichokes above water. Cover tightly and steam over rapid boiling water until Baby Artichokes are tender. Depending on size and quantity of Baby Artichokes, steaming time can range from 15 to 20 minutes. Lift out carefully and drain. Microwaving: Arrange Baby Artichokes in a microwaveable bowl with about 1-2 inches of water."}]