[{"url": "http://www.rgtc.com/pdfs/enfa1237.pdf", "passage_text": "This endorsement is made a part of said policy and is subject to the Schedules, General Exceptions and the Conditions and Stipulations therein, except as modified by the provisions hereof. Dated: Countersigned: By: Authorized Agent ALTA-U.S. POLICY Date down Endorsement-1963 Form No. 1237 (4/66) NM 27. "}, {"url": "http://www.cptitle.com/qa.html", "passage_text": "The piggyback endorsement clearly begins its coverage as of the date of the underlying policy and only provides insurance for the period from that date through the effective date of the endorsement. In other respects this type of endorsement is very similar to a date down endorsement. Ordinarily, a letter report is presented to the relevant parties showing what documents have been filed during the period from the policy date to the current date of the county records."}, {"url": "https://answers.yahoo.com/question/index?qid=20070507095719AAf1uS1", "passage_text": "Source(s): date endorsement: https://tr.im/NYZ2swhat-is-a-date-down-e... "}, {"url": "http://www.tdi.texas.gov/title/titlem4b.html", "passage_text": "A Company may issue its Condominium Endorsement T-28 to a contemporaneously issued Mortgagee Policy on or after the date Rate Rule R-11.m. is effective, if its underwriting requirements are met and if it is paid the premium, if any, described in Rate Rule 11.m. A Company may issue its Planned Unit Development Endorsement (T-17) to a Mortgagee Policy, if its underwriting requirements are met and if it is paid the premium described in Rate Rule R-11.l. The Company may delete any insuring provision if it does not consider that risk acceptable."}, {"url": "http://www.vuwriter.com/en/guidelines/2005-10/GL00000611.html", "passage_text": "Underwriting Requirements: (1) The date down endorsement to the Mortgagee Policy (Endorsement Instruction V) and the Date Down Endorsement to the Binder (Endorsement Instruction VII) are issued for a $50 premium charge. (2) The title agent must down date the records. Off record matters such as surveys, etc. not evidenced by a recorded lien. "}, {"url": "http://www.fidelityntsconnect.com/files/tx_commercial_endors_update.pdf", "passage_text": "This endorsement is only for an assignment that is made subsequent to the date of the Mortgagee Policy. The premium charge is $237. Assignment of Mortgage to Others (Form T-3) – Issued for an assignment to a mortgagee other than those government agencies covered by the previous endorsement. Down Date (Form T-3) – Available only for a Mortgagee Policy issued in connection with a construction loan and in the amount of the construction loan. The effective date of the Mortgagee Policy is brought forward to a more current date. There is a charge of $50.00 as each down date endorsement is issued. Environmental Protection Lien (Form T-36) – Applies to residential property only. It is also available for apartment complexes where the use is strictly residential. There is a $25.00 charge for thi"}, {"url": "http://www.fidelityntsconnect.com/files/TX_Commercial_Endorsement_Feb_1_2007_update.pdf", "passage_text": "Down Date (Form T-3) – Available only for a Mortgagee Policy issued in connection with a construction loan and in the amount of the construction loan. The effective date of the Mortgagee Policy is brought forward to a more current date. There is a charge of $50.00 as each down date endorsement is issued. Environmental Protection Lien (Form T-36) – Applies to residential property only. There is a $25.00 premium charge for this endorsement. 3 Assignment of Mortgage to Government Agencies (Form T-3) – Issued for an assignment to certain government agencies. This endorsement is only for an assignment that is made subsequent to the date of the Mortgagee Policy. The premium charge is $237."}, {"url": "http://www.fidelityntsconnect.com/files/TX_Commercial_Endorsement_Feb_1_2007_update.pdf", "passage_text": "2 Policy is brought forward to a more current date. There is a charge of $50.00 for each down date endorsement. Increased Value (Form T-34) -- Not issued with the original policy, but is available if the property increases in value at a subsequent date. There is a $25.00 premium charge for this endorsement. 3 Assignment of Mortgage to Government Agencies (Form T-3) – Issued for an assignment to certain government agencies. This endorsement is only for an assignment that is made subsequent to the date of the Mortgagee Policy. The premium charge is $237."}, {"url": "http://www.tdi.texas.gov/title/titlem4b.html", "passage_text": "Balloon Mortgage Endorsement-When a mortgagee policy of title insurance is to be issued on residential real property insuring a lien that contains a balloon rider, the Company may attach to the mortgagee policy endorsement Form T-39. A Company may issue its Planned Unit Development Endorsement (T-17) to a Mortgagee Policy, if its underwriting requirements are met and if it is paid the premium described in Rate Rule R-11.l. The Company may delete any insuring provision if it does not consider that risk acceptable."}]