[{"url": "http://www.diabetes.org/diabetes-basics/symptoms/", "passage_text": "Common symptoms of diabetes: 1  Urinating often. 2  Feeling very thirsty. 3  Feeling very hungry-even though you are eating. 4  Extreme fatigue. 5  Blurry vision. 6  Cuts/bruises that are slow to heal. 7  Weight loss-even though you are eating more (type 1). 8  Tingling, pain, or numbness in the hands/feet (type 2)."}, {"url": "http://www.mayoclinic.org/diseases-conditions/diabetes/basics/symptoms/CON-20033091", "passage_text": "Some people, especially those with prediabetes or type 2 diabetes, may not experience symptoms initially. In type 1 diabetes, symptoms tend to come on quickly and be more severe. Some of the signs and symptoms of type 1 and type 2 diabetes are: 1  Increased thirst. 2  Frequent urination. 3  Extreme hunger. 4  Unexplained weight loss. 5  Presence of ketones in the urine (ketones are a byproduct of the breakdown of muscle and fat that happens when there's not enough available insulin). 6  Fatigue. 7  Irritability."}, {"url": "http://www.davita.com/kidney-disease/causes/diabetes/diabetes:-definition,-causes-and-symptoms/e/4991", "passage_text": "Diabetes is a disease that affects your body’s ability to produce or use insulin. Insulin is a hormone. When your body turns the food you eat into energy (also called sugar or glucose), insulin is released to help transport this energy to the cells."}, {"url": "http://www.livescience.com/40894-type-2-diabetes.html", "passage_text": "Diabetes is a condition characterized by high blood sugar (glucose) levels, and Type 2 diabetes is the most common form. Type 2 diabetes is a chronic disease, and left untreated, it can cause serious health complications."}, {"url": "http://www.mayoclinic.org/diseases-conditions/diabetes/basics/causes/CON-20033091", "passage_text": "In prediabetes — which can lead to type 2 diabetes — and in type 2 diabetes, your cells become resistant to the action of insulin, and your pancreas is unable to make enough insulin to overcome this resistance. Instead of moving into your cells where it's needed for energy, sugar builds up in your bloodstream."}, {"url": "http://www.mayoclinic.org/diseases-conditions/diabetes/basics/causes/CON-20033091", "passage_text": "Causes of type 1 diabetes. The exact cause of type 1 diabetes is unknown. What is known is that your immune system — which normally fights harmful bacteria or viruses — attacks and destroys your insulin-producing cells in the pancreas. This leaves you with little or no insulin."}, {"url": "http://www.mayoclinic.org/diseases-conditions/diabetes/basics/causes/CON-20033091", "passage_text": "Causes of gestational diabetes. During pregnancy, the placenta produces hormones to sustain your pregnancy. These hormones make your cells more resistant to insulin. Normally, your pancreas responds by producing enough extra insulin to overcome this resistance. But sometimes your pancreas can't keep up."}]