[{"url": "http://www.thefreedictionary.com/Abrogation", "passage_text": "ab·ro·gate. tr.v. ab·ro·gat·ed, ab·ro·gat·ing, ab·ro·gates. To abolish, do away with, or annul, especially by authority: Our existing Aboriginal and treaty rights were now part of the supreme law of the land, and could not be abrogated or denied by any government (Matthew Coon Come). abrogation. noun revocation, ending, withdrawal, scrapping (informal), setting aside, overriding, voiding, abolition, reversal, repeal, cancellation, quashing, retraction, repudiation, annulment, countermanding, nullification, rescission, invalidation a dereliction of duty and an abrogation of responsibility. noun"}, {"url": "http://www.thefreedictionary.com/abrogate", "passage_text": "tr.v. ab·ro·gat·ed, ab·ro·gat·ing, ab·ro·gates. To abolish, do away with, or annul, especially by authority: Our existing Aboriginal and treaty rights were now part of the supreme law of the land, and could not be abrogated or denied by any government (Matthew Coon Come). [Latin. "}, {"url": "https://en.wikipedia.org/wiki/Naskh_%28tafsir%29", "passage_text": "Naskh (نسخ) is an Arabic language word usually translated as  abrogation ; It is a term used in Islamic legal exegesis for seemingly contradictory material within or between the two primary sources of Islamic law: the Quran and the Sunna. Naskh as a technical term meaning 'abrogation' (although the precise sense of that must be left open) makes its appearance early on in exegesis, for example, in Muqātil's [d. 767] Khams mi'a āya (and, of course, his tafsīr)."}, {"url": "http://legal-dictionary.thefreedictionary.com/Abrogation", "passage_text": "Juris, Art. iv. 2. Abrogation is express or implied; it is express when it, is literally pronounced by the new law, either in general terms, as when a final clause abrogates or repeals all laws contrary to the provisions of the new one, or in particular terms, as when it abrogates certain preceding laws which are named. 3. "}, {"url": "http://www.yourdictionary.com/abrogate", "passage_text": "Use abrogate in a sentence. LINK / CITE ADD TO WORD LIST. verb. The definition of abrogate is defined as to end something, especially when some formal step is needed to end it. An example of the word abrogate is when the Prohibition was ended. The definition of abrogate is defined as to end something, especially when some formal step is needed to end it"}, {"url": "http://www.citizenwarrior.com/2008/09/definition-of-abrogation.html", "passage_text": "To abrogate means to abolish, do away with, or annul, especially by authority. This is a key term in studying the Quran. There are some peaceful, tolerant verses in the Quran. But the violent, intolerant ones have abrogated them. The Quran itself explains what to do with conflicting verses. "}, {"url": "http://www.merriam-webster.com/dictionary/abrogate", "passage_text": "Examples of ABROGATE. 1  The company's directors are accused of abrogating their responsibilities. 2  abrogate. 3  If UAL continues to bleed red ink, some analysts say bankruptcy—which would allow it to abrogate its union contracts—may be its only hope. 1 For their part, some of the pipeline companies saddled with these contracts for high-priced, deregulated gas have declared that they will simply abrogate them … —Barry Commoner, New Yorker, 2 May 1983. [+] 2 more [-]hide."}, {"url": "https://en.wikipedia.org/wiki/Naskh_%28tafsir%29", "passage_text": "...the Qur'ān may be naskh-ed by the Qur'ān and the Sunna by the Sunna. The Qur'ān may, in addition, be naskh-ed by the Sunna, as has occurred in the case of Q.2:180, which was replaced by the Sunna ruling: no wasiya [i.e. Naskh as a technical term meaning 'abrogation' (although the precise sense of that must be left open) makes its appearance early on in exegesis, for example, in Muqātil's [d. 767] Khams mi'a āya (and, of course, his tafsīr)."}]