[{"url": "http://www.cnn.com/2013/09/06/world/biggest-volcano/index.html", "passage_text": "The volcano is about the size of the state of New Mexico and is among the largest in the solar system, Sager says. World's coolest volcanoes. Tamu Massif covers an area of about 120,000 square miles. In comparison, the largest active volcano on land, Hawaii's Mauna Loa, is about 2,000 square miles, Sager says. "}, {"url": "http://mars.jpl.nasa.gov/gallery/atlas/olympus-mons.html", "passage_text": "OLYMPUS MONS (largest volcano in the solar system!) 3-D view of Olympus Mons The largest of the volcanoes in the Tharsis Montes region, as well as all known volcanoes in the solar system, is Olympus Mons. Olympus Mons is a shield volcano 624 km (374 mi) in diameter (approximately the same size as the state of Arizona), 25 km (16 mi) high, and is rimmed by a 6 km (4 mi) high scarp. "}, {"url": "https://emilyksharp.wordpress.com/2015/03/14/the-biggest-volcano-in-the-solar-system/", "passage_text": "astro201, blog5, mars, olympus mons, plate tectonics, shield volcano, volcano. The biggest volcano in the solar system was discovered in 1971 by the space probe Mariner 9, though it is actually visible from most backyard telescopes. This volcano is called Olympus Mons and it is located on Mars."}, {"url": "http://news.nationalgeographic.com/news/2010/12/101203-science-space-biggest-volcano-solar-system-mars/", "passage_text": "Arsia Mons, one of four volcanoes on Tharsis Rise, in a satellite picture. Arsia Mons, one of four volcanoes on Tharsis Rise, in a satellite picture. Image courtesy THEMIS/NASA. As wide as the state of Arizona, Olympus Mons on Mars has long held the title of biggest volcano in the solar system. But if a new theory proves true, Olympus is about to be cast down"}, {"url": "http://www.businessinsider.com/what-olympus-mons-looks-like-on-earth-2015-1", "passage_text": "A scary thought when you consider the volcano's colossal size. Olympus Mons is the largest planetary mountain in the solar system, but there's a mountain on the asteroid, Vesta, that is the largest mountain around. Called Rheasilvia, the mountain is a mere 315 feet higher than Olympus Mons. "}, {"url": "http://news.nationalgeographic.com/news/2010/12/101203-science-space-biggest-volcano-solar-system-mars/", "passage_text": "PUBLISHED. Arsia Mons, one of four volcanoes on Tharsis Rise, in a satellite picture. Image courtesy THEMIS/NASA As wide as the state of Arizona, Olympus Mons on Mars has long held the title of biggest volcano in the solar system. But if a new theory proves true, Olympus is about to be cast down."}, {"url": "https://en.wikipedia.org/wiki/List_of_tallest_mountains_in_the_Solar_System", "passage_text": "This is a list of tallest mountains in the Solar System; in some cases, the tallest peaks of different classes on a world are also listed. At 21.9 km, the enormous shield volcano Olympus Mons on Mars is the tallest mountain on any planet. For 40 years, following its discovery in 1971, it was the tallest mountain known in the Solar System."}, {"url": "http://www.dailygalaxy.com/my_weblog/2013/11/image-of-the-day-the-solar-systems-largest-volcano.html", "passage_text": "Its outer edge is defined by an escarpment up to 6 km tall; unique among the shield volcanoes of the Red Planet. It is also the highest mountain in the solar system and the solar system's largest volcano. In this NASA image above, Olympus Mons is the largest volcano. Lava flows from Olympus Mons and its neighboring volcanoes have resurfaced the planet in this area. "}, {"url": "http://www.universetoday.com/15588/the-largest-volcano-in-the-solar-system/", "passage_text": "by Jerry Coffey on July 16, 2008. The largest volcano in the Solar System and the largest mountain in the Solar System are one in the same: Olympus Mons on Mars. Olympus Mons is a shield volcano that towers to an amazing 26 km. That makes it 3 times the height of Mt. Everest. Unlike Everest, Olympus Mons has a very gentle slope"}]