[{"url": "http://superuser.com/questions/394385/why-do-we-need-subnet-mask", "passage_text": "A subnet mask is used to do a bit wise operations on an IP address, in conjunction with a network address. If my memory serves me well, you take an IP address and do a bit wise AND on it and the subnet mask for a given network. If the result equals the network address, then the IP address is on that particular network. "}, {"url": "https://in.answers.yahoo.com/question/index?qid=20061012145355AA2xC40", "passage_text": "Best Answer: The subnet mask is the network address plus the bits reserved for identifying the subnetwork. It's called a mask because it can be used to identify the subnet to which an IP address belongs by performing a bitwise AND operation on the mask and the IP address. "}, {"url": "http://searchnetworking.techtarget.com/tip/IP-addressing-and-subnetting-What-network-administrators-need-to-know", "passage_text": "For example, if you have an IP address of 1.1.1.1 and a subnet mask of 255.255.255.0, the 255s mask off the first three 1s. If you did the logical AND (the calculation your computer does -- see Binary-to-Decimal Conversion for more information), you would find out that the network ID for this network is 1.1.1.0. "}, {"url": "http://www.webopedia.com/TERM/S/subnet_mask.html", "passage_text": "A mask used to determine what subnet an IP address belongs to. An IP address has two components, the network address and the host address. For example, consider the IP address 150.215.017.009. The subnet mask is the network address plus the bits reserved for identifying the subnetwork -- by convention, the bits for the network address are all set to 1, though it would also work if the bits were set exactly as in the network address."}, {"url": "http://techterms.com/definition/subnetmask", "passage_text": "A subnet mask hides, or masks, the network part of a system's IP address and leaves only the host part as the machine identifier. A common subnet mask for a Class C IP address is 255.255.255.0. Each section of the subnet mask can contain a number from 0 to 256, just like an IP address. However, some office networks may use a different subnet mask such as 255.255.255.128, which can be used to split a network into two subnets. Large networks with several thousand machines may use a subnet mask of 255.255.0.0. This is the default subnet mask used by Class B networks."}, {"url": "https://en.wikipedia.org/wiki/Subnetwork", "passage_text": "A subnetwork, or subnet, is a logical, visible subdivision of an IP network. The practice of dividing a network into two or more networks is called subnetting. Computers that belong to a subnet are addressed with a common, identical, most-significant bit-group in their IP address. For IPv4, a network is also characterized by its subnet mask, which is the bitmask that when applied by a bitwise AND operation to any IP address in the network, yields the routing prefix. Subnet masks are also expressed in dot-decimal notation like an address."}, {"url": "https://www.iplocation.net/subnet-mask", "passage_text": "Applying a subnet mask to an IP address separates network address from host address. The network bits are represented by the 1's in the mask, and the host bits are represented by 0's. Performing a bitwise logical AND operation on the IP address with the subnet mask produces the network address. An IP address Subnet Calculator to retrieve subnetwork information from IP address and Subnet Mask. It is called a subnet mask because it is used to identify network address of an IP address by perfoming a bitwise AND operation on the netmask. A Subnet mask is a 32-bit number that masks an IP address, and divides the IP address into network address and host address. Subnet Mask is made by setting network bits to all 1s and setting host bits to all 0"}, {"url": "http://www.webopedia.com/TERM/S/subnet_mask.html", "passage_text": "In this case, therefore, the subnet mask would be 11111111.11111111.11110000.00000000. It's called a mask because it can be used to identify the subnet to which an IP address belongs by performing a bitwise AND operation on the mask and the IP address. The result is the subnetwork address: The subnet mask is the network address plus the bits reserved for identifying the subnetwork -- by convention, the bits for the network address are all set to 1, though it would also work if the bits were set exactly as in the network address."}]