[{"url": "http://www.szdmbag.com/en/content/?30.html", "passage_text": "The advantages and disadvantages of nonwoven fabrics. Nonwoven fabric has a lot of advantages: 1) ventilation 2) filtration 3) insulation 4) water absorbent 5) waterproof 6) flexible 7) not disheveled 8) good hand feeling, soft 9) light 10) flexible, resilient 11) no cloth direction 13) low price, can be mass-produced."}, {"url": "http://www.technicalnonwovens.com/advantages", "passage_text": "Unlike other fabrics and substrates that are made by knitting, weaving or other processes, Fiberweb’s ® advanced technologies ensure that our nonwoven fabrics are engineered to meet the strict performance demands of our customers’ diverse applications. "}, {"url": "http://www.ehow.com/info_8688155_advantages-disadvantages-woven-fabrics.html", "passage_text": "Other woven fabrics such as linen and silk can be laborious with washing, especially if the fabric requires dry cleaning or pressing. Weaves by far outlast most other fabrics such as knits, and this is why so many heavy duty fabrics are weaves. Examples of woven fabrics include denim, linen, corduroy and tweed. Knit fabric is comfortable, but not meant for heavy duty use because of the overall stretchiness."}, {"url": "http://www.ehow.com/info_8688155_advantages-disadvantages-woven-fabrics.html", "passage_text": "Weaving is the primary way fabric is formed. Woven fabrics are formed by weaving threads over and under each other. There are many natural and man-made types of woven fabrics including denim, broadcloth, silk, satin, flannel and twill. Fabric thread can be made from cotton, linen, bamboo, polyester and even rayon. Weaves by far outlast most other fabrics such as knits, and this is why so many heavy duty fabrics are weaves. Examples of woven fabrics include denim, linen, corduroy and tweed. Knit fabric is comfortable, but not meant for heavy duty use because of the overall stretchiness."}, {"url": "http://www.answers.com/Q/What_are_the_advantages_of_woven_fabrics", "passage_text": "spandex is actually a flexible yarn that can be used in woven as well as in knitted fabrics to increase the elasticity fo fabric but there is no fabric as such that has … 100% spandex in it,as its just a 1-10% of actual composition. A very quick and simple test to see if a fabric is woven is to flip it to the underside. A WOVEN fabric will still have the same colors and perhaps even a design on the reverse, making it hard to see which is the right or wrong side of fabric. Example would be a strip or plaid. Same on either side."}, {"url": "http://www.answers.com/Q/What_are_the_advantages_of_woven_fabrics", "passage_text": "The selvage is the lengthwise finished edges of a woven  fabric. One of the selvages is frequently white, with the name of  the fabric, designer, and manufacturer stamped … onto it. The  opposite selvage is also a woven edge but includes the fabric  design. A very quick and simple test to see if a fabric is woven is to flip it to the underside. A WOVEN fabric will still have the same colors and perhaps even a design on the reverse, making it hard to see which is the right or wrong side of fabric. Example would be a strip or plaid. Same on either side."}, {"url": "http://www.bbc.co.uk/schools/gcsebitesize/design/textiles/fabricsrev1.shtml", "passage_text": "Woven fabrics. Woven fabrics are made up of a weft-the yarn going across the width of the fabric-and a warp-the yarn going down the length of the loom. The side of the fabric where the wefts are double-backed to form a non-fraying edge is called the selvedge. There are three types of w"}, {"url": "https://en.wikipedia.org/wiki/Ripstop", "passage_text": "Ripstop fabric applied in a paraglider. Ripstop fabrics are woven fabrics, often made of nylon, using a special reinforcing technique that makes them resistant to tearing and ripping. During weaving, (thick) reinforcement threads are interwoven at regular intervals in a crosshatch pattern. The intervals are typically 5 to 8 millimeters (0.2 to 0.3 in). "}]