[{"url": "http://noblood.org/answers/34/what-should-i-know-about-fibrin-glue", "passage_text": "Ramez Salem)(Williams & Wilkens) *The process involved in making fibrin glue may not be acceptable to everyone. See Also Custom Google Search for Fibrin Glue. Fibrin glue is a human-derived tissue adhesive that may be used for hemostasis and sealing of tissues. This biological glue can be manufactured from clotting factors taken from donor plasma (fibrinogen, cyroprecipitate and thrombin) or made intraoperatively out of fibrinogen coming from the patient's own blood*. The elastic property, tensile strength, and tissue adhesiveness of plasma fibrin glue or sealant has made it an important adjunct in microsurgical techniques, conventional hemostasis, cardiopulmonary bypass surgery, colostomy closure and splenic injury repair."}, {"url": "https://en.wikipedia.org/wiki/Fibrin_scaffold", "passage_text": "Fibrin glue or fibrin sealant is also referred to as a fibrin based scaffold and used to control surgical bleeding, speed wound healing, seal off hollow body organs or cover holes made by standard sutures, and provide slow-release delivery of medications like antibiotics to tissues exposed. A fibrin scaffold is a network of protein that holds together and supports a variety of living tissues. It is produced naturally by the body after injury, but also can be engineered as a tissue substitute to speed healing."}, {"url": "http://www.ethicon.com/healthcare-professionals/products/biosurgery/evicel-fibrin-sealant-human", "passage_text": "Indication. EVICEL ® Fibrin Sealant (Human) is indicated as an adjunct to hemostasis for use in patients undergoing surgery, when control of bleeding by standard surgical techniques (such as suture, ligature, or cautery) is ineffective or impractical. 1  Do not inject directly into the circulatory system. Simple Solution. EVICEL ® Fibrin Sealant, once thawed, is ready on-demand to meet your critical bleeding challenges by working independently of your patient’s clotting factors. 1  The only all human, aprotinin free, fibrin sealant indicated for general hemostasis."}, {"url": "http://www.surgeryencyclopedia.com/Ce-Fi/Fibrin-Sealants.html", "passage_text": "Fibrin sealants are a type of surgical tissue adhesive derived from human and animal blood products. The ingredients in these sealants interact during application to form a stable clot composed of a blood protein called fibrin. Fibrin sealants are also called fibrin glues. All fibrin sealants in use as of 2003 have two major ingredients, purified fibrinogen (a protein) and purified thrombin (an enzyme) derived from human or bovine (cattle) blood. Many sealants have two additional ingredients, human blood factor XIII and a substance called aprotinin, which is derived from cows' lungs."}, {"url": "http://www.fda.gov/downloads/BiologicsBloodVaccines/BloodBloodProducts/ApprovedProducts/LicensedProductsBLAs/FractionatedPlasmaProducts/UCM114073.pdf", "passage_text": "• EVICEL is a fibrin sealant indicated as an adjunct to hemostasis for use in patients undergoing surgery, when control of bleeding by standard surgical techniques (such as suture, ligature or cautery) is ineffective or impractical (1). • For Topical Use Only. EVICEL ® Fibrin Sealant (Human) is indicated as an adjunct to hemostasis for use in patients undergoing surgery, when control of bleeding by standard surgical techniques (such as suture, ligature, or cautery) is ineffective or impractical. 2 DOSAGE AND ADMINISTRATION."}, {"url": "http://www.fda.gov/downloads/BiologicsBloodVaccines/BloodBloodProducts/ApprovedProducts/LicensedProductsBLAs/FractionatedPlasmaProducts/UCM114073.pdf", "passage_text": "Fibrin Sealant (Human) is indicated as an adjunct to hemostasis for use in patients. undergoing surgery, when control of bleeding by standard surgical techniques (such as. suture, ligature, or cautery) is ineffective or impractical. EVICEL ® Fibrin Sealant (Human) is indicated as an adjunct to hemostasis for use in patients undergoing surgery, when control of bleeding by standard surgical techniques (such as suture, ligature, or cautery) is ineffective or impractical. 2 DOSAGE AND ADMINISTRATION."}, {"url": "http://www.webmd.com/first-aid/tc/fibrin-glue-and-thrombin-powder-topic-overview", "passage_text": "Fibrin glue is a pasty substance that is applied directly on a wound (topically) and is most often used after dental procedures to treat people who have bleeding problems. Fibrin glue contains clotting factors to help a wound stop bleeding. It is used for people who lack or have a shortage of clotting factor VIII. Thrombin powder is a dry powder that can be applied directly to the top of a wound to stop minor bleeding. "}, {"url": "http://dallasprptherapy.com/fibrin-sealant-spine-degenerative-discs/", "passage_text": "Fibrin sealant is produced when concentrated thrombin derived from human plasma is combined with the plasma protein pro-fibrinogen to produce a biologic “glue” made of human fibrin. This sealant is created using a simple injection device that is commercially available. "}, {"url": "https://en.wikipedia.org/wiki/Fibrin_glue", "passage_text": "Fibrin glue applied after drying the scleral bed in an intraocular lens operation. Fibrin glue (also called fibrin sealant) is a formulation used to create a fibrin clot. It is made up of fibrinogen (lyophilised pooled human concentrate) and thrombin (bovine, which is reconstituted with calcium chloride) that are applied to the tissue sites to glue them together. "}, {"url": "http://noblood.org/answers/34/what-should-i-know-about-fibrin-glue", "passage_text": "Fibrin glue is derived from two components. The first component contains human fibrinogen and coagulation factor XIII and varying amounts of other plasma proteins such as fibronectin and plasminogen. The second component contains thrombin (of either bovine or human origin). The elastic property, tensile strength, and tissue adhesiveness of plasma fibrin glue or sealant has made it an important adjunct in microsurgical techniques, conventional hemostasis, cardiopulmonary bypass surgery, colostomy closure and splenic injury repair."}]