[{"url": "http://www.greatmindsinstem.org/college/u-s-navy-stem-scholarship", "passage_text": "Naval Sea Systems Command (NAVSEA) is the largest of the Navy’s five systems Commands. Responsible for designing, building, buying and maintaining the nation’s fleet of ships, submarines and combat systems, it is a highly-specialized organization providing vital support to America’s Naval Forces. NAVSEA has over 60,000 civilian, military and contract support personnel working in numerous locations across the world. If it were a private company, NAVSEA would anchor atop of the nation’s Fortune 500 organizations."}, {"url": "http://www.greatmindsinstem.org/college/u-s-navy-stem-scholarship", "passage_text": "NAVSEA offers a professional environment with rapid merit-based advancement opportunities and great benefits that recognize the importance of work-life balance. Pursue a meaningful and satisfying career as part of the America’s best civilian defense team. NAVSEA has over 60,000 civilian, military and contract support personnel working in numerous locations across the world. If it were a private company, NAVSEA would anchor atop of the nation’s Fortune 500 organizations."}, {"url": "https://en.wikipedia.org/wiki/Naval_Sea_Systems_Command", "passage_text": "NAVSEA's primary objective is to engineer, build and support the U.S. Navy's fleet of ships and its combat systems. NAVSEA accounts for one quarter of the Navy's entire budget, with more than 150 acquisition programs under its oversight. The Naval Sea Systems Command was established on 1 July 1974 with the merger of the Naval Ship Systems Command with the Naval Ordnance Systems Command. The Naval Ship Systems Command was established in 1966 replacing the Navy's Bureau of Ships (BuShips)."}, {"url": "https://en.wikipedia.org/wiki/Naval_Reactors", "passage_text": "The office was originally a joint activity of the U.S. Atomic Energy Commission (AEC) and the U.S. Navy's Bureau of Ships. When the AEC was abolished, Naval Reactors became a joint effort of the Navy and the Energy Research and Development Administration, which partly replaced the AEC. In 1977, ERDA was combined with the Federal Energy Administration to form the U.S. Department of Energy. On the Navy side of the organization, the Bureau of Ships has given way since the 1950s to the Naval Sea Systems Command, within which NR is Code 08, usually abbreviated NAVSEA 08. Assigned to the Bureau of Ships in September 1947, Rickover received training in nuclear power at Oak Ridge, Tennessee, and worked with the bureau to explore the possibility of nuclear ship propulsion."}, {"url": "http://www.navsea.navy.mil/", "passage_text": "September 24, 2015 - WASHINGTON-The Naval Sea System Command will host a cybersecurity industry day Oct. 30 on the Washington Navy Yard to provide industry with information on cybersecurity-related contracting opportunities for various NAVSEA and Program Executive Offices. With the completion of acceptance trials, the delivery of LCS 5 to the Navy is r... Last week, Adm. John Richardson became the Navy's 31st Chief of Naval Operations... #ICYMI: The U.S. Navy's only forward-deployed Nimitz-class aircraft carrier USS ..."}, {"url": "https://en.wikipedia.org/wiki/Naval_Reactors", "passage_text": "Naval Reactors (NR) is an umbrella term for the U.S. government office that has comprehensive responsibility for safe and reliable operation of the United States Navy 's nuclear propulsion program. Assigned to the Bureau of Ships in September 1947, Rickover received training in nuclear power at Oak Ridge, Tennessee, and worked with the bureau to explore the possibility of nuclear ship propulsion."}, {"url": "http://www.navsea.navy.mil/", "passage_text": "NAVSEA Latest News. October 1, 2015 - PHILADELPHIA -- The new Naval Surface Warfare Center (NSWC) Philadelphia Division stood up as a separate echelon four division within NSWC, Oct. 1. With the completion of acceptance trials, the delivery of LCS 5 to the Navy is r... Last week, Adm. John Richardson became the Navy's 31st Chief of Naval Operations... #ICYMI: The U.S. Navy's only forward-deployed Nimitz-class aircraft carrier USS ..."}, {"url": "https://en.wikipedia.org/wiki/Naval_Sea_Systems_Command", "passage_text": "Seal of the Naval Sea Systems Command. NAVSEA logo. The Naval Sea Systems Command (NAVSEA) is the largest of the United States Navy 's five systems commands, or materiel (not to be confused with material) organizations. The Naval Sea Systems Command was established on 1 July 1974 with the merger of the Naval Ship Systems Command with the Naval Ordnance Systems Command. The Naval Ship Systems Command was established in 1966 replacing the Navy's Bureau of Ships (BuShips)."}, {"url": "http://www.navsea.navy.mil/", "passage_text": "NSWC Philadelphia Division, formerly known as Naval Ship Systems Engineering Station (NAVSSES), was an echelon five command within NSWC Carderock Division. Naval Surface Warfare Center Philadelphia Command Stands Up. With the completion of acceptance trials, the delivery of LCS 5 to the Navy is r... Last week, Adm. John Richardson became the Navy's 31st Chief of Naval Operations... #ICYMI: The U.S. Navy's only forward-deployed Nimitz-class aircraft carrier USS ..."}]