[{"url": "http://starbucksmelody.com/2010/07/24/organic-coffees-by-starbucks-open-thread/", "passage_text": "Organic French Roast – Seattle’s Best Coffee – This coffee is a core coffee in the Seattle’s Best whole bean coffee menu. As with any “French roast” coffee the majority of the flavor comes from the roast profile and not the bean itself. French roast coffees are always the darkest that Starbucks roasts their beans. In August 2009, Starbucks reintroduced this coffee as an “organic” coffee. The My Starbucks Idea blog discusses the re-launch of this coffee here. I’ll be honest, I’m not even totally sure what this coffee is a blend of. I think it’s mostly Latin America beans with some beans from the Asia-Pacific growing region."}, {"url": "https://en.wikipedia.org/wiki/Coffee", "passage_text": "Coffee is slightly acidic (pH 5.0–5.1) and can have a stimulating effect on humans because of its caffeine content. Coffee is one of the most popular drinks in the world. It can be prepared and presented in a variety of ways (e.g., espresso, cappuccino, cafe latte, etc.). It is usually served hot, although iced coffee is also served."}, {"url": "http://www.intracen.org/Packaging-for-organic-foods-for-web/", "passage_text": "Glass is used in rigid packaging form. Glass is inert, does not taint foodstuffs or affect taste, is impervious to gasses, has transparency and is liked by consumers. It is a trusted and environmentally friendly packaging material because of its recyclability. How packaging must protect food from external threats 2 Table 2. European Union regulations affecting food packaging and organic products 15 Table 3. Labels and organic food requirements 17 Table 4. Undesirable changes in a food product 23 Table 5."}, {"url": "http://www.wikihow.com/Choose-Coffee-for-Health-Benefits", "passage_text": "1 Check the packaging to ensure the coffee has been grown without the use of pesticides or herbicides. 2  Typically organic beans are grown in the shade and can thrive without chemical assistance. 3  If possible, opt for whole bean organic coffee because you are more likely to receive a purer product. 1. Go for organic coffee beans. As with any food, the best way to get the cleanest product is to go for the organic brand. Numerous leading coffee companies offer an organic variety, most likely being offered in both whole bean and pre-ground varieties."}, {"url": "https://www.organicfacts.net/organic-products/organic-food/organic-coffee.html", "passage_text": "Organic Coffee is a coffee that is grown without using any synthetic fertilizers or pesticides, on a land that was given sufficient time to detoxify itself, without the aid of any genetically modified organisms and finally processed and packed without the involvement of any chemical. Organic Bird-Friendly Coffee: This is almost same as Organic Shade-Grown Coffee, with the difference that this is particularly concerned with preserving the natural habitat of birds. Organic Kona Coffee: This Organic Kona Coffee is grown on fertile volcanic soil of the Kona region in Hawaii. Organic Kona Coffee is produced in farms that do not use chemical fertilizers and chemical pesticides"}, {"url": "https://en.wikipedia.org/wiki/Fair_trade_coffee", "passage_text": "Fair trade coffee is coffee that is certified as having been produced to fair trade standards. Fair trade organisations create trading partnerships that are based on dialogue, transparency and respect, that seeks greater equity in international trade. "}, {"url": "https://en.wikipedia.org/wiki/Coffee", "passage_text": "Coffee is a brewed drink prepared from roasted coffee beans, which are the seeds of berries from the Coffea plant. Coffee plants are cultivated in over 70 countries, primarily in the equatorial regions of the Americas, Southeast Asia, India, and Africa. Coffee is one of the most popular drinks in the world. It can be prepared and presented in a variety of ways (e.g., espresso, cappuccino, cafe latte, etc.). It is usually served hot, although iced coffee is also served."}, {"url": "http://camanoislandcoffee.com/coffee-questions/", "passage_text": "We carry Light Roasted, Medium Roasted, and Dark Roasted Coffees. The primary difference is a balance between tasting the natural coffee flavor (light roast) and tasting the roast (dark roast). Everyone has a preference and we make sure to have a coffee for each preference. We do not over roast any of our coffee. Typically, due to the quality of the coffee and the rarity of that specific bean, we are only able to bring in a certain amount and cannot guarantee we will always have it in stock. Roaster’s Reserve is our most expensive coffee. All of the single origins are equal. Just depends on your tastes."}]