[{"url": "http://www.webmd.com/first-aid/tc/carbon-monoxide-poisoning-topic-overview", "passage_text": "Carbon monoxide poisoning happens when you breathe too much carbon monoxide. Carbon monoxide is a gas produced by burning any type of fuel-gas, oil, kerosene, wood, or charcoal. What makes this gas so dangerous is that when you breathe it, it replaces the oxygen in your blood. Without oxygen, cells throughout the body die, and the organs stop working. "}, {"url": "http://www.health.state.mn.us/divs/eh/indoorair/co/", "passage_text": "Carbon Monoxide (CO) Poisoning in Your Home. Carbon monoxide (CO) is an odorless, colorless gas often formed in the process of incomplete combustion of organic substances, including fuels. It is dangerous because it interferes with normal oxygen uptake for humans and other living organisms needing oxygen to live. Make sure that all your fuel burning appliances and heating devices are properly vented and maintained. Know the symptoms of CO poisoning. Finally, to detect potentially deadly conditions, install and maintain CO alarms in your home in accordance with Minnesota's CO alarm law."}, {"url": "https://www.floridacitygas.com/safety/carbon-monoxide", "passage_text": "Proper Ventilation Carbon monoxide is an invisible, odorless gas that can cause illness and even death when not properly vented by your furnace or appliances. Carbon monoxide comes from the incomplete combustion of common fuels such as heating oil, gasoline, coal, wood, charcoal, kerosene, propane and natural gas. "}, {"url": "http://www.emedicinehealth.com/carbon_monoxide_poisoning/article_em.htm", "passage_text": "Carbon monoxide poisoning can cause brain damage and death. You can't see it, smell it, or taste it; but carbon monoxide can kill you. 1  Carbon monoxide is odorless, tasteless, and colorless gas is known as the silent killer.. 2  Carbon monoxide is produced by common household appliances. 1 Carbon monoxide is odorless, tasteless, and colorless gas is known as the silent killer.. 2  Carbon monoxide is produced by common household appliances. 3  When not properly ventilated, carbon monoxide emitted by these appliances can build up."}, {"url": "http://www.webmd.com/children/prevent-carbon-monoxide-poisoning", "passage_text": "An odorless and colorless gas causes carbon monoxide poisoning and it can be deadly. But carbon monoxide (CO) poisoning can be prevented. Burning any fuel produces carbon monoxide. This means any fuel-burning appliance in your home is a potential source. If you have any of these symptoms -- and if you feel better when you go outside your home but the symptoms reappear once you're back inside -- you may have carbon monoxide poisoning. If carbon monoxide poisoning is known or suspected: 1  Get out of the building or car where the carbon monoxide is present. 2  Keep still."}, {"url": "https://en.wikipedia.org/wiki/Carbon_monoxide_poisoning", "passage_text": "Carbon monoxide poisoning. Carbon monoxide poisoning occurs after enough inhalation of carbon monoxide (CO). Carbon monoxide is a toxic gas, but, being colorless, odorless, tasteless, and initially non-irritating, it is very difficult for people to detect. Carbon monoxide is a product of incomplete combustion of organic matter due to insufficient oxygen supply to enable complete oxidation to carbon dioxide (CO 2). Carbon monoxide can also have severe effects on the fetus of a pregnant woman. Chronic exposure to low levels of carbon monoxide can lead to depression, confusion, and memory loss. Carbon monoxide mainly causes adverse effects in humans by combining with hemoglobin to form carboxyhemoglobin (HbCO) in the blood."}, {"url": "http://www.asgsecurity.com/asg-security-blog/what-causes-carbon-monoxide-leaks-in-the-home.html", "passage_text": "On that note, here is some important information on what causes carbon monoxide leaks. CO is actually a byproduct of incomplete combustion, meaning that it is produced when a gas or oil appliance malfunction allows it to leak through. "}, {"url": "http://www.mayoclinic.org/diseases-conditions/carbon-monoxide/basics/causes/CON-20025444", "passage_text": "Causes. Carbon monoxide poisoning is caused by inhaling combustion fumes. When too much carbon monoxide is in the air you're breathing, your body replaces the oxygen in your red blood cells with carbon monoxide. This prevents oxygen from reaching your tissues and organs. Normally the amount of carbon monoxide produced by these sources isn't cause for concern. But if they're used in a closed or partially closed space — such as using a charcoal grill indoors — the carbon monoxide can build to dangerous levels. Smoke inhalation during a fire also can cause carbon monoxide poisoning."}, {"url": "http://www.extension.iastate.edu/Pages/communications/CO/co1.html", "passage_text": "Carbon monoxide is a by-product of combustion, present whenever fuel is burned. It is produced by common home appliances, such as gas or oil furnaces, gas refrigerators, gas clothes dryers, gas ranges, gas water heaters or space heaters, fireplaces, charcoal grills, and wood burning stoves. Carbon monoxide (CO) is a colorless, odorless deadly gas. Because you can't see, taste, or smell it, carbon monoxide can kill you before you know it's there. Everyone is at risk for carbon monoxide poisoning."}]