[{"url": "https://en.wikipedia.org/wiki/Netball", "passage_text": "Netball is a ball sport played by two teams of seven players. Its development, derived from early versions of basketball, began in England in the 1890s. Indoor netball is a variation of netball, played exclusively indoors, in which the playing court is surrounded on each side and overhead by a net. The net prevents the ball from leaving the court, permitting faster play by reducing playing stoppages. Different forms of indoor netball exist."}, {"url": "http://www.answers.com/Q/What_is_the_height_a_netball_ring", "passage_text": "the normal height of netball hoop is 3.05 metres (10 feet) for an adult but may be lower for young players; a common setting is 2.4 metres for 10 years and under. + 212 others found this useful. A normal netball hoop if 10ft (3.05 meters) and for younger children (netta players) usually 10 years and under the height is 8 ft (2.4 meters). 9 people"}, {"url": "http://www.answers.com/Q/Height_of_a_netball_hoop", "passage_text": "Answer by Pengotoxoph. Confidence votes 273. the normal height of netball hoop is 3.05 metres (10 feet) for an adult but may be lower for young players; a common setting is 2.4 metres for 10 years and under. Minor edit? What is the height of a netball hoop for a 7 year old in South Africa? The height of a netball for a 7-year old would be the same that it  is for ages 8 to 10 years of age, which would be 8 feet high."}, {"url": "http://netball.com.au/our-game/court-venue-specifications/", "passage_text": "Court Specifications. These court measurements form part of the current Official Rules (dated 2001) of the International Federation of Netball Associations. The 3.05m run off clear space outside each side line and end line is a Netball Australia rule introduced to ensure safety of players and umpires. "}, {"url": "http://www.netballamerica.com/about-netball/what-is-netball/", "passage_text": "1 Netball posts are the same height as Basketball posts (10 feet), however the goal ring is smaller in diameter. 2  A Netball is smaller and lighter than a Basketball (similar to a size 5 soccer ball, however with a grip of a volleyball). 3  Netball goal rings do not have a backboard. 1 Female Netball players usually wear skirts or dresses to play the game. 2  A Netball court measures 100′ long by 50′ wide (as compared to a regulation NBA basketball court which is 96′ long by 50′ wide). 3 "}, {"url": "http://internationalnetball.com/netball_rules.html", "passage_text": "Ball and Ring. The ball used in netball is the hybrid of a basketball and a soccer ball. The regulation netball size is a little smaller than the basketball, and is also lighter and somewhat softer. The rings have the same dimension as basketball rings, but they do not have a backboard. When the ball goes out of bounds, a throw in is given to the player of the other team closest to where the ball went out of the court. The player must stand up to the line and throw the ball within 3 seconds. Netball officials are two umpires, two scorers and two timekeepers."}, {"url": "http://www.answers.com/Q/What_is_the_height_a_netball_ring", "passage_text": "What is the height of a netball post for 11? 10 years and under play with 2.4 metre high hoops; 13 years and over play with 3.05 metre (8 feet) hoops, but 11 & 12 year olds sometimes play with 2.4 metres, 2.6 metres or 3 … .05 metres, depending on local rules. At least that is what happens in New Zealand. A normal netball hoop if 10ft (3.05 meters) and for younger children (netta players) usually 10 years and under the height is 8 ft (2.4 meters). 9 people found this useful."}]