[{"url": "http://www.cancer.org/cancer/cancercauses/othercarcinogens/generalinformationaboutcarcinogens/known-and-probable-human-carcinogens", "passage_text": "Introduction. Many people worry that substances or exposures in their environment may cause cancer. As part of the American Cancer Society's role in informing and educating people about cancer and its possible causes, this document provides lists of substances and exposures that are known or suspected to cause cancer. In many cases, carcinogens are first found to cause cancer in lab animals and are later found to cause cancer in people. Most studies of potential carcinogens expose the lab animals to doses that are much higher than common human exposures."}, {"url": "http://www.answers.com/Q/What_does_carcinogenic_mean", "passage_text": "An agent known to cause cancer; a cancer-producing substance. carcinogenic-a carcinogen is a chemical known or believed to cause cancer in mammals. Some chemicals are proven carcinogens, but many more are suspected to be carcinogenic. carcinogenic-a substance that has the capability of causing cancer. A carcinogen is any chemical known to cause cancer, there are a great many number of items known to have carcinogens present in them. Examples include paint, cigaretes, and mo … re. It also applies to certain types of radiation"}, {"url": "https://en.wikipedia.org/wiki/Carcinogen", "passage_text": "A carcinogen is any substance, radionuclide, or radiation that is an agent directly involved in causing cancer. This may be due to the ability to damage the genome or to the disruption of cellular metabolic processes. After the carcinogen enters the body, the body makes an attempt to eliminate it through a process called biotransformation. The purpose of these reactions is to make the carcinogen more water-soluble so that it can be removed from the body."}, {"url": "https://en.wikipedia.org/wiki/Carcinogen", "passage_text": "Several radioactive substances are considered carcinogens, but their carcinogenic activity is attributed to the radiation, for example gamma rays and alpha particles, which they emit. Common examples of non-radioactive carcinogens are inhaled asbestos, certain dioxins, and tobacco smoke. After the carcinogen enters the body, the body makes an attempt to eliminate it through a process called biotransformation. The purpose of these reactions is to make the carcinogen more water-soluble so that it can be removed from the body."}, {"url": "https://en.wikipedia.org/wiki/Carcinogen", "passage_text": "Co-carcinogens are chemicals that do not necessarily cause cancer on their own, but promote the activity of other carcinogens in causing cancer. After the carcinogen enters the body, the body makes an attempt to eliminate it through a process called biotransformation. The purpose of these reactions is to make the carcinogen more water-soluble so that it can be removed from the body."}, {"url": "http://www.definitions.net/definition/carcinogen", "passage_text": "Carcinogen. A carcinogen is any substance, radionuclide, or radiation that is an agent directly involved in causing cancer. This may be due to the ability to damage the genome or to the disruption of cellular metabolic processes. Several radioactive substances are considered carcinogens, but their carcinogenic activity is attributed to the radiation, for example gamma rays and alpha particles, which they emit. Common examples of non-radioactive carcinogens are inhaled asbestos, certain dioxins, and tobacco smoke."}, {"url": "http://www.cancer.org/cancer/cancercauses/othercarcinogens/generalinformationaboutcarcinogens/known-and-probable-human-carcinogens", "passage_text": "Substances and exposures that can lead to cancer are called carcinogens. Some carcinogens do not affect DNA directly, but lead to cancer in other ways. For example, they may cause cells to divide at a faster than normal rate, which could increase the chances that DNA changes will occur. In many cases, carcinogens are first found to cause cancer in lab animals and are later found to cause cancer in people. Most studies of potential carcinogens expose the lab animals to doses that are much higher than common human exposures."}]