[{"url": "https://www.zocdoc.com/answers/4078/how-does-alcohol-affect-stomach-bloating", "passage_text": "Alcohol consumption can cause a sensation of bloating or fullness in two potential way. First, most types of alcohol, especially beer, contain large amounts of carbohydrate calories. So, heavy drinking is essentially the same as have a very large liquid meal. "}, {"url": "http://www.healthline.com/symptom/abdominal-swelling", "passage_text": "Symptoms of lactose intolerance include abdominal bloating and gas, which can cause your abdomen to swell. If you experience a swollen abdomen within two hours of ingesting dairy, you might be lactose intolerant. Also, consider eating more slowly to give your food time to be processed by your stomach. If your abdomen is swollen because of gas, try avoiding foods that are known to cause gas, such as beans and cruciferous vegetables like broccoli and cabbage. Avoid drinking carbonated drinks and drinking out of a straw."}, {"url": "http://www.progressivehealth.com/edema-alcohol.htm", "passage_text": "The fluid tends to accumulate in the hands and feet because it travels downwards. If you experience swelling in your feet after drinking alcoholic beverages, consult with your health care provider immediately as it may be a symptom of liver damage. Initially, alcohol acts like a diuretic, which can cause dehydration. The salty snack that you might consume while drinking alcohol may also contribute to swelling in hands. Long-term alcohol drinking may cause severe and dangerous fluid retention in the abdomen, known as ascites. If you drink excessively, you might develop a much more severe type of fluid retention, known as ascites. This condition is caused by cirrhosis of the liver. While the ascitic fluid usually develops in the abdomen, it may also cause swelling in the legs and feet."}, {"url": "http://www.livestrong.com/article/526475-can-drinking-alcohol-cause-your-body-to-become-swollen/", "passage_text": "Drink Moderately to Avoid Swelling. When you drink alcohol, it results in a widening of your blood vessels, including those in your face. The widened blood vessels can lead to a swollen, puffy appearance, and can turn your face red. Over time, your facial blood vessels can burst, which causes the red color to be permanent. Alcohol consumption also leads to dehydration, which can cause you to become bloated."}, {"url": "http://www.healthgrades.com/conditions/alcoholic-liver-disease", "passage_text": "Seek prompt medical care if you drink alcohol and experience any of the following symptoms, including pain or swelling in your abdomen or legs, dry mouth and excessive thirst, skin color changes, nosebleeds, bleeding gums, constant fatigue, nausea, loss of appetite, unexplained weight loss, or yellow skin or eyes. Find a Gastroenterologist Near You. Symptoms of alcoholic liver disease include abdominal pain, tenderness, jaundice (yellowing of the skin and whites of the eyes), fatigue, and nausea. After cirrhosis has developed, fluid buildup (edema) in the legs and fluid collection in the abdomen (ascites) are common."}, {"url": "http://www.livestrong.com/article/526475-can-drinking-alcohol-cause-your-body-to-become-swollen/", "passage_text": "Drinking alcohol excessively can lead to a variety of side effects, including one that might alter the image you see when you look in the mirror. In addition to mood changes, weight gain and liver damage, drinking alcohol can also cause your body's tissues to become swollen, leading to a change in your appearance. When you drink alcohol, it results in a widening of your blood vessels, including those in your face. The widened blood vessels can lead to a swollen, puffy appearance, and can turn your face red. Over time, your facial blood vessels can burst, which causes the red color to be permanent. Alcohol consumption also leads to dehydration, which can cause you to become bloated."}, {"url": "http://www.healthline.com/symptom/abdominal-swelling", "passage_text": "Eating smaller meals can help prevent this problem in the future. Also, consider eating more slowly to give your food time to be processed by your stomach. If your abdomen is swollen because of gas, try avoiding foods that are known to cause gas, such as beans and cruciferous vegetables like broccoli and cabbage. Avoid drinking carbonated drinks and drinking out of a straw."}, {"url": "http://www.healthline.com/symptom/abdominal-bloating", "passage_text": "The symptoms of bloating can be vague and difficult to pinpoint, but most people describe an uncomfortable feeling of fullness, tightness, or swelling in the abdomen. This can be accompanied by pain, excessive gas (flatulence), frequent burping or belching, and abdominal rumbling or gurgles. "}, {"url": "http://www.buzzle.com/articles/alcohol-and-bloating.html", "passage_text": "A major reason behind alcohol-related bloating is the consumption of alcohol in large quantities (binge drinking) and after a long gap of time. The toxins and wheat or grain ingredients that alcoholic beverages contain, can cause the rapid loss of electrolytes from the body. Advertisement. A distended or bloated stomach is a common abdominal problem that can be caused due to consumption of alcohol. Bloating may occur due to the ingredients contained in alcohol and the food consumed before or while drinking the same."}]