[{"url": "http://www.babynamespedia.com/meaning/Kelvin", "passage_text": "kel-vin, ke-lv-in ] The baby boy name Kelvin is pronounced as K EH LVihN †. Kelvin has its origins in the Scottish language and it is used largely in English. The first name is derived from the English surname, itself of the name of the Scottish river named Kelvin, which is of the Gaelic meaning 'narrow water'. Kelvin is rather popular as a baby boy name. The name grew in popularity from the 1940s up to the 1960s; prior to that, it was of only very light use. Its usage peaked modestly in 1963 with 0.064% of baby boys being named Kelvin. It had a ranking of #210 then. The baby name has dropped in popularity since then."}, {"url": "https://answers.yahoo.com/question/index?qid=20071212045641AA7P0iD", "passage_text": "This is the basis for the Kelvin scale after Lord Kelvin (1824-1907). The Kelvin scale begins at absolute zero. Each degree on the scale is exactly the same size as a degree centigrade and 0 degrees Kelvin = -273 C. Therefore to convert between the two we have K = C + 273. Source(s): I am a retired research meteorologist, Ph.D, with some 45+ years experience."}, {"url": "http://www.sheknows.com/baby-names/name/kelvin", "passage_text": "Celtic Meaning: The name Kelvin is a Celtic baby name. In Celtic the meaning of the name Kelvin is: From the narrow river. Gaelic Meaning: The name Kelvin is a Gaelic baby name. In Gaelic the meaning of the name Kelvin is: From the narrow river. American Meaning: The name Kelvin is an American baby name. In American the meaning of the name Kelvin is: From the narrow river. English Meaning: The name Kelvin is an English baby name. In English the meaning of the name Kelvin is: River man. From Old English words 'ship' and 'friend'. "}, {"url": "http://www.thinkbabynames.com/meaning/1/Kelvin", "passage_text": "Kelvin /kel-vin/ [2 sylls.] as a boys' name is pronounced KEL-vin. It is of English origin, and the meaning of Kelvin is friend of ships. Also possibly a place name referring to a river. Kreatif forms: Keivin, Kelvinna, Kelvinne. Kelvin is a very prominent first name for males (#358 out of 1220, Top 29%) and a slightly less prominent surname for both adults and children (#89172 out of 150436, Top 59%). (2000 U.S. Census). Charted below is the baby name popularity of Kelvin for boys."}, {"url": "https://en.wikipedia.org/wiki/Kelvin", "passage_text": "The Kelvin scale is an absolute, thermodynamic temperature scale using as its null point absolute zero, the temperature at which all thermal motion ceases in the classical description of thermodynamics. The kelvin is defined as the fraction 1⁄273.16 of the thermodynamic temperature of the triple point of water (exactly 0.01 °C or 32.018 °F). In other words, it is defined such that the triple point of water is exactly 273.16 K."}, {"url": "https://answers.yahoo.com/question/index?qid=20071212045641AA7P0iD", "passage_text": "The kelvin (symbol: K) is a unit increment of temperature and is one of the seven SI base units. The Kelvin scale is a thermodynamic (absolute) temperature scale where absolute zero — the coldest possible temperature — is zero kelvins (0 K). The Kelvin scale begins at absolute zero. Each degree on the scale is exactly the same size as a degree centigrade and 0 degrees Kelvin = -273 C. Therefore to convert between the two we have K = C + 273. Source(s): I am a retired research meteorologist, Ph.D, with some 45+ years experience."}, {"url": "https://en.wikipedia.org/wiki/Kelvin", "passage_text": "In 1848, Lord Kelvin wrote in his paper, On an Absolute Thermometric Scale, of the need for a scale whereby infinite cold (absolute zero) was the scale's null point, and which used the degree Celsius for its unit increment. The kelvin is defined as the fraction 1⁄273.16 of the thermodynamic temperature of the triple point of water (exactly 0.01 °C or 32.018 °F). In other words, it is defined such that the triple point of water is exactly 273.16 K."}, {"url": "https://en.wikipedia.org/wiki/Kelvin", "passage_text": "The kelvin is a unit of measure for temperature based upon an absolute scale. It is one of the seven base units in the International System of Units (SI) and is assigned the unit symbol K. The kelvin is defined as the fraction 1⁄273.16 of the thermodynamic temperature of the triple point of water (exactly 0.01 °C or 32.018 °F). In other words, it is defined such that the triple point of water is exactly 273.16 K."}, {"url": "https://answers.yahoo.com/question/index?qid=20071212045641AA7P0iD", "passage_text": "Best Answer: Kelvin is a SI base unit for measuring temperature. The weather forecast (depending on where you live) will use Celsius or Fahrenheit, but in science we prefer to use Kelvin. The symbol for Kelvin is K and does not, typically, use the degree symbol ... IE you say 310K not 310°K The zero point for Kelvin is sometimes referred to as 'absolute zero'. The Kelvin scale begins at absolute zero. Each degree on the scale is exactly the same size as a degree centigrade and 0 degrees Kelvin = -273 C. Therefore to convert between the two we have K = C + 273. Source(s): I am a retired research meteorologist, Ph.D, with some 45+ years experience."}, {"url": "http://www.urbandictionary.com/define.php?term=Kelvin", "passage_text": "Kelvin. If you look into his eyes, you can see a passion, a sincerity which has yet to be known or understood by people. He posses a beautiful soul and his outer attractiveness is a mirror reflection of just how beautiful he is on the inside. "}]