[{"url": "http://www.kumc.edu/Documents/osa/HowtoPrepareyourCurriculumVitae.doc", "passage_text": "How to Prepare your Curriculum Vitae. While you may not have yet had the experience of preparing a formal CV (course of life), you are already familiar with its function and the type of information needed from your applications for employment, college, or for that matter, medical school. "}, {"url": "http://blogs.edweek.org/edweek/global_learning/2013/05/students_as_professionals_prepare_learners_for_the_global_workforce.html", "passage_text": "As most schools in the country are working to align curriculum with the new Common Core State Standards, which focus on college and career readiness, it makes sense to explore what teachers might do right away to prepare students for the world of work. "}, {"url": "http://www.debate.org/opinions/does-school-really-prepare-students-for-adult-life", "passage_text": "School does prepare you for the future. School prepares you for the future because it teaches you how to become an everyday worker. Think of it this way, your boss doesn't want you slacking and not doing your work in a everyday environment. No it does not. I am a seventh grade student right now and let me just tell you that school does NOT prepare us for adult life. Honestly they should be teaching us how to balance a checkbook, pay taxes, pay the bills and all that other stuff. And what doesn't help with all of this is common core."}, {"url": "http://www.washington.edu/doit/its-your-career-work-based-learning-opportunities-college-students-disabilities", "passage_text": "Its-Your-Career-Work-Based-Learning-Opportunities-College-Students-Disabilities.pdf. How Students Can Prepare for Career Success. Most students expect to work after college graduation, but the fact is that it takes the average college graduate three to six months to secure employment after earning a degree. Career planning and preparation should occur throughout your college studies. A college student with a disability: 1  Register with campus work-based learning programs, such as career services and cooperative education, so they can notify you of opportunities. 2  Participate in available orientations, seminars, workshops, and individual counseling sessions to enhance your job search skills."}, {"url": "http://www.educationworld.com/a_curr/five-ways-to-better-prepare-students-for-careers.shtml", "passage_text": "5. Round Out the Curriculum. There is no one magic solution that will prepare students today for tomorrow’s workforce, but giving them a well-rounded education including arts; Science, Technology, Engineering and Math (STEM); history and communications courses can help. “STEM is integral to solving practical problems, but STEM alone is not enough."}, {"url": "http://dailyedventures.com/index.php/2012/07/16/kristian/", "passage_text": "The Dutch government must not only focus on results but also assess children in order to better respond to the social demands of the 21st century. Today’s curriculum does not fully prepare students to live and work in an information-age society. Innovate in the classroom, help your students build the skills they need for the future—such as problem solving, critical thinking, collaboration, and creativity—with Partners in Learning."}, {"url": "http://www.edutopia.org/blog/prepare-students-challenges-of-tomorrow-judy-willis", "passage_text": "6. The most important manual that you can share with your students is the owner's manual to their own brains. When they understand how their brains take in and store information (PDF, 139KB), they hold the keys to successfully operating the most powerful tool they'll ever own. 1. Teach Collaboration as a Value and Skill Set. Students of today need new skills for the coming century that will make them ready to collaborate with others on a global level. Whatever they do, we can expect their work to include finding creative solutions to emerging challenges."}, {"url": "http://www.huffingtonpost.com/carol-j-carter/how-college-students-can-_2_b_3948927.html", "passage_text": "Before graduation, students need to know that a college degree might get you in the door for an interview and increase your earning potential, but it's only part of the employment equation. To land the job, employers aren't only looking at what you know; they want to know what you can do. Whether or not professional skills are taught in the class curriculum, students can treat each of their classes like it's their career to get the experiential learning they need to be prepared for the world of work. 1  1. Treat college as your job. 2  2. 3  3. Practice active listening skills during lectures. 4  4. Use group projects to practice leadership ..."}, {"url": "http://www.educationworld.com/a_curr/five-ways-to-better-prepare-students-for-careers.shtml", "passage_text": "For that reason, schools need to offer courses that will prepare students for wherever they are going in life -- and that means offering both college and career preparation. Further, kids need life skills like civics knowledge and the ability to balance a checkbook. There is no one magic solution that will prepare students today for tomorrow’s workforce, but giving them a well-rounded education including arts; Science, Technology, Engineering and Math (STEM); history and communications courses can help. “STEM is integral to solving practical problems, but STEM alone is not enough."}]