[{"url": "http://www.chooseresponsibility.org/legal_age_21/", "passage_text": "1 More lives have been saved in the last two years alone by safety belts and air bags than have been saved in the 22 years since the adoption of Legal Age 21. 2  In 2002, according to a NHTSA study, the largest number of alcohol-related traffic fatalities occurred among 21 year-olds, followed by 22 and 23 year-olds. Most Americans know that the drinking age in our nation is 21. But many people don't know much more. Here are some facts: 1  We don't have a national minimum drinking age-states are allowed to set the limit where they choose."}, {"url": "http://pubs.niaaa.nih.gov/publications/UnderageDrinking/UnderageFact.htm", "passage_text": "Youth ages 12 to 20 often binge drink. People ages 12 through 20 drink 11 percent of all alcohol consumed in the United States. 3 Although youth drink less often than adults do, when they do drink, they drink more. That is because young people consume more than 90 percent of their alcohol by binge drinking. Binge drinking is consuming many drinks on an occasion (see box). 1 By age 18, about 65 percent of teens have had at least 1 drink. 1. 2  In 2013, 8.7 million young people ages 12–20 reported that they drank alcohol beyond “just a few sips” in the past month. 2."}, {"url": "http://www.chooseresponsibility.org/legal_age_21/", "passage_text": "1 Twice as many 21 year olds as 18 year-olds were involved in alcohol-related traffic fatalities in that year. 2  Legal Age 21 has postponed fatalities-not reduced them-because every claim of an 18, 19, or 20 year-old life saved as a result of Legal Age 21 is offset by the number of 21, 22, or 23 year-old lives lost. Most Americans know that the drinking age in our nation is 21. But many people don't know much more. Here are some facts: 1  We don't have a national minimum drinking age-states are allowed to set the limit where they choose."}, {"url": "http://grsp.drupalgardens.com/sites/grsp.drupalgardens.com/files/ICAP%20report4.pdf", "passage_text": "I 2 wine at age 16. In Germany, a distinction is made as to whether the minor is under adult supervision. At16, a German can drink or purchase beer and wine if under the supervision of an adult; otherwise theminimum drinking and purchasing age is 18. In the Netherlands, one must be 18 years of age or 16 years ifaccompanied by an adult to purchase spirits, if accompanied by an adult. For beer and wine the MPA is 18. Peru 18 - Poland - 18 The MPA for alcoholic beverages (more than 4.5% alcohol by weight) is 18. There is no minimum purchasing age for beverages under 4.5%ABV."}, {"url": "http://www.madd.org/underage-drinking/why21/", "passage_text": "A person must wait until age 16 to start driving, age 18 to marry without parental consent, age 35 to become president, and so on. The age limit for alcohol is based on research which shows that young people react differently to alcohol. Teens get drunk twice as fast as adults, 9 but have more trouble knowing when to stop. Teens naturally overdo it and binge more often than adults. Enforcing the legal drinking age of 21 reduces traffic crashes, 4-6 protects young people’s maturing brains, 12,14 and keeps young people safer overall. History says no. When states had lower legal drinking ages in the U.S., the underage drinking problem was worse. 3 For example, before the 21 minimum legal drinking age was implemented by all states, underage drunk drivers were involved in over twice as many fatal traffic crashes as today. 3."}, {"url": "http://www.cdc.gov/alcohol/fact-sheets/minimum-legal-drinking-age.htm", "passage_text": "1 The prevalence of current drinking among persons aged 21 to 25 also declined significantly from 70% in 1985 to 56% in 1991, coincident with states’ adopting an age 21 minimum legal drinking age, but then increased to 60% by 1999. 1 Age 21 MLDA laws result in lower levels of alcohol consumption among young adults age 21 years and older as well as those less than age 21 years. 12. 2  States with more stringent alcohol control policies tend to have lower adult and college binge drinking rates. 3  6."}, {"url": "http://www.chooseresponsibility.org/legal_age_21/", "passage_text": "1 Legal Age 21 has postponed fatalities-not reduced them-because every claim of an 18, 19, or 20 year-old life saved as a result of Legal Age 21 is offset by the number of 21, 22, or 23 year-old lives lost. 2  The number of drunken driving fatalities tracks almost exactly, up or down, with the size of an age segment. Most Americans know that the drinking age in our nation is 21. But many people don't know much more. Here are some facts: 1  We don't have a national minimum drinking age-states are allowed to set the limit where they choose."}, {"url": "http://www.cdc.gov/alcohol/fact-sheets/minimum-legal-drinking-age.htm", "passage_text": "1 Current drinking during the previous month among persons aged 18 to 20 years declined significantly from 59% in 1985 to 40% in 1991, coincident with states’ adopting an age 21 minimum legal drinking age, but increased to 47% by 1999. 1 Age 21 MLDA laws result in lower levels of alcohol consumption among young adults age 21 years and older as well as those less than age 21 years. 12. 2  States with more stringent alcohol control policies tend to have lower adult and college binge drinking rates. 3  6."}, {"url": "http://www.madd.org/underage-drinking/why21/", "passage_text": "More than 25,000 lives 1,2 have been saved in the U.S. thanks to the 21 Minimum Legal Drinking Age. 10,11. This law continues to prevent tragedies—decreasing crashes by an estimated 16 percent 9 and keeping young people safer from many risks. History says no. When states had lower legal drinking ages in the U.S., the underage drinking problem was worse. 3 For example, before the 21 minimum legal drinking age was implemented by all states, underage drunk drivers were involved in over twice as many fatal traffic crashes as today. 3."}]