[{"url": "http://owic.oregonstate.edu/pacific-madrone-arbutus-menziesii", "passage_text": "Pacific madrone is one of the largest of about 14 species of Arbutus in the world, and one of the two Arbutus species in North America. Pacific madrone is a broadleaved evergreen tree and a member of the heath family (Ericaceae)."}, {"url": "http://extension.oregonstate.edu/gardening/native-madrones-are-special-northwest", "passage_text": "CORVALLIS, Ore. - Madrone, madrona, madrono, arbutus. Wherever you live along the Pacific coast and whatever it's called where you are, it's the same tree: Arbutus menziesii, with leathery evergreen leaves, red bark peeling from a tan trunk, whitish flowers and bright clusters of reddish-orange berries."}, {"url": "http://www.arbutusarts.com/madrone-tree.html", "passage_text": "While bright orange red, the Madrone tree berries are about the size of a small wild strawberry. The color stuck and Madrone or Arbutus Strawberry Tree it is. It grows from northern California north to southern British Columbia and is found mostly there on the BC Gulf Islands, ending at the Northern Gulf Islands."}, {"url": "http://www.arbutusarts.com/arbutus-tree.html", "passage_text": "The Arbutus tree or Madrone tree makes its crooked shapes because of how it has to cling to the rough terrain, rocks and fissures and also how it searches for sunlight bending around other trees or searching for optimum light exposure."}, {"url": "http://www.discoverlife.org/20/q?search=Arbutus+menziesii", "passage_text": "Pacific madrone (Arbutus menziesii) is one of the most widely distributed tree species native to the Pacific coast. Named for its discoverer, Archibald Menzies, a 19th century Scottish physician and naturalist, the species is called arbutus in Canada, and madrone, madronia, madroñia or madrono madroño In The. united states"}, {"url": "http://www.arbutusarts.com/madrone-tree.html", "passage_text": "The Madrone Tree or Madrona Tree gets its name from the Spanish word madrono (madroño which means strawberry...tree the Early spanish explorers named it after the similarities to A mediterranean). Variety In, canada it is known as The Arbutus. Tree The european, species while quite, different is also called A Strawberry. tree"}, {"url": "http://www.wagnermeters.com/wood-moisture-meter/working-with-madrone-wood/", "passage_text": "Americans refer to it as the Pacific Madrone Tree, or Madrona Tree. It is known in Canada as the Arbutus Tree. European species are called the Strawberry Tree. Regardless of moniker, wood lovers call it beautiful. The Pacific Madrone is named from the Spanish word meaning “strawberry”: madrono. madroño"}, {"url": "http://www.arbutusarts.com/arbutus-tree.html", "passage_text": "The Arbutus tree, also known as the Madrone tree or Madrona tree, technically is called Arbutus Menziesii. Sometimes it is referred to as Oregon Laurel or Laurelwood. Canadians seem to prefer Arbutus while Americans call it Madrone or Madrona."}]