[{"url": "http://www.catalogs.com/info/spirituality/Tree-of-life-symbol.html", "passage_text": "4.0 / 5.0. The Tree of Life is a universal symbol found in many spiritual traditions. It stands for many things, including wisdom, protection, strength, bounty, beauty, and redemption. This image is symbolic of the Creator as it sustains creation with its abundant fruit, protection and regeneration. "}, {"url": "https://en.wikipedia.org/wiki/Tree_of_life", "passage_text": "The concept of a tree of life has been used in biology, religion, philosophy, and mythology. A tree of life is a common motif in various world theologies, mythologies, and philosophies. It alludes to the interconnection of all life on our planet and serves as a metaphor for common descent in the evolutionary sense. The term tree of life may also be used as a synonym for sacred tree. "}, {"url": "http://www.answers.com/Q/What_does_the_Tree_of_Life_represent", "passage_text": "According to Genesis, God planted two trees in the Garden of Evil. One-the Tree of the Knowledge of Good and Evil is what is described above. The other is the Tree of Life.. In Judaism, the Hebrew term for the latter is Eitz Chaim.. This phrase is also found in the Book of Proverbs, where it is associated with wisdom and calmness. The Tree of Life was in the garden of Eden. When Adam and Eve ate from it, it gave them the power to live eternally. Which is why they weren't allowed to eat from it when they sinned. that way they wouldn't live eternally in sin and basically be screwed. It says in the bible that the Treee of Life will be in heaven"}, {"url": "http://www.gotquestions.org/tree-of-life.html", "passage_text": "Answer: The tree of life, referred to in Genesis, is the symbol of God s provision for immortality in the Garden of Eden. And the Lord God made all kinds of trees grow out of the ground trees that were pleasing to the eye and good for food. In the middle of the garden were the tree of life and the tree of the knowledge of good and evil (Genesis 2:9)."}, {"url": "http://lifehopeandtruth.com/life/what-is-the-meaning-of-life/the-tree-of-life/", "passage_text": "Next we read, “The tree of life was also in the midst of the garden, and the tree of the knowledge of good and evil” (verse 9). The Bible does not say that these were not trees that produced fruit that could be used as food. The tree of life! What a poetic, almost romantic name for a tree. It fires the imagination and produces wonderful images of energy, health, a bright future and good times. The tree of life may call to mind man’s quest for the proverbial fountain of youth, with the promise of never-ending joy and happiness."}, {"url": "http://www.artof4elements.com/entry/43/tree-of-life", "passage_text": "The Tree of Life that is in the centre of Kabbalah’s symbolism can be studied as a complex formula of existence, the flow of creation from the Divine to Earth and back to the Divine. It is the Tree of Life and Knowledge, a magical key to how life manifests itself. "}, {"url": "http://www.christian-faith.com/meaning-tree-life/", "passage_text": "And out of the ground the Lord God made every tree grow that is pleasant to the sight and good for food. The tree of life. was also in the midst of the garden, and the tree of the knowledge of good and evil. (Genesis 2:9). I have experienced God’s miracles and I have no doubt that the story related in the book of Genesis literally happened. What we need to do is get to the signification of those trees, and understand what they represent for us. today. God told Adam not to eat from the Tree of the Knowledge of Good and Evil, with the words, For on the day that you eat. of it, you will surely die."}, {"url": "http://www.universeofsymbolism.com/tree-of-life-meaning.html", "passage_text": "Tree of Life symbols and what they represent. . . The symbols of the tree of life are comprised of all the aspects of the tree itself and what those elements mean. You have the roots, the trunk, branches, leaves, and all types of fruit coming from the same tree. The tree of life meaning symbolizes many nurturing aspects of life. In its branches, it symbolizes reaching out to accept the nourishment of the sun. In its leaves, it captures that nourishment and cherishes it through transformation into life giving food."}]