[{"url": "http://www.endocrineweb.com/conditions/thyroid/how-your-thyroid-works", "passage_text": "The function of the thyroid gland is to take iodine, found in many foods, and convert it into thyroid hormones: thyroxine (T4) and triiodothyronine (T3). Thyroid cells are the only cells in the body which can absorb iodine. These cells combine iodine and the amino acid tyrosine to make T3 and T4. "}, {"url": "http://www.livestrong.com/article/474661-what-are-the-functions-of-iodine-in-the-body/", "passage_text": "Although your body needs only small amounts of iodine, its role in your body is anything but small. Iodine is critical for the production of your thyroid hormone, which has many important roles. Iodine may have other key roles in the body, although these are not yet fully understood. Your thyroid gland produces two hormones, triiodothyronine, or T3, and thyroxine, or T4. According to the Institute of Medicine, iodine makes up about 59 percent of T3 and 65 percent of T4 by weight."}, {"url": "http://www.livestrong.com/article/474661-what-are-the-functions-of-iodine-in-the-body/", "passage_text": "Iodine and Your Thyroid. Your thyroid gland produces two hormones, triiodothyronine, or T3, and thyroxine, or T4. According to the Institute of Medicine, iodine makes up about 59 percent of T3 and 65 percent of T4 by weight. Iodine may have other key roles in the body, although these are not yet fully understoo"}, {"url": "http://getfit.jillianmichaels.com/iodines-major-function-body-1890.html", "passage_text": "Iodine is a trace element found in oceans, the soil and within your body. One major function of the iodine in your body is to convert the food you eat into energy you can use to carry out daily functions. Iodine is also crucial for normal thyroid function. About 70 to 80 percent of the iodine in your body is contained within the thyroid gland in your neck. The rest is spread throughout your body. If your body is too low in iodine, you may develop low thyroid hormone levels, or hypothyroidism"}, {"url": "http://www.healthy-eating-support.org/healthy-eating-minerals-11.html", "passage_text": "Vital to thyroid function. The trace mineral, iodine, is a vital component of hormones produced by the thyroid gland that are responsible for a number of important functions in your body, including growth, metabolism, reproduction, nerve and muscle function, regulation of body temperature and blood cell production. "}, {"url": "http://www.answers.com/Q/What_is_the_function_of_iodine_in_body", "passage_text": "the body uses iodine for starch and the sugar and glucose...   Your thyroid gland, which is located in your neck, needs iodine to make thyroid hormones. These hormones cont … rol your body's growth and metabolism and are important for the development of the brain in babies and young children. Iodine is necessary for the body's thyroid gland to function normally in producing the thyroid hormone that controls metabolism and growth."}, {"url": "http://getfit.jillianmichaels.com/iodines-major-function-body-1890.html", "passage_text": "Significance. About 70 to 80 percent of the iodine in your body is contained within the thyroid gland in your neck. The rest is spread throughout your body. If your body is too low in iodine, you may develop low thyroid hormone levels, or hypothyroidism"}, {"url": "http://www.thyroid.org/iodine-deficiency/", "passage_text": "Iodine Deficiency. Iodine is an element that is needed for the production of thyroid hormone. The body does not make iodine, so it is an essential part of your diet. Iodine is found in various foods (see Table 1). If you do not have enough iodine in your body, you cannot make enough thyroid hormone. "}, {"url": "http://health.howstuffworks.com/wellness/food-nutrition/vitamin-supplements/iodine.htm", "passage_text": "Iodine is a mineral known to be important for thyroid function. However, doctors are rarely taught how important adequate iodine intake is. The thyroid gland affects a huge list of functions in the body, and iodine is needed for proper thyroid function. Along with thyroid function, iodine is important for a whole host of reasons. Iodine is a mineral similar to calcium and magnesium. It is associated with the ocean and is found in large amounts in seaweed. It is also found in other plants and animals from the sea."}]