[{"url": "http://chavin-and-olmec-culture.weebly.com/invention-and-arts1.html", "passage_text": "Perhaps most notable of the Olmec inventions was the calendar. The ancient Olmecs implemented a 260-day sacred calendar as well as a 365-day solar calendars."}, {"url": "http://www.burdosclassroom.org/worldhistorywiki/index.php?title=Olmecs", "passage_text": "The Olmecs are known as one of the earliest American Civilizations. The emerged along tropical forests around the Mexican Gulf Coast. The civilization of the Olmecs lasted about 900 years (1400 B.C. through 500 B.C.). The Olmecs originated at a base within San Lorenzo Tenochtitlan, tenochtitlán Where olmec artifacts seem most. Abundant the rise of civilization was help by the local, environment such; as the rich soil and flowing. rivers"}, {"url": "http://www.ancient.eu/Olmec_Civilization/", "passage_text": "The mysterious Olmec civilization prospered in Pre-Classical (Formative) Mesoamerica from c. 1200 BCE to c. 400 BCE and is generally considered the forerunner of all subsequent Mesoamerican cultures such as the Maya and Aztecs."}, {"url": "http://mvolmecs.tripod.com/invent.html", "passage_text": "Next, the Olmec created a complex drainage system. These inventions helped the Olmec survive. In addition to their inventions, they also understood many things in life, such as the concept of zero ,linear time, and gravity. Using their knowledge, they achieved many feats."}, {"url": "http://www.visionlaunch.com/olmec-inventions-and-accomplishments/", "passage_text": "Living around the Gulf of Mexico for nearly 1,000 years, the Olmec civilization was a major influence on the region up until 300 BC. They are often considered the first ordered civilization in the Americas and are thought to have even influenced the Mayans and the Aztecs."}, {"url": "http://www.visionlaunch.com/olmec-inventions-and-accomplishments/", "passage_text": "Tweet on Twitter. Living around the Gulf of Mexico for nearly 1,000 years, the Olmec civilization was a major influence on the region up until 300 BC. They are often considered the first ordered civilization in the Americas and are thought to have even influenced the Mayans and the Aztecs."}]