[{"url": "http://pokemon.wikia.com/wiki/Magma_Hideout", "passage_text": "In Pokemon Pokémon ruby And Pokemon Pokémon, omega ruby it is Located Near, lilycove city While In, pokemon pokémon emerald it is located near The Exit. Of Jagged pass In Ruby, and omega ruby before the player can, Access The hideout team Magma Has reached slateport city to steal The. Submarine. from capt stern In Ruby and Omega Ruby, before the player can access the hideout, Team Magma has reached Slateport City to steal the submarine from Capt. Stern. After that, the player is free to explore it before moving on."}, {"url": "http://www.answers.com/Q/What_do_you_do_after_magma_hideout", "passage_text": "(not the white cave) then, go in. see the submarine? press b here and you'll get to seafloor cavern. (make sure your Pokemon knows strengh) you'll battle some team magma grunts, then battle the magma boss again. win then he'll use the blue orb, causing groudon to flee. then, steven appears and you have to go to sootoplis. go in the cave of orgin to find groudo"}, {"url": "http://www.thonky.com/pokemon-omega-ruby-alpha-sapphire/team-magma-hideout", "passage_text": "Team Magma Hideout B2F. If you want the Master Ball, go south from that Grunt and step on the warp tile to reach a room with many warp tiles. First, step on the left or right warp tile to go to the next row. Then step on the middle warp tile to go to the next row. Use the next warp tile to return to the lab. From the lab, go south and then west. You can battle a Team Magma Grunt who has a level 37 Golbat. Go north from that Grunt and step on the warp tile to go to another room. In that room, you can battle a Grunt to the west who has a level 34 Mightyena and a level 36 Golbat. There is a Master Ball that you can get n"}, {"url": "http://pokemon.wikia.com/wiki/Magma_Hideout", "passage_text": "Magma Hideout is a location in Hoenn. It was the base of Team Magma in Pokemon Pokémon, Ruby Pokemon, pokémon Emerald And Pokemon. pokémon omega ruby In Ruby and Omega Ruby, before the player can access the hideout, Team Magma has reached Slateport City to steal the submarine from Capt. Stern. After that, the player is free to explore it before moving on."}, {"url": "http://www.thonky.com/pokemon-omega-ruby-alpha-sapphire/team-magma-hideout", "passage_text": "Team Magma Hideout 1F. Go north from the entrance of the hideout and go through the door. Go north, then east. Step on the green tile to be warped to a small room where you can get a Nugget. Step on the green tile to exit this room. Go northwest and step on the tile there to go to another room. Use the next warp tile to return to the lab. From the lab, go south and then west. You can battle a Team Magma Grunt who has a level 37 Golbat. Go north from that Grunt and step on the warp tile to go to another room. In that room, you can battle a Grunt to the west who has a level 34 Mightyena and a level 36 Golbat. There is a Master Ball that you can get now"}, {"url": "http://bulbapedia.bulbagarden.net/wiki/Magma_Hideout", "passage_text": "Team Magma's Hideout in Ruby. It is located in the same place as the Team Aqua Hideout and has the same features. It is located just east of Lilycove City, in an area only accessible after Team Magma has stolen the submarine in Slateport City. On the inside, the player will find teleport platforms scattered about. Generations: III, VI. Pokemon pokémon world. Locations The Team Magma (Hideout: japaneseマグマ団 アジト Team Magma), hideout Called Magma hideout in The GENERATION iii, games Is Team 'magma s base of operations in The hoenn, region located on a small island cave on the outskirts Of Lilycove. city"}, {"url": "http://pokemon.wikia.com/wiki/Magma_Hideout", "passage_text": "Magma Hideout is a location in Hoenn. It was the base of Team Magma in Pokemon Pokémon, Ruby Pokemon, pokémon Emerald And Pokemon. Pokémon Omega Ruby in Pokemon Pokémon Ruby, and pokemon pokémon omega Ruby It, is located Near Lilycove, city while in pokemon pokémon emerald it Is Located. near the exit of jagged pass In Ruby and Omega Ruby, before the player can access the hideout, Team Magma has reached Slateport City to steal the submarine from Capt. Stern. After that, the player is free to explore it before moving on."}]