[{"url": "https://en.wikipedia.org/wiki/Tift_County,_Georgia", "passage_text": "Tift County is a county located in the U.S. state of Georgia. As of the 2010 census, the population was 40,118. The county seat is Tifton. Tift County comprises the Tifton, GA Micropolitan Statistical Area. "}, {"url": "http://www.exploregeorgia.org/city/tifton", "passage_text": "9 of 9. Tifton is a growing leisure destination in the heart of charming South Georgia. Here, you will find the perfect combination of welcoming hometown appeal and exciting cultural chic. Strategically located just 2.5 hours south of Atlanta, Tifton can be reached easily by I-75, US 319, US 82, and US 41. "}, {"url": "http://www.city-data.com/city/Tifton-Georgia.html", "passage_text": "Fire-safe hotels and motels in Tifton, Georgia: 1  Holiday Inn Tifton, 1208 Hwy 82 W, Tifton, GA 31794, Phone: (229) 382-6687. 2  Comfort Inn Tifton, 1104 King Rd, Tifton, GA 31744, Phone: (229) 382-4410. Tornado activity: Tifton-area historical tornado activity is near Georgia state average. It is 31% greater than the overall U.S. average. On 5/11/1952, a category F3 (max. wind speeds 158-206 mph) tornado 16.7 miles away from the Tifton city center injured 10 people and caused between $500,000 and $5,000,000 in damages."}, {"url": "http://www.transpower.cc/", "passage_text": "|. TransPower, Inc has been serving the South Georgia medium and heavy duty truck market since 1959 and currently has locations in Albany, Douglas, and Valdosta, Georgia. TransPower, Inc. is a distributor for Mack Trucks, Inc., Kenworth Truck Company, and Ford Motor Company. "}, {"url": "http://www.olivegarden.com/locations/ga/tifton/tifton/4459", "passage_text": "11:00AM - 8:30PM. Olive Garden in Tifton, GA, is located 1 mile south of Tifton Mall at 1208 Highway 82 West, and is convenient to hotels, shopping, tourist attractions, movie theaters, hospitals, convention centers, colleges or universities, schools, and major highways. "}, {"url": "https://www.motel6.com/en/motels.ga.tifton.4998.html", "passage_text": "Additional Details. Additional Details. Motel 6 Tifton is conveniently located off I-75 between Atlanta GA and Jacksonville FL. Fullwood Lake is a 5 minute walk from this motel. Amenities include micro-fridge units in select rooms and free Wi-Fi in all rooms, and a seasonal outdoor pool."}, {"url": "http://local.fedex.com/ga/tifton/", "passage_text": "Shipping & Delivery. We can help you choose your shipping and delivery options. Learn how to schedule a FedEx® delivery in Tifton, or hold your package for pickup at a nearby FedEx location. And now you can ship more for less than you think with FedEx One Rate®. FedEx Authorized ShipCenter locations provide access to the FedEx shipping network at thousands of independently owned and operated pack-and-ship locations across the U.S. FedEx Express Drop Box Use any of our 40,000 drop boxes to drop off your FedEx Express packages or pick up shipping supplies."}, {"url": "http://www.georgiaencyclopedia.org/articles/counties-cities-neighborhoods/tifton", "passage_text": "Twentieth Century. Twenty-First Century and Beyond. Tifton, the county seat of Tift County, is located on the coastal plain in south central Georgia some sixty miles from the Florida border. Situated at the intersection of several major thoroughfares, Tifton serves as a crossroads of south Georgia. "}]