[{"url": "http://www.greghillassociates.com/what-s-a-wobbler-can-a-felony-be-changed-to-a-misdemeanor.html", "passage_text": "There are several common offenses that a prosecutor can chose to charge as either a felony or a misdemeanor, depending upon the facts of the case and the defendant’s criminal history. In other words, the charge can “wobble” between a felony and a misdemeanor. Alternatively, for a relatively small number of felonies that are not considered “wobblers,” the judge can sentence the individual to county jail under Penal Code § 18, making the conviction a misdemeanor instead of a felony. There are countless reasons one may need a felony conviction off one’s record."}, {"url": "http://www.greghillassociates.com/what-s-a-wobbler-can-a-felony-be-changed-to-a-misdemeanor.html", "passage_text": "When one is charged with a felony that can also be charged as a misdemeanor and one was sentenced to probation or jail less than one year (not prison), one may ask the judge to reduce the charge to a misdemeanor under Penal Code § 17(b). Alternatively, for a relatively small number of felonies that are not considered “wobblers,” the judge can sentence the individual to county jail under Penal Code § 18, making the conviction a misdemeanor instead of a felony. There are countless reasons one may need a felony conviction off one’s record."}, {"url": "http://www.answers.com/Q/Can_a_misdemeanor_charge_be_changed_to_felony_at_the_hearing", "passage_text": "Yes. If a plea bargain is offered sometimes the charges may be lightened. A felony 5 for example may be changed to a misdemeanor 6. Also if the defendant has deferred prosecu … tion the court orders the defendant to accomplish certain goals. If completed the court changes the felony to a misdemeanor. In most US states the first offence is a class A misdemeanor but subsequent offenses including ignoring the courts orders can bring the charge into felony status and big time … jail terms. This is not the case in all states. Some class violent domestic abuse as a felony and charge as such in every instance."}, {"url": "http://www.answers.com/Q/Can_the_courts_change_a_felony_to_a_misdemeanor", "passage_text": "The decision on whether a crime is a felony or a misdemeanor is a legislative decision and the court cannot change that directly. However most felony crimes have 'lesser included offenses' that are misdemeanors. Yes. If a plea bargain is offered sometimes the charges may be lightened. A felony 5 for example may be changed to a misdemeanor 6. Also if the defendant has deferred prosecu … tion the court orders the defendant to accomplish certain goals. If completed the court changes the felony to a misdemeanor."}, {"url": "http://www.lawqa.com/qa/can-misdeamor-be-changed-to-felony", "passage_text": "Yes. Within the statute of limitations, a charge can be enhanced from a misdemeanor to a felony based on the elements of the offense or built in enhancing factors. For example, a misdemeanor retail theft can be enhanced to a felony if the accused has a conviction for a prior retail theft. A crime that can be charged as either a misdemeanor or a felony is known as a wobbler. To answer your question, yes, a misdemeanor can be charged as a felony if that crime for which you have been arrested i"}, {"url": "http://www.lawqa.com/qa/can-misdeamor-be-changed-to-felony", "passage_text": "You can be arrested for a misdemeanor and then indicted on a felony. The DA can charge or amend to a felony if the facts make it out, and you can be charged with any crime that the DA feels can be proved as long as they have a supporting deposition that includes all the elements of the felony charged. A crime that can be charged as either a misdemeanor or a felony is known as a wobbler. To answer your question, yes, a misdemeanor can be charged as a felony if that crime for which you have been arrested i"}, {"url": "http://criminal.lawyers.com/criminal-law-basics/crimes-can-be-misdemeanors-or-felonies.html", "passage_text": "The judge or the prosecutor – the state’s attorney – will read the charges against you. You can tell the court whether you’re guilty or not guilty. The judge will set bail, which is usually much less for a misdemeanor than for a felony charge. After you pay your bail, you’re usually free to go home. In some serious felony cases, the judge may deny bail."}, {"url": "http://www.lawqa.com/qa/can-misdeamor-be-changed-to-felony", "passage_text": "The prosecutor has authority to amend charges prior to trial. A misdemeanor charge can be amended to a felony charge if there is probable cause for a felony charge. Sometimes, an offense is initially charged as a misdemeanor before all the evidence is known or properly evaluated. A crime that can be charged as either a misdemeanor or a felony is known as a wobbler. To answer your question, yes, a misdemeanor can be charged as a felony if that crime for which you have been arrested i"}]