[{"url": "http://lee.ifas.ufl.edu/Hort/GardenPubsAZ/Dessert_Rose_Adenium_obesum.pdf", "passage_text": "Desert rose is a slow grower with maximum observed heights of about 6 feet in South Florida but usually much smaller. Sap flows from broken stem of A. obesum Sap flows from severed leaf A. obesum This plant is approximately 35 years old and measures 6 feet high and 10 feet wide, Fort Myers, early April. Avoid planting desert rose in areas where automatic sprinklers are located. Fertilization and Irrigation: The plant is a slow grower if not generously watered and fertilized. With-out fertilization the plant may grow as little as 6 feet in 15 year. The plant has its fastest growth in the first 3 to 5 years."}, {"url": "http://www.south-florida-plant-guide.com/desert-rose.html", "passage_text": "Plant spacing. Place a desert rose at least 2 feet from nearby plants-more if you can. Come in from a walk or driveway about 3 feet to allow for future growth and so that fallen blossoms don't make a mess on the pavement. These are superb as container plants, and the container can even be added to an eclectic garden bed. Even in summer, though, the plant is more stems and blooms than foliage. Slow growing desert rose can grow as much as 4 feet tall...but that takes quite a while. And a light spring pruning for fullness, shape and more flowers will keep the overall size much smaller."}, {"url": "http://houseplants.about.com/od/succulentsandcacti/p/DesertRose.htm", "passage_text": "Lyle Leduc/Photographer's Choice RF/Getty Images. The desert rose (Adenium obesum) is a striking plant with swollen succulent stems and deep red flowers. The plant is deciduous in cooler winters, but it can be kept in leaf provided there is sufficient warmth and light water. The desert rose (A. obesum) is the only Adenium found in wide cultivation, although it has been hybridized extensively to obtain different flower colors, including orange, white, striped and the traditional red. Grower's Tips: These are not difficult plants to grow well, provided they get enough sunlight and warmth."}, {"url": "http://www.enkivillage.com/how-to-grow-a-desert-rose.html", "passage_text": "Tips. The adenium obesum, commonly known as the desert rose, is a succulent plant. It is native to hot humid climates for Africa and Arabia, but can be grown anywhere if cared for properly with warmth and sunlight. Sunlight: The desert rose is perfect for a sunny window because it needs full sunlight daily. To help the plant grow a straight, strong, stem it is important that your rotate the pot every two to three days especially in young plants."}, {"url": "http://www.gardenguides.com/80518-care-desert-rose-plant.html", "passage_text": "Overview. The desert rose is a succulent plant that is native to East Africa where it grows 6 to 10 feet tall in the wild. The plant produces 2-inch, pink, trumpet-shaped flowers and fleshy green foliage. The flowers appear in late winter to early summer, depending on the area. "}, {"url": "http://www.south-florida-plant-guide.com/desert-rose.html", "passage_text": "The plant generally loses its leaves in winter. Even in summer, though, the plant is more stems and blooms than foliage. Slow growing desert rose can grow as much as 4 feet tall...but that takes quite a while. And a light spring pruning for fullness, shape and more flowers will keep the overall size much smaller."}, {"url": "http://homeguides.sfgate.com/care-desert-rose-house-plant-46430.html", "passage_text": "1 Grow a top-heavy desert rose in a heavy, clay pot filled with a well-draining cactus soil mixture. 2  Using a pot with a 16-inch or larger diameter and bottom drainage holes allows the plant's stem to swell over time with minimal need for repotting. 3. Water the desert rose when its soil feels almost completely dry when you insert your finger into the soil. Water until moisture begins to drip from the bottom of the pot, indicating the soil is moistened throughout the plant's root zone."}, {"url": "http://homeguides.sfgate.com/care-desert-rose-house-plant-46430.html", "passage_text": "Desert rose is hardy outdoors only in U.S. Department of Agriculture plant hardiness zones 11 and 12, but you can enjoy it as a perennial potted plant year-round in any climate. 3. Water the desert rose when its soil feels almost completely dry when you insert your finger into the soil. Water until moisture begins to drip from the bottom of the pot, indicating the soil is moistened throughout the plant's root zone."}, {"url": "http://www.guide-to-houseplants.com/desert-rose-plant.html", "passage_text": "Desert Rose Plant Care. Botanical Name: Adenium obesum. Desert rose plant is so easy to care for, it's a wonder why we don't see these beautiful succulents more often in nurseries and florist's shops. Desert rose branches naturally, creating an attractive treelike house plant. Its succulent stems are covered top to bottom with long, evergreen leaves. "}, {"url": "http://homeguides.sfgate.com/care-desert-rose-house-plant-46430.html", "passage_text": "Set the desert rose in an area that receives at least six hours of direct sunlight each day, such as near a south-facing window. If desired, place the plant outdoors in a sunny location in spring after nighttime temperatures are regularly above 55 degrees Fahrenheit. 3. Water the desert rose when its soil feels almost completely dry when you insert your finger into the soil. Water until moisture begins to drip from the bottom of the pot, indicating the soil is moistened throughout the plant's root zone."}]