[{"url": "http://www.pipeworksservices.com/about-us/blog/13515-how-many-btus-does-a-furnace-need-for-the-home.html", "passage_text": "How many BTUs do you need to heat your home? As a rule of thumb, you need between 40 to 45 BTUs to heat one square foot of your home. If your home is 2,000 square feet in size, you need a heating system that generates between 80,000 and 90,000 BTUs. You can use this rule of thumb to get a rough estimate of how much a new heating system will cost. However, it's important to have a heating professional make the final calculation. An HVAC professional uses a more complicated system, like the Manual J Load Calculation, to calculate the number of BTUs your new heating system will need. This system factors in how many windows are in your home, your home's layout, insulation, efficiency, as well as the number of floors you have to heat."}, {"url": "http://homeguides.sfgate.com/many-btus-furnace-need-house-100318.html", "passage_text": "A BTU is a British Thermal Unit, or a measure of thermal or heat energy. BTUs are used to determine thermal energy output in a variety of devices, including furnaces. The heating degree-day calculation for a furnace is 50 x heating therms x furnace efficiency = load in BTUs/hour. Your furnace must produce a certain load, measured in BTUs per hour, to heat your home."}, {"url": "http://www.ehow.com/how_5653676_calculate-btu-gas-furnace.html", "passage_text": "Multiply the furnace's input rating by its efficiency. For example, if your furnace had an input rating of 200,000 BTU's and an efficiency level of 90 percent. You would multiply 200,000 by 0.90 to get 180,000. This number would then be the number of BTU's at which your furnace is effectively operating."}, {"url": "http://www.youtube.com/watch?v=GB-Pvy3uqYg", "passage_text": "To find the BTU size of a furnace, refer to the name plate or level plate that is located inside of the furnace, typically in sticker form. Learn about input and output BTUs with help from a heating and air conditioning technician in this free video on BTU size in furnaces. "}, {"url": "http://homeguides.sfgate.com/many-btus-furnace-need-house-100318.html", "passage_text": "For cooler climates, a very broad estimate of furnace sizing is to select one that generates 40 to 45 BTUs per square foot. At 40 to 45 BTUs per square foot, you'd need a 100,000 to 112,500 BTU furnace to heat your 2,500-square-foot home. The heating degree-day calculation for a furnace is 50 x heating therms x furnace efficiency = load in BTUs/hour. Your furnace must produce a certain load, measured in BTUs per hour, to heat your home."}, {"url": "http://budgeting.thenest.com/many-btus-furnace-need-house-26529.html", "passage_text": "If not, multiply the input BTUs by the furnace's efficiency. For example, an older furnace rated for 100,000 input BTUs at 75-percent efficiency has 75,000 output BTUs. A newer, higher-efficiency furnace might have a lower rating for input BTUs, but still put out the 75,000 output BTUs you need."}, {"url": "http://www.calculator.net/btu-calculator.html", "passage_text": "Reference. The British Thermal Unit, or BTU, is an energy unit. It is approximately the energy needed to heat one pound of water for 1 Fahrenheit. 1 BTU = 1,055 joules. 1BTU/hour = 0.293 watt. Examples 1  : One very well-insulated 1,000-square-foot home in Boston needs around 24,000 BTUs to heat in winter. Please note that this calculator can only gauge a rough estimate. You should also consider factors like efficiency decrease of the heater or air conditioner with time, the shape/type of your home or room, insulation conditions, and other factors. 1 watt is approximately 3.41214 BTU/h."}, {"url": "http://www.wikihow.com/Calculate-BTU-Per-Square-Foot", "passage_text": "Determine the necessary heating or cooling capacity. The capacity of furnaces and air conditioners is given in BTUs per hour. You need to establish the correct number of BTUs per square foot for your house needed to either heat or cool it. In warmer climates, you may need only 30 to 35 BTU per hour per square foot to heat your house adequately. In colder climates, you may need up to 50 to 60 BTU/h/ft 2. In general, the further from the equator you live, the greater the number of BTU/h/ft 2 you need, but weather patterns and geography modify this somewhat."}, {"url": "http://www.wikihow.com/Calculate-BTU-Per-Square-Foot", "passage_text": "3. Multiply the total square footage to be heated by the heating factor. If you live in a 2,500 square foot home and a climate zone with a heating factor of 40 BTUs per square foot, you need a furnace with an output of 100,000 BTUs per hour. In warmer climates, you may need only 30 to 35 BTU per hour per square foot to heat your house adequately. In colder climates, you may need up to 50 to 60 BTU/h/ft 2. In general, the further from the equator you live, the greater the number of BTU/h/ft 2 you need, but weather patterns and geography modify this somewhat."}]