[{"url": "http://www.holiday-weather.com/port_louis/averages/", "passage_text": "Port Louis: Annual Weather Averages. January is the hottest month in Port Louis with an average temperature of 26°C (79°F) and the coldest is July at 20°C (68°F) with the most daily sunshine hours at 10 in November. The wettest month is March with an average of 221mm of rain. The best month to swim in the sea is in February when the average sea temperature is 28°C (82°F)."}, {"url": "http://www.travelmauritius.info/mauritius_temperature.html", "passage_text": "Below you can observe an average of the mauritius temperature, humidity, rainfall, sunshine hours and sea temperature from North to South and from East to West and the Centre. The climate in Mauritius can be very humid and warm but can be also quite cold in the middle part of the island as it is located on the central plateau and higner as the other region."}, {"url": "http://www.travelmauritius.info/mauritius_temperature.html", "passage_text": "Generally it is warmer on the coastal region and cooler on the central plateau. Mauritius Temperature – The sea temperature is a little warmer in summer than in winter but it is always a pleasure to have a bath in the turquoise lagoon at any season of the year. The climate in Mauritius can be very humid and warm but can be also quite cold in the middle part of the island as it is located on the central plateau and higner as the other region."}, {"url": "http://mauritiusattractions.com/mauritius-sea-temperature-i-113.html", "passage_text": "The temperature of the Indian Ocean in the region of Mauritius is higher during the summer, and in winter time the temperature of the water will drop a little. Sea temperatures are generally pleasant throughout the year ranging from 26-29° C in summer to 23-25° C in winter. "}, {"url": "http://www.info-mauritius.com/english/climate.html", "passage_text": "Minimum Temperature (Winter/Summer) [+] Usually in winter (means May to October) the highest temperatures vary between 20°C and 26°C in the coastal regions. Upland it can go down to 16C. In summer (November to April) it’s slightly higher, meaning 26°C to 32°C. Maximum Temperature [+] per Region. The water temperature of the Indian Ocean can go up to 28°C in Summer. Usually wind is blowing quiet steady from easterly directions. Mauritius is not far from the Capricorn. Attention Mauritius has a Microclimate ! It could rain cats and dogs where you are. Only a few kilometers away sun is shining and no cloud in sight. If you wake up in the morning with a gray sky, don’t worry. Go for your shower, have breakfast. Later the sky will be blue. ;)."}, {"url": "http://www.weather2travel.com/climate-guides/mauritius/", "passage_text": "The Mauritius climate guide is perfect for planning your holiday. Monthly weather averages give the best indication of what the weather is usually like for every month of the year including figures for temperature, rainfall and sunshine. The Mauritius climate guide shown below is for Port Louis."}, {"url": "http://www.holiday-weather.com/mauritius/averages/", "passage_text": "Mauritius: Annual Weather Averages. January is the hottest month in Mauritius with an average temperature of 26°C (79°F) and the coldest is July at 21°C (70°F) with the most daily sunshine hours at 10 in November. The wettest month is January with an average of 228mm of rain. "}, {"url": "https://weatherspark.com/averages/29074/Rodrigues-Island-Mauritius", "passage_text": "This report describes the typical weather at the Sir Gaetan Gaëtan Duval (Airport Rodrigues, Island) mauritius weather station over the course of an average. Year it is based on the historical records from 2007 to. 2012 earlier records are either unavailable or. unreliable The hottest day of the year is January 13, with an average high of 87A°87â f and low OF°78a. 78â f the cold season Lasts from june 21 to september 23 with an average daily high TEMPERATURE°Below. 79a 79â f the coldest day of The year, is august 12 with an AVERAGE°Low of 68a 68â F°And. high of 77a 77â f"}, {"url": "http://www.travelmauritius.info/mauritius_temperature.html", "passage_text": "Mauritius Temperature. Mauritius Temperature – Mauritius is a tropical island located in the Indian Ocean, close to Madagascar, Rodrigues and Reunion Islands. Mauritius has all year long a comfortable temperature and climate which allow the visitors to choose their holidays at any time of the year. The climate in Mauritius can be very humid and warm but can be also quite cold in the middle part of the island as it is located on the central plateau and higner as the other region."}, {"url": "http://www.mauritius-weather.info/temperature.html", "passage_text": "The chart above provides information about the yearly minimum and maximum temperature in Mauritius. Is also displayed the average temperature, the percentage of humidity, the average of the sea temperature, the average rainfall in millimetres and the average hours of sunshine per day during the months of the year."}]