[{"url": "http://www.acl.gov/Programs/AIDD/DD_History/Index.aspx", "passage_text": "[8]. The current definition under the DD Act [9] (adopted in 2000) defines “developmental disability” as a severe, chronic disability of an individual that: “( 1 i) is attributable to a mental or physical impairment or combination of mental and physical impairments; ( 2 ii) is manifested before the individual attains age 22; ( 3 iii) is likely to continue 4  ... (i"}, {"url": "http://ici.umn.edu/welcome/definition.html", "passage_text": "Over 6 million individuals in the United States have developmental disabilities. A developmental disability, according to the Developmental Disabilities Assistance and Bill of Rights Act, is defined as a severe, chronic disability which: 1  originated at birth or during childhood, 2  is expected to continue indefinitely, and. Examples of developmental disabilities include: 1  Autism. 2  Behavior disorders. 3  Brain injury. 4  Cerebral palsy. 5  Down syndrome. 6  Fetal alcohol syndrome. 7  Intellectual disability. 8  Spina Bifida."}, {"url": "http://www.cdc.gov/ncbddd/developmentaldisabilities/index.html", "passage_text": "Developmental disabilities are a group of conditions due to an impairment in physical, learning, language, or behavior areas. 1  Basics Milestones, screening, causes and risk factors, and living with a disability. About one in six children in the U.S. have one or more developmental disabilities or other developmental delay"}, {"url": "http://ici.umn.edu/welcome/definition.html", "passage_text": "More specifically, a developmental disability is a severe, chronic disability which: 1  is attributable to a mental or physical impairment or a combination of mental and physical impariments; 2  is manifested before the person attains age 22; Examples of developmental disabilities include: 1  Autism. 2  Behavior disorders. 3  Brain injury. 4  Cerebral palsy. 5  Down syndrome. 6  Fetal alcohol syndrome. 7  Intellectual disability. 8  Spina Bifida."}, {"url": "https://en.wikipedia.org/wiki/Developmental_disability", "passage_text": "Developmental disability is a diverse group of chronic conditions that are due to mental or physical impairments. Developmental disabilities cause individuals living with them many difficulties in certain areas of life, especially in language, mobility, learning, self-help, and independent living. Developmental disabilities can be detected early on, and do persist throughout an individual's lifespan. 1 Pervasive developmental disorders (PDD) are a group of developmental disabilities that can cause significant social, communication and behavioral challenges. 2  Fetal alcohol spectrum disorders (FASD) are a group of conditions that can occur in a person whose mother drank alcohol during pregnancy."}, {"url": "http://www.cdc.gov/ncbddd/developmentaldisabilities/index.html", "passage_text": "Recommend on Facebook Tweet ShareCompartir. Developmental disabilities are a group of conditions due to an impairment in physical, learning, language, or behavior areas. About one in six children in the U.S. have one or more developmental disabilities or other developmental delays. 1  Basics Milestones, screening, causes and risk factors, and living with a disability."}, {"url": "https://en.wikipedia.org/wiki/Developmental_disability", "passage_text": "Most common developmental disabilities: 1  Fragile X syndrome (FXS) is thought to cause autism and intellectual disability, usually among boys. 2  Down syndrome is a condition in which people are born with an extra copy of chromosome 21. 3  Normally, a person is born with two copies of chromosome 21. 1 Pervasive developmental disorders (PDD) are a group of developmental disabilities that can cause significant social, communication and behavioral challenges. 2  Fetal alcohol spectrum disorders (FASD) are a group of conditions that can occur in a person whose mother drank alcohol during pregnancy."}, {"url": "http://aaidd.org/intellectual-disability/definition/faqs-on-intellectual-disability", "passage_text": "Intellectual disability encompasses the “cognitive” part of this definition, that is, a disability that is broadly related to thought processes. Because intellectual and other developmental disabilities often co-occur, intellectual disability professionals often work with people who have both types of disabilities. Developmental Disabilities is an umbrella term that includes intellectual disability but also includes other disabilities that are apparent during childhood. Developmental disabilities are severe chronic disabilities that can be cognitive or physical or both."}, {"url": "http://www.dds.ca.gov/general/info_about_dd.cfm", "passage_text": "Information About Developmental Disabilities. The term developmental disability refers to a severe and chronic disability that is attributable to a mental or physical impairment that begins before an individual reaches adulthood."}]