[{"url": "http://www.spirit-animals.com/deer/", "passage_text": "To see a male deer or buck in your dream represents alertness, virility, masculine sexuality and assertiveness. If the two bucks are fighting, then it signifies male aggression. You are trying to dominate or take control over some area of your life. Alternatively, the dream may be a pun on a dollar. "}, {"url": "http://symbolism.wikia.com/wiki/Deer", "passage_text": "As thoughts of deer come to our minds, its a sign that the deer wants us to 'seek' into our inner heart and find our treasures. There are many ways to interpret the deer: Choose if you are either a Male(boy) or a Female(girl), read under your gender's personality of the Deer carefully: "}, {"url": "http://www.whats-your-sign.com/animal-symbolism-deer.html", "passage_text": "Animal Symbolism: Meaning of the Deer. A Look at the Symbolic Meaning of the Deer. When we encounter the deer in the wild, our breath catches-we are transfixed by their graceful features and delicate movements. The tender beauty of these beasts has not gone unnoticed by our ancestors. The deer is linked to the arts, specifically poetry and music in ancient Celtic animal lore due to its graceful form. The Celts also believed that deer were associated with the fairie realm, and would lead troops of fairies-hundreds of them trailing behind them as the stag cut a path through the forest."}, {"url": "http://www.dreammoods.com/cgibin/dreamdictionarysearch.pl?method=exact&header=dreamsymbol&search=deer", "passage_text": "&nbsp Tweet. &nbsp Tweet. Deer To see a deer in your dream symbolizes grace, compassion, gentleness, meekness and natural beauty. It has feminine qualities and may point to the feminine aspect within yourself. It also represents independence, alertness, and virility. Consider the symbol to be a pun for someone who is dear to you"}, {"url": "http://www.universeofsymbolism.com/deer-symbolism.html", "passage_text": "Deer Symbolism. . . Deer is among the gentlest of creatures, with big soft eyes conveying the energy of innocence, Deer reminds us of of our own innocence and the fundamental need and desire to be nurtured and protected. The heartfelt essence of Deer Symbolism opens new doors for us... just as the Deer is on a life long adventure exploring new lands, the Deer leaps high and far symbolizing to us that we too must take leaps of faith into new adventures and new paths in life."}, {"url": "http://www.answers.com/Q/What_do_deer_symbolize", "passage_text": "Share to:   In many cultures the deer is a symbol of good fortune, power. In china they are considered esspecially lucky-the word for deer and abundance are almost exactly th … e same. In Greek Mythology, Artemis, the Goddess of the hunt is said to have sought after deer. In Christianity they are a symbol of piety and devoltion to God. The Stag is usually used as a symbol of devotion, power, a symbol of the sun in other religions. The doe is assosiated with femininity, grace, innocence and vunerhability. 9 people found this useful."}, {"url": "http://www.pure-spirit.com/more-animal-symbolism/216-pure-spirit-minneapolis-st-paul-dog-training-and-international-all-species-animal-communication-deer", "passage_text": "The deer was sacred to the feisty goddess Artemis, from Greek mythology. Deer symbolize the powers in nature that are not easily subdued. Should a deer come into your life, Ted Andrews tells us to look for new perceptions and degrees of perceptions to grow and expand for as long as the next five years (deer shed and grow their antlers for five years). But there is also a cautious element to deer. Their antlers grow behind the eyes and offer protection."}]