[{"url": "http://www.rockportbeach-texas.com/index.php/rockport-beach", "passage_text": "Welcome to Rockport Beach. We are located at 210 Seabreeze Drive, Rockport, TX 78382. The hours of operation are 6am to 11pm Sunday thru Thursday and 6am to Midnight on Friday and Saturday. Parking costs for the Rockport Beach are $5/Daily and $15/Annually."}, {"url": "http://www.rockport-fulton.org/", "passage_text": "Rockport-Fulton. Mobile App! Rockport-Fulton, Texas – Charm of the Texas Coast! We've teamed up with the Aransas Pathways Project to bring you dining, shopping, art, fishing, boating, birding sites, historical homes, landmarks and sites, hike and bike trails, kayaking launch areas and information on local attractions."}, {"url": "http://www.best-beaches.com/us/texas/rockport/rockport-beaches", "passage_text": "The beach in Rockport Texas is a little more than a mile long, shorter than many other beaches on the Texas coastline, but offers easy route to Padre Island a barrier island with hundreds of miles, and many beaches, to explore. En route back to Rockport, appreciating the smaller beach and uncrowded shores is a given."}, {"url": "http://www.rockportbeach-texas.com/index.php/rockport-beach", "passage_text": "Rockport Beach is Texas' first Blue Wave Beach and one of only four on the Texas Gulf Coast. Be prepared for great facilities, beautiful views and loads of fun during your visit."}, {"url": "http://www.candlelightcottagesbythebeach.com/BlueWaveBeach.html", "passage_text": "Reviews you can trust from Trip Advisor. Rockport Beach is the only beach in Texas certified by the Clean Beaches Council in Washington D.C. This certification is like receiving the Good Housekeeping seal of approval. To be certified, the beach must pass an extensive checklist and is subject to no-notice inspections."}, {"url": "http://www.candlelightcottagesbythebeach.com/BlueWaveBeach.html", "passage_text": "Rockport Beach is the only beach in Texas certified by the Clean Beaches Council in Washington D.C. This certification is like receiving the Good Housekeeping seal of approval. To be certified, the beach must pass an extensive checklist and is subject to no-notice inspections."}]