[{"url": "http://www.mayoclinic.org/healthy-lifestyle/birth-control/in-depth/womens-health/art-20044044", "passage_text": "Delaying your period with birth control pills. If you take birth control pills, you may not need to have a monthly period. Find out how to use the pill to have more control over your cycle."}, {"url": "https://www.plannedparenthood.org/teens/my-body/your-period", "passage_text": "The menstrual cycle is the time from the first day of one period to the first day of the next. A normal menstrual cycle can be as short as 21 days or longer than 35 days. For most women, it lasts 25 - 30 days. But it's common for your cycle to vary from month to month. Here are the basics: 1  You have two ovaries."}, {"url": "http://www.webmd.com/sex/birth-control/features/no-more-periods", "passage_text": "With normal birth control pills, the lining of your uterus builds up and sheds every month during your period. Some women worry that extended-cycle or continuous birth control pills could cause the lining to thicken."}, {"url": "http://www.mayoclinic.org/healthy-lifestyle/birth-control/in-depth/womens-health/art-20044044", "passage_text": "Breakthrough bleeding — bleeding or spotting between periods — is common when you use birth control pills to delay or prevent periods, especially during the first few months. Breakthrough bleeding typically decreases over time, however, as your body adjusts to the new regimen."}, {"url": "http://www.womenshealth.gov/publications/our-publications/fact-sheet/menstruation.html", "passage_text": "It also prepares your body for pregnancy each month. A cycle is counted from the first day of 1 period to the first day of the next period. The average menstrual cycle is 28 days long. Cycles can range anywhere from 21 to 35 days in adults and from 21 to 45 days in young teens. The rise and fall of levels of hormones during the month control the menstrual cycle."}, {"url": "http://goaskalice.columbia.edu/answered-questions/can-i-reschedule-my-period", "passage_text": "To skip a period: 1  When taking monophasic birth control pills 2  : 28-day oral contraceptive (OC) pack users: When you reach the end of the active hormonal pills in a pack (the first 21 or 24 pills), begin the next set of active pills, skipping the inactive (placebo pills) from the previous package."}, {"url": "http://www.womenshealth.gov/publications/our-publications/fact-sheet/menstruation.html", "passage_text": "Menstruation (men-STRAY-shuhn) is a woman's monthly bleeding. When you menstruate, your body sheds the lining of the uterus (womb). Menstrual blood flows from the uterus through the small opening in the cervix and passes out of the body through the vagina (see how the menstrual cycle works below). Most menstrual periods last from 3 to 5 days."}]