[{"url": "http://www.canadianpharmacyking.com/Drug/Symbicort+Turbuhaler", "passage_text": "Symbicort Turbuhaler Information. Symbicort contains a combination of budesonide and formoterol. Budesonide belongs to a group of medications known as corticosteroids. It works by reducing the swelling in the airways of the lungs. Formoterol belongs to the group of medications known as bronchodilators"}, {"url": "https://www.mysymbicort.com/", "passage_text": "SYMBICORT contains formoterol, a long-acting beta2-adrenergic agonist (LABA). LABA medicines such as formoterol increase the risk of death from asthma problems. It is not known whether budesonide, the other medicine in SYMBICORT, reduces the risk of death from asthma problems seen with formoterol. 1  Call your health care provider if breathing problems worsen over time while using SYMBICORT"}, {"url": "http://www.rxlist.com/symbicort-drug.htm", "passage_text": "One active component of SYMBICORT (budesonide and formoterol fumarate dihydrate) is budesonide, a corticosteroid designated chemically as (RS)-11β, 16α, 17,21-Tetrahydroxypregna-1,4-diene-3,20-dione cyclic 16,17-acetal with butyraldehyde. Budesonide is provided as a mixture of two epimers (22R and 22S). Before using this medication, tell your doctor or pharmacist if you are allergic to budesonide or formoterol; or to arformoterol; or if you have any other allergies. This product may contain inactive ingredients, which can cause allergic reactions or other problems. Talk to your pharmacist for more details."}, {"url": "http://www.bigmountaindrugs.com/Drug/Symbicort+Turbuhaler", "passage_text": "Symbicort Turbuhaler (Generic name: Budenoside and Formoterol, also known as Foracort Inhaler or Foracort CFC) is an inhaler used to treat asthma. The Symbicort turbuhaler is used to help asthma in two ways: by maintenance therapy or by maintenance and relief therapy. The first medicinal ingredient, budenoside, is a cortisteroid used to control and prevent asthma attacks by reducing swelling in the airways of the lungs. Be sure to talk to your doctor about potential side effects before using the Symbicort Turbuhaler. Symbicort Turbuhaler Precautions: Budesonide-formoterol turbuhalers should not be used by anyone who is allergic to budesonide, formoterol, or inhaled lactose. If you miss a dose, take it as soon as you remember."}, {"url": "http://www.empr.com/symbicort-16045/drug/2925/", "passage_text": "Indications for SYMBICORT 160/4.5: Long-term maintenance treatment of asthma in patients ≥12yrs old not adequately controlled on other asthma-controller medications (eg, low-medium dose inhaled corticosteroids) or those whose disease severity clearly warrants starting treatment with two maintenance therapies. "}, {"url": "http://asthma.emedtv.com/symbicort/generic-symbicort.html", "passage_text": "No -- budesonide and formoterol are the active ingredients in Symbicort (and other medications), but are not generic versions of it. What can be confusing is that, oftentimes, the active ingredient of any drug is referred to as the generic name.. The generic name is different from a generic version of a medicine. In order for there to be a generic version of a medicine, the original medicine must have gone off-patent and another company besides the original manufacturer must make the product. Symbicort Drug Information. Advertisement"}, {"url": "http://www.internationaldrugmart.com/symbicort.shtml", "passage_text": "Generic Name: Budesonide–Formoterol. Generic for Symbicort* (Budesonide–Formoterol) is an inhaled corticosteroid medication used to prevent bronchospasm in people with asthma or chronic obstructive pulmonary disease (COPD). This combination medication reduces wheezing and trouble breathing caused by asthma or COPD. If your physician has instructed or directed you to use Generic for Symbicort* medication in a regular schedule and you have missed a dose of this medicine, use it as soon as you remember. However, if it is almost time for your next dose, then skip the missed dose and go back to your regular dosing schedule."}, {"url": "https://www.pharmacyrxworld.com/buy-Symbicort.html", "passage_text": "Symbicort or budesonide and formoterol fumarate dihydrate is used for the long-term maintenance treatment of patients with asthma. Budesonide reduces inflammation in the patient’s body, and formoterol relaxes the muscles in the patient’s airways in order to improve breathing. Your doctor will not recommend you to buy Symbicort if you are less than 12 years of age. Some mild side effects associated with Symbicort include headache, back pain, a stuffy nose, changes in the voice, joint or muscle pain, nausea, diarrhea, upset stomach, and vomiting."}, {"url": "https://www.northdrugstore.com/buy-Symbicort.html", "passage_text": "The active chemical ingredients of Symbicort are Budesonide and Formoterol. It is a long acting beta2 agonist and should be used only when asthma is severe enough and is uncontrolled by other medicines like inhaled corticosteroid. You should take only the prescribed amount of drug. Brand Symbicort is available as a turbuhaler while the generic is a regular inhaler device. Symbicort 100/6 is often used as a paediatric dose and may say so on the packaging, however, product is used in both adults and children. Symbicort Turbuhaler 160mcg/4.5mcg Manufactured by: AstraZeneca Product of Turkey."}]