[{"url": "https://en.wikipedia.org/wiki/Rosuvastatin", "passage_text": "Rosuvastatin, marketed as Crestor, is a member of the drug class of statins, used in combination with exercise, diet, and weight-loss to treat high cholesterol and related conditions, and to prevent cardiovascular disease. It was developed by Shionogi. "}, {"url": "http://www.medicalnewstoday.com/articles/8274.php", "passage_text": "By reducing blood cholesterol levels, statins lower the risk of chest pain (angina), heart attack, and stroke. Several types of statins exist such as atorvastatin, cerivastatin, fluvastatin, lovastatin, mevastatin, pitavastatin, pravastatin, rosuvastatin, and simvastatin. Atorvastatin and rosuvastatin are the most potent, while fluvastatin is the least potent."}, {"url": "http://www.webmd.com/cholesterol-management/news/20080401/statin-drug-crestor-slows-artery-plaque", "passage_text": "April 1, 2008 (Chicago) -- A trial of the statin drug Crestor has been halted early due to unequivocal evidence that it reduces heart attacks, strokes, and deaths due to cardiovascular disease in people with no signs of heart disease, says manufacturer AstraZeneca. "}, {"url": "http://articles.mercola.com/sites/articles/archive/2004/08/04/crestor1.aspx#!", "passage_text": "Crestor tablets contain the active ingredient rosuvastatin calcium, which is a type of medicine called a statin. It works by reducing the production of cholesterol by the liver. To reduce Crestor side effects, be sure your doctor has you on the lowest dose possible to lower you cholesterol. To know side effects you can visit here forum.internationaldrugmart.com/drug-information-f5/crestor-side-effec.."}, {"url": "http://www.rxlist.com/crestor-side-effects-drug-center.htm", "passage_text": "Crestor is available as a generic termed rosuvastatin or rosuvastatin calcium. Side effects of Crestor include headache, depression, muscle aches or pains, joint pain, sleep problems (insomnia or nightmares), constipation, nausea, stomach pain, indigestion, or diarrhea. "}, {"url": "http://www.rxlist.com/crestor-drug/medication-guide.htm", "passage_text": "CRESTOR is a prescription medicine that contains a cholesterol-lowering medicine called rosuvastatin calcium. CRESTOR is used along with diet to: 1  lower the level of your “bad” cholesterol (LDL). 2  increase the level of your “good” cholesterol (HDL). 3  lower the level of fat in your blood (triglycerides). Do not take CRESTOR if you: 1  are allergic to rosuvastatin calcium or any of the ingredients in CRESTOR. 2  See the end of this leaflet for a complete list of ingredients in CRESTOR. 3  have liver problems. 4  are pregnant or think you may be pregnant, or are planning to become pregnant. 5  CRESTOR may harm your unborn baby."}, {"url": "http://www.medicalnewstoday.com/articles/8274.php", "passage_text": "Statins are a class of medicines that are frequently used to lower blood cholesterol levels. The drugs are able to block the action of a chemical in the liver that is necessary for making cholesterol. Several types of statins exist such as atorvastatin, cerivastatin, fluvastatin, lovastatin, mevastatin, pitavastatin, pravastatin, rosuvastatin, and simvastatin. Atorvastatin and rosuvastatin are the most potent, while fluvastatin is the least potent."}, {"url": "http://www.webmd.com/drugs/2/drug-76704/crestor-oral/details", "passage_text": "Do not take any red yeast rice products while you are taking rosuvastatin because some red yeast rice products may also contain a statin called lovastatin. Taking rosuvastatin and red yeast rice products together can increase your risk of serious muscle and liver problems. Rosuvastatin is used along with a proper diet to help lower bad cholesterol and fats (such as LDL, triglycerides) and raise good cholesterol (HDL) in the blood. It belongs to a group of drugs known as  statins .. It works by reducing the amount of cholesterol made by the liver."}, {"url": "http://www.medicationsense.com/articles/july_sept_04/crestor_truth.php", "passage_text": "The standard starting dose of Crestor is 10 mg, which reduces LDL-C a whopping 46%-52%. 12 Some people, especially those with serious coronary disease, require this degree of LDL-C reduction, but most people with elevated cholesterol require only 20%-30% reductions -- and therefore much less medication. Statins impede atherosclerosis, reduce heart attacks and strokes, and cardiac death. Thus, the statins Lipitor and Zocor are not only the #1 and #2 top-selling drugs in America, but also household names. Other statins include Pravachol, Mevacor, and Lescol -- and now ultra-potent Crestor."}]