[{"url": "http://blog.zfeldman.com/2014-12-28-using-amazon-echo-to-control-lights-and-temperature/", "passage_text": "On the Echo web app (echo.amazon.com), you can go to the settings for an individual Echo unit and see its search history. Bingo! The following code allowed me to fire an event whenever a new search was added to the page, with its contents. Also, if I use the “stop” keyword after any command, Alexa basically ignores me. "}, {"url": "http://thenextweb.com/gadgets/2015/04/08/when-is-my-echo-coming/", "passage_text": "2 Comments. The elusive Amazon Echo, a voice-activated assistant for your home, got a new update today that’ll allow users to power appliances on and off using voice commands. Amazon partnered with Belkin’s connected home device WeMo and Philips Hue smart bulbs to enable voice control for products both companies support. All the user has to do is pair smart devices to their home’s Wi-Fi network and name the appliances. Then, you can use voice commands through the Echo, such as asking it to “dim the lights in the bedroom” or “turn on the coffee maker.”. The hardest part of using the Echo isn’t its voice feature, however – it’s getting your hands on one"}, {"url": "http://fortune.com/2015/08/27/amazon-echo-home-automation/", "passage_text": "So without further ado, here’s what you can and still can’t do with the Amazon Echo. Link it with Lutron lights: I love Lutron dimmers, and thanks to the link with the Wink hub I can now command my dining room lights, laundry room, and porch lights to go on and off or dim with my voice. Turn on your humidifier: Actually, this could work with any appliance that you plug into an outlet and can be left on all the time. Using an approved Z-wave (it’s a type of radio) outlet that works with SmartThings, you can ask Alexa to turn on your humidifier (or whatever you have named that outlet) and it happens."}, {"url": "https://www.amazon.com/gp/help/customer/display.html?nodeId=201602230", "passage_text": "Yes, you can turn Amazon Echo's microphone off by pushing the microphone on/off button on the top of your Amazon Echo. When the light ring around the top of Amazon Echo turns red, the microphone is off. Amazon Echo uses on-device keyword spotting to detect the wake word. When Amazon Echo detects the wake word, Amazon Echo streams audio to the Cloud, including a fraction of a second of audio before the wake word. 2."}, {"url": "https://www.amazon.com/gp/help/customer/display.html?nodeId=201602230", "passage_text": "Alexa is a cloud service. Activate Alexa by pressing the microphone button on your Alexa-enabled product, or for far-field Alexa-enabled devices like the Amazon Echo, by saying the wake word. Amazon Echo uses on-device keyword spotting to detect the wake word. When Amazon Echo detects the wake word, Amazon Echo streams audio to the Cloud, including a fraction of a second of audio before the wake word. 2."}, {"url": "http://www.zdnet.com/article/how-to-turn-amazon-echo-into-the-brains-of-your-smarthome/", "passage_text": "How to turn Amazon Echo into the brains of your smarthome. Follow these simple steps to introduce Alexa to your smarthome devices or hubs and your wish will be her command. No need for apps when you can just tell Alexa what to do. By Kevin Tofel for Mobile Platforms |. | Topic: Amazon. You'll also need it to link the Echo to any smarthome products. I also needed a companion app to set up my Wink hub. That too is a simple process as the app walks you through the steps: Create an account, plug in the hub and use the app to add bulbs, locks, thermostats, sensors or any other supported"}, {"url": "https://www.amazon.com/gp/help/customer/display.html?nodeId=201602230", "passage_text": "You can require a speakable confirmation code, turn purchasing off, and see product and order details in your Alexa App. Just like orders placed through Amazon.com, orders placed through Alexa are subject to Amazon's Conditions of Use and Privacy Notice. 7. Amazon Echo uses on-device keyword spotting to detect the wake word. When Amazon Echo detects the wake word, Amazon Echo streams audio to the Cloud, including a fraction of a second of audio before the wake word. 2."}, {"url": "https://www.yahoo.com/tech/amazons-echo-brings-the-star-trek-computer-to-124102850474.html", "passage_text": "“Alexa, turn off the living-room lights.” In one of Amazon’s recent feature updates, the Echo gained the ability to control home-automation gear from Wink, Belkin, and Philips (that is, the Philips Hue light bulbs). Here’s the complete list of compatible gear. On the very top is a power button and a mute button that means both “stop speaking” and “stop listening.”. The Echo is indeed listening all the time to the conversation in your home, but it doesn’t pay attention until you say, “Alexa.” (You can change the attention word to “Amazon,” but that’s your only option."}, {"url": "http://fortune.com/2015/08/27/amazon-echo-home-automation/", "passage_text": "The Echo doesn’t always do what I tell it to. Sometimes it’s the Echo and sometimes it’s the light or the wireless or a gremlin causing a glitch I can’t replicate, but when I tell the Echo to turn off the kitchen lights sometimes they all go off but one. Turn on your humidifier: Actually, this could work with any appliance that you plug into an outlet and can be left on all the time. Using an approved Z-wave (it’s a type of radio) outlet that works with SmartThings, you can ask Alexa to turn on your humidifier (or whatever you have named that outlet) and it happens."}]