[{"url": "http://www.ourbabynamer.com/meaning-of-Antonio.html", "passage_text": "Antonio is a form of the name Anthony. The name Anthony is derived from the old Roman clan or family name Antonius. Antonius is probably of Etruscan origin. Antonio is a variant spelling of Anthony. Anthony is the English form of the old Roman family name Antonius. Antonius is probably of Etruscan origin. The name was origianlly spelled without an h, Antony."}, {"url": "https://en.wikipedia.org/wiki/Antonio", "passage_text": "Look up Antonio in Wiktionary, the free dictionary. Antonio is a Spanish, Italian, and Portuguese first name of Latin origin. In the English language it is translated as Anthony, and has some female derivatives: Antonia, Antonia, Antónia, Antonieta, antonietta And. antonella The Greek versions of the name are Antonios and Antonis (αντώνης). The name derives from Antonius, a well known Latin family name, probably of Etruscan origin. The Roman general Marcus Antonius held that the origin of the name was Anthon, son of Hercules. This myth, recorded by Plutarch, was probably created by Marcus Antonius himself, in order to claim divine parentage."}, {"url": "http://www.answers.com/Q/Where_does_the_name_antonio_come_from", "passage_text": "the name antonio comes from the two brothers in spain that means rappers aka about to be famously popular. "}, {"url": "http://www.bexargenealogy.com/name.html", "passage_text": "An expedition led by Martin de Alarcon alarcón On may, 5 1718 founded The spanish army garrison known as the presidio De San antonio De. Bejar the name Honored Viceroy Balthazar manuel De zuniga Y Guzman sotomayor Y, sarmiento second son of The duke Of. bejar Since the founding of Bexar in the early 1700's, San Antonio has grown to become the second-largest city in the state of Texas and the seventh largest city in the United States."}, {"url": "http://www.sheknows.com/baby-names/name/antonio", "passage_text": "The name Antonio is a Shakespearean baby name. In Shakespearean the meaning of the name Antonio is: Two Gentlemen of Verona' Father to Proteus. 'The Merchant of Venice' The merchant. 'Much Ado About Nothing' Brother to Governor of Messina. 'The Tempest' The usurping Duke of Milan. Latin Meaning: The name Antonio is a Latin baby name. In Latin the meaning of the name Antonio is: Worthy of praise; of value. Saint Anthony is the patron sain of poor people. Famous Bearer: actor Anthony Hopkins."}, {"url": "http://www.sheknows.com/baby-names/name/antonio", "passage_text": "The name Antonio is a Spanish baby name. In Spanish the meaning of the name Antonio is: Beyond praise. American Meaning: The name Antonio is an American baby name. In American the meaning of the name Antonio is: Beyond praise. Latin Meaning: The name Antonio is a Latin baby name. In Latin the meaning of the name Antonio is: Worthy of praise; of value. Saint Anthony is the patron sain of poor people. Famous Bearer: actor Anthony Hopkins."}, {"url": "http://www.sheknows.com/baby-names/name/antonio", "passage_text": "The name Antonio is an English baby name. In English the meaning of the name Antonio is: Highly praiseworthy. From a Roman clan name. In the 17th century, the spelling Anthony was associated with the Greek anthos meaning flower. Latin Meaning: The name Antonio is a Latin baby name. In Latin the meaning of the name Antonio is: Worthy of praise; of value. Saint Anthony is the patron sain of poor people. Famous Bearer: actor Anthony Hopkins."}]