[{"url": "http://www.nature.com/scitable/topicpage/Translation-DNA-to-mRNA-to-Protein-393", "passage_text": "During transcription, the enzyme RNA polymerase (green) uses DNA as a template to produce a pre-mRNA transcript (pink). The pre-mRNA is processed to form a mature mRNA molecule that can be translated to build the protein molecule (polypeptide) encoded by the original gene. The resulting mRNA is a single-stranded copy of the gene, which next must be translated into a protein molecule. During translation, which is the second major step in gene expression, the mRNA is read according to the genetic code, which relates the DNA sequence to the amino acid sequence in proteins (Figure 2)."}, {"url": "http://www.jkaser.com/resources/Biology/Notes/Notes%20Chapter%2011%20Gene%20Expression.doc", "passage_text": "Gene expression begins when the enzyme RNA polymerase transcribes the DNA nucleotide sequence of a gene into a specific mRNA. During translation, this mRNA then migrates to a ribosome, where it is translated into a specific protein. 2. Describe the regulation of the lac operon in prokaryotes. "}, {"url": "https://en.wikipedia.org/wiki/Transcription_(genetics)", "passage_text": "Transcription is the first step of gene expression, in which a particular segment of DNA is copied into RNA (mRNA) by the enzyme RNA polymerase. The antisense strand of DNA is read by RNA polymerase from the 3' end to the 5' end during transcription (3' → 5'). The complementary RNA is created in the opposite direction, in the 5' → 3' direction, matching the sequence of the sense strand with the exception of switching uracil for thymine."}, {"url": "http://www.nature.com/scitable/topicpage/Translation-DNA-to-mRNA-to-Protein-393", "passage_text": "In the simplest sense, expressing a gene means manufacturing its corresponding protein, and this multilayered process has two major steps. In the first step, the information in DNA is transferred to a messenger RNA (mRNA) molecule by way of a process called transcription. The resulting mRNA is a single-stranded copy of the gene, which next must be translated into a protein molecule. During translation, which is the second major step in gene expression, the mRNA is read according to the genetic code, which relates the DNA sequence to the amino acid sequence in proteins (Figure 2)."}, {"url": "https://en.wikipedia.org/wiki/Gene_expression", "passage_text": "Gene expression is the process by which information from a gene is used in the synthesis of a functional gene product. These products are often proteins, but in non-protein coding genes such as transfer RNA (tRNA) or small nuclear RNA (snRNA) genes, the product is a functional RNA. In eukaryotes, transcription is performed by three types of RNA polymerases, each of which needs a special DNA sequence called the promoter and a set of DNA-binding proteins -- transcription factors —to initiate the process. RNA polymerase I is responsible for transcription of ribosomal RNA (rRNA) genes."}, {"url": "https://quizlet.com/24157116/gene-expression-flash-cards/", "passage_text": "transcription initiation complex. A complex assembly of proteins, including transcription factors and RNA polymerase, that binds to DNA at a specific site upstream of a gene called a promoter, where it initiates transcription of the gene sequence into RNA. (Ptokaryote). "}, {"url": "http://ghr.nlm.nih.gov/handbook/howgeneswork/makingprotein", "passage_text": "(A few genes produce other molecules that help the cell assemble proteins.) The journey from gene to protein is complex and tightly controlled within each cell. It consists of two major steps: transcription and translation. Together, transcription and translation are known as gene expression. During the process of transcription, the information stored in a gene’s DNA is transferred to a similar molecule called RNA (ribonucleic acid) in the cell nucleus. Both RNA and DNA are made up of a chain of nucleotide bases, but they have slightly different chemical properties. "}, {"url": "http://www.atdbio.com/content/14/Transcription-Translation-and-Replication", "passage_text": "Transcription is the process by which DNA is copied (transcribed) to mRNA, which carries the information needed for protein synthesis. Transcription takes place in two broad steps. First, pre-messenger RNA is formed, with the involvement of RNA polymerase enzymes. The pre-messenger RNA thus formed contains introns which are not required for protein synthesis. The pre-messenger RNA is chopped up to remove the introns and create messenger RNA (mRNA) in a process called RNA splicing (Figure 5)."}, {"url": "https://en.wikipedia.org/wiki/Gene_expression", "passage_text": "The production of RNA copies of the DNA is called transcription, and is performed in the nucleus by RNA polymerase, which adds one RNA nucleotide at a time to a growing RNA strand. This RNA is complementary to the template 3' → 5' DNA strand, which is itself complementary to the coding 5' → 3' DNA strand. In eukaryotes, transcription is performed by three types of RNA polymerases, each of which needs a special DNA sequence called the promoter and a set of DNA-binding proteins -- transcription factors —to initiate the process. RNA polymerase I is responsible for transcription of ribosomal RNA (rRNA) genes."}]