[{"url": "https://en.wikipedia.org/wiki/Primase", "passage_text": "Primase is of key importance in DNA replication because no known DNA polymerases can initiate the synthesis of a DNA strand without an initial RNA or DNA primer (for temporary DNA elongation). Primase catalyzes the synthesis of a short RNA (or DNA in some organisms) segment called a primer complementary to a ssDNA template."}, {"url": "http://dnareplication.cshl.edu/content/free/chapters/18_borowiec.pdf", "passage_text": "1B) (Matson 1986). Polarity is ascertained by identifying the duplex region that is denatured by the helicase. For helicases involved in DNA replication, the polarity of the reaction is strongly indicative of helicase placement on the leading (a 3 ' -5 'polarity) or lagging (a 5 +3 'polarity) strand. DNA HELICASE ASSAYS DNA helicases are often first detected by a DNA-dependent or DNA-stimulated NTPase activity. Verification of DNA helicase activity is then accomplished using an assay that reveals the conversion of double-stranded DNA (dsDNA) into two single strands."}, {"url": "http://www.nature.com/scitable/definition/helicase-307", "passage_text": "Helicases are enzymes that bind and may even remodel nucleic acid or nucleic acid protein complexes. There are DNA and RNA helicases. DNA helicases are essential during DNA replication because they separate double-stranded DNA into single strands allowing each strand to be copied. During DNA replication, DNA helicases unwind DNA at positions called origins where synthesis will be initiated. DNA helicase continues to unwind the DNA forming a structure called the replication fork, which is named for the forked appearance of the two strands of DNA as they are unzipped apart. The process of breaking the hydrogen bonds between the nucleotide base pairs in double-stranded DNA requires energy. To break the bonds, helicases use the energy stored in a molecule called ATP, which serves as the energy currency of cells."}, {"url": "http://study.com/academy/lesson/how-helicase-unwinds-the-dna-double-helix-in-preparation-for-replication.html", "passage_text": "DNA Helicase and Its Function in Replication. DNA helicase is an enzyme that unwinds the DNA double helix by breaking the hydrogen bonds between the complementary bases. It's easy to remember the name because it has part of the word helix in it. Lesson Summary. Let's review what we've learned so far. DNA helicase is the enzyme that unwinds the DNA double helix by breaking the hydrogen bonds down the center of the strand. It begins at a site called the origin of replication, and it creates a replication fork by separating the two sides of the parental DNA."}, {"url": "http://study.com/academy/lesson/dna-helicase-definition-role-function.html", "passage_text": "Lesson Summary. You should now understand that DNA helicase has a very important job to do. It is responsible for opening up our DNA to allow for replication as well as transcription of our DNA. A DNA helicase is an enzyme that functions by melting the hydrogen bonds that hold the DNA into the double helix structure. That is, until they meet DNA helicase. In order for DNA polymerase (in replication) or RNA polymerase (in transcription) to see the nucleotide bases that are to be used as a template, these hydrogen bonds must be broken to expose the much-needed the nucleotide bases."}, {"url": "https://www.ndsu.edu/pubweb/~mcclean/plsc431/eukarychrom/eukaryo2.htm", "passage_text": "The second two activities of DNA Pol I are important for replication, but DNA Polymerase III (Pol III) is the enzyme that performs the 5'-3' polymerase function. 1  Primase-The requirement for a free 3' hydroxyl group is fulfilled by the RNA primers that are synthesized at the initiation sites by these enzymes. Proteins of DNA Replication. 1  DNA Helicases-These proteins bind to the double stranded DNA and stimulate the separation of the two strands. 2  DNA single-stranded binding proteins-These proteins bind to the DNA as a tetramer and stabilize the single-stranded structure that is generated by the action of the helicases."}, {"url": "https://en.wikipedia.org/wiki/Primase", "passage_text": "From Wikipedia, the free encyclopedia. DNA primase, also called as DNA primerase, is an enzyme involved in the replication of DNA. DNA primase is a type of RNA polymerase which creates an RNA primer (later this RNA piece is removed by a 5' to 3' exonuclease); next, DNA polymerase uses the RNA primer to replicate ssDNA. Primase catalyzes the synthesis of a short RNA (or DNA in some organisms) segment called a primer complementary to a ssDNA template."}, {"url": "http://study.com/academy/lesson/dna-helicase-definition-role-function.html", "passage_text": "This is very similar to the role that DNA helicase plays in DNA replication: DNA helicase is the zipper. It unzips our DNA strands to allow space for attachment and to expose the nucleotides that are used as a template during DNA replication and transcription. That is, until they meet DNA helicase. In order for DNA polymerase (in replication) or RNA polymerase (in transcription) to see the nucleotide bases that are to be used as a template, these hydrogen bonds must be broken to expose the much-needed the nucleotide bases."}]