[{"url": "http://homeguides.sfgate.com/can-mow-lawn-after-fertilizing-46363.html", "passage_text": "When you mow the lawn after fertilizing, the clipped grass blades act as mulch barriers for the newly applied nutrients. Allowing the clippings to stay on the lawn provides the grass with other forms of organic nutrients to complement the fertilizer. In this case, you can mow directly after watering. A thorough watering across the entire lawn ensures the fertilizer is deeply embedded in the soil, rather than attaching itself to the grass blades."}, {"url": "http://www.talklocal.com/blog/2013/02/s/landscapers/how-soon-after-fertilizing-can-i-mow-lawn/", "passage_text": "- Don’t mow the lawn when the grass is wet. Mowing a wet or muddy lawn will damage the grass. - It is best to water in the fertilizer, so wait for the grass to dry completely before mowing your lawn. - Don’t cut the grass too short. Short grass has shallower roots and is less likely to withstand the summer heat. - Don’t wait too long to mow your lawn."}, {"url": "http://homeguides.sfgate.com/fertilize-grass-after-mowing-69637.html", "passage_text": "Fertilizer promotes healthy grass growth. When it comes to lawn maintenance, many factors determine how healthy, lush and green a lawn is. Lawns require regular mowing, water and fertilizer to keep them in pristine condition. When fertilizing a lawn, it is best to apply fertilizer after the lawn has been mowed so it has a few days to absorb the fertilizer. If you are using a rotary or drop spreader to spread 4 pounds of fertilizer over 1,000 square feet, set the blade to 3.5 if the spreader has a range from 1 to 10. Since many factors determine the setting for your spreader, check the fertilizer instructions to determine the blade setting if you are unsure."}, {"url": "http://www.ehow.com/info_8015745_can-mow-lawn-after-fertilizing.html", "passage_text": "Patience Pays Off. Your lawnmower, especially if it's equipped with a grass catcher, acts like a vacuum and sucks up the fertilizer before it can dissolve into the soil if you mow too soon. Waiting 24 to 48 hours allows most of the nutrients to soak into the soil. Mowing before you fertilize removes excessive growth and debris, like fallen leaves, so the fertilizer can reach the soil more quickly. Lawn fertilizers are usually applied to dry grass, unless the fertilizer also contains an herbicide."}, {"url": "http://homeguides.sfgate.com/can-mow-lawn-after-fertilizing-46363.html", "passage_text": "Fertilizing your lawn two to three times a year is one of the best ways to keep the soil's nutrients consistent to grow healthy grass. You should time your lawn mowing carefully after fertilizing to preserve the newly added nutrients within the miniature ecosystem. In this case, you can mow directly after watering. A thorough watering across the entire lawn ensures the fertilizer is deeply embedded in the soil, rather than attaching itself to the grass blades."}, {"url": "http://homeguides.sfgate.com/can-mow-lawn-after-fertilizing-46363.html", "passage_text": "If you use liquid fertilizer, mow after the lawn has completely dried. Depending on the climate, it could take a few hours to dry. To be absolutely sure the fertilizer has dried into the grass and soil structure, wait 24 hours so you do not cut away fertilizer still attached to the blades. In this case, you can mow directly after watering. A thorough watering across the entire lawn ensures the fertilizer is deeply embedded in the soil, rather than attaching itself to the grass blades."}, {"url": "http://homeguides.sfgate.com/can-mow-lawn-after-fertilizing-46363.html", "passage_text": "During the growing season, you should mow at least once a week. If you fertilize right after mowing, waiting an entire week for the next mowing cycle is a practical choice. But do not let the grass grow out of control by waiting longer than a week after fertilizing. In this case, you can mow directly after watering. A thorough watering across the entire lawn ensures the fertilizer is deeply embedded in the soil, rather than attaching itself to the grass blades."}, {"url": "http://www.talklocal.com/blog/2013/02/s/landscapers/how-soon-after-fertilizing-can-i-mow-lawn/", "passage_text": "If you are using fertilizer on your lawn, you may be asking, “how soon after fertilizing can I mow lawn?” To have the greenest and healthiest lawn possible, it is important to know when and under what conditions you should cut the grass. After fertilizing the lawn, you should wait 24-48 hours before mowing. Mowing too soon will just vacuum up the fertilizer, wasting valuable time and money. Even if your grass is looking a bit out of control, play it safe and wait about a day or two before mowing the lawn after fertilizing. Other helpful tips: Mowing a wet or muddy lawn will damage the grass. - It is best to water in the fertilizer, so wait for the grass to dry completely before mowing your lawn. - Don’t cut the grass too short. Short grass has shallower roots and is less likely to withstand the summer heat. - Don’t wait too long to mow"}, {"url": "https://answers.yahoo.com/question/index?qid=20060929165128AAUM8p9", "passage_text": "Rating Newest Oldest. Best Answer: if it is just fertilizer.. without weed control, you can mow after a good watering, if it has weed control you need to wait 24 hours, water, then anytime is good.. next time.. "}]