[{"url": "http://www.answers.com/Q/Where_was_St._Patrick_born", "passage_text": "He was born between 387 and 390 at Scotland as Maewyn Succat and died between 461 and 464 at Saul, County Down, Ireland of natural causes. St. Patrick was actually a missionar … y in Ireland that spent his later life converting druids over to Christianity, from Paganism. St.Patrick was born in the year 389 A.D.     St.Patrick was born in the year 389 A.D. 3 people found this useful. Edit. Share to: I am Flukey. 494,385 Contributions. I am an idealistic realist."}, {"url": "http://www.answers.com/Q/Where_was_St._Patrick_born", "passage_text": "St. Patrick was born in Roman Britain, either Scotland or Wales, of Roman parents. As current thinking goes, he was born in Kilpatrick, near Dumbarton, Scotland. St.Patrick was born in the year 389 A.D.     St.Patrick was born in the year 389 A.D. 3 people found this useful. Edit. Share to: I am Flukey. 494,385 Contributions. I am an idealistic realist."}, {"url": "http://www.answers.com/Q/What_year_was_St._Patrick_born", "passage_text": "He was born between 387 and 390 at Scotland as Maewyn Succat and died between 461 and 464 at Saul, County Down, Ireland of natural causes. St. Patrick was actually a missionar … y in Ireland that spent his later life converting druids over to Christianity, from Paganism. Saint Patrick is the patron saint of Ireland. He was enslaved for  some time, but afterward became a priest and missionary. Edit. Share to: William Howe. 361,903 Contributions. I was born a Catholic and have never wavered in my faith in over 70 years."}, {"url": "http://www.answers.com/Q/Where_was_St._Patrick_born", "passage_text": "The best educated guess as to his birth date is in year 387 CE. He was born (so current thinking goes) in Kilpatrick, near Dumbarton, Scotland. St. Patrick was born in the yea … r 387 but the month and date are not known. St.Patrick was born in the year 389 A.D.     St.Patrick was born in the year 389 A.D. 3 people found this useful. Edit. Share to: I am Flukey. 494,385 Contributions. I am an idealistic realist."}, {"url": "http://www.catholic.org/saints/saint.php?saint_id=89", "passage_text": "In His Footsteps: St. Patrick of Ireland is one of the world's most popular saints. Apostle of Ireland, born at Kilpatrick, near Dumbarton, in Scotland, in the year 387; died at Saul, Downpatrick, Ireland, 17 March, 461. Along with St. Nicholas and St. Valentine, the secular world shares our love of these saints. Patrick was born around 385 in Scotland, probably Kilpatrick. His parents were Calpurnius and Conchessa, who were Romans living in Britian in charge of the colonies. As a boy of fourteen or so, he was captured during a raiding party and taken to Ireland as a slave to herd and tend sheep."}, {"url": "http://catholicexchange.com/st-patrick", "passage_text": "The patron saint of Ireland, St. Patrick (389?-461) was born near the west coast of Britain, the son of a Roman civil servant. "}, {"url": "http://www.irish-genealogy-toolkit.com/history-of-st-patrick.html", "passage_text": "The history of St Patrick, the patron saint of Ireland who was born in the second half of the 4th century, is inevitably sketchy. Even his year of birth is uncertain, with some scholars hitting on 373 while others calculate 390. Similarly, the place where St Patrick was born cannot be confirmed. "}, {"url": "http://abcnews.go.com/US/st-patricks-day-things/story?id=13157282", "passage_text": "1. St. Patrick, the Apostle of Ireland, was born in the year 387 at Kilpatrick, near Dumbarton. Which is in Scotland. Making Ireland's patron saint ... Scottish. As a teenager, he was kidnapped by Irish raiders and enslaved as a shepherd for several years. He attributed his ability to persevere to his faith in God."}]