[{"url": "https://www.kanetix.ca/insurance-auto-hst-on-premiums", "passage_text": "1 You will not see any changes to your Ontario car insurance premiums. 2  Pre-harmonization, Ontario car insurance premiums were not taxed GST or PST, and will not be taxed with the HST. 3  You will not see any changes to your Ontario home insurance premiums. With the introduction of the HST in British Columbia: 1  You will not see any changes to your British Columbia car insurance premiums. 2  Pre-harmonization, BC car insurance premiums were not taxed GST or PST, and will not be taxed with the HST. 3  You will not see any changes to your BC"}, {"url": "http://www.sbpartners.ca/blog/2010/09/the-impact-of-hst-on-insurance-premiums-in-ontario/", "passage_text": "In addition, insurance premiums, as financial services, that were exempt from the GST will receive the same treatment and continue to be exempt under the HST. Input tax credit. The 8 percent tax is a provincially imposed tax and does not form part of the HST. "}, {"url": "http://www.cra-arc.gc.ca/tx/bsnss/tpcs/gst-tps/gnrl/menu-eng.html", "passage_text": "Generally, the harmonized sales tax (HST) applies to the same base of property and services as the GST. HST is imposed in provinces that have harmonized their provincial sales tax with the GST; these provinces are referred to as the “participating provinces”. The participating provinces are New Brunswick, Nova Scotia, Newfoundland and Labrador, Ontario and Prince Edward Island. "}, {"url": "https://www.insurancehotline.com/when-do-you-pay-the-deductible-on-your-car-insurance-policy/", "passage_text": "If you do not have Collision coverage on your car insurance policy, you may not be covered for this type of loss. In this situation, you will have to pay for any repairs, or replacement of your car at your expense. However, if you are able to identify the person who hit your car, the loss would then be covered under the Direct Compensation portion of your insurance policy, for which you do not have to pay a deductible. You are involved in an accident where you are not “at-fault”. If the insurance companies of the parties involved determine that you are not at-fault, you do not have to pay the deductible on your car insurance policy. Your repairs will be covered under the Direct Compensation portion of your policy, which is a mandatory coverage in Ontario"}, {"url": "http://www.taxtips.ca/gst/onhst.htm", "passage_text": "What is Taxable? Consumers now have to pay 13% HST on all goods and services on which they previously paid 5% GST, except for several items which were previously RST exempt and are not subject to the provincial portion of the HST. A GST registrant in BC or Ontario should not have been collecting the provincial portion of the HST prior to May 1, 2010, for goods or services provided in BC or Ontario, even if the goods or services were to be provided on or after July 1, 2010."}, {"url": "https://www.kanetix.ca/insurance-auto-hst-on-premiums", "passage_text": "With the introduction of the HST in Ontario: 1  You will not see any changes to your Ontario car insurance premiums. 2  Pre-harmonization, Ontario car insurance premiums were not taxed GST or PST, and will not be taxed with the HST. With the introduction of the HST in British Columbia: 1  You will not see any changes to your British Columbia car insurance premiums. 2  Pre-harmonization, BC car insurance premiums were not taxed GST or PST, and will not be taxed with the HST. 3  You will not see any changes to your BC home insurance premiums"}, {"url": "https://www.kanetix.ca/insurance-auto-hst-on-premiums", "passage_text": "With the introduction of the HST in Ontario: 1  You will not see any changes to your Ontario car insurance premiums. 2  You will not see any changes to your Ontario home insurance premiums. With the introduction of the HST in British Columbia: 1  You will not see any changes to your British Columbia car insurance premiums. 2  Pre-harmonization, BC car insurance premiums were not taxed GST or PST, and will not be taxed with the HST. 3  You will not see any changes to your BC"}, {"url": "http://www.ehow.com/info_7745645_there-gst-paid-car-insurance.html", "passage_text": "In both Australia and New Zealand, GST is added to the cost of car insurance. Insurance is not exempt from the tax in either country, and insurance companies must collect the tax and pay it to the respective government tax agency. In Australia, an insurance company does not pay the GST component of the cost of any repairs made to a car following an accident, if the car owner is a business that is GST registered. The insured business claims the GST back from the taxation department as a credit when filing the next GST return."}]