[{"url": "http://exploringorigins.org/rna.html", "passage_text": "RNA plays a central role in the pathway from DNA to proteins, known as the  Central Dogma  of molecular biology. An organism's genetic information is encoded as a linear sequence of bases in the cell's DNA. During the process known as transcription, a RNA copy of a segment of DNA, or messenger RNA (mRNA), is made. "}, {"url": "http://biology.about.com/od/molecularbiology/ss/rna.htm", "passage_text": "1 Ribosomal RNA (rRNA) is a component of cell organelles called ribosomes. 2  A ribosome consists of ribosomal proteins and rRNA. 3  Ribosomes are typically composed of two subunits: a large subunit and a small subunit. 4  Ribosomal subunits are synthesized in the nucleus by the nucleolus. 1 Transfer RNA (tRNA) plays an important role in the translation portion of protein synthesis. 2  Its job is to translate the message within the nucleotide sequences of mRNA into specific amino acid sequences."}, {"url": "http://www.thefreedictionary.com/RNA", "passage_text": "RNA. ribonucleic acid: any of a class of single-stranded nucleic acid molecules of ribose and uracil, found chiefly in the cytoplasm of cells and in certain viruses; important in protein synthesis and in the transmission of genetic information transcribed from DNA. Compare messenger RNA, ribosomal RNA, transfer "}, {"url": "http://biology.about.com/od/molecularbiology/ss/rna.htm", "passage_text": "1 Messenger RNA (mRNA) plays an important role in the transcription of DNA. 2  Transcription is the process in protein synthesis that involves copying the genetic information contained within DNA into an RNA message. 1 Transfer RNA (tRNA) plays an important role in the translation portion of protein synthesis. 2  Its job is to translate the message within the nucleotide sequences of mRNA into specific amino acid sequences."}, {"url": "http://www.biology-online.org/dictionary/Rna", "passage_text": "Rna. Definition. noun. Abbreviation for ribonucleic acid: a nucleic acid that is generally single stranded (double stranded in some viruses) and plays a role in transferring information from DNA to protein-forming system of the cell. Location: In eukaryotes, it is found in the nucleus and in the cytoplasm. Function: In some viruses, RNA is the genetic material. For most organisms, RNAs are involved in: 1  protein synthesis (e.g. mRNA, tRNA, rRNA, etc.). 2  post-transcriptional modification or DNA replication (e.g. snRNA, sno"}, {"url": "http://www.rnasociety.org/about/what-is-rna/", "passage_text": "RNA–in this role–is the “DNA photocopy” of the cell. When the cell needs to produce a certain protein, it activates the protein’s gene –the portion of DNA that codes for that protein–and produces multiple copies of that piece of DNA in the form of messenger RNA, or mRNA. A central tenet of molecular biology states that the flow of genetic information in a cell is from DNA through RNA to proteins: “DNA makes RNA makes protein”. Proteins are the workhorses of the cell; they play leading roles in the cell as enzymes, as structural components, and in cell signaling, to name just a few"}, {"url": "http://www.rnasociety.org/about/what-is-rna/", "passage_text": "Ribonucleic acid, or RNA is one of the three major biological macromolecules that are essential for all known forms of life (along with DNA and proteins). A central tenet of molecular biology states that the flow of genetic information in a cell is from DNA through RNA to proteins: “DNA makes RNA makes protein”. Proteins are the workhorses of the cell; they play leading roles in the cell as enzymes, as structural components, and in cell signaling, to name just a few"}, {"url": "https://en.wikipedia.org/wiki/RNA_Biology", "passage_text": "RNA Biology is a peer-reviewed scientific journal in the field of ribonucleic acid (RNA) research. It is indexed for MEDLINE. The editor-in-chief is Renee Schroeder (University of Vienna). "}, {"url": "http://www.bbc.co.uk/bitesize/higher/biology/cell_biology/rna/revision/1/", "passage_text": "The structure of RNA. RNA is a type of nucleic acid called ribonucleic acid 1  : The RNA nucleotides [nucleotide: a molecule built from a nitrogenous base (base containing nitrogen), a 5-carbon sugar (a pentose sugar) and a phosphate group] are joined to form a single strand. "}]