[{"url": "http://www.visitflindersisland.com.au/", "passage_text": "Competition Details. Flinders Island is the main island of the Furneaux group, a collection of 52 islands that stretch across Bass Strait between Tasmania and mainland Australia. Are you ready to discover these remarkable “mountains in the sea”. Flinders Island allows you to get away from it all and experience the holiday of a lifetime. An island of sparkling beaches with clear sapphire waters, rugged mountain ranges abundant with wildlife and flora."}, {"url": "http://www.discovertasmania.com.au/about/regions-of-tasmania/flinders-island", "passage_text": "Flinders Island. Flinders Island is located off mainland Tasmania's North East Coast and offers the ultimate escape with peace and quiet, natural beauty and plenty of local attractions. Flinders Island is a special place and offers a refreshing break from the real world. Regular flights to Flinders Island leave from Launceston, Tasmania or Essendon, Victoria"}, {"url": "http://www.about-australia.com/destinations/flinders-island/", "passage_text": "Flinders Island. More. Flinders Island lies 60 km off the north-east tip of Tasmania and has dramatic and varied landscapes – from the pink and grey granite cliffs of Strzelecki and Killiecrankie to the gentle, green farmland that rolls through the northern part of the island. "}, {"url": "https://en.wikipedia.org/wiki/Flinders_Island_(South_Australia)", "passage_text": "Flinders Island is an island in the Investigator Group off the coast of South Australia. It was named by Matthew Flinders after his younger brother Samuel Flinders, the second lieutenant on HMS Investigator in 1802. It is part of the Investigator Group Important Bird Area. The island has been subject to diamond exploration following the discovery of a wide range of kimberlite indicator minerals there."}, {"url": "http://www.visitflindersisland.com.au/", "passage_text": "It’s time to escape. Flinders Island is the main island of the Furneaux group, a collection of 52 islands that stretch across Bass Strait between Tasmania and mainland Australia. Flinders Island has much to offer. Are you ready to discover these remarkable “mountains in the sea”. Flinders Island allows you to get away from it all and experience the holiday of a lifetime. An island of sparkling beaches with clear sapphire waters, rugged mountain ranges abundant with wildlife and flora."}, {"url": "http://www.discovertasmania.com.au/about/regions-of-tasmania/flinders-island", "passage_text": "Explore this Location. Flinders Island is located off mainland Tasmania's North East Coast and offers the ultimate escape with peace and quiet, natural beauty and plenty of local attractions. Flinders Island is a special place and offers a refreshing break from the real world. Regular flights to Flinders Island leave from Launceston, Tasmania or Essendon, Victoria"}, {"url": "https://en.wikipedia.org/wiki/Flinders_Island", "passage_text": "Flinders Island is an island in Bass Strait. It is 54 kilometres (34 mi) from Cape Portland, the north-eastern tip of Tasmania, Australia and is the largest island in the Furneaux Group. From the late 19th century freehold land was given out, but it was not until the 1950s that a proper settlement scheme was initiated, mainly drawing settlers from mainland Tasmania and central New South Wales to Flinders Island's eastern shore. The Municipality of Flinders Island was instituted in 1903."}, {"url": "https://en.wikipedia.org/wiki/Flinders_Island", "passage_text": "Of these islands Flinders Island is the only island with more than one permanent settlement, and is by far the largest in the Furneaux Group. The island is about 62 km from north to south, and 37 km from east to west. with a total land area of 1,333 km². From the late 19th century freehold land was given out, but it was not until the 1950s that a proper settlement scheme was initiated, mainly drawing settlers from mainland Tasmania and central New South Wales to Flinders Island's eastern shore. The Municipality of Flinders Island was instituted in 1903."}, {"url": "https://en.wikipedia.org/wiki/Flinders_Island", "passage_text": "Later that year, Flinders returned and finished charting the islands in the Norfolk, he then went on to complete the first circumnavigation of Tasmania (1798–99), accompanied by George Bass, proving Tasmania to be an island separated from the Australian mainland by Bass Strait, later named in honor of George Bass. From the late 19th century freehold land was given out, but it was not until the 1950s that a proper settlement scheme was initiated, mainly drawing settlers from mainland Tasmania and central New South Wales to Flinders Island's eastern shore. The Municipality of Flinders Island was instituted in 1903."}]