[{"url": "https://www.kombuchakamp.com/what-is-kombucha/kombucha-mushroom-tea-brewing-safety-tips/types-of-sugar-to-use-for-brewing-kombucha", "passage_text": "Sugar is essential to brewing Kombucha Tea. These days, we are hyper-aware of sugar and consider it to be “bad.” However, as you know from drinking Kombucha, the sugar is clearly not for YOU but rather it is a fuel source for the SCOBY. Maple syrup is the concentrated sap of the maple tree. It is high in trace minerals such as zinc and manganese. These trace minerals will be passed on to you in your KT. It will add depth to your brew. Use 1/2-2/3 cup of maple syrup per 1 cup of sugar. Avoid commercial brands that also contain corn syrup."}, {"url": "https://www.kombuchakamp.com/what-is-kombucha/kombucha-mushroom-tea-brewing-safety-tips/types-of-sugar-to-use-for-brewing-kombucha", "passage_text": "CANE SUGAR. Cane sugar is the most common type of sugar that is used for brewing Kombucha. Most people use “plain white sugar” – you want to make sure the package says “cane sugar” on it or you are most likely using GMO Beet Sugar. Cane sugar has been used by humans for over 5000 years. Maple syrup is the concentrated sap of the maple tree. It is high in trace minerals such as zinc and manganese. These trace minerals will be passed on to you in your KT. It will add depth to your brew. Use 1/2-2/3 cup of maple syrup per 1 cup of sugar. Avoid commercial brands that also contain corn syrup."}, {"url": "http://users.bestweb.net/~om/~kombu/FAQ/part01b.html", "passage_text": "In response to the query about the carbohydrate content of Kombucha, the following was found in Christopher Hobbs book: In tea made with 1 cup of sugar to 3 quarts of water, fermented for 7 days -- there are about 4 grams of sugar in a 3-1/2 oz. glass. "}, {"url": "http://kombuchahome.com/types-of-sugar-to-use-for-brewing-kombucha/", "passage_text": "Types of Sugar for Kombucha. This is a list of sugars (from most process to least processed) that you can use to brew your kombucha. Keep in mind the type of sugar you choose will ultimately affect the brewing time (easier sugar to digest by SCOBY = shorter brew time) and the flavor profile of your kombucha. Other than the tea you use to make up to use as the liquid base for your kombucha brew, and the water you use to make that tea, a SCOBY doesn’t need anything other than a good source of energy, and that energy comes from the sugar you add to the tea."}, {"url": "http://www.happyherbalist.com/sugarswhichonetouse.aspx", "passage_text": "Technically in a ferment cycle there are two types of activities going on; one is fermentation (anaerobic-without oxygen) and the other respiration (aerobic-with oxygen). However in Kefir and Kombucha Tea Brewing (achieved aerobically-with oxygen) common usage refers to this process as fermentation. "}, {"url": "https://en.wikipedia.org/wiki/Kombucha", "passage_text": "Kombucha including the culture. Kombucha refers to any of a variety of fermented, lightly effervescent sweetened black or green tea drinks that are commonly used as functional beverages for their unsubstantiated health benefits. "}, {"url": "http://organic-kombucha.com/types_of_sugar.html", "passage_text": "With so many different types of sugar available today, there are many questions about which types of sugar food can be used for proper kombucha culture growth and health. Because we use only organic tea and organic sugar for our brewing process, we believe this makes our cultures some of the purest, giving them extra strength, vitality, and enhances their beneficial properties! Incorporate Kombucha tea/Manchurian tea as part of your daily practice to aid you in your health and healing."}, {"url": "http://kombuchahome.com/types-of-sugar-to-use-for-brewing-kombucha/", "passage_text": "In this article, you’ll find out about the different types of sugar that SCOBYs can use in the kombucha brewing process. NOTE: The action of the SCOBY will change depending on the type of tea you select, so each different combination of tea and sweetener will create a different brew. To learn about the different types of tea for Kombucha brewing, read our Best Teas for Kombucha. Other than the tea you use to make up to use as the liquid base for your kombucha brew, and the water you use to make that tea, a SCOBY doesn’t need anything other than a good source of energy, and that energy comes from the sugar you add to the tea."}, {"url": "https://www.kombuchakamp.com/basic-kombucha-faq/kombucha-and-sugar-faq", "passage_text": "However, the sugar in Kombucha is for the culture to consume, not for you. When done fermenting, there will be about 2-6 grams per 8 ounce glass of unflavored Kombucha. By contrast, an 8 ounce glass of orange juice has about 24g of sugar. Even natural carrot juices have 13g per 8 ounces. Most sugars are fine for Kombucha (with a few exceptions, see below), but there are preferred choices: 1  Plain White Sugar – the Kombucha culture consumes this easiest. 2  Use only “cane sugar” to avoid GMO beet sugar. 3  Concerns about trace toxins in white sugar processing should be considered."}, {"url": "http://kombuchahome.com/types-of-sugar-to-use-for-brewing-kombucha/", "passage_text": "The type of sugar you choose will affect the brew time, the flavor, and the nutrients in your kombucha. In addition, some types of sugar may affect or even harm your SCOBY. That’s why it’s a good idea to stick to white sugar until you have a good supply of backup SCOBYs in your SCOBY hotel. Other than the tea you use to make up to use as the liquid base for your kombucha brew, and the water you use to make that tea, a SCOBY doesn’t need anything other than a good source of energy, and that energy comes from the sugar you add to the tea."}]