[{"url": "http://www.efile.com/efile-oregon-income-tax-return-file-or-state-taxes-form-refund/", "passage_text": "Form 40-EXT. Oregon accepts automatic federal tax return extensions. If you file a federal tax return extension, check the extension filed box on your OR state return when you file it. You're not required to include a copy of your federal extension with your OR state return. If you're expecting a OR state refund, check the extension box (7b) on your OR state tax return. If you owe Oregon state tax, complete and detach Form 40-EXT (payment voucher). How to file an Oregon Tax Extension How to file an Oregon Tax Amendment Prepare and efile Your Oregon Tax Return The efile.com tax software makes it easy for you to efile your state tax return and use the correct state tax forms."}, {"url": "http://www.olt.com/main/home/stateextensions.asp", "passage_text": "1 Apply for a state extension (Form 204). 2  To apply for a state extension, file Arizona Form 204 by April 15. 3  See Form 204 for details. 4  You do not have to attach a copy of the extension to your return when you file, but make sure that you check box 82F on page 1 of the return. Montana personal income tax is due on April 15th. You are granted an automatic extension of time of up to six months for filing your Montana income tax return if one of the following applies to you: You do not need to apply for a federal extension in order to receive a Montana extension."}, {"url": "http://www.ehow.com/info_7754255_filing-extension-include-state-taxes.html", "passage_text": "Nebraska requires attachment of Form 4868 or 2688 to the state tax return. New Mexico recognizes the federal form or state Form RPD-41096. Ohio has no state extension form and uses the federal form. North Dakota, Oklahoma and Oregon accept the federal extension, but Oregon requires Form 40-EXT if you owe taxes. Pennsylvania accepts the federal extension. Rhode Island recognizes a federal extension if you owe no taxes. South Carolina recognizes Form 4868 but requires Form SC4868 if you owe taxes. Alabama has state Form 4868A and doesn't accept IRS Form 4868. Connecticut requires Form CT-1040 EXT for an extension. Delaware gives a four-month extension when filing Form 1027. Idaho allows a six-month extension to pay state taxes with filing Form 51."}, {"url": "http://www.expressextension.com/statetaxextension/michigan/", "passage_text": "1 If, at the time the extension is filed, it is determined additional Michigan tax is due, send the amount due and a completed Form 4 or a copy of your federal extension form. 2  If filing Form 4, do not send a copy of the federal extension to Treasury. 3  Retain a copy for your records. You may be charged a penalty of 10 percent or more if the balance due is not paid with your extension request.When you file your MI-1040, include on line 30 the amount of tax you paid with your extension request. Attach a copy of your federal or state extension to your return."}, {"url": "http://www.tax.ohio.gov/ohio_individual/individual/filingforanextension.aspx", "passage_text": "Filing For an Extension. You must first qualify for a federal extension. Ohio does not have an Ohio extension form but honors the federal extension. You should attach to the Ohio income tax return a copy of your extension or your extension confirmation number or a printed copy of the federal acknowledgment. "}, {"url": "http://www.olt.com/main/home/stateextensions.asp", "passage_text": "Extensions must be filed by the due date of the return, April 15th.If you received a federal extension and are expecting an Oregon refund, do not use Form 40-EXT. Oregon will allow the same extension. PennsylvaniaThe Department will grant an extension of time to file a PA income tax return up to six months. Montana personal income tax is due on April 15th. You are granted an automatic extension of time of up to six months for filing your Montana income tax return if one of the following applies to you: You do not need to apply for a federal extension in order to receive a Montana"}, {"url": "http://www.ehow.com/info_7754255_filing-extension-include-state-taxes.html", "passage_text": "Arizona accepts federal extension forms or you may file state Form 204. Arkansas, Kentucky, Louisiana and Indiana accept the federal extension. Georgia allows federal forms or state Form IT-303. Hawaii, Kansas and Maryland recognize federal extensions but just for a four-month extension. Michigan allows Form 4868 or Form 4 with payment due. Alabama has state Form 4868A and doesn't accept IRS Form 4868. Connecticut requires Form CT-1040 EXT for an extension. Delaware gives a four-month extension when filing Form 1027. Idaho allows a six-month extension to pay state taxes with filing Form 51."}, {"url": "http://www.expressextension.com/statetaxextension/michigan/", "passage_text": "Treasury will extend the due date to your new federal due date. If you do not have a federal extension, file an Application for Extension of Time to File Michigan Tax Returns (Form 4) with your payment. Treasury will not notify you of approval. Do not file an extension if you will be claiming a refund. You may be charged a penalty of 10 percent or more if the balance due is not paid with your extension request.When you file your MI-1040, include on line 30 the amount of tax you paid with your extension request. Attach a copy of your federal or state extension to your return."}, {"url": "http://www.olt.com/main/home/stateextensions.asp", "passage_text": "If no income tax is anticipated to be due on your return and you have been granted a federal extension of time to file a federal income tax return, the department will accept the federal extension. In this case, you do not need to send SC a copy of the federal form by the due date. Montana personal income tax is due on April 15th. You are granted an automatic extension of time of up to six months for filing your Montana income tax return if one of the following applies to you: You do not need to apply for a federal extension in order to receive a Montana"}, {"url": "http://www.expressextension.com/statetaxextension/northdakota/", "passage_text": "You do not have to file a separate state extension form, nor do you have to notify the Office of State Tax Commissioner that you have obtained a federal extension prior to filing your North Dakota return. When you file your North Dakota return, check the appropriate block on the front page of your North Dakota return. Individuals, s-corporations, partnerships and fiduciaries do not need to attach a copy of the federal extension to the state return, but it must be retained on file in case the Office of State Tax Commissioner requests to see it."}]