[{"url": "http://www.biography.com/people/gregor-mendel-39282", "passage_text": "Gregor Mendel was an Austrian monk who discovered the basic principles of heredity through experiments in his garden. Mendel's observations became the foundation of modern genetics and the study of heredity, and he is widely considered a pioneer in the field of genetics."}, {"url": "http://www.csuchico.edu/~jbell/Biol207/mendel.html", "passage_text": "Mendel's Hypothesis One major difficulty with Darwin's theory of evolution by natural selection was caused by the belief in blending inheritance. traits of the parents are blended together to produce progeny big crossed to little will produce intermediate sized children, etc."}, {"url": "http://www.biography.com/people/gregor-mendel-39282", "passage_text": "Synopsis. Gregor Mendel, known as the father of modern genetics, was born in Austria in 1822. A monk, Mendel discovered the basic principles of heredity through experiments in his monastery's garden."}, {"url": "http://knowgenetics.org/mendelian-genetics/", "passage_text": "In the 1860’s, an Austrian monk named Gregor Mendel introduced a new theory of inheritance based on his experimental work with pea plants. Prior to Mendel, most people believed inheritance was due to a blending of parental ‘essences’, much like how mixing blue and yellow paint will produce a green color."}, {"url": "https://www.dnalc.org/view/16151-Biography-1-Gregor-Mendel-1822-1884-.html", "passage_text": "Gregor Mendel (1822-1884). Gregor Mendel, through his work on pea plants, discovered the fundamental laws of inheritance. He deduced that genes come in pairs and are inherited as distinct units, one from each parent. Mendel tracked the segregation of parental genes and their appearance in the offspring as dominant or recessive traits."}, {"url": "http://evolution.about.com/od/scientists/p/Gregor-Mendel.htm", "passage_text": "Mendel's work wasn't truly appreciated until the 1900s -- long after his death. Mendel had unknowingly provided the Theory of Evolution with a mechanism for the passing down of traits during natural selection. Mendel did not believe in evolution during his life as a man of strong religious conviction."}, {"url": "http://www.nature.com/scitable/topicpage/gregor-mendel-and-the-principles-of-inheritance-593", "passage_text": "The way in which traits are passed from one generation to the next-and sometimes skip generations-was first explained by Gregor Mendel. By experimenting with pea plant breeding, Mendel developed three principles of inheritance that described the transmission of genetic traits, before anyone knew genes existed."}, {"url": "http://www.dnaftb.org/1/bio.html", "passage_text": "Gregor Mendel, through his work on pea plants, discovered the fundamental laws of inheritance. He deduced that genes come in pairs and are inherited as distinct units, one from each parent. Mendel tracked the segregation of parental genes and their appearance in the offspring as dominant or recessive traits."}]