[{"url": "http://www.miamiherald.com/sports/nba/miami-heat/article25754842.html", "passage_text": "Meet the Miami Heat's top draft pick Justise Winslow. Miami Heat President Pat Riley gushes over the Heat's new draft pick 19-year-old Justise Winslow, who is described as having the it factor. Riley and coach Erik Spoelstra describe this new player as versatile and mature. Video by Jessica Bal / Miami H."}, {"url": "http://www.usatoday.com/story/sports/ncaab/2015/04/06/justise-winslow-duke-nba-draft-lottery-pick-ncaa-tournament/25338631/", "passage_text": "Justise Winslow, a freshman at Duke projected to be an NBA lottery pick in June, likely will be playing his last college game Monday night when Duke faces Wisconsin for the national championship. Yet his father, former pro player Rickie Winslow, is opposed to players going to the NBA after one year of college."}, {"url": "http://ftw.usatoday.com/2015/06/miami-heat-justise-winslow-nba-draft-pat-riley", "passage_text": "Pat Riley did it again. The Miami Heat had the steal of the NBA Draft on Thursday night when Justise Winslow fell into their laps with the 10th pick. It’s a perfect matchup of player and team, and Miami Heat fans have to be walking on air this morning. Bob Donnan-USA TODAY Sports. Before we get to how this happened, let’s talk about Winslow."}, {"url": "http://www.miamiherald.com/sports/nba/miami-heat/article25535086.html", "passage_text": "Presumably to remedy that deficiency, the Heat selected Justise Winslow with the 10th pick in the 2015 NBA Draft on Thursday. Winslow, a freshman, does other things well besides shoot, of course, but his range is an immediate need."}, {"url": "http://www.browardpalmbeach.com/news/justise-winslow-drafted-by-miami-heat-a-steal-7073084", "passage_text": "With the 10th pick in the 2015 #NBADraft, the @MiamiHEAT select Justise Winslow. pic.twitter.com/4ZkauCbM9a. In our draft preview on Thursday, we predicted Winslow as a dark horse pick for the Heat, mainly because odds were against his being there when it was Miami's turn to pick."}]