[{"url": "http://www.answers.com/Q/How_long_does_it_take_to_become_a_brain_surgeon", "passage_text": "4.) Once in a residency program it will depend upon which field you enter as to how long your residency will be. Some are 3 years such as family practice. Surgeons can be in a residency program for 4 to 5 years. Once you are in a residency program you can specialize in your chosen field. To become a brain surgeon you need to take the following steps: 1.) Graduate from high school and apply and get accepted to a university. 2.) At a 4 year university get good grades (average is about a 3.5), do well on an admissions test (MCAT) and apply to medical schools."}, {"url": "http://www.wikihow.com/Become-a-Surgeon", "passage_text": "4. Complete medical school. Most programs take four years to complete, and will earn you either a Doctor of Medicine (M.D.) or Doctor of Osteopathic Medicine (D.O.). During the first two years, students study anatomy, biochemistry, psychology, medical ethics, and other subjects in classroom and laboratory settings. 5. Complete a residency program. Once you have graduated from medical school, you will need to complete a surgical residency program in a specialized area. Residencies vary in duration, lasting from 3 to 8 years, and involve working in hospitals and treating patients under the supervision of other doctors."}, {"url": "https://answers.yahoo.com/question/index?qid=20070916103120AAmvumV", "passage_text": "Medical school is 4 years. It's the same 4 years regardless of what specialty you are interested in. Residency is your training after med school. Surgical residencies vary from 5 - 7 years, and you can add more time on if you want to practice a surgical subspecialty. So, it can be done in as little as 12 years, or as long as 15 years or more."}, {"url": "http://www.answers.com/Q/How_long_does_it_take_to_become_a_brain_surgeon", "passage_text": "For neurosurgery 7 years is typical. To become a brain surgeon you need to take the following steps: 1.) Graduate from high school and apply and get accepted to a university. 2.) At a 4 year university get good grades (average is about a 3.5), do well on an admissions test (MCAT) and apply to medical schools. 3.) Attend a 4 year medical schoo"}, {"url": "http://www.answers.com/Q/How_long_does_it_take_to_become_a_plastic_surgeon", "passage_text": "(Plus or minus a few years.)    To become a brain surgeon you need to take the following steps: 1.) Graduate from high school and apply and get accepted to a university. 2.) At a 4 year university get good grades (average is about a 3.5), do well on an admissions test (MCAT) and apply to medical schools. To become a brain surgeon you need to take the following steps: 1.) Graduate from high school and apply and get accepted to a university. 2.) At a 4 year university you will w … ork towards a bachelors degree in pre-medicine or pre-health with at least a GPA of 3.5 or better."}, {"url": "http://www.answers.com/Q/How_long_does_it_take_to_become_a_plastic_surgeon", "passage_text": "3.) You will attend a 4 year medical school. Near graduation you will need to apply for a residency program at a graduate school of medicine. 4.) Once in a residency program it will depend upon which field you enter as to how long your residency will be. Some are 3 years such as family practice. Surgeons can be in a residency program for 4 to 5 years. Once you are in a residency program you can specialize in your chosen field. So the total time to become a brain surgeon or Neurosurgeon, not counting high school, is roughly 12 years. To become a brain surgeon you need to take the following steps: 1.) Graduate from high school and apply and get accepted to a university. 2.) At a 4 year university you will w … ork towards a bachelors degree in pre-medicine or pre-health with at least a GPA of 3.5 or better."}, {"url": "http://www.answers.com/Q/How_long_does_it_take_to_become_a_brain_surgeon", "passage_text": "To become a brain surgeon you need to take the following steps: 1.) Graduate from high school and apply and get accepted to a university. 2.) At a 4 year university you will work towards a bachelors degree in pre-medicine or pre-health with at least a GPA of 3.5 or better. To become a brain surgeon you need to take the following steps: 1.) Graduate from high school and apply and get accepted to a university. 2.) At a 4 year university get good grades (average is about a 3.5), do well on an admissions test (MCAT) and apply to medical schools."}, {"url": "http://www.howlongdoes.com/life/how-long-does-it-take-to-become-a-doctor/", "passage_text": "After you finish your undergraduate training and are accepted to medical school, you begin medical training. Medical school is a four year program. The first two years are spent in classrooms and lecture halls, and you will learn the fundamentals of the human body, disease, pharmacology, and body systems. "}, {"url": "http://www.bls.gov/ooh/healthcare/physicians-and-surgeons.htm", "passage_text": "Physicians and surgeons have demanding education and training requirements. Almost all physicians complete at least 4 years of undergraduate school, 4 years of medical school, and, depending on their specialty, 3 to 8 years in internship and residency programs. "}]