[{"url": "http://www.healthaliciousness.com/articles/high-vitamin-D-foods.php", "passage_text": "Natural foods high in vitamin D include fish oils, fatty fish, mushrooms, beef liver, cheese, and egg yolks. Vitamin D is also naturally made by your body when you expose your skin to the sun, and is called the sun-shine vitamin. In addition, vitamin D is widely added to many foods such as milk and orange juice, and can also simply be consumed as a supplement. Below is a list of high vitamin D foods, for more see the list of foods rich in vitamin D2 (Ergocalciferol) and foods rich in vitamin D3 (Cholecalciferol) ."}, {"url": "http://www.nhs.uk/Conditions/vitamins-minerals/Pages/Vitamins-minerals.aspx", "passage_text": "Fat-soluble vitamins. Fat-soluble vitamins are found mainly in fatty foods and animal products, such as vegetable oils, milk and dairy foods, eggs, liver, oily fish and butter. While your body needs these vitamins every day to work properly, you don't need to eat foods containing them every day."}, {"url": "http://www.nhs.uk/Conditions/vitamins-minerals/Pages/Vitamins-minerals.aspx", "passage_text": "There are two types of vitamins: fat-soluble and water-soluble. Fat-soluble vitamins are found mainly in fatty foods and animal products, such as vegetable oils, milk and dairy foods, eggs, liver, oily fish and butter."}, {"url": "http://ods.od.nih.gov/factsheets/VitaminD-HealthProfessional/", "passage_text": "Food. Very few foods in nature contain vitamin D. The flesh of fatty fish (such as salmon, tuna, and mackerel) and fish liver oils are among the best sources [ 1, 11 ]. Small amounts of vitamin D are found in beef liver, cheese, and egg yolks. Vitamin D in these foods is primarily in the form of vitamin D 3 and its metabolite 25(OH)D 3 [ 12 ]. Some mushrooms provide vitamin D 2 in variable amounts [ 13, 14 ]."}, {"url": "http://ods.od.nih.gov/factsheets/VitaminD-HealthProfessional/", "passage_text": "Vitamin D is a fat-soluble vitamin that is naturally present in very few foods, added to others, and available as a dietary supplement. It is also produced endogenously when ultraviolet rays from sunlight strike the skin and trigger vitamin D synthesis."}]