[{"url": "http://www.landcareresearch.co.nz/science/living/indigenous-knowledge/land-use/values", "passage_text": "Māori Values Definition. Motueka River. Image-Adrienne Farr. From the discussions a definition of Māori values was developed: 'any natural resource, area, place, or thing (tangible or intangible) which is of physical, economic, social, cultural, historic, and/or spiritual significance to tangata whenua' . Any definition must take into account the sense of identity and belonging to land, water, and air. Traditionally, land was not something that could be owned or traded as a commodity. Māori did not seek or possess anything, it was more important to belong."}, {"url": "http://www.oxforddictionaries.com/definition/english/tangata-whenua", "passage_text": "1 In New Zealand, Maori are tangata whenua, people of the land; pakeha, the whites, or visitors, are their other. 2  The ISA favours ancestral connection as a ‘given’, requiring proof only for its boundaries, and given the cultural context of maori as tangata whenua, this is fair enough. 1"}, {"url": "https://en.wikipedia.org/wiki/Tangata_whenua", "passage_text": "Tangata whenua (. [ˈtaŋata ˈfɛnʉ.a]) is a Māori term of the indigenous peoples of New Zealand and literally means people of the land, from tangata, 'people' and whenua 'land'. Whenua means both land and placenta (again referencing Williams, who lists five definitions). Unlike European thought where people own land, in Māori the land is regarded as a mother to the people. The relationship to land is not dissimilar to that of the foetus to the placenta."}, {"url": "http://seniorsecondary.tki.org.nz/The-arts/Pedagogy/Culturally-responsive-learning-environments/Tangata-whenuatanga", "passage_text": "Tangata whenuatanga. Tangata whenuatanga represents place-based, socio-cultural awareness and knowledge of the whenua or land we come from. This competency actively: 1  harnesses the rich cultural capital which Māori learners bring to the classroom by providing culturally responsive and engaging contexts for learning. Teachers engage with students as learners and facilitators by generating opportunities for students to use 'who they are' and bring 'what they know' into the learning through culturally responsive contexts."}, {"url": "https://en.wikipedia.org/wiki/Tangata_whenua", "passage_text": "According to Williams' definitive Dictionary of the Māori Language, tangata means man or human being, whilst tāngata (with the long ā) is the plural meaning people; tangata (without the macron) can also mean people in reference to a group with a singular identity. Whenua means both land and placenta (again referencing Williams, who lists five definitions). Unlike European thought where people own land, in Māori the land is regarded as a mother to the people. The relationship to land is not dissimilar to that of the foetus to the placenta."}, {"url": "http://maoridictionary.co.nz/word/3452", "passage_text": "mana whenua. 1. (noun) territorial rights, power from the land, authority over land or territory, jurisdiction over land or territory-power associated with possession and occupation of tribal land."}, {"url": "https://en.wikipedia.org/wiki/Tangata_whenua", "passage_text": "The notion of tangata whenua is sometimes contrasted with that of tangata tiriti – literally, the people of the Treaty. Tangata tiriti refers to non-indigenous New Zealanders, who are in the country by virtue of the Treaty of Waitangi. It is close to, but not necessarily synonymous with, the term Pākehā. Whenua means both land and placenta (again referencing Williams, who lists five definitions). Unlike European thought where people own land, in Māori the land is regarded as a mother to the people. The relationship to land is not dissimilar to that of the foetus to the placenta."}, {"url": "http://www.oxforddictionaries.com/definition/english/tangata-whenua", "passage_text": "Used to describe the Maori people of a particular locality, or as a whole as the original inhabitants of New Zealand. Example sentences. 1  In New Zealand, Maori are tangata whenua, people of the land; pakeha, the whites, or visitors, are their other. 2  The ISA favours ancestral connection as a ‘given’, requiring proof only for its boundaries, and given the cultural context of maori as tangata whenua, this is fair enough. 1"}]