[{"url": "http://adrc.ohhs.ri.gov/wheretolive/nursing_homes.php", "passage_text": "Long term care in a nursing home can cost an individual as much as $6,000 a month or more. Medicare and other health insurance may only pay for temporary care or rehabilitation. Medicare or most health insurance does not cover long term care on an on-going basis."}, {"url": "https://www.northwesternmutual.com/about-us/studies/cost-of-long-term-care-study", "passage_text": "For the Cost of Long-Term Care Study, over 2,000 nursing homes were surveyed in December 2012. Key findings include: 1  The national average annual cost of a private room in a nursing home based on the regions in the study is $91,305 per year."}, {"url": "http://www.seniorhomes.com/s/rhode-island/nursing-homes/", "passage_text": "The average cost of Nursing Homes in Rhode Island is $255. Nursing Homes costs range from $167 to $338 depending on location and other factors. While prices seem high, nursing homes provide a level of quality care unmatched in most other environments. There are programs that can help defray the cost."}, {"url": "http://longtermcare.gov/costs-how-to-pay/costs-of-care/", "passage_text": "Costs of Care. Some average costs for long-term care in the United States (in 2010) were: 1  $205 per day or $6,235 per month for a semi-private room in a nursing home. 2  $229 per day or $6,965 per month for a "}, {"url": "http://www.newyorklife.com/products/long-term-care-cost", "passage_text": "By considering the costs listed below, you can begin to get a sense for how quickly long-term care expenses can add up. Nursing home care. According to the 2014 New York Life Insurance Company (New York Life) Cost of Care Survey, the average annual cost of nursing home care in a private room was $95,706 per year 2."}, {"url": "http://cgi.money.cnn.com/tools/elder_care/elder_care_cost_finder.html", "passage_text": "The costs of long-term care vary widely. Using the average costs in an area closest to you, this tool helps you determine how much you need to save or whether you should consider buying long-term care insurance. (For more on if you need such insurance, click here.)."}]