[{"url": "http://www.ehow.com/info_12177431_minimum-size-attics-access.html", "passage_text": "According to the 2006 International Residential Code (R807.1 Attic Access), homes with combustible materials in the ceiling and roof construction must have an access to attic areas that exceeds 30 square feet and with a vertical height of 30 inches or greater."}, {"url": "http://www.seiflorida.com/wp-content/uploads/2013/01/Bulletin-12-001-Attic-Spaces.pdf", "passage_text": "2010 Florida Building Code Building: 1209.2 Attic Spaces. An opening not less than 20 inches by 30 inches (559 mm by 762 mm) shall be provided to any attic area having a clear height of over 30 inches (762 mm). A 30-inch (762 mm) minimum clear headroom in the attic space shall be provided at or above the access opening."}, {"url": "http://publicecodes.cyberregs.com/icod/irc/2009/icod_irc_2009_8_sec007.htm", "passage_text": "SECTION R807 ATTIC ACCESS R807.1 Attic access. Buildings with combustible ceiling or roof construction shall have an attic access opening to attic areas that exceed 30 square feet (2.8 m 2) and have a vertical height of 30 inches (762 mm) or greater."}, {"url": "http://www.seiflorida.com/wp-content/uploads/2013/01/Bulletin-12-001-Attic-Spaces.pdf", "passage_text": "When the access is located in a ceiling, minimum unobstructed headroom in the attic space shall be 30 inches (762mm) at some point above the access measured vertically from the bottom of ceiling framing members. See Section M1305.1.3 for access requirements where mechanical equipment is located in the attics."}, {"url": "http://ths.gardenweb.com/discussions/2597609/is-there-a-minimum-size-for-attic-trap-door", "passage_text": "When located in a wall, the opening shall be a minimum of 22 inches wide by 30 inches high. When the access is located in a ceiling, minimum unobstructed headroom in the attic space shall be 30 inches (762 mm) at some point above the access measured vertically from the bottom of ceiling framing members."}, {"url": "http://publicecodes.cyberregs.com/icod/irc/2009/icod_irc_2009_8_sec007.htm", "passage_text": "The rough-framed opening shall not be less than 22 inches by 30 inches (559 mm by 762 mm) and shall be located in a hallway or other readily accessible location. When located in a wall, the opening shall be a minimum of 22 inches wide by 30 inches high. When the access is located in a ceiling, minimum unobstructed headroom in the attic space shall be 30 inches (762 mm) at some point above the access measured vertically from the bottom of ceiling framing members. See Section M1305.1.3 for access requirements where mechanical equipment is located in attics."}]