[{"url": "http://www.cancer.gov/types/head-and-neck/patient/nasopharyngeal-treatment-pdq", "passage_text": "1 Nasopharyngeal cancer is a disease in which malignant (cancer) cells form in the tissues of the nasopharynx. 2  Ethnic background and being exposed to the Epstein-Barr virus can affect the risk of nasopharyngeal cancer. 3  Signs of nasopharyngeal cancer include trouble breathing, speaking, or hearing. In stage II nasopharyngeal cancer, the cancer 1  : is found in the nasopharynx only or has spread from the nasopharynx to the oropharynx and/or to the nasal cavity. 2  Cancer has spread to one or more lymph nodes on one side of the neck and/or to lymph nodes behind the pharynx."}, {"url": "http://www.webmd.com/cancer/nasopharyngeal-cancer", "passage_text": "In this article. Nasopharyngeal cancer is a rare type of head and neck cancer. It starts in the upper part of your throat, behind the nose. This area is called the nasopharynx. The nasopharynx is precariously placed at the base of your skull, above the roof of your mouth. Your nostrils open into the nasopharynx"}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMHT0024383/", "passage_text": "About Nasopharyngeal Cancer. Nasopharyngeal cancer is a disease in which malignant (cancer) cells form in the tissues of the nasopharynx. The nasopharynx is the upper part of the pharynx (throat) behind the nose"}, {"url": "https://en.wikipedia.org/wiki/Nasopharynx_cancer", "passage_text": "From Wikipedia, the free encyclopedia. Nasopharynx cancer or nasopharyngeal carcinoma (NPC) is the most common cancer originating in the nasopharynx, the uppermost region of the pharynx (throat), behind the nose where the nasal passages and auditory tubes join the remainder of the upper respiratory tract. NPC occurs in children and adults. Nasopharyngeal carcinoma, commonly known as nasopharyngeal cancer, is classified as a malignant neoplasm, or cancer, arising from the mucosal epithelium of the nasopharynx, most often within the lateral nasopharyngeal recess or fossa of Rosenmueller (rosenmüller a recess behind the entrance of the eustachian tube). opening"}, {"url": "http://www.parkwaycancercentre.com/learn-about-cancer/types-of-cancer/nasopharyngeal-cancer/", "passage_text": "Nasopharyngeal cancer (NPC) or commonly known as “nose cancer” occurs when cancer cells develop from the tissues in the nasopharynx, the area behind the nasal cavity and above the back of the throat. "}, {"url": "http://www.nhs.uk/conditions/nasopharyngeal-cancer/Pages/Definition.aspx", "passage_text": "Introduction. Nasopharyngeal cancer is a rare type of cancer that affects the part of the throat (pharynx) connecting the back of the nose to the back of the mouth. Only about 240 people are diagnosed with nasopharyngeal cancer each year in the UK"}, {"url": "http://www.cancer.org/cancer/nasopharyngealcancer/detailedguide/nasopharyngeal-cancer-what-is-nasopharyngeal-cancer", "passage_text": "Nasopharyngeal cancer is a cancer that starts in the nasopharynx, the upper part of the throat behind the nose and near the base of skull. To understand nasopharyngeal cancer, it helps to know about the structure and function of the nasopharynx. These tumors can invade surrounding tissues and spread to other parts of the body. Nasopharyngeal carcinoma (NPC): This is by far the most common malignant tumor of the nasopharynx. A carcinoma is a cancer that starts in epithelial cells – the cells lining the internal and external surface"}]