[{"url": "https://en.wikipedia.org/wiki/Clay", "passage_text": "Clay is a fine-grained natural rock or soil material that combines one or more clay minerals with traces of metal oxides and organic matter. Clays are plastic due to their water content and become hard, brittle and non–plastic upon drying or firing. Geologic clay deposits are mostly composed of phyllosilicate minerals containing variable amounts of water trapped in the mineral structure. Clay minerals typically form over long periods of time from the gradual chemical weathering of rocks, usually silicate-bearing, by low concentrations of carbonic acid and other diluted solvents."}, {"url": "https://en.wikipedia.org/wiki/Kaolinite", "passage_text": "Kaolinite (/ˈkeɪɵlɨˌnaɪt/) is a clay mineral, part of the group of industrial minerals, with the chemical composition Al 2 Si 2 O 5 (OH) 4. It is a layered silicate mineral, with one tetrahedral sheet linked through oxygen atoms to one octahedral sheet of alumina octahedra. Kaolinite is one of the most common minerals; it is mined, as kaolin, in Pakistan, Vietnam, Brazil, Bulgaria, France, United Kingdom, Iran, Germany, India, Australia, Korea, the People's Republic of China, the Czech Republic, Spain and the United States."}, {"url": "http://durablehealth.net/kaolin-clay/kaolin-clay-benefits-side-effects-properties/", "passage_text": "Kaolin clay is a clay mineral with numerous benefits as well side effects. Its chemical and physical properties explain how this clay is lets us understand its deep features.It has medicinal and health benefits such as caring for dry skin, treatment of various skin conditions, and detoxifying skin. Kaolin also comes in form of powder. Kaolin powder is mostly used to soften or make your skin dry. Simply take a teaspoon of the clay powder then mix it your lotion then apply the mixture on your body and hands. To spice it up with more benefits add a few drops of essential oils."}, {"url": "http://sciencelearn.org.nz/Contexts/Ceramics/Science-Ideas-and-Concepts/What-is-clay", "passage_text": "Image: Kaolinite mineral structure. Since the earliest times, humankind has had a close association with clay. From use as a building material, in pottery, for treating human digestive ailments to a multitude of industrial uses, clay is a key ingredient in the material world we live in. A mineral is a naturally occurring crystalline material that has a specific or limited range of chemical compositions. Clay minerals have a sheet-like structure and are composed of mainly tetrahedrally arranged silicate and octahedrally arranged aluminate groups. Kaolinite is the principal mineral in kaolin clays. It is a 1:1 clay mineral – the basic unit is composed of a 2-dimensional (2D) layer of silicate groups tightly bonded to a 2D layer of aluminate groups"}, {"url": "https://en.wikipedia.org/wiki/Clay", "passage_text": "When dry, clay becomes firm and when fired in a kiln, permanent physical and chemical changes occur. These changes convert the clay into a ceramic material. Because of these properties, clay is used for making pottery, both utilitarian and decorative, and construction products, such as bricks, wall and floor tiles. Clay minerals typically form over long periods of time from the gradual chemical weathering of rocks, usually silicate-bearing, by low concentrations of carbonic acid and other diluted solvents."}, {"url": "https://en.wikipedia.org/wiki/Clay", "passage_text": "Silts, which are fine-grained soils that do not include clay minerals, tend to have larger particle sizes than clays. There is, however, some overlap in particle size and other physical properties, and many naturally occurring deposits include both silts and clay. Clay minerals typically form over long periods of time from the gradual chemical weathering of rocks, usually silicate-bearing, by low concentrations of carbonic acid and other diluted solvents."}, {"url": "http://www.ucl.ac.uk/earth-sciences/impact/geology/london/ucl/materials/clay", "passage_text": "Clays and Clay Minerals. Clay is the common name for a number of fine-grained, earthy materials that become plastic when wet. Chemically, clays are hydrous aluminium silicates, usually containing minor amounts of impurities such as potassium, sodium, calcium, magnesium, or iron. One of the commonest processes of clay formation is the chemical decomposition of feldspar. The most abundant use of clay is in brick making. Granite is made up of quartz, mica and feldspar. As quartz is resistant to chemical weathering, it may be removed only as mineral grains of quartz. Feldspars and micas are susceptible to chemical weathering and break down to form clay minerals."}, {"url": "http://organiclifestyles.tamu.edu/soilbasics/soilchemical.html", "passage_text": "Soils are chemically different from the rocks and minerals from which they are formed in that soils contain less of the water soluble weathering products, calcium, magnesium, sodium, and potassium, and more of the relatively insoluble elements such as iron and aluminum. Colloidal particles are so small (2:1 clays, while kaolinite is a 1:1 clay mineral. Clays having a layer of aluminum oxide (octahedral sheet) sandwiched between two layers of silicon oxide (tetrahedral sheets) are called 2:1 clays."}, {"url": "http://organiclifestyles.tamu.edu/soilbasics/soilchemical.html", "passage_text": "The most chemically active fraction of soils consists of colloidal clays and organic matter. Colloidal particles are so small (2:1 clays, while kaolinite is a 1:1 clay mineral. Clays having a layer of aluminum oxide (octahedral sheet) sandwiched between two layers of silicon oxide (tetrahedral sheets) are called 2:1 clays."}]