[{"url": "https://en.wikipedia.org/wiki/Sphingolipid", "passage_text": "A sphingolipid with an R group consisting of a hydrogen atom only is a ceramide. Other common R groups include phosphocholine, yielding a sphingomyelin, and various sugar monomers or dimers, yielding cerebrosides and globosides, respectively. Cerebrosides and globosides are collectively known as glycosphingolipids."}, {"url": "http://www.sigmaaldrich.com/life-science/cell-biology/cell-biology-products.html?TablePage=9560519", "passage_text": "Sphingolipids are a class of lipids with a polar head group and two nonpolar tails. The core of a sphingolipid is an amino alcohol called sphingosine. Complex sphingolipids located in the plasma membrane of animal cells (especially nerve cells) have a structural function and are believed to protect the cell surface from harmful environmental factors."}, {"url": "http://themedicalbiochemistrypage.org/sphingolipids.php", "passage_text": "The sphingolipids, like the phospholipids, are composed of a polar head group and two nonpolar tails. The core of sphingolipids is the long-chain amino alcohol, sphingosine. The sphingolipids include the sphingomyelins and glycosphingolipids (the cerebrosides, sulfatides, globosides and gangliosides)."}, {"url": "http://www.wisegeek.com/what-is-a-sphingolipid.htm", "passage_text": "Glycosphingolipids are found in the cell membrane of muscle tissue. Gangliosides are a sphingolipid linked with a sugar chain such as sialic acid and found in the plasma membrane of a cell. The main function of a sphingolipid is to protect the surface of a cell from various factors that may cause harm."}, {"url": "http://www.sciencedirect.com/science/article/pii/S138819810200210X", "passage_text": "Sphingolipid metabolism in S. cerevisiae is outlined in Fig. 1. The defining feature of sphingolipids is a long-chain base (LCB), which is usually a linear alkane of 18 or 20 carbons having hydroxyls on C-1 and C-3 and an amino group on C-2."}, {"url": "http://www.jbc.org/content/275/23/17221.full", "passage_text": "Because headgroup structure is an important modulator of lipid packing, headgroup as well as acyl chain structure may be important in raft formation. For instance, phosphatidylethanolamines (PE), with their small headgroup, have much higher Tm than the corresponding phosphatidylcholines (PC)."}, {"url": "https://en.wikipedia.org/wiki/Sphingolipid", "passage_text": "Sphingolipids, or glycosylceramides, are a class of lipids containing a backbone of sphingoid bases, a set of aliphatic amino alcohols that includes sphingosine. They were discovered in brain extracts in the 1870s and were named for the mythological Sphinx because of their enigmatic nature."}]