[{"url": "http://www.cmu.edu/gelfand/k12-teachers/polymers/natural-synthetic-polymers/index.html", "passage_text": "Natural vs Synthetic Polymers. There are two types of polymers: synthetic and natural. Synthetic polymers are derived from petroleum oil, and made by scientists and engineers. Examples of synthetic polymers include nylon, polyethylene, polyester, Teflon, and epoxy. Natural polymers occur in nature and can be extracted. "}, {"url": "http://pslc.ws/macrog/pe.htm", "passage_text": "Polyethylene is probably the polymer you see most in daily life. Polyethylene is the most popular plastic in the world. This is the polymer that makes grocery bags, shampoo bottles, children's toys, and even bullet proof vests. For such a versatile material, it has a very simple structure, the simplest of all commercial polymers."}, {"url": "https://en.wikipedia.org/wiki/Polyethylene", "passage_text": "Polyethylene (abbreviated PE) or polyethene (IUPAC name polyethene or poly(methylene)) is the most common plastic. The annual global production is approximately 80 million tonnes. Many kinds of polyethylene are known, with most having the chemical formula (C 2 H 4) n. Thus PE is usually a mixture of similar organic compounds that differ in terms of the value of n."}, {"url": "http://chemed.chem.purdue.edu/genchem/topicreview/bp/1polymer/types.html", "passage_text": "Addition Polymers. Addition polymers such as polyethylene, polypropylene, poly(vinyl chloride), and polystyrene are linear or branched polymers with little or no cross-linking. As a result, they are thermoplastic materials, which flow easily when heated and can be molded into a variety of shapes. Polyethylene has no taste or odor and is lightweight, nontoxic, and relatively inexpensive. It is used as a film for packaging food, clothing, and hardware. Most commercial trash bags, sandwich bags, and plastic wrapping are made from polyethylene films."}, {"url": "http://www.eng.buffalo.edu/Courses/ce435/Polyethylene/ce435_intro.html", "passage_text": "New Polyethylene polymers are still being developed today. This polymer contains a rich history rooted back more than a century ago. We will now present the individual polyethylene polymers giving summaries of the reaction chemistry and physical/mechanical properties of each type of polyethylene polymer. We will begin our description of the polymer, polyethylene, with an informative introduction, which will provide a brief description of the origins of thermoplastic polymers, as well as the origins polyethylene."}, {"url": "https://en.wikipedia.org/wiki/Polyethylene", "passage_text": "Polyethylene is a thermoplastic polymer consisting of long hydrocarbon chains. Depending on the crystallinity and molecular weight, a melting point and glass transition may or may not be observable. The temperature at which these occur varies strongly with the type of polyethylene. Many kinds of polyethylene are known, with most having the chemical formula (C 2 H 4) n. Thus PE is usually a mixture of similar organic compounds that differ in terms of the value of n."}, {"url": "http://www.glad.com.au/DownloadDocument_9707fc09.ashx.pdf", "passage_text": "Plastics and polymers Polymers What is a Polymer? A polymer is a molecule that consists of certain type of arrangement of atoms that is repeated over and over. The result is a very large molecule that can consist of 2000 or more of the base compound. Polyethylene (PE) Polyethylene is a simple example of a polymer, and is one of the most common and widely used polymers. H H H H H H H H H H H H │ │ │ │ │ │ │ │ │ │ │ │ -C —- C —-C —- C—- C —- C—- C —- C—- C —- C—-C —- C - │ │ │ │ │ │ │ │ │ │ │ │ H H H H H H H H H H H H Polyethylene."}, {"url": "https://en.wikipedia.org/wiki/Polymer", "passage_text": "Polymer nomenclature is generally based upon the type of monomer residues comprising the polymer. Polymers that contain only a single type of repeat unit are known as homopolymers, while polymers containing a mixture of repeat units are known as copolymers. Poly(styrene), for example, is composed only of styrene monomer residues, and is therefore classified as a homopolymer. A branched polymer molecule is composed of a main chain with one or more substituent side chains or branches. Types of branched polymers include star polymers, comb polymers, brush polymers, dendronized polymers, ladders, and dendrimers."}]