[{"url": "http://www.answers.com/Q/Does_enterobacter_cloacae_ferment_lactose", "passage_text": "90% to 100% of Enterobacter aerogenes strains can ferment glucose, sucrose, and lactose. The same percentage of strains produce gas as a byproduct of that fermentation. Non-lactose fermenting bacteria utilize peptone instead of lactose.  This can be seen in agar where the formation of ammonia leads to  white colonies on the plate. Some bact … eria in this group include  Salmonella, Yersinia, Pseudomonas aeruginosa, and Shigella."}, {"url": "http://iws2.collin.edu/dcain/CCCCD%20Micro/macconkeyagar.htm", "passage_text": "Organisms which ferment lactose produce acid end-products which react with the pH indicator neutral red, and produce a pink color. Quadrant 1: Growth on the plate indicates the organism, Enterobacter aerogenes, is not inhibited by bile salts and crystal violet and is a gram-negative bacterium. The pink color of the bacterial growth indicates E. aerogenes is able to ferment lactose. Back to Tutorial. Quadrant 2: Growth on the plate indicates the organism, Escherichia coli, is not inhibited by bile salts and crystal violet and is a gram-negative bacterium. The pink color of the bacterial growth indicates E. coli is able to ferment lactose."}, {"url": "http://www.austincc.edu/microbugz/triple_sugar_iron_agar.php", "passage_text": "Triple sugar iron agar (TSI) is a differential medium that contains lactose, sucrose, a small amount of glucose (dextrose), ferrous sulfate, and the pH indicator phenol red. It is used to differentiate enterics based on the ability to reduce sulfur and ferment carbohydrates. "}, {"url": "http://www.answers.com/Q/How_do_you_identify_enterobacter_aerogenes", "passage_text": "Making the world better, one answer at a time. Enterobacter aerogenes is a Gram negative rod-shaped bacterium in the same family as Esherichia coli. It can grow on many of the same selective media as Esherichia coli, including: MacConkey Agar, EMB agar and Lauryl-Tryptose broth. 3) E. coli is positive in the methyl red test while E. aerogenes is usually, but not always, negative (this is not the best test to rely on). 4) E.coli is positive for the indole test while E. aerogenes is negative, this is a very reliable test. 5) E. aerogenes can grow on Simmon's citrate agar while E. coli does not."}, {"url": "http://iws2.collin.edu/dcain/CCCCD%20Micro/macconkeyagar.htm", "passage_text": "Quadrant 4: Growth on the plate indicates the organism, Salmonella typhimurium, is not inhibited by bile salts and crystal violet and is a gram-negative bacterium. The absence of color in the bacterial growth indicates S. typhimurium is unable to ferment lactose. Back to Tutorial. Quadrant 2: Growth on the plate indicates the organism, Escherichia coli, is not inhibited by bile salts and crystal violet and is a gram-negative bacterium. The pink color of the bacterial growth indicates E. coli is able to ferment lactose."}, {"url": "http://faculty.ccbcmd.edu/courses/bio141/labmanua/lab12/Mac_ecloacae.html", "passage_text": "Fig. MacConkey agar is a selective medium used for the isolation of non-fastidious Gram-negative rods, particularly members of the family Enterobacteriaceae and the genus Pseudomonas, and the differentiation of lactose fermenting from lactose non-fermenting Gram-negative bacilli. "}, {"url": "http://www.delta.edu/files/Microbiology/Microbiology.Media.Tests.Pictures.pdf", "passage_text": "The pink color of the bacterial growth indicates E. aerogenes is able to ferment lactose. Quadrant 2: Growth on the plate indicates the organism, Escherichia coli, is not inhibited by bile salts and crystal violet and is a gram-negative bacterium. The pink color of the bacterial growth indicates E. coli is able to ferment lactose. Quadrant 3: Absence of growth indicates the organism, Staphylococcus epidermidis, is inhibited by bile salts and crystal violet and is a gram-positive bacterium."}]