[{"url": "http://www.youtube.com/watch?v=XhuZByb6AN0", "passage_text": "Customized ceramic mugs are an in-demand, high margin product that can be easily created using sublimation. In this video, Sawgrass Technologies demonstrates how to sublimate an image onto a ceramic mug using a Ricoh® GX7000 printer with Sawgrass® SubliJet-R™ sublimation inks and an oven wrap with a convection oven. "}, {"url": "http://blog.coastalbusiness.com/sublimation-and-laser-mugs-101/", "passage_text": "If you’re using heat transfer paper (like the Mugs N More transfer paper), we would suggest heating the mug afterwards to bake in the transfer. You can use either a mug glazer or a simple five minutes in a regular oven. However, if you’re using sublimation, there’s no need to cure the mug afterwards. Once the mug is cool to the touch, remove the transfer paper. Unlike sublimation, laser images will only lay on top of the mug. This can lead to the image being more easily scratched or chipped off during everyday use. You can make the image more durable by “glazing” it, though no glaze is actually placed on the mug."}, {"url": "http://www.megauk.com/downloads/How%20to%20Sublimate%20a%20Mug.pdf", "passage_text": "After placing the mugs in the oven, close the door and wait for the temperature to reach 200°C before timing for 10 minutes. Then using oven gloves take out the VERY HOT mugs, remove the paper and immerse in hot water to cool. Using a Mega 70 ‐ 1500 Mug Press 1) Print your design onto sublimation paper as normal. Print single image or ‘step and repeat’ the design on one piece of paper. 2) Trim the image and any black lines from a template you may have used."}, {"url": "http://www.coastalbusiness.com/mug-wrap.aspx", "passage_text": "Mug Wrap WRAPA1115 Do you want to create beautiful imprinted mugs, but don't want to purchase a mug press? Don't worry-we have a wr-app for that! You can use our silicone mug wrap to imprint your images onto these items using a conventional oven or toaster oven! This wrap fits a wide variety of ceramic sublimation mugs. Oven Directions: Bake at 400 degrees F for 10-13 minutes. Note: Our wraps are designed for use in regular or convection ovens only."}, {"url": "http://www.ehow.com/how_7902004_make-sublimation-mug-wrap.html", "passage_text": "Do not let the edges of the wrap touch at the mug handle. Place the mug upside down on the oven rack and heat at 400 degrees in a convection oven. If heating more than one mug at a time, space the mugs evenly on the oven rack. Heat for approximately 15 to 18 minutes. Use gloves to remove the hot mug from the oven. Angle a fan down at a 45-degree angle next to the mug and turn it on, letting it run for three to five minutes to cool down the mug. Remove the thermal tape and transfer image with gloves."}, {"url": "http://www.bestblanks.com/mugpresses.html", "passage_text": "OTH-MUGWRAP-15. This new and improved mug wrap is an inexpensive way to get started making sublimation mugs using your home oven or a conveyer mug oven. Mug wraps allow you to make multiple mugs at one time without the cost of multiple mug heat presses. In our opinion this is the best mug press on the market today and we are offering it at one of the lowest prices for any mug press out there! 1  Full wrap-around, handle to handle, top-to-bottom printing. 2  Press images up to 5 high, and as close as 1⁄2 from the handle, depending on the mug size."}, {"url": "http://www.youtube.com/watch?v=FQ3U6Ks4wLk", "passage_text": "Please try again later. View our easy to follow guide on how to sublimate a ceramic mug using a convection oven and Sawgrass Sublijet R inks. You can also download step-by-step instructions in English, German, French, Italian, Spanish and Turkish languages: http://www.sawgrasseurope.com/educati..."}, {"url": "http://blog.coastalbusiness.com/sublimation-and-laser-mugs-101/", "passage_text": "No problem! You can use a silicone-coated mug wrap to sublimate your mugs using a conventional oven. It takes a little bit more time (10-15 minutes at 400 degrees) depending on the oven), but the quality is just as good as using a mug press. Once the mug is cool to the touch, remove the transfer paper. Unlike sublimation, laser images will only lay on top of the mug. This can lead to the image being more easily scratched or chipped off during everyday use. You can make the image more durable by “glazing” it, though no glaze is actually placed on the mug."}, {"url": "http://www.megauk.com/downloads/How%20to%20Sublimate%20a%20Mug.pdf", "passage_text": "Ovens can be used very successfully to sublimate mugs but inexperienced users will probably get more failures simply because they do not tape the image firmly enough. To help achieve the maximum colour release, we recommend our sublimation ‘special’ paper; 71‐0419 A4 (200 sheets), or 71‐0420 A3 (200 sheets). Using a Mega 70 ‐ 1500 Mug Press 1) Print your design onto sublimation paper as normal. Print single image or ‘step and repeat’ the design on one piece of paper. 2) Trim the image and any black lines from a template you may have used."}, {"url": "http://www.bestblanks.com/mugpresses.html", "passage_text": "OTH-MUGWRAP-11. This new and improved mug wrap is an inexpensive way to get started making sublimation mugs using your home oven or a conveyer mug oven. Mug wraps allow you to make multiple mugs at one time without the cost of multiple mug heat presses. In our opinion this is the best mug press on the market today and we are offering it at one of the lowest prices for any mug press out there! 1  Full wrap-around, handle to handle, top-to-bottom printing. 2  Press images up to 5 high, and as close as 1⁄2 from the handle, depending on the mug size."}]