[{"url": "http://www.synberc.org/what-is-synbio", "passage_text": "A long definition of synthetic biology: Synthetic biology is the design and construction of new biological entities such as enzymes, genetic circuits, and cells or the redesign of existing biological systems. In a sense, synthetic biology can be thought of as the development of a biology-based “toolkit” that enables improved products across many industries, including medicine, energy and the environment."}, {"url": "https://en.wikipedia.org/wiki/Synthetic_biology", "passage_text": "The definition of synthetic biology is debated not only among natural scientists but also in the human sciences, arts and politics. One popular definition is designing and constructing biological devices, biological systems, and biological machines for useful purposes.. Synthetic life [edit]. One important topic in synthetic biology is synthetic life, that is, artificial life created in vitro from biomolecules and their component materials."}, {"url": "http://www.synbioproject.org/topics/synbio101/definition/", "passage_text": "Synthetic biology is an emerging area of research that can broadly be described as the design and construction of novel artificial biological pathways, organisms or devices, or the redesign of existing natural biological systems.. To many people, this is the essence of synthetic biology. Below we have listed several of the more commonly referenced definitions: Synthetic biology is a) the design and construction of new biological parts, devices and systems and b) the re-design of existing natural biological systems for useful purposes.."}, {"url": "https://www.bio.org/articles/synthetic-biology-explained", "passage_text": "Synthetic biology is a new interdisciplinary area that involves the application of engineering principles to biology. It aims at the (re-)design and fabrication of biological components and systems that do not already exist in the natural world. "}, {"url": "http://knowgenetics.org/synthetic-biology/", "passage_text": "Synthetic Biology. Synthetic Biology. Synthetic biology is the design and construction of biological modules, from enzymes to complete cells. Synthetic biology combines biology, chemistry, and engineering, and strives to create new systems to solve specific problems. Synthetic biologists attempt to design, model and then fabricate ideal biological systems. Applications for synthetic biology include drug discovery, the production of biofuels, “biosensing” (using a biological component to detect an environmental signal), investigating disease mechanisms, and more."}, {"url": "http://bioethics.gov/sites/default/files/PCSBI-Synthetic-Biology-FAQ.pdf", "passage_text": "A: Synthetic biology is the name given to an emerging field of research that combines elements of biology, engineering, genetics, chemistry, and computer science. Synthetic biology – called ``synbio’’ for short – joins the knowledge and techniques of biology with the practical principles and techniques of engineering. Achievements in synthetic biology rely on artificially created DNA to create new biochemical systems or organisms with novel or enhanced characteristics."}, {"url": "http://syntheticbiology.org/FAQ.html", "passage_text": "1 Synthetic biology studies how to build artificial biological systems for engineering applications, using many of the same tools and experimental techniques. 2  But the work is fundamentally an engineering application of biological science, rather than an attempt to do more science. 1 Biologists are interested in synthetic biology because it provides a complementary perspective from which to consider, analyze, and ultimately understand the living world. 2  Being able to design and build a system is also one very practical measure of understanding."}, {"url": "https://en.wikipedia.org/wiki/Synthetic_biology", "passage_text": "Synthetic biology is an interdisciplinary branch of biology, combining disciplines such as biotechnology, evolutionary biology, molecular biology, systems biology, biophysics, computer engineering, and genetic engineering. Synthetic life [edit]. One important topic in synthetic biology is synthetic life, that is, artificial life created in vitro from biomolecules and their component materials."}, {"url": "http://syntheticbiology.org/FAQ.html", "passage_text": "1 Synthetic biology refers to both: 2  the design and fabrication of biological components and systems that do not already exist in the natural world. 3  the re-design and fabrication of existing biological systems. 1 Biologists are interested in synthetic biology because it provides a complementary perspective from which to consider, analyze, and ultimately understand the living world. 2  Being able to design and build a system is also one very practical measure of understanding."}]