[{"url": "http://www.merckvetmanual.com/mvm/poultry/nutrition_and_management_poultry/vitamin_deficiencies_in_poultry.html", "passage_text": "Ducks and turkeys with a niacin deficiency show a severe bowing of the legs and an enlargement of the hock joint. The main difference between the leg seen in niacin deficiency and perosis as seen in manganese and choline deficiency is that with niacin deficiency the Achilles tendon seldom slips from its condyles. In the niacin-deficient hen, weight loss, reduced egg production, and a marked decrease in hatchability can result. Turkeys, ducks, pheasants, and goslings are much more severely affected by niacin deficiency than are chickens."}, {"url": "http://wildpro.twycrosszoo.org/S/00dis/micronutrient/niacin_deficiency.htm", "passage_text": "Nicotinic acid Deficiency. Disease Agents. Deficiency of the B vitamin niacin (nicotinic acid). Niacin is the vitamin component of two important coenzymes involved in carbohydrate, fat and protein metabolism: nicotinamide adenine dinucleotide and nicotinamide adenine dinucleotide phosphate. Further Information. 1  Relatively high requirement for niacin in ducklings; ducks are less efficient than chickens at synthesising niacin from tryptophan, probably due to relatively high picolinic carboxylase activity (B13 .46.w1, B32 .2.23)."}, {"url": "http://www.backyardchickens.com/t/173562/niacin-deficiencies-in-goslings-ducklings-growth-leg-problems", "passage_text": "Somebody PM'ed me recently with a question about a lame gosling so I thought this would be a good reminder for all of us. I was reading in Dave Holderread's duck book regarding what he recommends for the all too common niacin deficiency seen in ducklings. Niacin is a B-vitamin lacking in chick starters. Lack of it can cause leg problems in ducklings and goslings. Treatment: Ducklings exhibiting niacin deficiencies and be CURED by giving them 100-150 mg. niacin (crush tablet) per gallon until they are 8 - 10 weeks old. If not treated they can have permanently stunted growth and/or crippled."}, {"url": "http://www.webmd.com/diet/niacin-deficiency-symptoms-and-treatments", "passage_text": "Severe deficiency, called pellagra, can cause symptoms related to the skin, digestive system, and nervous system. They include: 1  thick, scaly pigmented rash on skin exposed to sunlight. 2  swollen mouth and bright red tongue. 3  vomiting and diarrhea. 4  headache. 5  apathy. 6  fatigue. 7  depression. 8  disorientation. Your liver can convert tryptophan from high-protein foods like meats and milk into niacin. Symptoms of mild niacin deficiency include: 1  indigestion. 2  fatigue. 3  canker sores. 4  vomiting. 5"}, {"url": "http://wildpro.twycrosszoo.org/S/00dis/micronutrient/niacin_deficiency.htm", "passage_text": "1 Prevention: Ensure sufficient niacin in diet. 2  May need supplementation. 3  Brewer's yeast is a good source of niacin. 4  70mg/kg diet recommended for starting and for growing/finishing Pekin ducks, 50mg/kg for breeding ducks. Further Information. 1  Relatively high requirement for niacin in ducklings; ducks are less efficient than chickens at synthesising niacin from tryptophan, probably due to relatively high picolinic carboxylase activity (B13 .46.w1, B32 .2.23)."}, {"url": "http://forum.backyardpoultry.com/viewtopic.php?f=5&t=7981649", "passage_text": "Yup, ducks need heaps more Niacin, so sometimes chook food just doesn’t cover it. Deficiency symptoms for Niacin AND Riboflavin are both along the lines of curled-toe paralysis, drooping wings, and leg weakness, bowed legs, etc (as well as others). "}, {"url": "http://metzerfarms.blogspot.com/2011/03/are-my-ducklings-leg-problems-due-to.html", "passage_text": "The signs of niacin deficiency related to leg problems are enlarged hock joints and slipped tendons (called perosis) so the leg splays out. We do know that ducks have a higher requirement for niacin than chickens. NRC requirements for ducklings = 55 mg/kg niacin compared to only 27-35 mg/kg for chicks. On top of that, the niacin in corn has a very low bioavailability; although corn contains 24 mg/kg of niacin, I use a value of 2 mg/kg for formulation. Typically the pills contain 500 mgs of niacin per tablet. Assuming a duck is eating about .35 lbs per day (this is how much a Pekin is eating at about 3 -4 weeks of age) , they need 10 milligrams (mgs) of niacin a day. So, theoretically, one pill has enough niacin for 50 ducks."}, {"url": "http://www.merckvetmanual.com/mvm/poultry/nutrition_and_management_poultry/vitamin_deficiencies_in_poultry.html", "passage_text": "Niacin deficiency in chickens may be prevented by feeding a diet that contains niacin at ≥30 mg/kg; however, many nutritionists recommend 2–2.5 times as much. An allowance of 55–70 mg/kg of feed appears to be satisfactory for ducks, geese, and turkeys. In the niacin-deficient hen, weight loss, reduced egg production, and a marked decrease in hatchability can result. Turkeys, ducks, pheasants, and goslings are much more severely affected by niacin deficiency than are chickens."}, {"url": "http://www.fitday.com/fitness-articles/nutrition/vitamins-minerals/4-signs-of-a-niacin-deficiency.html", "passage_text": "Below are detailed some of the signs that can occur when niacin, also known as vitamin B3, is depleted from the body. 1. Skin Signs. If you have vitamin B3 deficiency, lesions will start appearing on both sides of your body, symmetrically. 3. Gastrointestinal Symptoms. If you are vitamin B3 deficient, you may also experience a burning sensation in the pharynx and esophagus. In addition, the following signs may be noticed: 1  Abdominal discomfort. 2  Constipation. 3  Diarrhea. 4  Distention. 5  Nausea. 6  Vomiting."}, {"url": "http://www.youtube.com/watch?v=eYXKC2mAKH8", "passage_text": "Please try again later. We've got 3 Ducklings with a Niacin Deficiency, I've got them isolated in the hospital and now we have the right applicator to give them their vitamins, out vet gave me the right equipment to give them the proper doses. $30 worth of B3 to save 3 ducklings hopefully it works. "}]