[{"url": "http://www.webelements.com/technetium/", "passage_text": "Technetium has been found in the spectrum of S-, M-, and N-type stars, and its presence in stellar matter is leading to new theories of the production of heavy elements in the stars. Technetium is a silvery-grey metal that tarnishes slowly in moist air. Until 1960, technetium was available only in small amounts. Technetium does not occur naturally in the biosphere and so normally never presents a risk. All technetium compounds should be regarded as highly toxic, largely because of its radiological toxicity. Technetium has been found in the spectra of S-, M-, and N-type stars, but is not found in earth's geosphere."}, {"url": "http://education.jlab.org/itselemental/ele043.html", "passage_text": "Molybdenum-98 becomes molybdenum-99 when it captures a neutron. Molybdenum-99, with a half-life of 65.94 hours, decays into technetium-99 through beta decay. While technetium has never been found to occur naturally on earth, its spectral lines have been observed in S-, M-and N-type stars. Technetium's most stable isotope, technetium-98, has a half-life of about 4,200,000 years. It decays into ruthenium -98 through beta decay. Small amounts of technetium can retard the corrosion of steel, although this protection can only be applied to closed systems due to technetium's radioactivity. "}, {"url": "https://en.wikipedia.org/wiki/Technetium", "passage_text": "Long-lived technetium isotopes produced commercially are by-products of fission of uranium-235 in nuclear reactors and are extracted from nuclear fuel rods. It is the element with the lowest atomic number in the periodic table that has no stable isotopes: every form of it is radioactive. Nearly all technetium is produced synthetically, and only minute amounts are found in nature."}, {"url": "http://www.3rd1000.com/elements/Technetium.htm", "passage_text": "Technetium-99 is the most common and most readily available isotope, as it is a major product of the fission of uranium-235. One gram of 99 Tc produces 6.2 10 8 disintegrations a second (that is, 0.62 GBq/g). "}, {"url": "http://www.lenntech.com/periodic/elements/tc.htm", "passage_text": "Technetium. Technetium is a silvery-gray metal that tarnishes slowly in moist air. The common oxidation states of technetium are +7, +5, and +4. Under oxidizing conditions technetium (VII) will exist as the pertechnetate ion, TcO 4- . The chemistry of technetium is said to be similar to that of rhenium. "}, {"url": "https://en.wikipedia.org/wiki/Technetium-99m", "passage_text": "Technetium-99m is a metastable nuclear isomer of technetium-99 (itself an isotope of technetium), symbolized as 99m Tc, that is used in tens of millions of medical diagnostic procedures annually, making it the most commonly used medical radioisotope. Technetium-99m can be readily detected in the body by medical equipment because it emits 140.5 keV gamma rays (these are about the same wavelength as emitted by conventional X-ray diagnostic equipment), and its half-life for gamma emission is six hours (meaning 94% of it decays to 99 Tc in 24 hours)."}, {"url": "https://en.wikipedia.org/wiki/Technetium", "passage_text": "Many of technetium's properties were predicted by Dmitri Mendeleev before the element was discovered. Mendeleev noted a gap in his periodic table and gave the undiscovered element the provisional name ekamanganese (Em). It is the element with the lowest atomic number in the periodic table that has no stable isotopes: every form of it is radioactive. Nearly all technetium is produced synthetically, and only minute amounts are found in nature."}, {"url": "http://www.webelements.com/technetium/", "passage_text": "It was found in a sample of molybdenum bombarded by deuterons. Technetium was the first element to be produced artificially and all its isotopes are radioactive. It is named after the Greek technetos, artificial. Technetium does not occur naturally in the biosphere and so normally never presents a risk. All technetium compounds should be regarded as highly toxic, largely because of its radiological toxicity. Technetium has been found in the spectra of S-, M-, and N-type stars, but is not found in earth's geosphere."}, {"url": "http://www.chemistryexplained.com/elements/P-T/Technetium.html", "passage_text": "All isotopes of technetium are radioactive. The most stable of these isotopes technetium-97, technetium-98, and technetium-99, have half lives of more than a million years. Isotopes are two or more forms of an element. Isotopes differ from each other according to their mass number. "}, {"url": "https://en.wikipedia.org/wiki/Technetium", "passage_text": "Technetium (/tɛkˈniːʃiəm/) is a chemical element with symbol Tc and atomic number 43. It is the element with the lowest atomic number in the periodic table that has no stable isotopes: every form of it is radioactive. Nearly all technetium is produced synthetically, and only minute amounts are found in nature."}]