[{"url": "http://www.mayoclinic.org/diseases-conditions/heart-disease/basics/causes/CON-20034056", "passage_text": "1 Dilated cardiomyopathy. 2  The cause of this most common type of cardiomyopathy often is unknown. 3  It may be caused by reduced blood flow to the heart (ischemic heart disease), infections, toxins and certain drugs. 4  It also may be inherited from a parent. 5  It usually enlarges (dilates) the left ventricle. 1 The cause of this most common type of cardiomyopathy often is unknown. 2  It may be caused by reduced blood flow to the heart (ischemic heart disease), infections, toxins and certain drugs. 3  It also may be inherited from a parent. 4"}, {"url": "https://www.health.ny.gov/diseases/cardiovascular/heart_disease/types_of_cv.htm", "passage_text": "Coronary Heart Disease. Coronary Heart Disease (CHD) is the most common form of heart disease. It occurs when the arteries supplying blood to the heart narrow or harden from the build-up of plaque. Plaque is made up of fat, cholesterol and other substances found in the blood. This plaque build-up is also known as atherosclerosis"}, {"url": "http://www.nhlbi.nih.gov/health/health-topics/topics/cad/", "passage_text": "Outlook. CHD is the most common type of heart disease. In the United States, CHD is the #1 cause of death for both men and women. Lifestyle changes, medicines, and medical procedures can help prevent or treat CHD."}, {"url": "https://www.health.ny.gov/diseases/cardiovascular/heart_disease/types_of_cv.htm", "passage_text": "The site of the plaque determines the type of heart disease: 1  Coronary artery disease is the build-up of plaque in the arteries supplying blood to the heart. 2  Peripheral artery disease is the build-up of plaque in the arteries supplying blood to the arms and legs. Coronary Heart Disease (CHD) is the most common form of heart disease. It occurs when the arteries supplying blood to the heart narrow or harden from the build-up of plaque."}, {"url": "http://www.cdc.gov/heartdisease/index.htm", "passage_text": "Million Hearts® Be one in a million hearts. In the United States, the most common type of heart disease is coronary artery disease (CAD), which can lead to heart attack. You can greatly reduce your risk for CAD through lifestyle changes and, in some cases, medication. Learn more about heart disease. Most of the sodium we consume is in the form of salt. Too much sodium is bad for your health. It can increase your blood pressure and your risk for a heart attack or stroke. Heart disease and stroke are the first and third killers of men and women in the United States each year."}, {"url": "http://www.mayoclinic.org/diseases-conditions/heart-disease/basics/causes/CON-20034056", "passage_text": "The cause of cardiomyopathy, a thickening or enlarging of the heart muscle, may depend on the type: 1  Dilated cardiomyopathy. 2  The cause of this most common type of cardiomyopathy often is unknown. 3  It may be caused by reduced blood flow to the heart (ischemic heart disease), infections, toxins and certain drugs. 1 The cause of this most common type of cardiomyopathy often is unknown. 2  It may be caused by reduced blood flow to the heart (ischemic heart disease), infections, toxins and certain drugs. 3  It also may be inherited from a parent. 4  It usually enlarges (dilates) the left ventricle."}, {"url": "http://www.cdc.gov/heartdisease/about.htm", "passage_text": "The most common type of heart disease in the United States is coronary artery disease, which affects the blood flow to the heart and can cause a heart attack. The term heart disease refers to several types of heart conditions. The most common type of heart disease in the United States is coronary artery disease, which affects the blood flow to the heart. Decreased blood flow can cause a heart attack. Learn more about heart disease, heart attack, and related conditions: 1  Coronary Artery Disease. 2  Heart Attack"}, {"url": "http://www.phac-aspc.gc.ca/cd-mc/cvd-mcv/cvd-mcv-eng.php", "passage_text": "1 Ischemic heart disease is the most common type of cardiovascular disease in Canada and other industrialized countries around the world. 2  It refers to problems with the circulation of blood to the heart muscle. The following six types of cardiovascular disease are highlighted below: 1 "}, {"url": "http://www.healthline.com/health/heart-disease/types", "passage_text": "Coronary heart disease is a common type of heart disease. This condition results from a buildup of plaque on the inside of the arteries, which reduces blood flow to the heart and increases the risk of a heart attack and other heart complications. Other forms of heart disease include: If you have weak heart muscles, physical activity may cause tiredness and shortness of breath. Dizziness and swelling in the legs, ankle, or feet are also common with cardiomyopathy. Signs and symptoms of a heart infection can include: 1  tiredness. 2  coughing. 3  skin rash. 4  irregular heartbeat."}]