[{"url": "http://work.chron.com/average-pay-assistant-professor-university-1892.html", "passage_text": "Assistant professors, who are the lowest rank on the tenure track, averaged $66,564 annually. Only instructors, who are not on a tenure track, were paid lower at $47,847 per year. Associate professors made $78,565 per year on average and full professors earned $113,176 per year. Private Four-Year Colleges. For private four-year colleges, the lowest-paid assistant professors in the 50 states were at Tabor College, with average salaries of $35,900 per year. Tabor, located in Hillsboro, Kansas, is a private baccalaureate institution with 757 students. It has 12 tenured professors out of 34 full-time faculty members"}, {"url": "https://en.wikipedia.org/wiki/Professors_in_the_United_States", "passage_text": "By rank, the average was $98,974 for professors, $69,911 for associate professors, $58,662 for assistant professors, $42,609 for instructors, and $48,289 for lecturers. Faculty in 4-year institutions earn higher salaries, on average, than do those in 2-year schools. In 2006, the overall median 9-month salary for all professors in the U.S. was reported to be $73,000, placing a slight majority of professors among the top 15% of earners at age 25 or older."}, {"url": "http://www.thebestschools.org/blog/2013/11/25/10-highest-paid-college-professors-u-s/", "passage_text": "10 Highest-Paid College Professors in the U.S. Many college professors change lives, challenge the world around us, and teach us the skills needed to improve our lives. However, their salaries range widely—anywhere from adjunct professors earnings around $30,000 to a full-time professor earning $500,000 and more. College professors may teach at either private or public universities; their level of expertise and interest will determine where they spend the bulk of their years teaching. Salaries above $1 million are rounded to the nearest $100,000 or $10,000, depending on the information available; those below $1 million are rounded to the nearest $1,000. Readers might also like: The 10 Most Controversial College Professors in the US."}, {"url": "http://work.chron.com/average-pay-assistant-professor-university-1892.html", "passage_text": "The highest paid assistant professors earned $112,300 a year at the University of Pennsylvania. In comparison, full professors at the same university averaged $181,600 annually and associate professors received $117,800 per year. Private Four-Year Colleges. For private four-year colleges, the lowest-paid assistant professors in the 50 states were at Tabor College, with average salaries of $35,900 per year. Tabor, located in Hillsboro, Kansas, is a private baccalaureate institution with 757 students. It has 12 tenured professors out of 34 full-time faculty members"}, {"url": "https://en.wikipedia.org/wiki/Professors_in_the_United_States", "passage_text": "For associate professors, salaries ranged from $56,943 in theology to $98,530 in law, while salaries among full professors ranged from $68,214 in theology to $136,634 in law. During the 2010–11 year, associate professor salaries vary from $59,593 in theology to $93,767 in law. Full professors at elite institutions commonly enjoy six-figure incomes, such as $123,300 at UCLA or $148,500 at Stanford. In 2006, the overall median 9-month salary for all professors in the U.S. was reported to be $73,000, placing a slight majority of professors among the top 15% of earners at age 25 or older."}, {"url": "http://www.haas.berkeley.edu/Phd/pdf/BusinessProfessor-full.pdf", "passage_text": "According to a survey conducted by AACSB International-The Association to Advance Collegiate Schools of Business, demand for PhDs’ in business schools rose slightly in 2006 and the overall vacancy rate rose to 6.8 percent. At the same time, planned growth in business faculty positions for 2007 is 4.7 percent. Overall, the shortage of business faculty is predicted to reach 2,400 by 2012. The faculty shortage has resulted in increasing salaries for faculty at business schools. In 2006, the average 9-month salary for an Assistant Professor (entry level) was $88.5k for faculty teaching in management, $117.1k for finance, $106.6k for accounting and $97k for marketing. "}, {"url": "http://chronicle.com/article/Business-School-Professors/49052/", "passage_text": "The paper also describes a widening in the pay gap between faculty members at private and public business schools. Full professors, for example, earned an average annual salary of about $107,900 at private schools and $95,300 at public schools in 1997-98. They restricted their analysis to the academic years from 1997-98 to 2004-5, and to full-time faculty members with the rank of assistant, associate, or full professor at research/doctoral or master's universities with at least 10 such faculty members on the business school's payroll."}, {"url": "http://www.byuaccounting.net/mediawiki/index.php?title=Life_as_a_Professor", "passage_text": "Accounting professors are highly compensated. The AACSB conducts an annual faculty salary survey and reports the results. Numbers below are based on the 2013/2014 survey. The average salary of a recently hired accounting professor in 2013/2014 was $153,000. The average assistant professor earned $135,800, the average associate professor earned $151,100, and the average full professor earned $152,600"}, {"url": "http://www.byuaccounting.net/mediawiki/index.php?title=Life_as_a_Professor", "passage_text": "Salaries for accounting professors are usually higher if the employing school has a greater research reputation. Typical base salaries for accounting professors at a top 50 accounting research school start above $150,000 a year (and may start as high as $225,000). In addition to the base salary, many schools offer summer research support. The AACSB conducts an annual faculty salary survey and reports the results. Numbers below are based on the 2013/2014 survey. The average salary of a recently hired accounting professor in 2013/2014 was $153,000."}]