[{"url": "http://www.answers.com/Q/What_is_primitive_stem_cell", "passage_text": "Other stem cells are more restricted, such as the hematopoietic stem cell, which can only form the cell types found in blood and the immune system. A new form of cell called an induced pluripotent stem cell (iPS), can be generated by turning on at least 2 specific genes in skin or other non-stem cells."}, {"url": "http://www.yinstill.com/spermatogenesis-how-sperm-produced", "passage_text": "Sperm formation occurs in the seminiferous tubules of the testis. This process is started by primitive stem cells called spermatogonia found on the outer edge of each tubule. Spermatogonia cells go through rapid mitotic divisions to build up the stem cell line. From birth until puberty, all such divisions simply produce more stem cells."}, {"url": "http://www.answers.com/Q/What_is_the_primitive_stem_cell_of_spermatogenesis_which_is_found_on_the_periphery_of_each_seminiferous_tubule_called", "passage_text": "The primitive stem cell of spermatogenesis found on the periphery of each seminiferous tubule is called spermatogonia. Spermatogonia is an undifferentiated male germ cell."}, {"url": "http://www.uwyo.edu/wjm/repro/spermat.htm", "passage_text": "Spermatogenesis is the process of sperm cell development. Rounded immature sperm cells undergo successive mitotic and meiotic divisions (spermatocytogenesis) and a metamorphic change (spermiogenesis) to produce spermatozoa."}, {"url": "http://www.histology.leeds.ac.uk/male/spermatogenesis.php", "passage_text": "The production of sperm and eggs/ova (gametes) is a procedure called gametogenesis (spermatogenesis and oogenesis). Gametogenesis involves two rounds of meiotic cell division, in which one diploid cell gives rise to 4 haploid cells. This diagram shows the processes involved in spermatogenesis."}, {"url": "http://www.health.am/sex/more/male_infertility_spermatogenesis/", "passage_text": "Spermatogenesis is a complex process by which primitive, totipotent stem cells divide to either renew themselves or produce daughter cells that become spermatozoa. These processes occur within the seminiferous tubules of the testis."}, {"url": "http://www.answers.com/Q/What_is_the_primitive_stem_cell_of_spermatogenesis_which_is_found_on_the_periphery_of_each_seminiferous_tubule_called", "passage_text": "exists and is an alternate of. Merge this question into. Split and merge into it. Answer by Isadora Duncan. Confidence votes 51.8K. The primitive stem cell of spermatogenesis found on the periphery of each seminiferous tubule is called spermatogonia. Spermatogonia is an undifferentiated male germ cell."}]