[{"url": "http://quatr.us/geology/earthquakes/", "passage_text": "Earthquake in Peru. Earthquakes happen when the moving tectonic plates that make up the surface of the Earth move apart or bump into each other, or slide under each other. This movement tears apart the surface of the Earth, or crunches it up. Most often, this just means a little shaking for a few seconds, and nothing very serious happens. "}, {"url": "http://pubs.usgs.gov/gip/earthq1/how.html", "passage_text": "A fault is a fracture in the Earth's crust along which two blocks of the crust have slipped with respect to each other. Faults are divided into three main groups, depending on how they move. Normal faults occur in response to pulling or tension; the overlying block moves down the dip of the fault plane. Thrust (reverse) faults occur in response to squeezing or compression; the overlying block moves up the dip of the fault plane."}, {"url": "http://pubs.usgs.gov/gip/earthq1/how.html", "passage_text": "The focal depth of an earthquake is the depth from the Earth's surface to the region where an earthquake's energy originates (the focus). Earthquakes with focal depths from the surface to about 70 kilometers (43.5 miles) are classified as shallow. Faults are divided into three main groups, depending on how they move. Normal faults occur in response to pulling or tension; the overlying block moves down the dip of the fault plane. Thrust (reverse) faults occur in response to squeezing or compression; the overlying block moves up"}, {"url": "http://www.youtube.com/watch?v=T0AEtX-uPLA", "passage_text": "An unexpected movement of the Earth's surface is called an earthquake. When two parts of the earth's surface move suddenly in relation to each other along a fault line, due to tectonic forces, an earthquake occurs. "}, {"url": "http://www.geo.mtu.edu/UPSeis/why.html", "passage_text": "When the rocks break, the earthquake occurs. During the earthquake and afterward, the plates or blocks of rock start moving, and they continue to move until they get stuck again. The spot underground where the rock breaks is called the focus of the earthquake. This sudden release of energy causes the seismic waves that make the ground shake. When two blocks of rock or two plates are rubbing against each other, they stick a little. They don't just slide smoothly; the rocks catch on each other."}, {"url": "https://www.fema.gov/why-earthquakes-occur", "passage_text": "Main Content. An earthquake is ground shaking caused by a sudden movement of rock in the earth’s crust. Such movements occur along faults, which are thin zones of crushed rock separating blocks of crust. "}, {"url": "http://www.bbc.co.uk/schools/gcsebitesize/geography/natural_hazards/earthquakes_rev1.shtml", "passage_text": "Causes. An earthquake is the shaking and vibration of the Earth's crust due to movement of the Earth's plates (plate tectonics). Earthquakes can happen along any type of plate boundary. Earthquakes occur when tension is released from inside the crust. Plates do not always move smoothly alongside each other and sometimes get stuck. When this happens pressure builds up. When this pressure is eventually released, an earthquake tends to occur."}, {"url": "http://pubs.usgs.gov/gip/earthq1/how.html", "passage_text": "How Earthquakes Happen. An aerial view of the San Andreas fault in the Carrizo Plain, Central California. An earthquake is the vibration, sometimes violent, of the Earth's surface that follows a release of energy in the Earth's crust. This energy can be generated by a sudden dislocation of segments of the crust, by a volcanic eruption, or event by manmade explosions. Faults are divided into three main groups, depending on how they move. Normal faults occur in response to pulling or tension; the overlying block moves down the dip of the fault plane. Thrust (reverse) faults occur in response to squeezing or compression; the overlying block moves up"}, {"url": "http://www.geo.mtu.edu/UPSeis/where.html", "passage_text": "Along Faults. Earthquakes can also occur far from the edges of plates, along faults. Faults are cracks in the earth where sections of a plate (or two plates) are moving in different directions. Faults are caused by all that bumping and sliding the plates do. They are more common near the edges of the plates. Along Plate Edges. Most earthquakes occur along the edge of the oceanic and continental plates. The earth's crust (the outer layer of the planet) is made up of several pieces, called plates. The plates under the oceans are called oceanic plates and the rest are"}, {"url": "http://www.universetoday.com/82050/how-earthquakes-happen/", "passage_text": "Image credit: NASA. The two main answers to ‘how earthquakes happen’ is: as a result of tectonic plates colliding and volcanic eruption. The shock waves associated with nuclear weapons testing and other man-made explosions. To be considered an earthquake a shock wave has to be of natural origin. Earthquakes Caused By Tectonic Plates: The theory of plate tectonics explains how the crust of the Earth is made of several plates, large areas of crust which float on the Mantle. Since these plates are free to slowly move, they can either drift towards each other, away from each other or slide past each other. Many earthquakes happen in areas where plates collide or slide past each other. The Elastic Rebound Theory applies to these quakes."}]