[{"url": "http://www.babynamewizard.com/baby-name/boy/ivan", "passage_text": "Origin of the name Ivan: A Russian name, Ivan is a cognate of John (God is gracious), which is from the Ecclesiastic Late Latin Joannes and the Ecclesiastic Greek Iōannes, derivatives of the Hebrew yōhānān, a contraction of yehōhānān, (Yahweh is gracious). From A World of Baby Names by Teresa Norman."}, {"url": "http://www.babynamespedia.com/meaning/Ivan", "passage_text": "The name Ivan is used to a great extent; it has 30 variants that are used in English and other languages. Variants used in English include Eyvan, Eyvind, Iban, Ibano, Ioann, Ivanhoe, Ivann, Ivano, Ivant, Ivante, Ivantea, Ivantee, Ivantey, Ivanti, Ivantie, Ivanty, Ivas, Ive, Iven, Ivin, Ivon, Yvan, and Yvann. † Pronunciation for Ivan: AY as in side (S.AY.D) ; V as in vow (V.AW) ; AH as in mud (M.AH.D) ; N as in knee (N.IY) ; IY as in eat (IY.T) ; AA as in odd (AA.D). Details of famous persons named Ivan: Author Ivan Turgenev, born October 28, 1818 - September 3, 1883, Oryol, Russian Empire."}, {"url": "http://www.babynamespedia.com/meaning/Ivan", "passage_text": "Ivan-Meaning of Ivan. Tweet. Variant forms share the origin and thus the meaning of Ivan. [ 2 syll. i-van, iv-an ] The baby boy name Ivan is pronounced as AY-VahN (English) or iy-V AA N (Russian) †. Ivan is used chiefly in the Belorussian, Czech, English, Russian, Slavic, and Ukrainian languages, and it is derived from Hebrew origins. † Pronunciation for Ivan: AY as in side (S.AY.D) ; V as in vow (V.AW) ; AH as in mud (M.AH.D) ; N as in knee (N.IY) ; IY as in eat (IY.T) ; AA as in odd (AA.D). Details of famous persons named Ivan: Author Ivan Turgenev, born October 28, 1818 - September 3, 1883, Oryol, Russian Empire."}, {"url": "http://www.behindthename.com/name/ivan/comments", "passage_text": "Russian standard pronunciation of the name Ivan is actually ee-VAHN. [noted-ed]. -- icarusmonkey 5/4/2005. Ivan has a nameday on 7th January according to the Orthodox calendar and on the 6th January according to the Catholic calendar. "}, {"url": "http://www.babynamespedia.com/meaning/Ivan", "passage_text": "In addition, Ivan is a variant spelling of the name Iwan (Polish, Russian, Ukrainian, and Welsh) in the Belorussian, Czech, English, Russian, Slavic, and Ukrainian languages as well as a variant of the name John (English and Hebrew) in the Belorussian, Czech, English, Russian, Slavic, and Ukrainian languages. † Pronunciation for Ivan: AY as in side (S.AY.D) ; V as in vow (V.AW) ; AH as in mud (M.AH.D) ; N as in knee (N.IY) ; IY as in eat (IY.T) ; AA as in odd (AA.D). Details of famous persons named Ivan: Author Ivan Turgenev, born October 28, 1818 - September 3, 1883, Oryol, Russian Empire."}, {"url": "https://en.wikipedia.org/wiki/Ivan_(name)", "passage_text": "[joχanan]), short for יהוחנן (. [jəhoχanan]), meaning  Yahweh is merciful. Common surnames derived from the name Ivan, are Ivanović commonly used in Montenegro and Serbia, and Ivanov, commonly used in Russia and Bulgaria. Ivanovich is a Russian patronymic/middle name meaning son of Ivan/John or Ivanson/Johnson. Popular variations include Jovan and Joan. Ivan is the most common male name in Bulgaria and Croatia. In Serbia, it was the 9th most common male name in the period of 1971–1980; 6th in 1981–1990; 9th in 1991–2000."}, {"url": "http://www.youtube.com/watch?v=M4485utZwps", "passage_text": "Please try again later. Audio and video pronunciation of Ivan brought to you by Pronounce Names (http://www.PronounceNames.com), a website dedicated to helping people pronounce names correctly. For more information about this name, such as gender, origin, etc., go to http://www.PronounceNames.com/Ivan. 1  Education. 2  Standard YouTube License. "}, {"url": "http://www.thinkbabynames.com/meaning/1/Ivan", "passage_text": "Ivan /ivan/ [2 sylls.] as a boys' name is pronounced ee-VAHN, EYE-van. It is of Russian, Slavic and Hebrew origin, and the meaning of Ivan is  God is gracious . Variant of Hebrew John. Ivanhoe is a medieval variant Sir Walter Scott used for the Saxon hero of his novel Ivanhoe. Tennis celebrity Ivan Lendl. Ivan is alike in pronunciation to Avon, Evann, Even, Evian, Evin, Evyn, Iven, Ivon and Yvon. Other recommended similar baby names are Idan, Iefan, Ilan, Iman and Ivar. These names tend to be less frequently used than Ivan."}, {"url": "https://en.wikipedia.org/wiki/Iwan_(name)", "passage_text": "Iwan is a masculine given name and a surname. It is a Welsh and Cornish name related to Ifan and derived from the Latin Johannes. It is also found in Germanic and Slavic languages as a variant of Ivan (name) , which is a form of the Biblical name John. The Welsh given name related to this is Ioan rather than Iwan. "}]