[{"url": "http://www.fool.com/investing/general/2014/08/09/its-good-to-be-a-landlord-in-these-5-states.aspx", "passage_text": "Some of the gains can be attributed to the rise in home values over the past couple of years, and some can be the result of the reluctance or inability of people to buy homes. However, just because rent is rising doesn't necessarily mean it's a good time to buy an investment property. South Carolina Despite home values rising by 4.2% over the last year, South Carolina's rent prices have risen by more than 7.5%, making it a solid place to buy investment property. And, South Carolina is an affordable market to get into with a ton of sub-$100,000 homes on the market. The state's housing market is rated just a 2.5 out of 10 by Zillow in terms of overall health, and homes are sitting on the market for an average of 130 days, making it a good time to be a buyer in South Carolina"}, {"url": "http://www.moneycrashers.com/five-issues-with-buying-rental-property-and-becoming-a-landlord/", "passage_text": "Just remember that being a landlord is not all fun and games. You’ll work hard for your money and may be faced with adversity from time to time. Buying rental property is not for everyone. It should be an investment option you consider only once you’ve achieved a certain level of financial independence. Ask yourself if you’re comfortable confronting your tenants before you start renting. Keep in mind that you’ll have to make judgment calls as a landlord. For example, imagine you’ve had a tenant for six months and one month he doesn’t pay the rent. You don’t hear from him for a week."}, {"url": "http://www.getrichslowly.org/blog/2012/10/18/being-a-landlord-is-it-worth-it/", "passage_text": "I’ve spoken to a few Realtors about renting out property, and they’ve all said that many people do not have the stomach to be landlords. If you know deep down that you can do it, then go for it. But if you have any doubts at all, then being a landlord might not be the thing for you. loading.... As a future landlord this is a great article. I’m sure a lot of new landlords don’t figure in the cost of maintenance, taxes, property taxes, insurance ect.. when they first think about becoming landlords. They also don’t think of the pitfalls of dealing with some really bad tenants."}, {"url": "http://www.huffingtonpost.com/brandon-turner/five-easy-tips-for-being-_b_4362228.html", "passage_text": "When screening for tenants, I typically require: Be careful not to screen out tenants based on any of the protected classes, or you could find yourself in a lawsuit or sitting in a jail cell. This may come off sounding a little harsh, but I believe the vast majority of landlords out there are absolutely terrible. Your job as a landlord is to be fair, not to be nice. Being nice will give your tenants and others the invitation to walk all over you and take advantage at every turn. But Brandon they say It was Black Friday and I really needed that big screen TV. I get paid again in two weeks."}, {"url": "http://www.getrichslowly.org/blog/2012/10/18/being-a-landlord-is-it-worth-it/", "passage_text": "While being a landlord can be stressful and expensive, I believe that the future rewards will be worth it. Our two rental properties will be paid off in approximately 14 years…right in time for our two small children to begin college. We could use the rental income to pay for our children’s education. As a future landlord this is a great article. I’m sure a lot of new landlords don’t figure in the cost of maintenance, taxes, property taxes, insurance ect.. when they first think about becoming landlords. They also don’t think of the pitfalls of dealing with some really bad tenants."}, {"url": "http://www.fool.com/investing/general/2014/08/09/its-good-to-be-a-landlord-in-these-5-states.aspx", "passage_text": "The bottom line is that as long as you do your homework and get a good deal on a property, there is money to be made everywhere. These states just make it a little easier. More from The Motley Fool: Warren Buffett Tells You How to Turn $40 into $10 Million Try any of our Foolish newsletter services free for 30 days. South Carolina Despite home values rising by 4.2% over the last year, South Carolina's rent prices have risen by more than 7.5%, making it a solid place to buy investment property. And, South Carolina is an affordable market to get into with a ton of sub-$100,000 homes on the market. The state's housing market is rated just a 2.5 out of 10 by Zillow in terms of overall health, and homes are sitting on the market for an average of 130 days, making it a good time to be a buyer in South Carolina"}, {"url": "http://www.iowalegalaid.org/resource/summary-of-iowa-landlord-and-tenant-law", "passage_text": "1 If tenants are going to be gone for a length of time, it is a good idea to let the landlord know. 2  It is illegal for a landlord to get back at a tenant for complaining about the condition of the property to the landlord or housing inspector. It does not cover all situations. A rental agreement is the understanding between the landlord and tenant. It may be in writing or oral. See other articles posted on this website and the Iowa Legal Aid publication A Guide to Landlord Tenant Law in Iowa for more details about landlord and tenant law."}, {"url": "http://www.interest.com/real-estate/news/7-smart-moves-for-getting-started-landlord/", "passage_text": "Recognize that being a landlord is a business. Being a landlord is different than being a private homeowner. It’s a business and you need to treat it like one. Where I see a lot of people make mistakes is, they don’t have a good business plan, Roberts says. This type of investment is not hands-off. Of all the costs associated with being a landlord, the biggest one is vacancy, Roberts says. Every time a tenant moves out, you’re going to spend money, probably quite a bit of it.. That means finding and keeping good tenants is the heart of successfully investing long-term in real estate."}, {"url": "http://realestate.findlaw.com/landlord-tenant-law/rules-for-landlords-and-property-managers-when-evicting-a-tenant.html", "passage_text": "Also, tenants often attempt to show a landlord's wrongdoings in order to take the focus away from themselves and gain sympathy from a judge. This is why it is important to be a good landlord and never give a tenant an opportunity to argue to stay in one of your rental properties. The compromise for this speed is that the landlord must be absolutely sure that every i is dotted and every t crossed. Lastly, in most situations, an unlawful detainer suit is worth more to a tenant than it is to a landlord."}]