[{"url": "http://www.youtube.com/watch?v=v1mNYWwBLGA", "passage_text": "Please try again later. Monza About this sound listen is a city and comune on the River Lambro, a tributary of the Po in the Lombardy region of Italy, about 15 kilometres (9 miles) north-northeast of Milan. It is the capital of the Province of Monza and Brianza."}, {"url": "http://www.youtube.com/watch?v=v1mNYWwBLGA", "passage_text": "Monza About this sound listen is a city and comune on the River Lambro, a tributary of the Po in the Lombardy region of Italy, about 15 kilometres (9 miles) north-northeast of Milan. It is the capital of the Province of Monza and Brianza."}, {"url": "http://www.italia.it/en/discover-italy/lombardy/monza-and-brianza.html", "passage_text": "Monza and Brianza. Within the tri-city area of Como, Lecco and Milan, the Province of Monza and Brianza lies mostly on flatlands, with a few hilly areas to the north and east; it is criss-crossed by the Rivers Lambro and Seroso, as well as by many canals."}, {"url": "http://www.maplandia.com/italy/lombardia/milano/monza/", "passage_text": "Welcome to the Monza google satellite map! This place is situated in Milano, Lombardia, Italy, its geographical coordinates are 45° 35' 0 North, 9° 16' 0 East and its original name (with diacritics) is Monza. See Monza photos and images from satellite below, explore the aerial photographs of Monza in Italy."}, {"url": "http://www.officeoftourism.us/europe/italy/Lombardy/monza.asp", "passage_text": "Monza is a city on the river Lambro, a tributary of the Po, in the Lombardy region of Italy some 15km north-northeast of Milan. It is best known for its Grand Prix motor racing circuit, the Autodromo Nazionale Monza."}, {"url": "http://www.shortnews.com/start.cfm?id=41522", "passage_text": "Goldfish Bowls Banned in Monza. The northern Italian region of Monza, home to Italy's Formula 1 Grand Prix, has announced that citizens of Monza are no longer allowed to keep their goldfish in goldfish bowls. The new regulation was brought about by the town council."}]