[{"url": "http://www.debate.org/opinions/should-minors-be-charged-as-adults", "passage_text": "Minors should be charged as adults. Minors should be charged as adults. Depending on what kind of crime that they commit, I think that if they are going to do something bad then they should expect to do the time. It should not matter to the court system the age of the individual that is found guilty. No they should not. Minors should not be charged as adults especially since many minors do not fully understand what they did or really meant to do it. Maybe they just took a joke too far, or were out having fun and did not realize they were causing problems for others."}, {"url": "http://www.debate.org/opinions/should-juveniles-be-tried-as-adults", "passage_text": "Minors should be charged as adults. No matter if its shop lifting or cold blood murder, charge the kids as adults and maybe they will start thinking like one and grow up. Minors are capible of knowing what they are doing, so there for they can pay the time for it. Be responsible for what you did! Minors should be tried as adults because they made the same mistakes as adults. If they had the guts to break the law they should have the responsibility to face what they did."}, {"url": "http://www.teenink.com/opinion/social_issues_civics/article/162031/Teens-Should-Absolutely-Be-Tried-as-Adults-When-They-Commit-Adult-Crimes/", "passage_text": ". said... Sep. 9 at 3:49 pm. I agree that teens should be tried as adults because when my older bro was 15 he molested me and my (at the time they were 10months and 2 years old) god son Wyatt and cousin Alex, and he was put in jail for 6months but they did not try him as an adult which didn't teach him anything. It really doesn’t matter the age of the criminal, it they are committing crimes that are inherently adult in nature, then yes, these criminals absolutely should be punished as an adult regardless of their age."}, {"url": "http://www.debate.org/opinions/should-juveniles-be-tried-as-adults", "passage_text": "Juveniles should deffinatley be tried as adults because, its not like they dont know what they are doing. Now a days people are smarter than you think, with the increase in technology, you cant take anyone for granite. Be responsible for what you did! Minors should be tried as adults because they made the same mistakes as adults. If they had the guts to break the law they should have the responsibility to face what they did."}, {"url": "http://www.nolo.com/legal-encyclopedia/juveniles-youth-adult-criminal-court-32226.html", "passage_text": "In most states, a juvenile offender must be at least 16 to be eligible for waiver to adult court. But, in a number of states, minors as young as 13 could be subjected to a waiver petition. And a few states allow children of any age to be tried as adults for certain types of crimes, such as homicide. The current trend among states is to lower the minimum age of eligibility for waiver into adult court. (To learn more about state laws requiring juveniles to be tried as adults, see the Automatic Transfer Laws and Reverse Transfer Hearings section below.). If the prosecutor or judge seeks to transfer the case to adult court, the minor is entitled to a hearing and representation by an attorney."}, {"url": "http://www.debate.org/opinions/should-minors-be-charged-as-adults", "passage_text": "Minors should be charged as an adult if the crime they committed is heinous. It is not much of a difference between an adult and a minor who commits the same crimes except their age. Plus kids should already know that in every thing they do their will be consequences. No they should not. Minors should not be charged as adults especially since many minors do not fully understand what they did or really meant to do it. Maybe they just took a joke too far, or were out having fun and did not realize they were causing problems for others."}, {"url": "http://www.debate.org/opinions/should-juveniles-be-tried-as-adults", "passage_text": "Kids should be charged as adults only if the crime committed is heinous. I as a 17 year old teen, think that if a kid commits a crime like rape, murder, or something else like that, they should be charged as an adult. Be responsible for what you did! Minors should be tried as adults because they made the same mistakes as adults. If they had the guts to break the law they should have the responsibility to face what they did."}, {"url": "http://www.debate.org/opinions/should-minors-be-charged-as-adults", "passage_text": "Minors should be charged as adults in the case that the offense caused someone's death deliberately or caused extreme life changing bodily harm that cannot be repaired. People give too much leniency to minors because they feel they can't premeditate causing bodily harm or death. No they should not. Minors should not be charged as adults especially since many minors do not fully understand what they did or really meant to do it. Maybe they just took a joke too far, or were out having fun and did not realize they were causing problems for others."}, {"url": "http://www.debate.org/opinions/should-minors-be-charged-as-adults", "passage_text": "Minors should not be charged as adults. Simply put they are minors because they are not considered adults. They do not have the maturity or life experiences to behave as an adult in some cases. We can all look back at our pasts and come up with an instance or two we would shake our heads at. No they should not. Minors should not be charged as adults especially since many minors do not fully understand what they did or really meant to do it. Maybe they just took a joke too far, or were out having fun and did not realize they were causing problems for others."}]