[{"url": "https://www.longhaircareforum.com/threads/any-miracle-results-with-biotin.266381/", "passage_text": "I've been taking 5000 mcg of biotin from Nature's Bounty that i got a CVS for about two months along with a my multivitamin which contains various B vitamins. I don't think it's made much a dramatic difference in my hair growth. My hair seems about the same to me. "}, {"url": "http://www.healthboards.com/boards/hair-problems/477556-biotin-how-long.html", "passage_text": "For those of you that take (or have taken) biotin, how long did you take it before you saw results? Also, what dosage were (are) you taking? I've been taking 5mg (5000mcg) for about two weeks. Obviously, that's not a long enough time to see results, but I was just wondering when could I expect to see any? I have a 60-day supply and I'm hoping to see some improvement by then."}, {"url": "http://forum.blackhairmedia.com/how-long-did-it-take-to-see-results-from-biotin_topic315418.html", "passage_text": "I've been taking biotin for about a month and I can already tell a difference in thickness and in length. I admit though the first 3 days of taking biotin it made me nauseous but after that everything was fine. I take 5000mcg per day. Report Post. BHM Members who take biotin.... How long did it take for you to see results from biotin? What mg or mcg are you using?"}, {"url": "http://www.healthboards.com/boards/hair-problems/477556-biotin-how-long.html", "passage_text": "I started taking 5000mcg of biotin a couple of years ago with my women's multi vitamin/mineral. It took at least 3 weeks to start working. I did that for about 4 months and now I only take 2000mcg every other day with my vitamins and my hair and nails look great! I've been taking 5mg (5000mcg) for about two weeks. Obviously, that's not a long enough time to see results, but I was just wondering when could I expect to see any? I have a 60-day supply and I'm hoping to see some improvement by then."}, {"url": "https://answers.yahoo.com/question/index?qid=20080106122425AAcYHPv", "passage_text": "How long will it be before i start seeing results from Biotin as far as hair, skin, and nails??? Please give useful advice...Thank You 5000mcg Sincerely, Brooklyn. Report Abuse. Give it about 2 weeks or so to see results. Take two a day and take the pills with a meal. Basically don't take it on an empty stomach. Sometimes I would take it on an empty stomach and I would feel nauseated in about 5 minutes."}, {"url": "http://forum.blackhairmedia.com/how-long-did-it-take-to-see-results-from-biotin_topic315418.html", "passage_text": "I didn't see any immediate results so I started taking MSM along with the biotin and had good results. Then I thought that maybe it was the MSM by itself helping my hair and stopped taking the biotin. Report Post. BHM Members who take biotin.... How long did it take for you to see results from biotin? What mg or mcg are you using?"}, {"url": "https://www.longhaircareforum.com/threads/when-will-i-see-my-biotin-results.103113/", "passage_text": "Trophy Points: 0. I have just jumped on the 2,500 mcg Biotin and Flaxseed oil regimen about two weeks ago. I try not to be impatient but I wonder how long it will take for me to see some real results. I can tell the flaxseed is making my hair softer b/c I can feel the texture is more slippery or well oiled."}, {"url": "http://www.curlcentric.com/biotin-for-hair-growth/", "passage_text": "Im concerned about my weight so I would rather take the supplement than eat all those unneccessary calorie from intaking the biotin through foods like breads and cereals. It takes about 3 months to notice results .and you have to take everyday.i will be taking it for 2 year until I reach my hair goal. Also a bottle cost 5 dollar at walmart for 120 capsule,so what do u have to lose. Hair grows. That’s what it does. Biotin makes your hair STRONGER so it CAN grow, which is not the same. Taking biotin and not doing anything else for your hair will be just as unproductive as doing nothing to care for your hair."}]