[{"url": "http://www.studentloanborrowerassistance.org/bankruptcy/", "passage_text": "Print PDF. Student loans are difficult, but not impossible, to discharge in bankruptcy. To do so, you must show that payment of the debt “will impose an undue hardship on you and your dependents.”. Courts use different tests to evaluate whether a particular borrower has shown an undue hardship. These plans allow you to get caught up on mortgages or car loans and other secured debts. If you cannot discharge your student loans based on undue hardship in either a chapter 7 or chapter 13 bankruptcy, there are still certain advantages to filing a chapter 13 bankruptcy. One advantage is that your chapter 13 plan, not your loan holder will determine the size of your student loan payments"}, {"url": "http://bankruptcy.findlaw.com/debt-relief/your-options-when-you-can-t-repay-student-loans.html", "passage_text": "Also, if you foresee that you will not be able to pay back your student loans within the period for repayment (generally 10 years), or your monthly payments are more than 20% of your income each month, you may be able to get a forbearance. "}, {"url": "https://studentloanhero.com/featured/how-to-discharge-student-loans-via-bankruptcy/", "passage_text": "While filing for Chapter 7 or Chapter 13 bankruptcy will wipe away many of your consumer debts (like outstanding medical bills or even a mortgage), your student loan debt is exempt from the same treatment unless you can prove an “undue hardship”. You can typically hire a law firm to do this on your behalf for a few hundred dollars. At first, the court will deny your request to discharge your student loans in the bankruptcy filing, and will have to file a separate adversary proceeding and prove repayment of your student loans would cause an undue hardship."}, {"url": "http://www.nolo.com/legal-encyclopedia/student-loan-debt-bankruptcy.html", "passage_text": "Most debtors will not be able to discharge (wipe out) student loan debt in Chapter 7 or Chapter 13 bankruptcy. However, if you can prove that repaying your student loans would cause an undue hardship to you, you can get rid of your student loans in bankruptcy. For example, you may be able to pay a reduced amount during your Chapter 13 plan -- although you'll be on the hook for whatever amount is left after your repayment period ends. For detailed information on how Chapter 13 can help with student loans, see Nolo's article Student Loans in Chapter 13 Bankruptcy."}, {"url": "http://www.studentloanborrowerassistance.org/bankruptcy/", "passage_text": "You will make these court-determined payments while you are in the Chapter 13 plan, usually for three to five years. You will still owe the remainder of your student loans when you come out of bankruptcy, but you can try at this point to discharge the remainder based on undue hardship. These plans allow you to get caught up on mortgages or car loans and other secured debts. If you cannot discharge your student loans based on undue hardship in either a chapter 7 or chapter 13 bankruptcy, there are still certain advantages to filing a chapter 13 bankruptcy. One advantage is that your chapter 13 plan, not your loan holder will determine the size of your student loan payments"}, {"url": "http://www.nolo.com/legal-encyclopedia/student-loan-debt-bankruptcy.html", "passage_text": "Chapter 7 bankruptcy. In Chapter 7 bankruptcy, if payment of your loans is not an undue hardship, you’ll still owe them when your bankruptcy case is over. Chapter 13 bankruptcy. If you can't discharge your student loans, Chapter 13 bankruptcy provides some other ways that can help. For example, you may be able to pay a reduced amount during your Chapter 13 plan -- although you'll be on the hook for whatever amount is left after your repayment period ends. For detailed information on how Chapter 13 can help with student loans, see Nolo's article Student Loans in Chapter 13 Bankruptcy."}, {"url": "http://www.alllaw.com/articles/nolo/bankruptcy/using-chapter-13-bankruptcy-to-manage-student-loans.html", "passage_text": "How to Use Chapter 13 to Manage Student Loan Payments. Even if you can’t use bankruptcy to eliminate your student loans, you may be able use Chapter 13 bankruptcy to reduce the amount you pay on your student loans for the length of your bankruptcy case, usually 36 to 60 months. Student Loans are Difficult to Discharge. You can usually discharge unsecured debts, like credit card debt, medical bills, and personal, loans, in bankruptcy. Student loans are also unsecured debts, but bankruptcy treats them differently."}, {"url": "http://www.alllaw.com/articles/nolo/bankruptcy/using-chapter-13-bankruptcy-to-manage-student-loans.html", "passage_text": "To discharge student loans, you must to file a separate lawsuit in your bankruptcy case, called an adversary proceeding. To win that proceeding, you must show the court that paying your student loans will cause you or your dependents a hardship. Student Loans are Difficult to Discharge. You can usually discharge unsecured debts, like credit card debt, medical bills, and personal, loans, in bankruptcy. Student loans are also unsecured debts, but bankruptcy treats them differently."}]