[{"url": "https://en.wikipedia.org/wiki/American_Civil_Liberties_Union", "passage_text": "The ACLU played a central role in all major civil liberties debates of the 1960s, including new fields such as gay rights, prisoner's rights, abortion, rights of the poor, and the death penalty. Membership in the ACLU increased from 52,000 at the beginning of the decade, to 104,000 in 1970. The ACLU provides legal assistance in cases when it considers civil liberties to be at risk. Legal support from the ACLU can take the form of direct legal representation, or preparation of amicus curiae briefs expressing legal arguments (when another law firm is already providing representation)."}, {"url": "http://acluok.org/our-work/policy-legislation/", "passage_text": "Recent news about ACLU of Oklahoma legal cases: The ACLU of Oklahoma believes that the best way to protect the Bill of Rights and the freedoms it guarantees is to ensure that unconstitutional bills never become law. Our legislative program tackles a wide range of civil liberties issues, including criminal justice, freedom of speech, voting rights, LGBT rights, reproductive freedom, privacy, racial justice, immigrants’ rights, and religious freedom."}, {"url": "https://en.wikipedia.org/wiki/American_Civil_Liberties_Union", "passage_text": "During the 1930s, the ACLU started to engage in work combating police misconduct and for Native American rights. Most of the ACLU's cases came from the Communist party and Jehovah's Witnesses. In 1940, the ACLU leadership was caught up in the Red Scare, and voted to exclude Communists from its leadership positions. The ACLU provides legal assistance in cases when it considers civil liberties to be at risk. Legal support from the ACLU can take the form of direct legal representation, or preparation of amicus curiae briefs expressing legal arguments (when another law firm is already providing representation)."}, {"url": "https://www.hrw.org/news/2014/07/28/us-surveillance-harming-journalism-law-democracy", "passage_text": "“The work of journalists and lawyers is central to our democracy,” said report author Alex Sinha, Aryeh Neier Fellow at Human Rights Watch and the American Civil Liberties Union. “When their work suffers, so do we.. Languages. (Washington, DC) – Large-scale US surveillance is seriously hampering US-based journalists and lawyers in their work, Human Rights Watch and the American Civil Liberties Union said in a joint report released today."}, {"url": "https://www.aclu.org/faqs", "passage_text": "The American Civil Liberties Union was founded in 1920 and is our nation's guardian of liberty. The ACLU works in the courts, legislatures and communities to defend and preserve the individual rights and liberties guaranteed to all people in this country by the Constitution and laws of the United States. I do not want the ACLU to share my name and mailing address with other charities. If you would prefer that the ACLU not share your name or mailing address with other charities, please fill out our No-Exchange of Name Form."}, {"url": "https://www.aclu.org/faqs", "passage_text": "I'm concerned about my civil liberties. Join the ACLU. You can join the ACLU's Action Network to receive weekly alerts about legislative issues and to send free faxes to your members of Congress. Visit the ACLU's Action Center and take the steps listed on the Action Checklist. I do not want the ACLU to share my name and mailing address with other charities. If you would prefer that the ACLU not share your name or mailing address with other charities, please fill out our No-Exchange of Name Form."}, {"url": "https://en.wikipedia.org/wiki/American_Civil_Liberties_Union", "passage_text": "Legally, the ACLU consists of two separate but closely affiliated nonprofit organizations: the American Civil Liberties Union, a 501(c)(4) social welfare group, and the ACLU Foundation, a 501(c)(3) public charity. The ACLU provides legal assistance in cases when it considers civil liberties to be at risk. Legal support from the ACLU can take the form of direct legal representation, or preparation of amicus curiae briefs expressing legal arguments (when another law firm is already providing representation)."}, {"url": "http://people.howstuffworks.com/aclu.htm", "passage_text": "For more than 80 years, the American Civil Liberties Union (ACLU) has worked to defend fundamental rights such as freedom of speech, freedom of religion and the right to privacy. The efforts of ACLU attorneys have also influenced interpretations of U.S. Constitutional law. The ACLU has grown to include more than 400,000 members and handles around 6,000 court cases each year [ ref ]."}, {"url": "http://www.answers.com/Q/How_does_the_American_Civil_Liberties_Union_influence_government_policies", "passage_text": "The American Civil Liberties Union or ACLU influences government by testing the extremes of law and therefore forcing interpretations of the Constitution. The ACLU is a defin … ing power in the country. The American Civil Liberties Union is broken down two separate non-profit organizations: The ACLU foundation which focuses on litigation and communication efforts, and the Ame … rican Civil Liberties Union which focuses on legislative lobbying."}]