[{"url": "http://smallbusiness.chron.com/three-different-types-psychological-testing-used-workplace-25537.html", "passage_text": "Employees have certain rights with respect to psychological tests, such as the right to know the purpose of the tests and the results. Psychological tests may assess an employee's general aptitude, intelligence and personality."}, {"url": "http://www.assessmentpsychology.com/currenttests.htm", "passage_text": "The tests can be used with a population ranging in age from 2 years to 80+ years. The achievement battery is available as a standard battery comprising 12 tests or an extended battery that has 10 tests that provide more in-depth diagnostic information on specific academic strengths and weaknesses."}, {"url": "https://www.123test.com/holland-codes-career-tests/", "passage_text": "Holland Codes are one of the most popular models used for career tests today. Holland argued that the choice of a vocation is an expression of personality. There are six personality types in Holland's model and most people will fit into a few of the categories:"}, {"url": "http://www.criteriacorp.com/solution/personality.php", "passage_text": "Employment personality tests are a valuable tool for gaining insights into the interaction style, personality traits, and behavioral tendencies of individuals. They are designed to assess the aspects of a person's personality that remain relatively stable throughout an individual's lifetime."}, {"url": "http://www.psychometric-success.com/personality-tests/personality-tests-big-5-aspects.htm", "passage_text": "The ‘Big 5’ Aspects of Personality. It is important to be aware that the personality tests used in the recruitment and selection process are the intellectual property of the companies that produce them. As a result, they may use different terminology to describe the aspects of personality that they set out to measure."}, {"url": "http://smallbusiness.chron.com/three-different-types-psychological-testing-used-workplace-25537.html", "passage_text": "Three Different Types of Psychological Testing Used in the Workplace. Private and public sector companies often conduct psychological tests for candidates, usually for full-time employment."}, {"url": "http://www.businessballs.com/personalitystylesmodels.htm", "passage_text": "There are very many free tests that can be 'positioned' for given functions (eg, management style) subject to thinking logically about how the perspective of the particular test relates to personality, style, and by implication (in this case) to management."}, {"url": "http://www.cornellhrreview.org/personality-tests-in-employment-selection-use-with-caution/", "passage_text": "There is some debate in the industrial/organizational (“IO”) psychology field as to whether personality measures should be used in employee selection. [20] Many believe that personality tests used for employee selection are not valid, and in any event, can be faked."}]