[{"url": "http://www.answers.com/Q/What_happened_to_bob_Ewell_in_october", "passage_text": "Later he attacks Scout because Atticus made him appear petty and ignorant, and he is angry at everyone involved in the case. When he attacks Scout, he is subdued by Boo Radley and is killed. Bob Ewell is the white person who accuses Tom Robinson of raping his daughter, Mayella Ewell. He is a stupid and ignorant man, and the Ewells are the poorest family in all of Maycomb. They live behind the dump and Atticus calls them savages. "}, {"url": "http://www.answers.com/Q/What_happened_to_Bob_Ewell", "passage_text": "Bob Ewell is a character from to kill a mockingbird, that accuses a black man (Tom Robinson) of abusing his daughter, when it was really Bob Ewell who abused her. The Ewells a … re a poor family because any money that Bob Ewell makes he just goes and spends it on whiskey. Bob Ewell … is a character from To Kill a Mockingbird, who accuses a black man (Tom Robinson) of abusing his daughter, after Ewell had done it himself. The Ewells are a poor family because any money that Bob makes he spends"}, {"url": "http://www.weegy.com/?ConversationId=FULORUOJ", "passage_text": "User: What happens to Bob Ewell at the end of the novel? A. He goes to prison for threatening Scout and Jem. B. We do not know what happens to him. C. He is stabbed by Boo Radley. D. He commits suicide."}, {"url": "http://www.enotes.com/homework-help/how-did-bob-ewell-die-67403", "passage_text": "Posted on. (Answer #1). Bob Ewell is killed by Boo Radley. This happens on Halloween, when Jem and Scout are walking home from the pagent at school and Mr Ewell tries to attack them. Boo Radley sees what is happening and rushes out to save Jem and Scout. Bob Ewell was killed by Boo Radley. On the night of Halloween, while the children walked back home from a school festival, Bob Ewell wanted to get revenge on Atticus by trying to kill the children. Luckily though Boo Radley was there and was able to stick a kitchen knife in Bob Ewell"}, {"url": "http://www.answers.com/Q/What_happened_to_Bob_Ewell", "passage_text": "When he attacks Scout, he is subdued by Boo Radley and is killed. Bob Ewell is the white person who accuses Tom Robinson of raping his daughter, Mayella Ewell. He is a stupid and ignorant man, and the Ewells are the poorest family in all of Maycomb. They live behind the dump and Atticus calls them savages. Bob Ewell … is a character from To Kill a Mockingbird, who accuses a black man (Tom Robinson) of abusing his daughter, after Ewell had done it himself. The Ewells are a poor family because any money that Bob makes he spends on whiskey."}, {"url": "http://www.enotes.com/homework-help/how-did-bob-ewell-die-67403", "passage_text": "(Answer #2). Atticus believes that Jem killed Bob Ewell. When Jem and Scout were on their way back from the Halloween Party, there was a scuffle between Jem, Scout, Bob Ewell, and a mysterious figure (believed to be Boo Radley). Bob Ewell was killed by Boo Radley. On the night of Halloween, while the children walked back home from a school festival, Bob Ewell wanted to get revenge on Atticus by trying to kill the children. Luckily though Boo Radley was there and was able to stick a kitchen knife in Bob Ewell"}, {"url": "http://www.weegy.com/?ConversationId=07VWMZMX", "passage_text": "What happens to Bob Ewell at the end of the novel? A. We do not know what happens to him. B. He goes to prison for threatening Scout and Jem. C. He commits suicide. D. He is stabbed. A. We do not know what happens to him. B. He goes to prison for threatening Scout and Jem. C. He commits suicide. D. He is stabbed by Boo Radley Weegy: A. He is stabbed by Boo Radley cinprincess07|Points 10|User: Which character does the mockingbird best represent?"}, {"url": "http://www.enotes.com/homework-help/how-did-bob-ewell-die-67403", "passage_text": "Bob Ewell is killed by Boo Radley. However, they pretend and close the case off by saying that Bob Ewell was killed by falling on his own knife. Bob tried to kill the children, but luckily with Boo Radley there, Bob was able to be stopped (and Killed) and the children were able to be safe. Bob Ewell was killed by Boo Radley. On the night of Halloween, while the children walked back home from a school festival, Bob Ewell wanted to get revenge on Atticus by trying to kill the children. Luckily though Boo Radley was there and was able to stick a kitchen knife in Bob Ewell"}, {"url": "http://www.weegy.com/?ConversationId=07VWMZMX", "passage_text": "Original conversation. User: What happens to Bob Ewell at the end of the novel? A. We do not know what happens to him. B. He goes to prison for threatening Scout and Jem. C. He commits suicide. D. He is stabbed by Boo Radley Weegy: A. He is stabbed by Boo Radley cinprincess07|Points 10|User: Which character does the mockingbird best represent?"}]