[{"url": "http://www.ww2f.com/topic/39456-the-schlieffen-plan/", "passage_text": "Evolved in 1905 by General Count Alfred von Schlieffen, chief of the German General Staff, to deal with a potential two front war against France and Russia. The plan took advantage of their main weaknesses-the slow mobilisation of the Russian army, and the determination to attack at all cost in the French army. "}, {"url": "http://spartacus-educational.com/FWWschlieffenP.htm", "passage_text": "The rest of the German Army would be sent to defensive positions in the east to stop the expected Russian advance. When Helmuth von Moltke replaced Alfred von Schlieffen as German Army Chief of Staff in 1906, he modified the plan by proposing that Holland was not invaded. As a result of these moves the German military began to fear the possibility of a combined attack from France, Britain and Russia. Alfred von Schlieffen, German Army Chief of Staff, was given instructions to devise a strategy that would be able to counter a joint attack."}, {"url": "http://alphahistory.com/worldwar1/schlieffen-plan/", "passage_text": "The Schlieffen Plan. Count von Schlieffen, the architect of the German war plan activated in 1914. The Schlieffen Plan was a battle plan, drawn up by German tacticians, to secure victory against both France and Russia. 1. The Schlieffen Plan was Germany’s tactical solution for avoiding a two-front war with France and Russia. 2. Under this plan, drawn up in 1905, France would be forced to a quick surrender by a German invasion in the north."}, {"url": "http://military.wikia.com/wiki/Schlieffen_Plan", "passage_text": "Chief of the General Staff Helmuth von Moltke made several changes to the Schlieffen Plan. One of his changes was that he weakened the right wing of the German army, which was invading France by way of Belgium, in order to strengthen the left-wing, which was defending Alsace-Lorraine against the French invasion. The Schlieffen Plan (German language: Schlieffen-Plan, [ʃliːfən plaːn]) was the German General Staff 's early 20th-century overall strategic plan for victory in a possible future war in which the German Empire might find itself fighting on two fronts: France to the west and Russia to the east."}, {"url": "http://www.weegy.com/?ConversationId=AC32AE1F", "passage_text": "5. The German military plan devised by General von Schlieffen (1 point) called for war on two fronts. relied on carpet-bombing. depended on help from Serbia. "}, {"url": "http://www.answers.com/Q/What_was_the_Schlieffen_Plan", "passage_text": "The Schieffen Plan was Germany's key war plan for invading France at the start of World War 1. It involved marching through Belgium in order to knock France out of the war quickly. The plan was devised by Alfred von Schlieffen. It involved attacking France through Belgium in the event of war with France. The Schlieffen Plan (in World War I) was named for its author, the German army chief of staff Count Alfred von Schlieffen, who formulated it in 1905."}, {"url": "http://www.historylearningsite.co.uk/world-war-one/causes-of-world-war-one/the-schlieffen-plan/", "passage_text": "The Schlieffen Plan. The Schlieffen Plan was created by General Count Alfred von Schlieffen in December 1905. The Schlieffen Plan was the operational plan for a designated attack on France once Russia, in response to international tension, had started to mobilise her forces near the German border. The execution of the Schlieffen Plan led to Britain declaring war on Germany on August 4th, 1914. In 1905, Schlieffen was chief of the German General Staff. Europe had effectively divided into two camps by this year – Germany, Austria and Italy (the Triple Alliance) on one side and Britain, France and Russia (the Triple Entente) on the other"}, {"url": "http://spartacus-educational.com/FWWschlieffen.htm", "passage_text": "Alfred von Schlieffen. Alfred von Schlieffen was born in Berlin, Germany, in 1833. He attended the Berlin War Academy (1858-61) and was a staff officer during the Austro-Prussian War (1866). In 1891 Schlieffen replaced Helmuth von Moltke as Chief of General Staff. Schlieffen feared that France and Russia would join together to attack Germany. His main concern was to devise a plan that could deal with a war against Russia in the east and France in the west. "}]