[{"url": "http://vas-reversals.com/costandscheduling.html", "passage_text": "Nationwide, the surgeon’s fee alone for vasectomy reversals ranges from $5,000.00 to $15,000.00. This may not include the hospital fees associated with the vasectomy reversal. This is a cost that is beyond the means of many families."}, {"url": "http://www.vasectomymedical.com/vasectomy-reversal-cost.html", "passage_text": "The total cost of a vasectomy reversal can range somewhere between $4,000 to $20,000, all inclusive. In the United States, vasectomy reversal prices, are, on average, US$10,000. In Canada the average vasectomy reversal cost is about CAN$5"}, {"url": "http://health.costhelper.com/vasectomy-reversal.html", "passage_text": "1 Vasectomy reversal typically costs $6,000 to $15,000, including the doctor's fee, anesthesia and facility fee. 2  Vasectomy reversal is almost never covered by insurance."}, {"url": "http://www.vasectomymedical.com/vasectomy-reversal-cost.html", "passage_text": "Understanding Fees and Pricing. The cost of a vasectomy reversal, from start to finish is generally divided into three fees, with the patient responsible for: 1  The surgical fee: This is the fee the surgeon charges for his work. 2  This ranges from $2500 to $10,000."}, {"url": "http://vas-reversals.com/costandscheduling.html", "passage_text": "Vasectomy Reversal Cost and Scheduling. Nationwide, the surgeon’s fee alone for vasectomy reversals ranges from $5,000.00 to $15,000.00. This may not include the hospital fees associated with the vasectomy reversal. This is a cost that is beyond the means of many families."}, {"url": "http://www.vasectomy.com/article/vasectomy-reversal/faq/how-much-does-a-vasectomy-reversal-cost#!", "passage_text": "Plus, overall costs for ARTs are higher than for vasectomy reversals. (The average cost for in vitro fertilization is $12,500 per attempt. With a 30 percent success rate, more than one course of IVF may be necessary for successful conception)."}, {"url": "http://www.vasectomy.com/article/vasectomy-reversal/faq/how-much-does-a-vasectomy-reversal-cost#!", "passage_text": "Tweet. The cost of vasectomy reversal varies depending on the physician's office, your geographic location, and the type of procedure performed. It is not inexpensive, but there are a few options that may help you fit it into your family budget."}, {"url": "http://www.vasectomymedical.com/vasectomy-reversal-cost.html", "passage_text": "Unlike vasectomy, the cost of vasectomy reversal is rarely covered by medical plans. However always check your medical insurance coverage to be sure. The vasectomy reversal cost is therefore considered an elective, fee-for-service procedure."}]