[{"url": "https://en.wikipedia.org/wiki/Low-carbohydrate_diet", "passage_text": "The term low-carbohydrate diet is generally applied to diets that restrict carbohydrates to less than 20% of caloric intake, but can also refer to diets that simply restrict or limit carbohydrates to less than recommended proportions (generally less than 45% of total energy coming from carbohydrates). Low-carbohydrate diets or low-carb diets are dietary programs that restrict carbohydrate consumption, often for the treatment of obesity or diabetes."}, {"url": "http://www.mercola.com/nutritionplan/beginner_carbs.htm", "passage_text": "Carbohydrates provide fuel for your body in the form of glucose or sugar. There are two types of carbohydrates -- simple and complex. Simple carbohydrates are sugars, such as the ones found in candy, fruits and baked goods. Complex carbohydrates are starches found in beans, nuts, vegetables and whole grains. Two-thirds of Americans are either obese or overweight"}, {"url": "http://health.gov/dietaryguidelines/dga2005/document/html/chapter7.htm", "passage_text": "OVERVIEW. Carbohydrates are part of a healthful diet. The AMDR for carbohydrates is 45 to 65 percent of total calories. Dietary fiber is composed of nondigestible carbohydrates and lignin intrinsic and intact in plants. "}, {"url": "http://livewell.jillianmichaels.com/recommended-carbohydrate-intake-percentage-5217.html", "passage_text": "Diabetes Considerations. Diabetes is a condition that affects your body’s ability to use carbohydrates as energy. Without proper management of your carbohydrate intake, you can experience adverse side effects such as nerve damage and mental confusion. Fiber is a form of carbohydrate in your daily diet that your body cannot digest, yet it is used to add bulk to your stool, which aids digestion. Fiber is found in fruits, vegetables, beans and legumes in varying proportions."}, {"url": "http://www.diabetes.org/food-and-fitness/food/what-can-i-eat/understanding-carbohydrates/", "passage_text": "Understanding Carbohydrates. How much and what type of carbohydrate foods are important for managing diabetes. The balance between how much insulin is in your body and the carbohydrate you eat makes a difference in your blood glucose levels. Learn more about how much and what foods to include in your meal plan. Featured book: The Complete Guide to Carb Counting, 3rd Edition."}, {"url": "http://healthyeating.sfgate.com/recommended-carbohydrate-intake-4062.html", "passage_text": "Grain-based foods are also rich sources of carbohydrates; foods containing whole grains are the best choices. The fiber in these and other high-fiber foods slows uptake of glucose after a carbohydrate-rich meal. Categories. Digestible carbohydrate includes simple and complex carbohydrates. Simple types may be single sugars, or monosaccharides, and double sugars, or disaccharides, while complex carbohydrates include starches, which are larger molecules."}, {"url": "http://chriskresser.com/the-3-step-process-to-determining-your-ideal-carbohydrate-intake/", "passage_text": "If you do have a condition that would affect your carbohydrate intake (diabetes, hypoglycemia, thyroid disease, adrenal fatigue, etc) and/or you exercise a lot, refer to the chart in Step 1 to know what carbohydrate level you should begin with. "}, {"url": "http://healthyeating.sfgate.com/recommended-carbohydrate-intake-4062.html", "passage_text": "Carbohydrate-rich foods are important parts of a healthy diet. Carbohydrate is a major nutrient that includes sugars, starches and fiber. Digestible carbohydrate is an energy source for all your cells, while indigestible fiber provides other benefits. Your digestive tract produces an enzyme called amylase that breaks down sugars and starches into glucose, which travels in your blood to reach your cells. Categories. Digestible carbohydrate includes simple and complex carbohydrates. Simple types may be single sugars, or monosaccharides, and double sugars, or disaccharides, while complex carbohydrates include starches, which are larger molecules."}]