[{"url": "http://www.bizjournals.com/orlando/news/2014/08/04/buying-a-house-florida-s-closing-costs-among.html", "passage_text": "The costs include an average of $1,982 for lender’s origination fees and $666 for the average third-party fees. Nationwide, closing costs rose 6 percent over the past year, averaging $2,539 on a $200,000 loan. In addition, origination fees increased 9 percent to $1,877 and third-party fees rose 1 percent to $662."}, {"url": "http://www.fha-world.com/florida-closing-costs.html", "passage_text": "Florida Closing Costs. Florida Closing Costs. FHA allows the seller to pay up to 6% of your closing cost. If you are buying a $100,000.00 house FHA allows the seller to pay up to $6,000.00 for your closing cost. It must be in writing in the sales contract, Seller will pay up to 6% of buyer's closing cost.."}, {"url": "http://www.smithandassociates.com/real-estate/Buy/Closing-Cost-Calculator", "passage_text": "Use the closing cost calculator for Florida below to estimate your closing costs for your mortgage or refinance loan. To determine approximate closing cost for Florida home buyers, enter the sales price and loan amount, and then select “calculate.” The figures below are just an estimate."}, {"url": "http://www.bankrate.com/finance/mortgages/closing-costs/florida.aspx", "passage_text": "Florida closing costs. Mortgage » Closing Costs » United States »Loan amount: $200,000Florida closing costsOverviewAverage origination fees charged by lenders$1,028Average third-party fees$778Average origination plus third-party fees$1,806Itemized fee averages Below are listed the averages for fees."}, {"url": "http://www.zillow.com/mortgage-learning/closing-costs/", "passage_text": "Typically, home buyers will pay between about 2 and 5 percent of the purchase price of their home in closing costs. So, if your home cost $150,000, you might pay between $3,000 and $7,500 in closing costs. On average, buyers pay roughly $3,700 in closing costs, according to a recent survey. Lenders are required by law to give you a good faith estimate (GFE) of what the closing costs on your home will be within three days of when you apply for a loan."}, {"url": "http://www.fha-world.com/florida-closing-costs.html", "passage_text": "To buy a home in Florida using an FHA loan you will need a minimum of 3.5% down payment plus closing cost. On a $100,000.00 purchase you will need $3,500.00 (down payment) plus $6,500.00 (closing cost)."}, {"url": "http://www.bizjournals.com/orlando/news/2014/08/04/buying-a-house-florida-s-closing-costs-among.html", "passage_text": "Mortgage closing costs in the Sunshine State are higher than 42 other states, according to a new report from Bankrate.com (NYSE: RATE). Closing costs on a $200,000 home loan average $2,648, the eighth-highest in the U.S. and 4.1 percent higher than the national average."}]