[{"url": "http://www.shoutmeloud.com/delete-google-plus-profile.html", "passage_text": "They have integrated Google plus comments on YouTube, launched Google plus comments for BlogSpot and if you are using GMail or any other Google service, and land on any page of Google+ site, it will ask you to create your Google plus account. "}, {"url": "https://support.google.com/plus/answer/1044503?hl=en", "passage_text": "Delete your Google+ profile. 1  On your computer or mobile device, go to http://plus.google.com/downgrade and sign in. 2  At the bottom of the page, check the box next to Required.. 3  Click or touch Remove selected services. "}, {"url": "http://www.wikihow.com/Mute-a-Post-from-Your-Google%2B-Stream", "passage_text": "2. You will immediately be taken to your stream. Find the post that you want to remove from your stream. This is called muting a post. Click on the arrow in the top right corner of the post, and then select Mute this post in the menu that expands. "}, {"url": "https://support.google.com/plus/answer/1355848?hl=en", "passage_text": "Edit your post. 1  Open the Google+ app. 2  Touch the menu icon/button Edit. 3  Open Google+. 4  Click the down arrow in the top right corner of the post Edit post. 5  Save in the lower left corner of the post. 6  Open Google+ 7  . Touch the post you want to edit. Delete your post. 1  Open the Google+ app. 2  Touch the menu icon/button Delete OK in the lower right corner of the box. 3  Open Google+. 4  Click the down arrow in the top right corner of the post Delete post. 5  Click Delete in the bottom right corner. 6  Open Google+ 7  . Touch the post you want to delete"}, {"url": "http://www.twelveskip.com/tutorials/google-plus/1204/howto-delete-a-post-in-google-plus", "passage_text": "Thankfully, aside from the option to quickly edit and update your posts, Google+ also allows you to quickly and easily delete a post. Whether it’s an old post or something that you shared just now, deleting a post is fun and intuitive. The steps below will make sure you won’t get lost. 1  Click the drop down arrow at the top right of your post and select Delete Post. 2  Here's a screenshot demo: 3  Click Delete to confirm."}, {"url": "http://dottech.org/156631/how-to-delete-google-plus-account-guide/", "passage_text": "Step One. Log-in to your Google Plus account (the account that you want to delete) . You can do this by clicking your profile link on Gmail or you can directly log-in thru your Google Search homepage. Just go to Google.com then click the “+yourname” link on the top menu (ex. +Jane). "}, {"url": "https://support.google.com/plus/answer/1355848?hl=en", "passage_text": "1 Click Delete in the bottom right corner. 2  Open Google+ 3  . Touch the post you want to delete. 4  In the top right corner, touch the action menu, then Delete DELETE. 5  Open the Google+ app. 6  Touch the gear icon in the top right corner Delete post. Delete your post. 1  Open the Google+ app. 2  Touch the menu icon/button Delete OK in the lower right corner of the box. 3  Open Google+. 4  Click the down arrow in the top right corner of the post Delete post. 5  Click Delete in the bottom right corner. 6  Open Google+ 7  . Touch the post you want to delete"}, {"url": "http://www.martinshervington.com/google-plus-posts-the-ultimate-guide/", "passage_text": "Posting to a Google Plus Community. As a member of a community you can post into that community either from your profile, from within the community itself, from the ‘Share’ button in the upper right, from a Google+ Page that is a member of the community etc. Sometimes you may want to restrict information being ‘shared’ onwards through Google Plus. To do this by clicking on the drop down in the upper corner of a post…. Also, as you can see from the drop down, you can edit, delete, link to the post and even disable comments as well."}, {"url": "http://www.techtin.com/google/how-to-edit-delete-a-post-on-google-plus/", "passage_text": "How to Edit / Delete a post on Google Plus. Posted in: Google, Web Tagged Under: Google Plus 10 Comments. On Google plus you can edit / delete a post very easily. This is very useful because most of us often do typo. Use the drop-down menu (small arrow icon in the top right corner of the post) to edit or delete it. "}]