[{"url": "https://www.whitehouse.gov/1600/presidents/dwightdeisenhower", "passage_text": "Bringing to the Presidency his prestige as commanding general of the victorious forces in Europe during World War II, Dwight D. Eisenhower obtained a truce in Korea and worked incessantly during his two terms to ease the tensions of the Cold War. Republican emissaries to his headquarters near Paris persuaded him to run for President in 1952. I like Ike was an irresistible slogan; Eisenhower won a sweeping victory. Negotiating from military strength, he tried to reduce the strai"}, {"url": "http://www.answers.com/Q/What_did_Dwight_Eisenhower_do_before_He_was_President", "passage_text": "Before his presidency, Eisenhower served as the Supreme Commander  of the Allied Forces during World War II. Eisenhower is most famous  for the D-Day Invasion in Normandy, w … hich he masterminded. This  invasion is one of the main reasons the war ended earlier then most  expected. Dwight Eisenhower was first elected in November of 1952 and  re-elected in November of 1956. He was president from Jan.  20, 1953 to Jan. 20, 1961. He served two full terms … for a  total of 8 years in office. He was followed by John F. Kennedy."}, {"url": "http://www.u-s-history.com/pages/h1789.html", "passage_text": "After the war, Eisenhower served as U.S. Army Chief of Staff. In 1948, he retired from the army, later becoming president of Columbia University, and then head of NATO in 1950. President of the United States. Eisenhower was a popular president throughout his two terms in office. With a campaign slogan that couldn't miss, I like Ike, Eisenhower and his vice president, Richard M. Nixon, posted landslide victories in both 1952 and 1956. Throughout and beyond his term as president, Eisenhower followed his mother's heart and concentrated on maintaining world peace. He watched in delight the development of his  atoms for peace  program loans of American uranium to have-not nations for peaceful purposes."}, {"url": "https://en.wikipedia.org/wiki/Dwight_D._Eisenhower", "passage_text": "He implemented desegregation of the armed forces in two years and made five appointments to the Supreme Court. He was the first term-limited president in accordance with the 22nd Amendment. Eisenhower's two terms saw considerable economic prosperity except for a sharp recession in 1958–59. Voted Gallup's most admired man twelve times, he achieved widespread popular esteem both in and out of office. "}, {"url": "http://www.answers.com/Q/What_did_Dwight_Eisenhower_do_before_He_was_President", "passage_text": "Eisenhower was elected President in November, 1952 and took office on January 20, 1953. He was re-elected in 1956 and served until January 20, 1961. Dwight Eisenhower was elec … ted President in 1952 and took office on  January 20, 1953. He was re-elected in 1956 and served until  January 20, 1961. Dwight Eisenhower was first elected in November of 1952 and  re-elected in November of 1956. He was president from Jan.  20, 1953 to Jan. 20, 1961. He served two full terms … for a  total of 8 years in office. He was followed by John F. Kennedy."}, {"url": "https://www.whitehouse.gov/1600/presidents/dwightdeisenhower", "passage_text": "Dwight D. Eisenhower. Bringing to the Presidency his prestige as commanding general of the victorious forces in Europe during World War II, Dwight D. Eisenhower obtained a truce in Korea and worked incessantly during his two terms (1953-1961) to ease the tensions of the Cold War. Republican emissaries to his headquarters near Paris persuaded him to run for President in 1952. I like Ike was an irresistible slogan; Eisenhower won a sweeping victory. Negotiating from military strength, he tried to reduce the strai"}, {"url": "http://www.historylearningsite.co.uk/world-war-two/military-commanders-of-world-war-two/dwight-eisenhower/", "passage_text": "Dwight Eisenhower was the Allies Supreme Commander in the lead up to D-Day and in the actual landings in Normandy. He commanded the Allied forces in the last great counter-attack by the Germans in World War Two – the Battle of the Bulge. Eisenhower was one of the most important generals of World War Two and one who went on to greater success as president of America from 1953 to 1961."}, {"url": "http://www.biography.com/people/dwight-d-eisenhower-9285482", "passage_text": "Dwight D. Eisenhower was born on October 14, 1890, in Denison, Texas. In 1945 he was appointed U.S. Army chief of staff. He became the first Supreme Allied Commander of the North Atlantic Treaty Organization (NATO) in 1951. In 1952 he was elected U.S. president. Dwight D. Eisenhower was born on October 14, 1890, in Denison, Texas, to David Jacob Eisenhower and Ida Elizabeth Stover Eisenhower. Dwight was the third of his parents’ seven sons. His parents had moved from Abilene, Kansas, to Denison, Texas, before he was born."}, {"url": "http://americanhistory.about.com/od/dwightdeisenhower/p/peisenhower.htm", "passage_text": "Events and Accomplishments of Dwight D. Eisenhower’s Presidency: Eisenhower traveled to Korea before he took office to help conclude the peace talks. by July 1953, an Armistice was signed that separated Korea into two with a demilitarized zone at the 38th parallel. "}, {"url": "http://www.answers.com/Q/What_did_Dwight_Eisenhower_do_before_He_was_President", "passage_text": "Ike was a West Point graduate and a career army officer. He served in both World Wars, but became world famous as the victorious supreme allied commander in Europe in WW 2. Both parties wanted to nominate him for President but he chose the Republicans. Dwight Eisenhower was first elected in November of 1952 and  re-elected in November of 1956. He was president from Jan.  20, 1953 to Jan. 20, 1961. He served two full terms … for a  total of 8 years in office. He was followed by John F. Kennedy."}]