[{"url": "http://www.news-medical.net/health/What-is-Chemotherapy.aspx", "passage_text": "Chemotherapy literally refers to the treatment of certain diseases using specific chemicals that are destructive to malignant cells or to the causative agent of a disease such as a bacteria or virus. Therefore, the treatment can be broadly divided into two categories-cancer chemotherapy and antimicrobial chemotherapy. "}, {"url": "http://www.microbiologytext.com/index.php?module=Book&func=displayarticle&art_id=31", "passage_text": "One of the diseases Ehrlich hoped to cure was syphilis, which had reached epidemic proportions in Europe. Little did he realize it would be a 17-year odyssey before he would develop salvarsan, the first effective chemotherapeutic agent. Salvarsan was the 606 th chemical he tried. The 5th edition of Through the Microscope is now finished and available as a website subscription, as an ebook and as a hard copy from lulu.com. For subscribers to the 4th edition who are still using it, the book will stay available until May 15th, 2014. At that point, it will be retired. Thank you for all your support."}, {"url": "http://www.encyclopedia.com/topic/Anti-infective_agents.aspx", "passage_text": "Chemotherapy. Chemotherapy is the treatment of a disease or condition with chemicals that have a specific effect on its cause, such as a microorganism or cancer cell. The first modern therapeutic chemical was derived from a synthetic dye. "}, {"url": "http://www.theguardians.com/Microbiology/gm_mbi03.htm", "passage_text": "The term virus (poison) was coined by Pasteur. Emil von Behring received the Nobel Prize in 1901 for his work with Shibasaburo Kitasato on the antitoxin serum for diptheria. Paul Ehrlich in 1912, announced the discovery of an effective cure for syphilis, the first chemotherapeutic agent for a bacterial disease. Alexander Fleming discovered penicillin in 1928 whilst working at St Mary's Hospital in London and published the first paper on it the following year. He received the Nobel Prize in 1945, with Howard Florey and Ernst Chain, for their work on Penicillium notatum."}, {"url": "https://en.wikipedia.org/wiki/Chemotherapy", "passage_text": "The first use of drugs to treat cancer was in the early 20th century, although it was not originally intended for that purpose. Mustard gas was used as a chemical warfare agent during World War I and was discovered to be a potent suppressor of hematopoiesis (blood production). Fatigue may be a consequence of the cancer or its treatment, and can last for months to years after treatment. One physiological cause of fatigue is anemia, which can be caused by chemotherapy, surgery, radiotherapy, primary and metastatic disease and/or nutritional depletion."}, {"url": "https://en.wikipedia.org/wiki/Antibacterial", "passage_text": "Antibiotics or antibacterials are a type of antimicrobial used in the treatment and prevention of bacterial infection. Antibiotics are not effective against viruses such as the common cold or influenza, and may be harmful when taken inappropriately. In 1929, Alexander Fleming identified penicillin, the first chemical compound with antibiotic properties."}, {"url": "https://en.wikipedia.org/wiki/Antibacterial", "passage_text": "The era of antibacterial chemotherapy began with the discovery of arsphenamine, first synthesized by Alfred Bertheim and Paul Ehrlich in 1907, used to treat syphilis. The first systemically active antibacterial drug, prontosil was discovered in 1933 by Gerhard Domagk, for which he was awarded the 1939 Nobel Prize. Antibiotics are not effective against viruses such as the common cold or influenza, and may be harmful when taken inappropriately. In 1929, Alexander Fleming identified penicillin, the first chemical compound with antibiotic properties."}, {"url": "https://en.wikipedia.org/wiki/Antibacterial", "passage_text": "Antibiotics revolutionized medicine in the 20th century, and have together with vaccination led to the near eradication of diseases such as tuberculosis in the developed world. Their effectiveness and easy access led to overuse, especially in live-stock raising, prompting bacteria to develop resistance. Antibiotics are not effective against viruses such as the common cold or influenza, and may be harmful when taken inappropriately. In 1929, Alexander Fleming identified penicillin, the first chemical compound with antibiotic properties."}, {"url": "https://en.wikipedia.org/wiki/Chemotherapy", "passage_text": "Chemotherapy may use one drug at a time (single-agent chemotherapy) or several drugs at once (combination chemotherapy or polychemotherapy). The combination of chemotherapy and radiotherapy is chemoradiotherapy. Fatigue may be a consequence of the cancer or its treatment, and can last for months to years after treatment. One physiological cause of fatigue is anemia, which can be caused by chemotherapy, surgery, radiotherapy, primary and metastatic disease and/or nutritional depletion."}, {"url": "https://en.wikipedia.org/wiki/Chemotherapy", "passage_text": "Chemotherapy (often abbreviated to chemo and sometimes CTX or CTx) is a category of cancer treatment that uses chemical substances, especially one or more anti-cancer drugs (chemotherapeutic agents) that are given as part of a standardized chemotherapy regimen. Fatigue may be a consequence of the cancer or its treatment, and can last for months to years after treatment. One physiological cause of fatigue is anemia, which can be caused by chemotherapy, surgery, radiotherapy, primary and metastatic disease and/or nutritional depletion."}]