[{"url": "http://www.healthcare-salaries.com/nursing/bsn-nurse-salary", "passage_text": "Conclusion about BSN nurse salary. As noted by payscale, the average pay per annum of BSN Nurse in the United States is from $50,733 to $77,034 with the median average of around $62,427. In the UK, BSN Nurses collect a yearly pay from £18,216 to £29,400 with the median income of £22,527 per annum. A BSN Nurse with less than 1-4 years of experience collects an average yearly pay of $60,496 while a BSN Nurse practicing for 5 to 9 years receives an average salary of $63,006 per year."}, {"url": "http://www.simplyhired.com/salaries-k-bsn-jobs.html", "passage_text": "The average salary for bsn jobs is $37,000. Average bsn salaries can vary greatly due to company, location, industry, experience and benefits. This salary was calculated using the average salary for all jobs with the term bsn anywhere in the job listing."}, {"url": "http://www.healthcare-salaries.com/allied-health-professionals/bsn-salary", "passage_text": "The average and median expected salary for a BSN in the UK is around £28,136 and £25,000 per year and a yearly bonus of about £ 688 is included as well. The starting hourly wage ranges from £11.06 per hour, while a yearly salary ranges from between £12,168 – £30,639. BSN salary in India. On an average, a BSN in India receives an average starting yearly salary of around INR 120,000, while a highest received annual salary is around INR 400,000 per year. In addition, a yearly bonus of about INR 1,500 will be credited to his or her account."}, {"url": "http://www.bsnedu.org/salaries/", "passage_text": "BSN Salary. Registered nurses holding BSN degrees can expect to earn higher salaries than those with associate’s degrees or diplomas. This is a key factor driving increased enrollment in pre-licensure BSN programs, and is cited as the number one reason why licensed RNs return to school for RN to BSN completion programs. The survey found that RNs in the South, for example, earned an average salary of $55,849 if they held a diploma, $57,414 if they held an associate’s degree and $60,969 if they held a BSN."}, {"url": "http://www.bsnedu.org/salaries/", "passage_text": "The 2013 ADVANCE Nurses Salary Survey shed light on the earning potential of BSN-prepared RNs in the U.S. by region. The survey found that RNs in the South, for example, earned an average salary of $55,849 if they held a diploma, $57,414 if they held an associate’s degree and $60,969 if they held a BSN."}, {"url": "http://learn.org/articles/What_is_the_Average_Salary_for_a_Nursing_Graduate_with_a_BSN.html", "passage_text": "A BSN may open up higher-paying advancement and specialization opportunities. According to PayScale.com, most entry-level RNs earned salaries ranging from $39,930-$69,985 in February 2014, with a median wage of $50,152. On the other hand, the median salary for an RN possessing a BSN degree was higher at $57,759. As with most jobs in health care, the salaries for RNs increase with additional experience. As ofFebruary 2014, RNs at the mid-career level earned between $44,622 and $80,975, according to PayScale.com. "}, {"url": "http://www.nursingprograms.com/what-is-the-salary-for-a-bsn", "passage_text": "BSN nurses can care for patients with complex health problems. The starting salary range for BSN nurses is an average of $36,000 – $45,000, but many factors can influence a BSN’s salary, including experience, geographic location, and specialty. Let’s start with experience. As with many fields, nursing offers many different degree options and salary ranges. The Bachelor of Nursing Degree (BSN) is considered an advanced degree in the nursing field (as opposed to the Licensed Practical Nurse or the Registered Nurse, neither of which requires a bachelor’s degree)."}, {"url": "http://www.healthcare-salaries.com/nursing/bsn-nurse-salary", "passage_text": "Average BSN nurse salary. In the United States, a BSN Nurse receives an average salary from between $52,397- $72,458 per annum. The average national hourly rate for BSN nurse is from $22.85 to $32.91. The median yearly rate for BSN Nurses is $620.427. A BSN Nurse with less than 1-4 years of experience collects an average yearly pay of $60,496 while a BSN Nurse practicing for 5 to 9 years receives an average salary of $63,006 per year."}, {"url": "http://www.healthcare-salaries.com/allied-health-professionals/bsn-salary", "passage_text": "BSN salary in USA. An average starting hourly wage for a BSN the United States is around $22.93 per hour which gradually increases by around $33.55 per hour overtime. An average annual salary for a BSN ranges from between $49,851 – $130,200 per annum and a yearly bonus of around $507 will be included. BSN salary in India. On an average, a BSN in India receives an average starting yearly salary of around INR 120,000, while a highest received annual salary is around INR 400,000 per year. In addition, a yearly bonus of about INR 1,500 will be credited to his or her account."}]