[{"url": "http://saudereggs.com/EggNutritionalValue.htm", "passage_text": "Energy value of eggs. A medium egg has an energy value of 78 kilocalories (324 kilojoules) and the consumption of one egg daily would contribute only around 3% of the average energy requirement of an adult man; 4% for an adult woman. Eggs are an excellent source of protein. Egg protein is of high biological value as it contains all the essential amino acids needed by the human body."}, {"url": "http://edis.ifas.ufl.edu/ps029", "passage_text": "The laying cycle of a chicken flock usually covers a span of about 12 months. Egg production begins when the birds reach about 18-22 weeks of age, depending on the breed and season. Flock production rises sharply and reaches a peak of about 90%, 6-8 weeks later. Production then gradually declines to about 65% after 12 months of lay. A typical production curve for a laying flock, showing changes in the level of egg production and in egg weight, over time, is given in Figure 1. "}, {"url": "http://healthyeating.sfgate.com/many-carbohydrates-scrambled-eggs-cheese-peppers-6990.html", "passage_text": "You’ll get 3.25 grams of total carbohydrates, with about 60 percent from the eggs and 30 percent from the green peppers. You should aim to get at least 130 grams of carbohydrates every day, and this dish supplies 3 percent of that amount. Sugar. Most foods contain some amount of natural sugar, including eggs, cheese and peppers. The total sugar in this dish is 2.3 grams, which is 9 calories and equal to about one-half teaspoon of granulated sugar."}, {"url": "http://healthyeating.sfgate.com/much-protein-boiled-egg-6261.html", "passage_text": "Eggs are a good source of protein and they contain all of the essential amino acids, so they provide complete protein. One hard-boiled egg has 6.29 grams of protein, which gives men 11 percent of their daily intake, while women get 14 percent. In a large egg, about 43 percent of the protein is found in the yolk. Even though that percentage will vary based on the size of the yolk, you can count on getting about half of the total amount of protein if you choose to eat only the egg white. One hard-boiled egg has 5.3 grams of total fat and 1.63 grams of saturated fat, which is 47.7 calories in total fat and 14.7 calories in saturated fat."}, {"url": "http://healthyeating.sfgate.com/much-protein-boiled-egg-6261.html", "passage_text": "The downside to getting protein from eggs is that they’re high in cholesterol. If you’re healthy, daily cholesterol should be limited to 300 milligrams or less. One large hard-boiled egg has 186 milligrams. One hard-boiled egg has 5.3 grams of total fat and 1.63 grams of saturated fat, which is 47.7 calories in total fat and 14.7 calories in saturated fat."}, {"url": "http://www.eggs.ca/nutrition/view/1/egg-nutrition", "passage_text": "With 6 grams of the highest quality protein and 14 key nutrients, eggs provide the energy needed to keep you going. They are a natural choice for a healthy, active lifestyle. Eggs are one of the few foods considered to be a complete protein, because they contain all 9 essential amino acids. In addition to giving you energy, your body uses the protein found in eggs to: 1  build and repair body tissue and cells. 2  grow strong hair and nails. 3  build and maintain healthy muscles. 4  help fight infections."}, {"url": "http://healthyeating.sfgate.com/many-carbohydrates-scrambled-eggs-cheese-peppers-6990.html", "passage_text": "Scrambled eggs, cheese and peppers are low in carbs. When you need energy, you need carbohydrates; if that’s your goal, scrambled eggs with cheese and peppers isn't the best choice. Although this dish is a good source of protein, calcium, iron and vitamin B12, it only has a small amount of carbohydrates. Sugar. Most foods contain some amount of natural sugar, including eggs, cheese and peppers. The total sugar in this dish is 2.3 grams, which is 9 calories and equal to about one-half teaspoon of granulated sugar."}, {"url": "http://healthyeating.sfgate.com/many-carbohydrates-scrambled-eggs-cheese-peppers-6990.html", "passage_text": "All of the sugar is in the form of simple sugars, such as glucose, lactose and fructose, that are easily digested and used for quick energy. The two scrambled eggs supply 74 percent and the green peppers contribute 21 percent of the total sugar. Sugar. Most foods contain some amount of natural sugar, including eggs, cheese and peppers. The total sugar in this dish is 2.3 grams, which is 9 calories and equal to about one-half teaspoon of granulated sugar."}]