[{"url": "http://www.proz.com/kudoz/english_to_spanish/medical%3A_health_care/3829816-tissue_creep.html", "passage_text": "Posture-Causes Tissue Creep Poor posture can lead to tissue creep. That is when the collagen fibres in the inner fabric of ligaments stretch and deform-similar to how plastic gives way under stress. Once this change has happened it difficult for the tissues to return to their normal length. Tissue creep may occur after long or repeated loading-it can start after as little as 15 minutes of slouching."}, {"url": "http://www.mecaback.com/creep/", "passage_text": "Creep. “Connective tissues demonstrate properties of extensibility. The dense regular connective tissues are viscoelastic displaying both viscous and elastic rheologic properties with both time and frequency dependent properties.”. Wainwright SA, Biggs WD, Curry JD, Gosline JM. Mechanical design in organisms. “It was concluded that sustained static or cyclic loading of lumbar viscoelastic tissues may cause micro-damage in the collagen structure, which in turn reflexively elicit spasms in the multifidus as well as hyperexcitability early in the recovery when the majority of the creep recovers."}, {"url": "http://www.mecaback.com/creep/", "passage_text": "Creep vs. Stretch: A review of viscoelastic properties of skin. Ann Plast Surg. 1998; 41:215-219. “A property common to extensible soft tissues is that they become stiffer as they are extended due to the reorientation of collagen fibers. “It was concluded that sustained static or cyclic loading of lumbar viscoelastic tissues may cause micro-damage in the collagen structure, which in turn reflexively elicit spasms in the multifidus as well as hyperexcitability early in the recovery when the majority of the creep recovers."}, {"url": "https://en.wikipedia.org/wiki/Soft_tissue", "passage_text": "In anatomy, soft tissues are the tissues that connect, support, or surround other structures and organs of the body, not being bone. When taut, these fibers produce a strong growth in tissue stiffness. The composite behavior is analogous to a nylon stocking, whose rubber band does the role of elastin as the nylon does the role of collagen. In soft tissues the collagen limits the deformation and protects the tissues from injury."}, {"url": "http://www.chiropractic-biophysics.com/clinical_chiropractic/2011/9/12/ligament-hysteresis-creep-recovery-and-plastic-deformation.html", "passage_text": "Visco-elastic Properties of Ligaments. The general response of ligaments to a traction load or a repetitive structural/postural corrective exercise is influenced by several phenomena which are time-dependent, such as hysteresis, creep, recovery and plastic deformation. 1  Hysteresis. "}, {"url": "http://medical-dictionary.thefreedictionary.com/CREEP", "passage_text": "A useful technique in a primate colony. creep feeding. feed is placed on one side of the barrier and only the young can get access to it. creep grazing. a creep is placed across the entrance to the pasture and only animals small enough to penetrate the creep get access to the pasture. creep ration. a weaning diet, suitable for weaning the young, which are the only animals able to penetrate the creep. 1  Facebook."}, {"url": "http://medical-dictionary.thefreedictionary.com/CREEP", "passage_text": "creep. 1. a physical property of materials that results in progressive deformation when a constant load is applied over time; it allows soft tissues to tolerate applied loads by lengthening. 2. to move along the ground using the arms and legs for propulsion. The trunk does not touch the ground. a creep is placed across the entrance to the pasture and only animals small enough to penetrate the creep get access to the pasture. creep ration. a weaning diet, suitable for weaning the young, which are the only animals able to penetrate the creep. 1  Facebook."}, {"url": "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC3100361/", "passage_text": "Mechanism of creep behavior of bone under a small physiological load level has not been fully understood. It was indicated that trabecular bone damage may start at the load level corresponding to as small as 2000 με (Morgan et al., 2001; Morgan et al., 2005). (2006) measured creep and residual strains of human L3 vertebral cancellous bone developed under prolonged static loading corresponding to 750 με (169 με for creep and 515±255 με for residual strain) and 1500 με (1198 με for creep and 1565±590 με for residual strain) static strains for a 125,000 sec load-unload period."}, {"url": "https://en.wikipedia.org/wiki/Soft_tissue", "passage_text": "Soft tissue includes tendons, ligaments, fascia, skin, fibrous tissues, fat, and synovial membranes (which are connective tissue), and muscles, nerves and blood vessels (which are not connective tissue). When taut, these fibers produce a strong growth in tissue stiffness. The composite behavior is analogous to a nylon stocking, whose rubber band does the role of elastin as the nylon does the role of collagen. In soft tissues the collagen limits the deformation and protects the tissues from injury."}]