[{"url": "http://netwellness.org/question.cfm/66696.htm", "passage_text": "This is very common in the midwest. If these calcified lesions are present in spleen in addition to lung, it is most likely not cancer. However, if you had non-calcified lesions in the lung then one would entertain the idea of possible cancer or infection or other immunologic conditions. Depending on the size of the non-calcified lesions we may either decide to obtain a biopsy or follow with periodic CT scans. Not sure if you have any clinical symptoms or what prompted you to get the CT. In your case calcified granuloma in spleen and right lower lobe is probably benign. Your physician most likely weighed in all the risk factors (smoking status, age, type of lesion (calcified vs non-calcified)) before recommending the management plan"}, {"url": "http://www.mayoclinic.org/granuloma/expert-answers/FAQ-20057838", "passage_text": "Although granulomas due to histoplasmosis are noncancerous (benign), they may resemble cancer on an X-ray, especially if they haven't calcified. Granulomas eventually become calcified and have the same density as bone, making them more clearly visible on an X-ray. Granulomas are often found incidentally on a chest X-ray done for some other reason. The most common cause of lung granulomas in the United States is past histoplasmosis, a fungal infection that primarily affects the lungs."}, {"url": "https://en.wikipedia.org/wiki/Granuloma", "passage_text": "Sarcoidosis is a disease of unknown cause characterized by non-necrotizing (non-caseating) granulomas in multiple organs and body sites, most commonly the lungs and lymph nodes within the chest cavity. Other common sites of involvement include the liver, spleen, skin and eyes. In medical practice, doctors occasionally use the term granuloma loosely to mean a small nodule. Since a small nodule can represent anything from a harmless nevus to a malignant tumor, this usage of the term is not very specific."}, {"url": "https://en.wikipedia.org/wiki/Granuloma", "passage_text": "Granuloma (plural granulomas or granulomata) is an inflammation found in many diseases. It is a collection of immune cells known as histiocytes. In medical practice, doctors occasionally use the term granuloma loosely to mean a small nodule. Since a small nodule can represent anything from a harmless nevus to a malignant tumor, this usage of the term is not very specific."}, {"url": "http://www.mayoclinic.org/granuloma/expert-answers/FAQ-20057838", "passage_text": "A granuloma is a small area of inflammation in tissue. Granulomas are most often the result of an infection and most frequently occur in the lungs, but can occur in other parts of the body as well. Granulomas are often found incidentally on a chest X-ray done for some other reason. The most common cause of lung granulomas in the United States is past histoplasmosis, a fungal infection that primarily affects the lungs."}, {"url": "http://www.justanswer.com/health/0y3gf-diagnosis-calcified.html", "passage_text": "Expert: JE Sramek MD replied 7 years ago. The most common cause calcified granulomas of liver, lung, mediastinal lymph nodes and spleen is histoplasmosis. This is a fungus endemic to river valley regions (which is why I asked where you lived) and causes infections which are often mild and pass without evaluation. The presence of granulomas in the spleen is actually helpful because very, very few cancers which can be mistaken for granulomas metastasize to the spleen (Hodgkin's being the most common, and not typically calcified). Go see your grandbabies and worry about this later."}, {"url": "http://www.netwellness.org/question.cfm/81613.htm", "passage_text": "When the granuloma stays around, the body slowly deposits calcium into the granuloma as the scar matures. Because calcium is easy to see on an x-ray, we often (up to 25% of patients in Ohio) will see some calcified granulomas in the lung and also in other organs, especially the spleen. Often these granulomas appear as small nodules to the radiologist. They are benign and usually asymptomatic. The short answer is that I would not worry about calcified granulomas and this is why. A granuloma is a form of inflammation in the body where immune cells encircle and form a ball around some type of infectious organism and hopefully clears away the infection."}, {"url": "https://en.wikipedia.org/wiki/Granuloma", "passage_text": "Pulmonary hyalinizing granuloma is a lesion characterized by keloid-like fibrosis in the lung, and is not granulomatous. Similarly, radiologists often use the term granuloma when they see a calcified nodule on X-ray or CT scan of the chest. In medical practice, doctors occasionally use the term granuloma loosely to mean a small nodule. Since a small nodule can represent anything from a harmless nevus to a malignant tumor, this usage of the term is not very specific."}]