[{"url": "http://www.merriam-webster.com/dictionary/ukulele", "passage_text": "Full Definition of UKULELE. : a small guitar of Portuguese origin popularized in Hawaii in the 1880s and strung typically with four strings. See ukulele defined for English-language learners. See ukulele defined for kids. In 1879 Portuguese immigrants to Hawaii brought with them a small four-stringed guitar called a machete. Purvis was taken with the instrument and soon learned to play it. When the machete became a Hawaiian favorite, it took on Purvis's nickname, ʽukulele, and its Portuguese name was soon forgotten."}, {"url": "https://en.wikipedia.org/wiki/Ukulele", "passage_text": "The ukulele (/juːkəˈleɪliː/ ew-kə-LAY-lee, from Hawaiian: ʻukulele [ˈʔukuˈlɛlɛ] ; British English: ukelele) sometimes abbreviated to uke, is a member of the lute family of instruments; it generally employs four nylon or gut strings or four courses of strings. Common types of ukuleles include concert, soprano (standard ukulele), tenor, baritone. Less common are the sopranino (also called piccolo, bambino, or pocket uke) and bass ukulele. The soprano, often called standard in Hawaii, is the second-smallest and was the original size."}, {"url": "http://www.merriam-webster.com/dictionary/ukulele", "passage_text": "Word History of UKULELE. In the Hawaiian language ʽukulele means literally “ jumping flea, ” a creature with little resemblance to a small guitar. It is likely that this peculiar name became attached to the instrument in a roundabout way. In 1879 Portuguese immigrants to Hawaii brought with them a small four-stringed guitar called a machete. Purvis was taken with the instrument and soon learned to play it. When the machete became a Hawaiian favorite, it took on Purvis's nickname, ʽukulele, and its Portuguese name was soon forgotten."}, {"url": "http://www.merriam-webster.com/dictionary/banjo", "passage_text": "Full Definition of BANJO. : a musical instrument with a drumlike body, a fretted neck, and usually four or five strings which may be plucked or strummed. — ban·jo·ist \\-ˌjō-ist\\ noun. See banjo defined for English-language learners. See banjo defined for kids. ADVERTISEMENT. "}, {"url": "http://www.encyclopedia.com/topic/ukulele.aspx", "passage_text": "The ukulele is a string instrument that originated in Portugal in the second century B.C. With a small, guitar-shaped body that is fitted with four strings, it is considered a member of the chordophone family. Sound is produced through these instruments by plucking and strumming the strings. Design. The ukulele is a portable instrument with a small guitar-like body. It consists of a short neck, a main body, four strings and tuning keys, a bridge, a fretboard, and a sound hole. There are a variety of different types of ukuleles including the soprano, concert, tenor, and baritone"}, {"url": "http://www.merriam-webster.com/dictionary/ukulele", "passage_text": "Definition of UKULELE for Kids. : a musical instrument like a small guitar with four strings. In 1879 Portuguese immigrants to Hawaii brought with them a small four-stringed guitar called a machete. Purvis was taken with the instrument and soon learned to play it. When the machete became a Hawaiian favorite, it took on Purvis's nickname, ʽukulele, and its Portuguese name was soon forgotten."}, {"url": "https://en.wikipedia.org/wiki/Ukulele", "passage_text": "The ukulele originated in the 19th century as a Hawaiian adaptation of the Portuguese machete, a small guitar-like instrument, which was introduced to Hawaii by Portuguese immigrants, many from the Macaronesian Islands. Common types of ukuleles include concert, soprano (standard ukulele), tenor, baritone. Less common are the sopranino (also called piccolo, bambino, or pocket uke) and bass ukulele. The soprano, often called standard in Hawaii, is the second-smallest and was the original size."}, {"url": "https://en.wikipedia.org/wiki/Reentrant_tuning", "passage_text": "Soprano ukulele, an instrument which is almost always tuned in re-entrant fashion. A re-entrant tuning is a tuning of a stringed instrument where the strings (or more properly the courses on coursed instruments) are not ordered from the lowest pitch to the highest pitch (or vice versa). Most common re-entrant tunings have only one re-entry. In the case of the soprano ukulele, for example, the re-entry is between the third and fourth strings, while in the case of the Venezuelan cuatro it is between the first and second strings. Instruments often tuned in this way include: 1  Soprano and concert ukulele."}]