[{"url": "http://www.ehow.com/about_5089633_normal-levels-ldl-hdl.html", "passage_text": "The American Heart Association categorizes your risk for heart disease based on the following LDL levels. Less than 100 mg/dL is considered optimal and up to 129 mg/dL is near optimal. Borderline high LDL ranges from 130 to 159 mg/dL and 160 to 189 mg/dL is considered high. Above that level is categorized as very high. High density lipoproteins (HDL) are categorized as the good type of cholesterol."}, {"url": "http://www.ehow.com/about_5089633_normal-levels-ldl-hdl.html", "passage_text": "HDL levels below 40 mg/dl for men and 50 mg/dl for women are thought to put you at a greater than average risk for heart disease. Individuals who regularly exercise can achieve HDL values over 60, lowering their relative risk for coronary artery disease."}, {"url": "http://www.ehow.com/about_5089633_normal-levels-ldl-hdl.html", "passage_text": "Typical triglyceride levels are associated with the following risk for heart disease. Less than 150 mg/dL is considered normal, while 200 to 499 mg/dL is considered high. In between the ranges is considered borderline."}, {"url": "http://www.heart.org/HEARTORG/Conditions/Cholesterol/AboutCholesterol/What-Your-Cholesterol-Levels-Mean_UCM_305562_Article.jsp", "passage_text": "LDL (bad) cholesterol A low LDL cholesterol level is considered good for your heart health. However, your LDL number should no longer be the main factor in guiding treatment to prevent heart attack and stroke, according to new guidelines from the American Heart Association."}, {"url": "http://www.webmd.com/cholesterol-management/guide/understanding-numbers", "passage_text": "Your total cholesterol level is in the Desirable range, but your level of bad LDL cholesterol is High. This may mean that your level of high-density lipoprotein (HDL), or good cholesterol, is too low. It is best to have a high level of good HDL and a low level of bad LDL."}, {"url": "https://www.nlm.nih.gov/medlineplus/ency/patientinstructions/000386.htm", "passage_text": "Too much LDL is linked to heart disease and stroke. Your LDL is most often considered to be too high if it is 190 mg/dL or higher. Levels between 70 and 189 mg/dL are most often considered too high if: 1  You have diabetes and are between ages 40 and 75. 2  You have diabetes and a high risk of heart disease."}, {"url": "http://www.cholesterolmenu.com/cholesterol-levels-chart/", "passage_text": "In the United States, cholesterol levels are calculated in milligrams of cholesterol for each deciliter of blood. A result of under 200 mg per dL (5.2 mmol/L) is ideal. A level somewhere between 200 to 239 mg per dL (5.2 and 6.2 mmol/L) is within the edge line of high-risk class."}]