[{"url": "http://hyperphysics.phy-astr.gsu.edu/hbase/Organic/sugar.html", "passage_text": "Glucose. Glucose is a carbohydrate, and is the most important simple sugar in human metabolism. Glucose is called a simple sugar or a monosaccharide because it is one of the smallest units which has the characteristics of this class of carbohydrates. Glucose is also sometimes called dextrose. Corn syrup is primarily glucose. Glucose is one of the primary molecules which serve as energy sources for plants and animals. It is found in the sap of plants, and is found in the human bloodstream where it is referred to as blood sugar."}, {"url": "http://gameofhealth.com/articles/importance-fasting-blood-glucose-test", "passage_text": "The fasting blood glucose test is very important when it comes to determining certain medical conditions and people at risk for diabetes are particularly included in this category."}, {"url": "http://www.endocrineweb.com/conditions/type-1-diabetes/what-insulin", "passage_text": "Insulin is a hormone made by the pancreas that allows your body to use sugar (glucose) from carbohydrates in the food that you eat for energy or to store glucose for future use. Insulin helps keeps your blood sugar level from getting too high (hyperglycemia) or too low (hypoglycemia)."}, {"url": "http://www.answers.com/Q/Why_is_glucose_important_for_the_human_body", "passage_text": "Glucose is important to the body cecause it helps the reporduction of cells, coposition of proteins and nucleic acids foundin all cells. It helps growth and repairs tissues."}, {"url": "http://hyperphysics.phy-astr.gsu.edu/hbase/Organic/sugar.html", "passage_text": "Glucose is a carbohydrate, and is the most important simple sugar in human metabolism. Glucose is called a simple sugar or a monosaccharide because it is one of the smallest units which has the characteristics of this class of carbohydrates. Glucose is also sometimes called dextrose. Corn syrup is primarily glucose. Glucose is one of the primary molecules which serve as energy sources for plants and animals. It is found in the sap of plants, and is found in the human bloodstream where it is referred to as blood sugar."}]