[{"url": "http://www.answers.com/Q/How_does_rhyme_effect_a_poem", "passage_text": "Using rhyme in poetry gives a poem a repetitive quality by sound without repeating a line or phrase in a poem. The use of rhyme allows poetry to gain a songlike quality. Rhyme is often used in children's poetry to make the poems easier to remember. In poetry this memory concept is very important as it allows the reader to have a connection to a poem via their memory rather than just by reading the words on the page alone."}, {"url": "https://answers.yahoo.com/question/index?qid=20080717213617AAH8cFl", "passage_text": "If the poet's main objective is to make the poem rhyme it will come out horribly. They'll end up choosing words that make no sense with the context just for the rhyme. However, I rather do like poems that rhyme. When done correctly of course, which is rather difficult."}, {"url": "http://www.answers.com/Q/What_does_a_rhyme_mean_in_poetry", "passage_text": "A rhyme is repetition of words that sound similar. You can group rhyming words such as: cook, book, look, etc. In a poetry, It would be a sentence followed by another with two words that rhyme, occurring at the end of the sentences."}, {"url": "http://www.answers.com/Q/How_does_rhyme_effect_a_poem", "passage_text": "Confidence votes 190. Using rhyme in poetry gives a poem a repetitive quality by sound without repeating a line or phrase in a poem. The use of rhyme allows poetry to gain a songlike quality. Rhyme is often used in children's poetry to make the poems easier to remember. In poetry this memory concept is very important as it allows the reader to have a connection to a poem via their memory rather than just by reading the words on the page alone."}, {"url": "http://study.com/academy/lesson/what-is-a-rhyme-scheme-definition-examples-quiz.html", "passage_text": "Rhyme scheme is a poet's deliberate pattern of lines that rhyme with other lines in a poem or a stanza. The rhyme scheme, or pattern, can be identified by giving end words that rhyme with each other the same letter."}, {"url": "http://study.com/academy/lesson/what-is-a-rhyme-scheme-definition-examples-quiz.html", "passage_text": "Definition. Rhyme scheme is a poet's deliberate pattern of lines that rhyme with other lines in a poem or a stanza. The rhyme scheme, or pattern, can be identified by giving end words that rhyme with each other the same letter. For instance, take the poem 'Twinkle, Twinkle, Little Star', written by Jane Taylor in 1806."}, {"url": "http://www.qwhatis.com/what-is-rhyme-in-poetry/", "passage_text": "Rhyme is basically a repetition of two or more words that sound alike. It is a widely used convention in many songs and different types of poetry like poems and sonnets among others. In a poem for example, the use of rhyme functions to unify the message of the said poem."}]