[{"url": "https://answers.yahoo.com/question/index?qid=20070909204613AAyfVfR", "passage_text": "Why can&#39;t we just buy &quot;Near sighted&quot; glasses at the local drug store like we can buy &quot;Far sighted&quot; reading glasses for $10 and that&#39;s it? It makes no sence. If I just have normal bad eye sight, then why can't I just go to the local store to buy some near-sighted glasses Near-Sighted glasses are reading glasses also, but just to read further away."}, {"url": "https://answers.yahoo.com/question/index?qid=20110902144442AAL9sD3", "passage_text": "I know you can buy reading glasses for farsightedness for cheap, but I don't know if I'm going on a hopeless search to find ones for nearsightedness, my current glasses are starting to give me headaches cause the prescription is a few years old and I really can't afford to be spending a few hundred... · just now. Report Abuse. hi, Thx for the question The glasses that you buy in the super store are reading glasses, they arw not proper glasses, they are only magnify glasses, it is not advised that you use them ful time when reading. Your best option id to have an eye test and get the proper prescription your require."}, {"url": "http://www.myspectrumoptometry.com/eyes_MyopHypPres.php", "passage_text": "The term nearsighted means that you can see objects that are near to you more clearly than distant objects. The more myopic you are, the more blurred distant objects appear, the higher your prescription in diopters,and the thicker your glasses. Hyperopia. Hyperopia is the medical term for farsightedness.. Hyperopia occurs when your eye is too short in relation to the curvature of your cornea."}, {"url": "http://www.webmd.com/eye-health/tc/nearsightedness-myopia-topic-overview?page=2", "passage_text": "A routine eye exam can show whether you are nearsighted. The eye exam includes questions about your eyesight and a physical exam of your eyes. Ophthalmoscopy, slit lamp exams, and other tests that check vision and eye health are also part of a routine eye exam. But nearsightedness is not a disease, and a nearsighted eye is otherwise normal and healthy. Weigh your desire to have clear vision without glasses or contacts against the risks and cost of surgery. And be aware that you may still need to wear glasses or contact lenses after surgery."}, {"url": "http://www.flei.com/blog/difference-between-near-and-farsighted/", "passage_text": "Nearsighted means that with your natural uncorrected vision, you can see closer or “nearer” and further out gets blurry. Nearsightedness or myopia is a refractive defect of the eye lens in which the image is formed in front of the retina not on it. "}, {"url": "http://www.firmoo.com/farsighted-glasses.html", "passage_text": "Our exquisite farsighted eyeglasses come cheap in price but never in quality. We have more types of farsighted glasses more than you imagine. If you want to buy farsighted glasses with the latest trend, retro ones are what you can lay your hands on. Since retro trend has made quite a stir in the fashion world. Undoubtedly, retro eyeglasses have become one of the trendiest glasses. Choose from our GREAT collection of farsighted glasses designed for those with farsightedness which causes difficulty in seeing objects close up. There are many options available, like varying trendy styles, quality materials, and colors."}, {"url": "https://malaysia.answers.yahoo.com/question/index?qid=20071103161936AAYG6UX", "passage_text": "So, hyperopes can find some drug-store glasses that may work well for them. On the other hand, most vision disorders aren't quite that easy. Nearsightedness and farsightedness are often accompanied by astigmatism. And, the prescription is different in each eye. How come you cant buy near-sighted (-) glasses at the store? I've been to so many stores looking for near-sighted glasses, but all i've found are far-sighted (reading) ones."}, {"url": "http://boards.straightdope.com/sdmb/archive/index.php/t-14643.html", "passage_text": "When elderly people become farsighted, the eye muscles get weak and the range of focus decreases. When young, one can focus from, say, 6 inches to infinity. When you get older, this may become 4 feet to 100 feet. So you buy reading glasses and move the range to, say, 1 foot to 10 feet. The prescription is not very critical here, because 1/2 feet to 5 feet range works just as well for reading. Nearsighted people are usually that way because the range of focus moves closer, but not narrower."}, {"url": "http://www.rebuildyourvision.com/blog/vision-conditions/the-difference-between-farsightedness-and-nearsightedness/", "passage_text": "While farsightedness makes it difficult to see objects that are close-up, nearsightedness makes it difficult to see objects from a distance. Farsightedness is caused by an imperfection in the eye and is usually genetic. Nearsightedness can be caused by any number of factors and has many different degrees of severity. Nearsightedness does not mean that you’re able to see things that are near really well. Nearsightedness, or myopia (or shortsightedness), actually means that seeing things at a distance is difficult for you."}]