[{"url": "http://www.infoplease.com/askeds/zodiac-signs-presidents.html", "passage_text": "Four presidents were born under each of these signs: Taurus, Cancer, Libra, Capricorn, and Pisces. At least one president has been born under every sign, but the country went without a Gemini president for more than 180 years before John F. Kennedy was elected in 1960."}, {"url": "http://www.answers.com/Q/What_star_sign_do_most_american_presidents_have", "passage_text": "Second place is also a tie. Four presidents were born under each of these signs: Taurus, Cancer, Libra, Capricorn, and Pisces. At least one president has been born under every sign, but the country went without a Gemini president for more than 180 years before John F. Kennedy was elected in 1960."}, {"url": "http://www.answers.com/Q/Who_was_the_first_President_born_an_American_citizen", "passage_text": "Thus Van Buren, when he was born, was considered an American citizen by the Americans and a British citizen by the British. John Tyler,10th president, born 1790, was the first president born after the Treaty of Paris."}, {"url": "http://www.imdb.com/search/name?gender=female&sort=starmeter,asc&star_sign=gemini", "passage_text": "Natalie Portman Actress, V for Vendetta Natalie Portman was born Natalie Hershlag on June 9, 1981, in Jerusalem, Israel, to a Jewish family. She is the only child of Avner Hershlag, an Israeli-born doctor, and Shelley Stevens, an American-born artist (from Cincinnati, Ohio), who also acts as Natalie's agent."}, {"url": "http://www.neptunecafe.com/USPresidents.html", "passage_text": "For the mutables (Gemini, Virgo, Sagittarius, and Pisces), only 17 presidents have their Sun or Mars in these signs, in spite of the fact that any 4th of July horoscope has both Mars and Uranus in Gemini, placements that would seem to naturally attract presidential planets."}, {"url": "http://www.sacred-texts.com/astro/hba/hba09.htm", "passage_text": "All persons born from May 20 to June 20, inclusive, were born under the sign of Gemini. This is the head sign of the Air Triplicity. Gemini people have a vivacious, restless and anxious nature. This is the sign of the Twins, and all born in it have two distinct and pronounced natures—one very low and one very high."}, {"url": "http://www.answers.com/Q/Who_was_the_first_President_born_an_American_citizen", "passage_text": "Independence was declared on July 4, 1776. Martin Van Buren, the 8th president, was born in 1782, was the first born after 1776. However, Britain did not acknowledge American independence until they lost the Revolutionary War and signed the Treaty of Paris in 1783."}, {"url": "http://www.neptunecafe.com/USPresidents.html", "passage_text": "And when comparing these specific degrees to the elected presidents' horoscopes, an astonishing number of precise hits to these angular points crop up. John Adams, Warren G. Harding, James Polk, and Theodore Roosevelt all have their Scorpio Suns within three degrees of the U.S. Scorpio Ascendant."}]