[{"url": "http://pottermore.wikia.com/wiki/Dudley_Dursley", "passage_text": "Dudley Dursley is Harry Potter’s only cousin, son of Petunia and Vernon Dursley. He’s about four times Harry’s size, and with his small, watery eyes and very little neck, he resembles his father, Vernon. When Harry is allowed to join the Dursley family on a trip to the zoo for Dudley’s birthday, Dudley throws a tantrum; when Harry is given Dudley’s second bedroom, Dudley screams, hits his parents, and forces himself to be sick in protest."}, {"url": "http://www.maplandia.com/united-kingdom/england/south-west/gloucestershire-county/dursley/", "passage_text": "Welcome to the Dursley google satellite map! This place is situated in Gloucestershire County, South West, England, United Kingdom, its geographical coordinates are 51° 40' 53 North, 2° 21' 12 West and its original name (with diacritics) is Dursley."}, {"url": "http://harrypotter.wikia.com/wiki/Dursley_family", "passage_text": "Etymology. Dursley is a town in Gloucestershire, England. J. K. Rowling has never visited Dursley, but she grew up not too far away from the town and used the name as she found it interesting. Petunia 's name is the meaning of flower and the origin of the name is English. —Description of the Dursleys. The Dursley family is a Muggle family, and the only known living close relatives of Harry Potter. Petunia Dursley (nee Née) evans was the older sister Of'harry s, Mother Lily (potter Nee), née evans but took The surname dursley when She Married. Vernon dursley they had a Son. named dudley"}, {"url": "http://www.dursleyglos.org.uk/", "passage_text": "Welcome to the Dursley Glos Web, created as a local history guide to the town of Dursley in Gloucestershire, England in which I now live. It also contains information about the surrounding area and its close neighbours, Cam and Uley. There is also much information about the town's streets, its public buildings, churches, schools and pubs as well as photographs of the town's changing face during the large scale demolition in the 1950s and 1960s."}, {"url": "http://pottermore.wikia.com/wiki/Dudley_Dursley", "passage_text": "Dudley Dursley is Harry Potter's cousin and Vernon and Petunia Dursley's son. He is around the same age as Harry. When Harry is allowed to join the Dursley family on a trip to the zoo for Dudley’s birthday, Dudley throws a tantrum; when Harry is given Dudley’s second bedroom, Dudley screams, hits his parents, and forces himself to be sick in protest."}, {"url": "http://harrypotter.wikia.com/wiki/4_Privet_Drive", "passage_text": "And they've got this son —. — Minerva McGonagall. 4 Privet Drive is the street address of the home owned by Vernon and Petunia Dursley. They lived in this home with their son, Dudley as well as their nephew, Harry Potter, son of Lily Potter, Petunia's late sister and Lily's husband James Potter"}, {"url": "http://www.dursleyglos.org.uk/html/dursley/dursley_location.htm", "passage_text": "The market town of Dursley is located in the county of Gloucestershire in the southwest of England, approximately 12 miles south of Gloucester, 25 miles north of Bristol and 100 miles west of London. "}, {"url": "http://harrypotter.wikia.com/wiki/Dursley_family", "passage_text": "—Description of the Dursleys. The Dursley family is a Muggle family, and the only known living close relatives of Harry Potter. Petunia Dursley (nee Née) evans was the older sister Of'harry s, Mother Lily (potter Nee), née evans but took The surname dursley when She Married. vernon dursley —Description of the Dursleys. The Dursley family is a Muggle family, and the only known living close relatives of Harry Potter. Petunia Dursley (nee Née) evans was the older sister Of'harry s, Mother Lily (potter Nee), née evans but took The surname dursley when She Married. Vernon dursley they had a Son. named dudley"}]