[{"url": "http://www.wikihow.com/Become-a-Physician-Assistant", "passage_text": "1 Some programs require a bachelor’s degree (usually in the sciences). 2  Generally, physician assistant programs want to see that you’ve taken courses in the sciences in such areas as chemistry, anatomy, microbiology, physiology, and biology. Most work full-time, and they can work long hours. 1  The average physician assistant is paid over $90,000. 2  These programs are competitive; however, the government has reported that employment of physician assistants should grow 38 percent from 2012 through 2022."}, {"url": "http://www.mass.gov/eohhs/gov/departments/dph/programs/hcq/dhpl/physician-assistants/licensing/licensure-information.html", "passage_text": "You must have a Bachelor's Degree, have graduated from a Physician Assistant program approved by the Accreditation Review Commission on Education for the Physician Assistant, Inc (ARC-PA) and have taken and passed the National Commission for Certification of Physician Assistants (NCCPA) examination. 2. "}, {"url": "http://www.answers.com/Q/How_long_would_it_take_to_get_a_masters_degree_in_physician_assistant", "passage_text": "Physician assistant programs usually last at least 2 years. Admission requirements vary by program, but many require at least 2 years of college and some health care experience. All States require that PAs complete an accredited, formal education program and pass a National exam to obtain a license. Education and training. Physician assistant education programs usually last at least 2 years and are full time. Most programs are in schools of allied health, academic health centers, medical schools, or 4-year colleges; a few are in community colleges, the military, or hospitals."}, {"url": "http://www.answers.com/Q/How_long_would_it_take_to_get_a_masters_degree_in_physician_assistant", "passage_text": "Typically you get a Vocational Certificate in Dental Assisting, not an actual degree. Depending on the institution offering the course it can take anywhere from 6 months … to 12 months. Usually a local community college will offer the program as well as other places. Education and training. Physician assistant education programs usually last at least 2 years and are full time. Most programs are in schools of allied health, academic health centers, medical schools, or 4-year colleges; a few are in community colleges, the military, or hospitals."}, {"url": "http://www.midlevelu.com/blog/how-long-does-it-take-become-physician-assistant", "passage_text": "Second, many PA programs require that students have hands-on patient experience before applying. Amount of experience varies from 500 to 2,000 hours. Factor the time it will take you to complete this extensive experience into how long it will take you to become a physician assistant."}, {"url": "http://www.midlevelu.com/blog/how-long-does-it-take-become-physician-assistant", "passage_text": "I am currently a college student or I already have a bachelor's degree... If you currently have, or are working on your bachelor's degree, your next step is to apply to a physician assistant program. PA programs typically take between 24 and 27 months to complete. So, it will take you about two years to become a physician assistant. If you want to work during your PA program, some schools offer a three year part-time option. Planning ahead for your PA education is imperative. Amount of experience varies from 500 to 2,000 hours. Factor the time it will take you to complete this extensive experience into how long it will take you"}, {"url": "https://answers.yahoo.com/question/index?qid=20090506084119AAaZIE0", "passage_text": "Being a PA takes 7 years of school total, and it takes complete commitment... as a matter of fact, you cannot even have a job during the program. I think the RN is talking about a medical assistant. Search it on wikipedia. It is one of the top 5 new careers according to money magazine. BUT all the school pays off, they make 100,000- 200,000 K / year if they work in surgery or dermatology. The classes are very hard, and you end up with a Master's Degree in Physician Assistant studies."}, {"url": "http://www.ephysicianassistants.com/how-long-does-it-take-to-become-a-physician-assistant/", "passage_text": "While a GED is basically the same as a high school diploma, it should be kept in mind that traditional high school diplomas tend to look better on applications. College. A bachelor’s degree in health science is required when going for a career as a physician assistant. This will take an additional four years of work. It’s also important to carefully choose which school you are going to attend. "}, {"url": "http://www.learnhowtobecome.org/physician-assistant/", "passage_text": "Physician assistant degree programs typically include 2,000 hours or more of clinical rotations, providing the PA with the applied experience needed to work in a variety of clinical and medical settings. "}, {"url": "http://www.wikihow.com/Become-a-Physician-Assistant", "passage_text": "You will probably need to have healthcare experience before you apply for a physician assistant program. Most programs will require it. 1  You could get such experience by volunteering for non-profit organizations, such as the Peace Corps. Most work full-time, and they can work long hours. 1  The average physician assistant is paid over $90,000. 2  These programs are competitive; however, the government has reported that employment of physician assistants should grow 38 percent from 2012 through 2022."}]