[{"url": "http://www.healthguideinfo.com/neurological-disorders/p67717/", "passage_text": "The vagus nerve is the paired tenth cranial nerve that branches out from the brain and supplies parts of the gastrointestinal system such as the stomach, and parts of the respiratory system such as the lungs. To supply vital organs, it has further to travel than the other cranial nerves. "}, {"url": "https://en.wikipedia.org/wiki/Vagus_nerve_stimulation", "passage_text": "Vagus, the tenth cranial nerve, arises from the medulla and carries both afferent and efferent fibers. The afferent vagal fibers connect to the nucleus of the solitary tract which in turn projects connections to other locations in the central nervous system. "}, {"url": "http://emedicine.medscape.com/article/1875813-overview", "passage_text": "Gross Anatomy. The vagus nerve is the longest cranial nerve. It contains motor and sensory fibers and, because it passes through the neck and thorax to the abdomen, has the widest distribution in the body. It contains somatic and visceral afferent fibers, as well as general and special visceral efferent fibers. (See Table 1, below.). The recurrent laryngeal nerve is also known as the inferior laryngeal nerve. The right nerve branches from the vagus at the root of the neck around the right subclavian artery. It courses superiorly in the tracheoesophageal groove to enter the larynx between the cricopharyngeus and the esophagus."}, {"url": "http://www.innovateus.net/innopedia/what-function-vagus-nerve", "passage_text": "It is known to be one of the longest of all the cranial nerves. The name Vagus Nerve, has originated from the Latin word, which means ‘wandering’. It gets this name because the nerve wanders from the brain stem via various organs in the neck, thorax and abdomen. The vagus nerve is two nerves that go through the brain stem and enter different parts of the body such as the heart and the stomach. Vagus nerve leaves the brain stem from the rootlets present in the medulla that has been found to be caudal to the rootlets in the ninth carnial nerve. The vagus nerve comprises of two sensory ganglia which are segmented into superior and inferior vagal ganglia"}, {"url": "http://www.answers.com/Q/What_is_the_location_of_the_vagus_nerve", "passage_text": "There are two, one of the right and one on the left. The vagus nerve is the tenth (X) cranial nerve, which arises fron the brain stem and travels down the neck to supply some … neck muscle and carry sensory information from the viscera to the brain. 8 people found this useful. Stax de Morgan. There is a left and a right vagus nerve. The right vagus nerve (which travels along with the large … artery in the neck) primarily controls the heart. The vagus nerves are both afferent and efferent (signals travel from the brain and to the brain)."}, {"url": "http://www.healthline.com/human-body-maps/vagus-nerve", "passage_text": "The vagus nerve is one of 12 cranial nerves. It is the longest of the cranial nerves, extending from the brainstem to the abdomen by way of multiple organs including the heart, esophagus, and lungs. Electrical stimulation of the vagus nerve, called vagus nerve stimulation (VNS), is sometimes used to treat people with epilepsy or depression. The vagus nerve is involved in one of the most common causes of fainting, called vasovagal syncope. This is an overreaction of the body to certain stimuli, like the sight of blood, which involves the stimulation of the vagus nerve. This stimulation causes a drop in blood pressure and heart rate. Less blood flows to brain, resulting in loss of consciousnes"}, {"url": "http://www.aans.org/Patient%20Information/Conditions%20and%20Treatments/Vagus%20Nerve%20Stimulation.aspx", "passage_text": "Vagus Nerve Stimulation. The vagus nerve is one of 12 pairs of cranial nerves that originate in the brain and is part of the autonomic nervous system, which controls involuntary body functions. The nerve passes through the neck as it travels between the chest and abdomen and the lower part of the brain. "}, {"url": "http://nerveatlas.ucsf.edu/vagus.html", "passage_text": "The vagus nerve lies in the posterior angle formed between the internal jugular vein and the carotid artery (Giovagnorio and Martinoli, 2001). Location of the vagus nerve in the anterior angle is rare (0.7% of healthy subjects, Giovagnorio and Martinoli, 2001). "}]