[{"url": "http://www.oilgae.com/ref/glos/eutrophication.html", "passage_text": "Oilgae-Glossary. Download free sample report of Algae Fuels ReportKnow More. Eutrophication-Eutrophication is a process whereby water bodies, such as lakes, estuaries, or slow-moving streams receive excess nutrients that stimulate excessive plant growth (algae, periphyton attached algae, and nuisance plants weeds). Cultural or anthropogenic eutrophication is water pollution caused by excessive plant nutrients. Links. Eutrophication-Eutrophication (pronounced you-tro-fi-KAY-shun) is a natural process that occurs in an aging lake or pond as that body of water gradually builds up its concentration of"}, {"url": "http://www.nature.com/scitable/knowledge/library/eutrophication-causes-consequences-and-controls-in-aquatic-102364466", "passage_text": "Aa Aa Aa. Eutrophication is characterized by excessive plant and algal growth due to the increased availability of one or more limiting growth factors needed for photosynthesis (Schindler 2006), such as sunlight, carbon dioxide, and nutrient fertilizers. "}, {"url": "http://www.merriam-webster.com/dictionary/eutrophication", "passage_text": "Definition of EUTROPHICATION. : the process by which a body of water becomes enriched in dissolved nutrients (as phosphates) that stimulate the growth of aquatic plant life usually resulting in the depletion of dissolved oxygen. ADVERTISEMENT. Britannica.com: Encyclopedia article about eutrophication"}, {"url": "http://www.answers.com/Q/What_is_eutrophication", "passage_text": "Eutrophication is a process in which bodies of water receive even more nutrients, usually nitrogen and phosphorous, that stimulate excessive growth of algae. They are usually … introduced into the water by run-off from fertilisers from near-by fields. Valentin Popov. Eutrophication is a noun that refers to the excessive richness of  nutrients in water body or a lake. The excessiveness is due to  frequent runoff from the land that causes … dense growth of plant  life. It can be caused naturally or by human."}, {"url": "http://www.scienceclarified.com/El-Ex/Eutrophication.html", "passage_text": "In nature, eutrophication is a common phenomenon in freshwater ecosystems and is really a part of the normal aging process of many lakes and ponds. Some never experience it because of a lack of warmth and light, but many do. Over time, these bodies of freshwater change in terms of how productive or fertile they are. Humans increase the rate of eutrophication. Human activities almost always result in the creation of waste, and many of these waste products often contain nitrates and phosphates. Nitrates are a compound of nitrogen, and most are produced by bacteria. Phosphates are phosphorous compounds."}, {"url": "http://www.youtube.com/watch?v=wMZ8xfHPNu8", "passage_text": "Eutrophication is an excess of nutrients in a body of water. It causes an overgrowth of algae, which causes a chain reaction of events that destroys the lake ecosystem. This is my first attempt at a live-action video, instead of just me writing on paper. Leave feedback! Shot in L'Amoreaux Park, Scarborough, Ontario. "}, {"url": "http://www.answers.com/Q/What_is_eutrophication", "passage_text": "Eutrophication Eutrophication is a process in which bodies of water (lakes, ponds, and rivers) receive excess nutrients that stimulate excessive growth of algae. The two most common nutrients that initiate eutrophication are nitrogen and phosphorous, two limiting nutrients in the growth of algae. Eutrophication is a noun that refers to the excessive richness of  nutrients in water body or a lake. The excessiveness is due to  frequent runoff from the land that causes … dense growth of plant  life. It can be caused naturally or by human."}, {"url": "http://www.scienceclarified.com/El-Ex/Eutrophication.html", "passage_text": "Eutrophication (pronounced you-tro-fi-KAY-shun) is a natural process that occurs in an aging lake or pond as that body of water gradually builds up its concentration of plant nutrients. Humans increase the rate of eutrophication. Human activities almost always result in the creation of waste, and many of these waste products often contain nitrates and phosphates. Nitrates are a compound of nitrogen, and most are produced by bacteria. Phosphates are phosphorous compounds."}, {"url": "https://en.wikipedia.org/wiki/Eutrophication", "passage_text": "Eutrophication (Greek: eutrophia —healthy, adequate nutrition, development; German: Eutrophie) or more precisely hypertrophication, is the ecosystem's response to the addition of artificial or natural substances, mainly phosphates, through detergents, fertilizers, or sewage, to an aquatic system. Cultural eutrophication also occurs when excessive fertilizers run into lakes and rivers. This encourages the growth of algae (algal bloom) and other aquatic plants. Following this, overcrowding occurs and plants compete for sunlight, space and oxygen."}]