[{"url": "https://www.britannica.com/list/9-of-the-worlds-deadliest-spiders", "passage_text": "Although the spider is not considered to be aggressive, it will often bite people in self-defense. Wolf spiders are venomous, but their bites are not considered dangerous. (Some bite victims who are allergic to spider bites in general may become nauseous, dizzy, and develop an elevated heart rate, however.). Phoneutria are poisonous to humans, and they are considered to be the deadliest of all the world’s spiders. Their venom is toxic to the nervous system, causing symptoms such as salivation, irregular heartbeat, and prolonged, painful erections (priapism) in men."}, {"url": "https://en.wikipedia.org/wiki/List_of_dangerous_snakes", "passage_text": "The Inland taipan (Oxyuranus microlepidotus) is considered the most venomous snake in the world with a murine LD50 value of 0.025 mg/kg SC. Ernst and Zug et al. 1996 list a value of 0.01 mg/kg SC, which makes it the most venomous snake in the world in their study too. The venom of this snake is relatively weak compared to many other Australian species. The LD50 is 2.38 mg/kg subcutaneous. However, these snakes can deliver large amounts of venom when they bite, compensating for the lower venom potency. Average venom yield is 180 mg and they have a maximum yield of 600 mg."}, {"url": "http://www.boldsky.com/insync/pulse/2014/most-poisonous-creatures-in-the-world-041856.html", "passage_text": "Snakes... They are known for the one thing-VENOM. There are numerous snakes that can be named under the most poisonous creatures in the world. Amongst those many, the Inland Taipan is perhaps the most venomous snake in the world. The powerful neurotoxic venom of the inland Taipan can inflict death in a matter of 20 minutes. Severe pain, muscle paralysis and coma can result from a bite. The Taipan has enough venom to kill about 50 fully grown humans. "}, {"url": "http://www.curiosityaroused.com/nature/10-most-dangerous-snakes-in-the-world/", "passage_text": "The Black Mamba is native to Africa. While it may not be the most venomous snake in the world (one bite may only deliver enough venom to kill 10 people), it is still arguably the most dangerous snake in the world for other reasons. It is the fastest snake on earth, able to travel as fast as 20 km/h. The rattlesnake is actually a type of viper, and is quite venomous. The most dangerous snakes in this species are the young Eastern Diamondbacks. When treated promptly, fewer than 4% of rattlesnake bites are fatal, but when left untreated, all bites are potentially lethal."}, {"url": "http://www.thelistcafe.com/top-10-most-venomous-snakes", "passage_text": "Although the Bushmaster’s venom is relatively weak in toxicity when compared to other venomous snakes in this list, she makes up for it with volume with the average bite yielding 400mg. Snakes have developed and perfected one of Nature’s most terrifying and effective weapons… poisonous fangs. Although most of the World’s snakes are in fact non-venomous, the ladies on the following list center their attack (or defense) around extremely potent toxins."}, {"url": "http://myscienceacademy.org/2013/02/15/5-most-dangerous-spiders/", "passage_text": "Brazilian wandering spiders are widely considered the most venomous species of spider. At deadly concentrations, their venom causes loss of muscle control and breathing problems, resulting in paralysis and eventual asphyxiation. In addition, the venom causes intense pain and inflammation following a bite. Redbacks are considered one of the most dangerous species of spiders in Australia. Its neurotoxic venom is toxic to humans, with bites causing severe pain, often for over 24 hours. An antivenom is commercially available, and since its introduction in 1956, no deaths due to redback bites have been reported.+."}, {"url": "http://www.planetdeadly.com/animals/venomous-animals-world", "passage_text": "However, a venom is injected into the victim by means of a bite or a sting. Poisonous NOT venomous. Photo: © Brian Gratwicke License. So, animals such as the poison dart frogs and puffer fish posses some of the most lethal toxins in nature but are poisonous, not venomous. The Brazilian wandering spider is widely considered the most dangerous spider on the planet. As the name suggests it likes to wander and is well known for turning up in shoes, cars and even hitching a lift across the world on bunches of bananas. Brazilian wandering spider (Phoneutria sp."}, {"url": "https://en.wikipedia.org/wiki/List_of_dangerous_snakes", "passage_text": "List of dangerous snakes is an overview of the snakes that pose a significant health risk to humans, through snakebites or other physical trauma. The varieties of snake that most often cause serious snakebites depends on the region of the world. The venom of this snake is relatively weak compared to many other Australian species. The LD50 is 2.38 mg/kg subcutaneous. However, these snakes can deliver large amounts of venom when they bite, compensating for the lower venom potency. Average venom yield is 180 mg and they have a maximum yield of 600 mg."}, {"url": "http://www.curiosityaroused.com/nature/10-most-dangerous-snakes-in-the-world/", "passage_text": "The venom from a single bite of an Inland Taipan can kill as many as 100 people. That may seem like nothing compared to the Belcher’s Sea Snake, but it’s still pretty impressive! While the rattlesnake is the most dangerous snake in the Americas, this snake is ten times more venomous. The rattlesnake is actually a type of viper, and is quite venomous. The most dangerous snakes in this species are the young Eastern Diamondbacks. When treated promptly, fewer than 4% of rattlesnake bites are fatal, but when left untreated, all bites are potentially lethal."}, {"url": "http://www.curiosityaroused.com/nature/10-most-dangerous-snakes-in-the-world/", "passage_text": "The Eastern Brown Snake is not only very venomous, but also very aggressive, which makes it one of the most dangerous snakes in the world. This snake is native to Australia, and will often make its home in populous locations. Furthermore, it will actually chase down a person it perceives as a threat. The rattlesnake is actually a type of viper, and is quite venomous. The most dangerous snakes in this species are the young Eastern Diamondbacks. When treated promptly, fewer than 4% of rattlesnake bites are fatal, but when left untreated, all bites are potentially lethal."}]