[{"url": "http://www.bloomberg.com/research/stocks/private/snapshot.asp?privcapId=4434383", "passage_text": "Famsa USA reported unaudited earnings results for the first quarter ended March 31, 2015. For the quarter, the company reported net sales of MXN 473 million against MXN 418 million a year ago. Famsa USA posted a 20.7% rise in pesos-denominated Net Sales in this period; largely explained by the growth in the categories of Personal Loans and Famsa-to-Famsa (sales in the United States with delivery in Mexico). Same Store Sales grew 2.7%. EBITDA was MXN 39 million compared to MXN 33"}, {"url": "https://en.wikipedia.org/wiki/Grupo_Famsa", "passage_text": "Grupo Famsa is a retail company engaged in the purchase and sale of household appliances, electronic products, furniture, clothing and other consumer products in Mexico and United States. Today the company has 421 stores in 78 Mexican cities and 37 cities in the United States. In 2006 Famsa had 25 U.S. stores; during that year the company planned to open 25 additional United States locations by 2010. In early 2006 Famsa opened operations in Guatemala and planned to begin deliveries to El Salvador."}, {"url": "https://en.wikipedia.org/wiki/Grupo_Famsa", "passage_text": "In Famsa locations in the United States, customers can order deliveries of goods to locations in the United States and Mexico. In addition, Famsa is in the footwear catalog business. The company serves wholesale and retail customers through retail branches and wholesale warehouses. In 2006 Famsa had 25 U.S. stores; during that year the company planned to open 25 additional United States locations by 2010. In early 2006 Famsa opened operations in Guatemala and planned to begin deliveries to El Salvador."}, {"url": "https://famsa.us/us/about-famsa/", "passage_text": "FAMSA USA is a subsidiary of GRUPO FAMSA of Monterrey, Mexico. FAMSA USA counts with 25 stores in the United States located in the states of Texas and Illinois. GRUPO FAMSA of Mexico, a public company, has over 350 stores throughout Mexico. It also counts with 290 Bank locations under BANCO AHORRO FAMSA. FAMSA USA specializes in selling household items which include; furniture, mattresses, electronics, computers and appliances."}, {"url": "http://famsa-org.8m.com/about.html", "passage_text": "FAMSA exists to serve medical students all over Africa through its member organizations and to promote cooperation with the International Federation of Medical Students Associations, IFMSA and other international organizations. FAMSA membership Membership is associations based and FAMSA therefore consists at its Medical Students Associations (MSA) from different countries in Africa. FAMSA recognizes two forms of membership; Full members and Associate members."}, {"url": "http://www.famsawc.org.za/", "passage_text": "Welcome to FAMSA Western Cape. FAMSA-strengthening relationships for over 60 years. FAMSA Western Cape is a non-profit organisation (NPO) specialising in relationship counselling. We believe that “healthy families create healthy communities” and are the foundation of our society"}, {"url": "https://en.wikipedia.org/wiki/Grupo_Famsa", "passage_text": "Don Humberto Garza opened the Fabricantes Muebleros, his first store. The store became Famsa, which spread throughout Mexico beginning in 1975. Famsa opened its first United States location in Los Angeles in late 2000. Famsa intended to target the growing Hispanic American population. In 2006 Famsa had 25 U.S. stores; during that year the company planned to open 25 additional United States locations by 2010. In early 2006 Famsa opened operations in Guatemala and planned to begin deliveries to El Salvador."}, {"url": "http://www.bloomberg.com/research/stocks/private/snapshot.asp?privcapId=4434383", "passage_text": "Famsa USA announced earnings results for the second quarter and six months ended June 30, 2014. For the quarter, the company reported net sales of MXN 428 million compared with MXN 406 million for the same period a year ago. EBITDA was MXN 33 million compared with MXN 10 million for the same period a year ago. Famsa USA posted a 20.7% rise in pesos-denominated Net Sales in this period; largely explained by the growth in the categories of Personal Loans and Famsa-to-Famsa (sales in the United States with delivery in Mexico). Same Store Sales grew 2.7%. EBITDA was MXN 39 million compared to MXN 33 million"}]