[{"url": "http://sccommerce.com/news/press-releases/marleylilly-expanding-upstate-operations", "passage_text": "Marleylilly is expanding its Upstate operations with a new corporate facility in Greenville County. $10 million investment creating 69 new jobs. Headquartered Greenville County, Marleylilly was established in 2010. The company’s new Greenville County facility will be located at 300 W. Phillips Road in Greer. Those interested in joining the Marleylilly team should visit the company’s jobs page online. About Marleylilly Marleylilly is an online boutique specializing in monogrammed gifts and accessories. COLUMBIA, S.C. – Marleylilly, an e-commerce business specializing in monogrammed gifts, accessories, and non-monogrammed boutique apparel, is expanding its Upstate operations with new corporate operations"}, {"url": "https://marleylilly.com/", "passage_text": "Free gift with your next Monogrammed Purchase! Enter your email and we’ll send you a coupon code plus notify you any time we have sales and promotions in the future! Enter Your Initials. "}, {"url": "http://www.buzzfile.com/business/Lilly-Marley-864-915-0959", "passage_text": "Lilly Marley is located at 144 Griffith Hill Way, Greer, SC 29651. Lilly Marley has approximately 3 employees at this location. Lilly Marley generates approximately $150,000 in annual sales. Business Description. Lilly Marley is located in Greer, South Carolina. This organization primarily operates in the Business Activities At Non-commercial Site business / industry within the Business Services sector."}, {"url": "http://www.facebook.com/marleylilly", "passage_text": "Dress up your arm party with our Monogrammed Teardrop Stone Bracelet! Get yours on sale until midnight for $19.99 here: https://www.marleylilly.com/…/monogrammed-teardrop-stone-b…/. ***Plus, get FREE Shipping until midnight tonight! FAVORITE FIVE: TAILGATE RECIPES. Football season is our favorite time of year, and not just because of the electric game day energy. Let’s be honest, it’s our favorite time of year because of the delicious tailgate snacks! Treat your guests this football season with our all time favorite recipes."}, {"url": "http://www.bbb.org/upstatesc/business-reviews/online-retailer/marley-lilly-in-greer-sc-90007345/", "passage_text": "Factors that raised the rating for Marley Lilly include: 1  Length of time business has been operating. 2  Complaint volume filed with BBB for business of this size. 3  Response to 5 complaint(s) filed against business. 4  Resolution of complaint(s) filed against business. To be accredited by BBB, a business must apply for accreditation and BBB must determine that the business meets BBB accreditation standards, which include a commitment to make a good faith effort to resolve any consumer complaints."}, {"url": "http://www.buzzfile.com/business/Lilly-Marley-864-915-0959", "passage_text": "Lilly Marley has been in business for approximately 2 years. The phone number for Lilly Marley is (864) 915-0959. There are 2 commercial tenants at 144 Griffith Hill Way, Greer, SC. Business Description. Lilly Marley is located in Greer, South Carolina. This organization primarily operates in the Business Activities At Non-commercial Site business / industry within the Business Services sector."}, {"url": "http://sccommerce.com/news/press-releases/marleylilly-expanding-upstate-operations", "passage_text": "Company investing $10 million to relocate its corporate operations in Greenville County. COLUMBIA, S.C. – Marleylilly, an e-commerce business specializing in monogrammed gifts, accessories, and non-monogrammed boutique apparel, is expanding its Upstate operations with new corporate operations in Greenville County."}, {"url": "http://www.facebook.com/marleylilly?hc_location=timeline", "passage_text": "10 hrs ·. This adorable Monogrammed Ladies Long Sleeve Denim Shirt is on sale this weekend for $27.99 here: https://marleylilly.com/…/monogrammed-ladies-long-sleeve-d…/. ***Get FREE Shipping now through Monday! Head over and shop this weekend to get our Monogrammed Raglan Sweatshirt Tunics on sale for $34.99 here: https://www.marleylilly.com/…/monogrammed-raglan-sweatshir…/. ***Get FREE Shipping now through Monday! No minimum!***."}]