[{"url": "http://accounting.utep.edu/sglandon/c20/c20a.pdf", "passage_text": "2. Change in accounting estimate-Revision of an estimate because of new information or new experience. 3. Change in reporting entity-Change from reporting as one type of entity to another type of entity. 4. Correction of an error-Correction of an error caused by a transaction being recorded incorrectly or not at all. CHANGE IN ACCOUNTING PRINCIPLE Changing from one acceptable accounting principle to another acceptable accounting principle is accounted for as a change in accounting principle. All such corrections are reported on a retrospective basis. Some of the types of errors that might occur are as follows: (1) Change from an unacceptable accounting principle to an acceptable one. (2) Mathematical errors. (3) Changes in estimates that were not prepared in good faith."}, {"url": "http://highered.mheducation.com/sites/0072994029/student_view0/chapter20/multiple_choice_quiz.html", "passage_text": "The weighted-average method to the LIFO method. The weighted-average method to the FIFO method. FIFO method to the weighted-average method. LIFO method to the weighted-average method. 15. Retrospective restatement usually is not applied for a: Change in accounting principle. Change in accounting estimate. Change in entity. Correction of error"}, {"url": "http://www.accountingtools.com/change-in-accounting-estimate", "passage_text": "When there is a change in estimate, account for it in the period of change. If the change affects future periods, then the change will likely have an accounting impact in those periods, as well. A change in accounting estimate does not require the restatement of earlier financial statements, nor the retrospective adjustment of account balances. If the effect of a change in estimate is immaterial (as is usually the case for changes in reserves and allowances), do not disclose the alteration. However, disclose the change in estimate if the amount is material"}, {"url": "http://cga-pdnet.org/Non_VerifiableProducts/CourseNotes/2010/fa3/module08.pdf", "passage_text": "(Level 1) Required reading ● Chapter 20, pages 1193-1200 to Retrospective Approach with Restatement LEVEL 1 There are three classifications of accounting changes — changes in policy, changes in estimate, and corrections of errors. Activity 8.2-1: Classifying accounting changes What method should be used to account for each of the following?1. A change from average cost (AC) to first-in, first-out (FIFO) to conform to industry practice. 2. A change to percentage-of-completion from completed contract based on user needs."}, {"url": "http://accounting.utep.edu/sglandon/c20/c20a.pdf", "passage_text": "Accounting Changes and Error Corrections D:\\Teaching\\3322\\web\\post\\module4\\c20\\tnotes\\c20a.doc 11/29/2007 2 The correction of an error must be handled as a prior period adjustment to the earliest period reported in the financial statements. All such corrections are reported on a retrospective basis. Some of the types of errors that might occur are as follows: (1) Change from an unacceptable accounting principle to an acceptable one. (2) Mathematical errors. (3) Changes in estimates that were not prepared in good faith."}, {"url": "http://cga-pdnet.org/Non_VerifiableProducts/CourseNotes/2010/fa3/module08.pdf", "passage_text": "(Level 2) LEVEL 2 Once a company has made a change in policy and has accounted for it retrospectively, another issue is the appropriate financial statement classification for the dollar amount of the retrospective effect. You know from your reading that this amount is classified on the retained earnings statement. Activity 8.2-1: Classifying accounting changes What method should be used to account for each of the following?1. A change from average cost (AC) to first-in, first-out (FIFO) to conform to industry practice. 2. A change to percentage-of-completion from completed contract based on user needs."}, {"url": "http://www.webcpe.net/CPE-courses/1410/1410_Course_Material.pdf", "passage_text": "Because the premiums represented coverage for a four-year period and only one (2X11) had transpired, net income and retained earnings in 2X11 was understated by 3/4 of $120,000 ($90,000), net of taxes. This amount, $90,000, should have been accounted for as an insurance prepayment at the end of 2X11. 9 A permanent loss on an asset is not a change in accounting estimate but rather a current-period loss. EXAMPLE: In 2X12, ABC Company changed its bad debt estimate based on an aging of accounts receivable, resulting in recording bad debts of $60,000, which is $3,000 less than if a revised estimate was not made."}, {"url": "http://cga-pdnet.org/Non_VerifiableProducts/CourseNotes/2010/fa3/module08.pdf", "passage_text": "(Level 2) 8.4 Retrospective treatment with restatement Record and report an accounting change through retrospective treatment with restatement. (Level 1) 8.5 Retrospective treatment without restatement Record and report an accounting change through retrospective treatment without restatement. Activity 8.2-1: Classifying accounting changes What method should be used to account for each of the following?1. A change from average cost (AC) to first-in, first-out (FIFO) to conform to industry practice. 2. A change to percentage-of-completion from completed contract based on user needs."}, {"url": "http://www.iasplus.com/en/standards/ias/ias8", "passage_text": "However, to the extent that a change in an accounting estimate gives rise to changes in assets and liabilities, or relates to an item of equity, it is recognised by adjusting the carrying amount of the related asset, liability, or equity item in the period of the change. [IAS 8.37]. If a change in accounting policy is required by a new IASB standard or interpretation, the change is accounted for as required by that new pronouncement or, if the new pronouncement does not include specific transition provisions, then the change in accounting policy is applied retrospectively. [IAS 8.19]."}]