[{"url": "https://msdn.microsoft.com/en-us/library/cc280766.aspx", "passage_text": "Applies To: SQL Server 2014, SQL Server 2016 Preview. The geography spatial data type, geography, is implemented as a .NET common language runtime (CLR) data type in SQL Server. This type represents data in a round-earth coordinate system. The SQL Server geography data type stores ellipsoidal (round-earth) data, such as GPS latitude and longitude coordinates. SQL Server supports a set of methods for the geography spatial data type. The following examples show how to add and query geography data. The first example creates a table with an identity column and a geography column, GeogCol1. A third column renders the geography column into its Open Geospatial Consortium (OGC) Well-Known Text (WKT) representation, and uses the STAsText() method."}, {"url": "https://msdn.microsoft.com/en-us/library/bb895266.aspx", "passage_text": "The geography spatial data type, geography, represents data in a round-earth coordinate system. This type is implemented as a .NET common language runtime (CLR) data type in SQL Server. Examples. The following examples show how to add and query geography data. The first example creates a table with an identity column and a geography column GeogCol1. A third column renders the geography column into its Open Geospatial Consortium (OGC) Well-Known Text (WKT) representation, and uses the STAsText() method."}, {"url": "http://www.census.gov/geography.html", "passage_text": "Geography is central to the work of the Census Bureau, providing the framework for survey design, sample selection, data collection, tabulation, and dissemination. Spatial extracts for use in GIS software from the MAF/TIGER database, containing features such as roads, rivers, and legal and statistical geographic areas. TIGERweb. A web-based application giving users a way to view geographic data, including roads, rivers, legal and statistical areas, without having to download data."}, {"url": "https://www.mssqltips.com/sqlservertip/1965/sql-server-geography-data-type/", "passage_text": "Example Using the Geography Data Type. To demonstrate the use of the geography data type I have created a table in the MSSQLTIPS database called EarthquakeData. A newsletter entitled SpatialNews Daily is sent out daily and included in the newsletter is data on all earthquakes in the world for the previous days. Like the geometry data type, the geography data type is housed as a binary representation of the coordinate, known as the Well-Known Binary Representation, a data type created through the .NET Common Language Runtime (CLR)."}, {"url": "https://fgdc.gov/", "passage_text": "The Federal Geographic Data Committee (FGDC) is an interagency committee that promotes the coordinated development, use, sharing, and dissemination of geospatial data on a national basis. This nationwide data publishing effort is known as the National Spatial Data Infrastructure (NSDI). The NSDI is a physical, organizational, and virtual network designed to enable the development and sharing of this nation's digital geographic information resources."}, {"url": "https://technet.microsoft.com/en-us/library/bb895266(v=sql.110).aspx", "passage_text": "The geography spatial data type, geography, represents data in a round-earth coordinate system. This type is implemented as a .NET common language runtime (CLR) data type in SQL Server. The geography type is predefined and available in each database. You can create table columns of type geography and operate on geography data in the same manner as you would use other system-supplied types."}, {"url": "http://www.census.gov/geography.html", "passage_text": "Read More. Geography is central to the work of the Census Bureau, providing the framework for survey design, sample selection, data collection, tabulation, and dissemination. Geography provides meaning and context to statistical data. Spatial extracts for use in GIS software from the MAF/TIGER database, containing features such as roads, rivers, and legal and statistical geographic areas. TIGERweb. A web-based application giving users a way to view geographic data, including roads, rivers, legal and statistical areas, without having to download data."}, {"url": "https://en.wikipedia.org/wiki/Geographic_information_system", "passage_text": "A geographic information system (GIS) is a system designed to capture, store, manipulate, analyze, manage, and present all types of spatial or geographical data. GIS or spatial data mining is the application of data mining methods to spatial data. Data mining, which is the partially automated search for hidden patterns in large databases, offers great potential benefits for applied GIS-based decision making. Typical applications include environmental monitoring."}]