[{"url": "http://www.dol.wa.gov/business/cosmetology/get_school.html", "passage_text": "1 To get your license as a cosmetologist, barber, manicurist, esthetician, or master esthetician you must: 2  Be at least 17 years of age. 3  Graduate from a school approved and licensed by the Department of Licensing with the minimum required state hours."}, {"url": "http://www.beautyschoolsdirectory.com/faq/license_wa.php", "passage_text": "Last Updated: December 27, 2012. In order to obtain a license in cosmetology, esthetics or nail technology in the state of Washington, students must complete the requirements listed below from the Washington State Board of Cosmetology."}, {"url": "http://www.dol.wa.gov/business/cosmetology/get_school.html", "passage_text": "Licensing requirements. 1  To get your license as a cosmetologist, barber, manicurist, esthetician, or master esthetician you must: 2  Be at least 17 years of age. 3  Graduate from a school approved and licensed by the Department of Licensing with the minimum required state hours."}, {"url": "http://www.beautyschoolsdirectory.com/faq/license_wa.php", "passage_text": "Washington Cosmetology License Renewal. Cosmetology license renewal in Washington happens every 2 years on the date of license issuance. The cost to renew a beauty practitioner's license is $55 prior to expiration, or $110 if past expiration date."}, {"url": "http://www.beautyschool.com/guide/washington-cosmetology-license", "passage_text": "Renewal: Washington cosmetology licenses are valid for two years. The state of Washington requires 16 hours of continuing education every two years. To renew your license in Washington, the following must be submitted to the WA cosmetology board: - Fee. - Renewal form."}, {"url": "http://www.beautyschoolsdirectory.com/faq/license_wa.php", "passage_text": "After finishing your training, you are required to pass a licensing exam issued by the Washington State Board of Cosmetology. Once you pass this exam, you will receive your Washington cosmetology license shortly thereafter. You're now able to work in the state of Washington."}, {"url": "http://www.beautyschoolsdirectory.com/faq/state_req.php", "passage_text": "The national average for required hours to get a cosmetologist's license and barber's license is between 1500 and 2100 hours, but it varies from state to state."}]