[{"url": "https://en.wikipedia.org/wiki/Democratic_peace_theory", "passage_text": "Some theorists prefer terms such as mutual democratic pacifism or inter-democracy nonaggression hypothesis so as to clarify that a state of peace is not singular to democracies, but rather that it is easily sustained between democratic nations. Limiting the theory to only truly stable and genuine democracies leads to a very restrictive set of highly prosperous nations with little incentive in armed conflict that might harm their economies, in which the theory might be expected to hold virtually by definition."}, {"url": "http://study.com/academy/lesson/what-is-democratic-leadership-definition-advantages-disadvantages.html", "passage_text": "Democratic leadership is a style of leadership found in human resources theory and participative management. In this lesson, you will learn what democratic leadership is and some of its advantages and disadvantages. You will have the opportunity to reinforce your knowledge with a brief quiz after the lesson. "}, {"url": "http://www.oxfordbibliographies.com/view/document/obo-9780199756223/obo-9780199756223-0162.xml", "passage_text": "E-mail Citation ». A critical survey of the state of contemporary democratic theory. Brings together the normative literature on democracy with debates from empirical political science and offers overviews of the literature concerning transitions to democracy, maintaining democracy, and democracy and distribution. An introductory survey of some of the major debates in the field of normative democratic theory. Emphasis is placed on the tasks of defining democracy, articulating the moral foundations of democracy, and explaining the requirements of democratic citizenship in large societies."}, {"url": "https://en.wikipedia.org/wiki/Democracy", "passage_text": "Democracy, or democratic government, is a system of government in which all the people of a state or polity ... are involved in making decisions about its affairs, typically by voting to elect representatives to a parliament or similar assembly, as defined by the Oxford English Dictionary. Karl Popper defined democracy in contrast to dictatorship or tyranny, thus focusing on opportunities for the people to control their leaders and to oust them without the need for a revolution."}, {"url": "http://www.democracy-building.info/definition-democracy.html", "passage_text": "History. Links. A Short Definition of Democracy U.S. president Abraham Lincoln (1809-1865) defined democracy as: «Government of the people, by the people, for the people» Democracy is by far the most challenging form of government-both for politicians and for the people. The term democracy comes from the Greek language and means  rule by the (simple) people. The so-called democracies in classical antiquity (Athens and Rome) represent precursors of modern democracies."}, {"url": "https://en.wikipedia.org/wiki/Democracy", "passage_text": "Representative democracy is a form of democracy in which people vote for representatives who then vote on policy initiatives as opposed to a direct democracy, a form of democracy in which people vote on policy initiatives directly. Karl Popper defined democracy in contrast to dictatorship or tyranny, thus focusing on opportunities for the people to control their leaders and to oust them without the need for a revolution."}, {"url": "http://www.oxfordbibliographies.com/view/document/obo-9780199756223/obo-9780199756223-0162.xml", "passage_text": "Democratic theory is an established subfield of political theory that is primarily concerned with examining the definition and meaning of the concept of democracy, as well as the moral foundations, obligations, challenges, and overall desirability of democratic governance. An introductory survey of some of the major debates in the field of normative democratic theory. Emphasis is placed on the tasks of defining democracy, articulating the moral foundations of democracy, and explaining the requirements of democratic citizenship in large societies."}, {"url": "http://plato.stanford.edu/entries/democracy/", "passage_text": "Normative democratic theory deals with the moral foundations of democracy and democratic institutions. It is distinct from descriptive and explanatory democratic theory. It does not offer in the first instance a scientific study of those societies that are called democratic. 1. Democracy Defined. To fix ideas, the term “democracy,” as I will use it in this article, refers very generally to a method of group decision making characterized by a kind of equality among the participants at an essential stage of the collective decision making. Four aspects of this definition should be noted."}, {"url": "https://en.wikipedia.org/wiki/Democracy", "passage_text": "Several variants of democracy exist, but there are two basic forms, both of which concern how the whole body of all eligible citizens executes its will. One form of democracy is direct democracy, in which all eligible citizens have direct and active participation in the political decision making. Karl Popper defined democracy in contrast to dictatorship or tyranny, thus focusing on opportunities for the people to control their leaders and to oust them without the need for a revolution."}, {"url": "https://en.wikipedia.org/wiki/Democratic_peace_theory", "passage_text": "Democratic peace theory is a theory which posits that democracies are hesitant to engage in armed conflict with other identified democracies. In contrast to theories explaining war engagement, it is a theory of peace outlining motives that dissuade state-sponsored violence. Limiting the theory to only truly stable and genuine democracies leads to a very restrictive set of highly prosperous nations with little incentive in armed conflict that might harm their economies, in which the theory might be expected to hold virtually by definition."}]