[{"url": "http://sciencelearn.org.nz/Contexts/See-through-Body/Sci-Media/Images/Bicep-and-tricep-muscles", "passage_text": "Today's medical imaging techniques allow us to do this. They have given us an understanding of how the human body functions. For example how groups of muscles work together. Seen here is the bicep and tricep muscles. When the bicep muscle contracts to flex (bend) the forearm, the triceps muscle relaxes. "}, {"url": "http://www.answers.com/Q/What_movement_does_the_arm_make_when_the_triceps_muscle_contracts", "passage_text": "It isn't. The triceps brachii muscle (which is actually a group of three muscles) is the strongest set of muscles in the arm and accounts for nearly 60% of the upper arm's mus … cle mass. The triceps are primarily responsible for the extension of the elbow joint (straitening of the arm). 1 person found this useful."}, {"url": "http://www.bbc.co.uk/science/humanbody/body/factfiles/workinpairs/biceps_animation.shtml", "passage_text": "When your biceps muscle in your upper arm contracts, it pulls your lower arm in towards your shoulder. However, when it relaxes, your biceps cannot push your arm back out. To do this, your triceps muscle, on the underside of your upper arm, contracts and straightens your arm out. If your triceps muscle wasn't there, your arm would stay drawn in permanently."}, {"url": "http://northtampachiropractor.com/biceps-triceps-work/", "passage_text": "Furthermore, when you do pull ups, your biceps and triceps also work simultaneously in an opposing manner. Both the triceps and biceps muscles are essential muscle groups that aid in the movement of the upper arm. Developing the two may increase the muscle strength and subsequently the overall functioning of the arms."}, {"url": "http://www.bbc.co.uk/bitesize/ks3/science/organisms_behaviour_health/life_processes/revision/8/", "passage_text": "It is controlled by two muscles, the biceps on the front of the upper arm, and the triceps on the back of the upper arm. The biceps and the triceps are antagonistic muscles. when the biceps muscle contracts, the forearm moves up. when the triceps muscle contracts, the forearm moves down. This solves the problem. To lift the forearm, the biceps contracts and the triceps relaxes"}, {"url": "http://www.livestrong.com/article/520358-biceps-triceps-work-together/", "passage_text": "Your biceps and triceps are examples of agonist and antagonist muscles. An agonist muscle is the primary mover. The primary mover is often responsible for initiating the major movement by a muscle shortening contraction. The antagonist muscle is a secondary mover. Daily Movement. Muscles close in proximity, such as the biceps and triceps, often work in groups to create functional movement. Functional movement is motion that contributes to your ability to complete the tasks and activities that form your daily life."}, {"url": "http://www.answers.com/Q/What_movement_does_contraction_of_the_biceps_brachii_produce", "passage_text": "The antagonist of the muscle, biceps brachii is triceps brachii. Most muscles work in pairs, so MOST of the time, the antagonist is the one that is doing OPPOSITE of what IT i … s doing. Like when the biceps contracts, the triceps relaxes, when the triceps contract, the biceps relaxes. + 8 others found this useful. "}, {"url": "http://www.s-cool.co.uk/gcse/pe/how-the-body-moves/revise-it/muscles-and-movement", "passage_text": "As the bicep contracts, the lower arm (radius and ulna) moves up towards the shoulder. The triceps relax to allow this movement to happen. The bicep is the prime mover or agonist, while the tricep is the secondary mover or antagonist. Muscles are attached to bones at either side of the joints by tendons. When the muscle contracts, the other end of the muscle then moves towards the origin. The end that moves is known as the insertion. A good example of this is the upper arm where the triceps and biceps areon opposite sides of the humerus."}, {"url": "https://en.wikipedia.org/wiki/Triceps_brachii_muscle", "passage_text": "The triceps brachii muscle (Latin for three-headed muscle of the arm) is the large muscle on the back of the upper limb of many vertebrates. It is the muscle principally responsible for extension of the elbow joint (straightening of the arm). The triceps is an extensor muscle of the elbow joint and an antagonist of the biceps and brachialis muscles. It can also fixate the elbow joint when the forearm and hand are used for fine movements, e.g., when writing."}]