[{"url": "http://www.sirhow.com/family-visit-visa-for-qatar/", "passage_text": "Family visit visa for qatar requirements. Family visit visa for Qatar, There are two cases one is applying for the wife and the other is for other relatives. Your sponsor will need the following documents before applying-. For Wife-. 1  Photocopy of ID or husband’s passport who is residing in Qatar."}, {"url": "http://www.onlineqatar.com/info/dependent-family-visa.aspx", "passage_text": "The new rule mandates that a minimum salary of QR10,000 is a must to bring in their families to Qatar. Earlier, the minimum salary requirement was QR7000 per month, which was later raised to QR8000 a month, and is now raised to QR10,000."}, {"url": "http://www.qatarqna.com/visas/what-process-applying-family-visa", "passage_text": "Salary should be 10,000 QAR or more and should be transfered to bank account for atleast 6 months. Conditions for applying Family Visa: 1  Work Visa Status should not be Labour. 2  Salary should be 10,000 QAR or more and should be transfered to the bank account for atleast 6 months. 3  Tenancy Contract should be done-The process for Tenancy Contract is ...."}, {"url": "http://www.onlineqatar.com/info/dependent-family-visa.aspx", "passage_text": "A Dependent or Family visa is granted to dependents (usually spouses and children) of sponsors. Expatriates will have to reach Qatar in advance and obtain a Residence Permit, before sponsoring their dependents. Dependent female spouses, with family residence permits, do not require multiple exit visas."}, {"url": "http://www.qatarqna.com/visas/what-process-applying-family-visa", "passage_text": "However, you can sponsor only if your salary is 10,000 or more. You can call your family on visit visa, and your wife may apply for job. But only after 6 months of bank statement of salary transfer can she apply for residence visa."}, {"url": "http://www.onlineqatar.com/info/dependent-family-visa.aspx", "passage_text": "Families of sponsored residents in Qatar can enter the country on a short-term Family Visit Visa, with one-month validity. To stay beyond one month, the visa can be extended to a maximum of six months (five extendable months permitted for immediate family members, and two months for second degree relatives). However, expatriates intending to bring in their families to reside in Qatar, should go through the process explained below."}]