[{"url": "http://science.howstuffworks.com/life/genetic/question598.htm", "passage_text": "As it turns out, a hardwood is not necessarily a harder material (more dense) and a softwood is not necessarily a softer material (less dense). For example, balsa wood is one of the lightest, least dense woods there is, and it's considered a hardwood. The distinction between hardwood and softwood actually has to do with plant reproduction. All trees reproduce by producing seeds, but the seed structure varies."}, {"url": "https://en.wikipedia.org/wiki/Wood", "passage_text": "It is common to classify wood as either softwood or hardwood. The wood from conifers (e.g. pine) is called softwood, and the wood from dicotyledons (usually broad-leaved trees, e.g. oak) is called hardwood. These names are a bit misleading, as hardwoods are not necessarily hard, and softwoods are not necessarily soft."}, {"url": "http://www.answers.com/Q/What_is_softwood_made_of", "passage_text": "Softwood is a type of wood that is cheap and only has two types of cells. Softwoods: These are produced by the cone bearing trees (conifers). They are generally evergreen … and have easily recognizable needle-like leaves. Answered by The Community. Making the world better, one answer at a time. Softwood is just normal wood from a tree, but it's only wood from certain types of trees. All the pine and fir trees are softwood trees (conifers) and the leafy trees like oaks and maples (deciduous) are hardwood trees. The difference is literally that conifers produce a softer, more easily dented wood than deciduou"}, {"url": "http://mamashealth.com/saveearth/softwood.asp", "passage_text": "Softwood is a generic term used in woodworking and the lumber industries for wood from conifers. Conifers are needle-bearing trees from the order Pinales. Softwood trees are often harder than hardwood trees. Douglas fir, a softwood, is harder and stronger than many hardwoods. Balsa, a hardwood, is much softer than most softwoods."}, {"url": "http://soft-wood.com/", "passage_text": "Softwood. Softwood is used to describe wood from trees that are known as gymnosperms. Conifers are an example. It may also be used to describe trees, which tend to be evergreen, notable exceptions being bald cypress and the larches. "}, {"url": "http://www.answers.com/Q/What_is_Soft_wood_and_how_is_it_made", "passage_text": "Confidence votes 40.4K. Softwood comes from particular types of trees, it is made by nature. Softwoods have a particular cellular structure at the microscopic level. Some Softwoods included in that definition are actually harder (as pertains to working with the wood) than some hardwoods. For example Balsa wood is biologically a hardwood, but it is softer for carving and cutting than is the biological softwood, Douglas Fir. All conifers are softwoods. Conifers include: Soft wood is wood that is soft and is a light type of wood although some people think it is drift wood but it is not.Softwood is the wood from conifers. The wood is soft. 2 people found this useful. Edit. Share to: 1  Easy Pumpkin Scraping Tips Pumpkin scraping is a fun alternative to pumpkin carving."}, {"url": "http://www.nzwood.co.nz/faqs/what-is-the-difference-between-hardwood-and-softwood/", "passage_text": "Hardwood is not necessarily a harder material (more dense) and a softwood is not necessarily a softer material (less dense). Different types of construction projects call for different kinds of timber, both hardwood and softwood are used for everything from structural to decorative. "}, {"url": "https://simple.wikipedia.org/wiki/Hardwood", "passage_text": "Hardwood is wood from deciduous trees and broad-leaf evergreen trees. All hardwoods are angiosperms (flowering plants), the largest group of land plants. Hardwood is contrasted to softwood, which comes from conifers, cone bearing seed plants. "}, {"url": "https://en.wikipedia.org/wiki/Softwood", "passage_text": "Scots Pine, a typical and well-known softwood. Softwood is wood from gymnosperm trees such as conifers. Softwood is the source of about 80% of the world's production of timber, with traditional centres of production being the Baltic region (including Scandinavia and Russia), North America and China."}]