[{"url": "http://www.essentialoils.co.za/sun-sensitivity.htm", "passage_text": "Sun sensitivity (phototoxicity) or otherwise also known as photosensitization occurs when an agent, in our case certain essential oils, are used and they cause the skin to be more sensitive to sunlight (actually any ultra violet-UV-light) and one would therefore burn and damage more easily. "}, {"url": "http://www.nourishingtreasures.com/index.php/2013/06/15/phototoxicity-and-essential-oils-how-to-use-phototoxic-essential-oils-without-getting-burned/", "passage_text": "Phototoxicity, or photosensitization, is a reaction caused when essential oils on the skin are exposed to UV light – whether from the sun or from a tanning bed. Reactions can be severe, and even permanent. Here are some of the signs of phototoxicity: 1  severe sunburn. 2  blistering. 3  changes in the color of your skin. "}, {"url": "https://en.wikipedia.org/wiki/Phototoxicity", "passage_text": "Phototoxicity, also called photoirritation, is a chemically induced skin irritation, requiring light, that does not involve the immune system. It is a type of photosensitivity. "}, {"url": "http://www.learningabouteos.com/index.php/2013/08/06/phototoxicity-how-to-stay-safe-in-the-sun/", "passage_text": "Phototoxicity. Phototoxicity, or photosensitization, is a reaction caused when essential oils on the skin are exposed to UV light – whether from the sun or from a tanning bed. Reactions can be severe, and even permanent. Here are some of the signs of phototoxicity: 1  severe sunburn. "}, {"url": "http://www.aromaweb.com/articles/phototoxicity-essential-oils.asp", "passage_text": "Citrus oils, as a group, are generally considered to be phototoxic. However, not all citrus essential oils are phototoxic, and the method of extraction can play a part for some oils. For example, Sweet Orange and Blood Orange Essential Oils are not phototoxic, but Bitter Orange Essential oil is. Photosensitization and phototoxicity can occur when certain essential oil constituents, particularly furanocoumarins, (natural chemicals found in particular essential oils) react when exposed to Ultraviolet UVA light. Inflammation, blistering and reddening/burning of the skin are common"}, {"url": "http://www.medic8.com/healthguide/allergies/photosensitivity/phototoxic-reactions.html", "passage_text": "A phototoxic reaction is where the damage to the skin is caused by the chemicals. These chemicals may be activated or made more damaging by exposure to sunlight. This is quite common, and an exaggerated sunburn or rash will develop only a few minutes after being exposed to sunlight. Drugs that cause phototoxic reactions include: 1  Phenothiazines, such as chlorpromazine (which can be used in the treatment of psychoses such as schizophrenia or bipolar disorder) and promethazine (which is an antihistamine with sedative effects)."}, {"url": "http://www.medicinenet.com/image-collection/phototoxic_drug_reaction_picture/picture.htm", "passage_text": "Get the Latest health and medical information delivered direct to your inbox! Phototoxic drug reaction. In phototoxic reactions, the drug may become activated by exposure to sunlight and cause damage to the skin. The skin's appearance resembles sunburn, and the process is generally has a fast onset. "}, {"url": "http://www.healthline.com/health/photosensitivity", "passage_text": "These can cause two different types of photosensitive reactions: phototoxic and photoallergic. Phototoxic reactions are usually caused when a new chemical in the body interacts with ultraviolet rays from the sun. Medications are the most common cause of this type of reaction. Doxycycline and tetracycline, for example, can cause this reaction. "}]