[{"url": "https://en.wikipedia.org/wiki/Scalene_muscles", "passage_text": "The action of the anterior and middle scalene muscles is to elevate the first rib and laterally flex (bend) the neck to the same side; the action of the posterior scalene is to elevate the second rib and tilt the neck to the same side. The anterior and middle scalene muscles can be involved in certain forms of thoracic outlet syndrome as well as myofascial pain syndrome, the symptoms of which may mimic a spinal disc herniation of the cervical vertebrae."}, {"url": "http://info.visiblebody.com/bid/259669/Learn-Muscle-Anatomy-Scalene-Muscles-and-Other-Neck-Anatomy", "passage_text": "SCALENE MUSCLES. The scalenes are a series of muscles that work like scaffolding, connecting the cervical vertebrae to the thoracic cage. The scalenes originate on the transverse processes of the cervical vertebrae (C02–C07) and attach to the first and second ribs of the thoracic cage. Okay, basically they let me stuff my face, but the neck muscles do much more than that! The neck muscles (and neck anatomy on the whole) are responsible for head movement, stabilizing the upper region of the body, assisting in swallowing, helping to elevate the rib cage during inhalation, and more."}, {"url": "http://www.gustrength.com/muscles:scalene-muscles-location-actions-trigger-points", "passage_text": "Posted on 03 Mar 2012 22:22. The scalene muscles are three paired muscles of the neck, located in the front on either side of the throat, just lateral to the sternocleidomastoid. There is an anterior scalene (scalenus anterior), a medial scalene (scalenus medius), and a posterior scalene (scalenus posterior). 1 Gently pull the head and neck so that it tilts to the opposite side of the side you want to stretch, relaxing your neck muscles as you do so. 2  Try to pull your ear down to your shoudler. 3  Now, you will rotate your head, and the degree of rotation will determine which scalene is targeted."}, {"url": "http://www.carpaltunnelpainreliefbook.com/PDF/ScaleneReport.pdf", "passage_text": "This will cause symptoms. About the scalene muscles The scalenes are on the sides of your neck. There is a set of muscles on each side of your neck, left and right. They attach to your neck bones and your ribs. "}, {"url": "https://www.painscience.com/articles/spot-04-scalenes.php", "passage_text": "They generally attach to the sides of the neck vertebrae at the top and to the uppermost ribs at the bottom. So the scalenes are mostly head pullers: they pull the head from side to side. And although they certainly do move the neck, they are also breathing muscles, because of the way they pull up on the ribs. Just like the pain of a heart attack spreads from the heart into the shoulder and arm, the pain of painful scalene muscles spreads throughout the chest, upper back, and chest, the arm and hand, and the side of the head. Pain referred to the back may feel like a penetrating pain stabbing through the torso."}, {"url": "http://www.innerbody.com/image_musfov/musc21-new.html", "passage_text": "(2) The scalenus medius is similar to the scalenus anterior and raises the first rib from above or bends to slightly rotate ... Click to read more below. The scalene muscles are lateral vertebral muscles that begin at the first and second ribs and pass up into the sides of the neck. There are three of these muscles. (1) The scalenus anterior muscle, which, when the neck is fixed, elevates the first rib to aid in breathing; or when the rib is fixed, bends the neck forward and sideways and rotates it to the opposite side"}, {"url": "https://en.wikipedia.org/wiki/Scalene_muscles", "passage_text": "The middle scalene, (or scalenus medius), is the largest and longest of the three scalene muscles. The middle scalene arises from the posterior tubercles of the transverse processes of the lower six cervical vertebrae. The anterior and middle scalene muscles can be involved in certain forms of thoracic outlet syndrome as well as myofascial pain syndrome, the symptoms of which may mimic a spinal disc herniation of the"}, {"url": "http://www.surgery.medsch.ucla.edu/vascular/Clinical_Thoracic%20Outlet%20Syndrome.shtml", "passage_text": "You cannot see or feel the muscles from the outside. The scalene muscles attach to the first rib. A scalene block relaxes the scalene muscles allowing the first rib to drop and the thoracic outlet to become larger and relieve the compression. "}, {"url": "https://classicalosteopathyontario.wordpress.com/2011/11/05/whats-the-deal-with-the-first-rib/", "passage_text": "As a quick overview, the muscles that attach to the first rib are: subclavius, anterior scalene, serratus anterior, middle scalene, and levator costae. The job of these muscles is either to fix the rib in place or draw it upwards. "}, {"url": "https://en.wikipedia.org/wiki/Scalene_muscles", "passage_text": "They are innervated by the fourth, fifth, and sixth cervical spinal nerves (C4-C6). A fourth muscle, the scalenus minimus (Sibson's muscle), is sometimes present behind the lower portion of the anterior scalene. The anterior and middle scalene muscles can be involved in certain forms of thoracic outlet syndrome as well as myofascial pain syndrome, the symptoms of which may mimic a spinal disc herniation of the cervical vertebrae."}]