[{"url": "http://resources.kodak.com/support/pdf/en/manuals/urg01106/PLAYSPORT_Zx3_UG_GLB_en.pdf", "passage_text": "Go to www.kodak.com/go/kes. Care and maintenance ■ Before inserting or removing the card/battery, make sure your hands, the camera, and the card/battery are completely dry. ■ In water, do not use below a depth of 3 meters (9.8 ft). ■ Do not open/close camera doors in water. Appendixwww.kodak.com/go/playsportsupport 19 ■ The camera will not float."}, {"url": "http://support.en.kodak.com/app/answers/detail/a_id/4024", "passage_text": "Important Charging Information for Ni-MH Batteries Ni-MH batteries may not charge to full capacity the first time they are charged, orafter a long period of non-use.The first-time charge of the KODAK KAA2HR Ni-MH Rechargeable Battery Packshould take approximately 2-1/2 hours. "}, {"url": "http://www.kodak.com/global/en/service/help/support/usbCharging_M873_M883.jhtml", "passage_text": "Charging your camera using a KODAK USB AC Adapter. 1  Turn off the camera. 2  Verify that the correct battery is installed and seated properly. 3  Connect the USB AC Adapter to a standard wall socket. 4  Use the USB A/V Adapter that was supplied with your camera to connect the USB cable to the camera. 5  Connect the USB cable from the camera to the USB AC 6  ... Cha 1 Connect the USB cable from your camera to the USB port on your computer. 2  Do not connect through a USB hub. 3  Turn on the camera. 4  Close EASYSHARE Software. 5  Determine that charging is complete. 6  The Ready/Battery charging light will blink during charging, then turn off when charging is complete."}, {"url": "http://www.answers.com/Q/How_long_does_it_take_to_charge_a_Kodak_playsport_video_camera", "passage_text": "On average a camera battery will charge in 1-6 hours, depending on the battery and the charge it will hold. Sometimes, it can depend on where you are charging it also. For mor … e info, refer to your owners manual for your camera, or your battery if it was purchased seperately. "}, {"url": "http://www.answers.com/Q/How_long_does_a_camera_battery_have_to_charge", "passage_text": "On average a camera battery will charge in 1-6 hours, depending on the battery and the charge it will hold. Sometimes, it can depend on where you are charging it also. For mor … e info, refer to your owners manual for your camera, or your battery if it was purchased seperately. + 5 others found this useful. "}, {"url": "https://answers.yahoo.com/question/index?qid=20081113234914AA3hcH0", "passage_text": "If it's a model that uses regular batteries (AA, AAA, etc.), it depends on the charger. If it's an external charger, ones that monitor the battery and its temperature do so in just a couple of hours; others are overnight (12-18 hours!) chargers. Most of the Kodak (and many other chargers, for that matter) have a charge indicator that changes or extinguishes when charging is complete."}, {"url": "http://www.kodak.com/global/en/service/batteries/batteryUsage.jhtml?pq-path=4434", "passage_text": "The type of battery you use in your camera and the way you use it directly affects how long the battery will last. And of course, the way you use your camera can be quite different from the way your friends and family use theirs. NOTE: FOR ANY TYPE OF PHOTOGRAPHY: If you use a Kodak Li-Ion rechargeable battery for your digital camera, use the Kodak Li-Ion Rapid Charger or the camera dock to keep batteries continually charged. Kodak recommends storing the camera on its dock when not in use."}, {"url": "http://www.kodak.com/global/en/service/batteries/batteryUsage.jhtml?pq-path=4434", "passage_text": "If you use a Kodak Li-Ion rechargeable battery for your digital camera, use the Kodak Li-Ion Rapid Charger or the camera dock to keep batteries continually charged. NOTE: FOR ANY TYPE OF PHOTOGRAPHY: If you use a Kodak Li-Ion rechargeable battery for your digital camera, use the Kodak Li-Ion Rapid Charger or the camera dock to keep batteries continually charged. Kodak recommends storing the camera on its dock when not in use."}, {"url": "http://www.kodak.com/global/en/service/help/support/usbCharging_M873_M883.jhtml", "passage_text": "Charging is complete in approximately 3 hours. 1  On your computer, turn off hibernation, standby, and sleep modes. 2  Use the USB A/V Adapter that was supplied with your camera to connect the USB cable to the camera. 3  Connect the USB cable from your camera to the USB port on your computer. 4  Turn on the camera. 5  Close EASYSHARE Software. 6  Determine that ... 1 Connect the USB cable from your camera to the USB port on your computer. 2  Do not connect through a USB hub. 3  Turn on the camera. 4  Close EASYSHARE Software. 5  Determine that charging is complete. 6  The Ready/Battery charging light will blink during charging, then turn off when charging is complete"}]