[{"url": "http://www.hctax.net/voter/Registration", "passage_text": "To vote in a Harris County election, you must be registered to vote at least 30 days before the election date. To change your name or address, a completed and signed application is also required."}, {"url": "http://www.votetexas.gov/register-to-vote/", "passage_text": "Register To Vote. To vote in Texas, you must be registered. Simply pick up a voter registration application, fill it out, and mail it at least 30 days before the election date. Get your application here."}, {"url": "http://www.sos.state.tx.us/elections/voter/reqvr.shtml", "passage_text": "To be eligible to register in Texas, you must: 1  be a U.S. citizen; 2  be a resident of the county; 3  be 18 years old (you may register at 17 years and 10 months); 4  not a convicted felon (unless a person's sentence is completed, including any probation or parole)."}, {"url": "http://www.dmv.org/tx-texas/voter-registration.php", "passage_text": "Register to Vote in Texas. To register to vote in Texas, you must complete and submit a voter registration application. Postage is paid on official applications. The official application is available: 1  At County Voter Registrars' offices. 2  At the Secretary of State's office. 3  At libraries, high schools, and many post offices."}, {"url": "http://www.wilco.org/CountyDepartments/Elections/VoterRegistration/tabid/592/language/en-US/Default.aspx", "passage_text": "Voter Registration Information In order to vote, you must be registered. Applications must be submitted at least 30 days before the election date. In Texas, citizens do not register by political party, but simply register in their county of current residence."}, {"url": "http://www.sos.state.tx.us/elections/pamphlets/largepamp.shtml", "passage_text": "To be eligible to register to vote in Texas, a person must be: 1  A United States citizen; 2  A resident of the Texas county in which application for registration is made; 3  At least 18 years old on Election Day;"}, {"url": "https://registertovote.org/state-info/texas.html", "passage_text": "Texas Voter Registration Information & Requirements. If you need to register to vote in Texas, you've come to the right place. At RegistertoVote.org, we provide Texas residents with all the information and documents you need to complete your registration quickly and painlessly."}]