[{"url": "http://rogerjnorton.com/Lincoln81.html", "passage_text": "He lives in the heart Of everyone. THOMAS LINCOLN, Abraham Lincoln's father, was born January 6, 1778, to Bathsheba and Abraham Lincoln. Thomas, who was born in Rockingham County, Virginia, was the fourth of five children born to the couple. His older siblings were Mordecai, Josiah, and Mary. Thomas had a younger sister named Nancy. "}, {"url": "http://www.answers.com/Q/When_and_where_was_Abraham_Lincoln_born", "passage_text": "Abraham Lincoln was born in Hodgenville, Kentucky, in Hardin (now Larue) County, on February 12, 1809. Lincoln was born in a log cabin in Hardin County, Kentucky on  February 12, 1809. Born in Kentucky, moved to Indiana, then to Illinois His was born in Springfiels, Illinois i … n a log cabin."}, {"url": "https://en.wikipedia.org/wiki/Abraham_Lincoln_Birthplace_National_Historical_Park", "passage_text": "Sinking Spring [edit]. In the fall of 1808, Thomas and Nancy Lincoln settled on Sinking Spring Farm. Two months later on February 12, 1809, Abraham Lincoln was born there in a one-room log cabin. Today this site bears the address of 2995 Lincoln Farm Road, Hodgenville, Kentucky. A cabin, symbolic of the one in which Lincoln was born, is preserved within a 1911, memorial building at the site. Abraham Lincoln Birthplace National Historical Park preserves two separate farm sites in LaRue County, Kentucky where Abraham Lincoln was born and lived until the age of seven."}, {"url": "http://wonderopolis.org/wonder/where-was-abraham-lincoln-born/", "passage_text": "On February 12, 1809, Abraham Lincoln was born in a one-room log cabin on Sinking Spring Farm, which is located on Nolin Creek about three miles south of Hodgenville, Kentucky. He was the second child of Thomas and Nancy Hanks Lincoln. His sister Sarah was 2 years old when Abraham was born. In 1811, the Lincoln family moved 10 miles away to Knob Creek Farm, where they lived from the time Abraham was 2 and a half until he was almost 8 years old."}, {"url": "https://en.wikipedia.org/wiki/Abraham_Lincoln", "passage_text": "Abraham Lincoln was born February 12, 1809, the second child of Thomas and Nancy Hanks Lincoln, in a one-room log cabin on the Sinking Spring Farm in Hardin County, Kentucky (now LaRue County). He is a descendant of Samuel Lincoln, who migrated from Norfolk, England to Hingham, Massachusetts, in 1638. Born in Hodgenville, Kentucky, Lincoln grew up on the western frontier in Kentucky and Indiana. Largely self-educated, he became a lawyer in Illinois, a Whig Party leader, and a member of the Illinois House of Representatives, where he served from 1834 to 1846."}, {"url": "https://en.wikipedia.org/wiki/Abraham_Lincoln", "passage_text": "Thomas Lincoln and Nancy Hanks were married on June 12, 1806, in Washington County, and moved to Elizabethtown, Kentucky, following their marriage. They became the parents of three children: Sarah, born on February 10, 1807; Abraham, on February 12, 1809; and another son, Thomas, who died in infancy. Born in Hodgenville, Kentucky, Lincoln grew up on the western frontier in Kentucky and Indiana. Largely self-educated, he became a lawyer in Illinois, a Whig Party leader, and a member of the Illinois House of Representatives, where he served from 1834 to 1846."}]