[{"url": "http://www.biology4kids.com/files/cell_membrane.html", "passage_text": "The cell membrane is not a solid structure. It is made of millions of smaller molecules that create a flexible and porous container. Proteins and phospholipids make up most of the membrane structure. The phospholipids make the basic bag. The proteins are found around the holes and help move molecules in and out of the cell. There are also proteins attached to the inner and outer surfaces of the membrane."}, {"url": "http://www.answers.com/Q/What_types_of_molecules_make_up_the_cell_membrane", "passage_text": "Confidence votes 16.0K. The cell membrane is composed of different kinds of molecules. The phospholipid chains surround the cell and is what the cell membrane is primarily made of. Around the cell, you can also find proteins embedded on or all the way through the cell. This protein helps large molecules from outside the cell or inside the cell to go in or out. Between the phospholipid is also cholesterol which helps the cell membrane fluidity."}, {"url": "http://biology.about.com/od/cellanatomy/ss/cell-membrane.htm", "passage_text": "Cell Membrane Structure. The cell membrane is primarily composed of a mix of proteins and lipids. Depending on the membrane’s location and role in the body, lipids can make up anywhere from 20 to 80 percent of the membrane, with the remainder being proteins. "}, {"url": "http://www.answers.com/Q/What_makes_up_cell_membranes", "passage_text": "The membrane of a cell is basically made up of a mixture of lipids  and proteins. The other components of a membrane of a cell are  phospholipids and glycoproteins. 3 people found this useful. Most of the cell membrane are made up of proteins and  phospholipids. The phospholipids make up the basic cell body, with  tiny holes scattered around. It is not a solid pie … ce. The proteins  gather around the tiny holes and help move molecules in and out of  the cel"}, {"url": "http://www.answers.com/Q/What_makes_up_cell_membranes", "passage_text": "The Cell Membrane is made up of a bilayer (double layer) of Phospholipids. These Phosophlipids are oriented by its hydrophobic (water fearing) tails while its head are hydrophilic (water loving). Most of the cell membrane are made up of proteins and  phospholipids. The phospholipids make up the basic cell body, with  tiny holes scattered around. It is not a solid pie … ce. The proteins  gather around the tiny holes and help move molecules in and out of  the cell"}, {"url": "http://www.nature.com/scitable/topicpage/cell-membranes-14052567", "passage_text": "Figure 1: The lipid bilayer and the structure and composition of a glycerophospholipid molecule. (A) The plasma membrane of a cell is a bilayer of glycerophospholipid molecules. (B) A single glycerophospholipid molecule is composed of two major regions: a hydrophilic head (green) and hydrophobic tails (purple). (C) The subregions of a glycerophospholipid molecule; phosphatidylcholine is shown as an example. "}, {"url": "http://study.com/academy/lesson/cell-membrane-functions-role-structure.html", "passage_text": "Phospholipids make up the basic structure of a cell membrane. A single phospholipid molecule has two different ends: a head and a tail. The head end contains a phosphate group and is hydrophilic. This means that it likes or is attracted to water molecules. A cell is the basic unit of life, and all organisms are made up of one or many cells. One of the things that all cells have in common is a cell membrane. It is a barrier that separates a cell from its surrounding environment. This outer boundary of the cell is also called the plasma membrane."}, {"url": "http://study.com/academy/lesson/cell-membrane-functions-role-structure.html", "passage_text": "The cell membrane, or plasma membrane, surrounds and protects the internal environment of a cell; however, this is not its only function. A cell membrane also determines what materials enter or leave the cell. This ensures that the cells will be able to get rid of wastes and take up important nutrients and gases. A cell is the basic unit of life, and all organisms are made up of one or many cells. One of the things that all cells have in common is a cell membrane. It is a barrier that separates a cell from its surrounding environment. This outer boundary of the cell is also called the plasma membrane."}]