[{"url": "http://psychology.wikia.com/wiki/Functional_magnetic_resonance_imaging", "passage_text": "Functional MRI or functional Magnetic Resonance Imaging (fMRI) is a type of specialized MRI scan. It measures the haemodynamic response related to neural activity in the brain or spinal cord of humans or other animals. "}, {"url": "https://en.wikipedia.org/wiki/Functional_magnetic_resonance_imaging", "passage_text": "Functional magnetic resonance imaging or functional MRI (fMRI) is a functional neuroimaging procedure using MRI technology that measures brain activity by detecting changes associated with blood flow. This technique relies on the fact that cerebral blood flow and neuronal activation are coupled. Neuroimaging methods such as fMRI offer a measure of the activation of certain brain areas in response to cognitive tasks engaged in during the scanning process. Data obtained during this time allow cognitive neuroscientists to gain information regarding the role of particular brain regions in cognitive function."}, {"url": "http://ibguides.com/psychology/notes/discuss-the-use-of-brain-imaging-technologies-in-investigating-the-relationships-between-biological-factors-and-behaviour", "passage_text": "1 The next biological factor which will be discussed with the brain imaging technology of PET Scans are brain interactions and functions. 2  Describe PET brain imaging technology. 3  PET scans require patients to be injected with a radioactive glucose tracer which shows the areas where glucose is absorbed in the active brain. 1 In the following essay, the brain imaging technologies that will be discussed are MRI and PET scans, which will be investigated in terms of its role in investigating the correlations/relationships between biological factors and behaviour."}, {"url": "http://psychology.wikia.com/wiki/Magnetic_resonance_imaging", "passage_text": "MRI redirects here. For other uses see MRI (disambiguation). Magnetic resonance imaging (MRI) - also called magnetic resonance tomography (MRT) - is a method of creating images of the inside of opaque organs in living organisms as well as detecting the amount of bound water in geological structures. Application Edit. 3D MRI. In clinical practice, MRI is used to distinguish pathologic tissue (such as a brain tumor) from normal tissue. One of the advantages of an MRI scan is that, according to current medical knowledge, it is harmless to the patient."}, {"url": "http://www.appsychology.com/IB%20PP/The%20Brain%20Imaging.ppt", "passage_text": "The Brain. Discuss the use of brain imaging technologies in investigating the relationship between biological factors and behavior. Modern technology and localization of function Electroencephalogram (EEG) Developed in 1929 by Hans Berger Electrodes are placed on the outside of the head using a special cap or helmet."}, {"url": "http://www.radiologyinfo.org/en/info.cfm?pg=fmribrain", "passage_text": "1 determine precisely which part of the brain is handling critical functions such as thought, speech, movement and sensation, which is called brain mapping. 2  help assess the effects of stroke, trauma or degenerative disease (such as Alzheimer's) on brain function. 3  monitor the growth and function of brain tumors. Magnetic resonance imaging (MRI) is a noninvasive medical test that physicians use to diagnose and treat medical conditions. MRI uses a powerful magnetic field, radio frequency pulses and a computer to produce detailed pictures of organs, soft tissues, bone and virtually all other internal body structures."}, {"url": "http://psychcentral.com/lib/types-of-brain-imaging-techniques/", "passage_text": "Brain imaging techniques allow doctors and researchers to view activity or problems within the human brain, without invasive neurosurgery. There are a number of accepted, safe imaging techniques in use today in research facilities and hospitals throughout the world. "}, {"url": "https://en.wikipedia.org/wiki/Functional_magnetic_resonance_imaging", "passage_text": "This is a type of specialized brain and body scan used to map neural activity in the brain or spinal cord of humans or other animals by imaging the change in blood flow (hemodynamic response) related to energy use by brain cells. Neuroimaging methods such as fMRI offer a measure of the activation of certain brain areas in response to cognitive tasks engaged in during the scanning process. Data obtained during this time allow cognitive neuroscientists to gain information regarding the role of particular brain regions in cognitive function."}, {"url": "http://www.alleydog.com/glossary/definition.php?term=Magnetic%20Resonance%20Imaging%20(MRI)", "passage_text": "Magnetic Resonance Imaging (MRI) is a method used for studying the functions of the brain (or any living tissue) without surgery. "}, {"url": "https://en.wikipedia.org/wiki/Functional_magnetic_resonance_imaging", "passage_text": "In general, fMRI studies acquire both many functional images with fMRI and a structural image with MRI. The structural image is usually of a higher resolution and depends on a different signal, the T1 magnetic field decay after excitation. Neuroimaging methods such as fMRI offer a measure of the activation of certain brain areas in response to cognitive tasks engaged in during the scanning process. Data obtained during this time allow cognitive neuroscientists to gain information regarding the role of particular brain regions in cognitive function."}]