[{"url": "https://answers.yahoo.com/question/index?qid=20090616140901AANJ1gN", "passage_text": "Answers. Best Answer: Click the song you wish to take off of the playlist to select it and press the delete key on your keyboard. A thing will pop up asking if you're sure you want to take the song off of the list. Click remove. Add a comment. Submit. · just now. Report Abuse. click on the playlist where the song(s) is that u wanna delete.. and click on the song(s) and click delete.. and dont worry the song wont be deleted off itunes.. (thats wat i thot at first) juss saying"}, {"url": "http://www.wikihow.com/Delete-an-iTunes-Playlist", "passage_text": "1. Open the Music app on your iPod. You can playlists from your iPod without going through the hassle of connecting the device to your computer and manipulating it through iTunes. The Music app is represented by a musical note in an orange box. You needn't delete an entire playlist if you only want to cut out a few songs. 1. Click the playlist to show its contents. iTunes arranges the songs in your playlists alphabetically by default. If you'd rather round up songs by a certain artist or album, click the Artist or Album by Artist tabs. 2. While holding Control on PC or ⌘ Command on Mac, click the songs you want to delete"}, {"url": "http://www.dummies.com/how-to/content/how-to-delete-items-from-a-playlist-in-itunes0.html", "passage_text": "Note: Switch to the Library sections (Music, Movies, TV Shows, and so on) in the Source pane to delete items from your library. To delete an item from a playlist, select the playlist in the Source pane and then select the item. Press Delete/Backspace or choose Edit→Delete. In the warning dialog that appears, click Remove to remove the selected item from the list. You can also completely delete an item from your library from within a playlist by selecting the item and pressing Command+Option+Delete (Mac) or Ctrl+Alt+Backspace (Windows). To delete a whole playlist, select the playlist in the Source pane and then press Delete/Backspace or choose Edit→Delete. 1  Add a Comment. 2  Print. "}, {"url": "https://answers.yahoo.com/question/index?qid=20100218101123AAGhmdT", "passage_text": "Best Answer: go to your play list and select the song you want to remove and select remove. It will not remove it from your library, but only the play list. If you hit the delete while in your library, by default, you should be given the opportunity to remove the song, or remove the song and send the song to recycle bin... Don't click on the send to recycle bin and you will be alright. Source(s): MCP. You can remove songs from playlists by just clicking on them and tapping the delete key. The actual songs are not stored in your playlist. The songs will still remain, the song in your playlist is basically a copy/shortcut to the song in the main program. Source(s): Common sense."}, {"url": "https://support.apple.com/en-us/HT201323", "passage_text": "iPhone, iPad, or iPod touch. 1  In the Music app, find the name of the song, album, or playlist that you want to remove, and tap the More Options icon. 2  Tap Remove Download to remove the item for offline listening. 3  Tap Remove from My Music to delete the item completely, from your library on all of your devices. iPhone, iPad, or iPod touch. 1  In the Music app, find the name of the song, album, or playlist that you want to remove, and tap the More Options icon. 2  Tap Remove Download to remove the item for offline listening. 3  The item will remain in"}, {"url": "http://lifehacker.com/5917787/how-to-delete-a-song-from-your-itunes-library-from-the-playlist-view", "passage_text": "Ordinarily, pressing the delete key while in a playlist will only prompt you to remove the song from that playlist. If you want to remove it from your library entirely, just press Shift+Delete (on Windows) or Option+Delete (on OS X), and you'll get the prompt to remove the song from your library entirely. If you find a song in one of your iTunes playlists that you no longer want, you usually have to go all the way back to the Music view and find it in order to delete it. This keyboard shortcut saves you the hassle, deleting the item right from the playlist view."}, {"url": "http://www.cnet.com/how-to/get-songs-and-playlists-off-the-iphone/#!", "passage_text": "Now close Pod to PC. Open iTunes. Go to File, select Library, then Import Playlist. Open the playlist. iTunes will add the new songs to the library. And they'll show up in the main library. And there you have it. Now you can get any file off an iPod or iPhone. "}, {"url": "https://support.apple.com/en-us/HT201323", "passage_text": "1 In iTunes, right-click the song, album, or playlist that you want to remove and click Delete. 2  Choose Remove Download to remove the item for offline listening. 3  The item will remain in your library on all of your devices. iPhone, iPad, or iPod touch. 1  In the Music app, find the name of the song, album, or playlist that you want to remove, and tap the More Options icon. 2  Tap"}]