[{"url": "http://www.smarttechsolutions.s5.com/certification1.html", "passage_text": "1 Executives-Typically, this is a two-hour session to introduce executives to COPC and to present data on the benefits of certification. 2  Customer Contact Center and/or Fulfillment Center Managers-Typically, this is a four-hour session to introduce center managers to the specific requirements of the Standard. 1 Step 1 -Define the Entity Seeking Certification. 2  The first step towards certification is to properly define the entity. 3  This is the segment of the company identified for implementation of the COPC-2000 Standard. 4  Any location/service can be certified as long as it can be clearly defined."}, {"url": "http://www.smarttechsolutions.s5.com/certification1.html", "passage_text": "The process defined below is the COPC recommended process for most entities, based on the experience of COPC with companies that have sought certification over the past few years. While some variations of this model may apply to your situation, this is an excellent place to start. 1 Step 1 -Define the Entity Seeking Certification. 2  The first step towards certification is to properly define the entity. 3  This is the segment of the company identified for implementation of the COPC-2000 Standard. 4  Any location/service can be certified as long as it can be clearly defined."}, {"url": "https://www.copctraining.com/", "passage_text": "Decrease costs, improve efficiency, boost client satisfaction and increase your bottom line. COPC® Global Training is the most valuable contact center–specific training in the industry, with a full range of online programs to complement our classroom and on-site offerings. Pick your program. "}, {"url": "http://www.proseed.co.jp/download/upload_images/COPC%20CSP%20Standard%20Release%204.3%20Version%201.1.pdf", "passage_text": "©1996-2009 Customer Operations Performance Center Inc. (COPC Inc.) All rights reserved. The reproduction or distribution of any portion or all of these materials in any form or media without the prior written agreement of COPC Inc. is strictly prohibited. The COPC ® Performance Management System is used by internal CSPs (i.e., those that interact with their companies’ own end users), third-party CSPs (i.e., those that interact with the end users of their clients.), and buyers of third-party services."}, {"url": "https://en.wikipedia.org/wiki/COPC_Inc.", "passage_text": "COPC Inc. , is a privately held management consulting company based in Winter Park Florida that specialises in customer contact centres. COPC Inc. provides performance improvement consulting, training, certification, and benchmarking. Clients of COPC Inc. include Apple, Microsoft, Sprint, HTC, Mattel, RBS, DiGi, Canal Digital, UWV, ToysRus, Datacom Sitel, and Citigroup. COPC Inc. is well known in the contact centre industry and many of the industry associated organisations actively promote them. The current COPC Inc. Standards Committee evolved from the initial group of business professionals that formed the first edition of the COPC CSP Standard, and precedes the founding of the company. The Standards Committee is made up of volunteers from organizations that implement the COPC Family of Standards."}, {"url": "http://www.smarttechsolutions.s5.com/certification1.html", "passage_text": "COPC Implementation Team-Typically, this is a four to eight hour session with the team responsible for driving COPC implementation. Step 3-Your COPC Coordinators become Registered COPC-2000 Coordinators. At a minimum, you will need one Registered COPC-2000 Coordinator at each location seeking certification. 1 Step 1 -Define the Entity Seeking Certification. 2  The first step towards certification is to properly define the entity. 3  This is the segment of the company identified for implementation of the COPC-2000 Standard. 4  Any location/service can be certified as long as it can be clearly defined."}, {"url": "http://www.iieom.org/ieom2014/pdfs/281.pdf", "passage_text": "This paper presents a case study related to implementation of COPC as a quality assurance technique in a global BPO company. A baseline audit is first carried out in the company on various COPC standard items. Based on this audit, gaps in performance are identified and prioritized. COPC in addition to providing valuable data also specifies a set of standard metrics.COPC provides the specific Business Process Management framework that serves as a foundation for Six Sigma and Six Sigma, in turn, provides the continuous organization-wide disciplineand focus to sustain improvement."}, {"url": "http://www.copc.com/certification/", "passage_text": "Certification to a COPC Standard gives your organization a proven, comprehensive framework for managing the people, processes, and performance of your customer operation, whether it is a call center, VMO, BPO, face-to-face environment, or field service activities. Combined with our Outsourcing Management System, we have driven global consistency in managing metrics and implementing best practices, resulting in increased performance levels within Microsoft and with our suppliers.”."}, {"url": "http://www.copc.com/certification/", "passage_text": "Sunshine Insurance is one of China’s top 500 companies and one of Asia’s largest insurance companies. In a highly competitive industry, the company embarked on certification to the COPC CSP Standard to solidify a foundation for growth. Combined with our Outsourcing Management System, we have driven global consistency in managing metrics and implementing best practices, resulting in increased performance levels within Microsoft and with our suppliers.”."}]