[{"url": "http://home.costhelper.com/gutters.html", "passage_text": "Price included removal of old gutters (free), 130' of 6 seamless aluminum white gutters ($4.50 per foot) with black leafree gutter guards($5.95 per foot) and 92' of 3x4 aluminum downspouts-6 downspouts of varying lengths($3.95 per foot). 1 Vinyl gutters maintain their color well, are flexible and dent-resistant and don't rust or corrode but they do get brittle with age and extreme cold. 2  Having aluminum gutters installed averages about $4-$9 a foot plus downspouts at $5-$8 each, or $500-$1,200 for 120 feet and $1,050-$2,400 for 250 feet."}, {"url": "http://home.costhelper.com/gutters.html", "passage_text": "1 Expect to pay around $3-$5 a lineal foot to have someone install vinyl (PVC) gutters, or about $360-$600 for 120 feet and $750-$1,250 for 250 feet. 2  Vinyl gutters are a fairly simple do-it-yourself project; material alone run about $50-$100 for 120 feet and $90-$180 for 250 feet. 1 Vinyl gutters maintain their color well, are flexible and dent-resistant and don't rust or corrode but they do get brittle with age and extreme cold. 2  Having aluminum gutters installed averages about $4-$9 a foot plus downspouts at $5-$8 each, or $500-$1,200 for 120 feet and $1,050-$2,40"}, {"url": "http://www.fixr.com/costs/install-gutters", "passage_text": "According to HomeInspectorLocator.com the average price to install galvanized or aluminum gutters is approximately $4 to $9 per linear foot. There are also vinyl gutters which are much easier to install, and which run at roughly $3 to $5 per linear foot. 1 Plastics range from $3 to $5 per foot, aluminum average $4 to $9, wood are around $16 per foot, steel are from $4 to $8, and copper will be the most expensive with an average price of $20 per foot; and."}, {"url": "http://www.improvenet.com/r/costs-and-prices/aluminum-gutters", "passage_text": "The average minimum cost per linear foot for aluminum gutters is $4.13. The average maximum cost per linear foot for aluminum gutters is $5.47. In addition to the primary material, there will be additional costs associated with the installation of aluminum gutters. Labor costs for aluminum gutter installation average $51.25 per hour for work performed by a gutter specialist or roofing company. The average hourly labor cost for a handyman to install aluminum gutters is $44.56. Additional supplies such as end caps, elbows and corner pieces add an average of $30.50 per every 100 linear feet"}, {"url": "http://www.specialtydesign.com/blog/copper-gutters-cost-and-how-to-choose/", "passage_text": "A standard, aluminum gutter system will run a homeowner approximately $3.50 to $7.00 per linear foot (again, range dependent on contractor rate). For House A, the total cost after material and labor would range between $700 and $1,400 in total. For House B, the total cost would fall between $1,400 and $2,275. Copper will run $18.50 and $26.00 per linear foot. Installation for House A will cost about $3,700 – $5,200. For House B, about $7,400 – $10,400. There you have it: the cost to fully install the most desirable gutter system the world can offer."}, {"url": "http://home.costhelper.com/gutters.html", "passage_text": "1 Having aluminum gutters installed averages about $4-$9 a foot plus downspouts at $5-$8 each, or $500-$1,200 for 120 feet and $1,050-$2,400 for 250 feet. 1 Vinyl gutters maintain their color well, are flexible and dent-resistant and don't rust or corrode but they do get brittle with age and extreme cold. 2 "}, {"url": "http://www.brothersgutters.com/blog/2013/03/18/cost-of-gutters/", "passage_text": "The average cost of 6” gutters ranges between $1,000-$1500 for the same, 2,000 square foot home. Average cost of gutters per foot for 5” gutters is between 5-8 dollars and for 6” gutters between 8-10 dollars. 5” seamless: $800-$1200. 5” cost per foot: 5-8 dollars. 6” seamless: $1,000-$1500. 6” cost per foot: 8-10 dollars. There are several reasons that account for the variation in the price of seamless gutters."}, {"url": "http://www.harryhelmet.com/gutter-guards-cost/", "passage_text": "Aluminum Gutters and Downspout Cost: $5 to $15 per linear foot. Aluminum gutters and downspouts are a significant upgrade from vinyl. In addition, aluminum gutters are rust-resistant and come pre-applied with a non corrosive coating, making them last far longer than vinyl gutters. Given all the various options on aluminum gutters, they will cost you roughly $750 – $2,300 for a 150 foot project, depending on the size of gutter, gauge and attachment method you choose for your home."}]