[{"url": "http://checkzx.blogspot.com/2011/10/how-to-hack-computer-using-cain-and.html", "passage_text": "How to hack a Computer with Cain and Able. 1  This hack will only work for Computers connected on LAN. 2  First of all download Cain and Abel Software. 3  Now install the software and open it. 4  Make sure that you dont have any active antivirus on your pc. 5  First Click the Sniffer Tab."}, {"url": "http://pcsupport.about.com/od/toolsofthetrade/gr/cainandabel.htm", "passage_text": "Cain & Abel v4.9.56 does a great job recovering passwords-other people's passwords. If you have no way of getting in to your Windows PC, you will not be able to use Cain & Abel to recover your password. Cain & Abel finds passwords for other accounts on your computer."}, {"url": "http://www.go4expert.com/forums/cain-abel-sniffing-network-activity-t21882/", "passage_text": "The best program to sniff LAN activity is Cain and Abel, the best program for Wireless is Aircrack-ng and its compatible with most WLAN cards, I suggest if you buy a card, make sure its chipset is atheros because atheros chipset is compatible with Aireplay, Aireplay is the app you use to inject packets on the WLAN."}, {"url": "http://www.security-faqs.com/use-cain-able-software-to-recover-passwords-lost-on-the-companys-network.html", "passage_text": "This way you have easy access to their work computer. Cain and Abel is a good piece of software to have around in case your forget your password on the computer. Related posts: 1  10 Tips For Creating Effective Passwords. 2  Why You Need To Explain To Your Employees How Improper Passwords Can Put The Company At Risk."}, {"url": "http://checkzx.blogspot.com/2011/10/how-to-hack-computer-using-cain-and.html", "passage_text": "1 First of all download Cain and Abel Software. 2  Now install the software and open it. 3  Make sure that you dont have any active antivirus on your pc. 4  First Click the Sniffer Tab. 5  Now Click on the sniffer button in the top toolbar. 6  On clicking ,the sniffer will start."}, {"url": "http://www.youtube.com/watch?v=ZGMzR5TIVIQ", "passage_text": "Cain: http://www.oxid.it/downloads/ca_setup... Zone Alarm: http://download.zonealarm.com/bin/fre... A short tutorial on how to standby. Someone with hardly any computer knowledge should be able to understand this, but if you have any problems message me and ill try my best to help you out."}, {"url": "http://www.informit.com/guides/content.aspx?g=security&seqNum=258", "passage_text": "First download the program from http://www.oxid.it/cain.html and install it. If you do not have the WinPCap drivers installed, you will want to also install these. Once the program is on your system, launch it like any other software package."}]