[{"url": "https://www.gov.uk/data-protection-your-business/recruitment-managing-staff-records", "passage_text": "Recruitment and managing staff records. You must keep any data you collect on staff secure-eg lock paper records in filing cabinets or set passwords for computer records. Only keep the information for as long as you have a clear business need for it, and dispose of it securely afterwards (eg by shredding)."}, {"url": "https://www.gov.uk/data-protection-your-business/recruitment-managing-staff-records", "passage_text": "2. You must keep any data you collect on staff secure-eg lock paper records in filing cabinets or set passwords for computer records. Only keep the information for as long as you have a clear business need for it, and dispose of it securely afterwards (eg by shredding)."}, {"url": "http://www.nolo.com/legal-encyclopedia/how-long-should-you-keep-business-records.html", "passage_text": "Often swamped with paperwork, many entrepreneurs wonder how long you should keep business records. The answer depends a great deal upon whom you ask and what the record pertains to in your business. The IRS sets some basic record retention standards for tax records."}, {"url": "http://smallbusiness.chron.com/long-keep-employee-files-4868.html", "passage_text": "It is important to consider your company's income tax filing when deciding how long to keep employee records. The Internal Revenue Service (IRS) states you should keep all employment-related tax records a minimum of four years after the due or payment date (use the later date) for that tax year."}, {"url": "http://www.healtharchives.org/docs/BLT_Line_managers_staff_records.pdf", "passage_text": "2. How long to keep different types of staff records 2.1 Line managers should annually review the staff records they hold, to see what information can be destroyed, in accordance with the Trust Policy on the Retention and Disposal of Records. This information should be destroyed as confidential waste."}, {"url": "http://www.healtharchives.org/docs/BLT_Line_managers_staff_records.pdf", "passage_text": "The guidance covers: • How long to keep different types of staff records; • What to do with the staff record when that person leaves the Trust or your department; • What information is held centrally by Human Resources; • What to do if you receive a request for access to or copies of a staff file."}, {"url": "https://www.nibusinessinfo.co.uk/content/how-long-keep-staff-records", "passage_text": "How long to keep staff records. By law you must keep certain records for a set period of time. However, it is a good idea to keep records for six years to cover the time limit for bringing any civil legal action against you, including national minimum wage claims and contractual claims."}]