[{"url": "http://www.mananatomy.com/basic-anatomy/sebaceous-glands", "passage_text": "Human Anatomy » Basic Anatomy » Sebaceous Glands. Sebaceous glands are microscopic glands in the skin that secrete an oily secretion known as sebum. They are widely distributed all over the dermis of skin, except for the palms and soles. They are especially abundant in the scalp and face."}, {"url": "http://www.answers.com/Q/What_are_the_Types_of_sebaceous_glands", "passage_text": "They secrete a waxy oil substance called sebum into hair follicle.  Sebum, a type of natural oil produced by your body, it is what  makes your hair healthy and shiny. If you … have over active  sebaceous glands then it can cause an odor or your hair can appear  too oily or even have clots of oily skin flakes."}, {"url": "https://en.wikibooks.org/wiki/Human_Physiology/Integumentary_System", "passage_text": "The sebaceous glands are glands found in the skin of mammals. They secrete an oily substance called sebum (Latin, meaning fat or tallow) that is made of fat (lipids) and the debris of dead fat-producing cells. These glands exist in humans throughout the skin except in the palms of the hands and soles of the feet."}, {"url": "https://www.sharecare.com/health/healthy-skin/different-types-glands-on-skin", "passage_text": "There are 3 main types of glands found on human skin: • Eccrine glands-secrete sweat through pores found in the palms of. hands, soles of feet, and forehead. • Sebaceous glands-secrete oily sebum and are found on the chest, back, scalp, face"}, {"url": "http://medical-dictionary.thefreedictionary.com/sebaceous+gland", "passage_text": "salivary g's see salivary glands. sebaceous gland a type of holocrine gland of the corium that secretes an oily material (sebum) into the hair follicles. Glands: The relationship of the hair follicle, eccrine and apocrine sweat glands and sebaceous glands. From Copstead, 1995."}, {"url": "http://www.answers.com/Q/What_are_the_Types_of_sebaceous_glands", "passage_text": "Most sebaceous glands are on the skin and release oil. There are two types of modified sebaceous glands as well. Mammary glands produce milk, and ceruminous glands in the ear canal produce cerumen, or ear wax."}]