[{"url": "http://www.nytimes.com/2014/06/19/world/middleeast/islamic-state-in-iraq-and-syria-or-islamic-state-in-iraq-and-the-levant.html", "passage_text": "But that would come at the cost of adding an adjective that is not present in the original Arabic, not to mention cluttering the acronym. Or the already familiar ISIS abbreviation could simply be said to stand for Islamic State in Iraq and al-Sham, though the last word is unfamiliar to English speakers. Speaking of the acronym, there is no consensus on how to pronounce ISIS, either. "}, {"url": "http://www.wnd.com/2014/09/isis-v-isil-why-obama-stands-alone/", "passage_text": "The Obama administration, president, says the word ISIL. The last S stands for Syria, the last L they don't want to have stand for Syria.. Todd apparently was suggesting the Obama administration would like Americans not to associate ISIS with Syria. Capitol Hill Democrats decided earlier this week to go with ISIL – but for multicultural reasons."}, {"url": "https://en.wikipedia.org/wiki/ISL", "passage_text": "Isl (or isl) is a common abbreviation for  island  or islands. ISL may also refer to: 1  Iceland, a Nordic European island country. 2  In-situ leach, a mining technique. 3  Independent Socialist League, a defunct Trotskyist group in the United States (originally called the Workers Party). 4  Integer set library (isl), a programming library for manipulating integer set"}, {"url": "http://www.mediaite.com/tv/chuck-todd-knows-why-obama-prefers-isil-to-isis/", "passage_text": "“Obviously, we refer to it at NBC News as ISIS,” Todd explained to anyone who may have been confused by the two different names. “The Obama administration, the president says the word ISIL. The last ‘S’ stands for Syria. The last ‘L’ they don’t want to have stand for Syria.”. As Todd said, ISIS stands for the “Islamic State in Iraq and Syria,” a designation that could indicate the best way to combat the group is to take them on militarily in both of those countries. "}, {"url": "http://www.independent.co.uk/news/world/middle-east/isis-vs-isil-vs-islamic-state-what-is-in-a-name-9731894.html", "passage_text": "The standard English term for this territory is “the Levant”, which is broadly why Mr Obama and Mr Cameron use the acronym “Isil”. Nonetheless, some in the US media claim that the President is using “Isil” to avoid using the word “Syria” which is what the “S” stands for in Isis. Others still refer to the group as “Isis” - posing an issue for the various companies and brands around the world that already used the acronym or took it from the ancient Egyptian goddess of the same name. The group itself declared in June that it wants to be known as the Islamic State."}, {"url": "http://www.wnd.com/2014/09/isis-v-isil-why-obama-stands-alone/", "passage_text": "In some of Obama's briefings on ISIS, he has gone so far as to spell out ISIL. Puzzling to reporters and pundits, the use of ISIL by Obama has prompted a bevy of theories. ISIS was the original name of the al-Qaida offshoot. It's an acronym that stands for Islamic State in Syria and Iraq. But, months ago, ISIS changed its name to ISIL – the Islamic State in the Levant. More recently, ISIS chose to be known simply as Islamic State. The last S stands for Syria, the last L they don't want to have stand for Syria.. Todd apparently was suggesting the Obama administration would like Americans not to associate ISIS with Syria. Capitol Hill Democrats decided earlier this week to go with ISIL – but for multicultural reasons."}, {"url": "http://www.infowars.com/what-does-isis-really-stand-for/", "passage_text": "The reason for this is hidden in plain sight in the name itself: ISIS. In English, this stands for Islamic State in Iraq and Syria, but that’s not what it stands for in Arabic: ad-Dawlat al-Islamiyya fī’l-‘Iraq wa’sh-Sham: The Islamic State in Iraq and Ash-Sham. The crucial difference is the word Sham, a word that resonates in the Arabic-speaker’s mind on multiple levels."}, {"url": "http://www.independent.co.uk/news/world/middle-east/isis-vs-isil-vs-islamic-state-what-is-in-a-name-9731894.html", "passage_text": "The Islamic State of Iraq and Syria (Isis). The original name for the group in Arabic was Al-Dawla Al-Islamiya fi al-Iraq wa al-Sham. The first three words translate to the Islamic State of Iraq while “al-Sham” refers to Syria or an undefined region around Syria. Others still refer to the group as “Isis” - posing an issue for the various companies and brands around the world that already used the acronym or took it from the ancient Egyptian goddess of the same name. The group itself declared in June that it wants to be known as the Islamic State."}, {"url": "http://www.answers.com/Q/What_does_isl_stand_for", "passage_text": "ISL is the NATO country code for Iceland. French-German Research Institute of Saint-Louis, a military research centre. In mathematics, i.s.L. can stand for in the sense of Lyapunov. In resources mining, ISL stands for In-situ leaching, a mining technique. All you need is love, Love-Love is all you need. Could be any of the below or more. ISL-Institute for Sales Training and Leadership Development, international consulting and training institute."}, {"url": "http://www.cnn.com/2014/09/09/world/meast/isis-isil-islamic-state/index.html", "passage_text": "ISIS. ISIS is an English translation of the acronym in Arabic for Al-Dawla Al-Islamiya fi al-Iraq wa al-Sham, or the Islamic State in Iraq and al-Sham. The 'L' stands for Levant which is a translation of al-Sham -- the word the group uses to refer to itself, Bergen said. But the Levant is a relatively obscure word in English -- in English, we refer to Syria. Of course, the Levant is larger than Syria"}]