[{"url": "http://www.livestrong.com/article/320621-hemp-hearts-and-weight-loss/", "passage_text": "Source of Protein and Fiber. Hemp hearts are ideal to include in your weight-loss diet because of their protein and fiber content. A 3-tablespoon serving of hemp hearts contains 10 grams of protein and 3 grams of fiber. Eating high-protein foods when you're dieting, provided they're not excessively high in sugar or unhealthy fats, can help you feel fuller."}, {"url": "http://www.healing-source.com/hfwl/", "passage_text": "Hemp Hearts (shelled hemp seeds) are naturally balanced nutrition-a whole food, containing essential fatty acids (EFA's), protein, fiber, carbohydrates, natural vitamins and minerals but no cholesterol. The ratio of Omega 3 and Omega 6 EFA's in the oil component are in perfect balance for human health. WEIGHT LOSS: By taking Hemp Hearts (shelled hemp seeds) as directed, expect to be hunger free until mid-afternoon. Depending on your health and weight, you may choose to skip lunch altogether. You may restrict yourself to a salad in the evening and lose up to one pound per day."}, {"url": "http://www.livestrong.com/article/320621-hemp-hearts-and-weight-loss/", "passage_text": "Adopting a healthy diet and lifestyle in an effort to lose weight can improve your heart's health. Turning to a different heart -- the hemp heart -- can put you closer to your goal. Hemp hearts, which are the shelled interior of hemp seeds, are roughly the size of sesame seeds. A 3-tablespoon serving of hemp hearts contains 10 grams of protein and 3 grams of fiber. Eating high-protein foods when you're dieting, provided they're not excessively high in sugar or unhealthy fats, can help you feel fuller."}, {"url": "http://www.3fatchicks.com/how-hemp-can-help-you-lose-weight/", "passage_text": "Hemp protein powder can be blended with fruit and milk to make smoothies or stirred into a drink if you’d rather just have it with your morning orange juice. Clearly, hemp is another option for your diet regimen. That doesn’t have to mean fatty meats or cardboard-flavored foods. Hemp can help; it is a complete protein, meaning that it beats other plant-based protein sources you may choose to lower your caloric intake. Hemp has the 10 necessary amino acids that people need from their food."}, {"url": "http://www.shape.com/healthy-eating/diet-tips/ask-diet-doctor-hemp-seeds-hype", "passage_text": "Hemp protein also affords you a lot of the great nutrients found in hemp seeds such as magnesium, iron, and vitamin E. Best uses: Create this delicious nutrient-packed smoothie: Blend 1/4 cup hemp protein powder, 1 1/2 cups unsweetened vanilla almond milk, 1/2 cup blueberries, and 2 to 3 ice cubes until smooth. Hemp protein powder: If you do not eat very much or any animal protein, hemp protein is a valuable ally to you. It is almost a complete protein except that it is low in the amino acid lysine."}, {"url": "http://www.3fatchicks.com/how-hemp-can-help-you-lose-weight/", "passage_text": "How Hemp Works with Your Body. While working to lose weight, there are a couple of points that come up in almost any diet plan. One of the ideas that consistently comes up is that you need to limit your carbohydrate intake, especially refined carbohydrates. That doesn’t have to mean fatty meats or cardboard-flavored foods. Hemp can help; it is a complete protein, meaning that it beats other plant-based protein sources you may choose to lower your caloric intake. Hemp has the 10 necessary amino acids that people need from their food."}, {"url": "http://ezinearticles.com/?Lose-Weight-Fast-With-Hemp-Protein-Powder&id=4296307", "passage_text": "These are important when you are trying to tone up and lose weight. Hemp Protein Powder can be taken in water each day but is best added to smoothies or healthy shakes. When you want to lose weight and have low calorie but healthy meals-this is a great, quick balanced breakfast in a glass. Mixed with water or almond milk, ice, stevia, frozen fruit and some Micro Plant Powder-the rich earthy flavor of this natural vegetarian protein really shines. It is delicious and not overpowering. You want to lose weight quickly but still want to get the proper nutrition so that your body doesn't feel like it is starving yourself. If you don't get some protein into your diet, your body often tries to hold onto fat or use your own muscle to get the protein fuel that it needs to function."}, {"url": "http://hempbenefits.org/hemp-for-weight-loss/", "passage_text": "Although hemp protein powder, and hemp seeds, are great weight loss tools, they should be used in combination with diet and exercise to achieve maximum results. If dieters are unsure of what type of diet and exercise regimen could help them achieve the best results, they should contact a physician. "}, {"url": "http://on.aol.com/video/hemp-protein-to-lose-weight-517378662", "passage_text": "One serving of hemp powder contains 11 grams of ... protein, just about as much as two hardboiled eggs. Hemp is also hypoallergenic, easily digestible and the plant itself is environmentally friendly, as it sustains without much water. Tags: Hemp Protein to Lose Weight,benefits of hemp,diet advice,Dr. Jim Sears,hemp protein,losing weight,nutrition tips,protein sources,the doctors,TheDoctors,travis stork,weight loss tips."}, {"url": "http://healthyeating.sfgate.com/benefits-hemp-protein-6674.html", "passage_text": "Source of Good Fats. Dairy products and red meat are good sources of protein. However, they can be high in saturated fat. Hemp protein is low in saturated fat. Furthermore, it contains the essential fatty acids, omega-3 and omega-6, in an optimal three-to-one ratio. One particular benefit of eating hemp is that it provides protein. Consuming hemp protein also offers additional nutritional benefits and, as a result, hemp has become popular with people wanting to improve their health."}]