[{"url": "http://www.nbeub.ca/index.php/petroleum-products", "passage_text": "The PETROLEUM PRODUCTS PRICING ACT and REGULATION 2006-41 provide the legal framework for the setting of maximum prices for petroleum products in New Brunswick. The information provided is of a general nature to help those trying to understand how the system works. "}, {"url": "http://caa.ca/car_costs/", "passage_text": "Operating costs are variable, depending on how much you drive, the type of driving, and of course the price of fuel. The average Canadian drives 20,000 km a year. Budgeting for a vehicle is about much more than the price tag. The CAA Driving Costs calculator will walk you through the steps to better understanding the full cost of ownership. After you are done you can save and compare vehicles."}, {"url": "http://caa.ca/car_costs/", "passage_text": "Operating Costs for New & Used Vehicles. Operating costs are variable, depending on how much you drive, the type of driving, and of course the price of fuel. The average Canadian drives 20,000 km a year. The information below is pre-populated but to get a more accurate result, enter your own best estimates. Budgeting for a vehicle is about much more than the price tag. The CAA Driving Costs calculator will walk you through the steps to better understanding the full cost of ownership. After you are done you can save and compare vehicles."}, {"url": "http://www.travelmath.com/cost-of-driving/from/Ontario/to/New+Brunswick", "passage_text": "Road trip planner. The total cost of driving from Ontario to New Brunswick (one-way) is $141.73 at current gas prices. The round trip cost would be $283.45 to go from Ontario to New Brunswick and back to Ontario again. Regular fuel costs are around $3.12 per gallon for your trip. This calculation assumes that your vehicle gets an average gas mileage of 25 mpg for a mix of city and highway driving. All currency units are U.S. Dollar"}, {"url": "http://www.cbc.ca/nb/interactives/gasprices/chart.html", "passage_text": "CBC News estimates fuel price changes each week based on internal calculations. The Energy and Utilities Board sets the new maximum fuel prices at 12:01 a.m. every Thursday. "}, {"url": "http://caa.ca/car_costs/", "passage_text": "The CAA Driving Costs Calculator offers you two options to better understand the complete cost of operating a vehicle. Click on option 1 if you are curious about how much money it takes on average to drive a certain type of vehicle — such as an SUV or a sub-compact — for a year in your province. Budgeting for a vehicle is about much more than the price tag. The CAA Driving Costs calculator will walk you through the steps to better understanding the full cost of ownership. After you are done you can save and compare vehicles."}, {"url": "http://caa.ca/car_costs/", "passage_text": "CUTA also reports that the average cost of public transit in Canada is $2.59 per ride and $68.24 for a monthly pass. Below are costs for rides and monthly passes in major cities and provinces across Canada, provided by CUTA, to give you an idea of the cost of commuting by using transit. Budgeting for a vehicle is about much more than the price tag. The CAA Driving Costs calculator will walk you through the steps to better understanding the full cost of ownership. After you are done you can save and compare vehicles."}]