[{"url": "http://serverquestions.com/questions/edtu/how-to-unlink-onedrive-on-windows-8-1", "passage_text": "2 Answers. You can change the account you use with OneDrive, but you can't use the folder with multiple accounts at the same time. To change the account you use with OneDrive. Right-click the OneDrive icon (The OneDrive icon) in the notification area, at the far right of the taskbar, and then click Settings. On the Settings tab, click Unlink OneDrive. Restart OneDrive and sign in with the account you want to use. "}, {"url": "http://www.eightforums.com/tutorials/24814-onedrive-desktop-app-unlink-onedrive-your-windows-pc.html", "passage_text": "EXAMPLE: Linked and Unlinked OneDrive folder on PC NOTE: This is the OneDrive folder that is a copy of your OneDrive downloaded to and synced on your PC. Here's How: 1. Sign in to your user account on the Windows PC that you want to unlink OneDrive from. 2. Note When you unlink OneDrive, it will not remove the PC from OneDrive.com. If you are signed in to Windows 8 with a Microsoft account that is the same one used to sign in to OneDrive.com when setting up the OneDrive desktop app, then you will not be able to unlink OneDrive."}, {"url": "http://www.eightforums.com/tutorials/24814-onedrive-desktop-app-unlink-onedrive-your-windows-pc.html", "passage_text": "This tutorial will show you how to unlink OneDrive on your Vista, Windows 7, or Windows 8 PC to sign out of the OneDrive desktop app, stop syncing files in the OneDrive folder on your PC, and no longer fetch files on your PC from OneDrive.com until you setup the OneDrive desktop again. Note. Note When you unlink OneDrive, it will not remove the PC from OneDrive.com. If you are signed in to Windows 8 with a Microsoft account that is the same one used to sign in to OneDrive.com when setting up the OneDrive desktop app, then you will not be able to unlink OneDrive."}, {"url": "http://www.youtube.com/watch?v=WCuDBPPZ1mw", "passage_text": "Please try again later. This tutorial will show you how to unlink OneDrive on your Windows 10 PC to sign out of the OneDrive desktop app, stop syncing files in the OneDrive folder on your PC, and no longer fetch files on your PC from OneDrive.com until you setup the OneDrive desktop again. "}, {"url": "http://www.surfaceforums.net/threads/unlinking-with-onedrive-on-surface-pro-2.9071/", "passage_text": "0. I can't find how to unlink from OneDrive-I need to link with a different account. When I read instructions for a regular PC, it describes how to do this via the system tools area and right clicking on the onedrive icon to disconnect. This is not availableon the surface pro2. "}, {"url": "https://support.office.com/en-us/article/Turn-off-or-uninstall-OneDrive-f32a17ce-3336-40fe-9c38-6efb09f944b0", "passage_text": "On the Sync settings tab, under Sync settings with OneDrive, turn off the switch at Sync your settings on this PC. On the Metered connections tab, turn off all the switches. To hide OneDrive from File Explorer, open File Explorer and in the folder list on the left, right-click OneDrive and then click Properties. You might have to click the Show Hidden Icons arrow to find OneDrive. Click Settings, and on the Settings tab, uncheck all the boxes under General. On the Auto save tab, set the Documents and Pictures lists to This PC only, and uncheck the other boxes. On the Account tab, click Choose folders."}, {"url": "http://earthwithsun.com/questions/719095/how-to-unlink-onedrive-on-windows-8-1", "passage_text": "1 Answer. You can change the account you use with OneDrive, but you can't use the folder with multiple accounts at the same time. To change the account you use with OneDrive. Right-click the OneDrive icon (The OneDrive icon) in the notification area, at the far right of the taskbar, and then click Settings. On the Settings tab, click Unlink OneDrive. Restart OneDrive and sign in with the account you want to use. You'll need to select the location for your OneDrive folder again. "}, {"url": "http://superuser.com/questions/719095/how-to-unlink-onedrive-on-windows-8-1", "passage_text": "You can change the account you use with OneDrive, but you can't use the folder with multiple accounts at the same time. To change the account you use with OneDrive. Right-click the OneDrive icon (The OneDrive icon) in the notification area, at the far right of the taskbar, and then click Settings. On the Settings tab, click Unlink OneDrive. Restart OneDrive and sign in with the account you want to use. You'll need to select the location for your OneDrive folder again. If you select the same location, the folders for both accounts will be merged. "}, {"url": "http://www.ilovefreesoftware.com/18/windows-10/unlink-onedrive-with-microsoft-account-in-windows-10.html", "passage_text": "Click on the Settings tab (if not already selected by default), and under the Unlink OneDrive sub-section, click the Unlink OneDrive button. Here’s a screenshot: And we’re all set folks. You’ve successfully de-linked OneDrive from the Microsoft Account currently used to sign-in to Windows 10. "}]