[{"url": "https://en.wikipedia.org/wiki/Faux_painting", "passage_text": "Faux finishing has been used for millennia, from cave painting to the tombs of ancient Egypt, but what we generally think of as faux finishing in the decorative arts began with plaster and stucco finishes in Mesopotamia over 5,000 years ago. 1 Strie, strié from The french for stripe or, streak is a glazing technique that creates soft thin streaks of color using a paint. 2  Brush it is a technique often used to simulate fabrics such as linen and. 3  Denim rag painting or ragging is a glazing technique using twisted or bunched up rags to create a textural.  pattern"}, {"url": "https://en.wikipedia.org/wiki/Faux", "passage_text": "Faux /ˈfoʊ/ is a French word for false. The adjective has been adopted into the English language to describe an imitation or ersatz good. When manufacturing faux objects or materials, an attempt is often made to create products which will resemble the imitated items as closely as possible."}, {"url": "http://dictionary.cambridge.org/dictionary/english/faux", "passage_text": "faux adjective [before noun]. › not ​real, but made to ​look or ​seem ​real: faux ​fur a faux-brick ​wall. (Definition of faux from the Cambridge Advanced Learner’s Dictionary & Thesaurus © Cambridge University Press)."}, {"url": "http://www.ehow.com/video_4908462_definition-faux_.html", "passage_text": "The definition of faux is, it's French word, it means false or fake. And it's a word that's used to describe a finish that's meant to mimic another finish. For example, lets say you want to do a fireplace and you'd like it to be marble, but you can't afford a marble fireplace."}, {"url": "https://en.wikipedia.org/wiki/Faux_painting", "passage_text": "The term comes from the French word faux, meaning false, as these techniques started as a form of replicating materials such as marble and wood with paint, but has subsequently come to encompass many other decorative finishes for walls and furniture including simulating recognisable textures and surfaces. 1 Strie, strié from The french for stripe or, streak is a glazing technique that creates soft thin streaks of color using a paint. 2  Brush it is a technique often used to simulate fabrics such as linen and. 3  Denim rag painting or ragging is a glazing technique using twisted or bunched up rags to create a textural.  pattern"}, {"url": "http://dictionary.cambridge.org/dictionary/english/faux-pas", "passage_text": "faux pas noun [C]. › a ​remark or ​action in a ​social ​situation that is a ​mistake and ​causes embarrassment or ​offense: She made the faux pas of referring to Wales as “​part of England.”. faux pas noun [C]. › words or ​behaviour that are a ​social ​mistake or not ​polite: I made some ​remark about his wife's ​family, and then ​realized I'd made a ​serious ​faux ​pas. (Definition of faux pas from the Cambridge Advanced Learner’s Dictionary & Thesaurus © Cambridge University Press)."}, {"url": "https://en.wikipedia.org/wiki/Faux_painting", "passage_text": "Faux painting or faux finishing are terms used to describe decorative paint finishes that replicate the appearance of materials such as marble, wood or stone. 1 Strie, strié from The french for stripe or, streak is a glazing technique that creates soft thin streaks of color using a paint. 2  Brush it is a technique often used to simulate fabrics such as linen and. 3  Denim rag painting or ragging is a glazing technique using twisted or bunched up rags to create a textural.  pattern"}, {"url": "http://www.ehow.com/video_4908462_definition-faux_.html", "passage_text": "That's just one example of a faux finish. There are faux wood grains, there are faux stone techniques that you can use. If you're remodeling your home or you're building a new home, keep in mind that any place that you want to use a marble or a stone or a wood finish that the faux option is available to you. And it's a word that's used to describe a finish that's meant to mimic another finish. For example, lets say you want to do a fireplace and you'd like it to be marble, but you can't afford a marble fireplace."}, {"url": "http://www.thefreedictionary.com/faux", "passage_text": "1. faux-not genuine or real; being an imitation of the genuine article; it isn't fake anything; it's real synthetic fur; faux pearls; false teeth; decorated with imitation palm leaves; a purse of simulated alligator hide. imitation, simulated, fake, false. The surprise with which Kate, as she closed the room-door, beheld, close beside it, Newman Noggs standing bolt upright in a little niche in the wall like some scarecrow or Guy Faux laid up in winter quarters, almost occasioned her to call aloud."}, {"url": "http://www.ehow.com/video_4908462_definition-faux_.html", "passage_text": "5. Cancel. Faux means false, or fake, and it is often used to describe a finish that is intended to mimic another finish. Learn about faux marble finish and faux wood grains with help from a professional carpenter, woodworker and handyman in this free video on home improvement and decor. And it's a word that's used to describe a finish that's meant to mimic another finish. For example, lets say you want to do a fireplace and you'd like it to be marble, but you can't afford a marble fireplace."}]