[{"url": "http://www.wikihow.com/Cook-Tuna-Steak", "passage_text": "3. Grill the tuna steaks. Tuna steaks will usually need to cook for roughly 4 to 6 minutes per 1/2-inch (1.27-cm) thickness. Turn once in the middle of the cooking process to promote even cooking. 1  Leave the grill uncovered if using charcoal but cover it if using gas. Broil the tuna for 3 minutes per side. After 3 minutes, flip the tuna steaks over to the other side and return to the broiler for an additional 3 minutes or until done. 1  Place the broiler pan on the top rack of the oven, roughly 4 inches (10 cm) away from the top heating element."}, {"url": "http://www.bhg.com/recipes/fish/basics/how-to-cook-tuna/", "passage_text": "Searing tuna steaks in a hot skillet caramelizes the surfaces of the fish and locks in the moisture. Start with 3/4-inch-thick steaks. 1  Choose a heavy skillet that best fits the number of tuna steaks you are cooking. 2  Add 1 to 3 teaspoons cooking oil or olive oil to lightly coat the skillet. 3  Heat the skillet over medium-high heat until hot. 4  Add the tuna steaks"}, {"url": "http://www.foodnetwork.com/recipes/ina-garten/grilled-tuna-steaks-recipe.html", "passage_text": "Directions. To grill the tuna, get a charcoal or stove-top cast-iron grill very hot. Brush the fish with olive oil, and sprinkle with salt and pepper. Grill each side for only 2 to 2 1/2 minutes. The center should be raw, like sushi, or the tuna will be tough and dry. Allow to rest for 5 to 10 minutes and serve. "}, {"url": "http://www.bhg.com/recipes/fish/basics/how-to-cook-tuna/", "passage_text": "1 Heat the skillet over medium-high heat until hot. 2  Add the tuna steaks. 3  The steaks should sizzle when added. 4  Cook, uncovered, for 6 to 9 minutes or until fish begins to flake when tested with a fork but is still pink in the center, turning once during cooking. Start with 3/4-inch-thick steaks. 1  Choose a heavy skillet that best fits the number of tuna steaks you are cooking. 2  Add 1 to 3 teaspoons cooking oil or olive oil to lightly coat the skillet. 3 "}, {"url": "http://www.answers.com/Q/How_do_you_cook_tuna_steak", "passage_text": "Firstly the ingredients that you need would be four tuna steaks, 1/4 cup of olive oil, two teaspoons basil, three tablespoons white vinegar, two teaspoons oregano, a teaspoon of minced garlic, and two teaspoons mixed thyme and some pepper and salt would do. "}, {"url": "http://www.bhg.com/recipes/fish/basics/how-to-cook-tuna/", "passage_text": "1 Add the tuna steaks. 2  The steaks should sizzle when added. 3  Cook, uncovered, for 6 to 9 minutes or until fish begins to flake when tested with a fork but is still pink in the center, turning once during cooking. 4  Adjust the heat as needed if the skillet gets too hot. Start with 3/4-inch-thick steaks. 1  Choose a heavy skillet that best fits the number of tuna steaks you are cooking. 2  Add 1 to 3 teaspoons cooking oil or olive oil to lightly coat the skillet. 3  Heat the skillet over medium-high heat until hot."}, {"url": "http://allrecipes.com/recipe/39455/marinated-tuna-steak/", "passage_text": "1 Preheat grill for high heat. 2  Lightly oil grill grate. 3  Cook the tuna steaks for 5 to 6 minutes, then turn and baste with the marinade. 4  Cook for an additional 5 minutes, or to desired doneness. 5  Discard any remaining marinade. 1 Place the tuna steaks in the marinade and turn to coat. 2  Cover, and refrigerate for at least 30 minutes. 3  Preheat grill for high heat. 4  Lightly oil grill grate. 5  Cook the tuna steaks for 5 to 6 minutes, then turn and baste with the marinade. 6  Cook for an additional 5 minutes, or to desired doneness."}, {"url": "http://www.food.com/recipe/grilled-tuna-steak-48824", "passage_text": "1 Mix Well. 2  Pour over Tuna Steaks and marinade 20 minutes, turning occasionally. 3  Make sure grill is hot – place steaks in hottest section and Sear steaks 1 to 2 minutes per side to seal in the juices. 4  Finish cooking just slightly away from the hottest area – 8 to 10 minutes per inch of thickness. 1 Pour over Tuna Steaks and marinade 20 minutes, turning occasionally. 2  Make sure grill is hot – place steaks in hottest section and Sear steaks 1 to 2 minutes per side to seal in the juices. 3  Finish cooking just slightly away from the hottest area – 8 to 10 minutes per inch of thickness."}]