[{"url": "https://en.wikipedia.org/wiki/Biofeedback", "passage_text": "Biofeedback may be used to improve health, performance, and the physiological changes that often occur in conjunction with changes to thoughts, emotions, and behavior. Eventually, these changes may be maintained without the use of extra equipment, for no equipment is necessarily required to practice biofeedback. Biofeedback has been found to be effective for the treatment of headaches and migraines."}, {"url": "http://psychotherapy.com/bio.html", "passage_text": "Biofeedback is a treatment technique in which people are trained to improve their health by using signals from their own bodies. Physical therapists use biofeedback to help stroke victims regain movement in paralyzed muscles. Psychologists use it to help tense and anxious clients learn to relax. "}, {"url": "http://www.webmd.boots.com/pain-management/guide/biofeedback-therapy", "passage_text": "The biofeedback can help motivate a person to improve the technique. Biofeedback can help a person gain more control over some of the body's functions that they don’t usually think about. Biofeedback may also help with migraine headaches, chronic pain, incontinence and high blood pressure. The idea behind biofeedback is that, by harnessing the power of your mind and becoming aware of what's going on inside your body, you may gain more control over your health. Researchers aren't exactly sure how or why biofeedback works. They do know that biofeedback promotes relaxation, which can help relieve a number of conditions that are related to stress; but there is limited research on this treatment. During a biofeedback session, electrodes are attached to your skin."}, {"url": "http://www.medicalnewstoday.com/articles/265802.php", "passage_text": "Biofeedback therapy involves training patients to control physiological processes such as muscle tension, blood pressure, or heart rate. These processes usually occur involuntarily, however, patients who receive help from a biofeedback therapist can learn how to completely manipulate them at will. Biofeedback is typically used to treat chronic pain, urinary incontinence, high blood pressure, tension headache, and migraine headache. The three most common types of biofeedback therapy are: 1  Thermal biofeedback-which measures skin temperature. 2  Electromyography-measures muscle tension"}, {"url": "http://www.medicalnewstoday.com/articles/265802.php", "passage_text": "Biofeedback is particularly effective at treating conditions brought on by severe stress. When a person is stressed, their internal processes such as blood pressure can become irregular. Biofeedback therapy teaches these patients certain relaxation and mental exercises which can alleviate their symptoms. These processes usually occur involuntarily, however, patients who receive help from a biofeedback therapist can learn how to completely manipulate them at will. Biofeedback is typically used to treat chronic pain, urinary incontinence, high blood pressure, tension headache, and migraine headache."}, {"url": "http://www.webmd.com/a-to-z-guides/biofeedback-therapy-uses-benefits", "passage_text": "It's called biofeedback, and the therapy is used to help prevent or treat conditions, including migraine headaches, chronic pain, incontinence, and high blood pressure. Researchers aren't exactly sure how or why biofeedback works. They do know that biofeedback promotes relaxation, which can help relieve a number of conditions that are related to stress. During a biofeedback session, electrodes are attached to your skin."}, {"url": "https://en.wikipedia.org/wiki/Biofeedback", "passage_text": "The definition reads: Biofeedback is a process that enables an individual to learn how to change physiological activity for the purposes of improving health and performance. Precise instruments measure physiological activity such as brainwaves, heart function, breathing, muscle activity, and skin temperature. Biofeedback has been found to be effective for the treatment of headaches and migraines."}, {"url": "http://www.webmd.boots.com/pain-management/guide/biofeedback-therapy", "passage_text": "Biofeedback therapy. Biofeedback is a non-invasive treatment the NHS may recommend for conditions, including constipation, urinary incontinence and faecal incontinence. Special sensors are used to check what the body or specific muscles are doing and a device gives feedback to the person. Researchers aren't exactly sure how or why biofeedback works. They do know that biofeedback promotes relaxation, which can help relieve a number of conditions that are related to stress; but there is limited research on this treatment. During a biofeedback session, electrodes are attached to your skin."}, {"url": "http://www.montefiore.org/documents/what%20is%20biofeedback-%20nih%20handout.pdf", "passage_text": "Biofeedback is a treatment technique in which people are trained to improve their health by using signals from their own bodies. Physical therapists use biofeedback to help stroke victims regain movement in paralyzed muscles. Psychologists use it to help tense and anxious clients learn to relax. "}, {"url": "http://www.healthline.com/health/biofeedback", "passage_text": "Overview. Biofeedback is a type of therapy where sensors attached to your body measure key body functions. Biofeedback is intended to help you learn more about how you body works, so that you can develop better control over certain body functions and address health concerns"}]