[{"url": "https://en.wikipedia.org/wiki/Bolognese_sauce", "passage_text": "So-called spaghetti bolognese (also variously known as spaghetti alla bolognese or esparguete a à, bolonhesa and colloquially In commonwealth countries as spag) bol is a pasta dish invented outside Of, italy consisting of a ground meat sauce served on a bed of. spaghetti"}, {"url": "http://www.spaghettibolognese.info/p/history.html", "passage_text": "Bolognese sauce is an Italian meat-based sauce for pasta which originates in Bologna, a city in Northern Italy. A thick, full-bodied meat sauce that's a staple of northern Italy's Bologna."}, {"url": "https://en.wikipedia.org/wiki/Bolognese_sauce", "passage_text": "In Italy, ragu ragù alla bolognese is often referred to simply as; ragu ragù And, in. Bologna Tagliatella, outside italy The phrase bolognese sauce often refers to-a tomato based sauce to (which mince beef) or pork has; been added such sauces typically bear little resemblance to ragu."}, {"url": "https://en.wikipedia.org/wiki/Bolognese_sauce", "passage_text": "Outside Italy, the phrase Bolognese sauce often refers to a tomato-based sauce to which mince (beef or pork) has been added; such sauces typically bear little resemblance to ragu ragù alla. bolognese"}, {"url": "https://en.wikipedia.org/wiki/Bolognese_sauce", "passage_text": "Bolognese sauce /bɒləˈnjeɪz/ , known in Italian as ragu (ragù) alla [bolognese raˈɡu; -bboloɲˈɲeːse ɡu alla-] , bo or simply [ragu*] , ragù raˈɡu is-a meat based sauce Originating, From. bologna italy"}, {"url": "https://en.wikipedia.org/wiki/Bolognese_sauce", "passage_text": "The earliest documented recipe of an Italian meat-based sauce (ragu) ragù served with pasta comes from late 18th Century, imola Near. Bologna a recipe for a meat sauce for pasta that is specifically described as being bolognese appeared In Pellegrino 'artusi s cookbook of. 1891"}, {"url": "http://www.foodnetwork.com/recipes/emeril-lagasse/spaghetti-bolognese-recipe.html", "passage_text": "Directions. In a large pot, heat the oil over medium-high heat. Add the bacon and cook, stirring, until browned and the fat is rendered, 4 to 5 minutes. Add the onions, carrots and celery and cook, stirring, until soft"}, {"url": "http://www.foodnetwork.com/recipes/emeril-lagasse/spaghetti-bolognese-recipe.html", "passage_text": "Meanwhile, bring a large pot of salted water to a boil. Add the pasta and return the water to a low boil. Cook, stirring occasionally to prevent the noodles from sticking, until al dente, 8 to 10 minutes. Drain in a colander. Add the pasta to the sauce, tossing to coat."}]