[{"url": "http://www.mananatomy.com/basic-anatomy/neuromuscular-junction", "passage_text": "Synapses and neuromuscular junctions are physiologically the same, however, the neuromuscular junction is a specific type of synapse that occurs between motor neuron and muscle fiber. At other places in the body, such as the Central Nervous System, the structure with similar role is known as synapse. Synaptic cleft is the space between the motor end plate (muscle fiber part) and synaptic end bulb (motor neuron part) of the neuromuscular junction. It is 20 to 30 nanometers wide. Because of this cleft, the connection between the motor neuron and the muscle fiber is not continuous and there is a break"}, {"url": "http://www.ivyroses.com/HumanBody/Muscles/Muscle_Anatomy-Neuromuscular-Junction.php", "passage_text": "Each neuromuscular junction consists of the axon terminal of a motor neuron and the motor end plate of a muscle fibre. : 1  The long processes of neurones are called axons. : 2  The part of the sarcolemma of the muscle cell that is in closest proximity to the synaptic end bulb is called the  motor end plate . A single motor neurone together with all of the muscle fibers (muscle cells) to which it is attached, and therefore stimulates, is called a motor unit. 1  Stimulation of the. 2  neurone of a motor unit results in simultaneous contraction of. 3  of the muscle cells in that"}, {"url": "http://study.com/academy/lesson/the-neuromuscular-junction-function-structure-physiology.html", "passage_text": "A neuromuscular junction is a synapse between a motor neuron and skeletal muscle. This lesson describes the events of synaptic transmission leading to contraction of skeletal muscle. Myasthenia gravis is described as a neuromuscular disease. "}, {"url": "http://www.mananatomy.com/basic-anatomy/neuromuscular-junction", "passage_text": "Neuromuscular junction can be defined as a synapse the motor neuron and the muscle fiber. Actually the synapse occurs between the “synaptic end bulbs” of the motor neuron and “motor end plate ” of muscle fiber. The motor end plate is in fact the highly excitable region of muscle fiber plasma membrane and it is responsible for initiating action potentials across the muscle surface. Synaptic cleft is the space between the motor end plate (muscle fiber part) and synaptic end bulb (motor neuron part) of the neuromuscular junction. It is 20 to 30 nanometers wide. Because of this cleft, the connection between the motor neuron and the muscle fiber is not continuous and there is a break"}, {"url": "https://answers.yahoo.com/question/index?qid=20090105093453AAuM7hO", "passage_text": "Answers. Best Answer: &nbsp The neuromuscular junction consists of the axon terminal of the neuron, the motor end plate, the muscle fiber, and the myofibril on an overview. "}, {"url": "http://www.els.net/WileyCDA/ElsArticle/refId-a0023202.html", "passage_text": "The neuromuscular junction (NMJ) is the site of communication between motor nerve axons and muscle fibres. It is composed of four specialised cell types: motor neurons, Schwann cells, muscle fibres and the recently discovered kranocytes. Key Concepts: The somatic neuromuscular junction is the site of communication between motor neurons and skeletal muscle fibres. Specialisations of the neuromuscular junction mean that activity in and release of transmitter from motor neurons produces contraction of skeletal muscle fibres rapidly and reliably."}, {"url": "https://en.wikipedia.org/wiki/Neuromuscular_junction", "passage_text": "A neuromuscular junction (sometimes called a myoneural junction) is a junction between nerve and muscle; it is a chemical synapse formed by the contact between the presynaptic terminal of a motor neuron and the postsynaptic membrane of a muscle fiber. Muscles will contract or relax when they receive signals from the nervous system. The neuromuscular junction is the site of the signal exchange. The steps of this process in vertebrates occur as follows:(`) The action potential reaches the axon terminal. (2) Voltage-dependent calcium gates open, allowing calcium to enter the axon terminal"}]