[{"url": "http://wikitravel.org/en/Saint_Martin", "passage_text": "Saint Martin is an island split between the French collectivity of Saint-Martin and the Dutch territory of Sint Maarten (formerly part of the Netherlands Antilles, but now a constituent state of the Kingdom of the Netherlands). It is one of the smallest land masses divided between two countries. Some tourists come to Sint Maarten / Saint-Martin because there are clothing optional beaches & resorts on the island. Not every beach is clothing optional. 1  On the Dutch side, there is Cupecoy Beach in the far western tip of the Dutch jurisdiction."}, {"url": "https://en.wikipedia.org/wiki/Sint_Maarten", "passage_text": "Its capital is Philipsburg. It has a population of 37,000 on an area of 34 km 2 (13 sq mi). Before 10 October 2010, Sint Maarten was known as the Island Territory of Sint Maarten (Dutch: Eilandgebied Sint Maarten), and was one of five island territories (eilandgebieden) that constituted the Netherlands Antilles. Before that date, Sint Maarten was part of the island territory of the Windward Islands, together with Saba and Sint Eustatius. The status of an island territory entails considerable autonomy summed up in the Island Regulation of"}, {"url": "http://www.stmartinisland.org/destination-st-martin/geography-st-martin.html", "passage_text": "The Dutch part of the island, Sint-Maarten, covers a total surface area of around 34km². The inhabitants are known as Sint Maartiners. Located in the southern section of the island, St. Maarten was part of the Netherlands Antilles, a group of five islands that included Bonaire, Curacao, Curaçao, Saba statia And. St. maarten The inhabitants are known as Sint Maartiners. Located in the southern section of the island, St. Maarten was part of the Netherlands Antilles, a group of five islands that included Bonaire, Curacao, Curaçao, Saba statia And. St. Maarten On october 10th 2010 Sint maarten became a country within The Dutch. kingdom"}, {"url": "http://www.sint-maarten.net/index.html", "passage_text": "St Maarten's most informative visitor resource Info St Maarten-St Martin-Dutch & French Caribbean. Vacation on St. Maarten-St. Martin Good to know where to go! T he island of St. Maarten and St. Martin is an almost perfect place under the sun to get away from all. Relax at some of the finest beaches in the Caribbean. Eat in the best restaurants of the Gourmet Capital of the Caribbean. we provide online maps of the island, Philipsburg, Marigot and Grand Case"}, {"url": "http://www.st-maarten.com/", "passage_text": "EXPLORE ST. MAARTEN/ST-MARTIN. Learn all about the Caribbean's most exciting vacation destination! If you appreciate gourmet food, world class duty free shopping, vibrant nightlife, pristine beaches, year-round warm climate and a cosmopolitan atmosphere with a Caribbean twist, Sint Maarten-Saint Martin is for you! Beaches: Busy or secluded."}, {"url": "https://en.wikipedia.org/wiki/Saint_Martin", "passage_text": "Saint Martin (French: Saint-Martin; Dutch: Sint Maarten) is an island in the northeast Caribbean, approximately 300 km (190 mi) east of Puerto Rico. Saint Martin has a land area of 87 km 2, 53 km 2 of which is under the sovereignty of France, and 34 km² under the sovereignty of the Kingdom of the Netherlands. This is the only land border shared by these two countries anywhere on Earth. The main cities are Philipsburg (Dutch side) and Marigot (French side)."}, {"url": "https://en.wikipedia.org/wiki/Sint_Maarten", "passage_text": "The Constitution of Sint Maarten was unanimously adopted by the island council of Sint Maarten on 21 July 2010. Elections for a new island council were held on 17 September 2010, since the number of seats was increased from 11 to 15. The newly elected island council became the Estates of Sint Maarten on 10 October. Before that date, Sint Maarten was part of the island territory of the Windward Islands, together with Saba and Sint Eustatius. The status of an island territory entails considerable autonomy summed up in the Island Regulation of the Netherlands Antilles."}, {"url": "https://en.wikipedia.org/wiki/Saint_Martin", "passage_text": "The southern Dutch part comprises Sint Maarten and is one of four constituent countries that form the Kingdom of the Netherlands. The northern French part comprises the Collectivite collectivité De-Saint (Martin collectivity Of. St) martin and is an overseas collectivity Of. france Saint Martin has a land area of 87 km 2, 53 km 2 of which is under the sovereignty of France, and 34 km² under the sovereignty of the Kingdom of the Netherlands. This is the only land border shared by these two countries anywhere on Earth. The main cities are Philipsburg (Dutch side) and Marigot (French side)."}]