[{"url": "https://en.wikipedia.org/wiki/Azuki_bean", "passage_text": "The name adzuki is a transliteration of the native Japanese name. Japanese also has a Chinese loanword, shōzu (小豆) , which means small bean, its counterpart large bean (大豆, daizu) being the soybean. It is common to write 小豆 in kanji but pronounce it as azuki listen (help·info) , an example of ateji. Adzuki beans are also used to produce amanattō, and as a popular flavour of ice cream either paste, or whole bean such as the 'Cream & Red Bean' product produced by IMEI. On October 20, 2009, Pepsi Japan released an adzuki-flavored Pepsi product."}, {"url": "http://www.bbcgoodfood.com/glossary/aduki-bean", "passage_text": "Soak beans overnight in water. Drain and simmer in water for an hour. Alternatively, pressure cook the soaked beans in 2 cups of water for 5-9 minutes at high pressure. If you don't have time to soak the beans, pressure cook for 15-20 minutes. Aduki bean. Pronounce it: a-dook-ee beens. The aduki bean is a tiny, reddish-brown bean with a cream coloured seam and sweet, nutty flavour. It is particularly popular in Asian cooking, most often used for sweet dishes including soups, desserts and as a dim sum filling."}, {"url": "http://healthyeating.sfgate.com/adzuki-bean-good-you-4205.html", "passage_text": "Adzuki beans are usually used dried. Adzuki beans are a relatively sweet red bean which can be used green in the pod, dried or in sprouted form. Dried beans, like adzuki beans, may lower your risk for cancer, diabetes and heart disease. They are a low-fat protein source that is rich in vitamins and minerals. A 1-cup serving of cooked dried adzuki beans contains 294 calories, 17 grams of protein and 57 grams of carbohydrates, including 17 grams of fiber. These beans only contain trace amounts of fat."}, {"url": "http://www.livestrong.com/article/299196-nutrition-information-regarding-adzuki-beans/", "passage_text": "Sweet and nutty, the adzuki bean is a small red-brown bean frequently used in Japanese desserts. Like other legumes, the adzuki bean is a nutritional powerhouse, rich in protein, fiber and folic acid. Knowing the nutrition information for the little red bean can help you see its benefits in your diet."}, {"url": "http://www.healthdiaries.com/eatthis/7-health-benefits-of-adzuki-beans.html", "passage_text": "Heart Health. Adzuki beans are an excellent source of soluble fiber, which helps to keep cholesterol levels in a healthy range. Lower cholesterol is associated with a lower risk of heart disease. They also contain folate, potassium, and magnesium, all of which are essential for a healthy heart. Adzuki beans are popular in Asian cooking and are often served with rice or turned into a paste and used in desserts. They were first cultivated between 4000 BC and 2000 BC."}, {"url": "https://en.wikipedia.org/wiki/Red_bean_paste", "passage_text": "Red bean paste or adzuki bean paste is a dark red, sweet bean paste. It is used in Japanese confectionery, Chinese cuisine, and Korean cuisine. It is prepared by boiling and mashing adzuki beans and then sweetening the paste with sugar or honey. "}, {"url": "https://en.wikipedia.org/wiki/Azuki_bean", "passage_text": "The adzuki bean (Vigna angularis; from the Japanese アズキ（小豆） (azuki) , sometimes transliterated as azuki or aduki) is an annual vine widely grown throughout East Asia and the Himalayas for its small (approximately 5 mm) bean. The cultivars most familiar in Northeast Asia have a uniform red colour. Adzuki beans are also used to produce amanattō, and as a popular flavour of ice cream either paste, or whole bean such as the 'Cream & Red Bean' product produced by IMEI. On October 20, 2009, Pepsi Japan released an adzuki-flavored Pepsi product."}, {"url": "http://allrecipes.com/recipe/47635/kale-and-adzuki-beans/", "passage_text": "1 Place adzuki beans in a medium saucepan with enough water to cover. 2  Bring to a boil, reduce heat, and simmer 30 to 45 minutes, until tender. 3  Heat olive oil in a medium skillet over medium heat, and saute garlic about 1 minute. 4  Mix in kale and 2 tablespoons water. Directions. Prep. Cook. Ready In. 1 "}, {"url": "http://www.differencebetween.com/difference-between-adzuki-beans-and-vs-red-beans/", "passage_text": "Adzuki beans or the Vigna angularis are also referred to as red beans, as a result, of its colour. However, not all adzuki beans are red since white, black, grey and mottled varieties too are also known although it is the red variety that is the most popular in Asian cuisine. "}, {"url": "http://www.vegetariantimes.com/article/healing-foods-adzuki-beans/", "passage_text": "Adzuki Beans. Legumes are loaded with antioxidants, and adzuki beans are no exception. The small, dark red beans have a sweet, nutty flavor and are often used in Asian desserts. They are easy to digest and filled with flavonoids, which are part of a bigger family of antioxidants called polyphenols. "}]