[{"url": "https://msdn.microsoft.com/en-us/library/office/ff193927.aspx", "passage_text": "Table Name. The name of the Access table to import spreadsheet data to, export spreadsheet data from, or link spreadsheet data to. You can also type the name of the Access select query you want to export data from. This is a required argument"}, {"url": "http://www.ehow.com/how_6789791_import-excel-spreadsheets-access.html", "passage_text": "Many spreadsheet users take advantage of the database features in Microsoft Excel when working with their spreadsheet data. Simple search, sort and filter functions are available using the Data menu within Excel. Microsoft Access is a full-featured, relational database that is compatible with Microsoft Excel. Provide a name for the file when prompted. Click File, Get External Data, Import and select the Excel format. Locate your spreadsheet subdirectory and import your spreadsheet into Microsoft Access."}, {"url": "http://www.ehow.com/how_6789791_import-excel-spreadsheets-access.html", "passage_text": "Start Microsoft Access and open the database into which you want to import your Excel data. You can create a new, empty database in Access by clicking File, New and selecting the Blank Database option. Provide a name for the file when prompted. Click File, Get External Data, Import and select the Excel format. Locate your spreadsheet subdirectory and import your spreadsheet into Microsoft Access. If you are using Microsoft Access version 7, you can also click the External Data tab at the top of your screen and select Excel as the format to import the spreadsheet data"}, {"url": "https://support.office.com/en-us/article/Import-or-link-to-data-in-an-Excel-workbook-07CC0CC8-31D2-4B88-B3ED-190639BE1CA4", "passage_text": "You can bring the data from a Microsoft Office Excel 2007 workbook into Microsoft Office Access 2007 in many ways. You can copy data from an open worksheet and paste it into an Access datasheet, import a worksheet into a new or existing table, or link to a worksheet from an Access database. This topic explains in detail how to import or link to Excel data from Access."}, {"url": "https://msdn.microsoft.com/en-us/library/office/ff193927.aspx", "passage_text": "You can use the ImportExportSpreadsheet action to import or export data between the current Access database (.mdb or .accdb) or Access project (.adp) and a spreadsheet file. You can also link the data in a Microsoft Excel spreadsheet to the current Microsoft Access database. The name of the Access table to import spreadsheet data to, export spreadsheet data from, or link spreadsheet data to. You can also type the name of the Access select query you want to export data from. This is a required argument"}, {"url": "https://support.microsoft.com/en-us/kb/141228", "passage_text": "1 Start Microsoft Access 2.0 and open the database you want to import the Microsoft Excel information into. 2  On the File menu, click Import. 3  From the Import dialog box, choose the appropriate version of Microsoft Excel that you are importing and click the OK button. 4  Microsoft Excel 7.0 files are not on this list. To import a Microsoft Excel file in Microsoft Access 2.0. 1  Save the file in Microsoft Excel using standard database formatting listed above. 2  Close the file. 3  Start Microsoft Access 2.0 and open the database you want to import the Microsoft Excel information into. 4  On the File menu, click Import."}, {"url": "https://support.microsoft.com/en-us/kb/141228", "passage_text": "To import a Microsoft Excel file in Microsoft Access 2.0. 1  Save the file in Microsoft Excel using standard database formatting listed above. 2  Start Microsoft Access 2.0 and open the database you want to import the Microsoft Excel information into. 3  On the File menu, click Import. To import a Microsoft Excel file in Microsoft Access 2.0. 1  Save the file in Microsoft Excel using standard database formatting listed above. 2  Close the file. 3  Start Microsoft Access 2.0 and open the database you want to import the Microsoft Excel information into. 4  On the File menu, click Import."}, {"url": "https://support.microsoft.com/en-us/kb/141228", "passage_text": "1 Start Microsoft Access 7.0 and open the database you want to import the Microsoft Excel information into. 2  On the File menu, click Get External Data and then click Import. 3  From the import dialog box, choose Microsoft Excel (*.xls) for the Files Of Type option. To import a Microsoft Excel file in Microsoft Access 2.0. 1  Save the file in Microsoft Excel using standard database formatting listed above. 2  Close the file. 3  Start Microsoft Access 2.0 and open the database you want to import the Microsoft Excel information into. 4  On the File menu, click Import."}]