[{"url": "http://www.zillow.com/advice-thread/Can-anyone-give-me-a-cost-estimate-to-add-a-bathroom-and-250-300-sq-ft-addition/475386/", "passage_text": "(40sqft). Cost on adding a bathroom depends if you have an existing room or if you will be adding a new roof to cover the new room. The latter is the most expensive as you will have framing costs (and permits and blueprints,etc) and could cost $10-$15k. Can anyone give me a cost estimate to add a bathroom and 250-300 sq ft addition... I'm looking for a general cost to add a bathroom and about 250-300 sq ft. The bathroom would be a 3 piece-toilet, stand up shower (tiled w/glass doors) and double vanity."}, {"url": "http://home.costhelper.com/bathroom-addition.html", "passage_text": "1 Remodeling Magazine pegs the price of a 6x8-foot bathroom addition at averages of $33,188-$41,195 in the Midwest, $34,876-$42,491 along the East Coast and $35,987-$47,052 in the Western states. 2  For a spa-quality 100-square-foot master bath the survey says it averages $75,812 nationwide. Typical costs: 1  Converting existing floor space inside a garage, basement or attic into a simple bathroom starts around $3,000-$6,000. 2  However, costs can be $7,000-$25,000 or more for a more luxurious bathroom, or if the new bathroom is far from existing water and sewer lines."}, {"url": "http://home.costhelper.com/bathroom-addition.html", "passage_text": "1 Hiring an architect to create a set of plan drawings could cost you a flat fee of $700-$30,000 or more, depending on size and complexity, or the architect may charge 5-15 percent of the project's costs. Typical costs: 1  Converting existing floor space inside a garage, basement or attic into a simple bathroom starts around $3,000-$6,000. 2  However, costs can be $7,000-$25,000 or more for a more luxurious bathroom, or if the new bathroom is far from existing water and sewer lines."}, {"url": "http://www.ehow.com/about_5592249_much-cost-add-bathroom_.html", "passage_text": "Cost. In late 2009, converting existing floor space in an area such as a garage, basement or attic to include a bathroom cost between $3,000 and $6,000. Depending on the extravagance of the bathroom and its distance away from plumbing lines, it could cost between $7,000 and $25,000 or more. Those concerned with the cost of adding a bathroom to a home should note that such cost varies, and there are typically satisfactory projects for almost any budget. (Jupiterimages/Creatas/Getty Images). Types. There are two main types of bathrooms that can be added to a home: a full bath and a half-bath."}, {"url": "http://www.ehow.com/about_5592249_much-cost-add-bathroom_.html", "passage_text": "Adding a half-bathroom will fall in the lower end of the cost spectrum, as a half-bath requires only a toilet and a sink. If you have to add additional floor space to your home to add a bathroom, expect to pay $25,000 to $50,000 and up, depending on complexity and local labor rates. Those concerned with the cost of adding a bathroom to a home should note that such cost varies, and there are typically satisfactory projects for almost any budget. (Jupiterimages/Creatas/Getty Images). Types. There are two main types of bathrooms that can be added to a home: a full bath and a half-bath."}, {"url": "http://www.trulia.com/voices/Remodel_and_Renovate/How_much_does_it_cost_to_add_arond_sft_to_the_exi-386842", "passage_text": "It depends. If you add something simple like a bedroom or family room the cost will be $100 to $150 per sq foot. If the add-on includes a bathroom, it will be much more. It also depends on your existing home. The amount of money that it will cost depends on what you want in the room addition. Recently, one of my clients asked for bids for a 400 square foot room addition for his home. The bids that he received were in the range of $35,000 to $45,000."}, {"url": "http://money.usnews.com/money/personal-finance/articles/2014/09/17/4-questions-to-consider-before-adding-onto-your-home", "passage_text": "How much will you spend? The cost of an addition varies widely depending on the type of room and where you live. But just to give you a sense of how much it might cost, CostHelper.com estimates that adding a bathroom or bedroom could run from $25,000 to $50,000. A bedroom could easily cost just as much. A large room, such as a family room, could run as high as $100,000. "}, {"url": "http://home.costhelper.com/bathroom-addition.html", "passage_text": "1 Adding new floor space to your home for a basic 6x8-foot bathroom addition starts around $25,000-$50,000 and goes up depending on complexity, quality of fixtures, number of amenities and local labor rates. Typical costs: 1  Converting existing floor space inside a garage, basement or attic into a simple bathroom starts around $3,000-$6,000. 2  However, costs can be $7,000-$25,000 or more for a more luxurious bathroom, or if the new bathroom is far from existing water and sewer lines."}, {"url": "http://www.reliableremodeler.com/ask/how-much-does-it-cost-to-add-a-bathroom-on-to-a-house/", "passage_text": "Getting water supply and drain lines to the addition can also greatly affect your project's final cost. A good price range for a bathroom addition might be $150 to $250 a square foot and where you end up can depend on just how expensive your tastes happen to be. If you visit a local home improvement store around Griffin, it should be easy to see just how much fixtures can vary in cost. We have a small 3BR/1BA house and would like to add a full bath onto the main level of our home. The new bathroom would be about 10'x10' and would be on a new slab foundation connected to the back gable end of the house."}, {"url": "http://www.victoriana.com/Bathroom/extra-bathroom.html", "passage_text": "3) Check floor joists when you add a bathroom: conventional fixtures weigh up to 20 pounds per square foot; tile in mortar up to 30 pounds. On spans over 11 feet, better double 2x8 joists on 16 inch centers. 4) How to add a bathroom to a small space? Have the door swing out, or install a sliding pocket door. "}]