[{"url": "http://www.mayoclinic.org/diseases-conditions/swollen-lymph-nodes/basics/symptoms/CON-20029652", "passage_text": "Your lymphatic system comprises a network of organs, vessels and numerous lymph nodes situated throughout your body. Most of your lymph nodes are located in your head and neck region. Lymph nodes that frequently swell are in this area, as well as in your armpits and groin area. "}, {"url": "http://www.webmd.com/pain-management/swollen-glands", "passage_text": "Your lymph nodes are small, round, or bean-shaped masses of tissue found throughout your body. They are part of your immune system -- more specifically the lymphatic system -- that helps your body fight infection and disease. You're probably already familiar with the lymph nodes in your neck, but there are hundreds of other lymph nodes scattered throughout your body. Other areas where you may be able to feel swollen lymph nodes include: 1  Behind the ears. 2  Under the jaw. 3  Lower part of the back of the head."}, {"url": "http://www.webmd.com/a-to-z-guides/swollen-lymph-nodes-topic-overview", "passage_text": "Lymph nodes are small, bean-shaped glands throughout the body. They are part of the lymph system, which carries fluid (lymph fluid), nutrients, and waste material between the body tissues and the bloodstream. The lymph system is an important part of the immune system, the body's defense system against disease. "}, {"url": "http://www.thelymphnodes.com/locations/", "passage_text": "Lymph Node Locations. Throughout your body, there are locations where lymph nodes are found. They are small and bean-shaped that are found in groups that filter lymph fluid throughout specific areas of the body. "}, {"url": "http://ww5.komen.org/BreastCancer/LymphNodeStatus.html", "passage_text": "Lymph nodes are small clumps of immune cells that act as filters for the lymphatic system. The lymphatic system runs throughout the body (like the circulatory (blood) system) and carries fluid and cells. The lymph nodes in the underarm (the axillary lymph nodes) are the first place breast cancer is likely to spread. "}, {"url": "http://www.medicinenet.com/image-collection/lymph_nodes_picture/picture.htm", "passage_text": "Lymph node: Also sometimes referred to as lymph glands, lymph nodes are small rounded or bean-shaped masses of lymphatic tissue surrounded by a capsule of connective tissue. Lymph nodes are located in many places in the lymphatic system throughout the body. Lymph nodes filter the lymphatic fluid and store special cells that can trap cancer cells or bacteria that are traveling through the body in the lymph fluid."}, {"url": "http://www.wikihow.com/Check-Lymph-Nodes", "passage_text": "Know where the lymph nodes are located. You have the highest concentration of lymph nodes in your neck, around your collarbone, in your armpits, and in your groin. 1  Lymph nodes are present in groups, and are about the size of a pea or bean. 2  Lymph nodes located in the groin are also called inguinal lymph nodes. Check the lymph nodes on your neck and collarbone. Use the first 3 fingers of each hand to circle behind your ears, down each side of your neck and under your jaw line. If you feel lumps accompanied by tenderness, you may have swollen lymph nodes. You may also feel fullness in your throat and have difficulty swallowing."}, {"url": "http://www.cancer.org/cancer/cancerbasics/lymph-nodes-and-cancer", "passage_text": "Lymph nodes and what they do. Lymph vessels route lymph fluid through nodes throughout the body. Lymph nodes are small structures that work as filters for harmful substances. They contain immune cells that can help fight infection by attacking and destroying germs that are carried in through the lymph fluid. When there’s a problem, such as infection, injury, or cancer, the node or the group of lymph nodes in that area may swell or enlarge as they work to filter out the “bad” cells. This may be called lymphadenopathy (LIMF-ad-uh-NOP-uh-thee)."}, {"url": "http://www.healthline.com/health/swollen-lymph-nodes", "passage_text": "Lymph nodes are small glands that filter lymph, the clear fluid that circulates through the lymphatic system. They become swollen in response to infection and tumors. Lymphatic fluid circulates through the lymphatic system, which is made of channels throughout your body that are similar to blood vessels. Lymph nodes become swollen in response to illness, infection, or stress. Swollen lymph nodes are one sign that your lymphatic system is working to rid your body of the responsible agents. Swollen lymph glands in the head and neck are normally caused by illnesses such as: 1  ear infection."}, {"url": "http://www.wikihow.com/Check-Lymph-Nodes", "passage_text": "The lymphatic system is composed of small round glands (or nodes) made up of lymphatic tissue. Lymph nodes are critical to the body's immune response, and they commonly swell in reaction to infection and other causes. If you notice that your lymph nodes are swollen, it's a good idea to go to the doctor. Being able to check your lymph nodes yourself may help you detect any problems early on. Check the lymph nodes on your neck and collarbone. Use the first 3 fingers of each hand to circle behind your ears, down each side of your neck and under your jaw line. If you feel lumps accompanied by tenderness, you may have swollen lymph nodes. You may also feel fullness in your throat and have difficulty swallowing."}]