[{"url": "http://www.ehow.com/how_6668928_record-at_t-cell-phone-texts.html", "passage_text": "The process is the same whether you're using AT&T Messages to access your text records via smartphone, computer or tablet. AT&T Messages Backup & Sync is part of the messaging app on your AT&T phone that stores your texts in the AT&T cloud, then you can download them to your computer or tablet. Log in to AT&T Messages and enter your AT&T user ID and password. If your phone or tablet is a compatible Android device, you can download the AT&T Messages app from Google Play for smartphones or tablets and log in with"}, {"url": "http://www.computerworld.com/article/2471232/endpoint-security/how-long-does-your-mobile-phone-provider-store-data-for-law-enforcement-access-.html", "passage_text": "For example in location tracking, since July 2008, AT&T indefinitely keeps data about which cell towers were used by your phone. Verizon stores your cell-site data for 1 rolling year.. Sprint and Nextel keep it for 18 - 24 months. Virgin Mobile's is 'not retained' but can be obtained through Sprint. If law enforcement is so inclined as to find out, then the details of your text messages are conveniently kept by AT&T for post paid 5 - 7 years; it does not retain the text message content. "}, {"url": "http://www.pcmag.com/article2/0,2817,2393887,00.asp", "passage_text": "On the data front, Verizon also keeps your IP session information for one year. T-Mobile does not keep this information, AT&T only retains non-public IPs for 72 hours, and Sprint keeps it for 60 days. Similar policies are in place for IP destination information, except for Verizon, which keeps the information for 90 days. Call detail records, meanwhile, are retained for one year by Verizon, five years for T-Mobile (two years for pre-paid), five to seven years for AT&T, and 18 to 24 months for Sprint."}, {"url": "http://www.nbcnews.com/tech/mobile/how-long-do-wireless-carriers-keep-your-data-f120367", "passage_text": "1 AT&T: Stores call records for between 5 to 7 years; cell tower records since July 2008; text message details for between 5 to 7 years; text message content is not retained; Internet session information and destinations for up to 72 hours. advertisement. 1  Verizon: Keeps records of calls and cell towers used for a year; text message details are retained for up to one year, actual text message content between 3 to 5 days; Internet session information for up to a year, and Web sites visited for up to 90 days."}, {"url": "http://www.nbcnews.com/tech/mobile/how-long-do-wireless-carriers-keep-your-data-f120367", "passage_text": "1 Verizon: Keeps records of calls and cell towers used for a year; text message details are retained for up to one year, actual text message content between 3 to 5 days; Internet session information for up to a year, and Web sites visited for up to 90 days. advertisement. 1  Verizon: Keeps records of calls and cell towers used for a year; text message details are retained for up to one year, actual text message content between 3 to 5 days; Internet session information for up to a year, and Web sites visited for up to 90 days."}, {"url": "http://www.justanswer.com/cell-phones/40m2b-long-does-verizon-keep-cell-phone-records-informati-111.html", "passage_text": "Expert: Daniel P. replied 5 years ago. Ok, cell phone records can go back as far as the carrier keeps them on file, but the carriers standard length of time is to only store them for 12 months and there is no legal requirement for them to be stored longer, this includes Verizon. This is to save server storage space. Customer: replied 5 years ago. I can't say-the other person whose records are to be subpoened is not part of my account, so I do not have access to that account. I am not sure how far I can actually go back because I changed my cell phone number a few months ago and my old number is XXXXX longer accessible to me."}, {"url": "http://www.pcmag.com/article2/0,2817,2393887,00.asp", "passage_text": "T-Mobile keeps the same data for five years, Sprint keeps it for 18 months, and Verizon retains it for one year. Verizon is the only one of the top four carriers that retains text message content, however, and it keeps that for three to five days. Call detail records, meanwhile, are retained for one year by Verizon, five years for T-Mobile (two years for pre-paid), five to seven years for AT&T, and 18 to 24 months for Sprint."}, {"url": "http://www.infoworld.com/article/2620776/internet-privacy/mobile-phone-companies-keep-your-records-longer-than-you-think.html", "passage_text": "1 All of the mobile phone companies keep details about the location of cell towers used by every phone, for a year or longer. 2  All of the mobile phone companies keep records about voice calls and text messages received and sent for a year or longer. 3  Verizon stores the contents of every text message for three to five days. The eye-openers: 1 "}, {"url": "http://www.nbcnews.com/tech/mobile/how-long-do-wireless-carriers-keep-your-data-f120367", "passage_text": "1 Sprint: Hangs onto call records and cell tower records for between 18 and 24 months. 2  Internet session and destination info for up to 60 days; text message details for up to 18 months, depending on the device; text message content not retained; Internet session info and destination info for up to 60 days. advertisement. 1  Verizon: Keeps records of calls and cell towers used for a year; text message details are retained for up to one year, actual text message content between 3 to 5 days; Internet session information for up to a year, and Web sites visited for up to 90 days."}]