[{"url": "http://ods.od.nih.gov/factsheets/Selenium-Consumer/", "passage_text": "Selenium is a nutrient that the body needs to stay healthy. Selenium is important for reproduction, thyroid gland function, DNA production, and protecting the body from damage caused by free radicals and from infection."}, {"url": "http://ods.od.nih.gov/factsheets/Selenium-HealthProfessional/", "passage_text": "Selenium, which is nutritionally essential for humans, is a constituent of more than two dozen selenoproteins that play critical roles in reproduction, thyroid hormone metabolism, DNA synthesis, and protection from oxidative damage and infection [ 1 ]."}, {"url": "http://ods.od.nih.gov/factsheets/Selenium-HealthProfessional/", "passage_text": "Seafoods and organ meats are the richest food sources of selenium [ 1 ]. Other sources include muscle meats, cereals and other grains, and dairy products. The amount of selenium in drinking water is not nutritionally significant in most geographic regions [ 2, 6 ]."}, {"url": "http://www.ehow.com/about_5251626_selenium_.html", "passage_text": "Selenium is element number 34 on the Periodic Table of the Elements. It is a nonmetal located in the same column as oxygen and sulfur. Selenium is a trace element that promotes good health in small quantities, but can be a hazard in large amounts. It is generally assimilated into the body through digestion of foods containing the mineral."}, {"url": "http://www.medicalnewstoday.com/articles/287842.php", "passage_text": "Selenium is an essential trace mineral important for cognitive function, a healthy immune system and fertility for both men and women. Selenium is found in a variety of foods, the richest sources being Brazil nuts, seafood and organ meats."}, {"url": "http://www.fitday.com/fitness-articles/nutrition/vitamins-minerals/10-foods-rich-in-selenium.html", "passage_text": "Selenium is a trace mineral that is necessary to all functions of the body. Selenium Function. This important nutrient is vital to immune system function. Selenium works in conjunction with vitamin E, vitamin C, glutathione and vitamin B3 as an antioxidant to prevent free radical damage in the body."}, {"url": "https://en.wikipedia.org/wiki/Selenium", "passage_text": "Selenium is a chemical element with symbol Se and atomic number 34. It is a nonmetal with properties that are intermediate between those of its periodic table column-adjacent chalcogen elements sulfur and tellurium. It rarely occurs in its elemental state in nature, or as pure ore compounds."}, {"url": "http://patient.info/doctor/Selenium", "passage_text": "Selenium is an essential mineral and micronutrient. It is fundamental to human health and found in many foods. It is found in meat, seafood (hence, selenium levels are high in populations with high intake of seafood, like the Inuit population), grain cereals, egg yolk, milk, brazil nuts, mushrooms and garlic."}]