[{"url": "http://eol.org/info/455", "passage_text": "Bacteria are found in a very broad gamut of habitats; for example, bacterial extremophiles that thrive in such places as hot springs, arctic environments, radioactive waste, deep sea oil seeps, deep Earth crustal environments, hypersaline ponds and within other living organisms. There are approximately 50 million bacterial organisms in a single gram of typical surface soil. The worldwide bacterial biomass exceeds that of all plants and animals on Earth. However, the majority of bacteria have not yet been characterised."}, {"url": "http://examples.yourdictionary.com/examples-of-bacteria.html", "passage_text": "Bacteria are the plural of bacterium, which are microscopic one-celled organisms. They are found everywhere and can be harmful, as in infections; or they can be beneficial, as in fermentation or decomposition. Here are examples of bacteria that do not have a cell wall and may be rod shaped or spherical (Mycoplasma): 1  M. buccale. 2  M. faucium. 3  M. fermentans. 4  M. gallisepticum. 5  M. genitalium. 6  M. haemofelis."}, {"url": "http://eol.org/info/455", "passage_text": "Taxonomy. Bacteria are members of the prokaryote group. In contrast to eukaryote cells, bacteria lack a cell nucleus and customarily have no organelles. The bacteria domain can be grouped into two major categories: (a) Eubacteria and (b) Cyanobacteria. There are approximately 50 million bacterial organisms in a single gram of typical surface soil. The worldwide bacterial biomass exceeds that of all plants and animals on Earth. However, the majority of bacteria have not yet been characterised."}, {"url": "https://simple.wikipedia.org/wiki/Bacteria", "passage_text": "Bacteria (one of them is a bacterium) are very small organisms. They are prokaryotic microorganisms. Bacterial cells do not have a nucleus, and most have no organelles with membranes round them. Most have a cell wall. They do have DNA, and their biochemistry is basically the same as other living things. Most bacteria live in the ground or in water, but many live inside or on the skin of other organisms, including humans. There are about ten times as many bacterial cells as human cells in each of our bodies."}, {"url": "https://en.wikipedia.org/wiki/Bacteria", "passage_text": "There are typically 40 million bacterial cells in a gram of soil and a million bacterial cells in a millilitre of fresh water. There are approximately 5×10 30 bacteria on Earth, forming a biomass which exceeds that of all plants and animals. Bacteria inhabit soil, water, acidic hot springs, radioactive waste, and the deep portions of Earth's crust. Bacteria also live in symbiotic and parasitic relationships with"}, {"url": "http://users.rcn.com/jkimball.ma.ultranet/BiologyPages/E/Eubacteria.html", "passage_text": "Bacteria are microscopic organisms whose single cells have neither a membrane-enclosed nucleus nor other membrane-enclosed organelles like mitochondria and chloroplasts. "}, {"url": "http://www.microbiologyonline.org.uk/about-microbiology/introducing-microbes/bacteria", "passage_text": "Bacteria are found in every habitat on Earth: soil, rock, oceans and even arctic snow. Some live in or on other organisms including plants and animals including humans. There are approximately 10 times as many bacterial cells as human cells in the human body. A lot of these bacterial cells are found lining the digestive system. When conditions are favourable such as the right temperature and nutrients are available, some bacteria like Escherichia coli can divide every 20 minutes. This means that in just 7 hours one bacterium can generate 2,097,152 bacteria. After one more hour the number of bacteria will have risen to a colossal 16,777,216."}, {"url": "http://eol.org/info/455", "passage_text": "Introduction. Bacteria are any of a very large group of single-celled microorganisms that display a wide range of metabolic types, geometric shapes and environmental habitats—and niches—of occurrence. Normally only several micrometers in length, bacteria assume the form of spheres, rods, spirals and other shapes. There are approximately 50 million bacterial organisms in a single gram of typical surface soil. The worldwide bacterial biomass exceeds that of all plants and animals on Earth. However, the majority of bacteria have not yet been characterised."}, {"url": "http://www.meditec.com/resourcestools/diseases-disorders-index/bacteria/", "passage_text": "Quick Guide to Bacterial Organisms. A bacterium is an organism which works on the body in both complementary and destructive ways. The plural of the word is “bacteria.” You will hear mostly about twtypes relative tthe way they use oxygen, “aerobic” and “anaerobic” (with and without oxygen). "}, {"url": "http://www.livescience.com/51641-bacteria.html", "passage_text": "Bacteria are microscopic single-celled organisms that thrive in diverse environments. They can live within soil, in the ocean and inside the human gut. Humans' relationship with bacteria is complex. Sometimes they lend a helping hand, by curdling milk into yogurt, or helping with our digestion. However, certain bacteria, like the mycoplasmas do not have a cell wall at all. Some bacteria may even have a third, outermost, protective layer called the capsule. Lastly, bacterial surfaces can be covered by whip-like extensions: flagella or pili."}]