[{"url": "http://geography.about.com/od/specificplacesofinterest/a/amazonriver8.htm", "passage_text": "2. The Amazon River is the second longest river in the world (the Nile River in Africa is the longest) and is about 4,000 miles (6400 km) long. (In July 2007 a group of scientists reportedly determined that the Amazon River might just be the longest river in the world, taking that title from the Nile River. The Amazon River carries more water than any other river in the world. In fact, the Amazon River is responsible for about one-fifth (twenty percent) of the fresh water that flows into the world's oceans. 2."}, {"url": "http://www.extremescience.com/amazon-river.htm", "passage_text": "When the flood plains and the Amazon River Basin flood during the rainy season the Amazon River can be up to 40km/24.8 mi wide. Where the Amazon opens at its estuary the river is over 325km/202 mi wide! At its widest point the Amazon River can be 11km/6.8 mi wide during the dry season. The area covered by the Amazon River and its tributaries more than triples over the course of a year. In an average dry season 110,000 square km of land are water-covered, while in the wet season the flooded area of the Amazon Basin rises to 350,000 square km."}, {"url": "https://en.wikipedia.org/wiki/Amazon_River", "passage_text": "In its upper stretches, above its confluence with the Rio Negro, the Amazon is called Solimoes solimões In. Brazil but In, Peru colombia And, ecuador as well as the rest of The-spanish speaking, world the river is generally called The amazon downstream beginning at the confluence of The maranon Marañón and ucayali Rivers. in peru The Amazon River and its tributaries are characterized by extensive forested areas that become flooded every rainy season. Every year, the river rises more than 9 metres (30 ft), flooding the surrounding forests, known as varzea (várzea flooded). forests"}, {"url": "https://en.wikipedia.org/wiki/Amazon_River_Basin", "passage_text": "The mouth of the Amazon River. The Amazon basin is the part of South America drained by the Amazon River and its tributaries. The Amazon drainage basin covers an area of about 6,915,000 km 2 (2,670,000 sq mi), or roughly 40 percent of the South American continent. The Amazon River, which rises in the Andes Mountains at the west of the basin, is usually considered to be the second longest river in the world. However, a team of Brazilian scientists claim that the Amazon is the longest river in the world. It covers about 6,400 km before draining into the Atlantic Ocean."}, {"url": "http://www.mnn.com/family/protection-safety/photos/9-floods-of-biblical-proportion/amazon-river-flood-of-1953", "passage_text": "Amazon River flood of 1953. The Amazon River basin, by far the largest river basin in the world, is responsible for 20 percent of the world's discharge of freshwater into the oceans. Seasonal floods cover an area as large as 140,000 square miles every year."}, {"url": "http://www.extremescience.com/amazon-river.htm", "passage_text": "The Amazon is the greatest river in the world by so many measures; the volume of water it carries to the sea (approximately 20% of all the freshwater discharge into the oceans), the area of land that drains into it, and its length and width. At its widest point the Amazon River can be 11km/6.8 mi wide during the dry season. The area covered by the Amazon River and its tributaries more than triples over the course of a year. In an average dry season 110,000 square km of land are water-covered, while in the wet season the flooded area of the Amazon Basin rises to 350,000 square km"}, {"url": "http://www.answers.com/Q/How_often_does_the_Amazon_river_flood", "passage_text": "The Amazon River does flood and it usually starts in November. The  river floods every year and can swell up to 25 miles and tripling  the land area it cover. The estuary where it meets the ocean is over 200 miles across and deep enough for sea-going vessels to travel nearly 2/3 of the way up the river. Approximately 20% of all of the freshwater in the world that enters the ocean is by way of the Amazon river."}, {"url": "http://www.answers.com/Q/Does_the_amazon_river_flood", "passage_text": "Making the world better, one answer at a time. The Amazon River does flood and it usually starts in November. The river floods every year and can swell up to 25 miles and tripling the land area it cover. The Amazon river is the largest river in the Amazon and the second  largest river in the world. It runs through Peru, Brazil and  Columbia."}, {"url": "https://en.wikipedia.org/wiki/Amazon_River", "passage_text": "The Amazon basin is the largest drainage basin in the world, about 7,050,000 square kilometres (2,720,000 sq mi), and accounts for approximately one-fifth of the world's total river flow. The Amazon River and its tributaries are characterized by extensive forested areas that become flooded every rainy season. Every year, the river rises more than 9 metres (30 ft), flooding the surrounding forests, known as varzea (várzea flooded). forests"}]