[{"url": "http://electronics.howstuffworks.com/question537.htm", "passage_text": "Probably the most useful thing to know about the Global System for Mobile communications (GSM) is that it is an international standard. If you travel in Europe and many other parts of the world, GSM is the only type of cellular service available."}, {"url": "http://searchmobilecomputing.techtarget.com/definition/GSM", "passage_text": "GSM (Global System for Mobile communication) is a digital mobile telephony system that is widely used in Europe and other parts of the world. GSM uses a variation of time division multiple access (TDMA) and is the most widely used of the three digital wireless telephony technologies (TDMA, GSM, and CDMA)."}, {"url": "http://www.ebay.com/gds/Whats-the-Difference-Between-GSM-and-CDMA-Cell-Phones-/10000000178258796/g.html", "passage_text": "GSM, or Global System for Mobile, is the primary type of technology used for cell phones in the rest of the world. Within the United States, a much small number of network service providers are on the GSM standard, among them T-Mobile and AT and T."}, {"url": "http://www.androidcentral.com/android-z-what-gsm", "passage_text": "GSM stands for Global System for Mobile Communications and is the network standard for much of the world. Of the four major carriers here in the United States, T-Mobile and AT&T use GSM technology. In Europe, you'll be hard-pressed to find something other than GSM."}, {"url": "http://www.wisegeek.com/what-is-gsm.htm", "passage_text": "GSM, or Global System for Mobile Communications, is a cellular phone protocol that is standard in most parts of the world. Technology experts created the protocol in the 1980s and '90s to standardize cellular phone service between countries in Europe."}, {"url": "http://cellphones.about.com/od/phoneglossary/g/gsm.htm", "passage_text": "GSM uses digital technology and is a second-generation (2G) cell phone system. GSM, which predates CDMA, is especially strong in Europe."}, {"url": "https://en.wikipedia.org/wiki/GSM", "passage_text": "GSM (Global System for Mobile Communications, originally Groupe Special Spécial), mobile is a standard developed by The European Telecommunications Standards (INSTITUTE) etsi to describe the protocols for-second (GENERATION) 2g digital cellular networks used by mobile, phones first deployed In finland In july. 1991"}, {"url": "http://www.mobileburn.com/definition.jsp?term=GSM", "passage_text": "GSM is a TDMA based wireless network technology developed in Europe that is used throughout most of the world. GSM phones make use of a SIM card to identify the user's account. The use of the SIM card allows GSM network users to quickly move their phone number from one GSM phone to another by simply moving the SIM card."}]