[{"url": "http://www.drivingtests.co.nz/resources/towing-a-caravan-in-new-zealand/", "passage_text": "If you already have a caravan and are looking for a vehicle you will need to check the vehicle’s towing capacity. If it doesn’t have a tow bar fitted, budget for the purchase and installation of the bar or tow hitch. Consider the power-to-weight ratio of your car."}, {"url": "http://www.c4caravans.com/blog/caravan-parking-restrictions-can-i-park-my-caravan-on-the-road.php", "passage_text": "It is NOT illegal to park your caravan on the road if it is not causing an obstruction to road users. This does not mean that it cannot be a highway obstruction, any vehicle parked on the road is an obstruction to the highway."}, {"url": "http://www.c4caravans.com/blog/caravan-parking-restrictions-can-i-park-my-caravan-on-the-road.php", "passage_text": "Conclusion. Ultimately parking a caravan on the road is not an ideal situation. You may find that you cannot park your caravan in your drive due to restrictive covenants on the deeds of your house. If you are unsure then you should seek advice from your solicitor, council and of course your neighbours."}, {"url": "http://www.c4caravans.com/blog/caravan-parking-restrictions-can-i-park-my-caravan-on-the-road.php", "passage_text": "If you want to park your caravan on a road then you should speak to your insurance company. You may find that your insurance does not cover the car being left on the road for an extended period of time."}, {"url": "http://www.caravanclub.co.uk/community/discussions/information,-technical-tips-advice/storage/Parking-a-caravan-in-the-street/rt/586748/?p=1", "passage_text": "No. It is an offence to park caravans or trailers on the road which are not hooked up to a vehicle. Caravans/trailers should be lit during the hours of darkness and be facing with the flow of traffic so that approaching vehicles can see the rear lights."}, {"url": "http://keizertimes.com/2014/04/28/tow-truck-parking-in-neighborhoods-debated/", "passage_text": "Photo courtesy Wikipedia. By CRAIG MURPHY Of the Keizertimes. The debate over tow truck parking in Keizer continues. Under current code, a truck with a gross vehicle weight rating of more than 10,000 pounds is not allowed to park on a street in a residential area."}, {"url": "http://www.practicalcaravan.com/forum/technical/25135-is-it-legal-to-park-your-caravan-on-the-road", "passage_text": "Remember that parking the caravan on the driveway at the front of your house may still cause problems to the neighbours and, in some cases is not allowed under the title deeds for the house-check with your solicitor if you are unsure."}]