[{"url": "http://www.babynology.com/meaning-ponnu-f30.html", "passage_text": "List of Hindu baby names, Hindu baby boy names (male), girl names (female) & Hindu names meanings has been compiled from various resources. Please use this list of Hindu baby names only for reference/idea to name your kid/child. Database of baby names has been compiled from various references and suggestions provided by our web site visitors and resources partners. Meaning of Ponnu in Hindu origin/culture for Girl name with history and fame details. Foetus responds. Absolutely, everyone knows that the foetus present inside the womb of the mother can hear. But something which you did not know is that foetus responds to sound properly i.e. in a similar manner as they respond to any kind of internal stimulation."}, {"url": "https://en.wikibooks.org/wiki/Hindi/Family_relations", "passage_text": "From Wikibooks, open books for an open world. Family relation names in Hindi are very specific to the speaker. For example there are different names for your uncles such as your father's brother and your mother's brother. Since these vary a bit from place to place, the following are some standard examples. For example दादाजी would often be spelled dadaji instead of the more precise transliteration daadaajii, and similarly बेटी would often be written as beti instead of beTii. These simpler cases are ambiguous, but if the context is known, the correct spelling and pronunciation can be inferred."}, {"url": "https://en.wikipedia.org/wiki/Brahmin_Tamil", "passage_text": "The dialect, largely, uses Classical Tamil along with a heavy proportion of Sanskrit derivatives. According to linguist V. Balasubramaniam, Brahmin Tamil dialect is closest to the Central Tamil dialect, particularly, the variant used by Vellalars and Mudaliyars. The principal characters in the Tamil movies of the period (1930s and 1940s) also spoke the Brahmin dialect. However, with the rise of the Pure Tamil Movement and the entry of Dravidian ideologues into Tamil cinema in the 1950s, Brahmin Tamil was gradually displaced from public spheres."}, {"url": "https://en.wikipedia.org/wiki/Brahmin_Tamil", "passage_text": "Brahmin Tamil (Tamil: பிராமண தமிழ்) is the name a dialect of Tamil traditionally spoken by Tamil Brahmins. The principal characters in the Tamil movies of the period (1930s and 1940s) also spoke the Brahmin dialect. However, with the rise of the Pure Tamil Movement and the entry of Dravidian ideologues into Tamil cinema in the 1950s, Brahmin Tamil was gradually displaced from public spheres."}, {"url": "https://en.wikibooks.org/wiki/Hindi/Family_relations", "passage_text": "Family relation names in Hindi are very specific to the speaker. For example there are different names for your uncles such as your father's brother and your mother's brother. For example दादाजी would often be spelled dadaji instead of the more precise transliteration daadaajii, and similarly बेटी would often be written as beti instead of beTii. These simpler cases are ambiguous, but if the context is known, the correct spelling and pronunciation can be inferred."}, {"url": "https://en.wikibooks.org/wiki/Hindi/Family_relations", "passage_text": "Commonly if the transliterated form is written for casual usage, a simpler approximation is used, such as spelling the doubled vowels with just one and not bothering to use the correct capitalized forms to denote the retrolflex vs dental consonants. For example दादाजी would often be spelled dadaji instead of the more precise transliteration daadaajii, and similarly बेटी would often be written as beti instead of beTii. These simpler cases are ambiguous, but if the context is known, the correct spelling and pronunciation can be inferred."}, {"url": "https://en.wikipedia.org/wiki/Ponni_Rice", "passage_text": "Ponni Rice is a variety of rice developed by Tamil Nadu Agricultural University in 1986. It is widely cultivated in Tamil Nadu a state in India, and is a hybrid variety of Taichung65 and Myang Ebos 6080/2. The name (பொன்னி in Tamil) literally means 'like gold'. Since River Kaveri is also called 'Ponni' in Tamil literature there is a notion that the rice could have been named after the river."}, {"url": "https://en.wikipedia.org/wiki/Brahmin_Tamil", "passage_text": "During the heyday of Brahmin domination in the early 1900s, Brahmin Tamil was used as the lingua-franca for inter-caste communication. The principal characters in the Tamil movies of the period (1930s and 1940s) also spoke the Brahmin dialect. However, with the rise of the Pure Tamil Movement and the entry of Dravidian ideologues into Tamil cinema in the 1950s, Brahmin Tamil was gradually displaced from public spheres."}, {"url": "http://www.babynamespedia.com/meaning/Nalla", "passage_text": "nal-la, na-lla ] The baby girl name Nalla is pronounced as N AE L-AH †. Nalla is derived from Arabic and African-Swahili origins. Nalla is a variant form of the Arabic and English name Nahla. Nalla is also a variant form of the English, Indian, and Swahili name Nala. Nalla is irregularly used as a baby girl name. It is not ranked within the top 1000."}]