[{"url": "http://www.foodsubs.com/SpiceHisp.html", "passage_text": "annatto seed = achiote seed = annotto seed = achote seed = achuete seed = atsuete seed = bija = bijol = roucou Notes: Annatto seeds don't have a lot of flavor, but they impart a rich yellowish-orange color to stews and sauces. Look for the seeds, either whole or ground, in Latin American or Caribbean markets. "}, {"url": "https://en.wikipedia.org/wiki/Annatto", "passage_text": "Annatto (/əˈnaetoʊ/ əˈnætoʊ /or/) əˈnɑːtoʊ is an-orange red condiment and food coloring derived from the seeds of the achiote (Tree bixa). Orellana it is often used to impart a yellow or orange color to, foods but sometimes also for its flavor and. aroma The color of annatto comes from various carotenoid pigments, mainly bixin and norbixin, found in the reddish waxy coating of the seeds. The condiment is typically prepared by grinding the seeds to a powder or paste."}, {"url": "http://www.food.com/recipe/achiote-paste-substitute-479987", "passage_text": "Cook. Essential for Panamanian food, or other recipes that call for ingredients you can't find in your local grocery store, a substitute for achiote easily made from other, more commonly found ingredients. Courtesy of the Panama home page. Skip to Next Recipe. Prep. Essential for Panamanian food, or other recipes that call for ingredients you can't find in your local grocery store, a substitute for achiote easily made from other, more commonly found ingredients."}, {"url": "http://cooking.stackexchange.com/questions/23548/what-can-i-use-instead-of-annatto", "passage_text": "If your recipe does use a lot of annatto (or you are serving it to people who claim to be able to detect the difference) then your best bet would probably be to just buy it online. It is a seed so it isn't fragile and ships well. In Mexico annatto is a common alternative to saffron, so you could go that route, though I imagine saffron is more expensive than even mail ordering annatto seeds. Turmeric offers the color, without the nice flavor of annatto cooked oils."}, {"url": "http://cooking.stackexchange.com/questions/23548/what-can-i-use-instead-of-annatto", "passage_text": "The flavor is described as being very mild and unless the recipe calls for a ton of the stuff it is probably being used mostly for color. The color it gives is a yellow-orange. Substitutions used are turmeric, paprika, or a mixture of the two. It was often used itself as a substitution for saffron but of course saffron would be too expensive to make the substitution back. In Mexico annatto is a common alternative to saffron, so you could go that route, though I imagine saffron is more expensive than even mail ordering annatto seeds. Turmeric offers the color, without the nice flavor of annatto cooked oils."}, {"url": "http://www.answers.com/Q/Is_there_a_substitute_for_annatto_powder", "passage_text": "Since annatto powder is basically a form of carotene (found in abundance in foods like carrots), any yellowish-orange edible product can be substituted, but it depends on the flavour profile you're looking for. Annatto is used to colour butter, margarine, cheese, and so forth. Its flavour is also quite mild, so you can often get away with substituting using turmeric or yellow food colouring with just a dash of orange mixed in. If money is no object, you could substitute saffron instead. Chili powder is a blend of spices. You can make your own or substitute the spices by using red pepper, garlic, oregano, cumin, paprika, dried crusshed peppers and garlic. Some … cooks may add cinnamon, clove, mace, coriander, a little bay leaf, nutmeg or turmeric"}, {"url": "http://www.food.com/about/annatto-seed-397", "passage_text": "Annatto or achiote seed is brick-red with a slightly bitter, earthy flavor and imparts a rich yellowish-orange color in Caribbean, Latin American and Filipino cuisines. It has been dubbed the poor man's saffron as the color is simalar to the more expensive seasoning. "}, {"url": "http://allspiceonline.com/shop/spices/annatto", "passage_text": "Annatto. The earthy flavor of the small annatto seed is prized in Hispanic cuisine. Annatto&#39s scent is slightly peppery, with a hint of nutmeg, with a slightly sweet and peppery flavor. Annatto is used in Latin America and Caribbean cuisines, as both a coloring agent and for flavoring. Annatto is the seed of the achiote [or Lipstick] tree. "}]