[{"url": "http://howthingstaste.com/tag/truffles/", "passage_text": "September 11, 2011 in Unique Foods. What it is: A truffle is a mushroom fungus that grows underground. They usually live off the nutrients supplied by trees, meaning their usual location is around the roots of large plants and trees. Truffles are usually black or white, with slight color variations in between. Truffles are most commonly harvested using specially trained pigs or dogs that are trained to detect the special truffle odor. How it tastes: Truffles have a slight mushroom flavor like their relatives, but have deeper, earthier undertones."}, {"url": "http://howthingstaste.com/2011/09/11/what-does-a-truffle-fungus-taste-like/", "passage_text": "How it tastes: Truffles have a slight mushroom flavor like their relatives, but have deeper, earthier undertones. They are slightly reminiscent of wood or nuts. Because of the different varities, truffle flavor can differ depending on the source of the truffles. September 11, 2011 in Unique Foods. What it is: A truffle is a mushroom fungus that grows underground. They usually live off the nutrients supplied by trees, meaning their usual location is around the roots of large plants and trees. Truffles are usually black or white, with slight color variations in between"}, {"url": "https://answers.yahoo.com/question/index?qid=20100403140448AAUhF1k", "passage_text": "Truffles taste very powerfully of mushrooms. The taste is usually described as earthy and even meaty. White truffles have a subtler, slightly floral taste. Truffles are extremely expensive, and Brillat-Savarin points out that eating them in tiny quantities is pointless. Chocolate truffles are called that because they resemble truffles: they're round and kind of dusty. What most people think of as truffles are really chocolate-coated truffles; the real truffle is the ganache filling. Source(s): http://ebooks.adelaide.edu.au/b/brillat/..."}, {"url": "http://gourmet.lovetoknow.com/What_Is_a_Truffle", "passage_text": "While all truffles have an earthy flavor, each kind has its own distinct taste and fragrance; white truffles have a creamier taste, while black truffle are known for their woody notes. If you are interested in experimenting with truffles, you should consider picking up a bottle of truffle oil. "}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20080402072357AAN3adG", "passage_text": "I have tried both white and black truffle oil. both are very earthy and strong. In the right dish they could be wonderful. They do have a slight taste of portobello mushrooms, but no sweetness. The black truffle oil tasted to much like dirt to me, but I'm sure that was because I was tasting the oil only. If it was in a dish, I'm sure it would have been lovely"}, {"url": "http://boards.straightdope.com/sdmb/showthread.php?t=611193", "passage_text": "I have made dessert dishes with chocolate and truffles-the earthiness of the truffle and a really bitter chocolate are nice together, throw in an element of pine oil and maca root and you have something really interesting. My name is jjimm and I am a truffle obsessive. Here's what I said in an earlier thread on the subject: It's a rounded, earthy taste, and the odor mixes with the taste in the back of your nose too. I don't think it's anything like garlic at all."}, {"url": "http://www.answers.com/Q/What_do_truffles_taste_like", "passage_text": "Truffles taste a little bit like dirt and have a kind of strong earthy mushroom taste with some woodlike undertones. You need to actually taste one to know how it tastes. Share to: Chocolate truffles are called truffles due to their resemblance to the truffle fungus, a highly prized ingredient in many types of international cuisines.The truffle fungus … is normally used in shaved or grated form, soaked in oil, or mixed with salts."}, {"url": "http://www.oakvalleytruffles.com.au/truffles/about-truffles", "passage_text": "Truffles can be described as ‘gourmet mushrooms’. They have a pungent, intense, earthy fragrance and lend a unique flavour and aroma to food. The truffle is used in extremely small quantities and yet its flavour and aroma turn a standard offering of soup, chicken, meat or game into a gourmet experience. "}, {"url": "http://www.ign.com/boards/threads/what-do-truffles-taste-like-and-why-are-they-so-expensive.82217998/", "passage_text": "Anyway, truffles are a type of fungi, like mushrooms. They're really pungent. I don’t like them. I think they taste like dirt and they smell soooo bad. Like rotten dirty socks or something. I really hate mushrooms anyway, but truffles are the worst ever. "}]