[{"url": "http://www.thepregnancyzone.com/pregnancy-issues/yogurt-during-pregnancy/", "passage_text": "Benefits. When considering drinking yogurt while being pregnant you should remember that it is a dairy product so it has all the advantages of milk, and a little extra. Just as milk, yogurt is also rich in calcium that is very important during pregnancy. It is needed to support the bone formation of the baby. In the same time yogurt also contains proteins that are used in cell formation. The bacteria that can be found in yogurt don’t cause an infection."}, {"url": "http://www.livestrong.com/article/440815-greek-yogurt-while-pregnant/", "passage_text": "Fruit flavors provide about 10 percent of the calcium you need each day. Greek yogurt also contains a small amount of sodium, which you should limit in your pregnancy diet to help prevent high blood pressure and bloating."}, {"url": "http://www.livestrong.com/article/440815-greek-yogurt-while-pregnant/", "passage_text": "Greek yogurt provides about 2 percent of your daily requirement of vitamin A, a nutrient essential for the health of your growing baby's eyes. Some brands of Greek yogurt, such as Chobani, also provide about 2 percent of your daily vitamin C and iron needs."}, {"url": "http://www.livestrong.com/article/440815-greek-yogurt-while-pregnant/", "passage_text": "Calcium. Calcium -- a mineral you need plenty of during pregnancy -- has a notable presence in a serving of Greek yogurt. BabyCenter notes that if you do not consume enough calcium from your diet, your baby will leach what it needs from your own stores, which can leave you deficient. A 7-oz."}, {"url": "http://www.thepregnancyzone.com/pregnancy-issues/yogurt-during-pregnancy/", "passage_text": "During pregnancy you may wonder whether the foods that you normally have or that you crave are safe for you. When it comes to yogurt during pregnancy you should know that it is safe, even more, it also has numerous health benefits. Naturally there are also some restrictions. It is good to know that yogurt is a kind of fermented dairy product. It comes with good bacteria that digest the sugar found in milk."}]