[{"url": "http://memphismafia.elvis.com.au/", "passage_text": "He was the co-best man at Elvis' wedding. He was also the Foreman of the Memphis Mafia for a number of years, (Elvis' right hand man). He was solely responsible for the Memphis City Council to rename Highway 51, that runs in front of Graceland, Elvis Presley Boulevard in late1971. Marvin ' Gee Gee ' Gambill began working for Elvis about twelve months after he married Elvis's favorite female cousin, Patsy Presley. 'Gee Gee' a happy-go-lucky guy easily made friends with Elvis. Marvin was in charge of Elvis' wardrobe while he worked with the group."}, {"url": "https://en.wikiquote.org/wiki/Elvis_Presley", "passage_text": "1 Elvis was a brilliant artist. 2  As a musicologist — and I consider myself one — there was always a great deal of respect for Elvis, especially during his Sun sessions. 3  As a black people, we all knew that. ( 4 In fact), Eminem is the new Elvis because, number one, he had the respect for black music that Elvis had. 1 A few months later, Elvis was back; this time, his voice was even stronger but he looked worse; two months later, he was dead and that's when my family and I went to see him, one last time, in a memorable trip where we and thousands of others, walked slowly through those gates to view his grave."}, {"url": "http://biography.elvis.com.au/", "passage_text": "Elvis Aaron Presley, in the humblest of circumstances, was born to Vernon and Gladys Presley in a two-room house in Tupelo, Mississippi on January 8, 1935. His twin brother, Jessie Garon, was stillborn, leaving Elvis to grow up as an only child. Though he was no longer a major presence on the pop charts, five of those albums entered the top five of the country chart, and three went to number one: Promised Land (1975), From Elvis Presley Boulevard, Memphis, Tennessee (1976), and Moody Blue (1977)."}, {"url": "https://en.wikiquote.org/wiki/Elvis_Presley", "passage_text": "Elvis Aaron Presley (8 January 1935 – 16 August 1977) was an American singer, musician, and actor. He was one of the most popular American singers of the 20th century. One of the most significant cultural icons, he is widely known by the single name Elvis. 1 A few months later, Elvis was back; this time, his voice was even stronger but he looked worse; two months later, he was dead and that's when my family and I went to see him, one last time, in a memorable trip where we and thousands of others, walked slowly through those gates to view his grave."}, {"url": "http://wwnorton.com/college/music/rockhistory/outlines/ch02.htm", "passage_text": "1 When a different artist records a new version of a song it is called a cover. 2  It is possible (and not uncommon) for a song to be both a cover and a crossover. 3  This phenomenon was less common in the years from 1950 to 1953. 4  Only about 10% of songs crossed over from one chart to another chart. "}, {"url": "http://memphismafia.elvis.com.au/", "passage_text": "Sam Thompson met Elvis through his sister Linda, Elvis' long time girlfriend. Sam was a former Sheriff's Deputy in Memphis when he went to work for Elvis also as part of the security force. Sam remained until the end, and now he is with the Shelby County Sheriff's Department. Marvin ' Gee Gee ' Gambill began working for Elvis about twelve months after he married Elvis's favorite female cousin, Patsy Presley. 'Gee Gee' a happy-go-lucky guy easily made friends with Elvis. Marvin was in charge of Elvis' wardrobe while he worked with the group."}, {"url": "http://memphismafia.elvis.com.au/", "passage_text": "Pat was often a guest at Graceland and a good friend to Elvis and the guys. Pat today remains a hair stylist in Beverly Hills. Other people who briefly worked for Elvis were Arthur Hooten, Cliff Gleaves, Louis Harris, Bobby Smith, Jimmy Kingsley, Dean Nichopolous, Steve Smith and James Caughley. Marvin ' Gee Gee ' Gambill began working for Elvis about twelve months after he married Elvis's favorite female cousin, Patsy Presley. 'Gee Gee' a happy-go-lucky guy easily made friends with Elvis. Marvin was in charge of Elvis' wardrobe while he worked with the group."}, {"url": "http://www.salon.com/2014/11/16/the_elvis_presley_coverup_what_america_didnt_hear_about_the_death_of_the_king/", "passage_text": "He was taken by surprise by the call. He had done everything he could think of to preserve Elvis’s life in the face of his drug addiction, and he thought he was succeeding. He was looking forward to flying off in the Lisa Marie with Elvis to Portland, Maine, for a ten-day tour. Two years before, one of the medics, Charles Crosby, had come to assist Elvis’s father, Vernon Presley, after he suffered a heart attack. He thought it might be Vernon again. On this run Crosby was driving the ambulance. He was thirty-eight, stoutly built, dark-haired, and heavily mustached."}, {"url": "http://biography.elvis.com.au/", "passage_text": "Elvis Aaron Presley was born to Vernon and Gladys Presley in a two-room house in Tupelo, Mississippi, on January 8, 1935. His twin brother, Jessie Garon, was stillborn, leaving Elvis to grow up as an only child. Though he was no longer a major presence on the pop charts, five of those albums entered the top five of the country chart, and three went to number one: Promised Land (1975), From Elvis Presley Boulevard, Memphis, Tennessee (1976), and Moody Blue (1977)."}, {"url": "http://www.elvislightedcandle.org/withoutasong.htm", "passage_text": "Elvis Presley was very open in his singing style even though he was 'the' rock and roller.. - Brain Gilbertson, world-famous voice teacher. Along with the rest of Deep Purple, I once had the chance to meet Elvis. For a young singer like me, he was an absolute inspiration. So he had a tremendous range because of his desire to excel and be better, and that s why he could do a lot of things that most people couldn t.. - Terry Blackwood, lead singer of the Gospel group, the Imperials Elvis' initial hopes for a music career involved singing in a gospel male quartet."}]