[{"url": "http://www.medpagetoday.com/PainManagement/PainManagement/50722", "passage_text": "Tapentadol does not have the same mechanism of action as morphine; it has a dose ceiling whereas morphine does not. Therefore, it does not make sense to classify it as a morphine-equivalent analgesic. The authors assert that fentanyl, hydromorphone, methadone, oxycodone, and oxymorphone are stronger than morphine. While it is true that a smaller dose of these drugs may be required to obtain the same analgesic response as can be obtained with morphine, that fact does not mean that they have greater effectiveness. Tramadol has a different mechanism of action than does morphine; there is a ceiling to the pain relief that tramadol can provide. It makes no sense to put it in the same category as the other drugs. It is puzzling that the authors put hydrocodone, morphine, and tapentadol in the morphine-equivalent category."}, {"url": "http://www.chiefteach.com/index.php/chiefs-blog/79-is-dilaudid-stronger-than-morphine", "passage_text": "Yes it is. They are both opiates, but dilaudid is considered the stronger of the two. There are times when people will report different reactions to morphine or dilaudid. Reactions that may give some of them the perception that morphine is stronger, but chemically speaking, dilaudid is the stronger of the two. Let me tell you a story about the power of dilaudid. Or as some people call it, hospital heroin. For 15 years I have been involved in drug cases from varying angles."}, {"url": "http://www.rxlist.com/script/main/rxlist_view_comments.asp?drug=dilaudid&questionid=fdb9130_pem&page=2", "passage_text": "The two strongest are Dilaudid and Fentanyl. Dilaudid is actually many times stronger than morphine, but not as strong as Fentanyl. Fentanyl does not administer the medical punch that dilaudid does though. My wife has chronic pain from a number of diseases and she swears by the Fentanyl saying it is the best thing in her 25 years of chronic pain. "}, {"url": "https://www.addictioncenter.com/painkillers/dilaudid/", "passage_text": "Understanding Dilaudid (Hydromorphone). A powerful sedative, Dilaudid is the brand name for the opioid hydromorphone. Like many opioid pain relievers (OPRs), it changes the way the brain and central nervous system perceive pain and discomfort. Dilaudid provides patients moderate-to-severe pain relief and is often ingested orally as a clear liquid or tablet. "}, {"url": "http://www.medpagetoday.com/PainManagement/PainManagement/50722", "passage_text": "Weaker-than-morphine opioids included codeine, dihydrocodeine, meperidine, pentazocine, propoxyphene, and tramadol; morphine-equivalent opioid analgesics included hydrocodone, morphine, and tapentadol; and stronger-than-morphine opioids included fentanyl, hydromorphone, methadone, oxycodone, and oxymorphone. Tramadol has a different mechanism of action than does morphine; there is a ceiling to the pain relief that tramadol can provide. It makes no sense to put it in the same category as the other drugs. It is puzzling that the authors put hydrocodone, morphine, and tapentadol in the morphine-equivalent category."}, {"url": "http://www.opiate.com/hydromorphone/", "passage_text": "Hydromorphone. Hydromorphone is a semi-synthetic opioid that is much stronger than morphine and can be used in the treatment of moderate to severe pain mostly associated with injury, chronic illness or disease but also following major surgery. The opioid analgesic qualities of hydromorphone are excellent for use in the reduction of pain but the addictive nature of the drugs that contain hydromorphone such as Dilaudid (probably the most widely known of the hydromorphone class of drugs) make the drug very dangerous when in the wrong hands."}, {"url": "http://www.medpagetoday.com/PainManagement/PainManagement/50722", "passage_text": "About 20 mg of oral oxycodone and 7.5 mg of oral hydromorphone are required to obtain the same amount of pain relief as is obtained with 30 mg of oral morphine. Are those the data the authors used to classify these drugs as stronger than morphine? Tramadol has a different mechanism of action than does morphine; there is a ceiling to the pain relief that tramadol can provide. It makes no sense to put it in the same category as the other drugs. It is puzzling that the authors put hydrocodone, morphine, and tapentadol in the morphine-equivalent category."}, {"url": "https://en.wikipedia.org/wiki/Hydromorphone", "passage_text": "Hydromorphone is a more common synonym for dihydromorphinone (not to be confused with dihydromorphine, which is a different derivative of the morphine family), commonly a hydrochloride (brand names Palladone, Dilaudid, and numerous others). It is a very potent centrally acting analgesic drug of the opioid class. It is a derivative of morphine; to be specific, it is a hydrogenated ketone thereof. Comparatively, hydromorphone is to morphine as hydrocodone is to codeine -- that is, a semi-synthetic drug. In medical terms, it is an opioid analgesic and, in legal terms, a narcotic"}, {"url": "https://www.opiates.com/dilaudid/", "passage_text": "Dilaudid. Home » Dilaudid. Dilaudid ®, also known as hydromorphone is a narcotic analgesic of the opiate class prescribed for relief of moderate to severe pain and severe, painful dry coughing. Dilaudid ® is commonly used as an alternative to morphine in cases where a powerful antitussive is needed. If any develop or change in intensity, inform your doctor as soon as possible. Dilaudid is a narcotic analgesic that treats moderate to severe pain by binding to opioid receptors in the brain and nervous system. It is a semi-synthetic drug derived from morphine."}]