[{"url": "http://wanttoknowit.com/where-do-beets-originate-from/", "passage_text": "Where do Beets Originate From. 10 Jan, 2013 where do 0. Beets are a plant best known for producing the root vegetable that share the same name. There are a number of different varieties of beets, including the popular vegetable known as beetroot and the sugar beet, which is used to produce table sugar."}, {"url": "http://wanttoknowit.com/where-do-beets-originate-from/", "passage_text": "The beets are usually round in shape and are commonly eaten pickled, steamed, roasted or raw. The above ground portion of the plant, known as beet tops or beet greens are also edible and are similar to spinach. Let’s find out where beets originated and how the spread to the rest of the world."}, {"url": "http://www.gmo-compass.org/eng/safety/environmental_safety/184.sugar_beet.html", "passage_text": "Sugar beet (Beta vulgaris) is a common crop in Europe, especially in Denmark, France, and Germany. Wild relatives of sugar beet originated from Asia Minor. Breeding beets for sugar production has taken place since the late 18th century."}, {"url": "http://www.melasse.de/index.php?id=originsofmolasses", "passage_text": "Molasses is a by product of the sugar refining industry and as such its availability is governed by world sugar production. Cane and beet molasses are the end-products of the sugar manufacturing process and once no more sugar can be crystallised from the raw crop, the residual product is molasses."}, {"url": "http://www.pbs.org/food/the-history-kitchen/history-beets/", "passage_text": "In the anti-beet camp are President Obama and his wife Michelle, who asked that they not be planted in the White House’s organic vegetable garden. Many complain that beets have an “earthy” taste, which isn’t far off the mark."}, {"url": "http://wanttoknowit.com/where-do-beets-originate-from/", "passage_text": "The sea beet is sometimes still eaten today, although the cultivated varieties are more popular. The spread of the beet. After being domesticated the beets spread from the Mediterranean region to Babylonia (Middle East) in the 8th century B.C. and to China by 850 A.D."}, {"url": "http://www.gmo-compass.org/eng/safety/environmental_safety/184.sugar_beet.html", "passage_text": "Sugar beets are only allowed to flower for seed production, which mainly takes place in France and northern Italy. The sugar beet's wild relative, the sea beet, Beta vulgaris ssp. maritima, is an annual in southern Europe and a biennal or perennial in northern latitudes (Scandinavia, Ireland etc)."}, {"url": "http://wanttoknowit.com/where-do-beets-originate-from/", "passage_text": "The wild ancestor to the modern varieties of beets is known as the sea beet. This plant originated along the coast of the Mediterranean Sea and it is in this region that the beet was first cultivated for food. Today, the sea beet can be found growing wild along the coast of Europe, northern Africa, southern Asia and in parts of Great Britain."}]