[{"url": "http://ucmas.ca/our-programs/how-does-it-work/abacus-and-its-history/", "passage_text": "1 The first Chinese Abacus was invented around 500 B.C. 2  The Abacus, as we know it today, was used in China around 1300 A.D. 3  Often referred to as the first computer, the Abacus is an instrument used to add, subtract, multiply and divide, to calculate fractions and square roots."}, {"url": "http://www.answers.com/Q/When_was_the_first_Chinese_abacus_made", "passage_text": "1. The abacus was invented by the ancient Chinese (Not true; see 3  below). Different types of abacuses have been invented by many  others such as the Romans and Egyptians. …     2. Actually it's often wrongly attributed to china. In fact, the  oldest surviving abacus was used in 300 B.C. by the Babylonians."}, {"url": "http://www.ee.ryerson.ca/~elf/abacus/history.html", "passage_text": "The abacus, called Suan-Pan in Chinese, as it appears today, was first chronicled circa 1200 C.E. in China. The device was made of wood with metal re-inforcements. On each rod, the classic Chinese abacus has 2 beads on the upper deck and 5 on the lower deck; such an abacus is also referred to as a 2/5 abacus."}, {"url": "http://warrensburg.k12.mo.us/math/abacus/jason.html", "passage_text": "The word abacus comes from the Greek word ABAX meaning a calculating board or calculating table. It was invented by the Chinese, the first known record of the abacus was from an ancient sketch in a book from the Yuan Dynasty which was in the fourteenth century. It has a Mandarin name which isSuan Pan which means calculating plate. It's inventor is unknown. The Abacus is mostly referred to as the first computer."}, {"url": "http://classroom.synonym.com/chinese-invention-abacus-8876.html", "passage_text": "China. According to Chinese history, the abacus as we know it was invented sometime during the Ming Dynasty by mathematician Cheng Dawei. The Ming Dynasty lasted from 1388 to 1644 and was a period of cultural exchange and economic prosperity, at least in part."}, {"url": "http://ucmas.ca/our-programs/how-does-it-work/abacus-and-its-history/", "passage_text": "The word Abacus is derived from the Greek word ‘abax’, meaning ‘calculating board’ or ‘calculating table’. The first Chinese Abacus was invented around 500 B.C. The abacus, as we know it today, was used in China around 1300 A.D. Often referred to as the first computer, the Abacus is an instrument used to perform arithmetic calculations and is still used today in places like China, Japan and Russia."}]