[{"url": "http://www.fondriest.com/environmental-measurements/parameters/hydrology/sediment-transport-deposition/", "passage_text": "Sediment transport is the movement of organic and inorganic particles by water 10. In general, the greater the flow, the more sediment that will be conveyed. Water flow can be strong enough to suspend particles in the water column as they move downstream, or simply push them along the bottom of a waterway 11. Coastline erosion can be tied to sediment starvation – when rivers do not bring enough sediment to be deposited on the beach. In addition to the effect on aquatic life, the loss of sediment transport and deposition can cause physical changes to the terrain."}, {"url": "http://www.fondriest.com/environmental-measurements/parameters/hydrology/sediment-transport-deposition/", "passage_text": "Whether sediment will be eroded, transported or deposited is depended on the particle size and the flow rate of the water. Flow (ft 3 /s) =Area (ft 2) * Velocity (ft/s). OR Flow (ft 3 /s) =Volume (ft 3)/ Time (s). The equations describing the relationship of water flow and sediment transport are a bit more complex. Coastline erosion can be tied to sediment starvation – when rivers do not bring enough sediment to be deposited on the beach. In addition to the effect on aquatic life, the loss of sediment transport and deposition can cause physical changes to the terrain."}, {"url": "http://www.fondriest.com/environmental-measurements/parameters/hydrology/sediment-transport-deposition/", "passage_text": "Organic sediment transport is will vary by location and season. In one estuarine study, the organic portion of the suspended load fell from 85% to 18% from February to November due to seasonal effects on sediment transport 18. Coastline erosion can be tied to sediment starvation – when rivers do not bring enough sediment to be deposited on the beach. In addition to the effect on aquatic life, the loss of sediment transport and deposition can cause physical changes to the terrain."}, {"url": "http://www.fondriest.com/environmental-measurements/parameters/hydrology/sediment-transport-deposition/", "passage_text": "In addition to the effects that geomorphology has on sediment transport rates, the process itself plays a part in creating the terrain. As sediment is transported down stream, the water flow helps to shape the planet’s surface by carrying away the eroded material away from some regions and depositing it in others 19. Coastline erosion can be tied to sediment starvation – when rivers do not bring enough sediment to be deposited on the beach. In addition to the effect on aquatic life, the loss of sediment transport and deposition can cause physical changes to"}, {"url": "https://en.wikipedia.org/wiki/Sediment_transport", "passage_text": "When suspended sediment transport is increased due to human activities, causing environmental problems including the filling of channels, it is called siltation after the grain-size fraction dominating the process. Much work was done on river sediment transport formulae in the second half of the 20th century and that work should be used preferably to Hjulstroem'hjulström s, curve.e. G-Meyer & Peter (mueller), Müller-1948 (engelund), Hansen (1967), Lefort (1991). belleudy 2012"}, {"url": "http://water.usgs.gov/osw/techniques/workshop/koltun.html", "passage_text": "Today, the most pressing sediment-related problems are associated with environmental questions such as the transport and fate of attached pollutants, effects of sediment on aquatic biota and their habitat, and changes in sediment transport related to land use change. 1 A project is under way in Wisconsin to assess the influence of vegetated filter strips on the transport of sediment and nutrients to a stream. 2  Detailed measurements of sediment and water chemistry are being made in several Massachusetts lakes to help assess their trophic state."}, {"url": "https://en.wikipedia.org/wiki/Sediment_transport", "passage_text": "Fluvial sediment transport can result in the formation of ripples and dunes, in fractal-shaped patterns of erosion, in complex patterns of natural river systems, and in the development of floodplains. Much work was done on river sediment transport formulae in the second half of the 20th century and that work should be used preferably to Hjulstroem'hjulström s, curve.e. G-Meyer & Peter (mueller), Müller-1948 (engelund), Hansen (1967), Lefort (1991). belleudy 2012"}, {"url": "https://en.wikipedia.org/wiki/Sediment_transport", "passage_text": "Sediment transport due to fluid motion occurs in rivers, oceans, lakes, seas, and other bodies of water due to currents and tides. Transport is also caused by glaciers as they flow, and on terrestrial surfaces under the influence of wind. Much work was done on river sediment transport formulae in the second half of the 20th century and that work should be used preferably to Hjulstroem'hjulström s, curve.e. G-Meyer & Peter (mueller), Müller-1948 (engelund), Hansen (1967), Lefort (1991). belleudy 2012"}, {"url": "https://en.wikipedia.org/wiki/Sediment_transport", "passage_text": "Knowledge of sediment transport is most often used to determine whether erosion or deposition will occur, the magnitude of this erosion or deposition, and the time and distance over which it will occur. Much work was done on river sediment transport formulae in the second half of the 20th century and that work should be used preferably to Hjulstroem'hjulström s, curve.e. G-Meyer & Peter (mueller), Müller-1948 (engelund), Hansen (1967), Lefort (1991). belleudy 2012"}, {"url": "http://www.nrcs.usda.gov/wps/portal/nrcs/detail/national/technical/nra/rca/?cid=nrcs143_014201", "passage_text": "The emphasis of this paper is on sediment and its effects on the aquatic environment. This has become a very important issue in the United States and other countries because of expanding urban centers, greater use of natural resources, and the expansion of agriculture onto marginal lands. Prevention of erosion is a first step; if erosion occurs, keeping the sediment on the hillslopes is a second step; if the sediment is delivered to the stream channel, estuary, or lake, then the third step is restoration of"}]