[{"url": "http://www.carmenguedez.com/articles/paintings-different-types-of-colors", "passage_text": "Light shades of green, blue, purple, etc are used for showcasing them in the paintings. Neutral Colors: Neutral colors are the colors like black, white, brown, gray and beige. These colors are mostly used to represent the earth tones as they are also known as the earth colors."}, {"url": "http://www.infoplease.com/ipea/A0934307.html", "passage_text": "The lightness or darkness of a color is called its value. You can find the values of a color by making its tints and shades. Tints are light values that are made by mixing a color with white. For example, pink is a tint of red, and light blue is a tint of blue. Shades are dark values that are made by mixing a color with black."}, {"url": "https://cs.nyu.edu/courses/fall02/V22.0380-001/color_theory.htm", "passage_text": "A secondary color is a color created from a combination of two primary colors. Tertiary color is a combination of three colors (primary or secondary). Printers and artists have different definitions for primary colors. The traditionional primary colors that painters have used are red, yellow, and blue. Modern printing press secondary colors are magenta, yellow, and cyan."}, {"url": "http://www.infoplease.com/ipea/A0934307.html", "passage_text": "Neutral colors include black, white, gray, and sometimes brown and beige. They are sometimes called “earth tones.”. Circus by Georges Seurat. In Circus, Georges Seurat uses many different neutral colors. You can see a few glimpses of red, blue, and yellow in this painting. But the overall effect is of natural brown and gray colors, like those you might see in rocks or in sand, dirt, and clay. TRY IT! There are a few different ways to make"}, {"url": "http://www.infoplease.com/ipea/A0934307.html", "passage_text": "Warm colors are made with red, orange, yellow, or some combination of these. Warm colors tend to make you think of sunlight and warmth. The Fighting Temeraire by William Turner. In The Fighting Temeraire by William Turner, the warm colors of the sunset give a feeling of brightness and heat."}, {"url": "http://thevirtualinstructor.com/Color.html", "passage_text": "The color wheel is made up of three different types of colors-Primary, Secondary, and Tertiary. The primary colors are red, yellow, and blue. They are called primary for a couple of reasons. First, no two colors can be mixed to create a primary color."}]