[{"url": "http://www.enotes.com/homework-help/what-purpose-imagery-poetry-150809", "passage_text": "Imagery is figurative language that embellishes poetry; specifically, it is the representation through language of sense experience. By appealing to the senses, the poet is able to evoke the emotions that accompany these sensations. Posted on. (Answer #2). The purpose of imagery in poetry is to help get the poet's message across in language that is strong, vivid and very visual. The poet will use words to create images in our heads that help us to interpret the poem in the way he sees it."}, {"url": "http://resources.mhs.vic.edu.au/macbeth/theplay/imagery.html", "passage_text": "The theme of order is echoed in the imagery of the banquet. Macbeth’s good qualities are a banquet to Duncan; Macbeth sees sleep as part of nature’s banquet. But Macbeth’s royal banquet is disrupted by his own fear and guilt. The animal imagery in the play makes these connections. For example, we see how Lady Macbeth thinks of the croaking raven, Banquo the paternal martlet. Birds of prey and ill-omens abound in the animal imagery of the play: toads and snakes suit the Witches; Macbeth was a lion but eventually becomes a helpless bear."}, {"url": "https://en.wikipedia.org/wiki/Imagery", "passage_text": "Imagery, in a literary text, is an author's use of vivid and descriptive language to add depth to his or her work. It appeals to human senses to deepen the reader's understanding of the work. Powerful forms of imagery engage all of the senses pro lenses. 1 Organic imagery or subjective imagery, pertains to personal experiences of a character's body, including emotion and the senses of hunger, thirst, fatigue, and pain."}, {"url": "http://resources.mhs.vic.edu.au/macbeth/theplay/imagery.html", "passage_text": "Imagery. Throughout the play, Shakespeare weaves a pattern of connected images. These are instrumental in creating atmosphere and response. As you read the play, locate quotations that relate to each of the imagery below. Be able to extend upon the brief interpretations provided by explaining the role of each image and how it adds to an understanding of the play in detail. The animal imagery in the play makes these connections. For example, we see how Lady Macbeth thinks of the croaking raven, Banquo the paternal martlet. Birds of prey and ill-omens abound in the animal imagery of the play: toads and snakes suit the Witches; Macbeth was a lion but eventually becomes a helpless bear."}, {"url": "http://www.enotes.com/homework-help/what-does-mean-write-an-essay-significance-imagery-6855", "passage_text": "Once you get your examples of imagery that are used in the play, you can then tell how these examples make the play better or how they add to the themes of the play. I hope this helps. (Answer #1). When you write on the significance of imagery, you are talking about the influences your five senses have on the play. How do you see things through your sense of sight, touch, taste, smell, hearing..."}, {"url": "http://www.answers.com/Q/What_is_imagery_in_poetry", "passage_text": "exists and is an alternate of. Merge this question into. Split and merge into it. Answer by I want to know. Confidence votes 276. Imagery in poetry is what the words of the poem make the reader 'see' in their imagination. it is the colors, sounds, and sometimes feelings evoked by the poem. "}, {"url": "http://resources.mhs.vic.edu.au/macbeth/theplay/imagery.html", "passage_text": "Be able to draw upon this imagery when responding to the play in assigned activities and tasks. Ambition Both Macbeth and Lady Macbeth are ambitious, but Lady Macbeth is single-minded whereas Macbeth originally has scruples. These are overcome by the Witches and Lady Macbeth and he murders to achieve his ambition. The animal imagery in the play makes these connections. For example, we see how Lady Macbeth thinks of the croaking raven, Banquo the paternal martlet. Birds of prey and ill-omens abound in the animal imagery of the play: toads and snakes suit the Witches; Macbeth was a lion but eventually becomes a helpless bear."}, {"url": "http://www.enotes.com/homework-help/what-does-mean-write-an-essay-significance-imagery-6855", "passage_text": "Your teacher probably wants you to give specific examples of the imagery used in the play and then tell how the use of this imagery adds to the play. Why does the playwright use the imagery? Imagery appeals to our five senses: taste, touch, smell, sight, hearing. What does the playwright use in the play to evoke an image in our head that lets us know what something in the play looks like, tastes like, smells like, feels like, or sounds like? (Answer #1). When you write on the significance of imagery, you are talking about the influences your five senses have on the play. How do you see things through your sense of sight, touch, taste, smell, hearing..."}]