[{"url": "http://www.visual-arts-cork.com/happenings.htm", "passage_text": "A Happening is a form of avant-garde art-a type of creative expression, closely associated with performance art, which itself has its roots in twentieth century theories of conceptual art, derived largely from demonstrations organized by exponents of Dada, such as Tristan Tzara (1896-1963). In Japan, Happenings as types of performance art, were exploited during the 1960s by the Gutai Group-the avant-garde art group founded by Jiro Yoshihara in Osaka in 1954."}, {"url": "http://www.theartstory.org/movement-happenings.htm", "passage_text": "What began as a challenge to the category of art initiated by the Futurists and Dadaists in the 1910s and 1920s came to fruition with the performance art movements, one branch of which was referred to as Happenings. Happenings is not the name of a movement but the name of certain performance pieces that were generally more complicated and outlined than Fluxus events, like an improvisational theatrical work that involved the audience. They were more expressionistic and symbolic than Fluxus performances."}, {"url": "http://arthistory.about.com/od/glossary/g/a_assemblage.htm", "passage_text": "Definition: (noun) - As one familiar with the word assembly might assume, assemblage is a form of sculpture comprised of found objects arranged in such a way that they create a piece. These objects can be anything organic or man-made. "}, {"url": "http://www.definitions.net/definition/happening", "passage_text": "Happening. A happening is a performance, event or situation meant to be considered art, usually as performance art. Happenings take place anywhere, and are often multi-disciplinary, with a nonlinear narrative and the active participation of the audience. "}, {"url": "http://www.theartstory.org/movement-happenings.htm", "passage_text": "The Happenings artists were not part of an organized group with a leader like the Fluxus group and the term Happenings is not the name of a movement but the name of certain performance pieces. Happenings is not the name of a movement but the name of certain performance pieces that were generally more complicated and outlined than Fluxus events, like an improvisational theatrical work that involved the audience. They were more expressionistic and symbolic than Fluxus performances."}, {"url": "http://plato.stanford.edu/entries/art-definition/", "passage_text": "The definition of art is controversial in contemporary philosophy. Whether art can be defined has also been a matter of controversy. The philosophical usefulness of a definition of art has also been debated. Contemporary definitions are of two main sorts."}, {"url": "http://www.visual-arts-cork.com/happenings.htm", "passage_text": "History. The actual term 'happening' was first used in 1959 by the American artist Allan Kaprow (b.1927), whose later book 'Assemblage, Environments and Happenings' (1966) influenced a wide range of contemporary art events. In Japan, Happenings as types of performance art, were exploited during the 1960s by the Gutai Group-the avant-garde art group founded by Jiro Yoshihara in Osaka in 1954."}, {"url": "https://en.wikipedia.org/wiki/Happening", "passage_text": "Happenings occur anywhere and are often multi-disciplinary, with a nonlinear narrative and the active participation of the audience. Key elements of happenings are planned but artists sometimes retain room for improvisation. This new media art aspect to happenings eliminates the boundary between the artwork and its viewer. The first appearance in print was in Kaprow's famous Legacy of Jackson Pollock essay that was published in 1958 but primarily written in 1956. Happening also appeared in print in one issue of the Rutgers University undergraduate literary magazine, Anthologist."}, {"url": "http://en.mimi.hu/finearts/happening.html", "passage_text": "Hard-edge ... Happenings. A term used by the artist Allan Kaprow to describe the hybrid art forms of the 1960s in which visual art ists extended their works into theatrical situations, often with spectator participation, and incorporated elements from painting, drawing, sculpture, dance, and film. Happenings. Happening. Happenings were a hybrid form of art, taking their inspiration freely from theatrical, musical, literary, pictorial, and sculptural methods of expression. It was already an established trend in the 1950s, but only in the following decade did it receive serious widespread attention."}, {"url": "http://encyclopedia2.thefreedictionary.com/Happening+movement", "passage_text": "performance art. multimedia art form originating in the 1970s in which performance is the dominant mode of expression. Perfomance art may incorporate such elements as instrumental or electronic music, song, dance, television, film, sculpture, spoken dialogue, and storytelling. "}]