[{"url": "http://www.babynamewizard.com/baby-name/girl/isla", "passage_text": "Meanings and history of the name Isla : | Edit. Spanish meaning - devoted to God. Derived from the Isle of Islay. Islay was used as a personal name on both genders, now found predominantly on females. The Gaelic name of Islay is Ile. In 740 the island was referred to as Ili. Later Yle and also the forms Yla, Ila and Ilay. Ile Ghorm an Fheoir = green grassy Islay. Isla, pronounced ee-sluh, is also the word for island in Spanish. In most parts of the U.S. the Spanish word and its pronunciation will be more familiar than the Scottish name. Ilsa, Isla and Lisa are anagrams of each other; they contain the same letters."}, {"url": "http://nameberry.com/babyname/Isla", "passage_text": "Isla is the name of a Scottish river, an island (spelled Islay), and the hot young red-haired actress Isla Fisher, wife of Sacha Baron Cohen. Isla is also among the fastest rising names in the US, and has been on the Nameberry Top 1000 for girls for the past five years! "}, {"url": "http://www.thinkbabynames.com/meaning/0/Isla", "passage_text": "Presented below is the baby name popularity of Isla for girls. Isla was first listed in 2008 and reached its peak position of #150 in the U.S. in the year 2014. (Top 1000 Baby Names Statistics, 2014). How popular is Isla? Isla is an uncommonly occurring given name for women but a very prominent last name for both adults and children (#42604 out of 150436, Top 28%). (2000 U.S. Census"}, {"url": "http://www.babynames.com/name/ISLA", "passage_text": "The meaning of the name Isla: Island. The origin of the name Isla: Scottish. Alternate spellings: Ila. People who like the name Isla also like: Charlotte, Ava, Violet, Scarlett, Amelia, Olivia, Ella. Noah, Oliver, Liam, Henry, Finn, Declan, Owen. Notes: Isla is a name with Scottish origins. The meaning of the name Isla is island. Alternate spellings of the name Isla include Ila and Eyla. Nicknames for Isla include “I” and “Lala.”. Famous people with the name Isla include Isla Fisher, actress."}, {"url": "https://en.wikipedia.org/wiki/Isla_(given_name)", "passage_text": "Today Isla is regarded as a distinctly female name and Islay a rare male name. Other forms of the girls' name derived from alternate historical spellings of the Scottish island's name include Ile and Ila. 1  Isla Blair (born 1944), British actress. 2  Isla Paschal Richardson (born 1886), writer, author of To Those I Love. It is also the name of two Scottish rivers. It was the fifth most popular name for baby girls born in Scotland in 2010 and the 70th most popular name for girls born in England and Wales in 2007."}, {"url": "http://www.ohbabynames.com/meaning/name/isla/532", "passage_text": "Etymology & Historical Origin-Isla. Isla is a Scottish name. Yes, we know “isla” is the Spanish word for ‘island’ but in reality the beautiful name Isla comes to us from the Scots. And it’s pronounced “eye-la”."}, {"url": "http://www.sheknows.com/baby-names/name/isla", "passage_text": "The name Isla is a Spanish baby name. In Spanish the meaning of the name Isla is: Devoted to God. A Spanish. Scottish Meaning: The name Isla is a Scottish baby name. In Scottish the meaning of the name Isla is: From the name of a Scottish river. SoulUrge Number: 1. Expression Number: 5. People with this name have a deep inner desire to use their abilities in leadership, and to have personal independence. They would rather focus on large, important issues, and delegate the details"}, {"url": "http://www.behindthename.com/name/isla/comments", "passage_text": "Islay (or Isla) (A) is pronounced Eye-la. Ideas differ about the derivation of the name Islay. Various possibilities have been put forward, including island divided in two and the law island, while it also has been suggested that the name derives from a Pictish princess called Ile, who lived around 650-700 AD."}, {"url": "https://en.wikipedia.org/wiki/Isla_(given_name)", "passage_text": "Isla (/ˈaɪlə/ EYE-lə) is a feminine given name traditionally of primarily Scottish usage, derived from  Islay , which is the name of an island off the west coast of Scotland. It is also the name of two Scottish rivers. It was the fifth most popular name for baby girls born in Scotland in 2010 and the 70th most popular name for girls born in England and Wales in 2007."}]