[{"url": "http://www.oster.com/service-and-support/product-support/product-faqs/toaster-ovens/toaster-ovens-faq.html", "passage_text": "Before cleaning your Oster ® Toaster Oven, unplug it and allow it to cool. 1  To clean, wipe with damp cloth. 2  DO NOT IMMERSE IN WATER! Make sure to use only mild, soapy water. 3  Abrasive cleaners, scrubbing brushes and chemical cleaners will damage the continuous clean coating on this unit. 1 To clean, wipe with damp cloth. 2  DO NOT IMMERSE IN WATER! Make sure to use only mild, soapy water. 3  Abrasive cleaners, scrubbing brushes and chemical cleaners will damage the continuous clean coating on this unit. 4  Empty crumb tray frequently to avoid accumulation of crumbs."}, {"url": "http://thebesttoasterovenreviews.net/how-to-clean-your-toaster-oven/", "passage_text": "Before doing any kind of cleaning, you need to make sure that the oven is turned off and unplugged. If it has just been used, then you must also wait until it has cooled down. To clean the exterior, wipe it with a soft damp sponge or lint-free cloth. You may use a non-abrasive cleaner, but do not spray it directly onto the oven surface. Instead, apply the cleanser to the sponge or cloth. For cleaning the glass door, you can use a non-abrasive glass cleaner with a soft damp sponge"}, {"url": "http://amysayscook.com/oster-tssttvmndg-toaster-oven", "passage_text": "Timer. The Oster TSSTTVMNDG toaster oven has a 90 min ute timer that turns off the oven automatically when it gets to zero. You can change the cooking time, up to 90 minutes, for BAKE, BROIL, CONVECTION BAKE, WARM, DEFROST, and PIZZA. I am surprised that Oster allows 90 minutes for the BROIL setting. Many other toaster ovens have a much shorter maximum cooking time for the BROIL setting because it gets very hot inside. "}, {"url": "http://www.walmart.com/ip/Oster-Convection-Toaster-Oven/13729290", "passage_text": "About this item. Complete your kitchen with the Oster Convection Toaster Oven. It's a handy addition to any culinary space. Because this stainless steel toaster oven is both compact and powerful, it's an especially good choice for small kitchens or kitchenettes. It's easy to set the cooking time and temperature on it. The presets for CONVECTION BAKE and BAKE is 350 degrees and 30 minutes. It has a preset for PIZZA that is 400 degrees for 20 minutes. A DEFROST setting is for 150 degrees for 30 minutes."}, {"url": "http://convection-calculator.com/toaster-convection-oven.php", "passage_text": "The convection toaster oven uses a fan to spread the heat evenly around the oven... so no more cool spots and hot spots ! Regular ovens have uneven spots because they depend solely on the heating elements. This radiant heat is uneven, plus the distance of the food from the elements makes a difference to the temperature. The convection toaster oven is ready to go in a jiffy because it heats up quickly. It is faster cooking as well, because it uses a fan to force the hot air around the oven. This airflow blows away a thin layer of air that normally sits around the food, insulating it from the oven heat."}, {"url": "http://www.goodhousekeeping.com/home/cleaning/tips/a12452/heloise-spring-cleaning-toaster-oven/", "passage_text": "First, unplug the appliance. Remove the crumb tray at the base of the toaster, and shake out the accumulated food particles. My toaster oven is hung under a cabinet, so I lay down several sections of newspaper to catch the crumbs. Wipe off the tray and element with soap and water, and then rinse with fresh water. "}, {"url": "http://www.youtube.com/watch?v=MTbkziMplZg", "passage_text": "The Oster Toaster Oven features a large interior designed to hold up to a 13 x 9-inch pan. This stainless steel toaster oven works great for large scale cooking. It features a convection technology, with which it evenly distributes heat and cooks food faster. This oven includes Bake, Broil, Toast, Pizza, Defrost, and Warm functions for varied cooking."}, {"url": "http://www.ebay.com/gds/How-to-Clean-an-Oven-Naturally-/10000000177630341/g.html", "passage_text": "How Self-Cleaning Ovens Work. Although self-cleaning ovens make it possible to clean without chemicals, the self-cleaning process may involve some risk. Self-cleaning ovens work by heating to a very high temperature, usually between 800 and 900 degrees Fahrenheit, and incinerating oven build-up over a number of hours. "}, {"url": "http://www.ehow.com/how_7666621_instructions-clean-convection-oven.html", "passage_text": "Pull out the racks and set them aside. Wipe down the interior with a damp cloth or sponge, cleaning away the grease and softened food deposits. Pour 1/4 cup of baking soda into a small bowl and add enough water to make a thick paste. Apply the paste to any areas where baked-on food or debris remains. Allow the baking soda to sit for 30 minutes and then scrub gently with an old toothbrush. "}]