[{"url": "http://www.answers.com/Q/Is_myopia_dominant_or_recessive", "passage_text": "(i.e. Rr, R is the dominant gene) In blood type, A is dominant over O. So if a perso … n has Ao for their genes, they will have A type blood. A recessive gene will be hidden unless there are two of the same recessive gene. It is shown as a lowercase letter in the gene (i.e. Rr, r is the recessive gene)."}, {"url": "http://www.blinn.edu/socialscience/LDThomas/Feldman/Handouts/0203hand.htm", "passage_text": "RECESSIVE TRAITS. eye coloring. brown eyes. grey, green, hazel, blue eyes. vision. farsightedness normal vision normal vision normal vision. normal vision nearsightedness night blindness color blindness*. hair."}, {"url": "http://www.indiacurry.com/women/dominantrecessive.htm", "passage_text": "The dominant trait genes always trump the recessive trait genes. The Dominate/ Recessive is a comparative concept as well, which means that brown eye color is dominant trait when compared to grey, green, hazel, or blue eye colors."}, {"url": "http://www.blinn.edu/socialscience/LDThomas/Feldman/Handouts/0203hand.htm", "passage_text": "DOMINANT TRAITS. RECESSIVE TRAITS. eye coloring. brown eyes. grey, green, hazel, blue eyes. vision. farsightedness normal vision normal vision normal vision. normal vision nearsightedness night blindness color blindness*. hair."}, {"url": "http://genetics.thetech.org/ask/ask73", "passage_text": "The genetics of poor eyesight are too complicated to be a simple dominant or recessive trait. Something like nearsightedness is probably made up of more than one disease and each disease probably has more than one gene involved! Poor eyesight definitely runs in families."}, {"url": "http://www.indiacurry.com/women/dominantrecessive.htm", "passage_text": "Normally, there are two types of genes for each trait: Dominant, and Recessive. Dominant genes when paired with recessive gene determines the trait to be expressed. Recessive gene is not expressed when paired with dominant gene. Recessive genes are only expressed when paired with another recessive gene. Twenty two pair of Chromosomes look alike and are called autosomes. The twenty-third pair is different, two X-chromosomes for female, one X-and one Y-chromosome for a male."}]