[{"url": "http://psychology.wikia.com/wiki/Depersonalization", "passage_text": "Chronic depersonalization refers to depersonalization disorder which is classified by the DSM-IV as a dissociative disorder. Derealization is a similar term to depersonalization, and the two are often used interchangeably. However, more specifically, derealization is the feeling that nothing is real, while depersonalization is the feeling that one is literally detached from one's body or world."}, {"url": "https://en.wikipedia.org/wiki/Depersonalization", "passage_text": "In social psychology, and in particular self-categorization theory, the term depersonalization has a different meaning and refers to the stereotypical perception of the self as an example of some defining social category. Depersonalization is a symptom of anxiety disorders, such as panic disorder. It can also accompany sleep deprivation (often occurring when suffering from jet lag), migraine, epilepsy (especially temporal lobe epilepsy), obsessive-compulsive disorder, stress, anxiety. and in some cases of Low Latent Inhibition."}, {"url": "http://psychology.wikia.com/wiki/Depersonalization", "passage_text": "Depersonalization is an alteration in the perception or experience of the self so that one feels detached from, and as if one is an outside observer of, one's mental processes or body. When severe enough to interefere with activities of daily life it may lead to a diagnosis of Depersonalization disorder .. However, more specifically, derealization is the feeling that nothing is real, while depersonalization is the feeling that one is literally detached from one's body or world."}, {"url": "https://en.wikipedia.org/wiki/Depersonalization", "passage_text": "Depersonalization is the third most common psychological symptom, after feelings of anxiety and feelings of depression. Depersonalization is a symptom of anxiety disorders, such as panic disorder. It can also accompany sleep deprivation (often occurring when suffering from jet lag), migraine, epilepsy (especially temporal lobe epilepsy), obsessive-compulsive disorder, stress, anxiety. and in some cases of Low Latent Inhibition."}, {"url": "https://en.wikipedia.org/wiki/Depersonalization", "passage_text": "For the diagnosis, see depersonalization disorder. Depersonalization (or depersonalisation) is an anomaly of self-awareness. It can consist of a reality or detachment within the self, regarding one's mind or body, or being a detached observer of oneself. Depersonalization is a symptom of anxiety disorders, such as panic disorder. It can also accompany sleep deprivation (often occurring when suffering from jet lag), migraine, epilepsy (especially temporal lobe epilepsy), obsessive-compulsive disorder, stress, anxiety. and in some cases of Low Latent Inhibition."}, {"url": "http://psychology.wikia.com/wiki/Depersonalization", "passage_text": "If depersonalization is a psychological symptom then treatment may be dependent on the diagnosis. Depersonalization is often a symptom of borderline personality disorder, which can be treated in the long term with proper psychotherapy and psychopharmacology. However, more specifically, derealization is the feeling that nothing is real, while depersonalization is the feeling that one is literally detached from one's body or world."}, {"url": "http://www.webmd.com/mental-health/depersonalization-disorder-mental-health", "passage_text": "Depersonalization disorder is one of a group of conditions called dissociative disorders. Dissociative disorders are mental illnesses that involve disruptions or breakdowns of memory, consciousness, awareness, identity, and/or perception. The primary symptom of depersonalization disorder is a distorted perception of the body. The person might feel like he or she is a robot or in a dream. Some people might fear they are going crazy and might become depressed, anxious, or panicky. For some people, the symptoms are mild and last for just a short time."}, {"url": "https://en.wikipedia.org/wiki/Depersonalization_disorder", "passage_text": "The core symptom of depersonalization-derealization disorder is the subjective experience of unreality in one's sense of self, or detachment from one's surroundings. Symptoms can be classified as either depersonalization or derealization. Depersonalization is described as feeling disconnected or estranged from one's body, thoughts, or emotions. Individuals experiencing depersonalization may report feeling as if they are in a dream or are watching themselves in a movie."}, {"url": "https://en.wikipedia.org/wiki/Depersonalization_disorder", "passage_text": "Depersonalization disorder (DPD) is a mental disorder in which the sufferer has persistent or recurrent feelings of depersonalization and/or derealization. In the DSM-5 it was combined with Derealization Disorder and renamed to Depersonalization/Derealization Disorder (DDPD). In the DSM-5 it remains classified as a dissociative disorder, while in the ICD-10 it is called depersonalization-derealization syndrome and classified as a neurotic disorder. Symptoms can be classified as either depersonalization or derealization. Depersonalization is described as feeling disconnected or estranged from one's body, thoughts, or emotions. Individuals experiencing depersonalization may report feeling as if they are in a dream or are watching themselves in a movie."}, {"url": "http://www.webmd.com/mental-health/depersonalization-disorder-mental-health", "passage_text": "In this article. Depersonalization disorder is marked by periods of feeling disconnected or detached from one's body and thoughts (depersonalization). The disorder is sometimes described as feeling like you are observing yourself from outside your body or like being in a dream. The primary symptom of depersonalization disorder is a distorted perception of the body. The person might feel like he or she is a robot or in a dream. Some people might fear they are going crazy and might become depressed, anxious, or panicky. For some people, the symptoms are mild and last for just a short time."}]