[{"url": "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC3192549/", "passage_text": "Commonly used examples are “inactive,” “preclinical,” “minimal,” “incipient,” and “subclinical” TB, in contrast to “active” or “clinical” TB. While early disease states are often described in high-risk patient groups, such as HIV-infected persons, these terms are seldom used in the context of the host immune response. While M. tuberculosis is a single organism, the spectrum of TB is manifold. The definitions of terms proposed here for early disease states in asymptomatic individuals are based on their occurrence at the opposite ends"}, {"url": "http://www.msf.org.uk/tuberculosis", "passage_text": "TB caused by a bacterium that is spread through the air. TB is a leading cause of death among people with HIV. In many countries, diagnosis has depended largely on one archaic test for the last 120 years. We are currently seeing an alarming rise in cases of DR-TB and MDR-TB. Hear about TB directly from our patients on our TB&ME blog. TB is the major killer of people living with HIV in Africa. Almost half a million people develop multi drug-resistant strains of the disease every year."}, {"url": "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC3192549/", "passage_text": "SUMMARY AND CONCLUSIONS. While M. tuberculosis is a single organism, the spectrum of TB is manifold. The definitions of terms proposed here for early disease states in asymptomatic individuals are based on their occurrence at the opposite ends of the host immune response."}, {"url": "http://www.homeopathiclaboratories.com/matmed/tub.php", "passage_text": "Of undoubted value in the treatment of INCIPIENT TUBERCULOSIS. Especially adapted to the light-complexioned, narrow-chested subjects. Lax fiber, low recuperative powers, and very susceptible to changes in the weather. Patient always tired; motion causes intense fatigue; aversion to work; wants constant changes. Tuberculinum*. *Tuberculinum bovinum is a homeopathic remedy that requires a prescription from a licensed Medical Doctor or Doctor of Osteopathy. In some states Naturopathic Doctors are licensed to write prescriptions for homeopathic RX items."}, {"url": "http://www.oxforddictionaries.com/definition/english/incipient", "passage_text": "1 Indo-American relations have developed genuine, if incipient, contents. 2  Whether closer follow-up of cases of tuberculosis leads to earlier detection of incipient toxicity or other factors are at work is unclear. 1 At least at the beginning of the incipient movement, conservatives and libertarians could find a common enemy in the growth of the New Deal welfare state. 2 "}, {"url": "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC3192549/", "passage_text": "Based on results from large-scale prospective studies [ 45 ], we propose the term “incipient TB” to describe the constellation of upper lobe opacities over 2 cm 2 in size, not attributable to another disease and occurring in an asymptomatic, apparently immunocompetent host with prior TB exposure. While M. tuberculosis is a single organism, the spectrum of TB is manifold. The definitions of terms proposed here for early disease states in asymptomatic individuals are based on their occurrence at the opposite ends of the host immune response."}, {"url": "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC3192549/", "passage_text": "While incipient TB is early TB with containment of disease, subclinical TB is largely associated with loss of effective containment. Therefore, incipient TB can remain stable for years. In contrast, despite limited prospective data, subclinical TB appears to be rapidly progressive if left untreated. While M. tuberculosis is a single organism, the spectrum of TB is manifold. The definitions of terms proposed here for early disease states in asymptomatic individuals are based on their occurrence at the opposite ends of the host immune response."}, {"url": "http://homeoint.org/books/boericmm/t/tub.htm", "passage_text": "Of undoubted value in the treatment of incipient tuberculosis. Especially adapted to the light-complexioned, narrow-chested subjects. Lax fiber, low recuperative powers, and very susceptible to changes in the weather. Patient always tired; motion causes intense fatigue; aversion to work; wants constant changes. Compare: Bacil; Psorin; Lach. Kalagua (tuberculosis; garlicky odor of all secretions and breath). Teucrium scoradonia. Compare: Thuja (Vaccinosis may block the way of action of Tuberculin-until Thuja has been given and then acts brilliantly (Burnett)."}, {"url": "http://www.msf.org.uk/tuberculosis", "passage_text": "Tuberculosis (TB) is one of the most deadly infectious diseases in the world. Each year it kills 1.4 million people with nearly another nine million suffering from the disease, mainly in developing countries. Hear about TB directly from our patients on our TB&ME blog. TB is the major killer of people living with HIV in Africa. Almost half a million people develop multi drug-resistant strains of the disease every year."}, {"url": "http://www.msf.org.uk/tuberculosis", "passage_text": "TB caused by a bacterium (Mycobacterium tuberculosis) that is spread through the air when infected people cough or sneeze. The disease most often affects the lungs but it can infect any part of the body, including the bones and the nervous system. Hear about TB directly from our patients on our TB&ME blog. TB is the major killer of people living with HIV in Africa. Almost half a million people develop multi drug-resistant strains of the disease every year."}]