[{"url": "http://www.cosmeticsinfo.org/ingredient/tosylamideformaldehyde-resin-0", "passage_text": "Tosylamide/Formaldehyde Resin is used in nail enamel products. It is a soft resin material which, in conjunction with nitrocellulose, forms tough, shiny and durable films on nails. Tosylamide/Formaldehyde Resin is a synthetic resin, sometimes called Toluenesulfonamide/Formaldehyde Resin. It modifies the film-forming characteristics of Nitrocellulose type polymers."}, {"url": "http://blog.birchbox.com/post/34572673108/is-5-free-the-new-standard-for-nail-polish", "passage_text": "The next step: 5-free polishes, which are made without formaldehyde resin and camphor. Click through for more on these two toxic ingredients and for a list of our favorite 5-free brands! Formaldehyde resin: Similar to regular formaldehyde, formaldehyde resin is a nail strengthener. Unfortunately, it is also a skin allergen and can remain active for up to three days after your polish has dried. "}, {"url": "https://prezi.com/hihrg4lbt1j8/polymers-in-nail-polish/", "passage_text": "While it is true that Formaldehyde is toxic, Tosylamide/Formaldehyde Resin used in nail polish is considered to be safe. That’s because the chemical process used to make this polymer completely changes the structure of Formaldehyde so that it is present in very minimal concentrations (usually 0.2%) or even not at all. The resin are ingredients that add depth, gloss and hardness to the film of a nail polish. An example of a polymer used as a resin in nail polish is tosylamide-formaldehyde resin (a soft resin made with Toluenesulfonamide and Formaldehyde.)."}, {"url": "http://loodieloodieloodie.blogspot.com/2011/07/formaldehyde-vs-formaldhehyde-resin.html", "passage_text": "This series may be of use. Formaldehyde Resin: Formaldehyde Resin (or you may see it on ingredient lists as Tosylamide/Formaldehyde Resin or TSFR) is an ingredient in nail polish used to add flexibility and improves adhesion to the nail plate. "}, {"url": "http://www.davidsuzuki.org/what-you-can-do/queen-of-green/faqs/toxics/how-to-choose-a-non-toxic-nail-polish/", "passage_text": "The European Union classifies DBP as very toxic to aquatic organisms. 2. Formaldehyde — (Yes, seriously. In your nail polish.) Formaldehyde is a common ingredient in nail hardeners in concentrations of up to five per cent. In nail polish, tosylamide/formaldehyde resin is used, and may contain residual formaldehyde concentrations of up to 0.5 per cent. The International Agency for Research on Cancer classifies formaldehyde as a known human carcinogen. "}, {"url": "https://answers.yahoo.com/question/index?qid=20100110132936AA56Eg7", "passage_text": "Answers. Best Answer: Formaldehyde does not exist in nail polish. It is used in some nail hardeners but not in the actual polish. A resin, tosylamide/formaldehyde resin, makes the polish tough and resilient. While the resin is manufactured from formaldehyde, once the product becomes a resin, the formaldehyde is chemically changed and essentially no longer present. For example, OPI states they do not use formaldehyde in their polishes, with the exception of 2-3 nail hardeners (which they named). But upon looking at the ingredients of even some of their newer polishes (colors from the 2009 holiday collection or the Spain collection, for example) an..."}, {"url": "http://www.cosmeticsinfo.org/ingredient/tosylamideformaldehyde-resin-0", "passage_text": "More scientific Information: Tosylamide/formaldehyde Resin, also referred to as Toluenesulfonamide/Formaldehyde Resin, is a reaction product of toluenesulfonamide and formaldehyde. It is an amorphous resin and is used in conjunction with the polymer nitrocellulose in nail enamel products. Tosylamide/Formaldehyde Resin is a synthetic resin, sometimes called Toluenesulfonamide/Formaldehyde Resin. It modifies the film-forming characteristics of Nitrocellulose type polymers."}, {"url": "http://personalcaretruth.com/2010/08/exposing-the-formaldehyde-myth/", "passage_text": "Here are the facts: a major ingredient used in nail polish is called “tosylamide formaldehyde resin”. This resin is originally made using several substances, including formaldehyde gas, but the resin is totally different. They’d also know that formaldehyde is not a cosmetic ingredient and never has been! Advocacy groups incorrectly claim that formaldehyde is an ingredient found in nail hardeners, nail polish and preservatives used to prevent bacterial and fungal growth in products such as lotions, creams and shampoos."}]