[{"url": "http://www.thefreedictionary.com/idiosyncrasy", "passage_text": "id·i·o·syn·cra·sy. n. pl. id·i·o·syn·cra·sies. 1. A structural or behavioral characteristic peculiar to an individual or group. 2. A physiological or temperamental peculiarity. 3. id•i•o•syn•cra•sy. 1. a characteristic, habit, mannerism, etc., that is peculiar to or distinctive of an individual. 2. the physical or mental constitution peculiar to an individual. 3. a peculiarity of the physical or mental constitution, esp. a sensitivity to drugs, food, etc."}, {"url": "https://en.wiktionary.org/wiki/idiosyncrasy", "passage_text": "Noun [edit]. idiosyncrasy ‎(plural idiosyncrasies). 1  A behavior or way of thinking that is characteristic of a person. 2  A language or behaviour that is particular to an individual or group. ( 3 medicine) A peculiar individual reaction to a generally innocuous substance or factor. 4  A peculiarity that serves to distinguish or identify. "}, {"url": "http://www.yourdictionary.com/idiosyncrasy", "passage_text": "LINK / CITE ADD TO WORD LIST. noun. The definition of an idiosyncrasy is an unusual behavior, mannerism or reaction of a person or group of people. An example of idiosyncrasy is someone being allergic to air."}, {"url": "http://www.thefreedictionary.com/idiosyncrasies", "passage_text": "id·i·o·syn·cra·sy. n. pl. id·i·o·syn·cra·sies. 1. A structural or behavioral characteristic peculiar to an individual or group. 2. A physiological or temperamental peculiarity. 3. An unusual individual reaction to food or a drug. id•i•o•syn•cra•sy. 1. a characteristic, habit, mannerism, etc., that is peculiar to or distinctive of an individual. 2. the physical or mental constitution peculiar to an individual. 3. a peculiarity of the physical or mental constitution, esp. a sensitivity to drugs, food, etc."}, {"url": "http://legal-dictionary.thefreedictionary.com/idiosyncrasy", "passage_text": "But in spite of the dramatic rudeness which is sometimes of the idiosyncrasy, the true and native colour of his multitudinous dramatis personae, or monologists, Mr. The Guardian by Pater, Walter Horatio View in context. I acknowledge to this ridiculous idiosyncrasy, as a reason why I would give them a little more play. "}, {"url": "http://medical-dictionary.thefreedictionary.com/idiosyncrasy", "passage_text": "idiosyncrasy. 1. a habit or quality of body or mind peculiar to any individual. 2. an abnormal susceptibility to an agent (e.g., a drug) that is peculiar to the individual. adj., adj idiosyncrat´ic. idiosyncrasy. [-sin′krəsē]. Etymology: Gk, idios + synkrasis, mixing together. 1 a physical or behavioral characteristic or manner that is unique to an individual or to a group. 2 an individual's unique hypersensitivity to a particular drug, food, or other substance."}, {"url": "http://medical-dictionary.thefreedictionary.com/idiosyncrasy", "passage_text": "idiosyncrasy. 1. a habit or quality of body or behavior peculiar to any individual animal. 2. an abnormal susceptibility to an agent (e.g. a drug) that is peculiar to the individual animal. idiosyncrasy. [-sin′krəsē]. Etymology: Gk, idios + synkrasis, mixing together. 1 a physical or behavioral characteristic or manner that is unique to an individual or to a group. 2 an individual's unique hypersensitivity to a particular drug, food, or other substance."}, {"url": "http://dictionary.cambridge.org/dictionary/english/idiosyncrasy", "passage_text": "idiosyncrasy noun [C usually plural]. › a ​strange or ​unusual ​habit, way of ​behaving, or ​feature that someone or something has: She often ​cracks her ​knuckles when she's ​speaking-it's one of her little idiosyncrasies. "}, {"url": "http://dictionary.cambridge.org/us/dictionary/english/idiosyncrasy", "passage_text": "idiosyncrasy noun [C]. › a ​strange or ​unusual ​habit, way of ​behaving, or ​feature: One of her many idiosyncrasies is always ​smelling a ​book before ​opening it. (Definition of idiosyncrasy from the Cambridge Academic Content Dictionary © Cambridge University Press). "}]