[{"url": "http://www.wikihow.com/Size-a-Road-Bike", "passage_text": "Two Methods: Select Your Frame Adjust the seat height. Road bikes should be adjusted to fit each particular rider. Sizing a road bike to fit you will help you achieve comfort and efficiency from your road bike. All of the tools you need to size your road bike are available at a hardware store. Use these tips to size a road bike. Measure your inseam. 1  Stand with your back against a wall. 2  Place your feet 6 to 8 inches (15 to 20 cm) apart. 3  Stand a book upright between your legs. 4  Lift the book to your crotch. 5  Get an assistant to measure the distance between the top of the book and the ground."}, {"url": "http://www.wikihow.com/Size-a-Road-Bike", "passage_text": "1 A total of 48 inches (122 cm) gives you 24 inches (61 cm). 2  Add 4 inches (10.2 cm) to that number. 3  You now have 28 inches (71.2 cm). 4  From one end of the top stem to the tube where the handlebars attach to the frame, your bike should measure as close to 28 inches (71.2 cm) as possible. Measure your inseam. 1  Stand with your back against a wall. 2  Place your feet 6 to 8 inches (15 to 20 cm) apart. 3  Stand a book upright between your legs. 4  Lift the book to your crotch. 5  Get an assistant to measure the distance between the top of the book and the ground."}, {"url": "http://www.wikihow.com/Measure-and-Buy-the-Correct-Bike", "passage_text": "Know how to measure a bike's frame size. The main factor in buying the right bike is the frame size. The frame is the metal body of the bike, and it is measured in three key places. While most bike frames utilize only one measurement for sizing, knowing how to locate all three is key to getting the right size bike. "}, {"url": "http://www.ebicycles.com/bicycle-tools/measure-frame/road-bike", "passage_text": "Measuring a Road Bike. Road bikes come in various styles, designed for different types of riding and rider preferences. The frames are made from steel, aluminum or carbon fiber, and, depending on the size and age of the bike, they use one of several tire sizes: 26, 27 1/4 and 700C. Road bike frames are all measured the same way, using the the seat tube length. Here are several popular road bike styles, each with detailed measuring instructions and a frame diagram showing where to measure"}, {"url": "http://www.youtube.com/watch?v=B7mPbF0U270", "passage_text": "Road bikes are measured in many different ways. This makes choosing the right size for you difficult. GCN are here to help! Subscribe to GCN on YouTube: http://gcn.eu/gcnsubs. With so many different frame sizes and measurements on the market, choosing the correct size can seem daunting. "}, {"url": "http://www.sierratradingpost.com/lp2/bike-fit-guide/", "passage_text": "To obtain your ideal seat tube height (or “size”) for a road bike, multiply your inseam (in cm) by .67 to get C-T length (or by .65 to get the C-C size for your seat tube). If you measured your height and inseam in inches, convert inches to centimeters by multiplying inches by 2.54 (Example: 30 inches x 2.54 = 76 cm). "}, {"url": "http://www.hartscyclery.com/bicyclefit/bikefit.html", "passage_text": "The bike measurements are given for the frame of the bike, which, for road and mountain bikes, is the distance from the top of the seat tube (rather than the seat) to the center of the bottom bracket. For a mountain bike you normally require a frame 10-12 centimeters smaller than a road bike. If you are considering a Road bike we suggest using this frame sizing tool at Competitive Cyclist (though it requires more complicated measurements). Sizing charts using your height and bicycling inseam (the distance from the ground to your crotch) can also give you a basic idea of the frame size you need for your bike."}, {"url": "http://bicycling.about.com/od/howtoride/a/bike_sizing.htm", "passage_text": "As you can see from the chart above, road bikes frames are measured in centimeters. Sizing goes from about 46 cm which is what someone on the small size – under five feet tall -- might ride up to 64 cm, which is best suited to a taller rider, someone 6-2 and above. Use the sizing chart below to find the right sized road bike for you. Knowing your height and inseam measurements, you should be able to determine what size frame will be most comfortable for you. Of the two measurements, height and inseam, inseam is more important."}, {"url": "http://www.ebicycles.com/bicycle-tools/measure-frame/road-bike/classic", "passage_text": "1 Measure the distance between the two points (C-T) - this is the length of the seat tube. 2  Record your measurement in both centimeters (cm) and inches (to the nearest half-inch). 3  Select your bike size from the drop-down on the right to see a rider height chart. The top tube is parallel to the road, giving the frame more stability and support. The frame size is determined by measuring the length of the seat tube, in centimeters. The instructions below explain how to measure a classic road bike. Classic Road Bike."}]