[{"url": "http://www.legendsofamerica.com/we-westwardexpansion.html", "passage_text": "One factor in encouraging settlers to move west was the Homestead Act, passed in 1862, which allowed settlers to claim 160 acres of land for free. Another important factor was completion of the first transcontinental railroad in 1869 which led to much more rapid Western migration. "}, {"url": "http://www.sparknotes.com/history/american/westwardexpansion/section12.rhtml", "passage_text": "The Homestead Act, passed in 1862, offered 160 acres of land to anyone who would pay $10, live on the land for five years, and cultivate and improve it. The Act encouraged many additional Americans and foreigners to move to the undeveloped West. "}, {"url": "http://www.historynet.com/westward-expansion", "passage_text": "The California Gold Rush was a major factor in expansion west of the Mississippi. That westward expansion was greatly aided by the completion of the Transcontinental Railroad in 1869, and passage of the Homestead Act in 1862."}, {"url": "http://walvoordhistory.com/destinations/the-homestead-act-of-1862/", "passage_text": "Millions of Acres of Land for the Homestead Act. The cry was FREE LAND!! The Homestead Act of 1862, was one of the most significant and enduring events in the westward expansion of the United States. By granting 160 acres of free land to claimants, it allowed nearly any man or woman a chance to live the American dream"}, {"url": "http://study.com/academy/lesson/westward-expansion-the-homestead-act-of-1862-the-frontier-thesis.html", "passage_text": "The Homestead Act. Another spike in westward migration came with the Homestead Act of 1862 and similar bills in the 1870s. Beginning on New Year's Day, 1863, individuals could apply for a 160-acre homestead west of the Mississippi River. The land was free, but in order to get the deed, the owner had to build a 12x14' home and grow crops for five years. The Homestead Act of 1862 and other similar legislation encouraged more settlement by giving away free land in the Great Plains to individuals."}, {"url": "http://www.ducksters.com/history/westward_expansion/homestead_act_land_rush.php", "passage_text": "The Homestead Act became law in 1862 when it was signed by President Abraham Lincoln. Under the new law a U.S. Citizen could get 160 acres of unoccupied land west of the Mississippi River and east of the Rocky Mountains. They could keep the land if they lived on the land for five years and made improvements to the land. With much of the east coast of America already developed, the United States government wanted to encourage people to move out west. They decided to help people out by offering them free land through a law called the Homestead Act."}, {"url": "http://chnm.gmu.edu/tah-loudoun/blog/lessons/the-homestead-act/", "passage_text": "In 1862, the Homestead Act was passed into law. Any US citizen or intended US citizen could file an application with the government. If accepted, the person would receive 160 acres of government land. The homesteader had to live on the land for five years, build a home, and grow crops. "}, {"url": "http://www2.lhric.org/pocantico/westward_expansion/homesteadact.htm", "passage_text": "The Homestead Act was very important because it made a significant change in settling land further west. In the overpopulated eastern states, the Homestead Act encouraged people to move west and settle the land further west. The eastern states that were overpopulated became less populated because the pioneers left those states so they could have their own land. The Homestead Act was a way for the pioneers to get land. The government said that any U.S. citizen who did not fight against the government could file an application to receive land. A citizen could get up to 160 acres of land, as long as they were 21 years old or older"}, {"url": "http://www.ducksters.com/history/westward_expansion/homestead_act_land_rush.php", "passage_text": "History Westward Expansion. With much of the east coast of America already developed, the United States government wanted to encourage people to move out west. They decided to help people out by offering them free land through a law called the Homestead Act. A New Law"}]