[{"url": "https://www.choice.com.au/travel/money/travel-money/articles/travel-money-cards", "passage_text": "There wasn't enough of a consistent exchange rate difference to make any one travel money card stand out from the crowd, with the exception of OzForex – though they all help themselves to a nice little margin on top of the official exchange rate. That depends on the length of your trip and how much money you plan to throw around. If you're travelling for a couple of weeks or more and shopping is on the agenda, a travel money card is a good idea."}, {"url": "https://www.choice.com.au/money/banking/foreign-transactions/articles/foreign-transaction-fees", "passage_text": "Exchange rates. We compared the exchange rates of the big four banks for the euro (€), pound (£) and US dollar on the same day (24 April 2012) and found that three – ANZ, Westpac and NAB – had exchange rates that were about 4.5% higher than mid-market rates for cash and travel cards, not including fees. Conversion costs. We used the CBA as an example of the big four banks in general, although the CBA exchange rate was somewhat worse than the others on the day we tested when it came to cash or travel money cards."}, {"url": "http://www.westpac.co.nz/fx-travel-migrant/travel/travel-card/", "passage_text": "The Travel card works the same way as other Prepaid cards. 1  just buy your Travel card from any Westpac branch (they cost $20), load it with your chosen amount of money (minimum first deposit of $50), and load a pin number. Take your Travel card overseas, pre-load some funds, and use it like a credit card but without the monthly bill."}, {"url": "https://www.choice.com.au/travel/money/travel-money/articles/travel-money-cards", "passage_text": "1 All these cards charge similar ATM fees for the currencies they cover and give comparable exchange rates. 2  The exception is the OzForex Travel Card, which consistently offered better exchange rates, though they would be partially offset by a $15 purchase and $10 closing fee. That depends on the length of your trip and how much money you plan to throw around. If you're travelling for a couple of weeks or more and shopping is on the agenda, a travel money card is a good idea."}, {"url": "http://www.westpac.co.nz/fx-travel-migrant/travel/travel-card/", "passage_text": "1 just buy your Travel card from any Westpac branch (they cost $20), load it with your chosen amount of money (minimum first deposit of $50), and load a pin number. 2  while you’re overseas, you can top up the card using Online Banking or Phone Banking (or ATMs, or at a Westpac branch if you are in NZ). Take your Travel card overseas, pre-load some funds, and use it like a credit card but without the monthly bill."}, {"url": "http://www.westpac.com.au/travel-centre/travel-money-card/currencies-fees-rates/", "passage_text": "Travel money card-currencies, rates and fees. What you should know when loading your travel money card with currencies to make purchases. Choose from 11 different currencies and load up to 5 currencies at any one time, one of which must always be Australian dollars. Available Westpac Global Currency Card currencies: 1  US Dollars (USD). 2  Hong Kong Dollars (HKD). "}, {"url": "http://www.westpac.co.nz/fx-travel-migrant/foreign-exchange-and-international/foreign-exchange-rates/", "passage_text": "1.6575. Westpac will buy or sell cash only in the currencies where a Westpac buys cash rate is displayed. Rates are updated Monday to Friday excluding public holidays. Certain transactions are subject to a commission charge and/or fee(s) . T/T = telegraphic transfer received from overseas; T/C = travellers cheques"}, {"url": "http://www.westpac.com.au/travel-centre/travel-money-card/", "passage_text": "Travel money card. A reloadable prepaid Visa money card that can be used to make payments in multiple currencies. Westpac Global Currency Card is a simple, secure and convenient way to spend, whether overseas or online. No ATM withdrawal fee at over 50,000 ATMs via Global ATM Alliance partners 1. Avoid the 3% foreign transaction fee when shopping or getting cash in a currency loaded on the card 2."}, {"url": "https://gcc.westpac.com.au/login/cardLogin", "passage_text": "Cuscal Limited is the issuer of the product but does not take deposits from you. Westpac is not responsible for and does not guarantee this product or card or your ability to access any prepaid value or the use of this product or card. Internet connection is needed to access the Westpac Global Currency Card app. Normal mobile data charges apply. We support Apple iPhone iOS 6 and above and Android™ 2.3 and above. Apple, the Apple logo and iPhone are trademarks of Apple Inc., registered in the U.S. and other countries."}, {"url": "https://gcc.westpac.com.au/support", "passage_text": "Cuscal Limited is the issuer of the product but does not take deposits from you. Westpac is not responsible for and does not guarantee this product or card or your ability to access any prepaid value or the use of this product or card. Internet connection is needed to access the Westpac Global Currency Card app. Normal mobile data charges apply."}]