[{"url": "http://www.answers.com/Q/Where_was_the_Mayan_civilization_located", "passage_text": "1 Guatemala Festivals That are Worth Your Attention Guatemala is located in Central America, bordered by Mexico, Honduras, El Salvador, Belize, the Pacific Ocean, and the Caribbean Sea. 2  The country's name comes from the Mayan …. Today, there millions of Maya living in the  Yucatan Peninsula in Mexico. Many of them still speak a modern-day  version of the Mayan language and even more of them still pr … actice  the Mayan religion (See Popol Vuh for the text of their bible)."}, {"url": "http://www.ducksters.com/history/aztec_maya_inca.php", "passage_text": "Over the course of Maya history, different city-states came into power such as El Mirador, Tikal, Uxmal, Caracol, and Chichen Itza. The Maya were located in Central America in a region that is today made up of southern Mexico, the Yucatan Peninsula, Guatemala, Belize, and northern El Salvador. They built hundreds of cities filled with large stone structures. The Maya are perhaps best known today for their many pyramids. "}, {"url": "http://www.everyculture.com/wc/Mauritania-to-Nigeria/Maya.html", "passage_text": "1 • INTRODUCTION. Today's Maya are descended from one of the great civilizations of the Americas. They live in the same regions of Mexico, Guatemala, Belize, El Salvador, and Honduras as their ancestors and retain many of their ancient traditions. The true figure is probably between 8 and 10 million, including about half of Guatemala's total population of 10 million, close to 2 million Maya in the Mexican Yucatan, yucatán and additional numbers In'mexico S chiapas, state as well As, Belize, honduras And El. salvador"}, {"url": "https://en.wikipedia.org/wiki/Maya_civilization", "passage_text": "The Maya civilization developed in an area that encompasses southeastern Mexico, all of Guatemala and Belize, and the western portions of Honduras and El Salvador. The Maya civilization was a Mesoamerican civilization developed by the Maya peoples, noted for the Maya hieroglyphic script, the only known fully developed writing system of the pre-Columbian Americas, as well as for its art, architecture, and mathematical and astronomical systems."}, {"url": "http://www.answers.com/Q/Where_was_the_Mayan_civilization_located", "passage_text": "It wasn't located in South America at all. The Maya culture was Mesoamerican (in Central America): from eastern and southern Mexico, through Guatemala, Belize and El S … alvador to western Honduras (with the famous Copan ruins). + 5 others found this useful. Xristian Mazes. Today, there millions of Maya living in the  Yucatan Peninsula in Mexico. Many of them still speak a modern-day  version of the Mayan language and even more of them still pr … actice  the Mayan religion (See Popol Vuh for the text of their bible)."}, {"url": "http://www.ancient.eu/Maya_Civilization/", "passage_text": "The Maya are an indigenous people of Mexico and Central America who have continuously inhabited the lands comprising modern-day Yucatan, Quintana Roo, Campeche, Tabasco, and Chiapas in Mexico and southward through Guatemala, Belize, El Salvador and Honduras. "}, {"url": "https://en.wikipedia.org/wiki/Maya_civilization", "passage_text": "The Maya civilization occupied a wide territory that included southeastern Mexico and northern Central America; this area included the entire Yucatan Yucatán, peninsula and all of the territory now incorporated into the modern countries Of guatemala And, belize as well as the western portions Of honduras And El. salvador The Maya civilization was a Mesoamerican civilization developed by the Maya peoples, noted for the Maya hieroglyphic script, the only known fully developed writing system of the pre-Columbian Americas, as well as for its art, architecture, and mathematical and astronomical systems."}, {"url": "http://penn.museum/documents/publications/expedition/PDFs/54-1/who-were-the-maya.pdf", "passage_text": "Maya civilization was part of this independent evolution-ary process. Located in eastern Mesoamerica, the ancient Maya flourished in a diverse homeland in Mexico, Guatemala, Belize, Honduras, and El Salvador until the Spanish Conquest. By RoBeRt ShaReR t Maya sites that have been identified and Jennifer McAuleyexplored are located in Mexico, Guatemala, Belize, Honduras, and El Salvador. This map shows the location of various sites mentioned in this issue of Expedition."}, {"url": "http://www.answers.com/Q/Where_were_the_mayans_located", "passage_text": "It wasn't located in South America at all. The Maya culture was Mesoamerican (in Central America): from eastern and southern Mexico, through Guatemala, Belize and El S … alvador to western Honduras (with the famous Copan ruins). + 5 others found this useful. Xristian Mazes. Today, there millions of Maya living in the  Yucatan Peninsula in Mexico. Many of them still speak a modern-day  version of the Mayan language and even more of them still pr … actice  the Mayan religion (See Popol Vuh for the text of their bible)."}]