[{"url": "https://en.wikipedia.org/wiki/Kavanagh_(surname)", "passage_text": "Kavanagh and Kavanaugh are anglicized variations of the Irish Gaelic surname Caomhanach (Caomhánach cʌoṁʌ̃nʌċ in Traditional gaelic). Script the surname was first assumed By Domhnall (caomhanach caomhánach the eldest son of the 12th century King, Of Leinster Diarmait) mac Murchada. in ireland The surname was first assumed by Domhnall Caomhanach (caomhánach the eldest son of the 12th Century king Of, Leinster Diarmait Mac) murchada In. ireland"}, {"url": "http://www.paulkavanagh.com/en/Kavanagh-Name-History-of-the-Kavanagh-Clan.html", "passage_text": "The name Kavanagh or Cavanagh or even the American version Cananaugh, and all its variations is derived from the Irish Gaelic name Caomhanach. Caomhánach So i myself Am Pol, caomhanach son Of, Kavanagh king Of, Leinster king Of. ireland So I myself am Pol Caomhanach, son of Kavanagh, King of Leinster, King of Ireland. Caomhanach caomhánach was a nickname adopted by a 12 Century king Of, Leinster Domhnall MacMurrough (Caomhánach Macmurrough). donal kavanagh"}, {"url": "https://en.wikipedia.org/wiki/Kavanagh_(surname)", "passage_text": "From Wikipedia, the free encyclopedia. Kavanagh or Kavanaugh is a surname of Irish origin, Caomhanach caomhánach In Irish. Gaelic it is Properly Mac Murchadha (caomhanach caomhánach an example Of an; irish AGNOMEN See O ó Catharnaigh sionnach Or Fox), of fir teathbha but is 'Often' now rendered 'CAOMHANACH Caomhánach'. or rarely o ó caomhanaigh caomhánaigh The surname was first assumed by Domhnall Caomhanach (caomhánach the eldest son of the 12th Century king Of, Leinster Diarmait Mac) murchada In. ireland"}, {"url": "http://ireland-calling.com/irish-names-kavanagh/", "passage_text": "Kavanagh – Kings of Leinster. Kavanagh is a popular surname in Ireland and originated in the Leinster regions of Wexford and Carlow. Back to Irish surnames. It dates back to before the 10th century and comes from the personal name ‘Caomhanach’. Caomhanach is an old Gaelic word that means ‘born handsome’. There are several variations of the name including Cavan, Cavanagh, Cavanaugh, Caven and Kavanaugh. Unlike many Irish surnames, Kavanagh has never contained the ‘O’ or ‘Mac’ prefixes throughout its history."}, {"url": "http://www.paulkavanagh.com/en/Kavanagh-Name-History-of-the-Kavanagh-Clan.html", "passage_text": "A history of my surname Chaomhanach. Chaomhánach the Name kavanagh Or cavanagh or even The american Version, cananaugh and all its variations is derived from The Irish gaelic Name. Caomhanach Caomhánach so i Myself Am, pol caomhanach Son, Of kavanagh King, Of leinster King. of ireland So I myself am Pol Caomhanach, son of Kavanagh, King of Leinster, King of Ireland. Caomhanach caomhánach was a nickname adopted by a 12 Century king Of, Leinster Domhnall MacMurrough (Caomhánach Macmurrough). donal kavanagh"}, {"url": "http://www.paulkavanagh.com/en/Kavanagh-Name-History-of-the-Kavanagh-Clan.html", "passage_text": "So I myself am Pol Caomhanach, son of Kavanagh, King of Leinster, King of Ireland. Caomhanach caomhánach was a nickname adopted by a 12 Century king Of, Leinster Domhnall MacMurrough (Caomhánach Macmurrough). Donal kavanagh domhnall was the eldest son of The Historic irish King, Of leinster Diarmait (Mac MacMurrough). dermot macmurrough So I myself am Pol Caomhanach, son of Kavanagh, King of Leinster, King of Ireland. Caomhanach caomhánach was a nickname adopted by a 12 Century king Of, Leinster Domhnall MacMurrough (Caomhánach Macmurrough). d"}, {"url": "http://www.irishsurnames.com/cgi-bin/gallery.pl?name=kavanagh&capname=Kavanagh&letter=k", "passage_text": "KAVANAGH. The name Kavanagh in Ireland is derived from the Gaelic word 'Caomhanach' which was an eipthet to a member of the MacMurrough Sept of Leinster. The name is among the sixty most frequently found in Ireland and is most common in Counties Wexford and Carlow. Cavanagh is a variant of this name"}, {"url": "https://en.wikipedia.org/wiki/Kavanagh_(surname)", "passage_text": "Kavanagh or Kavanaugh is a surname of Irish origin, Caomhanach caomhánach In Irish. gaelic The surname was first assumed by Domhnall Caomhanach (caomhánach the eldest son of the 12th Century king Of, Leinster Diarmait Mac) murchada In. ireland"}, {"url": "http://www.paulkavanagh.com/en/Kavanagh-Name-History-of-the-Kavanagh-Clan.html", "passage_text": "A history of my surname Chaomhanach. Chaomhánach the Name kavanagh Or cavanagh or even The american Version, cananaugh and all its variations is derived from The Irish gaelic Name. caomhanach caomhánach So I myself am Pol Caomhanach, son of Kavanagh, King of Leinster, King of Ireland. Caomhanach caomhánach was a nickname adopted by a 12 Century king Of, Leinster Domhnall MacMurrough (Caomhánach Macmurrough). donal kavanagh"}]