[{"url": "http://bioweb.uwlax.edu/bio203/s2007/wolf_bri2/", "passage_text": "Bordetella pertussis. Bordetella pertussis (B. Pertussis) is a small, coccobacillus. Coccobacillus are rod-shaped bacteria. Cocco comes from cocci meaning spherical shaped and bacillus comes from bacilli meaning elongated. Three species in this genus are known to be pathogenic to humans. B. pertussis and B. parapertussis are very similar species. Both species cause pertussis (whooping cough) in humans and are separated merely by the toxins they release during infection. B. parapertussis releases toxins that seem to cause a milder form of pertussis (whooping cough). B. bronchiseptica causes respiratory disease in various mammals and occasionally in humans"}, {"url": "https://en.wikipedia.org/wiki/Bordetella_pertussis", "passage_text": "Bordetella pertussis is a Gram-negative, aerobic coccobacillus capsulate of the genus Bordetella, and the causative agent of pertussis or whooping cough. Unlike B. bronchiseptica, B. pertussis is not motile. "}, {"url": "http://www.cdc.gov/pertussis/clinical/disease-specifics.html", "passage_text": "Pertussis is an acute infectious disease caused by the bacterium Bordetella pertussis. In the 20 th century, pertussis was one of the most common childhood diseases and a major cause of childhood mortality in the United States. Pathogenesis. Pertussis is primarily a toxin-mediated disease. The bacteria attach to the cilia of the respiratory epithelial cells, produce toxins that paralyze the cilia, and cause inflammation of the respiratory tract, which interferes with the clearing of pulmonary secretions."}, {"url": "http://www.cdc.gov/pertussis/about/causes-transmission.html", "passage_text": "Causes. Pertussis, a respiratory illness commonly known as whooping cough, is a very contagious disease caused by a type of bacteria called Bordetella pertussis. These bacteria attach to the cilia (tiny, hair-like extensions) that line part of the upper respiratory system. While pertussis vaccines are the most effective tool we have to prevent this disease, no vaccine is 100% effective. If pertussis is circulating in the community, there is a chance that a fully vaccinated person, of any age, can catch this very contagious disease."}, {"url": "http://www.niaid.nih.gov/topics/pertussis/Pages/causes.aspx", "passage_text": "Espanol: Español causas y. Transmision, transmisión pertussis a respiratory illness commonly known as, whooping cough is a very contagious disease caused by a type of Bacteria called. bordetella pertussis Transmission. Pertussis is a very contagious disease only found in humans. It is spread from person to person. People with pertussis usually spread the disease to another person by coughing or sneezing or when spending a lot of time near one another where you share breathing space."}, {"url": "http://www.ohsu.edu/xd/health/for-healthcare-professionals/infection-control/resources-for-staff/specific-organisms-and-diseases/pertussis.cfm", "passage_text": "Pertussis (whooping cough) is a highly contagious bacterial disease caused by Bordetella pertussis (a small, aerobic, Gram-negative pleomorphic bacillus).Transmission occurs via respiratory secretions on the hands or in aerosolized form. Pertussis can cause serious illness in infants, children and adults. The disease starts like the common cold, with runny nose or congestion, sneezing, and maybe mild cough or fever. Then after 1 to 2 weeks sever coughing can begin."}, {"url": "https://microbewiki.kenyon.edu/index.php/Haemophilus_pertussis_(Whooping_Cough)", "passage_text": "Description. Pertussis, more commonly known as “whooping cough,” had its first epidemic in Paris, France in 1578. Thomas Sydenham named it “pertussis,” meaning “violent cough.” The organism that causes this disease is called Heamophilus pertussis or Bordetella pertussis. It was first isolated in 1906 by Jules Bordet. "}, {"url": "http://www.niaid.nih.gov/topics/pertussis/Pages/causes.aspx", "passage_text": "Causes. Pertussis, a respiratory illness commonly known as whooping cough, is a very contagious disease caused by a type of bacteria called Bordetella pertussis. Transmission. Pertussis is a very contagious disease only found in humans. It is spread from person to person. People with pertussis usually spread the disease to another person by coughing or sneezing or when spending a lot of time near one another where you share breathing space."}]