[{"url": "http://www.medscape.com/viewarticle/752878", "passage_text": "Being pregnant can be a stress test for the thyroid. The size of the gland increases by 10%. Production of thyroid hormones T3 and T4 increases by about 50%. As a result, the normal thyroid-stimulating hormone (TSH) level during pregnancy is lower than the normal nonpregnancy level. First trimester: less than 2.5 with a range of 0.1-2.5. Second trimester: 0.2-3.0. Third trimester: 0.3-3.0. If the TSH is greater than 2.5 at any time during pregnancy, T4 levels should be checked to determine whether the hypothyroidism is overt or subclinical."}, {"url": "http://www.medscape.com/viewarticle/732415", "passage_text": "Hypo-and hyperthyroidism are both associated with increased pregnancy loss. In addition, it has been shown that women with normal thyroid-stimulating hormone (TSH) levels, but with evidence for thyroid autoimmunity, are at approximately a 2-fold increased risk for pregnancy loss."}, {"url": "http://www.webmd.com/women/thyroid-stimulating-hormone-tsh?page=2", "passage_text": "Results. A thyroid-stimulating hormone (TSH) blood test is used to check for thyroid gland problems. The normal values listed here-called a reference range-are just a guide. These ranges vary from lab to lab, and your lab may have a different range for what's normal"}, {"url": "http://hyperthyroidismsymptomsx.com/tsh-range", "passage_text": "TSH Range. The function of thyroid stimulating hormone (or TSH) is to regulate the normal levels of thyroid hormones in the body. It is a peptide hormone secreted by the thyrotrope cells of anterior pituitary gland. The TSH activates the thyroid gland to produce both Triiodothyronine(T3) and thyroxine (T4) hormones. Normal Levels in children. 1  The range of normal TSH levels for full term newborns is higher, as it can range from between 1.3 and 16 micro units per ML of blood. 2  The TSH range gradually reduces to 0.9 to 7.7 micro units per milliliter after 30 days."}, {"url": "http://www.thyroid.org/patient-thyroid-information/ct-for-patients/vol-3-issue-8/vol-3-issue-8-p-5-6/", "passage_text": "First Trimester TSH levels between 2.5 and 5.0 are associated with increased pregnancy loss. ABBREVIATIONS & DEFINITIONS. Thyroxine (T4) — the major hormone secreted by the thyroid gland. Thyroxine is broken down to produce Triiodothyronine which causes most of the effects of the thyroid hormones. "}, {"url": "http://hyperthyroidismsymptomsx.com/tsh-range", "passage_text": "1 The range of normal TSH levels for full term newborns is higher, as it can range from between 1.3 and 16 micro units per ML of blood. 2  The TSH range gradually reduces to 0.9 to 7.7 micro units per milliliter after 30 days. 3  The TSH narrows to 0.6 to 5.5 micro units per milliliter in school going children. Normal Levels in children. 1 "}, {"url": "http://www.endocrineweb.com/conditions/hypothyroidism/hypothyroidism-diagnosis", "passage_text": "This leads to high levels of TSH and low levels of free T4. If your free T4 levels are too low—the normal range for T4 is 5 to 13.5 micrograms per deciliter—it's a possible indicator that you have hypothyroidism, even if your previous TSH tests came back normal. Again, the normal ranges vary from lab to lab. Anti-thyroid Microsomal Antibodies Testing. Your doctor will measure your TSH levels with a blood test. TSH levels are determined by ranges (all figures in mU/L—milliunits per liter). Below are the ranges, according to the American Thyroid Association. However, these numbers are not set in stone."}, {"url": "http://www.perinatology.com/Reference/Reference%20Ranges/TSH.htm", "passage_text": "* References ranges recommended by the American Thyroid Association if trimester-specific reference ranges for TSH are not available in the laboratory. "}, {"url": "http://www.medscape.com/viewarticle/732415", "passage_text": "During pregnancy, a 30%-40% increased need for thyroid hormones is the result of increased placental uptake, higher thyroid-binding globulin levels, and greater blood volume. In addition, it has been shown that women with normal thyroid-stimulating hormone (TSH) levels, but with evidence for thyroid autoimmunity, are at approximately a 2-fold increased risk for pregnancy loss."}]