[{"url": "http://www.sciencedirect.com/science/article/pii/S1201971209000952", "passage_text": "We report a case of fungemia caused by K. ohmeri in a 71-year-old man with cellulitis. The patient was sent to the emergency room due to leg edema, fever, and change of consciousness. During hospitalization, a series of examinations including blood cultures were performed. In the last 20 years, only 19 cases have been described in the literature. All reported cases had significant predisposing conditions including diabetes mellitus, malignancy, use of catheters, etc. However, the association between cellulitis of tinea pedis and fluconazole-resistant K. ohmeri has not been described."}, {"url": "http://www.sciencedirect.com/science/article/pii/S1201971209000952", "passage_text": "Kodamaea ohmeri, previously known as Pichia ohmeri or Yamadazyma ohmeri, is a yeast within the family of Saccharomycetaceae. 16 K. ohmeri is the teleomorphic form of Candida guilliermondii and is widely used for the fermentation of fruit, pickles, and rinds. In the last 20 years, only 19 cases have been described in the literature. All reported cases had significant predisposing conditions including diabetes mellitus, malignancy, use of catheters, etc. However, the association between cellulitis of tinea pedis and fluconazole-resistant K. ohmeri has not been described."}, {"url": "http://www.pediatriconcall.com/Journal/Article/FullText.aspx?artid=878&type=J&tid=&imgid=&reportid=468&tbltype=", "passage_text": "Kodamaea ohmeri isolates from patients in a university hospital: identification, antifungal susceptibility, and pulse-field gel electrophoresis analysis. J Clin Microbiol. 2007;45:1005—1010.Poojary A, Sapre G. Kodamaea ohmeri Infection in a Neonate. Use of any information is solely at the user's own risk. The appearance of advertisement or product information in the various section in the website does not constitute an endorsement or approval by Pediatric Oncall of the quality or value of the said product or of claims made by its manufacturer."}, {"url": "http://www.pediatriconcall.com/Journal/Article/FullText.aspx?artid=878&type=J&tid=&imgid=&reportid=468&tbltype=", "passage_text": "Kodamaea ohmeri, formerly known as Pichia ohmeri or Yamadazyma ohmeri, is ascosporogenic yeast which usually occurs in the haploid state within the family of Saccharomycetaceae. (7)The genus Kodamaea currently comprises five species: K. anthrophila, K. kakaduensis, K. laetipori, K. nitidulidarum, and K. ohmeri. (8)Kodamaea ohmeri is a rare clinical isolate that has recently become known to cause various human infections. Use of any information is solely at the user's own risk. The appearance of advertisement or product information in the various section in the website does not constitute an endorsement or approval by Pediatric Oncall of the quality or value of the said product or of claims made by its manufacturer."}, {"url": "http://jcm.asm.org/content/45/10/3456.full", "passage_text": "We describe a case of Pichia farinosa bloodstream infection in a lymphoma patient. Phenotypic methods failed to identify the isolate, which was identified by sequence-based methods. This case highlights the importance of implementing molecular methods for the identification of rare fungal pathogens. In recent years, the number of reports of human infections caused by other Pichia species, including Pichia anomala (2, 5, 13), Pichia ohmeri (11, 12), and Pichia fabianii (3), has increased. In most of these studies (2, 5, 11, 12), Pichia species were first correctly diagnosed by phenotypic method"}, {"url": "http://www.sciencedirect.com/science/article/pii/S1201971209000952", "passage_text": "Kodamaea (Pichia) ohmeri is an unusual pathogen of mycosis. In the last 20 years, only 19 cases have been described in the literature. All reported cases had significant predisposing conditions including diabetes mellitus, malignancy, use of catheters, etc. However, the association between cellulitis of tinea pedis and fluconazole-resistant K. ohmeri has not been described."}, {"url": "http://www.pediatriconcall.com/Journal/Article/FullText.aspx?artid=878&type=J&tid=&imgid=&reportid=468&tbltype=", "passage_text": "1 Kodamaea ohmeri as an emerging pathogen: a case report and review of the literature.Med Mycol. 2011;49:766-770. 2  Yamada Y, Suzuki T, Matsuda M, Mikata K. The phylogeny of Yamadazyma ohmeri [Etchells et Bell] Billon-Grand based on the partial sequences of 18S and 26S ribosomal RNAs: the proposal of Kodamaea gen. Use of any information is solely at the user's own risk. The appearance of advertisement or product information in the various section in the website does not constitute an endorsement or approval by Pediatric Oncall of the quality or value of the said product or of claims made by its manufacturer."}, {"url": "http://www.sciencedirect.com/science/article/pii/S1201971209000952", "passage_text": "Kodamaea (Pichia) ohmeri was formerly considered a contaminant, but is now known to be a significant human pathogen that has been shown to cause fungemia, endocarditis, funguria, and peritonitis in immunocompromised patients. In the last 20 years, only 19 cases have been described in the literature. All reported cases had significant predisposing conditions including diabetes mellitus, malignancy, use of catheters, etc. However, the association between cellulitis of tinea pedis and fluconazole-resistant K. ohmeri has not been described."}, {"url": "http://jcm.asm.org/content/45/10/3456.full", "passage_text": "The only published case of human disease due to P. farinosa was described for a 12-year-old girl with teratoma who had apparent catheter-related fungemia that resolved after removal of the catheter (1). Colonization of oral mucosa with P. farinosa was reported for two immunocompromised patients (6, 14). In recent years, the number of reports of human infections caused by other Pichia species, including Pichia anomala (2, 5, 13), Pichia ohmeri (11, 12), and Pichia fabianii (3), has increased. In most of these studies (2, 5, 11, 12), Pichia species were first correctly diagnosed by phenotypic methods"}]