[{"url": "http://animals.mom.me/long-duck-hatch-11266.html", "passage_text": "Domesticated ducks take 28 days to hatch. The one exception is Muscovy ducks. These ducks have bumpy red faces and are white, black or a mix of white and black. This breed takes 35 days from the beginning of incubation to hatch."}, {"url": "http://www.ducks.org/conservation/waterfowl-biology/the-incubation-period/page2", "passage_text": "The incubation period for waterfowl lasts from 21 to 31 days, and females spend from 73 to more than 99 percent of each day on the nest. In the extreme case of emperor geese, females spend as much as 99.5 percent of each day on the nest. This leaves a mere seven minutes a day for other activities such as feeding."}, {"url": "http://www.wikihow.com/Hatch-a-Mallard-Duck-Egg", "passage_text": "How to Hatch a Mallard Duck Egg. Mallard ducks are amazing animals. And sometimes you want to help them hatch. It's important to not remove wild ducks eggs from any nest without the proper cause; however, if the mother is confirmed missing for over a period of 48 hours, you may be able to help. Ad."}, {"url": "http://www.enature.com/expert/expert_show_question.asp?questionID=4772", "passage_text": "The incubation period for mallards is 23 to 29 days; other duck species are similar. The fact that the hen has not eaten is unusual. Hens usually leave the nest a couple of times a day for short periods, a hour or less, to feed."}, {"url": "http://www.moosemanorfarms.com/about-muscovy-ducks.html", "passage_text": "Since Muscovy are genetically disimilar to other domestic waterfowl, many folks believe that they're more of a goose than a duck. For instance, they eat grass, as do geese, have a similarly long egg incubation period of 35 days (compared with 28 days for ducks), and they don't quack. This is a good trait since they are quiet ducks. The male has a low breathy call, and the female a quiet trilling coo."}, {"url": "http://animals.nationalgeographic.com/animals/birds/mallard-duck/", "passage_text": "They normally lay about a dozen eggs, and the incubation period lasts just under a month. Mallards are territorial during much of this period, but once incubation is well underway, males abandon the nest and join a flock of other males. Most mallard species are common and not considered threatened. However one threat to their populations includes hybridization with other ducks."}]