[{"url": "https://en.wikipedia.org/wiki/Jackalope", "passage_text": "The jackalope is a mythical animal of North American folklore (a so-called fearsome critter) described as a jackrabbit with antelope horns. The word jackalope is a portmanteau of jackrabbit and antelope, although the jackrabbit is not a rabbit, and the American antelope is not an antelope. Also, many jackalope taxidermy mounts, including the original, are actually made with deer antlers. Jackalope is a portmanteau word that combines two words, jackrabbit and antelope. However, the jackrabbit is not a rabbit, and the so-called antelope is not an antelope. Jackrabbits are actually hares rather than rabbits though both are mammals in the order Lagomorpha."}, {"url": "http://www.adirondackwildlife.org/GreatHornedOwls.html", "passage_text": "Then there is the great horned owl. It’s not so much the size of the great horned owl. Snowy owls are bigger. A great horned owl weighs between two to four pounds, has a wing span of 36 to 60 inches, and stands from 18 inches to 2 feet tall. As with all raptor species, the female is the larger of the two sexes. "}, {"url": "http://www.switchzoo.com/profiles/greathornedowl.htm", "passage_text": "Bird. The great horned owl is the most powerful of owls and has been called the “tiger of the woods.” The name is derived from tufts of feathers that appear to be ear tufts or horns. The feather tufts help in camouflage and have nothing to do with hearing. "}, {"url": "http://www.wildlifeofct.com/great%20horned%20owl.html", "passage_text": "The great horned owl is a large owl and the heaviest owl in North America. Their feathers are a dark brown mixed with white, black and tan. They have large feather ear tufts which are called plumicorns and are not actually related to ears or hearing at all. Their eyes are very large and yellow. The most commonly heard call of the great horned owl is a hoot that has been described as hoo hoooo hoo hoo that may be repeated several times. Click on the link under the picture for an example. You often hear a nearby owl calling to be answered by a more distant owl."}, {"url": "http://www.answers.com/Q/Why_is_a_great_horned_owl_called_a_great_horned_owl", "passage_text": "A Great Horned Owl is called such because of the 'horns' they have on top of their heads. Answered by The Community. Making the world better, one answer at a time. A Great Horned Owl is called such because of the 'horns' they have on top of their heads. They actually aren't horns, or ears, as some think, but simply tufts of feathers that appears to look like a pair of horns."}, {"url": "https://en.wikipedia.org/wiki/Snowshoe_Hare", "passage_text": "The snowshoe hare (Lepus americanus), also called the varying hare, or snowshoe rabbit, is a species of hare found in North America. It has the name snowshoe because of the large size of its hind feet and the marks its tail leaves. The animal's feet prevent it from sinking into the snow when it hops and walks. The snowshoe hare is also distinguishable by the black tufts of fur on the edge of its ears."}, {"url": "http://www.medirabbit.com/EN/Uro_gen_diseases/castration/Spay/Steril_en.html", "passage_text": "The reproductive organ of the female rabbit is considered primitive. Indeed, the split two-horned system is only encountered in monotreme egg laying mammals and the lagomorphs (pika, hare and rabbit). The organ is held in place by a broad ligament that is anchored at 4 points under the vertebral column. As a rule, it is considered that a rabbit is adult and able to reproduce when it has reached 75 to 80% of its adult size. Female rabbits do not have an estrus (heat) cycle, as do other small animals like dogs or cats, but are called induced ovulators. Ovulation is spontaneous; it happens 9 to 13 h. after copulation."}, {"url": "http://www.wildlifeofct.com/great%20horned%20owl.html", "passage_text": "Great horned owls eat mammals such as rodents, rabbits and smaller owls. They are a major predator of the barred owl and will regularly eat skunks. They have been known to take animals as large as woodchucks or geese. They will prey on small pets. The most commonly heard call of the great horned owl is a hoot that has been described as hoo hoooo hoo hoo that may be repeated several times. Click on the link under the picture for an example. You often hear a nearby owl calling to be answered by a more distant owl."}]