[{"url": "http://www.emedicinehealth.com/hemoglobin_a1c_hba1c/article_em.htm", "passage_text": "1 Hemoglobin A1c, often abbreviated HbA1c, is a form of hemoglobin (a blood pigment that carries oxygen) that is bound to glucose. 2  The blood test for HbA1c is routinely performed in people with type 1 and type 2 diabetes mellitus. 3  HbA1c levels are reflective of how well diabetes is controlled."}, {"url": "http://www.answers.com/Q/What_does_the_medical_abbreviation_A1c_mean", "passage_text": "A1c is an abbreviation of another abbreviation, HbA1c, or hemoglobin A1c. It's a blood test that evaluates how your blood sugar levels have been over the last three months."}, {"url": "http://www.answers.com/Q/What_is_the_meaning_of_the_acronym_A1C", "passage_text": "Answer by Answers Publisher. Confidence votes 262K. A1C is actually an abbreviation of another abbreviation, HbA1c. This is hemoglobin A1c and that is a blood test of a person's blood sugar levels to determine or evaluate diabetes."}, {"url": "http://www.emedicinehealth.com/hemoglobin_a1c_hba1c/article_em.htm", "passage_text": "HbA1c facts. 1  Hemoglobin A1c, often abbreviated HbA1c, is a form of hemoglobin (a blood pigment that carries oxygen) that is bound to glucose. 2  The blood test for HbA1c is routinely performed in people with type 1 and type 2 diabetes mellitus. 3  HbA1c levels are reflective of how well diabetes is controlled."}, {"url": "http://www.answers.com/Q/What_does_the_medical_abbreviation_A1c_mean", "passage_text": "HbA1c is a common measurement used when assessing diabetes. It stands for Hemoglobin A1-c. The A1c is simply a specific subtype of hemoglobin A. Hemoglobin is a molecule located in your red blood cells that is responsible for holding oxygen. HbA1c is formed when glucose (a blood sugar) binds to the hemoglobin."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=16297", "passage_text": "Hemoglobin A1c: A minor component of hemoglobin to which glucose is bound. Abbreviated HbA1c. HbA1c levels depend on the blood glucose concentration: The higher the glucose concentration in blood, the higher the level of HbA1c."}]