[{"url": "http://www.healthline.com/health-slideshow/psoriasis-vs-eczema-pictures", "passage_text": "Eczema, or atopic dermatitis, may also be a long-term condition affecting the skin. It occurs because of a hypersensitivity reaction (similar to an allergy), in which the skin reacts to triggers, such as dyes, fabrics, soaps, animals, and other irritants. Recognizing a patch of skin that is inflamed, red, or peeling, as one of these conditions will dictate how you treat it. This image depicts psoriasis on the belly. The following photos will help give you an idea of the difference in appearances between psoriasis and eczema on different areas of the body."}, {"url": "http://www.healthline.com/health-slideshow/psoriasis-vs-eczema-pictures", "passage_text": "Many people do not know the technical differences between psoriasis and eczema, or atopic dermatitis. Recognizing a patch of skin that is inflamed, red, or peeling, as one of these conditions will dictate how you treat it. This image depicts psoriasis on the belly. The following photos will help give you an idea of the difference in appearances between psoriasis and eczema on different areas of the body."}, {"url": "http://www.med-health.net/Difference-Between-Eczema-And-Psoriasis.html", "passage_text": "Appearance. Eczema. Eczema is also known as atopic dermatitis and is a chronic condition of the skin that usually develops during childhood. People with this condition will have skin that is itchy, cracked, dry and red. Sometimes it will also involve pimple-like eruptions, thick skin and crusty sores. "}, {"url": "http://www.diffen.com/difference/Eczema_vs_Psoriasis", "passage_text": "Eczema and psoriasis are two conditions that are often confused for each other, but are very different. Eczema, also known as dermatitis, is a group of conditions in which the skin is hot, dry, itchy and scaly. In severe outbreaks, the skin may become raw, red and bleed. Eczema is thought to be a reaction to environmental irritants or allergies, and symptoms are worsened by stress and hormonal fluctuations."}, {"url": "http://www.healthline.com/health-slideshow/psoriasis-vs-eczema-pictures", "passage_text": "Eczema is very common in infants, and many people outgrow the hypersensitivity by childhood or early adulthood. Skin may appear red, inflamed, peeling, cracked, blistered, or pus-filled. Generally it is not covered with scaly dead skin. Recognizing a patch of skin that is inflamed, red, or peeling, as one of these conditions will dictate how you treat it. This image depicts psoriasis on the belly. The following photos will help give you an idea of the difference in appearances between psoriasis and eczema on different areas of the body."}, {"url": "http://www.answers.com/Q/What_is_the_difference_between_eczema_and_psoriasis", "passage_text": "Even dermatologists sometimes have trouble identifying these skin problems. Actually, both eczema and psoriasis are types of dermatitis, which simply means inflammation of the skin.. Eczema is considered more of a symptom than an actual disease, and is best treated by dealing with the underlying cause. To combat psoriasis and eczema, first try the Cleanser for Dry Complexion. Do not use soap (unless it is made for eczema or psoriasis, there is a Repcillin soap now available in the UK and worldwide), because it can irritate your skin. Another natural way to treat psoriasis is by exposure to direct sunlight and heat."}, {"url": "https://www.sharecare.com/health/eczema/difference-between-psoriasis-eczema", "passage_text": "Eczema is more related to allergies while psoriasis is an autoimmune reaction where the skin thinks it's being wounded and turns over too quickly, leading to thick red plaques typically on the elbows, knees, scalp, but can appear anywhere on the body. Psoriasis and eczema are similar in that both are skin conditions that can be red and itchy, are genetic and can negatively effect your quality of life. Some of the treatments, such as creams or light therapy, are also similar. Systemic treatments may be different, with more treatment options available for psoriasis"}, {"url": "https://www.mariobadescu.com/Do-I-have-Rosacea-Eczema-or-Psoriasis", "passage_text": "Eczema (Atopic Dermatitis) is a chronic skin condition characterized by red, dry, cracked and itchy skin. In addition to hot, red skin, those with Eczema may also develop crusty sores, thick skin and pimple-like eruptions. The skin may crust over and ooze, or it may become so dry and cracked that bleeding occurs. 1 Psoriasis is often linked to genetics; this condition is caused or exacerbated by. 2  health issues (there is a link between Psoriasis and Diabetes, for example). 3  Eczema, on the other hand, flares up in response to. 4  factors, including animal dander, food allergies or exposure to harsh cleaning chemicals."}, {"url": "http://quickrel.com/about-psoriasis-eczema.php", "passage_text": "Psoriasis is a noncontagious common skin condition that causes rapid skin cell reproduction resulting in red, dry patches of thickened skin. The dry flakes and skin scales are thought to result from the rapid buildup of skin cells. Psoriasis commonly affects the skin of the elbows, knees, and scalp. Some people have such mild psoriasis (small, faint dry skin patches) that they may not even suspect that they have a medical skin condition. Others have very severe psoriasis where virtually their entire body is fully covered with thick red, scaly skin."}]