[{"url": "http://www.cnbc.com/2015/03/02/worlds-most-expensive-cities.html", "passage_text": "The Southeast Asian city-state of Singapore retained its title as the world's most expensive city for the second consecutive year, the Economist Intelligence Unit (EIU) said in a new survey."}, {"url": "http://www.businessinsider.com/the-10-most-expensive-cities-in-the-world-2015-3", "passage_text": "Nicky Loh/Getty Living in Singapore comes at a much higher cost than in New York City. An island nation slightly smaller than New York City and Hong Kong remains the world's most expensive city for a second year in a row, according to the Economist Intelligence Unit's (EIU) bi-annual Worldwide Cost of Living report."}, {"url": "http://www.bbc.com/news/business-31689124", "passage_text": "Singapore has retained its position as the world's most expensive city, according to research by the Economist Intelligence Unit (EIU). The top five most expensive cities in the world remain unchanged from a year earlier and include, in descending order, Paris, Oslo, Zurich and Sydney."}, {"url": "http://fortune.com/2015/09/18/most-expensive-cities-ubs/", "passage_text": "The world’s most expensive cities are Zurich and Geneva, according to a study by investment bank UBS, that doesn’t include rent. The cities top New York City, which is No.3 on the list."}, {"url": "http://blogs.wsj.com/economics/2015/09/22/the-most-expensive-place-in-the-world-to-live/", "passage_text": "New York was the world’s most expensive city including rent as of April 2015, according to a new analysis by UBS. KENA BETANCUR/AFP/GETTY IMAGES. New York City takes the top spot in the annual ranking of the world’s most expensive cities, according to an"}, {"url": "http://www.bbc.com/news/business-26412821", "passage_text": "Singapore replaces Tokyo, which topped the list in 2013. Other cities making up the top five most expensive cities to live in are Paris, Oslo, Zurich and Sydney, with Tokyo falling to sixth place. The EIU's Worldwide Cost of Living Survey is a relocation tool that uses New York city as a base."}, {"url": "http://www.huffingtonpost.com/2015/03/04/most-expensive-cities-world_n_6793688.html", "passage_text": "In that case, these places should not be on their list. The most expensive cities in the world are mostly in Asia and Western Europe, according to the Economist Intelligence Unit's Worldwide Cost of Living survey."}, {"url": "http://fortune.com/2015/09/18/most-expensive-cities-ubs/", "passage_text": "The least expensive cities, including rent, are Kiev and Sofia. Check out this chart below to see the relative wage levels of the top 10 most expensive cities based on UBS’ research, which places Zurich and Geneva at the top and New York City as No.3."}]