[{"url": "https://en.wikipedia.org/wiki/Bridport", "passage_text": "Bridport's origins are Saxon. During the reign of King Alfred it became one of the four most important settlements in Dorset – the other three being Dorchester, Shaftesbury and Wareham – with the construction of fortifications and establishment of a mint. Bridport's name probably derives from another location nearby. In the early 10th century the Burghal Hidage recorded the existence of a fortified centre or burh in this area, called 'Brydian', which is generally accepted as referring to Bridport."}, {"url": "http://www.bbc.co.uk/schools/primaryhistory/anglo_saxons/alfred_the_great/", "passage_text": "Great Anglo-Saxon kings included Offa of Mercia (who built Offa's Dyke) and Edwin of Northumbria (who founded Edinburgh or 'Edwin's burh'). But the most famous of all is Alfred, the only king in British history to be called 'Great'. Alfred was born in AD849 and died in AD899. When the Viking chief Guthrum was baptized a Christian, Alfred was his godfather. From Alfred's burh (a fortified town) comes our word 'borough'. The Anglo-Saxons knew the Earth was round, but wrongly believed the Sun and stars went round the Earth. The biggest Anglo-Saxon towns, such as Winchester, had fewer than 10,000 people. In a burh or fortified town, 4 men stood to guard every 5 metres of wall. The actual measurement used was a 'pole' (16 feet roughly). Alfred's daughter Ethelflaeda married the Mercian leader Ethelred"}, {"url": "http://www.primaryhomeworkhelp.co.uk/saxons/houses.htm", "passage_text": "Anglo Saxon Houses. We know what Saxons houses may have looked like from excavations of Anglo Saxon villages, such as the one at West Stow in the east of England. Here, an early Anglo-Saxon village (c.420-650AD) has been carefully reconstructed where it was excavated. Saxon Villages l Saxon Houses. The Anglo-Saxons did not understand the Roman ways and would not live in their towns, so the villas, streets and baths were soon forgotten. They fell into ruins and became covered over with weeds. Roman houses were made of brick or stone and had a tiled roof."}, {"url": "https://en.wikipedia.org/wiki/Bridport", "passage_text": "In the 21st century Bridport's arts scene has contributed to the town becoming increasingly popular with people from outside the locality. It has an arts centre, theatre, library, cinema and museum, and several annual events. It features as Port Bredy in the fictional Wessex of Thomas Hardy 's novels. Bridport's name probably derives from another location nearby. In the early 10th century the Burghal Hidage recorded the existence of a fortified centre or burh in this area, called 'Brydian', which is generally accepted as referring to Bridport."}, {"url": "https://en.wikipedia.org/wiki/Bridport", "passage_text": "Its origins are Saxon and it has a long history as a rope-making centre, though many of its buildings date from the 18th century. On the coast and within the town's boundary is West Bay, a small fishing harbour previously known as Bridport Harbour. Bridport's name probably derives from another location nearby. In the early 10th century the Burghal Hidage recorded the existence of a fortified centre or burh in this area, called 'Brydian', which is generally accepted as referring to Bridport."}, {"url": "http://www.thedorsetpage.com/locations/Place/B310.htm", "passage_text": "Bridport, an Anglo-Saxon town made famous by its rope making is the largest town in West Dorset. Such was the fame of Bridport rope that those who ended their days on the gallows were said to have been 'stabbed by a Bridport dagger'. The town is still Britain's main source for twine. Plans are afoot however to restore it to its former glory. Bridpor t, an Anglo-Saxon town made famous by its rope making is the largest town in West Dorset. Such was the fame of Bridport rope that those who ended their days on the gallows were said to have been 'stabbed by a Bridport dagger '."}, {"url": "http://www.gatehouse-gazetteer.info/English%20sites/922.html", "passage_text": "Vanished (King). Documentation indicates that in 1150, the keeper of Bridport Castle was taken prisoner by the future king of England, Henry II. At that time, the keeper's loyalty would have been to King Stephen of England, following Stephen's invasion of the town. "}]