[{"url": "http://homewyse.com/services/cost_to_install_ceramic_floor_tile.html", "passage_text": "Our free calculator uses recent, trusted data to estimate costs for your Ceramic Floor Tile Installation project. For a basic 120 square feet project in zip code 47474, the benchmark cost to Install Ceramic Floor Tile ranges between $9.83 - $13.74 per square foot* ."}, {"url": "http://rempros.com/tile_installation_prices.html", "passage_text": "All numbers in the charts are prices to install tile, apply grout and sealer if necessary excluding materials cost. If installer will buy thin-set or mortar as well as grout the price for installation will increase at $0.9 - $1.9 per square foot."}, {"url": "http://homewyse.com/services/cost_to_install_tile_floor.html", "passage_text": "Get an INSTANT estimate of the cost to Install a Tile Floor! Our free calculator uses recent, trusted data to estimate costs for your Tile Floor Installation project. For a basic 120 square feet project in zip code 47474, the benchmark cost to Install a Tile Floor ranges between $10.02 - $14.22 per square foot* . To estimate costs for your project: 1. Set Project Zip Code Enter the Zip Code for the location where labor is hired and materials purchased."}, {"url": "http://tile.promatcher.com/cost/", "passage_text": "$4.85 per square foot (labor only, tile provided by customer) (Range: $3.13 - $6.57). $7.53 per square foot (including labor and a mid-grade tile) (Range: $6.56 - $8.49). $3.18 per square foot (new sub-floor installation only) (Range: $2.07 - $4.28)."}, {"url": "http://rempros.com/tile_installation_prices.html", "passage_text": "Project size. Most contractors will charge small tile installation projects at higher rate. For example, price for the installation of 45 sq. ft. porcelain floor tile in a small hallway will be around $450 to $550, which makes it $11.25 - $12.30 per square foot."}, {"url": "http://www.answers.com/Q/What_is_the_average_labor_cost_for_ceramic_tile_installation", "passage_text": "Here in Chicago the average price for installation of your ceramic tile should be about 5.50 per S/F straight lay out and $ 6.50 for 45 degree lay out but thast if is ceramic quarry tile and if is a porcelain tile is about $ 7.00 dollar per foot if is a shiny tile."}, {"url": "http://www.improvenet.com/r/costs-and-prices/ceramic-tile-flooring", "passage_text": "Ceramic tile is a flooring choice that is reasonable in cost. Choose a tile rated 3 for home use, and 4 or 5 for commercial and industrial flooring. It can be installed by a homeowner with some DIY experience. Materials and installation range from $3 to $7 per square foot on average."}]