[{"url": "https://draxe.com/what-is-soy-lecithin/", "passage_text": "Composed of choline, fatty acids, glycerol, glycolipids, phospholipids, phosphoric acid and triglycerides lecithin was originally isolated from egg yolk. Today, it is regularly extracted from cottonseed, marine sources, milk, rapeseed, soybeans, and sunflower. It’s widely accepted at both conventional and health food stores, and in numerous products, yet there is surprisingly a lot of confusion about soy lecithin because people take a knee-jerk reaction to anything that has the word “soy” in it."}, {"url": "http://www.healthline.com/health/food-nutrition/is-soy-lecithin-good-or-bad-for-me", "passage_text": "Lecithin is a food additive that comes from several sources — one of them being soy. It is generally used as an emulsifier, or lubricant, when added to food, but also has uses as an antioxidant and flavor protector. Like many food additives, soy lecithin isn’t without controversy. "}, {"url": "http://theantidotelife.com/soy-lecithin-sludge/", "passage_text": "Soy Lecithin is used primarily as a stabilizing emulsifier (i.e., used to blend oil and water, like when egg yolks are used in a traditional Caesar salad dressing). Soy Lecithin is used in foods across the board, from creamy foods like bottled salad dressings to tea to chocolate to infant formula. “Lecithin isn’t always made from soybeans; it’s also present in egg yolks, liver, peanuts, wheat germ (1), and canola (rapeseed) oil. Soy lecithin is the most common type of lecithin because it’s a byproduct which is easily and inexpensively derived from soybean oil manufacturing."}, {"url": "https://en.wikipedia.org/wiki/Lecithin", "passage_text": "Lecithin is a generic term to designate any group of yellow-brownish fatty substances occurring in animal and plant tissues composed of phosphoric acid, choline, fatty acids, glycerol, glycolipids, triglycerides, and phospholipids. Lecithin is sold as a food supplement and for medical uses. In cooking, it is sometimes used as an emulsifier and to prevent sticking, for example in nonstick cooking spray."}, {"url": "http://www.nutritional-supplements-health-guide.com/what-is-soy-lecithin.html", "passage_text": "You have come to the right place to find out more. Soy lecithin, simply put, is a mixture of phospholipids derived from the processing of soybeans and generally used as a natural emollient and has been utilized in various food and industrial applications. Soy lecithin is then the lecithin that can be derived from soybeans. As mentioned, soy lecithin is one of the by-products of soybean processing. To produce lecithin, soybeans are kept and tempered at a consistent temperature and moisture for about a week in order to hydrate them and loosen the hull."}, {"url": "http://www.livestrong.com/article/524606-what-are-the-dangers-of-soy-lecithin-ingestion/", "passage_text": "Soy lecithin is a common ingredient in hundreds of processed foods, including cereals, pasta, breads, soy milk and many meats. Lecithin is also available as a health supplement; proponents claim that it can benefit the heart, brain, liver and athletic performance. Although lecithin originally had many uses, today soy lecithin is used as an emulsifier in foods and infant formulas and also as a health supplement. In 2007, the GMO Compass reported that soy lecithin, like many food products in American supermarkets, contained genetically modified soy"}, {"url": "https://draxe.com/what-is-soy-lecithin/", "passage_text": "On the other side of the soy lecithin debate is an exceptionally large body of research that supports it use as a healing agent. Referred to as a fat that is “essential” to the cells in our bodies, lecithin is used both as a standalone medicine and also as a common additive in many medicines today. It’s widely accepted at both conventional and health food stores, and in numerous products, yet there is surprisingly a lot of confusion about soy lecithin because people take a knee-jerk reaction to anything that has the word “soy” in it."}]