[{"url": "http://www.buyshade.com/", "passage_text": "Congratulations! You have found BuyShade.com, your full-service source for pop up tents, table covers, custom tents, printed flags and more. With hundreds of product configurations & styles in our portfolio and a team of ace designers, we specialize in making custom solutions for whatever you need."}, {"url": "http://www.doityourself.com/stry/average-cost-of-a-truck-canopy", "passage_text": "Age. Another important factor in the price of the canopy is the age of the canopy that you are looking to purchase. If you are considering on buying a brand new one from a dealership, you can probably expect to pay anywhere in the neighborhood of $600 to $1400 with the average probably falling at around $1000. It all depends upon what kind of features that you want."}, {"url": "http://www.howmuchisit.org/how-much-does-a-canopy-cost/", "passage_text": "1 A pop up canopy that is ideal for camping and spur of the moment setups can range anywhere from $120 to as much as $300 for the complete setup. 2  A gazebo canopy that has zipped up sides to protect those from winds and rain can cost anywhere from $80 to $200. 3  One that is made of metal can cost $200 to as much as $2,000. 1 A gazebo canopy that has zipped up sides to protect those from winds and rain can cost anywhere from $80 to $200. 2  One that is made of metal can cost $200 to as much as $2,000. 3  For example, the Swiss Gear 10 x 10 Foot Smart Shade."}, {"url": "http://www.acecanopy.com/custom-canopy.html", "passage_text": "No problem. We are the manufacture of our own. Ace canopy brand pop-up tents and tarp canopies. All of our custom canopies and pop-up tents come with a five year warranty. We will repair or replace your canopy top or pop up top within 30 days of purchase if defective. Damages caused by user neglect, wind, snow, fire or any act of God will not be covered. Superior Quality Materials: All custom canopies are made with our heavy duty Ace brand materials."}, {"url": "http://www.buyshade.com/custom-tents/custom-10x10/", "passage_text": "10x10 Custom Tent. For trade shows, conventions and most outdoor fairs, a Custom 10 x 10 Tent will fully maximize your floor space. We offer a complete line of 10 x 10 size Custom Tents – starting as low as $199 – from our lightweight Dome II to our best-selling professional Eclipse II Aluminum. Read More ». Color: Please allow 10 Days for production, plus shipping tim"}, {"url": "http://www.howmuchisit.org/how-much-does-a-canopy-cost/", "passage_text": "1 The average canopy is going to cost anywhere from $45 to $210. 2  This is for a canopy that is meant for temporary purposes. 3  Just like a tent, a canopy can be folded up and taken down within 15 minutes. 4  A 10 x 20 canopy designed for parties that includes sidewalls can cost $120 to $200. 1 A gazebo canopy that has zipped up sides to protect those from winds and rain can cost anywhere from $80 to $200. 2  One that is made of metal can cost $200 to as much as $2,000. 3  For example, the Swiss Gear 10 x 10 Foot Smart Shade."}, {"url": "http://www.howmuchisit.org/how-much-does-a-canopy-cost/", "passage_text": "1 A 10 x 10 canopy with no sidewalls can cost $75 to $100. 2  A portable, lighter canopy that comes with screen panel kits can cost $45 to $95. 3  A pop up canopy that is ideal for camping and spur of the moment setups can range anywhere from $120 to as much as $300 for the complete setup. 1 A gazebo canopy that has zipped up sides to protect those from winds and rain can cost anywhere from $80 to $200. 2  One that is made of metal can cost $200 to as much as $2,000. 3  For example, the Swiss Gear 10 x 10 Foot Smart Shade."}, {"url": "http://www.acecanopy.com/custom-canopy.html", "passage_text": "Not only are you receiving the The Lowest Price Guaranteed ! ANYWHERE. We have over 30 years of industry expertise; specializing in custom canopies and covers. Market Leading Warranty: Every canopy and pop up tent frame comes with a 12 month guarantee that protects you in the event of any manufacturer defects. We will repair or replace your canopy top or pop up top within 30 days of purchase if defective. Damages caused by user neglect, wind, snow, fire or any act of God will not be covered. Superior Quality Materials: All custom canopies are made with our heavy duty Ace brand materials."}, {"url": "http://www.10x10canopy.com/", "passage_text": "10x10 Custom Canopy Pop Up TentsCustom printed 10 x 10 pop up canopy tent with optional side skirts and backwallOur Custom Canopies provide shade and protection for your indoor or outdoor events. "}]