[{"url": "http://www.thekitchn.com/the-right-internal-temperature-for-cooked-chicken-quick-kitchen-facts-216074", "passage_text": "Kitchen Fact: The safe internal temperature for cooked chicken is 165° Fahrenheit (75° Celsius). A meat or instant-read thermometer is your best bet for determining the temperature of your chicken, and if you're cooking a whole bird, it should be inserted into the thickest part of the thigh but not touching bone."}, {"url": "http://ochef.com/1053.htm", "passage_text": "If you handle chicken properly, but cook it to a lower temperature, you may be exposing yourself to a very slight risk of food poisoning, but eating consistently tasty chicken. We try never to roast a chicken beyond 160°F in the breast, but that s our choice."}, {"url": "http://ochef.com/1053.htm", "passage_text": "This goes to the very heart of the liberal/conservative debate  and, as you can imagine, it s not pretty. Our government says that you should cook a whole chicken until the temperature measured in the thigh is 180°F (82°C). If you cook chicken pieces, the government says, the thigh, wings, and drumsticks should be 180°F, while the breast should reach 170°F (77°C)."}, {"url": "http://www.answers.com/Q/What_should_the_temperature_of_cooked_chicken_be", "passage_text": "Very generally, you would let them cook for 45 minutes to an hour at 350 degrees F. When checking chicken for doneness, insert a knife or fork in the thickest portion of the … meat. If it is done, the juices will run out clear, if not, the juices will have a pinkish tinge and you should let them cook a little longer."}, {"url": "http://whatscookingamerica.net/Q-A/ChickenCook.htm", "passage_text": "One and a half hours is much too long to cook the chicken at 350 degrees F. The time your chicken will bake in the oven does depend on the internal temperature and the size of your chicken or chicken pieces. Generally I bake chicken at 350 degrees F. for 30 to 40 minutes."}, {"url": "http://whatscookingamerica.net/Q-A/ChickenCook.htm", "passage_text": "A cooking or meat thermometer should not be a sometime thing.. Use it every time you prepare foods like poultry, roasts, hams, casseroles, meat loaves and egg dishes. After desired cooking temperature is reached, remove meat from heat source and let stand 10 to 15 minutes before carving."}, {"url": "http://whatscookingamerica.net/Information/MeatTemperatureChart.htm", "passage_text": "Cooking thermometers take the guesswork out of cooking, as they measure the internal temperatures of your cooked meat, poultry, seafood, baked goods, and/or casseroles, to assure that a safe temperature has been reached, harmful bacteria have been destroyed, and your food is cooked perfectly."}, {"url": "http://www.healthycanadians.gc.ca/eating-nutrition/healthy-eating-saine-alimentation/safety-salubrite/tips-conseils/cook-temperatures-cuisson-eng.php", "passage_text": "Checking the temperature of your cooked meat, poultry, and seafood with a food thermometer is the only reliable way to make sure your food has reached a safe internal cooking temperature."}]