[{"url": "http://www.moneycrashers.com/how-long-take-get-tax-refund-status/", "passage_text": "4. Request Direct Deposit. Once your tax return is accepted and the refund approved, you can choose to have your money directly deposited in your bank account within a week. If you choose to have a paper check sent through the mail from the IRS, this option will add at least another two weeks to the process. 5. If you paper file, it will take three to four weeks for the IRS to process the return and acknowledge your refund. If you e-file, you will get a notice of arrival within 24 hours and confirmation of refund within 72 hours."}, {"url": "http://www.ehow.com/info_7749504_tax-mean-irs-finished-processing.html", "passage_text": "You can track returns online using the IRS Where's My Refund tool. The tool tracks your return from Return Received — the IRS has accepted and is processing it — to Refund Approved to Refund Sent. It updates once every 24 hours, so there's no point in checking more frequently. "}, {"url": "http://blog.turbotax.intuit.com/tax-refunds/wheres-my-tax-refund-16241/", "passage_text": "1 Return Received Notice within 24 – 48 hours after e-file – The IRS Where’s My Refund tool will show “Return Received” status once they begin processing your tax return. 2  You will not see a refund date until the IRS finishes processing your tax return and approves your tax refund. 1 shows “Refund Sent”, the IRS has sent your tax refund to your financial institution for direct deposit. 2  It can take 1 to 5 days for your financial institution to deposit funds into your account. 3  If you requested that your tax refund be mailed, it could take several weeks for your check to arrive."}, {"url": "https://www.irs.gov/refunds/tax-season-refund-frequently-asked-questions", "passage_text": "This status will tell you when your refund was sent to your bank. It may take your financial institution 1 – 5 days to deposit the funds into your account. Please wait until it’s been five days from the date we sent the refund to your bank to check with your bank about the status of your refund. Many different factors can affect the timing of your refund after we receive it for processing. Even though we issue most refunds in less than 21 days, it’s possible your tax return may require additional review and take longer."}, {"url": "https://www.irs.gov/refunds/tax-season-refund-frequently-asked-questions", "passage_text": "You can start checking on the status of your return within 24 hours after we have received your electronically filed tax return or 4 weeks after you mail a paper tax return. Q7: How often does Where’s My Refund? update? Where’s My Refund? updates are made no more than once per day, usually at night. Many different factors can affect the timing of your refund after we receive it for processing. Even though we issue most refunds in less than 21 days, it’s possible your tax return may require additional review and take longer."}, {"url": "https://www.irs.gov/refunds/tax-season-refund-frequently-asked-questions", "passage_text": "Q19: What information is available on Where's My Refund? Information on Where's My Refund? is for the most recent tax year we have on file for you. You can check on the status of your refund 24 hours after you e-file. If you filed a paper return, please allow 4 weeks before checking on the status. Many different factors can affect the timing of your refund after we receive it for processing. Even though we issue most refunds in less than 21 days, it’s possible your tax return may require additional review and take longer."}, {"url": "http://www.askmefast.com/How_long_does_it_take_the_irs_to_approve_a_refund_after_it_is_accepted-qna5926723.html", "passage_text": "1 32% - How long once the irs has accepted my refund and is processing it will the refund be loanded onto my card? 2  51% - Why is it taken so long for my tax refund i filed on the 5 & got accepted? 1. The tax return processing is depending on how you filed your tax, If you used e-Filing to send the file it should be received and reviewed within 24 hours. But the approval of refund will depend if you have errors, incomplete information and others that will cause delay."}, {"url": "http://www.askmefast.com/How_long_does_it_take_the_irs_to_approve_a_refund_after_it_is_accepted-qna5926723.html", "passage_text": "1 63% - Do you know how long does it ake for the irs to approve my 2012-2013 refund? 2  32% - How long once the irs has accepted my refund and is processing it will the refund be loanded onto my card? 3  51% - Why is it taken so long for my tax refund i filed on the 5 & got accepted? 1. The tax return processing is depending on how you filed your tax, If you used e-Filing to send the file it should be received and reviewed within 24 hours. But the approval of refund will depend if you have errors, incomplete information and others that will cause delay."}, {"url": "http://blog.turbotax.intuit.com/tax-refunds/what-is-the-current-irs-status-on-processing-returns-12852/", "passage_text": "We know how important your tax refund is to you. Good news, the IRS started processing tax returns on January 30th. Returns will be processed in the order they were submitted and as soon as your tax return is accepted, we will notify you by email. This notification could take up to 48 hours. The IRS estimates that you should receive your tax refund within 21 days of your return being accepted. The IRS issued more than 9 out of 10 refunds in less than 21 days last year and expects the same results this year. "}]