[{"url": "https://answers.yahoo.com/question/index?qid=20110328212740AAonGwE", "passage_text": "Once the RNA polymerase+sigma factor are on the sitting (bound) to the promoter region RNA polymerase starts 'walking' along the DNA and transcribes the gene into RNA. In eukaryotes, a similar process occurs with the exception that sigma factors are not used. Report Abuse. RNA polymerase recognizes a specific base sequence in the DNA called a promoter and binds to it. The promoter identifies the start of a gene, which strand is to be copied, and the direction that it is to be copied. You Tube really helps if you have problems with your Bio assignments."}, {"url": "http://medical-dictionary.thefreedictionary.com/Gene+promoter", "passage_text": "promoter. a specific DNA sequence to which RNA polymerase binds and signals where RNA synthesis (transcription) should begin. internal promoter. a class of enhancers which are gene-specific sequences that increase transcription. promoter region. the non-coding nucleotide sequence at the transcription start region that is characterized by the presence of a number of conserved or consequence sequences. "}, {"url": "http://www.nature.com/scitable/definition/promoter-259", "passage_text": "promoter. Promoter sequences are DNA sequences that define where transcription of a gene by RNA polymerase begins. Promoter sequences are typically located directly upstream or at the 5' end of the transcription initiation site. RNA polymerase and the necessary transcription factors bind to the promoter sequence and initiate transcription. Promoter sequences define the direction of transcription and indicate which DNA strand will be transcribed; this strand is known as the sense strand."}, {"url": "https://en.wikipedia.org/wiki/Promoter_(genetics)", "passage_text": "In genetics, a promoter is a region of DNA that initiates transcription of a particular gene. Bottom: The gene is turned on. Lactose is inhibiting the repressor, allowing the RNA polymerase to bind with the promoter, and express the genes, which synthesize lactase. Eventually, the lactase will digest all of the lactose, until there is none to bind to the repressor."}, {"url": "https://answers.yahoo.com/question/index?qid=20110328212740AAonGwE", "passage_text": "Best Answer: Oh---I love this stuff. Work with it everyday. The promoter region is a specific area of DNA upstream of the transcription site of the gene. In bacterial cells, a protein, known as a sigma factor, binds to the RNA polymerase complex and directs the RNA polymerase+sigma factor complex to the promoter region. Report Abuse. RNA polymerase recognizes a specific base sequence in the DNA called a promoter and binds to it. The promoter identifies the start of a gene, which strand is to be copied, and the direction that it is to be copied. You Tube really helps if you have problems with your Bio assignments."}, {"url": "http://www.biology-online.org/dictionary/Promoter", "passage_text": "(genetics) A site in a DNA molecule at which RNA polymerase and transcription factors bind to initiate transcription of mRNA. Supplement. The site is actually specific DNA sequences that are recognized by transcription factors, which recruit RNA polymerase at the site. In the Operon Model, the promoter is the gene segment that serves as the initiation site where RNA polymerase binds to and initiates the transcription of certain genes. Conversely, in the presence of a repressor protein, this segment binds with the repressor. "}, {"url": "http://www.ehow.com/info_12027441_function-promoter-dna-transcription.html", "passage_text": "Promoters. Promoters are DNA sequences whose purpose is not to encode information about the organism itself, but rather they serve as a kind of On switch to initiate the biological process of transcription for the genes which follow the promoter DNA sequence. "}]