[{"url": "http://www.medicinenet.com/kidney_stones/article.htm", "passage_text": "1 Dehydration is a major risk factor for kidney stone formation. 2  Symptoms of a kidney stone include flank pain (the pain can be quite severe) and blood in the urine (hematuria). 3  People with certain medical conditions, such as gout, and those who take certain medications or supplements are at risk for kidney stones."}, {"url": "http://www.medicinenet.com/kidney_stones/article.htm", "passage_text": "1 Nephrolithiasis is the medical term for kidney stones. 2  One in every 20 people develop kidney stones at some point in their life. 3  Kidney stones form when there is a decrease in urine volume and/or an excess of stone-forming substances in the urine."}, {"url": "http://www.webmd.com/kidney-stones/ss/slideshow-kidney-stones-overview", "passage_text": "Kidney stones may form when there's a change in the normal balance of the water, salts, and minerals found in urine. Different kinds of changes result in different types of kidney stones. There are many factors that can trigger changes in the urine, ranging from chronic medical conditions to what you eat and drink."}, {"url": "http://answers.webmd.com/answers/1191792/what-can-i-do-to-treat", "passage_text": "Home treatment is often the only thing you need to do when passing a kidney stone. Home treatment includes drinking enough fluids, taking pain medicine, and possibly straining and collecting your urine to help determine the type of stone you have."}, {"url": "http://www.webmd.com/kidney-stones/kidney-stones-home-treatment", "passage_text": "Drink fluids. When you are passing a kidney stone, you need to drink enough water to keep your urine light yellow or clear like water, about 8 to 10 glasses of water a day. If you have kidney, heart, or liver disease and are on fluid restrictions, talk with your doctor before drinking more fluids."}, {"url": "http://www.webmd.com/kidney-stones/kidney-stones-home-treatment", "passage_text": "Home treatment-drinking more fluids and taking pain medicine-is often the only thing you need to do when passing a kidney stone. When you are passing a kidney stone, you need to drink enough water to keep your urine light yellow or clear like water, about 8 to 10 glasses of water a day. If you have kidney, heart, or liver disease and are on fluid restrictions, talk with your doctor before drinking more fluids."}, {"url": "http://www.medicinenet.com/kidney_stones/article.htm", "passage_text": "1 Symptoms of a kidney stone include flank pain (the pain can be quite severe) and blood in the urine (hematuria). 2  People with certain medical conditions, such as gout, and those who take certain medications or supplements are at risk for kidney stones. 3  Diet and hereditary factors are also related to stone formation."}]