[{"url": "https://www.dhs.wisconsin.gov/vitalrecords/birth.htm", "passage_text": "For the $20.00 birth certificate search fee, we will search one five-year period in the single-year indexes OR one multi-year index. You may request that an additional five-year period of single-year indexes is searched OR an additional multi-year index is searched for $20.00."}, {"url": "https://www.dhs.wisconsin.gov/vitalrecords/birth.htm", "passage_text": "The cost for expedited service is $20.00 per record in addition to the $20.00 birth certificate search fee. Additional copies of the same certificate, requested at the same time as the first, are $3.00 each."}, {"url": "https://www.gov.uk/order-copy-birth-death-marriage-certificate", "passage_text": "You’ll need to register on the General Register Office (. ) website to order a copy of a birth, adoption, death, marriage or civil partnership certificate in England and Wales. Certificates cost £9.25. You can use this service to help you research your family tree."}, {"url": "https://www.dhs.wisconsin.gov/vitalrecords/birth.htm", "passage_text": "The cost for the search, which includes one copy of the record, if found, is $20.00. Additional copies of the same record, requested at the same time as the first, are $3.00 each. The cost is the same whether you request a certified or an uncertified copy of the birth certificate."}, {"url": "http://msdh.ms.gov/msdhsite/_static/31,0,344.html", "passage_text": "Birth Certificates. You can order birth certificates, death certificates and marriage records on-line, by mail, phone or in person by visiting our Vital Records office. Birth certificates cost $15, with a $5 fee for additional copies of the same record."}, {"url": "https://www.health.ny.gov/vital_records/birth.htm", "passage_text": "1 For Priority Handling: There is an additional fee of $15.00 per birth certificate copy. ( 2 Total per copy is $45.00). 3  Internet and telephone orders require a major credit card. 4  These orders receive priority handling and the fee is $30.00 + $15.00 priority handling fee for a total of $4"}, {"url": "https://www.health.ny.gov/vital_records/birth.htm", "passage_text": "1 The fee is $30.00 per birth certificate copy. 2  For Priority Handling: There is an additional fee of $15.00 per birth certificate copy. ( 3 Total per copy is $45.00). 4  Internet and telephone orders require a major credit card."}, {"url": "http://www.ok.gov/health/Birth_and_Death_Certificates/Birth_Certificates/", "passage_text": "The fee for the search of a birth certificate is $15.00 and will include the issuance of one certified copy to a qualified applicant if the certificate is on file. Additional copies will be issued at a cost of $15.00 each. The searching fee is not refundable or transferable."}]