[{"url": "http://medical-dictionary.thefreedictionary.com/Pontine+region", "passage_text": "On the ventral surface of the brain, the basilar part of pons (that is, the white pontine protuberance) is demarcated from both the medulla oblongata and the mesencephalon by distinct transverse grooves. Synonym(s): pons cerebelli, pons varolii. 2. 1 also called bridge of Varolius. a prominence on the ventral surface of the brainstem, between the medulla oblongata and the cerebral peduncles of the midbrain. The pons consists of white matter and a few nuclei and is divided into a ventral part and a dorsal part."}, {"url": "http://www.csuchico.edu/~pmccaffrey/syllabi/SPPA336/336unit4.html", "passage_text": "Because these arteries supply blood to the cerebellum and to the brain stem, blockages or hemorrhaging there can cause either ataxic (cerebellar) or flaccid (lower motor neuron) dysarthria.. It is important to note that the effects of ischemic stroke are almost always contralateral and therefore unilateral. One exception to this pattern is alternating hemiplegia. This is a paralysis that can be caused by ischemic stroke and affects different structures on each side of the body. It results from a brain stem lesion that damages cranial nerve nuclei and one side of the pyramidal tract in the same area."}, {"url": "https://answers.yahoo.com/question/index?qid=20080109190610AADAaEA", "passage_text": "In some theories, the pons has a role in dreaming. The pons is part of the brainstem, the lowest part of the brain that connects to the top end of the spinal cord. It's an important and densely packed area containing many bundles of nerves carrying movement and sensory messages between the brain and the body. "}, {"url": "http://www.missouribackinjuryattorney.com/head-injuries/injury-to-the-pons-of-the-brainstem?format=pdf", "passage_text": "Injury to the Pons of the Brainstem-Facial paralysis; - Impaired coordination and movement; - Slow pupil response; - Loss of bladder control; - Arousal dysfunction; and, - Coma. One of the most famous conditions that affect the pons is known as the central pontinemyelinosis, which causes total body paralysis. Injury to the Pons of the Brainstem The Nature of the Pons The brain is the center of the nervous system and helps regulate all the systems and functionsof the body."}, {"url": "https://patienteducation.osumc.edu/Documents/LeftMidCerebralArteryStroke.pdf", "passage_text": "Arteries carry blood that contains oxygen to the parts of the body, including the brain. The flow of blood through the arteries can stop if the artery is blocked. This handout looks at what occurs when a stroke happens in the left middle cerebral artery in the brain. The middle cerebral artery divides into a right middle cerebral artery and a left middle cerebral artery. "}, {"url": "https://en.wikipedia.org/wiki/Watershed_stroke", "passage_text": "A watershed stroke or watershed infarct is defined as an ischemia, or blood flow blockage, that is localized to the border zones between the territories of two major arteries in the brain. "}, {"url": "http://www.csuchico.edu/~pmccaffrey/syllabi/SPPA336/336unit4.html", "passage_text": "Both of the vertebral arteries ascend through the spinal column and enter the brain through the magnum foramen. Once in the brain, they continue to ascend, traveling beside the brain stem. At the lower border of the pons the two vertebral arteries join together to form the basilar artery or vertebro-basilar artery. One exception to this pattern is alternating hemiplegia. This is a paralysis that can be caused by ischemic stroke and affects different structures on each side of the body. It results from a brain stem lesion that damages cranial nerve nuclei and one side of the pyramidal tract in the same area."}, {"url": "http://www.csuchico.edu/~pmccaffrey/syllabi/SPPA336/336unit4.html", "passage_text": "At the superior border of the pons, the basilar artery divides to form the two posterior cerebral arteries. Before the basilar artery divides, several other arteries arise from it. These include the anterior, inferior, and posterior cerebellar arteries as well as pontine branches. One exception to this pattern is alternating hemiplegia. This is a paralysis that can be caused by ischemic stroke and affects different structures on each side of the body. It results from a brain stem lesion that damages cranial nerve nuclei and one side of the pyramidal tract in the same area."}, {"url": "http://emedicine.medscape.com/article/323409-overview", "passage_text": "The vertebrobasilar arterial system perfuses the medulla, cerebellum, pons, midbrain, thalamus, and occipital cortex. Occlusion of large vessels in this system usually leads to major disability or death. Vertebrobasilar stroke carries a mortality rate of more than 85%. Proximal to its bifurcation into the terminal branches (PCAs), the basilar artery gives off the superior cerebellar arteries that supply the lateral aspect of the pons and midbrain, as well as the superior surface of the cerebellum."}, {"url": "https://en.wikipedia.org/wiki/Pons", "passage_text": "The pons is part of the brainstem, and in humans and other bipeds lies between the midbrain (above) and the medulla oblongata (below) and in front of the cerebellum. The pons is also called the pons Varolii (bridge of Varolius), after the Italian anatomist and surgeon Costanzo Varolio (1543–75). This white matter includes tracts that conduct signals from the brain down to the cerebellum and medulla, and tracts that carry the sensory signals up into the thalamus. The pons in humans measures about 2.5 cm or 1 inch in length. Most of it appears as a broad anterior bulge rostral to the medulla. Posteriorly, it consists mainly of two pairs of thick stalks called cerebellar peduncles."}]