[{"url": "http://www.mentalgamecoach.com/articles/SportPsychologyConsultant.html", "passage_text": "You will learn who uses sport psychology consultants, how they operate, and what they can do for you. A sport psychology consultant addresses critical sport learning and performance areas such as mental readiness, concentration, motivation, teamwork, communication, the zone and managing a sport career. This article gives you a broad overview of the world of sport psychology consultants. You will learn who uses sport psychology consultants, how they operate, and what they can do for you. I was fortunate to be the first person in the world to earn an undergraduate degree in sport psychology."}, {"url": "http://www.wisegeek.com/what-does-a-sports-psychologist-do.htm", "passage_text": "Sports psychologists can help athletes find motivation to continue training. An athlete might seek the services of a sports psychologist if her performance is waning. Some sports psychologists work with a specific age group, such as youth athletes. A golfer may employ a sports psychologist to help him focus on the golf course. Sports psychologists recognized the mental and emotional challenges a professional career entails. A sports psychologist may help athletes identify performance challenges. Sports psychologists work with athletes from every sport, age group and skill level. Sports psychologists may look at how the intensity of a much works against an athlete's mental well being"}, {"url": "http://www.wisegeek.com/what-does-a-sports-psychologist-do.htm", "passage_text": "A sports psychologist is a licensed mental health professional who helps athletes improve their performance and focus. He or she works with sports players to help them identify their challenges, work through difficult times, and set goals. A golfer may employ a sports psychologist to help him focus on the golf course. Sports psychologists recognized the mental and emotional challenges a professional career entails. A sports psychologist may help athletes identify performance challenges."}, {"url": "https://en.wikipedia.org/wiki/Sport_psychology", "passage_text": "Sport psychology is an interdisciplinary science that draws on knowledge from many related fields including biomechanics, physiology, kinesiology and psychology. It involves the study of how psychological factors affect performance and how participation in sport and exercise affect psychological and physical factors. In its formation, sport psychology was primarily the domain of physical educators, not researchers, which can explain the lack of a consistent history."}, {"url": "http://www.apa.org/helpcenter/sport-psychologists.aspx", "passage_text": "How to find a sport psychologist. To find a sport psychologist or other exercise and sport psychology professional, talk to other athletes and coaches. In addition to names, ask how the professional helped them and what type of services were provided. Your local college or university may also be able to provide referrals. Sport psychologists can also help athletes: Enhance performance. Various mental strategies, such as visualization, self-talk and relaxation techniques, can help athletes overcome obstacles and achieve their full potential. Cope with the pressures of competition."}, {"url": "http://www.apa.org/helpcenter/sport-psychologists.aspx", "passage_text": "What sport psychologists do. Some athletes seek help from a sport psychologist or other exercise and sport psychology professional when they have a problem. They might become anxious or lose focus during competition, for example. Sport psychologists can also help athletes: Enhance performance. Various mental strategies, such as visualization, self-talk and relaxation techniques, can help athletes overcome obstacles and achieve their full potential. Cope with the pressures of competition."}, {"url": "http://careersinpsychology.org/becoming-a-sports-psychologist/", "passage_text": "High schools and colleges might hire a sport psychologist to talk with and counsel their student athletes, for instance. Some sport psychologists may even work exclusively with professional sports teams and other professional athletes. Sports psychology is a branch of psychology that focuses on how individuals are affected by playing sports as well as how to improve a person's mindset in order to excel at sports."}, {"url": "http://www.apa.org/helpcenter/sport-psychologists.aspx", "passage_text": "But athletes don't just consult sports psychologists when they're having difficulties. Sport psychologists can also help athletes: Enhance performance. Various mental strategies, such as visualization, self-talk and relaxation techniques, can help athletes overcome obstacles and achieve their full potential. Cope with the pressures of competition."}, {"url": "http://www.alleydog.com/psychology-jobs/sports-psychologist.php", "passage_text": "A sports psychologist is a psychologist who looks at how sports performance is affected by a person's emotional wellbeing as well as how to increase motivation and help an athlete keep focused. A sports psychologist will work with athletes individually as well as with the team as a whole. Some of the topics that a sports psychologist may study include how to increase motivation, what exercise is best for an athlete and techniques for ensuring an athlete can keep anxiety under control as well as remaining focused during a competition."}]