[{"url": "http://www.youtube.com/watch?v=v2lHztS4sMU", "passage_text": "For your GCSE Science exams, you need to be able to compare the differences between different types of cells. 1  Education. 2  Standard YouTube License. "}, {"url": "http://www.markedbyteachers.com/gcse/science/stem-cell-therapy.html", "passage_text": "...read more. Middle. This type of stem cell is responsible for creating all kinds of blood cells. Therefore, a bone marrow transplant can replace the damaged stem cells and white blood cells (leukocytes) after chemotherapy and radiation has killed all the abnormal stem cells and leukocytes. "}, {"url": "http://www.docbrown.info/page20/AQAscibio21.htm", "passage_text": "AQA GCSE Science BIOLOGY 2 Unit B2.1 Cells and simple cell transport. All living things are made up of cells. Know that the structures of different types of cells are related to their functions. Know the similarities and differences between animal cells, bacteria and plant cells. Know that to get into or out of cells, dissolved substances have to cross the cell membranes. You need to be able to use your skills, knowledge and understanding to relate the structure of different types of cells to their function. AQA GCSE Science BIOLOGY Unit B2.1.1 Cells and cell structure"}, {"url": "http://www.educationquizzes.com/gcse/biology/unit-3-blood/", "passage_text": "Unit 3 - Blood. Blood is a tissue and consists of a fluid called plasma in which red blood cells, white blood cells and platelets are suspended. Blood plasma transports carbon dioxide from the organs to the lungs, soluble products of digestion from the small intestine and urea from the liver to the kidneys."}, {"url": "http://www.educationquizzes.com/gcse/biology/unit-2-stem-cells/", "passage_text": "Unit 2 - Stem Cells. Stem cells from human embryos and bone marrow can be grown in labs and used to repair body parts and also used to help paralysis. Human stem cells can develop into any type of human cell. See how much you understand about stem cells by playing this quiz on the subject. A human stem cell can develop into... "}, {"url": "http://moodle.flintshire.gov.uk/hhs/mod/resource/view.php?id=5307", "passage_text": "use your knowledge of plant and animal cells to answer these questions a suggest two reasons why some scientists thought euglena was a plant cell and not an animal cell 2 1 2 b suggest one reason why some scientists thought euglena was an animal cell and not a plant cell "}, {"url": "http://www.markedbyteachers.com/gcse/science/stem-cell.html", "passage_text": "stem cells have the remarkable potential to develop into many different cell types in the body serving as a sort of repair system for the body they can theoretically divide without limit to replenish other cells as long as the person or animal is still alive stem cell research has the activity to develop into all of the different types found in an adult such as skin blood and nerve cells these cells are collected from the inner cell mass of an early 5 6 days old embryo they can no longer become as a whole organism"}, {"url": "http://www.bbc.co.uk/schools/gcsebitesize/science/add_aqa/cells/cellsrev1.shtml", "passage_text": "All living things are made up of cells. The structures of different types of cells are related to their functions. Animal cells and plant cells have features in common, such as a nucleus, cytoplasm, cell membrane, mitochondria and ribosomes. Plant and algal cells also have a cell wall, and often have chloroplasts and a permanent vacuole. Bacterial and yeast cells have different structures to animal and plant cells."}, {"url": "http://gcse.wikia.com/wiki/Stem_cells", "passage_text": "blindness and, potentially, brain damage. 2. They can be used to grow new organs in vitro. These organs can be then used for transplants or drug testing. Adult stem cells (found in the bone marrow) are harder to utilise due to the fact that they can form only a limited number of cell types. However, they have been used to: 1. Cure heart disease. 2. Provide stem cells for therapeutic cloning. Adult cells are used to produce a cloned early embryo of the adult."}]