[{"url": "http://www.medicinehunter.com/boswellia-good-joints", "passage_text": "Boswellia: Good For Joints. Even people who are in good physical condition can suffer joint pain, and many adults wind up with osteoarthritis. Often, these people use over-the-counter or prescription anti-inflammatory drugs. But there is an alternative, called boswellia. Boswellia refers to the resin of various species of Boswellia, which are shrubs and small trees native to the Red Sea region, northeastern Africa, and the mountains of central India."}, {"url": "https://en.wikipedia.org/wiki/Boswellia", "passage_text": "Boswellia has long been used in Ayurvedic medicine. Recently, the boswellic acids that are a component of the resin it produces have shown some promise as a treatment for asthma and various inflammatory conditions. There are four main species of Boswellia which produce true frankincense. B. sacra (synonyms B. carteri and B. bhaw-dajiana), B. frereana, B. papyrifera, and B. serrata, and each type of resin is available in various grades. The grades depend on the time of harvesting, and the resin is hand sorted for quality."}, {"url": "http://www.lifescript.com/health/centers/osteoarthritis/alternative_treatments/boswellia.aspx", "passage_text": "What Is Boswellia Used for Today? Growing evidence suggests that boswellia has anti-inflammatory effects. 5-8 On this basis, the herb has been tried for a number of conditions in which inflammation is involved, including painful conditions such as bursitis, osteoarthritis, rheumatoid arthritis, and tendonitis. 9-11 Use of boswellia appears to decrease symptoms, probably by decreasing inflammation in the brain (as well as through other mechanisms). However, this has not been proven, and individuals with cancer should not use boswellia (or any other herb or supplement) except on physician’s advice."}, {"url": "https://en.wikipedia.org/wiki/Boswellia", "passage_text": "Boswellia is a genus of trees in the order Sapindales, known for their fragrant resin which has many pharmacological uses, particularly as anti-inflammatories. The Biblical incense frankincense was an extract from the resin of the tree Boswellia sacra, and is now produced also from B. frereana. There are four main species of Boswellia which produce true frankincense. B. sacra (synonyms B. carteri and B. bhaw-dajiana), B. frereana, B. papyrifera, and B. serrata, and each type of resin is available in various grades. The grades depend on the time of harvesting, and the resin is hand sorted for quality."}, {"url": "http://www.medicinehunter.com/boswellia-good-joints", "passage_text": "Medical investigations into boswellia show that the gum is beneficial in cases of arthritis, asthma, and ulcerative colitis. According to a review of unpublished studies, preliminary double-blind trials have found boswellia effective in relieving the symptoms of rheumatoid arthritis. Often, these people use over-the-counter or prescription anti-inflammatory drugs. But there is an alternative, called boswellia. Boswellia refers to the resin of various species of Boswellia, which are shrubs and small trees native to the Red Sea region, northeastern Africa, and the mountains of central India."}, {"url": "http://www.wellnessresources.com/health/articles/boswellia_an_anti-inflammatory_with_multiple_talents/", "passage_text": "Boswellia (boswellia serrata) is a tree gum resin that has multiple health benefits. Also known as frankincense, it has been burned as incense in religious and cultural ceremonies for centuries. In today’s alternative health world boswellia is widely regarded as a potent anti-inflammatory nutrient, wherein its primary active ingredient, acetyl-11-keto-β-boswellic acid (AKBA), inhibits the inflammatory enzyme 5-lipoxygenase."}, {"url": "http://www.herbslist.net/boswellia.html", "passage_text": "The boswellia family of trees have been used for healing for over 2,000 years in India and ancient Egypt. Boswellia is a major component in the Ayurvedic medicine system of India. The white oleo-gum resin that comes from this tree is taken and dried into the incense called frankincense. "}, {"url": "http://health.howstuffworks.com/wellness/food-nutrition/vitamin-supplements/boswellia.htm", "passage_text": "Traditional use of the herb boswellia has been celebrated for thousands of years. Also known as frankincense, boswellia was considered so valuable in ancient times that it was one of the choice gifts brought by the Wise Men to Baby Jesus. Boswellia has not been a part of conventional medicine, nor is it one of the most popular herbs in the lay press, but it does have some properties that could provide substantial benefit for many of today’s chronic illnesses."}, {"url": "http://www.medicinehunter.com/boswellia-good-joints", "passage_text": "The gummy resin of the boswellia tree has a long history of internal use in Indian herbal medicine as a treatment for arthritis, bursitis, nervous diseases, urinary disorders, and diarrhea. Externally the gum and its oil preparations are used for ulcerations and sores. Often, these people use over-the-counter or prescription anti-inflammatory drugs. But there is an alternative, called boswellia. Boswellia refers to the resin of various species of Boswellia, which are shrubs and small trees native to the Red Sea region, northeastern Africa, and the mountains of central India."}, {"url": "http://www.healthline.com/health/boswellia", "passage_text": "Boswellia, also known as Indian Frankincense, is an herbal extract taken from the Boswellia serrata tree. Resin made from boswellia extract has been used for centuries in Asian and African folk medicine to treat chronic inflammatory illnesses, as well as a number of other health conditions. It is available as a resin, pill, or cream. Studies show that boswellia may reduce inflammation and may be useful in treating: Boswellia may interact with and decrease the effects of anti-inflammatories like ibuprofen and other medications. Talk to your doctor before using boswellia products, especially if you’re taking other medications to treat inflammation."}]