[{"url": "http://www.mayoclinic.org/diseases-conditions/plantar-warts/basics/causes/con-20025706", "passage_text": "Causes. Plantar warts are caused by an infection with the human papillomavirus (HPV) in the outer layer of skin on the soles of your feet. More than 100 types of HPV exist, but only a few cause warts on your feet. Other types of HPV are more likely to cause warts on other areas of your skin or on mucous membran"}, {"url": "http://www.apma.org/learn/FootHealth.cfm?ItemNumber=989", "passage_text": "Warts are one of several soft tissue conditions of the foot that can be quite painful. They are caused by a virus and can appear anywhere on the skin. Those that appear on the sole of the foot are called plantar warts. Children, especially teenagers, tend to be more susceptible to warts than adults. Some people seem to be immune to warts. "}, {"url": "http://my.clevelandclinic.org/health/diseases_conditions/hic-warts/hic_Plantar_Warts", "passage_text": "1 Between treatments, the dead layers of the wart are filed down. 2  However, because plantar warts often go away on their own, it is not clear if the duct tape actually works or simply coincides with the wart disappearing. Because of their flat appearance and location on the bottom of the foot, plantar warts are frequently mistaken for calluses. Like calluses, plantar warts have tough, thick skin. However, unlike calluses, a plantar wart is painful when squeezed. A plantar wart may also have black dots on its surface."}, {"url": "http://healthcenter.indiana.edu/answers/warts.shtml", "passage_text": "Most people have had a wart on their body somewhere at some time in their life. Warts are harmless, but most people don’t like the way they look. Warts are extra layers of skin caused by the human papilloma virus (HPV) family. The virus is spread by skin-to-skin contact. Only certain types of HPV cause genital warts and cervical problems. "}, {"url": "http://www.emedicinehealth.com/plantar_warts/article_em.htm", "passage_text": "Plantar Warts Overview. Patient Comments Read 34 Comments Share Your Story. Warts are produced by an infection of the skin by human papillomavirus (HPV), which is the most common viral infection of the skin. Plantar warts grow on the plantar surface or the sole of the foot. They can be found anywhere in this area but tend to produce symptoms in areas of pressure and friction. "}, {"url": "http://my.clevelandclinic.org/health/diseases_conditions/hic-warts/hic_Plantar_Warts", "passage_text": "People who get plantar warts may feel as if they have a stone in their shoe. Because of their flat appearance and location on the bottom of the foot, plantar warts are frequently mistaken for calluses. Like calluses, plantar warts have tough, thick skin. However, unlike calluses, a plantar wart is painful when squeezed. A plantar wart may also have black dots on its surface."}, {"url": "http://www.mckinley.illinois.edu/Handouts/warts.html", "passage_text": "Warts are non-cancerous skin growths caused by a viral infection in the top layer of the skin or mucous membranes. Viruses that cause warts belong to a family called human papillomavirus (HPV). There are over 100 different types of HPV. "}, {"url": "http://www.webmd.com/skin-problems-and-treatments/tc/warts-and-plantar-warts-topic-overview", "passage_text": "A wart is a skin growth caused by some types of the virus called the human papillomavirus (HPV) . HPV infects the top layer of skin, usually entering the body in an area of broken skin. The virus causes the top layer of skin to grow rapidly, forming a wart. Most warts go away on their own within months or years. "}, {"url": "http://www.bad.org.uk/shared/get-file.ashx?id=176&itemtype=document", "passage_text": "Warts are caused by infection in the outer layer of the skin (epidermis) with a virus called the ‘human papilloma virus’. There are many different strains of this virus, and plantar warts are usually due to just a few of these strains. "}]