[{"url": "http://www.answers.com/Q/What_is_the_difference_between_the_oceanic_crust_and_continental_crust", "passage_text": "Oceanic crust is mostly basaltic, which is denser, while continental crust is made from mostly basaltic and sedimentary rocks, which are less dense. This difference in density … is why the oceanic crust sinks lower (thus the oceans) and the continental crust rides higher (thus the continents) on the mantle. 1. The Oceanic crust is dense while the Continental crust is relatively lighter. 2. The Oceanic crust consists of Silicon and Magnessium, while the Continental crust has Sil … icon and Alluminium."}, {"url": "http://www.differencebetween.com/difference-between-continental-crust-and-vs-oceanic-crust/", "passage_text": "Continental Crust. The surface of the earth that is found on the continents is called the continental crust, which has a thickness of around 25 to 70 km. This crust is made up of igneous, sedimentary and metamorphic rocks, and that together make up the structure of our continents. • Continental crust is thicker (25-70 km) than oceanic crust (7-10 km) and is nearly 35-40km deep. Related posts: 1  Difference Between Lithosphere and Crust. 2  Difference Between Meteor and Meteorite. 3  Difference Between Stream and River."}, {"url": "http://envsushma.blogspot.com/2012/06/difference-between-oceanic-and.html", "passage_text": "Difference between oceanic and continental crust. : - The crust is thinner (thus relatively denser and heavier) beneath the oceans, where it is up to about 8km thick. It consists mostly of basaltic types of rocks. Geologists refer to this oceanic crustal material as Sima, after its two main chemical constituents which are silica (Si) and magnesium (Ma)."}, {"url": "http://www.scienceline.ucsb.edu/getkey.php?key=3657", "passage_text": "Layers that are less dense, such as the crust, float on layers that are denser, such as the mantle. Both oceanic crust and continental crust are less dense than the mantle, but oceanic crust is denser than continental crust. This is partly why the continents are at a higher elevation than the ocean floor. "}, {"url": "http://geoscience.msc.sa.edu.au/library/2-1%20Earths%20Crust%20and%20Interior.pdf", "passage_text": "Differences between continental and oceanic crust are summarised in the table below. COMPARISON BETWEEN CONTINENTAL & OCEANIC CRUST Feature Continental Crust Oceanic crust Global distribution 35% of Earth’s surface-mainly in the northern hemisphere. 65% of Earth’s surface-mainly in the southern hemisphere. "}, {"url": "http://www.differencebetween.net/science/nature/difference-between-oceanic-and-continental-crust/", "passage_text": "The density of the continental crust is much less as compared to the oceanic crust. It has an approximate value of 2.6 g/cm3. Due to this difference in densities in magma between the oceanic crust and the continental crust, the continents stay in their places, and both crusts are able to float on the magma. The continental crust floats much more freely on the magma. The continental crust is much thicker when compared to the oceanic crust. The density of the oceanic crust is about 3.0 g/cm3. The continental crust has a lower density. This difference in the average densities allows many natural phenomenon to occur on and below the surface of the Earth. The oceanic crust scarcely floats on the mantle. The oceanic crust undergoes a peculiar phenomenon"}, {"url": "http://www.answers.com/Q/What_is_the_difference_between_the_oceanic_crust_and_continental_crust", "passage_text": "Continental crust underlies the continents and is mainly composed of granite rock. Average thickness is about 35 km. Oceanic crust underlies the oceans and is mainly compos … ed of Basalt rock. Average thickness is about 7 km. 1. The Oceanic crust is dense while the Continental crust is relatively lighter. 2. The Oceanic crust consists of Silicon and Magnessium, while the Continental crust has Sil … icon and Alluminium."}]