[{"url": "http://www.ncbi.nlm.nih.gov/gene/2597", "passage_text": "1 GAPDH was identified as a binding protein on the plasma membrane of CEM-SS leukemia cells for Bt18 parasporal protein. 2  The study demonstrated that GAPDH is reliable as reference gene for quantitative gene expression analysis in human diploid fibroblasts. 1 GAPDH is an integral part of the sarcolemmal K(ATP)-channel protein complex, where it couples glycolysis with the K(ATP)-channel activity. 2  A decrease in the dehydrogenase activity of GAPDH was noted in Alzheimer disease."}, {"url": "http://www.nature.com/ncomms/2014/140828/ncomms5730/full/ncomms5730.html", "passage_text": "Cell surface proteins of M.tb H37Ra cells, (~1.5 × 10 10 per assay) were labelled using ​ Sulfo-NHS-Biotin (Pierce) as per manufacturer’s instructions. Cells were then incubated with 100 μg of ​ transferrin at 37 °C for 30 min to allow for internalization. After three washes cells were resuspended in lysis buffer. Under conditions of iron depletion, a twofold increase in ​ GAPDH expression and a threefold increase of ​ transferrin binding was evident on the surface of M.tb H37Ra suggesting that both surface ​ GAPDH expression and ​ transferrin binding are sensitive to iron levels (Fig. 3a)."}, {"url": "http://www.sinobiological.com/GAPDH-Protein-a-2620.html", "passage_text": "It catelyzes the sixth step of glycolysis. Glyceraldehyde-3-phosphate dehydrogenase (GAPDH) is a pleiotropic enzyme that is overexpressed in apoptosis and in several human chronic pathologies. Its role as a mediator for cell death has also been highlighted. A recent report suggests that GAPDH may be genetically associated with late-onset of Alzheimer's disease."}, {"url": "http://www.sciencedirect.com/science/article/pii/S0923250808001381", "passage_text": "The cell surface GAPDH of L. plantarum LA 318 was purified as described previously [15] . Adherence of the purified GAPDH to each ligand was performed in triplicate using a biosensor BIACORE 1000 (BIACORE K. K., Tokyo, Japan) that uses quantitative surface plasmon resonance (SPR) [16] , [17] , [23] and [24] . In conclusion, here we determined that the GAPDH of L. plantarum LA 318 was an adhesin recognizing blood group A and B expressed on the non-reducing terminal sugar chains of human colonic mucin, and that the trisaccharide structure was important in this adhesion."}, {"url": "http://www.ncbi.nlm.nih.gov/gene/2597", "passage_text": "1 GAPDH is a moonlighting protein that functions as a glycolytic enzyme as well as a uracil DNA glycosylase. 2  Results indicate that CIB1 is uniquely positioned to regulate PI3K/AKT and MEK/ERK signaling and that simultaneous disruption of these pathways synergistically induces a nuclear GAPDH-dependent cell death. 1 GAPDH is an integral part of the sarcolemmal K(ATP)-channel protein complex, where it couples glycolysis with the K(ATP)-channel activity. 2  A decrease in the dehydrogenase activity of GAPDH was noted in Alzheimer disease."}, {"url": "http://mbio.asm.org/content/2/3/e00068-11.full", "passage_text": "Streptococcal surface dehydrogenase (SDH) (glyceraldehyde-3-phosphate dehydrogenase [GAPDH]) is an anchorless major multifunctional surface protein in group A Streptococcus (GAS) with the ability to bind important mammalian proteins, including plasmin(ogen). "}, {"url": "https://en.wikipedia.org/wiki/Glyceraldehyde_3-phosphate_dehydrogenase", "passage_text": "Glyceraldehyde 3-phosphate dehydrogenase (abbreviated as GAPDH or less commonly as G3PDH) (EC 1.2.1.12) is an enzyme of ~37kDa that catalyzes the sixth step of glycolysis and thus serves to break down glucose for energy and carbon molecules. GAPDH uses covalent catalysis and general base catalysis to decrease the very large and positive activation energy of the second step of this reaction. First, a cysteine residue in the active site of GAPDH attacks the carbonyl group of GAP, creating a hemithioacetal intermediate (covalent catalysis)."}, {"url": "http://www.ncbi.nlm.nih.gov/gene/2597", "passage_text": "1 Glyceraldehyde-3-phosphate prevents cells from apoptosis by lowering S-nitrosylation of GAPDH. 2  GAPDH expression was significantly up-regulated in colorectal carcinoma tissues, and also increased in colon cancer cell lines and thus may be a potential target for colon cancer therapy. 1 GAPDH is an integral part of the sarcolemmal K(ATP)-channel protein complex, where it couples glycolysis with the K(ATP)-channel activity. 2  A decrease in the dehydrogenase activity of GAPDH was noted in Alzheimer disease."}, {"url": "http://www.ncbi.nlm.nih.gov/gene?Cmd=DetailsSearch&Term=2597", "passage_text": "Title: Human and pneumococcal cell surface glyceraldehyde-3-phosphate dehydrogenase (GAPDH) proteins are both ligands of human C1q protein. 1  SIRT1 functions to retain GAPDH in the cytosol, protecting the enzyme from nuclear translocation via interaction with these two proteins. 1 Homologs of the GAPDH gene: The GAPDH gene is conserved in chimpanzee, Rhesus monkey, dog, cow, mouse, rat, chicken, zebrafish, fruit fly, mosquito, C.elegans, S.cerevisiae, K.lactis, E.gossypii, S.pombe, M.oryzae, N.crassa, and rice."}, {"url": "http://www.ncbi.nlm.nih.gov/gene/2597", "passage_text": "1 GAPDH binds to active Akt, leading to Bcl-xL increase and escape from caspase-independent cell death. 2  GAPDH is a moonlighting protein that functions as a glycolytic enzyme as well as a uracil DNA glycosylase. 1 GAPDH is an integral part of the sarcolemmal K(ATP)-channel protein complex, where it couples glycolysis with the K(ATP)-channel activity. 2  A decrease in the dehydrogenase activity of GAPDH was noted in Alzheimer disease."}]