[{"url": "http://www.howmuchisit.org/couch-reupholstery-cost/", "passage_text": "1 A couch on average uses from 18 to 22 yards of fabric. 2  Some fabrics cost as low as $15 per yard to as high as $180 for fabrics made of silk and wools. 3  Labor charges vary according to location and if the person doing it is a novice or professional for the job. 1 Cushion and pillow covers can cost anywhere from $10 to $95 depending on the size. 2  If you cannot deliver the couch to the company, you will more than likely have to pay the company to have it picked up. 3  Delivery fees can range anywhere from $100 to $350."}, {"url": "http://ehowmuchdoesitcost.org/cost-to-reupholster-a-sofa/", "passage_text": "The overall costs of reupholstering a sofa generally depends with the cost of fabric used, the size of the sofa and the upholsterer you have choose. Depending with the size of your sofa, the costs of reupholstering may range between 400 to 1,200 US dollars. This only depends with the upholsterer you have chosen. To reduce the cost of reupholstering your sofa, it is advisable to first visit the upholstery fabric stores. Considering the extra costs of reupholstering a sofa, then you may find paying around 700 US dollars for an average size sofa and for a large sofa you may pay up to 1,200 US dollars. For this reason, it is important to ensure that your chosen upholsterer has some years of experience and skills."}, {"url": "http://ehowmuchdoesitcost.org/cost-to-reupholster-a-couch/", "passage_text": "A small sofa – around 19 yards of fabric/$190 plus labor. An average couch – approximately 23 yards of fabric/$239 plus labor. A very large couch – nearly 27 yards of fabric/$270 plus labor. The more complex the couch is, the more expensive you can expect the labor to be. ” If you want to reupholster a chair, then make sure you read my previous article – How Much Does It Cost to Reupholster a Chair. It can take a lot of money and it can be a huge investment when you want to reupholster a couch and the price can run especially high. First you need to consider the size of the couch."}, {"url": "http://www.city-data.com/forum/home-interior-design-decorating/1327806-cost-have-couch-reupholstered.html", "passage_text": "Just make sure that you get any leftover fabric. I bought a chair several years ago that was on sale for $399. It cost about $550 to reupholster it. My living room sofa, which is an antique, cost about $1500 including fabric. Ask around. Fabric stores should have a list of good upholsterers in your area. Couches can cost anywhere from $500 to $10,000 (and more)...if you have a high end couch that has superior workmanship, then reupholstering might be a better way to go....if you are looking for very specific things in a couch, then reupholstering gives you the opportunity to add those custom details."}, {"url": "http://ehowmuchdoesitcost.org/cost-to-reupholster-a-sofa/", "passage_text": "For a sofa which has wobbling frame and torn fabric which need replacement, then a 6 to 7 foot sofa may cost you 500 to 800 US dollars to reupholster with fabrics. This is suitable as compared to spending 1,200 US dollars to purchase a new one. Considering the extra costs of reupholstering a sofa, then you may find paying around 700 US dollars for an average size sofa and for a large sofa you may pay up to 1,200 US dollars. For this reason, it is important to ensure that your chosen upholsterer has some years of experience and skills."}, {"url": "http://www.howmuchisit.org/couch-reupholstery-cost/", "passage_text": "1 According to ReedUpholstery.com, the cost of reupholstery of a couch varies greatly based on the size and design, but on the average, cost ranges from $600 for an open-arm couch of about 70″ to 85″ in size and can go up to $990 for a closed-arm couch of the same size. 1 Cushion and pillow covers can cost anywhere from $10 to $95 depending on the size. 2  If you cannot deliver the couch to the company, you will more than likely have to pay the company to have it picked up. 3  Delivery fees can range anywhere from $100 to $350."}, {"url": "http://homeguides.sfgate.com/average-cost-reupholster-couch-86214.html", "passage_text": "Total Cost. The total cost of reupholstering a couch includes fabric, supplies and labor. It varies depending on the size and style of the couch as well as the price of the fabric, which can range from about $11 to $40 per yard. Labor averages between $700 and $1,200, for a total cost of $1,200 for a small two-cushion sofa, up to $3,000 or more for a large sofa. The cost can rise if you decide to replace the stuffing in cushions, especially if you choose a pricey option like down feathers."}, {"url": "http://www.ehow.com/facts_7174089_average-price-reupholster-couch.html", "passage_text": "Labor Costs. The average price to reupholster fluctuates based on the cost of living in your area, but it can start at $1,200 for a two-seat couch, at the time of publication. Basic, solid cotton upholstery fabric starts at $12 per yard at the time of publication, while designer fabric can cost as much as or more than $60 per yard, at the time of publication. For reference, a two-cushion sofa requires 15 yards or more of fabric depending on the design."}]