[{"url": "http://www.salarylist.com/jobs/Electronics-Technician-Salary.htm", "passage_text": "Electronics Technician Salary. Electronics Technician average salary is $42,274, median salary is $41,974 with a salary range from $22,298 to $90,000. Electronics Technician salaries are collected from government agencies and companies. Each salary is associated with a real job position"}, {"url": "http://learn.org/articles/Electronics_Technician_5_Steps_to_Becoming_an_Electronics_Technician.html", "passage_text": "Your salary will also vary with your specialization. For example, the BLS reports that annual mean salaries for technicians in various manufacturing industries ranged from $46,880 to $77,870. Electronics technicians who worked for the postal service earned an annual mean salary of $62,340, while those employed by the federal government earned $78,290. "}, {"url": "http://learn.org/articles/What_is_the_Entry-Level_Salary_for_Electronics_Engineering_Careers.html", "passage_text": "Salary by State. California employed the highest number of electrical and electronics engineering technicians as of May 2012 and paid them an average wage of $62,280, according to the BLS. Alaska, which had the highest job concentration of any state, offered one of the highest average wages of $70,460. Salary by State. The BLS reported that California, which paid electronics engineers an average wage of $107,450, had the highest employment level in May 2012. Rhode Island had the highest job concentration overall and offered one of the highest average wages of $110,190."}, {"url": "http://www.salarylist.com/jobs/Electronic-Technician-Salary.htm", "passage_text": "Electronic Technician Salary. Electronic Technician average salary is $39,774, median salary is $38,129 with a salary range from $22,131 to $86,242. Electronic Technician salaries are collected from government agencies and companies. Each salary is associated with a real job position. Electronic Technician average salary is $39,774, median salary is $38,129 with a salary range from $22,131 to $86,242. Electronic Technician salaries are collected from government agencies and companies"}, {"url": "http://www1.salary.com/Electric-Electronics-Technician-I-salary.html", "passage_text": "What is the average annual salary for Electric/Electronics Technician I? The annual salary for someone with the job title Electric/Electronics Technician I may vary depending on a number of factors including industry, company size, location, years of experience and level of education. This chart describes the expected percentage of people who perform the job of Electric/Electronics Technician I in the United States that make less than that annual salary."}, {"url": "http://www1.salary.com/Electric-Electronics-Technician-I-salary.html", "passage_text": "For example the median expected annual pay for a typical Electric/Electronics Technician I in the United States is $42,238 so 50% of the people who perform the job of Electric/Electronics Technician I in the United States are expected to make less than $42,238. This chart describes the expected percentage of people who perform the job of Electric/Electronics Technician I in the United States that make less than that annual salary."}, {"url": "http://www.answers.com/Q/What_is_the_salary_average_for_an_electronic_technician", "passage_text": "According to the U.S. Bureau of Labor Statistics the estimated  mean annual wage for Pharmacy Technicians as of May 2008 is,  $28,500. This would amount to $13.70 per hour. … The BLS reports that  in 2010, pharmacy technicians earn a median annual wage of $28, 400  or $13.65 per hour. Salary.com reports a higher median average  salary: $31,921. This salary is just the estimate for Pharmacy  Technician 1 (Level 1) and may increase depending on experience,  jurisdiction and demand for transcriptionists in the area. "}, {"url": "http://www.indeed.com/salary/Electronics-Technician.html", "passage_text": "Average Electronics Technician salaries for job postings nationwide are 55% lower than average salaries for all job postings nationwide. "}, {"url": "http://www.payscale.com/research/US/Job=Electronics_Technician/Hourly_Rate", "passage_text": "Median of all compensation (including tips, bonus, and overtime) by years of experience. For Electronics Technicians, experience does not seem to be a major factor in determining pay. The average worker who claims fewer than five years of experience earns around $36K. In contrast, however, individuals who report five to 10 years in this occupation see a much larger median of $44K. Electronics Technicians see a median salary of $49K after reaching one to two decades on the job. Men represent the vast majority of Electronics Technicians in the United States. People in this role can earn an average of $19.38 per hour nationwide."}]