[{"url": "http://www.co.cooke.tx.us/default.aspx?Cooke_County/DetentionCtr", "passage_text": "The Cooke County Detention Center is located at 300 County Road 451 in Gainesville, Texas. It is a 212 bed facility designed as an indirect supervision style correctional facility. The Cooke County Detention Center has 42 employees consisting of a Jail Administrator who oversees the Jail and Transport Division. "}, {"url": "http://shelbycountychamber.com/", "passage_text": "Welcome to Shelby County… Gateway to the Texas Forest Country. On behalf of the Shelby County Chamber of Commerce, we welcome you to our website! Shelby County is a myriad of untapped resources. From our historic courthouse, to our historic museum, and to the lakes and landscapes of our beautiful area, we invite you to read further about our community and we extend a special invitation for you to visit us soon. We've got a friendly, down to earth quality to our community and promise you won't meet a stranger. Visit our calendar of events page and plan to attend two of the most picturesque festivals in the South, along with a multitude of fishing and recreational activities offered in the area, all throughout the year."}, {"url": "http://texasescapes.com/TOWNS/Center/Center.htm", "passage_text": "Shelby County Courthouse. Like the town of Centerville (Leon County), Center was named for its location at the center of Shelby County. History in a Pecan Shell Margaret Wilson and Jesse Amason donated the townsite in 1856 or 1857. In an 1866 election Center became the county seat, in one of Texas' county seat disputes. In August 1866 the county records were stolen and brought to Center, putting an end to the dispute. A post office opened there the same year-further cementing the permanence of seat of county government."}, {"url": "http://houstoncountymedicalcenter.com/", "passage_text": "Houston County Medical Center (HCMC) is a 49-bed hospital in Crockett, Texas, dedicated to serving the health needs of Houston County and surrounding communities. "}, {"url": "https://tshaonline.org/handbook/online/articles/hfc05", "passage_text": "CENTER, TEXAS (Shelby County). Center is seventeen miles from the Louisiana border and 118 miles north of Beaumont at the center of Shelby County. In 1856 or 1857 J. C. and Margaret A. Wilson and Jesse Amason donated the land for the town. The community was involved in the Regulator-Moderator War. In an election called in January 1866 Center was voted the new county seat, but a number of people disputed the results, and no action was taken for some months."}, {"url": "http://www.centertexas.org/", "passage_text": "In fact, for a city of about 6,000 people, Center has much going for it and is one of the most progressive cities in East Texas. It is this entrepreneurial and progressive stance that is positioning Center as a great place to do business with a quality of life second to none. We hope that you find this information helpful and useful. Center is a Home Rule City that provides a full range of services to its residents and visitors. Our services include public safety, water and sewer utilities, solid waste and recycling programs, and an active parks department."}, {"url": "http://www.centertexas.org/", "passage_text": "Mayor David Chadwick. Greetings and welcome to the City of Center’s website. This website is designed to provide residents and visitors as much information as possible on the City of Center. We hope that you find this information helpful and useful. Center is a Home Rule City that provides a full range of services to its residents and visitors. Our services include public safety, water and sewer utilities, solid waste and recycling programs, and an active parks department."}, {"url": "http://prisonhandbook.com/3893/shelby-jail-center-tx/", "passage_text": "The Shelby County Clerk of Court is a member of the court that manages access to court records. They also administer the oath when court is in session, and read the verdict when delivered by the jury. All records, documents, and evidence from your case are held at Clerk of Court. To find out someone’s bail amount you will need to call the jail or the county courthouse. If you’ve got the person’s information, including name, address and date of birth, they’ll let you know the bail amount. You can also find out how much their bail is on the Shelby County Jail site."}, {"url": "https://www.traviscountytx.gov/exposition-center", "passage_text": "The Exposition Center is the permanent home to the Star of Texas Fair and Rodeo. With the city on the horizon, Decker Lake to the north, and green rolling hills all around, the Travis County Exposition Center is the perfect venue for any occasion. Travis County Exposition Center is the premiere multipurpose facility in the Austin area, just 15 minutes from downtown."}]