[{"url": "https://www.business.qld.gov.au/commonwealth-games/get-involved-games", "passage_text": "How your business can get involved in the Commonwealth Games. The Gold Coast 2018 Commonwealth Games (GC2018) presents one of the most significant procurement programs over the next decade. GC2018 will inject approximately $2 billion into the economy, with procurement offering a wide-range of opportunities for business."}, {"url": "http://www.embracing2018.com/", "passage_text": "Coinciding with the milestone of 1,000 days to go until the Gold Coast 2018 Commonwealth Games (GC2018), an update to the GC2018 Forward Procurement Schedule (FPS) was published in July 2015. With new requirements and updated timeframes, this was the most..."}, {"url": "http://www.commonwealthgames.com.au/page/39/2018-gold-coast-games", "passage_text": "gold coast 2018 I 4 - 15 April 2018. The 2018 Commonwealth Games will be held at Gold Coast City, in the southeast of the Australian state of Queensland from 4-15 April 2018. This will be the 5th time that Australia has hosted the Games, the others being – 1938 Sydney, 1962 Perth, 1982 Brisbane and 2006 Melbourne."}, {"url": "http://www.commonwealthgames.com.au/page/39/2018-gold-coast-games", "passage_text": "The 2018 Commonwealth Games will be held at Gold Coast City, in the southeast of the Australian state of Queensland from 4-15 April 2018. This will be the 5th time that Australia has hosted the Games, the others being – 1938 Sydney, 1962 Perth, 1982 Brisbane and 2006 Melbourne."}, {"url": "http://www.embracing2018.com/page/About/The_Gold_Coast_2018_Commonwealth_Games/", "passage_text": "Gold Coast 2018 Commonwealth Games™. From 4 to 15 April 2018, the XXI Commonwealth Games will be held on the Gold Coast. Over 11 days of competition, 6,500 athletes and team officials from 71 nations and territories will participate in 17 sports, including para-sports."}, {"url": "http://www.statedevelopment.qld.gov.au/index.php/component/mtree/gold-coast-2018-commonwealth-games", "passage_text": "The Gold Coast 2018 Commonwealth Games™ (GC2018) events will be hosted across 18 world-class competition venues located on the Gold Coast, Brisbane, Cairns and Townsville."}, {"url": "http://www.embracing2018.com/page/About/The_Gold_Coast_2018_Commonwealth_Games/", "passage_text": "The Gold Coast 2018 Commonwealth Games™ (GC2018) will be staged in a combination of 17 newly built, enhanced or existing venues across the Gold Coast, Brisbane, Cairns and Townsville. Find out more about the planned venues and current projects."}]