[{"url": "http://healthquestions.medhelp.org/kidney-stones-and-bladder-pain", "passage_text": "Read More. Be aware of any symptoms of urinary infections (pain or blood in urinating, pain in your kidney area, bladder, cloudy, dark or smelly urine) so that you can get your urine analysed and given the appropriate antibiotic if required. Formation of kidney stones is increased when the body is dehydrated. Read More. Generally you feel the pain as the stone goes from the kidney, through the ureter, to the bladder. While it just kind of hangs out in the bladder, it causes your bladder to spasm a bit making you feel like you really need to go even though there is not much urine in there."}, {"url": "http://www.nhs.uk/Conditions/Kidney-stones/Pages/Symptoms.aspx", "passage_text": "Symptoms of kidney stones. If you have a kidney stone that is very small, it is unlikely to cause many symptoms. It may even go undetected and pass out painlessly when you urinate. Symptoms usually occur if the kidney stone: 1  gets stuck in your kidney. "}, {"url": "http://www.merckmanuals.com/home/kidney-and-urinary-tract-disorders/stones-in-the-urinary-tract/stones-in-the-urinary-tract", "passage_text": "Urinary tract stones begin to form in a kidney and may enlarge in a ureter or the bladder. Depending on where a stone is located, it may be called a kidney stone, ureteral stone, or bladder stone. The process of stone formation is called urolithiasis, renal lithiasis, or nephrolithiasis. "}, {"url": "http://www.webmd.boots.com/a-to-z-guides/bladder-stones", "passage_text": "Bladder stones. When crystals in the urine form into a mass, the mass is known as a calculus or stone, and if a calculus forms within the bladder, it is referred to as a bladder stone. In many cases, a person can have a bladder stone and not have any symptoms, but sometimes it can cause pain or lead to blood in the urine. The bladder is a balloon-like organ in your pelvic area, and its function is to store urine from the kidneys."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMH0001493/", "passage_text": "The urine goes out of your kidneys, through your ureters (the tubes that connect the kidneys to the bladder; pronounced YUR-et-ers), and into your bladder. The bladder stores urine until it leaves your body when you urinate. Kidney stones form when tiny mineral crystals in your urine stick together. Kidney stones can range in size and shape. They can be as small as a grain of sand or as large as a golf ball, although stones that big are rare. "}, {"url": "http://www.mayoclinic.org/diseases-conditions/bladder-stones/basics/definition/CON-20030296", "passage_text": "Bladder stones are hard masses of minerals in your bladder. Bladder stones develop when urine in your bladder becomes concentrated, causing minerals in your urine to crystallize. Concentrated, stagnant urine is often the result of not being able to completely empty your bladder. When symptoms do occur, they can range from abdominal pain to blood in your urine. Small bladder stones sometimes pass on their own, but you may need to have others removed by your doctor. Left untreated, bladder stones can cause infections and other complications."}, {"url": "http://www.medicinenet.com/kidney_stones/article.htm", "passage_text": "1 Dehydration is a major risk factor for kidney stone formation. 2  Symptoms of a kidney stone include flank pain (the pain can be quite severe) and blood in the urine (hematuria). 3  People with certain medical conditions, such as gout, and those who take certain medications or supplements are at risk for kidney stones. 1 Nephrolithiasis is the medical term for kidney stones. 2  One in every 20 people develop kidney stones at some point in their life. 3  Kidney stones form when there is a decrease in urine volume and/or an excess of stone-forming substances in the urine."}, {"url": "http://healthquestions.medhelp.org/kidney-stones-and-bladder-pain", "passage_text": "Hi, Kidney stones often do not cause any symptoms. Usually, there is extreme pain, which begins suddenly when a stone moves in the urinary tract and blocks the flow of urine.If the stone is too large to pass easily, pain continues as the muscles in the wall of the narrow ureter try to squeeze the stone into the bladder. Read More. Generally you feel the pain as the stone goes from the kidney, through the ureter, to the bladder. While it just kind of hangs out in the bladder, it causes your bladder to spasm a bit making you feel like you really need to go even though there is not much urine in there."}, {"url": "http://www.medicinenet.com/kidney_stones/article.htm", "passage_text": "1 Symptoms of a kidney stone include flank pain (the pain can be quite severe) and blood in the urine (hematuria). 2  People with certain medical conditions, such as gout, and those who take certain medications or supplements are at risk for kidney stones. 3  Diet and hereditary factors are also related to stone formation. 1 Nephrolithiasis is the medical term for kidney stones. 2  One in every 20 people develop kidney stones at some point in their life. 3  Kidney stones form when there is a decrease in urine volume and/or an excess of stone-forming substances in the urine."}]