[{"url": "http://www.answers.com/Q/How_long_can_deli_meat_stay_fresh_in_the_refrigerator", "passage_text": "If the lunch meat is stored in a air tight container, it can last for about 5 to 7 days. You can freeze lunch meat for use at a later date. This food will only last a few days. 10 days in the refrigerator if the food is stored properly. Place in an air tight container for the best results. You can transfer the foo … d to the freezer if longer storage is needed."}, {"url": "http://www.answers.com/Q/How_long_can_deli_meat_stay_fresh_in_the_refrigerator", "passage_text": "Confidence votes 22.7K. If the deli meat has been handled properly-no temperature abuse, no contamination, properly packaged-you should expect it to last 3-5 days. Place in an air tight container for the best results. You can transfer the food to the freezer if longer storage is needed. This food will only last a few days. 10 days in the refrigerator if the food is stored properly. Place in an air tight container for the best results. You can transfer the foo … "}, {"url": "http://askkaren.custhelp.com/app/answers/detail/a_id/477/~/how-long-does-lunch-meat-stay-fresh%3F", "passage_text": "Packaged lunch meats can be stored in the refrigerator for 2 weeks before opening. After opening a package of lunch meats or buying sliced lunch meats at a deli, you can refrigerate them for 3 to 5 days. Keep your refrigerator at 40 ° F / 4.4 °C or less). These meats can also be frozen for 1 to 2 months for best quality."}, {"url": "http://www.answers.com/Q/How_long_does_deli_roast_beef_stay_good_for_in_the_fridge", "passage_text": "This food will keep for about 5 to 7 days in the refrigerator. Place the food in an air tight container for the best results. This food can easily be transferred to the freeze … r for longer storage time. 12 people found this useful. This food will keep for about 5 days in the refrigerator. Place the food in an air tight container for best results. It can later be transferred to the freezer for longer stor … age."}, {"url": "http://www.eatbydate.com/proteins/meats/deli-meat-shelf-life-expiration-date/", "passage_text": "You can help deli meat keep fresh longer by storing it in your refrigerator immediately after use. Once opened, deli meat should be stored in a tightly closed container to keep out moisture and other contaminants. The shelf life of deli meat depends on a variety of factors, such as the sell by date, the type of meat, the preparation method and how the deli meat was stored. Deli meats are also known as cold cuts, lunch meat, luncheon meats, sandwich meats, cooked meats, sliced meats and cold meats."}, {"url": "https://answers.yahoo.com/question/index?qid=20090226212841AAD8tY9", "passage_text": "Many 'experts' think you can probably get 10 days out of cold cuts if properly stored (ie: not in the bag you bought it in). For me personally, since I have a huge aversion to being sick in any way, I only would leave deli meats in the fridge LESS than one week, 4 days maximum. 3 to 5 days, depending on when the meat was sliced. You usually don't know how long it's been in the case. If you want to be sure it's fresh, ask the deli to slice it fresh for you."}, {"url": "http://www.answers.com/Q/How_long_does_deli_roast_beef_stay_good_for_in_the_fridge", "passage_text": "Confidence votes 30.7K. This food will keep for about 5 days in the refrigerator. Place the food in an air tight container for the best results. This food can easily be transferred to the freezer for longer storage time. This food will keep for about 5 days in the refrigerator. Place the food in an air tight container for best results. It can later be transferred to the freezer for longer stor … age."}, {"url": "http://blog.foodnetwork.com/healthyeats/2013/06/25/how-long-will-the-food-in-your-refrigerator-last/", "passage_text": "1 Rotisserie chicken: 3 to 4 days (refrigerator) or 2 to 3 months (freezer). 2  Opened package of hot dogs: 1 week (refrigerator) or 1 to 2 months (freezer). 3  Opened package of deli meat: 3 to 4 days (refrigerator) or 1 to 2 months (freezer). 1 Opened package of hot dogs: 1 week (refrigerator) or 1 to 2 months (freezer). 2  Opened package of deli meat: 3 to 4 days (refrigerator) or 1 to 2 months (freezer). 3  Cooked meat dishes: 3 to 4 days (refrigerator) or 2 to 6"}, {"url": "http://blog.foodnetwork.com/healthyeats/2013/06/25/how-long-will-the-food-in-your-refrigerator-last/", "passage_text": "1 Meats with gravy or sauces: 1 to 2 days refrigerator or 6 months (freezer). 2  Rotisserie chicken: 3 to 4 days (refrigerator) or 2 to 3 months (freezer). 3  Opened package of hot dogs: 1 week (refrigerator) or 1 to 2 months (freezer). 4  Opened package of deli meat: 3 to 4 days (refrigerator) or 1 to 2 months (freezer). 1 Opened package of hot dogs: 1 week (refrigerator) or 1 to 2 months (freezer). 2  Opened package of deli meat: 3 to 4 days (refrigerator) or 1 to 2 months (freezer). 3  Cooked meat dishes: 3 to 4 days (refrigerator) or 2 to"}]