[{"url": "https://en.wikipedia.org/wiki/Metamorphic_rock", "passage_text": "Metamorphic rocks arise from the transformation of existing rock types, in a process called metamorphism, which means change in form. The original rock (protolith) is subjected to heat (temperatures greater than 150 to 200 °C) and pressure (1500 bars), causing profound physical and/or chemical change. The protolith may be a sedimentary rock, an igneous rock or another older metamorphic rock."}, {"url": "http://geology.about.com/cs/basics_roxmin/a/aa011804c.htm", "passage_text": "Metamorphic rocks are the third great class of rocks. These are what happens when sedimentary and igneous rocks become changed, or metamorphosed (changed in form), by conditions underground. The four main agents that metamorphose rocks are heat, pressure, fluids and strain. These agents can act and interact in an infinite variety of ways. As a result, most of the thousands of rare minerals known to science occur in metamorphic rocks. "}, {"url": "http://www.tulane.edu/~sanelson/eens212/typesmetamorph.htm", "passage_text": "As the temperature and/or pressure increases on a body of rock we say the rock undergoes prograde metamorphism or that the grade of metamorphism increases. Metamorphic grade is a general term for describing the relative temperature and pressure conditions under which metamorphic rocks form. Cataclastic metamorphism occurs as a result of mechanical deformation, like when two bodies of rock slide past one another along a fault zone. Heat is generated by the friction of sliding along such a shear zone, and the rocks tend to be mechanically deformed, being crushed and pulverized, due to the shearing."}, {"url": "https://en.wikipedia.org/wiki/Metamorphism", "passage_text": "Metamorphism is the change of minerals or geologic texture (distinct arrangement of minerals) in pre-existing rocks (protoliths), without the protolith melting into liquid magma (a solid-state change). The change occurs primarily due to heat, pressure, and the introduction of chemically active fluids. Metamorphism produced with increasing pressure and temperature conditions is known as prograde metamorphism. Conversely, decreasing temperatures and pressure characterize ret"}, {"url": "http://academic.emporia.edu/abersusa/go336/salley/home.htm", "passage_text": "Due to the environment and chemical elements in the parent rock, specific minerals are formed. Metamorphism is between a total melt of solution that form igneous rocks and the deposition of sediment under a normal environment that forms sedimentary rocks. "}, {"url": "http://www.tulane.edu/~sanelson/eens1110/metamorphic.htm", "passage_text": "The original rock that has undergone metamorphism is called the protolith. Protolith can be any type of rock and sometimes the changes in texture and mineralogy are so dramatic that is difficult to distinguish what the protolith was. 1  Note that diagenesis and weathering are also a changes in form that occur in rocks. Metamorphism occurs because rocks undergo changes in temperature and pressure and may be subjected to differential stress and hydrothermal fluids. Metamorphism occurs because some minerals are stable only under certain conditions of pressure and temperature. When pressure and temperature change, chemical reactions occur to cause the minerals in the rock to change to an assemblage that is stable at the new pressure and temperature condition"}, {"url": "http://www.tulane.edu/~sanelson/eens212/typesmetamorph.htm", "passage_text": "Since only a small area surrounding the intrusion is heated by the magma, metamorphism is restricted to the zone surrounding the intrusion, called a metamorphic or contact aureole. Outside of the contact aureole, the rocks are not affected by the intrusive event. Cataclastic metamorphism occurs as a result of mechanical deformation, like when two bodies of rock slide past one another along a fault zone. Heat is generated by the friction of sliding along such a shear zone, and the rocks tend to be mechanically deformed, being crushed and pulverized, due to the shearing."}, {"url": "http://www.tulane.edu/~sanelson/eens212/typesmetamorph.htm", "passage_text": "Classification Classification of metamorphic rocks depends on what is visible in the rock and its degree of metamorphism. Note that classification is generally loose and practical such that names can be adapted to describe the rock in the most satisfactory way that conveys the important characteristics. Cataclastic metamorphism occurs as a result of mechanical deformation, like when two bodies of rock slide past one another along a fault zone. Heat is generated by the friction of sliding along such a shear zone, and the rocks tend to be mechanically deformed, being crushed and pulverized, due to the shearing."}, {"url": "http://volcano.oregonstate.edu/metamorphic-rocks-lesson-14", "passage_text": "Gneiss can be formed from a sedimentary rock such as sandstone or shale, or it can be formed from the metamorphism of the igneouse rock grantite. Gneiss can be used by man as paving and building stone. Non-Foliates are metamorphic rocks that have no cleavage at all. Metamorphism can be instantaneous as in the shearing of rocks at plate boundaries or can take millions of years as in the slow cooling of magma buried deep under the surface of the Earth. There are three ways that metamorphic rocks can form."}]