[{"url": "https://en.wikipedia.org/wiki/Extracellular_matrix", "passage_text": "In biology, the extracellular matrix (ECM) is a collection of extracellular molecules secreted by cells that provides structural and biochemical support to the surrounding cells. The components of the glycoprotein matrix help cell walls of adjacent plant cells to bind to each other. The selective permeability of the cell wall is chiefly governed by pectins in the glycoprotein matrix. Plasmodesmata (singular: plasmodesma) are pores that traverse the cell walls of adjacent plant cells."}, {"url": "https://en.wikipedia.org/wiki/Matrix_(biology)", "passage_text": "The main ingredients of the extracellular matrix are glycoproteins secreted by the cells. (Recall that glycoproteins are proteins with covalently bound carbohydrates, usually short chains of sugars.) The most abundant glycoprotein in the ECM of most animal cells is collagen, which forms strong fibers outside the cells. (December 2009). In biology, matrix (plural: matrices) is the material (or tissue) in animal or plant cells, in which more specialized structures are embedded, and a specific part of the mitochondrion that is the site of oxidation of organic molecules. The internal structure of connective tissues is an extracellular matrix"}, {"url": "http://medical-dictionary.thefreedictionary.com/extracellular+matrix", "passage_text": "extracellular matrix, a substance containing collagen, elastin, proteoglycans, glycosaminoglycans, and fluid, produced by cells and in which the cells are embedded. The matrix secreted by chondroblasts, for example, is responsible for the properties of cartilage. extracellular matrix (eksˈ·tr ·selˑ·y ·ler māˑ·triks) , n substance produced by cells and secreted into the environment in which the cells are embedded; contains collagen, proteoglycans, glycosaminoglycans, and fluid; can influence the behavior of the cells. Also called. ECM."}, {"url": "http://www.biology-online.org/dictionary/Cell_matrix", "passage_text": "Cell matrix. Definition. noun, plural: cell matrices. An insoluble, dynamic gel in the cytoplasm, believed to be involved in cell shape determination and locomotive mechanism, particularly across a solid substrate. "}, {"url": "http://www.ncbi.nlm.nih.gov/books/NBK26810/", "passage_text": "The macromolecules that constitute the extracellular matrix are mainly produced locally by cells in the matrix. As we discuss later, these cells also help to organize the matrix: the orientation of the cytoskeleton inside the cell can control the orientation of the matrix produced outside. In most connective tissues, the matrix macromolecules are secreted largely by cells called fibroblasts (Figure 19-35). Tissues are not made up solely of cells. A substantial part of their volume is extracellular space, which is largely filled by an intricate network of macromolecules constituting the extracellular matrix (Figure 19-33)."}, {"url": "http://medical-dictionary.thefreedictionary.com/Intercellular+matrix", "passage_text": "extracellular matrix, a substance containing collagen, elastin, proteoglycans, glycosaminoglycans, and fluid, produced by cells and in which the cells are embedded. The matrix secreted by chondroblasts, for example, is responsible for the properties of cartilage. "}, {"url": "http://www.biologyreference.com/Ep-Fl/Extracellular-Matrix.html", "passage_text": "The extracellular matrix is a meshwork of proteins and carbohydrates that binds cells together or divides one tissue from another. The extracellular matrix is the product principally of connective tissue, one of the four fundamental tissue types, but may also be produced by other cell types, including those in epithelial tissues."}, {"url": "http://www.biology-online.org/dictionary/Extracellular_matrix", "passage_text": "noun, plural: extracellular matrices. The non-cellular portion of a tissue produced and secreted by cells and mainly for providing support. Supplement. The extracellular matrix is the non-cellular portion of a tissue. It is a collection of extracellular material produced and secreted by cells into the surrounding medium. The main function of the extracellular matrix is to provide structural and biochemical support to the surrounding cell"}, {"url": "http://wiki.pingry.org/u/ap-biology/index.php/Extracellular_matrix", "passage_text": "Overview. The Extracellular Matrix (ECM) is a complex structural system that supports and protects animal cells, and is often referred to as the connective tissue. The meshlike structure of the ECM is composed of mainly from collagen proteins connected to glycoprotein."}]