[{"url": "http://www.amazon.com/youtube-com-YouTube/product-reviews/B00I0GS2SS", "passage_text": "Verified Purchase. The official YouTube app is great and works very well on the Amazon Fire TV. I had often tried YouTube on my Apple TV and sometimes it was slow to load or not particularly good quality (even when set to the highest resolution possible). As as an owner of Roku 2, that device does not support YouTube."}, {"url": "http://www.itworld.com/article/2850950/amazon-fire-tv-stick-versus-chromecast-which-is-best-for-you.html", "passage_text": "The Fire TV Stick give you access to Amazon Instant Video (including Prime), Netflix, YouTube, and a number of other streaming services, while Chromecast gives you access to just about anything you can display on your browser, which makes it more flexible."}, {"url": "http://www.techradar.com/us/reviews/audio-visual/av-accessories/amazon-fire-tv-stick-1274525/review", "passage_text": "Update #1: The Amazon Fire TV Stick will be even better in 2015. Amazon announced today that its pint-sized streaming stick will be receiving the voice search remote that comes standard with the full-size box starting on October 22."}, {"url": "http://www.businessinsider.com/amazon-fire-tv-stick-review-2014-11", "passage_text": "The Amazon Fire Stick is officially available on Amazon for a dirt-cheap $40. As a diehard fan of my Roku ($99), I was unsure of what to expect from the Amazon Fire Stick."}, {"url": "http://www.youtube.com/watch?v=3Dl3xoCKdVM", "passage_text": "At this point, it seems the only real advantage to using an Amazon Fire TV box would be its Ethernet connection for faster HD video throughput, and its faster processor for smoother gaming. We’ll be pitting the Fire TV Stick against the Fire TV box and, separately, the Roku Streaming Stick and Chromecast soon."}, {"url": "http://www.youtube.com/watch?v=3Dl3xoCKdVM", "passage_text": "This feature is not available right now. Please try again later. Amazon’s Fire TV stick starts shipping on November 19, and we got our hands on one today for an early look at what promises to be one of the hottest gift items this holiday season."}, {"url": "http://www.amazon.com/youtube-com-YouTube/product-reviews/B00I0GS2SS", "passage_text": "76 of 80 people found the following review helpful. 4.0 out of 5 stars YouTube-view video content on your TV, need improvements in layout. By JMM on April 3, 2014. The official YouTube app is great and works very well on the Amazon Fire TV. I had often tried YouTube on my Apple TV and sometimes it was slow to load or not particularly good quality (even when set to the highest resolution possible). As as an owner of Roku 2, that device does not support YouTube."}]