[{"url": "http://www.digitalsmoke.org/how-to-inhale-to-get-the-best-from-your-vapor-cigarette.php", "passage_text": "1 Keep this button pressed down when you begin to take a drag. 2  Inhale for at least 5 seconds at a time. 3  Hold the vapor in your lungs for several seconds before exhaling. 4  Automatic vapor cigarette owners need to take a quick primer drag before utilizing the same method as manual users. Press the button on a manual e-cigarette for up to 2 seconds before you begin to inhale. 2  Keep this button pressed down when you begin to take a drag. 3"}, {"url": "http://www.wikihow.com/Smoke-a-Cigarette", "passage_text": "1 To do this, before you inhale, push some of the smoke back into the air (without exhaling), and as it exits your mouth, suck it in with your nose. 2  This may take some practice to perfect. 3  As you continue to smoke, your tolerance for the smoke will increase. How much of the cigarette you smoke before you're done depends on how much of a cigarette you like to smoke. 2  Obviously, you won't smoke the filter, and if smoking straights, there's only so much cigarette you can smoke until you're frying your lips."}, {"url": "http://incompetech.com/gallimaufry/cigarette.html", "passage_text": "When smoking a cigarette, you do not inhale the smoke directly into your lungs; rather, you use your mouth as a staging area. When at rest, there is usually very little air in your mouth-but you can make an air pocket by keeping your lips closed and lowering your jaw-keeping your tongue at the bottom. Try putting the cigarette up to your mouth. You need to put your lips around the tip of the filter (only about 5mm in). The filter end should not extend into your mouth farther than your teeth, and probably won't even get that far."}, {"url": "http://incompetech.com/gallimaufry/cigarette.html", "passage_text": "To light the cigarette, hold it in your mouth and bring your flame source near the tip. You don't need to put the tip into the flame-just bring the edges of the cigarette and the flame together. Then puff a little bit. It should draw the flame somewhat into the cigarette.ry putting the cigarette up to your mouth. You need to put your lips around the tip of the filter (only about 5mm in). The filter end should not extend into your mouth farther than your teeth, and probably won't even get that far."}, {"url": "http://www.metroecigs.com/content/how-do-you-inhale-an-electronic-cigarette.asp", "passage_text": "4. Nicotine can only penetrate by inhalation into the lungs on a traditional cigarette. However, with an e-cigarette, it absorbs through mucous membranes in the mouth, lungs and nose."}, {"url": "http://www.learn.vaporfi.com/inhaling-and-puffing.php", "passage_text": "1 When you inhale on your electronic cigarette, take a slow and steady draw until vapor fills your mouth. ( 2 The process is similar to smoking a cigar.) With e-smoking, you don't have to draw the vapor directly into your lungs like you would smoke from a traditional cigarette in order to achieve the desired effect. Nicotine from tobacco cigarettes can only be absorbed through the lungs, but with e-smoking, it can also be absorbed through the mucus membranes in the mouth first, then the lungs and nose. 2  Wait. 3  The hit that a smoker waits for is typically felt around 8 seconds after taking a puff on their tobacco cigarette."}, {"url": "http://www.digitalsmoke.org/how-to-inhale-to-get-the-best-from-your-vapor-cigarette.php", "passage_text": "1 Press the button on a manual e-cigarette for up to 2 seconds before you begin to inhale. 2  Keep this button pressed down when you begin to take a drag. 3  Inhale for at least 5 seconds at a time.4  Hold the vapor in your lungs for several seconds before exhaling."}, {"url": "http://www.wikihow.com/Enjoy-a-Cigarette", "passage_text": "1 After inhaling, keep the smoke in your lungs for a short while then exhale. 2  Smoking cigarettes is not like smoking marijuana; you will not get high from inhaling and waiting until you nearly pass out to exhale.3  Instead, breathe in normally lung capacity, hold it for a moment,"}, {"url": "http://www.themedicalquestions.com/drug/how-do-you-properly-inhale-cigarette-smoke.html", "passage_text": "A: you take a hit of the cigarette and then inhale like youre going to take a deep breath then exhale. sometimes during the day you cant see the smoke. i smoke and i also get light headed so i think youre doing it right. How to Inhale Cigarette Smoke.http://www.wikihow.com/Inhale-Cigarette-Smoke. ･ Take a drag (as in, take smoke into your mouth) of your cigarette. ･ Open your mouth and breath in as if you were drinking something out of a straw."}, {"url": "http://www.wikihow.com/Smoke-a-Cigarette", "passage_text": "6. Light up! Bring your match or lighter up to the tip of the cigarette, and suck in as if you're sucking a milkshake through a straw. Don't inhale when lighting a cigarette: just take a couple short, firm draws on it to get the tobacco lit. Factory-made cigarettes will generally light quickly and burn uniformly. How much of the cigarette you smoke before you're done depends on how much of a cigarette you like to smoke. 2  Obviously, you won't smoke the filter, and if smoking straights, there's only so much cigarette you can smoke until you're frying your lips."}]