[{"url": "http://www.youtube.com/watch?v=mG64SfveTlU", "passage_text": "This is how a small perforation of the eardrum looks like. This is my eardrum after 48 hours of the perforation. It happened during snorkelling-diving to about 3m without equalizing properly. Was painful the day it happened. A little painful with water still coming out the next day. Not painful at all on the third day. "}, {"url": "https://en.wikipedia.org/wiki/Eardrum", "passage_text": "Not to be confused with the secondary tympanic membrane of the round window. In human anatomy, the eardrum, or tympanic membrane, is a thin, cone-shaped membrane that separates the external ear from the middle ear in humans and other tetrapods. Its function is to transmit sound from the air to the ossicles inside the middle ear, and then to the oval window in the fluid-filled cochlea. "}, {"url": "http://www.entusa.com/eardrum_and_middle_ear.htm", "passage_text": "Other Diseases of the Middle Ear and Eardrum (tympanic membrane) (Go To Top). Eardrum Hemorrhagic Blister: This is a rare condition which may be seen with trauma, severe bacterial infections and viral infections (Herpes Zoster). This patient did not respond to antibiotics and was placed on antiviral agents. "}, {"url": "https://www.healthtap.com/topics/what-does-a-dull-eardrum-mean", "passage_text": "Get help from a doctor now ›. Dull eardrum: A dull eardrum usually indicates there is a little fluid in the middle ear space. It does not always mean an associated infection. Ear drum usually is like plastic wrap-you can see through it. Dull ear drum looks more like waxed paper. Depends: A dull or absent light reflex from the eardrum may be a sign of a middle ear infection or fluid. The eardrum may be red and bulging if there is an infection. Amber liquid or bubbles behind the eardrum are often seen if fluid collects in the middle ear."}, {"url": "http://www.emedicinehealth.com/perforated_eardrum/article_em.htm", "passage_text": "The eardrum (tympanic membrane) is a thin, oval layer of tissue deep in the ear canal. It helps protect the delicate middle and inner ear from the outside. It is called an eardrum because it looks and acts like a drum. The eardrum receives vibrations from the outer ear and transmits them to the small hearing bones (ossicles), of the middle ear. Because it is so thin, the eardrum can be ruptured or punctured. The hole exposes the middle and inner ear to damage or infection"}, {"url": "http://www.healthcaremagic.com/search/what-does-a-busted-eardrum-look-like", "passage_text": "Public Forum Discussions. my left eardrum sounded like it looks normal, mostly white, my right eardrum looks bright orange ... it was the eardrum itself. Also there was a small dark spot up at the top of the eardrum that looked like a hole. I ... "}, {"url": "http://www.medicinenet.com/anatomy_of_an_ear_infection_pictures_slideshow/article.htm", "passage_text": "The Eustachian tube is the canal that connects your middle ear to your throat. When the Eustachian tube is open as it is normally, it prevents fluid and air pressure from building up inside the ear. Infections like colds, the flu, or allergic reactions can cause the Eustachian tube to become swollen and blocked. "}, {"url": "https://answers.yahoo.com/question/index?qid=20061204111853AAd4XvX", "passage_text": "Best Answer: The first thing you'll be happy to hear is that a ruptured eardrum is not as serious as it sounds! A ruptured or perforated eardrum usually heals by itself within 2 months. The goal of treatment is to relieve pain and prevent infection. show more My 4 year old poked the inside of his ear with a straw (the pointy kid-drink kind). He screamed and cried when it happened, now he just complains that his ear hurts (every 5 minutes) I can't see anything out of the ordinary and there was just a dab of blood when I shoved a tissue in there."}, {"url": "http://www.webmd.com/pain-management/ruptured-eardrum-symptoms-and-treatments", "passage_text": "A ruptured eardrum is a tear in the thin membrane that separates your outer ear from your inner ear. That membrane, known as the tympanic membrane, is made of tissue that resembles skin. The eardrum serves two important functions in your ear. It senses vibrating sound waves and converts the vibration into nerve impulses that convey the sound to your brain. "}]