[{"url": "https://en.wikipedia.org/wiki/Penicillin", "passage_text": "Penicillin (PCN or pen) is a group of antibiotics which include penicillin G (intravenous use), penicillin V (oral use), procaine penicillin, and benzathine penicillin (intramuscular use). They are derived from Penicillium fungi. Penicillin antibiotics were among the first medications to be effective against many bacterial infections caused by staphylococci and streptococci. Penicillins are still widely used today, though many types of bacteria have developed resistance following extensive use. All penicillins are β-lactam antibiotics."}, {"url": "http://cmsynergy.com/Mold/penicillium.htm", "passage_text": "Uses. Penicillium notatum and penicillium chrysogenum are used to make penicillin. In fact, it is sometimes referred to as medicinal mold. Other varieties, such as penicillium roqueforti are used to ripen cheese, although it can also cause mold in grain crops. Penicillium fumiculosum is used in antibotics."}, {"url": "https://en.wikipedia.org/wiki/Penicillium", "passage_text": "Penicillium (/ˌpɛnɪˈsɪlɪəm/) is a genus of ascomycetous fungi of major importance in the natural environment as well as food and drug production. Some members of the genus produce penicillin, a molecule that is used as an antibiotic, which kills or stops the growth of certain kinds of bacteria inside the body. Penicillium species are present in the air and dust of indoor environments, such as homes and public buildings. The fungus can be readily transported from the outdoors, and grow indoors using building material or accumulated soil to obtain nutrients for growth."}, {"url": "http://www.answers.com/Q/What_are_some_main_uses_of_FUNGI", "passage_text": "The main use is that a fungi name penicillium notatum use for making medicene peniciline. Fungi are important as they can be used to decompose dead matter. It can help destroy green flies. It can also be useful for making citric acid, antibiotics and they can be useful for food e.g. wine, beer and bread. There are several useful fungi. Two fungi which have shown to be  useful are penicillium which was what early forms of the antibiotic  penicillin was made of, and acidophilu … s which has been shown to aid  digestion."}, {"url": "http://www.moldbacteria.com/mold/penicillium.html", "passage_text": "Penicillium species. Penicillium chrysogenum spores. Penicillium is genus of moulds found everywhere world-wide. The name Penicillium comes from the resemblance of the spore producing structures (conidiophores) of the fungus to a paintbrush (penicillus is the Latin word for paintbrush). As mentioned earlier, Penicillium species are one of the most common causes of spoilage of fruits and vegetables. For example, P. italicum and P. digitatum are common causes of rot of citrus fruits, while P. expansum is known to spoil apples. Penicillium chrysogenum is the most common species in indoor environment."}, {"url": "http://bugs.bio.usyd.edu.au/learning/resources/Mycology/UsesOf_Fungi/industrialProduction/fungalDrugs.shtml", "passage_text": "In 1941, penicillin from the fungus Penicillium chrysogenum was first used successfully to treat an infection caused by a bacterium. Use of penicilin revolutionised the treatment of pathogenic disease. Many formally fatal diseases caused by bacteria became treatable, and new forms of medical intervention were possible. "}, {"url": "http://www.wisegeekhealth.com/what-are-the-medical-uses-of-penicillium-chrysogenum.htm", "passage_text": "Penicillium chrysogenum is the fungus from which penicillin, the first antibiotic medication, is made. The medical use for antibiotics, as the name suggests, is to cure diseases that are caused by bacteria. The medication that is made from Penicillium chrysogenum, however, has become less effective due to the development of bacterial strains that are resistant to treatment with penicillin. Many people in the medical community attribute the development of these resistant strains to improper use of antibiotics."}, {"url": "https://en.wikipedia.org/wiki/Penicillium", "passage_text": "Penicillium is classified as a genus of: domain eukaryota, kingdom Fungi, division Ascomycota (order Eurotiales, class Eurotiomycetes, family Trichocomaceae). Penicillium species are present in the air and dust of indoor environments, such as homes and public buildings. The fungus can be readily transported from the outdoors, and grow indoors using building material or accumulated soil to obtain nutrients for growth."}, {"url": "http://cmsynergy.com/Mold/penicillium.htm", "passage_text": "Penicillium is a fungus, and is the most abundant mold source in soil. There are more than 150 species of penicillium. Penicillium that is more than two-weeks old is bluish in color. Penicillium is a cryophilic fungi, which means it likes the cold, growing best at 34 degrees (the temperature of a refrigerator). Penicillium notatum and penicillium chrysogenum are used to make penicillin. In fact, it is sometimes referred to as medicinal mold. Other varieties, such as penicillium roqueforti are used to ripen cheese, although it can also cause mold in grain crops. Penicillium fumiculosum is used in antibotics."}, {"url": "https://microbewiki.kenyon.edu/index.php/Penicillium", "passage_text": "Penicillium is often reffered to as Deuteromycetes, or Fungi imperfecti. The name Penicillium comes from the word brush; this refers to the appearance of spores in Penicillium. One species, Penicillium chrysogenum 9' , is classified as a psychrotrophic microorganism. Bancerz et. al. However, Penicillium is not merely a harmful fungus. It also has many useful species. For example, Penicillium roquefortii is used to make bleu cheese. The color of the cheese comes from the spores (conidia) of the fungus. The spores are injected into the cheese curd during fermentation."}]