[{"url": "http://www.girona-airport.net/transport.php", "passage_text": "The shuttles from and to Girona-Costa Brava airport are constantly going on matching up with flight arrivals and departures. All the line have return trip. 1  Airport-Barcelona (approximately 1 hour 10 minutes, departure times depending on flights. There are three ways to get to Girona-Costa Brava airport with public transport services to Barcelona city, although train it is a non-direct way to get to or from the airport to Barcelona city. It is also possible to go to other cities at Costa Brava area. 1  CAR. 2  BUS."}, {"url": "http://barcelona-girona-airport.com/", "passage_text": "Getting here and away. Welcome to Barcelona Girona Airport official guide, a free, independent online guide. We aim to provide you with all the information you need about Girona Airport (GRO) and its services, to ensure that your experience is easy and enjoyable. The airport is geolocated at Latitude: 41.89804 and Longitude: 2.766383. The Time Zone is: +1:00 hours from UTC/GMT"}, {"url": "http://www.girona-airport.net/", "passage_text": "Girona-Costa Brava airport IATA (GRO) ICAO (LEGE) it is the second most important at Barcelona area.Located at the town Vilobi vilobí’D onyar and just.7 8 miles away for the city center Of. Girona barcelona city is 57 miles away so it is not a long, way that is why is considered an alternative airport Of Barcelona El. prat There are multiple destinations from the airport either to Spain and European countries such as the UK, Italy, The Netherlands, Denmark, Slovakia, Ireland, Belgium, Germany, Ukraine, Sweden, Turkey, Cyprus, Malta, Morocco, France, Poland, Estonia and Lithuania."}, {"url": "http://www.girona-airport.net/", "passage_text": "Girona Airport Information. Girona-Costa Brava airport IATA (GRO) ICAO (LEGE) it is the second most important at Barcelona area.Located at the town Vilobi vilobí’D onyar and just.7 8 miles away for the city center Of. girona There are multiple destinations from the airport either to Spain and European countries such as the UK, Italy, The Netherlands, Denmark, Slovakia, Ireland, Belgium, Germany, Ukraine, Sweden, Turkey, Cyprus, Malta, Morocco, France, Poland, Estonia and Lithuania."}, {"url": "http://wikitravel.org/en/Girona", "passage_text": "Get in [edit]. Girona is located north of Barcelona and can be reached from there by bus, train, or one's own car. There is an airport close to the town with a wide range of connections on Ryanair. It is also 98km (61 miles) away from Barcelona. Girona Airport is 1hr bus ride from Barcelona center. Ryanair mentions Barcelona in their description of Girona airport. You can make connection between the airport and Barcelona. There is also an hourly bus into Girona from the airport"}, {"url": "http://www.girona-airport.net/transport.php", "passage_text": "GIRONA AIRPORT: Transport information. There are three ways to get to Girona-Costa Brava airport with public transport services to Barcelona city, although train it is a non-direct way to get to or from the airport to Barcelona city. It is also possible to go to other cities at Costa Brava area. 1  CAR. 2  BUS."}, {"url": "http://www.geronaairport.net/", "passage_text": "Your Guide to Gerona Airport. The Spanish city of Girona or Gerona is in the northeastern part of Catalonia. Its population is less than 100,000 and serves as the province with the same name. Located about 62 miles northeast of Barcelona, Gerona is among the major cities in Catalan."}, {"url": "http://www.girona-tourist-guide.com/", "passage_text": "Girona is 103 Km North East of Barcelona and many tourists fly into Girona on one of the many budget airlines like RyanAir and then make their way on to Barcelona or the Costa Brava. The Girona Tourist Guide will help you arrange your visit to Girona in Spain. Girona airport is 20 minutes south of the city, and receives lots of budget flights. It is approximately one hours drive to Barcelona from Girona airport, and so many tourists heading for Barcelona find that flying to Girona is a cheaper option. You can then take the bus, taxi or hire a car to get to Barcelona."}, {"url": "https://en.wikipedia.org/wiki/Girona-Costa_Brava_Airport", "passage_text": "The airport is well connected to the Costa Brava and the Pyrenees. Girona Airport is used as an alternative airport for Barcelona as well, even though the airport is 92 km (57 mi) north of Barcelona. "}]