[{"url": "https://en.wikipedia.org/wiki/Clitheroe_Castle", "passage_text": "Clitheroe Castle is located in Clitheroe, Lancashire, England. The castle is of Norman origin, probably built in the early twelfth century. Stewards were living in part of the castle in the nineteenth century. It has been suggested that Clitheroe Castle may have been first built before 1086 as there is reference to the  castellatu Rogerii pictaviensis  in the Domesday Book entry for nearby Barnoldswick. However, it is likely the passage refers to another castle."}, {"url": "http://www.nhs.uk/Services/careproviders/Overview/DefaultView.aspx?id=48423", "passage_text": "Overview. Castle Supported Living Ltd is registered to provide personal care to people with a learning disability living in their own homes. The service provides flexible staffing arrangements depending on people’s needs. The agency’s office is located in the centre of Clitheroe"}, {"url": "https://en.wikipedia.org/wiki/Clitheroe_Castle", "passage_text": "Clitheroe Castle Museum is adjacent to the castle. The castle was listed as a Scheduled Monument on 10 April 1915 (and later, under the Ancient Monuments and Archaeological Areas Act 1979 law). It was Grade I listed on 19 May 1950. It has been suggested that Clitheroe Castle may have been first built before 1086 as there is reference to the  castellatu Rogerii pictaviensis  in the Domesday Book entry for nearby Barnoldswick. However, it is likely the passage refers to another castle."}, {"url": "http://www.visitlancashire.com/explore/clitheroe/things-to-do", "passage_text": "Clitheroe Castle Museum stands high on Castle Hill, in the shadow of the keep, an image which has dominated Clitheroe's skyline for over 800 years. Clitheroe. The Bowland Beer Company Ltd started operating in April 2003, brewing on a one Brewers Barrel (BBL) plant in a store room at the Bashall Barn farm shop a few miles North West of Clitheroe, but is now located at Holmes Mill in Clitheroe itself."}, {"url": "https://en.wikipedia.org/wiki/Clitheroe_Castle", "passage_text": "Clitheroe Castle c.1650 from An history of the original Parish of Whalley, and honor of Clitheroe 4th ed. The keep is square three-story tower with flat pilasters at the corners giving the appearance of corner towers. It has been suggested that Clitheroe Castle may have been first built before 1086 as there is reference to the  castellatu Rogerii pictaviensis  in the Domesday Book entry for nearby Barnoldswick. However, it is likely the passage refers to another castle."}, {"url": "http://www.visitlancashire.com/explore/clitheroe/things-to-do", "passage_text": "Location: Clitheroe. Award winning Top Hat Tours can offer groups of visitors tailored tours to meet their needs as well as scheduled tours open to individuals to book onto. Haunted and Heritage tours a speciality!A selection of tours include: Ribble Valley Coach Tour. Clitheroe. The Bowland Beer Company Ltd started operating in April 2003, brewing on a one Brewers Barrel (BBL) plant in a store room at the Bashall Barn farm shop a few miles North West of Clitheroe, but is now located at Holmes Mill in Clitheroe itself."}]