[{"url": "http://www.empowher.com/community/ask/whats-ideal-temperature-home", "passage_text": "April 21, 2015 - 10:14pm. I definitely believe that everyone can come to a consensus on what feels appropriate for a room temperature. I just think it truly depends on the time of day it is, and what kind of weather it is outside. At night, most people are inclined to enjoy a cooler setting as opposed to a warmer one. A normal temperature for that would be around 67-69 degrees. And for the daytime 69-72. If it is winter then your preferences may change because the overall temperature of your house goes down. It's all subjective, but I've found that most people find comfort in the 68-70 range overall. I know that advice has been given about having a home too warm or too cold but am not sure what a healthy temperature is. I like a very warm house in winter but don't like the attached bills! We keep our programmable thermostat at 68 degrees F. We have kids but we're all healthy with no special needs."}, {"url": "https://en.wikipedia.org/wiki/Room_temperature", "passage_text": "It represents the small range of temperatures at which the air feels neither hot nor cold, approximately 21 °C (70 °F). In scientific contexts, it may denote the range between 20 and 26 °C (68 and 79 °F), with an average of 23 °C (73 °F). According to the West Midlands Public Health Observatory (UK), an adequate level of wintertime warmth is 21 °C (70 °F) for a living room, and a minimum of 18 °C (64 °F) for other occupied rooms, giving 24 °C (75 °F) as a maximum comfortable room temperature for sedentary adults."}, {"url": "https://en.wikipedia.org/wiki/Room_temperature", "passage_text": "Owing to variations in humidity and likely clothing, recommendations for summer and winter may vary; a suggested typical range for summer is 23 °C (73 °F) to 25.5 °C (78 °F), with that for winter being 20 °C (68 °F) to 23.5 °C (74 °F). According to the West Midlands Public Health Observatory (UK), an adequate level of wintertime warmth is 21 °C (70 °F) for a living room, and a minimum of 18 °C (64 °F) for other occupied rooms, giving 24 °C (75 °F) as a maximum comfortable room temperature for sedentary adults."}, {"url": "http://www.infoplease.com/ipa/A0001412.html", "passage_text": "See the table Apparent Temperature for the apparent temperatures for various combinations of room temperature and relative humidity. As an example of how to read the table, a room temperature of 70° F combined with a relative humidity of 10% feels like 64° F, but at 80% it feels like 71° F. The moisture content of the air is important, and by increasing the relative humidity to above 50% within the above temperature range, 80% or more of all average dressed persons would feel comfortable."}, {"url": "http://www.infoplease.com/ipa/A0001412.html", "passage_text": "Effects of Dry Air on the Body. Apparent Temperature for Values of Room Temperature and Relative Humidity. Compared to summer when the moisture content of the air (relative humidity) is an important factor of body discomfort, air moisture has a lesser effect on the human body during outdoor winter activities. The moisture content of the air is important, and by increasing the relative humidity to above 50% within the above temperature range, 80% or more of all average dressed persons would feel comfortable."}, {"url": "https://answers.yahoo.com/question/index?qid=20080129080549AAaycfI", "passage_text": "This Site Might Help You. RE: What should be the normal temperature for inside of a house in Pittsburgh, PA, with it being 25 outdoors? its winter time, and my husband likes to keep it at 64 degrees. I am always so cold and would like it at 72. Its usually in the 20&#39;s this time of year, and we fight over what the temp should be indoors. Either of those temperatures is normal. Ultimately, homeowners should keep their home at the temperature that is most comfortable for them at different times of year. Personally, I recommend 68 degrees in winter."}, {"url": "http://www.csmonitor.com/Business/The-Simple-Dollar/2012/0616/Your-home-s-temperature-should-change-with-the-seasons", "passage_text": "We keep our home temperature at 78 F during the summer and 62 F during the winter. Now, we’re simply trying to lower the temperature 4 F on an average day in the summer, and we’re only raising our home temperature 48 F in the winter. Because we adjust our home temperature seasonally, our air conditioner doesn’t run much at all on an average summer day."}, {"url": "https://en.wikipedia.org/wiki/Room_temperature", "passage_text": "Mercury-in-glass thermometer for measurement of room temperature. Room temperature is a colloquial expression for the typical or preferred indoor (climate-controlled) temperature to which people are generally accustomed. According to the West Midlands Public Health Observatory (UK), an adequate level of wintertime warmth is 21 °C (70 °F) for a living room, and a minimum of 18 °C (64 °F) for other occupied rooms, giving 24 °C (75 °F) as a maximum comfortable room temperature for sedentary adults."}, {"url": "http://www.currentresults.com/Weather/US/average-state-temperatures-in-winter.php", "passage_text": "Average winter temperatures range from a high of 67.4 degrees Fahrenheit (19.7 degrees Celsius) in Hawaii to a low of 2.6 °F (-16.3 °C) in Alaska. For the entire United States, excluding Hawaii and Alaska, the season averages just above freezing at 33.2 °F (0.7 °C). The average temperatures during winter for every state in the US are listed below in degrees Fahrenheit and Celsius. The states are also ranked from the hottest state in winter at number 1 to the coldest state at number 50"}]