[{"url": "http://www.answers.com/Q/Which_generation_is_dominant_in_seedless_vascular_plant", "passage_text": "In vascular plants, the principal generation phase is the sporophyte, which is usually diploid with two sets of chromosomes per cell. the answer is in the question. they don't produce seeds, but they do have vascular tissue. examples are ferns. they have spores instead of seeds. the vascular tissue is xylem … and phloem, which transport nutrients and water and allow the plants to grow tall(relatively). 18 people found this useful."}, {"url": "http://www.edhsgreensea.net/APBiology/Labs/Lab_Plant_Diversity_1.pdf", "passage_text": "Most ferns are small plants that lack woody tissue. In this lab you will investigate the diversity of pterophytes, including whisk fens, horsetails and a variety of ferns. The plants on display are sporophytes, the dominant generation in seedless vascular plants. Procedure: 1. Examine a living whisk fern on display. This is one of only two extant genera of Psilophytes. Observe the spherical structures on the stem"}, {"url": "http://www2.estrellamountain.edu/faculty/farabee/biobk/BioBookDiversity_5.html", "passage_text": "Plants divide into two groups: plants lacking lignin-impregnated conducting cells (the nonvascular plants) and those containing lignin-impregnated conducting cells (the vascular plants). Living groups of nonvascular plants include the bryophytes: liverworts, hornworts, and mosses. Vascular plants are the more common plants like pines, ferns, corn, and oaks. The phylogenetic relationships within the plant kingdom are shown in Figure 1. The sporophyte phase produces spores by meiosis within a sporangium. The gametophyte phase produces gametes by mitosis within an antheridium (producing sperm) and/or archegonium (producing eggs). These different stages of the flowering plant life cycle are shown in Figure 4."}, {"url": "http://facultyweb.wcjc.edu/biology/BIOL1407/Lab%20Handouts/Lab_4_land_plants_I.pdf", "passage_text": "Finally, these plants are gametophyte dominant, meaning that the recognizable stage of these plants is the haploid gametophyte generation. The seedless vascular plants, which include ferns and fern allies, possess several adaptations lacking in nonvascular plants. Xylem and phloem are present to efficiently transport water and sugars, respectively throughout the plant body."}, {"url": "http://facultyweb.wcjc.edu/biology/BIOL1407/Lab%20Handouts/Lab_4_land_plants_I.pdf", "passage_text": "As photosynthetic autotrophs, plants use solar energy to produce organic compounds from carbon dioxide and water. The plant kingdom consists of four major groups: the nonvascular plants, the seedless vascular plants, the gymnosperms and the angiosperms. The nonvascular plants, such as mosses and liverworts, are one of the simplest groups of the true plants. The seedless vascular plants, which include ferns and fern allies, possess several adaptations lacking in nonvascular plants. Xylem and phloem are present to efficiently transport water and sugars, respectively throughout the plant body."}, {"url": "http://www.answers.com/Q/Which_generation_is_dominant_in_seedless_vascular_plant", "passage_text": "Ferns are the most commonly known seedless vascular plant, while  there are also horsetails and club mosses. Liverworts are  not seedless vascular plants -- they are actuall … y  nonvascular. the answer is in the question. they don't produce seeds, but they do have vascular tissue. examples are ferns. they have spores instead of seeds. the vascular tissue is xylem … and phloem, which transport nutrients and water and allow the plants to grow tall(relatively). 18 people found this useful."}, {"url": "https://en.wikipedia.org/wiki/Alternation_of_generations", "passage_text": "Land plants all have heteromorphic (anisomorphic) alternation of generations, in which the sporophyte and gametophyte are distinctly different. All bryophytes, i.e. liverworts, mosses and hornworts, have the gametophyte generation as the most conspicuous. As an illustration, consider a monoicous moss. 1 The moss Mnium hornum has the gametophyte as the dominant generation. 2  It is dioicous: male plants produce only antheridia in terminal rosettes, female plants produce only archegonia in the form of stalked capsules. 3  Seed plant gametophytes are also dioicous."}, {"url": "http://faculty.weber.edu/sharley/1203/ferns.html", "passage_text": "Sporophyte: Reproduce asexually by growing new leaves out of the rhizome each year. Both gametophyte and sporophyte can reproduce asexually by fragmentation. Some of the seedless vascular plants produce a strobilus = a step tip with several closely spaced leaves with sporangia. e.g. club mosses, horsetails. Forerunner of the cones of conifers and the flower."}, {"url": "http://chsweb.lr.k12.nj.us/mstanley/outlines/plantae/ferns/ferns.htm", "passage_text": "1 Earliest Vascular plants. 2  Have true roots and stems. 3  Have true leaves. 4  Exhibit alternation of generations, However sporophyte (2N) generation is now dominant over gametophyte (N) generation. "}, {"url": "http://www.answers.com/Q/Which_generation_is_dominant_in_seedless_vascular_plant", "passage_text": "By contrast, the principal generation pha … se in non-vascular plants is usually the gametophyte, which is haploid with one set of chromosomes per cell. http://en.wikipedia.org/wiki/Vascular_plants. 4 people found this useful. 1  The Five Major Parts of the Brain At its most basic, the brain controls the body. the answer is in the question. they don't produce seeds, but they do have vascular tissue. examples are ferns. they have spores instead of seeds. the vascular tissue is xylem … and phloem, which transport nutrients and water and allow the plants to grow tall(relatively). 18"}]