[{"url": "http://people.howstuffworks.com/government/local-politics/secretary-of-state2.htm", "passage_text": "The U.S. Secretary of State advises the president on foreign affairs, and spends a lot of time traveling around the world to meet with world leaders. Besides being a diplomat him-or herself, the secretary of state also heads the U.S. Department of State."}, {"url": "https://en.wikipedia.org/wiki/Secretary_of_state_(U.S._state_government)", "passage_text": "In three states, the secretary of state is elected by the state legislature; the General Assembly of Tennessee meets in joint convention to elect the Secretary of State to a four-year term, and the Maine Legislature and New Hampshire General Court also select their secretaries of state, but to two-year terms.and in hand with this duty, in most states the Secretary of State is responsible for state trademark registration and for chartering businesses (usually including partnerships and corporations) that wish to operate within their state."}, {"url": "http://www.state.gov/secretary/115194.htm", "passage_text": "Under the Constitution, the President of the United States determines U.S. foreign policy. The Secretary of State, appointed by the President with the advice and consent of the Senate, is the President’s chief foreign affairs adviser."}, {"url": "http://www.wereyouwondering.com/what-does-the-secretary-of-state-do/", "passage_text": "by Katrina Cain. Tweet. This answer refers to the U.S. government only; although many other countries have a government seat with this same title. The U.S. Secretary of State is the highest ranking Cabinet official and is appointed by the President of the United States.he Secretary of State is also keeper of the Great Seal of the United States, a device used to authenticate documents coming from the White House and as such, the S.O.S. is responsible for drafting proclamations and replies."}, {"url": "https://en.wikipedia.org/wiki/Secretary_of_state_(U.S._state_government)", "passage_text": "Currently, in 35 states, such as California, Illinois, and Mississippi, the secretary of state is elected, usually for a four-year term. In others, the secretary of state is appointed by the governor; Florida, Oklahoma, Texas, and Virginia are amongst the states with this practice. Hand in hand with this duty, in most states the Secretary of State is responsible for state trademark registration and for chartering businesses (usually including partnerships and corporations) that wish to operate within their state."}, {"url": "http://www.wereyouwondering.com/what-does-the-secretary-of-state-do/", "passage_text": "The Secretary of State is also keeper of the Great Seal of the United States, a device used to authenticate documents coming from the White House and as such, the S.O.S. is responsible for drafting proclamations and replies. In the West Wing, the Secretary of State was Arnold Vinick played by Alan Alda."}, {"url": "https://en.wikipedia.org/wiki/Secretary_of_state_(U.S._state_government)", "passage_text": "Secretary of state is an official in the state governments of 47 of the 50 states of the United States, as well as Puerto Rico and other U.S. possessions.and in hand with this duty, in most states the Secretary of State is responsible for state trademark registration and for chartering businesses (usually including partnerships and corporations) that wish to operate within their state."}, {"url": "http://kepler.sos.ca.gov/cbs.aspx/", "passage_text": "Entity Number. Disclaimer: This tool allows you to search the Secretary of State's California Business Search database for abstracts of information for domestic stock, domestic nonprofit and qualified foreign corporations, limited liability companies and limited partnerships that have filed with this office.usiness Search. This search provides access to domestic stock, domestic nonprofit and qualified foreign corporations, limited liability company and limited partnership information of record with the California Secretary of State."}, {"url": "https://en.wikipedia.org/wiki/Secretary_of_State_of_California", "passage_text": "The Secretary of State is also responsible for the California State Archives, as well as chartering corporations. The Secretary of State is elected to four year terms, concurrent with the other constitutional officers of California, and is restricted by term limits to only two terms. The current Secretary of State, Alex Padilla, took office on January 5, 2015. The Business Entities Section for the California Secretary of State processes, files and maintains records related to corporations, limited liability companies, partnerships and other business entities conducting or planning to conduct business in California."}, {"url": "http://www.sos.ca.gov/business-programs", "passage_text": "Uniform Commercial Code. The Secretary of State's office is the central filing office for certain Uniform Commercial Code financing statements and other lien documents including notices of judgment liens, attachment liens and federal and state tax liens."}]