[{"url": "https://www.psychologytoday.com/conditions/narcissistic-personality-disorder", "passage_text": "Narcissistic Personality Disorder. Individuals with narcissistic personality disorder generally believe that the world revolves around them. This condition is characterized by a lack of ability to empathize with others and a desire to keep the focus on themselves at all times. 1  Definition. 2  Symptoms. 3  Causes"}, {"url": "http://thenarcissisticlife.com/causes-of-narcissism/", "passage_text": "Narcissism does appear across families, perhaps through some genetic cause, but also because the narcissistic parent doesn’t bond with his or her children. This, in turn, may cause the children to become narcissists as well. Risk factors for narcissistic personality disorder may include: 1  Parental derision for fears and needs expressed during childhood. 2  Lack of parental affection and praise during childhood. 3  Severe neglect and emotional abuse in"}, {"url": "http://www.mayoclinic.org/diseases-conditions/narcissistic-personality-disorder/basics/causes/con-20025568", "passage_text": "As with other mental disorders, the cause is likely complex. Narcissistic personality disorder may be linked to: 1  Mismatches in parent-child relationships with either excessive pampering or excessive criticism. 2  Genetics or psychobiology — the connection between the brain and behavior and thinking. 3  Symptoms. 4  Risk factors. "}, {"url": "https://en.wikipedia.org/wiki/Narcissistic_personality_disorder", "passage_text": "Narcissistic personality disorder (NPD) is a personality disorder in which a person is excessively preoccupied with personal adequacy, power, prestige and vanity, mentally unable to see the destructive damage they are causing to themselves and others. It is a cluster B personality disorder. People with narcissistic personality disorder are characterized by exaggerated feelings of self-importance. They have a sense of entitlement and demonstrate grandiosity in their beliefs and behavior."}, {"url": "http://psychcentral.com/disorders/narcissistic-personality-disorder-symptoms/", "passage_text": "People with narcissistic personality disorder often display snobbish, disdainful, or patronizing attitudes. For example, an individual with this disorder may complain about a clumsy waiter’s “rudeness” or “stupidity” or conclude a medical evaluation with a condescending evaluation of the physician. Many people with narcissistic personality disorder don’t seek out treatment. People with personality disorders, in general, do not often seek out treatment until the disorder starts to significantly interfere or otherwise impact a person’s life."}, {"url": "http://psychcentral.com/disorders/narcissistic-personality-disorder-symptoms/", "passage_text": "Narcissistic Personality Disorder is characterized by a long-standing pattern of grandiosity (either in fantasy or actual behavior), an overwhelming need for admiration, and usually a complete lack of empathy toward others. Many people with narcissistic personality disorder don’t seek out treatment. People with personality disorders, in general, do not often seek out treatment until the disorder starts to significantly interfere or otherwise impact a person’s life."}, {"url": "http://www.medicalnewstoday.com/articles/9741.php", "passage_text": "Narcissistic personality disorder, also known as NPD, is a personality disorder in which the individual has a distorted self image, unstable and intense emotions, is overly preoccupied with vanity, prestige, power and personal adequacy, lacks empathy, and has an exaggerated sense of superiority. "}, {"url": "http://thenarcissisticlife.com/causes-of-narcissism/", "passage_text": "Narcissistic personality disorder is rare (1% of the general population). It affects more males than females. NPD often begins in early adulthood. Although many adolescents may seem to have traits of narcissism, this is normal for that developmental stage and doesn’t mean they’ll go on to develop NPD. Risk factors for narcissistic personality disorder may include: 1  Parental derision for fears and needs expressed during childhood. 2  Lack of parental affection and praise during childhood. 3  Severe neglect and emotional abuse in"}, {"url": "http://psychcentral.com/disorders/narcissistic-personality-disorder-symptoms/", "passage_text": "In laypeople terms, someone with this disorder may be described simply as a “narcissist” or as someone with “narcissism.” Both of these terms generally refer to someone with narcissistic personality disorder. Many people with narcissistic personality disorder don’t seek out treatment. People with personality disorders, in general, do not often seek out treatment until the disorder starts to significantly interfere or otherwise impact a person’s life."}, {"url": "http://www.webmd.com/mental-health/narcissistic-personality-disorder", "passage_text": "They don’t just have extra self-confidence, they don’t value others’ feelings or ideas and ignore others’ needs. But there’s a difference between being self-absorbed, often called a narcissist, and having narcissistic personality disorder, which is a mental illness. Recommended Related to Mental Health. "}]