[{"url": "http://community.sephora.com/t5/Customer-Support/Clarisonic-not-holding-its-charge/qaq-p/94135", "passage_text": "I thought that my Clarisonic Plus was not holding a charge or charging correctly also. This is the beginning of its third year of use, and I had not had any problems until now. Recently I have had to charge it every day. Sometimes it worked and sometimes it didn't."}, {"url": "http://www.clarisonic.ca/en/customer_service/cs-faq.html", "passage_text": "ANSWER. Charge your Clarisonic Sonic Cleansing Brush for 24 hours before your first use. Prior to using your Clarisonic Sonic Cleansing Brush, remove eye makeup by hand. Wet your face and brush head with warm water and apply cleanser (either to your face or the brush head directly, whichever you prefer)."}, {"url": "http://www.youtube.com/watch?v=AeztwrWBu6k", "passage_text": "00825 Clairsonic Mia 2 Opening and Battery Crack-Here's a video I made of how I opened up the Clairsonic Mia 2. It was tricky, and required use of a good, sharp and strong utility knife. The Mia is a hard plastic device, and needs a strong blade to cut through it. It does take a while, though."}, {"url": "http://community.sephora.com/t5/Customer-Support/Clarisonic-not-holding-its-charge/qaq-p/94135", "passage_text": "My Clarisonic Mia isn't holding its charge for as long anymore. I use to only have to charge it about once every two or three weeks, now it is every week."}, {"url": "http://www.clarisonic.ca/en/customer_service/cs-faq.html", "passage_text": "When used at the normal speed, the Clarisonic Mia® and Clarisonic Mia 2® models have an average battery life of 24 uses. Clarisonic PLUS has a battery life of about 28 uses when used at the normal speed. All of our cleansing brushes feature low-battery warnings. See your User Guide for more information."}, {"url": "http://www.clarisonic.com.sg/frequent-questions.html", "passage_text": "When used at the normal speed, the Clarisonic Mia and Clarisonic Mia 2 models have an average battery life of 24 uses. Clarisonic Aria, Clarisonic PLUS, and Clarisonic PRO have a battery life of about 28 uses when used at the normal speed. All of our cleansing brushes feature low-battery warnings."}]