[{"url": "http://blog.meadenmoore.com/blog/accounting-for-loan-origination-fees", "passage_text": "The agreement requires a loan origination fee of $20,000 which is paid by the Company to the lender at the date of the line of credit closing. The line of credit agreement is valid for 5 years."}, {"url": "http://financial-dictionary.thefreedictionary.com/origination+fee", "passage_text": "An origination fee is an amount, usually calculated as a percentage of a mortgage loan or home equity loan, which a lender charges for processing your application."}, {"url": "http://www.investopedia.com/terms/o/origination-fee.asp", "passage_text": "BREAKING DOWN 'Origination Fee'. An origination fee is similar to any commission-based payment. If a lender takes a 1% fee for originating a loan, they will make $1,000 on a $100,000 loan, or $2,000 on a $200,000 loan. It is likely that the fee rate would be negotiated lower for bigger loans in order to obtain the valuable business. RELATED TERMS."}, {"url": "http://www.consumerfinance.gov/askcfpb/155/what-are-origination-services-what-is-an-origination-fee.html", "passage_text": "An origination fee is what the lender charges the borrower for making the mortgage loan. Origination services include taking and processing your loan application, underwriting and funding the loan, and other administrative services. Origination fees are listed in section A of page 2 of your Loan Estimate."}, {"url": "http://www.investopedia.com/terms/o/origination-fee.asp", "passage_text": "DEFINITION of 'Origination Fee'. An up-front fee charged by a lender for processing a new loan application, used as compensation for putting the loan in place. Origination fees are quoted as a percentage of the total loan and are generally between 0.5% and 1% on mortgage loans in the United States."}, {"url": "http://www.investopedia.com/terms/o/origination-fee.asp", "passage_text": "Origination. An origination fee is similar to any commission-based payment. If a lender takes a 1% fee for originating a loan, they will make $1,000 on a $100,000 loan, or $2,000 on a $200,000 loan. It is likely that the fee rate would be negotiated lower for bigger loans in order to obtain the valuable business. RELATED TERMS."}, {"url": "http://finance.zacks.com/origination-fees-vehicle-9160.html", "passage_text": "For auto loans, origination fees are calculated as a percentage of the total loan, usually between 1 and 2 percent of the loan amount. If a lender takes a 2-percent fee for originating a loan, for example, the lenders will make $600 on a $30,000 loan. For leases, the leasing origination fee is a flat fee."}]