[{"url": "http://www.movingtoportland.net/portland-information/portland-demographics/", "passage_text": "1 Portland Population 583,766 – a gain of 10.3% from 2000 numbers. 2  Same-Sex Couples Living in Portland In Portland, same-sex couples make up two percent of households according to the 2010 census. 3  And about 60 percent of the state’s gay and lesbian couples reside in the metro area. 1 Population 1,572,771 million people live in the Portland Metro area (Multnomah Country which includes most of the City of Portland), Clackamas County (southeast), Washington County (west), and Clark Country (Vancouver area of Washington state). 2  Portland Population 583,766 – a gain of 10.3% from 2000 numbers."}, {"url": "https://en.wikipedia.org/wiki/Portland_metropolitan_area", "passage_text": "This article is about the metropolitan area in Oregon and Washington. For the metropolitan area in Maine, see Portland, Maine metropolitan area. The Portland metropolitan area or Greater Portland is a metropolitan area in the U.S. states of Oregon and Washington centered on the principal city of Portland, Oregon. The Portland–Vancouver–Hillsboro Metropolitan Statistical Area (MSA), the 23rd largest in the United States, has a population of 2,226,009 (2010 Census)."}, {"url": "http://www.beavertonoregon.gov/index.aspx?NID=90", "passage_text": "The City of Beaverton is located in the Portland, Oregon, metropolitan area. The Portland metropolitan area boasts a population of approximately 2.1 million. Beaverton is the fifth largest city in the Portland metropolitan area (after Portland, Vancouver, Gresham, and Hillsboro) and is the sixth largest city in Oregon. "}, {"url": "http://worldpopulationreview.com/us-cities/portland-population/", "passage_text": "Portland is the most populous city in Oregon and the third most populous city in the Pacific Northwest, after Seattle and Vancouver. With its many rose gardens, Portland is known as the City of Roses and it has been incorporated since 1851. Portland leads Oregon in population growth. The 2014 Portland population is estimated at 600,000 in the city proper, or more 2.36 million in the metropolitan area. At the 2010 census, Portland had a population of almost 584,000, which was estimated to have reached 587,800 by 2012. In 2014, it is believed this number has grown to about 600,000. This makes Portland the 28th most populous city in the country"}, {"url": "http://www.worldpopulationstatistics.com/oregon-population-2013/", "passage_text": "Oregon Hazelnut Industry. The United States Census Bureau estimates that the population of Oregon in 2013 is approximately 3,899,353, which is ranked the 27th largest population in the United States. This estimate shows a 1.8% increase since the last census in 2010, also conducted by the United States Census Bureau. However, even with such a small population density, more than 57% of the state’s population lives in the Portland metropolitan area. Of the population of almost 3.9 million people, there are approximately 1.7 million housing units in the state of Oregon, which is a 15.3% increase since the year 2000."}, {"url": "http://worldpopulationreview.com/states/oregon-population/", "passage_text": "This makes Oregon only the 39th most densely populated state in the country. Much of Oregon's population is concentrated in the Willamette Valley from Eugene to the south through Corvallis, Salem and Portland, the largest city. It's estimated that Oregon's population has now reached 3,933,947, up from 3.83 at the 2010 Census. Oregon currently has a growth rate of 0.89%, which ranks 22nd"}, {"url": "https://en.wikipedia.org/wiki/Portland_metropolitan_area", "passage_text": "The area's population is estimated at 2,348,247 in 2014. The Oregon portion of the metropolitan area is the state's largest urban center, while the Washington portion of the metropolitan area is the state's third largest urban center after Seattle (the Seattle Urban Area includes Tacoma and Everett) and Spokane. The Portland–Vancouver–Hillsboro Metropolitan Statistical Area (MSA), the 23rd largest in the United States, has a population of 2,226,009 (2010 Census)."}, {"url": "http://www.oregonmetro.gov/news/portland-region-grows-235-million-residents-census-estimates-newcomers-leading-way", "passage_text": "Since 2010, an estimated 116,168 people have moved to the Portland metropolitan area, more than the population of Gresham. That's a 5.2 percent growth rate from 2010 to 2014 – the 20th-fastest in the country among big cities, and fourth-fastest outside the Sun Belt. The Portland Metro UGB (in green) is only a portion of the U.S. Census Bureau's 7-county Portland metropolitan statistical area (orange). About 1.5 million of the region's estimated 2.3 million residents live within the UGB."}, {"url": "http://www.oregon-demographics.com/", "passage_text": "1 The Oregon population is 3,970,239 people according to the US Census Bureau's 2014 Population Estimates Program. 2  The Oregon median household income in the past 12 months is $51,075 in 2014 inflation-adjusted dollars according to the US Census Bureau's 2014 American Community Survey. "}]