[{"url": "http://www.ncbi.nlm.nih.gov/gene/821", "passage_text": "Summary. This gene encodes a member of the calnexin family of molecular chaperones. The encoded protein is a calcium-binding, endoplasmic reticulum (ER)-associated protein that interacts transiently with newly synthesized N-linked glycoproteins, facilitating protein folding and assembly. 1 human delta opioid receptor (hdeltaOR) exists in a ternary complex with SERCA2b and the ER molecular chaperone calnexin. 2  Env interacts with intracellular CNX and extracellular PDI via discrete, largely nonoverlapping, regions."}, {"url": "http://www.nature.com/scitable/topicpage/calreticulin-a-multifaceted-protein-14237270", "passage_text": "This domain contains a binding site with a high affinity for calcium and a lectin-like chaperone site — lectin is a protein that interacts with sugar residues. This suggests that CRT, like many proteins in the endoplasmic reticulum, participates in calcium metabolism and interactions with glycoproteins. CRT contains a cleavable signal sequence in this domain, which is found in proteins that are marked for targeting to the ER, and the presence of this signal indicates that CRT is transported into the ER following synthesis. (ii) The second domain is a central or P domain, which is rich in the amino acid proline."}, {"url": "http://www.uniprot.org/uniprot/P27797", "passage_text": "The interaction with glycans occurs through a binding site in the globular lectin domain. The zinc binding sites are localized to the N-domain. Associates with PDIA3 through the tip of the extended arm formed by the P-domain. Belongs to the calreticulin family. This lectin interacts transiently with almost all of the monoglucosylated glycoproteins that are synthesized in the ER. Interacts with the DNA-binding domain of NR3C1 and mediates its nuclear export. Involved in maternal gene expression regulation."}, {"url": "http://www.ncbi.nlm.nih.gov/gene/821", "passage_text": "1 Data show that CD1d associates in the ER with both calnexin and calreticulin and with the thiol oxidoreductase ERp57 in a manner dependent on glucose trimming of its N-linked glycans. 2  Calnexin provides long-term protection of wild-type Shaker protein from ER-associated degradation. 1 human delta opioid receptor (hdeltaOR) exists in a ternary complex with SERCA2b and the ER molecular chaperone calnexin. 2  Env interacts with intracellular CNX and extracellular PDI via discrete, largely nonoverlapping, regions."}, {"url": "http://www.nature.com/scitable/topicpage/calreticulin-a-multifaceted-protein-14237270", "passage_text": "Next, scientists compared the human calreticulin (CRT) amino acid sequence with other known sequences from different organisms using phylogenetic analyses. Their results showed that CRT is a conserved protein, suggesting that it plays an essential role in cell physiology. CRT contains a cleavable signal sequence in this domain, which is found in proteins that are marked for targeting to the ER, and the presence of this signal indicates that CRT is transported into the ER following synthesis. (ii) The second domain is a central or P domain, which is rich in the amino acid proline."}, {"url": "http://www.nejm.org/doi/full/10.1056/NEJMc1401255", "passage_text": "To the Editor: Somatic mutations in the gene encoding calreticulin (CALR) were recently described in the majority of patients with myeloproliferative neoplasms without mutations in the Janus kinase 2 gene (JAK2). In this patient, the CALR mutation was a deletion (p.L367fs*46), which was detected in two samples obtained before interferon alfa therapy and was reduced in two subsequent samples (Figure 1). Both patients reported moderate fatigue and mood changes, which resolved after discontinuation of interferon alfa."}, {"url": "http://www.nature.com/scitable/topicpage/calreticulin-a-multifaceted-protein-14237270", "passage_text": "Calreticulin (CRT) is a protein that is widely distributed in eukaryotic cells. It was first described in the endoplasmic reticulum (ER, a network of interconnected membranes within the cell cytoplasm). CRT contains a cleavable signal sequence in this domain, which is found in proteins that are marked for targeting to the ER, and the presence of this signal indicates that CRT is transported into the ER following synthesis. (ii) The second domain is a central or P domain, which is rich in the amino acid proline."}, {"url": "http://www.nature.com/scitable/topicpage/calreticulin-a-multifaceted-protein-14237270", "passage_text": "Calreticulin was discovered in skeletal muscle cells in 1974. Thomas Ostwald and David MacLennan were characterizing proteins that bind to calcium in the sarcoplasmic reticulum — a specialized type of endoplasmic reticulum found in muscle cells. CRT contains a cleavable signal sequence in this domain, which is found in proteins that are marked for targeting to the ER, and the presence of this signal indicates that CRT is transported into the ER following synthesis. (ii) The second domain is a central or P domain, which is rich in the amino acid proline."}]