[{"url": "http://www.globalhealingcenter.com/natural-health/what-is-coral-calcium/", "passage_text": "Calcium is available in many forms-calcium carbonate, calcium citrate, calcium orotate, and that just names a few. Coral calcium, a form of calcium carbonate, is exactly what the name implies. It is calcium sourced from fossilized coral sources and is the most common form of calcium on the planet. A small, invertebrate animal polyp secretes a limey substance that hardens into the coral structure. This substance is calcium carbonate. Calcium supplements have become very popular and are generally thought to be an effective way to promote healthy bone density. Indeed, calcium does have benefits but it’s important to understand there are various forms of calcium and they all behave a little differently."}, {"url": "https://www.ezorbcalcium.com/html/coralcalcium.html", "passage_text": "Coral calcium products are composed of calcium carbonate, the very same inorganic calcium compound you may find in other sources such as rocks or limestone and has become one of the largest Scams in supplement history (see below). The only calcium source found in coral reefs is calcium carbonate, the same calcium compound that is easily found in other rocks and limestone, and has been available for commercial use for decades."}, {"url": "http://senior-health.emedtv.com/coral-calcium/coral-calcium.html", "passage_text": "Coral calcium is a form of calcium used in some calcium supplements. At one time, many advertisements claimed that coral calcium was significantly better than other forms of calcium. These advertisements also made incredible claims about the benefits of coral calcium, such as the ability to cure cancer. "}, {"url": "https://en.wikipedia.org/wiki/Coral_calcium", "passage_text": "Coral calcium is composed primarily of calcium carbonate (CaCO 3), with small amounts of magnesium and other trace minerals. Calcium carbonate from coral is similar to calcium carbonate from other sources, with varying amounts of trace minerals. Coral calcium is a source of calcium, which is an essential mineral for human life. Coral has a chemical structure that is very similar to the composition of human bone and is sometimes used as material in bone grafts."}, {"url": "https://en.wikipedia.org/wiki/Coral_calcium", "passage_text": "Coral calcium is a salt of calcium derived from fossilized coral reefs (primarily from limestone and coastal deposits). It has been promoted as an alternative, but unsubstantiated, treatment or cure for a number of health conditions. Coral calcium is a source of calcium, which is an essential mineral for human life. Coral has a chemical structure that is very similar to the composition of human bone and is sometimes used as material in bone grafts."}, {"url": "https://www.ezorbcalcium.com/html/coralcalcium.html", "passage_text": "The truth is coral calcium supplements are made directly (uncut) from coral reefs. The only calcium source found in coral reefs is calcium carbonate, the same calcium compound that is easily found in other rocks and limestone, and has been available for commercial use for decades."}, {"url": "http://www.livestrong.com/article/352589-the-difference-between-calcium-coral-calcium/", "passage_text": "The first is your ability to absorb the calcium from the supplement. Studies show that calcium carbonate -- the kind in coral calcium and the most common type of calcium in non-coral supplements -- is well absorbed, notes a 2007 article published by nutritionist Deborah Straub in Nutrition in Clinical Practice.. The second concern is cost. "}]