[{"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=7000", "passage_text": "Antidiuretic hormone (ADH): A relatively small (peptide) molecule that is released by the pituitary gland at the base of the brain after being made nearby (in the hypothalamus). ADH has an antidiuretic action that prevents the production of dilute urine (and so is antidiuretic)."}, {"url": "https://www.nlm.nih.gov/medlineplus/ency/article/000511.htm", "passage_text": "Nephrogenic diabetes insipidus (NDI) occurs when the kidney tubules do not respond to a hormone in the body called antidiuretic hormone (ADH), also called vasopressin. ADH normally tells the kidneys to make the urine more concentrated. As a result of the defect, the kidneys release too much water into the urine."}, {"url": "https://www.nlm.nih.gov/medlineplus/ency/article/000377.htm", "passage_text": "The amount of water excreted in the urine is controlled by antidiuretic hormone (ADH). ADH is also called vasopressin. ADH is produced in a part of the brain called the hypothalamus. It is then stored and released from the pituitary gland. This is a small gland at the base of the brain."}, {"url": "http://www.answers.com/Q/What_is_the_role_of_ADH_in_the_urine", "passage_text": "Antidiuretic Hormone (or ADH) is responsible for secreting (controlling) the water content to urea and salts in the urine. Think of ADH as a save water signal to your kidneys. It is therefore produced in times of water shortage, but not when there is plenty of water in the blood."}, {"url": "https://labtestsonline.org/understanding/analytes/adh/tab/sample", "passage_text": "Antidiuretic hormone (ADH), also called arginine vasopressin (AVP), is a hormone that helps regulate water balance in the body by controlling the amount of water the kidneys reabsorb while they are filtering wastes out of the blood. This test measures the amount of ADH in"}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=6982", "passage_text": "ADH (antidiuretic hormone): A peptide molecule that is released by the pituitary gland at the base of the brain after being made nearby (in the hypothalamus). ADH has an antidiuretic action that prevents the production of dilute urine (and so is antidiuretic)."}, {"url": "http://www.amjmed.com/article/0002-9343(58)90377-2/pdf", "passage_text": "Dilution and Concentration of the Urine and the Action of Antidiuretic Hormone* ROBERT W. BERLINER, M.D., NORMAN G. LEVINSKY, M.D., DOUGLAS G. DAVIDSON, M.D. and MURRAY EDEN, PH.D. Bethesda, Maryland T HIS review will be concerned with the renal mechanisms involved in the formation of dilute and of concentrated urine."}, {"url": "http://www.bbc.co.uk/schools/gcsebitesize/science/add_ocr_pre_2011/homeostasis/waterbalrev3.shtml", "passage_text": "The concentration of our urine is controlled by a hormone called ADH. ADH is produced by the pituitary gland that is situated just below the brain. The pituitary gland monitors the concentration of the blood plasma. It releases ADH into the bloodstream, which travels in the blood to the kidneys."}]