[{"url": "https://uk.answers.yahoo.com/question/index?qid=20060827143129AAXM9gy", "passage_text": "Once favourable wet and warm conditions return, the endospore is triggered irreversibly to make a new bacterial cell. Vegetative cells are simply those that do not participate in reproduction, and are not generally applied to bacteria (except filamentous types) as these single celled organisms divide to reproduce. Best Answer: I think matahari has provided the perfect answer. In simpler words a vegative cell is any cell of a plant or animal that is capable of actively growing and is not reproductive."}, {"url": "http://www.austincc.edu/microbugz/endospore_stain.php", "passage_text": "The endospore stain is a differential stain used to visualize bacterial endospores. Endospores are formed by a few genera of bacteria, such as Bacillus. By forming spores, bacteria can survive in hostile conditions. Spores are resistant to heat, dessication, chemicals, and radiation. Bacteria can form endospores in approximately 6 to 8 hours after being exposed to adverse conditions. The normally-growing cell that forms the endospore is called a vegetative cell. Spores are metabolically inactive and dehydrated."}, {"url": "http://textbookofbacteriology.net/structure_10.html", "passage_text": "During endospore formation, a vegetative cell is converted to a heat-resistant spore. There are eight stages, O, I-VII, in the sporulation cycle of a Bacillus species, and the process takes about eight hours. Biologically, endospores are a fascinating type of cell. Endospores exhibit no signs of life, being described as cryptobiotic. They are highly resistant to environmental stresses such as high temperature (some endospores can be boiled for hours and retain their viability), irradiation, strong acids, disinfectants, etc."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20060827143129AAXM9gy", "passage_text": "Like a reproductive spore, an endospore will germinate and form a vegetative cell when conditions return for the growth of these cells, and generations of vegetative cells will again thrive as long as the appropriate nutrients and environmental conditions are present. Best Answer: I think matahari has provided the perfect answer. In simpler words a vegative cell is any cell of a plant or animal that is capable of actively growing and is not reproductive."}, {"url": "http://microbewiki.kenyon.edu/index.php/Bacterial_endospores", "passage_text": "Endospores are dormant, non-reproductive and enzymatically inert forms of bacterial vegetative cells [1] . Endospore-producing bacteria are more conventionally termed “sporulating bacteria”. Sporulating bacteria are derived from the [1] Firmicute phylum and mainly consist of [2] Gram positive bacteria [7] . "}, {"url": "http://www.differencebetween.com/difference-between-spore-and-vs-endospore/", "passage_text": "Endospore. Certain bacteria produce endospores. Bacillus and Clostridium are endospore producing bacteria. Process of forming a spore is known as sporulation. Spores produced inside the bacterial cell are known as endogenous spores. Spores are differentiated cells. Endospores may survive for millions of years. If the plant has two types of spores, male and female spores, it is known as heterospory. Male spores are called microspores and female spores are called megaspores. Micro spores are also called pollen grains. In flowering plants, microspores are found inside the pollen sac or the microsporangium."}, {"url": "http://www.austincc.edu/microbugz/endospore_stain.php", "passage_text": "Endospores can also be larger or smaller in diameter than the vegetative cell. Those that are larger in diameter will produce an area of swelling in the vegetative cell. These endospore characteristics are consistent within the spore-forming species and can be used to identify the organism. Spores are resistant to heat, dessication, chemicals, and radiation. Bacteria can form endospores in approximately 6 to 8 hours after being exposed to adverse conditions. The normally-growing cell that forms the endospore is called a vegetative cell. Spores are metabolically inactive and dehydrated."}, {"url": "http://www.answers.com/Q/Difference_between_endospores_and_vegetative_cell", "passage_text": "Endospores are thick-coated, resistant cells produced within a bacterial cell that has been exposed to harsh conditions. Endospores are inert and can endure extreme conditions like radiation, heat and cold, absence of nutrients and water. When conditions are good, they produce vegetative cells and thrive. When condition turn unfavorable, endospores are produced again and they remain inert. Vegetative cells are any cells of plants or animals that do not participate in reproduction. These are vulnerable to external changes and react easily"}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20060827143129AAXM9gy", "passage_text": "Endospores are a dormant form of a certain type of bacterial cell that is very resistant to desiccation, heat, and a variety of chemical and radiation treatments that are otherwise lethal to non-endospore bacterial cells. Best Answer: I think matahari has provided the perfect answer. In simpler words a vegative cell is any cell of a plant or animal that is capable of actively growing and is not reproductive."}]