[{"url": "http://www.youtube.com/watch?v=yH2d75Bgenw", "passage_text": "Biga is a type of pre-fermentation used in Italian baking. Many popular Italian breads, including ciabatta, are made using a biga. Using a biga adds complexity to the bread's flavor and is often used in breads that need a light, open texture with holes."}, {"url": "http://artisanbreadbaking.com/bread/biga/", "passage_text": "This is a recipe for biga, an Italian pre-ferment, analogous to a poolish in French bread baking. As you read this biga recipe, you will note that a biga is made dryer than a poolish, and activates more slowly. I prefer to use a biga when I want to carry a pre-ferment for a long time or when I’m making Italian bread. In usage, the two are equivalent; try them both and see which you prefer."}, {"url": "https://en.wikipedia.org/wiki/Biga_(bread_baking)", "passage_text": "Biga is a type of pre-fermentation used in Italian baking. Many popular Italian breads, including ciabatta, are made using a biga. Using a biga adds complexity to the bread's flavor and is often used in breads that need a light, open texture with holes. Apart from adding to flavor and texture, a biga also helps to preserve bread by making it less perishable."}, {"url": "http://www.bigapizzeria.net/about/", "passage_text": "Biga, family owned and operated, opened in 2011 as a gathering place for families and friends, a place to meet and relax, enjoy one another’s company while experiencing authentic wood fired pizza."}, {"url": "http://www.wisegeek.com/what-is-biga.htm", "passage_text": "10 hilariously insightful foreign words. Biga is a type of starter used to make traditional Italian breads. In Italy, the term is used to refer to sourdough sponges, collectives of wild yeast, and other starters."}, {"url": "http://leitesculinaria.com/79243/recipes-biga.html", "passage_text": "1 3. Transfer the biga to a lightly oiled bowl, cover with plastic wrap, and let rise at cool room temperature for 6 to 24 hours, until the starter is triple its original volume but is still wet and sticky."}, {"url": "http://leitesculinaria.com/79243/recipes-biga.html", "passage_text": "The starter, known as biga in Italy, or bighino when in small amounts, not only gives strength to what in Italy are weak flours, it also produces a secondary fermentation from which come the wonderful aroma, natural flavor, and special porosity of the final loaves and wheels of bread."}]