[{"url": "http://www.indiana.edu/~geol105b/images/gaia_chapter_6/unconformities.htm", "passage_text": "Nonconformities are unconformities that separate igneous or metamorphic rocks from overlying sedimentary rocks. They usually indicate that a long period of erosion occurred prior to deposition of the sediments (several km of erosion necessary). They are a feature of stratified rocks, and are therefore usually found in sediments (but may also occur in stratified volcanics). They are surfaces between two rock bodies that constitute a substantial break (hiatus) in the geologic record (sometimes people say inaccurately that time is missing)."}, {"url": "http://www.epgeology.com/sedimentology-f19/difference-between-disconformity-and-unconformity-t65.html", "passage_text": "Basically both indicate a break in deposition, either by nondeposition or erosion. An unconformity describes this phenomena (break in the rock record: hiatus). There are several types of unconformities and of course each has a specific name (eg. nonconformity, disconformity, angular unconformity). A disconformity discribes an unconformity at which the same general layering is present above and below the disconformity."}, {"url": "http://www.answers.com/Q/What_are_the_three_basic_types_of_unconformities", "passage_text": "The different types of unconformities include  disconformity, nonconformity, angular unconformity, paraconformity,  buttress unconformity, blended unconformity, and biconformity. 1 person found this useful. "}, {"url": "https://en.wikipedia.org/wiki/Unconformity", "passage_text": "A disconformity is an unconformity between parallel layers of sedimentary rocks which represents a period of erosion or non-deposition. Disconformities are marked by features of subaerial erosion. This type of erosion can leave channels and paleosols in the rock record. A blended unconformity is a type of disconformity or nonconformity with no distinct separation plane or contact, sometimes consisting of soils, paleosols, or beds of pebbles derived from the underlying rock."}, {"url": "https://en.wikipedia.org/wiki/Unconformity", "passage_text": "An unconformity is a buried erosional or non-depositional surface separating two rock masses or strata of different ages, indicating that sediment deposition was not continuous. A blended unconformity is a type of disconformity or nonconformity with no distinct separation plane or contact, sometimes consisting of soils, paleosols, or beds of pebbles derived from the underlying rock."}, {"url": "http://www.uno.edu/cos/departments/ees/ees-docs/ClassResources/Lab3_Sequence_of_Events.pdf", "passage_text": "There are three main types of unconformities: 1. Disconformity-The erosional surface separates rock beds which are parallel, but there is a significant lapse of time between the two sets of beds. 2. Angular unconformity-The erosional surface separates rock beds which are at an angle to each other. Use the fundamental concepts (p. 12), the terms used to describe geologic events (below and correctly identify any unconformities using diagrams on the next page. Use the block diagram below as a tool for success. Notice that the rock layers are numbered from oldest (1) to youngest (3) and geologic events are lettered."}, {"url": "http://www.indiana.edu/~geol105b/images/gaia_chapter_6/unconformities.htm", "passage_text": "Unconformities are gaps in the geologic record that may indicate episodes of crustal deformation, erosion, and sea level variations. They are a feature of stratified rocks, and are therefore usually found in sediments (but may also occur in stratified volcanics). They are surfaces between two rock bodies that constitute a substantial break (hiatus) in the geologic record (sometimes people say inaccurately that time is missing)."}, {"url": "https://answers.yahoo.com/question/index?qid=1006020914063", "passage_text": "There are three types of unconformities: disconformity, nonconformity, and angular unconformity. Disconformity An unconformity between parallel layers of sedimentary rocks which represents a period of erosion or non-deposition. Best Answer: An unconformity is a gap in time in rock layers, where erosion occurs while deposition slows or stops. The rocks above an unconformity are younger than the rocks beneath (unless the sequence has been overturned)."}, {"url": "http://study.com/academy/lesson/unconformities-in-geology-definition-types-quiz.html", "passage_text": "Types of Unconformities. The type of unconformity (in other words, what we call it) is based upon what rock types are involved; whether it is the result of erosion or no deposition; and whether older sedimentary rock layers were tilted prior to being eroded. Definition. An unconformity is the contact between sedimentary rocks that are significantly different in age, or between sedimentary rocks and older, eroded igneous or metamorphic rocks. Unconformities represent gaps in the geologic record; periods of time that are not represented by any rocks"}]