[{"url": "https://osha.gov/about.html", "passage_text": "Organization. OSHA is part of the United States Department of Labor. The administrator for OSHA is the Assistant Secretary of Labor for Occupational Safety and Health. OSHA's administrator answers to the Secretary of Labor, who is a member of the cabinet of the President of the United States. 1  OSHA Organizational Chart."}, {"url": "https://en.wikipedia.org/wiki/Occupational_Safety_and_Health_Act", "passage_text": "The Act created the Occupational Safety and Health Administration (OSHA), an agency of the Department of Labor. OSHA was given the authority both to set and enforce workplace health and safety standards."}, {"url": "http://www.ehow.com/about_6328372_osha-created_.html", "passage_text": "Save. Crane image by Vanessa van Rensburg from Fotolia.com. The Occupational Safety and Health Administration (OSHA) is a subdivision of the U.S. Department of Labor. OSHA develops standards to protect the rights of workers, and to reduce the risk of injury or death in the workplace."}, {"url": "http://searchcompliance.techtarget.com/definition/Occupational-Safety-and-Health-Administration-OSHA", "passage_text": "Created in response to the Occupational Safety and Health Act of 1970, OSHA’s main goal is to protect the rights and safety of workers by preventing workplace injuries and deaths and holding employers accountable for safe workplaces."}, {"url": "http://www.bls.gov/iif/oshhist.htm", "passage_text": "As a result of this legislation, the Occupational Safety and Health Administration (OSHA) was created under the assistant secretary of labor for occupational safety and health to enforce the regulations established by the 1970 act."}, {"url": "http://www.answers.com/Q/When_was_the_Occupational_Safety_and_Health_Administration_formed", "passage_text": "The Occupational Safety and Health Act of 1970 is the US legislation that created OSHA (the Occupational Safety and Health Administration), NIOSH (the National Institute for Occupational Safety and Health), and the Occupational Safety and Health Review Commission."}]