[{"url": "https://uk.answers.yahoo.com/question/index?qid=20070123143018AAJVXbb", "passage_text": "Report Abuse. Its a few days without water, as it depends on exertion and location. A person in the UK will lose 2.5 litres in a normal day. Food can normally be done without for about 2/3 weeks, depending on the current level of nourishment/body fat. "}, {"url": "http://www.livescience.com/32320-how-long-can-a-person-survive-without-water.html", "passage_text": "You can live 3 minutes without air, though we don't recommend trying. In a harsh environment — it's snowing, say — you have 3 hours to survive without shelter. After 3 days, you need water or you'll perish. You can make it 3 weeks without food, though we promise you that won't be fun. Despite this possibly helpful rule, some people have survived 8 to 10 days without water."}, {"url": "http://www.businessinsider.com/how-many-days-can-you-survive-without-water-2014-5", "passage_text": "We can't live on air and sunshine alone. The human body needs food and water to survive. A human can go for more than three weeks without food (Mahatma Gandhi survived 21 days of complete starvation), but water is a different story. At least 60% of the adult body is made of it and every living cell in the body needs it to keep functioning"}, {"url": "http://www.livestrong.com/article/523013-how-many-days-can-you-survive-without-food/", "passage_text": "People can survive for long periods of time without food. However, going days without eating can cause nutrient deficiencies and unpleasant -- even dangerous -- side effects. The number of days you can survive without food varies based on your size, activity level and the amount of stored body fat you possess. "}, {"url": "http://www.answers.com/Q/How_long_can_the_human_body_go_without_eating", "passage_text": "The human body can go for an extended period of time without food (but not without water), especially if you have some body fat. People have gone for two weeks or more. Note that is not safe, and it is not an effective method of dieting. There's a thing called the rule of three. Three minutes without air, three days without water and/or three weeks without food. That's an approximation for how long it takes fo … r your body to shut down."}, {"url": "http://www.cbc.ca/news/canada/how-long-can-we-survive-without-food-or-water-1.1000898", "passage_text": "(Reuters). In general terms, the human body can go two to three days without water and, it is often said in survival guides, 30 to 40 days without food of any kind. (Many of these guides also discourage people from scavenging for wild plants or shrubs because of the adverse effects these can have.). "}, {"url": "http://www.ehow.com/about_5040218_long-body-survive-food-water.html", "passage_text": "Shares & Saves. Save. The human body cannot survive without food and water for long periods of time. In fact, according to SurvivalTopics.com, the longest a person can go without water is 10 days--without food, it's four to six weeks. However, due to certain other variables, these numbers can vary. "}, {"url": "http://www.bbc.co.uk/news/magazine-17095605", "passage_text": "Experts believe it is possible for the human body to survive without food for up to two months. It's not the first example of humans subsisting on next to nothing for long periods of time. "}, {"url": "http://www.scientificamerican.com/article/how-long-can-a-person-sur/", "passage_text": "The duration of survival without food is greatly influenced by factors such as body weight, genetic variation, other health considerations and, most importantly, the presence or absence of dehydration. For total starvation in healthy individuals receiving adequate hydration, reliable data on survival are hard to obtain. "}, {"url": "http://adventure.howstuffworks.com/survival/wilderness/live-without-food-and-water1.htm", "passage_text": "The question of how long you can go without food depends on a lot of factors. Will and determination definitely play a part. Political prisoners on hunger strikes and fasting religious leaders have been known to go for weeks at a time without any food. Gandhi fasted for 21 days while in his 70s. People lost in the wild have also survived for long periods of time without eating."}]