[{"url": "http://bandsglass.co.uk/laminated-glass-stairs-and-floors/", "passage_text": "All our laminated glass meets the British Standards and is designed to stay in one peice if broken. It is used mainly for security, overhead applications, stair treads and floor panels.Floor glass is usually a minimum of 30mm thick up to 50mm thick dependent on size,location,point and udl loadings. We laminate in house using a cold pour resin system."}, {"url": "http://www.stairplan.com/vision-glass-balustrade.html", "passage_text": "Glass Balustrade Panels Dial in your sizes and order online. Example using the Glass Planner. Below you can see an screen shot showing the online glass planner-enter your glass appeture dimensions, example-Length up the rake of the staircase of 3600mm between the newel posts."}, {"url": "http://www.ontariocustomglass.com/frameless-and-framed-railing-systems", "passage_text": "The glass panels are easily inserted into the metal frames with glass clips or channels. The glass is fabricated using tempered or laminated safety glass with a thickness of ½” (12mm) to 2” (19mm). Local building codes require tempered glass railing systems for new construction or renovations."}, {"url": "http://www.ontariocustomglass.com/frameless-and-framed-railing-systems", "passage_text": "If you want to minimize the amount of metal used in your project, a frameless railing system is your better choice. The glass panels are made of tempered or laminated safety glass, in thicknesses ranging from 3/8” (10mm) to ½” (12 mm). They can be fabricated in clear, lightly sandblasted or textured panels to complement your office or home decor. décor"}, {"url": "http://www.stairplan.com/vision-glass-balustrade.html", "passage_text": "If your looking for a new staircase with Glass balustrade or just the Glass balustrade panels to transform your existing staircase then we can help."}, {"url": "https://www.pearstairs.co.uk/glass-staircase/", "passage_text": "The glass panels have to be slipped into position at the same time as all components of the staircase are placed in situ. Your glass panels will be slightly beveled for safety: Pear Stairs glass staircases are built with a gap between the glass and newel, handrail or top of string of 20mm all around."}, {"url": "http://bandsglass.co.uk/laminated-glass-stairs-and-floors/", "passage_text": "We supply laminated flat glass in the following thicknesses: 4.4mm,6.4,8.8mm,10.8mm,11.5mm but we manufacture special thick glass panels for floors and stair treads : We also supply bent laminated glass in the following thicknesses. 7.5mm,9.5mm,11.5mm,13.5mm."}]