[{"url": "https://answers.yahoo.com/question/index?qid=20090818095647AAPOnZh", "passage_text": "Total time is approximately 7-12 months. About 2-3 months into the process you will receive permission to work, which also entitles you to a green card, drivers license and ss#. When you get your green card it is good for 2 yrs. It is called a conditional green card (the condition is you married a US citizen) After 2 yrs you can apply to have the conditions removed. This next green card is unconditional and is good for 10 yrs. After you have had your green card a total of 2 yrs 9 months you can apply to become a US citizen. Also you do NOT have to reapply for a work visa each year. That information is just wrong, wrong, wrong! Your green card gives you permission to live AND work in the US."}, {"url": "http://www.wikihow.com/Get-a-Green-Card", "passage_text": "1 Many obtain a green card as the immediate relative of a US citizen. 2  If you're a US citizen's spouse, unmarried child under the age of 21, or parent of a US citizen over the age of 21, your relative may be able to file Form I-130, Petition for Alien Relative."}, {"url": "http://www.buzzle.com/articles/how-long-does-it-take-to-get-a-green-card.html", "passage_text": "If you are in the United States, you can apply for the Green Card with the USCIS. If not, you will have to apply for the same in the Embassy or Consulate in your country of residence. The same will take anywhere between 9 to 12 months. Overall, the investment-based Green Card will take around 15 to 18 months. The document that you will get at the end of this period will be a conditional Green Card. In order to remove these conditions, you will have to file the I-829 petition, but only after 2 years."}, {"url": "http://www.uc.edu/international/services/permanent_residence/marriage_to_citizen/faq.html", "passage_text": "If you marry a permanent resident and are not able to file for green card yet, you can only work if you have a valid non-immigrant visa which allows you to work. Once I've filed the application with USCIS how long does it take? It varies at different USCIS offices and can take up to 12 - 18 months to process."}]