[{"url": "http://www.livestrong.com/article/339082-define-lean-muscle/", "passage_text": "In the context of bodybuilding, lean muscle mass is that which is gained without a corresponding addition of fat or that which remains after fat is shed. It can also be thought of as the amount of muscle on the body independent of fat, bone and other parts. Lean Muscle Mass. Lean muscle is a concept related to lean body mass, which is the content of the body minus fat. Lean body mass is used to calculate basal metabolic rate. Lean muscle is less of a scientific term and more a term of art that refers to muscle that is independent of, and not obscured by, fat"}, {"url": "http://fitness.stackexchange.com/questions/6738/whats-lean-muscle-mass", "passage_text": "Lean mass is thus the pure muscle mass without the fat. Men have more lean mass than women, because their body composition and physiology has more muscles, particularly in the upper body. Thus it makes the muscle's percentage higher than the one in women. To calculate your lean mass you need first to measure your body fat percentage. You can do this using machines (some are not very accurate) or using a caliper. The caliper is the fastest and cheapest tool you can have"}, {"url": "https://answers.yahoo.com/question/index?qid=20080326162550AALKYb8", "passage_text": "Report Abuse. That means that it can help you increase the amount of muscle you have on your body. If you lose 5 pounds of fat and gain 5 pounds of muscle, you will stay the same weight. If you lose 5 cubic inches of fat and gain 5 cubic inches of muscle, you will be a little heavier. For your goal, it is best not to worry about what the scale says. Kevin g · 8 years ago. Thumbs up"}, {"url": "http://www.aworkoutroutine.com/lean-bulky-toned-muscle/", "passage_text": "Since muscle is muscle (meaning there is no such thing as lean muscle, bulky muscle or toned muscle… it’s all the same exact muscle), that means you can take every single thing you’ve heard or will ever hear about building specific types of muscle and ignore it completely. "}, {"url": "https://en.wikipedia.org/wiki/Lean_muscle", "passage_text": "Muscle is a soft tissue found in most animals. Muscle cells contain protein filaments of actin and myosin that slide past one another, producing a contraction that changes both the length and the shape of the cell. Muscles function to produce force and motion. "}, {"url": "http://www.bodybuilding.com/fun/nutrition-101-eat-to-build-lean-muscle.html", "passage_text": "11 Spinach. A good source of glutamine, the amino acid that is important for lean muscle growth. In addition to glutamine, spinach can increase muscle strength and endurance. Spinach is a good source of glutamine, the amino acid that is important for lean muscle growth. "}, {"url": "http://www.wisegeekhealth.com/what-is-lean-muscle.htm", "passage_text": "Fat body mass includes all of the body’s fatty tissue, while lean body mass includes everything else, such as the bones, organs, and muscles. Therefore, the term lean muscle refers to the fact that muscle is part of lean body mass. These two components are usually measured in a ratio, or by percentage. Body fat percentage, the amount of the body composed of fat mass, is becoming an increasingly popular way to measure fitness levels. "}, {"url": "http://www.builtlean.com/2011/08/24/lean-body-mass-definition-formula/", "passage_text": "Simply put, lean body mass is comprised of everything in your body besides body fat. Your lean body mass includes: …and anything else in our bodies that has mass and is not fat. As an aside, for the average adult male about 42% of body weight is skeletal muscle and it’s about 35% for females. Lean body mass is also your set point to determine how much fat you should lose and what your body fat percentage will be if you lose a certain amount of fat. You can check out the Ideal Body Weight Formula, which takes into account your lean body mass to arrive at your ideal weight."}, {"url": "http://www.livestrong.com/article/339082-define-lean-muscle/", "passage_text": "Muscle mass is the main goal of weightlifting and bodybuilding. Muscles not only provide strength and power, but can be a visible manifestation of health and an essential part of a well-toned physique when not obscured by a layer of fat. Lean Muscle Mass. Lean muscle is a concept related to lean body mass, which is the content of the body minus fat. Lean body mass is used to calculate basal metabolic rate. Lean muscle is less of a scientific term and more a term of art that refers to muscle that is independent of, and not obscured by,"}]