[{"url": "http://www.youtube.com/watch?v=3FMlL_BkfHg", "passage_text": "Please Subscribe our goal is 5000 subscriber for this year :). is a means of distributing alternating-current electrical power. Polyphase systems have three or more energized electrical conductors carrying alternating currents with a definite time offset between the voltage waves in each conductor. Polyphase systems are particularly useful for transmitting power to electric motors. The most common example is the three-phase power system used for industrial applications and for power transmission. Source: https://en.wikipedia.org/wiki/Polypha... "}, {"url": "http://www.slideshare.net/spicepark/the-polyphase-induction-motor", "passage_text": "1 1. Experiment No. 4 The Polyphase Induction MotorThe polyphase induction motor is the most commonly used industrial motor, findingapplication in many situations where speed regulation is not essential. 1 2. one slot to the next, thereby reducing harmonics in the torque characteristic andimproving the operation. ( 2 a) (b) Fig. 3  1. Physical construction of the squirrel-cage induction motor: (a) cross section showing stator and rotor, (b) rotor construction.1."}, {"url": "https://en.wikipedia.org/wiki/Polyphase_system", "passage_text": "Polyphase systems are particularly useful for transmitting power to electric motors. The most common example is the three-phase power system used for industrial applications and for power transmission. A polyphase system must provide a defined direction of phase rotation, so mirror image voltages do not count towards the phase order. A 3-wire system with two phase conductors 180 degrees apart is still only single phase. Such systems are sometimes described as split-phase"}, {"url": "http://www.allaboutcircuits.com/worksheets/polyphase-power-systems/", "passage_text": "In polyphase systems, there are multiple voltages phase-shifted apart from each other so as to be intentionally “out of step.”. Notes: Although the rationale for polyphase electrical power may not be apparent from either the question or the given answer, your students need to be aware of its existence. Polyphase AC voltages are usually created by special alternators, with different “phase” windings spaced around the circumference of the stator. Notes: An illustration of polyphase alternator construction would be excellent to aid understanding of this concept."}, {"url": "https://en.wikipedia.org/wiki/Induction_motor", "passage_text": "An induction or asynchronous motor is an AC electric motor in which the electric current in the rotor needed to produce torque is obtained by electromagnetic induction from the magnetic field of the stator winding. Whereas a synchronous motor's rotor turns at the same rate as the stator field, an induction motor's rotor rotates at a slower speed than the stator field. The induction motor stator's magnetic field is therefore changing or rotating relative to the rotor."}, {"url": "http://www.thefreedictionary.com/Polyphase", "passage_text": "polyphase. adj. 1. (Electrical Engineering) Also: multiphase (of an electrical system, circuit, or device) having, generating, or using two or more alternating voltages of the same frequency, the phases of which are cyclically displaced by fractions of a period. See also single-phase, two-phase, three-phase"}, {"url": "http://educypedia.karadimov.info/library/motorfunds.pdf", "passage_text": "There are several types ofpolyphase motors. The most common type of motor in thisgroup is the squirrel-cage polyphase induction motor socalled because the rotor is constructed like a squirrel-cage(Fig. 7). The squirrel-cage motor is the simplest tomanufacture and the easiest to maintain. – 2 –This bulletin provides basic information on the nature anddesign of polyphase electric motors. The information issimply presented so extensive engineering or electricalknowledge is not necessary for a good understanding. It isdivided into four sections:BASIC MOTOR PRINCIPLES...................."}, {"url": "https://en.wikipedia.org/wiki/Polyphase_system", "passage_text": "One voltage cycle of a three-phase system. A polyphase system is a means of distributing alternating-current electrical power. Polyphase systems have three or more energized electrical conductors carrying alternating currents with a definite time offset between the voltage waves in each conductor. A polyphase system must provide a defined direction of phase rotation, so mirror image voltages do not count towards the phase order. A 3-wire system with two phase conductors 180 degrees apart is still only single phase. Such systems are sometimes described as split-phase"}, {"url": "http://www.electrical4u.com/induction-motor-types-of-induction-motor/", "passage_text": "One of the most common electrical motor used in most applications which is known as induction motor. This motor is also called as asynchronous motor because it runs at a speed less than synchronous speed. In this, we need to define what is synchronous speed. Under Induction Motor. "}]