[{"url": "http://findfunfacts.appspot.com/animals_plants/algae.html", "passage_text": "The fungi includes such diverse organisms as mushrooms, molds, puffballs, toadstools, yeast, and Penicillium and are economically important. At one time fungi were grouped with plants. Later biologists realized that the organisms in the fungi were different from plants in many ways and were placed in their own kingdom. Algae is a term used for aquatic organisms that photosynthesize like land plants yet are structurally less complex and lack vascular tissue (xylem and phloem) found in most plants. Plants that lack these specialized vessels for water transport are called bryophytes (see Plant Kingdom)"}, {"url": "http://www.vegetablegardener.com/item/4148/give-your-garden-a-seaweed-boost", "passage_text": "The sea water that provides seaweed with nutrients also carries bacteria, viruses, and fungi. As a defense against these organisms, it is thought that seaweed synthesizes an arsenal of chemical compounds, and these in turn can be used by garden plants. "}, {"url": "http://www.majordifferences.com/2013/02/difference-between-algae-and-fungi.html", "passage_text": "Algae a re a group of lower photosynthetic aquatic plants. The body of algae is called thallus. It may be unicellular or multicellular. Generally the algae are classified into three groups based on the presence of photosynthetic and accessory pigments. They are brown, red and green algae. Algae possess the green colouring matter known as chlorophyll. Fungi never possess chlorophyll. Algae are autotrophs i e., they can prepare their own food from simple inorganic materials with the help of chlorophyll and photosynthesis. Fungi are heterotrophs i e., hey can not prepare their own food."}, {"url": "http://www.differencebetween.info/difference-between-algae-and-fungi", "passage_text": "Edible forms of algae include seaweeds. Fungi are a group of unicellular or multinucleate organisms that live and grow on decomposed matter. They are also a member of the Eukaryota domain, while belong to the Fungi kingdom. Seaweed and fresh water moss are types of algae. Algae and Fungi are most commonly associated with moss and mushrooms. In layman terms, the green slimy things that are found in lakes and in unclean aquariums are known as Algea, while Fungi are the fuzzy things that are found on spoilt food, or"}, {"url": "http://web.mit.edu/12.000/www/m2006/final/characterization/biotic_algae.htm", "passage_text": "Project Amazonia: Characterization-Biotic-Algae/Fungi. Algae. Algae are unicellular or multi-cellular phototrophic microorganisms that need light to flourish and live in aquatic environments. They can exist as single cells, filaments, colonies and multi-cellular forms. "}, {"url": "https://answers.yahoo.com/question/index?qid=20081207203140AABN3F8", "passage_text": "Other types can be used for medicinal reasons penicillin is a type of fungus. Not all fungi is good though, and certain types cause diseases and infections in humans (e.g. ringworm and athlete's foot) and plants.\\ Algae (singular Alga') are organisms which are like plants. They are not the same though as they so not have roots, stems and leaves. Fungi are not plants or animals, although they survive and grow by getting nutrients from decaying plants and animals. Unlike plants, fungi do not photosynthesise (how plants get energy from sunlight and grow as a result)."}, {"url": "http://www.differencebetween.info/difference-between-algae-and-fungi", "passage_text": "Algae. Fungi. Definition. Algae a very large and diverse group of simple autotrophic organisms. A fungus is a member of a large group of eukaryotic organisms that includes microorganisms such as yeasts and molds (British English: moulds), as well as the more familiar mushrooms. Seaweed and fresh water moss are types of algae. Algae and Fungi are most commonly associated with moss and mushrooms. In layman terms, the green slimy things that are found in lakes and in unclean aquariums are known as Algea, while Fungi are the fuzzy things that are found on spoilt food, o"}, {"url": "http://www.differencebetween.net/science/difference-between-algae-and-fungi/", "passage_text": "For fungi, these are the mushrooms that you can readily see at the forest or even at your own backyard. Well, this is probably the simplest visual difference between the two. Foremost, fungi is the plural form for fungus. There are many types of such like molds, yeasts and the most popular ‘“ mushrooms. Fungi are able to decompose organic matter a lot faster."}, {"url": "http://www.answers.com/Q/Is_seaweed_a_fungus_or_a_plant", "passage_text": "Seaweeds are not plants. They are protists. They differ from plants in that they lack vascular tissues (xylem and phloem), they have holdfasts instead of roots, and their cell … s do not have all of the plant characteristics. "}]