[{"url": "http://www.factzoo.com/fish/sailfish-fastest-swimming-animal.html", "passage_text": "Some estimate 60 mph (96 kph) or faster. It also has a strong backbone and a sturdy crescent-shaped tail to complete the sprinting swimmer's body. Close behind the sailfish in the top speed racers of fish are other open-water hunters. Those would be the swordfish, marlin, wahoo, yellowfin tuna and bluefin tuna. One of the secrets of the sailfish's speed, along with that of these other fast predators, lies in its musculature. It has huge amounts of white muscle, great for acceleration but not stamina. This is then boosted along the flanks by blocks of red muscle which need more oxygen but are good for sustained fast swimming."}, {"url": "http://www.factzoo.com/fish/sailfish-fastest-swimming-animal.html", "passage_text": "Sailfish-The Fastest Swimming Animal. It is very difficult to measure how fast a particular fish can swim, we can only rely on rough estimates. However, the sailfish is undoubtedly fast. It's predatory behavior and its body structure demonstrate its capacity for speed. One of the secrets of the sailfish's speed, along with that of these other fast predators, lies in its musculature. It has huge amounts of white muscle, great for acceleration but not stamina. This is then boosted along the flanks by blocks of red muscle which need more oxygen but are good for sustained fast swimming."}, {"url": "https://en.wikipedia.org/wiki/Sailfish", "passage_text": "For other uses, see Sailfish (disambiguation) . Sailfish are a genus Istiophorus of billfish living in warmer sections of all the oceans of the world. They are predominantly blue to gray in colour and have a characteristic erectile dorsal fin known as a sail, which often stretches the entire length of the back. Sailfish are highly prized game fish, and are known for their incredible jumps and great speed. They can swim 100 m in 4.8 sec. They can appear in a startling array of colours, from subdued browns and grays to vibrant purples and even silver."}, {"url": "https://en.wikipedia.org/wiki/Sailfish", "passage_text": "Sailfish grow quickly, reaching 1.2–1.5 m (3 ft 11 in–4 ft 11 in) in length in a single year, and feed on the surface or at middle depths on smaller pelagic forage fish and squid. Sailfish are highly prized game fish, and are known for their incredible jumps and great speed. They can swim 100 m in 4.8 sec. They can appear in a startling array of colours, from subdued browns and grays to vibrant purples and even silver."}, {"url": "http://www.answers.com/Q/How_fast_can_a_sailfish_swim", "passage_text": "How fast is a sailfish? The sailfish is practically the fastest animal in the sea, with a top speed of about 110 kph (68 mph), although the best speed of most is probably 45 to 55 mph. Sources vary as to how fast a platypus swims. They have been recorded as swimming and diving at a rate of about 12 metres (40 feet) per minute. The Australian Museum (see … Australian Museum weblink below) states that the platypus can swim at a rate of 1 metre per second in fast-moving waters, dropping to 0.4 metres per second when hunting for food"}, {"url": "http://www.extremescience.com/sailfish.htm", "passage_text": "Fastest in the Sea: Sailfish Istiophorus platypterus. Mysterious Speed Demons. Sailfish photo courtesy of www.robinhughes.net. The sailfish is related to other billed fish, such as Marlin and Swordfish, which are all very fast. But the sailfish has them all beat by clocking in at speeds up to 68mph. Sailfish live in both the Pacific and Atlantic Oceans in warm waters."}, {"url": "http://marinelife.about.com/od/fish/tp/Fastest-Fish.htm", "passage_text": "• Sailfish. Many sources list sailfish as the fastest fish in the ocean. These fish are definitely fast leapers, and are likely one of the fastest fish at swimming short distances. This site describes speed trials in which a sailfish was clocked at a speed of 68 mph while leaping. Sailfish can grow to about 10 feet long. These slim fish can weigh up to about 128 pounds. Their most noticeable characteristics are their large first dorsal fin (which resembles a sail) and their upper jaw, which is long and spear-like. Sailfish have blue-gray backs and white undersides."}, {"url": "https://en.wikipedia.org/wiki/Sailfish", "passage_text": "Individuals have been clocked at speeds up to 110 km/h (68 mph), which is one of the highest speeds reliably reported in any water organism. Generally, sailfish do not grow to more than 3 m (9.8 ft) in length and rarely weigh over 90 kg (200 lb). Sailfish are highly prized game fish, and are known for their incredible jumps and great speed. They can swim 100 m in 4.8 sec. They can appear in a startling array of colours, from subdued browns and grays to vibrant purples and even silver."}]