[{"url": "http://www.retinaandmacula.com/retina/tractional_retinal_detachment_bonita_springs.htm", "passage_text": "Tractional retinal detachment’s are a different category of retinal detachment associated with fibrotic tissue pulling up on the retina. Tractional retinal detachment’s are often related to severe diabetes in the eye. "}, {"url": "http://www.webmd.com/eye-health/tc/types-of-retinal-detachment-topic-overview", "passage_text": "Rhegmatogenous retinal detachment is the most common type of detachment. It is caused by holes or breaks in the retina called retinal tears. A retinal tear allows fluid from the middle of the eye to pass through the tear and settle under the retina. The detachment does not involve tears in the retina or traction from the vitreous. Exudative retinal detachment is most often a complication of other diseases or conditions. These can include severe macular degeneration, eye tumors, inflammation in the choroid or the retina, or severe high blood pressure."}, {"url": "http://www.healthline.com/health/retinal-detachment", "passage_text": "The retina works with the cornea, lens, and other parts of the eye and the brain to produce normal vision. Retinal detachment occurs when the retina separates from the back of the eye. This causes loss of vision that can be partial or total, depending on how much of the retina is detached. Retinal detachment is a medical emergency. "}, {"url": "http://webeye.ophth.uiowa.edu/eyeforum/tutorials/retinal-detachment-med-students/", "passage_text": "Tractional. Tractional retinal detachment occurs when vitreous membranes pull on the retina separating it from the RPE. No tears or holes are present in this type of retinal detachment. Vitreous membranes are usually gliotic, fibrous, vascular, or a combination. "}, {"url": "https://nei.nih.gov/health/retinaldetach/retinaldetach", "passage_text": "These types of retinal detachments are the most common. Tractional —In this type of detachment, scar tissue on the retina’s surface contracts and causes the retina to separate from the RPE. This type of detachment is less common. Exudative —Frequently caused by retinal diseases, including inflammatory disorders and injury/trauma to the eye. When the retina detaches, it is lifted or pulled from its normal position. If not promptly treated, retinal detachment can cause permanent vision loss. In some cases there may be small areas of the retina that are torn."}, {"url": "http://retinavitreous.com/diseases/dm_trd.php", "passage_text": "Diabetic tractional retinal detachment is the most advanced form of diabetic retinal disease. Tractional means that there is pulling on the retinal surface and retinal detachment means that the pulling is strong enough to separate the light-sensing retina from the back of the eye. The traction in diabetic eye disease comes from extensive growth of abnormal blood vessels in proliferative diabetic retinopathy."}, {"url": "https://en.wikipedia.org/wiki/Retinal_detachment", "passage_text": "Retinal detachment is a disorder of the eye in which the retina peels away from its underlying layer of support tissue. Initial detachment may be localized or broad, but without rapid treatment the entire retina may detach, leading to vision loss and blindness. It is almost always classified as a medical emergency. Permanent damage may occur if the detachment is not repaired within 24–72 hours."}, {"url": "http://www.aafp.org/afp/2004/0401/p1691.html", "passage_text": "Retinal detachment often is a preventable cause of vision loss. There are three types of retinal detachments: exudative, tractional, and rhegmatogenous. The most common type is rhegmatogenous, which results from retinal breaks caused by vitreoretinal traction. Risk factors for retinal detachment include advancing age, previous cataract surgery, myopia, and trauma. The second type of detachment, tractional retinal detachment, occurs via centripetal mechanical forces on the retina, usually mediated by fibrotic tissue resulting from previous hemorrhage, injury, surgery, infection, or inflammation."}, {"url": "https://nei.nih.gov/health/retinaldetach/retinaldetach", "passage_text": "The retina is the light-sensitive layer of tissue that lines the inside of the eye and sends visual messages through the optic nerve to the brain. When the retina detaches, it is lifted or pulled from its normal position. If not promptly treated, retinal detachment can cause permanent vision loss. In some cases there may be small areas of the retina that are torn."}, {"url": "https://nei.nih.gov/health/retinaldetach/", "passage_text": "These types of retinal detachments are the most common. Tractional —In this type of detachment, scar tissue on the retina’s surface contracts and causes the retina to separate from the RPE. This type of detachment is less common. Listen. The retina is the light-sensitive layer of tissue that lines the inside of the eye and sends visual messages through the optic nerve to the brain. When the retina detaches, it is lifted or pulled from its normal position. If not promptly treated, retinal detachment can cause permanent vision loss."}]