[{"url": "http://www.diffen.com/difference/Democrat_vs_Republican", "passage_text": "Diffen › Politics › U.S. Politics. This comparison examines the differences between the policies and political positions of the Democratic and Republican parties on major issues such as taxes, the role of government, entitlements (Social Security, Medicare), gun control, immigration, healthcare, abortion and gay rights. Abraham Lincoln belonged to the Republican Party, so the roots of the party are in individual freedom and the abolition of slavery. Indeed, 82% of the Republicans in the U.S. Senate voted in favor of the Civil Rights Act of 1964 while only 69% of Democrats did."}, {"url": "http://www.studymode.com/subjects/differences-and-similarities-between-democratic-republican-and-federalist-party-page1.html", "passage_text": "Difference Between the Republicans and the Democrats. Running head: DIFFERENCES BETWEEN THE TWO MAIN POLITICAL PARTIES IN THE US 1 Differences Between the Two Main Political Parties in the US Yanyan Niu Stevens-Henager College Author Note Yanyan Niu, Master of Nursing Administration, Stevens-Henager... "}, {"url": "http://ivn.us/2012/11/06/100-ways-republicans-are-just-like-democrats/", "passage_text": "There is a widely-held perception that the Democratic Party and the Republican Party are drastically different in their policy, proposals, philosophy of government, and general modus operandi. While there are certainly some significant differences between the two parties, the number of similarities are astounding. A few months ago on IVN, Wes Messamore explored the similarities between the two major party candidates, Barack Obama and Mitt Romney. Republicans and Democrats agree that the government needs more money. 98. This Gallup poll suggests that many Americans — 46 percent of those polled — believe that a third party is needed because the Republican and Democratic parties are not doing an adequate job of representing the people. 99."}, {"url": "http://amtrem.blogspot.com/2012/05/similarities-between-republicans-and.html", "passage_text": "Similarities Between Republicans and Democrats. Although it’s a politician’s goal to make you see the difference from one party to another, there are some things they can’t get around. They do disagree and have different solutions to most things but they find common grounds when it comes to some broader topics. One of the greatest similarities Republicans and Democrats have in common is their belief that our country is not currently in a good position."}, {"url": "http://economix.blogs.nytimes.com/2012/08/27/what-do-democrats-and-republicans-agree-on/", "passage_text": "In the next two weeks, during the Republican and Democratic conventions, we’ll hear a lot about the differences between the parties. How great we are. How terrible the other guy is. How we’re better on Medicare, on Social Security, on foreign policy, on defense, on education, on taxes. "}, {"url": "http://www.studymode.com/subjects/democrats-and-republicans-similarities-page1.html", "passage_text": "Democratic vs. Republic. parties are the Democratic and the Republican Party. These two parties are both looked differently upon by different selections of people. “Political Party affiliation is a quick way to find out the basic ideas and philosophy for each candidate, both Republicans and Democrats. The donkey is a symbol for the Democratic Party, and the elephant represents the Republican Party. Although both mascots are mammals that one can find in the circus, the similarities of these parties end there and creates a different type of circus in Washington DC. Both parties are... really stand for"}, {"url": "http://www.latimes.com/opinion/op-ed/la-oe-sherman-polarization-20140925-story.html", "passage_text": "David Sherman and Leaf Van Boven. Personality, psychology play roles in ideological differences between liberals and conservatives, data show. One idea gaining currency among psychologists and political scientists is that Democrats and Republicans are politically polarized because they are fundamentally different. Americans are certainly polarized. According to a recent Pew Research Center poll, 36% of Republicans and 27% of Democrats see the opposing party as a threat to the nation's well-being."}, {"url": "http://www.diffen.com/difference/Democrat_vs_Republican", "passage_text": "Role of Government. One of the fundamental differences between Democratic and Republican party ideals is around the role of government. Republicans favor a small government — both in terms of the number of people employed by the government and in terms of the roles and responsibilities of government in society. Abraham Lincoln belonged to the Republican Party, so the roots of the party are in individual freedom and the abolition of slavery. Indeed, 82% of the Republicans in the U.S. Senate voted in favor of the Civil Rights Act of 1964 while only 69% of Democrats did."}]