[{"url": "http://www.ebay.com/gds/Net-Curtain-Buying-Guide-/10000000177320563/g.html", "passage_text": "Write a guide. Translucent curtains made of thin mesh fabric, or net, are called net curtains or sheer curtains. Believed to have originated in England, they have been in use since the 1700s and were first made of cotton, wool, or silk lace. Since the advent of synthetic fabrics, most net curtains are made of polyester. Net curtains are made of translucent or sheer fabrics. They have the advantage of allowing diffused natural light into a room during the day while offering privacy at the same time. Different forms of net curtains have been in use since the eighteenth century, but most of them today are made from polyester."}, {"url": "http://www.woodyattcurtains.com/net-curtains-and-voiles-c2/net-curtains-c3/jessica-white-lace-curtains-p4", "passage_text": "We will then make a curtain for each half of your window so you will have a pair. Fabric Width -. For example, I need 8 mtrs (800cm) fabric width for my curtain. If you would like to do this simply enter the value as window width and then at the gather option below, change the gather to 1. You will then receive the same amount of fabric as the window width. 1 Cost from £2.99 per square metre. 2  Measuring Tip: if you already have net curtains: we recommend you measure from the window sill to the top of the rod/wire and then add on 1cm. 3  So for example if it measures 115cm from your window sill to the top of the wire, we recommend you enter: Window Height 116cm."}, {"url": "http://www.livingstonetextiles.com/what-we-do/net-curtains/", "passage_text": "Dallas Cafe Net Curtain. This is one of the two cafe café nets we have in. Stock these are shorter curtains designed to cover only the lower part of your. Window the top of the cafe café nets is finished with holes for the pole or wire to pass through instead of a channel like the. standard nets Odessa is the only net curtain we currently stock in a cream colourway. This heavily patterned lace design gives good privacy. Currently only available in 48″ length. Available drops and prices per metre : 48″/122cm – £3.90. Now also available in white in length 54″/137cm at a cost of £4.30 per metre."}, {"url": "http://www.netcurtainsdirect.com/voiles.html", "passage_text": "Voile (pronounced 'voy-all') is a closely woven fabric which gives a sleek and smooth finish. Some designs are shiny and others have more natural, cotton like appearance. Unlike Net Curtains, patterns are embroidered on the fabric surface and often in contrasting colours. Please ask for samples to appreciate the fantastic quality available-available via our free next day sample service."}, {"url": "http://www.dunelm.com/info/curtain-material", "passage_text": "Curtain Fabric & Material. Shop all curtains. In recent years we have seen an increase in the number of people creating their very own window dressings, from curtains to roman blinds, there’s no denying the fact that the urge to get crafty and creative is in high fashion. By purchasing curtain fabric and designing the window dressings yourself you will also be offered a wider choice of material and designs as you don’t have to just settle for the fabric available in the readymade curtain collection."}, {"url": "http://www.dunelm.com/category/home-and-furniture/curtains-and-blinds/curtains/voile-and-net-curtains", "passage_text": "Net curtains are a fantastically practical addition to your living space. The thin, semi-transparent material helps to maintain privacy in your home whist still allowing sunlight to stream through your windowpanes and illuminate the room. Net curtains are sometimes known as voile curtains or voile panels, and are characterised by the sheer net like material that are commonly used as a window dressing, functioning as a privacy veil during the daytime."}, {"url": "http://www.ebay.com/gds/Net-Curtain-Buying-Guide-/10000000177320563/g.html", "passage_text": "They are typically used in combination with regular curtains. Before buying a net curtain, it is useful to know the different kinds of net curtains available based on the type of fabric and design. To make sure the net curtains fit, it is important to take accurate measurements of the windows. Net curtains are made of translucent or sheer fabrics. They have the advantage of allowing diffused natural light into a room during the day while offering privacy at the same time. Different forms of net curtains have been in use since the eighteenth century, but most of them today are made from polyester."}, {"url": "https://en.wikipedia.org/wiki/Ballistic_nylon", "passage_text": "Ballistic nylon is a thick, tough, synthetic nylon fabric used for a variety of applications. Ballistic nylon was originally developed by the DuPont corporation as a material for flak jackets to be worn by World War II airmen. Modern applications of ballistic nylon include luggage, cave packs, tool belts, police duty belts, watchstraps, motorcycle jackets, knife sheaths, and skin-on-frame kayaks. The original specification for ballistic nylon was an 18 ounce nylon fabric made from 1050 denier high tenacity nylon yarn in a 2x2 basketweave. Today the term is often used to refer to any nylon fabric that is made with a ballistic weave, typically a 2x2 or 2x3 basketweave. It can be woven from nylon yarns of various denier such as 840 denier and 1680 denier. Denier refers to the weight, not the strength, of the fabric"}]