[{"url": "http://www.answers.com/Q/How_long_would_it_take_to_get_to_Neptune_by_rocket_from_Earth", "passage_text": "it depends on the speed at which you are traveling. At the speed of 100,000 km/hour, you would reach Neptune in 5.12 years. so it ''could'' take about 2 years if you travel at a greater speed. It could also take 12 years if you travel at a slower speed. 12 years to travel to Neptune not 5.12 or 130 days. it took voyager 2 twelve years to travel to Neptune. But, he did stop at other planets along the way. By travelling at 40,000km/ph you would get there in 12 years."}, {"url": "http://www.answers.com/Q/How_long_would_it_take_to_get_to_Neptune_by_rocket_from_Earth", "passage_text": "It would depend on the path chosen and on where Neptune and Earth were in their orbits.   Voyager 2 spacecraft was launched on Aug 20, 1977 and it reached Neptune on … Aug 24, 1989. So, Voyager 2 took about twelve years to reach Neptune."}, {"url": "http://coolcosmos.ipac.caltech.edu/ask/143-How-long-does-it-take-to-get-to-Neptune-from-Earth", "passage_text": "How long it would take to get to Neptune from Earth would depend on the path chosen and on where Neptune and Earth were in their orbits when the mission was launched. For example, the Voyager 2 spacecraft was launched on Aug 20, 1977 and it reached Neptune on Aug 24, 1989."}, {"url": "https://answers.yahoo.com/question/index?qid=20081204161856AAxqWFw", "passage_text": "Now, if we use Neptune's shortest distance from the sun, 4,452,940,833 km, it would take 154000 hours, or 17 years to reach Neptune. However nuclear fusion, such as the Orion project, it can theoretically reach speeds of 8-10% the speed of light."}, {"url": "https://au.answers.yahoo.com/question/index?qid=20090313160151AAfZLHv", "passage_text": "Best Answer: The minimum distance from Earth to Neptune is 4.3 billion km or 2.68 billion miles. I think the first answerer made a calculation error. With the speed of sound being 1230 kilometers per hour (343 m/s), I get 33.88 years to Neptune at the speed of sound."}]