[{"url": "http://www.webmd.com/digestive-disorders/diverticulitis-diet", "passage_text": "Foods to Avoid With Diverticulitis. In the past, doctors had recommended that people with diverticular disease (diverticulosis or diverticulitis) avoid hard-to-digest foods such as nuts, corn, popcorn, and seeds, for fear that these foods would get stuck in the diverticula and lead to inflammation."}, {"url": "https://www.healthtap.com/topics/a-list-of-foods-to-avoid-eating-with-diverticulitis", "passage_text": "Diverticular Disease: Diverticular disease can be less frequent or severe by avoiding foods such as corn, popcorn, nuts and seeds. These items can get lodged in the pockets in your colon (diverticula) and cause inflammation which could lead to diverticulitis. ...Read more."}, {"url": "http://www.lifescript.com/health/centers/ulcerative_colitis/s.aspx?query=diverticulitis+foods+to+avoid", "passage_text": "Are There Diverticulosis Foods To Avoid Eating ... snack foods made from whole grains Eating a healthy diet that includes calcium-rich foods does not ... Contact Us; Privacy Policy; Spam Policy; Advertise; Team. Health Channels: Health; Top Conditions; Food; Diet ..."}, {"url": "http://www.healthline.com/health/diverticulitis-diet-list-of-foods-to-avoid", "passage_text": "This, in turn, reduces the pressure in your digestive system. Fiber-rich foods include: 1  beans, such as navy beans and kidney beans. 2  whole grains, such as brown rice, quinoa, and bulgur. 3  fruits. 4  vegetables and vegetable juices. 5  potatoes. 6  hot cereals, such as oatmeal and amaranth."}, {"url": "http://www.healthline.com/health/diverticulitis-diet-list-of-foods-to-avoid", "passage_text": "Softer stool passes through your intestines and colon more quickly and easily. This, in turn, reduces the pressure in your digestive system. Fiber-rich foods include: 1  beans, such as navy beans and kidney beans. 2  whole grains, such as brown rice, quinoa, and bulgur. 3  fruits. 4  vegetables and vegetable juices. 5  potatoes. 6  hot cereals, such as oatmeal and amaranth."}, {"url": "http://www.webmd.boots.com/healthy-eating/guide/diverticulitis-diet", "passage_text": "Foods to avoid with diverticulitis. In the past, doctors had recommended that people with diverticular disease (diverticulosis or diverticulitis) avoid hard-to-digest foods such as nuts, corn, popcorn or seeds, because of the risk that these foods may get stuck in the diverticula and lead to inflammation."}, {"url": "http://www.livestrong.com/article/285210-a-list-of-foods-to-avoid-eating-with-diverticulitis/", "passage_text": "Foods containing nuts, seeds and tough skins can irritate the intestinal tract and may cause a flare up of diverticulitis. Avoid foods such as nuts, sesame seeds, corn, popcorn and most raw fruits and vegetable skins and membranes. Baked potatoes are acceptable if the skin is removed."}]