[{"url": "http://www.chemeurope.com/en/encyclopedia/Caesium_fluoride.html", "passage_text": "Caesium fluoride reacts usually as a source of fluoride ion, F - . It therefore undergoes all of the usual reactions associated with soluble fluorides such as potassium fluoride, for example: Caesium fluoride is a useful base in organic chemistry, due the fact that fluoride ion is largely unreactive as a nucleophile. It is reported that CsF gives higher yields in Knoevenagel condensation reactions than KF or NaF."}, {"url": "https://en.wikipedia.org/wiki/Caesium_chloride", "passage_text": "Caesium chloride or cesium chloride, is the inorganic compound with the formula Cs Cl. This colorless solid is an important source of caesium ions in a variety of applications. Its crystal structure forms a major structural type where each caesium ion is coordinated by 8 chlorine ions. "}, {"url": "https://www.americanelements.com/cesium-fluoride-13400-13-0", "passage_text": "Cesium Fluoride is a water insoluble Cesium source for use in oxygen-sensitive applications, such as metal production. Cesium Fluoride is generally immediately available in most volumes. Ultra high purity and high purity compositions improve both optical quality and usefulness as scientific standards. Nanoscale elemental powders and suspensions, as alternative high surface area forms, may be considered."}, {"url": "http://www.espimetals.com/index.php/msds/494-cesium-fluoride", "passage_text": "To the best of our knowledge the chemical, physical and toxicological properties of cesium fluoride have not been thoroughly investigated and reported. Cesium compounds may cause hyper-irritability, including spasms, dizziness, abdominal cramps, vomiting, diarrhea, convulsions and collapse. Fluorides may cause salivation, nausea, vomiting, diarrhea and abdominal pain, followed by weakness, tremors, shallow respiration, convulsions and coma. May cause brain and kidney damage. Chronic fluoride poisoning can cause severe bone changes, loss of weight, anorexia, anemia and dental defects."}, {"url": "http://www.chemeurope.com/en/encyclopedia/Caesium_fluoride.html", "passage_text": "Caesium fluoride (cesium fluoride in North America), is an ionic compound usually found as a hygroscopic white solid. It is more soluble and more readily dissociated than sodium fluoride or potassium fluoride. Caesium fluoride is a useful base in organic chemistry, due the fact that fluoride ion is largely unreactive as a nucleophile. It is reported that CsF gives higher yields in Knoevenagel condensation reactions than KF or NaF."}, {"url": "http://www.webelements.com/compounds/caesium/caesium_fluoride.html", "passage_text": "Synthesis. One way to make caesium fluoride is to react the hydroxide with hydrofluoric acid. The resulting salt can then be purified by recrystallization. CsOH(aq) + HF(aq) → CsF(aq) + H 2 O(l). Another way to make caesium(I) fluoride is to react the carbonate with CsHF 2. The resulting salt can then be purified by recrystallization. The oxidation number of caesium in caesium fluoride is 1. 1  Formula: CsF. 2  Hill system formula: Cs 1 F 1. 3  CAS registry number: [13400-13-0]. 4  Formula weight: 151.904. 5  Class: fluoride. 6  Colour: white. 7  Appearance: crystalline solid. 8  Melting point: 703°C. 9  Boiling point: 1231°C. 10  Density: 4640 kg m -3."}, {"url": "https://en.wikipedia.org/wiki/Caesium_fluoride", "passage_text": "Caesium fluoride or cesium fluoride is an inorganic compound usually encountered as a hygroscopic white solid. It is used in organic synthesis as a source of the fluoride anion. Caesium has the lowest electronegativity of all non-radioactive elements and fluorine has the highest electronegativity of all elements. Caesium fluoride can be prepared by the reaction of caesium hydroxide (CsOH) with hydrofluoric acid (HF). The resulting salt can then be purified by recrystallization."}, {"url": "http://www.chemeurope.com/en/encyclopedia/Caesium_fluoride.html", "passage_text": "Caesium fluoride is also a popular source of fluoride in organofluorine chemistry. For example, CsF reacts with hexafluoroacetone to form a caesium perfluoroalkoxide salt which is stable up to 60 °C, unlike the corresponding sodium or potassium salt. Single crystals of the salt are transparent into the deep infrared. Caesium fluoride is a useful base in organic chemistry, due the fact that fluoride ion is largely unreactive as a nucleophile. It is reported that CsF gives higher yields in Knoevenagel condensation reactions than KF or NaF."}, {"url": "https://en.wikipedia.org/wiki/Caesium_fluoride", "passage_text": "Caesium fluoride is also a popular source of fluoride in organofluorine chemistry. For example, CsF reacts with hexafluoroacetone to form a caesium perfluoroalkoxide salt, which is stable up to 60 °C, unlike the corresponding sodium or potassium salt. Caesium fluoride can be prepared by the reaction of caesium hydroxide (CsOH) with hydrofluoric acid (HF). The resulting salt can then be purified by recrystallization."}]