[{"url": "http://home.costhelper.com/partition-wall.html", "passage_text": "1 Do-it-yourself supplies for building a partition wall can run $150-$500 or more for an 8-foot high L-shaped wall about 18-20 feet long, depending on local lumber prices and the materials used, such as drywall or beadboard. 2  The higher cost range may include a simple prehung door. 1 Hiring someone to build an L-shaped partition wall 8 feet high and 18-20 feet long could run $400-$1,500 or more for labor and materials depending on the complexity of the project, local labor rates and the quality of materials used."}, {"url": "http://home.costhelper.com/retaining-wall.html", "passage_text": "1 Materials and installation for a stone retaining wall start around $25-$40 a square face foot and go up depending on materials, site conditions, and other factors. 2  It costs $1,250-$2,000 or more for a wall 30 inches high and 20 feet long. 1 Hiring an engineer to help design a retaining wall can run about $200-$500 or more, depending on the complexity and extent of the project. 2  Hiring an engineer is strongly recommended for walls over 3 feet high."}, {"url": "http://www.costowl.com/home-improvement/landscaping-retaining-wall-cost.html", "passage_text": "Concrete Retaining Wall Prices. Concrete retaining wall prices start around $30 per square foot including materials and installation and can go as high as $45 to $50 per square foot depending on how much prep work is involved in building the forms. Walls higher than four feet typically require a different type of form which will raise the cost. "}, {"url": "http://home.costhelper.com/retaining-wall.html", "passage_text": "1 Material and labor for a wood retaining wall runs approximately $20-$25 a square face foot (and there's usually a minimum charge for small projects), which would be about $1,000-$1,300 for a 50-square-face-foot wall. 1 Hiring an engineer to help design a retaining wall can run about $200-$500 or more, depending on the complexity and extent of the project. 2  Hiring an engineer is strongly recommended for walls over 3 feet high."}, {"url": "http://www.fixr.com/costs/retaining-wall-building", "passage_text": "1 Costs will vary widely. 2  The Wall-for a cast in place (concrete) retaining wall with a vertical face, installed on no more than a 33 degree slope with a level embankment, at 6' high (including excavation and backfill) the cost will be $12,800. 1 When the wall is increased to 8' in height the cost will average at $13,700, and when the height is bumped up to 10' the cost increases to $19,900. 2  Estimates and quotes-like many other major construction projects it is advisable to seek out estimates from a range of providers"}, {"url": "http://www.concretenetwork.com/concrete/poured_concrete_retaining_walls/cost.html", "passage_text": "Retaining Wall Cost. Poured retaining walls with elaborate curves require complex formwork and will drive up cost for a wall. The total cost to have a concrete retaining wall installed will be a combination of material and labor prices. For a basic wall you can expect to pay between $30 and $40 per square foot. If you add a decorative finish, curves, steps, lighting or other upgrades, the cost will rise. For Ralston, $39 per square foot is the average cost he charges for a wall under 4 feet tall. For walls below 4 feet, he says his prices are often competitive with finished block. A block wall has to be stuccoed or finished with veneer, while a concrete wall does not need an added finish."}, {"url": "http://home.costhelper.com/retaining-wall.html", "passage_text": "1 Do-it-yourself materials cost about $10-$15 a square face foot. 2  ThisOldHouse.com provides a video showing how to build a block wall, calling the project challenging and estimating it will take two people 8-10 hours for a low wall 10-16 feet long. 1 Hiring an engineer to help design a retaining wall can run about $200-$500 or more, depending on the complexity and extent of the project. 2  Hiring an engineer is strongly recommended for walls over 3 feet high."}, {"url": "http://www.fixr.com/costs/retaining-wall-building", "passage_text": "1 The Wall-for a cast in place (concrete) retaining wall with a vertical face, installed on no more than a 33 degree slope with a level embankment, at 6' high (including excavation and backfill) the cost will be $12,800. 1 When the wall is increased to 8' in height the cost will average at $13,700, and when the height is bumped up to 10' the cost increases to $19,900. 2  Estimates and quotes-like many other major construction projects it is advisable to seek out estimates from a range of providers"}]