[{"url": "https://en.wikipedia.org/wiki/Prehistoric_art", "passage_text": "From the Upper Palaeolithic through the Mesolithic, cave paintings and portable art such as figurines and beads predominated, with decorative figured workings also seen on some utilitarian objects. In the Neolithic evidence of early pottery appeared, as did sculpture and the construction of megaliths. Famous for their rock art, the caves are located in a rural area on the outskirts of Hargeisa. They contain some of the earliest known cave paintings in the Horn of Africa, many of which depict pastoral scenes. Laas Geel's rock art is estimated to date back to somewhere between 9,000 – 8,000 and 3,000 BCE."}, {"url": "https://en.wikipedia.org/wiki/Prehistoric_art", "passage_text": "The earliest undisputed African rock art dates back about 10,000 years. The first naturalistic paintings of humans found in Africa date back about 8,000 years apparently originating in the Nile River valley, spread as far west as Mali about 10,000 years ago. Famous for their rock art, the caves are located in a rural area on the outskirts of Hargeisa. They contain some of the earliest known cave paintings in the Horn of Africa, many of which depict pastoral scenes. Laas Geel's rock art is estimated to date back to somewhere between 9,000 – 8,000 and 3,000 BCE."}, {"url": "http://famousartcentral.weebly.com/first-forms-of-art.html", "passage_text": "First Forms of Art. The first type of art was cave painting.The earliest known paintings were found in the El Castillo cave in Spain! One faint red dot is said to be more than 40,000 years old! A red ochre painting was discovered at Arnhem Land plateau in Australia. It Showed 2 emu like birds(Picture 1). "}, {"url": "http://www.visual-arts-cork.com/earliest-art.htm", "passage_text": "The first recorded examples of Asian art are the Bhimbetka Petroglyphs (consisting of 10 cupules and an engraving or groove) discovered during the 1990s in a quartzite rock shelter (Auditorium cave) at Bhimbetka in central India. This rock art dates from at least 290,000 BCE. For more information about this period, please see: Aurignacian Art (40,000-25,000 BCE). Cave art: the earliest known example of parietal art is the El Castillo cave painting of a red-ochre dot/disk, dating to at least 39,000 BCE. Next comes two prehistoric abstract signs (claviforms) found among the Altamira cave paintings in Cantabria (c.34,000 BCE)"}, {"url": "https://en.wikipedia.org/wiki/Prehistoric_art", "passage_text": "Early rock art also first appeared in the Neolithic. The advent of metalworking in the Bronze Age brought additional media available for use in making art, an increase in stylistic diversity, and the creation of objects that did not have any obvious function other than art. Famous for their rock art, the caves are located in a rural area on the outskirts of Hargeisa. They contain some of the earliest known cave paintings in the Horn of Africa, many of which depict pastoral scenes. Laas Geel's rock art is estimated to date back to somewhere between 9,000 – 8,000 and 3,000 BCE."}, {"url": "https://en.wikipedia.org/wiki/History_of_painting", "passage_text": "In the late 1970s and early 1980s, there was also a return to painting that occurred almost simultaneously in Italy, Germany, France and Britain. These movements were called Transavantguardia, Neue Wilde, Figuration Libre, Neo-expressionism, the school of London, and in the late 1980s the Stuckists respectively. Early Filipino painting can be found in red slip (clay mixed with water) designs embellished on the ritual pottery of the Philippines such as the acclaimed Manunggul Jar. Evidence of Philippine pottery-making dated as early as 6000 BC has been found in Sanga-sanga Cave, Sulu and Laurente Cave, Cagayan."}, {"url": "http://www.answers.com/Q/When_was_the_first_form_of_art", "passage_text": "The earliest known Western paintings were executed deep within caves of southern Europe during the Paleolithic period, some 15,000 to 20,000 years ago. The early development of painting continued in the Mediterranean littoral. A. "}, {"url": "http://www.visual-arts-cork.com/earliest-art.htm", "passage_text": "Later Stone Age artists (from 100,000 to roughly 40,000 BCE) would have been types of Homo sapiens like Neanderthals (Homo neanderthalensis) - see, for instance, Gorham's Cave Art-while the first prehistoric sculptors and cave painters were forms of anatomically modern man. For more information about this period, please see: Aurignacian Art (40,000-25,000 BCE). Cave art: the earliest known example of parietal art is the El Castillo cave painting of a red-ochre dot/disk, dating to at least 39,000 BCE. Next comes two prehistoric abstract signs (claviforms) found among the Altamira cave paintings in Cantabria (c.34,000 BCE)"}, {"url": "https://en.wikipedia.org/wiki/History_of_painting", "passage_text": "Tanjore painting is an important form of classical South Indian painting native to the town of Tanjore in Tamil Nadu. The art form dates back to the early 9th century, a period dominated by the Chola rulers, who encouraged art and literature. Early Filipino painting can be found in red slip (clay mixed with water) designs embellished on the ritual pottery of the Philippines such as the acclaimed Manunggul Jar. Evidence of Philippine pottery-making dated as early as 6000 BC has been found in Sanga-sanga Cave, Sulu and Laurente Cave, Cagayan."}]