[{"url": "https://www.sharecare.com/health/eye-conditions/what-mean-nearsighted-farsighted", "passage_text": "Significantly nearsighted people of any age can read without glasses, but vision of distant objects is blurred without glasses. Farsighted people first need glasses to read and then, as they age, also need glasses for clear distance vision. "}, {"url": "http://www.healthline.com/health/farsightedness", "passage_text": "Farsightedness means that it’s easy for you to see things that are far away, but your close-up vision is blurry. The technical term for farsightedness is hyperopia. People can have varying degrees of farsightedness, depending on their eyes’ ability to focus on close-up objects. "}, {"url": "http://www.myspectrumoptometry.com/eyes_MyopHypPres.php", "passage_text": "The term nearsighted means that you can see objects that are near to you more clearly than distant objects. The more myopic you are, the more blurred distant objects appear, the higher your prescription in diopters,and the thicker your glasses. Hyperopia. Hyperopia is the medical term for farsightedness.. "}, {"url": "http://www.webmd.com/eye-health/tc/farsightedness-hyperopia-topic-overview", "passage_text": "People who are farsighted see things at a distance more easily than they see things up close. If you are very farsighted, close objects may be so blurry that you can't do tasks such as reading or sewing. A farsighted eye sees things differently than an eye that is not farsighted. Farsightedness (hyperopia) is usually a variation from normal, not a disease. Farsightedness occurs when light entering the eye is focused behind the retina instead of directly on it. This is caused by an eye that is too short, whose cornea is not curved enough, or whose lens sits farther back in the eye than normal. Farsightedness often runs in families."}, {"url": "http://www.flei.com/blog/difference-between-near-and-farsighted/", "passage_text": "Farsighted is simply the opposite. Farsightedness or hypermetropia or hyperopia is a defect of vision in which closer objects appear to be blurred. It occurs because the eyeball is too short, the lens has incorrect curvature or the cornea is flat. Both are refractive conditions, meaning that they are problems related to how the light is focused as it enters the eye. Ideally, as light enters the eye, without any additional effort, the light would be perfectly focused onto the inside lining of the eye which detects the light, called the retina."}, {"url": "http://www.eyeglassguide.com/my-eyes/common-conditions/farsighted.aspx", "passage_text": "Farsighted (also called hyperopia) is a term to describe an eye condition that lets you clearly see objects far or distant in your field of vision, while objects that are near appear blurry or hazy. Due to the nature of this type of vision problem, farsightedness can affect vision in different ways. Farsightedness happens in eyes that are incorrectly focusing images behind the retina rather than directly on it. The retina is the light-sensitive tissue at the back of the human eye responsible for processing images. Farsightedness develops when the eyeball becomes shorter than it should be, moving the focal point of the images we see from on top of the retina, to behind the retina. Abnormalities in the eye’s lens or cornea can also cause farsighted vision."}, {"url": "http://www.rebuildyourvision.com/blog/vision-conditions/the-difference-between-farsightedness-and-nearsightedness/", "passage_text": "While farsightedness makes it difficult to see objects that are close-up, nearsightedness makes it difficult to see objects from a distance. Farsightedness is caused by an imperfection in the eye and is usually genetic. Nearsightedness can be caused by any number of factors and has many different degrees of severity. "}, {"url": "http://www.mayoclinic.org/diseases-conditions/farsightedness/basics/definition/CON-20027486", "passage_text": "Definition. Farsightedness (hyperopia) is a common vision condition in which you can see distant objects clearly, but objects nearby may be blurry. The degree of your farsightedness influences your focusing ability. People with severe farsightedness may see clearly only objects a great distance away, while those with mild farsightedness may be able to clearly see objects that are closer. Farsightedness usually is present at birth and tends to run in families. You can easily correct this condition with eyeglasses or contact lenses."}, {"url": "https://www.sharecare.com/health/eye-conditions/what-nearsighted-farsighted-astigmatism-mean", "passage_text": "This lens causes light to diverge slightly before it reaching the eye. When farsightedness (called hyperopia) is present, a person is able to see far away objects well but has difficulty seeing close up objects. Light rays become focused behind the retina. Possible causes include eyeballs that are too short or by lens systems that have too little focusing power. "}]