[{"url": "http://www.answers.com/Q/What_is_a_poetic_device", "passage_text": "Split and merge into it. Answer by Tttt12345. Confidence votes 1.0K. A poetic device is a language feature such as a simile, metaphor, pun etc. poetic devices or often called poetic methods can be a number of things used in a poem. Examples of poetic devices are. language, imagery, assonance, alliteration, metaphor, similie and there are many more. "}, {"url": "http://www.ereadingworksheets.com/figurative-language/poetic-devices/", "passage_text": "Poetic Devices. Poetic devices are literary techniques not exclusively limited to poetry. Poetic devices are used by good writers in all professions, from novelists, to journalists, to advertisers. This is because poetic devices are pleasing to hear. The use of poetic devices is separate from the study of poetic devices. For example, someone can have an advanced perception of what words sound good next to each other without knowing the technical terms applied to these techniques (perhaps you can think of a musician to whom this description might apply)."}, {"url": "http://storytrail.com/poetry/poeticdevices.htm", "passage_text": "The following poetic devices can be used in both poetry and prose compositions. The examples given are from personal mask poems composed by Ms. Roderick's ceramics students at Sabino High School (2002-2003). Read through the terms and examples. Then answer the question at the end of this page. "}, {"url": "http://ezinearticles.com/?Poetic-Devices-in-Poetry&id=110584", "passage_text": "One way to attain the qualities so essential to making words poetic is through the use of poetry devices. We won't begin to cover all the known poetic devices or terms. Rather we'll discuss and use some of the more commonly known and used ones. Below are the more commonly used poetic devices and terms. Hopefully, with the examples given, everyone can better understand some of the ways to make poetry, well, more poetic. The examples used are my own poetry and are copyrighted in my name. "}, {"url": "https://watsonpoetry.wordpress.com/poetic-devices-10/", "passage_text": "Poetic Devices 10. Sound Devices: Alliteration. The repetition of consonant sounds, especially at the beginning of words. Example: “Fetched fresh, as I suppose, off some sweet wood.”. Assonance. The repetition of similar vowel sounds in a sentence or a line of poetry or prose. Sound Devices "}, {"url": "http://study.com/academy/lesson/poetic-devices-definition-types-examples.html", "passage_text": "There are many devices that can enhance the meaning of a poem. A simile is a comparison between two unlike things. Similes use the words 'like' or 'as.' A simile can get the reader to look at something in a different way. Lesson Summary. Poetic devices are tools that a poet can use to create rhythm, enhance a poem's meaning, or intensify a mood or feeling. To create rhythm, poets may incorporate: 1  Rhyme. 2  Repetition."}, {"url": "http://study.com/academy/lesson/poetic-devices-definition-types-examples.html", "passage_text": "Poetry can follow a strict structure, or none at all, but many different types of poems use poetic devices. Poetic devices are tools that a poet can use to create rhythm, enhance a poem's meaning, or intensify a mood or feeling. These devices help piece the poem together, much like a hammer and nails join planks of wood together. Lesson Summary. Poetic devices are tools that a poet can use to create rhythm, enhance a poem's meaning, or intensify a mood or feeling. To create rhythm, poets may incorporate: 1  Rhyme. 2  Repetition."}, {"url": "http://www.chaparralpoets.org/devices.pdf", "passage_text": "–1– Poetic Devices Poetry is the kind of thing poets write. — Robert Frost Man, if you gotta ask, you’ll never know. — Louis Armstrong A POET IS LIMITED in the materials he can use in creating his works: all he has are words to expresshis ideas and feelings. "}, {"url": "http://www.genconnection.com/English/poeticdevices.htm", "passage_text": "poetic devices that effect the sound of the poem but not usually its meaning. "}, {"url": "http://www.writing.com/main/view_item/item_id/662052-Poetry-Terms-and-Devices", "passage_text": "Poetry Terms Poetry devices (a major sampling): alliteration: the repetition of a beginning sound allusion: a casual reference to someone or something in history or literature that creates a mental picture. analogy: the comparison of two things by explaining one to show how it is similar to the other. One way we are able to attain the qualities so essential to making words poetry is through the use of poetry devices. We won’t begin to cover all the known poetic devices or terms. Rather we’ll discuss and use some of the more commonly known and used ones."}]