[{"url": "http://www.homewyse.com/services/cost_to_install_gutters.html", "passage_text": "Our free calculator uses recent, trusted data to estimate costs for your Gutter Installation project. For a basic 60 linear feet project in zip code 47474, the benchmark cost to Install Gutters ranges between $5.49 - $9.13 per linear foot. To estimate costs for your project: 1. "}, {"url": "http://www.howmuchisit.org/gutter-replacement-cost/", "passage_text": "1 Aluminum gutters can cost $5 to $12 per square feet, while steel gutters can cost upwards of $9 to $14. 2  The most expensive gutters – copper – can cost $19 to $25 per square foot. 3  These prices mentioned above are for the materials alone. 1 According to AngiesList.com, the experts state that a full house repair will cost around 60% of the initial installation cost. 2  So if you paid $1,000 for your gutters, plan on spending around $600 to repair the whole home."}, {"url": "http://www.improvenet.com/r/costs-and-prices/copper-gutters", "passage_text": "The cost for installing copper gutters on a house is not cheap and is seen as a luxury. Copper gutters can cost between $15 and $25 per linear foot. In comparison, most houses are outfitted with aluminum gutters, which only cost between $4 and $8 per linear foot. One factor that affects the cost of the copper gutters is the thickness of the metal being used. "}, {"url": "http://www.howmuchisit.org/gutter-replacement-cost/", "passage_text": "1 If you need the gutters replaced rather than repaired, vinyl gutters will cost $0.50 to $2 per square foot for the materials along. 2  Aluminum gutters can cost $5 to $12 per square feet, while steel gutters can cost upwards of $9 to $14. 1 According to AngiesList.com, the experts state that a full house repair will cost around 60% of the initial installation cost. 2  So if you paid $1,000 for your gutters, plan on spending around $600 to repair the whole home."}, {"url": "http://www.harryhelmet.com/gutter-guards-cost/", "passage_text": "Given all the various options on aluminum gutters, they will cost you roughly $750 – $2,300 for a 150 foot project, depending on the size of gutter, gauge and attachment method you choose for your home. Steel Gutters and Downspout Costs: $16-$25 per linear foot. Vinyl Gutters and Downspout Cost: $1 to $3 per linear foot. Vinyl is the least expensive material on the market, and the easiest to work with, making it a good fit for “do-it-yourself” (DIY) projects. The knock on vinyl is durability, as it weakens faster than other materials, especially in cold climates."}, {"url": "http://home.costhelper.com/gutters.html", "passage_text": "1 Expect to pay around $3-$5 a lineal foot to have someone install vinyl (PVC) gutters, or about $360-$600 for 120 feet and $750-$1,250 for 250 feet. 2  Vinyl gutters are a fairly simple do-it-yourself project; material alone run about $50-$100 for 120 feet and $90-$180 for 250 feet. 1 Copper gutters are low maintenance and do not rust; they tend to be a custom project at a $15-$25 a foot or $1,800-$3,000 for 120 feet and $3,750-$6"}, {"url": "http://home.costhelper.com/gutters.html", "passage_text": "1 Vinyl gutters maintain their color well, are flexible and dent-resistant and don't rust or corrode but they do get brittle with age and extreme cold. 2  Having aluminum gutters installed averages about $4-$9 a foot plus downspouts at $5-$8 each, or $500-$1,200 for 120 feet and $1,050-$2,400 for 250 feet. 1 Copper gutters are low maintenance and do not rust; they tend to be a custom project at a $15-$25 a foot or $1,800-$3,000 for 120 feet and $3,750-$6,25"}, {"url": "http://home.costhelper.com/gutters.html", "passage_text": "1 Galvanized steel gutters are about $4-$8 installed, for a total cost around $500-$1,000 for 120 feet and $1,000-$2,000 for 250 feet. 2  Steel runs $8-$10 a foot, or $960-$1,200 for 120 feet and $2,000-$2,500 for 240 feet. 1 Copper gutters are low maintenance and do not rust; they tend to be a custom project at a $15-$25 a foot or $1,800-$3,000 for 120 feet and $3,750-$6,25"}, {"url": "http://home.costhelper.com/gutters.html", "passage_text": "1 (Sprawling single-story homes have more roof edges and therefore more feet of rain gutters than more-compact two-or three-story houses.). 2  Expect to pay around $3-$5 a lineal foot to have someone install vinyl (PVC) gutters, or about $360-$600 for 120 feet and $750-$1,250 for 250 feet. 1 Copper gutters are low maintenance and do not rust; they tend to be a custom project at a $15-$25 a foot or $1,800-$3,000 for 120 feet and $3,750-$6"}, {"url": "http://www.homeadvisor.com/cost/gutters/install-gutters-and-downspouts/", "passage_text": "1 Aluminum is a bit more expensive, starting at $6 per piece with the most expensive gutters in the $12 range. 2  Steel gutters are much better in quality, and their price reflects this. 3  They start at $11 and oftentimes cost $33 per piece or more. 4  Copper is the highest quality of all. Expect to pay between $6 and $15 for vinyl and aluminum versions, while steel at least doubles that total and copper will cost $90 or more. You might also have to pay for additional materials like: 1  Vinyl gutters are the least expensive, costing as little as $4 per piece."}]