[{"url": "https://en.wikipedia.org/wiki/Celery", "passage_text": "Celery (Apium graveolens) is a cultivated plant, variety in the family Apiaceae, commonly used as a vegetable. Depending on location, either its stalks, or its hypocotyl, are eaten and used in cooking. In North America the dominant variety most commonly available in trade is celery, Apium graveolens var. "}, {"url": "http://www.whfoods.com/genpage.php?tname=foodspice&dbid=14", "passage_text": "Celery is an excellent source of vitamin K and molybdenum. It is a very good source of folate, potassium, dietary fiber, manganese, and pantothenic acid. Celery is also a good source of vitamin B2, copper, vitamin C, vitamin B6, calcium, phosphorus, magnesium, and vitamin A (in the form of carotenoids). (Just compare leafy carrot tops or parsley leaves with celery leaves and you'll see why.) In addition to celery, carrots, and parsley, this plant family also includes dill, fennel, cilantro/coriander, parsnip, anise, caraway, chervil, cumin, angelica, and asafetida."}, {"url": "http://foodfacts.mercola.com/celery.html", "passage_text": "Homily on Celery. Botanical name: Apium graveolens. A crunchy snack all by itself or with peanut butter added to round out the nutrients, celery is one of the most versatile vegetables in the garden, useful for its flavorful seeds and pale green leaves and stalks."}, {"url": "http://foodfacts.mercola.com/celery.html", "passage_text": "Celery leaves (which contain the most vitamin C, calcium, and potassium) and seeds also contain a number of little-heard of volatile oils, such as terpenes (which consists mostly of limonene), and the sesquiterpenes β-selinene and humulene. A crunchy snack all by itself or with peanut butter added to round out the nutrients, celery is one of the most versatile vegetables in the garden, useful for its flavorful seeds and pale green leaves and stalks."}, {"url": "https://www.organicfacts.net/health-benefits/vegetable/health-benefits-of-celery.html", "passage_text": "Antiseptic: Celery seeds help in the elimination of uric acid because it is commonly used for its diuretic properties, meaning that it stimulates urination. Therefore, celery is good for people with bladder disorders, kidney problems, cystitis, and other similar conditions. Mix orange juice with mayonnaise and drizzle it over the mixture. Soups: Add celery stalks and leaves to soups, gravies etc. Word of caution: Celery seeds contain volatile oils, flavonoids, coumarins and linoleic acid and are therefore not good for pregnant women because they may cause contractions in the uterus."}, {"url": "http://foodfacts.mercola.com/celery.html", "passage_text": "Celery is a great addition to tuna or egg salad. Stir fries are an excellent way to enjoy this vegetable, mixed with carrots, bell peppers, and onions, and teriyaki or orange sauce. It also adds an aromatic flavor to pot roast and vegetable soup. A crunchy snack all by itself or with peanut butter added to round out the nutrients, celery is one of the most versatile vegetables in the garden, useful for its flavorful seeds and pale green leaves and stalks."}, {"url": "http://www.care2.com/greenliving/11-super-health-benefits-in-just-1-celery-stalk.html", "passage_text": "1 Celery aids digestion: some say celery tastes like “crunchy water,” and that is the reason it is so good for your digestive system. 2  The high water content of celery, combined with the insoluble fiber in it, makes it a great tool for easy passage of stool. "}, {"url": "http://www.medicalnewstoday.com/articles/270678.php", "passage_text": "Antioxidants-celery is a very rich source of antioxidants. The vegetable contains the following phytonutrients: phenolic acids, flavonols, dihydrostilbenoids, flavones, furanocoumarins, and phytosterols. Vitamins and minerals-celery is very rich in vitamin K and also contains folate, vitamin A, potassium, and vitamin C. Dietary fiber-despite being mainly water, celery also provides a fair amount of dietary fiber. The vegetable contains 1.6 grams of fiber per 100 grams. Celery is a vegetable belonging to the Apiaceae family. It is well known for its crunchy stalks, which people often consume as a low calorie snack. However, celery is not only a good low calorie food. There are a number of other reasons why you might want to include this vegetable in your diet"}, {"url": "http://www.whfoods.com/genpage.php?tname=foodspice&dbid=14", "passage_text": "This chart graphically details the %DV that a serving of Celery provides for each of the nutrients of which it is a good, very good, or excellent source according to our Food Rating System. Additional information about the amount of these nutrients provided by Celery can be found in the Food Rating System Chart. (Just compare leafy carrot tops or parsley leaves with celery leaves and you'll see why.) In addition to celery, carrots, and parsley, this plant family also includes dill, fennel, cilantro/coriander, parsnip, anise, caraway, chervil, cumin, angelica, and asafetida."}]