[{"url": "https://au.answers.yahoo.com/question/index?qid=20090309231719AAkjsZz", "passage_text": "The drought is pretty much on in the south and middle area, but western Australia has the issue too-even in the north. Up top in the Northern Ter, they have one hell of a rainy season that keeps them nice and wet, pretty much the same in Queensland too."}, {"url": "http://www.skwirk.com/p-c_s-57_u-479_t-1306_c-5026/qld/sose-geography/disasters/natural-hazards/drought-and-drought-in-australia", "passage_text": "Some of Australia's most devastating droughts have occurred during El Ni o periods, including the 1914-1915 Drought, the severe 1982-1983 Drought, and the long El Ni o Drought of 1991-1995. Droughts, however, do not always occur during El Ni o years."}, {"url": "http://australiaanddroughts.weebly.com/where-do-droughts-occur.html", "passage_text": "Droughts can occur anywhere in Australia. They most commonly occur in areas away from the coast. South Australia is the driest state, and droughts are quite frequent in South Australia. Although the central western regions of New South Wales, Queensland, and Victoria also suffer terrible droughts. The Federation drought, occurred in the Eastern part of"}, {"url": "http://www.answers.com/Q/Where_do_droughts_usually_occur_in_Australia", "passage_text": "Droughts can occur anywhere in Australia. They most commonly occur in areas away from the coast, but each of Australia's states and/or territories are subject to drought conditions."}, {"url": "http://www.answers.com/Q/Where_do_droughts_usually_occur", "passage_text": "South Australia is the driest state, and droughts are frequent and prolonged in that state, but the central western regions of Queensland, New South wales and Victoria are also subject to terrible droughts."}, {"url": "http://nd.water.usgs.gov/drought/faqs/faq4.html", "passage_text": "Some areas of the United States are more likely to have droughts than other areas. In humid, or wet, regions, a drought of a few weeks is quickly reflected in a decrease in soil moisture and in declining flow in streams."}, {"url": "http://www.skwirk.com/p-c_s-57_u-479_t-1306_c-5026/qld/sose-geography/disasters/natural-hazards/drought-and-drought-in-australia", "passage_text": "A drought is a long period of time in which the water available from rainfall and stored water is not enough to provide for the needs of users. It is not simply an acute shortage of water. This definition, for the purposes of clarity, provides a basic outline of what constitutes drought."}]