[{"url": "http://www.webmd.com/cholesterol-management/guide/cholesterol-basics", "passage_text": "This may mean that your level of high-density lipoprotein (HDL), or good cholesterol, is too low. It is best to have a high level of good HDL and a low level of bad LDL because the HDL helps keep your LDL level in check. Ask your doctor for your HDL level."}, {"url": "http://www.webmd.com/cholesterol-management/guide/cholesterol-basics", "passage_text": "There are different types of cholesterol. You want to lower the “bad” kind, LDL, and triglycerides, which your body stores in fat cells. On the other hand, you want to raise your “good” (HDL) cholesterol. It helps get rid of the bad kinds."}, {"url": "http://www.nhlbi.nih.gov/health/health-topics/topics/hbc/", "passage_text": "Your body makes all the cholesterol it needs. However, cholesterol also is found in some of the foods you eat. Cholesterol travels through your bloodstream in small packages called lipoproteins (lip-o-PRO-teens). These packages are made of fat (lipid) on the inside and proteins on the outside."}, {"url": "http://www.heart.org/HEARTORG/Conditions/Cholesterol/AboutCholesterol/About-Cholesterol_UCM_001220_Article.jsp", "passage_text": "Cholesterol is a waxy substance that comes from two sources: your body and food. Your body, and especially your liver, makes all the cholesterol you need and circulates it through the blood. But cholesterol is also found in foods from animal sources, such as meat, poultry and full-fat dairy products."}, {"url": "http://www.medicalnewstoday.com/articles/9152.php", "passage_text": "High levels of LDL lead to a build-up of cholesterol in the arteries, whereas HDL carries cholesterol to the liver for removal from the body. 2 A build-up of cholesterol is part of the process that narrows arteries, called atherosclerosis, in which plaques form and cause restriction of blood flow. 2."}, {"url": "http://www.webmd.com/cholesterol-management/guide/cholesterol-basics", "passage_text": "This may mean that your level of high-density lipoprotein (HDL), or good cholesterol, is too low. It is best to have a high level of good HDL and a low level of bad LDL. The HDL helps keep your LDL level in check. Ask your doctor for your HDL level."}, {"url": "http://health.howstuffworks.com/diseases-conditions/cardiovascular/cholesterol/cholesterol1.htm", "passage_text": "Cholesterol is a waxy, fat-like compound that belongs to a class of molecules called steroids. It's found in many foods, in your bloodstream and in all your body's cells. If you had a handful of cholesterol, it might feel like a soft, melted candle. Cholesterol is essential for:"}, {"url": "http://www.nhlbi.nih.gov/health/health-topics/topics/hbc/", "passage_text": "A high LDL level leads to a buildup of cholesterol in your arteries. (Arteries are blood vessels that carry blood from your heart to your body.). HDL cholesterol sometimes is called “good” cholesterol. This is because it carries cholesterol from other parts of your body back to your liver."}]