[{"url": "http://www.angelfire.com/ab/bethsbread/WhatisSourdough.html", "passage_text": "The history of sourdough is as old as the history of leavened bread itself. Way back in ancient days (around 6,000 years ago, some say) humans first figured out how to promote the fermentation and leavening of grains to first be brewed into beverages and then, later, to be baked into bread. Sourdough Bread: Bread which has been leavened with a sourdough starter. It may or may not be a sour bread, depending on the characteristics of the starter. Sourdough: An American term for a natural leaven of wild or natural yeast and lactobacilli. Also the process of leavening bread with a natural leaven."}, {"url": "http://dontwastethecrumbs.com/2013/06/what-is-sourdough-benefits-of-sourdough-bread/", "passage_text": "What is Sourdough. Sourdough is a bread made from the natural occurring yeast and bacteria in flour. In traditional sourdough recipes, you’ll find three ingredients: sourdough starter (which consists of flour and water), salt and flour. There is no yeast, no milk, no oils and no sweeteners. It’s about as natural as you get when it comes to bread."}, {"url": "http://www.kingarthurflour.com/guides/sourdough/", "passage_text": "Sourdough starter begins with a combination of flour and liquid. The proportion and type of flour and liquid can vary dramatically, from a stiff starter made entirely with rye flour and water, to a liquid batter of milk and cornmeal, and everything in between. The result: sourdough starter. These tiny living creatures (lactobacilli and yeast, collectively called the sourdough's microflora) generate byproducts that cause bread to rise and give it complex, rich flavor."}, {"url": "https://en.wikipedia.org/wiki/Sourdough", "passage_text": "Sourdough is a dough containing a Lactobacillus culture in symbiotic combination with yeasts. It is one of the principal means of biological leavening in bread baking, the others using cultivated forms of yeast. It is important in baking rye-based breads, where yeast does not produce comparable results. Bread made from 100 percent rye flour, which is very popular in the northern half of Europe, is usually leavened with sourdough. Baker's yeast is not useful as a leavening agent for rye bread, as rye does not contain enough gluten."}, {"url": "https://en.wikipedia.org/wiki/Sourdough", "passage_text": "Sourdough bread is made by the fermentation of dough using naturally-occurring lactobacilli and yeast. Sourdough bread has a mildly sour taste not present in most breads made with baker's yeast, due to the lactic acid produced by the lactobacilli. Bread made from 100 percent rye flour, which is very popular in the northern half of Europe, is usually leavened with sourdough. Baker's yeast is not useful as a leavening agent for rye bread, as rye does not contain enough gluten."}, {"url": "http://www.wisegeek.com/what-is-sourdough-bread.htm", "passage_text": "Sourdough is one of the oldest types of bread. The 100% rye bread common in Northern Europe is one example of sourdough bread, and baguettes and other Southern European breads were traditionally made with sourdough before the advent of faster-growing yeast cultures. All one needs to make a sourdough culture is flour and water. The bacteria in a sourdough bread culture is Lactobacillus, or lactic acid bacteria, which is also used in such foods as sauerkraut, kimchi, pickles, cheese, and yogurt."}, {"url": "http://www.kingarthurflour.com/guides/sourdough/", "passage_text": "The simplest definition of sourdough comes from the dictionary: leaven, especially fermented dough retained from one baking and used, rather than fresh yeast, to start the next. But sourdough is so much more than simply a way to make bread rise. It's an enticing, tangy flavor; a snapshot of American culinary history, and a classic ingredient in everything from pancakes to pretzels. The result: sourdough starter. These tiny living creatures (lactobacilli and yeast, collectively called the sourdough's microflora) generate byproducts that cause bread to rise and give it complex, rich flavor."}]