[{"url": "http://medical-dictionary.thefreedictionary.com/PSYCHOANALYTIC+TREATMENT", "passage_text": "Psychoanalysis is the most intensive form of an approach to treatment called psychodynamic therapy. Psychodynamic refers to a view of human personality that results from interactions between conscious and unconscious factors. The cost of either psychoanalysis or psychoanalytic psychotherapy is prohibitive for most patients without insurance coverage. A full course of psychoanalysis usually requires three to five weekly sessions with a psychoanalyst over a period of three to five years."}, {"url": "https://torontopsychoanalysis.com/about-us/what-is-psychoanalytic-psychotherapy/", "passage_text": "Psychotherapy is a treatment modality designed to help alleviate psychological suffering or symptoms. Psychotherapy takes place within the context of a trusting relationship with a mental health professional. Psychotherapy is delivered in a wide range of settings from hospitals, to private offices."}, {"url": "https://en.wikipedia.org/wiki/Psychoanalysis", "passage_text": "Psychoanalysis is a set of psychological and psychotherapeutic theories and associated techniques, created by Austrian physician Sigmund Freud and stemming partly from the clinical work of Josef Breuer and others. Over time, psychoanalysis has been revised and developed in different directions. Psychoanalysis has received criticism from a wide variety of sources. It is regarded by some critics as a pseudoscience. Nonetheless, it remains a strong influence within the realm of psychiatry, and more so in some quarters than others."}, {"url": "http://www.counselling-directory.org.uk/psychoanalytical.html", "passage_text": "Psychoanalytic therapy. Psychoanalytic therapy is a type of treatment based upon the theories of Sigmund Freud, who is considered one of the forefathers of psychology and the founder of psychoanalysis. "}, {"url": "http://psychcentral.com/lib/psychodynamic-therapy/", "passage_text": "Psychodynamic therapy is the oldest of the modern therapies. (Freud’s psychoanalysis is a specific form and subset of psychodymanic therapy.) As such, it is based in a highly developed and multifaceted theory of human development and interaction. This chapter demonstrates how rich it is for adaptation and further evolution by contemporary therapists for specific purposes."}, {"url": "https://www.psychologytoday.com/basics/psychoanalysis", "passage_text": "It began, of course, with Freud. Psychoanalysis refers both to a theory of how the mind works and a treatment modality. In recent years, both have yielded to more mainstream, research-driven approaches, but psychoanalysis is still a thriving field. "}, {"url": "https://torontopsychoanalysis.com/about-us/what-is-psychoanalytic-psychotherapy/", "passage_text": "Psychoanalytic psychotherapy developed out of the field of psychoanalysis. It is also variously referred to as insight-oriented psychotherapy, psychodynamic psychotherapy, long-term, intensive, in-depth and expressive psychotherapy. Psychotherapy takes place within the context of a trusting relationship with a mental health professional. Psychotherapy is delivered in a wide range of settings from hospitals, to private offices."}, {"url": "http://www.trans4mind.com/counterpoint/index-happiness-wellbeing/sinisi.shtml", "passage_text": "The term 'psychoanalytic psychotherapy' can refer to a spectrum of talking therapies ranging from once-weekly face-to-face psychodynamic therapy all the way to full-blown five times weekly, on-the-couch psychoanalysis. "}, {"url": "http://www.apsa.org/content/psychoanalytic-psychotherapy", "passage_text": "Psychoanalytic Psychotherapy. Psychoanalytic or Psychodynamic Psychotherapy is a form of clinical practice which is based on psychoanalytic theory and principles. It’s a treatment modality that in many ways is quite similar to psychoanalysis, although often considered less intense"}]