[{"url": "http://eyes.emedtv.com/tobradex/tobradex.html", "passage_text": "Tobradex ® (tobramycin and dexamethasone) is a prescription eye medication. It contains both an antibiotic and a steroid. It is approved for treating certain eye conditions that involve both inflammation and an infection (or a risk for an infection). "}, {"url": "http://www.rxlist.com/tobradex-ointment-drug/patient-images-side-effects.htm", "passage_text": "Tobramycin is an antibiotic. It is used to treat bacterial infections. Dexamethasone is a steroid. Dexamethasone ophthalmic is used to treat the swelling associated with bacterial infections of the eye. Tobramycin and dexamethasone ophthalmic is used to treat bacterial infections of the eyes. Tobramycin and dexamethasone ophthalmic may also be used for purposes other than those listed in this medication guide. Serious side effects are not expected to occur with the use of this medication. Some burning, stinging, irritation, itching, redness, blurred vision, eyelid itching, eyelid swelling, or sensitivity to light may occur. This is not a complete list of side effects and others"}, {"url": "http://www.goodrx.com/tobradex", "passage_text": "Tobradex. DEXAMETHASONE; TOBRAMYCIN is a steroid and an aminoglycoside antibiotic. It is used to treat bacterial eye infections. It will also decrease swelling, redness, and itching."}, {"url": "http://www.rxlist.com/tobradex-ointment-drug.htm", "passage_text": "Serious side effects are not expected to occur with the use of this medication. Some burning, stinging, irritation, itching, redness, blurred vision, eyelid itching, eyelid swelling, or sensitivity to light may occur. This is not a complete list of side effects and others may occur. MW = 392.47. Each gram of TOBRADEX® (tobramycin and dexamethasone opthalmic ointment) (tobramycin and dexamethasone ophthalmic ointment) contains: Actives: tobramycin 0.3% (3mg) and dexamethasone 0.1% (1 mg). Preservative: chlorobutanol 0.5%."}, {"url": "https://en.wikipedia.org/wiki/TobraDex", "passage_text": "(Redirected from TobraDex). Tobramycin/dexamethasone (INNs, trade name Tobradex, Tobrason in Jordan) is a prescription medication in the form of eye drops and eye ointment, marketed by Alcon. The active ingredients are tobramycin 0.3% (an antibiotic) and dexamethasone 0.1% (a corticosteroid). It is prescribed for a wide spectrum of bacterial eye infections. Tobradex can also be used to clear or contract styes that are also found in the eye."}, {"url": "http://www.rxlist.com/tobradex-ointment-drug.htm", "passage_text": "Each gram of TOBRADEX® (tobramycin and dexamethasone opthalmic ointment) (tobramycin and dexamethasone ophthalmic ointment) contains: Actives: tobramycin 0.3% (3mg) and dexamethasone 0.1% (1 mg). MW = 392.47. Each gram of TOBRADEX® (tobramycin and dexamethasone opthalmic ointment) (tobramycin and dexamethasone ophthalmic ointment) contains: Actives: tobramycin 0.3% (3mg) and dexamethasone 0.1% (1 mg). Preservative: chlorobutanol 0.5%."}, {"url": "http://www.medsafe.govt.nz/profs/Datasheet/t/Tobradexeyedropoint.pdf", "passage_text": "Each gram of TOBRADEX Ointment contains: Actives: Tobramycin 0.3% (3 mg) and Dexamethasone 0.1% (1 mg). Preservative: Chlorobutanol 0.5% Inactives: Mineral Oil and White Petrolatum. Uses Actions Corticoids suppress the inflammatory response to a variety of agents and they probably delay or slow healing. If the maximum dose of TOBRADEX Ophthalmic Suspension is given for the first 48 hours (two drops in each eye every 2 hours) and complete systemic absorption occurs, which is highly unlikely, the daily dose of dexamethasone would be 2.4 mg."}, {"url": "http://www.rxzone.us/product.cfm/rx/Tobradex-Ophthalmic-Ointment-35-Gm-055103.html", "passage_text": "CHEMICAL NAME. TOBRAMYCIN and DEXAMETHASONE. Tobradex is an antibiotic and steroid combination used in the eye to treat infections and to relieve the redness, irritation, and discomfort associated with certain eye problems. &nbsp. &nbsp. Follow the directions for using Tobradex provided by your doctor. Tobradex Ophthalmic Ointment may be used around the eye or in the eye. To use this medicine in the eye: first, wash your hands. Pull the lower eyelid away from your eye to form a pouch. Squeeze a thin strip of ointment into the pouch. "}, {"url": "https://www.sharecare.com/health/opthalmologic-drugs/what-is-tobradex-ointment", "passage_text": "A Stacy Wiegman, PharmD, Pharmacy, answered. Tobradex eye ointment is a combination of two medications in an ointment that is applied directly to the eye to treat bacterial infection and the associated inflammation. The names of the active ingredients are tobramycin, an antibiotic, and dexamethasone, a steroid. "}, {"url": "http://www.rxlist.com/tobradex-ointment-drug.htm", "passage_text": "home drugs a-z list tobradex ophthalmic ointment (tobramycin and dexamethasone opthalmic ointment) side effects drug center tobradex ophthalmic ointment (tobramycin and dexamethasone opthalmic ointment) drug. MW = 392.47. Each gram of TOBRADEX® (tobramycin and dexamethasone opthalmic ointment) (tobramycin and dexamethasone ophthalmic ointment) contains: Actives: tobramycin 0.3% (3mg) and dexamethasone 0.1% (1 mg). Preservative: chlorobutanol 0.5%."}]