[{"url": "http://www1.salary.com/Clinical-Research-Coordinator-salary.html", "passage_text": "For example the median expected annual pay for a typical Clinical Research Coordinator in the United States is $55,816 so 50% of the people who perform the job of Clinical Research Coordinator in the United States are expected to make less than $55,816. Source: HR Reported data as of October 2015. Median $55,816. "}, {"url": "http://www1.salary.com/Academic-Support-Coordinator-salary.html", "passage_text": "The annual salary for someone with the job title Academic Support Coordinator may vary depending on a number of factors including industry, company size, location, years of experience and level of education. This chart describes the expected percentage of people who perform the job of Academic Support Coordinator that make less than that salary. For example 50% of the people who perform the job of Academic Support Coordinator are expected to make less than the median."}, {"url": "http://www.payscale.com/research/US/Job=Administrative_Coordinator/Salary", "passage_text": "Administrative Coordinators usually earn approximately $41K per year in the United States, but Amgen Corporation offers a significantly higher median of $59K. Median of all compensation (including tips, bonus, and overtime) by years of experience. For Administrative Coordinators, level of experience appears to be a somewhat less important part of the salary calculation — more experience does not correlate to noticeably higher pay."}, {"url": "http://www.payscale.com/research/US/Job=Operations_Support_Coordinator/Salary", "passage_text": "(United States). An Operations Support Coordinator earns an average salary of $41,765 per year. Most people with this job move on to other positions after 20 years in this field. The highest paying skills associated with this job are Operations Management and Oral / Verbal Communication"}, {"url": "http://www.supportcoordinators.com/beasupportcoordinator.html", "passage_text": "A minimum of 60 hours of pre-service training is required consisting of 34 hours of statewide pre-service training and 26 hours of district specific training which includes orientation to the district, local resources and local operational procedures. "}, {"url": "http://www1.salary.com/Academic-Support-Coordinator-salary.html", "passage_text": "For example the median expected annual pay for a typical Academic Support Coordinator in the United States is $50,457, so 50% of the people who perform the job of Academic Support Coordinator in the United States are expected to make less than $50,457. Source: HR Reported data as of October 2015. 1  Salary. 2  Salary + Bonus. This chart describes the expected percentage of people who perform the job of Academic Support Coordinator that make less than that salary. For example 50% of the people who perform the job of Academic Support Coordinator are expected to make less than the median."}, {"url": "http://work.chron.com/much-service-coordinator-make-19572.html", "passage_text": "Salary by State or District. Average salaries for service coordinators vary somewhat by state or district. They earned an average salary of $68,000 in Washington, D.C., according to SimplyHired.com. They also made comparatively high salaries in Massachusetts and New York -- $52,000 and $51,000 per year, respectively. Those who have been with a company 20 years, for example, might make $50,000 or more on average -- versus $35,000 for service coordinators just starting their careers."}, {"url": "http://www.payscale.com/research/US/Job=Administrative_Coordinator/Salary", "passage_text": "Pay Difference by Location. For Administrative Coordinators, busy New York offers a higher-than-average pay rate, 21 percent above the national average. Administrative Coordinators will also find cushy salaries in Houston (+15 percent), Washington (+14 percent), San Francisco (+14 percent), and Boston (+14 percent). Median of all compensation (including tips, bonus, and overtime) by years of experience. For Administrative Coordinators, level of experience appears to be a somewhat less important part of the salary calculation — more experience does not correlate to noticeably higher pay."}, {"url": "http://work.chron.com/much-service-coordinator-make-19572.html", "passage_text": "Service coordinators' experience tends to have the most impact on their salaries. Those who have been with a company 20 years, for example, might make $50,000 or more on average -- versus $35,000 for service coordinators just starting their careers. Employer size can impact salaries for these service professionals -- with larger ones paying more because they can support the highe"}]