[{"url": "http://www.ebay.com/gds/Whats-the-Difference-Between-Raw-Unrefined-and-Ultra-refined-Shea-Butter-/10000000178258860/g.html", "passage_text": "Refined Shea Butter. Refined shea butter has undergone some form of processing in order to remove its odor and/or change its properties. It is also common for refined shea butter to have additives, such as perfumes or preservatives. Refined shea butter is generally very smooth and has a white color instead of yellow color. "}, {"url": "http://www.walkersnatural.com/shea-butter/", "passage_text": "Organic White Refined Shea Butter-If you don't like the scent of natural of Shea this is the one for you. White refined is the most common in body butter and cream formulations as it lacks the smell of natural shea allowing the aroma of essential oils to come through. Price: 8oz. Shea Butter-Organic Refined-Virgin Organic-Natural Ghana Beige. Shea Butter. A wonderful deep moisturizer for the skin. it revitalizes, softens and maintains skin moisture. Naturally rich in vitamins A, E and F, some of the essential vitamins needed for good skin health."}, {"url": "http://www.bulkapothecary.com/raw-ingredients/waxes-and-butters/pure-shea-butter-bulk/", "passage_text": "Our bulk refined Shea Butter is great for cosmetics and soaps. After shea butter is extracted from the Shea nut the natural butter is filtered to remove any impurities, resulting in a creamy off white color and an ultra high quality pure product. The refined shea butter also has less odor, making it shea butter of choice for the soap making and personal care industry. "}, {"url": "http://sheabutterguide.com/shea-butter/", "passage_text": "In its pure unrefined state, shea butter is also edible and has been used for centuries in Africa as cooking oil, as a waterproofing wax, for hairdressing, for candle-making, as an anti-inflammatory for sprains and arthritis, and to sooth dry skin. Unrefined shea butter simply means it is extracted and prepared without the use of chemicals or preservative. In other terms, that means it is produced the same way African people do it for centuries. And this is what really counts, because only unrefined shea butter keeps all of its natural healing properties. On the other hand, refined shea butter has usually been extracted with hexane or other petroleum solvents and some antioxidants or preservatives may also be added"}, {"url": "http://blackhaircaretoday.com/hair-care-articles/why-i-chose-naturally-refined-shea-butter/", "passage_text": "Naturally refined shea butter. What I found was a process whereby shea butter can be refined using natural clay or otherwise known as diatomaceous earth. Using clay to refine products is not new. According to Wikipedia this process is used for such products as beer and wine."}, {"url": "http://mzmahoganychic.com/2012/03/29/sheabutter/", "passage_text": "I recently purchased 5lbs of fair trade certified organic unrefined shea butter. It’s a lot of shea butter but I can think of many ways to use it. Keep in mind there is a difference between unrefined and refined shea butter. The biggest difference being unrefined shea butter is yellow and has a strong medicinal smell."}, {"url": "http://www.africansheabutter.org/", "passage_text": "Shea Butter has a natural smell, which is not unpleasant to most people. The smell of raw or lightly refined West African Shea varies from nutty to similar to Crisco® or shortening. Over time the smell of the Shea Butter will diminish. If an unrefined Shea Butter has almost no smell, it is probably getting old. "}, {"url": "http://sheabutterguide.com/shea-butter/", "passage_text": "Shea butter is a slightly yellowish or ivory colored and nutty, smoky scented natural fat extracted from the seed of the African shea tree. It is often referred to by its French name as karite tree, which originally (ghariti) means the tree of life. The tree got this name due to its exceptional healing properties. Unrefined shea butter simply means it is extracted and prepared without the use of chemicals or preservative. In other terms, that means it is produced the same way African people do it for centuries. And this is what really counts, because only unrefined shea butter keeps all of its natural healing properties. On the other hand, refined shea butter has usually been extracted with hexane or other petroleum solvents and some antioxidants or preservatives may also be added"}]