[{"url": "http://www.indeed.com/q-contract-attorney-l-Atlanta,-GA-jobs.html", "passage_text": "1 View all Robert Half Legal jobs in Atlanta, GA-Atlanta jobs. 2  Salary Search: Attorney Lawyer salaries in Atlanta, GA. 3  Learn more about working at Robert Half Legal. 4  Related forums: Robert Half-Atlanta, Georgia - -. 1 View all Counsel On Call jobs in Atlanta, GA-Atlanta jobs. 2  Salary Search: Corporate Transaction Attorney salaries in Atlanta, GA. 3  Learn more about working at Counsel On Call. 4  Related forums: Counsel On Call"}, {"url": "http://www.indeed.com/salary/q-Attorney-Lawyer-l-Atlanta,-GA.html", "passage_text": "Attorney Lawyer in Atlanta, GA. Average Attorney Lawyer salaries for job postings in Atlanta, GA are 25% higher than average Attorney Lawyer salaries for job postings nationwide. "}, {"url": "http://www.payscale.com/research/US/Job=Attorney_%2f_Lawyer/Salary/232e2360/Atlanta-GA", "passage_text": "(United States). An Attorney / Lawyer in Atlanta, Georgia earns an average salary of $84,676 per year. Experience has a moderate effect on income for this job. Most people move on to other jobs if they have more than 20 years' experience in this career. Skills that are associated with high pay for this job are Leadership, Complex Litigation Case Management, Legal Compliance, and Legal Document Review. $49,964 - $161,892."}, {"url": "http://www.atlanta-overtime-lawyer.com/home.html", "passage_text": "The minimum wage for tipped employees is $2.13 per hour if that amount plus the tips received equal at least the federal minimum wage, the employee retains all tips and the employee customarily and regularly receives more than $30 a month in tips. The federal minimum wage for covered non-exempt employees is $7.25 per hour effective July 24, 2009. Many states also have minimum wage laws. Where an employee is subject to both the state and federal minimum wage laws, the employee is entitled to the higher minimum wage rate."}, {"url": "http://www.payscale.com/research/US/Job=Attorney_%2f_Lawyer/Salary", "passage_text": "Attorney / Lawyer Salary. (United States). The average pay for an Attorney / Lawyer is $77,252 per year. Experience has a moderate effect on salary for this job. People in this job generally don't have more than 20 years' experience"}, {"url": "http://www1.salary.com/ga/Attorney-I-salary.html", "passage_text": "Georgia Attorney I Salaries. Within Georgia there is a lot of variation in Attorney I salaries. These variations depend on on a wide range of factors from population to general competitiveness in the market. Below is a map displaying a few key cities in Georgia and surrounding states, click on any one to find Attorney I Salaries for that area."}, {"url": "http://www.reddylaw.net/employment-labor-law/wage-law/wage-hour-law/", "passage_text": "Exempt job duties must be executive, professional or administrative in nature, and the FLSA details the specific aspects of this classification. Conversely, non-exempt employees are entitled to minimum wage and overtime pay. The current U.S. Federal minimum wage is $7.25 per hour. Georgia state minimum wage is $5.15. However, because the federal amount is higher, all GA employees are entitled to at least $7.25. In addition, nonexempt employees must receive overtime compensation at a rate of one and one-half times their normal pay rate for any hours worked beyond 40 each week."}, {"url": "http://www.atlanta-overtime-lawyer.com/home.html", "passage_text": "Many employers try to avoid paying overtime by simply paying their employees a salary, even though the employees are working more than 40 hours per week. In such cases, the employees may still be entitled to overtime pay if they are non-exempt-i.e., they do not meet any of the FLSA's overtime exemptions. The federal minimum wage for covered non-exempt employees is $7.25 per hour effective July 24, 2009. Many states also have minimum wage laws. Where an employee is subject to both the state and federal minimum wage laws, the employee is entitled to the higher minimum wage rate."}]