[{"url": "http://www.k12.wa.us/WorldLanguages/WLinWashington.aspx", "passage_text": "What Languages are Taught in Washington State? For data on languages taught in K-12 schools in Washington state, visit the Mapping and Enhancing Language Learning (MELL) project at the University of Washington, which is surveying schools to learn what languages are taught where in our state. You will likely need to take both the WEST-E for World Languages and ACTFL OPI and WPT (see links above). If Pathway 1, submit an application. If Pathway 2, contact a college that offers the Pedagogical Assessment for World Languages. Note: If you have trouble locating a college, contact worldlanguage@k12.wa.us."}, {"url": "http://www.city-data.com/states/Washington-Languages.html", "passage_text": "In 2000, English was the language spoken at home by 86% of Washington residents five years old and older, down from 91% in 1990. The category Other Slavic languages includes Czech, Slovak, and Ukrainian. The category African languages includes Amharic, Ibo, Twi, Yoruba, Bantu, Swahili, and Somali."}, {"url": "http://www.k12.wa.us/WorldLanguages/", "passage_text": "Learning Standards Washington state has adopted the national Standards for Foreign Language Learning in the 21st Century as our World Languages K-12 Learning Standards. Competency Credits. Sign up for email alerts World Languages Learning to communicate in languages of the world helps students in Washington become global citizens, ready for life in the interconnected world of the 21st century."}, {"url": "http://spokanelanguage.com/", "passage_text": "Welcome friends! Enjoy learning the Spokane language. Spokane is the westernmost dialect of a language continuum extending from Montana to Washington State. Sister dialects are Kalispel and Flathead. We are located in Wellpinit, Washington. Our reservation is between the confluence of the Columbia and Spokane Rivers in eastern Washington State. "}, {"url": "http://www.migrationpolicy.org/research/top-languages-spoken-english-language-learners-nationally-and-state", "passage_text": "Download Fact Sheet. While the languages spoken by English Language Learner (ELL) students in the United States are very diverse, Spanish is the most common first or home language, spoken by 71 percent of ELL students. "}, {"url": "http://www.k12.wa.us/WorldLanguages/WLinWashington.aspx", "passage_text": "Prospective world languages teachers need to earn a Washington State Teaching Certificate with a P-12 Designated World Language Endorsement in order to teach in a public K-12 school in Washington State and be considered “highly qualified.” Here are some steps to guide you: You will likely need to take both the WEST-E for World Languages and ACTFL OPI and WPT (see links above). If Pathway 1, submit an application. If Pathway 2, contact a college that offers the Pedagogical Assessment for World Languages. Note: If you have trouble locating a college, contact worldlanguage@k12.wa.us."}, {"url": "http://census.gov/topics/population/language-use.html", "passage_text": "Read More. Most people in the United States speak English and most governmental functions are in English. The bureau collects data on language use to know what languages to use, and where, to get information to people about public health, voting, and safety. "}, {"url": "http://wamu.org/programs/metro_connection/12/11/30/do_you_speak_dc_georgetown_linguists_study_washington_area_language", "passage_text": "Contributors to The Language and Communication in the Washington, D.C., Metropolitcan Area (LCDC) Project have been collecting and analyzing interviews from hundreds of Washingtonians. (L to R: Patrick Callier, Sinae Lee, Anastasia Nylund, Natalie Schilling, Jessica Grieser, Jinsok Lee, Mackenzie Price, Amelia Tseng). And ever since D.C. became the nation's capital in 1791, its language and identity have been richly influenced by African American culture. Some people would say that Washington speech is African American speech, she says. And the most probably distinctive is some of the local words."}, {"url": "http://www.city-data.com/states/Washington-Languages.html", "passage_text": "Northern and Midland dialects dominate, with Midland strongest in eastern Washington and the Bellingham area, Northern elsewhere. In the urban areas, minor eastern variants have been lost; in rural sections, however, older people have preserved such terms as johnnycake (corn bread) and mouth organ (harmonica). The category Other Slavic languages includes Czech, Slovak, and Ukrainian. The category African languages includes Amharic, Ibo, Twi, Yoruba, Bantu, Swahili, and Somali."}, {"url": "http://www.k12.wa.us/WorldLanguages/", "passage_text": "Early Learning Language Experiences Washington schools that receive state funding for full-day kindergarten are required to provide experiences in a world language other than English. Laws/Regulations Find out about current laws and regulations regarding world languages. Sign up for email alerts World Languages Learning to communicate in languages of the world helps students in Washington become global citizens, ready for life in the interconnected world of the 21st century."}]