[{"url": "http://www.answers.com/Q/What_battles_took_place_in_Italy_in_World_War_2", "passage_text": "After the the allied invasion of Sicily many battles took place. Invasion of Sicily-Invasion of Italy-Armistice with Italy-Volturno Line-Barbara Line-Bari Raid-Bernhardt Line-Monte Cassino-Anzio-Trasimene Line-Gothic Line-Spring offensive 1945. "}, {"url": "https://en.wikipedia.org/wiki/Italian_Campaign_%28World_War_II%29", "passage_text": "From Wikipedia, the free encyclopedia. The Italian Campaign was the name of Allied operations in and around Italy during the Second World War, from 1943 to the end of the war in Europe. After the capture of Rome, and the invasion of Normandy in June, the US VI Corps and the French Expeditionary Corps, which together amounted to seven divisions, were pulled out of Italy during the summer of 1944 to participate in Operation Dragoon, the Allied invasion of Southern France."}, {"url": "https://en.wikipedia.org/wiki/Allied_invasion_of_Italy", "passage_text": "On 8 September (before the main invasion), the surrender of Italy to the Allies was announced, first by Eisenhower, then in the Badoglio Proclamation by the Italian government. Italian units ceased combat and the Navy sailed to Allied ports to surrender. The Allied invasion of Sicily in July 1943, codenamed Operation Husky, was highly successful, although many of the Axis forces managed to avoid capture and escape to the mainland. To the Axis, this was viewed as a success."}, {"url": "http://historywarsweapons.com/allied-invasion-of-italy/", "passage_text": "Allied Invasion of Italy. The Allied invasion of Italy took place on September 3, 1943, in southern Italy, during World War II. It was carried out by the 15th Army Group, under the command of British General Harold Alexander. The main operation was code named Operation Avalanche and its invading force landed on the beaches near Salerno. The Allied invasion of Italy would be conducted by the 15th Army Group, which was composed of two armies: the British 8th Army, under the command of Bernard Montgomery, and the US 5th Army, commanded by Mark Clark."}, {"url": "http://www.history.com/topics/world-war-ii/invasion-of-sicily", "passage_text": "Introduction. After defeating Italy and Germany in the North African Campaign (November 8, 1942-May 13, 1943) of World War II (1939-45), the United States and Great Britain, the leading Allied powers, looked ahead to the invasion of occupied Europe and the final defeat of Nazi Germany. When the Allies won the North African Campaign on May 13, 1943, a quarter-million German and Italian troops surrendered at Tunisia, on the north coast of Africa."}, {"url": "https://en.wikipedia.org/wiki/Italian_Campaign_%28World_War_II%29", "passage_text": "Joint Allied Forces Headquarters (AFHQ) was operationally responsible for all Allied land forces in the Mediterranean theatre, and it planned and commanded the invasion of Sicily and the campaign on the Italian mainland until the surrender of German forces in Italy in May 1945. After the capture of Rome, and the invasion of Normandy in June, the US VI Corps and the French Expeditionary Corps, which together amounted to seven divisions, were pulled out of Italy during the summer of 1944 to participate in Operation Dragoon, the Allied invasion of Southern France."}, {"url": "http://war.by-airforce.com/articles/Italy-1943.html", "passage_text": "Battle of Italy The Allied invasion of Italy, was the Allied invasion of mainland Italy in September 1943, following the successful invasion of Sicily during the Italian Campaign."}, {"url": "http://historywarsweapons.com/battle-of-anzio/", "passage_text": "Battle of Anzio. The Battle of Anzio was a battle of the Second World War which took place during the Italian Campaign in the area near Anzio. It was fought between the Allied forces of Great Britain and the United States and the German troops deployed in Italy from January 22, 1944, to June 5, 1944. By the end of 1943, after the Allied invasion of Italy at Salerno, the advance of the American and British forces had ground to halt at the Gustav Line, which was the German defensive line that ran across Italy."}, {"url": "http://www.history.com/topics/world-war-ii/invasion-of-sicily", "passage_text": "The Allies’ Italian Campaign began with the invasion of Sicily in July 1943. After 38 days of fighting, the U.S. and Great Britain successfully drove German and Italian troops from Sicily and prepared to assault the Italian mainland. When the Allies won the North African Campaign on May 13, 1943, a quarter-million German and Italian troops surrendered at Tunisia, on the north coast of Africa."}]