[{"url": "http://www.ancestry.com/name-origin?surname=skelton", "passage_text": "Skelton Name Meaning. Northern English: habitational name from places in Cumbria and Yorkshire, originally named with the same elements as Shelton, but with a later change of ‘s’ to ‘sk’ under Scandinavian influence."}, {"url": "http://www.imdb.com/name/nm0804026/bio", "passage_text": "The son of a former circus clown turned grocer and a cleaning woman, Red Skelton was introduced to show business at the age of seven by Ed Wynn, at a vaudeville show in Vincennes. At age 10, he left home to travel with a medicine show through the Midwest, and joined the vaudeville circuit at age 15."}, {"url": "http://www.maplandia.com/united-kingdom/england/yorkshire-and-humberside/york/skelton/", "passage_text": "detailed map of Skelton and near places. Welcome to the Skelton google satellite map! This place is situated in York, Yorkshire and Humberside, England, United Kingdom, its geographical coordinates are 54° 0' 0 North, 1° 8' 0 West and its original name (with diacritics) is Skelton. See Skelton photos and images from satellite below, explore the aerial photographs of Skelton in United Kingdom."}, {"url": "http://www.ancestry.com/name-origin?surname=skelton", "passage_text": "You can find out where the majority of the Skelton families were living before they immigrated to the U.S and learn where to focus your search for foreign records. Immigration records can tell you an ancestor's name, ship name, port of departure, port of arrival, and destination. from the New York Passenger Lists."}, {"url": "https://en.wikipedia.org/wiki/Klem_Kadiddlehopper", "passage_text": "Skelton's radio career began in 1937 with a guest appearance on The Fleischmann's Yeast Hour which led to his becoming the host of Avalon Time in 1938. He became the host of The Raleigh Cigarette Program in 1941 where many of his comedy characters were created and had a regularly scheduled radio program until 1957."}, {"url": "https://en.wikipedia.org/wiki/Klem_Kadiddlehopper", "passage_text": "Skelton moved his program to NBC, where he completed his last year with a regularly scheduled television show in 1971. After he no longer had a television program, Skelton's time was spent making up to 125 personal appearances a year and on his artwork."}, {"url": "http://www.imdb.com/name/nm0804026/bio", "passage_text": "According to Skelton, in his appearance with Johnny Carson rebroadcast on TCM 7/19/14, his real name was Richard Red Skelton -- Red was really his middle name. When a teacher insisted he come up with a real middle name, he chose Bernard from the name of a local clothier, and the teacher was satisfied."}]