[{"url": "http://www.babynology.com/meaning-aadya-f30.html", "passage_text": "List of Hindu baby names, Hindu baby boy names (male), girl names (female) & Hindu names meanings has been compiled from various resources. Please use this list of Hindu baby names only for reference/idea to name your kid/child. Database of baby names has been compiled from various references and suggestions provided by our web site visitors and resources partners. Meaning of Aadya in Hindu origin/culture for Girl name with history and fame details. "}, {"url": "http://www.indiachildnames.com/name.aspx?name=Aadya", "passage_text": "Show similar names Show variant names. Name Aadya generally means Goddess Parvati or Name of Aadisakti, is of Indian origin, Name Aadya is a Feminine (or Girl) name. Person with name Aadya are mainly Hindu by religion. Name Aadya belongs to rashi Mesh (Aries) with dominant planet Mars (Mangal) . Find qualities of Aries (Mesh) or Find Numerology, Lucky number, lucky days, lucky color, Auspicious stones for Aadya or Find Chinese zodiac sign or Birthstone for your birthday or Find compatibility of Mesh (Aries) with other zodiac signs."}, {"url": "http://www.thenamemeaning.com/adhya/", "passage_text": "Instead, we recommend that you pay a greater attention to the origin and meaning of the name Adhya. Read our baby name articles for useful tips regarding baby names and naming your baby. If you are thinking of giving your baby the beautiful name Adhya, spread the love and share this with your friends. Search comprehensively and find the name meaning of Adhya and its name origin or of any other name in our database. Also note the spelling and the pronunciation of the name Adhya and check the initials of the name with your last name to discover how it looks and sounds."}, {"url": "http://www.ebabynames.com/#!meaning-of-Aadhya", "passage_text": "Its origin is  Variant of the Sanskrit name Adhya . Aadhya is a form of Adhya and is generally pronounced like  ADH yah . This name is mostly being used as a girls name. Last year it ranked 1,338th in the U.S. Social Security Administration list of most popular baby girl names. "}, {"url": "http://astrobix.com/name/meaning/Aadya", "passage_text": "Meaning of Indian name: Aadya. Meaning of the name Aadya is 'The earliest, Lord Shiva'. Aadya is a name of Hindu / Indian origin, and is commonly used for males. The name number for Aadya is '5'. Click here to get the numerological analysis for the name 'Aady"}, {"url": "http://www.ebabynames.com/#!meaning-of-Aadya", "passage_text": "The meaning of Aadya is . The first  and  Mother of the Earth . Its origin is  Sanskrit . Aadya is a form of Adya and is generally pronounced like  AHD yah . This name is mostly being used as a girls name. Last year it ranked 1,886th in the U.S. Social Security Administration list of most popular baby girl names."}, {"url": "http://www.babynology.com/meaning-aadhya-f30.html", "passage_text": "List of Hindu baby names, Hindu baby boy names (male), girl names (female) & Hindu names meanings has been compiled from various resources. Please use this list of Hindu baby names only for reference/idea to name your kid/child. Database of baby names has been compiled from various references and suggestions provided by our web site visitors and resources partners. Meaning of Aadhya in Hindu origin/culture for Girl name with history and fame details."}, {"url": "http://www.indiaparenting.com/babynames/meaning-of-Aadya.shtml", "passage_text": "Meaning of name Aadya, Origin of name Aadya, Personality of name Aadya, Gallery of Cute Indian Baby Pictures of Aadya and adorable Baby Photos of Aadya. All this and lots more... If you believe in Numerology, click to see if the name Aadya is lucky! "}]