[{"url": "http://www.philsmithroofing.com/products/fiberglass-laminated-shingles", "passage_text": "Fiberglass Laminated Shingles. Fiberglass laminated shingles are the most common roofing material used currently on the West Coast. Roughly 85% of our clients go with a Fiberglass laminated shingle."}, {"url": "http://www.wisegeek.com/what-are-laminated-shingles.htm", "passage_text": "Laminated shingles are a type of roofing shingles that are stronger and more decorative than traditional shingles. When installing laminated shingles, it is important to remove the old shingles first, as the extra weight may be too much for the roof. View slideshow of images above."}, {"url": "http://www.qualitysmith.com/request/article/compare-laminated-architectural-and-3-tab-composition-asphalt-shingles/", "passage_text": "Many homeowners are unsure whether they should choose laminated architectural shingles or 3-tab composition asphalt shingles when they go for a roof replacement or build a new roof. The truth is that there are a number of advantages to both."}, {"url": "http://www.qualitysmith.com/request/article/compare-laminated-architectural-and-3-tab-composition-asphalt-shingles/", "passage_text": "shingles are also sometimes referred to as laminated architectural shingles, or as dimensional or composite shingles. This type of shingle is constructed with a heavy base mat affixed to multiple material layers of asphalt to create a layered, three-dimensional look."}, {"url": "http://www.wisegeek.com/what-are-laminated-shingles.htm", "passage_text": "Top 10 amazing movie makeup transformations. Laminated shingles, also known as architectural shingles, are a type of shingle that provides more support than the traditional, 3-tab strip shingle and gives the illusion of a slate or wooden roof for only a fraction of the cost."}, {"url": "https://parkerjohnstonroofing.com/residential/product-gallery/laminate-shingle/", "passage_text": "Fiberglass laminate shingles are quickly becoming the most popular shingle in the residential and light commercial roofing market."}, {"url": "http://www.lodderoofing.com/blog/3-tab-shingles-vs-laminate-shingles/", "passage_text": "Laminate shingles are also known as “laminated architectural” or just “architectural” shingles. They are a type of asphalt shingle, but are built with a heavier base mat and multiple material layers of a more refined type of asphalt."}]