[{"url": "http://www.sourcewatch.org/index.php/Greenpeace", "passage_text": "History. Greenpeace was founded in 1971 following a group of activists sailing an old fishing boat, the Phyllis Cormack, from Vancouver towards the island of Amchitka, Alaska in protest against proposed US underground nuclear testing. [1]."}, {"url": "http://www.answers.com/Q/Who_founded_Greenpeace", "passage_text": "Greenpeace was founded in Vancouver, Canada. Greenpeace is a non-governmental environmental organization. Greenpeace evolved from the peace movement and anti-nuclear protests … in Vancouver, British Columbia, in the early 1970s."}, {"url": "http://www.answers.com/Q/In_which_country_was_Greenpeace_founded", "passage_text": "On September 15, 1971, the newly founded Don't Make a Wave Committee sent a chartered ship, Phyllis Cormack, renamed Greenpeace for the protest, from Vancouver to oppose United States testing of nuclear devices in Amchitka, Alaska. The Don't Make a Wave Committee subsequently adopted the name Greenpeace. Greenpeace is a non-governmental environmental organization. Greenpeace evolved from the peace movement and anti-nuclear protests in Vancouver, British Columbia, in the early 1970s."}, {"url": "http://www.answers.com/Q/In_which_country_was_Greenpeace_founded", "passage_text": "Greenpeace was founded in Vancouver, Canada. Greenpeace is a non-governmental environmental organization. Greenpeace evolved from the peace movement and anti-nuclear protests in Vancouver, British Columbia, in the early 1970s."}, {"url": "http://wanttoknowit.com/who-founded-greenpeace/", "passage_text": "Who founded Greenpeace. Greenpeace was first founded to oppose the United States testing nuclear devices in Alaska. It was founded in Vancouver, British Columbia, Canada in 1971. Greenpeace was founded by many of the co-founders of the Don’t Make a Wave Committee. The founders of Greenpeace include Dorothy Stowe, Irving Stowe, Marie Bohlen, Jim Bohlen, Ben Metcalfe, Dorothy Metcalfe, Patrick Moore, Bob Hunter and Bill Darnell. Greenpeace (originally the Greenpeace Foundation) is a group of environmentalists who tackle important environmental issues such as whaling, bottom trawling, nuclear testing, nuclear power and global warming. Greenpeace has a presence across the globe with 28 national and regional offices around the world."}, {"url": "http://scienceblogs.com/gregladen/2014/06/27/who-founded-greenpeace-not-patrick-moore/", "passage_text": "It had a ship called Greenpeace at that time, however the organisation Greenpeace was not formed until 4 May 1972. You will note from the link you sent that Patrick Moore joined the Don’t Make a Wave Committee in 1971. As such, he was a core member at the time Greenpeace was founded in 1972. Patrick Moore Did Not Found Greenpeace Patrick Moore frequently portrays himself as a founder or co-founder of Greenpeace, and many news outlets have repeated this characterization. Although Mr. Moore played a significant role in Greenpeace Canada for several years, he did not found Greenpeace."}, {"url": "http://scienceblogs.com/gregladen/2014/06/27/who-founded-greenpeace-not-patrick-moore/", "passage_text": "Phil Cotes, Irving Stowe, and Jim Bohlen founded Greenpeace in 1970 http://www.greenpeace.org/international/en/about/history/Patrick-Moore-background-information/ For starters, it’s Paul Cotes, not Phil. Patrick Moore Did Not Found Greenpeace Patrick Moore frequently portrays himself as a founder or co-founder of Greenpeace, and many news outlets have repeated this characterization. Although Mr. Moore played a significant role in Greenpeace Canada for several years, he did not found Greenpeace."}, {"url": "http://wanttoknowit.com/who-founded-greenpeace/", "passage_text": "25 Jun, 2008 who founded 0. Greenpeace (originally the Greenpeace Foundation) is a group of environmentalists who tackle important environmental issues such as whaling, bottom trawling, nuclear testing, nuclear power and global warming. Greenpeace has a presence across the globe with 28 national and regional offices around the world."}, {"url": "http://www.answers.com/Q/Who_founded_Greenpeace", "passage_text": "On September 15, 1971, the newly founded Don't Make a Wave Committee sent a chartered ship, Phyllis Cormack, renamed Greenpeace for the protest, from Vancouver to oppose United States testing of nuclear devices in Amchitka, Alaska. Greenpeace is a non-governmental environmental organization. Greenpeace evolved from the peace movement and anti-nuclear protests … in Vancouver, British Columbia, in the early 1970s."}, {"url": "https://en.wikipedia.org/wiki/Greenpeace", "passage_text": "Greenpeace is an independent global campaigning organization that acts to change attitudes and behaviour, to protect and conserve the environment and to promote peace by: Catalysing an energy revolution to address the number one threat facing our planet: climate change. Since Greenpeace was founded, seagoing ships have played a vital role in its campaigns. Now that the Rainbow Warrior III has been completed, the group has three ocean-going ships, the Esperanza, Arctic Sunrise and Rainbow Warrior III."}]