[{"url": "http://www.mayoclinic.org/diseases-conditions/down-syndrome/basics/definition/con-20020948", "passage_text": "The genetic basis of Down syndrome. Down syndrome is a genetic disorder caused when abnormal cell division results in extra genetic material from chromosome 21. This genetic disorder, which varies in severity, causes lifelong intellectual disability and developmental delays, and in some people it causes health problems.own syndrome is the most common genetic chromosomal disorder and cause of learning disabilities in children. Better understanding of Down syndrome and early interventions can greatly increase the quality of life for children and adults with this disorder and help them live fulfilling lives. 1  Symptoms."}, {"url": "http://www.mayoclinic.org/diseases-conditions/down-syndrome/basics/definition/con-20020948", "passage_text": "Down syndrome is the most common genetic chromosomal disorder and cause of learning disabilities in children. Better understanding of Down syndrome and early interventions can greatly increase the quality of life for children and adults with this disorder and help them live fulfilling lives. 1  Symptoms. "}, {"url": "http://www.medicalnewstoday.com/articles/145554.php", "passage_text": "The most common form of Down syndrome is known as Trisomy 21, a condition where individuals have 47 chromosomes in each cell instead of 46. This is caused by an error in cell division called nondisjunction, which leaves a sperm or egg cell with an extra copy of chromosome 21 before or at conception. Trisomy 21 accounts for 95% of Down syndrome cases, with 88% originating from nondisjunction of the mother's egg cell."}, {"url": "http://www.mayoclinic.org/diseases-conditions/down-syndrome/basics/causes/CON-20020948", "passage_text": "1 About 95 percent of the time, Down syndrome is caused by trisomy 21 — the child has three copies of chromosome 21 (instead of the usual two copies) in all cells. 2  This is caused by abnormal cell division during the development of the sperm cell or the egg cell. 3  Mosaic Down syndrome. It's caused by a mistake in cell division during the development of the egg, sperm or embryo. Translocation Down syndrome is the only form of the disorder that can be passed from parent to child. However, only about 4 percent of children with Down syndrome have translocation."}, {"url": "http://www.medicalnewstoday.com/articles/145554.php", "passage_text": "Down syndrome (or Down's syndrome) is a chromosomal disorder caused by an error in cell division that results in an extra 21st chromosome. This is caused by an error in cell division called nondisjunction, which leaves a sperm or egg cell with an extra copy of chromosome 21 before or at conception. Trisomy 21 accounts for 95% of Down syndrome cases, with 88% originating from nondisjunction of the mother's egg cell."}, {"url": "http://www.medicalnewstoday.com/articles/145554.php", "passage_text": "Knowledge center. Down syndrome (or Down's syndrome) is a chromosomal disorder caused by an error in cell division that results in an extra 21st chromosome. The condition leads to impairments in both cognitive ability and physical growth that range from mild to moderate developmental disabilities. This is caused by an error in cell division called nondisjunction, which leaves a sperm or egg cell with an extra copy of chromosome 21 before or at conception. Trisomy 21 accounts for 95% of Down syndrome cases, with 88% originating from nondisjunction of the mother's egg cell."}, {"url": "http://genetics.thetech.org/ask/ask104", "passage_text": "-A curious adult from California. Down syndrome is a common genetic cause of mental retardation. It is caused by an extra chromosome 21, which has hundreds of genes. Scientists are actively trying to find which specific genes are responsible for the disease. Once found, researchers might be able to develop ways to block these extra genes. "}, {"url": "https://en.wikipedia.org/wiki/Down_syndrome", "passage_text": "Down syndrome (DS or DNS) or Down's syndrome, also known as trisomy 21, is a genetic disorder caused by the presence of all or part of a third copy of chromosome 21. It is typically associated with physical growth delays, characteristic facial features, and mild to moderate intellectual disability. "}, {"url": "http://ghr.nlm.nih.gov/condition/down-syndrome", "passage_text": "People with translocation Down syndrome can inherit the condition from an unaffected parent. The parent carries a rearrangement of genetic material between chromosome 21 and another chromosome. This rearrangement is called a balanced translocation. A very small percentage of people with Down syndrome have an extra copy of chromosome 21 in only some of the body's cells. In these people, the condition is called mosaic Down syndrome."}]