[{"url": "http://www.tutorialspoint.com/java/java_exceptions.htm", "passage_text": "The code which is prone to exceptions is placed in the try block, when an exception occurs, that exception occurred is handled by catch block associated with it. Every try block should be immediately followed either by a class block or finally block. The previous statements demonstrate three catch blocks, but you can have any number of them after a single try. If an exception occurs in the protected code, the exception is thrown to the first catch block in the list."}, {"url": "http://interview.fyicenter.com/4359_Java_Is_it_necessary_that_each_try_block_must_be_followed_b.html", "passage_text": "by it is not necessary that each try block must be followed by a catch block it should be followed by either a catch block or a finally block and whatever exceptions are likely to be thrown should be declared in the throws clause of the method top java is it necessary that each try block must be followed by a catch block is it necessary that each try block must be followed by a catch block by"}, {"url": "http://allapplabs.com/interview_questions/java_interview_questions_4.htm", "passage_text": "In the second approach we are forcing the caller of the method to catch the exceptions, that the method is likely to throw. This is often the approach library creators use. They list the exception in the throws clause and we must catch them. You will find the same approach throughout the java libraries we use. An unhandled exception moves up the method stack in search of a matching When an exception is thrown from a code which is wrapped in a try block followed by one or more catch blocks, a search is made for matching catch block."}, {"url": "http://www.javatpoint.com/finally-block-in-exception-handling", "passage_text": "Java finally block is a block that is used to execute important code such as closing connection, stream etc. Java finally block is always executed whether exception is handled or not. Java finally block must be followed by try or catch block. "}, {"url": "http://beginnersbook.com/2013/04/try-catch-in-java/", "passage_text": "The try block contains a block of program statements within which an exception might occur. A try block is always followed by a catch block, which handles the exception that occurs in associated try block. 3. If multiple catch blocks are present in a program then the above mentioned catch block should be placed at the last as per the exception handling best practices. 4. If the try block is not throwing any exception, the catch block will be completely ignored and the program continues. 5."}, {"url": "http://beginnersbook.com/2013/04/try-catch-in-java/", "passage_text": "1 If an exception occurs in try block then the control of execution is passed to the catch block from try block. 2  The exception is caught up by the corresponding catch block. 3  A single try block can have multiple catch statements associated with it, but each catch block can be defined for only one exception class. 3. If multiple catch blocks are present in a program then the above mentioned catch block should be placed at the last as per the exception handling best practices. 4. If the try block is not throwing any exception, the catch block will be completely ignored and the program continues. 5."}, {"url": "http://allapplabs.com/interview_questions/java_interview_questions_4.htm", "passage_text": "It is not necessary that each try block must be followed by a catch block. It should be followed by either a catch block OR a finally block. And whatever exceptions are likely to be thrown should be declared in the throws clause of the method. An unhandled exception moves up the method stack in search of a matching When an exception is thrown from a code which is wrapped in a try block followed by one or more catch blocks, a search is made for matching"}, {"url": "http://www.javatpoint.com/corejava-interview-questions-3", "passage_text": "It is not necessary that each try block must be followed by a catch block. It should be followed by either a catch block OR a finally block. And whatever exceptions are likely to be thrown should be declared in the throws clause of the method. "}, {"url": "http://beginnersbook.com/2013/04/try-catch-in-java/", "passage_text": "A catch block must be associated with a try block. The corresponding catch block executes if an exception of a particular type occurs within the try block. For example if an arithmetic exception occurs in try block then the statements enclosed in catch block for arithmetic exception executes. 3. If multiple catch blocks are present in a program then the above mentioned catch block should be placed at the last as per the exception handling best practices. 4. If the try block is not throwing any exception, the catch block will be completely ignored and the program continues. 5."}]