[{"url": "http://www.ccfa.org/what-are-crohns-and-colitis/", "passage_text": "Crohn’s disease is a chronic inflammatory condition of the gastrointestinal tract and may affect any part from the mouth to the anus. Read more about the signs and symptoms of Crohn’s disease. Ulcerative colitis is a chronic inflammatory condition limited to the colon, otherwise known as the large intestine. Read more about the signs and symptoms of ulcerative colitis. It is often difficult to diagnose which form of IBD a patient is suffering from because both Crohn’s Disease and ulcerative colitis cause similar symptoms. Symptoms related to inflammation of the GI tract: 1  Diarrhea. 2  Rectal bleeding. 3  Urgent need to move bowels. 4  Abdominal cramps and pain."}, {"url": "http://www.cdc.gov/ibd/index.htm", "passage_text": "Inflammatory Bowel Disease (IBD) is a broad term that describes conditions with chronic or recurring immune response and inflammation of the gastrointestinal tract. The two most common inflammatory bowel diseases are ulcerative colitis and Crohn’s disease. Inflammation affects the entire digestive tract in Crohn’s disease and only the large intestine in ulcerative colitis. Both illnesses are characterized by an abnormal response to the body’s immune system. "}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/24938525", "passage_text": "Inflammatory bowel diseases (IBD), including Crohn's disease (CD) and ulcerative colitis (UC), are chronic, relapsing inflammatory condition of the gastrointestinal tract. "}, {"url": "http://www.mayoclinic.org/diseases-conditions/crohns-disease/basics/definition/CON-20032061", "passage_text": "Digestive Health. Subscribe to our Digestive Health e-newsletter to stay up to date on digestive health topics. Crohn's disease is an inflammatory bowel disease (IBD). It causes inflammation of the lining of your digestive tract, which can lead to abdominal pain, severe diarrhea, fatigue, weight loss and malnutrition. Inflammation caused by Crohn's disease can involve different areas of the digestive tract in different people. The inflammation caused by Crohn's disease often spreads deep into the layers of affected bowel tissue. Crohn's disease can be both painful and debilitating, and sometimes may lead to life-threatening complications."}, {"url": "http://www.webmd.com/ibd-crohns-disease/ss/slideshow-inflammatory-bowel-overview", "passage_text": "Inflammatory bowel disease (IBD) refers to chronic conditions that cause inflammation in some part of the intestines. The intestinal walls become swollen, inflamed, and develop ulcers, which can cause discomfort and serious digestive problems. The exact symptoms depend on which part of the digestive tract is involved. Crohn's disease is a form of IBD that can occur anywhere along the digestive tract -- from the mouth to the anus. It affects the deeper layers of the digestive lining and can occur as skip lesions between healthy areas."}, {"url": "http://www.ccfa.org/what-are-crohns-and-colitis/what-is-ulcerative-colitis/", "passage_text": "While both ulcerative colitis and Crohn’s disease are types of Inflammatory Bowel Diseases (IBD), they should not be confused with Irritable Bowel Syndrome (IBS), a disorder that affects the muscle contractions of the colon. IBS is not characterized by intestinal inflammation. "}, {"url": "http://www.ccfa.org/what-are-crohns-and-colitis/", "passage_text": "Crohn’s disease and ulcerative colitis are both major categories of Inflammatory Bowel Diseases (IBD). IBD affects an estimated 1.6 million Americans. These chronic diseases tend to run in families and they affect males and females equally. It is often difficult to diagnose which form of IBD a patient is suffering from because both Crohn’s Disease and ulcerative colitis cause similar symptoms. Symptoms related to inflammation of the GI tract: 1  Diarrhea. 2  Rectal bleeding. 3  Urgent need to move bowels. 4  Abdominal cramps and pain."}, {"url": "http://umm.edu/health/medical/reports/articles/crohns-disease", "passage_text": "All inflammatory bowel diseases cause chronic inflammation in the digestive system. Crohn’s disease most commonly occurs at the lower end of the small intestine (ileum) and the beginning of the large intestine (colon), but it can affect any part of the gastrointestinal tract (digestive system). "}, {"url": "http://www.cdc.gov/ibd/what-is-ibd.htm", "passage_text": "Inflammatory bowel disease (IBD) is a broad term that describes conditions with chronic or recurring immune response and inflammation of the gastrointestinal tract. The two most common inflammatory bowel diseases are ulcerative colitis and Crohn’s disease. Inflammation affects the entire digestive tract in Crohn’s disease and only the large intestine in ulcerative colitis. Both illnesses are characterized by an abnormal response to the body’s immune system. In Crohn's disease, all layers of the intestine may be involved and there can be normal healthy bowel between patches of diseased bowel. Symptoms include. 1  Persistent diarrhea (loose, watery, or frequent bowel movements). 2  Cramping abdominal pain."}, {"url": "http://www.webmd.com/ibd-crohns-disease/ss/slideshow-inflammatory-bowel-overview", "passage_text": "Types of IBD: Crohn's Disease. Crohn's disease is a form of IBD that can occur anywhere along the digestive tract -- from the mouth to the anus. It affects the deeper layers of the digestive lining and can occur as skip lesions between healthy areas. Crohn's often involves the small intestine, the colon, or both"}]