[{"url": "http://www.everydayhealth.com/drugs/diazepam", "passage_text": "1 A typical adult dose of Valium to treat muscle spasms may range from 2 to 10 mg three to four times a day. 2  A typical adult dose of Valium to treat seizures may range from 2 to 10 mg two to four times a day. 3  Older people or people with a chronic illness may take 2 to 2.5 mg once or twice a day. You can take Valium with or without food. In tablet form, Valium comes in 2-, 5-, and 10-milligram (mg) pills. Your dose will depend on the condition you have and your own response to Valium: 1  A typical adult dose of Valium to treat anxiety may range from 2 to 10 mg two to four times a day."}, {"url": "http://www.rxlist.com/valium-drug/indications-dosage.htm", "passage_text": "Depending upon severity of symptoms—2 mg to 10 mg, 2 to 4 times daily. Symptomatic Relief in Acute Alcohol Withdrawal. 10 mg, 3 or 4 times during the first 24 hours, reducing to 5 mg, 3 or 4 times daily as needed. Adjunctively for Relief of Skeletal Muscle Spasm. The effectiveness of Valium in long-term use, that is, more than 4 months, has not been assessed by systematic clinical studies. The physician should periodically reassess the usefulness of the drug for the individual patient."}, {"url": "http://www.nhtsa.gov/People/injury/research/job185drugs/diazepam.htm", "passage_text": "Potency, Purity and Dose: Commonly prescribed doses of Valium® are 5-40 mg daily. For anxiety, 2-10 mg is taken twice to four times daily; for alcohol withdrawal symptoms 10 mg is taken three to four times daily. For the injectable form, 2-20 mg is administered intramuscularly or intravenously."}, {"url": "http://www.everydayhealth.com/drugs/diazepam", "passage_text": "1 A typical adult dose of Valium to treat alcohol withdrawal may be 10 mg three to four times a day for 24 hours followed by 5 mg taken three to four times a day as needed. 2  A typical adult dose of Valium to treat muscle spasms may range from 2 to 10 mg three to four times a day. You can take Valium with or without food. In tablet form, Valium comes in 2-, 5-, and 10-milligram (mg) pills. Your dose will depend on the condition you have and your own response to Valium: 1  A typical adult dose of Valium to treat anxiety may range from 2 to 10 mg two to four times a day."}, {"url": "http://prescription-drug.addictionblog.org/how-much-valium-is-too-much/", "passage_text": "…But only at a low dose. At the highest dose I mixed 3 panadiene forte and 15 miligrams of Valium. I thought this was a little too much becaucse I slept very heavy for more than a normal length. 15 to 20 milligrams of Valium combined with 60 to 90 milligrams of codeine is survivable. The recommended daily dose of Valium is 4 to 40 mg throughout the day. People have been reported taking doses of up to 2000 mg and experiencing only minor toxicity. That’s about 50 times the maximum recommended daily dose. So Valium is incredibly safe and very difficult to overdose on if taken by itself."}, {"url": "http://www.everydayhealth.com/drugs/diazepam", "passage_text": "1 A typical adult dose of Valium to treat anxiety may range from 2 to 10 mg two to four times a day. 2  A typical adult dose of Valium to treat alcohol withdrawal may be 10 mg three to four times a day for 24 hours followed by 5 mg taken three to four times a day as needed. You can take Valium with or without food. In tablet form, Valium comes in 2-, 5-, and 10-milligram (mg) pills. Your dose will depend on the condition you have and your own response to Valium: 1  A typical adult dose of Valium to treat anxiety may range from 2 to 10 mg two to four times a day."}, {"url": "http://www.psychtreatment.com/valium_dosage.htm", "passage_text": "The usual Valium dosage of this anti anxiety medicine is 10 mg, three or four times during the first 24 hours, and then 5 mg. three or four times daily as needed. Valium dosage for relief of muscle spasms: The usual dose of this anti anxiety medicine for relief of muscle spasms is 2 mg to 10 mg three or four times daily. Convulsive disorders: The usual valium dosage for convulsive disorders is 2 milligrams to 10 mg two to four times daily. Children. Valium should never be given to children under the age of six months of age. The usual Valium dosage to start children over six months old is 1 to 2.5 mg three or four times a day."}, {"url": "http://www.rxlist.com/valium-drug/indications-dosage.htm", "passage_text": "INDICATIONS. Valium is indicated for the management of anxiety disorders or for the short-term relief of the symptoms of anxiety. Anxiety or tension associated with the stress of everyday life usually does not require treatment with an anxiolytic. The effectiveness of Valium in long-term use, that is, more than 4 months, has not been assessed by systematic clinical studies. The physician should periodically reassess the usefulness of the drug for the individual patient."}, {"url": "http://www.rxlist.com/valium-side-effects-drug-center.htm", "passage_text": "Valium (diazepam) is a medication belonging to the drug class benzodiazepine. Valium is available as a generic drug. Valium is prescribed for the treatment of anxiety, seizures, muscle spasms, and symptoms of alcohol withdrawal. Valium usual oral dose is 2-10 mg given 2-4 times daily. Drug interactions with Valium include alcohol, barbiturates, and narcotics, cimetidine (Tagamet), ketoconazole (Nizoral), omeprazole (Prilosec) fluvoxamine (Luvox), and fluoxetine (Prozac)."}]