[{"url": "http://endocrine-system.emedtv.com/pituitary-microadenoma/pituitary-microadenoma.html", "passage_text": "Treatment options can include surgery, drug therapy, and radiation therapy. A pituitary microadenoma is a benign (non-cancerous) growth in the pituitary gland that is smaller than 10 millimeters in size. A pituitary microadenoma differs from a pituitary macroadenoma, which is 10 millimeters or larger. Symptoms of the condition may include such things as headaches, vomiting, vision problems and dizziness. A pituitary microadenoma is a benign (non-cancerous) growth in the pituitary gland that is smaller than 10 millimeters in size."}, {"url": "http://www.cancer.org/cancer/pituitarytumors/detailedguide/pituitary-tumors-treating-general-info", "passage_text": "Treatment of a pituitary adenoma depends on whether or not it makes excess hormones and, if it does, which hormone it makes. Treatment also depends on whether it is a microadenoma (smaller than 1 centimeter across) or a macroadenoma (1 centimeter across or larger). Treatment for pituitary tumors may include: 1  Surgery. "}, {"url": "http://radiopaedia.org/articles/pituitary-microadenoma", "passage_text": "By definition a microadenoma is less than 10 mm in size. If the same tumour is greater than 10mm in size it is then considered a pituitary macroadenoma. Differences in presentation and imaging merely represent a difference in size rather than any fundamental difference in biology. A pituitary microadenoma is confined to the sella, and as such has no scope to produce symptoms due to mass effect."}, {"url": "http://www.mayoclinic.org/diseases-conditions/prolactinoma/basics/definition/CON-20028094", "passage_text": "Prolactinoma is a condition in which a noncancerous tumor (adenoma) of the pituitary gland in your brain overproduces the hormone prolactin. The major effect is decreased levels of some sex hormones — estrogen in women and testosterone in men. Prolactinoma is the most common type of hormone-producing tumor that can develop in your pituitary gland. Doctors can often treat prolactinoma with medications to restore your prolactin level to normal. Surgery to remove the pituitary tumor also might be an option."}, {"url": "http://emedicine.medscape.com/article/126702-overview", "passage_text": "Background. By definition, a microadenoma (seen in the image below) is a tumor less than 10 mm in diameter. Pituitary adenomas may secrete hormones, but most are clinically inactive. Many pituitary lesions are discovered while investigating other neurologic problems; these lesions are called incidentalomas. MRI showing a nonenhancing area in the pituitary consistent with a microadenoma in a patient with hyperprolactinemia. The microadenoma may be discovered during an investigation for the cause of a clinically diagnosed hypersecretory syndrome of hyperprolactinemia, acromegaly, or Cushing syndrome."}, {"url": "http://www.healtharticles101.com/pituitary-macroadenoma-causes-and-treatment/", "passage_text": "Pituitary gland surgery is one treatment for a tumor in the pituitary gland, and medications to control your hormone production can also help treat this condition. Another option is radiation treatments, to shrink the tumor and cause it to stop interfering with your pituitary function and hormone production amounts. "}, {"url": "http://www.wisegeekhealth.com/what-is-a-pituitary-microadenoma.htm", "passage_text": "Swerious thyroid problems can occur with ATCH-and TSH-producing tumors. Surgery to remove a pituitary microadenoma is a common course of treatment. Serious adrenal gland problems can occur with ATCH and TSH-producing tumors. A pituitary microadenoma is a very small, noncancerous tumor that forms in the pituitary gland. It is medically defined as a mass that is less than about 1 centimeter (10 millimeters) in diameter that grows slowly and does not carry any risk of metastasizing, or spreading, to other parts of the brain or body. As the pituitary gland is technically not part of the brain, pituitary tumors are not considered brain tumors. Some pituitary tumors are visible on MRI scans. Located in the head, the pea-sized pituitary gland produces hormones and regulates several other glands of the body's endocrine system."}, {"url": "https://en.wikipedia.org/wiki/Adenoma", "passage_text": "Adenoma is a benign tumor of glandular tissue, such as the mucosa of stomach, small intestine, and colon, in which tumor cells form glands or gland like structures. In hollow organs (digestive tract), the adenoma grows into the lumen-adenomatous polyp or polypoid adenoma. An adenoma (from Greek αδένας, adeno- , gland + -ώμα, -oma, tumor) (/ˌaedɨˈnoʊmə/ ; ˌædɨˈnoʊmə plural adenomas or /adenomata/) ˌaedɨˈnoʊmɨtə ˌædɨˈnoʊmɨtə is a benign tumor of epithelial tissue with, glandular origin, glandular characteristics. or both"}, {"url": "http://endocrine-system.emedtv.com/pituitary-microadenoma/pituitary-microadenoma.html", "passage_text": "A pituitary microadenoma is a noncancerous growth in the pituitary gland that is less than 10 mm in size. A pituitary microadenoma is a benign (non-cancerous) growth in the pituitary gland that is smaller than 10 millimeters in size. A pituitary microadenoma differs from a pituitary macroadenoma, which is 10 millimeters or larger. Symptoms of the condition may include such things as headaches, vomiting, vision problems and dizziness. A pituitary microadenoma is a benign (non-cancerous) growth in the pituitary gland that is smaller than 10 millimeters in size."}]