[{"url": "http://definitions.uslegal.com/m/medical-necessity/", "passage_text": "Medically necessary or medical necessity. A service is medically necessary or a medical necessity when it is reasonable and necessary to protect life, to prevent significant illness or significant disability, or to alleviate severe pain. Medical Necessity Law & Legal Definition. Medical necessity is a legal concept which refers to the health care services or products provided by a physician to a patient."}, {"url": "http://static.aapc.com/a3c7c3fe-6fa1-4d67-8534-a3c9c8315fa0/cfa2b133-ce13-47e1-90c1-4907eba70dbd/6b9dc000-0897-4c24-9f4a-519e1f3ab372.pdf", "passage_text": "10/10/20122 Wikipedia definition • Medical necessity is a United Stateslegal dtidoctrine, reltdlated to acti ititivities whi hhich may be justified as reasonable, necessary, and/or appropriate, based on evidence‐basedclinical standards of care. "}, {"url": "http://www.acmq.org/policies/policy8.pdf", "passage_text": "POLICY 8 Deﬁnition and Application of Medical Necessity Medical necessity is deﬁned as accepted health care services and supplies provided by health care entities, appropriate to the evaluation and treatment of a disease, condition, illness or injury and consistent with the applicable standard of care. Medical necessity is the standard terminology that all health care professionals and entities will use in the review process when determining if medical care is appropriate and essential.3."}, {"url": "http://medical-dictionary.thefreedictionary.com/Medical+necessity", "passage_text": "medical necessity. FDA-speak. A product is considered medically necessary, or to be a medical necessity, if it is used to treat or prevent a serious disease or medical condition, and if there is no other available source of that product or alternative drug or therapy judged by medical staff to be an adequate substitute. "}, {"url": "http://www.chpw.org/for-members/common-questions/what-is-medical-necessity-or-medically-necessary-care", "passage_text": "Medical necessity is used to describe care that is reasonable, necessary, and/or appropriate, based on evidence-based clinical standards of care. "}, {"url": "http://www.nolo.com/legal-encyclopedia/getting-approval-medicaid-services-medical-necessity.html", "passage_text": "Other common restrictions on states' definitions of medical necessity are prohibitions against experimental treatments, requirements that the treatment provide a significant benefit to the patient, and requirements that the treatment not be provided primarily for the patient's or doctor's convenience. Below we'll discuss how some states define medical necessity, but ultimately, your treating physician's opinion about whether a particular treatment is medically necessary will be the most important factor in getting Medicaid to pay for the treatment."}, {"url": "https://en.wikipedia.org/wiki/Medical_necessity", "passage_text": "Medical necessity is a United States legal doctrine, related to activities which may be justified as reasonable, necessary, and/or appropriate, based on evidence-based clinical standards of care. Other countries may have medical doctrines or legal rules covering broadly similar grounds. By statute, Medicare may only pay for items and services that are reasonable and necessary for the diagnosis or treatment of illness or injury or to improve the functioning of a malformed body member, unless there is another statutory authorization for payment."}, {"url": "http://www.nashp.org/medical-necessity/", "passage_text": "“Medical necessity means a Medical Assistance program good or service that will, or is reasonably expected to prevent, diagnose, cure, correct, reduce, or ameliorate the pain and suffering, or the physical, mental, cognitive, or developmental effects of an illness, injury, or disability. The state does not have a formal state-level medical necessity definition for Medicaid, deferring to clinical judgment and industry best practices. In discussing Medicaid-covered services, the New Jersey Administrative Code (N.J.A.C. 10:49-5.1) notes that:"}, {"url": "http://definitions.uslegal.com/m/medical-necessity/", "passage_text": "Medicare defines medical necessity as services or items reasonable and necessary for the diagnosis or treatment of illness or injury or to improve the functioning of a malformed body member. The following is an example of a State Statute (California) on medical necessity: Cal Wel & Inst Code § 14059.5. Medical Necessity Law & Legal Definition. Medical necessity is a legal concept which refers to the health care services or products provided by a physician to a patient."}]