[{"url": "http://www.eng-tips.com/viewthread.cfm?qid=292822", "passage_text": "RE: Maximum Deflection in a Beam. The steel construction manual does not provide deflection limits as those are a serviceability limit state, not a strength limit state. The IBC specifies a few basic minimum deflection limits for floors and roofs (of which L/360 or 1 is one); however, these are minimum code limits. What is the maximum deflection in a beam in bending according to AISC Steel Construction Manual 13th edition."}, {"url": "http://www.spanco.com/blog/entry/understanding-overhead-crane-deflection-and-criteria", "passage_text": "That number is divided by the deflection limit of 400. For example, to determine the deflection for a ceiling-mounted workstation bridge crane with bridge length of 40 feet, we must first translate the unit of measurement to inches. A 40-foot span is equivalent to 480 inches. The deflection for a 34-foot bridge on a workstation bridge crane can be determined by first changing the unit of measurement from feet to inches. A 34-foot bridge is 408 inches long (feet x 12= inches). Divide 408 inches by the specified deflection limit for enclosed bridge cranes (L/450)."}, {"url": "http://www.bgstructuralengineering.com/BGSCM13/BGSCM008/Deflection/BGSCM0080402.htm", "passage_text": "These tolerances generally are expressed in terms as a maximum deflection value and must be considered in design. For example, a floor girder spanning 36 ft may deflect up to 1.2 inches under a live load only deflection limit of L/360. Any non-structural partition under the beam must be able to accommodate this deflection."}, {"url": "http://forums.finehomebuilding.com/breaktime/general-discussion/what-does-l360-deflection-mean", "passage_text": "The deflection for exposed ceiling beams at the roof is often allowed to be 50% to 100% greater (l/240 or l/180). Codes usually specify that these deflections are based on live load only, but experience shows that this is sometimes excessive. I am trying to figure out what L/360 means in terms of deflection in wood beams. When I am looking at the criteria for engineered wood beams these different ratings are used (L/360, L/480, etc)."}, {"url": "http://homeguides.sfgate.com/ceiling-framing-l-360-deflection-101856.html", "passage_text": "When building codes set a deflection limit, such as L/360, they do so assuming that framing won't be subject to loads in excess of a certain amount. These maximum loads, like the deflection limits themselves, can vary by room and construction. The L/X Formula. The maximum allowable deflection of a ceiling is expressed as a fraction in the format L/X. The L is the length, in inches, of the clear span of the joists or rafters that make up the ceiling framing."}, {"url": "https://en.wikipedia.org/wiki/Deflection_(engineering)", "passage_text": "It may refer to an angle or a distance. The deflection distance of a member under a load is directly related to the slope of the deflected shape of the member under that load and can be calculated by integrating the function that mathematically describes the slope of the member under that load. The deflection of beam elements is usually calculated on the basis of the Euler–Bernoulli beam equation while that of a plate or shell element is calculated using plate or shell theory. An example of the use of deflection in this context is in building construction."}, {"url": "http://homeguides.sfgate.com/ceiling-framing-l-360-deflection-101856.html", "passage_text": "Deflection is the degree to which a building material bends when it bears a load. A trampoline floor would have high deflection; a stone slab would have fairly low deflection. Building codes set the maximum deflection allowed for the framing of a home under the kinds of loads that can be expected in a residence. Typically, codes set deflection limits for roofs, walls and floors. The L/X Formula. The maximum allowable deflection of a ceiling is expressed as a fraction in the format L/X. The L is the length, in inches, of the clear span of the joists or rafters that make up the ceiling framing."}, {"url": "http://cenews.com/article/8679/roof-member-deflection-limits", "passage_text": "The intent is that the deflection limit applies to the design roof live load (Lr), which could be a reduced live load. For example, if a ridge beam supporting an open rafter ceiling was designed for a reduced live load of 16 psf, it would be checked for l /180 based on deflection limit criteria. In fact, the rafter span tables are based on these deflection limits for various conditions. The deflection limit predates the specific notation used for live loads in the IBC, which probably originated with ASCE 7. (Lr is not used in the 1994 UBC. See Section 1605, Tables 16-C and 16-D)."}, {"url": "http://people.tamu.edu/~mhaque/cosc421/DEFLECTION.pdf", "passage_text": "Dr. Mohammed E. Haque, P.E. (Deflection) Page 1 of 4 DEFLECTION A structure must be serviceable in addition to being safe. A serviceable structure performs satisfactorily without causing any discomfort or perceptions of un-safety for the occupants or users of the structure. For a beam, being serviceable usually means that the deformation (primarily vertical sag) must be limited. According to International Building Code (ICB 2000), some of the typical deflection limits are: Members Max. Live Load defl. Max."}]