[{"url": "http://www.merriam-webster.com/dictionary/lychee", "passage_text": "Full Definition of LYCHEE. 1. : the oval fruit of a Chinese tree (Litchi chinensis) of the soapberry family having a hard scaly reddish outer covering and sweet whitish edible flesh that surrounds a single large seed —called also lychee nut. 2. : a tree bearing lychees. See lychee defined for English-language learners."}, {"url": "http://www.nutrition-and-you.com/Lychee.html", "passage_text": "Lychee fruit-interior. Note for dark brown color seed with smooth surface. Its outer skin is rough leathery rind or peel, featuring pink color. Its peel can be detached easily in the ripe berries. Inside, its flesh consists of edible portion or aril that is white, translucent, sweet, and juicy. Health benefits of Lychee. Lychee fruit contains 66 calories per 100 g, comparable to that in the table-grapes. It has no saturated fats or cholesterol, but composes of good amounts of dietary fiber, vitamins, and antioxidants."}, {"url": "http://foodfacts.mercola.com/lychee.html", "passage_text": "Botanical name: Litchi chinensis Sometimes known as litchi or a similar spelling variation, the exotic lychee fruit is from the soapberry family. The evergreen trees they grow on can reach 100 feet, and produce red or pale orange fruits with a tough, bumpy, easily peeled skin resembling large raspberries. Fresh or dried, lychees can be chopped into fruit or green salads. Stuffed lychees are popular with cream cheese and nuts. But like other little-known fruits, lychee is being exploited by interests hoping to make good on this super-fruit by turning it into a high-cost supplement drink or capsule."}, {"url": "http://www.nutrition-and-you.com/Lychee.html", "passage_text": "Delicious and juicy lychee or Litchi heralds you the arrival of summer. Besides being sweet and nutritious, these berries bring cooling effect on the human body to beat the scorching summer heat. Botanically, this exotic fruit belongs to the family of Sapindaceae, and named scientifically as Litchi chinensis. Health benefits of Lychee. Lychee fruit contains 66 calories per 100 g, comparable to that in the table-grapes. It has no saturated fats or cholesterol, but composes of good amounts of dietary fiber, vitamins, and antioxidants."}, {"url": "https://en.wikipedia.org/wiki/Lychee", "passage_text": "The lychee, litchi, leechee, or lichee (Litchi chinensis; Chinese: 荔枝) is the sole member of the genus Litchi in the soapberry family, Sapindaceae. It is a tropical and subtropical fruit tree native to the Guangdong and Fujian provinces of China, and now cultivated in many parts of the world. China is the main producer of lychees, followed by India, with production occurring among other countries in Southeast Asia, the Indian subcontinent and South Africa. The lychee has a history and cultivation going back to 2000 BC according to records in China. Cultivation began in the area of southern China, Malaysia, and Vietnam. Wild trees still grow in parts of southern China and on Hainan Islan"}, {"url": "http://engineeredlifestyles.org/lychee.html", "passage_text": "Another health benefit of the lychee fruit is that it is a great source of vitamin C, a vitamin that the body does not produce naturally. Vitamin C helps the body to fight heart disease and cancer. Vitamin C is good for our bones, skin and tissue, and therefore is a very important vitamin to our overall good health. Lychee A Symbol of Romance and Love. The health benefits of thee fruit has been tried, proven and touted in countries such as China, India and Indonesia, so much so that lychee made its way into ancient Chinese legend."}, {"url": "https://en.wikipedia.org/wiki/Lychee", "passage_text": "An evergreen tree reaching 10–28 metres (33–92 ft) tall, the lychee bears fleshy fruits that are up to 5 cm long and 4 cm wide (2.0 in × 1.6 in). The outside of the fruit is covered by a pink-red, roughly textured rind that is inedible but easily removed to expose a layer of sweet, translucent white flesh. China is the main producer of lychees, followed by India, with production occurring among other countries in Southeast Asia, the Indian subcontinent and South Africa. The lychee has a history and cultivation going back to 2000 BC according to records in China. Cultivation began in the area of southern China, Malaysia, and Vietnam. Wild trees still grow in parts of southern China and on Hainan Island"}, {"url": "http://www.wisegeek.org/what-is-a-lychee.htm", "passage_text": "Most Americans are only familiar with lychee as an item on the dessert menu at Chinese restaurants. Often erroneously called lychee nuts, the fruit is indigenous to China and popular for snacking or desserts. On the tree, it is protected by a bumpy, leathery rind that is inedible."}]