[{"url": "http://www.sciencedirect.com/science/article/pii/S1472029909000617", "passage_text": "The basic functional unit of the kidney is the nephron. This article explains the purpose of each portion of the nephron and the transport systems and hormones involved in the normal function of the nephron in the formation of urine. The article includes a discussion of commonly used drugs that affect nephron function. The loop of Henle. The loop of Henle is the portion of the kidney that creates the conditions by which the kidney can form concentrated urine (i.e. urine with an osmolality greater than plasma) later on in"}, {"url": "http://www.aviva.co.uk/health-insurance/home-of-health/medical-centre/medical-encyclopedia/entry/function-urine-formation-and-excretion/", "passage_text": "Function: Urine Formation and Excretion. Urine is composed of unwanted substances that have been filtered from the blood by nephrons, the functional units of the kidneys. The urine formed in the kidneys passes through the ureters and is temporarily stored in the bladder."}, {"url": "http://www.kidneychat.com/urine-formation.html", "passage_text": "Basically, the process of urine formation takes place in three (3) stages, as blood plasma flows through the nephrons. Nephrons are microscopic tube-like structures in the kidneys that filter the blood and cause wastes to be removed. Maintaining the correct volume and concentration of blood and removing wastes and toxins from it are essential functions of the kidneys. The kidneys are able to do this by converting unwanted blood plasma into urine and expelling it from the body. Blood plasma is a clear fluid that surrounds blood cells."}, {"url": "http://www.kidneychat.com/urine-formation.html", "passage_text": "Stage 1 of Urine Formation: GLOMERULAR FILTRATION. Glomerular filtration is a process in which water and some other substances in the blood plasma pass from the capillaries of the glomerulus into the Bowman's capsule. Very small molecules can pass through the filtration membrane into the Bowman's capsule. Maintaining the correct volume and concentration of blood and removing wastes and toxins from it are essential functions of the kidneys. The kidneys are able to do this by converting unwanted blood plasma into urine and expelling it from the body. Blood plasma is a clear fluid that surrounds blood cells."}, {"url": "https://en.wikipedia.org/wiki/Nephron", "passage_text": "(June 2011). The nephron (from Greek νεφρός - nephros, meaning kidney) is the basic structural and functional unit of the kidney. Its chief function is to regulate the concentration of water and soluble substances like sodium salts by filtering the blood, reabsorbing what is needed and excreting the rest as urine. "}, {"url": "http://www.aviva.co.uk/health-insurance/home-of-health/medical-centre/medical-encyclopedia/entry/function-urine-formation-and-excretion/", "passage_text": "How a nephron makes urine. Blood entering the nephron is filtered through a cluster of capillaries called the glomerulus. The filtrate then enters the renal tubule, along which a complex process of secretion and reabsorption occurs. Useful substances such as glucose are reabsorbed; the acidity of the blood is regulated; and water levels are adjusted. The resulting fluid is called urine. Urine is composed of unwanted substances that have been filtered from the blood by nephrons, the functional units of the kidneys. The urine formed in the kidneys passes through the ureters and is temporarily stored in the bladder."}, {"url": "http://www.sciencedirect.com/science/article/pii/S1472029909000617", "passage_text": "The tubular segments of the nephron are an extension of Bowman’s capsule. The first segment is the proximal tubule, which drains into the thin and thick segments of the loop of Henle, then into the distal tubule and collecting tubule, which finally drains urine into the renal pelvis. The loop of Henle. The loop of Henle is the portion of the kidney that creates the conditions by which the kidney can form concentrated urine (i.e. urine with an osmolality greater than plasma) later on in the nephron."}, {"url": "http://classes.midlandstech.edu/carterp/Courses/bio211/chap25/chap25.htm", "passage_text": "Nephrons are the structural and functional units of the kidneys that carry out processes that form urine. Each nephron consists of a renal corpuscle composed of a tuft of capillaries (the glomerulus), surrounded by a glomerular capsule (Bowman s capsule) and a renal tubule. "}, {"url": "http://www.sciencedirect.com/science/article/pii/S1472029909000617", "passage_text": "The glomerulus. The main function of the glomerulus is to form a filtrate from the circulating blood which is then modified by the tubule into urine. It is in essence a complex biological sieve. The plasma is filtered into the urinary space, which is the lumen of Bowman’s capsule. The loop of Henle. The loop of Henle is the portion of the kidney that creates the conditions by which the kidney can form concentrated urine (i.e. urine with an osmolality greater than plasma) later on in the nephron."}, {"url": "https://en.wikibooks.org/wiki/Human_Physiology/The_Urinary_System", "passage_text": "The process of filtration of the blood in the Bowman's capsule is ultrafiltration (or glomerular filtration), and the normal rate of filtration is 125 ml/min, equivalent to ten times the blood volume daily. Measuring the glomerular filtration rate (GFR) is a diagnostic test of kidney function. The Urinary System is a group of organs in the body concerned with filtering out excess fluid and other substances from the bloodstream. The substances are filtered out from the body in the form of urine. Urine is a liquid produced by the kidneys, collected in the bladder and excreted through the urethra."}]