[{"url": "http://www.networx.com/cost-guide/install-roof-shingles", "passage_text": "You can expect to pay $80 - $100 per roofing square -- a common industrial measurement that refers to 100 square feet of shingles. This figure includes both materials and labor. Cost to install roof shingles will vary somewhat, depending on:"}, {"url": "http://www.roofingcalculator.org/roofing-prices.php", "passage_text": "Aluminum standing seam will add about $75-100 per square to account for additional materials cost of aluminum vs. steel. Sky-light and chimney flashing on a standing seam roof will cost an average of $400 per unit, vs. $300 per unit on a metal shingles roof, as they are much more involved and complicated."}, {"url": "http://www.roofingcalculator.org/roofing-prices.php", "passage_text": "Cost to install steel shingles, on a simple gable roof: $775-850 per square. Cost to install aluminum shingles, on a simple gable roof: $875-950 per square. A more complicated roof will increase in price by $100-200 per square (compared to an increase of $350-500 in case of a standing seam roof)."}, {"url": "http://www.roofingcalculator.org/roofing-prices.php", "passage_text": "Based on our experience and survey of contractors from different regions of continental US, the average price per square of Asphalt Shingles is in the range of $250-300. This price is to install a new 30-year dimensional (architectural) shingles on a walkable (3-6 roof pitch) ranch-type house."}, {"url": "http://www.hometownroofingcontractors.com/blog/how-much-does-a-shingle-roof-replacement-cost", "passage_text": "The average roof is around 20 square. Bigger roofs obviously cost more to replace due to increased labor and materials. Learn how to estimate the size of your roof. Most roofers will have a predetermined price-per-square for shingle roofs, but don’t take this figure as being set in stone."}, {"url": "http://www.answers.com/Q/What_is_the_average_cost_per_square_foot_to_install_roof", "passage_text": "It depends on the type of roof. A single story low pitch asphalt shingle roof will cost around $40 - $80 per square (100 sq. ft.) to tear off and $75 - $100 per square to install new shingles. If the plywood sheathing underneath is damaged, it will cost extra, up to $50 per sheet replaced."}, {"url": "http://www.reliableremodeler.com/ask/how-much-will-it-cost-to-replace-a-shingle-roof/", "passage_text": "Thomas, I estimate that it could cost between $10,000 and $15,000 to replace a 2,500 square foot roof, which would be approximately $4-$6 a square foot. Obviously, the most accurate estimate for your roofing project may come from a roofing contractor who works in the Pittsfield area and has seen your house."}, {"url": "http://www.reliableremodeler.com/ask/how-much-will-it-cost-to-replace-a-shingle-roof/", "passage_text": "Good luck with your project! 1  Removal of old roof shingles ($90 per square, which is a term used to represent 100 square feet). 2  Install new shingles ($115 per square). 3  Purchase new shingles ($80-$125 per square). 4  Roofing Felt ($45 for a 4 square roll)."}, {"url": "http://home.costhelper.com/asphalt-shingle-roof.html", "passage_text": "1 Having a roofing contractor remove (and dispose of) old roofing materials, then install asphalt shingles runs about $1-$4 a square foot, or a total of $1,700-$8,400 for a typical ranch-style home (1,700-2,100 square foot, gently sloping roof)."}]