[{"url": "http://www.biomagnetismusa.com/2009/04/what-is-medical-biomagnetism.html", "passage_text": "Biomagnetism is a scientifically sound alternative treatment that may help restore and maintain physical and mental health. On 1988 Dr. Isaac Goiz, Medical Surgeon, discovered the Biomagnetic Pair BMP. "}, {"url": "http://www.usbiomag.com/what-is-biomagnetism/", "passage_text": "Biomagnetism or Biomagnetic Pair — BMP™ is a revolutionary, scientific and therapeutic approach to wellness that differs from traditional medicine, homeopathy, herbs and natural therapies. It is perfectly compatible with any other traditional or alternative modality. The BMP (BioMagnetic Pair) studies, detects, classifies, measures and allows the correction of pH imbalances in living organisms. By reestablishing the natural pH balance of the body, different microorganisms such as virus, fungi, bacteria and parasites can be kept under control by our renewed natural defenses."}, {"url": "http://www.biomagnetism.ie/", "passage_text": "The practitioners of the Institute have been Certified to provide BioMagnetism Therapy by the El Centro de Investigacion de Biomagnetismo Medico, S.C. in Mexico, The University of Chapingo, Mexico and by Dr. Isaac Goiz Duran. He is not a Medical Doctor, he is not making a medical diagnosis or providing medical advice or care. You should see a Medical Doctor for medical care, and you should view BioMagnetism Therapy care as additional therapy to the medical care provided by a Medical Doctor. Biomagnetism Therapy is not a substitute for Physician consultation, evaluation, or treatment. Biomagnetism Therapy consists of applying medium intensity magnets between 1000- 15 000 gauss in specific areas of the body in order to help balance the pH levels, of Alkalinity and Acidity in the body"}, {"url": "http://www.biomagnetismusa.com/", "passage_text": "Biomagnetism is a scientifically sound alternative treatment that may help restore and maintain physical and mental health. On 1988 Dr. Isaac Goiz, Medical Surgeon, discovered the Biomagnetic Pair BMP. Biomagnetism sessions are 90 minutes. Lying down on the massage table, fully clothed, we scan the whole body for pH imbalances. Once we found one, we look for the corresponding point and we place the magnets by pairs. Magnets are left from 15-20 minutes in order to restore a neutral pH in the areas treated."}, {"url": "http://biomagnetism.net/biomagneticpair/", "passage_text": "Biomagnetic Pair. Medical Biomagnetism, also called Biomagnetic Pair, is a natural therapy that proposes diagnosing and treating a large number of illnesses through the use of pairs of magnets of medium intensity that seek to equalize the organism’s pH level. "}, {"url": "http://www.biomagnetismaustralia.com/what-is-biomagnetism.html", "passage_text": "This system created by Dr Isaac Goiz Duran of Mexico enables the Biomagnetism practitioner to detect and correct alterations in the body's pH. Medium intensity magnets are used to scan the body, looking for a response from the body to identify if a polarity is present. "}, {"url": "https://en.wikipedia.org/wiki/Biomagnetism", "passage_text": "Biomagnetism is the phenomenon of magnetic fields produced by living organisms; it is a subset of bioelectromagnetism. In contrast, organisms' use of magnetism in navigation is magnetoception and the study of the magnetic fields' effects on organisms is magnetobiology. The origin of the word biomagnetism is unclear, but seems to have appeared several hundred years ago, linked to the expression animal magnetism.. The present scientific definition took form in the 1970s, when an increasing number of researchers began to measure the magnetic fields produced by the human body."}, {"url": "http://www.shiatsutoronto.org/what-is-biomagnetic-pair-therapy/", "passage_text": "Medical Biomagnetism also called BioMagnetic Pair Therapy is a natural complementary therapy that diagnoses and treats a large number of illnesses through the use of pairs of medium intensity magnets. BioMagnetic Pair Therapy is a scientifically sound alternative treatment, developed by Dr. Isaac Goiz of Mexico, that helps to eliminate disease and restore and maintain physical and mental health without the use of pills or surgeries."}]