[{"url": "http://biology.about.com/od/anatomy/ss/lymph-nodes.htm", "passage_text": "Lymph Node Function. Lymph nodes serve two major functions in the body. They filter lymph and assist the immune system in building an immune response. Lymph is a clear fluid that comes from blood plasma that exits blood vessels at capillary beds. This fluid becomes the interstitial fluid that surrounds cells. B-cells and T-cells are lymphocytes found in lymph nodes and lymph tissues. When B-cell lymphocytes become activated due to the presence of a particular antigen, they create antibodies that are specific to that specific antigen. The antigen is tagged as an intruder and labeled for destruction by other immune cells."}, {"url": "http://www2.estrellamountain.edu/faculty/farabee/biobk/BioBookIMMUN.html", "passage_text": "The lymphatic system is composed of lymph vessels, lymph nodes, and organs. The functions of this system include the absorbtion of excess fluid and its return to the blood stream, absorption of fat (in the villi of the small intestine) and the immune system function. "}, {"url": "https://en.wikipedia.org/wiki/Lymphatic_system", "passage_text": "The lymphatic system consists of lymphatic organs, a conducting network of lymphatic vessels, and the circulating lymph. The thymus and the bone marrow constitute the primary lymphoid organs involved in the production and early clonal selection of lymphocyte tissues. Lymphocytes are concentrated in the lymph nodes. The spleen and the thymus are also lymphoid organs of the immune system. The tonsils are lymphoid organs that are also associated with the digestive system. Lymphoid tissues contain lymphocytes, and also contain other types of cells for support."}, {"url": "http://www.answers.com/Q/What_are_the_functions_of_the_lymph_nodes", "passage_text": "Making the world better, one answer at a time. The main function of lymph nodes is to act as a drainage system by absorbing and expelling proteins, dead cells, bacteria and other waste products from the body. Basically they clean and filter the lymph before it is returned to the blood. The main function of lymph nodes is to act as a drainage system by absorbing and expelling proteins, dead cells, bacteria and other waste products from the body. Basica … "}, {"url": "https://en.wikipedia.org/wiki/Lymphatic_system", "passage_text": "One of the main functions of the lymph system is to provide an accessory return route to the blood for the surplus three litres. The other main function is that of defense in the immune system. Lymph is very similar to blood plasma: it contains lymphocytes and other white blood cells. It also contains waste products and debris of cells together with bacteria and protein. Lymphocytes are concentrated in the lymph nodes. The spleen and the thymus are also lymphoid organs of the immune system. The tonsils are lymphoid organs that are also associated with the digestive system. Lymphoid tissues contain lymphocytes, and also contain other types of cells for support."}, {"url": "https://en.wikipedia.org/wiki/Lymphatic_system", "passage_text": "The lymphatic system is part of the circulatory system and a vital part of the immune system, comprising a network of lymphatic vessels that carry a clear fluid called lymph (from Latin lympha meaning water) directionally towards the heart. Lymphocytes are concentrated in the lymph nodes. The spleen and the thymus are also lymphoid organs of the immune system. The tonsils are lymphoid organs that are also associated with the digestive system. Lymphoid tissues contain lymphocytes, and also contain other types of cells for support."}, {"url": "http://www.news-medical.net/health/Structure-and-function-of-lymph-nodes.aspx", "passage_text": "The lymphatic system is basically a channel that carries a clear or whitish fluid called the lymph. This lymph aids in clearing the tissues of infective organisms, toxins etc. The basic structure and functions of the lymphatic system can be broken into the lymph channels. Functions of the lymphatic system include (3): 1  Drainage of fluid from blood stream into the tissues – The circulating blood through narrow vessels leads to leakage of fluid or plasma into the tissues carrying oxygen and nutrients to the tissues and carrying waste materials from the tissues into the lymph channels."}, {"url": "http://www.livescience.com/26983-lymphatic-system.html", "passage_text": "View full size image. The lymphatic system is a network of tissues and organs that help rid the body of toxins, waste and other unwanted materials. The primary function of the lymphatic system is to transport lymph, a fluid containing infection-fighting white blood cells, throughout the body. The lymphatic system primarily consists of lymphatic vessels, which are similar to the circulatory system's veins and capillaries. "}]