[{"url": "http://www.maine.gov/dhhs/mecdc/environmental-health/rad/radon/radonfaq.htm", "passage_text": "Answer: Radon levels vary from home to home. There are many instances of a house with over 100 pCi/L being right next to a house with less than 4 pCi/L. The only way to know if your home has a radon problem is to test it. "}, {"url": "http://www.wipeoutradon.com/", "passage_text": "Radon is an invisible, tasteless gas that can enter your home through cracks and holes in the basement walls and floor. When radon decays, the tiny, ratio-active particles are released into the air you breathe. Breathing in air containing radon may increase your risk of lung cancer. The results of a radon test will give you the level of your home’s indoor radon level. EPA recommends that action is taken to reduce the radon level in your home if the test results are 4pCi/L or higher."}, {"url": "http://wpb-radon.com/radon_FAQ.html", "passage_text": "If the radon levels are greater than 10 pCi/l it is unlikely that the second test will be below the guideline. It becomes more prudent, however, to do a 2nd test the closer the first test is to the 4.0 pCi/L guideline. Radon levels will change when you open a window especially if the window is in the same area as the test kit. In general however the window or multiple windows have to be wide open in the test area to make a big change (cut radon levels in half)."}, {"url": "http://www.wipeoutradon.com/", "passage_text": "Radon exposure can cause lung cancer. EPA estimates that there are approximately 21,000 annual radon-related lung cancer deaths in the U.S. every year, second only to tobacco smoke. The combination of radon exposure and smoking can greatly increase your chances of developing lung cancer. The results of a radon test will give you the level of your home’s indoor radon level. EPA recommends that action is taken to reduce the radon level in your home if the test results are 4pCi/L or higher."}, {"url": "http://www.vdh.virginia.gov/epidemiology/radiologicalhealth/radon/faq.htm", "passage_text": "An increased risk of lung cancer is the only known health effect associated with exposures to elevated radon levels. When radon decays within your lungs it releases energy that can damage lung tissue and lead to lung cancer over the course of your lifetime. Testing for radon is simple and inexpensive. There are many 'do-it-yourself' kits you can buy at retail outlets or through the mail. (See next question for where to get a test kit.) EPA recommends placing the radon kit in the lowest lived-in level of the home."}, {"url": "http://www.cdc.gov/nceh/radiation/brochure/profile_radon.htm", "passage_text": "You can measure radon levels in your home using long-term testing or short-term testing. With short-term testing, a test kit stays in the area in your home for fewer than 90 days, but more than 2 days. Long-term testing is when the kit remains in the area for more than 90 days. "}, {"url": "http://www.danschillinginspections.com/id27.htm", "passage_text": "People should indeed know what their home radon levels are; the question is how. Being that the health risk of lung cancer is directly proportional to long-term exposure to radon, a short-term test is not only questionable in its validity, but virtually meaningless in the scope of long-term exposure. Radon gas levels can regularly go up and down at any time and for a variety of reasons. Having a home tested for radon with a short-term test or short-term monitoring is at best a waste of money that provides misleading information."}, {"url": "http://www.cancer.gov/about-cancer/causes-prevention/risk/substances/radon/radon-fact-sheet", "passage_text": "Long-term tests determine the average concentration for more than 90 days. Because radon levels can vary from day to day and month to month, a long-term test is a better indicator of the average radon level. Both tests are relatively easy to use and inexpensive. Radon is a radioactive gas released from the normal decay of the elements uranium, thorium, and radium in rocks and soil. It is an invisible, odorless, tasteless gas that seeps up through the ground and diffuses into the air."}]