[{"url": "http://www.payscale.com/research/US/Job=Certified_Nurse_Assistant_(CNA)/Hourly_Rate/07909f57/Chicago-IL", "passage_text": "(United States). The average wage for a Certified Nurse Assistant (CNA) in Chicago, Illinois is $10.82 per hour. People in this job generally don't have more than 20 years' experience. Pay for this job does not change much by experience, with the most experienced earning only a bit more than the least."}, {"url": "http://www.indeed.com/salary/q-CNA-l-Illinois.html", "passage_text": "Average CNA salaries for job postings in Illinois are 13% higher than average CNA salaries for job postings nationwide. "}, {"url": "http://www.ecnatraining.com/faq/cna-salary-per-hour.html", "passage_text": "Therefore on an average the salary of a certified nursing assistant ranges between $25000 and $ 35000 per year. This salary structure is beneficial for all the people working as a CNA in their respective organization. What are the best paying CNA jobs? The average salary of a CNA 2 or Patient Care Assistant is USD 38,000 per year and the CNA 3 (Patent Care Technician) is USD 45,"}, {"url": "http://nursejournal.org/certified-nursing-assistant/cna-careers-salary-outlook/", "passage_text": "Average Certified Nursing Assistant salaries for job postings in Illinois are 13% higher than average Certified Nursing Assistant salaries for job postings nationwide. The average salary ranks 5th among states in the country. Average Certified Nursing Assistant salaries for job postings in Alabama are 1% higher than average Certified Nursing Assistant salaries for job postings nationwide. The average salary ranks 9"}, {"url": "http://nursejournal.org/certified-nursing-assistant/cna-careers-salary-outlook/", "passage_text": "Average Certified Nursing Assistant salaries for job postings in Alaska are 26% lower than average Certified Nursing Assistant salaries for job postings nationwide. The average salary ranks 47th among states in the country. Average Certified Nursing Assistant salaries for job postings in Alabama are 1% higher than average Certified Nursing Assistant salaries for job postings nationwide. The average salary ranks 9"}, {"url": "http://learn.org/articles/What_is_the_Average_Salary_for_Certified_Nursing_Assistant.html", "passage_text": "Salary Overview. According to PayScale.com, the median wage for a CNA was $22,918 per year as of January 2014. Salaries in the 10th through 90th percentiles ranged from $18,044-$31,514 annually. Important factors that can affect your salary as a CNA include your location, experience and your industry within the nursing field. Salaries by Experience. January 2014 data from PayScale.com showed that the reported salaries for CNAs varied by number of years of experience. The salary range for those possessing less than a year of experience was $17,544-$43,359, while those with 1-4 years of experience reported salaries of $14,371-$38,701."}, {"url": "http://www.payscale.com/research/US/Job=Certified_Nurse_Assistant_(CNA)/Hourly_Rate", "passage_text": "Certified Nurse Assistant (CNA) Salary. (United States). The average pay for a Certified Nurse Assistant (CNA) is $10.99 per hour. Skills that are associated with high pay for this job are Telemetry, Operating Room / OR, Intensive Care Unit (ICU), and Emergency Room (ER"}, {"url": "http://cnacareer.org/resources/salary.php", "passage_text": "Wyoming. The average CNA salary in the U.S. is $24,010 ($11.54/hr). The majority of CNAs within the U.S. can expect annual wages of between $20,600 ($9.90/hr) and $29,070 ($13.98/hr). However, the top 10% of all CNAs have an annual salary over $34,580 ($16.62/hr)"}]