[{"url": "http://homeguides.sfgate.com/remove-glued-down-carpet-tiles-concrete-20942.html", "passage_text": "A 3-inch putty knife may loosen tiles enough to remove them. Carpet tiles are a do-it-yourself home improvement project, but removing them from concrete can be challenging. If the tiles are newer, they may lift with little effort and leave almost no glue behind. A good scrubbing afterward is all you’ll need. "}, {"url": "http://www.wikihow.com/Remove-Adhesive-From-Concrete", "passage_text": "How to Remove Adhesive From Concrete. If you are removing tile or carpet from concrete, you must remove the adhesive that remains before painting or staining the concrete and, in most cases, before recovering the concrete with tile, wood or carpet. It is quite a job to remove adhesive from concrete. "}, {"url": "http://removeandreplace.com/2014/11/21/how-to-remove-carpet-glue-from-concrete-flooring/", "passage_text": "Use a powerful adhesive glue remover. An adhesive remover will chemically softens the glue to make it easier to scrape. Apply the adhesive remover on the concrete floor following the instructions on the box. Use the razor scraper to remove the glue once it is soft. Use boiling water to soften the glue. Hot water will make the glue come to a softer state. Simply boil some water and pour it carefully over the carpet glue in sections. Let the hot water penetrate for about 2 minutes."}, {"url": "http://www.everything-about-concrete.com/removing-carpet-glue-from-concrete.html", "passage_text": "Removing carpet glue from concrete can be done several ways. The best and safest way to remove glue from concrete is with a soy based, biodegradable, adhesive or mastic remover. RadonSeal makes a powerful, biodegradable, mastic remover for concrete called NOVION UNIVERSAL CONCRETE CLEANER. This product cleans up with soap and water which means you can take the waste to the local landfill. After pulling up the carpet, the first step is to remove as much glue from the concrete as you can with a floor scraper. Scrape the entire floor, then sweep or vacuum up the loose glue. The more excess glue you get off the floor before using a glue remover for concrete, the better the glue remover will work. The next step is to wet the glue with the adhesive remover either with a mop or sprayer. Let the adhesive remover soak and penetrate the glue for 10 - 20 minutes until the glue is saturated"}, {"url": "http://removeandreplace.com/2014/11/21/how-to-remove-carpet-glue-from-concrete-flooring/", "passage_text": "Scrape the carpet glue off with a scraper. Purchase a large long handle razor blade scraper. They are the size of a broom but at one end is a large sharp razor blade. Remove the carpet glue by scraping it using some good old elbow grease. Use boiling water to soften the glue. Hot water will make the glue come to a softer state. Simply boil some water and pour it carefully over the carpet glue in sections. Let the hot water penetrate for about 2 minutes."}, {"url": "http://homeguides.sfgate.com/remove-glueddown-floor-37903.html", "passage_text": "Tiles often are installed with an adhesive. A glued-down floor refers to flooring installed on a concrete or plywood subfloor with adhesive. Vinyl tiles and sheet vinyl, as well as some types of hardwood and carpet, are installed using an adhesive. Remove the flooring with a floor-scraping tool. 3. Continue to loosen and remove the flooring with the scraper and by hand. Typically, the backing on vinyl flooring and carpet will separate from the underside of the material, leaving a layer of backing on the subfloor. With hardwood, expect strips of the underside veneer to remain."}, {"url": "http://www.doityourself.com/stry/how-to-remove-carpet-glue-from-concrete", "passage_text": "Here are methods to remove carpet glue from concrete: Step 1 – Scraping the Carpet Glue. Remove as much of the carpet glue as possible by scraping it using a razor blade scraper. The scraper can easily remove big chunks of the glue, which helps in getting the job done easily afterwards. Step 2 – Use Boiling Water. Boiling water will soften up hard-to-remove glue. Pour the boiling water over the carpet glue and allow it to sit there for about 3 to 5 minutes. Do not allow the boiling water to sit for too long or it will cool off. As the heat softens the glue, scrape it off using the razor blade scraper"}, {"url": "http://www.ehow.com/how_5050000_remove-carpet-glue-concrete-floor.html", "passage_text": "Scrape off the carpet adhesive using a heavy-duty blade scraper or spackling tool. If you have a bad back, you can also use a garden hoe so that you do not need to bend too much; just make sure not to use too much force that can damage the concrete floor. "}]