[{"url": "http://www.healthline.com/health/heart-disease/myocarditis", "passage_text": "Blood tests can check for signs of infection or inflammation and a chest X-ray can show any signs of heart failure. An electrocardiogram (ECG) can also detect any abnormal heart rhythms or indicate a damaged heart muscle, and an echocardiogram (ultrasound) may detect any enlargement of the heart."}, {"url": "http://www.healthline.com/health/heart-disease/myocarditis", "passage_text": "Myocarditis is a disease marked by the inflammation of heart muscle. Learn about the symptoms, diagnosis, and treatment of myocarditis. Inflammation is a normal bodily response to any sort of wound or infection. Imagine when you cut your finger. Normally, within a short time, the tissue around the cut swells up and turns red—classic signs of inflammation."}, {"url": "http://www.medicinenet.com/myocarditis/article.htm", "passage_text": "When myocarditis is more serious, it leads to weakening of the heart muscle. Myocarditis can then cause heart failure (with symptoms of shortness of breath, fatigue, fluid accumulation in the lungs, etc.) as well as heart rhythm irregularities from inflammation and/or scarring of the electrical system of the heart."}, {"url": "http://medical-dictionary.thefreedictionary.com/Inflammation+of+the+heart", "passage_text": "Myocarditis is an inflammatory disease of the heart muscle (myocardium) that can result from a variety of causes. While most cases are produced by a viral infection, an inflammation of the heart muscle may also be instigated by toxins, drugs, and hypersensitive immune reactions."}, {"url": "http://www.medicinenet.com/myocarditis/article.htm", "passage_text": "Myocarditis can be caused by a variety of infections and conditions such as viruses, sarcoidosis, and immune diseases (such as systemic lupus, etc.), pregnancy, and others. The most common cause of myocarditis is infection of the heart muscle by a virus. The virus invades the heart muscle to cause local inflammation."}, {"url": "http://www.mayoclinic.org/diseases-conditions/myocarditis/basics/definition/con-20027303", "passage_text": "Myocarditis is an inflammation of the myocardium, the middle layer of the heart wall. Myocarditis is usually caused by a viral infection. Signs and symptoms of myocarditis include chest pain, heart failure and abnormal heart rhythms."}, {"url": "http://www.emedicinehealth.com/pericarditis/article_em.htm", "passage_text": "Inflammation can occur in many places in the heart. Pericarditis describes an inflammation of the membrane lining of the heart. It is different than myocarditis (inflammation of the heart muscle) and endocarditis (inflammation of the heart valves)."}]