[{"url": "http://chinesefood.about.com/od/tofupictures/f/red-bean-curd.htm", "passage_text": "Answer: Red bean curd is a type of preserved bean curd (also called fermented bean curd), that consists of cubes of bean curd that have been preserved in rice wine, fermented red rice and other seasonings. Question: Red Bean Curd. Answer: Red bean curd is a type of preserved bean curd (also called fermented bean curd), that consists of cubes of bean curd that have been preserved in rice wine, fermented red rice and other seasonings. Fermented bean curd is sold in jars in Chinese markets."}, {"url": "https://en.wikipedia.org/wiki/Fermented_bean_curd", "passage_text": "Fermented tofu also called fermented bean curd, sufu, tofu cheese, or preserved tofu is a form of processed, preserved tofu used in East Asian cuisine as a condiment made from soybeans. Chiang fermented bean curd (Chiang-doufu) is made with cubes of tofu soaked in either Chinese-style miso (Chiang) or soy sauce for several days. Usually reddish-brown in color and salty, it may be dried and fermented further and may also be mixed with sake lees. In Japan, miso is used."}, {"url": "http://www.qwhatis.com/what-is-bean-curd/", "passage_text": "Bean curd, just another name for tofu, is considered to be a best substitute of meat for those who are vegetarian. It is made from soya bean and used in variety of dishes due to its neutral flavor. Bean curd is readily available in market in packaging which can also be further processed to form a flavored tofu. Fermented bean curve helps to give your dish a flavor and it can be added in the dish at the stage when it comes to develop some desired flavor."}, {"url": "http://www.ehow.com/about_6311875_bean-curd_.html", "passage_text": "Bean curd is typically referred to by its common commercial name: tofu. This product, usually made from soybeans, is a soft food with a cheese-like consistency. It is normally pressed into a solid block, much like cheese, and is used in a wide variety of dishes. History. The Chinese were the first to discover tofu, or bean curd, as an additive to their cuisine in approximately 200 B.C. Physician's Laboratories notes a Chinese legend revealing the accidental discovery of bean curds by a cook who added nigari to some cooked soybeans to enhance their flavor."}, {"url": "https://en.wikipedia.org/wiki/Fermented_bean_curd", "passage_text": "White (bai) bái preserved bean (curd) fǔrǔ is the most common type and can be described without the white. Adjective the, flavor color and aroma can be altered using various combinations of spices and seasoning in the brine with alterations in the commonly used combination of10 % rice wine and12 %. salt Chiang fermented bean curd (Chiang-doufu) is made with cubes of tofu soaked in either Chinese-style miso (Chiang) or soy sauce for several days. Usually reddish-brown in color and salty, it may be dried and fermented further and may also be mixed with sake lees. In Japan, miso is used."}, {"url": "https://en.wikipedia.org/wiki/Bean_Curd", "passage_text": "Tofu, also known as bean curd, is a food made by coagulating soy milk and then pressing the resulting curds into soft white blocks. It is a component in East Asian and Southeast Asian cuisines. There are many different varieties of tofu, including fresh tofu and tofu that has been processed in some way. "}, {"url": "http://www.wisegeek.org/what-is-bean-curd.htm", "passage_text": "Bean curd is another name for tofu, a product made from soybeans, and sometimes other legumes as well. To make it, a cook curdles soy milk and presses the resulting soybean curds into molds to firm up. @anon276630-- I used to dislike bean curd as well, but after I tasted fried tofu I changed my mind. Fried tofu is made from a hard bean curd that's fried in oil. It's absolutely delicious in stir-fries. Kung pao bean curd is another of my favorites."}, {"url": "http://www.wisegeek.org/what-is-bean-curd.htm", "passage_text": "Bean curd is also known as tofu and is a popular meat substitute among vegetarians. Soy-based products have long been food staples in parts of Asia. Soybeans are used to make bean curd, which is also known as tofu. @anon276630-- I used to dislike bean curd as well, but after I tasted fried tofu I changed my mind. Fried tofu is made from a hard bean curd that's fried in oil. It's absolutely delicious in stir-fries. Kung pao bean curd is another of my favorites."}, {"url": "http://www.qwhatis.com/what-is-bean-curd/", "passage_text": "Introduction: Bean curd, just another name for tofu, is considered to be a best substitute of meat for those who are vegetarian. It is made from soya bean and used in variety of dishes due to its neutral flavor. Bean curd comes in different styles, and its usage also varies according to the dish you are going to make. Bean curd is readily available in market in packaging which can also be further processed to form a flavored tofu. Fermented bean curve helps to give your dish a flavor and it can be added in the dish at the stage when it comes to develop some desired flavor."}, {"url": "http://www.differencebetween.com/difference-between-tofu-and-vs-bean-curd/", "passage_text": "Bean Curd. Bean curd is the name of a food product that is loved the world over because of its high protein content. It is literally the curd of soybeans which is why it is referred to as bean curd. Dry soybeans are ground and then cooked lightly to provide their milk, which is curdled using a coagulating agent. Bean Curd vs Tofu."}]