[{"url": "https://en.wikipedia.org/wiki/Postsynaptic_density", "passage_text": "The postsynaptic density (PSD) is a protein dense specialization attached to the postsynaptic membrane. PSDs were originally identified by electron microscopy as an electron-dense region at the membrane of a postsynaptic neuron. The structure and composition of the PSD have been the focus of numerous molecular studies of synaptic plasticity, a cellular model of learning and memory. PSDs are sized on the order of 250 to 500 nanometres in diameter and 25 to 50 nanometres in thickness, depending on the activity state of the synapse."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/22351050", "passage_text": "Scaffold proteins are abundant and essential components of the postsynaptic density (PSD). They play a major role in many synaptic functions including the trafficking, anchoring, and clustering of glutamate receptors and adhesion molecules. Given that scaffold proteins are central components of PSD architecture, it is not surprising that deletion or mutations in their human genes cause severe neuropsychiatric disorders including autism, mental retardation, and schizophrenia."}, {"url": "http://psychology.wikia.com/wiki/Postsynaptic_density", "passage_text": "The postsynaptic density (PSD) is a cytoskeletal specialization at neuronal synapses that was originally identified as an electron-dense region at the membrane of a postsynaptic neuron, as viewed by electron microscopy. PSDs are sized on the order of 0.25 to 0.5 micrometres in diameter and 0.025 to 0.05 micrometres in thickness, depending on the activity state of the synapse. Many proteins in the PSD are involved in the regulation of synaptic function."}, {"url": "https://en.wikipedia.org/wiki/Postsynaptic_density", "passage_text": "Many proteins in the PSD are involved in the regulation of synaptic function. Key among these, are postsynaptic density-95 (PSD95), neuroligin (a cellular adhesion molecule), NMDA receptors, AMPA receptors, calcium/calmodulin-dependent protein kinase II and actin. The structure and composition of the PSD have been the focus of numerous molecular studies of synaptic plasticity, a cellular model of learning and memory. PSDs are sized on the order of 250 to 500 nanometres in diameter and 25 to 50 nanometres in thickness, depending on the activity state of the synapse."}, {"url": "http://www.sciencedirect.com/science/article/pii/S1044743107000164", "passage_text": "Abstract. The postsynaptic density (PSD) is a structure composed of both membranous and cytoplasmic proteins localized at the postsynaptic plasma membrane of excitatory synapses. Biochemical and molecular biological studies have identified a number of proteins present in the PSD. The interneuronal chemical synapse consists of a presynaptic element and an apposed postsynaptic element with an intervening synaptic cleft width of 10–20 nm. Both the presynaptic and the postsynaptic membranes display densities on the cytoplasmic faces (Palay, 1958)."}, {"url": "http://psychology.wikia.com/wiki/Postsynaptic_density", "passage_text": "Composition Edit. Many proteins in the PSD are involved in the regulation of synaptic function. Key among these, are postsynaptic density-95 (PSD95), neuroligin (a cellular adhesion molecule) NMDA receptors, AMPA receptors, calcium/calmodulin-dependent protein kinase II and actin. PSDs are sized on the order of 0.25 to 0.5 micrometres in diameter and 0.025 to 0.05 micrometres in thickness, depending on the activity state of the synapse"}, {"url": "http://www.sciencedirect.com/science/article/pii/095943889390145O", "passage_text": "Abstract. The postsynaptic density is a specialization of the nerve cell's submembrane cytoskeleton that is hypothesized to participate in the regulation of synaptic adhesion, transmitter receptor clustering, and modulation of receptor sensitivity. Until recently, many of the major proteins in the highly insoluble postsynaptic density fraction remained uncharacterized. Modern immunological and microsequencing methods now make it possible to define more precisely the molecular composition and function of this intriguing organelle."}, {"url": "http://cshperspectives.cshlp.org/content/3/12/a005678.full", "passage_text": "The PSD was first observed in electron micrographs as a fuzzy electron-dense thickening of the postsynaptic membrane that is apposed to the presynaptic active zone (hence the term “asymmetric” synapses) (Gray 1959; Siekevitz 1985). The cardinal neurotransmitter receptors of central inhibitory synapses are the GABA A receptors and glycine receptors. These receptors interact directly with gephyrin, a well-known postsynaptic scaffold protein of inhibitory synapses (Prior et al."}, {"url": "http://www.sciencedirect.com/science/article/pii/095943889390145O", "passage_text": "We now know that these dense postsynaptic thickenings represent a fibrous specialization of the submembrane cytoskeleton that adheres to the postsynaptic membrane at sites of close apposition to the presynaptic terminal. Until recently, many of the major proteins in the highly insoluble postsynaptic density fraction remained uncharacterized. Modern immunological and microsequencing methods now make it possible to define more precisely the molecular composition and function of this intriguing organelle."}]