[{"url": "https://en.wikipedia.org/wiki/CAV", "passage_text": "1 Cav. , in botany, a designator for plants named by Antonio Jose José. 2  Cavanille., cav abbreviation For, cavaliere An italian order of. 3  Knighthood cavalleria, rusticana an opera often played as a double bill With, pagliacci and then referred to as The/Cav.  pag 1 Cav., abbreviation for Cavaliere, an Italian order of knighthood. 2  Cavalleria rusticana, an opera often played as a double bill with Pagliacci, and then referred to as the Cav/Pag. 3  Cav Daily, or The Cavalier Daily, a student newspaper at the University of Virginia."}, {"url": "http://www.cancerresearchuk.org/about-cancer/cancers-in-general/treatment/cancer-drugs/cav", "passage_text": "What CAV is. CAV is the name of a combination of chemotherapy drugs used to treat small cell lung cancer and small cell cancers in other parts of the body. It is made up of the drugs. 1  C = Cyclophosphamide. 2  A = Doxorubicin (also called Adriamycin). 3  V = Vincristine. How you have CAV treatment. You have these drugs into your bloodstream (intravenously). Doxorubicin is a red fluid. Vincristine and cyclophosphamide are clear fluids. You can have them through a thin, short tube (a cannula) put into a vein in your arm each time you have"}, {"url": "https://en.wikipedia.org/wiki/CAV", "passage_text": "CAV and Cav may refer to: 1  Cav. , in botany, a designator for plants named by Antonio Jose José. 2  Cavanille., cav abbreviation For, cavaliere An italian order of. 3  Knighthood cavalleria, rusticana an opera often played as a double bill With, pagliacci and then referred to as The/Cav.  pag 1 Cav., abbreviation for Cavaliere, an Italian order of knighthood. 2  Cavalleria rusticana, an opera often played as a double bill with Pagliacci, and then referred to as the Cav/Pag. 3  Cav Daily, or The Cavalier Daily, a student newspaper at the University of Virginia."}, {"url": "http://file.org/extension/cav", "passage_text": "While we do not yet have a description of the CAV file format and what it is normally used for, we do know which programs are known to open these files. See the list of programs recommended by our users below. "}, {"url": "https://en.wikipedia.org/wiki/CAV", "passage_text": "1 Cav. , in botany, a designator for plants named by Antonio Jose José.  cavanille 1 Cav., abbreviation for Cavaliere, an Italian order of knighthood. 2  Cavalleria rusticana, an opera often played as a double bill with Pagliacci, and then referred to as the Cav/Pag. 3  Cav Daily, or The Cavalier Daily, a student newspaper at the University of Virginia."}, {"url": "https://en.wikipedia.org/wiki/Cavalry", "passage_text": "Cavalry (from French cavalerie, cf. cheval 'horse') or horsemen were soldiers or warriors who fought mounted on horseback. Cavalry were historically the most mobile of the combat arms. An individual soldier in the cavalry is known by a number of designations such as cavalryman, horseman, dragoon, or trooper. The Islamic Prophet Muhammad made use of cavalry in many of his military campaigns including the Expedition of Dhu Qarad, and the expedition of Zaid ibn Haritha in al-Is which took place in September, 627 AD, 5th month of 6 AH of the Islamic calendar."}, {"url": "http://www.cancerresearchuk.org/about-cancer/cancers-in-general/treatment/cancer-drugs/cav", "passage_text": "CAV is the name of a combination of chemotherapy drugs used to treat small cell lung cancer and small cell cancers in other parts of the body. It is made up of the drugs. 1  C = Cyclophosphamide. How you have CAV treatment. You have these drugs into your bloodstream (intravenously). Doxorubicin is a red fluid. Vincristine and cyclophosphamide are clear fluids. You can have them through a thin, short tube (a cannula) put into a vein in your arm each time you have"}]