[{"url": "http://memory-alpha.wikia.com/wiki/John_Snyder", "passage_text": "Character(s): Bochra, Aaron Conor. John Snyder (born 1950) is the actor who played the role of Romulan Centurion Bochra in the Star Trek: The Next Generation third season episode  The Enemy  in 1989. He later appeared in the fifth season episode  The Masterpiece Society  as Aaron Conor. "}, {"url": "https://en.wikipedia.org/wiki/John_Snyder_(actor)", "passage_text": "John Snyder (actor). From Wikipedia, the free encyclopedia. John Snyder (born 1950 in Boston, Massachusetts) is an American film, stage, television, and voice actor, who graduated from Boston University 's School of Fine and Applied Arts with a BFA in 1974. Snyder played the gas station man in the 1979 film The Warriors. "}, {"url": "http://www.johnschneideronline.com/bio.html", "passage_text": "Register for John Schneider Online email updates. John Richard Schneider. John Richard Schneider (actor, singer, director, producer, writer) was born on April 8, 1960, in Mt. Kisco, New York. As a child John enjoyed going to the theater watching John Wayne in the westerns. John Wayne soon became his hero as he set his dreams on becoming a star on the big screen some day"}, {"url": "http://www.celebritynetworth.com/richest-celebrities/actors/john-schneider-net-worth/", "passage_text": "$4 Million. John Schneider net worth: John Schneider is an American actor and country singer who has a net worth of $4 million. Schneider gained his net worth from starring in The Dukes of Hazzard as Bo Duke. A born entertainer, Schneider started performing at the age of eight, appearing in magic show for friends and their family"}, {"url": "http://www.imdb.com/name/nm0118612/", "passage_text": "John Snyder (I). Actor. John Snyder (born 1950 Boston MA) is an American film, stage, television, and voice actor that graduated from Boston University's School of Fine and Applied Arts with a BFA in 1974. Snyder played the gas station man in the 1979 film The Warriors. He portrayed Soul Hunter #2 in Soul Hunter and Orin Zento in By Any Means Necessary, episodes ..."}, {"url": "https://en.wikipedia.org/wiki/John_Schneider_(screen_actor)", "passage_text": "Early life [edit]. Schneider was born April 8, 1960, in Mount Kisco, New York, the son of Shirley Conklin and John Jack Schneider III, a pilot who had served in the U.S. Air Force. His family included an older brother Robert, an artist living in up-state New York. In 2009, Schneider made an appearance on CSI in an episode titled Kill Me If You Can. He appeared in the first season of The Secret Life of the American Teenager, in which his real-life son Chasen Schneider had a recurring role. During the summer of 2008 and early 2009, John portrayed Marshall Bowman. He declined to continue through the second season and his character was killed off"}, {"url": "http://www.imdb.com/name/nm0773884/", "passage_text": "Actor | Director | Soundtrack. John Richard Schneider was born April 8, 1960, in Mt. Kisco, New York, to Shirley and John Schneider III, a pilot and U.S. Air Force veteran. His parents divorced when he was two. John began acting at the age of eight. He was in many plays in New York. He and his mother moved to Atlanta, Georgia, when he was fourteen. "}, {"url": "http://www.latimes.com/entertainment/gossip/la-et-mg-john-schneider-divorce-dukes-of-hazzard-20141217-story.html", "passage_text": "John Schneider of 'Smallville' and 'The Dukes of Hazzard' fame confirms it: He and wife Elly are divorcing. John Schneider, one of TV's original Dukes of Hazzard, confirmed Wednesday that he and his wife of 21 years are getting a divorce. John Schneider, left, and former Dukes of Hazzard costar Tom Wopat promote their Christmas album in New York on Dec. 3. John Schneider, left, and former Dukes of Hazzard costar Tom Wopat promote their Christmas album in New York on Dec. 3."}]