[{"url": "https://www.dmu.edu/medterms/musculoskeletal-system/musculoskeletal-system-diseases/", "passage_text": "Inflammation leads to pain and immobility in a joint area. Muscular dystrophy – Muscular dystrophy is a group of inherited diseases in which the muscles that control movement progressively weaken. The prefix, dys-, means abnormal. The most common form in children is called Duchenne muscular dystrophy and affects only males. It usually appears between the ages of 2 to 6 and the afflicted live typically into late teens to early 20s. Myasthenia gravis – “Muscular weakness, profound”."}, {"url": "https://www.dmu.edu/medterms/musculoskeletal-system/musculoskeletal-system-diseases/", "passage_text": "A more serious form of disease is called rheumatoid arthritis. The latter is an autoimmune disease wherein the body produces antibodies against joint tissues causing chronic inflammation resulting in severe joint damage, pain and immobility. The most common form in children is called Duchenne muscular dystrophy and affects only males. It usually appears between the ages of 2 to 6 and the afflicted live typically into late teens to early 20s. Myasthenia gravis – “Muscular weakness, profound”."}, {"url": "http://www.physiologyinfo.org/mm/What-is-Physiology/Muscular/Diseases-of-the-Muscular-System.html", "passage_text": "Diseases of the Muscular System. Myasthenia gravis. Myasthenia gravis (MG) is a condition where the body's own defense, the immune system, attacks the body. In MG, the intersection between nerve and muscle is the target, causing a blockade of signals that would otherwise command the muscle to go into action."}, {"url": "http://www.livestrong.com/article/87326-common-diseases-muscular-skeletal/", "passage_text": "Cells in the immune system cause the inflammation in the spine and the joints between the vertebrae. Symptoms of AS can range from mild back pain and discomfort to severe chronic pain. As the disease progresses, the chronic inflammation can cause new bone formation. Photo Credit BananaStock/BananaStock/Getty Images. The muscular and skeletal system of the body consists of the bones, along with the muscles, ligaments, joints, tendons, cartilage and connective tissues."}, {"url": "http://www.livescience.com/26854-muscular-system-facts-functions-diseases.html", "passage_text": "Symptoms, diagnosis and treatment. The most common symptom or sign of a muscle disorder is weakness, although muscle disorders can cause a number of symptoms, according to Schabbing. In addition to weakness, symptoms include abnormal fatigue with activity, as well as muscle spasms, cramping or twitching. There is no single type of doctor that treats muscular diseases and disorders. Rheumatologists, orthopedists and neurologists may all treat conditions that affect the muscles, according to the American Medical Association."}, {"url": "https://quizlet.com/5273943/common-diseases-disorders-musculoskeletal-system-flash-cards/", "passage_text": "Arthritis. inflammation of the joints--rheumatoid or degenerative (osteoarthritis); rheumatoid arthritis causes joint stiffness and/or soreness, pain and swelling and may lead to deformity; osteoarthritis produces pain, stiffness, and possible enlargement of bones, without deformity."}, {"url": "http://www.livestrong.com/article/87326-common-diseases-muscular-skeletal/", "passage_text": "Common Diseases of the Muscular & Skeletal System. The musculoskeletal system includes the bones and muscles. Photo Credit BananaStock/BananaStock/Getty Images. The muscular and skeletal system of the body consists of the bones, along with the muscles, ligaments, joints, tendons, cartilage and connective tissues. The main function of the musculoskeletal system is to provide the body with support"}, {"url": "http://www.healthline.com/health/musculoskeletal-disorders", "passage_text": "Given the different areas of the body that make up the musculoskeletal system, several other diseases can produce significant musculoskeletal signs and symptoms. These other disorders include: 1  low back pain. 2  fibromyalgia. 3  gout. 4  osteoarthritis. 5  rheumatoid arthritis. 6  tendinitis. This term is used to describe a variety of conditions that affect the muscles, bones, and joints. The severity of the MSD can vary. Pain and discomfort may interfere with everyday activities. MSDs are extremely common, and your risk increases with age."}, {"url": "http://www.livescience.com/26854-muscular-system-facts-functions-diseases.html", "passage_text": "Three types of muscles. The muscular system can be broken down into three types of muscles: skeletal, smooth and cardiac, according to the NIH. Skeletal muscles are the only voluntary muscle tissue in the human body and control every action that a person consciously performs. There is no single type of doctor that treats muscular diseases and disorders. Rheumatologists, orthopedists and neurologists may all treat conditions that affect the muscles, according to the American Medical Association."}, {"url": "https://www.dmu.edu/medterms/musculoskeletal-system/musculoskeletal-system-diseases/", "passage_text": "Musculoskeletal System Diseases. Arthritis – As we age, our joint tissues become less resilient to wear and tear and start to degenerate manifesting as swelling, pain, and oftentimes, loss of mobility of joints. Changes occur in both joint soft tissues and the opposing bones, a condition called osteoarthritis. The most common form in children is called Duchenne muscular dystrophy and affects only males. It usually appears between the ages of 2 to 6 and the afflicted live typically into late teens to early 20s. Myasthenia gravis – “Muscular weakness, profound”."}]