[{"url": "http://www.brighthub.com/environment/science-environmental/articles/96398.aspx", "passage_text": "Igneous rocks are rocks that have formed out of magma (molten rock). The two types of igneous rocks most common on Earth are called granite and basalt. Granite is a rock that typically looks pink and white with black specks. Basalt generally just looks black. The Six Types of Igneous Rocks. To recap, granite is a coarse-grained felsic rock, while basalt is a fine-grained mafic rock. All of the other combinations have names too. A coarse-grained mafic rock is called gabbro, and a fine-grained felsic rock is called rhyolite."}, {"url": "http://www.answers.com/Q/What_is_the_difference_between_granitic_magma_and_basaltic_magma", "passage_text": "Grantic magma is rich in silica with abundant sodium and potassium. It has an extremely high viscosity and cools to form light-colored rocks. Basaltic magma is low in silica with abundant iron and magnesium. It has the lowest viscosity among the common types of magma and cools to form dark-colored rocks. Basalt is the foundation of oceanic crust. Granite is an intrusive igneous rock made from visible mineral crystals, a result of cooling over a longer period of time under the surface of the Earth. Another difference between basalt and granite include their joints."}, {"url": "http://www.brighthub.com/environment/science-environmental/articles/96398.aspx", "passage_text": "To summarize, the two types of igneous rocks by chemical composition are felsic and mafic. Granite-typically composed of orthoclase, hornblende, biotite, and quartz-is a felsic rock type. Basalt is mostly olivine, augite, and calcium-rich plagioclase, therefore mafic. slide 3 of 6. The Six Types of Igneous Rocks. To recap, granite is a coarse-grained felsic rock, while basalt is a fine-grained mafic rock. All of the other combinations have names too. A coarse-grained mafic rock is called gabbro, and a fine-grained felsic rock is called rhyolite."}, {"url": "http://www.answers.com/Q/What_is_the_difference_between_basalt_and_granite", "passage_text": "Granite is the foundation of the continental crust. Basalt is the foundation of oceanic crust. Granite is an intrusive igneous rock made from visible mineral crystals, a result of cooling over a longer period of time under the surface of the Earth. Another difference between basalt and granite include their joints."}, {"url": "http://www.differencebetween.com/difference-between-basalt-and-vs-granite/", "passage_text": "Basalt and granite are two types of igneous rocks. All rocks of igneous origin are made up of magma or molten earth that finds its way up to the surface of the earth from fissures and cracks underneath the surface of earth. The molten rocks that come out in the form of lava, upon cooling takes shape of igneous rocks. • Basalt is darker and is composed of magnesium and iron, whereas granite is lighter and is made up of feldspar and quartz. • Basalt is called mafic, while granite is called felsic. • Basalt splits along columnar planes, while granite splits along horizontal planes."}, {"url": "http://www.differencebetween.com/difference-between-basalt-and-vs-granite/", "passage_text": "Basalt is an extrusive igneous rock, whereas granite is an intrusive ingenuous rock. Those who do not know, extrusive rocks are those formed of lava coming out of volcanoes, whereas rocks formed of magma that has yet not come out of the volcano are termed as intrusive rocks. • Basalt is darker and is composed of magnesium and iron, whereas granite is lighter and is made up of feldspar and quartz. • Basalt is called mafic, while granite is called felsic. • Basalt splits along columnar planes, while granite splits along horizontal planes."}, {"url": "http://www.answers.com/Q/What_is_the_difference_between_basalt_and_granite", "passage_text": "Basalt is an extrusive igneous rock with small mineral crystals, formed when magma cools and solidifies rapidly; this is usually on the surface of Earth's crust, especially at incidents of seafloor spreading on the ocean floor as contact with seawater cools the magma rapidly. Basalt is the foundation of oceanic crust. Granite is an intrusive igneous rock made from visible mineral crystals, a result of cooling over a longer period of time under the surface of the Earth. Another difference between basalt and granite include their joints."}, {"url": "http://www.answers.com/Q/What_is_the_difference_between_granitic_magma_and_basaltic_magma", "passage_text": "Basalt is the opposite of granite. Basalt is a mafic (dark coloured minerals rich in iron and magnesium)fine grained rock formed from the rapid cooling and crystallisation of lava above ground. Granite: Pale coloured, felsic, intrusive, coarse grained/porphyritic. Basalt is the foundation of oceanic crust. Granite is an intrusive igneous rock made from visible mineral crystals, a result of cooling over a longer period of time under the surface of the Earth. Another difference between basalt and granite include their joints."}]