[{"url": "https://answers.yahoo.com/question/index?qid=20080218142606AAPoGRi", "passage_text": "If you smoke marijuana on a regular basis it will stay in your system for as long as 45 days, and if you smoke marijuana at a constant pace, it can stay in the body for 90 days, Marijuana is fat soluble. Report Abuse. It is said that if you are a regular user is will leave your body after about 3 days. If you rarely use it it can take upto 3-4 weeks to leave your body. Some drugs can still be detected months after use as they leave a mark in your hair."}, {"url": "https://au.answers.yahoo.com/question/index?qid=20100831194115AAfnbDf", "passage_text": "If you smoke it occasionally it will remain in your system for up to 10 days. If you smoke marijuana on a regular basis it will stay in your system for as long as 45 days, and if you smoke marijuana at a constant pace, it can stay in the body for 90 days, Marijuana is fat soluble. It stores in the fat cells of the body, the brain, the liver, the kidneys, in other words the major organs. This is due to the fact that it takes so long for the THC to leave your system that you’ll probably test positive if you do not. If you don’t have an entire month to wait before you need to take the test, then you should definitely think about some other options to keep from testing positive."}, {"url": "https://au.answers.yahoo.com/question/index?qid=20100831194115AAfnbDf", "passage_text": "It’s estimated that THC can have a half life that ranges anywhere from 1-10 days. It’s almost impossible to find out what that half life is, which means that it is very difficult to use it to calculate how long it will take for all of the THC to leave your body. This is due to the fact that it takes so long for the THC to leave your system that you’ll probably test positive if you do not. If you don’t have an entire month to wait before you need to take the test, then you should definitely think about some other options to keep from testing positive."}, {"url": "http://www.faqs.org/qa/qa-11695.html", "passage_text": "Drink lots of water but don't drink as much water the day before because that might cause suspicions. It regularly takes 3 to 4 weeks or 24 to 36 days depending on your height and weight.Since THC is stored in fat cells exercise regulary. The following is a list of how long Marijuana remains detectable in urine drug screens: 1 2 joints: 2 3 days Oral ingestion: 1 5 days Moderate smoker (less than 4 times per week): 5 - 7 days. Heavy smoker (daily): 10 days."}, {"url": "http://www.ign.com/boards/threads/how-long-does-it-take-thc-to-completely-leave-your-system.202550979/", "passage_text": "If you smoke marijuana on a regular basis it will stay in your system for as long as 45 days, and if you smoke marijuana at a constant pace, it can stay in the body for 90 days, Marijuana is fat soluble. It stores in the fat cells of the body, the brain, the liver, the kidneys, in other words the major organs. This is due to the fact that it takes so long for the THC to leave your system that you’ll probably test positive if you do not. If you don’t have an entire month to wait before you need to take the test, then you should definitely think about some other options to keep from testing positive."}, {"url": "http://www.youtube.com/watch?v=teuPYdt3zl8", "passage_text": "• and the Frequency of Use. The most popular drug test is a urine test. THC will test positive in a urine drug test within 2-5 hours of use. If you are a one time user or no more than a couple of times per month, you may test positive for 1-6 days after your last use. A moderate or weekly user may test positive for 7-13 days after their last use. If marijuana use is detected in a hair drug test then it would show up 7 days after use and for as long as 90 days. Hair tests can reliably detect chronic or daily use, but may not detect occasional use. It is doubtful that one time marijuana use would be detected on a hair drug test."}, {"url": "http://www.theweedblog.com/how-long-does-marijuana-stay-in-your-system-infographic/", "passage_text": "On a Urine Drug Test, THC will appear as a positive within 2-5 hours of use. How long it will still show on a urine drug test is estimated based on frequency of use, but does not take into account the weight and body fat of the marijuana user: 1  One Time User may show positive for 1-6 days. 2  Moderate User may show positive for 7-13 days. Each test has a different detection time which is important to know. The urine drug test is the most commonly used because it is cheap and has a longer detection time than a saliva test. There are several very important factors that can influence how long THC will be present in your urine: 1  Weight."}, {"url": "https://answers.yahoo.com/question/index?qid=20080218142606AAPoGRi", "passage_text": "THC (Tetrahydrocannabinol) can stay in a person's body for as long as 3 to 90 days after smoking or being ingested orally. When you ask “How long does marijuana stay in your system?” you have to realize that it’s very unlikely that you’ll be able to get a usable answer. Report Abuse. It is said that if you are a regular user is will leave your body after about 3 days. If you rarely use it it can take upto 3-4 weeks to leave your body. Some drugs can still be detected months after use as they leave a mark in your hair."}, {"url": "http://www.mademan.com/mm/how-long-does-thc-stay-urine.html", "passage_text": "How long THC stays in urine depends on you. Bodyweight and previous exposure to marijuana are some of the main factors figuring into how long tetrahydrocannabinol can stay within your system. "}]