[{"url": "http://etymonline.com/index.php?term=bacteria", "passage_text": "bacteria (n.). 1847, plural of Modern Latin bacterium, from Greek bakterion small staff, diminutive of baktron stick, rod, from PIE *bak- staff used for support (also source of Latin baculum rod, walking stick). So called because the first ones observed were rod-shaped"}, {"url": "http://www.oxforddictionaries.com/definition/english/bacterium", "passage_text": "Usage. Bacteria is the plural form (derived from Latin) of bacterium. Like any other plural it should be used with the plural form of the verb: the bacteria causing salmonella are killed by thorough cooking, not the bacteria causing salmonella is killed by thorough cooking. More. This modern Latin term is formed from Greek baktērion ‘little staff’; the first bacteria to be discovered were rod-shaped. The word bacillus (late 19th century), a pathogenic bacterium, also meant ‘little rod’ in late Latin. Bacillus is also behind the French word debacle, adopted into English in the early 19th century"}, {"url": "https://en.wikipedia.org/wiki/Bacteria", "passage_text": "Carbon metabolism in bacteria is either heterotrophic, where organic carbon compounds are used as carbon sources, or autotrophic, meaning that cellular carbon is obtained by fixing carbon dioxide. Heterotrophic bacteria include parasitic types. Bacteria were among the first life forms to appear on Earth, and are present in most of its habitats. Bacteria inhabit soil, water, acidic hot springs, radioactive waste, and the deep portions of Earth's crust. Bacteria also live in symbiotic and parasitic relationships with plants and animals."}, {"url": "https://en.wiktionary.org/wiki/bacterium", "passage_text": "1 In most formal writing, bacterium is the singular form of the noun, and bacteria the plural form. 2  This is in accord with the word's Latin etymology. 3  However, in ordinary speech, some speakers use bacteria as a singular, with plural either bacteria or bacterias. 4  This is usually considered incorrect. Usage notes [edit]. 1  In most formal writing, bacterium is the singular form of the noun, and bacteria the plural form. 2  This is in accord with the word's Latin etymology."}, {"url": "https://en.wikipedia.org/wiki/Bacteria", "passage_text": "The word bacteria is the plural of the New Latin bacterium, which is the latinisation of the Greek βακτήριον (bakterion), the diminutive of βακτηρία (bakteria), meaning staff, cane, because the first ones to be discovered were rod-shaped. Bacteria were among the first life forms to appear on Earth, and are present in most of its habitats. Bacteria inhabit soil, water, acidic hot springs, radioactive waste, and the deep portions of Earth's crust. Bacteria also live in symbiotic and parasitic relationships with plants and animals."}, {"url": "http://www.answers.com/Q/What_is_the_latin_name_for_bacteria", "passage_text": "Confidence votes 2.4K. The origin is greek (baktērion) converted into new Latin as bacterium for singular and bacteria for plural. Nowadays the common usage is bacteria for singular and bacterias for plural. Latin is the language that used to be spoken in the Roman Empire, as such it is not a nationality. The term Latin is also used to describe people who come from countries where … Spanish and Portuguese is the primary language, and to describe those countries as a group; hence the term Latin America."}]