[{"url": "http://www.babycenter.com/0_baby-milestone-walking_6507.bc", "passage_text": "Most babies take their first steps sometime between 9 and 12 months and are walking well by the time they're 14 or 15 months old. Don't worry if your child takes a little longer, though. Some perfectly normal children don't walk until they're 16 or 17"}, {"url": "http://www.babycenter.com/0_baby-milestone-walking_6507.bc", "passage_text": "Going barefoot helps improve balance and coordination. What to do if your baby doesn’t walk. Don't fret if your child is simply taking her time. But if your child doesn't stand with support at 12 months, can't walk at 18 months, or isn't able to walk steadily at the age of 2 years, bring it up with her doctor."}, {"url": "http://www.kidspot.com.au/Childhood-firsts/Toddler-firsts-First-steps-Is-my-baby-ready-to-walk+6581+736+article.htm", "passage_text": "While the average age to start walking is between 12 and 13 months, there is a very broad range of 'normal'. Some babies are up and running at nine months old, while others are still contentedly moving around on all fours or cruising the furniture at 18 months."}, {"url": "http://www.answers.com/Q/At_what_age_do_babies_walk", "passage_text": "The average age would be somewhere around 12 months. But average for babies across the world has nothing to do with it. What matters is what is average for your baby. … You have babies that are pulling up as early as 5 months and walking as early as 7 months, or even earlier."}, {"url": "http://www.answers.com/Q/What_is_the_average_age_that_a_baby_starts_walking", "passage_text": "Confidence votes 19.3K. The average age would be somewhere around 12 months. But average for babies across the world has nothing to do with it. What matters is what is average for your baby. You have babies that are pulling up as early as 5 months and walking as early as 7 months, or even earlier."}, {"url": "https://answers.yahoo.com/question/index?qid=20060725041307AANPhcd", "passage_text": "Normally the average age is about 9 months, but that doesn't mean it's abnormal if they don't start walking until they're 12 - 14 months, or geniuses if they start at 6 months. Buying a baby walker helps them develop motor control and confidence and is well worth the small investment."}]