[{"url": "http://www.answers.com/Q/Where_did_the_Holocaust_take_place", "passage_text": "There was no single location for the holocaust. Most of the killings took place in Nazi-occupied Poland and other countries in Eastern Europe, which is where the great majority of the European Jews lived in 1939-1944. The Nazis transported Jews from other countries under Nazi control to the extermination camps in Nazi-occupied Poland."}, {"url": "http://www.hitlerschildren.com/article/1610-why-did-the-holocaust-happen", "passage_text": "The first thing to point out when examining the reasoning for why the holocaust happened is that Germany in the 1920's and 1930's was in a state of economic disrepair. This allowed a charismatic leader – Adolf Hitler – to rise to power and impose his will upon the German populace."}, {"url": "http://www.answers.com/Q/Over_how_many_years_did_the_Holocaust_take_place", "passage_text": "There was no single location for the holocaust. Most of the killings took place in Nazi-occupied Poland and other countries in Eastern Europe, which is where the great major … ity of the European Jews lived in 1939-1944."}, {"url": "http://www.answers.com/Q/Over_how_many_years_did_the_Holocaust_take_place", "passage_text": "Confidence votes 58.0K. The Final Solution was conceived by the Nazi's during WW2 which ended in 1945. It is hard to say exactly when the Holocaust started. It started slowly in the 1930's with more and more restrictive regulations for the Jews, etc."}, {"url": "http://www.hitlerschildren.com/article/1610-why-did-the-holocaust-happen", "passage_text": "One final thing to consider about why the holocaust was allowed to take place is a sad fact of human nature. The Nazis had been denigrating and dehumanizing the Jews of Germany for nearly a decade before the holocaust began in earnest."}, {"url": "http://www.jewishvirtuallibrary.org/jsource/Holocaust/history.html", "passage_text": "The Holocaust (also called Ha-Shoah in Hebrew) refers to the period from January 30, 1933 - when Adolf Hitler became chancellor of Germany-to May 8, 1945, when the war in Europe officially ended."}, {"url": "http://www.answers.com/Q/Over_how_many_years_did_the_Holocaust_take_place", "passage_text": "The Final Solution was conceived by the Nazi's during WW2 which ended in 1945. It is hard to say exactly when the Holocaust started."}, {"url": "https://answers.yahoo.com/question/index?qid=20070502163550AApWEuB", "passage_text": "Best Answer: The main reason why the Holocaust took place was due to WW1, now before you through stones read my theory: WW1 caused Germany to become under a state of economic depression due to the Treaty Of Versailles."}, {"url": "http://www.sahistory.org.za/article/human-rights-issues-during-and-after-world-war-ii-focus-nazi-germany-grade-12-2", "passage_text": "The Holocaust did not happen suddenly, it was the end of a long process of anti-Semitism. The Nazis had come to power in 1933, and used propaganda and terror to enforce their anti-Semitic policies. Laws were passed by the Nazis called the Nuremburg Laws. These laws took away all the human rights of Jews."}]