[{"url": "http://www.webmd.boots.com/allergies/news/20131224/nuts-in-pregnancy-reduces-child-nut-allergies", "passage_text": "Allergy to peanuts and tree nuts is the most common allergy in adults in children. Recent studies have shown that the rate of peanut allergy has doubled over a 5 year period in Europe and the US. Around 1 in 50 infants are now thought to be allergic to peanuts, and tree nut allergies also appear to more common. 24th December 2013 – Mothers who tuck into some nuts while pregnant may help protect their child against the risk of developing an allergy to peanuts and other nuts, according to a study."}, {"url": "http://www.medicalnewstoday.com/articles/270605.php", "passage_text": "Allergic reactions to peanuts and tree nuts can range from mild to life-threatening. But new research suggests that pregnant women who are not allergic to the nuts/legumes and who eat more of them during pregnancy lower the risk of their child developing an allergy to the food. Most pregnant women 'should not restrict diets'. The recent study suggests that women who consume tree nuts and peanuts (or peanut butter) during pregnancy could reduce the risk of their child developing an allergy to the foods."}, {"url": "http://www.cbsnews.com/news/eating-nuts-during-pregnancy-may-lower-childs-chance-of-peanut-tree-nut-allergies/", "passage_text": "A new study finds that kids whose mothers ate more nuts during their pregnancy were less likely to be allergic to peanuts or tree nuts. The American Academy of Allergy, Asthma and Immunology reports that 8 percent of kids have food allergies, and more than 30 percent of that group is allergic to multiple foods. A new study reveals pregnant women can reduce the chance that their children will have nut allergies by eating nuts themselves. According to rese... For the study, researchers looked at 8,205 children -- 308 of whom had food allergies. Out of that group, 140 had peanut and tree nut"}, {"url": "http://www.webmd.com/allergies/news/20101101/eating-peanuts-while-pregnant-may-up-allergy-risk", "passage_text": "Nov. 1, 2010 -- Babies with evidence of food allergies whose mothers ate peanuts during pregnancy may have an increased risk for potentially life-threatening peanut allergies, a new study suggests. Specifically, the blood test measured levels of a protein known as IgE, which are elevated in people with peanut allergies. But not everyone with high IgE levels is allergic, Sicherer says. Maternal consumption of peanuts during pregnancy was strongly predictive for this sensitivity, the researchers reported."}, {"url": "http://www.usatoday.com/story/news/nation/2013/12/23/peanut-allergy-pregnancy/4144583/", "passage_text": "A new study suggests that pregnant women who eat peanuts or tree nuts are less likely than others to have a child with a nut allergy. The more nuts women ate during their pregnancies, the less likely their child was to be allergic, according to the study, in today's JAMA Pediatrics. Story Highlights. 1  Women who ate peanuts or tree nuts while pregnant were less likely to have an allergic child. 2  Doctors no longer counsel women to avoid nuts while pregnant or during child's early years. 3  Some research suggests that avoiding nuts increases the risk of allergy."}, {"url": "http://www.usatoday.com/story/news/nation/2013/12/23/peanut-allergy-pregnancy/4144583/", "passage_text": "1 Women who ate peanuts or tree nuts while pregnant were less likely to have an allergic child. 2  Doctors no longer counsel women to avoid nuts while pregnant or during child's early years. 3  Some research suggests that avoiding nuts increases the risk of allergy. Story Highlights. 1  Women who ate peanuts or tree nuts while pregnant were less likely to have an allergic child. 2  Doctors no longer counsel women to avoid nuts while pregnant or during child's early years. 3  Some research suggests that avoiding nuts increases the risk of allergy."}, {"url": "http://www.webmd.com/allergies/news/20101101/eating-peanuts-while-pregnant-may-up-allergy-risk", "passage_text": "The findings do not prove that eating peanuts during pregnancy is a risk factor for peanut allergies in the first year or so of life. But they do highlight the need for more studies to answer the question, study researcher Scott H. Sicherer, MD, of New York’s Mount Sinai School of Medicine tells WebMD. Specifically, the blood test measured levels of a protein known as IgE, which are elevated in people with peanut allergies. But not everyone with high IgE levels is allergic, Sicherer says. Maternal consumption of peanuts during pregnancy was strongly predictive for this sensitivity, the researchers reported."}, {"url": "http://www.usatoday.com/story/news/nation/2013/12/23/peanut-allergy-pregnancy/4144583/", "passage_text": "Eating peanuts while pregnant cuts child's risk of allergy. A new study suggests that pregnant women who eat peanuts or tree nuts are less likely than others to have an allergic child. Story Highlights. 1  Women who ate peanuts or tree nuts while pregnant were less likely to have an allergic child. 2  Doctors no longer counsel women to avoid nuts while pregnant or during child's early years. 3  Some research suggests that avoiding nuts increases the risk of allergy."}]