[{"url": "https://en.wikipedia.org/wiki/Yarm", "passage_text": "Yarm is a small town and civil parish in the unitary authority of Stockton-on-Tees in North East England. The population of the ward in Stockton Unitary Authority was 9,745 at the 2011 census. Yarm Parish Church is the Anglican parish church, dedicated to St Mary Magdalene. It is situated on West Street, where there has been a church on the site since at least the 9th century. The Catholic church of Ss Mary and Romuald, built in 1860, is at the south end of High Street."}, {"url": "https://en.wikipedia.org/wiki/Yarm", "passage_text": "Yarm is part of the Stockton South Parliamentary Constituency which is represented in the House of Commons by James Wharton (Conservative), who was elected on 6 May 2010 for Stockton South. From 1997 to 2010 the Constituency was represented by Dari Taylor (Labour). Yarm Parish Church is the Anglican parish church, dedicated to St Mary Magdalene. It is situated on West Street, where there has been a church on the site since at least the 9th century. The Catholic church of Ss Mary and Romuald, built in 1860, is at the south end of High Street."}, {"url": "http://www.gazettelive.co.uk/all-about/yarm", "passage_text": "Yarm. Tweet. Yarm is a small market town situated on the south bank of the River Tees in north east England and was first mentioned in the Domesday Book of 1086. Yarm covers the TS15 postcode which includes Yarm, Crathorne, Picton, Hutton Rudby and Hilton and the local authority is Stockton Borough Council."}, {"url": "http://www.maplandia.com/united-kingdom/england/north/stockton-on-tees/yarm/", "passage_text": "detailed map of Yarm and near places. Welcome to the Yarm google satellite map! This place is situated in Stockton-on-Tees, North, England, United Kingdom, its geographical coordinates are 54° 30' 0 North, 1° 21' 0 West and its original name (with diacritics) is Yarm. The location of each Yarm hotel listed is shown on the detailed zoomable map. Moreover, Yarm hotel map is available where all hotels in Yarm are marked. You can easily choose your hotel by location."}, {"url": "https://en.wikipedia.org/wiki/Yarm", "passage_text": "Yarm Town Council has 11 seats with a chairman, who for ceremonial purposes, is Mayor. The Standing Orders of the Council restrict the chairman's period of office to 2 years in any 4-year period. The current chairman is Cllr Peter Monck. Yarm Parish Church is the Anglican parish church, dedicated to St Mary Magdalene. It is situated on West Street, where there has been a church on the site since at least the 9th century. The Catholic church of Ss Mary and Romuald, built in 1860, is at the south end of High Street."}, {"url": "http://www.picturesofengland.com/England/North_Yorkshire/Yarm", "passage_text": "About Yarm. Situated in the heart of the Tees valley, the picturesque town of Yarm has a long and interesting history. It was also highlighted on BBC Breakfast television on Friday 19 January 2007 as being the best high street in England. During medieval times, Yarm was one of the most important ports on the River Tees, and became home to shipbuilders, rope makers, clockmakers and tanners. In 1207 King John granted a royal charter for a weekly market and twice yearly. fair."}, {"url": "https://en.wikipedia.org/wiki/Yarm_railway_station", "passage_text": "Yarm railway station serves the town of Yarm in the borough of Stockton-on-Tees and ceremonial county of North Yorkshire, England. The station is 8.5 miles (14 km) south west of Middlesbrough on the North TransPennine Express Line and is operated by First TransPennine Express .. The station re-opened in 1996, replacing a former station further north that had closed in 1960 and is situated about a mile (1.6 km) south of the town's High Street. It is unstaffed, has bus stop type of shelter on each platform and a large, currently free, car park."}, {"url": "https://en.wikipedia.org/wiki/Yarm", "passage_text": "Yarm has five estates and the peninsular area where the town centre is situated. The estates are Willey Flatts, Layfield Farm, The Kebbell (locally known as Spitalfields), Leven Park and Levendale (occasionally referred to as Ingleby Grange). A map of Yarm showing main roads and estates. It is bordered by two rivers. Yarm Parish Church is the Anglican parish church, dedicated to St Mary Magdalene. It is situated on West Street, where there has been a church on the site since at least the 9th century. The Catholic church of Ss Mary and Romuald, built in 1860, is at the south end of High Street."}]