[{"url": "http://starchild.gsfc.nasa.gov/docs/StarChild/solar_system_level2/ceres.html", "passage_text": "Since its discovery in 1801, Ceres has been considered a comet, a planet, an asteroid, and a dwarf planet. Italian Giuseppe Piazzi discovered Ceres on January 1, 1801 while he was searching for a star. He first believed that he had discovered a comet, but he was not confident in his belief. Ceres was the largest known asteroid in the asteroid belt until 2006. In 2006, the International Astronomical Union formed a new class of solar system objects known as dwarf planets. By definition a dwarf planet is spherical and travels in an orbit around the Sun. Ceres fit the definition perfectly."}, {"url": "http://www.arcadiastreet.com/cgvistas/ceres_1070.htm", "passage_text": "Dwarf planets Ceres, Pluto, & Eris Pluto, a Kuiper object, was demoted to the status of dwarf planet in 2006 when the International Astronomical Union (IAU) reviewed Pluto's status in light of the recently discovered Eris, also a Kuiper object, but somewhat larger than Pluto. "}, {"url": "http://www.answers.com/Q/Why_is_a_dwarf_planet_not_considered_a_planet", "passage_text": "Pluto fails in this category. Thus it joins the other dwarf  planets, Ceres (which was called a planet longer than Pluto was),  and Eris, which is larger and more impressive than Pluto. Makemake  and Haumea are two more of our solar system's dwarf planets. Sedna,  Orcus, and Quaoar might also qualify as dwarf planets. "}, {"url": "http://www.sciencekids.co.nz/sciencefacts/space/dwarfplanets.html", "passage_text": "Ceres. Ceres is located in the asteroid belt between the orbits of Mars and Jupiter. It was discovered in 1801, well before Pluto and 45 years before Neptune. Ceres was considered a planet for around 50 years before being reclassified as an asteroid and once again in 2006 as a dwarf planet."}, {"url": "http://www.answers.com/Q/Why_is_Pluto_considered_a_dwarf_planet", "passage_text": "Pluto fails in this category. Thus it joins the other dwarf  planets, Ceres (which was called a planet longer than Pluto was),  and Eris, which is larger and more impressive than Pluto. Makemake  and Haumea are two more of our solar system's dwarf planets. Sedna,  Orcus, and Quaoar might also qualify as dwarf planets. "}, {"url": "http://www.space.com/22891-ceres-dwarf-planet.html", "passage_text": "Ceres is a dwarf planet, the only one located in the inner reaches of the solar system; the rest lie at the outer edges, in the Kuiper Belt. While it is the smallest of the known dwarf planets, it is the largest object in the asteroid belt. On Jan. 1, 1801, Sicilian astronomer Giuseppe Piazzi discovered what was then considered a planet, naming it Ceres for the Roman goddess of corn and harvests. Within a decade, four new objects were discovered in the same region, all also considered planets."}, {"url": "https://en.wikipedia.org/wiki/Ceres_(dwarf_planet)", "passage_text": "Ceres was the first asteroid discovered, by Giuseppe Piazzi at Palermo on 1 January 1801. It was originally considered a planet, but was reclassified as an asteroid in the 1850s when many other objects in similar orbits were discovered. Its diameter is approximately 945 kilometers (587 miles), making it the largest of the minor planets within the orbit of Neptune. The thirty-third largest known body in the Solar System, it is the only one identified orbiting entirely within the orbit of Neptune that is a dwarf planet."}, {"url": "http://science.nationalgeographic.com/science/space/solar-system/dwarf-planet/", "passage_text": "Dual Identity. Also considered by many to be an asteroid, Ceres, like Pluto, was also renamed as a dwarf planet in 2006. Ceres was discovered by Italian astronomer Giuseppe Piazzi in 1801. Ceres's shape resembles a flattened sphere with a diameter of about 590 miles (950 kilometers). "}, {"url": "https://en.wikipedia.org/wiki/Ceres_(dwarf_planet)", "passage_text": "Ceres (/ˈsɪəriːz/ ; minor-planet designation: 1 Ceres) is the largest object in the asteroid belt, which lies between the orbits of Mars and Jupiter. Its diameter is approximately 945 kilometers (587 miles), making it the largest of the minor planets within the orbit of Neptune. The thirty-third largest known body in the Solar System, it is the only one identified orbiting entirely within the orbit of Neptune that is a dwarf planet."}, {"url": "http://www.space.com/22891-ceres-dwarf-planet.html", "passage_text": "[ Infographic: Dwarf Planets in the Solar System ]. The largest object in the asteroid belt, Ceres makes up nearly a third of its mass. Even so, it remains the smallest known dwarf planet, only 590 miles (950 km) across — roughly the size of Texas. On Jan. 1, 1801, Sicilian astronomer Giuseppe Piazzi discovered what was then considered a planet, naming it Ceres for the Roman goddess of corn and harvests. Within a decade, four new objects were discovered in the same region, all also considered planets."}]