[{"url": "http://www.asknumbers.com/PoundsToKilogramsConversion.aspx", "passage_text": "The conversion factor from pounds to kilograms is 0.45359237. If the conversion is for the Troy weight (used for precious metals, gold, gemstones etc), the conversion factor is 0.3732417216. To find out how many kilograms in a pound, multiply the conversion factor by the value of pound or simply use the converter below."}, {"url": "http://www.thecalculatorsite.com/conversions/common/kg-to-pounds-ounces.php", "passage_text": "These tools help you convert between kilograms (kg), pounds and ounces, all of which are measurements of mass. I have built several different tools for you to use. Choose between the different options for kilogram, pounds & ounces conversions."}, {"url": "http://www.convertunits.com/from/kg/to/lbs", "passage_text": "You can view more details on each measurement unit: kg or lbs. The SI base unit for mass is the kilogram. 1 kilogram is equal to 2.20462262185 lbs. Note that rounding errors may occur, so always check the results. Use this page to learn how to convert between kilograms and pounds."}, {"url": "http://www.calculatorpro.com/calculator/kilograms-to-pounds-calculator/", "passage_text": "Kilograms to Pounds Definition. The Kilograms to Pounds Calculator easily converts kilograms to pounds (lbs) in almost real time. Simply enter in the number of kilograms and then the answer in pounds will appear after you hit the calculate button. There are 1,000 grams in a kilogram. There are 16 ounces in a pound. A kilogram is roughly the weight of one liter of water."}, {"url": "http://www.thecalculatorsite.com/conversions/common/kg-to-pounds-ounces.php", "passage_text": "Converting kilograms to pounds. There are 2.2046226218 pounds in 1 kilogram. So, if you want to do the calculation in your head, multiply your kilogram figure by 2.2 to get an approximate figure for pounds. Should you wish to convert from pounds to kilos, divide the figure by 2.2 for an approximation."}]