[{"url": "http://healthyeating.sfgate.com/sources-insoluble-fiber-1413.html", "passage_text": "Diets high in fiber also decrease your risk of heart disease because fiber helps your body excrete excess cholesterol in your blood. Fiber comes in two forms: soluble and insoluble. Many high-fiber foods contain both types of fiber, but most foods have higher amounts of one or the other. If you want to increase your insoluble fiber intake, choose foods that are high in this nutrient. "}, {"url": "http://www.livestrong.com/article/28882-list-foods-high-soluble-fiber/", "passage_text": "Vegetables containing at least 1 gram of soluble fiber per serving include parsnips, carrots, brussels sprouts, baked potato with skin, spinach, squash, string beans, cabbage, baked sweet potato, turnips, broccoli, kale and zucchini. Of the 4 grams of dietary fiber, 2 grams are soluble fiber. Bran provides 6 grams of dietary fiber per one-quarter cup. One serving of bran cereal provides up to 3 grams of soluble fiber. Barley, bulgur, whole wheat spaghetti and wheat germ contain 4 grams of dietary fiber including 1 gram"}, {"url": "http://healthyeating.sfgate.com/sources-soluble-fiber-natural-foods-2125.html", "passage_text": "Vegetables contain a high amount of water, fiber, vitamins and minerals. Brussels sprouts have one of the highest amounts of soluble fiber. A 1/2-cup serving contains 2 grams. Turnips, sweet potatoes and asparagus all have 1.7 grams or more. Oatmeal contains 1.4 grams of soluble fiber per 1/3-cup serving. Oats also contain high amounts of iron, phosphorus, magnesium and potassium. Oat bran and barley also have a high fiber content."}, {"url": "http://www.mayoclinic.org/healthy-lifestyle/nutrition-and-healthy-eating/in-depth/fiber/art-20043983", "passage_text": "1 Soluble fiber. 2  This type of fiber dissolves in water to form a gel-like material. 3  It can help lower blood cholesterol and glucose levels. 4  Soluble fiber is found in oats, peas, beans, apples, citrus fruits, carrots, barley and psyllium. 1 This type of fiber dissolves in water to form a gel-like material. 2  It can help lower blood cholesterol and glucose levels. 3  Soluble fiber is found in oats, peas, beans, apples, citrus fruits, carrots, barley and psyllium. 4  Ins"}, {"url": "http://www.fatfreekitchen.com/soluble-fiber-foods-list.html", "passage_text": "Foods appearing fiberous need not be high in fiber like lettuce. The whole grains, cereals, fruits, vegetables and nuts, in general, are good sources of soluble fibers. Given below is a list of foods with soluble and insoluble fiber content and their total fiber content. The following list suggests that psyllium husk, oat bran, parsnips, peas, potatoes, lentils, kidneybeans, etc. are rich soluble fiber sources. Soluble fiber is important for the management of blood cholesterol and keeping cancer away. This page gives a detailed list of foods with soluble and insoluble"}, {"url": "http://www.mayoclinic.org/healthy-lifestyle/nutrition-and-healthy-eating/in-depth/fiber/art-20043983", "passage_text": "Most plant-based foods, such as oatmeal and beans, contain both soluble and insoluble fiber. However, the amount of each type varies in different plant foods. To receive the greatest health benefit, eat a wide variety of high-fiber foods. 1 This type of fiber dissolves in water to form a gel-like material. 2  It can help lower blood cholesterol and glucose levels. 3  Soluble fiber is found in oats, peas, beans, apples, citrus fruits, carrots, barley and psyllium. 4  I"}, {"url": "https://www.prebiotin.com/resources/fiber-content-of-foods/", "passage_text": "Whole grain foods, dark leafy vegetables, fruit, nuts and seeds all contain insoluble fiber. Soluble fiber, on the other hand, creates a gel-like texture in your gut when mixed with liquid in your digestive tract. This gel helps slow down your digestion. "}, {"url": "http://www.dietitians.ca/getattachment/3bb6330f-0ab2-48fc-9d24-1303ad70003d/Factsheet-Food-Sources-of-Soluble-Fibre.pdf.aspx", "passage_text": "Certain types of foods contain more soluble fibre than insoluble fibre. To help you get more soluble fibre. in your diet, choose foods from the table below. Trusted advice from dietitians. www.dietitians.ca. Dried beans and peas, oat products, psyllium are some of the best sources of soluble fibre. "}, {"url": "http://healthyeating.sfgate.com/sources-soluble-fiber-natural-foods-2125.html", "passage_text": "Legumes consist of seeds that are covered by a pod or shell. This classification of foods, which includes beans, lentils, peanuts and peas, is high in both soluble and insoluble fiber. Black beans, kidney beans and navy beans are especially high in soluble fiber. Each contains at least 2 grams per 1/2-cup serving. Oatmeal contains 1.4 grams of soluble fiber per 1/3-cup serving. Oats also contain high amounts of iron, phosphorus, magnesium and potassium. Oat bran and barley also have a high fiber content."}]