[{"url": "http://www.specialtyenzymes.com/products", "passage_text": "Food grade, Kosher-certified, non-synthetic alkaline protease which can hydrolyze proteins from plants, fish, or animals to produce hydrolysates used to produce protein ingredients suitable for production of food flavor enhancers, meat extenders, fermented foods, and more. A special blend of naturally occurring microbes, enzymes, plant extracts and buffers used to digest grease, fats and oils in grease traps and/or effluent in restaurants, hospitals, schools, prisons, food and meat processing plants and slaughter houses."}, {"url": "http://www.mapsenzymes.com/Enzymes_Alcohol.asp", "passage_text": "A glucoamylase enzyme is used to break down the starch molecules and the dextrins. This enzyme is capable of achieving the complete degradation of the starch to fermentable sugars (glucose). During fermentation, these sugars are converted into alcohol by yeast in simultaneous saccharification and fermentation process. "}, {"url": "http://www.okcareertech.org/educators/cimc/new-products/clusters/science-technology-engineering-and-mathematics-cluster/pdf-files/enzymesandfoodprep.pdf", "passage_text": "It is necessary for the digestion of food. Proteins provide the amino acids that are required for building enzymes – the special proteins that start chemical reactions. These are the same enzymes that break food down so the body can use it. Enzyme reactions break food into compounds that are used by the body. Bread, cheese, and wine, which have been made for thousands of years, all require some sort of enzyme in their preparation process. Today, enzymes are used to improve foods in such ways as flavor, texture, appearance, and nutritional value."}, {"url": "http://www.absorblearning.com/chemistry/demo/units/LR1507.html", "passage_text": "The yeast, which is a type of fungus, contains enzymes which catalyse the breakdown of glucose and other sugars (in the absence of oxygen). This fermentation reaction is used in the brewing and breadmaking industries. There are many other uses of enzymes in the new biotechnology industries. "}, {"url": "https://en.wikipedia.org/wiki/Enzymatic", "passage_text": "Enzymes /ˈɛnzaɪmz/ are macromolecular biological catalysts. Enzymes accelerate, or catalyze, chemical reactions. The molecules at the beginning of the process are called substrates and the enzyme converts these into different molecules, called products. Almost all metabolic processes in the cell need enzymes in order to occur at rates fast enough to sustain life. Enzymes differ from most other catalysts by being much more specific. Enzyme activity can be affected by other molecules: inhibitors are molecules that decrease enzyme activity, and activators are molecules that increase activity."}, {"url": "http://www.sadgurupublications.com/ContentPaper/2012/7_152_SRCC_2(4)2012_P.pdf", "passage_text": "Enzymes lower the energy required for a reaction to occur, without being used up in the reaction. Many types of industries, to aid in the generation of their products, utilize enzymes. Examples of these products are; cheese, alcohol and bread. Fermentation is a method of generating enzymes for industrial purposes. Fermentation involves the use of microorganisms, like bacteria and yeast to produce the enzymes. There are two methods of fermentation used to produce enzymes. Solid state fermentation Solid-state fermentation (SSF) is another method used for the production of enzymes. Solid-state fermentation involves the cultivation of microorganisms on a solid substrate, such as grains, rice and wheat bran."}, {"url": "https://en.wikipedia.org/wiki/Enzymatic", "passage_text": "Some household products use enzymes to speed up chemical reactions: enzymes in biological washing powders break down protein, starch or fat stains on clothes, and enzymes in meat tenderizer break down proteins into smaller molecules, making the meat easier to chew. Enzymes differ from most other catalysts by being much more specific. Enzyme activity can be affected by other molecules: inhibitors are molecules that decrease enzyme activity, and activators are molecules that increase activity."}, {"url": "http://www.specialtyenzymes.com/products", "passage_text": "Food grade, Kosher-certified, non-synthetic acid protease which can hydrolyze proteins from plants, fish or animals to produce hydrolysates used to produce protein ingredients suitable for use in production of food flavor enhancers, meat extenders, fermented foods, and more. A special blend of naturally occurring microbes, enzymes, plant extracts and buffers used to digest grease, fats and oils in grease traps and/or effluent in restaurants, hospitals, schools, prisons, food and meat processing plants and slaughter houses."}, {"url": "https://en.wikipedia.org/wiki/Enzymatic", "passage_text": "Enzymes are used in the chemical industry and other industrial applications when extremely specific catalysts are required. Enzymes in general are limited in the number of reactions they have evolved to catalyze and also by their lack of stability in organic solvents and at high temperatures. Enzymes differ from most other catalysts by being much more specific. Enzyme activity can be affected by other molecules: inhibitors are molecules that decrease enzyme activity, and activators are molecules that increase activity."}]