[{"url": "http://www.mathsisfun.com/definitions/imperial-system.html", "passage_text": "Similar but not always the same as US standard units. Example of Imperial measures: Length: inches, feet, yards Area: square feet, acres Weight: pounds, ounces, Volume: fluid ounces, gallons The Imperial System has been replaced by the Metric System in most countries (including England). See: Metric System."}, {"url": "https://simple.wikipedia.org/wiki/Imperial_units", "passage_text": "The Imperial units or the Imperial system is a collection of measurement units. Commonwealth countries used this system from 1824 until they changed to the metric system. The imperial system is very similar to the American system but there are some differences."}, {"url": "http://www.onlineconversion.com/article_UK_units.htm", "passage_text": "Imperial unit. This article is about post-1824 Imperial units. The Imperial units or the Imperial system is a collection of English units, first defined in the Weights and Measures Act of 1824, later refined (until 1959) and reduced."}, {"url": "https://en.wikipedia.org/wiki/Imperial_units", "passage_text": "The system of imperial units or the imperial system (also known as British Imperial) is the system of units first defined in the British Weights and Measures Act of 1824, which was later refined and reduced."}, {"url": "http://www.disabled-world.com/artman/publish/imperial-measurements.shtml", "passage_text": "Imperial units or the Imperial system is a collection of units, first defined in the British Weights and Measures Act of 1824. Imperial units are not used in the United States. However the U.S. system of units is similar to the Imperial system which was used officially in the United Kingdom until 1995."}, {"url": "http://althistory.wikia.com/wiki/Imperial_Units_(New_World)", "passage_text": "The system of imperial units or the imperial system is the system of units first defined in the British Weights and Measures Act of 1824, which was later refined (until 1959) and reduced. The system came into official use across the British Empire."}, {"url": "http://www.onlineconversion.com/article_UK_units.htm", "passage_text": "Relation to other systems. The distinction between this imperial system and the U.S. customary units (also called standard units there) or older British/English units/systems and newer additions (foot-pound-second systems) is often not drawn precisely."}]