[{"url": "http://www.medscape.com/viewarticle/542486", "passage_text": "Airways are narrowed by inflammation of the larynx, trachea, and bronchi, as well as by heightened production of mucus. Croup is most common in children ages 6 months to 3 years, although it can be seen up to age 15 years and occasionally in adults. Viral croup is more common in males, with a male–female ratio of 3:2. The peak age for viral croup is 2 years. Most cases arise in the winter or fall. Croup is a community-acquired infection that results in inflammation of the larynx, bronchi, and trachea. In children, it is usually sufficiently mild for outpatient treatment, but the less common form seen in adults may require hospitalization."}, {"url": "http://www.answers.com/Q/How_long_is_the_incubation_period_for_croup", "passage_text": "1 By understanding this incubation period, you are better prepared to keep your child healthy a…. 2  Common Causes and Symptoms of Croup in Children Croup is a respiratory condition that typically affects children between 6 months and 6 years of age. If you keep the water temperature at a steady 70 degrees Fahrenheit, the incubation period for a goldfish is about five days. If the water temperature is kept at around 65 deg … rees Fahrenheit, the incubation period is about seven days."}, {"url": "http://www.medscape.com/viewarticle/542486", "passage_text": "Epidemiology. Croup is most common in children ages 6 months to 3 years, although it can be seen up to age 15 years and occasionally in adults. Viral croup is more common in males, with a male–female ratio of 3:2. The peak age for viral croup is 2 years. Most cases arise in the winter or fall. Croup is a community-acquired infection that results in inflammation of the larynx, bronchi, and trachea. In children, it is usually sufficiently mild for outpatient treatment, but the less common form seen in adults may require hospitalization."}, {"url": "http://www.cdc.gov/parainfluenza/hcp/clinical.html", "passage_text": "The incubation period, the time from exposure to HPIV to onset of symptoms, is generally 2 to 7 days. 1  HPIV-1 and HPIV-2 are most often associated with croup. 2  HPIV-1 often causes croup in children, whereas HPIV-2 is less frequently detected. "}, {"url": "http://www.webmd.com/children/guide/understanding-croup-basic-information", "passage_text": "Symptoms. Treatment. Croup lasts for five or six days and is highly contagious to other children. It usually affects children between the ages of 3 months and 6 years (the average age is 2 years), whose small windpipes and bronchial passages are most vulnerable to blockage. Most cases are mild and can be managed at home."}, {"url": "http://www.answers.com/Q/How_long_is_the_incubation_period_for_croup", "passage_text": "Croup is from one of 4 panaflu viruses. It is primarily airborne but can live a little while on objects. It can live in the air several or more hours. Like other flus, it can find a new host to infect within hours to days (1 to 4 days on average). If you keep the water temperature at a steady 70 degrees Fahrenheit, the incubation period for a goldfish is about five days. If the water temperature is kept at around 65 deg … rees Fahrenheit, the incubation period is about seven days."}, {"url": "http://www.babymd.net/croup.htm", "passage_text": "The fever, if present, only goes up to 102 and rarely lasts more than 2 days. The remaining symptoms will resolve over the next 10 to 14 days. The incubation period is 2 to 6 days and the child is contagious from 4 to 21 days or until they are improved. TREATMENT. Run a cool mist humidifier in the child s room. Close the door to the room so that the humidity builds up and aim the mist from overhead into the child s crib"}, {"url": "http://www.femail.com.au/croup.htm", "passage_text": "It occurs mostly in winter and usually affects pre-school children. Croup is most common between the months of October and March. The incubation period, which is the time between infection and the onset of the symptoms, depends on the virus, which is causing croup. The incubation period for parainfluenza virus is usually 3-5 days. Some children are more prone to developing croup, particularly children who were born prematurely or with narrowed respiratory passages. Children who have had croup may develop it again with each respiratory infection, during the next two to three years. "}, {"url": "http://www.medicinenet.com/croup/article.htm", "passage_text": "Rarely, it is caused by a bacterial infection. Croup is more common in children between 6 months and 3 years of age and rarely occurs in children over 6 years of age. It is more commonly seen from late fall through the early winter months. It has a slightly higher frequency in boys than in girls. "}]