[{"url": "http://my.clevelandclinic.org/services/heart/heart-blood-vessels/heart-valves", "passage_text": "The heart has four valves-one for each chamber of the heart. The valves keep blood moving through the heart in the right direction. The mitral valve and tricuspid valve are located between the between the atria (upper heart chambers) and the ventricles (lower heart chambers). The leaflets in the mitral and tricuspid valves are supported by: 1  Annulus: tough fibrous ring attached to the leaflets that help support and maintain the proper shape of the valve. 2  Chordae tendineae: tough, fibrous strings. 3  These are similar to the strings supporting a parachute."}, {"url": "http://www.heartcaremw.com/services/heart-valve-clinics/diseases-treatments.html", "passage_text": "The heart is divided into four main areas, or chambers – two upper chambers (called the left and right atrium) and two lower chambers (called the left and right ventricle). There are four valves that control the flow of blood through your heart. The heart is a muscular organ located in your chest between your lungs. The heart is designed to pump blood through your body. The right side of your heart pumps blood through the lungs, where the blood picks up oxygen. The left side of the heart receives this blood and pumps it to the rest of"}, {"url": "http://www.answers.com/Q/What_are_the_valves_in_the_heart_called", "passage_text": "There are two valves in the heart. They are tricuspid valve and bicuspid valve.There is a possibility of the blood going back into the atria. This is prevented by these two … valves, the tricuspid valve on the right side and the bicuspid valve on the left side. Answer   There are two valves in your heart. Between the Right atrium and ventricle there lies an AV-valve (A=atrium) (V=ventricle) hence the name AV-valve. It's al … so called like tricuspid valve... but i learned it the AV-valv"}, {"url": "https://en.wikipedia.org/wiki/Heart_valve", "passage_text": "Heart valves separate the atria from the ventricles, or the ventricles from a blood vessel. Heart valves are situated around the fibrous rings of the cardiac skeleton. The valves incorporate leaflets or cusps, which are pushed open to allow blood flow and which then close together to seal and prevent backflow. A heart valve normally allows blood to flow in only one direction through the heart. The four valves commonly represented in a mammalian heart determine the pathway of blood flow through the heart. A heart valve opens or closes incumbent on differential blood pressure on each side. The four main valves in the heart are: 1  The two atrioventricular (AV) valves, the mitral valve (bicuspid valve), and the tricuspid valve, which are between the upper atria and the lower ventricles"}, {"url": "http://www.answers.com/Q/What_are_the_valves_in_the_heart_called", "passage_text": "1 Tricuspid Valve (between the right atrium and the right ventricle). 2  Pulmonary Valve* (semilunar valve between the right ventricle and the pulmonary artery). 3  Mitral Valve (between the left atrium and the left ventricle). Answer   There are two valves in your heart. Between the Right atrium and ventricle there lies an AV-valve (A=atrium) (V=ventricle) hence the name AV-valve. It's al … so called like tricuspid valve... but i learned it the AV-valve"}, {"url": "http://www.answers.com/Q/What_are_the_valves_in_the_heart_called", "passage_text": "*sometimes called the Pulmonic Valve. This does not include the other two valves: the Thebesian valve, which can be sometimes absent in healthy individuals; and the eustachian valve, which is important during the fetal stages of life but is not necessary in adults. Answer   There are two valves in your heart. Between the Right atrium and ventricle there lies an AV-valve (A=atrium) (V=ventricle) hence the name AV-valve. It's al … so called like tricuspid valve... but i learned it the AV-valve"}, {"url": "https://en.wikipedia.org/wiki/Heart_valve", "passage_text": "1 The two atrioventricular (AV) valves, the mitral valve (bicuspid valve), and the tricuspid valve, which are between the upper atria and the lower ventricles. 2  The two semilunar (SL) valves, the aortic valve and the pulmonary valve, which are in the arteries leaving the heart. A heart valve normally allows blood to flow in only one direction through the heart. The four valves commonly represented in a mammalian heart determine the pathway of blood flow through the heart. A heart valve opens or closes incumbent on differential blood pressure on each side. The four main valves in the heart are: 1  The two atrioventricular (AV) valves, the mitral valve (bicuspid valve), and the tricuspid valve, which are between the upper atria and the lower ventricles"}, {"url": "http://www.texasheart.org/hic/topics/cond/valvedis.cfm", "passage_text": "There are 4 valves in the heart: tricuspid, pulmonary, mitral, and aortic. Regurgitation is also called insufficiency or incompetence. Regurgitation happens when a valve doesn't close properly and blood leaks backward instead of moving in the proper one-way flow. Every time your heart beats, blood flows into, through, and out of your heart. In fact, your heart moves about 100 gallons (379 liters) of blood through your body every hour. Two types of problems can disrupt blood flow though the valves: regurgitation or stenosis."}]