[{"url": "https://students.asu.edu/employment", "passage_text": "1 Graduate Assistants may work a total of 20 hours per week. 2  Click here to view Undergraduate Student Employment Communication and Graduate Student Employment Communication. 3  To not work more than 20 hours per week during the academic semesters if you are an international student on a visa. Student Employment offers a wide range of positions, which require different degrees of skill or experience. The student wage scale starts at $8.05/hour and should not exceed $50.00/hour."}, {"url": "http://www1.salary.com/Estimator-salary.html", "passage_text": "For example the median expected annual pay for a typical Estimator in the United States is $58,911 so 50% of the people who perform the job of Estimator in the United States are expected to make less than $58,911. Source: HR Reported data as of October 2015. Median $58,911. Our team of Certified Compensation Professionals has analyzed survey data collected from thousands of HR departments at companies of all sizes and industries to present this range of annual salaries for people with the job title Estimator in the United States."}, {"url": "http://www.salary.com/", "passage_text": "Timing is a key factor in your job search as well. Of course, people are hired or fired every single day of the year, and companies hold reviews all the time: at the end of the calendar year, end of the fiscal year, the anniversary of your … Read more... The 10 Most Searched Jobs"}, {"url": "http://money.usnews.com/careers/best-jobs/cost-estimator", "passage_text": "Salary. With a median salary of $59,460 per year, cost estimators wade at the deeper end of the construction-work earning pool. However, they are employed in nearly any industry that offers goods and services. The best-paid earned an impressive $98,140 in 2013, while the lowest earners took home $34,280. Shadowing a veteran cost estimator and on-the-job training are good ways to gain experience in the field. Hands-on experience is particularly important, as it gives applicants the chance to see and learn how the company handles estimates firsthand."}, {"url": "http://www1.salary.com/Estimator-salary.html", "passage_text": "The annual salary for someone with the job title Estimator may vary depending on a number of factors including industry, company size, location, years of experience and level of education. Our team of Certified Compensation Professionals has analyzed survey data collected from thousands of HR departments at companies of all sizes and industries to present this range of annual salaries for people with the job title Estimator in the United States."}, {"url": "http://www.payscale.com/research/US/Country=United_States/Salary", "passage_text": "Do career research and find in-depth salary data for specific jobs, employers, schools, and more. Aspiring office managers should have excellent communication, problem-solving, and managerial skills, as they are responsible for all activities, projects, and employees of their offices. It is essential that office managers work well in fast-paced environments, as they must oversee several ongoing projects at once.."}, {"url": "https://www.jobsearchintelligence.com/NACE/salary-calculator-intro/", "passage_text": "Educate To Career (ETC) is the leading resource for educational attainment to career outcomes data. Our same salary data are used by over 5,000 employers and 2,000 campus career centers. The ETC Salary Calculators are provided in partnership with Job Search Intelligence (JSI). "}, {"url": "http://money.usnews.com/careers/best-jobs/cost-estimator", "passage_text": "In fact, the Bureau of Labor Statistics predicts employment growth of about 26 percent by 2022, which is much faster than the average for all occupations and translates to more than 53,000 new jobs. With a median salary of $59,460 per year, cost estimators wade at the deeper end of the construction-work earning pool. However, they are employed in nearly any industry that offers goods and services. The best-paid earned an impressive $98,140 in 2013, while the lowest earners took home $34,280. Shadowing a veteran cost estimator and on-the-job training are good ways to gain experience in the field. Hands-on experience is particularly important, as it gives applicants the chance to see and learn how the company handles estimates firsthand."}, {"url": "https://students.asu.edu/employment", "passage_text": "1 US citizens or eligible non-citizens may not work more than an average of 25 hours a week (or 62.5 percent FTE) over a rolling twelve month period. 2  This maximum applies to the combined total of all jobs, including hours associated with stipends paid for services. Student Employment offers a wide range of positions, which require different degrees of skill or experience. The student wage scale starts at $8.05/hour and should not exceed $50.00/hour."}]