[{"url": "http://www.ehow.com/about_5073260_master-science-degree.html", "passage_text": "Master of Science degrees -- abbreviated M.S., M.Sc. or S.M. -- are awarded to acknowledge completion of a master's level graduate program in the sciences. After the Master of Arts (M.A.) degree, the M.S. is the graduate-level degree most commonly completed in the United States. "}, {"url": "http://www.mim-compass.com/Master-in-Management-MBA/Master-in-Management-Degrees", "passage_text": "Master of Science (MSc). Postgraduate studies such as Masters of Science are abbreviated MSc. The Master of Science in Management or the Master of Science of Management are postgraduate programs in general management. This is the type of program that the Financial Times Ranking for Masters in Management is about. Masters in Management degree programs are usually the Master of Science in Management (MSc) or the Master of Business Administration (MBA) although also Master of Arts programs (MA) in management do exist."}, {"url": "https://en.wikipedia.org/wiki/Master%27s_degree", "passage_text": "A master's degree (from Latin magister) is an academic degree awarded by universities upon completion of a course of study demonstrating a mastery or high-order overview of a specific field of study or area of professional practice. 1 Post-graduate research master's degree (M.Res., M.A.Res., M.S.Res., M.Phil.) - the Master by Research is designed for those who hold a bachelor's degree with a significant research component and/or have several publications. 2  It is designed for those wishing to pursue higher research."}, {"url": "http://www.accessmasterstour.com/?id=835", "passage_text": "A Master of Science degree is based on scientific learning. A bachelor's degree in a related field is almost always a prerequisite. Master of Science degrees are earned in economics, accounting, finance, management, engineering, information science, medicine, space studies, aviation and environmental studies."}, {"url": "http://www.masterstudies.com/MSc/", "passage_text": "A Master of Science (MSc) is a graduate degree that is normally awarded for studies in the sciences, engineering or medicine. Universities around the world offer MSc programs, which involve the completion of required coursework as well as research. Useful Links. A Master of Science degree is a postgraduate degree, commonly referred to as MSc, MS, Mag. or M.Sci. A Master of Science degree is usually awarded after completion of coursework that is in a large degree research-based. A Master of Science degree provides a scientific, technical or professional entry level competence"}, {"url": "http://www.collegeatlas.org/master-of-science.html", "passage_text": "The Master of Science (MSc) degree in Canada can be completed in one to three years of full-time study. Program duration is typically a function of the field of study and the institution sponsoring the degree program. All other aspects of the MSc degree are similar to the M.S. in the United States. Master of Science degrees can be course-based, research-based, or a combination of the two. Earning a four year bachelor’s degree is a standard prerequisite to admittance to an MSc program in Canada. "}, {"url": "http://www.masterstudies.com/MSc/", "passage_text": "MSc Programs. A Master of Science degree (or MSc for short) is a degree awarded at universities around the world for completion of graduate-level study in a science-or technology-related field. Enrolling in an MSc degree program translates to making a significant investment in one’s professional career. Useful Links. A Master of Science degree is a postgraduate degree, commonly referred to as MSc, MS, Mag. or M.Sci. A Master of Science degree is usually awarded after completion of coursework that is in a large degree research-based. A Master of Science degree provides a scientific, technical or professional entry level competence"}, {"url": "https://en.wikipedia.org/wiki/Master_of_Science", "passage_text": "A Master of Science degree (Latin: Magister Scientiae; abbreviated M.S. , MS, M.Sc. , MSc, M.Sci. , MSci, S.M. , Sc.M. , or Sci.M.) is a type of master's degree awarded by universities in many countries. The degree is usually contrasted with the Master of Arts degree. The Master of Science degree is typically granted for studies in the sciences or engineering or medicine, and is usually for programs that are more focused on scientific and mathematical subjects. The Master of Science (M.Sc.) is an academic degree for a post-graduate candidates or researchers, it usually takes from 2 to 3 years after passing The Bachelor of Science (B.Sc.) degree."}, {"url": "https://en.wikipedia.org/wiki/Master%27s_degree", "passage_text": "In countries in which a master's degree is a postgraduate degree, admission to a master's program normally requires holding a bachelor's degree, and in the United Kingdom, Canada and much of the Commonwealth, an honours bachelor degree. 1 Post-graduate research master's degree (M.Res., M.A.Res., M.S.Res., M.Phil.) - the Master by Research is designed for those who hold a bachelor's degree with a significant research component and/or have several publications. 2  It is designed for those wishing to pursue higher research."}]