[{"url": "http://senior-health.emedtv.com/solifenacin-succinate/what-is-solifenacin-succinate-used-for.html", "passage_text": "Solifenacin succinate is used for treating symptoms of an overactive bladder, such as frequent urination, leaking accidents, and urinary urgency. An overactive bladder is caused by contractions of the bladder muscle that are too frequent and usually uncontrollable. Normally, the bladder fills slowly until nerve signals tell your brain that the bladder is full and you need to use the bathroom."}, {"url": "http://www.rxlist.com/vesicare-drug.htm", "passage_text": "The structural formula of solifenacin succinate is: Solifenacin succinate is a white to pale-yellowish-white crystal or crystalline powder. It is freely soluble at room temperature in water, glacial acetic acid, dimethyl sulfoxide, and methanol. Each VESIcare tablet contains 5 or 10 mg of solifenacin succinate and is formulated for oral administration. Stop using solifenacin and call your doctor at once if you have a serious side effect such as: 1  hot, dry skin and extreme thirst; 2  severe stomach pain, or constipation for 3 days or longer; 3  pain or burning when you urinate;"}, {"url": "http://www.accessdata.fda.gov/drugsatfda_docs/label/2010/021518s008lbl.pdf", "passage_text": ", and a molecular weight of 480.55. The structural formula of solifenacin. succinate is: Solifenacin succinate is a white to pale-yellowish-white crystal or crystalline powder. It is freely. soluble at room temperature in water, glacial acetic acid, dimethyl sulfoxide, and methanol. C-solifenacin succinate to healthy volunteers, 69.2%. of the radioactivity was recovered in the urine and 22.5% in the feces over 26 days. Less than. 15% (as mean value) of the dose was recovered in the urine as intact"}, {"url": "http://www.webmd.com/drugs/2/drug-92256/solifenacin-oral/details", "passage_text": "Uses. Solifenacin is used to treat an overactive bladder. By relaxing the muscles in the bladder, solifenacin improves your ability to control your urination. It helps to reduce leaking of urine, feelings of needing to urinate right away, and frequent trips to the bathroom. "}, {"url": "http://senior-health.emedtv.com/solifenacin-succinate/solifenacin-succinate.html", "passage_text": "Solifenacin succinate (VESIcare ®) is a prescription medication used to treat certain bladder problems. In particular, it is approved to help treat the following overactive bladder symptoms: 1  Sudden, frequent urges to urinate (known as urinary urgency). 2  Leaking accidents (known as urinary incontinence or urge incontinence). 3  Frequent urination (known as urinary frequency)."}, {"url": "http://drugs.webmd.boots.com/drugs/drug-438-Solifenacin+Succinate.aspx", "passage_text": "1 Solifenacin is used to treat a number of bladder problems. 2  It is an antimuscarinic drug (it blocks certain types of nerve receptors called the muscarinic acetylcholine receptors), and is sometimes known as an anticholinergic drug. Symptoms of a serious allergic reaction include: rash, itching/swelling (especially of the face / tongue /throat), dizziness, trouble breathing. This is not a complete list of possible side effects."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMHT0012185/?report=details", "passage_text": "Solifenacin is used to treat symptoms of an overactive bladder, such as incontinence (loss of bladder control), a strong need to urinate right away, or a frequent need to urinate. Solifenacin works on the muscles of the bladder to prevent them from causing incontinence. "}, {"url": "http://senior-health.emedtv.com/solifenacin-succinate/what-is-solifenacin-succinate-used-for.html", "passage_text": "Solifenacin succinate (VESIcare ®) is a prescription medication approved for treating the symptoms of an overactive bladder. It belongs to a group of medications known as anticholinergics or antimuscarinics. An overactive bladder is caused by contractions of the bladder muscle that are too frequent and usually uncontrollable. Normally, the bladder fills slowly until nerve signals tell your brain that the bladder is full and you need to use the bathroom."}]