[{"url": "https://www.ebayinc.com/stories/news/ebay-paypal-become-independent-companies-2015/", "passage_text": "“eBay and PayPal will be sharper and stronger, and more focused and competitive as leading, standalone companies in their respective markets,” Donahoe continued. “As independent companies, eBay and PayPal will enjoy added flexibility to pursue new market and partnership opportunities. And we are confident following a thorough assessment of the relationships between eBay and PayPal that operating agreements can maintain synergies going forward."}, {"url": "http://www.pymnts.com/in-depth/2014/paypal-to-split-from-ebay/", "passage_text": "“As CEO of eBay, Wenig will lead the eBay Marketplaces and eBay Enterprise businesses. Revenue over the last twelve months for these two businesses grew approximately 10 percent year-over-year to $9.9 billion, with eBay Marketplaces accounting for about $8.7 billion."}, {"url": "https://www.ebayinc.com/stories/news/ebay-paypal-become-independent-companies-2015/", "passage_text": "1 The benefits of the existing relationships between eBay and PayPal will naturally decline over time and can be optimized in arm’s length operating agreements between the two entities. 2  Arm’s length operating agreements can formalize the existing relationships between the two companies and capture ongoing synergies."}, {"url": "http://www.webshopapps.com/blog/2015/01/ebay-to-sellipo-ebay-enterprise-magento/", "passage_text": "eBay to Sell/IPO eBay Enterprise & Magento. This is big news. Back in 2011 Magento was acquired by eBay for over $180 million. Now, after pretty much floundering around with it for 3 years eBay is going to cast it out for either full/partial acquisition or listing on the stock exchange (IPO) ."}, {"url": "http://www.webshopapps.com/blog/2015/01/ebay-to-sellipo-ebay-enterprise-magento/", "passage_text": "And with PayPal going then that relationship totally changes. You would hope (or maybe not) that Magento and eBay Enterprise will stay together, but there is clearly a risk someone acquiring will not see the value of Magento."}, {"url": "http://www.webshopapps.com/blog/2015/01/ebay-to-sellipo-ebay-enterprise-magento/", "passage_text": "On top of this eBay are laying off 2400 staff (7% of workforce) including across eBay Enterprise (which seems already stretched to me). Listening to the Earnings call and the subsequent questions one thing that strikes you is that there is very little talk of eBay Enterprise."}, {"url": "https://www.ebayinc.com/stories/news/gsi-commerce-becomes-ebay-enterprise/", "passage_text": "Today GSI becomes eBay Enterprise. It’s our new name as one of eBay Inc.’s three main business units. And it best captures our business today: a strong enterprise commerce partner of choice for retailers and brands, backed by the full capabilities of eBay Inc., a global commerce platform and payments leader."}, {"url": "http://www.pymnts.com/in-depth/2015/ebay-enterprise-spinoff-the-icahn-pact-and-paypals-future/", "passage_text": "“Our ecosystem has been disrupted,” he added. Another issue for eBay is that its growth currently hinges on PayPal contributions as eBay Marketplaces only grew 1 percent in Q4 and 6 percent in 2014. PayPal’s revenues increased 18 percent for the quarter and 19 percent for the year."}, {"url": "http://www.pymnts.com/in-depth/2015/ebay-enterprise-spinoff-the-icahn-pact-and-paypals-future/", "passage_text": "But with all the moves ahead for eBay and uncertainties about growth, Donahoe said 2015 will be a year of transitions. “With the planned separation of eBay and PayPal in 2015, we are moving forward with clarity and speed,” Donahoe said."}]