[{"url": "https://worldhistoryproject.org/1889/9/23/nintendo-founded", "passage_text": "Nintendo was founded as a Japanese business by Fusajiro Yamauchi in late 1889, originally named Nintendo Koppai. Based in Kyoto, Japan, the business produced and marketed a playing card game called Hanafuda. The handmade cards soon became popular, and Yamauchi hired assistants to mass produce cards to satisfy demand."}, {"url": "http://www.giantbomb.com/nintendo/3010-90/", "passage_text": "History. On September 23 1889, Fusajiro Yamauchi founded Nintendo Koppai, a small Japanese business based in Kyoto, Japan, which produced and marketed a playing card game called Hanafuda. The name Nintendo translates to leave luck to heaven.."}, {"url": "https://en.wikipedia.org/wiki/Nintendo", "passage_text": "Nintendo was founded as a card company in late 1889, later (1951) named Nintendo Koppai (Nintendo Playing Card Co. Ltd.), by Fusajiro Yamauchi. Based in Kyoto, Japan, the business produced and marketed a playing card game called Hanafuda."}, {"url": "https://worldhistoryproject.org/1889/9/23/nintendo-founded", "passage_text": "Nintendo Company Ltd. (任天堂株式会社, Nintendō Kabushiki gaisha) is a multinational corporation located in Kyoto, Japan founded on September 23, 1889 by Fusajiro Yamauchi to produce handmade hanafuda cards."}, {"url": "http://wanttoknowit.com/who-founded-nintendo/", "passage_text": "Believe it or not, Nintendo was originally founded as a playing cards company. On September the 23rd, 1889, Fusajiro Yamauchi founded Nintendo in Kyoto, Japan."}, {"url": "http://www.edn.com/electronics-blogs/edn-moments/4421502/Nintendo-is-founded--September-23--1889", "passage_text": "Founded in 1889 by Fusajiro Yamauchi in Kyoto, Japan, The Nintendo Playing Card Company was a small business that would go on to revolutionize gaming around the world."}, {"url": "https://en.wikiquote.org/wiki/Nintendo", "passage_text": "Nintendo is a multinational corporation founded on September 23, 1889 in Kyoto, Japan by Fusajiro Yamauchi to produce handmade hanafuda cards. In the mid-twentieth century, the company tried several small niche businesses, such as a love hotel and a taxi company."}]