[{"url": "http://www.answers.com/Q/What_are_the_stages_of_lupus", "passage_text": "Lupus is a remitting/flaring disease. There are no stages. If lupus is left untreated permanent organ damage is a possibility. There are classifications of lupus nephritis and stages within each classification, but there are no articulated stages of lupus in general. 1 Many symptoms of lupus disease are also associated with other conditions; many patie…. 2  Lupus: Available Treatment Options Lupus is a disease that attacks a person's immune system. 3  It is a chronic inflammatory disease that often will attack a person's joints, muscles, and organs."}, {"url": "http://www.kidney-cares.org/lupus-nephritis/", "passage_text": "Systematic Lupus Nephritis is a secondary renal glomerular disease caused by SLE (Systemic Lupus Erythematosus), a disease of immune system and can affect various organs of our body like skin, kidney and nerves. "}, {"url": "http://www.kidneyabc.com/lupus-nephritis-treatment/1342.html", "passage_text": "2013-03-25 14:23. Lupus nephritis is divided into 6 stages, in which stage 4 lupus nephritis is both of the most severe, and the most common subtype.An early and aggressive treatment can help halt the disease progression and protect renal function. The medical therapy for lupus nephritis depends on the severity of the disease.Corticosteroids are, in general, prescribed.More severe disease requires treatment with immunosuppressive agents.These drugs can suppress the immune system activity and inflammatory response temporarily."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/8686702", "passage_text": "Recurrence of lupus in transplanted allografts, often with the same histopathology as in the native kidney, occurs at a rate (2.7% to 3.8%) comparable to that for all allograft transplant failures (2% to 4%). CONCLUSIONS: End-stage lupus nephropathy patients require less medication owing to decreased disease activity. They are good candidates for dialysis and renal transplantation, with survival and recurrence rates no different from those of other patients with end-stage renal disease."}, {"url": "https://en.wikipedia.org/wiki/Systemic_lupus_erythematosus", "passage_text": "Systemic lupus erythematosus, often abbreviated as SLE or lupus, is a systemic autoimmune disease (or autoimmune connective tissue disease) in which the body’s immune system mistakenly attacks healthy tissue. There are many kinds of lupus. The most common type is systemic lupus erythematosus (SLE), which affects many internal organs in the body. SLE most often harms the heart, joints, skin, lungs, blood vessels, liver, kidneys, and nervous system."}, {"url": "http://umm.edu/health/medical/reports/articles/systemic-lupus-erythematosus", "passage_text": "Introduction. Systemic lupus erythematosus (SLE) is a chronic, often life-long, autoimmune disease. It can be mild to severe, and affects mostly women. SLE may affect various parts of the body, but it most often manifests in the skin, joints, blood, and kidneys. 1 Systemic is used because the disease can affect organs and tissue throughout the body. 2  Lupus is Latin for wolf. 3  It refers to the rash that extends across the bridge of the nose and upper cheekbones and was thought to resemble a wolf bite. 4  Erythematosus is from the Greek word for red and refers to the color of the rash."}, {"url": "http://www.healthline.com/health/lupus-nephritis", "passage_text": "Lupus nephritis symptoms are similar to those of other kidney diseases. They include: 1  dark urine. 2  blood in urine. 3  foamy, frothy urine. 4  having to urinate often at night. 5  puffy feet, ankles, and legs that gets progressively worse as the day goes along. Lupus nephritis is one of the most serious complications of lupus. It occurs when SLE causes your immune system to attack your kidneys—specifically, the parts of the kidney that filter the blood for waste products. The kidneys play a vital part in your body’s functioning. They remove waste from your blood"}, {"url": "https://en.wikipedia.org/wiki/Lupus_nephritis", "passage_text": "From Wikipedia, the free encyclopedia. Lupus nephritis is an inflammation of the kidney caused by systemic lupus erythematosus (SLE), a disease of the immune system. Apart from the kidneys, SLE can also damage the skin, joints, nervous system and virtually any organ or system in the body. "}]