[{"url": "http://www.webopedia.com/DidYouKnow/Computer_Science/wifi_explained.asp", "passage_text": "Wi-Fi Definition: What is Wi-Fi. Wi-Fi is the name of a wireless networking technology that uses radio waves to provide high-speed network and Internet connections. This Webopedia Did You Know... article explains Wi-Fi technology: how it works and misconceptions about Wireless Fidelity. Wi-Fi is simply a trademarked term meaning IEEE 802.11x. The false notion that the brand name Wi-Fi is short for wireless fidelity has spread to such an extent that even industry leaders have included the phrase wireless fidelity in a press release."}, {"url": "https://answers.yahoo.com/question/index?qid=20100316092234AADx32c", "passage_text": "Wi-Fi is a term for a network, almost always one that shares an Internet connection. Any mobile device that supports connecting to the Internet has Wi-Fi capabilities, and free Wi-Fi just means it's unsecure. Secure means you have to type a passcode to get in. WiFi itself does not mean Internet, but in the context Free WiFi it means free internet. WiFi works only with WiFi compatible mobile devices, like a WiFi enabled laptop (almost all sold today are wifi-enabled) and some mobile phones like iPhones."}, {"url": "https://en.wikipedia.org/wiki/Wi-Fi", "passage_text": "The Wi-Fi Alliance defines Wi-Fi as any wireless local area network (WLAN) product based on the Institute of Electrical and Electronics Engineers ' (IEEE) 802.11 standards. These can connect to a network resource such as the Internet via a wireless network access point. Such an access point (or hotspot) has a range of about 20 meters (66 feet) indoors and a greater range outdoors."}, {"url": "https://answers.yahoo.com/question/index?qid=20111116205217AA8x9P6", "passage_text": "Best Answer: WiFi stands for WIRELESS FIDELITY. WiFi, is a method of connecting to the internet. Wifi is not illegal, unless you connect to somebody else's wireless network without their permission. Wifi is used more commonly instead of wired internet connection. Wi-Fi (/ˈwaɪfaɪ/) or Wifi, is a mechanism for wirelessly connecting electronic devices. A device enabled with Wi-Fi, such as a personal computer, video game console, smartphone, or digital audio player, can connect to the Internet via a wireless network access point."}, {"url": "http://www.helpwithpcs.com/jargon/wifi-wireless.htm", "passage_text": "WI-FI-Wireless Fidelity 802.11a, 802.11b and 802.11g. WI-FI refers to a type of wireless technology which allows users to connect to a local network without the need for cables, also known as a WLAN (Wireless Local Area Network). WI-FI (Wireless Fidelity) specifically refers to the 802.11 standard, including 802.11a, 802.11b and 802.11g Wireless specifications. Wireless access points (called WI-FI Hotspots) are popping up all over the place, common locations include airports, hotels, coffee shops, train stations and libraries."}, {"url": "http://techterms.com/definition/wi-fi", "passage_text": "Wi-Fi. Wi-Fi is a wireless networking technology that allows computers and other devices to communicate over a wireless signal. It describes network components that are based on one of the 802.11 standards developed by the IEEE and adopted by the Wi-Fi Alliance. Examples of Wi-Fi standards, in chronological order, include:"}, {"url": "http://www.abbreviations.com/WIFI", "passage_text": "wireless local area network, WLAN, wireless fidelity, WiFi (noun). a local area network that uses high frequency radio signals to transmit and receive data over distances of a few hundred feet; uses ethernet protocol. see more on Definitions.net ». "}, {"url": "https://en.wikipedia.org/wiki/Wi-Fi", "passage_text": "Wi-Fi (or WiFi) is a local area wireless computer networking technology that allows electronic devices to network, mainly using the 2.4 gigahertz (12 cm) UHF and 5 gigahertz (6 cm) SHF ISM radio bands. These can connect to a network resource such as the Internet via a wireless network access point. Such an access point (or hotspot) has a range of about 20 meters (66 feet) indoors and a greater range outdoors."}, {"url": "http://mobileoffice.about.com/od/glossary/g/wi-fi.htm", "passage_text": "Wi-Fi is technically an industry term that represents a type of wireless local area network (LAN) protocol based on the 802.11 IEEE network standard. It's the most popular means of communicating data wirelessly, within a fixed location, today. Wi-Fi is a type of wireless networking protocol that allows devices to communicate without cords or cables."}]