[{"url": "http://medical-dictionary.thefreedictionary.com/somatic+chromosome", "passage_text": "The normal diploid number of chromosomes is constant for each species. For humans, the diploid number is 46 (23 pairs in all somatic cells). In the formation of gametes (ovum and spermatozoon), the number is reduced to one half (haploid number); i.e., the ovum and sperm each contain 23 chromosomes."}, {"url": "http://medical-dictionary.thefreedictionary.com/somatic+chromosome", "passage_text": "Each organism of a species is normally characterized by the same number of chromosomes in its somatic cells. The diploid numbers (number of total chromosomes per cell) are cattle—60, sheep—54, horse—64, donkey—62, pig—38, dog—78, cat—38, human—46."}, {"url": "http://www.answers.com/Q/How_many_autosomes_are_present_in_a_somatic_cell", "passage_text": "A human somatic cell carries a total of 46 chromosomes (23 homologous pairs). One pair of these are the sex chromosomes (an XX pair for females and an XY pair for males). That leaves 22 pairs of automes, for a total of 44."}, {"url": "http://medical-dictionary.thefreedictionary.com/somatic+chromosome", "passage_text": "Each organism of a species is normally characterized by the same number of chromosomes in its somatic cells, 46 being the number normally present in humans, including 22 pairs of autosomes and the two sex chromosomes (XX or XY), which determine the sex of the organism."}, {"url": "http://www.answers.com/Q/How_many_chromosomes_do_you_have_in_your_somatic_cells", "passage_text": "46 chromosomes are there in a human somatic cell. 22 pairs of homologous chromosomes are there with one pair of XX (in case of females) and one pair of XY (in case of males). Hence, 22 pairs of chromosomes + one pair of XX/XY chromosomes gives 23 pairs of chromosomes, i.e., 46 chromosomes."}, {"url": "http://ghr.nlm.nih.gov/handbook/basics/howmanychromosomes", "passage_text": "In humans, each cell normally contains 23 pairs of chromosomes, for a total of 46. Twenty-two of these pairs, called autosomes, look the same in both males and females. The 23rd pair, the sex chromosomes, differ between"}, {"url": "http://www.answers.com/Q/How_many_autosomes_are_present_in_a_somatic_cell", "passage_text": "Let's consider humans as our example. A human somatic cell carries a total of 46 chromosomes (23 homologous pairs). One pair of these are the sex chromosomes (an XX pair for females and an XY pair for males). That leaves 22 pairs of automes, for a total of 44."}, {"url": "http://www.wisegeek.org/what-are-somatic-cells.htm", "passage_text": "Germ cells each contain 23 chromosomes. When an egg and sperm fuse to produce a zygote, the new cell therefore has the full complement of 46, with one set of 23 from the egg and one from the sperm. All of the somatic cells that develop from the zygote have the same 46"}]