[{"url": "http://knifedogs.com/showthread.php?25899-new-handle-material-(kirinite)-by-eagle-grips", "passage_text": "Hey guys we got some new stuff at the hammer inn to try as handle scales. Its called Kirinite from eagle grips (Raj M Singh) Works kind of like plastic but tuffer,be careful not to heat up to high and this stuff is cool,the lines in it look 3-d after you buff it out. 7,719. At this point USAknifemaker.com will be the exclusive dealer for Kirinite knife handle material-at least initially. We will be starting with 6 different color pallets/patterns in 4 thicknesses (1/8, 3/16, 1/4, 3/8). We are still working through the initial dealer set up and hopefully we can move it right along"}, {"url": "http://faq.customtacticals.com/materials/g10.php", "passage_text": "Description. G10 is a Glass-based Epoxy Resin Laminate, which is formed by soaking layers of glass cloth in epoxy resin, and compressing them down and heating them until they set. G10 is very similar to Micarta and Carbon Fiber Laminate, in that they are all Resin Laminates, only the base material is changed. G10 can also be obtained in a Phenolic Resin version, but is called G3 and not often used for knifemaking. G10 Info. G10 is a Glass-based Epoxy Resin Laminate, which is formed by soaking layers of glass cloth in epoxy resin, and compressing them down and heating them until they set."}, {"url": "http://mtknives.net/2014/07/kirinite-knife-handles/", "passage_text": "Kirinite knife handles. Kirinite is a really interesting new handle material that has emerged in the past ten years or so, and made a big splash in the world of knife handles and gun grips. It’s made from “a toughened acrylic with very thin colored strands of poly paper swirled through the mix.” And the results are things like this: Another plus in the aesthetic side of things, as far as kirinite goes, is that it takes a fantastic polish without becoming slick and hard to grip. To get that smooth of a finish on a wood handle you have to put some type of finish on it to fill the grains, which is a lot of hassle."}, {"url": "http://supplies.customcutlery.com/micarta.htm", "passage_text": "If you choose to work with any of the Micarta® materials you should be ready to use some extra abrasives because one of this material's properties is wear resistance ... which you will figure out when you start to grind it. Micarta® is a material that is made from phenolic resigns, dyes, and a fill material like paper, linen, or canvas to create a very durable material that is very difficult to damage."}, {"url": "http://supplies.customcutlery.com/dymondwood.htm", "passage_text": "The layers are thinner in these new materials and brings out more pattern and details with less contouring. Diamondply is a laminated material that is made by dying thin layers of hardwoods and layering them together with resign and pressing them all together under extreme pressure and heat. We offer Diamondply in a wide variety of different color combinations as well as different thicknesses. We have recently made a special purchase of 3 pallets of Rosewood color Dymondwood that was hidden away in a warehouse for years. It is available in 3 thicknesses of material: 1/4, 1/2 and 2 and can be ordered as handle sets, slabs or turning squares for the 2 material."}, {"url": "http://mtknives.net/2014/07/kirinite-knife-handles/", "passage_text": "Kirinite is a very, very interesting synthetic material. Let’s look at the different aspects of it. Number one, kirinite is pretty durable. It’s at least as durable as a good hardwood, and probably a little lighter than a pair of hard ironwood scales. On top of that, it won’t shrink or warp like wood will do over time and with changes in humidity. Another plus in the aesthetic side of things, as far as kirinite goes, is that it takes a fantastic polish without becoming slick and hard to grip. To get that smooth of a finish on a wood handle you have to put some type of finish on it to fill the grains, which is a lot of hassle."}, {"url": "https://en.wikipedia.org/wiki/Cellulose_acetate_film", "passage_text": "Cellulose acetate film, or safety film, is used in photography as a base material for photographic emulsions. It was introduced in the early 20th century by film manufacturers as a safe film base replacement for unstable and highly flammable nitrate film. 1 As the acetate base shrinks, the gelatin emulsion of the film does not shrink, because it is not undergoing deterioration. 2  The emulsion and film base separate, causing buckling, referred to by archivists as 'channelling.' Sheet films are often severely channelled in the later stages of degradation."}]