[{"url": "http://www.aapos.org/terms/conditions/132", "passage_text": "Optometrist. Optometrists are healthcare professionals who provide primary vision care ranging from sight testing and correction to the diagnosis, treatment, and management of vision changes. An optometrist is not a medical doctor. An optometrist receives a doctor of optometry (OD) degree after completing four years of optometry school, preceded by three years or more years of college."}, {"url": "http://www.aoa.org/about-the-aoa/what-is-a-doctor-of-optometry?sso=y", "passage_text": "Doctors of Optometry (O.D.s/optometrists) are the independent primary health care professionals for the eye. Optometrists examine, diagnose, treat, and manage diseases, injuries, and disorders of the visual system, the eye, and associated structures as well as identify related systemic conditions affecting the eye."}, {"url": "http://www.djo.harvard.edu/site.php?url=/patients/pi/439", "passage_text": "Ophthalmologists. An ophthalmologist is a physician (doctor of medicine, MD, or doctor of osteopathy, DO) who specializes in the medical and surgical care of the eyes and visual system and in the prevention of eye disease and injury."}, {"url": "http://www.allaboutvision.com/eye-doctor/choose.htm", "passage_text": "An ophthalmologist is a medical doctor (MD) or an osteopathic doctor (DO) who specializes in eye and vision care. Ophthalmologists are trained to perform eye exams, diagnose and treat disease, prescribe medications and perform eye surgery. They also write prescriptions for eyeglasses and contact lenses."}, {"url": "http://www.allaboutvision.com/eye-doctor/choose.htm", "passage_text": "An optometrist is an eye doctor who has earned the Doctor of Optometry (OD) degree. Optometrists examine eyes for both vision and health problems, and correct refractive errors by prescribing eyeglasses and contact lenses. Some optometrists also provide low vision care and vision therapy."}, {"url": "http://www.aapos.org/terms/conditions/132", "passage_text": "An ophthalmologist — Eye M.D. — is a medical or osteopathic doctor who specializes in eye and vision care. Ophthalmologists differ from optometrists and opticians in their levels of training and in what they can diagnose and treat."}, {"url": "http://www.allaboutvision.com/eye-doctor/choose.htm", "passage_text": "An optician is not an eye doctor, but opticians are an important part of your eye care team. Opticians use prescriptions written by an optometrist or an ophthalmologist to fit and sell eyeglasses, contact lenses and other eyewear. In some states, opticians must complete an opticianry training program and be licensed."}]