[{"url": "https://en.wikipedia.org/wiki/Fort_Pierce,_Florida", "passage_text": "Fort Pierce is a city in and the county seat of St. Lucie County, Florida, United States. It is also known as the Sunrise City, sister to San Francisco, California, the Sunset City. The population was 41,590 at the 2010 census. The project is on a 2 year renourishment cycle due to impacts to the beach from the federal navigation project at Fort Pierce Inlet. This 2 year renourishment cycle is a much shorter renourishment interval than what is typical for other projects along the east coast of Florida."}, {"url": "http://www.yellowpages.com/fort-pierce-fl/county-of-st-lucie", "passage_text": "Early Learning Coalition Of St Lucie County Inc. 804 S 6th St Fort Pierce, FL 34950. (772) 595-6363. Rooms & Rates ». ARC of St Lucie County. 802 S 6th St Fort Pierce, FL 34950. (772) 465-0917. Rooms & Rates ». Marriage, Family, Child &..."}, {"url": "http://www.visitstluciefla.com/fort_pierce.htm", "passage_text": "Fort Pierce. As the County’s oldest community that was established in 1901, Fort Pierce is a city that retains it Old Florida fishing village look and feel, along with a friendly, welcoming atmosphere. Fort Pierce takes pride in its abundance of land conservation, pristine waterways, eco-assets and world record fishing opportunities."}, {"url": "https://en.wikipedia.org/wiki/Fort_Pierce,_Florida", "passage_text": "Fort Pierce was awarded the 2005 City of Excellence Award by the Florida League of Cities for overall excellence in city government and in 2011, Main Street Fort Pierce, Inc. received the Great American Main Street Award from the National Trust for Historic Preservation in downtown. The project is on a 2 year renourishment cycle due to impacts to the beach from the federal navigation project at Fort Pierce Inlet. This 2 year renourishment cycle is a much shorter renourishment interval than what is typical for other projects along the east coast of Florida."}, {"url": "https://en.wikipedia.org/wiki/St._Lucie_County", "passage_text": "Today the county seat of St. Lucie County is still known as Fort Pierce. In 1841, the United States government began issuing land grants under the Armed Occupation Act to Americans who were willing to settle the area. Several of these grants were within the boundaries of today's St. Lucie County. Up until 1905 the area had been under Brevard County (although Brevard County had been named St. Lucie County from 1844 until 1855 when it was renamed Brevard County). During the summer of 1905, St. Lucie County was created from the southern part of Brevard County with the county seat being at"}, {"url": "https://en.wikipedia.org/wiki/St._Lucie_County", "passage_text": "The city of Fort Pierce was chartered in 1901. Up until 1905 the area had been under Brevard County (although Brevard County had been named St. Lucie County from 1844 until 1855 when it was renamed Brevard County). During the summer of 1905, St. Lucie County was created from the southern part of Brevard County with the county seat being at Fort Pierce."}, {"url": "http://www.visitstluciefla.com/fort_pierce.htm", "passage_text": "Search. As the County’s oldest community that was established in 1901, Fort Pierce is a city that retains it Old Florida fishing village look and feel, along with a friendly, welcoming atmosphere. Fort Pierce takes pride in its abundance of land conservation, pristine waterways, eco-assets and world record fishing opportunities."}, {"url": "http://www.cityoffortpierce.com/140/City-Clerk", "passage_text": "City Clerk. Mission. The mission of the City Clerk’s Office is to provide excellence in customer service. We serve as the repository of the official records of the City of Fort Pierce and as such, provide proper and adequate access to those records by the public. "}, {"url": "https://en.wikipedia.org/wiki/St._Lucie_County", "passage_text": "St. Lucie County is a county located in the state of Florida. As of the 2010 census, the population was 277,789. The county seat is Fort Pierce. As of the 2013 Census Estimate, St. Lucie County is at a population of 286,832. Up until 1905 the area had been under Brevard County (although Brevard County had been named St. Lucie County from 1844 until 1855 when it was renamed Brevard County). During the summer of 1905, St. Lucie County was created from the southern part of Brevard County with the county seat being at"}, {"url": "http://www.visitstluciefla.com/", "passage_text": "See real time activities at three scenic Fort Pierce locations. Welcome to Fort Pierce, Port St. Lucie & Hutchinson Island Thank you for taking an interest in St. Lucie, Florida – home to the historic City of Fort Pierce, the vibrant City of Port St. Lucie and the breathtaking beaches of Hutchinson Island. Also in Port St. Lucie, baseball fans will be delighted to enjoy America’s favorite pastime at Tradition Field—spring training home of the New York Mets and summer home of the minor league St. Lucie Mets."}]