[{"url": "https://tex.org/how-much-do-orthopedic-surgeons-make-after-school-and-expenses/", "passage_text": "Orthopedic Surgeons will dedicate approximately 40,000 hours training and over $300,000 on their education. Becoming a recognized qualified surgeon takes a very long time, on average a surgeon will spend the equivalent of 20 years of full-time work just learning how. Once they have completed college and gained their degree those wanting to become an orthopedic surgeon have to attend medical school. This will see the student spending about 80 hours per week for 48 weeks each year studying and training for four years."}, {"url": "https://answers.yahoo.com/question/index?qid=20070903183715AA21cr3", "passage_text": "· just now. Report Abuse. Well you need to get a Biology/Bio-Chemistry Pre MEd oriented degree not and RN. That runs $12 to $35K per year depending on school Then you go to Medical School for 4 years and taht's $20-40K per year Then you Intern for 1 year that pays nothing and costs you nothing except room and board. Then you get into Orthopedic Surgery Residency for 4-5 years. That genearlly pays a Stiepend of $15-25K for each year until you are ready to take your boards. So the last 4 years you get paid a little money, enough to live on. "}, {"url": "http://www.healthcommunities.com/orthopedic-surgery/education-training-certification-orthopedic-surgeon.html", "passage_text": "Orthopedic Surgeon Education & Training. To become an orthopedic surgeon, candidates must complete an undergraduate program and 4 years of medical school, resulting in a medical degree. Training may include a full orthopedic rotation during medical school. After graduation, physicians must complete a 5-year residency program. Board certification requires an orthopedic surgeon to complete training in a residency program, practice in the field of orthopedic surgery for 2 years, and pass an examination (written and oral)."}, {"url": "https://answers.yahoo.com/question/index?qid=20071226165425AAFSgDh", "passage_text": "Report Abuse. The soonest you'll ever become a physician is 7 years after college (4 years of medical school and 3 years residency). The residency for an orthopedic surgeon is quite long. I'd expect it to be 5 or 6 years. Best Answer: 4 years undergrad 4 years med school 3+ years residency (thats where you learn the skills required to be a orthopedic surgeon). Source(s): im2spoiled4me · 8 years ago. Thumbs up."}, {"url": "http://study.com/articles/Surgeon_Career_Summary_and_Required_Education.html", "passage_text": "Becoming a surgeon is a lengthy process generally requiring four years of undergraduate school, four years of medical school and 3-10 years of residency and fellowship training. Surgeons also continue the education process throughout their careers in order to maintain licensure and stay informed of medical advances. "}, {"url": "https://tex.org/how-much-do-orthopedic-surgeons-make-after-school-and-expenses/", "passage_text": "On average an orthopedic surgeon will work five days in every working week, they will take 4 – 6 weeks off for vacation a year and also have to spend 2 weeks continuing their medical education which is a yearly requirement. Orthopedic surgeons will also be expected to be on call during some nights and weekends. Once they have completed college and gained their degree those wanting to become an orthopedic surgeon have to attend medical school. This will see the student spending about 80 hours per week for 48 weeks each year studying and training for four years."}, {"url": "http://www.bls.gov/ooh/healthcare/physicians-and-surgeons.htm", "passage_text": "Physicians and surgeons have demanding education and training requirements. Almost all physicians complete at least 4 years of undergraduate school, 4 years of medical school, and, depending on their specialty, 3 to 8 years in internship and residency programs. "}, {"url": "http://work.chron.com/schooling-needed-orthopedic-surgeon-10163.html", "passage_text": "Schooling. Becoming an orthopedic surgeon typically requires eight years of schooling, although some schools offer accelerated programs. The first four years are spent in earning a pre-medical degree. These are bachelor of science programs designed to meet the prerequisites for admission into a medical or osteopathic college. Its median salary for pediatric orthopedic surgeons was $425,000, while hand and wrist surgeons reported median salaries of $476,039 per year. Joint replacement surgeons enjoyed a median income of $605,953 per year, and spinal surgeons topped the list at $688,503 per year."}]