[{"url": "https://en.wikipedia.org/wiki/Kelly_(surname)", "passage_text": "Kelly /ˈkɛli/ is a surname in the English language. The surname is one of the most prevalent surnames in Ireland. It is also very common in Galloway, and the Isle of Man. The name O'Kelly, Kelly, Kelley, Kellie and the Gaelic form O'Ceallaigh, is the most common surname in Ireland."}, {"url": "http://www.surnamedb.com/Surname/kelley", "passage_text": "This interesting surname, with variant spellings Kelley and Kellie, has three distinct possible origins. Firstly, it is an Anglicized form of the great Old Gaelic name O'Ceallaigh. The Gaelic prefix O indicates male descendant of, plus the personal byname Ceallach meaning strife or contention. Finally, the name may be of Scottish territorial origin from the lands of Kelly near Arbroath, Angus, named with the Gaelic element coille, wood or grove. John de Kelly, noted in Scottish Acts of Parliament was abbot of Arbroath in 1373."}, {"url": "http://genealogy.about.com/od/surname_meaning/p/kelly.htm", "passage_text": "KELLY Surname Meaning & Origin: The Kelly surname, along with common variants Kelley and Kellie, has a number of possible origins. Most commonly it loosely means descendant of war, from the ancient Irish name O'Ceallaigh.. The Gaelic prefix O indicates male descendant of, plus the personal byname Ceallach meaning strife or contention. The name may also mean bright headed.. Kelly is the 2nd most common surname in Ireland and the 69th most popular surname in the United States."}, {"url": "http://www.sheknows.com/baby-names/name/kelly", "passage_text": "Scottish Meaning: The name Kelly is a Scottish baby name. In Scottish the meaning of the name Kelly is: Wood. Surname and place name that has only been used as a first name (either gender) in the latter half of the 20th century. The name Kelly is an Irish baby name. In Irish the meaning of the name Kelly is: War. Lively. Aggressive. An Irish sur"}, {"url": "https://en.wikipedia.org/wiki/Kelly_(surname)", "passage_text": "In many cases Kelly is an Anglicisation of the Irish surname O ó (CEALLAIGH:ipa), oːˈcal̪ˠiː which means descendant Of  ceallach or it can also mean warrior or. fighter The surname is one of the most prevalent surnames in Ireland. It is also very common in Galloway, and the Isle of Man. The name O'Kelly, Kelly, Kelley, Kellie and the Gaelic form O'Ceallaigh, is the most common surname in Ireland."}, {"url": "https://en.wikipedia.org/wiki/Kelly_(surname)", "passage_text": "For example, the surname can be derived from two places in Scotland: Kelly, near Arbroath; and Kellie, in Fife. The surname can also be derived from a place name in England: Kelly, in Devon. This place name is derived from the Cornish celli, meaning wood or grove. The surname is one of the most prevalent surnames in Ireland. It is also very common in Galloway, and the Isle of Man. The name O'Kelly, Kelly, Kelley, Kellie and the Gaelic form O'Ceallaigh, is the most common surname in Ireland."}, {"url": "https://en.wikipedia.org/wiki/Kelly_(surname)", "passage_text": "In other cases the surname Kelly is an Anglicisation of the Irish O ó, cadhla which means descendant Of . Cadhla The’O kelly Or kelly of The clan Brasil Mac coolechan originated as a chieftain clan of The. ulaidh The surname is one of the most prevalent surnames in Ireland. It is also very common in Galloway, and the Isle of Man. The name O'Kelly, Kelly, Kelley, Kellie and the Gaelic form O'Ceallaigh, is the most common surname in Ireland."}, {"url": "http://www.behindthename.com/name/kelly", "passage_text": "Meaning & History. Anglicized form of the Irish given name CEALLACH or the surname derived from it O ó. Ceallaigh as a, surname it has been borne by actor and Dancer Gene (kelly-1912) 1996 and actress and Princess Grace (kelly-1929). 1982 "}, {"url": "http://www.surnamedb.com/Surname/kelley", "passage_text": "In 1521, the birth of Henry, son of William Kelly and Jane Trecarrell, was recorded in Kelly, Devonshire. Finally, the name may be of Scottish territorial origin from the lands of Kelly near Arbroath, Angus, named with the Gaelic element coille, wood or grove. John de Kelly, noted in Scottish Acts of Parliament was abbot of Arbroath in 1373."}]