[{"url": "http://home.costhelper.com/tile-flooring.html", "passage_text": "1 Terracotta tiles are $1-$2.50 a square foot, or $100-$250 for 10x10 fee t; European terracotta may cost more. 2  Natural stone tiles of marble, granite, slate or more start at $2 a square foot, or $200 for 10x10-feet, but costs climb rapidly for custom designs or special orders. 1 Natural stone tiles of marble, granite, slate or more start at $2 a square foot, or $200 for 10x10-feet, but costs climb rapidly for custom designs or special orders. 2  Mosaics are any tile less than two inches square (although they can be round or hexagonal), usually mounted on a 12x12-inch mesh sheet."}, {"url": "https://flooring.installationcalculator.com/how-much-do-tile-floors-cost/", "passage_text": "Generally, retail cost for medium grade tile flooring material is between $1.50 dollars and $3.0 per square foot, however the cost of tile flooring and the labor involved to install it depends on both the quality of materials and the area of the country/state you live in. "}, {"url": "http://home.costhelper.com/tile-flooring.html", "passage_text": "1 A under-tile warming system costs $1,100 or more for a 10x10-foot bathroom; for details, visit Ceramic-Tile-Floor.info. 2  The World Floor Covering Association provides a directory of retail floor stores by zip code. 3  Major manufacturers include Armstrong and Daltile. 1 Natural stone tiles of marble, granite, slate or more start at $2 a square foot, or $200 for 10x10-feet, but costs climb rapidly for custom designs or special orders. 2  Mosaics are any tile less than two inches square (although they can be round or hexagonal), usually mounted on a 12x12-inch mesh sheet."}, {"url": "https://flooring.installationcalculator.com/", "passage_text": "$1.50 per square foot for the tile multiplied by 250 square feet, which equals $375. Add in 10% and the total for flooring materials comes to $412.50. For labor, $3 times 250 square feet equals $750. No need to add 10% here. Add in the removal and haul away for the carpeting and the total labor cost is $900. "}, {"url": "http://homeguides.sfgate.com/cost-retile-bathroom-floor-95268.html", "passage_text": "As of January 2014, the cost for removing tile averages $3 to $5 per square foot while the cost for professional installation of new tile can range from $5 to $17 per square foot -- depending on the tile material chosen and size of the bathroom. For example, a 10-by-10 bathroom would need 100 square feet of tile; choosing laminate tile at $1 per square foot would cost $100 while selecting porcelain tile at $2.50 per square foot would cost $250. Look for sale, clearance or close-out pricing to get the best deal"}, {"url": "http://homewyse.com/services/cost_to_install_ceramic_floor_tile.html", "passage_text": "Our free calculator uses recent, trusted data to estimate costs for your Ceramic Floor Tile Installation project. For a basic 120 square feet project in zip code 47474, the benchmark cost to Install Ceramic Floor Tile ranges between $9.83 - $13.74 per square foot* . To estimate costs for your project: 1. Set Project Zip Code Enter the Zip Code for the location where labor is hired and materials purchased."}, {"url": "http://home.costhelper.com/tile-flooring.html", "passage_text": "1 Installation charges start around $5-10 a square foot ($500-$1,000 for 10x10-feet) and rise sharply for custom work. 2  Odd room layouts cost more. 3  There's usually a fee for moving furniture or tearing out the old floor. 1 Natural stone tiles of marble, granite, slate or more start at $2 a square foot, or $200 for 10x10-feet, but costs climb rapidly for custom designs or special orders. 2  Mosaics are any tile less than two inches square (although they can be round or hexagonal), usually mounted on a 12x12-inch mesh sheet."}, {"url": "http://homewyse.com/services/cost_to_install_tile_floor.html", "passage_text": "Get an INSTANT estimate of the cost to Install a Tile Floor! Our free calculator uses recent, trusted data to estimate costs for your Tile Floor Installation project. For a basic 120 square feet project in zip code 47474, the benchmark cost to Install a Tile Floor ranges between $10.02 - $14.22 per square foot* . To estimate costs for your project: 1. Set Project Zip Code Enter the Zip Code for the location where labor is hired and materials purchased"}, {"url": "http://www.networx.com/cost-guide/install-ceramic-tile-floor", "passage_text": "Planning to install a ceramic tile floor? You can expect to pay in the range of $1,100 to $1,825 for 120 square feet (the size of a smallish kitchen or a large master bathroom). That includes standard quality tiles, supplies, and labor. The cost to install your tile floor will depend on: 1  Size of area to be tiled."}]