[{"url": "http://serendip.brynmawr.edu/biology/b103/f02/web1/awardy.html", "passage_text": "Adrienne Wardy. Although many people are unaware of its existence, social anxiety disorder is the third most common psychiatric disorder, after depression and alcoholism, according to the Medical Research Council on Anxiety Disorders (1) . "}, {"url": "http://www.calmclinic.com/anxiety/causes", "passage_text": "Change. Change can actually lead to anxiety disorders as well. Some people adapt to change quickly, but many others do not. This includes smaller changes, like a new job or a new home, or larger changes, like the loss of a loved one, a divorce, or a significant move. Serotonin, norepinephrine, and GABA deregulation can affect the entire body, not just the mind, and may create a variety of symptoms that indicate an anxiety problem. Take my free 7 minute anxiety questionnaire to see what symptoms of yours may be related to faulty neurochemical transmission."}, {"url": "http://www.gulfbend.org/poc/view_doc.php?type=doc&id=38470&cn=1", "passage_text": "Biological Explanations of Anxiety Disorders. The human body is an amazing and very complex organism. The intricacies of our bodies, especially our brains, are presumed to be involved in the origins and maintenance of anxiety disorders. As mentioned, biological factors (or vulnerabilities) usually have to be in place for an anxiety disorder to manifest."}, {"url": "http://www.medicalnewstoday.com/info/anxiety/anxiety-treatments.php", "passage_text": "Anxiety can be treated medically, with psychological counseling, or independently. Ultimately, the treatment path depends on the cause of the anxiety and the patient's preferences. Often treatments will consist of a combination of psychotherapy, behavioral therapy, and medications. However, this may be limited to situations in which the duration of the anxiety is short and the cause is identified and can be eliminated or avoided. There are several exercises and actions that are recommended to cope with this type of anxiety: 1  Learn to manage stress in your life."}, {"url": "http://www.gracepointwellness.org/1-anxiety-disorders/article/38470-biological-explanations-of-anxiety-disorders", "passage_text": "Biological Explanations of Anxiety Disorders. The human body is an amazing and very complex organism. The intricacies of our bodies, especially our brains, are presumed to be involved in the origins and maintenance of anxiety disorders. As mentioned, biological factors (or vulnerabilities) usually have to be in place for an anxiety disorder to manifest."}, {"url": "https://www.psychologytoday.com/basics/anxiety", "passage_text": "Generally, anxiety arises first, often during childhood. Evidence suggests that both biology and environment can contribute to the disorder. Some people may have a genetic predisposition to anxiety; however, this does not make development of the condition inevitable. Early traumatic experiences can also reset the body’s normal fear-processing system so that it is hyper-reactive to stress"}, {"url": "https://en.wikipedia.org/wiki/Anxiety", "passage_text": "Anxiety is an emotion characterized by an unpleasant state of inner turmoil, often accompanied by nervous behavior, such as pacing back and forth, somatic complaints and rumination. It is the subjectively unpleasant feelings of dread over anticipated events, such as the feeling of imminent death. Anxiety is not the same as fear, which is a response to a real or perceived immediate threat; whereas anxiety is the expectation of future threat. Anxiety is a feeling of fear, uneasiness, and worry, usually generalized and unfocused as an overreaction to a situation that is only subjectively seen as menacing. It is often accompanied by muscular tension, restlessness, fatigue and problems in concentr"}, {"url": "http://www.calmclinic.com/anxiety/causes", "passage_text": "It's a question that is so difficult to answer. It's not like having a cold-you can't simply wake up with an anxiety disorder because you forgot to wash your hands before eating. Anxiety disorders are forged over years of experiences. They have a genetic component, an upbringing component, an environmental component. Serotonin, norepinephrine, and GABA deregulation can affect the entire body, not just the mind, and may create a variety of symptoms that indicate an anxiety problem. Take my free 7 minute anxiety questionnaire to see what symptoms of yours may be related to faulty neurochemical transmission."}, {"url": "https://www.mentalhelp.net/articles/biological-explanations-of-anxiety-disorders/", "passage_text": "The human body is an amazing and very complex organism. The intricacies of our bodies, especially our brains, are presumed to be involved in the origins and maintenance of anxiety disorders. As mentioned, biological factors (or vulnerabilities) usually have to be in place for an anxiety disorder to manifest. Therefore, they are more likely to experience pathological levels of anxiety. In a related way, certain personality characteristics are thought to have a genetic component. One such characteristic is called neuroticism."}, {"url": "http://umm.edu/health/medical/reports/articles/anxiety-disorders", "passage_text": "The standard approach to treating most anxiety disorders is a combination of talk therapy, such as cognitive-behavioral therapy (CBT), and an antidepressant medication. Other types of medications (benzodiazepines, azapirones, beta blockers, or atypical antipsychotics) may also be prescribed. "}]