[{"url": "http://www.crwflags.com/fotw/flags/es-cl-bu.html", "passage_text": "4. The flag of Burgos Province shall be displayed, in a specific place, in the Honour Room, in the Commission Room, and in the official press room of the President, together with the national flag and the flag of Castilla y Leon. león. 5 The current flag of the Province has been used since 1979. 2. The flag of Burgos Province is made of the coat of arms described in the previous Article, centered on a purple field (Pantone 229) in proportions 2:3. 3."}, {"url": "https://en.wikipedia.org/wiki/Province_of_Burgos", "passage_text": "The province has an area of 14,300 km² and a population of approximately 375,000 of whom nearly half live in the capital. The other locations higher than 20,000 inhabitants apart from Burgos are Miranda de Ebro and Aranda de Duero, both very industrialized. The province of Burgos is divided into 371 municipalities, being the Spanish province with the highest number, although many of them have fewer than 100 inhabitants."}, {"url": "https://en.wikipedia.org/wiki/Province_of_Burgos", "passage_text": "The province of Burgos is a province of northern Spain, in the northeastern part of the autonomous community of Castile and Leon. león The province of Burgos is divided into 371 municipalities, being the Spanish province with the highest number, although many of them have fewer than 100 inhabitants."}, {"url": "https://en.wikipedia.org/wiki/Burgos", "passage_text": "Early humans occupied sites around Burgos as early as 800,000 years ago. When the Romans took possession of what is now the province of Burgos, the site had been a Celtiberian city. In Roman times, it belonged to Hispania Citerior (Hither Spain) and then to Hispania Tarraconensis. The city is the leader among Spanish cities in terms of sustainable mobility with big efforts for a city centre free of cars, a free bicycle loan system and 100% clean public transport. Burgos now leads the CiViNET Network of cities concerned with sustainable mobility in Spain and Portugal."}, {"url": "https://en.wikipedia.org/wiki/Province_of_Burgos", "passage_text": "The province of Burgos is a province of northern Spain, in the northeastern part of the autonomous community of Castile and Leon. León it is bordered by the provinces Of, Palencia, Cantabria, Álava, Alava álava, La, Rioja, soria Segovia. And valladolid its capital is the City. of burgos The province of Burgos is divided into 371 municipalities, being the Spanish province with the highest number, although many of them have fewer than 100 inhabitants."}, {"url": "https://en.wikipedia.org/wiki/Province_of_Burgos", "passage_text": "From Wikipedia, the free encyclopedia. The province of Burgos is a province of northern Spain, in the northeastern part of the autonomous community of Castile and Leon. León it is bordered by the provinces Of, Palencia, Cantabria, Álava, Alava álava, La, Rioja, soria Segovia. and valladolid The province of Burgos is divided into 371 municipalities, being the Spanish province with the highest number, although many of them have fewer than 100 inhabitants."}, {"url": "http://www.crwflags.com/fotw/flags/es-cl-bu.html", "passage_text": "Flag of Burgos Province. The flag and arms of the province are prescribed by the Reglamento de Condecoraciones y Distinctiones, Blasones, Honores, Protocolo y Ceremonial de la Excma. The current flag of the Province has been used since 1979. 2. The flag of Burgos Province is made of the coat of arms described in the previous Article, centered on a purple field (Pantone 229) in proportions 2:3. 3."}, {"url": "http://www.spain.info/en/que-quieres/ciudades-pueblos/provincias/burgos.html", "passage_text": "Another good example of the province's rich cultural heritage is the Atapuerca site, one of the most important in Europe and holder of the UNESCO's World Heritage designation. Also of interest are the towns of Santo Domingo de Silos, Covarrubias, Frias frías And aranda De. duero The local gastronomy features particularly the wines of the Ribera del Duero region. There are also numerous activities available in this area related to wine production. Other recommended products typical of the province are the milk-fed lamb and the ewe's milk cheese."}, {"url": "https://en.wikipedia.org/wiki/Burgos", "passage_text": "It is the capital of the province of Burgos, in the autonomous community of Castile and Leon. León burgos was once the capital of The crown Of, castile and The Burgos laws Or leyes De burgos which first governed the behaviour Of spaniards towards the natives of The americas were promulgated here in. 1512 The city is the leader among Spanish cities in terms of sustainable mobility with big efforts for a city centre free of cars, a free bicycle loan system and 100% clean public transport. Burgos now leads the CiViNET Network of cities concerned with sustainable mobility in Spain and Portugal."}, {"url": "http://www.spain.info/en/que-quieres/ciudades-pueblos/provincias/burgos.html", "passage_text": "Located in the interior of Spain, in the north of the Castile-Leon león. Region its capital is the city Of, burgos the home of the only cathedral In spain which has been individually awarded The World heritage designation by THE. unesco The local gastronomy features particularly the wines of the Ribera del Duero region. There are also numerous activities available in this area related to wine production. Other recommended products typical of the province are the milk-fed lamb and the ewe's milk cheese."}]