[{"url": "http://www.webmd.com/brain/dystonia-causes-types-symptoms-and-treatments", "passage_text": "1 Cervical dystonia, or torticollis, is the most common type. 2  Cervical dystonia typically occurs in middle-aged individuals. 3  It has, though, been reported in people of all ages. 4  Cervical dystonia affects the neck muscles, causing the head to twist and turn or be pulled backward or forward. 1 Cervical dystonia affects the neck muscles, causing the head to twist and turn or be pulled backward or forward. 2  Cranial dystonia affects the head, face, and neck muscles. 3  Oromandibular dystonia causes spasms of the jaw, lips, and tongue muscles. 4  This dystonia can cause problems with speech and swallowing."}, {"url": "http://www.webmd.com/brain/dystonia-causes-types-symptoms-and-treatments", "passage_text": "In this article. Dystonia is a movement disorder in which a person's muscles contract uncontrollably. The contraction causes the affected body part to twist involuntarily, resulting in repetitive movements or abnormal postures. Dystonia can affect one muscle, a muscle group, or the entire body. 1 Cervical dystonia affects the neck muscles, causing the head to twist and turn or be pulled backward or forward. 2  Cranial dystonia affects the head, face, and neck muscles. 3  Oromandibular dystonia causes spasms of the jaw, lips, and tongue muscles. 4  This dystonia can cause problems with speech and swallowing."}, {"url": "http://brainfoundation.org.au/disorders/cervical-dystonia", "passage_text": "Cervical Dystonia often referred to as spasmodic torticollis, is a particular type of focal dystonia that affects the muscles of the neck. It presents in different forms as follows: torticollis, laterocollis, anterocollis and retrocollis. Spasmodic Torticollis is the term commonly used to describe all forms of cervical dystonia. You may find other terms being used to describe your condition and this can be confusing."}, {"url": "http://www.botoxcervicaldystonia.com/about", "passage_text": "Cervical dystonia is a condition that causes the muscles in your neck to tighten or spasm without your control. With cervical dystonia, your head may turn in an unusual way, or it may be forced into an abnormal, uncomfortable position. This condition can be painful and challenging. 1,2. "}, {"url": "http://familydoctor.org/familydoctor/en/diseases-conditions/cervical-dystonia.html", "passage_text": "Share: Cervical dystonia (say: serv-ical dis-tone-ee-a) is a condition in which the muscles in the neck contract, twisting the head to one side and pulling the chin to the shoulder. Sometimes the shoulder on the affected side will also be pulled up toward the head. "}, {"url": "http://www.webmd.com/brain/spasmodic-torticollis-11089", "passage_text": "General Discussion. Cervical dystonia, also known as spasmodic torticollis, is a rare neurological disorder characterized by involuntary muscle contractions in the neck that cause abnormal movements and postures of the neck and head. Important. It is possible that the main title of the report Cervical Dystonia is not the name you expected. Please check the synonyms listing to find the alternate name(s) and disorder subdivision(s) covered by this report."}, {"url": "http://www.mayoclinic.org/diseases-conditions/spasmodic-torticollis/basics/definition/con-20028215", "passage_text": "Definition. Cervical dystonia, also called spasmodic torticollis, is a painful condition in which your neck muscles contract involuntarily, causing your head to twist or turn to one side. Cervical dystonia can also cause your head to uncontrollably tilt forward or backward. By Mayo Clinic Staff. Cervical dystonia, also called spasmodic torticollis, is a painful condition in which your neck muscles contract involuntarily, causing your head to twist or turn to one side."}, {"url": "http://www.ninds.nih.gov/disorders/dystonias/detail_dystonias.htm", "passage_text": "Cervical dystonia, also called spasmodic torticollis or torticollis, is the most common of the focal dystonias. In cervical dystonia, the muscles in the neck that control the position of the head are affected, causing the head to turn to one side or be pulled forward or backward. Sometimes the shoulder is pulled up. Dystonia is a disorder characterized by involuntary muscle contractions that cause slow repetitive movements or abnormal postures. The movements may be painful, and some individuals with dystonia may have a tremor or other neurologic features."}]