[{"url": "https://en.wikipedia.org/wiki/Synthetic_oil", "passage_text": "Synthetic oil is used as a substitute for lubricant refined from petroleum when operating in extremes of temperature, because, in general, it provides superior mechanical and chemical properties to those found in traditional mineral oils. Semi-synthetic oils (also called 'synthetic blends') are blends of mineral oil with no more than 30% synthetic oil designed to have many of the benefits of synthetic oil without matching the cost of pure synthetic oil. Motul introduced the first semi-synthetic motor oil in 1966."}, {"url": "http://www.wisegeek.com/what-is-synthetic-oil.htm", "passage_text": "Synthetic oil is a product that contains additional chemical ingredients that are not present in crude oil. These additional ingredients are synthesized or created artificially and added to petroleum as a means of meeting specific needs for lubrication. "}, {"url": "https://en.wikipedia.org/wiki/Synthetic_oil", "passage_text": "Synthetic oil is a lubricant consisting of chemical compounds that are artificially made (synthesized). Synthetic lubricants can be manufactured using chemically modified petroleum components rather than whole crude oil, but can also be synthesized from other raw materials. Semi-synthetic oils (also called 'synthetic blends') are blends of mineral oil with no more than 30% synthetic oil designed to have many of the benefits of synthetic oil without matching the cost of pure synthetic oil. Motul introduced the first semi-synthetic motor oil in 1966."}, {"url": "http://learn.walmart.com/Auto/Articles/Fluids/OIl/Whats_the_difference_between_motor_oils/4123/", "passage_text": "Part-synthetic (synthetic blend) motor oil Part-synthetic—also called synthetic blend or semi-synthetic—oils are blends of mineral oil (conventional) and synthetic base oil. Motor Oil: Synthetic vs. blend. Oil 101. Full-synthetic motor oil Full synthetic motor oil contains base oil that is man-made. The synthesis processes through which the oil is made improve key performance attributes and enable improvements to wear protection, extreme temperature performance and deposit control."}, {"url": "http://auto.howstuffworks.com/under-the-hood/trends-innovations/synthetic-oil-technology.htm", "passage_text": "Before we can tackle what's new in synthetic motor oil technology, w­e should first make sure that we know what synthetic oils are. Mineral or conventional motor oils come from the ground, like the stuff that bubbles up in oil fields from Texas to Saudi Arabia. On the other hand, synthetic oils are man-made. "}, {"url": "http://www.amsoil.com/about/synthetic-versus-conventional.aspx", "passage_text": "Synthetic vs. Conventional. Although you might know that synthetic oils outperform conventional oils, you might not understand why. The differences begin at the molecular level. Synthetics don’t contain the impurities and molecular irregularities inherent to conventional oils. 36% easier and faster cold starts. When the temperature drops, motor oils thicken and move slower, causing parts of your engine to remain unprotected for a short period of time. AMSOIL is more fluid at cold temperatures than the tested conventional oil, giving you 36% easier and faster cold starts*."}, {"url": "https://mobiloil.com/en/article/car-maintenance/learn-about-motor-oil-facts/synthetic-oil-vs-conventional-oil", "passage_text": "In the extreme environment of your engine, components can wear and break down. Your motor oil is the protective barrier between these components. As conventional oils break down, their ability to prevent engine wear diminishes. Mobil 1 motor oils, on the other hand, retain their wear protection properties for a much longer time, increasing engine life. "}, {"url": "http://www.bestcovery.com/best-synthetic-oil", "passage_text": "Most experts agree that the main benefit of using synthetic oil is the convenience of longer oil change intervals. While conventional non-synthetic oil is recommended to be changed every 3,000 miles, you can typically go 5,000 7,500+ miles on synthetic without worry. And though synthetic is much more expensive, it's worth the extra cost for drivers that dont want to change their oil as frequently."}]