[{"url": "http://www.fda.gov/ForConsumers/ConsumerUpdates/ucm093704.htm", "passage_text": "1 Keep the refrigerator temperature at or below 40° F (4° C). 2  The freezer temperature should be 0° F (-18° C). 3  Check temperatures periodically. 4  Appliance thermometers are the best way of knowing these temperatures and are generally inexpensive. Your refrigerator will keep food cold for about four hours if it's unopened. A full freezer will keep an adequate temperature for about 48 hours if the door remains closed. Once Power is Restored. . . You'll need to determine the safety of your food"}, {"url": "http://www.fda.gov/ForConsumers/ConsumerUpdates/ucm093704.htm", "passage_text": "1 Also, when putting food away, don't crowd the refrigerator or freezer so tightly that air can't circulate. 2  Keep your appliances at the proper temperatures. 3  Keep the refrigerator temperature at or below 40° F (4° C). 4  The freezer temperature should be 0° F (-18° C). 5  Check temperatures periodically. Your refrigerator will keep food cold for about four hours if it's unopened. A full freezer will keep an adequate temperature for about 48 hours if the door remains closed. Once Power is Restored. . . You'll need to determine the safety of your food"}, {"url": "http://cooking.stackexchange.com/questions/4529/what-temperatures-should-i-keep-my-refrigerator-and-freezer-set-at", "passage_text": "Normally a domestic freezer is best set to −18 °C (0 °F) or colder, as that's what the expiration dates for many food items are based on. It's also a requirement for freezers in restaurants, supermarkets & other places that sell food (at least here in Europe) to maintain a temperature of at most -18 °C. A general purpose domestic fridge should be at around 1-4 °C (so, just above the freezing point, and below 5 °C)."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20060816090249AA1Ddvb", "passage_text": "Hold frozen foods in these compartments only a few days. In refrigerator freezers where temperature can be maintained at 0°F (-17°C) in the freezer cabinet, food may be kept for the same storage periods as in a freezer. Date food packages with an expiration date according to maximum storage time recommended if they are not date coded. "}, {"url": "http://www.answers.com/Q/What_is_the_correct_temperature_for_home_freezer", "passage_text": "Most food freezes at about 20°F (-7°C). However, most recommend that a freezer's temperature should be maintained cold enough to keep ice cream frozen brick-solid. Ice cream … freezes at about 5°F (-15°C). Therefore, it is recommended that a freezer's temperature be maintained at 0°F (-17°C). "}, {"url": "http://www.favoritefreezerfoods.com/ideal-freezer-temperature.html", "passage_text": "The ideal freezer temperature is 0 Fahrenheit (-18 Celsius) for storing food. And -10 Fahrenheit (-23 Celsius) is recommended when freezing food. The faster food freezes the smaller the ice crystals. The smaller the ice crystals the smaller the change in texture and better quality when thawed. "}, {"url": "http://www.knowhow.com/article.dhtml?articleReference=786", "passage_text": "1 Fridge: put the thermometer in a glass of water. 2  Check the temperature during the first door opening after not using the fridge for 8 hours or more (such as overnight). 3  Freezer: put thermometer between two bags of vegetables and as above check after 8 hours or more. To measure the temperature: 1  Fridge: put the thermometer in a glass of water. 2"}, {"url": "http://www.knowhow.com/article.dhtml?articleReference=786", "passage_text": "To measure the temperature: 1  Fridge: put the thermometer in a glass of water. 2  Check the temperature during the first door opening after not using the fridge for 8 hours or more (such as overnight). 3  Freezer: put thermometer between two bags of vegetables and as above check after 8 hours or more. To measure the temperature: 1  Fridge: put the thermometer in a glass of water. 2"}, {"url": "http://www.cde.ca.gov/ls/nu/fd/mb00404.asp", "passage_text": "1 Establish the correct temperature in the freezer by placing a thermometer between frozen food packages. 2  Wait 5 to 8 hours. 3  If the temperature is not 0-2°F, adjust the freezer temperature control. 4  Check again after 5-8 hours. 1 Establish the correct refrigerator temperature by placing a thermometer in a glass of water in the middle of the refrigerator. 2  Wait 5 to 8 hours. 3  If the temperature is not 38-40°F, adjust the"}]