[{"url": "http://uca.edu/steminstitute/files/2012/11/Ions_and_Ionic_Compounds_Assignment.pdf", "passage_text": "Ions and Ionic Compounds Elements combine in a specific ratio to form compounds. Compounds can be categorized as ionic or covalent depending on the type of bond present within the compound. Ionic compounds consist of ionic bonds that arise from the electrostatic (magnetic) attraction between ions (charged species). Part III: Naming Ionic Compounds The name of an ionic compound is simply the combination of the names of the ions. The name is written with the cation listed first followed by the name of the anion. In this section of the lab you will practice developing chemical formulas for and naming ionic"}, {"url": "http://www.chemistryexplained.com/elements/T-Z/Titanium.html", "passage_text": "Overview. Titanium is found in the middle of the periodic table. The periodic table is a chart that shows how chemical elements are related to one another. Titanium is a transition metal and is part of Group 4 (IVB)."}, {"url": "http://www.webelements.com/titanium/compounds.html", "passage_text": "The term hydride is used in a generic sense to indicate compounds of the type M x H y and not necessarily to indicate that any compounds listed behave chemically as hydrides. In compounds of titanium (where known), the most common oxidation numbers of titanium are: 4. The term hydride is used to indicate compounds of the type M x H y and not necessarily to indicate that any compounds listed behave as hydrides chemically."}, {"url": "https://en.wikipedia.org/wiki/Titanium", "passage_text": "Its most common compound, titanium dioxide, is a popular photocatalyst and is used in the manufacture of white pigments. Other compounds include titanium tetrachloride (TiCl 4), a component of smoke screens and catalysts; and titanium trichloride (TiCl 3), which is used as a catalyst in the production of polypropylene. It is a lustrous transition metal with a silver color, low density and high strength. It is highly resistant to corrosion in sea water, aqua regia and chlorine. Titanium was discovered in Cornwall, Great Britain, by William Gregor in 1791 and named by Martin Heinrich Klaproth for the Titans of Greek mythology."}, {"url": "http://www.smc.edu/projects/28/Chemistry_10_Experiments/Ch10_Nomenclature.pdf", "passage_text": "Cation = iron(III) = Fe +3 (transition metal cation) Anion = chloride = Cl -1 (non-metal anion) To obtain a neutral compound, 1 Fe +3 is needed for every 3 Cl -1 The formula of the compound is FeCl 3 Example 9: Write the formula for magnesium phosphate. First identify the cation and anion in this compound. Example 10: Name the ionic compound Al(NO 3) 3. First identify the cation and anion in this compound. Cation = Al +3 = the aluminum cation (metal cation) Anion = NO 3-1 = the nitrate anion (polyatomic anion) The name of this compound is Aluminum Nitrate Example 11: Name the compound TiO 2."}, {"url": "https://en.wikipedia.org/wiki/Titanium", "passage_text": "Titanium is a chemical element with symbol Ti and atomic number 22. It is a lustrous transition metal with a silver color, low density and high strength. It is highly resistant to corrosion in sea water, aqua regia and chlorine. Titanium was discovered in Cornwall, Great Britain, by William Gregor in 1791 and named by Martin Heinrich Klaproth for the Titans of Greek mythology."}, {"url": "https://en.wikipedia.org/wiki/Titanium_dioxide", "passage_text": "From Wikipedia, the free encyclopedia. Titanium dioxide, also known as titanium(IV) oxide or titania, is the naturally occurring oxide of titanium, chemical formula TiO 2. When used as a pigment, it is called titanium white, Pigment White 6 (PW6) , or CI 77891. Generally it is sourced from ilmenite, rutile and anatase. Titanium dioxide occurs in nature as the well-known minerals rutile, anatase and brookite, and additionally as two high pressure forms, a monoclinic baddeleyite-like form and an orthorhombic α-PbO2 -like form, both found recently at the Ries crater in Bavaria. It is mainly sourced from ilmenite ore."}, {"url": "http://www.webelements.com/titanium/compounds.html", "passage_text": "Titanium: compounds information. This section lists some binary compounds with halogens (known as halides), oxygen (known as oxides), hydrogen (known as hydrides), and some other compounds of titanium. For each compound, a formal oxidation number for titanium is given, but the usefulness of this number is limited for p-block elements in particular. Based upon that oxidation number, an electronic configuration is also given but note that for more exotic compounds you should view this as a guide only. The term hydride is used to indicate compounds of the type M x H y and not necessarily to indicate that any compounds listed behave as hydrides chemically."}]