[{"url": "http://www.rightdiagnosis.com/sym/electrolyte_imbalance_symptoms.htm", "passage_text": "Review the causes of these more specific types of Electrolyte imbalance symptoms: 1  Decreased bicarbonate (8 causes). 2  Decreased chloride (5 causes). 3  Decreased potassium level (9 causes). 4  Decreased sodium level (9 causes). Electrolyte imbalance symptoms: Comorbid Symptoms. Some of the comorbid or associated medical symptoms for Electrolyte imbalance symptoms may include these symptoms: 1  Blood symptoms. 2  Body symptoms. 3  Abdominal symptoms."}, {"url": "http://www.healthgrades.com/symptoms/electrolyte-imbalance", "passage_text": "For example, when you sweat as a result of exercise, hot weather, or illness, some electrolyte levels may be low. Vomiting and diarrhea are other causes of electrolyte imbalances, as they result in excessive fluid loss. You must replenish these fluids and electrolytes in order to prevent dehydration, a potentially life-threatening condition. Electrolyte imbalances can be caused by a deficiency or an overabundance of minerals in the body. For example, hyperkalemia and hypercalcemia are indicative of excess amounts of potassium and calcium, respectively, which can disrupt the overall balance and functioning of the nerves, cardiovascular system, and muscle"}, {"url": "http://www.emedicinehealth.com/electrolytes/article_em.htm", "passage_text": "Electrolytes Overview. Electrolytes are the smallest of chemicals that are important for the cells in the body to function and allow the body to work. Electrolytes such as sodium, potassium, and others are critical in allowing cells to generate energy, maintain the stability of their walls, and to function in general. They generate electricity, contract muscles, move water and fluids within the body, and participate in myriad other activities. The body functions in a very narrow range of normal, and it is hormones like renin (made in the kidney), angiotensin (from the lung, brain and heart), aldosterone (from the adrenal gland), and antidiuretic hormone (from the pituitary) that keep the electrolyte balance within those normal limits."}, {"url": "http://www.yournursingtutor.com/3-tricks-to-help-you-remember-electrolyte-imbalances/", "passage_text": "Similarities. Another way to help organize the information so that it is easier to understand and remember is to look for similarities between the symptoms of an imbalance and a completely different illness or disorder. For example, hyponatremia (low sodium) has a lot of overlapping symptoms with dehydration. Patterns. A third way to help you organize your new nursing knowledge is to look for patterns that occur when certain electrolyte imbalances have a tendency to be comorbid (aka occur at the same time). For example, we already established that a symptom of hypocalcemia is tetany."}, {"url": "http://www.emedicinehealth.com/electrolytes/article_em.htm", "passage_text": "The concentration of electrolytes in the body is controlled by a variety of hormones, most of which are manufactured in the kidney and the adrenal glands. Sensors in specialized kidney cells monitor the amount of sodium, potassium, and water in the bloodstream. The body functions in a very narrow range of normal, and it is hormones like renin (made in the kidney), angiotensin (from the lung, brain and heart), aldosterone (from the adrenal gland), and antidiuretic hormone (from the pituitary) that keep the electrolyte balance within those normal limits."}, {"url": "http://www.yournursingtutor.com/3-tricks-to-help-you-remember-electrolyte-imbalances/", "passage_text": "You really need to memorize the normal lab values for each of the six common electrolyte imbalances (sodium, potassium, calcium, chloride, magnesium, and phosphate). Patterns. A third way to help you organize your new nursing knowledge is to look for patterns that occur when certain electrolyte imbalances have a tendency to be comorbid (aka occur at the same time). For example, we already established that a symptom of hypocalcemia is tetany."}, {"url": "http://www.rightdiagnosis.com/sym/electrolyte_imbalance_symptoms.htm", "passage_text": "Electrolyte imbalance symptoms: Introduction. Electrolyte imbalance symptoms: Symptoms related to an imbalance of the electrolyte levels in the blood. See detailed information below for a list of 300 causes of Electrolyte imbalance symptoms, Symptom Checker, including diseases and drug side effect causes. Electrolyte imbalance symptoms: Comorbid Symptoms. Some of the comorbid or associated medical symptoms for Electrolyte imbalance symptoms may include these symptoms: 1  Blood symptoms. 2  Body symptoms. 3  Abdominal symptoms."}, {"url": "http://www.healthcommunities.com/electrolyte-imbalance/hyponatremia-causes-symptoms.shtml", "passage_text": "Hyponatremia is caused by conditions such as water retention and renal failure that result in a low sodium level in the blood. Pseudohyponatremia occurs when too much water is drawn into the blood; it is commonly seen in people with hypoglycemia (low blood sugar). Symptoms of hyponatremia are related to the severity and the rate at which the conditions develop. The first symptoms are fatigue, weakness, nausea, and headache. More severe cases cause confusion, seizure, coma, and death."}, {"url": "http://www.healthgrades.com/symptoms/electrolyte-imbalance", "passage_text": "Electrolytes exist in the form of calcium, chlorine, magnesium, phosphate, potassium, and sodium that can be obtained from fluids, supplements, and foods. For example, bananas are excellent sources of potassium. The balance of electrolytes is constantly shifting due to fluctuating fluid levels in your body. You must replenish these fluids and electrolytes in order to prevent dehydration, a potentially life-threatening condition. Electrolyte imbalances can be caused by a deficiency or an overabundance of minerals in the body."}, {"url": "http://www.succeedscaps.com/articles/water_electrolyte_balance_table/", "passage_text": "This table is presented as an aid for the general understanding of causes of water/electrolyte imbalance, symptoms and adjustments that can be done in the field. It is a known fact that there is personal variation in athletes’ responses to imbalances. The Electrolytes-Low states are more common because athletes may neglect electrolyte intake or may not be aware of the need for electrolyte intake, particularly if the athlete is not acclimated to the warm conditions in late Spring or early Summer and loses substantial sodium in sweat."}]