[{"url": "http://www.visit-salzburg.net/dining/austrian-breakfast.htm", "passage_text": "Austrian Breakfast Demystified. Austria is a big breakfast country; many Austrians are obsessed with the idea that the breakfast is the most important meal of the day and at least on weekends, they tend to celebrate breakfasts rather extensively. In any case, we believe that the Austrian Breakfast is in fact not all that different of what is called the Continental Breakfast in an international context. It′s just that like many nations, Austrians like to feel special and thus created the brand Austrian Breakfast out of (almost) nowhere."}, {"url": "http://cupsofchai.com/2009/08/31/sahtain-syrian-breakfast/", "passage_text": "Breakfast is meant to be enjoyed, eaten slowly, in the company of family and friends, and then extended for at least two hours with cup after cup of hot, sweet tea. I had my first experience with a full Syrian breakfast when my family and I went to Syria in May 2006, when Ameir and I had our Nikah. There’s an art to it. The whole family sits together, most often on the floor with a medda (spread) laid out before them. There are no plates. Look at all the plates, and how everything is arranged so that everyone can reach everything. Note that instead of a plate, everyone has a piece of bread. They tear off pieces and dip them into the plates in front of them Breakfast in Syria is an event in itself."}, {"url": "https://en.wikipedia.org/wiki/Syrian_cuisine", "passage_text": "Syrian cuisine includes dishes like kibbeh, kebab halabi, waraq `inab, hummus, tabbouleh, fattoush, labneh, shawarma, mujaddara, shanklish, bastirma, sujuk and baklava. Vine leaves [edit]. There are two types of stuffed vine leaves in Syria: 1  yabraq (يبرق): vine leaves stuffed with rice and minced meat cooked and served hot; 2  yalanji (يلنجي): vine leaves stuffed with rice and a variety of vegetables and served hot or cold."}, {"url": "https://en.wikipedia.org/wiki/Syrian_cuisine", "passage_text": "1 Falafel is most often served in Syrian flat bread, with pickles, tahina, hummus, sumac, cut vegetable salad and often, Shatta, a hot sauce, the type used depending on the origin of the falafel maker. 2  shawarma (شاورما) is usually made with lamb or chicken meat. Vine leaves [edit]. There are two types of stuffed vine leaves in Syria: 1  yabraq (يبرق): vine leaves stuffed with rice and minced meat cooked and served hot; 2  yalanji (يلنجي): vine leaves stuffed with rice and a variety of vegetables and served hot or cold."}, {"url": "https://en.wikipedia.org/wiki/Syrian_cuisine", "passage_text": "Syrian street food includes: 1  falafel (فلافل) are fried balls or patties of spiced, mashed chickpeas. 2  Falafel is most often served in Syrian flat bread, with pickles, tahina, hummus, sumac, cut vegetable salad and often, Shatta, a hot sauce, the type used depending on the origin of the falafel maker. Vine leaves [edit]. There are two types of stuffed vine leaves in Syria: 1  yabraq (يبرق): vine leaves stuffed with rice and minced meat cooked and served hot; 2  yalanji (يلنجي): vine leaves stuffed with rice and a variety of vegetables and served hot or cold."}, {"url": "http://www.visit-salzburg.net/dining/austrian-breakfast.htm", "passage_text": "A different story is the Viennese Breakfast that you can often get as a set in cafes. This type of Austrian breakfast is usually served in portions for a single person and comprises of a Semmel, jam (often apricot), coffee (typically a Melange), butter and a glass of orange juice. Sometimes you can opt for ham and cheese instead of the jam and boiled eggs commonly round up the offer. In any case, we believe that the Austrian Breakfast is in fact not all that different of what is called the Continental Breakfast in an international context. It′s just that like many nations, Austrians like to feel special and thus created the brand Austrian Breakfast out of (almost) nowhere."}, {"url": "http://www.carolaann.com/syrian-breakfast-with-foul-and-fatteh/", "passage_text": "3. To make the sauce, mix the tahini, yogurt, garlic, salt and lemon juice together. If the sauce is too thick, add some water to thin it down a little, but not too much. Taste and adjust the seasoning if needed. 4. Too finish the foul, mix in the freshly chopped mint and juice from half a lemon. The first 2 dishes we made, we both enjoy anytime of the day. Syrian foul and fatteh. Foul, also spelled “ful” is the Arabic name for fava or broad beans. In the Middle East you can get them either in cans labeled as foul mudammes or dried."}, {"url": "https://www.flickr.com/photos/hugo/17645158/", "passage_text": "Meritxell having a typical breakfast in Syria: some olives, flat bread, hard boiled eggs, tea and jam! "}, {"url": "http://cupsofchai.com/2009/08/31/sahtain-syrian-breakfast/", "passage_text": "Every once in a while, a family should have a good Syrian breakfast. Leave the bowls of cereal or the pop tart. Forget the plates, spoons and forks. Spread a medda, sit on the floor and enjoy the food and family. Look at all the plates, and how everything is arranged so that everyone can reach everything. Note that instead of a plate, everyone has a piece of bread. They tear off pieces and dip them into the plates in front of them Breakfast in Syria is an event in itself."}]