[{"url": "https://en.wikipedia.org/wiki/Ahimsa", "passage_text": "Ahimsa (Sanskrit: अहिंसा ; IAST: ahimsā, Pāli: avihiṃsā) is a term meaning 'not to injure' and 'compassion'. The word is derived from the Sanskrit root hiṃs – to strike; hiṃsā is injury or harm, a-hiṃsā is the opposite of this, i.e. cause no injury, do no harm. Ahimsa is also referred to as nonviolence, and it applies to all living beings-including all animals-according to many Indian religions. The word Ahimsa-sometimes spelled as Ahinsa-is derived from the Sanskrit root hiṃs – to strike; hiṃsā is injury or harm, a-hiṃsā is the opposite of this, i.e. non harming or nonviolence."}, {"url": "https://en.wikipedia.org/wiki/Himsa", "passage_text": "Himsa was an American heavy metal band from Seattle, Washington. Formed in 1998, their band name is from the Sanskrit word himsa, which means harm or violence. The group released four full-length studio albums, two EPs and one DVD before their disestablishment in 2008. On April 23, 2007, Himsa entered the studio to work on their new album, Summon in Thunder, which was released on September 18, 2007. This was their only studio album released on Century Media Records. This album added a more melodic death metal sound to the band"}, {"url": "http://www.urbanbliss.com/what_is_ahimsa.html", "passage_text": "Ahimsa is a Sanskrit term that means non-violence (the avoidance of violence-himsa). Ahimsa is imperative for Yoga practitioners. Ahimsa is one of the 5 Yamas which make up the code of conduct and is the first of the eight limbs of Yoga. Vegetarianism and moral living are observed as aspects of Ahimsa. "}, {"url": "http://www.himsa.com/AboutHIMSA/WhatisHIMSA/tabid/80/language/en-US/default.aspx", "passage_text": "The Hearing Instrument Manufacturers' Software Association (HIMSA) was founded at the beginning of 1993 with the objective of developing, marketing and supporting Noah – one standard for integrated hearing care software. HIMSA's single largest market is served by its U.S. subsidiary in Minneapolis, USA. Over 14000 copies of Noah have been registered in the U.S. as of January 2015, and over 70 percent of hearing health care professionals in the US are Noah users. Noah is also available in localized versions for over 25 markets."}, {"url": "http://www.hindupedia.com/en/Ahimsa", "passage_text": "Ahimsa was also the name of the wife of Dharma as mentioned in the Vişņu Purāņ a. Ahimsa is a Sanskrit word derived from the root hims, meaning to strike. Himsa means injury or harm. Literally translated, a-himsa means the opposite of himsa or non-injury or non-violence. The scriptures extol the virtues of Ahimsa and consider it an essential tenet of and guide for personal behavior."}, {"url": "http://www.mtv.com/artists/himsa/", "passage_text": "Seattle's Himsa, for example, has never sounded anything like Nirvana, Pearl Jam, the Stone Temple Pilots, or the Foo Fighters. Formed in the late '90s, Himsa is a ferocious, punishing, harsh metalcore band. The name Himsa is a play on the Sanskrit word ahimsa, which refers to peace and nonviolence. By dropping the a from ahimsa, Himsa is saying that their sound is the opposite of peaceful. The Pacific Northwesterners aren't actually promoting or encouraging violence, but they are saying that they have a violent sound -- which is certainly true."}, {"url": "http://www.definitions.net/definition/himsa", "passage_text": "Himsa. Himsa was an American heavy metal band from Seattle, Washington. Formed in 1998, their band name was derived from the word himsa, which in Sanskrit means harm or violence. The group released four full-length studio albums, two EPs and one DVD before their disestablishment in 2008."}, {"url": "http://www.last.fm/music/Himsa", "passage_text": "The name Himsa is a spelling variation of the Sanskrit word for no harm, literally changing the definition to harm. The band formed in 1998 and released an independent EP and full-length album in 1999. Before being signed to Prosthetic Records, the band released one more EP in 2001. "}, {"url": "http://www.himsa.com/AboutHIMSA/WhatisHIMSA/tabid/80/language/en-US/default.aspx", "passage_text": "HIMSA is a privately owned company, but it operates much like a consortium – all suppliers within the hearing care industry who are HIMSA members have a significant say in the running of HIMSA and in how the standard evolves. Today, over 120 companies support the Noah software standard. HIMSA's single largest market is served by its U.S. subsidiary in Minneapolis, USA. Over 14000 copies of Noah have been registered in the U.S. as of January 2015, and over 70 percent of hearing health care professionals in the US are Noah users. Noah is also available in localized versions for over 25 markets."}]