[{"url": "http://www.mphproductioncompany.com/faq.html", "passage_text": "1. The term royalties is used interchangeable to mean either oil and gas mineral interests, royalty interests, or overriding royalty interests. These three interests are similar in that they all receive revenue from the production of oil and gas from a well. Mineral interests and royalty interests both involve ownership of the minerals under the ground. The main difference between the two is that the owner of a mineral interest has the right to execute leases and collect bonus payments and the owner of royalty interests does not execute leases or collect bonus payments."}, {"url": "https://www.ohiobar.org/ForPublic/Resources/LawYouCanUse/Pages/Do-You-Have-Severed-Oil-and-Gas-Interests-on-Your-Property.aspx", "passage_text": "This severed interest may take different forms. A past owner may have reserved all mineral rights, all the oil and gas rights, half of the oil and gas royalty rights, the oil and gas leasing rights and part of the royalty rights, or some variation of these. "}, {"url": "http://homeguides.sfgate.com/mineral-rights-property-7961.html", "passage_text": "As an owner of mineral rights and/or royalty rights, you can sell your rights for an immediate cash payment, or enjoy the benefits of mineral leasing and royalty payments during your lifetime and bequeath these rights to your heirs. Definition. The term “mineral rights” normally refers to subsurface rights to any mineral, and commonly refers to natural gas and oil. However, it includes all minerals found beneath the land’s surface, such as gold, diamonds, quartz and copper."}, {"url": "http://info.legalzoom.com/probate-court-heirs-mineral-rights-21813.html", "passage_text": "Mineral Leases. Instead of title to mineral rights, you may inherit an interest in a mineral lease. Such interests are defined as a percentage of the revenues derived from the extracted minerals. A mineral lease represents the right to extract and sell minerals for a certain period of time, such as 25 years. Mineral rights allow you to extract and sell underground natural resources or lease them to others. These rights are normally defined as rights to resources that exist in deposits located under a specific parcel of surface land."}, {"url": "https://en.wikipedia.org/wiki/Mineral_rights", "passage_text": "A division order is a binding contract between a mineral rights lessee, which is usually an oil or gas company, and the purchaser of oil and/or gas extracted from the property. Mineral rights are property rights to exploit an area for the minerals it harbors."}, {"url": "http://homeguides.sfgate.com/mineral-rights-property-7961.html", "passage_text": "Mineral rights owners usually exercise their rights to extract oil and natural gas. If you own real estate, you need to understand the concept of mineral rights and how their ownership can impact your property. Definition. The term “mineral rights” normally refers to subsurface rights to any mineral, and commonly refers to natural gas and oil. However, it includes all minerals found beneath the land’s surface, such as gold, diamonds, quartz and copper."}, {"url": "https://en.wikipedia.org/wiki/Mineral_rights", "passage_text": "Mineral estate [edit]. Ownership of mineral rights (more properly mineral interest) is an estate in real property. Technically it is known as a mineral estate, although often referred to as mineral rights. It is the right of the owner to exploit, mine, and/or produce any or all of the minerals lying below the surface of the property. Mineral rights are property rights to exploit an area for the minerals it harbors."}, {"url": "http://www.investorwords.com/18747/mineral_royalties.html", "passage_text": "A payment to the owner of mineral rights for the privilege of extracting the mineral from the ground based on a lease agreement. The royalty payment is based on a portion of earnings from production and varies depending on the type of mineral and the market conditions. "}, {"url": "http://blackbearddata.com/oil-and-gas-royalties-what-they-are/land-ownership-mineral-rights", "passage_text": "So it is possible that someone owns the surface, another owns the mineral rights, another the royalties to those minerals, another the timber, etc. Each such fee simple owner has the exclusive ownership free and clear of any condition or restriction. "}]