[{"url": "https://labtestsonline.org/understanding/analytes/psa/tab/test", "passage_text": "1 Total PSA levels between 4.0 ng/ml and 10.0 ng/ml may indicate prostate cancer (about a 25% chance, according to the ACS), benign prostate hyperplasia (BPH) , or inflammation of the prostate. 2  These conditions are more common in the elderly, as is a general increase in PSA levels. If the DRE is normal but the PSA is moderately elevated, a free PSA test may be used to look at the ratio of free to total PSA. This can help to distinguish between prostate cancer and other non-cancer causes of elevated PSA."}, {"url": "http://www.cancercenter.com/prostate-cancer/psa-test/", "passage_text": "A prostate-specific antigen (PSA) test measures the level of PSA in the blood. The prostate gland produces PSA, a protein that at an elevated level may be a sign of prostate cancer. PSA levels are measured in nanograms of PSA per milliliter of blood, or ng/mL. Men with a high PSA level are more likely to have prostate cancer than men with low levels, though there are no normal and abnormal ranges of PSA in the blood. In the past, a PSA reading of 4 ng/mL and below was considered normal."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=7586", "passage_text": "PSA: Prostate specific antigen. A test for PSA may be used to screen for cancer of the prostate and to monitor treatment of the disease. PSA is a protein produced by the prostate gland. Although most PSA is carried out of the body in semen, a very small amount escapes into the blood stream. The PSA test is done on blood"}, {"url": "http://my.clevelandclinic.org/health/diseases_conditions/hic_Prostate_Cancer_Basics/hic-elevated-psa-level", "passage_text": "Elevated PSA (Prostate-Specific Antigen) Level. Prostate-specific antigen (PSA) is a protein produced by the prostate gland. Blood levels of PSA can be elevated in men with prostate cancer. For this reason, measurement of PSA in the blood has been used as a screening test for prostate cancer. "}, {"url": "http://www.webmd.com/prostate-cancer/guide/psa", "passage_text": "Most men with elevated PSA levels have noncancerous prostate enlargement, which is a normal part of aging. Conversely, low levels of PSA in the bloodstream do not rule out the possibility of prostate cancer. However, most cases of early prostate cancer are found by a PSA blood test. A. A. A. Prostate-specific antigen (PSA) is a substance produced by the prostate gland. Elevated PSA levels may indicate prostate cancer, a noncancerous condition such as prostatitis, or an enlarged prostate."}, {"url": "http://www.prostatecancer-riskcalculator.com/psa-test", "passage_text": "Prostate-specific antigen (PSA) is a protein produced exclusively by prostate cells. There is a simple blood test to measure your PSA level and this may help to detect early prostate cancer. The chance of having prostate cancer goes up as your PSA level increases (see table below). Small amounts can also be found in the blood of healthy men as doctors have not yet determined what is a ‘normal’ level. Thirteen per cent of men over 55 have a PSA level of ≥ 4 ng/ml but this does not automatically mean you have cancer. An elevated level can also be due to other conditions, such as benign enlargement of the prostate (BPH), a urinary tract infection or a prostate infection."}, {"url": "http://www.cancer.gov/types/prostate/psa-fact-sheet", "passage_text": "Prostate-specific antigen, or PSA, is a protein produced by cells of the prostate gland. The PSA test measures the level of PSA in a man’s blood. For this test, a blood sample is sent to a laboratory for analysis. The results are usually reported as nanograms of PSA per milliliter (ng/mL) of blood. The blood level of PSA is often elevated in men with prostate cancer, and the PSA test was originally approved by the FDA in 1986 to monitor the progression of prostate cancer in men who had already been diagnosed with the disease"}, {"url": "http://www.health.com/health/gallery/0,,20545215,00.html", "passage_text": "by Anne Harding. Prostate-specific antigen (PSA) is a protein produced by the prostate and found in the blood. A PSA blood test can detect prostate cancer early, but it may not save lives. "}, {"url": "http://www.bensprostate.com/prostate-health-info/psa-scores-reading-tests-info/", "passage_text": "The PSA test stands for prostate specific antigen. An antigen is an antibody designed to protect against disease. And because we can test for a prostate specific antigen, the volume of that antigen can indicate the seriousness of any disease that is attacking the prostate. By itself, a PSA reading does not mean very much. The PSA is only a very rough indicator. It certainly does not predict prostate cancer, but it may give you an early indication. However, the PSA is very unreliable and essentially flawed as a test for prostate cancer because a raised PSA can mean many different things"}]