[{"url": "http://www.wiley-vch.de/books/sample/3527318194_c01.pdf", "passage_text": "4 1 Downstream Processing of Biotechnology Products Table 1.1 The proteinogenic amino acids, including three-and one-letter codes, the structure of their R-group, relative abundance in E. coli, molecular mass, and pK a of the R-group. Note that proline is a cyclic imino acid and its structure is shown in its entirety. Loops are very ﬂ exible parts of the protein and often connect other secondary structure elements with each other. For example, loops often connect the portions of a polypeptide chain that form anti-parallel areas of parallel β - sheets or form the links between different α - helical and β - sheet domains."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/20978961", "passage_text": "(1)BioUetikon Ltd, Dublin City University, Dublin, Ireland. john.milne@biouetikon.com. Large-scale chromatography operations continue to occupy a key position in the overall strategy for the downstream processing and purification of protein products for therapeutic use. "}, {"url": "https://en.wikipedia.org/wiki/Downstream_processing", "passage_text": "Downstream processing refers to the recovery and purification of biosynthetic products, particularly pharmaceuticals, from natural sources such as animal or plant tissue or fermentation broth, including the recycling of salvageable components and the proper treatment and disposal of waste. It is an essential step in the manufacture of pharmaceuticals such as antibiotics, hormones (e.g. insulin and human growth hormone), antibodies (e.g. infliximab and abciximab) and vaccines; antibodies and enzymes used in diagnostics; industrial enzymes; and natural fragrance and flavor compounds."}, {"url": "http://www.skillpad.com/product/protein-purification-in-downstream-processing/", "passage_text": "Protein Purification in Downstream Processing. Describes the use of various chromatographic methods in downstream protein purification. Pre-chromatographic techniques including solubilization and refolding, precipitation and sterile filtration are described. Product Description. – Explain the role of different chromatographic methods in protein purification. – Describe where chromatography fits into downstream processing. – Construct a general outline of a protein purification process for both intracellular and extracellular proteins. – Explain what is meant by preparative chromatography"}, {"url": "https://en.wikipedia.org/wiki/Downstream_processing", "passage_text": "Downstream processing is usually considered a specialized field in biochemical engineering, itself a specialization within chemical engineering, though many of the key technologies were developed by chemists and biologists for laboratory-scale separation of biological products. It is an essential step in the manufacture of pharmaceuticals such as antibiotics, hormones (e.g. insulin and human growth hormone), antibodies (e.g. infliximab and abciximab) and vaccines; antibodies and enzymes used in diagnostics; industrial enzymes; and natural fragrance and flavor compounds."}, {"url": "http://www.glycotope.com/manufacturing-services/downstream-processing-protein-purification", "passage_text": "Development of Purification Process. In the development of Downstream Processes (DSP), the structural and functional parameters of the recombinant protein must be retained while simultaneously all potential contaminants are removed. We offer GMP compliant purification processes to ensure the final product meets all regulatory guidelines. Glycotope Biotechnology performs the purification of cell-free harvest in a monitored hygienic area corresponding to ISO class 7 (corresponding to class C rooms)."}, {"url": "https://en.wikipedia.org/wiki/Downstream_processing", "passage_text": "Downstream processing implies manufacture of a purified product fit for a specific use, generally in marketable quantities, while analytical bioseparation refers to purification for the sole purpose of measuring a component or components of a mixture, and may deal with sample sizes as small as a single cell. It is an essential step in the manufacture of pharmaceuticals such as antibiotics, hormones (e.g. insulin and human growth hormone), antibodies (e.g. infliximab and abciximab) and vaccines; antibodies and enzymes used in diagnostics; industrial enzymes; and natural fragrance and flavor compounds."}, {"url": "https://en.wikipedia.org/wiki/Downstream_processing", "passage_text": "Downstream processing and analytical bioseparation both refer to the separation or purification of biological products, but at different scales of operation and for different purposes. It is an essential step in the manufacture of pharmaceuticals such as antibiotics, hormones (e.g. insulin and human growth hormone), antibodies (e.g. infliximab and abciximab) and vaccines; antibodies and enzymes used in diagnostics; industrial enzymes; and natural fragrance and flavor compounds."}]