[{"url": "http://www.vivo.colostate.edu/hbooks/pathphys/reprod/fert/fert.html", "passage_text": "Egg Activation and the Cortical Reaction. Prior to fertilization, the egg is in a quiescent state, arrested in metaphase of the second meiotic division. Upon binding of a sperm, the egg rapidly undergoes a number of metabolic and physical changes that collectively are called egg activation."}, {"url": "http://www.dummies.com/how-to/content/collision-theory-how-chemical-reactions-occur.html", "passage_text": "The temperature is a measure of the average kinetic energy of the molecules; raising the temperature increases the kinetic energy available to break bonds during collisions. The molecules must also collide in the right orientation, or hit at the right spot, in order for the reaction to occur."}, {"url": "http://www.vivo.colostate.edu/hbooks/pathphys/reprod/fert/fert.html", "passage_text": "As the acrosome reaction progresses and the sperm passes through the zona pellucida, more and more of the plasma membrane and acrosomal contents are lost. By the time the sperm traverses the zona pellucida, the entire anterior surface of its head, down to the inner acrosomal membrane, is denuded."}, {"url": "http://www.vivo.colostate.edu/hbooks/pathphys/reprod/fert/fert.html", "passage_text": "Successful fertilization requires not only that a sperm and egg fuse, but that not more than one sperm fuses with the egg. Fertilization by more than one sperm-polyspermy-almost inevitably leads to early embryonic death."}, {"url": "https://en.wikipedia.org/wiki/Cortical_reaction", "passage_text": "In most animals the extracellular matrix present around the egg is the vitelline envelope which becomes the fertilization membrane following the cortical reaction. In mammals, however, the extracellular matrix modified by the cortical reaction is the zona pellucida. This modification of the zona pellucida is known as the zona reaction. Although highly conserved across the animal kingdom, the cortical reaction shows great diversity between species."}, {"url": "https://en.wikipedia.org/wiki/Cortical_granule", "passage_text": "Cortical granule formation occurs during the early stages of oocyte growth. More specifically, in the human, monkey, hamster, and rabbit, cortical granules are established once the ovarian follicle is multilayered."}, {"url": "https://en.wikipedia.org/wiki/Cortical_reaction", "passage_text": "In mammals the cortical reaction leads to a modification of the zona pellucida that blocks polyspermy; enzymes released by cortical granules digest sperm receptor glycoproteins ZP2 and ZP3 so that they can no longer bind spermatozoon."}, {"url": "http://www.vivo.colostate.edu/hbooks/pathphys/reprod/fert/fert.html", "passage_text": "The cortical reaction refers to a massive exocytosis of cortical granules seen shortly after sperm-oocyte fusion. Cortical granules contain a mixture of enzymes, including several proteases, which diffuse into the zona pellucida following exocytosis from the egg."}, {"url": "https://en.wikipedia.org/wiki/Cortical_reaction", "passage_text": "The cortical reaction is a process initiated during fertilization by the release of cortical granules from the egg which prevents polyspermy, the fusion of multiple sperm with one egg."}]