[{"url": "https://labtestsonline.org/understanding/analytes/cbc/tab/test", "passage_text": "1 Mean corpuscular volume (MCV) is a measurement of the average size of a single red blood cell. 2  Mean corpuscular hemoglobin (MCH) is a calculation of the average amount of hemoglobin inside a single red blood cell. The complete blood count (CBC) is often used as a broad screening test to determine an individual's general health status. It can be used to: 1  Screen for a wide range of conditions and diseases. 2  Help diagnose various conditions, such as anemia, infection, inflammation, bleeding disorder or leukemia, to name just a few."}, {"url": "http://www.easy-immune-health.com/mcv-blood-test.html", "passage_text": "An MCV Blood Test is one component of the CBC Blood Test that measures the number and the different types of cells in your blood. But if you have a low MCV blood test and your doctor has determined that you are NOT bleeding then the other possibilities for a low MCV blood test result are: 1  Low intake of Vitamin B6. 2  Heavy metal excess. 3  Gastrointestinal Malabsorption Problems such as Gluten Sensitivity."}, {"url": "https://labtestsonline.org/understanding/analytes/rdw/tab/glance", "passage_text": "MCV, MCH, MCHC, and RDW. These are measurements or calculations related to red blood cells (RBCs) and are components of the Complete Blood Count (CBC), a commonly requested test used for a variety of purposes. "}, {"url": "https://en.wikipedia.org/wiki/Mean_corpuscular_volume", "passage_text": "The mean corpuscular volume is a part of a standard complete blood count. In a laboratory test that computes MCV, erythrocytes are compacted during centrifugation. In patients with anemia, it is the MCV measurement that allows classification as either a microcytic anemia (MCV below normal range), normocytic anemia (MCV within normal range) or macrocytic anemia (MCV above normal range)."}, {"url": "http://www.easy-immune-health.com/mcv-blood-test.html", "passage_text": "When the MCV blood test has a HIGH number-even slightly-this means that the blood cells are too large and is called macrocytosis or Macrocytic Anemia. But if you have a low MCV blood test and your doctor has determined that you are NOT bleeding then the other possibilities for a low MCV blood test result are: 1  Low intake of Vitamin B6. 2  Heavy metal excess. 3  Gastrointestinal Malabsorption Problems such as Gluten Sensitivity."}, {"url": "http://www.brighthub.com/science/medical/articles/71162.aspx", "passage_text": "A CBC (complete blood count) blood test can be used to monitor MCH levels in blood. Lab Tests Online explains that the MCH aspect of a CBC test “is a measurement of the average amount of oxygen-carrying hemoglobin inside a red blood cell. A simple calculation is used to determine the mean corpuscular hemoglobin level in blood. According to Med Friendly, the total amount of hemoglobin in the sample is multiplied by ten and then divided by the number of red blood cells present."}, {"url": "http://www.answers.com/Q/What_is_a_hematology_lab_test_MCV_for", "passage_text": "Mean corpuscular volume (MCV) is a measurement of the average size of your RBCs (red blood cells). The MCV is elevated when your RBCs are larger than normal (macrocytic), for example in anemia caused by vitamin B12 deficiency. The results are derived from Hct, Hgb, and RBC count from a blood sample. MCV stands for Microtic cell volume, the test is an indicator for the size of the RBC's or red blood cells. It helps to determine if there is risk for certain anemia's."}, {"url": "http://emedicine.medscape.com/article/2085770-overview", "passage_text": "Indications/Applications. Mean corpuscular volume (MCV) laboratory test, as part of a standard complete blood count (CBC), is used along with other RBC indices (MCH and MCHC) to help classify the cause of anemia based on red cell morphology. See also the Interpretation section above. MCV is elevated or decreased in accordance with average red cell size; ie, low MCV indicates microcytic (small average RBC size), normal MCV indicates normocytic (normal average RBC size), and high MCV indicates macrocytic (large average RBC size). The reference range for MCV is 80-96 fL/red cell in adult."}, {"url": "http://www.answers.com/Q/What_is_a_hematology_lab_test_MCV_for", "passage_text": "Confidence votes 146. The MCV Lab Test is a kind of Hemotology Test. The results are derived from Hct, Hgb, and RBC count from a blood sample. MCV stands for Microtic cell volume, the test is an indicator for the size of the RBC's or red blood cells. It helps to determine if there is risk for certain anemia's."}]