[{"url": "http://www.bhg.com/recipes/how-to/cooking-basics/how-to-oven-bake-chicken-legs/", "passage_text": "Baking the Chicken: Preheat the oven to 400°F. Bake the chicken, uncovered, for 35 to 40 minutes or until the chicken is no longer pink inside. You can bake the chicken legs in a 375°F. oven, if desired. Increase the baking time to 45 to 50 minutes. Tip: An accurate way to check chicken doneness is to insert an instant-read thermometer into the thigh, avoiding the bone. It should read 180°F when the chicken is done. "}, {"url": "http://community.tasteofhome.com/community_forums/f/29/p/176779/2415416.aspx", "passage_text": "Baking your Chicken Legs... Preheat the oven to 400°F. Bake the chicken, uncovered, for 35 to 40 minutes or until the chicken is no longer pink inside. You can bake the chicken legs in a 375°F. oven, if desired. Increase the baking time to 45 to 50 minutes. Tip: An accurate way to check chicken doneness is to insert an instant-read thermometer into the thigh, avoiding the bone. It should read 180°F when the chicken is done."}, {"url": "http://www.wikihow.com/Bake-Chicken-Legs", "passage_text": "Baking, or roasting, chicken legs results in juicy, flavorful meat and crispy skin. Preparing them is as simple as tossing the legs with your favorite flavor combinations and popping them in the oven at a fairly high heat. Read on for three ways to make chicken legs: honey baked, spicy hot, and rosemary garlic. Use tongs to coat them in the mixture. Bake the chicken for 30 minutes. 1  Remember to use oven mitts to protect your hands when you remove the pan from the oven. 2  Place the hot pan on a potholder or trivet."}, {"url": "http://www.answers.com/Q/How_long_do_i_cook_chicken_legs_in_the_oven", "passage_text": "You should cook chicken legs in an convection oven for between 20  and 30 minutes depending on the temperature. The air movement of  convection ovens greatly reduces cooking … times when compared to  traditional ovens. 3 people found this useful. You cook mock chicken legs in an oven set to 350 degrees. The legs  need to cook for 15 to 20 minutes or until they reach an internal  temperature of 160 degrees."}, {"url": "http://www.wikihow.com/Bake-Chicken-Legs", "passage_text": "Bake the chicken. Put the chicken in the oven and set a timer for 30 minutes. Check the chicken after 30 minutes. It should be ready when the skin is crispy and golden brown, or when the internal temperature has reached 180 degrees. Use a meat thermometer to check the temperature. Use tongs to coat them in the mixture. Bake the chicken for 30 minutes. 1  Remember to use oven mitts to protect your hands when you remove the pan from the oven. 2  Place the hot pan on a potholder or trivet."}, {"url": "http://www.food.com/recipe/simple-baked-chicken-drumsticks-443758", "passage_text": "1 Sprinkle lightly with salt. 2  Bake at 375 for half an hour. 3  Turn drumsticks over and add more garlic powder, pepper and salt (same as before). 4  Bake another half an hour (or until cooked til 160 degrees)). Directions. 1  Put some olive oil in the bottom of a 9X13 pan (just enough to put the drumsticks on). 2  Add drumsticks (space enough apart so they aren't touching each other). 3  Sprinkle generously with pepper and garlic powder. 4  Bake at 375 for half an hour. 5"}, {"url": "http://thehousingforum.com/how-long-does-it-take-to-bake-chicken/", "passage_text": "Drumsticks. Drumsticks are a popular choice for many chicken fans, and the cooking process for drumsticks is very similar to that of chicken breasts. At 350 to 375 degrees, drumsticks should be cooked for 40 minutes. It is recommended that the drumstick be turned over halfway through cooking so that the heat evens out. No matter which part of the bird you are cooking, chicken is always a popular choice at the dinner table. Whole Chicken. If you are baking a whole bird, bone-in, your oven should be set at 350 degrees, and the chicken cooked until the internal temperature is 180 degrees. This can take anywhere from an hour to an hour and a half to complete, depending on the size of the bird."}, {"url": "http://www.pbs.org/parents/kitchenexplorers/2013/07/18/grilled-barbecued-chicken-legs/", "passage_text": "1 Bake the chicken for 40 minutes. 2  10 minutes before the chicken is ready to come out of the oven, preheat an outdoor grill to high heat. 3  Prepare the grill by carefully pouring a tablespoons of olive oil onto a folded paper towel. 4  Using heat proof tongs, grease the grill grate with the paper towel, oil side down. "}, {"url": "http://www.answers.com/Q/How_long_do_you_bake_a_chicken_leg", "passage_text": "get yourself a cooking thermometer. the important thing is to cook your meats and fish to the right temp. Chicken legs (or any chick part) should be 165 degrees at the thicke … st part. As for how long and what temperature: id say bake at 350 for about 45 minutes. But check the temp. at 30 minutes to see if they are done. and adjust your time from there. Ill give a link below with baked chick legs recipes. 17 people found this useful"}]