[{"url": "http://www.coolgeography.co.uk/GCSE/AQA/Restless%20Earth/Andes/Andes%20Case%20study.htm", "passage_text": "About the Andes Mountains. The Andes Mountains run the length of the West Coast of South America, rising in the North in Colombia and finishing in Chile and Argentina in the South. They are world's longest mountain range running for over 7,000km and covering 6 countries."}, {"url": "http://www.livescience.com/27897-andes-mountains.html", "passage_text": "The Andes Mountains stretch about 4,500 miles along the western coast of South America. Credit: CIA World Factbook. View full size image. Located along the entire western coast of South America, the Andes mountain range is about 4,500 miles (7,242 kilometers) long. "}, {"url": "http://study.com/academy/lesson/andes-mountains-facts-location-quiz.html", "passage_text": "Lesson Summary. The Andes Mountains line the western edge of South America, from Venezuela all the way along Chile to South America's southern tip (about 9,000 km in all), making them the longest mountain range in the world. Along that route, they cross through Ecuador, Peru, and Bolivia. The Andes Mountains are the world's longest mountain range. Learn where the Andes are located, and learn facts about the Andes' climate, people, and animals."}, {"url": "http://www.mountainprofessor.com/the-andes.html", "passage_text": "The Andes. The Andes Mountains are the longest mountain chain in the world. They stretch along the entire west coast of South America from Cape Horn to Panama, a distance of 4,500 miles. Only the Himalaya Mountains and their adjacent ranges such as the Hindu Kush are higher than the Andes range. Many Andean peaks rise over 20,000 feet (6,096 m.). It is about 500 miles across the widest part of the range. In Spanish, they are called Cordillera de los Andes, which means Andes Mountain Range."}, {"url": "https://en.wikipedia.org/wiki/Andes", "passage_text": "These ranges are in turn grouped into three major divisions based on climate: the Tropical Andes, the Dry Andes, and the Wet Andes. The Andes is the world's highest mountain range outside of Asia. The highest mountain outside Asia, Mount Aconcagua, rises to an elevation of about 6,961 m (22,838 ft) above sea level. "}, {"url": "http://www.answers.com/Q/How_were_the_Andes_Mountains_formed", "passage_text": "You can find the Andes Mountains on the west coast of South America. It is about 4,300 miles long and it is the largest Continental Mountain Range. The Andes Mountains were formed through subduction of the oceanic plate underneath the South American plate."}, {"url": "http://www.windows2universe.org/geography/andes.html", "passage_text": "The mountain range is part of seven countries: Argentina, Bolivia, Chile, Colombia, Ecuador, Peru, and Venezuela. The Andes are a massive barrier between the eastern Pacific Ocean and the rest of the continent of South America. This barrier impacts the climate of South America. The Andes are very narrow in most places and the average width of the Andes is 200 km (124 miles). The height of the Andes is about 4,000 meters (13,123 feet) high, and it includes peaks above 6,000 meters (19,685 feet)."}, {"url": "http://www.windows2universe.org/geography/andes.html", "passage_text": "The Andes Mountains. The Andes Mountains form one of the longest mountain ranges on Earth, stretching over 7,000 km (4,400 miles) along the west coast of South America. The Andes are very narrow in most places and the average width of the Andes is 200 km (124 miles). The height of the Andes is about 4,000 meters (13,123 feet) high, and it includes peaks above 6,000 meters (19,685 feet)."}, {"url": "http://www.answers.com/Q/How_were_the_Andes_Mountains_formed", "passage_text": "The Andes Mountains were formed from volcanism and uplift created by the collision of the Nazca plate with the South American plate. The Andes Mountains were formed through subduction of the oceanic plate undernea"}, {"url": "http://www.factmonster.com/dk/science/encyclopedia/mountain-building.html", "passage_text": "THE ANDES. The Andes is the longest mountain range on land. It was formed along the western margin of South America, where two tectonic plates (rocky plates that make up the Earth’s crust) collided. The mountains are still rising by about 10 cm (4 in) every century. WORLD MOUNTAIN RANGES. The world’s major mountain ranges, such as the Andes, the Himalayas, and the Alps, are situated along the boundaries where tectonic plates collide. These ranges formed in the last few hundred million years, so are they quite young."}]