[{"url": "http://www.popsugar.com/food/Shelf-Life-Raw-Hard-Boiled-Eggs-3008503", "passage_text": "http://www.eatbydate.com/hard-boiled-eggs-shelf-life-expiration-date/. Spectra 6 years. Yeah, you have to be careful about boiled eggs. If you are planning an Easter egg hunt using hard-boiled eggs, don't leave them out of the fridge for longer than about an hour if you plan to eat them later on. The answer to this question may surprise you: while uncooked eggs typically last four to five weeks when properly refrigerated, hard-boiled eggs will only last about a week. This is because egg shells, which are highly porous, are sprayed before sale with a thin coating of mineral oil that seals the egg."}, {"url": "http://cooking.stackexchange.com/questions/24351/shelf-life-of-soft-or-medium-boiled-eggs", "passage_text": "Its easy to google and find information on the shelf life of hard-boiled eggs from seemingly authoritative sources. It seems roughly 1 week when refrigerated is the going shelf life I see quoted. 1 Soft boiled eggs(hard whites, creamy yolks) will keep in the shell, refrigerated for 2 days. 2  Poached eggs, properly cooled in ice water and drained, refrigerated will keep from one morning to the next or aprox 36hrs."}, {"url": "http://www.eatbydate.com/hard-boiled-eggs-shelf-life-expiration-date/", "passage_text": "Hard boiled eggs last about 7 days, but can spoil quickly if not handled properly. Hard boiled eggs are fresh whole eggs that have been boiled for 10 minutes. Chicken eggs are the most common choice for this process. You can extend the answer to how long do hard boiled eggs last by storing them in your fridge (refrigerator) immediately after preparation or use. Once prepared, hard boiled eggs should be stored in a tightly closed container in the fridge to keep out moisture and other contaminants."}, {"url": "http://www.eatbydate.com/hard-boiled-eggs-shelf-life-expiration-date/", "passage_text": "The shelf life of hard boiled eggs is shorter than fresh eggs because egg shells themselves are porous, which means air and bacteria can enter. In nature, when the hen lays the egg she adds a special natural coating which helps to seal and protect the egg. You can extend the answer to how long do hard boiled eggs last by storing them in your fridge (refrigerator) immediately after preparation or use. Once prepared, hard boiled eggs should be stored in a tightly closed container in the fridge to keep out moisture and other contaminants."}, {"url": "http://www.answers.com/Q/Shelf_life_of_a_hard_boiled_egg", "passage_text": "The shelf life of eggs depends on proper handling and storage. If eggs are clean and kept refrigerated, they can last as long as 6 months. Many eggs in the store are at least … a month old while sitting on the shelf. My experience shows that 6 and 7 month old eggs are still good when kept refrigerated. As eggs get older, the chance of finding a spoiled one will increase."}, {"url": "http://www.greatdayfarms.com/egg-facts/15/shelf-life-of-hardboiled-eggs", "passage_text": "Shelf-life of Hardboiled Eggs. The refrigerated shelf life for hardboiled eggs is 38 days from date of packing. Each package should be stamped with a use by date. Once you open the package, you should consume within 2 to 3 days. Back to list. "}, {"url": "http://www.huffingtonpost.com/2015/01/21/hard-boiled-eggs-life-span_n_6516664.html", "passage_text": "Seven days. That's it. Once you've boiled eggs, they have just one week until you should think twice about eating one. (That's assuming they've been stored in the fridge shortly after being boiled.) And if that hard boiled egg was peeled before being refrigerated, that knocks two more days off of its shelf life."}, {"url": "http://ochef.com/1009.htm", "passage_text": "What is shelf life of a hard-boiled egg? Uncooked eggs can be satisfactorily stored in the shell for four to five weeks after they are packaged (so generally at least three weeks after you get them home from the store.) Hard-boiled eggs, however, should be consumed within a week. Why the difference? Egg shells are porous."}]