[{"url": "http://www.cablesforless.com/How-Do-I-Connect-My-Computer-To-My-TV.aspx", "passage_text": "If both your computer and TV have HDMI, all you need is one HDMI Cable for both audio and video. HDMI can be considered the easiest way to make the connection, since it handles both audio and video on one single cable with one single connector. You will most likely need a male to male cable, since most computers and displays have female connectors. If both your computer and your TV have an SVGA connector AND a 3.5mm jack (discussed above), you can connect both the audio and the video using one cable! See our SVGA Cables with 3.5mm Audio."}, {"url": "https://www.bluejeanscable.com/store/dvi-cables/dvicabletypes.htm", "passage_text": "The variety of DVI connection types can be confusing, and if you use the wrong type of cable for the connection you need to make, your video won't get through. This article is meant to help you figure out just what type of connection will, or won't, work with your devices which have DVI sockets. DVI Digital Connection Options: If your signal will be digital, you should use a digital-only cable. If both devices use DVI connections, then you will want a regular DVI-D cable. If one end is DVI and the other HDMI, you'll want a DVI-D to HDMI cable."}, {"url": "http://www.hdmi.org/consumer/finding_right_cable.aspx", "passage_text": "Finding the Right Cable. There are five HDMI cable types to choose from, each designed to meet a particular performance standard. Here is an overview of the HDMI cable types, their capabilities, and how to tell them apart. To help consumer and clarify cable types further, all HDMI cable products will now be required to be labeled by cable type. "}, {"url": "http://www.mycablemart.com/help/hdmi_which_one.php", "passage_text": "Different solutions require different types of HDMI cables depending on the specific feature (or speed rating) you require for your application. The newest cable, HDMI with Ethernet (as defined in the version 1.4 test specification) is FULLY compatible with all previous HDMI cable versions. "}, {"url": "http://televisions.reviewed.com/features/everything-you-need-to-know-about-hdmi-cables", "passage_text": "Lastly, there are two types of HDMI High Speed: regular HDMI High Speed and HDMI High Speed with Ethernet. As the names suggest, the cables with Ethernet allow HDMI cables to transmit an internet connection, while the automotive cable is for use in automobiles. It was only afterwards that I learned a $5 HDMI cable and a $30 cable are identical. Sure, the $5 cable may not be made with gold, but it works just the same. In fact, the audio and video will be virtually indistinguishable from high-priced alternatives."}, {"url": "http://www.cnet.com/news/hdmi-cable-buying-guide/", "passage_text": "Standard speed cables can handle up to 1080i. High speed can handle definition far beyond 1080p. Here's the thing: the price difference is negligible, so only buy high-speed cables. Most HDMI cables you'll find in a store are high-speed cables. Very few products have Ethernet-over-HDMI compatibility, so it's not likely you need to pay extra for the feature in the cable. If you want to future proof your system slightly, then that's your call. "}, {"url": "http://www.cablesforless.com/How-Do-I-Connect-My-Computer-To-My-TV.aspx", "passage_text": "If both your computer and TV have a DVI-I port, you can use any of our DVI-I Cables. DVI-I is also compatible with HDMI, so if your computer has DVI-I, and your TV has HDMI, you can use our HDMI to DVI-D Cables to make the connection. You will need to run audio separately, as DVI does not carry an audio signal. You will most likely need a male to male cable, since most computers and displays have female connectors. If both your computer and your TV have an SVGA connector AND a 3.5mm jack (discussed above), you can connect both the audio and the video using one cable! See our SVGA Cables with 3.5mm Audio."}, {"url": "http://www.cablesforless.com/How-Do-I-Connect-My-Computer-To-My-TV.aspx", "passage_text": "DVI-D is also compatible with HDMI, so if your computer has DVI-D, and your TV has HDMI, you can use our HDMI to DVI-D Cables to make the connection. You will need to run audio separately, as DVI does not carry an audio signal. You will most likely need a male to male cable, since most computers and displays have female connectors. If both your computer and your TV have an SVGA connector AND a 3.5mm jack (discussed above), you can connect both the audio and the video using one cable! See our SVGA Cables with 3.5mm Audio."}, {"url": "http://www.hdmi.org/manufacturer/hdmi_1_4/4K.aspx", "passage_text": "1 Look for devices that support 4K functionality. 2  All High Speed HDMI cables will support 4K functionality when connected to 4K devices. 3  You can use your existing High Speed HDMI cables or choose a different cable type. "}]