[{"url": "https://answers.yahoo.com/question/index?qid=20090319013659AAPbGHi", "passage_text": "You don't have to jet it. If you were to install a full system then yes you do. $400 seems a bit high just to jet the carbs. (Must be a dealership) If you are any where near mechanically inclined you can do it yourself, it's not that hard. If you do have it jetted then you'll want to get an aftermarket air filter too."}, {"url": "https://answers.yahoo.com/question/index?qid=20090319013659AAPbGHi", "passage_text": "Update: I priced to see how much it would cost to get my carbs rejetted and its 400 minus parts which is a little to much for me and it would be another 200-300 for the slip on. Its completely stock right now. And I was think of a D&D exhaust unless some one has a better choice."}, {"url": "http://atvconnection.com/forums/yamaha/28110-why-rejet-when-changing-exhaust.html", "passage_text": "If you had to rejet because your changing the volume of air passing through the engine then you would have to rejet for different engine speeds. (example: I would need a different main jet for 7000 rpm than I need for 9000 rpm.). What the carburetor does not know is how dense the air is coming into it."}, {"url": "http://atvconnection.com/forums/yamaha/28110-why-rejet-when-changing-exhaust.html", "passage_text": "Carburetor's cannot account for changes in air density and that is why you need to rejet at different altitudes(air densities). The exhaust, on the other hand, does not change the air density of the air going into the carburetor."}, {"url": "http://www.kawasakiforums.com/forum/ninja-250r-12/re-jet-carb-after-slip-22750/", "passage_text": "Rejetting is changing the carb./fueling set-up on the bike: fuel/air mix screw, needles, and jets. It's just the way the bike determines how much fuel to flow depending on set-up, throttle input, etc. A mechanic will know how to handle it. However, you should not have to rejet after a slip-on. It will probably help w/power, throttle response, and the power curve, but it won't be necessary. I didn't rejet after my full exhaust and it was more than serviceable. It just depends on what you want from the bike, and how much you want to spend."}, {"url": "http://www.grizzlycentral.com/forum/grizzly-dyno-tuning/18862-rejet-carb-hmf-utility.html", "passage_text": "rejet carb with hmf utility. This is a discussion on rejet carb with hmf utility within the Grizzly Dyno/Tuning forums, part of the Grizzly Forums category; i just got my hmf utility slip on for my grizz 660 i need to rejet the carb but i have the quiet core for ..."}]