[{"url": "http://work.chron.com/average-pay-entry-level-college-professor-5192.html", "passage_text": "Averages. The average salary of an assistant professor is $66,564 for the 2011 to 2012 school year, according to the American Association of University Professors. This organization surveyed over 1,200 colleges on how much they paid their full-time faculty."}, {"url": "http://work.chron.com/fulltime-community-college-professor-salary-9576.html", "passage_text": "Average Salary. The average salary for a full-time professor at a public community college or two-year technical school is $72,000, according to a 2010-11 study published in 2012 in the National Education Association Almanac of Higher Education."}, {"url": "http://www.simplyhired.com/salaries-k-professor-jobs.html", "passage_text": "The average salary for professor jobs is $52,000. Average professor salaries can vary greatly due to company, location, industry, experience and benefits. This salary was calculated using the average salary for all jobs with the term professor anywhere in the job listing."}, {"url": "http://www.simplyhired.com/salaries-k-professor-jobs.html", "passage_text": "Average Professor Salaries. The average salary for professor jobs is $52,000. Average professor salaries can vary greatly due to company, location, industry, experience and benefits. This salary was calculated using the average salary for all jobs with the term professor anywhere in the job listing."}, {"url": "http://work.chron.com/average-pay-entry-level-college-professor-5192.html", "passage_text": "The average salary of an assistant professor is $66,564 for the 2011 to 2012 school year, according to the American Association of University Professors. This organization surveyed over 1,200 colleges on how much they paid their full-time faculty."}, {"url": "http://work.chron.com/average-pay-entry-level-college-professor-5192.html", "passage_text": "The highest average pay for assistant professors, reported in the 2011 to 2012 survey, was the mean $112,300 per year offered by the University of Pennsylvania. Male assistant professors earned $117,800 per year and females made $103,900 per year. The lowest average pay for assistant professors in the 50 states was Lackawanna College at $35,700 per year. Of the college’s 31 full-time faculty, 18 were tenured and an additional nine had tenure-track positions."}]