[{"url": "http://www.copper.org/education/Kids/copperandkids_wheredoescopper.html", "passage_text": "Copper ore. Copper is found in many parts of the world. It usually comes from copper ore, but small amounts are occasionally found (native copper) in distorted cubic crystal chunks. Keweenaw Peninsula near Lake Superior in Michigan is one of the most likely places to find native copper!! Bingham Canyon mine in Utah."}, {"url": "http://www.copper.org/education/Kids/copperandkids_wheredoescopper.html", "passage_text": "Ore is first mined, then put through a series of processes to refine and purify the copper. The USA is the second largest producer of copper in the world. The largest copper mine is found in Utah (Bingham Canyon). Other major mines are found in Arizona, Michigan, New Mexico and Montana. In South America, Chile, the world's largest producer, and Peru are both major producers of copper."}, {"url": "http://whyzz.com/where-does-copper-come-from", "passage_text": "That’s why, most of the time, copper is mined. Copper deposits (or those places the copper is hiding) are spread all across the world. Most of it is found in seven countries: Chile, the United States, Congo, Peru, Zambia, and Mexico."}, {"url": "http://resources.schoolscience.co.uk/cda/11-14/chemistry/copch32pg1.html", "passage_text": "Copper is an unreactive metal-it reacts only slowly with the atmosphere. This means that huge lumps of copper metal are found buried in the ground as nuggets. This is called native copper. The largest nugget of native copper ever found came from Minnesota, USA and weighed over 400 tonnes."}, {"url": "http://www.farmerscopper.com/blog/where-does-copper-come-from/", "passage_text": "Copper is found in many parts of the world. It usually comes from copper ore, but small amounts are occasionally found (“native copper”) in distorted cubic crystal chunks. Keweenaw Peninsula near Lake Superior in Michigan is one of the most likely places to find native copper!!"}]