[{"url": "http://www.city-data.com/city/Gonzales-Louisiana.html", "passage_text": "Gonzales-area historical tornado activity is near Louisiana state average. It is 52% greater than the overall U.S. average. On 12/6/1983, a category F4 (max. wind speeds 207-260 mph) tornado 26.3 miles away from the Gonzales city center injured 25 people and caused between $5,000,000 and $50,000,000 in damages. 1 Regions Bank: St. Amant Branch, Gonzales Branch, Gonzales. 2  Info updated 2011/02/24: Bank assets: $123,368.2 mil, Deposits: $98,301.3 mil, headquarters in Birmingham, AL, positive income, Commercial Lending Specialization, 1778 total offices, Holding Company: Regions Financial Corporation."}, {"url": "http://www.city-data.com/city/Gonzales-Louisiana.html", "passage_text": "Young professional moving to Baton Rouge from Tennessee (10 replies). Latest news from Gonzales, LA collected exclusively by city-data.com from local newspapers, TV, and radio stations. Ancestries: French (16.4%), German (7.9%), Irish (7.7%), United States (4.6%), English (4.4%), French Canadian (3.5%). 1 Regions Bank: St. Amant Branch, Gonzales Branch, Gonzales. 2  Info updated 2011/02/24: Bank assets: $123,368.2 mil, Deposits: $98,301.3 mil, headquarters in Birmingham, AL, positive income, Commercial Lending Specialization, 1778 total offices, Holding Company: Regions Financial Corporation."}, {"url": "http://forecast.weather.gov/zipcity.php?inputstring=Gonzales,LA", "passage_text": "The NWS Storm Prediction Center is forecasting a risk of severe thunderstorms Tuesday afternoon and evening for parts of the southwestern U.S., from central and eastern Arizona across central and southern New Mexico and into parts of West Texas. The main threats will be large hail and damaging winds. Read More... "}, {"url": "http://www.topix.com/city/gonzales-la", "passage_text": "Local news for Gonzales, LA continually updated from thousands of sources on the web. Tell me when there are new stories. REG estimates team will have Geismar plant back online by end of Jan. after explosion and fire Wednesday | KSLA-TV Shreveport. "}, {"url": "http://www.gonzalesla.com/About-Us/", "passage_text": "ABOUT. Welcome to Gonzales, Louisiana, conveniently located between the capitol city of Baton Rouge and the fun and originality of New Orleans. "}, {"url": "https://en.wikipedia.org/wiki/Gonzales,_Louisiana", "passage_text": "Former Gonzales Mayor Johnny Berthelot, a Republican, holds the District 88 seat in the Louisiana House. In 2012, he succeeded Mert Smiley, who was instead elected as the Ascension Parish tax assessor. The railroad assisted in the growth of Gonzales. When the Louisiana Railway and Navigation Company (LR&N) constructed its rail line through the area, there was already a local post office named Gonzales."}, {"url": "http://www.city-data.com/city/Gonzales-Louisiana.html", "passage_text": "On 4/12/1969, a category F3 (max. wind speeds 158-206 mph) tornado 2.2 miles away from the city center injured one person and caused between $50,000 and $500,000 in damages. Gonzales-area historical earthquake activity is below Louisiana state average. 1 Regions Bank: St. Amant Branch, Gonzales Branch, Gonzales. 2  Info updated 2011/02/24: Bank assets: $123,368.2 mil, Deposits: $98,301.3 mil, headquarters in Birmingham, AL, positive income, Commercial Lending Specialization, 1778 total offices, Holding Company: Regions Financial Corporation."}, {"url": "http://www.louisianatravel.com/cities/gonzales", "passage_text": "Gonzales. Along the road between Baton Rouge and New Orleans, Gonzales awaits. This city brashly proclaims itself the “Jambalaya Capital of the World.” With so much competition in the neighborhood, you better be able to back up such a claim. And Gonzales does. For more than 40 years, Gonzales has held an annual springtime Jambalaya Festival and even has a Jambalaya Park next to the city hall. The town’s name does not originate, as one might imagine, from the Spanish colonial days of Louisiana. Rather, the town was named after a local resident of the late 19 th century."}, {"url": "http://www.gonzalesla.com/", "passage_text": "Welcome to Gonzales Louisiana! Welcome to Gonzales, Louisiana, conveniently located between the capitol city of Baton Rouge and the fun and originality of New Orleans. Our area is home to some of the South’s most interesting and beautiful tourist attractions, many steeped in our rich history. There are no fewer than a dozen antebellum homes within a short drive, numerous restaurants all featuring original cuisine and boutique shops along with an outlet mall. So, if you’re looking for “a great escape,” or wanting to relocate, we’re sure you’ll agree when we say, “Gonzales, Nous avons tout!” Call on us for information on our many divisions, departments or simply to find out more about this city we love to call home."}, {"url": "https://en.wikipedia.org/wiki/Gonzales,_Louisiana", "passage_text": "Gonzales is a city in Ascension Parish, Louisiana, United States. As of the 2010 census, it had a population of 9,781. Known as the  Jambalaya Capital of the World, it is famous for its annual Jambalaya Festival, which was first held in 1968. The railroad assisted in the growth of Gonzales. When the Louisiana Railway and Navigation Company (LR&N) constructed its rail line through the area, there was already a local post office named Gonzales."}]