[{"url": "http://www.insects.org/ced1/beetles_rel_sym.html", "passage_text": "In Egypt, the primary symbolism associated with scarab was solar. The first scarab worshiped, was probably the bright metallic Kheper aegyptiorum. The decisive symbolism came from the association of the dung ball to the sun: the scarab rolling his dung ball provided an explanation of the sun’s movement in the sky. "}, {"url": "http://www.egyptianmyths.net/scarab.htm", "passage_text": "Therefore they were worshipped as Khepera, which means he was came forth.. This creative aspect of the scarab was associated with the creator god Atum. The ray-like antenna on the beetle's head and its practice of dung-rolling caused the beetle to also carry solar symbolism. The scarab-beetle god Khepera was believed to push the setting sun along the sky in the same manner as the bettle with his ball of dung. "}, {"url": "http://www.thedreaminterpretation.net/2010/02/beetle.html", "passage_text": "Spiritual Meaning: The scarab beetle was an ancient Egyptian solar symbol – it is said to have rolled the sun across the sky. A beetle thus represents protection from evil. You should look at what, or who, you feels needs to be protected."}, {"url": "http://www.stonesandfindings.com/jewelry-making-articles/articles/symbolism-in-scarab-beetles", "passage_text": "The antenna on the scarab's head and its practice of rolling dung across the desert sands caused the ancient Egyptians to link the scarab to solar symbolism. The scarab god Khepera pushes the setting sun along the sky, the same way a scarab beetle rolls his ball of dung. Perhaps the most common use of Scarabs worn as jewelry and amulets is in ancient Egypt. The Scarab was extremely prevalent in their art, their jewellery, and their myths. The scarab was worshipped as 'Khepera', which means 'he was come forth'."}, {"url": "http://www.spirit-animals.com/scarab-beetle/", "passage_text": "If Scarab Beetle has come into your Dreams; To see a Scarab Beetle in your dream symbolizes your ability to survive, adapt, and change. Know that you are on the right path. It can also be symbolic of your anxieties about death and aging. Alternatively, the Scarab Beetle represents the sun, resurrection, and immortality. To see a Dung Beetle (A matter of perception because a Dung Beetle is a Scarab Beetle) in your dream is an indication that you must look for all of the possible positive outcomes in your current situation rather than focusing on the negative. What is happening in your life is about new possibilities."}, {"url": "http://www.universeofsymbolism.com/scarab-symbolic-meaning.html", "passage_text": "the Egyptian symbol of eternity. Scarab Symbolic Meaning... Scarab beetle is a metaphysical and mythological symbol of ancient Egypt. Scarab holds great meaning and significance... opening one up to an entirely different atmosphere, to the elements and mysteries of the cosmos. ~ Presley Love. Scarab Meaning ~. Scarab beetle is a guide of the cosmic universe, teaching us about the elements of the creative forces... For the Scarab is symbolic of eternity itself. The mystical Scarab beetle appears now to show you a crossroads.."}, {"url": "http://www.answers.com/Q/What_is_the_symbolic_meaning_of_scarab_beetles", "passage_text": "Confidence votes 79.9K. The scarab beetle is a dung beetle, it lays its egg in a ball of dung that it buries in the ground. The egg hatches and the grub eats the dung and then pupates to emerge from the ground as a new adult beetle. The ancient Egyptians saw how these beetles lived and emerged from dry ground and used this as a metaphor for the entombing and resurrection of their mummies."}, {"url": "http://www.answers.com/Q/What_is_the_symbolic_meaning_of_scarab_beetles", "passage_text": "The Egyptians also observed the beetle rolling it's egg ball of along the ground, and the ball was identified with the sun and the beetle with the god Khepri who pushed the ball of the sun across the sky. The egg hatches and the grub eats the dung and then pupates to emerge from the ground as a new adult beetle. The ancient Egyptians saw how these beetles lived and emerged from dry ground and used this as a metaphor for the entombing and resurrection of their mummies."}]