[{"url": "http://budgeting.thenest.com/health-insurance-premium-tax-deductible-24117.html", "passage_text": "Health Insurance Premiums. If you have health insurance provided by your employer, but you also pay health insurance premiums, you may include the out-of-pocket portion of your premiums as medical expenses if you itemize deductions on your federal income tax return. Health insurance premiums are frequently tax deductible. Health insurance premiums can take a major bite out of your budget. This is especially true if you pay for private health insurance. The Internal Revenue Service does provide some relief inthis area for taxpayers on their federal income tax returns."}, {"url": "http://www.moneycrashers.com/deduct-health-insurance-premiums-expenses/", "passage_text": "If your medical expenses were less than $4,000, you won’t get any tax benefit. Expenses that your employer or insurance company cover don’t count, and you can’t “double dip” your tax break by claiming deductions for anything you’ve paid for from your health savings account (HSA) or flexible spending account (FSA) . You can’t deduct anything that already gives you a tax break, and if you pay for your medical premiums with pre-tax money, then you can’t include the expense in your deductions. Still, you can find plenty of premiums that you can deduct, including the following: 1  Insurance Premiums."}, {"url": "http://budgeting.thenest.com/counts-toward-medical-deduction-28853.html", "passage_text": "Premiums and Reimbursement. You can include medical insurance premiums you paid for out of pocket, but not any premiums paid with pretax dollars. That can happen if your employer pays for your insurance and doesn't count it in your taxable income. You also can't deduct anything your insurance covers or reimburses. For example, if you make $3,000, you can't deduct more than $3,000 in health insurance premiums. If you take this deduction, you can't double dip and claim the premiums as part of the regular medical expenses deduction."}, {"url": "http://www.moneycrashers.com/deduct-health-insurance-premiums-expenses/", "passage_text": "1 If you’re paying for individual health insurance out of your own pocket with no other tax break, you can deduct these expenses. 2  However, if you’re part of a group policy through your workplace and you pay the premium with pre-tax money, you’ve already gotten your tax break – you can’t deduct the same costs twice. You can’t deduct anything that already gives you a tax break, and if you pay for your medical premiums with pre-tax money, then you can’t include the expense in your deductions. Still, you can find plenty of premiums that you can deduct, including the following: 1  Insurance Premiums."}, {"url": "http://budgeting.thenest.com/health-insurance-premium-tax-deductible-24117.html", "passage_text": "If your employer does not provide health insurance, you may count your entire premium toward the medical expense deduction. Your medical expenses must exceed 7.5 percent of your adjusted gross income. Beginning Dec. 12, 2012, your medical expenses must exceed 10 percent of your AGI to be eligible for the deduction. Health insurance premiums are frequently tax deductible. Health insurance premiums can take a major bite out of your budget. This is especially true if you pay for private health insurance. The Internal Revenue Service does provide some relief inthis area for taxpayers on their federal income tax returns."}, {"url": "http://www.marketwatch.com/story/how-to-deduct-health-insurance-premiums-2015-01-20", "passage_text": "Bill Bischoff. With the ever-increasing cost of health care, you should be ever-vigilant in looking for chances to claim tax breaks for medical expenses. Here’s the story on health-insurance premiums that you can potentially deduct on your 2014 return. Deductible medical expenses."}, {"url": "https://ecohencpas.com/health-insurance-and-medical-expenses-what-can-you-deduct/", "passage_text": "The IRS now admits that Medicare insurance premiums count as health insurance premiums for purposes of the itemized tax deductions for medical expenses. Specifically, premiums for all four Medicare Parts — A, B, C, and D — should qualify and premiums for Medigap coverage should too. These premiums also count as medical expenses for itemized deduction purposes, subject to the age-based limits shown below. For each covered person, count the lesser of: 1  Premiums paid in the applicable year or. 2  The applicable age-based limit."}, {"url": "http://nisivoccia.com/tax-articles-detail.php?Seniors-Don-t-Overlook-Write-Offs-for-Medicare-Premiums-38", "passage_text": "Seniors can also count premiums paid for private Medicare supplemental insurance policies (often called Medigap coverage) as medical expenses. The cost depends on the plan, but annual premiums can easily amount to $1,000 to $2,000 per covered person or more. 3. Premiums for Qualified Long-Term Care Coverage. Premiums for qualified long-term care insurance also count as medical expenses, subject to age-based limits. For each covered person, count the lesser of the actual premiums paid for the year or the age-based limit from below."}, {"url": "http://www.marketwatch.com/story/how-to-deduct-health-insurance-premiums-2015-01-20", "passage_text": "However, to actually claim a deduction on your 2014 return, your total qualified expenses, including eligible health insurance premiums, must exceed 10% of your adjusted gross income (AGI) or 7.5% of AGI if you, or your spouse if you are married, was age 65 or older as of Dec. 31, 2014. With the ever-increasing cost of health care, you should be ever-vigilant in looking for chances to claim tax breaks for medical expenses. Here’s the story on health-insurance premiums that you can potentially deduct on your 2014 return. Deductible"}, {"url": "https://ecohencpas.com/health-insurance-and-medical-expenses-what-can-you-deduct/", "passage_text": "Premiums for Qualified Long-Term Care Insurance. These premiums also count as medical expenses for itemized deduction purposes, subject to the age-based limits shown below. For each covered person, count the lesser of: 1  Premiums paid in the applicable year or. 2  The applicable age-based limit."}]