[{"url": "http://www.webmd.com/diet/guide/calories-chart", "passage_text": "To maintain weight, the chart below shows you your daily calorie limit. It's based on your age, activity level, and the BMI (body-mass index) of 21.5 for women and 22.5 for men. To lose weight -- about 1 pound a week -- reduce total calories in the chart by 500 a day. To gain weight, add 500 calories per day for each pound you want to gain per week. For successful weight loss that you can maintain over time, experts recommend choosing foods that are lower in calories but rich in protein, vitamins, minerals, fiber, and other nutrients."}, {"url": "http://www.positivehealthsteps.com/calories/daily-required.shtml", "passage_text": "If you want to know how many calories each day you need to consume to lose weight, you should keep your daily calorie intake under the required allowance for your age and weight. Most people will lose weight when consuming around 1500 calories per day. Women."}, {"url": "http://www.acaloriecounter.com/diet/how-many-calories-are-needed-to-maintain-my-current-weight/", "passage_text": "All that’s left to do now is make sure the amount of calories you calculated truly is 100% accurate for you and truly is how many calories you need to eat per day to maintain your current weight."}, {"url": "http://www.acaloriecounter.com/diet/how-many-calories-are-needed-to-maintain-my-current-weight/", "passage_text": "Because your calorie maintenance level already is how many calories are needed for you to maintain your current weight. You already did 99% of the work in that last step when you calculated what yours is. (If you skipped the previous step, now is the time to go back and do it.)."}, {"url": "http://www.acaloriecounter.com/diet/calorie-maintenance-calculator-daily-calorie-requirements/", "passage_text": "And, the starting point for figuring out exactly how many calories you need to eat per day revolves around something called your calorie maintenance level. Your calorie maintenance level is where your body is at when you consume and burn the same number of calories."}, {"url": "http://www.acaloriecounter.com/diet/how-many-calories-are-needed-to-maintain-my-current-weight/", "passage_text": "To figure out exactly how many calories are needed to maintain your current weight, all it takes is a very simple 4 step experiment: 1  Consistently eat the same number of calories each day for a few weeks, and keep your activity level fairly consistent as well."}, {"url": "http://www.active.com/fitness/calculators/calories/", "passage_text": "Use our calorie-intake calculator to determine your daily caloric needs based on your height, weight, age and activity level. In addition to determining the calories needed to maintain weight, use this as a calorie burner calculator and figure out how many calories you need to burn in order to drop pounds."}]