[{"url": "http://www.vegetariantimes.com/article/ask-the-nutritionist-how-much-fiber-do-i-really-need/", "passage_text": "A: The amount you need is tied to the number of calories you eat in a day. For healthy adults, the USDA recommends 14 grams of fiber for every 1,000 calories consumed. So a person eating 2,000 calories a day should aim to get 28 grams of fiber daily. A: Soluble and insoluble fiber can be found in different foods, and also in different parts of the same food. Insoluble fiber tends to be found in the peels and husks of plant foods, and soluble fiber is found in the fleshy interior."}, {"url": "http://www.everydayhealth.com/hs/guide-to-daily-fiber/too-much-fiber/", "passage_text": "So just how much fiber do you need? The national fiber recommendations are 30 to 38 grams a day for men and 25 grams a day for women between 18 and 50 years old, and 21 grams a day if a woman is 51 and older. Another general guideline is to get 14 grams of fiber for every 1,000 calories in your diet. Achieving these goals is beneficial to your overall health, and fiber helps you feel fuller longer. For many people, it can be a challenge to get that much fiber in a typical American diet."}, {"url": "http://healthyeating.sfgate.com/calculate-much-fiber-one-needs-day-4814.html", "passage_text": "For example, eat 38 grams of fiber each day if you’re a man ages 19 to 50, 30 grams per day if you’re a man age 50 or older, 25 grams if you’re a woman ages 19 to 50, 21 grams if you’re a woman age 50 or older, 28 grams if you’re pregnant and at least 29 grams of fiber each day if you’re breastfeeding. For example, if you require 2,000 calories per day for healthy weight maintenance you should consume 28 grams of fiber each day, and if you need 3,000 calories you should eat 42 grams of fiber every day. It is ideal to get your fiber from a well-balanced diet containing plenty of fiber-rich foods"}, {"url": "http://answers.webmd.com/answers/1179680/how-much-fiber-do-we-need", "passage_text": "The average American gets about 11 grams of fiber daily, much less than we need, according to the American Dietetic Association. Women should aim for 21 to 25 grams of fiber daily. Men should aim for 30 to 38 grams of fiber daily. The American Academy of Family Physicians recommends eating at least nine servings (four 1/2 cups) of fiber-filled fruits and vegetables each day, including apples, oranges, broccoli, berries, pears, peas, figs, carrots, and beans."}, {"url": "http://www.webmd.com/diet/guide/fiber-how-much-do-you-need", "passage_text": "The average adult only eats 15 grams of fiber per day. Women need 25 grams of fiber per day, and men need 38 grams per day, according to the Institute of Medicine. Eating more plant foods -- vegetables, beans, fruit, whole grains, and nuts -- is the best way and is one of the major recommendations from the U.S. government's 2010 Dietary Guidelines. "}, {"url": "http://www.eatingwell.com/nutrition_health/nutrition_news_information/boost_your_fiber_intake_to_lose_weight", "passage_text": "The recommended daily value for fiber is 25 grams of fiber per day. Of course, this is one nutrient for which more (from whole foods) is better. No need to slam back fiber-supplement drinks to get more. Instead, boost your intake by making simple trades that, at the end of the day, really add up. (Check out these Fiber-Rich Dinners to Help You Lose Weight .) Here are five swaps that will boost your daily fiber intake by 20 grams."}, {"url": "http://www.vegetariantimes.com/article/ask-the-nutritionist-how-much-fiber-do-i-really-need/", "passage_text": "In food terms, you could hit (and even exceed) that target by eating the following foods over the course of a day: ½ cup oatmeal (3 grams fiber), 1 small banana (3 grams), ½ cup cooked red or black beans (7 grams), 1 small apple (5 grams), ½ cup lentils (8 grams), and ½ cup blueberries (3 grams). A: Soluble and insoluble fiber can be found in different foods, and also in different parts of the same food. Insoluble fiber tends to be found in the peels and husks of plant foods, and soluble fiber is found in the fleshy interior."}, {"url": "https://www.exercise.com/faq/how-much-fiber-do-i-need-in-a-day", "passage_text": "The amount of fiber you need on a daily basis depends on your age and gender. The standard recommendation for fiber consumption suggests that you should consume a minimum of 25 grams of fiber per day. "}, {"url": "http://healthyeating.sfgate.com/many-grams-fiber-should-daily-3644.html", "passage_text": "Fiber Needs for Men. Men who are 50 years old or younger should consume 38 grams of fiber per day, according to MayoClinic.com. Men who are 51 years old or older need 30 grams of fiber per day. However, people who are on a reduced calorie diet may need less fiber. According to SuperKidsNutrition.com, you should aim for 10 to 13 grams of fiber per 1,000 calories you consume. Therefore, if you are consuming 2,000 calories per day, you should aim to eat 20 to 26 grams of fiber. The amount of fiber that a person should consume each day varies based upon his or her age and gender"}]