[{"url": "http://www.thinkbabynames.com/names/1/rock", "passage_text": "Alan-Evan. Page 1/4 of 78 Rock names. Alan▲ 1 .. .. the Gaelic ailin meaning little rock  .. Alban (top 10%) is a popular surname similar to Alan (top 12%) , Allen (1%) , etc.. [ Ailean, Alin, Allain, Allayne, Alleyn, Allyn, Alon, Alun, Alyn, .. 16 more ]. Alban 2 ."}, {"url": "http://www.thinkbabynames.com/meaning/1/Rock", "passage_text": "Rock is an unusual first name for males but a very prominent last name for both adults and children (#1779 out of 150436, Top 1%). (2000 U.S. Census). Charted below is the baby name popularity of Rock for boys. Rock entered the list in 1950-1959 and reached its peak rank of #773 in the U.S. then, but is not ranked at the moment. (2014 Birth Statistics). Below is a charted comparison of the popularity of the boy name Rock and affiliated names."}, {"url": "http://www.babynamespedia.com/meaning/Rock", "passage_text": "Rock is an English name of Germanic, Old English, and English origin. Rock is a variation (English) of the name Rocco (English and Italian). Rock is also a shortening of the name Rockwell (English). Rock is also a variation of the name Rocky (English). Rock is uncommon as a baby boy name. At the modest height of its usage in 1957, 0.007% of baby boys were named Rock. "}, {"url": "http://www.sheknows.com/baby-names/name/rock", "passage_text": "English Meaning: The name Rock is an English baby name. In English the meaning of the name Rock is: Rock. American Meaning: The name Rock is an American baby name. In American the meaning of the name Rock is: Rock."}, {"url": "http://scbsfm.blogspot.com/2010/09/baby-names-meaning-rock.html", "passage_text": "Label: Names Meaning. L ist of baby names which mean  ROCK . These names for males and females originated from French, Japanese, American, Greek, Biblical, English, Irish, Italian and Indian background. - CHANTAL: French female name meaning Rocky Land or Song. - CHANTEL: French female name meaning Rocky Land or Singer. - ISHI: Japanese female name meaning Rock."}, {"url": "http://www.thinkbabynames.com/names/1/rock", "passage_text": "Page 1/4 of 78 Rock names. Alan▲ 1 .. .. the Gaelic ailin meaning little rock  .. Alban (top 10%) is a popular surname similar to Alan (top 12%) , Allen (1%) , etc.. [ Ailean, Alin, Allain, Allayne, Alleyn, Allyn, Alon, Alun, Alyn, .."}, {"url": "http://babynames.allparenting.com/babynames/Ideas/Baby_boy_names_that_mean_rock/", "passage_text": "Do you hope your baby boy will be steadfast and sure as he moves through life? These baby names are the most rock solid you will find -- they all mean rock in some form or another. For a strong name for your baby boy, check out these names that mean rock. "}, {"url": "http://nameberry.com/list/449/Rock-Star-Baby-Names", "passage_text": "Rock Star Baby Names. These rock and roll baby names are sure to bring out the star in your little one. Inspired by the rockers themselves, or the subjects of their songs (Jude, Layla, and Roxanne for instance), these names are the most edgy, interesting, or relevant of the rock star choices. 1  Share: 2  Share on Facebook."}]