[{"url": "https://uk.answers.yahoo.com/question/index?qid=20090730065716AAAri54", "passage_text": "Bear in mind that the suburbs of London sprawl for miles and miles. Many of the places which now fall under the umbrella of Greater London used to be parts of seperate counties such as Middlesex and Essex. If you stay within the boundaries of zones 1-4 you will have no problems getting around."}, {"url": "http://www.undertheraedar.com/2011/10/how-big-is-london.html", "passage_text": "The cities (i.e. the local authorities) in the image above are ranked by land area. London is the largest, at around 610 square miles, and Nottingham is the smallest at around 30 square miles."}, {"url": "http://www.distancefromto.net/between/London/Cornwall", "passage_text": "Distance between London and Cornwall is 335.46 km. This distance is equal to 208.45 miles, and 181.02 nautical miles. Country Cities » United Kingdom » London | Cornwall. The distance line on map shows distance from London to Cornwall between two cities."}, {"url": "http://www.answers.com/Q/How_many_square_miles_is_London", "passage_text": "To properly answer the question a person needs to know where in Africa as it is a extremely large country. London to Johannesburg, South Africa is 5609 miles (9027 km).  …  London to Cairo, Egypt is 2187 miles (3520 km).   London to Nairobi, Kenya is 4228 miles (6804 km)."}, {"url": "http://www.undertheraedar.com/2011/10/how-big-is-london.html", "passage_text": "In studies of cities and urban areas, a common question that crops up is 'how big' a particular city is. I'd be inclined to answer this in terms of population, which for Greater London in mid-2010 was 7.83million. Most urban academics, however, are more pedantic and if you asked them how big London is, they might ask what you mean by 'big' and what you mean by 'London'. So, following the theme of some posts over the past year I decided to take a look at this purely in terms of the land area of some key UK 'cities'."}]