[{"url": "http://happytoothnc.com/tmj-tmd-causes/", "passage_text": "Although the exact cause of TMD remains unclear, dentists believe that the symptoms stem from problems with the muscles of the jaw or with the parts of the joint itself. Problems with your TM joints can be attributed to: 1  Grinding or clenching your teeth. 2  Stress, if it provokes you to tighten your facial muscles or jaw. Call your dentist if you suffer from the following symptoms of TMD 1  : Facial, neck or shoulder pain when you chew, speak or open your mouth widely. 2  Inability to fully open your mouth easily. 3  Locking of your jaws."}, {"url": "http://www.webmd.com/oral-health/guide/temporomandibular-disorders-tmd", "passage_text": "We don’t know what causes TMD. Dentists believe symptoms arise from problems with the muscles of your jaw or with the parts of the joint itself. Injury to your jaw, the joint, or the muscles of your head and neck -- like from a heavy blow or whiplash -- can lead to TMD. Other causes include: 1  Grinding or clenching your teeth, which puts a lot of pressure on the joint. 2  Movement of the soft cushion or disc between the ball and socket of the joint. 3  Arthritis in the joint. 4  Stress, which can cause you to tighten facial and jaw muscles or clench the teeth"}, {"url": "http://www.nhs.uk/conditions/temporomandibular-joint-disorder/Pages/Introduction.aspx", "passage_text": "Possible causes of TMD include: 1  clenching your jaw or grinding your teeth during sleep (bruxism) – which overworks the jaw muscles and puts pressure on the joint (often caused by stress). 2  wear and tear of the inside of the jaw joint – usually caused by osteoarthritis. Temporomandibular disorder (TMD) is a problem affecting the 'chewing' muscles and the joints between the lower jaw and the base of the skull. Doctors sometimes refer to the condition as myofascial pain disorder"}, {"url": "http://www.tmjtherapy.com/treatment/what-causes-tmj/", "passage_text": "1 Stress causes TMD… Remove stress or manage the patient’s stress through difficult times, and the patient’s pain will be reduced. 2  There is no question that personal stress is an important factor in TMD and stress management is an important part of each patient’s TMD treatment. Symptoms | Causes | Diagnosis | Treatment. There are myths and unsubstantiated beliefs in the following philosophies on the causes of TMD that can lead to over-treatment and unsuccessful results for the patient."}, {"url": "http://happytoothnc.com/tmj-tmd-causes/", "passage_text": "First, TMJ or TMD involves the temporomandibular (TM) joints, which are located on each side of your head. These joints work with your muscles, ligaments, discs and bones, enabling you to speak, chew and yawn. Temporomandibular disorders (TMD) occur when your TMs aren’t working properly. Call your dentist if you suffer from the following symptoms of TMD 1  : Facial, neck or shoulder pain when you chew, speak or open your mouth widely. 2  Inability to fully open your mouth easily. 3  Locking of your jaws."}, {"url": "http://www.webmd.com/oral-health/guide/temporomandibular-disorders-tmd", "passage_text": "1 Grinding or clenching your teeth, which puts a lot of pressure on the joint. 2  Movement of the soft cushion or disc between the ball and socket of the joint. 3  Arthritis in the joint. 4  Stress, which can cause you to tighten facial and jaw muscles or clench the teeth. Other causes include: 1 "}, {"url": "https://www.deltadentalins.com/oral_health/tmj.html", "passage_text": "Temporomandibular Disorder (TMD) refers to a variety of conditions that affect TM joints, jaw muscles and facial nerves. TMD may occur when the jaw twists during opening, closing or side-motion movements. People with TMD may experience these symptoms: 1  pain in or around the ear. 2  headaches and neck aches. 3  tenderness of the jaw or jaw muscles. 4  jaw pain or soreness that is more prevalent in the morning or late afternoon. 5  jaw pain when chewing, biting or yawning. 6  difficulty opening and closing the mouth"}]