[{"url": "http://talkshows.about.com/od/talkshowfun/tp/Top-10-Richest-Daytime-Talk-Show-Hosts.htm", "passage_text": "9. Talk show host Wendy Williams has scored high ratings and solid spot on TV and radio over the last few years. And that, along with endorsement deals, has upped her net worth from $17.5 million about two years ago to $60 million today. Ellen DeGeneres, host of The Ellen DeGeneres Show, may be the true inheritor of Oprah Winfrey's audience. She's certainly the inheritor of the top spot in this net worth battle, taking over for Oprah, who is no longer a daytime talk show host."}, {"url": "http://work.chron.com/yearly-salary-television-host-7778.html", "passage_text": "An experienced reporter with a bachelor's degree in journalism is typically hired to host a television news show. The BLS reports an average income of $54,140 for broadcast news analysts. Again, star factor plays a role in salary, as does size of the network or television station. Comedian David Letterman takes home $31 million each year hosting The Late Show With David Letterman on CBS. Kelly Ripa, who began as a soap opera actress, earns $7 million as host of the daily Live! With Kelly show that airs weekdays on ABC."}, {"url": "http://study.com/articles/Salary_and_Career_Information_for_a_TV_Host.html", "passage_text": "TV Host Salary Information. According to the U.S. Bureau of Labor Statistics (BLS), radio and television announcers, including TV hosts, earned a mean annual wage of $41,800 in May 2013 (www.bls.gov). Announcers working specifically in the radio and television broadcasting industry earned a mean salary of $39,980 a year. Announcers working in spectators sports earned an average of $92,360 a year. TV hosts typically concentrate on one type of show, such as talk, sports, finance, or business"}, {"url": "http://www.businessinsider.com/tv-personality-salaries-2014-9", "passage_text": "TV Guide recently released its annual salary report, a list that rounds up the paychecks of some of television's highest-paid actors and TV personalities. Jon Stewart may be the highest-paid late-night host; however, there's one woman who has been keeping him at bay from being the highest-paid on television. "}, {"url": "http://talkshows.about.com/od/talkshowfun/tp/Top-10-Richest-Daytime-Talk-Show-Hosts.htm", "passage_text": "Wendy Williams: $60 million. Talk show host Wendy Williams has scored high ratings and solid spot on TV and radio over the last few years. And that, along with endorsement deals, has upped her net worth from $17.5 million about two years ago to $60 million today. Ellen DeGeneres, host of The Ellen DeGeneres Show, may be the true inheritor of Oprah Winfrey's audience. She's certainly the inheritor of the top spot in this net worth battle, taking over for Oprah, who is no longer a daytime talk show host."}, {"url": "http://talkshows.about.com/od/talkshowfun/tp/Top-10-Richest-Talk-Show-Hosts.htm", "passage_text": "3. Though he often lands at No. 1 in ratings, Tonight Show host Jay Leno sits behind Letterman with a net worth of $250 million and an annual salary of about $25 million. Leno collects his extra cash through an extensive line-up of stand-up shows across the country. More ». David Letterman: $400 million. The king of late night, David Letterman, host of the Late Show with David Letterman takes a back seat to Oprah. Letterman has a net worth of $400 million and makes $50 million a year."}, {"url": "http://www.salarylist.com/jobs/Television-Host-Salary.htm", "passage_text": "Television Host average salary is $87,050, median salary is $74,400 with a salary range from $74,400 to $125,000. Television Host salaries are collected from government agencies and companies. "}, {"url": "http://www.tvguide.com/news/tv-highest-paid-stars-1069334/", "passage_text": "Ashton Kutcher remains the top paid actor in prime time with $750,000 an episode for his role on Two and a Half Men. NCIS star Mark Harmon is still the salary champ in drama, with $525,000 an episode plus a piece of the show's profits. But there could be some new titleholders on the horizon, sources tell TV Guide Magazine."}, {"url": "http://www.tvguide.com/news/tv-highest-paid-stars-1069334/", "passage_text": "Jon Stewart. There is a new king of late night, according to TV Guide Magazine 's annual survey of star salaries. And he's a very rich king. The Daily Show host Jon Stewart is now earning between $25-30 million a year, according to several sources (his network, Comedy Central, did not comment). That puts Stewart ahead of the past perennial late night salary leaders Jay Leno and David Letterman. NCIS star Mark Harmon is still the salary champ in drama, with $525,000 an episode plus a piece of the show's profits. But there could be some new titleholders on the horizon, sources tell TV Guide Magazine."}]