[{"url": "http://housewares.about.com/od/humidifiersdehumidifiers/qt/humiditylevels.htm", "passage_text": "Keeping the correct humidity level in your home is important to your well-being, and while a little moisture can be beneficial, too much could be hazardous to your health. Recommended Relative Humidity Level: The recommended average relative humidity level is between 35% and 45%."}, {"url": "http://www.ehow.com/how_7811783_control-humidity-house.html", "passage_text": "Controlling the humidity in your home is critical to staying comfortable and avoiding problems with your home. For example, too much home humidity -- which is common during summer -- can cause allergies and promote the growth of mold, which can be a health risk and cause structural damage in"}, {"url": "http://www.doityourself.com/stry/moisturehumidifier", "passage_text": "It is important to maintain the proper humidity levels in your home and workplace. Indoor humidity levels should be between 30 to 50 percent with the ideal level being about 45 percent."}, {"url": "http://homeguides.sfgate.com/reduce-humidity-home-26581.html", "passage_text": "Bringing a home’s relative humidity level down to within a normal range of 30 to 50 percent water to the maximum that the air can hold at a certain temperature -- in other words, to 30 to 50 percent relative humidity -- is important."}, {"url": "http://www.doityourself.com/scat/moistureaircontrol/", "passage_text": "Mildew if. How to Regulate the Humidity Level in the Garage The humidity level in your garage could be something that could cause you a lot of problems in your home. 2 Factors that Affect the Humidity Level in a House There are a number of factors which can affect the humidity level"}, {"url": "http://www.ehow.com/how_7811783_control-humidity-house.html", "passage_text": "Place a dehumidifier in your house, especially in damp and humid areas such as your basement. Choose a dehumidifier that has automated controls for monitoring and setting relative humidity levels; the ideal humidity level for a home is 40 percent to 50 percent in the summer and 30 percent to 50 percent in the winter."}, {"url": "http://www.hgtv.com/remodel/mechanical-systems/maintain-indoor-relative-humidity", "passage_text": "When the indoor humidity level is below 30 percent, the air is too dry, which can harm both a home's structural integrity and the homeowners' health. Conversely, when the level is above 60 percent, the air is too wet, which is also harmful to both the home and the homeowners."}, {"url": "https://learningcenter.statefarm.com/residence/maintenance/how-to-help-conquer-home-humidity/", "passage_text": "According to ENERGY STAR, the ideal indoor humidity level is between 30 and 50 percent. In addition to just making you uncomfortable, high humidity levels can pose a threat to your home s structure and surfaces. Help clear the air with these tips for reducing and controlling humidity at home."}]