[{"url": "http://www.livestrong.com/article/265506-can-people-on-a-dairy-free-diet-take-probiotics/", "passage_text": "You can also incorporate probiotics into your diet through dairy-free foods. Yogurt and kefir contain live probiotic cultures, such as bifidobacteria and lactobacilli, but dairy-free versions of yogurt and kefir made from almond, soy or coconut milk and can be found at your local supermarket and health food store. Probiotics can be taken as supplements and are found naturally in certain foods. If you follow a dairy-free diet, you can still take probiotics. While probiotics are often found in dairy-based foods such as yogurt, several dairy-free alternatives are just as effective."}, {"url": "https://draxe.com/probiotic-yogurt/", "passage_text": "Affiliate Disclosure 0 Comments. Traditional probiotic yogurt is made from dairy that’s fermented into a creamy food packed with beneficial probiotics and is a balanced source of protein, fats, carbohydrates, vitamins and minerals. Yogurt is considered a superfood. Raw dairy is rich with probiotics and healthy bacteria, and yogurt made from it starts off ahead of the rest. Raw milk is nutrient-dense, helping to increase bone density, build a stronger immune system, build lean muscle mass and so much more."}, {"url": "http://cdrf.org/home/checkoff-investments/usprobiotics/products-with-probiotics/", "passage_text": "A few probiotics are marketed as medical foods. Although fermented dairy products such as yogurt and kefir are typically associated with delivery of “beneficial cultures”, the types of foods claiming to deliver probiotics has expanded to include granola and candy bars, frozen yogurt, cereal, juice and cookies. Yogurt is a primary food vehicle for probiotics. It is produced by fermentation of milk by two starter cultures, Lactobacillus bulgaricus and Streptococcus thermophilus. In the United States, post-fermentation heat treatment of yogurt, which kills all live cultures, is allowed."}, {"url": "http://nourishedkitchen.com/dairy-free-probiotics/", "passage_text": "Coconut kefir is a probiotic beverage prepared from young coconut water and a starter culture. Best championed by the Body Ecology Diet, coconut kefir combines many of the benefits of coconut with the benefits of probiotics. Coconut water is rich in minerals like calcium and potassium, but it is relatively sweet. But if you choose not to eat dairy foods or cannot tolerate them, finding dairy-free probiotic foods can pose more of a challenge; however, that doesn’t have to be the case. Indeed, there are many, many dairy-free foods rich in probiotics and beneficial bacteria. As with anything, it’s just a matter of identifying them."}, {"url": "http://www.natural-digestion.com/non-dairy-probiotics/", "passage_text": "For any food or drink to contain probiotics it has to be fermented. Even dairy products such as yogurt and fifer are made using the fermentation process. Many people and cultures ferment other foods such as vegetables, and these can be a source of probiotics: sauerkraut – usually made with different types of cabbage."}, {"url": "http://digestivehealthguide.com/non-dairy-probiotics/", "passage_text": "We often associate probiotics with dairy products such as bio live yogurt or kefir. However, dairy products from cows milk are difficult for the human digestive system to break down. For this reason, many people are unable to take probiotic drinks due to a lactose intolerance. Vegans wanting to improve their digestive health cannot consume dairy products because of their dieting principles."}, {"url": "http://nourishedkitchen.com/dairy-free-probiotics/", "passage_text": "We hear it all the time (and I say it plenty!): eat your yogurt for probiotics. But if you choose not to eat dairy foods or cannot tolerate them, finding dairy-free probiotic foods can pose more of a challenge; however, that doesn’t have to be the case. Indeed, there are many, many dairy-free foods rich in probiotics and beneficial bacteria. As with anything, it’s just a matter of identifying them."}, {"url": "http://www.globalhealingcenter.com/natural-health/probiotic-foods/", "passage_text": "1. One of the best probiotic foods is live-cultured yogurt, especially handmade. Look for brands made from goat’s milk that have been infused with extra forms of probiotics like lactobacillus or acidophilus. Goat’s milk and cheese are particularly high in probiotics like thermophillus, bifudus, bulgaricus and acidophilus. Be sure to read the ingredients list, as not all yogurt is made equally. "}, {"url": "http://digestivehealthguide.com/non-dairy-probiotics/", "passage_text": "Kefir from Soy. Kefir is a yogurt style drink normally made from cows or goats milk however, there is a non dairy yogurt with probiotics that uses fermented soy beans. This soy kefir normally includes the strains bifidobacterium and lactobacillus. However, dairy products from cows milk are difficult for the human digestive system to break down. For this reason, many people are unable to take probiotic drinks due to a lactose intolerance. Vegans wanting to improve their digestive health cannot consume dairy products because of their dieting principles."}]