[{"url": "http://www.answers.com/Q/How_much_does_a_koala_weigh", "passage_text": "Koalas found in the northern parts of Australia weigh up to 9 kg (19.8 pounds) for males and 7.25 kg (… 16 pounds) for females.Southern koalas weigh up to 15 kg (33 pounds) for males and 11 kg (24 pounds) for females. 9 people found this useful. Answered. Koalas only eat approximately 50 of the 600 different eucalyptus species in Australia. Each koala eats around 400 to 600 grams of eucalyptus leaves each day. Eucalyptus … leaves contain approximately 50% water so koalas generally do not need an additional water source."}, {"url": "http://www.answers.com/Q/How_much_does_a_koala_weigh", "passage_text": "The average weight of a koala varies according to where it lives. A newborn joey weighs about 0.5 grams and is about 2 cm long. 1  Northern koalas weigh up to 9 kg (19.8 pounds) for males and 7.25 kg (16 pounds) for females. 2  Southern koalas weigh up to 15 kg (33 pounds) for males and 11 kg (24 pounds) for females. Koalas only eat approximately 50 of the 600 different eucalyptus species in Australia. Each koala eats around 400 to 600 grams of eucalyptus leaves each day. Eucalyptus … leaves contain approximately 50% water so koalas generally do not need an additional water source."}, {"url": "http://www.livescience.com/27401-koalas-facts.html", "passage_text": "Koalas are 2 to 3 feet (60 to 85 centimeters) tall when fully grown. Their weight varies, depending on where the koala lives. Northern koalas weigh around 9 to 19 lbs. (4 to 8.5 kilograms) and southern koalas weigh around 15 to 29 lbs. (7 to 13 kg). Typically, males weigh 50 percent more than females, according to San Diego Zoo. Koalas eat 3 hours per day, usually during the nighttime, and rest 16 to 18 hours a day, according to the Adelaide Zoo. They sleep so much because they need time and energy to digest their food. It takes a lot of energy to digest the fibrous leaves of the eucalyptus. Koalas are herbivores who eat only"}, {"url": "http://www.answers.com/Q/How_much_does_a_koala_weigh", "passage_text": "1 Northern koalas weigh up to 9 kg (19.8 pounds) for males and 7.25 kg (16 pounds) for females. 2  Southern koalas weigh up to 15 kg (33 pounds) for males and 11 kg (24 pounds) for females. Koalas only eat approximately 50 of the 600 different eucalyptus species in Australia. Each koala eats around 400 to 600 grams of eucalyptus leaves each day. Eucalyptus … leaves contain approximately 50% water so koalas generally do not need an additional water source."}, {"url": "http://www.koalainfo.com/average-weights-of-male-koalas", "passage_text": "A Male Koala that lives across Queensland has an average weight of around 10 Kilograms. At maximum they can get around 12 Kilograms but that is very rare. On the other hand usually and normally a male Koala from Queensland gains a weight of around 8 to 9 Kilograms on average. But this is a minimum weight of the male Koala. This minimum weight of the Koala belongs to the Koalas that live in Queensland. A Male Koala living at Australia s Victorian territory will have a weight of around 15 to 18 kilograms as well."}, {"url": "http://www.pbs.org/wnet/nature/cracking-the-koala-code-koala-fact-sheet/7681/", "passage_text": "Species: cinereus. Size and weight: Koalas average 27-36 in (70 to 90cm) in length and weigh anywhere from 9 to 20 lbs (4-9 kg). Females tend to be both slightly smaller and slightly less heavy than males. Southern koalas are approximately 30% larger than their northern counterparts. "}, {"url": "http://www.answers.com/Q/How_much_do_Koalas_weigh", "passage_text": "The average weight of a koala varies according to where it lives. Northern koalas weigh up to 9 kg (19.8 pounds) for males and 7.25 kg (16 pounds) for females.Southern koalas … weigh up to 15 kg (33 pounds) for males and 11 kg (24 pounds) for females. A newborn joey weighs about 0.5 grams and is about 2 cm long. Northern koalas can grow to 740 mm and 9 kg (19.8 lb) for males and 720 mm and 7.25 kg (16 lb) for females. Southern koalas can grow to 820 mm and 15 kg (33 lb) for males and 730 mm and 11 kg (24.2) for females. They breed from September to February."}, {"url": "http://www.koalainfo.com/average-weights-of-male-koalas", "passage_text": "Male Koalas are huge in size and weights. Usually on the average a male Koala weighs around 9 to 12 Kilograms. But this is a minimum weight of the male Koala. This minimum weight of the Koala belongs to the Koalas that live in Queensland. A Male Koala living at Australia s Victorian territory will have a weight of around 15 to 18 kilograms as well."}]