[{"url": "http://www.innerbody.com/image/skelfov.html", "passage_text": "The skeletal system includes all of the bones and joints in the body. Each bone is a complex living organ that is made up of many cells, protein fibers, and minerals. The skeleton acts as a scaffold by providing support and protection for the soft tissues that make up the rest of the body. "}, {"url": "http://www.answers.com/Q/Explain_the_relationship_between_the_muscular_and_the_skeletal_system_in_the_way_they_function", "passage_text": "Muscular system provides ligaments, tendons, and muscles to make the bones attach muscles. Without the skeletal syst … em, our body will not have any support. Without muscular system, we'll just look like a skeleton covered with skin. Confidence votes 1.2K. The skeletal system includes the bones that are moved by the muscles. The muscles are connected or attached to the bones by tendons. The muscles pull on the bones, approximating certain attachments & many times causing the bones to act like levers."}, {"url": "http://www2.estrellamountain.edu/faculty/farabee/biobk/BioBookMUSSKEL.html", "passage_text": "The skeleton and muscles function together as the musculoskeletal system. This system (often treated as two separate systems, the muscular, and skeletal) plays an important homeostatic role: allowing the animal to move to more favorable external conditions. Vertebrates move by the actions of muscles on bones. Tendons attach many skeletal muscles across joints, allowing muscle contraction to move the bones across the joint. Muscles generally work in pairs to produce movement: when one muscle flexes (or contracts) the other relaxes, a process known as antagonism."}, {"url": "http://www.alive.com/health/skeletal-and-muscular-system/", "passage_text": "Skeletal and Muscular System. The bones, joints and muscles work as a team to maintain our upright posture and allow ample movement. The circulatory system and organs, including the brain, are dependent upon movement for their resistance to disease. The adult skeletal system is made up of 206 bones, whereas babies have 350 bones in their body. As babies grow, their small bones fuse together to make larger bones. The skeletal system is incredibly strong, protecting the inner organs, and acting as a lever and attachment for the muscles. Bone is living tissue in continual renewal"}, {"url": "http://healthyliving.azcentral.com/skeletal-system-works-muscular-8158.html", "passage_text": "The human body is a complex network of symbiotic systems. The skeletal system and the muscular system work together as the framework for the body as well as providing the pieces that allow for movement. Muscular System. The muscular system is composed of more than 600 muscles. These include the involuntary muscles of the heart and the smooth muscles of the internal organs. The skeletal muscles connect to the bones and work with connective tissue at the joints to"}, {"url": "http://healthyliving.azcentral.com/skeletal-system-works-muscular-8158.html", "passage_text": "The bones provide a solid frame to support the body as well as protection for internal organs. The bones come together at joints which allow for movement of individual limbs as well as movement of the entire body in conjunction with skeletal tissue and the muscular system. Muscular System. The muscular system is composed of more than 600 muscles. These include the involuntary muscles of the heart and the smooth muscles of the internal organs. The skeletal muscles connect to the bones and work with connective tissue at the joints to allow for movement."}, {"url": "http://www.studymode.com/essays/Skeletal-And-Muscular-Systems-770669.html", "passage_text": "One body system often times cannot work without the help of another system. The best example of systems working together is the skeletal system and the muscular system. Muscles are attached to bones; the muscles make the bones move. Without bones there is nothing to hold together the structure of muscles. Without both of these systems working together our body would be impossible to move on its own. The skeletal system is the system in our body that provides protection of the vital organs and support for the muscles and skin. The skeletal system is the most important system in the body; it holds all of the other systems together. The functions of the skeletal system are, structure, movement, protection, blood cell production, and storage. The skeletal system protects all of our vital organ"}, {"url": "http://faculty.washington.edu/chudler/organ.html", "passage_text": "Muscles (smooth, skeletal and cardiac muscles). 1  Receptors in muscles provide the brain with information about body position and movement. 2  The brain controls the contraction of skeletal muscle. 3  The nervous system regulates the speed at which food moves through the digestive tract. "}]