[{"url": "http://users.rcn.com/jkimball.ma.ultranet/BiologyPages/S/Synapses.html", "passage_text": "The junction between the axon terminals of a neuron and the receiving cell is called a synapse. (Synapses at muscle fibers are also called neuromuscular junctions or myoneural junctions 1  .). Action potentials travel down the axon of the neuron to its end(s), the axon terminal(s). "}, {"url": "https://en.wikipedia.org/wiki/Motoneuron", "passage_text": "The interface between a motor neuron and muscle fiber is a specialized synapse called the neuromuscular junction. Upon adequate stimulation, the motor neuron releases a flood of neurotransmitters that bind to postsynaptic receptors and triggers a response in the muscle fiber which leads to muscle movement. "}, {"url": "http://www.answers.com/Q/The_junction_between_a_motor_neurons_axon_and_the_muscle_cell_membrane_is_called", "passage_text": "Acetylcholine released by the motor neuron at the neuromuscular junction changes the permeability of the cell membrane at the motor end plate. The permeability change allows t … he influx of positive charge, which triggers an action potential. "}, {"url": "http://www.mananatomy.com/basic-anatomy/neuromuscular-junction", "passage_text": "Neuromuscular junction can be defined as a synapse the motor neuron and the muscle fiber. Actually the synapse occurs between the “synaptic end bulbs” of the motor neuron and “motor end plate ” of muscle fiber. The motor end plate is in fact the highly excitable region of muscle fiber plasma membrane and it is responsible for initiating action potentials across the muscle surface. Synaptic cleft is the space between the motor end plate (muscle fiber part) and synaptic end bulb (motor neuron part) of the neuromuscular junction. It is 20 to 30 nanometers wide. Because of this cleft, the connection between the motor neuron and the muscle fiber is not continuous and there is a break"}, {"url": "http://www.ivyroses.com/HumanBody/Muscles/Muscle_Anatomy-Neuromuscular-Junction.php", "passage_text": "Each neuromuscular junction consists of the axon terminal of a motor neuron and the motor end plate of a muscle fibre. : 1  The long processes of neurones are called axons. : 2  The part of the sarcolemma of the muscle cell that is in closest proximity to the synaptic end bulb is called the  motor end plate . "}, {"url": "http://www.els.net/WileyCDA/ElsArticle/refId-a0023202.html", "passage_text": "The neuromuscular junction comprises four cell types: the motor neuron, terminal Schwann cell, skeletal muscle fibre and kranocyte, with the motor neuron and muscle fibre separated by a gap called the synaptic cleft. The somatic neuromuscular junction is the site of communication between motor neurons and skeletal muscle fibres. Specialisations of the neuromuscular junction mean that activity in and release of transmitter from motor neurons produces contraction of skeletal muscle fibres rapidly and reliably."}, {"url": "https://en.wikipedia.org/wiki/Neuromuscular_junction", "passage_text": "In vertebrates, motor neurons release acetylcholine (ACh), a small molecule neurotransmitter, which diffuses across the synaptic cleft and binds to nicotinic acetylcholine receptors (nAChRs) on the cell membrane of the muscle fiber, also known as the sarcolemma. It is at the neuromuscular junction that a motor neuron is able to transmit a signal to the muscle fiber, causing muscle contraction."}, {"url": "http://www.answers.com/Q/The_junction_between_a_motor_neurons_axon_and_the_muscle_cell_membrane_is_called_a_neuromuscular_junction_or_a", "passage_text": "The junction between a motor neruon's axon and the muscle cell membrane is called a neuromuscular junction or a myoneural junction? The action potential spreads across the entire surface of the muscle fiber and into the interior via T tubules. The cytoplasmic concentration of calcium ions (released from the sarcoplasmic reticulum) increases, triggering the start of a contraction."}, {"url": "https://en.wikipedia.org/wiki/Neuromuscular_junction", "passage_text": "A neuromuscular junction (sometimes called a myoneural junction) is a junction between nerve and muscle; it is a chemical synapse formed by the contact between the presynaptic terminal of a motor neuron and the postsynaptic membrane of a muscle fiber. It is at the neuromuscular junction that a motor neuron is able to transmit a signal to the muscle fiber, causing muscle contraction."}]