[{"url": "https://uk.answers.yahoo.com/question/index?qid=1006051015365", "passage_text": "Submit. · just now. Report Abuse. for an adult, an american passport is good for 10 years. If you are a teenager, I think it is good for less time (5 or 6 years) I think they do that because you can change alot from teenage years to adulthood or not. Maybe it's good ol' uncle Sam's way of squeezing more money out of us one way or another."}, {"url": "https://answers.yahoo.com/question/index?qid=20101008154548AAiSIPh", "passage_text": "Report Abuse. They are good for 10 years, and you have to renew them after that. Each renewal is good for 10 years from the new date of renewal. I had an expired passport, and when I renewed it in June 15, 2010, it is good until June 14, 2020. I will include a web site that will answer all your passport questions. Depends on the country, and how old you are when they're issued. British passports for under-16s last 5 years, 10 years for older people; German passports for under-25s last 6 years, 10 years for older people, etc. younosygit · 5 years ago. Thumbs up."}, {"url": "https://www.visahq.com/passport-faq.php", "passage_text": "1 A passport's validity is generally determined by the applicant's age. 2  In the US, passports issued for adults ages 16 and older are valid for 10 years. 3  Children 15 years of age and under receive passports valid for 5 years. "}, {"url": "http://www.ehow.com/about_4574515_long-passport-good-for_.html", "passage_text": "The length of validity for U.S. passports depends on the age of the passport holder when the passport was obtained and the type of passport issued. "}, {"url": "http://amsterdam.usconsulate.gov/visa_validity3.html", "passage_text": "However, the passport must still be valid for the length of the proposed trip. Thus, if planning a two month stay, the passport presented at the airport must be valid for at least that two month period, but does not have to be still valid for six months. If you are traveling visa free and your passport is valid for less than 90 days, you will be admitted only until the date the passport expires."}, {"url": "http://visacentral.com/passport-faqs", "passage_text": "If your US passport was issued when you were 16 years old or older, your passport is valid for 10 years. If your US passport was issued when you were 15 years old or younger, your passport is valid for 5 years. I need to visit a Passport Acceptance Facility before I can submit my application to VisaCentral. If your passport expires sooner than that, you must apply to renew your passport. Please view the Visas section to determine how long a passport must be valid for each specific country of travel. In the event that your passport is set to expire, VisaCentral can assist you. Please visit Renew Passport for details."}, {"url": "http://visacentral.com/passport-faqs", "passage_text": "A passport submission appointment is required for all passport services. If you need a service in less than 3 weeks, you must call the VisaCentral Customer Care Center at 877-535-0688 to schedule your appointment with a VisaCentral Visa and Passport Specialist. If your passport expires sooner than that, you must apply to renew your passport. Please view the Visas section to determine how long a passport must be valid for each specific country of travel. In the event that your passport is set to expire, VisaCentral can assist you. Please visit Renew Passport for details."}, {"url": "http://traveltips.usatoday.com/long-passport-cards-last-109993.html", "passage_text": "Like passport books, adult passport cards remain valid for 10 years from the date of issue. The date your passport card was issued is printed on the front of the card along with the expiry date, making it easy to check how much validity is left. Children’s passport cards are only valid for five years. Introduced in 2008, passport cards are a State Department initiative aimed at providing a cheaper and more convenient alternative to the traditional passport book for people who make frequent international border crossings to and from the United States by land or sea."}]