[{"url": "http://1214.virtualclassroom.org/desert_flora.html", "passage_text": "Fauna-This region is rich in diversified flora and fauna. Several endemic snakes and lizards are found here. Animals such as the Blackbuck, the Indian Gazelle and the Indian Wild Ass, which are fast declining in other areas, are found in this desert. Camels are one of the most popular means of transport. "}, {"url": "http://www.ucmp.berkeley.edu/glossary/gloss5/biome/deserts.html", "passage_text": "Although most deserts, such as the Sahara of North Africa and the deserts of the southwestern U.S., Mexico, and Australia, occur at low latitudes, another kind of desert, cold deserts, occur in the basin and range area of Utah and Nevada and in parts of western Asia. The plants living in this type of desert include the salt bush, buckwheat bush, black bush, rice grass, little leaf horsebrush, black sage, and chrysothamnus. Some animals have specialized adaptations for dealing with the desert heat and lack of water."}, {"url": "http://www.desertanimals.net/", "passage_text": "Areas in Antarctica are examples of cold deserts.The animals that live in the desert usually have special adaptations that allow them to survive the extreme temperatures and conditions that are present in a desert. A good example of an animal with special adaptations is the camel. A camel can drink very large amounts of water in one day or survive for a relatively long time without drinking any water.Some animals of the desert are also endangered, including the Lappet-Faced Vulture, which is categorized as vulnerable."}, {"url": "http://www.defenders.org/desert/plants-and-animals", "passage_text": "Most desert species have found remarkable ways to survive by evading drought. Desert succulents, such as cacti or rock plants (Lithops) for example, survive dry spells by accumulating moisture in their fleshy tissues. "}, {"url": "http://www.desertanimals.net/", "passage_text": "DesertAnimals.net, a website in The Animal Spot, is a reference to some of the animals that can be found in the desert. A desert is defined as a region that receives very little rainfall. It can be hot or cold. There are various types of deserts all around the world, from the harsh elements of the Sahara desert in Africa to the 4 deserts of the Southwestern United States. A camel can drink very large amounts of water in one day or survive for a relatively long time without drinking any water.Some animals of the desert are also endangered, including the Lappet-Faced Vulture, which is categorized as vulnerable."}, {"url": "http://www.desertusa.com/animals.html", "passage_text": "How do animals survive in the desert? Learn about mammals, reptiles, birds, fish and amphibians that have adapted to the harsh desert ecosystems. Below is a list of animals that live in the desert with links to additional information on each animal. Learn how they survive in the desert biome. Desert Animal Survival: How animals adapt to the desert. Classification: How desert plants and animals are classified. "}, {"url": "http://www.skyenimals.com/browse_habitat.cgi?habitat=desert", "passage_text": "Desert Deserts are dry. Deserts are extreme. True deserts get less than 6 inches of rain per year. There are also semideserts, which are desert like, but get more rain (up to 16 inches per year). True deserts have very few plants. Semidesert habitats have enough rainfall to support more plant and animal life. Deserts (especially true deserts) are not easy places for animals to live. Animals who live in them often have special features that help them survive"}, {"url": "http://www.bioexpedition.com/desert-biome/", "passage_text": "The desert biome is one that is very hot and dry. They are found at the lower latitudes, between the Tropic of Cancer and the Tropic of Capricorn. Light winds occur often which evaporates any type of moisture that is typically going to develop in them. The heat is very dry and that makes it hard for too many types of plants or animals to be able to survive in such biomes. Approximately 20% of the Earth falls into this category. Some of the desert biomes are extremely large. For example the Sahara desert in Africa is more than 3.5 million square miles in size."}]