[{"url": "http://www.answers.com/Q/How_many_eggs_can_a_turkey_lay", "passage_text": "Confidence votes 236. Turkeys lay from early spring to early summer, a span of about 4 months. During that time the turkey will lay 12-18 eggs and then sit on them. If you collect their eggs they will continue to lay, eventually producing an average of 1 egg every 2 days for a possible total of 80-100 eggs."}, {"url": "https://answers.yahoo.com/question/index?qid=20061114042944AAbqerh", "passage_text": "Best Answer: Barnyard economics, babe. Turkeys don't lay that many eggs, and the ones they do lay are used to produce more turkeys. The average egg-laying chicken lays 300 or so eggs per year, while the average turkey produces only 100 to 120. Chickens come into production at 19 to 20 weeks of age, but turkeys don't get cranking until 32 weeks."}, {"url": "https://answers.yahoo.com/question/index?qid=20061114042944AAbqerh", "passage_text": "Why there not in the stores is because..Barnyard economics, Turkeys don't lay that many eggs, and the ones they do lay are used to produce more turkeys. The average egg-laying chicken lays 300 or so eggs per year, while the average turkey produces only 100 to 120. Chickens come into production at 19 to 20 weeks of age, but turkeys don't get cranking until 32 weeks."}, {"url": "http://www.answers.com/Q/How_many_eggs_can_a_turkey_lay", "passage_text": "Roughly 1000 eggs The average turkey will lay between 100 and 120 eggs per year and can produce eggs for up to 10 years if well cared for. Production of eggs drops as … the turkey ages. 8 people found this useful. Andrew Larson."}, {"url": "http://www.backyardchickens.com/t/349321/how-often-do-turkeys-lay-eggs-what-to-do-with-the-eggs", "passage_text": "average of 1 every other day, younger hens often will lay a spert of 1 a day for a few days in a row, at least mine do, after the first year, they all tend to be 1 every other day, except royal palms, those things are egg making machines. I sell or hatch all of mine and sell them as day old poults."}, {"url": "http://www.answers.com/Q/How_many_eggs_can_a_turkey_lay", "passage_text": "The average turkey will lay 110 to 115 eggs in a 28/30 week period.   The gobbler's sperm is stored in the hen's oviduct, so that fertilized eggs may be laid up to fo … ur weeks after mating. One mating is usually sufficient to fertilize an entire clutch."}]