[{"url": "http://opositiveblood.com/positive_vs_negative/positive_vs_negative.html", "passage_text": "The person with Type O negative blood is in somewhat of a tough spot as only about 6% of the population has that type, and it is the only blood type that person can safely accept. If you have Type O positive blood, your body will accept both O positive and O negative blood, but none of the other types."}, {"url": "http://www.redcrossblood.org/learn-about-blood/blood-types", "passage_text": "In addition to the A and B antigens, there is a third antigen called the Rh factor, which can be either present (+) or absent (–). In general, Rh negative blood is given to Rh-negative patients, and Rh positive blood or Rh negative blood may be given to Rh positive patients. 1  The universal red cell donor has Type O negative blood type. 2  The universal plasma donor has Type AB"}, {"url": "http://www.wikihow.com/Determine-Positive-and-Negative-Blood-Types", "passage_text": "There are two major ways of distinguishing between blood types. The first is the ABO blood system, where the blood type is defined as either A, B, AB or O. The second is the Rhesus (Rh) blood group system, which determines whether a blood type is negative or positive."}, {"url": "http://healthquestions.medhelp.org/what-makes-blood-positive-or-negative", "passage_text": "You are referring to the RH factor which makes the blood type positive or negative. I'm not sure of the order if the mom's negative and the baby's positive blood type that could lead to issues. I think it's the mom being negative. So if thisi s the situation for you, they give you a shot of Rhogam and you're fine."}, {"url": "http://www.wikihow.com/Determine-Positive-and-Negative-Blood-Types", "passage_text": "1 If your parents are both negative, then you are Rh 2  (-). If your parents are both positive or if one of your parents is positive and the other is negative, you can get a blood test and look for the Rhesus factor to know if your blood type is (+) or (-)."}, {"url": "http://www.wikihow.com/Determine-Positive-and-Negative-Blood-Types", "passage_text": "Ask your doctor for a blood typing test. If your parents have different blood types, or their blood type is unknown, you can ask your doctor to perform a simple blood typing test to find out whether your blood is positive or negative."}, {"url": "http://www.answers.com/Q/What_makes_your_blood_positive_or_negative", "passage_text": "Rh factor is a phenotype similar to the blood type. Positive is dominant and so the possible genotypes are ++ or +-, whereas for negative it can only be --. If the parent … s are both +- they can produce ++, +-, or --. There is a 25% chance that these parents would have an O-child."}, {"url": "http://learn.genetics.utah.edu/content/inheritance/blood/", "passage_text": "Each blood type is either positive + (has the Rh protein) or negative - (no Rh protein). For example, a person whose blood type is A positive (A +), has both type A and Rh proteins on the surface of their red blood cells."}]