[{"url": "http://www.definitions.net/definition/stout", "passage_text": "Stout. Stout is a dark beer made using roasted malt or roasted barley, hops, water and yeast. Stouts were traditionally the generic term for the strongest or stoutest porters, typically 7% or 8%, produced by a brewery. In this sense a stout is not necessarily dark in color because there are also blonde stouts. Princeton's WordNet (0.00 / 0 votes) Rate this definition: stout (noun). a strong very dark heavy-bodied ale made from pale malt and roasted unmalted barley and (often) caramel malt with hops. stout (adj). a garment size for a large or heavy person. stalwart, stout (adj). dependable"}, {"url": "https://en.wikipedia.org/wiki/Stout", "passage_text": "Imperial stout, also known as Russian imperial stout or imperial Russian stout, is a strong dark beer or stout in the style that was brewed in the 18th century by Thrale's brewery in London, England for export to the court of Catherine II of Russia. Milk stout (also called sweet stout or cream stout) is a stout containing lactose, a sugar derived from milk. Because lactose is unfermentable by beer yeast, it adds sweetness, body, and calories to the finished beer."}, {"url": "https://en.wikipedia.org/wiki/Stout", "passage_text": "Stout is a dark beer made using roasted malt or roasted barley, hops, water and yeast. Milk stout (also called sweet stout or cream stout) is a stout containing lactose, a sugar derived from milk. Because lactose is unfermentable by beer yeast, it adds sweetness, body, and calories to the finished beer."}, {"url": "http://www.thefreedictionary.com/stout", "passage_text": "1. stout-a strong very dark heavy-bodied ale made from pale malt and roasted unmalted barley and (often) caramel malt with hops. ale-a general name for beer made with a top fermenting yeast; in some of the United States an ale is (by law) a brew of more than 4% alcohol by volume. Guinness-a kind of bitter stout. "}, {"url": "http://www.thefreedictionary.com/Stout+beer", "passage_text": "Noun. 1. stout-a strong very dark heavy-bodied ale made from pale malt and roasted unmalted barley and (often) caramel malt with hops. ale-a general name for beer made with a top fermenting yeast; in some of the United States an ale is (by law) a brew of more than 4% alcohol by volume. Guinness-a kind of bitter stout. "}, {"url": "http://www.audioenglish.org/dictionary/stout.htm", "passage_text": "• STOUT (noun). The noun STOUT has 2 senses: 1. a strong very dark heavy-bodied ale made from pale malt and roasted unmalted barley and (often) caramel malt with hops. 2. a garment size for a large or heavy person. Familiarity information: STOUT used as a noun is rare. • STOUT (adjective). Nouns denoting foods and drinks. Hypernyms (stout is a kind of...): ale (a general name for beer made with a top fermenting yeast; in some of the United States an ale is (by law) a brew of more than 4% alcohol by volume)."}, {"url": "https://en.wikipedia.org/wiki/Porter_(beer)", "passage_text": "Porter is a dark style of beer developed in London from well-hopped beers made from brown malt. The name was first recorded in the 18th century, and is thought to come from its popularity with street and river porters. The history and development of stout and porter are intertwined. The name stout as used for a dark beer is believed to have come about because strong porters were marketed under such names as Extra Porter, Double Porter, and Stout Porter. The term Stout Porter would later be shortened to just Stout."}, {"url": "http://mendobrew.com/blog/43_what-does-stout-really-mean/", "passage_text": "It seems that Stout is a dark beer and generic term for the Strongest or “Stoutest” Porters, typically 7% to 8%, so basically a strong Porter. Porter was first recorded as being brewed and consumed in London in the 1730s. "}, {"url": "http://www.wisegeek.org/what-is-a-stout-beer.htm", "passage_text": "A stout beer is a dark, sometimes bitter beer that was first commercially produced in the 1730s. The first versions of this drink were from Ireland, where the still most popular stout is produced by Guinness. Yet Guinness is only one of the many companies that produce and market stouts. Irish stout is the most well known types of this beer, with Guinness being its primary manufacturer. This type of drink is also called a dry stout. Though Guinness is very popular worldwide, many prefer Murphy’s, particularly in Ireland, because Catholics initially ran the company."}]