[{"url": "http://www.answers.com/Q/How_long_is_a_narwhal_horn", "passage_text": "The narwhal, a whale with a long, twisted tooth, swims in Arctic waters. Narwhals can grow to be about 16 feet (4.5 m) long   A narwhal's body is about 4 to 6 metres, and the narwhal tusk extends another 2 to 3 metres."}, {"url": "http://www.worldwildlife.org/stories/unicorn-of-the-sea-narwhal-facts", "passage_text": "Often dubbed the unicorns of the sea, narwhals are strange and beautiful creatures with long tusks protruding from their heads. Members of the population of more than 80,000 can weigh up to 4,200 pounds and grow as long as 17 feet in length. Check out some common questions about these near-threatened whales. 1."}, {"url": "http://www.animalfactguide.com/animal-facts/narwhal/", "passage_text": "At birth, narwhals are approximately 1.5 m (5 ft.) in length. At maturity, which is between 6 and 9 years, females grow to about 3.5 m (11.5 ft.) in length, and weigh around 1,000 kg (2,200 lb.). Males reach between 4 and 6 m (13 and 20 ft.) and can weigh 1,600 kg (3,500 lb.)."}, {"url": "http://animals.nationalgeographic.com/animals/mammals/narwhal/", "passage_text": "The narwhal is the unicorn of the sea, a pale-colored porpoise found in Arctic coastal waters and rivers. These legendary animals have two teeth. In males, the more prominent tooth grows into a swordlike, spiral tusk up to 8.8 feet (2.7 meters) long."}, {"url": "http://www.answers.com/Q/How_long_is_a_narwhal_horn", "passage_text": "The horn is actually not a horn at all. Narwhals have two teeth in the upper jaw. After the first year of a male narwhal's life, its left tooth grows outward, spirally. This long, single tooth projects from its upper jaw and grows to be 7-10 feet long."}, {"url": "http://animals.nationalgeographic.com/animals/mammals/narwhal/", "passage_text": "Narwhal. Monodon monoceros. A newborn narwhal calf is about 5 feet (1.5 meters) long and can weigh 175 to 220 pounds (79 to 100 kilograms). Narwhals are normally found in pods of two to ten."}]