[{"url": "http://www.disabilitysecrets.com/page4-44.html", "passage_text": "Everyone on SSI disability (Supplemental Security Income) is eligible for the same base amount, $733. But your actual monthly SSI payment will depend on whether you have any countable income, whether you are married, and what state you live in. For starters, the federal benefit rate for couples is of $1,100, which you'll get if you are married and your spouse is eligible for SSI benefits as well. In addition, the federal rate amount regularly changes with cost of living increases."}, {"url": "http://www.alllaw.com/articles/nolo/disability/collecting-payments.html", "passage_text": "How much your monthly disability check will be depends on whether you'll receive Social Security Disability (SSD) or Supplemental Security Income (SSI). SSD is for workers who are insured under the Social Security retirement system. Or you can call or visit your local Social Security office to ask for help. Social Security applies a formula to your average lifetime earnings to calculate the amount of your monthly check. The average SSD payment is currently $1,165. The highest dollar amount you can receive from SSD monthly in 2015 is $2,663."}, {"url": "http://www.disabilitysecrets.com/how-much-in-ssd.html", "passage_text": "The amount of money you will receive from Social Security on a monthly basis is unique for every individual. This is due to the fact that the Social Security Administration (SSA) uses a complex weighted formula in order to calculate benefits for each person, up to the maximum benefit of $2,663 (in 2015). It is not based on how severe your disability is or how much income you have. Most SSDI recipients receive between $700 and $1,700 per month (the average for 2015 is $1,165)."}, {"url": "http://www.disabilitysecrets.com/how-much-in-ssd.html", "passage_text": "Share on Google Plus. If you are eligible for Social Security Disability Insurance (SSDI, or sometimes just SSD) benefits, the amount you receive each month will be based on your average lifetime earnings before your disability began. It is not based on how severe your disability is or how much income you have. Most SSDI recipients receive between $700 and $1,700 per month (the average for 2015 is $1,165). However, if you are receiving disability payments from other sources, as discussed below, your payment may be reduced"}, {"url": "http://www.alllaw.com/articles/nolo/disability/collecting-payments.html", "passage_text": "SSI. The SSI program currently pays a maximum benefit of $733 a month if you are single or $1,100 a month for a couple. This is the total amount you are eligible to receive, but it will be reduced by certain other benefits or income you may receive. Or you can call or visit your local Social Security office to ask for help. Social Security applies a formula to your average lifetime earnings to calculate the amount of your monthly check. The average SSD payment is currently $1,165. The highest dollar amount you can receive from SSD monthly in 2015 is $2,663."}, {"url": "http://www.nolo.com/legal-encyclopedia/how-much-can-you-work-while-receiving-ssi-disability-benefits.html", "passage_text": "For example, if you make $1,465 per month, the SSA will subtract $65 (to get $1,400) and then half of the amount over $65 (to get $700). That $700 is your countable income from work, and it will be subtracted from your monthly SSI payment (which is $733 without a state supplement). The Social Security Administration (SSA) defines a substantial amount of work, which it calls substantial gainful activity (SGA), as earning $1,090 a month from working (in 2015). Therefore, if you are earning this much from work when you apply for benefits, you will be denied."}, {"url": "http://www.ssdrc.com/14-3.html", "passage_text": "Social Security establishes a new maximum SSI monthly benefit amount each year. However, an individual may or may not receive the maximum amount of their SSI disability benefit. In 2011, that maximum was $674. For 2014, the maximum is $721. If an individual shows that they are paying their share of the household bills, they will receive the maximum SSI disability amount. "}, {"url": "http://www.nolo.com/legal-encyclopedia/how-much-social-security-disability-ssdi-benefits-can-you-get.html", "passage_text": "How much your Social Security disability benefit will be is based on your covered earnings -- the wages that you paid Social Security taxes on -- prior to becoming disabled. (Social Security Disability Insurance (SSDI) is the federal insurance program that provides benefits to qualified workers who can no longer work. To give you an idea of what you might receive, for 2015, the average SSDI benefit amount is $1,165 per month, but you can receive anywhere up to $2,663. If you're interested in how Social Security calculates your AIME and PIA, here's how"}]