[{"url": "http://blog.taxact.com/owe-money-to-the-irs-steps-to-pay-off-your-tax-bill/", "passage_text": "File Form 9465, Installment Agreement Request, to set up installment payments with the IRS. The IRS must allow you to make payments on your overdue taxes if you owe $25,000 or less, you can show that you cannot pay the amount you owe now, you can pay off the tax in three years or less."}, {"url": "https://www.irs.gov/payments", "passage_text": "You should refer to the notice you received for your latest balance due or have it handy and call our toll-free automated phone service for your current payoff amount. If you don’t have your notice, you can call 1-800-829-1040 to find out"}, {"url": "https://turbotax.intuit.com/tax-tools/tax-tips/IRS-Tax-Return/What-Is-the-Minimum-Monthly-Payment-for-an-IRS-Installment-Plan-/INF23284.html", "passage_text": "Balance between $10,000 and $25,000. With a balance due above $10,000, you can qualify for a streamlined installment plan. While acceptance isn't guaranteed, the IRS doesn't usually require additional financial information to approve these plans. With a streamlined plan, you have 72 months to pay."}, {"url": "https://turbotax.intuit.com/tax-tools/tax-tips/IRS-Tax-Return/What-Is-the-Minimum-Monthly-Payment-for-an-IRS-Installment-Plan-/INF23284.html", "passage_text": "If you can pay off your balance within 120 days, it won't cost you anything to set up an installment plan. Otherwise, you'll owe $52 for setting up a direct debit agreement with the IRS, or $105 for a standard or payroll deduction agreement. If you're a lower-income taxpayer, you may be able to reduce the fee to $43."}, {"url": "http://www.nolo.com/legal-encyclopedia/irs-installment-payment-plans-29563.html", "passage_text": "Negotiating a Monthly Payment. If you owe more than $50,000 or can't pay the amount you owe in six years or less, your request for an IA begins with an IRS collector's analyzing your Collection Information Statement on Form 433-A. The collector uses the information on the form to determine the amount you can pay."}, {"url": "http://www.bankrate.com/finance/taxes/big-tax-bill-irs-offers-payment-options-1.aspx", "passage_text": "Or, if the total amount you owe is not more than $50,000, you can ignore Form 9465 and request an installment agreement online at the IRS website. Financially strapped taxpayers also can use an installment plan to make partial payments of tax liability."}]