[{"url": "https://en.wikipedia.org/wiki/Schadenfreude", "passage_text": "Though normally not capitalized in English, the term schadenfreude is sometimes capitalized to mimic German-language convention, as German nouns are always capitalized. The corresponding German adjective is schadenfroh. The term  compersion , taking joy in the joy of loved ones, is generally considered an antonym of schadenfreude. In Chinese, the phrase 幸灾乐祸 literally translates to take joy in calamity and delight in disaster, and serves the same meaning as"}, {"url": "http://www.oxforddictionaries.com/definition/english/schadenfreude", "passage_text": "1 All this is a bonus for the former BBC royal correspondent, who admits to a frisson of Schadenfreude when watching her replacement shiver outside those crested gates. 2  With a quiver of delightful Schadenfreude, it turned out none had ever backed the PR firm's campaign. 1 With a quiver of delightful Schadenfreude, it turned out none had ever backed the PR firm's campaign. 2  This unremitting focus on just one race participant is understandable, but the hint of Schadenfreude in the tone was unmistakable."}, {"url": "http://www.thefreedictionary.com/schadenfreude", "passage_text": "Noun. 1. Schadenfreude-delight in another person's misfortune. delectation, delight-a feeling of extreme pleasure or satisfaction; his delight to see her was obvious to all. "}, {"url": "http://www.definitions.net/definition/schadenfreude", "passage_text": "Schadenfreude. Schadenfreude is pleasure derived from the misfortunes of others. This word is a loanword from German, the direct English translation is 'Damage-Joy' or 'Fail-Joy', it is the feeling of joy when one sees another fail, and is also borrowed in some other languages."}, {"url": "https://en.wikipedia.org/wiki/Schadenfreude", "passage_text": "Schadenfreude (/ˈʃɑːdənfrɔɪdᵊ/ ; [ˈʃaːdn̩ˌfʁɔʏdə]. ), also known as epicaricacy /ˌɛpɨˈkaerɨkəsi/ ˌɛpɨˈkærɨkəsi is pleasure derived from the misfortunes of. Others this word is taken From german and literally means-harm. Joy it is the feeling of joy or pleasure when one sees another fail or suffer. misfortune The term  compersion , taking joy in the joy of loved ones, is generally considered an antonym of schadenfreude. In Chinese, the phrase 幸灾乐祸 literally translates to take joy in calamity and delight in disaster, and serves the same meaning as"}, {"url": "http://www.merriam-webster.com/dictionary/schadenfreude", "passage_text": "Full Definition of SCHADENFREUDE. : enjoyment obtained from the troubles of others. See schadenfreude defined for English-language learners. ADVERTISEMENT. "}, {"url": "http://www.oxforddictionaries.com/definition/english/schadenfreude", "passage_text": "Pleasure derived by someone from another person’s misfortune: a business that thrives on Schadenfreude a frisson of Schadenfreude. More example sentences. 1  All this is a bonus for the former BBC royal correspondent, who admits to a frisson of Schadenfreude when watching her replacement shiver outside those crested gates. 1 With a quiver of delightful Schadenfreude, it turned out none had ever backed the PR firm's campaign. 2  This unremitting focus on just one race participant is understandable, but the hint of Schadenfreude in the tone was unmistakable."}, {"url": "http://www.macmillandictionary.com/dictionary/british/schadenfreude", "passage_text": "Explore Thesaurus. Cultural note: schadenfreude. Schadenfreude comes from the German words Schaden, which means ‘harm’, and Freude, which means ‘joy’. Schadenfreude comes from the German words Schaden, which means ‘harm’, and Freude, which means ‘joy’. This is the British English definition of schadenfreude. View American English definition of schadenfreude. Change your default dictionary to American English. View the pronunciation for schadenfreude. "}, {"url": "https://en.wikipedia.org/wiki/Schadenfreude", "passage_text": "Schadenfreude (/ˈʃɑːdənfrɔɪdᵊ/ ; [ˈʃaːdn̩ˌfʁɔʏdə]. ), also known as epicaricacy /ˌɛpɨˈkaerɨkəsi/ ˌɛpɨˈkærɨkəsi is pleasure derived from the misfortunes of. Others this word is taken From german and literally means-harm. joy The term  compersion , taking joy in the joy of loved ones, is generally considered an antonym of schadenfreude. In Chinese, the phrase 幸灾乐祸 literally translates to take joy in calamity and delight in disaster, and serves the same meaning as"}, {"url": "http://www.thefreedictionary.com/Schadenfruede", "passage_text": "Noun. 1. Schadenfreude-delight in another person's misfortune. delectation, delight-a feeling of extreme pleasure or satisfaction; his delight to see her was obvious to all. "}]