[{"url": "http://www.studymode.com/essays/General-Strain-Theory-595940.html", "passage_text": "Robert Agnew is a criminologist who discovered The General strain theory. The general strain theory of crime states strain or stress is a major source or criminal motivation."}, {"url": "http://scump.weebly.com/uploads/5/0/5/0/5050126/robert_agnews_strain_theory.doc", "passage_text": "Strain theory is one such theory that has been pushed aside; however, this theory has been given new life by recent developments in criminology. Robert Agnew developed a new theory, which he named the general strain theory, thus introducing a new perspective on a theory that was written off a few decades ago."}, {"url": "http://scump.weebly.com/uploads/5/0/5/0/5050126/robert_agnews_strain_theory.doc", "passage_text": "General strain theory has defined measurements of strain, the major types of strain, the links between strain and crime, coping strategies to strain, the determinants of delinquent or nondelinquent behavior, and policy recommendations that are based on this theory."}, {"url": "http://scump.weebly.com/uploads/5/0/5/0/5050126/robert_agnews_strain_theory.doc", "passage_text": "Robert Agnew’s General Strain Theory. Criminology is a study that is constantly changing based on the political, economic and spiritual concerns of the society. Many theories come to light and then fade away as the societal climate changes."}, {"url": "https://en.wikipedia.org/wiki/General_Strain_Theory", "passage_text": "General strain theory is a theory of criminology developed by Robert Agnew. Robert Agnew's General Strain Theory is considered to be a solid theory, and has accumulated a significant amount of empirical evidence, and has also expanded its primary scope by offering explanations of phenomena outside of criminal behavior."}, {"url": "http://www.123helpme.com/search.asp?text=strain+theory", "passage_text": "Strain Theory-Robert Agnew is known for his general strain theory. The theory explains that the basis of people getting involved in criminal activity is because of strain. If someone becomes upset, frustrated, depressed, or mistreated they will turn to crime in order to deal with the feelings."}, {"url": "http://onlinelibrary.wiley.com/doi/10.1111/j.1745-9125.1992.tb01093.x/abstract", "passage_text": "Get PDF (2242K) Get PDF (2242K). This paper presents a general strain theory of crime and delinquency that is capable of overcoming the criticisms of previous strain theories. In the first section, strain theory is distinguished from social control and differential association/social learning theory."}]