[{"url": "http://auto.howstuffworks.com/fuel-efficiency/fuel-saving-devices/fuel-additive-effectiveness2.htm", "passage_text": "If you own a high octane sports car and are contemplating using the low octane gas and adding octane booster to compensate, you really need to think if that will be a worthwhile decision. "}, {"url": "https://www.reddit.com/r/cars/comments/26bdbr/stupid_question_i_accidently_put_unleaded_gas_in/", "passage_text": "Your car will be fine. You can either add some octane booster or run it to half empty and fill up with premium to make midgrade fuel. That's literally how the pump does it, it does half premium and have regular. Or just run it to empty and fill back up with premium, no harm no foul. You car just won't be as efficient. When a fuel/air mixture is compressed enough it will self ignite. Higher octane gas is used in higher compression engines to prevent pre-ignition or detonation. Using a higher octane gas in an engine that is designed for a lower octane will not hurt anything."}, {"url": "https://answers.yahoo.com/question/index?qid=20110303231535AAiV8Ju", "passage_text": "Report Abuse. Octane booster doesn't actually add that much octane to 87 because points mean different things to different people. If it markets it as raising it 5 points...that makes your octane actually 87.5 not 92. Boom...you just got ripped off. They don't sell an octane booster that raises the octane 50 points which would actually raise octane to a premium fuel level. I think you might've failed at the math unless you're filling up a tank. Average gas tank=12 gallons= an extra 2 bucks."}, {"url": "http://www.fueleconomy.gov/feg/octane.shtml", "passage_text": "If your vehicle requires midgrade or premium fuel, absolutely. If your owner's manual says your vehicle doesn't require premium but says that your vehicle will run better on higher octane fuel, it's really up to you. The cost increase is typically higher than the fuel savings. Using a lower octane fuel than required can cause the engine to run poorly and can damage the engine and emissions control system over time. It may also void your warranty. In older vehicles, the engine can make an audible knocking or pinging sound"}, {"url": "http://www.fueleconomy.gov/feg/octane.shtml", "passage_text": "In the U.S., unleaded gasoline typically has octane ratings of 87 (regular), 88–90 (midgrade), and 91–94 (premium). Gasoline with an octane rating of 85 is available in some high-elevation areas of the U.S. (more about that below). Using a lower octane fuel than required can cause the engine to run poorly and can damage the engine and emissions control system over time. It may also void your warranty. In older vehicles, the engine can make an audible knocking or pinging sound"}, {"url": "http://www.cartalk.com/content/premium-vs-regular-1", "passage_text": "That's good news. That means you can use gas with a lower octane rating. And, if your engine detects a knock or ping, it can usually adjust the timing of the spark until the knocking is gone. A. In that case, the answer isn't quite so clear. In a high-compression engine that's designed to run on premium fuel, premium will provide some additional power. But, if you want to save some money, you can probably still fill up with regular, unleaded fuel much of the time."}, {"url": "http://www.edmunds.com/fuel-economy/to-save-money-on-gas-stop-buying-premium.html", "passage_text": "If you're still in doubt about switching to a lower-octane fuel, here's a deeper explanation of why the change is unlikely to hurt your car. First of all, premium gas is more expensive because it contains a higher percentage of octane. That's the drill for a premium-recommended car. You can stay with premium, or step down to regular unleaded if you want to. It's a different story for a car whose engine requires premium fuel. The car will still run on regular fuel in a pinch, but you shouldn't make a habit out of it."}]