[{"url": "http://www.ehow.com/about_5533552_can-wine-cause-heart-palpitations.html", "passage_text": "When evaluating heart palpitations that you suspect may be caused by wine, it's important to understand and weigh three factors: what a palpitation is, when cardiac arrhythmia is dangerous, and when the heart-healthy benefits of wine consumption may outweigh temporary, benign palpitations. Other People Are Reading."}, {"url": "http://www.medhelp.org/posts/Heart-Rhythm/Heart-palpitations-after-one-glass-of-wine/show/1454511", "passage_text": "I've noticed that after just one glass of wine, a few hours later, i get heart palpitations that last for a while. It doesn't feel irregular, just a constant thumping. I do notice that if I drink some water, it helps."}, {"url": "http://www.nomorepanic.co.uk/showthread.php?t=42589", "passage_text": "You just have to understand what the alcohol does to you. If you can accept that, then you will eventually not pay any attention to the palpitations. I can now have a glass or 2 of wine without having any palpitations, as long as I don't think about them."}, {"url": "http://www.ehow.co.uk/about_5533552_can-wine-cause-heart-palpitations.html", "passage_text": "When evaluating heart palpitations that you suspect may be caused by wine, it's important to understand and weigh three factors: what a palpitation is, when cardiac arrhythmia is dangerous, and when the heart-healthy benefits of wine consumption may outweigh temporary, benign palpitations. Other People Are Reading."}, {"url": "http://www.calmclinic.com/panic/causes/alcohol", "passage_text": "1 Dizziness and Rapid Heartbeat While drinking (and sometimes after drinking), alcohol can cause sensations of dizziness, rapid heartbeat, heart palpitations, and other symptoms that are known to trigger panic attacks, especially in those with health anxiety."}, {"url": "http://www.ehow.com/about_5533552_can-wine-cause-heart-palpitations.html", "passage_text": "More Serious Effects. Wine can cause a more serious phenomenon in the heart than simple palpitations, so it's important to report any feelings of cardiac arrhythmia to your doctor and be honest about alcohol consumption. When you drink a greater volume of alcohol than normal, you can precipitate a condition called atrial fibrillation."}, {"url": "http://www.nomorepanic.co.uk/showthread.php?t=42589", "passage_text": "I find these days that if I have alcohol in the evening that I wake up in the middle of the night with a fast heartbeat and palpitations. My heartrate is about 86bpm right now, not massively fast but fast for the middle of the night when it should be relaxed and slow."}]