[{"url": "http://finance.zacks.com/soon-after-file-irs-chooses-audit-9846.html", "passage_text": "According to the IRS, the agency attempts to audit tax returns as soon as possible after they are filed. Traditionally, most audits take place within two years of filing. For example, if you get an audit notice in 2014, it will most likely be for a tax return submitted in 2012 or 2013. The IRS reserves the right to go back as far as six years and audit a return, particularly if the agency has reason to believe a significant error has taken place. If you receive a notice of an audit, comply with the request as soon as possible by providing necessary materials to answer the audit’s inquiry. If you are concerned about the process, contact a tax law professional for advice on how to proceed."}, {"url": "http://finance.zacks.com/soon-after-file-irs-chooses-audit-9846.html", "passage_text": "If your tax return is selected for an audit, you will be notified by the IRS by mail. The IRS does not place phone calls or send e-mails to notify the taxpayer of an audit review. If you receive a notice of an audit, comply with the request as soon as possible by providing necessary materials to answer the audit’s inquiry. If you are concerned about the process, contact a tax law professional for advice on how to proceed."}, {"url": "http://irsmind.blogspot.com/2008/03/how-long-can-irs-audit-my-tax-return.html", "passage_text": "1 Last day for the IRS to assess additional tax: April 15, 2011. 2  If you have omitted more than 25% of your income: April 15, 2014. 3  If your return is fraudulent: there is no ASED. The real question is what is the assessment statute expiration date or ASED. First, if you file your tax return on or before April 15th, the IRS has three years (normally) from April 15th to audit you."}, {"url": "http://www.ehow.com/info_7942857_soon-file-irs-chooses-audit.html", "passage_text": "Audit Time Limitation. Most taxpayers who file a complete and accurate tax return before the filing deadline can be audited by the IRS within three years of the filing deadline. For example, even if you file your tax return before the April 15 deadline, the three-year period doesn't begin until April 15. In the unlikely event you are chosen for an audit and the IRS increases the amount of tax you owe, you may be responsible for interest and penalties on that amount. For example, if the increase in tax is due to a negligent mistake you make, then the IRS will charge you 5 percent of the underpayment as a penalty."}, {"url": "http://irsmind.blogspot.com/2008/03/how-long-can-irs-audit-my-tax-return.html", "passage_text": "An example of a normal ASED is: 2007 return filed on March 10, 2008. 1  Last day for the IRS to assess additional tax: April 15, 2011. 2  If you have omitted more than 25% of your income: April 15, 2014. The real question is what is the assessment statute expiration date or ASED. First, if you file your tax return on or before April 15th, the IRS has three years (normally) from April 15th to audit you."}, {"url": "http://www.taxdebthelp.com/tax-problems/tax-audit", "passage_text": "IRS Audit Procedure: Guidelines for IRS Audits. Understand how the audit process works. Know how and why tax returns are selected for an IRS audit. Once a tax return is filed it will go through a series of computer programs to check for the likelihood of errors. Depending upon what kind of errors the IRS believes you have made it will send a letter and say what kind of audit they are planning on doing. The standard way for the IRS to communicate before and after a tax audit is through various IRS audit letters. Understand the various letters that the IRS will send to you, what they mean, and what actions must be taken on your part after receiving one of them."}, {"url": "http://www.taxdebthelp.com/tax-problems/tax-audit", "passage_text": "Most of the time the IRS will only have 3 years to audit a return, but if you don’t hear from the IRS within 18 months, it is very unlikely that your return will be selected for an audit. Statistically, the average person only has a 1% chance of getting audited. The standard way for the IRS to communicate before and after a tax audit is through various IRS audit letters. Understand the various letters that the IRS will send to you, what they mean, and what actions must be taken on your part after receiving one of them."}, {"url": "http://www.ehow.com/info_7942857_soon-file-irs-chooses-audit.html", "passage_text": "Save. There is no way to determine how long it will take the IRS to decide whether to audit your federal income tax return. However, the IRS has a limited amount of time to make this decision. When the time limit expires, you can rest assured that the IRS will not be conducting an audit. In the unlikely event you are chosen for an audit and the IRS increases the amount of tax you owe, you may be responsible for interest and penalties on that amount. For example, if the increase in tax is due to a negligent mistake you make, then the IRS will charge you 5 percent of the underpayment as a penalty."}]