[{"url": "http://thescienceofeating.com/2015/02/02/leg-cramps-causes-cures/", "passage_text": "You can prevent or alleviate muscle cramps in your legs by making simple lifestyle changes. Drinking plenty of water is essential, since cramps are often caused by dehydration. A healthy diet with plenty of fresh fruits and vegetables can also help to decrease the frequency of leg cramps. If you do get leg cramps frequently, especially nocturnal leg cramps it could be due to an electrolyte imbalance. Certain vitamins and minerals like potassium and magnesium, impact muscle function."}, {"url": "http://www.mayoclinic.org/healthy-lifestyle/pregnancy-week-by-week/expert-answers/leg-cramps-during-pregnancy/faq-20057766", "passage_text": "1 Limited research suggests that taking a magnesium supplement might help prevent leg cramps during pregnancy. 2  Make sure you have your health care provider's OK to take a supplement, however. 3  You might also consider eating more magnesium-rich foods, such as whole grains, beans, dried fruits, nuts and seeds. 4  Stay hydrated. 1 You might also consider eating more magnesium-rich foods, such as whole grains, beans, dried fruits, nuts and seeds. 2  Stay hydrated. 3  Keeping your muscles hydrated might help prevent cramps. 4  If your urine is dark yellow, it might mean that you're not getting enough water."}, {"url": "http://www.sparkpeople.com/ma/What-foods-are-good-for-leg-cramps?/6/1/23397548", "passage_text": "Bananas are great, but other often over looked foods are raisins, prunes, strawberries, citrus fruits, spinach, potatoes, soybeans, tomatoes, beans, fish, and even turkey (watch out for nitrate injections in turkey). you need to replace electrolytes to ease cramping.. sometimes it is from dehydration.. other times it is from urinating too much.. which removes electrolytes with the urine..I have to take Lasix for my CHF, and therefore have to take potassium pills to replenish what I lose.."}, {"url": "http://www.livestrong.com/article/116308-foods-prevent-leg-cramps/", "passage_text": "According to Enette Larson-Mayer, author of Vegetarian Sports Nutrition, muscle cramps occur when you are mineral deficient. Muscles require adequate amounts of sodium, potassium, calcium and magnesium in particular to function without cramping. To prevent leg cramps, consume plenty of foods rich in these minerals. You could get leg cramps any time, though they are most likely to occur while you're working your leg muscles during exercise. Your muscles require more minerals when they're being used for physical exercise."}, {"url": "http://www.rd.com/health/healthy-eating/eat-to-beat-leg-cramps/", "passage_text": "A daily serving of a high-potassium food—a handful of dried fruits; a glass of tomato juice, citrus juice, or milk; a slice of melon, an orange, or a banana—can help banish leg cramps and prevent their recurrence. Power through your next walk with foods that ease soreness and fuel a speedy recovery for muscle cramps. Foods That Heal. The key: Eat foods that contain potassium, a mineral that helps your body break down carbohydrates and build muscle."}, {"url": "http://thehealthyeatingsite.com/remedy-for-leg-cramps/", "passage_text": "Other calcium-rich food sources include: salmon, sardines (with bones), green beans, turnip greens. Additional magnesium-rich foods include: raw chocolate (raw cacao, the #1 source of magnesium), nuts and pumpkin seeds, molasses, spinach, baked potatoes, bananas, wheat germ and seafood. Also, make sure you are drinking enough water. Boosting your intake of calcium and magnesium can also help alleviate leg cramps. There is one super-food that’s incredibly high in both of these minerals, raw chocolate (also known as raw cacao). Here are some recipes using raw cacao."}, {"url": "http://thescienceofeating.com/2015/02/02/leg-cramps-causes-cures/", "passage_text": "Other calcium-rich food sources include: salmon, sardines (with bones), green beans, turnip greens. Additional magnesium-rich foods include: Plan ahead for self-care if your leg cramps primarily appear to be the result of strenuous exercise. Drink plenty of fluids and eat a well-balanced meal before heading out for a long run. Many athletes suggest eating a potassium-rich banana once you reach the finish line. A healthy diet with plenty of fresh fruits and vegetables can also help to decrease the frequency of leg cramps. If you do get leg cramps frequently, especially nocturnal leg cramps it could be due to an electrolyte imbalance. Certain vitamins and minerals like potassium and magnesium, impact muscle function."}, {"url": "http://www.rd.com/health/healthy-eating/eat-to-beat-leg-cramps/", "passage_text": "Eat to Beat Leg Cramps. Power through your next walk with foods that ease soreness and fuel a speedy recovery for muscle cramps. Foods That Heal. The key: Eat foods that contain potassium, a mineral that helps your body break down carbohydrates and build muscle."}, {"url": "http://thehealthyeatingsite.com/remedy-for-leg-cramps/", "passage_text": "Apple cider vinegar is high in potassium and this tonic should help quickly if your leg cramps are caused by low potassium: Mix 2 teaspoons apple cider vinegar, 1 teaspoon honey in a glass of warm water and drink. Also, make sure you are drinking enough water. Boosting your intake of calcium and magnesium can also help alleviate leg cramps. There is one super-food that’s incredibly high in both of these minerals, raw chocolate (also known as raw cacao). Here are some recipes using raw cacao."}, {"url": "http://thehealthyeatingsite.com/remedy-for-leg-cramps/", "passage_text": "If the above tonic helps relieve your leg cramps, try to boost your potassium levels by eating more of these potassium-rich foods: apples, bananas, dried fruits, avocado, mushrooms, yogurt, kefir, spinach, tomatoes, mushrooms, baked potatoes and cantaloupe. Also, make sure you are drinking enough water. Boosting your intake of calcium and magnesium can also help alleviate leg cramps. There is one super-food that’s incredibly high in both of these minerals, raw chocolate (also known as raw cacao). Here are some recipes using raw cacao."}]