[{"url": "http://www.johndclare.net/EA3.htm", "passage_text": "The Germans hated Clause 231 (which blamed Germany for causing the war), because it was the excuse for all the harsh clauses of the Treaty, and because they thought Russia was to blame for starting the war. Germany s military power was reduced, and it was not allowed any troops in the Rhineland. Worst of all, huge areas of Germany were given to countries like Poland, and Germany was not allowed to unite with Austria. The Germans thought this was unfair, because other nations were given self-determination but many Germans LOST the right to be part of Germany. The main reasons why the Germans hated the Treaty of Versailles was because they thought it was unfair. Germany had not taken part in the Conference. The terms were imposed upon Germany when Germany disagreed, the Allies threatened to go to war again"}, {"url": "http://nysaccis17.blogspot.com/2012/01/was-treaty-of-versailles-fair-or-not.html", "passage_text": "The Treaty of Versailles was unfair to Germany because they had to pay all reparations. The total amount they had to pay was around 33 billion. Germany at this point was at a very poor economy state. This wouldn't help the country, since it only made things worse. "}, {"url": "http://www.answers.com/Q/Why_was_the_Treaty_of_Versailles_unfair", "passage_text": "The treaty of Versailles was unwise and unfair because it meant that Germany would have to pay for the damage of the war. It was mainly France who wanted to punish Germany as … they had been humiliated when they had been taken over so quickly. The Treaty of Versailles was one of the peace treaties at the end  of World War I. It ended the war between Germany and the Allied  Powers. It was signed on June 28, 1919, e … xactly five years after  the assassination of Archduke Franz Ferdinand, one of the events  that triggered the start"}, {"url": "http://www.debate.org/opinions/was-the-treaty-of-versailles-fair-to-germany-which-of-the-allied-leaders-did-you-most-agree-with-which-of-the-provisions-was-the-most-fair-how-about-unfair", "passage_text": "Treaty of Versailles Unfair to Germany. I do not think the Treaty of Versailles was fair to Germany. They were not invited to Versailles to help create the treaty, they were just forced to sign it. Even though they did not agree with it, they had to sign it because the Allies were threatening invasion. The Treaty of Versailles. On one hand the Treaty of Versailles was not fair to Germany, but on the other hand it was. Germany was said to be responsible for the cause of the war. If Germany was responsible for the starting of the war then Germany deserved something bad in return."}, {"url": "http://www.debate.org/opinions/was-the-treaty-of-versailles-fair-to-germany-which-of-the-allied-leaders-did-you-most-agree-with-which-of-the-provisions-was-the-most-fair-how-about-unfair", "passage_text": "The Treaty of Versailles. Yes, I think that the Treaty of Versailles was very fair to Germany. I think this because Germany deserved something bad in return for even starting the war. It was not fair to Germany how they did not really have a say on what went on in with the Treaty of Versailles. The Treaty of Versailles. On one hand the Treaty of Versailles was not fair to Germany, but on the other hand it was. Germany was said to be responsible for the cause of the war. If Germany was responsible for the starting of the war then Germany deserved something bad in return."}, {"url": "http://www.johndclare.net/EA3.htm", "passage_text": "The Treaty of Versailles also forbade Anschluss with Austria. This seemed unfair to the Germans, because everywhere else in Europe, the Treaties of 1919 20 gave peoples self-determination, but they divided Germany, and put 12 % of its population into other countries. Worst of all, huge areas of Germany were given to countries like Poland, and Germany was not allowed to unite with Austria. The Germans thought this was unfair, because other nations were given self-determination but many Germans LOST the right to be part of Germany. The main reasons why the Germans hated the Treaty of Versailles was because they thought it was unfair. Germany had not taken part in the Conference. The terms were imposed upon Germany when Germany disagreed, the Allies threatened to go to war again"}, {"url": "http://www.rpfuller.com/gcse/history/2.html", "passage_text": "1 Germany though the Treaty was unfair because it was not based fully on Wilsons Fourteen Points. 2  On the 5 th November, 1918, Germany had accepted the Fourteen Points as the basis for peace and an armistice began at 11 oclock on the 11 th November 1918. 1 Germany thought the Treaty of Versailles (28 th June 1919) was unfair because it was a diktat. 2  The Big Three had not negotiated with Germany at Paris from January  June 1919. 3  Germany was given only three weeks to comment on the vast amounts of peace clauses. 4  Her objections were largely ignored"}]