[{"url": "https://en.wikipedia.org/wiki/United_States_Environmental_Protection_Agency", "passage_text": "The agency has approximately 15,193 full-time employees and engages many more people on a contractual basis. More than half of EPA human resources are engineers, scientists, and environmental protection specialists; other groups include legal, public affairs, financial, and information technologists. Each EPA regional office is responsible within its states for implementing the Agency's programs, except those programs that have been specifically delegated to states. 1  Region 1: responsible within the states of Connecticut, Maine, Massachusetts, New Hampshire, Rhode Island, and Vermont (New England)."}, {"url": "http://www.infoplease.com/encyclopedia/history/environmental-protection-agency.html", "passage_text": "Environmental Protection Agency (EPA), independent agency of the U.S. government, with headquarters in Washington, D.C. It was established in 1970 to reduce and control air and water pollution, noise pollution, and radiation and to ensure the safe handling and disposal of toxic substances. "}, {"url": "http://www.referenceforbusiness.com/encyclopedia/Ent-Fac/Environmental-Protection-Agency-EPA.html", "passage_text": "The federal Environmental Protection Agency (EPA) was created on December 2, 1970, by executive order of President Richard Nixon to permit coordinated and effective government action on behalf of the environment.. For example, for fiscal year 1991, at the end of the Bush administration, the EPA's budget was just over $6.09 million. President Clinton's proposed budget for fiscal year 1999 was over $7.77 million, a 6 percent rise as compared to 1998."}, {"url": "http://www.epa.illinois.gov/about-us/index", "passage_text": "The Illinois General Assembly was the first state legislature in the nation to adopt a comprehensive Environmental Protection Act. It was signed into law by Governor Richard Ogilvie and became effective on July 1, 1970. As a part of that act, the Illinois Environmental Protection Agency was created. "}, {"url": "http://www.referenceforbusiness.com/encyclopedia/Ent-Fac/Environmental-Protection-Agency-EPA.html", "passage_text": "Since 1970 the EPA has worked closely with the Council on Environmental Quality (CEQ), a relatively small executive agency that was created pursuant to the NEPA. Its mission is to advise the president on federal policy and action in the environmental area and to ensure that other federal agencies comply with NEPA. For example, for fiscal year 1991, at the end of the Bush administration, the EPA's budget was just over $6.09 million. President Clinton's proposed budget for fiscal year 1999 was over $7.77 million, a 6 percent rise as compared to 1998."}, {"url": "http://www.inc.com/encyclopedia/environmental-protection-agency-epa.html", "passage_text": "The U.S. Environmental Protection Agency (EPA) was created on December 2, 1970, by executive order of President Richard Nixon to permit coordinated and effective government action on behalf of the environment.. Fifteen different environmental programs from various federal offices were combined and placed under the jurisdiction of the newly created EPA. The EPA was designed to serve as an umbrella agency through which most federal environmental laws, regulations, and policies would be administered."}, {"url": "http://www.theatlantic.com/technology/archive/2010/12/gallery-why-nixon-created-the-epa/67351/", "passage_text": "Scenes like the ones shown in this gallery are why Nixon, one of the left's most despised figures, created the Environmental Protection Agency. "}, {"url": "https://en.wikipedia.org/wiki/United_States_Environmental_Protection_Agency", "passage_text": "The EPA was proposed by President Richard Nixon and began operation on December 2, 1970, after Nixon signed an executive order. The order establishing the EPA was ratified by committee hearings in the House and Senate. The agency is led by its Administrator, who is appointed by the president and approved by Congress. Each EPA regional office is responsible within its states for implementing the Agency's programs, except those programs that have been specifically delegated to states. 1  Region 1: responsible within the states of Connecticut, Maine, Massachusetts, New Hampshire, Rhode Island, and Vermont (New England)."}, {"url": "http://www.mnn.com/earth-matters/politics/photos/six-good-things-richard-nixon-did-for-the-environment/created-the-epa", "passage_text": "Photo 3 of 8. The Environmental Protection Agency was formed in December 1970 after President Nixon submitted a plan to Congress calling for the creation of the agency. Before the EPA was created, our nation had no central authority overseeing the protection of the environment. The EPA writes and enforces rules governing human health and the environment and is currently led by Administrator Lisa Jackson. "}, {"url": "http://www.referenceforbusiness.com/encyclopedia/Ent-Fac/Environmental-Protection-Agency-EPA.html", "passage_text": "When the EPA was created in 1970, it was headed by William Ruckelshaus (1932-), a loyal member of the Republican party who earned a reputation as a skilled administrator, who was able to work effectively with environmentalists as well as businesspeople. The EPA faced little criticism until the early 1980s. For example, for fiscal year 1991, at the end of the Bush administration, the EPA's budget was just over $6.09 million. President Clinton's proposed budget for fiscal year 1999 was over $7.77 million, a 6 percent rise as compared to 1998."}]