[{"url": "http://www.bbc.co.uk/bitesize/ks3/science/chemical_material_behaviour/compounds_mixtures/revision/2/", "passage_text": "Atoms of different elements can join together in chemical reactions to form compounds. For example hydrogen and oxygen are elements. They react together to form water, a compound. There are countless different ways for the elements to join together, and millions of compounds are known. You can only separate the elements in a compound using another chemical reaction. Separation methods like filtration and distillation will not do this. Compounds form when atoms join together in a chemical reaction. 1  Page. 2  1."}, {"url": "https://en.wikipedia.org/wiki/Copper", "passage_text": "Its compounds are commonly encountered as copper(II) salts, which often impart blue or green colors to minerals such as azurite and turquoise and have been widely used historically as pigments. Architectural structures built with copper corrode to give green verdigris (or patina). It is a ductile metal with very high thermal and electrical conductivity. Pure copper is soft and malleable; a freshly exposed surface has a reddish-orange color. It is used as a conductor of heat and electricity, a building material, and a constituent of various metal alloys."}, {"url": "https://www.purestcolloids.com/ionic_copper.php", "passage_text": "Ionic Copper is an all natural mineral supplement in the form of ionic copper ions of 0.9999 pure copper in pure deionized water. Ionic Copper is an all natural mineral supplement of copper consisting of of 0.999 pure copper suspended in pure deionized water. Copper is an essential trace element for humans and animals."}, {"url": "https://www.purestcolloids.com/ionic_copper.php", "passage_text": "Answer: The non-noble metals of Zinc & Copper are converted to ionic form by dissolving in the stomach acid. This is NOT the case with Silver, Gold & the other Noble metals. In other words, Zinc and copper are different than Silver, Gold, Platinum, Palladium & Iridium. Ionic Copper is an all natural mineral supplement of copper consisting of of 0.999 pure copper suspended in pure deionized water. Copper is an essential trace element for humans and animals."}, {"url": "https://www.purestcolloids.com/ionic_copper.php", "passage_text": "0.9999 pure copper in ionic form. Ionic Copper is an all natural mineral supplement of copper consisting of of 0.999 pure copper suspended in pure deionized water. Copper is an essential trace element for humans and animals."}, {"url": "https://en.wikipedia.org/wiki/Copper", "passage_text": "Copper is a chemical element with symbol Cu (from Latin: cuprum) and atomic number 29. It is a ductile metal with very high thermal and electrical conductivity. Pure copper is soft and malleable; a freshly exposed surface has a reddish-orange color. It is used as a conductor of heat and electricity, a building material, and a constituent of various metal alloys."}, {"url": "http://www.webelements.com/copper/compounds.html", "passage_text": "This section lists some binary compounds with halogens (known as halides), oxygen (known as oxides), hydrogen (known as hydrides), and some other compounds of copper. For each compound, a formal oxidation number for copper is given, but the usefulness of this number is limited for p-block elements in particular. Based upon that oxidation number, an electronic configuration is also given but note that for more exotic compounds you should view this as a guide only."}, {"url": "http://www.explainthatstuff.com/copper.html", "passage_text": "When it joins with other atoms, copper behaves chemically in two quite different ways to form compounds that are either described as copper (I), also known as cuprous, or copper (II), also known as cupric. The cupric compounds are more stable; cuprous ones generally turn into cupric ones. The two most important copper compounds are copper (II) sulphate, which is bright blue and used in agriculture and medicine, and copper (II) chloride, which is used as a wood preservative and in the printing and dyeing industries."}]