[{"url": "https://en.wikipedia.org/wiki/Clairvoyance", "passage_text": "In the field of parapsychology, clairaudience [from late 17th century French clair (clear) and audience (hearing)] is a form of extra-sensory perception wherein a person acquires information by paranormal auditory means. Claims for the existence of paranormal and psychic abilities such as clairvoyance have not been supported by scientific evidence published in high impact factor peer reviewed journals. Parapsychology explores this possibility, but the existence of the paranormal is not accepted by the scientific community."}, {"url": "http://psychiclibrary.com/beyondBooks/clairaudience/", "passage_text": "Clairaudience, which means clear hearing, is the ability to perceive sounds or words from outside sources in the spirit world. The psychic ability of clairaudience is ruled by the throat chakra, which controls communication. When this chakra is balanced and open, it allows messages to be received. It is important to note that all the chakras need to be balanced in order for these abilities to function effectively."}, {"url": "https://en.wikipedia.org/wiki/Clairvoyance", "passage_text": "The term clairvoyance (from French clair meaning clear and voyance meaning vision) is used to refer to the ability to gain information about an object, person, location or physical event through means other than the known senses, i.e., a form of extrasensory perception. Claims for the existence of paranormal and psychic abilities such as clairvoyance have not been supported by scientific evidence published in high impact factor peer reviewed journals. Parapsychology explores this possibility, but the existence of the paranormal is not accepted by the scientific community."}, {"url": "http://www.merriam-webster.com/dictionary/clairaudience", "passage_text": "Medical Definition of CLAIRAUDIENCE. : the power or faculty of hearing something not present to the ear but regarded as having objective reality. — clair·au·di·ent \\-ənt\\ adjective. — clair·au·di·ent·ly adverb. ADVERTISEMENT. "}, {"url": "http://thecrystalhealingstore.com/what-is-clairaudience/", "passage_text": "Tweet. Clairaudience is from the French word meaning “clear hearing” and is the art of hearing music, sounds and voices that are not audible to the normal hearing. The Wikipedia definition is “The ability to gain information about an object, person or physical event through means other than the known human senses”"}, {"url": "http://www.seasofmintaka.com/clairaudience.html", "passage_text": "However, speaking about Joan of Arc (and other misfortunates afflicted with the gift of clairaudience throughout all time who have had the bad luck to be molested by voices all their lives), it’s my opinion that Joan of Arc was probably not hearing the voice of God or angels or other divine celestial beings. "}, {"url": "http://www.healing-crystals-for-you.com/clairaudience.html", "passage_text": "Clairaudience is a psychic power that may develop along with one or more of the other psychic gifts. Often we ignore it until one of the other gifts becomes stronger. This is one of the psychic powers, and is also called psychic hearing. This gift is the ability to clearly hear the voice of spirit. In this article you will learn more about your psychic hearing, and how to develop this ability, by using meditation and specific crystals."}, {"url": "http://angels.about.com/od/SearchAngelsMiracles/fl/What-is-the-Clairaudience-Clear-Hearing-Form-of-ESP.htm", "passage_text": "Hearing Internally. Most of the time when clairaudience occurs, the sounds are internal -- inside people's minds -- because the way messages are usually communicated from the spiritual realm is through telepathy (mind to mind). Music or Singing. You may also experience clairaudience in a musical way, such as by hearing heavenly music or the sounds of angels singing. While this doesn't happen as often as hearing spoken words or phrases, it's an extraordinarily beautiful experience to have."}, {"url": "http://www.psychic101.com/clairaudience.html", "passage_text": "Clairaudience mean ‘Clear Hearing’ , it is usually the ability to hear voice in your mind. This voice is usually from an aspect of yourself. "}]