[{"url": "http://www.atitesting.com/ati_next_gen/skillsmodules/content/vital-signs/equipment/bldpressure.html", "passage_text": "A normal blood pressure for a healthy adult ranges from 90 to 120 mm Hg systolic and from 60 to 80 mm Hg diastolic. Under normal circumstances, blood volume remains constant at 5,000 mL. A blood pressure with a systolic of 140 mm Hg or higher or a diastolic pressure of 90 mm Hg or higher is considered high, although for patients with certain chronic conditions, like coronary artery disease, the guidelines vary."}, {"url": "http://www.atitesting.com/ati_next_gen/skillsmodules/content/vital-signs/equipment/bldpressure.html", "passage_text": "When documenting blood pressure, record the systolic number first, followed by a slash and the diastolic number, as in 120/80. The difference between the systolic and diastolic values is called the pulse pressure. This number is usually between 30 and 50 mm Hg and provides information about a patient’s cardiac function and blood volume. How often you measure blood pressure varies from patient to patient. A blood pressure with a systolic of 140 mm Hg or higher or a diastolic pressure of 90 mm Hg or higher is considered high, although for patients with certain chronic conditions, like coronary artery disease, the guidelines vary."}, {"url": "http://www.osceskills.com/e-learning/subjects/blood-pressure-measurement/", "passage_text": "Place the diaphragm of your stethoscope over the brachial artery and re-inflate the cuff to 20-30 mmHg higher than the estimated value taken before. Then deflate the cuff at 2-3 mmHg per second until you hear the first Korotkoff sound – this is the systolic blood pressure. If the blood pressure is greater than 140/90, you should wait for 1 minute and re-check. Please note, normal reading differ for diabetic patients. postural hypotension. Finally, you should inform the patient of their reading, and thank them."}, {"url": "https://en.wikipedia.org/wiki/Korotkoff_sounds", "passage_text": "1 The third sound was described as a loud, crisp tapping sound. 2  The fourth sound, at pressures within 10 mmHg above the diastolic blood pressure, was described as thumping and muting. 3  The fifth Korotkoff sound is silent as the cuff pressure drops below the diastolic blood pressure. Korotkoff sounds are the sounds that medical personnel listen for when they are taking blood pressure using a non-invasive procedure."}, {"url": "http://emedicine.medscape.com/article/1948157-overview", "passage_text": "An average of the 2 stable measurements should be recorded as the patient’s blood pressure. Wait another 1-2 minutes and repeat steps 4-10 to measure the blood pressure in the patient’s opposite arm. If a measurement discrepancy exists between the 2 arms, then the arm with the highest measurement should be used. Cuffs are available in numerous sizes, and obtaining a proper-sized cuff is essential. The length of the blood pressure cuff bladder should be 80% and the width at least 40% of the circumference of the upper arm."}, {"url": "https://en.wikipedia.org/wiki/Korotkoff_sounds", "passage_text": "1 The fourth sound, at pressures within 10 mmHg above the diastolic blood pressure, was described as thumping and muting. 2  The fifth Korotkoff sound is silent as the cuff pressure drops below the diastolic blood pressure. Korotkoff sounds are the sounds that medical personnel listen for when they are taking blood pressure using a non-invasive procedure."}, {"url": "http://www.atitesting.com/ati_next_gen/skillsmodules/content/vital-signs/equipment/bldpressure.html", "passage_text": "The width of the cuff should be 40% of the circumference of the midpoint of the limb on which you position the cuff, and the length of the bladder should be twice its width. The bladder should encircle at least 80% of the arm. To measure blood pressure, listen for the five Korotkoff sounds. A blood pressure with a systolic of 140 mm Hg or higher or a diastolic pressure of 90 mm Hg or higher is considered high, although for patients with certain chronic conditions, like coronary artery disease, the guidelines vary."}, {"url": "https://en.wikipedia.org/wiki/Korotkoff_sounds", "passage_text": "If the pressure is dropped to a level equal to that of the patient's systolic blood pressure, the first Korotkoff sound will be heard. As the pressure in the cuff is the same as the pressure produced by the heart, some blood will be able to pass through the upper arm when the pressure in the artery rises during systole. Korotkoff sounds are the sounds that medical personnel listen for when they are taking blood pressure using a non-invasive procedure."}, {"url": "https://en.wikipedia.org/wiki/Korotkoff_sounds", "passage_text": "1 The second sounds are the murmurs heard for most of the area between the systolic and diastolic pressures. 2  The third sound was described as a loud, crisp tapping sound. 3  The fourth sound, at pressures within 10 mmHg above the diastolic blood pressure, was described as thumping and muting. Korotkoff sounds are the sounds that medical personnel listen for when they are taking blood pressure using a non-invasive procedure."}]