[{"url": "https://en.wikipedia.org/wiki/Languages_of_Uganda", "passage_text": "Uganda is a multilingual country. Forty of its living indigenous languages fall into three main families — Bantu, Nilotic, and Central Sudanic — with another two languages in the Kuliak family. English, inherited from the colonial period, and Swahili, which is regionally important, are official languages"}, {"url": "https://en.wikipedia.org/wiki/Swahili_language", "passage_text": "Swahili serves as a national language of four nations: Tanzania, Kenya, Uganda and the Democratic Republic of the Congo. Shikomor, the official language in Comoros and also spoken in Mayotte (Shimaore), is related to Swahili. Swahili is also one of the official languages of the African Union and East African Community. Swahili has become a second language spoken by tens of millions in three African Great Lakes countries, Tanzania, Kenya, and the Democratic Republic of Congo, where it is an official or national language."}, {"url": "http://www.answers.com/Q/What_language_do_people_in_Uganda_speak", "passage_text": "Confidence votes 85. About 40 different languages are spoken in Uganda. The official language is English and Swahili was approved as a second official language in 2005. The most widely used local language is Luganda, but Lusoga, Runyankore and Bantu are used extensively in some areas. They speak the same English but they do say some word in hawaiian Mostly English but there and many languages that people speak there too Pigeon -- English slang There is a n … ative Hawaiian language, famous for its limited alphabet, but most people there today can speak English (and some Spanish)."}, {"url": "https://en.wikipedia.org/wiki/Languages_of_Uganda", "passage_text": "Upon Uganda's independence in 1962, English was maintained as the official language, as it was already rooted deeply in administration, media, and education. Also, Uganda's ethnolinguistic diversity made it difficult to choose another language as the official language of Uganda. Forty of its living indigenous languages fall into three main families — Bantu, Nilotic, and Central Sudanic — with another two languages in the Kuliak family."}, {"url": "https://en.wikipedia.org/wiki/Ugandan_English", "passage_text": "Ugandan English, or Uglish (pronounced you-glish), is the dialect of English spoken in Uganda. As with similar dialects spoken elsewhere, Ugandan English has developed a strong local flavour. The speech patterns of Ugandan languages strongly influence spoken English. Uganda has a large variety of indigenous languages, and someone familiar with Uganda can readily identify the native language of a person speaking English. Ugandan speakers will alter foreign words to make them sound more euphonic"}, {"url": "http://www.katutandike.org/facts-about-uganda", "passage_text": "Facts About Uganda. On this page you will find out facts about Uganda, its population, languages spoken and much more... Uganda is a landlocked country in East Africa, stretching along the equator between the Democratic Republic of Congo and Kenya. Swahili is also widely spoken and is used as a trade language throughout the East African region. Thanks to Uganda's important economic bonds with Kenya and Tanzania, Swahili has grown in popularity, and was designated in 2005 by the Ugandan Parliament as the country's second official language."}, {"url": "https://answers.yahoo.com/question/index?qid=20130622155327AAE025m", "passage_text": "Best Answer: The national languages are English, Ganda/Luganda and Swahili. The most widely spoken local language in Uganda is Luganda, spoken predominantly by the Ganda people (Baganda) in the urban concentrations of Kampala, the capital city, and in towns and localities in the Buganda region of Uganda. It's the local language of Entebbe. Swahili is an important lingua franca in the northern regions. Source(s): http://www.ethnologue.com/country/UG https://en.wikipedia.org/wiki/Uganda#Lan... http://en.wikipedia.org/wiki/Entebbe#His..."}, {"url": "http://www.speaksheets.com/country-translation/how-to-say-hello-in-uganda/", "passage_text": "Since a national language of Uganda is English, you should do fine just saying  Hello  In case you are traveling to other countries in Sub-Saharan Africa or elsewhere in the world, here are some more helpful words from our Uganda Greetings category: Fine, thank you. In Uganda, they speak English and Swahili. SpeakSheets offers our Lifetime Members printable and downloadable language one-sheets with no monthly costs ever, guaranteed. With more than 17 languages covering over 2.3 billion people worldwide, we can help make your travels to Uganda and beyond even more fun!"}, {"url": "http://www.answers.com/Q/What_language_do_people_in_Uganda_speak", "passage_text": "About 40 different languages are spoken in Uganda. The official language is English and Swahili was approved as a second official language in 2005. They speak the same English but they do say some word in hawaiian Mostly English but there and many languages that people speak there too Pigeon -- English slang There is a n … ative Hawaiian language, famous for its limited alphabet, but most people there today can speak English (and some Spanish)."}]