[{"url": "http://kompareit.com/homeandgarden/plumbing-compare-mound-vs-conventional-septic-system.html", "passage_text": "Cost of Mound Septic Systems. Mound septic systems are considerably more expensive than conventional septics because they require more sophisticated construction. The cost of the electric pump and sand also contributes to the total price. In most cases, budget anywhere from $10,000 to $20,000 for a mound septic system. However, keep in mind that prices vary widely based on the size of the system and soil conditions. Price also vary from region to region, from company to company, and from property to property. Cost of Conventional Septic Systems. Conventional systems are far less expensive, ranging from about $3,000 to $15,000. In the Midwest, you might pay $5,000 or less, for example."}, {"url": "http://budgeting.thenest.com/much-mound-septic-system-cost-23823.html", "passage_text": "Installation Costs. According to the Ohio State University Extension Service, a mound system costs approximately twice the amount of the same-sized conventional septic system, because of the amount of labor involved and cost of the sand. The higher cost is necessary, however, if the site or soil condition makes it impossible to use a subsurface soil absorption system, according to the OSUES. Although installation costs vary depending on septic size and location, a mounded septic can run between $30,000 to $50,000 to construct."}, {"url": "http://www.laundry-alternative.com/cost-of-a-new-septic-system/", "passage_text": "Lifetime Costs: The typical total cost for a new septic system over a 20 year period is $6,300 to $13,000 for trenches and mounds, or $13,500 to $32,000 for alternative treatment systems. For multi-household systems, typical trench or mound systems range from $18,500 to $25,000."}, {"url": "http://www.ehow.com/info_8597869_much-mound-septic-system-cost.html", "passage_text": "Cost. The potential cost of a mound septic system can vary widely from $9,000 all the way up to $25,000, according to the website Eco-Nomic. Competition. Most of the cost of a mound septic system is in hiring large machinery and the people who run them. Backhoes, graders and bulldozers are expensive to run. The more excavators there are in your immediate area, the more competition there is likely to be between them, and the lower their fees are likely to be."}, {"url": "http://www.home-plans-advisor.com/septic-system-cost.html", "passage_text": "1 This is one of the least expensive filter systems available. 2  Mound System-A mound septic system cost will depend largely on the slope and grade of the property, and these systems can cost from $9,000 to $25,000 or more. 3  This type of system can have many variables which can affect the cost you will pay. 1 Wisconsin At Grade System-This type of system may run from $6,000 to $10,000, and involves a mound. 2  A Wisconsin at grade system is rare, and is not used often. 3  Evapotranspiration System-The septic system cost for this system type is high, and will start at about $25,000 and go up from there."}, {"url": "http://www.laundry-alternative.com/cost-of-a-new-septic-system/", "passage_text": "Occasionally they can run in the $15,000 dollar range or more. Maintenance Costs: The typical annual costs of a new septic system drainfield or mound system range from $30 up to $500 with the high end including replacement costs of pumps in mound systems. The typical total cost for a new septic system over a 20 year period is $6,300 to $13,000 for trenches and mounds, or $13,500 to $32,000 for alternative treatment systems."}, {"url": "http://www.home-plans-advisor.com/septic-system-cost.html", "passage_text": "1 Pressure System-The septic system cost for a pressure system can range from a little more than $5,000 up to $10,000, depending on the installation site and the area where you live. 2  If there is a difficult location or other special considerations this cost can increase. 1 Wisconsin At Grade System-This type of system may run from $6,000 to $10,000, and involves a mound. 2  A Wisconsin at grade system is rare, and is not used often. 3  Evapotranspiration System-The septic system cost for this system type is high, and will start at about $25,000 and go up from there."}, {"url": "http://budgeting.thenest.com/much-mound-septic-system-cost-23823.html", "passage_text": "According to the University of Minnesota, typical yearly costs for a mounded septic system might run as much as $500 as of the time of publication, including the costs of replacing pumps in these systems. The higher cost is necessary, however, if the site or soil condition makes it impossible to use a subsurface soil absorption system, according to the OSUES. Although installation costs vary depending on septic size and location, a mounded septic can run between $30,000 to $50,000 to construct."}, {"url": "http://home.costhelper.com/septic-system.html", "passage_text": "1 The cost of a septic tank alone runs about $500-$1,800 depending on size (ranging from 300-1,000 gallons) and type. 2  Piping and other needed items adds another $100-$200 to the total cost of materials. 3  New Mexico State University provides an introduction to installing a septic tank. "}, {"url": "http://www.home-plans-advisor.com/septic-system-cost.html", "passage_text": "1 Mound System-A mound septic system cost will depend largely on the slope and grade of the property, and these systems can cost from $9,000 to $25,000 or more. 2  This type of system can have many variables which can affect the cost you will pay. 1 Wisconsin At Grade System-This type of system may run from $6,000 to $10,000, and involves a mound. 2  A Wisconsin at grade system is rare, and is not used often. 3  Evapotranspiration System-The septic system cost for this system type is high, and will start at about $25,000 and go up from there."}]