[{"url": "http://www.gynaecologymolloy.com/what-is-endometriosis/where-does-endometriosis-occur.html", "passage_text": "Typically, endometriosis occurs in the pelvis. The female pelvis is a space continuous with the abdominal cavity. It contains the bladder, the rectum and other bowel, and, most importantly, the female reproductive organs, including the vagina, uterus, tubes and ovaries. Rarely, endometriosis occurs in body sites away from the pelvis. It can occur in other parts of the abdominal cavity, such as on the surface of the liver, and has rarely been found in such places as abdominal wounds, or even in lung tissue."}, {"url": "https://en.wikipedia.org/wiki/Abdominopelvic_cavity", "passage_text": "The abdominopelvic cavity is a body cavity that consists of the abdominal cavity and the pelvic cavity. It contains the stomach, liver, pancreas, spleen, gallbladder, kidneys, and most of the small and large intestines. "}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=2082", "passage_text": "Abdominal cavity: The cavity within the abdomen, the space between the abdominal wall and the spine. The abdominal cavity is hardly an empty space. It contains a number of crucial organs including the lower part of the esophagus, the stomach, small intestine, colon, rectum, liver, gallbladder, pancreas, spleen, kidneys, and bladder. "}, {"url": "https://answers.yahoo.com/question/index?qid=20080904150934AADUbaV", "passage_text": "The cavities, or spaces, of the body contain the internal organs, or viscera. The two main cavities are called the ventral and dorsal cavities. The ventral is the larger cavity and is subdivided into two parts (thoracic and abdominopelvic cavities) by the diaphragm, a dome-shaped respiratory muscle. Abdominal and pelvic cavity The lower part of the ventral (abdominopelvic) cavity can be further divided into two portions: abdominal portion and pelvic portion. The abdominal cavity contains most of the gastrointestinal tract as well as the kidneys and adrenal glands. The abdominal cavity is bound cranially by the diaphragm, laterally by the body wall, and caudally by the pelvic cavity. The pelvic cavity contains most of the urogenital system as well as the rectum"}, {"url": "http://www.answers.com/Q/What_does_abdominal_cavity_contains", "passage_text": "These are the general organs that lie within the abdominal cavity. The stomach, small intestine, large intestine, spleen, live, gallbladder. In the retroperitoneal area of the … abdominal cavity, pancreas, kidneys, and adrenal glands. 2 people found this useful. The thoracic cavity is the upper part of the torso and contains  organs like the lungs and heart, while the abdominal cavity is the  lower part. These two parts are separate … d by the diaphragm. 17"}, {"url": "http://medical-dictionary.thefreedictionary.com/abdomen", "passage_text": "The cavity, which is lined with a membrane known as the peritoneum, contains the stomach, large and small intestines, liver, spleen, pancreas, kidneys, gallbladder, urinary bladder, and other structures. Called also belly and venter. adj., adj abdom´inal. Internal structures of the abdomen. The abdominal cavity is lined by the peritoneum; contains the inferior portion of the esophagus, the stomach, the intestines, the liver, the spleen, the pancreas, and other organs; and is bounded by the diaphragm and the pelvis. Also called. belly. See also abdominal regions. abdominal [abdom′-] adj."}, {"url": "http://www.answers.com/Q/What_does_abdominal_cavity_contains", "passage_text": "Making the world better, one answer at a time. The abdominal cavity contains the stomach, liver, gallbladder, spleen, pancreas, small & large intestines, & kidneys. The thoracic cavity is the upper part of the torso and contains  organs like the lungs and heart, while the abdominal cavity is the  lower part. These two parts are separate … d by the diaphragm. 17 people found this useful."}, {"url": "http://medical-dictionary.thefreedictionary.com/abdomen", "passage_text": "the portion of the body between the thorax and the pelvis. The abdominal cavity is lined by the peritoneum; contains the inferior portion of the esophagus, the stomach, the intestines, the liver, the spleen, the pancreas, and other organs; and is bounded by the diaphragm and the pelvis. Also called. belly. See also abdominal regions. abdominal [abdom′-] adj."}, {"url": "https://answers.yahoo.com/question/index?qid=20080904150934AADUbaV", "passage_text": "The pelvic cavity is bounded cranially by the abdominal cavity, dorsally by the sacrum, and laterally by the pelvis. Dorsal cavity The smaller of the two main cavities is called the dorsal cavity. As its name implies, it contains organs lying more posterior in the body. Abdominal and pelvic cavity The lower part of the ventral (abdominopelvic) cavity can be further divided into two portions: abdominal portion and pelvic portion. The abdominal cavity contains most of the gastrointestinal tract as well as the kidneys and adrenal glands. The abdominal cavity is bound cranially by the diaphragm, laterally by the body wall, and caudally by the pelvic cavity. The pelvic cavity contains most of the urogenital system as well as the rectum"}]