[{"url": "http://thehousingforum.com/how-long-does-meat-last-in-the-freezer/", "passage_text": "Beef in particular freezes well and will last quite a while without sacrificing flavor. Just how long it can be frozen depends on the individual cut and size of the beef. For example, roasts last the longest, up to 12 months when properly wrapped. Optimally, they should be used within six months. Stew and variety cuts are next on the list, lasting around 3 or 4 months."}, {"url": "http://www.rd.com/health/healthy-eating/how-long-can-you-store-meat-in-the-fridge-or-freezer/", "passage_text": "Red meat and pork can remain in the refrigerator up to 5 days and can be frozen for 4-12 months. Leftover cooked meat will last 3-4 days in the refrigerator and 2-6 months in the freezer. Ground meats (beef, veal, pork, or poultry) can be refrigerated for 1-2 days and frozen for 3-4 months. Lunchmeats and hot dogs will last two weeks in the refrigerator unopened and should be eaten within 3-5 days of opening (hot dogs can go a couple of days longer). In the freezer they’ll last 1-2 months. Bacon is safe to eat for up to a week in the fridge—but raw sausage should be eaten within two days. Both can be frozen for a month, and some sausage will freeze for twice as long."}, {"url": "http://www.oprah.com/health/How-Long-to-Keep-Frozen-Food-Nutrition-Advice-from-Dr-Katz", "passage_text": "1 Fatty fish like salmon can be frozen for two to three months, while lean fish like cod or flounder will last up to six. 2  Cooked leftovers: three months. 3  Ground meat (beef, lamb, pork) keeps for two or three months; roasts, steaks, and chops can be kept frozen for at least half a year. 4  Leftovers: two to"}, {"url": "http://www.oprah.com/health/How-Long-to-Keep-Frozen-Food-Nutrition-Advice-from-Dr-Katz", "passage_text": "1 A whole chicken is good for up to a year, but pieces—legs, wings, thighs—should be used within six to nine months. 2  For cooked chicken leftovers: four to six months. 3  Fatty fish like salmon can be frozen for two to three months, while lean fish like cod or flounder will last up to six. 4  Cooked leftovers: three months."}, {"url": "http://www.huffingtonpost.com/2012/03/20/freezing-meat_n_1367941.html", "passage_text": "And, believe it or not, some meats can last in the freezer for up to one year. 1  Cooked poultry -- 4 months. 2  Uncooked poultry parts -- 9 months. 3  Uncooked whole poultry -- 12 months. 4  Cooked meat -- 2 to 3 months."}]