[{"url": "http://www.divorcesource.com/research/edj/valuation/05oct109.shtml", "passage_text": "A minority discount is a percent reduction in the value of an interest that comprises only a minority of the corporation's stock. It is generally distinguished from a lack of marketability discount, a somewhat similar percent reduction to account for the fact that the corporation's stock is difficult to market."}, {"url": "http://www.valuadder.com/glossary/minority-ownership-interest-discount.html", "passage_text": "The minority interest discount reflects the notion that a partial ownership interest may be worth less than its pro-rata (proportional) share of the total business. For example, ownership of a 30% share in the business may be worth less than 30% of the entire company value."}, {"url": "http://philipsaunders.com/TheFirm/Publications/ControlPremiums/tabid/96/Default.aspx", "passage_text": "The LOMD is in addition to any minority discount. The two are taken not together but seriatim. For example a 10% minority discount reduces an $100 share value to $90, and a further reduction by a LOMD of 40% reduces the value to $54 ($90 x (1 - 0.4) = $54)."}, {"url": "http://www.divorcesupport.com/divorce/No-Discount-The-Question-of-Intrinsic-Value-3101.html", "passage_text": "The law in Virginia is similar: To that figure, the expert applied a discount of 40% for lack of marketability and 30% for minority status. That reduced the market value of the husband’s interest to $105,177. The trial court rejected the husband’s reasoning for discounting for minority status and marketability."}, {"url": "http://www.groco.com/readingroom/bus_dloc_mid.aspx", "passage_text": "MINORITY INTEREST. In most situations, a person owning a 100% would have a greater value for their interest than a person owning 51%. Not due to the fact that they own a larger percentage but that the price per share, or unit, would be higher. This is because they have greater “control” than a person with 51%."}, {"url": "http://www.abasf.com/articles/minority_discount.html", "passage_text": "There are many reasons why this is an imperfect measure of the minority discount, but it is about the best source of observed market data available. According to recent compilations of these control acquisitions, the median implied minority discount is about 30% from the value of the stock (for large companies)."}, {"url": "http://www.groco.com/readingroom/bus_dloc_mid.aspx", "passage_text": "Minority Interest Discount-a discount for lack of control applicable to a minority interest, or an ownership interest less than 50% of the voting interest in a business enterprise."}, {"url": "http://www.valuadder.com/glossary/minority-ownership-interest-discount.html", "passage_text": "The effect of applying a minority interest discount is to reduce the value of partial ownership interest below its proportional share of the business. As an example, discounting a 30% partnership interest by 20% would reduce its value to 24% of the overall business."}]