[{"url": "http://www.siumed.edu/~dking2/intro/4basic.htm", "passage_text": "1 The nerves, intrinsic blood vessels, and connective tissue of the heart comprise the stroma. 2  The parenchyma of the brain is nervous tissue (nerve cells and glia). 3  The blood vessels within the brain and the connective tissue associated with these blood vessels are stroma. All organs are built of these four tissues, which have consistent characteristics and arrangements from organ to organ. Thus an appreciation of the major features of these four basic tissue types can greatly simplify your understanding of the cellular composition of the many organ systems. 1  OVERVIEW."}, {"url": "http://circulatorysystemmvb.weebly.com/tissues.html", "passage_text": "Connective tissue supports, protects, and binds other tissues together. The collagen fibers that are found between connective tissue cells provide strength and flexibility. Some examples of connective tissues are bone, cartilage, blood, and adipose (fat). Blood is the main connective tissue in the circulatory system, but it's a liquid connective tissue. Blood tissue is in the same family as bone and cartilage, but instead it has a liquid medium that holds it together. The blood's volume is 55% plasma, 44%red blood cells, and 1% platelets and white blood cells"}, {"url": "http://www.siumed.edu/~dking2/intro/4basic.htm", "passage_text": "All of the various tissues of the human body can be categorized into four basic tissue types. All organs are built of these four tissues, which have consistent characteristics and arrangements from organ to organ. Thus an appreciation of the major features of these four basic tissue types can greatly simplify your understanding of the cellular composition of the many organ systems. 1  OVERVIEW."}, {"url": "http://www.siumed.edu/~dking2/intro/4basic.htm", "passage_text": "1 The parenchyma of the brain is nervous tissue (nerve cells and glia). 2  The blood vessels within the brain and the connective tissue associated with these blood vessels are stroma. 3  The parenchyma of the malignant neoplasm is cancer cells. 4  Other tissues, including blood vessels, which grow to support the tumor are stroma. All organs are built of these four tissues, which have consistent characteristics and arrangements from organ to organ. Thus an appreciation of the major features of these four basic tissue types can greatly simplify your understanding of the cellular composition of the many organ systems. 1  OVERVIEW."}, {"url": "http://www.siumed.edu/~dking2/intro/epith.htm", "passage_text": "Epithelial tissue comprises one of the four basic tissue types. The others are connective tissue (support cells, immune cells, blood cells), muscle tissue (contractile cells), and nervous tissue. Organs represent various combinations of these four basic tissue types, which thus comprise the entire body. Epithelial tissue is one of the four basic tissue types. Several features characterize epithelial tissue and distinguish it from connective tissue, muscle tissue, and nervous tissue. 1  Epithelial tissue covers surfaces with an uninterrupted layer of cells."}, {"url": "http://www.beaconlearningcenter.com/documents/1966_3268.pdf", "passage_text": "The muscles of our lungs, stomach, and intestines are made of smooth muscle tissue. Cardiac muscle tissue is the third type of muscle tissue. Cardiac muscle tissue makes our hearts. Organs are groups of tissues that work together to do a job. Our skin is made of hair tissue, oil and sweat gland tissues, nerve tissue, blood tissue, and many other tissues to make the organ called skin. Our eyes are made of nerve tissue, blood vessel tissue, muscle tissue, lens tissue, pupil tissue, and many more types of tissue to make the organ called eyes. "}, {"url": "https://en.wikipedia.org/wiki/Nervous_tissue", "passage_text": "Structure [edit]. Nervous tissue is composed of neurons, also called nerve cells, and neuroglial cells. Typically, nervous tissue is categorized into four types of tissue. In the central nervous system (CNS), the tissue types found are grey matter and white matter. In the peripheral nervous system (PNS), the tissue types are nerves and ganglia. The tissue is categorized by its neuronal and neuroglial components."}, {"url": "https://en.wikipedia.org/wiki/Nervous_tissue", "passage_text": "Nervous tissue is the main component of the two parts of the nervous system; the brain and spinal cord of the central nervous system (CNS), and the branching peripheral nerves of the peripheral nervous system (PNS), which regulates and controls bodily functions and activity. In the central nervous system (CNS), the tissue types found are grey matter and white matter. In the peripheral nervous system (PNS), the tissue types are nerves and ganglia. The tissue is categorized by its neuronal and neuroglial components."}, {"url": "http://www.carolguze.com/text/102-19-tissuesorgansystems.shtml", "passage_text": "The organ systems carry out the functions of the body such as digestion, communication, circulation, respiration, excretion, and movement. Tissues may be categorized into four major types: (1) epithelial, (2) connective tissue, (3) muscle, and (4) nervous tissue. The cells of tissues are held together by one or more of a variety of cell junctions. Muscle tissues. There are three major types of muscle cells. The striated or skeletal muscle is under voluntary control and is the major effector organ of our bodies. It and the glands (endocrine and exocrine) carry out all the commands of the nervous and endocrine (communication) systems."}]