[{"url": "http://www.neurogistics.com/Conditions/HeadacheandMigraine.asp", "passage_text": "More About Excitatory and Inhibitory Neurotransmitters. 1  Excitatory. 2  Most external input is excitatory in nature, which causes excretion of excitatory neurotransmitters in the brain. 3  Inhibitory. 4  Increasing the quantity of inhibitory neurotransmitters to balance the inevitable excitatory stimuli has proven to be extremely helpful in reducing the ..."}, {"url": "http://webspace.ship.edu/cgboer/genpsyneurotransmitters.html", "passage_text": "Glutamate is an excitatory relative of GABA. It is the most common neurotransmitter in the central nervous system-as much as half of all neurons in the brain-and is especially important in regards to memory. Curiously, glutamate is actually toxic to neurons, and an excess will kill them."}, {"url": "http://www.disabled-world.com/health/neurology/migraine/serotonin.php", "passage_text": "While Serotonin does not appear to be the main cause of a migraine, low levels have been linked to migraine headaches for a long time. A serotonin migraine is due to a deficiency in a person's serotonin level. During a Serotonin migraine, the levels of Serotonin in a person's system may rise and suddenly fall prior to the migraine. Low levels of serotonin are linked to both migraines and depression."}, {"url": "http://www.neurogistics.com/Conditions/HeadacheandMigraine.asp", "passage_text": "A person’s brain chemistry (neurotransmitters) falls into two categories: excitatory (stimulating) or inhibitory (calming). For a brain to function properly there must be a balance between these two types of neurotransmitters. And when an imbalance in neurotransmitters exists, headaches or migraines can occur."}, {"url": "http://www.disabled-world.com/health/neurology/migraine/serotonin.php", "passage_text": "Along with specific medications for migraine, Serotonin levels might be influenced by the foods a person eats. 'Tryptphen,' which is a precursor of the neurotransmitter in a person's body, can be found in a number of different foods."}, {"url": "http://www.disabled-world.com/health/neurology/migraine/serotonin.php", "passage_text": "There is a definite link between migraines and the levels of Serotonin in a person's body. Serotonin has been intensively studied and is believed to play a crucial role involving migraine headaches. Serotonin is an important neurotransmitter. It is important in the maintenance of extra cranial vasoconstriction."}, {"url": "http://serendip.brynmawr.edu/bb/neuro/neuro98/202s98-paper3/Ralston3may2701.html", "passage_text": "Migraines may induce nausea, and the pain will frequently be worse around one eye, or on one side of the head, with the pain sometimes switching sides or affecting both sides at once. There are also abdominal migraines, in which nausea will be experienced, but no head pain. This type is more common in children."}]