[{"url": "http://www.acting-school-stop.com/Stanislavski.html", "passage_text": "Constantin Stanislavski (sometimes spelled Konstantin Stanislavsky) was a Russian actor and director from the beginning of the 20th century. His system was born out of a quest for realism in acting."}, {"url": "http://www.biography.com/people/constantin-stanislavski-9492018", "passage_text": "Constantin Stanislavski was a Russian stage actor and director who developed the naturalistic performance technique known as the Stanislavsky method, or method acting."}, {"url": "http://plays.about.com/od/actingessentials/a/The-Stanislavsky-Method.htm", "passage_text": "Stanislavsky (also spelled Konstantine Stanislavski) helped to change much of that. In many ways, Stanislavsky is the father of today's style of Method Acting, a process in which actors immerse themselves into their characters as much as possible."}, {"url": "http://acting-world.com/method.html", "passage_text": "It was developed by Konstantin Stanislavsky (1863 - 1938) – a Russian actor, theatre director, teacher and co-founder of the famous Moscow Art Theatre. Stanislavsky discovered that acting could be learnt and created a system, which enabled a person to train as an actor step by step. Stanislavsky System is well known all over the world as Method Acting. For thirty years the object of Stanislavsky's study was the creation of an artistically conceived image of life and of a living, truthful human being on the stage. Stanislavsky System is a great contribution, a luminous legacy to the art of theatre."}, {"url": "http://www.backstage.com/advice-for-actors/resources/8-acting-techniques-and-stars-who-swear-them/", "passage_text": "Lee Strasberg’s Method. An actor himself, Lee Strasberg’s method was inspired by Stanislavski’s system and the Moscow Art Theatre. His “method,” derived from Stanislavski, encourages actors magnify and intensify their connection to the material by creating their characters’ emotional experiences in their own lives."}, {"url": "http://plays.about.com/od/actingessentials/a/The-Stanislavsky-Method.htm", "passage_text": "Stanislavsky's Legacy: Stanislavsky's Moscow Theater thrived during the Soviet Union, and it even continues today. His method of acting has influenced many other renowned drama teachers including: 1  Stella Adler. 2  Lee Strasberg."}]