[{"url": "http://www.fairwork.gov.au/leave/annual-leave", "passage_text": "Full-time and part-time employees get 4 weeks of annual leave, based on their ordinary hours of work. Jane is a part-time employee who works 20 hours per week for a year. At the end of the year, she is entitled to 80 hours of annual leave (the equivalent of 4 weeks work for her). Annual leave accumulates even when an employee is on paid leave including paid annual leave and personal leave. Annual leave does not accumulate when the employee is on: 1  unpaid annual leave."}, {"url": "http://labourguide.co.za/conditions-of-employment/452-maternity-leave-and-annual-leave", "passage_text": "This, as we all know, equates to 15 working days. This provision for the annual leave entitlement in section 20 (1) and (2) does not make any exclusions to the entitlement – in other words, no employee is excluded from this entitlement and certainly it makes no exclusion based on maternity leave. Some employers have interpreted this to mean that, since the employee is on maternity leave, which is unpaid leave, the employee is then neither working nor is entitled to be paid – hence no annual leave accrues while"}, {"url": "http://labourguide.co.za/conditions-of-employment/452-maternity-leave-and-annual-leave", "passage_text": "Put differently, the employee on maternity leave continues to remain an employee of the employer – albeit that the employee is on unpaid leave. In section 20 (2) (b), it is stated that by agreement, annual leave may accrue at the rate of 1 day for every 17 days on which the employee worked or was entitled to be paid. Some employers have interpreted this to mean that, since the employee is on maternity leave, which is unpaid leave, the employee is then neither working nor is entitled to be paid – hence no annual leave accrues while on maternity leave."}, {"url": "http://www.genomecanada.ca/medias/PDF/EN/VacationPolicy.pdf", "passage_text": "Part-time employees earn annual vacation leave credits on a pro rata basis. Vacation leave credits continue to accrue while an employee is on sick leave, and paid maternity and/or parental leave. Vacation leave credits do not accrue while an employee is on long-term disability or other unpaid leaves of absence. Unused sick day credits will accumulate from year to year. Sick leave does not accumulate when an employee is on long term disability or other periods of unpaid leave. Part-time employees earn sick"}, {"url": "http://www.uhrdir.co.za/index.php/latest-news/87-do-you-accrue-annual-leave-while-on-maternity-leave", "passage_text": "Here are two very important facts to always remember: Section 6 of the Employment Equity Act prohibits an employer from unfairly discriminating against an employee. An employee on (unpaid) maternity leave is unfairly discriminated against, if not allowed to accrue annual leave whilst on maternity leave. "}, {"url": "http://www.opm.gov/policy-data-oversight/pay-leave/leave-administration/fact-sheets/sick-leave-general-information/", "passage_text": "An agency may grant sick leave to an employee on annual leave for any of the purposes for which sick leave may be granted, but is not required to do so. For example, if an employee becomes sick while on annual leave, the agency may grant sick leave to him or her in the place of annual leave. "}, {"url": "http://labourguide.co.za/conditions-of-employment/452-maternity-leave-and-annual-leave", "passage_text": "I am often asked whether an employee on maternity leave continues to accrue annual leave during a period of maternity leave. There does not seem to be a clear answer, since different interpretations have been made by different people on this question. Some employers have interpreted this to mean that, since the employee is on maternity leave, which is unpaid leave, the employee is then neither working nor is entitled to be paid – hence no annual leave accrues while on"}, {"url": "http://www.fairwork.gov.au/leave/maternity-and-parental-leave/when-on-parental-leave/other-leave-entitlements-during-parental-leave", "passage_text": "An employee doesn't accumulate any type of paid leave while they're on unpaid parental leave. This includes paid leave such as annual leave or sick leave. Paid leave also doesn't accumulate when an employee is getting the Australian Government Paid Parental Leave Scheme payments. Maggie is about to take 12 months unpaid parental leave. She wants to take some annual leave during her parental leave so she has income in the later months of her unpaid leave. She agrees with her employer to take 4 weeks annual leave in her ninth month of"}, {"url": "http://labourandhrclub.fspbusiness.co.za/leave/annual-leave-accumulation-while-on-maternity-leave-2617.html", "passage_text": "According to the BCEA an employee is entitled to at least one days annual leave for every 17 days worked. In my opinion, given the fact that an employee on maternity leave DOES NOT WORK, the employee does not qualify for accumulating leave. Please comment on this. Annual leave continues to accrue during maternity leave. First, the BCEA talks about a leave cycle of 12 months during which 21 days’ annual are accrued, without making any exception for maternity leave, for example. Second, it prohibits maternity leave and annual leave from running concurrently (s 20(6)"}]