[{"url": "http://www.sheepandgoat.com/#!tapeworms/c3ko", "passage_text": "Reviews of research show that tapeworms do not cause any ill effects on sheep or lambs despite their rather troublesome appearance. If sheep or lambs are looking poorly and tape segments are in the dung, you should probably look for causes other than tapeworms."}, {"url": "http://www.moredun.org.uk/research/practical-animal-health-information/disease-summaries/tapeworm-and-tapeworm-larvae-infect-s", "passage_text": "1 Sheep are also the intermediate host to four species of tapeworm (Taenia hydatigena-the thin necked bladder worm, Taenia ovis-the sheep bladder worm ,, Taenia multiceps-the tapeworm that causes gid and Echinococcus granulosus-the tapeworm that causes hydatidosis), all of which have the domestic dog as the final host."}, {"url": "http://www.jefferspet.com/products/valbazen-broad-spectrum-dewormer", "passage_text": "Valbazen® Broad Spectrum Dewormer is an oral suspension for use in cattle, sheep, and goats for the removal and control of liver flukes, tapeworms, stomach worms, intestinal worms, and lungworms in cattle and sheep, and for adult liver flukes in nonlactating goats. Valbazen® contains 11.36% Albendazole."}, {"url": "http://www.fivetanimalhealth.com/tech/tapeworm-cattle-sheep-and-goats", "passage_text": "Tapeworm in Cattle, Sheep and Goats. The tapeworm is a long thin, flat worm (hence its name) which attaches by a sucker and/or hooks in the head to the intestine of the host. The worm has a thin neck and the rest of the body consists of detachable body segments."}, {"url": "http://www.wormboss.com.au/worms/tapeworms/sheep-intestinal-tapeworm.php", "passage_text": "Sheep intestinal tapeworm. While tapeworms are large and the segments passing in the dung are very obvious, there is no consistent evidence that they cause production loss or ill-health."}, {"url": "http://www.sheepandgoat.com/#!tapeworms/c3ko", "passage_text": "Moniezia expansa is the tapeworm that commonly affects sheep and goats. Moniezia benedeni, more common in cattle, can also be found in sheep and goats. Sheep and goats serve as intermediate hosts for several other species of tapeworms. Tapeworm segments can be seen in the feces of sheep and goats. They have a white, grain-like appearance. Adult worms, often up to a meter or more in length, can be expelled and passed in the environment. Tapeworm eggs can be seen in sheep and goat feces, using the standard worm count procedure."}]