[{"url": "http://www.urbandictionary.com/define.php?term=dihydrogen%20monoxide", "passage_text": "dihydrogen monoxide. Dihydrogen Monoxide (DHMO) is a colorless and odorless chemical compound, also referred to by some as Dihydrogen Oxide, Hydrogen Hydroxide, Hydronium Hydroxide, or simply Hydric acid. Dihydrogen Monoxide is a prevalent compound that is the key ingredient in most pesticides. DHMO contributes to environmental hazards such as acid rain, the greenhouse effect, and soil erosion."}, {"url": "http://www.dhmo.org/facts.html", "passage_text": "Dihydrogen Monoxide FAQ. Dihydrogen Monoxide (DHMO) is a colorless and odorless chemical compound, also referred to by some as Dihydrogen Oxide, Hydrogen Hydroxide, Hydronium Hydroxide, or simply Hydric acid. Each year, Dihydrogen Monoxide is a known causative component in many thousands of deaths and is a major contributor to millions upon millions of dollars in damage to property and the environment. Some of the known perils of Dihydrogen Monoxide are:"}, {"url": "http://knowyourmeme.com/memes/dihydrogen-monoxide-hoax", "passage_text": "The dihydrogen monoxide (DHMO) is an internet hoax that is designed to convince people that “dihydrogen monoxide,” a scientific name for pure water, is an extremely dangerous chemical that is present in most consumer products. They chose to use the term “dihydrogen monoxide,” the molecular structure of water containing two hydrogen atoms and one oxygen atom, because of the negative connotations of the term “monoxide,” which is a common name for lethal carbon monoxide gas."}, {"url": "http://cactus.eas.asu.edu/partha/Columns/11-05-DHMO.htm", "passage_text": "Dihydrogen Monoxide. Dihydrogen monoxide or DHMO, also known as Hydrogen Hydroxide or Hydronium Hydroxide is one of the most prolific chemicals contacted in daily life. It is colorless, odorless and tasteless, and sometimes considered harmless, and yet kills very large numbers of humans every year. Yet, most unknowing victims consider DHMO vital to life. Absence of DHMO can lead to famine, renal failure and disease. It is used daily for food preparation and is present in most kitchens and bathrooms. It has been called the elixir of life. It is also vital to our existence, without DHMO we would be all dead."}, {"url": "http://staffweb.mps.k12.mi.us/reinhardtbp/.2Chemdocs/Unit%204B/DHMO%20facts.pdf", "passage_text": "What is Dihydrogen Monoxide? Dihydrogen Monoxide (DHMO) is a colorless and odorless chemical compound, also referred to by some as Dihydrogen Oxide, Hydrogen Hydroxide, Hydronium Hydroxide, or simply Hydric acid. What are some of the dangers associated with DHMO? Each year, Dihydrogen Monoxide is a known causative component in many thousands of deaths and is a major contributor to millions upon millions of dollars in damage to property and the environment."}, {"url": "https://en.wikipedia.org/wiki/Dihydrogen_monoxide_hoax", "passage_text": "Dihydrogen monoxide: is also known as hydroxyl acid, and is the major component of acid rain. contributes to the greenhouse effect. may cause severe burns. contributes to the erosion of our natural landscape. The first appearance of the hoax on the internet was attributed by the Pittsburgh Post-Gazette to the so-called Coalition to Ban Dihydrogen Monoxide, a parody organization started by UC Santa Cruz student Craig Jackson following the on-campus postings and initial newsgroup discussions."}, {"url": "http://www.abc.net.au/science/articles/2006/05/17/1631494.htm", "passage_text": "Well, DHMO, DiHydrogen MonOxide, also known as Hydric Acid, Hydronium Hydroxide, is usually called just plain water. First-year University Chemistry students have made laboured jokes about water's chemical properties for years. "}, {"url": "http://www.snopes.com/science/dhmo.asp", "passage_text": "Symptoms of DHMO ingestion can include excessive sweating and urination, and possibly a bloated feeling, nausea, vomiting and body electrolyte imbalance. For those who have become dependent, DHMO withdrawal means certain death. Dihydrogen monoxide: is also known as hydroxl acid, and is the major component of acid rain. Dihydrogen monoxide is colorless, odorless, tasteless, and kills uncounted thousands of people every year. Most of these deaths are caused by accidental inhalation of DHMO, but the dangers of dihydrogen monoxide do not end there. Prolonged exposure to its solid form causes severe tissue damage."}]