[{"url": "https://en.wikipedia.org/wiki/Wimbledon,_London", "passage_text": "Wimbledon /ˈwɪmbəldən/ is a suburban district of southwest London, England, in the London Borough of Merton, south of Wandsworth, northeast of New Malden, northwest of Mitcham, west of Streatham and north of Sutton. The New Wimbledon Theatre is a Grade II listed Edwardian theatre built by J B Mullholland as the Wimbledon Theatre on the site of a large house with spacious grounds. The theatre was designed by Cecil Aubrey Masey and Roy Young (possibly following a 1908 design by Frank H Jones)."}, {"url": "http://www.answers.com/Q/Where_is_Wimbledon", "passage_text": "Wimbledon   Municipal center in the Greater London borough of Merton, known as the site of the annual lawn-tennis All-England Championships. Held in late June and early J … uly, the tournament is the oldest (founded 1877) and most prestigious in the world. 1 Watching Wimbledon on television is okay, but being there is an ex…. 2  Wimbledon Tickets: Information And Application Details Demand for Wimbledon tickets has significantly exceeded supply for most of the tennis championship's history since it began in 1877."}, {"url": "https://en.wikipedia.org/wiki/The_Championships,_Wimbledon", "passage_text": "Wimbledon and the French Open are the only Grand Slam tournaments where fans without tickets for play can queue up and still get seats on the three show courts on the day of the match. Sequentially numbered queue cards were introduced in 2003. From 2008, there is a single queue, allotted about 500 seats for each court. Wimbledon is the only Grand Slam event played on grass courts. At one time, all the Majors, except the French Open, were played on grass. The US Open abandoned grass in 1975 and the Australian Open in 1988."}, {"url": "http://www.maplandia.com/united-kingdom/england/south-east/merton/wimbledon/", "passage_text": "detailed map of Wimbledon and near places. Welcome to the Wimbledon google satellite map! This place is situated in Merton, South East, England, United Kingdom, its geographical coordinates are 51° 26' 0 North, 0° 13' 0 West and its original name (with diacritics) is Wimbledon. See Wimbledon photos and images from satellite below, explore the aerial photographs of Wimbledon in United Kingdom."}, {"url": "https://en.wikipedia.org/wiki/Wimbledon,_London", "passage_text": "Wimbledon lies in the south west area of London, south of Wandsworth, west of Mitcham, north of Sutton and east of Kingston upon Thames on the outskirts of Greater London. It is 7 miles (11.3 km) south-west of the centre of London at Charing Cross. The New Wimbledon Theatre is a Grade II listed Edwardian theatre built by J B Mullholland as the Wimbledon Theatre on the site of a large house with spacious grounds. The theatre was designed by Cecil Aubrey Masey and Roy Young (possibly following a 1908 design by Frank H Jones)."}, {"url": "https://en.wikipedia.org/wiki/The_Championships,_Wimbledon", "passage_text": "The Championships, Wimbledon, commonly known as  Wimbledon , is the oldest tennis tournament in the world, and is widely considered the most prestigious. It has been held at the All England Club in Wimbledon, London since 1877. Wimbledon is the only Grand Slam event played on grass courts. At one time, all the Majors, except the French Open, were played on grass. The US Open abandoned grass in 1975 and the Australian Open in 1988."}, {"url": "http://www.answers.com/Q/Where_is_Wimbledon", "passage_text": "Wimbledon is in South London, in England (in the borough of Merton). 1 Watching Wimbledon on television is okay, but being there is an ex…. 2  Wimbledon Tickets: Information And Application Details Demand for Wimbledon tickets has significantly exceeded supply for most of the tennis championship's history since it began in 1877."}, {"url": "https://www.ticketcity.com/tennis/wimbledon-tennis-tickets.html", "passage_text": "Wimbledon Tickets Information. Wimbledon, formally known as The Championships, Wimbledon, is the oldest and most prestigious tennis championship event. This highly respected event has attracted world renowned tennis players throughout the years producing some of the most Notable Wimbledon Matches to date. Wimbledon is permanently played at the All England Tennis Club in London where it seats 3,000 spectators. All England Tennis Club has hosted the Wimbledon tournament since 1877 when it was known as the All England Lawn Tennis and Croquet Club. Wimbledon has unique traditions and History of its own. "}, {"url": "http://www.roadtrips.com/trip/wimbledon-getaways/", "passage_text": "The legendary All England Lawn Tennis & Croquet Club (AELTC), or the All-England Club as it is also known, was founded in 1868 in the London suburb of Wimbledon. Home to the famous Wimbledon Championships, the only Grand Slam tournament still held on grass, the private club boasts 19 grass courts. Allow Roadtrips to be your guide to an authentic British experience to Wimbledon and London. Enjoy exclusive access to the best seating at the All England Lawn Tennis Club, the best restaurants in London, and the finest accommodations in the country."}, {"url": "https://en.wikipedia.org/wiki/Wimbledon,_London", "passage_text": "It is home to the Wimbledon Tennis Championships and New Wimbledon Theatre, and contains Wimbledon Common, one of the largest areas of common land in London. The New Wimbledon Theatre is a Grade II listed Edwardian theatre built by J B Mullholland as the Wimbledon Theatre on the site of a large house with spacious grounds. The theatre was designed by Cecil Aubrey Masey and Roy Young (possibly following a 1908 design by Frank H Jones)."}]