[{"url": "http://americanfood.about.com/od/southwest/", "passage_text": "Southwest Regional Cuisine. The cuisine of the American West and Southwest was shaped by prehistoric Native tribes, generations of hardy and resourceful cowboys, as well as the modern Mexican influences. This region's rustic cuisine has some of the spiciest and most colorful American food anywher"}, {"url": "https://en.wikipedia.org/wiki/Cuisine_of_the_Southwestern_United_States", "passage_text": "Maize. The cuisine of the Southwestern United States is food styled after the rustic cooking of the Southwestern United States. It is also known to be very popular in the west coast state of California. Southwestern cuisine is similar to Mexican cuisine but often involves larger cuts of meat, and less use of tripe, brain, and other parts not considered as desirable in the United States. As with Mexican cuisine, Southwestern cuisine is also largely known for its use of spices (particularly the chile, or Chili pepper). Recently, several chains of casual dining restaurants specializing in Southwestern cuisine have become popular in the United States"}, {"url": "https://en.wikipedia.org/wiki/Cuisine_of_the_Southwestern_United_States", "passage_text": "The New Mexican Cuisine is most popular in the southwestern states of New Mexico, Colorado, and Utah. Texas has a version called Tex-mex, while Arizona's style of Southwestern cuisine is often called Sonoran. Southwestern cuisine is similar to Mexican cuisine but often involves larger cuts of meat, and less use of tripe, brain, and other parts not considered as desirable in the United States. As with Mexican cuisine, Southwestern cuisine is also largely known for its use of spices (particularly the chile, or Chili pepper). Recently, several chains of casual dining restaurants specializing in Southwestern cuisine have become popular in the United States"}, {"url": "http://www.mapsofworld.com/pages/mmmerica/united-states-of-mmmerica-cuisine-of-the-southwest/", "passage_text": "The natives cultivated chiles, corn, tomatoes, beans, avocados, and squash, which have been incorporated into the cuisine of the American Southwest. The Spanish brought ingredients from their homeland, including cheese, lard, and rice. Sopapillas are very similar to Navajo fry bread, which is an important part of the Navajo tradition. Like its name suggests, Navajo fry bread is a fried quick bread made by Native American tribes in the"}, {"url": "http://www.mapsofworld.com/pages/mmmerica/united-states-of-mmmerica-cuisine-of-the-southwest/", "passage_text": "American Southwest Food. Search. Click to view full Infographic. Southwestern cuisine was created at the confluence of Spanish, Mexican, and Native American cultures, which took place especially in the region of New Mexico, but also in the states of Arizona, Colorado, Utah, and California. Sopapillas are very similar to Navajo fry bread, which is an important part of the Navajo tradition. Like its name suggests, Navajo fry bread is a fried quick bread made by Native American tribes in the Southwest."}, {"url": "http://whatscookingamerica.net/AmericanRegionalFoods/Southwest.htm", "passage_text": "Learn about the history and recipes of southwest cooking. Includes Mexican, New Mexican, Tex-Mex, and Cal-Mex Recipes. Back to the main American Regional Foods' Index (Recipes of favorite foods of America by regions). Southwest Region-Southwest American Cooking Arizona-New Mexico-Texas-Utah. This section of my web site is a celebration of one of the world's greatest cuisines-American Cuisine. It tells the story of what Americans eat and why."}, {"url": "http://www.mapsofworld.com/pages/mmmerica/united-states-of-mmmerica-cuisine-of-the-southwest/", "passage_text": "Influences later came from Mexico and the cowboys of the South, further altering the cuisine to become the cuisine it is today. New Mexican cuisine is one of the more popular styles of Southwestern cuisine, followed by Arizona’s cuisine, which is known as Sonoran. It is often said that the hotter the climate, the hotter the food, and Southwestern cuisine is no exception. Sopapillas are very similar to Navajo fry bread, which is an important part of the Navajo tradition. Like its name suggests, Navajo fry bread is a fried quick bread made by Native American tribes in the Southwest."}, {"url": "http://www.indians.org/articles/southwest-indians.html", "passage_text": "Southwest Indians. There are many American Indian tribes native to the Southwest of the United States. These tribes are located in Arizona, New Mexico, and Colorado (the southern section). There are five tribes from the Southwest: Apache, Hopi, Navajo, Pueblo, and Zuni"}]