[{"url": "http://www.engineeringtoolbox.com/modulus-rigidity-d_946.html", "passage_text": "Shear Modulus or Modulus of Rigidity is the coefficient of elasticity for a shearing or torsion force. Modulus of Rigidity-G - (or Shear Modulus) is the coefficient of elasticity for a shearing force. It is defined as the ratio of shear stress to the displacement per unit sample length (shear strain) . Modulus of Rigidity can be experimentally determined from the slope of a stress-strain curve created during tensile tests conducted on a sample of the material. Definition of Modulus of Rigidity: 1  The ratio of shear stress to the displacement per unit sample length (shear strain)"}, {"url": "https://en.wikipedia.org/wiki/Shear_modulus", "passage_text": "The shear modulus is one of several quantities for measuring the stiffness of materials. All of them arise in the generalized Hooke's law 1  : Young's modulus describes the material's response to uniaxial stress (like pulling on the ends of a wire or putting a weight on top of a column), Shear modulus' derived SI unit is the pascal (Pa), although it is usually expressed in gigapascals (GPa) or in thousands of pounds per square inch (ksi). Its dimensional form is M 1 L −1 T −2."}, {"url": "http://www.thefreedictionary.com/modulus+of+rigidity", "passage_text": "Noun. 1. modulus of rigidity-the coefficient of elasticity for a shearing force. coefficient of elasticity, elastic modulus, modulus of elasticity - (physics) the ratio of the applied stress to the change in shape of an elastic body. "}, {"url": "https://en.wikipedia.org/wiki/Shear_modulus", "passage_text": "In materials science, shear modulus or modulus of rigidity, denoted by G, or sometimes S or μ, is defined as the ratio of shear stress to the shear strain : where. Shear modulus' derived SI unit is the pascal (Pa), although it is usually expressed in gigapascals (GPa) or in thousands of pounds per square inch (ksi). Its dimensional form is M 1 L −1 T −2."}, {"url": "http://dictionary.reverso.net/english-definition/modulus%20of%20rigidity", "passage_text": "modulus of rigidity n a modulus of elasticity equal to the ratio of the tangential force per unit area to the resulting angular deformation., (Symbol) G. modulus of rigidity. n a modulus of elasticity equal to the ratio of the tangential force per unit area to the resulting angular deformation. modulus of elasticity. n the ratio of the stress applied to a body or substance to the resulting strain within the elastic limit, (Also called) elastic modulus See also → Young's modulus → bulk modulus → modulus of rigidity"}, {"url": "https://en.wikipedia.org/wiki/Elastic_modulus", "passage_text": "1 The shear modulus or modulus of rigidity 2  (. or) describes an object's tendency to shear (the deformation of shape at constant volume) when acted upon by opposing forces; it is defined as shear stress over shear strain. 1 Young's modulus 2  (. ) describes tensile elasticity, or the tendency of an object to deform along an axis when opposing forces are applied along that axis; it is defined as the ratio of tensile stress to tensile strain. 3  It is often referred to simply as the elastic modulus. 4  The shear modulus or modulus of rigidity (."}, {"url": "https://en.wikipedia.org/wiki/Young%27s_modulus", "passage_text": "Young's modulus, which is also known as the elastic modulus, is a mechanical property of linear elastic solid materials. It defines the relationship between stress (force per unit area) and strain (proportional deformation) in a material. Young's modulus is named after the 19th-century British scientist Thomas Young. Therefore, the Young's modulus is a measure of the stiffness of a solid material. Do not confuse: 1  stiffness and strength: the strength of material is the amount of force it can withstand and still recover its original shape;"}, {"url": "http://www.answers.com/Q/What_is_modulus_of_rigidity", "passage_text": "So, stress = k * strain [here, k is a constant] or, stress/strain= k Now, if the stress and strain occurs … due to axial force then k is known as modulus of elasticity and it is denoted by E. if the stress and strain occurs due to shear force then k is known as modulus of rigidity and it is denoted by G. The modulus of rigidity, G, is, for isotropic materials, related to E as. G = E/ (2(1+u)) where u = poisson ratio which varies from 0 to 0.5 and is usually 0.25-0.33 for many metals. tensile stress = Ee e = tensile strain. shear stress = Gk k = shear strain."}, {"url": "http://www.answers.com/Q/What_is_modulus_of_rigidity", "passage_text": "Just as the modulus of elasticity, E, relates tensile stress to tensile strain, the modulus of rigidity, G, relates shear stress to shear strain. The modulus of rigidity, G, is, for isotropic materials, related to E as. G = E/ (2(1+u)) where u = poisson ratio which varies from 0 to 0.5 and is usually 0.25-0.33 for many metals. tensile stress = Ee e = tensile strain. shear stress = Gk k = shear strain."}, {"url": "http://dictionary.reverso.net/english-definition/modulus%20of%20rigidity", "passage_text": "n another name for → modulus of elasticity. modulus of elasticity. n the ratio of the stress applied to a body or substance to the resulting strain within the elastic limit, (Also called) elastic modulus See also → Young's modulus → bulk modulus → modulus of rigidity. modulus of rigidity."}]