[{"url": "http://www.bbc.com/news/world-australia-32246077", "passage_text": "Image caption In New Zealand, Anzac Day tends to be commemorated in a reflective fashion. Anzac Day, 25 April, is probably Australia's most important national occasion. It marks the anniversary of the first campaign that led to major casualties for Australian and New Zealand forces during World War One and commemorates all the conflicts that followed. "}, {"url": "http://www.answers.com/Q/What_does_Anzac_Day_commemorate", "passage_text": "People do not celebrate ANZAC Day: they commemorate it. ANZAC Day was originally a day of remembrance for the Australian and New Zealand soldiers who landed at Gallipoli o … n the 25th of April, 1915. The day was originally a day of remembrance for the Australian and New Zealand soldiers who landed at Gallipoli on the 25th of April, 1915. The day commemorates the bravery and sacrifice of the thousands of men who died during the eight-month occupation of Gallipoli."}, {"url": "https://answers.yahoo.com/question/index?qid=1006041830183", "passage_text": "Best Answer: (m) Australia and New Zealand commemorate the ANZAC Day public holiday on the 25th of April every year to honour the bravery and sacrifice of the members of the Australian and New Zealand Army Corps (ANZAC), and of all those who served their country. "}, {"url": "https://en.wikipedia.org/wiki/Anzac_Day", "passage_text": "Anzac Day /ˈaenzaek/ ˈænzæk is a national day of remembrance In australia And New zealand that broadly commemorates All australians And New zealanders who served and died in all, wars, conflicts and peacekeeping operations and the contribution and suffering of all those who have.. served The date 25 April was officially named Anzac Day in 1916; in that year it was marked by a wide variety of ceremonies and services in Australia and New Zealand, including a commemorative march through London involving Australian and New Zealand troops."}, {"url": "http://www.army.gov.au/~/media/Files/Our%20history/AAHU/Focus%20on%20History/ANZACDaySpeech_ExService_3.pdf", "passage_text": "1 Serving our Nation www.army.gov.au ANZAC Day Speech This morning I would like to talk about three aspects of ANZAC day. • Why do we commemorate ANZAC day on the 25th April; • What the name of the day represents; and • The nature of the ANZAC legacy. To the date firstly.April 25 is of course the anniversary of the day Australian troops landed at Gallipoli in 1915. "}, {"url": "http://www.answers.com/Q/What_does_Anzac_Day_commemorate", "passage_text": "Anzac Day is a national pubic holiday in Australia and New Zealand, and is commemorated by both countries on 25 April every year to honour members of the Australian and New Zealand Army Corps (ANZAC) who fought at Gallipoli in Turkey during World War 1. The day was originally a day of remembrance for the Australian and New Zealand soldiers who landed at Gallipoli on the 25th of April, 1915. The day commemorates the bravery and sacrifice of the thousands of men who died during the eight-month occupation of Gallipoli."}, {"url": "http://www.answers.com/Q/What_does_Anzac_Day_commemorate", "passage_text": "ANZAC Day is named after the Australian and New Zealand Army Corps, who landed at Gallipoli on 25 April 1915, in World War I. Marked with a public holiday in Australia and N … ew Zealand, ANZAC Day commemorates the landing of the troops at Gallipoli on the Turkish Aegean coast, on 25 April 1915. The day was originally a day of remembrance for the Australian and New Zealand soldiers who landed at Gallipoli on the 25th of April, 1915. The day commemorates the bravery and sacrifice of the thousands of men who died during the eight-month occupation of Gallipoli."}, {"url": "http://www.timeanddate.com/holidays/australia/anzac-day", "passage_text": "ANZAC (Australian and New Zealand Army Corps) Day is the anniversary of the landing of troops from Australia and New Zealand on the Gallipoli Peninsula, Turkey, in World War I on April 25, 1915. ANZAC Day is also a public holiday and day of remembrance in New Zealand, the Cook Islands, Niue, Samoa and Tonga. It is also commemorated with special services and events on or around April 25 in a range of countries across the globe."}, {"url": "http://www.australia.gov.au/about-australia/australian-story/anzac-day", "passage_text": "Wreaths of red Flanders poppies are traditionally placed at memorials on ANZAC Day. On 25 April every year, Australians commemorate ANZAC Day. It commemorates the landing of Australian and New Zealand troops at Gallipoli on 25 April 1915. The date, 25 April, was officially named ANZAC Day in 1916. ANZAC stands for Australian and New Zealand Army Corps. 1 April 25, ANZAC Day, was the day the Australian and New Zealand Army Corps landed on the Gallipoli Peninsula in 1915. 2  The ANZACs were on the Gallipoli Peninsula for only 8 months, around 8,000 of them died there. 3  The ANZACs were all volunteers."}]