[{"url": "http://www.jobs.ac.uk/careers-advice/working-in-higher-education/1057/how-to-become-a-lecturer", "passage_text": "Let us take the question of teaching first. While doing your PhD you may have been offered the chance to do some teaching in your department on an hourly rate. A few universities discourage this, but most have realised that gaining teaching experience is important for future academics. Rather, they have to teach courses designed by others and do not have a say in how and what they teach. So if you do get the chance to develop skills in this area, do so, because it will really make you stand out from the crowd. Research experience needed. Your PhD will form the main basis of your research experience."}, {"url": "http://www.jobs.ac.uk/careers-advice/working-in-higher-education/1057/how-to-become-a-lecturer", "passage_text": "Most people take 3-4 years to do a PhD full time, so it is a sustained, detailed piece of independent research. After finishing their PhD most scholars turn immediately to having it published either as a book or a series of articles. This is also an essential step on the path to becoming a lecturer. You will not be expected to have published a great deal before your PhD is over, but once it is completed you need to build up this side of your CV straight away. Rather, they have to teach courses designed by others and do not have a say in how and what they teach. So if you do get the chance to develop skills in this area, do so, because it will really make you stand out from the crowd. Research experience needed. Your PhD will form the main basis of your research experience."}, {"url": "http://www.ehow.com/how_2069593_become-lecturer.html", "passage_text": "You will need a doctoral degree to work as a lecturer at four-year colleges and universities, though specialties such as fine arts may only require a master's. A doctoral degree, made up of master's and Ph.D., requires that you complete a bachelor's program and takes a few years. Part-time lecturers may be primarily focused on a professional career outside of academia or they may be freelancers who want to work full time, but in the meantime have part-time work to supplement their income. You can choose your path as a lecturer based on your career goals and aspirations."}, {"url": "http://www.excite.com/education/others/how-to-become-a-teacher", "passage_text": "A: To become a high school teacher, it is important that you get a minimum bachelor degree in education. This is the minimum education requirement for teaching careers. After completing a bachelor degree, you can apply for a teaching license in your state. Without a license, you cannot work as a professional teacher. A: If you want to become a teacher through online education, you can look to enroll in a four years bachelor's degree program in education. You can major in a field you want to teach to students."}, {"url": "http://www.ehow.com/how_2069593_become-lecturer.html", "passage_text": "Certification. To become a lecturer who prepares students for a job that requires registration, certification or licensing, you will likely have to have that same credential. For example, nursing teachers will probably need a nursing license. Part-time lecturers may be primarily focused on a professional career outside of academia or they may be freelancers who want to work full time, but in the meantime have part-time work to supplement their income. You can choose your path as a lecturer based on your career goals and aspirations."}, {"url": "http://www.ctc.ca.gov/credentials/teach.html", "passage_text": "How to Become a Teacher in California. I want to teach in elementary school. Individuals who want to teach in elementary school in California must earn a Multiple Subject Teaching Credential. Click here to see the various routes to earn the Multiple Subject Teaching Credential. I want to teach in high school. Individuals who want to teach in high school in California must earn a Single Subject Teaching Credential. Click here to see the various routes to earn the Single Subject Teaching Credential. I want to teach special education students."}, {"url": "http://www.jobs.ac.uk/careers-advice/working-in-higher-education/1057/how-to-become-a-lecturer", "passage_text": "If you wanted to become a lecturer fifty years ago, a post graduate qualification was not necessary, but the career has become so professionalized over the past few decades that now it is nearly impossible to get a permanent lectureship without having completed a PhD. Rather, they have to teach courses designed by others and do not have a say in how and what they teach. So if you do get the chance to develop skills in this area, do so, because it will really make you stand out from the crowd. Research experience needed. Your PhD will form the main basis of your research experience."}, {"url": "http://www.wikihow.com/Become-a-School-Teacher", "passage_text": "1. Graduate secondary/high school. You will need to at a minimum have a secondary/high school degree in order to get the further education necessary to become a teacher. In some countries, certain grades from these school years are necessary. In other words, the better you do, the better your chances"}, {"url": "http://www.ehow.com/how_2069593_become-lecturer.html", "passage_text": "Experience. To become a lecturer you don't necessarily need work experience, though health specialties or the arts usually require it. If your field is a science such as biology, you will work for two to three years as a research associate before teaching. Part-time lecturers may be primarily focused on a professional career outside of academia or they may be freelancers who want to work full time, but in the meantime have part-time work to supplement their income. You can choose your path as a lecturer based on your career goals and aspirations."}]