[{"url": "http://www.answers.com/Q/What_is_the_temperature_on_Venus", "passage_text": "The surface temperature on the planet Venus is almost uniform planet-wide, even at the poles and even at night. This is about 464°C (867°F). The heat is carried by convectio … n through its thick atmosphere, which blocks 60% of the sunlight but also prevents the surface from cooling by infrared radiation. It is this hot because it is the second planet from the sun, and has what scientists call a 'runaway greenhouse' effect. A thick layer of clouds (carbon dioxide and some sulphuric acid) covers the surface and traps infrared radiation, raising the surface temperature of the planet."}, {"url": "http://www.space.com/18526-venus-temperature.html", "passage_text": "The average temperature on Venus is 864 degrees Fahrenheit (462 degrees Celsius). Temperature changes slightly traveling through the atmosphere, growing cooler farther away from the surface. Lead would melt on the surface of the planet, where the temperature is around 872 F (467 C). Temperatures are cooler in the upper atmosphere, ranging from (minus 43 C) to (minus 173 C)."}, {"url": "http://zebu.uoregon.edu/disted/ph121/l13.html", "passage_text": "Atmosphere: The surface temperature of Venus is around 890 degrees F, the hottest average temperature in the Solar System. This is due to a runaway greenhouse effect. The atmosphere of Venus is composed of 97% CO2, 2% N2 and less than 1% of O2, H2O and CH4 (methane). Since CO2 is a major greenhouse gas, the radiation from the Sun is trapped in the atmosphere of Venus producing an extremely high surface temperature."}, {"url": "http://www.universetoday.com/14306/temperature-of-venus/", "passage_text": "But on Venus, the surface temperature is 460 degrees Celsius, day or night, at the poles or at the equator. Beyond its thick atmosphere, Venus’ axial tilt (aka. obliquity) plays a role in this temperature consistency. However, for all the characteristics these two planets have in common, average temperature is not one of them. Whereas the Earth has an average surface temperature of 14 degrees Celsius, the average temperature of Venus is 460 degrees Celsius. That is roughly 410 degrees hotter than the hottest deserts on our planet"}, {"url": "https://en.wikipedia.org/wiki/Venus", "passage_text": "Venus is a terrestrial planet and is sometimes called Earth's sister planet because of their similar size, mass, proximity to the Sun and bulk composition. It is radically different from Earth in other respects. It has the densest atmosphere of the four terrestrial planets, consisting of more than 96% carbon dioxide. Venus is the second planet from the Sun, orbiting it every 224.7 Earth days. It has no natural satellite. It is named after the Roman goddess of love and beauty. After the Moon, it is the brightest natural object in the night sky, reaching an apparent magnitude of −4.6, bright enough to cast shadows."}, {"url": "https://en.wikipedia.org/wiki/Venus", "passage_text": "This makes the Venusian surface hotter than Mercury 's, which has a minimum surface temperature of 55 K (−220 °C) and maximum surface temperature of 695 K (420 °C), even though Venus is nearly twice Mercury's distance from the Sun and thus receives only 25% of Mercury's solar irradiance. Venus is the second planet from the Sun, orbiting it every 224.7 Earth days. It has no natural satellite. It is named after the Roman goddess of love and beauty. After the Moon, it is the brightest natural object in the night sky, reaching an apparent magnitude of −4.6, bright enough to cast shadows."}, {"url": "http://www.universetoday.com/14306/temperature-of-venus/", "passage_text": "In addition, the surface temperature on Venus does not vary like it does here on Earth. On our planet, temperatures vary wildly due to the time of year and even more so based on the location on our planet. The hottest temperature ever recorded on Earth was 70.7°C in the Lut Desert of Iran in 2005. However, for all the characteristics these two planets have in common, average temperature is not one of them. Whereas the Earth has an average surface temperature of 14 degrees Celsius, the average temperature of Venus is 460 degrees Celsius. That is roughly 410 degrees hotter than the hottest deserts on our planet"}, {"url": "http://www.answers.com/Q/What_is_the_temperature_on_Venus", "passage_text": "The average temperature on Venus is about 464 °C (867°F). It is this hot because it is the second planet from the sun, and has what scientists call a 'runaway greenhouse' effect. A thick layer of clouds (carbon dioxide and some sulphuric acid) covers the surface and traps infrared radiation, raising the surface temperature of the planet."}, {"url": "https://en.wikipedia.org/wiki/Venus", "passage_text": "The atmospheric pressure at the planet's surface is 92 times that of Earth's. With a mean surface temperature of 735 K (462 °C; 863 °F), Venus is by far the hottest planet in the Solar System, even though Mercury is closer to the Sun. Venus is shrouded by an opaque layer of highly reflective clouds of sulfuric acid, preventing its surface from being seen from space in visible light. Venus is the second planet from the Sun, orbiting it every 224.7 Earth days. It has no natural satellite. It is named after the Roman goddess of love and beauty. After the Moon, it is the brightest natural object in the night sky, reaching an apparent magnitude of −4.6, bright enough to cast shadows."}]