[{"url": "http://www.ehealthme.com/ds/losartan/fatigue/", "passage_text": "Summary: Fatigue is found among people who take Losartan, especially for people who are female, 60+ old, have been taking the drug for 1 - 6 months, also take medication Losartan potassium, and have High blood pressure. We study 13,111 people who have side effects while taking Losartan from FDA and social media. More questions for: Losartan, Fatigue. You may be interested at these reviews (Write a review): 1  Arimidex and its side effects. 2  Been taking this for breast cancer now for 3 months."}, {"url": "http://www.ehealthme.com/ds/losartan/fatigue/", "passage_text": "Fatigue. Fatigue (feeling of tiredness) has been reported by people with multiple sclerosis, high blood pressure, depression, rheumatoid arthritis, osteoporosis. (latest reports from 201,270 Fatigue patients). On Oct, 2, 2015: 13,111 people reported to have side effects when taking Losartan. More questions for: Losartan, Fatigue. You may be interested at these reviews (Write a review): 1  Arimidex and its side effects. 2  Been taking this for breast cancer now for 3 months."}, {"url": "http://healthquestions.medhelp.org/losartan-and-fatigue", "passage_text": "Read More. As for the losartan and carvedilol, dizziness and fatigue are two common side effects of the medications. These side effects are often related to either low blood pressures or low heart rate but can often be relieved through adjustments in the dose and timing of the medications. Read More. My husband has severe shortness of breath on any exercise, fatigue, and difficult-to-control high blood pressure. His latest echocardiogram was stated to be normal by a cardiologist but showed a low E:A ratio of 0.74, E peak of 0.572, A peak of 0.711, IVRT 134, DT 250."}, {"url": "http://www.livestrong.com/article/288561-side-effects-of-losartan-potassium/", "passage_text": "Side Effects of Losartan Potassium. Lowering your blood pressure with medications may lead to side effects. Photo Credit Creative Crop/Digital Vision/Getty Images. There are a number of medicines on the market used to treat high blood pressure. Losartan, marketed under the brand, Cozaar, is one of those agents. Losartan may cause hypoglycemia -- low glucose levels -- in patients with type 2 diabetes. It occurs more frequently in those diabetic patients being treated for diabetic nephropathy. A pre-marketing study involving 1,513 patients revealed 14 percent of the participants experienced hypoglycemia"}, {"url": "http://www.everydayhealth.com/drugs/losartan", "passage_text": "Losartan, sold under the brand name Cozaar, is used to treat high blood pressure (hypertension). It's also used to lower the risk of stroke in some patients with heart disease. Losartan is an angiotensin receptor blocker (ARB) that blocks a substance that causes blood vessels to tighten. By relaxing blood vessels, losartan helps a person maintain a lower blood pressure, increasing the supply of oxygen and blood to the heart. Losartan is also used to slow long-term kidney damage for people with type 2 diabetes, and it is sometimes used to treat congestive heart failure."}, {"url": "http://www.livestrong.com/article/288561-side-effects-of-losartan-potassium/", "passage_text": "Losartan may cause fatigue. This side effect is commonly experienced by people being treated for diabetic nephropathy. In the RENAAL study -- a premarketing study -- 14 percent of the 1,513 participants reported feelings of fatigue. Patients taking Losartan for high blood pressure also report fatigue as a side effect. Losartan may cause hypoglycemia -- low glucose levels -- in patients with type 2 diabetes. It occurs more frequently in those diabetic patients being treated for diabetic nephropathy. A pre-marketing study involving 1,513 patients revealed 14 percent of the participants experienced hypoglycemia"}, {"url": "http://www.everydayhealth.com/drugs/losartan", "passage_text": "The common side effects with losartan are dizziness, headache, insomnia, muscle pain, cough, fatigue, orthostatic hypotension, and hypotension. Alcohol can cause dehydration and increase the risk for orthostatic hypotension which is a sudden drop in blood pressure upon arising from a sitting position. By relaxing blood vessels, losartan helps a person maintain a lower blood pressure, increasing the supply of oxygen and blood to the heart. Losartan is also used to slow long-term kidney damage for people with type 2 diabetes, and it is sometimes used to treat congestive heart failure."}]