[{"url": "http://www.gardenguides.com/116746-grow-hydrangeas-north-texas.html", "passage_text": "Overview. With big, showy flowers of blue, white or pink, hydrangeas catch the eye wherever they bloom. Hydrangeas can grow in North Texas; however, they require special attention to soil preparation and care to overcome the clay soil in most of the area. Hydrangeas bloom from May through early summer. The plants like morning sun, but need protection in the summer from North Texas' hot afternoon rays. Be sure the site is well-drained and has enough space for hydrangea plants--check the plant container's label to find out expected mature size since some hydrangeas can grow over 10 feet tall."}, {"url": "http://www.gardenguides.com/90377-hydrangeas-texas.html", "passage_text": "It does well in Texas because it grows well in shade or partial shade, and thrives on morning or late sun. Oakleaf hydrangea will even do well in a sunnier spot if it is watered well. White blooms appear in late May and June, the blooms will then turn a slight pinkish color. Blue Blooms. Acidic soil will produce blue blooms (also if you want your blue blooms to be bluer). To achieve a more acidic soil add sulfur or aluminum sulfate (around the plant). Apply 2 tablespoons to the soil, work it into the soil with your hand cultivator, and water well. This should be done in early fall."}, {"url": "http://www.dmagazine.com/publications/d-home/2005/may-june/creating-lush-hydrangeas-in-dallas/", "passage_text": "You cannot turn a pink hydrangea blue by adding acid to the soil. Adding acid will turn pink hydrangeas lavender, purple, (and even some shades of blue). If you want a true blue, add acid to the soil of a plant such as Nikko Blue. Adding acid regularly maintains color. "}, {"url": "http://www.gardenandflowers.com/list_7538277_hydrangeas-texas.html", "passage_text": "Hydrangeas in Texas. The growing conditions in Texas might not be ideal for the showy hydrangea shrubs that produce massive blue and pink blooms, but with a little bit of care, they can be made to feel at home in most parts of the state. Panicle hydrangea (Hydrangea paniculata), also sometimes called peegee hydrangea, is an Asian native that's hardy in USDA zones 3 to 8, so it's unlikely to do well in the hottest parts of south Texas. It will, however, grow successfully in other"}, {"url": "http://www.hydrangeashydrangeas.com/planting.html", "passage_text": "All hydrangeas will bloom and grow well in morning sun and afternoon shade. This is especially true of the commonly grown Hydrangea macrophylla. Macrophylla hydrangeas are the blue and pink mopheads and lacecaps. The further north one lives the more sun hydrangeas need and can withstand. PeeGee hydrangeas actually need at least 5 hours of sun per day to bloom well. The Oakleaf hydrangeas will also grow in sun or shade, but the blooms last longer if they get a little afternoon shade in hot climates. The leaves on the Oakleaf hydrangeas will color up best in the fall if they receive some sun."}, {"url": "http://www.gardenguides.com/90377-hydrangeas-texas.html", "passage_text": "Hydrangeas are an old garden favorite; they are popular due to their beautiful, large, blue, pink or white blossoms. These are showy deciduous shrubs that are used as specimen plantings in landscape design. The color of the blossoms (pink or blue), is a result of the pH of the soil, whether it is acidic or alkaline. Blue Blooms. Acidic soil will produce blue blooms (also if you want your blue blooms to be bluer). To achieve a more acidic soil add sulfur or aluminum sulfate (around the plant). Apply 2 tablespoons to the soil, work it into the soil with your hand cultivator, and water well. This should be done in early fall."}, {"url": "http://easttexasgardening.tamu.edu/2014/07/14/hydrangeas-5/", "passage_text": "It is best to root them in sand in a shaded area. Only the hydrangeas which naturally have pink flowers will bloom blue, and only if grown in acid soil. These lovely plants grow without difficulty in a wide variety of soils but prefer fairly rich, moist soil. They can grow in full sun if they are watered well, but they will bloom more freely in partial shade. The most common variety in our area is the French Hydrangea. Easy to grow in rich, moist soil, it has a large, mounding shape and can achieve heights of four feet in a year. The large foliage is dark green, but being deciduous, is gone in the winter."}, {"url": "http://www.star-telegram.com/living/article17958428.html", "passage_text": "In my own experiences, hydrangeas grow best where they receive morning sun (until 10 or so) and shade the balance of the day. In areas with black, alkaline soils, they should be planted much like azaleas. Dig a hole 15 to 18 inches deep and 3 feet wide for each plant. Remove all of the native soil. It’s pretty amazing what a difference 25 or 50 miles can make in the plants you can grow. Hydrangeas (Hydrangea macrophylla) are staples of East Texas landscaping, yet they play out as you drive west onto the Blackland Prairie soils here in North Central Texas."}]