[{"url": "http://www.livingin-canada.com/salaries-for-pharmacists.html", "passage_text": "According to the latest figures, the highest hourly average (median) wages are earned in Windsor / Sarnia, – Ontario at $57.15 per hour and the lowest average (median) wages are earned in Prince Edward Island at $43.94 per hour. A typical full-time annual salary for this occupation is in the region of $85,000 – $95,000. The table above details the hourly wages for Pharmacists. The Canadian national occupation classification code (NOC) for this role is 3131. Job titles and exact duties vary in this occupation. Examples of some job titles are: pharmacist, druggist, retail pharmacist and hospital pharmacist."}, {"url": "http://www.healthcare-salaries.com/allied-health-professionals/hospital-pharmacist-salary", "passage_text": "WowJobs says that that the average hospital pharmacist salary in Canada is CA$77,577 annually. The median rate shown in PayScale is CA$74,922 a year or a wage rate of CA$45 an hour. Regular pay is from CA$30.91 to CA$54.30 an hour. You may be offered to receive basic salaries of CA$43,998 to CA$101,861. Indeed says that the average hospital pharmacist in US is $93,000 per annum. Compare these number with general pharmacist salary, clinical pharmacist salary or pharmacologist salary in USA, Canada or UK."}, {"url": "http://www.healthcare-salaries.com/allied-health-professionals/hospital-pharmacist-salary", "passage_text": "Indeed shows these average hospital pharmacist salaries in some of the states in US: California at $100,000; New York at $113,000; Minnesota at $82,000; New Jersey at $101,000; Washington, DC at $116,000; Texas at $91,000; Illinois at $106,000; Florida at $87,000; and Arkansas at $93,000. Indeed says that the average hospital pharmacist in US is $93,000 per annum. Compare these number with general pharmacist salary, clinical pharmacist salary or pharmacologist salary in USA, Canada or UK."}, {"url": "http://www.payscale.com/research/US/Job=Hospital_Pharmacist/Hourly_Rate", "passage_text": "(United States). Hospital Pharmacists in the United States take home an average $51.85 per hour. The income range spans the entire spectrum between $43.60 per hour and $61.12. Job satisfaction for Hospital Pharmacists is high. "}, {"url": "http://www.healthcare-salaries.com/allied-health-professionals/hospital-pharmacist-salary", "passage_text": "Hospital pharmacist salary in USA. According to Indeed, hospital pharmacists are earning an average salary of $93,000 a year. PayScale in comparison shows a median hospital salary of $100,912 per annum or an equivalent wage rate of $51 an hour. Indeed says that the average hospital pharmacist in US is $93,000 per annum. Compare these number with general pharmacist salary, clinical pharmacist salary or pharmacologist salary in USA, Canada or UK."}, {"url": "http://www.indeed.com/salary/q-Pharmacist-l-Canada,-KY.html", "passage_text": "$41,000. Average Pharmacist salaries for job postings in Canada, KY are 5% higher than average Pharmacist salaries for job postings nationwide."}, {"url": "http://www.theglobeandmail.com/report-on-business/careers/career-advice/life-at-work/i-want-to-be-a-pharmacist-what-will-my-salary-be/article18131031/", "passage_text": "Job: Pharmacist. Salary: The average salary is $80,000 to $95,000 a year, depending on province and the size of the community where the pharmacist works. Education: To become a licensed pharmacist in Canada, you need a bachelor’s or doctor of pharmacy degree from one of 10"}, {"url": "http://www.payscale.com/research/CA/Job=Pharmacist/Hourly_Rate", "passage_text": "Pharmacist Salary. (Canada). The average wage for a Pharmacist is C$44.95 per hour. Most people move on to other jobs if they have more than 20 years' experience in this career. Pay for this job does not change much by experience, with the most experienced earning only a bit more than the least"}, {"url": "http://www.healthcare-salaries.com/allied-health-professionals/pharmacist-salary", "passage_text": "Pharmacist working in the US with less than 1 year of experience collects an average salary between $49,660 and $117,962 per annum while a pharmacist practicing for 1 to 5 years of experience receives an average salary from $61,118 -to $127,708 per annum. The annual average pharmacist salary in the US according to the Bureau of Labor Statistics is $111,570. This is equal to the hourly rate of $53.64. The organization predicts that the number of employees for this type of job from 2010 to 2020 will increase by 25%, where 68,700 new jobs will be created."}, {"url": "http://www.indeed.com/salary/q-Pharmacist-l-Ontario,-CA.html", "passage_text": "$35,000. Average Pharmacist salaries for job postings in Ontario, CA are 11% lower than average Pharmacist salaries for job postings nationwide."}]