[{"url": "http://www.caahep.org/Content.aspx?ID=42", "passage_text": "Length. The kinesiotherapy program is 4 to 5 years. The total minimum requirements are 128 semester hours. Minimum requirements for years 1 and 2 are 59 semester hours and for years 3 and 4 are 67 semester hours. Prerequisites. The Scope of Practice for Kinesiotherapy identifies the job tasks that registered kinesiotherapists are qualified to perform. This document reflects the evaluation procedures and treatment interventions for medically stable individuals who need extended physical conditioning."}, {"url": "http://www.caahep.org/Content.aspx?ID=42", "passage_text": "Job Description. Kinesiotherapy is the application of scientifically based exercise principles adapted to enhance the strength, endurance, and mobility of individuals with functional limitations or those requiring extended physical conditioning. The Scope of Practice for Kinesiotherapy identifies the job tasks that registered kinesiotherapists are qualified to perform. This document reflects the evaluation procedures and treatment interventions for medically stable individuals who need"}, {"url": "http://akta.org/", "passage_text": "Kinesiotherapy is defined as the application of scientifically based exercise principles adapted to enhance the strength, endurance, and mobility of individuals with functional limitations or those requiring extended physical conditioning. "}, {"url": "http://study.com/articles/Kinesiotherapy_vs_Physical_Therapy_Whats_the_Difference.html", "passage_text": "Kinesiotherapy Vs. Kinesiotherapy and physical therapy are similar fields; both deal with the treatment of patients who have suffered from a physical injury or illness. Aspiring kinesiotherapists may enroll in kinesiotherapy bachelor's programs, while prospective physical therapists are expected to earn a master's or doctoral degree in physical therapy. Accredited training programs in kinesiotherapy are not as widely available as accredited physical therapy degree programs."}, {"url": "http://learn.org/articles/Kinesiotherapy_Certification_and_Degree_Program_FAQs.html", "passage_text": "Kinesiotherapy is the practice of using exercise science to help patients recover physically and psychologically from injury or illness. "}, {"url": "http://learn.org/multimedia/What_Does_a_Kinesiotherapist_Do_-_Video.html", "passage_text": "- Video. A Kinesiotherapist has a bachelor's degree in kinesiology, kinesiotherapy or similar subject. They work to rehabilitate those who need to enhance their strength and endurance. Job Description. Kinesiotherapists work with those who need rehabilitation with movement and strength. How to Become a Kinesiotherapist in 5 Steps. 1  The field of kinesiotherapy combines the study of human movement with healthcare. 2  Learn what you'd do as a kinesiotherapist, and read about bachelor's degree programs, internships and registration for kinesiotherapists."}, {"url": "http://www.healthpronet.org/ahp_month/07_08.html", "passage_text": "Kinesiotherapy What is Kinesiotherapy? Kinesiotherapy is defined as the application of scientifically based exercise principles adapted to enhance the strength, endurance, and mobility of individuals with functional limitations or those requiring extended physical conditioning. Kinesiotherapy programs are accredited by the Commission of Accreditation of Allied Health Education Programs (CAAHEP) and Kinesiotherapists conform to specific criteria for ethical, safe treatment of patients within the Scope of Practice and Standards of Practice for Kinesiotherapy."}, {"url": "http://study.com/articles/Kinesiotherapy_vs_Physical_Therapy_Whats_the_Difference.html", "passage_text": "Kinesiotherapy Overview. Kinesiotherapy is used to improve a person's endurance, mobility and strength. The rehabilitation techniques used by kinesiotherapists are often prescribed to help individuals enhance their overall physical conditioning. Aspiring kinesiotherapists may enroll in kinesiotherapy bachelor's programs, while prospective physical therapists are expected to earn a master's or doctoral degree in physical therapy. Accredited training programs in kinesiotherapy are not as widely available as accredited physical therapy degree programs."}, {"url": "http://medical-dictionary.thefreedictionary.com/kinesiotherapy", "passage_text": "kinesiotherapy, a specialized area of medicine in which exercise and movement are used as the primary form of rehabilitation. It is typically used in the treatment of amputees. See also kinesiotherapist. "}, {"url": "http://www.healthpronet.org/ahp_month/07_08.html", "passage_text": "The Kinesiotherapy major is a baccalaureate program that can be completed in 4-5 years. The total minimum requirements are 124-128 semester hours. The program has a comprehensive academic and clinical curriculum plan that fulfills or exceeds the minimum requirements for Kinesiotherapy accreditation. Kinesiotherapy programs are accredited by the Commission of Accreditation of Allied Health Education Programs (CAAHEP) and Kinesiotherapists conform to specific criteria for ethical, safe treatment of patients within the Scope of Practice and Standards of Practice for Kinesiotherapy."}]