[{"url": "http://medical-dictionary.thefreedictionary.com/bone+lacuna", "passage_text": "any of the small cavities within the cartilage matrix, containing a chondrocyte. Howship's lacuna. the concave cavities which are formed by osteoclasts in the process of bone resorption. osseous lacuna. bone lacuna (see above). lacuna, absorption (Howship's lacuna), n an area (pit) of bone resorption, usually irregular in outline, and often containing osteoclasts."}, {"url": "http://medical-dictionary.thefreedictionary.com/lacuna", "passage_text": "bone lacuna a small cavity within the bone matrix, containing an osteocyte; from it slender canaliculi radiate and penetrate the adjacent lamellae to anastomose with the canaliculi of neighboring lacunae, thus forming a system of cavities interconnected by minute canals. Howship's lacuna. the concave cavities which are formed by osteoclasts in the process of bone resorption. osseous lacuna. bone lacuna (see above). osteocytic lacuna. see bone lacuna (above)."}, {"url": "http://www.merriam-webster.com/dictionary/lacuna", "passage_text": "Medical Definition of LACUNA. : a small cavity, pit, or discontinuity in an anatomical structure: as a: one of the follicles in the mucous membrane of the urethra b: one of the minute cavities in bone or cartilage occupied by the osteocytes. — la·cu·nar \\-ˈk(y)ue-ü\\ nər. adjective Full Definition of LACUNA. 1. 2. : a small cavity, pit, or discontinuity in an anatomical structure. — la·cu·nar \\-ˈkue-ˈkü, -nər-\\ ˈkyue ˈkyü·also·la \\cu-nate-lə, -ˈkue-, -ˈkü; nət-ˈkyue-ˈkyü\\ ˌnāt. ˈla kyə ˌnāt adjective See-lacuna defined. FOR. english language learners advertisement"}, {"url": "http://www.answers.com/Q/What_is_lacunae_in_bone", "passage_text": "Hope u know this. Medically: Bone Lacuna is a small cavity within the bone matrix containing an osteocyte and from which slender canaliculi radiate and penetrate the adjacent lamellae to anastomose with the canaliculi of neighbouring lacunae, thus forming a system of cavities interconnected by minute canals. "}, {"url": "http://medical-dictionary.thefreedictionary.com/lacuna", "passage_text": "cartilage lacuna any of the small cavities within the cartilage matrix, containing a chondrocyte. Howship's lacuna resorption lacuna. intervillous lacuna one of the spaces of the placenta occupied by maternal blood, into which the fetal villi project. Howship's lacuna. the concave cavities which are formed by osteoclasts in the process of bone resorption. osseous lacuna. bone lacuna (see above). osteocytic lacuna. see bone lacuna (above)."}, {"url": "http://medical-dictionary.thefreedictionary.com/bone+lacuna", "passage_text": "bone lacuna a small cavity within the bone matrix, containing an osteocyte; from it slender canaliculi radiate and penetrate the adjacent lamellae to anastomose with the canaliculi of neighboring lacunae, thus forming a system of cavities interconnected by minute canals. lacuna, absorption (Howship's lacuna), n an area (pit) of bone resorption, usually irregular in outline, and often containing osteoclasts."}, {"url": "https://en.wikipedia.org/wiki/Lacuna_(histology)", "passage_text": "In histology, a lacuna is a small space containing an osteocyte in bone or chondrocyte in cartilage. In an ordinary microscopic section, viewed by transmitted light, they appear as fusiform opaque spots. Each lacuna is occupied during life by a branched cell, termed an osteocyte, bone-cell or bone-corpuscle."}, {"url": "http://medical-dictionary.thefreedictionary.com/lacuna", "passage_text": "bone lacuna a small cavity within the bone matrix, containing an osteocyte, and from which slender canaliculi radiate and penetrate the adjacent lamellae to anastomose with the canaliculi of neighboring lacunae, thus forming a system of cavities interconnected by minute canals. Howship's lacuna. the concave cavities which are formed by osteoclasts in the process of bone resorption. osseous lacuna. bone lacuna (see above). osteocytic lacuna. see bone lacuna (above)."}, {"url": "http://medical-dictionary.thefreedictionary.com/lacuna", "passage_text": "cartilage lacuna any of the small cavities within the cartilage matrix, containing a chondrocyte. Howship's lacuna resorption l. intervillous lacuna one of the blood spaces of the placenta in which the fetal villi are found. Howship's lacuna. the concave cavities which are formed by osteoclasts in the process of bone resorption. osseous lacuna. bone lacuna (see above). osteocytic lacuna. see bone lacuna (above)."}, {"url": "https://en.wikipedia.org/wiki/Lacuna_(histology)", "passage_text": "The Lacunae are situated between the lamellae, and consist of a number of oblong spaces. In an ordinary microscopic section, viewed by transmitted light, they appear as fusiform opaque spots. Each lacuna is occupied during life by a branched cell, termed an osteocyte, bone-cell or bone-corpuscle. Lacunae are connected to one another by small canals called canaliculi"}]