[{"url": "http://www.thequantumpulse.com/how_it_works.htm", "passage_text": "The QuantumPulse uses a multi-wave oscillator and spectrum tubes containing noble and other gases to create frequencies that fall between the infrared and ultraviolet spectrum range. It also uses a coil to create high voltage and a subtle electromagnetic field. This combination produces biophotonic light. The new patented tuning capacitor sits atop the machine and produces alpha waves. The QuantumPulse produces a 90° phase shift between electrical and electromagnetic fields. The base of the machine is constructed of materials which block electrical fields, but allow electromagnetic fields to flow."}, {"url": "http://fitnessential.co/the-quantum-pulse/", "passage_text": "An electromedicine device which has had very, very good results treating Multiple Sclerosis is called the “Quantum Pulse.” Older versions of the device were called the “Vibe Machine.” The two machines are identical in function so it doesn’t matter which device you use. Warning About the Quantum Pulse Cost. Some people can afford to buy one of these machines (about $20,000), but it is far better to find someone who already has one to see how effective it will be."}, {"url": "http://atriumhealthspa.com/spa/qp.php", "passage_text": "We believe the Quantum pulse can promote and support general well-being. The Quantum pulse uses a multi-wave oscillator and spectrum tubes containing noble and other gases to create frequencies that fall between the infrared and ultraviolet spectrum range. It is, in fact, an entity related to both energy and momentum of elementary particles and of photons. 1  Quantum Pulse Benefits: 2  We believe that using the Quantum Pulse on a regular basis can help promote and support a feeling of general well being, inner peace and calm."}, {"url": "http://www.biocharger.com/product-comparison/", "passage_text": "The new 2012 Biocharger is more powerful, made better, properly tuned so it requires no maintenance and is about half the price of the Quantum Pulse. If you do an honest comparison, you will see the Biocharger is a MUCH better machine for $8000 LESS. Plus the Biocharger has a wider spectrum of frequencies and offers a new pulsing function found on no other machine. Note: The Biocharger is not intended for use in the diagnosis of disease or other conditions, or in the cure, mitigation, treatment, or prevention of disease, in man or other animals."}, {"url": "http://www.biocharger.com/product-comparison/", "passage_text": "It is a decent copy but it lacks the quality, voltage and features of the new Biocharger. The new Quantum Pulse is the new name of the VIBE machine and it is basically the same machine with a new name. There are definite problems with the Quantum Pulse because of its incomplete circuitry. It is a detuned unit with no adjustable spark gap and has only two settings. Because of this you won’t reach voltages of over 200,000 volts so it will not effectively inactivate pathogens, viruses, bacteria, and parasites. Plus the Biocharger has a wider spectrum of frequencies and offers a new pulsing function found on no other machine. Note: The Biocharger is not intended for use in the diagnosis of disease or other conditions, or in the cure, mitigation, treatment, or prevention of disease, in man or other animals."}, {"url": "http://atriumhealthspa.com/spa/qp.php", "passage_text": "1 We offer the Quantum Pulse Machine on a donation basis (Paid sessions in other spas range from $15.00 to $30.00). It is, in fact, an entity related to both energy and momentum of elementary particles and of photons. 1  Quantum Pulse Benefits: 2  We believe that using the Quantum Pulse on a regular basis can help promote and support a feeling of general well being, inner peace and calm."}, {"url": "http://watsu1.snappages.com/quantum-pulse-testimonials", "passage_text": "I had 4 minutes in front of the Quantum Pulse machine and I immediately began to get feeling in my foot again for the first time in years. The first session, the floater in my eye disappeared. That night I had a huge human waste discharge. The next day my bowels were normal. Symptoms: High concentration of heavy metals in system. Testimonial: After two months of Quantum Pulse sessions I had a blood test that showed the concentration of heavy metals in my system had decreased by 75%. I have made no other changes in my diet or taken any treatment."}, {"url": "http://www.vibemachine.org/", "passage_text": "When it comes to the new generation of Multi-Wave Oscillator (MWO) devices or Subtle Energy Revitalization Platforms (SERP), there are many choices and many opinions on which is the right machine to use. I have tried FIVE different models ranging from $8100 all the way up to $38,000. "}, {"url": "http://atriumhealthspa.com/spa/qp.php", "passage_text": "1 Quantum Pulse Benefits: 2  We believe that using the Quantum Pulse on a regular basis can help promote and support a feeling of general well being, inner peace and calm. 3  We offer the Quantum Pulse Machine on a donation basis (Paid sessions in other spas range from $15.00 to $30.00). It is, in fact, an entity related to both energy and momentum of elementary particles and of photons. 1 "}, {"url": "http://atriumhealthspa.com/spa/qp.php", "passage_text": "1 We believe that using the Quantum Pulse on a regular basis can help promote and support a feeling of general well being, inner peace and calm. 2  We offer the Quantum Pulse Machine on a donation basis (Paid sessions in other spas range from $15.00 to $30.00). It is, in fact, an entity related to both energy and momentum of elementary particles and of photons. 1  Quantum Pulse Benefits: 2 "}]