[{"url": "http://www.cheapcaribbean.com/deals/grand-riviera-princess-all-suites-resort-spa-deals.html", "passage_text": "Amon ... More Give your family a break and head for Grand Riviera Princess All Suites Resort & Spa where 13 is your lucky number. Among other perks, 13 dining options feature chefs who take care of the work while you take care of yourself."}, {"url": "http://www.wyndham.com/hotels/mexico/playa-del-carmen/viva-wyndham-maya-an-all-inclusive-resort/hotel-overview", "passage_text": "With the capacity to accommodate up to 260 guests as well as state-of-the-art AV equipment, the Viva Wyndham Maya All-Inclusive Resort is the perfect place to work, and play. The premier beachside location also makes Viva Wyndham Maya ideal for beach weddings, receptions and vow renewals. Ancient History Meets Laid-Back Coastal Living in Quintana Roo, Mexico Near Playa del Carmen and Riviera Maya. Golfers of all skill levels will enjoy teeing off along the shores of the Mayan Riviera at the world-class Playcar Golf Course. Viva Wyndham Maya is only 35 miles from the Cancun International Airport, with convenient airport shuttle services available for an additional fee."}, {"url": "http://bookit.com/mexico/playa-del-carmen/hotels/grand-sunset-princess-all-suites-resort-all-inclusive/", "passage_text": "The Grand Sunset Princess is located in the Riviera Maya approximately 4 Miles / 7 Kilometers away from downtown Playa del Carmen and 37 miles / 60 Kilometers south of Cancun. Me and my fiance fiancé stayed at The Grand Sunset princess From sept 4th to the. 9th the shuttle from the airport to the resort was fast and. Fun once we arrived to the resort there was someone there waiting to take our. Bags we were then greeted with champagne and a cold towel and given a tour of our room which was. amazing"}, {"url": "http://www.wyndham.com/hotels/mexico/playa-del-carmen/viva-wyndham-maya-an-all-inclusive-resort/hotel-overview", "passage_text": "Viva Wyndham Maya-Best Of Riviera Maya Hotels. Located on the spectacular shores of Riviera Maya, Mexico, near Playa del Carmen, Viva Wyndham Maya is an unforgettable, all-inclusive vacation resort for those seeking memorable leisure, business and romantic getaways. Golfers of all skill levels will enjoy teeing off along the shores of the Mayan Riviera at the world-class Playcar Golf Course. Viva Wyndham Maya is only 35 miles from the Cancun International Airport, with convenient airport shuttle services available for an additional fee."}, {"url": "http://www.wyndham.com/hotels/mexico/playa-del-carmen/viva-wyndham-azteca-an-all-inclusive-resort/hotel-overview", "passage_text": "Looking for the Best Hotels in Playa Del Carmen: Viva Wyndham Azteca, Riviera Maya. Experience the shimmering shores of Playa del Carmen in Riviera Maya Mexico at Viva Wyndham Azteca, the best of hotels in Playacar. Here, golden sunsets, white sandy beaches and lightly swaying palm trees abound, creating a vacation destination that is truly unforgettable. Located on a private beach in a former fishing village, Viva Wyndham Azteca features an array of onsite activities, stunning ocean and garden view guest rooms and suites, and easy access to the scenic attractions of the Yucatan Peninsula giving you the best of hotels in"}, {"url": "http://bookit.com/mexico/playa-del-carmen/hotels/grand-sunset-princess-all-suites-resort-all-inclusive/", "passage_text": "Take the highway to Playa del Carmen south for approximately 52 km or 32 mi. See for Resorts sign. The Grand Sunset Princess is located next to Playa del Carmen, 52 km from Cancun, and to a similar distance of the Mayan archaeological zone of Tulum. Me and my fiance fiancé stayed at The Grand Sunset princess From sept 4th to the. 9th the shuttle from the airport to the resort was fast and. Fun once we arrived to the resort there was someone there waiting to take our. Bags we were then greeted with champagne and a cold towel and given a tour of our room which was. amazing"}, {"url": "https://www.sunshine.co.uk/hotels/Grand_Sunset_Princess_Hotel-5939.html", "passage_text": "It is located in the Riviera Maya, approx 10 minutes from Playa del Carmen and the ferry dock to Cozumel. Directly on the beach with loungers, parasols and watersports available to enjoy. Cancun International Airport is approx 50km from Grand Sunset Princess Hotel. "}, {"url": "http://www.cancuntransfers.com/riviera_maya_hotelsmap.php?id=238", "passage_text": "Grand Sunset Princess. Distance from the Cancun airport: 50 minutes. The Princess Hotels & Resorts hotel chain is introducing their first brand new Grand Sunset Princess All Suites Resort & Spa in the Mayan Riviera. Specialists in the holiday sector where Princess is known for their large spacious swimming pools, Princess Spa environment, and their dynamic and functional ambiances. If you wish to go from the Cancun airport to the Grand Sunset Princess we can take you over there, we know exactly were it is located. We are specialists in quality transportation services in Cancun and T"}, {"url": "http://www.applevacations.com/hotels/grand-sunset-princess-all-suite-resort.html", "passage_text": "Fine dining is plentiful at Grand Sunset Princess All suites Resort & Spa. Seven a la carte restaurants feature Mexican, Italian, Asian, seafood, and more, along with two plentiful buffets. Perfect your swing with a game of tennis, or work out in the fully equipped fitness center. I stayed in Mexico in May other hotel and it was really bad the grand princess is 100/% better well done to the beach men. The restaurants are all good I did not like the Swiss one but mite be just me. Steak one good went 3 times. I preferred the smaller restaurants rather then the large ones."}, {"url": "http://www.wyndham.com/hotels/mexico/playa-del-carmen/viva-wyndham-maya-an-all-inclusive-resort/hotel-overview", "passage_text": "Surrounded by ancient ruins, pristine beaches, and incredible scenic views, Viva Wyndham Maya is truly in the heart of it all. Our spectacular location marks us as the best of hotels in Riviera Maya and Playa del Carmen. Golfers of all skill levels will enjoy teeing off along the shores of the Mayan Riviera at the world-class Playcar Golf Course. Viva Wyndham Maya is only 35 miles from the Cancun International Airport, with convenient airport shuttle services available for an additional fee."}]