[{"url": "http://www.virtualvenuevisit.com/venue/twickenham-stadium", "passage_text": "Twickenham Stadium. Twickenham Stadium, the home of England rugby, is a spectacular 82,000 seat stadium and the largest venue in the world dedicated entirely to rugby union."}, {"url": "http://www.sirgo.com/twickenham-stadium.aspx", "passage_text": "Twickenham is the largest stadium in the world that is entirely devoted to rugby union, and is considered one of the most iconic arenas in sports. The stadium hosts the biggest events in rugby union, including the Premiership final and European cup matches."}, {"url": "https://en.wikipedia.org/wiki/Twickenham_Stadium", "passage_text": "Twickenham is often referred to as the home of rugby union. The stadium, owned and operated by the RFU, hosts rugby union fixtures year round. It is the home of the English rugby union team, who play nearly all their home games at the stadium."}, {"url": "http://www.rugbygroundguide.com/twickenham.html", "passage_text": "England-Twickenham Stadium. As the sport of Rugby Union was born in England, it is no surprise that they took part in the first ever international fixture in 1871, with a defeat to Scotland in Edinburgh."}, {"url": "http://www.englandrugby.com/twickenham/", "passage_text": "Seating an impressive 82,000 spectators, Twickenham is the largest dedicated rugby union venue in the world. It's hard to believe that this historic venue began life as a humble cabbage patch, but that's exactly what it was before the RFU purchased the land for just over £5,500 in 1907."}, {"url": "http://www.englandrugby.com/twickenham/", "passage_text": "Easily accessible by road, air, train and foot, Twickenham truly is a stadium for the people. During matches, we pride ourselves on our sporting atmosphere, where the most ardent of rugby fans sit happily alongside families and children."}, {"url": "https://en.wikipedia.org/wiki/Twickenham_Stadium", "passage_text": "Twickenham Stadium (/ˈtwɪkənəm/ ; usually known as Twickenham or Twickers) is a stadium in Twickenham, south west London, England."}, {"url": "http://www.englandrugbytravel.com/stadium-guide/twickenham/", "passage_text": "Twickenham Stadium. The Rugby Football Union (RFU) purchased the land where Twickenham Stadium stands for just over £5,500 in 1907. Before the ground was bought, it was actually used to grow cabbages, and so Twickenham Stadium is affectionately known as the 'Cabbage Patch'."}, {"url": "http://www.visitlondon.com/things-to-do/place/1868030-twickenham-stadium", "passage_text": "About. The home to the Rugby Football Union, Twickenham Stadium hosts international matches for the England national team, club rugby matches and a range of events such as music concerts. The World of Rugby Museum is located within the stadium, which is located in South West London."}]