[{"url": "https://en.wikipedia.org/wiki/Neoprene", "passage_text": "Production [edit]. Neoprene is produced by free-radical polymerization of chloroprene. In commercial production, this polymer is prepared by free radical emulsion polymerization. Polymerization is initiated using potassium persulfate."}, {"url": "https://en.wikipedia.org/wiki/Neoprene", "passage_text": "Neoprene or polychloroprene is a family of synthetic rubbers that are produced by polymerization of chloroprene. Neoprene exhibits good chemical stability and maintains flexibility over a wide temperature range. Neoprene is produced by free-radical polymerization of chloroprene. In commercial production, this polymer is prepared by free radical emulsion polymerization. Polymerization is initiated using potassium persulfate."}, {"url": "http://www.merriam-webster.com/dictionary/neoprene", "passage_text": "Definition of NEOPRENE. : a synthetic rubber made by the polymerization of chloroprene, characterized by superior resistance (as to oils), and used especially for special-purpose clothing (as gloves and wet suits). See neoprene defined for kids. ADVERTISEMENT."}, {"url": "https://en.wikipedia.org/wiki/Neoprene", "passage_text": "A neck seal, wrist seal, manual vent, inflator, zip and fabric of a neoprene dry suit. Here the soft thin rubber-like seal material at neck and wrists is made from non-foam neoprene for elasticity; the blue area is a thin blue knit fabric laminated onto spongy foamed neoprene for insulation. Neoprene is produced by free-radical polymerization of chloroprene. In commercial production, this polymer is prepared by free radical emulsion polymerization. Polymerization is initiated using potassium persulfate."}, {"url": "http://support.coverking.com/hc/en-us/articles/204646140-What-s-the-difference-between-CR-Grade-Neoprene-and-Neosupreme-", "passage_text": "The fact is, many so called waterproof or neoprene seat covers are actually made from a fabric called neotex or “neosupreme” which is used in some, or all the panels of their seat covers. These type of seat covers are not CR-Grade Neoprene. "}, {"url": "http://www.seventhwave.co.nz/wetsuits101/neoprene+info.html", "passage_text": "In other words, neoprene is made through a chemical reaction using chloroprene. It is chloroprene that binds all the molecules of this reaction together, leaving us with polychloroprene chips. These chips are melted and mixed together with foaming agents and carbon pigments, and then baked in an oven to make it expand. In technical terms neoprene is a type of polymer (a large molecule composed of repeating structural units) known as polychloroprene that is produced by the polymerization (chemical reaction) of chloroprene (an organic compound of colourless liquid with the formula CH2=CCl-CH=CH2)."}, {"url": "http://www.ehow.com/about_6587118_neoprene-made_.html", "passage_text": "Processing. Neoprene begins as polychloroprene which is a powder, other ingredients are added that provide cell size, adhesion, foaming agents, bulk, color and other properties according to Machovec. Put into a heat press after it is made into a doughy mixture, the heat and pressure form a sheet"}, {"url": "http://machovec.com/ice_rescue/neoprene.htm", "passage_text": "How Neoprene is Made. Neoprene is often referred to as 'rubber' but it is actually plastic. It begins as a powder called polychloroprene. To this base are added other ingredients that provide elasticity, foaming agents, cell size, color, adhesion, bulk, plus other properties. This mixture is made into a dough which is put into a heat press. INSIDE Neoprene. Neoprene is a modern miracle! There is no other fabric with all these qualities: it stretches, it's waterproof, it can be stitched or glued, it comes in a multitude of colors, it provides an insulating layer in wet environments, it's abrasion resistant and it is relatively inexpensive."}, {"url": "http://www.wisegeek.com/what-is-neoprene-rubber.htm", "passage_text": "There are different types of neoprene available, some are made from natural rubber and some made from synthetic rubber. The neoprene made from natural rubber will contain the latex protein that people can be allergic too. There are other issues with allergies relating to the materials used on the neoprene. Neoprene rubber knee brace. Surfer wearing a neoprene rubber wetsuit. Many commercially available wetsuits are made of neoprene rubber. Neoprene rubber may be used to make protective gloves."}]