[{"url": "http://www.mikrotik-routeros.net/routeros.aspx", "passage_text": "MikroTik RouterOS is the operating system of MikroTik RouterBOARD hardware. It can also be installed on a PC and will turn it into a router with all the necessary features-firewall, routing, wireless access point, bandwidth management, hotspot gateway, backhaul link, VPN server and more. It can also be installed on a PC and will turn it into a router with all the necessary features-routing, firewall, bandwidth management, wireless access point, backhaul link, hotspot gateway"}, {"url": "http://www.mikrotik.com/", "passage_text": "Please see more details here on our training portal. Made for Mikrotik. Find cases, accessories and product solutions based on Mikrotik products, or made for use with RouterOS and RouterBOARD in our Made for MikroTik section of this webpage. Look for the Powered by Mikrotik logo at our distributors, to see that the device was made to work with our products. "}, {"url": "http://www.mikrotik-routeros.net/routeros.aspx", "passage_text": "Web proxy. Tools. MikroTik RouterOS is the operating system of MikroTik RouterBOARD hardware. It can also be installed on a PC and will turn it into a router with all the necessary features-routing, firewall, bandwidth management, wireless access point, backhaul link, hotspot gateway, VPN server and more."}, {"url": "https://en.wikipedia.org/wiki/MikroTik", "passage_text": "Mikrotīkls Ltd. , known internationally as MikroTik, is a Latvian manufacturer of computer networking equipment. It sells wireless products and routers. The company was founded in 1995, with the intent to sell in the emerging wireless technology market. As of 2014, the company has more than 100 employees. The company's products are known for being low-priced alternatives to expensive routers and Ethernet radio relay lines. MikroTik routers and their operating system were chosen because of their low cost, flexibility, the fact that the system already had a substantial user base in Mali, and had a user interface deemed superior to other products."}, {"url": "http://www.mikrotik-routeros.net/routeros.aspx", "passage_text": "RouterOS is a stand-alone operating system based on the Linux v2.6 kernel, and our goal here at MikroTik is to provide all these features with a quick and simple installation and an easy to use interface. You can try RouterOS today, go to www.mikrotik.com and download the installation CD image. It can also be installed on a PC and will turn it into a router with all the necessary features-routing, firewall, bandwidth management, wireless access point, backhaul link, hotspot gateway, VPN server and more."}, {"url": "http://wiki.mikrotik.com/wiki/Manual:RouterOS_FAQ", "passage_text": "MikroTik RouterOS™ is a router operating system and software which turns a regular Intel PC or MikroTik RouterBOARD™ hardware into a dedicated router. The MikroTik RouterOS™ is standalone Operating System. The OS is Linux kernel based and very stable. Your hard drive will be wiped completely by the installation process. No additional disk support, just one PRIMARY MASTER HDD or FlashDisk, except for WEB proxy cache."}, {"url": "http://routerboard.com/", "passage_text": "The RB951Ui-2HnD is a wireless SOHO AP with a new generation Atheros CPU and more processing power. It has five Ethernet ports, one USB 2.0 port and a high power 2.4GHz 1000mW 802.11b/g/n wireless AP with antennas built in. The Sixpack is a set of six devices-one 90 degree Access Point and five clients."}, {"url": "http://www.mikrotik-routeros.net/faq.aspx", "passage_text": "Payment information. MikroTik RouterOS is the operating system of MikroTik RouterBOARD hardware. It can also be installed on a PC and will turn it into a router with all the necessary features-firewall, routing, wireless access point, bandwidth management, hotspot gateway, backhaul link, VPN server and more. "}, {"url": "http://gregsowell.com/?p=27", "passage_text": "They also sell ridiculously cheap embedded systems at routerboard.com. You will hear me talk about their wired implementations most often, but they cut their teeth, and have the highest density of usage as wireless devices. Most of the WISPs in the area use them for their high features and low cost. Mikrotik is a rich man’s all in one router at a poor man’s price. It has a huge feature set including OSPF, BGP, MPLS, VPLS, VPN aggregation, 802.1q trunking, superb firewalling, layer 7 firewalling and policy matching, queueing and much more."}, {"url": "https://en.wikipedia.org/wiki/MikroTik", "passage_text": "RouterOS supports many applications used by Internet service providers, for example OSPF, BGP, Multiprotocol Label Switching (VPLS/MPLS), OpenFlow. The product is supported by Mikrotik through a forum and a wiki, providing assorted and thematic examples of configurations. MikroTik routers and their operating system were chosen because of their low cost, flexibility, the fact that the system already had a substantial user base in Mali, and had a user interface deemed superior to other products."}]