[{"url": "http://uaex.edu/yard-garden/in-the-garden/reference-desk/trees/crape-myrtle.aspx", "passage_text": "Crape myrtles come in a variety of mature sizes from ground covers to mature trees getting 25-35 feet tall. My preference is if you have the standard tree forms that you allow them to be trees. "}, {"url": "http://crapemyrtletrails.org/planting/", "passage_text": "Site Selection: Crape myrtles must be in full sun (at least 6 hours daily) to bloom to their maximum potential. Allow ample space for the mature height and spread of the selected crape myrtle variety: a few feet for miniatures and as much as 25 feet for the larger varieties such as Natchez or Muskogee. "}, {"url": "http://homeguides.sfgate.com/can-plant-crape-myrtles-near-foundation-49307.html", "passage_text": "Crape myrtle is a tough plant that needs little in the way of fertilizer or pruning. It likes light and warmth, so plant it where it will get full sun all day. Give it extra water during dry periods for the first two years after planting, and it should be able to fend for itself after that. Smaller cultivars of crape myrtle can be planted in groups to use as a hedge or screen. Some of these grow to a compact 3 feet tall and can be planted three feet from a building wall."}, {"url": "http://www.answers.com/Q/How_close_to_a_house_can_you_plant_a_crepe_myrtle", "passage_text": "Angiosperms is the division  to which the crepe myrtle belongs.    Specifically, a plant can be grouped as either an angiosperm or a  gymnosperm. The former represent … s the division of flowering plants. Prune Crepe Myrtle in late fall. It's a southern plant and u want to wait long enough that it won't be hot enough to regrow. I say November or December. Also Crepe Myrtles are … stripped of all limbs on the lower half."}, {"url": "http://www.answers.com/Q/How_close_to_the_house_can_you_plant_a_crepe_myrtle", "passage_text": "ANSWER:   Just be patient. It will start itself. Both the crepe myrtle (blooming variety) and the wax myrtle (non blooming variety) will send out sister roots and these w … ill become new plants about 2-5 feet away from the original mother plant. Angiosperms is the division  to which the crepe myrtle belongs.    Specifically, a plant can be grouped as either an angiosperm or a  gymnosperm. The former represent … s the division of flowering plants."}, {"url": "http://themanfromearth.blogspot.com/2008/07/top-ten-crepe-myrtle-no-nos.html", "passage_text": "If so, that is an indication that you have a large growing crape myrtle; one that could easily grow to be 20'+. Large crape myrtles like that probably shouldn't be planted within 5 or 6 feet of your home. You'd be better off with your crape myrtle planed at least 8-10 feet from your home. "}, {"url": "http://crape-myrtles.blogspot.com/2010/05/how-far-from-my-foundation-should-i.html", "passage_text": "Even if it gets to 12ft it really isn't a large tree. Crepe myrtles do not have particularly obnoxious roots, so if yours is only a medium one at 7-10 feet I wouldn't worry too much if it was quite close to the house its really only medium shrub size."}, {"url": "http://www.answers.com/Q/How_close_to_a_house_can_you_plant_a_crepe_myrtle", "passage_text": "ANSWER:   Just be patient. It will start itself. Both the crepe myrtle (blooming variety) and the wax myrtle (non blooming variety) will send out sister roots and these w … ill become new plants about 2-5 feet away from the original mother plant. Just wait till these sisters get over a foot high and when its not in bloom, dig it up and move it to a new location. Prune Crepe Myrtle in late fall. It's a southern plant and u want to wait long enough that it won't be hot enough to regrow. I say November or December. Also Crepe Myrtles are … stripped of all limbs on the lower half."}, {"url": "http://homeguides.sfgate.com/can-plant-crape-myrtles-near-foundation-49307.html", "passage_text": "Crape Myrtle Choices. Crape myrtle cultivars range in height from a tiny 18 inches to an enormous 40 feet. Most plants are in the 15- to 25-foot range and may be considered either a large shrub or small tree. Often crape myrtle grows as a multistemmed small tree, with foliage limited to the upper half of the plant. As a general rule of thumb, plant crape myrtles of this mature size a minimum of 8 to 10 feet from a building wall, and farther if you can. This spacing gives the plant room to expand to its full size. Smaller cultivars of crape myrtle can be planted in groups to use as a hedge or screen. Some of these grow to a compact 3 feet tall and can be planted three feet from a building wall."}]