[{"url": "https://uk.answers.yahoo.com/question/index?qid=20090529111059AAdyQpo", "passage_text": "The salary range for each grade may vary from one employer to another so one employer might have Grade 4: £14,704 - £15,576 while another has it as Grade 4: £19645 - £23449. To do your calculations, you need to know how many hours you'll be expected to work per week and what your starting salary will be. "}, {"url": "http://smallbusiness.chron.com/e1-pay-scale-mean-38339.html", "passage_text": "Grade E-1 indicates a trainee at the lowest rank in each service. Pay grades E-1 through E-3 generally indicate basic training, advanced training or entry-level work. For the Army and Marines, E-1 corresponds to the rank of private. "}, {"url": "https://answers.yahoo.com/question/index?qid=20101216161045AArEd5Y", "passage_text": "Answers. Best Answer: Pay Grade is a term commonly used in Military and Government work. Usually this is associated with a person's position (or function), their level of skill (or competence and experience), and the amount of time they have been in their current job. In the military and government, usually a pay grade starts with a low number (or alpha-numeric) for a person with little experience. Higher numbers usually are rewarded to workers with more experience, skill, and time they have served in that particular capacity."}, {"url": "https://answers.yahoo.com/question/index?qid=20070831143927AAbrDZV", "passage_text": "Best Answer: Many employers assign 'grades' to the positions available within their company. This allows them to keep things equitable between different areas and different types of positions-ex: a manager in one area should be at the same grade as a manager in a different area. A person cannot exceed his salary grade compensation. If he is at the top f his salary grade he would have to move to the next salary grade in order to receive more money. PS The dollar amounts are for illustration purposes only."}, {"url": "http://www.simplyhired.com/salaries-k-grade-5-jobs.html", "passage_text": "Average Grade 5 Salaries. The average salary for grade 5 jobs is $54,000. Average grade 5 salaries can vary greatly due to company, location, industry, experience and benefits. This salary was calculated using the average salary for all jobs with the term grade 5 anywhere in the job listing."}, {"url": "http://govcentral.monster.com/careers/articles/37", "passage_text": "Base salary ranges for each grade are provided below, but increase based on location. For instance a GS-7 position pays $36,783 in Atlanta, while the same position pays $41,367 in San Francisco because of the difference in cost of living. "}, {"url": "https://en.wikipedia.org/wiki/Pay_grade", "passage_text": "A pay grade is a unit in systems of monetary compensation for employment. It is commonly used in public service, both civil and military, but also for companies of the private sector. Pay grades facilitate the employment process by providing a fixed framework of salary ranges, as opposed to a free negotiation. Typically, pay grades encompass two dimensions: a vertical range where each level corresponds to the responsibility of, and requirements needed for a certain position; and a horizontal range within this scale to allow for monetary incentives rewarding the employee 's quality of performance or length of service."}, {"url": "https://answers.yahoo.com/question/index?qid=20101216161045AArEd5Y", "passage_text": "· just now. Report Abuse. It basically means the salary range for that specific job ($45,000 to $55,000 for instance). Pay grades are often given a number or letter by HR, and that scale varies by company (Grade 208, 209, 210, etc). KatGuy · 5 years ago. In the military and government, usually a pay grade starts with a low number (or alpha-numeric) for a person with little experience. Higher numbers usually are rewarded to workers with more experience, skill, and time they have served in that particular capacity."}, {"url": "https://answers.yahoo.com/question/index?qid=20070831143927AAbrDZV", "passage_text": "That is they divide the salaries that people have by their level and the amount of money that they may receive. For example they may say that the alary grade in 028 is $25,000 to $31,500 and the salary level grade of 0828 is $31,000 to $39,815 and so on. A person cannot exceed his salary grade compensation. If he is at the top f his salary grade he would have to move to the next salary grade in order to receive more money. PS The dollar amounts are for illustration purposes only."}]