[{"url": "http://oceanexplorer.noaa.gov/facts/currents.html", "passage_text": "Currents may also be generated by density differences in water masses caused by temperature and salinity variations. These currents move water masses through the deep ocean—taking nutrients, oxygen, and heat with them. Occasional events also trigger serious currents. Huge storms move water masses."}, {"url": "http://oceanexplorer.noaa.gov/facts/currents.html", "passage_text": "Surface currents are generated largely by wind. Their patterns are determined by wind direction, Coriolis forces from the Earth’s rotation, and the position of landforms that interact with the currents. Surface wind-driven currents generate upwelling currents in conjunction with landforms, creating deepwater currents."}, {"url": "http://oceanexplorer.noaa.gov/facts/currents.html", "passage_text": "Ocean currents can be generated by wind, density differences in water masses caused by temperature and salinity variations, gravity, and events such as earthquakes. Currents are cohesive streams of seawater that circulate through the ocean."}, {"url": "http://oceanmotion.org/html/background/tides-forces.htm", "passage_text": "Observing and Predicting Tides. Open-Ocean Tides. The tide-generating force is produced by the combination of (1) the gravitational attraction between Earth and the moon and sun, and (2) the rotation of the Earth-moon and Earth-sun systems. Forces combine to deform Earth’s ocean surface into a roughly egg-shape with two bulges."}, {"url": "http://www.brighthub.com/environment/science-environmental/articles/107994.aspx", "passage_text": "Wind is another force that causes ocean currents. Uneven heating by the sun creates winds which blow across the water's surface. The Earth's spin also creates winds that blow across the ocean. Trade winds are located near the equator, while the Westerlies blow in the middle latitudes."}, {"url": "http://oceanservice.noaa.gov/education/kits/currents/05currents1.html", "passage_text": "Surface ocean currents, which occur on the open ocean, are driven by a complex global wind system. To understand the effects of winds on ocean currents, one first needs to understand the Coriolis force and the Ekman spiral."}]