[{"url": "http://www.why.do/why-do-birds-stand-on-one-leg/", "passage_text": "There is another interesting theory, which shows the shrewdness of birds. According to this theory, standing on two legs may attract predator and birds could become an easy aquatic prey, so they prefer to stand on one leg, which looks a lot like a suspended branch in water."}, {"url": "http://scienceblogs.com/startswithabang/2013/10/05/weekend-diversion-the-physics-of-flamingoes/", "passage_text": "A flamingo that never learned to stand on one leg, that spent most of its time in the water with both legs immersed, would lose somewhere around 40-70% more body heat than a flamingo that did learn this behavior."}, {"url": "http://birdnote.org/show/why-birds-stand-one-leg", "passage_text": "The arteries that transport warm blood into the legs lie in contact with the veins that return colder blood to the bird's heart. The arteries warm the veins. By standing on one leg, a bird reduces by half the amount of heat lost through unfeathered limbs. This Marbled Godwit shows us how it's done."}, {"url": "http://news.bbc.co.uk/earth/hi/earth_news/newsid_8197000/8197932.stm", "passage_text": "The birds also likely alternate which leg they stand on to avoid one leg becoming too cold. If they stood on one leg consistently, they would risk greater loss of body heat and potential tissue damage in the cold, says Anderson."}, {"url": "http://mentalfloss.com/flamingos", "passage_text": "They found that more birds stood on one leg when they were standing in water than when they were on dry land, and that more birds would stand on one leg when it was cooler and on two when it was warmer, suggesting that one-legged resting helps in regulating temperature."}, {"url": "http://scienceblogs.com/startswithabang/2013/10/05/weekend-diversion-the-physics-of-flamingoes/", "passage_text": "One thing to note is that birds will stand on one leg even when not in water, and even in desert temperatures (ibis birds)… so who knows.. they just might like it that way. Sinisia: “They might just like it” could in fact be the adaptation – the mechanism that produces the result of better heat retention."}, {"url": "http://beyondpenguins.ehe.osu.edu/issue/arctic-and-anarctic-birds/how-do-birds-stay-warm", "passage_text": "Some birds have circulatory patterns to reduce the heat lost through their feet when standing on ice or swimming in cold water. As cold blood runs up the leg from the foot and passes by the arteries, it picks up most of the heat from the arteries via conductance."}, {"url": "http://mudfooted.com/why-flamingos-stand-on-one-leg/", "passage_text": "Matthew Anderson and his team observed a captive flock of flamingos at the Philadephia Zoo. For all animals they noted if they were standing on the land or in the water, if they were standing on one of two legs and on what leg they were standing."}, {"url": "http://animals.howstuffworks.com/birds/flamingos-stand-on-one-leg.htm", "passage_text": "In a large, shallow body of water, hundreds of flamingos congregate like an avian water ballet team: all preening their pink feathers, resting in the sun and standing on one leg for hours at a time. Flamingos even sleep that way. Bird Image Gallery."}, {"url": "http://news.bbc.co.uk/earth/hi/earth_news/newsid_8197000/8197932.stm", "passage_text": "In short, the birds stand on one leg to conserve body heat. If they put two legs in the water, rather than one, they would lose more heat than is healthy, particularly as they spend so much time wading."}]