[{"url": "http://www.remodeling-sanantonio.com/green-building/hardiplank-insurance-discount/", "passage_text": "After we removed the old siding and replaced it with Hardiplank, the homeowner was now eligible to get a discount on his insurance since the home was now 100% masonry. Cement Fiber Siding is a popular choice for many of our clients that are remodeling their homes due to the low cost vs stone, brick or stucco. HardiPlank is an engineered, non-wood exterior siding product and is considered a “green” building material. It is produced from a fibrous cement material that resists weather, water, insect and fire damage. HardiPlank is designed for residential and commercial use"}, {"url": "http://www.remodeling-sanantonio.com/room-additions/brick-vs-hardi-plank/", "passage_text": "When you compare brick vs Hardi Plank Siding. , the cost is considerable. You should expect to pay about $10-12 per square foot for brick and about $3-4 per square foot for Hardie Plank. Brick can last up to 100 years before it shows signs of wear, if it is properly installed. Hardie Plank can last up to 50 years, if it properly installed and maintained"}, {"url": "http://www.cyburbia.org/forums/showthread.php?t=13669", "passage_text": "5,635. We ended up specifically listing hardiplank as not complying with the masonry requirement. Look closely at your restriction purposes section and see if it is in the spirit of the ordinance. You might have a purpose like promoting use of high quality building materials or something to that effect. I ask because it is a cementatious fiber board, so it contains cement (masonry), but it looks like wood. And while it lasts longer than wood, especially in humid climates, it doesn't have the longevity of masonry, nor the look, which is the whole purpose of the deed restriction in the first place."}, {"url": "http://www.answers.com/Q/What_is_difference_between_frame_and_joisted_masonry", "passage_text": "A building that is framed with wood or light gauge metal with roof supports and decking that are the wood or light gauge metal are considered frame. The exterior can consist of any number of things from vinyl or wood siding, brick veneer or stucco. a home that has brick is still considered a frame building. since the construction method used has wooden frames, with a brick veneer finish on the outisde, it is ultimately c … onsidered a frame building."}, {"url": "http://www.cyburbia.org/forums/showthread.php?t=13669", "passage_text": "With it being an HOA, you might look elsewhere in the restrictions since many times they have some statement about inkeeping with the architectural character of the neighborhood, region, environment, rural feel, etc.. IMHO, hardiplank is not masonry. Of course that and 75 cents will buy you one crappy cup of coffee! Oh, that is all well and good, but, voice or no voice, the people can always be brought to the bidding of the leaders. That is easy. I ask because it is a cementatious fiber board, so it contains cement (masonry), but it looks like wood. And while it lasts longer than wood, especially in humid climates, it doesn't have the longevity of masonry, nor the look, which is the whole purpose of the deed restriction in the first place."}, {"url": "http://masonryordinance.com/masonry/frequently-asked-questions", "passage_text": "Take fiber cement board for example: In the ASTM table of Contents, Section 4 “Construction”, “Masonry” and “Fiber Reinforced Cement Products” are listed separately. Fiber cement board is not considered a masonry product, but a siding. Masonry planning policies can take many forms, depending on governmental structure and specific community needs and desires. The most popular types include: 1  Zoning Ordinances that specify a certain percentage of brick or masonry for a variety of land uses."}, {"url": "https://en.wikipedia.org/wiki/Fiber_cement_siding", "passage_text": "Fiber cement siding (or fibre cement cladding in the UK and Australasia) is a building material used to cover the exterior of a building in both commercial and domestic applications. "}, {"url": "http://masonryordinance.com/masonry/frequently-asked-questions", "passage_text": "Conventional masonry materials include: brick, concrete block, natural and cut stone, and traditional cementitious stucco that is applied over a concrete masonry base. Masonry planning policies can take many forms, depending on governmental structure and specific community needs and desires. The most popular types include: 1  Zoning Ordinances that specify a certain percentage of brick or masonry for a variety of land uses."}]