[{"url": "http://optometry-schools.startclass.com/", "passage_text": "Mean OAT Total Science. The average score, out of a possible 400, for the Survey of Natural Sciences (which includes Biology, General Chemistry, and Organic Chemistry) & Physics sections of the Optometry Admission Test, which is required for admission to all optometry schools. Average GPA of Incoming Students. The average GPA of first-year students who were admitted to the optometry school. This figure is scored out of a 4.0 scale and includes fully-completed college-level course grades."}, {"url": "http://optometry-schools.startclass.com/l/22/UC-Berkeley-School-of-Optometry", "passage_text": "1 The school has about 256 total students enrolled. 2  With 110 total faculty members, Cal has a student-faculty ratio of 2.3:1, which is below the average among all optometry schools. 3  Out of all public schools, UC Berkeley School of Optometry has the highest in-state tuition and a higher than average out-of state tuition. 1 Out of all public schools, UC Berkeley School of Optometry has the highest in-state tuition and a higher than average out-of state tuition. 2  Note: at this school, out-of-state students are eligible for in-state residency following one full year of residency (contact the school for more information)."}, {"url": "http://optometry-schools.startclass.com/l/22/UC-Berkeley-School-of-Optometry", "passage_text": "1 Cal's acceptance rate of 27% is higher than typical compared to all other optometry schools. 2  Incoming students have an average GPA (3.40), higher than average OAT Academic Average score (349), and a higher than average OAT Total Science score (350). 1 Out of all public schools, UC Berkeley School of Optometry has the highest in-state tuition and a higher than average out-of state tuition. 2  Note: at this school, out-of-state students are eligible for in-state residency following one full year of residency (contact the school for more information)."}, {"url": "http://forums.studentdoctor.net/threads/what-is-a-safe-gpa-for-admission-to-optometry-school.498667/", "passage_text": "#7. The average GPA for most optometry schools is usually somewhere around 3.40 or higher; therefore, some enter with 4.0s while others get in 3.0s. I personally got in with a 3.26, which is misleading in that my GPA for my first three years was 2.4 while my last three years was around 3.68. Depends on what your GPA is....if you have a 2.5, and a masters i doubt you will get in, just my opinion. If you have like a 2.9, and show that you are excelling in your masters program, maybe yeah. Anyways, if your GPA is low, you should take science classes to boost up, like a Post-Bacc or something."}, {"url": "http://forums.studentdoctor.net/threads/what-is-a-safe-gpa-for-admission-to-optometry-school.498667/", "passage_text": "Status: Optometrist. The average GPA for most optometry schools is usually somewhere around 3.40 or higher; therefore, some enter with 4.0s while others get in 3.0s. I personally got in with a 3.26, which is misleading in that my GPA for my first three years was 2.4 while my last three years was around 3.68. Depends on what your GPA is....if you have a 2.5, and a masters i doubt you will get in, just my opinion. If you have like a 2.9, and show that you are excelling in your masters program, maybe yeah. Anyways, if your GPA is low, you should take science classes to boost up, like a Post-Bacc or something."}, {"url": "http://optometry-schools.startclass.com/l/22/UC-Berkeley-School-of-Optometry", "passage_text": "1 With 110 total faculty members, Cal has a student-faculty ratio of 2.3:1, which is below the average among all optometry schools. 2  Out of all public schools, UC Berkeley School of Optometry has the highest in-state tuition and a higher than average out-of state tuition. 1 Out of all public schools, UC Berkeley School of Optometry has the highest in-state tuition and a higher than average out-of state tuition. 2  Note: at this school, out-of-state students are eligible for in-state residency following one full year of residency (contact the school for more information)."}, {"url": "http://www.oatbooks.com/oat-scores-for-optometry-schools", "passage_text": "Assuming the mean remains constant, an OAT score rounded up or rounded down to 300 can be considered average. High, good and average OAT scores are not set in stone, however. Optometry schools have different criteria for admission. A good score for one school may not be so for another. Make sure to check the website of the school you plan to enrol in. "}, {"url": "http://advising.utah.edu/preprofessional/medical/preoptometry/application.php", "passage_text": "The best strategy is to prepare thoroughly and take the OAT once. Optometry schools look at GPA in 2 different ways; individual course grades (mainly prerequisite courses) and overall. In 2012, the average overall GPA for entering class was 3.43. Statistics by school (GPA, OAT score) can be found here. It takes about 4.5 hours, including one break. The cost of the test includes score reports for to up to 5 schools (you have to pay an additional fee per school.) Average OAT score in 2008 for entering students to Optometry schools was 333 (in the range from 200-400). The score must be sent directly to your designated schools"}]