[{"url": "http://www.gallup.com/poll/183713/socialist-presidential-candidates-least-appealing.aspx", "passage_text": "Among religious identities, while the large majority of Americans would vote for a Catholic or Jewish presidential candidate, smaller majorities say they would vote for a candidate who is Mormon (81%), an evangelical Christian (73%), Muslim (60%) or an atheist (58%). Gallup also finds wide differences in support for gay or lesbian, atheist, Muslim and socialist presidential candidates by age. Americans between the ages of 18 and 29 are much more likely than those 65 and older to support these four types of candidates."}, {"url": "http://www.marxist.com/usa-bernie-sanders-and-the-2016-presidential-election.htm", "passage_text": "USA: Bernie Sanders and the 2016 Presidential Election. Written by Socialist Appeal-USA Thursday, 02 July 2015. Bernie Sanders, the Democratic Party candidate for president of the United States, has attracted huge crowds and generated enormous enthusiasm at campaign stops around the country."}, {"url": "http://www.infoplease.com/encyclopedia/history/socialist-party.html", "passage_text": "The Socialist party did not show much electoral strength until 1910 and 1911, when its candidates won numerous state and local elections. In 1912, Debs received nearly 900,000 votes (6% of the votes cast) as the party's presidential candidate. The party reached its peak membership (nearly 120,000) in that year. In 1924 the Socialist party supported the Progressive party candidate for president, Robert La Follette, but in 1928 it once again nominated its own candidate, Norman Thomas, who ran in the following five presidenti"}, {"url": "http://www.gallup.com/poll/183713/socialist-presidential-candidates-least-appealing.aspx", "passage_text": "Republicans and Democrats differ most in their willingness to vote for a socialist candidate, by 33 percentage points, but socialist ranks last for both parties. The two parties also differ significantly on voting for a gay or lesbian candidate, by 24 points. Gallup also finds wide differences in support for gay or lesbian, atheist, Muslim and socialist presidential candidates by age. Americans between the ages of 18 and 29 are much more likely than those 65 and older to support these four types of candidates."}, {"url": "https://en.wikipedia.org/wiki/Socialist_Party_of_America", "passage_text": "The Party changed its name to Social Democrats, USA by a vote of 73 to 34. Renaming the Party as SDUSA was meant to be realistic. The New York Times observed that the Socialist Party had last sponsored a candidate for President in 1956, who received only 2,121 votes, which were cast in only 6 states. The leaders of the Old Guard formed a new rival organization to the Socialist Party, the Social Democratic Federation in 1936 and somewhat reluctantly endorsed Franklin Roosevelt for President in the election of that year."}, {"url": "https://en.wikipedia.org/wiki/Socialist_Party_of_America", "passage_text": "Its presidential candidate, Eugene V. Debs, twice won over 900,000 votes (in 1912 and 1920), while the party also elected two United States Representatives (Victor L. Berger and Meyer London), dozens of state legislators, more than a hundred mayors, and countless lesser officials. The leaders of the Old Guard formed a new rival organization to the Socialist Party, the Social Democratic Federation in 1936 and somewhat reluctantly endorsed Franklin Roosevelt for President in the election of that year."}, {"url": "https://en.wikipedia.org/wiki/Norman_Thomas", "passage_text": "Norman Mattoon Thomas (November 20, 1884 – December 19, 1968) was an American Presbyterian minister who achieved fame as a socialist, pacifist, and six-time presidential candidate for the Socialist Party of America. It was Thomas' position as a conscientious objector which drew him to the Socialist Party of America (SPA), a staunchly antimilitarist organization. When SPA leader Morris Hillquit made his campaign for Mayor of New York in 1917 on an anti-war platform, Thomas wrote to him expressing his good wishes."}, {"url": "http://www.gallup.com/poll/183713/socialist-presidential-candidates-least-appealing.aspx", "passage_text": "WASHINGTON, D.C. -- As the 2016 presidential election field takes shape, more than nine in 10 Americans say they would vote for a qualified presidential candidate who is Catholic, a woman, black, Hispanic or Jewish. Less than half of Americans would vote for a candidate who is a socialist. Gallup also finds wide differences in support for gay or lesbian, atheist, Muslim and socialist presidential candidates by age. Americans between the ages of 18 and 29 are much more likely than those 65 and older to support these four types of candidates."}, {"url": "http://votesocialism.com/", "passage_text": "Stephen Durham, 65, is running for president of the United States as a write-in candidate. Durham, who is on the Freedom Socialist ticket with vice-presidential candidate Christina Lopez, lives in Harlem with his wife, gastroenterologist Susan Williams, and their two dogs. "}, {"url": "http://www.gallup.com/poll/183713/socialist-presidential-candidates-least-appealing.aspx", "passage_text": "With more than a dozen candidates running for president, the 2016 field is one of the most diverse Americans have ever seen. On the heels of the historic election and re-election of the nation's first black president, Americans are just as likely to lend their support to black candidates as to women and Hispanics. Gallup also finds wide differences in support for gay or lesbian, atheist, Muslim and socialist presidential candidates by age. Americans between the ages of 18 and 29 are much more likely than those 65 and older to support these four types of candidates."}]