[{"url": "http://learn.org/articles/What_is_the_Average_Salary_for_Entry-Level_Paralegal_Positions.html", "passage_text": "Entry-Level Paralegal Salaries. According to Payscale.com, paralegals with less than one year of experience earned between $25,367 and $45,249 annually as of January 2014. Your starting salary as a paralegal can vary from this estimate based on your location, employer and legal specialization. Schools offering Paralegal degrees can also be found in these popular choices. According to Payscale.com, paralegals with less than one year of experience earned between $25,367 and $45,249 annually as of January 2014."}, {"url": "http://www.paralegaledu.org/salaries/", "passage_text": "According to Salary.com, a paralegal with an associate degree that is just entering the profession can expect to earn an average salary of $46,907. An experienced paralegal with a bachelor’s degree and at least eight years of experience earns an average $71,798. The top 10% of experienced paralegals earned in excess of $91,000. Larger law firms tend to offer higher salaries than small law firms. According to the Bureau of Labor Statistics (BLS), the projected job growth for paralegals between 2010-2020 is 18%. The average rate of increase of all professions is 14%, which means that paralegal jobs are being added at a slightly higher rate than other job categories."}, {"url": "http://www.simplyhired.com/salaries-k-paralegal-jobs.html", "passage_text": "Average Paralegal Salaries. The average salary for paralegal jobs is $46,000. Average paralegal salaries can vary greatly due to company, location, industry, experience and benefits. This salary was calculated using the average salary for all jobs with the term paralegal anywhere in the job listing"}, {"url": "https://www.recruiter.com/salaries/paralegals-and-legal-assistants-salary/", "passage_text": "A Paralegal or Legal Assistant will usually earn average salaries somewhere between 32000 to 48000 depending on education and tenure levels. Paralegals and Legal Assistants can expect an average salary of Forty Eight Thousand Nine Hundred dollars per annum. Paralegals and Legal Assistants can get the highest pay in the District of Columbia, where they get average compensation of just about $64760."}, {"url": "http://www1.salary.com/Paralegal-I-salary.html", "passage_text": "The annual salary for someone with the job title Paralegal I may vary depending on a number of factors including industry, company size, location, years of experience and level of education. For example the median expected annual pay for a typical Paralegal I in the United States is $49,160, so 50% of the people who perform the job of Paralegal I in the United States are expected to make less than $49,160. Source: HR Reported data as of October 2015. 1  Salary. 2  Salary + Bonus. 3  Benefits. 4  Purchase Full Report."}, {"url": "http://www.paralegaledu.org/massachusetts/massachusetts-salary/", "passage_text": "During 2011, a total of 6,770 paralegals were employed in Massachusetts. The average salary among them was $49,720, while the 90th percentile earned an average of $75,040, which was $25,320 more than the overall statewide average. "}, {"url": "http://money.usnews.com/careers/best-jobs/paralegal/salary", "passage_text": "Salary Outlook. The BLS reports that the median annual salary for paralegals was $47,570 in 2013. The best-paid 10 percent in the field made $76,960, while the bottom 10 percent made approximately $29,740. In 2013, the highest-paid 10 percent of paralegals made about $76,960 less than the average lawyer ($131,990)."}, {"url": "http://money.usnews.com/careers/best-jobs/paralegal/salary", "passage_text": "Paralegals sometimes have overlapping duties with lawyers, but they make far less, bringing in an average salary of $51,170. In 2013, the highest-paid 10 percent of paralegals made about $76,960 less than the average lawyer ($131,990)."}]