[{"url": "http://www.answers.com/Q/How_did_Wisconsin_become_a_state", "passage_text": "Wisconsin became a state by Act of Congress, the same as with Ohio, Indiana, Illinois and Michigan, among others. 1 Wisconsin State Campground Ideas Wisconsin is located in the north central to mid-eastern portion of the United States, and borders the four states of Minnesota, Iowa, Illinois, and Michigan. 2  It is a wonderf…."}, {"url": "https://en.wikipedia.org/wiki/History_of_Wisconsin", "passage_text": "Since its admission to the Union on May 29, 1848 as 30th state, Wisconsin has been ethnically heterogeneous, with Yankees being among the first to arrive from New York and New England. They dominated the state's heavy industry, finance, politics and education. The United States did not firmly exercise control over Wisconsin until the War of 1812. In 1814, the Americans built Fort Shelby at Prairie du Chien. During the war, the Americans and British fought one battle in Wisconsin, the July, 1814 Siege of Prairie du Chien, which ended as a British victory."}, {"url": "https://en.wikipedia.org/wiki/Wisconsin", "passage_text": "Wisconsin's geography is diverse, with the Northern Highland and Western Upland along with a part of the Central Plain occupying the western part of the state and lowlands stretching to the shore of Lake Michigan. Wisconsin is second to Michigan in the length of its Great Lakes coastline. Wisconsin is the 23rd largest state by total area and the 20th most populous. The state capital is Madison, and its largest city is Milwaukee, which is located on the western shore of Lake Michigan. The state is divided into 72 counties."}, {"url": "http://www.ncsl.org/research/labor-and-employment/right-to-work-laws-and-bills.aspx", "passage_text": "Currently, 25 states and Guam have given workers a choice when it comes to union membership. Labor unions still operate in those states, but workers cannot be compelled to become members as a requirement of their job. Wisconsin became the 25th right-to-work state, with a bill that was signed into law on March 9, 2015. Track 2015 legislative bills in our collective bargaining database"}, {"url": "http://www.wisconsinhistory.org/turningpoints/tp-014/?action=more_essay", "passage_text": "New territories were created from old, and the most populous ones became states. Wisconsin was successively part of the original Northwest Territory (1788-1800), Indiana Territory (1800-1809), Illinois Territory (1809-1818), and Michigan Territory (1818-1836) before it became a territory in its own right (1836-1848)."}, {"url": "https://en.wikipedia.org/wiki/Wisconsin", "passage_text": "Wisconsin (/wɪsˈkɒnsɪn/) is a U.S. state located in the north-central United States, in the Midwest and Great Lakes regions. It is bordered by Minnesota to the west, Iowa to the southwest, Illinois to the south, Lake Michigan to the east, Michigan to the northeast, and Lake Superior to the north. Wisconsin is the 23rd largest state by total area and the 20th most populous. The state capital is Madison, and its largest city is Milwaukee, which is located on the western shore of Lake Michigan. The state is divided into 72 counties."}, {"url": "http://www.city-data.com/states/Wisconsin-History.html", "passage_text": "Under the Ordinance of 1787, Wisconsin became part of the Northwest Territory; it was subsequently included in the Indiana Territory, the Territory of Illinois, and then the Michigan Territory. In the early 1820s, lead mining brought an influx of white settlers called Badgers.. "}, {"url": "http://www.answers.com/Q/When_did_it_become_state_and_what_number_of_state_is_wisconsin", "passage_text": "Wisconsin became a state by Act of Congress, the same as with Ohio, Indiana, Illinois and Michigan, among others. "}, {"url": "http://wanttoknowit.com/when-did-wisconsin-become-a-state/", "passage_text": "Wisconsin is a state located in the Great Lakes and Midwest regions of the United States. It is located to the east of Minnesota, northeast of Iowa and southwest of Michigan. Lake Michigan is to the east of the state and Lake Superior is to the north. In 1787 Wisconsin was made part of the newly formed Northwest Territory. Later in 1800, as Ohio prepared to become a state, Wisconsin became a part of Indiana Territory. In 1809 it became part of the newly formed Illinois Territory and in 1818 was included in Michigan Territory. In 1836 Wisconsin Territory was formed"}]