[{"url": "http://www.englishleap.com/grammar/nouns", "passage_text": "Proper nouns basically refer to the names that are specific to that particular noun. These nouns are always capitalised as they need to be distinct from other nouns. - 1  William Shakespeare was a playwright. - 2  Proper noun that is the name of a specific person. - 3  I will be visiting New York next month. - 4  Proper noun that is the name of a specific place. These nouns can also refer to medical conditions related to the mind and are also used to express thoughts. - 1  She screamed with great delight. - 2  Delight is an abstract noun as it tells about the state of a person’s mind and any actual physical thing. - 3  His bravery in the war won him a medal."}, {"url": "https://www.englishclub.com/grammar/nouns-compound.htm", "passage_text": "Compound Nouns. A compound noun is a noun that is made with two or more words. A compound noun is usually [noun + noun] or [adjective + noun], but there are other combinations (see below). It is important to understand and recognize compound nouns. Each compound noun acts as a single unit and can be modified by adjectives and other n"}, {"url": "http://www.answers.com/Q/What_type_of_noun_is_lawmaker", "passage_text": "I is a pronoun, not a noun; I is a first person, singular, subject pronoun. A pronoun is a word that takes the place of a noun to make a sentence easier to say and write. Exam … ple use: My name is Mary. I live in Texas and I like to go swimming. We use the pronoun because to keep using the name becomes clumsy. The word 'your' is not a noun. The word 'your' is a  pronoun.    A pronoun is a word that takes the place of a noun in a sentence.   The pronoun 'your' is a the se … cond person, possessive adjective."}, {"url": "http://www.answers.com/Q/What_type_of_pronoun_is_lawmaker", "passage_text": "The word lawmaker is not a pronoun; lawmaker is a noun, a singular, common, abstract, compound noun, a word for a profession or job description. A pronoun is a word that takes the place of a noun in a sentence. For example: As a lawmaker, he was known for his intensive research on an issue. He served in office for twelve years. The pronoun 'he' takes the place of the noun 'lawmaker' so that the noun is not repeated each time the lawmaker is mentioned. The pronoun 'him' is an objective case  personal pronoun, a word that takes the place of a  noun for a male as an indirect object, direct object or object of a  preposition … . + 3 others found this useful. Jesus Magdaleno. Notyouraveragedummy ..."}, {"url": "http://www.answers.com/Q/What_type_of_pronoun_is_lawmaker", "passage_text": "The pronoun 'these' is a demonstrative pronoun; a  word that takes the place of a noun indicating relative nearness or  distance in time or place.   The demonstrative pr … onouns are this, that, these, and those.    Example sentence: These are my favorite kind of apples. The pronoun 'him' is an objective case  personal pronoun, a word that takes the place of a  noun for a male as an indirect object, direct object or object of a  preposition … . + 3 others found this useful. Jesus Magdaleno. Notyouraveragedummy ..."}, {"url": "http://www.answers.com/Q/What_type_of_noun_is_lawmaker", "passage_text": "The word 'he' is not a noun. The word 'he' is a pronoun.   A noun is a word for a person, a place, or a thing.   A pronoun is a word that takes the place of a noun in … a sentence.    The pronoun 'he' is a personal pronoun, a word that takes  the place of a noun (name) for a male. The word 'your' is not a noun. The word 'your' is a  pronoun.    A pronoun is a word that takes the place of a noun in a sentence.   The pronoun 'your' is a the se … cond person, possessive adjective."}, {"url": "http://www.grammar-monster.com/glossary/noun_clauses.htm", "passage_text": "Click on the one with a noun clause in bold: COMMON STARTS TO NOUN CLAUSES. Lots of noun clauses in English start with that, how, or a wh-word (i.e., what, who, which, when, where, why). For example: DEFINITION OF A NOUN CLAUSE. A noun clause is a clause that functions as a noun. However, for many, that definition is too generic. A multi-word noun will often contain another type of clause, usually an adjective clause, which provides the verb required for a clause. In the examples below, the multi-word nouns are shaded, and internal clauses are in bold. Here is another example: If you have a view on this, please tell us using this form"}, {"url": "http://www.answers.com/Q/What_type_of_pronoun_is_lawmaker", "passage_text": "The pronoun 'they' is a personal pronoun, a word that takes  the place of a noun for a specific person or thing.   The pronoun 'they' is the subjective, third person, plu … ral pronoun  that takes the place of a plural noun or two or more nouns as the  subject of a sentence or a clause. The pronoun 'him' is an objective case  personal pronoun, a word that takes the place of a  noun for a male as an indirect object, direct object or object of a  preposition … . + 3 others found this useful. Jesus Magdaleno. Notyouraveragedummy ..."}, {"url": "http://www.grammar-monster.com/glossary/noun_clauses.htm", "passage_text": "A noun clause is a clause that plays the role of a noun. For example (noun clauses shaded): Compare the three examples above to these: The words in bold are all nouns. This shows that shaded clauses in the first three examples are functioning as nouns, making them noun clauses. For example: DEFINITION OF A NOUN CLAUSE. A noun clause is a clause that functions as a noun. However, for many, that definition is too generic. A multi-word noun will often contain another type of clause, usually an adjective clause, which provides the verb required for a clause."}]