[{"url": "https://answers.yahoo.com/question/index?qid=20100514173612AAhMYvc", "passage_text": "Answers. Relevance. Rating Newest Oldest. Best Answer: Go into the 'spam' folder and open the item you wish to keep, Kal. You HAVE to do this with ALL of them!Click on the 'Not spam' button and it will be returned to your in box, also allowing that address to be delivered to the in box from now on."}, {"url": "http://productforums.google.com/d/topic/gmail/hZwSfeSMgWk", "passage_text": "I can't figure out how to transfer non-spam messages from my spam box to my inbox. When I go to the Move To icon, my inbox is not in the drop-down menu. I do not have any messages in my spam label, so I am not sure... but you should be able to select the message and a button should appear near the top that says not spam. Press that button and Gmail should move it to your Inbox or All Mail."}, {"url": "http://email.about.com/od/mozillathunderbirdtips/qt/Move_Spam_to_the_Junk_Folder_Automatically_in_Thunderbird.htm", "passage_text": "To have Mozilla Thunderbird, Netscape or Mozilla move spam to the Junk folder automatically: 1  Select Tools | Junk Mail Controls... 2  from the menu. 3  Make sure you have enabled the spam filter for your account. 4  Now make sure Move incoming messages determined to be junk mail to: is selected. 1 from the menu. 2  Make sure you have enabled the spam filter for your account. 3  Now make sure Move incoming messages determined to be junk mail to: is selected. 4  Specify the folder where Netscape or Mozilla should put spam. 5  It's usually best to stick with the default: the Junk folder under the same account. 6  Click OK."}, {"url": "https://answers.yahoo.com/question/index?qid=20100514173612AAhMYvc", "passage_text": "Update: I am able to move single emails from spam back into my inbox, but now every email I receive from the same address which I accidentally marked as spam to begin with goes into my spam. So how can I make it so that every new email I receive from this specific address goes into my inbox and not my spam. Also now in the emails, there is a yellow bar at the top saying that Yahoo Mail has blocked remote images in the message. Relevance. Rating Newest Oldest. Best Answer: Go into the 'spam' folder and open the item you wish to keep, Kal. You HAVE to do this with ALL of them!Click on the 'Not spam' button and it will be returned to your in box, also allowing that address to be delivered to the in box from now on."}, {"url": "https://support.google.com/mail/answer/9008?hl=en", "passage_text": "Just select the message, and click the Not Spam button that appears at the top and bottom of your current view. Unmarking a message will automatically move it to your inbox. If you find that some senders' messages are consistently being mislabeled as spam, you can prevent this by: 1  Adding their email addresses to your Contacts list. 2  Some messages sent from contacts which are very clearly spam can be sent directly to your Spam label. 3  Creating a filter so the messages are never sent to Spam. If you find that some senders' messages are consistently being mislabeled as spam, you can prevent this by: 1  Adding their email addresses to your Contacts list. 2  Gmail will deliver messages from members of your Contacts list to your inbox, unless we know with high confidence that they are spam."}, {"url": "http://answers.microsoft.com/en-us/office/forum/office_2010-outlook/moving-junk-mail-to-inbox/99dae38d-ec37-4733-b95f-fa6ef3cdfd7b", "passage_text": "ove to Inbox.. I tried clicking on that to move it to, well, the Inbox but it made no difference. I tried moving the e-mail back to the Junk folder but that apparently is not allowed. Downright Kafka-esque if you ask me. The functionality message also noted that the e-mail was marked as Spam based on the Outlook Junk mail filter. So I now have a client wondering why I didn't respond to an e-mail."}, {"url": "https://help.yahoo.com/kb/SLN4910.html", "passage_text": "1 Check your Spam folder: Periodically check your Spam folder to ensure that you do not miss a message. - 2  You can move a message from the Spam folder to your Inbox: Check the checkbox beside the message and select the Not Spam button. We make every effort to deliver solicited email directly to your Inbox. Sometimes, though, we can incorrectly send a message that you want to your Spam folder. Tips to avoid having emails designated as spam: 1  Check your Spam folder: Periodically check your Spam folder to ensure that you do not miss a message."}, {"url": "https://help.yahoo.com/kb/SLN4910.html", "passage_text": "1 - You can move a message from the Spam folder to your Inbox: Check the checkbox beside the message and select the Not Spam button. - 2  Using Not Spam educates our filtering system: By sending these examples to Yahoo for review, it will increase the effectiveness of Yahoo Mail's filtering system. We make every effort to deliver solicited email directly to your Inbox. Sometimes, though, we can incorrectly send a message that you want to your Spam folder. Tips to avoid having emails designated as spam: 1  Check your Spam folder: Periodically check your Spam folder to ensure that you do not miss a message. - 2  You can move a message from the Spam folder to your Inbox: Check the checkbox beside the message and select the Not Spam button"}, {"url": "http://webapps.stackexchange.com/questions/23443/how-can-i-move-an-email-to-my-inbox", "passage_text": "If you can find your message by searching for it, a button will appear at the top of the message. It says Move to inbox.. Click that button and the message will reappear in your inbox. Alternately, you can select some other label from the labels dropdown and move the message into that label category. Added : You can also find your missing message by clicking the All Mail folder and move it into the appropriate folder."}]