[{"url": "https://en.wikipedia.org/wiki/Muda_%28Japanese_term%29", "passage_text": "Muda (無駄) is a Japanese word meaning futility; uselessness; idleness; superfluity; waste; wastage; wastefulness, and is a key concept in the Toyota Production System (TPS) as one of the three types of deviation from optimal allocation of resources (muda, mura, muri). Muda has been given much greater attention as waste than the other two which means that whilst many Lean practitioners have learned to see muda they fail to see in the same prominence the variation of mura (unevenness) and muri (overburden)."}, {"url": "https://en.wikipedia.org/wiki/Lean_manufacturing", "passage_text": "Essentially, lean is centered on making obvious what adds value by reducing everything else. Lean manufacturing is a management philosophy derived mostly from the Toyota Production System (TPS) (hence the term Toyotism is also prevalent) and identified as lean only in the 1990s. Lean principles are derived from the Japanese manufacturing industry. The term was first coined by John Krafcik in his 1988 article, Triumph of the Lean Production System, based on his master's thesis at the MIT Sloan School of Management."}, {"url": "http://blog.lantech.com/blog/bid/308506/eliminate-the-muda-the-7-types-of-waste-in-lean-manufacturing", "passage_text": "We do that by eliminating the muda. Muda is a Japanese term that means waste.. Since lean manufacturing was originally a Japanese management philosophy, we often borrow Japanese terms and concepts. The foundational philosophy behind lean manufacturing is to eliminate waste. It's not to work faster or better, it's to eliminate waste of any kind that's not adding value."}, {"url": "http://www.emsstrategies.com/dm090203article2.html", "passage_text": "The seven wastes originated in Japan, where waste is known as “muda.. The seven wastes is a tool to further categorize “muda” and was originally developed by Toyota’s Chief Engineer Taiichi Ohno as the core of the Toyota Production System, also known as Lean Manufacturing. To eliminate waste, it is important to understand exactly what waste is and where it exists. While products significantly differ between factories, the typical wastes found in manufacturing environments are quite similar."}, {"url": "http://cstl-pti.semo.edu/wang/im605/ClassContents/ch-1-Intro-to-Lean.ppt", "passage_text": "Intro-To-Lean Intro-To-Lean Muda (Waste) Taiichi Ohno (1912-1990), the Toyota executive who was the most ferocious foe of waste human history has produced, identified the first seven types of muda in manufacturing system: Storage Transportation Waiting Motion Process Defects Over-production Muda is everywhere. "}, {"url": "https://en.wikipedia.org/wiki/Lean_manufacturing", "passage_text": "Lean manufacturing or lean production, often simply  lean , is a systematic method for the elimination of waste ( Muda ) within a manufacturing system. Lean principles are derived from the Japanese manufacturing industry. The term was first coined by John Krafcik in his 1988 article, Triumph of the Lean Production System, based on his master's thesis at the MIT Sloan School of Management."}, {"url": "http://www.kaizenworld.com/what-is-lean.html", "passage_text": "What is Lean. Lean is about the relentless and continuous removal of waste from the processes within an organisation and was an academic description of the Toyota Production System. A Lean Enterprise starts at the bottom of the above picture and works its way to the top employing the many tools and techniques of lean. At its final stage every component part of the organisation is part of the lean philosophy."}, {"url": "http://www.engr.psu.edu/cim/ie450/ie450ho1.pdf", "passage_text": "In the following sections, the procedures and specifics of lean will be introduced. 18.1.1 The 3 M’s of Lean Lean manufacturing is a Japanese method focused on 3M’s. These Ms are: muda, the Japanese word for waste, mura, the Japanese word for inconsistency, and muri, the Japanese word for unreasonableness. Muda specifically focuses on activities to be eliminated. "}, {"url": "http://www.allaboutlean.com/muda/", "passage_text": "March 8, 2015 History, Lean Tools Availability, Efficiency, History, Inventory, Lean Tools, Losses, Muda, OEE, Quality, Waste Christoph Roser. One popular and well-known concept of the Toyota Production System is the elimination of waste, in Japanese also called muda (無駄). It is through the popularity of the Toyota Production System, and by proxy, lean manufacturing, that it is mostly associated with Toyota. Nevertheless, it is one of the important concepts of the Toyota Production System, along with unevenness (mura) and overburden (muri)."}]