[{"url": "https://answers.yahoo.com/question/index?qid=20100307084846AA60dPu", "passage_text": "If you want to become a veterinarian, then you have to go to college for either three to four years. you have to study biology and chemistry."}, {"url": "https://answers.yahoo.com/question/index?qid=20080716174438AAZFK42", "passage_text": "I have vet school class mates who majored in anthroplogy and spanish. However the more biology based courses the better you will be in vet school. Animal scienc, biology, microbiology are all pretty common majors. So you go to undergrad for 4 years. Then you go to vet school for 4 years. Unless you want to go on and be a specialist then after your 4 years in vet school you can go and practice. Check out avma.org and avmc.org for more info."}, {"url": "http://careerplanning.about.com/od/veterinarian/tp/how-to-become-a-veterinarian.htm", "passage_text": "Most work in private practices, typically caring for small animals such as dogs, cats and birds. Find out exactly what you need to do to become a vet, including education and licensing requirements, but first see what characteristics will help make you successful in this occupation."}, {"url": "http://www.ask-the-vet.com/become-a-veterinarian.htm", "passage_text": "If you live in America, then to become a veterinarian, you will need to do 4 years of college, and then another 4 years in veterinary school and then pass a veterinary medical board examination before you qualify."}, {"url": "http://www.answers.com/Q/How_long_do_you_have_to_study_to_become_a_veterinary_nurse", "passage_text": "1 Career Overviews: Veterinary Assistant If you want to help animals without spending years in school to become a veterinarian, you might consider a career as a veterinary assistant."}, {"url": "http://vbs.psu.edu/majors/vbs/steps-to-becoming-a-veterinarian", "passage_text": "Contents. There are 30 veterinary schools accredited by the American Veterinary Medical Association (AVMA) in the U.S. There were nearly 6,800 applicants competing for approximately 2,700 openings in 2013. In other words, it is very competitive to gain admission to a veterinary school."}]