[{"url": "http://www.answers.com/Q/Name_the_ocean_between_Australia_and_Africa_and_the_Australian_city_that_is_closest_to_it", "passage_text": "Australia is an island continent so it is surrounded by water. It  is between the Pacific Ocean, the Indian Ocean And the Southern  Ocean. Each of these oceans touches Austr … alia's shores. The Indian Ocean is between Africa and Australia. I hope that this is what you are looking for :) The Southern Ocean and the Indian Ocean."}, {"url": "http://www.answers.com/Q/What_is_the_name_of_the_ocean_between_Africa_and_Australia_and_Australia_and_Australia", "passage_text": "The Atlantic is to the west of Africa. To the east of Africa and therefore west of Australia is the Indian Ocean. To the east of Australia is the Pacific Ocean. Australia is n … owhere near the Atlantic Ocean. 1 person found this useful. Answered. In Distances and Travel Times. "}, {"url": "http://studyzone.org/testprep/ss5/b/comcontocintrol.cfm", "passage_text": "The seven continents are: North America, South America, Europe, Asia, Africa, Australia/Oceania, and Antarctica. The United States is located on the continent of North America. Oceans make up most of the world's surface area. South America. South America also lies between the Atlantic and Pacific Oceans. South America is attached to North America by a small strip of land. Just like North America, the continent of South America sits to the east of the Pacific Ocean, and to the west of the Atlantic Ocean. It is north of the Southern Ocean"}, {"url": "http://www.answers.com/Q/Name_the_ocean_between_Australia_and_Africa_and_the_Australian_city_that_is_closest_to_it", "passage_text": "the indian ocean is the awnser The ocean between Africa and Australia is the Indian Ocean. The Indian Ocean is between Africa and Australia. I hope that this is what you are looking for :) The Southern Ocean and"}, {"url": "http://www.answers.com/Q/Name_the_ocean_between_Australia_and_Africa_and_the_Australian_city_that_is_closest_to_it", "passage_text": "Confidence votes 57.7K. The Indian Ocean is between Australia and Africa and Perth would be the largest Australian city on the Indian Ocean coast. The Indian Ocean is between Africa and Australia. I hope that this is what you are looking for :) The Southern Ocean and the Indian Ocean."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20070120225047AAjGwUu", "passage_text": "It is bounded on the north by Southern Asia (including the Indian subcontinent, after which it is named); on the west by the Arabian Peninsula and Africa; on the east by the Malay Peninsula, the Sunda Islands, and Australia; and on the south by the Southern Ocean. The ocean's continental shelves are narrow, averaging 200 kilometers (125 mi) in width. An exception is found off Australia's western coast, where the shelf width exceeds 1,000 kilometers (600 mi). The average depth of the ocean is 3,890 meters (12,760 ft)."}, {"url": "http://studyzone.org/testprep/ss5/b/comcontocintrol.cfm", "passage_text": "Asia is the largest of the continents. Asia is located east of Europe, so it shares its western border with Europe. To the east of Asia, lies the Pacific Ocean, which also separates Asia from North America. South of Asia, lies the Indian Ocean. The Indian Ocean separates Asia from another continent. South America. South America also lies between the Atlantic and Pacific Oceans. South America is attached to North America by a small strip of land. Just like North America, the continent of South America sits to the east of the Pacific Ocean, and to the west of the Atlantic Ocean. It is north of the Southern Ocean"}, {"url": "http://studyzone.org/testprep/ss5/b/comcontocintrol.cfm", "passage_text": "Europe sits to the east of the Atlantic Ocean, and south of the Arctic Ocean. The Atlantic Ocean separates Europe from North America. The continent of Europe shares its eastern border with another continent. This giant land mass is. . . South America. South America also lies between the Atlantic and Pacific Oceans. South America is attached to North America by a small strip of land. Just like North America, the continent of South America sits to the east of the Pacific Ocean, and to the west of the Atlantic Ocean. It is north of the Southern Ocean"}, {"url": "http://www.ducksters.com/geography/oceans.php", "passage_text": "Pacific Ocean. The Pacific Ocean is the largest of the oceans covering around one third of the Earth's surface. It separates Asia and Australia from North and South America. The Pacific Ocean got its name from the explorer Ferdinand Magellan. He called it the Mar Pacifico, meaning the peaceful sea in Portuguese. The Indian Ocean is the third largest ocean in the world. It lies south of Asia, and India, and separates East Africa from Australia. It is the warmest ocean in the world. The Indian Ocean includes the Red Sea and the Persian Gulf."}]