[{"url": "http://www.mayoclinic.org/diseases-conditions/nail-fungus/basics/complications/CON-20019319", "passage_text": "Complications. A severe case of nail fungus can be painful and may cause permanent damage to your nails. And it may lead to other serious infections that spread beyond your feet if you have a suppressed immune system due to medication, diabetes or other conditions. If you have diabetes, you may have reduced blood circulation and nerve supply in your feet. You're also at greater risk of a bacterial skin infection (cellulitis). So any relatively minor injury to your feet — including a nail fungal infection — can lead to a more serious complication. See your doctor if you have diabetes and think you're developing nail fungus. 1  Risk factors."}, {"url": "http://www.sterishoe.com/foot-care-blog/diabetes/complications-of-untreated-toenail-fungus-in-diabetics/", "passage_text": "Injuries to the skin — be it an ingrown toenail, a blister, or an opening in the nail bed — can occur without the patient’s knowledge and lead to fungal or bacterial infections like paronychia and cellulitis. In the worst case scenario, the infection may affect the bone, which is referred to as osteomyelitis."}, {"url": "http://www.a-diabetic-life.com/diabetic-fungal-infection.html", "passage_text": "Diabetic fungal infection causes yellow and thickened nails for many of us with and without type 2 diabetes. But for diabetics it can lead to a serious complication. Onychomycosis (toenail fungus) may seem to be only an annoying cosmetic issue. But if left alone, thickened yellow toenail fungus can lead to bacterial infection. That makes it something you cannot ignore, because infections in diabetic feet can end in limb amputation."}, {"url": "http://www.toenailfungusremedies.com/diabetes-nail-fungus.php", "passage_text": "For a diabetic, toenail fungus is much more than a cosmetic problem. Diabetes complications from fungus infections in the toenails and fingernails can lead to amputations of the entire limbs. To understand how serious fungal toenails can be to a diabetic, you must first understand how diabetes affects the body."}, {"url": "http://www.ehow.com/facts_5467262_toenail-fungus-side-effects.html", "passage_text": "Dangerous Side Effects. If you have diabetes or an immune disease, a fungal toenail infection could lead to a total toe or foot amputation. When you have diabetes, your blood circulation is poor, which can interfere with healing."}]