[{"url": "http://home.costhelper.com/repair-floor-joist.html", "passage_text": "1 Costs can run $10,000-$30,000 or more for a typical home, depending on its size, the extent of the extent of the damage and the ease of access to install jacks and replace the timbers. 2  If the damage is limited to just one section of floor joists, the project could run $5,000-$10,000."}, {"url": "http://www.concretenetwork.com/concrete/interiorfloors/cost.html", "passage_text": "Video on the cost of concrete floors. Depending on the level of complexity, concrete floors can cost as little as $2 to $6 a square foot or be as expensive as $15 to $30 a square foot."}, {"url": "http://www.homeadvisor.com/cost/flooring/repair-flooring/", "passage_text": "The cost to have vinyl flooring repaired is anywhere between $100 and $300 per job, though you might pay more if the damage is extensive. Vinyl flooring is durable and economic -- and there are various styles from which to choose."}, {"url": "http://www.homewyse.com/services/cost_to_repair_floor_structure.html", "passage_text": "Get an INSTANT estimate of the cost to Repair a Floor Structure! Our free calculator uses recent, trusted data to estimate costs for your Floor Structure Repair project. For a basic 120 square feet project in zip code 47474, the benchmark cost to Repair a Floor Structure ranges between $34.53 - $40.96 per square foot* . To estimate costs for your project: 1."}, {"url": "http://www.homeadvisor.com/cost/flooring/repair-flooring/", "passage_text": "The average cost to repair a hardwood floor is $200 to $650 per repair, depending on the problem and type of hardwood floor. The most common hardwood flooring repairs include masking small blemishes and refinishing and resealing surfaces."}, {"url": "http://homewyse.com/services/cost_to_install_hardwood_floor.html", "passage_text": "Our free calculator uses recent, trusted data to estimate costs for your Hardwood Floor Installation project. For a basic 120 square feet project in zip code 47474, the benchmark cost to Install a Hardwood Floor ranges between $8.56 - $11.51 per square foot* ."}]