[{"url": "http://pets.thenest.com/feed-pug-puppy-3712.html", "passage_text": "6 to 12 Months. At 6 months of age, feed your pug two times per day. If he was eating 1/3 cup at each feeding, he is now ready to eat 1/2 cup of food at each meal. It is doubtful that you will need to increase the amount of food per day even though your pug is growing. He should eat four times a day. The approximate amount he should eat is 1/4 cup to 1/2 cup of puppy food, depending upon the quality of the food."}, {"url": "https://www.petfinder.com/dogs/dog-nutrition/how-often-to-feed-your-dog/", "passage_text": "Most experts recommend feeding your dog twice a day — once in the morning and once in the evening — though puppies under five months of age should be fed three to four times a day, or as directed by your veterinarian. Thinkstock. "}, {"url": "http://dogcare.dailypuppy.com/long-puppies-eat-3-meals-day-2843.html", "passage_text": "Feeding Schedule. Your pup begins eating solid food around 3 to 4 weeks old. By 7 to 8 weeks old, he is eating only the puppy food. Once he is not nursing, he should have four meals a day that are measured and equally divided into four well-spaced intervals throughout the day. He will continue to eat four meals a day until he is 4 months old. At 4 months, he can switch to eating three times a day. At 6 months old, he can switch to two times a day"}, {"url": "http://www.peteducation.com/article.cfm?c=2+2108&aid=704", "passage_text": "You need to be there for the feedings because you want the puppy and his entire body on a set schedule. This is best accomplished by feeding the pup what he will eat at specific times on a specific schedule. Puppies under six months of age should be fed three times daily; after 6 months they may be fed twice daily. By feeding on a set schedule, the dog will then go to the bathroom on a more set schedule and make housetraining easier and faster. Make it a habit to give the puppy some quiet time after the meal."}, {"url": "http://www.answers.com/Q/How_many_times_should_you_feed_your_6_week_old_puppy", "passage_text": "… I would suggest trying to feed your puppy 3-4 times a day. Once your puppy stops growing as much you can start cutting back on meals but increasing the amounts of the other meals. My 2 year old Rottweiler still gets 3 meals a day, but she has digestive problems. By the third week, they should be started on puppy mush 3 times a day and the bottle feeding should be continued.   Prepare the puppy mush by placing 2 cups of high quality dry puppy food in a blender with 12.5 oz liquid puppy milk replacer and fill the rest of the blender with hot water."}, {"url": "http://www.dogbreedinfo.com/feeding.htm", "passage_text": "1 Dogs should be fed at the same time every day. 2  Feeding at the same time will keep your dog on a bathroom schedule. 3  Ask your vet how many times a day you should feed your dog. 4  Feed your dog the same type and brand of food every day. If you are feeding a puppy food ask your veterinarian when you should switch to adult food. Make sure the adult food you switch to is still a balanced high quality diet with the first ingredient being a specified meat that is not a by-product. 8 to 9 months. Feeding should be twice a day."}, {"url": "http://www.answers.com/Q/How_many_times_should_you_feed_your_6_week_old_puppy", "passage_text": "Depending on the dog the amount of food you feed them will vary but for an average   three week old dog you shoiuod be feeding them at least three times a day, two large … r   meals and then maybe a snack food. Make sure there diet is varied with a mixture if dry   moist food. By the third week, they should be started on puppy mush 3 times a day and the bottle feeding should be continued.   Prepare the puppy mush by placing 2 cups of high quality dry puppy food in a blender with 12.5 oz liquid puppy milk replacer and fill the rest of the blender with hot water."}, {"url": "https://answers.yahoo.com/question/index?qid=20110408193212AAGw3pL", "passage_text": "Best Answer: At 6 weeks you can feed 3 times a day. You can also phase out the canned food and feed nothing but a dry kibble. You can cut larger breeds back to 2 meals a day at 3 months. If you look at the back of the puppy food bag, there is usually a chart there telling you age/ weight/ amount to feed for the entire 24 hour period. My puppy, for example, needs to have 2-2/3 cups food per day but if I give her several treats that day she may only have about 2 cups of food."}]