[{"url": "http://www.thinkbabynames.com/meaning/1/Foster", "passage_text": "Foster /fos-ter/ [2 sylls.] as a boys' name is pronounced FAW-ster. It is of Old English origin, and the meaning of Foster is foster parent; forester; shearer; saddle-tree maker . Transferred use of the surname, an occupational name from foster, forester, forseter, or fuyster. Also variant of Forest. Kreatif forms: Fosterne, Fostertu, Fyoster. Foster is a somewhat prominent first name for males (#923 out of 1220, Top 76%) and an even more prominent last name for both adults and children (#87 out of 150436, Top 1%). (2000 U.S. Census). Shown below is the baby name popularity of Foster for boys."}, {"url": "https://answers.yahoo.com/question/index?qid=20080528125030AAWHUSv", "passage_text": "If you have seen the name related to Scotland, it probably migrated there from across the border in England. Surname: Foster This very interesting English medieval surname, the family name of the Lords Oriel of Ireland, has at least four possible origins. The first is an occupational name for a saddle tree maker, a very important occupation seven hundred or more years ago. A third possibility is that Foster is a contracted or dialectal spelling of Forester, a term which described a civil officer in charge of a forest. John Forester, who was recorded in the 1183 Pipe Rolls of the county of Surrey, was the first recorded bearer of this name. The last possible origin is very unusual."}, {"url": "http://www.surnamedb.com/Surname/Foster", "passage_text": "A third possibility is that Foster is a contracted or dialectal spelling of Forester, a term which described a civil officer in charge of a forest. John Forester, who was recorded in the 1183 Pipe Rolls of the county of Surrey, was the first recorded bearer of this name. The last possible origin is very unusual. The first is an occupational name for a saddle tree maker, a very important occupation seven hundred or more years ago. Here the derivation is from the Old French fustier, itself originating from the word fustre, meaning a block of wood. This term was introduced into Britain after the 1066 Norman French invasion."}, {"url": "http://www.surnamedb.com/Surname/Foster", "passage_text": "John Foster, who was recorded in the 1373 Court Roll of the borough of Colchester, Essex, was of this source. The surname was one of the very first into the New England colonies of America. The first is an occupational name for a saddle tree maker, a very important occupation seven hundred or more years ago. Here the derivation is from the Old French fustier, itself originating from the word fustre, meaning a block of wood. This term was introduced into Britain after the 1066 Norman French invasion."}, {"url": "https://en.wikipedia.org/wiki/Foster_(surname)", "passage_text": "From Wikipedia, the free encyclopedia. The surname Foster (Forster, or Forester) derives from the ancient title and office bestowed upon those overseeing the upkeep and administration of hunting territories belonging to either the monarch, or bishop (where empowered to grant warren). "}, {"url": "http://genealogy.about.com/od/surname_meaning/p/foster.htm", "passage_text": "FOSTER Surname Meaning & Origin: 1) The Foster surname was often used by one who served as a foster parent, or who was a foster child. 2) A forester. 3) Shearer or scissors maker, from the Old French forceter.. Foster is the 87th most popular surname in the United States. Surname Origin: English, French. Find records, queries, and lineage-linked family trees posted for the Foster surname and its variations. FOSTER Surname & Family Mailing Lists. RootsWeb hosts several free mailing lists for researchers of the Foster surname."}, {"url": "http://www.fostername.com/england.htm", "passage_text": "There have been a number of explanations as to how the name Foster originated in England. The main line is that Foster is a contracted spelling of Forester, a term which described an official in charge of a forest. In the Middle Ages, the forests and woods were almost always owned or controlled by the lord of the manor. As in England, the name means forester or forest ranger. Forster may also have been an inhabitant of Forst, a town in the Rheinpfalz. For immigrants into America, the name has often been anglicized to Foster."}, {"url": "https://www.houseofnames.com/foster-family-crest", "passage_text": "Foster Settlers in Australia in the 19th Century. 1  William Foster, English convict from Middlesex, who was transported aboard the Albion on May 17, 1823, settling in Van Diemen's Land, Australia. 1 Thomas Foster, English convict from Chester, who was transported aboard the Arab on February 22, 1834, settling in Van Diemen's Land, Austraila. 2  Mary Foster, English convict from London, who was transported aboard the Arab on December 14, 1835"}, {"url": "http://www.fostername.com/england.htm", "passage_text": "Germanic Origins. Forster (with an umlaut) or Foerster is a Germanic surname. As in England, the name means forester or forest ranger. Forster may also have been an inhabitant of Forst, a town in the Rheinpfalz. For immigrants into America, the name has often been anglicized to Foster."}]