[{"url": "http://www.politico.com/story/2014/05/obama-aca-health-care-kristie-canegallo-deputy-chief-of-staff-106770", "passage_text": "President Barack Obama has chosen health care aide Kristie Canegallo to serve as a deputy chief of staff tasked with policy implementation on a range of issues, including the Affordable Care Act, expanding internet access for schools and ending the war in Afghanistan, the White House said Friday. Before moving to the chief of staff’s office last year, Canegallo spent four years on the National Security Council staff, including two years as a senior adviser to McDonough, then the deputy national security adviser. She also worked in the Pentagon and for Goldman Sachs, where she was a credit derivatives analyst."}, {"url": "http://www.politico.com/story/2014/05/obama-aca-health-care-kristie-canegallo-deputy-chief-of-staff-106770", "passage_text": "Canegallo has served as an adviser to McDonough since he became chief of staff in early 2013, and is credited with leading the White House’s health care law implementation efforts since the launch of HealthCare.gov. Before moving to the chief of staff’s office last year, Canegallo spent four years on the National Security Council staff, including two years as a senior adviser to McDonough, then the deputy national security adviser. She also worked in the Pentagon and for Goldman Sachs, where she was a credit derivatives analyst."}, {"url": "https://en.wikipedia.org/wiki/White_House_Chief_of_Staff", "passage_text": "Originally, the duties now performed by the Chief of Staff belonged to the President's private secretary and were fulfilled by crucial confidants and advisers such as George B. Cortelyou, Joseph Tumulty, and Louis McHenry Howe to presidents Theodore Roosevelt, Woodrow Wilson, and Franklin Roosevelt, respectively. The average term of service for a White House Chief of Staff is a little under 2.5 years. John R. Steelman, under Harry S. Truman, was the last Chief of Staff to serve for an entire presidential administration. Steelman also holds the record for longest-serving Chief of Staff (six years)."}, {"url": "https://en.wikipedia.org/wiki/White_House_Deputy_Chief_of_Staff", "passage_text": "Six Deputy Chiefs of Staff have subsequently been appointed White House Chief of Staff: Dick Cheney, Ken Duberstein, Andrew Card, Erskine Bowles, John Podesta, and Joshua Bolten. White House Deputy Chief of Staff. From Wikipedia, the free encyclopedia. The White House Deputy Chief of Staff is officially the top aide to the White House Chief of Staff, who is the senior aide to the President of the United States."}, {"url": "https://en.wikipedia.org/wiki/White_House_Chief_of_Staff", "passage_text": "The White House Chief of Staff is the highest ranking employee of the White House. The position is a modern successor to the earlier role of the President's private secretary. The role was formalized as the Assistant to the President in 1946 and acquired its current name in 1961. The Chief of Staff is appointed by and serves at the pleasure of the President; it does not require Senate confirmation. The current White House Chief of Staff is Denis McDonough. The average term of service for a White House Chief of Staff is a little under 2.5 years. John R. Steelman, under Harry S. Truman, was the last Chief of Staff to serve for an entire presidential administration. Steelman also holds the record for longest-serving Chief of Staff (six years)."}, {"url": "https://en.wikipedia.org/wiki/White_House_Chief_of_Staff", "passage_text": "The Chief of Staff is assisted by one or more Deputy Chiefs of Staff. Under the Obama Administration, these roles are currently filled by Anita Decker Breckenridge (Deputy Chief of Staff for Operations) and Kristie Canegallo (Deputy Chief of Staff for Implementation). The average term of service for a White House Chief of Staff is a little under 2.5 years. John R. Steelman, under Harry S. Truman, was the last Chief of Staff to serve for an entire presidential administration. Steelman also holds the record for longest-serving Chief of Staff (six years)."}, {"url": "http://www.businessinsider.com/the-22-obama-staffers-that-make-top-salaries-2014-7", "passage_text": "Canegallo, 34, was appointed deputy chief of staff for policy implementation by President Obama in May 2014. Canegallo began at Goldman Sachs as a derivatives analyst before working for the U.S. Embassy in Afghanistan in 2007. Eggleston has enjoyed a long legal career both in and out of the White House. He worked as deputy chief counsel for the U.S. House of Representatives Select Committee charged with investigating the Iran-Contra Affair in the 1980’s, and as a partner at Washington-based law firm Kirkland & Ellis until 2014."}, {"url": "http://www.usatoday.com/story/theoval/2014/07/01/white-house-staffer-salaries-2014/11916165/", "passage_text": "He got a title bump of deputy assistant to the president, raising his salary from $68,000 to $130,000. Two assistants to the president -- Anita Decker Breckenridge and Kristie Canegallo -- were promoted to deputy chief of staff, giving them $52,200 raises to the maximum salary of $172,200. Recently promoted press secretary Josh Earnest received a 28% raise this year, from $135,000 to $172,200. Twenty-two staffers make the maximum of $172,200 -- a figure frozen since President Obama froze White House pay scales in 2010. (The president has made $400,000 a year since 2001. Members of Congress make $174,000 a year -- an amount also frozen since 2009.)."}, {"url": "https://en.wikipedia.org/wiki/White_House_Deputy_Chief_of_Staff", "passage_text": "The Deputy Chief of Staff usually has an office in the West Wing and is responsible for ensuring the smooth running of the White House bureaucracy, as well as such other duties as the Chief of Staff assigns to him or her. In some administrations, there are multiple deputy chiefs with different duties. White House Deputy Chief of Staff. From Wikipedia, the free encyclopedia. The White House Deputy Chief of Staff is officially the top aide to the White House Chief of Staff, who is the senior aide to the President of the United States."}]