[{"url": "http://www.thefreedictionary.com/reel", "passage_text": "1. A device, such as a cylinder, spool, or frame, that turns on an axis and is used for winding and storing rope, tape, film, or other flexible materials. 2. A cylindrical device attached to a fishing rod to let out or wind up the line. 3. The quantity of wire, film, or other material wound on one reel. 4"}, {"url": "https://en.wikipedia.org/wiki/Reel-to-reel_audio_tape_recording", "passage_text": "The reel-to-reel format was used in the earliest tape recorders, including the pioneering German-British Blattnerphone machines of the late 1920s which used steel tape, and the German Magnetophon machines of the 1930s. Originally, this format had no name, since all forms of magnetic tape recorders used it. 1 Mission of Burma, whose fourth member Martin Swope played a reel-to-reel tape recorder live, either playing previously recorded samples at certain times or recording part of the band's performance and playing it back either in reverse or at different speeds."}, {"url": "http://www.bigskyfishing.com/fly-fishing-articles/fly-reels-guide.php", "passage_text": "Automatic Fly Reel. The third type of fly reel retrieve system, the automatic fly reel retrieve, does just what the name suggests. The reel retrieves all fly line without the angler turning the spool at all. The fly reel, instead of having a spool which is then turned by a handle, instead has a trigger. When released, the trigger allows the fly line to zip back into the reel. This isn't needed, or actually wanted, when fly fishing for most freshwater fish-particularly when fishing on rivers. 1 Get a single retrieve fly reel (the most common). 2  Don't get an automatic or multiplying retrieve, which are nice for saltwater fishing but not for freshwater fly fishing. 3  Make sure, repeat, make sure that you match up the fly line weight with the fly reel weight."}, {"url": "https://en.wikipedia.org/wiki/Film_reel", "passage_text": "The standard length of a 35 mm film reel is 1,000 feet (305 m), which runs approximately 11 minutes for sound film (24 frames per second) and slightly longer at silent film speed (which may vary from approximately 16 to 22 frames per second). Most films have visible cues which mark the end of the reel. A 16 mm reel is 400 feet (122 m). It runs, at sound speed, approximately the same amount of time (11–12 minutes) as a 1,000-foot (305 m) 35 mm reel. A split reel is a motion picture film reel in two halves that, when assembled, hold a specific length of motion picture film that has been wound on a plastic core."}, {"url": "http://gearpatrol.com/2013/06/14/best-fly-reels/", "passage_text": "In fly fishing, the rod is the rock star. It gets all the attention when you’re bragging about the big one from your last trip. On the other hand, reels are the unsung heroes. They’re the studio musicians to the rock star rods, always ready to back you up when you come calling. Best Saltwater Reel: The Abel Super 9/10N, has a Portuguese cork Stop-a-Sub® drag – which should help you out when you tie into a 150 pound tarpon. Fishing in salt water means you need high performance and rust resistance."}, {"url": "http://www.ancestry.com/name-origin?surname=reel", "passage_text": "Reel Name Meaning. Dutch: from a shortened form of the Germanic name Radilo, itself a short form of a compound name formed with rad ‘counsel’, ‘advice’ as the first element, for example Radolf. Compare Ralph. Source: Dictionary of American Family Names ©2013, Oxford University Press. You can find out where the majority of the Reel families were living before they immigrated to the U.S and learn where to focus your search for foreign records. Immigration records can tell you an ancestor's name, ship name, port of departure, port of arrival, and destination. from the New York Passenger Lists."}, {"url": "http://www.backstage.com/advice-for-actors/professional-tips/what-should-be-on-every-actors-demo-reel/", "passage_text": "The best demo reel…starts with your name and goes immediately into a scene. Casting agents use the demo reel to identify what qualities the actor has. It needs to be concise and tight.. You don't want to have a drawn-out opening, especially a personalized on-camera introduction. Every actor's reel should contain scenes that clearly identify the actor. There should never be any confusion as to whose reel we are watching. Close-ups are good, as are scenes with people who aren't in your same demographic category. This is where the art of editing a demo reel is really important."}, {"url": "http://www.backstage.com/advice-for-actors/professional-tips/what-should-be-on-every-actors-demo-reel/", "passage_text": "Remember that your reel is not a short film. Reels are decontextualized by nature, meaning that you cannot involve viewers in the story of your scene, no matter how much you might want to. Viewers don't have to understand what's going on in your scene; they only have to believe it. Every actor's reel should contain scenes that clearly identify the actor. There should never be any confusion as to whose reel we are watching. Close-ups are good, as are scenes with people who aren't in your same demographic category. This is where the art of editing a demo reel is really important."}]