[{"url": "http://legal-dictionary.thefreedictionary.com/Injunction", "passage_text": "An injunction commands an act that the court regards as essential to justice, or it prohibits an act that is deemed to be contrary to good conscience. It is an extraordinary remedy, reserved for special circumstances in which the temporary preservation of the status quo is necessary. Contempt. An individual who violates an injunction may be punished for Contempt of court. A person is not guilty of contempt, however, unless he or she can be charged with knowledge of the injunction. Generally, an individual who is charged with contempt is entitled to a trial or a hearing."}, {"url": "http://definitions.uslegal.com/i/injunctive-relief/", "passage_text": "Injunctive Relief Law & Legal Definition. Injunctive relief consists of a court order called an injunction, requiring an individual to do or not do a specific action. It is an extraordinary remedy that courts utilize in special cases where preservation of the status quo or taking some specific action is required in order to prevent possible injustice. "}, {"url": "https://www.law.cornell.edu/wex/injunction", "passage_text": "definition. An injunction is a court order requiring a person to do or cease doing a specific action. Temporary restraining orders and preliminary injunctions are temporary injunctions"}, {"url": "http://definitions.uslegal.com/i/injunction/", "passage_text": "Injunctive relief is an equitable remedy granted when money damages are not able to compensate the plaintiff's violation of rights if an injunction is not granted. Failure to comply with a notice of an injunction is punishable by being held in contempt of court. It is an extraordinary remedy that courts utilize in special cases where preservation of the status quo or taking some specific action is required in order to prevent possible injustice."}, {"url": "https://en.wikipedia.org/wiki/Injunction", "passage_text": "For protection orders (family law & harassment), see Protection order. An injunction is an equitable remedy in the form of a court order that compels a party to do or refrain from specific acts. A party that fails to comply with an injunction faces criminal or civil penalties, including possible monetary sanctions and even imprisonment. They can also be charged with contempt of court. "}, {"url": "http://thelawdictionary.org/injunction/", "passage_text": "368, 22 Pac. 424. An injunction is a writ or order requiring a person to refrain from a particular act. It may be granted by the court in which the action is brought, or by a judge thereof, and when made by a judge it may be enforced as an order of the court. Code Civ. Proc. Cal. "}, {"url": "http://www.merriam-webster.com/dictionary/injunction", "passage_text": "Full Definition of INJUNCTION. 1. : the act or an instance of enjoining: order, admonition. 2. : a writ granted by a court of equity whereby one is required to do or to refrain from doing a specified act. — in·junc·tive \\-ˈjəŋ(k)-tiv\\ adjective. "}, {"url": "https://www.law.cornell.edu/wex/injunction", "passage_text": "An injunction is a court order requiring an individual to do or omit doing a specific action. It is an extraordinary remedy that courts utilize in special cases where preservation of the status quo or taking some specific action is required in order to prevent possible injustice. An injunction is a court order requiring a person to do or cease doing a specific action. Temporary restraining orders and preliminary injunctions are temporary injunctions"}, {"url": "http://www.legalmatch.com/law-library/article/what-is-an-injunction.html", "passage_text": "An injunction is an order issued by the court directing a party to take some action or prohibiting them from engaging in specific conduct. Injunctions may be issued through the judgment order in connection with a lawsuit. They can sometimes be filed as a separate request directly with the court. "}]