[{"url": "http://www.iloveindia.com/babynames/sanskrit-boys.html?page=1", "passage_text": "Want to give your baby boy a distinctive and unique name? Read on and check out Sanskrit baby boy names and meanings. "}, {"url": "http://www.indiachildnames.com/name.aspx?name=Ekaksh", "passage_text": "Name Ekaksh is associated to God/Goddess Shiva. Find qualities of Aries (Mesh) or Find Numerology, Lucky number, lucky days, lucky color, Auspicious stones for Ekaksh or Find Chinese zodiac sign or Birthstone for your birthday or Find compatibility of Mesh (Aries) with other zodiac signs. Similar sounding names: Ekaaksh, Ekaksha."}, {"url": "http://www.indiachildnames.com/name.aspx?name=Ekaksha", "passage_text": "Name Ekaksha is associated to God/Goddess Shiva. Find qualities of Aries (Mesh) or Find Numerology, Lucky number, lucky days, lucky color, Auspicious stones for Ekaksha or Find Chinese zodiac sign or Birthstone for your birthday or Find compatibility of Mesh (Aries) with other zodiac signs. Similar sounding names: Ekaaksh, Ekaksh. Show more information for this name. Name Ekaksha generally means Lord Shiva, is of Indian origin, Name Ekaksha is a Masculine (or Boy) name. Person with name Ekaksha are mainly Hindu by religion"}, {"url": "http://www.babynamesdirect.com/indian-baby-names/Boy/E/2", "passage_text": "The purpose of this list is to help Indian Parents in choosing names for newborn baby. Most important Task is Giving a name to the Baby that would be parents usually do because the name is for life. The Name will be with the Baby through the rest of their Life. Whether you are the Mother or Father of a New Cute Baby, This List has been created to Help the parents and can be used to suggest from the list. We Have Collected a List of Modern Indian Baby Names with their Meaning."}, {"url": "http://www.babynamesdirect.com/indian-baby-names/Boy/E/2", "passage_text": "Because Every Name has a Meaning, by taking the Name of a Child for years that will develop their personality traits according to the Meaning for his/her Name. Whether you are the Mother or Father of a New Cute Baby, This List has been created to Help the parents and can be used to suggest from the list. We Have Collected a List of Modern Indian Baby Names with their Meaning. These Names are Modern as well as Uniqu"}, {"url": "http://www.indiaparenting.com/babynames/meaning-of-Rudra.shtml", "passage_text": "Meaning of name Rudra, Origin of name Rudra, Personality of name Rudra, Gallery of Cute Indian Baby Pictures of Rudra and adorable Baby boy Photos of Rudra. All this and lots more... If you believe in Numerology, click to see if the name Rudra is lucky! "}, {"url": "http://www.iloveindia.com/babynames/hindu-boys.html?page=3", "passage_text": "Give your baby boy a Hindu name that would define his personality. Check out a list of interesting Hindu baby boy names and their meanings. "}, {"url": "http://www.indiachildnames.com/name.aspx?name=Ekaksh", "passage_text": "Name Ekaksh generally means One eyed or Lord Shiva, is of Indian origin, Name Ekaksh is a Masculine (or Boy) name. Person with name Ekaksh are mainly Hindu by religion. Name Ekaksh belongs to rashi Mesh (Aries) and Nakshatra (stars) Krithika. Find qualities of Aries (Mesh) or Find Numerology, Lucky number, lucky days, lucky color, Auspicious stones for Ekaksh or Find Chinese zodiac sign or Birthstone for your birthday or Find compatibility of Mesh (Aries) with other zodiac signs. Similar sounding names: Ekaaksh, Ekaksha."}]