[{"url": "https://www.scrum.org/Resources/The-Nexus-Guide", "passage_text": "Nexus is a framework that drives to the heart of scaling: cross-team dependencies and integration issues. It is an exoskeleton that rests on top of multiple Scrum Teams who work together to create an Integrated Increment. It builds on the Scrum framework and values. The result can be an effective development group of up to 100 people. For larger initiatives, there is Nexus+, a unification of more than one Nexus."}, {"url": "https://en.wikipedia.org/wiki/Agile_software_development", "passage_text": "Agile software development is a group of software development methods in which solutions evolve through collaboration between self-organizing, cross-functional teams. It promotes adaptive planning, evolutionary development, early delivery, continuous improvement, and encourages rapid and flexible response to change. "}, {"url": "http://www.cio.com/article/2936942/enterprise-software/introducing-the-scaled-agile-framework.html", "passage_text": "Where most agile development organizations focus at the team level, on sprints or iteration, SAFe focuses on the program, which could be five to 15 teams. The program-level sprint in SAFe is the Program Increment (PI), formerly known as the Potentially Shippable Increment (PSI). "}, {"url": "http://www.scaledagileframework.com/about/", "passage_text": "Team, Program and Portfolio. Each of these scales the essential agile elements of Value (requirements and backlogs) Teams (from development team through portfolio) and Timebox (iteration, PI, budget cycle). Clicking on each icon takes the user to an Abstract and a Detail page which elaborates on that element. Its primary user interface is a “Big Picture” graphic which highlights the individual roles, teams, activities and artifacts necessary to scale agile from the team, to teams of teams, to the enterprise level. The Big Picture describes three levels of scale:"}, {"url": "https://www.versionone.com/scaled-agile-framework/", "passage_text": "SAFe is a proven, publicly available framework for applying lean and agile practices at enterprise scale. VersionOne has extensive experience managing agile in large, complex environments and can increase the success of your SAFe implementation. WATCH SAFE WEBINAR TRY VERSIONONE FREE. VersionOne helps organizations scale agile faster, easier and smarter. Designed to simplify the adoption of enterprise agile, learn how VersionOne supports the Scaled Agile Framework (SAFe)."}, {"url": "http://incyclesoftware.com/2014/01/what-scaled-agile-framework-safe-why-should-you-care/", "passage_text": "With that in mind, I’d like to introduce the Scaled Agile Framework (or SAFe), a framework that aims to synchronize vision, planning, interdependencies, across an organization and delivery teams. The target outcome is business agility. "}, {"url": "https://www.cprime.com/services/agile-transformations/scaled-agile-transformations/scaled-agile-framework-safe/", "passage_text": "At the roots of the Scaled Agile Framework is a deep focus on iterative and incremental development, agile development, product development flow, lean thinking and field experience at enterprise scale.The core values of the Scaled Agile Framework include: 1. Code Quality. 2. Program Execution. SAFE TM, Scaled Agile Framework® and related logos, are trademarks of Leffingwell, LLC. Send to Email Address Your Name Your Email Address Cancel. Post was not sent-check your email addresses! Email check failed, please try again. Sorry, your blog cannot share posts by email."}, {"url": "http://www.scaledagileframework.com/about/", "passage_text": "The Scaled Agile Framework (“SAFe”) is a proven knowledge base for implementing agile practices at enterprise scale. Its primary user interface is a “Big Picture” graphic which highlights the individual roles, teams, activities and artifacts necessary to scale agile from the team, to teams of teams, to the enterprise level. The Big Picture describes three levels of scale:"}, {"url": "https://www.cprime.com/services/agile-transformations/scaled-agile-transformations/scaled-agile-framework-safe/", "passage_text": "The Scaled Agile Framework is a proven, publicly-facing framework for applying Lean and Agile practices at enterprise scale. This framework synchronizes alignment, collaboration and delivery in the enterprise and scales successfully to large numbers of practitioners and teams. SAFE TM, Scaled Agile Framework® and related logos, are trademarks of Leffingwell, LLC. Send to Email Address Your Name Your Email Address Cancel. Post was not sent-check your email addresses! Email check failed, please try again. Sorry, your blog cannot share posts by email."}]