[{"url": "http://ghr.nlm.nih.gov/handbook/mutationsanddisorders/predisposition", "passage_text": "Changes in many genes, each with a small effect, may underlie susceptibility to many common diseases, including cancer, obesity, diabetes, heart disease, and mental illness. In people with a genetic predisposition, the risk of disease can depend on multiple factors in addition to an identified genetic change. These include other genetic factors (sometimes called modifiers) as well as lifestyle and environmental factors. The World Health Organization offers information about genetic predisposition to several common diseases, including cancer, diabetes, cardiovascular disease, and asthma. Genetic Alliance UK offers a fact sheet on genetic predisposition to common genetic diseases."}, {"url": "http://www.phgfoundation.org/tutorials/variantsDisease/", "passage_text": "This variability may be due to an individual’s inherited genetic make-up and/or some other potentiating risk factor. Very rarely the susceptibility to develop a disease is entirely genetic or purely environmental; for most it is a combination of these factors. Introduction. Many factors are known to be important in disease causation and these can include an individual’s age, gender, genetic make-up and environmental factors that they have been exposed to, such as infectious agents or chemicals."}, {"url": "http://www.rightdiagnosis.com/medical/genetic_susceptibility.htm", "passage_text": "Genetic susceptibility: genetic characteristics that increase the probability of having a disease or disorder. These medical condition or symptom topics may be relevant to medical information for Genetic susceptibility: 1  Genetic. 2  Genetic disease. 3  Genetic disorder. 4  Genetic syndrome. 5  Susceptibility."}, {"url": "http://ghr.nlm.nih.gov/handbook/mutationsanddisorders/predisposition", "passage_text": "Genetic variations can have large or small effects on the likelihood of developing a particular disease. For example, certain mutations in the BRCA1 or BRCA2 genes greatly increase a person’s risk of developing breast cancer and ovarian cancer. The World Health Organization offers information about genetic predisposition to several common diseases, including cancer, diabetes, cardiovascular disease, and asthma. Genetic Alliance UK offers a fact sheet on genetic predisposition to common genetic diseases."}, {"url": "http://www.gga.org.il/?section=62", "passage_text": "Genetic tests are performed to determine genetic susceptibility to diseases such as breast and ovarian cancer, cancer of the colon and other types of cancer. Such results have many consequences in preventive medicine for the healthy person and in the medical treatment of those who are unwell. The differences in the type or dosage of the medications are related to the differences in the genetic background of the patient. By means of genetic tests, it is possible to significantly improve the efficacy of the medicinal treatment and to reduce the damage of adverse effects, in a wide variety of diseases."}, {"url": "http://ghr.nlm.nih.gov/handbook/mutationsanddisorders/predisposition", "passage_text": "A genetic predisposition (sometimes also called genetic susceptibility) is an increased likelihood of developing a particular disease based on a person’s genetic makeup. A genetic predisposition results from specific genetic variations that are often inherited from a parent. The World Health Organization offers information about genetic predisposition to several common diseases, including cancer, diabetes, cardiovascular disease, and asthma. Genetic Alliance UK offers a fact sheet on genetic predisposition to common genetic diseases."}, {"url": "http://www.gga.org.il/?section=62", "passage_text": "Medical genetic tests. Tests for Genetic Susceptibility to Diseases. Tests for the susceptibility to genetic diseases, such as colon cancer, heart disease and other diseases, enable the prevention, diagnosis and significant improvement in the treatment of these diseases. The differences in the type or dosage of the medications are related to the differences in the genetic background of the patient. By means of genetic tests, it is possible to significantly improve the efficacy of the medicinal treatment and to reduce the damage of adverse effects, in a wide variety of diseases."}, {"url": "http://www.who.int/genomics/public/geneticdiseases/en/index3.html", "passage_text": "Genes and noncommunicable diseases. Most diseases involve many genes in complex interactions, in addition to environmental influences. An individual may not be born with a disease but may be at high risk of acquiring it. This is called as genetic predisposition or susceptibility. CVD may also result from a variety of genetic causes, including single-gene mutations, the interaction of multiple genes and environmental factors. Economic transition, urbanisation, industrialization and globalisation bring about lifestyle changes that promote heart disease."}, {"url": "http://ghr.nlm.nih.gov/glossary%3Dgeneticpredisposition", "passage_text": "Increased susceptibility to a particular disease due to the presence of one or more gene mutations, and/or a combination of alleles (haplotype), not necessarily abnormal, that is associated with an increased risk for the disease, and/or a family history that indicates an increased risk for the disease. "}, {"url": "http://www.aafp.org/afp/1999/0901/p748.html", "passage_text": "Genetic factors have been implicated in illnesses such as cancer, heart disease and Alzheimer's disease, which are widespread in the population. However, genetic testing for mutations that may influence disease susceptibility is appropriate only for a relatively few patients who are known to be at high risk. As genetic testing for disease susceptibility is incorporated into clinical practice, family physicians will increasingly provide initial genetic counseling and referrals for testing."}]