[{"url": "http://work.chron.com/salaries-geography-careers-10794.html", "passage_text": "Geography is the study of location and how it affects people, animals, economies and environments. According to Georgetown University, holders of bachelor’s degrees in the field made a median $54,000 annually, as of 2011. Those with master’s degrees earned 42 percent more, for a median $76,680 per year. Postsecondary Teachers. Postsecondary teachers made a mean $72,300 per year, with an annual range of $40,110 to $113,600, as of May 2011, according to the BLS. Because they do not work regular hours, the BLS could not calculate their hourly rates. These teachers instruct students at colleges and universities about geography"}, {"url": "http://work.chron.com/salaries-geography-careers-10794.html", "passage_text": "Cartographers and photogrammetrists earned a mean $60,110 per year, or $28.90 per hour, as of May 2011, according to the U.S. Bureau of Labor Statistics. The lowest paid 10 percent made less than $34,810 annually, or $16.74 hourly, while the best paid 10 percent received more than $92,310 per year, or $44.38 per hour. Postsecondary Teachers. Postsecondary teachers made a mean $72,300 per year, with an annual range of $40,110 to $113,600, as of May 2011, according to the BLS. Because they do not work regular hours, the BLS could not calculate their hourly rates. These teachers instruct students at colleges and universities about geography"}, {"url": "http://www.savethestudent.org/student-jobs/whats-the-expected-salary-for-your-degree.html", "passage_text": "The average graduate starting salary is a fairly robust £25,000, though we’ve also seen folk reporting anything between £16,000 and £70,000! Who gets what depends on what subject you study, what industry you go into and even where in the country your dream job is based. Cue our guide to first-job wages. It’s easy to think of Law as a quick win for your pay packet, but the reality is starting salaries vary massively. At the most competitive firms, you could get between £22,000 and £42,000 as a Trainee Solicitor. Elsewhere, £16,000 to £30,000 is the going average."}, {"url": "http://work.chron.com/salaries-geography-careers-10794.html", "passage_text": "According to the BLS, urban and regional planners earned a mean $67,350 per year, or $32.38 per hour, as of May 2011. The lowest paid made less than $41,040 annually, or $19.73 hourly. The highest earning received more than $98,060 yearly, or $47.14 per hour. Postsecondary Teachers. Postsecondary teachers made a mean $72,300 per year, with an annual range of $40,110 to $113,600, as of May 2011, according to the BLS. Because they do not work regular hours, the BLS could not calculate their hourly rates. These teachers instruct students at colleges and universities about geography"}, {"url": "http://study.com/articles/Average_Starting_Salary_for_a_Masters_Degree_Graduate.html", "passage_text": "The average starting salary for individuals with a master's degree depends on their field of study, among other factors. Keep reading to learn about some of the average starting salaries for graduates of master's degree programs in such fields as business, engineering, computer science and the humanities. The earnings for humanities program graduates were similar, regardless of field. Graduates of special education master's degree programs earned the highest average starting salaries among students completing education programs."}, {"url": "http://www.simplyhired.com/salaries-k-geography-jobs.html", "passage_text": "Average Geography Salaries. The average salary for geography jobs is $50,000. Average geography salaries can vary greatly due to company, location, industry, experience and benefits. This salary was calculated using the average salary for all jobs with the term geography anywhere in the job listing."}, {"url": "http://www.simplyhired.com/salaries-k-college-graduate-jobs.html", "passage_text": "Average College Graduate Salaries. The average salary for college graduate jobs is $46,000. Average college graduate salaries can vary greatly due to company, location, industry, experience and benefits. "}, {"url": "http://www.savethestudent.org/student-jobs/whats-the-expected-salary-for-your-degree.html", "passage_text": "A first salary in Retail Management will likely be in the range of £12,000-£22,000, but some graduate training schemes pay handsomely for impressive candidates. Budget supermaket chain Aldi is a go-to for its grad scheme, which pays £42,000 in the first year. It’s easy to think of Law as a quick win for your pay packet, but the reality is starting salaries vary massively. At the most competitive firms, you could get between £22,000 and £42,000 as a Trainee Solicitor. Elsewhere, £16,000 to £30,000 is the going average."}, {"url": "http://study.com/articles/Average_Starting_Salary_for_a_Masters_Degree_Graduate.html", "passage_text": "The average starting salary for master's degree graduates can vary greatly based off of several factors, including the type of degree earned. For example, a computer science program graduate typically earns more than someone who graduates from a sociology program, even though they both hold a master's degree. The earnings for humanities program graduates were similar, regardless of field. Graduates of special education master's degree programs earned the highest average starting salaries among students completing education programs."}]