[{"url": "https://simple.wikipedia.org/wiki/Lion", "passage_text": "The lion (Panthera leo) is a large mammal of the Felidae (cat) family. Some large males weigh over 250 kg (550 lb), so it is the second-largest living cat after the tiger. Today, wild lions live in sub-Saharan Africa and in Asia. Lions are adapted for life in grasslands and mixed areas with trees and grass. "}, {"url": "http://www.ign.com/boards/threads/why-is-the-lion-called-the-king-of-the-jungle.452971262/", "passage_text": "Lions have been called the king of beasts for centuries, due to their majestic appearance and position as a top predator. In addition, male lions stalking among their females and cubs may remind humans of a king lording it over his subjects. Also, male lions are the protectors of the pride-their main role is to defend the territory and the cubs from intruding males. These lions are probably more fitting of the title king of the jungle than their African cousins, but equally there are other majestic top predators, like tigers, that could also be considered deserving of the title. Source(s): I used to be a zookeeper and have studied animals all my life. Click to expand.."}, {"url": "http://gaudet.info/LEARNIN1/GAUDET/ENVIROW3/ENDANGER/LIONS.HTM", "passage_text": "Lions also rest about 20 hours a day. In a sense, they have the life of kings. They eat, drink and sleep and do away with pests. This is why lions are considered the kings of the jungle. I once saw a documentary on lions. At the end of this documentary a pride of lions was being attacked by a pack of hyenas. The hyenas were attacking the cubs; the lionesses were doing their best to keep the hyenas away, but the hyenas kept coming back."}, {"url": "http://www.ccel.org/c/cook/animals/h/webdoc16.htm", "passage_text": "The Lion. The boldness of the lion is noticed in a verse in Isaiah: Like as the lion and the young lion roaring on his prey, when a multitude of shepherds is called forth against him, he will not be afraid of their voice, nor abase himself for the noise of them.. "}, {"url": "http://gaudet.info/LEARNIN1/GAUDET/ENVIROW3/ENDANGER/LIONS.HTM", "passage_text": "Lions live in Africa south of the Sahara and in Northwest India. Lions don't actually live in the jungle. Their real habitat is the open savanna where they hunt mammals such as gazelles, antelope, and zebra. They may also cooperate to catch larger mammals such as buffalo, giraffes and even crocodiles. This is why lions are considered the kings of the jungle. I once saw a documentary on lions. At the end of this documentary a pride of lions was being attacked by a pack of hyenas. The hyenas were attacking the cubs; the lionesses were doing their best to keep the hyenas away, but the hyenas kept coming back."}, {"url": "http://gaudet.info/LEARNIN1/GAUDET/ENVIROW3/ENDANGER/LIONS.HTM", "passage_text": "One lion will scare out prey towards the others making it difficult to escape. Lions live in groups called prides. These prides usually consist of as many as 15 lionesses and their young, and 3 adult males. An average lion's body is 4 1/2 to 6 1/2 feet long, and their tails are 26 1/4 inches long to 3 1/4 feet. This is why lions are considered the kings of the jungle. I once saw a documentary on lions. At the end of this documentary a pride of lions was being attacked by a pack of hyenas. The hyenas were attacking the cubs; the lionesses were doing their best to keep the hyenas away, but the hyenas kept coming back."}, {"url": "https://en.wikipedia.org/wiki/Lions", "passage_text": "The lion (Panthera leo) is one of the five big cats in the genus Panthera and a member of the family Felidae. The commonly used term African lion collectively denotes the several subspecies found in Africa. With some males exceeding 250 kg (550 lb) in weight, it is the second-largest living cat after the tiger."}]