[{"url": "http://homeguides.sfgate.com/average-cost-hardwood-floor-installation-sanding-finishing-67958.html", "passage_text": "Typical Costs. The cost for installation of a hardwood floor is usually quoted on a per-square-foot basis. The total cost of a given floor can vary greatly depending on the cost of the flooring material you choose and your location, but you can expect the range to be between $5 and $10 per square foot. The cost of a hardwood floor can vary greatly depending on the type of wood you choose. Because a well-finished hardwood floor requires careful craftsmanship and a relatively large amount of labor, the overall cost of a flooring project is divided almost equally between labor and material costs."}, {"url": "http://www.rempros.com/hardwood_installation_cost.html", "passage_text": "By default, hardwood floors installation cost calculator estimates labor fees to install prefinished solid wood flooring strips or planks in two average size bedrooms, one living room and a hallway. "}, {"url": "http://homewyse.com/services/cost_to_install_hardwood_floor.html", "passage_text": "Our free calculator uses recent, trusted data to estimate costs for your Hardwood Floor Installation project. For a basic 120 square feet project in zip code 47474, the benchmark cost to Install a Hardwood Floor ranges between $8.56 - $11.51 per square foot* . To estimate costs for your project: 1. Set Project Zip Code Enter the Zip Code for the location where labor is hired and materials purchased. 2."}, {"url": "http://www.answers.com/Q/What_is_the_average_labor_costs_for_hardwood_flooring_installation", "passage_text": "Hardwood floors have two main costs. The cost of the flooring, which ranges from about $4.50 per square foot and up. The cost of labor which typically runs between $3.00 to $5 … .00 per square foot. There will be added costs if the contractor has to tear up an old floor.   So measure the room dimensions. Say $5.00 per sqft for flooring and $4.00 per sqft for labor = $9.00 per sqft total. Then this job should cost about $9 x 300 = $2700.   The numbers above are for standard 3/4 thick hardwood flooring that requires nailing. Another alternative is a much thinner wood (about 3/8 thick) which is about $3.00 per sqft"}, {"url": "http://www.answers.com/Q/What_is_the_average_cost_to_install_hardwood_flooring", "passage_text": "Hardwood floors have two main costs. The cost of the flooring, which ranges from about $4.50 per square foot and up. The cost of labor which typically runs between $3.00 to $5.00 per square foot. There will be added costs if the contractor has to tear up an old floor. So measure the room dimensions. Then multiply by some reasonable number for the wood price & labor. Say $5.00 per sqft for flooring and $4.00 per sqft for labor = $9.00 per sqft total. Then this job should cost about $9 x 300 = $2700. The numbers above are for standard 3/4 thick hardwood flooring that requires nailing. Another alternative is a much thinner wood (about 3/8 thick) which is about $3.00 per sqft"}]