[{"url": "http://squirrel-attic.com/jump.html", "passage_text": "My Response: I'm not sure how far squirrels can jump. Height matters a great deal, of course, and some running space. I'd say about ten feet, believe it or not. I think you'll have a heck of a time keeping squirrels from jumping on your house. Reader Email: Hi David, Your site came up via my google query."}, {"url": "http://blog.newenglandbirdhouse.com/backyard-birding/frustrating-squirrels-tips-for-squirrel-proofing-bird-feeders/", "passage_text": "Squirrels can jump up to 4 feet high, and can launch themselves from a tree or roof to a target as far as 6 feet away. A bird feeder placed on a 5 foot or taller pole and at least 7-8 feet from any structure will provide the best chance of deterring squirrels."}, {"url": "http://www.birdsforever.com/bird-feeder-squirrel-problems.html", "passage_text": "You can beat squirrels at their own game, but you need to know a few game rules: Squirrels can jump great distances. They can jump 5 to 6 feet straight up from the ground, or from any surrounding surface like a tree or house. Just think how far they can jump if they have a running start! Squirrels are problem solvers."}, {"url": "http://www.wbu.com/education/squirrels.html", "passage_text": "One of the most effective ways to keep squirrels from feeders is to place a baffle on the pole or above a feeder and situate the feeder so the squirrel cannot reach it. Squirrels can jump 4-5 feet high and across 5-10 feet. A baffle will make it harder for the squirrels to reach the seed. Visit one of our Wild Birds Unlimited stores and we will show you all the different ways to help keep squirrels from reaching your feeders."}, {"url": "http://www.all-science-fair-projects.com/print_project_1414_78?print=1", "passage_text": "Observation. It was observed that the squirrels were able to jump an average distance of between 1 meter and 1.5 meters. The furthest jump was 1.5 meters, achieved by squirrel number 2 and number 4."}, {"url": "http://lansingwbu.blogspot.com/2012/01/how-high-can-squirrels-jump-to-bird.html", "passage_text": "Squirrel Fun Facts. • Squirrels can jump up to 5 to 6 feet vertically, and they can leap 8 to 10 feet between objects. • Squirrels have 5 toes on their back feet and 4 toes on their front. Their front toes are very sharp and help in gripping tree bark for climbing."}]