[{"url": "https://en.wikipedia.org/wiki/Bronchus", "passage_text": "A bronchus, also known as a main or primary bronchus, is a passage of airway in the respiratory tract that conducts air into the lungs. There is a right bronchus and a left bronchus and these bronchi branch into smaller secondary and tertiary bronchi which branch into smaller tubes, known as bronchioles. No gas exchange takes place in the bronchi."}, {"url": "http://medical-dictionary.thefreedictionary.com/bronchial+tree", "passage_text": "bronchial tree, an anatomic complex of the trachea and bronchi. The bronchi branch from the trachea. The right bronchus is wider and shorter than the left bronchus and branches into three secondary bronchi, one passing to each of the three lobes of the right lung. bronchial tree the bronchi and their branching structures; see color plates. tracheobronchial tree the trachea, bronchi,"}, {"url": "http://training.seer.cancer.gov/anatomy/respiratory/passages/bronchi.html", "passage_text": "In the mediastinum, at the level of the fifth thoracic vertebra, the trachea divides into the right and left primary bronchi. The bronchi branch into smaller and smaller passageways until they terminate in tiny air sacs called alveoli. As the branching continues through the bronchial tree, the amount of hyaline cartilage in the walls decreases until it is absent in the smallest bronchioles. As the cartilage decreases, the amount of smooth muscle increases."}, {"url": "http://www.healthline.com/human-body-maps/lung-trachea-bronchial-tree", "passage_text": "In Depth: Bronchial Tree. Trachea. The trachea, also called the windpipe, is part of the passageway that supplies air to the lungs. Any prolonged blockage, even for a few minutes, can cause death. They lead to the alveoli by way of alveolar ducts. Bronchial tree. Together, the trachea and the two primary bronchi are referred to as the bronchial tree. At the end of the bronchial tree lie the alveolar ducts, the alveolar sacs, and the alveoli. The tubes that make up the bronchial tree perform the same function as the trachea: they distribute air to the lungs"}, {"url": "http://www.wisegeek.com/what-is-the-bronchial-tree.htm", "passage_text": "The bronchial tree is an essential part of the respiratory system. It consists of several interacting structures, such as the bronchi, bronchioles, and alveoli. These structures work together to provide a network system between the lungs and the trachea. Without this system, a person could not breathe properly. The bronchial tree begins with the primary bronchi and ends with the alveoli. Inhaled corticosteroids help control narrowing and inflammation in the bronchial tubes. An accumulation of fluid in the alveoli may occur as a result of pneumonia."}, {"url": "http://innvista.com/health/anatomy/bronchial-tree/", "passage_text": "The Bronchial tree consists of bronchi, bronchioles, and alveoli. Bronchi are formed as the lower part of the trachea divides into two tubes. The primary portion enters the lungs at a region called the hilus. The primary branch forms a secondary branch, which then branches into smaller tertiary bronchi. Bronchial Tree. Trachea is also known as the windpipe. It is a tube about 10-12.5 cm long (4-5 inches) and about 2.5 cm wide (1 inch). The trachea extends from the lower edge of the larynx downward into the thoracic cavity, where it splits into right and left bronchi. Rings of cartilage keep the airway open."}, {"url": "http://www.medicalook.com/human_anatomy/organs/Bronchial_tree.html", "passage_text": "The bronchial tree is aptly named for its resemblance to the branches of a tree, as larger tubes perpetually concede to smaller tube in an intricate framework of branches. Right around the level of the sternal angle, just posterior to the manubrium, the trachea splits off into the right and left primary bronchi. "}, {"url": "http://medical-dictionary.thefreedictionary.com/bronchial+tree", "passage_text": "tree. an anatomic structure with branches resembling a tree. bronchial tree the bronchi and their branching structures; see color plates. tracheobronchial tree the trachea, bronchi, and their branching structures; see color plates."}, {"url": "http://training.seer.cancer.gov/anatomy/respiratory/passages/bronchi.html", "passage_text": "The cartilage and mucous membrane of the primary bronchi are similar to that in the trachea. As the branching continues through the bronchial tree, the amount of hyaline cartilage in the walls decreases until it is absent in the smallest bronchioles. As the cartilage decreases, the amount of smooth muscle increases."}]