[{"url": "http://www.motorboatsurveys.com/survey-pricing.html", "passage_text": "Based on these rough estimates, the base cost of a marine survey for a 28-foot sailing yacht might be about $300 to $500, while a 42-foot yacht survey might cost around $600 to $800. Additional fees for travel time or special services may be involved. Be sure to check with your marine surveyor for any additional fees. Here are some approximate marine survey fees that you might expect to pay for a professional powerboat survey: 1  $10-$17 per foot up to 30 feet. 2  $14-$22 per foot for boats from 31 feet to 40 feet. 3  $16-$20 per foot for boats over 40 feet"}, {"url": "http://www.admiraltyservices.com/Boating_Tips/marine_surveys.htm", "passage_text": "A survey s total cost includes the surveyor s fee, and the boat s haul-out costs. You can expect to pay between $8 and $14 per linear foot of boat length for the surveyor s fee. Some surveyors may charge by the hour and bill for travel expenses. "}, {"url": "http://www.thehulltruth.com/boating-forum/68265-marine-surveyor-cost.html", "passage_text": "Posts: 5,214. Re: Marine Surveyor Cost. This summer I paid $12/per foot for the hull/systems survey plus $250 to the yard for a 'short haul' - lift it out of the water for an hour or so so the surveyor can check the hull. Another $350 for the twin diesels to be checked by an engine surveyor, oil and tranny fluid analysis included. RE: Marine Surveyor Cost. Recently done in SW Florida: It cost me the loss of a purchase of a used boat because it seems the seller is balking on fixing a hull void on a SW Fla W/A. Cost was $15.00 ft, had a low quote of $12.00 Engine diag and ck was another $200.00."}, {"url": "http://www.thehulltruth.com/boating-forum/68265-marine-surveyor-cost.html", "passage_text": "Posts: 980. Re: Marine Surveyor Cost. I found a lot depends on location, if your in a market where there are a number of surveyors $15/ft is pretty reasonable. I tried to get a boat looked at in the middle of Georgia and the quotes I got were 2x that for a basic survey. RE: Marine Surveyor Cost. Recently done in SW Florida: It cost me the loss of a purchase of a used boat because it seems the seller is balking on fixing a hull void on a SW Fla W/A. Cost was $15.00 ft, had a low quote of $12.00 Engine diag and ck was another $200.00."}, {"url": "http://www.allfloridamarinesurvey.com/id12.html", "passage_text": "Any information relayed to other parties will be at the request of the client. All Florida Marine Survey is an independent company and is not affiliated with Insurance Companies, Boat Dealerships, or Boat Brokers. Marine Survey Rates are $20 per foot.Sailboat surveys are $20 per foot. Mast and Rigging inspection is included in this price. For boats 25 foot or less, per foot rate does not apply. Boats 25 feet or less are a flat rate of $500.00. "}, {"url": "http://www.thehulltruth.com/boating-forum/68265-marine-surveyor-cost.html", "passage_text": "Re: Marine Surveyor Cost. Most surveys in this area (coastal Carolinas) are between $10 and $15 per foot.....some surveyors also have a minimum charge. These fees do not cover haul out or engine/generator surveys. RE: Marine Surveyor Cost. Recently done in SW Florida: It cost me the loss of a purchase of a used boat because it seems the seller is balking on fixing a hull void on a SW Fla W/A. Cost was $15.00 ft, had a low quote of $12.00 Engine diag and ck was another $200.00."}, {"url": "https://www.boatus.com/insurance/survey.asp", "passage_text": "Welcome! This directory is designed to help you find a professional marine surveyor in your area. Please note that BoatUS does not endorse or guarantee the performance of surveyors. No warranties expressed or implied are intended or created by this directory. "}, {"url": "http://www.pcmarinesurveys.com/My%20fee%20schedule.htm", "passage_text": "Pre-purchase marine surveys on a used boat is usually FREE ! Pre-purchase marine surveys on a new boat is sometimes FREE ! Any decent marine surveyor will almost always find enough deficiencies on a used boat to more than cover the cost of the survey if you choose to negotiate those deficiencies into the price..... I believe my fees are commensurate with other truly qualified and Accredited Marine Surveyors in Ontario but there are non-accredited surveyors who will work for $8 or $9.00 per foot and I am sure they are worth every penny."}]