[{"url": "http://www.aa1car.com/library/map_sensors.htm", "passage_text": "The Manifold Absolute Pressure (MAP) sensor is a key sensor because it senses engine load. The sensor generates a signal that is proportional to the amount of vacuum in the intake manifold. But the MAP sensor doesn't care because it just monitors the absolute pressure inside the intake manifold. On engines with a speed-density electronic fuel injection system, airflow is estimated rather than measured directly with an airflow sensor."}, {"url": "http://www.carsdirect.com/car-repair/how-to-tell-if-you-have-a-faulty-manifold-pressure-sensor", "passage_text": "A vehicle's manifold pressure sensor, or manifold absolute pressure sensor (MAP), is part of an engine's electronic control system. It's usually found in vehicles that use fuel injection. "}, {"url": "http://www.1aauto.com/map-sensor/c/160", "passage_text": "A manifold absolute pressure sensor, commonly abbreviated to MAP sensor, is used in some fuel injection engines to determine the pressure in the intake manifold, and then provides a signal on engine load to the vehicle’s engine control unit (ECU). In vehicles that are turbocharged or supercharged, the MAP sensor also reads the amount of boost pressure. The MAP sensor has a vacuum tube attached to the intake manifold and a vacuum or calibrated pressure area. Between them is a silicon chip that flexes due to the pressure difference between the two areas."}, {"url": "https://answers.yahoo.com/question/index?qid=20070704032303AA9WZK6", "passage_text": "Rating Newest Oldest. Best Answer: Actually manifold pressure is the Difference between the air pressure (or vacuum) inside the intake manifold and the relative atmospheric pressure of the air around the engine. Without a supercharger or turbocharger, both of which force more air into the intake manifold, the maximum manifold pressure is the ambient pressure around the airplane, with a slight loss due to the throttle plate."}, {"url": "https://answers.yahoo.com/question/index?qid=20070704032303AA9WZK6", "passage_text": "Report Abuse. Manifold pressure is the absolute atmospheric pressure in the intake manifold of the engine. It may either be below (vacuum) or above (tubocharged / supercharged) than ambient air pressure. Without a supercharger or turbocharger, both of which force more air into the intake manifold, the maximum manifold pressure is the ambient pressure around the airplane, with a slight loss due to the throttle plate."}, {"url": "http://www.aa1car.com/library/map_sensors.htm", "passage_text": "HOW A MAP SENSOR WORKS. MAP sensors are called manifold absolute pressure sensors rather than intake vacuum sensors because they measure the pressure (or lack thereof) inside the intake manifold. When the engine is not running, the pressure inside the intake manifold is the same as the outside barometric pressure. But the MAP sensor doesn't care because it just monitors the absolute pressure inside the intake manifold. On engines with a speed-density electronic fuel injection system, airflow is estimated rather than measured directly with an airflow sensor."}, {"url": "http://www.youtube.com/watch?v=gq4szm5Re0g", "passage_text": "What is a MAP sensor? How does a manifold absolute pressure sensor work? This video explains how a MAP sensors detect manifold pressure and use this information to determine how much fuel to inject into the engine cylinders. Please feel free to rate, comment, and subscribe! And don't forget to check out my Facebook page: http://www.facebook.com/engineeringex..."}, {"url": "http://www.obd-codes.com/faq/map-sensor.php", "passage_text": "The Manifold Absolute Pressure MAP sensor is a sensor that is attached to the intake manifold on a car's engine. The MAP sensor responds to changes in the intake manifold pressure (vacuum) and provides a reading of engine load. "}, {"url": "http://www.askacfi.com/421/what-is-manifold-pressure.htm", "passage_text": "The manifold pressure gauge is an engine instrument typically used in piston aircraft engines to measure the pressure inside the induction system of an engine. In other words, it literally reads the pressure inside the induction system. In normally aspirated engines (non turbo-charged), the manifold pressure gauge has a range of anwhere between 10 – 40 in. hg (or inches of mercury). In a turbocharged engine, the manifold pressure is allowed to go as high as the engine manufacturer allows."}]