[{"url": "http://www.mayoclinic.org/tests-procedures/radiation-therapy/basics/definition/PRC-20014327", "passage_text": "Radiation therapy is a type of cancer treatment that uses beams of intense energy to kill cancer cells. Radiation therapy most often gets its power from X-rays, but the power can also come from protons or other types of energy."}, {"url": "http://www.medicinenet.com/radiation_therapy/article.htm", "passage_text": "In radiation therapy (also called radiotherapy), invisible high-energy rays or beams of subatomic particles are used to damage cancer cells and can stop them from growing and dividing. This ultimately can kill the cancer cells treated with radiation. A specialist in radiation therapy is called a radiation oncologist."}, {"url": "http://www.breastcancer.org/treatment/radiation", "passage_text": "Radiation therapy — also called radiotherapy — is a highly targeted and highly effective way to destroy cancer cells in the breast that may stick around after surgery. Radiation can reduce the risk of breast cancer recurrence by about 70%."}, {"url": "http://www.cancer.org/treatment/treatmentsandsideeffects/treatmenttypes/radiation/understandingradiationtherapyaguideforpatientsandfamilies/understanding-radiation-therapy-what-is-radiation-therapy", "passage_text": "It uses high-energy particles or waves, such as x-rays, gamma rays, electron beams, or protons, to destroy or damage cancer cells. Other names for radiation therapy are radiotherapy, irradiation, or x-ray therapy. Radiation can be given alone or used with other treatments, such as surgery or chemotherapy."}, {"url": "http://www.gvsu.edu/rt/about-radiation-therapy-3.htm", "passage_text": "Radiation therapy is a radiologic imaging sciences specialty that is one of the disciplines in a radiation oncology center. Radiation therapists practice in a cooperative effort between medical and radiation oncology physicians, medical physicists, dosimetrists, oncology nurses and dietitians."}, {"url": "http://www.ranzcr.edu.au/radiation-oncology/who-is-a-radiation-oncologist", "passage_text": "Email. A radiation oncologist is a medical specialist who has specific postgraduate training in management of patients with cancer, in particular, involving the use of radiation therapy (also called radiotherapy) as one aspect of their cancer treatment."}, {"url": "http://my.clevelandclinic.org/services/cancer/treatments-procedures/radiation-therapy/what-is-radiation-therapy", "passage_text": "Radiation therapy is a form of cancer treatment that uses radiation (strong beams of energy) to kill cancer cells or keep them from growing and dividing."}, {"url": "http://curesearch.org/Radiation-for-Kids", "passage_text": "Radiation therapy is the use of high energy X-rays to kill cancer cells. Radiation therapy is used to target tumors in specific locations. By delivering radiation to the tumor ’s exact location, doctors hope to shrink its size."}, {"url": "http://www.cancer.gov/about-cancer/treatment/types/radiation-therapy/radiation-fact-sheet", "passage_text": "Radiation therapy uses high-energy radiation to shrink tumors and kill cancer cells (1). X-rays, gamma rays, and charged particles are types of radiation used for cancer treatment."}]