[{"url": "http://cnacareer.org/jobs/ar/", "passage_text": "Arkansas CNA Salary. The average salary for nursing assistants in Arkansas as of October 2010 was $29,000 annually. Experience weighs in on the rate of pay, as does quality of work and care provided. Some beginning CNAs may start out at around $20,000 a year and aides with years of experience can make much higher than the state average."}, {"url": "http://nursejournal.org/certified-nursing-assistant/cna-careers-salary-outlook/", "passage_text": "Average Certified Nursing Assistant salaries for job postings in Alaska are 26% lower than average Certified Nursing Assistant salaries for job postings nationwide. The average salary ranks 47th among states in the country."}, {"url": "http://nursejournal.org/certified-nursing-assistant/cna-careers-salary-outlook/", "passage_text": "Average Certified Nursing Assistant salaries for job postings in Alabama are 1% higher than average Certified Nursing Assistant salaries for job postings nationwide. The average salary ranks 9th among states in the country."}, {"url": "http://www.indeed.com/salary/q-CNA-l-Arkansas.html", "passage_text": "Average CNA salaries for job postings in Arkansas are 2% higher than average CNA salaries for job postings nationwide."}, {"url": "http://www.indeed.com/salary/q-Certified-Nursing-Assistant-l-Arkansas.html", "passage_text": "Average Certified Nursing Assistant salaries for job postings in Arkansas are 2% higher than average Certified Nursing Assistant salaries for job postings nationwide."}, {"url": "http://www.alliedhealthworld.com/arkansas-cna-salary.html", "passage_text": "CNAs in the United States are earning an average salary of $27,000/yr. CNAs in Arkansas are earning a comparative average salary of $25,000/yr. The salary averages for the five largest cities in Arkansas are as follows: Little Rock: $21,000/yr."}, {"url": "http://nursejournal.org/certified-nursing-assistant/cna-careers-salary-outlook/", "passage_text": "Average Certified Nursing Assistant salaries for job postings in Arkansas are 1% higher than average Certified Nursing Assistant salaries for job postings nationwide. The average salary ranks 13th among states in the country."}, {"url": "http://nursejournal.org/certified-nursing-assistant/cna-careers-salary-outlook/", "passage_text": "Average Certified Nursing Assistant salaries for job postings in Arizona are 18% lower than average Certified Nursing Assistant salaries for job postings nationwide. The average salary ranks 43rd among states in the country."}]