[{"url": "http://geography.about.com/od/physicalgeography/a/tradewinds.htm", "passage_text": "Trade Winds. Blowing from the subtropical highs or horse latitudes toward the low pressure of the ITCZ are the trade winds. Named from their ability to quickly propel trading ships across the ocean, the trade winds between about 30° latitude and the equator are steady and blow about 11 to 13 miles per hour. The doldrums, usually located between 5° north and 5° south of the equator, are also known as the Intertropical Convergence Zone or ITCZ for short. The trade winds converge in the region of the ITCZ, producing convectional storms that produce some of the world's heaviest precipitation regions."}, {"url": "https://en.wikipedia.org/wiki/Trade_wind", "passage_text": "The trade winds blow predominantly from the northeast in the Northern Hemisphere and from the southeast in the Southern Hemisphere, strengthening during the winter and when the Arctic oscillation is in its warm phase. The surface air that flows from these subtropical high-pressure belts toward the Equator is deflected toward the west in both hemispheres by the Coriolis effect. These winds blow predominantly from the northeast in the Northern Hemisphere and from the southeast in the Southern Hemisphere."}, {"url": "http://www.kidsgeo.com/geography-for-kids/0094-trade-winds.php", "passage_text": "At the same time, in the Southern Hemisphere above the subtropical high, which is located just below the equator, we also find that winds are blowing from the east towards the west. The result is that between 30 ° North latitude and 30 ° South latitude winds usually blow from the east towards the west. Winds are named for the direction from which they come. Thus, this wind is referred to as an easterly wind. These easterly winds are known as the trade winds. "}, {"url": "https://en.wikipedia.org/wiki/Trade_wind", "passage_text": "Because winds are named for the direction from which the wind is blowing, these winds are called the northeasterly trade winds in the Northern Hemisphere and the southeasterly trade winds in the Southern Hemisphere. The trade winds of both hemispheres meet at the doldrums. The surface air that flows from these subtropical high-pressure belts toward the Equator is deflected toward the west in both hemispheres by the Coriolis effect. These winds blow predominantly from the northeast in the Northern Hemisphere and from the southeast"}, {"url": "http://www.thefreedictionary.com/trade+wind", "passage_text": "trade′ wind`. Often, trade winds. any of the nearly constant easterly winds that dominate most of the world's tropics and subtropics, blowing mainly from the northeast in the Northern Hemisphere, and from the southeast in the Southern Hemisphere. often trade winds Any of a consistent system of prevailing winds occupying most of the tropics, constituting the major component of the general circulation of the atmosphere, and blowing northeasterly in the Northern Hemisphere and southeasterly"}, {"url": "http://dictionary.infoplease.com/trade-wind", "passage_text": "Pronunciation: (wind), [key]. 1. Also, trade' winds. Also called trades. any of the nearly constant easterly winds that dominate most of the tropics and subtropics throughout the world, blowing mainly from the northeast in the Northern Hemisphere, and from the southeast in the Southern Hemisphere. "}, {"url": "http://www.thefreedictionary.com/trade+wind", "passage_text": "trade wind. n. often trade winds Any of a consistent system of prevailing winds occupying most of the tropics, constituting the major component of the general circulation of the atmosphere, and blowing northeasterly in the Northern Hemisphere and southeasterly in the Southern Hemisphere."}, {"url": "https://en.wikipedia.org/wiki/Trade_wind", "passage_text": "The trade winds are the prevailing pattern of easterly surface winds found in the tropics, within the lower portion of the Earth's atmosphere, in the lower section of the troposphere near the Earth's equator. The surface air that flows from these subtropical high-pressure belts toward the Equator is deflected toward the west in both hemispheres by the Coriolis effect. These winds blow predominantly from the northeast in the Northern Hemisphere and from the southeast in the Southern Hemisphere."}, {"url": "http://www.infoplease.com/encyclopedia/weather/trade-winds.html", "passage_text": "trade winds. trade winds, movement of air toward the equator, from the NE in the Northern Hemisphere and from the SE in the Southern Hemisphere. 1 trade wind: meaning and definitions-trade wind: Definition and Pronunciation. 2  Trade Winds-Trade Winds Winds that trade or tread in one uniform track. 3  In the northern hemisphere they blow ..."}]