[{"url": "http://www.eqgroup.com/Library/coggins.htm", "passage_text": "Most asymptomatic EIA infected horses will not show any recognizable signs but will test positive on a Coggins test. COGGINS TEST. To insure that an animal is not harboring the virus a simple test is performed, the Coggins test. The Coggins test checks for Equine Infectious Anemia (EIA) antibodies in the horse's blood. Blood samples must be sent to a state approved laboratory. This test is often needed to take your horse to a show and whenever you transport your horse across state lines"}, {"url": "http://ezinearticles.com/?What-Is-the-Coggins-Test?&id=509657", "passage_text": "13 1 3 1. The Coggins' test is for a serious equine virus called equine infectious anemia (EIA). There is no vaccine or cure for EIA, which is also known as swamp fever because of the warm, wet regions of the United States in which it is more common"}, {"url": "http://www.sportpolo.com/Barn/Coggins_Test.htm", "passage_text": "The Coggins Test is a blood test that checks for Equine Infectious Anemia (EIA) antibodies in a horse's blood. It is used to diagnose a contagious disease that affects horses worldwide. A Coggins Test for Equine Infectious Anemia is required for transporting a polo pony from one state to another. The Federal government requires a Coggins Test before a polo pony can be imported. A Coggins Test on a polo pony is required as proof that the horse is free of the Equine Infectious Anemia diseas"}, {"url": "https://answers.yahoo.com/question/index?qid=20081230080946AABA7sV", "passage_text": "The coggins test tests for EIA, or Equine Infectious Anemia. It is a viral disease that is HIGHLY contagious. Although often infected horses do not die, they will remain carriers, and must be isolated for the rest of their life. There is no cure. In a coggins test they draw some blood to test for EIA. It is required at basically every recognized show, in many states to transport, and most barns will require you present it. Around here it costs $20-$40, but I would assume that varies by region."}, {"url": "http://www.bloomracing.com/coggins-test-what-is-a-coggins-test/", "passage_text": "A Coggins test is a blood test for Equine infectious anemia or equine infectious anaemia (EIA). This disease is also known as swamp fever. This disease is transmitted by bloodsucking insects and is caused by a retrovirus. "}, {"url": "http://aequine.ca/coggins-testing", "passage_text": "A Coggins test is a blood test designed to screen for a disease called Equine Infectious Anemia (EIA). Also known as swamp fever, EIA is an infectious and potentially fatal viral disease affecting the immune system of members of the Equidae family, including horses, donkeys and mules. "}, {"url": "http://coursesonhorses.blogspot.com/2008/07/exactly-what-is-coggins.html", "passage_text": "Coggins is actually just the name of a test that is performed on horses. The name comes from the veterinarian who invented the test in the 1970's, Dr. Leroy Coggins. The test screens the blood of a horse to determine if the horse has the virus that causes Equine Infectious Anemia or EIA. EIA is also known as Swamp Fever because it is common in hot, muggy environments. There is no cure for EIA. It is contagious and can be fatal. This is why many states require mandatory Coggins tests before a horse can be brought across state lines and why so many horse professionals, breeders, etc. require a negative Coggins test before a horse is bought, sold, moved into a new barn, allowed to enter a horse show or other event, auction, etc."}, {"url": "https://answers.yahoo.com/question/index?qid=20081230080946AABA7sV", "passage_text": "Rating Newest Oldest. Best Answer: The Coggins Test is a blood titer which was developed to detect the Equine Infectious Anemia virus, or EIA. It was first used in the 1940's, and was invented by Alfred Coggins, a veternarian who worked at Cornell University in Ithica, New York. In a coggins test they draw some blood to test for EIA. It is required at basically every recognized show, in many states to transport, and most barns will require you present it. Around here it costs $20-$40, but I would assume that varies by region."}]