[{"url": "https://support.microsoft.com/en-us/kb/77791", "passage_text": "Microsoft Project 4.0, 4.1. 1  On the View menu, click a task view, such as Gantt Chart or Task Sheet. 2  Select the task you want to flag as a milestone. 3  On the Insert menu, click Task Information, and then click the Advanced tab. 4  Click the Mark task as milestone check box. 1 Select the task you want to flag as a milestone. 2  On the Task tab, click Information button on the Properties section of the ribbon. 3  Click the Advanced tab and place a check mark in the Mark task as milestone check box. 4  Click OK."}, {"url": "https://support.microsoft.com/en-us/kb/77791", "passage_text": "Microsoft Project 3.0. 1  On the view menu, click a task view, such as Gantt Chart or Task Sheet. 2  Select the task you want to flag as a milestone. 3  On the Edit menu, click Form. 4  Click to select the Milestone check box. 1 Select the task you want to flag as a milestone. 2  On the Task tab, click Information button on the Properties section of the ribbon. 3  Click the Advanced tab and place a check mark in the Mark task as milestone check box. 4  Click OK."}, {"url": "https://support.microsoft.com/en-us/kb/77791", "passage_text": "1 On the view tab, click a task view, such as Gantt Chart or Task Sheet. 2  Select the task you want to flag as a milestone. 3  On the Task tab, click Information button on the Properties section of the ribbon. 4  Click the Advanced tab and place a check mark in the Mark task as milestone check box. 5  Click OK. 1 Select the task you want to flag as a milestone. 2  On the Task tab, click Information button on the Properties section of the ribbon. 3  Click the Advanced tab and place a check mark in the Mark task as milestone check box. 4"}, {"url": "https://en.wikipedia.org/wiki/Microsoft_Project", "passage_text": "Microsoft Project is a project management software program, developed and sold by Microsoft, that is designed to assist a project manager in developing a plan, assigning resources to tasks, tracking progress, managing the budget, and analyzing workloads. Microsoft Project's proprietary file format is .mpp. Microsoft Project and Microsoft Project Server are the cornerstones of the Microsoft Office enterprise project management (EPM) product."}, {"url": "http://microsoft-project.en.softonic.com/", "passage_text": "Microsoft Project 2013 is project management software acclaimed by thousands of companies worldwide. It offers all the necessary tools to plan, manage, track, and analyze business projects. Version 2013 improves synchronization with SharePoint 2013 for more effective monitoring of projects. "}, {"url": "https://products.office.com/en-us/project/project-and-portfolio-management-software", "passage_text": "Microsoft Project 2016 is the latest version of Project. Previous versions include Project 2013. Project 2010, Project 2007, and Project 2003. Project 2016 is compatible with Windows 10, Windows 8.1, and Windows 7. "}, {"url": "https://www.projectplan365.com/", "passage_text": "Project Plan 365 - Create, modify, share Microsoft Project MPP files. The Housatonic Project Plan 365 is a simple to use project planning and collaboration solution that works with or in place of Microsoft Project. 1  Maintain Work Breakdown Structure(WBS) and project schedule. "}, {"url": "https://en.wikipedia.org/wiki/Microsoft_Project", "passage_text": "Microsoft Project was the company's third Microsoft Windows-based application, and within a couple of years of its introduction it became the dominant PC-based project management software. While part of the Microsoft Office family, it has never been included in any of the Office suites. Microsoft Project's proprietary file format is .mpp. Microsoft Project and Microsoft Project Server are the cornerstones of the Microsoft Office enterprise project management (EPM) product."}, {"url": "http://www.techrepublic.com/article/define-resources-with-microsoft-project/", "passage_text": "Define resources with Microsoft Project. Defining project resources is the most important part of a project plan. It's tricky, but Microsoft Project can help. Here's a look at the basic fields in Project that are involved in defining a resource and its costs."}]