[{"url": "http://jpma.org.pk/full_article_text.php?article_id=1835", "passage_text": "Abstract. Sirenomelia, the Mermaid Syndrome is a rare and lethal congenital anomaly with an incidence of one in 60,000 to 70,000 pregnancies. Sirenomelia is characterized by complete fusion of the lower limbs, commonly associated with renal agenesis, absent external genitalia and other gastrointestinal defects. Discussion. Sirenomelia is a rare and lethal congenital anomaly, caused by a disruptive vascular defect, characterized by fusion of the lower extremities, associated with bilateral renal agenesis, absence of the sacrum, rectum, and bladder.4."}, {"url": "http://www.brighthub.com/science/genetics/articles/57570.aspx", "passage_text": "Mermaid syndrome, alternatively known as sirenomelia is a rare disorder where an infant is born with fused legs, giving the appearance of a mermaid's tail. It is believed to occur in 1 in every 100,000 births. The term sirenomelia comes from siren or mermaid. Foetuses also have one umbilical artery instead of the usual two. More than half of the babies with sirenomelia are stillborn and of the rest the condition is usually fatal within a few days of birth because of complications associated with the kidneys, bladder, genitals, heart deformities, and in some cases the lungs."}, {"url": "http://www.ibuzzle.com/articles/sirenomelia-causes.html", "passage_text": "The disease is named so as babies suffering from this disease have their lower extremities (legs) fused together, which looks similar to the physical structure of a mermaid. Sirenomelia Disease. Most of the rare diseases or birth defects are fatal and cause deformity. Sirenomelia, or the Mermaid syndrome, is one of the rarest congenital diseases found in human beings. Here are the causes and symptoms of this disorder in detail"}, {"url": "http://ic.steadyhealth.com/mermaid-syndrome-causes", "passage_text": "The stomach and lungs can be affected too. This condition is very rare with an incidence of approximately 1 in 70,000 births. Mermaid syndrome, also known as sirenomelia, in most cases causes death in an infant usually few days after its birth. In fact, the disease is most often seen as stillbirth and there are only around 300 live births reported till this day."}, {"url": "http://ghr.nlm.nih.gov/chromosome/18", "passage_text": "Cells normally have two copies of each chromosome, one inherited from each parent. In people with tetrasomy 18p, cells have the usual two copies of chromosome 18 plus an isochromosome 18p. As a result, each cell has four copies of the short arm of chromosome 18. "}, {"url": "https://rarediseases.info.nih.gov/gard/7652/sirenomelia/resources/1", "passage_text": "Sirenomelia is a birth defect in which affected infants are born with a single lower extremity or with two legs that are fused together. "}, {"url": "https://en.wikipedia.org/wiki/Sirenomelia", "passage_text": "Maternal diabetes has been associated with caudal regression syndrome and sirenomelia, although a few sources question this association. VACTERL-H is an expanded form of the VACTERL association that concludes that this diagnosis is a less severe form of sirenomelia. More than half the cases of sirenomelia result in stillbirth and this condition is 100 times more likely to occur in identical twins than in single births or fraternal twins."}, {"url": "https://en.wikipedia.org/wiki/Sirenomelia", "passage_text": "Sirenomelia. Sirenomelia, alternatively known as Mermaid Syndrome, is a very rare congenital deformity in which the legs are fused together, giving them the appearance of a mermaid 's tail. More than half the cases of sirenomelia result in stillbirth and this condition is 100 times more likely to occur in identical twins than in single births or fraternal twins."}, {"url": "http://rarediseases.org/rare-diseases/caudal-regression-syndrome/", "passage_text": "Comparisons may be useful for a differential diagnosis. Sirenomelia, which is also known as mermaid syndrome, is a rare congenital disorder characterized by anomalies of the lower spine and the lower limbs. The disorder is characterized by partial or complete fusion of the legs. Caudal regression syndrome is a broad term for a rare complex disorder characterized by abnormal development of the lower (caudal) end of the spine. The spine consists of many small bones (vertebrae) that collectively form the spinal column."}]