[{"url": "http://www.answers.com/Q/How_can_you_tell_who_has_looked_at_your_Facebook_profile", "passage_text": "Technically, you can track which IP addresses have viewed your page. But to track specific people is against the site's rules. Though there is software that can be used, using it is against the site's rules. So currently, there is no way to track who views your Facebook profile without breaking Facebook's rules. "}, {"url": "http://www.facebook.com/help/210896588933875/", "passage_text": "No. Facebook doesn't let you track who views your profile or your posts (ex: your photos). Third-party apps are also unable to do this. If you come across an app that says it can show you who's viewing your profile or posts, please report the app. More info. Get help for mobile apps and browsers. "}, {"url": "https://uk.news.yahoo.com/who%E2%80%99s-been-looking-at-your-facebook-page--can-you-find-out-.html", "passage_text": "There are no apps that can unearth that info. Facebook says it is one of the most common scam come-ons on the site. Don't fall for it; you cannot see who's looking at your profile (and no one can see if you've been looking at theirs). But… there are apps and tools to see who's unfriended you"}, {"url": "http://socialnetworking.lovetoknow.com/How_Can_I_See_Who_Looked_at_My_Facebook_Profile", "passage_text": "1 Parents watching their kids: If your children are on Facebook, it would be handy to know who is looking at their profiles. 2  Searching for more friends: Seeing who has been visiting your profile page can alert you to other people you know who are using the service, and whom you may want to send a friend request to. "}, {"url": "http://www.wikihow.com/See-Who-You-are-Most-Connected-to-on-Facebook", "passage_text": "Open your profile. While you can't determine who exactly is looking at your profile on a regular basis, you can determine who you interact with the most and who Facebook thinks your closest friends are. 1 There is no way to see JUST who looks at your page the most, and any app which says that it can tell you that is lying and a scam. 2  You'll have to learn how to interpret the list that this trick gives you."}, {"url": "http://www.ricksdailytips.com/find-out-who-has-been-looking-at-facebook-page/", "passage_text": "Rick’s answer: Unfortunately, the short answer is no Kelsey. To the best of my knowledge there’s no way to find out who’s been looking at your Facebook profile, Timeline and photos. There are tons of apps out there that claim to give you that information if you install them, but as far as I can tell they are all scams. I recommend that you steer clear of them. Q&A: How can I see who has been looking at my Facebook page? Question from Kelsey J.: I’ve been looking around my Facebook trying to find a way to see who all has been scoping out my profile."}, {"url": "http://techforluddites.com/beware-of-who-viewed-my-profile-apps-on-facebook/", "passage_text": "However…. Some third-party applications offer this “feature.”. There are applications you can install on Facebook that claim to provide this option, i.e. that you can see who has been looking at your profile. "}, {"url": "http://digiwonk.wonderhowto.com/how-to/track-who-views-your-facebook-profile-0147349/", "passage_text": "So, while there is no current way to see who has actually viewed your Facebook profile, you can see who has recently been in some sort of contact with you through the InitialChatFriendsList, and see who has viewed your comments or posts in a Group or Message. Of course, this isn't the same as seeing everyone that viewed your profile, but you can at least see everyone that viewed your message or group post. Since I hate this feature, I'm glad this hasn't leaked out to any other Facebook applications."}, {"url": "https://www.grahamcluley.com/2013/05/who-view-my-facebook-profile/", "passage_text": "And, of course, you might be keen to find out if that creepy guy in the lunch queue at work is cyber-stalking you. Bad news, I'm afraid. There is *no* way that you can find out who has been looking at your Facebook profile. The only people who might have the data is Facebook itself, and it doesn't seem interested in providing the functionality. So anything which claims to offer you a way to find out who has been peeking at your profile, is almost certainly a scam. Proceed with caution and be careful not to be duped into clicking on any links, or completing any surveys to get some magic Facebook power."}, {"url": "https://uk.news.yahoo.com/who%E2%80%99s-been-looking-at-your-facebook-page--can-you-find-out-.html", "passage_text": "Facebook. First the warning: there are s cams aplenty promising to show you who is stalking your Facebook page. I put in a call to Facebook and spoke with their technical folks-the truth is no-one can see who's been on your Facebook page. There are no features buried in the Facebook settings with that data. Facebook says it is one of the most common scam come-ons on the site. Don't fall for it; you cannot see who's looking at your profile (and no one can see if you've been looking at theirs)."}]