[{"url": "https://en.wikipedia.org/wiki/Cellular_respiration", "passage_text": "Cellular respiration is the set of metabolic reactions and processes that take place in the cells of organisms to convert biochemical energy from nutrients into adenosine triphosphate (ATP), and then release waste products. "}, {"url": "http://www.angelfire.com/ak2/chemists/leah8.html", "passage_text": "Nicotinamide Adenine Dinucleotide (NAD) is a dinucleotide that functions as one of the most important coenzymes in the cell. The interconversion of NAD between the reduced (NADH) and oxidized (NAD+) forms is a common reaction in biological redox (oxidation-reduction) reactions. In cells, most oxidations are accomplished by the removal of hydrogen atoms. Each molecule of NAD + can acquire two electrons; that is, be reduced by two electrons. The oxidizing agent is NAD+, which is reduced to NADH. The process is exergonic and the mechanism that has evolved allows the energy of reaction to be captured as two moles of ATP per glucose molecule: 2 NAD +. 2."}, {"url": "http://www.chegg.com/homework-help/questions-and-answers/1-alcoholic-fermentation-nad-converted-nadh-conversion-glucose-pyruvate-glycolysis-convers-q6722657", "passage_text": "1. During alcoholic fermentation, when is NAD + converted to NADH -- during the conversion of glucose to pyruvate (glycolysis) or during the conversion of pyruvate to alcohol? "}, {"url": "https://en.wikipedia.org/wiki/NADH", "passage_text": "In metabolism, nicotinamide adenine dinucleotide is involved in redox reactions, carrying electrons from one reaction to another. The coenzyme is, therefore, found in two forms in cells: NAD + is an oxidizing agent – it accepts electrons from other molecules and becomes reduced. This reaction forms NADH, which can then be used as a reducing agent to donate electrons. These electron transfer reactions are the main function of NAD. The balance between the oxidized and reduced forms of nicotinamide adenine dinucleotide is called the NAD + /NADH ratio. This ratio is an important component of what is called the redox state of a cell, a measurement that reflects both the metabolic activities and the health of cells."}, {"url": "https://answers.yahoo.com/question/index?qid=20100806082502AAUUU5h", "passage_text": "I always thought that NAD+ was reduced to form NADH. Why then from the equation does it look like NAD+ is oxidised (loses an H). This is according the definition: Reduction is gain of electrons or gain of H Oxidation is loss of electrons or loss of H. Follow. I always thought that NAD+ was reduced to form NADH. Why then from the equation does it look like NAD+ is oxidised (loses an H). This is according the definition: Reduction is gain of electrons or gain of H. Oxidation is loss of electrons or loss of H. Add your answer. Source."}, {"url": "https://en.wikipedia.org/wiki/NADH", "passage_text": "Nicotinamide adenine dinucleotide (NAD) is a coenzyme found in all living cells. The compound is a dinucleotide, because it consists of two nucleotides joined through their phosphate groups. One nucleotide contains an adenine base and the other nicotinamide. Nicotinamide adenine dinucleotide exists in two forms, an oxidized and reduced form abbreviated as NAD+ and NADH respectively. The balance between the oxidized and reduced forms of nicotinamide adenine dinucleotide is called the NAD + /NADH ratio. This ratio is an important component of what is called the redox state of a cell, a measurement that reflects both the metabolic activities and the health of cells."}, {"url": "http://www.wholehealthmd.com/ME2/dirmod.asp?type=AWHN_Supplements&id=F8DDC620C82D41D1A6FBEDDD38337F63&tier=2", "passage_text": "NADH, is the reduced form of the coenzyme nicotinamide adenine dinucleotide (NAD+, or NAD “plus”), hence the addition of “H” tat the end. The formed NADH donates its hydrogen in the cellular respiratory chain, reverting to NAD. As a coenzyme, NAD and its reduced form NADH serve an important role in cellular energy production and in the production of dopamine, a (messenger) necessary for motor skills and brain focus."}, {"url": "http://www.differencebetween.com/difference-between-nad-nadh-and-nadph/", "passage_text": "NADH is the reduced form of NAD+. Similar to NAD+, NADH also participates in metabolic processes when reduction is necessary. When NADH reduces a compound, it gets oxidized to NAD+. The alternating oxidation and reduction of these two compounds is observable in many metabolic pathways such as citric acid cycle. NADPH is a coenzyme which is used in anabolic reactions. It is used in lipid and nucleic acid synthesis as a reducing agent. This differs from NADH due to the additional phosphate group at 2 nd position of the ribose ring in the adenine moiety."}, {"url": "https://answers.yahoo.com/question/index?qid=20061117201446AAGguLr", "passage_text": "Best Answer: NADH is produced in organisms in glycolysis and the Krebs cycle (TCA) cycle. Formation of NAD+ to NADH is reduction. NADH is produced to create reduction power for the cell. Some of the reduction power is used in cellular synthesis reactions, but most of the reducing power is brought to the electron transport chain where it is manipulated to create alot of energy in the form of ATP. "}, {"url": "http://www.chem.uwec.edu/Webpapers2001/clareymm/Pages/Intro/nadintro.html", "passage_text": "NADH, short for nicotinamide adenine dinucleotide, is an important pyridine nucleotide that functions as an oxidative cofactor in eukaryotic cells. NADH plays a key role in the production of energy through redox reactions. NAD coenzyme plays a crucial role in this. Each molecule of NAD+ can acquire two electrons; that is, be reduced by two electrons. However, only one proton accompanies the reduction. The other proton produced as two hydrogen atoms are removed from the molecule being oxidized is liberated into the surrounding medium."}]