[{"url": "http://www1.salary.com/Financial-Advisor-Salary.html", "passage_text": "Typically reports to a manager. View Financial Analyst IV Salaries Alternate Job Titles: Financial Analyst IV, Financial Planning Analyst IV Categories: Financial Services, Accounting, Consulting Services Financial Analyst II Salaries Compiles and analyzes financial information for an organization. Requires a bachelor's degree in accounting or finance and may be expected to have an advanced degree in a related area with at least 7 years of related experience. Familiar with a variety of the field's concepts, practices, and procedures. Relies on extensive experience and judgment to plan and accomplish goals."}, {"url": "http://www.payscale.com/research/US/Job=Financial_Advisor/Salary", "passage_text": "(United States). The average salary for a Financial Advisor is $54,957 per year. The skills that increase pay for this job the most are Portfolio Management, Investment Management, financial planning, Investment Planning, and Financial Advisor. People in this job generally don't have more than 20 years' experience. Experience strongly influences income for this job."}, {"url": "http://www.answers.com/Q/How_much_money_does_a_financial_consultant_or_advisor_earn", "passage_text": "The lowest 10 percent earned less than $32,340 and the highest 10 percent earned more than $145,600. Personal financial advisors who work for financial services firms are generally paid a salary plus bonus. It's possible for a bonus to double what you make in a year.   But as for salary, according to the United States Bureau of Labor Statistics ...   Median annual earnings of financial analysts were $57,100 in 2002. The middle 50 percent earned between $43,660 and $76,620."}, {"url": "http://www.answers.com/Q/How_much_money_does_a_financial_consultant_or_advisor_earn", "passage_text": "Median annual earnings, including bonuses, of wage and salary financial analysts were $66,590 in May 2006. The middle 50 percent earned between $50,700 and $90,690. The … lowest 10 percent earned less than $40,340, and the highest 10 percent earned more than $130,130. The bonuses that many financial analysts receive in addition to their salary can be a significant part of their total earnings. It's possible for a bonus to double what you make in a year.   But as for salary, according to the United States Bureau of Labor Statistics ...   Median annual earnings of financial analysts were $57,100 in 2002. The middle 50 percent earned between $43,660 and $76,620."}, {"url": "http://careers.edwardjones.com/explore-opportunities/new-financial-advisors/compensation/compensation.html", "passage_text": "1 Your starting salary will be based on your experience and income prior to joining the firm. 2  Your salary amount will adjust as you move toward compensation that is based more on commissions and bonuses. 3  Salaries are adjusted based on performance standards for the first two years. "}, {"url": "http://money.usnews.com/careers/best-jobs/financial-analyst", "passage_text": "Salary. The paycheck is good. Financial analysts earned a median of $78,380 in 2013, with the lowest-paid making $48,100 and the highest-paid making $152,420. The best-paid in the profession work in the metropolitan areas of Bridgeport, Connecticut; New York City; and San Francisco. Many work for financial companies, including those in the financial services and insurance industries. For their influence and sizeable paychecks, financial analysts pay the price by working long hours: One in three put in between 50 and 70 hours a week."}, {"url": "http://www.cnbc.com/id/43654832", "passage_text": "That’s based on brokers getting an average payout of 30 percent to 40 percent on all commissions. To get to such a commission level selling mutual funds with a 5.75 percent sales charge or load would require total monthly sales of more than $230,000. For stock trading, the total would need to be even higher. The broker ranks are projected to increase by 30 percent through 2018, a much faster than average rate according, to the Bureau of Labor Statistics. Financial advisors earn median annual compensation of about $90,000, also well above average for college graduates, says Payscale.com."}, {"url": "http://www.payscale.com/research/US/Job=Financial_Advisor/Salary/4d96764a/Entry-Level", "passage_text": "For Entry-Level Financial Advisors, San Francisco provides a pay rate that is 38 percent greater than the national average. Entry-Level Financial Advisors will also find cushy salaries in Boston (+33 percent), Dallas (+25 percent), Chicago (+24 percent), and Los Angeles (+24 percent). Those in the field find the lowest salaries in Atlanta, 15 percent below the national average. That final number averages out to $51K across the industry. In the world of Entry-Level Financial Advisors, overall cash allowance can occasionally include more than $20K from bonuses and, in some exceptional cases, $15K from profit sharing, causing incomes to vary widely between $30K and $89K."}]