[{"url": "http://www.exploring-castles.com/characteristics_of_gothic_architecture.html", "passage_text": "One of the fundamental characteristics of gothic architecture was its height. New building techniques (such as the flying buttress, detailed below) enabled architects to spread the weight of taller walls and loftier towers. This all meant that gothic buildings could, quite literally, scale new heights."}, {"url": "http://www.visual-arts-cork.com/history-of-art/gothic-architecture.htm", "passage_text": "Architecture was the main art form of the Gothic, and the main structural characteristics of Gothic architectural design stemmed from the efforts of medieval masons to solve the problems associated with supporting heavy masonry ceiling vaults (arched roofs) over wide spans."}, {"url": "http://www.exploring-castles.com/characteristics_of_gothic_architecture.html", "passage_text": "The Seven Key Characteristics of Gothic Architecture. Fundamentally, gothic architecture transformed castles, churches, cathedrals and pretty much the whole of Europe! This style of architecture developed because of common architectural problems in Medieval times."}, {"url": "http://www.infoplease.com/encyclopedia/entertainment/gothic-architecture-art-characteristics-gothic-architecture.html", "passage_text": "1 Gothic architecture and art: Characteristics of Gothic Architecture-Characteristics of Gothic Architecture It is generally agreed that Gothic architecture made its ..."}, {"url": "http://www.exploring-castles.com/characteristics_of_gothic_architecture_2.html", "passage_text": "One of the most notable characteristics of gothic architecture is the gargoyle. Gargoyles are decorative, monstrous little creatures, perched at along the roofs and battlements of gothic buildings and castles."}, {"url": "http://www.visual-arts-cork.com/history-of-art/gothic.htm", "passage_text": "Gothic Column statues at Chartres Cathedral (1194-1250). Summary-Characteristics. The term Gothic style refers to the style of European architecture, sculpture (and minor arts) which linked medieval Romanesque art with the Early Renaissance."}, {"url": "http://www.exploring-castles.com/characteristics_of_gothic_architecture.html", "passage_text": "Many castles adopted some of the characteristics of gothic architecture, too. They became transformed from dank living environments into majestic, light and pleasant residences for the lords and ladies within. Don't forget, though, that the term 'gothic architecture' is a retrospective term."}, {"url": "http://www.wisegeek.com/what-are-the-characteristics-of-gothic-cathedrals.htm", "passage_text": "The most common characteristics of Gothic cathedrals include the use of flying buttresses, pointed arches, large, elaborate windows, and stone construction with wooden accents. Flying buttresses are perhaps the most recognizable characteristic of Gothic cathedrals."}, {"url": "http://www.infoplease.com/encyclopedia/entertainment/gothic-architecture-art-characteristics-gothic-architecture.html", "passage_text": "Characteristics of Gothic Architecture. It is generally agreed that Gothic architecture made its initial appearance (c.1140) in the Île-île-De, france the royal domain of The capetian. kings"}]