[{"url": "http://www.answers.com/Q/What_is_the_process_when_DNA_reproduce_itself", "passage_text": "This process is known as DNA replication. DNA is a double-stranded molecule, and this serves to the cell's advantage. Using an enzyme, the cell splits the DNA strands apart, a … nd new strands are copied onto the two parent strands to form two identical new strands. The process is much more complicated than that, but that's what happens"}, {"url": "https://en.wikipedia.org/wiki/DNA_replication", "passage_text": "DNA is made up of two strands and each strand of the original DNA molecule serves as a template for the production of the complementary strand, a process referred to as semiconservative replication. Cellular proofreading and error-checking mechanisms ensure near perfect fidelity for DNA replication. DNA usually exists as a double-stranded structure, with both strands coiled together to form the characteristic double-helix. Each single strand of DNA is a chain of four types of nucleotides. Nucleotides in DNA contain a deoxyribose sugar, a phosphate, and a nucleobase."}, {"url": "http://genetics.thetech.org/ask/ask24", "passage_text": "Cells need to copy their DNA when they divide. This process is called DNA replication. To understand how DNA is copied, we first need to understand the structure of DNA. DNA is made of two long strands that wrap around each other to make the famous double helix. The first step in DNA replication is to separate or unzip the two strands of the double helix. The enzyme in charge of this is called a helicase (because it unwinds the helix). The point where the double helix is opened up and the DNA is copied is called a replication fork."}, {"url": "http://www.yourgenome.org/facts/what-is-dna-replication", "passage_text": "DNA replication is the process by which DNA makes a copy of itself during cell division. 1  The first step in DNA replication is to ‘unzip’ the double helix structure of the DNA molecule. "}, {"url": "http://hyperphysics.phy-astr.gsu.edu/HBase/biology/celrep.html", "passage_text": "Prokaryotic Cell Reproduction. Prokaryotic cells reproduce by a process that is called binary fission. The DNA in such cells is contained in a single circular chromosome called a plasmid within the cytoplasm. The reproductive process starts with the replication of the chromosome. "}, {"url": "http://www.nature.com/scitable/topicpage/Cells-Can-Replicate-Their-DNA-Precisely-6524830", "passage_text": "Replication is the process by which a double-stranded DNA molecule is copied to produce two identical DNA molecules. DNA replication is one of the most basic processes that occurs within a cell. Each time a cell divides, the two resulting daughter cells must contain exactly the same genetic information, or DNA, as the parent cell. To accomplish this, each strand of existing DNA acts as a template for replication."}, {"url": "http://science.howstuffworks.com/life/cellular-microscopic/dna3.htm", "passage_text": "DNA replication occurs in the cytoplasm of prokaryotes and in the nucleus of eukaryotes. Regardless of where DNA replication occurs, the basic process is the same. The structure of DNA lends itself easily to DNA replication. Each side of the double helix runs in opposite (anti-parallel) directions. The beauty of this structure is that it can unzip down the middle and each side can serve as a pattern or template for the other side (called semi-conservative replication)"}, {"url": "http://www.earthage.org/intro/How%20Proteins%20are%20made.htm", "passage_text": "The process whereby a cell divides and reproduces itself is even more complex. The information in a single Human DNA cell can be stored on a CD Rom -- if it is Compressed. One Human DNA cell carries enough information to make about 30,000 different types of proteins. "}, {"url": "https://quizlet.com/27356631/bio-1005-chapter-8-flash-cards/", "passage_text": "Semiconserverative replication means that only one strand of a DNA molecule is newly formed. The other strand is original DNA from the parent cell. So each DNA double helix conserves half of the original molecule making it conservative in nature. "}, {"url": "http://www.answers.com/Q/How_does_DNA_reproduce_itself", "passage_text": "Making the world better, one answer at a time. DNA reproduces through a set process that begins when it unzips and uncoils. Next, two polynucleotide chains are produced and adenine lines up with thymine. Cytosine lines up with guanine, and then hydrogen bonds form between the pairs. Enzymes join the nucleotides together, and two new DNA molecules are formed. DNA makes copies of itself through the process of replication.  Because the nucleotide bases are complementary, they automatically  make the other strand of complementary ba … ses when the division of  the cell occurs."}]