[{"url": "http://abcnews.go.com/Health/ColdandFluQuestions/story?id=5679458", "passage_text": "Now, bacteria are germs that we live with normally, but then the influenza virus does damage to the lining of the nose and the lungs so that the bacteria which are around may cause a secondary infection, secondary to the damage caused by the influenza virus. Answer: Influenza, also called the flu, which is a respiratory infection characterized by fever and cough in an adult, is maybe a severe infection in and of itself and characteristically lasts five to seven days and then you gradually begin to feel better. It is not uncommon for there to be a bacterial super-infection."}, {"url": "http://www.doctoroz.com/article/defining-super-infections", "passage_text": "By Dr. Leigh Vinocur, Emergency Physician and a Dr. Oz Expert. Posted on 10/07/2010 | By Leigh Vinocur, MD, FACEP | Comments (). Print. Super infections are secondary bacteria-caused infections that usually develop while your body is fighting off a virus such as a cold or the flu. Generally, the bacteria that commonly cause super infections are in or are on our body already. However, it is while we are fighting off a virus that they then have the opportunity to invade our lungs or sinuses and cause a super infection. Research has found that the cold or flu actually increases your susceptibility to bacterial infections, such as Streptococcus pneumonia, Haemophilus influenza, and Group A streptococcus, and Staphylococcus. In animals studies it was found that disruption of the lining of the respiratory tract was a major factor."}, {"url": "http://www.cdc.gov/h1n1flu/vaccination/provider/provider_pneumococcal.htm", "passage_text": "Influenza predisposes individuals to developing bacterial community-acquired pneumonia. During each of the influenza pandemics of the 20th century, secondary bacterial pneumonia was a frequent cause of illness and death and Streptococcus pneumoniae (pneumococcus) was reported as the most common etiology. S. pneumoniae remains a leading cause of vaccine-preventable illness and death in the United States. Recently, pneumococcal infections have been identified as an important complication in severe and fatal cases of 2009 H1N1 influenza virus infection."}, {"url": "http://health365.com.au/articles/common-ailments/flu-influenza", "passage_text": "Influenza should not be treated with antibiotics, as it is caused by a virus, not a bacterium. Antibiotics should only be prescribed when secondary bacterial infection is suspected. Remember to complete all courses of antibiotics and antivirals, to prevent the development of resistant infections. It is easily confused with the common cold, which is caused by a different virus. Influenza viruses can infect the nose, throat, sinuses, upper airways and lungs. Flu spreads easily from person to person, through droplet distribution when an infected person coughs or sneezes or, quite commonly, by hand-to-hand contact."}, {"url": "http://health365.com.au/articles/common-ailments/flu-influenza", "passage_text": "1 In most cases, the ear infection is caused by the virus itself and is not a secondary bacterial infection, so antibiotics are seldom necessary. 2  Children may also develop croup (a viral infection of the vocal cords and large main airways) as a result of flu and other respiratory-tract virus infections. It is easily confused with the common cold, which is caused by a different virus. Influenza viruses can infect the nose, throat, sinuses, upper airways and lungs. Flu spreads easily from person to person, through droplet distribution when an infected person coughs or sneezes or, quite commonly, by hand-to-hand contact."}, {"url": "http://www.urmc.rochester.edu/encyclopedia/content.aspx?ContentTypeID=1&ContentID=2089", "passage_text": "Viruses cause such respiratory infections as the common cold (rhinovirus), the flu (influenza), some pneumonias and bronchiolitis (respiratory syncytial virus, or RSV). It can be difficult to determine whether you have a viral or bacterial infection because the symptoms are often similar. "}, {"url": "http://www.healthgrades.com/conditions/viral-diseases", "passage_text": "Viral diseases are extremely widespread infections caused by viruses, a type of microorganism. There are many types of viruses that cause a wide variety of viral diseases. The most common type of viral disease is the common cold, which is caused by a viral infection of the upper respiratory tract (nose and throat). Other common viral diseases include: Chickenpox. Flu (influenza). Herpes. Human immunodeficiency virus (HIV/AIDS). Human papillomavirus (HPV). Infectious mononucleosis. "}, {"url": "https://en.wikipedia.org/wiki/Influenza", "passage_text": "Influenza, commonly known as the flu , is an infectious disease caused by the influenza virus. Symptoms can be mild to severe. The most common symptoms include: a high fever, runny nose, sore throat, muscle pains, headache, coughing, and feeling tired. Symptoms of influenza can start quite suddenly one to two days after infection. Usually the first symptoms are chills or a chilly sensation, but fever is also common early in the infection, with body temperatures ranging from 38 to 39 °C (approximately 100 to 103 °F)."}, {"url": "http://health365.com.au/articles/common-ailments/flu-influenza", "passage_text": "Flu, or influenza, is a viral illness that occurs predominantly in the winter months. It is easily confused with the common cold, which is caused by a different virus. Influenza viruses can infect the nose, throat, sinuses, upper airways and lungs. Flu spreads easily from person to person, through droplet distribution when an infected person coughs or sneezes or, quite commonly, by hand-to-hand contact."}]