[{"url": "http://www.wikihow.com/Grow-a-Magnolia-Tree", "passage_text": "If you want to grow a tall tree magnolia, ensure that there is plenty of space for it to grow. Magnolia will grow in both sun or part-shade. 1  If you want a smaller version, plant the variety known as Little Gem that grows 5 to 8 meters (16.4 to 26.2 ft) in height and 4 meters (13.1 ft) in width."}, {"url": "http://www.gardenguides.com/102652-magnolia-trees.html", "passage_text": "The Southern magnolia (Magnolia grandiflora) stands alone as a landscape tree because of its commanding appearance and size. The species can reach 60 to 100 feet in perfect conditions. The dark, glossy 6- to 8-inch leaves are evergreen, which sets it apart from other magnolias."}, {"url": "http://www.magnoliasociety.org/MagnoliaResources", "passage_text": "This magnolia is one of the best known species because it is very cold hardy (USDA Zones 4-8), widely adaptable and blooms when very small. Star Magnolia is a slow growing, broad spreading, small tree or large shrub, ultimately reaching 15 feet tall or more. Leaves may be 4-8 inches long and up to 3 inches wide."}, {"url": "http://www.gardenguides.com/75261-grow-magnolia-tree.html", "passage_text": "Overview. Magnolia trees can be a beautiful part of your landscape if you live in zones 7a to 10a. Plant the tree in an area of your property with full to partial sun and plenty of room for the magnolia to grow."}, {"url": "http://www.burncoose.co.uk/site/page.cfm?page_ref=how_to_care_for_Magnolias", "passage_text": "If you grow tree magnolias from seed they may well take 10-15 years until they first flower. In one instance at Caerhays a magnolia took over 40 years to flower. However, most magnolias sold today are GRAFTED plants."}, {"url": "http://www.gardeningknowhow.com/ornamental/trees/magnolia/magnolia-tree-care.htm", "passage_text": "As part of your magnolia tree care, you’ll need to water the trees to keep the soil around the base of the tree moist. It is especially important to keep young trees well-watered until they become established. Fertilize in spring when the flower buds begin to swell with a slow-release fertilizer."}, {"url": "http://www.gardeningchannel.com/how-to-grow-magnolia-trees/", "passage_text": "Place the stake in the planting hole before you add the tree. Make sure the top of the root ball is sitting at soil level, not lower. Fill the hole halfway and add some water. Allow it to drain and fill it with the remaining soil, tamping down very gently. Magnolias have soft, delicate roots that are easily damaged."}, {"url": "http://www.wikihow.com/Grow-a-Magnolia-Tree", "passage_text": "How to Grow a Magnolia Tree. Magnolia trees are magnificent when in full bloom. If you have the space for one in your garden, you'll get both beauty and shade. Tolerant of city environments, and of pollution, these are an ideal choice for the right garden."}, {"url": "http://www.gardeningchannel.com/how-to-grow-magnolia-trees/", "passage_text": "Evergreen magnolias (Magnolia grandiflora) are truly spectacular in the right climate and location. Hardy in USDA zones 8 through 10 only, these trees have large, glossy leaves and creamy flowers. They bloom almost year round. The trees can grow up to 50 feet tall with wide-reaching limbs and roots."}]