[{"url": "http://www.ehow.com/how_7564613_plant-bismarck-palm-seeds.html", "passage_text": "Found This Helpful. The Bismarck palm is a palm native to Madagascar, where it will reach heights between 45 and 70 feet. Its spiny leaves can reach lengths of 10 feet or more, making it an extremely large plant to add to your landscaping. "}, {"url": "http://homeguides.sfgate.com/plant-silver-bismarck-palm-tree-49585.html", "passage_text": "1. Choose a planting location where the Bismarck palm will receive a minimum of four hours of direct sun during the day. Do not plant the tree where it will eventually grow into telephone or electric wires. 3. Place the tree next to the newly dug planting hole. Push the Bismarck palm tree over on its side. Pull the container off the root mass or remove the burlap or plastic root ball wrapping."}, {"url": "http://homeguides.sfgate.com/plant-silver-bismarck-palm-tree-49585.html", "passage_text": "Dig the hole two times as wide as the Bismarck palm root mass and just deep enough for the tree to be set at the same depth it has been growing. Use the tip of the dirt shovel or a hand rake to scratch the sides and bottom of the hole if the soil is predominately clay. Do not add soil amendments to the back-fill soil. 3. Place the tree next to the newly dug planting hole. Push the Bismarck palm tree over on its side. Pull the container off the root mass or remove the burlap or plastic root ball wrapping."}, {"url": "http://houseplants.about.com/od/propagatingyourplants/a/How-To-Sprout-Palm-Trees-From-Seed.htm", "passage_text": "Some palms, like Bismarck, are very slow growers, while others, like the Christmas palm, will grow rapidly after they sprout. Palm seedlings do not require fertilizer at first, but once they start actively growing, it's a good idea to start them on a weak liquid fertilizer. "}, {"url": "http://lee.ifas.ufl.edu/Hort/GardenPubsAZ/Bismarck_palm.pdf", "passage_text": "The olive-green-leaved form is not often encountered in Florida. The silvery-leaved form is universally planted in parts of the state where it successfully grows. Bismarck palms typically grow from 1 to 2 feet per year. It will need plenty of room to do so as even the crowns of young palms can spread to 18 feet wide. There is no crown shaft. The leaf is typically 10 feet long and 5 feet wide"}, {"url": "http://www.gardenguides.com/79830-plant-silver-bismark-palm-tree.html", "passage_text": "Overview. The Bismarck palm tree (Bismarckia nobilis) is a stately fan palm desired by gardeners due to its mighty appearance as a specimen tree. The blue-green fronds make this palm stand out among its cousin palms. Bismarck palms are quite hardy trees once established, and can obtain a height of over 40 feet. The requirements for planting a Bismarck palm are similar to those of other palms. "}, {"url": "http://homeguides.sfgate.com/plant-silver-bismarck-palm-tree-49585.html", "passage_text": "8. Give the Bismarck palm tree either 50 gallons of water or 20 to 25 gallons of water, depending on whether or not it has leaves, three times per week for four weeks. 3. Place the tree next to the newly dug planting hole. Push the Bismarck palm tree over on its side. Pull the container off the root mass or remove the burlap or plastic root ball wrapping."}]