[{"url": "http://www.thinkbabynames.com/meaning/1/Jeronimo", "passage_text": "Jeronimo /jer-on-i-mo/ [4 sylls.] as a name for boys is of Italian and Greek origin, and the meaning of the name Jeronimo is sacred name. Jeronimo is an alternate spelling of Geronimo (Italian, Greek): form of Jerome. Kreatif forms: Jarnimo, Jaronimo, Jarronimo. [ more ]. Jeronimo has 1 variant: Jeronimus. Jeronimo has 20 more alternative forms via Geronimo, Jerome: Gerome, Gerrie, Gerry ▼ , Herinomos, Heronimo, Hierome, Hieronim, Hieronimo, Hieronimos, Hieronimus, Hieronymos, Hieronymus, Jairo ▼ , Jairome, Jeroen, Jeromo, Jerrome, Jerron, Jerrone and Jerry ▼ ."}, {"url": "http://www.ourbabynamer.com/meaning-of-Jeronimo.html", "passage_text": "Jeronimo is generally used as a boy's name. It consists of 8 letters and 4 syllables and is pronounced Je-ro-ni-mo. In the U.S. in 2014, it ranked 2035 in baby name popularity for boys with 69 occurrences. Less than 5 girls were given the name. View the Jeronimo Name Popularity Page to see how the popularity trend for Jeronimo has changed since 1880, or to compare the popularity of Jeronimo to other names."}, {"url": "https://en.wikipedia.org/wiki/Jer%C3%B3nimo_%28name%29", "passage_text": "This page or section lists people with the surname Jeronimo. Jerónimo if an internal link intending to refer to a specific person led you to this, page you may wish to change that link by adding the'person s given (name) s to the. link If an internal link intending to refer to a specific person led you to this page, you may wish to change that link by adding the person's given name (s) to the link. This page or section lists people that share the same given name."}, {"url": "http://www.ourbabynamer.com/meaning-of-Jeronimo.html", "passage_text": "What does Jeronimo mean, popularity, numerology and more. The name Jeronimo is of Spanish origin. The meaning of Jeronimo is sacred name, holy name. In the U.S. in 2014, it ranked 2035 in baby name popularity for boys with 69 occurrences. Less than 5 girls were given the name. View the Jeronimo Name Popularity Page to see how the popularity trend for Jeronimo has changed since 1880, or to compare the popularity of Jeronimo to other names."}, {"url": "http://www.ourbabynamer.com/meaning-of-Jeronimo.html", "passage_text": "Jeronimo in Nautical Flags. Spanish names consist of one or more given names followed by TWO family names. Generally the first surname is the father's first surname and the second is the mother's first surname but this traditional order no longer required. In the U.S. in 2014, it ranked 2035 in baby name popularity for boys with 69 occurrences. Less than 5 girls were given the name. View the Jeronimo Name Popularity Page to see how the popularity trend for Jeronimo has changed since 1880, or to compare the popularity of Jeronimo to other names."}, {"url": "http://www.ohbabynames.com/meaning/name/geronimo/7590", "passage_text": "Etymology & Historical Origin-Geronimo. Geronimo is a very rare Italian form of Jerome, a name ultimately derived from the Greek Hieronymos (‘ιερωνυμος) from the elements “hieros” meaning “holy, sacred” and “onoma” meaning “name”. In other words, Geronimo is a “holy name”. "}, {"url": "http://www.meaning-of-names.com/spanish-names/jeronimo.asp", "passage_text": "Meaning of Jeronimo. Spanish name. In Spanish, the name Jeronimo means-saved.The name Jeronimo originated as an Spanish name. The name Jeronimo is most often used as a boy name or male name. Spanish Name Meaning-saved."}, {"url": "http://www.sheknows.com/baby-names/name/jeronimo", "passage_text": "Spanish Meaning: The name Jeronimo is a Spanish baby name. In Spanish the meaning of the name Jeronimo is: saved'. SoulUrge Number: 8. Expression Number: 9. People with this name have a deep inner desire to lead, organize, supervise, and to achieve status, power and wealth. People with this name tend to be passionate, compassionate, intuitive, romantic, and to have magnetic personalities."}, {"url": "http://www.thinkbabynames.com/meaning/1/Jeronimo", "passage_text": "Jeronimo is an unusual given name for men but a very prominent surname for both adults and children (#20468 out of 150436, Top 14%). (2000 U.S. Census). Jeronimo has 1 variant: Jeronimus. Jeronimo has 20 more alternative forms via Geronimo, Jerome: Gerome, Gerrie, Gerry ▼ , Herinomos, Heronimo, Hierome, Hieronim, Hieronimo, Hieronimos, Hieronimus, Hieronymos, Hieronymus, Jairo ▼ , Jairome, Jeroen, Jeromo, Jerrome, Jerron, Jerrone and Jerry ▼ ."}, {"url": "http://www.behindthename.com/name/geronimo", "passage_text": "From Geronimo, gerónimo A spanish form OF. Jerome this is the-better known name of The apache Chief (goyathlay-1829). 1909 it was given to him by The, mexicans his. enemies This is the better-known name of the Apache chief Goyathlay (1829-1909). It was given to him by the Mexicans, his enemies."}]