[{"url": "http://psychology.wikia.com/wiki/Photoreceptor_cells", "passage_text": "A photoreceptor, or photoreceptor cell, is a specialized type of neuron (nerve cell) found in the eye 's retina that is capable of phototransduction. The great biological importance of photoreceptors is that as cells they convert light (electromagnetic radiation) into the beginning of a chain of biological processes. The two classic photoreceptors are rods and cones, each contributing information used by the visual system to form a representation of the visual world, sight. The novel third photoreceptor is a recently discovered class of photosensitive ganglion cells. These cells, found in the inner retina, have dendrites and long axons projecting to the pretectum (midbrain), the suprachiasmatic nucleas in the hypothalamus, and the lateral geniculate (thalamus)"}, {"url": "https://en.wikipedia.org/wiki/Photoreceptor_cell", "passage_text": "A photoreceptor cell is a specialized type of neuron found in the retina that is capable of phototransduction. The great biological importance of photoreceptors is that they convert light (visible electromagnetic radiation) into signals that can stimulate biological processes. To be more specific, photoreceptor proteins in the cell absorb photons, triggering a change in the cell's membrane potential. The two classic photoreceptor cells are rods and cones, each contributing information used by the visual system to form a representation of the visual world, sight. The function of the photoreceptor cell is to convert the light energy of the photon into a form of energy communicable to the nervous system and readily usable to the organism: This conversion is called signal transduction."}, {"url": "https://faculty.washington.edu/chudler/retina.html", "passage_text": "These specialized cells are called photoreceptors. There are 2 types of photoreceptors in the retina: rods and cones. The rods are most sensitive to light and dark changes, shape and movement and contain only one type of light-sensitive pigment. Rods are not good for color vision."}, {"url": "http://www.wikidoc.org/index.php/Photoreceptor_cell", "passage_text": "For other types of photoreceptors, see Photoreceptor. Functional parts of the rods (rods) and cones (cones). A photoreceptor, or photoreceptor cell, is a specialized type of neuron found in the eye 's retina that is capable of phototransduction. More specifically, the photoreceptor absorbs photons from the visual field and signals this information to other neurons through a change in its membrane potential"}, {"url": "http://webvision.med.utah.edu/book/part-ii-anatomy-and-physiology-of-the-retina/photoreceptors/", "passage_text": "Photoreceptors by Helga Kolb. Helga Kolb. Two or three types of cone photoreceptor and a single type of rod photoreceptor are present in the normal mammalian retina. Some non-mammalian retinas have even more cone types (see later). 1. Light microscopy and ultrastructure of rods and cones"}, {"url": "http://hyperphysics.phy-astr.gsu.edu/hbase/vision/rodcone.html", "passage_text": "Measured density curves for the rods and cones on the retina show an enormous density of cones in the fovea centralis. To them is attributed both color vision and the highest visual acuity. Visual examination of small detail involves focusing light from that detail onto the fovea centralis. Rod Details. The rods are the most numerous of the photoreceptors, some 120 million, and are the more sensitive than the cones. However, they are not sensitive to color. They are responsible for our dark-adapted, or scotopic, vision."}]