[{"url": "http://www.holiday-weather.com/marrakesh/averages/january/", "passage_text": "Averages for Marrakesh in January. Marrakesh in Morocco is steeped in rich history and culture and flush with natural, historic and architectural wonders due to their position as a crossroads for African and European cultures. An extremely popular holiday destination, Marrakesh benefits from wonderful weather for much of the year. This average includes an average low of 7 degrees and a high of 18 degrees Celsius. There will be a breeze or wind from the Atlantic Ocean which is roughly 168 kilometres away. Travellers to Marrakesh can expect to enjoy 11 hours of sunshine—the sunshine never stops shining in Morocco."}, {"url": "http://www.holiday-weather.com/marrakesh/averages/january/", "passage_text": "The average temperature on any given day in January hovers around 13 degrees Celsius. This average includes an average low of 7 degrees and a high of 18 degrees Celsius. There will be a breeze or wind from the Atlantic Ocean which is roughly 168 kilometres away. Travellers to Marrakesh can expect to enjoy 11 hours of sunshine—the sunshine never stops shining in Morocco."}, {"url": "http://www.holiday-weather.com/agadir/averages/january/", "passage_text": "Averages for Agadir in January. Weather Lowdown. January is coldest of the three winter months in Agadir, Morocco though temperatures still average a high of 23° C during the day. Most days are partly cloudy but generally you will experience a few days in the month when there is plenty of sunshine without a cloud in the sky. Thunderstorms occur, but are relatively uncommon in winter months. There is on average a less than 2% chance of a thunderstorm in January. When it does rain, moderate or light showers have the most likelihood of keeping you indoors for a time."}, {"url": "http://www.morocco.climatemps.com/", "passage_text": "1 Of the population, 13.5% live in a semi-arid/ steppe climate (BS), 0.8% live in a arid/ desert climate (BW), 78.4% live in a temperate/ mesothermal climate with dry summers (Cs), 7.3% live in a alpine/ highland climate (H). "}, {"url": "http://goafrica.about.com/library/bl.morocco.weather.htm", "passage_text": "The Middle Atlas Mountains get a lot of rainfall, especially from November to February. Summer temperatures average around 72-78 Fahrenheit (25 C) and winter temperatures can get as low as -4 Fahrenheit (-20 C). Western Sahara. If you're planning a trip to the Sahara Desert it's best to hop on a camel during the fall or early spring."}, {"url": "http://www.holiday-weather.com/agadir/averages/january/", "passage_text": "The coldest day of the year is January 15 th with the average temperature on that day dropping to 7° C. Other than the peaks of the Atlas Mountains that can be viewed from throughout the city, you will not see any snow on the ground in Agadir. Thunderstorms occur, but are relatively uncommon in winter months. There is on average a less than 2% chance of a thunderstorm in January. When it does rain, moderate or light showers have the most likelihood of keeping you indoors for a time."}, {"url": "http://www.weather2travel.com/january/morocco/", "passage_text": "Check the Weather in Morocco in January before you book your next holiday. This gives the best indication of the weather in January and includes figures for temperature, sunshine and rainfall. The Morocco january weather guide shown below is for Marrakech. 1  18°C max day temperature"}, {"url": "http://www.weather2travel.com/january/morocco/essaouira.php", "passage_text": "Check the Weather in Essaouira, Morocco in January before you book your next holiday. This gives the best indication of the weather in January and includes figures for temperature, sunshine and rainfall. 1  18°C max day temperature. "}, {"url": "https://weatherspark.com/averages/29205/1/Casablanca-Chaouia-Ouardigha-Morocco", "passage_text": "This report describes the typical weather at the Mohammed V International Airport (Casablanca, Morocco) weather station over the course of an average January. It is based on the historical records from 1974 to 2012. Earlier records are either unavailable or unreliable. Casablanca has a mediterranean climate with dry hot summers and mild winters. The area within 25 mi of this station is covered by croplands (79%), oceans and seas (11%), grasslands (4%), and forests (3%). The air is driest around January 30, at which time the relative humidity drops below 68% (mildly humid) three days out of four; it is most humid around January 9, rising above 93% (very humid) three days out of four."}, {"url": "http://www.worldweatheronline.com/Casablanca-weather-averages/MA.aspx", "passage_text": "The winter months in Casablanca never get truly cold, but temperatures in January can fall to 17 degrees during the day and 9 degrees at night, so it can feel comparatively cool. This is the quietest time of year in the city, and also the wettest-it rains on around 10 days a month now, but only for brief periods. "}]