[{"url": "http://www.bls.gov/ooh/production/bakers.htm", "passage_text": "$23,140. The median annual wage for bakers was $23,140 in May 2012. The median wage is the wage at which half the workers in an occupation earned more than that amount and half earned less. The lowest 10 percent earned less than $17,200, and the top 10 percent earned more than $36,980."}, {"url": "http://forums.whirlpool.net.au/archive/1244838", "passage_text": "From the award at www.sda.org.au you get paid 45% of the adult rate. Adult rate for a service assistant is $664.20 per week or $17.47 per hour exclusive of penalties. Your rate of pay would therefore be $7.8655 per hour exclusive of penalties and loadings. It's not much. I started at Woolworths when I was 15, and as a casual on probation I believe it was somewhere around the $8 mark. After three months you should move to the next level of shop assistant so you should get a marginal pay increase after three months if Coles has similar policies to those of Woolworths."}, {"url": "https://www.coles.com.au/our-range/our-products/bakery", "passage_text": "Coles Bakery is a proud winner of over 30 awards in 2014, as judged at the Royal Melbourne & Royal Hobart Fine Food Awards. From our Stone baked Turkish bread and Light Rye Sourdough to our Wholemeal & Quinoa pane di casa rolls, our award winning selection offers delicious options for every meal. There are a handful of bread and bakery products in our extended Coles Brand range which have toppings and glazes. While there are no preservatives or artificial additives in the dough, it is important to be aware that some of the toppings and glazes do contain artificial additives and preservatives."}, {"url": "https://collegegrad.com/careers/bakers", "passage_text": "The median annual wage for bakers was $23,140 in May 2012. The median wage is the wage at which half the workers in an occupation earned more than that amount and half earned less. The lowest 10 percent earned less than $17,200, and the top 10 percent earned more than $36,980."}, {"url": "http://au.indeed.com/cmp/Coles/salaries", "passage_text": "Average Coles hourly pay ranges from approximately $17.5 per hour for Customer Service Representative to $26 per hour for Production Team Member. Salary information comes from 79 data points collected directly from employees, users, and jobs on Indeed. The average Coles salary ranges from approximately $35,000 per year for Produce Associate to $140,000 per year for Store Manager."}, {"url": "http://www.ehow.com/info_8511647_much-pastry-chefs-bakers-make.html", "passage_text": "The U.S. Bureau of Labor Statistics includes pastry chefs in the broader job category of chefs and head cooks. These workers earned an average annual salary of $46,620 and a median salary of $42,490 in 2013, the BLS reports. Annual salaries ranged from $24,160 or less to $74,240 or more. A beginning pastry chef should expect a salary on the low end of the range, from $24,160 to approximately the midpoint of $42,490. Certain work settings and industries offer higher than average salaries, however. A pastry chef who had just finished culinary school could expect a salary of $17,000. However, the Indeed.com job website reports a higher average annual starting salary for pastry chefs -- $25,000 a year -- as of 2014."}, {"url": "http://work.chron.com/much-cake-baker-make-per-year-14449.html", "passage_text": "Cake bakers may work privately or for a food service establishment. According to the U.S. Bureau of Labor Statistics, cake bakers earned an annual wage of $23,250 in 2011. Individual income, however, depends on the type of food establishment the cake baker works at -- such as a grocery store versus a fine dining establishment -- and her education."}, {"url": "http://work.chron.com/much-cake-baker-make-per-year-14449.html", "passage_text": "The average hourly wage for a cake baker in 2011 was $11.18 -- with the lower end of the scale being $8.21 and the higher end being $17.82. Cake bakers who are self-employed or freelance may earn more, depending on their client list and geographical area. Individual income, however, depends on the type of food establishment the cake baker works at -- such as a grocery store versus a fine dining establishment -- and her education."}, {"url": "http://www.payscale.com/research/AU/Job=Baker/Hourly_Rate", "passage_text": "X Total Pay combines base annual salary or hourly wage, bonuses, profit sharing, tips, commissions, overtime pay and other forms of cash earnings, as applicable for this job. It does not include equity (stock) compensation, cash value of retirement benefits, or the value of other non-cash benefits (e.g. healthcare). "}]