[{"url": "http://www.thefreedictionary.com/stifling", "passage_text": "sti·fling. adj. 1. Very hot or stuffy: The air was stifling in the closed room. 2. Inhibiting, stultifying, or oppressive: The scholarly correctness of our age can be stifling (Annalyn Swan). sti′fling·ly adv. 1. suffocating, close, oppressive, airless, sticky, muggy The stifling heat of the little room was beginning to make me nauseous."}, {"url": "http://www.thefreedictionary.com/stifling", "passage_text": "stifling. adjective. 1. suffocating, close, oppressive, airless, sticky, muggy The stifling heat of the little room was beginning to make me nauseous."}, {"url": "http://www.oxforddictionaries.com/definition/english/stifling", "passage_text": "1 (Of heat, air, or a room) very hot and causing difficulties in breathing; suffocating: stifling heat the loft is stifling in summer. More example sentences. 1  Lizzy had to leave the room which had become too stifling. 1 The summers are stiflingly hot and the colony becomes infested with mosquitoes. 2  And even when their conversations veer too far into existential, meaning-of-life territory, the sharp banter between the pair keeps their exchanges from becoming too mannered or stiflingly intellectual."}, {"url": "http://www.thefreedictionary.com/stifling", "passage_text": "stifling-characterized by oppressive heat and humidity; the summer was sultry and oppressive; the stifling atmosphere; the sulfurous atmosphere preceding a thunderstorm. 1. suffocating, close, oppressive, airless, sticky, muggy The stifling heat of the little room was beginning to make me nauseous."}, {"url": "http://www.merriam-webster.com/dictionary/stifle", "passage_text": "Definition of STIFLE. : the joint next above the hock in the hind leg of a quadruped (as a horse or dog) corresponding to the human knee — see horse illustration. ADVERTISEMENT. Middle English. First Known Use: 14th century"}, {"url": "http://www.merriam-webster.com/dictionary/stifle", "passage_text": "Full Definition of STIFLE. transitive verb. 1. a: to kill by depriving of oxygen: suffocate b (1) : smother (2) : muffle. 2. a: to cut off (as the voice or breath) c: deter, discourage. intransitive verb. — sti·fler \\-f(ə-)lər\\ noun. — sti·fling·ly \\-f(ə-)liŋ-lē\\ adverb. See stifle defined for English-language learners. : the joint next above the hock in the hind leg of a quadruped (as a horse or dog) corresponding to the human knee — see horse illustration. ADVERTISEMENT."}, {"url": "http://www.thefreedictionary.com/stiflingly", "passage_text": "stifle. 1. to prevent, or be prevented, from breathing (easily) eg because of bad air, an obstruction over the mouth and nose etc; to suffocate. Dictionary browser? ▲. 1  stiff gentian. 2  Stiff neck. 3  stiff upper lip. 4  stiff-arm. 5  stiff-backed. 6  stiff-branched. 7  stiffen. 8  stiffener. 9  stiffening. 10  Stiffening order. 11  stiff-haired. 12  Stiff-hearted. 13  stiffish. 14  stiffly. 15  stiff-necked. 16  Stiff-neckedness. 17  stiffness. 18  Stifftail. 19  stiff-tailed. 20  stiffy. 21  stifle. 22  Stifle bone. 23  stifled. 24  stifler. 25  stifling. 26  stiflingly. 27  stigma."}, {"url": "http://www.thefreedictionary.com/stiflingly", "passage_text": "stifle. 1. To hold (something requiring an outlet) in check: burke, choke (back), gag, hold back, hold down, hush (up), muffle, quench, repress, smother, squelch, strangle, suppress, throttle. Dictionary browser? ▲. 1  stiff gentian. 2  Stiff neck. 3  stiff upper lip. 4  stiff-arm. 5  stiff-backed. 6  stiff-branched. 7  stiffen. 8  stiffener. 9  stiffening. 10  Stiffening order. 11  stiff-haired. 12  Stiff-hearted. 13  stiffish. 14  stiffly. 15  stiff-necked. 16  Stiff-neckedness. 17  stiffness. 18  Stifftail. 19  stiff-tailed. 20  stiffy. 21  stifle. 22  Stifle bone. 23  stifled. 24  stifler. 25  stifling. 26  stiflingly. 27  stigma."}, {"url": "http://www.collinsdictionary.com/dictionary/english/stifling", "passage_text": "The iciness of the first winter, followed by the stifling heat of summer. They were sick of religiosity in all its forms, just as they were sick of the Order's omnipresent and stifling holism. Rafael was standing at the window, obediently stifling his tears. "}, {"url": "http://www.thefreedictionary.com/stiflingly", "passage_text": "1. suppress, repress, prevent, stop, check, silence, curb, restrain, cover up, gag, hush, smother, extinguish, muffle, choke back Critics have accused them of trying to stifle debate. 2. restrain, suppress, repress, smother She makes no attempt to stifle a yawn. verb. 1. Dictionary browser? ▲. 1  stiff gentian. 2  Stiff neck. 3  stiff upper lip. 4  stiff-arm. 5  stiff-backed. 6  stiff-branched. 7  stiffen. 8  stiffener. 9  stiffening. 10  Stiffening order. 11  stiff-haired. 12  Stiff-hearted. 13  stiffish. 14  stiffly. 15  stiff-necked. 16  Stiff-neckedness. 17  stiffness. 18  Stifftail. 19  stiff-tailed. 20  stiffy. 21  stifle. 22  Stifle bone. 23  stifled. 24  stifler. 25  stifling. 26  stiflingly. 27  stigma."}]