[{"url": "https://en.wikipedia.org/wiki/MENA", "passage_text": "The term MENA is an acronym referring to the Middle East and North Africa region. The term MENA covers an extensive region, extending from Morocco to Iran, including all Middle Eastern and Maghreb countries. The term is roughly synonymous with the term the Greater Middle East. According to the Oil and Gas Journal (January 1, 2009), the MENA region has 60% of the world's oil reserves (810.98 billion barrels (128.936 km 3)) and 45% of the world's natural gas reserves (2,868,886 billion cubic feet (81,237.8 km 3)). As of 2011, 8 of the 12 OPEC nations are within the MENA region."}, {"url": "http://www.worldbank.org/en/region/mena/publication/mena-quarterly-economic-brief", "passage_text": "January 2015: Plunging Oil Prices. The over-50% decline in world oil prices—from US$115 a barrel in June 2014 to less than US$50 today—will have significant consequences for the economies of the Middle East and North Africa (MENA) region. The MENA Quarterly Economic Brief supplements the World Bank’s semi-annual MENA Economic Monitor with a real-time review, using high-frequency data, of selected countries in the MENA region."}, {"url": "https://en.wikipedia.org/wiki/Middle_East", "passage_text": "The Middle East (also called the Mid East) is a eurocentric description of a region centered on Western Asia and Egypt. The corresponding adjective is Middle-Eastern and the derived noun is Middle-Easterner. Formerly, the eurocentric synonym Near East (as opposed to Far East) was commonly used. In 1958, the State Department explained that the terms Near East and Middle East were interchangeable, and defined the region as including only Egypt, Syria, Israel, Lebanon, Jordan, Iraq, Saudi Arabia, Kuwait, Bahrain, and Qatar."}, {"url": "http://www.investopedia.com/terms/m/middle-east-and-north-africa-mena.asp", "passage_text": "A region encompassing approximately 22 countries in the Middle East and North Africa. The MENA region accounts for approximately 6% of the world's population, 60% of the world's oil reserves and 45% of the world's natural gas reserves. Due to the region's substantial petroleum and natural gas reserves, MENA is an important source of global economic stability. Next Up. The following countries are typically included in MENA: Algeria, Bahrain, Djibouti, Egypt, Iran, Iraq, Israel, Jordan, Kuwait, Lebanon, Libya, Malta, Morocco, Oman, Qatar, Saudi Arabia, Syria, Tunisia, United Arab Emirates, West Bank and Gaza, and Yemen."}, {"url": "http://www.worldbank.org/en/region/mena/publication/mena-quarterly-economic-brief", "passage_text": "Ongoing regional tensions, together with a challenging external environment, have hit the economies of the Middle East and North Africa (MENA) region hard. Economic growth is slowing, fiscal buffers are depleting, unemployment is rising, and inflation is mounting in seven transition countries in the region. The MENA Quarterly Economic Brief supplements the World Bank’s semi-annual MENA Economic Monitor with a real-time review, using high-frequency data, of selected countries in the MENA region."}, {"url": "http://www.definitions.net/definition/mena", "passage_text": "MENA. The term MENA, for Middle East and North Africa, is an acronym often used in academic, military planning, disaster relief, and business writing. Due to the geographic ambiguity and Eurocentric nature of the term Middle East, many people prefer use of the term WANA or the less common NAWA. The term MENA, for Middle East and North Africa, is an acronym often used in academic, military planning, disaster relief, and business writing"}, {"url": "http://www.investopedia.com/terms/m/middle-east-and-north-africa-mena.asp", "passage_text": "Many of the 12 OPEC nations are within the MENA region. While there is no standardized list of which countries are included in the MENA region, the term typically includes the area from Morocco in northwest Africa to Iran in southwest Asia and down to Sudan in Africa. The following countries are typically included in MENA: Algeria, Bahrain, Djibouti, Egypt, Iran, Iraq, Israel, Jordan, Kuwait, Lebanon, Libya, Malta, Morocco, Oman, Qatar, Saudi Arabia, Syria, Tunisia, United Arab Emirates, West Bank and Gaza, and Yemen."}]