[{"url": "http://www.answers.com/Q/When_did_the_British_Sixpence_cease_to_be_legal_tender", "passage_text": "The Bank of England Ten Shilling note was last issued on 13-Oct-1969 and ceased to be legal tender on 22-Nov-1970. It was replaced by the 50 New Pence coin which was first i … ssued in 1969. Series C featuring Queen Elizabeth II (140 x 85mm) - First issued 1963, Last issued 1971, ceased to be legal tender 31-Aug-1973.   Series D featuring Queen Elizabeth II (145 x 78mm) - First issued 1971, Last issued 1990, ceased to be legal tender 29-Nov-1991."}, {"url": "http://www.bankofengland.co.uk/banknotes/Pages/about/history.aspx", "passage_text": "In 1833 the Bank’s notes were made legal tender for all sums above £5 in England and Wales so that, in the event of a crisis, the public would still be willing to accept the Bank’s notes and its bullion reserves would be safeguarded. "}, {"url": "http://www.historytoday.com/richard-cavendish/farthings-last-day", "passage_text": "The farthing ceased to be legal tender on December 31st, 1960. The stroke of midnight that ushered in New Year’s Day 1961 tolled the funeral bell for the farthing. By the 1950s bus conductors were refusing to accept farthing coins and their value was so small that their usefulness was felt to be over. None were minted after 1956 and they were not legal tender after 1960."}, {"url": "http://www.historytoday.com/richard-cavendish/farthings-last-day", "passage_text": "Britain Economic History. The farthing ceased to be legal tender on December 31st, 1960. The stroke of midnight that ushered in New Year’s Day 1961 tolled the funeral bell for the farthing. Originally a fourthling, or fourth part of a penny, Britain’s tiniest coin had a history stretching back to the 13th century. By the 1950s bus conductors were refusing to accept farthing coins and their value was so small that their usefulness was felt to be over. None were minted after 1956 and they were not legal tender after 1960."}, {"url": "http://www.answers.com/Q/When_did_the_British_Sixpence_cease_to_be_legal_tender", "passage_text": "The 25 Pence Crown was discontinued and the title Crown applied to the Five Pound coin from 1990, with Crowns being minted in most years since. The decimal 25 Pence and Five Pound Crowns are not intended to be circulating coins but are legal tender never the less. Series C featuring Queen Elizabeth II (140 x 85mm) - First issued 1963, Last issued 1971, ceased to be legal tender 31-Aug-1973.   Series D featuring Queen Elizabeth II (145 x 78mm) - First issued 1971, Last issued 1990, ceased to be legal tender 29-Nov-1991."}, {"url": "http://www.answers.com/Q/When_did_the_British_Threepence_cease_to_be_legal_tender", "passage_text": "British decimal general circulation coins that are still legal tender include-All years of issue from 1971 of the 1 New Penny and 1 Penny coins. All years of issue from 1971 … of the 2 New Pence and 2 Pence coins. The smaller 18mm 5 Pence coins issued from 1990. The British brass threepence ceased to be legal tender after 31 August 1971, following decimalisation. The general circulation British silver Threepence was no longer minted after 1945, but does not seem to have been demonetised."}, {"url": "http://news.bbc.co.uk/onthisday/hi/dates/stories/november/12/newsid_2518000/2518637.stm", "passage_text": "1984: Quid notes out-pound coins in The English pound note is to disappear after more than 150 years. News of the familiar green 1 note's withdrawal came when Chancellor Nigel Lawson made his autumn statement in parliament on Monday. "}, {"url": "http://www.answers.com/Q/When_did_the_British_Sixpence_cease_to_be_legal_tender", "passage_text": "There were three different blue Five Pound notes.   Series B featuring Britannia (158 x 90mm) - First issued 1957, Last issued 1963, ceased to be legal tender 27-Jun-1 … 967.   Series C featuring Queen Elizabeth II (140 x 85mm) - First issued 1963, Last issued 1971, ceased to be legal tender 31-Aug-1973.   Series D featuring Queen Elizabeth II (145 x 78mm) - First issued 1971, Last issued 1990, ceased to be legal tender 29-Nov-1991."}, {"url": "https://en.wikipedia.org/wiki/Sixpence_(British_coin)", "passage_text": "The sixpence (6d), sometimes known as a tanner or sixpenny bit, was a coin worth one-fortieth of a pound sterling, or six pence. It was first minted in the reign of Edward VI and circulated until 1980. Following decimalisation in 1971 it had a value of 2½ new pence. The coin was made from silver from its introduction in 1551 to 1947, and thereafter in cupronickel. Prior to Decimal Day in 1971 there were 240 pence in one pound sterling. Twelve pence made a shilling, and twenty shillings made a pound."}, {"url": "http://www.thisismoney.co.uk/money/news/article-2616022/Old-50-notes-cease-legal-tender-Wednesday.html", "passage_text": "96. View. comments. Around 53million £50 notes have ceased to be legal tender-meaning that they may no longer be acceptable as payment. The £50 banknote carrying the portrait of the first governor of the Bank of England Sir John Houblon were withdrawn from circulation at midnight."}]