[{"url": "https://en.wikipedia.org/wiki/Vestibulocerebellum", "passage_text": "The anatomy of the cerebellum can be viewed at three levels. At the level of large-scale anatomy, the cerebellum consists of a tightly folded and crumpled layer of cortex, with white matter underneath, several deep nuclei embedded in the white matter, and a fluid-filled ventricle in the middle."}, {"url": "http://www.cerebellum.us/", "passage_text": "The cerebellum is a part of the human brain. It is the part of the brain that that is responsible for human movement, co-ordination, motor control and sensory perception. The cerebellum is in the lower posterior part of the brain which looks almost like it is separate but still of the same unit. "}, {"url": "http://www.csuchico.edu/~pmccaffrey/syllabi/CMSD%20320/362unit7.html", "passage_text": "The cerebellum is located in the posterior fossa of the skull, dorsal to the pons and medulla from which it is separated by the Aqueduct of Sylvius and the fourth ventricle. Like the cerebrum, the cerebellum is covered by cortex and consists of two hemispheres, each of which is divided into lobes. "}, {"url": "http://psychology.wikia.com/wiki/Cerebellum", "passage_text": "The cerebellum (Latin for little brain) is a region of the brain that plays an important role in motor control. It may also be involved in some cognitive functions such as attention and language, and in regulating fear and pleasure responses, but its movement-related functions are the most solidly established. "}, {"url": "http://www.wisegeek.org/what-is-the-cerebellum.htm", "passage_text": "Top 10 amazing movie makeup transformations. The cerebellum, Latin for little brain , is a plum-sized portion of the brain located below the cerebral hemispheres and behind the brain stem. It's main claim to fame is that it contains half the neurons of the brain despite being only 10% of its size. This is because its main constituents are tiny granule cells. "}, {"url": "http://neuroskills.com/brain-injury/cerebellum.php", "passage_text": "Cerebellum. The cerebellum is involved in the coordination of voluntary motor movement, balance and equilibrium and muscle tone. It is located just above the brain stem and toward the back of the brain. It is relatively well protected from trauma compared to the frontal and temporal lobes and brain stem. "}, {"url": "https://en.wikipedia.org/wiki/Cerebellum", "passage_text": "In addition to its direct role in motor control, the cerebellum is necessary for several types of motor learning, most notably learning to adjust to changes in sensorimotor relationships. The name cerebellum is a diminutive of cerebrum (brain); it can be translated literally as little brain. The Latin name is a direct translation of the Ancient Greek παρεγκεφαλίς (parencephalis), which was used in the works of Aristotle, the first known writer to describe the structure."}, {"url": "http://www.healthline.com/human-body-maps/cerebellum", "passage_text": "Cerebellum. The cerebellum is located behind the top part of the brain stem (where the spinal cord meets the brain) and is made of two hemispheres (halves). The cerebellum receives information from the sensory systems, the spinal cord, and other parts of the brain and then regulates motor movements. The cerebellum coordinates voluntary movements such as posture, balance, coordination, and speech, resulting in smooth and balanced muscular activity. "}, {"url": "http://biology.about.com/od/anatomy/p/cerebellum.htm", "passage_text": "By Regina Bailey. Cerebellum: In Latin, the word cerebellum means little brain. The cerebellum is the area of the hindbrain that controls motor movement coordination, balance, equilibrium and muscle tone. Like the cerebral cortex, the cerebellum is comprised of white matter and a thin, outer layer of densely folded gray matter. "}, {"url": "https://en.wikipedia.org/wiki/Cerebellum", "passage_text": "The cerebellum (Latin for little brain) is a region of the brain that plays an important role in motor control. It may also be involved in some cognitive functions such as attention and language, and in regulating fear and pleasure responses, but its movement-related functions are the most solidly established. The name cerebellum is a diminutive of cerebrum (brain); it can be translated literally as little brain. The Latin name is a direct translation of the Ancient Greek παρεγκεφαλίς (parencephalis), which was used in the works of Aristotle, the first known writer to describe the structure."}]