[{"url": "http://www.livescience.com/31935-louvre-museum.html", "passage_text": "Because of its size and the scale of its collection, it is impossible to see the entirety of the Louvre in one visit. The museum reported about 8.8 million visitors in 2011 — so prepare for crowds, especially around the most popular works."}, {"url": "http://goparis.about.com/od/parismuseums/a/Louvre_Museum.htm", "passage_text": "1 For books and gifts, head to the Louvre bookshop in the Hall Napoleon under the Pyramid. 2  The bookshop boasts France's largest selection of art history titles, in addition to a wide range of guidebooks in various languages, childrens' books, and engravings."}, {"url": "http://www.discoverfrance.net/France/Paris/Museums-Paris/Louvre.shtml", "passage_text": "Louvre {loov'-ruh}  a French palace and the national art museum of France. Located in Paris, the Louvre is one of the largest palaces in the world and, as a former residence of the kings of France, one of the most illustrious. It exemplifies traditional French architecture since the Renaissance, and it houses a magnificent collection of ancient and Western art."}, {"url": "http://www.louvregroup.com/location/london/", "passage_text": "In addition, London and the UK are often the preferred choice for university education for international students. Our London office is a short distance from Mayfair, and provides estate planning, probate services and other administration services in support of the wider Louvre Group."}, {"url": "http://europeantrips.org/louvre-museum.html", "passage_text": "The building that hosts the Louvre Museum is the Louvre Palace, a palace which was built on the fortress established in 12th century by Phillip II. There were several renovations done to form what the Palace today."}, {"url": "http://www.louvregroup.com/location/london/", "passage_text": "The City of London is a pre-eminent international finance centre – it continues to be a leader in financial services and underpinned by the London Stock Exchange and Alternative Investment Market, is Europe’s primary investment banking player."}, {"url": "http://www.livescience.com/31935-louvre-museum.html", "passage_text": "The Louvre is the world’s largest museum and houses one of the most impressive art collections in history. Credit: kan_khampanya | Shutterstock.com. View full size image. The Louvre is the world’s largest museum and houses one of the most impressive art collections in history. The magnificent, baroque-style palace and museum — LeMusée lemusée Du louvre In — french sits along the banks of The Seine river In. paris"}, {"url": "http://www.365tickets.co.uk/louvre-museum", "passage_text": "The Louvre or Louvre Museum s one of the world's largest museums and a historic monument. A central landmark of Paris, France, it is located on the Right Bank of the Seine in the 1st arrondissement (district)."}]