[{"url": "http://www.dogbreedinfo.com/irishwolfhound.htm", "passage_text": "The Irish Wolfhound's name originates from is use as a wolf hunter, and not from its appearance. This is a very old breed with Roman records dating as far back as 391 AD. They were used in wars, and for guarding herds and property and for hunting Irish elk, deer, boar and wolves."}, {"url": "http://dogcare.dailypuppy.com/breed-bigger-great-dane-irish-wolfhound-6961.html", "passage_text": "Overall Great Danes tend to be heavier than Irish wolfhounds, who are on average the taller of the two breeds. Individual variation between any two dogs makes comparisons nearly impossible except as breed averages. Big, therefore, is a relative term dependent entirely upon your definition."}, {"url": "http://www.vetstreet.com/13-largest-dog-breeds-towering-and-commanding", "passage_text": "Possibly created by blending the Irish Wolfhound and the Mastiff, the Great Dane was originally used to hunt boar and guard estates, but these days, he’s a family dog. Male Great Danes stand at least 30 inches tall and weigh a minimum of 120 pounds. Females are at least 28 inches tall and weigh a minimum of 100 pounds."}, {"url": "http://www.dogbreedinfo.com/irishwolfhound.htm", "passage_text": "The Irish Wolfhound is a giant-sized dog, one of the tallest breeds in the world, reaching the size of a small pony. The head is long and the skull is not too broad. The muzzle is long and somewhat pointed."}, {"url": "http://www.petmd.com/dog/breeds/c_dg_irish_wolfhound", "passage_text": "Save to mypetMD. Known as the world's largest breed, the Irish Wolfhound is a strong and sturdy giant whose temperament is gentle and noble. The Irish Wolfhound makes an excellent addition to any family that can offer plenty of space to accommodate this breed's size."}, {"url": "http://www.answers.com/Q/What_is_the_largest_wolf_breed_in_the_world", "passage_text": "While the timber wolf is the largest breed, there can be larger specimens in mixed breed wolves. I've seen one that was a mixture of timber wolve and something like 2 other breed s that stood at a 6' cyclone fence and was looking over the top with about a foot and a half. These are known as hybrid wolves."}, {"url": "http://www.answers.com/Q/What_is_the_largest_wolf_breed_in_the_world", "passage_text": "The smallest breed of wolves is the 70 pound 32 inches tall red wolf. These wolves are endangered because people destroy forests which is where they live and they build on the … ir territory. Some red wolves are mating with coyotes. Only 300 live in the world today, about 80 of them are in the wild."}, {"url": "http://www.themost10.com/10-most-largest-dog-breeds/", "passage_text": "Irish Wolfhound. Irish Wolfhounds are the tallest of dog breeds. They generally weigh 40 to 69 kg and also they have a height of 28-35 inches. These dogs are intelligent, patient and generous breeds."}]