[{"url": "http://www.onepath.com.au/personal/insurance/travel-insurance.aspx", "passage_text": "Home, Car, Travel and Landlord Insurance are issued by QBE Insurance (Australia) Limited (QBE) ABN 78 003 191 035 (AFSL 239545). The information provided is of a general nature and does not take into account your personal needs and financial circumstances."}, {"url": "http://www.ausbt.com.au/anz-platinum-credit-card-travel-insurance-reviewed", "passage_text": "Out of the credit card travel insurance offers we compared (NAB, Commonwealth Bank, Westpac, St George, ANZ and American Express), ANZ's was good in almost all areas -- particularly in its ability to cover a range of common pre-existing medical conditions without special approval from the insurer."}, {"url": "https://travelcard.anz.com/anztrportal/contact.do", "passage_text": "The ANZ Travel Card is not intended to be purchased by any person who is not a resident of Australia. The ANZ Travel Card is not able to be linked to any ANZ account and cannot be accessed via ANZ Internet Banking. To access your Card details, you will need to go to anz.com/travelcard."}, {"url": "http://www.wealth.anz.com/insurance?pid=pro-hb-nt-fly-04-14-acq-insuranceall&TCID=anzinsflyouttab", "passage_text": "Subject to monetary limits. Please see the table of benefits in the PDS. ANZ Home Insurance is issued by QBE Insurance (Australia) Limited (QBE) ABN 78 003 191 035 (AFSL 239545). ANZ Life Insurance and ANZ Income Protection are issued by OnePath Life Limited (ABN 33 009 657 176)."}, {"url": "https://travelcard.anz.com/anztrportal/contact.do", "passage_text": "Lost, stolen or divulged PINs. Change your PIN by visiting anz.com/travelcard or by calling ANZ Travel Card Customer Service on 1800 094 003 (within Australia) + 61 3 9683 7777 (If calling from overseas, please call reverse charge +613 9683 7777. If you dial the number direct, you may be charged for the call)."}, {"url": "http://www.anz.co.nz/personal/insurance/travel-insurance/", "passage_text": "ANZ Travel Protector is issued and managed by Allianz Global Assistance New Zealand Limited Company No.1537730, underwritten by Allianz Australia Insurance Limited ABN 15 000 122 850 (Incorporated in Australia) trading as Allianz New Zealand, and distributed through ANZ."}]