[{"url": "http://www.dohiy.com/2014/03/10/finally-a-decision/", "passage_text": "1 Riverstone quartz is the same material as other quartz surfaces (93% quartz bound with acrylic), but fabricated for DIY installation, which is a huge money-saver. 2  The color we selected and the reflective finish will help light up our north-facing kitchen."}, {"url": "http://www.riverstonesurfaces.com/pro_quartz.html", "passage_text": "Quartz. Riverstone is proud to offer DuPont Zodiaq and Silestone quartz products. Quartz is an engineered stone, comprised of 93% quartz stone and 7% resin binder. The chunks of quartz are recombined using intense pressure and heat."}, {"url": "http://www.dohiy.com/2014/04/11/diy-quartz-what-we-know-now/", "passage_text": "-Homer Simpson. When we were researching countertops, we had trouble finding information about Riverstone quartz. Now that we’ve put our Riverstone in, here are some of the answers to questions we had earlier in the process (and couldn’t seem to find anywhere!)."}, {"url": "http://www.riverstonesurfaces.com/pro_quartz.html", "passage_text": "Riverstone is proud to offer DuPont Zodiaq and Silestone quartz products. Quartz is an engineered stone, comprised of 93% quartz stone and 7% resin binder. The chunks of quartz are recombined using intense pressure and heat."}, {"url": "http://www.midwestmanufacturing.com/MidwestManufacturing/productType.do?groupId=9&productTypeId=57&Countertops=RiverStone-Quartz", "passage_text": "RiverStone Quartz countertops offer an unmatched elegance, finishing, and style with strength and durability supplied by nature. We offer rich, vibrant, and natural colors in our abrasion-resistat surfaces. Order Samples Online."}, {"url": "http://riverstonesurfaces.com/", "passage_text": "Welcome. Riverstone Surfaces is the preferred supplier in Eastern Ontario for quartz, granite, solid surface, and cultured marble. Since 2002, we have grown deliberately and steadily, perfecting our craft one customer at a time. Our customers tell us that they appreciate our attention to detail."}]