[{"url": "http://designfor-me.com/cost-planning/how-much-does-a-house-extension-cost/", "passage_text": "As a rule of thumb you can add 50% extra to the build cost of a single storey extension. So, £24,000 +50% = £36,000. + Add on 10-15% for professional fees (architect, planning application, building regs, structural engineer). + VAT. You may have heard that the rule of thumb is £1,000 per m2. However, this figure has been bandied about for rather a long time now! From experience, £1,200 per m2 is a now a more realistic estimate for a house extension cost in 2015 and reflects price increases over the last few years. So, for your 4 x 5m extension, the build cost would be roughly £24,000"}, {"url": "http://www.moneywise.co.uk/home-mortgage/improvements/home-extensions-what-you-need-to-know", "passage_text": "Extensions are more expensive: RICS gives a guide cost of between £1,260 and £1,680 per square metre for an extension with plastered finish. So a 20-square metre single-storey extension will range from £25,200 to £33,600 – before you've put down flooring or installed a kitchen. 1 Side extensions must be single storey with a maximum height of 4m. 2  If the extension is within 2m of a boundary, the maximum eaves height should be no higher than 3m. 3  A single-storey extension must not extend beyond the rear of the house by more than 3m for an attached house or 4m if the house is detached."}, {"url": "http://www.whatprice.co.uk/prices/building/extension-double-storey.html", "passage_text": "Building prices for extension double storey. These are the prices we have received for the total cost either per metre squared or for the whole job of building a double storey extension onto your property. The total area of the job in square metres is the sum of the area of both the lower and upper floor. 2013-11-26. Two storey extension, 22m2 per floor Ground floor-lounge two windows north & west elevation, double patio doors to south leading into garden. Fire place on east side of room for wood / duel fuel burner (connecting to existing fire place & chimney from room next door)."}, {"url": "http://community.screwfix.com/threads/rough-extension-costs.14211/", "passage_text": "I have looked into previous jobs that I have drawn and that I have seen the estimates for and generally, the smaller the job, the more it costs per square metre. For a small two storey extension it works out at £1600 per square metre and for a very large (total 60 sq. m)it works out at £1200 per square metre. As I said in an earlier post, it also depends on other aspects of the job. "}, {"url": "http://www.whatprice.co.uk/costs/extension-costs.php", "passage_text": "Calculated Cost. Single storey kitchen/dining room extension 25m 2 in total including fitting of kitchen 2 radiators, move boiler, 12 spot lights, bi fold screen doors, 3 velux windows full decoration, all planning, etc taken care of. Had 4 quotes ranging from 30000 to 48000 went with the cheapest quote"}, {"url": "http://www.nationwide.co.uk/about/media-centre-and-specialist-areas/media-centre/press-releases/archive/2012/9/home-extensions-can-add-significant-value-to-the-average-home", "passage_text": "The price for building an extension can cost, on average, around £1,000 per m 2 or £23,000 3 for a single storey and £76,0004 for a double storey. For eligibility criteria: http://www.nationwide.co.uk/current_account/account_benefits.htm. 1 Each additional bedroom is assumed to have a floor area of approximately 13m 2. 2 The extension/loft conversion is assumed to add approximately 30m2. 3 Cost of an average single story extension."}, {"url": "http://www.whatprice.co.uk/prices/building/extension-double-storey.html", "passage_text": "Charles completed an extension for us to provided a two storey extension to the side of our house. All works completed including groundwork, walls and roof, all internal works. We are very happy with the outcome. We have no problem in recommending him for your works. 2013-11-26. Two storey extension, 22m2 per floor Ground floor-lounge two windows north & west elevation, double patio doors to south leading into garden. Fire place on east side of room for wood / duel fuel burner (connecting to existing fire place & chimney from room next door)."}, {"url": "http://www.buildinginspiration.co.uk/planning/budgeting-extensions/", "passage_text": "Most builders can give you an idea of what your extension will cost per square foot or metre. For example, a basic single storey extension would typically cost around £1,000 per square metre but it could be up to £1,600 or more for a premium two storey extension. So a 3 x 5 metre extension would cost £15,000 and up to £50,000 for a two storey, more premium extension. These costs are just to create a room, they would not typically include the cost of a kitchen or bathroom."}]