[{"url": "http://www.thecatsite.com/t/194080/powdered-cellulose", "passage_text": "Some brands of high-fiber bread, also, use powdered cellulose to raise the dietary fiber level. It is used as a thickener and a stabalizer in other foods and in pharmiceuticals. If it doesn't bother you to eat it yourself then it probably doesn't matter if your cat eats it. Do a Google search on 'powdered cellulose'. Powdered cellulose. A natural plant fiber source. This ingredient is highly refined, a white powder that provides insoluble fiber to the diet. The purpose of insoluble fiber is to lower calories or help control hairballs in cats."}, {"url": "http://powderedcellulose.com/what-is-powdered-cellulose/", "passage_text": "Fiber (Properties, Functionality & Applications). Insoluble fiber is considered to be the “gut-healthy fiber” because one of its roles is supporting regularity. It does not dissolve in water and can be found in whole grain products and in Ridgeland® Cellulose Fibers. – The most recognized benefit of fiber is its important role in keeping the digestive system running smoothly by promoting regularity. Fiber adds bulk to help move food through the digestive tract. – Along with regular exercise and plenty of water, fiber plays an important part in maintaining digestive health."}, {"url": "http://amateurfooddetective.blogspot.com/2011/08/what-is-cellulose.html", "passage_text": "Powdered cellulose is considered synthetic, which seems odd, given that it's derived from a natural source, therefore it would leave one to believe it's a natural product. The reason it is considered synthetic, however, is because of the way the product is derived. Okay, here's the breakdown on wood. "}, {"url": "https://en.wikipedia.org/wiki/Cellulose", "passage_text": "Some species of bacteria secrete it to form biofilms. Cellulose is the most abundant organic polymer on Earth. The cellulose content of cotton fiber is 90%, that of wood is 40–50% and that of dried hemp is approximately 45%. Cellulose is mainly used to produce paperboard and paper. Cellulose is an organic compound with the formula (C 6H 10O 5) n, a polysaccharide consisting of a linear chain of several hundred to many thousands of β(1→4) linked D-glucose units."}, {"url": "http://www.rd.com/health/healthy-eating/the-fib-about-some-high-fiber-foods/", "passage_text": "“Powdered cellulose is made by cooking raw plant fiber—usually wood—in various chemicals to separate the cellulose,” says the Wall Street Journal, and it’s even used in organic products. Considered safe for human consumption by the FDA, many companies tout powdered cellulose’s benefits as a source of fiber. Though it is technically a fiber source, it mainly acts as a filler, provides better structure, and strengthens food to stand up to shipping. If you answered a resounding “No” to this question, think again. Powdered cellulose (aka processed virgin wood pulp), is a binder and filler used in all types of foods, especially high-fiber and reduced-fat products."}, {"url": "http://www.dogtipper.com/tip/2011/08/watching-for-powdered-cellulose-in-dog-food.html", "passage_text": "August 4, 2011 By Paris Permenter. We all need fiber in our diets but it’s important to look at the source of that fiber found in your dog’s food. In today’s nutrition tip, canine nutrition expert Tracie Hotchner looks at what is a surprising ingredient in some dog food: powdered cellulose. Powdered cellulose is a fiber source in dry dog food with the lowest food value of any kind of fiber and it may amaze you that it is even permitted in dog food. "}, {"url": "http://www.petfoodindustry.com/articles/33-cellulose", "passage_text": "The crude fiber content of commercially-available powdered cellulose is around 75% of the organic matter (Kienzle et al ., 2001a) and the total dietary fiber content is nearly 100%. It is mostly insoluble fiber, and fermentation in vitro and in vivo is negligible for both the cat and dog (Sunvold et al ., 1995a, b). "}, {"url": "http://foodreference.about.com/od/Food-Additives/a/What-Is-Cellulose.htm", "passage_text": "Anti-caking – Cellulose’s ability to absorb moisture and coat ingredients in a fine powder make it the ingredient of choice for anti-caking applications. Shredded and grated cheeses, spice mixes, and powdered drink mixes are just a few of the many food items that take advantage of cellulose as an anti-caking agent. This organic compound, which is considered the most abundant on earth, is even excreted by some bacteria. Cellulose provides structure and strength to the cell walls of plants and provides fiber in our diets. Although some animals, such as ruminants, can digest cellulose, humans cannot."}, {"url": "https://en.wikipedia.org/wiki/Cellulose", "passage_text": "Some animals, particularly ruminants and termites, can digest cellulose with the help of symbiotic micro-organisms that live in their guts, such as Trichonympha. In humans, cellulose acts as a hydrophilic bulking agent for feces and is often referred to as a  dietary fiber . Cellulose is an organic compound with the formula (C 6H 10O 5) n, a polysaccharide consisting of a linear chain of several hundred to many thousands of β(1→4) linked D-glucose units."}]