[{"url": "http://www.ucmp.berkeley.edu/taxa/inverts/mollusca/mollusca.php", "passage_text": "An introduction. Mollusca is one of the most diverse groups of animals on the planet, with at least 50,000 living species (and more likely around 200,000). It includes such familiar organisms as snails, octopuses, squid, clams, scallops, oysters, and chitons. "}, {"url": "http://www.lhsblogs.typepad.com/files/wonderful-world-of-invertebrates-webquest-1.pdf", "passage_text": "4.) Mollusks (soft bodied invertebrates) 1.) How many species of mollusks are found in the world? 2.) Explain the 3 body regions of a mollusk. SCROLL DOWN!! 3.) Explain how pearls are made? 4.) What is he difference between a squid and an octopus? 5.) Annelids: The segmented worms. 7.) Arthropods: animals with exoskeletons & jointed appendages Click here to find out about arthropods 1.) Explain one reason that arthropods are such a wildly successful group of animals. 2.) Read about the morphology of arthropods and tell 7 interesting adaptations of appendages in arthropods."}, {"url": "http://oceanicresearch.org/education/wonders/mollusk.html", "passage_text": "The bivalves (meaning two-shells) are perhaps the most well known mollusks simply because of their history as a source of food. Clams, mussels, oysters and scallops are all bivalves. There are about 15,000 known species of bivalve, with about 80% of them being marine (the rest are found in fresh water). In general, mollusks have 3 body regions: a head, a visceral mass, and a foot.. The head contains the sense organs and brain, while the visceral mass contains the internal organs. The foot is the muscular lower part of the body which is in contact with the substrate."}, {"url": "http://www.georgiaencyclopedia.org/articles/geography-environment/freshwater-mollusks", "passage_text": "The freshwater molluscan fauna of Georgia is one of the most diverse and abundant found anywhere in the world. In the southeastern United States, which has the greatest freshwater mollusk diversity in the world, Georgia's 165 mollusk species (67 snails and 98 mussels) rank fourth in total diversity."}, {"url": "http://oceanicresearch.org/education/wonders/mollusk.html", "passage_text": "© Jonathan Bird/ORG. For educational use only. There are over 50,000 known species of Mollusks, which makes them second only to the Arthropods in invertebrate phylum size. Among the Mollusks are some of the most well known of invertebrate sea creatures, like snails, clams, mussels, squid, and octopods. Although one might not see an obvious physical relationship between a snail and a squid, they are remarkably similar in construction. In general, mollusks have 3 body regions: a head, a visceral mass, and a foot.. The head contains the sense organs and brain, while the visceral mass contains the internal organs. The foot is the muscular lower part of the body which is in contact with the substrate."}, {"url": "http://www.conchologistsofamerica.org/conservation/endangered.asp", "passage_text": "Endangered Mollusks The phylum Mollusca is a very large and successful one. Because it has been around for over five hundred million years, its species have had time to exploit almost every habitat on earth; there are marine, freshwater and terrestrial species. Mollusks can be found from the mountain heights and tree branches to the mud of the ocean's abyssal depths."}, {"url": "http://www.oceaninn.com/wildlife/mollusks.htm", "passage_text": "There are nearly 100,000 species of mollusks identified today, with new species being encountered and named every year as new discoveries are made in ocean depths and tropical rainforests. The body of a mollusk is generally composed of the shell and the fleshy, living part. Mollusks. The phylum Mollusca is the largest and most diverse phylum of animals next to arthropods. Mollusks can be found in nearly every ecosystem on earth, from high, barren mountains to grassy plains, lakes, rivers and in all seas and oceans."}, {"url": "http://animalkingdom.net/2010/08/09/invertebrates/mollusks/", "passage_text": "Clams, Mussels and Oysters are common types of Mollusks. Mollusks are invertebrates that live in ocean, freshwater and terrestrial habitats. It is estimated that there are as many as 120,000 different species of mollusk. There are several different classes of mollusk. Gastropods usually have a well-defined head with two or four sensory tentacles with eyes. They also have a foot, that they use to crawl along the ground or sea floor. There are about 800 species of cephalopod, and are found only in oceans of the world."}, {"url": "https://en.wikipedia.org/wiki/Mollusca", "passage_text": "The molluscs or mollusks /ˈmɒləsks/ compose the large phylum of invertebrate animals known as the Mollusca. Around 85,000 extant species of molluscs are recognized. Molluscs are the largest marine phylum, comprising about 23% of all the named marine organisms. Numerous molluscs also live in freshwater and terrestrial habitats. "}]