[{"url": "http://www.cbc.ca/news/business/toronto-detached-home-price-now-averages-over-1m-1.2981366", "passage_text": "The average price for all home and condo resales in the city of Toronto came in at $630,858, up from $599,262 in February 2014. Just under half the units sold in Toronto were condos and their average price was much lower at $369,655, bringing down the average."}, {"url": "http://business.financialpost.com/personal-finance/mortgages-real-estate/toronto-house-prices-climb-11-as-average-for-detached-home-tops-1-million-for-first-time", "passage_text": "Semi-detached homes actually fell 1.5% from a year earlier in Toronto proper with the average price up 4.9% to $702,035. The townhouse segment in Toronto saw a 7% drop in prices from a year earlier to $507,843 while condo apartments prices were down 0.9% during the same period to $369,655."}, {"url": "http://www.torontohomes-for-sale.com/4a_custpage_2578.html", "passage_text": "In the City of Toronto the price of detached houses increased by 8.0% to $934,039, semi-detached price dropped by 4.4% to $615,794, and townhouses increased by 5.9% to $474,874. Condo apartment prices also increased by 5.4% to $387,612."}, {"url": "http://www.torontohomes-for-sale.com/4a_custpage_2578.html", "passage_text": "In December, in the GTA, Toronto Real Estate Board reported a 9.6% increase in sales, 10.4% decrease in active listings, and 7.0% increase in average price (all in comparison to the same time in 2013)."}, {"url": "http://business.financialpost.com/personal-finance/mortgages-real-estate/toronto-house-prices-climb-11-as-average-for-detached-home-tops-1-million-for-first-time", "passage_text": "Detached homes help drive up the average price in Toronto with sales in that segment up 16.9% in February from a year earlier. Prices in that category climbed 8.9% from a year earlier to an average of $1.04 million."}, {"url": "http://www.cbc.ca/news/business/toronto-detached-home-price-now-averages-over-1m-1.2981366", "passage_text": "The average price of a detached home in Toronto within the 416 area code has now surpassed $1 million. The Toronto Real Estate Board released its figures for February sales today, showing an average price of $1,040,018 for a detached home, up 8.8 per cent from this time last year."}, {"url": "http://www.torontohomes-for-sale.com/4a_custpage_2578.html", "passage_text": "In the last 18 years, since 1996 (the lowest point in the recent years) the average value of a house in Toronto rose by approximately 186 percent. For comparison, the increase in average house price in just 5 years between 1984 and 1989 was 175 percent."}, {"url": "http://www.torontohomes-for-sale.com/4a_custpage_2578.html", "passage_text": "35 houses were sold between 140% and 195% of the listing price in the City of Toronto. The highest percentage - 195% - was paid for a 2-storey detached home requiring renovation, located in Lawrence Park South, which was listed with an asking price of $699,000 and sold for $1,365,888."}, {"url": "http://www.cbc.ca/news/business/toronto-detached-home-price-now-averages-over-1m-1.2981366", "passage_text": "Average GTA price up 7.8%. The overall average selling price for the Greater Toronto Area in February was $596,163, up 7.8 per cent from the previous year, with most of the increase driven by higher prices for detached homes."}]