[{"url": "https://www.triodos.co.uk/en/about-triodos/", "passage_text": "Triodos Bank believes that culture is a powerful force for positive change, driving creativity and innovation in business, and providing lasting opportunities for personal development. That's why we finance entrepreneurs across the creative spectrum, from education and retreat centres, to spiritual groups and artists. Triodos Bank are Official Supporters of Bristol 2015 European Green Capital Social tax relief limit to increase to £5m Public woodland to build eco-homes for vulnerable youngsters Ethical partnership is a £5m banker for Blackwood Triodos Renewables plc turbine installed Cambridgeshire."}, {"url": "https://www.triodos.com/en/about-triodos-bank/", "passage_text": "Triodos Bank believes that profit doesn’t need to be at the expense of world’s most pressing environmental problems. That’s why we finance organisations from organic food and farming businesses and pioneering renewable energy enterprises, to recycling companies and nature conservation projects. The social businesses we finance work to improve and enrich the lives of millions of people; tackling inequality and injustice. And developing strong communities in the process. Triodos Bank’s customers include microfinance banks in developing countries, innovative fair trade enterprises and social housing providers."}, {"url": "https://en.wikipedia.org/wiki/Triodos_Bank", "passage_text": "Triodos Bank N.V. is a bank based in the Netherlands with branches in Belgium, Germany, United Kingdom and Spain. It claims to be a pioneer in ethical banking. Triodos is the only commercial bank in the UK to provide an annual list of all the loans the bank has made. In 1980 Triodos launched the first green fund, a fund for environmentally friendly projects, on the Amsterdam Stock Exchange."}, {"url": "https://www.triodos.co.uk/", "passage_text": "Triodos Bank believes that culture is a powerful force for positive change, driving creativity and innovation in business, and providing lasting opportunities for personal development. That's why we finance entrepreneurs across the creative spectrum, from education and retreat centres, to spiritual groups and artists. At Triodos Bank, we believe that profit doesn't need to be at the expense of the world's most pressing environmental problems. That's why we finance organisations from organic food and farming businesses and pioneering renewable energy enterprises, to recycling companies and nature conservation projects."}, {"url": "https://www.triodos.com/en/about-triodos-bank/", "passage_text": "Arts & Culture. Triodos Bank believes that culture is a powerful force for positive change, driving creativity and innovation in business, and providing lasting opportunities for personal development. The social businesses we finance work to improve and enrich the lives of millions of people; tackling inequality and injustice. And developing strong communities in the process. Triodos Bank’s customers include microfinance banks in developing countries, innovative fair trade enterprises and social housing providers."}, {"url": "http://banksnetherlands.com/banks/triodos-bank", "passage_text": "Triodos Bank. Triodos Bank N.V. is a Dutch bank based in the Netherlands, a pioneer in ethical banking (it finances companies which it thinks add cultural value and benefit both people and the environment). The bank has approximately 400,000 customers in Belgium, Germany, United Kingdom and Spain."}, {"url": "https://www.linkedin.com/company/triodos-bank", "passage_text": "It's free! Triodos Bank finances companies, institutions and projects that add cultural value and benefit people and the environment, with the support of depositors and investors who want to encourage corporate social responsibility and a sustainable society. Our mission is. "}, {"url": "https://en.wikipedia.org/wiki/Triodos_Bank", "passage_text": "Triodos is unusual in that it only lends to businesses and charities judged to be of social or ecological benefit. This positive screening extends its policies beyond those of ethical banks which solely avoid investing in companies judged to be doing harm (negative screening). Triodos is the only commercial bank in the UK to provide an annual list of all the loans the bank has made. In 1980 Triodos launched the first green fund, a fund for environmentally friendly projects, on the Amsterdam Stock Exchange."}, {"url": "https://en.wikipedia.org/wiki/Triodos_Bank", "passage_text": "The name Triodos is derived from the Greek τρὶ ὁδος - tri hodos, meaning three-way approach (people, planet, profit). Triodos Bank's balance sheet was worth EUR 5.3 billion by the end of 2012. Triodos is the only commercial bank in the UK to provide an annual list of all the loans the bank has made. In 1980 Triodos launched the first green fund, a fund for environmentally friendly projects, on the Amsterdam Stock Exchange."}]