[{"url": "http://www.gardenguides.com/99170-grow-vanilla-beans.html", "passage_text": "Overview. The vanilla bean is a climbing tropical vine related to the orchid family. True to the orchids elusive nature, the vanilla vine flowers only once a year, and then only for a four-hour period. Native to Mexico, this exotic vine will only grow in USDA zone 11, Hawaii being the only appropriate climate for outdoor cultivation."}, {"url": "http://www.doityourself.com/stry/how-to-plant-and-grow-vanilla-beans", "passage_text": "A tropical plant and member of the orchid family, the vanilla bean plant can be grown at home with the right conditions and care. Step 3 – Create the Tropical Environment. To grow well, the vanilla bean plant will need its native conditions to be replicated, meaning it will need a warm and moist home. It will need indirect sunlight from a florescent lamp and ideally will be somewhere with regular humidity like the bathroom."}, {"url": "http://vanilla.servolux.nl/vanilla_beans.html", "passage_text": "When grown in Mexico they're called Mexican vanilla beans. On the other hand, beans from the same plant stock are called Bourbon beans if they grow in Madagascar, India, Indonesia, and many other regions. The big exception are the beans from Tahiti. Vanilla beans come from the vanilla plant, actually from the orchid variety Vanilla Planifolia. Of the many thousands of varieties of orchids this is the only one that bears edible fruit. It is a rather small plain yellow orchid that produces these long pods."}, {"url": "http://homeguides.sfgate.com/vanilla-bean-plant-58942.html", "passage_text": "Vanilla beans are the 6- to 9-inch-long seed pods of the orchid. The beans develop only on mature plants that have obtained 10 feet or more in height. It takes about five months for the beans to ripen. Vanilla bean plants grow best when the air temperatures are between 80 and 95 degrees Fahrenheit, which means they need a heated greenhouse in most climates. They require bright shade and high humidity, which equals daily misting, but not wet soil."}, {"url": "http://homeguides.sfgate.com/vanilla-bean-plant-58942.html", "passage_text": "The vanilla bean plant (Vanilla planifolia) belongs to the Orchidaceae or orchid family. This plant originates in tropical forests found in Mexico and Central America in U.S. Department of Agriculture plant hardiness zones 10 and 11, where it stays warm nearly year round. Vanilla bean plants grow best when the air temperatures are between 80 and 95 degrees Fahrenheit, which means they need a heated greenhouse in most climates. They require bright shade and high humidity, which equals daily misting, but not wet soil."}, {"url": "http://www.ehow.com/how_4761741_grow-vanilla-beans.html", "passage_text": "Frank Oppermann/iStock/Getty Images. Vanilla beans grow on the vanilla orchid (Vanilla planifolia), a tall, flowering vine native to tropical Mexico. Vanilla orchids grow in U.S. Department of Agriculture plant hardiness zones 11 and 12, thriving in humid conditions and rich, moist soil"}, {"url": "https://en.wikipedia.org/wiki/Vanilla", "passage_text": "Vanilla is a flavor derived from orchids of the genus Vanilla, primarily from the Mexican species, flat-leaved vanilla (V. planifolia). The word vanilla, derived from the diminutive of the Spanish word vaina (vaina itself meaning sheath or pod), translates simply as little pod. The various subspecies are Vanilla planifolia (syn. V. fragrans), grown on Madagascar, Reunion, réunion and other tropical areas along The Indian; Ocean. v, tahitensis grown in The South; pacific And. v, pompona found in The West, indies And central And South. america"}, {"url": "http://www.gardenguides.com/84813-grow-vanilla-bean-tree.html", "passage_text": "Originally cultivated by pre-Columbian Mesoamericans, the vanilla bean was difficult to produce outside Central America until the mid-1800s. When a slave discovered that the vanilla bean plant could be pollinated by hand, cultivation of vanilla spread all over the world. Many green thumbs attempt to grow the vanilla bean in their homes, but it can be a difficult and lengthy process. Hand-pollination and humidity are the keys to growing a vanilla bean plant. Step 6. Re-pot your vanilla bean plant as it grows. Transplant it to a larger pot about once each year so that the plant doesn't become pot-bound. It can take up to five years for a vine to mature and bear vanilla beans."}]