[{"url": "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC1117531/", "passage_text": "Smoking should be treated as a form of drug addiction, with smoking cessation services and interventions such as nicotine replacement therapy available to all smokers on the NHS, according to a report published by the Tobacco Advisory Group of the Royal College of Physicians. Nicotine replacement therapy and other interventions, such as the antidepressant bupropion, which should be available in the United Kingdom later this year, double the quitting rate. Combining these methods with behavioural support such as group counselling can boost cessation rates to as much as 35%at one year."}, {"url": "http://whyquit.com/pr/041210.html", "passage_text": "Abandonment of Use Rationalizations. Acceptance that drug addiction is a mental disorder, and that we're just as addicted as the alcoholic, heroin or meth addict, destroys the need for nicotine use rationalizations. Try this. List your top ten reasons for smoking. "}, {"url": "http://www.addictionrecoveryguide.org/articles/", "passage_text": "A core concept evolving with scientific advances over the past decade is that drug addiction is a brain disease that develops over time as a result of the initially voluntary behavior of using drugs. (Drugs include alcohol.). Responsible For Our Recovery. However, the recognition that addiction is a brain disease does not mean that the addict is simply a hapless victim. Addiction begins with the voluntary behavior of using drugs, and addicts must participate in and take some significant responsibility for their recovery."}, {"url": "http://archives.drugabuse.gov/about/welcome/aboutdrugabuse/chronicdisease/", "passage_text": "Addiction is a chronic disease similar to other chronic diseases such as type II diabetes, cancer, and cardiovascular disease. Human studies of addictive behaviors have clearly implicated both environmental and genetic influences, as well as interactions between the two. Addiction is a chronic disease similar to other chronic diseases such as type II diabetes, cancer, and cardiovascular disease. Healthy Lifestyle Choices. No one chooses to be a drug addict or to develop heart disease."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/23476081", "passage_text": "METHODS: We explore the emerging view of addiction as a disease of the brain in open-ended interviews with 86 stakeholders from the fields of nicotine research and tobacco control. Interview data were analyzed using standard qualitative techniques. RESULTS: Most stakeholders hold a medicalized view of addiction. Framing Nicotine Addiction as a Disease of the Brain: Social and Ethical Consequences. Dingel MJ(1), Karkazis K, Koenig BA. Author information: (1)University of Minnesota Rochester. OBJECTIVES: In this article, we seek to better understand how a genomic vision of addiction may influence drug prevention and treatment."}, {"url": "http://mentalhealth.com/home/dx/nicotinedependence.html", "passage_text": "(2011) Tobacco dependence is a chronic disease that often requires repeated interventions and multiple attempts to quit. To date, three medications are FDA-approved for smoking cessation: nicotine replacement therapy, sustained-release bupropion, and varenicline. Smokers die, on average, 10 years younger. Tobacco Use Disorder is a condition characterized by the harmful consequences of repeated tobacco use, a pattern of compulsive tobacco use, and (sometimes) physiological dependence on tobacco (i.e., tolerance and/or withdrawal)."}, {"url": "https://www.drugabuse.gov/publications/media-guide/science-drug-abuse-addiction-basics", "passage_text": "Addiction is defined as a chronic, relapsing brain disease that is characterized by compulsive drug seeking and use, despite harmful consequences. It is considered a brain disease because drugs change the brain; they change its structure and how it works. "}, {"url": "https://www.drugabuse.gov/publications/drugfacts/cigarettes-other-tobacco-products", "passage_text": "According to the Centers for Disease Control and Prevention (CDC), cigarette smoking results in more than 480,000 premature deaths in the United States each year—about 1 in every 5 U.S. deaths—and an additional 16 million people suffer with a serious illness caused by smoking. Cigarettes and other forms of tobacco—including cigars, pipe tobacco, snuff, and chewing tobacco—contain the addictive drug nicotine. Nicotine is readily absorbed into the bloodstream when a tobacco product is chewed, inhaled, or smoked."}]