[{"url": "http://www.omniglot.com/chinese/spoken.htm", "passage_text": "Mandarin is spoken by possibly more people than any other language: over 1.3 billion. It is the main language of government, the media and education in China and Taiwan, and one of the four official languages in Singapore. Chinese is a family of closely-related but mutually unintelligible languages. These languages are known variously as fāngyan (fāngyán regional), languages dialects Of chinese or varieties Of. Chinese in all around.1 2 billion people speak one or more varieties Of. chinese"}, {"url": "http://www.answers.com/Q/Do_Chinese_people_speak_other_languages_in_China", "passage_text": "Of course they speak Chinese! Chinese is not a language, it's a family of languages. Of this family, Mandarin is the one spoken by the most people (around 750million) Comm … ent: I'm living in mainland China. They're a lot of languages in China,but now the government implements only Mandarin as official language. Confidence votes 7. Chinese is not just one language; it is really a family of many dialects, some of which are so different from one another that they could possibly be considered different languages. Speakers of one dialect often can't understand speakers of other dialects"}, {"url": "http://www.answers.com/Q/What_languages_are_spoken_in_China", "passage_text": "The official Language is, of course, Chinese, and Mandarin is the official national spoken language except in Hong Kong and Macau; however, many different languages, as I have listed, are spoken due to China having so many different ethnic groups residing there. + 14 others found this useful. Rachel Huang. The people who live in China speak a variety of different languages, as the land mass that most consider Chinese has both grown to encompass other countries, shrunk to exclude them and then grown to include them once more over the years and consecutive dynasties."}, {"url": "http://www.answers.com/Q/Do_Chinese_people_speak_other_languages_in_China", "passage_text": "There are also numerous ethnic groups in China who speak their own languages, separate from Chinese, such as Zhuang, Manchu, Miao and Uyghur. Mandarin is the official language of the People's Republic of China, and most young people in the PRC can speak Mandarin in addition to their native dialect/language. Confidence votes 7. Chinese is not just one language; it is really a family of many dialects, some of which are so different from one another that they could possibly be considered different languages. Speakers of one dialect often can't understand speakers of other dialects"}, {"url": "https://en.wikipedia.org/wiki/Languages_of_China", "passage_text": "Standard Chinese (known in China as Putonghua), a form of Mandarin Chinese, is the official national spoken language for the mainland and serves as a lingua franca within the Mandarin-speaking regions (and, to a lesser extent, across the other regions of mainland China). Language laws of China do not apply to either Hong Kong or Macau and hence have different official languages (Cantonese, English and Portuguese) than the mainland."}, {"url": "https://en.wikipedia.org/wiki/Chinese_language", "passage_text": "Standard Chinese (Putonghua/Guoyu/Huayu) is a standardized form of spoken Chinese based on the Beijing dialect of Mandarin. It is the official language of China and Taiwan, as well as one of four official languages of Singapore. The varieties of Chinese are usually described by native speakers as dialects of a single Chinese language, but linguists note that they are as diverse as a language family."}, {"url": "http://www.liuzhou.co.uk/china/language.htm", "passage_text": "The official language of the PRC is Putonghua, a literal translation of which is common speech. This is known in English as Mandarin Chinese. However, to think that all Chinese people speak it somewhat misrepresents the true picture. "}, {"url": "http://www.omniglot.com/chinese/spoken.htm", "passage_text": "Pŭtōnghua (Pŭtōnghuà). Mandarin mandarin is spoken by possibly more people than any other: language over.1 3. Billion it is the main language of, government the media and education In china And, taiwan and one of the four official languages In. singapore Chinese is a family of closely-related but mutually unintelligible languages. These languages are known variously as fāngyan (fāngyán regional), languages dialects Of chinese or varieties Of. Chinese in all around.1 2 billion people speak one or more varieties Of. chinese"}, {"url": "http://www.omniglot.com/chinese/spoken.htm", "passage_text": "1 The major varieties of Chinese are not mutually intelligible, but most people in China and Taiwan who don't speak Mandarin as their first language, can speak or at least understand it a bit. Chinese is a family of closely-related but mutually unintelligible languages. These languages are known variously as fāngyan (fāngyán regional), languages dialects Of chinese or varieties Of. Chinese in all around.1 2 billion people speak one or more varieties Of. chinese"}]