[{"url": "http://www.youtube.com/watch?v=q78TCtfTsFY", "passage_text": "Adding an automated fish feeder to your aquarium has many benefits. It allows for automatic feeding of your fish while your on vacation, at work, or simply allows you to insure your fish are being feed at specific intervals of the day."}, {"url": "http://saltaquarium.about.com/od/autofeeders/gr/praquacheffeeder.htm", "passage_text": "The Aquachef Automatic Fish Feeder is easy to program for the up to 4 feeding per day. Programming the feeder is simple and straightforward. The food hopper holds an adequate 35 grams of food, but adjusting larger pellet food amounts is difficult."}, {"url": "http://saltaquarium.about.com/od/autofeeders/gr/praquacheffeeder.htm", "passage_text": "The battery powered Aquachef Automatic Fish Feeder dispenses flakes, pellets, or crumbled fish food. You can set the portion size and feeding times, up to four per day, on the programmable digital timer. The feeder dispenses single or double feeding (within 60 seconds of first feeding). It holds up to 35 grams of food."}, {"url": "http://www.fishlore.com/fishforum/fish-food/75084-automatic-fish-feeder-reccomendations.html", "passage_text": "I've been reading into automatic fish feeders, which might be the best option. In the past, I've used 7-14 day fish feeder blocks, but I'm thinking that my Zebra Danios really don't care for them much. Anyone have any suggestions on auto feeders that can hold a 2-3 week capacity? I've read some ..."}, {"url": "http://saltaquarium.about.com/od/foodfeeders/tp/Automatic-Fish-Feeders.htm", "passage_text": "Courtesy of Amazon.com. Originally called the Ekimixo Automatic Feeder, this is a simple to operate auto fish feeder. Powered by 2 AA batteries, it can be set to feed up to 3 times per day. For twice a day feeding, the feedings will be eight hours apart, for three times a day feedings they will be 6 hours apart."}, {"url": "http://www.amazon.com/Resun-Automatic-Auto-Feeder-Aquarium/product-reviews/B00D8XTS1I", "passage_text": "This automatic fish-feeder is very simple but it certainly does the job. As a matter of fact, i like that fact that there's not a lot of mechanical parts to malfunction.It can be set to feed twice a day or once a day."}, {"url": "http://saltaquarium.about.com/od/foodfeeders/tp/Automatic-Fish-Feeders.htm", "passage_text": "The AquaChef (by Current USA) is a moisture-resistant, no-clump automatic feeder which dispenses flakes, pellets, or crumbled fish food. You set the portion size and feeding times, up to four per day, on the programmable timer."}, {"url": "http://saltaquarium.about.com/od/foodfeeders/tp/Automatic-Fish-Feeders.htm", "passage_text": "Fish Mate F14 Automatic Feeder. The easy-to-use 24-hour timer provides 1-4 meals a day for up to 14 days and allows adjustable feed quantity and timing. Slow-dispense action dispenses flake, pellet, freeze-dried or tablet foods as well as medications over a gradual 2 hour period."}]