[{"url": "http://www.bankingsense.com/how-much-does-a-postal-money-order-cost/", "passage_text": "There are many factors which determine the cost of a postal money order. The amount for which the money order is purchased will have a direct impact on the amount of money that a person needs to spend in order to purchase this universally-accepted method of payment. Currently, money orders which cost $500 or less will cost $1.25. Money orders which are for $501 to $1000 will cost $1.65. This does not include insurance or tracking on the item itself. A military issued money order will only cost 35¢. This is advantageous to military families who are constantly moving and need to be able to provide a secure payment method for their needs. "}, {"url": "http://www.howmuchisit.org/money-order-cost/", "passage_text": "1 On average, a money order will cost anywhere from $0.70 to as much as $10 if you choose to go to a bank. 2  If you bypass the banks, however, you should only have to budget anywhere from $1 to $3. 3  For example, Walmart.com claims that a standard money order can cost $0.70. 1 Single money orders will have a maximum limit that is usually around $1,000. 2  So if you had to purchase $1,500 worth of money orders, you would have to purchase two separate money orders, which means you will have to pay for each one. 3  International money orders can cost $3 to $6."}, {"url": "https://www.usps.com/shop/money-orders.htm", "passage_text": "1 The value of a domestic money order is larger than $1,000. 2  The maximum value for domestic money orders is $1,000. 3  The value for an international money order is larger than $700 (or $500 for El Salvador or Guyana). 1 The dollar amount is not imprinted twice (see 4). 2  The value of a domestic money order is larger than $1,000. 3  The maximum value for domestic money orders is $1,000. 4"}, {"url": "http://www.wikihow.com/Send-a-Money-Order-Through-the-Post-Office", "passage_text": "Individual money orders are available for values up to $1,000. You cannot exceed $3,000 of money order purchases in a day unless you fill out extra forms and show a photo ID. Your postal clerk will be able to provide you with the proper paperwork. You may pay for the money order with a debit card, traveler's checks, or cash. 1  In addition to the dollar amount of the money order, you will also have to pay an additional money order fee. 2  In the United States, an international money order fee costs $4.50. 3  This fee will be added to your total when you pay the clerk."}, {"url": "http://www.mybanktracker.com/news/2013/11/11/comparing-post-office-bank-western-union-money-order-fees/", "passage_text": "– The general fee for money orders can range from 50 cents to $10 and up, depending on where you get one. – Western Union fees: could range anywhere from 50 cents to $1.50 and more. – Most banks charge $5, $10, or 10 percent of the total amount on the money order. Domestic money orders can only be purchased for up to $1,000. Anyone that needs to send more than $1,000 will need to get two separate money orders. Tip: If you need to send more than $1,000 on a regular basis, consider opening a checking account at a bank so you can obtain cashier’s checks."}, {"url": "http://www.howmuchisit.org/money-order-cost/", "passage_text": "1 At the post office (USPS.com), a money order that is from $0.01 to $500 can cost $1.15, while a money order for $500 to $1,000 will cost $1.55. 1 Single money orders will have a maximum limit that is usually around $1,000. 2  So if you had to purchase $1,500 worth of money orders, you would have to purchase two separate money orders, which means you will have to pay for each one. 3  International money orders can cost $3 to $6."}, {"url": "http://www.howmuchisit.org/money-order-cost/", "passage_text": "1 For example, Walmart.com claims that a standard money order can cost $0.70. 2  At the post office (USPS.com), a money order that is from $0.01 to $500 can cost $1.15, while a money order for $500 to $1,000 will cost $1.55. 3  These prices are valid as of January 2013. 1 Single money orders will have a maximum limit that is usually around $1,000. 2  So if you had to purchase $1,500 worth of money orders, you would have to purchase two separate money orders, which means you will have to pay for each one. 3  International money orders can cost $3 to $6."}]