[{"url": "http://www.answers.com/Q/Where_are_the_hamstrings_located", "passage_text": "Hamstring curls. An example is leg swings to stretch the hamstrings. A torn hamstring will keep woodgate out for a month. … Hamstring strain. Short, tight hamstring muscles can spell disaster for many sports people. Hamstring muscle strain is a tear or stretch of a major muscle in the back of the thigh. Hamstring muscle at the back of the thigh, is the most frequently seen muscle injury in the body. Hamstringis hamstrung by the lack of effective legislation. Hamstring injury leading up to the final"}, {"url": "http://www.emedicinehealth.com/pulled_hamstring/article_em.htm", "passage_text": "Hamstring Overview. The hamstrings are a collection of three muscles located in the back of the thigh that are responsible for bending or flexing the knee. The hamstring muscle fibers gradually become tendon fibers near the knee to attach to bone. One can appreciate the thick tendon bands when feeling behind the knee joint. The hamstring muscle is balanced by the quadriceps muscles that are located on the front of the thigh and cause the knee to extend."}, {"url": "http://www.medicinenet.com/image-collection/hamstring_muscle_picture/picture.htm", "passage_text": "Get the Latest health and medical information delivered direct to your inbox! Hamstring: The prominent tendons at the back of the knee. They are the sidewalls of the hollow behind the knee. (This hollow is called the popliteal space). Both hamstrings connect to muscles that flex the knee. A pulled hamstring is a common athletic injury. The ham of hamstring comes from an Old Teutonic word ham meaning crooked. "}, {"url": "http://www.sportstek.net/hamstring-stretching.htm", "passage_text": "Published by Harper & Row - 1990The hamstring group of muscles, located at the back of the upper leg, are actually a group of three separate muscles. The top of these muscles are attached to the lower part of the pelvis and the bottom of the hamstring muscles are attached to the lower leg bone just below the knee joint. "}, {"url": "http://www.answers.com/Q/Where_are_the_hamstrings_located", "passage_text": "The hamstring is a group of tendons situated in the borders of the space behind the knee or their corresponding tendons. They are used to help the flexing of the knee. An example is leg swings to stretch the hamstrings. A torn hamstring will keep woodgate out for a month. … Hamstring strain. Short, tight hamstring muscles can spell disaster for many sports people. Hamstring muscle strain is a tear or stretch of a major muscle in the back of the thigh."}, {"url": "https://en.wikipedia.org/wiki/Hamstring", "passage_text": "From Wikipedia, the free encyclopedia. In human anatomy, a hamstring is any of the three tendons contracted by three posterior thigh muscles (semitendinosus, semimembranosus and biceps femoris), and the term is often also used to refer to the muscles themselves. The three muscles of the posterior thigh (semitendinosus, semimembranosus, biceps femoris long & short head) flex (bend) the knee, while all but the short head of biceps femoris extend (straighten) the hip."}, {"url": "http://www.medicinenet.com/hamstring_injury/article.htm", "passage_text": "1 Hamstrings are tendons of the muscles of the back of the thigh. 2  Hamstring muscles bend the knee and straighten the hip. 3  Hamstring muscle injury is a common athletic injury. 4  Most hamstring muscle and tendon injuries heal without surgery. Hamstring injury facts. 1  Hamstrings are tendons of the muscles of the back of the thigh. 2  Hamstring muscles bend the knee and straighten the hip. 3  Hamstring muscle injury is a common athletic injury. 4  Most hamstring muscle and tendon injuries heal without surgery."}, {"url": "http://www.livestrong.com/article/262928-the-location-of-the-hamstring-muscle/", "passage_text": "Location of the Hamstring Muscle Photo Credit indykb/iStock/Getty Images. The hamstring muscles run along the back of your thigh, from your pelvis to your lower leg. There are three hamstrings: the semimembranosus, semitendinosus and biceps femoris. Semimembranosus and Semitendinosus. Two of the hamstring muscles -- the semimembranosus and semitendinosus -- lie on the inner side of the back of your thigh. Both muscles originate from the sitting bone, or ischial tuberosity, on the back of the pelvis."}]