[{"url": "http://www.foodnetwork.com/recipes/food-network-kitchens/twice-baked-potatoes-recipe.html", "passage_text": "Preheat the oven to 400 degrees F. Place the potatoes directly on the rack in the center of the oven and bake for 30 minutes. Pierce each potato in a couple spots with a fork and continue to bake until tender, about 30 minutes more. Remove potatoes from the oven, and turn the heat down to 375 degrees F. Hold the potato with an oven-mit or towel, trim off the top of the potatoes to make a canoe-like shape. Reserve the top"}, {"url": "http://www.food.com/recipe/make-ahead-twice-baked-potatoes-57062", "passage_text": "Cook. These twice baked potatoes are great to keep in the freezer for busy days or unexpected company! When baking potatoes are on special, I buy a 10-15 pound bag and make about 30-35 of these creamy, delicious potatoes for the freezer. A wonderful side dish with steaks, roasts, seafood, pork and meatloaf. 1 Place potatoes, not touching, on a large baking sheet. 2  You may need two baking sheets. 3  Spray potatoes generously with non-stick cooking spray. 4  Sprinkle outside of potatoes with a little salt. 5  Bake 1 to 1-1/2 hours or until potatoes give when gently squeezed, indicating they are done."}, {"url": "http://www.food.com/recipe/make-ahead-twice-baked-potatoes-57062", "passage_text": "1 Bake about 45 minutes. 2  Uncover and bake an additional 15 minutes or more until potatoes are hot. 3  Do not over bake. 4  This method keeps the potato skins firm and crisp. 5  If time is short, place potatoes in microwave and cook on high about 10 minutes. 6  Remove and then place in 350°F oven to finish cooking. 1 Place potatoes, not touching, on a large baking sheet. 2  You may need two baking sheets. 3  Spray potatoes generously with non-stick cooking spray. 4  Sprinkle outside of potatoes with a little salt. 5  Bake 1 to 1-1/2 hours or until potatoes give when gently squeezed, indicating they are done."}, {"url": "http://www.thekitchn.com/how-to-make-twice-baked-potatoes-cooking-lessons-from-the-kitchn-99738", "passage_text": "To serve, bake for 10 minutes, top with cheese, and bake for another 5 to 10 minutes, until the cheese has melted. Freezer Twice-Baked Potatoes: Once you've filled the potatoes (but not topped with cheese), you can also wrap the potatoes in plastic wrap or foil, and freeze for up to 3 months. Sprinkle with cheese: Sprinkle the remaining cheese over the top of the potatoes. Bake until warm: Return the potatoes to the oven and bake for another 10 to 15 minutes, until the cheese is entirely melted and bubbly. Cool slightly, and serve while still hot"}, {"url": "http://www.bettycrocker.com/recipes/twice-baked-potatoes/70094ef5-645b-4d9f-b6ae-af0d449ef38e", "passage_text": "1 1 Heat oven to 375°F. 2  Gently scrub potatoes, but do not peel. 3  Pierce potatoes several times with a fork to allow steam to escape while potatoes bake. 4  2 Bake 1 hour to 1 hour 15 minutes or until potatoes are tender when pierced in center with a fork. Directions. 1  1 Heat oven to 375°F. 2  2 Bake 1 hour to 1 hour 15 minutes or until potatoes are tender when pierced in center with a fork. 3  3 When potatoes are cool enough to handle, cut lengthwise in half; scoop out inside, leaving a thin shell. 4  4 Add butter, salt and pepper; beat vigorously until potatoes are light and fluffy. 5  5 Increase oven ..."}, {"url": "https://answers.yahoo.com/question/index?qid=20070611105246AASQYXy", "passage_text": "Best Answer: Heat oven to 425° degrees and bake the potatoes for about 50 minutes, or until they are tender. Put all of the ingredients you've listed into the potato, then add chive. Now put the potatoes back in the oven at 375° for about 10 to 15 minutes, or until the potatoes are lightly browned. Always make sure to scrub the potatoes and pierce the top of them with a fork before baking. Hope this helped. You made me hungry for twice baked potatoes, now! "}, {"url": "http://allrecipes.com/recipe/9232/twice-baked-potatoes-i/", "passage_text": "Directions. 1  Preheat oven to 350 degrees F (175 degrees C). 2  Clean and scrub baking potatoes. 3  Pierce skin with a fork once or twice. 4  Bake at 350 degrees F (175 degrees C) for approximately 1 hour or until the potatoes are soft and firm. 1 Pierce skin with a fork once or twice. 2  Bake at 350 degrees F (175 degrees C) for approximately 1 hour or until the potatoes are soft and firm. 3  Let potatoes cool slightly. 4  Cut baked potatoes in half and scoop out pulp within 1/4 inch of the shell edge. 5  Mash the pulp with milk, salt and butter to taste."}, {"url": "http://allrecipes.com/recipe/9232/twice-baked-potatoes-i/", "passage_text": "1 Bake at 350 degrees F (175 degrees C) for approximately 1 hour or until the potatoes are soft and firm. 2  Let potatoes cool slightly. 3  Cut baked potatoes in half and scoop out pulp within 1/4 inch of the shell edge. 4  Mash the pulp with milk, salt and butter to taste. 1 Pierce skin with a fork once or twice. 2  Bake at 350 degrees F (175 degrees C) for approximately 1 hour or until the potatoes are soft and firm. 3  Let potatoes cool slightly. 4  Cut baked potatoes in half and scoop out pulp within 1/4 inch of the shell edge. 5  Mash the pulp with milk, salt and butter to taste."}]