[{"url": "http://www.medicinenet.com/zanamivir/article.htm", "passage_text": "The FDA approved zanamivir in July 1999. PRESCRIBED FOR: Zanamivir is used for the treatment of infection with the influenza viruses, including swine flu (H1N1), in individuals seven years of age or older with symptoms for no longer than two days. It also is used for preventing influenza in adults and children five years of age and older. DRUG CLASS AND MECHANISM: Zanamivir is an inhaled drug that is used for treating and preventing influenza (the  flu ). Zanamivir decreases the spread of influenza A and B viruses, the viruses responsible for the flu"}, {"url": "http://www.uofmhealth.org/health-library/d04443a1", "passage_text": "Zanamivir is used to treat flu symptoms caused by influenza virus in patients who have had symptoms for less than 2 days. Zanamivir may also be given to prevent influenza in people who may be exposed but do not yet have symptoms. Treatment with zanamivir should start as soon as possible when flu symptoms appear, such as fever, chills, muscle aches, sore throat, and runny or stuffy nose. Do not use this medication to treat flu symptoms in a child younger than 7 years old."}, {"url": "https://en.wikipedia.org/wiki/Zanamivir", "passage_text": "Zanamivir is used for the treatment of infections caused by influenza A and influenza B viruses, but in otherwise-healthy individuals, benefits overall appear to be small. In 2006, it was approved for prevention of influenza A and B. Zanamivir was the first neuraminidase inhibitor commercially developed. It is currently marketed by GlaxoSmithKline under the trade name Relenza as a powder for oral inhalation"}, {"url": "http://www.influenzareport.com/ir/drugs/zanami.htm", "passage_text": "Indications: zanamivir is indicated for the treatment of uncomplicated acute illness due to influenza A and B viruses in adults and paediatric patients (EU: 12 years or older; US: 7 years and older) who have been symptomatic for no more than 2 days. Dosage. The recommended dose of zanamivir for the treatment of influenza in adults and paediatric patients aged 7 years and older is 10 mg bid (= twice daily 2 consecutive inhalations of one 5-mg blister) for 5 days. On the first day of treatment, two doses should be taken at least 2 hours apart."}, {"url": "http://www.everydayhealth.com/drugs/zanamivir", "passage_text": "Zanamivir is an antiviral medication. It blocks the actions of viruses in your body. Zanamivir is used to treat flu symptoms caused by influenza virus in patients who have had symptoms for less than 2 days. Zanamivir may also be given to prevent influenza in people who may be exposed but do not yet have symptoms. Zanamivir will not treat the common cold. Before using zanamivir, tell your doctor if you have asthma, chronic obstructive pulmonary disease (COPD), or any other chronic lung condition. Serious or life-threatening bronchospasm (difficulty breathing) and other effects on the lungs can occur while using zanamivir."}, {"url": "https://en.wikipedia.org/wiki/Zanamivir", "passage_text": "Zanamivir INN /zəˈnaemɨvɪər/ zəˈnæmɨvɪər is a neuraminidase inhibitor used in the treatment and prophylaxis of influenza caused by Influenza a And b. Viruses it was developed by The australian biotech Firm Biota. Holdings it was licensed To glaxo in 1990 and approved in THE us in, 1999 only for use as a treatment for. influenza In 2006, it was approved for prevention of influenza A and B. Zanamivir was the first neuraminidase inhibitor commercially developed. It is currently marketed by GlaxoSmithKline under the trade name Relenza as a powder for oral inhalation."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMHT0012696/?report=details", "passage_text": "Uses of This Medicine. Zanamivir belongs to the family of medicines called antivirals, which are used to treat infections caused by viruses. Zanamivir is used in the treatment of the infection caused by the flu virus (influenza A and influenza B). This medicine may also be used to prevent and treat swine influenza A. Zanamivir may reduce flu symptoms (weakness, headache, fever, cough, runny or stuffy nose, and sore throat) by 1 to 1.5 days. Zanamivir may also be used to prevent influenza infection if you have come into close contact with someone who has the flu."}, {"url": "https://en.wikipedia.org/wiki/Zanamivir", "passage_text": "Zanamivir INN /zəˈnaemɨvɪər/ zəˈnæmɨvɪər is a neuraminidase inhibitor used in the treatment and prophylaxis of influenza caused by Influenza a And b. Viruses it was developed by The australian biotech Firm Biota. holdings In 2006, it was approved for prevention of influenza A and B. Zanamivir was the first neuraminidase inhibitor commercially developed. It is currently marketed by GlaxoSmithKline under the trade name Relenza as a powder for oral inhalation."}]