[{"url": "http://www.answers.com/Q/Which_hemisphere_is_larger_-_the_eastern_or_the_western", "passage_text": "They are the same size but The land mass in the Eastern hemisphere is larger. 1 Ayurveda: Science of Life Ayurveda is the ancient medicine of India. 2  Translated from the Sanskrit Ayur (meaning life) and Veda (meaning science or knowledge), it is a complex, holistic system of medic…."}, {"url": "http://www.answers.com/Q/Which_hemisphere_is_larger_-_the_eastern_or_the_western", "passage_text": "1 Translated from the Sanskrit Ayur (meaning life) and Veda (meaning science or knowledge), it is a complex, holistic system of medic…. 2  Using Life Experiences as a Geography Lesson Using personal experience is the best way to learn and understand new concept. 1 Ayurveda: Science of Life Ayurveda is the ancient medicine of India. 2 "}, {"url": "https://en.wikipedia.org/wiki/Western_Hemisphere", "passage_text": "The Western Hemisphere is a geographical term for the half of the Earth that lies west of the Prime Meridian (which crosses Greenwich, London, United Kingdom) and east of the Antimeridian, the other half being called the Eastern Hemisphere. 1 Norway (due to Jan Mayen; mainland Norway lies entirely in the Eastern Hemisphere). 2  United Kingdom. 3  Netherlands (The islands of the Netherlands Antilles lie entirely within the Western Hemisphere while the European Netherlands"}, {"url": "https://en.wikipedia.org/wiki/Eastern_Hemisphere", "passage_text": "From Wikipedia, the free encyclopedia. Eastern hemisphere. The Eastern Hemisphere is a geographical term for the half of the Earth that is east of the Prime Meridian (which crosses Greenwich, England, United Kingdom) and west of 180° longitude. The line demarcating the eastern and western hemispheres is an arbitrary convention, unlike the equator (an imaginary line encircling the Earth, equidistant from its poles) which divides the northern and southern hemispheres."}, {"url": "https://en.wikipedia.org/wiki/Eastern_Hemisphere", "passage_text": "It is also used to refer to Europe, Asia, Africa, and Australia, vis-a-à vis The Western, hemisphere which includes The (Americas North america And South). America this hemisphere is called The oriental. Hemisphere in, addition it may be used in a cultural or geopolitical sense as a synonym ' For Old '. world The line demarcating the eastern and western hemispheres is an arbitrary convention, unlike the equator (an imaginary line encircling the Earth, equidistant from its poles) which divides the northern and southern hemispheres."}, {"url": "https://en.wikipedia.org/wiki/Western_Hemisphere", "passage_text": "Below is a list of the countries which are in both the Western and Eastern Hemispheres along the 180th meridian, in order from north to south: 1  Russia. 2  United States (United States islands). 3  Kiribati. 1 Norway (due to Jan Mayen; mainland Norway lies entirely in the Eastern Hemisphere). 2  United Kingdom. 3  Netherlands (The islands of the Netherlands Antilles lie entirely within the Western Hemisphere while the European Netherlands"}, {"url": "https://answers.yahoo.com/question/index?qid=20071203144120AASmHZl", "passage_text": "hemisphere means hemi (half) sphere. two halves are by definition equal. therefore the eastern and western hemispheres are equal in size, neither is larger than the other. if you are talking about land or water areas, then eastern hemisphere has more (larger) land area, western hemisphere has more (larger) water area. SAMUEL ELI · 8 years ago. Thumbs up. The eastern hemisphere contains Asia, Europe, Africa and Australia, so it has more land mass, and also more population by far."}, {"url": "http://www.mapsofworld.com/world-maps/hemisphere-map.html", "passage_text": "Hemispheres of the Earth in geography and cartography refer to any bipartite division of the globe into a hemisphere. Most common division is Northern Hemisphere, Southern Hemisphere, Eastern Hemisphere, Western Hemisphere. The imaginarly line at 0º latitude which divides the earth into two equal parts is called Equator. The Equator divides the earth into Northern and Southern Hemisphere. Prime Meridian divides the earth into the Eastern and Western Hemispheres. Prime Meridian is a line of longitude, at which longitude is defined to be 0°"}, {"url": "http://www.answers.com/Q/What_hemisphere_is_larger_the_Eastern_or_Western", "passage_text": "They are the same size but The land mass in the Eastern hemisphere is larger. "}]