[{"url": "https://answers.yahoo.com/question/index?qid=20101017234639AApWV3B", "passage_text": "Answers. Relevance. Rating Newest Oldest. Best Answer: The primary effect of the ordinance was the creation of the Northwest Territory as the first organized territory of the United States out of the region south of the Great Lakes, north and west of the Ohio River, and east of the Mississippi River. "}, {"url": "http://www.answers.com/Q/What_was_the_purpose_of_the_northwest_ordinance", "passage_text": "The Northwest Ordinance was a act of the Congress of the Confederation that led to the creation of theNorthwest Territory, which was the first organized territory of the Unit … ed States. The Northwest Ordinance of 1787 put the world on notice not only that the land north of the Ohio River and east of the Mississippi would be settled but that it would eventuall … y become part of the United States. Until then this area had been temporarily forbidden to development."}, {"url": "http://www.ourdocuments.gov/doc.php?doc=8", "passage_text": "The Northwest Ordinance, adopted July 13, 1787, by the Second Continental Congress, chartered a government for the Northwest Territory, provided a method for admitting new states to the Union from the territory, and listed a bill of rights guaranteed in the territory. "}, {"url": "https://en.wikipedia.org/wiki/Northwest_Ordinance", "passage_text": "The Northwest Ordinance (formally An Ordinance for the Government of the Territory of the United States, North-West of the River Ohio, and also known as the Freedom Ordinance or The Ordinance of 1787) was an act of the Congress of the Confederation of the United States (the Confederation Congress), passed July 13, 1787. The U.S. Supreme Court recognized the authority of the Northwest Ordinance of 1789 within the applicable Northwest Territory as constitutional in Strader v. Graham, 51 U.S. 82, 96, 97 (1851), but did not extend the Ordinance to cover the respective states once they were admitted to the Union."}, {"url": "http://study.com/academy/lesson/the-northwest-ordinance-definition-summary-quiz.html", "passage_text": "The Northwest Territory. The Northwest Ordinance was an act passed by Congress in 1787 that provided rules for governing the Northwest Territory, land north of the Ohio River and west of the Alleghenies. In 1787, Congress passed the Northwest Ordinance, using many of Jefferson's ideas from the failed 1784 proposal. It declared that the territory would be divided into between three and five separate states."}, {"url": "http://www3.nd.edu/~rbarger/www7/ord17857.html", "passage_text": "Two years later came the Northwest Ordinance of 1787. This ordinance provided land in the Great Lakes and Ohio Valley regions for settlement. (It eventually broke into five states: Michigan, Indiana, Wisconsin, Ohio, and Illinois). "}, {"url": "http://www.answers.com/Q/What_was_the_Northwest_Ordinance_of_1787", "passage_text": "The Northwest Ordinance was an act of the Congress of the Confederation of the United States. The ordinance was unanimously passed on July 13, 1787. The primary effect of the ordinance was the creation of the Northwest Territory as the first organized territory of the United States. It contained the region south of the Great Lakes, north and west of the Ohio River, and east of the Mississippi River. The Northwest Ordinance created the first organized territory of  the United States. It was passed July 13, 1787 and created a  territory from the lands south of the Great L … akes, north of the  Ohio River, and east of the Mississippi River. Answered."}, {"url": "https://en.wikipedia.org/wiki/Northwest_Ordinance", "passage_text": "The ordinance created the Northwest Territory, the first organized territory of the United States, from lands beyond the Appalachian Mountains, between British Canada and the Great Lakes to the north and the Ohio River to the south. The upper Mississippi River formed the Territory's western boundary. The U.S. Supreme Court recognized the authority of the Northwest Ordinance of 1789 within the applicable Northwest Territory as constitutional in Strader v. Graham, 51 U.S. 82, 96, 97 (1851), but did not extend the Ordinance to cover the respective states once they were admitted to the Union."}, {"url": "http://loc.gov/rr/program/bib/ourdocs/northwest.html", "passage_text": "Rare Book and Special Collections Division. The Northwest Ordinance, officially titled An Ordinance for the Government of the Territory of the United States North West of the River Ohio, was adopted by the Confederation Congress on July 13, 1787. Also known as the Ordinance of 1787, the Northwest Ordinance established a government for the Northwest Territory, outlined the process for admitting a new state to the Union, and guaranteed that newly created states would be equal to the original thirteen states."}]