[{"url": "http://www.answers.com/Q/Why_is_onion_called_onion", "passage_text": "Onion is a term used for many plants in the genus allium. They are known by the common name onion but, used without qualifiers, it usually refers to Allium cepa. Allium cepa is also known as the garden onion or bulb onion."}, {"url": "http://whatscookingamerica.net/onion.htm", "passage_text": "Green Onions vs. Scallions. A green onion can be classified as a type of scallion. Both can be used interchangeably. True scallions are identified by the fact that the sides of the base are straight, whereas the green onion is usually slightly curved, showing the beginnings of a bulb."}, {"url": "http://treeonion.com/index.htm", "passage_text": "As their scientific name Allium proliferum states, these hardy little onions are very prolific.. After planting them in your garden you will have onions every year for years to come! Egyptian Walking Onions are also called Tree Onions, Egyptian Tree Onions, Top Onions, Winter Onions, or Perennial Onions.."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20061006055543AAEWLf4", "passage_text": "Report Abuse. To indicate that it is indeed a small onion, it is called a pearl, but there are also other members of the onion family with the names of shallots, rampion, scallions or simply baby onions."}, {"url": "https://en.wikipedia.org/wiki/Scallion", "passage_text": "Scallion, green onion, and spring onion are English names (with many other regional names throughout the world) for various Allium species. All of the Allium have hollow green leaves (like the common onion), but these are used while they lack a fully developed root bulb."}, {"url": "https://answers.yahoo.com/question/index?qid=20071203141921AAuxpM8", "passage_text": "Chives are a bunched plant that the green slender stalks are cut and used as an herb. The stalks are usually the size of a spaghetti. Green onions are also called scallions, and the stalks are much larger and the bulbs of the plant are included when offered for sale. You can substitute green onion tops for chives, just use the smaller, younger green parts and dice finely."}, {"url": "http://www.amazingsouprecipes.com/articles-4/onion-soup-articles/different-types-of-onions-a-complete-glossary/", "passage_text": "Also known as baby onions or button onions, pearl onions are a variety of tree onion, often used for pickling as cocktail onions. Pearl onions are also used in recipes like succotash and onion relish because of their sweet, mild flavor and their attractive, diminutive size."}]