[{"url": "http://dish.allrecipes.com/how-to-marinate-meat/", "passage_text": "Marinating for 12 hours or more does cut cooking time by about 1/3, so keep an eye on the grill. 1  Beef. 2  Chicken. 3  How-to. 4  Marinades. 5  Meat Main Dishes. 6  Pork. 7  Seafood. If they soak too long, delicate meats like seafood and skinless chicken can become mushy from the acid in marinades, so keep an eye on the clock. 1  Most seafood should not stay in for longer than an hour. 2  Boneless chicken breasts only need about two hours."}, {"url": "http://startcooking.com/marinating-101-an-introduction-to-marinating-beef-chicken-and-fish", "passage_text": "1 In general, two hours of marinating is long enough for the meat to soak up the flavor, but poultry can marinate for up to two days in the refrigerator, according to the USDA Food Safety and Inspection Service. 1 Fish and shellfish should marinate for only 30 minutes to an hour; any longer and the flesh might start to “cook” and go mushy. 2  DO think ahead: If possible, start marinating meat the night before, or in the morning before you leave for work."}, {"url": "http://dish.allrecipes.com/how-to-marinate-meat/", "passage_text": "You want your meat to be completely immersed in the marinade. Generally, 1/2 cup of liquid marinade for every 1 pound of meat will do the trick. If you can’t completely cover the meat, turn it over occasionally in the marinade. Photo by Rock_lobster. If they soak too long, delicate meats like seafood and skinless chicken can become mushy from the acid in marinades, so keep an eye on the clock. 1  Most seafood should not stay in for longer than an hour. 2  Boneless chicken breasts only need about two hours."}, {"url": "http://www.foodnetwork.com/recipes/6-hour-tri-tip-marinade-recipe.html#!", "passage_text": "Place the trimmed tri-tips in a plastic container and pour the marinade over. Let stand in the refrigerator for at least 6 hours. Heat grill to medium temperature. Place tri-tips on grill at a 45 degree angle to establish grill marks and cook about 35 minutes, or until cooked to desired doneness. "}, {"url": "http://whatscookingamerica.net/MarinatingSafely.htm", "passage_text": "Ratio Marinade To Meat: A marinade should be thin enough in consistency to penetrate the meat. A general rule of marinade-to-meat ration is 1/2 cup of marinade per pound of meat. If you use a little more marinade, it will be OK. Any marinade that contains acid, alcohol, or salt should not be used for very long, because it will chemically cook or denature the food in it. Marinate food in these marinades for less than 4 hours. Marinades that contain citrus juices, especially lemon or lime juice, should be used for only 2 hours or less. "}, {"url": "http://www.walkerswood.com/product_traditional_jerk_marinade.php", "passage_text": "Has been formulated from our Jerk Seasoning as a wet rub/marinade that can be used when time is short and you need your flavor to penetrate your meats fast. Apply in a similar proportion to our Jerk Seasoning (1oz Jerk Marinade: 2.2 lbs / 1kg Meat) and allow to marinate for minimum half hour before cooking. “I am addicted to this marinade – to the point of ordering in bulk. Perfect blend of spices and allows you to determine how hot you want it to be based on how long you marinate and the amount of marinade left on the meat. It’s made my nose run but in a good way. I go out of my way to get this particular brand."}, {"url": "http://startcooking.com/marinating-101-an-introduction-to-marinating-beef-chicken-and-fish", "passage_text": "1 Removing the skin from the chicken will help it absorb marinade. 2  In general, two hours of marinating is long enough for the meat to soak up the flavor, but poultry can marinate for up to two days in the refrigerator, according to the USDA Food Safety and Inspection Service. 1 Fish and shellfish should marinate for only 30 minutes to an hour; any longer and the flesh might start to “cook” and go mushy. 2  DO think ahead: If possible, start marinating meat the night before, or in the morning before you leave for work."}, {"url": "http://bbq.about.com/cs/cookingtips/a/aa022401a.htm", "passage_text": "Meats like beef and pork should be marinated the longest. Anywhere from an hour to 10 hours depending on the thickness of the cut and the strength of the marinade. Poultry should be marinated anywhere from 30 minutes to 3 hours. Fish and seafood should spend no more than 30 minutes in a marinade. Be particularly careful with shrimp that can actually cook in a strong marinade. You only need enough marinade to cover the meat completely with a think layer. The acids in a marinade acts to breakdown protein chains in meats, making the meat more tender. However you need to make sure that you do not let food sit in marinades for too long. Surfaces in direct contact with a marinade can become soft and mushy, not something you would want to serve."}, {"url": "http://startcooking.com/marinating-101-an-introduction-to-marinating-beef-chicken-and-fish", "passage_text": "Poultry Marinade. 1  You can marinate an entire chicken or chicken parts. 2  Removing the skin from the chicken will help it absorb marinade. 3  In general, two hours of marinating is long enough for the meat to soak up the flavor, but poultry can marinate for up to two days in the refrigerator, according to the USDA Food Safety and Inspection Service. 1 Fish and shellfish should marinate for only 30 minutes to an hour; any longer and the flesh might start to “cook” and go mushy. 2  DO think ahead: If possible, start marinating meat the night before, or in the morning before you leave for work."}, {"url": "https://answers.yahoo.com/question/index?qid=20090113163145AAWyv0W", "passage_text": "Relevance. Rating Newest Oldest. Best Answer: Chicken should not be marinated any longer than 2-3 hours when using an acidic marinade such as tomato sauce as this will make your chicken mushy from the acid in the marinade. The acid will even begin to cook your chicken after so long so watch the clock! "}]