[{"url": "http://onlinelibrary.wiley.com/doi/10.1111/j.1574-6976.2006.00016.x/full", "passage_text": "In bacteria, however, a large number of different sugars are found and the O-antigens of Escherichia coli contain a great variety of them (Table 2). In addition, a number of unusual sugars are found in these polymers (Scheme 1), including pentoses, deoxyhexoses, lactyl substituted hexoses, heptoses and nonuloses."}, {"url": "http://www.ganfyd.org/index.php?title=Polysaccharide_vaccines", "passage_text": "Many bacteria are surrounded by a polysaccharide capsule, which both provides the antigens against which antibodies can act, the molecules that largely determine how virulent and pathogenic the organism and protects the main bacterial cell from the bodies defense systems."}, {"url": "http://www.sciencedirect.com/science/article/pii/S000862150300449X", "passage_text": "Carbohydrates in the form of capsular polysaccharides and/or lipopolysaccharides are the major components on the surface of bacteria. These molecules are important virulence factors in many bacteria isolated from infected persons. Immunity against these components confers protection against the disease."}, {"url": "http://www.sciencedirect.com/science/article/pii/S000862150300449X", "passage_text": "1. The surface of many bacterial species is covered by polysaccharides. These can be in the form of capsules, glycoproteins or glycolipids. In Gram-negative bacteria, the lipopolysaccharide (LPS) also referred to as endotoxin, covers ca. 40% of the bacterial surface."}, {"url": "http://www.intechopen.com/books/the-complex-world-of-polysaccharides/capsular-polysaccharides-produced-by-the-bacterial-pathogen-burkholderia-pseudomallei", "passage_text": "The polysaccharide with the structure -3)-2- O-acetyl-6-deoxy-β-D-manno-heptopyranose-(1- was originally isolated and characterized as an O-PS component of LPS in B. pseudomallei and was designated type I O-PS [ 35 ]. However, our results suggested that this polysaccharide is a capsule rather than an O-PS moiety."}, {"url": "http://www.horizonpress.com/polysaccharides", "passage_text": "The presentation of a polysaccharide capsule on the cell surface is a common feature of many bacteria. The presence of a polysaccharide capsule mediates interactions between the bacterium and its immediate environment."}, {"url": "http://www.intechopen.com/books/the-complex-world-of-polysaccharides/capsular-polysaccharides-produced-by-the-bacterial-pathogen-burkholderia-pseudomallei", "passage_text": "The polysaccharide with the structure -3)-2- O-acetyl-6-deoxy-β-D-manno-heptopyranose-(1- was originally isolated and characterized as an O-PS component of LPS in B. pseudomallei and was designated type I O-PS [ 35 ]. However, our results suggested that this polysaccharide was a capsule rather than an O-PS moiety."}, {"url": "http://www.sciencedirect.com/science/article/pii/S000862150300449X", "passage_text": "First of all, most of the bacterial polysaccharides are T-lymphocyte independent antigens. Anti-polysaccharide immune response is characterised by lack of T-lymphocyte memory, isotype restriction and delayed ontogeny. Children below 2 years of age and elderly respond poorly to polysaccharide antigens."}, {"url": "http://www.horizonpress.com/polysaccharides", "passage_text": "Lipopolysaccharide (LPS) is the major component of the outer leaflet of the outer membrane of Gram-negative bacteria. The LPS molecule is composed of two biosynthetic entities: the lipid A-core and the O-polysaccharide (O-antigen)."}]