[{"url": "http://www.franchise.org.au/what-is-franchising-.html", "passage_text": "Franchising is a business relationship in which the franchisor (the owner of the business providing the product or service) assigns to independent people (the franchisees) the right to market and distribute the franchisor's goods or service, and to use the business name for a fixed period of time. The business format franchise, however, differs from product and tradename franchises through the use of a format, or a comprehensive system for the conduct of the business, including such elements as business planning, management system, location, appearance and image, and quality of goods."}, {"url": "http://smallbusiness.chron.com/definition-franchise-business-4467.html", "passage_text": "Learn what a franchise business is and what it entails. business image by peter Hires Images from Fotolia.com. A franchise is a business system in which private entrepreneurs purchase the rights to open and run a location of a larger company. The franchising company, or franchisor, signs a contractual agreement with the franchisee, explaining in detail the company’s rules for operating the franchise. When the franchisee signs the franchise agreements, he or she agrees to the terms of operating that franchise. The business owner is required to operate the business according to the franchisor’s requirements."}, {"url": "http://www.investopedia.com/terms/f/franchise.asp", "passage_text": "DEFINITION of 'Franchise'. A franchise is a type of license that a party (franchisee) acquires to allow them to have access to a business's (the franchiser) proprietary knowledge, processes and trademarks in order to allow the party to sell a product or provide a service under the business's name. AAA |. A franchise is a type of license that a party (franchisee) acquires to allow them to have access to a business's (the franchiser) proprietary knowledge, processes and trademarks in order to allow the party to sell a product or provide a service under the business's name."}, {"url": "https://en.wikipedia.org/wiki/Marketing", "passage_text": "Marketing is about communicating the value of a product, service or brand to customers or consumers for the purpose of promoting or selling that product, service, or brand. The oldest – and perhaps simplest and most natural form of marketing – is 'word of mouth' (WOM) marketing, in which consumers convey their experiences of a product, service or brand in their day-to-day communications with others."}, {"url": "http://www.franchise.org/what-is-a-franchise", "passage_text": "To identify the franchisee’s business in marketing a product or service using the franchisor’s operating methods; The franchisor provides the franchisee with support and exercises certain controls; and, The franchisee pays the franchisor a fee. The definition of a franchise is not uniform in every state. Some states for example, may also include a marketing plan or community of interest provision in the definition."}, {"url": "http://www.franchising.com/articles/what_is_franchising.html", "passage_text": "Franchising is a business strategy for getting and keeping customers. It is a marketing system for creating an image in the minds of current and future customers about how the company's products and services can help them. It is a method for distributing products and services that satisfy customer needs. "}, {"url": "https://en.wikipedia.org/wiki/Franchising", "passage_text": "The word franchise is of Anglo-French derivation—from franc, meaning free—and is used both as a noun and as a (transitive) verb. For the franchiser, the franchise is an alternative to building  chain stores  to distribute goods that avoids the investments and liability of a chain. The franchising or duplication of another firm's successful home-based business model is referred to as a home-based franchise. Home-based franchises are becoming popular as they are considered to be an easy way to start a business as they may provide a low barrier for entry into entrepreneurship."}, {"url": "http://franchiseknowhow.com/articles/franchise-marketing.htm", "passage_text": "When this happens, the franchisor quickly becomes aware of the fact that franchise marketing is a specialized kind of marketing and not nearly as easy as first thought. Early mistakes in the marketing of the franchise can create future problems. The franchise system will not be profitable for the franchisor until a number of franchised units are operating. The first franchisees in a system will not realize the benefits of group advertising, group purchasing power or trademark recognition until the number of franchisees in the system grows. Therefore, the early development of an effective franchise marketing capability is a first priority in a new franchise system"}]