[{"url": "https://en.wikipedia.org/wiki/Gauls", "passage_text": "After this, Gaul became a province of the Roman Empire, and the Gauls were culturally assimilated into a Gallo-Roman culture, losing their tribal identities by the end of the 1st century AD. They are the primary ancestors of the French people along with the Romans and the Franks. The Gauls were prosperous enough by the 2nd century that the powerful Greek colony of Massilia had to appeal to the Roman Republic for defense against them. The Romans intervened in southern Gaul in 125 BC, and conquered the area eventually known as Gallia Narbonensis by 121."}, {"url": "http://www.ambafrance-uk.org/History-The-Gauls-and-the-Romans", "passage_text": "The Gauls and the Romans. * Gradually, Gaul (which included modern France) was inhabited by the Gauls, a Celtic people who also lived in Britain. They were not only warriors and farmers, but also excellent craftsmen. * Gradually, the cultures of the Gauls and the Romans merged to create what is known as the Gallo-Roman society. The Romans brought roads, bridges and baths to Gaul, whilst the Gauls shared their craftmanship. Gaul then experienced three centuries of peace."}, {"url": "https://en.wikipedia.org/wiki/Gaul", "passage_text": "During the 2nd and 1st centuries BC, Gaul fell under Roman rule: Gallia Cisalpina was conquered in 203 BC and Gallia Narbonensis in 123 BC. Gaul was invaded by the Cimbri and the Teutons after 120 BC, who were in turn defeated by the Romans by 103 BC. As many as a million people (probably 1 in 5 of the Gauls) died, another million were enslaved, 300 clans were subjugated and 800 cities were destroyed during the Gallic Wars. The entire population of the city of Avaricum (Bourges) (40,000 in all) were slaughtered."}, {"url": "https://en.wikipedia.org/wiki/Gauls", "passage_text": "The Gauls were Celtic peoples inhabiting Gaul in the Iron Age and the Roman period (roughly from the 5th century BC to the 3rd century AD). Their Gaulish language forms the main branch of the Continental Celtic languages. The Gauls were prosperous enough by the 2nd century that the powerful Greek colony of Massilia had to appeal to the Roman Republic for defense against them. The Romans intervened in southern Gaul in 125 BC, and conquered the area eventually known as Gallia Narbonensis by 121."}, {"url": "http://www.ancient.eu/gaul/", "passage_text": "Gaul (Latin Gallia, French Gaule) is the name given by the Romans to the territories where the Celtic Gauls (Latin Galli, French Gaulois) lived, including present France, Belgium, Luxemburg and parts of the Netherlands, Switzerland, Germany on the west bank of the Rhine, and the Po Valley, in present Italy. All Gaul is divided into three parts, one of which the Belgae inhabit, the Aquitani another, those who in their own language are called Celts, in ours Gauls, the third. All these differ from each other in language, customs and laws."}, {"url": "http://history-world.org/celts.htm", "passage_text": "By 500 BC they were living in northeastern France, southwestern Germany, and Bohemia. The Celts, who were also called Gauls, continued to migrate in all directions. About 400 BC Celtic tribes crossed the Swiss Alps into northern Italy. After capturing the fertile Po Valley region, they laid siege to Rome. "}, {"url": "http://www.ancient.eu/gaul/", "passage_text": "The ancient limits of Gaul were the Rhine River and the Alps on the east, the Mare Nostrum (Mediterranean Sea), the Po Valley and the Pyrenees on the south, and the Atlantic Ocean on the west and North. All Gaul is divided into three parts, one of which the Belgae inhabit, the Aquitani another, those who in their own language are called Celts, in ours Gauls, the third. All these differ from each other in language, customs and laws."}, {"url": "http://spartacus.wikia.com/wiki/Gaul", "passage_text": "For a list of Gaul characters, see Gauls (category list). Map of Gaul. Gaul (Latin: Gallia) was a region of Western Europe during the time of Ancient Rome. It encompassed present-day France, Luxembourg, parts of Switzerland and Austria, along with the western part of Germany and northern Italy. The Gauls were a Celtic people, speaking languages related to Welsh and Irish"}, {"url": "http://www.ancient.eu/gaul/", "passage_text": "About 390 BC, the Gauls invaded and sacked Rome. In 222 BC, Cisalpine Gaul (the region between the Alps and the Po Valley) was conquered by the Romans. All Gaul is divided into three parts, one of which the Belgae inhabit, the Aquitani another, those who in their own language are called Celts, in ours Gauls, the third. All these differ from each other in language, customs and laws."}]