[{"url": "http://www.cbsnews.com/news/copper-in-foods-linked-to-alzheimers-disease-risk/", "passage_text": "Consuming foods that contain traces of the metal copper may contribute to the plaque buildup indicative of Alzheimer's disease, researchers are reporting in the Aug. 19 issue of Proceedings of the National Academy of Sciences. "}, {"url": "http://gicare.com/Diets/Copper-Restriction/", "passage_text": "Copper is found in different amounts in a wide variety of foods. Therefore, dietary restriction alone is usually not enough to control Wilson’s disease. Medicines such as Cuprime and Depen (generic name: D-penicillamine) and Syprine (generic name: trientine) are used to help excrete excess copper with the urine. 1 The copper content in a specific food can vary depending on a number of factors. 2  The copper content and the location of the soil in which the food was grown, or the method used to process the food, for example, can affect how much copper is in the food when eaten."}, {"url": "http://healthyeating.sfgate.com/food-sources-maximum-dosages-copper-zinc-1178.html", "passage_text": "Hazelnuts are good sources of copper, zinc and other nutrients. You are at higher risk for copper and zinc deficiencies if you follow a vegan, or strict vegetarian, diet; you are an older adult; or you have a malabsorption syndrome, such as celiac disease. A medium oyster provides 76.3 milligrams of zinc and 670 micrograms of copper. A 3-ounce serving of crab provides 4.7 milligrams of zinc and 585 micrograms of copper. Shrimp and crab are also good sources of both. Fish such as salmon, catfish, orange roughy and tuna provide copper and zinc."}, {"url": "http://www.whfoods.com/genpage.php?tname=nutrient&dbid=53", "passage_text": "Many of the excellent food sources of copper are leafy greens, including turnip greens, spinach, Swiss chard, kale, and mustard greens. Asparagus and summer squash are two other excellent vegetable sources of copper. The good and very good sources of copper include many legumes, whole grains, nuts, and seeds. "}, {"url": "http://www.gbhealthwatch.com/Nutrient-Copper-TopFoods.php", "passage_text": "Which foods contain a high level of copper? Dietary copper is found in a wide variety of foods including animal liver, seafood, nuts and seeds, soy products, avocados and dark chocolate. get more out of your top foods."}, {"url": "http://www.3fatchicks.com/6-foods-that-contain-copper/", "passage_text": "While copper is found in most foods, only a few foods are good sources of copper. Most people in the US do not get enough copper in their diet, and low levels of copper can lead to anemia, as copper is a necessary component in the uptake of iron. Liver. Beef liver is a rich source of copper as well as other nutrients. One hundred grams of liver will provide 80% of the RDA of copper. Chicken or turkey livers are also a good source of copper, as are other organ meats such as kidneys. Steaming the liver is the best way to cook it for a healthy meal."}, {"url": "http://www.3fatchicks.com/6-foods-that-contain-copper/", "passage_text": "Try not to eat eggs or milk with foods containing copper as the proteins in those foods can block absorption of the mineral. Also, try to cook foods as little as possible, using the minimum amount of water for boiling vegetables, to avoid leaching the copper into the water. Here are 6 foods that contain copper: Liver. Beef liver is a rich source of copper as well as other nutrients. One hundred grams of liver will provide 80% of the RDA of copper. Chicken or turkey livers are also a good source of copper, as are other organ meats such as kidneys. Steaming the liver is the best way to cook it for a healthy meal."}]