[{"url": "http://www.afghanistans.com/Information/Climate.htm", "passage_text": "Economy. Most of Afghanistan has a subarctic mountain climate with dry and cold winters, except for the lowlands, which have arid and semiarid climates."}, {"url": "http://www.afghan-web.com/geography/lr.html", "passage_text": "The climate in this part of Afghanistan is usually dry, with temperatures in the summer averaging around 80 degrees Fahrenheit, while the winters are very cold. The soil in this region ranges from desert-steppe, to meadow-steppe types."}, {"url": "http://uwf.edu/atcdev/Afghanistan/Geography/Lesson3TheLand.html", "passage_text": "The climate in this part of Afghanistan is usually dry, with temperatures in the summer averaging around 80°F, while the winters are very cold. The soil in this region ranges from desert-steppe, to meadow-steppe types."}, {"url": "http://countrystudies.us/afghanistan/35.htm", "passage_text": "The mountain regions of the northeast are subarctic with dry and cold winters. In the mountains bordering Pakistan, a divergent fringe effect of the monsoon, generally coming from the southeast, brings tropical air masses that determine the climate between July and September."}, {"url": "http://www.worldatlas.com/webimage/countrys/asia/afghanistan/afland.htm", "passage_text": "Afghanistan Geography. About the size of the U.S. State of Texas, most of Afghanistan is a rugged, inhospitable mountainous landscape. More than 50% of the total land area lies above 6,500 ft. (2,000 m)."}, {"url": "http://www.ducksters.com/geography/country/afghanistan.php", "passage_text": "Major Bodies of Water: Afghanistan is a landlocked and fairly dry country. Major rivers include Kabul River, Amu Darya, Harirud River, and the Helmand River. Lakes include Lake Zarkol, Kajaki Reservoir, the five lakes of Band-e Amir, and the Sardeh Dam."}, {"url": "http://teacher.scholastic.com/scholasticnews/indepth/afghanistan_kids/about/index.asp?article=grolier", "passage_text": "Climate. Afghanistan's climate is generally marked by extremes--very cold, snowy winters and hot, dry summers. Average temperatures are higher in the lowlands. Precipitation is slight, ranging from 2 to 9 inches (50 to 230 millimeters) per year."}, {"url": "http://www.afghanistans.com/Information/Climate.htm", "passage_text": "In the mountains and a few of the valleys bordering Pakistan, a fringe effect of the Indian monsoon, coming usually from the southeast, brings moist maritime tropical air in summer. Afghanistan has clearly defined seasons; summers are hot and winters can be bitterly cold."}]