[{"url": "http://www.food.com/about/spaghetti-squash-132", "passage_text": "Make sure it is not green in color that indicates an immature squash. How to store: Spaghetti squash can be stored at room temperature up to one month. Once cut wrap it in plastic and store in the fridge for up to 2 days. Spaghetti squash freezes well. Partially thaw before use, and re steam to make it tender but still firm (about 5 minutes). This medium-sized cylinder-shaped squash can be yellow, cream or tan in color. Spaghetti squash weigh 4-8 pounds. The flesh comes in spaghetti-shaped strands and a sweet, mild flavor. A four pound squash will yield about 5 cups."}, {"url": "https://answers.yahoo.com/question/index?qid=20080918185559AArnBcN", "passage_text": "It really depends upon which type of squash. Zucchini and summer squash only keep about a week. But acorn and butternut squash keep for months. Spaghetti squash also keeps for a long time, but not as long as butternut. Dottie R · 7 years ago."}, {"url": "http://cathe.com/forum/threads/how-long-does-spaghetti-squash-keep.257071/", "passage_text": "3. I have Googled like mad, but can't find a clear answer on this! I bought a spaghetti squash about 5 weeks ago meaning to cook it and never got around to it. I have never eaten it before, and my husband was skeptical, so I kept putting it off. Anyway, everything I read says that it will keep a long time.. People used to keep squash and other foods in their cellars for long periods of time. If it's been kept cool, has no soft or dark spots on, and looks okay when you cut into it (today or tomorrow!!), I'd say go ahead and eat it."}, {"url": "http://www.eatbydate.com/fruits/fresh/how-long-does-winter-squash-last/", "passage_text": "Among the most common varieties of winter squashes are Spaghetti squash, Butternut squash and Acorn squash. Each of these varieties are very different in both texture and flavor. Also in this category are Hubbard, Delicata, Calabaza, Spaghetti, Kabocha and Sugar Pumpkin. Of course, all foods last for a shorter period of time if they are not stored properly. Winter squash includes acorn squash, spaghetti squash, butternut squash, delicata squash, hubbard squash, kabocha squash, turban squash, sweet dumpling squash, and of course all types of pumpkins. Prepared winter squash also freezes well and keeps for about 6-8 months in the freezer"}, {"url": "http://startcooking.com/spaghetti-squash", "passage_text": "Cook the squash on high for approximately 7-10 minutes – depending on the size of your squash and how powerful your microwave is. If you do not have an automatic turntable in your microwave, give the dish a turn every 3 minutes to ensure even cooking. Turning the squash into spaghetti strands takes about 10 seconds! You can then serve the squash as is or remove it to a serving plate. It will be very hot so hold the squash in a dish cloth so you don’t burn your hand."}, {"url": "http://www.sparkpeople.com/resource/perfect_prod_detail.asp?ppid=88", "passage_text": "To prepare spaghetti squash, cut in half lengthwise and remove the seeds with a spoon. Bake or boil it until tender, or wrap it in plastic wrap and microwave on high for 10 to 12 minutes. Once squash is cooked, use a fork to rake out the stringy flesh (which spaghetti like) all the way to the rind and serve. Recipes: a spaghetti squash with a firm, dry rind free of soft spots and cracks. Squash should be heavy for its size with a firm, dry, rounded stem, which helps keep out bacteria."}, {"url": "http://www.enjoy-how-to-cook.com/baking-spaghetti-squash.html", "passage_text": "1 The baking time goes from about an hour for a whole squash, to about 35 to 45 minutes for one cut in half. 2  Not a huge difference, especially since baking spaghetti squash ahead of time works so well. "}, {"url": "http://www.eatbydate.com/fruits/fresh/how-long-does-winter-squash-last/", "passage_text": "Keeping winter squash in the refrigerator makes them last only a tiny bit longer but alters the flavor and texture so is actually not recommended. For a long term option, cooked squash freezes great for 6-8 months (but raw squash does not freeze well). For cooking instructions, see how to cook spaghetti squash. Of course, all foods last for a shorter period of time if they are not stored properly. Winter squash includes acorn squash, spaghetti squash, butternut squash, delicata squash, hubbard squash, kabocha squash, turban squash, sweet dumpling squash, and of course all types of pumpkins. Prepared winter squash also freezes well and keeps for about 6-8 months in the freezer"}]