[{"url": "http://www.answers.com/Q/Roughly_how_much_do_criminal_defense_lawyers_make_a_year", "passage_text": "In the US, a criminal defense lawyer can expect to start off earning $35-45K as a public defender, or slightly more with a firm. Depending on their experience and history, a seasoned (15-20 yrs) criminal defense attorney can earn anywhere from $60-200K, depending on where he/she works."}, {"url": "http://work.chron.com/much-criminal-lawyer-make-year-12309.html", "passage_text": "With five years of experience, a defense attorney could earn $62,280 a year, while a prosecutor would make $62,320 a year — a difference of just $40. With more than 10 years of experience, annual salaries grew to $76,160 for public defense attorneys and $81,500 for prosecutors."}, {"url": "http://woman.thenest.com/much-criminal-lawyer-make-year-14397.html", "passage_text": "Criminal Lawyer Salaries. As of 2010, median salaries for government-employed criminal lawyers ranged from $45,700 to $81,500 annually. The salary for self-employed criminal lawyers is about $78,000 and they may charge by the hour or by the case, such as $1,500 for drunk driving arrests."}, {"url": "http://work.chron.com/much-criminal-lawyer-make-year-12309.html", "passage_text": "First-year associates earned a median pay of $72,000 a year at firms with 25 or fewer attorneys, notes NALP. Those working at firms with up to 50 lawyers earned $95,000, while those working for law firms of 100 to 250 lawyers earned $105,000 a year. Associates with five years of experience earned $90,000 a year at firms with 25 or fewer attorneys, while these same lawyers could earn $120,000 at firms with 100 to 250 lawyers."}, {"url": "http://www.access2knowledge.org/jobs-education/how-much-do-lawyers-make/", "passage_text": "How much does a lawyer make? According to the May 2012 record from the Bureau of Labor Statistics, the mean annual lawyer salary is $130,880, which is equivalent to a mean $62.93 hourly wage. While the bottom ten percent earns $54,310, the top ten percent earn an average of $168,010."}, {"url": "http://www.answers.com/Q/Roughly_how_much_do_criminal_defense_lawyers_make_a_year", "passage_text": "1 Non-profit criminal defense attorneys with one to four years experience have a median yearly salary of $41,583. 2  With five to nine years experience, non-profit lawyers make a median salary of $80,000 per year."}, {"url": "http://www.answers.com/Q/Roughly_how_much_do_criminal_defense_lawyers_make_a_year", "passage_text": "1 The median salary for a criminal lawyer in a private firm is $78,593. 2  The range will vary based on the nature of the case, including whether the attorney focuses on initial trials or appeals. 3  Once a lawyer becomes partner is a firm, he or she may make between $100,000 and $197,563, depending on his or her experience."}]