[{"url": "http://www.orthorexia.com/", "passage_text": "Orthorexia nervosa, as I defined it in 1996, indicates an unhealthy obsession with eating healthy food. The term is derived utilizing the Greek “orthos,” which means “right,” or “correct,” and is intended as a parallel with anorexia nervosa. One of the most dramatic changes in orthorexia is its current inclusion of exercise. It would now appear that the majority of people with orthorexia are also exercise enthusiasts of one sort or another, whether they do yoga, run or constantly work out at the gym."}, {"url": "https://en.wikipedia.org/wiki/Orthorexia_nervosa", "passage_text": "The term orthorexia derives from the Greek ορθο- (ortho, right or correct), and όρεξις (orexis, appetite), literally meaning 'correct appetite', but in practice meaning 'correct diet'. It was introduced in 1997 by Steven Bratman, M.D., to be used as a parallel with other eating disorders, such as anorexia nervosa. Orthorexia nervosa is not considered to be an eating disorder according to the American Psychiatric Association, and is not mentioned as an official diagnosis in the widely used DSM."}, {"url": "http://www.mirasol.net/eating-disorders/orthorexia.php", "passage_text": "Those who have an unhealthy obsession with otherwise healthy eating may be suffering from orthorexia nervosa, a term which literally means fixation on righteous eating. (NEDA.) Orthorexia starts out as an innocent attempt to eat more healthfully, but orthorexics become fixated on food quality and purity. Orthorexia is generally treated with psychotherapy, medication, or preferably with neurofeedback. 1  Psychotherapy: A type of psychotherapy called cognitive behavior therapy is especially useful for treating OCD."}, {"url": "https://en.wikipedia.org/wiki/Orthorexia_nervosa", "passage_text": "Orthorexia nervosa /ˌɔrθəˈrɛksiə nɜrˈvoʊsə/ (also known as orthorexia) is an eating disorder characterized by an extreme or excessive preoccupation with avoiding foods perceived to be unhealthy. It was introduced in 1997 by Steven Bratman, M.D., to be used as a parallel with other eating disorders, such as anorexia nervosa. Orthorexia nervosa is not considered to be an eating disorder according to the American Psychiatric Association, and is not mentioned as an official diagnosis in the widely used DSM."}, {"url": "http://psychologyofeating.com/what-is-orthorexia/", "passage_text": "Orthorexia is not an official diagnosis in the DSM, but it can certainly feel consuming and debilitating to those who have it. It can feel like a strict religion, in which there is much flagellation if piety is not achieved at every meal and snack. Orthorexia usually starts as an attempt to get healthy. Many people develop orthorexia after being put on restrictive diets by a holistic practitioner while treating a condition like Candida, mold, parasites, or autoimmune disorder."}, {"url": "http://psychologyofeating.com/what-is-orthorexia/", "passage_text": "Orthorexia actually means “fixation on righteous eating.” People who have orthorexia don’t necessarily count calories, nor are they driven by thinness, although they can have those elements. Orthorexia usually starts as an attempt to get healthy. Many people develop orthorexia after being put on restrictive diets by a holistic practitioner while treating a condition like Candida, mold, parasites, or autoimmune disorder."}, {"url": "https://www.nationaleatingdisorders.org/orthorexia-nervosa", "passage_text": "Orthorexia Nervosa. By Karin Kratina, PhD, RD, LD/N. Orthorexia nervosa is not currently recognized as a clinical diagnosis in the DSM-5, but many people struggle with symptoms associated with this term. Orthorexia appears to be motivated by health, but there are underlying motivations, which can include safety from poor health, compulsion for complete control, escape from fears, wanting to be thin, improving self-esteem, searching for spirituality through food, and using food to create an identity."}, {"url": "http://www.orthorexia.com/", "passage_text": "Orthorexia is evolving. I initially described orthorexia nervosa based on patterns I observed while studying and practicing alternative medicine. Most of the people I had in mind were trying to treat or prevent illness by following one or another dietary theory. One of the most dramatic changes in orthorexia is its current inclusion of exercise. It would now appear that the majority of people with orthorexia are also exercise enthusiasts of one sort or another, whether they do yoga, run or constantly work out at the gym."}, {"url": "http://www.eatingdisordershelpguide.com/orthorexia.html", "passage_text": "Other Resources. Orthorexia is defined as an obsession with healthy or righteous eating. The phrase was first created in 1997 by California doctor Steven Bratman, and refers to people who create severely limited diets in the name of healthy eating. "}, {"url": "https://www.nationaleatingdisorders.org/orthorexia-nervosa", "passage_text": "Those who have an “unhealthy obsession” with otherwise healthy eating may be suffering from “orthorexia nervosa,” a term which literally means “fixation on righteous eating.” Orthorexia starts out as an innocent attempt to eat more healthfully, but orthorexics become fixated on food quality and purity. Orthorexia appears to be motivated by health, but there are underlying motivations, which can include safety from poor health, compulsion for complete control, escape from fears, wanting to be thin, improving self-esteem, searching for spirituality through food, and using food to create an identity."}]