[{"url": "https://en.wikipedia.org/wiki/Ice_rink", "passage_text": "Historically, earlier ice rinks were smaller than today. Official National Hockey League rinks are 26 m × 61 m (85 ft × 200 ft). The dimensions originate from the size of the Victoria Skating Rink in Montreal, Canada. Official Olympic/International rinks have dimensions of 30 m × 60 m (98.4 ft × 197 ft). In bandy, the rink size is 90–110 m (300–360 ft) x 45–65 m (148–213 ft). For internationals, the size must not be smaller than 100 metres (330 ft) x 60 metres (200 ft)."}, {"url": "http://www.dimensionsinfo.com/ice-rink-dimensions/", "passage_text": "Ice rinks come in different shapes and sizes depending on the purpose. Some rinks are made for speedskating. For short tracks, the normal size is 30 by 60 meters, a measurement that is used in official Olympic Games. For long tracks, the average length is 400 meters. For the winter sport called bandy, teams usually compete in rinks that measure 90 to 110 meters by 45 to 65 meters. For ice hockey, the international-size rink measures 61 by 30 meters, the corner radius of which is 4.2 meters"}, {"url": "https://en.wikipedia.org/wiki/Roller_rink", "passage_text": "A roller rink is a hard surface usually consisting of Hardwood, Rollerboard or Concrete used for roller skating or inline skating. This includes roller hockey, speed skating, roller derby, and individual recreational skating. Roller rinks can be located in an indoor or outdoor facility. Most skating center facilities range anywhere from under 14,000 square feet to more than 21,000 square feet. According to data collected in 2004 a Roller Skating Rink owner can expect a 5% growth rate in their first year of business. Owners must have appropriate permits and licenses from the city in order to open the rink."}, {"url": "https://en.wikipedia.org/wiki/Ice_rink", "passage_text": "A famous example of this type of rink is the Rideau Canal Skateway in Ottawa, Canada, estimated at 1,782,000 square feet (165,600 m 2) and 7.8 kilometres (4.8 mi) long, which is equivalent to 90 Olympic size skating rinks. The rink is prepared by lowering the canal's water level and letting the canal water freeze. In bandy, the rink size is 90–110 m (300–360 ft) x 45–65 m (148–213 ft). For internationals, the size must not be smaller than 100 metres (330 ft) x 60 metres (200 ft)."}, {"url": "http://www.answers.com/Q/What_are_the_dimensions_of_a_roller_skating_rink", "passage_text": "The average size of a roller skating rink is 18,000 square.feet includes a skating surface of about 10,000 square feet, about 70 feet by 150 feet. This depends on capacity of the rink and how many people you can have on the rink in one go. I would normally say 200 pairs would be sufficient however for a smaller rink you … could have less. Regards Korby."}, {"url": "http://www.dimensionsinfo.com/ice-rink-dimensions/", "passage_text": "For Olympic ice hockey and other international competitions, the average size of rinks is 60 by 30 meters. For short tracks, the normal size is 30 by 60 meters, a measurement that is used in official Olympic Games. For long tracks, the average length is 400 meters. For the winter sport called bandy, teams usually compete in rinks that measure 90 to 110 meters by 45 to 65 meters."}]