[{"url": "http://www.open.edu/openlearnworks/mod/oucontent/view.php?id=194&printable=1", "passage_text": "Bacteria are a major source of microbial contamination of food, i.e. the undesired presence in food of harmful microorganisms or the harmful substances they produce. Viruses, parasites and fungi are also able to contaminate food and cause foodborne illnesses in humans."}, {"url": "https://au.answers.yahoo.com/question/index?qid=20120316220114AAHRQI8", "passage_text": "The definition of a hazard at McDonald's is: A)Anything that can cause harm or damage to someone or something 7. The three primary sources of food contamination are: A)Physical, chemical and bacterial 8. If a station is clean, it is: A)Free of visible dirt and debris 9. EEO stands for: A)Equal Employment Opportunity 10."}, {"url": "https://au.answers.yahoo.com/question/index?qid=20120316220114AAHRQI8", "passage_text": "The Open Door Policy means that: A)You can approach any of your managers with any questions about your restaurant or working conditions 2. False nails are permitted to be worn: A)Never. False nails pose a food safety hazard 3."}, {"url": "http://www.safefood.eu/SafeFood/media/SafeFoodLibrary/Documents/Education/safefood%20for%20life/ROI/section2.pdf", "passage_text": "Contamination of food Screen description Screen shows three types of contaminants. Teacher Indicate that the three main ways in which food can be contaminated are: 1. Microbial contamination (includes bacteria, moulds and viruses)2. Physical contamination 3."}, {"url": "https://au.answers.yahoo.com/question/index?qid=20120316220114AAHRQI8", "passage_text": "The definition of a hazard at McDonald's is E. Any event that resulted in or could have resulted in an injury or illness to an employee, contractor, visitor or customer 6. The three primary sources of food contamination are: D. Physical, chemical and bacterial 7. EEO stands for: C. Equal Employment Opportunity 8."}, {"url": "http://www.open.edu/openlearnworks/mod/oucontent/view.php?id=194&printable=1", "passage_text": "You now know that food can be contaminated from sources in the natural environment, people, food preparation surfaces and utensils, raw and uncooked food, animals, pests, and waste material. To prevent contamination, food production and preparation operations need to be carefully controlled."}, {"url": "http://www.enotes.com/homework-help/what-main-sources-bacteria-contamination-food-133585", "passage_text": "Posted on. (Answer #1). There are various sources of bacterial contamination. Some types are in food already (such as meats); must be cooked thoroughly to be safe. The amount can go way up if there are problems when the animal is slaughtered, as the meat can easily be contaminated with the animals feces."}, {"url": "http://dofoodsafely.health.vic.gov.au/topics/topic3/page2.php", "passage_text": "Food contamination occurs when something is found in food that shouldn’t be there. Contaminated food can be unsafe for consumption. There are three ways that food can be contaminated. Click on each of them below to learn more."}]