[{"url": "https://www.gov.uk/passport-fees", "passage_text": "Passport fees. A standard adult first passport or renewal costs £72.50, or £82.25 if you use the Post Office’s Passport Check and Send service. Child passports cost £46, or £55.75 using Check and Send. You can’t get a refund if you cancel your application or you’re not entitled to a passport. "}, {"url": "https://www.usps.com/international/passports.htm", "passage_text": "Renew by Mail. You can renew your passport by mail with application DS-82 if you meet the criteria listed on the U.S. Department of State web site. Renew by Mail Checklist. You can also renew your passport by bringing your prepared renewal application to a Post Office™ location."}, {"url": "http://clerkofcourt.maricopa.gov/passport.asp", "passage_text": "Adult Passport Fees: The passport book fee for an applicant 16 years or older is $135 ($110 Application fee payable to U.S. Department of State and $25 *Execution fee payable to the Clerk of Court). The U.S. Department of State and Clerk of Court fees are paid separately. When applying for the passport book and the passport card together, the fee for an applicant 16 years or older is $165 ($140 Application fee payable to U.S. Department of State and $25 *Execution fee payable to the Clerk of Court)."}, {"url": "http://www.uspassportnow.com/services/PassportRenewal", "passage_text": "Passport Renewal. Passport Renewals are for U.S. citizens that currently have a valid passport in their possession that was obtained after the age of 18. Please note that if your passport has expired more than 5 years ago you fall into the category of a New Passport Application. "}, {"url": "http://www.us-passport-service-guide.com/passport-renewal-faq.html", "passage_text": "The total cost of renewing a passport depends on what service you request, how quickly you need it and what method you use to obtain it. The application fee for renewing a passport book is $110. The State Department charges $60 for expedited service. Fees for professional passport expediting service start at approximately $79 for 10-day service. The highests fee, of course, is for same day passport renewal. Other related expenses include postage and handling and photos"}, {"url": "https://www.usps.com/international/passports.htm", "passage_text": "1 Renew Your Passport Renew by Mail You can renew your passport by mail with application DS-82 if you meet the criteria listed on the U.S. Department of State web site. 2  Renew by Mail Checklist You can also renew your passport by bringing your prepared renewal application to a Post Office™ location. You can renew your passport by mail with application DS-82 if you meet the criteria listed on the U.S. Department of State web site. Renew by Mail Checklist."}, {"url": "http://www.usatoday.com/story/travel/advice/2013/04/04/passport-101-how-to-apply-renew-or-replace/2051177/", "passage_text": "You can check the status of a pending passport application here. Changing your name on your passport. Good news: There's no fee for changing the name on your passport if your passport was issued less than a year ago. If the book's more than a year old, though, you must pay standard renewal fees."}, {"url": "http://www.usatoday.com/story/travel/advice/2013/04/04/passport-101-how-to-apply-renew-or-replace/2051177/", "passage_text": "Expediting a passport. You can get your passport expedited in roughly two to three weeks (door-to-door) via the State Department when you pay an extra $60 plus $12.85 for overnight delivery in addition to the standard processing fees. Changing your name on your passport. Good news: There's no fee for changing the name on your passport if your passport was issued less than a year ago. If the book's more than a year old, though, you must pay standard renewal fees."}, {"url": "http://clerkofcourt.maricopa.gov/passport.asp", "passage_text": "When applying for the passport book and the passport card together, the fee for a minor (under 16 years old) is $120 ($95 Application fee payable to U.S. Department of State and $25 *Execution fee payable to the Clerk of Court). The U.S. Department of State and Clerk of Court fees are paid separately. When applying for the passport book and the passport card together, the fee for an applicant 16 years or older is $165 ($140 Application fee payable to U.S. Department of State and $25 *Execution fee payable to the Clerk of Court)."}]