[{"url": "http://www.physlink.com/Education/AskExperts/ae255.cfm", "passage_text": "Light travels through space at just over 186,000 miles per second. The moon is just under 250,000 miles from Earth, so light from the Moon's surface has to travel more than one second (about 1.3 seconds) to reach us. Among other things, the astronauts left reflecting mirrors on the moon. Since moonlight is reflected sunlight, it originates at the Sun's surface 93 million miles from the Earth/Moon system. It takes about 8 minutes for that trip, so the short, final hop from the Moon to the Earth is trivial by comparison."}, {"url": "http://www.physics.ucsd.edu/~tmurphy/apollo/basics.html", "passage_text": "Better than a stopwatch... In essence, we measure the time it takes for the pulse of light to travel to the moon and back. This can take anywhere from 2.34 to 2.71 seconds, depending on how far away the moon is at the time (the earth-moon distance ranges from 351,000 km to 406,000 km). To do this, we have a laser that generates intense bursts of light only 100 picoseconds longthat's one tenth of a billionth of a second! Light, which travels 7 earth circumferences every second, only travels about an inch in this time."}, {"url": "http://www.answers.com/Q/How_long_does_it_take_for_a_pulse_of_laser_light_to_reach_the_moon_and_bounce_back_to_the_earth_knowing_that_the_earth-moon_distance_is_3.8X108m", "passage_text": "It take approximately 5 seconds for a strong laser to hit the moon and return to earth.   __________________   It's less than that. The Moon's orbit averages 384,400 km … from Earth, and the speed of light is 300,000 KM/sec. So the round-trip is closer to 2.4 seconds. Let's do the math: The average distance between the moon's surface and the earth's surface is 380,500 kilometers(km). Light is an electromagnetic wave an … d travels at a speed roughly 3 x 10^8 meters/second(m/s) in a vacuum."}, {"url": "http://www.answers.com/Q/How_long_does_it_take_for_a_pulse_of_laser_light_to_reach_the_moon_and_bounce_back_to_the_earth_knowing_that_the_earth-moon_distance_is_3.8X108m", "passage_text": "The time for light to travel from the Moon to Earth is about one and a quarter seconds. Light travels through space at roughly 300,000 km/second, so the average distance betwe … en the Earth and the Moon (about 384,399 kilometers) is traversed in 1.28 seconds. Let's do the math: The average distance between the moon's surface and the earth's surface is 380,500 kilometers(km). Light is an electromagnetic wave an … d travels at a speed roughly 3 x 10^8 meters/second(m/s) in a vacuum."}, {"url": "http://www.physlink.com/Education/AskExperts/ae255.cfm", "passage_text": "That also was a result of the 3 seconds it takes for a radio signal to travel to and from the moon, since radio waves are another form of light waves. Since moonlight is reflected sunlight, it originates at the Sun's surface 93 million miles from the Earth/Moon system. It takes about 8 minutes for that trip, so the short, final hop from the Moon to the Earth is trivial by comparison."}, {"url": "http://www.answers.com/Q/How_long_does_it_take_for_a_pulse_of_laser_light_to_reach_the_Moon_and_to_bounce_back_to_the_Earth", "passage_text": "It take approximately 5 seconds for a strong laser to hit the moon and return to earth.   __________________   It's less than that. The Moon's orbit averages 384,400 km … from Earth, and the speed of light is 300,000 KM/sec. So the round-trip is closer to 2.4 seconds. Roughly 2.5 seconds. Let's do the math: The average distance between the moon's surface and the earth's surface is 380,500 kilometers(km). Light is an electromagnetic wave an … d travels at a speed roughly 3 x 10^8 meters/second(m/s) in a vacuum."}, {"url": "http://www.universetoday.com/15403/how-long-would-it-take-to-travel-to-the-nearest-star/", "passage_text": "In April, I examined how long it takes to travel to the Moon. We took the fast-track with New Horizons Pluto mission, powering past Earth’s only natural satellite in a mere eight hours and 35 minutes. We also had the leisurely ion drive-propelled SMART-1 mission that trundled its way to the Moon for 13 months. "}, {"url": "http://www.answers.com/Q/How_long_does_it_take_for_a_pulse_of_laser_light_to_reach_the_moon_and_bounce_back_to_the_earth_knowing_that_the_earth-moon_distance_is_3.8X108m", "passage_text": "Roughly 2.5 seconds. Let's do the math: The average distance between the moon's surface and the earth's surface is 380,500 kilometers(km). Light is an electromagnetic wave an … d travels at a speed roughly 3 x 10^8 meters/second(m/s) in a vacuum. Since distance = speed*time the time it takes for the laser pulse to travel from the the earth to the moon is, time = distance/speed"}, {"url": "http://www.answers.com/Q/How_long_does_it_take_for_a_pulse_of_laser_light_to_reach_the_Moon_and_to_bounce_back_to_the_Earth", "passage_text": "Light is an electromagnetic wave and travels at a speed roughly 3 x 10^8 meters/second(m/s) in a vacuum. Since distance = speed*time the time it takes for the laser pulse to travel from the the earth to the moon is, time = distance/speed. For round trip time = 2*(distance/speed). Roughly 2.5 seconds. Let's do the math: The average distance between the moon's surface and the earth's surface is 380,500 kilometers(km). Light is an electromagnetic wave an … d travels at a speed roughly 3 x 10^8 meters/second(m/s) in a vacuum."}]