[{"url": "http://neuroscience.uth.tmc.edu/s4/chapter11.html", "passage_text": "Glucose from blood enters the brain by a transport protein. Glucose is the primary energy substrate of the brain. Glucose transport protein (GLUT-1) is highly enriched in brain capillary endothelial cells. These transporters carry glucose molecules through the blood brain barrier. 11.1 Blood-brain Barrier Maintains the Constancy of the Brain's Internal Environment. The blood-brain barrier (BBB) protects the neural tissue from variations in blood composition and toxins."}, {"url": "http://medical-dictionary.thefreedictionary.com/substrate", "passage_text": "part of the active site of an enzyme which includes the amino acid residues that come into contact with the substrate. substrate specificity. range of substrates that can be catalytically converted to product by an enzyme. substrate. 1. any substance upon which an enzyme acts. 2. a neutral substance containing a nutrient solution. 3. a surface upon which a different material is deposited or adhered, usually in a coating or layer."}, {"url": "http://www.medbio.info/Horn/Time%206/muscle_metabolism.htm", "passage_text": "Use of ATP usually does not lead to a decrease in ATP levels, due to the very rapid resynthesis. Extreme muscle activity leads to no more than a 20% reduction in ATP concentration in muscles. Only carbohydrates (glycogen or blood sugar) can be used anaerobically. Neither amino acids nor fatty acids can be processed without use of oxygen. Muscles differ in their ability to produce ATP through anaerobic and aerobic reactions. Fast-twitch white muscles with few mitochondria are the anaerobic fibers. Energy production, that is ATP synthesis from ADP and Pi, can occur anaerobically (without the use of oxygen) or aerobically (using mitochondrial reactions and oxygen). These reactions, especially anaerobic metabolism, are quite rapid."}, {"url": "https://en.wikipedia.org/wiki/Substrate", "passage_text": "1 Substrate (vivarium) , the material used in the bottom of a vivarium or terrarium. 2  Substrate (aquarium) , the material used in the bottom of an aquarium. 3  Substrate (materials science) , the material on which a process is conducted. 1 Substrate (marine biology) , the earthy material that exists in the bottom of a marine habitat, like dirt, rocks, sand, or gravel. 2  Substrate (chemistry) , the reactant which is consumed during a catalytic or enzymatic reaction. 3  Substrate (biochemistry) , a molecule that is acted upon by an enzyme"}, {"url": "http://www.medbio.info/Horn/Time%206/muscle_metabolism.htm", "passage_text": "Energy substrates in the human body are either carbohydrates, fat or proteins. Protein degradation yields amino acid residues which can be converted to carbohydrates and used in energy production. Carbohydrates (sugars) and amino acids from proteins give approximately 4 kcal/gram dry weight when burned in the body. Fatty acids from adipose tissue or food give 9 kcal/gram. Energy production, that is ATP synthesis from ADP and Pi, can occur anaerobically (without the use of oxygen) or aerobically (using mitochondrial reactions and oxygen). These reactions, especially anaerobic metabolism, are quite rapid."}, {"url": "http://neuroscience.uth.tmc.edu/s4/chapter11.html", "passage_text": "In certain circumstances, such as during starvation, the brain can use “ketone bodies” in place of glucose as substrates. Ketone bodies, acetoacetate and D-beta-hydroxybutyrate are formed from catabolism of fatty acids by the liver. 11.1 Blood-brain Barrier Maintains the Constancy of the Brain's Internal Environment. The blood-brain barrier (BBB) protects the neural tissue from variations in blood composition and toxins."}, {"url": "https://en.wikipedia.org/wiki/Substrate", "passage_text": "1 Substrate (building) , Natural stone, masonry surface, ceramic and porcelain tiles. 2  Substrate (vivarium) , the material used in the bottom of a vivarium or terrarium. 3  Substrate (aquarium) , the material used in the bottom of an aquarium. 1 Substrate (marine biology) , the earthy material that exists in the bottom of a marine habitat, like dirt, rocks, sand, or gravel. 2  Substrate (chemistry) , the reactant which is consumed during a catalytic or enzymatic reaction. 3  Substrate (biochemistry) , a molecule that is acted upon by an enzyme"}, {"url": "http://apps.sherwin-automotive.com/media/pds/English/W10416.pdf", "passage_text": "Apply 2-3 medium wet coats, or until hiding is achieved, with a 50% overlap allowing each coat to become handslick before the next coat. Apply at a gun distance of 6-8 inches. A cross-coat method (horizontal one coat, vertical the next) can be used for metallic colors to hel p achieve uniform metallic orientation. If further metallic orientation is needed, increase gun distance and /or increase air pressure during finesse coat application. Recommended dry film thickness is 2.0 - 2.5 mils. "}, {"url": "https://en.wikipedia.org/wiki/Substrate", "passage_text": "1 Substrate (materials science) , the material on which a process is conducted. 2  Substrate (biology) , the natural environment in which an organism lives, or the surface or medium on which an organism grows or is attached. 3  Substrate (locomotion) , the surface over which an organism locomotes. 1 Substrate (marine biology) , the earthy material that exists in the bottom of a marine habitat, like dirt, rocks, sand, or gravel. 2  Substrate (chemistry) , the reactant which is consumed during a catalytic or enzymatic reaction. 3  Substrate (biochemistry) , a molecule that is acted upon by an enzyme"}]