[{"url": "http://whatis.techtarget.com/definition/vendor", "passage_text": "Retailers are vendors of products to consumers. In information technology as well as in other industries, the term is commonly applied to suppliers of goods and services to other companies. A tier 1 vendor is a large and well-known vendor, often enjoying national or international recognition and acceptance. Tier 1 vendors may be both manufacturers and value-added resellers (VAR s). A tier 2 vendor is a smaller and less well-known provider that is often also limited in its geographic coverage as well. As a consequence, a tier 2 vendor is generally regarded as a secondary source rather than the preferred source"}, {"url": "http://www.investopedia.com/terms/v/vendor.asp", "passage_text": "DEFINITION of 'Vendor'. The party in the supply chain that makes goods and services available to companies or consumers. The term vendor is typically used to describe the entity that is paid for the goods that are provided, rather than the manufacturer of the goods. A vendor, however, can operate both as the supplier of goods (seller) and the manufacturer. Also known as a supplier. BREAKING DOWN 'Vendor'. A vendor is a person or a business entity that sells something. Large retail stores generally have a list of vendors from which they purchase goods (at wholesale) to sell (at retail) to their customers. Vendors can also sell directly to the customer, as seen with street vendors"}, {"url": "https://en.wikipedia.org/wiki/Vendor", "passage_text": "In a supply chain, a vendor, or a seller, is an enterprise that contributes goods or services. Generally, a supply chain vendor manufactures inventory/stock items and sells them to the next link in the chain. Today, the terms refers to a supplier of any good or service. 'Vendor' generally applies only to the immediate vendor, or the organization that is paid for the goods, rather than to the original manufacturer or the organization performing the service if it is different from the immediate supplier."}, {"url": "http://www.thefreedictionary.com/vendor", "passage_text": "ven·dor. n. 1. One that sells or vends something: a street vendor; a vendor of software products on the Web. 2. One that provides products or services to a business for a fee. 3. A vending machine. "}, {"url": "http://whatis.techtarget.com/definition/vendor", "passage_text": "Part of the Business terms glossary: A vendor, also known as a supplier, is an individual or company that sells goods or services to someone else in the economic production chain. In information technology as well as in other industries, the term is commonly applied to suppliers of goods and services to other companies. A tier 1 vendor is a large and well-known vendor, often enjoying national or international recognition and acceptance."}, {"url": "https://en.wikipedia.org/wiki/Vendor", "passage_text": "A vendor, or a supplier, is a supply chain management term that means anyone who provides goods or services to a company or individuals. A vendor often manufactures inventoriable items, and sells those items to a customer. Typically vendors are tracked in either a finance system or a warehouse management system. 'Vendor' generally applies only to the immediate vendor, or the organization that is paid for the goods, rather than to the original manufacturer or the organization performing the service if it is different from the immediate supplier."}, {"url": "http://www.investopedia.com/terms/v/vendorfinancing.asp", "passage_text": "DEFINITION of 'Vendor Financing'. The lending of money by a company to one of its customers so that the customer can buy products from it. By doing this, the company increases its sales even though it is basically buying its own products. "}, {"url": "https://en.wikipedia.org/wiki/Vendor_lock-in", "passage_text": "In economics, vendor lock-in, also known as proprietary lock-in or customer lock-in, makes a customer dependent on a vendor for products and services, unable to use another vendor without substantial switching costs. "}]