[{"url": "http://www.rockliffs.com.au/articles/self-managed-super-funds-corporate-trustee-or-individual-trustees/", "passage_text": "A Self-Managed Superannuation Fund (“SMSF”) can only ever have up to 4 members. Thus whether a SMSF is established under a corporate trustee structure or an individual trustee structure, you can still only ever have up to 4 members in the SMSF. The advantages and disadvantages of setting up an SMSF with a corporate trustee or an individual trustee’s structure are: Corporate Trustee – Advantages. 1  A single member SMSF with a corporate trustee structure does not require a second director."}, {"url": "http://www.rockliffs.com.au/articles/self-managed-super-funds-corporate-trustee-or-individual-trustees/", "passage_text": "1 A single member SMSF with a corporate trustee structure does not require a second director. 2  It can operate with the sole member being the sole director and member of the SMSF. 3  All assets belonging to the SMSF must be in the name of the corporate trustee as trustee for the SMSF (eg. The advantages and disadvantages of setting up an SMSF with a corporate trustee or an individual trustee’s structure are: Corporate Trustee – Advantages. 1 "}, {"url": "https://www.cleardocs.com/resources-legal-faq-smsf.html", "passage_text": "If the trustee is a company, then the legal personal representative of the disabled member, or where a member does not have a legal personal representative, a parent or guardian of the disabled member, must be a director of that company in place of the member. The corporate trustee and the Principal or Employer Sponsor should not be the same person, as there should be at least 2 parties to the deed. The person or entity who establishes the SMSF can be any other company or any person, including any of the Fund's members."}, {"url": "https://www.cleardocs.com/resources-legal-faq-smsf.html", "passage_text": "Yes, a person who is under 18 can be a member of an SMSF. If the member has a legal personal representative, then the member's legal personal representative must be a trustee of the fund or a director of the corporate trustee in place of the member. The corporate trustee and the Principal or Employer Sponsor should not be the same person, as there should be at least 2 parties to the deed. The person or entity who establishes the SMSF can be any other company or any person, including any of the Fund's members."}, {"url": "https://www.supereasy.com.au/smsf/faq.asp", "passage_text": "A SMSF can also have a company as a trustee if each director of the company is a member of the fund. Note: anyone over the age of 18 can be a trustee of a superannuation fund unless they are a disqualified person under SISA. There are two types of regulated SMSF s. The most common type is usually called More Than One Member Fund or  Multiple Member Fund , with a corporate or non-corporate trustee; the other being a  Single Member Fund , again with a corporate or non-corporate trustee."}, {"url": "https://glenister.com.au/superannuation/smsf-estate-planning/the-smsf-will/", "passage_text": "The SMSF Will enables the member to provide a definitive direction to the Trustee as to how their Death Benefits are to be distributed at the time of their death. This can include out of which superannuation interests and in what form including specific assets the death benefits are to be paid. At the time of the Member’s death the Trustee is to review the SMSF Will and distribute according to the Will subject to the superannuation laws and the fund remaining a complying SMSF. A SMSF Will is not automatically accepted."}, {"url": "http://www.rockliffs.com.au/articles/self-managed-super-funds-corporate-trustee-or-individual-trustees/", "passage_text": "This means that for a corporate trustee, you can have up to 4 directors and for individual trustees, you can have up to 4 individuals. All directors must be members of the SMSF and all individuals must be members of the SMSF, with the exception of a single member SMSF. The advantages and disadvantages of setting up an SMSF with a corporate trustee or an individual trustee’s structure are: Corporate Trustee – Advantages. 1  A single member SMSF with a corporate trustee structure does not require a second director."}]