[{"url": "http://www.webmd.com/diet/obesity/gastric-bypass", "passage_text": "Surgery is generally considered when your body mass index (BMI) is 40 or higher. Surgery may also be an option when your BMI is 35 or higher and you have a life-threatening or disabling problem that is related to your weight, such as type 2 diabetes that is difficult to control with diet, exercise, and medicine. It is important to think of this surgery as a tool to help you lose weight."}, {"url": "http://medical-dictionary.thefreedictionary.com/obesity", "passage_text": "A state of excess body fat, which is a premorbid addiction disorder, defined as 20% above an individual’s standard weight (the ideal body weight is 21 kg/m2; a person is considered obese with a body weight above 30 kg/m2). Epidemiology-US. 31% of adults are obese; 17% of children are obese. Hypertrophic obesity results from an increase in the size of the fat cells in the increased adipose tissue mass. observations Manifestations are excess body weight for height. Overweight is determined by a body mass index (BMI) of 25 to 29.9 kg/m 2, and obesity is a BMI = 30 kg/m 2."}, {"url": "http://www.nhs.uk/Conditions/weight-loss-surgery/Pages/Introduction.aspx", "passage_text": "Introduction. Weight loss surgery, also called bariatric surgery, is used to treat people who are dangerously obese. This type of surgery is only available on the NHS to treat people with potentially life-threatening obesity when other treatments, such as lifestyle changes, haven't worked. Adults who have recently been diagnosed with type 2 diabetes may also be considered for an assessment for weight loss surgery if they have a BMI of 30-34.9."}, {"url": "http://www.livestrong.com/article/392043-what-is-water-weight-loss/", "passage_text": "Effects. Water weight loss can be dangerous and life threatening because it can cause dehydration. When your body becomes dehydrated, it does not have enough water for basic metabolic processes. In mild cases, your body may take any water it does get and retain it in the tissues, which can lead to bloating. Water weight loss is a temporary reduction in body weight due to the loss of bodily fluids -- generally through sweat, urination or defecation. The body is as much as 60 percent water, which is present in the blood and lymph fluids and absorbed into the tissues"}, {"url": "http://www.obesityhelp.com/content/aboutobese.html", "passage_text": "Obesity specifically refers to an excessive amount of body fat. Overweight refers to an excessive amount of body weight that includes muscle, bone, fat, and water. As a rule, women have more body fat than men. Most health care professionals agree that men with more than 25 percent body fat and women with more than 30 percent body fat are obese. Research proves that people could live longer and healthier at an ideal body weight. The average American has gained around 8 pounds in the past 10 years. LSU researchers estimate that .the direct costs of obesity in the United States is now at 39.3 billion dollars a year. That is more than 5% of all medical costs.."}, {"url": "http://medical-dictionary.thefreedictionary.com/obesity", "passage_text": "A widely accepted definition of obesity is body weight that is 20% or more in excess of ideal weight:height ratio according to actuarial tables. By this definition, 34% of adults in the U.S. are obese. Hypertrophic obesity results from an increase in the size of the fat cells in the increased adipose tissue mass. observations Manifestations are excess body weight for height. Overweight is determined by a body mass index (BMI) of 25 to 29.9 kg/m 2, and obesity is a BMI = 30 kg/m 2."}, {"url": "http://www.nationaleatingdisorders.org/anorexia-nervosa", "passage_text": "Anorexia nervosa is a serious, potentially life-threatening eating disorder characterized by self-starvation and excessive weight loss. Symptoms. 1  Inadequate food intake leading to a weight that is clearly too low. 2  Intense fear of weight gain, obsession with weight and persistent behavior to prevent weight gain. "}, {"url": "http://medical-dictionary.thefreedictionary.com/obesity", "passage_text": "Obesity traditionally has been defined as a weight at least 20% above the weight corresponding to the lowest death rate for individuals of a specific height, gender, and age (ideal weight). Hypertrophic obesity results from an increase in the size of the fat cells in the increased adipose tissue mass. observations Manifestations are excess body weight for height. Overweight is determined by a body mass index (BMI) of 25 to 29.9 kg/m 2, and obesity is a BMI = 30 kg/m 2."}]