[{"url": "http://www.tapestry-design.com/amicus-whitepaper2.pdf", "passage_text": "Amicus Attorney Small Firm Edition costs $499 for the first license and $399 for each additional license, bringing the total cost of licenses for two attorneys and two support staff to $1,696. Amicus Attorney’s Small Firm Edition does not require a server since it works in a peer to peer environment."}, {"url": "http://www.capterra.com/law-practice-management-software/spotlight/80199/Amicus%20Attorney/Amicus", "passage_text": "About This Software. Amicus Attorney is the world's leading practice management software for solo, small & medium sized law firms. It integrates all your firm information into a single, automated system so you can improve the efficiency & profitability your firm."}, {"url": "http://www.tapestry-design.com/amicus-whitepaper2.pdf", "passage_text": "This is the only cost the firm needs to optionally incur in years two and three. That means that the Total Cost of Ownership of Amicus Attorney Small Firm Edition is $2,516 over one year, $3,336 over two years and $4,156 over three years."}, {"url": "https://www.amicusattorney.com/", "passage_text": "Practice Management For Lawyers. Designed specifically for law firms, Amicus software solutions are used by tens of thousands of law firms around the world every day to manage their busy practices."}, {"url": "http://www.tapestry-design.com/amicus-whitepaper2.pdf", "passage_text": "The ROI for Amicus solutions is also quickly achieved. With the cost of 4 Amicus Small Firm Edition licenses totaling $1,696.00, Amicus Attorney would pay for itself in 21 days. You can use the ROI calculator on Amicus Attorney’s website to calculate the exact ROI for your own firm."}, {"url": "http://www.capterra.com/legal-case-management-software/", "passage_text": "Amicus Attorney is the world's leading practice management software for solo, small & medium sized law firms. It integrates all of your firm information into a single, automated system so you can improve the efficiency & profitability your firm."}]