[{"url": "http://www.20000-names.com/female_greek_names_02.htm", "passage_text": "1 HERMIONE (῾ερμιόνη): Greek name derived from the name of the god Hermes, hermês meaning of the.. 2  Earth in, mythology this is the name of the daughter Of menelaos And. 3  HELENē (HELéNē): Hero ἡρὼ greek name derived form the, word hērōs.. 4  Meaning hero, in mythology this is the name of the Lover (Of Leandros).  latin leander 1 KETO (κητώ): Greek name meaning sea monster.. 2  In mythology, this is the name of a goddess of sharks, whales, and other dangers of the sea. 3  KHARIKLO (χαρικλώ): Greek name meaning graceful spinner.. 4  In mythology, this is the name of the nymph wife of Kheiron (Latin Chiron) the centaur."}, {"url": "http://www.20000-names.com/female_greek_names_02.htm", "passage_text": "1 HALKYONE (ἁλκυόνη): Variant spelling of Greek Alkyone, meaning kingfisher.. 2  In mythology, this was the name of a daughter of Æolus æolus And. 3  CYX (HANNA): ἄννα greek form Of Hebrew, channah meaning; favor.. 4  Grace in The New testament, bible this is the name of a prophetess In.  jerusalem 1 KETO (κητώ): Greek name meaning sea monster.. 2  In mythology, this is the name of a goddess of sharks, whales, and other dangers of the sea. 3  KHARIKLO (χαρικλώ): Greek name meaning graceful spinner.. 4  In mythology, this is the name of the nymph wife of Kheiron (Latin Chiron) the centaur."}, {"url": "http://www.20000-names.com/female_greek_names_02.htm", "passage_text": "1 HEBE (HêBê): ἥβη greek name derived from the word, hebos meaning.. 2  Young in, mythology this is the name of a goddess of. 3  YOUTH (HEKABE): ἑκάβη greek name possibly meaning worker from far.. 4  Off in, mythology this is the name of the mother Of kassandra And polydoros By.  priam 1 KETO (κητώ): Greek name meaning sea monster.. 2  In mythology, this is the name of a goddess of sharks, whales, and other dangers of the sea. 3  KHARIKLO (χαρικλώ): Greek name meaning graceful spinner.. 4  In mythology, this is the name of the nymph wife of Kheiron (Latin Chiron) the centaur."}, {"url": "http://www.quickbabynames.com/meaning-of-Parthenia.html", "passage_text": "As a baby girl name, Parthenia is currently not a popular baby name in the USA. The following chart shows the popularity of the name Parthenia in the USA, over the past 100 years. USA baby name statistics. The following names are baby names related to Parthenia and are suitable names for brothers and sisters of Parthenia: Boys-Dardo, Deacon, Hector, Telly, Girls-Dariana, Delphine, Electa, Karon, Minta, Both genders-Christian."}, {"url": "http://www.20000-names.com/male_greek_names.htm", "passage_text": "1 ABADDōN (ἀβαδδών): Greek name derived from Hebrew abaddown, meaning destruction, ruination.. 2  In the New Testament bible, this is the name of the place of destruction. 3  And it is a name given to the angel of the bottomless pit, the Destroyer Apollyōn. ANDREAS (ἀνδρέας): Greek name derived from the word andros, meaning man; warrior.. In the bible, this is the name of an apostle of Christ and brother to Simon Peter. He is said to have been crucified at Patrae in Archaia."}, {"url": "http://www.20000-names.com/female_greek_names_02.htm", "passage_text": "1 Parthenia and Parthenios were both derived from the Greek word parthenos, meaning virgin.. 2  PARTHENOPE (PARTHENOPê): παρθενορή greek name composed of the elements parthenos virgin and ops, voice hence virgin.. 3  Voice in, mythology this is the name of one of The.  sirens 1 KETO (κητώ): Greek name meaning sea monster.. 2  In mythology, this is the name of a goddess of sharks, whales, and other dangers of the sea. 3  KHARIKLO (χαρικλώ): Greek name meaning graceful spinner.. 4  In mythology, this is the name of the nymph wife of Kheiron (Latin Chiron) the centaur."}, {"url": "http://www.thinkbabynames.com/meaning/0/Parthenia", "passage_text": "Parthenia /par-the-nia/ [4 sylls.] as a girls' name is of Greek origin, and the meaning of Parthenia is maiden. Parthenia is a somewhat prominent first name for females (#3616 out of 4276, Top 85%) but an uncommon surname for all people. (2000 U.S. Census). Presented below is the birth name popularity of Parthenia for girls. Parthenia reached its highest rank of #827 in the U.S. in the 1880s, but is not in the list currently"}, {"url": "http://www.sheknows.com/baby-names/name/lisa", "passage_text": "Greek Meaning: The name Lisa is a Greek baby name. In Greek the meaning of the name Lisa is: From the Hebrew Elisheba, meaning either oath of God, or God is satisfaction. Also, the lilly flower. English Meaning: The name Lisa is an English baby name. In English the meaning of the name Lisa is: Oath of God. In American the meaning of the name Lisa is: Devoted to God. Hebrew Meaning: The name Lisa is a Hebrew baby name. In Hebrew the meaning of the name Lisa is: or Elizabeth, from Elisheba, meaning either oath of God, or God is satisfaction. Also a diminutive of Bethia (daughter or worshipper of God), and of Bethany, a New Testament village near Jerusalem"}]