[{"url": "https://answers.yahoo.com/question/index?qid=20110202183326AApAA6K", "passage_text": "- DNA-double stranded-RNA-single stranded-DNA-contains deoxyribose sugar-RNA-contains ribose sugar-DNA-nitrogenous bases are A, T, C, and G. - RNA-nitrogenous bases are A, U, C and G. - DNA-It serves as heriditary material in most of the organisms-RNA-It is heriditary material for most of the viruses. - DNA-It consists of large number of nucleotides [ about 4 million] - RNA-it consists of less number of nucleotides [ about 12,000]. - DNA-Present in nucleus, mitochondria and chloroplasts-RNA-present throughout the cytoplasm except vacoules."}, {"url": "https://answers.yahoo.com/question/index?qid=20080225192259AAm2WOf", "passage_text": "Best Answer: RNA is single strand. DNA is double strand. Both DNA and RNA are composed of repeating units of nucleotides. Each nucleotide consists of a sugar, a phosphate and a nucleic acid base. The sugar in DNA is deoxyribose. The sugar in RNA is ribose, the same as deoxyribose but with one more OH (oxygen-hydrogen atom combination called a hydroxyl). This is the biggest difference between DNA and RNA"}, {"url": "http://chemistry.about.com/od/lecturenoteslab1/a/Dna-Versus-Rna.htm", "passage_text": "1 The only difference between ribose and deoxyribose is that ribose has one more-OH group than deoxyribose, which has-H attached to the second (2') carbon in the ring. 2  DNA is a double stranded molecule while RNA is a single stranded molecule. 3  DNA is stable under alkaline conditions while RNA is not stable. DNA stands for deoxyribonucleic acid, while RNA is ribonucleic acid. Although DNA and RNA both carry genetic information, there are quite a few differences between them. This is a comparison of the differences between DNA versus RNA, including a quick summary and a detailed table of the differences."}, {"url": "http://chemistry.about.com/od/lecturenoteslab1/a/Dna-Versus-Rna.htm", "passage_text": "1 DNA contains the sugar deoxyribose, while RNA contains the sugar ribose. 2  The only difference between ribose and deoxyribose is that ribose has one more-OH group than deoxyribose, which has-H attached to the second (2') carbon in the ring. DNA stands for deoxyribonucleic acid, while RNA is ribonucleic acid. Although DNA and RNA both carry genetic information, there are quite a few differences between them. This is a comparison of the differences between DNA versus RNA, including a quick summary and a detailed table of the differences."}, {"url": "http://www.answers.com/Q/Describe_three_ways_that_RNA_differs_from_DNA", "passage_text": "1. The sugar in DNA is deoxyribose and the sugar in RNA is ribose. 2. DNA is a double strand and RNA is single strand. 3. DNA is in the nucleus and RNA travels around from nuc … leus to cytoplasm. or 1. RNA is generally single stranded 2. RNA contains Uracil in place of Thymine 3. RNA is a single strand whereas DNA is a double stranded helix. RNA has one less oxygen than DNA (RNA=ribose DNA=deoxyribose). RNA contains the bases Adenine, guanine, cytos … ine and uracil whereas DNA has Thymine instead of uracil."}, {"url": "http://www.answers.com/Q/Describe_three_ways_that_RNA_differs_from_DNA", "passage_text": "RNA and DNA differ in these ways: (1) DNA has deoxyribose sugar, and RNA has ribose sugar. (2) DNA is made up of these four bases: adenine & guanine, cytosine & thymine; R … NA is made up of adenine & guanine, cytosine & URACIL, the difference being that in RNA, uracil replaces thymine. RNA is a single strand whereas DNA is a double stranded helix. RNA has one less oxygen than DNA (RNA=ribose DNA=deoxyribose). RNA contains the bases Adenine, guanine, cytos … ine and uracil whereas DNA has Thymine instead of uracil."}, {"url": "http://www.answers.com/Q/What_are_three_ways_that_the_structure_of_RNA_differs_form_that_of_DNA", "passage_text": "RNA and DNA differ in these ways: (1) DNA has deoxyribose sugar, and RNA has ribose sugar. (2) DNA is made up of these four bases: adenine & guanine, cytosine & thymine; R … NA is made up of adenine & guanine, cytosine & URACIL, the difference being that in RNA, uracil replaces thymine. There are three main ways in which DNA differs from RNA. First, RNA is single-stranded unlike DNA which is double-stranded. Second, DNA contains deoxyribose while RNA contains … ribose. Third, the base for adenine is thymine in DNA and uracil in RNA"}, {"url": "http://www.answers.com/Q/What_are_three_ways_that_the_structure_of_RNA_differs_form_that_of_DNA", "passage_text": "1. The sugar in DNA is deoxyribose and the sugar in RNA is ribose. 2. DNA is a double strand and RNA is single strand. 3. DNA is in the nucleus and RNA travels around from nuc … leus to cytoplasm. or 1. RNA is generally single stranded 2. RNA contains Uracil in place of Thymine 3. There are three main ways in which DNA differs from RNA. First, RNA is single-stranded unlike DNA which is double-stranded. Second, DNA contains deoxyribose while RNA contains … ribose. Third, the base for adenine is thymine in DNA and uracil in RNA"}]