[{"url": "http://www.frontlineanimalremoval.com/chimney-attic-raccoons-time-birth/", "passage_text": "Raccoons have a gestation period of around 65 days. Consequently, raccoon litters are usually born beginning in March and continue till the early summer. Doing the math for a raccoon bred on January 31–she will deliver her litter about two weeks from today: April 6. As of last week, we were already starting to see some ready-to-give-birth-soon females."}, {"url": "http://www.owren-online.org/raccoons1.htm", "passage_text": "Some raccoons will give birth later in the season if they were too young when the first mating season rolled around, or if they have lost their kits through disease or predation. These late born raccoons are generally born from June August and will have a harder time surviving their first winter with mom. The life span of raccoons in the wild is estimated at three to five years especially in urban areas. They have amazing ability to use their paws and amazing dexterity at opening things, turning doorknobs, prying things open, taking nuts off of bolts and gaining access to buildings or food sources and they can dig."}, {"url": "http://www.answers.com/Q/When_do_raccoons_give_birth", "passage_text": "Raccoon pregnancy typically lasts 63 to 65 days, but can be as short as 54 days, and as long as 70. Litter size is 2 to 5 kits or cubs, with larger litters occurring in harsher conditions. Raccoons typically give birth from March to May, but in more northerly areas, as late as August. Mating is triggered by longer daylight, and this begins two months before birthing."}, {"url": "http://www.wildcatwildlifecenter.org/injuryraccoons.html", "passage_text": "Natural History for Raccoons. Raccoons are born around May and June in Indiana, with some late litters occurring in the Fall. A sow (a female raccoon) can give birth from one to seven cubs (baby raccoons), which are gray in color and helpless at birth. Cubs are born blind, and they open their eyes after three to four weeks. "}, {"url": "http://www.havahart.com/raccoon-facts", "passage_text": "Raccoon Behavior. Activity: Nocturnal in nature, raccoons are mostly active at nighttime. They are most active in spring, summer and fall, and will sleep in their dens for most of the winter. Reproduction: Reproduction begins in late winter. Females, or sows, usually give birth to 1-6 baby kits in April or May. Traditionally, raccoons prefer heavily wooded areas with access to trees, water and abundant vegetation. There, they make their dens in the hollow parts of trees as well as abandoned burrows, traveling up to 18 miles to forage for food."}, {"url": "http://www.havahart.com/raccoon-facts", "passage_text": "A group of raccoons is called a nursery. Although raccoons only live 2-3 years in the wild, a raccoon can live up to 20 years in captivity. Traditionally, raccoons prefer heavily wooded areas with access to trees, water and abundant vegetation. There, they make their dens in the hollow parts of trees as well as abandoned burrows, traveling up to 18 miles to forage for food."}, {"url": "http://forestandwildlife.com/raccoons/", "passage_text": "However, in certain circumstances they will invade homes for shelter or to give birth. Female raccoons normally give birth in the spring, but may give birth at other times. If chirping sounds are heard in an attic or crawlspace, this may indicate the presence of baby raccoons. "}, {"url": "http://www.welchproperty.com/cannon/racoon.htm", "passage_text": "After 63 days of pregnancy a mother will give birth. Raccoons usually have 4-5 babies in a litter. The mother raccoon stays with her young in the nest 23 hours a day. The other hour is spent finding food. Raccoons (Procyon Lotor) are medium sized animals, 12 - 35 + lbs. and 20 - 40 inches long, including a bushy tail with 4 to 7 black rings. The fur has a salt and pepper appearance with the black mask marking on a whitish face characteristic of the species. The tracks of the raccoon are very distinctive."}, {"url": "http://www.answers.com/Q/When_do_raccoons_give_birth", "passage_text": "I couldn't find any specific details on the age when raccoons become fertile, but it appears that this happens quickly enough that a raccoon born one year can mate the next. Their natural lifespan is roughly 16 years, and they'll mate every year. Litter size is 2 to 5 kits or cubs, with larger litters occurring in harsher conditions. Raccoons typically give birth from March to May, but in more northerly areas, as late as August. Mating is triggered by longer daylight, and this begins two months before birthing."}]