[{"url": "https://en.wikipedia.org/wiki/Cautionary_tale", "passage_text": "A cautionary tale is a tale told in folklore, to warn its hearer of a danger. There are three essential parts to a cautionary tale, though they can be introduced in a large variety of ways. First, a taboo or prohibition is stated: some act, location, or thing is said to be dangerous. Then, the narrative itself is told: someone disregarded the warning and performed the forbidden act. The narrator of a cautionary tale is momentarily excused from the ordinary demands of etiquette that discourages the use of gruesome or disgusting imagery because the tale serves to reinforce some other social taboo."}, {"url": "http://www.definitions.net/definition/cautionary%20tale", "passage_text": "Cautionary tale. A cautionary tale is a tale told in folklore, to warn its hearer of a danger. There are three essential parts to a cautionary tale, though they can be introduced in a large variety of ways. First, a taboo or prohibition is stated: some act, location, or thing is said to be dangerous. Then, the narrative itself is told: someone disregarded the warning and performed the forbidden act"}, {"url": "http://urbanlegends.about.com/od/glossary/g/cautionary_tale.htm", "passage_text": "Definition: A traditional narrative (e.g., a fable, proverb, or urban legend) with a moral message warning of the consequences of certain actions, inactions, or character flaws. Also Known As: moral tale. Examples: King Midas is a cautionary tale demonstrating the pitfalls of unbridled greed. "}, {"url": "http://www.wisegeek.com/what-is-a-cautionary-tale.htm", "passage_text": "Most cautionary tales come in three sections. In the first part, a boundary or taboo is established, often in the form of advice from an older person to a younger person. In the second section, the taboo is violated, and in the third, the repercussions arrive. Many cautionary tales in the form of fairy tales and folk tales are quite gruesome, this one is milder, but still teaches a good lesson to us all. Most adults have heard this one."}, {"url": "https://en.wikipedia.org/wiki/Cautionary_tale", "passage_text": "Cautionary tales are ubiquitous in popular culture; many urban legends are framed as cautionary tales: from the lover's lane haunted by a hook-handed murderer to the tale of a man who shot a cactus for fun only to die when the plant toppled onto him. The narrator of a cautionary tale is momentarily excused from the ordinary demands of etiquette that discourages the use of gruesome or disgusting imagery because the tale serves to reinforce some other social taboo."}, {"url": "https://en.wikipedia.org/wiki/Knuffle_Bunny", "passage_text": "Knuffle Bunny: A Cautionary Tale is a children's picture book by Mo Willems. Released by Hyperion Books in 2004, an illustrated version of the book won the 2005 Caldecott Honor. The story also spawned an animated short, which won the Carnegie Medal for Excellence in Children's Video in 2007. In August 2007, the sequel, Knuffle Bunny Too: A Case of Mistaken Identity was published."}, {"url": "http://www.jointcommission.org/multimedia/dr-chassin-keynote-hro-conference/", "passage_text": "Health care and high reliability: a cautionary tale. Joint Commission President Mark R. Chassin, M.D., FACP, M.P.P., M.P.H., discusses how far away health care is from high reliability and The Joint Commission's efforts to accelerate high reliability. "}, {"url": "http://www.wisegeek.com/what-is-a-cautionary-tale.htm", "passage_text": "Adorable animal families that will make you aww. A cautionary tale is a story which is contains a warning. Such tales are part of many societies, and they are often told to children, establishing taboos which are designed to keep them safe from dangerous activities. Many cautionary tales in the form of fairy tales and folk tales are quite gruesome, this one is milder, but still teaches a good lesson to us all. Most adults have heard this one."}]