[{"url": "http://www.answers.com/Q/Why_was_the_Battle_of_Antietam_fought", "passage_text": "The Battle of Antietam (also known as the Battle of Sharpsburg, particularly in the South), fought on September 17, 1862, near Sharpsburg, Maryland, as part of the Maryland Campaign, was the first major battle in the American Civil War to take place on Northern soil. The Battle of Antietam was a battle fought during the US Civil War. It saw General Robert E. Lee's Army of Northern Virginia fighting against the Union Army of the Potomac com … manded by Major General George B. McClellan."}, {"url": "http://www.mycivilwar.com/battles/620916.html", "passage_text": "The Battle of Antietam, also known as the Battle of Sharpsburg, was the first major battle in the Civil War to take place on Northern soil. It was also the bloodiest single-day battle, as far as casualties, in American history. "}, {"url": "http://www.gilderlehrman.org/history-by-era/american-civil-war/essays/battle-antietam-turning-point-civil-war", "passage_text": "Four days after the battle of Antietam, which took place near Sharpsburg, Maryland, on September 17, 1862, Captain Robert Gould Shaw of the 2nd Massachusetts Volunteer Infantry wrote to his father: “Every battle makes me wish more and more that the war was over. "}, {"url": "http://www.answers.com/Q/Why_did_the_Battle_of_Antietam_happen_were_it_happen", "passage_text": "It was told that the Antietam battle was the most bloodiest battle in military history. The Battle of Antietam, or Sharpsburg was fought September 17, 1862. The Battle of Antietam happened on September 17, 1862. It was one of the first Civil War battles to occur in the north-and also one of the deadliest. Nearly 23,000 people were killed, the highest death-toll for any single-day battle in U.S. history. September 17,1862 at approximately 6 in the morning. The Battle of Antietam was a battle fought during the US Civil War. It saw General Robert E. Lee's Army of Northern Virginia fighting against the Union Army of the Potomac com … manded by Major General George B. McClellan."}, {"url": "http://kms.kapalama.ksbe.edu/projects/2002/civilwar/battle13/historian.html", "passage_text": "There were two important generals in the Battle of Antietam. One general was General Robert E. Lee. Robert E. Lee was the general for the confederates in this battle because he could not go against his home state and his family. In this battle the Union Army won. We know this because Lee started the retreat back to the Potomac River. When this battle ended it changed the course of the war, now the war was not only to support the Union, it also wanted to free the slaves."}, {"url": "http://www.ducksters.com/history/civil_war/battle_of_antietam.php", "passage_text": "The Battle of Antietam was fought on September 17, 1862 between the Union and the Confederacy during the Civil War. It took place near Sharpsburg, Maryland. The Southern forces were led by General Robert E. Lee and the Northern forces were led by General George B. McClellan. General Robert E. Lee Goes on the Offensive. "}, {"url": "http://www.answers.com/Q/Why_was_the_Battle_of_Antietam_fought", "passage_text": "In casualties, the worst single-day battle in American history. 1862 September 17, 1862 The battle of the Antietam war took place on … September 16-17 1862. The battle lasted three days. It was told that the Antietam battle was the most bloodiest battle in military history. The Battle of Antietam, or Sharpsburg was fought September 17, 1862. The Battle of Antietam happened on September 17, 1862. It was one of the first Civil War battles to occur in the north-and also one of the deadliest. Nearly 23,000 people were killed, the highest death-toll for any single-day battle in U.S. history. The Battle of Antietam was a battle fought during the US Civil War. It saw General Robert E. Lee's Army of Northern Virginia fighting against the Union Army of the Potomac com … manded by Major General George B. McClellan."}, {"url": "http://www.answers.com/Q/Why_did_the_Battle_of_Antietam_happen_were_it_happen", "passage_text": "It was fought on September 17, 1862. In casualties, the worst single-day battle in American history. 1862 September 17, 1862 The battle of the Antietam war took place on … September 16-17 1862. The battle lasted three days. The Battle of Antietam was a battle fought during the US Civil War. It saw General Robert E. Lee's Army of Northern Virginia fighting against the Union Army of the Potomac com … manded by Major General George B. McClellan."}, {"url": "http://www.history.com/this-day-in-history/battle-of-antietam", "passage_text": "Rebels and Yankees clash at the Battle of Antietam. On this day in 1862, at the Battle of Antietam, Confederate General Robert E. Lee’s Army of Northern Virginia and Union General George B. McClellan’s Army of the Potomac fight to a standstill along a Maryland creek on the bloodiest day in American history. Although the battle was a tactical... Read More. Beginning early on the morning of this day in 1862, Confederate and Union troops in the Civil War clash near Maryland’s Antietam Creek in the bloodiest one-day battle"}]