[{"url": "http://study.com/what_does_an_executive_assistant_do.html", "passage_text": "Essential Information. Executive assistants provide high-level administrative support to executives in a company or corporation. Like secretaries or personal assistants, they conduct clerical work. However, executive assistants also perform duties that can have an effect on the success or profitability of a business, such as helping with marketing research, training staff and scheduling important meetings."}, {"url": "http://www.wikihow.com/Become-an-Executive-Administrative-Assistant", "passage_text": "The role of an executive administrative assistant is to serve as the right hand to the executive he or she is supporting. The job duties can include anything from managing correspondence and schedules to managing complex projects and meetings on behalf of the executive. "}, {"url": "http://www.businessdictionary.com/definition/executive-assistant.html", "passage_text": "In addition, the executive assistant will also perform similar responsibilities as an administrative assistant, involving research, communications, correspondence, and office management. In some organizations, the executive assistant will attend meetings or conferences in place of the executive. The difference between a competent administrative assistant and a stellar executive assistant has been said to be approximately a three inch higher skirt hemline. 2 people found this helpful. I got a phone call today from the boss and he told me that I had been promoted to executive assistant, which was great."}, {"url": "http://www.snagajob.com/job-descriptions/administrative-assistant/", "passage_text": "The average hourly pay for all administrative assistant roles is around $20 per hour, but will vary by experience and location. Skill level is the biggest differentiator in pay. Those in secretarial and office support roles usually make around $13 per hour, whereas executive assistants can make upwards of $30 per hour. "}, {"url": "http://study.com/what_does_an_executive_assistant_do.html", "passage_text": "Executive assistants are usually required to hold a degree in either general business or the field in which they work; for example, an executive assistant to a financial officer might hold a bachelor's degree in finance. Like secretaries or personal assistants, they conduct clerical work. However, executive assistants also perform duties that can have an effect on the success or profitability of a business, such as helping with marketing research, training staff and scheduling important meetings."}, {"url": "http://www.wisegeek.com/what-does-an-executive-assistant-do.htm", "passage_text": "An executive assistant devotes his or her career to aiding a corporate official, usually by providing a combination of professional advice and administrative support. Many of an executive assistant’s day-to-day tasks are clerical in nature. Assistants are usually responsible for handling their superior’s paperwork. This includes mail, inter-office correspondences, and basic filing."}, {"url": "https://en.wikipedia.org/wiki/Administrative_Assistant", "passage_text": "For U.S. military staff title, see Chief of staff. Administrative Assistant is a broad job category that designates an individual who provides various kinds of administrative support to people and groups in business enterprises. Job Duties Administrative assistants perform clerical duties in nearly every industry. Some administrative assistants, like those in the legal industry, may be more specialized than others. Most administrative assistant duties revolve around managing and distributing information within an office."}, {"url": "http://www.businessdictionary.com/definition/executive-assistant.html", "passage_text": "The executive assistant was very helpful in administering the training materials needed for the group of new hires this week. 7 people found this helpful. The difference between a competent administrative assistant and a stellar executive assistant has been said to be approximately a three inch higher skirt hemline. 2 people found this helpful. I got a phone call today from the boss and he told me that I had been promoted to executive assistant, which was great."}, {"url": "http://money.usnews.com/careers/best-jobs/executive-assistant", "passage_text": "The Bureau of Labor Statistics projects this profession will lose 10,500 jobs, or decline by 1 percent, by the year 2022. This is largely due to companies replacing executive assistants with administrative assistants, who earn an average of $17,870 less per year and may support more than one manager in an organization. "}, {"url": "http://study.com/what_does_an_executive_assistant_do.html", "passage_text": "In many aspects, the role of executive assistant is similar to that of secretary or administrative assistant. They perform clerical tasks, like accepting and making phone calls, setting business meeting agendas, sending memos, accepting visitors, reviewing incoming reports and setting the executive's daily schedule. Like secretaries or personal assistants, they conduct clerical work. However, executive assistants also perform duties that can have an effect on the success or profitability of a business, such as helping with marketing research, training staff and scheduling important meetings."}]