[{"url": "http://www.foodbycountry.com/Spain-to-Zimbabwe-Cumulative-Index/United-States-African-Americans.html", "passage_text": "It is tradition for African Americans to eat a lot of food for breakfast. They may eat chicken, waffles, grits (dried and boiled grains from corn), ham, corn fritters, and bacon. Traditionally in the South, a Sunday breakfast includes fried apples, grits, and pork sausage."}, {"url": "http://www.africanfoods.co.uk/african-food.html", "passage_text": "About African Food. See the list of traditional African food and what they eat both in Africa and beyond. Also see why African cuisines offer many health benefits and where to shop for such foods. We would also provide you with some African breakfast, Lunch and Dinner ideas as well as African Desserts."}, {"url": "http://www.ehow.com/facts_5575439_type-do-people-eat-africa.html", "passage_text": "Throughout most of the continent, African food is heavily based in starch. Common African starches include sorghum, ground millet, cornmeal, potatoes, yams and rice. Stews are a popular form of preparation, often containing hot spices."}, {"url": "http://www.foodbycountry.com/Spain-to-Zimbabwe-Cumulative-Index/United-States-African-Americans.html", "passage_text": "Sweet potatoes and yams have been a large part of African Americans' diet since African slaves brought them to the United States in the 1600s. Eating cornbread and grits (dried and boiled grains from corn) are also. traditions, as well as sweetening dishes and drinks with molasses."}, {"url": "http://www.york.cuny.edu/academics/writing-program/the-york-scholar-1/volume-5.2-spring-2009/can-the-african-american-diet-be-made-healthier-without-giving-up-culture", "passage_text": "The reason why a lot of African-Americans serve the typical soul food is that they want to be considered good hosts or hostesses, and social graces prevent guests from asking for healthier foods. In addition, many friends and relatives are resistant to eating healthier types of soul food."}, {"url": "http://www.foodbycountry.com/Spain-to-Zimbabwe-Cumulative-Index/United-States-African-Americans.html", "passage_text": "2 HISTORY AND FOOD. In the 1600s, African slaves were brought to the United States, along with their food and styles of cooking. They brought okra, sesame seeds, peanuts, black-eyed peas, and rice. Using these foods, they introduced new recipes to the existing American dishes."}, {"url": "http://www.york.cuny.edu/academics/writing-program/the-york-scholar-1/volume-5.2-spring-2009/can-the-african-american-diet-be-made-healthier-without-giving-up-culture", "passage_text": "A type of cuisine called soul food is very popular among African-Americans, especially the ones who live in the South. It is more than just a type of cuisine. It signifies the history of African-Americans in America and is seen as an integral part of Black culture."}, {"url": "http://www.africanfoods.co.uk/african-food.html", "passage_text": "See the list of traditional African food and what they eat both in Africa and beyond. Also see why African cuisines offer many health benefits and where to shop for such foods."}, {"url": "http://www.answers.com/Q/What_do_African_Americans_eat", "passage_text": "Most African Americans eat food of their region and area, and food they've grown to love just like most Americans do. However, there are always those who may have eating disor … ders and refuse to eat anything."}]