[{"url": "http://ghr.nlm.nih.gov/gene/SRY", "passage_text": "The SRY gene is found on the Y chromosome. The sex-determining region Y protein produced from this gene acts as a transcription factor, which means it attaches (binds) to specific regions of DNA and helps control the activity of particular genes. "}, {"url": "http://ghr.nlm.nih.gov/handbook/howgeneswork/makingprotein", "passage_text": "Most genes contain the information needed to make functional molecules called proteins. (A few genes produce other molecules that help the cell assemble proteins.) The journey from gene to protein is complex and tightly controlled within each cell. It consists of two major steps: transcription and translation. Together, transcription and translation are known as gene expression. Translation, the second step in getting from a gene to a protein, takes place in the cytoplasm. The mRNA interacts with a specialized complex called a ribosome, which “reads” the sequence of mRNA bases."}, {"url": "http://www.bbc.co.uk/schools/gcsebitesize/science/add_edexcel/cells/synthesisrev1.shtml", "passage_text": "Genes are sections of the DNA. Each gene has the code for creating a specific protein. The sequence of bases in the gene controls which amino acids are created and joined to make a specific new protein (or enzyme) molecule. 1 Amino acids are made in the number and order dictated by the number and order of base triplets. 2  Finally, the amino acid molecules join together in a long chain to make a protein molecule. 3  The number and sequence of amino acids determines which protein results."}, {"url": "http://www.nature.com/scitable/topic/proteins-and-gene-expression-14122688", "passage_text": "Editor(s): Laura Vargas-Parada |. Subscribe. Through a cell biology lens, the study of gene expression is tightly linked to our understanding of proteins. Since the early work of Christian Anfinsen in the 1950s, we know that the sequence of amino acids in a protein determines its final three-dimensional structure. Following from that, scientists have repeatedly observed that protein structure dictates where it will act and what it will do."}, {"url": "https://en.wikipedia.org/wiki/Testis_determining_factor", "passage_text": "Testis-determining factor (TDF), also known as sex-determining region Y (SRY) protein, is a DNA-binding protein (also known as gene-regulatory protein/transcription factor) encoded by the SRY gene that is responsible for the initiation of male sex determination in humans. "}, {"url": "http://www2.le.ac.uk/departments/genetics/vgec/schoolscolleges/topics/geneexpression-regulation", "passage_text": "Gene expression. Gene expression is the process by which the genetic code-the nucleotide sequence-of a gene is used to direct protein synthesis and produce the structures of the cell. Genes that code for amino acid sequences are known as 'structural genes'. The process of gene expression involves two main stages: "}, {"url": "http://www.answers.com/Q/Genes_determine_what_in_a_protein", "passage_text": "Yes. A protein produced by multiple genes are cased by fusion genes. Usually a protein is translated from a mRNA which is transcribed from a DNA. After transcription, RNA is … rearranged by so-called RNA splicing in which some of short sequences are selected(Exon) or deleted(Intron). During the splicing two different genes can join together and it is called trans-splicing."}, {"url": "http://www.bioinformatics.org/tutorial/1-1.html", "passage_text": "The gene's sequence is like language that instructs cell to manufacture a particular protein. An intermediate language, encoded in the sequence of Ribonucleic Acid (RNA), translates a gene's message into a protein's amino acid sequence. It is the protein that determines the trait. This is called central dogma of life. Fig 1.a.2 Central dogma of life. Notes: Genes are DNA sequences instruct cells to produce particular proteins, which in turn determine traits. "}, {"url": "https://en.wikipedia.org/wiki/Protiens", "passage_text": "The sequence of amino acid residues in a protein is defined by the sequence of a gene, which is encoded in the genetic code. In general, the genetic code specifies 20 standard amino acids; however, in certain organisms the genetic code can include selenocysteine and—in certain archaea — pyrrolysine. The size of a synthesized protein can be measured by the number of amino acids it contains and by its total molecular mass, which is normally reported in units of daltons (synonymous with atomic mass units), or the derivative unit kilodalton (kDa). Yeast proteins are on average 466 amino acids long and 53 kDa in mass."}]