[{"url": "http://www.homeadvisorhomesource.com/winter-roof-damage-how-much-does-it-cost-to-repair-a-roof/", "passage_text": "A complete re-roof, meaning tearing off the old roof and replacing it with a new one, can range in cost from $4,000 up to $20,000 or more. Minor roof repairs, such as patching up a small leak on asphalt shingle roofs, typically runs $100 to $300."}, {"url": "http://www.costowl.com/home-improvement/roof-repair-cost.html", "passage_text": "Roof Repair Average Costs. The actual cost of roof repair may vary depending on your location, the type of roof, the nature of the repair, the individual contractor, and other factors. 1  Basic roofing repairs, such as replacing 1 square (10 feet x 10 feet) of asphalt or wood shingles, might cost $250 to $1,000."}, {"url": "http://www.howmuchisit.org/repairing-a-leaky-roof-cost/", "passage_text": "1 A square area of asphalt shingles could cost anywhere from $75 to $400 while wooden shingles can cost upwards of $500 to fix. 2  According to the site CoolFlatRoof.com, the price for repairing a roof ranges anywhere from $300 to $500 depending on the size of the roof."}, {"url": "http://www.roof101.com/cost-of-roof-repair.php", "passage_text": "Roof Repair Leak. If you have a leak coming through your chimney or skylight you will need to replace the metal or vinyl flashing which seals the edges. Expect to pay between $300-$400 for the materials for this type of repair and $100-$200 for labor."}, {"url": "http://home.costhelper.com/roof-repair.html", "passage_text": "1 Repairing a 10x10-foot square of asphalt shingles, considered one square of roofing, runs $100-$350 using a roofing company. 2  Repairing a few missing or broken asphalt shingles through a handyman service runs $95-$127. 3  Reparing wooden shingles using a roofing company for a 10x10-foot square costs $210-$1,000."}, {"url": "http://home.costhelper.com/roof-repair.html", "passage_text": "1 When the vinyl or metal flashing that seals the edge of a skylight to the roofing material tears or is pulled away from the skylight, a leak will appear and costs $300-$500 to repair."}, {"url": "http://www.improvenet.com/r/costs-and-prices/roof-repair-estimates", "passage_text": "The size of a roof is one of the most important cost-determining factors. Although some people only pay around $600 for small repairs, other homeowners have spent over $3,000. This range of prices makes sense considering that some roof leaks and shingle loss issues are more widespread than others."}, {"url": "http://www.howmuchisit.org/repairing-a-leaky-roof-cost/", "passage_text": "1 According to the site CoolFlatRoof.com, the price for repairing a roof ranges anywhere from $300 to $500 depending on the size of the roof. 2  A company such as RoofRepairGuys.com offers professional roof repair that can start at $199 to $400."}, {"url": "http://www.homeadvisorhomesource.com/winter-roof-damage-how-much-does-it-cost-to-repair-a-roof/", "passage_text": "A minor repair on less than a 5 square (50 square feet) area of the roof will typically cost less than $1,000, even as little as $100. Larger repairs, or slate and metal roof repairs, may cost $1,000 to $2,000."}]