[{"url": "http://geology.com/rocks/obsidian.shtml", "passage_text": "Obsidian is an igneous rock that forms when molten rock material cools so rapidly that atoms are unable to arrange themselves into a crystalline structure. It is an amorphous material known as a  mineraloid .. "}, {"url": "http://www.cosee-west.org/LACSSP%20Lesson%20Plans/files/Grade%204%20Lessons/The%20Rock%20Journey%20Lesson%20Grade%204/Lesson%20Plan-Rock%20Journey%20Gr%203.docx", "passage_text": "2. Yes, this happens in real life, that is, rocks do get stuck in the rock cycle. Not all rocks go through the complete cycle as depicted in our textbooks. Some rocks stay in a sedimentary layer for millions and millions of years without any changes happening to them. "}, {"url": "https://answers.yahoo.com/question/index?qid=20091229174424AAecHIf", "passage_text": "Best Answer: Obsidian can be broken down into smaller fragments by mechanical weathering, and those fragments can become part of the sedimentary rocks, sandstone and conglomerate. It is subject to chemical weathering that dissolves it and carries the solutions into the sea where they add to the general sea water. The rock cycle is really really simple. There are three types of rocks. Any of the three can turn into any of the other two types, but it takes a combination of some or all of the following: time, erosion, compaction, lithification, melting, or partial melting. Marty · 6 years ago."}, {"url": "https://en.wikipedia.org/wiki/Rock_cycle", "passage_text": "An igneous rock such as basalt may break down and dissolve when exposed to the atmosphere, or melt as it is subducted under a continent. Due to the driving forces of the rock cycle, plate tectonics and the water cycle, rocks do not remain in equilibrium and are forced to change as they encounter new environments."}, {"url": "http://imnh.isu.edu/digitalatlas/geo/basics/diagrams.htm", "passage_text": "Like most Earth materials, rocks are created and destroyed in cycles. The rock cycle is a model that describes the formation, breakdown, and reformation of a rock as a result of sedimentary, igneous, and metamorphic processes. All rocks are made up of minerals. "}, {"url": "http://www.hometrainingtools.com/a/rock-cycle-teaching-tip/", "passage_text": "But rocks are not unchangeable! Just like the water cycle, rocks undergo changes of form in a rock cycle. A metamorphic rock can become an igneous rock, or a sedimentary rock can become a metamorphic one. Unlike the water cycle, you can't see the process happening on a day-to-day basis."}, {"url": "https://answers.yahoo.com/question/index?qid=20091229174424AAecHIf", "passage_text": "Report Abuse. Obsidian is an igneous rock. Any and all igneous rocks can turn into any and all metamorphic or sedimentary rocks. Obviously what it will 'turn into' down the line is dependent on it's location and the environment at that location, but location and environment are never permanent. The midwest used to be a huge ocean, etc. The rock cycle is really really simple. There are three types of rocks. Any of the three can turn into any of the other two types, but it takes a combination of some or all of the following: time, erosion, compaction, lithification, melting, or partial melting. Marty · 6 years ago."}, {"url": "http://geography.about.com/cs/physicalgeography1/a/rockcycle.htm", "passage_text": "The Rock Cycle. We know that all three rock types can be turned into metamorphic rocks but all three types can also be changed through the rock cycle. All rocks can be weathered and eroded into sediments, which can then form sedimentary rock. Rocks can also be completely melted into magma and become reincarnated as igneous rock. The magma that forms igneous rock beneath the surface of the earth can take thousands of years to cool. Quickly cooling rock, often extrusive lava that comes from volcanoes or fissures in the Earth's surface has small crystals and may be quite smooth, such as the volcanic obsidian rock."}]