[{"url": "http://www.wikihow.com/Calculate-Your-Car%27s-Fuel-Efficiency-%28MPG%29", "passage_text": "1 O = 5÷4.5; O=1.11. 2  To get your actual mileage for your MPG formula, you would subtract Mileage A from Mileage B as normal, then multiply the result by 1.11 before finishing your MPG calculation. 3  If Mileage B-Mileage A = 100, multiply by O (1.11). 4  In this example, you actually traveled 111 miles."}, {"url": "http://inflationdata.com/articles/cost-of-living/cost-of-gas/calculating-miles-per-gallon/", "passage_text": "The formula for calculating Miles Per Gallon is simply miles driven divided by gallons used. So to calculate the miles driven you take the miles at the end of the tank and subtract the Miles at the start of the tank, and then you divide that by the total gallons of gas used."}, {"url": "https://answers.yahoo.com/question/index?qid=20090802163622AAg9oVw", "passage_text": "If your vehicle averages 22 miles per gallon and has a 30 gallon tank, then you can go 660 miles. 22 x 30 = 660 Or to find out how many gallons you will need for the whole trip. 1029 divided by 22 = 42.220 gallons Hope this helps."}, {"url": "http://datagenetics.com/blog/april12014/index.html", "passage_text": "If your car does 20 MPG, then to travel 1,000 miles you will need 50 gallons of fuel. If your car does 25 MPG, then to travel 1,000 miles you will need 40 gallons of fuel. If your car does 100 MPG, then to travel 1,000 miles you will need 1"}, {"url": "http://www.math.com/everyone/calculators/calc_source/miles-per-gallon.htm", "passage_text": "Miles per Gallon Computes the miles per gallon of your car via the miles traveled and the number of gallons used. Also, if you enter the cost per gallon and how many miles you drive a day, it will estimate your monthly and yearly gas expenses. Miles Driven:"}, {"url": "http://www.answers.com/Q/How_many_miles_per_gallon_do_semi-trucks_get", "passage_text": "According to the Elmo Kandel, Editor and Publisher of Article Click, a highly efficient semi-truck will get 6 to 8 miles per gallon. Fuel mileage will vary greatly based on the weight of the truck and payload and environmental factors such as wind and grade."}, {"url": "http://inflationdata.com/articles/cost-of-living/cost-of-gas/calculating-miles-per-gallon/", "passage_text": "Once you know your average miles per gallon (mpg), you can use our Cost of Gas per Month calculator to estimate how much you are spending on gasoline in an average month from this it will estimate your average cost of gas per year as well."}]