[{"url": "http://texasahead.org/lga/courtcosts07/96-865.pdf", "passage_text": "A defendant convicted of a felony or misdemeanor shall pay $50 for a law enforcement agency’s execution of an issued arrest warrant, capias or capias pro fine, if the agency requests the court, not later than the 15th day after the date of execution, to impose the fee. of a fine and cost in the manner the court orders. Of each of these fees, $20 must be sent to the Comptroller on or before the last day of each calendar quarter and $10 must be deposited to the credit of the general fund of the municipality or county."}, {"url": "http://www.opd.wa.gov/documents/0307-2014_HJ-MisdemeanorWorkgroupReport.pdf", "passage_text": "Based on information collected by OPD, the estimated total that counties pay for all public defense costs is $123,941,336. State funding provided through Chapter 10.101 RCW accounts for 4.4% of those expenses. The overall estimated cost of public defense in both municipal and county courts is $152,096,788. The average per-case amount spent in cities that do not have or use public defense agencies is $209. Based on this information, the workgroup estimates The approximate statewide cost of misdemeanor public defense services in 2013, prior to mandatory caseload $51,155,452."}, {"url": "http://the3rdjudicialdistrict.com/chmisd.htm", "passage_text": "There are three general types of offenses: felonies (which can be subject to term in a state prison), misdemeanors (which can be subject to up to one year in a county jail), and infractions (which can be subject to a fine up to $100.00, plus court costs). Procedures for the different categories are somewhat different. The citation or complaint includes a short statement of the offense with which you are charged, and states that the offense is a misdemeanor. The citation or summons states a date and time to appear at the county courthouse for your initial appearance."}, {"url": "http://texasahead.org/lga/courtcosts07/96-865.pdf", "passage_text": "$25 from a person who pays any part of a fine, court cost or restitution on or after the 31st day after judgment is entered. One-half ($12.50) is sent to the state, one-tenth ($2.50) is retained locally for judicial efficiency, and four-tenths ($10) is retained locally with no restrictions. of a fine and cost in the manner the court orders. Of each of these fees, $20 must be sent to the Comptroller on or before the last day of each calendar quarter and $10 must be deposited to the credit of the general fund of the municipality or county."}, {"url": "http://www.opd.wa.gov/documents/0307-2014_HJ-MisdemeanorWorkgroupReport.pdf", "passage_text": "At current funding levels, this amounts to approximately $600,000 for cities and $5,400,000 for counties. The county portion is used for multiple case types, not just misdemeanors. With the exception of these state funds, the cost of trial-level public defense in criminal cases is borne by the cities and counties. The average per-case amount spent in cities that do not have or use public defense agencies is $209. Based on this information, the workgroup estimates The approximate statewide cost of misdemeanor public defense services in 2013, prior to mandatory caseload $51,155,452."}, {"url": "http://lao.ca.gov/reports/2013/crim/criminal-justice-primer/criminal-justice-primer-011713.aspx", "passage_text": "1 Felony and juvenile delinquency cases average much higher costs than other case types. 2  The average cost was roughly $2,600 for felony cases and $980 for juvenile delinquency cases. 3  In contrast, the average cost per case was estimated to be roughly $380 for a misdemeanor and $35 for an infraction. In January 2007, our office released the first edition of California’s Criminal Justice System: A Primer to provide the public, media, and policymakers some basic information on the state’s criminal justice system, caseloads, costs, trends, and outcomes."}, {"url": "http://texasahead.org/lga/courtcosts07/96-865.pdf", "passage_text": "The court may charge the defendant the $10 fee established by Sec. 521.048, Transportation Code, and the TexasOnline Fee that is currently $2, for a total of $12. The custodian of the county treasury must forward the entire amount of the fees collected to the Comptroller. of a fine and cost in the manner the court orders. Of each of these fees, $20 must be sent to the Comptroller on or before the last day of each calendar quarter and $10 must be deposited to the credit of the general fund of the municipality or county."}, {"url": "http://the3rdjudicialdistrict.com/chmisd.htm", "passage_text": "An FTA is a misdemeanor, punishable by up to six months in jail and/or a fine of up to $300, plus court costs. If you are charged with an FTA, the court is likely to issue a warrant for your arrest. The citation or complaint includes a short statement of the offense with which you are charged, and states that the offense is a misdemeanor. The citation or summons states a date and time to appear at the county courthouse for your initial appearance."}, {"url": "http://personalfinance.costhelper.com/expungement.html", "passage_text": "1 Court costs and filing fees can add another $100-$400 or more, depending on location and how much other paperwork or research is needed. 2  It's possible to handle the expungement process yourself, but it's important to be sure every phase is completed correctly. "}, {"url": "http://www.the3rdjudicialdistrict.com/mcharged.htm", "passage_text": "Next are misdemeanors, the penalty for which can include up to one year in a county jail. The least serious are infractions (mostly traffic offenses), for which the maximum penalty does not exceed a $100.00 fine plus court costs. Procedures for different categories of offenses are somewhat different. If you are charged with an FTA, the court is likely to issue a warrant for your arrest. If you fail to appear for proceedings scheduled by the court after your initial appearance"}]