[{"url": "http://www.answers.com/Q/What_age_should_you_slaughter_chicken", "passage_text": "Most chickens are slaughtered for consumption at between 30 days and 6 months of age. The chickens a … re usually between 4 and 5 pounds by this age and marketed as a Fryer or Broiler. This is when the meat is the most tender. Exceptions to this are chickens marketed as Cornish Game Hens which may be as young as 25 days old, Roasting chickens which are slightly over 6 months, and spent layers which are usually slaughtered at one or two years of age."}, {"url": "http://www.answers.com/Q/How_old_are_chickens_when_slaughtered", "passage_text": "Exceptions to this are chickens marketed as Cornish Game Hens which may be as young as 25 days old, Roasting chickens which are slightly over 6 months, and spent layers which are usually slaughtered at one or two years of age."}, {"url": "http://www.answers.com/Q/How_old_are_chickens_when_slaughtered", "passage_text": "Chickens are very fast growing and sexually mature by the age of 6 months. Most chickens are slaughtered for consumption at between 30 days and 6 months of age. The chickens are usually between 4 and 5 pounds by this age and marketed as a Fryer or Broiler. This is when the meat is the most tender."}, {"url": "http://www.answers.com/Q/What_age_should_you_slaughter_chicken", "passage_text": "Chickens are very fast growing and sexually mature by the age of 6 months. Most chickens are slaughtered for consumption at between 30 days and 6 months of age. The chickens a … re usually between 4 and 5 pounds by this age and marketed as a Fryer or Broiler. This is when the meat is the most tender. Exceptions to this are chickens marketed as Cornish Game Hens which may be as young as 25 days old, Roasting chickens which are slightly over 6 months, and spent layers which are usually slaughtered at one or two years of age."}, {"url": "https://www.facebook.com/notes/colleen-patrick-goudreau-vegan-author-and-speaker/slaughter-age-vs-natural-life-span/10150737529419057", "passage_text": "Pigs: Slaughtered at 6 months young; Natural life span: 6 to 10 years. Chickens: Slaughtered at 6 weeks young; Natural life span: 5 to 8 years for those birds bred as egg layers such as Rhode Island Reds; 1 to 4 years for factory layer breeds such as leghorns; and 1 to 3 years for meat breeds."}]