[{"url": "http://www.answers.com/Q/Is_dexedrine_a_narcotic", "passage_text": "It is perhaps the archetypal euphoric stimulant, and drugs with similar psychoactive properties are often referred to as amphetamine analogues, or described as having amphetamine-like effects.     Both dopamine and norepinephrine are significant in dextroamphetamine's mechanism of action. Dexedrine is a stimulant for a person with a normal metabolism.   However if Dexedrine is given to a person with ADHD it may slow down their system so they can focus and co … mplete tasks. found this useful."}, {"url": "http://adhd.emedtv.com/dexedrine/dexedrine-a-controlled-substance.html", "passage_text": "Dexedrine ® (dextroamphetamine sulfate) is a prescription medication that is classified as a controlled substance. Controlled substances are medications or drugs that are very habit-forming or are very likely to be abused. Certain prescription medications and most illegal street drugs are controlled substances. Dexedrine, a controlled substance, is a prescription drug used for legitimate medical purposes; unfortunately, it is also"}, {"url": "http://drugs.laws.com/dextroamphetamine", "passage_text": "Because Dextroamphetamine is an amphetamine, the drug is classified under the terms of the Controlled Substances Act of 1970 as a Schedule II drug. Schedule II drugs are regarded as prescription medications that yield a genuine medical benefit, but also pose a high risk for addiction and abuse. Dextroamphetamine is far more potent than racemic amphetamine and has a number of stimulant properties to racemic methamphetamines. Dextroamphetamine is the leading ingredient in the ADHD combatant Adderall, which is composed of racemic "}, {"url": "http://www.everydayhealth.com/drugs/adderall", "passage_text": "A: Adderall (amphetamine/dextroamphetamine) is a medication that is used to treat ADD/ADHD or narcolepsy. It is in the class of medications that are considered stimulants and although it goes against the way you would think a stimulant would work, it calms down the patient with ADD/ADHD. Adderall is an example of a stimulant available as a short-acting and long-acting formulation. Adderall (amphetamine and dextroamphetamine) is a stimulant that affects chemicals in the brain that are associated with hyperactivity and impulse control. Adderall is used in attention deficit hyperactivity disorder (ADHD)."}, {"url": "https://en.wikipedia.org/wiki/Amphetamine", "passage_text": "Amphetamine (contracted from alpha‑methylphenethylamine) is a potent central nervous system (CNS) stimulant that is used in the treatment of attention deficit hyperactivity disorder (ADHD), narcolepsy, and obesity. Amphetamine was discovered in 1887 and exists as two enantiomers: levoamphetamine and dextroamphetamine. "}, {"url": "https://www.pharmacy.texas.gov/consumer/broch2.asp", "passage_text": "1 Schedule II drugs include certain narcotic, stimulant, and depressant drugs. 2  Some examples are morphine, cocaine, oxycodone (Percodan®), methylphenidate (Ritalin®), and dextroamphetamine (Dexedrine®). 3  Schedule III, IV, or V  drugs with an abuse risk less than Schedule II. "}, {"url": "http://www.answers.com/Q/Is_dexedrine_a_narcotic", "passage_text": "Other common names for dextroamphetamine include d-amphetamine, dexamphetamine, (S)-(+)-amphetamine, and brand names such as Dexedrine and Dextrostat.     Dextroamphetamine, commonly abbreviated as d-amphetamine, is the dextrorotary stereoisomer of the amphetamine molecule, which can take two different forms. Dexedrine is a stimulant for a person with a normal metabolism.   However if Dexedrine is given to a person with ADHD it may slow down their system so they can focus and co … mplete tasks. found this useful."}, {"url": "http://www.dexedrineaddiction.com/", "passage_text": "1 Drug Facts. 2  extroamphetamine (Dexedrine) is an amphetamine, belonging to the group of medicines called central nervous system (CNS) stimulants it is a Schedule II controlled substance. 3  Dexedrine is manufactured in orange 5mg, 10mg, 20mg tablets and 5mg, 10mg, and 15mg clear and brown capsules. Dexedrine Addiction. Dexedrine addiction is no different from alcoholism or an addiction to any other substance. However, no one is prescribed alcohol or cocaine for medical reasons. Many individuals who abuse stimulant medication such as Dexedrine find that they become dependent on the drug."}, {"url": "http://adhd.emedtv.com/dexedrine/dexedrine-a-controlled-substance.html", "passage_text": "Dexedrine as a Controlled Substance. Dexedrine, along with most other stimulants, is a Schedule II controlled substance. This means that Dexedrine has a legitimate medical purpose but is very likely to be abused (see Dexedrine Abuse for more information) . Dexedrine, a controlled substance, is a prescription drug used for legitimate medical purposes; unfortunately, it is also likely to be abused."}, {"url": "http://drugs.laws.com/dextroamphetamine", "passage_text": "Dextroamphetamine is a psycho-stimulant drug known to produce increased focus and wakefulness along with a decrease in fatigue and appetite. Dextroamphetamine is far more potent than racemic amphetamine and has a number of stimulant properties to racemic methamphetamines. Dextroamphetamine is the leading ingredient in the ADHD combatant Adderall, which is composed of racemic amphetamines."}]