[{"url": "http://www.nhs.uk/conditions/pregnancy-and-baby/pages/antenatal-midwife-care-pregnant.aspx", "passage_text": "Starting antenatal care. You can book an appointment with your GP or directly with your midwife as soon as you know that you're pregnant. Your GP surgery or a Children’s Centre can put you in touch with your nearest midwifery service. Although your first hospital antenatal appointment may not be until you are around 12 weeks pregnant, telling your GP and/or midwife promptly will help to make sure you receive maternity healthcare that takes into account all your health needs and preferences."}, {"url": "https://www.sharecare.com/health/health-pregnancy/how-often-see-doctor-pregnancy", "passage_text": "A HealthyWomen answered. During pregnancy, you should see your doctor or midwife every four to five weeks until 28 weeks, every two to three weeks from 28 to 36 weeks, and then weekly until you're ready to deliver. Ideally, you should have a pre-conceptual visit with your provider to make sure you are in optimal health before becoming pregnant. But don't worry if you discover you are pregnant before having a chance to meet with your doctor or midwife; these conversations and tests will occur during your first prenatal visit."}, {"url": "http://www.babycentre.co.uk/a536334/your-antenatal-appointments", "passage_text": "If this is the case you will see a doctor and a midwife at your antenatal appointments. You'll probably have most of your check-ups in your community rather than at a hospital (NCCWCH 2008: 69) . These could take place at a community clinic, which may be the same place as your doctor's surgery. You'll probably hear your baby's heartbeat for the first time during your dating scan, which is your first routine antenatal scan. This usually happens when you're between 11 weeks and 13 weeks plus six days pregnant. Your midwife may also let you hear your baby's heart beating during"}, {"url": "http://www.babycentre.co.uk/a1048151/how-to-get-the-best-out-of-your-midwife", "passage_text": "Your midwife is someone you can rely on for support, care and advice during your pregnancy, labour, and after your baby’s birth (NHS Careers 2013) . She can give your partner advice and support, too. Your midwife probably works in a team, and you should be able to contact her, or one of her colleagues, 24 hours a day. "}, {"url": "http://www.babycenter.com/0_what-to-expect-at-your-prenatal-visits_9252.bc", "passage_text": "You'll see a lot of your healthcare practitioner during your pregnancy – that's why it's so important to choose someone you like and trust. Most pregnant women have between ten and 15 prenatal visits. If you have a partner or labor coach, you may want that person to come to some of these appointments with you. Typically, a mom-to-be will visit her doctor or midwife every four weeks during the first and second trimesters. "}, {"url": "http://www.babycentre.co.uk/a536334/your-antenatal-appointments", "passage_text": "You should also be able to discuss your schedule with your midwife or GP. If you have had a previous, uncomplicated pregnancy, you should have seven antenatal appointments. These will be your booking visit and then appointments at about: If you're unhappy about long gaps between visits, talk to your midwife. Your midwife or doctor won't carry out internal examinations during your appointments. From about 24 weeks your midwife will measure your bump with a tape measure, from your pubic bone to the top of your bump (NCCWCH 2008: 275) . The reading should be same as the number of weeks you are pregnant, give or take 2cm or 3cm (about 1in). You'll probably hear your baby's heartbeat for the first time during your dating scan, which is your first routine antenatal scan. This usually happens when you're between 11 weeks and 13 weeks plus six days pregnant. Your midwife may also let you hear your baby's heart beating during your"}, {"url": "http://www.cyh.com/HealthTopics/HealthTopicDetails.aspx?p=438&np=459&id=2758", "passage_text": "Antenatal visits-check-ups during your pregnancy. When you are pregnant, it is important for you to have regular check-ups with a midwife or doctor. These check-ups are called antenatal care or antenatal visits. Antenatal means before birth. A midwife specialises in caring for women during pregnancy, birth and after the birth"}, {"url": "http://www.nhs.uk/Conditions/pregnancy-and-baby/Pages/antenatal-appointment-schedule.aspx", "passage_text": "Media last reviewed: 20/03/2014. Next review due: 20/03/2016. You'll have a number of antenatal appointments during your pregnancy, and you'll see a midwife or sometimes an obstetrician (doctor specialising in pregnancy). You will have an appointment at 40 weeks if this is your first baby. Your midwife or doctor should give you more information about what happens if your pregnancy lasts longer than 41 weeks. Your midwife or doctor should: 1  use a tape measure to measure the size of your uterus."}, {"url": "https://www.sharecare.com/health/health-pregnancy/how-often-see-doctor-pregnancy", "passage_text": "Most women's first prenatal visit occurs between 6 and 8 weeks after the first day of their last menstrual period. As long as your pregnancy is considered low risk and is progressing normally, you will visit your doctor monthly for the first 28 weeks, then every 2 weeks until 36 weeks, and weekly thereafter. Ideally, you should have a pre-conceptual visit with your provider to make sure you are in optimal health before becoming pregnant. But don't worry if you discover you are pregnant before having a chance to meet with your doctor or midwife; these conversations and tests will occur during your first prenatal visit."}]