[{"url": "http://rockhousemethod.blogspot.com/2010/01/how-often-should-you-change-your-guitar.html", "passage_text": "When to change the strings on your guitar, whether it’s electric, acoustic or bass guitar, is a question or a thought that gets tosses around quite a bit. When it comes to changing strings there are a lot of opinions and all kinds of formulas for why and when to change them. 1 Bass guitar strings start at about 10 bucks and I have seen them as much as $99 for a set of 6 strings. 2  Strings for acoustic or electric guitar start at about 2 or 3 bucks and top out at about $30 for a set."}, {"url": "https://answers.yahoo.com/question/index?qid=20080620122213AAAcwNS", "passage_text": "After they break in, you generally don't have to change them until they become hard to keep in tune. Depending on the weight of the strings and how often you play, this can be anywhere from two months to a year. If it's a classical guitar, these timeframes are even shorter, nylon strings stretch much easier than metal strings. Source(s): doumbek · 7 years ago."}, {"url": "http://rockhousemethod.blogspot.com/2010/01/how-often-should-you-change-your-guitar.html", "passage_text": "If you play the guitar Change your strings every. 2 hours every day.............................................................2 to 3 weeks. 30 minutes to 1 hour a day..........................................1 month to 6 weeks. 30 minutes to 1 hour...................................................6 weeks to 2 months. 1 Bass guitar strings start at about 10 bucks and I have seen them as much as $99 for a set of 6 strings. 2  Strings for acoustic or electric guitar start at about 2 or 3 bucks and top out at about $30 for a set."}, {"url": "http://learnguitar2.com/how-often-should-you-change-guitar-strings/", "passage_text": "The former depends on your guitar playing habits. If you’re playing every day for an hour or two then you might want to change the strings as often as once every other week. If you’re a performing artist then don’t ever go on stage without a new set of strings. If you don’t play that often your strings might die of old age. In this case I advise to change them every other month or every three months. Again, if you’re planning on impressing your girlfriend with a nice tune it’ll be nice to have a new set of strings for that too."}, {"url": "http://www.cyberfret.com/guitar-maintenance/changing-electric-guitar-strings/", "passage_text": "You should change your strings at least every 2 or 3 months, but this can vary so much from player to player. Professionals will change strings for every gig. Do not change your strings only if they break. You need to change all of the strings on your guitar at the same time on a regular basis. "}, {"url": "http://www.classicalguitardelcamp.com/viewtopic.php?f=43&t=57055", "passage_text": "In practice I change strings far less often-more like every 4-5 months. Due to being busy all the time with work and family, I feel like any time I get to spend with my guitar is better spent playing than changing strings. I'm sure this has been talked to death on the forum, but as a relatively new member I wanted to know from whoever would like to tell me. Ideally, so says my teacher, one changes the bass strings every three weeks or so, and the treble strings every 4-5 weeks-this is for someone who plays 1-2 hours a day."}, {"url": "http://www.answers.com/Q/How_often_should_you_change_your_guitar_strings", "passage_text": "It depends on how often you play and the environment the guitar is stored in. If you play everyday for a few hours you may need to change them once every 1-2 months. You will notice they lose their shine and maybe get a green nasty film under them. Confidence votes 34. "}, {"url": "http://guitar.about.com/video/How-Often-Should-You-Change-Guitar-Strings-.htm", "passage_text": "A good guideline is: If you play 2-3 hours a day, every day, you should change your strings every 2 to 3 weeks. If you play 30 minutes to an hour every day, you should change your strings every 4 to 6 weeks.If you play 30 minutes to an hour every other day, 6 to 8 weeks. If you play every once in a while, you still should change your strings at least 3 times a year. I’m now going to give you a walk through on how the change a string on this guitar. As you can hear right now it sounds a little dull so were going to change it and you will hear the difference in the tone. Guitar strings need to be changed periodically because oil and dirt from your fingers causes your strings to sound dull. How often you have to change your guitar strings depends on how often you play and humidity levels."}, {"url": "https://answers.yahoo.com/question/index?qid=20070820085528AAPiVqE", "passage_text": "Old guitar strings also break, often during the most inopportune moment. Be sure to head into any live playing situation with new strings on your guitar, and several more sets of strings packed in your case, should you break a string during performance. When I'm playing my acoustic guitar a lot, I'll change the strings at least every two weeks (more than that if I'm using it for gigs). "}]