[{"url": "http://hakank.org/picat/", "passage_text": "1 Constraints: Picat supports constraint programming. 2  Given a set of variables, each of which has a domain of possible values, and a set of constraints that limit the acceptable set of assignments of values to variables, the goal is to find an assignment of values to the variables that satisfies all of the constraints. 1 My CCDC 2014 paper My First Look At Picat as a Modeling Language for Constraint Solving andPlanning (PDF) (based on the blog post A first look at Picat programming language, see above). 2  My Picat talk at SweConsNet 2014, 20140613: Picat-a new logic-based multi-paradigm programming language."}, {"url": "http://picat-lang.org/", "passage_text": "Thank you for your beautiful project! Using Picat, I felt at home almost right away. -- Stefan Kral. The Picat language is really cool; it's a very usable mix of logic, functional, constraint, and imperative programming. Scripts can be made quite short but also easily readable. And the built-in tabling is really cool for speeding up recursive programs. The first line is a table mode declaration that instructs the system about how to table the calls and answers: + means that the argument is tabled, max means that the argument should be maximized, and nt means that the argument is not tabled. This predicate searches for a path with the maximum total sum."}, {"url": "http://www.wisegeek.org/what-is-chicken-piccata.htm", "passage_text": "Chicken piccata or veal piccata is a traditional Italian dish, very often available in Italian restaurants. Piccata translates to piquant or piquancy, which in one definition means tart or zesty. This dish does have a tart sauce, with traditional additions of lemon juice, white wine and capers. The chicken is then dredged in a mixture of flour, salt, and pepper, and the excess flour should be dusted off. In a medium heat pan, the chef should cook the thin slices of chicken very quickly, about a minute to two on each side. Overcooking the meat can ruin the dish."}, {"url": "https://en.wikipedia.org/wiki/Piccata", "passage_text": "Piccata (also picatta, pichotta) is a method of preparing food: meat is sliced, coated, sauteed sautéed and served in a. Sauce the dish originated In italy using (veal veal). Piccata in The United, states the most-well known variant is chicken. piccata Veal piccata (bottom). Piccata (also picatta, pichotta) is a method of preparing food: meat is sliced, coated, sauteed sautéed and served in a. Sauce the dish originated In italy using (veal veal). piccata"}, {"url": "http://picat-lang.org/", "passage_text": "Picat is a simple, and yet powerful, logic-based multi-paradigm programming language aimed for general-purpose applications. Picat is a rule-based language, in which predicates, functions, and actors are defined with pattern-matching rules. The first line is a table mode declaration that instructs the system about how to table the calls and answers: + means that the argument is tabled, max means that the argument should be maximized, and nt means that the argument is not tabled. This predicate searches for a path with the maximum total sum."}, {"url": "https://en.wikipedia.org/wiki/Piccata", "passage_text": "Piccata (also picatta, pichotta) is a method of preparing food: meat is sliced, coated, sauteed sautéed and served in a. Sauce the dish originated In italy using (veal veal). Piccata in The United, states the most-well known variant is chicken. Piccata the recipe has a meatless adaptation using (seitan seitan). piccata Veal piccata (bottom). Piccata (also picatta, pichotta) is a method of preparing food: meat is sliced, coated, sauteed sautéed and served in a. Sauce the dish originated In italy using (veal veal). piccata"}, {"url": "https://en.wikipedia.org/wiki/Piccata", "passage_text": "Veal piccata (bottom). Piccata (also picatta, pichotta) is a method of preparing food: meat is sliced, coated, sauteed sautéed and served in a. sauce Veal piccata (bottom). Piccata (also picatta, pichotta) is a method of preparing food: meat is sliced, coated, sauteed sautéed and served in a. Sauce the dish originated In italy using (veal veal). piccata"}, {"url": "https://en.wikipedia.org/wiki/Plica_syndrome", "passage_text": "Plica syndrome (also known as synovial plica syndrome) is a condition which occurs when a plica (an extension of the protective synovial capsule of the knee) becomes irritated, enlarged, or inflamed. "}, {"url": "http://hakank.org/picat/", "passage_text": "My Picat page. 1  Pattern-matching: A predicate defines a relation, and can have zero, one, or multiple answers. 2  A function is a special kind of a predicate that always succeeds with one answer. 3  Picat is a rule-based language. 4  Predicates and functions are defined with pattern-matching rules. 1 My CCDC 2014 paper My First Look At Picat as a Modeling Language for Constraint Solving andPlanning (PDF) (based on the blog post A first look at Picat programming language, see above). 2  My Picat talk at SweConsNet 2014, 20140613: Picat-a new logic-based multi-paradigm programming language."}]