[{"url": "http://www.babynamespedia.com/meaning/Karlene", "passage_text": "[ 3 syll. kar-le-ne, ka-rl-ene ] The baby girl name Karlene is pronounced as K AA RLiyiyN †. Karlene is a Latvian name of Germanic origin. Karlene is a variant transcription of the name Carly (English). Karlene is also a Latvian variant transcription of the name Caroline (English, French, and Scandinavian). Karlene is also a variant transcription of the name Charlotte (French, German, Dutch, English, and Scandinavian). Karlene is rare as a baby name for girls. "}, {"url": "http://www.sheknows.com/baby-names/name/karlene", "passage_text": "The name Karlene is a Scandinavian baby name. In Scandinavian the meaning of the name Karlene is: Womanly; strength. Feminine of Karl. American Meaning: The name Karlene is an American baby name. In American the meaning of the name Karlene is: Womanly; strength. Feminine of Karl. German Meaning: The name Karlene is a German baby name. In German the meaning of the name Karlene is: Womanly; strength.' Feminine of Karl."}, {"url": "http://www.meaning-of-names.com/german-names/karlene.asp", "passage_text": "Meaning of Karlene. German name. In German, the name Karlene means-womanly.The name Karlene originated as an German name. The name Karlene is most often used as a girl name or female name. German Name Meaning-womanly. "}, {"url": "http://www.ourbabynamer.com/meaning-of-Karlene.html", "passage_text": "Then just follow the diagram below. Just for fun, see the name Karlene in Hieroglyphics, learn about ancient Egyptian Hieroglyphics and write a Hieroglyphic message. Learn about nautical flags and see your name or message written in nautical flags, on the Karlene in Nautical Flags page. English names generally consist of a given name, middle name and family name. Many English speaking countries have fairly flexible naming laws."}, {"url": "http://www.ourbabynamer.com/meaning-of-Karlene.html", "passage_text": "Karlene is generally used as a girl's name. It consists of 7 letters and 2 syllables and is pronounced Kar-lene. In the U.S. in 2014, it ranked 15466 in baby name popularity for girls with 6 occurrences. Less than 5 boys were given the name. English names generally consist of a given name, middle name and family name. Many English speaking countries have fairly flexible naming laws."}, {"url": "http://www.whatisthemeaningofname.com/what-is-the-meaning-of-the-name-karlene-3182/", "passage_text": "Meaning of the name Karlene, analysis of the name Karlene and so much more… What does Karlene mean and its numerology, definition, origin, popularity and very interesting information. Please use the menu below. Quick Menu. 1  Information About The Name Karlene. "}, {"url": "http://www.thinkbabynames.com/meaning/0/Karlene", "passage_text": "Karlene /kar-lene/ [2 sylls.] as a girls' name is of Old German, Latin and English origin, and the name Karlene means free man. Karlene is a version of Carlene (Old German). Karlene is also a variation of Carly (Latin). Karlene is also used as a derivative of Caroline (Old German), Charlotte (Old German), Karleen (English) and Karolina (Slavic, Old German). Kreatif forms: Kerlene."}, {"url": "http://www.sheknows.com/baby-names/name/arlene", "passage_text": "English Meaning: The name Arlene is an English baby name. In English the meaning of the name Arlene is: and Charlene. French Meaning: The name Arlene is a French baby name. In French the meaning of the name Arlene is: Derived from a feminine, meaning manly. A medieval given name. "}]