[{"url": "http://www.ansi.okstate.edu/breeds/goats/angora", "passage_text": "The ears are heavy and drooping. The Angora goat is a small animal as compared to sheep, common goats, or milk goats. There is considerable variation in the size of goats, but mature bucks will usually fall in a weight range of from 180 to 225 pounds but do not reach their maximum weight until after five years of age."}, {"url": "http://www.goatworld.com/articles/allaboutgoats.shtml", "passage_text": "Some Jamnapari males may be as tall as 50 inches at withers. Angora goats weigh between 70 to 110 lb for mature females and are approximately 25 inches tall. Birth weights of female singles are between 3 and 9 lb; twins being often a pound lighter and males 1/2 lb heavier."}, {"url": "http://www.answers.com/Q/What_is_the_Angora_Goat%27s_height", "passage_text": "Making the world better, one answer at a time. The height if an Angora goat varies depending on the goat and their family. Usually, they are between 92 and 122 cm. The females, or nannies, are closer to 92cm usually, while the males, or billies, are usually closer to 122cm."}, {"url": "http://www.hmrpygoras.com/Angora-Pygmy-PygoraComparisions.html", "passage_text": "You have reached the 75% allowable to be a registered Pygora goat. You are no longer able to breed this offspring or their offspring to a 100% Angora until you are under 75% of the parent breed which would be several generations out. So..... do your homework when picking out your Angora goat for breeding!"}, {"url": "http://www.ansi.okstate.edu/breeds/goats/angora", "passage_text": "Shortcomings of the Angora The Angora goat is not as prolific as other goats and twins are not the usual birth. Goats in large range bands will usually kid from 60 to 70 percent, but in well-managed small bands of purebred goats the rate of reproduction may be slightly over 100 percent."}, {"url": "http://www.ansi.okstate.edu/breeds/goats/angora", "passage_text": "The Angora dates back prior to early biblical history. Mention is made of the use of mohair at the time of Moses, which would fix the record of the Angora some time between 1571 and 1451 B.C., according to the Angora Goat Mohair Industry publication from USDA (Miscellaneous Bulletin 50, 1929)."}]