[{"url": "http://www.mymovingreviews.com/move/average-moving-cost", "passage_text": "Based on my experience in the field, packing costs can be similar to the moving cost itself. A 4 bedroom house can take more than 12h to move from one town to another. In this case your average moving costs will be around $1800 to $2500 without including any packing. For example if you’re moving from Chicago to Boston, MA and you live in a 4 bedroom house, your average moving cost with a full service moving company can go over $10000. But if you are moving locally within 100 miles from your old place, this cost will be based on hourly rate and will vary from company to company."}, {"url": "http://www.kiplinger.com/article/real-estate/T010-C000-S002-5-cost-saving-tips-for-moving-time.html", "passage_text": "A cross-country move for a three-bedroom home can cost as much as $8,000. Figure $6,000 for the actual move (movers charge about $100 per 100 pounds, and the average room adds up to 1,000 pounds), $1,700 for the packing and $250 for the insurance. Movers are busiest on the last ten days of the month, so a move mid month should get you a better price and better service. If you can wait to move off-season, between October and April, you could save 10%. Get several written estimates with rates per hour (for a local move) or per pound (for an interstate move)."}, {"url": "http://home.costhelper.com/long-distance-mover.html", "passage_text": "1 Moving the contents of a 600-square foot one-bedroom apartment from Washington DC to Los Angeles, California averages $3,600-$5,000 for full service, which includes packing. 2  Estimated weight is 3,400 pounds. 1 Tipping is a common practice in moving according to Movingatoz.com. 2  Movers are generally tipped either $3-$5 per hour or $15 per every 1,000 pounds moved. 3  Moving insurance costs about $7.50 per $1,000 of value"}, {"url": "http://www.mymovingreviews.com/move/moving-rates-average", "passage_text": "Most moving companies charge the average moving rates of $100 per hour for local moves and $0.40 to $0.60 per pound for long distance moves. Therefore, the average price will depend on how many hours the movers work. Once you get a few moving quotes you will get the idea the average moving company rates and will be able to determine your approximate final bill amount. However, you can expect to pay on an average between $70 and $100 for two men and a truck."}, {"url": "http://www.mymovingreviews.com/move/moving-rates-average", "passage_text": "The average moving cost though depends on the moving rates. Yet for the average moving rates are different for every state. The moving rates will depend on the type of your move and the distance you are moving to. Furthermore, the cost of your moving will depend on the moving rates per mile, per pound or per cubic feet. Therefore, the average price will depend on how many hours the movers work. Once you get a few moving quotes you will get the idea the average moving company rates and will be able to determine your approximate final bill amount. However, you can expect to pay on an average between $70 and $100 for two men and a truck."}, {"url": "http://www.movers.com/moving-guides/cost-to-move-long-distance.html", "passage_text": "1 Cost per pound: On average, movers assess a cost of approximately $0.50 per pound to move your goods; however, this does not include any packing fees (labor and material), insurance or storage costs, and variables from company to company based on moving tariffs. 1 The total cost to rent a moving van or truck will vary with each company. 2  On average, however, a 10-foot truck rents for $20 per day, and around $0.99 per mile."}, {"url": "http://home.costhelper.com/long-distance-mover.html", "passage_text": "1 The cost to move approximately 5,500 pounds of furnishings from a two-bedroom 900-square foot apartment the same distance and service level is about $5,100-$6,400. 1 Tipping is a common practice in moving according to Movingatoz.com. 2  Movers are generally tipped either $3-$5 per hour or $15 per every 1,000 pounds moved. 3  Moving insurance costs about $7.50 per $1,000 of value"}, {"url": "http://www.zillow.com/blog/how-much-will-you-pay-to-move-91663/", "passage_text": "Longer move, higher price tag. To get an idea of moving costs, consider these examples: The fee for moving an average 1,000-square-foot, 3-bedroom apartment (goods weighing 5,500 pounds) from Chicago to Miami would be approximately $4,400 to $4,900. The same 1,400-mile move for a 2,800-square-foot, 4-bedroom household (20,500 pounds) would likely cost $14,600 to $15,600. Same distance, different loads. "}]