[{"url": "https://answers.yahoo.com/question/index?qid=1006032215487", "passage_text": "When a homeless person dies, there are two paths the body may take. In either case, step one involves a report to Mark Kassouf, registrar of the Bureau of Vital Statistics. The bodies are usually put into a section of the graveyard that is either unmarked or just has simple white crosses. Morgues usually hate having to prepare the bodies of the homeless because they really don't get anything for it. Source(s): The funeral home director who gave a talk to my history class, for some reason."}, {"url": "https://answers.yahoo.com/question/index?qid=1006032215487", "passage_text": "If the family is found, they decide what they want to do. When a homeless person does not die in a public place, does not die of natural causes, or suspicion of foul play is involved, the legal responsibility to determine cause of death is assigned to the county coroner. The bodies are usually put into a section of the graveyard that is either unmarked or just has simple white crosses. Morgues usually hate having to prepare the bodies of the homeless because they really don't get anything for it. Source(s): The funeral home director who gave a talk to my history class, for some reason."}, {"url": "https://www.gov.uk/after-a-death", "passage_text": "1. There are 3 things you must do in the first few days after someone dies. Get a medical certificate from a GP or hospital doctor. You’ll need this to register the death. Register the death within 5 days (8 days in Scotland). You’ll then get the documents you need for the funeral. Overview. There are 3 things you must do in the first few days after someone dies. Get a medical certificate from a GP or hospital doctor. You’ll need this to register the death."}, {"url": "http://www.smithsonianmag.com/history/what-happens-when-a-homeless-new-yorker-dies-808498/", "passage_text": "Sometimes, they die with no family and/or no money. In New York, a few thousand such people die each year in the city’s hospitals alone. But these people’s stories do not end with their deaths. Dismembered body parts constitute a small minority of the burials. An estimated one-third of the burials are of very young children. With one exception—“special child baby 1 1985,” the first child to die of AIDS in New York City—the bodies are buried in mass graves."}, {"url": "http://www.myreporter.com/2010/02/what-happens-to-homeless-or-indigent-people-when-they-die-and-have-no-relatives/", "passage_text": "Many of the deceased handled by the county are not without family. “There could be family members who won’t pay for the funeral or sign for it. They won’t claim the body,” Nesmith says. The county has a contract with Andrews Mortuary in Wilmington to cremate unclaimed bodies at about $450 each, Nesmith says. The remains are scattered at sea “as needed,” says Andrews Mortuary Funeral Director Duane Howlett. LaVaughn Nesmith, director of the New Hanover County Department of Social Services, says that the county averages about 10 cases a year. There were eight in 2009 and four to date in 2010"}, {"url": "https://answers.yahoo.com/question/index?qid=1006032215487", "passage_text": "Balraj also said, whether a person is homeless or wealthy, they are treated with an equal amount of dignity and respect.. If you would like to visit a homeless or other noted indigent gravesite they are located at Highland Park Cemetery in Highland Hills. The bodies are usually put into a section of the graveyard that is either unmarked or just has simple white crosses. Morgues usually hate having to prepare the bodies of the homeless because they really don't get anything for it. Source(s): The funeral home director who gave a talk to my history class, for some reason."}, {"url": "http://www.livescience.com/42955-what-happens-when-you-die.html", "passage_text": "View full size image. There's only one group of people who really know what happens when you die: the dead. And since the dead won't be revealing their secrets anytime soon, it's up to scientists to explain what happens when a person dies. Death, just like life, is a process, scientists say. The first stage of this process is known as clinical death. It lasts from four to six minutes, beginning when a person stops breathing and the heart stops pumping blood. During this time, there may be enough oxygen in the brain that no permanent brain damage occurs."}, {"url": "https://homelesslaw.wordpress.com/2008/05/12/under-the-law-what-happens-if-a-homeless-person-is-found-dead-and-nobody-knows-who-it-is/", "passage_text": "May 12, 2008 at 7:19 pm · Filed under death ·Tagged coroner, death, homeless law, homeless missing person, i.d. card homeless, identification homeless, medical examiner, unidentified dead bodies. **** The information written here is not legal advice and the author of this blog is not your lawyer. These posts merely contain ideas to help you plan and organize your legal research and identify potentially helpful sources of law. ****. "}]