[{"url": "http://www.worldatlas.com/webimage/countrys/asia/bali.htm", "passage_text": "Bali is an Indonesian island located in the westernmost end of the Lesser Sunda Islands, lying between Java to the west and Lombok to the east. Bali is Indonesia's favorite tourist destination, known for its natural attractions, perfect climate and relaxed atmosphere. South of the mountains is a broad, steadily descending area where most of Bali's large rice crop is grown. The northern side of the mountains slopes more steeply to the sea and is the main coffee producing area of the island, along with rice, vegetables and cattle. Dozens of (very small) rivers drain the island."}, {"url": "http://www.whereig.com/wonders-of-the-world/where-is-bali.html", "passage_text": "Map showing Where is Bali, Indonesia located on the World Map. Bali is one of the most famous islands of Indonesia in Indian Ocean."}, {"url": "https://en.wikipedia.org/wiki/Bali", "passage_text": "Bali is an island and province of Indonesia. The province includes the island of Bali and a few smaller neighbouring islands, notably Nusa Penida, Nusa Lembongan, and Nusa Ceningan. It is located at the westernmost end of the Lesser Sunda Islands, between Java to the west and Lombok to the east."}, {"url": "http://www.answers.com/Q/Where_is_Bali", "passage_text": "Bali is an island in Indonesia north of Australia, south of Borneo and east of Java. It is located in Indonesia, in the eastern and southern hemispheres. It's positioned in Southeast Asia, in central Indonesia, and sits just 2km east of the island of Java, west of the island of Lombok and just north of Australia."}, {"url": "http://www.answers.com/Q/Where_is_bali_located_in_the_world", "passage_text": "Bali is located in Indonesia. In the eastern and southern hemispheres. It's positioned in Southeast Asia, in central Indonesia, and sits just 2km east of the island of Java, w … est of the island of Lombok and just north of Australia. It's bordered by the Bali Sea and the Indian Ocean. It is located in Indonesia, in the eastern and southern hemispheres. It's positioned in So … utheast Asia, in central Indonesia, and sits just 2km east of the island of Java, w"}, {"url": "http://www.mapsofworld.com/location-maps/location-of-bali.html", "passage_text": "World Locations. Bali is one of the Indonesian islands, located just 8 degrees from the equator. Bali Island is situated at the western end of Lesser Sunda Island between Java and Lombok. Bali is one of the provinces of Indonesia, with its capital city in Denpasar. The total area of Bali is about 5,78006 square kilometers (2.231 square miles)."}, {"url": "http://www.answers.com/Q/Where_is_Bali", "passage_text": "Bali is located in Indonesia. In the eastern and southern hemispheres. It's positioned in Southeast Asia, in central Indonesia, and sits just 2km east of the island of Java, w … est of the island of Lombok and just north of Australia. It's bordered by the Bali Sea and the Indian Ocean. It is located in Indonesia, in the eastern and southern hemispheres. It's positioned in Southeast Asia, in central Indonesia, and sits just 2km east of the island of Java, w"}, {"url": "http://goasia.about.com/od/islandsandbeaches/a/Where-is-Bali.htm", "passage_text": "Bali, Indonesia, is a 95-mile-wide island located in the Indian Ocean, only two miles east of the tip of Java and west of Lombok and Flores. Bali is a part of the Indonesian archipelago known as the Lesser Sunda Islands north of Western Australia. 1  See some Indonesia travel essentials for a profile of the country. "}, {"url": "http://www.answers.com/Q/Where_is_bali_located_in_the_world", "passage_text": "Bali is an island in Indonesia north of Australia, south of Borneo and east of Java. It is located in Indonesia, in the eastern and southern hemispheres. It's positioned in So … utheast Asia, in central Indonesia, and sits just 2km east of the island of Java, west of the island of Lombok and just north of Australia. It's bordered by the Bali Sea and the Indian Ocean."}, {"url": "http://www.answers.com/Q/Where_is_Bali", "passage_text": "The capital of Bali (in Indonesia) is Denpasar. Bali is an Indonesian island westernmost of the Lesser Sunda Islands. Bali is a small island, but it is densely populated, and … culturally and economically one of the most important islands of Indonesia. It is located in Indonesia, in the eastern and southern hemispheres. It's positioned in Southeast Asia, in central Indonesia, and sits just 2km east of the island of Java, west of the island of Lombok and just north of Australia."}]