[{"url": "http://earthquake.usgs.gov/earthquakes/world/events/1976_07_27.php", "passage_text": "The 1976 Tangshan earthquake caused liquefaction and bending of the rails on the Beijing-Shanhaiguan railway that passes through Tangshan. Photograph by China Features Agency, Beijing. This earthquake occurred in the northeastern part of China, near the coast. The epicenter was centered about 140 kilometers southeast of Beijing, in the vicinity of Tangshan. The first earthquake, magnitude 7.5, was followed by a major aftershock 15 hours later."}, {"url": "http://history1900s.about.com/od/horribledisasters/a/tangshan.htm", "passage_text": "At 3:42 a.m. on July 28, 1976, a magnitude 7.8 earthquake hit the sleeping city of Tangshan, in northeastern China. The very large earthquake, striking an area where it was totally unexpected, obliterated the city of Tangshan and killed over 240,000 people-making it the deadliest earthquake of the twentieth century. 2. The Earthquake Strikes. When the 7.8 magnitude earthquake struck Tangshan at 3:42 a.m. on July 28, over a million people lay sleeping, unaware of the disaster that was to befall them."}, {"url": "https://en.wikipedia.org/wiki/1976_Tangshan_earthquake", "passage_text": "The Tangshan earthquake, also known as the Great Tangshan earthquake, was a natural disaster that occurred on July 27, 1976. It is believed to be the largest earthquake of the 20th century by death toll. The epicenter of the earthquake was near Tangshan in Hebei, People's Republic of China, an industrial city with approximately one million inhabitants. The number of deaths initially reported by the Chinese government was 655,000, but this number has since been stated to be around 240,000 to 255,000. "}, {"url": "http://history1900s.about.com/od/horribledisasters/a/tangshan_2.htm", "passage_text": "Continued from page 1. Damage and Recovery. Before the 1976 earthquake, scientists didn't think Tangshan was susceptible to a large earthquake; thus, the area was zoned an intensity level of VI on the Chinese intensity scale (similar to the Mercalli scale). The 7.8 earthquake that hit Tangshan was given an intensity level of XI (out of XII). The buildings in Tangshan were not built to withstand such a large earthquake. Ninety-three percent of residential buildings and 78 percent of industrial buildings were completely destroyed. "}, {"url": "https://prezi.com/rjp4qm1i0n-i/tangshan-earthquake-1976/", "passage_text": "Transcript of Tangshan Earthquake, 1976. Tangshan earthquake, 1976 By Aisling McKenna What happened Why it happened Where it happened Social Impacts Affected area Economic Impacts At 3:42am on the 29th of July, 1976, Tangshan was hit with an earthquake clocking in between 7.8 and 8.3 on the Richter scale. "}, {"url": "http://www.nationalgeographic.com/features/04/forcesofnature/forces/e_6.html", "passage_text": "Injured: At least 500,000. Damage: 85 percent of buildings destroyed. With no structures built for earthquake resistance, Tangshan was a sitting duck. This city of one million, about 68 miles (110 kilometers) east of Beijing, was nearly decimated when a magnitude 7.8 quake shook it awake in 1976. A major aftershock followed 15 hours later."}, {"url": "http://asianhistory.about.com/od/china/a/TangshanQuake.htm", "passage_text": "The Ground Shifts Beneath Them: At 3:42 am on July 28, 1976, a magnitude 7.8 earthquake struck Tangshan, an industrial city of 1 million people in northern China. The quake leveled about 85% of the buildings in Tangshan, which had been built on the unstable soil of the Luanhe River's flood plain. In many ways, the political repercussions of the Great Tangshan Earthquake were even more significant than the death toll and physical damage. Mao Zedong died on September 9, 1976. He was replaced as Chairman of the Chinese Communist Party, not by one of the radical Gang of Four, but by Premiere Hua Guofeng."}, {"url": "http://earthquake.usgs.gov/earthquakes/world/events/1976_07_27_eib.php", "passage_text": "They include the 1967 Hejian (225 km southwest of Tangshan) earthquake (M=6.3), the 1969 Bohai earthquake (M=7.4), the 1975 Haicheng (400 km east of Tangshan) earthquake (M=7.3), and the 1976 Horinger (550 km west of Tangshan) earthquake (M=6.3). Insufficient research on seismogenic structures of this region was the main cause of the difficulties in the assessment of seismic risk of the Tangshan region before the great earthquake of 1976. Tectonic conditions play an important role in the assessment of seismic risk."}, {"url": "http://earthquake.usgs.gov/earthquakes/world/events/1976_07_27_eib.php", "passage_text": "After the Haicheng earthquake of February 1975, earthquake swarms and moderate earthquakes occurred frequently in northern China at Miaodao in Shandong Province, Horinger in Inner Mongolia, Daichen (170 km southwest of Tangshan) in Hebei Province, and Taiyuan in Shanxi Province. Insufficient research on seismogenic structures of this region was the main cause of the difficulties in the assessment of seismic risk of the Tangshan region before the great earthquake of 1976. Tectonic conditions play an important role in the assessment of seismic risk."}]