[{"url": "https://peninsulaeatz.wordpress.com/2010/02/16/recipe-tarragon-sauce-for-seafood/", "passage_text": "To-die-for tarragon sauce is the ultimate mate for seafood. This sauce is ssssooooo good! If you like tarragon — that distinctive, kind of minty, kind of licorice-y leaf from the gods — it’s way beyond good. Dump the hot water out of the blender and add the tarragon and parsley. Pour in the sauce ingredients and process until the sauce is smooth and bright green. Adjust the sauce to taste by adding more lemon juice or salt."}, {"url": "http://www.bbc.co.uk/food/tarragon", "passage_text": "Tarragon recipes. Often used in French cooking this herb has long, soft green leaves and a distinctive aniseed flavour. A perfect match with chicken, it can also be used to flavour oils and vinegars. Dried tarragon retains much of the flavour of fresh, so it is fine to use if you can’t find fresh. It is one of the herbs that makes up fines herbes and is also used in bearnaise béarnaise. sauce"}, {"url": "https://en.wikipedia.org/wiki/Tarragon", "passage_text": "Tarragon (Artemisia dracunculus) is a species of perennial herb in the sunflower family. It is widespread in the wild across much of Eurasia and North America, and is cultivated for culinary and medicinal purposes in many lands. Tarragon is the main flavoring component of Bearnaise béarnaise. Sauce, fresh lightly bruised sprigs of tarragon are steeped in vinegar to produce tarragon. Vinegar tarragon is used to flavor a popular carbonated soft drink in the countries Of, Armenia, Azerbaijan georgia, and by, Extension, Russia ukraine And. kazakhstan"}, {"url": "http://www.realsimple.com/food-recipes/browse-all-recipes/tarragon-cream-sauce", "passage_text": "Directions. 1  In a large saucepan, over medium-high heat, bring the wine, onion, pepper, and whole tarragon sprigs to a boil. 2  Reduce heat and simmer, uncovered, until the mixture is reduced by two-thirds, 20 to 25 minutes, depending on size of pan. 3  Remove and discard the tarragon sprigs. 1 Remove and discard the tarragon sprigs. 2  Add the cream, reduce heat, and simmer gently until slightly thickened, about 15 minutes. 3  Remove from heat and stir in the salt and chopped tarragon."}, {"url": "http://www.williams-sonoma.com/recipe/chicken-in-tarragon-sauce.html", "passage_text": "Add the tarragon and cream, increase the heat to medium and stir with a wooden spoon, scraping up any browned bits from the pan bottom and blending well. Cook, stirring, until bubbling and thickened slightly, 2 to 3 minutes. Season with salt and pepper and a squeeze of lemon juice. Add the shallot and saute, sauté, stirring until, translucent 1 to 2. Minutes add the tarragon and, cream increase the heat to medium and stir with a wooden, spoon scraping up any browned bits from the pan bottom and blending. well"}, {"url": "http://www.realsimple.com/food-recipes/browse-all-recipes/tarragon-cream-sauce", "passage_text": "1 In a large saucepan, over medium-high heat, bring the wine, onion, pepper, and whole tarragon sprigs to a boil. 2  Reduce heat and simmer, uncovered, until the mixture is reduced by two-thirds, 20 to 25 minutes, depending on size of pan. 3  Remove and discard the tarragon sprigs. 1 Remove and discard the tarragon sprigs. 2  Add the cream, reduce heat, and simmer gently until slightly thickened, about 15 minutes. 3  Remove from heat and stir in the salt and chopped tarragon."}, {"url": "http://homecooking.about.com/od/condimentrecipes/r/blsauce58.htm", "passage_text": "Preparation. Melt butter in a medium saucepan over medium heat; stir in flour. Cook 1 to 2 minutes or until flour is brown. Gradually add milk; stir until flour mixture dissolves. Continue to cook, stirring constantly, until sauce thickens. Stir in sour cream, tarragon, chervil, basil, garlic powder, salt, and pepper. Store in an airtight container in refrigerator."}, {"url": "http://www.food.com/recipe/tarragon-sauce-468734", "passage_text": "Directions. 1  Melt 1 T butter over medium heat. 2  Add shallots and cook until soft but not brown (less than 1 minute). 3  Add wine and gently boil uncovered until all of liquid is evaporated and shallots make a sizzle noise. 4  Mix 1/4 cup of poaching liquid or chicken broth to onions. 5  DO NOT ADD MORE-it will be too thin. 1"}, {"url": "http://www.williams-sonoma.com/recipe/chicken-in-tarragon-sauce.html", "passage_text": "Add the shallot and saute, sauté, stirring until, translucent 1 to 2. Minutes add the tarragon and, cream increase the heat to medium and stir with a wooden, spoon scraping up any browned bits from the pan bottom and blending. Well, cook, stirring until bubbling and thickened, slightly 2 to 3. minutes Add the shallot and saute, sauté, stirring until, translucent 1 to 2. Minutes add the tarragon and, cream increase the heat to medium and stir with a wooden, spoon scraping up any browned bits from the pan bottom and blending. well"}, {"url": "http://www.williams-sonoma.com/recipe/chicken-in-tarragon-sauce.html", "passage_text": "In a large saute sauté pan or fry pan over-medium high, heat melt the butter with the olive. Oil when, hot add the, chicken season with salt and pepper and saute, sauté gently, turning once until the chicken is golden and opaque throughout and the juices run clear when the meat is pierced with, a knife about 3 minutes. per side Add the shallot and saute, sauté, stirring until, translucent 1 to 2. Minutes add the tarragon and, cream increase the heat to medium and stir with a wooden, spoon scraping up any browned bits from the pan bottom and blending. well"}]