[{"url": "http://www.merriam-webster.com/dictionary/ethnic", "passage_text": ": of or relating to races or large groups of people who have the same customs, religion, origin, etc. : associated with or belonging to a particular race or group of people who have a culture that is different from the main culture of a country."}, {"url": "http://www.yourdictionary.com/ethnic", "passage_text": "adjective. noun. The definition of ethnic is someone or something associated with a particular subgroup that has a shared national original, cultural identity or race. An example of ethnic is Mexican food. An ethnic is defined as a person who is a member of a specific racial or cultural group that is considered a minority."}, {"url": "http://www.diffen.com/difference/Ethnicity_vs_Race", "passage_text": "The traditional definition of race and ethnicity is related to biological and sociological factors respectively. Race refers to a person's physical characteristics, such as bone structure and skin, hair, or eye color."}, {"url": "http://www.stats.govt.nz/methods/classifications-and-standards/classification-related-stats-standards/ethnicity/definition.aspx", "passage_text": "Ethnicity is the ethnic group or groups that people identify with or feel they belong to. Ethnicity is a measure of cultural affiliation, as opposed to race, ancestry, nationality or citizenship. Ethnicity is self perceived and people can belong to more than one ethnic group."}, {"url": "http://www.businessdictionary.com/definition/ethnic-origin.html", "passage_text": "People derived from of a variety of ethnic origin types currently inhabit the United States, and which include white, black, American Indian, Asian, Pacific Islander and Eskimo."}, {"url": "http://www.yourdictionary.com/ethnic", "passage_text": "noun. The definition of ethnic is someone or something associated with a particular subgroup that has a shared national original, cultural identity or race. An example of ethnic is Mexican food. An ethnic is defined as a person who is a member of a specific racial or cultural group that is considered a minority."}, {"url": "http://www.businessdictionary.com/definition/ethnic-origin.html", "passage_text": "The ethnic origin of the individual is irrelevant outside of how their government would proceed to interact with our business. 4 people found this helpful. We strive to have diversity in the workplace and hire without regard to religion, sex, and ethnic origin to ensure that we hire the best workers."}]