[{"url": "http://www.webmd.com/drugs/condition-3217-Nausea+and+Vomiting.aspx?diseaseid=3217&diseasename=Nausea+and+Vomiting", "passage_text": "Considering taking medication to treat Nausea and Vomiting? Below is a list of common medications used to treat or reduce the symptoms of Nausea and Vomiting. Follow the links to read common uses, side effects, dosage details and read user reviews for the drugs listed below."}, {"url": "http://www.aafp.org/afp/2003/0915/p1089.html", "passage_text": "Studies in Africa 14 and India 15 have suggested that an effective dosage of ivermectin is 200 mcg per kg; at least three additional studies 16 – 18 of the same dosage have confirmed ivermectin's efficacy as a treatment for scabies infection. Ivermectin has been used extensively and safely in the treatment of other parasitic infections, but the U.S. Food and Drug Administration has not approved the drug for the treatment of scabies infection. The safety of oral ivermectin in pregnant and lactating women and young children has yet to be established."}, {"url": "https://en.wikipedia.org/wiki/Metric_system", "passage_text": "Although a number of variants of the metric system emerged in the late nineteenth and early twentieth centuries, the term is now often used as a synonym for SI or the  International System of Units —the official system of measurement in almost every country in the world. The CIPM's draft proposal, which was an extensive revision and simplification of the metric unit definitions, symbols and terminology based on the MKS system of units, was put to the 10th CGPM in 1954."}, {"url": "https://www.unc.edu/%7Erowlett/units/metric.html", "passage_text": "Using the Dictionary. Designed during the French Revolution of the 1790's, the metric system brought order out of the conflicting and confusing traditional systems of weights and measures then being used in Europe. The metric system replaces all the traditional units, except the units of time and of angle measure, with units satisfying three conditions: (1) One fundamental unit is defined for each quantity. These units are now defined precisely in the International System of Units."}, {"url": "http://epharmapedia.com/medicine/profile/244612/Scripto-metic.html?lang=en&tab=druginfo", "passage_text": "Indications: Treatment of schizophrenia; short-term treatment of generalized nonpsychotic anxiety; control of severe nausea and vomiting. Cisapride, sparfloxacin The risk of life-threatening cardiac arrhythmias, including torsades de pointes, may be increased. Guanethidine Hypotensive action of guanethidine may be inhibited. Metrizamide Possibility of seizure may be increased when subarachnoid metrizamide injection is used."}, {"url": "https://www.unc.edu/%7Erowlett/units/metric.html", "passage_text": "A note: Widespread use of the metric system has not meant the complete elimination of traditional units, nor has it stopped the continuing creation of new units, many metric but some not, to meet new needs. The purpose of this dictionary is to provide information on all commonly used units, old and new. The metric system replaces all the traditional units, except the units of time and of angle measure, with units satisfying three conditions: (1) One fundamental unit is defined for each quantity. These units are now defined precisely in the International System of Units."}, {"url": "http://www.aafp.org/afp/2003/0915/p1089.html", "passage_text": "Ivermectin is not approved for treatment of scabies by the U.S. Food and Drug Administration. There are concerns regarding its use in young children and pregnant women, because there may be more drug penetrance of the immature blood-brain barrier. Ivermectin has been used extensively and safely in the treatment of other parasitic infections, but the U.S. Food and Drug Administration has not approved the drug for the treatment of scabies infection. The safety of oral ivermectin in pregnant and lactating women and young children has yet to be established."}, {"url": "http://drug-info.in/scripto-metic-prochlorperazine-maleate-adcock-ingram/", "passage_text": "Categories: Drug List S. The drug brand named Scripto-Metic contains generic salt-Prochlorperazine Maleate and is manufactured by Adcock Ingram. Scripto-Metic is mainly associated with symptoms and indications-The International Classification of Diseases (ICD)- N05AB04-Prochlorperazine. Generic Salts"}, {"url": "http://www.aafp.org/afp/2003/0915/p1089.html", "passage_text": "Scabies is a skin disease caused by infestation with the mite Sarcoptes scabiei. Although it may infest any human in any climate, it is most common in children younger than two years and is endemic in the tropics. 1 The female mite, whose life expectancy is about 30 days, burrows into the epidermis to lay eggs. Ivermectin has been used extensively and safely in the treatment of other parasitic infections, but the U.S. Food and Drug Administration has not approved the drug for the treatment of scabies infection. The safety of oral ivermectin in pregnant and lactating women and young children has yet to be established."}]