[{"url": "https://en.wikipedia.org/wiki/Capuchin_monkey", "passage_text": "The word capuchin derives from a group of friars named the Order of Friars Minor Capuchin, an offshoot from the Franciscans, who wear brown robes with large hoods covering their heads. When explorers reached the Americas in the 15th century they found small monkeys who resembled these friars and named them capuchins. However, in 2011, it was proposed that the capuchin monkeys should be split between the gracile capuchins in the genus Cebus and the robust capuchins in the genus Sapajus. The range of capuchin monkeys includes Central America and South America as far south as northern Argentina"}, {"url": "https://en.wikipedia.org/wiki/White-headed_capuchin", "passage_text": "The white-headed capuchin (Cebus capucinus), also known as the white-faced capuchin or white-throated capuchin, is a medium-sized New World monkey of the family Cebidae, subfamily Cebinae. The white-headed capuchin was one of the many species originally described by Linnaeus in his 18th century work, Systema Naturae. It is a member of the family Cebidae, the family of New World monkeys containing capuchin monkeys, squirrel monkeys, tamarins and marmosets."}, {"url": "https://en.wikipedia.org/wiki/White-headed_capuchin", "passage_text": "Like other monkeys in the genus Cebus, the white-headed capuchin is named after the order of Capuchin friars – the cowls of these friars closely resemble the monkey's head coloration. The white-headed capuchin has mostly black fur, with white to yellow like fur on the neck, throat, chest, shoulders, and upper arms. The white-headed capuchin was one of the many species originally described by Linnaeus in his 18th century work, Systema Naturae. It is a member of the family Cebidae, the family of New World monkeys containing capuchin monkeys, squirrel monkeys, tamarins and marmosets."}, {"url": "https://en.wikipedia.org/wiki/White-headed_capuchin", "passage_text": "In the wild, the white-headed capuchin is versatile, living in many different types of forest, and eating many different types of food, including fruit, other plant material, invertebrates, and small vertebrates. The white-headed capuchin was one of the many species originally described by Linnaeus in his 18th century work, Systema Naturae. It is a member of the family Cebidae, the family of New World monkeys containing capuchin monkeys, squirrel monkeys, tamarins and marmosets."}, {"url": "http://animalstime.com/capuchin-monkey-facts-top-10-facts-about-capuchin-monkey/", "passage_text": "The capuchin monkey belongs to the family of Cediae and is a New World Monkey. These primates inhabit all throughout South and Central America, with some species are also found in northern Argentine. They can be aggressive to their owners. Let’ us discover some of the most interesting capuchin monkey facts. "}, {"url": "https://en.wikipedia.org/wiki/Capuchin_monkey", "passage_text": "The capuchin monkeys (/ˈkaepjʊtʃɪn/ ˈkæpjʊtʃɪn /or/) ˈkaepjʊʃɪn ˈkæpjʊʃɪn Are new world monkeys of The. Subfamily cebinae prior, to 2011 the subfamily contained only a, Single. genus cebus However, in 2011, it was proposed that the capuchin monkeys should be split between the gracile capuchins in the genus Cebus and the robust capuchins in the genus Sapajus. The range of capuchin monkeys includes Central America and South America as far south as northern Argentina."}, {"url": "http://bookbuilder.cast.org/view_print.php?book=27234", "passage_text": "What They Look Like. Capuchin monkeys have small skinny bodies covered in brown and black fur. Their faces, necks and chests are a white or cream color. This is why they are called the white-faced monkey. Their tails help them grab on to trees. "}, {"url": "http://www.softschools.com/facts/animals/capuchin_monkey_facts/295/", "passage_text": "Capuchin monkey has prehensile tail that is the same length as the body. Body of capuchin monkey is covered with fur that is white (or light tan) on the face, neck and shoulders and dark brown on the remaining parts of the body. Capuchin monkey Facts. Capuchin monkey is cute monkey which became popular after appearing in the Friends as Ross's pet Marcel and in the Ace Ventura's movies as domesticated monkey called Spike. Capuchin monkey can be found in South America"}]