[{"url": "http://www.smallfootprintfamily.com/how-to-use-stinging-nettles", "passage_text": "Nettle tea compresses or finely powdered dried nettles are also good for wounds, cuts, stings, warts, and burns. Other uses include treating gout, glandular diseases, poor circulation, enlarged spleen, diarrhea, and dysentery, worms, intestinal and colon disorders, and hemorrhoids."}, {"url": "http://umm.edu/health/medical/altmed/herb/stinging-nettle", "passage_text": "Stinging nettle has been used for hundreds of years to treat painful muscles and joints, eczema, arthritis, gout, and anemia. Today, many people use it to treat urinary problems during the early stages of an enlarged prostate (called benign prostatic hyperplasia or BPH)."}, {"url": "http://www.smallfootprintfamily.com/how-to-use-stinging-nettles", "passage_text": "Stinging nettle has a flavor similar to spinach, and is rich in vitamins A, C, D, K, and many minerals including iron, potassium, manganese, calcium, magnesium, phosphorous, silica, iodine, silicon, sodium, and sulfur. Nettles also provide chlorophyll and tannin, and they’re a good source of B complex vitamins."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-664-STINGING%20NETTLE.aspx?activeIngredientId=664&activeIngredientName=STINGING%20NETTLE", "passage_text": "Stinging nettle root is used for urination problems related to an enlarged prostate (benign prostatic hyperplasia [BPH]). These problems include nighttime urination, too frequent urination, painful urination, inability to urinate, and irritable bladder."}, {"url": "http://www.herbwisdom.com/herb-nettle.html", "passage_text": "Nettle (also known as Stinging Nettle) has been used for centuries to treat allergy symptoms, particularly hayfever which is the most common allergy problem. It contains biologically active compounds that reduce inflammation."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-664-STINGING%20NETTLE.aspx?activeIngredientId=664&activeIngredientName=STINGING%20NETTLE", "passage_text": "Stinging nettle is a plant. People use the root and above ground parts as medicine. Stinging nettle is used for many conditions, but so far, there isn’t enough scientific evidence to determine whether or not it is effective for any of them."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-664-STINGING%20NETTLE.aspx?activeIngredientId=664&activeIngredientName=STINGING%20NETTLE", "passage_text": "Stinging nettle root is also used for joint ailments, as a diuretic, and as an astringent. Stinging nettle above ground parts are used along with large amounts of fluids in so-called “irrigation therapy” for urinary tract infections (UTI), urinary tract inflammation, and kidney stones (nephrolithiasis). The above-ground parts are also used for allergies, hayfever, and osteoarthritis."}, {"url": "http://www.vitaminstuff.com/herbs-nettle.html", "passage_text": "Special Sections. Nettle Nettle (Urtica dioica [Latin]), also called stinging nettle, was once used to treat arthritis and all sorts of skin disease. It was the method with which nettle was introduced to the body that makes this herb s medicinal history so interesting self-flagellation with the nettle plant."}, {"url": "http://www.vitaminstuff.com/herbs-nettle.html", "passage_text": "Nettle. Nettle (Urtica dioica [Latin]), also called stinging nettle, was once used to treat arthritis and all sorts of skin disease. It was the method with which nettle was introduced to the body that makes this herb s medicinal history so interesting self-flagellation with the nettle plant."}]