[{"url": "http://www.accountingdetails.com/administrative_cost_definition.htm", "passage_text": "Administrative Cost Definition: Administrative costs are all executive, organizational, and clerical costs associated with the general management of an organization rather than with manufacturing, marketing, or selling. Back to Home Page | Back to Managerial Accounting Terms Main Page."}, {"url": "http://www.investopedia.com/terms/g/general-and-administrative-expenses.asp", "passage_text": "DEFINITION of 'General And Administrative Expense-G&A'. Expenditures related to the day-to-day operations of a business. General and administrative expenses pertain to operation expenses rather that to expenses that can be directly related to the production of any goods or services. General and administrative expenses include rent, utilities, insurance and managerial salaries. Next Up."}, {"url": "http://www.accountingcoach.com/terms/A/administrative-expenses", "passage_text": "administrative expenses. Administrative expenses are part of the operating expenses (along with selling expenses). Administrative expenses include expenses associated with the general administration of the business. "}, {"url": "http://www.investopedia.com/terms/g/general-and-administrative-expenses.asp", "passage_text": "BREAKING DOWN 'General And Administrative Expense-G&A'. General and administrative expenses encompass a variety of expenses associated with performing the daily operations in a company. In the company's income statement, these expenses with generally appear under operating expenses. General and administrative expenses pertain to operation expenses rather that to expenses that can be directly related to the production of any goods or services. General and administrative expenses include rent, utilities, insurance and managerial salaries. Next Up."}, {"url": "http://www.accountingtools.com/questions-and-answers/what-is-general-and-administrative-expense.html", "passage_text": "General and administrative expense is the set of expenses required to administer a business, and which are not related to the construction or sale of goods or services. This information is needed to determine the fixed cost structure of a business. Examples of general and administrative expenses are: 1  Accounting staff wages and benefits. General and administrative expense is generally not considered to include research and development (or engineering) expenses, which are usually aggregated into a separate department. General and administrative expenses appear in the income statement below the cost of goods sold."}, {"url": "http://www.myaccountingcourse.com/accounting-dictionary/general-administrative-expenses", "passage_text": "General and administrative expenses include all of the non-selling expenses. General and administrative expenses are costs that contribute to the overall operations of the company and can't really be directly related back to selling or making sales. These expenses include things like overhead, management salaries, accounting fees, and other expenses used to run the busines"}, {"url": "http://www.readyratios.com/reference/accounting/administrative_expenses.html", "passage_text": "Administrative Expenses. Accounting. Email. Administrative expenses refer to the costs of operating a business that are not directly attributable to the production of goods or services. Administrative expenses are related to the organization as a whole as opposed to the individual departments. Administrative expenses are necessary costs that are associated with the management, administrative, clerical, and general functions within an organization."}, {"url": "https://en.wikipedia.org/wiki/SG%26A", "passage_text": "SG&A (alternately SGA or SAG) is an initialism used in accounting to refer to Selling, General and Administrative Expenses, which is a major non-production cost presented in an income statement. SGA expenses consist of the combined costs of operating the company, which breaks down to: "}, {"url": "http://www.investopedia.com/terms/a/administrative-expenses.asp", "passage_text": "DEFINITION of 'Administrative Expenses'. The expenses that an organization incurs not directly tied to a specific function such as manufacturing/production or sales. These expenses are related to the organization as a whole as opposed to an individual department; also referred to as administrative cost.. Next Up"}]