[{"url": "http://www.rxlist.com/colcrys-drug/indications-dosage.htm", "passage_text": "The recommended dosage of COLCRYS for FMF in adults is 1.2 mg to 2.4 mg daily. COLCRYS should be increased as needed to control disease and as tolerated in increments of 0.3 mg/day to a maximum recommended daily dose. If intolerable side effects develop, the dose should be decreased in increments of 0.3 mg/day. "}, {"url": "http://www.medilexicon.com/drugs/colcrys.php", "passage_text": "The recommended dose in adults is 1.2 mg to 2.4 mg daily. The dose should be increased as needed to control disease and as tolerated in increments of 0.3 mg/day to a maximum recommended daily dose. The maximum recommended dose for prophylaxis of gout flares is 1.2 mg/day. Treatment of Gout Flares: 1.2 mg (2 tablets) at the first sign of the flare followed by 0.6 mg (1 tablet) one hour later. The maximum recommended dose for treatment of gout flares is 1.8 mg over a 1 hour period."}, {"url": "http://www.medscape.com/viewarticle/721433", "passage_text": "Usually, 0.6 mg colchicine is taken once or twice daily to prevent gout flares (maximum, 1.2 mg/day), and a dose of 1.2 mg is taken at the first sign of an acute gout flare, followed by 0.6 mg 1 hour later. Prophylaxis of gout flares: If the original colchicine dose were 0.6 mg twice daily, 0.3 mg should be given once daily. For an original dose of 0.6 mg daily, the adjusted dose is 0.3 mg every other day."}, {"url": "http://www.accessdata.fda.gov/drugsatfda_docs/label/2009/022353lbl.pdf", "passage_text": "Maximum dose 1.2 mg/day. • Treatment of Gout Flares 1.2 mg (2 tablets) at the first sign of a gout flare followed by 0.6 mg (1 tablet) one hour later (2.1). • FMF: Adults and Children older than 12 years 1.2 – 2.4 mg; Children 6 to 12 years 0.9 – 1.8 mg; Children 4 to 6 years 0.3 – 1.8 mg."}, {"url": "http://www.medscape.com/viewarticle/721433", "passage_text": "Prophylaxis of gout flares: If the original colchicine dose was 0.6 mg twice daily, 0.6 mg daily or 0.3 mg twice daily should be given. For an original dose of 0.6 mg daily, the adjusted dose is 0.3 mg daily. Treatment of gout flares: Take 1.2 mg × 1 dose of colchicine; at least 3 days should elapse before repeating. Prophylaxis of gout flares: If the original colchicine dose were 0.6 mg twice daily, 0.3 mg should be given once daily. For an original dose of 0.6 mg daily, the adjusted dose is 0.3 mg every other day."}, {"url": "http://www.medscape.com/viewarticle/721433", "passage_text": "For FMF, the maximum daily dose of colchicine is 1.2 to 2.4 mg, administered in divided doses. Because coadministration with drugs that inhibit cytochrome P 450 isoenzyme 3A4 (CYP 3A4) and/or P-glycoprotein (P-gp) increases the risk for colchicine-induced toxic effects, dose adjustments are required. Prophylaxis of gout flares: If the original colchicine dose were 0.6 mg twice daily, 0.3 mg should be given once daily. For an original dose of 0.6 mg daily, the adjusted dose is 0.3 mg every other day."}, {"url": "http://www.medsafe.govt.nz/profs/PUarticles/colchicinetoxicity.htm", "passage_text": "Medsafe Editorial Team. The maximum dose of colchicine in an acute attack of gout should be 6mg (10 tablets). Colchicine should be taken at an initial dose of 1.2mg followed by 1 tablet every 2 hours until the gouty pain is relieved, gastrointestinal symptoms develop, or the maximum dose is reached. "}, {"url": "http://www.druglib.com/druginfo/colcrys/indications_dosage/", "passage_text": "The recommended dosage of COLCRYS for FMF in adults is 1.2 mg to 2.4 mg daily. COLCRYS should be increased as needed to control disease and as tolerated in increments of 0.3 mg/day to a maximum recommended daily dose. If intolerable side effects develop, the dose should be decreased in increments of 0.3 mg/day. The maximum recommended dose for prophylaxis of gout flares is 1.2 mg/day. Treatment of Gout Flares: The recommended dose of COLCRYS for treatment of a gout flare is 1.2 mg (2 tablets) at the first sign of the flare followed by 0.6 mg (1 tablet) one hour later. Higher doses have not been found to be more effective. The maximum recommended dose for treatment of gout flares is 1.8 mg over a 1 hour period. COLCRYS may be administered for treatment of a gout flare during prophylaxis at doses not to exceed 1.2 mg (2 tablets) at the first sign of the flare followed by 0.6 mg (1 tablet) one hour later"}]