[{"url": "http://www.pcmag.com/encyclopedia/term/59952/led-tv", "passage_text": "Definition of:LED TV. A flat panel LCD TV set that uses LEDs (light emitting diodes) for its backlight source rather than the traditional cold cathode fluorescent lamps (see CCFL). Smaller, more power efficient and having a greater optical range than the fluorescents, LEDs produce deeper blacks and more saturated color. "}, {"url": "http://acronyms.thefreedictionary.com/LCD", "passage_text": "Long-term Development Prospects for Companies in the LCD and OLED ... by Business Wire. the world's largest provider of thin-film transistor, liquid crystal display (TFT-. ) panels, will exhibit the first 70-inch full-HD. for consumer TVs at Flat Panel Display (FPD) International 2006. "}, {"url": "http://medical-dictionary.thefreedictionary.com/LCD", "passage_text": "LCD, abbreviation for liquid crystal display. A video display device that is more compact and uses less electrical power than the conventional cathode ray tube (CRT). Laptop computers use LCD displays. LCD monitors are frequently used instead of CRTs for desktop computers."}, {"url": "http://www.cnet.com/news/led-lcd-backlights-explained/", "passage_text": "The biggest difference between all the LED back/edge-lighting methods is how effective their local dimming is, which as you'll see, has become a pretty broad term. Obviously this is a mock-up of what an LCD looks like. In the real world, the LEDs are in the bezel (frame) that's around the screen. In this exaggerated image, the top is what the image would look like on a regular LCD with no local dimming, or on a plasma, OLED, and full-array locally dimmable LED LCDs. Geoffrey Morrison/CNET. M-O-O-N, that spells local dimming."}, {"url": "https://en.wikipedia.org/wiki/LCD_television", "passage_text": "A generic LCD TV, with speakers on either side of the screen. Liquid-crystal-display televisions (LCD TV) are television sets that use LCD display technology to produce images. LCD televisions are thinner and lighter than cathode ray tube (CRTs) of similar display size, and are available in much larger sizes. "}, {"url": "http://www.digitaltrends.com/home-theater/led-vs-lcd-tvs/", "passage_text": "An LED TV is an LCD TV. Despite having a different acronym, an LED TV is just a different type of LCD TV. The proper name would actually be “LED-backlit LCD TV,” but that’s too much of a mouthful for everyday conversation, so people generally just refer to them as LED TV’s, which can cause confusion. "}, {"url": "http://www.audioenglish.org/dictionary/lcd.htm", "passage_text": "• LCD (noun). The noun LCD has 1 sense: 1. a digital display that uses liquid crystal cells that change reflectivity in an applied electric field; used for portable computer displays and watches etc. Familiarity information: LCD used as a noun is very rare. Dictionary entry details."}]