[{"url": "http://www.theboneonline.com/news/entertainment/personalities/cowhead-show-john-brennan/n8Fb/", "passage_text": "John Brennan. John Brennan, born in Philadelphia and raised in Hernando County, Florida. He is the Executive Producer of the #1 rated Mike Calta Show, heard weekdays from 3-7pm on 102.5 The Bone (WHPT) in Tampa. John has been with the show since Mike Calta debuted on 102.5 The Bone in 2006. "}, {"url": "https://en.wikipedia.org/wiki/John_O._Brennan", "passage_text": "The ACLU called for the Senate not to proceed with the appointment until it confirms that all of his conduct was within the law at the CIA and White House. John Brennan was approved by the Senate Intelligence Committee on March 5, 2013 to succeed David Petraeus as the Director of the CIA by a vote of 12 to 3. After leaving government service in 2005, Brennan became CEO of The Analysis Corporation, a security consulting business, and served as chairman of the Intelligence and National Security Alliance, an association of intelligence professionals."}, {"url": "http://www.who2.com/bio/john-o-brennan/", "passage_text": "John O. Brennan was appointed to be the director of the Central Intelligence Agency by President Barack Obama, and confirmed by the United States Senate on 8 March 2013. Brennan is a career C.I.A. man. "}, {"url": "https://en.wikipedia.org/wiki/John_Brennan", "passage_text": "1 Jack Brennan (born 1937), U.S. Marine officer and aide of Richard Nixon. 2  John O. Brennan (born 1955), CIA Director. 3  John P. Brennan (1864–1943), Democratic politician in the U.S. state of Ohio. "}, {"url": "http://www.allgov.com/news/appointments-and-resignations/director-of-the-central-intelligence-agency-who-is-john-brennan-130204?news=846960", "passage_text": "If so, he would succeed David Petraeus, who resigned following revelations of an extra-marital affair in November 2009. Born September 22, 1955, to Irish immigrant parents from Roscommon, Ireland, John Brennan grew up in North Bergen, New Jersey, graduating from St. Joseph of the Palisades High School in 1973. "}, {"url": "http://www.imdb.com/name/nm1226313/bio", "passage_text": "Mini Bio (1). John Brennan was born on 16 February 1948 in Perth, Western Australia as the fourth of seven children to parents Gerald Brennan, a chartered accountant and Joy Corrigan a country girl. He grew up on a lush citrus orchard on the banks of the Canning River. This outdoor lifestyle continued into his working life."}, {"url": "http://freepages.genealogy.rootsweb.ancestry.com/~janej/Jane/images/Brennan.-o/p4.htm", "passage_text": "Emily (Emmie) Johnson was born in 1880. She married William Patrick Brennan, son of John Brennan and Delia Higgins, on 18 April 1906 at at residence of Emmie's parents, Ponsonby, Auckland. Emily (Emmie) Johnson died on 12 January 1954 at Auckland; Buried in Otahuhu Cemetery. M, b. 4 February 1878, d. 18 August 1959. Charles Andrew was born on 4 February 1878 at Pakuranga, Auckland. He married Delia Veronica Brennan, daughter of John Brennan and Delia Higgins, on 19 May 1909 at Church of the Assumption, Onehu"}, {"url": "http://freepages.genealogy.rootsweb.ancestry.com/~janej/Jane/images/Brennan.-o/p4.htm", "passage_text": "1 Jan 1928|p12.htm#i1379||||||||||||| Thomas George Pollard was born in 1870.2 He was the son of Napian William Pollard and Harriett White. Thomas George Pollard married Mary Ada Brennan, daughter of John Brennan and Delia Higgins, in 1894. M, b. 4 February 1878, d. 18 August 1959. Charles Andrew was born on 4 February 1878 at Pakuranga, Auckland. He married Delia Veronica Brennan, daughter of John Brennan and Delia Higgins, on 19 May 1909 at Church of the Assumption, Onehu"}, {"url": "http://freepages.genealogy.rootsweb.ancestry.com/~janej/Jane/images/Brennan.-o/p4.htm", "passage_text": "Percival Henry Meredith was born on 23 December 1867. He was the son of Henry Mark Meredith and Elizabeth Emma Sissons. Percival Henry Meredith married Clara Stanislaus Brennan, daughter of John Brennan and Delia Higgins, in 1899. 1 Percival Henry Meredith was Pianist in 1926. M, b. 4 February 1878, d. 18 August 1959. Charles Andrew was born on 4 February 1878 at Pakuranga, Auckland. He married Delia Veronica Brennan, daughter of John Brennan and Delia Higgins, on 19 May 1909 at Church of the Assumption, Onehu"}, {"url": "https://en.wikipedia.org/wiki/Walter_Brennan", "passage_text": "He was the second of three children born to Irish immigrants William John Brennan and Margaret Elizabeth Flanagan. The elder Brennan was an engineer and inventor and young Walter studied engineering at Rindge Technical High School in Cambridge, Massachusetts. "}]