[{"url": "http://www.doityourself.com/stry/what-is-humus-soil", "passage_text": "Humus is not a soil type but is in fact a mature compost, either made through a composting process or found in nature, such as the rich topsoil found in some forests."}, {"url": "http://www.answers.com/Q/What_is_humus_soil_made_up_of", "passage_text": "Rich soil is made up of sand, silt, clay and organic matter (compost) in various stages of decomposition."}, {"url": "http://www.wisegeek.org/what-is-humus-soil.htm", "passage_text": "Humus soil is soil made up of decayed organic material. Popularly, it refers to soil that is light in texture, dark brown or black in color, and sweet-smelling. It is considered the richest soil and is usually described as the ideal soil type."}, {"url": "http://www.answers.com/Q/What_is_humus_soil_made_up_of", "passage_text": "Making the world better, one answer at a time. Rich soil is made up of sand, silt, clay and organic matter (compost) in various stages of decomposition. Humus is the stable remains of decayed organic matter, carbon remains of unknown sorts that attach themselves to clay to improve soil structure. Humus has the ability to increase the soil's water retention, buffer PH, and helps the plant use nutrients although humus is not fertilizer but humic acids and humins."}, {"url": "http://www.wisegeek.org/what-is-humus-soil.htm", "passage_text": "Adorable animal families that will make you aww. Humus soil is soil made up of decayed organic material. Popularly, it refers to soil that is light in texture, dark brown or black in color, and sweet-smelling. It is considered the richest soil and is usually described as the ideal soil type."}, {"url": "http://www.brighthub.com/environment/science-environmental/articles/106281.aspx", "passage_text": "At its broadest, the term soil can refer to any kind of loose sediment. In geology, soil is the end result of rock weathering. And in soil science, it is weathered rock combined with decayed organic material that can support plant growth."}, {"url": "http://www.brighthub.com/environment/science-environmental/articles/106281.aspx", "passage_text": "What Soil is Made Of: Humus. After a plant dies, things living in the soil such as earthworms, fungi, and soil microbes decompose it by eating its constituent organic compounds-carbohydrates, proteins, fats, lignins, etc."}, {"url": "http://www.ehow.com/info_8539245_humus-soil.html", "passage_text": "Humus is inactive organic material, usually decomposed plants. Most soil has humus in varying amounts, which gives it the distinctive dark brown color. Humus is complex and is made up of a variety of substances that have decomposed to the point of being impossible to identify."}]