[{"url": "https://answers.yahoo.com/question/index?qid=20080204015100AAYx2Uj", "passage_text": "Australia is a country and is also a continent. There are no other countries in Australia. All countries do not have to be part of a continent. Tasmania is part of the country Australia, but is not part of the continent of Australia. The proper, official name of our continent is Australia. New Zealand and Fiji are separate Countries and are not part of the continent of Australia of the country Australia. Maybe you should get a teacher who knows something about the world."}, {"url": "http://www.answers.com/Q/Which_continent_is_Australia_on", "passage_text": "Australia is in the continent of Australia. It is both a continent  and a country.    Note: contrary to erroneous opinion, it is not in the continent  of either Aus … tralasia or Oceania. Neither of these is a  geographical continent, but rather, they are both political  regions. It is also an island continent, as it is completely surrounded by water. Australia is also counted in the geographical regions of Oceania and Australasia with islands such as New Zealand and New Guinea, and other islands of the South Pacific."}, {"url": "http://www.7continentslist.com/australia/", "passage_text": "Best Places to Visit in Australia. Australia – the smallest continent and the largest country on the planet – is full of wonderful attractions for tourists. From ancient natural landmarks to spectacular modern architecture, the region offers a wide range of fascinating places to visit. The predominant country on this continent is Australia which is a high metropolitan country with has multi-diverse cultures and languages, rich in valuable treasure of wildlife and exotic beaches. It is the world 18th most urbanized country of the earth"}, {"url": "http://www.answers.com/Q/Which_continent_is_Australia_on", "passage_text": "Yes. Australia is the world's smallest continent (not the largest island) and it is a country. There are no other countries on the continent of Australia. It is the only cou … ntry/continent in the world that is a continent, and a country at the same time. It is also an island continent, as it is completely surrounded by water. Australia is also counted in the geographical regions of Oceania and Australasia with islands such as New Zealand and New Guinea, and other islands of the South Pacific."}, {"url": "https://answers.yahoo.com/question/index?qid=20061128224213AATPXBC", "passage_text": "Relevance. Rating Newest Oldest. Best Answer: (m) Australia (also called Australia-New Guinea, Sahul, Meganesia, Greater Australia or Australinea) is a continent comprising (in order of size) the Australian mainland, New Guinea, Tasmania, and intervening islands, all of which sit on the same continental shelf. Australia is both an island and a continent so it is not part of any other continent. Australasia is just a general term for that area of the Pacific. Papua New Guinea is not part of Australia. Tasmania is one of the states like Victoria, New South Wales, Queensland and Western Australia"}, {"url": "http://www.answers.com/Q/Which_continent_is_Australia_on", "passage_text": "Because Australia is a Continent and an Island. Geographically, Australia is a continent, not an island. As a landform, it could be considered an island as it is entirely sur … rounded by water and not joined onto any other land mass. For this reason, it is often referred to as an island continent. It is also an island continent, as it is completely surrounded by water. Australia is also counted in the geographical regions of Oceania and Australasia with islands such as New Zealand and New Guinea, and other islands of the South Pacific."}, {"url": "http://www.whatarethe7continents.com/australia/", "passage_text": "Of the seven continents, Australia is the smallest by land mass and the second smallest by population, beaten only by Antarctica which has no permanent residents. While Australia may be small compared to other continents, it is the sixth largest country in the world by land mass. There are approximately twenty three million people living in Australia."}, {"url": "https://en.wikipedia.org/wiki/Australia_(continent)", "passage_text": "New Zealand is not part of the continent of Australia, but of the separate, submerged continent of Zealandia. New Zealand and Australia are both part of the wider regions known as Australasia and Oceania. The continent lies on a continental shelf overlain by shallow seas which divide it into several landmasses—the Arafura Sea and Torres Strait between mainland Australia and New Guinea, and Bass Strait between mainland Australia and Tasmania."}]