[{"url": "http://www.nyhq.org/Blood_Facts", "passage_text": "The blood also carries away waste products. The adult human body contains approximately 5 liters (5.3 quarts) of blood which makes up 7 to 8 percent of total body weight. Approximately 2.75 to 3 liters of blood is plasma and the rest is the cellular portion. Plasma is the liquid portion of the blood. Blood cells float in the plasma."}, {"url": "http://wonderopolis.org/wonder/how-much-blood-is-in-your-body/", "passage_text": "Scientists estimate the volume of blood in a human body to be approximately 7 percent of body weight. An average adult body with a weight of 150 to 180 pounds will contain approximately 4.7 to 5.5 liters (1.2 to 1.5 gallons) of blood. An average child with a body weight of 80 pounds will have approximately half the amount of blood as an adult. Blood carries out many critical functions in the body."}, {"url": "http://www.answers.com/Q/How_much_blood_is_in_the_human_body", "passage_text": "Blood makes up about 7% of your body's weight. The average adult has 10 pints of blood in his or her body. One unit of blood is roughly the equivalent of one pint. This proportion is much greater in children, and slightly different in men and women. Men, on average, have 8 to 10 pints, while women have 5 to 8 pints."}, {"url": "http://health.howstuffworks.com/human-body/systems/circulatory/blood.htm", "passage_text": "The adult human body contains approximately 5 liters (5.3 quarts) of blood; it makes up 7 to 8 percent of a person's body weight. Approximately 2.75 to 3 liters of blood is plasma and the rest is the cellular portion."}, {"url": "http://www.hematology.org/Patients/Basics/", "passage_text": "The blood that runs through the veins, arteries, and capillaries is known as whole blood, a mixture of about 55 percent plasma and 45 percent blood cells. About 7 to 8 percent of your total body weight is blood. An average-sized man has about 12 pints of blood in his body, and an average-sized woman has about 9 pints."}]