[{"url": "http://www.novapdf.com/kb/convert-jpg-to-pdf-or-other-image-formats-to-pdf-105.html", "passage_text": "You can convert images (jpeg, png, gif, bmp, jpg) to PDF files by using a PDF converter. Simply open the image with a viewer, click on Print and select the PDF printer to convert the image to PDF."}, {"url": "http://www.print-driver.com/how-to/convert-pdf-to-jpg", "passage_text": "The easiest way to convert PDF to a JPEG file is to print it using a virtual printer. A virtual printer differs from a desktop printer only in that instead of printing the document on a sheet of paper it saves the document as a PDF graphic file (JPEG, TIFF or PNG)."}, {"url": "http://www.youtube.com/watch?v=ts-Wbe6UcJw", "passage_text": "Learn how to turn a JPG into a PDF using Photoshop. You also need to have Adobe Acrobat (the free Reader) or Primo PDF (also free) installed on your computer so it will Print to PDF. As long as you can crop the JPG using either Fireworks of Photoshop you can print to PDF. Easy!"}, {"url": "http://www.peernet.com/how-to-convert-jpg-image-to-pdf-file/", "passage_text": "Select the layout for your JPEG image, then click the Print button. PDF Creator Plus will display the printed JPEG image. Click the Create PDF button to convert your JPEG to PDF now or continue printing JPEG or other files to the PDF Creator Plus 7.0 printer to add more pages. 1  In the Create File dialog: 2  Type in a name for your new PDF document and choose where to save it."}, {"url": "http://www.wikihow.com/Convert-PDF-to-JPEG", "passage_text": "Save/Export each image as a JPG. In Photoshop or PaintShop Pro, click File and select Save As. Select JPG as the file type. You can then choose the quality that you would like to save the JPG as. For GIMP, click File and select Export. Choose JPG from the dropdown menu of formats."}, {"url": "http://www.wikihow.com/Convert-PDF-to-JPEG", "passage_text": "3. Click File and then select Export. In the Export dialog box, select JPEG from the Format dropdown menu. You can then adjust the output quality and resolution if you desire. You can also change the name of the file if you want to differentiate it."}]