[{"url": "https://en.wikipedia.org/wiki/Licensed_professional_counselor", "passage_text": "Licensed professional counselors (LPCs) are master’s-degreed mental health service providers, trained to work with individuals, families, and groups in treating mental, behavioral, and emotional problems and disorders."}, {"url": "http://www.answers.com/Q/What_is_the_difference_between_a_LCSW_and_a_LPC", "passage_text": "NO. LPCs (Licensed Professional Counselors) are not allowed to sit for LCSW (Licensed Clinical Social Worker) exams in any state. In many states, LCSWs are allowed to sit for … LPC exams and be conferred LPC licensure by virtue of passing the examination."}, {"url": "https://en.wikipedia.org/wiki/Licensed_professional_counselor", "passage_text": "However in most states LPC's or LMHC's may practice independently. Licensed Professional Counselors are one of the six types of licensed mental health professionals who provide psychotherapy in the United States. See http://www.counseling.org/publicpolicy/whoarelpcs.pdf."}, {"url": "http://www.lpc.ms.gov/", "passage_text": "1 The Mississippi Board of Examiners for Licensed Professional Counselors purpose is to provide for the regulation and practice of counseling as well as the use of the title Licensed Professional Counselor to ensure the protection of the public heath, safety and welfare of the citizens of the State of Mississippi."}, {"url": "http://abec.alabama.gov/", "passage_text": "The Alabama Board of Examiners in Counseling is a regulatory agency that is appointed by the Governor and is comprised of licensed professional counselors and the public whose mission is: - To protect the public from incompetent, unethical and unlawful counseling practice."}, {"url": "https://en.wikipedia.org/wiki/Licensed_professional_counselor", "passage_text": "In U.S., the exact title varies by state, but the other most frequently used title is licensed mental health counselor (LMHC). Several U.S. states, including Illinois, Maine, and Tennessee, have implemented a two-tier system whereby both the LPC and LCPC (or equivalent) are used."}, {"url": "http://www.bbs.ca.gov/consumer/what_is.shtml", "passage_text": "The scope of practice for Licensed Professional Clinical Counselors (LPCCs) is set forth in California Business and Professions Code section 4999.20 and Title 16, California Code of Regulations, Section 1820.5, both of which are available in the Board’s Statutes and Regulations handbook."}, {"url": "http://www.lpcboard.org/Counselor%20Intern%20FAQs.pdf", "passage_text": "The role of the LPC Board is to determine whether applicants are eligible for registrations or licenses and to investigate accusations of illegal, unethical, or inappropriate practice of mental health counseling or marriage and family therapy in Louisiana. State laws and Board rules govern our actions."}, {"url": "http://www.allpsychologycareers.com/career/licensed-professional-counselor.html", "passage_text": "The counseling field of Licensed Professional Counselors (LPCs) is one of the most marketable and practical ways to enter the counseling field. Those holding master’s degrees in psychology are eligible to become licensed to become what most refer to as professional counselors, or LPCs."}]