[{"url": "http://www.efim.org/about/what-internal-medicine", "passage_text": "The specialist in internal medicine-the internist-most commonly practices in hospitals where he may care for the patients during an acute illness or supervise their care in out patient clinics. In some European countries a significant proportion of internists have an office-based practice with links to local hospitals. Such an internist is not, however, a family physician who looks after a much broader range of problems including obstetrics and surgery, and including children as well as adults."}, {"url": "https://www.med.unc.edu/imig/about", "passage_text": "Internal Medicine encompasses the care of all adults, healthy and sick. Internists (as all doctors who complete an internal medicine residency are called) can be generalists or subspecialists, like cardiologists or rheumatologists. If you choose not to subspecialize, you are known as a General Internist. "}, {"url": "http://www1.salary.com/Internist-salary.html", "passage_text": "For example the median expected annual pay for a typical Physician-Internal Medicine in the United States is $198,690, so 50% of the people who perform the job of Physician-Internal Medicine in the United States are expected to make less than $198,690. The annual salary for someone with the job title Physician-Internal Medicine may vary depending on a number of factors including industry, company size, location, years of experience and level of education."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=3995", "passage_text": "Internal medicine: The medical specialty dedicated to the diagnosis and medical treatment of adults. A physician who specializes in internal medicine is referred to as an internist. "}, {"url": "https://en.wikipedia.org/wiki/Internal_medicine", "passage_text": "Internal medicine or general medicine (in Commonwealth nations) is the medical specialty dealing with the prevention, diagnosis, and treatment of adult diseases. Physicians specializing in internal medicine are called internists, or physicians (without a modifier) in Commonwealth nations. Internists are skilled in the management of patients who have undifferentiated or multi-system disease processes. Internists are qualified physicians with postgraduate training in internal medicine and should not be confused with  interns , who are doctors in their first year of residency training (officially the term intern is no longer in use)."}, {"url": "http://www.efim.org/about/what-internal-medicine", "passage_text": "The specialty of internal medicine covers a wide range of conditions affecting the internal organs of the body-the heart, the lungs, the liver and gastro-intestinal tract, the kidneys and urinary tract, the brain, spinal column, nerves, muscles and joints. In some European countries a significant proportion of internists have an office-based practice with links to local hospitals. Such an internist is not, however, a family physician who looks after a much broader range of problems including obstetrics and surgery, and including children as well as adults."}, {"url": "http://www.wisegeek.com/what-is-an-internal-medicine-specialist.htm", "passage_text": "Some internal medicine specialists treat cardivascular disorders and respiratory diseases. Internal medicine specialists who run their own practice may spend a lot of time on administrative needs. An internal medicine specialist will treat more than just the internal organs. Internal medicine specialists treat the whole body, not just the internal organs. An internal medicine physician diagnoses and treats adult diseases. Some internal medicine specialists focus on patients who are obese or have cardiovascular problems. An internal medicine specialist may be called upon to treat an ulcer. "}, {"url": "http://www.wisegeek.org/what-is-internal-medicine.htm", "passage_text": "Internal medicine is a medical specialty which focuses on the diagnosis, treatment, and prevention of nonsurgical conditions in adults. This specialty has a number of subspecialties ranging from nephrology, the study of the kidneys, to immunology, the study of allergies and immune system disorders. Internists employ a variety of diagnostic techniques. Doctors specializing in internal medicine focus on nonsurgical conditions in adults. Some areas of internal medicine include cardiology, endocrinology and oncology. An immunology specialist is an internal medicine doctor who diagnoses and treats allergies."}, {"url": "https://en.wikipedia.org/wiki/Internal_medicine", "passage_text": "Because internal medicine patients are often seriously ill or require complex investigations, internists do much of their work in hospitals. Internists often have subspecialty interests in diseases affecting particular organs or organ systems. Internists are qualified physicians with postgraduate training in internal medicine and should not be confused with  interns , who are doctors in their first year of residency training (officially the term intern is no longer in use)."}]