[{"url": "https://en.wikipedia.org/wiki/National_Electrical_Code", "passage_text": "The National Electrical Code (NEC), or NFPA 70, is a regionally adoptable standard for the safe installation of electrical wiring and equipment in the United States. It is part of the National Fire Codes series published by the National Fire Protection Association (NFPA), a private trade association. The NEC is approved as an American national standard by the American National Standards Institute (ANSI). It is formally identified as ANSI/NFPA 70. First published in 1897, the NEC is updated and published every three years."}, {"url": "http://www.thefreedictionary.com/NEC", "passage_text": "Noun. 1. NEC-an acute inflammatory disease occurring in the intestines of premature infants; necrosis of intestinal tissue may follow. necrotizing enterocolitis. inflammatory disease-a disease characterized by inflammation. 1  Facebook. "}, {"url": "https://en.wikipedia.org/wiki/NEC", "passage_text": "NEC Corporation (日本電気株式会社, Nippon Denki Kabushiki Gaisha) is a Japanese multinational provider of information technology (IT) services and products, with its headquarters in Minato, Tokyo, Japan. NEC provides IT and network solutions to business enterprises, communications services providers and to government agencies. The company was known as the Nippon Electric Company, Limited, before rebranding in 1983 as just NEC. In 1980, NEC created the first digital signal processor, the NEC µPD7710. NEC Semiconductors (UK) Ltd. was established in 1981, producing VLSIs and LSIs. NEC introduced the 8-bit PC-8800 series personal computer in 1981, followed by the 16-bit PC-9800 series in 1982."}, {"url": "http://www.necam.com/Phones/", "passage_text": "Please note that JavaScript and style sheet are used in this website, Due to unadaptability of the style sheet with the browser used in your computer, pages may not look as original. Even in such a case, however, the contents can be used safely. NEC's IPv6-ADAPTER (IP6-L) allows connection from existing UNIVERGE® IP Desktop Terminals to an IPv6 only network while preserving existing underlying network. Converts a new or existing wired NEC UNIVERGE DT750, DT730G and DT730 series IP telephones into a wireless one that can be placed virtually in any location."}, {"url": "https://www.necam.com/", "passage_text": "Please note that JavaScript and style sheet are used in this website, Due to unadaptability of the style sheet with the browser used in your computer, pages may not look as original. Even in such a case, however, the contents can be used safely. "}, {"url": "http://www.nec.com/", "passage_text": "Jump to main content. Please note that JavaScript and style sheet are used in this website, due to unadaptability of the style sheet with the browser used in your computer, pages may not look as original.Even in such a case, however, the contents can be used safely. "}, {"url": "https://en.wikipedia.org/wiki/NEC", "passage_text": "NEC Electronics Corporation was separated from NEC in 2002 as a new semiconductor company. NEC Laboratories America, Inc. (NEC Labs) started in November, 2002 as a merger of NEC Research Institute (NECI) and NEC USA’s Computer and Communications Research Laboratory (CCRL). In 1980, NEC created the first digital signal processor, the NEC µPD7710. NEC Semiconductors (UK) Ltd. was established in 1981, producing VLSIs and LSIs. NEC introduced the 8-bit PC-8800 series personal computer in 1981, followed by the 16-bit PC-9800 series in 1982."}, {"url": "https://www.neccontract.com/About-NEC", "passage_text": "About NEC. NEC is a family of contracts that facilitates the implementation of sound project management principles and practices as well as defining legal relationships. "}, {"url": "http://www.webopedia.com/TERM/N/NEC.html", "passage_text": "Main » TERM » N ». One of the world's largest computer and electronics manufacturers. NEC Technologies is the second largest producers of semiconductors (Intel is first) and its line of monitors has set the standard for many years. It also produces PCs and notebook computers, and controls half the PC market in Japan. We look at a few of the more troubling aspects of statistics and how these may be used to advance an agenda or skew the facts to someone's... Read More ». From wacky alarm clocks to lecture hall tools and after class entertainment, these Android apps are a good fit for a student's life and budget"}, {"url": "https://en.wikipedia.org/wiki/National_Electrical_Code", "passage_text": "The NEC is developed by NFPA's Committee on the National Electrical Code, which consists of 19 (20 in 2008) code-making panels and a technical correlating committee. Work on the NEC is sponsored by the National Fire Protection Association. The NEC is approved as an American national standard by the American National Standards Institute (ANSI). It is formally identified as ANSI/NFPA 70. First published in 1897, the NEC is updated and published every three years."}]