[{"url": "https://en.wikipedia.org/wiki/The_Coca-Cola_Company", "passage_text": "The company is best known for its flagship product Coca-Cola, invented in 1886 by pharmacist John Stith Pemberton in Columbus, Georgia. The Coca-Cola formula and brand was bought in 1889 by Asa Griggs Candler (December 30, 1851 – March 12, 1929), who incorporated The Coca-Cola Company in 1892. The company operates a franchised distribution system dating from 1889 where The Coca-Cola Company only produces syrup concentrate which is then sold to various bottlers throughout the world who hold an exclusive territory. The Coca-Cola Company owns its anchor bottler in North America, Coca-Cola Refreshments. Its stock is listed on the NYSE and is part of DJIA; S&P 500 index; the Russell 1000 Index; and the Russell 1000 Growth Stock Index. As of 2015, its chairman and CEO is Muhtar Kent"}, {"url": "http://www.answers.com/Q/Where_is_Coca-Cola_Company_corporate_headquarters_located", "passage_text": "The Coca-Cola Headquarters is located at 1 Coca-Cola Plaza in Atlanta, Georgia. Coca Cola company headquarters is located in midtown Atlanta, Georgia. The North Avenue tower is one of the most visible building and is located across the street from Georgi … a Institute of Technology. Geoff Canyon."}, {"url": "http://www.answers.com/Q/Where_is_Coca-Cola_Company_corporate_headquarters_located", "passage_text": "Answer by Mmx3845. Confidence votes 8. The Coca-Cola Headquarters is located at 1 Coca-Cola Plaza in Atlanta, Georgia. It is part of a larger complex located on North Avenue near the Georgia Tech campus. Coca Cola company headquarters is located in midtown Atlanta, Georgia. The North Avenue tower is one of the most visible building and is located across the street from Georgi … a Institute of Technology. Geoff Canyon."}, {"url": "https://en.wikipedia.org/wiki/World_of_Coca-Cola", "passage_text": "The World of Coca-Cola is a museum showcasing the history of The Coca-Cola Company that contains a host of entertainment areas and attractions, and is located in Atlanta, Georgia (where the company's headquarters are located) at Pemberton Place (named in honor of John Pemberton, the inventor of Coca-Cola). "}, {"url": "http://cokeconsolidated.com/our-company.aspx", "passage_text": "Our Company. Coca-Cola Bottling Co. Consolidated (CCBCC) is the nation's largest independent Coca-Cola bottler. The Company operates primarily in the Southeast, with corporate offices located in Charlotte, North Carolina. CCBCC stock is traded on the NASDAQ exchange under the symbol COKE. "}, {"url": "http://www.atlantaga.gov/index.aspx?page=413", "passage_text": "The Dixie Coca-Cola Bottling Company Plant is located on the southeast corner of Edgewood Avenue and Courtland Street. The Edgewood Avenue building is one of the earliest extant historic structures associated with Coca-Cola in Atlanta. DIXIE COCA-COLA BOTTLING COMPANY PLANT. The old Dixie Coca-Cola Bottling Company Plant is located on an irregularly shaped lot"}, {"url": "https://en.wikipedia.org/wiki/The_Coca-Cola_Company", "passage_text": "J. Paul Austin, the chairman and CEO of Coca-Cola, and Mayor Ivan Allen summoned key Atlanta business leaders to the Commerce Club's eighteenth floor dining room, where Austin told them flatly, 'It is embarrassing for Coca-Cola to be located in a city that refuses to honor its Nobel Prize winner. The company operates a franchised distribution system dating from 1889 where The Coca-Cola Company only produces syrup concentrate which is then sold to various bottlers throughout the world who hold an exclusive territory. The Coca-Cola Company owns its anchor bottler in North America, Coca-Cola Refreshments. Its stock is listed on the NYSE and is part of DJIA; S&P 500 index; the Russell 1000 Index; and the Russell 1000 Growth Stock Index. As of 2015, its chairman and CEO is Muhtar Kent"}, {"url": "http://www.answers.com/Q/Where_is_Coca-Cola_Company_corporate_headquarters_located", "passage_text": "Where are the headquarters of the Coca-Cola Company? Coca Cola company headquarters is located in midtown Atlanta, Georgia. The North Avenue tower is one of the most visible building and is located across the street from Georgi … a Institute of Technology. Geoff Canyon."}, {"url": "http://careers.cokecce.com/en/experienced/about/locations/", "passage_text": "Locations. Coca-Cola Enterprises provides products and services that meet the beverage and business needs in Belgium, France, Great Britain, Luxemburg, the Netherlands, Norway, and Sweden. Coca-Cola Light. The commercial business unit has people all over Sweden from North to South. The head office and manufacturing plant are located together in Stockholm, Jordbro, 30 minutes outside of the city centre, accessible by commuter train. For detailed address information visit the Coca-Cola Sweden site."}]