[{"url": "http://naturalgas.org/overview/uses/", "passage_text": "Uses. For hundreds of years, natural gas has been known as a very useful substance. The Chinese discovered a very long time ago that the energy in natural gas could be harnessed, and used to heat water. In the early days of the natural gas industry, the gas was mainly used to light streetlamps, and the occasional house. "}, {"url": "http://geology.com/articles/natural-gas-uses/", "passage_text": "In the United States, most natural gas is burned as a fuel. In 2012 about 30% of the energy consumed across the nation was obtained from natural gas (1). It was used to generate electricity, heat buildings, fuel vehicles, heat water, bake foods, power industrial furnaces, and even run air conditioners! The use of natural gas in commercial buildings is similar to its use in residences. It is used mainly for space heating, water heating and sometimes for air conditioning. The electric power industry was the largest consumer of natural gas in the United States during 2013."}, {"url": "https://en.wikipedia.org/wiki/Natural_gas", "passage_text": "Natural gas can be used to produce hydrogen, with one common method being the hydrogen reformer. Hydrogen has many applications: it is a primary feedstock for the chemical industry, a hydrogenating agent, an important commodity for oil refineries, and the fuel source in hydrogen vehicles. Natural gas is found in deep underground rock formations or associated with other hydrocarbon reservoirs in coal beds and as methane clathrates. Petroleum is another resource and fossil fuel found in close proximity to, and with natural gas."}, {"url": "http://geology.com/articles/natural-gas-uses/", "passage_text": "About 21% of the natural gas consumed in the United States during 2013 went to homes (1). This gas is delivered to homes through pipelines or in tanks as CNG (compressed natural gas). Most of the natural gas consumed in homes is used for space heating and water heating. It is also used in stoves, ovens, clothes dryers, lighting fixtures and other appliances. In 2013 about 14% of the natural gas consumed in the United States went to commercial buildings. The use of natural gas in commercial buildings is similar to its use in residences. It is used mainly for space heating, water heating and sometimes for air conditioning. The electric power industry was the largest consumer of natural gas in the United States during 2013."}, {"url": "http://www.fueleconomy.gov/feg/bifueltech.shtml", "passage_text": "Natural gas, a fossil fuel comprised mostly of methane, is one of the cleanest burning alternative fuels. It can be used in the form of compressed natural gas (CNG) or liquefied natural gas (LNG) to fuel cars and trucks. "}, {"url": "http://www.energy.alberta.ca/NaturalGas/723.asp", "passage_text": "Natural gas is one of the cleanest, safest, and most useful forms of energy in our day-to-day lives. Natural gas is a hydrocarbon, which means it is made up of compounds of hydrogen and carbon. The simplest hydrocarbon is methane; it contains one carbon atom and four hydrogen atoms. Natural gas can be found by itself or in association with oil."}, {"url": "http://www.ucsusa.org/clean_energy/our-energy-choices/coal-and-other-fossil-fuels/uses-of-natural-gas.html", "passage_text": "Natural gas is a versatile, clean-burning, and efficient fuel that is used in a wide variety of applications. In the 19th and early 20th centuries, natural gas was used primarily for street and building lighting, providing what was known as gaslight. Today, improved distribution of gas has made possible a wide variety of uses in homes, businesses, factories, and power plants. The fastest growing use of natural gas today is for the generation of electric power. Natural gas power plants usually generate electricity in gas turbines (which are derived from jet engines), directly using the hot exhaust gases of fuel combustion."}, {"url": "https://en.wikipedia.org/wiki/Natural_gas", "passage_text": "Natural gas is a fossil fuel formed when layers of decomposing plant and animal matter are exposed to intense heat and pressure over thousands of years. The energy that the plants originally obtained from the sun is stored in the form of chemical bonds in natural gas. Natural gas is found in deep underground rock formations or associated with other hydrocarbon reservoirs in coal beds and as methane clathrates. Petroleum is another resource and fossil fuel found in close proximity to, and with"}, {"url": "http://www.ucsusa.org/clean_energy/our-energy-choices/coal-and-other-fossil-fuels/uses-of-natural-gas.html", "passage_text": "Hydrogen produced from natural gas can itself be used as a fuel. The most efficient way to convert hydrogen into electricity is using a fuel cell, which combines hydrogen with oxygen to produce electricity, water, and heat. The fastest growing use of natural gas today is for the generation of electric power. Natural gas power plants usually generate electricity in gas turbines (which are derived from jet engines), directly using the hot exhaust gases of fuel combustion."}, {"url": "https://en.wikipedia.org/wiki/Natural_gas", "passage_text": "Natural gas is an energy source often used for heating, cooking, and electricity generation. It is also used as fuel for vehicles and as a chemical feedstock in the manufacture of plastics and other commercially important organic chemicals. Natural gas is found in deep underground rock formations or associated with other hydrocarbon reservoirs in coal beds and as methane clathrates. Petroleum is another resource and fossil fuel found in close proximity to, and with natural gas."}]