[{"url": "http://www.rehabs.com/about/eating-disorder-rehabs/", "passage_text": "Paying for Eating Disorder Treatment. The cost of eating disorder treatment can run from $500 to $2,000 per day, according to the South Carolina Department of Mental Health. Insurance companies have only recently begun recognizing eating disorders as a serious mental illness, and it may be difficult to get coverage."}, {"url": "http://well.blogs.nytimes.com/2010/12/03/the-cost-of-an-eating-disorder/comment-page-4/", "passage_text": "Care for patients with eating disorders can be expensive, an issue explored in today’s Patient Money column. Many must be seen on a weekly basis by a team of specialists, including a psychiatrist, a physician and a nutritionist. A residential program costs $30,000 a month on average. And many patients require three or more months of treatment, often at a facility far from home."}, {"url": "http://www.nedc.com.au/treatment-costs", "passage_text": "Medicare. Medicare may cover some or all costs related to different types of eating disorder treatments. If you are hospitalised in a public hospital because you are in need of medical care Medicare may also cover some of your costs for hospital treatment. "}, {"url": "http://www.healthyplace.com/eating-disorders/transcripts/eating-disorders-treatment-centers/", "passage_text": "Dr. Kerr-Price: You have just described different levels of treatment. Eating disorders vary in their severity and so require different levels of help depending on the individual. The greater the problem with the disorder, the more likely an intensive program is needed to help manage it. Dr. Kerr-Price: An eating disorder treatment center is a place where girls and women go in order to receive intensive help for their eating disorders. David Roberts: There's regular counseling, where you see a therapist in his/her office."}, {"url": "http://www.eatingdisorderinformation.org/costs.html", "passage_text": "Costs. Costs and Medical Insurance for Eating Disorders. Medical costs for treating eating disorders are astronomical and may or may not quality for medical reimbursement depending on the type of coverage. Residential treatment can cost up to $1000 per day, and monthly expenses range from $25,000 to $50,000"}, {"url": "http://www.psychguides.com/guides/using-aetna-for-eating-disorder-treatment/", "passage_text": "The cost of eating disorder treatment depends on a number of factors. Inpatient treatment can range anywhere from $500 to $2,000 a day, and the average cost for a 30-day stay in a treatment facility is $30,000. Patients often need from three to six months of inpatient care. You may have to make an expected out-of-pocket contribution even if your Aetna plan covers treatment. Be sure to check your specific plan to find information regarding copays and deductibles that you may be responsible for. For help finding treatment for an eating disorder, call us at 1-888-366-2335 today."}, {"url": "http://well.blogs.nytimes.com/2010/12/03/the-cost-of-an-eating-disorder/comment-page-4/", "passage_text": "I have battled a vicious eating disorder (binge eating, restricting and exercise bulimia – to the point of serious health problems, only at age 25) and found true peace with food and my body through Overeaters Anonymous – http://www.oa.org – for the past 4 years. Many must be seen on a weekly basis by a team of specialists, including a psychiatrist, a physician and a nutritionist. A residential program costs $30,000 a month on average. And many patients require three or more months of treatment, often at a facility far from home."}, {"url": "http://www.healthyplace.com/eating-disorders/eating-disorders-overview/eating-disorder-treatment-center-and-facilities/", "passage_text": "Costs of treating an eating disorder at an eating disorder treatment facility can be very high. Inpatient eating disorder treatment center stays are, on average, $30,000 a month, or more, with stays in the 3-6 month range for those with a severe eating disorder. Goals and Cost of Eating Disorder Treatment Facilities. The goals of treatment, whether through an eating disorder treatment facility or not, are to create new, healthy eating behaviors, patterns and relationships with food as well as weight normalization."}, {"url": "http://www.eatingdisordersonline.com/treatment/eating-disorder-treatment-centers", "passage_text": "The programs are often effective, the staff professional, and the setting is often beautiful. However, daily costs for a stay at an eating disorder treatment center can average $1,000. Rarely will health insurance cover much of the stay. However, do not assume you aren’t covered. "}, {"url": "http://www.healthyplace.com/eating-disorders/transcripts/eating-disorders-treatment-centers/", "passage_text": "We cover what an eating disorder treatment center is, what goes on there, the eating disorder warning signs that indicate you need inpatient treatment, how much it costs, and whether treating the physical symptoms of an eating disorder is enough or are the psychological issues just as important. Dr. Kerr-Price: An eating disorder treatment center is a place where girls and women go in order to receive intensive help for their eating disorders. David Roberts: There's regular counseling, where you see a therapist in his/her office."}]