[{"url": "http://family.findlaw.com/parental-rights-and-liability/when-can-you-leave-a-child-home-alone-.html", "passage_text": "Only a couple of states have laws that specify the age when a child can be left home alone, including Maryland (age 8) and Illinois (age 14). However, most states have guidelines with the Department of Health and Human Services or other child protective agencies that test a child's ability to be left home alone."}, {"url": "http://info.legalzoom.com/legal-age-children-left-alone-pennsylvania-20767.html", "passage_text": "A parent who leaves a child home alone before he is ready may face charges of neglect in Pennsylvania. Although Pennsylvania doesn't have a set minimum age at which it's legal for children to be left home alone, a parent is still responsible for knowing when her child may be safely left home without supervision."}, {"url": "http://family.findlaw.com/parental-rights-and-liability/when-can-you-leave-a-child-home-alone-.html", "passage_text": "8 to 10 years-Should not be left alone for more than 1½ hours and only during daylight and early evening hours. 11 to 12 years-May be left alone for up to 3 hours but not late at night or in circumstances requiring inappropriate responsibility. 13 to 15 years-May be left unsupervised, but not overnight. 16 to 17 years-May be left unsupervised (in some cases, for up to two consecutive overnight periods). It is important to note that no two children are alike, and parents must decide on a case-by-case basis what is best for their child."}, {"url": "http://www.sheknows.com/parenting/articles/819325/The-kids-home-alone-debate-What-s-the-right-age", "passage_text": "Legal age for kids home alone. Some states have laws governing what age you can legally leave them home, ranging from age 8 all the way to age 14. Check out the list here to see the specific laws in your state. Most states, however, do not have laws, leaving the decision up to the parent."}, {"url": "http://www.latchkey-kids.com/latchkey-kids-age-limits.htm", "passage_text": "The National SAFEKIDS Campaign recommends that no child under the age of 12 be left at home alone. However, consider a child's age and maturity level. For example, if a child is extremely impulsive, it might be best to wait until he or she is older than 12."}, {"url": "http://blogs.babycenter.com/mom_stories/11042014-the-legal-age-you-can-leave-your-child-home-alone-by-state/", "passage_text": "Please watch your kids. The legal age when you can leave a kid home is 12. But that is the legal requirement, parents should always think twice before leaving a small kid in the hands of a 12 year old. 12 year old is still a small kid and giving a responsibility of a an even younger kid to a 12 year can be dangerous."}]