[{"url": "http://www.brazil.org.za/brazil-cuisine.html", "passage_text": "Brazil Cuisine. The cuisine of a nation is determined largely by the societies, customs and traditions within that culture as well as by accessibility and availability to certain foods and ingredients. Because Brazil is such a melting pot of colours, languages and customs, its cuisine is similarly varied. In addition, the various types of dishes and ingredients used depend on the geographical location within Brazil. However, in Brazil, they also refer to the food commonly available from street vendors. Popular Brazilian appetisers include: • Acaraje - acarajé fried balls of, shrimp-black eyed peas and. • Onions bolinhos Do – arroz-deep friend balls made from a-rice based. batter"}, {"url": "https://en.wikipedia.org/wiki/Culture_of_Brazil", "passage_text": "Cultural map of the world according to the World Values Survey, describing Brazil as high in Traditional Values and relatively balanced between Survival and Self-Expression values, as with neighboring South American countries and some other historically Roman Catholic Western cultures. Music is one of the most instantly recognizable elements of Brazilian culture. Many different genres and styles have emerged in Brazil, such as samba, choro, bossa nova, MPB, frevo, forro, forró, maracatu, sertanejo brega and. axe axé"}, {"url": "https://en.wikipedia.org/wiki/Brazilian_cuisine", "passage_text": "Brazilian cuisine has European, African and Amerindian influences. It varies greatly by region, reflecting the country's mix of native and immigrant populations, and its continental size as well. "}, {"url": "http://www.bbcgoodfood.com/howto/guide/top-10-foods-try-brazil", "passage_text": "Brazil really does have it all. Larger cities like Sao São paulo And rio boast unique, culture personality and, nightlife while the thousands of miles of, coastline epic countryside and hearty cuisine will have you in. Raptures'we ve picked 10 Essential brazilian dishes to try on your. visit "}, {"url": "http://captainconnor-jsbjd.wikispaces.com/Family+life,+Cultural+values,+and+beliefs", "passage_text": "Religious Beliefs. ﻿ 1 Families in Brazil are usually large consisting of a married couple, their children, and other relatives such as aunts, uncles, cousins, and godparents. 2  The head of the household is usually the husband, which takes care of the families material needs. 1 ﻿Families in Brazil are usually large consisting of a married couple, their children, and other relatives such as aunts, uncles, cousins, and godparents. 2  Although, recently young adults have started to leave their households to build their own individual lives with their partners in Favelas."}, {"url": "https://en.wikipedia.org/wiki/Culture_of_Brazil", "passage_text": "The culture of Brazil is primarily Western, but presents a very diverse nature showing that an ethnic and cultural mixing occurred in the colonial period involving mostly Indigenous peoples of the coastal and most accessible riverine areas, Portuguese people and Africans. Music is one of the most instantly recognizable elements of Brazilian culture. Many different genres and styles have emerged in Brazil, such as samba, choro, bossa nova, MPB, frevo, forro, forró, maracatu, sertanejo brega and. axe axé"}, {"url": "http://internal.sphhp.buffalo.edu/brazil/culture.htm", "passage_text": "The Brazilian culture is a Latin American culture of a very diverse nature. Its chief early influence was Portuguese culture, due to strong colonial ties with the Portuguese empire that spread the Portuguese language, legal system and other cultural inheritances. "}, {"url": "https://en.wikipedia.org/wiki/Culture_of_Brazil", "passage_text": "As consequence of three centuries of colonization by the Portuguese empire, the core of Brazilian culture is derived from the culture of Portugal. The numerous Portuguese inheritances include the language, the predominant religion and the colonial architectural styles. Music is one of the most instantly recognizable elements of Brazilian culture. Many different genres and styles have emerged in Brazil, such as samba, choro, bossa nova, MPB, frevo, forro, forró, maracatu, sertanejo brega and. axe axé"}, {"url": "http://traveltips.usatoday.com/cultural-traditions-festivals-brazil-63001.html", "passage_text": "Much of Brazil's international reputation is centered around local traditions and celebrations such as capoeira, the national sport and the festivities of Carnaval. From the cult of soccer to Catholic holidays to the rituals of the local religion, Candomble, Brazil's traditions are both secular and sacred. Carnaval, the traditional festival of decadence before Lent begins, has some of its biggest celebrations in Brazil. The cities of Rio de Janeiro and Salvador are particularly famous for their parades; the performers spend months preparing and practicing."}, {"url": "http://www.everyculture.com/Bo-Co/Brazil.html", "passage_text": "Brazil also has a large population of mixed European, mainly Portuguese, descent. In the late nineteenth and early twentieth centuries Brazil was the destination of many immigrants from Italy, Germany, and Spain. During the same era smaller numbers of immigrants arrived from Eastern Europe and the Middle East. Because of its size and diversity, Brazil is one of the nations most deserving of the name land of contrasts.. The country is often divided into five regions: Norte (North), Nordeste (Northeast), Centro-Oeste (Central-West), Sudeste (Southeast), and Su l (South)."}]