[{"url": "http://dolphinfacts.com/how-much-do-dolphins-weigh.html", "passage_text": "The Maui’s dolphin is the world’s smallest dolphin and a fully grown adult weighs only 90 lb. The killer whale is the largest dolphin in the world and adult males can weigh up to 10 tonnes. "}, {"url": "http://www.whalefacts.org/how-much-do-whales-weigh/", "passage_text": "1 The blue whale is the largest living animal on this planet and can grow to be over 90 ft. and weigh 150 tons or more. 2  The dwarf sperm whale is smallest of the whale species and can grow up to 9 ft. in length and weigh up to 600 pounds. Factors affecting a whales weight and size. When it comes to a whales overall weight there are a number of factors that help determine how much a whale will weigh. Some of these factors include: 1  How healthy, genetically fit and large the whales parents were/are."}, {"url": "https://answers.yahoo.com/question/index?qid=20071111220954AAHlrWX", "passage_text": "Rating Newest Oldest. Best Answer: At birth a male blue whale will weigh about 26 Tons, a full grown adult male blue whale is about 100-120 Tons. Females have weighted in at over 135 Tons. The largest female blue whales have weighted almost 200 tons! The weight of a 30 m (98 ft) individual is believed by the NMML to be in excess of 180 tonnes (200 short tons). The largest Blue Whale accurately weighed by NMML scientists to date was a female that weighed 177 tonnes (196 short tons).[6]. Inferno786 · 8 years ago. Thumbs up."}, {"url": "http://www.answers.com/Q/How_much_does_the_killer_whale_weigh", "passage_text": "The average weight of a killer whale is about 9 tons. ... Although they can weigh asmuch as 18000 pounds and grow up to be 32 feet, they are very athletic. 1 person found this useful. "}, {"url": "http://www.whalefacts.org/how-much-do-whales-weigh/", "passage_text": "1 killer whale “aka Orca” is actually a dolphin. 2  In fact the killer whale happens to be the largest of the dolphin species (hence the name whale) and can grow to be larger than 25 ft. long and weigh over 6 tons. Factors affecting a whales weight and size. When it comes to a whales overall weight there are a number of factors that help determine how much a whale will weigh. Some of these factors include: 1  How healthy, genetically fit and large the whales parents were/are."}, {"url": "http://www.whalefacts.org/how-much-do-dolphins-weigh/", "passage_text": "An adult can weigh anywhere from 2,200 to 6,600 pounds (1,000 to 3,000 kilograms) and can measure from 12 to 18 feet (3.7 to 5.5 meters) in length. Finally, the largest dolphin is the killer whale, or orca. An adult female orca can weigh in at a whopping 16,500 pounds, and the male can weigh up to about 22,000 pounds (a range of 7,500 to 10,000 kilograms). Female orcas measure about 28 feet (8.5 meters) in length, and males are about 32 feet (10 meters) long at their largest. Another small dolphin is the Indus river dolphin; as an adult, this dolphin weighs about 150 to 200 pounds (70 to 90 kilograms) and measures 7.5 to 8.5 feet (2.3 to 2.6"}, {"url": "http://www.answers.com/Q/How_much_does_a_full_grown_whale_weigh", "passage_text": "A full-grown Chianina cow (Chianinas are the largest-known breed of cattle in the world) can weigh over 2500 lbs. A full-grown Dexter cow (which is the s … mallest-known non-miniature breed of cattle in the world) can weigh around 700 lbs. The average weight of all cattle in North America is 1600 lbs. "}, {"url": "http://www.whalefacts.org/how-much-do-whales-weigh/", "passage_text": "In comparison the blue whale (the worlds largest living animal) can grow to a length of over 100 ft. and weigh in excess of 150 tons. The blue whales heart alone can weigh as much if not more than a fully grown dwarf sperm whale. In fact some of the largest blue whales have had hearts that weigh as much as 2,500 lbs., which is equivalent to the weight of a small car. Factors affecting a whales weight and size. When it comes to a whales overall weight there are a number of factors that help determine how much a whale will weigh. Some of these factors include: 1  How healthy, genetically fit and large the whales parents were/are."}, {"url": "http://www.cityofpaloalto.org/civicax/filebank/documents/12445", "passage_text": "A full grown adult male will weigh up to 35 pounds and be about 3 feet long from tip of the nose to the end of their tail. Full grown females are slightly smaller. The largest raccoon on record weighed 50 pounds! Raccoons are easily recognized by their black facial mask and bushy striped tail. "}, {"url": "https://answers.yahoo.com/question/index?qid=20071111220954AAHlrWX", "passage_text": "Best Answer: At birth a male blue whale will weigh about 26 Tons, a full grown adult male blue whale is about 100-120 Tons. The weight of a 30 m (98 ft) individual is believed by the NMML to be in excess of 180 tonnes (200 short tons). The largest Blue Whale accurately weighed by NMML scientists to date was a female that weighed 177 tonnes (196 short tons).[6]. Inferno786 · 8 years ago. Thumbs up."}]