[{"url": "http://www.areavibes.com/palm+springs-fl/weather/", "passage_text": "5.1. The highest average temperature in Palm Springs is August at 83.4 degrees. The coldest average temperature in Palm Springs is February at 67 degrees. The most monthly precipitation in Palm Springs occurs in June with 8.7 inches. The Palm Springs weather information is based on the average of the previous 3-7 years of data. Loading..."}, {"url": "http://traveltips.usatoday.com/average-temperature-palm-springs-36481.html", "passage_text": "The spring months in Palm Springs see steadily increasing temperatures, with the first 100-degree day of the year typically sometime in May. The average highs in March, April and May are 80, 88 and 95 degrees, respectively, and the average lows are 51, 56 and 63."}, {"url": "http://www.holiday-weather.com/palm_springs/averages/", "passage_text": "August is the hottest month in Palm Springs with an average temperature of 25°C (77°F) and the coldest is January at 14°C (56°F) with the most daily sunshine hours at 13 in August. The wettest month is January with an average of 48.4mm of rain."}, {"url": "http://www.areavibes.com/palm+springs-ca/weather/", "passage_text": "The highest average temperature in Palm Springs is July at 95.6 degrees. The coldest average temperature in Palm Springs is December at 55.8 degrees. The most monthly precipitation in Palm Springs occurs in January with 1.3 inches."}, {"url": "http://traveltips.usatoday.com/average-temperature-palm-springs-36481.html", "passage_text": "Winter. The average high in Palm Springs in December and January is 70 degrees, while February's average is 75 degrees. Average lows are in the mid-to upper 40s. January and February see the most rainfall all year, with just over one inch each month."}, {"url": "https://vacationpalmsprings.com/palm-springs-weather-info-by-month-season-highlights-palmspringsca.php", "passage_text": "April's mid-day Palm Springs Ca temperature averages around 80-88 degrees Fahrenheit or 27-31 Celsius. The sun sets at about 7:15 pm and the temperature cools to a very comfortable average of 72 degrees Fahrenheit or 22 Celsius in the evenings."}]