[{"url": "http://www.babycentre.co.uk/a539332/swimming-with-your-baby", "passage_text": "It's normal to bleed for anything up to six weeks after birth. However, your baby can go swimming at any time from birth, although most baby swimming classes start at six weeks. If you are keen for your baby to be introduced to swimming before he is six weeks old, your partner or someone else can take him. Getting your baby used to water early in his life makes sense from a safety point of view. Swimming is also great fun and good exercise. Here’s some advice on taking the plunge with your little one. It's best that you wait until six weeks after your baby's birth before you go swimming."}, {"url": "http://www.babycenter.com.au/x542046/how-soon-can-i-take-my-baby-swimming", "passage_text": "If you are keen for your baby to be introduced to swimming before he is six weeks old your partner, or someone else, can take him. Some private baby swim classes start as early as four weeks but most classes at public pools begin at around 4 months. Check with your local swim centre. There is no need to wait until your baby is immunised as the chlorine in the pool will kill off any germs. Baby swim classes tend to use small, warm pools which are ideal for tiny tots. If you plan to use a regular public swimming pool wait until your baby is six months old. Before that, the water will be too cold for him. He may also be put off by all the noise and activity. Most babies up to six months of age can actually swim, with your help, of course! If you start early you can take advantage of your baby's natural ability to do primitive stroke"}, {"url": "http://www.thebump.com/a/baby-swimming", "passage_text": "It’s a good idea to wait until baby’s about six months old to take him in the pool. It’s not unhealthy to expose him to chlorine before then, but baby should be holding his head up properly before you take him in the water. That way, he’ll be sturdier and you can have a firmer, more assured grasp on him. Plus, that’s about the age when baby will start being able to splash and kick and really enjoy being in the pool. Some parents believe that the earlier you take your child to swimming lessons, the better a swimmer he’ll become."}, {"url": "http://www.parenting.com/article/ask-dr-sears-too-young-for-the-pool", "passage_text": "My baby is one-month-old and I want to start him in the pool as early as I can. A. Swimming is one of the healthiest forms of exercise. It tones muscles, relaxes the mind and is friendly to exercising joints. Most babies have a natural love of water. After all, your baby enjoyed his own swimming pool for nine months. Exposure to water should be like feeding schedules: small and frequent. Once baby is comfortable with water in the shower and tub, it's time to graduate from to the pool. You can usually enter this stage between one and two months of age."}, {"url": "http://www.babycenter.ca/a539332/swimming-with-your-baby", "passage_text": "Getting your baby used to water early is important from a safety point of view and it's great fun too. Your child won't be co-ordinated enough to learn to swim properly until he is two or three, but you can get him to feel confident and relaxed in the water and make swimming a fun way to exercise for both of you. Introducing your baby to water. 1  Make bath time fun. 2  When you first start going to a public pool, make sure you go off-peak. 3  When you first get in the pool, make sure that your baby's face is close to yours and that you have eye contact, holding him close to you."}, {"url": "http://www.babycentre.co.uk/x542046/how-soon-can-i-take-my-new-baby-swimming", "passage_text": "Before that, the water will be too cold for him. He may also be put off by all the noise and activity. Most babies up to six months of age can actually swim, with your help, of course! If you start early you can take advantage of your baby's natural ability to do basic strokes. Also, your baby's inbuilt gag reflex is generally at its strongest before six months"}, {"url": "http://www.parenting.com/article/ask-dr-sears-too-young-for-the-pool", "passage_text": "Around six months of age, consider enrolling your baby into swimming lessons. There are qualified instructors and infant swim classes in many cities. Usually by nine months, babies can be taught to swim between two adults for about five seconds. Exposure to water should be like feeding schedules: small and frequent. Once baby is comfortable with water in the shower and tub, it's time to graduate from to the pool. You can usually enter this stage between one and two months of age."}, {"url": "http://www.babycentre.co.uk/x542046/how-soon-can-i-take-my-new-baby-swimming", "passage_text": "However, your baby can go swimming at any time from birth, although most baby swimming classes start at six weeks. If you're keen for your baby to be introduced to swimming before he is six weeks old, your partner or someone else can take him to a warm, baby pool. He may also be put off by all the noise and activity. Most babies up to six months of age can actually swim, with your help, of course! If you start early you can take advantage of your baby's natural ability to do basic strokes."}]