[{"url": "http://homeguides.sfgate.com/average-cost-hour-run-dryer-68320.html", "passage_text": "Dryers are the number two home appliance in energy usage. The average cost to run a dryer for an hour depends on the power consumed by the dryer in an hour. Some dryers are electric and others run on gas, but electric dryers notoriously consume more energy than gas dryers do. The label on the back of the dryer should indicate the watts it uses. Electric companies charge by the kilowatt hour, so calculating how much it costs to run an electric dryer starts with finding out the kilowatts it takes to run the dryer for an hour."}, {"url": "http://www.chegg.com/homework-help/questions-and-answers/much-cost-run-1500-w-hair-dryer-21-minutes-day-one-month-30-days-cost-9-per-kwh-q1346979", "passage_text": "Question. How much does it cost to run a 1500 W hair dryer for 21 minutes each day for one month (30 days) at a cost of 9 per kWh? $ ___________. View more."}, {"url": "http://homeguides.sfgate.com/average-cost-hour-run-dryer-68320.html", "passage_text": "One therm equals 100,000 BTUs, which means a dryer uses .11 therm per hour. The gas costs roughly $.11 for an hour. Electricity to power the drum uses .15 per kilowatt hour, resulting in a cost of $.12 per hour to run the dryer. The label on the back of the dryer should indicate the watts it uses. Electric companies charge by the kilowatt hour, so calculating how much it costs to run an electric dryer starts with finding out the kilowatts it takes to run the dryer"}, {"url": "http://www.answers.com/Q/How_much_does_a_hair_dryer_cost", "passage_text": "$0.23 + $0.12 = $0.35 to run the dryer for an hour (at the high speed, high temp setting). To run an electric dryer? I found a similar 7 cubic foot capacity one on line, it uses 220v at 30A which translates to 6600 Watts. At $.193/kWh that is $1.27 to run for an hour. Of course, just because it's rated at 30A, it doesn't mean it uses that much."}, {"url": "https://answers.yahoo.com/question/index?qid=20101230120324AAgAV96", "passage_text": "How much does it cost to run a 1500 W hair dryer for 16 minutes each day for one month (30 days) $7 per kWh? How much does it cost to run a 1500 W hair dryer for 21 minutes each day for one month? Relevance. Rating Newest Oldest. Best Answer: you are running it for 0.5 hours so 1500 * 0.5 = 750 Wh Since the cost is in kWh i will divide this result by 1000 to get it in K 750/1000 kWh = 0.75 kWh 1kWh costs 0.12$, so 0.75 kWh will cost, (0.75 * 0.12) $ = 0.09 $. Source(s):"}, {"url": "http://frugalliving.about.com/od/clothingcare/qt/How-Much-Does-It-Cost-To-Run-A-Dryer.htm", "passage_text": "In the U.S. it costs approximately $.45 to dry a load of laundry in an electric dryer*. For an exact calculation of how much it costs to run your dryer, use this formula: (dryer's wattage x length of load in hours)/1000 = kilowatt hours (kwh) used. kilowatt hours x cost per kwh = cost per load. cost per load x # of loads per month = cost per month. cost per month x 12 = cost per year. Here are the calculations that I ran for my dryer: (5600 watts x .667 hours)/1000 = 3.73 kwh. 3.73 kwh x .09 = $.34 per load. $.34 per load x 24 loads a month = $8.16 per month. $8.16 x 12 = $97.92 per year. *based on a 5600 watt dryer, 40 minute run-time and a $.12 per kwh rate."}, {"url": "http://www.answers.com/Q/How_much_does_a_hair_dryer_cost", "passage_text": "To run a (our) gas dryer... One kilowatt-hour (kWh) of electricity in Los Angeles was $0.193 in September, 2012. It is r … ated at 6 amps and 22000 btu. As it's probably over-rated, and I'm assuming you want what it costs on high speed dry, I'm going to assume it uses 5 amps. At 120 volts 5 amps is 600 watt. To run an electric dryer? I found a similar 7 cubic foot capacity one on line, it uses 220v at 30A which translates to 6600 Watts. At $.193/kWh that is $1.27 to run for an hour. Of course, just because it's rated at 30A, it doesn't mean it uses that much."}, {"url": "http://www.answers.com/Q/How_much_does_it_cost_to_run_a_clothes_dryer_for_one_hour", "passage_text": "Look on the dryers nameplate for the actual wattage. Lets assume that it is 7200 watts. You pay for electricity by the killowatt/hour. So you are using 7200 of 7.2 Kw/Hr. Look on your power bill and it should tell you how much they are charging you per Kw/Hr. It could be .04 to .15 (who knows). As one Therm is 100,000 BTU, that means the dryer uses (can use?) .22 Therms/h. At $1.027/therm that is about $0.23. $0.23 + $0.12 = $0.35 to run the dryer for an hour (at the high speed, high temp setting). To run an electric dryer? I found a similar 7 cubic foot capacity one on line, it uses 220v at 30A which translates to 6600 Watts. At $.193/kWh that is $1.27 to run for an hour"}]