[{"url": "http://work.chron.com/become-us-customs-broker-16395.html", "passage_text": "The Customs and Border Patrol (CBP) website notes that an arrest or even a conviction isn't an automatic bar to get broker licensing. Step 1. Check the CBP website's Customs Broker License Examination page and click the Notice of Examination link. Study for and pass the four-hour, open-book examination for a customs broker license on the examination date. Step 4. Submit the application for a customs broker license CBP Form 3124 to Customs and Border Patrol, U.S. Department of Homeland Security, at the port where you plan to operate your customs brokerage. You must do this within three years of successfully completing the broker license examination"}, {"url": "http://www.excite.com/education/criminal-justice/law-enforcement-policing-investigation/careers/how-to-become-a-customs-agent", "passage_text": "A: To become a customs broker, you must have a US citizenship, over the age of 21, clear a background check, and clear the brokers examinations with a satisfactory score of 75% or higher. All customs brokers must have an understanding of entry procedures, duty taxes, fees for imported goods, and fines. A: To become a customs agent you need to be a citizen of the United States, you must have a valid driver's license, you must be below the age of 40 at the time of application, and you must clear a medical exam, a drug screening test, background check, a physical fitness test and a polygraph test."}, {"url": "http://www.wisegeekedu.com/how-do-i-become-a-customs-broker.htm", "passage_text": "The best way to determine how to become a customs broker in your country is to visit your government's website. Universally, there are some character traits that any person must possess in order to become a customs broker. Since brokers facilitate the movement of goods in and out of a country, it is important that any broker be well-versed when it comes to communication."}, {"url": "http://www.dunlap-stone.edu/degrees-and-programs/licensed-customs-broker-training/", "passage_text": "Preparing for the Licensed Customs Broker Test. The U.S. Customs & Border Protection (CBP) agency administers the licensing process for Licensed U.S. Customs Broker. To gain a license individuals must pass a written examination offered two times a year: The first Monday in April and the first Monday in October. "}, {"url": "http://www.ehow.com/how_2068308_become-customs-broker.html", "passage_text": "Instructions. Visit the United States Customs and Border Protection website and type the words customs broker in the search box, then press the green Go button. Select the Becoming a Customs Broker link and read the different sections. Study for the Customs Broker License Examination. Locate the port where you want to transact customs business as a broker. Scroll down to the Customer Broker License Examination heading and click on the word Port.. Go down the list of states and select the appropriate port."}, {"url": "http://www.powerhomebiz.com/business-ideas/become-customs-broker.htm", "passage_text": "Requirements to Become a Customs Broker. There are no required educational attainments in order to be a customs broker. A bachelor’s degree in economics or global trade is often preferred. Many trade school, colleges, and universities offer courses in customs brokerage. International shipping is a complicated process requiring international traders to go through myriad policies and regulations. To ensure that the import and export process run smoothly, international traders often rely on customs broker to make the process run smoothly."}, {"url": "http://www.excite.com/education/criminal-justice/law-enforcement-policing-investigation/careers/how-to-become-a-customs-agent", "passage_text": "A: It may take you 4 to 6 years to become a customs agent. Most people acquire a bachelor's or an associate's degree in relevant subjects such as criminal justice or security management before applying for the U.S. customs and border patrol services. A: To become a customs agent you need to be a citizen of the United States, you must have a valid driver's license, you must be below the age of 40 at the time of application, and you must clear a medical exam, a drug screening test, background check, a physical fitness test and a polygraph test."}, {"url": "http://work.chron.com/become-us-customs-broker-16395.html", "passage_text": "The process for obtaining a customs broker license is lengthy. You must be a U.S. citizen over 18 years of age and of good moral character. Examinations are only administered in April and October. Study for and pass the four-hour, open-book examination for a customs broker license on the examination date. Step 4. Submit the application for a customs broker license CBP Form 3124 to Customs and Border Patrol, U.S. Department of Homeland Security, at the port where you plan to operate your customs brokerage. You must do this within three years of successfully completing the broker license examination"}, {"url": "http://www.wisegeekedu.com/how-do-i-become-a-customs-broker.htm", "passage_text": "You won't believe these 10 facts about people. The training required in order to become a customs broker varies from country to country. Within the United States, all eligible candidates must be licensed by the U.S. Customs and Border Protection Agency. In Canada, all brokers must be licensed by the Canada Border Service Agency. Universally, there are some character traits that any person must possess in order to become a customs broker. Since brokers facilitate the movement of goods in and out of a country, it is important that any broker be well-versed when it comes to communication."}]