[{"url": "http://healthypets.mercola.com/sites/healthypets/archive/2014/04/28/cat-constipation.aspx", "passage_text": "1 Consider adding water to your cat's food to help lubricate the colon. 2  You can also try adding flavoring to your kitty's water (try using the liquid from a can of tuna or cat food) to make it more enticing. 3  Also, some cats ignore still water but will drink moving water from a pet water fountain."}, {"url": "http://www.animalplanet.com/pets/cat-constipation-remedy/", "passage_text": "Treating Feline Constipation. If the cat is mildly constipated, your vet may recommend a stool softener or laxative (the kind designed for cats, not humans) to get things moving. Adding fiber to the cat's food, including natural bran cereal or pumpkin, or fiber granules such as Metamucil, can also help. Special high-fiber cat foods are also available for cats with repeated constipation problems."}, {"url": "http://www.cat-world.com.au/Cat-Health-Collection/how-to-treat-constipation-in-cats.html", "passage_text": "Fibre: Adding fibre to your cat's food can help with mild constipation. There are several ways to do this. 1  Add 1/2 - 1 teaspoon unflavoured Metamucil to canned food. 2  Pumpkin is high in fibre and water and is an excellent way to get more fibre into your cat's diet."}, {"url": "http://healthypets.mercola.com/sites/healthypets/archive/2014/04/28/cat-constipation.aspx", "passage_text": "Story at-a-glance 1  +. A cat is constipated when the stool is too large or hard to move comfortably through the colon. 2  Straining in the litter box, little or no poop, and hard dry poop are common signs of constipation."}, {"url": "http://www.wikihow.com/Cure-a-Cat-of-Constipation", "passage_text": "Add pureed pumpkin or butternut squash to your cat’s food. If your cat is not completely blocked and still acting and eating normally, try adding pureed pumpkin or butternut squash to his food to introduce fiber into his diet. You can also use canned pumpkin. 1  Add a couple teaspoons of pumpkin into your cat's food."}, {"url": "http://www.wikihow.com/Cure-a-Cat-of-Constipation", "passage_text": "1 A healthy cat will defecate about once a day. 2  The cat’s stool should be firm and hold its shape. 3  Many times, it may appear that your cat is constipated, but there are other conditions that look similar at first. 4  You will need to watch your cat closely to make sure there is not a different problem present."}, {"url": "http://www.vetstreet.com/care/constipation-in-cats", "passage_text": "Many things can cause a cat to become constipated: an intestinal blockage, stress, not enough exercise, not enough water, arthritis, a tumor, or something else entirely. Symptoms include straining to defecate, tiny or hard feces, and sometimes not defecating for days."}]