[{"url": "http://www.disabilityrightsca.org/pubs/CM0201.pdf", "passage_text": "Here are some examples: Don’t say: “mentally ill people” Do say: “people with mental health experiences ” Don’t say: “bipolar person” Do say: “a person living with bipolar disorder” Using People First Language to address individuals with mental health disabilities is more inclusive. You should always ask what a person prefers first. Each person makes their own choice about how they want to self identify. When in doubt call the person by their name. Other Resources BMC Health Services Research released their report on 250 labels used to stigmatize people with mental illness."}, {"url": "http://www.healthtalk.org/peoples-experiences/mental-health/mental-health-ethnic-minority-experiences/ways-describing-mental-health-problems", "passage_text": "In some cases, people didn't really understand themselves what was happening or didn't realise how ill they were (see 'Onset of mental health problems'). As a result, doctors didn't always immediately recognise that they were experiencing mental health problems. Mental health problems and physical symptoms. Generally, people drew a distinction between physical and mental health and symptoms, using phrases like, “it's just my mind”, “psychological distress” and “mental breakdown”, others found it less easy to tell the difference."}, {"url": "http://www.mindfreedom.org/kb/mental-health-abuse/psychiatric-labels/not-mentally-ill", "passage_text": "Let's Stop Saying Mental Illness! It is helpful to use other phrases for people who have in the past been described as mentally ill.. This is a living essay, and the author updates it periodically. If you have any feedback or suggestions let the author know c/o the MindFreedom office. For example, for decades some in our movement have changed this: People with schizophrenia. to this: People with “schizophrenia.”. Quotation marks like this help the activist writer a bit, to show that it's not the writer's word, that he or she is just quoting someone else. But we want more than punctuation."}, {"url": "http://www.healthtalk.org/peoples-experiences/mental-health/mental-health-ethnic-minority-experiences/ways-describing-mental-health-problems", "passage_text": "When describing their symptoms or how they felt, people often referred to what might be considered physical experiences. For example, they mentioned shivering, shaking, being hot, cold or feverish, itching, tingling, or feeling numb or weak, feeling pressure or pain and having a headache. Mental health problems and physical symptoms. Generally, people drew a distinction between physical and mental health and symptoms, using phrases like, “it's just my mind”, “psychological distress” and “mental breakdown”, others found it less easy to tell the difference."}, {"url": "http://www.popcenter.org/problems/mental_illness/", "passage_text": "The Problem of People with Mental Illness. Problems associated with people with mental illness pose a significant challenge for modern policing. [1] This guide begins by describing the problem and reviewing factors that increase the challenges that police face in relation to the mentally ill. [6]. It is important to recognize at the outset that mental illness is not, in and of itself, a police problem. Obviously, it is a medical and social services problem. However, a number of the problems caused by or associated with people with mental illness often do become police problems."}, {"url": "http://www.mindfreedom.org/kb/mental-health-abuse/psychiatric-labels/not-mentally-ill", "passage_text": "1 Person experiencing severe and overwhelming mental and emotional problems [describe, such as despair]. 2  Person our society considers to have very different and unusual behavior [describe, such as not sleeping]. 3  I have a name, not a label! 4  Insert Your Name Here [e.g. For example, for decades some in our movement have changed this: People with schizophrenia. to this: People with “schizophrenia.”. Quotation marks like this help the activist writer a bit, to show that it's not the writer's word, that he or she is just quoting someone else. But we want more than punctuation."}, {"url": "http://www.macmillandictionary.com/thesaurus-category/british/words-used-to-describe-someone-s-psychological-state", "passage_text": "The Macmillan Dictionary blog explores English as it is spoken around the world today. Free thesaurus definition of words used to describe someone s psychological state from the Macmillan English Dictionary-a free English dictionary online with thesaurus and with pronunciation from Macmillan Publishers Limited. "}, {"url": "https://www.youthhood.org/government/si_dis_describing.asp", "passage_text": "1 Mental retardation is a medical term to describe a person with a condition such as Down syndrome. 2  Birth defect: Most people with disabilities do not see their disability as a defect. 3  It doesn’t matter if they were born with their disability or developed the disability later in life. 1 Many people see this word as a “put-down” to people with disabilities and don’t like to hear it. 2  Retarded: Retarded (or retard) is a term that should never be used to label someone. 3 "}, {"url": "http://www.answers.com/Q/How_will_you_describe_a_mentally_healthy_person", "passage_text": "Making the world better, one answer at a time. Technically a mentally health person is a person who is able to function on a high level. For example, is able to look after themselves on a day-to-day basis. However, mentally healthy people can still get mental diseases such as depression, where they can function well. "}]