[{"url": "http://www.bbc.co.uk/science/earth/surface_and_interior/plate_boundary", "passage_text": "Plates move away from one another at divergent boundaries. This happens at mid-ocean ridges. Plates move towards one another at convergent boundaries; one plate is forced below another in a process called subduction. Earthquakes and composite volcanoes are common at this type of boundary. Plates move past on another at transform boundaries. The most famous example of this type of boundary is the San Andreas Fault in California. Image: Cutaway artwork showing different types of plate boundary and hotspot"}, {"url": "http://bcgeography.weebly.com/b1---features-associated-with-plate-tectonics.html", "passage_text": "There are 4 main types of plate boundary including: convergent, divergent, subduction and transform-the type of boundary influences the features and events which occur. These pages are a good introduction: http://www.bbc.co.uk/schools/gcsebitesize/geography/natural_hazards/tectonic_plates_rev1.shtml. "}, {"url": "https://en.wikipedia.org/wiki/Plate_boundaries", "passage_text": "The location where two plates meet is called a plate boundary. Plate boundaries are commonly associated with geological events such as earthquakes and the creation of topographic features such as mountains, volcanoes, mid-ocean ridges, and oceanic trenches. 1 Divergent boundaries (Constructive) occur where two plates slide apart from each other. 2  At zones of ocean-to-ocean rifting, divergent boundaries form by seafloor spreading, allowing for the formation of new ocean basin."}, {"url": "http://www.csun.edu/~psk17793/ES9CP/ES9%20plate_boundaries.htm", "passage_text": "1. Explain the differences between divergent, convergent, and transform plate boundaries. 2. Describe the land features associated with each type of plate boundary. Plate Boundaries. Objectives: 1. Explain the differences between divergent, convergent, and transform plate boundaries. 2. Describe the land features associated with each type of plate boundary. 3. Give examples of land structures found at each plate boundary."}, {"url": "https://en.wikipedia.org/wiki/Plate_boundaries", "passage_text": "Where the plates meet, their relative motion determines the type of boundary: convergent, divergent, or transform. Earthquakes, volcanic activity, mountain-building, and oceanic trench formation occur along these plate boundaries. The lateral relative movement of the plates typically ranges from zero to 100 mm annually. 1 Divergent boundaries (Constructive) occur where two plates slide apart from each other. 2  At zones of ocean-to-ocean rifting, divergent boundaries form by seafloor spreading, allowing for the formation of new ocean basin."}, {"url": "http://www.visionlearning.com/en/library/Earth-Science/6/Plates-Plate-Boundaries-and-Driving-Forces/66", "passage_text": "Plate boundaries. These observations about the distribution of earthquakes and volcanoes helped geologists define the processes that occur at spreading ridges and subduction zones. In addition, they helped scientists recognize that there are other types of plate boundaries."}, {"url": "http://www.gns.cri.nz/Home/Learning/Science-Topics/Earthquakes/Earthquakes-at-a-Plate-Boundary/Tectonic-Plates-and-Plate-Boundaries", "passage_text": "There are three main types of plate boundaries: 1. Convergent boundaries: where two plates are colliding. Subduction zones occur when one or both of the tectonic plates are composed of oceanic crust. The denser plate is subducted underneath the less dense plate. The plate being forced under is eventually melted and destroyed. i."}, {"url": "http://www.visionlearning.com/en/library/Earth-Science/6/Plates-Plate-Boundaries-and-Driving-Forces/66", "passage_text": "Also similar to earthquakes, different kinds of volcanoes occur along different types of plate boundaries. Most of the volcanic eruptions that make the news, such as the 1980 Mount St. Helens eruption, take place near subduction zones. This type of volcano is represented by green triangles in Figure 2. These observations about the distribution of earthquakes and volcanoes helped geologists define the processes that occur at spreading ridges and subduction zones. In addition, they helped scientists recognize that there are other"}, {"url": "http://www.gns.cri.nz/Home/Learning/Science-Topics/Earthquakes/Earthquakes-at-a-Plate-Boundary/Tectonic-Plates-and-Plate-Boundaries", "passage_text": "Earthquakes, volcanic activity, mountain-building, and oceanic trench formation occur along plate boundaries in zones that may be anything from a few kilometres to a few hundred kilometres wide. To watch a simulated fly-by along New Zealand's plate boundary check out this video. 1. Convergent boundaries: where two plates are colliding. Subduction zones occur when one or both of the tectonic plates are composed of oceanic crust. The denser plate is subducted underneath the less dense plate. The plate being forced under is eventually melted and destroyed. i."}]