[{"url": "http://www.meet-your-running-goals.com/normal-resting-heart-rate.html", "passage_text": "For well-trained athletes including runners however, resting heart rates in the range of as low as 40 and up to 60 bpm is more the expectation. There are of course always exceptions to the rule. In short, the normal resting heart rate of a runner, or any well trained athlete, is statistically proven to be significantly lower than that of sedentary folks."}, {"url": "http://www.livestrong.com/article/411280-the-average-heart-rate-chart-for-athletes/", "passage_text": "For example, the average resting heart rate of an elite 30-year-old female athlete ranges from 54 to 59 beats per minute, while the resting heart rate for men of the same age and fitness level ranges from 49 to 54, according to the YMCA's Y's Way to Fitness.. Because your resting heart rate indicates how efficiently your heart pumps blood throughout your body, your pulse rate is a useful tool for gauging your fitness level."}, {"url": "https://en.wikipedia.org/wiki/Athletic_heart_syndrome", "passage_text": "From Wikipedia, the free encyclopedia. Athletic heart syndrome, (AHS) also known as athlete's heart, athletic bradycardia or exercise-induced cardiomegaly is a non-pathological condition commonly seen in sports medicine, in which the human heart is enlarged, and the resting heart rate is lower than normal. The ECG can detect sinus bradycardia, a resting heart rate of fewer than 60 beats per minute. This is often accompanied by sinus arrhythmia. The pulse of a person with athlete's heart can sometimes be irregular while at rest, but usually returns to normal after exercise begins."}, {"url": "http://www.livestrong.com/article/411280-the-average-heart-rate-chart-for-athletes/", "passage_text": "While the normal resting heart rate for adults ranges from 60 to 100 beats per minute, conditioned athletes and other highly fit individuals might have normal resting heart rates of 40 to 60 beats per minute. Because your resting heart rate indicates how efficiently your heart pumps blood throughout your body, your pulse rate is a useful tool for gauging your fitness level."}, {"url": "http://www.livestrong.com/article/411280-the-average-heart-rate-chart-for-athletes/", "passage_text": "Resting Heart Rate. While the normal resting heart rate for adults ranges from 60 to 100 beats per minute, conditioned athletes and other highly fit individuals might have normal resting heart rates of 40 to 60 beats per minute. This indicates a high level of cardiovascular fitness. Because your resting heart rate indicates how efficiently your heart pumps blood throughout your body, your pulse rate is a useful tool for gauging your fitness level."}, {"url": "http://news.nationalgeographic.com/news/2004/08/0820_040820_olympics_athletes_2.html", "passage_text": "Great cyclists generally have an extraordinary heart capacity. The average resting heart rate is 66 to 72 beats per minute (bpm). A well-trained endurance athlete has a resting heart rate of 40 bpm. Miguel Indurain, a five-time Tour de France winner and Olympic gold medalist in 1996, recorded a resting heart rate of 28 bpm"}, {"url": "http://www.livestrong.com/article/82658-athletes-vs.-nonathletes-heart-rate/", "passage_text": "A Normal Rate. Most people have a resting heart rate of around 60 to 100 beats per minute, according to the American Heart Association. A resting heart rate is the number of times your heart beats each minute when you are sitting or lying down and are calm and peaceful. Fittest of the Fit. People who are moderately active will likely have a resting heart rate similar to the rest of the population -- 60 to 100 beats per minute. Professional athletes, on the other hand, can develop extraordinary cardiovascular efficiency."}, {"url": "http://www.buzzle.com/articles/resting-heart-rate-for-athletes.html", "passage_text": "A good resting heart rate for athletes is a heart rate that is around 50-60 beats per minute or lower. Moreover, a rate of around 50 heartbeats per minute is said to be quite good. To bring the heart rate lower than 45 beats, you need to do rigorous exercising for a long period on a consistent basis. One of the most important defining characteristics of fitness is the heart rate of the individual. It is usually seen that an athlete's resting heart rate is lower than the average rate for normal people. Given below are details regarding the same and what it signifie"}, {"url": "http://www.mayoclinic.org/healthy-lifestyle/fitness/expert-answers/heart-rate/faq-20057979", "passage_text": "A normal resting heart rate for adults ranges from 60 to 100 beats a minute. Generally, a lower heart rate at rest implies more efficient heart function and better cardiovascular fitness. For example, a well-trained athlete might have a normal resting heart rate closer to 40 beats a minute. To measure your heart rate, simply check your pulse. Place your index and third fingers on your neck to the side of your windpipe. Consult your doctor if your resting heart rate is consistently above 100 beats a minute (tachycardia) or if you're not a trained athlete and your resting heart rate is below 60 beats a minute (bradycardia) — especially if you have other signs or symptoms, such as fainting, dizziness or shortness of breath."}]