[{"url": "http://www.thefreedictionary.com/broth", "passage_text": "broth. 1. a thin soup of concentrated meat or fish stock. 2. water that has been boiled with meat, fish, vegetables, or grains; stock. 3. a liquid medium containing nutrients suitable for culturing microorganisms. [before 1000; Middle English, Old English]. broth′y, adj. 2. broth-a thin soup of meat or fish or vegetable stock. soup-liquid food especially of meat or fish or vegetable stock often containing pieces of solid food. barley water-used to feed infants."}, {"url": "http://www.thekitchn.com/whats-the-difference-between-stock-and-broth-word-of-mouth-71199", "passage_text": "Word of Mouth. Pin it. For years I assumed that stock and broth were interchangeable terms for the same thing: liquid flavored with vegetables, meat scraps, and bones used as the base for soups, sauces, and other dishes. Meat gives flavor, which is why it is necessary in a broth that can be eaten alone. Bones, cartilage, and skin have collagen, which when heated, turns into gelatin that gives a stock body and a thicker, richer texture in the mouth."}, {"url": "http://www.thefreedictionary.com/broth", "passage_text": "Noun. 1. broth-liquid in which meat and vegetables are simmered; used as a basis for e.g. soups or sauces; she made gravy with a base of beef stock. stock. soup-liquid food especially of meat or fish or vegetable stock often containing pieces of solid food. 2. broth-a thin soup of meat or fish or vegetable stock. soup-liquid food especially of meat or fish or vegetable stock often containing pieces of solid food. barley water-used to feed infants."}, {"url": "https://en.wikipedia.org/wiki/Broth", "passage_text": "Commercially prepared liquid broths are available, typically for chicken broth, beef broth, and vegetable broth. Dehydrated meat stock, in the form of tablets, is called a bouillon cube. In Britain, a broth is defined as a soup in which there are solid pieces of meat or fish, along with some vegetables. A broth is usually made with a stock or plain water as its base, with meat or fish added while being brought to a boil, and vegetables added later."}, {"url": "https://en.wikipedia.org/wiki/Broth", "passage_text": "Broth is a liquid food preparation, typically consisting of water, in which bones, meat, fish, cereal grains, or vegetables have been simmered. Broth is used as a basis for other edible liquids such as soup, gravy, or sauce. It can be eaten alone or with garnish. If other ingredients are used, such as rice, pearl barley or oats, it is then generally called soup. In Britain, a broth is defined as a soup in which there are solid pieces of meat or fish, along with some vegetables. A broth is usually made with a stock or plain water as its base, with meat or fish added while being brought to a boil, and vegetables added later."}, {"url": "https://en.wikipedia.org/wiki/Broth", "passage_text": "Broth has been made for many years using the animal bones which, traditionally, are boiled in a cooking pot for long periods to extract the flavor and nutrients. The bones may or may not have meat still on them. In Britain, a broth is defined as a soup in which there are solid pieces of meat or fish, along with some vegetables. A broth is usually made with a stock or plain water as its base, with meat or fish added while being brought to a boil, and vegetables added later."}, {"url": "http://nourishedkitchen.com/bone-broth/", "passage_text": "1 Broth is typically made with meat and can contain a small amount of bones (think of the bones in a fresh whole chicken). 2  Broth is typically simmered for a short period of time (45 minutes to 2 hours). 3  It is very light in flavor, thin in texture and rich in protein. 1 Broth is typically simmered for a short period of time (45 minutes to 2 hours). 2  It is very light in flavor, thin in texture and rich in protein. 3  Stock is typically made with bones and can contain a small amount of meat (think of the meat that adheres to a beef neck bone)."}, {"url": "http://www.foodnetwork.com/recipes/articles/chicken-stock-vs-chicken-broth.html/", "passage_text": "A: Chicken stock tends to be made more from bony parts, whereas chicken broth is made more out of meat. Chicken stock tends to have a fuller mouth feel and richer flavor, due to the gelatin released by long-simmering bones. Canned low-sodium chicken broth is the busy home-cook's best friend. If you've got an extra few minutes, enhance its flavor by adding any combination of the following and simmering for as long as you can: carrots, onions, leeks, celery, fennel, parsley, bay leaf, black peppercorns, or garlic."}, {"url": "http://thecookinggeek.com/what-is-the-difference-between-stock-and-broth/", "passage_text": "Others say that both broth and stock can contain bones as well as meat, but the important difference is the ratio of meat to bone, whereas a stock would contain more bone and visa versa. Another opinion is that broths are merely flavoured stocks. Still others say broth is stock that is being used in a soup. Salt content is sometimes described as being the critical difference as well. Sifting through the intricacies of the arguments can become quite tedious"}]