[{"url": "http://www.heart.org/HEARTORG/Conditions/More/MyHeartandStrokeNews/All-About-Heart-Rate-Pulse_UCM_438850_Article.jsp", "passage_text": "Your heart rate, or pulse, is the number of times your heart beats per minute. Normal heart rate varies from person to person. Knowing yours can be an important heart-health gauge. "}, {"url": "http://www.disabled-world.com/calculators-charts/bpm-chart.php", "passage_text": "Beats Per Minute: Count the beats for 15 seconds and multiply this number by 4 to get your pulse per minute. Checking your pulse rates when resting, during exercises or after it, provides general information about your overall fitness level. Pulse rates vary from person to person. The normal pulse rate for humans is usually 60 to 100 beats per minute, however, there are certain medical conditions such as cardiac arrhythmia which may alter the normal pulse rate of an individual. Other influencing factors include your age, gender and fitness level."}, {"url": "http://www.mayoclinic.org/healthy-lifestyle/fitness/expert-answers/heart-rate/faq-20057979", "passage_text": "A normal resting heart rate for adults ranges from 60 to 100 beats a minute. Generally, a lower heart rate at rest implies more efficient heart function and better cardiovascular fitness. For example, a well-trained athlete might have a normal resting heart rate closer to 40 beats a minute. "}, {"url": "http://www.ehow.com/facts_7347993_should-normal-pulse-be_.html", "passage_text": "Significance. Having a normal, resting pulse between 60 and 100 beats per minute typically means your heart is efficiently functioning and you are in good cardiovascular health. According to the Mayo Clinic, some athletes may have resting pulse of 40 beats per minute. checking the pulse with stethoscope-isolated on image by Elnur from Fotolia.com. A normal, resting pulse, or heart rate, for an adult is between 60 and 100 beats per minute. Many factors can influence your heart rate, including your fitness level, body size and the influence of any medications you are taking."}, {"url": "http://www.webmd.com/heart-disease/pulse-measurement", "passage_text": "This is called a resting pulse. Some people like to check their pulse before and after they exercise. You check your pulse rate by counting the beats in a set period of time (at least 15 to 20 seconds) and multiplying that number to get the number of beats per minute. Your pulse changes from minute to minute. It will be faster when you exercise, have a fever, or are under stress. Guide. Your pulse is the rate at which your heart beats. Your pulse is usually called your heart rate, which is the number of times your heart beats each minute (bpm). But the rhythm and strength of the heartbeat can also be noted, as well as whether the blood vessel feels hard or soft."}, {"url": "http://www.medicalnewstoday.com/articles/235710.php", "passage_text": "How to measure your pulse and heart rate. Your pulse is your heart rate, or the number of times your heart beats in one minute. 2 Pulse rates vary from person to person. Your pulse is lower when you are at rest and increases when you exercise (more oxygen-rich blood is needed by the body when you exercise). "}, {"url": "http://www.nhs.uk/chq/Pages/2024.aspx?CategoryID=72", "passage_text": "Most adults have a resting heart rate of 60-100 beats per minute (bpm). The fitter you are, the lower your resting heart rate is likely to be. For example, athletes may have a resting heart rate of 40-60 bpm or lower. You should contact your GP if you think your heart rate is continuously above 120 bpm or below 40 bpm, although this could just be normal for you."}, {"url": "http://www.disabled-world.com/calculators-charts/bpm-chart.php", "passage_text": "Pulse Rate: Defined, as the rate at which your heart beats. Your pulse is usually called your heart rate, which is the number of times your heart beats each minute (bpm). Changes in your heart rate or rhythm, a weak pulse, or a hard blood vessel may be caused by heart disease or other problem(s). Pulse rates vary from person to person. The normal pulse rate for humans is usually 60 to 100 beats per minute, however, there are certain medical conditions such as cardiac arrhythmia which may alter the normal pulse rate of an individual. Other influencing factors include your age, gender and fitness level."}]