[{"url": "http://militaryhistory.about.com/od/worldwari1/p/leytegulf.htm", "passage_text": "Kurita's retreat effectively ended the battle. Battle of Leyte Gulf-Aftermath: In the fighting at Leyte Gulf, the Japanese lost 4 aircraft carriers, 3 battleships, 8 cruisers, and 12 destroyers, as well as 10,000+ killed. The Battle of Leyte Gulf was fought October 23-26, 1944, during World War II (1939-1945). Fleets & Commanders. Allies. 1  Admiral William Halsey. 2  Vice Admiral Thomas Kinkaid. 3  8 fleet carriers. 4  8 light carriers"}, {"url": "https://en.wikipedia.org/wiki/Battle_of_Leyte_Gulf", "passage_text": "It was fought in waters of the Leyte Gulf, near the Philippine islands of Leyte, Samar and Luzon, from 23–26 October 1944, between combined American and Australian forces and the Imperial Japanese Navy. Due to the long duration and size of the battle, accounts vary as to the losses which occurred as a part of the Battle of Leyte Gulf and losses that occurred shortly before and shortly after."}, {"url": "http://www.historyofwar.org/articles/battles_leyte_gulf.html", "passage_text": "The battle of Leyte Gulf (22-26 October 1944) was one of the largest and most complex naval battles in history and ended as a massive American victory that effectively destroying the fighting capability of the Japanese navy. American Plans. The American plans had evolved significantly during the summer of 1944. The battle of Leyte Gulf began well to the west of the Philippines on 23 October (battle of the Sibuyan Sea, 23-24 October, although this battle began outside that sea). Darter and Dace, two American submarines, found Kurita's fleet while it was sailing along the north coast of Palawan Island in the South China Sea"}, {"url": "http://www.history.com/topics/world-war-ii/battle-of-leyte-gulf", "passage_text": "This World War II clash followed the Allied landing at the Philippine island of Leyte in October 1944. The Japanese sought to converge three naval forces on Leyte Gulf, and successfully diverted the U.S. Third Fleet with a decoy. At the Suriago Strait, the U.S. Seventh Fleet destroyed one of the Japanese forces and forced a second one to withdraw. The aerial and naval battle conducted as Allied forces invaded the Philippines began with Leyte Island on October 20. Expecting an invasion, the Japanese fleet command ordered its forces to sea at the very first sign of Allied landings."}, {"url": "http://www.answers.com/Q/When_did_Battle_of_Leyte_happen", "passage_text": "The 1944 battle of Leyte Gulf was the battle to take the Gulf of Leyte. It was part of the Philippines campaign. During the battle, over 100 Japanese Kamikazes, filled with fu … el and explosive, were used. They had to crash into ships in order to deal damage to them. The Battle of Leyte Gulf involved the Japanese forces successfully  diverting the US forces away from the Leyte island. The Battle of  Leyte occurred in October 1944."}, {"url": "http://www.iupress.indiana.edu/product_info.php?products_id=807369", "passage_text": "Description. Surigao Strait in the Philippine Islands was the scene of a major battleship duel during the Battle of Leyte Gulf. Because the battle was fought at night and had few survivors on the Japanese side, the events of that naval engagement have been passed down in garbled accounts. "}, {"url": "http://www.u-s-history.com/pages/h1757.html", "passage_text": "Battle of Leyte Gulf. The Battle of Leyte Gulf raged from October 23 through 25, 1944. It was the largest naval battle ever fought  ending in the eclipse of the Imperial Japanese Navy (IJN) and its last sortie in force. "}, {"url": "http://www.answers.com/Q/When_did_Battle_of_Leyte_Gulf_happen", "passage_text": "The 1944 battle of Leyte Gulf was the battle to take the Gulf of Leyte. It was part of the Philippines campaign. During the battle, over 100 Japanese Kamikazes, filled with fu … el and explosive, were used. The battle of Leyte Gulf was crucial to the Allies because it  helped knock out the Japanese Navy from the war."}]