[{"url": "http://thc.me/news/dabbing-is-becoming-a-new-way-to-get-high", "passage_text": "Dabbing is a single dose of hash oil or vaporizing pure marijuana oils known as BHO or butane honey oil. The amount of hash oil one will be consuming in one hit. Some say dabs are awesome and becoming a great way to take 1 hit and be done for. There are a few ways to dab, one is a skillet, which looks like little cymbals that you pretty much heat up with a blow torch, then apply the wax to your paper clip. Another is the glass nail, you can get a bowl with a glass nail, in which you remove the lid, take your blow torch and heat up the glass nail."}, {"url": "http://thestonedsociety.com/2014/02/11/dabbing/", "passage_text": "Dabbing comes from the term “DAB”, press against (something light) which in the case it’d be Butane Hash Oil “BHO” against a heated surface of an oil rig pipe and inhale the smoke. Some of these extracts have up to 90% THC level. "}, {"url": "http://collegeofcannabis.com/reviews/what-is-dabbing/", "passage_text": "You will know what dabbing is, and why it is so popular, after your first session using this method produces an immediate effect. People who have to deal with chronic pain want to know what dabbing is for that very reason. It can take several minutes to begin feeling the benefits of meds that are smoked, and when you dab the same meds in concentrate form, you feel the pain begin to fade almost before the vapor even leaves your lungs. To really answer the question what is dabbing for yourself you will need a flame you can count on to sustain long bursts of use without wearing down, or becoming too hot to handle comfortably. When the nail, or skillet, is heated enough that’s when you will need the dabber wand."}, {"url": "http://collegeofcannabis.com/reviews/what-is-dabbing/", "passage_text": "You can easily answer the question what is dabbing with the cheapest of equipment, but remember to keep in mind that whatever brand or style of dab rig you choose, it has to be heat resistant or it will quickly become useless. Black Leaf is a big name in the smoking accessory’s business, and that includes dab rigs. To really answer the question what is dabbing for yourself you will need a flame you can count on to sustain long bursts of use without wearing down, or becoming too hot to handle comfortably. When the nail, or skillet, is heated enough that’s when you will need the dabber wand."}, {"url": "https://www.leafly.com/news/cannabis-101/is-dabbing-good-or-bad-or-both", "passage_text": "One of the more surprising side effects of the dabbing trend is that it has created an interest in activism in the community’s younger members. Industry events such as the Cannabis Cup, which used to focus on flowers, have also become proving grounds for the best concentrates and extraction experts. While this is a matter of choice for most consumers, there are fears that dabbing’s ugly looks may hurt the legalization movement. Another side effect of these home extraction experiments is “dirty” oil that may contain chemical contaminants that could present health hazards to consumers."}, {"url": "https://www.leafly.com/news/cannabis-101/is-dabbing-good-or-bad-or-both", "passage_text": "Patients dealing with severe or chronic pain or extreme nausea report that dabbing can be one of the best ways to get immediate and effective relief. The amount of flowers that would have to be smoked or vaporized to get the same effect is just unfeasible for some patients who need potent medicine quickly. While this is a matter of choice for most consumers, there are fears that dabbing’s ugly looks may hurt the legalization movement. Another side effect of these home extraction experiments is “dirty” oil that may contain chemical contaminants that could present health hazards to consumers."}, {"url": "http://dabbing.com/what-is-dabbing/", "passage_text": "Simply put ‘dabbing’ is a slang term used to describe taking single dose hash hits of concentrates that are referred to as oil, errl, earwax, wax, budder, or shatter using pipes and bongs that are made specifically for smoking these cannabis extracts. "}, {"url": "http://www.truthonpot.com/2014/07/02/what-is-dabbing/", "passage_text": "Summary (click to view). Dabbing is the process of ingesting cannabis concentrates called “dabs” Dabs are made by extracting THC from marijuana and are smoked or vaporized using specific utensils Dabs can contain up to 70-90% THC The health effects of dabbing have not been studied. Dabbing is popularly known as the most efficient way to get high. Due to the high concentration of THC, just a small amount of BHO is needed to achieve the desired effects. Because of this, some have referred to dabs as the “crack” of marijuana. Some say dabbing provides a different, more powerful high"}, {"url": "http://www.truthonpot.com/2014/07/02/what-is-dabbing/", "passage_text": "Dabbing is a new way of ingesting cannabis that involves highly concentrated preparations, known as dabs or butane hash oil (BHO). These hard, wax-like concentrates are made by extracting THC — marijuana’s active ingredient — from cannabis through a process that uses butane gas as the solvent. Dabbing is popularly known as the most efficient way to get high. Due to the high concentration of THC, just a small amount of BHO is needed to achieve the desired effects. Because of this, some have referred to dabs as the “crack” of marijuana. Some say dabbing provides a different, more powerful high"}]