[{"url": "http://healthybliss.net/benefits-of-flax-seed-how-much-to-take-daily-and-how-to-grind-at-home/", "passage_text": "In this case, if you were eating 10x-20x the normal recommended amount of daily dietary fiber, you may be in store for some serious buffalo-sized poo! As I said before, start with 2 Tbsp. of ground flax seed daily and slowly build up to 3-4 Tbsp. with a maximum of 6 Tbsp. per day. If you’re eating 53 calories of fat in a 1500 calories per day diet, that equates to 3.5% of total calories in fat. Move up to 4 Tbsp. per day and you’re at 7%. Now do the math on your latte and chocolate bar and factor in their nutritional value then re-evaluate who is your friend and who is your foe."}, {"url": "http://www.lifescript.com/health/centers/rheumatoid_arthritis/s.aspx?query=how+much+flax+seed+per+day", "passage_text": "sardines) or any other food with omega-3 fatty acids, such as walnuts, soy beans, flax seeds, canola oil ... (Learn how else you can prevent rheumatoid arthritis.) How much to eat ... easy healthy fix: Add walnuts (2.27 grams per quarter cup) to a salad or flaxseed (two tablespoons ... The researchers called leptin “fat-melting.”. So, eat too much sugar and bam! ... It has less than 1 gram of sugar per serving, 10 grams of fiber, and it includes flax seeds, which are a great source of omega-3 fatty acids. ... Haagen-Dazs, for example, has 21 grams of sugar per serving. ..."}, {"url": "http://www.livestrong.com/article/428116-flax-seeds-how-much-per-day/", "passage_text": "Serving Size. The University of Maryland Medical Center recommends adults consume 1 tablespoon of ground flaxseed two to three times a day, or 2 to 4 tablespoons once per day. You can mix the ground seeds into cereal, yogurt, oatmeal or smoothies or sprinkle them generously on top of salads and vegetable dishes. Just 1 tablespoon of ground flaxseeds delivers almost 2 grams of dietary fiber, which promotes digestive regularity. Flaxseeds also supply alpha-linolenic acid, a heart-healthy omega-3 fatty acid, and phytonutrients called lignans that may help protect you from cancer."}, {"url": "http://healthybliss.net/benefits-of-flax-seed-how-much-to-take-daily-and-how-to-grind-at-home/", "passage_text": "Ground flax should be stored in a glass container in the fridge. 2 Tbsp. of ground flax seed has almost 4 grams of total dietary fiber. I recommend that you start with adding 2 Tbsp. of ground flax seed to your daily diet, and slowly increase to 3-4 Tbsp. per day. If you’re eating 53 calories of fat in a 1500 calories per day diet, that equates to 3.5% of total calories in fat. Move up to 4 Tbsp. per day and you’re at 7%. Now do the math on your latte and chocolate bar and factor in their nutritional value then re-evaluate who is your friend and who is your foe."}, {"url": "http://www.funwithhealthyfood.com/how-much-chia-seeds-per-day.html", "passage_text": "The Start Small Approach. The first approach you can have about how much chia seeds per day you should eat, is to start out with a small amount, let's say about a teaspoon per day, for a couple days, and see how your body reacts. As you can see, there's not just one cut-and-dry answer to How much chia seeds should I eat per day?. You could start with a small quantity and build up, or you could consult a doctor, or just jump right in and consume a tablespoon or two on an as-needed basis."}, {"url": "http://www.ellies-whole-grains.com/how-much-flaxseed.html", "passage_text": "After 2-3 days, increase to 1 teaspoon of ground flax a day. Continue this to the goal of 2 teaspoons ground flaxseed daily. (~greater than 6y/o or 50-100 pounds; if greater than 100lbs work up to adult dose). Start with 1 teaspoon of ground flax seed a day. Drink 8-10 cups of fluids (preferably water)of ground flaxseed a day. After 2-3 days, increase to 2 teaspoons of ground flax a day. Continue this to the goal of 2-4 teaspoons of ground flax seed dail"}, {"url": "http://www.ellies-whole-grains.com/how-much-flaxseed.html", "passage_text": "After 2-3 days, increase to 2 Tablespoons ground flax a day. Continue this to the goal of 2-4 Tablespoons ground flaxseed a day. -Recommendations from professionals vary from 2-4 Tablespoons of ground flax seed. I know many people who eat regularly 2-4 Tablespoons of ground flax daily. Continue this to the goal of 2 teaspoons ground flaxseed daily. (~greater than 6y/o or 50-100 pounds; if greater than 100lbs work up to adult dose). Start with 1 teaspoon of ground flax seed a day. Drink 8-10 cups of fluids (preferably water)of"}, {"url": "http://healthybliss.net/benefits-of-flax-seed-how-much-to-take-daily-and-how-to-grind-at-home/", "passage_text": "While true that ground flax seed does contain fat (5.9 x 9 calories per gram = 53.1 calories of fat per 2 Tbsp./75 calorie serving), it’s important to keep things in perspective. If you’re eating 53 calories of fat in a 1500 calories per day diet, that equates to 3.5% of total calories in fat. Move up to 4 Tbsp. per day and you’re at 7%. Now do the math on your latte and chocolate bar and factor in their nutritional value then re-evaluate who is your friend and who is your foe. The answer: 2-4 Tbsp. of ground flax seed is not a high-fat contribution to your overall dietary intake of food"}, {"url": "http://www.just-health.net/How-Much-Chia-Seed-Per-Day.html", "passage_text": "The amount of seeds you need to consume will vary based whether you are hoping to increase your intake of fiber, calcium or omega-3s. For example, those that consume 15 to 20 grams (2 to 3 tablespoons) of chia seeds will fulfill their daily requirement of omega-3s. Confirm the following dosages with your doctor and do not stray from the agreed dosage. 1  Adults may consume 15-20 grams of chia seeds per day. 1 Adults may consume 15-20 grams of chia seeds per day. 2  Those between the ages of 10-18 may consume about 10 grams of chia seeds each day. 3  Children under 10 should not consume more than 1 tablespoon of chia seeds."}]