[{"url": "http://science.howstuffworks.com/life/cellular-microscopic/extremophile1.htm", "passage_text": "We'll explain those terms in a second. ­Woese found that many archaea were extremophiles and considered this fact evidence of their ancient provenance (archaea means ancient). ­Archaea are a diverse group of organisms with their own unique type of rRNA, different from bacteria­. (rRNA produces polypeptides, which help to form proteins.) In many cases, extremophile archaea have developed mechanisms relating to their cell membranes to protect them from hostile environments. -- but they can also illuminate some of the important differences between extremophiles and other organisms. Before we look at a few of the environments extremophiles favor, here's a list of some additional names used to classify specific types of extremophiles: 1  Acidophile: likes acidic environments (low pH)."}, {"url": "https://en.wikipedia.org/wiki/Extremophile", "passage_text": "Most known extremophiles are microbes. The domain Archaea contains renowned examples, but extremophiles are present in numerous and diverse genetic lineages of bacteria and archaeans. Furthermore, it is erroneous to use the term extremophile to encompass all archaeans, as some are mesophilic. New sub-types of-philes are identified frequently and the sub-category list for extremophiles is always growing. For example, microbial life lives in the liquid asphalt lake, Pitch Lake. Research indicates that extremophiles inhabit the asphalt lake in populations ranging between 10 6 to 10 7 cells/gram."}, {"url": "http://www.answers.com/Q/What_is_an_extremophile._which_domain_contains_extremophiles", "passage_text": "An extremophile is any microbe that thrives in extreme conditions of temperature, pressure, salinity [dissolved salt content], or concentrations of hostile chemicals. Most bel … ong to the kingdom Archaebacteria, and most Archaebacteria are extremophiles. A root domain is yourwebsite.com. Then there are subdomains of this root domain which … would be yourwebsite.com and blog.yourwebsite.com. When you register or buy a domain, you are acquiring a root domain and when you build a website, you create subdomains off of that root domain."}, {"url": "http://www.ucmp.berkeley.edu/archaea/archaea.html", "passage_text": "Although many books and articles still refer to them as Archaebacteria, that term has been abandoned because they aren't bacteria -- they're Archaea. Finding Archaea: The hot springs of Yellowstone National Park, USA, were among the first places Archaea were discovered. The Domain Archaea wasn't recognized as a major domain of life until quite recently. Until the 20th century, most biologists considered all living things to be classifiable as either a plant or an animal."}, {"url": "http://learn.genetics.utah.edu/content/astrobiology/environments/", "passage_text": "Extremophiles represent all domains of life. Most extremophiles are simple, single-celled life forms, yet many are not. Extremophiles occur in all three domains of life: bacteria, archaea, and eukaryotes. Microscopic, single-celled bacteria are Earth's simplest life forms. They are also some of Earth's most successful organisms. Life can survive in many places and in many conditions. All of these places have one thing in common: they provide a liquid medium, organic matter, and an energy source. Learn more about the basic Conditions that Support Life."}, {"url": "https://en.wikipedia.org/wiki/Extremophile", "passage_text": "An extremophile (from Latin extremus meaning extreme and Greek philiā (φιλία) meaning love) is an organism that thrives in physically or geochemically extreme conditions that are detrimental to most life on Earth. New sub-types of-philes are identified frequently and the sub-category list for extremophiles is always growing. For example, microbial life lives in the liquid asphalt lake, Pitch Lake. Research indicates that extremophiles inhabit the asphalt lake in populations ranging between 10 6 to 10 7 cells/gram."}, {"url": "https://en.wikipedia.org/wiki/Extremophile", "passage_text": "An organism that does not require oxygen for growth such as Spinoloricus Cinzia. Two sub-types exist: facultative anaerobe and obligate anaerobe. A facultative anaerobe can tolerate anaerobic and aerobic conditions; however, an obligate anaerobe would die in presence of even trace levels of oxygen. New sub-types of-philes are identified frequently and the sub-category list for extremophiles is always growing. For example, microbial life lives in the liquid asphalt lake, Pitch Lake. Research indicates that extremophiles inhabit the asphalt lake in populations ranging between 10 6 to 10 7 cells/gram."}, {"url": "http://www.theguardians.com/Microbiology/gm_mbm04.htm", "passage_text": "addition, the research into extremophile microbes has led to the confirmation that the new domain of living organisms-the archaea exists. Archaea are not the only extremophiles, there are some eukaryotes that live in such conditions. Microbial life has been found living: Extremophiles are microbes that live in conditions that would kill other creatures. It was not until the 1970's that such creatures were recognized, but the more researchers look, the more they discover that most archaea, some bacteria and a few protists can survive in the harshest and strangest of environments."}, {"url": "http://www.answers.com/Q/Which_domain_includes_organisms_that_are_called_extremophiles", "passage_text": "Share to: An extremophile is any microbe that thrives in extreme conditions of temperature, pressure, salinity [dissolved salt content], or concentrations of hostile chemicals. According to Biologists, the large domain that includes the oldest  known fossil cells is called bacteria within the prokaryotic  microorganism."}]