[{"url": "http://www.backinthesaddleproject.com/affordahorse.html", "passage_text": "COST FACTOR... So, your daily feed for the care of one healthy 1100 lb. horse will average between .75 and $4.80 per day for grain and will be around $4.40 per day for hay. That total is $4.40 to $8.80 per day. Multiply by 30 days per month, and your average cost to feed a healthy 15H horse is a minimum o f $132.00 and can easily go as high as $264.00. That cost can increase easily depending on the amount of work your horse is in, as well as its breed. Thoroughbreds, for example, are known to need a much higher amount of feed in relation to their body weight than the average Quarter horse."}, {"url": "http://www.wowhorses.com/cost-of-a-horse.html", "passage_text": "As an example, if you pay $3000 for a horse, the costs of keeping the horse over 10 years is 7 to 37 times the cost of buying it. It should be noted that the above is typical costs only. A minority of horse owners pay much more or much less than this."}, {"url": "http://en.allexperts.com/q/Horses-702/horse-costs.htm", "passage_text": "for the vet that would depend on if it gets sick. when you buy a new horse you should have the vet do a routine check would be about $100-$150. other then that keep your horse updated on it's shots and proper care and you don't have to worry."}, {"url": "http://en.allexperts.com/q/Horses-702/horse-costs.htm", "passage_text": "My question is: What are all the horse costs. From vet bills to feed to equipment. I live in Portland,OR and would keep the horse at a stable. The board fee is $140 a month."}, {"url": "http://pets.costhelper.com/pet-horse.html", "passage_text": "The price of horses varies according to what they will be used for--Trail Riding, Rodeo/barrel racing or English jumping--and how much training the animal has. The basic rule of thumb is the more training and experience a horse has, the more it will cost."}, {"url": "http://www.oes.org/page2/6795~Average_Vet_Costs_-_National.html", "passage_text": "Dog owners spent an average of $785 on vet bills last year, while cat owners spent $516, according to the American Pet Products Manufacturers Association. (By contrast, on toys and treats, dog owners spent $115; cat owners $72."}, {"url": "http://www.backinthesaddleproject.com/affordahorse.html", "passage_text": "So, your daily feed for the care of one healthy 1100 lb. horse will average between .75 and $4.80 per day for grain and will be around $4.40 per day for hay. That total is $4.40 to $8.80 per day. Multiply by 30 days per month, and your average cost to feed a healthy 15H horse is a minimum o f $132.00 and can easily go as high as $264.00. That cost can increase easily depending on the amount of work your horse is in, as well as its breed. Thoroughbreds, for example, are known to need a much higher amount of feed in relation to their body weight than the average Quarter horse."}]