[{"url": "https://en.wikipedia.org/wiki/Flag_of_Turkey", "passage_text": "The flag of Turkey (Turkish: Tuerk türk, bayrağı Meaning turkish) flag is a red flag featuring a white star and. Crescent the flag is often called al (bayrak the red) flag and referred to as al (sancak the red) banner in The turkish national. anthem Fundamentals of the Turkish flag during the Republic period of Turkey were laid down by Turkish Flag Law No. 2994 on May 29, 1936. Turkish Flag Regulation No. 2/7175 dated July 28, 1937, and Supplementary Regulation No. 11604/2 dated July 29, 1939, were enacted to describe how the flag law would be implemented."}, {"url": "http://www.mapsofworld.com/flags/turkey-flag.html", "passage_text": "The Turkey Flag that is currently in use was adopted on 5 th June, 1936. The star in the flag of Turkey is said to represent the Morning Star as mentioned in the Holy Koran. The white crescent and the star are symbols of Islam."}, {"url": "https://flagspot.net/flags/tr.html", "passage_text": "The flag in the Turkish national anthem. The Turkish national anthem, the Independence March (İstiklâl Istiklâl) marşı was adopted on 12 march. 1921 following a competition and the submission of 724, proposals The Grand National assembly unanimuously adopted The Independence march written By Mehmet Akif (ersoy-1863). 1936 National flag of Turkey-Image by Antonio António, martins 9 december. 2007 flag in use since 1844 and officially adopted 5 june, 1936 coat of arms adopted in. 1927: proportions:2. 3"}, {"url": "https://flagspot.net/flags/tr.html", "passage_text": "Construction sheet for the Turkish flag. Construction sheet for the flag of Turkey-Image by Željko Heimer, 2 March 1999. The construction sheet is given in a book on Turkish flags [kur92] . The book is in Turkish, 170 pages, with some 30 colour plates of historical and current flags and some black and white photos. National flag of Turkey-Image by Antonio António, martins 9 december. 2007 flag in use since 1844 and officially adopted 5 june, 1936 coat of arms adopted in. 1927: proportions:2. 3"}, {"url": "http://flagpedia.net/turkey", "passage_text": "Flag of Turkey. Turkish flag consists of a red leaf with a symbol of white crescent and a five-pointed star that are located in the left part of the flag. The symbolism of all these elements has its roots in ancient history. The red color was used by the Ottoman Empire, whose origins date back to the 13th century. Crescent and star are ancient symbols of Islam, however it appeared in Turkey even before Islam. Crescent has been on the flag since the 16th century and it is a symbol of the goddess Diana, guardian of the city Byzancion"}, {"url": "http://www.worldatlas.com/webimage/flags/countrys/mideast/turkey.htm", "passage_text": "Buy this flag, or any country flag here. DESCRIPTION. The flag of Turkey was officially adopted on June 5, 1936. The white crescent and star, symbols of Islam, are placed slightly to the left on the red field, and that shade of red dates back to the Ottoman Empire in the 17th century. all Country Flags here! Map of Turkey here!"}, {"url": "https://flagspot.net/flags/tr.html", "passage_text": "Meaning of the Turkish flag. Meaning of flags is a difficult topic, especially when flags are very ancient. There is usually sparse historical evidence and a lot of legends. Moreover, individuals may have their own interpretation of their national flag. National flag of Turkey-Image by Antonio António, martins 9 december. 2007 flag in use since 1844 and officially adopted 5 june, 1936 coat of arms adopted in. 1927: proportions:2. 3"}, {"url": "http://www.mapsofworld.com/flags/turkey-flag.html", "passage_text": "The Turkish Flag comprises of a red background on which there is the motif of the. crescent moon and a star. The star in the flag of Turkey is said to represent the Morning Star as mentioned in the Holy Koran. The white crescent and the star are symbols of Islam. This motif is placed slightly on the left side of the red background in the Turkey Flag"}, {"url": "http://www.worldflags101.com/t/turkey-flag.aspx", "passage_text": "Turkish Flag Meaning: Red is a traditional Islamic color and was the color used by the Ottoman Empire, who formerly ruled Turkey, but the empire collapsed in 1918. The crescent and star are ancient symbols of Islam and are considered to be signs of good luck."}, {"url": "https://en.wikipedia.org/wiki/Flag_of_Turkey", "passage_text": "The flag is often called al bayrak (the red flag) and referred to as al sancak (the red banner) in the Turkish national anthem. The current design of the Turkish flag is directly derived from the late Ottoman flag, which had acquired its final form in 1844. The measures, geometric proportions, and exact tone of red of the flag of Turkey were legally standardized with the Turkish Flag Law on May 29, 1936. Fundamentals of the Turkish flag during the Republic period of Turkey were laid down by Turkish Flag Law No. 2994 on May 29, 1936. Turkish Flag Regulation No. 2/7175 dated July 28, 1937, and Supplementary Regulation No. 11604/2 dated July 29, 1939, were enacted to describe how the flag law would be implemented."}]