[{"url": "http://www.youtube.com/watch?v=0FlBIxaZCTg", "passage_text": "Please try again later. Audio and video pronunciation of Andree andrée brought to you By Pronounce (names://http.PronounceNames.pronouncenames), com a website dedicated to helping people pronounce names. Correctly for more information about this, name such as, gender, origin., etc go to://http.PronounceNames.pronouncenames/Com andr. ee ée Please try again later. Audio and video pronunciation of Andree andrée brought to you By Pronounce (names://http.PronounceNames.pronouncenames), com a website dedicated to helping people pronounce names. correctly"}, {"url": "https://en.wikipedia.org/wiki/List_of_names_in_English_with_counterintuitive_pronunciations", "passage_text": "This is a set of lists of English personal and place names whose pronunciations are counterintuitive to their spelling, because the pronunciation does not correspond to the spelling, or because a better known namesake has a markedly different pronunciation. "}, {"url": "http://www.confetti.co.uk/occasions/french-versions-of-english-names", "passage_text": "When using French first names, it is important to remember that hyphenated names such as Jean-Pierre are considered a single unit and constitute the person’s first name and not the first and middle name. Several masculine names can be converted into feminine names with the addition of an ‘e’ at the end. "}, {"url": "http://www.meaning-of-names.com/french-names/andree.asp", "passage_text": "French name. In French, the name Andree means-feminine form of andre or andrew masculine.The name Andree originated as an French name. The name Andree is most often used as a girl name or female name. French Name Meaning-feminine form of andre or andrew masculine. Origin-France. Global Star Registery-Name a star after someone special!"}, {"url": "http://www.thinkbabynames.com/meaning/0/Andree", "passage_text": "Andree is a somewhat popular first name for females (#2466 out of 4276, Top 58%) and an even more popular surname for all people (#19642 out of 150436, Top 13%). (2000 U.S. Census). Prominent related forms of Andree (outside Top 1000) are Andrea (#125 in 2014) , Andria and Andrew. Andree's name origin is Greek, and the meaning of Andree is manly, virile. Andree is an alternate form of Andrea (Greek): from the word andreia. Andreu is a popular surname."}, {"url": "http://french.about.com/od/culture/a/frenchnames.htm", "passage_text": "By Laura K. Lawless. There are hundreds of common French first names. Some of them look just like their English counterparts, others are fairly similar, and still others may be uniquely French. These pages include more than 200 of the most popular French names, along with their pronunciation and English equivalents. When looking at these names, please keep the following things in mind: 1. Hyphenated names are very popular in France."}, {"url": "http://www.thinkbabynames.com/meaning/0/Andree", "passage_text": "Andree /an-dree/ [2 sylls.] as a name for girls. Andree's name origin is Greek, and the meaning of Andree is manly, virile. Andree is an alternate form of Andrea (Greek): from the word andreia. Andreu is a popular surname."}, {"url": "http://www.babynamespedia.com/meaning/Andree/m", "passage_text": "[ 2 syll. an-dree, and-r- ee ] The baby boy name Andree is also used as a girl name. Its pronunciation is AHNDR IY †. The origin of Andree is the Old Greek language. Andree is a variant of the name Andre (Dutch, English, French, German, and Portuguese). Andree is an infrequently used baby name for boys. It is listed outside of the top 1000 names. "}, {"url": "http://www.youtube.com/watch?v=0FlBIxaZCTg", "passage_text": "Audio and video pronunciation of Andree andrée brought to you By Pronounce (names://http.PronounceNames.pronouncenames), com a website dedicated to helping people pronounce names. Correctly for more information about this, name such as, gender, origin., etc go to://http.PronounceNames.pronouncenames/Com andr. 1  Ee.  ée education Please try again later. Audio and video pronunciation of Andree andrée brought to you By Pronounce (names://http.PronounceNames.pronouncenames), com a website dedicated to helping people pronounce names. correctly"}]