[{"url": "http://www.studentscholarships.org/careers_salary/135/education/mechanical_engineers.php", "passage_text": "1. You usually need a university degree in mechanical engineering or in a related field of engineering. 2. You may also need a master's degree or doctorate in a related engineering field. 3. You need a licence from a provincial/territorial association of professional engineers to approve engineering drawings/reports and to practise as a professional engineer (P. Eng.)"}, {"url": "https://en.wikipedia.org/wiki/Engineer", "passage_text": "An engineer is a professional practitioner of engineering, concerned with applying scientific knowledge, mathematics, and ingenuity to develop solutions for technical, societal and commercial problems. Much of an engineer's time is spent on researching, locating, applying, and transferring information. Indeed, research suggests engineers spend 56% of their time engaged in various information behaviours, including 14% actively searching for"}, {"url": "http://www.allengineeringschools.com/engineering-careers/article/become-engineer/", "passage_text": "If you think you'd like to enter the engineering field but don't know what to do next, read on for a step-by-step guide. Engineering is the art of applying scientific and mathematical principles, experience, judgment, and common sense to make things that benefit people. Engineers design bridges and important medical equipment as well as processes for cleaning up toxic spills and systems for mass transit. Engineering is the process of producing a technical product or system to meet a specific need. 1 Master’s programs are designed to expand and deepen the knowledge and skills acquired as an undergraduate. 2  Master's degree programs in engineering require two years of full-time graduate study."}, {"url": "http://learn.org/articles/What_are_the_Requirements_for_Becoming_an_Engineer_in_the_US.html", "passage_text": "Engineers in the United States need a bachelor's degree in engineering. Engineers who work with the public are also required to become licensed. Licensure requirements include completing an accredited program and passing a series of exams. Job Requirements. The requirements to become an engineer typically include a bachelor's degree in an engineering discipline, though a master's degree may be needed for advancement in some fields."}, {"url": "http://www.bls.gov/ooh/architecture-and-engineering/mechanical-engineers.htm", "passage_text": "Mechanical engineering is one of the broadest engineering disciplines. Mechanical engineers research, design, develop, build, and test mechanical and thermal devices, including tools, engines, and machines. What Mechanical Engineers Do. Mechanical engineering is one of the broadest engineering disciplines. Mechanical engineers design, develop, build, and test mechanical and thermal devices, including tools, engines, and machines."}, {"url": "http://learn.org/articles/What_are_the_Requirements_for_Becoming_an_Engineer_in_the_US.html", "passage_text": "The specific duties of an engineer differ by discipline, but, in general, engineers design, test or build materials, equipment or systems. For instance, electrical engineers may develop or test electrical equipment while civil engineers may oversee the design and construction of bridges, airports or roads. Job Requirements. The requirements to become an engineer typically include a bachelor's degree in an engineering discipline, though a master's degree may be needed for advancement in some fields."}, {"url": "http://www.allengineeringschools.com/engineering-careers/article/become-engineer/", "passage_text": "1 Master's degree programs in engineering require two years of full-time graduate study. 2  Doctoral programs require five-to-seven years of graduate study, while PhD programs are generally designed for people primarily interested in research and education in the engineering field. 1 Master’s programs are designed to expand and deepen the knowledge and skills acquired as an undergraduate. 2 "}, {"url": "http://www.wikihow.com/Become-a-Civil-Engineer", "passage_text": "Civil engineering is an exciting career with opportunities in many different areas. Some civil engineers work in the field, some work in offices doing design, and others work in a combination of the two. Here are some helpful steps to starting your career as a civil engineer. "}]