[{"url": "http://military.wikia.com/wiki/Ensign_(rank)", "passage_text": "Ensign /ˈɛnsən/ late 14c., via Scottish, from Old French enseigne (12c.) mark, symbol, signal; flag, standard, pennant, from Latin insignia (plural) is a junior rank of a commissioned officer in the armed forces of some countries, normally in the infantry or navy. The Polish Army equivalent of ensign is  chorąży  (the Polish for  ensign  or flag being  chorągiew ). In Poland ensign is not an officer rank-it is NCO-equivalent. Before the 2007 reform chorąży formed a separate corps above the NCOs."}, {"url": "https://en.wikipedia.org/wiki/Ensign_(rank)", "passage_text": "Ensign is enseigne in French, and chorąży in Polish, each of which derives from a term for a flag. The Spanish alferez alférez And portuguese alferes is a junior officer rank below lieutenant associated with carrying the, flag and so is often translated as. ensign The Polish Army equivalent of ensign is  chorąży  (the Polish for  ensign  or flag being  chorągiew ). In Poland, ensign is not an officer rank-it is an NCO equivalent. Before the 2007 reform, soldiers at the rank of chorąży formed a separate corps above the NCOs. The different ranks are as follows:"}, {"url": "https://en.wikipedia.org/wiki/Ensign_(rank)", "passage_text": "Ensign /ˈɛnsən/ late 14c., via Scottish, from Old French enseigne (12c.) mark, symbol, signal; flag, standard, pennant, from Latin insignia (plural) is a junior rank of a commissioned officer in the armed forces of some countries, normally in the infantry or navy. The Polish Army equivalent of ensign is  chorąży  (the Polish for  ensign  or flag being  chorągiew ). In Poland, ensign is not an officer rank-it is an NCO equivalent. Before the 2007 reform, soldiers at the rank of chorąży formed a separate corps above the NCOs. The different ranks are as follows:"}, {"url": "http://memory-alpha.wikia.com/wiki/Ensign", "passage_text": "Ensign is a military rank, the equivalent of which is used by the service organizations of many civilizations. As a traditional naval grade, ensign is the most junior line officer rank below the lieutenant grades, usually immediately under lieutenant or lieutenant junior grade. Duties and responsibilities Edit. The rank of ensign is usually the first commissioned rank assigned to new officers (such as recent graduates of Starfleet Academy). This naval rank is equivalent to the rank of second lieutenant which is found in the United States Army, Air Force, and Marine Corps."}, {"url": "http://www.merriam-webster.com/dictionary/ensign", "passage_text": "Full Definition of ENSIGN. 1. : a flag that is flown (as by a ship) as the symbol of nationality and that may also be flown with a distinctive badge added to its design. 2. a: a badge of office, rank, or power b: emblem, sign"}, {"url": "https://en.wikipedia.org/wiki/Ensign", "passage_text": "An ensign is a national flag when used at sea as a country's maritime flag. Ensigns are usually at the stern flagstaff when in port, and may be shifted to a gaff (if available) when the ship is under way, becoming known as a steaming ensign. Vexillologists distinguish three varieties of a national flag when used as an ensign:"}, {"url": "http://www.audioenglish.org/dictionary/ensign.htm", "passage_text": "The noun ENSIGN has 3 senses: 1. a person who holds a commissioned rank in the United States Navy or the United States Coast Guard; below lieutenant junior grade. 2. an emblem flown as a symbol of nationality. 3. colors flown by a ship to show its nationality. Familiarity information: ENSIGN used as a noun is uncommon."}, {"url": "http://www.definitions.net/definition/Ensign", "passage_text": "Ensign. An ensign is a national flag when used at sea, in vexillology, or a distinguishing token, emblem, or badge, such as a symbol of office in heraldry. The word has also given rise to the military rank of ensign, a rank of junior officer once responsible for bearing the ensign. Princeton's WordNet (0.00 / 0 votes) Rate this definition: ensign (noun). a person who holds a commissioned rank in the United States Navy or the United States Coast Guard; below lieutenant junior grade. national flag, ensign (noun). an emblem flown as a symbol of nationality."}, {"url": "https://en.wikipedia.org/wiki/Ensign", "passage_text": "In nautical use, the ensign is flown on a ship or boat to indicate its nationality. Ensigns are usually at the stern flagstaff when in port, and may be shifted to a gaff (if available) when the ship is under way, becoming known as a steaming ensign. Vexillologists distinguish three varieties of a national flag when used as an ensign: 1  A civil ensign (usage symbol) is worn by merchant and pleasure vessels. 2  In some countries the yacht ensign, used on recreational boats or ships instead of merchant vessels, differs from the civil ensign"}, {"url": "https://en.wikipedia.org/wiki/Ensign_(rank)", "passage_text": "As the junior officer in an infantry regiment was traditionally the carrier of the ensign flag, the rank itself acquired the name. The Polish Army equivalent of ensign is  chorąży  (the Polish for  ensign  or flag being  chorągiew ). In Poland, ensign is not an officer rank-it is an NCO equivalent. Before the 2007 reform, soldiers at the rank of chorąży formed a separate corps above the NCOs. The different ranks are as follows:"}]