[{"url": "https://en.wikipedia.org/wiki/Gamete", "passage_text": "In species that produce two morphologically distinct types of gametes, and in which each individual produces only one type, a female is any individual that produces the larger type of gamete—called an ovum (or egg)—and a male produces the smaller tadpole-like type—called a sperm. Dissimilarity [edit]. In contrast to a gamete, the diploid somatic cells of an individual contain one copy of the chromosome set from the sperm and one copy of the chromosome set from the egg cell; that is, the cells of the offspring have genes expressing characteristics of both the father and the mother."}, {"url": "https://en.wikipedia.org/wiki/Sexes", "passage_text": "The gametes produced by an organism are determined by its sex: males produce male gametes (spermatozoa, or sperm, in animals; pollen in plants) while females produce female gametes (ova, or egg cells); individual organisms which produce both male and female gametes are termed hermaphroditic. Organisms of many species are specialized into male and female varieties, each known as a sex. Sexual reproduction involves the combining and mixing of genetic traits: specialized cells known as gametes combine to form offspring that inherit traits from each parent."}, {"url": "http://biology.about.com/od/geneticsglossary/g/gametes.htm", "passage_text": "Definition: Gametes are reproductive cells (sex cells) that unite during sexual reproduction to form a new cell called a zygote. Male gametes are sperm and female gametes are ova (eggs). In seed bearing plants, p ollen is the male sperm producing gametophyte. Female gametes are contained within the plant ovary. In animals, gametes are produced in male and female gonads. Sperm are motile and have a long, tail-like projection called a flagellum. Ova however, are non-motile and relatively large in comparison to the male gamete. Gametes are produced by a type of cell division called meiosis. They are haploid, meaning that they contain only one set of chromosomes. When the haploid male and female gametes unite in a process called fertilization, they form what is called a zygote. The zygote is diploid and contains two sets of chromosomes"}, {"url": "http://www.nature.com/scitable/definition/gamete-gametes-311", "passage_text": "Gametes are an organism's reproductive cells. They are also referred to as sex cells. Female gametes are called ova or egg cells, and male gametes are called sperm. Gametes are haploid cells, and each cell carries only one copy of each chromosome. These reproductive cells are produced through a type of cell division called meiosis. "}, {"url": "https://answers.yahoo.com/question/index?qid=20120116104854AAfFijI", "passage_text": "Report Abuse. Gametes are produced in the gonads. The male gamete, sperm, is produced in the testes.The female gamete, egg, is produced in the ovaries. All gametes are formed by a process called meiosis. nycaypeh · 4 years ago. Thumbs up. Female gametes: Ovum As we know, sperms are produced in male gonads (testicles) through spermatogenesis and ovum are produced in female gonads (sexual glands) called ovaries. So,that's your answer."}, {"url": "http://www.plantcell.org/content/20/11/2929.full", "passage_text": "LORELEI: Guiding the Fate of Male Gametes. In flowering plants, male and female gametes are produced in the anther and ovule, respectively. Male gametes are contained within pollen grains, which are released from the anthers at anthesis. "}, {"url": "http://study.com/academy/lesson/female-gamete-production-definition-quiz.html", "passage_text": "They are haploid cells that, when fused during sexual reproduction with a male gamete (sperm), form a zygote. Let's break this down a little more. During sexual reproduction, two cells-one from a female organism and one from a male organism-fuse together to create a zygote, a fertilized cell. One gamete comes from the female, and one comes from the male. Female gametes are also called eggs or ova. Female gametes are also called eggs or ova. They are created during the cellular reproduction process known as meiosis."}, {"url": "http://study.com/academy/lesson/gametes-definition-formation-fusion.html", "passage_text": "Definition of Gametes. Gametes are the reproductive cells used during sexual reproduction to produce a new organism called a zygote. The gametes in males and females are different. The male gamete is called sperm. It is much smaller than the female gamete and very mobile. Gametes are the cells used during sexual reproduction to produce a new individual organism or zygote. The male gamete, sperm, is a smaller, mobile cell that meets up with the much larger and less mobile female gamete, egg or ova. Both sperm and egg are only haploid cells. They only carry half of the chromosomes needed."}, {"url": "http://study.com/academy/lesson/female-gamete-production-definition-quiz.html", "passage_text": "In order for organisms to reproduce, two sex cells, or gametes, need to fuse together. One gamete comes from the female, and one comes from the male. Female gametes are also called eggs or ova. Female gametes are also called eggs or ova. They are created during the cellular reproduction process known as meiosis. The resulting gamete cell is a haploid cell"}]