[{"url": "http://www.tnonline.com/2014/oct/08/heating-costs-drop-winter", "passage_text": "That will lead to an average price of $1.99 per gallon in the Midwest, down 24 percent from last year's record average of $2.61. Propane customers in the Midwest will pay $1,500, a savings of $767. Savings at a glance. Predictions for average heating costs by fuel between Oct. 1 and March 31. This winter, some customers could see savings of nearly $800 on their heating bills, according to the EIA. Gasoline prices are expected to soon drop below $3 per gallon on average in up to 30 states. Consumers will have more money to spend on other things, and consumer spending is 70 percent of the nation's economy."}, {"url": "http://www.northjersey.com/news/business/heating-oil-prices-drop-offering-savings-to-nj-consumers-1.1183580", "passage_text": "The cost of heating oil follows the recent path of other fossil fuels, which have also plunged, benefiting consumers this year. For example, gasoline prices now average $2.41 a gallon in Bergen and Passaic counties, down from $3.30 a year ago, according to AAA. Several factors in play. The lower consumer prices reflect turmoil in the oil industry, where prices have fallen to about $60 a barrel for the first time in five years."}, {"url": "http://www.vokesair.com/system/uploads/attachments/0000/0910/The_Cost_of_HVAC_Filters.pdf", "passage_text": "The dominating part is the energy cost (for a filter with filter class F7 the energy cost is 80 % of the total cost [1]). Using a filter with lower pressure drop (more filter bags) will reduce the cost for energy use, but the filter cost will increase. When the program has calculated the filter cost for the installation it automatically changes one of the filters to a 6-pocket filter (extending the filtration area in order to reduce the pressure drop and lower the energy consumption) and runs the calculation one more time."}, {"url": "http://www.pennlive.com/midstate/index.ssf/2014/12/heating_oil_prices_-_how_low_w.html", "passage_text": "Heating oil prices are down about 18.6 percent from a year ago in Pennsylvania, so far beating the U.S. Energy Information Administration's prediction of a 15 percent drop this winter. I don't think anybody in the oil industry saw this coming, even a month ago. View/Post Comments. "}, {"url": "http://www.eia.gov/todayinenergy/detail.cfm?id=13311", "passage_text": "EIA projects that average household expenditures for homes heating with natural gas will total $679 this winter, a 13% increase over last winter's average but 4% below the average of the five previous winters (October 2007-March 2012) (see chart above). EIA expects households heating with natural gas to spend an average of $80 (13%) more this winter than last winter. The increase in natural gas expenditures represents a 14% increase in the average U.S. residential price from last winter. Fuel consumption is expected to be slightly lower than last winter nationally."}, {"url": "http://www.washingtonexaminer.com/feds-say-cost-of-heating-homes-will-drop-this-winter/article/2573483", "passage_text": "The average cost for heating homes this winter with natural gas will average $578 in total from October to March, according to the Energy Information Administration, the independent analysis wing of the U.S. Department of Energy. That's a drop of $64 from last winter. Families that use propane gas to heat their homes will see an even bigger decline. The expected total price for this winter is $1,437, which is a $322 drop from the 2014-15 winter. Families that use heating oil will save $459, and their total cost is expected to be $1,392. Ratepayers whose homes are heated by electricity will see the smallest decline, just a small $30 drop from last winter to $930"}, {"url": "http://www.northjersey.com/news/business/heating-oil-prices-drop-offering-savings-to-nj-consumers-1.1183580", "passage_text": "A gallon of heating oil, which cost $4.09 a year ago, now averages $3.23 in New Jersey, according to the latest data from the U.S. Energy Information Administration, and prices are expected to drop further. The lower prices are projected to mean savings of about $700 for the average oil customer this winter. For example, gasoline prices now average $2.41 a gallon in Bergen and Passaic counties, down from $3.30 a year ago, according to AAA. Several factors in play. The lower consumer prices reflect turmoil in the oil industry, where prices have fallen to about $60 a barrel for the first time in five years."}, {"url": "http://agfax.com/2014/10/09/u-s-energy-heating-oil-propane-expenditures-projected-drop/", "passage_text": "EIA projects the retail price of heating oil to average $3.63 per gallon (gal) this winter heating season (October 2014-March 2015), which would be $0.25/gal lower than the average price during the winter of 2013-14 (Figure 1). This lower heating oil price reflects EIA’s forecast for a lower Brent crude oil price. EIA projects the retail propane price during the winter heating season in the Midwest and Northeast to average $0.62/gal and $0.18/gal lower, respectively, than the winter 2013-14 average. The market for heating fuels is highly dependent on winter temperatures. If temperatures are 10% colder than forecast on a heating-degree-day basis, EIA projects average expenditures will be $124 lower and prices will be $0.16/gal lower than last winter."}]