[{"url": "http://www.wagga.nsw.gov.au/city-of-wagga-wagga/recreation/parks/botanic-gardens", "passage_text": "This garden was established as a Bicentennial project by the Quota Club of Wagga Wagga, the Hume Region Branch of the Camellia Society, the Wagga Wagga City Council and various other sponsors. The establishment of this garden was taken as an opportunity to cement a sister city relationship with Kunming, China. The extensive rose garden and Australian native plant section located within the Botanic Gardens formed part of the original design. An addition to the Gardens in 1995 was the Waterwise garden, which includes models demonstrating how to minimise water use."}, {"url": "http://www.homeimprovementpages.com.au/find/landscaper_gardener/nsw/wagga_wagga", "passage_text": "Landscapers Wagga Wagga. near. Search. Between 0 and 5 km from Wagga Wagga 2650. Greater Grass Installations. location Wagga Wagga, New South Wales. Greater Grass Installations. Greatergrass Installations is the longest serving synthetic grass installations company in the Riverina. However whatever materials used they need to be car friendly as this is where we back the car out to exit property. So rocks not ideal.the area is about 4 metres long and 1 m deep approx. Alias from Wagga Wagga posted: Retaining walls, concrete around the house, possibly the garden too."}, {"url": "http://www.wagga.nsw.gov.au/city-of-wagga-wagga/recreation/parks/botanic-gardens", "passage_text": "3. Tree Chapel. This Chapel was funded by the Combined Churches of Wagga Wagga, as part of a Bicentennial Project. It provides a venue for open air services and weddings in a setting reminiscent of early religion, being as it was simplistic and rustic. All the trees and shrubs in this area have relevance to the Bible. The extensive rose garden and Australian native plant section located within the Botanic Gardens formed part of the original design. An addition to the Gardens in 1995 was the Waterwise garden, which includes models demonstrating how to minimise water use."}, {"url": "http://www.wagga.nsw.gov.au/__data/assets/pdf_file/0007/2203/Community-Gardens-Policy-POL-024.pdf", "passage_text": "developed to respond to the needs of the community of Wagga Wagga in line with the. Community Strategic Plan 2011 – 2021. 1.1 Policy Objectives This policy and accompanying procedures determines the parameters and guidelines for the use of Wagga Wagga City Council land as community garden space. • Decommissioning of the community garden. 2.2 Council Support The Council will assist incorporated not for profit community groups and organisations in searching for suitable public open space for the development of community gardens within Wagga Wagga Local Government Area."}, {"url": "https://en.wikipedia.org/wiki/Wagga_Wagga", "passage_text": "Wagga Wagga became a garrison town during World War II with the establishment of a military base at Kapooka and Royal Australian Air Force bases at Forest Hill and Uranquinty. After the war, Wagga Wagga was proclaimed as a city in 1946 and new suburbs were developed to the south of the city. In 1982 the city was amalgamated with the neighbouring Kyeamba and Mitchell Shires to form the City of Wagga Wagga local government area. "}, {"url": "http://www.homeimprovementpages.com.au/find/landscaper_gardener/nsw/wagga_wagga", "passage_text": "Post a job like this. Colleen from Wagga Wagga posted: I need some ideas on a difficult area of garden/driveway, and a quote to do the work.we have a large pot backed up against a wall, and a very sloping driveway in front of pot, I think a small retaining wall or strategically place rocks would level this area. However whatever materials used they need to be car friendly as this is where we back the car out to exit property. So rocks not ideal.the area is about 4 metres long and 1 m deep approx. Alias from Wagga Wagga posted: Retaining walls, concrete around the house, possibly the garden too."}, {"url": "http://www.wagga.nsw.gov.au/city-of-wagga-wagga/recreation/parks/botanic-gardens", "passage_text": "This area features drought resistant plants from Africa and America, which is another Bicentennial Project with the assistance from the Cactus and Succulent Society of Wagga Wagga. All plants within the garden originate from areas with low rainfall and have adopted succulence as a method of withstanding drought. The extensive rose garden and Australian native plant section located within the Botanic Gardens formed part of the original design. An addition to the Gardens in 1995 was the Waterwise garden, which includes models demonstrating how to minimise water use."}, {"url": "http://www.smh.com.au/news/New-South-Wales/Wagga-Wagga/2005/02/17/1108500200023.html", "passage_text": "The railway arrived in North Wagga in 1878 with a 2500-m trestle built across the Murrumbidgee in 1879 to allow the line to continue to South Wagga. The longest railway trestle in NSW, it was extended in 1879 and renewed with steel in 1910. Wagga Wagga received some attention in the country's media and in England when one Thomas Castro moved to the town in 1864 and claimed to be Roger Tichborne, the heir of a Hampshire baronetcy who was believed drowned when the ship he was travelling on disappeared off South America."}, {"url": "http://www.smh.com.au/news/New-South-Wales/Wagga-Wagga/2005/02/17/1108500200023.html", "passage_text": "Situated on the Murrumbidgee River, Wagga Wagga is NSW's largest inland city and is considered the capital of the Riverina area of NSW. Halfway between Sydney and Melbourne and a two-and-a-half hour drive from Canberra, it is 214 m above sea-level and has a population of approximately 57 000. Wagga Wagga received some attention in the country's media and in England when one Thomas Castro moved to the town in 1864 and claimed to be Roger Tichborne, the heir of a Hampshire baronetcy who was believed drowned when the ship he was travelling on disappeared off South America."}, {"url": "http://www.wagga.nsw.gov.au/__data/assets/pdf_file/0007/2203/Community-Gardens-Policy-POL-024.pdf", "passage_text": "1.2 Scope of Policy This policy applies to the identification and usage of Wagga Wagga City Council public land for use as a community garden by incorporated not for profit community groups or organisations residing in the Wagga Wagga Local Government Area. 1.3 Definitions. • Decommissioning of the community garden. 2.2 Council Support The Council will assist incorporated not for profit community groups and organisations in searching for suitable public open space for the development of community gardens within"}]