[{"url": "https://en.wikipedia.org/wiki/Orbit_(anatomy)", "passage_text": "This article is about the orbit, the anatomical space that contains the eye. For other uses of orbit or orbita see Orbit (disambiguation) and Orbita (disambiguation) . In anatomy, the orbit is the cavity or socket of the skull in which the eye and its appendages are situated. Orbit can refer to the bony socket, or it can also be used to imply the contents. In the adult human, the volume of the orbit is 30 mL, of which the eye occupies 6.5 mL. "}, {"url": "http://www.thefreedictionary.com/orbit", "passage_text": "orbit. 1  apsis-The extreme point of an orbit. 2  eccentric-First meant not concentric as it referred to an orbit in which the Earth was not precisely in the center or straying from a circular path; the area where two circles overlap is the eccentric. orbit. the path in which something moves around a planet, star etc, eg the path of the Earth round the Sun or of a spacecraft round the Earth."}, {"url": "http://www.yourdictionary.com/orbit", "passage_text": "These planets orbit the sun. These planets orbit the sun. The definition of an orbit is a circular shape, the rotation of one full circle or a range of experience. 1  The path the earth takes around the sun is an example of the earth's orbit. 2  The 365 days it takes the earth to get around the sun is an example of the time it takes for a complete orbit or full circle around"}, {"url": "http://www.nasa.gov/audience/forstudents/5-8/features/orbit_feature_5-8.html", "passage_text": "An orbit is a regular, repeating path that one object in space takes around another one. An object in an orbit is called a satellite. A satellite can be natural, like the Earth or the Moon. It can also be man-made, like the Space Shuttle or the ISS. In our solar system, the Earth and the eight other planets orbit the Sun. Most of the objects orbiting the Sun move along or close to an imaginary flat surface. This imaginary surface is called the ecliptic plane. Many planets also have moons."}, {"url": "https://simple.wikipedia.org/wiki/Orbit", "passage_text": "This is like the Pluto-Charon system. An orbit is the path that an object takes in space when it goes around a star, a planet, or a moon. It can also be used as a verb. For instance: “The earth orbits around the Sun.” The word ‘revolves’ has the same meaning, but 'rotates' is the spin of the object. Isaac Newton discovered that gravity controls the orbit of the planets and moons. Since a satellite is an object in space that revolves around another object, the earth is a satellite of the sun, just like the moon is a satellite of the Earth!"}, {"url": "http://www.yourdictionary.com/orbit", "passage_text": "1 The path the earth takes around the sun is an example of the earth's orbit. 2  The 365 days it takes the earth to get around the sun is an example of the time it takes for a complete orbit or full circle around. 3  The experiences and actions of one person during a period of time is an example of his orbit. The definition of an orbit is a circular shape, the rotation of one full circle or a range of experience. 1 "}, {"url": "http://www.qrg.northwestern.edu/projects/vss/docs/space-environment/1-what-is-an-orbit.html", "passage_text": "An orbit is a regular, repeating path that an object in space takes around another one. An object in an orbit is called a satellite. (This drawing is not a scale drawing). In our solar system, the Earth orbits the Sun, as do the other eight planets. They all travel on or near the orbital plane, an imaginary disk-shaped surface in space. All of the orbits are circular or elliptical in their shape."}, {"url": "http://www.thefreedictionary.com/orbit", "passage_text": "1 apsis-The extreme point of an orbit. 2  eccentric-First meant not concentric as it referred to an orbit in which the Earth was not precisely in the center or straying from a circular path; the area where two circles overlap is the eccentric. orbit. the path in which something moves around a planet, star etc, eg the path of the Earth round the Sun or of a spacecraft round the Earth."}, {"url": "http://www.thefreedictionary.com/orbit", "passage_text": "1 eccentric-First meant not concentric as it referred to an orbit in which the Earth was not precisely in the center or straying from a circular path; the area where two circles overlap is the eccentric. orbit. the path in which something moves around a planet, star etc, eg the path of the Earth round the Sun or of a spacecraft round the Earth."}, {"url": "https://en.wikipedia.org/wiki/Orbit", "passage_text": "In physics, an orbit is the gravitationally curved path of an object around a point in space, for example the orbit of a planet around the center of a star system, such as the Solar System. The reason that the sun is at the focal point of the orbit's ellipse and not at the centre is because if the object is moving really fast then, as it moves out, the gravitational pull decreases allowing the object to almost escape. If it does not quite escape, then its orbit cycles around first as a parabola."}]