[{"url": "https://answers.yahoo.com/question/index?qid=20090923011633AAXUB5l", "passage_text": "Canada is not considered as part of the U.S.A. but it is considered as part of America (North America that is) continent. Canadians do NOT call themselves Canadian Americans, but they do call themselves North Americans since Canada, the US, Mexico, Belize and a number of other countries share the North American continent. America is a short form for the United States of America, and refers to no other country."}, {"url": "http://www.cic.gc.ca/english/study/study-minors.asp", "passage_text": "Minor children must apply for a study permit if they want to study in Canada. In Canada, each province and territory decides the age when a person is considered to be an adult. This is known as the age of majority. A person under the age of majority is considered to be a “minor child.”. "}, {"url": "https://en.wikipedia.org/wiki/Poverty_in_Canada", "passage_text": "Poverty in Canada remains prevalent within some segments of society and according to a 2008 report by the Organisation for Economic Co-operation and Development, the rate of poverty in Canada, is among the highest of the OECD member nations, the world's wealthiest industrialized nations. Currently, an income inequality measure known as low income cut-off published by Statistics Canada is frequently used as a poverty rate and is 10.8% as of 2005. The Central Intelligence Agency uses the LICO as the relative measure results in a higher poverty figure than an absolute one."}, {"url": "https://en.wikipedia.org/wiki/Canada", "passage_text": "Canada is a federal parliamentary democracy and a constitutional monarchy, Queen Elizabeth II being the current head of state. Canada's long and complex relationship with the United States has had a significant impact on its economy and culture. Canada is a developed country and one of the wealthiest in the world, with the tenth highest nominal per capita income globally, and the eighth highest ranking in the Human Development Index."}, {"url": "https://en.wikipedia.org/wiki/Canada", "passage_text": "Canada (/ˈkaenədə/) ˈkænədə is a, country consisting of ten provinces and three, territories in the northern part of the continent Of North. america Canada's long and complex relationship with the United States has had a significant impact on its economy and culture. Canada is a developed country and one of the wealthiest in the world, with the tenth highest nominal per capita income globally, and the eighth highest ranking in the Human Development Index."}, {"url": "http://www.answers.com/Q/What_is_Canada_considered", "passage_text": "Canada is considered a constitutional monarchy because Her Majesty the Queen of Canada is head of State. The Queen (represented by the Governor General) exercises executive fu … nctions only on the advice of the prime minister (the head of Government) and ministers, who are responsible to the House of Commons. Canada is not subject to the Queen of England. We Canadians are, however, loyal subjects of the Crown.   Her majesty Elizabeth II is the Queen of England, as far as … England is concerned. She is the Queen of Canada, as far as Canada is concerned.   Canada is an independent nation."}, {"url": "https://en.wikipedia.org/wiki/Poverty_in_Canada", "passage_text": "Some elements that work towards reducing poverty in Canada include Canada's strong economic growth, government transfers to persons of $164 billion per annum as of 2008, universal medical and public education systems, and minimum wage laws in each of the provinces and territories of Canada. Currently, an income inequality measure known as low income cut-off published by Statistics Canada is frequently used as a poverty rate and is 10.8% as of 2005. The Central Intelligence Agency uses the LICO as the relative measure results in a higher poverty figure than an absolute one."}, {"url": "http://www.answers.com/Q/What_is_Canada_considered", "passage_text": "Canada is considered a sovereign nation and has been a sovereign nation since 1867, 1931, or at the latest, 1982. Even though Canada as Queen Elizabeth II as it's monarch, it … is as Queen of Canada, and no longer as Queen of the UK. ------- The sovereignty of Canada has been debatable throughout it's history. Canada is not subject to the Queen of England. We Canadians are, however, loyal subjects of the Crown.   Her majesty Elizabeth II is the Queen of England, as far as … England is concerned. She is the Queen of Canada, as far as Canada is concerned.   Canada is an independent nation."}, {"url": "http://canadaonline.about.com/od/canadianlaw/g/ageofmajority.htm", "passage_text": "By Susan Munroe. Definition: The age of majority in Canada is the age at which a person is considered by law to be an adult. A person younger than the age of majority is considered a  minor child .. The age of majority in Canada is determined by each province and territory in Canada. The age of majority in the individual provinces and territories of Canada is. 1  Alberta - 18. 2  British Columbia - 19. 3  Manitoba - 18. 4  New Brunswick - 19."}, {"url": "https://en.wikipedia.org/wiki/Canada", "passage_text": "Canada is a federation composed of ten provinces and three territories. In turn, these may be grouped into four main regions: Western Canada, Central Canada, Atlantic Canada, and Northern Canada (Eastern Canada refers to Central Canada and Atlantic Canada together). Canada's long and complex relationship with the United States has had a significant impact on its economy and culture. Canada is a developed country and one of the wealthiest in the world, with the tenth highest nominal per capita income globally, and the eighth highest ranking in the Human Development Index."}]