[{"url": "http://www.myvmc.com/anatomy/acquired-immune-system-b-cells-and-t-cells/", "passage_text": "Lymphocytes. Lymphocytes are a type of white blood cell. There are two types of lymphocytes of the acquired immune system: T cells and B cells. There is a third type of lymphocyte known as natural killer (NK) cells, but these are a part of the innate immune system. Anything that the immune system can detect and attack is called an antigen. The activation of the acquired immune system initially requires the help of other cells. The cells of the acquired immune system are coated in receptors. These are highly specific molecules designed to recognise certain substances."}, {"url": "http://www.nationalmssociety.org/What-is-MS/Definition-of-MS", "passage_text": "Multiple sclerosis (MS) involves an immune-mediated process in which an abnormal response of the body’s immune system is directed against the central nervous system (CNS), which is made up of the brain, spinal cord and optic nerves. "}, {"url": "https://en.wikipedia.org/wiki/Immune_system", "passage_text": "The immune system is a system of many biological structures and processes within an organism that protects against disease. To function properly, an immune system must detect a wide variety of agents, known as pathogens, from viruses to parasitic worms, and distinguish them from the organism's own healthy tissue. Hypersensitivity is an immune response that damages the body's own tissues. They are divided into four classes (Type I – IV) based on the mechanisms involved and the time course of the hypersensitive reaction. Type I hypersensitivity is an immediate or anaphylactic reaction, often associated with allergy."}, {"url": "http://www.merckmanuals.com/home/immune-disorders/biology-of-the-immune-system/innate-immunity", "passage_text": "Cytokines. Cytokines are the messengers of the immune system. White blood cells and certain other cells of the immune system produce cytokines when an antigen is detected. There are many different cytokines, which affect different parts of the immune system: Some cytokines stimulate activity. "}, {"url": "http://www.biologyreference.com/Ho-La/Immune-Response.html", "passage_text": "Three groups of white blood cells are involved in starting an immune response. Although immune responses can occur anywhere in the body these cells are found, they primarily occur in the lymph nodes and spleen. Although all immune responses are similar, each time the body is invaded by a different antigen, the exact response is specific to that antigen. For example, infection with a virus that causes the common cold triggers a response by a different set of cells than infection with bacteria that causes strep throat."}, {"url": "http://umm.edu/health/medical/ency/articles/immune-response", "passage_text": "Lymphocytes are a type of white blood cell. There are B and T type lymphocytes. 1  B lymphocytes become cells that produce antibodies. 2  Antibodies attach to a specific antigen and make it easier for the immune cells to destroy the antigen. 3  T lymphocytes attack antigens directly and help control the immune response. 1"}, {"url": "http://www.biology.arizona.edu/immunology/tutorials/AIDS/response.html", "passage_text": "The immune system protects the body from invading disease-causing organisms, or pathogens. Pathogens and other non-self molecules are antigens  foreign molecules recognized by the immune system, stimulating an immune response. The majority of infections by pathogens occurs in mucous membranes of our body."}, {"url": "http://www.biologyreference.com/Ho-La/Immune-Response.html", "passage_text": "Molecules that start immune responses are called antigens. The body does not usually start an immune response against its own antigens because cells that recognize self-antigens are deleted or inactivated. This concept is called self-tolerance and is a key characteristic that defines immune responses. A second characteristic is specificity. Although all immune responses are similar, each time the body is invaded by a different antigen, the exact response is specific to that antigen. For example, infection with a virus that causes the common cold triggers a response by a different set of cells than infection with bacteria that causes strep throat."}, {"url": "https://www.rndsystems.com/research-area/cells-of-the-immune-system", "passage_text": "Cells of the Immune System. The response to pathogens is orchestrated by the complex interactions and activities of the large number of diverse cell types involved in the immune response."}, {"url": "https://en.wikipedia.org/wiki/Adaptive_immune_system", "passage_text": "B Cells are the major cells involved in the creation of antibodies that circulate in blood plasma and lymph, known as humoral immunity. Antibodies (also known as immunoglobulin, Ig), are large Y-shaped proteins used by the immune system to identify and neutralize foreign objects. Sometimes the adaptive system is unable to distinguish foreign molecules, the effects of this may be hayfever, asthma or any other allergies. Antigens are any substances that elicit the adaptive immune response. The cells that carry out the adaptive immune response are white blood cells known as lymphocytes."}]