[{"url": "https://vitalplan.com/ingredients/ashwagandha", "passage_text": "Ashwagandha is a calming herb that helps to normalize the entire HPA axis, providing a subtle balancing effect on all the systems of the body. Ashwagandha calms the hypothalamus (included in the HPA axis), which regulate important functions such as hormone levels, temperature, weight, and sleep cycles. Benefits of Ashwagandha. Ashwagandha is one of the most effective herbs for balancing hormones and reducing the detrimental effects of stress. Studies have shown, ashwagandha helps to: 1  Improve stress resistance. 2  Improve sleep quality and reduce fatigue."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-953-ASHWAGANDHA.aspx?activeIngredientId=953&activeIngredientName=ASHWAGANDHA", "passage_text": "The root has a strong aroma that is described as “horse-like.”. In Ayurvedic, Indian, and Unani medicine, ashwagandha is described as “Indian ginseng.” Ashwagandha is also used in traditional African medicine for a variety of ailments. Don’t confuse ashwagandha with Physalis alkekengi. Both are known as winter cherry. Ashwagandha is applied to the skin for treating wounds, backache, and one-sided paralysis (hemiplegia). The name Ashwagandha is from the Sanskrit language and is a combination of the word ashva, meaning horse, and gandha, meaning smell."}, {"url": "http://organicindiausa.com/organic-india-ashwagandha/", "passage_text": "Ashwagandha. Ashwagandha supports endurance, calm strength, and enduring vitality. Ashwagandha (Withania somnifera) is an adaptogenic herb, helping the body adapt to stress. It is a rejuvenating herb, helping to balance endocrine functions, including adrenal, thyroid and reproductive functions. We use only organically grown Ashwagandha root (Winter Cherry) in its pure, revitalizing form. It offers powerful nutritional support to rejuvenate both mind and body, by nourishing the nervous system, minimizing the negative effects of stress, increasing endurance and stamina and fighting insomnia."}, {"url": "http://www.nutraingredients-usa.com/Research/Research-elucidates-different-approaches-to-modern-ashwagandha-ingredients", "passage_text": "Ashwagandha is the subject of a monograph by the American Herbal Pharmacopoeia. According to the monograph, the herb has a history of use in ayurvedic medicine that dates back as much as 4,000 years to the teaching of renowned scholar Punarvasu Atreya, and in subsequent works that make up the ayurvedic tradition. Research elucidates different approaches to modern ashwagandha ingredients. By Hank Schultz Hank Schultz, 15-Apr-2013 2013-04-15T00:00:00Z. Last updated on 15-Apr-2013 at 20:21 GMT2013-04-15T20:21:54Z. Ashwagandha is native to semi-arid habitats in Africa and Asia."}, {"url": "https://www.mountainroseherbs.com/products/ashwagandha-root-powder/profile", "passage_text": "Ashwagandha is a small, shrub-like plant belonging to the nightshade family. It is closely related to the common tomato. The plant is native to India, Pakistan, and Sri Lanka, thriving in the semitropical environment of these regions. It produces small green flowers and round fruits that turn red when ripe. "}, {"url": "http://www.nutraingredients-usa.com/Research/Research-elucidates-different-approaches-to-modern-ashwagandha-ingredients", "passage_text": "“There are a host of studies on a variety of different ashwagandha preparations; root powder, root extract, leaf, leaf extract, root and leaf extract; water extract; ethanol-water extract; solvent extract; pure withanolides,” said Roy Upton, executive director of AHP. Research elucidates different approaches to modern ashwagandha ingredients. By Hank Schultz Hank Schultz, 15-Apr-2013 2013-04-15T00:00:00Z. Last updated on 15-Apr-2013 at 20:21 GMT2013-04-15T20:21:54Z. Ashwagandha is native to semi-arid habitats in Africa and Asia."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-953-ASHWAGANDHA.aspx?activeIngredientId=953&activeIngredientName=ASHWAGANDHA", "passage_text": "Ashwagandha is a plant. The root and berry are used to make medicine. Ashwagandha has a lot of uses. But so far, there isn’t enough information to judge whether it is effective for any of them. Ashwagandha is applied to the skin for treating wounds, backache, and one-sided paralysis (hemiplegia). The name Ashwagandha is from the Sanskrit language and is a combination of the word ashva, meaning horse, and gandha, meaning smell."}, {"url": "http://www.swansonvitamins.com/herb-pharm-ashwagandha-1-fz-1-fz", "passage_text": "Ingredients: Certified organic grain alcohol (62.72%), distilled water & ashwagandha extractives. Dry herb / mentruum ratio: 1:4. Prepared from the dry whole root of Withania somnifera plants which are Certified Organically Grown without the use of chemical fertilizers, pesticides or herbicides. Certified organically grown. Gluten free. Herb Pharm Ashwagandha is a liquid herbal extract prepared from the dry whole root of ashwagandha. Herb Pharm hand harvests their ashwagandha only in the autumn in order to assure optimal extraction of ashwagandha's bioactive compounds."}, {"url": "http://www.znaturalfoods.com/Ashwagandha-Root-Powder-Organic", "passage_text": "Ashwagandha Root is a variety of Nightshade (Solanaceae) which is the common name used to describe a diverse group of over 2,700 species of plants including fruits, vegetables, herbs, medicinals, shrubs, vines, and trees that contain a toxic alkaloid called Atropine. ZNaturalFoods.com offers Raw Organic Ashwagandha Root Powder packaged in airtight stand-up, resealable foil pouches for optimum freshness. Once opened, just push the air out of the pouch before resealing it in order to preserve maximum potency."}]