[{"url": "http://www.wisegeek.com/what-does-misanthropy-mean.htm", "passage_text": "10 most extreme places on Earth. The word misanthropy is derived from the Greek words meaning “hatred” and “man” or “human being.” It is a hatred or contempt for the human species or human nature. It may also refer to a generalized distrust or dislike of people."}, {"url": "http://www.merriam-webster.com/dictionary/misanthropic", "passage_text": "Definition of MISANTHROPIC. 1. : of, relating to, or characteristic of a misanthrope. 2. : marked by a hatred or contempt for humankind."}, {"url": "http://www.definitions.net/definition/misanthropy", "passage_text": "Misanthropy. Misanthropy is the general hatred, mistrust or disdain of the human species or human nature. A misanthrope, or misanthropist is someone who holds such view or feeling. The word's origin is from Greek words μῖσος and ἄνθρωπος. The condition is often confused with asociality."}, {"url": "http://www.merriam-webster.com/dictionary/misanthrope", "passage_text": "Full Definition of MISANTHROPE. : a person who hates or distrusts humankind. See misanthrope defined for English-language learners. See misanthrope defined for kids."}, {"url": "http://www.definitions.net/definition/misanthrope", "passage_text": "Misanthrope is a French metal band, formed in 1988. The name of the band is taken from Moliere'molière s Play Le, misanthrope reflecting the'band s very theatrical style and the influence of The french dramatist on their music and. lyrics"}, {"url": "http://www.wisegeek.com/what-does-misanthropy-mean.htm", "passage_text": "The word misanthropy is derived from the Greek words meaning “hatred” and “man” or “human being.” It is a hatred or contempt for the human species or human nature. It may also refer to a generalized distrust or dislike of people."}, {"url": "http://www.merriam-webster.com/dictionary/misanthrope", "passage_text": "1 Many members of the contemporary movie audience, only marginally socialized, would have made a misanthrope of Gandhi; they undermine every argument for intelligent design in the universe."}, {"url": "http://www.definitions.net/definition/misanthropy", "passage_text": "Misanthropy is the general hatred, mistrust or disdain of the human species or human nature. A misanthrope, or misanthropist is someone who holds such view or feeling. The word's origin is from Greek words μῖσος and ἄνθρωπος. The condition is often confused with asociality."}]