[{"url": "http://bio.rutgers.edu/~gb102/lab_6/605am-nervous.html", "passage_text": "The basic unit of structure of nervous tissue is the neuron, consisting of a nerve cell body and several processes: dendrites, which carry impulses toward the nerve cell body, and axons, which carry impulses away from the cell body."}, {"url": "https://faculty.washington.edu/chudler/cells.html", "passage_text": "1 Neurons have specialize cell parts called dendrites and axons. 2  Dendrites bring electrical signals to the cell body and axons take information away from the cell body. 3  Neurons communicate with each other through an electrochemical process."}, {"url": "http://kentsimmons.uwinnipeg.ca/cm1504/15lab42006/lb4pg8.htm", "passage_text": "Each neuron is composed of a cell body containing a nucleus and one or more long cytoplasmic extensions known as fibres. Highly branched fibres, called dendrites, bring impulses toward the cell body, while a single, unbranched fibre, the axon, carries information away from the cell body (Figure 17)."}, {"url": "http://leavingbio.net/THE%20NERVOUS%20SYSTEM_files/THE%20NERVOUS%20SYSTEM.htm", "passage_text": "B. DENDRITES-Short branch extensions spreading out from the cell body. Dendrites Receive STIMULUS (Action Potentials) and carry IMPULSES from the ENVIRONMENT or from other NEURONS AND CARRY THEM TOWARD THE CELL BODY. C. AXON-A Long Fibre that CARRIES IMPULSES AWAY FROM THE CELL BODY. Each neuron has only ONE AXON. The Axon Ends in a series of small swellings called AXON TERMINALS."}, {"url": "https://faculty.washington.edu/chudler/cells.html", "passage_text": "1 Dendrites bring electrical signals to the cell body and axons take information away from the cell body. 2  Neurons communicate with each other through an electrochemical process. 3  Neurons contain some specialized structures (for example, synapses) and chemicals (for example, neurotransmitters)."}, {"url": "http://biology.about.com/od/humananatomybiology/ss/neurons.htm", "passage_text": "It is at the synapse where chemical or electrical impulses must cross the gap and be carried to the dendrites of adjacent cells. At electrical synapses, ions and other molecules pass through gap junctions allowing for the passive transmission of electrical signals from one cell to the other."}, {"url": "http://www.fallriverschools.org/JPacheco/Neurons%20%26%20Nerve%20Impulses2.pdf", "passage_text": "Neurons • Neurons –cells that transmit nerve impulses•3 Types of Neurons –Sensory neurons carry impulses from sense organs to the spinal cord and brain–Motor neurons carry impulses from the brain and spinal cord to muscles and glands–Interneurons connect sensory and motor neurons and carry impulses between them."}, {"url": "https://faculty.washington.edu/chudler/cells.html", "passage_text": "However, neurons differ from other cells in the body because: 1  Neurons have specialize cell parts called dendrites and axons. 2  Dendrites bring electrical signals to the cell body and axons take information away from the cell body."}]