[{"url": "http://psychology.wikia.com/wiki/Proposition", "passage_text": "Proposition is a term used in logic to describe the content of assertions. Assertions are non-linguistic abstractions from sentences and can be evaluated as either true or false. The nature of propositions is highly controversial amongst philosophers, many of whom are skeptical about the existence of propositions. The sentence A and B expresses both proposition A and proposition B. Both of these uses treat a proposition simply as a sentence (albeit of a certain kind). This usage is increasingly non-standard, and will not be used in the rest of this article."}, {"url": "http://www.merriam-webster.com/dictionary/proposition", "passage_text": "Full Definition of PROPOSITION. 1. a (1) : something offered for consideration or acceptance: proposal (2) : a request for sexual intercourse b: the point to be discussed or maintained in argument usually stated in sentence form near the outset c: a theorem or problem to be demonstrated or performed. 2. : something (such as a plan or offer) that is presented to a person or group of people to consider. : a statement to be proved, explained, or discussed. : something that someone intends to do or deal with."}, {"url": "http://psychology.wikia.com/wiki/Proposition", "passage_text": "Hence they express the same proposition. Two different sentences in the same language may also express the same proposition. For example, Tiny crystals of frozen water precipitation are white is in English, but is said to be the same proposition as snow is white by virtue of the definition of snow. The sentence A and B expresses both proposition A and proposition B. Both of these uses treat a proposition simply as a sentence (albeit of a certain kind). This usage is increasingly non-standard, and will not be used in the rest of this article."}, {"url": "http://psychologydictionary.org/proposition/", "passage_text": "In the field of philosophy, a proposition is anything that is either asserted or denied and is capable of being true or false. For example, The left box is heavier than the right. PROPOSITION: The proposition was that John could score higher on the IQ test than Emanuel.. No related posts. "}, {"url": "http://www.answers.com/Q/What_is_a_theoretical_proposition", "passage_text": "A proposition of law is a law that is proposed to the government or  the electorate. Because it is a proposition, it is not valid until  it is passed by government and becom … es an actual official law. Nicola. 429,998 Contributions. M.A. in English Language and a lover of books. "}, {"url": "http://grammar.about.com/od/pq/g/Proposition.htm", "passage_text": "Examples and Observations.  1 An argument is any group of propositions where one proposition is claimed to follow from the others, and where the others are treated as furnishing grounds or support for the truth of the one. 2  An argument is not a mere collection of propositions, but a group with a particular, rather formal, structure. . . . "}, {"url": "https://en.wikipedia.org/wiki/Proposition", "passage_text": "A proposition is then a string with a specific form. The form that a proposition takes depends on the type of logic. The type of logic called propositional, sentential, or statement logic includes only operators and propositional constants as symbols in its language. An Aristotelian proposition may take the form All men are mortal or Socrates is a man.. In the first example the subject is All men and the predicate are mortal.. In the second example the subject is Socrates and the predicate i"}, {"url": "http://psychology.wikia.com/wiki/Proposition", "passage_text": "Often propositions are related to closed sentences, to distinguish them from what is expressed by an open sentence, or predicate. In this sense, propositions are statements that are either true or false. This conception of a proposition was supported by the philosophical school of logical positivism. Some philosophers, such as John Searle, hold that other kinds of speech or actions also assert propositions. The sentence A and B expresses both proposition A and proposition B. Both of these uses treat a proposition simply as a sentence (albeit of a certain kind). This usage is increasingly non-standard, and will not be used in the rest of this article."}, {"url": "http://plato.stanford.edu/entries/propositions/", "passage_text": "The term ‘proposition’ has a broad use in contemporary philosophy. It is used to refer to some or all of the following: the primary bearers of truth-value, the objects of belief and other “propositional attitudes” (i.e., what is believed, doubted, etc.), the referents of that-clauses, and the meanings of sentences. "}, {"url": "http://psychology.wikia.com/wiki/Analytic_proposition", "passage_text": "Loosely defined, an analytic proposition is a proposition the negation of which is self-contradictory, or a proposition that is true in every conceivable world, or a proposition that is true by definition. But an equally obvious 'If A, then A' is not analytic since it is not framed in the subject-predicate form. As a result, the definition of analytic proposition was expanded to include statements that are not in"}]