[{"url": "http://www.rightdiagnosis.com/symptoms/hiccups/common.htm", "passage_text": "Introduction: This information shows the various causes of Hiccups, and how common these diseases or conditions are in the general population. This is not a direct indication as to how commonly these diseases are the actual cause of Hiccups, but gives a relative idea as to how frequent these diseases are seen overall."}, {"url": "http://www.coliccalm.com/baby_infant_newborn_articles/hiccups.htm", "passage_text": "They are caused by sudden contractions of the diaphragm triggered by irritation or stimulation of that muscle. Some leading pediatricians are of the opinion that infant hiccups are usually caused by feeding (breast, formula or other foods) or by a drop in temperature that causes the baby to get cold. "}, {"url": "http://www.healthline.com/symptom/hiccups", "passage_text": "Hiccups are repetitive, uncontrollable contractions of the diaphragm muscle. Your diaphragm is the muscle just below your lungs. It marks the boundary between your chest and abdomen. The diaphragm regulates breathing. When your diaphragm contracts, your lungs take in oxygen. When your diaphragm relaxes, your lungs release carbon dioxide. The diaphragm contracting out of rhythm causes hiccups. Each spasm of the diaphragm makes the larynx and vocal cords close suddenly. This results in a sudden rush of air into the lungs. Your body reacts with a gasp or chirp, creating the sound characteristic of hiccups"}, {"url": "http://www.webmd.com/digestive-disorders/tc/hiccups-topic-overview", "passage_text": "Hiccups occur when a spasm contracts the diaphragm, a large sheet of muscle that separates the chest cavity from the abdominal cavity. This spasm causes an intake of breath that is suddenly stopped by the closure of the vocal cords (glottis). A full stomach can be caused by: 1  Eating too much food too quickly. 2  Drinking too much alcohol. 3  Swallowing too much air. 4  Smoking. 5  A sudden change in stomach temperature, such as drinking a hot beverage and then a cold beverage."}, {"url": "http://www.emedicinehealth.com/hiccups/article_em.htm", "passage_text": "Hiccups are sudden, involuntary contractions of the diaphragm muscle. As the muscle contracts repeatedly, the opening between the vocal cords snaps shut to check the inflow of air and makes the hiccup sound. Irritation of the nerves that extend from the neck to the chest can cause hiccups. "}, {"url": "http://www.webmd.com/digestive-disorders/tc/hiccups-topic-overview", "passage_text": "A very full stomach can cause bouts of hiccups that go away on their own. A full stomach can be caused by: 1  Eating too much food too quickly. 2  Drinking too much alcohol. 3  Swallowing too much air. 4  Smoking. 5  A sudden change in stomach temperature, such as drinking a hot beverage and then a cold beverage."}, {"url": "http://www.mayoclinic.org/diseases-conditions/hiccups/basics/causes/CON-20031471", "passage_text": "Nerve damage or irritation. The most common cause of long-term hiccups is damage to or irritation of the vagus nerves or phrenic nerves, which serve the diaphragm muscle.Factors that may cause damage or irritation to these nerves include: 1  A hair or something else in your ear touching your eardrum. 2  A tumor, cyst or goiter in your neck. The most common triggers for hiccups that last less than 48 hours include: 1  Drinking carbonated beverages. 2  Drinking too much alcohol. 3  Eating too much. 4  Excitement or emotional stress. 5  Sudden temperature changes."}, {"url": "http://www.mayoclinic.org/diseases-conditions/hiccups/basics/risk-factors/CON-20031471", "passage_text": "Men are much more likely to develop long-term hiccups than are women. Other factors that may increase your risk of hiccups include: 1  Mental or emotional issues. 2  Anxiety, stress and excitement have been associated with some cases of short-term and long-term hiccups. "}, {"url": "http://www.nhs.uk/Conditions/Hiccup/Pages/Causes.aspx", "passage_text": "Causes of hiccups. Hiccups occur when your diaphragm (the thin layer of muscle that separates your chest cavity from your abdomen) suddenly and involuntarily contracts (tightens). As your diaphragm contracts, it causes you to breathe air in very quickly. The incoming air is stopped when your glottis (the opening between your vocal cords) closes suddenly, producing the characteristic sound of a hiccup."}]