[{"url": "http://bbq.about.com/cs/ribs/a/aa092797.htm", "passage_text": "Place the ribs in the smoker and let it go. A good smoking temperature in the area of 200 degrees. You can go lower if you plan on doing a long smoke, but I don't recommend going higher. At this rate the ribs should be cooked through and tender after 4 hours. Go longer if you can. The longer you smoke at a low temperature the more tender and flavorful the ribs will be. Remember that you need to hit an internal temperature of 165oF before they can be served"}, {"url": "https://answers.yahoo.com/question/index?qid=20061018180339AAOXju4", "passage_text": "Report Abuse. To cook spare ribs in the oven is by setting your oven temperature to about 375 F, cooking for at least an hour. You'll have to keep an eye every 10 min, flipping them over"}, {"url": "http://www.cookingforengineers.com/recipe/45/Oven-Baked-Spare-Ribs-Two-Ways", "passage_text": "Usually this dish is made on a stovetop with spare ribs cut into small pieces. This recipe will work for both whole ribs and for cut ribs, but I prefer the whole ribs. In a mixing bowl, combine 1 cup (245 mL) soy sauce, 1 cup (220 g) brown sugar, 1 cup (245 mL) sherry, 1 tsp. (2.3 g) ground cinnamon, and 1 tsp. For pork ribs that literally fall off the bone, I use an oven to slowly cook the ribs. The recipe is quite simple: mix 18 oz. of barbeque sauce (1 bottle) with 1/2 cup (120 mL) orange juice. Pour into a 9x13-in pan. Place ribs in pan and flip using tongs so ribs are coated"}, {"url": "http://www.mcraigweaver.com/recipes/ribs.stm", "passage_text": "The trick to great ribs is to cook them very slowly with the BBQ sauce on them. You can do this in an oven, just set the temperature to 225° F (about 107° C). I occasionally use an electric smoker, which cooks at about 200 to 225 degrees Fahrenheit. I've also used this method on my gas grill and in my oven. Cook the ribs for 4½ to 5 hours. The time it takes you to cook the ribs may vary depending on the true temperature of your grill, oven, or smoker, the temperature of the ribs when you start, and other factors"}, {"url": "https://answers.yahoo.com/question/index?qid=20080604120648AA6xlo1", "passage_text": "Best Answer: Roasted ribs need at least 90 minutes... 350F for a minimum of 90 minutes. Add BBQ sauce the last 15 minutes... If you really want to speed it up... 425F, wrap in foil and bake for 1 hour. Unwrap, add sauce and bake for 10 to 15 minutes at 350. I'm very hesitant to recommend boiling/parboiling. It goes against what I believe"}, {"url": "http://www.foodnetwork.com/recipes/barbeque-pork-spare-ribs-recipe.html", "passage_text": "Begin basting ribs with sauce in the final 10 minutes of grill time (after about 1 1/2 hours). Any earlier and the sauce will simply dry out. Note: The USDA states that pork should be cooked to an internal temperature of 160 degrees F. "}, {"url": "http://www.thekitchn.com/how-to-make-great-ribs-in-the-oven-cooking-lessons-from-the-kitchn-96973", "passage_text": "Broil the ribs for about 5 minutes, until the sugar in the dry rub is bubbling and the ribs are evenly browned. Bake the ribs: Set the oven to 300°F. Move the ribs to an oven rack in the middle of the oven. Roast for 2 1/2 to 3 hours for spare ribs or 1 1/2 to 2 hours for baby back ribs. Halfway through cooking, cover the ribs with aluminum foil to protect them from drying out."}, {"url": "http://amazingribs.com/tips_and_technique/are_they_ready.html", "passage_text": "According to USDA, ribs are done when they are 145°F internal temp, but they may still be tough. If you take them up to 180°F, drop the oven temp to about 180°F and hold them at this temp for about 30 minutes, the collagens and fats melt some more at this temp and make the meat more tender and juicy. At higher cooking temperatures decrease the cooking time. For example, at 325°F, baby backs can be done in only 90 minutes, but there will be shrinkage and they will be tougher. At higher altitudes, increase the cooking time 20% or more."}]