[{"url": "http://doctorsgates.blogspot.com/2010/12/squamous-blepharitis.html", "passage_text": "Squamous Blepharitis. Defined as Low grade infection on top of abnormal secretions of the lid glands ,a kind of nonulcerative blepharitis .As a Part of a dermatologic condition that includes the scalp, face, and eyebrows; So it also called Seborrheic Blepharitis. "}, {"url": "https://en.wikipedia.org/wiki/Blepharitis", "passage_text": "Blepharitis (/blɛfərˈaɪtɨs/ BLEF-ər-EYE-tis) is a common eye condition characterized by often chronic inflammation of the eyelid, generally the part where eyelashes grow. Blepharitis is characterized by often chronic inflammation of the eyelid, generally the part where eyelashes grow. Blepharitis generally presents when very small oil glands near the base of the eyelashes don't function properly. This results in inflamed, irritated, itchy, and reddened eyelids"}, {"url": "http://www.medicinenet.com/blepharitis/article.htm", "passage_text": "Signs of inflammation are swelling, redness, pain, warmth, and change in function. Blepharitis is an inflammation of the eyelids, causing red, irritated, itchy eyelids and the formation of dandruff-like scales on the eyelashes. It is a common eye disorder with a wide variety of causes. It affects people of all ages. Blepharitis is the medical term for inflammation of the eyelids. The word blepharitis is derived from the Greek word blepharos, which means eyelid, and the Greek suffix itis, which is typically used in English to denote an inflammation."}, {"url": "http://www.medicinenet.com/blepharitis/article.htm", "passage_text": "Blepharitis is an inflammation of the eyelids, causing red, irritated, itchy eyelids and the formation of dandruff-like scales on the eyelashes. It is a common eye disorder with a wide variety of causes. Blepharitis is the medical term for inflammation of the eyelids. The word blepharitis is derived from the Greek word blepharos, which means eyelid, and the Greek suffix itis, which is typically used in English to denote an inflammation."}, {"url": "http://www.rightdiagnosis.com/medical/squamous_blepharitis.htm", "passage_text": "These medical condition or symptom topics may be relevant to medical information for Squamous blepharitis: 1  Squamous. 2  Blepharitis (15 causes). "}, {"url": "http://www.mayoclinic.org/diseases-conditions/blepharitis/basics/causes/CON-20024605", "passage_text": "The exact cause of blepharitis isn't clear. It may be associated with one or more factors, including: 1  Seborrheic dermatitis — dandruff of the scalp and eyebrows. 2  A bacterial infection. 3  Clogged or malfunctioning oil glands in your eyelids. 4  Rosacea — a skin condition characterized by facial redness."}, {"url": "http://medical-dictionary.thefreedictionary.com/squamous+blepharitis", "passage_text": "nonulcerative blepharitis (squamous blepharitis) that in which the edge of the eyelid is covered with small white or gray scales. ulcerative blepharitis that marked by small ulcerated areas along the eyelid margin, multiple suppurative lesions, and loss of lashes. inflammation of the glands and lash follicles along the margin of the eyelids; symptoms include itching, burning, photophobia, mucous discharge, crusted eyelids, and loss of eyelashes."}, {"url": "http://medical-dictionary.thefreedictionary.com/squamous+blepharitis", "passage_text": "[ blef″ah-ri´tis ]. inflammation of the glands and lash follicles along the margin of the eyelids; symptoms include itching, burning, photophobia, mucous discharge, crusted eyelids, and loss of eyelashes. Warm saline compresses may be used to soften secretions, and the eyelids are cleansed thoroughly"}, {"url": "http://medical-dictionary.thefreedictionary.com/squamous+blepharitis", "passage_text": "blepharitis. inflammation of the glands and lash follicles along the margin of the eyelids; symptoms include itching, burning, photophobia, mucous discharge, crusted eyelids, and loss of eyelashes. Warm saline compresses may be used to soften secretions, and the eyelids are cleansed thoroughly"}]