[{"url": "http://www.ehow.com/how_6541691_write-numbers-expanded-form.html", "passage_text": "Instructions. Write a number in expanded form using both numbers and words. For example, write 23,851 as 2 ten thousands, 3 thousands, 8 hundreds, 5 tens and 1 one.. This illustrates what place value each numeral holds within the number. Express the number in expanded form using numbers. Using the same number, you would write 20,000 + 3,000 + 800 + 50 + 1.. Add decimal numbers to a number and express them in expanded form also. The place value of numbers is crucial to students' understanding of mathematical principles. When students learn the place value of any number, they can go on to solve equations with numbers. Learning to write numbers in expanded form is an exercise that illustrates and teaches place value to students."}, {"url": "http://study.com/academy/lesson/what-is-expanded-form-in-math-definition-examples.html", "passage_text": "Expanded Form. According to our work above, when we write the number 521, what the number really means is that we have the total of 500 + 20 + 1. We've expanded the number to show the value of each of its digits. When we expand a number to show the value of each digit, we're writing that number in expanded form. Let's try it with a different, bigger number: 1,234,567. We'll start by placing the number's digits in the place value chart. Now, let's use the chart to determine the value of each digit."}, {"url": "https://answers.yahoo.com/question/index?qid=20080721181609AAyeKbV", "passage_text": "Answers. Relevance. Rating Newest Oldest. Best Answer: Expanded form is a way of writing numbers so that all that is hidden about them comes out into the open. The simplest way to write numbers in expanded form is to write them sort of in English. For 4,017, this becomes 4 thousands and 0 hundreds and 1 ten and 7 ones. "}, {"url": "http://www.icoachmath.com/math_dictionary/expanded_form.html", "passage_text": "Expanded Form is a way to break up a number to show how much each digit in the number represents. In other words, expanded form is the method of pulling a number apart and expressing it as a sum of the values of each digit. The best way to identify the expanded form of a number is to simply write the number in words."}, {"url": "http://www.youtube.com/watch?v=4AF7xj7pmWc", "passage_text": "This video teaches expanded form to kids and how each digit has a different value. This math concept takes place value into action by spreading the numbers out. Kids in 1st and 2nd grade will love the video as it teaches expanded form in a fun visual way. "}, {"url": "http://www.aaamath.com/g4_31dpx.htm", "passage_text": "Each digit of a number, such as 495,786, has a different place value name. There are 4 sets of one hundred thousand, 9 sets of ten thousand, 5 sets of one thousand, 7 sets of one hundred, 8 sets of ten, and 6 ones in the number 495,786. "}, {"url": "http://www.studyzone.org/testprep/math4/d/expandedform4l.cfm", "passage_text": "Expanded Form is a way to write numbers by adding the value of its digits. Example: 1,000 + 900 + 50 + 4 = 1,954. Example 1: Write and Read the number 6,174. "}, {"url": "http://www.math-only-math.com/expanded-form-of-a-number.html", "passage_text": "Expanded form of a Number. In expanded form of a number, the number is shown according to the place values of its digits. This is shown here: In 2385, the place values of the digits are given below: Hence, 2385 = 2000 + 300 + 80 + 5. Thus, 2000 + 300 + 80 + 5 is the expanded form of 2385. For example: 1. Find the expanded form of 453169."}, {"url": "http://www.mathatube.com/writing-num-expanded-form.html", "passage_text": "Writing Numbers in Expanded Form. Numbers could be written in three ways, standard form, word form (written form), and expanded form.The expanded form of a number is the sum of its various place values.Example1: The number 369 written in expanded form is 300+60+9. Below is the number 425 written in all three forms. "}, {"url": "http://www.calculatorsoup.com/calculators/math/expanded-form-calculator.php", "passage_text": "Expanded form is the representation of a number with factors, exponents or words and separated into individual place values and decimal places that can form a mathematical expression. 1,325 in expanded form is 1,000 + 300 + 20 + 5. Enter a number to have it expanded to numbers form, factors form, exponential form, and word form. Cite this content, page or calculator as: Furey, Edward  Expanded Form Calculator  From http://www.CalculatorSoup.com-Online Calculator Resource."}]