[{"url": "http://www.c2c-online.co.uk/assistance/faqs/refunds/", "passage_text": "The refund calculation will be the difference between the price you paid and the cost of a ticket or tickets for the period for which you have actually used the ticket, plus an administration charge. Season ticket refunds can take up to 28 days and will be refunded to the method of payment used for original purchase. If payment was originally made by Company cheque, we will require a letter from. that employer confirming they authorise the refund to be paid to the customer directly."}, {"url": "http://www.londontravelwatch.org.uk/faqs/rail/can_i_get_a_refund_on_my_railway_season_ticket__", "passage_text": "If you hand in your ticket early, you will not get a pro-rata refund on an annual season ticket. Annual season tickets are sold at a discount (about 25%) compared to the equivalent number of weekly tickets."}, {"url": "https://tfl.gov.uk/fares-and-payments/replacements-and-refunds/oyster-refunds-and-replacements", "passage_text": "Find out about service delay refunds. Refunds for overlapping tickets on your Oyster card. If you bought a Travelcard or Bus & Tram Pass season ticket with the same zones and overlapping days of validity to another ticket on your Oyster card, we will consider giving you a refund for the value of the overlapping days."}, {"url": "http://www.thameslinkrailway.com/contact-us/frequently-asked-questions/tickets-faqs/", "passage_text": "Can I get a refund on my season ticket? If you no longer need your season ticket and there is: three months remaining on an annual, seven days on a monthly or three days on a weekly then you can get a refund from one of our ticket offices."}, {"url": "http://www.nationalrail.co.uk/times_fares/ticket_types/46571.aspx", "passage_text": "1 Any refund is calculated from the date the Season Ticket was handed in. 2  It will be the difference between the price you paid and the cost of a ticket or tickets for the period for which you have actually used the ticket, plus an administration charge."}, {"url": "http://www.londonmidland.com/tickets-and-fares/more/refunds/", "passage_text": "If you no longer need your season ticket, you can apply for a refund as long as it still has at least 7 days’ validity remaining (or 3 days for 7-day season tickets). The refund is calculated from the date we receive the ticket."}, {"url": "http://www.southernrailway.com/tickets-and-fares/refunds/season-ticket-refunds/", "passage_text": "Any refund is calculated from the date the Season ticket was handed in. The refund will be the difference between the price you paid and the cost of a ticket or tickets required for the period for which you have actually used (or held) the ticket, plus an administration charge."}]