[{"url": "http://www.top100arena.com/news/619/top-10-biggest-rainforests-in-the-world", "passage_text": "Above all the rainforests sits the Amazon Rainforest, which is the largest in the world at nearly 1.5 billion acres. This forest spans nine different countries and is home to tens of thousands of plant species, thousands of animal species, and over 2.5 million insect species. The Congo river of Africa is the second largest river in the world, and is surrounded by the world's second largest rainforest-the Congo Rainforest."}, {"url": "http://www.answers.com/Q/Which_countries_are_the_three_biggest_rainforests_found_in", "passage_text": "Split and merge into it. Answered by The Community. Making the world better, one answer at a time. The three largest rainforests on earth are found in Brazil (the Amazon rainforest), Africa (the Congo Basin), and Asia (various tracts of undisturbed rainforest). Which in three is the biggest country in Europe Germany France UK? Russia is the country with the biggest European territory, 3 960 000 km2 Ukraine is the biggest wholly European country, 603 700 km2 France is the biggest country in the Eur … opean Union, 547 030 km2 Then come Spain and Sweden in size."}, {"url": "http://kids.mongabay.com/elementary/002.html", "passage_text": "Rainforests are found in the tropics, the region between the Tropic of Cancer and the Tropic of Capricorn, just above and below the Equator. In this tropic zone the sun is very strong and shines about the same amount of time every day all year long, keeping the climate warm and relatively stable. "}, {"url": "http://www.top100arena.com/news/619/top-10-biggest-rainforests-in-the-world", "passage_text": "Though it's not the largest rainforest in the world, the Daintree is often regarded as one of the most spectacular of all rainforests, with a treeline that grows up to the edge of the ocean, with hundreds of ancient species, including ancient conifer trees that tower dozens of meters into the air. The Congo river of Africa is the second largest river in the world, and is surrounded by the world's second largest rainforest-the Congo Rainforest."}, {"url": "https://en.wikipedia.org/wiki/Rainforest", "passage_text": "There are two types of rainforest: tropical rainforest and temperate rainforest. The monsoon trough, alternatively known as the intertropical convergence zone, plays a significant role in creating the climatic conditions necessary for the Earth 's tropical rainforests. The undergrowth in some areas of a rainforest can be restricted by poor penetration of sunlight to ground level. If the leaf canopy is destroyed or thinned, the ground beneath is soon colonized by a dense, tangled growth of vines, shrubs and small trees, called a jungle."}, {"url": "http://www.answers.com/Q/What_are_the_3_biggest_threats_to_rainforests", "passage_text": "Threats to rainforest ecosystemsAs we have seen previously, rainforests are subjected to a range of natural disturbances, mainly due to cyclones and storm damage, but also drought, fire and volcanic eruptions are other natural processes that effect rainforest ecology. Basically humans are the biggest threat. ---------------------------------------------------------------------------------------------------- Extended Periods of Drought is a serious threat to rainforests today. 8 people found this useful."}, {"url": "http://www.smashinglists.com/biggest-rainforests/", "passage_text": "10 Biggest Rainforests in the World. While we are on the subject of gardens, I thought of compiling a list that talks about ‘gardens’, basically plants, on a whole other level. Now, a garden is a place where you can spend some quality time with your family and friends, but these rainforests are no joke. "}, {"url": "http://rainforests.mongabay.com/", "passage_text": "The world's largest rainforest is the Amazon rainforest Brazil has the largest extent of rainforest cover Rainforests also exist outside the tropics, including temperate North America, South America, Australia, and Russia. 1 Rainfall: rainforests receive at least 80 inches (200 cm) of rain per year. 2  Canopy: rainforests have a canopy, which is the layer of branches and leaves formed by closely spaced rainforest trees some 30 meters (100 feet) off the ground. 3  A large proportion of the plants and animals in the rainforest live in the canopy."}]