[{"url": "http://www.enotes.com/homework-help/what-advantages-did-north-have-over-south-us--399010", "passage_text": "(Answer #2). The North held immense advantages over South in the Civil War with the exception of leadership until Ulysses S.Grant took control of the Army of the Potomac. "}, {"url": "http://study.com/academy/lesson/civil-war-begins-northern-and-southern-advantages-compared.html", "passage_text": "At the outbreak of the American Civil War, both the North and South believed the conflict would be over quickly. But advantages for both the Confederacy and the Union meant a prolonged war between the states. In this lesson, discover some of the advantages that the North and South had. "}, {"url": "http://classroom.synonym.com/advantages-sides-before-during-civil-war-20226.html", "passage_text": "Industrial Disparities. Industrialization was one of the major differences between the North and the South in the years before and during the Civil War. At the beginning of the Civil War, the South had only one-ninth the industrial capacity of the North. Before and during the Civil War, approximately seven out of every eight immigrants settled in the Northern states. By 1860, the North's population totaled approximately 23 million, while the South's was at just 9 million."}, {"url": "http://taswarslh7.weebly.com/advantages-and-disadvantages.html", "passage_text": "Even though they have many advantages in the Civil War, the Confederates also have some disadvantages. First, instead of using a machines to do make their weapons, railroad tracks and other supplies, they used old fashioned things. It took longer for them to get their resources since they had to make them themselves. However, the North had many railroad tracks and got their supplies faster than the Confederates. Thirdly, their population was small; there was 9 million Confederates and 22 million Northerners. This was caused by the enslaved people (1/3 of population) and how they could not be part in the war."}, {"url": "http://www.answers.com/Q/What_advantages_did_the_South_and_North_have_in_the_US_Civil_War", "passage_text": "The main advantage of the North was that they had more supplies  because they had factories.   The main advantage of the South was that they had excellent  military gene … rals as a result of the strong tradition of military  schools. 1 The North had a larger population which translated into the ability to field a larger army. 2  However, while many men (and boys) eagerly went to enlist during the opening months of the Civil War, they lacked the experience needed to fight a war and time had to be taken to properly train the troops."}, {"url": "http://www2.lhric.org/pocantico/civilwar/north&south.htm", "passage_text": "Money came from plantation crops, like cotton, rice, sugar cane and tobacco. Slaves did most of the work on the plantations. During the Civil War the North and the South had some advantages that were helpful to their part of the country. The North produced three-fourths of the nation's wealth. They had a bigger army including thousands of black soldiers. The North also had better equipment and supplies to fight the war. "}, {"url": "http://www.civilwar.org/resources/confederate-states-had-many.html", "passage_text": "Though it certainly seems easy to suggest that the north was destined to win the Civil War at its outset, and the Union was certainly inclined to believe a short victory was at hand, the South had several advantages that it would bring to bear. "}, {"url": "http://www.answers.com/Q/What_advantage_did_the_South_have_over_the_North_during_the_Civil_War", "passage_text": "A Slightly Different Opinion: While the South did not have the major factories of the North, it did have some manufacturing, especially Alabama and North Carolina. At the beginning of the Civil War, North Carolina had 2,000 independent forges producing products from iron ore. 1 The South had better soldiers at the beginning. 2  At the onset of the war, the North was not prepared to fight a war. 3  Military readiness of soldiers at the beginning of the war was superior in the South. 4  Young men were accustomed to outdoor life, guns and horses that were part of rural lif"}, {"url": "http://taswarslh7.weebly.com/advantages-and-disadvantages.html", "passage_text": "Union Advantages. The Union had many advantages in the Civil War. First they had a bigger population which was 22 million people over 9 million people. Since their population was bigger, they had more workers which was 1.3 million industrial workers over 110,000 industrial workers. However, the North had many railroad tracks and got their supplies faster than the Confederates. Thirdly, their population was small; there was 9 million Confederates and 22 million Northerners. This was caused by the enslaved people (1/3 of population) and how they could not be part in the war."}]