[{"url": "http://www.ehow.com/about_5622007_asphalt-vs_-concrete-price.html", "passage_text": "Comparisons. In terms of initial cost, asphalt is a cheaper surface to use than concrete but the maintenance involved raises the overall cost. Asphalt roads and driveways can last for anywhere from 10 to 30 years if well-maintained. Concrete roads and driveways can last for 20 to 60 years if maintained properly. The bigger the asphalt or concrete project, the more it is going to cost in the long run. Longer stretches of road or driveways require more material, more equipment and more manpower to complete. Driveways or stretches of road that are in remote, rural areas cost more to get maintenance to."}, {"url": "http://www.ehow.com/about_5622007_asphalt-vs_-concrete-price.html", "passage_text": "Concrete on the other hand, is one of the more expensive materials used to pave roads and driveways with. Concrete can cost between $3 to $10 per square foot installed. Asphalt can cost anywhere from $1 to $5 per square foot installed. The bigger the asphalt or concrete project, the more it is going to cost in the long run. Longer stretches of road or driveways require more material, more equipment and more manpower to complete. Driveways or stretches of road that are in remote, rural areas cost more to get maintenance to."}, {"url": "http://home.costhelper.com/driveway.html", "passage_text": "1 A stamped asphalt pattern (typically in the shape of bricks or stones) on a new or existing asphalt driveway can cost $3 -$9 a square foot, or $900 -$2,700 for 12'x25' or $3,600 -$11,000 for 24'x50' for just the stamping. 1 Also called tar and chip or oil and stone, macadam driveway can cost $1 -$3 or more a square foot on an existing driveway, or $600 -$1,800 for 12'x50'; and $2 -$4 or more a square foot for a completely new driveway with gravel base, or $1,200 -$2,400 for 12'x50'."}, {"url": "http://www.wolfpaving.com/blog/3-driveway-pros-cons-gravel-vs.-asphalt-paving", "passage_text": "Homeowners appreciate the sleek appearance of an asphalt-paved driveway at a lower cost than concrete or paver surfaces. Flexible in extreme climate conditions. Asphalt driveways typically cost $2 - $5 per sq foot to install-more than gravel, but much less than many other options. Long lifespan. With proper maintenance, an asphalt driveway will last anywhere from 12 – 35 years depending on installation, climate, usage and other factors. 1 Economical option. 2  Homeowners appreciate the sleek appearance of an asphalt-paved driveway at a lower cost than concrete or paver surfaces. 3  Flexible in extreme climate conditions. 4  Asphalt driveways typically cost $2 - $5 per sq foot to install-more than gravel, but much less than many other options. 5 "}, {"url": "http://www.doityourself.com/stry/asphalt-vs-concrete-driveway-cost-and-maintenance", "passage_text": "If maintained properly and sealed regularly, asphalt driveways will last around 30 years. Not properly cared for, an asphalt driveway can deteriorate considerably in as little as 5 years, leading to costly repairs or replacements. Concrete driveways can last 50 years or longer with lesser maintenance and repair costs."}, {"url": "http://www.greatdayimprovements.com/asphalt-vs-concrete-driveways.aspx", "passage_text": "Cost. Ignoring any maintenance costs, asphalt is generally much cheaper to install than concrete. On average, the cost per square foot for asphalt will run between $2.50 to $4.00. Fluctuations in crude oil prices can cause fluctuations in asphalt prices but the price will remain around this range. Concrete, on the other hand, can run between $4.00 to $6.00 per square foot for basic installation and can cost more depending on different finishes and detail. It’s not unheard of to have a stained concrete driveway with a smooth finish cost over $15.00 per square foot"}, {"url": "http://www.ehow.com/about_5622007_asphalt-vs_-concrete-price.html", "passage_text": "An asphalt driveway will require more regular maintenance than a concrete driveway. Asphalt requires re-sealing every three years or so. Low-end sealants cost around $5 for a five-gallon bucket and cover around 400 square feet of asphalt. High-end sealants can cost upwards of $20 per bucket. The bigger the asphalt or concrete project, the more it is going to cost in the long run. Longer stretches of road or driveways require more material, more equipment and more manpower to complete. Driveways or stretches of road that are in remote, rural areas cost more to get maintenance to."}, {"url": "http://www.kompareit.com/homeandgarden/landscaping-compare-asphalt-vs-concrete-driveway.html", "passage_text": "A basic asphalt driveway costs about $2 to $6 per square foot, including installation. That provides you with a base and a top coat. The price goes up from there if you add features like a chip seal top coat, which extends the life of the driveway, or a decorative top coat that is stamped or colored. Asphalt Driveway Pros. 1  Price-Asphalt is considerably less expensive than concrete. 2  In some cases, it’s about half the price. 3  Better in cold climates-Asphalt is less likely to crack in cold weather. 4  It performs better than concrete in very harsh or snowy climates."}, {"url": "http://www.kompareit.com/homeandgarden/landscaping-compare-asphalt-vs-concrete-driveway.html", "passage_text": "Basic, construction-grade concrete costs about $5 to $10 per square foot, including installation. Opting for fancier, decorative versions such as stamped or colored concrete will add several dollars per square foot to the price. Very high-end concrete could cost as much as $15 per square foot. Again, if you’re building a driveway where none existed, budget about an extra $2 to install a layer of gravel beneath the concrete. Removal of an existing driveway usually runs $50 to $60 per hour. Asphalt Driveway Pros. 1  Price-Asphalt is considerably less expensive than concrete. 2  In some cases, it’s about half the price. 3  Better in cold climates-Asphalt is less likely to crack in cold weather. 4  It performs better than concrete in very harsh or snowy climates."}]