[{"url": "http://www.merriam-webster.com/dictionary/Latino", "passage_text": "Tweet. : a person who was born or lives in South America, Central America, or Mexico or a person in the U.S. whose family is originally from South America, Central America, or Mexico. plural La·ti·nos. Full Definition of LATINO. 1. : a native or inhabitant of Latin America. 2. : a person of Latin-American origin living in the United States. — Latino adjective. See Latino defined for English-language learners. See Latino defined for kids."}, {"url": "http://www.pbs.org/americanfamily/latino3.html", "passage_text": "To be a Latino means that in the 2000 U.S. census, you were counted as one of 35.3 million people, of any race, classified as Hispanic, and that you were part of a group that comprised 12.5% of the total U.S. population. It means you are part of a group that now equals, or has surpassed, African Americans in number. Being Latino means a connection to the Spanish language, although, in Latin America there are also a multiplicity of other languages spoken by various groups, e.g., the indigenous peoples. Each Latino group coming to the U.S. spoke Spanish, but each country has its particular way of speaking Spanish."}, {"url": "https://en.wikipedia.org/wiki/Latino", "passage_text": "People who identify their origin as Spanish, Hispanic, or Latino may be of any race. Origin can be viewed as ancestry, nationality, or country of birth of the person or person's parents or ancestors prior to their arrival in the United States. The terms Hispanic and Latino do not refer to a race of people, but rather to an ethnicity. Members of the Hispanic ethnicity may share a common culture, history, language, and heritage."}, {"url": "http://www.slate.com/articles/news_and_politics/explainer/2009/05/is_hispanic_the_same_thing_as_latina.html", "passage_text": "Latino is a Spanish word—hence the feminine form Latina —that refers to people with roots in Latin America and generally excludes the Iberian Peninsula. For many, Hispanic has negative connotations because of its Eurocentrism. Others prefer it because it's gender-neutral. It defines Hispanics and Latinos as persons who trace their origin or descent to Mexico, Puerto Rico, Cuba, Spanish speaking Central and South America countries, and other Spanish cultures.. But if someone from Brazil says he's Hispanic, the census doesn't say, No, you're not."}, {"url": "https://en.wikipedia.org/wiki/Latino", "passage_text": "Hispanic Americans and Latino Americans (Spanish: hispanos [isˈpanos] , latinos) are United States citizens, legal permanent residency holders, and presently-resident illegal aliens (i.e. excl. lawful transient non-resident visitors) descending from the peoples of the countries of Latin America and Iberia. The terms Hispanic and Latino do not refer to a race of people, but rather to an ethnicity. Members of the Hispanic ethnicity may share a common culture, history, language, and heritage."}, {"url": "http://www.definitions.net/definition/Latino", "passage_text": "A person from Latin America. Latino (Noun). A person residing in the United States, who is of Latin American descent. Latinos have quickly become the largest ethnic minority in the United States. Latino (Adjective). Of Latin American descent. "}, {"url": "http://www.diffen.com/difference/Hispanic_vs_Latino", "passage_text": "Hispanic if you and/or your ancestry come from a country where they speak Spanish. Latino refers to geography. Specifically, to Latin America, to people from the Caribbean (Puerto Rico, Cuba, Dominican Republic), South America (Ecuador, Bolivia, Colombia, Peru, etc.) and Central America (Honduras, Costa Rica, etc.). In the U.S. Origin. The term Hispanic is derived from the Latin word for Spain, while Latino is derived from Spanish word for Latin but which as an English word is probably a shortening of the Spanish word latinoamericano, which in English means Latin American.."}, {"url": "http://www.thefreedictionary.com/Hispanic", "passage_text": "Latino —which in Spanish means Latin but which as an English word is probably a shortening of the Spanish word latinoamericano —refers more exclusively to persons or communities of Latin American origin. Of the two, only Hispanic can be used in referring to Spain and its history and culture. usage: The terms Hispanic and Latino have the same meaning, though Latino is more informal. Both terms more commonly refer to a person from Latin America rather than one from Spain."}, {"url": "http://www.audioenglish.org/dictionary/latino.htm", "passage_text": "Hyponyms (each of the following is a kind of Latino): spic; spick; spik (offensive terms for persons of Latin American descent). transmigrante (a Latin American who buys used goods in the United States and takes them to Latin America to sell). Holonyms (Latino is a member of...): Latin America (the parts of North America and South America south of the United States where Romance languages are spoken). "}, {"url": "https://en.wikipedia.org/wiki/Latino", "passage_text": "Hispanics are defined as people from Spain or any of the Spanish speaking countries in Latin America. The U.S. government defines Hispanic as anyone from Spain and the Spanish speaking countries of the Americas. The term Latino has developed more varied definitions. The terms Hispanic and Latino do not refer to a race of people, but rather to an ethnicity. Members of the Hispanic ethnicity may share a common culture, history, language, and heritage."}]