[{"url": "http://www.investopedia.com/terms/i/incomebond.asp", "passage_text": "The income bond is a somewhat rare financial instrument which generally serves a corporate purpose similar to that of preferred shares. A type of debt security in which only the face value of the bond is promised to be paid to the investor, with any coupon payments being paid only if the issuing company has enough earnings to pay for the coupon payment. Next Up."}, {"url": "https://www.fidelity.com/fixed-income-bonds/individual-bonds/overview", "passage_text": "Gain a deeper understanding of fixed income and bonds. In general the bond market is volatile, and fixed income securities carry interest rate risk. (As interest rates rise, bond prices usually fall, and vice versa. 1. Preservation of principal and regular income are dependent upon the creditworthiness of the bond’s issuer. In the event of bankruptcy or default by the issuer, income payments will cease and you may lose all or a portion of your initial investment. 2."}, {"url": "http://financial-dictionary.thefreedictionary.com/income+bond", "passage_text": "income bond. A long-term debt security in which the issuer is required to pay interest only when interest is earned. This rare security, issued principally as part of a corporate reorganization, offers an investor a relatively weak promise of payment. Income bonds are most common in reorganization plans in which the issuer is attempting to maintain operations in bankruptcy. An income bond is useful for the issuer because it provides capital quickly."}, {"url": "http://financial-dictionary.thefreedictionary.com/income+bond", "passage_text": "Income Bond. A bond in which the issuer is only responsible for making coupon payments when it has sufficient income to do so. Income bonds are most common in reorganization plans in which the issuer is attempting to maintain operations in bankruptcy. An income bond is useful for the issuer because it provides capital quickly."}, {"url": "http://www.merriam-webster.com/dictionary/income%20bond", "passage_text": "Definition of INCOME BOND. : a bond that pays interest at a rate based on the issuer's earnings. ADVERTISEMENT"}, {"url": "http://www.thisismoney.co.uk/money/saving/article-1585160/Guaranteed-income-bonds.html", "passage_text": "Guaranteed Income Bonds (GIBs) are offered by insurance companies, and pledge a fixed income over a certain amount of time, from one to five years. Guaranteed cash: a steady flow of cash is guaranteed but there are charges for early withdrawal. Any income in excess of 5% of the investment must be added to your other income for that tax year to decide if you are still a basic rate tax payer. Pros and cons. An attraction of the bonds is flexibility."}, {"url": "http://www.telegraph.co.uk/finance/personalfinance/investing/11040675/Revealed-The-top-investments-for-monthly-income.html", "passage_text": "Of the 2,000 unit trusts or equivalent funds available to private investors, just 20 pay income on a monthly basis. Those which do are an eclectic mix of portfolios holding shares and bonds, or often both. "}, {"url": "https://www.fidelity.com/fixed-income-bonds/overview", "passage_text": "Fixed income investments generally pay a return on a fixed schedule, though the amount of the payments can vary. Individual bonds may be the best known type of fixed income security, but the category also includes bond funds, ETFs, CDs, and money market funds. Bond mutual funds invest primarily in individual bonds. Many make periodic dividend payments based on the interest paid by the bonds held in the fund. Fixed Income ETFs. Exchange-traded funds (ETFs) are baskets of investments that trade as a single unit throughout the day."}, {"url": "http://www.investopedia.com/terms/i/incomebond.asp", "passage_text": "DEFINITION of 'Income Bond'. A type of debt security in which only the face value of the bond is promised to be paid to the investor, with any coupon payments being paid only if the issuing company has enough earnings to pay for the coupon payment. Next Up."}]