[{"url": "http://support.bell.ca/Internet/Connection-help/What-do-SSID-and-WPA2-mean", "passage_text": "SSID is simply the technical term for a network name. When you set up a wireless home network, you give it a name to distinguish it from other networks in your neighbourhood. You'll see this name when you connect your computer to your wireless network. "}, {"url": "http://searchmobilecomputing.techtarget.com/definition/service-set-identifier", "passage_text": "A service set identifier (SSID) is a sequence of characters that uniquely names a wireless local area network (WLAN). An SSID is sometimes referred to as a network name.. This name allows stations to connect to the desired network when multiple independent networks operate in the same physical area. "}, {"url": "https://kb.iu.edu/d/anyp", "passage_text": "SSID stands for Service Set Identifier, which is a 32-character sequence that uniquely identifies a wireless LAN (WLAN). In other words, the SSID is the name of the wireless network. The significance of the SSID is not obvious until you examine the way it functions: 1  It uniquely identifies a wireless network, which is of vital importance in a wireless environment. 2  A wireless computer or other device sitting between a number of wireless access points (WAPs) can see and broadcast to all of them."}, {"url": "http://compnetworking.about.com/cs/wireless/g/bldef_ssid.htm", "passage_text": "Definition: An SSID is the name of a wireless local area network (WLAN). All wireless devices on a WLAN must employ the same SSID in order to communicate with each other. A network administrator often uses a public SSID, that is set on the access point and broadcast to all wireless devices in range. Some newer wireless access points disable the automatic SSID broadcast feature in an attempt to improve network security. SSIDs are case sensitive text strings."}, {"url": "https://answers.yahoo.com/question/index?qid=20061128212831AA8sefK", "passage_text": "Best Answer: Login http://192.168.1.1/ User name: (Leave Blank) Password: admin Unless you edit before your user name or password or else the default settings is like that. Go to your Basic Wireless Settings and you'll found Wireless Network Name (SSID) column. On there you can edit your SSID. "}, {"url": "http://computer.howstuffworks.com/ssid.htm", "passage_text": "SSID stands for service set identifier, and it is used to uniquely identify any given wireless network. You can think of it as the IP address for a wireless network. Every wireless network that's set up needs to be identifiable by other devices on the network and for the data packets that will along it. The SSID itself is a 32-character string (the characters can be anything a computer can type, such as a letter, number, symbol, punctuation mark, and even a blank space). A wireless network can be either hidden or broadcast. If the SSID is broadcast, then anyone can find that network and hop on."}, {"url": "http://www.wikihow.com/Find-the-SSID-on-a-Computer", "passage_text": "How to Find the SSID on a Computer. Three Methods: Finding Available SSIDs in Windows Finding Available SSIDs in OS X Detecting Hidden SSIDs. An SSID (Service Set Identifier) is a name that identifies a particular wireless network you are connecting to. Each wireless network in your range will have its own unique name, or SSID. If the wireless network is not broadcasting the SSID, you can use a network analyzer to find it. Ad"}, {"url": "http://techterms.com/definition/ssid", "passage_text": "SSID. Stands for Service Set Identifier.. An SSID is a unique ID that consists of 32 characters and is used for naming wireless networks. When multiple wireless networks overlap in a certain location, SSIDs make sure that data gets sent to the correct destination. The SSID is different than the name that is assigned to a wireless router."}]