[{"url": "http://michiganlegalhelp.org/self-help-tools/individual-rights/emancipation-becoming-adult-age-18", "passage_text": "Yes. You must be a resident of the State of Michigan to be emancipated in Michigan. File your petition for emancipation in the family division of the circuit court where you live. Some courts consider the county your parents, guardian, or custodian live in to be your residence until you are emancipated."}, {"url": "http://michiganlegalhelp.org/self-help-tools/individual-rights/emancipation-becoming-adult-age-18", "passage_text": "Emancipation is releasing a minor from the care and control of the minor’s parents, guardians or custodians. It gives the minor many of an adult’s rights and responsibilities. Emancipation can happen by operation of law or by a court order."}, {"url": "http://www.answers.com/Q/How_do_you_get_emancipated_in_Michigan_and_how_much_does_it_cost", "passage_text": "Michigan Code Chapter 722 Emancipation By Operation of Law,... allows for the minor to be emancipated if he or she is legally married or on active duty with the military, both require parental or guardian consent. Also for the minor to receive routine or emergency nonsurgical care or preventive health care."}, {"url": "http://www.ehow.com/info_8699919_emancipation-rules-michigan.html", "passage_text": "The Michigan law that makes provisions for emancipation laws is the Status of Minors and Child Support Act, popularly known as the Emancipation of Minors Act. The purpose of the law is to give the legal definition of minors and to establish their status under the law."}, {"url": "http://www.expertlaw.com/forums/showthread.php?t=413", "passage_text": "Emancipation in Michigan. To be emancipated in Michigan, absent a circumstance which automatically results in emancipation (such as marriage or active duty service in the armed forces), you would have to convince a court you are able to support yourself, and are capable of managing your financial and social affairs."}, {"url": "http://blog.laborlawtalk.com/2006/11/12/how-to-get-emancipated-in-michigan/", "passage_text": "How to get emancipated in Michigan. When a child becomes emancipated they are asking the judge to grant them authority to do the same things as a person who has reached the Age of Majority which is or 18 or 19 years old in most states. In the State of Michigan this age is 19."}]