[{"url": "http://www.brainyquote.com/quotes/quotes/m/mahatmagan105593.html", "passage_text": "Mahatma Gandhi Quotes. Happiness is when what you think, what you say, and what you do are in harmony. "}, {"url": "http://www.whodoyouthinkyouarelive.com/", "passage_text": "The Society of Genealogists' Family History Show began in 1993 at the Royal Horticultural Halls. Now going into its 22nd year, it has become a highlight of Who Do You Think You Are? LIVE and we are delighted to welcome the society back for our ninth year of working together. We are delighted to announce the return of Eric Knowles to Who Do You Think You Are? Live as our resident Heirloom Detective. Eric will be appearing on Friday and Saturday and will help date any family treasures important to your family and place them in their social context."}, {"url": "http://www.youtube.com/watch?v=tJixs2FoZ_Y", "passage_text": "Montgomery Gentry's official music video for 'What Do You Think About That'. Click to listen to Montgomery Gentry on Spotify: http://smarturl.it/MOGSpot?IQid=MGAT. "}, {"url": "http://writingcenter.unc.edu/handouts/audience/", "passage_text": "That’s an example of what can go awry when you think of your instructor as your only audience. Thinking about your audience differently can improve your writing, especially in terms of how clearly you express your argument. The clearer your points are, the more likely you are to have a strong essay. For more about what each field tends to expect from an essay, see the Writing Center handouts on writing in specific fields of study. The best place to start figuring out how much you should say about each part of your paper is in a careful reading of the assignment."}, {"url": "http://www.spanishdict.com/translate/think", "passage_text": "16. (to have an opinion). a. creer. I have to do what I think is in the best interest of my children. Tengo que hacer lo que creo que le conviene mas más a mis. hijos. b. Parecer i'don t think'it s a very good. Idea no me parece que sea muy buena. idea. 17 "}, {"url": "http://www.youtube.com/watch?v=EX8sjbsJj-I", "passage_text": "Music video by 50 Cent performing Do You Think About Me. (C) 2009 Shady Records/Aftermath Records/Interscope Records.  1 Do You Think About Me (Edited) by 50 Cent (Google Play • iTunes • AmazonMP3). 2  Music. 3  Standard YouTube License."}, {"url": "https://www.facebook.com/wdytya", "passage_text": "Calling all Harry Potter fans: This Sunday tune into Who Do You Think You Are? on TLC at 9/8c and find out the mysteries of J.K. Rowling's family! ‪#‎potterheads‬ http://ow.ly/Qi2ZC. Double-platinum singer Kelly Clarkson, explores her lineage and uncovers an ancestor deeply rooted in American history. Coming face-to-face with her 3x great grandfather’s wartime bravery, she finds a connection deeper than ever imagined. tlc.com."}, {"url": "http://iteslj.org/questions/television.html", "passage_text": "Conversation Questions Television A Part of Conversation Questions for the ESL Classroom. Some related questions can be found on the Entertainment page. If you can think of another good question for this list, please add it. "}, {"url": "https://answers.yahoo.com/", "passage_text": "So we all know about Justin beibers penis being leaked. All the fangirls and all the girls are worshiping it like its the second coming of christ or something, I mean, sure whatever, that's fine. Once your question has been posted for at least 1 hour and has at least one answer, click on 'Award Best Answer' button next to your chosen answer. 1  Upload failed. 2  Please upload a file larger than 100x100 pixels. 3  We are experiencing some problems, please try again. 4  You can only upload files of type PNG, JPG, or JPEG."}]