[{"url": "http://home.costhelper.com/composite-deck.html", "passage_text": "1 A composite deck can cost $25-$70 or more a square foot, or $8,000-$22,400 for 16'x20', depending on the brand, project complexity and whether construction is done by casual labor or a licensed contractor."}, {"url": "http://www.lets-do-diy.com/Projects-and-advice/Garden/Average-cost-of-decking.aspx", "passage_text": "Overall costs, depending on the tradespeople you use, the size of the deck and the type of materials will range from perhaps £25 per square metre from DIY decking using budget wood through to £100+ per square metre for a professional installation using premium materials. There are various types of decking."}, {"url": "http://www.homewyse.com/services/cost_to_install_wood_decking.html", "passage_text": "Get an INSTANT estimate of the cost to Install Wood Decking! Our free calculator uses recent, trusted data to estimate costs for your Wood Decking Installation project. For a basic 120 square feet project in zip code 47474, the benchmark cost to Install Wood Decking ranges between $7.95 - $10.84 per square foot* . To estimate costs for your project: 1. Set Project Zip Code Enter the Zip Code for the location where labor is hired and materials purchased."}, {"url": "http://www.improvenet.com/r/costs-and-prices/trex-decking", "passage_text": "1 The total project cost for a Trex deck will be from $1,500 to $2,200 for a 250-square-foot deck. 2  Trex Select of basic quality averages approximately $7 per square foot. 3  Trex Enhance of higher quality is approximately $8 per square foot. 4  Trex Transcend, the highest grade, ranges between $9 and $9.50"}, {"url": "http://home.costhelper.com/composite-deck.html", "passage_text": "1 Materials cost $10-$30 or more a square foot, depending on the brand and style, or $3,200-$9,600 for 16'x20'. 2  CostHelper readers report spending $8,000-$11,500 on DIY materials for a composite deck, roughly $13.91-$28.57 a square foot, with an average of $19.34."}, {"url": "http://home.costhelper.com/deck.html", "passage_text": "1 Wood is the most traditional, common and easily available material for decks; it is typically easier to work with than composite materials. 2  Composite deck installation can cost $25-$70 or more a square foot (8,000 -$22,400 for 16'x20)."}]