[{"url": "http://tinyurl.com/", "passage_text": "Add TinyURL to your browser's toolbar. Click and drag the following link to your links toolbar. Once this is on your toolbar, you'll be able to make a TinyURL at the click of a button. By clicking on the toolbar button, a TinyURL will be created for the page you are currently at."}, {"url": "http://www.youtube.com/watch?v=Dl81qFgl-ZU", "passage_text": "If you get a PM from someone telling you to click a TinyURL link don't! It will direct you to a website that looks exactly like YouTube. But it is really run by a pornography website called swavi.org. 1  Education. 2  Standard YouTube License. "}, {"url": "http://www.howtogeek.com/howto/internet/firefox/how-to-see-where-a-tinyurl-is-really-linking-to/", "passage_text": "http://tinyurl.com/2tqueo. You’ll be taken to a page on tinyurl.com that will show you the final destination link. If you’d like to ensure that the person you are sending links to will see the preview screen even if they haven’t enabled this setting, you can add preview. before the domain name."}, {"url": "http://tinyurl.com/", "passage_text": "Redirection to any page in your site! With TinyURL, you can also make a smaller URL that will work for any page on your site. Let's say that you have a website with the homepage that is at: Entering that URL into TinyURL will create a URL like. With this you can then redirect someone to anywhere within your site by appending a slash and the pages filename to it. Click and drag the following link to your links toolbar. Once this is on your toolbar, you'll be able to make a TinyURL at the click of a button. By clicking on the toolbar button, a TinyURL will be created for the page you are currently at."}, {"url": "https://answers.yahoo.com/question/index?qid=20090620170526AAAnE3k", "passage_text": "Asker's rating. Report Abuse. This is the link for your Yahoo Answers question: http://answers.yahoo.com/question/index;... As you can see it is very long. If you use tinyURL to change it, it makes it much shorter: http://tinyurl.com/m2nhbf But you should not be clicking on links that you do not know what they are."}, {"url": "https://en.wikipedia.org/wiki/TinyURL", "passage_text": "The TinyURL service, like other public URL shortener services, can be used by spammers and affiliate marketers to hide URLs that would otherwise cause their messages to be blocked by spam filters. TinyURL's home page includes text that explicitly encourages and recommends the use of its service to hide affiliate links. For each URL entered, the server adds a new alias in its hashed database and returns a short URL such as http://tinyurl.com/2unsh in the following page. If the URL has already been requested, TinyURL will return the existing alias rather than create a duplicate entry. The short URL forwards users to the long URL."}, {"url": "https://en.wikipedia.org/wiki/TinyURL", "passage_text": "The TinyURL homepage includes a form that is used to submit a long URL for shortening. For each URL entered, the server adds a new alias in its hashed database and returns a short URL such as http://tinyurl.com/2unsh in the following page. If the URL has already been requested, TinyURL will return the existing alias rather than create a duplicate entry. The short URL forwards users to the long URL."}, {"url": "http://fraudo.com/2009/03/23/what-is-tinyurl-and-how-does-it-affect-internet-security/", "passage_text": "TinyURL is a web redirection service. Its main purpose in life is to make long URL’s short (a URL is a web “address”). "}, {"url": "https://en.wikipedia.org/wiki/TinyURL", "passage_text": "TinyURL is a URL shortening service, a web service that provides short aliases for redirection of long URLs. Kevin Gilbertson, a web developer, launched the service in January 2002 so that he would be able to link directly to newsgroup postings that frequently had long and cumbersome addresses. For each URL entered, the server adds a new alias in its hashed database and returns a short URL such as http://tinyurl.com/2unsh in the following page. If the URL has already been requested, TinyURL will return the existing alias rather than create a duplicate entry. The short URL forwards users to the long URL."}, {"url": "https://in.answers.yahoo.com/question/index?qid=20060901192549AAiNKVS", "passage_text": "Answers. Best Answer: TinyURL is a service providing short aliases to long URLs. Short URL aliases are seen as useful because they're easier to write down, remember or pass around, are less error-prone to write, and also fit extremely bandwidth-limited media, like IRC channel topics or email signatures. "}]