[{"url": "https://www.thrifty.com/Car_Rental_Information/content/Airport_Car_Rentals.aspx", "passage_text": "Let Thrifty help your travel plans go smoothly with an airport car rental deal at one of our 120 in-terminal locations. Not only will you get great airport car rental rates, you can make the airport car rental process even smoother, faster and more rewarding when you sign up for our Blue Chip Express Rental Program. That way, we’ll know what kind of airport car rental you prefer, which options you normally want, which credit card to use, and more. Once you receive your Blue Chip number, you can use it whenever you-or your travel agent-place a reservation."}, {"url": "http://traveltips.usatoday.com/rent-rental-car-24540.html", "passage_text": "Tip. 1  If you are picking up your rental car at an airport, a way to select a car company is to see what is available near your arrival terminal. 2  Most airport websites list rental agencies that operate from that airport. 3  If you do not wish to rent a car over the Internet, you also rent one over the phone. How to Rent a Rental Car. Log on to a rental car website. Step 2. Enter the necessary information in the data fields, such as pick-up city or location, date range and time frame."}, {"url": "http://www.independenttraveler.com/travel-tips/travelers-ed/10-things-not-to-do-when-renting-a-car", "passage_text": "It is worth mentioning that an accident in a rental car will typically raise your rates if you have to make a claim on your own insurance policy. 4. Purchasing insurance, reason No. 2: your credit card covers the rest. Anything your own car insurance does not cover, it is likely that your credit card will. Again, your best protection here is to take photos or a video of a slow walk around the car. 10. Crossing international borders. Most U.S. car rental agreements do not allow you to drive the car across international borders (which means to Mexico or Canada for domestic rentals)."}, {"url": "https://www.hertz.com/rentacar/car-rental/airport-car-rentals", "passage_text": "Whether you’re flying for business or pleasure, getting a rental car at the airport is quick and easy with Hertz. Simply take a shuttle from your terminal to the Hertz Rental Car counter, pick up your car and you’re on your way! Pick from a wide variety of well maintained, modern and sophisticated vehicles including luxury, sports, and green fuel efficient cars to cater to your individual needs. We have rental car locations at all major airports across the world including:• LAX (Los Angeles International Airport, California) • JFK (John F Kenney Airport, New York)• Miami International Airport (Florida)• Heathrow (England)• Frankfurt International Airport (Germany)."}, {"url": "http://traveltips.usatoday.com/buy-used-cars-car-rental-agencies-1652.html", "passage_text": "Tip. 1  Some used cars at rental agencies have a low enough mileage for the manufacturer's warranty to still be in effect. 2  Some rental car agencies allow you to return your used car purchase within seven days or 1,000 miles if you are not happy with it. Step 3. Go to the location that has the used car you have in mind so that you can inspect it and take it for a test drive. According to Edmunds.com, used cars from rental agencies have typically been maintained very well, but you might still want to have a local mechanic inspect the vehicle."}, {"url": "http://www.defensetravel.dod.mil/Docs/CarRentalAgreement.pdf", "passage_text": "ON-TERMINAL – The rental car counter that is on airport property with transportation to the rental vehicles provided by shuttle service and the elapsed time to the rental office will not exceed 30 minutes from the time the traveler requested pick-up service. OFF-TERMINAL – The rental car counter and vehicles that are not physically located on the airport property"}, {"url": "http://www.theglobeandmail.com/globe-drive/culture/commuting/do-you-need-to-buy-rental-car-insurance/article21366347/", "passage_text": "If you have an at-fault accident in the rental, you’re on the hook for repairs to the vehicle or, in a worst-case scenario, the cost of the car at its present-day value. It’s a good bet that rental is newer and more expensive than your car is. "}, {"url": "http://traveltips.usatoday.com/buy-used-cars-car-rental-agencies-1652.html", "passage_text": "1 Some used cars at rental agencies have a low enough mileage for the manufacturer's warranty to still be in effect. 2  Some rental car agencies allow you to return your used car purchase within seven days or 1,000 miles if you are not happy with it. Step 3. Go to the location that has the used car you have in mind so that you can inspect it and take it for a test drive. According to Edmunds.com, used cars from rental agencies have typically been maintained very well, but you might still want to have a local mechanic inspect the vehicle."}, {"url": "http://traveltips.usatoday.com/rent-rental-car-24540.html", "passage_text": "1 Most airport websites list rental agencies that operate from that airport. 2  If you do not wish to rent a car over the Internet, you also rent one over the phone. 3  Telephone numbers to secure reservations can be found on rental car company websites or in a telephone book. How to Rent a Rental Car. Log on to a rental car website. Step 2. Enter the necessary information in the data fields, such as pick-up city or location, date range and time frame."}, {"url": "http://traveltips.usatoday.com/rent-rental-car-24540.html", "passage_text": "Tip. 1  If you are picking up your rental car at an airport, a way to select a car company is to see what is available near your arrival terminal. 2  If you do not wish to rent a car over the Internet, you also rent one over the phone. How to Rent a Rental Car. Log on to a rental car website. Step 2. Enter the necessary information in the data fields, such as pick-up city or location, date range and time frame."}]