[{"url": "http://www.huffingtonpost.com/jj-virgin/coconut-sugar-healthier-s_b_5669084.html", "passage_text": "Like table sugar, coconut sugar contains about equal amounts of fructose and glucose. More specifically, a study in the ASEAN Food Journal found coconut sugar has about 71 percent sucrose, or table sugar, as well as 3 percent pure glucose and 3 percent pure fructose. In other words, about 78 percent -- over three-fourths -- of coconut sugar is actually sugar, compared with 100 percent of table sugar. "}, {"url": "http://www.theglobeandmail.com/life/health-and-fitness/ask-a-health-expert/coconut-sugar-is-it-healthier-than-white-sugar-or-just-hype/article19187927/", "passage_text": "Coconut sugar is often hyped as retaining many minerals from the sap, especially potassium. It’s true that 100 grams (25 teaspoons!) of coconut sugar has 1,030 mg of potassium, nearly one-quarter of a day’s worth. But don’t count on getting much of anything except sugar in a teaspoon or two. Video: Nutrition Basics: What you need to know about the Paleo Diet. Coconut sugar is made from the sap of flower buds from the coconut palm tree. (It’s not made from coconuts as you might think.) The sap is boiled over moderate heat to evaporate most of its water content. The final product is coconut sugar, which is caramel-coloured and tastes similar to brown sugar"}, {"url": "https://store.nutiva.com/coconut-sugar/", "passage_text": "• Organic Coconut Sugar. Nutiva's Organic Coconut Sugar is made from fresh coconut tree sap, collected from the cut flower buds. The sap is heated to evaporate moisture, resulting in the crystal or granular form of sugar. The subtly sweet taste of Coconut Sugar is similar to brown sugar with a hint of caramel. "}, {"url": "https://en.wikipedia.org/wiki/Coconut_sugar", "passage_text": "However, coconut sugar is different both in taste, texture and manufacture methods from palm sugar, which is made from the sap in the stems of the Palmyra palm, the date palm, the sugar date palm, the sago palm or the sugar palm. Coconut sugar has been used as a traditional sweetener for thousands of years in the South and South-East Asian regions where the coconut palm is in abundant supply. The world's largest producers of coconuts are the Philippines and Indonesia."}, {"url": "http://coconutpalmsugar.com/", "passage_text": "One of the lowest glycemic index sweeteners on the market, organic coconut palm sugar is highly nutritious, ecologically beneficial and provides sustained energy with an inspired taste. Organic coconut palm sugar is the perfect choice for health, people and planet. "}, {"url": "http://www.bobsredmill.com/organic-coconut-sugar.html", "passage_text": "Details. Bob's Red Mill Coconut Sugar is made from the nectar of coconut palm tree blossoms. It is a wholesome alternative sweetener that can be used in many recipes as a one-to-one replacement for white sugar or brown sugar. The mellow caramel flavor is perfect in cookies, cakes and quick breads. Organic Coconut Sugar is a wholesome alternative sweetener made from the nectar of coconut palm tree blossoms"}, {"url": "https://en.wikipedia.org/wiki/Coconut_sugar", "passage_text": "Coconut sugar (also known as coco sugar, coconut palm sugar or coco sap sugar) is a sugar produced from the sap of cut flower buds of the coconut palm. Coconut sugar has been used as a traditional sweetener for thousands of years in the South and South-East Asian regions where the coconut palm is in abundant supply. The world's largest producers of coconuts are the Philippines and Indonesia."}, {"url": "http://foodwatch.com.au/blog/carbs-sugars-and-fibres/item/coconut-sugar.html", "passage_text": "Don’t confuse coconut sugar with Palm Sugar (also known as jaggery, gur, gula melaka or gula jawa) which comes from the sugar date palm and is a popular sweetener in the tropics. Palm sugar is sold in rounded cakes, cylinders, blocks or large plastic or glass jars. One of coconut sugar’s big claims to health is that it has a low GI (Glycemic Index) which is a measure of how quickly any sugar or starch can get broken down and converted to your own blood glucose. The lower the number, the slower the conversion, the better."}]