[{"url": "http://www.thinkbabynames.com/meaning/0/Comfort", "passage_text": "Comfort /com-fort/ [2 sylls.] as a girls' name is of English and Latin origin, and the meaning of Comfort is to strengthen and comfort. Comfort is an uncommon given name for females but a very popular last name for all people (#8500 out of 150436, Top 6%). (2000 U.S. Census). Presented below is the baby name popularity of Comfort for girls. Comfort has not made it into the Top 1000 thus far. (2014 Birth Statistics)."}, {"url": "http://www.surnamedb.com/Surname/Comfort", "passage_text": "This interesting name, with variant spellings Compfort, Compford, Comford and Comport, derives from the Medieval English Cumfort, (Old French Cunfort or Confort), meaning encouragement, aid, or support, and was originally given as a personal nickname to one who was a source of strength and support. The variant spellings Compfort, Comford and Compford recorded in Church registers of Kent and London from the mid 16th Century have given rise to the theory that, in some instances, the name may be locational from a now lost place in Kent, possibly called Compford from the Old English camp, a field, plus ford, ford."}, {"url": "http://www.ancestry.com/name-origin?surname=comfort", "passage_text": "Comfort Name Meaning. English (Kent): probably a habitational name from a place near Birling in Kent, now called Comfortsplace Farm, earlier known as Comports Place (1559) and Comporte (1601). This was named for a family associated with it called de Cumpeworth (1255). You can find out where the majority of the Comfort families were living before they immigrated to the U.S and learn where to focus your search for foreign records. Immigration records can tell you an ancestor's name, ship name, port of departure, port of arrival, and destination."}, {"url": "http://www.behindthename.com/name/comfort/comments", "passage_text": "Comfort does NOT sound like a name! It is a pretty name it just doesn't sound like it. If I liked the name Comfort I would see what the name sounds like in other languages:). -- -BekahBoo 10/21/2010. Well, once you get past the usual 'it's a word so you can't use it!', it's actually a cute name. Nice mix of consonants. -- yael5012_y 6/14/2009. Comfort is a word, and not good as a name. Even if it wasn't a word, it would still be a terrible name. The end-- 'Fort' doesn't sound good, in my opinion. -- -Julia- 7/23/2009. My 5th-and-6th grade teacher's first name is Comfort."}, {"url": "http://www.merriam-webster.com/dictionary/comfort", "passage_text": "Full Definition of COMFORT. transitive verb. 1. : to give strength and hope to: cheer. 2. : to ease the grief or trouble of: console. — com·fort·ing·ly \\-fər-tiŋ-lē\\ adverb. See comfort defined for English-language learners. See comfort defined for kids. "}, {"url": "http://www.biblestudytools.com/dictionary/comfort/", "passage_text": "COMFORT. kum'-fert (nacham; parakaleo): The New Testament word is variously translated, as comfort, exhort, beseech, the exact translation to be determined by the context. Etymologically, it is to call alongside of, i.e. to summon for assistance. To comfort is to cheer and encourage. The meaning is to call or summon to one's aid, to call for help, to stand alongside of. Further meanings are to comfort, to encourage, to cheer up, to exhort. The second beatitude offers a blessing to those who mourn, for they will be comforted (Matt 5:4)."}, {"url": "http://www.behindthename.com/name/comfort", "passage_text": "Meaning & History. From the English word comfort, ultimately from Latin confortare to strengthen greatly, a derivative of fortis strong. It was used as a given name after the Protestant Reformation."}, {"url": "http://av1611.com/kjbp/kjv-dictionary/comfort.html", "passage_text": "In law, to relieve, assist or encourage, as the accessory to a crime after the fact. COMFORT, n. 1. Relief from pain; ease; rest or moderate pleasure after pain, cold or distress or uneasiness of body. The word signifies properly new strength, or animation; and relief from pain is often the effect of strength."}, {"url": "https://en.wikipedia.org/wiki/Comfort,_Texas", "passage_text": "Comfort is a census-designated place (CDP) in Kendall County, Texas, United States. The population was 2,363 at the 2010 census. It is part of the San Antonio Metropolitan Statistical Area. "}]