[{"url": "http://www.definitions.net/definition/incumbent", "passage_text": "Incumbent. The incumbent, in politics, is the existing holder of a political office. This term is usually used in reference to elections, in which races can often be defined as being between an incumbent and non-incumbent. Wiktionary (0.00 / 0 votes) Rate this definition: incumbent (Noun). The current holder of an office, such as ecclesiastical benefice or a an elected office. incumbent (Noun). A holder of a position as supplier to a market or market segment that allows the holder to earn above-normal profits. incumbent (Adjective)."}, {"url": "http://www.investopedia.com/terms/i/incumbent.asp", "passage_text": "DEFINITION of 'Incumbent'. An individual that is responsible for a specific office within a corporation or government position. This person has an obligation to the position or office he/she holds. All incumbents of an organization, such as directors and officers, are listed on an incumbency certificate. This is an official or regime currently holding office or a post. For example, in politics, The incumbent governor was defeated in the elections.. This term is also used in the form of an obligation.. For example, It is incumbent for the President to sign the new health care policy in order to meet the nations' current health care needs.. Also referred to as a company that is powerful and has a large amount of market share, as in, the dominant incumbent software company"}, {"url": "http://www.answers.com/Q/What_is_an_incumbent_agency", "passage_text": "Merge this question into. Split and merge into it. Answered by The Community. Making the world better, one answer at a time. An incumbent agency is the advertising agency that has the business of a client or company. It is the agency that is currently under contract with a client to advertise their products or services. "}, {"url": "http://www.davemanuel.com/investor-dictionary/incumbent/", "passage_text": "The dictionary defines the term incumbent as being the holder of an office or holding an indicated position. In the 2012 US Presidential election, for instance, Barack Obama will be the incumbent, as he already holds the White House. "}, {"url": "http://www.merriam-webster.com/dictionary/incumbent", "passage_text": "Examples of INCUMBENT. 1  Voters will have the chance to see the incumbent and her opponent in a series of three debates. 2  Incumbents often have an advantage in elections. 1 It is incumbent upon the press to act not in its own best interests, but in society's best interests. — 2 Carll Tucker, Saturday Review, 23 June 1979. … 3  the various types of obligation incumbent on the members of the profession."}, {"url": "http://www.merriam-webster.com/dictionary/incumbent", "passage_text": "Full Definition of INCUMBENT. 1. : the holder of an office or ecclesiastical benefice. 2. : one that occupies a particular position or place. 1 It is incumbent upon the press to act not in its own best interests, but in society's best interests. — 2 Carll Tucker, Saturday Review, 23 June 1979. … 3  the various types of obligation incumbent on the members of the profession."}, {"url": "https://en.wikipedia.org/wiki/Incumbent", "passage_text": "In the United States, incumbents traditionally win their party's nomination to run for office. Unseating an incumbent president, governor, senator or other figure during a primary election is very difficult, and even in the general election, incumbents have a very strong record. Elections featuring an incumbent, on the other hand, are as Guy Molyneux puts it, fundamentally a referendum on the incumbent.. Voters will first grapple with the record of the incumbent. Only if they decide to fire the incumbent do they begin to evaluate whether the challenger is an acceptable alternative."}, {"url": "http://blogs.imms.com/immsinsider/general-information/tired-of-losing-to-the-incumbent-agent-try-the-wedge/", "passage_text": "Rule No. 1: No two objects can occupy the same space at the same time. In other words, the incumbent agent occupies the position you want. The incumbent is close to the prospect and will always get the last look if you don’t do something about it. When the incumbent agent gets the last look, the competing agent usually gets rolled. Rule No. 2: It doesn’t pay to knock the competition. Instead, look to: Rule No. 3: Nothing, including an incumbent agent, is good or bad except by comparison. The tough part about selling anything is that to be effective, you have to be able to articulate differences."}, {"url": "http://www.merriam-webster.com/dictionary/incumbent", "passage_text": "1 Voters will have the chance to see the incumbent and her opponent in a series of three debates. 2  Incumbents often have an advantage in elections. 3  Because the statehouse now determines voting districts, the current map generally ensures that incumbents face minimal challenges to re-election. 1 It is incumbent upon the press to act not in its own best interests, but in society's best interests. — 2 Carll Tucker, Saturday Review, 23 June 1979. … 3  the various types of obligation incumbent on the members of the profession."}]