[{"url": "http://www.veganpeace.com/animal_facts/Turkeys.htm", "passage_text": "Turkeys are the only breed of poultry native to the Western Hemisphere. They were first domesticated in Mexico and brought to Europe in the 16th century. A male turkey is called a tom or a gobbler, a female turkey a hen, and a baby turkey a poult or chick. A young male turkey is called a jake and a young female is called a jenny. A group of wild turkeys is called a flock, a group of domesticated turkeys is commonly referred to as a rafter. "}, {"url": "https://en.wikipedia.org/wiki/Cornish_game_hen", "passage_text": "Though the bird is called a hen, it can be either male or female. A cornish hen typically commands a higher price per pound than typically sold chickens, despite a shorter growing span of 28 to 30 days, as opposed to 42 or more for regular chicken. "}, {"url": "http://www.answers.com/Q/What_is_a_male_hen_called", "passage_text": "A hen is a mature female chicken. A Pullet is an immature (young) female chicken. A mature male breeding chicken is a rooster. A castrated male chicken is a capon. An immature … male chicken is a cockeral. 2 people found this useful"}, {"url": "http://www.veganpeace.com/animal_facts/Chickens.htm", "passage_text": "A mature male chicken is called a rooster or cock or roo. A mature female chicken is called a hen. A chick is a newly hatched chicken. An immature male chicken is called a cockerel and an immature female chicken a pullet. A chicken is a bird. "}, {"url": "https://answers.yahoo.com/question/index?qid=20090106092734AAyaIit", "passage_text": "show more I always thought that male chickens were called roosters, and female chickens are called hens.. I was just wondering if chicken is an umbrella term for both these animals? In other words, when we buy chicken in the super market, does it always come from a hen? In the market, you are eating hens when they are called fryers. Generally, roosters are not eaten, except in stews and some soups. Many chicken farmers just kill all male chickens that are born because there is no demand for them."}, {"url": "http://www.almanac.com/content/glossary-chicken-terms", "passage_text": "1 Cock: A male chicken, also called a rooster. 2  Cockerel: A young rooster, under 1 year old. 3  Fryer: A chicken of 3 to 4 pounds, at 12 to 14 weeks old. 4  Hen: A female chicken. If a Hen is a female chicken, and a cock or cockerel is a male, what are fryers and roasters, which you simply call. Fryer A chicken of 3 to 4 pounds, at 12 to 14 weeks old.. or. Roaster: A chicken of 4 to 6 pounds, over 12 to 14 weeks old."}, {"url": "https://en.wikipedia.org/wiki/Rooster", "passage_text": "A rooster, also known as a cockerel or cock, is a male gallinaceous bird, usually a male chicken (Gallus gallus). The term rooster originates in the United States, and the term is widely used throughout North America, as well as Australia and New Zealand. The older terms cock or cockerel, the latter denoting a young cock, are used in the United Kingdom and Ireland."}]