[{"url": "http://homewyse.com/services/cost_to_install_ceramic_floor_tile.html", "passage_text": "Our free calculator uses recent, trusted data to estimate costs for your Ceramic Floor Tile Installation project. For a basic 120 square feet project in zip code 47474, the benchmark cost to Install Ceramic Floor Tile ranges between $9.83 - $13.74 per square foot* . To estimate costs for your project: 1. "}, {"url": "http://www.contractortalk.com/f18/tiling-man-hours-per-sq-ft-91922/", "passage_text": "Re: Tiling-Man Hours Per Sq. On the last dozen or so spec's I built we installed the entire ground floor with 12 X 12 porcelain on a slab. No prep, no trim in place, materials on site, everything ready to go, we (2 men) could install 900 square feet in 8 hours and grout it in 2 hours. "}, {"url": "https://au.answers.yahoo.com/question/index?qid=20080605035013AA2ELJh", "passage_text": "How much does a tiler cost? how much does a tiler cost in australia to lay down tiles? is he charged per hour or per tile sqm? "}, {"url": "http://www.improvenet.com/r/costs-and-prices/mosaic-glass-tile-backsplash", "passage_text": "The average costs of these supplies is $2.42 to $2.80 per square foot of a mosaic glass tile backsplash. Professional installers are also needed to install this type of backsplash because installation involves heavy duty equipment. The average cost of one hour of labor for a mosaic glass tile backsplash is $38 to $50. Most installation is completed in 10 to 15 hours depending on the size of a kitchen."}, {"url": "http://www.homeimprovementpages.com.au/article/how_much_does_bathroom_tiling_cost", "passage_text": "©Belmondo Tiles. Tilers do charge hourly rates of around $45 to $60 an hour on average, but that's not the best way to find out how much your bathroom tiling job is going to cost. A better way is to first find the tiles you want and then get quotes from tilers. "}, {"url": "http://www.homeimprovementpages.com.au/article/how_much_does_a_tiler_cost", "passage_text": "©KI Tiles. Tilers charge by the hour or by the job, but in either case, they calculate their charges based on a target hourly rate. An inexperienced or semi-retired tiler who works from home may charge as little as $20 per hour, while a few professional tilers charge up to $150 an hour. On average, though, tilers charge about $45 per hour. There's more to choosing a tiler than just asking their hourly rate, though. Often, none of these are included in a tiler's quote, but they can add significantly to the final cost. Before deciding on a tiler, ask them for additional quotes for any extra services that you need."}, {"url": "http://homewyse.com/services/cost_to_install_tile_floor.html", "passage_text": "Get an INSTANT estimate of the cost to Install a Tile Floor! Our free calculator uses recent, trusted data to estimate costs for your Tile Floor Installation project. For a basic 120 square feet project in zip code 47474, the benchmark cost to Install a Tile Floor ranges between $10.02 - $14.22 per square foot* . To estimate costs for your project: 1. Set Project Zip Code Enter the Zip Code for the location where labor is hired and materials purchased."}, {"url": "http://www.buildingsheriff.com/tiling-wall-cost.html", "passage_text": "Each price is for his labour, adhesive and grout. No tiles are included. Lets assume a 8’ x 6’ bathroom, with one window reveal, walls ready for tiling, with the bath etc in situ, to be tiled in 8” (200mm) square tiling. Job 1. Tile the bathroom, floor to ceiling, apply grout, then silicone around the bath. Same area of kitchen but with 1’ (25mm) mosaic tiles that come on a 12” (300mm) backing mesh which are a nightmare to put on. This is fiddly work, he will charge you for 1.5 days plus his materials……£275.00. The previous jobs were quite small and reasonably fiddly."}]