[{"url": "http://www.thefreedictionary.com/Soil+formation", "passage_text": "Coastal acid sulfate soils in the Saloum River basin, Senegal by Fall, Aidara C.A. Lamine; Montoroi, Jean-Pierre; Stahr, Karl / Soil Research. In all the theories presented on aggregate formation, organic matter and aggregate stability plays a major role in the formation and Due to the dynamics of organic matter in."}, {"url": "https://en.wikipedia.org/wiki/Soil_science", "passage_text": "A sylviculturist, at work. Soil science is the study of soil as a natural resource on the surface of the Earth including soil formation, classification and mapping; physical, chemical, biological, and fertility properties of soils; and these properties in relation to the use and management of soils. The term is popularly applied to the material on the surface of the Earth's moon and Mars, a usage acceptable within a portion of the scientific community. Accurate to this modern understanding of soil is Nikiforoff's 1959 definition of soil as the excited skin of the sub aerial part of the earth's crust."}, {"url": "https://en.wikipedia.org/wiki/Soil_science", "passage_text": "Soil occupies the pedosphere, one of Earth's spheres that the geosciences use to organize the Earth conceptually. This is the conceptual perspective of pedology and edaphology, the two main branches of soil science. The term is popularly applied to the material on the surface of the Earth's moon and Mars, a usage acceptable within a portion of the scientific community. Accurate to this modern understanding of soil is Nikiforoff's 1959 definition of soil as the excited skin of the sub aerial part of the earth's crust."}, {"url": "https://www.soils.org/publications/soils-glossary", "passage_text": "This Glossary of Soil Science Terms was an ad hoc committee of the Soil Science of America to provide a single glossary of terms for the various disciplines of soil science. "}, {"url": "http://encyclopedia2.thefreedictionary.com/soil+science", "passage_text": "Soil Science. a natural science that treats of the composition, properties, origin, development, geographic distribution, and rational use of soil. It studies soil as a natural body, as a means of production, and as an object of work. soil science. (geology). The study of the formation, properties, and classification of soil; includes mapping. Also known as pedology."}, {"url": "http://www.nrcs.usda.gov/wps/portal/nrcs/detail/soils/edu/?cid=nrcs142p2_054280", "passage_text": "This definition is from the Soil Science Glossary (Soil Science Society of America). soil - (i) The unconsolidated mineral or organic material on the immediate surface of the Earth that serves as a natural medium for the growth of land plants. "}, {"url": "http://www.merriam-webster.com/dictionary/soil%20science", "passage_text": "Definition of SOIL SCIENCE. : a science dealing with soils —called also pedology. — soil scientist noun. See soil science defined for kids. ADVERTISEMENT"}, {"url": "https://en.wikipedia.org/wiki/Soil_science", "passage_text": "Fields of study [edit]. Soil occupies the pedosphere, one of Earth's spheres that the geosciences use to organize the Earth conceptually. This is the conceptual perspective of pedology and edaphology, the two main branches of soil science. Pedology is the study of soil in its natural setting. The term is popularly applied to the material on the surface of the Earth's moon and Mars, a usage acceptable within a portion of the scientific community. Accurate to this modern understanding of soil is Nikiforoff's 1959 definition of soil as the excited skin of the sub aerial part of the earth's crust."}, {"url": "http://study.com/academy/lesson/soil-profile-definition-development-types.html", "passage_text": "The soil profile is where the secrets of the soil and landscape around it are hidden. The soil profile is defined as a vertical section of the soil that is exposed when a soil pit, or hole, is dug from the surface of the soil to the underlying bedrock. Explore the characteristics of soil profiles, their horizons and how they develop. Then, you can use this knowledge to help you determine factors under which the soil developed and history of the surrounding landscape."}, {"url": "https://en.wikipedia.org/wiki/Soil", "passage_text": "Soil is considered to be the skin of the earth and interfaces with its lithosphere, hydrosphere, atmosphere, and biosphere. Soil consists of a solid phase (minerals and organic matter) as well as a porous phase that holds gases and water. Accordingly, soils are often treated as a three-state system. The mineral material from which a soil forms is called parent material. Rock, whether its origin is igneous, sedimentary, or metamorphic, is the source of all soil mineral materials and the origin of all plant nutrients with the exceptions of nitrogen, hydrogen and carbon."}]