[{"url": "http://news.microsoft.com/facts-about-microsoft/", "passage_text": "850. Microsoft (Nasdaq “MSFT” @microsoft) is the leading platform and productivity company for the mobile-first, cloud-first world, and its mission is to empower every person and every organization on the planet to achieve more. Founded in 1975, Microsoft (Nasdaq “MSFT”) is the worldwide leader in software, services, devices and solutions that help people and businesses realize their full potential."}, {"url": "https://en.wikipedia.org/wiki/Microsoft", "passage_text": "Microsoft Corporation /ˈmaɪkrɵsɒːft/ (commonly referred to as Microsoft) is an American multinational technology company headquartered in Redmond, Washington, that develops, manufactures, licenses, supports and sells computer software, consumer electronics and personal computers and services. In July 2012, Microsoft sold its 50% stake in MSNBC.com, which it had run as a joint venture with NBC since 1996. On October 1, Microsoft announced its intention to launch a news operation, part of a new-look MSN, at the time of the Windows 8 launch that was later in the month."}, {"url": "https://en.wikipedia.org/wiki/Criticism_of_Microsoft", "passage_text": "Criticism of Microsoft has followed various aspects of its products and business practices. Issues with ease of use, robustness, and security of the company's software are common targets for critics. In the 2000s, a number of malware mishaps have targeted security flaws in Microsoft Windows and other programs. From its inception, Microsoft defined itself as a platform company and understood the importance of attracting third-party programmers. It did so by providing development tools, training, access to proprietary APIs in early versions, and partn"}, {"url": "http://readwrite.com/2013/04/10/9-things-microsoft-does-right/", "passage_text": "Google Scholar does a fine job of assisting searches for academic papers, but compare Google Scholar and Microsoft's Academic Search. Not only is Microsoft's tool arguably more interesting than what Google offers, it also allows you to search by organization. M$: Short for Microsoft, used to imply Microsoft cares more for money than it does for security, stability, and anything else that could make a good Operating System.. - Urban Dictionary, 2004. Microsoft sucks.."}, {"url": "https://en.wikipedia.org/wiki/Microsoft", "passage_text": "On June 18, 2012, Microsoft unveiled the Surface, the first computer in the company's history to have its hardware made by Microsoft. On June 25, Microsoft paid US $1.2 billion to buy the social network Yammer. In July 2012, Microsoft sold its 50% stake in MSNBC.com, which it had run as a joint venture with NBC since 1996. On October 1, Microsoft announced its intention to launch a news operation, part of a new-look MSN, at the time of the Windows 8 launch that was later in the month."}, {"url": "http://readwrite.com/2013/04/10/9-things-microsoft-does-right/", "passage_text": "Few companies have the resources to invest in startups, whether that be a company or a teenager. Microsoft does both: efforts like BizSpark give out Microsoft software and assistance to startups, while efforts like the Kodu Cup help kids learn how to code. M$: Short for Microsoft, used to imply Microsoft cares more for money than it does for security, stability, and anything else that could make a good Operating System.. - Urban Dictionary, 2004. Microsoft sucks.."}, {"url": "http://www.answers.com/Q/What_does_Microsoft_do", "passage_text": "Microsoft Office is a set of programs that are used for office work. The most important, known and used are: MS Word-text processor. Used to create documents, reports, pape … rs, etc.MS Excel-table processor. If you have already bought and downloaded the Microsoft Office tools, you access them by clicking 'Start' in the bottom left-hand corner of your screen, then scrolling through … the programs list until you see 'Microsoft Office'. When you scroll over it, a drop down list will appear. Click 'Microsoft Office Excel'"}, {"url": "https://en.wikipedia.org/wiki/Microsoft", "passage_text": "Microsoft was founded by Paul Allen and Bill Gates on April 4, 1975, to develop and sell BASIC interpreters for Altair 8800. In July 2012, Microsoft sold its 50% stake in MSNBC.com, which it had run as a joint venture with NBC since 1996. On October 1, Microsoft announced its intention to launch a news operation, part of a new-look MSN, at the time of the Windows 8 launch that was later in the month."}]