[{"url": "http://study.com/academy/lesson/the-kidney-major-divisions-structures.html", "passage_text": "The ureter is located in the renal hilum, which is a groove in the kidney where the ureter, renal artery, vein, and nerves are located. So there you have it. Some of the most important structures of the kidney have been laid out."}, {"url": "http://www.justanswer.com/health/58xls-main-subdivisions-nephron-capsule.html", "passage_text": "What Customers are Saying: 1  I can go as far as to say it could have resulted in saving my sons life and our entire family now knows what bipolar is and how to assist and understand my most wonderful son, brother and friend to all who loves him dearly. 2  Thank you very much Corrie Moll Pretoria, South Africa."}, {"url": "http://study.com/academy/lesson/the-kidney-major-divisions-structures.html", "passage_text": "The outer portion of the kidney located in between the renal capsule and the renal medulla is called the renal cortex. The renal cortex is like the fleshy part of the avocado. Deeper to the renal cortex, like our avocado pit, is the inner portion of the kidney, called the renal medulla."}, {"url": "http://www.justanswer.com/health/58xls-main-subdivisions-nephron-capsule.html", "passage_text": "Previous | Next. 1  I can go as far as to say it could have resulted in saving my sons life and our entire family now knows what bipolar is and how to assist and understand my most wonderful son, brother and friend to all who loves him dearly. 2  Thank you very much Corrie Moll Pretoria, South Africa."}, {"url": "http://www.justanswer.com/health/58xls-main-subdivisions-nephron-capsule.html", "passage_text": "Resolved Question: What are the main subdivisions of the nephron. Capsule and glomerulus. Afferent arteriole, efferent arteriole, and collecting tubule. Renal pelvis and renal sinus. Renal corpuscle and tubular system. Submitted: 4 years ago."}, {"url": "http://www.justanswer.com/health/58xls-main-subdivisions-nephron-capsule.html", "passage_text": "1 I can go as far as to say it could have resulted in saving my sons life and our entire family now knows what bipolar is and how to assist and understand my most wonderful son, brother and friend to all who loves him dearly. 2  Thank you very much Corrie Moll Pretoria, South Africa. 3  I thank-you so much!"}, {"url": "http://philschatz.com/anatomy-book/contents/m46431.html", "passage_text": "The functional unit of the kidney, the nephron, consists of the renal corpuscle, PCT, loop of Henle, and DCT. Cortical nephrons have short loops of Henle, whereas juxtamedullary nephrons have long loops of Henle extending into the medulla. About 15 percent of nephrons are juxtamedullary."}, {"url": "http://philschatz.com/anatomy-book/contents/m46431.html", "passage_text": "Chapter Review. The functional unit of the kidney, the nephron, consists of the renal corpuscle, PCT, loop of Henle, and DCT. Cortical nephrons have short loops of Henle, whereas juxtamedullary nephrons have long loops of Henle extending into the medulla. About 15 percent of nephrons are juxtamedullary."}]