[{"url": "http://www.fondriest.com/environmental-measurements/parameters/water-quality/dissolved-oxygen/", "passage_text": "This means that warmer surface water requires less dissolved oxygen to reach 100% air saturation than does deeper, cooler water. For example, at sea level (1 atm or 760 mmHg) and 4°C (39°F), 100% air-saturated water would hold 10.92 mg/L of dissolved oxygen. In a stable body of water with no stratification, dissolved oxygen will remain at 100% air saturation. 100% air saturation means that the water is holding as many dissolved gas molecules as it can in equilibrium."}, {"url": "http://www.livingwateraeration.com/oxde.html", "passage_text": "Hypoxia or oxygen depletion is a phenomenon that occurs in aquatic environments as dissolved oxygen (DO; molecular oxygen dissolved in the water) becomes reduced in concentration to a point detrimental to aquatic organisms living in the system. Oxygen Depletion. A number of conditions may develop which result in oxygen depletion, DO at levels insufficient (less than 3 mg/l) to support aquatic life (e.g. fish). Oxygen depletions are typically associated with: 1. Hot, cloudy, still weather is common from the end of July to the beginning of September"}, {"url": "https://en.wikipedia.org/wiki/Carbonaceous_biochemical_oxygen_demand", "passage_text": "Carbonaceous biochemical oxygen demand or CBOD is a method defined test measured by the depletion of dissolved oxygen by biological organisms in a body of water in which the contribution from nitrogenous bacteria has been suppressed. "}, {"url": "http://altered-states.net/barry/newsletter395/", "passage_text": "Just as a fire can’t burn without oxygen our cells can’t produce heat and energy without oxygen. Oxygen is extracted from the air we breathe by the lungs. It passes into the blood vessels that surround the lungs and is carried to all the cells of the body by the blood. Most of the oxygen is carried by the red blood cells, though some of it is carried by the water in the blood. A deficiency of water means reduced oxygen delivery by the blood. When the blood is cleansed, it has oxygen. When it is dirty, it has more waste or carbon dioxide. The condition of the blood will determine the function and the condition of the organs. The heart, the spleen, the lungs, the liver, the skin, the muscles, all depends o"}, {"url": "http://www.michigan.gov/documents/deq/wb-npdes-DissolvedOxygen_247232_7.pdf", "passage_text": "Prolonged exposure to low dissolved oxygen levels (less than 5 to 6 mg/l oxygen) may. not directly kill an organism, but will increase its susceptibility to other environmental stresses. Exposure to less than 30% saturation (less than 2 mg/l oxygen) for one to four days may kill most. of the aquatic life in a system. Both the partial pressure and the degree of saturation of oxygen will change with altitude. Finally, gas solubility decreases as pressure decreases. Thus, the amount of oxygen absorbed in water decreases as altitude increases because of the decrease in relative pressure."}, {"url": "http://www.fondriest.com/environmental-measurements/parameters/water-quality/dissolved-oxygen/", "passage_text": "They will avoid areas where DO levels are below 3 mg/L, but generally do not begin to suffer fatalities due to oxygen depletion until levels fall below 2 mg/L 22. The mean DO levels should remain near 5.5 mg/L for optimum growth and survival ¹². In a stable body of water with no stratification, dissolved oxygen will remain at 100% air saturation. 100% air saturation means that the water is holding as many dissolved gas molecules as it can in equilibrium."}, {"url": "http://www.fondriest.com/environmental-measurements/parameters/water-quality/dissolved-oxygen/", "passage_text": "The mean DO level for adult salmonids is 6.5 mg/L, and the minimum is 4 mg/L ¹². These fish generally attempt to avoid areas where dissolved oxygen is less than 5 mg/L and will begin to die if exposed to DO levels less than 3 mg/L for more than a couple days ¹⁹. In a stable body of water with no stratification, dissolved oxygen will remain at 100% air saturation. 100% air saturation means that the water is holding as many dissolved gas molecules as it can in equilibrium."}, {"url": "http://www.michigan.gov/documents/deq/wb-npdes-DissolvedOxygen_247232_7.pdf", "passage_text": "Dissolved Oxygen Dissolved oxygen (DO) refers to the volume of oxygen that is contained in water. Oxygen enters the water as rooted aquatic plants and algae undergo photosynthesis, and as oxygen is transferred across the air-water interface. Both the partial pressure and the degree of saturation of oxygen will change with altitude. Finally, gas solubility decreases as pressure decreases. Thus, the amount of oxygen absorbed in water decreases as altitude increases because of the decrease in relative pressure."}, {"url": "http://www.fondriest.com/environmental-measurements/parameters/water-quality/dissolved-oxygen/", "passage_text": "Non-compound oxygen, or free oxygen (O2), is oxygen that is not bonded to any other element. Dissolved oxygen is the presence of these free O2 molecules within water.The bonded oxygen molecule in water (H2O) is in a compound and does not count toward dissolved oxygen levels. In a stable body of water with no stratification, dissolved oxygen will remain at 100% air saturation. 100% air saturation means that the water is holding as many dissolved gas molecules as it can in equilibrium."}]