[{"url": "http://work.chron.com/much-cosmetologist-make-per-year-8049.html", "passage_text": "As of May 2011, as many as 357,030 cosmetologists, hairdressers and hairstylists were employed in the United States. The workers earned an average annual income of $26,460, according to the Bureau of Labor Statistics. Cosmetologists whose salaries were in the bottom 10 percent were paid $16,710 a year or less. Those in the top 10 percent earned $41,490 a year or more. The industry that paid cosmetologists the highest salaries as of May 2011 was the motion picture and video industry."}, {"url": "http://work.chron.com/much-cosmetologist-make-per-year-8049.html", "passage_text": "Cosmetologists, hairdressers and hairstylists employed in this industry earned a mean annual wage of $69,780, according to the bureau. Other professional, scientific and technical services was the second highest-paying industry, at an average wage of $35,700 a year."}, {"url": "http://woman.thenest.com/much-cosmetologist-make-per-year-9644.html", "passage_text": "Half of all hairdressers earned less than $22,750 a year. Both figures, however, do not account for tips, which amount to about 15 to 20 percent of the cost of the service. In the world of cosmetology, manicurists -- or pedicurists, for that matter -- don’t usually earn as much as hairdressers."}, {"url": "http://work.chron.com/much-money-certified-cosmetologist-make-14983.html", "passage_text": "The Bureau of Labor Statistics groups cosmetologists under the job category of Barbers, Hairdressers and Cosmetologists.. The median pay for these workers was $22,500 per year or $10.82 per hour as of May 2010."}, {"url": "http://www.bls.gov/ooh/Personal-Care-and-Service/Barbers-hairdressers-and-cosmetologists.htm", "passage_text": "The median hourly wage for barbers, hairdressers, and cosmetologists was $10.95 in May 2012. The median wage is the wage at which half the workers in an occupation earned more than that amount and half earned less. The lowest 10 percent earned less than $8.11, and the top10 percent earned more than $20.39."}, {"url": "http://beautyce.com/how-much-money-does-a-cosmetologist-make/", "passage_text": "Although many cosmetologists have the same exact tasks, how much they’re paid may depend on luck, experience, location, and a few other factors. Average Earnings. Cosmetologists who worked as hairdressers or in other general occupations within the field earned an average of $10.91 in 2012. Those who work as barbers command an hourly wage of about $12.06. Since that is an average, of course, the hourly rate does vary widely from employer to employer and among locations."}]