[{"url": "http://work.chron.com/become-journeyman-pipe-welder-19570.html", "passage_text": "Journeyman. The title of journeyman is recognized in many skilled-trade occupations. Welders can specialize in a variety of types of welding, including pipe welding. The journeyman title is usually specific to one industry, type of welding or union such as sheet metal or iron worker unions. Some employers and local unions train pipe welders on-the-job through a paid apprenticeship program. This might include classroom training and working under the supervision of a skilled journeyman. Apprenticeship programs can take up to five years to complete before earning the title of"}, {"url": "http://work.chron.com/become-journeyman-pipe-welder-19570.html", "passage_text": "The title of journeyman is given to those who complete training or an apprenticeship to become fully skilled in the craft of pipe welding. Some states require that you earn journeyman status to work professionally as a contractor or for those who offer services to the public. Some employers and local unions train pipe welders on-the-job through a paid apprenticeship program. This might include classroom training and working under the supervision of a skilled journeyman. Apprenticeship programs can take up to five years to complete before earning the title of"}, {"url": "http://www.wikihow.com/Become-a-Welder", "passage_text": "If you're interested in learning to become a welder, you can build the necessary skills in vocational or specialty schools, seek out essential on-the-job training, and get certified to get the best jobs available. "}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20100301122920AAkv164", "passage_text": "Report Abuse. There are welders and welders. I can weld using both gas and arc but I would not call myself a welder. To call yourself a pro welder, good enough to work on gas/oil pipe lines or oil rigs would take you about three years. Welding under water, on oil rigs for instance will require a divers certificate. To learn all the processes and basic welding principles about 1 year. To become good enough at those processes to get x-ray quality welds and get some tickets, another year. To become a journeyman takes 6000 hours where i live, some places its 8000 hours or more."}, {"url": "http://work.chron.com/courses-needed-journeyman-welder-5793.html", "passage_text": "Once the apprenticeship is completed, the tradesperson must pass an examination in order to become a journeyman. Welding apprenticeships range from 6,000 to 8,000 hours in length, or three to four years at 2,000 hours per year. It's a trade with wide usefulness in construction, manufacturing and other industries. Becoming a journeyman welder requires a combination of supervised on-the-job training and courses in the classroom."}, {"url": "http://www.ehow.com/how_8587215_obtain-welding-journeymans-card.html", "passage_text": "Thinkstock/Comstock/Getty Images. Welding journeyman's cards are issued by the United Association (UA.) The UA is a trade union covering welders, plumbers and pipe fitters and HVAC service technicians. You must successfully complete an apprenticeship program to be eligible for a union journeyman's card"}, {"url": "http://work.chron.com/courses-needed-journeyman-welder-5793.html", "passage_text": "School First. Apprenticeship is a common approach to becoming a welder, but it's not the only one. Some welders begin their career with formal classroom instruction at a trade or technical school, then go on to gain work experience. It's a trade with wide usefulness in construction, manufacturing and other industries. Becoming a journeyman welder requires a combination of supervised on-the-job training and courses in the classroom."}, {"url": "http://www.answers.com/Q/How_do_you_become_a_journeyman_welder", "passage_text": "Split and merge into it. Answered by The Community. Making the world better, one answer at a time. To become a journeyman welder a person can go through an apprenticeship program or receive formal training. Individuals can receive training through either a community college or vocational school. "}]