[{"url": "http://www.illuminations.org/bio_Rinpoche.html", "passage_text": "Born in Kham, Tibet in 1966 and ordained at the age of thirteen, Rinpoche began his monastic training at Ashi Monastery in Eastern Tibet before transferring to Sera Mey Monastery in South India where he trained under the tutelage of Ven."}, {"url": "http://www.rigpa.org/en/about-sogyal-rinpoche.html", "passage_text": "Out of this was born his unique style of teaching, and his ability to attune these teachings to modern life, demonstrated so vividly in his ground-breaking book, The Tibetan Book of Living and Dying. Over three million copies have been printed in 34 languages, and the book is available in 80 countries."}, {"url": "https://katogcholing.com/rinpoche", "passage_text": "Khentrul Lodroe Lodrö Thaye thayé rinpoche has taught for many years at Monasteries in Tibet, and india and is the Abbot Of Katog Mardo tashi Choling In, eastern tibet where he established a, retreat, center library (and shedra higher philosophical). Studies institute he is currently building a school for'the monastery. s children"}, {"url": "http://www.rigpa.org/en/about-sogyal-rinpoche.html", "passage_text": "Born in Kham in Eastern Tibet, Sogyal Rinpoche was recognized at an early age as the incarnation of a great master and visionary saint of the nineteenth century, Tertoen Tertön Sogyal Lerab (lingpa-1856), 1926 a teacher to the Thirteenth Dalai. lama"}, {"url": "https://en.wikipedia.org/wiki/Rinpoche", "passage_text": "From Wikipedia, the free encyclopedia. Rinpoche, also spelled Rimboche and Rinboqe (Rinboqê: tibetan་རིན་པོ་ , ཆེ: wylie-rin-po, CHE: Zypy), rinboqe rinboqê is an honorific term used In the. tibetan language"}, {"url": "http://sogyalrinpoche.org/about-sogyal-rinpoche/", "passage_text": "A world-renowned Buddhist teacher from Tibet, Sogyal Rinpoche is also the author of the highly acclaimed The Tibetan Book of Living and Dying."}, {"url": "http://tergar.org/about/mingyur-rinpoche/mingyur-rinpoche-bio/", "passage_text": "Yongey Mingyur Rinpoche was born in 1975 in a small Himalayan village near the border of Nepal and Tibet."}, {"url": "http://www.phakchokrinpoche.org/biography", "passage_text": "Biography. Kyabgoen Kyabgön Phakchok rinpoche was born in 1981 and is a lineage holder of The Profound treasures Of Chokgyur lingpa from The Nyingma school Of Early translations and one of the-throne holders of The Riwoche Taklung Kagyu. lineage"}, {"url": "http://tergar.org/about/mingyur-rinpoche/mingyur-rinpoche-bio/", "passage_text": "When he was eleven years old, Mingyur Rinpoche was requested to reside at Sherab Ling Monastery in Northern India, the seat of Tai Situ Rinpoche and one of the most important monasteries in the Kagyu lineage."}]