[{"url": "http://allnurses.com/new-york-nursing/how-long-does-311597.html", "passage_text": "Jun 20, '08 by shelskyrn2010. New York State require a total of 120 hrs of instructions including 30 hrs of clinical training. I think that it amounts to about 4 weeks in school and 1 week in clinical if you are attending full time or about 8 weeks of you are attending on weekend. I am currently taking the course during the summer since I am free from school. I do not know of any place in NYC where it's free. Cost range from $600 to $800.00. (I think that program is about 6 months long though) This is the website: http://adultednyc.org/. You can also go to your local New york Workforce1 Center and apply for a Indiviual Training Grant of up to $2500 guaranteed!!"}, {"url": "http://allnurses.com/cna-ma-nursing/how-long-is-359608.html", "passage_text": "Different states have different amounts of classroom hours and clinical hours in their requirements. Then, how long the actual class takes depends on how many times you meet a week and for how long. You can finish a CNA class in about 4-6 weeks going almost full time, or spread it out over a semester. The class, regardless of state, will have most of the training in the classroom where you'll be touching on a number of medically-related topic"}, {"url": "http://www.cnatips.com/questions/cna-certificate.php", "passage_text": "Nursing assistant programs vary in length depending on the school or facility offering the training. CNA courses may take anywhere between three to twelve weeks. Once you complete the training you may schedule the nurse aide competency test right away. Candidates who pass the examination become state certified right away and receive the actual certificate in a couple of weeks, usually within one month. I want to take the CNA exam. I have heard that the exam will be using a computer."}, {"url": "http://www.cnaclasses.org/blog/how-long-does-it-take-to-become-a-cna/", "passage_text": "If you are interested in becoming a CNA, then you will probably want to know how long it takes to become a CNA. After all, you cannot simply apply for the job of a CNA. Some CNA training courses can be completed in only a few weeks. These courses are typically fulltime, which means that students attend classes and participate in labs all day long. They go to CNA classes Monday through Friday, and in some cases will also attend classes on the weekend."}, {"url": "https://au.answers.yahoo.com/question/index?qid=20080801175655AArXiB8", "passage_text": "CNAs usually work in hospitals, nursing homes and group homes for the disabled. Some work in home health care and in private homes, but a lot of home care agencies like you to be a Certified Home Health Aide as well in order to do that. Most CNAs get paid $8 - $12 an hour. It is usually a standard 3 credit course and usually takes about 3 weeks to one semester to complete. It doesn't really matter where you take the course, as they're usually quite similar. "}, {"url": "http://www.cnaclasses.org/blog/how-long-does-it-take-to-become-a-cna/", "passage_text": "A Lengthy Curriculum. Some students may wonder why their CNA training takes so much time. After all, 200 to 300 hours is a substantial investment of your time. But there is an excellent reason why CNA training takes so long. It is because CNAs must have great knowledge of the human body and human medicine. Some CNA training courses can be completed in only a few weeks. These courses are typically fulltime, which means that students attend classes and participate in labs all day long. They go to CNA classes Monday through Friday, and in some cases will also attend classes on the weekend."}, {"url": "http://www.howlongdoes.com/health/how-long-does-it-take-to-become-a-cna/", "passage_text": "Concerning how long does it take to become a CNA, After the CNA training courses have been completed the aspirant must sit for the state certification exam held by the government in order to prove that he/she acquired all the skills to become a CNA. For those who are pondering how long does it take to become a CNA, it is sufficient to know that a person can become a CNA in more or less three to four weeks time. The total duration for the course and finally becoming a CNA depends on the type of course that has been chosen by the aspirant. Secondly how long does it take to become a CNA also depends on the speed of the individual for the completion of the courses provided by the training institutes. The more the delay in study the longer it take"}]