[{"url": "http://homeguides.sfgate.com/usda-mortgage-requirements-9607.html", "passage_text": "USDA Section 502 mortgages are aimed at residents in rural areas with populations of 10,000 or fewer. The Department of Agriculture provides two main mortgage programs: Section 502 Direct Loans and Single Family Housing Guaranteed Loans. The requirements for both are similar. "}, {"url": "http://homeguides.sfgate.com/difference-between-usda-loan-fha-loan-35549.html", "passage_text": "USDA home loans usually are restricted to rural areas. Home-loan programs are available from the Federal Housing Administration (FHA) and the United States Department of Agriculture (USDA). While similar in certain respects, there are a number of differences between FHA and USDA home loans. For example, USDA home loans are intended mainly for those living in defined rural areas and are for low-income borrowers."}, {"url": "http://homeguides.sfgate.com/difference-between-usda-loan-fha-loan-35549.html", "passage_text": "The two major USDA loans are the Rural Housing Guaranteed loan program and the Rural Housing Direct loan program. USDA direct home-loan programs are also known as Section 502 loans. Under USDA Section 502 loans, borrowers can purchase, build, renovate, repair or relocate a home within a rural area. While similar in certain respects, there are a number of differences between FHA and USDA home loans. For example, USDA home loans are intended mainly for those living in defined rural areas and are for low-income borrowers."}, {"url": "http://www.usdamortgagesource.com/blog/2010/differences-between-the-usda-guaranteed-home-loan-and-direct-home-loan/", "passage_text": "Since 2008 most 100% financing mortgage programs here in Florida have all but been eliminated. USDA is the only remaining 100% home loan for civilians. USDA does have two different programs – the “ USDA Direct” and “USDA Guaranteed” program. In most cases, the USDA Rural Home Loan is the least expensive loan to obtain and to maintain. Key differences –. USDA Guaranteed Home Loan – This is the most popular option. It allows prospective home buyers to purchase in a rural designated area and has a higher income limitation than the USDA Direct loan. It allows for buyers to have a qualifying income of up to 115% of the area median household income"}, {"url": "http://ficoforums.myfico.com/t5/Mortgage-Loans/Difference-between-the-two-USDA-programs/td-p/385346", "passage_text": "What are the loan differences between the USDA Direct Loan program and the USDA guarantee program. Re: Difference between the two USDA programs. ‎11-20-2008 03:19 PM. The lender for guaranteed loans is a private savings and loan institution, bank, or mortgage company which also handles all the loan servicing. The lender and servicer forthe direct program is USDA RD. Income levels for guaranteed borrowers are capped at 115 percent of the area median income"}, {"url": "http://activerain.com/blogsview/1194085/direct-versus-guaranteed-income-limits-for-usda-rural-housing-loans", "passage_text": "The new 2009 income limits for the USDA Guaranteed Rural Housing (GRH) Program offers an easy to understand 2 tier system. The 1st tier provides an income limit for household sizes of 1-4 persons and the 2nd tier provides an income limit for household sizes of 5-8 persons. The DIRECT USDA Loans are generally reserved for very low income borrowers. GUARANTEED USDA loans are typically underwritten by direct lenders with a “second look”/underwriting review from the local USDA service center. That’s the abbreviated explanation between DIRECT versus GUARANTEED USDA Loans."}, {"url": "http://www.usdamortgagesource.com/blog/2010/differences-between-the-usda-guaranteed-home-loan-and-direct-home-loan/", "passage_text": "Income is the key difference. USDA Direct Loan – Not as common as the Guaranteed USDA Rural Home Loan. The main reason is that they carry very strict income limitations for qualifying applicants. You must have a very low income (80% of the area median household income) in order to qualify. In most cases, the USDA Rural Home Loan is the least expensive loan to obtain and to maintain. Key differences –. USDA Guaranteed Home Loan – This is the most popular option. It allows prospective home buyers to purchase in a rural designated area and has a higher income limitation than the USDA Direct loan. It allows for buyers to have a qualifying income of up to 115% of the area median household income"}, {"url": "http://www.hud.gov/offices/cpd/economicdevelopment/programs/rhed/gateway/pdf/502_GuaranteedLoans.pdf", "passage_text": "Basic Instruction Instruction 1980-D DIFFERENCES BETWEEN THE SECTION 502 GUARANTEED AND DIRECT LOAN PROGRAMS There are several other Section 502 loan programs, but the only one that approaches the guaranteed program in number of loans made is the Homeownership Direct Loan Program. RHS guarantees the loan at 100 percent of the loss for the first 35 percent of the original loan and the remaining 65 percent at 85 percent of loss. Guaranteed Rural Housing Loans (Section 502) 2 The maximum loss payable by RHS cannot exceed 90 percent of the original loan amount."}]