[{"url": "https://en.wikipedia.org/wiki/Complementary_DNA", "passage_text": "In genetics, complementary DNA (cDNA) is double-stranded DNA synthesized from a messenger RNA (mRNA) template in a reaction catalysed by the enzyme reverse transcriptase. cDNA is often used to clone eukaryotic genes in prokaryotes. The term cDNA is also used, typically in a bioinformatics context, to refer to an mRNA transcript's sequence, expressed as DNA bases (GCAT) rather than RNA bases (GCAU)."}, {"url": "http://www.atdbio.com/content/14/Transcription-Translation-and-Replication", "passage_text": "Transcription is the process by which DNA is copied (transcribed) to mRNA, which carries the information needed for protein synthesis. Transcription takes place in two broad steps. First, pre-messenger RNA is formed, with the involvement of RNA polymerase enzymes. "}, {"url": "http://www.maizecdna.org/outreach/mrna.html", "passage_text": "This rule is a simple one: nucleotide A pairs only with T and G only with C. To make mRNA, the coding strand of the DNA double helix is used as the template to polymerize the complementary bases into mRNA: if there is a C in the DNA there will be a G in the mRNA, if a T in the DNA then an A in the RNA, etc. The mRNA product is called the primary transcript, and it is a precise representation of one strand of the DNA template generated using the rules of complementarity -- the same rules used to ensure faithful copying of DNA during DNA replication."}, {"url": "http://hyperphysics.phy-astr.gsu.edu/hbase/Organic/transcription.html", "passage_text": "In the mRNA, Uracil is substituted for thymine as the base complementary to adenine. Since the other strand of the DNA has bases complementary to the template strand, the mRNA has the same sequence of bases at the upper strand of DNA shown above (with U substituted for T) , which is called the coding strand."}, {"url": "https://en.wikipedia.org/wiki/Messenger_RNA", "passage_text": "During transcription, RNA polymerase makes a copy of a gene from the DNA to mRNA as needed. This process is similar in eukaryotes and prokaryotes. Finally, the mRNA is degraded. Messenger RNA (mRNA) is a large family of RNA molecules that convey genetic information from DNA to the ribosome, where they specify the amino acid sequence of the protein products of gene expression."}, {"url": "http://www.nature.com/scitable/topicpage/Translation-DNA-to-mRNA-to-Protein-393", "passage_text": "During transcription, the enzyme RNA polymerase (green) uses DNA as a template to produce a pre-mRNA transcript (pink). The pre-mRNA is processed to form a mature mRNA molecule that can be translated to build the protein molecule (polypeptide) encoded by the original gene. The initiator methionine tRNA is the only aminoacyl-tRNA that can bind in the P site of the ribosome, and the A site is aligned with the second mRNA codon. The ribosome is thus ready to bind the second aminoacyl-tRNA at the A site, which will be joined to the initiator methionine by the first peptide bond (Figure 5)."}, {"url": "https://en.wikipedia.org/wiki/Messenger_RNA", "passage_text": "As in DNA, mRNA genetic information is in the sequence of nucleotides, which are arranged into codons consisting of three bases each. Each codon encodes for a specific amino acid, except the stop codons, which terminate protein synthesis. Finally, the mRNA is degraded. Messenger RNA (mRNA) is a large family of RNA molecules that convey genetic information from DNA to the ribosome, where they specify the amino acid sequence of the protein products of gene expression."}, {"url": "http://www.nature.com/scitable/topicpage/Translation-DNA-to-mRNA-to-Protein-393", "passage_text": "The resulting mRNA is a single-stranded copy of the gene, which next must be translated into a protein molecule. During translation, which is the second major step in gene expression, the mRNA is read according to the genetic code, which relates the DNA sequence to the amino acid sequence in proteins (Figure 2). The initiator methionine tRNA is the only aminoacyl-tRNA that can bind in the P site of the ribosome, and the A site is aligned with the second mRNA codon. The ribosome is thus ready to bind the second aminoacyl-tRNA at the A site, which will be joined to the initiator methionine by the first peptide bond (Figure 5)."}, {"url": "http://www.maizecdna.org/outreach/mrna.html", "passage_text": "To synthesize a protein, the mRNA corresponding to the sense strand of the DNA of a gene is first transcribed from that DNA, and then the mRNA is decoded by translation into a protein. The decoding uses a triplet code of nucleotides to specify individual amino acids. The mRNA product is called the primary transcript, and it is a precise representation of one strand of the DNA template generated using the rules of complementarity -- the same rules used to ensure faithful copying of DNA during DNA replication."}]