[{"url": "http://www.uri.org/kids/world_hind_basi.htm", "passage_text": "How did Hinduism begin? Hinduism or Sanatana Dharma (eternal spiritual path) began about 4000 years ago in India. It was the religion of an ancient people known as the Aryans (noble people) whose philosophy, religion, and customs are recorded in their sacred texts known as the Vedas. "}, {"url": "http://www.answers.com/Q/Where_does_Hinduism_come_from", "passage_text": "The word Hinduism is not to be found anywhere in the scriptures, and the term Hindu was introduced by foreigners who referred to people living across the River Indus or Sindhu, in the north of India, around which the Vedic religion is believed to have originated. Hinduism has its origins in such remote past that it cannot be traced to any one individual. Some scholars believe that Hinduism must have existed even in circa 10000 B.C. and that the earliest of the Hindu scriptures-The Rig Veda-was composed well before 6500 B.C."}, {"url": "https://en.wikipedia.org/wiki/Hinduism", "passage_text": "The word Hindu is derived from the Indo-Aryan / Sanskrit word Sindhu, the Indo-Aryan name for the Indus River in the northwestern part of the Indian subcontinent (modern day Pakistan and Northern India). Hinduism has been called the  oldest religion  in the world, and some practitioners and scholars refer to it as Sanātana Dharma, the eternal law  or the eternal way beyond human origins. Scholars regard Hinduism as a fusion or synthesis of various Indian cultures and traditions, with diverse roots and no founder."}, {"url": "http://www.qcc.cuny.edu/socialsciences/ppecorino/PHIL_of_RELIGION_TEXT/CHAPTER_2_RELIGIONS/Hinduism.htm", "passage_text": "I. Introduction Hinduism, religion that originated in India and is still practiced by most of its inhabitants, as well as by those whose families have migrated from India to other parts of the world (chiefly East Africa, South Africa, Southeast Asia, the East Indies, and England). "}, {"url": "http://hinduism.about.com/od/basics/p/hinduismbasics.htm", "passage_text": "The word Hinduism is not to be found anywhere in the scriptures, and the term Hindu was introduced by foreigners who referred to people living across the River Indus or Sindhu, in the north of India, around which the Vedic religion is believed to have originated. "}, {"url": "http://www.answers.com/Q/Where_was_hinduism_originated", "passage_text": "Answer by Opaco. Confidence votes 23. Hinduism originated in the Indus Valley in India and from the Aryan race. Hinduism formed from the combination of the natives of the Indus Valley and the Aryans, who invaded some time around 3000 BC. The cow being holy is one example of an idea brought by the Aryan race"}, {"url": "https://in.answers.yahoo.com/question/index?qid=20061101090114AAhaeHc", "passage_text": "Report Abuse. According to historians, the origin of Hinduism dates back to 5000 or more years. The word Hindu is derived from the name of River Indus, which flows through northern India. In ancient times the river was called the 'Sindhu', but the Persians who migrated to India called the river 'Hindu', the land 'Hindustan' and its inhabitants 'Hindus'."}, {"url": "http://www.answers.com/Q/Where_does_Hinduism_come_from", "passage_text": "Hinduism originated in ancient India (which was much larger than the India of today) and it originated, most probably, well before 30,000 years ago. Hinduism has its origins in such remote past that it cannot be traced to any one individual. Some scholars believe that Hinduism must have existed even in circa 10000 B.C. and that the earliest of the Hindu scriptures-The Rig Veda-was composed well before 6500 B.C."}, {"url": "http://resources.woodlands-junior.kent.sch.uk/homework/religion/hinduism.htm", "passage_text": "Divali (Diwali) (Festival of Lights). Hinduism is the world's third most popular religion, with around 750 million followers. The religion of Hinduism originated in Northern India, near the river Indus, about 4000 years ago and is the world's oldest existing religion. Hinduism is practised by more than 80% of India's population. "}, {"url": "https://answers.yahoo.com/question/index?qid=20081108073631AAFRcLy", "passage_text": "‘Hindu’ religion or Hinduism is the present day name of an ancient religion that has been present in India for at least seven thousand years (perhaps even longer). Hindu religion is very flexible and tolerant. It gives certain guidelines for moral behavior and expects that a good Hindu will follow them. · Morality proceeds from the inner spirit of man. In Hindu view, one's motive is as important in the performance of an action as the action itself."}]