[{"url": "http://encyclopedia2.thefreedictionary.com/Lycophyte", "passage_text": "Lycopodiophyta. (lī'kōpō'dēŏf`ətə) , division of the plant kingdom consisting of the organisms commonly called club mosses club moss,name generally used for the living species of the class Lycopodiopsida, a primitive subdivision of vascular plants. Lycopodiophyta. (botany). A division of the subkingdom Embryobionta characterized by a dominant independent sporophyte, dichotomously branching roots and stems, a single vascular bundle, and small, simple, spirally arranged leaves."}, {"url": "https://en.wikipedia.org/wiki/Lycopodiophyta", "passage_text": "There are around 1,200 living (extant) species of Lycopodiophyta which are generally divided into three orders (Lycopodiales, Isoetales, and Selaginellales); in addition there are extinct groups. These species reproduce by shedding spores and have macroscopic alternation of generations, although some are homosporous while others are heterosporous. Members of Lycopodiophyta bear a protostele, and the sporophyte generation is dominant. They differ from all other vascular plants in having microphylls, leaves that have only a single vascular trace (vein) rather than the much more complex megaphylls found in ferns and seed plant"}, {"url": "http://www.ucmp.berkeley.edu/plants/lycophyta/lycomm.html", "passage_text": "The arrangement of leaves depends very much on the particular lycophyte in question. Many club mosses have leaves which are attached in a spiral pattern, while in other creeping species the leaves are all oriented in the same plane. In some, the leaves are fused to the stem, giving them the appearance of tiny junipers. A cross section of a member of the order Lycopodiales is shown above. You can see the large red xylem cells because they have been stained with a chemical which sticks to the lignin in the cell walls of that tissue. Notice that there are other kinds of tissues among the xylem."}, {"url": "http://www.thefreedictionary.com/Lycophyta", "passage_text": "Lycophyta-used in some classifications for the class Lycopsida: club mosses. division - (botany) taxonomic unit of plants corresponding to a phylum. kingdom Plantae, plant kingdom, Plantae - (botany) the taxonomic kingdom comprising all living or extinct plants. Microspore morphology of Isoetes species (Lycophyta) from southern ... by Macluf, C. Cecilia; Morbelli, Marta A.; Giudice, Gabriela E. / The Botanical Review."}, {"url": "http://www.thefreedictionary.com/Lycopodiophyta", "passage_text": "Lycophyta-used in some classifications for the class Lycopsida: club mosses. division - (botany) taxonomic unit of plants corresponding to a phylum. kingdom Plantae, plant kingdom, Plantae - (botany) the taxonomic kingdom comprising all living or extinct plants. "}, {"url": "https://en.wikipedia.org/wiki/Lycopodiophyta", "passage_text": "The Division Lycopodiophyta (sometimes called Lycophyta or Lycopods) is a tracheophyte subdivision of the Kingdom Plantae. It is the oldest extant (living) vascular plant division at around 410 million years old. These species reproduce by shedding spores and have macroscopic alternation of generations, although some are homosporous while others are heterosporous. Members of Lycopodiophyta bear a protostele, and the sporophyte generation is dominant. They differ from all other vascular plants in having microphylls, leaves that have only a single vascular trace (vein) rather than the much more complex megaphylls found in ferns and seed plants"}, {"url": "http://encyclopedia2.thefreedictionary.com/Lycophyte", "passage_text": "Click the link for more information. and quillworts. As in other vascular plants, the sporophyte, or spore-producing phase, is the conspicuous generation, and the gametophyte gametophyte, phase of plant life cycles in which the gametes, i.e., egg and sperm, are produced. Lycopodiophyta. (botany). A division of the subkingdom Embryobionta characterized by a dominant independent sporophyte, dichotomously branching roots and stems, a single vascular bundle, and small, simple, spirally arranged leaves."}, {"url": "http://www.ucmp.berkeley.edu/plants/lycophyta/lycomm.html", "passage_text": "Reproductive morphology of the lycophytes. Lycophyte sporangia are stalked and kidney-shaped, as in the zosterophyllophytes. In the earliest lycophyte groups, such as the Asteroxylales, the sporangia are oriented across the leaf, so that the widest dimension of the sporangium is perpendicular to the axis of the leaf. A cross section of a member of the order Lycopodiales is shown above. You can see the large red xylem cells because they have been stained with a chemical which sticks to the lignin in the cell walls of that tissue. Notice that there are other kinds of tissues among the xylem."}, {"url": "http://www.ucmp.berkeley.edu/plants/lycophyta/lycophyta.html", "passage_text": "Club mosses and Scale trees. The lycophytes are a small and inconspicuous group of plants today, but in the Carboniferous some lycophytes were forest-forming trees more than 35 meters tall. Lycophytes are the oldest extant group of vascular plants, and dominated major habitats for 40 million years. "}]