[{"url": "http://animals.nationalgeographic.com/animals/invertebrates/giant-squid/", "passage_text": "Architeuthis dux. In this photo released by Tsunemi Kubodera, a researcher with Japan's National Science Museum, a giant squid attacking a bait squid is pulled up by his research team off the Ogasawara Islands, south of Tokyo, on December 4, 2006. Giant squid, along with their cousin, the colossal squid, have the largest eyes in the animal kingdom, measuring some 10 inches (25 centimeters) in diameter. These massive organs allow them to detect objects in the lightless depths where most other animals would see nothing."}, {"url": "http://www.answers.com/Q/Where_are_giant_squids_located_in_the_world", "passage_text": "Most of them have been found off the coast of Japan. Giant Squids are rare and have been rarely been found anywhere else in the world. If they are anywhere else, we don't know it. "}, {"url": "http://animals.nationalgeographic.com/animals/invertebrates/giant-squid/", "passage_text": "A giant squid's eye can be as big as a beach ball. Size relative to a bus: The giant squid remains largely a mystery to scientists despite being the biggest invertebrate on Earth. The largest of these elusive giants ever found measured 59 feet (18 meters) in length and weighed nearly a ton (900 kilograms). Giant squid, along with their cousin, the colossal squid, have the largest eyes in the animal kingdom, measuring some 10 inches (25 centimeters) in diameter. These massive organs allow them to detect objects in the lightless depths where most other animals would see nothing."}, {"url": "http://ocean.si.edu/giant-squid", "passage_text": "Tsunemi Kubodera of the National Museum of Nature and Science of Japan/AP. Giant squid live up to their name: the largest giant squid ever recorded by scientists was almost 43 feet (13 meters) long, and may have weighed nearly a ton. The Smithsonian doesn't just house giant squid; scientists at the Smithsonian’s National Museum of Natural History are building a National Cephalopod Collection. It already totals about 200,000 preserved specimens collected worldwide—including the most diverse collection of squids found in the world."}, {"url": "https://aboutgiantsquid.wordpress.com/location/", "passage_text": "Giant squid thrive in a widespread habitat; they have been found in every ocean. Coastal and island slopes from the North Atlantic Ocean are main areas where species of Architeuthis have been found, especially Newfoundland, Norway, the northern British Isles, Spain and the oceanic islands of the Azores and Madeira. They are also found in the South Atlantic Ocean by southern Africa, the North Pacific Ocean around Japan, and the Southwestern Pacific Ocean around New Zealand and Australia. Vertically, it is unknown where the giant squid lives in terms of depth."}, {"url": "http://news.nationalgeographic.com/news/2014/01/140110-giant-squid-picture-hoax-ocean-animal-science/", "passage_text": "The largest giant squid recorded by scientists measured 43 feet (12 meters) long, according to Smithsonian's National Museum of Natural History. By Jane J. Lee, National Geographic. PUBLISHED. Faked photo of a giant squid supposedly found In California. Faked photo of a giant squid supposedly found In California. Screenshot from Lightly Braised Turnip, www.lightlybraisedturnip.com. An image of a monster 160-foot-long (49-meter-long) giant squid made the social media rounds yesterday, but fear not—it's a hoax."}, {"url": "https://en.wikipedia.org/wiki/Colossal_squid", "passage_text": "Unlike the giant squid, whose arms and tentacles only have suckers lined with small teeth, the colossal squid's limbs are also equipped with sharp hooks: some swivelling, others three-pointed. Its body is wider and stouter, and therefore heavier, than that of the giant squid. "}, {"url": "http://www.inquisitr.com/2094849/giant-squid-new-zealand-sea-monsters-death-a-mystery-photo/", "passage_text": "But they also have a giant squid from 2013 they are using as a comparison. In a related report by the Inquisitr, in New Zealand, a rare oarfish was found and photographed without anyone realizing how amazing their find really was until after the fact. Back in 2013, the unexpected discovery of one of New Zealand’s giant squids was made by Jack and Sharon Osikai, who found the sea monster while vacationing in Kaikoura. They say they were returning from a fishing trip when they saw the giant squid floating off the coast near Shark’s Tooth."}, {"url": "http://www.huffingtonpost.com/2013/10/04/giant-squid-washes-ashore_n_4044480.html", "passage_text": "This giant squid called Architeuthis dux and measuring 30 feet long washed ashore in the Spanish community of Cantabria on Oct. 1, 2013. It was shining and so beautiful, team leader Tsunemi Kubodera, a zoologist at Japan's National Museum of Nature and Science, told AFP at the time. "}]