[{"url": "http://www.bhg.com/home-improvement/deck/building/budgeting-for-a-new-deck/", "passage_text": "1 Hiring someone to do the work for you makes your total cost in the range of $3,500. 2  You can buy the materials for a 12-foot-square redwood deck off the second floor, with a flight of steps leading to the ground, for about $6,000 and build it yourself. 1 Doing it yourself, you can build an 8x10-foot ground-level deck from treated lumber for about $500 in materials. 2  Having a contractor build it for you raises the price to $1,500. 3  You could build a treated-lumber raised deck, say 10x16 feet, for about $1,"}, {"url": "http://home.costhelper.com/redwood-deck.html", "passage_text": "1 A redwood deck can cost $30-$75 or more a square foot ($9,600-$24,000 for a 16'x20' deck), depending on the quality of the lumber, project complexity, and whether construction is by casual labor or a licensed contractor. 1 annually ($0.25-$1.50 or more a square foot) and might require sealing ($1-$5 a square foot) every 1-2 years, depending on its exposure to sunlight and weather. 2  The California Redwood Association offers a photo gallery of redwood decks and printable deck project plans, and lists it redwood-producer members."}, {"url": "http://www.homeadvisor.com/cost/decks-and-porches/", "passage_text": "Decking Prices. Once you determine what kind of decking materials you'll need to build the structure, it's time to get down to price. While the average cost to build a deck averages between $4,000 and $10,000, that doesn't account for the materials. Here is the average cost of each decking material, broken down by average price range per board: It's important to know what board sizes you'll need to purchase for your deck. The cost to construct a deck varies depending on the material used. Some of those prices include: These prices will vary by square footage and whether you have other features added to your deck that involve more materials. Learn more about decking materials and which one is right for you in the section below."}, {"url": "http://rempros.com/costs/building_deck_prices.html", "passage_text": "Average cost to build a deck includes total expenses for labor and materials for basic deck construction. Difference in cost indicates you savings or how much more you should expect to pay in percentage equivalent for building a certain type of a deck based on materials used in comparison with cedar or redwood deck. $19.0 - $36.0. $37.0 - $71.0. Cost of materials estimated as a charge per square foot in the case a contractor will purchase and supply all necessary materials at his own discretion to build a standard deck."}, {"url": "https://www.homedecks.com/redwood.php", "passage_text": "Construction cost including materials is usually in line with a Cedar built deck. Approximate cost are $18.00 - $25.00 for Construction Heart Redwood. $23.00 - $35.00 for Clear Redwood. "}, {"url": "http://home.costhelper.com/redwood-deck.html", "passage_text": "1 Because redwood is so expensive ($15-$25 and more a square foot for deck materials), building a redwood deck is no longer a common do-it-yourself project. 1 annually ($0.25-$1.50 or more a square foot) and might require sealing ($1-$5 a square foot) every 1-2 years, depending on its exposure to sunlight and weather. 2  The California Redwood Association offers a photo gallery of redwood decks and printable deck project plans, and lists it redwood-producer members."}, {"url": "http://home.costhelper.com/redwood-deck.html", "passage_text": "What should be included: 1  A redwood deck can cost $30-$75 or more a square foot ($9,600-$24,000 for a 16'x20' deck), depending on the quality of the lumber, project complexity, and whether construction is by casual labor or a licensed contractor. 1 annually ($0.25-$1.50 or more a square foot) and might require sealing ($1-$5 a square foot) every 1-2 years, depending on its exposure to sunlight and weather. 2  The California Redwood Association offers a photo gallery of redwood decks and printable deck project plans, and lists it redwood-producer members."}, {"url": "http://www.improvenet.com/r/costs-and-prices/wood-deck-estimator", "passage_text": "Those who opt for cedar for their decks should be careful to choose the heartwood type, which is more durable than construction-grade cedar. The average cost of cedar decking is $3.75 per square foot. Redwood is typically the most expensive material used for installing a wood deck, averaging $7.75 per square foot. Deck Size. The size of the deck chosen can have a large influence on its overall cost. The average size of a deck is around 12 x 20 feet, but larger decks are becoming increasingly popular as well, but because they require more materials and more time to build, they can be quite expensive."}, {"url": "http://home.costhelper.com/deck.html", "passage_text": "1 Wood is the most traditional, common and easily available material for decks; it is typically easier to work with than composite materials. 2  Composite deck installation can cost $25-$70 or more a square foot (8,000 -$22,400 for 16'x20). Home Depot Cost of Materials today $1478.98 Lowes Cost of Materials today $1492.56 Local lumber supplier Cost of Materials today $1704.54 that comes out to $11.11 per square foot on an average cost of $1600.00 for materials. if it takes me and my three guys 2 1/2 - 3 days with footings."}, {"url": "http://home.costhelper.com/redwood-deck.html", "passage_text": "Typical costs: 1  A redwood deck can cost $30-$75 or more a square foot ($9,600-$24,000 for a 16'x20' deck), depending on the quality of the lumber, project complexity, and whether construction is by casual labor or a licensed contractor. 1 annually ($0.25-$1.50 or more a square foot) and might require sealing ($1-$5 a square foot) every 1-2 years, depending on its exposure to sunlight and weather. 2  The California Redwood Association offers a photo gallery of redwood decks and printable deck project plans, and lists it redwood-producer members."}]