[{"url": "http://explorehealthcareers.org/en/Career/29/Diagnostic_Medical_Sonographer", "passage_text": "Two-year programs are most prevalent. Look for a program that is accredited by the Commission on Accreditation of Allied Health Education Programs (CAAHEP) . For information on how to become a registered diagnostic medical sonographer, see the American Registry for Diagnostic Medical Sonography."}, {"url": "http://study.com/articles/How_to_Become_a_Diagnostic_Medical_Sonographer.html", "passage_text": "Learn how to become a diagnostic medical sonographer. Research the job description, education and licensing requirements to find out how to start a career in medical sonography."}, {"url": "http://work.chron.com/long-become-ultrasound-technician-5446.html", "passage_text": "The Bureau of Labor Statistics reported an average income of $65,800 per year for sonographers, as of May 2011. The lowest-earning 25 percent reported incomes of up to $58,830 per year, while the highest-earning 25 percent earned $76,060 a year or more."}, {"url": "http://study.com/articles/How_to_Become_a_Diagnostic_Medical_Sonographer.html", "passage_text": "Through the American Registry for Diagnostic Medical Sonography (ARDMS), sonographers can also pursue certification, such as the registered diagnostic medical sonographer (RDMS), registered diagnostic cardiac sonographer (RDCS), registered vascular technologist (RVT) or registered in musculoskeletal (RMSK)."}, {"url": "http://ultrasoundtechnicianexpert.com/", "passage_text": "An ultrasound technician is a very valuable job in the world of health care. Also called a diagnostic medical sonographer, an ultrasound tech uses special machines and equipment that operate on sound waves to determine or diagnose medical problems for patients."}, {"url": "http://explorehealthcareers.org/en/Career/29/Diagnostic_Medical_Sonographer", "passage_text": "Most full-time sonographers work about 37 hours a week; they may have evening and weekend hours and times when they are on call and must be ready to report to work on short notice. Diagnostic medical sonographers earn a median salary of $64,380 per year, according to the U.S. Department of Labor in 2010."}, {"url": "http://study.com/articles/How_to_Become_a_Diagnostic_Medical_Sonographer.html", "passage_text": "Diagnostic medical sonographers must complete 24 continuing education credits every two years to remain certified. To maintain ARDMS credentials, sonographers must earn at least 30 continuing medical education (CME) credits in a 3-year period and pay an annual renewal fee."}, {"url": "http://ultrasoundtechnicianexpert.com/", "passage_text": "Most sonographers take a two or four year college program to become accredited or they learn in-house on the job. If you have a degree in nursing, for example, you might be offered the chance to learn ultrasound technology as well. This is a wonderful way to increase your pay and your resume."}, {"url": "http://www.ultrasoundschoolsinfo.com/bachelors-degree/", "passage_text": "Yes. Completing a program that equates to a four year degree in ultrasound will make you more specialized, qualified and more competitive for both entry-level and advanced sonographer positions. In 2013, the median salary for diagnostic medical sonographers was $66,410 per year, according to the BLS. However, the top 10% of sonographers made more than $88,000 annually. By upgrading your education, experience and job title, you can become a part of this top 10%."}]