[{"url": "http://www.scsc.k12.in.us/SMS/Teachers/Martin/chloroplast.htm", "passage_text": "Located in plant cells are large irregular shaped green structures called chloroplasts. They are green because they contain a green pigment called chlorophyll. Chlorophyll captures the energy of sunlight which can be used to help produce food for the plant cell."}, {"url": "http://newalrayyan.wikispaces.com/file/view/Chloroplasts+and+Mitochondria+answers.docx", "passage_text": "Chloroplasts are double membrane organelles with a smooth outer membrane and an inner membrane folded into disc-shaped sacs called. thylakoids. . Color and label. the outer membrane light green. Thylakoids, containing chlorophyll and other. accessory pigments. (red, orange, yellow, brown). , are in stacks called."}, {"url": "http://www.warrencountyschools.org/userfiles/2623/Classes/10683/Chloroplast%20Structure2.pdf", "passage_text": "Chloroplasts are double membrane organelles with a smooth outer membrane and an inner. membrane folded into disc-shaped sacs called thylakoids. Color and label the outer membrane light green. Pigments are molecules that capture light. Thylakoids, containing they pigment green pigment chlorophyll and other accessory pigments (red, orange, yellow, brown) , are in stacks called granum (grana, plural)."}, {"url": "http://www.warrencountyschools.org/userfiles/2623/Classes/10683/Chloroplast%20Structure2.pdf", "passage_text": "Chloroplast Structure BIG IDEA: Plant cells and some algae contain an organelle called the chloroplast. The chloroplast allows plants to harvest energy from sunlight to carry on a process known as Photosynthesis."}, {"url": "http://salem.k12.va.us/staff/jwright/CellPartsandOrganelleFunctions.htm", "passage_text": "This process is called photosynthesis. Cytoplasm is the gel-like material inside the cell membrane and. outside the nucleus. Cytoplasm contains a large amount of water and many chemicals. and structures that carry out the life processes in the cell. These. structures that the cytoplasm contains are called organelles."}, {"url": "http://biology.about.com/od/plantbiology/ss/chloroplast.htm", "passage_text": "A chloroplast is a type of plant cell organelle known as a plastid. Plastids assist in storing and harvesting needed substances for energy production. A chloroplast contains a green pigment called chlorophyll, which absorbs light energy for photosynthesis. Hence, the name chloroplast indicates that these structures are chlorophyll containing plastids."}]