[{"url": "http://www.travelmath.com/cities-near/Kangaroo+Island", "passage_text": "Major cities near Kangaroo Island. This is a list of large cities closest to Kangaroo Island. A big city usually has a population of at least 200,000 and you can often fly into a major airport. If you need to book a flight, search for the nearest airport to Kangaroo Island. 1  735 km to Melbourne, Australia. 2  1084 km to Canberra, Australia. Travelmath helps you find cities close to your location. You can use it to look for nearby towns and suburbs if you live in a metropolis area, or you can search for cities near any airport, zip code, or tourist landmark. You'll get a map of the local cities, including the distance and information on each town"}, {"url": "https://www.expedia.com/Kangaroo-Island-Hotels.d181687.Travel-Guide-Hotels", "passage_text": "Locals also like to book rooms at the 4-star Aurora Ozone Hotel, 3.5-star Mercure Kangaroo Island Lodge, and 4-star Kangaroo Island Seafront. Kangaroo Island Seaside Inn scores an average of 4.12 out of 5 based on 25 guest reviews, and is particularly popular with folks traveling with their families. Featuring an average guest rating of 5, Birubi Holiday Homes is also worth a look. false."}, {"url": "https://www.expedia.com/Kangaroo-Island-Hotels.d181687.Travel-Guide-Hotels", "passage_text": "If you want to know the best places to stay, why not ask the locals? One popular choice among local travelers is the 4-star Kangaroo Island Wilderness Retreat. Kangaroo Island Seaside Inn scores an average of 4.12 out of 5 based on 25 guest reviews, and is particularly popular with folks traveling with their families. Featuring an average guest rating of 5, Birubi Holiday Homes is also worth a look. false."}, {"url": "http://www.travelmath.com/nearest-airport/Kangaroo+Island", "passage_text": "Nearest major airport to Kangaroo Island: The closest major airport to Kangaroo Island is Kingscote Airport (KGC / YKSC). This airport is in Kingscote, Australia and is 31 km from the center of Kangaroo Island. If you're looking for domestic flights to KGC, check the airlines that fly to KGC. Search for direct flights from your hometown and find hotels near Kangaroo Island, or scroll down for more international airports or domestic airports. You can also browse local airports if you're a pilot"}, {"url": "https://www.expedia.com.au/Kangaroo-Island-Hotels.d181687.Travel-Guide-Hotels", "passage_text": "There is perhaps no better way to take in the city than by staying at an ideally located Kangaroo Island accommodation. Browse the best Kangaroo Island hotels right here at Expedia.com.au. Regardless of your budget or preferred style of accommodation, there is a hotel or motel to meet your fancy. Use our map to find a Kangaroo Island hotel in the location you prefer, and filter local hotels by theme, brand, or amenities. When you book cheap hotels in Kangaroo Island, Australia here on Expedia.com.au, you are always protected by the Price Match Guarantee. CollapseExpand"}, {"url": "http://www.tourkangarooisland.com.au/about", "passage_text": "By Air... Kangaroo Island is also serviced daily by air. The 30 minute flight operates between the main terminal at the Adelaide Airport and Kingscote KI Airport (which is located 14 kilometres from Kingscote; the main township on KI). being updated. A Big Island-As the third largest island off the coast of mainland Australia, Kangaroo Island is more than a day-trip destination. At 155 kilometres long and up to 55 kilometres wide, it covers an area of 4,416 square kilometres."}, {"url": "http://www.tourkangarooisland.com.au/about", "passage_text": "Tours enable you to sit back and allow someone else to do the driving, and your guide can provide great Kangaroo Island knowledge. Coach tours are available or, alternatively, more personalised four-wheel drive tours. Most tours will pick-up from your accommodation, ferry terminal or the airport. A Big Island-As the third largest island off the coast of mainland Australia, Kangaroo Island is more than a day-trip destination. At 155 kilometres long and up to 55 kilometres wide, it covers an area of 4,416 square kilometres."}]