[{"url": "http://www.inquisitr.com/1997163/kristen-taekman-and-heather-thomson-rhony-is-better-without-fame-hungry-aviva-drescher/", "passage_text": "Kristen Taekman and Heather Thomson are glad that Aviva Drescher is gone from The Real Housewives of New York City. In a video interview with Wetpaint Entertainment, posted on Thursday morning, Kristen and Heather said that the show is better off without Aviva on it."}, {"url": "http://www.inquisitr.com/2194482/kristen-taekman-fired-from-rhony-latest-casualty-in-housewives-shakeup/", "passage_text": "Of course, Taekman may not care to come back to the show if Frankel is returning for another season. After last week’s episode, the RHONY star took to her Bravo blog to express her frustration with Bethenny Frankel’s behavior."}, {"url": "http://www.bravotv.com/the-daily-dish/kristen-taekman-11-fun-facts-about-rhonys-new-star", "passage_text": "On the upcoming season of The Real Housewives of New York City, the ladies will be joined by a new face: Kristen Taekman. Born in Connecticut and a working model since age 16, she is a mother of two children (Cash, 5, and Kingsley, 2) and happily married to her husband of ten years, Josh."}, {"url": "http://www.inquisitr.com/1997163/kristen-taekman-and-heather-thomson-rhony-is-better-without-fame-hungry-aviva-drescher/", "passage_text": "Heather, with Kristen in agreement, speculated that Aviva went on that show because she wasn’t coming back to The Real Housewives of New York City and she wanted to still be on television. The two added that neither of them, nor Carole Radziwill, have had any contact with Aviva since she left the show."}, {"url": "http://www.inquisitr.com/2194482/kristen-taekman-fired-from-rhony-latest-casualty-in-housewives-shakeup/", "passage_text": "According to a Page Six report on Monday, Taekman will likely not be asked to return not only because her storyline falls flat, but also because she is on the outs with Bethenny Frankel, who was brought back to re-energize the show. A source tells Page Six, the Skinnygirl mogul wants Kristen gone."}, {"url": "http://okmagazine.com/meet-the-stars/ok-exclusive-rhony-star-kristen-taekman-opens-up-about-what-you-dont-know-about-her-marriage/", "passage_text": "Part one of the Real Housewives of New York reunion airs tonight at 9/8c on Bravo. Come back next week for more of OKMagazine.com‘s exclusive interview with Kristen Taekman, where she talks about her decision to join RHONY—and what you didn’t see on camera this season!"}, {"url": "http://www.inquisitr.com/2194482/kristen-taekman-fired-from-rhony-latest-casualty-in-housewives-shakeup/", "passage_text": "Kristen Taekman joined the Real Housewives of New York for its sixth season. A central theme of her story line last season was her marital issues; however, as the Inquisitr previously reported, Kristen and her husband banned cameras from filming their marriage problems for the show’s current seventh season."}, {"url": "http://www.fashionnstyle.com/articles/66289/20150623/kristen-taekman-fired-rhony-new-rumors-bethenny-frankel-kristen-show.htm", "passage_text": "Kristen Taekman may have made a real enemy in Bethenny Frankel, and if the latest rumors are true then she may be regretting her latest feud when season eight of Real Housewives of New York City rolls around. It's no secret that Kristen and Bethenny don't see eye-to-eye."}]