[{"url": "http://www.answers.com/Q/The_manufacture_of_RNA_from_DNA_is_called", "passage_text": "When RNA's base sequence is used to determine the base sequence of a new strand of DNA, that is called reverse transcription. This is because the process is the reverse of tr … anscription, which involves copying the base sequence of DNA to form RNA, including messenger RNA (mRNA). Answered. In Biology. "}, {"url": "http://biology.about.com/od/cellularprocesses/ss/Dna-Transcription.htm", "passage_text": "This process is called translation. Proteins can be manufactured in large quantities because a single DNA sequence can be transcribed by many RNA polymerase molecules at once. DNA transcription is a process that involves transcribing genetic information from DNA to RNA. The transcribed DNA message, or RNA transcript, is used to produce proteins. DNA is housed within the nucleus of our cells. It controls cellular activity by coding for the production of proteins."}, {"url": "http://www.nature.com/scitable/topicpage/Translation-DNA-to-mRNA-to-Protein-393", "passage_text": "In the simplest sense, expressing a gene means manufacturing its corresponding protein, and this multilayered process has two major steps. In the first step, the information in DNA is transferred to a messenger RNA (mRNA) molecule by way of a process called transcription. "}, {"url": "http://hyperphysics.phy-astr.gsu.edu/hbase/Organic/dna.html", "passage_text": "It is the repository for the hereditary information. DNA accomplishes protein production by first providing a pattern for the production of mRNA, a process called transcription. The RNA then contains the information from the DNA to manufacture a protein, a process called translation. Some proteins are structural, but some are control proteins called enzymes. These enzymes are employed in the production of proteins, even copies of themselves, so enzymes are used to make other enzymes. "}, {"url": "http://ghr.nlm.nih.gov/handbook/howgeneswork/makingprotein", "passage_text": "Most genes contain the information needed to make functional molecules called proteins. (A few genes produce other molecules that help the cell assemble proteins.) The journey from gene to protein is complex and tightly controlled within each cell. It consists of two major steps: transcription and translation. Together, transcription and translation are known as gene expression. During the process of transcription, the information stored in a gene’s DNA is transferred to a similar molecule called RNA (ribonucleic acid) in the cell nucleu"}, {"url": "http://smart-therapeutics.com/Technology/RNAs-Role-in-Protein-Synthesis", "passage_text": "Overview. Protein synthesis is the process by which cells build or manufacture proteins. It refers to a multi-step process through which information is transferred from DNA to RNA and then from RNA to proteins. The flow of information from DNA to RNA to proteins is one of the fundamental principles of molecular biology. It is so important that it is sometimes called the central dogma.. Protein synthesis requires a technical machinery of high complexity. There are three primary types of RNA involved in protein synthesis: messenger RNA, transfer RNA and ribosomal RNA. Messenger RNA. Whereas most types of RNA are the final products of their genes, messenger RNA (mRNA) is an intermediate in the information transfer process."}, {"url": "http://www.sparknotes.com/testprep/books/sat2/biology/chapter6section2.rhtml", "passage_text": "By controlling protein synthesis, DNA is hugely important in directing life. Protein synthesis is a two-step process. DNA resides in the nucleus, but proteins are made in the cytoplasm. The cell copies the information held in DNA onto RNA molecules in a process called transcription. Proteins are synthesized at the ribosomes from the codes in RNA in a process called translation. Before getting into the way that the information on DNA can be transcribed and then translated into protein, we have to spend some time studying the major players in the process: DNA and RNA. "}, {"url": "http://www.nature.com/scitable/topicpage/The-Information-in-DNA-Is-Decoded-by-6524808", "passage_text": "In other cases, the RNA molecule carries messages from the DNA to other parts of the cell for processing. Most often, this information is used to manufacture proteins. The specific type of RNA that carries the information stored in DNA to other areas of the cell is called messenger RNA, or mRNA. Transcription begins when an enzyme called RNA polymerase attaches to the DNA template strand and begins assembling a new chain of nucleotides to produce a complementary RNA strand. There are multiple types of types of RNA. In eukaryotes, there are multiple types of RNA polymerase which make the various types of RNA. As the RNA polymerase continues down the strand of DNA, more nucleotides are added to the mRNA, thereby forming a progressively longer chain of nucleotides (Figure 2). This process is called elongation. Three of the four nitrogenous bases that make up RNA — adenine (A), cytosine (C), and guanine (G) — are also found in DNA. In RNA, however, a base called uracil (U) replaces thymine (T) as the complementary nucleotide to adenine (Figure 3)"}]