[{"url": "http://www.uwo.ca/english/canadianpoetry/cpjrn/vol39/ross_imagism.htm", "passage_text": "It is Hulme, and not another Imagist, who makes the Canadian connection; and it is Hulme, and not a historian of Imagism, who conceived Imagism as Impressionism in verse. Because light and atmosphere, not boats and buildings, were the Impressionists real subjects, they were first and foremost painters of nature. In his Introduction to The Imagist Poem, William Pratt links Imagism to Impressionism, and any handbook of literature will affirm, though not explain, this connection."}, {"url": "http://poetry.about.com/od/poeticschools/a/Imagism.htm", "passage_text": "The first anthology of Imagist poets, Des Imagistes, was edited by Ezra Pound and published in 1914, presenting poems by Pound, H.D., and Aldington, as well as F.S. Flint, Skipwith Cannell, Amy Lowell, William Carlos Williams, James Joyce, Ford Madox Ford, Allen Upward and John Cournos. The Three Tenets of Imagism. In the March 1913 issue of Poetry, there appeared a “note” entitled “Imagisme ,” signed by one F.S. Flint, offering this description of the “Imagistes”:"}, {"url": "http://mypoeticside.com/poets/hilda-doolittle-poems", "passage_text": "H. D. — that’s how most of us know her. Hilda Doolittle was many things: poet, novelist and editor. She was a promoter of the ‘imagist’ model of poetry, which encouraged the use of common speech, idioms and free usage of rhymes. She was a contemporary of such avant-garde writers as Richard Ardington and Ezra Pound"}, {"url": "http://poetry.about.com/od/poeticschools/a/Imagism.htm", "passage_text": "F.S. Flint was a real person, a poet and critic who championed free verse and some of the poetic ideas associated with Imagism before the publication of this little essay, but Ezra Pound later claimed that he, Hilda Doolittle (H.D.) and her husband Richard Aldington had actually written the “note” on Imagism. The Three Tenets of Imagism. In the March 1913 issue of Poetry, there appeared a “note” entitled “Imagisme ,” signed by one F.S. Flint, offering this description of the “Imagistes”:"}, {"url": "http://www.poemhunter.com/hilda-doolittle/biography/", "passage_text": "The early models for the Imagist group were from Japan, and H.D. often visited the exclusive Print Room at the British Museum in the company of Richard Aldington and the curator and poet Laurence Binyon in order to examine Nishiki-e prints that incorporated traditional Japanese verse. Career. Early life. Hilda Doolittle was born into the Moravian community in Bethlehem in Pennsylvania's Lehigh Valley. Her father, Charles Doolittle, was professor of astronomy at Lehigh University and her mother, Helen (Wolle), was a Moravian with a strong interest in music."}, {"url": "http://schools-wikipedia.org/wp/i/Imagism.htm", "passage_text": "Rene Taupin remarked that 'It is more accurate to consider Imagism not as a doctrine, nor even as a poetic school, but as the association of a few poets who were for a certain time in agreement on a small number of important principles'. Somewhat unusually for the time, a number of women writers were major Imagist figures. A characteristic feature of Imagism is its attempt to isolate a single image to reveal its essence. This feature mirrors contemporary developments in avant-garde art, especially Cubism."}, {"url": "http://poetry.about.com/od/poeticschools/a/Imagism.htm", "passage_text": "In the preface to the first of these, she offered her own outline of the principles of Imagism: 1  To use the language of common speech, but to employ always the exact word, not the nearly-exact, nor the merely decorative word. The Three Tenets of Imagism. In the March 1913 issue of Poetry, there appeared a “note” entitled “Imagisme ,” signed by one F.S. Flint, offering this description of the “Imagistes”:"}, {"url": "http://schools-wikipedia.org/wp/i/Imagism.htm", "passage_text": "The Imagist group was centered in London, with members from Great Britain, Ireland and the United States. Somewhat unusually for the time, a number of women writers were major Imagist figures. A characteristic feature of Imagism is its attempt to isolate a single image to reveal its essence. This feature mirrors contemporary developments in avant-garde art, especially Cubism."}]