[{"url": "http://www.livestrong.com/article/517688-what-can-cause-severe-pain-with-fatty-liver-disease/", "passage_text": "Cirrhosis is not usually characterized by severe or sharp pain. If you suffer from fatty liver disease or cirrhosis and experience any of these symptoms, or intense or shooting pain in the area, see your doctor."}, {"url": "http://www.livestrong.com/article/504158-does-fatty-liver-disease-cause-severe-pain-muscle-spasms/", "passage_text": "Fatty liver disease generally doesn't cause major -- or even noticeable -- symptoms. However, if the disease progresses to cirrhosis of the liver, the damage done to your liver could cause severe abdominal pain and muscle spasms."}, {"url": "http://byebyedoctor.com/liver-pain-symptoms-location-causes-and-treatment/", "passage_text": "Liver Pain Symptoms. There are many causes of pain of the liver and one of them is caused as a common byproduct of alcoholism, and may also be a indication of cirrhosis which is the damaging of the liver caused by chronic disease of the liver. Cirrhosis is one of the 2 most common reasons for pain in"}, {"url": "http://www.allhealthsite.com/liver-pain-location-causes-symptoms-and-treatment.html", "passage_text": "You can have many different forms of liver pain in your life such as: 1  fatty liver pain, 2  liver cancer pain, 3  cirrhosis or. 4  other chronic conditions or. 5  acute diseases of liver."}, {"url": "http://www.healthgrades.com/symptoms/liver-pain", "passage_text": "A number of disorders can cause right upper quadrant, or liver, pain. Causes of pain originating in the liver itself include chronic hepatitis (liver inflammation), fatty liver disease, liver abscess, and liver cancer."}, {"url": "https://www.sharecare.com/health/gallstones/what-are-symptoms-of-gallstones", "passage_text": "Gallstones, caused by the crystallization of excess cholesterol in the bile, often have no symptoms at all. But they can cause sharp, shooting pain in the upper right of the abdomen. This pain can last from a few minutes to 12 hours. Often, this pain can occur after a heavy meal."}, {"url": "http://www.livestrong.com/article/517688-what-can-cause-severe-pain-with-fatty-liver-disease/", "passage_text": "Fatty liver disease may be asymptomatic or mildly uncomfortable. However, it can cause more severe discomfort and other problems if left untreated. If you experience intense pain, or pain accompanied by fever and vomiting, the disease may have progressed, or there may be another condition present."}, {"url": "http://www.healthgrades.com/symptoms/liver-pain", "passage_text": "Liver pain may be confused with a more general abdominal pain, unless it occurs specifically in the upper right abdomen. Even then, right upper quadrant pain can be due to gallstones, intestinal pain, pancreatitis, or other abdominal disorders."}]