[{"url": "http://www.eater.com/2015/4/10/8384255/everything-youve-always-wanted-to-know-about-ramps", "passage_text": "Ramps are not leeks, nor are they scallions, nor are they exactly shallots. Ramps (which are sometimes called wild leeks or spring onions, adding to the confusion) look like scallions, but they're smaller and slightly more delicate, and have one or two flat, broad leaves. You know, ramps: those cute, terribly en vogue little vegetables with the slightly unappealing name, that appear on every hip restaurateur's menu, and whose very presence has been known to incite riots at farmers' markets."}, {"url": "http://ezinearticles.com/?Ramps---The-Trendy-New-Vegetable-For-2010&id=4659318", "passage_text": "Ramps, which are also called wild leeks, are native to North America. They are a kind of onion; the bulb looks like a scallion but the plant also has big flat leaves. The name comes from the Elizabethan word ramson or rams which means wild garlic. Recipe for Ramps with Scalloped Potatoes. What you will need: How to make it: 1  3 cups ramps or wild leeks. 2  3/4 cup heavy cream. 3  6 cups sliced potatoes. 4  1 1/2 cups grated cheddar cheese. 5  1/2 cup chicken broth. 6  Salt and black pepper, as needed."}, {"url": "https://en.wikipedia.org/wiki/Allium_tricoccum", "passage_text": "Allium tricoccum is a bulb-forming perennial with broad, smooth, light green leaves, often with deep purple or burgundy tints on the lower stems, and a scallion-like stalk and bulb. Allium tricoccum is popular in the cuisines of the rural uplands of its native region. It is regarded as an early spring vegetable with a strong garlic-like odor and a pronounced onion flavor. Ramps also have a growing popularity in restaurants throughout North America."}, {"url": "http://www.huffingtonpost.com/2015/04/24/what-are-ramps_n_7128438.html", "passage_text": "Here's the short answer: ramps are a wild onion that grow during the spring in Eastern Canada and the U.S. They're sometimes referred to as wild leeks, and taste like a balanced mixture of garlic and onion. They're pungent, to say the very least. "}, {"url": "http://gardening.about.com/od/vegetables/p/Growing-Ramps-In-The-Vegetable-Garden.htm", "passage_text": "Ramps, or wild leeks, are a native plant found growing in moist woodlands of the Appalachian mountain range, in eastern North America. The appear in early spring and many areas used to celebrate their arrival as the first cooking green of spring, with festivals. "}, {"url": "http://www.eater.com/2015/4/10/8384255/everything-youve-always-wanted-to-know-about-ramps", "passage_text": "Spring has sprung, and that means ramp season is officially in full swing. You know, ramps: those cute, terribly en vogue little vegetables with the slightly unappealing name, that appear on every hip restaurateur's menu, and whose very presence has been known to incite riots at farmers' markets."}, {"url": "http://www.huffingtonpost.com/2015/04/10/ramp-recipes_n_1428780.html", "passage_text": "Allium tricoccum-Wikipedia, the free encyclopedia. Ramps and Wild Leeks-Recipes and Facts. Ramps Have Arrived! Celebrate With This Ramp Pesto Recipe. Ramp Festivals, Feast of the Ramson, Wild ramps and leeks is what ... They are beautiful. And they can be used in a number of ways, cooked or raw, just like onions. Ramps are great made into a pesto and smothered on just about everything. They're lovely in spring soups paired with spring's other darling, asparagus. And they even make a mean biscuit."}, {"url": "http://www.gracelinks.org/2255/real-food-right-now-and-how-to-cook-it-ramps", "passage_text": "Ramps are definitely delicious — a peppery and pungent cross between onion and garlic — and their ephemeral nature adds to their appeal. Just think, after a long winter, when you're down to dinged up apples, sad looking squash and root vegetables, ramps are the first herald of spring. It's a joyous sight. "}, {"url": "http://www.marxfoods.com/fresh-ramps", "passage_text": "Origin: Ramps (aka wild leeks, wild spring onions, ramson, wild garlic or ail sauvage) are a wild member of the onion family with a delightful flavor evoking both green onions and garlic as well as a pungent garlicky aroma. Ramps’ mild yet complex flavor can be paired with vegetables like asparagus, carrots, potatoes (particularly sauteed sautéed in bacon or duck), fat wild, mushrooms and peas as well as with, seafood particularly salmon and whitefish like, halibut trout and dover. sole"}, {"url": "https://en.wikipedia.org/wiki/Allium_tricoccum", "passage_text": "Allium tricoccum (commonly known as ramp, ramps, spring onion, ramson, wild leek, wood leek, and wild garlic) is a North American species of wild onion widespread across eastern Canada and the eastern United States. Many of these English names are used for other Allium species, particularly Allium ursinum. Allium tricoccum is popular in the cuisines of the rural uplands of its native region. It is regarded as an early spring vegetable with a strong garlic-like odor and a pronounced onion flavor. Ramps also have a growing popularity in restaurants throughout North America."}]