[{"url": "http://www.puristat.com/coloncleansing/gutbacteria.aspx", "passage_text": "Healthy bacteria produce toxins that make it hard for bad bacteria like Clostridium to grow. Harmful bacteria and yeasts grow when there is not a strong population of good bacteria around. In fact, experimentally, animals with low amounts of good bacteria are very easy to infect with bad bacteria."}, {"url": "http://www.petmd.com/cat/conditions/digestive/c_ct_helicobacter_infection", "passage_text": "The Helicobacter bacteria are normal inhabitants of the intestinal tract, being found in several species, including domestic animals such as dogs, cats, ferrets and pigs, in wild animals such as cheetah's and monkeys, and in humans."}, {"url": "http://www.webmd.com/a-to-z-guides/e-coli-infection-topic-overview", "passage_text": "But some can cause bloody diarrhea. Some strains of E. coli bacteria (such as a strain called O157:H7) may also cause severe anemia or kidney failure, which can lead to death. Other strains of E. coli can cause urinary tract infections or other infections. You get an E. coli infection by coming into contact with the feces, or stool, of humans or animals."}, {"url": "http://www.urmc.rochester.edu/encyclopedia/content.aspx?ContentTypeID=90&ContentID=P02019", "passage_text": "Viruses, bacteria, and parasites that invade the digestive tract usually cause diarrhea. Large amounts of water are lost with the diarrhea, leading to dehydration in children. Children become dehydrated much quicker than adults, and this can lead to serious problems if fluids are not replaced."}, {"url": "http://www.urmc.rochester.edu/encyclopedia/content.aspx?ContentTypeID=90&ContentID=P02019", "passage_text": "Viruses, bacteria, and parasites are living organisms that are found all around us. They exist in water and soil, on the surfaces of foods that we eat and on surfaces that we touch, such as countertops in the bathroom or kitchen. Some bacteria live in and on our bodies and do not cause problems."}, {"url": "http://www.cdc.gov/ecoli/general/index.html/", "passage_text": "Escherichia coli (E. coli) bacteria normally live in the intestines of people and animals. Most E. coli are harmless and actually are an important part of a healthy human intestinal tract. However, some E. coli are pathogenic, meaning they can cause illness, either diarrhea or illness outside of the"}, {"url": "http://www.puristat.com/coloncleansing/gutbacteria.aspx", "passage_text": "Bad bacteria become problematic when their numbers grow too large in proportion to that of the good bacteria, and this is when they begin to create health problems. Bad bacteria include those which cause disease such as Salmonella, Clostridium, and others."}, {"url": "http://www.urmc.rochester.edu/encyclopedia/content.aspx?ContentTypeID=90&ContentID=P02019", "passage_text": "Bacteria, viruses, and parasites can cause a wide variety of illnesses, and can infect any of the organs of the body. Viruses are often responsible for respiratory illnesses (such as the common cold) and digestive illnesses (such as diarrhea). Bacteria can infect any part of the body, but often cause diarrhea when they invade the digestive tract."}]