[{"url": "http://www.imdb.com/name/nm0651441/", "passage_text": "View Resume | Official Photos ». Meghan Ory is a Canadian actress, she was born in Victoria, British Columbia. She Started acting in theater before her teens, but was prohibited by her mother-a drama teacher-from auditioning for film and TV roles until she could pay for her own head shots."}, {"url": "http://www.tvguide.com/news/kecks-exclusives-meghan-ory-once-upon-a-time-intelligence-1065627/", "passage_text": "When magic came to Storybrooke at the conclusion of Once Upon a Time 's freshman season, there were high hopes for wolf-shifting Ruby (a.k.a. Little Red Riding Hood) and the troubled character's portrayer, Meghan Ory."}, {"url": "http://onceuponatime.wikia.com/wiki/Ruby", "passage_text": "Ruby is a character on ABC 's Once Upon a Time and Once Upon a Time in Wonderland. She debuts débuts in the first episode of the first season Of Once upon A. Time she is portrayed by guest Star Meghan, ory and is The storybrooke counterpart Of Red Riding. hood"}, {"url": "http://www.hypable.com/meghan-ory-leaves-once-upon-a-time/", "passage_text": "Sad news for Little Red fans: TV Guide has learned that Once Upon a Time ‘s Meghan Ory, who was upped to a series regular this year, will not be returning for season 3."}, {"url": "http://www.hypable.com/meghan-ory-leaves-once-upon-a-time/", "passage_text": "Once Upon a Time has let go of Meghan Ory (Ruby) after the actress was cast as the lead character in the new CBS drama Intelligence."}, {"url": "http://onceuponatime.wikia.com/wiki/Ruby", "passage_text": "Ruby is a character on ABC 's Once Upon a Time and Once Upon a Time in Wonderland. She debuts débuts in the first episode of the first season Of Once upon A. time"}, {"url": "https://en.wikipedia.org/wiki/Meghan_Ory", "passage_text": "Meghan Ory (born August 20, 1982) is a Canadian television and film actress. She is best known for her role as Red Riding Hood /Ruby on the ABC fantasy series Once Upon a Time and also starred in the short-lived CBS drama Intelligence as Riley Neal."}, {"url": "http://tvline.com/2014/01/15/once-upon-a-time-season-3-ruby-returns/", "passage_text": "As excited as Meghan Ory may be about her possible return to Once Upon a Time — where during Seasons 1 and 2 she played Ruby/Red Riding Hood-slash-The Wolf — the sartorial ramifications of ABC drama’s midseason twist have her especially jazzed. PHOTOS | Winter TV Spoiler-palooza!"}]