[{"url": "http://www.cdc.gov/h1n1flu/cdcresponse.htm", "passage_text": "The 2009 H1N1 influenza (flu) pandemic occurred against a backdrop of pandemic response planning at all levels of government including years of developing, refining and regularly exercising response plans at the international, federal, state, local, and community levels. On June 11, 2009, WHO signaled that a global pandemic of 2009 H1N1 influenza was underway by further raising the worldwide pandemic alert level to Phase 6. That day, CDC held its first press conference with the new CDC Director Thomas Frieden, MD, MPH. The press conference had a total of 2,355 participants."}, {"url": "http://www.flu.gov/pandemic/about/index.html", "passage_text": "Because the virus is new, the human population has little to no immunity against it. The virus spreads quickly from person-to-person worldwide. The United States is not currently experiencing a flu pandemic. If a pandemic occurs, the federal government will work to identify the cause and create a vaccine. Flu.gov will provide updates on the steps the federal government is taking to address the pandemic. "}, {"url": "https://en.wikipedia.org/wiki/Pandemic", "passage_text": "1 An H3N2 caused about 34,000 deaths in the United States. 2  This virus was first detected in Hong Kong in early 1968, and spread to the United States later that year. 3  This pandemic of 1968 and 1969 killed approximately one million people worldwide. 1 Second cholera pandemic 1829–1851. 2  Reached Russia (see Cholera Riots), Hungary (about 100,000 deaths) and Germany in 1831, London in 1832 (more than 55,000 persons died in the United Kingdom), France, Canada (Ontario), and United States (New York) in the same year, and the Pacific coast of North America by 1834."}, {"url": "https://www.osha.gov/Publications/influenza_pandemic.html", "passage_text": "Introduction A pandemic is a global disease outbreak. An influenza pandemic occurs when a new influenza virus emerges for which there is little or no immunity in the human population, begins to cause serious illness and then spreads easily person-to-person worldwide. "}, {"url": "http://www.usda.gov/documents/avian-influenza-united-states-qa.pdf", "passage_text": "While human infections are possible, infection with avian influenza viruses in general are rare and – when they occur – these viruses have not spread easily to other people. These reports of H5-infected wild birds and poultry in the United States do not signal the start of a pandemic. In the current response effort, USDA is coordinating closely with State officials (in affected and bordering States) and other Federal departments on avian influenza surveillance, reporting and control efforts. USDA also is coordinating with Canada on the HPAI H5 findings that are close to the Northern U.S. border."}, {"url": "https://en.wikipedia.org/wiki/Pandemic", "passage_text": "A pandemic (from Greek πᾶν pan all and δῆμος demos people) is an epidemic of infectious disease that has spread through human populations across a large region; for instance multiple continents, or even worldwide. 1 Second cholera pandemic 1829–1851. 2  Reached Russia (see Cholera Riots), Hungary (about 100,000 deaths) and Germany in 1831, London in 1832 (more than 55,000 persons died in the United Kingdom), France, Canada (Ontario), and United States (New York) in the same year, and the Pacific coast of North America by 1834."}, {"url": "http://www.nejm.org/doi/full/10.1056/NEJMra1208802", "passage_text": "A number of provisions of the 2005 IHR proved helpful in dealing with the 2009 H1N1 pandemic. For example, the 2005 IHR established systematic approaches to surveillance, early-warning systems, and response in member states and promoted technical cooperation and sharing of logistic support. Although the WHO is the only global agency with legitimate authority to lead the response to a pandemic, it is burdened by a number of structural impediments. First, the WHO is simultaneously the moral voice for health in the world and the servant of its member states, which authorize the overall program and budget."}, {"url": "http://www.cdc.gov/h1n1flu/cdcresponse.htm", "passage_text": "CDC remained in close contact with the international health community as the outbreak unfolded and on April 18, 2009, under the International Health Regulations (IHR) the United States International Health Regulations Program reported the 2009 H1N1 influenza cases to the World Health Organization (WHO). On June 11, 2009, WHO signaled that a global pandemic of 2009 H1N1 influenza was underway by further raising the worldwide pandemic alert level to Phase 6. That day, CDC held its first press conference with the new CDC Director Thomas Frieden, MD, MPH. The press conference had a total of 2,355 participants."}, {"url": "http://www.cdc.gov/h1n1flu/cdcresponse.htm", "passage_text": "The 2010-2011 flu vaccine will protect against a 2009 H1N1-like virus in addition to an influenza A H3N2 virus and an influenza B virus. The United States experienced its second wave of 2009 H1N1 activity in the fall with activity peaking during the second week in October. On June 11, 2009, WHO signaled that a global pandemic of 2009 H1N1 influenza was underway by further raising the worldwide pandemic alert level to Phase 6. That day, CDC held its first press conference with the new CDC Director Thomas Frieden, MD, MPH. The press conference had a total of 2,355 participants."}, {"url": "http://www.cdc.gov/h1n1flu/cdcresponse.htm", "passage_text": "On January 15, 2010, CDC published an article in the MMWR on influenza A (H1N1) 2009 monovalent vaccination coverage in the United States between October and December 2009. Results of the study indicated that efforts to get available vaccine to target groups had largely succeeded. On June 11, 2009, WHO signaled that a global pandemic of 2009 H1N1 influenza was underway by further raising the worldwide pandemic alert level to Phase 6. That day, CDC held its first press conference with the new CDC Director Thomas Frieden, MD, MPH. The press conference had a total of 2,355 participants."}]