[{"url": "https://en.wikipedia.org/wiki/Basophilic", "passage_text": "Basophilic is a technical term used by histologists. It describes the microscopic appearance of cells and tissues, as seen down the microscope, after a histological section has been stained with a basic dye. The most common such dye is haematoxylin. Different definitions will apply to basophilic: Basophilic stains are acidic stains called base loving stains. Basophilic substances are base loving cells. Basophilic substances attract basic dyes, such as haematoxylin; Eosin is referred to as an basophilic stain. Simplistically, acid pH stains (positive charge) are attracted to the base pH tissue (negative charge), so they are called basophilic stains"}, {"url": "https://en.wikipedia.org/wiki/Basophilic_stippling", "passage_text": "Basophilic stippling aka Punctate basophilia refers to an observation found when observing a blood smear in which erythrocytes display small dots at the periphery. These dots are the visualization of ribosomes and can often be found in the peripheral blood smear, even in some normal individuals. "}, {"url": "http://www.definitions.net/definition/basophilic", "passage_text": "Basophilic. Basophilic is a technical term used by histologists. It describes the microscopic appearance of cells and tissues, as seen down the microscope, after a histological section has been stained with a basic dye. The most common such dye is haematoxylin. Basophilic describes the appearance of structures seen in histological sections which take up basic dyes."}, {"url": "http://medical-dictionary.thefreedictionary.com/basophilic", "passage_text": "staining readily with basic dyes. basophilic bone matrix. vitamin D poisoning causes the appearance of intensely basophilic bone matrix of a distincitive pattern. basophilic cell. see basophil cell. basophilic enterocolitis. one of the several types of enterocolitis causing chronic diarrhea in horses characterized by fibrinous and ulcerative typhlocolitis and basophilic infiltrates in the regional mucosa and submucosa. basophilic stippling. distinct or diffuse, fine to coarse, dark granular pattern in erythrocytes, representing aggregated ribosomes and caused by ineffective heme formation. Seen in lead poisoning, mainly in dogs and a characteristic of active erythropoiesis in sheep and cattle."}, {"url": "http://medical-dictionary.thefreedictionary.com/basophilic+a.", "passage_text": "An adenoma of the pituitary gland in which cells stain with basic dyes. The term was formerly used to suggest tumors that secreted adrenocorticotrophin (ACTH), the cause of Cushing syndrome. Those tumors are now identified more directly by the identification (by immunocytochemistry) of ACTH in tumor cells. The use of hematoxylin and eosin staining to identify pituitary tumors is obsolete"}, {"url": "http://www.merriam-webster.com/dictionary/basophil", "passage_text": "Definition of BASOPHIL. : a basophilic substance or structure; especially: a white blood cell containing basophilic granules that is similar in function to a mast cell. ba·so·phil also ba·so·phile \\-ˌfī(-ə)l\\. ADVERTISEMENT. noun ba·so·phil \\ˈbā-sə-ˌfil, -zə-\\. First Known Use of BASOPHIL. noun ba·so·phil \\ˈbā-sə-ˌfil, -zə-\\. : a basophilic substance or structure; especially: a white blood cell with basophilic granules that is similar in function to a mast cell. ba·so·phil or ba·so·phile \\-ˌfīl\\."}, {"url": "http://www.merriam-webster.com/dictionary/basophilic", "passage_text": "Medical Definition of BASOPHILIC. : staining readily with or being a basic stain. Definition of BASOPHILIC. : staining readily with basic stains. ADVERTISEMENT."}, {"url": "http://www.merriam-webster.com/dictionary/basophil", "passage_text": "Medical Definition of BASOPHIL. : a basophilic substance or structure; especially: a white blood cell with basophilic granules that is similar in function to a mast cell. First Known Use of BASOPHIL. noun ba·so·phil \\ˈbā-sə-ˌfil, -zə-\\. : a basophilic substance or structure; especially: a white blood cell with basophilic granules that is similar in function to a mast cell. ba·so·phil or ba·so·phile \\-ˌfīl\\."}, {"url": "http://www.definitions.net/definition/basophilic", "passage_text": "Basophilic cells attract base dyes, such as hematoxylin; however, hematoxylin is referred to as an acidophilic stain. Simplistically, acid pH stains are attracted to the base pH tissue, so they are called basophilic stains. Eosinophils are dyed red by the basophilic stain, eosin. It describes the microscopic appearance of cells and tissues, as seen down the microscope, after a histological section has been stained with a basic dye. The most common such dye is haematoxylin. Basophilic describes the appearance of structures seen in histological sections which take up basic dyes."}]