[{"url": "http://espn.go.com/mlb/player/bio/_/id/2112/curt-schilling", "passage_text": "Curtis Montague Schilling was born on November 14, 1966, in Anchorage, Alaska. His father, Cliff, served in the U.S. Army for the better part of his career and was stationed in Elmendorf Air Force Base at the time. His 2004 Game 6 ALCS performance with a sutured tendon dressed in a bloody sock was the defining image in one of baseball's all-time playoff comebacks and an inspiration in overturning an 86-year old World Series drought."}, {"url": "http://www.baseball-almanac.com/players/player.php?p=schilcu01", "passage_text": "Curt Schilling was born on Monday, November 14, 1966, in Anchorage, Alaska. Schilling was 21 years old when he broke into the big leagues on September 7, 1988, with the Baltimore Orioles. There are less than twenty baseball players who were born in Alaska to this date, and Curt Schilling was the first from Alaska to pitch in a big league game."}, {"url": "http://www.imdb.com/name/nm1157149/", "passage_text": "Curt Schilling was born on November 14, 1966 in Anchorage, Alaska, USA as Curtis Montague Schilling. He is an actor, known for Sunday Night Baseball (1990), History Rings True: Red Sox Opening Day Ring Ceremony (2005) and Nine Innings from Ground Zero (2004). He has been married to Shonda Schilling since November 7, 1992. They have four children. See full bio »."}, {"url": "https://en.wikipedia.org/wiki/Curt_Schilling", "passage_text": "Schilling retired with a career postseason record of 11–2. His .846 postseason winning percentage is a major-league record among pitchers with at least 10 decisions. He is a member of the 3,000 strike out club and has the highest strikeout-to-walk ratio of any of its members. Schilling finished the 2003 season with an 8–9 record and a 2.95 ERA in 168 innings while striking out 194 batters. In November 2003, the Diamondbacks traded Schilling to the Boston Red Sox in exchange for Jorge de la Rosa, Casey Fossum, Mike Goss, and Brandon Lyon."}, {"url": "https://en.wikipedia.org/wiki/Curt_Schilling", "passage_text": "Curtis Montague Schilling (born November 14, 1966) is a former American Major League Baseball right-handed pitcher, former video game developer and currently suspended ESPN baseball color analyst. Schilling finished the 2003 season with an 8–9 record and a 2.95 ERA in 168 innings while striking out 194 batters. In November 2003, the Diamondbacks traded Schilling to the Boston Red Sox in exchange for Jorge de la Rosa, Casey Fossum, Mike Goss, and Brandon Lyon."}, {"url": "http://www.biography.com/people/curt-schilling-38823", "passage_text": "Curt Schilling was a major league baseball pitcher, who helped the Arizona Diamondbacks and the Boston Red Sox to World Series victories. He was drafted by the Red Sox, and made his major league debut with the Baltimore Orioles in 1988. From 1992 to 2000, Schilling played for the Phillies and was then traded to the Arizona Diamondbacks in 2001, helping to upset the Yankees and win the World Series."}, {"url": "https://en.wikipedia.org/wiki/Curt_Schilling", "passage_text": "On September 16, 2004, Schilling won his 20th game of 2004 for the Red Sox, becoming the fifth Boston pitcher to win 20 or more games in his first season with the team, and the first since Hall of Famer Dennis Eckersley in 1978. Schilling ended his regular season with a 21–6 record. Schilling finished the 2003 season with an 8–9 record and a 2.95 ERA in 168 innings while striking out 194 batters. In November 2003, the Diamondbacks traded Schilling to the Boston Red Sox in exchange for Jorge de la Rosa, Casey Fossum, Mike Goss, and Brandon Lyon."}, {"url": "https://en.wikipedia.org/wiki/Shonda_Schilling", "passage_text": "Shonda Schilling (born November 23, 1967 in Dundalk, Maryland) is founder of the Shade Foundation of America. "}, {"url": "http://www.christianspeakers360.com/speaker/curt-schilling.php", "passage_text": "Curt Schilling speaks about Christian values. Many of our speakers are born again Christian evangelicals who honor Jesus Christ's message through communities, schools and ministries. For information on Curt Schilling's appearance fees, speaking costs and availability, contact Curt Schilling's booking agent for details. Schilling is a former MLB pitcher who played for the Philadelphia Phillies, Arizona Diamondbacks and Boston Red Sox. The retired Red Sox pitcher is a born-again Christian who has been outspoken about his religious beliefs, as well as political leanings."}, {"url": "http://www.biography.com/people/curt-schilling-38823", "passage_text": "Synopsis. Curt Schilling was born on November 14, 1966 in Anchorage, Alaska. He was drafted by the Red Sox, and made his major league debut with the Baltimore Orioles in 1988. From 1992 to 2000, Schilling played for the Phillies and was then traded to the Arizona Diamondbacks in 2001, helping to upset the Yankees and win the World Series. In 2004 and 2007 he won World Series Championships with the Boston Red Sox. Schilling retired in March 2009"}]