[{"url": "http://www.caffeineinformer.com/caffeine-withdrawal-symptoms-top-ten", "passage_text": "Caffeine withdrawal is a very unpleasant experience. The symptoms of withdrawal only last a few days to a week for light caffeine consumers but can last 2 months or more for those that had been consuming around 1000 mg or more daily."}, {"url": "http://www.hemocode.com/wiki/Coffee-Intolerance", "passage_text": "Digestive coffee intolerance symptoms can include: headaches, ringing in the years, fatigue, abdominal pain and cramping, gas, bloating, nausea, diarrhea, vomiting, frequent urination and more."}, {"url": "http://www.hopkinsmedicine.org/Press_releases/2004/09_29_04.html", "passage_text": "The researchers identified five clusters of common withdrawal symptoms: headache; fatigue or drowsiness; dysphoric mood including depression and irritability; difficulty concentrating; and flu-like symptoms of nausea, vomiting and muscle pain or stiffness."}, {"url": "http://healthquestions.medhelp.org/coffee-withdrawal-nausea", "passage_text": "It is also a diuretic(fluid loser) Abrupt withdrawal of caffeine may cause headaches, drowsiness, irritability, nausea, vomiting, and other symptoms. Reduce caffeine intake gradually to prevent any symptoms of withdrawal. And... Is beneficial in that it..."}, {"url": "http://health.usnews.com/health-news/articles/2012/04/17/signs-of-caffeine-addiction", "passage_text": "Caffeine withdrawal symptoms typically appear 12 to 24 hours after abstaining from coffee, and peak within 24 to 48 hours. They include: headache; lethargy and drowsiness; depressed mood; anxiety; nausea; vomiting; muscle pain and stiffness; and inability to concentrate."}, {"url": "http://www.livestrong.com/article/472972-caffeine-withdrawal-nausea/", "passage_text": "Unpleasant withdrawal symptoms like nausea are preventable by gradually decreasing your caffeine intake instead of stopping it completely. Gradually substitute decaffeinated coffee and tea or choose other drink options that do not contain caffeine."}, {"url": "http://healthquestions.medhelp.org/coffee-withdrawal-nausea", "passage_text": "Watch out for withdrawal headaches if you're used to your coffee and stop suddenly you can get a nasty one for a few days. On top of that, pregnancy can also cause migraines, and a little caffeine can help in a pinch; it's an active ingredient in migraine meds (which you CAN'T take)."}, {"url": "http://www.livestrong.com/article/472972-caffeine-withdrawal-nausea/", "passage_text": "Caffeine withdrawal symptoms occur when you are addicted and suddenly stop consuming the drug. You can become addicted by drinking just one small cup of coffee per day, according to Johns Hopkins Medicine, although the problem is more likely if you are a heavy user."}]