[{"url": "http://www.military-quotes.com/ranks/army-rank-insignia.htm", "passage_text": "Army Ranks are more than just who salutes whom. Army rank is a badge of leadership. Responsibility for personnel, equipment, and mission grows with each increase in rank. Do not confuse rank with pay grades, such as E-1, W-2 and O-5."}, {"url": "http://www.defense.gov/About-DoD/insignias/index", "passage_text": "Military rank is a badge of leadership. Responsibility for personnel, equipment, and mission grows with each increase in rank. Do not confuse rank with pay grades, such as E-1, W-2 and O-5. Pay grades are administrative classifications used primarily to standardize compensation across the military services."}, {"url": "https://en.wikipedia.org/wiki/Military_rank", "passage_text": "Military ranks are a system of hierarchical relationships in armed forces, police, intelligence agencies or other institutions organized along military lines. Usually, uniforms denote the bearer's rank by particular insignia affixed to the uniforms."}, {"url": "http://www.militaryfactory.com/military_pay_scale.asp", "passage_text": "Below is the active 2015 Military Pay Scale chart (1.0% raise) for the United States military (all services). Enlisted personnel are E grades ranging from E-1 to E-9. For those service branches recognizing a Warrant Officer rank, W grades range W-1 to W-5. Officers are scaled as O-1 to O-10."}, {"url": "http://www.defense.gov/About-DoD/insignias/index", "passage_text": "Some enlisted pay grades have two ranks. The Army, for example, has the ranks of corporal and specialist at the pay grade of E-4. A corporal is expected to fill a leadership role and has a higher rank than a specialist even though both receive the same amount of pay."}, {"url": "http://www.military-quotes.com/ranks/army-rank-insignia.htm", "passage_text": "The Army has the ranks of corporal and specialist at the pay grade of E-4. A corporal is expected to fill a leadership role and has a higher rank than a specialist even though both receive the same amount of pay. Rank images and info from Defenselink.mil and www.perscom.army.mil."}]