[{"url": "http://www.moneysmartsblog.com/income-tax-refund/", "passage_text": "If you filed a tax return by mail, your refund will be issued within six weeks from the date the return was received by the IRS, whether or not you opted for a paper check or an electronic deposit."}, {"url": "http://www.consumerfinancereport.com/tax-debt-relief/how-long-does-it-take-to-get-your-tax-refund-back.htm", "passage_text": "If you file electronically, you should receive your tax refund within three weeks. The IRS allows two options for receiving a federal tax refund: paper check sent via the mail, or an electronic funds transfer (also called a direct deposit). The direct deposit method, not surprisingly, is always the quicker option."}, {"url": "http://www.answers.com/Q/How_long_does_it_take_to_get_a_tax_refund_if_you_efile", "passage_text": "If you e-file and you have chosen direct deposit, most people will receive their refund within 5 business days. If you have chosen to receive a paper check you should add 2- … 4 business days for processing."}, {"url": "http://www.inquisitr.com/1754353/tax-refunds-delayed-by-irs-how-long-will-tax-refund-checks-take/", "passage_text": "Tax refunds are normally issued within approximately 21 days if you file electronically, but due to budget cuts, expect to wait a bit longer. Check the status of your refund within 24 hours after your e-filed tax return is received by the IRS or four weeks after your tax forms are mailed in."}, {"url": "http://blogs.hrblock.com/2014/12/29/can-i-file-my-tax-return-now/", "passage_text": "If you file a paper return, the IRS says you should allow about six weeks to receive your refund. If you file Form 8379, Injured Spouse Allocation, it could take up to 14 weeks to process your tax return."}, {"url": "http://themilitarywallet.com/irs-federal-tax-refund-schedule/", "passage_text": "The refund schedule should be the same if you filed for a tax extension, however, there is no official schedule for tax refunds for amended tax returns. The above list only includes dates for e-filing an original tax return. Amended tax returns are processed manually, and often take 8-12 weeks to process."}, {"url": "https://www.irs.gov/uac/newsroom/five-good-reasons-to-efile-your-tax-return", "passage_text": "1 Faster refunds. 2  An e-filed tax return usually means a faster refund compared to a paper return. 3  The IRS issues most refunds in less than 21 days. 4  If you choose direct deposit, your refund goes directly into your bank account. 5  Combining e-file with direct deposit is the fastest way to get your refund."}, {"url": "https://www.ftb.ca.gov/individuals/faq/ivr/112.shtml", "passage_text": "e-filing your state income tax return is the fastest way to receive your tax refund. When you e-file and select direct deposit, you can enjoy the convenience of having your refund in your bank account in one week or less."}, {"url": "http://www.cheatsheet.com/personal-finance/how-long-will-your-tax-refund-really-take-this-year.html/", "passage_text": "If you file electronically, and request that your refund be direct deposited into your account, you may receive it in as little as 6-8 days. This does not mean that you will necessarily receive your refund that quickly, though. The IRS reports that it “issues more than 9 out of 10 refunds in less than 21 days.”."}]