[{"url": "http://www.bbc.co.uk/bitesize/higher/chemistry/energy/bsp/revision/1/", "passage_text": "Metallic bonding. Metallic bonding is the type of bonding found in metallic elements. This is the electrostatic [electrostatic: An electrostatic force is generated by differences in electric charge (ie positive and negative) between two particles. When two atoms bonded by a covalent bond have the same electronegativity the electrons will be equally shared. This is called pure (non-polar) covalent bonding. For example, the chlorine molecule, Cl 2."}, {"url": "https://en.wikipedia.org/wiki/Cyclopentane", "passage_text": "Cyclopentane is a highly flammable alicyclic hydrocarbon with chemical formula C 5 H 10 and CAS number 287-92-3, consisting of a ring of five carbon atoms each bonded with two hydrogen atoms above and below the plane. It occurs as a colorless liquid with a petrol-like odor. Its melting point is −94 °C and its boiling point is 49 °C. Cyclopentane is in the class of cycloalkanes, being alkanes that have one or more rings of carbon atoms. The typical structure of cyclopentane is the envelope conformation. It is formed by cracking cyclohexane in the presence of alumina at a high temperature and pressur"}, {"url": "https://en.wikibooks.org/wiki/Organic_Chemistry/Cycloalkanes", "passage_text": "Torsional strain is also a factor. When the hydrogen bonds in a ring eclipse each other, this creates additional strain. In the case of cyclopropane the hydrogens eclipse each other, greatly adding to the strain. In fact, this is the cause of most of the strain found in cyclopentane. Cyclopentane has bond angles very close to 109.5°, but because 4 of its carbons are planar, there it has torsional strain that makes it less stable. "}, {"url": "http://sparkcharts.sparknotes.com/chemistry/organicchemistry1/section5.php", "passage_text": "Functional groups: Atoms or groups of bonded atoms that bond to carbon atoms to give rise to other families of organic compounds. A given functional group will generally undergo the same type of reactions regardless of the molecule in which it appears. When a functional group is bonded to an atom, it is called a substituent of that atom. General formula C n H 2n + 2 - 2d, where d = # of double bonds in the molecule and n is an integer. Alkynes: Unsaturated hydrocarbons containing one or more carbon-carbon triple bonds. General formula C n H 2n + 2 - 4t, where t = # of trip"}, {"url": "http://authors.library.caltech.edu/25034/3/BPOCchapter2.pdf", "passage_text": "2-1 Structural Fbrmulas 31 covalent bonds to each carbon, regardless of whether the combination is with carbon or some other element. The two-electron bond, which is illustrated by the carbon-hydrogen bonds in methane or ethane and the carbon-carbon bond in ethane, is called a single bond. 2-2A Bond Angles and Ball-and-Stick Models It is well established that the normal carbon atom forms its four single bonds in compounds of the type CX, so that the four attached atoms lie at the corners of a regular tetrahedron. The bond angles X-C-X are 109.5 and this value is the normal valence angle of carbon."}, {"url": "http://www.answers.com/Q/What_type_of_bond_is_cyclopentane", "passage_text": "The main difference between cyclopentane and pentane is the number of hydrogen. cyclopentane has 2 hydrogen less than pentane. It will form a cyclic compound to get rid of the … double bond that is in its structure. There are also three pairs of eclipsed hydrogens. The ring strain is calculated to be around 120 kJ/mol. For a theoretical planar cyclopentane, the C-C-C bond angles would be 108 degrees, very close to the measure of the tetrahedral angle."}, {"url": "http://www.answers.com/Q/What_type_of_bonding_is_found_among_cyclopentane_atoms", "passage_text": "Ionic BondsIonic bonds form when two atoms have a large difference in electronegativity. A Ionic bonds often occur between metals and salts; chloride is often the bonding salt … . Ionic bonds can typically be broken through hydrogenation, or the addition of water to a compound. Covalent Bonds Covalent bonds often form between similar atoms, nonmetal to nonmetal or metal to metal. Covalent bonding signals a complete sharing of electrons. Covalent bonds are usually strong because of this direct bonding.   Polar Covalent BondsPolar covalent bonds fall between ionic and covalent bonds. One atom becomes slightly negative and the other atom becomes slightly positive"}, {"url": "http://www.answers.com/Q/What_type_of_bonding_is_found_among_cyclopentane_atoms", "passage_text": "Each hydrogen atom forms a double bond with the oxygen atom.  Each H atom has one double bond and free electrons The O atom has two double bonds (one with each H atom)   … Since the atoms are sharing electrons, the bonds are considered covalent. Covalent Bonds Covalent bonds often form between similar atoms, nonmetal to nonmetal or metal to metal. Covalent bonding signals a complete sharing of electrons. Covalent bonds are usually strong because of this direct bonding.   Polar Covalent BondsPolar covalent bonds fall between ionic and covalent bonds. One atom becomes slightly negative and the other atom becomes slightly positive"}, {"url": "http://faculty.fmcc.suny.edu/mcdarby/Majors101Book/Chapter_03-Chemistry/02-Bonds.htm", "passage_text": "Although bonds often hold together atoms on a one-bond: one-atom pairing, it is possible for more than one electron to be shared between two atoms. These are multiple bonds. There are double bonds, as is found in the common atmospheric form of oxygen, O 2, or triple bonds, found in the atmospheric form of nitrogen, N 2. "}]