[{"url": "https://www.bdo.com.ph/personal", "passage_text": "BDO Trust invites you to the FIT 101 for Beginners. a savings and investing workshop that will teach you how to become financially healthy. Learn More. "}, {"url": "http://www.bdoalbaromeo.ph/contactus.php", "passage_text": "Alba Romeo & Co. , CPAs, a Philippine professional partnership, is a member of BDO International Limited, a UK company limited by guarantee, and forms part of the International BDO network of independent member firms. "}, {"url": "http://www.affordablecebu.com/load/directory/banco_de_oro_bdo_main_office_heaquarters_and_telephone_number/26-1-0-3810", "passage_text": "Good day, I just want to ask if you are accepting On The Job Training students? I am an incoming 4th year college student. I am a student of Eulogio Amang Rodriguez Institute of Science And Technology and my course is Business Administration, major in Marketing Management. I have job experience, as an accounting clerk/office staff."}, {"url": "http://cdoguide.com/money/banks.html", "passage_text": "Main Branch: Cagayan de Oro-Velez. Government Banks (either partly or fully owned). PHILIPPINE NATIONAL BANK (PNB). Main Branch: Cagayan de Oro-Corrales. Tel. No. (88) 856-3684. LAND BANK OF THE PHILIPPINES (Land Bank). Main Branch: Velez. Tel. CITIBANK SAVINGS (formerly Insular Life Savings Bank, subsidiary of Citibank N.A.) Main Branch: Cagayan de Oro-Limketkai Center Tel. No. (88) 856-2541 to 45."}, {"url": "http://cdoguide.com/money/banks.html", "passage_text": "Few banks now operate on Saturdays. Banco de Oro is the only bank that has a different operating schedule. Banks are closed during public and city holidays, such as city fiesta and charter day. Some banks and even business establishments are not synchronized to the Philippine time. CITIBANK SAVINGS (formerly Insular Life Savings Bank, subsidiary of Citibank N.A.) Main Branch: Cagayan de Oro-Limketkai Center Tel. No. (88) 856-2541 to 45."}, {"url": "https://www.ucpb.com/", "passage_text": "As of: 10/14/2015 09:31PM. UCPB Connect. As technology grows, so does your need for ready information to rid yourself the burden of going to branches, filling up forms, etc. UCPB’s state-of-the-art technology allows you to access our banking services 24 hours a day, 7 days a week."}, {"url": "http://www.vjandep.com/branches/", "passage_text": "#SweetLifeWithPastel Instagram Contests. Starting August 2015 until the end of the year, VjANDEP will be hosting a series of monthly contests on Instagram! Followers of VjANDEP’s IG account are welcome to join. This is still in celebration of the bakeshop’s 25th Anniversary this year. There will be a theme for each month which will be announced on Instagram. Last June, we opened our newest branch in Cagayan de Oro City at Agora Terminal Market City. What was once a simple booth-standee is now a full-fledged branch within the terminal and market building. This is a perfect location for buying pastel!"}, {"url": "https://www.ucpb.com/", "passage_text": "Please be advised that on October 20, 2015 (Tuesday), UCPB will be migrating to BancNet. The actual migration activities will happen between 12:00 Midnight of October 19, 2015 (Monday) up to 6:00AM of October 20, 2015 (Tuesday). During this 6-hour period, you may transact using UCPB ATMs only. You will not be able to use your UCPB ATM cards in other banks' ATMs during this time. As technology grows, so does your need for ready information to rid yourself the burden of going to branches, filling up forms, etc. UCPB’s state-of-the-art technology allows you to access our banking services 24 hours a day, 7 days a week."}]