[{"url": "https://en.wikipedia.org/wiki/Instrumentation", "passage_text": "Instrumentation engineering is the engineering specialization focused on the principle and operation of measuring instruments that are used in design and configuration of automated systems in electrical, pneumatic domains etc. Diverse handheld instrumentation is common in laboratories, but can be found in the household as well. For example, a smoke detector is a common instrument found in most western homes. Instruments attached to a control system may provide signals used to operate solenoids, valves, regulators, circuit breakers, or relays."}, {"url": "http://www.instrumentationtechnician.net/", "passage_text": "The instrumentation technician is responsible for anything that happens to an instrument. Sometimes they are required to work with laboratory equipment that measures the changes that occur in a test instrument when the humidity, pressure, temperature, stress, vibration and altitude changes. "}, {"url": "https://en.wikipedia.org/wiki/Instrumentation", "passage_text": "The control of processes is one of the main branches of applied instrumentation. Instrumentation can also refer to handheld devices that measure some desired variable. Diverse handheld instrumentation is common in laboratories, but can be found in the household as well. For example, a smoke detector is a common instrument found in most western homes. Instruments attached to a control system may provide signals used to operate solenoids, valves, regulators, circuit breakers, or relays."}, {"url": "https://en.wikipedia.org/wiki/Instrumentation_and_control_engineering", "passage_text": "Instrumentation is defined as the art and science of measurement and control of process variables within a production or manufacturing area. The process variables used in industries are Level, Pressure, Temperature, Humidity, Flow, pH, Force, Speed etc. Instrumentation and control engineers have a role to play in all the fields where there is automation.The instruments created by control engineers to automate the processes,thus reducing the involvement of manpower."}, {"url": "http://sccounty01.co.santa-cruz.ca.us/personnel/Specs/MS8spec.html", "passage_text": "Electrical Instrumentation Technician I: An AS technology degree in instrumentation, computers, or electronics, or 24 college level semester units in instrumentation, computers or electronics. A typical way to obtain these would be: Electrical Instrumentation Technician I: OR. Two years of experience in the operation, maintenance, and repair of industrial instrumentation, control or communication system components involving the application of physical, chemical, and electronic principles."}, {"url": "http://sccounty01.co.santa-cruz.ca.us/personnel/Specs/MS8spec.html", "passage_text": "DISTINGUISHING CHARACTERISTICS Electrical Instrumentation Technician I is the entry level class in this series. Incumbents initially work under close supervision. As experience is gained, incumbents perform a broader range of duties with more independence. Upon acquisition and after at least two years of experience at this level, incumbents are expected to advance to the next level. Electrical Instrumentation Technician II is the journey level class in this series. A typical way to obtain these would be: Electrical Instrumentation Technician I: OR. Two years of experience in the operation, maintenance, and repair of industrial instrumentation, control or communication system components involving the application of physical, chemical, and electronic principles."}, {"url": "http://www.engineering.careers360.com/electrical-and-instrumentation-engineering", "passage_text": "About course Electrical and Instrumentation Engineering refers to the discipline which deals with design of devices to measure physical quantities such as pressure, flow and temperature. Electrical Engineering basically deals with the study and application of electricity, electronics, and electromagnetism. Instrumentation engineering is the engineering specialization focused on the principle and operation of measuring instruments that are used in design and configuration.."}, {"url": "https://www.westernwyoming.edu/academics/electrical/", "passage_text": "The 36 hour Certificate in Electronics/Instrumentation/Control Technology and the A.A.S. Degree in Electrical & Instrumentation are designed to provide the student with a wide variety of electrical courses to prepare them for a job as an electrical technician. Degree in Electrical & Instrumentation Technology. The 24 hour certificate Program in Electricity fulfills the state of Wyoming's education requirements for apprentice electricians preparing for their Journeyman's License."}, {"url": "https://en.wikipedia.org/wiki/Instrumentation", "passage_text": "Instrumentation is the use of measuring instruments to monitor and control a process. It is the art and science of measurement and control of process variables within a production, laboratory, or manufacturing area. An instrument is a device that measures a physical quantity such as flow, temperature, level, distance, angle, or pressure. Diverse handheld instrumentation is common in laboratories, but can be found in the household as well. For example, a smoke detector is a common instrument found in most western homes. Instruments attached to a control system may provide signals used to operate solenoids, valves, regulators, circuit breakers, or relays."}, {"url": "http://us.flukecal.com/products/electrical-calibration-0", "passage_text": "Electrical calibration refers to the process of verifying the performance of, or adjusting, any instrument that measures or tests electrical parameters. This discipline is usually referred to as dc and low frequency electrical metrology. "}]