[{"url": "http://www.bhg.com/recipes/how-to/handling-meat/how-long-to-cook-chicken/", "passage_text": "How Long to Cook Chicken Pieces. Use these cooking guides for chicken breast halves, drumsticks, and thighs with bone. 1  2-1/2 to 3 pounds total: 375 degrees F for 45 to 55 minutes. "}, {"url": "http://www.thekitchn.com/how-to-cook-chicken-the-easiest-simplest-method-cooking-lessons-from-the-kitchn-216562", "passage_text": "Bake for 20 to 30 minutes: The chicken is done when opaque all the way through and the meat registers at least 165°F in the thickest part. Broil for extra-crispy skin: If you'd like the skin to be a bit more crispy and golden, turn on the broiler for 2 to 3 minutes. You can use a mix of chicken breasts, thighs, and drumsticks, or just roast a whole sheet pan filled with your favorite. With thighs and drumsticks, you can buy bone-in, skin-on pieces or boneless, skinless pieces; the meat is rich and fatty enough to cook fine either way."}, {"url": "http://www.ehow.com/info_8165887_oven-cooking-times-baked-chicken.html", "passage_text": "A 2 1/2 to 3 lb. chicken takes 1 hour and 15 minutes to 1 hour and 30 minutes to cook, a 3 to 4 lb. chicken takes between 1 hour and 30 minutes to 1 hour and 45 minutes, and a 4 to 6 lb. chicken between 1 hour and 45 minutes and 2 hours. If you stuff the chicken, add 15 minutes to the cooking time. Bake legs, thighs and wings for 35 to 45 minutes and bone-in breasts 30 to 40 minutes, depending on the size of the pieces. Bake boneless breasts for 20 to 30 minutes, cutlets or tenderloins for 15 to 20 minutes and boneless thighs 25 to 35 minutes at 375 degrees Fahrenheit."}, {"url": "http://www.ehow.com/info_8165887_oven-cooking-times-baked-chicken.html", "passage_text": "Baked Chicken Pieces. If you want chicken to cook faster, cut it into pieces and arrange them in a shallow baking dish. Place the chicken into an oven preheated to 375 degrees Fahrenheit. Bake legs, thighs and wings for 35 to 45 minutes and bone-in breasts 30 to 40 minutes, depending on the size of the pieces. Bake boneless breasts for 20 to 30 minutes, cutlets or tenderloins for 15 to 20 minutes and boneless thighs 25 to 35 minutes at 375 degrees Fahrenheit."}, {"url": "http://www.thekitchn.com/how-to-cook-chicken-the-easiest-simplest-method-cooking-lessons-from-the-kitchn-216562", "passage_text": "Cooking time is generally 20 to 30 minutes, or until the chicken registers 165°F in the thickest part. Amazingly, all the chicken pieces wind up cooking at about the same rate — dark meat pieces cook a bit slower than white meat, but the thickness of the breast meat means everything finishes around the same time. You can use a mix of chicken breasts, thighs, and drumsticks, or just roast a whole sheet pan filled with your favorite. With thighs and drumsticks, you can buy bone-in, skin-on pieces or boneless, skinless pieces; the meat is rich and fatty enough to cook fine either way."}, {"url": "http://www.thekitchn.com/how-to-cook-the-best-chicken-breasts-in-the-oven-cooking-lessons-from-the-kitchn-211453", "passage_text": "The chicken breasts should be completely covered with the parchment. Bake for 30 to 40 minutes: Transfer the chicken to the oven and bake for 30 to 40 minutes, until the chicken is completely opaque all the way through and registers 165°F on an instant-read thermometer. Serve: Serve the chicken immediately, or let it cool and refrigerate for up to a week. "}, {"url": "http://www.cooks.com/rec/search/0,1-0,chicken_pieces_oven_baked,FF.html", "passage_text": "Arrange chicken pieces in casserole dish. ... aluminum foil and bake at 350 degrees ... are done. Remove aluminum foil the last 10 minutes of cooking time. 10. OVEN BAKED CHICKEN. Mix soups and ... or roaster. Put chicken pieces on top. Add ... "}, {"url": "http://www.bhg.com/recipes/how-to/handling-meat/bake-chicken/", "passage_text": "Step 2: Bake the chicken pieces. Preheat the oven to 400 degrees F. Bake the chicken pieces, uncovered, for 25 to 30 minutes or until no longer pink (internal temperature should be 170 degrees F for chicken breasts, 180 degrees F for thighs and drumsticks). To store: Let the baked chicken stand for 30 minutes to cool. Put the chicken in the roasting pan into the preheated oven. The chicken cooking times vary by weight and by recipe, but in general, follow these guidelines: 2-1/2- to 3-pound chicken: Roast 1 to 1-1/4 hours. 3- to 3-1/2-pound chicken: Roast 1-1/4 to 1-1/2 hours."}, {"url": "http://www.simplyrecipes.com/recipes/classic_baked_chicken/", "passage_text": "Arrange the chicken pieces in the pan so that all the pieces are skin-side up, and the largest pieces (the breasts) are in the center of the pan. Don't crowd the pan; allow room between the pieces. 3 Bake in the oven for 30 minutes at 400°F (205°C). This initial high heat will help brown the chicken. Pat the chicken pieces dry with a paper towel. Sprinkle all sides with salt. Let the chicken pieces sit for 15 to 20 minutes to take the chill off. 2 Preheat your oven to 400°F (205°C). Pat the chicken pieces dry with a paper towel. Rub olive oil over the chicken pieces and on the bottom of the roasting pan. Sprinkle the chicken pieces all over with black pepper and a little more salt"}]