[{"url": "http://www.weegy.com/?ConversationId=8319C4FD", "passage_text": "Anaerobic glucose breakdown produces a compound called _____ that accumulates in the tissues and blood. Choose one answer. a. urea b. lactate c. uric acid d. amino acid. Anaerobic glucose breakdown produces a compound called lactate"}, {"url": "http://healthyliving.azcentral.com/muscle-cells-produce-atp-during-rapid-exercise-18322.html", "passage_text": "Your cells store energy in the form of ATP. When muscles contract, they break down ATP in a reaction that provides energy. However, muscle cells only store enough ATP to fuel a few seconds of maximal contraction. To keep working, they must replenish their ATP supply."}, {"url": "http://amandarb.weebly.com/anaerobic-respiration.html", "passage_text": "Without oxygen, pyruvate is converted to lactic acid. It produces only about 10% of the energy released in the complete oxidation of glucose. Anaerobic respiration in humans takes place when muscle undergoes extreme contraction as in vigorous exercise."}, {"url": "http://amandarb.weebly.com/anaerobic-respiration.html", "passage_text": "Anaerobic respiration (without oxygen). The lactic acid system is capable of releasing energy to resynthesise ATP without the involvement of oxygen and is called anaerobic glycolysis. Glycolysis (breakdown of carbohydrates) results in the formation of pyruvic acid and hydrogen ions (H+)."}, {"url": "http://healthyliving.azcentral.com/lactic-acid-production-5281.html", "passage_text": "Glycolysis. The first stage of carbohydrate metabolism is glycolysis. During glycolysis, glucose, or blood sugar, is broken down in a series of steps to produce a compound called pyruvate. Along the way energy is released. That energy is captured and stored in the form of a compound called adenosine triphosphate, or ATP."}, {"url": "http://healthyliving.azcentral.com/muscle-cells-produce-atp-during-rapid-exercise-18322.html", "passage_text": "Anaerobic Glycolysis. The breakdown of carbs to provide energy without oxygen is called anaerobic glycolysis. This process releases energy very rapidly. Glucose, or blood sugar, and stored carbs in the form of glycogen in your muscle cells are broken down through a series of steps to form a compound called pyruvate."}]