[{"url": "http://www.rightdiagnosis.com/l/lutz_lewandowsky_epidermodysplasia_verruciformis/intro.htm", "passage_text": "Lutz-Lewandowsky epidermodysplasia verruciformis: Introduction. Lutz-Lewandowsky epidermodysplasia verruciformis: A very rare skin disease where scaly macules (flat pigmented skin lesion) and skin bumps develop on the skin, especially on the back of the hands. Patients tend to be prone to skin cancers. "}, {"url": "http://www.buzzle.com/articles/epidermodysplasia-verruciformis.html", "passage_text": "Epidermodysplasia Verruciformis. Epidermodysplasia verruciformis (EV) is usually suspected with the appearance of generalized wart-like lesions early in life. A major concern for those affected by this condition is that the lesions may transform into skin cancer"}, {"url": "http://www.buzzle.com/articles/epidermodysplasia-verruciformis.html", "passage_text": "Epidermodysplasia verruciformis, also known as Lewandowsky-Lutz dysplasia or Lutz-Lewandowsky, is a skin condition named after the famous doctors Felix Lewandowsky and Wilhelm Lutz. This is an uncommon skin condition that causes increased susceptibility to several distinct human papillomavirus (HPV). Epidermodysplasia verruciformis (EV) is usually suspected with the appearance of generalized wart-like lesions early in life. A major concern for those affected by this condition is that the lesions may transform into skin cancer"}, {"url": "http://emedicine.medscape.com/article/1131981-clinical", "passage_text": "Epidermodysplasia verruciformis usually begins in infancy or early childhood, with the development of various types of flat, wartlike lesions and confluent plaques on the skin, especially on dorsal hands, extremities, face, and neck. Patients may also develop tinea versicolor-like lesions on the trunk. Epidermodysplasia verruciformis lesions may progress to form verrucous plaques and nodules, or they may transform into invasive squamous cell carcinomas, most commonly between the ages of 20 and 40 years. The clinical course of epidermodysplasia verruciformis is protracted. Epidermodysplasia verruciformis variants may be suspected when a patient has the typical clinical presentation in the setting of epidermodysplasia verruciformis–associated HPV but lacks nonmelanoma skin cancers at a young age or has late-onset disease."}, {"url": "http://emedicine.medscape.com/article/1131981-overview", "passage_text": "Epidermodysplasia verruciformis (EV) is a rare, inherited disorder that predisposes patients to widespread human papillomavirus (HPV) infection and cutaneous squamous cell carcinomas. Although the role of EVER1 and EVER2 genes in the pathogenesis of epidermodysplasia verruciformis remains unclear, one hypothesis is that they are involved in the control of HPV infection within keratinocytes, or they play a role in the immune response to the infection itself."}, {"url": "http://www.allhealthsite.com/epidermodysplasia-verruciformis.html", "passage_text": "Definition. Epidermodysplasia verruciformis, otherwise known as, Lutz-Lewandowsky epidermodysplasia verruciformis or Lewandowsky-Lutz dysplasia is a genetic disorder of the skin that is very rare in nature. It is particularly an autosomal recessive genetic disorder, with 10 to 20% of the cases being so. 1 Other cases of epidermodysplasia verruciformis, on the other hand, are predominantly spots that are white in color and very much resembles tinea and pityriasis versicolor, which usually develops in the trunk area. 2  Pityriasis versicolor, by the way, is a pale, rash caused by a yeast-like germ."}, {"url": "https://en.wikipedia.org/wiki/Epidermodysplasia_verruciformis", "passage_text": "From Wikipedia, the free encyclopedia. Epidermodysplasia verruciformis (also called Lewandowsky-Lutz dysplasia), colloquially known as tree man illness is an extremely rare autosomal recessive genetic hereditary skin disorder associated with a high risk of carcinoma of the skin. "}]