[{"url": "http://www.answers.com/Q/FAQ/4024", "passage_text": "Fossil fuels were formed from plants and animals that lived up to about 300 million years ago. The Sun passed solar energy to the plants, and plants were eaten by animals. The use of fossil fuels (coal, oil and natural gas) is a problem because the burning of these fuels in industry, transport and the generation of electricity releases carbon dioxide (CO2). This is causing global warming and climate change."}, {"url": "http://www.answers.com/Q/FAQ/4024", "passage_text": "Fossil fuels are a non-renewable source of energy. Formed from decomposed animals and plants that existed up to 300 million years ago, fossil fuels are located in the deposits beneath the earth. The use of fossil fuels (coal, oil and natural gas) is a problem because the burning of these fuels in industry, transport and the generation of electricity releases carbon dioxide (CO2). This is causing global warming and climate change."}, {"url": "http://www.energyquest.ca.gov/ask_quester/answers_fossil_fuels.html", "passage_text": "Fossil fuels (oil, natural gas and coal-that's why they're called fossil fuels) were formed from vegetation and yes, dinosaurs, deposited during the Carboniferous through the Permian eras which extended 380 to 245 million years ago. Once burned, however, fossil fuels cannot be used again, and they release gases such as carbon dioxide into the air. Such gases are not harmful in small amounts but the demand for energy is so great that millions of tons of these gases are released each year. This causes air pollution, which has a worldwide effect."}, {"url": "http://www.answers.com/Q/FAQ/4024", "passage_text": "A fossil fuel is any hydrocarbon that may be used as a source of energy. Coal, oil and natural gas are the three basic fossil fuels, formed 300 million years ago from organic plant and animal life subjected to great heat and pressure under the ground. They are classes as non-renewable sources of ene…. The use of fossil fuels (coal, oil and natural gas) is a problem because the burning of these fuels in industry, transport and the generation of electricity releases carbon dioxide (CO2). This is causing global warming and climate change."}, {"url": "https://en.wikipedia.org/wiki/Fossil_fuel", "passage_text": "Fossil fuels are fuels formed by natural processes such as anaerobic decomposition of buried dead organisms. The age of the organisms and their resulting fossil fuels is typically millions of years, and sometimes exceeds 650 million years. Fossil fuels contain high percentages of carbon and include coal, petroleum and natural gas. Other more commonly used derivatives of fossil fuels include kerosene and propane."}, {"url": "http://www.answers.com/Q/What_are_fossil_fuels", "passage_text": "A fossil fuel is any hydrocarbon that may be used as a source of energy. Coal, oil and natural gas are the three basic fossil fuels, formed 300 million years ago from organic plant and animal life subjected to great heat and pressure under the ground. They are classes as non-renewable sources of energy. Fossil fuels were formed from prehistoric plants and animals that lived millions of years ago. When these living things died, they decomposed and got buried under the layers of mud, rock and sand. Millions of years passed and the dead plants and animals slowly decomposed into organic material and fossil fuels."}, {"url": "http://www.answers.com/Q/What_are_fossil_fuels", "passage_text": "Fossil fuels are formed by photosynthesis in anaerobic organisms and plants which used the Sun's energy to split carbon dioxide into carbon and oxygen. The age of the organisms and their resulting fossil fuels is typically millions of years and sometimes exceeds 650 million years. Fossil fuels were formed from prehistoric plants and animals that lived millions of years ago. When these living things died, they decomposed and got buried under the layers of mud, rock and sand. Millions of years passed and the dead plants and animals slowly decomposed into organic material and fossil fuels."}, {"url": "https://answers.yahoo.com/question/index?qid=20061215180327AA6io3e", "passage_text": "Answers. Relevance. Rating Newest Oldest. Best Answer: Fossil fuels are hydrocarbons, primarily coal, fuel oil or natural gas, formed from the remains of dead plants and animals.[1] The theory that hydrocarbons were formed from these remains was first introduced by Mikhail Lomonosov in 1757. Submit. · just now. Report Abuse. Fossil fuels are hydrocarbons, primarily coal, fuel oil or natural gas, formed from the remains of dead plants and animals.[1] The theory that hydrocarbons were formed from these remains was first introduced by Mikhail Lomonosov in 1757."}]