[{"url": "http://www.salary.com/advice/layouthtmls/advl_display_Cat8_Ser9_Par26.html", "passage_text": "For instance, let's assume a job pays a salary of $40,000 (based on a 40-hour workweek-all Salary.com salaries are based on a 40-hour workweek). To get the hourly equivalent rate for the job, divide $40,000 by 2,080 hours (2,080 equals 40 hours per week times 52 weeks in a year). How can you compare a part-time to a full-time salary? A. In any negotiation, always try to get the other party to say a number first. That's as true for part-time work as for salary work. Part-time salaries are typically based on full-time salaries divided by the number of hours worked. Some companies pay part-time employees a discounted rate, that is, less than the equivalent full-time salary"}, {"url": "http://www.indeed.com/q-Part-Time-Biomedical-Equipment-Technician-jobs.html", "passage_text": "Ability to plan travel to customer sites in the most cost and time efficient manner.... 4 days ago-save job-email-more... 1  View all Xoran Technologies jobs in Atlanta, GA-Atlanta jobs. 2  Salary Search: Biomedical Equipment Technician salaries in Atlanta, GA. 3  Related forums: Xoran Technologies, LLC-Atlanta, Georgia - -. Troubleshoots equipment using available test equipment. Two or more years of experience as a Biomedical Technician.... 16 days ago-email. Get email updates for the latest Part Time Biomedical Equipment Technician jobs. My email: You can cancel email alerts at any time."}, {"url": "http://www.indeed.com/q-Part-Time-Biomedical-Equipment-Technician-jobs.html", "passage_text": "1 View all Fresenius Medical Care jobs in Warrington, PA-Warrington jobs. 2  Salary Search: Biomedical Technician salaries in Warrington, PA. 3  Learn more about working at Fresenius Medical Care. 4  Related forums: Fresenius Medical Care-Biomedical Technician-Warrington, Pennsylvania. Troubleshoots equipment using available test equipment. Two or more years of experience as a Biomedical Technician.... 16 days ago-email. Get email updates for the latest Part Time Biomedical Equipment Technician jobs. My email: You can cancel email alerts at any time."}, {"url": "http://www1.salary.com/Entry-Level-Salaries.html", "passage_text": "Well there are a wide range of jobs in the Entry Level category and their pay varies greatly. If you know the pay grade of the job you are searching for you can narrow down this list to only view Entry Level jobs that pay less than $30K, $30K-$50K, $50K-$80K, $80K-$100K, or more than $100K. Browse Entry Level jobs by salary range: , $30K-$50K, $50K-$80K, $80K-$100K, or. Search by: Keyword Category. Search. Jobs by Salary Ranges: Click a salary category to find jobs in your target salary range."}, {"url": "http://www.payscale.com/research/US/Job=Biomedical_Engineer/Salary", "passage_text": "(United States). The average pay for a Biomedical Engineer is $62,986 per year. Pay for this job rises steadily for more experienced workers, but goes down noticeably for employees with more than 20 years' experience. The skills that increase pay for this job the most are Clinical Research and Project Management. "}, {"url": "http://www.campusexplorer.com/careers/D789FBF8/biomedical-engineers/", "passage_text": "Biomedical engineers earn median annual salaries of $82,550. The highest 10 percent earn above $123,270, the lowest 10 percent earn below $49,480 and the middle 50 percent earn between $60,980 and $100,890. Engineers earn some of the highest starting salaries among college graduates with bachelor’s degrees."}, {"url": "https://nationalcareersservice.direct.gov.uk/advice/planning/jobprofiles/Pages/laboratorytechnician.aspx", "passage_text": "Starting salaries for lab technicians are around £15,000 a year. With experience and qualifications this can rise to between £20,000 and £25,000 a year. Senior lab technicians or those with managerial responsibilities may earn £25,000 a year or more. "}, {"url": "https://nationalcareersservice.direct.gov.uk/advice/planning/jobprofiles/Pages/biomedicalscientist.aspx", "passage_text": "Starting salary. £21,692 + per year. Biomedical scientists test samples from patients to support doctors and healthcare professionals in the diagnosis and treatment of disease. If you enjoy science and you are interested in medicine and health care, this could be a great job choice for you. "}, {"url": "http://forecasting.tstc.edu/techbriefs/biomedical-equipment-information-systems/", "passage_text": "An additional 40,000, or 40%, more healthcare information technology specialists will be needed nationally. Biomedical equipment technicians will grow by 21% nationally and in Texas by 2014. Biomedical equipment information systems specialists (BEISSs), picture archiving and communications specialist (PACS) engineers and biomedical PACS specialists have posted starting salaries of between $45,000 and $70,000 per year. (Texas LMCI Tracer) An additional 40,000, or 40% , more healthcare information technology specialists will be needed nationally. The need for biomedical equipment information systems specialists will continue to grow as a result of the convergence of these two specialties."}]