[{"url": "http://www.urbandictionary.com/define.php?term=Dandere", "passage_text": "Dandere. A dandere is a character archtype that entails someone being quiet which is usually associated with shyness. Dan comes from the word danmari which means silent and taciturn. Dere means to become lovey dovey. Not to be confused with Kuudere which is a cool person that becomes lovey dovey. They are very similar in appearence and possibly behavior, but their underlying character reasoning is different. Being silent for the sake of being silent vs being cool. "}, {"url": "http://allthetropes.wikia.com/wiki/Kuudere", "passage_text": "—The Talosians, Cold on the outside ... One of the newer neologisms, a kuudere rounds out the dere family in a rather basic way. Allegorically speaking, a kuudere is like snow: it may be cold and harsh at first glance but it is also what keeps autumn's seeds warm and safe until spring. Can overlap with Tall, Dark and Bishoujo as her appearance is a perfect fit for a Kuudere's personality. Part of the dere family along with Tsundere (angry outside, sweet inside and vice-versa), Yandere (sweet outside, Ax Crazy inside), and Dandere (unsocial outside, sweet inside)."}, {"url": "http://blog.honeyfeed.fm/what-is-kuudere-gets-you-a-birthday-card-and-leaves-it-on-the-table-without-telling-you-definition-meaning/", "passage_text": "So the basis of a kuudere character is someone who stays aloof, potentially making it clear that this is well below them, but in reality they actually have a very soft spot for the main character. The other main difference to point out is a tsundere versus a kuudere. "}, {"url": "http://www.urbandictionary.com/define.php?term=Kuudere", "passage_text": "Kuudere. An anime/manga slang term for a character that is cold, blunt, cynical, and pretty much doesn't care if her beloved dies. That's what she is on the outside but she is actually caring and nice on the inside. Differs from tsundere since tsundere is when the character frequently runs hot and cold between tsun and dere. Kuudere is when the character only occasionally shows her caring sid"}, {"url": "http://hero.wikia.com/wiki/Kuudere", "passage_text": "The main difference between Tsundere and Kuudere is that tsunderes constantly switch between 'tsun' and 'dere', while kuuderes only occasionally show their 'dere' side. Because of this, they are perhaps the most 'evil' of the four terms(the obvious exception being Yandere) with all but a few being anti-heroes. For example, Kiritsugu Emiya from Fate/Zero can be considered a Kuudere because of his tendency to hide his feelings for his wife, as he believes he has to act cold and professional to win the Fourth Holy Grail War."}, {"url": "http://hero.wikia.com/wiki/Kuudere", "passage_text": "Kuudere is a popular anime/manga character archetype that derives from the Japanese pronunciation of the English word 'cool'. For example, Kiritsugu Emiya from Fate/Zero can be considered a Kuudere because of his tendency to hide his feelings for his wife, as he believes he has to act cold and professional to win the Fourth Holy Grail War."}, {"url": "http://kotaku.com/how-to-identify-popular-japanese-character-types-1169085239", "passage_text": "Kuudere. The “kuu” in kuudere comes from the Japanese pronunciation of the English word “cool” (クール) and thus is used for a person who is calm and composed on the outside. They are the ones who are serious and always in charge of a situation. They never panic and are who everyone else turns to in a crisis. "}, {"url": "https://answers.yahoo.com/question/index?qid=20130224112906AA0Ufwh", "passage_text": "Kuudere is different from tsundere because tsundere are not emotionless and express their feelings in a more loud,anger-like way. But kuuderes are just quiet and emotionless. Rating Newest Oldest. Best Answer: Tsundere: When someone acts strong, cold, and hostile towards others but they actually are a very warm person. They gradually show their nice side towards another person."}]