[{"url": "https://en.wikipedia.org/wiki/Catalin", "passage_text": "Catalin is a phenol formaldehyde resin, and can be worked with files, grinders and cutters and polished to a fine sheen. Catalin is produced by a different manufacturing process, a two-stage process, than other types of phenolic resins. It does not contain fillers, such as sawdust or carbon black. Catalin is transparent, near colorless, rather than opaque. Unlike other phenolics, it can be produced in bright colors or even marbled. Catalin jewelry, more commonly referred to incorrectly as Bakelite jewelry, was made from the 1930s until the end of WWII when it became too expensive, as every piece had to be individually cast and polished. The Catalin Corporation introduced 15 new colors in 1927 and developed techniques to create marbling."}, {"url": "https://en.wikipedia.org/wiki/Catalin", "passage_text": "Catalin is, perhaps, worldwide the most recognized plastic, and was used from the 1930s to 1950s for many household objects, jewelry, small boxes, lamps, cutlery handles, and desk sets. Catalin jewelry, more commonly referred to incorrectly as Bakelite jewelry, was made from the 1930s until the end of WWII when it became too expensive, as every piece had to be individually cast and polished. The Catalin Corporation introduced 15 new colors in 1927 and developed techniques to create marbling."}, {"url": "http://www.ebay.com/gds/WHAT-IS-CATALIN-PHENOL-AND-BAKELITE-/10000000008175075/g.html", "passage_text": "Catalin is a brand name for a thermosetting plastic popular in the 1930s. Chemically, it's a phenol formaldehyde resin. Catalin is a cast bakelite product, with a different manufacturing process (two-stage process) than other types of bakelite resins (without using fillers such as sawdust or carbon black). Bakelite is a material based on the thermosetting phenol formaldehyde resin, polyoxybenzylmethylenglycolanhydride developed in 1907–1909 by Belgian Dr. Leo Baekeland."}, {"url": "https://cycleback.wordpress.com/2013/01/31/bakelite-and-catalin-phenol-formaldehyde-identifying-the-popular-early-plastics/", "passage_text": "Bakelite and catalin are trade names for closely related antique plastics that are popularly collected today in the form of old timey radios (‘catalin radios’), colorful jewelry, toys and more. The following is an introduction to the plastics and an identification guide. Bakelite and catalin are both made from phenol and formaldehyde, and are phenol formaldehyde resins. Because of this they have many of the same characteristics. However, the two were made in different ways so also have distinct differences."}, {"url": "https://cycleback.wordpress.com/2013/01/31/bakelite-and-catalin-phenol-formaldehyde-identifying-the-popular-early-plastics/", "passage_text": "vintage catalin radio. Bakelite and catalin are trade names for closely related antique plastics that are popularly collected today in the form of old timey radios (‘catalin radios’), colorful jewelry, toys and more. The following is an introduction to the plastics and an identification guide. Bakelite and catalin are both made from phenol and formaldehyde, and are phenol formaldehyde resins. Because of this they have many of the same characteristics. However, the two were made in different ways so also have distinct differences."}, {"url": "http://www.coololdgames.com/CatvsBak.html", "passage_text": "Strictly speaking, Catalin and Bakelite are both tradenames for the same compound: phenol formaldehyde. However, the terms are often used to distinguish cast phenolics (Catalin) and molded phenolics (Bakelite). Which terms are used largely depends on the circle in which you run. Radio collectors refer to the brightly-colored cast phenolics as catalin, despite the cast radio parts being manufactured by Bakelite, Catalin, Marblette, Monsanto, and Knoedler. Vintage Mah jong collectors refer to opaque game pieces as bakelite and more translucent or swirled pieces as catalin."}, {"url": "https://cycleback.wordpress.com/2013/01/31/bakelite-and-catalin-phenol-formaldehyde-identifying-the-popular-early-plastics/", "passage_text": "Bakelite/catalin hot water and rub test: Hold the plastic under hot water for perhaps 15 seconds, then smell it. If it smells strongly like medicinal chemicals, then it likely is bakelite/catalin. Though it doesn’t work as well, you can rub the plastic with your them and sniff for the strong medicinal small. The following is an introduction to the plastics and an identification guide. Bakelite and catalin are both made from phenol and formaldehyde, and are phenol formaldehyde resins. Because of this they have many of the same characteristics. However, the two were made in different ways so also have distinct differences."}, {"url": "http://www.thinkbabynames.com/meaning/0/Catalin", "passage_text": "Catalin /ca-tal-in/ [3 sylls.] as a name for girls. Catalin's root is Greek, and the meaning of Catalin is pure. Catalin is an alternate form of Catherine (Greek): from katharos. Catalin is also a variant of Katherine (Greek). Catalin is alike in pronunciation to Caitilin, Catelan, Catelinn, Catelyn and Katelin ▼ . Other recommended similar baby names are Caetlin, Caralin, Catlain, Catlin, Catline and Catlyn. These names tend to be more frequently used than Catalin."}, {"url": "http://www.merriam-webster.com/dictionary/Catalin", "passage_text": "Definition of CATALIN. : a thermosetting plastic made of a cast phenol-formaldehyde resin and marked by high compressive strength and ready machinability. ADVERTISEMENT. formerly a U.S. registered trademark. First Known Use: 1929. "}]