[{"url": "http://www.astm.org/Standards/D3786.htm", "passage_text": "Significance and Use. 5.1 This method for the determination of diaphragm bursting strength of knitted, nonwoven and woven fabrics is being used by the textile industry for the evaluation of a wide variety of end uses. "}, {"url": "http://research.cnr.ncsu.edu/wpsanalytical/documents/51BURSTINGSTRENGTH.doc", "passage_text": "Introduction. The bursting strength of paper or paperboard is a composite strength property that is affected by various other properties of the sheet, principally tensile strength and stretch. Generally, bursting strength depends upon the kind, proportion, and amount of fibers present in the sheet, their method of preparation, their degree of beating and refining, upon sheet formation, and the use of additives."}, {"url": "http://www.businessdictionary.com/definition/burst-strength.html", "passage_text": "Pressure at which a film or sheet (of paper or plastic, for example) will burst. Used as a measure of resistance to rupture, burst strength depends largely on the tensile strength and extensibility of the material. Determined by procedures such as Mullen burst test, it is expressed commonly in pounds per square inch (psi) . Burst strength of packaging material used in shipment of merchandise is usually printed on the package. Also called bursting strength. See also stacking strength."}, {"url": "http://www.testingmachines.com/property/burst-strength", "passage_text": "Burst Tester for Textiles including Nonwovens Burst Testers are used as a multi-directional tensile test to identify failure in the direction of least resistance for evaluating physical burst strength and fiber bond in textile and nonwoven materials. Models are available to test a variety of materials. "}, {"url": "http://www.merriam-webster.com/dictionary/bursting%20strength", "passage_text": "Definition of BURSTING STRENGTH. : the capacity of a material (such as a paper or textile) or object (such as a metal pipe) to maintain in continuity when subjected to pressure; broadly: the pressure often expressed in pounds per square inch required to rupture such a material or object under rigidly controlled conditions. ADVERTISEMENT. "}, {"url": "http://www.youtube.com/watch?v=ThlHCJyj9zg", "passage_text": "Digital Bursting Strength Tester is used to check the bursting strength of fabrics, sheet, papers, etc. Capacity 4000 kpa, 568 psi/7000 kpa, 1000 psi. "}, {"url": "http://printwiki.org/Bursting_Strength", "passage_text": "Bursting strength is measured utilizing a rubber diaphragm that is expanded hydraulically against the paper sample. A bursting test is also known as a Mullen test or pop test, and a minimum bursting strength is required for cartons used for shipping. Bursting strength is a function of various processes performed in the papermaking process. The increased use of fillers decreases bursting strength, while the increased use of longer fibers and surface sizing increases a paper's bursting strength."}, {"url": "http://www.smitherspira.com/services/materials-testing/paper-physical-tests/bursting-strength", "passage_text": "Bursting Strength. Smithers Pira perform our burst tests to BS 3137, BS 2922:1, ISO 2758 and ISO 2759. The burst test is frequently used as a general guide to the strength of paper, solid board and corrugated board. Bursting strength is usually quoted in kPa. We determine bursting strength using a Mesmmer digital hydraulic paper or digital hydraulic board burst tester"}, {"url": "http://printwiki.org/Bursting_Strength", "passage_text": "A property of paper or paperboard used in packaging that measures its resistance to rupturing, defined as the hydrostatic pressure needed to burst a paperboard sample when it is applied uniformly across its side. Bursting strength is a function of various processes performed in the papermaking process. The increased use of fillers decreases bursting strength, while the increased use of longer fibers and surface sizing increases a paper's bursting strength."}]