[{"url": "https://uk.answers.yahoo.com/question/index?qid=20061015052405AAOVpGe", "passage_text": "Best Answer: Not long, but cook it in a traditional oven. The taste is so much better. Use King Edward potatoes scrub and prick put on baking tray and into oven gas mark 7 for and 1 hour 10 mins, test to see if cooked turn up oven to mark 9 for last five minutes of cooking time...lovely crisp skin."}, {"url": "http://www.wikihow.com/Bake-a-Potato-in-the-Microwave", "passage_text": "1 For example, if one large potato takes 10 minutes to cook, two large potatoes would take between 16-17 minutes. 2  If you prefer crispy skinned potatoes, you can cook the potatoes in the microwave for 5-6 minutes, then transfer to a baking sheet and bake in an oven preheated to 400 °F (204 °C) for 20 minutes."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20090222095015AA4XChJ", "passage_text": "To cook a jacket potato in a microwave requires approx 4-5 minutes in an 800 microwave, but you need to make sure you turn the potato instead of leaving it in the same position for the complete cooking period. I normally finish it off in the oven to crisp the skin up. Source(s): personal. R M · 7 years ago."}, {"url": "http://www.wikihow.com/Bake-a-Potato-in-the-Microwave", "passage_text": "1 If you prefer crispy skinned potatoes, you can cook the potatoes in the microwave for 5-6 minutes, then transfer to a baking sheet and bake in an oven preheated to 400 °F (204 °C) for 20 minutes."}, {"url": "http://www.wikihow.com/Cook-a-Sweet-Potato-in-the-Microwave", "passage_text": "1 If you prefer crispy skinned sweet potatoes, you can cook the potatoes in the microwave for 5-6 minutes, then unwrap your sweep potato and transfer it to a baking sheet and bake in an oven preheated to 400 °F (204 °C) for 20 minutes."}, {"url": "http://www.wikihow.com/Bake-a-Potato-in-the-Microwave", "passage_text": "6. Put the plate in the microwave and choose a cooking time. Cooking times will vary depending on the size of the potato and the power of the microwave. Most medium to large potatoes will take between 8-12 minutes to cook at full power."}, {"url": "http://www.answers.com/Q/How_do_you_cook_a_baked_potato_in_the_microwave", "passage_text": "Depending on size of potato, place in Microwave for 7 - 10 minutes. Feel the potato. If it has gotten a little soft, take the potato with the papertowel and wrap in foil tying ends together. Let stand for about 5 minutes."}, {"url": "http://www.answers.com/Q/How_long_does_it_take_to_cook_a_jacket_potato_in_the_microwave", "passage_text": "In an 800 watt microwave, it takes 7-10 minutes (depending how big the potato is). A microwave with a lower wattage will take slightly longer. To stop the potato exploding during cooking, you should prick the skin of the potato with a fork/knife a few times on each side."}]