[{"url": "http://www.microsoft.com/resources/documentation/windows/xp/all/proddocs/en-us/sag_setup_indirect_printer.mspx", "passage_text": "If your printer attaches to your computer with a parallel port (LPT port), connect the printer to your computer, and then open Printers and Faxes Double-click Add Printer to start the Add Printer Wizard, and then click Next. 3. If you could not install your printer using Plug and Play, or if the printer is attached to your computer with a serial (COM) port, then open Printers and Faxes. 4. Double-click Add Printer to start the Add Printer Wizard, and then click Next. 5"}, {"url": "https://www.verizon.com/support/residential/internet/fiosinternet/networking/setup/addwireless/125684.htm", "passage_text": "Adding a computer with a wireless adapter to a network using Windows XP Adding a computer with a wireless adapter to a network using Windows XP Before you begin: You’ll need your network's SSID, encryption type (WPA or WEP), and encryption key. The instructions you follow depend on the type of router you use to connect to FiOS Internet. To add a computer with a wireless adapter to a wireless network using Windows XP:Click Start in the lower left Taskbar.Select Control Panel."}, {"url": "https://answers.yahoo.com/question/index?qid=20080927084808AAK0Za4", "passage_text": "Best Answer: Click the START button and go to PRINTERS AND FAXES and then click the ADD A PRINTER link on the left and then click Next on the screen that pops up. Then hit the radio button for A NETWORK PRINTER, OR A PRINTER ATTACHED TO ANOTHER COMPUTER and the click NEXT. "}, {"url": "http://smallbusiness.chron.com/connect-wireless-printer-windows-xp-63670.html", "passage_text": "To install a network printer to this operating system, obtain the IP address or URL of the wireless device, and then use the Add Printer Wizard to inform Windows XP of the location of the printer. Click Start, choose Printers and Faxes, and then select Add a Printer from Printer Tasks in the left pane. Related Reading: How to Determine if a Printer is Compatible With Windows XP. Step 3. Click Next on the Welcome to the Add Printer Wizard screen. Select A Network Printer, or a Printer Attached to Another Computer, and then click Next.. Step 4. Choose Connect to a Printer on the Internet or on a Home or Office Network from the options"}, {"url": "http://answers.microsoft.com/en-us/windows/forum/windows_xp-desktop/windows-xp-will-not-connect-to-my-wireless-printer/2bb63c6e-ae7b-4cca-bf2c-b3a620408ede", "passage_text": "PZ. PZ. I have a wireless network which is connected to a Canon MP640 wireless printer. From my laptop which is running Windows XP, in network places I can see the printer as a connection-it sees it as it would another PC. I tried to add it as a printer using the windows function Add printer, network printer. "}, {"url": "http://www8.hp.com/us/en/campaigns/wireless-printing-center/reconfiguring-system-help2.html", "passage_text": "First make sure your computer is connected to your network. If your printer is not currently connected to your computer, connect the USB cable between the computer and the printer. Make sure your HP printer software is installed on your computer. If your HP printer software is installed, use Windows XP, Windows Vista or Windows 7: For Windows 8/8.1: 1  Launch the Printer Software from the Start screen (using the icon for your printer model) or from the tile named for your printer. 2  Select (click or touch) Utilities on the top of the Printer Software screen. 3  Select Printer Setup & Software. 4  Select Convert a USB connected printer to Wireless. 5  Mac OS X:"}, {"url": "https://support.microsoft.com/en-us/kb/307847", "passage_text": "Note: To connect to an Internet printer, you can also type the URL of the printer in any window or folder with an Address bar, such as Windows Explorer, My Computer, or the Printers and Faxes folder. To view the printers installed on your computer, click Start, and then click Printers and Faxes. "}, {"url": "https://www.verizon.com/support/residential/internet/fiosinternet/networking/setup/addwireless/125684.htm", "passage_text": "Log in to your router from a computer already connected to your wireless network. The instructions you follow depend on the type of router you use to connect to FiOS Internet. To add a computer with a wireless adapter to a wireless network using Windows XP:Click Start in the lower left Taskbar.Select Control Panel. [Show Me]Click the Network and Internet Connections category. [Show Me]. 1  Review the sticker on the back of your router"}]