[{"url": "http://www.chemicalformula.org/vinegar", "passage_text": "Chemical formula for vinegar. Vinegar is composed of about 5% acetic acid. This is the major chemical component of vinegar. The systematic or proper chemical name of acetic acid is ethanoic acid. Vinegar is a weak acid produced by the oxidation of alcohol (ethanol) from wines and ciders by bacteria. It has a pleasant sour taste and is used in cooking or as a condiment. It is commercially sold as white vinegar, brown vinegar, cider vinegar and balsamic vinegar. The complete structural formula of acetic acid is as follows. The condensed structural formula for acetic acid (the main component in vinegar) is CH3COOH. This formula is a shorthand way of representing the complete structural formula (see above picture). The first carbon atom is surrounded by three hydrogen atoms"}, {"url": "http://www.answers.com/Q/What_is_the_chemical_formula_of_vinegar", "passage_text": "1 The Chemical Formula of Vinegar Vinegar is a weak acid having as its main active ingredient acetic acid. 2  The vinegar chemical formula includes the following elements: hydrogen, carbon, and oxygen. 3  About fiv…. 4  The Periodic Table of Elements Life is sustained by a number of chemical elements. The composition of distilled white vinegar is usually 5% acetic acid which has a molecular formula of C2H4O2. The remainder of the solution is H2O."}, {"url": "http://www.sophisticatededge.com/what-is-the-chemical-formula-for-vinegar.html", "passage_text": "Answer: Vinegar contains the chemical known as acetic acid, and its chemical formula is properly written CH3COOH. Vinegar may also contain water and other non-reactive components that give it color or flavor. "}, {"url": "https://en.wikipedia.org/wiki/Acetic_acid", "passage_text": "Acetic acid /əˈsiːtɨk/ , systematically named ethanoic acid /ˌɛθəˈnoʊɨk/ , is an organic compound with the chemical formula CH 3 COOH (also written as CH 3 CO 2 H or C 2 H 4 O 2). It is a colourless liquid that when undiluted is also called glacial acetic acid. Vinegar is roughly 3–9% acetic acid by volume, making acetic acid the main component of vinegar apart from water. Acetic acid has a distinctive sour taste and pungent smell. Besides its production as household vinegar, it is mainly produced as a precursor to polyvinylacetate and cellulose acetate."}, {"url": "http://www.answers.com/Q/What_is_the_chemical_formula_of_vinegar", "passage_text": "Vinegar's formula is very dilute CH3COOH. Vinegar is mainly water (H2O), but is also comprised of acetic acid (the boxlike acid which gives vinegar its pungent/sour smell). Vinegar is a liquid produced by aerobic fermentation (meaning: it needs oxygen) of alcohol into acetic acid as well as other fermentation byproducts. The composition of distilled white vinegar is usually 5% acetic acid which has a molecular formula of C2H4O2. The remainder of the solution is H2O."}, {"url": "http://www.chemicalformula.org/chemistry-help/facts-about-vinegar", "passage_text": "1 Vinegar is a mixture of about 5% acetic and water with a small amount of other flavoring and coloring chemicals which depends on the method of production. 2  eg. balsamic vinegar, apple vinegar, brown vinegar and white vinegar. 3  The chemical formula for vinegar is shown by its main component, acetic acid. 1 Vinegar is a weak acid with a pH of 2-3. 2 "}, {"url": "http://scienceline.ucsb.edu/getkey.php?key=4147", "passage_text": "Dilute acetic acid is the chemical name for vinegar, and its chemical formula is CH 3 COOH. From here on out I will write the chemical formulas in parentheses. Baking soda is a base, and vinegar is an acid. An acid is a chemical that wants to get rid of a proton, or a positively charged hydrogen atom. The chemical name for baking soda is sodium bicarbonate. Its chemical formula is NaHCO 3, meaning it's made of one sodium atom, one hydrogen atom, one carbon atom, and three oxygen atoms. Vinegar is a mixture of acetic acid and water."}]