[{"url": "http://www.larrysiegel.com/depass.htm", "passage_text": "In television, he has appeared on the Mike Douglas Show, the Tonight Show, the Merv Griffin Show, the Ed Sullivan Show and many others. In addition to writing and appearing in many industrial shows, Steve has also performed at many hotels throughout the United States and Puerto Rico."}, {"url": "http://thelynneshow.com/2011/02/interview-with-steve-depass/", "passage_text": "2-8-11. Apparently born with words in his mouth. Steve DePass was rhyming from the moment he could speak and performing on Broadway with Jimmy Durante at five years old."}, {"url": "http://www.larrysiegel.com/depass.htm", "passage_text": "Because of his uncanny ability to improvise and ad lib, Vice President Nelson Rockefeller once referred to Steve DePass as the Carl Sandburg of our time. In concert Steve has performed at the White House and at Carnegie Hall."}, {"url": "http://www.larrysiegel.com/depass.htm", "passage_text": "Steve DePass is a master of improvisation. He is a poet, a singer and a composer. He actually invents songs on the spot using topics suggested by his audience. These songs are at once witty, poignant, satirical, humorous or philosophical and often consist of complicated rhymes and sophisticated ideas."}, {"url": "http://www.tv.com/shows/the-garry-moore-show/episodes/", "passage_text": "Roy Castle's marionette dance singing Get Married with Garry, Steve and Durward as he introduces his wife Fiona. Dorothy appears as silent screen star Elsie Teardrop. Steve sings Night and Day, Without a Song and Baby, Won't You Please Come Home. Dorothy as Snow White in a fairytale version of Eleventh Hour."}, {"url": "http://www.tv.com/shows/the-garry-moore-show/episodes/", "passage_text": "Garry's guests are Allan Sherman, Vicki Carr, Steve DePass, Miriam Makeba, The Hi-Los and bandleader Si Zentner. Also with regular Durward Kirby. Highlights: Garry and his troupe off an Easter Parade medley. Miriam sings Lakutshn, Fiane (Lovely Lies) and The Click Song."}]