[{"url": "http://ipimediaworld.com/wp-content/uploads/2013/06/2-Patient-Recruitment-Driving-Lenght-and-Cost-of-Oncology-Clinical-Trials.pdf", "passage_text": "In one study, the average total cost for Phase III trials ($41.7 million) stood four times higher than the average cost for Phase II trials ($10.2 million). But much of those cost differences are the result of the larger patient enrolment required during Phase III."}, {"url": "http://www.aaiconsulting.com/pricing/", "passage_text": "In general terms the price for a Phase I ESA can range from $2,000 for a bare-ground property in suburban Portland to $5,000 or more for a large, complex industrial site. We calculate our fee based on an approximate billing rate of $95/hour, then add in travel costs and other expenses necessary to complete your report."}, {"url": "http://www.rmagreen.com/rma-blog/bid/89507/how-much-does-a-phase-i-environmental-site-assessment-cost", "passage_text": "We discuss some key factors that influence the cost and price of any Phase I Environmental Site Assessment, regardless of where and who prepares the report for you. We get a lot of calls from new and old clients asking how much a Phase I ESA costs."}, {"url": "http://medrio.com/partners/the-top-5-cost-drivers-in-phase-i-clinical-trials/", "passage_text": "Clinical trial costs have skyrocketed over the past decade with early phase trials showing the greatest per-patient cost increase of any category, on both a raw dollar and percentage basis. In fact, from 2008 to 2013, the average cost per patient increased by $23,600, or by 157%."}, {"url": "http://www.clinicalleader.com/doc/understanding-key-early-phase-clinical-trial-cost-drivers-0001", "passage_text": "1. Staff or Resource Cost. Staff cost is the biggest driver within the early phase clinical trial category ranging between 40 to 45 percent of the overall cost. The early phase market saw Phase 1 staffing costs rise by 157 percent from 2008 to 2013 as the average number of CRAs assigned to a Phase 1 trial increased."}, {"url": "http://medrio.com/partners/the-top-5-cost-drivers-in-phase-i-clinical-trials/", "passage_text": "1. Staffing: 40- 45%. Staffing is the biggest cost driver in early phase clinical trials, ranging from 40 to 45 percent of the total cost. Phase I staffing costs per patient rose from 2008 to 2013 as companies hired more CRAs per Phase I trial. The staff increase was mainly a result of the increased complexity of early phase trials with a mean number of 00 procedures per patient for Phase I trials as of 2012 to 2013."}, {"url": "http://www.actenvirons.com/property.htm", "passage_text": "A Phase I Environmental Site Assessment of a typical commercial property costs between $1,500.00 and $2,000.00. The cost of a Phase II Environmental Site Assessment will depend upon the amount of sampling required, but can generally be expected to cost between $5,000.00 and $10,000.00."}]