[{"url": "http://pets.costhelper.com/spay-neuter-dog.html", "passage_text": "1 The cost of spaying, a more complicated surgery, usually ranges from about $50 to $175. 2  Some clinics and animal hospitals can charge up to $200-$300 or more, depending on the weight of the dog. 3  The cost of both neutering and spaying vary greatly by geographic region, and even by veterinarian. 1 Extra pain medication, usually an injection before surgery and a pill for later, usually costs between $10 and $30. 2  For male dogs, testicular implants are available. 3  They cost between $94 and $919 per pair, depending on the size and model. 4  Neuticles.com offers a detailed description of the product."}, {"url": "http://www.pet-informed-veterinary-advice-online.com/dog-spaying.html", "passage_text": "2. Canine spaying pros and cons-the reasons for and against spaying a dog. 2a. The benefits of dog spaying (the pros of dog spaying) - reasons for spaying your dog.2b. The disadvantages of desexing (the cons of dog spaying) - why some people choose not to spay their female dogs. 3. Information about dog spaying age: when to spay a dog. The following two subsections discuss desexing age recommendations and how they have been established as well as the pros and cons of early age (8-16 weeks) dog spaying (spaying a puppy)."}, {"url": "http://pets.costhelper.com/spay-neuter-dog.html", "passage_text": "1 Spaying a pregnant dog costs about $50 to $125 extra. 2  Laser surgery can reduce pain, bleeding and swelling, and can be more precise, but costs between one-quarter and one-third more. 3  Most veterinarians offer the option of pre-anesthesia blood work, to make sure the liver and kidneys are working properly, for about $40. 1 Extra pain medication, usually an injection before surgery and a pill for later, usually costs between $10 and $30. 2  For male dogs, testicular implants are available. 3  They cost between $94 and $919 per pair, depending on the size and model. 4  Neuticles.com offers a detailed description of the product."}, {"url": "https://www.bluecross.org.uk/pet-advice/neutering-your-dog", "passage_text": "The cost of castration or spaying a dog can vary a lot depending on the type of dog you have so it’s best to check with your vet. Several charities, including The Blue Cross, can help with the cost of neutering dogs so contact your nearest one to find out more. "}, {"url": "https://answers.yahoo.com/question/index?qid=20071221154546AA2DEqY", "passage_text": "In reality, you'll find that a dog spay will cost around $300, give or take depending on the size of the dog, any other health conditions, and where you go to have the procedure done. I would HIGHLY reccommend private veterinarians if the option is there. "}, {"url": "http://pets.costhelper.com/spay-neuter-dog.html", "passage_text": "1 Some clinics and animal hospitals can charge up to $200-$300 or more, depending on the weight of the dog. 2  The cost of both neutering and spaying vary greatly by geographic region, and even by veterinarian. 1 Extra pain medication, usually an injection before surgery and a pill for later, usually costs between $10 and $30. 2  For male dogs, testicular implants are available. 3  They cost between $94 and $919 per pair, depending on the size and model. 4  Neuticles.com offers a detailed description of the product."}, {"url": "http://www.peteducation.com/article.cfm?c=2+2109&aid=926", "passage_text": "Spaying a dog before her first heat is the best way to significantly reduce the chance your dog will develop mammary cancer. The risk of malignant mammary tumors in dogs spayed prior to their first heat is 0.05%. It is 8% for dog spayed after one heat, and 26% in dogs spayed after their second heat. In the United States, most dogs are spayed between 5 and 8 months of age. Many animal shelters and veterinarians are starting to spay female animals at a younger age, even at 2 months."}, {"url": "http://www.answers.com/Q/What_is_the_cost_to_spay_a_female_dog", "passage_text": "The cost will vary by location, and and by veterinarian. Generally, the cost of spaying, a more complicated surgery, usually ranges from about $50 to $175 or more. The cost for spaying a female dog varies hugely, even throughout the UK. My local vet (way out in the sticks) charges around £90-odd but in a big city you will most likely be … looking at a lot more. Some will also charge different rates according to dog breed and size and maybe even age."}, {"url": "http://www.pet-informed-veterinary-advice-online.com/dog-spaying.html", "passage_text": "A dog of 25-50kg may cost $400 to spay. A dog of 50kg+ may cost $500 to spay. These are not accurate costs, I am just using them as example. If your pet is an overweight terrier that weighs in at 11kg, then you will be charged$350 to have her spayed (the same price as a 20kg Border Collie). Information about dog spaying age: when to spay a dog. The following two subsections discuss desexing age recommendations and how they have been established as well as the pros and cons of early age (8-16 weeks) dog spaying (spaying a puppy)."}]