[{"url": "http://www.clearupmyrecord.com/what-to-expect-how-long-a-record-expungement-can-take.php", "passage_text": "Time to Expunge California Criminal Record. In California, you can apply for a dismissal of criminal charges. If your petition is successful, potential employers cannot ask you about your criminal record. You will need to appear in court to defend your petition. The whole process should take at least eight to ten weeks. You may have to gather supplementary evidence to support your case. Then the forms must be processed. This can take a long time depending on the state and how clogged their system is. Individuals may then be asked to fill out supplementary forms, which they may have to wait for."}, {"url": "http://www.clearupmyrecord.com/what-to-expect-how-long-a-record-expungement-can-take.php", "passage_text": "The average time it takes to expunge a Florida record is five to seven months, which includes the month it takes to apply for and receive a Certificate of Eligibility. You may have to gather supplementary evidence to support your case. Then the forms must be processed. This can take a long time depending on the state and how clogged their system is. Individuals may then be asked to fill out supplementary forms, which they may have to wait for."}, {"url": "http://sealmyrecord.com/sealing-expungement/process", "passage_text": "Again, the time to complete a Florida record sealing or record expungement is 5-7 months on average. The length of time depends on various factors: 1  Whether your case is going to be a sealing or expungement (expungements take a bit more time due to additional legal requirements); 1 Whether your case is going to be a sealing or expungement (expungements take a bit more time due to additional legal requirements); 2  How fast the state attorney sign off on the disposition of your case (for expungements only); 3  The county your case is in."}, {"url": "http://www.recordgone.com/florida/fl-expungement-sealing-faq.htm", "passage_text": "Typically, the process takes nine to twelve months (Palm Beach and Hillsborough counties are taking twelve months) to seal or expunge a criminal record in Florida. We base that estimate on how long the average case takes in Florida. "}, {"url": "http://www.ericmathenylaw.com/Criminal-Defense-Blog/2010/July/How-Long-Does-A-Sealing-or-Expungement-Take-.aspx", "passage_text": "MIAMI-DADE COUNTY: Misdemeanor expungements take 4 - 6 months. This is because the Miami-Dade State Attorney's Office must process the applications before they can be sent to FDLE. This process alone takes about 6 weeks. After the 6-week period, an approved application is returned to me. Felony expungements in Miami-Dade do not take as long. This is because of the remarkable turnaround time. The State Attorney's Office typically returns approved applications within 8-10 business days. I then follow the same procedure as I would with a misdemeanor expungement."}, {"url": "http://yourfloridacriminalattorney.com/expunge-record-fdle-expungement/", "passage_text": "4) For an expungement, your case must have been dismissed by the State or the Judge; 5) If you received a withhold of adjudication, you are eligible to have your record sealed, but not expunged subject to certain exceptions in Florida Statute 943.059. "}, {"url": "http://palmalawgroup.com/sealing-expungement-of-criminal-records/", "passage_text": "The average time to complete a Florida record sealing or expungement is 5-7 months on average. The length of time depends on various factors: Whether your case is going to be a sealing or expungement (expungements take a bit more time due to additional legal requirements); The FDLE can sometimes take 3-5 months to process your application to seal or expunge your record depending on their backlog of cases; The procedure for having the final petition considered. Again, some counties are just more efficient than others when we are at the final stage of your case."}, {"url": "http://sealmyrecord.com/sealing-expungement/process", "passage_text": "On average, record sealing or record expungement can take anywhere from 5 to 7 months. WARNING: Beware of anyone who tells you they can have your record sealed in less than 5 months. Ask them to put their promise in writing and we expect they won't. There is NO EXPEDITED or RUSH procedure to get this done. 1 Whether your case is going to be a sealing or expungement (expungements take a bit more time due to additional legal requirements); 2  How fast the state attorney sign off on the disposition of your case (for expungements only); 3  The county your case is in."}, {"url": "http://sealmyrecord.com/blog/how-long-does-it-take-seal-or-expunge-arrest-record-florida", "passage_text": "1 FDLE backlogs. 2  When an application to seal or expunge is submitted to the FDLE, the FDLE can take 3-4 months to process these applications. 3  Their website states that the turn around time is a month, but that is very rare. 4  They have so many cases to deal with, that the true turn around time is more like 3-4 months. 1 On average the state will take 4-6 weeks to review, sign, and return the form to our offices. 2  FDLE backlogs. 3"}]