[{"url": "http://www.proplants.com/guide/cymbidium-orchids-plant-care-guide", "passage_text": "Of all the orchid genera, the Cymbidium orchid is one of the easier to care for, particularly if you want your orchids outside for much of the year. Because most commercially available Cymbidium orchids are terrestrials, they must have special, loose media to grow in. Light: Cymbidium orchid light requirements include: morning sun or afternoon sun, with protection from the hot mid-day sun. A light-green leaf with just a hint of yellow indicates the maximum amount of sun the plant can take, and a dark-green leaf indicates not enough sun."}, {"url": "https://en.wikipedia.org/wiki/Cymbidium", "passage_text": "Asian Cymbidiums or Chinese Cymbidiums refer to mainly five species of cymbidiums orchids that are found throughout East Asia in areas of China, Korea, Japan, India, and in parts of Thailand and Vietnam. Cymbidium plants are sympodial and grow to a height of 60 cm and the racemes as high as 90 cm. The raceme grows from the base of the most recent pseudobulb. Each flower can have a diameter of 5 to 10 cm, according to the species"}, {"url": "http://www.orchidsmadeeasy.com/cymbidium-orchid-care/", "passage_text": "Cymbidium Orchid Care: The Basics. Cymbidium (sym-BID-ee-um) orchids are often used in cut flower displays as well as in corsages. Cymbidium orchids are often called “boat orchids” and the flowers are usually large in size and display a patterned lip. Fertilizer Requirements. When the Cymbidium is in active growth, you will want to fertilize regularly. An orchid fertilizer solution of (20-20-20) is recommended. During the winter months, applying fertilizer once a month is sufficient."}, {"url": "http://orchids.wikia.com/wiki/Cymbidium", "passage_text": "Cymbidium plants are sympodial and grow to a height of 60 cm and the racemes as high as 90 cm. The raceme grows from the base of the most recent pseudobulb. Each flower can have a diameter of 5 to 10 cm, according to the species. They bloom during the winter, and each plant can have up to fifteen or more flowers. "}, {"url": "http://www.gardeningknowhow.com/ornamental/flowers/orchids/growing-cymbidium-orchids.htm", "passage_text": "Cymbidium orchid growing is a good way for beginners to start, especially if they have a plot of protected soil outdoors they want to fill. If you want to take a first step into the world of orchids, look for information about Cymbidium orchid varieties. How to Care for Cymbidium Orchids. Cymbidium orchid care is just as detailed as that of other orchids, but it can be simpler if you already have the right environment at hand. These orchids love bright, cool places with a lot of moisture in the air."}, {"url": "https://en.wikipedia.org/wiki/Cymbidium", "passage_text": "Cymbidium /sɪmˈbɪdiəm/ , or boat orchid, is a genus of 52 evergreen species in the orchid family Orchidaceae. The new Latin genus name is derived from the Latin cymba meaning boat. Cymbidium plants are sympodial and grow to a height of 60 cm and the racemes as high as 90 cm. The raceme grows from the base of the most recent pseudobulb. Each flower can have a diameter of 5 to 10 cm, according to the species"}, {"url": "http://www.orchidcarezone.com/cymbidium-orchids-tips/", "passage_text": "Cymbidiums are said to be the exception to the rule when it comes to orchid care. Among the types of orchids, this is one that can grow freely outside the confinement of greenhouses and similar structures. In fact, because it thrives so well outdoors, it has been a favorite garden plant. Since cymbidiums are mostly the outdoor type of orchids, they require a lot of sunlight. During summer they can be exposed to direct sunlight and still survive. Remember though, anything that is too much can cause death to any plant, as is the case with these orchids."}, {"url": "http://www.orchidsmadeeasy.com/cymbidium-orchid-care/", "passage_text": "As covered in this article about orchids care and light, Cymbidiums need medium to bright light intensity in order to thrive, and do best with as much light as possible. If your Cymbidium orchid is receiving the optimal amount of light the leaves will be a yellow-green color. Too much light will cause the leaves to become yellow, and too little light will cause the leaves to become a very dark green color. Fertilizer Requirements. When the Cymbidium is in active growth, you will want to fertilize regularly. An orchid fertilizer solution of (20-20-20) is recommended. During the winter months, applying fertilizer once a month is sufficient."}]