[{"url": "http://www.ogj.com/articles/print/volume-97/issue-25/in-this-issue/refining/pinch-analysis-used-in-retrofit-design-of-distillation-units.html", "passage_text": "As a result of this study, IMP proposed a retrofit of the crude-distillation unit to reduce fuel consumption by more than 40%. This will save about $8 million/year and result in a payback period of less than 2 years."}, {"url": "http://www.ogj.com/articles/print/volume-97/issue-25/in-this-issue/refining/pinch-analysis-used-in-retrofit-design-of-distillation-units.html", "passage_text": "The original design of the atmospheric distillation column had two side-heat withdraws to be used in the crude oil preheat exchanger network, providing 40.5million kcal/hr. The heat withdraws are two pump-backs. The vacuum unit processes 90,000 b/d of atmospheric residue."}, {"url": "http://www.nationwideequipment.com/downloads/Oil_Refinery_For_Sale_3.28.pdf", "passage_text": "This is a fully operational distillation unit and is always pickled in diesel. EQUIPMENT INVENTORY LIST This is a list of the major items but not to be limited to the equipment sold: LOTS OF SPARE PARTS 1. Crude Atmospheric Distillation Two (2) 10,000 - 12,500 bbl per day each Crude distillation Unit."}, {"url": "http://allenglobalcompanies.com/wp-content/uploads/2013/12/afi-wp-vacuumdistil.pdf", "passage_text": "Vacuum Distillation for Industrial Oil Purification with the Best Available Technology 15Allen Filters Incorporated tOtal puriFiCatiOn prOCedure 1. The transformer is taken out of service.2. The Vacuum Distillation System (VDS) is used to pump the oil from the transformer to a temporary stor-age tank.3."}, {"url": "http://www.ou.edu/class/che-design/che5480-07/Petroleum%20Fractionation-Overview.pdf", "passage_text": "1 Overview of Crude Units Crude units are the first units that process petroleum in any refinery. There objective is to separate the mixture into several fractions like naphtha, kerosene, diesel and gas oil. A schematic diagram of an atmospheric crude fractionation unit is shown in Figure 1-1."}, {"url": "http://www.eia.gov/todayinenergy/detail.cfm?id=6970", "passage_text": "A crude oil refinery is a group of industrial facilities that turns crude oil and other inputs into finished petroleum products. A refinery's capacity refers to the maximum amount of crude oil designed to flow into the distillation unit of a refinery, also known as the crude unit."}, {"url": "http://processengineers.blogspot.com/2008/04/oil-refining-crude-distillation-unit.html", "passage_text": "Oil Refining: Crude Distillation Unit (CDU). Distillation is the first step in the processing of crude oil and it takes place in a tall steel tower called a fractionation column. The inside of the column is divided at intervals by horizontal trays."}, {"url": "http://www.separationprocesses.com/Distillation/DT_Chp04a.htm", "passage_text": "Overhead condenser. This is a heat exchange equipment for condensing the hot vapour leaving the top of the distillation column. Either cooling water (e.g. using shell-and-tube heat exchanger) or air (using fin-fan condensers) can be used as the cooling medium. In either case, partial or total condensation may be achieved."}]