[{"url": "http://www.healthyplace.com/lexapro/patient-center/use/", "passage_text": "Taking LEXAPRO. LEXAPRO tablets or oral solution should be taken once daily morning or evening, with or without food, and followed by a full glass of water. Take LEXAPRO exactly as directed by your doctor. If you do not understand these instructions, ask your pharmacist, nurse, or doctor to explain them to you."}, {"url": "http://www.rxwiki.com/lexapro", "passage_text": "1 Your doctor may need to change the dose of Lexapro until it is the right dose for you. 2  Lexapro may be taken with or without food. 3  If you miss a dose of Lexapro, take the missed dose as soon as you remember. 4  If it is almost time for the next dose, skip the missed dose and take your next dose at the regular time."}, {"url": "http://depression.emedtv.com/lexapro/lexapro-dosage.html", "passage_text": "You can take Lexapro with or without food. If the medication bothers your stomach, try taking it with food. Your Lexapro dose should be taken at the same time each day to maintain an even level in your blood. Abruptly stopping Lexapro can result in withdrawal symptoms (see Lexapro Withdrawal for more information) ."}, {"url": "http://depression.emedtv.com/lexapro/best-time-to-take-lexapro.html", "passage_text": "You can take Lexapro with or without food. If the medication bothers your stomach, try taking it with food. For Lexapro to work properly, you have to take it as prescribed. Abruptly stopping Lexapro can result in withdrawal symptoms. The medication will not work if you take it in a way other than how your healthcare provider prescribes."}, {"url": "http://www.healthyplace.com/lexapro/patient-center/use/", "passage_text": "LEXAPRO tablets or oral solution should be taken once daily morning or evening, with or without food, and followed by a full glass of water. Take LEXAPRO exactly as directed by your doctor. If you do not understand these instructions, ask your pharmacist, nurse, or doctor to explain them to you."}, {"url": "http://www.rxwiki.com/lexapro", "passage_text": "1 Lexapro may be taken with or without food. 2  If you miss a dose of Lexapro, take the missed dose as soon as you remember. 3  If it is almost time for the next dose, skip the missed dose and take your next dose at the regular time. 4  Do not take two doses of Lexapro at the same time."}, {"url": "https://www.nlm.nih.gov/medlineplus/druginfo/meds/a603005.html", "passage_text": "Your doctor may start you on a low dose of escitalopram and increase your dose after 1 week. It may take 1 to 4 weeks or longer before you feel the full benefit of escitalopram. Continue to take escitalopram even if you feel well. Do not stop taking escitalopram without talking to your doctor."}]