[{"url": "http://study.com/articles/Associate_of_Applied_Science_AAS_Nursing_Degree_Overview.html", "passage_text": "An Associate of Applied (AAS) Science Nursing degree program is designed for aspiring registered nurses (RNs). Course topics cover a wide variety of medical tasks, training students to work in critical, ambulatory, hospice, long-term and holistic care settings. View 10 Popular Schools ». Associate of Applied Science in Nursing. Coursework in an AAS nursing program instructs students in a variety of nursing specialization areas and provides training in related healthcare subjects, like pharmacology. Programs feature clinical laboratory experiences as well as classroom learning."}, {"url": "http://www.allnursingschools.com/nursing-careers/adn/", "passage_text": "About an associate's degree in nursing. An associate's degree in nursing (ADN) will give you a solid career foundation in the health care field. Popular among registered nurses (RNs), the ADN provides opportunities to work in entry-level nursing positions. An ADN can be earned over the course of two-to-three years and the curriculum will include not only nursing, but also liberal arts. After you earn your ADN, you'll need to pass a national licensing examination, NCLEX-RN, in order to begin working as a registered nurse."}, {"url": "http://www.collegeatlas.org/associate-degree-in-nursing.html", "passage_text": "ADN vs. BSN Degree. Trying to decide whether to pursue an Associate Degree in Nursing (ADN) or Bachelor of Science in Nursing (BSN) can be a difficult decision. Both degrees will qualify you to sit for the NCLEX-RN exam and to apply for licensure as a registered nurse. However, there are significant differences between the two."}, {"url": "http://www.mchenry.edu/adn/faq.asp", "passage_text": "The Nursing AAS (also known as Associate Degree in Nursing, or ADN) program provides you with a basic knowledge of nursing theory and practice. It prepares you to take the National Council of Licensure Examination (NCLEX-RN). "}, {"url": "https://en.wikipedia.org/wiki/Associate_of_Science_in_Nursing", "passage_text": "An Associate of Science in Nursing (ASN) is a tertiary education nursing degree which typically take 2–3 years to complete. In the United States, this type of degree is usually awarded by community colleges or similar nursing schools. Some four year colleges also offer this degree. Students awarded an Associate of Science in Nursing are qualified to sit for the NCLEX-RN and apply for licensure as a Registered Nurse. Students enrolled in an Associate of Science in Nursing program would take courses in nursing, anatomy, physiology, microbiology, chemistry, nutrition, psychology and other social and behavioral sciences. The curriculum will also require supervised clinical experience."}, {"url": "http://www.collegeatlas.org/associate-degree-in-nursing.html", "passage_text": "Several 4-year colleges, as well as a few hospitals, also offering nursing programs where students can earn an associate degree. After earning an associate degree in nursing, students are qualified to sit for the NCLEX-RN and apply for licensure as a Registered Nurse. Trying to decide whether to pursue an Associate Degree in Nursing (ADN) or Bachelor of Science in Nursing (BSN) can be a difficult decision. Both degrees will qualify you to sit for the NCLEX-RN exam and to apply for licensure as a registered nurse. However, there are significant differences between the two."}, {"url": "http://allnurses.com/pre-nursing-student/what-is-the-217585.html", "passage_text": "Both are associate's degrees in nursing. ADN=Associate's Degree in Nursing, AAS=Associate's of Applied Science. I am not sure where you are, but there are accelerated baccalaureate degree programs for people who want to change careers to nursing (see list here). "}, {"url": "http://www.mchenry.edu/adn/index.asp", "passage_text": "About. The Nursing AAS program is designed to prepare you to function as a professional nurse in a variety of health care settings including hospitals, nursing homes, clinics, and private homes and offices. Become an RN at a fraction of the cost of a four year university. "}, {"url": "http://nursinglink.monster.com/education/articles/534-adn-vs-bsn-which-should-you-choose", "passage_text": "NursingLink. First of all, let’s establish what each one stands for. A BSN is a Bachelor of Science in Nursing, while an ADN is an Associates Degree in Nursing. Both degrees lead to getting your RN but there are some differences between the two. The main difference is the length of time and the amount of credits required to complete the program"}]