[{"url": "https://en.wikipedia.org/wiki/Jolene_(song)", "passage_text": "The song was ranked No. 217 on Rolling Stone magazine's list of  the 500 Greatest Songs of All Time  in 2004. According to Parton, Jolene is the song most-recorded by other artists of all the songs she has written. Throughout the song, the woman implores Jolene please don't take him just because you can. According to Parton, the song was inspired by a red-headed bank clerk who flirted with her husband Carl Dean at his local bank branch around the time they were newly married. In an interview, she also revealed that Jolene's name and appearance are based on that of a young fan who came on stage for her autograph"}, {"url": "http://www.npr.org/2008/10/09/95520570/dolly-partons-jolene-still-haunts-singers", "passage_text": "Parton says that Jolene has been recorded more than any other song she's written — in styles that range from Olivia Newton John's 1976 disco version to the rollicking White Stripes version to the Goth rendition of the post-punk band The Sisters of Mercy. Jolene. Jolene.' I said, 'That is pretty. That sounds like a song. I'm going to write a song about that.'. Parton says that she got the story for her song from another redhead in her life at the time — a bank teller who was giving Parton's new husband a little more interest than he had coming."}, {"url": "http://theboot.com/top-dolly-parton-songs/", "passage_text": "'But You Know I Love You' had been around the block twice before Parton recorded the song. Written by Mike Settle from Kenny Rogers ' early group the First Edition, the song first became a pop hit for them in 1969. Bill Anderson took the song to No. 2 in the country charts that same year. "}, {"url": "http://countrymusic.about.com/od/dollyparton/a/I-Will-Always-Love-You.htm", "passage_text": "Song Facts. I Will Always Love You was recorded by Dolly Parton on June 13, 1973. It was released as a single on June 6, 1974. Parton reportedly wrote the tune the same day she wrote Jolene.. The song reached #1 on the country music char"}, {"url": "http://www.npr.org/2008/10/09/95520570/dolly-partons-jolene-still-haunts-singers", "passage_text": "Jolene.. Jolene launched country singer Mindy Smith's career five years ago, when Parton said that it was her favorite version of the song. Smith says she could relate to the vulnerability of the woman pleading with Jolene. I think the main character is really the person singing about Jolene, Smith says. Jolene's a mess. Jolene. Jolene.' I said, 'That is pretty. That sounds like a song. I'm going to write a song about that.'. Parton says that she got the story for her song from another redhead in her life at the time — a bank teller who was giving Parton's new husband a little more interest than he had coming."}, {"url": "http://www.answers.com/Q/Who_wrote_the_song_Jolene", "passage_text": "I Write the Songs was written by Bruce Johnston of the Beach Boys in 1975, and recorded on albums by The Captain and Tennille, David Cassidy, and Barry Manilow. Cassidy had … the first single version, but it was Manilow whose version hit #1 on the Billboard Hot 100 in 1976. 7 people found this useful. "}, {"url": "http://www.songfacts.com/detail.php?id=4623", "passage_text": "The song was added to the Grammy Hall of Fame in 2014. It was Parton's second tune to receive the prestigious honor -  I Will Always Love You  was included in 2007. Bluegrass singer Rhonda Vincent recorded a cover of this song that became a fan favorite and one of those fans happened to be Dolly Parton. This was written and recorded around the time Parton was leaving one-time singing partner and manager Porter Wagoner. The song became the first of 5 consecutive #1 Country hits and created momentum as Dolly embarked on her solo career."}, {"url": "https://en.wikipedia.org/wiki/Jolene_(song)", "passage_text": "Jolene  is a song written and performed by American country music artist Dolly Parton. It was released in October 1973 as the first single and title track from her album of the same name, produced by Bob Ferguson. Throughout the song, the woman implores Jolene please don't take him just because you can. According to Parton, the song was inspired by a red-headed bank clerk who flirted with her husband Carl Dean at his local bank branch around the time they were newly married. In an interview, she also revealed that Jolene's name and appearance are based on that of a young fan who came on stage for her autograph"}, {"url": "https://en.wikipedia.org/wiki/Jolene_(album)", "passage_text": "Jolene is Dolly Parton 's 13th solo studio album, produced by Bob Ferguson. It was released by RCA Records in February 1974. The title track,  Jolene , tells the tale of a housewife confronting a beautiful seductress who she believes is having an affair with her husband. It became Parton's second solo number-one country single; it also was a moderate pop hit for her, and also did well in the United Kingdom. "}]