[{"url": "http://www.webmd.com/cholesterol-management/guide/understanding-numbers", "passage_text": "Your total cholesterol level is in the Desirable range, but your level of bad LDL cholesterol is High. This may mean that your level of high-density lipoprotein (HDL), or good cholesterol, is too low. It is best to have a high level of good HDL and a low level of bad LDL. This may mean that your level of high-density lipoprotein (HDL), or good cholesterol, is too low. It is best to have a high level of good HDL and a low level of bad LDL because the HDL helps keep your LDL level in check."}, {"url": "http://www.cdc.gov/cholesterol/ldl_hdl.htm", "passage_text": "1 HDL cholesterol absorbs cholesterol and carries it back to the liver, which flushes it from the body. 2  HDL is known as “good” cholesterol because having high levels can reduce the risk for heart disease and stroke. 3  Triglycrides are a type of fat found in your blood that your body uses for energy. Molecules called lipoproteins carry cholesterol in the blood. Two important kinds of lipoproteins are low-density lipoprotein (LDL) and high-density lipoprotein (HDL). When checking LDL and HDL, doctors often include another type of fat called triglycerides."}, {"url": "http://www.webmd.com/cholesterol-management/hdl-cholesterol-the-good-cholesterol", "passage_text": "HDL is short for high-density lipoprotein. Each bit of HDL cholesterol is a microscopic blob that consists of a rim of lipoprotein surrounding a cholesterol center. The HDL cholesterol particle is dense compared to other types of cholesterol particles, so it's called high-density. Cholesterol isn't all bad. This may mean that your level of high-density lipoprotein (HDL), or good cholesterol, is too low. It is best to have a high level of good HDL and a low level of bad LDL. The HDL helps keep your LDL level in check. Ask your doctor for your HDL level."}, {"url": "http://www.webmd.com/cholesterol-management/hdl-cholesterol-the-good-cholesterol", "passage_text": "Your total cholesterol level is in the Desirable range, but your level of bad LDL cholesterol is High. This may mean that your level of high-density lipoprotein (HDL), or good cholesterol, is too low. It is best to have a high level of good HDL and a low level of bad LDL. The HDL helps keep your LDL level in check. Ask your doctor for your HDL level."}, {"url": "http://www.webmd.boots.com/cholesterol-management/guide/hdl-good-cholesterol", "passage_text": "HDL cholesterol: The good cholesterol. While doctors will tell you high cholesterol is bad, it is important to remember that one type of cholesterol is good. High-density lipoprotein, or HDL, is useful because it carries cholesterol away from the cells and back to the liver to be processed."}, {"url": "http://www.cdc.gov/cholesterol/ldl_hdl.htm", "passage_text": "1 LDL cholesterol makes up the majority of the body’s cholesterol. 2  LDL is known as “bad” cholesterol because having high levels can lead to plaque buildup in your arteries and result in heart disease and stroke. 3  HDL cholesterol absorbs cholesterol and carries it back to the liver, which flushes it from the body. Molecules called lipoproteins carry cholesterol in the blood. Two important kinds of lipoproteins are low-density lipoprotein (LDL) and high-density lipoprotein (HDL). When checking LDL and HDL, doctors often include another type of fat called triglycerides."}, {"url": "http://www.webmd.com/cholesterol-management/hdl-cholesterol-the-good-cholesterol", "passage_text": "Your total cholesterol is High, but your level of bad LDL cholesterol is near optimal. This could mean you have a high level of high-density lipoprotein, or good HDL cholesterol, which protects against heart disease. This may mean that your level of high-density lipoprotein (HDL), or good cholesterol, is too low. It is best to have a high level of good HDL and a low level of bad LDL. The HDL helps keep your LDL level in check. Ask your doctor for your HDL level."}, {"url": "http://www.heart.org/HEARTORG/Conditions/Cholesterol/AboutCholesterol/Good-vs-Bad-Cholesterol_UCM_305561_Article.jsp", "passage_text": "LDL (Bad) Cholesterol. LDL cholesterol is considered the “bad” cholesterol because it contributes to plaque, a thick, hard deposit that can clog arteries and make them less flexible. This condition is known as atherosclerosis. If a clot forms and blocks a narrowed artery, heart attack or stroke can result. One-fourth to one-third of blood cholesterol is carried by HDL. A healthy level of HDL cholesterol may also protect against heart attack and stroke, while low levels of HDL cholesterol have been shown to increase the risk of heart disease."}, {"url": "http://www.heart.org/HEARTORG/Conditions/Cholesterol/AboutCholesterol/Good-vs-Bad-Cholesterol_UCM_305561_Article.jsp", "passage_text": "HDL (Good) Cholesterol. HDL cholesterol is considered “good” cholesterol because it helps remove LDL cholesterol from the arteries. Experts believe HDL acts as a scavenger, carrying LDL cholesterol away from the arteries and back to the liver, where it is broken down and passed from the body. One-fourth to one-third of blood cholesterol is carried by HDL. A healthy level of HDL cholesterol may also protect against heart attack and stroke, while low levels of HDL cholesterol have been shown to increase the risk of heart disease."}, {"url": "http://www.mayoclinic.org/diseases-conditions/high-blood-cholesterol/in-depth/hdl-cholesterol/ART-20046388", "passage_text": "1 High-density lipoproteins. 2  These lipoproteins are often referred to as HDL, or good, cholesterol. 3  They act as cholesterol scavengers, picking up excess cholesterol in your blood and taking it back to your liver where it's broken down. 4  The higher your HDL level, the less bad cholesterol you'll have in your blood. Increasing HDL cholesterol also can reduce your risk of heart disease. Although higher levels of HDL can be helpful in reducing your risk of having a heart attack, researchers caution that you should also consider other risk factors for developing"}]