[{"url": "http://www.hipandknee.com/hip-surgery/about-hip-replacement/parts-materials/", "passage_text": "On the socket (pelvic) side of a hip replacement or resurfacing, a metal half-shell is fitted inside the patient’s own bony socket. Inside this shell, a locking mechanism fastens the bearing, which can be polyethylene, metal, or ceramic."}, {"url": "http://www.arthritisresearchuk.org/arthritis-information/surgery/mom-hip-q-and-a.aspx", "passage_text": "All hip resurfacing operations use a metal-on-metal bearing hip. Most total hip replacements are not metal-on-metal bearings and use other materials including ceramic and high density polyethylene. Your hospital will always have a record of your operation and what implants were used."}, {"url": "https://www.hipreplacement.com/technology/implants/basics", "passage_text": "In a total hip replacement surgery, doctors replace the diseased or damaged hip with an implant consisting of a stem, ball, liner, and socket. 1  The stem, made of metal, is inserted into the femur (thigh bone) and anchors the implant in place. 2  The ball is attached to the top of the stem."}, {"url": "https://www.hss.edu/conditions_understanding-implants-in-knee-and-hip-replacement.asp", "passage_text": "Implants may be made of a variety of materials including metal (usually titanium), ceramic or polyethylene (a type of hard plastic). Ongoing research and enabling technology will determine new directions in materials used in hip replacement surgery."}, {"url": "http://www.nhs.uk/Conditions/Hip-replacement/Pages/Metal-on-metalimplants.aspx", "passage_text": "1 metal-on-metal hip resurfacing implants – where the socket and ball of the hip bone has a metal surface applied to it rather than being totally replaced. 2  Total metal-on-metal implants where the replacement ball is less than 36mm wide."}, {"url": "http://www.nhs.uk/Conditions/Hip-replacement/Pages/Metal-on-metalimplants.aspx", "passage_text": "1 Total metal-on-metal implants where the replacement ball is less than 36mm wide. 2  A particular range of hip replacements called DePuy ASR – these hip replacements were recalled by their manufacturer, DePuy, in 2010 because of high failure rates. 3  The company made three types of ASR implant."}, {"url": "https://www.hipreplacement.com/technology/implants/basics", "passage_text": "With hip replacement, an acetabular cup usually includes a metal shell and a plastic, metal, or ceramic liner to replace the acetabulum. The femoral stem is inserted inside the femur, and the femoral head (or ball) fits inside the acetabulum. Once the three components are aligned, more natural movement may be restored."}, {"url": "http://orthoinfo.aaos.org/topic.cfm?topic=A00625", "passage_text": "In metal-on-metal devices both the ball and socket components are made of metal. These metal implants have been used in total hip replacement surgeries and hip resurfacing procedures. Because of metal's durability, metal-on-metal devices were expected to last longer than other hip implants."}, {"url": "http://www.arthritisresearchuk.org/arthritis-information/surgery/mom-hip-q-and-a.aspx", "passage_text": "Metal-on-metal hip replacement Q & A. Answers provided by John Skinner, consultant orthopaedic surgeon at Royal National Orthopaedic Hospital, Stanmore, UK, and Alister Hart, professor of orthopaedic surgery at UCL and Royal National Orthopaedic Hospital, London, UK."}]