[{"url": "https://en.wikipedia.org/wiki/Naan", "passage_text": "The Naan burger is a hamburger served on naan bread. The naan burger has very similar ingredients to normal burgers, but is sometimes made with ham. The use of flatbread creates a taste experience different from hamburgers made with bread."}, {"url": "http://www.food.com/recipe/naan-bread-395145", "passage_text": "1 At grill side, roll one ball of dough out into a thin circle. 2  Lightly oil grill. 3  Place dough on grill, and cook for 2 to 3 minutes, or until puffy and lightly browned. 4  Brush uncooked side with butter, and turn over. 1 Stir in sugar, milk, egg, salt, and enough flour to make a soft dough. 2  Knead for 6 to 8 minutes on a lightly floured surface, or until smooth. 3  Place dough in a well oiled bowl, cover with a damp cloth, and set aside to rise. 4  Let it rise 1 hour, until the dough has doubled in volume."}, {"url": "http://www.bbc.co.uk/food/recipes/naan_86626", "passage_text": "Make a well in the centre of the flour mixture and pour in the liquid mixture. Slowly mix together the dough by working from the centre and incorporating the flour from the edges of the 'well', to make a smooth, soft dough. Knead well for 8-10 minutes, adding a little flour if the dough is too sticky. Technique: How to knead bread dough. Watch technique 1:58 mins. Place the dough into an oiled bowl, cover with a damp tea-towel and leave in a warm place for 10-15 minutes. Form the dough into five balls."}, {"url": "http://www.breadexperience.com/types-of-flour/", "passage_text": "Types of Flour used to make bread. Flour is the primary ingredient in bread. The kind of flour used will determine the nature of the loaf. The better the flour, the better your bread will taste. Listed below are the main types of flour that can be used to make bread. Tips for using wheat grains. 1  Wheat germ increases the nutritional value of bread, but it also inhibits the gluten action. 2  Do not use more than 2 tablespoons for every 2 cups of flour. 3  To soften cracked wheat, simmer in hot water for 15 minutes, then drain and cool."}, {"url": "http://flour.co.uk/blog/naan-bread", "passage_text": "Naan is a Punjabi leavened bread made with fine white flour and yogurt which ferments the dough and adds flavour. The dough is rapidly made, there’s no kneading, and is quickly shaped by hand. "}, {"url": "https://en.wikipedia.org/wiki/Naan", "passage_text": "For the Indian film, see Naan (film) . Naan, nan or khamiri is a leavened, oven-baked flatbread found in the cuisines of West, Central and South Asia. With the migration of the Roma people from India, it spread to other parts of West Asia. The naan burger has very similar ingredients to normal burgers, but is sometimes made with ham. The use of flatbread creates a taste experience different from hamburgers made with bread."}, {"url": "http://www.homebreadmaking.com/types-of-flour-used-to-make-bread/", "passage_text": "All-Purpose Flour. Sometimes called plain flour, this is a blend of refined hard and soft wheat flour, which is more suited for use in cake and cake bread recipes. All-purpose bleached white flour is not particularly good for use in home bread baking. "}, {"url": "http://www.kingarthurflour.com/recipes/buttery-seeded-naan-recipe", "passage_text": "Buttery Seeded Naan. 1) Place all of the ingredients into a bowl, and mix and knead to make a smooth, fairly stiff dough. This will take about 7 minutes in a stand mixer. 2) Place the dough in a lightly greased bowl or large (8-cup) measuring cup, and allow it to rise for 1 to 2 hours, till it's doubled in bulk. Dough made with less salt will rise more quickly. Toward the end of the rising time, preheat your oven to 475 F — with a pizza stone on the bottom rack, if you intend to use one. 6) If you're baking on a baking sheet, brush the breads with beaten egg white, if desired, and top with seeds. Place on a lower rack of the oven, and bake for 7 to 8 minutes, or until the breads are puffed and golden brown. 7) Remove the breads from the oven, and brush with ghee or melted butter, if desired."}, {"url": "https://en.wikipedia.org/wiki/Naan", "passage_text": "Milk or yogurt may also be used to impart distinct tastes to the naan. Milk used instead of water will, as it does for ordinary bread, yield a softer dough. Also, when bread starter (which contains both yeast and lactobacilli) is used, the milk may undergo modest lactic fermentation. The naan burger has very similar ingredients to normal burgers, but is sometimes made with ham. The use of flatbread creates a taste experience different from hamburgers made with bread."}, {"url": "https://en.wikipedia.org/wiki/Naan", "passage_text": "Raisins and spices can be added to the bread to add to the flavour. Naan can also be covered with, or serve as a wrap for various toppings of meat, vegetables or cheeses. This version is sometimes prepared as fast food. It can also be dipped into such soups as dal, and goes well with sabzis (also known as shaakh). The naan burger has very similar ingredients to normal burgers, but is sometimes made with ham. The use of flatbread creates a taste experience different from hamburgers made with bread."}]