[{"url": "http://www.usf.edu/business/graduate/mba/tuition-financial-aid.aspx", "passage_text": "Tuition rates are based on the 2013-2014 academic year and do not include fees (new student fee, technology fee, etc), which are subject to change. Refer to the University Controller's Office website for additional information on tuition and fees. "}, {"url": "http://ufonline.ufl.edu/tuition/", "passage_text": "$17.26. Consult the Cost of Attendance table on the Student Financial Affairs website for the estimated total cost for a full-time student. * Fees consist of a $5.25 Financial Aid fee, a $5.25 Technology fee and a $6.76 Capital Improvement fee per credit hour. Non-Florida residents also pay an additional $35.36 Non-FL Resident Financial Aid fee per credit hour. † The non-Florida resident tuition is market based and program specific"}, {"url": "http://uwf.edu/online/we-are-affordable/tuition-fees/", "passage_text": "All tuition and fees are assessed on a per credit hour basis by the location of the course, the level of the course, and the student's residency classification for fee purposes. Nursing, M.S.N. : The courses that comprise the Nursing M.S.N. program charge $425 per credit hour or $1275 per 3 credit hour course for All Students."}, {"url": "http://uwf.edu/online/we-are-affordable/tuition-fees/", "passage_text": "1 Florida in-state tuition per credit hour: $218.98. ( 2 Ex. 3 credit hour course cost is: $656.94). 3  100% Out-of-state tuition waiver per credit hour: $239.43. ( 4 Ex. 3 credit hour course cost is: $718.29). Nursing, M.S.N. : The courses that comprise the Nursing M.S.N. program charge $425 per credit hour or $1275 per 3 credit hour course for All Students."}, {"url": "http://www.fa.ufl.edu/bursar/current-students/tuition-and-fees-2014-15/fall-2014-students-for-the-2014-15-academic-year/", "passage_text": "The following is a breakdown of the per credit hour amount of a student’s tuition for a Florida and Non-Florida resident during the academic year: Undergraduate Courses (0000-4999) Graduate Courses (5000-9999) DCP Courses (5000-9999) JD and Law LL.M. Courses Tax LL.M. "}, {"url": "http://www.collegecalc.org/colleges/florida/university-of-florida/", "passage_text": "Undergraduate Tuition. University of Florida tuition is $4,477 per year for in-state residents. This is 30% cheaper than the national average public four year tuition of $6,429. The cost is $9,484 and 68% cheaper than the average Florida tuition of $13,961 for 4 year colleges. Tuition ranks 26th in Florida amongst 4 year colleges for affordability and is the 108th most expensive 4 year college in the state. 95% of University of Florida students received grant aid in 2013/2014. The average total aid amount was $5,610. 29 percent of students received aid in the form of Pell Grants from the U.S. Federal Government. The average Pell Grant awarded for 2013/2014 was $4,453."}, {"url": "http://www.fgcu.edu/Cashiers/tuition-and-fees.html", "passage_text": "Tuition & Fees. Students are assessed tuition and fees based on rates and policies established by the State Board of Education, the Florida Legislature, and the University Board of Trustees. "}, {"url": "http://www.collegecalc.org/colleges/florida/university-of-florida/", "passage_text": "Annual Total Cost. The total list price for in-state Florida residents to go to University of Florida is $17,233 for the 2014/2015 academic year. Out-of-state students who don't possess Florida residence can expect a one year cost of $38,450. 95% of University of Florida students received grant aid in 2013/2014. The average total aid amount was $5,610. 29 percent of students received aid in the form of Pell Grants from the U.S. Federal Government. The average Pell Grant awarded for 2013/2014 was $4,453."}]