[{"url": "http://www.answers.com/Q/How_do_you_reset_the_maintenance_required_light_on_a_2008_Toyota_Prius", "passage_text": "For what it is worth: To reset the Maintenance Required light on my 2007 Toyota Corolla: 1) Set your … trip meter to the odometer setting (in other words, not Trip A or Trip B) 2) Hold down trip meter reset button and turn ignition to off. 3) While holding down the trip meter reset button now turn the ignition to on."}, {"url": "http://www.ehow.com/how_5883502_turn-required-light-toyota-prius.html", "passage_text": "The maintenance required light, or Maint Reqd as it's displayed on the instrument panel, on the Toyota Prius is not to be confused with a check engine light. The maintenance light is designed to come on at service intervals to inform the owner or driver that it's time for an oil change service on the hybrid vehicle."}, {"url": "http://www.answers.com/Q/How_do_you_reset_the_maintenance_required_light_on_a_2008_Toyota_Prius", "passage_text": "If you change the oil (and filter) yourself, here's how to reset the light so it will stay off until the next change is interval has expired: 1) With the power on, switch to the odometer/trip-meter to display ODO. 2) Power OFF (push the Power button). 3) Power ON, while holding the button for ODO."}, {"url": "http://www.answers.com/Q/Maintenance_light_Toyota_Prius_reset", "passage_text": "Free video instructions on how to reset maint reqd on Toyota prius go to www.vehix411.com If you change the oil (and filter) yourself, here's how to reset the light so it wi … ll stay off until the next change is interval has expired: 1) With the power on, switch to the odometer/trip-meter to display ODO."}, {"url": "http://www.ehow.com/how_5883502_turn-required-light-toyota-prius.html", "passage_text": "Locate the odometer-trip button located near the center of the dashboard. Depress and hold the odometer-trip button with your right hand and then power on the Prius with the ignition button with your left hand. Continue to hold the odometer-trip button until the Maint Reqd light goes out on the instrument panel."}, {"url": "http://www.answers.com/Q/Maintenance_light_Toyota_Prius_reset", "passage_text": "To manually reset the maintenance required light on a 2012 Toyota  RAV4, first turn the key to the On position. Next, press the trip  button meter until it gets to the Trip … A odometer. Now, switch the  key to the Off position. The next step is to hold down the trip  meter and turn the key back"}, {"url": "http://seventrumpet.com/2010-2015-toyota-prius-oil-maintenance-required-light-reset/", "passage_text": "1 Next, turn the ignition “off”. 2  Press and hold the OdO Reset button, and press the “Start” twice without touching the brake pedal. 3  Continue to hold down the Trip Odometer Reset button until “000000” MILES appears on the display and the maintenance light turns off."}, {"url": "http://maint-reqd.upcsite.net/?v=Toyota%20Prius", "passage_text": "Instructions: 1  Turn your ignition key to the 'ACC' or 'LOCK' position. 2  Press and hold the trip meter reset nob (next to your Toyota Prius's odometer). 3  While holding the trip meter reset nob, turn the ignition to 'ON', but do not start your Toyota Prius. 4  Hold the meter reset until the MAINT REQD light switches off."}, {"url": "http://maint-reqd.upcsite.net/?v=Toyota%20Prius", "passage_text": "1 Turn your ignition key to the 'ACC' or 'LOCK' position. 2  Press and hold the trip meter reset nob (next to your Toyota Prius's odometer). 3  While holding the trip meter reset nob, turn the ignition to 'ON', but do not start your Toyota Prius. 4  Hold the meter reset until the MAINT REQD light switches off."}]