[{"url": "https://en.wikipedia.org/wiki/Sponge", "passage_text": "Sponges are animals of the phylum Porifera (/pɒˈrɪfərə/ ; meaning pore bearer). They are multicellular organisms that have bodies full of pores and channels allowing water to circulate through them, consisting of jelly-like mesohyl sandwiched between two thin layers of cells. Sponges are similar to other animals in that they are multicellular, heterotrophic, lack cell walls and produce sperm cells. Unlike other animals, they lack true tissues and organs, and have no body symmetry."}, {"url": "http://cfcc.edu/faculty/rogers/courses/msc174/Porifera.pdf", "passage_text": "Phylum Porifera. Introduction The Phylum Porifera includes the sponges, a group of peculiar sedentary animals so different from other types of animals that they were long thought to be plants. Sponges are among the most primitive multicellular animals. They have a simple type of body organization, with a porous body permeated by a system of water canals through which water is pumped by the action of special flagellated cells, choanocytes (collar cells). "}, {"url": "http://tolweb.org/treehouses/?treehouse_id=4291", "passage_text": "Unlike the cells of most other animals, the cells of sponges do not form into various organs like kidney, liver, or nerves. Sponge cells are totipotent (Dawkins 2004). The totipotent cells could give rise to reproductive cells or other types of cells of the organism. The Life of a Sponge. Elephant ear sponge, © 2006 Richard Ling. The word sponge, for most of us relates to the scrubbing sponge or a bath sponge. It is easy to forget that there is much more to sponges than the scrubbing and bath. The sponges are living animals that live in the water"}, {"url": "https://whyevolutionistrue.wordpress.com/2009/10/14/why-sponges-are-animals/", "passage_text": "Nevertheless, sponges are in fact the oldest living animals, one of the most amazing success stories on the planet. Argument rages over exactly how old the earliest sponge is. Some fossils that are claimed to be sponges have been dated back to around 710 MY ago, but not everyone accepts these. But that doesn’t make sponges “primitive”, or in any way lesser beings. They have been on our planet for longer than any other animal – around 10,000 times longer than our species. They have survived repeated mass extinction events, and that suggests they will probably be around for at least another 600 MY."}, {"url": "http://planet.uwc.ac.za/nisl/biodiversity/Part_1/page_12.htm", "passage_text": "Sponges are primitive, sessile, mostly marine, waterdwelling filter feeders that pump water through their matrix to filter out particulates of food matter. Sponges are among the simplest of animals, with partially differentiated tissues but without muscles, nerves, or internal organs. The structure of a sponge is simple: it is shaped like a tube, with one end stuck to a rock or other object and an open end, the osculum, open to the environment. The spongocoel, or interior of the sponge, is composed of walls perforated with microscopic pores that allow water to flow through the spongocoel."}, {"url": "http://tolweb.org/treehouses/?treehouse_id=4291", "passage_text": "People often think of sponges as plants, rather than being animals. This misconception is due to some of the characteristics of the Porifera (Dawkins 2004). Like plants they do not move, i.e., they are sessile. They stay put in one place stuck to the bottom of the water-either salt or fresh. The Life of a Sponge. Elephant ear sponge, © 2006 Richard Ling. The word sponge, for most of us relates to the scrubbing sponge or a bath sponge. It is easy to forget that there is much more to sponges than the scrubbing and bath. The sponges are living animals that live in the water"}, {"url": "https://whyevolutionistrue.wordpress.com/2009/10/14/why-sponges-are-animals/", "passage_text": "Why sponges are animals. by Matthew Cobb. Aristotle thought they were plants; for centuries, we have used them to scrub ourselves clean, while millions of kids round the planet think they wear square pants and play with stupid starfish. But that doesn’t make sponges “primitive”, or in any way lesser beings. They have been on our planet for longer than any other animal – around 10,000 times longer than our species. They have survived repeated mass extinction events, and that suggests they will probably be around for at least another 600 MY."}, {"url": "http://www.tulane.edu/~bfleury/diversity/labguide/spngnem.html", "passage_text": "Introduction to Primitive Invertebrates. Today well examine several phyla that represent alternate pathways in early animal evolution. The sponges, in the Phylum Porifera, are so strange that they are placed in the Subkingdom Parazoa, which literally means “animals set aside”. All other animals belong to the Subkingdom Eumetazoa (“true” animals)."}]