[{"url": "http://www.huffingtonpost.com/2015/05/12/adderall-brain-effects_n_7264912.html", "passage_text": "By stimulating the release of dopamine, amphetamines like Adderall keeps the brain from getting distracted by potential rewards in the environment -- from email alerts to nearby conversations to incoming text messages. People with ADHD tend to have lower levels of dopamine, the key chemical in the brain's reward center, neuroscientist Dr. Ryan Davison says in the video. This lack of dopamine means that people are constantly seeking stimulation.."}, {"url": "https://www.drugabuse.gov/publications/research-reports/prescription-drugs/stimulants/how-do-stimulants-affect-brain-body", "passage_text": "Stimulants, such as dextroamphetamine (Dexedrine and Adderall) and methylphenidate (Ritalin and Concerta), act in the brain similarly to a family of key brain neurotransmitters called monoamines, which include norepinephrine and dopamine. The associated increase in dopamine can induce a feeling of euphoria when stimulants are taken nonmedically. Stimulants also increase blood pressure and heart rate, constrict blood vessels, increase blood glucose, and open up breathing passages."}, {"url": "http://www.brainpower.org/reviews/adderall.html", "passage_text": "Adderall works by raising the proportions of dopamine and norepinephrine in the brain. It also acts as a stimulant, increasing blood pressure and heart rate in patients who take it. This gives most patients a feeling of alertness while taking the drug and improves their ability to concentrate on important tasks. Adderall Side Effects. Adderall has several side effects which may be dangerous or even fatal if taken incorrectly, which is why it must be prescribed by a doctor and patients who take it supervised carefully. These symptoms include elevated blood pressure and heart rate."}, {"url": "https://en.wikipedia.org/wiki/Adderall", "passage_text": "Adderall increases the activity of the neurotransmitters norepinephrine and dopamine in the brain, which results from its interactions with trace amine associated receptor 1 (TAAR1) and vesicular monoamine transporter 2 (VMAT2). Adderall is generally well-tolerated and effective in treating the symptoms of ADHD. The most common side effects are cardiovascular, such as irregular heartbeat (usually manifesting as tachycardia, i.e. a fast heartbeat), and psychological, such as euphoria or anxiety."}, {"url": "https://www.quora.com/What-are-the-long-term-effects-of-Adderall-Dexedrine-or-Ritalin-use", "passage_text": "Alex has in. Short summary: Adderall/Dexedrine can be neurotoxic in the long run (by damaging dopamine neurons) while Ritalin does not have as much neurotoxicity potential. Surprisingly, when Ritalin *and* Adderall are mixed together, Ritalin can actually help counteract Adderall's neurotoxicity potential"}, {"url": "http://www.shape.com/lifestyle/mind-and-body/your-brain-adderall", "passage_text": "Depending on whether you’ve taken regular Adderall or the extended release version, its effects have largely worn off, meaning levels of feel-good brain chemicals have plummeted. Their absence can leave you feeling drained, or even depressed, Diller says. While many people with attention deficit disorders have benefited from the drug, it can have some scary consequences for those who abuse it, Diller says. Here's a look in your brain as you swallow a drug like Adderall. 00:20:00. After roughly 20 to 30 minutes, you’ll experience a mild euphoric lift, Diller explain"}, {"url": "http://www.shape.com/lifestyle/mind-and-body/your-brain-adderall", "passage_text": "Similar to other amphetamines like MDMA (Ecstasy), Adderall mimics feel-good brain chemicals like dopamine by binding to receptors that would normally respond to those hormones. Research shows the drug also blocks chemicals that temper reward-based responses, meaning the high continues till the effects wear off. While many people with attention deficit disorders have benefited from the drug, it can have some scary consequences for those who abuse it, Diller says. Here's a look in your brain as you swallow a drug like Adderall. 00:20:00. After roughly 20 to 30 minutes, you’ll experience a mild euphoric lift, Diller explains"}, {"url": "http://www.cnn.com/2009/HEALTH/expert.q.a/06/16/adderall.brain.changes.raison/index.html", "passage_text": "Can Adderall cause a permanent damage/change in the brain (to prefrontal cortex) to have a negative effect on one's susceptibility to depression, working memory, and so on? "}, {"url": "http://www.healthline.com/health/adhd/adderall-effects-on-body", "passage_text": "Effects of Adderall on the Body. Adderall is a brand name for a combination of dextroamphetamine and amphetamine. It is a prescription drug used primarily to treat attention deficit hyperactivity disorder (ADHD) or narcolepsy. This combination oral medication comes in tablet form or as a time-release capsule. If you take large amounts of Adderall and stop suddenly, you might have side effects like fatigue, moodiness, or depression. Read more. Numb fingers may be caused by problems with your circulat"}]