[{"url": "http://www.hopkinsmedicine.org/healthlibrary/conditions/cardiovascular_diseases/varicose_veins_85,P08259/", "passage_text": "This condition does not usually occur with varicose veins. That is because varicose veins affect the veins close to the surface of the skin. However, with severe varicose veins, there is a small chance of developing blood clots in the deep veins. Blood clots require medical care right away. Varicose veins are caused by increased blood pressure in the veins. Varicose veins occur in the veins near the surface of the skin (superficial). The blood moves towards the heart by 1-way valves in the veins. When the valves become weakened or damaged, blood can collect in the veins"}, {"url": "http://www.answers.com/Q/Why_does_Atherosclerosis_occur_in_arteries_and_not_in_veins", "passage_text": "Arteries carry blood away from the heart and the veins bring blood to the heart. Arteries carry blood with more press … ure than veins, so they are thicker and more muscular. Veins have something arteries do not have and that is valves. 6 people found this useful. The arteries carry de oxygenated blood out of the heart into the lungs and the veins bring oxygenated blood into the heart, ready for circulation of the body. The difference i … s that arteries carry blood away from the heart and veins carry blood towards the heart. 13"}, {"url": "https://en.wikipedia.org/wiki/Atheroma", "passage_text": "An atheroma is an accumulation of degenerative material in the tunica intima (inner layer) of artery walls. The material consists of (mostly) macrophage cells, or debris, containing lipids (cholesterol and fatty acids), calcium and a variable amount of fibrous connective tissue. Veins do not develop atheromata, unless surgically moved to function as an artery, as in bypass surgery. The accumulation (swelling) is always in the tunica intima, between the endothelium lining and the smooth muscle tunica media (middle layer) of the artery wall."}, {"url": "https://en.wikipedia.org/wiki/Atheroma", "passage_text": "Atheroma occurs in atherosclerosis, which is one of the three subtypes of arteriosclerosis (which are atherosclerosis, Monckeberg's arteriosclerosis and arteriolosclerosis). Veins do not develop atheromata, unless surgically moved to function as an artery, as in bypass surgery. The accumulation (swelling) is always in the tunica intima, between the endothelium lining and the smooth muscle tunica media (middle layer) of the artery wall."}, {"url": "http://www.humanillnesses.com/original/T-Ty/Thrombosis.html", "passage_text": "Thrombosis usually begins as an inflammation of the vein known as phlebitis * . Phlebitis develops when blood flows slowly or pools in veins. This usually occurs in the legs and causes injury to the walls of the vein. Just as platelets gather to form clots on cut fingers, they also may start to form clots along the injured walls of veins. The biggest danger is when a clot forms in the large veins that are deep within the legs. If the blood clot grows, it may break off. The clot may then travel toward and then through the heart and block the pul-monary * artery, which is a major blood vessel, causing a pulmonary embolism * ."}, {"url": "http://www.hopkinsmedicine.org/healthlibrary/conditions/cardiovascular_diseases/varicose_veins_85,P08259/", "passage_text": "Varicose veins are enlarged, twisted veins. Varicose veins can occur anywhere in the body, but are more common in the legs. Varicose veins are not considered a serious medical condition. But, they can be uncomfortable and can lead to more serious problems. Varicose veins are caused by increased blood pressure in the veins. Varicose veins occur in the veins near the surface of the skin (superficial). The blood moves towards the heart by 1-way valves in the veins. When the valves become weakened or damaged, blood can collect in the vein"}]