[{"url": "http://www.backyardgardener.com/gardening/plantcare/taxus.html", "passage_text": "Taxus baccata is a densely branched tree when growing in the open; when growing closely together, the trees may become branchless for a considerable height, and then have a head of moderate size. Under favorable conditions the English Yew grows 30-60 feet high with a trunk 9-20 ft. in girth. Taxus (Tax'us) are beautiful evergreen trees and shrubs that are natives of North America, Europe and Asia. They belong to the Yew family, Taxaceae. The name is an old Latin one for Taxus baccata, the European Yew."}, {"url": "http://www.gardenguides.com/101513-plant-yew-tree.html", "passage_text": "Overview. Many yew tree varieties grow vibrantly throughout western, central and eastern regions of the United States. Because the light and soil requirements of the evergreen yews are broad and varied, these trees grow readily in many home landscapes. Step 1. Choose a growing area that receives partial shade throughout the day. The growing area must be large enough to accommodate the full-grown yew tree. Some yew varieties grow up to 20 feet tall and the spreading cultivars sometimes become as wide as 15 to 18 feet."}, {"url": "https://en.wikipedia.org/wiki/Taxus_baccata", "passage_text": "Taxus baccata is a conifer native to western, central and southern Europe, northwest Africa, northern Iran and southwest Asia. It is the tree originally known as yew, though with other related trees becoming known, it may now be known as English yew, or European yew. It is a small to medium-sized evergreen tree, growing 10–20 metres (33–66 ft) (exceptionally up to 28 metres (92 ft)) tall, with a trunk up to 2 metres (6 ft 7 in) (exceptionally 4 metres (13 ft)) diameter. The bark is thin, scaly brown, coming off in small flakes aligned with the stem."}, {"url": "http://www.brickfieldspark.org/data/yew.htm", "passage_text": "Yew-Taxus baccata. known in Ireland as Lur. This tree is poisonous. Familiar evergreen conifer growing to 25M (82ft) though usually 15M (50ft), with characteristic red fleshy berries (arils). Very long lived-Maybe even 2000 years, grows on limestone and chalk soils, and has been planted in many cultivated varieties. Often occurs in the dense shade of Oak woods."}, {"url": "http://www.ehow.com/how_8233448_grow-yew-seed.html", "passage_text": "Stockbyte/Stockbyte/Getty Images. Yew, or Taxus baccata, occurs naturally across much of Europe, Asia and the Middle East. Growing to 60 feet in height, it is a medium-sized evergreen tree with a shrubby shape made up of dark-green, needlelike foliage and a summertime display of small red berries. "}, {"url": "https://en.wikipedia.org/wiki/Taxus_brevifolia", "passage_text": "Characteristics [edit]. The Pacific yew is a small to medium-sized evergreen tree, growing 10–15 m tall and with a trunk up to 50 cm diameter, rarely more. In some instances, trees with heights in excess of 20 m occur in parks and other protected areas, quite often in gullies. The tree is extremely slow growing, and has a habit of rotting from the inside, creating hollow forms."}, {"url": "http://www.gardeningknowhow.com/ornamental/shrubs/yew/growing-yew-shrubs.htm", "passage_text": "‘Citation’, ‘Hicksii’, ‘Stoveken’ and ‘Viridis’ are excellent choices for upright column-like specimens of the Taxus yew plant. ‘Capitata’ is an upright pyramidal form, which can attain a 20 feet to 40 feet height by 5 feet to 10 feet width. Taxine is the name of the toxin found in the Taxus yew shrubs and shouldn’t be confused with taxol, which is a chemical extraction of the bark of the western yew (Taxus brevifolia) used in cancer treatment. Taxus x media is notable for its dark green, one inch long evergreen needles."}, {"url": "http://www.kew.org/science-conservation/plants-fungi/taxus-baccata-common-yew", "passage_text": "Description. Taxus baccata is a densely branching, evergreen tree with a massive trunk, reaching up to 20 m tall. The leaves are dark green, linear and up to 3 cm long, with a pointed tip, and appear to spread in two rows on either side of the shoot. "}, {"url": "http://runescape.wikia.com/wiki/Yew_tree", "passage_text": "Players with a Woodcutting level of at least 60 can chop a yew tree to obtain 175 experience and yew logs. , which are used in Fletching or Firemaking, but also play a role in Farming. The respawn rate of 1 yew tree ranges from 1 minute to 2 minutes depending on how many people are currently playing in the same world. As with all trees above normal trees and achey trees, yews can yield multiple logs when chopped. Yew trees are marked with a rare tree mark on the mini-map."}]