[{"url": "http://patent-toronto.tumblr.com/post/21388842262/design-patents-v-utility-patents", "passage_text": "Firstly, lets get some nomenclature out of the way. In the United States, there are two terms which are commonly used - “design patent” and “utility patent”. In Canada, we use the term “industrial design” to refer to a type of legal document which protects the visual appeal (design) of a product. "}, {"url": "http://www.nolo.com/legal-encyclopedia/types-patents.html", "passage_text": "When most people refer to a patent, they are usually referring to a utility patent. Once a patent is granted, the owner may enforce it by bringing a patent infringement action (lawsuit) against anyone who makes, uses, or sells the invention without the patent owner’s permission. If you acquire a utility patent, you can stop others from making, using, selling and importing the invention. A utility patent last for 20 years from the date that the patent application is filed."}, {"url": "https://en.wikipedia.org/wiki/Patent", "passage_text": "A patent (/ˈpaetənt/ ˈpætənt /or/) ˈpeɪtənt is a set of exclusive rights granted by a sovereign state to an inventor or assignee for a limited period of time in exchange for detailed public disclosure of an. Invention an invention is a solution to a specific technological problem and is a product or a. process The procedure for granting patents, requirements placed on the patentee, and the extent of the exclusive rights vary widely between countries according to national laws and international agreements. Typically, however, a granted patent application must include one or more claims that define the invention."}, {"url": "http://www.nolo.com/legal-encyclopedia/types-patents.html", "passage_text": "Among the many types of creative works that might qualify for a utility patent are biological inventions; new chemical formulas, processes, or procedures; computer hardware and peripherals; computer software; cosmetics; electrical inventions; electronic circuits; food inventions; housewares; machines; and magic tricks. If you acquire a utility patent, you can stop others from making, using, selling and importing the invention. A utility patent last for 20 years from the date that the patent application is filed."}, {"url": "http://www.neustel.com/Design-Utility-Patents/Design-Patent-vs-Utility-Patent.aspx", "passage_text": "Utility patent applications are the most common type of patent application filed with the U.S. Patent Office. While utility patent applications are more expensive than design patent applications, a utility patent typically will protect your invention better than a design patent. 1 Cheaper than utility patent. 2  Usually faster patent protection at the U.S. Patent Office (normally between 1-2 years). 3  If the main feature of the new product is the appearance (i.e. ornamental design), then a design patent will protect this main feature."}, {"url": "http://www.nolo.com/legal-encyclopedia/qualifying-patent-faq-29120.html", "passage_text": "The U.S. Patent and Trademark Office (USPTO) issues three different kinds of patents: utility patents, design patents, and plant patents. To qualify for a utility patent -- by far the most common type of patent -- an invention must be: 1  a process or method for producing a useful, concrete, and tangible result (such as a genetic engineering procedure, an investment strategy, computer software, or a process for conducting e-commerce on the Internet). "}, {"url": "https://en.wikipedia.org/wiki/Patent", "passage_text": "The additional qualification utility patent is sometimes used (primarily in the US) to distinguish the primary meaning from these other types of patents. Particular species of patents for inventions include biological patents, business method patents, chemical patents and software patents. The procedure for granting patents, requirements placed on the patentee, and the extent of the exclusive rights vary widely between countries according to national laws and international agreements. Typically, however, a granted patent application must include one or more claims that define the invention."}, {"url": "http://www.neustel.com/Design-Utility-Patents/Design-Patent-vs-Utility-Patent.aspx", "passage_text": "While a utility patent is by far the most common type of patent used to protect inventions, a design patent should not be overlooked for certain types of invention. Below is a discussion regarding the differences between a design patent and a utility patent. 1 Cheaper than utility patent. 2  Usually faster patent protection at the U.S. Patent Office (normally between 1-2 years). 3  If the main feature of the new product is the appearance (i.e. ornamental design), then a design patent will protect this main feature."}, {"url": "http://www.legalzoom.com/trademarks-patents-copyrights/summary-compare-patents.html", "passage_text": "When inventors talk about patents, they're usually referring to a utility patent. That's because utility patents cover the most common types of inventions -- those producing some sort of useful function or result. Provisional Application for Patent: The review process for a utility patent typically takes up to 3 years, or even more. But to help inventors begin protecting their inventions sooner, the US Patent and Trademark Office (USPTO) offers a faster, more affordable option called a Provisional Application for Patent."}, {"url": "http://www.nolo.com/legal-encyclopedia/types-patents.html", "passage_text": "You may be able to protect your rights with a patent. A patent is a grant by the U.S. Patent and Trademark Office (USPTO) that allows the patent owner to maintain a monopoly for a limited period of time on the use and development of an invention, design or plant. If you acquire a utility patent, you can stop others from making, using, selling and importing the invention. A utility patent last for 20 years from the date that the patent application is filed."}]