[{"url": "http://www.jeepforum.com/forum/f13/speed-input-output-sensor-failure-561977/", "passage_text": "My Jeeps. Speed Input/Output Sensor failure... Wife calls on the way to work this morning describing the same symptoms as when a speed sensor went bad a few years ago. (I do not know which one of the 2 failed though.). I had her pull the codes (she s a good listener) and PO700 is the only one that appear"}, {"url": "http://www.youtube.com/watch?v=rAenb7qb3BY", "passage_text": "A sensor that rarely ever fails, but if it your vehicle is equipped with one of these and does fail expect the speedometer to fluctuate and the transmission to shift erratically. The cost of the part was 74 dollars, and took 30 minutes to install. "}, {"url": "http://gadflyofthenation.blogspot.com/2012/03/how-can-you-tell-if-your-car-has-faulty.html", "passage_text": "You're absolutely right! A faulty engine speed sensor can be caused by a bad transmission. In most cases, it's found on automatics. This is why it's very important to have your car regularly checked. If a car is experiencing any of the above symptoms, it is always best if you take your car into a local garage and ask them to run computer diagnostic tests on the vehicle to see if the speed sensor is functioning correctly."}, {"url": "http://gadflyofthenation.blogspot.com/2012/03/how-can-you-tell-if-your-car-has-faulty.html", "passage_text": "A faulty vehicle speed sensor can cause a number of problems. The problem often is that these faults or symptoms can be very difficult to diagnose. Sensor faults can appear similar in many ways to other vehicle faults like a defective coil pack or a bad throttle position sensor. If a car is experiencing any of the above symptoms, it is always best if you take your car into a local garage and ask them to run computer diagnostic tests on the vehicle to see if the speed sensor is functioning correctly."}, {"url": "http://www.wjjeeps.com/speed_sensors.htm", "passage_text": "The TCM also compares the input speed signal and the engine speed signal to determine the following: Sensor failure: Failure of the Transmission Input Shaft Speed Sensor and/or the Output Shaft Speed Sensors are somewhat common on early model WJ Grand Cherokees. The 45RFE / 545RFE transmissions use two sensors, an input speed sensor and an output speed sensor. Both are the same part number. Operation: The Input Speed Sensor provides information on how fast the input shaft is rotating."}, {"url": "http://www.youtube.com/watch?v=TWUqx0FrLtM", "passage_text": "DONATE WITH PAYPAL: https://www.paypal.com/cgi-bin/webscr... This is just a short video showing you how to replace the input and output transmission speed sensors on a jeep grand cherokee. this can sometimes be all you have to to fix your jeep when you get the P0700 code on your dashboard. "}, {"url": "http://www.flashoffroad.com/Maintenance/SpeedSensor/SpeedSensor.htm", "passage_text": "John also said that the transmission has a output speed sensor that is not used on the Hummer because we get the output speed from the T-case. This sensor is the same as the input speed sensor, which can be used as a spare in case the input speed sensor fails. John says the failure of the input speed sensor is very unlikely. Fortunately maintaining the Output speed sensor is very easy."}, {"url": "http://freeasestudyguides.com/vehicle-speed-sensors.html", "passage_text": "Vehicle Speed Sensors. Vehicle Speed Sensors come in several different designs depending on the manufacturer. They’re used as sensor input for the ABS and Traction Control systems. It inputs data to the transmission for shift control, cruise control, and ABS (anti-lock brakes) only to name a few. As the shaft of this sensor spins, it generates an on off signal to the vehicles PCM and TCM. The PCM converts this signal into vehicle speed. In later model vehicles this information is shared between computer systems by multiplexing."}, {"url": "http://www.toptransmissions.com/electrical-sensors", "passage_text": "The input speed sensor measures the RPM of the input shaft of the transmission. With the engine running and the vehicle in gear (forward or reverse), if the car or truck is not moving, the input shaft of the transmission is also not moving. This is because the torque converter, which is a fluid drive, allows this effect, which is perceived as 'slipping'. When the input shaft moves, the input speed sensor detects this motion, and wires deliver this signal to the control module. The Vehicle Speed Sensor measures vehicle speed. If it fails or malfunctions the automatic transmission may not operate properly. It may also cause the automatic transmission to go into failsafe mode making it appear that the problem is more severe than it actually is."}]