[{"url": "http://study.com/academy/lesson/upper-epidermis-of-a-leaf-function-definition-quiz.html", "passage_text": "The epidermis of a plant is the single, clear layer of cells that cover the roots, stems, flowers, fruits, and leaves. It acts like a protective covering from the sun, temperature changes, and moisture changes in the environment. Often a waxy coating, called a cuticle, adds an extra layer of protection.erry has a master's degree in environmental communications and has taught in a variety of settings. The epidermis of a plant is often overlooked, but it's an important barrier between the elements and the other tissues. Here, you'll learn about the structure and functions of the upper epidermis of a leaf."}, {"url": "http://study.com/academy/lesson/structure-of-leaves-the-epidermis-palisade-and-spongy-layers.html", "passage_text": "Stomata and the Lower Epidermis. Remember that the top of the leaf has the protective coating of the cuticle and then a layer of cells known as the upper epidermis. On the bottom of the leaf is another protective layer of cells.elow the upper epidermis is the palisade layer. This is one or a few layers of cylindrical cells that contain many chloroplasts. Chloroplasts are an important part of plant cells because they are cell structures that allow for photosynthesis."}, {"url": "http://www.thefreedictionary.com/Lower+Epidermis", "passage_text": "epidermis. n. 1. (Biology) Also called: cuticle the thin protective outer layer of the skin, composed of stratified epithelial tissue. 2. (Anatomy) the outer layer of cells of an invertebrate. 3. (Botany) the outer protective layer of cells of a plant, which may be thickened by a cuticle."}, {"url": "https://en.wikipedia.org/wiki/Epidermis_(botany)", "passage_text": "7. epidermis. The epidermis cells (from the Greek επίδερμίδα, meaning over-skin) is a single-layer of cells that covers the leaves, flowers, roots and stems of plants. It forms a boundary between the plant and the external environment."}, {"url": "http://www.biology-online.org/dictionary/Epidermis", "passage_text": "In plants, the epidermal cells secrete further protective substance (called cuticle) to prevent desiccation (water loss). A plant leaf is lined with two layers of epidermis (i.e. upper and lower): one on top of and another one below the mesophyll layer. The epidermis is a protective outer covering of many plants and animals. It may be comprised of a single layer, as in plants, or of several layers of cells on top of the dermis, as in those of vertebrate animals. The primary role of the epidermis is to protect the more susceptible layers of the skin."}, {"url": "http://study.com/academy/lesson/upper-epidermis-of-a-leaf-function-definition-quiz.html", "passage_text": "Lesson Summary. The epidermis of a plant is the single, clear layer of cells that cover the roots, stems, flowers, fruits, and leaves. It acts like a protective covering from the sun, temperature changes, and moisture changes in the environment. Often a waxy coating, called a cuticle, adds an extra layer of protection. Terry has a master's degree in environmental communications and has taught in a variety of settings. The epidermis of a plant is often overlooked, but it's an important barrier between the elements and the other tissues. Here, you'll learn about the structure and functions of the upper epidermis of a leaf."}, {"url": "http://www.biology-online.org/dictionary/Epidermis", "passage_text": "noun. One or more layers of cells forming the outermost portion of the skin or integument. Supplement. The epidermis is a protective outer covering of many plants and animals. It may be comprised of a single layer, as in plants, or of several layers of cells on top of the dermis, as in those of vertebrate animals. The primary role of the epidermis is to protect the more susceptible layers of the skin."}, {"url": "http://www.thefreedictionary.com/Upper+Epidermis", "passage_text": "epidermis. n. 1. (Biology) Also called: cuticle the thin protective outer layer of the skin, composed of stratified epithelial tissue. 2. (Anatomy) the outer layer of cells of an invertebrate. 3. (Botany) the outer protective layer of cells of a plant, which may be thickened by a cuticle. Hair and feathers grow from the epidermis. 2. The outer layer of cells of the stems, roots, and leaves of plants. The cells of the epidermis are set close together to protect the plant from water loss, invasion by fungi, and physical damage."}, {"url": "http://study.com/academy/lesson/structure-of-leaves-the-epidermis-palisade-and-spongy-layers.html", "passage_text": "It is generally waxy to protect the leaf and prevent water loss. When you touch a leaf, you may feel this waxy coating, and on some plants, such as holly, you may actually be able to see the waxy coat shine a bit. Below the cuticle is the epidermis. On the top of the leaf, this is known as the upper epidermis. This is a single layer of cells found directly below the cuticle. It helps protect the leaf by aiding in preventing water loss and providing an extra layer between the outside and inside of the leaf.elow the upper epidermis is the palisade layer. This is one or a few layers of cylindrical cells that contain many chloroplasts. Chloroplasts are an important part of plant cells because they are cell structures that allow for photosynthesis."}, {"url": "http://www.thefreedictionary.com/Upper+Epidermis", "passage_text": "1. the outermost, nonvascular, nonsensitive layer of the skin, covering the dermis. 2. the outer epithelial layer of animal tissue. 3. a thin layer of cells forming the outer integument of seed plants and ferns.epidermis. epidermísair and feathers grow from the epidermis. 2. The outer layer of cells of the stems, roots, and leaves of plants. The cells of the epidermis are set close together to protect the plant from water loss, invasion by fungi, and physical damage."}]