[{"url": "http://openstudy.com/updates/519beb64e4b01a33ce977ccd", "passage_text": "Glasnost and perestroika were two of the reforms most associated with Mikhail Gorbachev in the Soviet Union. While they were great democratic reforms, they also had the unintended effect of bringing down the USSR in the long run which wasn't Gorbachev's intention."}, {"url": "http://www.answers.com/Q/What_were_some_of_the_reforms_of_Mikhail_Gorbachev", "passage_text": "Mikhail Sergeyevich Gorbachev, born in March 02, 1931, General Secretary of the Communist Party of the Soviet Union since 1985 and the last Head of the state of USSR until its collapse in 1991."}, {"url": "http://biography.yourdictionary.com/articles/why-did-mikhail-gorbachev-start-reforming-the-soviet-union.html", "passage_text": "Glasnost. Gorbachev implemented Glasnost to make the Soviet Union more free and more in line with other modern industrialized countries. Glasnost was a set of policies created in the late 1980s to: 1  Make the government of the USSR more transparent. 2  Increase accessibility to the affairs of the government."}, {"url": "http://biography.yourdictionary.com/articles/why-did-mikhail-gorbachev-start-reforming-the-soviet-union.html", "passage_text": "Mikhail Gorbachev served as General Secretary of the Communist Party of the Soviet Union from 1985 until 1991. Before he assumed office, much attention went to building up the nation’s military at the expense of development within the Soviet Union, which ultimately weakened the economy."}, {"url": "http://www.history.com/topics/cold-war/perestroika-and-glasnost", "passage_text": "Perestroika and Glasnost. When Mikhail S. Gorbachev stepped onto the world stage in March 1985 as the new leader of the Union of Soviet Socialist Republics (USSR), it was immediately clear that he was different from his predecessors."}, {"url": "http://openstudy.com/updates/519beb64e4b01a33ce977ccd", "passage_text": "***cartoon attached inside!*** A. The Soviet Union, led by Brezhnev, investigates the Prague Spring reforms. B. Soviet leader Brezhnev douses the spirit of freedom born during the Czech Prague Spring. C. The Soviet Union hides from neighboring countries the flame of political freedom found in Czechoslovakia."}, {"url": "https://bobhistory.wikispaces.com/Gorbachev", "passage_text": "Glasnost freedom of speech.. Or “openness”the policy of Glasnost was implemented by Gorbachev in an effort to gain support for perestroika and encourage the citizens of the Soviet Union to participate and provide insight into the system."}, {"url": "http://biography.yourdictionary.com/articles/why-did-mikhail-gorbachev-start-reforming-the-soviet-union.html", "passage_text": "Gorbachev’s Reform Efforts. Gorbachev started reforming the Soviet Union by implementing policies to bring about individual freedom, bureaucratic transparency and to stimulate economic change, most notably with the Sinatra Doctrine and Glasnost."}]