[{"url": "http://www.naturalwellbeing.com/learning-center/Disodium_EDTA/", "passage_text": "Description. Disodium EDTA may also be called EDTA, or ethylenediaminetetraacetic acid, and it is used in many personal care and consumer products. It is found as a main ingredient in many commercially prepared foods, cosmetics, household cleaners and also in skin care and hair care products. Disodium EDTA has properties that preserve and stabilize solutions. It is purifies products especially when tap water or another type of questionable water source is used. Disodium EDTA is also used as a chelating agent which effectively removes metal ions in the water."}, {"url": "http://www.whatisthatingredient.com/ingredient.php?id=64", "passage_text": "To help combat low vitamin levels, calcium disodium EDTA is usually given with a vitamin booster. Other side effects include allergic reactions; dangerously low blood sugar, blood pressure, or blood calcium levels; kidney failure and seizures. More information about CALCIUM DISODIUM EDTA. Calcium disodium EDTA should not be given with ceftriaxone, also known as Rocephin, according to Drugs.com. Ceftriaxone is a cephalosporin antibiotic used to treat bacterial infections."}, {"url": "http://www.livestrong.com/article/220542-dangers-of-calcium-disodium-edta/", "passage_text": "Calcium disodium EDTA is used to protect packaged food from spoiling. Photo Credit Jupiterimages/Comstock/Getty Images. Ethylenediaminetetraacetic acid, known as EDTA, is a chemical salt used to separate heavy metals from dyes and other substances. One form, known as calcium disodium EDTA, appears in foods and cosmetic products to prevent air from spoiling them by introducing unwanted oxygen into the products' molecular structures. "}, {"url": "http://www.ewg.org/skindeep/ingredient/702146/DISODIUM_EDTA/", "passage_text": "Use restrictions. Other LOW concerns: Enhanced skin absorption, Data gaps. About DISODIUM EDTA: EDTA (ethylenediaminetetraacetic acid) is a chelating agent, used to sequester and decrease the reactivity of metal ions that may be present in a product. Function(s): Chelating Agent; VISCOSITY CONTROLLING."}, {"url": "http://foodconstrued.com/2011/12/calcium-disodium-edta/", "passage_text": "Calcium disodium EDTA is a white, odorless, crystalline powder, with a faint, salty taste. In the food industry, it is commonly used a preservative and sequestrant. Calcium disodium EDTA is widely used and is becoming one of the most common organic pollutants. 2. Besides its use as a food additive, it is used in the textile and paper industries."}, {"url": "http://www.ewg.org/skindeep/ingredient.php?ingred06=702146", "passage_text": "Other LOW concerns: Enhanced skin absorption, Data gaps. About DISODIUM EDTA: EDTA (ethylenediaminetetraacetic acid) is a chelating agent, used to sequester and decrease the reactivity of metal ions that may be present in a product. Function(s): Chelating Agent; VISCOSITY CONTROLLING. "}, {"url": "http://www.ehow.com/facts_5007478_what-disodium-edta.html", "passage_text": "The Chemistry of Disodium EDTA. Disodium EDTA has the chemical formula of [CH2N(CH2CO2H)2]2, the molecular formula of C10H16N2O8, and is a major chelating agent from which all of its applications extend from. It has high affinity to free metal ions, a common pollutant and impurity in many chemical environments. "}, {"url": "http://foodconstrued.com/2011/12/calcium-disodium-edta/", "passage_text": "Calcium disodium EDTA has been approved in the U.S. for use in chelation therapy. Chelation therapy helps to remove heavy metals from the body and is used to treat lead poisoning and radiation exposure. As a food additive, it helps to prevent colour or flavour deterioration. Calcium disodium EDTA is widely used and is becoming one of the most common organic pollutants. 2. Besides its use as a food additive, it is used in the textile and paper industries."}, {"url": "http://www.naturalwellbeing.com/learning-center/Disodium_EDTA/", "passage_text": "Disodium EDTA is synthesized in the laboratory and is used in many industries as an effective chemical to remove metal ions in a solution. It can also be called acetic acid, edetate disodium, disodium salt acetic acid and many other chemical terms commonly used in a laboratory setting. Disodium EDTA has properties that preserve and stabilize solutions. It is purifies products especially when tap water or another type of questionable water source is used. Disodium EDTA is also used as a chelating agent which effectively removes metal ions in the water."}, {"url": "http://www.annmariegianni.com/ingredient-watch-list-tetrasodium-edta-the-preservative-made-from-formaldehyde/", "passage_text": "Laboratory technicians use the three ingredients mentioned above to synthesize EDTA, and then tetrasodium EDTA is derived from that. You’ll find it in moisturizers, skin care and cleansing products, personal cleanliness products, bath soaps, shampoos and conditioners, hair dyes, hair bleaches, and many other products. "}]