[{"url": "http://www.nytimes.com/2015/01/21/business/from-gluten-free-beer-to-kombucha-alcohol-options-for-health-conscious-drinkers.html", "passage_text": "The drink is fermented longer than traditional kombucha and contains 2 percent alcohol by volume — about four times that of most kombucha soft drinks, but still low for beer, which has 5 percent alcohol on average. Lambrucha — part lambic beer and part kombucha, with 3.5 percent alcohol — was introduced by Vanberg & DeWulf, the brewers of Ommegang, in 2010. Wendy Littlefield, a co-founder of the company, said Lambrucha had tripled in production since it was first introduced and was available in about 40 states."}, {"url": "http://www.naturalkombucha.com/kombucha-alcohol.htm", "passage_text": "Some people who are in recovery from alcoholism have found that kombucha tea is a good way to take the edge off.. However, anyone going through treatment for a alcohol dependency, who asked their councelor if it was okay to drink kombucha, would probably get no for an answer. "}, {"url": "http://foodreference.about.com/od/bar_beverage/a/What-Is-Kombucha.htm", "passage_text": "The yeast in the culture ferments the sugar into alcohol, which is then further fermented by the bacteria into acetic acid. The alcohol level in kombucha generally stays below 0.5%, which is considered nonalcoholic by U.S. beverage standards. Kombucha uses a combination of yeast and bacterial cultures to produce an end product that is only slightly alcoholic and mildly acidic. Because most of the alcohol is further fermented into acetic acid, kombucha is considered a non-alcoholic beverage."}, {"url": "http://foodreference.about.com/od/bar_beverage/a/What-Is-Kombucha.htm", "passage_text": "Bottled Kombucha. Photo by Joefoodie [flickr]. Kombucha is a beverage made from fermented sweet tea that is usually consumed for its purported health properties. Kombucha uses a combination of yeast and bacterial cultures to produce an end product that is only slightly alcoholic and mildly acidic. Because most of the alcohol is further fermented into acetic acid, kombucha is considered a non-alcoholic beverage."}, {"url": "http://www.huffingtonpost.ca/2013/05/30/kombucha_n_3354612.html", "passage_text": "Kombucha is a fizzy, fermented beverage made from tea that is refreshing (especially as the weather heats up) but also great for you. The drink is essentially fermented tea: it's made from sweetened tea, usually black, that is fermented by a bacteria and yeast culture and ends up full of probiotics as a result. Tea has been enjoying a surge of popularity for a few years now, due in part to its health benefits. Kombucha should have an alcohol content less than 0.5 percent, unless it is left too long or refermented. The drink was pulled from shelves at Whole Foods in 2010 when there were concerns some bottles had sat too long and may have a higher-than-allowed percentage, but it reappeared after manufacturing changes."}, {"url": "http://www.phoenixhelix.com/2013/03/25/kombucha-myths-vs-truths/", "passage_text": "1 (Beer contains 4-6%.) Single fermentation home brews of kombucha usually contain only .5% alcohol. 2  If you do a second fermentation in a bottle, to flavor it and increase the carbonation, the alcohol content will increase slightly. 1 Although kombucha is made with caffeinated tea, by the end of the fermentation cycle, none remains. 2  MYTH. Roussin found that the caffeine content doesn’t reduce at all. 3  This myth might have started because only 6-8 teabags are used to brew a gallon of kombucha tea, which is half the strength of a normal cup of tea."}, {"url": "http://www.phoenixhelix.com/2013/03/25/kombucha-myths-vs-truths/", "passage_text": "1 Kombucha is an alcoholic drink. 2  TRUE. 3  However, it’s a very small amount, usually between .5 and 3%, depending on length of fermentation. ( 4 Beer contains 4-6%.) Single fermentation home brews of kombucha usually contain only .5% alcohol. 1 Although kombucha is made with caffeinated tea, by the end of the fermentation cycle, none remains. 2  MYTH. Roussin found that the caffeine content doesn’t reduce at all. 3  This myth might have started because only 6-8 teabags are used to brew a gallon of kombucha tea, which is half the strength of a normal cup of tea."}, {"url": "https://en.wikipedia.org/wiki/Kombucha", "passage_text": "Historically, kombucha has been home-brewed or locally brewed, but in the late 1990s, commercially bottled kombucha became available in North American retail stores. It is known in Chinese as chajūn (chájūn), 茶菌 japanese as-kōcha (kinoko紅茶), キノコ korean as (hongchabeoseotcha홍차) 버섯차 And russian as chaynyy (grib чайный). гриб The exact origination of kombucha, how or where, is unknown. The drink was consumed in east Russia at least as early as 1900, and from there entered Europe. In 1913, kombucha was first mentioned in German literature. At least as early as the mid-1990s it became popular in the US."}, {"url": "http://www.cbsnews.com/news/kombuchas-alcoholic-content-causes-confusion/", "passage_text": "Kombucha makers say it leaves production with almost no alcohol. But alcohol can develop over time in unpasteurized versions because the yeast is still alive, converting sugars to alcohol. The more sugar a drink has, the more alcohol can ferment. So each recipe might be different. Gerry Khermouch, editor of Beverage Business Insights, estimates some kombucha brands might have 2 to 3 percent alcohol, based on reports from producers doing independent testing. Regular beer has about 4 to 5 percent alcohol."}, {"url": "http://www.nytimes.com/2015/01/21/business/from-gluten-free-beer-to-kombucha-alcohol-options-for-health-conscious-drinkers.html", "passage_text": "Kombrewcha, a carbonated tea-beer that went on sale in Connecticut and New York last year, is fermented longer than traditional kombucha and contains 2 percent alcohol by volume. Credit Tony Cenicola/The New York Times. Lambrucha — part lambic beer and part kombucha, with 3.5 percent alcohol — was introduced by Vanberg & DeWulf, the brewers of Ommegang, in 2010. Wendy Littlefield, a co-founder of the company, said Lambrucha had tripled in production since it was first introduced and was available in about 40 states."}]