[{"url": "http://www.vintageveggies.com/catalog/vegetable/tomato/tomato_growing.html", "passage_text": "Growing Tomatoes from Seed: It really is not difficult to grow tomatoes from seed but does take a little bit of planning. Start the seeds indoors 6 to 8 weeks prior to the last frost date in your area (refer to the Frost Pages). Plant about 1/4 inch deep, in flats or small pots using sterile seed starting material."}, {"url": "http://www.ehow.com/how_5644140_germinate-tomato-seeds.html", "passage_text": "Seed Germination. Soil temperature has an effect on how quickly seeds germinate. If the soil is at 75 degrees Fahrenheit, seeds usually germinate in about seven days. Cooler temperatures slow germination, with seeds in 60 degrees F soil taking two weeks to sprout."}, {"url": "https://tomatofest.com/tomato-seeds-how-to-seed-starting-instructions.html", "passage_text": "If temperature is kept consistently and sufficiently warm, your tomato seeds will usually germinate within 5 to 10 days. Best to keep temperature range 70 to 80F (21 to 27C). The lower the temperature the slower the germination. However, temperatures below 50F (10C) or above 95F (35C) are poor for"}, {"url": "http://tomatoheadquarters.com/resources/tips-tomato-pepper-seed-germination/", "passage_text": "1 The length of time it takes for your seeds to germinate is heavily related to soil temperature. 2  Tomato seeds should germinate within 5-6 days if you can keep the soil temperature around 80º F. Peppers take a little longer with a little higher temperature (7-8 days at 85º F)."}, {"url": "http://www.answers.com/Q/How_long_do_seeds_take_to_germinate", "passage_text": "The length of time it takes a seed to germinate depends on a range of factors. Some of the most important are: The range of germination times generally varies from as little as one day (e.g. for some mustard seeds) to over one year (e.g. for some trees)."}, {"url": "http://www.homegrown-tomatoes.com/tomato-seeds/germinating-tomato-seeds/", "passage_text": "There isn't really a set time for tomatoes, as different varieties germinate at different times. The fastest I've ever had is 3 days; the slowest 12 days. In general, most germinate in 5 to 7 days. I generally wait 2 weeks before I consider a set of tomato seeds a lost cause for germinating."}, {"url": "http://faq.gardenweb.com/discussions/2766771/how-do-i-start-tomatoes-from-seed", "passage_text": "Tomato seeds usually germinate within 5 to 10 days when kept in the optimum temperature range of 70 to 80F (21 to 27C). Germination is delayed by lower temperatures and accelerated by higher temperatures. Temperatures below 50F (10C) or above 95F (35C) are detrimental to germination."}, {"url": "http://www.tomatodirt.com/germinate-seeds.html", "passage_text": "Plant your germinated seeds in seed cell trays within 12-24 hours of sprouting. Be careful to not allow the seed’s root to grow too long while still in the paper towel, or the root will penetrate the paper and be difficult to manipulate without breakage. Once the root is broken, your seed will no longer be viable."}]