[{"url": "http://www.youtube.com/watch?v=MoDHGgJsLzs", "passage_text": "Recipe for making BBQ chicken in the oven which will be juicy, tender and packed with flavor. Using your favorite BBQ sauce and with the help of some herbs and spices, we'll infuse the juicy pieces of chicken with a Caribbean twist. BTW, I said 50 minutes and not 15 minutes as it sounds when I speak.. "}, {"url": "http://www.livestrong.com/article/537577-how-to-cook-drumsticks-in-a-convection-oven/", "passage_text": "Roasting chicken drumsticks in a convection oven isn't any more difficult than cooking them in a traditional oven, though you will need to use a lower temperature and expect a shorter cooking time. A convection oven is a handy cooking tool to have because it cooks food more quickly than a conventional oven and yields more golden brown and juicy meat, according to the Fine Cooking website."}, {"url": "http://www.answers.com/Q/How_long_do_you_cook_chicken_legs_in_a_convection_oven", "passage_text": "You should cook chicken legs in an convection oven for between 20 and 30 minutes depending on the temperature. The air movement of convection ovens greatly reduces cooking times when compared to traditional ovens. "}, {"url": "http://www.livestrong.com/article/537577-how-to-cook-drumsticks-in-a-convection-oven/", "passage_text": "1 Your chicken drumsticks will cook about 25 percent more quickly in a convection oven than a conventional oven, according to the Fine Cooking website. A convection oven is a handy cooking tool to have because it cooks food more quickly than a conventional oven and yields more golden brown and juicy meat"}, {"url": "http://www.redkitchenrecipes.com/2011/08/convection-roasted-chicken-legs.html", "passage_text": "Pre-heat oven to Convection Roast 400 degrees. Meanwhile, cover a pan with foil, and spray with a thin layer of canola spray. Place the chicken legs on the foil until the oven is preheated-about 15 minutes. When ready, put the pan in the oven and set your timer for 20 minutes. When time is up, change your heat to 325 degrees, then set timer for 10 minutes. When time is up, remove pan from oven and let sit for 10 minutes before eating"}, {"url": "http://www.chowhound.com/post/convection-roast-chicken-829508#!", "passage_text": "I take the chicken out of the refrigerator about an hour before cooking, set the oven at 325 and roast until a thermometer in the breast reads between 160-165. Then I take it out of the oven, tent it with foil, and let it rest for 10-20 minutes. When roasting a chicken in a non-convection oven, it will cook faster and more evenly on a roasting rack than sitting low in a pan, because the part of the bird sitting low in the pan gets surrounded by a sort of 'cushion' of cooler air."}, {"url": "http://www.ehow.com/how_5616166_cook-chicken-pieces-convection-oven.html", "passage_text": "Spray the baking sheet with the olive oil cooking spray and set the chicken pieces on the baking sheet. Pamela Follett/Demand Media. Place the chicken in the convection oven. Chicken wings and backs must cook for 35 minutes, while chicken thighs and breasts need to cook for 40 minutes."}, {"url": "http://www.purcellmurray.com/blog/index.php/article/4050", "passage_text": "Combine the seasonings and oil in a large glass baking-dish, add the chicken and coat with the spice mixture. Cover and refrigerate overnight or for a few hours. Pre-heat the oven to Convection Roast or Convection Bake 350 degrees. Place the chicken pieces on a rimmed baking sheet and place it in the oven on rack position 2 (counting up from the bottom of the oven) Cook for 20 minutes, turn the pieces, brush with the BBQ sauce and cook for another 15 minutes."}, {"url": "http://www.epicurious.com/archive/kitchenequipment/expertadvice/convectionovencooking", "passage_text": "1 The vegetables will cook in about 45 minutes and the chicken will be done in as little as 1 hour and 20 minutes. 2  Herbed Roast Leg of Lamb with Roasted Onions and Potatoes. 3  Start at the higher temperature and then drop it to 325°F after 15 minutes. 4  Start checking the internal temperature for doneness after 50 minutes. Roasting with the Convection Oven. 1  Roast Chicken and Root Vegetables with Mustard-Rosemary Sauce. 2  The vegetables will cook in about 45 minutes and the chicken will be done in as little as 1 hour and 20 minutes. 3  Herbed Roast Leg of Lamb with Roasted Onions and Potato"}]