[{"url": "http://www.arts.gla.ac.uk/ScotLit/ASLS/SWE/TBI/TBIIssue13/Sassenach.html", "passage_text": "Scots Word of the Season: Sassenach. Sassenach adj. and n. English; an English person. Sassenach is derived from the Scottish Gaelic word sasunnach, literally meaning 'Saxon', and originally used by Gaelic speakers to refer to non-Gaelic speaking Scottish Lowlanders. The divisive aspect of sassenach is mitigated somewhat by its adoption by English people. Writing in the Aberdeen Press and Journal in February, Jeremy Cresswell stated: Strictly speaking I'm a sassenach, but I have spent the bulk of my working life north of the border."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20070925015456AA61uT8", "passage_text": "Report Abuse. Sassenach is derived from the Scottish Gaelic word sasunnach, literally meaning 'Saxon', and originally used by Gaelic speakers to refer to non-Gaelic speaking Scottish Lowlanders. Rating Newest Oldest. Best Answer: Sassenach is a word used chiefly by the Scots to designate an Englishman [1] It derives from the Gaelic Sasunnach meaning, originally, Saxon. The modern Scottish spelling is 'Sasannach'. As employed by Scots or Scottish English-speakers today it is usually used in jest, as a (friendly) term of abuse"}, {"url": "http://www.encyclopedia.com/doc/1O214-Sassenach.html", "passage_text": "Sassenach Scottish term for an English person. Recorded from the early 18th century, the word comes from Scottish Gaelic Sasunnoch, Irish Sasanach, from Latin Saxones ‘Saxons’. Cite this article. Pick a style below, and copy the text for your bibliography. "}, {"url": "http://www.thefreedictionary.com/Sassenach", "passage_text": "Noun. 1. Sassenach-the Scots' term for an English person. English person-a native or inhabitant of England. Translations. Sassenach. n. 1. (Peoples) Scot and Irish an English person or a Lowland Scot."}, {"url": "http://www.merriam-webster.com/dictionary/sassenach", "passage_text": "Origin of SASSENACH. Irish Sasanach, of Germanic origin; akin to Old English Seaxan Saxons. This word doesn't usually appear in our free dictionary, but the definition from our premium Unabridged Dictionary is offered here on a limited basis. Note that some information is displayed differently in the Unabridged"}, {"url": "http://www.thefreedictionary.com/Sassenachs", "passage_text": "Sassenach. n. 1. (Peoples) Scot and Irish an English person or a Lowland Scot. [C18: from Scot Gaelic Sasunnach, Irish Sasanach, from Late Latin saxonēs Saxons]. "}, {"url": "http://www.arts.gla.ac.uk/ScotLit/ASLS/SWE/TBI/TBIIssue13/Sassenach.html", "passage_text": "Sassenach, while a potentially loaded term, is found in a wide range of contexts, sometimes for stylistic effect. The Herald asserted in 2002 that: 'BBC Scotland is hoping [the soap opera] River City will be just as long-running as its Sassenach equivalents'. The divisive aspect of sassenach is mitigated somewhat by its adoption by English people. Writing in the Aberdeen Press and Journal in February, Jeremy Cresswell stated: Strictly speaking I'm a sassenach, but I have spent the bulk of my working life north of the border."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20070925015456AA61uT8", "passage_text": "Sassenach is a word used chiefly by the Scots to designate an Englishman.[1] It derives from the Gaelic Sasunnach meaning, originally, Saxon. The modern Scottish spelling is 'Sasannach'. As employed by Scots or Scottish English-speakers today it is usually used in jest, as a (friendly) term of abuse. Rating Newest Oldest. Best Answer: Sassenach is a word used chiefly by the Scots to designate an Englishman [1] It derives from the Gaelic Sasunnach meaning, originally, Saxon. The modern Scottish spelling is 'Sasannach'."}]