[{"url": "http://www.s-cool.co.uk/forums/pe/what-bones-are-used-when-shooting-in-netball", "passage_text": "When shooting a Netball the muscles being used are the Triceps, Biceps, Deltoids. Also your Extendors and Flexors. The bones being used are the Humerus, Radius, Ulna, Scapula, Clavicle, Phalanges, Carpals and Metacarpals. "}, {"url": "http://www.livestrong.com/article/84389-muscles-used-shooting-basketball/", "passage_text": "While shooting a basketball, the shoulder muscles on your shooting arm are being more heavily recruited than the muscles on your non-shooting arm. This is because the humerus--the large bone in your upper arm--is being elevated higher. The trapezius and deltoids are the anatomical names for the muscles being used. The wrist extensors open the fingers and cause the hand to go back toward your upper arm. These muscles are being activated when you ave the ball up in front of your body. Once you follow through with your shot and your hand goes downward, your wrist flexors are"}, {"url": "http://www.answers.com/Q/What_muscles_are_used_playing_netball", "passage_text": "Answer   The precise answer is:     •Traipses, calf, biceps, trapezius, anterior deltoids, posterior deltoids, pectorals, hip, and quadriceps are the primary mus … cles used in volleyball.     There are a variety of muscles used to play volleyball. The main muscles used are the triceps. They allow your arm to extend in a forward motion quickly to produce a chest pass. Also the pectoralis majors on your chest coincide wit … h the triceps to generate more strength in the release of the ball. I would sugest doing press ups."}, {"url": "http://www.answers.com/Q/What_muscles_used_to_shoot_in_netball", "passage_text": "The main muscles used are the triceps. They allow your arm to extend in a forward motion quickly to produce a chest pass. Also the pectoralis majors on your chest coincide wit … h the triceps to generate more strength in the release of the ball. I would sugest doing press ups. In most games you can only shoot from inside the shooting circle,however some people play that you can shoot from outside the shooting circle and if you do you get 2 points. I … n the netball world cup 2011 the played this rule."}, {"url": "https://au.answers.yahoo.com/question/index?qid=20080613060920AAgGmbB", "passage_text": "Best Answer: The main skills that are used in netball are: Throwing skills-These include being able to catch the ball when you are thrown a lob, a fast pass, passes that there path has been altered by the wind and a wet ball (if you play on outdoor courts) and being able to catch the ball while you are on the run. Strength: Strenght is also very important in things like throwing, catching, running, jumping ect.. The main muscles that you use in netball and that should be the strongest are.... Shoulders-Your shoulder muscles are where nearly all of the power in your throws come from."}, {"url": "http://healthyliving.azcentral.com/muscles-used-shooting-basketball-10577.html", "passage_text": "Arms. When you shoot a basketball, you are primarily relying on the muscles of your arms to direct your shot and propel the ball forward. The triceps extend your elbow and play a major role in shooting. Shoulders. The trapezius, which is located at the collarbone, and the deltoid, which surrounds the joint of the shoulder near the arm, are the primary shoulder muscles involved in shooting a basketball. These muscles help to raise your arm and rotate your shoulders as you aim and then shoot."}, {"url": "http://healthyliving.azcentral.com/muscles-used-shooting-basketball-10577.html", "passage_text": "Hands. There are 17 muscles in the hand, and when you grip a basketball, shift the positioning of your fingers or lose your grip, these muscles play a role. The long flexors and extensors that extend throughout the hand are the most important muscle group involved in shooting a basketball. Shoulders. The trapezius, which is located at the collarbone, and the deltoid, which surrounds the joint of the shoulder near the arm, are the primary shoulder muscles involved in shooting a basketball. These muscles help to raise your arm and rotate your shoulders as you aim and then shoot."}, {"url": "http://www.answers.com/Q/What_muscles_used_to_shoot_in_netball", "passage_text": "Like most other ballistic movements in sports, when shooting in netball, if you do it properly using a fully balanced body effort, you will be using virtually every muscle in your body during some stage, including during the aftermath-as you return to your anatomical or original, relaxed position. In most games you can only shoot from inside the shooting circle,however some people play that you can shoot from outside the shooting circle and if you do you get 2 points. I … n the netball world cup 2011 the played this rule."}]