[{"url": "http://www.answers.com/Q/Why_is_Africa_called_the_plateau_continent", "passage_text": "Making the world better, one answer at a time. It is called the plateau continent, because Africa is sperated 2 big plateaux. And in lots of years Africa will be seperted into 2 continents. 1 Interesting Information on the Continent of Africa Africa is an absolutely amazing continent. 2  Since its start as the birthplace of humanity, it has grown to become a home to more than a billion people. 3  The climate of Africa v…. 4  The Geography of Africa Africa is one of the largest continents in the world."}, {"url": "http://simons-unit-four.tripod.com/activity10.html", "passage_text": "Identify the effects Africa's rivers have on the land and people. 3 NOTES I. 3 Major Landforms A. Plateaus 1. Large raised areas of mostly flat land 2. Because of this, common nickname is the plateau continent B. Coastal Plains 1. Strip of land along the shoreline 2. Strip is dry and sandy or marshy and moist C. Great Rift Valley 1. A 4,000 mile long trench that starts at the Red Sea to Mozambique 2."}, {"url": "http://www.answers.com/Q/Why_is_Africa_called_the_plateau_continent", "passage_text": "Africa is called the plateau continent because the whole continent is a plateau. Or land area that is considerably raised above sea level. plateau does not mean poor. 1 person found this useful. 1 Interesting Information on the Continent of Africa Africa is an absolutely amazing continent. 2  Since its start as the birthplace of humanity, it has grown to become a home to more than a billion people. 3  The climate of Africa v…. 4  The Geography of Africa Africa is one of the largest continents in the world."}, {"url": "http://www.7continentslist.com/africa/", "passage_text": "Africa Continent, Africa Facts. Africa is the second largest and the second most populous continent of the world. This is the continent of wonder and the place for evolution of human history. Africa is a continent with diverse culture, uncountable languages and immense natural resources. Considered as the oldest inhabited territory on the earth, Africa had no nation states for a long time."}, {"url": "http://www.answers.com/Q/Why_is_Africa_called_the_plateau_continent", "passage_text": "1 The Vast and Varied Continent of Africa Africa is the second-largest continent in the world behind Asia. 2  It has a total area of 11.73 million square miles. 3  It is known for its higher elevations in the southeast and…. 1 Interesting Information on the Continent of Africa Africa is an absolutely amazing continent. 2  Since its start as the birthplace of humanity, it has grown to become a home to more than a billion people. 3  The climate of Africa v…. 4  The Geography of Africa Africa is one of the largest continents in the world."}, {"url": "https://answers.yahoo.com/question/index?qid=20090514103755AAgoUVs", "passage_text": "Rating Newest Oldest. Best Answer: Because, most of Africa is well above 3000 feet. Within just a 100 or so miles of the coast of the southern third of the continent, the land rises steeply to this elevation. These long, steep, almost cliff like or mountain like, changes in relief are called escarpments. Africa is often characterized as a plateau continent. A plateau is an upland or tableland. All continents, except Africa, have continental mountain ranges."}, {"url": "http://teachersites.schoolworld.com/webpages/DCrouse/files/chapter%2018%20section%201%20landforms%20and%20resources.pdf", "passage_text": "The Great Escarpment marksthe edge of the continent’s plateau in Southern Africa. Africa’s Wealth of Resources The story of Africa’s natural resources is at once a storyof plenty and one of scarcity. Africa has a huge amountof the world’s minerals. "}]