[{"url": "http://www.answers.com/Q/Who_wrote_the_song_House_of_the_Rising_Sun'", "passage_text": "House of the Rising Sun is a folk song from the early 20th century. The authorship is unknown. The oldest known existing recording is by versatile Smoky Mountain artists Cla … rence Tom Ashley and Gwen Foster and was made in 1933. House of the Rising Sun Artists House of the Rising Sun has been recorded by many including Bob Dylan, The Animals, Frijid Pink and Creedence Clearwater Revival."}, {"url": "http://www.last.fm/music/The+Animals/_/The+House+of+the+Rising+Sun", "passage_text": "The House of the Rising Sun is a folk song from the United States. Also called House of the Rising Sun or occasionally Rising Sun Blues, it tells of a life gone wrong in New Orleans. Depending on the version, the song may be sung from the perspective of a woman or a man. read more. "}, {"url": "http://songmeanings.com/songs/view/15599/", "passage_text": "1) The song is about a brothel in New Orleans. The House Of The Rising Sun was named after Madame Marianne LeSoleil Levant (which means Rising Sun in French) and was open for business from 1862 (occupation by Union troops) until 1874, when it was closed due to complaints by neighbors. According to folklorist Alan Lomax in his book Our Singing Country (1941), the melody of The House of the Rising Run is a traditional English ballad and the lyrics were written by Georgia Turner and Bert Martin (both from Kentucky)."}, {"url": "http://www.answers.com/Q/Who_wrote_the_song_House_of_the_Rising_Sun'", "passage_text": "Confidence votes 14.6K. House of the Rising Sun is a folk song from the early 20th century. The authorship is unknown. The oldest known existing recording is by versatile Smoky Mountain artists Clarence Tom Ashley and Gwen Foster and was made in 1933. House of the Rising Sun Artists House of the Rising Sun has been recorded by many including Bob Dylan, The Animals, Frijid Pink and Creedence Clearwater Revival."}, {"url": "https://en.wikipedia.org/wiki/The_House_of_the_Rising_Sun", "passage_text": "The House of the Rising Sun  is a traditional folk song, sometimes called  Rising Sun Blues . It tells of a life gone wrong in New Orleans; many versions also urge a sibling to avoid the same fate. The oldest known existing recording of the song, under the title of Rising Sun Blues, is by Appalachian artists Clarence Tom Ashley and Gwen Foster, who recorded it for Vocalion Records on September 6, 1933. Ashley said he had learned it from his grandfather, Enoch Ashley"}, {"url": "http://www.musewiki.org/House_of_the_Rising_Sun_%28song%29", "passage_text": "Description. House of the Rising Sun is an American folk song, thought to be written by Georgia Turner and Bert Martin. This song tells of hard times in New Orleans. The most well known version was recorded by Eric Burdon and the Animals in 1964"}, {"url": "http://www.answers.com/Q/Who_wrote_house_of_the_rising_sun", "passage_text": "The House of the Rising Sun has been recorded by many including Bob Dylan, The Animals and Creedence Clearwater Revival. The earliest known recording was made in 1933 by App … alachian artists Clarence Ashley and Gwen Foster. House of the Rising Sun is a folk song from the early 20th century. The authorship is unknown. The oldest known existing recording is by versatile Smoky Mountain artists Cla … rence Tom Ashley and Gwen Foster and was made in 1933. Bob Dylan recorded it in 1961 and The Animals recorded it in 1964."}]