[{"url": "http://www.care2.com/greenliving/what-is-demerara-sugar.html", "passage_text": "Without question, we all have a pretty good idea of what sugar is. White refined sugar, which is the most common form of sugar commercially found, is usually made from either sugarcane (a perennial grass) or sugar beets (a sort of tuber). The products are then sufficiently refined and made into the granular white sugar we all know so well"}, {"url": "http://bakingbites.com/2008/01/what-are-demerara-turbinado-and-muscovado-sugars/", "passage_text": "Muscovado sugar is another type of unrefined sugar, a dark brown sugar. Unlike many brown sugars that are white sugars with molasses added back, it is darkly flavored from sugarcane juice left in during the production process. It tends to be sticky and can be used just like brown sugar. Sugar in the Raw is this type of sugar and you may have seen it at coffee shops, even if you haven’t noticed the name “turbinado” before. It works in place of plain sugar in just about all recipes. Demerara sugar is similar to turbinado sugar in that it also has large, irregular grains and a light brown color. It is unrefined and produced in such a way as to turn out very large crystals, larger even than those of turbinado"}, {"url": "http://www.care2.com/greenliving/what-is-demerara-sugar.html", "passage_text": "Demerara is a light brown, partially refined, sugar produced from the first crystallization during processing cane juice into sugar crystals (this process is similar to what happens with naturally evaporated cane juice). White refined sugar, which is the most common form of sugar commercially found, is usually made from either sugarcane (a perennial grass) or sugar beets (a sort of tuber)."}, {"url": "http://edmontonjournal.com/life/food/whats-the-difference-between-golden-brown-and-demerara-sugar", "passage_text": "Generally speaking, “golden” brown sugar has a light, delicate flavour without the heavy molasses notes of darker brown sugars. Regular brown sugar is dark and moist and is used for tasks where you want more of a molasses kick. Demerara sugar is darker still, with large crystals that give it a crunchy texture. There’s a helpful guide to the ubiquitous Rogers line of brown sugars on their website. "}, {"url": "http://www.thekitchn.com/whats-the-difference-muscovado-145157", "passage_text": "If you think sugar is just sweet, think again. Sugars like muscovado, demerara, and turbinado have flavor depths and aromatic heights that blow plain ol' granulated sugar out of the water. While most of these sugars are classified as raw, they're still typically refined to some extent in order to be used in cooking. • Demerara-This is a type of cane sugar with a fairly large grain and a pale amber color. It has a pleasant toffee flavor and can be used in place of brown sugar. • Sucanat-Made from crystallized pure cane sugar, this truly unrefined sugar retains a higher proportion of molasses than other types of cane sugars"}, {"url": "http://www.care2.com/greenliving/what-is-demerara-sugar.html", "passage_text": "But to be sure, Demerara sugar is actually far more delicious than your run of the mill white sugar, and lends complexity and depth to recipes, baked goods, and even tea. Its crunchy, large crystals are a nice addition (added sparingly) to the tops of muffins, cakes, and even cookies. White refined sugar, which is the most common form of sugar commercially found, is usually made from either sugarcane (a perennial grass) or sugar beets (a sort of tuber)."}, {"url": "http://www.wisegeek.org/what-is-demerara-sugar.htm", "passage_text": "Demerara sugar has a pale-to golden-yellow coloring. Fresh sugar beets are whitish roots that look slightly similar to turnips. Using demerara sugar in pale foods like meringues can discolor them. Because demerara sugar is unrefined, it has a molasses-like flavor that can enhance cookies and other baked goods. Demerara sugar is extracted primarily from sugar cane. Most coffee houses offer demerara sugar as an option for sweetening coffee. To make demerara sugar, sugar producers press sugar cane and steam the juice of the first pressing to form thick cane syrup. The cane syrup is allowed to dehydrate, leaving behind large golden brown crystals of sugar."}]