[{"url": "http://thejoyofshards.co.uk/history/", "passage_text": "The history of mosaic art-Mosaics in the ancient world. The history of mosaic goes back some 4,000 years or more, with the use of terracotta cones pushed point-first into a background to give decoration. It is a wall mosaic which uses pieces of glass to give the vivid colours and reflect light. Glass was not suitable for floor mosaics. Here, the tesserae were mainly small cubes of marble or other stone. Sometimes bits of pottery, such as terracotta, or brick were used to provide a range of colours."}, {"url": "http://www.aquilomosaics.com/a_brief_history_of_mosaic_a.html", "passage_text": "Brief History of Mosaic Art. Mosaics were one of the principle forms of expression in antiquity. They were a functional yet decorative feature of Middle eastern and Mediterranean villas, temples, shops, bath houses, and eventually churches and mosques. "}, {"url": "http://mosaic.cc/mosaic.html", "passage_text": "Mosaic roots and history. The oldest known mosaics come from the 8th BC. They were made of pebbles. Greek manufacturer developed this technique further in the 5th BC. Pebbles are homogeneous and vary in the colour range between black and white only. Manufacturers gathered the pebbles and used them for floors and footpaths. Greek manufacturers were able to create complex and first-class designs using this simple mosaic technique. They inserted stones on the scale of 1 to 2 cm and filled the outlines with small black pebbles."}, {"url": "https://en.wikipedia.org/wiki/Mosaics", "passage_text": "The last great period of Roman mosaic art was the 12th–13th century when Rome developed its own distinctive artistic style, free from the strict rules of eastern tradition and with a more realistic portrayal of figures in the space. Mosaic is an art form which uses small pieces of materials placed together to create a unified whole. The materials commonly used are marble or other stone, glass, pottery, mirror or foil-backed glass, or shells."}, {"url": "http://mosaic.cc/mosaic.html", "passage_text": "Mosaic is a decorative art involving coloured small pieces of glass, stone, minerals, and fragments of pottery or other material. Manufacturers gathered the pebbles and used them for floors and footpaths. Greek manufacturers were able to create complex and first-class designs using this simple mosaic technique. They inserted stones on the scale of 1 to 2 cm and filled the outlines with small black pebbles."}, {"url": "http://thejoyofshards.co.uk/history/", "passage_text": "The mosaic here shows the god Neptune with Amphitrite (on the right) and is in Herculaneum, Italy. It is a wall mosaic which uses pieces of glass to give the vivid colours and reflect light. Glass was not suitable for floor mosaics. Here, the tesserae were mainly small cubes of marble or other stone. Sometimes bits of pottery, such as terracotta, or brick were used to provide a range of colours."}, {"url": "https://en.wikipedia.org/wiki/Mosaics", "passage_text": "Mosaic art flourished in the Byzantine Empire from the 6th to the 15th centuries; that tradition was adopted by the Norman kingdom in Sicily in the 12th century, by eastern-influenced Venice, and among the Rus in Ukraine. Mosaic is an art form which uses small pieces of materials placed together to create a unified whole. The materials commonly used are marble or other stone, glass, pottery, mirror or foil-backed glass, or shells."}, {"url": "http://www.ancient.eu/Mosaic/", "passage_text": "by carinemahy. Mosaic is the art of creating images with an assemblage of small pieces of colored glass, stone, or other materials. The earliest known examples of mosaics made of different materials were found at a temple building in Ubaid, Mesopotamia, and are dated to the second half of 3nd millennium BCE. The most famous mosaics of the Roman world were created in Africa and in Syria, the two richest provinces of the Roman Empire. Many Roman mosaics are found in Tunisian museums, most of which date from the second to the seventh century CE."}, {"url": "http://www.answers.com/Q/Where_did_mosaics_originate_from_and_when", "passage_text": "It was the Romans, however, who really developed the art of mosaic.. Mosaic art is one of the oldest art forms and it also was probably one of the very first green arts due to being able to create mosaic art with discarded or found objects. Today many mosaic artists are promoting the upcycling side of mosaic art."}, {"url": "https://en.wikipedia.org/wiki/Mosaics", "passage_text": "Mosaic art flourished in the Byzantine Empire from the 6th to the 15th centuries. The majority of Byzantine mosaics were destroyed without trace during wars and conquests, but the surviving remains still form a fine collection. Mosaic is an art form which uses small pieces of materials placed together to create a unified whole. The materials commonly used are marble or other stone, glass, pottery, mirror or foil-backed glass, or shells."}]