[{"url": "https://en.wikipedia.org/wiki/Lonnie_Donegan", "passage_text": "Lonnie Donegan was born Anthony James Donegan in Bridgeton, Glasgow, Scotland, on 29 April 1931. He was the son of an Irish mother and a Scots father, a professional violinist who had played with the Scottish National Orchestra. In 1933, he moved with his family to East Ham in East London. He had 31 UK Top 30 single hits, 24 being successive and three at number one. He was the first British male singer with two US Top 10 hits. Donegan received an Ivor Novello lifetime achievement award in 1997 and in 2000 he was made an MBE."}, {"url": "http://www.imdb.com/name/nm0232396/", "passage_text": "Lonnie Donegan was born on April 29, 1931 in Glasgow, Scotland as Anthony James Donegan. He was married to Sharon Donegan, Jill Westlake and Maureen Donegan. He died on November 3, 2002 in Peterborough, Cambridgeshire, England. See full bio ». "}, {"url": "http://www.telegraph.co.uk/culture/books/biographyandmemoirreviews/9678833/Lonnie-Donegan-and-the-Birth-of-British-Rock-and-Roll-by-Patrick-Humphries-review.html", "passage_text": "He was born Anthony James Donegan in 1931 and his father was a good enough violinist to have played with the Scottish National Orchestra. The family moved to East Ham when Donegan was two and his father gave up music. It was while playing in a band with Chris Barber that Donegan (renamed after his hero Lonnie Johnson) hit the headlines. In 1954, the band added a couple of his 'folk' songs to an album called New Orleans Joys. The tracks were Rock Island Line (which Melly had previously recorded) and John Henry."}, {"url": "http://www.allmusic.com/artist/lonnie-donegan-mn0000277549/biography", "passage_text": "And he did it in 1954, before Elvis was known anywhere outside of Memphis and before Bill Haley was perceived as anything but a Western swing novelty act. Anthony James Donegan was born in Glasgow, Scotland on April 29, 1931, the son of a classical violinist who had played with the Scottish National Orchestra. Artist Biography by Bruce Eder. To look at Lonnie Donegan today, in pictures taken 40 years ago when he was topping the British charts and hitting the Top Ten in America, dressed in a suit, his hair cut short and strumming an acoustic guitar, he looks like a musical non-entity."}, {"url": "http://www.youtube.com/watch?v=TW9KUeMaJRQ", "passage_text": "This feature is not available right now. Please try again later. Uploaded on Sep 18, 2011. Anthony James Lonnie Donegan MBE (29 April 1931 -- 3 November 2002) was a skiffle musician, with more than 20 UK Top 30 hits to his name. He is known as the King of Skiffle and is often cited as a large influence on the generation of British musicians who became famous in the 1960s. Donegan was a fan of Johnson, and took his first name as a tribute to him. The story goes that the host at the concert got the musicians' names confused, calling them Tony Johnson and Lonnie Donegan, and Donegan was happy to keep the name."}, {"url": "https://en.wikipedia.org/wiki/Lonnie_Donegan", "passage_text": "Anthony James Donegan (29 April 1931 – 3 November 2002), better known as Lonnie Donegan, was a British singer, songwriter and musician, referred to as the King of Skiffle, who influenced 1960s British pop musicians. He had 31 UK Top 30 single hits, 24 being successive and three at number one. He was the first British male singer with two US Top 10 hits. Donegan received an Ivor Novello lifetime achievement award in 1997 and in 2000 he was made an MBE."}, {"url": "http://www.imdb.com/name/nm0232396/bio", "passage_text": "Mini Bio (1). Lonnie Donegan was born on April 29, 1931 in Glasgow, Scotland as Anthony James Donegan. He was married to Sharon Donegan, Jill Westlake and Maureen Donegan. He died on November 3, 2002 in Peterborough, Cambridgeshire, England. Lonnie Donegan was born on April 29, 1931 in Glasgow, Scotland as Anthony James Donegan. He was married to Sharon Donegan, Jill Westlake and Maureen Donegan"}, {"url": "http://www.bbc.co.uk/music/artists/a021814d-8911-481d-903a-bbbfc6d24068", "passage_text": "Go to Bio. Biography. Anthony James Donegan (29 April 1931 – 3 November 2002), better known as Lonnie Donegan, was a British singer, songwriter and musician, referred to as the King of Skiffle, who influenced 1960s British pop musicians. The British Hit Singles & ... "}, {"url": "http://news.bbc.co.uk/2/hi/entertainment/2400229.stm", "passage_text": "Musician Lonnie Donegan, known as the king of skiffle, has died aged 71. The Glasgow-born singer was midway through a UK tour after recovering from a heart operation earlier this year and was due to play a concert in Stoke, Staffordshire, on Monday. May worked with Donegan on his comeback album. He said the skiffle movement, of which Donegan was at the forefront, helped a generation realise they could make music themselves. And of course, Lonnie Donegan was the man at the time and therefore was very helpful to me.."}]