[{"url": "http://www.mayfieldclinic.com/PE-PD.htm", "passage_text": "Dopamine is a chemical used in body movement. When the dopamine-producing nerve cells die, symptoms such as tremor, slowness, stiffness, and balance problems begin to occur. The cause of Parkinson's is largely unknown, and the disease cannot be cured at this time. Treatments focus on reducing symptoms to enable a more active lifestyle."}, {"url": "http://www.mayfieldclinic.com/PE-PD.htm", "passage_text": "Figure 3. When the basal ganglia are over-or understimulated the symptoms of tremor, rigidity and slowness of movement occur. The action of dopamine is opposed by another neurotransmitter called acetylcholine. In PD the nerve cells that produce dopamine are dying."}, {"url": "http://www.minddisorders.com/Kau-Nu/Neurotransmitters.html", "passage_text": "Acetylcholine and norepinephrine are excitatory neurotransmitters while dopamine, serotonin, and GABA are inhibitory. Each neurotransmitter can directly or indirectly influence neurons in a specific portion of the brain, thereby affecting behavior."}, {"url": "http://biomed.brown.edu/Courses/BI108/BI108_1999_Groups/Neuroelectrodes_Team/background.html", "passage_text": "In a patient with Parkinson's disease, nerve cells in the part of the brain that produces dopamine, the substantia nigra, begin to decrease in number. Studies have shown that Parkinson's patients have a lost over 80% of their dopamine producing cells in the substantia nigra."}, {"url": "http://www.chemistryexplained.com/A-Ar/Acetylcholine.html", "passage_text": "Acetylcholine is the neurotransmitter produced by neurons referred to as cholinergic neurons. In the peripheral nervous system acetylcholine plays a role in skeletal muscle movement, as well as in the regulation of smooth muscle and cardiac muscle."}, {"url": "http://harryhong.com/index_files/NT.htm", "passage_text": "Neurotransmitters are messenger chemicals in the brain. Many neuropsychological conditions such as anxiety and depression are directly related to the imbalance of neurotransmitters. Common neurotransmitters include acetylcholine, dopamine, norepinephrine and serotonin etc."}, {"url": "http://biomed.brown.edu/Courses/BI108/BI108_1999_Groups/Neuroelectrodes_Team/background.html", "passage_text": "Nerve cells use a variety of chemical messengers called neurotransmitters to communicate with each other. Neurotransmitters serve to carry messages between nerve cells by crossing the synapse, or space between nerve cells. Neurotransmitters also allow nerves to communicate with muscle cells in order to create motion."}]