[{"url": "http://precastofmaine.com/", "passage_text": "Our ongoing mission is to provide quality precast concrete products, with the best possible customer service, giving our customers the best value for their money. We strive to be accommodating and fair to our customers as well as our employees while maintaining a viable, safe and profitable business."}, {"url": "https://delzottoproducts.com/2014/07/15/differences-wet-cast-dry-cast-concrete/", "passage_text": "Wet cast concrete is a flow-able form of concrete which may be poured from a mixer, hopper or truck. Wet cast concrete is often used in the precast industry, where it is cast in forms and stripped, finished and marked prior to shipping."}, {"url": "http://www.concreteexchange.com/how-to-center/take-a-workshop/3-day-comprehensive-concrete-countertop-training/", "passage_text": "This 3-day Concrete Countertop Training, hosted by California Living Museum, is conducted by CHENG Concrete Exchange. You’ll learn application methods for the most popular casting techniques such as GFRC, precast, and pour-in-place concrete countertops."}, {"url": "https://delzottoproducts.com/2014/07/15/differences-wet-cast-dry-cast-concrete/", "passage_text": "Dry cast on the other hand has a low water to cement ratio and a zero slump. This “Dry Process” allows you to use one form and pour numerous pieces without deformation. The concrete is stripped and resembles Hard clay and dries within and hour. The Del Zotto Concrete Mixer is proven itself and a larger market for dry cast products is in demand. The ability to dry cast Box Culverts, Concrete Pipe, Man Holes and various other products makes this a very lucrative and profitable business. More rigid formwork is necessary for dry-cast manufacturing than for normal-slump concrete production."}, {"url": "http://www.concretedecor.net/decorativeconcretearticles/vol-13-no-7-october-2013/casting-thin-concrete-furniture-with-gfrc/", "passage_text": "The concrete used to make thin, lightweight and functional pieces of furniture requires a material with a high flexural strength. Correctly made GFRC is formulated to provide these high strengths, so to ensure your furniture is strong and durable, you must make the GFRC correctly."}, {"url": "http://smallbusiness.chron.com/run-cast-concrete-business-40109.html", "passage_text": "How to Run a Cast Concrete Business. Precast concrete pipes come in different sizes. Stockbyte/Stockbyte/Getty Images. Precast concrete is used in construction for building walls, facades, pillars, freestanding walls, security walls, pipes and tunnels. Precast concrete is also used for modular paving and is tinted colors to look like stone."}, {"url": "http://www.motherearthnews.com/diy/concrete-sculptures-zmaz82mjzglo.aspx", "passage_text": "Join! Learn how one reader started a thriving business in making and selling concrete sculptures. Information includes a concrete recipe, what kinds of concrete molds to buy and advice for selling the product."}]