[{"url": "http://casablancamexican.com/the-history-behind-the-mexican-flag/", "passage_text": "The flag of Mexico has three vertical stripes on it; green, white and red. The Eagle in the Mexican Flag In the middle of the Mexican flag between the green and red stripes is a picture of an eagle holding a snake in its mouth hand right claw. The Left claw of the eagle is resting upon a cactus plant which in turn is situated in a lake. Symbolism of the Mexican Flag The symbolism of the three colors of the Mexican flag is also best explained in light of Mexican history. Originally a colony of Spain, Mexico finally gained it’s independence in the 19th century."}, {"url": "https://en.wikipedia.org/wiki/Flag_of_Mexico", "passage_text": "The flag of Mexico (Spanish: Bandera de Mexico) méxico is a vertical tricolor of, green, white and red with the national coat of arms charged in the center of the white. stripe The central emblem is the Mexican coat of arms, based on the Aztec symbol for Tenochtitlan (now Mexico City), the center of the Aztec empire. It recalls the legend that inspired the Aztecs to settle on what was originally a lake-island."}, {"url": "http://www.facts-about-mexico.com/mexican-flag.html", "passage_text": "The Mexican flag colors are three: green, white and red. Green: represents hope for a better nation, where people join together to achieve and maintain peace between them. White: represents the purity of catholic faith. Red: the color of blood. "}, {"url": "http://www.worldatlas.com/webimage/flags/countrys/camerica/mexico.htm", "passage_text": "DESCRIPTION. The flag of Mexico was officially adopted on November 2, 1821. The basic design is taken from the French Tricolor flag and the red, white and green are the colors of the national liberation army of Mexico. The coat of arms (centered) in the white band is the badge of Mexico City, the country's capital"}, {"url": "https://en.wikipedia.org/wiki/Flag_of_Mexico", "passage_text": "The current law of national symbols, Law on the National Arms, Flag, and Anthem, that governs the use of the national flag has been in place since 1984. Red, white, and green are the colors of the national liberation army in Mexico. The central emblem is the Mexican coat of arms, based on the Aztec symbol for Tenochtitlan (now Mexico City), the center of the Aztec empire. It recalls the legend that inspired the Aztecs to settle on what was originally a lake-island. The form of the coat of arms was most recently revised in 1968"}, {"url": "http://www.answers.com/Q/FAQ/10585", "passage_text": "The flag of Mexico is a rectangular flag with three vertical stripes of green, white and red. In the center of the white stripe, Mexico's coat of arms is featured. This flag was adopted in 1965 although a version of it has been used since the 1820's. Questions about the flag of Mexico can be directed here. They do look similar. The Italian flag has three vertical stripes in the order of green, white, and red. The Mexican flag has about the same vertical stripes (in the same order of green, white, and red) but with a crest in the middle including an eagle holding a snake in its claws."}, {"url": "http://www.mapsofworld.com/flags/mexico-flag.html", "passage_text": "Mexican Flag. Mexico's flag (Bandera de Mexico) consists of three vertical stripes of green, white and red, with Mexico's coat of arms in the center. It was adopted in Septembet 16, 1968, but the same flag has been used by Mexicans since 1821, the year when it was originally designed. "}, {"url": "http://www.aztec-history.com/mexican-flag-history.html", "passage_text": "Today the coat of arms is in the centre of the flag, showing an eagle eating a rattlesnake perched on the nopal (prickly pear) cactus. Underneath is a garland. On the left the garland is green oak, a symbol of strength. On the right is a laurel branch, symbolizing victory. Current meaning. At the end of the Mexican flag history, certain symbols and meanings were agreed upon. The new meanings of the colours are fairly recent: Green is hope, white is unity, and red is the blood of heroes. These meanings are not enforced by law, so they may continue to change."}]