[{"url": "http://davesgarden.com/guides/articles/view/3940/", "passage_text": "There is, however, a sumac that should be avoided at all costs: Toxicodendron vernix, better known as poison sumac. Poison sumac is one of a trio of plants (poison ivy, poison sumac, and poison oak) that produce an oil called urushiol, which is a potent allergen."}, {"url": "http://askanaturalist.com/how-do-you-identify-poison-sumac/", "passage_text": "The Short Answer: Poison sumac is a large shrub or small tree found in wet areas. It has compound leaves with 7-13 smooth-edged leaflets, as shown in figure 1. The stalk of the compound leaf is reddish. To differentiate poison sumac from other common sumacs, count the number of leaflets."}, {"url": "http://homeguides.sfgate.com/can-nonpoison-sumac-trees-cause-rash-97148.html", "passage_text": "Identifying non-poisonous sumac plants is simple if you’re aware of a few key features that differentiate them from poison sumac. For example, non-poisonous sumac has green leaf stems while poison sumac’s leaf stems are bright red. In non-poisonous sumacs, the drupes, or fruits, have hairs and are red to crimson."}, {"url": "http://www.carolinanature.com/trees/tove.html", "passage_text": "Poison Sumac is a small tree or large shrub with large attractive leaves and white fruits that could be used as an ornamental if it didn't cause severe skin irritation in most people. Its smaller relatives with 3-parted leaves, Poison Ivy and Poison Oak, have similar irritating properties."}, {"url": "http://www.webmd.com/skin-problems-and-treatments/tc/poison-ivy-oak-or-sumac-topic-overview", "passage_text": "Poison ivy, oak, and sumac are plants that can cause a red, itchy rash called allergic contact dermatitis. It is the most common skin problem caused by contact with plants. The rash is caused by contact with a sticky oil called urushiol (say yoo-ROO-shee-all) found in poison ivy, oak, or sumac. You can get the rash from: 1  Touching or brushing against any part of these plants, including the leaves, stems, flowers, berries, and roots, even if the plant is dead."}, {"url": "http://www.poison-ivy.org/poison-sumac", "passage_text": "Poison Sumac. Poison sumac, Toxicodendron vernix, is related to the poison ivies and poison oaks, not to the other sumacs. It is relatively rare, compared to the other members of the family. The rash-causing agent, urushiol, is the same, and it causes the same rashes."}, {"url": "http://www.wikihow.com/Identify-Poison-Sumac", "passage_text": "Learn the other attributes of the leaf. Poison sumac is deciduous, so the leaves change color throughout the year. Newly grown spring leaves may be bright orange, becoming light green during spring and summer, changing to red during autumn, then falling off the plant entirely."}, {"url": "http://www.poison-ivy.org/poison-sumac", "passage_text": "Poison sumac, Toxicodendron vernix, is related to the poison ivies and poison oaks, not to the other sumacs. It is relatively rare, compared to the other members of the family."}]