[{"url": "https://en.wikipedia.org/wiki/Hilton_Hotels_%26_Resorts", "passage_text": "1 Founded in 1919 by Conrad Hilton. 2  Hilton bought his first property, the Mobley Hotel, in 1919 in Cisco, Texas. 3  The first hotel to bear the Hilton name was the Dallas Hilton, a high-rise that opened in Dallas, Texas in 1925. 1 On 13 February 1978, the Sydney Hilton Hotel was the site of one of the few terrorist incidents on Australian soil, when a bomb blast killed 3 people (2 council workers and a policeman)."}, {"url": "http://www.biography.com/people/conrad-hilton-9339383", "passage_text": "Conrad Hilton was born on December 25, 1887 in San Antonio, New Mexico. He took over his father's general store at the age of 21 and served in the New Mexico State Legislature. After fighting in WWI, Hilton bought the Mobley Hotel in Cisco, TX and grew it into a hotel empire. He formed the Hilton Hotels Corporation in 1946 and expanded his operations outside of the US. He died in 1979."}, {"url": "http://www.woopidoo.com/biography/conrad-hilton/index.htm", "passage_text": "Biography-Information. Conrad Hilton created the Hilton Hotel chain of hotels. Beginning with his first hotel in 1919, Hilton grew his enterprise to a nationwide chain of hotels catering to business travelers. By 2000 there was more than 500 Hilton hotels worldwide"}, {"url": "http://www3.hilton.com/en/about/hilton/history/index.html", "passage_text": "A HISTORY OF FIRSTS. It all started in 1919, when Conrad Hilton bought his first hotel. Since then, we’ve led the industry with our innovative approach to products, amenities and service. Today, Hilton Hotels & Resorts stands as the stylish, forward thinking global leader of hospitality. "}, {"url": "https://en.wikipedia.org/wiki/Hilton_Hotels_%26_Resorts", "passage_text": "1 The first hotel to bear the Hilton name was the Dallas Hilton, a high-rise that opened in Dallas, Texas in 1925. 2  In 1949, at the Caribe Hilton Hotel 's Beachcomber Bar in San Juan, Puerto Rico, Ramon Monchito Marrero created the Pina Piña.  colada 1 On 13 February 1978, the Sydney Hilton Hotel was the site of one of the few terrorist incidents on Australian soil, when a bomb blast killed 3 people (2 council workers and a policeman)."}, {"url": "https://en.wikipedia.org/wiki/Hilton_Hotels_%26_Resorts", "passage_text": "Hilton Hotels & Resorts (formerly known as Hilton Hotels) is an international chain of full service hotels and resorts and the flagship brand of Hilton Worldwide. The original company was founded by Conrad Hilton. As of 2010, there were over 530 Hilton branded hotels across the world in 78 countries across six continents. Hilton hotels are either owned by, managed by, or franchised to independent operators by Hilton Worldwide. 1 On 13 February 1978, the Sydney Hilton Hotel was the site of one of the few terrorist incidents on Australian soil, when a bomb blast killed 3 people (2 council workers and a policeman)."}, {"url": "http://www.hiltonworldwide.com/about/", "passage_text": "History & Heritage. Conrad N. Hilton began with a 40-room hotel in a small Texas town in 1919. Today, Hilton Worldwide is the world's preeminent hospitality company, stretching across 24 time zones. You'll find us in world capitals, rural roadsides, trade centers, vacation destinations, and everywhere in between. "}]