[{"url": "http://www.stanfordchildrens.org/en/topic/default?id=low-birthweight-90-P02382", "passage_text": "Low birthweight is a term used to describe babies who are born weighing less than 2,500 grams (5 pounds, 8 ounces). In contrast, the average newborn weighs about 8 pounds. Over 8 percent of all newborn babies in the United States have low birthweight."}, {"url": "http://www.fortherecordmag.com/archives/ftr_070708p28.shtml", "passage_text": "The coding note under code 765.1 states that prematurity usually implies a birth weight of 1,000 to 2,499 grams. According to the coding note under code 765.0, extreme immaturity usually implies a birth weight of less than 1,000 grams. However, the use of code 765.0 or 765.1 is not based on birth weight."}, {"url": "http://www.babysfirsttest.org/newborn-screening/screening-procedures", "passage_text": "If newborn screening cannot be completed in the home, parents should bring the infant to a hospital or clinic for the newborn screening blood test within a few days of birth. A hearing screen should also be scheduled with the baby’s health care provider at no later than one month of age."}, {"url": "http://newbornwhocc.org/pdf/teaching-aids/2010/Management-of-LBW-ENC9.pdf", "passage_text": "Low birth weight or LBW, as it is abbreviated, denotes birth weight of less than 2500 gm. In India, about 30 percent infants born are LBW. Nearly 75 percent neonatal deaths and 50 percent infant deaths occur among the low birth weight neonates."}, {"url": "http://www.pregnancycorner.com/giving-birth/complications/low-birth-weight.html", "passage_text": "Low Birth Weight Causes. The two main causes for a baby to be born at a low birth weight are premature birth and intrauterine growth restrictions (IUGR). Premature birth is a term for a baby born before 37 weeks of pregnancy. Sixty-seven percent of all low birth weight babies are premature births."}, {"url": "http://www.stanfordchildrens.org/en/topic/default?id=very-low-birthweight-90-P02424", "passage_text": "Very low birthweight is a term used to describe babies who are born weighing less than 1,500 grams (3 pounds, 4 ounces). Only a few babies, 1.5 percent, are born this tiny. However, the overall rate of very low birthweight babies in the U.S. is increasing."}, {"url": "http://www.stanfordchildrens.org/en/topic/default?id=low-birthweight-90-P02382", "passage_text": "Babies are weighed within the first few hours after birth. The weight is compared with the baby's gestational age and recorded in the medical record. A birthweight less than 2,500 grams (5 pounds, 8 ounces) is diagnosed as low birthweight."}]