[{"url": "http://geology.com/rocks/conglomerate.shtml", "passage_text": "Conglomerate is a clastic sedimentary rock that contains large (greater than two millimeters in diameter) rounded clasts. The space between the clasts is generally filled with smaller particles and/or a chemical cement that binds the rock together. Conglomerate can have a variety of compositions."}, {"url": "http://smallbusiness.chron.com/considered-conglomerate-32411.html", "passage_text": "Businesses in a conglomerate are often unrelated and very different from one another in terms of the products or services they offer. The corporation is the parent company and the business enterprises underneath are known as subsidiary companies."}, {"url": "http://whatis.techtarget.com/definition/conglomerate", "passage_text": "Part of the Business terms glossary: A conglomerate is a company that comprises multiple different corporations. The most common type of conglomerate is a parent company with one or more subsidiaries, which are partially or wholly-owned companies. Corporations form conglomerates for a variety of reasons, including: 1  The desire to become involved in a business that is different from the company's main focus."}, {"url": "http://www.investopedia.com/terms/c/conglomerate.asp", "passage_text": "DEFINITION of 'Conglomerate'. A conglomerate is a corporation that is made up of a number of different, seemingly unrelated businesses. In a conglomerate, one company owns a controlling stake in a number of smaller companies, which conduct business separately. Each of a conglomerate's subsidiary businesses runs independently of the other business divisions, but the subsidiaries' management reports to senior management at the parent company."}, {"url": "http://www.investopedia.com/terms/c/conglomerate.asp", "passage_text": "A conglomerate is a corporation that is made up of a number of different, seemingly unrelated businesses. In a conglomerate, one company owns a controlling stake in a number of smaller companies, which conduct business separately. Each of a conglomerate's subsidiary businesses runs independently of the other business divisions, but the subsidiaries' management reports to senior management at the parent company."}]