[{"url": "http://www.gingersoftware.com/content/grammar-rules/adjectives/compound-adjectives/", "passage_text": "Compound adjectives – Exceptions. Note that combining an adverb and an adjective does not create a compound adjective. No hyphen is required because it is already clear that the adverb modifies the adjective rather than the subsequent noun. For example: 1  It was a terribly hot day. 2  It is an amazingly good idea. A compound adjective is formed when two or more adjectives are joined together to modify the same noun. These terms should be hyphenated to avoid confusion or ambiguity. For example: 1  Diana submitted a 6-page document. 2  She adopted a two-year-old cat."}, {"url": "http://www.merriam-webster.com/dictionary/common%20adjective", "passage_text": "Definition of COMMON ADJECTIVE. : a descriptive adjective that is not a proper adjective. ADVERTISEMENT. This word doesn't usually appear in our free dictionary, but the definition from our premium Unabridged Dictionary is offered here on a limited basis. Note that some information is displayed differently in the Unabridged."}, {"url": "http://www.momswhothink.com/reading/list-of-adjectives.html", "passage_text": "Get just the list of 1,100 adjectives. Read on for the grammatical rules of English regarding adjective usage including examples of the different types used. The list of adjectives is something of wonder. Behold the modest adjective. It can leap tall buildings in a single bound. "}, {"url": "http://englishgenie.com/vocabulary/the-top-100-most-common-adjectives/", "passage_text": "The Top 100 Most Common Adjectives. This is a selection of the 100 most common adjectives in modern American English. It was adapted from the Corpus of Contemporary American English (COCA), an extensive body of 450,000,000 words. "}, {"url": "https://www.myqbook.com/GrammarConcept/41/Article-Adjectives", "passage_text": "Article Adjectives. A special type of adjective is called an article adjective. There are three articles: a, an and the. (However, since an is just another form of a, technically speaking, there are only two unique articles). "}, {"url": "http://dictionary.cambridge.org/us/dictionary/learner-english/common_1", "passage_text": "Definition of “common” - Learner’s Dictionary. USUAL B1 happening often or existing in large numbers: Injuries are common in sports such as hockey. "}, {"url": "http://linguapress.com/grammar/adjectives.htm", "passage_text": "Adjectives that are in the comparative form can be modified by intensifiers such as much, far and sometimes by adverbs of degree (examples 8). Some kinds of adjectives, notably participles, can be modified by a wide range of adverbs (examples 9 and 10). This is the most common use of adjectives, standing next to a noun in a noun phrase. In English, simple and complex adjectives almost always come before the noun. There are only a very small number of exceptions, For details on the ordering of adjectives within a noun group, see adjective order."}, {"url": "http://www.merriam-webster.com/dictionary/common", "passage_text": "Examples of COMMON. 1  They have a common ancestor. 2  The people on the island have a sense of common identity. 3  It is common practice for one town's fire department to help another town when there is a big fire. 4  Electric windows are a common feature in new cars. “ 5  Smith ” is a common name. "}]