[{"url": "http://english.stackexchange.com/questions/112553/what-is-plaice-in-the-us-would-love-a-good-fish-and-chips", "passage_text": "Plaice is one variety of flatfish, related to sole, halibut, and flounder. It is not commercially available in the US so its name is rarely heard there. In the US, when you find 'fish and chips' (purely a British cultural import) is usually made with cod, whitefish, or haddock, the same is in the UK. I live in the northeast US and I had never heard of plaice before this question. If I get fish and chips at all, it's probably in the summer when visiting Cape Cod, and one of the fish types listed here is used, like cod or haddock."}, {"url": "http://www.thefreedictionary.com/plaice", "passage_text": "plaice. n, pl plaice or plaices. 1. (Animals) a European flatfish, Pleuronectes platessa, having an oval brown body marked with red or orange spots and valued as a food fish: family Pleuronectidae. 2. (Animals) US and Canadian any of various other fishes of the family Pleuronectidae, esp Hippoglossoides platessoides. n. pl. plaice or plaic·es. 1. A large edible marine flatfish (Pleuronectes platessa) of European coastal waters. 2. Any of various other flatfishes, such as Hippoglossoides platessoides of northern Atlantic"}, {"url": "http://www.collinsdictionary.com/dictionary/english/plaice", "passage_text": "Word forms: plural plaice or plaices. 1  a European flatfish, Pleuronectes platessa, having an oval brown body marked with red or orange spots and valued as a food fish: family Pleuronectidae. ( 2 US & and Canadian) any of various other fishes of the family Pleuronectidae, esp Hippoglossoides platessoides. 1"}, {"url": "https://en.wikipedia.org/wiki/European_plaice", "passage_text": "The geographical range of the European plaice is off all coasts from the Barents Sea to the Mediterranean, also in the Northeast Atlantic and off Greenland. Plaice are determinate spawners in which fecundity is determined before the onset of spawning. Females mature, i.e. are able to spawn, at ages from 3 to 7 years. However, in the North Sea, most females mature at 3 years."}, {"url": "http://www.greatbritishchefs.com/ingredients/plaice-recipes", "passage_text": "Sign Out Profile/Binder. Plaice is a striking flat fish speckled with distinctive orange spots, available to buy for most of the year but particularly succulent from summer to mid winter. Its spots are often used as an indication of freshness-the brighter the orange, the fresher the fish is likely to be. "}, {"url": "https://en.wikipedia.org/wiki/Plaice", "passage_text": "The scale-eye plaice is a flatfish of the family Pleuronectidae. It is a demersal fish that lives at depths from between 18 metres (59 ft) to 900 metres (3,000 ft). It can reach 46 centimetres (18 in) in length and can weigh up to 1.2 kilograms (2.6 lb). Also commercially important is the American plaice. The term plaice (plural plaice) comes from the 14th century Anglo-French plais. This in turn comes from the late Latin platessa, meaning flatfish, which originated from the Greek platys, meaning broad."}, {"url": "https://en.wikipedia.org/wiki/Plaice", "passage_text": "Like the European plaice, the American plaice is also a right eyed flatfish belonging to the Pleuronectidae family. American plaice are an Atlantic species. They range from southern Labrador to Rhode Island. They are also found in Europe, where they are called the rough dab or the long rough dab. Also commercially important is the American plaice. The term plaice (plural plaice) comes from the 14th century Anglo-French plais. This in turn comes from the late Latin platessa, meaning flatfish, which originated from the Greek platys, meaning broad."}, {"url": "https://en.wikipedia.org/wiki/Plaice", "passage_text": "The European plaice (Pleuronectes platessa) is a right-eyed flounder belonging to the Pleuronectidae family. They are a commercially important flatfish which lives on the sandy bottoms of the European shelf. They range geographically from the Barents Sea to the Mediterranean. Also commercially important is the American plaice. The term plaice (plural plaice) comes from the 14th century Anglo-French plais. This in turn comes from the late Latin platessa, meaning flatfish, which originated from the Greek platys, meaning broad."}, {"url": "https://en.wikipedia.org/wiki/European_plaice", "passage_text": "The European plaice (Pleuronectes platessa) is a commercially important flatfish. Plaice are determinate spawners in which fecundity is determined before the onset of spawning. Females mature, i.e. are able to spawn, at ages from 3 to 7 years. However, in the North Sea, most females mature at 3 years."}, {"url": "http://english.stackexchange.com/questions/112553/what-is-plaice-in-the-us-would-love-a-good-fish-and-chips", "passage_text": "Try looking it up in Wikipedia. Plaice, Pleuronectes platessa, is a European fish that is related to an American fish of the same family, which they've overfished. Many nations have different names for the same fish, though some are only related species. I live in the northeast US and I had never heard of plaice before this question. If I get fish and chips at all, it's probably in the summer when visiting Cape Cod, and one of the fish types listed here is used, like cod or haddock."}]