[{"url": "http://www.arkive.org/curlyhair-tarantula/brachypelma-albopilosum/", "passage_text": "Receptive females will allow a male to mate, usually during the rainy season, resulting in the making of an egg sac and the laying of 300 to 500 eggs several weeks later. The egg sac is incubated for about seven to eight weeks at 24 to 27 degrees Celsius, after which pale-coloured young emerge and cluster together. The curlyhair tarantula is a plump-bodied spider, covered with dark brown to black hair. It has a golden-bronze sheen due to longer gold hairs that cover the whole body, which are particularly dense on the hind legs. Males are often a lighter bronze colour than females"}, {"url": "http://cocorion.tripod.com/curlyhair.htm", "passage_text": "The curly-haired tarantula is considered a beginner's tarantula, and is known for its gentle nature. They are first world tarantulas, which means that they have the ability to kick urticating hairs from their abdomen when provoked, which get lodged in the skin and irritate it. Curly-haired Tarantula Brachypelma albopilosum. H o m e-P h o t o A l b u m-I n t e r e s t i n g A n e c d o t e s-E m a i l m e-L i n k s. (This is Mammoth, my curly-haired. I haven't sexed it yet, but I obviously hope that she is female-they have a longer life span.)."}, {"url": "http://www.tarantulaguide.com/tarantulas/honduran-curly-hair-tarantula/", "passage_text": "In the wild, the Honduran Curly Hair tarantula is found in the rain forests of Costa Rica and Honduras. It has a leg span of 4 ½ to 5 ½ inches. They have a bronze colored body that is covered with short curly hairs. The spider is a very common pet tarantula. It is easily available from your local pet store. Due to their hardy and docile nature they make a great pet for the beginning collector."}, {"url": "http://www.petbugs.com/caresheets/B-albopilosum.html", "passage_text": "The Curlyhair Tarantula is an ideal tarantula species for a beginner because of it's docile temperament and relatively large size. Although fairly common and easy on the pocket, this species is more than just a brown tarantula. Up close, Curlyhair Tarantulas have gold and tan hairs covering their bodies. "}, {"url": "https://en.wikipedia.org/wiki/Brachypelma_albopilosum", "passage_text": "The Curlyhair tarantula is a plump-bodied spider, covered with dark brown to black hair. It has a golden-bronze sheen due to longer gold hairs that cover the whole body, which are particularly dense on the hind legs. Receptive females will allow a male to mate, usually during the rainy season, resulting in the making of an egg sac and the laying of 300 to 500 eggs several weeks later. The egg sac is incubated for about seven to eight weeks at 24 to 27 degrees Celsius, after which pale-colored young emerge and cluster together."}, {"url": "http://insects.about.com/od/spiders/a/10-facts-about-tarantulas.htm", "passage_text": "1. Female tarantulas can live 30 years or longer in the wild. Female tarantulas are famously long-lived. Even in captivity, they've been known to live for over 20 years. Males, on the other hand, don't make it much beyond reaching sexual maturity, with a life span of just 5-10 years on average. 8. Though tarantulas don't spin webs, they do use silk. Like all spiders, tarantulas produce silk, and they put this resource to use in clever ways. Females use silk to decorate the interiors of their burrows, which is thought to strengthen the earthen walls."}, {"url": "http://www.lllreptile.com/info/library/animal-care-sheets/invertebrates/-/rose-hair-tarantula/", "passage_text": "Size and Longevity. Rose hair tarantulas are a fairly slow growing species, taking up to 4 years to reach maturity. Adults will range in size, but the average leg span is 4 to 5 inches, with the occasional female getting slightly larger. Rose hairs are among the most docile and even-tempered of all tarantula species. However, as with any tarantula, it should be remembered that rose hairs are venomous, even if only slightly so. Most humans suffer no systemic effects from a rose hair bite, instead experiencing localized pain, itching, and burning."}, {"url": "https://en.wikipedia.org/wiki/Brachypelma_albopilosum", "passage_text": "Description [edit]. The Curlyhair tarantula is a plump-bodied spider, covered with dark brown to black hair. It has a golden-bronze sheen due to longer gold hairs that cover the whole body, which are particularly dense on the hind legs. Males are often a lighter bronze color than females. Receptive females will allow a male to mate, usually during the rainy season, resulting in the making of an egg sac and the laying of 300 to 500 eggs several weeks later. The egg sac is incubated for about seven to eight weeks at 24 to 27 degrees Celsius, after which pale-colored young emerge and cluster together."}, {"url": "https://en.wikipedia.org/wiki/Brachypelma_albopilosum", "passage_text": "Brachypelma albopilosum is a species of tarantula known commonly as the Honduran curlyhair or simply Curlyhair tarantula. Its native range includes Central America, from Honduras to Costa Rica. They are terrestrial, opportunistic burrowing spiders. Receptive females will allow a male to mate, usually during the rainy season, resulting in the making of an egg sac and the laying of 300 to 500 eggs several weeks later. The egg sac is incubated for about seven to eight weeks at 24 to 27 degrees Celsius, after which pale-colored young emerge and cluster together."}]