[{"url": "https://answers.yahoo.com/question/index?qid=20080422201446AA0GDvf", "passage_text": "Uncooked ground/patties can be pan fried or baked. Make your sausage patties approximately ½ inch thick. Pan Fry-Place on a preheated greased skillet on Medium heat. Cover and cook 5-7 minutes, and turn patty over. Continue cooking another 5-7 minutes, or until juices run clear. Bake – Place your ½ inch thick patties onto an un-greased cookie sheet. Preheat oven to 400º F. Bake for 15-18 minutes, or until juices run clear. "}, {"url": "http://www.jamieshomecookingskills.com/recipe.php?title=how-to-cook-sausages-in-a-frying-pan-or-on-a-gridd", "passage_text": "How to cook your sausages. Put your pan or griddle on a medium heat. Cut the sausages between the links so they re all separate. Make sure you re only cooking as many sausages as you have room for in the pan or griddle they shouldn t be touching each other cook them in batches if necessary. Add the sausages to the pan or the griddle and cook, turning every minute or two, for about 12 minutes, or until nice and brown on all sides. Before serving, check the sausages are piping hot all the way through and that no pink remains."}, {"url": "http://www.johnsonville.com/products/mild-italian-links.html", "passage_text": "Skillet. 1  Spray a skillet with cooking spray. 2  Add sausage. 3  Cook over medium-high heat until browned, about 5 minutes, turning links often. 4  Reduce heat to medium-low. 5  Carefully add ½ cup water to skillet. 6  Cover and simmer for 12 minutes or until cooked through. 1"}, {"url": "http://www.colosimosausage.com/HowtoCookSausages/tabid/1155/language/en-US/Default.aspx", "passage_text": "SKILLET. Heat a pan to medium temperature. Add 3 tablespoons water and place links in a pan. Cover the pan, continue heating for 10-12 minutes, turning the links often. Remove cover and continue cooking for 15-17 minutes or until golden brown. You can even brown it up on your grill. "}, {"url": "http://www.jamieshomecookingskills.com/recipe.php?title=how-to-cook-sausages-in-a-frying-pan-or-on-a-gridd", "passage_text": "How to cook your sausages. If using a frying pan, add a tiny drizzle of olive oil just to get things started. Add the sausages to the pan or the griddle and cook, turning every minute or two, for about 12 minutes, or until nice and brown on all sides. Before serving, check the sausages are piping hot all the way through and that no pink remains."}, {"url": "http://www.hot-dog.org/sausage-basics/tips-cooking-linked-sausage", "passage_text": "This can be done in a variety of ways. To steam precooked sausage, bring a pan of water or beer to a boil. Remove the pan from heat and add sausage. Cover the pan and let it stand 10-15 minutes. It is not advisable to add sausages to vigorously boiling water because it may cause them to split. Fresh Sausage. To parboil, place sausage links in a heavy skillet. Add water to cover sausage and par-boil until sausage is grey throughout (about 10 to 15 minutes.) The sausage then can be fried until nicely browned."}, {"url": "http://www.wikihow.com/Cook-Italian-Sausage", "passage_text": "Place the baking sheet on the middle rack of the oven to ensure even cooking. Bake for 20 to 25 minutes. 1  Note that thicker sausages may need to bake longer. 2  Extremely large or thick links may need to be baked anywhere from 40 to 60 minutes. 3  If cooking them this long, however, you should turn the sausages at least once. "}, {"url": "http://www.taste.com.au/news+features/articles/6039/snag+yourself+a+hit+how+to+cook+sausages+by+matt+preston", "passage_text": "One way is to gently poach sausages in a small amount of water to cook them through before browning them in a pan or on the barbecue. To do this, place sausages in a pan with about half a centimetre of water and bring it to the boil. "}, {"url": "http://www.beefandlamb.com.au/How_to/Cooking_beef_and_lamb/Preparation_tips/How_to_cook_sausages_just_perfectly", "passage_text": "1 Place a sheet of baking paper on oven tray. 2  Cut the sausage links and place the sausages over the baking paper, use a large enough oven tray so that it allows some room around each of the sausages. 3  Place sausages in oven and roast for 15 minutes or until cooked. 1 Cut the sausage links and place the sausages over the baking paper, use a large enough oven tray so that it allows some room around each of the sausages. 2  Place sausages in oven and roast for 15 minutes or until cooked. 3  Shake the oven tray from time to time to turn the sausages so they brown evenly."}]