[{"url": "http://www.wisegeek.org/what-are-chemical-reactions.htm", "passage_text": "Chemical reactions occur whenever bonds are formed or broken between molecules. Why certain atoms combine with which other atoms is a complex question which is explained exhaustively by quantum chemistry. The simple version is that atoms bond together electromagnetically based on the properties of their electron shells."}, {"url": "https://www.shodor.org/UNChem/basic/chemreac/index.html", "passage_text": "A chemical reaction is a process in which the identity of at least one substance changes. A chemical equation represents the total chemical change that occurs in a chemical reaction using symbols and chemical formulas for the substances involved."}, {"url": "http://www.middleschoolchemistry.com/lessonplans/chapter6/lesson1", "passage_text": "1 A physical change, such as a state change or dissolving, does not create a new substance, but a chemical change does. 2  In a chemical reaction, the atoms and molecules that interact with each other are called reactants. 3  In a chemical reaction, the atoms and molecules produced by the reaction are called products."}, {"url": "http://www.wisegeek.org/what-are-chemical-reactions.htm", "passage_text": "Scientists combine substances to cause chemical reactions. Oxygen combines with iron in a chemical reaction to form iron oxide, which is more commonly known as rust. Chemists may perform chemical reactions. Numerous scientific advancements occur when there is an understanding of chemistry."}, {"url": "http://www.answers.com/Q/What_is_a_chemical_reaction", "passage_text": "A chemical reaction occurs when one or more chemicals react to become different chemicals. A chemical reaction is characterized by the re-arrangement of atoms from the reactant side of the equation to the product side. It's a bit like square dancing because at any given time you may have a different partner than when you started but no matter how you re-arrange the dancers, you always have the same people."}, {"url": "http://www.thefreedictionary.com/chemical+reaction", "passage_text": "chemical reaction - (chemistry) a process in which one or more substances are changed into others; there was a chemical reaction of the lime with the ground water."}, {"url": "https://en.wikipedia.org/wiki/Chemical_reaction", "passage_text": "The substance (or substances) initially involved in a chemical reaction are called reactants or reagents. Chemical reactions are usually characterized by a chemical change, and they yield one or more products, which usually have properties different from the reactants."}, {"url": "http://www.middleschoolchemistry.com/lessonplans/chapter6/lesson1", "passage_text": "1 In a chemical reaction, the atoms and molecules produced by the reaction are called products. 2  In a chemical reaction, only the atoms present in the reactants can end up in the products. 3  No new atoms are created, and no atoms are destroyed."}, {"url": "http://www.chemistryforkids.net/reactions", "passage_text": "A chemical reaction produces a chemical change as atoms are rearranged resulting in the production of one or more new substances. In all chemical reaction there is a conservation of mass. Atoms are neither created nor destroyed. Chemical reactions are generally difficult to reverse. eg."}]