[{"url": "http://www.remodelingexpense.com/services/cost-to-paint-an-exterior-door/", "passage_text": "The Cost to Paint an Exterior Door estimator will provide you with up to date pricing for your area. Simply enter your zip code and the square footage, next click update and you will see a breakdown on how much it Cost to Paint an Exterior Door at your home. If you’re looking for 2014 breakdown Cost to Paint an Exterior Door with materials, and how much a contractor might be, you’ve come to the right place. As an experienced licensed home improvement contractor, I know first hand what it should cost for various levels — from Basic, Better, and of course the best"}, {"url": "http://www.remodelingexpense.com/services/cost-to-paint-a-front-door/", "passage_text": "If you’re looking for 2014 breakdown Cost to Paint a Front Door with materials, and how much a contractor might be, you’ve come to the right place. As an experienced licensed home improvement contractor, I know first hand what it should cost for various levels — from Basic, Better, and of course the best. The Cost to Paint a Front Door estimator will provide you with up to date pricing for your area. Simply enter your zip code and the square footage, next click update and you will see a breakdown on how much it Cost to Paint a Front Door at your home. Note* To use the calculator – simply add the width and length of your cabinet to get the square footage. For example: 10′ foot by 10′ foot area equals 100 square feet."}, {"url": "http://www.homewyse.com/services/cost_to_paint_entry_door.html", "passage_text": "Time for carefully masking or removing/reinstalling hardware not to be painted is also included. For a basic 1 painting project in zip code 47474, the benchmark cost to Paint an Entry Door ranges between $95.51 - $199.49 per painting. To estimate costs for your project: 1. Set Project Zip Code Enter the Zip Code for the location where labor is hired and materials purchased. 1 Costs for testing and remediation of hazardous materials (asbestos, lead, etc). 2  General contractor overhead and markup for organizing and supervising the Entry Door Painting. 3  Add 15% to 23% to the total cost above if a general contractor will supervise this project."}, {"url": "http://www.homeadvisor.com/cost/painting/paint-a-home-exterior/", "passage_text": "Holes, missing pieces or other problems will increase the overall cost of the painting project. You can expect to pay between $700 (~250 sq. ft.) and $2,000 (~1,000 sq. ft.) to paint wood siding, but this project will also help to protect the home's exterior from more extensive repairs down the road. If you choose high-quality paint that costs around $70, your total paint cost could be closer to $840. Professionals also recommend that you add an extra 10 or 20 percent to your total square footage, depending on the type of siding you have."}, {"url": "http://www.homeadvisor.com/cost/painting/paint-a-small-project/", "passage_text": "The average national cost to paint a small project is $628, with most homeowners spending between $353 and $908. This data is based on actual project costs as reported by HomeAdvisor members. Painting an entire home -- or even an entire room -- can be an extensive and expensive undertaking. The average cost to repaint kitchen cabinets is about $1,000, depending on the number of cabinets you have to paint and the time and labor required to do so. The materials used to paint the kitchen cabinets -- brushes, primer, paint, sanding equipment -- will cost up to $200 if you decide to buy them yourself."}, {"url": "http://www.homeadvisor.com/cost/painting/paint-a-small-project/", "passage_text": "The average cost to paint a front door ranges from $100 - $300 per door. 1  Paint the door while it's still in the frame and on its hinge, or it might not fit back into place when you're finished. 2  You can also paint both sides more easily by leaving it on the hinges. The average cost to repaint kitchen cabinets is about $1,000, depending on the number of cabinets you have to paint and the time and labor required to do so. The materials used to paint the kitchen cabinets -- brushes, primer, paint, sanding equipment -- will cost up to $200 if you decide to buy them yourself."}]