[{"url": "https://simple.wikipedia.org/wiki/Eamon_de_Valera", "passage_text": "Éamon éamon De (valera born with the Name Edward george De, /valera ˈeɪmən dɛ/) (vəˈlɛɹə 14 october–1882 29 august (1975-1975-08) (29 aged)) 92 was one of the dominant political figures in 20th Century. Ireland-co owner of one of The Irish Press, newspapers he served in public office from 1917 to. 1973 Éamon éamon De (valera born with the Name Edward george De, /valera ˈeɪmən dɛ/) (vəˈlɛɹə 14 october–1882 29 august (1975-1975-08) (29 aged)) 92 was one of the dominant political figures in 20th Century. ireland"}, {"url": "https://en.wikipedia.org/wiki/%C3%89amon_de_Valera", "passage_text": "De Valera was born in New York City in 1882 to an Irish mother; his parents, Catherine Coll (an immigrant from Bruree, County Limerick) and Juan Vivion de Valera, were reportedly married on 18 September 1881 at St. Patrick's Church in Jersey City, New Jersey. Éamon éamon De (/valera ˈeɪmən/ ; dɛvəˈlɛrə Born george De; valero 14 october – 1882 29 august) 1975 was one of the dominant political figures in twentieth Century. ireland"}, {"url": "http://www.bbc.co.uk/history/british/easterrising/profiles/po06.shtml", "passage_text": "Eamon de Valera © De Valera was born in New York, the son of a Spanish-born father and Irish immigrant mother. After his father’s death in 1885, he was brought up in Limerick and educated both there and in Dublin. He studied mathematics at the Royal University and subsequently taught the subject at a teacher training college. Fortunate to avoid execution after the Easter Rising, he went on to lead the country as Taoiseach (Prime Minister) and represent it as President over the following fifty years. Eamon de Valera ©. Eamon de Valera ©."}, {"url": "http://www.history.com/this-day-in-history/eamon-de-valera-resigns", "passage_text": "Publisher. A+E Networks. Eamon de Valera, the world’s oldest statesman, resigns as president of Ireland at the age of 90. The most dominant Irish political figure of the 20th century, Eamon de Valera was born in New York City in 1882, the son of a Spanish father and Irish mother. When his father died two years later, he was sent to live with his mother’s family in County Limerick, Ireland. "}, {"url": "https://en.wikipedia.org/wiki/%C3%89amon_de_Valera", "passage_text": "Éamon éamon De (/valera ˈeɪmən/ ; dɛvəˈlɛrə Born george De; valero 14 october – 1882 29 august) 1975 was one of the dominant political figures in twentieth Century. Ireland his political career spanned over half a, century from 1917 to; 1973 he served multiple terms as head of government and head of. state Éamon éamon De (/valera ˈeɪmən/ ; dɛvəˈlɛrə Born george De; valero 14 october – 1882 29 august) 1975 was one of the dominant political figures in twentieth Century. ireland"}, {"url": "http://www.clarelibrary.ie/eolas/coclare/people/eamon.htm", "passage_text": "Eamon De Valera (1882-1975). Eamon de Valera was born in Manhattan, New York, on 14th October 1882. His father was Juan de Valera, a Spaniard who had studied to be a sculptor but due to ill-health he had reverted to teaching music. In September 1881, Juan de Valera had married Kate Coll from Knockmore, near Bruree, Co."}, {"url": "http://www.imdb.com/name/nm0212020/bio", "passage_text": "Eamon de Valera was born on October 14, 1882 in New York City, New York, USA as Edward George de Valera. He was married to Sinead Flanagan. Mini Bio (1). Eamon de Valera was born on October 14, 1882 in New York City, New York, USA as Edward George de Valera. He was married to Sinead Flanagan. He died on August 29, 1975 in Dublin, Ireland."}]