[{"url": "http://dd.dgacm.org/editorialmanual/ed-guidelines/footnotes/footnotes_chap_09.htm", "passage_text": "Every footnote has a corresponding footnote indicator—a number, lower-case letter or asterisk or other symbol—typed in superscript in the text. Indicators in documents and publications. In documents and publications, numbered footnotes are used in the main body of the text. Placement of symbols. Asterisks and other symbols are placed after the elements to which they relate in the same way as footnote numbers and lower-case letters. The footnotes are normally placed at the bottom of the page."}, {"url": "http://www.computerhope.com/jargon/a/asterisk.htm", "passage_text": "Asterisk. Sometimes referred to as the star, big dot, and the multiplication symbol, the asterisk is a symbol (*) commonly found above the 8 key on standard United States keyboards and on the number pad. Below are examples of how the asterisk is used on a computer. "}, {"url": "https://en.wikipedia.org/wiki/Asterisk", "passage_text": "The asterisk is derived from the need of the printers of family trees in feudal times for a symbol to indicate date of birth. Computer scientists and mathematicians often vocalize it as star (as, for example, in the A* search algorithm or C*-algebra). In English, an asterisk is usually five-pointed in sans-serif typefaces, six-pointed in serif typefaces, and six-or eight-pointed when handwritten."}, {"url": "https://answers.yahoo.com/question/index?qid=20080527061547AAuTnbD", "passage_text": "Rating Newest Oldest. Best Answer: I would say the asterisk works as a symbol, but not just for equations. I wouldn't call it a sentence grammar object, although you will see it in sentences, for instance to designate a footnote or endnote, as pointed out above. The asterisk is also used a lot in informal internet or text message communication to show an action without writing a sentence about it, e.g."}, {"url": "https://en.wikipedia.org/wiki/Asterix", "passage_text": "The name Asterix, French Asterix, astérix comes from, asterisque  astérisque , meaning asterisk which is the * typographical symbol indicating, a footnote From the greek (word), αστήρ aster meaning). A star his name is usually left unchanged, in translations aside from accents and the use of. local alphabets The ix ending of both names (as well as all the other pseudo-Gaulish ix names in the series) alludes to the rix suffix (meaning king) present in the names of many real Gaulish chieftains such as Vercingetorix, Orgetorix, and Dumnorix."}, {"url": "https://en.wikipedia.org/wiki/Asterix", "passage_text": "1 In 1991, Asterix and Obelix appeared on the cover of Time for a special edition about France, art directed by Mirko Ilic. 2  In a 2009 issue of the same magazine, Asterix is described as being seen by some as a symbol for France's independence and defiance of globalisation. The ix ending of both names (as well as all the other pseudo-Gaulish ix names in the series) alludes to the rix suffix (meaning king) present in the names of many real Gaulish chieftains such as Vercingetorix, Orgetorix, and Dumnorix."}, {"url": "https://en.wikipedia.org/wiki/Asterisk", "passage_text": "1 In the Geneva Bible and the King James Bible, an asterisk is used to indicate a marginal comment or scripture reference. 2  In the Leeser Bible, an asterisk is used to mark off the seven subdivisions of the weekly Torah portion. 3  It is also used to mark the few verses to be repeated by the reader of the Haftara. Computer scientists and mathematicians often vocalize it as star (as, for example, in the A* search algorithm or C*-algebra). In English, an asterisk is usually five-pointed in sans-serif typefaces, six-pointed in serif typefaces, and six-or eight-pointed when handwritten."}, {"url": "http://www.theasciicode.com.ar/ascii-printable-characters/asterisk-ascii-code-42.html", "passage_text": "To get the letter, character, sign or symbol * : (Asterisk) on computers with Windows operating system: 1) Press the Alt key on your keyboard, and do not let go. 2) While keep press Alt, on your keyboard type the number 42, which is the number of the letter or symbol * in ASCII table. "}, {"url": "https://en.wikipedia.org/wiki/Asterix", "passage_text": "The Asterix series is one of the most popular Franco-Belgian comics in the world, with the series being translated into over 100 languages, and it is popular in most European countries. The success of the series has led to the adaptation of several books into 13 films: nine animated, and four live action. The ix ending of both names (as well as all the other pseudo-Gaulish ix names in the series) alludes to the rix suffix (meaning king) present in the names of many real Gaulish chieftains such as Vercingetorix, Orgetorix, and Dumnorix."}, {"url": "http://www.merriam-webster.com/dictionary/asterisk", "passage_text": "Full Definition of ASTERISK. : the character * used in printing or writing as a reference mark, as an indication of the omission of letters or words, to denote a hypothetical or unattested linguistic form, or for various arbitrary meanings. — as·ter·isk·less \\-ləs\\ adjective. "}]