[{"url": "http://www.snagajob.com/job-descriptions/lifeguard/", "passage_text": "Education requirements. A high school diploma or GED is typically not required for most lifeguard jobs. You will probably need some sort of certification, however, from the Red Cross or another training program. Lots of employers require lifeguards to pass a certification test. Career paths for lifeguards. Most people who work guarding lives don't do it for the outrageous career growth prospects. Lifeguarding is a solid summer job, though it can lead to year-round work at an indoor pool. If you're looking to get into a job in parks and recreation, though, this could be your stepping stone."}, {"url": "http://www.lacountylifeguards.org/lifeguardrequirements.html", "passage_text": "Lifeguard Requirements. To be a lifeguard, you have to have not just the will to be a part of a safety force. Lifeguard requirements necessitate that you have a high level of aptitude in the various skills needed to patrol and keep safe the beaches and often physically demanding bodies of water such as the open ocean. The first and primary skill of a lifeguard is the ability to swim. Drowning is obviously the chief concern when it comes to keeping people safe near or in the water. In order to be a source of aid, safety personnel must be able to cope with the demands presented by their environment."}, {"url": "http://www.lacountylifeguards.org/lifeguardrequirements.html", "passage_text": "This means that one not only has a high level of skill as a swimmer, but is fit to be able to do so for long periods. One of the other major lifeguard requirements is specific education courses. This includes being knowledgeable in first-aid techniques. The first and primary skill of a lifeguard is the ability to swim. Drowning is obviously the chief concern when it comes to keeping people safe near or in the water. In order to be a source of aid, safety personnel must be able to cope with the demands presented by their environment."}, {"url": "http://www.moneycrashers.com/become-lifeguard-training-certification/", "passage_text": "To pass the course and become a certified lifeguard, you must attend all the classes and perform all the skills correctly. Periodically, you will be required to take a written exam, and on the very last day you will perform a number of skills scenarios. Instructors should give you a general syllabus before you begin the class, but always bring your swimsuit, a towel, and a change of clothes to be prepared. During a lifeguard course you will learn to: 1  Identify and prevent common land-based emergencies. 2  Avoid distractions."}, {"url": "http://www.snagajob.com/job-descriptions/lifeguard/", "passage_text": "Typically about 40 percent of all recreational workers work part time. Being a lifeguard means you're trusted with the lives of others, so you'll need to be extremely responsible, attentive, and patient (No running! Slow down!). You'll be rewarded for your hard work with cases of Fla-Vor-Ice pops, microwave snack-bar pizza and a shiny whistle, which is awesome. Career paths for lifeguards. Most people who work guarding lives don't do it for the outrageous career growth prospects. Lifeguarding is a solid summer job, though it can lead to year-round work at an indoor pool. If you're looking to get into a job in parks and recreation, though, this could be your stepping stone."}, {"url": "http://www.answers.com/Q/What_do_you_need_to_become_a_lifeguard", "passage_text": "In order to become a lifeguard you must go through a 2 week class (depending on your instructor can be shorter). In this class they will teach you the fundamentals to life guarding and other rescue skills including such below. There are also several swimming portions throughout the class. "}, {"url": "http://www.answers.com/Q/What_kind_of_education_do_you_need_to_be_a_lifeguard", "passage_text": "To become a lifeguard you need at least a+ to become a lifeguard. 1 person found this useful. Edit. Share to: 1  A Brief Overview of Special Needs Education If you have a child with a disability who will head to school soon, you are probably wondering what school will be like for them. The best place to find out what education is required for the position would be on the applicaion itself, in the job posting, or contact a hiring manager. Employers usually post what type of education is required for the position on the job posting or on the application."}, {"url": "http://www.educationrequirements.org/lifeguard.html", "passage_text": "Lifeguard Education Requirements. A lifeguard, as the name suggests, is a professional who is responsible for guarding the people and their lives against potential dangers included in a particular activity like swimming, rafting, or other adventure sports activities. 1 To apply for the job of a lifeguard, one needs pass the high school diploma. 2  After completing the high school, the aspiring life guards can opt for higher education and associate & bachelor level degrees associated with the lifeguard’s profile."}, {"url": "http://study.com/articles/How_to_Become_a_Certified_Lifeguard_Education_and_Career_Roadmap.html", "passage_text": "Swimming is an essential part of being a lifeguard, and taking lessons is one way for you to become comfortable in the water. As you progress in your swim lessons, you'll learn about the different swimming strokes, breathing techniques, and water safety. Swimming lessons are available for children of all ages. Learn how to become a certified lifeguard. Research the education, career requirements, job duties, and experience needed for starting a career in lifesaving."}]