[{"url": "http://medical-dictionary.thefreedictionary.com/stratum+basale", "passage_text": "stratum spinosum. the layer of the epidermis between the stratum granulosum and the stratum basale, marked by the presence of prickle cells; called also spinous layer and prickle-cell layer. stratum tectorium. the layer of horny scales claimed to exist on the surface of the horse's hoof that gives it the smooth glossy appearance"}, {"url": "http://www.merriam-webster.com/medical/stratum%20basale", "passage_text": "Medical Definition of STRATUM BASALE. 1. : the basal layer of the epidermis consisting of a single row of columnar or cuboidal epithelial cells that continually divide and replace the rest of the epidermis as it wears away—called also stratum germinativum; see malpighian layer. 2"}, {"url": "http://www.definitions.net/definition/stratum%20basale", "passage_text": "Stratum basale. The stratum basale is the deepest layer of the five layers of the epidermis, which is the outer covering of skin in mammals. The stratum basale is a continuous layer of cells. It is often described as one cell thick, though it may in fact be two to three cells thick in glabrous skin and hyperproliferative epidermis. "}, {"url": "http://www.knowyourbody.net/stratum-basale.html", "passage_text": "Stratum basale Definition. It refers to the basal or the deepest of the five layers of the epidermis. It is also known by the names “germative layer” or “basal layer.” Sometimes, it is also referred to as stratum germinativum."}, {"url": "https://quizlet.com/26235821/integumentary-system-stratum-basale-flash-cards/", "passage_text": "stratum basale. is the most important layer of the spidermis is a single row of cells is the closets to the basement membrane the hemidesmosomes anchor epidermis to basement membrane the desmosomes hold keratinocyte together. "}, {"url": "http://medical-dictionary.thefreedictionary.com/stratum+germinativum", "passage_text": "stratum germinativum. in the epidermis, located between the stratum basale and the stratum granulosum. Together with the basal layer, called the malpighian layer. Called also germinative layer. stratum granulosum. 1. the layer of cells between the stratum lucidum and the stratum spinosum of the skin, very thin and not always present. Called also the granular layer. 2. the deep layer of the cortex of the cerebellum. 3. the layer of follicle cells lining the theca of the vesicular ovarian follicle"}, {"url": "http://www.biology-online.org/dictionary/Stratum_basale_epidermidis", "passage_text": "Stratum basale epidermidis. Definition. noun. Latin term for basal cell layer of epidermis, the innermost layer composed of basal cells that lies at the base of the epidermis or above the dermis. Supplement. The cells of this layer are actively dividing to provide new cells to replenish lost skin from normal shedding. "}, {"url": "https://en.wikipedia.org/wiki/Stratum_basale", "passage_text": "The stratum basale (basal layer, sometimes referred to as stratum germinativum) is the deepest layer of the five epidermis layers, which is the outer covering of skin in mammals. The stratum basale is primarily made up of basal keratinocyte stem cells, which can be considered the stem cells of the epidermis. They divide to form the keratinocytes of the stratum spinosum, which migrate superficially."}, {"url": "http://www.thefreedictionary.com/stratum+basale", "passage_text": "Noun. 1. stratum basale-the innermost layer of the epidermis. malpighian layer, rete Malpighii, stratum germinativum. epidermis, cuticle-the outer layer of the skin covering the exterior body surface of vertebrates."}]