[{"url": "http://learn.org/articles/What_is_the_Average_Salary_for_College_Instructors.html", "passage_text": "The U.S. Bureau of Labor Statistics (BLS) reported that the average salary for all postsecondary instructors was $74,620 as of May 2013; however, this can vary greatly depending on the field of study that you teach (www.bls.gov)."}, {"url": "http://www.payscale.com/research/US/Job=Training_Instructor/Salary", "passage_text": "A Training Instructor earns an average salary of $53,575 per year. The highest paying skills associated with this job are Project Management, Curriculum Planning, Public Speaking, and Safety Compliance."}, {"url": "http://work.chron.com/much-paid-continuing-education-instructor-8741.html", "passage_text": "National Salary Statistics. As of 2011, continuing education instructors employed in the United States earned an average of $24.69 an hour and $51,350 a year, according to the Bureau of Labor Statistics (BLS). Half of all continuing education instructors reported annual salaries ranging from $36,240 to $64,350."}, {"url": "http://www.bls.gov/ooh/Personal-Care-and-Service/Fitness-trainers-and-instructors.htm", "passage_text": "The wage at which half of the workers in the occupation earned more than that amount and half earned less. Median wage data are from the BLS Occupational Employment Statistics survey. In May 2012, the median annual wage for all workers was $34,750."}, {"url": "http://www.bls.gov/ooh/management/training-and-development-managers.htm", "passage_text": "Employment of training and development managers is projected to grow 11 percent from 2012 to 2022, about as fast as the average for all occupations. Job prospects should be best for those with a master’s degree and related work experience in training and development, management, or a related field."}, {"url": "http://www.payscale.com/research/US/Job=Training_Instructor/Salary", "passage_text": "A training instructor is responsible for teaching clients about a specific skill in a certain industry. Training instructors exist in a variety of sectors such as technology, healthcare, business, education, and more."}, {"url": "http://www.bls.gov/ooh/management/training-and-development-managers.htm", "passage_text": "The median annual wage for training and development managers was $95,400 in May 2012. The median wage is the wage at which half the workers in an occupation earned more than that amount and half earned less. The lowest 10 percent earned less than $54,070, and the top 10 percent earned more than $164,640."}]