[{"url": "http://www.webmd.com/drugs/2/drug-12065-5204/cetirizine-oral/cetirizine-oral/details", "passage_text": "Cetirizine does not prevent hives or prevent/treat a serious allergic reaction (such as anaphylaxis). Therefore, if your doctor has prescribed epinephrine to treat allergic reactions, always carry your epinephrine injector with you. Do not use cetirizine in place of your epinephrine."}, {"url": "http://www.everydayhealth.com/drugs/zyrtec", "passage_text": "Zyrtec is the brand name of cetirizine, an over-the-counter (OTC) antihistamine used to treat cold and allergy symptoms such as sneezing, itching, watery eyes, or runny nose."}, {"url": "https://www.nlm.nih.gov/medlineplus/druginfo/meds/a698026.html", "passage_text": "Cetirizine is used to temporarily relieve the symptoms of hay fever (allergy to pollen, dust, or other substances in the air) and allergy to other substances (such as dust mites, animal dander, cockroaches, and molds)."}, {"url": "http://www.lifescript.com/health/centers/allergies/drugs/cetirizine.aspx", "passage_text": "Cetirizine is also used to treat itching and redness caused by hives. However, cetirizine does not prevent hives or other allergic skin reactions. Cetirizine is in a class of medications called antihistamines. It works by blocking the action of histamine, a substance in the body that causes allergic symptoms."}, {"url": "http://www.rxlist.com/zyrtec-side-effects-drug-center.htm", "passage_text": "Last reviewed on RxList 4/2/2015. Zyrtec (cetirizine hydrochloride) is an antihistamine that treats symptoms, such as itching, runny nose, watery eyes, and sneezing from hay fever (allergic rhinitis) and other allergies, such as allergies to molds and dust mites. It is available in generic form."}, {"url": "http://www.webmd.com/drugs/2/drug-12065-5204/cetirizine-oral/cetirizine-oral/details", "passage_text": "Cetirizine is an antihistamine used to relieve allergy symptoms such as watery eyes, runny nose, itching eyes /nose, sneezing, hives, and itching. It works by blocking a certain natural substance (histamine) that your body makes during an allergic reaction."}, {"url": "http://www.webmd.com/drugs/2/drug-12065-5204/cetirizine-oral/cetirizine-oral/details", "passage_text": "Uses. Cetirizine is an antihistamine used to relieve allergy symptoms such as watery eyes, runny nose, itching eyes /nose, sneezing, hives, and itching. It works by blocking a certain natural substance (histamine) that your body makes during an allergic reaction."}]