[{"url": "http://www.animalcontrol.com.au/rabbit.htm", "passage_text": "Rabbits in plague proportions. Rabbits, like most other pest species, were introduced when Europeans first settled in Australia. Rabbits were introduced from two main sources; the domesticated rabbit which provided early settlers with a ready source of meat, and the wild rabbit introduced later for hunting."}, {"url": "http://www.answers.com/Q/Why_were_rabbits_introduced_into_Australia_and_from_where_did_they_come", "passage_text": "Rabbits were brought to Australia on the First Fleet but, for whatever reason, they did not breed prolifically or cause any problems for the first few years of the colony's settlement. There is absence of any evidence that they were either eaten or hunted for sport in the Sydney area."}, {"url": "https://answers.yahoo.com/question/index?qid=20090917160930AAJvNJH", "passage_text": "Best Answer: --Rabbits were first introduced to Australia by the First Fleet in 1788 --------- http://en.wikipedia.org/wiki/Rabbits_in_..."}, {"url": "https://en.wikipedia.org/wiki/Rabbits_in_Australia", "passage_text": "Rabbits are a serious mammalian pest and invasive species in Australia causing millions of dollars of damage to crops. Rabbits were introduced to Australia in the 18th century with the First Fleet and became widespread after an outbreak caused by an 1859 release."}, {"url": "http://www.environment.nsw.gov.au/pestsweeds/RabbitFactsheet.htm", "passage_text": "Rabbits were introduced to Australia by the First Fleet and the first feral populations were established in Tasmania by 1827. The Victorian Acclimatisation Society released 24 rabbits on Christmas Day 1859 to hunt for sport and to help settlers feel more 'at home'."}, {"url": "http://www.environment.nsw.gov.au/pestsweeds/RabbitFactsheet.htm", "passage_text": "History. Rabbits were introduced to Australia by the First Fleet and the first feral populations were established in Tasmania by 1827. The Victorian Acclimatisation Society released 24 rabbits on Christmas Day 1859 to hunt for sport and to help settlers feel more 'at home'."}]