[{"url": "http://www.nhs.uk/conditions/broken-ankle/Pages/Introduction.aspx", "passage_text": "Introduction. A broken or fractured ankle is a relatively common injury, often caused by twisting the ankle, a fall, or a sporting accident. It may be treated with a cast or surgery and usually takes between six and 12 weeks to heal."}, {"url": "http://www.ankleproblems.net/broken_ankle_recovery/broken_ankle_recovery.html", "passage_text": "Broken Ankle Recovery Time. When someone breaks an ankle the broken ankle recovery time can vary. This all depends on the severity of the injury and what caused it. For an average type of broken ankle, it can take up to six weeks to fully heal. But in more severe cases it can take months and surgery may also have to be done to correct the problem. It is important to keep the ankle elevated and to rest the ankle for a period of time."}, {"url": "https://www.nlm.nih.gov/medlineplus/ency/patientinstructions/000548.htm", "passage_text": "Without surgery, your ankle will be placed in a cast or splint for 4 to 8 weeks. 1  The length of time you must wear a cast or splint depends on the type of fracture you have. 2  Your cast or splint may be changed more than once, as your swelling goes down."}, {"url": "http://www.trihealth.com/dailyhealthwire/orthopedics/Ankle-Surgery--How-Long-Does-It-Take-to-Recover-.aspx", "passage_text": "Lisa Vickers MD, an orthopedic surgeon at the TriHealth Orthopedic and Spine Institute, answers a Local 12 viewer question about how long it takes to recover from Open Reduction Internal Fixation (ORIF) surgery."}, {"url": "http://kneewalkercentral.com/blog/broken-ankle-recovery-time-and-tips-to-speed-up-healing/", "passage_text": "However, you can expect to see the following from your broken ankle recovery time: If the ankle was a simple break, you should expect to be healed in a minimum of three months. However, if you smoke, it’s important to note that healing will generally take longer."}, {"url": "http://www.nhs.uk/conditions/broken-ankle/Pages/Introduction.aspx", "passage_text": "Recovering. It takes about six to 12 weeks for a broken ankle to heal, but it may take longer to regain full movement and return to all of your normal activities. Swelling can sometimes take a few years to improve. Ask friends or family to go shopping for you, as you won't be able to do this yourself."}]