[{"url": "http://www.answers.com/Q/What_did_the_virginia_house_of_burgesses_represent", "passage_text": "The House of Burgesses was the first representative legislative  body in colonial America. It first met at Jamestown, then the  capital of Virginia,on July 30, 1619. After 1 … 625, the House of  Burgesses managed the affairs of the colony without the Governor."}, {"url": "http://www.answers.com/Q/What_did_the_House_of_Burgess_represent", "passage_text": "The Virginia House of Burgesses was formed in 1619 and was the first form of representative government in the United States."}, {"url": "https://en.wikipedia.org/wiki/House_of_Burgesses", "passage_text": "From 1619 to 1776, the legislature of Virginia was the House of Burgesses, which governed in conjunction with a colonial governor."}, {"url": "https://en.wikipedia.org/wiki/House_of_Burgesses", "passage_text": "The Virginia House of Burgesses /ˈbɜrdʒəsɪz/ was the first legislative assembly of elected representatives in North America."}, {"url": "http://www.answers.com/Q/What_did_the_House_of_Burgess_represent", "passage_text": "The House of Burgesses was the first representative legislative  body in colonial America. It first met at Jamestown, then the  capital of Virginia,on July 30, 1619. After 1 … 625, the House of  Burgesses managed the affairs of the colony without the Governor."}, {"url": "http://www.ushistory.org/us/2f.asp", "passage_text": "It became the House of Burgesses — the first legislative assembly in the American colonies. The first assembly met on July 30, 1619, in the church at Jamestown. Present were Governor Yeardley, Council, and 22 burgesses representing 11 plantations (or settlements) Burgesses were elected representatives."}, {"url": "http://www.encyclopediavirginia.org/House_of_Burgesses", "passage_text": "The House of Burgesses was an assembly of elected representatives from Virginia that met from 1643 to 1776. This democratically elected legislative body was the first of its kind in English North America. From 1619 until 1643, elected burgesses met in unicameral session with the governor and the royally appointed governor's Council; after 1643, the burgesses met separately as the lower house of the. of Virginia."}]