[{"url": "http://www.buzzle.com/articles/hematoma-after-surgery.html", "passage_text": "Hematoma after surgery or postoperative hematoma is basically a localized collection of blood at the surgery site. It is defined as the collection or pooling of blood under the skin, in body tissues or an organ. Hematoma is a common potential post-surgery complication, and is commonly seen after a face-lift surgery. Hematoma after Surgery. Hematoma is a sac of blood that gets accumulated at a surgical site, after surgery. This accumulation of blood leads to pain, inflammation, and discoloration of the skin around the surgical wound. Mishaps during the surgery, improper post-surgery care, etc. can cause hematoma"}, {"url": "https://en.wikipedia.org/wiki/Breast_hematoma", "passage_text": "Breast hematoma is a collection of blood within the breast. It arises from internal bleeding (hemorrhage) and may arise due to trauma (breast injury or surgery) or due to a non-traumatic cause. "}, {"url": "http://emedicine.medscape.com/article/843613-overview", "passage_text": "Hematoma. Hematoma is the most common complication after facelift surgery or rhytidectomy. Risk is higher in men (7-9%) than in women (1-3%). Other factors that have been associated with increased risk of hematoma include anterior platysmaplasty, high systolic blood pressure, aspirin or NSAID intake, and smoking. "}, {"url": "http://www.healthguideinfo.com/circulatory-conditions/p117901/", "passage_text": "Most often, a hematoma after surgery is accidental. During surgery, blood vessels are often cauterized to stop bleeding. Sometimes, a blood clot will be unsuccessful and bleeding will occur. As a result, the hematoma develops. In some cases, hematomas can occur as a result of the use of certain medications. Should a hematoma occur after surgery, treatment may not be needed if the hematoma is minor. If the hematoma is large, though, the blood may need to be surgically removed, to allow the area to heal properly."}, {"url": "http://www.makemeheal.com/mmh/education/pe/facelift/content/healingjourney/hematoma.html", "passage_text": "A hematoma is the most common complication of a facelift. A hematoma is a collection of blood under the skin. Hematomas typically occur when blood cells, which ordinarily stay enclosed in blood vessels, invade other body tissues. Blood pools under the skin, causing the area to discolor and swell."}, {"url": "http://www.healthguideinfo.com/circulatory-conditions/p117901/", "passage_text": "A hematoma is an accumulation of blood that occurs outside of the blood vessels, usually caused by a hemorrhage. It is not unusual for a hematoma to occur after surgery, generally at the surgical site, as a result of damage to the surrounding blood vessels. In some cases, improper care of the patient after surgery can lead to a hematoma, as well. Should a hematoma occur after surgery, treatment may not be needed if the hematoma is minor. If the hematoma is large, though, the blood may need to be surgically removed, to allow the area to heal properly."}, {"url": "http://blood.ygoy.com/2011/02/13/hematoma-after-surgery/", "passage_text": "Hematoma after Surgery. Postoperative hematoma is the medical term used for the condition of hematoma after surgery. This usually occurs due to the collection of blood at a certain localized area of surgery. There are chances for it to develop immediately after a few hours from surgery. This can happen due to the damage of blood vessels in and around that area and also due to the patient’s poor aftercare as well. The condition of hematoma can occur after a few surgeries such as the following. 1  Dental surgery. 2  Episiotomy. 3  Face lift surgery."}, {"url": "http://postsurgicalhematoma.com/medical-device/hematoma-complications/plastic-surgery-and-hematomas/", "passage_text": "Complications From Plastic Surgery. The complications of cosmetic surgery are many. Hematoma’s can occur in three percent of all facial plastic surgeries. A tender, raised area filled with fluid can indicate Hematoma even if you can’t see any blood. If necessary, the doctor can drain a small hematoma with a needle. Find the right Surgeon to Prevent a Hematoma after a Face-Lift or Plastic Surgery. We suggest that you find surgeon that can prevent complications of cosmetic surgery 1  : Monitors bleeding during the surgery. 2  Uses techniques that make hematoma for­mation very unlikely."}, {"url": "http://www.simple-remedies.com/health-tips-6/hematoma-after-surgery-symptoms.html", "passage_text": "Hematoma is a common complication observed after a major surgical intervention. Hematoma is attributed to collection of blood at the site of the operation, which is associated with rupture or damage of the blood vessel at the site. Some common symptoms associated with hematoma after a surgery include the following, 1  The condition is characterized by fullness and pain at the affected location. 2  The underlying skin often has a bluish or purple discoloration."}]