[{"url": "https://en.wikipedia.org/wiki/East_Asia", "passage_text": "Southeast Asia. The UNSD definition of Eastern Asia purely based on statistical conveniece, but also other common definitions of East Asia contain the entirety of China, Japan, North Korea, South Korea, Mongolia and Taiwan."}, {"url": "http://www.factmonster.com/dk/encyclopedia/eastern-asia.html", "passage_text": "The harsh landscapes of Eastern Asia include remote mountains, cold deserts, and the vast, dry grasslands of Mongolia and northern China. In southeastern China, there are wide plains and valleys, watered by mighty rivers."}, {"url": "https://en.wikipedia.org/wiki/East_Asia", "passage_text": "Historically, many societies in East Asia have been part of the Chinese cultural sphere, and East Asian vocabulary and scripts are often derived from Classical Chinese and Chinese script. Sometimes Northeast Asia is used to denote Japan and Korea."}, {"url": "http://www.whats4eats.com/east-asia", "passage_text": "Image by sanfamedia.com. The countries of eastern and southeastern Asia have a culinary tradition that stretches back over thousands of years. Rice was first cultivated in China in Neolithic times and still forms the foundation of most East Asian cuisines. Rice and wheat noodles are also popular."}, {"url": "https://en.wikipedia.org/wiki/East_Asia", "passage_text": "The history of East Asia is predominantly the history of the Chinese Dynasties that dominated the region in matters of trade as well as militarily, such as the Qin and the Han Dynasties. There are records of tributes sent overseas from the early kingdoms of Korea and Japan."}, {"url": "https://en.wikipedia.org/wiki/Southeast_Asia", "passage_text": "Southeast Asia or Southeastern Asia is a subregion of Asia, consisting of the countries that are geographically south of China, east of India, west of New Guinea and north of Australia. The region lies near the intersection of geological plates, with heavy seismic and volcanic activity."}, {"url": "https://en.wikipedia.org/wiki/East_Asia", "passage_text": "East Asia or Eastern Asia is the eastern subregion of the Asian continent, which can be defined in either geographical or cultural terms. Geographically and geopolitically, it covers about 12,000,000 km 2 (4,600,000 sq mi), or about 28% of the Asian continent, about 15% bigger than the area of Europe."}, {"url": "http://wikitravel.org/en/East_Asia", "passage_text": "The main intercontinental gateways to East Asia are Beijing Capital (second in the world in 2013 passenger traffic) and Hong Kong (China), Seoul-Incheon (South Korea) and Tokyo-Narita (Japan)."}, {"url": "http://www.worldbank.org/en/region/eap", "passage_text": "East Asia Pacific Economic Update, October 2015. October 4, 2015 — East Asia remains one of the main growth drivers of the world economy, accounting for nearly two-fifths of global economic growth. Overall, the region is expected to grow 6.5% in 2015."}]