[{"url": "http://www.ehow.com/info_7868819_much-do-college-coaches-make.html", "passage_text": "The average salary of the 65 head coaches who advanced to the NCAA March Madness tournament in 2010 was roughly $1.3 million, according to the Knight Commission on Intercollegiate Athletics. A handful of standout coaches boast contracts worth between $2 million and $4 million annually. The average annual salary of head coaches in Division I football is around $1.4 million, according to a 2010 article from"}, {"url": "http://www.usatoday.com/story/sports/ncaaf/2012/11/19/college-football-coaches-contracts-analysis-pay-increase/1715435/", "passage_text": "College football coaches continue to see salary explosion. The average annual salary for college football head coaches at major colleges is $1.64 million, up nearly 12% over last season — and more than 70% since 2006. In that same period, coaches' pay increased 44%. Alabama's Nick Saban is the highest paid at $5.5 million, and he is one of four Southeastern Conference coaches among the top eight. Texas head coach Mack Brown, of the Big 12, is the second-highest, pulling in $5.4 million."}, {"url": "http://www.ehow.com/info_7868819_much-do-college-coaches-make.html", "passage_text": "Division I men's basketball coaches average approximately $400,000 in salary, according to a 2009 Fox News article. However, Michael Sanserino of the Pittsburgh Post Gazette reports that as of 2011, most schools from the major athletic conferences pay at least $1 million to their head basketball coaches. The average annual salary of head coaches in Division I football is around $1.4 million, according to a 2010 article from the Knight Commission on Intercollegiate Athletics."}, {"url": "http://deadspin.com/how-much-do-college-football-coaches-make-a-lot-1459712746", "passage_text": "1 Seventeen coaches are making more than $3 million this year; 70, a majority, more than $1 million. 2  Eight of the 20 highest paid coaches work in the SEC, with five each from the Big Ten and Big 12.). The numbers are striking no matter how you look at them: 1 "}, {"url": "http://work.chron.com/much-money-college-coaches-make-7750.html", "passage_text": "Head college football coaches in 2012 were paid a median base salary of $267,800, according to the CUPAHR survey. The most successful and highest paid college football coaches actually earned from $2,500,000 to $5,190,000, according to a December 2011 ESPN article. Median Salaries in Men’s Sports. The CUPAHR survey determined median salaries in all areas of college coaching as of February 2012. According to the survey, a head coach in men’s baseball earned a median salary of $57,500. At the same time, track and field coaches earned $52,728. Swimming coaches earned $55,358. Men’s gymnastics coaches earned $68,163"}, {"url": "http://www.usatoday.com/story/sports/ncaaf/2012/11/19/college-football-coaches-contracts-analysis-pay-increase/1715435/", "passage_text": "The average annual salary for head coaches at major colleges (not including four schools that moved up to the Football Bowl Subdivision this season) is $1.64 million, up nearly 12% over last season — and more than 70% since 2006, when USA TODAY Sports began tracking coaches' compensation. In that same period, coaches' pay increased 44%. Alabama's Nick Saban is the highest paid at $5.5 million, and he is one of four Southeastern Conference coaches among the top eight. Texas head coach Mack Brown, of the Big 12, is the second-highest, pulling in $5.4 million."}, {"url": "http://www.usatoday.com/story/sports/ncaaf/2012/12/18/assistant-coaches-salaries-bowl-subdivision/1777719/", "passage_text": "The average major-college football assistant coach now earns roughly $200,000, a USA TODAY Sports analysis finds. That means NCAA Bowl Subdivision assistant coaches joined their bosses in seeing their compensation for the 2012 season increase by more than 10% over last season. "}, {"url": "http://money.usnews.com/careers/best-jobs/sports-coach/salary", "passage_text": "Average Sports Coach Pay vs. Other Best Jobs. Sports coaches take home an average of $37,610 a year, which is more than the average salary for recreation and fitness workers who earn $25,560. In comparison, child and family social workers earn about $46,060, and high school teachers bring in approximately $58,260. The BLS reports the median annual salary for sports coaches was $29,150 in 2013. The best-paid 10 percent in the field made $66,830, while the bottom 10 percent made approximately $17,340."}]