[{"url": "http://www.ehow.com/way_5255905_cooking-time-turkey-legs.html", "passage_text": "Grilling is one of the most commonly used methods for preparing turkey legs. The total preparation time for grilled turkey legs is 30 to 40 minutes. If you plan on soaking the turkey legs in a marinade beforehand, factor in an additional four to 24 hours marinating time. Once the turkey legs are marinated or seasoned to your preference, heat a grill to “Medium” heat. For an indoor cooking alternative, roast turkey legs in the oven. Cooking turkey legs in the oven is more time consuming than grilling and usually takes about two hours. Preheat your oven to 325 degrees Fahrenheit, then coat or season four to six turkey legs to your desired flavor."}, {"url": "http://www.livestrong.com/article/467856-how-to-bake-a-turkey-leg/", "passage_text": "Cover the baking dish or roasting pan with aluminum foil and bake the meat in the oven for one hour. Remove the aluminum foil from the baking dish after 60 minutes has passed. Bake the turkey leg uncovered in the oven for an additional 45 minutes. Use a meat thermometer to test the internal teperature of the turkey leg. Remove the turkey leg from the oven. Allow the meat to rest on a serving plate for 10 minutes so that its natural juices can redistribute throughout the meat before serving."}, {"url": "http://www.livestrong.com/article/467856-how-to-bake-a-turkey-leg/", "passage_text": "Step 5. Place the turkey leg in the bottom of a baking dish or roasting pan and brush it all over with the olive oil and butter mixture. Season the turkey leg with sea or kosher salt and freshly ground black pepper to taste. Use a meat thermometer to test the internal teperature of the turkey leg. Remove the turkey leg from the oven. Allow the meat to rest on a serving plate for 10 minutes so that its natural juices can redistribute throughout the meat before serving."}, {"url": "http://www.melaniecooks.com/baked-turkey-legs-recipe/1207/", "passage_text": "Turkey legs are so yummy with the cranberry sauce! How To Make Baked Turkey Legs: Preheat the oven to 375F. Sprinkle the turkey legs with salt and pepper. Put in the oven and bake for 1 1/2 hours, or until done. You know when the turkey legs are done when the meat thermometer put in the thickest part of the leg registers 165F, and also when the juices run clear (not pink) when the thickest part of the leg is cut. Enjoy the turkey legs with the cranberry sauce! "}, {"url": "http://www.food.com/recipe/roasted-turkey-legs-165587", "passage_text": "Directions. 1  Preheat oven to 350 degrees F. rinse the turkey legs and pat dry. 2  Stand the turkey legs upright (as if turkey were standing). 3  Roast uncovered for 1 1/2 to 2 hours, until legs are golden brown and the internal temperature is 180 degrees F when taken with a meat thermometer. "}, {"url": "http://www.ehow.com/how_5762332_bake-turkey-legs.html", "passage_text": "Pour the oil mixture over the turkey to baste it. Cover the pan with a sheet of foil and bake the turkey legs for an hour at 325 degrees. After an hour, remove the pan and turn the turkey legs over for even cooking. Cook the turkey legs for another 1-1/2 hours at 325 degrees"}, {"url": "http://busycooks.about.com/od/turkeyrecipes/a/Roast-Turkey-Parts-Instead-Of-A-Whole-Bird.htm", "passage_text": "Add the turkey legs after the breast has been in the oven for 30 minutes, then after another 30 minutes add the thighs so they're done at about the same time. Be sure to leave enough room around each piece (about an inch) so the parts roast evenly. Put 1-1/2 cups of turkey or chicken broth in the bottom of the pan. "}, {"url": "http://www.ehow.com/way_5255905_cooking-time-turkey-legs.html", "passage_text": "Grill the turkey legs for approximately five to 10 minutes, then uncover the grill and turn the legs over. Replace the grill cover and continue grilling and flipping the turkey legs every five to 10 minutes until they are golden brown. Turkey legs generally require 20 to 30 minutes of total grilling time. For an indoor cooking alternative, roast turkey legs in the oven. Cooking turkey legs in the oven is more time consuming than grilling and usually takes about two hours. Preheat your oven to 325 degrees Fahrenheit, then coat or season four to six turkey legs to your desired flavor."}, {"url": "http://www.justapinch.com/recipes/main-course/turkey/connies-baked-turkey-legs.html", "passage_text": "Add chicken broth to pan. 8. Place turkey legs in pan. 9. Roast legs at 350 degrees for one hour and twenty minutes. CAUTION: Do not over bake and since ovens are different, start checking on the turkey leg temperature after one hour. Turkey temperature should be 175 degrees when you take it from the oven. When ready, take turkey legs from oven and let rest 15 minutes to redistribute the juices. 11. Taste your broth. If it's to your liking, spoon on turkey legs. If not, add salt, pepper and a little butter and warm, then spoon over"}]