[{"url": "http://www.thedogtrainingsecret.com/blog/reduce-dogs-food-aggression/", "passage_text": "If you’d like to tackle your dog’s food aggression issues yourself, here are three things you need to do: 1  Train your dog the ‘Leave it’ command. 2  One way to train this behavior is to take something your dog likes, like a piece of cheese, and let your dog see you put it under your foot. 1 Train your dog the ‘Leave it’ command. 2  One way to train this behavior is to take something your dog likes, like a piece of cheese, and let your dog see you put it under your foot. 3  Most dogs will try to dig out the food from under your shoe. 4  Make sure to keep the cheese covered until the dog gives up"}, {"url": "http://www.thedogtrainingsecret.com/blog/fixing-dog-aggression-leash/", "passage_text": "Fixing a dog’s aggression towards other people or other dogs while on his leash is a problem that many people try to fix the WRONG way. Most dog owners try to train their dog the way most of us were trained by our parents when we do something bad. I use the ‘find it’ trick. when he is on leash and gets excited and aggressive around dogs, I use the ‘find it’ trick. I drop a yummy treat close to me or away from the other dog and say find it. His attention is diverted to the thing he needs to find."}, {"url": "http://www.vetinfo.com/aggressive-dog-behavior.html", "passage_text": "Fixing Aggressive Dog Behavior. Here are some tips to help train your dog against aggressive behavior 1  : Make sure your dog knows his place within the family. 2  Never play aggressively with your dog. 3  Reward your dog when he displays good behavior. 4  Always maintain mild discipline. 5  Do not discipline your dog harshly"}, {"url": "http://dogs.about.com/od/dogtraining/a/aggression.htm", "passage_text": "Call in a Professional. If you have ruled out a medical problem, it is time to call in a professional dog trainer or behaviorist. Because aggression is such a serious problem, dog owners should not attempt to fix it on their own. A professional can help you create a plan to manage your dog's aggression. To find a professional dog trainer or behaviorist, ask your veterinarian for a referral or check out the Association of Pet Dog Trainers website"}, {"url": "http://pets.webmd.com/dogs/guide/aggression-dogs", "passage_text": "A. A. Aggression is the most common and most serious behavior problem in dogs. It’s also the number-one reason why pet parents seek professional help from behaviorists, trainers and veterinarians. Species that live in groups, including people and dogs, also use aggression and the threat of aggression to keep the peace and to negotiate social interactions. To say that a dog is “aggressive” can mean a whole host of things. Aggression encompasses a range of behaviors that usually begins with warnings and can culminate in an attack. Dogs may abort their efforts at any point during an aggressive encounter"}, {"url": "https://www.cesarsway.com/dog-behavior/aggression/understanding-aggression", "passage_text": "For many fear-aggressive dogs, it is a lack of adequate dog exercise that is the root of the dog problem behavior. Dog exercise burns the dog's excess energy and helps maintain the dog's healthy state of mind. This is important because, in order to talk to the mind, you need to remove the energy from the body. Understanding dog aggression. By Cesar Millan. Dog aggression is a major dog problem for owners. I want to help you understand the causes of dog aggression, so you can overcome this dog problem. Dog aggression stems from the dog's frustration and dominance."}, {"url": "http://access.dogproblems.com/aggression.cfm?affID=dogsmsn", "passage_text": "... I created Secrets of a Professional Dog Trainer! to be the quick and easy way to train your dog and fix behavior problems.* It's a wealth of information, including: Fixing dog training problems.*. Tips and secrets to use in your everyday dog obedience training. How to select, adopt and raise a new puppy or older dog. "}, {"url": "http://pets.webmd.com/dogs/guide/aggression-dogs", "passage_text": "You need an accurate diagnosis before you can hope to help your dog. Aggressive behavior problems in dogs can be classified in different ways. A beneficial scheme for understanding why your dog is aggressive is based on the function or purpose of the aggression. Species that live in groups, including people and dogs, also use aggression and the threat of aggression to keep the peace and to negotiate social interactions. To say that a dog is “aggressive” can mean a whole host of things. Aggression encompasses a range of behaviors that usually begins with warnings and can culminate in an attack. Dogs may abort their efforts at any point during an aggressive encounter"}]