[{"url": "http://www.ehow.com/facts_7259360_can-claim-preschool-tuition-taxes_.html", "passage_text": "How Much You Get. The amount of the credit is based on adjusted gross income. As of 2014, if your AGI is $15,000 or less, you can claim 35 percent of what you pay in preschool tuition up to $3,000 for one child. If two of your children attend, you can claim a percentage of up to $6,000 in tuition costs. "}, {"url": "http://www.kiplinger.com/article/taxes/T054-C001-S001-faqs-on-the-child-care-tax-credit.html", "passage_text": "If you have two or more children and child-care expenses exceeding $5,000, however, you might be able to benefit from both the FSA and the dependent-care credit. You can set aside up to $5,000 in pretax money in your FSA and claim the dependent-care credit for up to $1,000 in additional expenses. That depends on the number of children, the cost of care, and your income. You can count up to $3,000 in child-care expenses for one child, or up to $6,000 for two or more children. The credit is a percentage of the amount spent on child care, and that percentage gradually decreases as income increa"}, {"url": "http://www.kiplinger.com/article/taxes/T054-C001-S001-faqs-on-the-child-care-tax-credit.html", "passage_text": "Keep in mind that this is a credit, not a deduction, so it lowers your tax bill dollar for dollar. Does the cost of kindergarten count toward the credit? No. The cost of kindergarten and higher grades is considered to be an educational expense, not a child-care expense, so it doesn't qualify for the child-care credit. That depends on the number of children, the cost of care, and your income. You can count up to $3,000 in child-care expenses for one child, or up to $6,000 for two or more children. The credit is a percentage of the amount spent on child care, and that percentage gradually decreases as income increases"}, {"url": "http://www.ehow.com/info_12032207_preschool-tuition-count-childcare-expense.html", "passage_text": "The costs associated with preschool count toward the child care credit for taxpayers who qualify. Because this is a tax credit and not a deduction, the amount of preschool expenses you’re able to turn into the child care credit reduces your tax bill dollar for dollar. If you have one child whose preschool tuition totaled $1,000 and another who had a $7,500 tuition bill, you’ll still be able to count $6,000 in tuition expenses toward the child care credit."}, {"url": "https://www.irs.gov/publications/p503/ar02.html", "passage_text": "There is a dollar limit on the amount of your work-related expenses you can use to figure the credit. This limit is $3,000 for one qualifying person, or $6,000 for two or more qualifying persons. If you paid work-related expenses for the care of two or more qualifying persons, the applicable dollar limit is $6,000. For example, if your work-related expenses for the care of one qualifying person are $3,200 and your work-related expenses for another qualifying person are $2,800, you can use the total, $6,000, when figuring"}, {"url": "http://finance.zacks.com/itemize-childcare-deduction-4600.html", "passage_text": "After choosing to itemize your deductions, you may claim the Child and Dependent Care credit on Form 1040, 1040A or 1040NR. The IRS places a dollar limit on the amount of expenses paid for the year to claim the credit. For tax year 2012, the dollar limit is $3,000 for one qualifying child and $6,000 for two or more qualifying children."}, {"url": "http://finance.zacks.com/paying-kindergarten-count-child-dependent-care-credit-9083.html", "passage_text": "Kindergarten Expenses. Unfortunately, expenses paid for a child to attend kindergarten or a higher grade do not count toward the child and dependent care credit. Only expenses paid to a day care, preschool or nursery school qualify. If you pay expenses for before-or after-school care for your kindergartener or child care on days the child does not have school, the expenses do count. If you are married, the only expenses that count toward the credit are those paid while you and your spouse both work or look for work, unless your spouse is a full-time student or cannot care for herself."}, {"url": "http://www.ehow.com/info_12032207_preschool-tuition-count-childcare-expense.html", "passage_text": "It doesn’t matter which child the expenses are associated with. If you have one child whose preschool tuition totaled $1,000 and another who had a $7,500 tuition bill, you’ll still be able to count $6,000 in tuition expenses toward the child care credit."}, {"url": "https://www.irs.gov/publications/p503/ar02.html", "passage_text": "To be able to claim the credit for child and dependent care expenses, you must file Form 1040, Form 1040A, or Form 1040NR, not Form 1040EZ or Form 1040NR-EZ, and meet all the following tests. The care must be for one or more qualifying persons who are identified on Form 2441. (See Qualifying Person Test. For example, if your work-related expenses for the care of one qualifying person are $3,200 and your work-related expenses for another qualifying person are $2,800, you can use the total, $6,000, when figuring the credit."}]