[{"url": "http://www.godsgeography.com/asia/caspiansea/caspiansea.html", "passage_text": "Caspian Sea. [Image courtesy NASA's Earthobservatory]. The Caspian Sea is a very large, inland body of water that is about 740 miles long and 140-300 miles wide, with an area of about 150,000 square miles. It's surrounded by the nations of Russia, Kazakhstan, Turkmenistan, Iran, and Azerbaijan"}, {"url": "http://www.thinkbabynames.com/meaning/1/Caspian", "passage_text": "Caspian. Caspian /ca-spi-an/ [3 sylls.] as a boys' name. Place name: the Caspian Sea is the largest inland body of water in the world, lying between Russia and Asia, and its southern coast is in Iran. Author C.S. Leweis named a principal character Caspian in one of his Chronicles of Narnia. Kreatif forms: Carspian, Cispian, Craspian. [ more ]."}, {"url": "http://schools-wikipedia.org/wp/c/Caspian_Sea.htm", "passage_text": "The Caspian Sea is the largest enclosed body of water on Earth by area, variously classed as the world's largest lake or a full-fledged sea. It has a surface area of 371,000 square kilometers (143,244 sq mi) and a volume of 78,200 cubic kilometers (18,761 cu mi). The Caspian Sea is the largest inland body of water in the world and accounts for 40 to 44 percent of the total lacustrine waters of the world. The coastlines of the Caspian are shared by Azerbaijan, Iran, Kazakhstan, Russia, and Turkmenistan"}, {"url": "https://en.wikipedia.org/wiki/Caspian_Sea", "passage_text": "The word Caspian is derived from the name of the Caspi (Aramaic: Kspy, Greek: Kaspioi, Persian: کاسپی ‎‎), ancient people who lived to the south-west of the sea in Transcaucasia. It is bounded to the northeast by Kazakhstan, to the northwest by Russia, to the west by Azerbaijan, to the south by Iran, and to the southeast by Turkmenistan. The Caspian Sea lies to the east of the Caucasus Mountains and to the west of the vast steppe of Central Asia. Its northern part, the Caspian Depression, is one of the lowest points on Earth. The ancient inhabitants of its coast perceived the Caspian Sea as an ocean, probably because of its saltiness and large size"}, {"url": "http://www.behindthename.com/name/caspian", "passage_text": "Used by author C. S. Lewis for a character in his 'Chronicles of Narnia' series, first appearing in 1950. Prince Caspian first appears in the fourth book, where he is the rightful king of Narnia driven into exile by his evil uncle Miraz. Lewis probably based the name on the Caspian Sea, which was named for the city of Qazvin, which was itself named for the ancient Cas tribe. "}, {"url": "http://www.caspiansea.com/", "passage_text": "Another is it was named after the Caspians because the Caspian Sea is what’s left behind by the Tethys Ocean. The Caspian Sea was landlocked because of the continents’ drifting around 5-6 million years ago. The lake sea today borders Azerbaijan, Iran, Kazakhstan, Turkmenistan and Russia. The Caspian Sea. The Caspian Sea-the largest inland mass of water-accounts for forty percent of all lacustrine waters on Earth. It is a terminal, or endorheic lake which means its waters do not reach any ocean. Due to this, minerals gather in the water because of evaporation."}, {"url": "http://www.lakepedia.com/lake/caspian-sea.html", "passage_text": "It is the largest enclosed inland body of water, and thus sometimes referred to as a sea. Caspian Sea’s surface area is 378,000 km2 or 143,200 sq mi, and it boasts a volume of 78,200 km3. The lake is endorheic (meaning it has no outflows), and sits at the border between Europe and Asia. The lake was and still is known under many different names. The Greeks and Persians used to call the lake the the Hyrcanian Ocean. In Persian antiquity but also in modern Iran, the Caspian Sea is known as the Mazandaran Sea. Indians used to call it Kashyap Sagar, which in Turkey is known under the name of Khazar Sea."}]