[{"url": "http://www.heart-valve-surgery.com/heart-surgery-blog/2009/03/19/healing-sternum-heart-fused-recovery-heal/", "passage_text": "I asked about heart healing and was told that at 6 weeks the heart is considered fully healed. The sternum is considered fused enough for weight restrictions to be lifted at 3 months and completely rejoined at 6 months. The important cardiac rehab classes continue at 3 times a week now for my 12 week program."}, {"url": "http://www.cardiofiles.net/how-long-did-it-take-you-to-heal-after-open-heart-surgery.-i...-552936.html", "passage_text": "10 weeks is still somewhat early days to recover from surgery and everybody's recovery varies. You can take two people, same op by the same surgeon. One will take a long time to recover, the other will be quick. That said there's a fairly consistent pattern in how we feel about our recovery from heart surgery. At 3 weeks it's Well, I've survived. Then 3 months is the point where you feel that yeah, I am going to recover ..."}, {"url": "http://www.cts.usc.edu/hpg-resumingactivitiesandexerciseafterheartsurgery.html", "passage_text": "You should not drive for 3-4 weeks from the date of your surgery or while you are still taking narcotic pain pills. During this time your reaction time may be dulled, and if an incision was made on your sternum, your breastbone will still be healing. You may be a passenger in a car at any time."}, {"url": "http://www.smart-heart-living.com/heart-surgery-incision.html", "passage_text": "If you have had open heart surgery. you will most likely have a vertical heart surgery incision down the center of your chest along the breastbone (sternum). In some cases you could have an incision that crosses your chest between the ribs."}, {"url": "https://www.healthtap.com/topics/how-long-after-open-heart-surgery-does-it-take-the-sternum-to-heal-completely", "passage_text": "Variable: It generally takes a year to fully recover after open heart surgery, though the wounds will be healed after a couple of weeks."}, {"url": "http://www.cts.usc.edu/hpg-resumingactivitiesandexerciseafterheartsurgery.html", "passage_text": "If your surgery required an incision on your sternum (breastbone), it will take about 6-8 weeks for your sternum to heal. During this time, you may do light household chores, such as laundry, shopping, cooking, light gardening, dusting, and washing dishes when you feel up to it."}, {"url": "http://doctor.ndtv.com/faq/ndtv/fid/0015297/How_long_will_my_chest_take_to_heal_after_bypass_surgery.html", "passage_text": "It takes a maximum of 4-6 weeks for the chest wound to heal after bypass surgery. These days the stitches are not removed as they are self absorbing. Now a days CABG operation is an absolutely safe procedure and it certainly increases the life span."}, {"url": "http://simplehand.org/heart-surgery/recovering-from-open-heart-surgery.html", "passage_text": "For the first many weeks after open-heart surgery you will probably not have much of an appetite. It is necessary for you to get on a heart healthy diet and to stick to it. You will be cold. Take iron supplements as recommended by your doctor. You must eat as much as you can."}, {"url": "http://www.heart-valve-surgery.com/heart-surgery-blog/2009/03/19/healing-sternum-heart-fused-recovery-heal/", "passage_text": "I was under the impression that my sternum would be healed in 3 months after surgery. It is now 3 months, but there remains some discomfort when sleeping in certain positions. I tried hitting golf balls and there was some residual discomfort. I also find some numbness on the left side of my chest."}]