[{"url": "http://www.aspiringnurse.com/nurse-midwife/midwife-salary/", "passage_text": "Midwife Salary. If you are thinking about starting a career as a nurse midwife, you might be surprised by just how much money you can earn in this career. The average midwife salary is well over $60,000 a year, and there are some midwives that earn more than $100,000 annually. If you have been looking for a profitable career path to get involved with, this could be a great option to explore. You may be able to earn more money if you get a high-end certification related to midwifery. Possible salaries by certification include: 1  Advanced Registered Nurse Practitioner: $80,988 – $118,250 per year. 2  Certified Nurse Midwife: $65,704 – $104,000 per year. 3  Registered Nurse: $68,128 – $107,17"}, {"url": "http://www1.salary.com/Certified-Midwife-salary.html", "passage_text": "For example the median expected annual pay for a typical Certified Nurse Midwife in the United States is $96,440 so 50% of the people who perform the job of Certified Nurse Midwife in the United States are expected to make less than $96,440. Source: HR Reported data as of October 2015. Median $96,440. "}, {"url": "http://work.chron.com/average-salary-midwives-1017.html", "passage_text": "Salaried Nurse-Midwives. Midwives who are salaried employees of a hospital or practice earn annual incomes which vary considerably. Based on a survey taken in 2007, the American College of Nurse-Midwives reports that the median salary of a nurse-midwife who works 35 hours or more per week is between $79,093 and $89,916. The Average Salary of Midwives. A midwife helps to care for a woman during pregnancy, assists with childbirth and offers support to new mothers during the post-birth period."}, {"url": "http://www.healthcare-salaries.com/allied-health-professionals/midwife-salary", "passage_text": "Midwife’s salary working in the United States is ranging from $30,913 to $108,903 per annum. A new midwife can receive a starting yearly minimum pay of around $31,000. As a midwife becomes known, the yearly rate increases considerably. In the United Kingdom, the average annual salary of a Midwife is between £20,177 – £36,620. The median midwife salary is around £25,000. In Uk, the average salary of Midwife per annum based on number of work experience is as follows. Midwife with 1 to 4 years of experience earns between £19,574 – £26,322 per year while those with 5 to 9 years of practice collect an average between £19,200 – £34,000 per annum"}, {"url": "http://www.healthcare-salaries.com/allied-health-professionals/midwife-salary", "passage_text": "The average salary of Midwife per annum based on number of work experience. Midwife with 1 to 4 years of experience earn from $33,508 – $80,576 per year while those with 5 to 9 years of practice collect an average of $82,629 – $95,959 per annum. In the United Kingdom, the average annual salary of a Midwife is between £20,177 – £36,620. The median midwife salary is around £25,000. In Uk, the average salary of Midwife per annum based on number of work experience is as follows. Midwife with 1 to 4 years of experience earns between £19,574 – £26,322 per year while those with 5 to 9 years of practice collect an average between £19,200 – £34,000"}, {"url": "http://nursejournal.org/nursing-midwife/nursing-midwife-careers-salary-outlook/", "passage_text": "Average Nursing Midwife salaries for job postings in Colorado are 11% lower than average Nursing Midwife salaries for job postings nationwide. The average salary ranks 34th among states in the country. There were also job openings from employers like The HealthCare Initiative and University of Colorado. Average Nursing Midwife salaries for job postings in Massachusetts are 20% higher than average Nursing Midwife salaries for job postings nationwide. The average salary ranks 3rd"}, {"url": "http://work.chron.com/salary-midwife-nurse-6600.html", "passage_text": "Nurse Midwife Salaries. Salaries for certified nurse midwives have increased steadily. A 2010 survey by consulting firm Integrated Healthcare Services reported median yearly pay of $96,418 for nurse midwives, with additional benefits raising their total compensation to $100,480. In comparison, a 2007 survey by the American College of Nurse Midwives reported mid-range salaries of $79,093 to $89,916."}, {"url": "http://www.payscale.com/research/US/Job=Nurse_Midwife/Salary", "passage_text": "Nurse Midwife Salary. (United States). Slightly more than half of Nurse Midwifes in the United States have been in the field for more than 10 years. Pay can fall anywhere from $60K to $112K per year, but median earnings come to around $83K per year. "}, {"url": "http://www.healthcare-salaries.com/allied-health-professionals/midwife-salary", "passage_text": "Conclusion about midwife salary. According to payscale, the average salary of a midwife per annum in the US is between $30,913 – $108,903. The average annual income for Midwife is $76, 302. In the United Kingdom, Midwives receive an average salary between 20,177 – £36,620 per annum. In the United Kingdom, the average annual salary of a Midwife is between £20,177 – £36,620. The median midwife salary is around £25,000. In Uk, the average salary of Midwife per annum based on number of work experience is as follows. Midwife with 1 to 4 years of experience earns between £19,574 – £26,322 per year while those with 5 to 9 years of practice collect an average between £19,200 – £34,00"}]