[{"url": "http://www.humantouchofchemistry.com/understanding-hydrocarbons.htm", "passage_text": "Cycloalkanes These are hydrocarbons that have one or more carbon rings. These rings have hydrogen atoms attached to it. Aromatic hydrocarbons These hydrocarbons have a stable structure and they have one aromatic ring. An example of one of the simplest aromatic hydrocarbons is benzene. Unsaturated hydrocarbon Hydrocarbons having one or more double or triple bonds between carbon atoms are called unsaturated hydrocarbons. Alkenes are the hydrocarbons that have one, double bond between the carbon atoms. On the other hand, those that contain triple bonds are alkynes."}, {"url": "http://www.humantouchofchemistry.com/understanding-hydrocarbons.htm", "passage_text": "Types of hydrocarbons. A hydrocarbon can exist as a gas (propane or methane), liquid (benzene or hexane), waxes or low melting solids (like naphthalene) or polymers (like polyethylene). There are four types of hydrocarbons namely saturated hydrocarbons, unsaturated hydrocarbons, cycloalkanes and aromatic hydrocarbons. Unsaturated hydrocarbon Hydrocarbons having one or more double or triple bonds between carbon atoms are called unsaturated hydrocarbons. Alkenes are the hydrocarbons that have one, double bond between the carbon atoms. On the other hand, those that contain triple bonds are alkynes."}, {"url": "http://link.springer.com/chapter/10.1007/978-3-642-87734-6_15", "passage_text": "Abstract. Hydrocarbons are compounds that are composed solely of carbon and hydrogen atoms. Saturated, unsaturated, and aromatic hydrocarbons are the three principal classes of naturally occurring hydrocarbons. These classes differ in their chemical and metabolic* activities and relative abundances in organisms and sedimentary deposits. "}, {"url": "http://softschools.com/difference/saturated_vs_unsaturated_hydrocarbons/156/", "passage_text": "1. Alkanes-Are saturated hydrocarbons that therefore contain only hydrogen and carbon atoms bonded to each other, and typically follow the chemical formula C n H 2n+2. A common example is paraffin. 2. Alkenes-These unsaturated hydrocarbons are molecules that contain at least one carbon-to-carbon double bond. "}, {"url": "http://study.com/academy/lesson/unsaturated-hydrocarbon-definition-examples.html", "passage_text": "There are three types of unsaturated hydrocarbons: alkenes, alkynes and aromatic hydrocarbons. Alkenes have one or more carbon-carbon double bond. Alkynes have one or more carbon-carbon triple bond, and aromatic hydrocarbons have a benzene or aromatic ring in their structure. Hydrocarbons are compounds that only consist of the elements hydrogen and carbon. In this lesson, we will focus on one type of hydrocarbon: unsaturated hydrocarbons, and its three types-"}, {"url": "https://en.wikipedia.org/wiki/Unsaturated_hydrocarbon", "passage_text": "(December 2009). Unsaturated hydrocarbons are hydrocarbons that have double or triple covalent bonds between adjacent carbon atoms. Those with at least one carbon to carbon double bond are called alkenes and those with at least one carbon to carbon triple bond are called alkynes. Except for aromatic compounds, unsaturated hydrocarbons are highly reactive and undergo addition reactions to their multiple bonds. Typical reagents added are hydrogen halides, water, sulfuric acid, elemental halogens and alcohols."}, {"url": "http://www.chem.latech.edu/~upali/chem121/Notes-C13-121.pdf", "passage_text": "Unsaturated Hydrocarbons 13.1 Unsaturated Hydrocarbons Unsaturated hydrocarbon: a hydrocarbon with one or more carbon–carbon multiple bonds (double bonds, triple bonds, or both). – Physical properties similar to those of saturated hydrocarbons. "}, {"url": "https://answers.yahoo.com/question/index?qid=20061126234446AAc61eI", "passage_text": "Report Abuse. If the hydrocarbon have double bonds or triple bonds, it is an unsaturated one. If it doesn't have any such bonds it is a saturated one. This'll also apply to aromatic hydrocarbons as well. Illidan · 9 years ago. Thumbs up. 0. Thumbs down. 0. Comment. Add a comment"}, {"url": "http://www.differencebetween.com/difference-between-saturated-and-vs-unsaturated-hydrocarbons/", "passage_text": "• In saturated hydrocarbons, all the bonds are single bonds. In unsaturated hydrocarbons, double bonds and triple bonds are also present. • Saturated hydrocarbons have the highest number of hydrogen atoms, carbon atoms can accommodate in contrast to unsaturated hydrocarbons. • Saturated hydrocarbons are the simplest type of hydrocarbons. In unsaturated hydrocarbons, there are double or triple bonds between the carbon atoms. Since there are multiple bonds, the optimal number of hydrogen atoms is not there in the molecule. Alkenes and alkynes are examples for"}]