[{"url": "http://www.answers.com/Q/What_animals_are_there_in_the_highlands", "passage_text": "The highlands biome is a basic grassland area and consists of the following plants and animals; grasses, grasses are the most common."}, {"url": "http://deathstar.rutgers.edu/advgeo/Fauna-mammals,reptile,fish.htm", "passage_text": "Numerous reptiles that are either endangered, threatened or species of concern live within the Highlands. The Timber Rattlesnake (Crotalus horidus) is the only snake that is on the state endangered list (threatened in New York) and on of the most vulnerable of all endangered species."}, {"url": "http://www.njhighlandscoalition.org/HTML/high_resources.html", "passage_text": "Moreover, forests provide habitat to plants and animals, and preserve biodiversity. The New Jersey Highlands have exceptionally diverse natural communities. Black bear, river otters, bobcat and wild trout make their homes in the region, as do many other species of mammals, fish, amphibians and reptiles."}, {"url": "http://www.bbc.co.uk/news/uk-scotland-highlands-islands-21279331", "passage_text": "Image caption A beaver has been among some of the unusual animals to have been found in the Highlands and Islands. A large Eurasian eagle owl has been causing a flap in Inverness. But it is not the only non-native species or unusual creature to have caused a stir"}, {"url": "http://highlandskrma.weebly.com/animals-and-vegetation.html", "passage_text": "The Beautiful Highlands ! This part is all about Vegetation of the highlands. Highlands have so much vegetation because of there fertile soil. Very healthy soil. Also, made with natural grass. if you were able to visit a part of a highland, you would see grass everywhere."}, {"url": "http://www.njhighlandscoalition.org/HTML/high_resources.html", "passage_text": "Seventy-two New Jersey-listed endangered, threatened and rare animal species live in the New Jersey Highlands, including mammals, birds, amphibians, reptiles, butterflies, dragonflies, damselflies and mussels. Three species — the Indiana bat, bog turtle, and bald eagle — are Federally-listed."}, {"url": "http://www.njhighlandscoalition.org/HTML/hr_natural.html", "passage_text": "Seventy-two New Jersey-listed endangered, threatened and rare animal species live in the New Jersey Highlands, including mammals, birds, amphibians, reptiles, butterflies, dragonflies, damselflies and mussels. Three species — the Indiana bat, bog turtle, and bald eagle — are Federally-listed."}, {"url": "http://highlandskrma.weebly.com/animals-and-vegetation.html", "passage_text": "This is the page about the wonderful animals of the Highlands. Well the highlands can be a range of biomes from forest to tundra. The type of biome depends on the vegetation and the animals. For Tundra types there wont be much of any vegetation so their wont be a lot of plant eating animals."}, {"url": "http://www.answers.com/Q/What_kind_of_animals_live_in_a_highland", "passage_text": "Many animals but it depends which highlands. The snow leopard and markhor live in the highlands of Tibet and the Himalayan mountains while the Ethiopian wolf lives in the Ethiopian highlands so many animals live there but you need to be specific about"}]