[{"url": "http://www.sespoly.com/products/tpr-thermoplastic-rubber/", "passage_text": "TPR: Thermoplastic Rubber. S&E Specialty Polymers is a leading manufacturer of Thermoplastic Rubber (TPR) Compounds that are available for a wide-range of applications. These compounds are formulated using Styrene-Butadiene-Styrene (SBS) or Styrene-Ethylene/Butylene-Styrene (SEBS) block co-polymers. "}, {"url": "http://www.plasticseurope.org/what-is-plastic/types-of-plastics-11148/thermoplastics.aspx", "passage_text": "A thermoplastic is a type of plastic made from polymer resins that becomes a homogenized liquid when heated and hard when cooled. When frozen, however, a thermoplastic becomes glass-like and subject to fracture. These characteristics, which lend the material its name, are reversible. History. Celluloid, which is considered the first thermoplastic, made its appearance in the mid-1800s and reigned in the industry for approximately 100 years. During its peak production, it was used as a substitute for ivory."}, {"url": "http://www.wisegeek.com/what-is-thermoplastic.htm", "passage_text": "In fact, this is usually the case when a thermoplastic is being used for plastic injection molding or extrusion. The specific action of a plasticizer is to lower the material’s glass transition temperature (Tg), which is the point it becomes brittle when cooled and soft when heated. Polycarbonate, a common type of thermoplastic, is used in eyeglass lenses. Polyethylene, one of the most common thermoplastics, is often used in shampoo bottles. A toy with thermoplastic parts. Thermoplastic has been used to create bullet proof vests."}, {"url": "https://www.swarco.com/en/Products-Services/Traffic-Materials/Thermoplastic-Markings", "passage_text": "The hot alternative. Thermoplastic is a hot-applied road marking compound for the creation of highly reflective stripings with long-term performance. Thermoplastic is based on either alkyd or hydrocarbon resins and contains a significant portion of premix glass beads. The material is available as powder or in preformed blocks."}, {"url": "https://en.wikipedia.org/wiki/Thermoplastic_elastomer", "passage_text": "Thermoplastic elastomers (TPE), sometimes referred to as thermoplastic rubbers, are a class of copolymers or a physical mix of polymers (usually a plastic and a rubber) which consist of materials with both thermoplastic and elastomeric properties. "}, {"url": "http://www.wisegeek.com/what-is-thermoplastic.htm", "passage_text": "Acrylonitrile butadiene styrene, a type of thermoplastic, is used to make LEGO® blocks. Polycarbonate, a common type of thermoplastic, is used in eyeglass lenses. Polyethylene, one of the most common thermoplastics, is often used in shampoo bottles. A toy with thermoplastic parts. Thermoplastic has been used to create bullet proof vests."}, {"url": "https://en.wikipedia.org/wiki/Thermoplastic", "passage_text": "Thus, thermoplastics may be reshaped by heating and are typically used to produce parts by various polymer processing techniques such as injection molding, compression molding, calendering, and extrusion. Polyether sulfone (PES) is a class of specially engineered thermoplastics with high thermal, oxidative, and hydrolytic stability, and good resistance to aqueous mineral acids, alkalis, salt solutions, oils and greases."}, {"url": "http://www.wisegeek.com/what-is-thermoplastic.htm", "passage_text": "These 10 animal facts will amaze you. A thermoplastic (sometimes written as thermo plastic) is a type of plastic made from polymer resins that becomes a homogenized liquid when heated and hard when cooled. When frozen, however, a thermoplastic becomes glass-like and subject to fracture. Polycarbonate, a common type of thermoplastic, is used in eyeglass lenses. Polyethylene, one of the most common thermoplastics, is often used in shampoo bottles. A toy with thermoplastic parts. Thermoplastic has been used to create bullet proof vests."}, {"url": "http://www.thefreedictionary.com/thermoplastic", "passage_text": "1. thermoplastic-a material that softens when heated and hardens again when cooled. thermoplastic resin. plastic-generic name for certain synthetic or semisynthetic materials that can be molded or extruded into objects or films or filaments or used for making e.g. coatings and adhesives. 1. (Chemistry) (of a material, esp a synthetic plastic or resin) becoming soft when heated and rehardening on cooling without appreciable change of properties. Compare thermosetting. n. 2. (Chemistry) a synthetic plastic or resin, such as polystyrene, with these"}, {"url": "http://onlinemanuals.txdot.gov/txdotmanuals/pmh/pavement_marking_material_descriptions.htm", "passage_text": "Heated-in-place thermoplastic is a preformed thermoplastic that has been shaped by the manufacturer into its final shape and thickness and includes a top layer of beads. These materials must conform to DMS-8240 and are classified by TxDOT in this specification as Type C. The temperature of the thermoplastic material is a very important factor in the performance of the thermoplastic-roadway surface bond. Suitable application temperatures range from 400–450°F, with 420°F as the recommended temperature for most applications."}]