[{"url": "http://www.wikiprofessional.org/Radiologist", "passage_text": "Radiologists also need to earn a state-based license before they can legally practice. It takes at least 13 years of postsecondary education and clinical training to become a diagnostic radiologist. That includes a 4-year bachelor education, 4 years of medical school, a year-long internship, and 4 years of residency."}, {"url": "http://study.com/radiologist_education.html", "passage_text": "Education Requirements for Radiologists. Radiologists are highly educated professionals. The road to a career as a radiologist typically begins with earning a bachelor's degree. Medical school prerequisite courses include biology, chemistry and physics. A number of undergraduate students opt to work or volunteer in medical settings to gain experience"}, {"url": "http://learn.org/articles/Radiologist_How_to_Become_a_Radiologist_in_5_Steps.html", "passage_text": "How to Become a Radiologist in 5 Steps. Research what it takes to become a radiologist. Learn about education requirements, salary, and potential job growth to find out if this is the career for you. Schools offering Cardiovascular Sonography degrees can also be found in these popular choices. "}, {"url": "http://study.com/articles/Radiologist_Educational_Overview_for_a_Career_in_Radiology.html", "passage_text": "Radiologist: Educational Overview for a Career in Radiology. Learn about the education and preparation needed to become a radiologist. Get a quick view of the requirements as well as details about education and job responsibilities to find out if this is the career for you. Radiologists are doctors who specialize in diagnosing patients through the use of medical imaging achieved through X-rays, nuclear medicine, ultrasounds, mammography, computer tomography and magnetic resonance imaging (MRI). Radiologists manage diseases by treating patients with radiation and image-guided surgery"}, {"url": "http://learn.org/articles/What_Are_the_Education_Requirements_to_be_a_Radiologist.html", "passage_text": "Radiologists rely on x-rays and other imaging machines to help monitor health in several areas, such as dental health, cancer, or broken bones. Read on to discover what the education requirements are for radiologists. To become a radiologist, you must go to medical school for four years after attending undergraduate school. As a medical student, you'll spend the first two years completing basic medical and science coursework in laboratories and classrooms. Courses usually include: 1  Pathology. 2  Anatomy. 3  Molecular biology. 4  Immunology."}, {"url": "http://www.educationrequirements.org/radiologist.html", "passage_text": "Radiologist Education Requirements. Radiologist education succumbs to the technical liberation in the use of machines and equipments for detecting and diagnosing biological malfunctioning. Radiologists study the illustrations and images procured from the tools and prepare reports on their basi"}, {"url": "http://learn.org/articles/What_Are_the_Education_Requirements_to_be_a_Radiologist.html", "passage_text": "Field Overview. To work as a radiologist, you'll first need to become a licensed physician and specialize in medical imaging. You'll examine images from ultrasounds, x-rays, magnetic resonance imaging (MRI), and other radiographic devices to diagnose your patients' illnesses. To become a radiologist, you must go to medical school for four years after attending undergraduate school. As a medical student, you'll spend the first two years completing basic medical and science coursework in laboratories and classrooms. Courses usually include: 1  Pathology. 2  Anatomy. 3  Molecular biology. 4  Immunology."}, {"url": "http://study.com/radiologist_education.html", "passage_text": "A radiologist is a physician who specializes in using medical imaging techniques, such as X-ray and magnetic resonance imaging (MRI), to diagnose and treat diseases or injuries. Education is extensive and includes completion of a bachelor's degree, medical school and a residency. Medical licensure is required. Radiologists are highly educated professionals. The road to a career as a radiologist typically begins with earning a bachelor's degree. Medical school prerequisite courses include biology, chemistry and physics."}]