[{"url": "http://www.thedailybeast.com/articles/2015/07/27/quaaludes-cosby-s-alleged-rape-drugs-of-choice-were-somehow-even-scarier-than-you-think.html", "passage_text": "And I felt wonderful.”. Of course, that’s Jordan Belfort. We don’t know the exact dosage of the Quaaludes Cosby used on his victims. In the 1970s, the standard prescription doses were 75mg or 125mg, and so that was likely the dosage he received from his doctor. "}, {"url": "http://www.pbs.org/newshour/rundown/what-are-quaaludes/", "passage_text": "Actor and comedian Bill Cosby testified in a 2005 civil lawsuit that he acquired Quaaludes “with the intent of giving them to young women to have sex with” and admitted to giving the sedative to at least one woman, the Associated Press reported Monday. Hypnotics are drugs that induce sleep. Methaqualone’s sedative quality was first noted in the 1950s and researchers found it could fight malaria, but it wasn’t patented until 1962. In the 1960s, the drug was prescribed as a sedative mostly in Britain and later caught on as a sleep aid in the United States in the 1970s."}, {"url": "http://time.com/3947705/quaaludes-bill-cosby/", "passage_text": "Interest in quaaludes, a powerful sedative popular among housewives in the 1960s and disco partiers in the 70s and 80s, has peaked again following revelations about disgraced comedian Bill Cosby’s use of the drug. "}, {"url": "http://www.testcountry.com/wiki/methaqualone-facts-drug-testing.html", "passage_text": "Methaqualone is a man-made drug that generally depresses the central nervous system. Like barbiturates, it is also known as a sedative-hypnotic drug, which induces sleep to anyone that uses it. Components of Methaqualone. Methaqualone is a synthetic drug. It is made in the laboratories out of several chemicals to imitate the effects of barbiturates. Its key ingredients include anthranilic acid, N-acetyl-anthranilic acid, and N-acetyl-o-toluidine."}, {"url": "https://en.wikipedia.org/wiki/Methaqualone_in_popular_culture", "passage_text": "It has also been used illegally as a recreational drug, commonly known as Quaaludes (/ˈkweɪljuːdz/ KWAY-lewdz), particularly in the 1970s in North America, or as Mandrax (methaqualone 250 mg combined with diphenhydramine 25 mg). Main article: Methaqualone. Methaqualone is a sedative-hypnotic drug similar in effect to barbiturates, a general CNS depressant. Its use peaked in the 1960s and 1970s as a hypnotic for the treatment of insomnia, and as a sedative and muscle relaxant."}, {"url": "https://en.wikipedia.org/wiki/Methaqualone", "passage_text": "Methaqualone is one of the most commonly used recreational drugs in South Africa. It is also popular elsewhere in Africa and in India. Commonly known as Mandrax, M-pills, buttons, or smarties, a mixture of crushed mandrax and cannabis is smoked, usually through a smoking pipe made from the neck of a broken bottle. Methaqualone is not recommended for use while pregnant and is in pregnancy category D. In Canada, methaqualone is listed in Schedule III of the Controlled Drugs and Substances Act and requires a prescription. It is banne"}, {"url": "http://www.addictionhope.com/quaaludes/", "passage_text": "Quaaludes are the brand name for the sedative-hypnotic drug Methaqualone, which function in the body as a general central nervous system depressant. Quaaludes come in the form of a tablet or capsule. They are tasteless, odorless, and are relatively inexpensive to obtain. When used recreationally, Quaaludes are crushed and mixed with marijuana and smoked or liquefied and injected. Street names for Quaaludes are “Lemmons”, “714s”, “Ludes”, “quacks”, “soapers”, “Dr."}, {"url": "https://en.wikipedia.org/wiki/Methaqualone", "passage_text": "Methaqualone, sold under the brand name Quaalude (\\ˈkwā-ˌlued\\), ˌlüd in THE us And mandrax in THE, uk is a sedative and hypnotic. Medication it is a member of the quinazolinone. class Methaqualone is not recommended for use while pregnant and is in pregnancy category D. In Canada, methaqualone is listed in Schedule III of the Controlled Drugs and Substances Act and requires a prescription. It is banned in India."}, {"url": "http://www.wisegeek.org/what-are-quaaludes.htm", "passage_text": "Quaaludes were the most popular brand of a medical drug called methaqualone. Healthcare professionals prescribed it for a wide range of conditions, including sleeplessness and anxiety. Recreational users began experimenting with it, and “ludes” quickly became an equally popular non-medical drug in many countries. Quaaludes were originally prescribed for things like sleeplessness and anxiety, but have since been made illegal because of their addictiveness. Methaqualone is classified as a hypnotic sedative and was originally prescribed to treat anxiety and relax muscles."}]