[{"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-940-MELATONIN.aspx?activeIngredientId=940&activeIngredientName=MELATONIN", "passage_text": "Melatonin is POSSIBLY SAFE when used by mouth appropriately, long-term. Melatonin has been used safely for up to 2 years in some people. However, it can cause some side effects including headache, short-term feelings of depression, daytime sleepiness, dizziness, stomach cramps, and irritability. Do not drive or use machinery for four to five hours after taking melatonin. Melatonin is also used for some of the side effects of cancer treatment (chemotherapy) including weight loss, nerve pain, weakness, and a lowered number of clot-forming cells (thrombocytopenia). It is also used to calm people before they are given anesthesia for surgery."}, {"url": "http://www.everydayhealth.com/drugs/melatonin", "passage_text": "Melatonin is a hormone that's naturally found in the body. A synthetic version of melatonin is available as a supplement that's used to treat sleep disorders and other problems. It's not known whether melatonin is effective in treating any specific medical condition. The Food and Drug Administration (FDA) has not approved the supplement for medicinal use. Melatonin is used as an alternative medicine to help conditions such as insomnia, sleep disorders in blind people, delayed sleep phase syndrome (DSPS), and sleep problems in children with developmental or psychiatric disorders."}, {"url": "http://www.livescience.com/42066-melatonin-supplement-facts.html", "passage_text": "Melatonin is a hormone produced naturally by the pineal gland in response to darkness. Levels remain high during sleep until the pineal gland tapers off production in response to light. Melatonin's effects on sleep, other hormones and cancer are the reason it has been studied ever since its discovery in the 1950s. In the mid-1990s, synthetic melatonin became available as a nutritional supplement."}, {"url": "http://www.webmd.com/sleep-disorders/tc/melatonin-overview", "passage_text": "Melatonin is a hormone made by the pineal gland, a small gland in the brain. Melatonin helps control your sleep and wake cycles. Very small amounts of it are found in foods such as meats, grains, fruits, and vegetables. You can also buy it as a supplement. During health exams, tell your doctor if you are taking melatonin. And tell your doctor if you are having trouble sleeping (insomnia), because it may be related to a medical problem. In adults, melatonin is taken in doses from 0.2 mg to 20.0 mg, based on the reason for its use."}, {"url": "http://www.livescience.com/42066-melatonin-supplement-facts.html", "passage_text": "Occasionally, melatonin is used as a complementary medicine in cancer treatment for breast, brain, lung, prostate, head and neck, or gastrointestinal cancer. Melatonin is sometimes used to mitigate the side effects of chemotherapy including weight loss, nerve pain, weakness and a condition called thrombocytopenia. Melatonin's effects on sleep, other hormones and cancer are the reason it has been studied ever since its discovery in the 1950s. In the mid-1990s, synthetic melatonin became available as a nutritional supplement."}, {"url": "http://umm.edu/health/medical/altmed/supplement/melatonin/", "passage_text": "Overview. Melatonin is a hormone secreted by the pineal gland in the brain. It helps regulate other hormones and maintains the body's circadian rhythm. The circadian rhythm is an internal 24-hour clock that plays a critical role in when we fall asleep and when we wake up. When it is dark, your body produces more melatonin."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-940-MELATONIN.aspx?activeIngredientId=940&activeIngredientName=MELATONIN", "passage_text": "Melatonin is a hormone found naturally in the body. Melatonin used as medicine is usually made synthetically in a laboratory. It is most commonly available in pill form, but melatonin is also available in forms that can be placed in the cheek or under the tongue. Melatonin is also used for some of the side effects of cancer treatment (chemotherapy) including weight loss, nerve pain, weakness, and a lowered number of clot-forming cells (thrombocytopenia). It is also used to calm people before they are given anesthesia for surgery."}, {"url": "http://familydoctor.org/familydoctor/en/drugs-procedures-devices/over-the-counter/melatonin.html", "passage_text": "Melatonin is a hormone made by a part of the brain called the pineal (say: pie-nee-all) gland. Melatonin may help our bodies know when it's time to go to sleep and when it's time to wake up. Melatonin supplements (in pill form) are also available. Two types of melatonin may be used in these pills: natural and synthetic (manmade). Natural melatonin is made from the pineal gland of animals. This form could be contaminated with a virus so it is not recommended."}]