[{"url": "https://en.wikipedia.org/wiki/Market_orientation", "passage_text": "Market orientation perspectives include the decision-making perspective (Shapiro, 1988), market intelligence perspective (Kohli and Jaworski, 1990), culturally based behavioural perspective (Narver and Slater, 1990), strategic perspective (Ruekert, 1992) and customer orientation perspective (Deshpande et al., 1993). While Kohli and Jaworski (1990) consider market orientation as the implementation of the marketing concept, Narver and Slater (1990) consider it to be an organisational culture."}, {"url": "http://www.netmba.com/marketing/concept/", "passage_text": "The marketing concept is the philosophy that firms should analyze the needs of their customers and then make decisions to satisfy those needs, better than the competition. Today most firms have adopted the marketing concept, but this has not always been the case. "}, {"url": "http://www.investopedia.com/terms/m/market-orientation.asp", "passage_text": "DEFINITION of 'Market Orientation'. A company philosophy focused on discovering and meeting the needs and desires of its customers through its product mix. BREAKING DOWN 'Market Orientation'. As was proved in the recent history of the automobile industry, the idea that companies can create a product and sell its features to an eager buying public is no longer concrete."}, {"url": "https://en.wikipedia.org/wiki/Marketing", "passage_text": "Many companies today have a customer focus (or market orientation). This implies that the company focuses its activities and products on consumer demands. Generally, there are three ways of doing this: the customer-driven approach, the market change identification approach and the product innovation approach. Other caveats of customer focus are: 1  The extent to which what customers say they want does not match their purchasing decisions. 2  Thus surveys of customers might claim that 70% of a restaurant's customers want healthier choices on the menu, but only 10% of them actually buy the new items once they are offered."}, {"url": "http://www.investopedia.com/terms/m/market-orientation.asp", "passage_text": "In essence, market orientation can be thought of as a coordinated marketing campaign between a company and its customers. BREAKING DOWN 'Market Orientation'. As was proved in the recent history of the automobile industry, the idea that companies can create a product and sell its features to an eager buying public is no longer concrete."}, {"url": "https://en.wikipedia.org/wiki/Marketing", "passage_text": "The oldest – and perhaps simplest and most natural form of marketing – is 'word of mouth' (WOM) marketing, in which consumers convey their experiences of a product, service or brand in their day-to-day communications with others. Other caveats of customer focus are: 1  The extent to which what customers say they want does not match their purchasing decisions. 2  Thus surveys of customers might claim that 70% of a restaurant's customers want healthier choices on the menu, but only 10% of them actually buy the new items once they are offered."}, {"url": "https://en.wikipedia.org/wiki/Marketing", "passage_text": "Marketing is about communicating the value of a product, service or brand to customers or consumers for the purpose of promoting or selling that product, service, or brand. Other caveats of customer focus are: 1  The extent to which what customers say they want does not match their purchasing decisions. 2  Thus surveys of customers might claim that 70% of a restaurant's customers want healthier choices on the menu, but only 10% of them actually buy the new items once they are offered."}, {"url": "http://www.exforsys.com/career-center/marketing-management/marketing-orientation.html", "passage_text": "The term is otherwise known as marketing concept or consumer focus. With marketing orientation, a business revolves its strategic decisions around the wants and needs of the target market, including potential customers. A company that is marketing-orientated has the commitment to valuing customers and the customers’ needs. Product Orientation. As the term clearly implies, a business organization that makes use of product orientation primarily focuses on product quality. A company believes that if the products offered in the market are of good quality and high standard, customers are sure to buy and take advantage of it."}]