[{"url": "https://answers.yahoo.com/question/index?qid=20080619130214AA2HSIO", "passage_text": "Best Answer: How long do I cook a precooked ham? It is 15 lbs. A precooked ham does not have to be cooked, but will taste better if you heat it thoroughly to an internal temperature of 140°F (60°C) or so. Place the ham in a 325°F oven (163°C). It will take 12 to 15 minutes per pound for a whole or boneless ham and 18 to 20 minutes per pound for a half ham. "}, {"url": "http://busycooks.about.com/od/howtocook/a/howtocookham.htm", "passage_text": "1 Bake at 325°F for 18-20 minutes per pound, until a meat thermometer registers 140°F. 2  Unwrap the ham and apply the glaze; increase the heat to 400°F and bake for 15-20 minutes longer until the glaze is burnished. 1 The best way to do this is to place the ham on a rack in a roasting pan. 2  Add water to the bottom of the pan and cover the whole thing tightly with foil. 3  Bake at 325°F for 18-20 minutes per pound, until a meat thermometer registers 140°F."}, {"url": "http://busycooks.about.com/od/howtocook/a/howtocookham.htm", "passage_text": "1 If you want to glaze the ham, place on a broiler pan and cover with glaze; broil 10 from the heat for 10-15 minutes, watching carefully, until glaze is cooked. 2  Oven Method. 3  The goal is to reheat the ham without drying it out. 4  The best way to do this is to place the ham on a rack in a roasting pan. 1 The best way to do this is to place the ham on a rack in a roasting pan. 2  Add water to the bottom of the pan and cover the whole thing tightly with foil. 3  Bake at 325°F for 18-20 minutes per pound, until a meat thermometer registers 140°F."}, {"url": "http://southernfood.about.com/cs/hamrecipes/ht/heat_ham.htm", "passage_text": "1 Preheat the oven to 350°F. 2  If the ham is labeled 'fully cooked' (does not require heating), heat for 8 to 10 minutes per pound, or to an internal temperature of 140°F. 3  If the ham is labeled 'cook before eating,' heat to an internal temperature of 160°F. Here's How: 1  First, check the label for instructions. 2  It should be labeled 'fully cooked' or 'cook before eating.'. 3  Preheat the oven to 350°F. 4"}, {"url": "http://southernfood.about.com/cs/hamrecipes/ht/heat_ham.htm", "passage_text": "Here's How: 1  First, check the label for instructions. 2  Preheat the oven to 350°F. 3  If the ham is labeled 'fully cooked' (does not require heating), heat for 8 to 10 minutes per pound, or to an internal temperature of 140°F. 4  If the ham is labeled 'cook before eating,' heat to an internal temperature of 160°F. Here's How: 1  First, check the label for instructions. 2  It should be labeled 'fully cooked' or 'cook before eating.'. 3  Preheat the oven to 350°F. 4"}, {"url": "http://www.answers.com/Q/How_long_do_you_cook_a_precooked_or_smoked_ham", "passage_text": "Duh. You do not need to cook precooked ham. This is not a duh question... You need to at least bake it or put it on the pit (indirect heat) at 350 degrees for about 7 minute … s per pound. By cooking it, the ham will be tender and all the flavors will be released"}, {"url": "http://www.answers.com/Q/How_long_do_you_cook_a_precooked_or_smoked_ham", "passage_text": "2 1/2 hours. Here's how: Preheat the oven to 325, place the ham on a rack in a baking dish with a little water in the bottom. Wrap in foil, bake for about 2 hours, or until th … e internal temperature is 135 - 140 degrees. You do not need to cook precooked ham. This is not a duh question... You need to at least bake it or put it on the pit (indirect heat) at 350 degrees for about 7 minute … s per pound."}, {"url": "http://ochef.com/473.htm", "passage_text": "It is 15 lbs. A precooked ham does not have to be cooked, but will taste better if you heat it thoroughly to an internal temperature of 140°F (60°C) or so. Place the ham in a 325°F oven (163°C). It will take 12 to 15 minutes per pound for a whole or boneless ham and 18 to 20 minutes per pound for a half ham. You should also let it rest for 20 minutes or so out of the oven before you serve it. "}, {"url": "http://busycooks.about.com/od/howtocook/a/howtocookham.htm", "passage_text": "1 Bake in a preheated 325°F oven for 10-14 minutes per pound, or until a meat thermometer registers 140°F. Remove from oven and let sit for 10 minutes before serving. 2  If the ham came with extra glaze, follow the package directions for adding it and cooking the glaze. 1 The best way to do this is to place the ham on a rack in a roasting pan. 2  Add water to the bottom of the pan and cover the whole thing tightly with foil. 3  Bake at 325°F for 18-20 minutes per pound, until a meat thermometer registers 140°F."}]