[{"url": "http://www.learner.org/jnorth/search/FrogNotes2.html", "passage_text": "Q. How long does a frog usually live? A. Frogs can live for may years, unless they are eaten by another predator or die of accidental causes or illness. Q. Why do frogs make such a ruckus in the spring? A. It's the male frogs you hear, and they croak like crazy in the spring to attract females of their species. A. Jelly-like masses of eggs are called frog's spawn. Here's how frog spawn happens: A female frog lays eggs under water, usually in the spring. She may lay as many as 20,000 eggs. The male frog climbs on her back and fertilizes the eggs as they are laid."}, {"url": "http://www.topmarks.co.uk/Spring/TadpolesHatch.aspx?age=ks2", "passage_text": "Around three weeks after spawning the tadpoles hatch out from their eggs. They are each about 12mm long. They still feed from the old jelly mass and any algae which is growing on it. At this time most of the tadpoles seem to be together. "}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20080408072302AA1l4rv", "passage_text": "Report Abuse. When first laid, frogs' eggs are small, pearlescent droplets a couple of millimetres across. They emerge from the female at a rate of one every few seconds, until she has laid 100 or more balls of jelly in the water. A few days more and the vegetarian tadpoles turn carnivorous. In a healthy pond, there is plenty of food for the growing froglets, but if you put too much frogspawn into a clean tank, the tadpoles may end up cannibalising each other. Not a pretty sight for young children to watch."}, {"url": "http://www.learner.org/jnorth/search/FrogNotes2.html", "passage_text": "Depending on the species, it can take a few weeks to a year or more for the tadpoles to grow up. frogs who live in dry places where rains are seasonal have to grow up quickly because the tadpoles will die if their temporary ponds dry up first. Copyright 1997-2015 Journey North. A. Jelly-like masses of eggs are called frog's spawn. Here's how frog spawn happens: A female frog lays eggs under water, usually in the spring. She may lay as many as 20,000 eggs. The male frog climbs on her back and fertilizes the eggs as they are laid."}, {"url": "http://www.seasonofspring.com/tadpolefrog.html", "passage_text": "How long does it take for tadpoles to change into froglets? Depending on the weather and size, it can take one-two days or up to 10-12 weeks for the tadpoles to metamorphosis into frogs. If the clutch of eggs are layed in cold water, it could take longer for the eggs to hatch. As the tadpoles change into froglets. Clean water for the tadpoles. Be sure to use fresh clean water in the tadpole’s container. This water should come from a non polluted pond or stream. Be sure that you Do Not use water straight from a tap as it contains chemicals that will kill"}, {"url": "http://allaboutfrogs.org/weird/general/cycle.html", "passage_text": "After about 9 weeks, the tadpole looks more like a teeny frog with a really long tail. It is now well on it's way to being almost fullgrown! Young Frog, or Froglet. By 12 weeks, the tadpole has only a teeny tail stub and looks like a miniature version of the adult frog. "}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20080408072302AA1l4rv", "passage_text": "Once the tadpoles hatch, the jelly provides food for all kinds of other pond-dwellers. A week or two later, the eggs start to break down, and all that is left is a mass of brown-ish things that could be vegetation, or worms, or something else. In reality, they are young tadpoles. A few days more and the vegetarian tadpoles turn carnivorous. In a healthy pond, there is plenty of food for the growing froglets, but if you put too much frogspawn into a clean tank, the tadpoles may end up cannibalising each other. Not a pretty sight for young children to watch."}, {"url": "http://allaboutfrogs.org/info/tadpoles/", "passage_text": "So if it's cold and your tadpoles don't seem to be growing up very fast, it's no reason to panic. The length of time a tadpole takes to develop really depends on what kind of frog it came from! I've even heard that some tadpoles can remain in their tadpole stage as long as 8 months, while others only take 6 to 9 weeks! When the tadpoles start getting close to developing legs, they will need some sort of perch so they can get out of the water. "}, {"url": "http://www.answers.com/Q/How_long_does_it_take_for_frogspawn_to_grow_into_tadpoles", "passage_text": "Frog eggs have a gestation period of around one week, until hatching into tadpoles. However this varies with the particular species of frog. Actually, a tadpole is what … hatches from a frog's eggs. In this part of the frog's life cycle, they grow legs and frog features which can take anywhere from a few weeks to a few months, depending on the type of frog."}, {"url": "http://www.answers.com/Q/How_long_does_it_take_frogspawn_to_turn_into_a_frog", "passage_text": "Frog eggs have a gestation period of around one week, until hatching into tadpoles. However this varies with the particular species of frog. A week or two depending on how long ago it hatched. It always depends on the species. A tree frog took about 5 weeks (a little over a month), and a bullfrog tadpole took 2 y … ears! Usually, tree frogs and smaller frogs take less time while massive frogs such as bullfrogs, pacman frogs, and others take years."}]