[{"url": "http://www.uncw.edu/int/careers.html", "passage_text": "As an interdisciplinary program, International Studies exposes students to a variety of courses from different perspectives in hopes of producing students of the world or global citizens, in other words, people who think critically about global issues and problems. "}, {"url": "https://en.wikipedia.org/wiki/International_studies", "passage_text": "From Wikipedia, the free encyclopedia. International Studies (IS) generally refers to the specific university degrees and courses which are concerned with the study of ‘the major political, economic, social, and cultural issues that dominate the international agenda’. As discussed, the study of the International Studies discipline in Australia occurs mostly within universities and generally approaches the subject as a holistic study of international affairs and phenomena. The study is also offered in some Australian high schools."}, {"url": "https://en.wikipedia.org/wiki/International_studies", "passage_text": "The International Studies discipline is usually offered as either part of an arts degree or as a specialist arts degree. As such, students are able to select from a very broad range of subjects to undertake. However, some areas of study which are regularly offered include: As discussed, the study of the International Studies discipline in Australia occurs mostly within universities and generally approaches the subject as a holistic study of international affairs and phenomena. The study is also offered in some Australian high schools."}, {"url": "http://www.pdx.edu/careers/what-can-i-do-degree-international-studies", "passage_text": "Places of Employment. A major in international studies helps students develop transferable skills that are valued by employers. These skills include: analysis, research, writing, problem solving, and knowledge of other cultures and languages. This is a list of jobs international studies majors reported having at graduation. It was generated from survey data published by colleges and universities across the United States."}, {"url": "http://www.lse.ac.uk/study/undergraduate/DegreeProgrammes2016/internationalRelations/overview_and_features.aspx", "passage_text": "Overview. International relations is the study of an international system composed of territorial states which acknowledge no superior authority over matters which they consider of vital interest. It deals with the nature of the changing relations between states and with non-state actors"}, {"url": "https://ir.cas2.lehigh.edu/", "passage_text": "Come to Know World Politics Lehigh is among the very few major universities in the United States with a separate Department of International Relations (IR). Lehigh's distinctive organization is matched by the excellence of its teaching and research programs. Careers in International Affairs. A major in international relations prepares students for careers in government, journalism, law, non-governmental organizations, international business, and teaching and research."}, {"url": "https://en.wikipedia.org/wiki/International_studies", "passage_text": "International Studies is often related to or attached to the study in International Relations. At the University of Oxford, the Centre for International Studies exists to promote and advance research in International Relations. As discussed, the study of the International Studies discipline in Australia occurs mostly within universities and generally approaches the subject as a holistic study of international affairs and phenomena. The study is also offered in some Australian high schools."}, {"url": "https://en.wikipedia.org/wiki/International_relations", "passage_text": "International relations (IR) or international affairs, depending on academic institution, is either a field of political science or an interdisciplinary academic field similar to global studies, in which students take a variety of internationally focused courses in social science and humanities disciplines. 1 Diplomacy is the practice of communication and negotiation between representatives of states. 2  To some extent, all other tools of international relations can be considered the failure of diplomacy. 3  Keeping in mind, the use of other tools are part of the communication and negotiation inherent within"}, {"url": "http://miamioh.edu/academics/majors-minors/majors/international-studies.html", "passage_text": "The major includes an interdisciplinary core of study in world politics, international economics, world history, political geography, intercultural relations (anthropology), and foreign language. In addition, you choose a concentration requirement. "}]