[{"url": "http://noun1.com/start-o/", "passage_text": "Nouns that start with o. Home &nbsp | &nbsp Back to Top. Nouns starting with the letter O are listed here. Many types of nouns are shown which can be helpful for writing engaging text. oak, oath, oathe, oatmeal."}, {"url": "http://www.momswhothink.com/reading/list-of-nouns.html", "passage_text": "A possessive noun is a noun that names who or what has something. The possessive form is used with nouns referring to people, groups of people, countries, and animals. It also refers to where someone works or plays or spends their time. Add an apostrophe and s ('s) to form the possessive of most singular nouns (ex."}, {"url": "http://www.wordfind.com/starts-with/noun/", "passage_text": "A list of words that start with Noun (words with the prefix Noun). We search a large scrabble dictionary for scrabble words starting with noun-we take the letter or word you enter, and generate all words starting with Noun. In addition there is a list of Words that end with noun, words that contain noun. Search for words that start with a letter or word:"}, {"url": "http://esl.about.com/library/vocabulary/bl1000_list_noun1.htm", "passage_text": "These 50 nouns cover the letters A, B, and C of the 1,000 most common word list provided by Jerry Jones. Each noun has an example sentence with the most common usage of each noun, and, when possible, contextual clues to help you learn common collocations (words that often go with each other)."}, {"url": "http://nounsstarting.com/with-o/", "passage_text": "Nouns that Start with O. There are many nouns, and all of them have different meanings and uses. For people that is involved in the English language learning new nouns could be very useful to improve their writing."}, {"url": "http://noun1.com/start-o/", "passage_text": "ozone. There are many other posts on Noun1.com to view that are like the above O nouns list but which start with different letters. Of all the parts of speech used in constructing a sentence, the noun is one of the most important, and these examples of nouns beginning with O can hopefully help one find the perfect word."}]