[{"url": "https://en.wikipedia.org/wiki/List_of_the_verified_oldest_people", "passage_text": "The oldest verified person ever was French woman Jeanne Calment (1875-1997), who died at the age of 122 years, 164 days. For other validated supercentenarian cases listed below, the GRG list of validated supercentenarian cases can be used. "}, {"url": "http://www.nbcnews.com/news/other/123-year-old-bolivian-man-oldest-living-person-ever-documented-f6C10934840", "passage_text": "Like most Bolivian highlands peasants, he has been chewing it all his life. Guinness World Records says the oldest living person verified by original proof of birth is Misao Okawa, a 115-year-old Japanese woman. The oldest verified age was 122 years and 164 days: Jeanne Calment of France, who died in 1997. Carmelo Flores Laura, a native Aymara, walks near his home in the village of Frasquia, Bolivia, Tuesday, Aug. 13, 2013. If Bolivia's public records are correct, Flores is the oldest living person ever documented. They say he turned 123 a month ago."}, {"url": "http://www.usatoday.com/story/news/world/2014/09/05/six-people-still-alive-who-were-born-in-the-19th-century/15122367/", "passage_text": "The second-oldest person in the world also is America's oldest person. The daughter of sharecroppers who witnessed the Civil War, Gertrude Weaver was born in southwest Arkansas near the border with Texas and was married in 1915, according to the Associated Press. (At 122, Jeanne Calment of France, who died in 1997, was by far the oldest person to have ever lived, at least among those with verified credentials.). Okawa, who lives in an old people's community in Osaka, was born when Queen Victoria was still on the throne and the Spanish-American War was raging."}, {"url": "http://www.usatoday.com/story/news/2015/04/01/arkansas-woman-is-now-the-oldest-in-the-world/70765530/", "passage_text": "The oldest person in the world also is America's oldest person. The daughter of sharecroppers who witnessed the Civil War, Gertrude Weaver was born in southwest Arkansas near the border with Texas and was married in 1915, according to the Associated Press. In fact, the three oldest people in the world, as documented by the Guinness Book of Records, are Americans. Joining Weaver, who lives in Arkansas, are Michigan's Jeralean Talley and New York City's Susannah Mushatt Jones."}, {"url": "http://mostextreme.org/oldest_person.php", "passage_text": "If you want to know the record holder for the oldest person in the world, then you're in the right place. Jeanne Louise Calment (born in 1875 / died 1997) was the oldest living person and had the longest confirmed human life span in history, living to the age of 122 years, 164 days. She lived in Arles, France, for her entire life, and outlived both her daughter and grandson. He was the oldest undisputed man ever. He was also the first undisputed man to reach 114 and 115 years of age. The longest documented lifespan for a living person is that of 114-year-old Besse Cooper, of Georgia, United States, who was born on 26 August 1896."}, {"url": "http://mostextreme.org/oldest_person.php", "passage_text": "Tuti Yusupova (claimed birth date July 1, 1880) is an Uzbekistani who claims, at an alleged age of 130, to be the oldest living person in the world. It has been claimed that she has a birth certificate recording her as having been born in 1880, but this has not been independently verified. He was the oldest undisputed man ever. He was also the first undisputed man to reach 114 and 115 years of age. The longest documented lifespan for a living person is that of 114-year-old Besse Cooper, of Georgia, United States, who was born on 26 August 1896."}, {"url": "https://en.wikipedia.org/wiki/Oldest_people", "passage_text": "As women live longer then men, combined records for both sexes are dominated by women. The longest undisputed lifespan for a man is that of Jiroemon Kimura of Japan (1897–2013), who died at age 116 years, 54 days. He was also the world's oldest living person from December 2012 until his death. Since the death of 116-year-old Jeralean Talley of the United States on 17 June 2015, Susannah Mushatt Jones also of the United States, born 6 July 1899, is the oldest living person in the world whose age can be documented. "}, {"url": "http://www.answers.com/Q/Who_is_the_oldest_person_in_the_world", "passage_text": "Jeanne Calment, who was born on 21 February 1875, was the oldest documented person to have lived when she died on 4 August 1997, at the age of 122 years and 164 days. As of July 2015, the world's oldest living woman is  Susannah_Mushatt_Jones of Brooklyn, NY (116) born July 6,  1899.   -   The longest  documented lifespan is tha … t of Jeanne Calment of France  (1875-1997), who died at age 122 years and 164 days."}, {"url": "http://mostextreme.org/oldest_person.php", "passage_text": "The oldest undisputed lifespan for a man supercentenarian is that of Christian Mortensen, who lived to be 115 years, 252 days. He was the oldest undisputed man ever. He was also the first undisputed man to reach 114 and 115 years of age. The longest documented lifespan for a living person is that of 114-year-old Besse Cooper, of Georgia, United States, who was born on 26 August 1896."}]