[{"url": "http://www.phoenixhelix.com/2013/09/15/my-experience-with-the-paleo-autoimmune-protocol/", "passage_text": "214 thoughts on “ My Experience with the Paleo Autoimmune Protocol ”. You are so inspiring and I really need to keep in touch with you. I do pretty good on aip but not enough. We are in monsoon season here in AZ which comes with lots of humidity and pain. I think it depends on the source of the difficulty. For people with autoimmune disease, the reaction is usually to the protein and the hormones, and they are both present in all dairy, whether fermented or not. If you react to the sugar (the lactose), that can be improved through fermentation for some people."}, {"url": "http://empoweredsustenance.com/autoimmune-paleo-protocol/", "passage_text": "Mickey: I recommend people transition to a standard Paleo diet after being on the autoimmune protocol, and I think it is important to continue to include fermented foods as well as organ meats and fish. It is very important for those with autoimmune disease to stay grain-free, at the absolute minimum. Mickey: The Autoimmune Protocol is as much about the additional healing foods as the foods that are avoided. Bone broth, organ meats, fatty fish, and ferments are all an important part of the protocol, and those that do not include them do not progress the way that those who do."}, {"url": "http://www.phoenixhelix.com/2013/05/29/paleo-autoimmune-protocol-faq/", "passage_text": "If you don’t want to jump into the full autoimmune protocol yet, I recommend giving up nightshades for 30 days. If you look at the symptoms of nightshade intolerance, you’ll see a lot of fibromyalgia symptoms on the list. Here’s a link to my Nightshade-Free Survival Guide. Begin with full paleo for 3-6 months. This will be a big change already, and some people are lucky enough to go into remission with no further restrictions needed. If, after 3-6 months, you haven’t seen the results you want, then transition to the autoimmune protocol."}, {"url": "http://empoweredsustenance.com/autoimmune-paleo-protocol/", "passage_text": "Mickey: Anyone who has an autoimmune disease should try the autoimmune protocol, regardless of what organ or tissue the autoimmune disease affects – thyroid, skin, joints, connective tissue, and so on. Mickey: The Autoimmune Protocol is as much about the additional healing foods as the foods that are avoided. Bone broth, organ meats, fatty fish, and ferments are all an important part of the protocol, and those that do not include them do not progress the way that those who do."}, {"url": "http://autoimmune-paleo.com/food-reintroductions-on-the-autoimmune-protocol/", "passage_text": "All of the work of adhering to the protocol is easily gone to waste if you don’t do this part carefully. The way I approach a reintroduction is to eat a little bit of one of the foods and wait for a reaction. If you don’t get one in 2-3 days, have a meal with a lot of that same food. Then wait 3 days for a reaction. It is important that if you have a bad, long lasting reaction, wait until you are back to feeling how you were on the protocol before moving on. Thanks for leaving me a note about your experience on the protocol so far! Sounds like you are on the right track. I was surprised how quick my progress was once I decided to go 100%, as hard as it was. Acne was the first thing to go, followed by some sneaky autoimmune symptoms and finally the fatigue."}, {"url": "http://autoimmune-paleo.com/food-reintroductions-on-the-autoimmune-protocol/", "passage_text": "Food Reintroductions on the Paleo Autoimmune Protocol. by Mickey Trescott 33 Comments. One of the biggest concerns with going on the autoimmune protocol is how long to stay on the diet and how to reintroduce foods systematically. Thanks for leaving me a note about your experience on the protocol so far! Sounds like you are on the right track. I was surprised how quick my progress was once I decided to go 100%, as hard as it was. Acne was the first thing to go, followed by some sneaky autoimmune symptoms and finally the fatigue."}, {"url": "http://paleononpaleo.com/autoimmune-protocol-paleo-mom/", "passage_text": "The Paleo Autoimmune Protocol page is one of the most popular pages on this site and questions about it regularly arrive in my inbox. That tells me that a lot of people have autoimmune disease and are looking to deal with it using the paleo diet. An expert in this area is Sarah Ballantyne, aka The Paleo Mom. So if you’re suffering from autoimmune disease, her site really is a one-stop shop for you! My own experience with the AIP is that it can be very hard to stick to so I sat down for virtual coffee with Sarah, and asked her a few questions about her experience with paleo and the autoimmune protocol."}, {"url": "http://www.phoenixhelix.com/2013/05/29/paleo-autoimmune-protocol-faq/", "passage_text": "Reply ↓. It’s common to need to stay on your personalized version of the protocol for up to three years, but you don’t need to stay on the full autoimmune protocol that long. Do 30-60 days elimination period. Then test out the reintroductions (this can take many months to complete). Begin with full paleo for 3-6 months. This will be a big change already, and some people are lucky enough to go into remission with no further restrictions needed. If, after 3-6 months, you haven’t seen the results you want, then transition to the autoimmune protocol."}, {"url": "http://ultimatepaleoguide.com/autoimmune-protocol/", "passage_text": "The Beginner's Guide To The Autoimmune Protocol, 7.7 out of 10 based on 43 ratings. This is a guest post by Megan McGrane – physician’s assistant, health coach and autoimmune warrior. Find more about Megan on her site here. You can follow her on instagram and twitter. The diet focuses on a nutrient-dense intake and eliminates inflammatory and allergenic foods to support the body in cooling down the immune system (which is what’s going awry). The take home point about AIP is that if you have an autoimmune issue, you most likely have a poorly functioning digestive tract."}]