[{"url": "http://www.livescience.com/52250-lung.html", "passage_text": "The alveoli have many capillary veins in their walls. Oxygen passes through the alveoli, into the capillaries and into the blood. It is carried to the heart and then pumped throughout the body to the tissues and organs. As oxygen is going into the bloodstream, carbon dioxide passes from the blood into the alveoli and then makes its journey out of the body. "}, {"url": "http://study.com/academy/lesson/alveoli-function-definition-sacs.html", "passage_text": "Wendy has taught high school Biology and has a master's degree in education. Alveoli are tiny sacs within our lungs that allow oxygen and carbon dioxide to move between the lungs and bloodstream. Learn more about how they function and quiz your knowledge at the end. "}, {"url": "http://www.nrpt.co.uk/training/body/respiratory/alveoli.htm", "passage_text": "Air enters the body through the nose or mouth, passes through the larynx, down the trachea, and into our lungs. Once it is in your lungs, air goes through a maze of smaller and smaller bronchial tubes until it reaches clusters of tiny sacs the alveoli. In appearance they are somewhat like bunches of grapes. The alveoli are the primary gas exchange units of the lung. Quite simply, they are the point where the gas-blood barrier is thin enough to permit rapid gas exchange."}, {"url": "http://www.answers.com/Q/What_is_the_function_of_the_alveoli_system_of_your_lungs", "passage_text": "Alveoli are tiny sacs in the lungs that perform gas exchange. That is the main process of respiration where the body gets rid of carbon dioxide and picks up oxygen which is us … ed in metabolism.   They have supply of oxygenated and de-oxygenated blood surrounding their surface giving them a high blood supply. The deoxygenated blood from the right side of the Heart is carried to the Lungs. At the level of the Alveoli's, the air exchange takes place where carbon dioxide is excreted and oxygen taken up."}, {"url": "http://hyperphysics.phy-astr.gsu.edu/hbase/ptens2.html", "passage_text": "The oxygen exchange in the lungs takes place across the membranes of small balloon-like structures called alveoli attached to the branches of the bronchial passages. These alveoli inflate and deflate with inhalation and exhalation. The behavior of the alveoli is largely dictated by LaPlace's law and surface tension. "}, {"url": "http://www.answers.com/Q/What_is_the_function_of_the_alveoli_system_of_your_lungs", "passage_text": "The function of the lungs is to Oxygenate the blood so as to ensure constant and effective supply of oxygen to the whole body. The deoxygenated blood from the right side of the Heart is carried to the Lungs. At the level of the Alveoli's, the air exchange takes place where carbon dioxide is excreted and oxygen taken up. This blood is then carried to the left side of the Heart and pumped to the whole body via the Aorta !"}, {"url": "http://www.ehow.com/list_7234440_functions-alveoli-lungs_.html", "passage_text": "Tissue Specifics. It is estimated that the average, healthy adult has over 300 million alveoli. Alveoli are small sacs of tissues in each lung surrounded by capillaries and blood vessels. There is a thin cell layer between the sacs and the surrounding blood vessels. There is also a thin fluid that surrounds the alveoli sac. The fluid and thin cell wall allows air to pass through the cells and into the bloodstream. "}, {"url": "http://www.nrpt.co.uk/training/body/respiratory/alveoli.htm", "passage_text": "Once it is in your lungs, the blood has to get into your blood. The alveoli are the primary gas exchange units of the lung. Quite simply, they are the point where the gas-blood barrier is thin enough to permit rapid gas exchange. To get into the blood, oxygen is diffused through the alveolar epithelium, a thin interstitial space, and the capillary endothelium"}, {"url": "http://philipmelillo.com/respiratorysystem_ep.htm", "passage_text": "Introduction. The respiratory system consists of the nose, nasal cavity, pharynx, larynx, trachea, bronchial tree, and the lungs. Its primary function is the basic exchange of oxygen and carbon dioxide. It filters the air that enters the body and exchanges gases within air sacs in the lungs called alveoli"}]