[{"url": "http://www.tenantengineer.com/fungus.html", "passage_text": "Absidia Species-A zygomycete fungus which is considered common to the indoor environment. Reported to be allergenic. May cause mucorosis in immune compromised individuals. The sites of infection are the lung, nasal sinus, brain, eye, and skin. A Zygomycetes fungus which may be allergenic (skin and bronchial tests) (7, 17). This organism and other Zygomycetes will grow rapidly on most fungal media"}, {"url": "http://www.hopkinsmedicine.org/microbiology/newsletter/Vol26No04Mucor.doc", "passage_text": "Infection of the skin and soft tissues results from traumatic inoculation of the spores into the dermis. The trauma leading to implantation can include venipuncture, spider bites, insulin injection, burns, and surgical wounds, dressings, or splints. Organism. : Mucor is a member of the Zygomycetes, a class of fungi that reproduce sexually by the formation of zygospores, and produce pauciseptate, wide hyphae. The Zygomycetes are subclassified into the orders Enthomophthorales and Mucorales, the latter of which Mucor is a member."}, {"url": "http://mycology.adelaide.edu.au/Mycoses/Subcutaneous/Sporotrichosis/index.html", "passage_text": "Sporotrichosis is primarily a chronic mycotic infection of the cutaneous or subcutaneous tissues and adjacent lymphatics characterized by nodular lesions which may suppurate and ulcerate. Infections are caused by the traumatic implantation of the fungus into the skin, or very rarely, by inhalation into the lungs. "}, {"url": "https://www.homemoldtestkit.com/glossary/", "passage_text": "Absidia sp. — Allergenic. A zygomycete fungus which is considered common to the indoor environment. May cause mucormycosis in immune compromised individuals. The sites of infection are the lung, nasal sinus, brain, eye, and skin. Infection may have multiple sites"}, {"url": "http://infectionnet.org/notes/fungi/", "passage_text": "Fungi. Fungi are eukaryotic, heterotrophic organisms with rigid cell walls that typically reproduce by the production of spores. Characteristic of fungi are their cell walls that may contain chitin (a polymer of N-acetylglucosamine), glucans, mannans and cellulose. The fungi are also unique in their ability to reproduce asexually and /or sexually, in either case, with the subsequent production of spores. The familiar fuzzy colonies of molds are, of course, macroscopic. However, they form microscopic spores that are often the infecting form of the organism either by inhalation or by direct traumatic implantation through the skin."}, {"url": "https://quizlet.com/32869793/microbiology-mycology-flash-cards/", "passage_text": "-infection involves the traumatic implantation of fungi into subcutaneous tissues (splinters, thorns [roses], bites, foreign bodies-commonly occurs in feet, legs, hands, and arms-etiologic agents are usually fungi found in the soil or decaying vegetation-most common disease in the US: sporotrichosis. "}, {"url": "http://www.medscape.com/viewarticle/573254_2", "passage_text": "Hyalohyphomycosis is a broad term used to describe infections caused by an increasing number of heterogeneous fungi. When present in infected tissue like the lung, these molds appear as hyaline (colorless or lightly pigmented), septate, branching filamentous fungi that may be indistinguishable from Aspergillus. "}, {"url": "http://reference.medscape.com/features/slideshow/cfi", "passage_text": "Onychomycosis is a fungal infection of the toenails or fingernails that can be painful, disfiguring, and emotionally disturbing. The most common form, distal subungual, is shown in the image on the left. Note that the fungus invades the nail bed and inflammation occurs. Cutaneous fungal infections are noninvasive infections of the skin, hair, or nails that cause pathologic changes in the host. The fungi can be yeast-like, causing infections such as candidiasis, or mold-like, causing tinea infection"}, {"url": "http://infectionnet.org/notes/fungi/", "passage_text": "These are contracted by the physical traumatic implantation of the fungus and generally remain limited to the area around the inoculation. Examples of subcutaneous fungal infections include: mycetoma, chromoblastomycosis and sporotrichosis. The familiar fuzzy colonies of molds are, of course, macroscopic. However, they form microscopic spores that are often the infecting form of the organism either by inhalation or by direct traumatic implantation through the skin."}]