[{"url": "http://www.mallvibes.com/threads/how-much-do-you-pay-for-a-general-dental-visit.11080/", "passage_text": "I paid $141(not incl. taxes) for my last dental visit, which was basically a dental cleaning and an x-ray. They gave me fluoride ($13) to rinse my mouth after the cleaning but they didn't tell me to not rinse my mouth with water after, but I did, so there went $13 down the drain... Literally!! I was so annoyed. "}, {"url": "https://www.debt.org/medical/doctor-visit-costs/", "passage_text": "For example, in 2011 in America, the average charge for an office visit for an established patient, level 3, requiring approximately 15 minutes with a doctor, was $104. The average total paid was $69. "}, {"url": "http://health.costhelper.com/dentistry.html", "passage_text": "1 An office visit can cost $50 -$350 or more, depending on what's included. 2  A standard teeth cleaning can cost $70 -$200; dental X-rays can cost $20-$250 or more; and an exam by a dentist can be $50-$150 or more. 3  Some or all of these costs may be covered by dental insurance. 1 Dental crowns can cost $500-$1,500 or more per tooth for porcelain-fused-to-metal crowns; $600-$2,500 or more for gold or other metal alloys; and $800-$3,000 or more for all-porcelain. 2  Crowns are not covered by insurance if they can be considered cosmetic."}, {"url": "https://answers.yahoo.com/question/index?qid=20071229003156AAmaGvc", "passage_text": "Report Abuse. I can't believe your parents/guardians never took you for a dental visit... good for you that you've made the decision to go! In my office, a comprehensive exam, full set of xrays and routine cleaning would cost $240, with a 10% discount since you don't have dental insurance."}, {"url": "http://health.costhelper.com/dentistry.html", "passage_text": "1 Some or all of these costs may be covered by dental insurance. 2  Filling a cavity can cost $50-$300 or more for a silver amalgam filling, and $90-$450 or more for a tooth-colored composite; insurance typically covers all or most of the cost of amalgam fillings, but only part of the composite filling cost. 1 Dental crowns can cost $500-$1,500 or more per tooth for porcelain-fused-to-metal crowns; $600-$2,500 or more for gold or other metal alloys; and $800-$3,000 or more for all-porcelain. 2  Crowns are not covered by insurance if they can be considered cosmetic."}, {"url": "http://health.costhelper.com/cavity-filling.html", "passage_text": "1 For example, CostHelper readers without dental insurance report paying $90-$350 for a composite filling, at an average cost of $204; CostHelper readers with dental insurance report paying $63-$300 out of pocket for a composite filling, at an average cost of $207. Charged for adjustments of fillings at $150 each and a $300 final adjustment charge.and $250 per filling. This does not in;ude the cost of xrays, visit, consultation etc. They also never gave us any options or the costs upfront."}, {"url": "http://www.howmuchisit.org/dental-visit-cost/", "passage_text": "1 The cost of a dental visit will depend on whether you have dental insurance or not. 2  The price of a visit to a dentist can be anywhere from $100 to $200 depending on what you need. 3  Some dentists charge $90 for an appointment, and others may charge $75 for the first exam. 1 Some dentists charge $90 for an appointment, and others may charge $75 for the first exam. 2  If you just need to see the dentist to ask questions, plan on spending $50 to $90. 3  However, if a cleaning, x-rays or a simple procedure needs to be done, the costs can hover around $100 to as much as $225."}, {"url": "http://memberbenefits.com/dental-costs-with-and-without-insurance/", "passage_text": "Common check-up and cleaning costs vary. Dentists charge different rates depending upon your situation and where you live. In most places, an average check-up costs about $288, which covers an exam, x-rays and cleaning. Fillings, while more expensive than basic dental check-ups, both fix cavities and protect your mouth’s future health. Most filling treatments hold stable prices in the following ranges: 1  $50 to $150 for a single, silver amalgam filling."}, {"url": "http://www.howmuchisit.org/dental-visit-cost/", "passage_text": "1 The price of a visit to a dentist can be anywhere from $100 to $200 depending on what you need. 2  Some dentists charge $90 for an appointment, and others may charge $75 for the first exam. 3  If you just need to see the dentist to ask questions, plan on spending $50 to $90. 1 Some dentists charge $90 for an appointment, and others may charge $75 for the first exam. 2  If you just need to see the dentist to ask questions, plan on spending $50 to $90. 3  However, if a cleaning, x-rays or a simple procedure needs to be done, the costs can hover around $100 to as much as $225."}]