[{"url": "http://www.nhs.uk/Conditions/Haemophilia/Pages/Introduction.aspx", "passage_text": "Introduction. Haemophilia is an inherited condition that affects the blood's ability to clot. Normally, when you cut yourself, substances in the blood known as clotting factors combine with blood cells called platelets to make the blood sticky. This makes the bleeding stop eventually."}, {"url": "http://ghr.nlm.nih.gov/condition/hemophilia", "passage_text": "Hemophilia is a bleeding disorder that slows the blood clotting process. People with this condition experience prolonged bleeding or oozing following an injury, surgery, or having a tooth pulled."}, {"url": "https://www.nhlbi.nih.gov/health/health-topics/topics/hemophilia/", "passage_text": "Hemophilia (heem-o-FILL-ee-ah) is a rare bleeding disorder in which the blood doesn't clot normally. If you have hemophilia, you may bleed for a longer time than others after an injury. You also may bleed inside your body (internally), especially in your knees, ankles, and elbows."}, {"url": "http://www.healthgrades.com/conditions/hemophilia", "passage_text": "Hemophilia is a rare genetic disorder that limits the blood’s ability to clot. This condition can cause prolonged or excessive bleeding, which may occur spontaneously or following an injury or medical or dental procedure. Hemophilia is usually inherited from parents who have hemophilia or carry the abnormal gene."}, {"url": "http://my.clevelandclinic.org/health/diseases_conditions/hic_What_is_Hemophilia", "passage_text": "Hemophilia is a rare hereditary (inherited) bleeding disorder in which blood cannot clot normally at the site of a wound or injury. The disorder occurs because certain blood clotting factors are missing or do not work properly. This can cause extended bleeding from a cut or wound."}, {"url": "http://www.ncbi.nlm.nih.gov/gtr/conditions/C0684275/", "passage_text": "Hemophilia is a bleeding disorder that slows the blood clotting process. People with this condition experience prolonged bleeding or oozing following an injury, surgery, or having a tooth pulled."}, {"url": "http://my.clevelandclinic.org/health/diseases_conditions/hic_What_is_Hemophilia", "passage_text": "There are two types of inherited hemophilia: 1  Type A, the most common type, is caused by a deficiency of factor VIII, one of the proteins that helps blood to form clots. 2  Type B hemophilia is caused by a deficiency of factor IX."}]