[{"url": "http://republicofdoyle.wikia.com/wiki/Jake_Doyle", "passage_text": "Portrayed by. Allan Hawco. Jake Doyle is the youngest son of Malachy and Mary Ann Doyle and the main character of the television series Republic of Doyle. He was supposedly the father of Sloan Daniels until they reveal in season 6 she forged the blood tests."}, {"url": "http://republicofdoyle.wikia.com/wiki/Jake_Doyle", "passage_text": "Allan Hawco. Jake Doyle is the youngest son of Malachy and Mary Ann Doyle and the main character of the television series Republic of Doyle. He was supposedly the father of Sloan Daniels until they reveal in season 6 she forged the blood tests."}, {"url": "http://www.cbc.ca/news/canada/newfoundland-labrador/jake-doyle-s-last-ride-social-media-reacts-to-republic-of-doyle-finale-1.2869261", "passage_text": "If you didn't catch last night's episode of Republic of Doyle, do not read! After six successful seasons, Republic of Doyle 's final two-hour episode aired Wednesday night. The episode saw Jake and Leslie battling it out with the Chevaliers and corrupt politicians one last time."}, {"url": "http://www.cbc.ca/news/canada/newfoundland-labrador/jake-doyle-s-last-ride-social-media-reacts-to-republic-of-doyle-finale-1.2869261", "passage_text": "One of the photos shared on social media shows a devoted fan with a Republic of Doyle tattoo. (Instagram). Geoff Bartlett. CBC News. Geoff Bartlett is a journalist with CBC News in St. John's."}, {"url": "http://www.cbc.ca/news/canada/newfoundland-labrador/jake-doyle-s-last-ride-social-media-reacts-to-republic-of-doyle-finale-1.2869261", "passage_text": "SPOILER ALERT! If you didn't catch last night's episode of Republic of Doyle, do not read! After six successful seasons, Republic of Doyle 's final two-hour episode aired Wednesday night. The episode saw Jake and Leslie battling it out with the Chevaliers and corrupt politicians one last time."}, {"url": "http://www.cbc.ca/news/canada/newfoundland-labrador/jake-doyle-s-last-ride-social-media-reacts-to-republic-of-doyle-finale-1.2869261", "passage_text": "Mal then turns to Jake and asks him if he is happy. Doyle replies: I wish this moment would never end.. A collective me either could almost be heard from the many fans of the St. John's-based show who tuned in on Wednesday night. Viewers took to social media, as they always did, throughout the final two episodes."}, {"url": "http://tvtropes.org/pmwiki/pmwiki.php/Series/RepublicOfDoyle", "passage_text": "Oh yeah-ee-yeah-ee-yeah-ee-yeah!! Republic of Doyle is a Canadian Private Detective Buddy Cop Show airing on the CBC. It follows the lives and cases of the Doyle & Doyle private detective agency in St. John's, Newfoundland, headed by Jake Doyle, his father Malachy, and Malachy's girlfriend Rose."}]