[{"url": "http://www.pomskypuppies.us/", "passage_text": "The Pomsky breed. Unfortunately, Petfinder.com doesn’t recognize Pomsky as a breed. This is because Pomskies are not an actual breed of dog. They are a hybrid. To be recognized as a new breed, the new breed must be descended from three separate breeds of dog. The hybrid is the first step. Pomskies make great family pets. A Pomsky puppy makes a great therapy dog, and they respond well to people with autism. They also make excellent guard dogs, and will alert you to someone approaching the door long before the person arrives. They have strong, loud barks that are not annoying."}, {"url": "http://pomskyhq.com/", "passage_text": "Thank you for taking the time to visit our site devoted to Pomskies. We are striving to become the definitive go-to source for all your information needs and intend to build a community for Pomsky owners and those interested in learning more about this breed. If you are looking for pomsky puppies for sale, here is our directory of pomsky breeders. The Pomsky Club of America states that first generation Pomskies have coats similar to a husky and that they are “medium to low shedders” that can be controlled with “regular brushing.”. Pomeranians are prone to dental problems and the build-up of plaque and tooth loss can cause serious problems."}, {"url": "http://www.petguide.com/breeds/dog/pomsky/", "passage_text": "Origin. Pomskies are a relatively new breed of ‘designer dog’ that is gaining rapid popularity across North America and Europe. Pomsky puppies are still quite rare and you can expect to dish out more than $1000 dollars (to start) for one. More often than not, Pomskies inherit the desirable traits from both Siberian Huskies and Pomeranians. A Pomsky puppy is without a doubt one of the most dangerous sights a dog lover could ever lay eyes upon. Simply because of the fact they are so darn cute."}, {"url": "http://pomskyhq.com/", "passage_text": "This is just an introduction into the world of Pomskies and Pomsky puppies for sale. We hope that you will continue to explore this site and learn more about these precious animals. If you have any questions or suggestions as to content, please contact us with your constructive feedback. Thank you. The Pomsky Club of America states that first generation Pomskies have coats similar to a husky and that they are “medium to low shedders” that can be controlled with “regular brushing.”. Pomeranians are prone to dental problems and the build-up of plaque and tooth loss can cause serious problems."}, {"url": "http://arcticdesignpomskies.webs.com/what-is-a-pomsky", "passage_text": "They do seem to make better watch dogs than huskies and are very affectionate like the Pomeranian. Also like the Pomeranian our Pomskies tends to be very focused on us its owners and enjoys love and praise. However unlike my Pomeranians our Pomskies do like to go off and find there own space after some snuggle time. Most Pomskies will howl/talk the way that huskies do but not as much. They also love to run and require daily walks or a nice round of fetch in the back yard. 1st generation Pomskies are all averaging 15-20 lbs fully grown and come in a rainbow of colors."}, {"url": "http://www.petguide.com/breeds/dog/pomsky/", "passage_text": "Pomskies are highly intelligent and respond well to reward based training methods. More often than not, Pomskies inherit the desirable traits from both Siberian Huskies and Pomeranians. A Pomsky puppy is without a doubt one of the most dangerous sights a dog lover could ever lay eyes upon. Simply because of the fact they are so darn cute. One of the more recent additions to the designer dog arena, Pomskies are a result of a crossing between a Siberian Husky and a Pomeranian"}, {"url": "http://pomskypals.com/breeders/middle-tennessee-pomskies/", "passage_text": "They offer shipping to the continental 48 United States for $300 and Canada for $500. Middle Tennessee Pomskies make all the arrangements. The new puppy owner will only need to provide a photo ID when picking up their new friend from the airport. The photos are high quality and very descriptive. They have gone the extra mile and even made a VIP (Very Important Pomskies) page. It is a community page where new Pomsky owners can get to know one another, post pictures, ask questions, and more."}, {"url": "http://arcticdesignpomskies.webs.com/what-is-a-pomsky", "passage_text": "They exhibit traits from both breeds.If you have ever owned one or the other or maybe even both Huskies and Pomeranians you will find it fascinating to see these traits in your Pomsky. They can have any combination of these traits. We find our Pomskies to be very smart agile little dogs. Most Pomskies will howl/talk the way that huskies do but not as much. They also love to run and require daily walks or a nice round of fetch in the back yard. 1st generation Pomskies are all averaging 15-20 lbs fully grown and come in a rainbow of colors."}, {"url": "http://pomskypals.com/breeders/middle-tennessee-pomskies/", "passage_text": "I’ve even seen them post ultrasound photos when Pomsky pups are on the way. Middle Tennessee Pomskies as a breeder are very committed to getting photos and videos of their new puppies out. The photos are high quality and very descriptive. They have gone the extra mile and even made a VIP (Very Important Pomskies) page. It is a community page where new Pomsky owners can get to know one another, post pictures, ask questions, and more. This page is an invite only and applicants must own a Middle Tennessee Pomsky to qualify"}]