[{"url": "http://www.patriot-home-sales.com/", "passage_text": "No problem-we’re here to serve you today and tomorrow. Currently, we build Custom Modular Homes under the brand names Pennwest Homes, Colony Homes, Commodore Homes and Ritz-Craft Custom Homes. Additionally we are a retailer for Manufactured Homes manufactured by Colony Homes, Commodore Homes and Eagle River Homes. Our model homes are built to replicate real world situations. We display Ranch Style, Cape Cod Style and Two Story Homes. Our expert sales staff is available during all business hours to assist you with any questions. At Patriot Home Sales, Inc. we pride ourselves in the NO HASSLE-NO PRESSURE sales approach."}, {"url": "http://www.modularhomesnetwork.com/Manufacturers/Patriot-Homes.asp", "passage_text": "The building centers operate under the names of EnergyMate Homes, Crystal Valley Homes, Patriot Homes of Texas, and Patriot Homes of Alabama. In addition to single and multi-section HUD-code manufactured homes, the company produces modular (state-code) homes in ranch and two-story models. With its corporate headquarters in Elkhart, Indiana. Patriot Homes has been actively involved in improving standards for HUD-code manufactured housing across the industry."}, {"url": "http://www.mobilehome.net/manufacturer_history/patriot_homes.htm", "passage_text": "The Patriot Homes Division of Patriot Homes, Inc. was founded in December 1972 by Samuel V. Weidner, Sr. Patriot Homes manufactures single section homes. "}, {"url": "http://www.patriothomes.biz/About_Us/about_us.html", "passage_text": "1 Patriot displays Modular Homes. 2  Patriot displays both new and preowned single and doublewide Manufactured Homes (often referred to as Mobile Homes). 3  Personable salespersons-no high pressure sales tactics-to make your home purchasing experience a pleasant one. 1 Patriot started in business in March of 1985 - 22 years! 2  Patriot employees have a combined 150+ years experience in the manufactured housing and modular home industries. 3  Patriot has a fleet of set up equipment and trucks, service trucks, and delivery trucks."}, {"url": "http://www.homesight.org/edu/patriot_manufactured_homes.html", "passage_text": "Since then they have become a leader in the building of manufactured and modular homes. Patriot manufactured homes have four production facilities and employ more than 750 people. Their building centers go under the names of Patriot Homes of Texas, Patriot Homes of Alabama, Energy Mate Homes and Crystal Valley Homes. Patriot manufactured homes not only manufacturers since and multi section manufactured homes, but they also produce modular homes in both a two story and ranch style. The premise behind Patriot manufactured homes is classic styling, outstanding service and solid construction. Their homes are known for their excellent resale value, which speaks for itself. Patriot manufactured homes offer a very strong warranty. Their home warranties are one of the strongest in the entire industry."}, {"url": "http://www.patriothomes.biz/About_Us/about_us.html", "passage_text": "1 Patriot can custom design and build your new modular home. 2  Patriot displays Modular Homes. 3  Patriot displays both new and preowned single and doublewide Manufactured Homes (often referred to as Mobile Homes). 4  Personable salespersons-no high pressure sales tactics-to make your home purchasing experience a pleasant one. 1 Patriot started in business in March of 1985 - 22 years! 2  Patriot employees have a combined 150+ years experience in the manufactured housing and modular home industries. 3  Patriot has a fleet of set up equipment and trucks, service trucks, and delivery trucks."}, {"url": "http://www.patriot-home-sales.com/", "passage_text": "Welcome to Patriot Home Sales Inc., your one stop Custom Modular Home Builder and Manufactured Home Retailer. Located in southeastern Pennsylvania, we proudly serve Pennsylvania, New Jersey, Maryland, Delaware, the Mid-Atlantic Coastal Communities and West Virginia. Our model homes are built to replicate real world situations. We display Ranch Style, Cape Cod Style and Two Story Homes. Our expert sales staff is available during all business hours to assist you with any questions. At Patriot Home Sales, Inc. we pride ourselves in the NO HASSLE-NO PRESSURE sales approach."}, {"url": "http://www.mobilehome.net/manufacturer_history/patriot_homes_inc.htm", "passage_text": "PATRIOT HOMES, INC. Patriot Homes, Inc. was founded in December 1972 by Samuel V. Weidner, Sr. in Elkhart, Indiana. He retains his role as president. The company produces a full line of manufactured housing in single, double and multiple sections, including modulars. The company started manufacturing single-section homes at a facility on County Road 3 South, which is now the Patriot Homes Division. The first expansion in 1981 was the EnergyMate Division, which manufactures sectional homes, state code modulars, cape cods and two story homes. In 1984, Patriot Homes, Inc. acquired a plant in Shipshewana, Indiana and established Lincoln Park Division."}, {"url": "http://www.mobilehome.net/manufacturer_history/patriot_homes_inc.htm", "passage_text": "In 1993, Patriot Homes Inc. acquired two plant facilities in Waco, Texas, forming Patriot Homes of Texas with a product line of single-and multi-section HUD homes. The first expansion in 1981 was the EnergyMate Division, which manufactures sectional homes, state code modulars, cape cods and two story homes. In 1984, Patriot Homes, Inc. acquired a plant in Shipshewana, Indiana and established Lincoln Park Division."}, {"url": "http://www.patriotmodulars.com/", "passage_text": "Ritz-Craft Modular Homes Built By Patriot Home Sales, where the Mid-Atlantic’s finest quality home building workmanship meets custom design and affordability. At Patriot Home Sales we have been Pennsylvania, New Jersey, Maryland and Delaware’s leading complete customization modular home builder since 1985. Our Model Center and Design Center located in Lancaster, Pennsylvania contains twenty two fully furnished and decorated model homes"}]